{"position": "Senior Sales Manager", "company": "Google", "profiles": ["Experience Head of Services & Distribution Solutions - Data & Analytics at Google Google April 2014  – Present (1 year 5 months) San Francisco Bay Area Head up the strategy, sales & management for Google Analytics Premium tied to this Sector. Service & Distribution Solutions includes clients across many verticals in the US, including Technology, Education, Social, Business Industrial Markets, Local, and Government.  Head of New Business Sales, West - Google Analytics Premium Google November 2013  – Present (1 year 10 months) San Francisco Senior Account Executive, DoubleClick Google October 2010  – Present (4 years 11 months) Responsible for selling DoubleClick's advertiser solutions to advertisers and agencies on the West Coast. Vertical Sales Manager Google April 2008  – Present (7 years 5 months) Co-managed a sales team responsible for $500M annualized revenue within the Local and Classifieds vertical. AdWords Account Strategist Google January 2007  –  March 2008  (1 year 3 months) AdWords Account Associate Google January 2005  –  January 2006  (1 year 1 month) AdWords Coordinator Google February 2004  –  January 2005  (1 year) AdWords Representative Google October 2003  –  February 2004  (5 months) Head of Services & Distribution Solutions - Data & Analytics at Google Google April 2014  – Present (1 year 5 months) San Francisco Bay Area Head up the strategy, sales & management for Google Analytics Premium tied to this Sector. Service & Distribution Solutions includes clients across many verticals in the US, including Technology, Education, Social, Business Industrial Markets, Local, and Government.  Head of Services & Distribution Solutions - Data & Analytics at Google Google April 2014  – Present (1 year 5 months) San Francisco Bay Area Head up the strategy, sales & management for Google Analytics Premium tied to this Sector. Service & Distribution Solutions includes clients across many verticals in the US, including Technology, Education, Social, Business Industrial Markets, Local, and Government.  Head of New Business Sales, West - Google Analytics Premium Google November 2013  – Present (1 year 10 months) San Francisco Head of New Business Sales, West - Google Analytics Premium Google November 2013  – Present (1 year 10 months) San Francisco Senior Account Executive, DoubleClick Google October 2010  – Present (4 years 11 months) Responsible for selling DoubleClick's advertiser solutions to advertisers and agencies on the West Coast. Senior Account Executive, DoubleClick Google October 2010  – Present (4 years 11 months) Responsible for selling DoubleClick's advertiser solutions to advertisers and agencies on the West Coast. Vertical Sales Manager Google April 2008  – Present (7 years 5 months) Co-managed a sales team responsible for $500M annualized revenue within the Local and Classifieds vertical. Vertical Sales Manager Google April 2008  – Present (7 years 5 months) Co-managed a sales team responsible for $500M annualized revenue within the Local and Classifieds vertical. AdWords Account Strategist Google January 2007  –  March 2008  (1 year 3 months) AdWords Account Strategist Google January 2007  –  March 2008  (1 year 3 months) AdWords Account Associate Google January 2005  –  January 2006  (1 year 1 month) AdWords Account Associate Google January 2005  –  January 2006  (1 year 1 month) AdWords Coordinator Google February 2004  –  January 2005  (1 year) AdWords Coordinator Google February 2004  –  January 2005  (1 year) AdWords Representative Google October 2003  –  February 2004  (5 months) AdWords Representative Google October 2003  –  February 2004  (5 months) Skills Google Adwords SEM DoubleClick Advertising Online Advertising Web Analytics Google Analytics PPC Digital Marketing Social Media Marketing Digital Strategy Skills  Google Adwords SEM DoubleClick Advertising Online Advertising Web Analytics Google Analytics PPC Digital Marketing Social Media Marketing Digital Strategy Google Adwords SEM DoubleClick Advertising Online Advertising Web Analytics Google Analytics PPC Digital Marketing Social Media Marketing Digital Strategy Google Adwords SEM DoubleClick Advertising Online Advertising Web Analytics Google Analytics PPC Digital Marketing Social Media Marketing Digital Strategy Education Santa Clara University Bachelor of Arts,  Communication 1999  – 2003 Activities and Societies:  Santa Clara Women's Volleyball Team Santa Clara University Bachelor of Arts,  Communication 1999  – 2003 Activities and Societies:  Santa Clara Women's Volleyball Team Santa Clara University Bachelor of Arts,  Communication 1999  – 2003 Activities and Societies:  Santa Clara Women's Volleyball Team Santa Clara University Bachelor of Arts,  Communication 1999  – 2003 Activities and Societies:  Santa Clara Women's Volleyball Team ", "Summary Apasionada por comunicar y apoyar a las organizaciones en adoptar prácticas de innovación y transformación en el entorno empresarial. Gracias a los avances que trae una era digital más y más empresas están adoptando nuevas prácticas que impactan a las personas, cultura y procesos de manera muy positiva. \n \nActualmente trabajando en Google México, liderando y comunicando una visión que acota la brecha que existe entre el mundo empresarial y la forma como vivimos.  \n \nCon más de 13 años de experiencia en compañías de tecnología en áreas enfocadas a ventas, mercadeo, servicios y desarrollo de canales y alianzas. \n \n \n Summary Apasionada por comunicar y apoyar a las organizaciones en adoptar prácticas de innovación y transformación en el entorno empresarial. Gracias a los avances que trae una era digital más y más empresas están adoptando nuevas prácticas que impactan a las personas, cultura y procesos de manera muy positiva. \n \nActualmente trabajando en Google México, liderando y comunicando una visión que acota la brecha que existe entre el mundo empresarial y la forma como vivimos.  \n \nCon más de 13 años de experiencia en compañías de tecnología en áreas enfocadas a ventas, mercadeo, servicios y desarrollo de canales y alianzas. \n \n \n Apasionada por comunicar y apoyar a las organizaciones en adoptar prácticas de innovación y transformación en el entorno empresarial. Gracias a los avances que trae una era digital más y más empresas están adoptando nuevas prácticas que impactan a las personas, cultura y procesos de manera muy positiva. \n \nActualmente trabajando en Google México, liderando y comunicando una visión que acota la brecha que existe entre el mundo empresarial y la forma como vivimos.  \n \nCon más de 13 años de experiencia en compañías de tecnología en áreas enfocadas a ventas, mercadeo, servicios y desarrollo de canales y alianzas. \n \n \n Apasionada por comunicar y apoyar a las organizaciones en adoptar prácticas de innovación y transformación en el entorno empresarial. Gracias a los avances que trae una era digital más y más empresas están adoptando nuevas prácticas que impactan a las personas, cultura y procesos de manera muy positiva. \n \nActualmente trabajando en Google México, liderando y comunicando una visión que acota la brecha que existe entre el mundo empresarial y la forma como vivimos.  \n \nCon más de 13 años de experiencia en compañías de tecnología en áreas enfocadas a ventas, mercadeo, servicios y desarrollo de canales y alianzas. \n \n \n Experience Sales Manager Corporate Sector Google for Work Google January 2015  – Present (8 months) Chile LCS Partner Success Manager, Google for Work Google February 2013  –  December 2014  (1 year 11 months) Spanish LATAM SMB Sales Manager McAfee 2012  –  2013  (1 year) Colombia, Argentina, Chile, Central America, Caribbean, Perú, Ecuador Multi Country Area Channel Manager Oracle June 2011  –  2012  (1 year) Central America, Caribbean, Perú, Ecuador, Uruguay Systems Sales Rep Oracle July 2010  –  2011  (1 year) Central America Multi Country Area Channel Manager Sun Microsystems September 2007  –  2010  (3 years) Perú, Uruguay, Central America, Caribbean, Colombia Managed Services Sales Representative Sun Microsystems August 2005  –  September 2007  (2 years 2 months) Colombia, Central America and Caribbean Countries Sun Learning Services - Sales and Manager Sun Microsystems February 2002  –  July 2005  (3 years 6 months) Central America and Caribbean Countries Sales Manager Corporate Sector Google for Work Google January 2015  – Present (8 months) Chile Sales Manager Corporate Sector Google for Work Google January 2015  – Present (8 months) Chile LCS Partner Success Manager, Google for Work Google February 2013  –  December 2014  (1 year 11 months) Spanish LATAM LCS Partner Success Manager, Google for Work Google February 2013  –  December 2014  (1 year 11 months) Spanish LATAM SMB Sales Manager McAfee 2012  –  2013  (1 year) Colombia, Argentina, Chile, Central America, Caribbean, Perú, Ecuador SMB Sales Manager McAfee 2012  –  2013  (1 year) Colombia, Argentina, Chile, Central America, Caribbean, Perú, Ecuador Multi Country Area Channel Manager Oracle June 2011  –  2012  (1 year) Central America, Caribbean, Perú, Ecuador, Uruguay Multi Country Area Channel Manager Oracle June 2011  –  2012  (1 year) Central America, Caribbean, Perú, Ecuador, Uruguay Systems Sales Rep Oracle July 2010  –  2011  (1 year) Central America Systems Sales Rep Oracle July 2010  –  2011  (1 year) Central America Multi Country Area Channel Manager Sun Microsystems September 2007  –  2010  (3 years) Perú, Uruguay, Central America, Caribbean, Colombia Multi Country Area Channel Manager Sun Microsystems September 2007  –  2010  (3 years) Perú, Uruguay, Central America, Caribbean, Colombia Managed Services Sales Representative Sun Microsystems August 2005  –  September 2007  (2 years 2 months) Colombia, Central America and Caribbean Countries Managed Services Sales Representative Sun Microsystems August 2005  –  September 2007  (2 years 2 months) Colombia, Central America and Caribbean Countries Sun Learning Services - Sales and Manager Sun Microsystems February 2002  –  July 2005  (3 years 6 months) Central America and Caribbean Countries Sun Learning Services - Sales and Manager Sun Microsystems February 2002  –  July 2005  (3 years 6 months) Central America and Caribbean Countries Skills Cloud Computing Solution Selling Channel Partners Business Alliances Enterprise Software SaaS Partner Management Sales Management Go-to-market Strategy Team Leadership Business Strategy Software Industry Sales Professional Services Sales Process Strategic Partnerships Sales Enablement Demand Generation See 3+     See less Skills  Cloud Computing Solution Selling Channel Partners Business Alliances Enterprise Software SaaS Partner Management Sales Management Go-to-market Strategy Team Leadership Business Strategy Software Industry Sales Professional Services Sales Process Strategic Partnerships Sales Enablement Demand Generation See 3+     See less Cloud Computing Solution Selling Channel Partners Business Alliances Enterprise Software SaaS Partner Management Sales Management Go-to-market Strategy Team Leadership Business Strategy Software Industry Sales Professional Services Sales Process Strategic Partnerships Sales Enablement Demand Generation See 3+     See less Cloud Computing Solution Selling Channel Partners Business Alliances Enterprise Software SaaS Partner Management Sales Management Go-to-market Strategy Team Leadership Business Strategy Software Industry Sales Professional Services Sales Process Strategic Partnerships Sales Enablement Demand Generation See 3+     See less Education Universidad de los Andes Industrial Engineer 2003 Marymount 1998 Universidad de los Andes Industrial Engineer 2003 Universidad de los Andes Industrial Engineer 2003 Universidad de los Andes Industrial Engineer 2003 Marymount 1998 Marymount 1998 Marymount 1998 ", "Languages Spanish English Portuguese Spanish English Portuguese Spanish English Portuguese Skills Direct Sales Channel Management Sales Management Inside Sales Fluent English Spanish Portuguese IP Networking Storage Solutions Data Security Virtualization Solutions Cloud Computing Channel Partners English Virtualization Skills  Direct Sales Channel Management Sales Management Inside Sales Fluent English Spanish Portuguese IP Networking Storage Solutions Data Security Virtualization Solutions Cloud Computing Channel Partners English Virtualization Direct Sales Channel Management Sales Management Inside Sales Fluent English Spanish Portuguese IP Networking Storage Solutions Data Security Virtualization Solutions Cloud Computing Channel Partners English Virtualization Direct Sales Channel Management Sales Management Inside Sales Fluent English Spanish Portuguese IP Networking Storage Solutions Data Security Virtualization Solutions Cloud Computing Channel Partners English Virtualization ", "Experience Regional Sales Manager, EMEA Vendor Operations Google Ireland Ltd. November 2012  – Present (2 years 10 months) Dublin Enterprise Manager - EMEA Google January 2011  –  October 2012  (1 year 10 months) Dublin Sales Manager (Emerging Markets) Google Ireland Ltd Google Ireland Ltd. October 2009  –  December 2010  (1 year 3 months) UK & Ireland Sales Manager Google October 2005  –  September 2009  (4 years) New Business Acquisition Oracle Corporation June 2004  –  October 2005  (1 year 5 months) Internal Account Manager Dell September 2003  –  May 2004  (9 months) Dublin SAP Basis Consultant SAP January 1997  –  August 2003  (6 years 8 months) Dublin Regional Sales Manager, EMEA Vendor Operations Google Ireland Ltd. November 2012  – Present (2 years 10 months) Dublin Regional Sales Manager, EMEA Vendor Operations Google Ireland Ltd. November 2012  – Present (2 years 10 months) Dublin Enterprise Manager - EMEA Google January 2011  –  October 2012  (1 year 10 months) Dublin Enterprise Manager - EMEA Google January 2011  –  October 2012  (1 year 10 months) Dublin Sales Manager (Emerging Markets) Google Ireland Ltd Google Ireland Ltd. October 2009  –  December 2010  (1 year 3 months) Sales Manager (Emerging Markets) Google Ireland Ltd Google Ireland Ltd. October 2009  –  December 2010  (1 year 3 months) UK & Ireland Sales Manager Google October 2005  –  September 2009  (4 years) UK & Ireland Sales Manager Google October 2005  –  September 2009  (4 years) New Business Acquisition Oracle Corporation June 2004  –  October 2005  (1 year 5 months) New Business Acquisition Oracle Corporation June 2004  –  October 2005  (1 year 5 months) Internal Account Manager Dell September 2003  –  May 2004  (9 months) Dublin Internal Account Manager Dell September 2003  –  May 2004  (9 months) Dublin SAP Basis Consultant SAP January 1997  –  August 2003  (6 years 8 months) Dublin SAP Basis Consultant SAP January 1997  –  August 2003  (6 years 8 months) Dublin Skills Coaching Interviewing Team Building People Management Mentoring Sales Operations Teamwork Account Management Sales Management Customer Relations Key Account Management New Business Development Channel Online Advertising International Sales Channel Management Team Management Lead Generation Cloud Computing Online Marketing Team Leadership Strategic Partnerships Advertising Sales Business Planning Customer Retention Sales Recruitment Business Management Consultancy Sales Enablement Advertising Forecasting Cold Calling Problem Solving Management E-commerce Recruiting Enterprise Software Negotiation SaaS Channel Partners Salesforce.com Interviews Customer Service Strategy Pre-sales Start-ups Consulting Direct Sales CRM See 34+     See less Skills  Coaching Interviewing Team Building People Management Mentoring Sales Operations Teamwork Account Management Sales Management Customer Relations Key Account Management New Business Development Channel Online Advertising International Sales Channel Management Team Management Lead Generation Cloud Computing Online Marketing Team Leadership Strategic Partnerships Advertising Sales Business Planning Customer Retention Sales Recruitment Business Management Consultancy Sales Enablement Advertising Forecasting Cold Calling Problem Solving Management E-commerce Recruiting Enterprise Software Negotiation SaaS Channel Partners Salesforce.com Interviews Customer Service Strategy Pre-sales Start-ups Consulting Direct Sales CRM See 34+     See less Coaching Interviewing Team Building People Management Mentoring Sales Operations Teamwork Account Management Sales Management Customer Relations Key Account Management New Business Development Channel Online Advertising International Sales Channel Management Team Management Lead Generation Cloud Computing Online Marketing Team Leadership Strategic Partnerships Advertising Sales Business Planning Customer Retention Sales Recruitment Business Management Consultancy Sales Enablement Advertising Forecasting Cold Calling Problem Solving Management E-commerce Recruiting Enterprise Software Negotiation SaaS Channel Partners Salesforce.com Interviews Customer Service Strategy Pre-sales Start-ups Consulting Direct Sales CRM See 34+     See less Coaching Interviewing Team Building People Management Mentoring Sales Operations Teamwork Account Management Sales Management Customer Relations Key Account Management New Business Development Channel Online Advertising International Sales Channel Management Team Management Lead Generation Cloud Computing Online Marketing Team Leadership Strategic Partnerships Advertising Sales Business Planning Customer Retention Sales Recruitment Business Management Consultancy Sales Enablement Advertising Forecasting Cold Calling Problem Solving Management E-commerce Recruiting Enterprise Software Negotiation SaaS Channel Partners Salesforce.com Interviews Customer Service Strategy Pre-sales Start-ups Consulting Direct Sales CRM See 34+     See less Education UCD Michael Smurfit Graduate Business School Master's Degree 2013  – 2014 Dublin City University B.Sc. 1991  – 1995 Terenure College 1980  – 1991 UCD Michael Smurfit Graduate Business School Master's Degree 2013  – 2014 UCD Michael Smurfit Graduate Business School Master's Degree 2013  – 2014 UCD Michael Smurfit Graduate Business School Master's Degree 2013  – 2014 Dublin City University B.Sc. 1991  – 1995 Dublin City University B.Sc. 1991  – 1995 Dublin City University B.Sc. 1991  – 1995 Terenure College 1980  – 1991 Terenure College 1980  – 1991 Terenure College 1980  – 1991 Honors & Awards VP Award Senior Vice President - Google SMB December 2013 Driving operation of the external vendor team to support internal SMB Sales organization. 'Be the Best' award at European sales conference awards EMEA Senior VP September 2006 Winner of ‘ISO People Manager’ award EMEA Director March 2009 Graduate of prestigious Mercury program in 2007 April 2007 VP Award Senior Vice President - Google SMB December 2013 Driving operation of the external vendor team to support internal SMB Sales organization. VP Award Senior Vice President - Google SMB December 2013 Driving operation of the external vendor team to support internal SMB Sales organization. VP Award Senior Vice President - Google SMB December 2013 Driving operation of the external vendor team to support internal SMB Sales organization. 'Be the Best' award at European sales conference awards EMEA Senior VP September 2006 'Be the Best' award at European sales conference awards EMEA Senior VP September 2006 'Be the Best' award at European sales conference awards EMEA Senior VP September 2006 Winner of ‘ISO People Manager’ award EMEA Director March 2009 Winner of ‘ISO People Manager’ award EMEA Director March 2009 Winner of ‘ISO People Manager’ award EMEA Director March 2009 Graduate of prestigious Mercury program in 2007 April 2007 Graduate of prestigious Mercury program in 2007 April 2007 Graduate of prestigious Mercury program in 2007 April 2007 ", "Summary Enterprise sales manager focus on solving complex business challenges and delivery innovation through Google Enterprise platform. Activities: sales, customer success planning, partner management, team builder and marketing approach.  \n \nSpecialties:  \nCloud computing \nRetail \nCollaboration \nDevelop sales process  \nComplex deals \nValue added solutions \nTraining partners \nFinance and accounting basics  \nEntrepreneur \n20 years of sales experience Summary Enterprise sales manager focus on solving complex business challenges and delivery innovation through Google Enterprise platform. Activities: sales, customer success planning, partner management, team builder and marketing approach.  \n \nSpecialties:  \nCloud computing \nRetail \nCollaboration \nDevelop sales process  \nComplex deals \nValue added solutions \nTraining partners \nFinance and accounting basics  \nEntrepreneur \n20 years of sales experience Enterprise sales manager focus on solving complex business challenges and delivery innovation through Google Enterprise platform. Activities: sales, customer success planning, partner management, team builder and marketing approach.  \n \nSpecialties:  \nCloud computing \nRetail \nCollaboration \nDevelop sales process  \nComplex deals \nValue added solutions \nTraining partners \nFinance and accounting basics  \nEntrepreneur \n20 years of sales experience Enterprise sales manager focus on solving complex business challenges and delivery innovation through Google Enterprise platform. Activities: sales, customer success planning, partner management, team builder and marketing approach.  \n \nSpecialties:  \nCloud computing \nRetail \nCollaboration \nDevelop sales process  \nComplex deals \nValue added solutions \nTraining partners \nFinance and accounting basics  \nEntrepreneur \n20 years of sales experience Experience Retail Sales Manager Google October 2013  – Present (1 year 11 months) São Paulo Area, Brazil Drive value to the brazilian Retail market to achieve better operational results through the innovation of Google Enterprise collaboration suite. \nDiscover practical use cases that address solutions to complex problems of the top brazilian customers. \nLeverage cloud computing solutions to be the market pattern in the next years. \nHelp the companies C-level to transform their business with Google. Enterprise Sales Manager Google February 2012  –  October 2013  (1 year 9 months) São Paulo Responsible to create through channels partners a structured and scalable environment for Google Apps to grow at Brazil. \nActing as channel manager and consultant with partners with the objective to provide to the corporate market a disruptive vision of innovation with Google Cloud. TSL - Territory Services Leader IBM June 2009  –  February 2012  (2 years 9 months) Acting as senior sales resource at the relationship structure at IBM, responsible for the development of all \nlines of business of services at IBM portfolio. Including the two major brands, ITS (Infrastructure Services) and GBS (Consulting Services, ex-Price Waterhouse Coopers). Domain IBM services areas of Network, Site Facilities, Hosting, Software as a Service, Back Up site, ERP (Oracle and SAP) implementation, AMS, Process Review, IT Strategy, Supply Optimization and BAO (Business Analytics Optimization). Creating tools and managing coverage of all services offerings, driving the team to a balanced and winning pipeline. Supporting 05 large account managers resources at GB (General Business) and focal point interface with all the sub-brands of the IBM services. LE accounts of Retail, Banking, Telecom, Service Providers and Agro business. Owner of end-to-end sales stages for complex and large deals. Achieving the sales goals at all quarters, with a great overachievement of 198% on 2009 Q4. Account Manager SAP February 2008  –  June 2009  (1 year 5 months) Responsible for New Names and Instaled Base from SP and MG for the market of middle companies (annual revenue beyond USD 350/year). Selling ERP and all the SAP platform directly and through partners (VARs). Managing 280 accounts with over achievement of 305% in 2008. Domain of all the sales process, including demand generation, pre-sales, putting together the customer needs with the SAP portfolio, managing VARs and implementation channels, licensing, commercial negotiation, contract management and pos-sales. Focus on sales procedures to ensure pipeline and forecast accuracy. Responsible for training all the SAP Brazil channel partners on the Blitz series. Call Blitz (Demand Generation), Meeting Blitz (solution selling with the C-level based on the SPIN Selling methodology) and Closing Blitz (opportunity maturation). SAP employee Top Performer in 2008. Customer Manager - SAP Operation Atento Brasil August 2006  –  December 2007  (1 year 5 months) Developed activities: Manager of the SAP account at the 3RD Brazilian major company in number of employees, a contact center service provider. National covering Top Box client of the company. Inbound and Outbound Lead generation for SE (Small Enterprises) and ME (Mid Enterprises). Base of the SAP chain for the generation of business opportunities, the Atento operation is benchmark for Latin America and World, when referring to productivity per agent and quality of the calls/monitoring. Coaching for the BDE (Business Developer Executives), working with SAP marketing for definition of the business strategies of approach, penetration at the different markets and effectiveness of the advertise campaigns. Regular interaction with the client in English through monthly reports on productivity, quality alignments and analysis of results. Sales Manager Programmer´s IT Consulting (Microsft and Oracle) September 2005  –  August 2006  (1 year) Campinas Area, Brazil Sales Manager for Microsoft corporative line of business  \nDeveloped activities: Sales management, lead identification, resource allocation, identification of needs and possible improvements provided for customized solution, elaboration of proposals, acting with: BI, Integration, Infra-structure, Collaboration and Data Base (SQL and Oracle).  \nBusiness Executive  \nActivities developed: Supervision the sales team (05 Account Managers), lead identification, sales definition goals, responsible for new large accounts and management of contracts (after sale). Retail Sales Manager Google October 2013  – Present (1 year 11 months) São Paulo Area, Brazil Drive value to the brazilian Retail market to achieve better operational results through the innovation of Google Enterprise collaboration suite. \nDiscover practical use cases that address solutions to complex problems of the top brazilian customers. \nLeverage cloud computing solutions to be the market pattern in the next years. \nHelp the companies C-level to transform their business with Google. Retail Sales Manager Google October 2013  – Present (1 year 11 months) São Paulo Area, Brazil Drive value to the brazilian Retail market to achieve better operational results through the innovation of Google Enterprise collaboration suite. \nDiscover practical use cases that address solutions to complex problems of the top brazilian customers. \nLeverage cloud computing solutions to be the market pattern in the next years. \nHelp the companies C-level to transform their business with Google. Enterprise Sales Manager Google February 2012  –  October 2013  (1 year 9 months) São Paulo Responsible to create through channels partners a structured and scalable environment for Google Apps to grow at Brazil. \nActing as channel manager and consultant with partners with the objective to provide to the corporate market a disruptive vision of innovation with Google Cloud. Enterprise Sales Manager Google February 2012  –  October 2013  (1 year 9 months) São Paulo Responsible to create through channels partners a structured and scalable environment for Google Apps to grow at Brazil. \nActing as channel manager and consultant with partners with the objective to provide to the corporate market a disruptive vision of innovation with Google Cloud. TSL - Territory Services Leader IBM June 2009  –  February 2012  (2 years 9 months) Acting as senior sales resource at the relationship structure at IBM, responsible for the development of all \nlines of business of services at IBM portfolio. Including the two major brands, ITS (Infrastructure Services) and GBS (Consulting Services, ex-Price Waterhouse Coopers). Domain IBM services areas of Network, Site Facilities, Hosting, Software as a Service, Back Up site, ERP (Oracle and SAP) implementation, AMS, Process Review, IT Strategy, Supply Optimization and BAO (Business Analytics Optimization). Creating tools and managing coverage of all services offerings, driving the team to a balanced and winning pipeline. Supporting 05 large account managers resources at GB (General Business) and focal point interface with all the sub-brands of the IBM services. LE accounts of Retail, Banking, Telecom, Service Providers and Agro business. Owner of end-to-end sales stages for complex and large deals. Achieving the sales goals at all quarters, with a great overachievement of 198% on 2009 Q4. TSL - Territory Services Leader IBM June 2009  –  February 2012  (2 years 9 months) Acting as senior sales resource at the relationship structure at IBM, responsible for the development of all \nlines of business of services at IBM portfolio. Including the two major brands, ITS (Infrastructure Services) and GBS (Consulting Services, ex-Price Waterhouse Coopers). Domain IBM services areas of Network, Site Facilities, Hosting, Software as a Service, Back Up site, ERP (Oracle and SAP) implementation, AMS, Process Review, IT Strategy, Supply Optimization and BAO (Business Analytics Optimization). Creating tools and managing coverage of all services offerings, driving the team to a balanced and winning pipeline. Supporting 05 large account managers resources at GB (General Business) and focal point interface with all the sub-brands of the IBM services. LE accounts of Retail, Banking, Telecom, Service Providers and Agro business. Owner of end-to-end sales stages for complex and large deals. Achieving the sales goals at all quarters, with a great overachievement of 198% on 2009 Q4. Account Manager SAP February 2008  –  June 2009  (1 year 5 months) Responsible for New Names and Instaled Base from SP and MG for the market of middle companies (annual revenue beyond USD 350/year). Selling ERP and all the SAP platform directly and through partners (VARs). Managing 280 accounts with over achievement of 305% in 2008. Domain of all the sales process, including demand generation, pre-sales, putting together the customer needs with the SAP portfolio, managing VARs and implementation channels, licensing, commercial negotiation, contract management and pos-sales. Focus on sales procedures to ensure pipeline and forecast accuracy. Responsible for training all the SAP Brazil channel partners on the Blitz series. Call Blitz (Demand Generation), Meeting Blitz (solution selling with the C-level based on the SPIN Selling methodology) and Closing Blitz (opportunity maturation). SAP employee Top Performer in 2008. Account Manager SAP February 2008  –  June 2009  (1 year 5 months) Responsible for New Names and Instaled Base from SP and MG for the market of middle companies (annual revenue beyond USD 350/year). Selling ERP and all the SAP platform directly and through partners (VARs). Managing 280 accounts with over achievement of 305% in 2008. Domain of all the sales process, including demand generation, pre-sales, putting together the customer needs with the SAP portfolio, managing VARs and implementation channels, licensing, commercial negotiation, contract management and pos-sales. Focus on sales procedures to ensure pipeline and forecast accuracy. Responsible for training all the SAP Brazil channel partners on the Blitz series. Call Blitz (Demand Generation), Meeting Blitz (solution selling with the C-level based on the SPIN Selling methodology) and Closing Blitz (opportunity maturation). SAP employee Top Performer in 2008. Customer Manager - SAP Operation Atento Brasil August 2006  –  December 2007  (1 year 5 months) Developed activities: Manager of the SAP account at the 3RD Brazilian major company in number of employees, a contact center service provider. National covering Top Box client of the company. Inbound and Outbound Lead generation for SE (Small Enterprises) and ME (Mid Enterprises). Base of the SAP chain for the generation of business opportunities, the Atento operation is benchmark for Latin America and World, when referring to productivity per agent and quality of the calls/monitoring. Coaching for the BDE (Business Developer Executives), working with SAP marketing for definition of the business strategies of approach, penetration at the different markets and effectiveness of the advertise campaigns. Regular interaction with the client in English through monthly reports on productivity, quality alignments and analysis of results. Customer Manager - SAP Operation Atento Brasil August 2006  –  December 2007  (1 year 5 months) Developed activities: Manager of the SAP account at the 3RD Brazilian major company in number of employees, a contact center service provider. National covering Top Box client of the company. Inbound and Outbound Lead generation for SE (Small Enterprises) and ME (Mid Enterprises). Base of the SAP chain for the generation of business opportunities, the Atento operation is benchmark for Latin America and World, when referring to productivity per agent and quality of the calls/monitoring. Coaching for the BDE (Business Developer Executives), working with SAP marketing for definition of the business strategies of approach, penetration at the different markets and effectiveness of the advertise campaigns. Regular interaction with the client in English through monthly reports on productivity, quality alignments and analysis of results. Sales Manager Programmer´s IT Consulting (Microsft and Oracle) September 2005  –  August 2006  (1 year) Campinas Area, Brazil Sales Manager for Microsoft corporative line of business  \nDeveloped activities: Sales management, lead identification, resource allocation, identification of needs and possible improvements provided for customized solution, elaboration of proposals, acting with: BI, Integration, Infra-structure, Collaboration and Data Base (SQL and Oracle).  \nBusiness Executive  \nActivities developed: Supervision the sales team (05 Account Managers), lead identification, sales definition goals, responsible for new large accounts and management of contracts (after sale). Sales Manager Programmer´s IT Consulting (Microsft and Oracle) September 2005  –  August 2006  (1 year) Campinas Area, Brazil Sales Manager for Microsoft corporative line of business  \nDeveloped activities: Sales management, lead identification, resource allocation, identification of needs and possible improvements provided for customized solution, elaboration of proposals, acting with: BI, Integration, Infra-structure, Collaboration and Data Base (SQL and Oracle).  \nBusiness Executive  \nActivities developed: Supervision the sales team (05 Account Managers), lead identification, sales definition goals, responsible for new large accounts and management of contracts (after sale). Skills Enterprise Software Business Intelligence Pre-sales Channel Sales Management Cloud Computing Solution Selling Channel Partners SaaS ERP Sales Process Management Go-to-market Strategy E-commerce IT Strategy CRM Business Strategy Telecommunications Lead Generation Business Alliances Professional Services Sales Operations Selling Strategy IT Service Management Outsourcing Demand Generation Integration Leadership Data Center IT Outsourcing See 16+     See less Skills  Enterprise Software Business Intelligence Pre-sales Channel Sales Management Cloud Computing Solution Selling Channel Partners SaaS ERP Sales Process Management Go-to-market Strategy E-commerce IT Strategy CRM Business Strategy Telecommunications Lead Generation Business Alliances Professional Services Sales Operations Selling Strategy IT Service Management Outsourcing Demand Generation Integration Leadership Data Center IT Outsourcing See 16+     See less Enterprise Software Business Intelligence Pre-sales Channel Sales Management Cloud Computing Solution Selling Channel Partners SaaS ERP Sales Process Management Go-to-market Strategy E-commerce IT Strategy CRM Business Strategy Telecommunications Lead Generation Business Alliances Professional Services Sales Operations Selling Strategy IT Service Management Outsourcing Demand Generation Integration Leadership Data Center IT Outsourcing See 16+     See less Enterprise Software Business Intelligence Pre-sales Channel Sales Management Cloud Computing Solution Selling Channel Partners SaaS ERP Sales Process Management Go-to-market Strategy E-commerce IT Strategy CRM Business Strategy Telecommunications Lead Generation Business Alliances Professional Services Sales Operations Selling Strategy IT Service Management Outsourcing Demand Generation Integration Leadership Data Center IT Outsourcing See 16+     See less Education Harvard Business School Business Industry Insight,  Business 2011  – 2011 Fundação Getulio Vargas MBA MARKETING,  Marketing and Sales 2008  – 2009 Pontifícia Universidade Católica do Rio Grande do Sul 1993  – 1996 Harvard Business School Business Industry Insight,  Business 2011  – 2011 Harvard Business School Business Industry Insight,  Business 2011  – 2011 Harvard Business School Business Industry Insight,  Business 2011  – 2011 Fundação Getulio Vargas MBA MARKETING,  Marketing and Sales 2008  – 2009 Fundação Getulio Vargas MBA MARKETING,  Marketing and Sales 2008  – 2009 Fundação Getulio Vargas MBA MARKETING,  Marketing and Sales 2008  – 2009 Pontifícia Universidade Católica do Rio Grande do Sul 1993  – 1996 Pontifícia Universidade Católica do Rio Grande do Sul 1993  – 1996 Pontifícia Universidade Católica do Rio Grande do Sul 1993  – 1996 ", "Summary Management of Channel and General Business Sales teams at VMWare France \nManagement of Enterprise sales team in charge of cloud solutions (SaaS/PaaS) at Google Enterprise \nChannel recruitment and development at Google \nManagement of Sales team in charge of site-centric Google analytics premium tool, in SEEMEA. \nBusiness Development, Channel development and Complex Direct Sales at Cisco Systems \nMarketing experience in developping IP VPN services at Equant then UUNET \n \nSpecialties: Sales Management, Channel Management, Strategic alliance management, Business Development, Technical Marketing, Product Development, Summary Management of Channel and General Business Sales teams at VMWare France \nManagement of Enterprise sales team in charge of cloud solutions (SaaS/PaaS) at Google Enterprise \nChannel recruitment and development at Google \nManagement of Sales team in charge of site-centric Google analytics premium tool, in SEEMEA. \nBusiness Development, Channel development and Complex Direct Sales at Cisco Systems \nMarketing experience in developping IP VPN services at Equant then UUNET \n \nSpecialties: Sales Management, Channel Management, Strategic alliance management, Business Development, Technical Marketing, Product Development, Management of Channel and General Business Sales teams at VMWare France \nManagement of Enterprise sales team in charge of cloud solutions (SaaS/PaaS) at Google Enterprise \nChannel recruitment and development at Google \nManagement of Sales team in charge of site-centric Google analytics premium tool, in SEEMEA. \nBusiness Development, Channel development and Complex Direct Sales at Cisco Systems \nMarketing experience in developping IP VPN services at Equant then UUNET \n \nSpecialties: Sales Management, Channel Management, Strategic alliance management, Business Development, Technical Marketing, Product Development, Management of Channel and General Business Sales teams at VMWare France \nManagement of Enterprise sales team in charge of cloud solutions (SaaS/PaaS) at Google Enterprise \nChannel recruitment and development at Google \nManagement of Sales team in charge of site-centric Google analytics premium tool, in SEEMEA. \nBusiness Development, Channel development and Complex Direct Sales at Cisco Systems \nMarketing experience in developping IP VPN services at Equant then UUNET \n \nSpecialties: Sales Management, Channel Management, Strategic alliance management, Business Development, Technical Marketing, Product Development, Experience Director, Channel and General Business VMWARE FRANCE January 2015  – Present (8 months) Paris Management of Channel and General Business Sales teams Sales Manager, Google for Work Google January 2014  – Present (1 year 8 months) Paris In charge of New Products and Solutions : Drive for Work, Chromebooks Sales and Business Development Manager Google January 2011  –  December 2014  (4 years) In charge of developping the CRM (Customer for Life) programme for existing Google customers; in charge of the team looking after developping cloud offers in Finance, Public Sector verticals. Regional Sales Manager, Southern Europe, at Google Enterprise Google January 2011  –  January 2012  (1 year 1 month) In charge of developping the cloud offering on the mid-market segment in France, Italy, Spain, Portugal. \n \nHiring / managing sales team, structuring the go-to-market model with channels, to hit 3-digit growths on these markets. Regional Channel Manager Google June 2009  –  March 2011  (1 year 10 months) In charge of developping the channel network in Southern Europe for Google Enterprise offers (Google Apps, Search, Security) Sales Director in charge of Telecom and Media accounts Cisco France January 2001  –  June 2009  (8 years 6 months) Was responsible for Cisco France business with Service Providers and media companies IPVPN Product Line Manager UUNET / Worldcom 1999  –  2001  (2 years) Product development, product management & market planning in 14 countries. IP VPN service IP Solutions Manager SITA / Equant 1996  –  1999  (3 years) definition and launch of new customised IP solutions in the SITA portfolio. project management of the launch Senior Consultant CAP GEMINI ERNST & YOUNG - BOSSARD 1994  –  1996  (2 years) Senior consultant in charge of Telcos. Information Systems and management consulting assignments. Director, Channel and General Business VMWARE FRANCE January 2015  – Present (8 months) Paris Management of Channel and General Business Sales teams Director, Channel and General Business VMWARE FRANCE January 2015  – Present (8 months) Paris Management of Channel and General Business Sales teams Sales Manager, Google for Work Google January 2014  – Present (1 year 8 months) Paris In charge of New Products and Solutions : Drive for Work, Chromebooks Sales Manager, Google for Work Google January 2014  – Present (1 year 8 months) Paris In charge of New Products and Solutions : Drive for Work, Chromebooks Sales and Business Development Manager Google January 2011  –  December 2014  (4 years) In charge of developping the CRM (Customer for Life) programme for existing Google customers; in charge of the team looking after developping cloud offers in Finance, Public Sector verticals. Sales and Business Development Manager Google January 2011  –  December 2014  (4 years) In charge of developping the CRM (Customer for Life) programme for existing Google customers; in charge of the team looking after developping cloud offers in Finance, Public Sector verticals. Regional Sales Manager, Southern Europe, at Google Enterprise Google January 2011  –  January 2012  (1 year 1 month) In charge of developping the cloud offering on the mid-market segment in France, Italy, Spain, Portugal. \n \nHiring / managing sales team, structuring the go-to-market model with channels, to hit 3-digit growths on these markets. Regional Sales Manager, Southern Europe, at Google Enterprise Google January 2011  –  January 2012  (1 year 1 month) In charge of developping the cloud offering on the mid-market segment in France, Italy, Spain, Portugal. \n \nHiring / managing sales team, structuring the go-to-market model with channels, to hit 3-digit growths on these markets. Regional Channel Manager Google June 2009  –  March 2011  (1 year 10 months) In charge of developping the channel network in Southern Europe for Google Enterprise offers (Google Apps, Search, Security) Regional Channel Manager Google June 2009  –  March 2011  (1 year 10 months) In charge of developping the channel network in Southern Europe for Google Enterprise offers (Google Apps, Search, Security) Sales Director in charge of Telecom and Media accounts Cisco France January 2001  –  June 2009  (8 years 6 months) Was responsible for Cisco France business with Service Providers and media companies Sales Director in charge of Telecom and Media accounts Cisco France January 2001  –  June 2009  (8 years 6 months) Was responsible for Cisco France business with Service Providers and media companies IPVPN Product Line Manager UUNET / Worldcom 1999  –  2001  (2 years) Product development, product management & market planning in 14 countries. IP VPN service IPVPN Product Line Manager UUNET / Worldcom 1999  –  2001  (2 years) Product development, product management & market planning in 14 countries. IP VPN service IP Solutions Manager SITA / Equant 1996  –  1999  (3 years) definition and launch of new customised IP solutions in the SITA portfolio. project management of the launch IP Solutions Manager SITA / Equant 1996  –  1999  (3 years) definition and launch of new customised IP solutions in the SITA portfolio. project management of the launch Senior Consultant CAP GEMINI ERNST & YOUNG - BOSSARD 1994  –  1996  (2 years) Senior consultant in charge of Telcos. Information Systems and management consulting assignments. Senior Consultant CAP GEMINI ERNST & YOUNG - BOSSARD 1994  –  1996  (2 years) Senior consultant in charge of Telcos. Information Systems and management consulting assignments. Languages English Spanish Russian English Spanish Russian English Spanish Russian Skills Channel Management Product Marketing Sales Management Strategy Development Product Development Channel Partners Business Development Strategic Alliances Strategy New Business Development Marketing Strategic Partnerships Go-to-market Strategy Management SaaS Telecommunications Enterprise Software Sales Strategic Planning Cloud Computing Business Strategy Pre-sales Salesforce.com Direct Sales Account Management Team Management Product Management Channel Solution Selling Managed Services Management Consulting Security Business Alliances Data Center Professional Services Partner Management Mobile Devices Networking Unified Communications Start-ups Leadership Sales Process International Sales Lead Generation E-commerce PaaS Software Industry Market Analysis Demand Generation Complex Sales See 35+     See less Skills  Channel Management Product Marketing Sales Management Strategy Development Product Development Channel Partners Business Development Strategic Alliances Strategy New Business Development Marketing Strategic Partnerships Go-to-market Strategy Management SaaS Telecommunications Enterprise Software Sales Strategic Planning Cloud Computing Business Strategy Pre-sales Salesforce.com Direct Sales Account Management Team Management Product Management Channel Solution Selling Managed Services Management Consulting Security Business Alliances Data Center Professional Services Partner Management Mobile Devices Networking Unified Communications Start-ups Leadership Sales Process International Sales Lead Generation E-commerce PaaS Software Industry Market Analysis Demand Generation Complex Sales See 35+     See less Channel Management Product Marketing Sales Management Strategy Development Product Development Channel Partners Business Development Strategic Alliances Strategy New Business Development Marketing Strategic Partnerships Go-to-market Strategy Management SaaS Telecommunications Enterprise Software Sales Strategic Planning Cloud Computing Business Strategy Pre-sales Salesforce.com Direct Sales Account Management Team Management Product Management Channel Solution Selling Managed Services Management Consulting Security Business Alliances Data Center Professional Services Partner Management Mobile Devices Networking Unified Communications Start-ups Leadership Sales Process International Sales Lead Generation E-commerce PaaS Software Industry Market Analysis Demand Generation Complex Sales See 35+     See less Channel Management Product Marketing Sales Management Strategy Development Product Development Channel Partners Business Development Strategic Alliances Strategy New Business Development Marketing Strategic Partnerships Go-to-market Strategy Management SaaS Telecommunications Enterprise Software Sales Strategic Planning Cloud Computing Business Strategy Pre-sales Salesforce.com Direct Sales Account Management Team Management Product Management Channel Solution Selling Managed Services Management Consulting Security Business Alliances Data Center Professional Services Partner Management Mobile Devices Networking Unified Communications Start-ups Leadership Sales Process International Sales Lead Generation E-commerce PaaS Software Industry Market Analysis Demand Generation Complex Sales See 35+     See less Education HEC School of Management MBA,  Marketing/Marketing Management , General 1993  – 1994 Ecole nationale supérieure de l'Aéronautique et de l'Espace Engineer,  Information Technology 1988  – 1991 Activities and Societies:  In charge of Enterprise Yearly Recruiting Fair HEC School of Management MBA,  Marketing/Marketing Management , General 1993  – 1994 HEC School of Management MBA,  Marketing/Marketing Management , General 1993  – 1994 HEC School of Management MBA,  Marketing/Marketing Management , General 1993  – 1994 Ecole nationale supérieure de l'Aéronautique et de l'Espace Engineer,  Information Technology 1988  – 1991 Activities and Societies:  In charge of Enterprise Yearly Recruiting Fair Ecole nationale supérieure de l'Aéronautique et de l'Espace Engineer,  Information Technology 1988  – 1991 Activities and Societies:  In charge of Enterprise Yearly Recruiting Fair Ecole nationale supérieure de l'Aéronautique et de l'Espace Engineer,  Information Technology 1988  – 1991 Activities and Societies:  In charge of Enterprise Yearly Recruiting Fair ", "Languages German Serbian/Croatian Italian English German Serbian/Croatian Italian English German Serbian/Croatian Italian English Skills YouTube DoubleClick Online Marketing Search Advertising SEM Online Advertising Google Adwords Digital Marketing PPC Affiliate Marketing Conversion Optimization Mobile Advertising Web Analytics Mobile Marketing SEO Account Management E-commerce Google Analytics Web Marketing Landing Page... Ad Networks Media Buying Ad Serving Online Lead Generation Digital Media Analytics Online-Marketing Marketing Organic Search Yahoo Search Marketing Performance Based... Web Video Behavioral Targeting Film Production Digital Video Entrepreneurship Creativity Video Production Google Ad Google Adsense YouTube Partner Social Media Big Data See 28+     See less Skills  YouTube DoubleClick Online Marketing Search Advertising SEM Online Advertising Google Adwords Digital Marketing PPC Affiliate Marketing Conversion Optimization Mobile Advertising Web Analytics Mobile Marketing SEO Account Management E-commerce Google Analytics Web Marketing Landing Page... Ad Networks Media Buying Ad Serving Online Lead Generation Digital Media Analytics Online-Marketing Marketing Organic Search Yahoo Search Marketing Performance Based... Web Video Behavioral Targeting Film Production Digital Video Entrepreneurship Creativity Video Production Google Ad Google Adsense YouTube Partner Social Media Big Data See 28+     See less YouTube DoubleClick Online Marketing Search Advertising SEM Online Advertising Google Adwords Digital Marketing PPC Affiliate Marketing Conversion Optimization Mobile Advertising Web Analytics Mobile Marketing SEO Account Management E-commerce Google Analytics Web Marketing Landing Page... Ad Networks Media Buying Ad Serving Online Lead Generation Digital Media Analytics Online-Marketing Marketing Organic Search Yahoo Search Marketing Performance Based... Web Video Behavioral Targeting Film Production Digital Video Entrepreneurship Creativity Video Production Google Ad Google Adsense YouTube Partner Social Media Big Data See 28+     See less YouTube DoubleClick Online Marketing Search Advertising SEM Online Advertising Google Adwords Digital Marketing PPC Affiliate Marketing Conversion Optimization Mobile Advertising Web Analytics Mobile Marketing SEO Account Management E-commerce Google Analytics Web Marketing Landing Page... Ad Networks Media Buying Ad Serving Online Lead Generation Digital Media Analytics Online-Marketing Marketing Organic Search Yahoo Search Marketing Performance Based... Web Video Behavioral Targeting Film Production Digital Video Entrepreneurship Creativity Video Production Google Ad Google Adsense YouTube Partner Social Media Big Data See 28+     See less Honors & Awards ", "Experience Head of Government, Google for Work Brazil Google January 2015  – Present (8 months) São Paulo Area, Brazil Sales Manager, Google for Work Google January 2012  – Present (3 years 8 months) Sao Paulo Enterprise Sales Manager Google November 2010  –  January 2012  (1 year 3 months) Senior Account Executive SAP January 2008  –  November 2010  (2 years 11 months) Regional Sales Director Datasul February 2005  –  June 2007  (2 years 5 months) Curitiba Area, Brazil Channel Sales Manager Oracle January 2004  –  December 2004  (1 year) Partner Developer Manager Oracle January 2002  –  December 2003  (2 years) Business Developer Manager Microsoft May 1999  –  December 2001  (2 years 8 months) São Paulo Area, Brazil Senior Systems Engineer Microsoft January 1997  –  May 1999  (2 years 5 months) Porto Alegre Area, Brazil Presales RCM Informatica Ltda 1995  –  January 1997  (2 years) São Paulo Area, Brazil Database Consultant RCM Informatica Ltda 1993  –  1995  (2 years) Porto Alegre Area, Brazil Head of Government, Google for Work Brazil Google January 2015  – Present (8 months) São Paulo Area, Brazil Head of Government, Google for Work Brazil Google January 2015  – Present (8 months) São Paulo Area, Brazil Sales Manager, Google for Work Google January 2012  – Present (3 years 8 months) Sao Paulo Sales Manager, Google for Work Google January 2012  – Present (3 years 8 months) Sao Paulo Enterprise Sales Manager Google November 2010  –  January 2012  (1 year 3 months) Enterprise Sales Manager Google November 2010  –  January 2012  (1 year 3 months) Senior Account Executive SAP January 2008  –  November 2010  (2 years 11 months) Senior Account Executive SAP January 2008  –  November 2010  (2 years 11 months) Regional Sales Director Datasul February 2005  –  June 2007  (2 years 5 months) Curitiba Area, Brazil Regional Sales Director Datasul February 2005  –  June 2007  (2 years 5 months) Curitiba Area, Brazil Channel Sales Manager Oracle January 2004  –  December 2004  (1 year) Channel Sales Manager Oracle January 2004  –  December 2004  (1 year) Partner Developer Manager Oracle January 2002  –  December 2003  (2 years) Partner Developer Manager Oracle January 2002  –  December 2003  (2 years) Business Developer Manager Microsoft May 1999  –  December 2001  (2 years 8 months) São Paulo Area, Brazil Business Developer Manager Microsoft May 1999  –  December 2001  (2 years 8 months) São Paulo Area, Brazil Senior Systems Engineer Microsoft January 1997  –  May 1999  (2 years 5 months) Porto Alegre Area, Brazil Senior Systems Engineer Microsoft January 1997  –  May 1999  (2 years 5 months) Porto Alegre Area, Brazil Presales RCM Informatica Ltda 1995  –  January 1997  (2 years) São Paulo Area, Brazil Presales RCM Informatica Ltda 1995  –  January 1997  (2 years) São Paulo Area, Brazil Database Consultant RCM Informatica Ltda 1993  –  1995  (2 years) Porto Alegre Area, Brazil Database Consultant RCM Informatica Ltda 1993  –  1995  (2 years) Porto Alegre Area, Brazil Skills Software Sales Enterprise Software Cloud Computing SaaS Solution Selling Software Industry Channel Business Alliances Channel Partners Direct Sales Strategy Partner Management Sales Go-to-market Strategy Outsourcing Strategic Partnerships Pre-sales See 2+     See less Skills  Software Sales Enterprise Software Cloud Computing SaaS Solution Selling Software Industry Channel Business Alliances Channel Partners Direct Sales Strategy Partner Management Sales Go-to-market Strategy Outsourcing Strategic Partnerships Pre-sales See 2+     See less Software Sales Enterprise Software Cloud Computing SaaS Solution Selling Software Industry Channel Business Alliances Channel Partners Direct Sales Strategy Partner Management Sales Go-to-market Strategy Outsourcing Strategic Partnerships Pre-sales See 2+     See less Software Sales Enterprise Software Cloud Computing SaaS Solution Selling Software Industry Channel Business Alliances Channel Partners Direct Sales Strategy Partner Management Sales Go-to-market Strategy Outsourcing Strategic Partnerships Pre-sales See 2+     See less Education Fundação Dom Cabral MBA,  Business 2000  – 2001 PUC-SP Bachellor,  Business 1998 PUC-RS Bachellor,  Systems Analysis 1994 Fundação Dom Cabral MBA,  Business 2000  – 2001 Fundação Dom Cabral MBA,  Business 2000  – 2001 Fundação Dom Cabral MBA,  Business 2000  – 2001 PUC-SP Bachellor,  Business 1998 PUC-SP Bachellor,  Business 1998 PUC-SP Bachellor,  Business 1998 PUC-RS Bachellor,  Systems Analysis 1994 PUC-RS Bachellor,  Systems Analysis 1994 PUC-RS Bachellor,  Systems Analysis 1994 ", "Summary Bringing the best of Google technology to Work. \n \nSpecialties: Sales Strategy, Sales Coverage Model Development, New Business Development, Consultative Sales, Strategic Account and Partner Channel Management, Project Management and Marketing. Summary Bringing the best of Google technology to Work. \n \nSpecialties: Sales Strategy, Sales Coverage Model Development, New Business Development, Consultative Sales, Strategic Account and Partner Channel Management, Project Management and Marketing. Bringing the best of Google technology to Work. \n \nSpecialties: Sales Strategy, Sales Coverage Model Development, New Business Development, Consultative Sales, Strategic Account and Partner Channel Management, Project Management and Marketing. Bringing the best of Google technology to Work. \n \nSpecialties: Sales Strategy, Sales Coverage Model Development, New Business Development, Consultative Sales, Strategic Account and Partner Channel Management, Project Management and Marketing. Languages   Skills Skills     Honors & Awards ", "Languages Greek Spanish Greek Spanish Greek Spanish Skills Online Marketing E-commerce New Media People Management Performance Management Sales Targets Revenue Management Revenue Forecasting Driving Revenue Managing High... Online Advertising Revenue Analysis Management Target Marketing Sales Web Analytics Digital Marketing SEM Google Analytics Analytics High Performance Teams Advertising Team Management Leadership Business Strategy Online-Marketing Marketing See 12+     See less Skills  Online Marketing E-commerce New Media People Management Performance Management Sales Targets Revenue Management Revenue Forecasting Driving Revenue Managing High... Online Advertising Revenue Analysis Management Target Marketing Sales Web Analytics Digital Marketing SEM Google Analytics Analytics High Performance Teams Advertising Team Management Leadership Business Strategy Online-Marketing Marketing See 12+     See less Online Marketing E-commerce New Media People Management Performance Management Sales Targets Revenue Management Revenue Forecasting Driving Revenue Managing High... Online Advertising Revenue Analysis Management Target Marketing Sales Web Analytics Digital Marketing SEM Google Analytics Analytics High Performance Teams Advertising Team Management Leadership Business Strategy Online-Marketing Marketing See 12+     See less Online Marketing E-commerce New Media People Management Performance Management Sales Targets Revenue Management Revenue Forecasting Driving Revenue Managing High... Online Advertising Revenue Analysis Management Target Marketing Sales Web Analytics Digital Marketing SEM Google Analytics Analytics High Performance Teams Advertising Team Management Leadership Business Strategy Online-Marketing Marketing See 12+     See less ", "Languages English French German English French German English French German Skills E-commerce Consulting E-commerce Management Web Marketing Team Management Digital Marketing Consulting Product Marketing Web Analytics P&L Management E-business Digital Strategy Marketing Product Development SEO Multi-channel Marketing Online Advertising SEM CRM Advertising Start-ups Account Management Online Marketing Web 2.0 Strategy Mobile Marketing Marketing Strategy Product Management Google Adwords Business Strategy Sales See 16+     See less Skills  E-commerce Consulting E-commerce Management Web Marketing Team Management Digital Marketing Consulting Product Marketing Web Analytics P&L Management E-business Digital Strategy Marketing Product Development SEO Multi-channel Marketing Online Advertising SEM CRM Advertising Start-ups Account Management Online Marketing Web 2.0 Strategy Mobile Marketing Marketing Strategy Product Management Google Adwords Business Strategy Sales See 16+     See less E-commerce Consulting E-commerce Management Web Marketing Team Management Digital Marketing Consulting Product Marketing Web Analytics P&L Management E-business Digital Strategy Marketing Product Development SEO Multi-channel Marketing Online Advertising SEM CRM Advertising Start-ups Account Management Online Marketing Web 2.0 Strategy Mobile Marketing Marketing Strategy Product Management Google Adwords Business Strategy Sales See 16+     See less E-commerce Consulting E-commerce Management Web Marketing Team Management Digital Marketing Consulting Product Marketing Web Analytics P&L Management E-business Digital Strategy Marketing Product Development SEO Multi-channel Marketing Online Advertising SEM CRM Advertising Start-ups Account Management Online Marketing Web 2.0 Strategy Mobile Marketing Marketing Strategy Product Management Google Adwords Business Strategy Sales See 16+     See less ", "Skills Cross-functional Team... Advertising Research Competitive Analysis Data Analysis Forecasting Strategy Market Research SEM Analytics Web Marketing Market Analysis Marketing Strategy Product Management Digital Strategy Digital Marketing Google Adwords Social Media Marketing Customer Insight Mobile Marketing PPC Web Analytics See 7+     See less Skills  Cross-functional Team... Advertising Research Competitive Analysis Data Analysis Forecasting Strategy Market Research SEM Analytics Web Marketing Market Analysis Marketing Strategy Product Management Digital Strategy Digital Marketing Google Adwords Social Media Marketing Customer Insight Mobile Marketing PPC Web Analytics See 7+     See less Cross-functional Team... Advertising Research Competitive Analysis Data Analysis Forecasting Strategy Market Research SEM Analytics Web Marketing Market Analysis Marketing Strategy Product Management Digital Strategy Digital Marketing Google Adwords Social Media Marketing Customer Insight Mobile Marketing PPC Web Analytics See 7+     See less Cross-functional Team... Advertising Research Competitive Analysis Data Analysis Forecasting Strategy Market Research SEM Analytics Web Marketing Market Analysis Marketing Strategy Product Management Digital Strategy Digital Marketing Google Adwords Social Media Marketing Customer Insight Mobile Marketing PPC Web Analytics See 7+     See less ", "Summary Analytical, goal-oriented and self-driven Sales leader with a deep expertise of the online advertising ecosystem (both buy & sell sides) gained through my experiences as: \n- Retail Vertical Lead (Google) managing a team of accounts managers working with Top FR advertisers \n- Sales Manager working with top NA publishers (Google) on inventory monetization, yield management and adserving. \nOverall I have more than 11 years Sales & Marketing experience, including 9 years within Google. \n \nThrough these roles, I have acquired a strong experience in New Business Development, leading the commercialization of new products and building new sales teams. \nI have also developed an extensive deal making experience, working on non standard multi million dollar deals with key partners, resulting in the launch of new market segments (eg reseller segment). \n \nIn 2007, I was selected for a nine month Google Leadership Development Program \n \nI got promoted 5 times at Google and was awarded with 4 larger sales recognition awards Summary Analytical, goal-oriented and self-driven Sales leader with a deep expertise of the online advertising ecosystem (both buy & sell sides) gained through my experiences as: \n- Retail Vertical Lead (Google) managing a team of accounts managers working with Top FR advertisers \n- Sales Manager working with top NA publishers (Google) on inventory monetization, yield management and adserving. \nOverall I have more than 11 years Sales & Marketing experience, including 9 years within Google. \n \nThrough these roles, I have acquired a strong experience in New Business Development, leading the commercialization of new products and building new sales teams. \nI have also developed an extensive deal making experience, working on non standard multi million dollar deals with key partners, resulting in the launch of new market segments (eg reseller segment). \n \nIn 2007, I was selected for a nine month Google Leadership Development Program \n \nI got promoted 5 times at Google and was awarded with 4 larger sales recognition awards Analytical, goal-oriented and self-driven Sales leader with a deep expertise of the online advertising ecosystem (both buy & sell sides) gained through my experiences as: \n- Retail Vertical Lead (Google) managing a team of accounts managers working with Top FR advertisers \n- Sales Manager working with top NA publishers (Google) on inventory monetization, yield management and adserving. \nOverall I have more than 11 years Sales & Marketing experience, including 9 years within Google. \n \nThrough these roles, I have acquired a strong experience in New Business Development, leading the commercialization of new products and building new sales teams. \nI have also developed an extensive deal making experience, working on non standard multi million dollar deals with key partners, resulting in the launch of new market segments (eg reseller segment). \n \nIn 2007, I was selected for a nine month Google Leadership Development Program \n \nI got promoted 5 times at Google and was awarded with 4 larger sales recognition awards Analytical, goal-oriented and self-driven Sales leader with a deep expertise of the online advertising ecosystem (both buy & sell sides) gained through my experiences as: \n- Retail Vertical Lead (Google) managing a team of accounts managers working with Top FR advertisers \n- Sales Manager working with top NA publishers (Google) on inventory monetization, yield management and adserving. \nOverall I have more than 11 years Sales & Marketing experience, including 9 years within Google. \n \nThrough these roles, I have acquired a strong experience in New Business Development, leading the commercialization of new products and building new sales teams. \nI have also developed an extensive deal making experience, working on non standard multi million dollar deals with key partners, resulting in the launch of new market segments (eg reseller segment). \n \nIn 2007, I was selected for a nine month Google Leadership Development Program \n \nI got promoted 5 times at Google and was awarded with 4 larger sales recognition awards Experience Head of Global Commerce Operations YouTube April 2013  – Present (2 years 5 months) San Francisco Bay Area Sales Manager, Tier 1 Sales Team, Online Partnership Group (AdExchange, AdSense, Doubleclick) GOOGLE November 2010  – Present (4 years 10 months) Google Headquarter, Mountain View Leadership:  \nManage the Article/News team, responsible for strategy and revenue (AdExchange, AdSense, Doubleclick for Publishers, Admeld) \nLed the NA Business Planning team responsible for 2013 strategy, Headcount and Investment Planning \n \nDeal making experience/Partnership: \nWorked on non standard multi million dollar deals with key partners, resulting in the launch of new market segments (eg reseller segment) \nDirectly managed and sold AdSense/AdExchange/DFP to Top 50 NA publishers \n \nNew Business Development:  \nResponsible for commercialization of Google Reserve in OPG.  \nGlobal lead gen lead, having initiated and designed a process to identify new revenue opportunites \n \nOther responsabities include: \nHiring ie reviewing and interviewing new candidates \nSales Training ie working on sales training material and sales framework Sales Manager, Retail Vertical Lead France (AdWords) GOOGLE December 2006  –  November 2010  (4 years) Google European Headquarter, Dublin, Ireland Sales Leadership: \nResponsible for the largest market segment (>$100M annual revenue/ 300 accounts) \nPeople Management & development of 9 Key Account Managers \nQuarterly and annual business planning, incl. revenue forecasting \nMarket segmentation to allocate resources in function of revenue opportunities \nHC planning & hiring \n \nBusiness Development & Projects: \nBuild and structure FR Retail team (segmentation/HC allocation) \nSegmentation: Defined new segmentations criteria used in the global segmentation  \nGoogle Value Proposition for Transactional Sites Developed a framework used for \ntraining % external presentations \nSales Trainer Trained over 150 Googlers over 8+ trainings (2years) \nKeynote Speaker at 5 Google Academies with 50 C-Levels from Top 100 companies Senior Account Manager Retail, Online Team (AdWords) Google 2004  –  2007  (3 years) Google European Headquarter, Dublin, Ireland Sales Experience: \nResponsible for growing the revenue from 100+ top retailers \nBudget negotiation at C-Level \nConsultancy on media planning for top advertisers \nProviding key leads to our acquisition channel \nDesigned mass marketing tools to reach small advertisers (webinar, newsletter) \nDeveloped precise expertise on conversions (Analytics, conversion funnel, UX) Technical Account Manager Hewlett Packard July 2004  –  November 2004  (5 months) Dublin Ireland Day to day management of Key Account (Total) \nTroubleshooting, TAT management & Technical Escalation Cash flow/Supply/Buyer Accountant Renault January 2001  –  June 2001  (6 months) Centre de Comptabilite National, Renault SA, Boigny sur Bionne, France Accountancy experience in: \nTurnover consolidation \nCash flow / Balance/ Asset Liability Management \nInventory Valuation \nAccount Management with SAP \nFollow up calls to settle customer accounts Head of Global Commerce Operations YouTube April 2013  – Present (2 years 5 months) San Francisco Bay Area Head of Global Commerce Operations YouTube April 2013  – Present (2 years 5 months) San Francisco Bay Area Sales Manager, Tier 1 Sales Team, Online Partnership Group (AdExchange, AdSense, Doubleclick) GOOGLE November 2010  – Present (4 years 10 months) Google Headquarter, Mountain View Leadership:  \nManage the Article/News team, responsible for strategy and revenue (AdExchange, AdSense, Doubleclick for Publishers, Admeld) \nLed the NA Business Planning team responsible for 2013 strategy, Headcount and Investment Planning \n \nDeal making experience/Partnership: \nWorked on non standard multi million dollar deals with key partners, resulting in the launch of new market segments (eg reseller segment) \nDirectly managed and sold AdSense/AdExchange/DFP to Top 50 NA publishers \n \nNew Business Development:  \nResponsible for commercialization of Google Reserve in OPG.  \nGlobal lead gen lead, having initiated and designed a process to identify new revenue opportunites \n \nOther responsabities include: \nHiring ie reviewing and interviewing new candidates \nSales Training ie working on sales training material and sales framework Sales Manager, Tier 1 Sales Team, Online Partnership Group (AdExchange, AdSense, Doubleclick) GOOGLE November 2010  – Present (4 years 10 months) Google Headquarter, Mountain View Leadership:  \nManage the Article/News team, responsible for strategy and revenue (AdExchange, AdSense, Doubleclick for Publishers, Admeld) \nLed the NA Business Planning team responsible for 2013 strategy, Headcount and Investment Planning \n \nDeal making experience/Partnership: \nWorked on non standard multi million dollar deals with key partners, resulting in the launch of new market segments (eg reseller segment) \nDirectly managed and sold AdSense/AdExchange/DFP to Top 50 NA publishers \n \nNew Business Development:  \nResponsible for commercialization of Google Reserve in OPG.  \nGlobal lead gen lead, having initiated and designed a process to identify new revenue opportunites \n \nOther responsabities include: \nHiring ie reviewing and interviewing new candidates \nSales Training ie working on sales training material and sales framework Sales Manager, Retail Vertical Lead France (AdWords) GOOGLE December 2006  –  November 2010  (4 years) Google European Headquarter, Dublin, Ireland Sales Leadership: \nResponsible for the largest market segment (>$100M annual revenue/ 300 accounts) \nPeople Management & development of 9 Key Account Managers \nQuarterly and annual business planning, incl. revenue forecasting \nMarket segmentation to allocate resources in function of revenue opportunities \nHC planning & hiring \n \nBusiness Development & Projects: \nBuild and structure FR Retail team (segmentation/HC allocation) \nSegmentation: Defined new segmentations criteria used in the global segmentation  \nGoogle Value Proposition for Transactional Sites Developed a framework used for \ntraining % external presentations \nSales Trainer Trained over 150 Googlers over 8+ trainings (2years) \nKeynote Speaker at 5 Google Academies with 50 C-Levels from Top 100 companies Sales Manager, Retail Vertical Lead France (AdWords) GOOGLE December 2006  –  November 2010  (4 years) Google European Headquarter, Dublin, Ireland Sales Leadership: \nResponsible for the largest market segment (>$100M annual revenue/ 300 accounts) \nPeople Management & development of 9 Key Account Managers \nQuarterly and annual business planning, incl. revenue forecasting \nMarket segmentation to allocate resources in function of revenue opportunities \nHC planning & hiring \n \nBusiness Development & Projects: \nBuild and structure FR Retail team (segmentation/HC allocation) \nSegmentation: Defined new segmentations criteria used in the global segmentation  \nGoogle Value Proposition for Transactional Sites Developed a framework used for \ntraining % external presentations \nSales Trainer Trained over 150 Googlers over 8+ trainings (2years) \nKeynote Speaker at 5 Google Academies with 50 C-Levels from Top 100 companies Senior Account Manager Retail, Online Team (AdWords) Google 2004  –  2007  (3 years) Google European Headquarter, Dublin, Ireland Sales Experience: \nResponsible for growing the revenue from 100+ top retailers \nBudget negotiation at C-Level \nConsultancy on media planning for top advertisers \nProviding key leads to our acquisition channel \nDesigned mass marketing tools to reach small advertisers (webinar, newsletter) \nDeveloped precise expertise on conversions (Analytics, conversion funnel, UX) Senior Account Manager Retail, Online Team (AdWords) Google 2004  –  2007  (3 years) Google European Headquarter, Dublin, Ireland Sales Experience: \nResponsible for growing the revenue from 100+ top retailers \nBudget negotiation at C-Level \nConsultancy on media planning for top advertisers \nProviding key leads to our acquisition channel \nDesigned mass marketing tools to reach small advertisers (webinar, newsletter) \nDeveloped precise expertise on conversions (Analytics, conversion funnel, UX) Technical Account Manager Hewlett Packard July 2004  –  November 2004  (5 months) Dublin Ireland Day to day management of Key Account (Total) \nTroubleshooting, TAT management & Technical Escalation Technical Account Manager Hewlett Packard July 2004  –  November 2004  (5 months) Dublin Ireland Day to day management of Key Account (Total) \nTroubleshooting, TAT management & Technical Escalation Cash flow/Supply/Buyer Accountant Renault January 2001  –  June 2001  (6 months) Centre de Comptabilite National, Renault SA, Boigny sur Bionne, France Accountancy experience in: \nTurnover consolidation \nCash flow / Balance/ Asset Liability Management \nInventory Valuation \nAccount Management with SAP \nFollow up calls to settle customer accounts Cash flow/Supply/Buyer Accountant Renault January 2001  –  June 2001  (6 months) Centre de Comptabilite National, Renault SA, Boigny sur Bionne, France Accountancy experience in: \nTurnover consolidation \nCash flow / Balance/ Asset Liability Management \nInventory Valuation \nAccount Management with SAP \nFollow up calls to settle customer accounts Languages English Full professional proficiency German Limited working proficiency French Native or bilingual proficiency English Full professional proficiency German Limited working proficiency French Native or bilingual proficiency English Full professional proficiency German Limited working proficiency French Native or bilingual proficiency Full professional proficiency Limited working proficiency Native or bilingual proficiency Skills Google Adwords Adsense DoubleClick Admeld Retail Business Development People Management Sales Management AdExchange Google Analytics SAP Salesforce.com E-commerce SEM Marketing Strategy Management Online Advertising PPC Display Advertising Leadership Digital Marketing Search Advertising Mobile Marketing Web Analytics Strategy Analytics Online Marketing Conversion Optimization Advertising Account Management Lead Generation Sales Operations See 17+     See less Skills  Google Adwords Adsense DoubleClick Admeld Retail Business Development People Management Sales Management AdExchange Google Analytics SAP Salesforce.com E-commerce SEM Marketing Strategy Management Online Advertising PPC Display Advertising Leadership Digital Marketing Search Advertising Mobile Marketing Web Analytics Strategy Analytics Online Marketing Conversion Optimization Advertising Account Management Lead Generation Sales Operations See 17+     See less Google Adwords Adsense DoubleClick Admeld Retail Business Development People Management Sales Management AdExchange Google Analytics SAP Salesforce.com E-commerce SEM Marketing Strategy Management Online Advertising PPC Display Advertising Leadership Digital Marketing Search Advertising Mobile Marketing Web Analytics Strategy Analytics Online Marketing Conversion Optimization Advertising Account Management Lead Generation Sales Operations See 17+     See less Google Adwords Adsense DoubleClick Admeld Retail Business Development People Management Sales Management AdExchange Google Analytics SAP Salesforce.com E-commerce SEM Marketing Strategy Management Online Advertising PPC Display Advertising Leadership Digital Marketing Search Advertising Mobile Marketing Web Analytics Strategy Analytics Online Marketing Conversion Optimization Advertising Account Management Lead Generation Sales Operations See 17+     See less Education Dublin City University Master in Business Studies,  Strategy/Marketing , Honors 2003  – 2004 Stanford University (high performance management) Dublin City University Master in Business Studies,  Strategy/Marketing , Honors 2003  – 2004 Dublin City University Master in Business Studies,  Strategy/Marketing , Honors 2003  – 2004 Dublin City University Master in Business Studies,  Strategy/Marketing , Honors 2003  – 2004 Stanford University (high performance management) Stanford University (high performance management) Stanford University (high performance management) Honors & Awards Grade: A+ in High Performance Management Course, Stanford University Stanford University March 2012 6 week course on High Performance Management lectured by Ron Schilling (PhD) covering  \nCustomer \nPeople \nProcess \nQuality \nCommunication \n \nGrade: A+ Grade: A+ in High Performance Management Course, Stanford University Stanford University March 2012 6 week course on High Performance Management lectured by Ron Schilling (PhD) covering  \nCustomer \nPeople \nProcess \nQuality \nCommunication \n \nGrade: A+ Grade: A+ in High Performance Management Course, Stanford University Stanford University March 2012 6 week course on High Performance Management lectured by Ron Schilling (PhD) covering  \nCustomer \nPeople \nProcess \nQuality \nCommunication \n \nGrade: A+ Grade: A+ in High Performance Management Course, Stanford University Stanford University March 2012 6 week course on High Performance Management lectured by Ron Schilling (PhD) covering  \nCustomer \nPeople \nProcess \nQuality \nCommunication \n \nGrade: A+ ", "Experience France, Turkey & DoubleClick for Publishers Sales Manager, Publishers Monetization Solutions Google June 2015  – Present (3 months) Ireland Driving a team of 6 to achieve quarterly revenue targets and product adoption targets, by putting together a strategy and execute against it (product adoption, events, publishers' relations, thorough account management, joint business plans) \n \nDriving adoption of AdSense, DoubleClick AdExchange & AdMob in France and Turkey, as well as DoubleClick for Publishers in EMEA \nDelivering consulting on Google's solutions (Audience Development strategies, Social, Video, Mobile, RTB) \nResponsible for the team development: trainings, sales coaching, development discussions France, Turkey & DoubleClick for Publishers Sales Manager, Publishers Monetization Solutions Google June 2015  – Present (3 months) Ireland Driving a team of 6 to achieve quarterly revenue targets and product adoption targets, by putting together a strategy and execute against it (product adoption, events, publishers' relations, thorough account management, joint business plans) \n \nDriving adoption of AdSense, DoubleClick AdExchange & AdMob in France and Turkey, as well as DoubleClick for Publishers in EMEA \nDelivering consulting on Google's solutions (Audience Development strategies, Social, Video, Mobile, RTB) \nResponsible for the team development: trainings, sales coaching, development discussions France, Turkey & DoubleClick for Publishers Sales Manager, Publishers Monetization Solutions Google June 2015  – Present (3 months) Ireland Driving a team of 6 to achieve quarterly revenue targets and product adoption targets, by putting together a strategy and execute against it (product adoption, events, publishers' relations, thorough account management, joint business plans) \n \nDriving adoption of AdSense, DoubleClick AdExchange & AdMob in France and Turkey, as well as DoubleClick for Publishers in EMEA \nDelivering consulting on Google's solutions (Audience Development strategies, Social, Video, Mobile, RTB) \nResponsible for the team development: trainings, sales coaching, development discussions Languages   Skills E-commerce Online Advertising Strategic Partnerships Business Development French Key Account Management New Business Development Spanish Business Strategy English Product Management Mobile Devices RTB Trafficking Adexchange programmatic Publicité en ligne Développement commercial Marketing digital Stratégie Marketing en ligne Stratégie numérique Partenariats... Stratégie commerciale Appareils mobiles Strategy Digital Marketing See 12+     See less Skills  E-commerce Online Advertising Strategic Partnerships Business Development French Key Account Management New Business Development Spanish Business Strategy English Product Management Mobile Devices RTB Trafficking Adexchange programmatic Publicité en ligne Développement commercial Marketing digital Stratégie Marketing en ligne Stratégie numérique Partenariats... Stratégie commerciale Appareils mobiles Strategy Digital Marketing See 12+     See less E-commerce Online Advertising Strategic Partnerships Business Development French Key Account Management New Business Development Spanish Business Strategy English Product Management Mobile Devices RTB Trafficking Adexchange programmatic Publicité en ligne Développement commercial Marketing digital Stratégie Marketing en ligne Stratégie numérique Partenariats... Stratégie commerciale Appareils mobiles Strategy Digital Marketing See 12+     See less E-commerce Online Advertising Strategic Partnerships Business Development French Key Account Management New Business Development Spanish Business Strategy English Product Management Mobile Devices RTB Trafficking Adexchange programmatic Publicité en ligne Développement commercial Marketing digital Stratégie Marketing en ligne Stratégie numérique Partenariats... Stratégie commerciale Appareils mobiles Strategy Digital Marketing See 12+     See less ", "Summary - CURRENT: Managing +40 people on account development and sales upsell to high value SMB advertisers across multiple verticals.  \n \n- Head of SMB, focusing on mid-tiers and Sales  \n- Senior Manager and team coach for core activities and on the side projects; \n- Experience in managing sales teams for Education, Automotive and Local verticals from middle to high tier advertisers  \n- 8 years of experience delivering lectures (Online Advertising and Internet Environment) across Brazil for SMBs and similar audiences  \n- 8 years at Google Brazil working with premium customer support for thousands of long tail advertisers  \n- 7.5 years at UOL working with internet content for Brazilian celebrities sites acting as a senior webmaster \n \nSpecialties: - Management, Sales Management, Online Sales, Online Marketing, Sales Upsell, Internet Advertising, Customer Support, Customer Education Summary - CURRENT: Managing +40 people on account development and sales upsell to high value SMB advertisers across multiple verticals.  \n \n- Head of SMB, focusing on mid-tiers and Sales  \n- Senior Manager and team coach for core activities and on the side projects; \n- Experience in managing sales teams for Education, Automotive and Local verticals from middle to high tier advertisers  \n- 8 years of experience delivering lectures (Online Advertising and Internet Environment) across Brazil for SMBs and similar audiences  \n- 8 years at Google Brazil working with premium customer support for thousands of long tail advertisers  \n- 7.5 years at UOL working with internet content for Brazilian celebrities sites acting as a senior webmaster \n \nSpecialties: - Management, Sales Management, Online Sales, Online Marketing, Sales Upsell, Internet Advertising, Customer Support, Customer Education - CURRENT: Managing +40 people on account development and sales upsell to high value SMB advertisers across multiple verticals.  \n \n- Head of SMB, focusing on mid-tiers and Sales  \n- Senior Manager and team coach for core activities and on the side projects; \n- Experience in managing sales teams for Education, Automotive and Local verticals from middle to high tier advertisers  \n- 8 years of experience delivering lectures (Online Advertising and Internet Environment) across Brazil for SMBs and similar audiences  \n- 8 years at Google Brazil working with premium customer support for thousands of long tail advertisers  \n- 7.5 years at UOL working with internet content for Brazilian celebrities sites acting as a senior webmaster \n \nSpecialties: - Management, Sales Management, Online Sales, Online Marketing, Sales Upsell, Internet Advertising, Customer Support, Customer Education - CURRENT: Managing +40 people on account development and sales upsell to high value SMB advertisers across multiple verticals.  \n \n- Head of SMB, focusing on mid-tiers and Sales  \n- Senior Manager and team coach for core activities and on the side projects; \n- Experience in managing sales teams for Education, Automotive and Local verticals from middle to high tier advertisers  \n- 8 years of experience delivering lectures (Online Advertising and Internet Environment) across Brazil for SMBs and similar audiences  \n- 8 years at Google Brazil working with premium customer support for thousands of long tail advertisers  \n- 7.5 years at UOL working with internet content for Brazilian celebrities sites acting as a senior webmaster \n \nSpecialties: - Management, Sales Management, Online Sales, Online Marketing, Sales Upsell, Internet Advertising, Customer Support, Customer Education Experience Head of SMB Sales Google October 2013  – Present (1 year 11 months) São Paulo Area, Brazil Managing +34 people on account development and sales upsell to SMB high value online advertisers. SMB Sales manager Google June 2011  – Present (4 years 3 months) São Paulo Area, Brazil Managing +21 people on account development and sales upsell to SMB high value online advertisers. Sales Manager Google November 2005  –  June 2011  (5 years 8 months) Managing 3 sales teams (10 people) for local, education and automotive verticals. Responsible to maintain portfolio healthy and upsell Google advertising solutions. Senior Webmaster UOL November 1998  –  October 2005  (7 years) Website development for the celebrities channel; content management; partners support Head of SMB Sales Google October 2013  – Present (1 year 11 months) São Paulo Area, Brazil Managing +34 people on account development and sales upsell to SMB high value online advertisers. Head of SMB Sales Google October 2013  – Present (1 year 11 months) São Paulo Area, Brazil Managing +34 people on account development and sales upsell to SMB high value online advertisers. SMB Sales manager Google June 2011  – Present (4 years 3 months) São Paulo Area, Brazil Managing +21 people on account development and sales upsell to SMB high value online advertisers. SMB Sales manager Google June 2011  – Present (4 years 3 months) São Paulo Area, Brazil Managing +21 people on account development and sales upsell to SMB high value online advertisers. Sales Manager Google November 2005  –  June 2011  (5 years 8 months) Managing 3 sales teams (10 people) for local, education and automotive verticals. Responsible to maintain portfolio healthy and upsell Google advertising solutions. Sales Manager Google November 2005  –  June 2011  (5 years 8 months) Managing 3 sales teams (10 people) for local, education and automotive verticals. Responsible to maintain portfolio healthy and upsell Google advertising solutions. Senior Webmaster UOL November 1998  –  October 2005  (7 years) Website development for the celebrities channel; content management; partners support Senior Webmaster UOL November 1998  –  October 2005  (7 years) Website development for the celebrities channel; content management; partners support Languages English Native or bilingual proficiency English Native or bilingual proficiency English Native or bilingual proficiency Native or bilingual proficiency Skills Sales Online Advertising Customer Support Google Adwords SEM Google Analytics Web Analytics E-commerce PPC Digital Marketing Mobile Marketing SEO Search Advertising Digital Strategy Sales Management Operations Management Management Online Marketing Advertising Mobile Advertising Conversion Optimization Lead Generation Display Advertising Strategic Planning Team Management Mobile Devices Content Management Start-ups Ad Networks Strategic Partnerships Salesforce.com Product Management See 17+     See less Skills  Sales Online Advertising Customer Support Google Adwords SEM Google Analytics Web Analytics E-commerce PPC Digital Marketing Mobile Marketing SEO Search Advertising Digital Strategy Sales Management Operations Management Management Online Marketing Advertising Mobile Advertising Conversion Optimization Lead Generation Display Advertising Strategic Planning Team Management Mobile Devices Content Management Start-ups Ad Networks Strategic Partnerships Salesforce.com Product Management See 17+     See less Sales Online Advertising Customer Support Google Adwords SEM Google Analytics Web Analytics E-commerce PPC Digital Marketing Mobile Marketing SEO Search Advertising Digital Strategy Sales Management Operations Management Management Online Marketing Advertising Mobile Advertising Conversion Optimization Lead Generation Display Advertising Strategic Planning Team Management Mobile Devices Content Management Start-ups Ad Networks Strategic Partnerships Salesforce.com Product Management See 17+     See less Sales Online Advertising Customer Support Google Adwords SEM Google Analytics Web Analytics E-commerce PPC Digital Marketing Mobile Marketing SEO Search Advertising Digital Strategy Sales Management Operations Management Management Online Marketing Advertising Mobile Advertising Conversion Optimization Lead Generation Display Advertising Strategic Planning Team Management Mobile Devices Content Management Start-ups Ad Networks Strategic Partnerships Salesforce.com Product Management See 17+     See less Education Fundação Getulio Vargas MBA,  Information Technology 2008  – 2009 Faculdade Cásper Líbero Post-graduation,  Communication 1999  – 2001 Centro Universitário FIEO Language and Literature 1996  – 1999 Fundação Getulio Vargas MBA,  Information Technology 2008  – 2009 Fundação Getulio Vargas MBA,  Information Technology 2008  – 2009 Fundação Getulio Vargas MBA,  Information Technology 2008  – 2009 Faculdade Cásper Líbero Post-graduation,  Communication 1999  – 2001 Faculdade Cásper Líbero Post-graduation,  Communication 1999  – 2001 Faculdade Cásper Líbero Post-graduation,  Communication 1999  – 2001 Centro Universitário FIEO Language and Literature 1996  – 1999 Centro Universitário FIEO Language and Literature 1996  – 1999 Centro Universitário FIEO Language and Literature 1996  – 1999 ", "Experience Agency Sales Manager - Americas, Global Business Organization Google March 2015  – Present (6 months) Phoenix, Arizona Area Agency Sales Manager - North America, Global Business Organization Google January 2013  –  February 2015  (2 years 2 months) Phoenix, Arizona Area Operations Lead, Global Business Organization Google January 2012  –  December 2012  (1 year) São Paulo Area, Brazil Relationship Manager & Team Lead Google August 2010  –  January 2012  (1 year 6 months) Dublin Media Sales Executive, Inside Sales Operations Google June 2009  –  October 2010  (1 year 5 months) Account Strategist, SMB Operations Google April 2007  –  June 2009  (2 years 3 months) R & D - Brew Master Unicer February 2006  –  February 2007  (1 year 1 month) Marketing and Sales Department Unicer November 2004  –  February 2006  (1 year 4 months) Agency Sales Manager - Americas, Global Business Organization Google March 2015  – Present (6 months) Phoenix, Arizona Area Agency Sales Manager - Americas, Global Business Organization Google March 2015  – Present (6 months) Phoenix, Arizona Area Agency Sales Manager - North America, Global Business Organization Google January 2013  –  February 2015  (2 years 2 months) Phoenix, Arizona Area Agency Sales Manager - North America, Global Business Organization Google January 2013  –  February 2015  (2 years 2 months) Phoenix, Arizona Area Operations Lead, Global Business Organization Google January 2012  –  December 2012  (1 year) São Paulo Area, Brazil Operations Lead, Global Business Organization Google January 2012  –  December 2012  (1 year) São Paulo Area, Brazil Relationship Manager & Team Lead Google August 2010  –  January 2012  (1 year 6 months) Dublin Relationship Manager & Team Lead Google August 2010  –  January 2012  (1 year 6 months) Dublin Media Sales Executive, Inside Sales Operations Google June 2009  –  October 2010  (1 year 5 months) Media Sales Executive, Inside Sales Operations Google June 2009  –  October 2010  (1 year 5 months) Account Strategist, SMB Operations Google April 2007  –  June 2009  (2 years 3 months) Account Strategist, SMB Operations Google April 2007  –  June 2009  (2 years 3 months) R & D - Brew Master Unicer February 2006  –  February 2007  (1 year 1 month) R & D - Brew Master Unicer February 2006  –  February 2007  (1 year 1 month) Marketing and Sales Department Unicer November 2004  –  February 2006  (1 year 4 months) Marketing and Sales Department Unicer November 2004  –  February 2006  (1 year 4 months) Languages English Native or bilingual proficiency Portuguese Native or bilingual proficiency Spanish Professional working proficiency English Native or bilingual proficiency Portuguese Native or bilingual proficiency Spanish Professional working proficiency English Native or bilingual proficiency Portuguese Native or bilingual proficiency Spanish Professional working proficiency Native or bilingual proficiency Native or bilingual proficiency Professional working proficiency Skills Project Management Google Adwords Account Management Online Advertising Social Media Marketing Mobile Marketing Team Leadership Process Improvement Performance Reporting YouTube Customer Acquisition Strategic Partnerships Vendor Relationships Coaching Mentoring SEM SEO Salesforce.com CRM Pipeline Management Google Analytics E-commerce Online Marketing PPC Sales Advertising Marketing Leadership Web Analytics Digital Marketing Strategy Digital Strategy Marketing Management Lead Generation Analytics Search Advertising Digital Media Marketing Strategy Mobile Advertising Affiliate Marketing Market Research Sales Management Business Strategy Display Advertising Business Development Social Media See 31+     See less Skills  Project Management Google Adwords Account Management Online Advertising Social Media Marketing Mobile Marketing Team Leadership Process Improvement Performance Reporting YouTube Customer Acquisition Strategic Partnerships Vendor Relationships Coaching Mentoring SEM SEO Salesforce.com CRM Pipeline Management Google Analytics E-commerce Online Marketing PPC Sales Advertising Marketing Leadership Web Analytics Digital Marketing Strategy Digital Strategy Marketing Management Lead Generation Analytics Search Advertising Digital Media Marketing Strategy Mobile Advertising Affiliate Marketing Market Research Sales Management Business Strategy Display Advertising Business Development Social Media See 31+     See less Project Management Google Adwords Account Management Online Advertising Social Media Marketing Mobile Marketing Team Leadership Process Improvement Performance Reporting YouTube Customer Acquisition Strategic Partnerships Vendor Relationships Coaching Mentoring SEM SEO Salesforce.com CRM Pipeline Management Google Analytics E-commerce Online Marketing PPC Sales Advertising Marketing Leadership Web Analytics Digital Marketing Strategy Digital Strategy Marketing Management Lead Generation Analytics Search Advertising Digital Media Marketing Strategy Mobile Advertising Affiliate Marketing Market Research Sales Management Business Strategy Display Advertising Business Development Social Media See 31+     See less Project Management Google Adwords Account Management Online Advertising Social Media Marketing Mobile Marketing Team Leadership Process Improvement Performance Reporting YouTube Customer Acquisition Strategic Partnerships Vendor Relationships Coaching Mentoring SEM SEO Salesforce.com CRM Pipeline Management Google Analytics E-commerce Online Marketing PPC Sales Advertising Marketing Leadership Web Analytics Digital Marketing Strategy Digital Strategy Marketing Management Lead Generation Analytics Search Advertising Digital Media Marketing Strategy Mobile Advertising Affiliate Marketing Market Research Sales Management Business Strategy Display Advertising Business Development Social Media See 31+     See less Education Dublin Business School Pos Graduation,  Business Studies 2008  – 2010 Activities and Societies:  Business management and marketing orientated. Universidade do Minho Masters,  Food Sciences 2006  – 2006 Universidade Nova de Lisboa Masters,  Food Safety and Technology 1999  – 2004 Dublin Business School Pos Graduation,  Business Studies 2008  – 2010 Activities and Societies:  Business management and marketing orientated. Dublin Business School Pos Graduation,  Business Studies 2008  – 2010 Activities and Societies:  Business management and marketing orientated. Dublin Business School Pos Graduation,  Business Studies 2008  – 2010 Activities and Societies:  Business management and marketing orientated. Universidade do Minho Masters,  Food Sciences 2006  – 2006 Universidade do Minho Masters,  Food Sciences 2006  – 2006 Universidade do Minho Masters,  Food Sciences 2006  – 2006 Universidade Nova de Lisboa Masters,  Food Safety and Technology 1999  – 2004 Universidade Nova de Lisboa Masters,  Food Safety and Technology 1999  – 2004 Universidade Nova de Lisboa Masters,  Food Safety and Technology 1999  – 2004 ", "Experience Google Sales Manager, DACH Google September 2014  – Present (1 year) Berlin Area, Germany Google Sales Manager, CEE, Russia&TR Google October 2011  – Present (3 years 11 months) Ireland Google Sales Manager, DACH Google September 2014  – Present (1 year) Berlin Area, Germany Google Sales Manager, DACH Google September 2014  – Present (1 year) Berlin Area, Germany Google Sales Manager, CEE, Russia&TR Google October 2011  – Present (3 years 11 months) Ireland Google Sales Manager, CEE, Russia&TR Google October 2011  – Present (3 years 11 months) Ireland Skills Skills     Honors & Awards ", "Experience DoubleClick Sales Manager Google April 2015  – Present (5 months) Audience Sales Manager Google January 2014  –  March 2015  (1 year 3 months) New Products and Solutions Google January 2012  –  December 2013  (2 years) Milan Area, Italy Support clients on defining their digital strategy. \nBuild Google Media Solutions by marketing ojectives \nEvangelize Google suite of Ad products. Display Account Manager Google November 2010  –  January 2012  (1 year 3 months) Milan Area, Italy Develop video strategy for TV clients. \nEvangelize YouTube platform to clients and media agencies. Industry Analyst Google October 2009  –  April 2010  (7 months) Develop client presentations including account reviews and analysis. \nAlign Google's products with client's marketing objectives. \nCreate insights using industry, marketing and third-party research. Tutor of Economic Subjects Università degli Studi di Roma 'La Sapienza' January 2009  –  September 2009  (9 months) DoubleClick Sales Manager Google April 2015  – Present (5 months) DoubleClick Sales Manager Google April 2015  – Present (5 months) Audience Sales Manager Google January 2014  –  March 2015  (1 year 3 months) Audience Sales Manager Google January 2014  –  March 2015  (1 year 3 months) New Products and Solutions Google January 2012  –  December 2013  (2 years) Milan Area, Italy Support clients on defining their digital strategy. \nBuild Google Media Solutions by marketing ojectives \nEvangelize Google suite of Ad products. New Products and Solutions Google January 2012  –  December 2013  (2 years) Milan Area, Italy Support clients on defining their digital strategy. \nBuild Google Media Solutions by marketing ojectives \nEvangelize Google suite of Ad products. Display Account Manager Google November 2010  –  January 2012  (1 year 3 months) Milan Area, Italy Develop video strategy for TV clients. \nEvangelize YouTube platform to clients and media agencies. Display Account Manager Google November 2010  –  January 2012  (1 year 3 months) Milan Area, Italy Develop video strategy for TV clients. \nEvangelize YouTube platform to clients and media agencies. Industry Analyst Google October 2009  –  April 2010  (7 months) Develop client presentations including account reviews and analysis. \nAlign Google's products with client's marketing objectives. \nCreate insights using industry, marketing and third-party research. Industry Analyst Google October 2009  –  April 2010  (7 months) Develop client presentations including account reviews and analysis. \nAlign Google's products with client's marketing objectives. \nCreate insights using industry, marketing and third-party research. Tutor of Economic Subjects Università degli Studi di Roma 'La Sapienza' January 2009  –  September 2009  (9 months) Tutor of Economic Subjects Università degli Studi di Roma 'La Sapienza' January 2009  –  September 2009  (9 months) Skills SEM Strategy Marketing Digital Marketing Online Advertising Google Analytics Advertising Marketing Strategy Display Advertising E-commerce Skills  SEM Strategy Marketing Digital Marketing Online Advertising Google Analytics Advertising Marketing Strategy Display Advertising E-commerce SEM Strategy Marketing Digital Marketing Online Advertising Google Analytics Advertising Marketing Strategy Display Advertising E-commerce SEM Strategy Marketing Digital Marketing Online Advertising Google Analytics Advertising Marketing Strategy Display Advertising E-commerce Education Sapienza Università di Roma Master's Degree; Master's,  Managent Engineering , 110 cum laude 2007  – 2010 Thesis: \"Digital marketing: how to plan a winning strategy\" Sapienza Università di Roma Bachelor's Degree; Bachelor's,  Management Engineering , 110 2004  – 2007 Thesis: \"Regulation of airports in Italy\" Liceo classico Goffredo Mameli High school diploma,  Classics , 84/100 1999  – 2004 Cyfair High-School English , Top marks in all subjects 2002  – 2003 American Literature and language Sapienza Università di Roma Master's Degree; Master's,  Managent Engineering , 110 cum laude 2007  – 2010 Thesis: \"Digital marketing: how to plan a winning strategy\" Sapienza Università di Roma Master's Degree; Master's,  Managent Engineering , 110 cum laude 2007  – 2010 Thesis: \"Digital marketing: how to plan a winning strategy\" Sapienza Università di Roma Master's Degree; Master's,  Managent Engineering , 110 cum laude 2007  – 2010 Thesis: \"Digital marketing: how to plan a winning strategy\" Sapienza Università di Roma Bachelor's Degree; Bachelor's,  Management Engineering , 110 2004  – 2007 Thesis: \"Regulation of airports in Italy\" Sapienza Università di Roma Bachelor's Degree; Bachelor's,  Management Engineering , 110 2004  – 2007 Thesis: \"Regulation of airports in Italy\" Sapienza Università di Roma Bachelor's Degree; Bachelor's,  Management Engineering , 110 2004  – 2007 Thesis: \"Regulation of airports in Italy\" Liceo classico Goffredo Mameli High school diploma,  Classics , 84/100 1999  – 2004 Liceo classico Goffredo Mameli High school diploma,  Classics , 84/100 1999  – 2004 Liceo classico Goffredo Mameli High school diploma,  Classics , 84/100 1999  – 2004 Cyfair High-School English , Top marks in all subjects 2002  – 2003 American Literature and language Cyfair High-School English , Top marks in all subjects 2002  – 2003 American Literature and language Cyfair High-School English , Top marks in all subjects 2002  – 2003 American Literature and language ", "Experience SMB Sales Manager Google October 2013  – Present (1 year 11 months) Managed an average of 11 sales Googlers to educate and up-sell high-value ($5k-$75k quarterly spend) advertising clients.  \nExceeded revenue and productivity targets by 1% and 4% respectively.  \nAchieved an average of $22M annualized incremental impact.  \nTeam responsible for managing book of business spending an average of $25M on a quarterly basis. Enhanced Campaigns Program Manager, Central Revenue Programs Team Google 2013  –  2013  (less than a year) Mountain View, CA Managed operations for 150 vendors across 5 locations globally to prepare SMB advertisers for the largest platform shift in AdWords history.  \n \nPartnered with engineering, marketing, sales, and customer service to deliver against aggressive revenue and migration targets to ensure Google and SMB advertisers were prepared for the changing mobile landscape. Rotational Sales Manager, SMB Sales Google 2012  –  2013  (1 year) Mountain View, CA Small and Medium Business Sales \nManaged 11 sales Nooglers to educate and up-sell high-value advertising clients. Attained stronger team metrics than average team composed of both new and tenured members. \n$22 million incremental impact. Team responsible for book of $xxx million.  \nLed team strategic discussions to determine priority areas focused on building sales pipeline for future quarters. \nFostered a collaborative culture through team TGIFs, lunches, and offsites.  \n \nOnboarding Lead \nRevamped onboarding through strategic partnership with Learning & Development to improve the quality of training and place a stronger emphasis on mentorship. \nCo-created the SMB Sales Noogler Mentor Program tool for global use among sales reps, mentors, and managers to stay informed on Noogler progress.  \n \nCompliance Lead \nManaged 7 gurus to ensure fair measurement of client interactions and performance against targets. \nExplored new methods of enforcing quality guidelines through close partnership with the SMB Revenue Team. AdWords Account Strategist & Team Captain Google 2011  –  2012  (1 year) Mountain View, CA Team Captain \nPartnered with senior management to create team's quarterly goals and built run rates to develop team strategy and pace for the quarter.  \n \nAccount Strategist \nDrove an average of $2.5 M annualized revenue uplift and managed a book of over 250 clients spending $20 M on average.  \nCreated education program to enhance team knowledge on complex products and features.  \nExceeded targets on average by 48% per quarter to help drive 29% y/y SMB revenue growth.  \nDeveloped external webinar series to further scale account treatment. \nAchieved double the average team revenue impact in Q2 2011. Economic Consultant The Udinsky Group July 2010  –  January 2011  (7 months) Berkeley, CA Calculated general damages in personal injury, death, and other cases. \nActed as an economic consultant to lawyers and life planners. SMB Sales Manager Google October 2013  – Present (1 year 11 months) Managed an average of 11 sales Googlers to educate and up-sell high-value ($5k-$75k quarterly spend) advertising clients.  \nExceeded revenue and productivity targets by 1% and 4% respectively.  \nAchieved an average of $22M annualized incremental impact.  \nTeam responsible for managing book of business spending an average of $25M on a quarterly basis. SMB Sales Manager Google October 2013  – Present (1 year 11 months) Managed an average of 11 sales Googlers to educate and up-sell high-value ($5k-$75k quarterly spend) advertising clients.  \nExceeded revenue and productivity targets by 1% and 4% respectively.  \nAchieved an average of $22M annualized incremental impact.  \nTeam responsible for managing book of business spending an average of $25M on a quarterly basis. Enhanced Campaigns Program Manager, Central Revenue Programs Team Google 2013  –  2013  (less than a year) Mountain View, CA Managed operations for 150 vendors across 5 locations globally to prepare SMB advertisers for the largest platform shift in AdWords history.  \n \nPartnered with engineering, marketing, sales, and customer service to deliver against aggressive revenue and migration targets to ensure Google and SMB advertisers were prepared for the changing mobile landscape. Enhanced Campaigns Program Manager, Central Revenue Programs Team Google 2013  –  2013  (less than a year) Mountain View, CA Managed operations for 150 vendors across 5 locations globally to prepare SMB advertisers for the largest platform shift in AdWords history.  \n \nPartnered with engineering, marketing, sales, and customer service to deliver against aggressive revenue and migration targets to ensure Google and SMB advertisers were prepared for the changing mobile landscape. Rotational Sales Manager, SMB Sales Google 2012  –  2013  (1 year) Mountain View, CA Small and Medium Business Sales \nManaged 11 sales Nooglers to educate and up-sell high-value advertising clients. Attained stronger team metrics than average team composed of both new and tenured members. \n$22 million incremental impact. Team responsible for book of $xxx million.  \nLed team strategic discussions to determine priority areas focused on building sales pipeline for future quarters. \nFostered a collaborative culture through team TGIFs, lunches, and offsites.  \n \nOnboarding Lead \nRevamped onboarding through strategic partnership with Learning & Development to improve the quality of training and place a stronger emphasis on mentorship. \nCo-created the SMB Sales Noogler Mentor Program tool for global use among sales reps, mentors, and managers to stay informed on Noogler progress.  \n \nCompliance Lead \nManaged 7 gurus to ensure fair measurement of client interactions and performance against targets. \nExplored new methods of enforcing quality guidelines through close partnership with the SMB Revenue Team. Rotational Sales Manager, SMB Sales Google 2012  –  2013  (1 year) Mountain View, CA Small and Medium Business Sales \nManaged 11 sales Nooglers to educate and up-sell high-value advertising clients. Attained stronger team metrics than average team composed of both new and tenured members. \n$22 million incremental impact. Team responsible for book of $xxx million.  \nLed team strategic discussions to determine priority areas focused on building sales pipeline for future quarters. \nFostered a collaborative culture through team TGIFs, lunches, and offsites.  \n \nOnboarding Lead \nRevamped onboarding through strategic partnership with Learning & Development to improve the quality of training and place a stronger emphasis on mentorship. \nCo-created the SMB Sales Noogler Mentor Program tool for global use among sales reps, mentors, and managers to stay informed on Noogler progress.  \n \nCompliance Lead \nManaged 7 gurus to ensure fair measurement of client interactions and performance against targets. \nExplored new methods of enforcing quality guidelines through close partnership with the SMB Revenue Team. AdWords Account Strategist & Team Captain Google 2011  –  2012  (1 year) Mountain View, CA Team Captain \nPartnered with senior management to create team's quarterly goals and built run rates to develop team strategy and pace for the quarter.  \n \nAccount Strategist \nDrove an average of $2.5 M annualized revenue uplift and managed a book of over 250 clients spending $20 M on average.  \nCreated education program to enhance team knowledge on complex products and features.  \nExceeded targets on average by 48% per quarter to help drive 29% y/y SMB revenue growth.  \nDeveloped external webinar series to further scale account treatment. \nAchieved double the average team revenue impact in Q2 2011. AdWords Account Strategist & Team Captain Google 2011  –  2012  (1 year) Mountain View, CA Team Captain \nPartnered with senior management to create team's quarterly goals and built run rates to develop team strategy and pace for the quarter.  \n \nAccount Strategist \nDrove an average of $2.5 M annualized revenue uplift and managed a book of over 250 clients spending $20 M on average.  \nCreated education program to enhance team knowledge on complex products and features.  \nExceeded targets on average by 48% per quarter to help drive 29% y/y SMB revenue growth.  \nDeveloped external webinar series to further scale account treatment. \nAchieved double the average team revenue impact in Q2 2011. Economic Consultant The Udinsky Group July 2010  –  January 2011  (7 months) Berkeley, CA Calculated general damages in personal injury, death, and other cases. \nActed as an economic consultant to lawyers and life planners. Economic Consultant The Udinsky Group July 2010  –  January 2011  (7 months) Berkeley, CA Calculated general damages in personal injury, death, and other cases. \nActed as an economic consultant to lawyers and life planners. Languages   Skills Google Adwords Management Microsoft Office Customer Service Marketing Project Management Social Media Sales Leadership Marketing Strategy Business Strategy Business Development Account Management Cross-functional Team... Strategy Google Analytics Online Advertising SEM See 3+     See less Skills  Google Adwords Management Microsoft Office Customer Service Marketing Project Management Social Media Sales Leadership Marketing Strategy Business Strategy Business Development Account Management Cross-functional Team... Strategy Google Analytics Online Advertising SEM See 3+     See less Google Adwords Management Microsoft Office Customer Service Marketing Project Management Social Media Sales Leadership Marketing Strategy Business Strategy Business Development Account Management Cross-functional Team... Strategy Google Analytics Online Advertising SEM See 3+     See less Google Adwords Management Microsoft Office Customer Service Marketing Project Management Social Media Sales Leadership Marketing Strategy Business Strategy Business Development Account Management Cross-functional Team... Strategy Google Analytics Online Advertising SEM See 3+     See less Education University of California, Davis Economics , 3.91 / 4.0 GPA 2006  – 2010 St. Ignatius College Preparatory 2002  – 2006 University of California, Davis Economics , 3.91 / 4.0 GPA 2006  – 2010 University of California, Davis Economics , 3.91 / 4.0 GPA 2006  – 2010 University of California, Davis Economics , 3.91 / 4.0 GPA 2006  – 2010 St. Ignatius College Preparatory 2002  – 2006 St. Ignatius College Preparatory 2002  – 2006 St. Ignatius College Preparatory 2002  – 2006 Honors & Awards Google's Great Manager Award Google Selected globally as one of Google's top twenty-two people managers \nReceived this honor the first time eligible to win \nCurrently, the youngest \"Googler\" to have ever won this award  Other Accolades Google VP Award, 2013 \nSMB Revenue award for building global coaching initiative \n \nGold Award, 2013 \nVoted as best SMB Sales Manager in North America \n \nPlatinum Award, 2012\t \nOutstanding sales performance and mentorship impact \n \n35 Peer Bonuses, 2011 - Present  \nTeam contribution across offices / globe, training and mentorship \n \nSales Certification, 2012 \nFirst SMB sales representative in North America to be sales certified \n \nGold Award, 2011  \nOverall team contribution and revenue impact \n \nSpot Bonus, 2011  \nExceeded sales targets and helped multiple members of the team reach targets \n \nSpot Bonus, 2011  \nDrove double the Q2 average team revenue impact \n Google's Great Manager Award Google Selected globally as one of Google's top twenty-two people managers \nReceived this honor the first time eligible to win \nCurrently, the youngest \"Googler\" to have ever won this award  Google's Great Manager Award Google Selected globally as one of Google's top twenty-two people managers \nReceived this honor the first time eligible to win \nCurrently, the youngest \"Googler\" to have ever won this award  Google's Great Manager Award Google Selected globally as one of Google's top twenty-two people managers \nReceived this honor the first time eligible to win \nCurrently, the youngest \"Googler\" to have ever won this award  Other Accolades Google VP Award, 2013 \nSMB Revenue award for building global coaching initiative \n \nGold Award, 2013 \nVoted as best SMB Sales Manager in North America \n \nPlatinum Award, 2012\t \nOutstanding sales performance and mentorship impact \n \n35 Peer Bonuses, 2011 - Present  \nTeam contribution across offices / globe, training and mentorship \n \nSales Certification, 2012 \nFirst SMB sales representative in North America to be sales certified \n \nGold Award, 2011  \nOverall team contribution and revenue impact \n \nSpot Bonus, 2011  \nExceeded sales targets and helped multiple members of the team reach targets \n \nSpot Bonus, 2011  \nDrove double the Q2 average team revenue impact \n Other Accolades Google VP Award, 2013 \nSMB Revenue award for building global coaching initiative \n \nGold Award, 2013 \nVoted as best SMB Sales Manager in North America \n \nPlatinum Award, 2012\t \nOutstanding sales performance and mentorship impact \n \n35 Peer Bonuses, 2011 - Present  \nTeam contribution across offices / globe, training and mentorship \n \nSales Certification, 2012 \nFirst SMB sales representative in North America to be sales certified \n \nGold Award, 2011  \nOverall team contribution and revenue impact \n \nSpot Bonus, 2011  \nExceeded sales targets and helped multiple members of the team reach targets \n \nSpot Bonus, 2011  \nDrove double the Q2 average team revenue impact \n Other Accolades Google VP Award, 2013 \nSMB Revenue award for building global coaching initiative \n \nGold Award, 2013 \nVoted as best SMB Sales Manager in North America \n \nPlatinum Award, 2012\t \nOutstanding sales performance and mentorship impact \n \n35 Peer Bonuses, 2011 - Present  \nTeam contribution across offices / globe, training and mentorship \n \nSales Certification, 2012 \nFirst SMB sales representative in North America to be sales certified \n \nGold Award, 2011  \nOverall team contribution and revenue impact \n \nSpot Bonus, 2011  \nExceeded sales targets and helped multiple members of the team reach targets \n \nSpot Bonus, 2011  \nDrove double the Q2 average team revenue impact \n ", "Experience Enterprise Sales Manager Google January 2014  – Present (1 year 8 months) For the past 6 years I have worked with many CXO's in different capacities to help them evaluate and deploy Google technology to transform their business, make their employees more productive, enable collaboration across the organization, save money and ultimately add business value. Large Customer Sales Manager Google January 2012  –  December 2013  (2 years) Enterprise Sales Manager Google January 2011  –  December 2011  (1 year) Mountain View, CA Enterprise Sales Representative Google January 2008  –  December 2010  (3 years) Major Account Manager Merrimak Capital September 2004  –  March 2008  (3 years 7 months) Enterprise Sales Manager Google January 2014  – Present (1 year 8 months) For the past 6 years I have worked with many CXO's in different capacities to help them evaluate and deploy Google technology to transform their business, make their employees more productive, enable collaboration across the organization, save money and ultimately add business value. Enterprise Sales Manager Google January 2014  – Present (1 year 8 months) For the past 6 years I have worked with many CXO's in different capacities to help them evaluate and deploy Google technology to transform their business, make their employees more productive, enable collaboration across the organization, save money and ultimately add business value. Large Customer Sales Manager Google January 2012  –  December 2013  (2 years) Large Customer Sales Manager Google January 2012  –  December 2013  (2 years) Enterprise Sales Manager Google January 2011  –  December 2011  (1 year) Mountain View, CA Enterprise Sales Manager Google January 2011  –  December 2011  (1 year) Mountain View, CA Enterprise Sales Representative Google January 2008  –  December 2010  (3 years) Enterprise Sales Representative Google January 2008  –  December 2010  (3 years) Major Account Manager Merrimak Capital September 2004  –  March 2008  (3 years 7 months) Major Account Manager Merrimak Capital September 2004  –  March 2008  (3 years 7 months) Languages   Skills SaaS Cloud Computing PaaS Enterprise Software Strategic Partnerships Google Apps Mobility Cloud Transformation Google Enterprise Solution Selling Account Management Mobile Internet Complex Sales Salesforce.com Go-to-market Strategy New Business Development Business Development Sales Lead Generation Chrome Channel Partners See 6+     See less Skills  SaaS Cloud Computing PaaS Enterprise Software Strategic Partnerships Google Apps Mobility Cloud Transformation Google Enterprise Solution Selling Account Management Mobile Internet Complex Sales Salesforce.com Go-to-market Strategy New Business Development Business Development Sales Lead Generation Chrome Channel Partners See 6+     See less SaaS Cloud Computing PaaS Enterprise Software Strategic Partnerships Google Apps Mobility Cloud Transformation Google Enterprise Solution Selling Account Management Mobile Internet Complex Sales Salesforce.com Go-to-market Strategy New Business Development Business Development Sales Lead Generation Chrome Channel Partners See 6+     See less SaaS Cloud Computing PaaS Enterprise Software Strategic Partnerships Google Apps Mobility Cloud Transformation Google Enterprise Solution Selling Account Management Mobile Internet Complex Sales Salesforce.com Go-to-market Strategy New Business Development Business Development Sales Lead Generation Chrome Channel Partners See 6+     See less Education Santa Clara University BS,  Psychology and Finance 1999  – 2003 Gonzaga-In-Florence 2001  – 2002 Santa Clara University BS,  Psychology and Finance 1999  – 2003 Santa Clara University BS,  Psychology and Finance 1999  – 2003 Santa Clara University BS,  Psychology and Finance 1999  – 2003 Gonzaga-In-Florence 2001  – 2002 Gonzaga-In-Florence 2001  – 2002 Gonzaga-In-Florence 2001  – 2002 Honors & Awards ", "Summary New technology Sales Executive with more than 15 years of experience managing sales teams.  \nExperience with disruptive technologies and adapting them to new markets. \n \nProven skills on Sales Strategy, Channel Sales, Sales Management, Internet Technologies, Digital  \nMarketing, Cloud Computing, Document Management, Enterprise Search and Geo Solutions Summary New technology Sales Executive with more than 15 years of experience managing sales teams.  \nExperience with disruptive technologies and adapting them to new markets. \n \nProven skills on Sales Strategy, Channel Sales, Sales Management, Internet Technologies, Digital  \nMarketing, Cloud Computing, Document Management, Enterprise Search and Geo Solutions New technology Sales Executive with more than 15 years of experience managing sales teams.  \nExperience with disruptive technologies and adapting them to new markets. \n \nProven skills on Sales Strategy, Channel Sales, Sales Management, Internet Technologies, Digital  \nMarketing, Cloud Computing, Document Management, Enterprise Search and Geo Solutions New technology Sales Executive with more than 15 years of experience managing sales teams.  \nExperience with disruptive technologies and adapting them to new markets. \n \nProven skills on Sales Strategy, Channel Sales, Sales Management, Internet Technologies, Digital  \nMarketing, Cloud Computing, Document Management, Enterprise Search and Geo Solutions Experience Sales Manager Google October 2013  – Present (1 year 11 months) Mexico City Area, Mexico Mexico New Business Sales Manager Google January 2012  –  September 2013  (1 year 9 months) Mexico City Area, Mexico Enterprise Sales Manager Google July 2007  –  February 2012  (4 years 8 months) Sr Systems Engineer EMC March 2006  –  July 2007  (1 year 5 months) Systems Engineer Verity February 2001  –  July 2005  (4 years 6 months) Project Leader QosLabs February 1997  –  February 2001  (4 years 1 month) Sales Manager Google October 2013  – Present (1 year 11 months) Mexico City Area, Mexico Sales Manager Google October 2013  – Present (1 year 11 months) Mexico City Area, Mexico Mexico New Business Sales Manager Google January 2012  –  September 2013  (1 year 9 months) Mexico City Area, Mexico Mexico New Business Sales Manager Google January 2012  –  September 2013  (1 year 9 months) Mexico City Area, Mexico Enterprise Sales Manager Google July 2007  –  February 2012  (4 years 8 months) Enterprise Sales Manager Google July 2007  –  February 2012  (4 years 8 months) Sr Systems Engineer EMC March 2006  –  July 2007  (1 year 5 months) Sr Systems Engineer EMC March 2006  –  July 2007  (1 year 5 months) Systems Engineer Verity February 2001  –  July 2005  (4 years 6 months) Systems Engineer Verity February 2001  –  July 2005  (4 years 6 months) Project Leader QosLabs February 1997  –  February 2001  (4 years 1 month) Project Leader QosLabs February 1997  –  February 2001  (4 years 1 month) Skills Google Search Appliance Enterprise Search Google Apps Google Maps SaaS Enterprise Software Cloud Computing Email Security Google Earth Direct Sales Enterprise Collaboration Geospatial Digital Marketing Sales Management Skills  Google Search Appliance Enterprise Search Google Apps Google Maps SaaS Enterprise Software Cloud Computing Email Security Google Earth Direct Sales Enterprise Collaboration Geospatial Digital Marketing Sales Management Google Search Appliance Enterprise Search Google Apps Google Maps SaaS Enterprise Software Cloud Computing Email Security Google Earth Direct Sales Enterprise Collaboration Geospatial Digital Marketing Sales Management Google Search Appliance Enterprise Search Google Apps Google Maps SaaS Enterprise Software Cloud Computing Email Security Google Earth Direct Sales Enterprise Collaboration Geospatial Digital Marketing Sales Management Education Universidad del Valle de México LSCA 1991  – 1995 Universidad del Valle de México LSCA 1991  – 1995 Universidad del Valle de México LSCA 1991  – 1995 Universidad del Valle de México LSCA 1991  – 1995 Universidad del Valle de México LSCA 1991  – 1995 Universidad del Valle de México LSCA 1991  – 1995 Universidad del Valle de México LSCA 1991  – 1995 Universidad del Valle de México LSCA 1991  – 1995 ", "Summary I'm running the London Marathon this year with the Google Cancer Research UK team. Please do consider sponsoring us/me :) - The great news is that Google will \"Match\" all your donations www.virginmoneygiving.com/PeterGiles26miles \n \nAs Retail Partner Manager, Google Play Gift Cards, I'm focused on partnering with European retail brands to drive sales of Google Play Gift Cards. Summary I'm running the London Marathon this year with the Google Cancer Research UK team. Please do consider sponsoring us/me :) - The great news is that Google will \"Match\" all your donations www.virginmoneygiving.com/PeterGiles26miles \n \nAs Retail Partner Manager, Google Play Gift Cards, I'm focused on partnering with European retail brands to drive sales of Google Play Gift Cards. I'm running the London Marathon this year with the Google Cancer Research UK team. Please do consider sponsoring us/me :) - The great news is that Google will \"Match\" all your donations www.virginmoneygiving.com/PeterGiles26miles \n \nAs Retail Partner Manager, Google Play Gift Cards, I'm focused on partnering with European retail brands to drive sales of Google Play Gift Cards. I'm running the London Marathon this year with the Google Cancer Research UK team. Please do consider sponsoring us/me :) - The great news is that Google will \"Match\" all your donations www.virginmoneygiving.com/PeterGiles26miles \n \nAs Retail Partner Manager, Google Play Gift Cards, I'm focused on partnering with European retail brands to drive sales of Google Play Gift Cards. Experience Sales Manager, Agency Google March 2015  – Present (6 months) London, United Kingdom Helping the UK's leading independent digital marketing agencies get the most out of Google's product portfolio, and deliver the best solutions for their clients. Sales Manager, Retail Google May 2011  –  February 2014  (2 years 10 months) London, United Kingdom Working with advertisers and their agencies to develop performance and branding solutions across Google's product portfolio and platforms: Search; Display & Video, with a focus on the home furnishings and electronics verticals in UK and EMEA. Key advertisers included: Made.com, Hillarys Blinds, Etsy, Dunelm, ebuyer.com, blinds-2go.co.uk. Lead Recruiter EMEA Google August 2009  –  May 2011  (1 year 10 months) Lead Recruiter for the EMEA Sales and Marketing teams, with a focus on Northern Europe and specifically Germany. Co-Founder Citizens International July 2008  –  August 2009  (1 year 2 months) International recruitment and executive search services for digital media, marketing and e-commerce solutions. Senior Recruiter - Sales and Marketing Google January 2007  –  June 2008  (1 year 6 months) Senior recruiter for the Google and YouTube marketing and sales teams in the London, German and Scandinavian offices. Recruitment Consultant Gabriele Skelton February 2005  –  January 2007  (2 years) Recruiting Managers and Strategists for top digital agencies, predominantly based in London. Freelance Brand Strategy Consultant Fresh Partners; Circus June 2003  –  December 2004  (1 year 7 months) Led personality and business brand strategy consultancy projects: Jamie Oliver; Jane Clarke, Lawrence Llewelyn-Bowen; British Gas Founder Nooza.com March 2001  –  May 2003  (2 years 3 months) Launched a national network of booksellers to review unpublished novels; and exhibit the best to agents and publishers. Became a literary agent and developed a print-on-demand 'market test' model for new writing. Sold a children's book to the man who discovered JK Rowling. Brand Strategy Consultant Razorfish January 2000  –  February 2001  (1 year 2 months) Brand strategist - helping originate and develop online brands. Branding Consultant Interbrand Newell & Sorrell October 1998  –  December 1999  (1 year 3 months) Brand Naming consultant. Developed the brand names Invensys, Vivaro, and a few other less glamorous ones... Marketing Manager / NPD Citibank March 1997  –  September 1998  (1 year 7 months) Developed new credit card concepts in Germany and launched a co-branded card with the football clubs. Marketing Consultant Infratest Burke August 1995  –  February 1997  (1 year 7 months) Research consultant on sales forecasting for new fmcg products and concepts. Worked on P&G, Kimberly Clarke, and SmithKline and others. Helped develop business into pharmaceutical co's. Sales Manager, Agency Google March 2015  – Present (6 months) London, United Kingdom Helping the UK's leading independent digital marketing agencies get the most out of Google's product portfolio, and deliver the best solutions for their clients. Sales Manager, Agency Google March 2015  – Present (6 months) London, United Kingdom Helping the UK's leading independent digital marketing agencies get the most out of Google's product portfolio, and deliver the best solutions for their clients. Sales Manager, Retail Google May 2011  –  February 2014  (2 years 10 months) London, United Kingdom Working with advertisers and their agencies to develop performance and branding solutions across Google's product portfolio and platforms: Search; Display & Video, with a focus on the home furnishings and electronics verticals in UK and EMEA. Key advertisers included: Made.com, Hillarys Blinds, Etsy, Dunelm, ebuyer.com, blinds-2go.co.uk. Sales Manager, Retail Google May 2011  –  February 2014  (2 years 10 months) London, United Kingdom Working with advertisers and their agencies to develop performance and branding solutions across Google's product portfolio and platforms: Search; Display & Video, with a focus on the home furnishings and electronics verticals in UK and EMEA. Key advertisers included: Made.com, Hillarys Blinds, Etsy, Dunelm, ebuyer.com, blinds-2go.co.uk. Lead Recruiter EMEA Google August 2009  –  May 2011  (1 year 10 months) Lead Recruiter for the EMEA Sales and Marketing teams, with a focus on Northern Europe and specifically Germany. Lead Recruiter EMEA Google August 2009  –  May 2011  (1 year 10 months) Lead Recruiter for the EMEA Sales and Marketing teams, with a focus on Northern Europe and specifically Germany. Co-Founder Citizens International July 2008  –  August 2009  (1 year 2 months) International recruitment and executive search services for digital media, marketing and e-commerce solutions. Co-Founder Citizens International July 2008  –  August 2009  (1 year 2 months) International recruitment and executive search services for digital media, marketing and e-commerce solutions. Senior Recruiter - Sales and Marketing Google January 2007  –  June 2008  (1 year 6 months) Senior recruiter for the Google and YouTube marketing and sales teams in the London, German and Scandinavian offices. Senior Recruiter - Sales and Marketing Google January 2007  –  June 2008  (1 year 6 months) Senior recruiter for the Google and YouTube marketing and sales teams in the London, German and Scandinavian offices. Recruitment Consultant Gabriele Skelton February 2005  –  January 2007  (2 years) Recruiting Managers and Strategists for top digital agencies, predominantly based in London. Recruitment Consultant Gabriele Skelton February 2005  –  January 2007  (2 years) Recruiting Managers and Strategists for top digital agencies, predominantly based in London. Freelance Brand Strategy Consultant Fresh Partners; Circus June 2003  –  December 2004  (1 year 7 months) Led personality and business brand strategy consultancy projects: Jamie Oliver; Jane Clarke, Lawrence Llewelyn-Bowen; British Gas Freelance Brand Strategy Consultant Fresh Partners; Circus June 2003  –  December 2004  (1 year 7 months) Led personality and business brand strategy consultancy projects: Jamie Oliver; Jane Clarke, Lawrence Llewelyn-Bowen; British Gas Founder Nooza.com March 2001  –  May 2003  (2 years 3 months) Launched a national network of booksellers to review unpublished novels; and exhibit the best to agents and publishers. Became a literary agent and developed a print-on-demand 'market test' model for new writing. Sold a children's book to the man who discovered JK Rowling. Founder Nooza.com March 2001  –  May 2003  (2 years 3 months) Launched a national network of booksellers to review unpublished novels; and exhibit the best to agents and publishers. Became a literary agent and developed a print-on-demand 'market test' model for new writing. Sold a children's book to the man who discovered JK Rowling. Brand Strategy Consultant Razorfish January 2000  –  February 2001  (1 year 2 months) Brand strategist - helping originate and develop online brands. Brand Strategy Consultant Razorfish January 2000  –  February 2001  (1 year 2 months) Brand strategist - helping originate and develop online brands. Branding Consultant Interbrand Newell & Sorrell October 1998  –  December 1999  (1 year 3 months) Brand Naming consultant. Developed the brand names Invensys, Vivaro, and a few other less glamorous ones... Branding Consultant Interbrand Newell & Sorrell October 1998  –  December 1999  (1 year 3 months) Brand Naming consultant. Developed the brand names Invensys, Vivaro, and a few other less glamorous ones... Marketing Manager / NPD Citibank March 1997  –  September 1998  (1 year 7 months) Developed new credit card concepts in Germany and launched a co-branded card with the football clubs. Marketing Manager / NPD Citibank March 1997  –  September 1998  (1 year 7 months) Developed new credit card concepts in Germany and launched a co-branded card with the football clubs. Marketing Consultant Infratest Burke August 1995  –  February 1997  (1 year 7 months) Research consultant on sales forecasting for new fmcg products and concepts. Worked on P&G, Kimberly Clarke, and SmithKline and others. Helped develop business into pharmaceutical co's. Marketing Consultant Infratest Burke August 1995  –  February 1997  (1 year 7 months) Research consultant on sales forecasting for new fmcg products and concepts. Worked on P&G, Kimberly Clarke, and SmithKline and others. Helped develop business into pharmaceutical co's. Skills Digital Media YouTube Search Online Marketing PPC Online Advertising Digital Strategy SEM Digital Marketing Mobile Marketing Social Networking E-commerce New Media Search Advertising Online Video Mobile Advertising Display Advertising Executive Search Recruiting See 4+     See less Skills  Digital Media YouTube Search Online Marketing PPC Online Advertising Digital Strategy SEM Digital Marketing Mobile Marketing Social Networking E-commerce New Media Search Advertising Online Video Mobile Advertising Display Advertising Executive Search Recruiting See 4+     See less Digital Media YouTube Search Online Marketing PPC Online Advertising Digital Strategy SEM Digital Marketing Mobile Marketing Social Networking E-commerce New Media Search Advertising Online Video Mobile Advertising Display Advertising Executive Search Recruiting See 4+     See less Digital Media YouTube Search Online Marketing PPC Online Advertising Digital Strategy SEM Digital Marketing Mobile Marketing Social Networking E-commerce New Media Search Advertising Online Video Mobile Advertising Display Advertising Executive Search Recruiting See 4+     See less Education Exeter University BA September 1992  – May 1995 Exeter University BA September 1992  – May 1995 Exeter University BA September 1992  – May 1995 Exeter University BA September 1992  – May 1995 ", "Experience Enterprise Sales Manager, Strategic Accounts Google January 2015  – Present (8 months) Sydney Area, Australia Co-Founder and Director Oasis Africa Australia, non-profit organisation June 2005  – Present (10 years 3 months) Sydney Oasis Africa Australia supports children living in the slums of Nairobi in Kenya. By helping one child through Education, we are helping a whole community. oasisafrica.org.au Enterprise Sales Manager, Search Google January 2013  –  December 2014  (2 years) Enterprise Sales Manager Google Australia January 2010  –  December 2012  (3 years) Sydney Federal Account Manager Quest Software May 2008  –  December 2009  (1 year 8 months) Senior Software Sales Specialist - Northern Region IBM Australia January 2005  –  April 2008  (3 years 4 months) Software Sales Specialist IBM 2000  –  2005  (5 years) Channel Manager IBM Australia February 1996  –  1999  (3 years) Enterprise Sales Manager, Strategic Accounts Google January 2015  – Present (8 months) Sydney Area, Australia Enterprise Sales Manager, Strategic Accounts Google January 2015  – Present (8 months) Sydney Area, Australia Co-Founder and Director Oasis Africa Australia, non-profit organisation June 2005  – Present (10 years 3 months) Sydney Oasis Africa Australia supports children living in the slums of Nairobi in Kenya. By helping one child through Education, we are helping a whole community. oasisafrica.org.au Co-Founder and Director Oasis Africa Australia, non-profit organisation June 2005  – Present (10 years 3 months) Sydney Oasis Africa Australia supports children living in the slums of Nairobi in Kenya. By helping one child through Education, we are helping a whole community. oasisafrica.org.au Enterprise Sales Manager, Search Google January 2013  –  December 2014  (2 years) Enterprise Sales Manager, Search Google January 2013  –  December 2014  (2 years) Enterprise Sales Manager Google Australia January 2010  –  December 2012  (3 years) Sydney Enterprise Sales Manager Google Australia January 2010  –  December 2012  (3 years) Sydney Federal Account Manager Quest Software May 2008  –  December 2009  (1 year 8 months) Federal Account Manager Quest Software May 2008  –  December 2009  (1 year 8 months) Senior Software Sales Specialist - Northern Region IBM Australia January 2005  –  April 2008  (3 years 4 months) Senior Software Sales Specialist - Northern Region IBM Australia January 2005  –  April 2008  (3 years 4 months) Software Sales Specialist IBM 2000  –  2005  (5 years) Software Sales Specialist IBM 2000  –  2005  (5 years) Channel Manager IBM Australia February 1996  –  1999  (3 years) Channel Manager IBM Australia February 1996  –  1999  (3 years) Skills Social Media Change Management Cloud Computing Mobile Devices IT Solutions Board of Directors Sales Management Enterprise Software Public Speaking Culture Change Business Innovation Technological Innovation Leadership Development SaaS Collaboration Tools Collaboration Solutions Google Trends See 2+     See less Skills  Social Media Change Management Cloud Computing Mobile Devices IT Solutions Board of Directors Sales Management Enterprise Software Public Speaking Culture Change Business Innovation Technological Innovation Leadership Development SaaS Collaboration Tools Collaboration Solutions Google Trends See 2+     See less Social Media Change Management Cloud Computing Mobile Devices IT Solutions Board of Directors Sales Management Enterprise Software Public Speaking Culture Change Business Innovation Technological Innovation Leadership Development SaaS Collaboration Tools Collaboration Solutions Google Trends See 2+     See less Social Media Change Management Cloud Computing Mobile Devices IT Solutions Board of Directors Sales Management Enterprise Software Public Speaking Culture Change Business Innovation Technological Innovation Leadership Development SaaS Collaboration Tools Collaboration Solutions Google Trends See 2+     See less Education Monash University Bachelor of Business Systems,  Business Computing and Marketing 1994  – 1996 Scholarship Stream Monash University Bachelor of Business Systems,  Business Computing and Marketing 1994  – 1996 Scholarship Stream Monash University Bachelor of Business Systems,  Business Computing and Marketing 1994  – 1996 Scholarship Stream Monash University Bachelor of Business Systems,  Business Computing and Marketing 1994  – 1996 Scholarship Stream ", "Experience Sales Manager Brand Activation, DACH Google November 2013  – Present (1 year 10 months) Solutions Sales Manager, Financial Services Google March 2013  –  November 2013  (9 months) Product Specialist, YouTube Google April 2011  –  February 2013  (1 year 11 months) Senior Industry Analyst Google May 2010  –  March 2011  (11 months) Industry Analyst Google January 2009  –  April 2010  (1 year 4 months) Junior Key Account and Marketing Manager, Digital Sales Universal Music Group March 2007  –  December 2008  (1 year 10 months) Berlin Area, Germany Producer TV Globo May 2006  –  July 2006  (3 months) Munich Area, Germany Support the editorial production for TV Globo during World Cup 2006. Sales Manager Brand Activation, DACH Google November 2013  – Present (1 year 10 months) Sales Manager Brand Activation, DACH Google November 2013  – Present (1 year 10 months) Solutions Sales Manager, Financial Services Google March 2013  –  November 2013  (9 months) Solutions Sales Manager, Financial Services Google March 2013  –  November 2013  (9 months) Product Specialist, YouTube Google April 2011  –  February 2013  (1 year 11 months) Product Specialist, YouTube Google April 2011  –  February 2013  (1 year 11 months) Senior Industry Analyst Google May 2010  –  March 2011  (11 months) Senior Industry Analyst Google May 2010  –  March 2011  (11 months) Industry Analyst Google January 2009  –  April 2010  (1 year 4 months) Industry Analyst Google January 2009  –  April 2010  (1 year 4 months) Junior Key Account and Marketing Manager, Digital Sales Universal Music Group March 2007  –  December 2008  (1 year 10 months) Berlin Area, Germany Junior Key Account and Marketing Manager, Digital Sales Universal Music Group March 2007  –  December 2008  (1 year 10 months) Berlin Area, Germany Producer TV Globo May 2006  –  July 2006  (3 months) Munich Area, Germany Support the editorial production for TV Globo during World Cup 2006. Producer TV Globo May 2006  –  July 2006  (3 months) Munich Area, Germany Support the editorial production for TV Globo during World Cup 2006. Languages English Full professional proficiency German Full professional proficiency Spanish Full professional proficiency Portuguese Native or bilingual proficiency French Limited working proficiency English Full professional proficiency German Full professional proficiency Spanish Full professional proficiency Portuguese Native or bilingual proficiency French Limited working proficiency English Full professional proficiency German Full professional proficiency Spanish Full professional proficiency Portuguese Native or bilingual proficiency French Limited working proficiency Full professional proficiency Full professional proficiency Full professional proficiency Native or bilingual proficiency Limited working proficiency Skills Digital Marketing Sales Online Advertising SEM Online-Marketing Solution Selling Marketing Digital Strategy Online Marketing Skills  Digital Marketing Sales Online Advertising SEM Online-Marketing Solution Selling Marketing Digital Strategy Online Marketing Digital Marketing Sales Online Advertising SEM Online-Marketing Solution Selling Marketing Digital Strategy Online Marketing Digital Marketing Sales Online Advertising SEM Online-Marketing Solution Selling Marketing Digital Strategy Online Marketing Education Fachhochschule für Technik und Wirtschaft Berlin Master of Arts (M.A.),  Business Communication Management 2005  – 2007 Universidade Federal do Rio de Janeiro Bachelor of Arts (B.A.),  Communication and Media Studies 2000  – 2004 Fachhochschule für Technik und Wirtschaft Berlin Master of Arts (M.A.),  Business Communication Management 2005  – 2007 Fachhochschule für Technik und Wirtschaft Berlin Master of Arts (M.A.),  Business Communication Management 2005  – 2007 Fachhochschule für Technik und Wirtschaft Berlin Master of Arts (M.A.),  Business Communication Management 2005  – 2007 Universidade Federal do Rio de Janeiro Bachelor of Arts (B.A.),  Communication and Media Studies 2000  – 2004 Universidade Federal do Rio de Janeiro Bachelor of Arts (B.A.),  Communication and Media Studies 2000  – 2004 Universidade Federal do Rio de Janeiro Bachelor of Arts (B.A.),  Communication and Media Studies 2000  – 2004 "]}