{"position": "Senior UI Designer", "company": "Google", "profiles": ["Experience Lead of Chrome UX Team Google January 2015  – Present (8 months) Staff UI Designer | Chrome Google November 2009  – Present (5 years 10 months) User Experience Researcher Google August 2007  –  November 2009  (2 years 4 months) Usability Analyst Intern Google June 2006  –  August 2006  (3 months) Lead of Chrome UX Team Google January 2015  – Present (8 months) Lead of Chrome UX Team Google January 2015  – Present (8 months) Staff UI Designer | Chrome Google November 2009  – Present (5 years 10 months) Staff UI Designer | Chrome Google November 2009  – Present (5 years 10 months) User Experience Researcher Google August 2007  –  November 2009  (2 years 4 months) User Experience Researcher Google August 2007  –  November 2009  (2 years 4 months) Usability Analyst Intern Google June 2006  –  August 2006  (3 months) Usability Analyst Intern Google June 2006  –  August 2006  (3 months) Skills User Experience User Interface Usability User-centered Design Mobile Applications User Interface Design Usability Testing Mobile Devices Interaction Design Web Development Skills  User Experience User Interface Usability User-centered Design Mobile Applications User Interface Design Usability Testing Mobile Devices Interaction Design Web Development User Experience User Interface Usability User-centered Design Mobile Applications User Interface Design Usability Testing Mobile Devices Interaction Design Web Development User Experience User Interface Usability User-centered Design Mobile Applications User Interface Design Usability Testing Mobile Devices Interaction Design Web Development Education Stanford University Bachelor of Science (B.S.),  Symbolic Systems (HCI) 2003  – 2007 Stanford University Bachelor of Science (B.S.),  Symbolic Systems (HCI) 2003  – 2007 Stanford University Bachelor of Science (B.S.),  Symbolic Systems (HCI) 2003  – 2007 Stanford University Bachelor of Science (B.S.),  Symbolic Systems (HCI) 2003  – 2007 ", "Summary 8 years of industry experience creating environments for user interaction with a specialization in web and mobile formats. Summary 8 years of industry experience creating environments for user interaction with a specialization in web and mobile formats. 8 years of industry experience creating environments for user interaction with a specialization in web and mobile formats. 8 years of industry experience creating environments for user interaction with a specialization in web and mobile formats. Experience UI Designer, Synergis at Google Google July 2015  – Present (2 months) Lead UI/UX Designer Crittercism October 2012  –  February 2015  (2 years 5 months) San Francisco Bay Area I was responsible for establishing a brand identity, visual language, and user experiences. I designed new and innovative products in a fledgling industry. Additionally I was instrumental in pioneering concepts and features in application performance management for mobile devices. UI/UX Designer SuperBetter May 2012  –  July 2012  (3 months) San Francisco Bay Area Work alongside creative team to design comps that adhere to highest standards of consistency, flow, usability, and aesthetics. Investigate, prioritize, implement, and test changes, bug fixes, and enhancements to SuperBetter. Estimate front-end costs for new features, identify usability and impact, and design solutions within constraints. Primarily responsible for designing and developing a strong UI/UX for the iOS version of SuperBetter. Senior Web and UI Designer Bigpoint Inc July 2010  –  May 2012  (1 year 11 months) San Francisco Bay Area Responsibilities include: designing compelling websites and layouts, including creation of wireframes, mockups, art assets and front end web development (HTML/CSS). As well as my web design duties, I also created wireframes and UI art assets for various titles in the studio and consulted with the different teams on ways which they could improve their UI or their User Experience User Interface Designer Independent Contractor March 2009  –  May 2010  (1 year 3 months) San Francisco Bay Area Clients included Openfeint and Crowdstar. User Interface Designer newZonia October 2008  –  February 2009  (5 months) Responsibilities include: creating assets for Flex templates in Fireworks, Illustrator and Photoshop; video editing and preparation for promotional events in After Effects and Premiere Pro; built user interface mockups with multiple variations, designed full site and page layouts to be used in templates. Additionally I was heavily involved in the creative process of designing the full site design and its information architecture. User Interfece Designer Tobi July 2007  –  September 2008  (1 year 3 months) Responsibilities include: web graphics, user flow, page design, newsletter design, HTML & CSS prototypes, creative library, information architecture, design and develop user interface & user experience. Game Master Blizzard Entertainment 2005  –  2008  (3 years) Game Master Blizzard Entertainment 2005  –  2008  (3 years) UI Designer, Synergis at Google Google July 2015  – Present (2 months) UI Designer, Synergis at Google Google July 2015  – Present (2 months) Lead UI/UX Designer Crittercism October 2012  –  February 2015  (2 years 5 months) San Francisco Bay Area I was responsible for establishing a brand identity, visual language, and user experiences. I designed new and innovative products in a fledgling industry. Additionally I was instrumental in pioneering concepts and features in application performance management for mobile devices. Lead UI/UX Designer Crittercism October 2012  –  February 2015  (2 years 5 months) San Francisco Bay Area I was responsible for establishing a brand identity, visual language, and user experiences. I designed new and innovative products in a fledgling industry. Additionally I was instrumental in pioneering concepts and features in application performance management for mobile devices. UI/UX Designer SuperBetter May 2012  –  July 2012  (3 months) San Francisco Bay Area Work alongside creative team to design comps that adhere to highest standards of consistency, flow, usability, and aesthetics. Investigate, prioritize, implement, and test changes, bug fixes, and enhancements to SuperBetter. Estimate front-end costs for new features, identify usability and impact, and design solutions within constraints. Primarily responsible for designing and developing a strong UI/UX for the iOS version of SuperBetter. UI/UX Designer SuperBetter May 2012  –  July 2012  (3 months) San Francisco Bay Area Work alongside creative team to design comps that adhere to highest standards of consistency, flow, usability, and aesthetics. Investigate, prioritize, implement, and test changes, bug fixes, and enhancements to SuperBetter. Estimate front-end costs for new features, identify usability and impact, and design solutions within constraints. Primarily responsible for designing and developing a strong UI/UX for the iOS version of SuperBetter. Senior Web and UI Designer Bigpoint Inc July 2010  –  May 2012  (1 year 11 months) San Francisco Bay Area Responsibilities include: designing compelling websites and layouts, including creation of wireframes, mockups, art assets and front end web development (HTML/CSS). As well as my web design duties, I also created wireframes and UI art assets for various titles in the studio and consulted with the different teams on ways which they could improve their UI or their User Experience Senior Web and UI Designer Bigpoint Inc July 2010  –  May 2012  (1 year 11 months) San Francisco Bay Area Responsibilities include: designing compelling websites and layouts, including creation of wireframes, mockups, art assets and front end web development (HTML/CSS). As well as my web design duties, I also created wireframes and UI art assets for various titles in the studio and consulted with the different teams on ways which they could improve their UI or their User Experience User Interface Designer Independent Contractor March 2009  –  May 2010  (1 year 3 months) San Francisco Bay Area Clients included Openfeint and Crowdstar. User Interface Designer Independent Contractor March 2009  –  May 2010  (1 year 3 months) San Francisco Bay Area Clients included Openfeint and Crowdstar. User Interface Designer newZonia October 2008  –  February 2009  (5 months) Responsibilities include: creating assets for Flex templates in Fireworks, Illustrator and Photoshop; video editing and preparation for promotional events in After Effects and Premiere Pro; built user interface mockups with multiple variations, designed full site and page layouts to be used in templates. Additionally I was heavily involved in the creative process of designing the full site design and its information architecture. User Interface Designer newZonia October 2008  –  February 2009  (5 months) Responsibilities include: creating assets for Flex templates in Fireworks, Illustrator and Photoshop; video editing and preparation for promotional events in After Effects and Premiere Pro; built user interface mockups with multiple variations, designed full site and page layouts to be used in templates. Additionally I was heavily involved in the creative process of designing the full site design and its information architecture. User Interfece Designer Tobi July 2007  –  September 2008  (1 year 3 months) Responsibilities include: web graphics, user flow, page design, newsletter design, HTML & CSS prototypes, creative library, information architecture, design and develop user interface & user experience. User Interfece Designer Tobi July 2007  –  September 2008  (1 year 3 months) Responsibilities include: web graphics, user flow, page design, newsletter design, HTML & CSS prototypes, creative library, information architecture, design and develop user interface & user experience. Game Master Blizzard Entertainment 2005  –  2008  (3 years) Game Master Blizzard Entertainment 2005  –  2008  (3 years) Game Master Blizzard Entertainment 2005  –  2008  (3 years) Game Master Blizzard Entertainment 2005  –  2008  (3 years) Skills Photoshop HTML CSS User Interface Design User Experience Web Design Vector Illustration Illustrator Photography Graphic Design Multimedia Game Development Adobe Fireworks Video Games Game Design Information Architecture Web Development PS3 Usability Layout User Interface Wireframes Art Mobile Devices iOS Mobile Applications Adobe Creative Suite Interaction Design Front-end See 14+     See less Skills  Photoshop HTML CSS User Interface Design User Experience Web Design Vector Illustration Illustrator Photography Graphic Design Multimedia Game Development Adobe Fireworks Video Games Game Design Information Architecture Web Development PS3 Usability Layout User Interface Wireframes Art Mobile Devices iOS Mobile Applications Adobe Creative Suite Interaction Design Front-end See 14+     See less Photoshop HTML CSS User Interface Design User Experience Web Design Vector Illustration Illustrator Photography Graphic Design Multimedia Game Development Adobe Fireworks Video Games Game Design Information Architecture Web Development PS3 Usability Layout User Interface Wireframes Art Mobile Devices iOS Mobile Applications Adobe Creative Suite Interaction Design Front-end See 14+     See less Photoshop HTML CSS User Interface Design User Experience Web Design Vector Illustration Illustrator Photography Graphic Design Multimedia Game Development Adobe Fireworks Video Games Game Design Information Architecture Web Development PS3 Usability Layout User Interface Wireframes Art Mobile Devices iOS Mobile Applications Adobe Creative Suite Interaction Design Front-end See 14+     See less Education Art Institute of Los Angeles, Orange County Bachelor of Science (BS),  Interactive Media Design 2003  – 2006 Laguna Beach High School Laguna Beach High School Art Institute of Los Angeles, Orange County Bachelor of Science (BS),  Interactive Media Design 2003  – 2006 Art Institute of Los Angeles, Orange County Bachelor of Science (BS),  Interactive Media Design 2003  – 2006 Art Institute of Los Angeles, Orange County Bachelor of Science (BS),  Interactive Media Design 2003  – 2006 Laguna Beach High School Laguna Beach High School Laguna Beach High School Laguna Beach High School Laguna Beach High School Laguna Beach High School ", "Summary I am currently based in London specialising in user interface design. I am passionate about the future of UI design and my writing on the trends in iOS design is featured in the top 50 'The Best of Medium'. I worked for the enterprise PIM startup Divide for two and a half years and we were acquired by Google in May where I have been working since. \nPreviously, I spent the last six years working as destroywerk.com designing record covers for international bands, was featured in Creative Review twice and have created tutorials for both Computer Arts and Digital Arts magazines.  \nI have lived in both Berlin and Buenos Aires for a year each where I worked with clients in different sectors and learnt from the experiences of other cultures. I also exhibited in both solo and group exhibitions such as the highly acclaimed ArteBA, South America's largest art fair. Summary I am currently based in London specialising in user interface design. I am passionate about the future of UI design and my writing on the trends in iOS design is featured in the top 50 'The Best of Medium'. I worked for the enterprise PIM startup Divide for two and a half years and we were acquired by Google in May where I have been working since. \nPreviously, I spent the last six years working as destroywerk.com designing record covers for international bands, was featured in Creative Review twice and have created tutorials for both Computer Arts and Digital Arts magazines.  \nI have lived in both Berlin and Buenos Aires for a year each where I worked with clients in different sectors and learnt from the experiences of other cultures. I also exhibited in both solo and group exhibitions such as the highly acclaimed ArteBA, South America's largest art fair. I am currently based in London specialising in user interface design. I am passionate about the future of UI design and my writing on the trends in iOS design is featured in the top 50 'The Best of Medium'. I worked for the enterprise PIM startup Divide for two and a half years and we were acquired by Google in May where I have been working since. \nPreviously, I spent the last six years working as destroywerk.com designing record covers for international bands, was featured in Creative Review twice and have created tutorials for both Computer Arts and Digital Arts magazines.  \nI have lived in both Berlin and Buenos Aires for a year each where I worked with clients in different sectors and learnt from the experiences of other cultures. I also exhibited in both solo and group exhibitions such as the highly acclaimed ArteBA, South America's largest art fair. I am currently based in London specialising in user interface design. I am passionate about the future of UI design and my writing on the trends in iOS design is featured in the top 50 'The Best of Medium'. I worked for the enterprise PIM startup Divide for two and a half years and we were acquired by Google in May where I have been working since. \nPreviously, I spent the last six years working as destroywerk.com designing record covers for international bands, was featured in Creative Review twice and have created tutorials for both Computer Arts and Digital Arts magazines.  \nI have lived in both Berlin and Buenos Aires for a year each where I worked with clients in different sectors and learnt from the experiences of other cultures. I also exhibited in both solo and group exhibitions such as the highly acclaimed ArteBA, South America's largest art fair. Experience Interaction Designer Google January 2015  – Present (8 months) London, United Kingdom UI Designer Google May 2014  –  January 2015  (9 months) London, United Kingdom Senior Visual Designer Divide™ (Acquired by Google) July 2013  –  May 2014  (11 months) London, United Kingdom Working alongside our Creative Director, I led our Android UI design. I also worked to develop the brand and help to drive product design on both iOS and Android platforms. Graphic Designer Divide™ (Acquired by Google) February 2012  –  July 2013  (1 year 6 months) London Alongside our UX lead, I designed our iOS and iPad versions of the Divide app and company website as well as developing the brand identity, marketing material and the Android app. Designer (Freelance) Destroywerk 2006  –  February 2012  (6 years) Berlin, Leeds, Buenos Aires Editor The Proles! 2005  –  2010  (5 years) Manchester, United Kingdom An illustration and design magazine focusing on lesser-known and up-and-coming creatives which featured exclusive work from 80+ artists from 15 countries from around the world. Trend Reporter Preview Trend Forecasting December 2006  –  September 2007  (10 months) Berlin Area, Germany Interaction Designer Google January 2015  – Present (8 months) London, United Kingdom Interaction Designer Google January 2015  – Present (8 months) London, United Kingdom UI Designer Google May 2014  –  January 2015  (9 months) London, United Kingdom UI Designer Google May 2014  –  January 2015  (9 months) London, United Kingdom Senior Visual Designer Divide™ (Acquired by Google) July 2013  –  May 2014  (11 months) London, United Kingdom Working alongside our Creative Director, I led our Android UI design. I also worked to develop the brand and help to drive product design on both iOS and Android platforms. Senior Visual Designer Divide™ (Acquired by Google) July 2013  –  May 2014  (11 months) London, United Kingdom Working alongside our Creative Director, I led our Android UI design. I also worked to develop the brand and help to drive product design on both iOS and Android platforms. Graphic Designer Divide™ (Acquired by Google) February 2012  –  July 2013  (1 year 6 months) London Alongside our UX lead, I designed our iOS and iPad versions of the Divide app and company website as well as developing the brand identity, marketing material and the Android app. Graphic Designer Divide™ (Acquired by Google) February 2012  –  July 2013  (1 year 6 months) London Alongside our UX lead, I designed our iOS and iPad versions of the Divide app and company website as well as developing the brand identity, marketing material and the Android app. Designer (Freelance) Destroywerk 2006  –  February 2012  (6 years) Berlin, Leeds, Buenos Aires Designer (Freelance) Destroywerk 2006  –  February 2012  (6 years) Berlin, Leeds, Buenos Aires Editor The Proles! 2005  –  2010  (5 years) Manchester, United Kingdom An illustration and design magazine focusing on lesser-known and up-and-coming creatives which featured exclusive work from 80+ artists from 15 countries from around the world. Editor The Proles! 2005  –  2010  (5 years) Manchester, United Kingdom An illustration and design magazine focusing on lesser-known and up-and-coming creatives which featured exclusive work from 80+ artists from 15 countries from around the world. Trend Reporter Preview Trend Forecasting December 2006  –  September 2007  (10 months) Berlin Area, Germany Trend Reporter Preview Trend Forecasting December 2006  –  September 2007  (10 months) Berlin Area, Germany Skills Graphic Design Digital Illustration Logo Design Art Direction Creative Branding Editorial Illustration Adobe Creative Suite Creative Direction User Experience Design User Interface Design Illustration Brand Implementation Product Design Trend Analysis Art Magazines Interaction Design Visual Communication Graphics Branding & Identity Typography Concept Development Android iOS Design See 9+     See less Skills  Graphic Design Digital Illustration Logo Design Art Direction Creative Branding Editorial Illustration Adobe Creative Suite Creative Direction User Experience Design User Interface Design Illustration Brand Implementation Product Design Trend Analysis Art Magazines Interaction Design Visual Communication Graphics Branding & Identity Typography Concept Development Android iOS Design See 9+     See less Graphic Design Digital Illustration Logo Design Art Direction Creative Branding Editorial Illustration Adobe Creative Suite Creative Direction User Experience Design User Interface Design Illustration Brand Implementation Product Design Trend Analysis Art Magazines Interaction Design Visual Communication Graphics Branding & Identity Typography Concept Development Android iOS Design See 9+     See less Graphic Design Digital Illustration Logo Design Art Direction Creative Branding Editorial Illustration Adobe Creative Suite Creative Direction User Experience Design User Interface Design Illustration Brand Implementation Product Design Trend Analysis Art Magazines Interaction Design Visual Communication Graphics Branding & Identity Typography Concept Development Android iOS Design See 9+     See less Education Manchester Metropolitan University BA (hons),  Design & Art Direction , First Class 2003  – 2006 King's School Macclesfield 1994  – 2000 Manchester Metropolitan University BA (hons),  Design & Art Direction , First Class 2003  – 2006 Manchester Metropolitan University BA (hons),  Design & Art Direction , First Class 2003  – 2006 Manchester Metropolitan University BA (hons),  Design & Art Direction , First Class 2003  – 2006 King's School Macclesfield 1994  – 2000 King's School Macclesfield 1994  – 2000 King's School Macclesfield 1994  – 2000 ", "Summary Started out as User Interface Developer in the 80s at Bell Communications Research, and through Oracle, Aspect Telecommunications, Intraspect, Webvan, eBay, and finally Google, I've become nearly exclusively a User Interface Designer with some prototyping expertise. Recently, I am leading people and initiatives at Google, including team education and design pattern standardization. \n \nMy goal is to positively affect the lives of as many people as I can with the work that I do, making life easier, more fun, and more satisfying. Specialties:Task Analysis, UI Design, HTML/Javascript prototyping, Product Management, negotiation training Summary Started out as User Interface Developer in the 80s at Bell Communications Research, and through Oracle, Aspect Telecommunications, Intraspect, Webvan, eBay, and finally Google, I've become nearly exclusively a User Interface Designer with some prototyping expertise. Recently, I am leading people and initiatives at Google, including team education and design pattern standardization. \n \nMy goal is to positively affect the lives of as many people as I can with the work that I do, making life easier, more fun, and more satisfying. Specialties:Task Analysis, UI Design, HTML/Javascript prototyping, Product Management, negotiation training Started out as User Interface Developer in the 80s at Bell Communications Research, and through Oracle, Aspect Telecommunications, Intraspect, Webvan, eBay, and finally Google, I've become nearly exclusively a User Interface Designer with some prototyping expertise. Recently, I am leading people and initiatives at Google, including team education and design pattern standardization. \n \nMy goal is to positively affect the lives of as many people as I can with the work that I do, making life easier, more fun, and more satisfying. Specialties:Task Analysis, UI Design, HTML/Javascript prototyping, Product Management, negotiation training Started out as User Interface Developer in the 80s at Bell Communications Research, and through Oracle, Aspect Telecommunications, Intraspect, Webvan, eBay, and finally Google, I've become nearly exclusively a User Interface Designer with some prototyping expertise. Recently, I am leading people and initiatives at Google, including team education and design pattern standardization. \n \nMy goal is to positively affect the lives of as many people as I can with the work that I do, making life easier, more fun, and more satisfying. Specialties:Task Analysis, UI Design, HTML/Javascript prototyping, Product Management, negotiation training Experience Senior User Experience Design, Apps Google August 2010  – Present (5 years 1 month) Senior User Experience Design, Advertising Google April 2010  –  October 2010  (7 months) Billing and Payments, Local Ads, and User Interface Standards. Local Business Design Lead Google August 2009  –  April 2010  (9 months) Building solutions for local businesses, be they the corner salon to the national home improvement franchise. Standards Design Manager Google November 2008  –  August 2009  (10 months) Coordinate across all of User Experience at Google, driving projects that build standards, specifications, and components for designers and engineers. Design Manager, Ads Google March 2005  –  March 2008  (3 years 1 month) User Experience design of advertising applications. UI Designer eBay June 2001  –  July 2004  (3 years 2 months) User Experience design of the selling interface (online and Turbo Lister). UI Designer Webvan 2000  –  2001  (1 year) User experience design of home grocery shopping. UI Engineer Constellar 1998  –  2000  (2 years) UI Engineer Intraspect July 1996  –  January 1998  (1 year 7 months) Designed and implemented user interfaces for the collaboration product. Company was acquired by Vignette. UI Engineer Aspect Telecommunications October 1990  –  September 1996  (6 years) Designed and created CustomView Editor: a reporting system for the Aspect CallCenter built using Informix' Wingz, SQL, FTP, and MS Windows SDK. \n \nLed a team of developers and acted as customer liaison in creating and maintaining a library of reports for CustomView Editor. Software Engineer Oracle April 1989  –  September 1990  (1 year 6 months) Designed and built composite objects (including a linked-text help object) and demo applications for two Oracle multi-platform (X Window, Macintosh, Presentation Manager, Character mode) toolkits. Software Engineer Bell Communications Research September 1986  –  September 1989  (3 years 1 month) Coded and helped to design DynaMICE (visual call management) in X Windows and Suntools. Helped to implement Cruiser, a video tool for facilitating unplanned interactions between distanced co-workers. Intern Programmer and Artist Computer Magic June 1983  –  January 1984  (8 months) Designed and coded graphics for computer games on Atari systems. Senior User Experience Design, Apps Google August 2010  – Present (5 years 1 month) Senior User Experience Design, Apps Google August 2010  – Present (5 years 1 month) Senior User Experience Design, Advertising Google April 2010  –  October 2010  (7 months) Billing and Payments, Local Ads, and User Interface Standards. Senior User Experience Design, Advertising Google April 2010  –  October 2010  (7 months) Billing and Payments, Local Ads, and User Interface Standards. Local Business Design Lead Google August 2009  –  April 2010  (9 months) Building solutions for local businesses, be they the corner salon to the national home improvement franchise. Local Business Design Lead Google August 2009  –  April 2010  (9 months) Building solutions for local businesses, be they the corner salon to the national home improvement franchise. Standards Design Manager Google November 2008  –  August 2009  (10 months) Coordinate across all of User Experience at Google, driving projects that build standards, specifications, and components for designers and engineers. Standards Design Manager Google November 2008  –  August 2009  (10 months) Coordinate across all of User Experience at Google, driving projects that build standards, specifications, and components for designers and engineers. Design Manager, Ads Google March 2005  –  March 2008  (3 years 1 month) User Experience design of advertising applications. Design Manager, Ads Google March 2005  –  March 2008  (3 years 1 month) User Experience design of advertising applications. UI Designer eBay June 2001  –  July 2004  (3 years 2 months) User Experience design of the selling interface (online and Turbo Lister). UI Designer eBay June 2001  –  July 2004  (3 years 2 months) User Experience design of the selling interface (online and Turbo Lister). UI Designer Webvan 2000  –  2001  (1 year) User experience design of home grocery shopping. UI Designer Webvan 2000  –  2001  (1 year) User experience design of home grocery shopping. UI Engineer Constellar 1998  –  2000  (2 years) UI Engineer Constellar 1998  –  2000  (2 years) UI Engineer Intraspect July 1996  –  January 1998  (1 year 7 months) Designed and implemented user interfaces for the collaboration product. Company was acquired by Vignette. UI Engineer Intraspect July 1996  –  January 1998  (1 year 7 months) Designed and implemented user interfaces for the collaboration product. Company was acquired by Vignette. UI Engineer Aspect Telecommunications October 1990  –  September 1996  (6 years) Designed and created CustomView Editor: a reporting system for the Aspect CallCenter built using Informix' Wingz, SQL, FTP, and MS Windows SDK. \n \nLed a team of developers and acted as customer liaison in creating and maintaining a library of reports for CustomView Editor. UI Engineer Aspect Telecommunications October 1990  –  September 1996  (6 years) Designed and created CustomView Editor: a reporting system for the Aspect CallCenter built using Informix' Wingz, SQL, FTP, and MS Windows SDK. \n \nLed a team of developers and acted as customer liaison in creating and maintaining a library of reports for CustomView Editor. Software Engineer Oracle April 1989  –  September 1990  (1 year 6 months) Designed and built composite objects (including a linked-text help object) and demo applications for two Oracle multi-platform (X Window, Macintosh, Presentation Manager, Character mode) toolkits. Software Engineer Oracle April 1989  –  September 1990  (1 year 6 months) Designed and built composite objects (including a linked-text help object) and demo applications for two Oracle multi-platform (X Window, Macintosh, Presentation Manager, Character mode) toolkits. Software Engineer Bell Communications Research September 1986  –  September 1989  (3 years 1 month) Coded and helped to design DynaMICE (visual call management) in X Windows and Suntools. Helped to implement Cruiser, a video tool for facilitating unplanned interactions between distanced co-workers. Software Engineer Bell Communications Research September 1986  –  September 1989  (3 years 1 month) Coded and helped to design DynaMICE (visual call management) in X Windows and Suntools. Helped to implement Cruiser, a video tool for facilitating unplanned interactions between distanced co-workers. Intern Programmer and Artist Computer Magic June 1983  –  January 1984  (8 months) Designed and coded graphics for computer games on Atari systems. Intern Programmer and Artist Computer Magic June 1983  –  January 1984  (8 months) Designed and coded graphics for computer games on Atari systems. Skills Software Development Mobile Commerce User Interface Design Task Analysis Design Patterns Product Management User Experience User-centered Design Negotiation Interaction Design User Research User Experience Design User Interface Usability Mobile Design Usability Testing Information Architecture Visual Design Contextual Inquiry Human Computer... Mobile Applications Wireframes Mobile Devices See 8+     See less Skills  Software Development Mobile Commerce User Interface Design Task Analysis Design Patterns Product Management User Experience User-centered Design Negotiation Interaction Design User Research User Experience Design User Interface Usability Mobile Design Usability Testing Information Architecture Visual Design Contextual Inquiry Human Computer... Mobile Applications Wireframes Mobile Devices See 8+     See less Software Development Mobile Commerce User Interface Design Task Analysis Design Patterns Product Management User Experience User-centered Design Negotiation Interaction Design User Research User Experience Design User Interface Usability Mobile Design Usability Testing Information Architecture Visual Design Contextual Inquiry Human Computer... Mobile Applications Wireframes Mobile Devices See 8+     See less Software Development Mobile Commerce User Interface Design Task Analysis Design Patterns Product Management User Experience User-centered Design Negotiation Interaction Design User Research User Experience Design User Interface Usability Mobile Design Usability Testing Information Architecture Visual Design Contextual Inquiry Human Computer... Mobile Applications Wireframes Mobile Devices See 8+     See less Education Cornell University B.S.,  Computer Science 1980  – 1984 Cornell University B.S.,  Computer Science 1980  – 1984 Cornell University B.S.,  Computer Science 1980  – 1984 Cornell University B.S.,  Computer Science 1980  – 1984 ", "Summary I am passionate about creating and crafting delightful user experiences at pixel by pixel detail and how these experiences across products and devices interact with and take part in a larger eco-system. \n \nI have a keen interest in the space that exists in between technology and people and how might we design for the harmonies within this space today and in the future. \n \nIt's not just about the product itself, it's also about the role and impact this product plays within it's environment and within our lives. \n \nInspired by people, design and nature and how we might achieve harmonies between these as we create experiences through technology. Summary I am passionate about creating and crafting delightful user experiences at pixel by pixel detail and how these experiences across products and devices interact with and take part in a larger eco-system. \n \nI have a keen interest in the space that exists in between technology and people and how might we design for the harmonies within this space today and in the future. \n \nIt's not just about the product itself, it's also about the role and impact this product plays within it's environment and within our lives. \n \nInspired by people, design and nature and how we might achieve harmonies between these as we create experiences through technology. I am passionate about creating and crafting delightful user experiences at pixel by pixel detail and how these experiences across products and devices interact with and take part in a larger eco-system. \n \nI have a keen interest in the space that exists in between technology and people and how might we design for the harmonies within this space today and in the future. \n \nIt's not just about the product itself, it's also about the role and impact this product plays within it's environment and within our lives. \n \nInspired by people, design and nature and how we might achieve harmonies between these as we create experiences through technology. I am passionate about creating and crafting delightful user experiences at pixel by pixel detail and how these experiences across products and devices interact with and take part in a larger eco-system. \n \nI have a keen interest in the space that exists in between technology and people and how might we design for the harmonies within this space today and in the future. \n \nIt's not just about the product itself, it's also about the role and impact this product plays within it's environment and within our lives. \n \nInspired by people, design and nature and how we might achieve harmonies between these as we create experiences through technology. Experience UI Designer Google March 2012  – Present (3 years 6 months) Mountain View, California Service Designer Huddle design September 2011  –  February 2012  (6 months) Melbourne Area, Australia User experience designer Sensis July 2011  –  August 2011  (2 months) Melbourne Area, Australia User Experience Designer ANZ May 2009  –  May 2011  (2 years 1 month) User Interaction Designer Sensis November 2008  –  April 2009  (6 months) Designer SYNK Magazine 2008  –  2009  (1 year) UI Designer igloo August 2008  –  October 2008  (3 months) Richmond, Australia User Interface Designer mcm entertainment January 2008  –  August 2008  (8 months) Usabilty Consultant Stamford Interactive 2006  –  2008  (2 years) UI Designer Google March 2012  – Present (3 years 6 months) Mountain View, California UI Designer Google March 2012  – Present (3 years 6 months) Mountain View, California Service Designer Huddle design September 2011  –  February 2012  (6 months) Melbourne Area, Australia Service Designer Huddle design September 2011  –  February 2012  (6 months) Melbourne Area, Australia User experience designer Sensis July 2011  –  August 2011  (2 months) Melbourne Area, Australia User experience designer Sensis July 2011  –  August 2011  (2 months) Melbourne Area, Australia User Experience Designer ANZ May 2009  –  May 2011  (2 years 1 month) User Experience Designer ANZ May 2009  –  May 2011  (2 years 1 month) User Interaction Designer Sensis November 2008  –  April 2009  (6 months) User Interaction Designer Sensis November 2008  –  April 2009  (6 months) Designer SYNK Magazine 2008  –  2009  (1 year) Designer SYNK Magazine 2008  –  2009  (1 year) UI Designer igloo August 2008  –  October 2008  (3 months) Richmond, Australia UI Designer igloo August 2008  –  October 2008  (3 months) Richmond, Australia User Interface Designer mcm entertainment January 2008  –  August 2008  (8 months) User Interface Designer mcm entertainment January 2008  –  August 2008  (8 months) Usabilty Consultant Stamford Interactive 2006  –  2008  (2 years) Usabilty Consultant Stamford Interactive 2006  –  2008  (2 years) Languages Tagalog Tagalog Tagalog Skills User Experience User Interface Design Usability User-centered Design Service Design Usability Testing User Experience Design Graphic Design Design Thinking Interaction Design Wire Framing Wireframes Human Computer... Prototype Mobile Design Illustration Information Architecture Persona Usability Engineering User Research Contextual Inquiry Mobile Applications Visual Design Information Design Paper Prototyping Axure CMS Ethnography User interaction design Prototyping Start-ups Problem Solving Design Strategy Rapid Prototyping Card Sorting Experience Design User Scenarios OmniGraffle Accessibility Task Analysis Front-end Web Standards HTML 5 Web Project Management Agile scrum Social Entrepreneurship Design Sprints See 33+     See less Skills  User Experience User Interface Design Usability User-centered Design Service Design Usability Testing User Experience Design Graphic Design Design Thinking Interaction Design Wire Framing Wireframes Human Computer... Prototype Mobile Design Illustration Information Architecture Persona Usability Engineering User Research Contextual Inquiry Mobile Applications Visual Design Information Design Paper Prototyping Axure CMS Ethnography User interaction design Prototyping Start-ups Problem Solving Design Strategy Rapid Prototyping Card Sorting Experience Design User Scenarios OmniGraffle Accessibility Task Analysis Front-end Web Standards HTML 5 Web Project Management Agile scrum Social Entrepreneurship Design Sprints See 33+     See less User Experience User Interface Design Usability User-centered Design Service Design Usability Testing User Experience Design Graphic Design Design Thinking Interaction Design Wire Framing Wireframes Human Computer... Prototype Mobile Design Illustration Information Architecture Persona Usability Engineering User Research Contextual Inquiry Mobile Applications Visual Design Information Design Paper Prototyping Axure CMS Ethnography User interaction design Prototyping Start-ups Problem Solving Design Strategy Rapid Prototyping Card Sorting Experience Design User Scenarios OmniGraffle Accessibility Task Analysis Front-end Web Standards HTML 5 Web Project Management Agile scrum Social Entrepreneurship Design Sprints See 33+     See less User Experience User Interface Design Usability User-centered Design Service Design Usability Testing User Experience Design Graphic Design Design Thinking Interaction Design Wire Framing Wireframes Human Computer... Prototype Mobile Design Illustration Information Architecture Persona Usability Engineering User Research Contextual Inquiry Mobile Applications Visual Design Information Design Paper Prototyping Axure CMS Ethnography User interaction design Prototyping Start-ups Problem Solving Design Strategy Rapid Prototyping Card Sorting Experience Design User Scenarios OmniGraffle Accessibility Task Analysis Front-end Web Standards HTML 5 Web Project Management Agile scrum Social Entrepreneurship Design Sprints See 33+     See less Education RMIT University Graduate Diploma,  Graphic Design 2007  – 2009 Victoria University Honours,  Computer Science 2005  – 2005 Conducted a usability study on middle-aged users and their use of Short Message Service, i.e. SMS. \n \nPresented two short papers on the findings of the study and produced a thesis titled \"A Usability Study on Short Message Service on Middle-Aged Users\". Victoria University Bachelor,  Computer Science 2002  – 2004 RMIT University Graduate Diploma,  Graphic Design 2007  – 2009 RMIT University Graduate Diploma,  Graphic Design 2007  – 2009 RMIT University Graduate Diploma,  Graphic Design 2007  – 2009 Victoria University Honours,  Computer Science 2005  – 2005 Conducted a usability study on middle-aged users and their use of Short Message Service, i.e. SMS. \n \nPresented two short papers on the findings of the study and produced a thesis titled \"A Usability Study on Short Message Service on Middle-Aged Users\". Victoria University Honours,  Computer Science 2005  – 2005 Conducted a usability study on middle-aged users and their use of Short Message Service, i.e. SMS. \n \nPresented two short papers on the findings of the study and produced a thesis titled \"A Usability Study on Short Message Service on Middle-Aged Users\". Victoria University Honours,  Computer Science 2005  – 2005 Conducted a usability study on middle-aged users and their use of Short Message Service, i.e. SMS. \n \nPresented two short papers on the findings of the study and produced a thesis titled \"A Usability Study on Short Message Service on Middle-Aged Users\". Victoria University Bachelor,  Computer Science 2002  – 2004 Victoria University Bachelor,  Computer Science 2002  – 2004 Victoria University Bachelor,  Computer Science 2002  – 2004 ", "Summary I design and develop user interfaces with a passion for beautiful craft and clear communication. \n \nhttp://jblairmetcalf.com \n \nAfter a decade of advertising design and development experience I designed, developed, and co-founded PillowMob, an e-commerce website, and developed the menus and scoreboards for Halo 4. \n \nCurrently, I am developing strategy, design, and iOS UI for a Motorola app that uses end-to-end encryption for group and private push-to-talk secure communications for governments and corporations. \n \nI am seeking to make major contributions as a creative developer for innovative digital products. \n \niOS Development: \n• XCode \n• iOS 8 Libraries \n• Objective-C \n• CocoaPods \n \nUI/UX Design: \n• Digital Stratgey \n• UI/UX Design \n• Prototyping \n \nFront-End Development: \n• AMD, jQuery, Grunt, SASS, PHP, RWD, Raphael JS, TweenMax \n• Git & SVN \n• Flash & ActionScript Summary I design and develop user interfaces with a passion for beautiful craft and clear communication. \n \nhttp://jblairmetcalf.com \n \nAfter a decade of advertising design and development experience I designed, developed, and co-founded PillowMob, an e-commerce website, and developed the menus and scoreboards for Halo 4. \n \nCurrently, I am developing strategy, design, and iOS UI for a Motorola app that uses end-to-end encryption for group and private push-to-talk secure communications for governments and corporations. \n \nI am seeking to make major contributions as a creative developer for innovative digital products. \n \niOS Development: \n• XCode \n• iOS 8 Libraries \n• Objective-C \n• CocoaPods \n \nUI/UX Design: \n• Digital Stratgey \n• UI/UX Design \n• Prototyping \n \nFront-End Development: \n• AMD, jQuery, Grunt, SASS, PHP, RWD, Raphael JS, TweenMax \n• Git & SVN \n• Flash & ActionScript I design and develop user interfaces with a passion for beautiful craft and clear communication. \n \nhttp://jblairmetcalf.com \n \nAfter a decade of advertising design and development experience I designed, developed, and co-founded PillowMob, an e-commerce website, and developed the menus and scoreboards for Halo 4. \n \nCurrently, I am developing strategy, design, and iOS UI for a Motorola app that uses end-to-end encryption for group and private push-to-talk secure communications for governments and corporations. \n \nI am seeking to make major contributions as a creative developer for innovative digital products. \n \niOS Development: \n• XCode \n• iOS 8 Libraries \n• Objective-C \n• CocoaPods \n \nUI/UX Design: \n• Digital Stratgey \n• UI/UX Design \n• Prototyping \n \nFront-End Development: \n• AMD, jQuery, Grunt, SASS, PHP, RWD, Raphael JS, TweenMax \n• Git & SVN \n• Flash & ActionScript I design and develop user interfaces with a passion for beautiful craft and clear communication. \n \nhttp://jblairmetcalf.com \n \nAfter a decade of advertising design and development experience I designed, developed, and co-founded PillowMob, an e-commerce website, and developed the menus and scoreboards for Halo 4. \n \nCurrently, I am developing strategy, design, and iOS UI for a Motorola app that uses end-to-end encryption for group and private push-to-talk secure communications for governments and corporations. \n \nI am seeking to make major contributions as a creative developer for innovative digital products. \n \niOS Development: \n• XCode \n• iOS 8 Libraries \n• Objective-C \n• CocoaPods \n \nUI/UX Design: \n• Digital Stratgey \n• UI/UX Design \n• Prototyping \n \nFront-End Development: \n• AMD, jQuery, Grunt, SASS, PHP, RWD, Raphael JS, TweenMax \n• Git & SVN \n• Flash & ActionScript Experience User Experience Engineer Google July 2015  – Present (2 months) Greater Seattle Area Designing new features, developing prototypes, and influencing the direction of Google's Cloud, App Engine, and API Marketplace. Front-End Developer and UX/UI Designer JBlairMetcalf.com February 2003  – Present (12 years 7 months) Greater Seattle Area With a decade of multi-platform experience I design and develop responsive web/mobile websites that benefit the user. Clients include Microsoft, McDonalds, Burger King, and Craftsman. Senior iOS Developer and UX Team Lead Motorola Solutions July 2014  –  July 2015  (1 year 1 month) Seattle iOS Developer CountOnIt September 2012  –  July 2014  (1 year 11 months) Greater Seattle Area Senior UX Designer UpTop November 2013  –  April 2014  (6 months) Greater Seattle Area Co-Founder PillowMob July 2011  –  March 2014  (2 years 9 months) Seattle, WA Halo 4 UI Developer Microsoft 343 Industries April 2012  –  September 2012  (6 months) Kirkland, WA Senior Flash Developer Designkitchen 2008  –  December 2010  (2 years) Chicago, IL Senior Flash Developer Microsoft Zune January 2008  –  July 2008  (7 months) Redmond, WA Flash Developer and UI Designer FILTER/TALENT August 2006  –  July 2008  (2 years) Lead Flash Developer T-Mobile January 2007  –  August 2007  (8 months) Lead Flash Developer Leo Burnett February 2005  –  August 2006  (1 year 7 months) Lead Flash Developer J. Walter Thompson February 2004  –  March 2005  (1 year 2 months) Senior Flash Developer Oncall Interactive November 2003  –  February 2005  (1 year 4 months) Artist's Assistant The Studio Of Lincoln Schatz September 2002  –  May 2003  (9 months) Apple Computer Technician The Art Institute of Chicago August 2001  –  May 2003  (1 year 10 months) User Experience Engineer Google July 2015  – Present (2 months) Greater Seattle Area Designing new features, developing prototypes, and influencing the direction of Google's Cloud, App Engine, and API Marketplace. User Experience Engineer Google July 2015  – Present (2 months) Greater Seattle Area Designing new features, developing prototypes, and influencing the direction of Google's Cloud, App Engine, and API Marketplace. Front-End Developer and UX/UI Designer JBlairMetcalf.com February 2003  – Present (12 years 7 months) Greater Seattle Area With a decade of multi-platform experience I design and develop responsive web/mobile websites that benefit the user. Clients include Microsoft, McDonalds, Burger King, and Craftsman. Front-End Developer and UX/UI Designer JBlairMetcalf.com February 2003  – Present (12 years 7 months) Greater Seattle Area With a decade of multi-platform experience I design and develop responsive web/mobile websites that benefit the user. Clients include Microsoft, McDonalds, Burger King, and Craftsman. Senior iOS Developer and UX Team Lead Motorola Solutions July 2014  –  July 2015  (1 year 1 month) Seattle Senior iOS Developer and UX Team Lead Motorola Solutions July 2014  –  July 2015  (1 year 1 month) Seattle iOS Developer CountOnIt September 2012  –  July 2014  (1 year 11 months) Greater Seattle Area iOS Developer CountOnIt September 2012  –  July 2014  (1 year 11 months) Greater Seattle Area Senior UX Designer UpTop November 2013  –  April 2014  (6 months) Greater Seattle Area Senior UX Designer UpTop November 2013  –  April 2014  (6 months) Greater Seattle Area Co-Founder PillowMob July 2011  –  March 2014  (2 years 9 months) Seattle, WA Co-Founder PillowMob July 2011  –  March 2014  (2 years 9 months) Seattle, WA Halo 4 UI Developer Microsoft 343 Industries April 2012  –  September 2012  (6 months) Kirkland, WA Halo 4 UI Developer Microsoft 343 Industries April 2012  –  September 2012  (6 months) Kirkland, WA Senior Flash Developer Designkitchen 2008  –  December 2010  (2 years) Chicago, IL Senior Flash Developer Designkitchen 2008  –  December 2010  (2 years) Chicago, IL Senior Flash Developer Microsoft Zune January 2008  –  July 2008  (7 months) Redmond, WA Senior Flash Developer Microsoft Zune January 2008  –  July 2008  (7 months) Redmond, WA Flash Developer and UI Designer FILTER/TALENT August 2006  –  July 2008  (2 years) Flash Developer and UI Designer FILTER/TALENT August 2006  –  July 2008  (2 years) Lead Flash Developer T-Mobile January 2007  –  August 2007  (8 months) Lead Flash Developer T-Mobile January 2007  –  August 2007  (8 months) Lead Flash Developer Leo Burnett February 2005  –  August 2006  (1 year 7 months) Lead Flash Developer Leo Burnett February 2005  –  August 2006  (1 year 7 months) Lead Flash Developer J. Walter Thompson February 2004  –  March 2005  (1 year 2 months) Lead Flash Developer J. Walter Thompson February 2004  –  March 2005  (1 year 2 months) Senior Flash Developer Oncall Interactive November 2003  –  February 2005  (1 year 4 months) Senior Flash Developer Oncall Interactive November 2003  –  February 2005  (1 year 4 months) Artist's Assistant The Studio Of Lincoln Schatz September 2002  –  May 2003  (9 months) Artist's Assistant The Studio Of Lincoln Schatz September 2002  –  May 2003  (9 months) Apple Computer Technician The Art Institute of Chicago August 2001  –  May 2003  (1 year 10 months) Apple Computer Technician The Art Institute of Chicago August 2001  –  May 2003  (1 year 10 months) Languages English Latin English Latin English Latin Skills User Experience User Interface Design Interaction Design Flash Graphic Design User Interface Art Direction Information Architecture User Experience Design Photography Creative Direction ActionScript SEO Digital Strategy Branding & Identity E-commerce CSS Front-end Mobile Design Digital Marketing Wireframes Mobile Devices iOS Development Objective-C CocoaPods iOS 7 Libraries jQuery PHP Responsive Web Design JavaScript Agile Methodologies Scrum See 17+     See less Skills  User Experience User Interface Design Interaction Design Flash Graphic Design User Interface Art Direction Information Architecture User Experience Design Photography Creative Direction ActionScript SEO Digital Strategy Branding & Identity E-commerce CSS Front-end Mobile Design Digital Marketing Wireframes Mobile Devices iOS Development Objective-C CocoaPods iOS 7 Libraries jQuery PHP Responsive Web Design JavaScript Agile Methodologies Scrum See 17+     See less User Experience User Interface Design Interaction Design Flash Graphic Design User Interface Art Direction Information Architecture User Experience Design Photography Creative Direction ActionScript SEO Digital Strategy Branding & Identity E-commerce CSS Front-end Mobile Design Digital Marketing Wireframes Mobile Devices iOS Development Objective-C CocoaPods iOS 7 Libraries jQuery PHP Responsive Web Design JavaScript Agile Methodologies Scrum See 17+     See less User Experience User Interface Design Interaction Design Flash Graphic Design User Interface Art Direction Information Architecture User Experience Design Photography Creative Direction ActionScript SEO Digital Strategy Branding & Identity E-commerce CSS Front-end Mobile Design Digital Marketing Wireframes Mobile Devices iOS Development Objective-C CocoaPods iOS 7 Libraries jQuery PHP Responsive Web Design JavaScript Agile Methodologies Scrum See 17+     See less Honors & Awards ", "Summary I'm a UX designer from India. I recently graduated from Georgia Tech with a masters degree in Human Computer Interaction. I'm an ardent follower of the user centered design philosophy and love solving challenging problems.. You can see some of my past works at: http://www.nikhilsiva.com Summary I'm a UX designer from India. I recently graduated from Georgia Tech with a masters degree in Human Computer Interaction. I'm an ardent follower of the user centered design philosophy and love solving challenging problems.. You can see some of my past works at: http://www.nikhilsiva.com I'm a UX designer from India. I recently graduated from Georgia Tech with a masters degree in Human Computer Interaction. I'm an ardent follower of the user centered design philosophy and love solving challenging problems.. You can see some of my past works at: http://www.nikhilsiva.com I'm a UX designer from India. I recently graduated from Georgia Tech with a masters degree in Human Computer Interaction. I'm an ardent follower of the user centered design philosophy and love solving challenging problems.. You can see some of my past works at: http://www.nikhilsiva.com Experience UI Designer Google July 2015  – Present (2 months) Mountain View Graduate Teaching Assistant Georgia Institute of Technology January 2014  –  December 2014  (1 year) Course: Human Computer Interaction, User Interface Design User Exprience Design Intern Google May 2014  –  August 2014  (4 months) Greater New York City Area Worked on the Docs, Sheets and Slides team to conceptualize new features and interactions.  \n Researcher and Prototyper Hanyang University May 2012  –  July 2012  (3 months) Seoul, South Korea Worked as a research assistant under Dr. Sangwon Lee, Director, Socio-Technical Systems Lab, Hanyang University, ERICA campus.  \n \nMy worked involved:  \nExperiment design to test the influence of providing visual, auditory and tactile stimulus to a pilot of an Unmanned Aerial Vehicle (UAV), as an implement to the counter loss of concentration during flight.  \n \nWorked extensively with Emotiv EPOC - EEG headset, Microsoft flight simulator X SDK, Processing and Visual C++ to develop the experimental setup. UI Design Intern Hidden Reflex May 2011  –  July 2011  (3 months) Bangalore, India Responsible for: \n \nRedesign of the Epic browser, a Mozilla based web browser customized for Indian users.  \nDesign of the iPhone app for NewsDrink, a new aggregator site developed by Hidden reflex. UI Designer Google July 2015  – Present (2 months) Mountain View UI Designer Google July 2015  – Present (2 months) Mountain View Graduate Teaching Assistant Georgia Institute of Technology January 2014  –  December 2014  (1 year) Course: Human Computer Interaction, User Interface Design Graduate Teaching Assistant Georgia Institute of Technology January 2014  –  December 2014  (1 year) Course: Human Computer Interaction, User Interface Design User Exprience Design Intern Google May 2014  –  August 2014  (4 months) Greater New York City Area Worked on the Docs, Sheets and Slides team to conceptualize new features and interactions.  \n User Exprience Design Intern Google May 2014  –  August 2014  (4 months) Greater New York City Area Worked on the Docs, Sheets and Slides team to conceptualize new features and interactions.  \n Researcher and Prototyper Hanyang University May 2012  –  July 2012  (3 months) Seoul, South Korea Worked as a research assistant under Dr. Sangwon Lee, Director, Socio-Technical Systems Lab, Hanyang University, ERICA campus.  \n \nMy worked involved:  \nExperiment design to test the influence of providing visual, auditory and tactile stimulus to a pilot of an Unmanned Aerial Vehicle (UAV), as an implement to the counter loss of concentration during flight.  \n \nWorked extensively with Emotiv EPOC - EEG headset, Microsoft flight simulator X SDK, Processing and Visual C++ to develop the experimental setup. Researcher and Prototyper Hanyang University May 2012  –  July 2012  (3 months) Seoul, South Korea Worked as a research assistant under Dr. Sangwon Lee, Director, Socio-Technical Systems Lab, Hanyang University, ERICA campus.  \n \nMy worked involved:  \nExperiment design to test the influence of providing visual, auditory and tactile stimulus to a pilot of an Unmanned Aerial Vehicle (UAV), as an implement to the counter loss of concentration during flight.  \n \nWorked extensively with Emotiv EPOC - EEG headset, Microsoft flight simulator X SDK, Processing and Visual C++ to develop the experimental setup. UI Design Intern Hidden Reflex May 2011  –  July 2011  (3 months) Bangalore, India Responsible for: \n \nRedesign of the Epic browser, a Mozilla based web browser customized for Indian users.  \nDesign of the iPhone app for NewsDrink, a new aggregator site developed by Hidden reflex. UI Design Intern Hidden Reflex May 2011  –  July 2011  (3 months) Bangalore, India Responsible for: \n \nRedesign of the Epic browser, a Mozilla based web browser customized for Indian users.  \nDesign of the iPhone app for NewsDrink, a new aggregator site developed by Hidden reflex. Languages English Full professional proficiency Malayalam Native or bilingual proficiency Hindi Professional working proficiency Tamil Limited working proficiency English Full professional proficiency Malayalam Native or bilingual proficiency Hindi Professional working proficiency Tamil Limited working proficiency English Full professional proficiency Malayalam Native or bilingual proficiency Hindi Professional working proficiency Tamil Limited working proficiency Full professional proficiency Native or bilingual proficiency Professional working proficiency Limited working proficiency Skills Usability Engineering Heuristic Evaluation Task Analysis User Interface Design Information Architecture Usability Testing User-centered Design Human-computer... Human Computer... Card Sorting Wireframes Contextual Inquiry Paper Prototyping Persona User Research Interaction Design See 1+     See less Skills  Usability Engineering Heuristic Evaluation Task Analysis User Interface Design Information Architecture Usability Testing User-centered Design Human-computer... Human Computer... Card Sorting Wireframes Contextual Inquiry Paper Prototyping Persona User Research Interaction Design See 1+     See less Usability Engineering Heuristic Evaluation Task Analysis User Interface Design Information Architecture Usability Testing User-centered Design Human-computer... Human Computer... Card Sorting Wireframes Contextual Inquiry Paper Prototyping Persona User Research Interaction Design See 1+     See less Usability Engineering Heuristic Evaluation Task Analysis User Interface Design Information Architecture Usability Testing User-centered Design Human-computer... Human Computer... Card Sorting Wireframes Contextual Inquiry Paper Prototyping Persona User Research Interaction Design See 1+     See less Education Georgia Institute of Technology Master's degree,  Human Computer Interaction 2013  – 2015 Indian Institute of Technology, Guwahati Bachelor's of Design,  Design 2009  – 2013 Georgia Institute of Technology Master's degree,  Human Computer Interaction 2013  – 2015 Georgia Institute of Technology Master's degree,  Human Computer Interaction 2013  – 2015 Georgia Institute of Technology Master's degree,  Human Computer Interaction 2013  – 2015 Indian Institute of Technology, Guwahati Bachelor's of Design,  Design 2009  – 2013 Indian Institute of Technology, Guwahati Bachelor's of Design,  Design 2009  – 2013 Indian Institute of Technology, Guwahati Bachelor's of Design,  Design 2009  – 2013 Honors & Awards Best Subject Category Award: Earth Science Intel Science Talent Discovery Fair 2005 Best Subject Category Award: Earth Science Intel Science Talent Discovery Fair 2005 Best Subject Category Award: Earth Science Intel Science Talent Discovery Fair 2005 Best Subject Category Award: Earth Science Intel Science Talent Discovery Fair 2005 ", "Experience UI Designer / Consultant / Advisor Girl Power Software August 2012  – Present (3 years 1 month) Los Altos, CA Advisor / UI Designer Catalog Spree September 2011  –  August 2012  (1 year) Los Altos, CA Founder / Software Engineer / UI Designer Restartle March 2010  –  September 2011  (1 year 7 months) Los Altos, CA Tech Lead / Software Engineer - Google Docs Google February 2005  –  March 2010  (5 years 2 months) Mountain View, CA Founder - Writely (Google Docs) Upstartle (Writely.com) July 2003  –  February 2005  (1 year 8 months) Software Enginer Intuit, Inc. February 1992  –  March 2003  (11 years 2 months) Menlo Park, CA / Mountain View, CA Software Engineer Hewlett-Packard June 1985  –  February 1992  (6 years 9 months) Sunnyvale, CA and Santa Clara, CA UI Designer / Consultant / Advisor Girl Power Software August 2012  – Present (3 years 1 month) Los Altos, CA UI Designer / Consultant / Advisor Girl Power Software August 2012  – Present (3 years 1 month) Los Altos, CA Advisor / UI Designer Catalog Spree September 2011  –  August 2012  (1 year) Los Altos, CA Advisor / UI Designer Catalog Spree September 2011  –  August 2012  (1 year) Los Altos, CA Founder / Software Engineer / UI Designer Restartle March 2010  –  September 2011  (1 year 7 months) Los Altos, CA Founder / Software Engineer / UI Designer Restartle March 2010  –  September 2011  (1 year 7 months) Los Altos, CA Tech Lead / Software Engineer - Google Docs Google February 2005  –  March 2010  (5 years 2 months) Mountain View, CA Tech Lead / Software Engineer - Google Docs Google February 2005  –  March 2010  (5 years 2 months) Mountain View, CA Founder - Writely (Google Docs) Upstartle (Writely.com) July 2003  –  February 2005  (1 year 8 months) Founder - Writely (Google Docs) Upstartle (Writely.com) July 2003  –  February 2005  (1 year 8 months) Software Enginer Intuit, Inc. February 1992  –  March 2003  (11 years 2 months) Menlo Park, CA / Mountain View, CA Software Enginer Intuit, Inc. February 1992  –  March 2003  (11 years 2 months) Menlo Park, CA / Mountain View, CA Software Engineer Hewlett-Packard June 1985  –  February 1992  (6 years 9 months) Sunnyvale, CA and Santa Clara, CA Software Engineer Hewlett-Packard June 1985  –  February 1992  (6 years 9 months) Sunnyvale, CA and Santa Clara, CA Skills Mobile Devices Start-ups Cloud Computing Management User Interface Mobile Applications User Experience SaaS Agile Methodologies E-commerce Product Management Scrum Analytics Skills  Mobile Devices Start-ups Cloud Computing Management User Interface Mobile Applications User Experience SaaS Agile Methodologies E-commerce Product Management Scrum Analytics Mobile Devices Start-ups Cloud Computing Management User Interface Mobile Applications User Experience SaaS Agile Methodologies E-commerce Product Management Scrum Analytics Mobile Devices Start-ups Cloud Computing Management User Interface Mobile Applications User Experience SaaS Agile Methodologies E-commerce Product Management Scrum Analytics Education California State University-Chico BS 1980  – 1985 California State University-Chico BS 1980  – 1985 California State University-Chico BS 1980  – 1985 California State University-Chico BS 1980  – 1985 ", "Summary I create user experiences based on these four principles.  \n \n1. Keep it simple \n2. Tell the right story \n3. Make it easy \n4. Instill wonder \n \nWith equal love and attachment to technology and design; I have found my calling in coming up with meaningful design solutions to problems — solutions that work great and look beautiful. Specialties:User Experience Design \nInteraction Design \nVisual Design \nData Visualization \nRapid Prototyping  \nContent Strategy & Information Architecture \nUser Research \nEngineering & Product Management LIaison Summary I create user experiences based on these four principles.  \n \n1. Keep it simple \n2. Tell the right story \n3. Make it easy \n4. Instill wonder \n \nWith equal love and attachment to technology and design; I have found my calling in coming up with meaningful design solutions to problems — solutions that work great and look beautiful. Specialties:User Experience Design \nInteraction Design \nVisual Design \nData Visualization \nRapid Prototyping  \nContent Strategy & Information Architecture \nUser Research \nEngineering & Product Management LIaison I create user experiences based on these four principles.  \n \n1. Keep it simple \n2. Tell the right story \n3. Make it easy \n4. Instill wonder \n \nWith equal love and attachment to technology and design; I have found my calling in coming up with meaningful design solutions to problems — solutions that work great and look beautiful. Specialties:User Experience Design \nInteraction Design \nVisual Design \nData Visualization \nRapid Prototyping  \nContent Strategy & Information Architecture \nUser Research \nEngineering & Product Management LIaison I create user experiences based on these four principles.  \n \n1. Keep it simple \n2. Tell the right story \n3. Make it easy \n4. Instill wonder \n \nWith equal love and attachment to technology and design; I have found my calling in coming up with meaningful design solutions to problems — solutions that work great and look beautiful. Specialties:User Experience Design \nInteraction Design \nVisual Design \nData Visualization \nRapid Prototyping  \nContent Strategy & Information Architecture \nUser Research \nEngineering & Product Management LIaison Experience UI Designer Google September 2012  – Present (3 years) Greater Los Angeles Area User Experience Designer Yahoo! January 2012  –  September 2012  (9 months) Santa Monica Work with editorial teams to develop strategy for US Presidential Elections 2012, define products, work on interaction and visual design for those products. User Interface Designer DISTINC August 2010  –  January 2012  (1 year 6 months) Pasadena Designing creative solutions for the unique needs of non-profit organizations; helping with branding, multimedia presence, advertising and fund-raising. My role here was focussed on taking these efforts online by designing interactions for different formats like websites, advertising, email campaigns, viral marketing etc. Faculty Art Institute October 2010  –  May 2011  (8 months) North Hollywood I taught a one year course for college students covering every aspect of web design from information architecture to concepting to interaction design, visual design and finally programming their websites. Freelance designer Distinc June 2010  –  August 2010  (3 months) Designing creative solutions for the unique needs of non-profit organizations; helping with branding, multimedia presence, advertising and fund-raising. My role here was focussed on taking these efforts online by designing interactions for different formats like websites, advertising, email campaigns, viral marketing etc. Teaching Assistant California Institute of the Arts June 2008  –  June 2010  (2 years 1 month) Worked with Scott Zukowski, Shelley Stepp &Tom Bland Designer Distinc January 2010  –  January 2010  (1 month) Short freelance project to design collaterals for the 20th Ovation Award ceremony. Design Intern Distinc June 2009  –  August 2009  (3 months) Design Intern, worked on Branding and website projects. UX/UI Designer Ixmod Sensible Design May 2007  –  January 2008  (9 months) An initiative to remodel how people see design for the web in India. The focus here was to highlight the importance of good design in building an online experience for a Microsoft product website while keeping in mind the spirit of the brand already established through other avenues. Graphic Designer Arvind Brands November 2007  –  December 2007  (2 months) Working on style guide for Arrow shirts Design Intern 4D Retail Design January 2007  –  May 2007  (5 months) Design interiors for retail spaces; specializing in lighting. UI Designer Google September 2012  – Present (3 years) Greater Los Angeles Area UI Designer Google September 2012  – Present (3 years) Greater Los Angeles Area User Experience Designer Yahoo! January 2012  –  September 2012  (9 months) Santa Monica Work with editorial teams to develop strategy for US Presidential Elections 2012, define products, work on interaction and visual design for those products. User Experience Designer Yahoo! January 2012  –  September 2012  (9 months) Santa Monica Work with editorial teams to develop strategy for US Presidential Elections 2012, define products, work on interaction and visual design for those products. User Interface Designer DISTINC August 2010  –  January 2012  (1 year 6 months) Pasadena Designing creative solutions for the unique needs of non-profit organizations; helping with branding, multimedia presence, advertising and fund-raising. My role here was focussed on taking these efforts online by designing interactions for different formats like websites, advertising, email campaigns, viral marketing etc. User Interface Designer DISTINC August 2010  –  January 2012  (1 year 6 months) Pasadena Designing creative solutions for the unique needs of non-profit organizations; helping with branding, multimedia presence, advertising and fund-raising. My role here was focussed on taking these efforts online by designing interactions for different formats like websites, advertising, email campaigns, viral marketing etc. Faculty Art Institute October 2010  –  May 2011  (8 months) North Hollywood I taught a one year course for college students covering every aspect of web design from information architecture to concepting to interaction design, visual design and finally programming their websites. Faculty Art Institute October 2010  –  May 2011  (8 months) North Hollywood I taught a one year course for college students covering every aspect of web design from information architecture to concepting to interaction design, visual design and finally programming their websites. Freelance designer Distinc June 2010  –  August 2010  (3 months) Designing creative solutions for the unique needs of non-profit organizations; helping with branding, multimedia presence, advertising and fund-raising. My role here was focussed on taking these efforts online by designing interactions for different formats like websites, advertising, email campaigns, viral marketing etc. Freelance designer Distinc June 2010  –  August 2010  (3 months) Designing creative solutions for the unique needs of non-profit organizations; helping with branding, multimedia presence, advertising and fund-raising. My role here was focussed on taking these efforts online by designing interactions for different formats like websites, advertising, email campaigns, viral marketing etc. Teaching Assistant California Institute of the Arts June 2008  –  June 2010  (2 years 1 month) Worked with Scott Zukowski, Shelley Stepp &Tom Bland Teaching Assistant California Institute of the Arts June 2008  –  June 2010  (2 years 1 month) Worked with Scott Zukowski, Shelley Stepp &Tom Bland Designer Distinc January 2010  –  January 2010  (1 month) Short freelance project to design collaterals for the 20th Ovation Award ceremony. Designer Distinc January 2010  –  January 2010  (1 month) Short freelance project to design collaterals for the 20th Ovation Award ceremony. Design Intern Distinc June 2009  –  August 2009  (3 months) Design Intern, worked on Branding and website projects. Design Intern Distinc June 2009  –  August 2009  (3 months) Design Intern, worked on Branding and website projects. UX/UI Designer Ixmod Sensible Design May 2007  –  January 2008  (9 months) An initiative to remodel how people see design for the web in India. The focus here was to highlight the importance of good design in building an online experience for a Microsoft product website while keeping in mind the spirit of the brand already established through other avenues. UX/UI Designer Ixmod Sensible Design May 2007  –  January 2008  (9 months) An initiative to remodel how people see design for the web in India. The focus here was to highlight the importance of good design in building an online experience for a Microsoft product website while keeping in mind the spirit of the brand already established through other avenues. Graphic Designer Arvind Brands November 2007  –  December 2007  (2 months) Working on style guide for Arrow shirts Graphic Designer Arvind Brands November 2007  –  December 2007  (2 months) Working on style guide for Arrow shirts Design Intern 4D Retail Design January 2007  –  May 2007  (5 months) Design interiors for retail spaces; specializing in lighting. Design Intern 4D Retail Design January 2007  –  May 2007  (5 months) Design interiors for retail spaces; specializing in lighting. Languages English Hindi Punjabi English Hindi Punjabi English Hindi Punjabi Skills Information Architecture Wireframes Web Design Branding & Identity User Experience User Interface Design Interaction Design Graphic Design Experience Design After Effects InDesign User Experience Design CSS3 HTML 5 Adobe Creative Suite JavaScript Processing Photoshop OmniGraffle Dreamweaver Keynote See 6+     See less Skills  Information Architecture Wireframes Web Design Branding & Identity User Experience User Interface Design Interaction Design Graphic Design Experience Design After Effects InDesign User Experience Design CSS3 HTML 5 Adobe Creative Suite JavaScript Processing Photoshop OmniGraffle Dreamweaver Keynote See 6+     See less Information Architecture Wireframes Web Design Branding & Identity User Experience User Interface Design Interaction Design Graphic Design Experience Design After Effects InDesign User Experience Design CSS3 HTML 5 Adobe Creative Suite JavaScript Processing Photoshop OmniGraffle Dreamweaver Keynote See 6+     See less Information Architecture Wireframes Web Design Branding & Identity User Experience User Interface Design Interaction Design Graphic Design Experience Design After Effects InDesign User Experience Design CSS3 HTML 5 Adobe Creative Suite JavaScript Processing Photoshop OmniGraffle Dreamweaver Keynote See 6+     See less Education California Institute of the Arts Master Fine Arts,  Graphic Design 2008  – 2010 National Institute of Fashion Technology BDes,  Industrial Design 2003  – 2007 California Institute of the Arts Master Fine Arts,  Graphic Design 2008  – 2010 California Institute of the Arts Master Fine Arts,  Graphic Design 2008  – 2010 California Institute of the Arts Master Fine Arts,  Graphic Design 2008  – 2010 National Institute of Fashion Technology BDes,  Industrial Design 2003  – 2007 National Institute of Fashion Technology BDes,  Industrial Design 2003  – 2007 National Institute of Fashion Technology BDes,  Industrial Design 2003  – 2007 Honors & Awards Additional Honors & Awards Featured in Emerge, AIGA LA student chapter, 2010 \nFeatured in MIX, a British magazine on Art & Design Additional Honors & Awards Featured in Emerge, AIGA LA student chapter, 2010 \nFeatured in MIX, a British magazine on Art & Design Additional Honors & Awards Featured in Emerge, AIGA LA student chapter, 2010 \nFeatured in MIX, a British magazine on Art & Design Additional Honors & Awards Featured in Emerge, AIGA LA student chapter, 2010 \nFeatured in MIX, a British magazine on Art & Design ", "Summary My main interests focus on UX/UI Design & Development and a holistic view of how visual design plays a role within the companies I work for. My goal is to help facilitate bleeding edge products by merging design and development into a whole process. My continued goal is to refine and grown my design language and understanding while expanding my conceptual and practical design and development processes. Summary My main interests focus on UX/UI Design & Development and a holistic view of how visual design plays a role within the companies I work for. My goal is to help facilitate bleeding edge products by merging design and development into a whole process. My continued goal is to refine and grown my design language and understanding while expanding my conceptual and practical design and development processes. My main interests focus on UX/UI Design & Development and a holistic view of how visual design plays a role within the companies I work for. My goal is to help facilitate bleeding edge products by merging design and development into a whole process. My continued goal is to refine and grown my design language and understanding while expanding my conceptual and practical design and development processes. My main interests focus on UX/UI Design & Development and a holistic view of how visual design plays a role within the companies I work for. My goal is to help facilitate bleeding edge products by merging design and development into a whole process. My continued goal is to refine and grown my design language and understanding while expanding my conceptual and practical design and development processes. Experience UX/UI Designer Adecco, at Google January 2015  – Present (8 months) Cambridge, MA Designer / Founder SwissFish February 2011  – Present (4 years 7 months) Boston, MA Swiss Fish is a two person team that takes on small to mid sized design projects focusing mainly on branding and interactive web design. As founder I run day to day operations involving client communication, setting goals and presentations. I split design responsibilities with my awesome design mate Malisa Kuch, do art direction and web development. Designer Monderer Design February 2014  –  January 2015  (1 year) Cambridge, MA I worked as a Graphic Designer and Web Developer. My primary responsibilities included design of websites, wireframes, power point design, identity design, print collateral design and development of websites. UX/UI Designer & Developer Karmaloop.com September 2013  –  December 2013  (4 months) Boston, MA I worked as a UX/UI Designer & Developer on karmaloop.com my daily activities often consisted of researching trends in the retail and e-commerce fields for ways to improve usability and creating concepts in which to run A/B testing on. Graphic & Web Designer Tuatara Corporation January 2012  –  October 2012  (10 months) Cambridge, MA My responsibilities ranged from design of websites and social media skins, marketing creative sessions, branding our core product, HTML emails, UX research and UI design and development. I was the first non-management designer hired by the company and helped to influence the visual language of our core product. I left to focus on my growing freelance studio SwissFish. Associate Gap Inc./Old Navy October 2008  –  September 2012  (4 years) Graphic Apperal Design Intern Puma October 2011  –  December 2011  (3 months) My daily responsibilities were to review style magazines from across the globe in search of fashion trends and use that inspiration to create designs and patterns for clothing. Manager In-Training Olympia Sports December 2005  –  August 2007  (1 year 9 months) UX/UI Designer Adecco, at Google January 2015  – Present (8 months) Cambridge, MA UX/UI Designer Adecco, at Google January 2015  – Present (8 months) Cambridge, MA Designer / Founder SwissFish February 2011  – Present (4 years 7 months) Boston, MA Swiss Fish is a two person team that takes on small to mid sized design projects focusing mainly on branding and interactive web design. As founder I run day to day operations involving client communication, setting goals and presentations. I split design responsibilities with my awesome design mate Malisa Kuch, do art direction and web development. Designer / Founder SwissFish February 2011  – Present (4 years 7 months) Boston, MA Swiss Fish is a two person team that takes on small to mid sized design projects focusing mainly on branding and interactive web design. As founder I run day to day operations involving client communication, setting goals and presentations. I split design responsibilities with my awesome design mate Malisa Kuch, do art direction and web development. Designer Monderer Design February 2014  –  January 2015  (1 year) Cambridge, MA I worked as a Graphic Designer and Web Developer. My primary responsibilities included design of websites, wireframes, power point design, identity design, print collateral design and development of websites. Designer Monderer Design February 2014  –  January 2015  (1 year) Cambridge, MA I worked as a Graphic Designer and Web Developer. My primary responsibilities included design of websites, wireframes, power point design, identity design, print collateral design and development of websites. UX/UI Designer & Developer Karmaloop.com September 2013  –  December 2013  (4 months) Boston, MA I worked as a UX/UI Designer & Developer on karmaloop.com my daily activities often consisted of researching trends in the retail and e-commerce fields for ways to improve usability and creating concepts in which to run A/B testing on. UX/UI Designer & Developer Karmaloop.com September 2013  –  December 2013  (4 months) Boston, MA I worked as a UX/UI Designer & Developer on karmaloop.com my daily activities often consisted of researching trends in the retail and e-commerce fields for ways to improve usability and creating concepts in which to run A/B testing on. Graphic & Web Designer Tuatara Corporation January 2012  –  October 2012  (10 months) Cambridge, MA My responsibilities ranged from design of websites and social media skins, marketing creative sessions, branding our core product, HTML emails, UX research and UI design and development. I was the first non-management designer hired by the company and helped to influence the visual language of our core product. I left to focus on my growing freelance studio SwissFish. Graphic & Web Designer Tuatara Corporation January 2012  –  October 2012  (10 months) Cambridge, MA My responsibilities ranged from design of websites and social media skins, marketing creative sessions, branding our core product, HTML emails, UX research and UI design and development. I was the first non-management designer hired by the company and helped to influence the visual language of our core product. I left to focus on my growing freelance studio SwissFish. Associate Gap Inc./Old Navy October 2008  –  September 2012  (4 years) Associate Gap Inc./Old Navy October 2008  –  September 2012  (4 years) Graphic Apperal Design Intern Puma October 2011  –  December 2011  (3 months) My daily responsibilities were to review style magazines from across the globe in search of fashion trends and use that inspiration to create designs and patterns for clothing. Graphic Apperal Design Intern Puma October 2011  –  December 2011  (3 months) My daily responsibilities were to review style magazines from across the globe in search of fashion trends and use that inspiration to create designs and patterns for clothing. Manager In-Training Olympia Sports December 2005  –  August 2007  (1 year 9 months) Manager In-Training Olympia Sports December 2005  –  August 2007  (1 year 9 months) Skills HTML CSS Adobe Creative Suite Corporate Branding Web Design Web Development Graphic Design User Interface Design User Experience Social Media Layout Graphics Logo Design Art Direction Typography Skills  HTML CSS Adobe Creative Suite Corporate Branding Web Design Web Development Graphic Design User Interface Design User Experience Social Media Layout Graphics Logo Design Art Direction Typography HTML CSS Adobe Creative Suite Corporate Branding Web Design Web Development Graphic Design User Interface Design User Experience Social Media Layout Graphics Logo Design Art Direction Typography HTML CSS Adobe Creative Suite Corporate Branding Web Design Web Development Graphic Design User Interface Design User Experience Social Media Layout Graphics Logo Design Art Direction Typography Education The Art Institute of Boston at Lesley University BFA,  Graphic Design , 3.6 GPA, Magna Cum Laude 2011  – 2013 Activities and Societies:  Design Club Lakes Region Community College Graphic Design , 3.87 GPA 2009  – 2010 The Art Institute of Boston at Lesley University BFA,  Graphic Design , 3.6 GPA, Magna Cum Laude 2011  – 2013 Activities and Societies:  Design Club The Art Institute of Boston at Lesley University BFA,  Graphic Design , 3.6 GPA, Magna Cum Laude 2011  – 2013 Activities and Societies:  Design Club The Art Institute of Boston at Lesley University BFA,  Graphic Design , 3.6 GPA, Magna Cum Laude 2011  – 2013 Activities and Societies:  Design Club Lakes Region Community College Graphic Design , 3.87 GPA 2009  – 2010 Lakes Region Community College Graphic Design , 3.87 GPA 2009  – 2010 Lakes Region Community College Graphic Design , 3.87 GPA 2009  – 2010 ", "Summary Specialties:Rapid prototyping, data visualization, creative coding Summary Specialties:Rapid prototyping, data visualization, creative coding Specialties:Rapid prototyping, data visualization, creative coding Specialties:Rapid prototyping, data visualization, creative coding Experience UI Designer Google June 2012  – Present (3 years 3 months) Greater New York City Area Creative Technologist Google Creative Lab July 2011  –  June 2012  (1 year) New York My work involves design and prototyping interactions for both Google products and digital campaigns. Design Intern Inkling May 2010  –  August 2010  (4 months) As a hybrid desinger/developer, I worked with design and engineering teams on a varieties of projects from designing interactions for iPad, to visualizing data in Processing. Interaction Design Intern Smart Design June 2009  –  August 2009  (3 months) Working in a team on a web interface project, I contributed not only in major front-end visual design but also the back-end development using Flex in MVC framework. Teaching Assistant Art Center College of Design January 2009  –  April 2009  (4 months) Programming assistant for interactive sound designs for People Knowing class taught by Ben Hooker. UI Designer Google June 2012  – Present (3 years 3 months) Greater New York City Area UI Designer Google June 2012  – Present (3 years 3 months) Greater New York City Area Creative Technologist Google Creative Lab July 2011  –  June 2012  (1 year) New York My work involves design and prototyping interactions for both Google products and digital campaigns. Creative Technologist Google Creative Lab July 2011  –  June 2012  (1 year) New York My work involves design and prototyping interactions for both Google products and digital campaigns. Design Intern Inkling May 2010  –  August 2010  (4 months) As a hybrid desinger/developer, I worked with design and engineering teams on a varieties of projects from designing interactions for iPad, to visualizing data in Processing. Design Intern Inkling May 2010  –  August 2010  (4 months) As a hybrid desinger/developer, I worked with design and engineering teams on a varieties of projects from designing interactions for iPad, to visualizing data in Processing. Interaction Design Intern Smart Design June 2009  –  August 2009  (3 months) Working in a team on a web interface project, I contributed not only in major front-end visual design but also the back-end development using Flex in MVC framework. Interaction Design Intern Smart Design June 2009  –  August 2009  (3 months) Working in a team on a web interface project, I contributed not only in major front-end visual design but also the back-end development using Flex in MVC framework. Teaching Assistant Art Center College of Design January 2009  –  April 2009  (4 months) Programming assistant for interactive sound designs for People Knowing class taught by Ben Hooker. Teaching Assistant Art Center College of Design January 2009  –  April 2009  (4 months) Programming assistant for interactive sound designs for People Knowing class taught by Ben Hooker. Languages English Chinese English Chinese English Chinese Skills JavaScript Processing Python Illustrator InDesign Photoshop Skills  JavaScript Processing Python Illustrator InDesign Photoshop JavaScript Processing Python Illustrator InDesign Photoshop JavaScript Processing Python Illustrator InDesign Photoshop Education ArtCenter College of Design M.F.A,  Media Design 2008  – 2011 National Taiwan University Bachelor of Science,  Electrical Engineering 2003  – 2007 ArtCenter College of Design M.F.A,  Media Design 2008  – 2011 ArtCenter College of Design M.F.A,  Media Design 2008  – 2011 ArtCenter College of Design M.F.A,  Media Design 2008  – 2011 National Taiwan University Bachelor of Science,  Electrical Engineering 2003  – 2007 National Taiwan University Bachelor of Science,  Electrical Engineering 2003  – 2007 National Taiwan University Bachelor of Science,  Electrical Engineering 2003  – 2007 ", "Summary I am a Creative Director and visual design specialist originally from England. I design and create brand systems, interactive experiences and user interfaces for companies and agencies. I enjoy helping people to reimagine the visual story they are presenting. \n \nMy client list has included Google, Adidas, Charles Schwab, Cisco, Hyundai, Sony, Blue Shield of California, New York Times and PayPal. \n \nMy skill set includes creative direction, concept development, brand identity design, UX / user experience design, interactive design, UI / user interface design for digital, mobile and print. Areas of expertise include website design, mobile, interactive, digital campaigns, native apps, touchscreen experiences, brand exploration and pitch work.  \n \nwww.coroflot.com/jessewoodward Summary I am a Creative Director and visual design specialist originally from England. I design and create brand systems, interactive experiences and user interfaces for companies and agencies. I enjoy helping people to reimagine the visual story they are presenting. \n \nMy client list has included Google, Adidas, Charles Schwab, Cisco, Hyundai, Sony, Blue Shield of California, New York Times and PayPal. \n \nMy skill set includes creative direction, concept development, brand identity design, UX / user experience design, interactive design, UI / user interface design for digital, mobile and print. Areas of expertise include website design, mobile, interactive, digital campaigns, native apps, touchscreen experiences, brand exploration and pitch work.  \n \nwww.coroflot.com/jessewoodward I am a Creative Director and visual design specialist originally from England. I design and create brand systems, interactive experiences and user interfaces for companies and agencies. I enjoy helping people to reimagine the visual story they are presenting. \n \nMy client list has included Google, Adidas, Charles Schwab, Cisco, Hyundai, Sony, Blue Shield of California, New York Times and PayPal. \n \nMy skill set includes creative direction, concept development, brand identity design, UX / user experience design, interactive design, UI / user interface design for digital, mobile and print. Areas of expertise include website design, mobile, interactive, digital campaigns, native apps, touchscreen experiences, brand exploration and pitch work.  \n \nwww.coroflot.com/jessewoodward I am a Creative Director and visual design specialist originally from England. I design and create brand systems, interactive experiences and user interfaces for companies and agencies. I enjoy helping people to reimagine the visual story they are presenting. \n \nMy client list has included Google, Adidas, Charles Schwab, Cisco, Hyundai, Sony, Blue Shield of California, New York Times and PayPal. \n \nMy skill set includes creative direction, concept development, brand identity design, UX / user experience design, interactive design, UI / user interface design for digital, mobile and print. Areas of expertise include website design, mobile, interactive, digital campaigns, native apps, touchscreen experiences, brand exploration and pitch work.  \n \nwww.coroflot.com/jessewoodward Experience Senior UI Designer Google February 2015  – Present (7 months) San Francisco Contract role at Google as Senior User Interface Designer and visual design consultant for next-generation technologies and their interaction with the physical world. Associate Creative Director First Person July 2013  –  September 2014  (1 year 3 months) San Francisco ACD role for First Person in San Francisco. Responsible for creative direction, execution, concept development and delivery of all interactive projects. Creative oversight and storyboarding of interactive experiences developed in HTML5, iOS, Flash and Unity. User Experience and UI design for touchscreen applications. Art direction and integration of motion design elements. Client communication and pitch development. Client list: Cisco, Schwab, Hyundai, Symantec, Activision. Senior Art Director First Person July 2012  –  July 2013  (1 year 1 month) San Francisco Bay Area Senior Art Director for Interactive Department. Responsible for creative direction, user experience and UI Design for touchscreen applications, web sites, mobile apps and interactive projects. Art direction and integration of motion design elements. Art Director Tribal DDB June 2011  –  January 2012  (8 months) San Francisco Freelance Art Director for Tribal DDB’s global clients. Digital campaigns and pitch work for Clorox brands, Healthy Choice and Brita Mobile. Concept, art direction and design of new website for Conagra Foods subsidiary ROTEL. Art Director Isobar November 2010  –  April 2011  (6 months) Freelance Art Director at global brand agency Isobar. Design and art direction of comprehensive new website for healthcare provider Blue Shield of California. Site component design for luxury hotel chain Mandarin Oriental. Mobile app design and development for Adidas ClimaCool campaign. Art Director Forty Forty Agency August 2010  –  September 2010  (2 months) Art direction, branding and design for the NFL and Major League Baseball. Design of stadium signage, merchandising and logo treatments. Brand campaign and identity application work for Spike TV. Senior UI Designer Real Networks February 2009  –  November 2009  (10 months) Art direction and design of next generation UI for flagship RealPlayer application. Supervision of multi-component production across Real Networks platforms; website, mobile, UX/UI and interactive design. Freelance Designer Woodward & Phillips December 2000  –  November 2009  (9 years) Freelance web/print design and art direction for small businesses and non-profits Senior UX Designer Entellium December 2007  –  October 2008  (11 months) Art direction and design of complete re-branding system including identity, print, digital and UX components. Supervision and management of design team for all collateral deliverables. Lead UX design role for Rave CRM software application. Senior Designer FICO February 2005  –  June 2007  (2 years 5 months) Senior Designer role overseeing corporate branding, art direction and positioning. Responsible for design and marketing of new branding themes and implementation of company-wide campaigns. Senior Designer Citigroup February 2004  –  September 2004  (8 months) Art direction and collateral print design for Citigroup Worldwide Financial Services campaign. Supervision of new design implementation and general production consultant. Associate Professor State University of New York September 2003  –  May 2004  (9 months) Associate Professor teaching final portfolio class to graduating Senior-level students. Responsible for syllabus content, overall class structure and final assessments. Senior Designer The New York Times March 2003  –  February 2004  (1 year) Freelance article design and layout for newspaper, editorial and magazine sections. Responsible for design and production through final press mechanicals, including photo editing and writer collaboration. Senior Designer Enterprise Identity Group April 2003  –  June 2003  (3 months) Worldwide brand and identity consultants specializing in strategy, creative and implementation skills. Freelance collaboration as Senior Designer for leading health care company Cardinal Health. Senior Designer A&E Television Networks April 2002  –  December 2002  (9 months) Freelance collaboration with cable television network. Art direction and design of marketing materials and packaging for A&E Networks: History Channel International and The Biography Channel. Lead Designer Doublespace November 1998  –  June 2001  (2 years 8 months) Digital NYC agency specializing in complete branding solutions for emerging web businesses. Lead Designer role, print media and website creation from concept through execution. Senior UI Designer Google February 2015  – Present (7 months) San Francisco Contract role at Google as Senior User Interface Designer and visual design consultant for next-generation technologies and their interaction with the physical world. Senior UI Designer Google February 2015  – Present (7 months) San Francisco Contract role at Google as Senior User Interface Designer and visual design consultant for next-generation technologies and their interaction with the physical world. Associate Creative Director First Person July 2013  –  September 2014  (1 year 3 months) San Francisco ACD role for First Person in San Francisco. Responsible for creative direction, execution, concept development and delivery of all interactive projects. Creative oversight and storyboarding of interactive experiences developed in HTML5, iOS, Flash and Unity. User Experience and UI design for touchscreen applications. Art direction and integration of motion design elements. Client communication and pitch development. Client list: Cisco, Schwab, Hyundai, Symantec, Activision. Associate Creative Director First Person July 2013  –  September 2014  (1 year 3 months) San Francisco ACD role for First Person in San Francisco. Responsible for creative direction, execution, concept development and delivery of all interactive projects. Creative oversight and storyboarding of interactive experiences developed in HTML5, iOS, Flash and Unity. User Experience and UI design for touchscreen applications. Art direction and integration of motion design elements. Client communication and pitch development. Client list: Cisco, Schwab, Hyundai, Symantec, Activision. Senior Art Director First Person July 2012  –  July 2013  (1 year 1 month) San Francisco Bay Area Senior Art Director for Interactive Department. Responsible for creative direction, user experience and UI Design for touchscreen applications, web sites, mobile apps and interactive projects. Art direction and integration of motion design elements. Senior Art Director First Person July 2012  –  July 2013  (1 year 1 month) San Francisco Bay Area Senior Art Director for Interactive Department. Responsible for creative direction, user experience and UI Design for touchscreen applications, web sites, mobile apps and interactive projects. Art direction and integration of motion design elements. Art Director Tribal DDB June 2011  –  January 2012  (8 months) San Francisco Freelance Art Director for Tribal DDB’s global clients. Digital campaigns and pitch work for Clorox brands, Healthy Choice and Brita Mobile. Concept, art direction and design of new website for Conagra Foods subsidiary ROTEL. Art Director Tribal DDB June 2011  –  January 2012  (8 months) San Francisco Freelance Art Director for Tribal DDB’s global clients. Digital campaigns and pitch work for Clorox brands, Healthy Choice and Brita Mobile. Concept, art direction and design of new website for Conagra Foods subsidiary ROTEL. Art Director Isobar November 2010  –  April 2011  (6 months) Freelance Art Director at global brand agency Isobar. Design and art direction of comprehensive new website for healthcare provider Blue Shield of California. Site component design for luxury hotel chain Mandarin Oriental. Mobile app design and development for Adidas ClimaCool campaign. Art Director Isobar November 2010  –  April 2011  (6 months) Freelance Art Director at global brand agency Isobar. Design and art direction of comprehensive new website for healthcare provider Blue Shield of California. Site component design for luxury hotel chain Mandarin Oriental. Mobile app design and development for Adidas ClimaCool campaign. Art Director Forty Forty Agency August 2010  –  September 2010  (2 months) Art direction, branding and design for the NFL and Major League Baseball. Design of stadium signage, merchandising and logo treatments. Brand campaign and identity application work for Spike TV. Art Director Forty Forty Agency August 2010  –  September 2010  (2 months) Art direction, branding and design for the NFL and Major League Baseball. Design of stadium signage, merchandising and logo treatments. Brand campaign and identity application work for Spike TV. Senior UI Designer Real Networks February 2009  –  November 2009  (10 months) Art direction and design of next generation UI for flagship RealPlayer application. Supervision of multi-component production across Real Networks platforms; website, mobile, UX/UI and interactive design. Senior UI Designer Real Networks February 2009  –  November 2009  (10 months) Art direction and design of next generation UI for flagship RealPlayer application. Supervision of multi-component production across Real Networks platforms; website, mobile, UX/UI and interactive design. Freelance Designer Woodward & Phillips December 2000  –  November 2009  (9 years) Freelance web/print design and art direction for small businesses and non-profits Freelance Designer Woodward & Phillips December 2000  –  November 2009  (9 years) Freelance web/print design and art direction for small businesses and non-profits Senior UX Designer Entellium December 2007  –  October 2008  (11 months) Art direction and design of complete re-branding system including identity, print, digital and UX components. Supervision and management of design team for all collateral deliverables. Lead UX design role for Rave CRM software application. Senior UX Designer Entellium December 2007  –  October 2008  (11 months) Art direction and design of complete re-branding system including identity, print, digital and UX components. Supervision and management of design team for all collateral deliverables. Lead UX design role for Rave CRM software application. Senior Designer FICO February 2005  –  June 2007  (2 years 5 months) Senior Designer role overseeing corporate branding, art direction and positioning. Responsible for design and marketing of new branding themes and implementation of company-wide campaigns. Senior Designer FICO February 2005  –  June 2007  (2 years 5 months) Senior Designer role overseeing corporate branding, art direction and positioning. Responsible for design and marketing of new branding themes and implementation of company-wide campaigns. Senior Designer Citigroup February 2004  –  September 2004  (8 months) Art direction and collateral print design for Citigroup Worldwide Financial Services campaign. Supervision of new design implementation and general production consultant. Senior Designer Citigroup February 2004  –  September 2004  (8 months) Art direction and collateral print design for Citigroup Worldwide Financial Services campaign. Supervision of new design implementation and general production consultant. Associate Professor State University of New York September 2003  –  May 2004  (9 months) Associate Professor teaching final portfolio class to graduating Senior-level students. Responsible for syllabus content, overall class structure and final assessments. Associate Professor State University of New York September 2003  –  May 2004  (9 months) Associate Professor teaching final portfolio class to graduating Senior-level students. Responsible for syllabus content, overall class structure and final assessments. Senior Designer The New York Times March 2003  –  February 2004  (1 year) Freelance article design and layout for newspaper, editorial and magazine sections. Responsible for design and production through final press mechanicals, including photo editing and writer collaboration. Senior Designer The New York Times March 2003  –  February 2004  (1 year) Freelance article design and layout for newspaper, editorial and magazine sections. Responsible for design and production through final press mechanicals, including photo editing and writer collaboration. Senior Designer Enterprise Identity Group April 2003  –  June 2003  (3 months) Worldwide brand and identity consultants specializing in strategy, creative and implementation skills. Freelance collaboration as Senior Designer for leading health care company Cardinal Health. Senior Designer Enterprise Identity Group April 2003  –  June 2003  (3 months) Worldwide brand and identity consultants specializing in strategy, creative and implementation skills. Freelance collaboration as Senior Designer for leading health care company Cardinal Health. Senior Designer A&E Television Networks April 2002  –  December 2002  (9 months) Freelance collaboration with cable television network. Art direction and design of marketing materials and packaging for A&E Networks: History Channel International and The Biography Channel. Senior Designer A&E Television Networks April 2002  –  December 2002  (9 months) Freelance collaboration with cable television network. Art direction and design of marketing materials and packaging for A&E Networks: History Channel International and The Biography Channel. Lead Designer Doublespace November 1998  –  June 2001  (2 years 8 months) Digital NYC agency specializing in complete branding solutions for emerging web businesses. Lead Designer role, print media and website creation from concept through execution. Lead Designer Doublespace November 1998  –  June 2001  (2 years 8 months) Digital NYC agency specializing in complete branding solutions for emerging web businesses. Lead Designer role, print media and website creation from concept through execution. Skills Mobile User Experience Art Direction Adobe Creative Suite Logo Design UI Design Brand Development Digital Design User Interface Design Branding & Identity Concept Development Corporate Branding Interactive Advertising User Experience Design Creative Strategy Corporate Identity Web Design Graphic Design Typography Creative Direction Interaction Design Mobile Design Mobile Devices Visual Communication Digital Marketing InDesign Design Strategy Layout Information Design Storyboarding Flash Mobile Applications Visual Design Experience Design Packaging Integrated Circuit... User Interface Collateral See 23+     See less Skills  Mobile User Experience Art Direction Adobe Creative Suite Logo Design UI Design Brand Development Digital Design User Interface Design Branding & Identity Concept Development Corporate Branding Interactive Advertising User Experience Design Creative Strategy Corporate Identity Web Design Graphic Design Typography Creative Direction Interaction Design Mobile Design Mobile Devices Visual Communication Digital Marketing InDesign Design Strategy Layout Information Design Storyboarding Flash Mobile Applications Visual Design Experience Design Packaging Integrated Circuit... User Interface Collateral See 23+     See less Mobile User Experience Art Direction Adobe Creative Suite Logo Design UI Design Brand Development Digital Design User Interface Design Branding & Identity Concept Development Corporate Branding Interactive Advertising User Experience Design Creative Strategy Corporate Identity Web Design Graphic Design Typography Creative Direction Interaction Design Mobile Design Mobile Devices Visual Communication Digital Marketing InDesign Design Strategy Layout Information Design Storyboarding Flash Mobile Applications Visual Design Experience Design Packaging Integrated Circuit... User Interface Collateral See 23+     See less Mobile User Experience Art Direction Adobe Creative Suite Logo Design UI Design Brand Development Digital Design User Interface Design Branding & Identity Concept Development Corporate Branding Interactive Advertising User Experience Design Creative Strategy Corporate Identity Web Design Graphic Design Typography Creative Direction Interaction Design Mobile Design Mobile Devices Visual Communication Digital Marketing InDesign Design Strategy Layout Information Design Storyboarding Flash Mobile Applications Visual Design Experience Design Packaging Integrated Circuit... User Interface Collateral See 23+     See less Education Tyler School of Art (at Temple University) BFA,  Graphic Design 1992  – 1996 Tyler School of Art Bachelor of Fine Arts (BFA),  Graphic Design Tyler School of Art (at Temple University) BFA,  Graphic Design 1992  – 1996 Tyler School of Art (at Temple University) BFA,  Graphic Design 1992  – 1996 Tyler School of Art (at Temple University) BFA,  Graphic Design 1992  – 1996 Tyler School of Art Bachelor of Fine Arts (BFA),  Graphic Design Tyler School of Art Bachelor of Fine Arts (BFA),  Graphic Design Tyler School of Art Bachelor of Fine Arts (BFA),  Graphic Design ", "Experience UI Designer and Prototyper Google July 2013  – Present (2 years 2 months) UI Designer for Google+ Hangouts UI/UX Designer Google October 2012  – Present (2 years 11 months) UI and Interaction designer on G+ Photos and Events Director, UI Designer, Front End Engineer Omnomnom Studios Pty Ltd April 2009  –  October 2012  (3 years 7 months) Software Developer and UI Designer AJS Computing Services 2010  –  2011  (1 year) I was instrumental in leading the UI design and front end implementation of several proprietary projects for DMG and Austereo. This involved designing and implementing a complex advertising planning and billing product using WPF. Apple Specialist Apple Inc. 2007  –  2007  (less than a year) UI Designer and Prototyper Google July 2013  – Present (2 years 2 months) UI Designer for Google+ Hangouts UI Designer and Prototyper Google July 2013  – Present (2 years 2 months) UI Designer for Google+ Hangouts UI/UX Designer Google October 2012  – Present (2 years 11 months) UI and Interaction designer on G+ Photos and Events UI/UX Designer Google October 2012  – Present (2 years 11 months) UI and Interaction designer on G+ Photos and Events Director, UI Designer, Front End Engineer Omnomnom Studios Pty Ltd April 2009  –  October 2012  (3 years 7 months) Director, UI Designer, Front End Engineer Omnomnom Studios Pty Ltd April 2009  –  October 2012  (3 years 7 months) Software Developer and UI Designer AJS Computing Services 2010  –  2011  (1 year) I was instrumental in leading the UI design and front end implementation of several proprietary projects for DMG and Austereo. This involved designing and implementing a complex advertising planning and billing product using WPF. Software Developer and UI Designer AJS Computing Services 2010  –  2011  (1 year) I was instrumental in leading the UI design and front end implementation of several proprietary projects for DMG and Austereo. This involved designing and implementing a complex advertising planning and billing product using WPF. Apple Specialist Apple Inc. 2007  –  2007  (less than a year) Apple Specialist Apple Inc. 2007  –  2007  (less than a year) Languages Cantonese Cantonese Cantonese Skills iOS Human Computer... User Interface Design CSS3 Typography Rapid Prototyping Interaction Design HTML JavaScript iLife iWork iPod OS X Aperture iPhone iTunes Apple Aperture Mac iPad iPhoto Keynote Mac OS Consumer Electronics Photography Coda Music User Experience Wire Framing XAML WPF Development Front-end CSS See 17+     See less Skills  iOS Human Computer... User Interface Design CSS3 Typography Rapid Prototyping Interaction Design HTML JavaScript iLife iWork iPod OS X Aperture iPhone iTunes Apple Aperture Mac iPad iPhoto Keynote Mac OS Consumer Electronics Photography Coda Music User Experience Wire Framing XAML WPF Development Front-end CSS See 17+     See less iOS Human Computer... User Interface Design CSS3 Typography Rapid Prototyping Interaction Design HTML JavaScript iLife iWork iPod OS X Aperture iPhone iTunes Apple Aperture Mac iPad iPhoto Keynote Mac OS Consumer Electronics Photography Coda Music User Experience Wire Framing XAML WPF Development Front-end CSS See 17+     See less iOS Human Computer... User Interface Design CSS3 Typography Rapid Prototyping Interaction Design HTML JavaScript iLife iWork iPod OS X Aperture iPhone iTunes Apple Aperture Mac iPad iPhoto Keynote Mac OS Consumer Electronics Photography Coda Music User Experience Wire Framing XAML WPF Development Front-end CSS See 17+     See less Education University of NSW Bachelor of Digital Media/Bachelor Computer Science,  Human Computer Interaction 2009  – 2012 University of Technology, Sydney Bachelor of Design,  Visual Communication 2008  – 2009 University of NSW Bachelor of Digital Media/Bachelor Computer Science,  Human Computer Interaction 2009  – 2012 University of NSW Bachelor of Digital Media/Bachelor Computer Science,  Human Computer Interaction 2009  – 2012 University of NSW Bachelor of Digital Media/Bachelor Computer Science,  Human Computer Interaction 2009  – 2012 University of Technology, Sydney Bachelor of Design,  Visual Communication 2008  – 2009 University of Technology, Sydney Bachelor of Design,  Visual Communication 2008  – 2009 University of Technology, Sydney Bachelor of Design,  Visual Communication 2008  – 2009 ", "Summary Specialties:Adobe Creative Suite applications including Acrobat Pro, Illustrator, Photoshop, Dreamweaver, InDesign, Flash, and After Effects; Logic Studio; QuarkXPress; XHTML; CSS; JavaScript; ActionScript 3.0; Microsoft Office tools; Mac and PC platforms; book arts/book binding; screen printing; linoleum printing; and storyboarding Summary Specialties:Adobe Creative Suite applications including Acrobat Pro, Illustrator, Photoshop, Dreamweaver, InDesign, Flash, and After Effects; Logic Studio; QuarkXPress; XHTML; CSS; JavaScript; ActionScript 3.0; Microsoft Office tools; Mac and PC platforms; book arts/book binding; screen printing; linoleum printing; and storyboarding Specialties:Adobe Creative Suite applications including Acrobat Pro, Illustrator, Photoshop, Dreamweaver, InDesign, Flash, and After Effects; Logic Studio; QuarkXPress; XHTML; CSS; JavaScript; ActionScript 3.0; Microsoft Office tools; Mac and PC platforms; book arts/book binding; screen printing; linoleum printing; and storyboarding Specialties:Adobe Creative Suite applications including Acrobat Pro, Illustrator, Photoshop, Dreamweaver, InDesign, Flash, and After Effects; Logic Studio; QuarkXPress; XHTML; CSS; JavaScript; ActionScript 3.0; Microsoft Office tools; Mac and PC platforms; book arts/book binding; screen printing; linoleum printing; and storyboarding Experience UI Designer Google February 2012  – Present (3 years 7 months) Mountain View, CA User Experience Designer TalkBin September 2011  –  February 2012  (6 months) Telecommute User Experience Design Intern Google June 2011  –  August 2011  (3 months) Mountain View, CA Sales Support Banana Republic November 2007  –  March 2011  (3 years 5 months) Process transactions. Greet and assist customers. Pitch the store credit card. Reticket returns. Web Designer The Urban Forest Project San Francisco December 2009  –  April 2010  (5 months) Designed and coded the layout using XHTML, CSS, and PHP. Incorporated Wordpress as a CMS. Managed website. Senior Designer Designs By Bo July 2006  –  September 2007  (1 year 3 months) Designed web layouts, newspaper ads, fliers, business cards, and banners. Coded web layouts using W3C standard XHTML & CSS. Organized finances and sent out client invoices. Worked with closely with clients to ensure the best possible design. UI Designer Google February 2012  – Present (3 years 7 months) Mountain View, CA UI Designer Google February 2012  – Present (3 years 7 months) Mountain View, CA User Experience Designer TalkBin September 2011  –  February 2012  (6 months) Telecommute User Experience Designer TalkBin September 2011  –  February 2012  (6 months) Telecommute User Experience Design Intern Google June 2011  –  August 2011  (3 months) Mountain View, CA User Experience Design Intern Google June 2011  –  August 2011  (3 months) Mountain View, CA Sales Support Banana Republic November 2007  –  March 2011  (3 years 5 months) Process transactions. Greet and assist customers. Pitch the store credit card. Reticket returns. Sales Support Banana Republic November 2007  –  March 2011  (3 years 5 months) Process transactions. Greet and assist customers. Pitch the store credit card. Reticket returns. Web Designer The Urban Forest Project San Francisco December 2009  –  April 2010  (5 months) Designed and coded the layout using XHTML, CSS, and PHP. Incorporated Wordpress as a CMS. Managed website. Web Designer The Urban Forest Project San Francisco December 2009  –  April 2010  (5 months) Designed and coded the layout using XHTML, CSS, and PHP. Incorporated Wordpress as a CMS. Managed website. Senior Designer Designs By Bo July 2006  –  September 2007  (1 year 3 months) Designed web layouts, newspaper ads, fliers, business cards, and banners. Coded web layouts using W3C standard XHTML & CSS. Organized finances and sent out client invoices. Worked with closely with clients to ensure the best possible design. Senior Designer Designs By Bo July 2006  –  September 2007  (1 year 3 months) Designed web layouts, newspaper ads, fliers, business cards, and banners. Coded web layouts using W3C standard XHTML & CSS. Organized finances and sent out client invoices. Worked with closely with clients to ensure the best possible design. Skills Illustrator Photoshop Dreamweaver InDesign Adobe Creative Suite Adobe Acrobat After Effects CSS HTML Fireworks Print Screen Printing Web Design Graphic Design Wordpress Illustration Photography Logo Design User Interface Design User Experience CSS3 Visual Design Interaction Design Typography WordPress Art Direction ActionScript See 12+     See less Skills  Illustrator Photoshop Dreamweaver InDesign Adobe Creative Suite Adobe Acrobat After Effects CSS HTML Fireworks Print Screen Printing Web Design Graphic Design Wordpress Illustration Photography Logo Design User Interface Design User Experience CSS3 Visual Design Interaction Design Typography WordPress Art Direction ActionScript See 12+     See less Illustrator Photoshop Dreamweaver InDesign Adobe Creative Suite Adobe Acrobat After Effects CSS HTML Fireworks Print Screen Printing Web Design Graphic Design Wordpress Illustration Photography Logo Design User Interface Design User Experience CSS3 Visual Design Interaction Design Typography WordPress Art Direction ActionScript See 12+     See less Illustrator Photoshop Dreamweaver InDesign Adobe Creative Suite Adobe Acrobat After Effects CSS HTML Fireworks Print Screen Printing Web Design Graphic Design Wordpress Illustration Photography Logo Design User Interface Design User Experience CSS3 Visual Design Interaction Design Typography WordPress Art Direction ActionScript See 12+     See less Education Academy of Art University BFA,  Web Design + New Media 2007  – 2011 Academy of Art University BFA,  Web Design + New Media 2007  – 2011 Academy of Art University BFA,  Web Design + New Media 2007  – 2011 Academy of Art University BFA,  Web Design + New Media 2007  – 2011 Honors & Awards Additional Honors & Awards 1st Place in \"Process Journals\", Academy of Art University Spring Show, 2011 \n \nPresidential Scholarship, Academy of Art University, 2010 \n \n1st Place in \"Web+Interactive\", Academy of Art University Spring Show, 2010 Additional Honors & Awards 1st Place in \"Process Journals\", Academy of Art University Spring Show, 2011 \n \nPresidential Scholarship, Academy of Art University, 2010 \n \n1st Place in \"Web+Interactive\", Academy of Art University Spring Show, 2010 Additional Honors & Awards 1st Place in \"Process Journals\", Academy of Art University Spring Show, 2011 \n \nPresidential Scholarship, Academy of Art University, 2010 \n \n1st Place in \"Web+Interactive\", Academy of Art University Spring Show, 2010 Additional Honors & Awards 1st Place in \"Process Journals\", Academy of Art University Spring Show, 2011 \n \nPresidential Scholarship, Academy of Art University, 2010 \n \n1st Place in \"Web+Interactive\", Academy of Art University Spring Show, 2010 ", "Summary I am a design lead at Google, focusing on building new user experiences in Search. Summary I am a design lead at Google, focusing on building new user experiences in Search. I am a design lead at Google, focusing on building new user experiences in Search. I am a design lead at Google, focusing on building new user experiences in Search. Experience Design Lead and Manager for Search Experience Google December 2014  – Present (9 months) Design Lead and Manager for Google Knowledge Graph. Google August 2013  –  January 2015  (1 year 6 months) Was responsible for providing creative, design, and vision leadership to this rapidly growing product area in Search. Conceived, designed, and launched new features in Search that positively shifted metrics and user happiness. Led a team of designers responsible for experiences that deliver structured answers to the page based on user query. Senior UI Designer for Google Knowledge Graph in Search Google April 2013  –  August 2013  (5 months) UI Designer Google July 2010  –  May 2013  (2 years 11 months) Senior Web Designer Metaweb Technologies, Inc. March 2008  –  July 2010  (2 years 5 months) Crafting http://www.freebase.com. Acquired by Google in July of 2010. Web Design Consultant selfemployed 2006  –  2008  (2 years) Independent consultant advising on numerous web projects related to online branding, interface design, web standards development, information architecture, accessibility, and CMS design. Co-Founder & Digital Design Director Crux Studio 2002  –  2006  (4 years) Founding Partner in a design and marketing firm working with Outdoor Sports clients to develop brand solutions. Directed complete advertising campaigns from conception to finished product. Designed and developed all manner of websites including e-commerce and custom content management systems as well as engaging brand-orientated user interfaces. Traditional print design of advertisements, brochures, and catalogs. Coordinated and acted as lead photographer on nation-wide photoshoots with professional athletes. Clients served include: \n \n* Specialized Bicycle Components \n* Maxxis International \n* Fox Racing \n* FTC Skateboarding \n* SFO Snowboarding \n* Ricor Racing Shocks Contractor McAfee (formerly Network Associates) 1999  –  2001  (2 years) Joined the web design team to consolidate eight separate websites into a single, cohesive online identity for Network Associates. Template design, html/css development, etc. Designed front-page graphics for daily virus alerts under tight deadlines. Also spearheaded Search Engine Optimization efforts with top 10 results for targeted key words in major browsers. Contractor Oracle 1998  –  1999  (1 year) Media 100 technician producing various video segments for the Interactive Media department at Oracle. Design Lead and Manager for Search Experience Google December 2014  – Present (9 months) Design Lead and Manager for Search Experience Google December 2014  – Present (9 months) Design Lead and Manager for Google Knowledge Graph. Google August 2013  –  January 2015  (1 year 6 months) Was responsible for providing creative, design, and vision leadership to this rapidly growing product area in Search. Conceived, designed, and launched new features in Search that positively shifted metrics and user happiness. Led a team of designers responsible for experiences that deliver structured answers to the page based on user query. Design Lead and Manager for Google Knowledge Graph. Google August 2013  –  January 2015  (1 year 6 months) Was responsible for providing creative, design, and vision leadership to this rapidly growing product area in Search. Conceived, designed, and launched new features in Search that positively shifted metrics and user happiness. Led a team of designers responsible for experiences that deliver structured answers to the page based on user query. Senior UI Designer for Google Knowledge Graph in Search Google April 2013  –  August 2013  (5 months) Senior UI Designer for Google Knowledge Graph in Search Google April 2013  –  August 2013  (5 months) UI Designer Google July 2010  –  May 2013  (2 years 11 months) UI Designer Google July 2010  –  May 2013  (2 years 11 months) Senior Web Designer Metaweb Technologies, Inc. March 2008  –  July 2010  (2 years 5 months) Crafting http://www.freebase.com. Acquired by Google in July of 2010. Senior Web Designer Metaweb Technologies, Inc. March 2008  –  July 2010  (2 years 5 months) Crafting http://www.freebase.com. Acquired by Google in July of 2010. Web Design Consultant selfemployed 2006  –  2008  (2 years) Independent consultant advising on numerous web projects related to online branding, interface design, web standards development, information architecture, accessibility, and CMS design. Web Design Consultant selfemployed 2006  –  2008  (2 years) Independent consultant advising on numerous web projects related to online branding, interface design, web standards development, information architecture, accessibility, and CMS design. Co-Founder & Digital Design Director Crux Studio 2002  –  2006  (4 years) Founding Partner in a design and marketing firm working with Outdoor Sports clients to develop brand solutions. Directed complete advertising campaigns from conception to finished product. Designed and developed all manner of websites including e-commerce and custom content management systems as well as engaging brand-orientated user interfaces. Traditional print design of advertisements, brochures, and catalogs. Coordinated and acted as lead photographer on nation-wide photoshoots with professional athletes. Clients served include: \n \n* Specialized Bicycle Components \n* Maxxis International \n* Fox Racing \n* FTC Skateboarding \n* SFO Snowboarding \n* Ricor Racing Shocks Co-Founder & Digital Design Director Crux Studio 2002  –  2006  (4 years) Founding Partner in a design and marketing firm working with Outdoor Sports clients to develop brand solutions. Directed complete advertising campaigns from conception to finished product. Designed and developed all manner of websites including e-commerce and custom content management systems as well as engaging brand-orientated user interfaces. Traditional print design of advertisements, brochures, and catalogs. Coordinated and acted as lead photographer on nation-wide photoshoots with professional athletes. Clients served include: \n \n* Specialized Bicycle Components \n* Maxxis International \n* Fox Racing \n* FTC Skateboarding \n* SFO Snowboarding \n* Ricor Racing Shocks Contractor McAfee (formerly Network Associates) 1999  –  2001  (2 years) Joined the web design team to consolidate eight separate websites into a single, cohesive online identity for Network Associates. Template design, html/css development, etc. Designed front-page graphics for daily virus alerts under tight deadlines. Also spearheaded Search Engine Optimization efforts with top 10 results for targeted key words in major browsers. Contractor McAfee (formerly Network Associates) 1999  –  2001  (2 years) Joined the web design team to consolidate eight separate websites into a single, cohesive online identity for Network Associates. Template design, html/css development, etc. Designed front-page graphics for daily virus alerts under tight deadlines. Also spearheaded Search Engine Optimization efforts with top 10 results for targeted key words in major browsers. Contractor Oracle 1998  –  1999  (1 year) Media 100 technician producing various video segments for the Interactive Media department at Oracle. Contractor Oracle 1998  –  1999  (1 year) Media 100 technician producing various video segments for the Interactive Media department at Oracle. Skills User Interface Design Information Architecture Usability HTML 5 User-centered Design Web Standards Web Applications Python JavaScript CSS3 Web Development Mockups Accessibility Information Design User Interface User Experience Interaction Design See 2+     See less Skills  User Interface Design Information Architecture Usability HTML 5 User-centered Design Web Standards Web Applications Python JavaScript CSS3 Web Development Mockups Accessibility Information Design User Interface User Experience Interaction Design See 2+     See less User Interface Design Information Architecture Usability HTML 5 User-centered Design Web Standards Web Applications Python JavaScript CSS3 Web Development Mockups Accessibility Information Design User Interface User Experience Interaction Design See 2+     See less User Interface Design Information Architecture Usability HTML 5 User-centered Design Web Standards Web Applications Python JavaScript CSS3 Web Development Mockups Accessibility Information Design User Interface User Experience Interaction Design See 2+     See less Education San Francisco State University B.A.,  Industrial Arts w/ emphasis in Graphic Design 2000  – 2002 Awarded valedictorian of Industrial Arts college on graduation. Maintained 4.0 G.P.A in field of study and 3.9 G.P.A overall. Foothill College General Education 1997  – 1999 Attended on a partial academic scholarship for high G.P.A. completing general education coursework for B.A. Activities and Societies:  Alpha Gamma Sigma Honor Society San Francisco State University B.A.,  Industrial Arts w/ emphasis in Graphic Design 2000  – 2002 Awarded valedictorian of Industrial Arts college on graduation. Maintained 4.0 G.P.A in field of study and 3.9 G.P.A overall. San Francisco State University B.A.,  Industrial Arts w/ emphasis in Graphic Design 2000  – 2002 Awarded valedictorian of Industrial Arts college on graduation. Maintained 4.0 G.P.A in field of study and 3.9 G.P.A overall. San Francisco State University B.A.,  Industrial Arts w/ emphasis in Graphic Design 2000  – 2002 Awarded valedictorian of Industrial Arts college on graduation. Maintained 4.0 G.P.A in field of study and 3.9 G.P.A overall. Foothill College General Education 1997  – 1999 Attended on a partial academic scholarship for high G.P.A. completing general education coursework for B.A. Activities and Societies:  Alpha Gamma Sigma Honor Society Foothill College General Education 1997  – 1999 Attended on a partial academic scholarship for high G.P.A. completing general education coursework for B.A. Activities and Societies:  Alpha Gamma Sigma Honor Society Foothill College General Education 1997  – 1999 Attended on a partial academic scholarship for high G.P.A. completing general education coursework for B.A. Activities and Societies:  Alpha Gamma Sigma Honor Society ", "Summary (314) 225-5881 • St. Louis, MO and Bay Area, CA • info@daniellefavreau.com \nView / Download Resume: http://daniellefavreau.com/resume/ \n \nACCOMPLISHMENTS \n \nOver 14 years of successful C‐Corporation management in two countries. \n \nUsability (UX and UI) consulting including: on‐boarding and eLearning course design and development; technical manuals; website and app reviews and redesigns incl. mobile apps. \n \nSeven years creating dynamic presentations, sites, and mobile apps, BI visualization tools, and new products helping Executives secure high value contracts. \n \nDesigned, developed, host, and manage four public custom CMS sites for four of the largest hospitals in St. Louis facilitating employee communications. \n \nSKILLS \n \nResults oriented art and creative direction and project management. \nEffective team management of creatives with unique capabilities and expectations. \nProven methods for effective cross department, client, executive, and employee communications. \nFull front‐end design and back‐end programming for all media: print, web, video, voice, and mobile. \nExpert level experience with all components of the Adobe Creative Cloud suite. \n \nExperienced in: \n• agile development \n• content analysis, writing, and editing \n• search engine optimization and marketing \n• interaction design and information architecture \n• mockups, wireframing, user flows, user research \n• web, mobile, responsive web design and development \n• eCommerce, and eLearning UI design, and development \n• video components, editing, enhancement, and publishing \n• social media account design, development, and management \n• CMS design, development, and custom widget creation (WordPress, Drupal, Joomla) \n• frameworks incl.: CakePHP, Smartie, CodeIgnitor, Angular.js, Node.js, Bootstrap, SASS \n• usability, user experience (UX) and user interface (UI) design and development, and user testing \n• front-end development with HTML5, CSS3, PHP, MySQL, Javascript, jQuery, and jQuery Mobile Summary (314) 225-5881 • St. Louis, MO and Bay Area, CA • info@daniellefavreau.com \nView / Download Resume: http://daniellefavreau.com/resume/ \n \nACCOMPLISHMENTS \n \nOver 14 years of successful C‐Corporation management in two countries. \n \nUsability (UX and UI) consulting including: on‐boarding and eLearning course design and development; technical manuals; website and app reviews and redesigns incl. mobile apps. \n \nSeven years creating dynamic presentations, sites, and mobile apps, BI visualization tools, and new products helping Executives secure high value contracts. \n \nDesigned, developed, host, and manage four public custom CMS sites for four of the largest hospitals in St. Louis facilitating employee communications. \n \nSKILLS \n \nResults oriented art and creative direction and project management. \nEffective team management of creatives with unique capabilities and expectations. \nProven methods for effective cross department, client, executive, and employee communications. \nFull front‐end design and back‐end programming for all media: print, web, video, voice, and mobile. \nExpert level experience with all components of the Adobe Creative Cloud suite. \n \nExperienced in: \n• agile development \n• content analysis, writing, and editing \n• search engine optimization and marketing \n• interaction design and information architecture \n• mockups, wireframing, user flows, user research \n• web, mobile, responsive web design and development \n• eCommerce, and eLearning UI design, and development \n• video components, editing, enhancement, and publishing \n• social media account design, development, and management \n• CMS design, development, and custom widget creation (WordPress, Drupal, Joomla) \n• frameworks incl.: CakePHP, Smartie, CodeIgnitor, Angular.js, Node.js, Bootstrap, SASS \n• usability, user experience (UX) and user interface (UI) design and development, and user testing \n• front-end development with HTML5, CSS3, PHP, MySQL, Javascript, jQuery, and jQuery Mobile (314) 225-5881 • St. Louis, MO and Bay Area, CA • info@daniellefavreau.com \nView / Download Resume: http://daniellefavreau.com/resume/ \n \nACCOMPLISHMENTS \n \nOver 14 years of successful C‐Corporation management in two countries. \n \nUsability (UX and UI) consulting including: on‐boarding and eLearning course design and development; technical manuals; website and app reviews and redesigns incl. mobile apps. \n \nSeven years creating dynamic presentations, sites, and mobile apps, BI visualization tools, and new products helping Executives secure high value contracts. \n \nDesigned, developed, host, and manage four public custom CMS sites for four of the largest hospitals in St. Louis facilitating employee communications. \n \nSKILLS \n \nResults oriented art and creative direction and project management. \nEffective team management of creatives with unique capabilities and expectations. \nProven methods for effective cross department, client, executive, and employee communications. \nFull front‐end design and back‐end programming for all media: print, web, video, voice, and mobile. \nExpert level experience with all components of the Adobe Creative Cloud suite. \n \nExperienced in: \n• agile development \n• content analysis, writing, and editing \n• search engine optimization and marketing \n• interaction design and information architecture \n• mockups, wireframing, user flows, user research \n• web, mobile, responsive web design and development \n• eCommerce, and eLearning UI design, and development \n• video components, editing, enhancement, and publishing \n• social media account design, development, and management \n• CMS design, development, and custom widget creation (WordPress, Drupal, Joomla) \n• frameworks incl.: CakePHP, Smartie, CodeIgnitor, Angular.js, Node.js, Bootstrap, SASS \n• usability, user experience (UX) and user interface (UI) design and development, and user testing \n• front-end development with HTML5, CSS3, PHP, MySQL, Javascript, jQuery, and jQuery Mobile (314) 225-5881 • St. Louis, MO and Bay Area, CA • info@daniellefavreau.com \nView / Download Resume: http://daniellefavreau.com/resume/ \n \nACCOMPLISHMENTS \n \nOver 14 years of successful C‐Corporation management in two countries. \n \nUsability (UX and UI) consulting including: on‐boarding and eLearning course design and development; technical manuals; website and app reviews and redesigns incl. mobile apps. \n \nSeven years creating dynamic presentations, sites, and mobile apps, BI visualization tools, and new products helping Executives secure high value contracts. \n \nDesigned, developed, host, and manage four public custom CMS sites for four of the largest hospitals in St. Louis facilitating employee communications. \n \nSKILLS \n \nResults oriented art and creative direction and project management. \nEffective team management of creatives with unique capabilities and expectations. \nProven methods for effective cross department, client, executive, and employee communications. \nFull front‐end design and back‐end programming for all media: print, web, video, voice, and mobile. \nExpert level experience with all components of the Adobe Creative Cloud suite. \n \nExperienced in: \n• agile development \n• content analysis, writing, and editing \n• search engine optimization and marketing \n• interaction design and information architecture \n• mockups, wireframing, user flows, user research \n• web, mobile, responsive web design and development \n• eCommerce, and eLearning UI design, and development \n• video components, editing, enhancement, and publishing \n• social media account design, development, and management \n• CMS design, development, and custom widget creation (WordPress, Drupal, Joomla) \n• frameworks incl.: CakePHP, Smartie, CodeIgnitor, Angular.js, Node.js, Bootstrap, SASS \n• usability, user experience (UX) and user interface (UI) design and development, and user testing \n• front-end development with HTML5, CSS3, PHP, MySQL, Javascript, jQuery, and jQuery Mobile Experience Lead UX/UI Designer/Developer Technology Partners January 2015  – Present (8 months) Greater St. Louis Area Web, print, video, voice, and mobile consulting for various clients. Principal / Designer / Developer Discretion Designs January 2000  – Present (15 years 8 months) Full C-Corporation management including all aspects from accounting and client management through federal law research and documentation. Complete multimedia services to clients from individuals to Fortune 50 corporations. Services including: branding; marketing and communications; hosting and server management; search engine optimization (SEO) and search engine marketing (SEM); custom CMS design and development as well as WordPress, Drupal, and Joomla development; content creation and editing; mobile application design and development for iOS and Android; internal and external systems management and creation; PeopleSoft, SharePoint, and Cognos UI customization; graphic design; product packaging design; business collateral; public relations management; and project management. \n \n• Extensive experience redesigning websites and web and mobile applications. • Custom graphic design including logos, icons, business collateral, presentations, and product packaging. • Hosting company management of Apache servers with the LAMP stack (Linux, Apache, MySQL, PHP). • Non-profit organization management consulting including federal grant research, fundraising and event management. • Complete branding solutions, marketing plans, business collateral, event management, presentation creation. • Business consulting including work process evaluation, employee retention plans, internal communication plans, and more. Lead UX/UI Designer/Developer Technology Partners January 2015  – Present (8 months) Greater St. Louis Area Web, print, video, voice, and mobile consulting for various clients. Lead UX/UI Designer/Developer Technology Partners January 2015  – Present (8 months) Greater St. Louis Area Web, print, video, voice, and mobile consulting for various clients. Principal / Designer / Developer Discretion Designs January 2000  – Present (15 years 8 months) Full C-Corporation management including all aspects from accounting and client management through federal law research and documentation. Complete multimedia services to clients from individuals to Fortune 50 corporations. Services including: branding; marketing and communications; hosting and server management; search engine optimization (SEO) and search engine marketing (SEM); custom CMS design and development as well as WordPress, Drupal, and Joomla development; content creation and editing; mobile application design and development for iOS and Android; internal and external systems management and creation; PeopleSoft, SharePoint, and Cognos UI customization; graphic design; product packaging design; business collateral; public relations management; and project management. \n \n• Extensive experience redesigning websites and web and mobile applications. • Custom graphic design including logos, icons, business collateral, presentations, and product packaging. • Hosting company management of Apache servers with the LAMP stack (Linux, Apache, MySQL, PHP). • Non-profit organization management consulting including federal grant research, fundraising and event management. • Complete branding solutions, marketing plans, business collateral, event management, presentation creation. • Business consulting including work process evaluation, employee retention plans, internal communication plans, and more. Principal / Designer / Developer Discretion Designs January 2000  – Present (15 years 8 months) Full C-Corporation management including all aspects from accounting and client management through federal law research and documentation. Complete multimedia services to clients from individuals to Fortune 50 corporations. Services including: branding; marketing and communications; hosting and server management; search engine optimization (SEO) and search engine marketing (SEM); custom CMS design and development as well as WordPress, Drupal, and Joomla development; content creation and editing; mobile application design and development for iOS and Android; internal and external systems management and creation; PeopleSoft, SharePoint, and Cognos UI customization; graphic design; product packaging design; business collateral; public relations management; and project management. \n \n• Extensive experience redesigning websites and web and mobile applications. • Custom graphic design including logos, icons, business collateral, presentations, and product packaging. • Hosting company management of Apache servers with the LAMP stack (Linux, Apache, MySQL, PHP). • Non-profit organization management consulting including federal grant research, fundraising and event management. • Complete branding solutions, marketing plans, business collateral, event management, presentation creation. • Business consulting including work process evaluation, employee retention plans, internal communication plans, and more. Languages English Native or bilingual proficiency French (Canadian) Native or bilingual proficiency German Native or bilingual proficiency English Native or bilingual proficiency French (Canadian) Native or bilingual proficiency German Native or bilingual proficiency English Native or bilingual proficiency French (Canadian) Native or bilingual proficiency German Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Skills     Education Massachusetts Institute of Technology Media Arts and Science Bachelor’s Degree Course Study 2011  – 2015 Massachusetts Institute of Technology Media Arts and Science Bachelor’s Degree Course Study 2011  – 2015 Massachusetts Institute of Technology Media Arts and Science Bachelor’s Degree Course Study 2011  – 2015 Massachusetts Institute of Technology Media Arts and Science Bachelor’s Degree Course Study 2011  – 2015 Honors & Awards ", "Summary ► Are you looking for bespoke and effective UX design for your startup? \n► Are you a developer looking to partner with a well-rounded UX designer? \n \nI’m a UX/UI designer with extensive experience working with web developers and tech startups.  \nMy early career as a web designer equipped me with design and front-end coding skills which have helped me to become a well-rounded UX designer who has a deep understanding of the whole web development process. \n \nIn addition to providing UX design as a service I have also developed a collection of design products. Some of these are top-sellers on the current marketplace.  \n \nKEY STRENGTHS: \n \n► Efficient & Nimble \nI value efficiency highly and always strive for the most efficient way to do things. I’m a doer and I move fast to execute design ideas and evolve the design based on user feedback. I have the ability to cut through all the fluff and get right down to the core of the problem which makes me good at designing UX for complex and scalable web apps. \n \n► Empathetic \nI have empathy for people around me. I always try to put myself into other people’s shoes to understand their hopes, fears and desire. I’m fascinated with human psychology and believe it’s one of the most important ingredients in effective UX design. \n \n► Business-minded \nThrough making, promoting and selling my own digital products, I’ve learned that merely having a good product is not enough. I’ve been an active practitioner of digital marketing/sales and this experience added another level of roundness to my UX skills which I think sets me apart from other UX designers.  \n \n► Strong Work Ethic \nComing from a Chinese background, I’m extremely grateful that my upbringing taught me about how important it is to have a strong work ethic and it is so hard-wired into me that working hard has become my lifestyle. \n \nIf you are interested in my service please drop me an email. Let’s talk about how we can work together! \n \nFEATURED PRODUCTS: Summary ► Are you looking for bespoke and effective UX design for your startup? \n► Are you a developer looking to partner with a well-rounded UX designer? \n \nI’m a UX/UI designer with extensive experience working with web developers and tech startups.  \nMy early career as a web designer equipped me with design and front-end coding skills which have helped me to become a well-rounded UX designer who has a deep understanding of the whole web development process. \n \nIn addition to providing UX design as a service I have also developed a collection of design products. Some of these are top-sellers on the current marketplace.  \n \nKEY STRENGTHS: \n \n► Efficient & Nimble \nI value efficiency highly and always strive for the most efficient way to do things. I’m a doer and I move fast to execute design ideas and evolve the design based on user feedback. I have the ability to cut through all the fluff and get right down to the core of the problem which makes me good at designing UX for complex and scalable web apps. \n \n► Empathetic \nI have empathy for people around me. I always try to put myself into other people’s shoes to understand their hopes, fears and desire. I’m fascinated with human psychology and believe it’s one of the most important ingredients in effective UX design. \n \n► Business-minded \nThrough making, promoting and selling my own digital products, I’ve learned that merely having a good product is not enough. I’ve been an active practitioner of digital marketing/sales and this experience added another level of roundness to my UX skills which I think sets me apart from other UX designers.  \n \n► Strong Work Ethic \nComing from a Chinese background, I’m extremely grateful that my upbringing taught me about how important it is to have a strong work ethic and it is so hard-wired into me that working hard has become my lifestyle. \n \nIf you are interested in my service please drop me an email. Let’s talk about how we can work together! \n \nFEATURED PRODUCTS: ► Are you looking for bespoke and effective UX design for your startup? \n► Are you a developer looking to partner with a well-rounded UX designer? \n \nI’m a UX/UI designer with extensive experience working with web developers and tech startups.  \nMy early career as a web designer equipped me with design and front-end coding skills which have helped me to become a well-rounded UX designer who has a deep understanding of the whole web development process. \n \nIn addition to providing UX design as a service I have also developed a collection of design products. Some of these are top-sellers on the current marketplace.  \n \nKEY STRENGTHS: \n \n► Efficient & Nimble \nI value efficiency highly and always strive for the most efficient way to do things. I’m a doer and I move fast to execute design ideas and evolve the design based on user feedback. I have the ability to cut through all the fluff and get right down to the core of the problem which makes me good at designing UX for complex and scalable web apps. \n \n► Empathetic \nI have empathy for people around me. I always try to put myself into other people’s shoes to understand their hopes, fears and desire. I’m fascinated with human psychology and believe it’s one of the most important ingredients in effective UX design. \n \n► Business-minded \nThrough making, promoting and selling my own digital products, I’ve learned that merely having a good product is not enough. I’ve been an active practitioner of digital marketing/sales and this experience added another level of roundness to my UX skills which I think sets me apart from other UX designers.  \n \n► Strong Work Ethic \nComing from a Chinese background, I’m extremely grateful that my upbringing taught me about how important it is to have a strong work ethic and it is so hard-wired into me that working hard has become my lifestyle. \n \nIf you are interested in my service please drop me an email. Let’s talk about how we can work together! \n \nFEATURED PRODUCTS: ► Are you looking for bespoke and effective UX design for your startup? \n► Are you a developer looking to partner with a well-rounded UX designer? \n \nI’m a UX/UI designer with extensive experience working with web developers and tech startups.  \nMy early career as a web designer equipped me with design and front-end coding skills which have helped me to become a well-rounded UX designer who has a deep understanding of the whole web development process. \n \nIn addition to providing UX design as a service I have also developed a collection of design products. Some of these are top-sellers on the current marketplace.  \n \nKEY STRENGTHS: \n \n► Efficient & Nimble \nI value efficiency highly and always strive for the most efficient way to do things. I’m a doer and I move fast to execute design ideas and evolve the design based on user feedback. I have the ability to cut through all the fluff and get right down to the core of the problem which makes me good at designing UX for complex and scalable web apps. \n \n► Empathetic \nI have empathy for people around me. I always try to put myself into other people’s shoes to understand their hopes, fears and desire. I’m fascinated with human psychology and believe it’s one of the most important ingredients in effective UX design. \n \n► Business-minded \nThrough making, promoting and selling my own digital products, I’ve learned that merely having a good product is not enough. I’ve been an active practitioner of digital marketing/sales and this experience added another level of roundness to my UX skills which I think sets me apart from other UX designers.  \n \n► Strong Work Ethic \nComing from a Chinese background, I’m extremely grateful that my upbringing taught me about how important it is to have a strong work ethic and it is so hard-wired into me that working hard has become my lifestyle. \n \nIf you are interested in my service please drop me an email. Let’s talk about how we can work together! \n \nFEATURED PRODUCTS: Experience UX Designer (Contract) JUST EAT April 2015  – Present (5 months) Bristol, United Kingdom Director / UX Designer / UI Designer 3rd Wave Media August 2011  – Present (4 years 1 month) Bristol Provide UX/UI design and consultancy services to startups and development agencies. \n \nDevelop and market in-house digital design products for the company.  \n \nLook after the company’s social media presence.  \n \nProvide web app translations (English - Chinese). \n \nLINKS: \n \n► Company main site:  \nwww.3rdwavemedia.com \n \n► Site templates for developers and startups:  \nthemes.3rdwavemedia.com \n \n► eLearning themes for education:  \nelearning.3rdwavemedia.com UX Designer / UI Designer (Vendor) Google August 2012  –  September 2014  (2 years 2 months) Remote Worked on various Google web apps and marketing sites via Potato London Ltd. UX Consultant / Interaction Designer / UI Designer (Contract) Potato August 2012  –  September 2014  (2 years 2 months) Bristol, London Provided UX/UI consultancy services to Potato London Ltd. where I had the opportunity to work closely with talented web developers and project managers to deliver multiple Google projects and other client work. Web Designer Maplecroft August 2010  –  August 2011  (1 year 1 month) Bath, United Kingdom Designed a new UI for company’s mapping system, collaborated closely with back-end developers and project managers through wireframing, interactive prototypes, to project delivery. \n \nRedesigned external dashboard to provide better user experience. \n \nResponsible for the branding of the company's white label app into various client specific styles. Web Author Downend School February 2008  –  July 2010  (2 years 6 months) Bristol, United Kingdom Independently designed and hand-coded a new secondary school & college website from scratch. \n \nIntroduced and implemented the Moodle CMS as the Virtual Learning Platform. Designed unique Moodle theme to reflect the school identity. Sound Designer Touchmedia 2007  –  2007  (less than a year) Shanghai, China Designed and produced background sound effects and music for various interactive adverts for delivering on the Kiosks systems in city taxis. UX Designer (Contract) JUST EAT April 2015  – Present (5 months) Bristol, United Kingdom UX Designer (Contract) JUST EAT April 2015  – Present (5 months) Bristol, United Kingdom Director / UX Designer / UI Designer 3rd Wave Media August 2011  – Present (4 years 1 month) Bristol Provide UX/UI design and consultancy services to startups and development agencies. \n \nDevelop and market in-house digital design products for the company.  \n \nLook after the company’s social media presence.  \n \nProvide web app translations (English - Chinese). \n \nLINKS: \n \n► Company main site:  \nwww.3rdwavemedia.com \n \n► Site templates for developers and startups:  \nthemes.3rdwavemedia.com \n \n► eLearning themes for education:  \nelearning.3rdwavemedia.com Director / UX Designer / UI Designer 3rd Wave Media August 2011  – Present (4 years 1 month) Bristol Provide UX/UI design and consultancy services to startups and development agencies. \n \nDevelop and market in-house digital design products for the company.  \n \nLook after the company’s social media presence.  \n \nProvide web app translations (English - Chinese). \n \nLINKS: \n \n► Company main site:  \nwww.3rdwavemedia.com \n \n► Site templates for developers and startups:  \nthemes.3rdwavemedia.com \n \n► eLearning themes for education:  \nelearning.3rdwavemedia.com UX Designer / UI Designer (Vendor) Google August 2012  –  September 2014  (2 years 2 months) Remote Worked on various Google web apps and marketing sites via Potato London Ltd. UX Designer / UI Designer (Vendor) Google August 2012  –  September 2014  (2 years 2 months) Remote Worked on various Google web apps and marketing sites via Potato London Ltd. UX Consultant / Interaction Designer / UI Designer (Contract) Potato August 2012  –  September 2014  (2 years 2 months) Bristol, London Provided UX/UI consultancy services to Potato London Ltd. where I had the opportunity to work closely with talented web developers and project managers to deliver multiple Google projects and other client work. UX Consultant / Interaction Designer / UI Designer (Contract) Potato August 2012  –  September 2014  (2 years 2 months) Bristol, London Provided UX/UI consultancy services to Potato London Ltd. where I had the opportunity to work closely with talented web developers and project managers to deliver multiple Google projects and other client work. Web Designer Maplecroft August 2010  –  August 2011  (1 year 1 month) Bath, United Kingdom Designed a new UI for company’s mapping system, collaborated closely with back-end developers and project managers through wireframing, interactive prototypes, to project delivery. \n \nRedesigned external dashboard to provide better user experience. \n \nResponsible for the branding of the company's white label app into various client specific styles. Web Designer Maplecroft August 2010  –  August 2011  (1 year 1 month) Bath, United Kingdom Designed a new UI for company’s mapping system, collaborated closely with back-end developers and project managers through wireframing, interactive prototypes, to project delivery. \n \nRedesigned external dashboard to provide better user experience. \n \nResponsible for the branding of the company's white label app into various client specific styles. Web Author Downend School February 2008  –  July 2010  (2 years 6 months) Bristol, United Kingdom Independently designed and hand-coded a new secondary school & college website from scratch. \n \nIntroduced and implemented the Moodle CMS as the Virtual Learning Platform. Designed unique Moodle theme to reflect the school identity. Web Author Downend School February 2008  –  July 2010  (2 years 6 months) Bristol, United Kingdom Independently designed and hand-coded a new secondary school & college website from scratch. \n \nIntroduced and implemented the Moodle CMS as the Virtual Learning Platform. Designed unique Moodle theme to reflect the school identity. Sound Designer Touchmedia 2007  –  2007  (less than a year) Shanghai, China Designed and produced background sound effects and music for various interactive adverts for delivering on the Kiosks systems in city taxis. Sound Designer Touchmedia 2007  –  2007  (less than a year) Shanghai, China Designed and produced background sound effects and music for various interactive adverts for delivering on the Kiosks systems in city taxis. Languages English Full professional proficiency Mandarin Chinese Native or bilingual proficiency English Full professional proficiency Mandarin Chinese Native or bilingual proficiency English Full professional proficiency Mandarin Chinese Native or bilingual proficiency Full professional proficiency Native or bilingual proficiency Skills User Experience Web Design User Interface Design Web Development HTML5 CSS jQuery Front-end Web App Translation... Wireframes Git Information Architecture Web Project Management Web Standards Balsamiq OmniGraffle Wordpress Moodle Marketing Social Media Chinese culture Mandarin Multimedia Sound Design Studio Recording Video Production PHP MySQL Audio Post Production Software Training Subversion Mahara Live Recording Piano Video Editing Quick Time Virtual... See 21+     See less Skills  User Experience Web Design User Interface Design Web Development HTML5 CSS jQuery Front-end Web App Translation... Wireframes Git Information Architecture Web Project Management Web Standards Balsamiq OmniGraffle Wordpress Moodle Marketing Social Media Chinese culture Mandarin Multimedia Sound Design Studio Recording Video Production PHP MySQL Audio Post Production Software Training Subversion Mahara Live Recording Piano Video Editing Quick Time Virtual... See 21+     See less User Experience Web Design User Interface Design Web Development HTML5 CSS jQuery Front-end Web App Translation... Wireframes Git Information Architecture Web Project Management Web Standards Balsamiq OmniGraffle Wordpress Moodle Marketing Social Media Chinese culture Mandarin Multimedia Sound Design Studio Recording Video Production PHP MySQL Audio Post Production Software Training Subversion Mahara Live Recording Piano Video Editing Quick Time Virtual... See 21+     See less User Experience Web Design User Interface Design Web Development HTML5 CSS jQuery Front-end Web App Translation... Wireframes Git Information Architecture Web Project Management Web Standards Balsamiq OmniGraffle Wordpress Moodle Marketing Social Media Chinese culture Mandarin Multimedia Sound Design Studio Recording Video Production PHP MySQL Audio Post Production Software Training Subversion Mahara Live Recording Piano Video Editing Quick Time Virtual... See 21+     See less Education University of Leeds MMus,  Music Technology 2003  – 2004 Leeds Beckett University MSc,  Creative Technology 2004  – 2005 Beijing Broadcasting Institute Bachelor of Arts (BA),  Sound Design 1999  – 2003 University of Leeds MMus,  Music Technology 2003  – 2004 University of Leeds MMus,  Music Technology 2003  – 2004 University of Leeds MMus,  Music Technology 2003  – 2004 Leeds Beckett University MSc,  Creative Technology 2004  – 2005 Leeds Beckett University MSc,  Creative Technology 2004  – 2005 Leeds Beckett University MSc,  Creative Technology 2004  – 2005 Beijing Broadcasting Institute Bachelor of Arts (BA),  Sound Design 1999  – 2003 Beijing Broadcasting Institute Bachelor of Arts (BA),  Sound Design 1999  – 2003 Beijing Broadcasting Institute Bachelor of Arts (BA),  Sound Design 1999  – 2003 Honors & Awards ", "Summary UI/UX Designer and Developer with more than 2.5 years of experience in working with over 8 startups across India and USA. Design and develop best experiences for users. \nDesigned over 6 professional projects from scratch and have helped companies to improve their overall products. Worked in various industries such as Food, Productivity, Energy, Transportation, Health Care, Internet Publishing etc. Interested in Growth hacking as well. \nFamiliar with technologies and languages like Java, C++, C#, HTML5, CSS, JavaScript, Python, Bootstrap, Wordpress etc. Developed over 10 Mobile Apps and numerous websites for clients or otherwise.  \nMicrosoft Certified Professional with \"Microsoft Certified Solutions Associate\"​ and \"Microsoft Specialist: Azure Infrastructure\" certifications. Summary UI/UX Designer and Developer with more than 2.5 years of experience in working with over 8 startups across India and USA. Design and develop best experiences for users. \nDesigned over 6 professional projects from scratch and have helped companies to improve their overall products. Worked in various industries such as Food, Productivity, Energy, Transportation, Health Care, Internet Publishing etc. Interested in Growth hacking as well. \nFamiliar with technologies and languages like Java, C++, C#, HTML5, CSS, JavaScript, Python, Bootstrap, Wordpress etc. Developed over 10 Mobile Apps and numerous websites for clients or otherwise.  \nMicrosoft Certified Professional with \"Microsoft Certified Solutions Associate\"​ and \"Microsoft Specialist: Azure Infrastructure\" certifications. UI/UX Designer and Developer with more than 2.5 years of experience in working with over 8 startups across India and USA. Design and develop best experiences for users. \nDesigned over 6 professional projects from scratch and have helped companies to improve their overall products. Worked in various industries such as Food, Productivity, Energy, Transportation, Health Care, Internet Publishing etc. Interested in Growth hacking as well. \nFamiliar with technologies and languages like Java, C++, C#, HTML5, CSS, JavaScript, Python, Bootstrap, Wordpress etc. Developed over 10 Mobile Apps and numerous websites for clients or otherwise.  \nMicrosoft Certified Professional with \"Microsoft Certified Solutions Associate\"​ and \"Microsoft Specialist: Azure Infrastructure\" certifications. UI/UX Designer and Developer with more than 2.5 years of experience in working with over 8 startups across India and USA. Design and develop best experiences for users. \nDesigned over 6 professional projects from scratch and have helped companies to improve their overall products. Worked in various industries such as Food, Productivity, Energy, Transportation, Health Care, Internet Publishing etc. Interested in Growth hacking as well. \nFamiliar with technologies and languages like Java, C++, C#, HTML5, CSS, JavaScript, Python, Bootstrap, Wordpress etc. Developed over 10 Mobile Apps and numerous websites for clients or otherwise.  \nMicrosoft Certified Professional with \"Microsoft Certified Solutions Associate\"​ and \"Microsoft Specialist: Azure Infrastructure\" certifications. Experience Google Student Ambassador Google August 2014  – Present (1 year 1 month) India As a GSA I focus on Android, Cloud and Digital Marketing products of Google as a student evangelist. I develop apps for android and organize events & workshops for the same. I am also the club lead of Google Student Club of my college (Medicaps).Google Student Ambassadors are thrilled by new technology, enthusiastic about Google, and involved in their school communities. User Experience Designer Clot.co April 2015  – Present (5 months) India Design the User Interface for the website and the iOS app following best UX practices. Create wireframes and mockups based on the needs and stakeholders and communicate with Developers to efficiently implement it. UX UI Designer Algo Engines - Wind, Solar & Energy Analytics July 2015  – Present (2 months) Work on making the application dashboard cleaner, easier and more usable. Also working with JavaScript Libraries such as D3.js, C3.js. Work is centered to creating an effective interface for the big data derived from client's wind and solar farms UI UX Designer AdWyze July 2015  – Present (2 months) Work on Improving the overall user experience for the Marketing analysis, automation, and optimization platform. Create simple yet usable prototypes and mockups for the interface of the web application. Also work on email designs and other branding needs. Lead UI Designer Geospot Tech (P) Ltd June 2015  –  August 2015  (3 months) Design the Mobile app for Geospot, an Hyper Local Search App. Work on user experience, usability along with creating low fidelity and high fidelity mockups. Use material design guidelines to design the best experience for the android app. UI Designer and Developer Documendz April 2015  –  August 2015  (5 months) India Develop beautiful interfaces for the website. Gave a design makeover to the landing page and working upon other pages as well as the design of the web app itself. UI Designer Walkover Web Solutions Pvt. Ltd. June 2015  –  July 2015  (2 months) Indore Area, India Worked on contract as UI Designer for a Matrimonial Application. Designed the whole application and made sure that it stands out from other conventional matrimonial applications, communicated with developers to make sure that the desired designs get well converted to real app. User Experience Designer Eatlo May 2015  –  July 2015  (3 months) Work on UI/UX and Branding on a contractual basis for the Bangalore-based Online food ordering service Eatlo. IT Manager Mera Medicare February 2015  –  June 2015  (5 months) Joined as an Intern, got promoted to IT manager in 3 week due to the quality of work delivered and later transitioned into Lead UI/UX Designer. I deal in Website/Application development, UX/UI design, Graphic Creation or any IT related task that needs to be done. Designed whole Mobile Application and Website with a revamped flow and model. Played a crucial role in driving this shift to provide a leaner and better experience to users. Implemented blog and forums in website. President And Founder Codechef Medicaps Chapter: Ciphertron August 2013  –  June 2015  (1 year 11 months) Indore Area, India President and founder of official CodeChef Medicaps Chapter: Ciphertron. CodeChef is the online coding arena for students to improve their analytical and programming skills by making them compete with other students worldwide. It allows college student to from a Official CodeChef Community in their college. Me along with the potential and hardworking core committee of Medicaps Chapter organize various coding competition and promote programming as a sport in college instead of just a part of the curriculum. We provide a platform to the budding programmers and IT Professionals to portray their skills and meet other peers from worldwide. We operate the social media for promotion of the Chapter. Microsoft Student Associates (MSA) Microsoft July 2014  –  April 2015  (10 months) India Microsoft Student Associates represent their local campus as technology enthusiasts and social media/marketing evangelists. We work closely with Microsoft technologies and take leadership responsibilities such as: \nDrive student outreach and learning initiatives by hosting activities like workshops, boot camps etc. Android/Web Developer Tele Rickshaw January 2015  –  March 2015  (3 months) Indore Area, India I developed Android App and Website for a taxi calling city-level service. Joined initially as Software Development Intern but later assigned job as Developer. Windows U-Crew Student Representative Microsoft October 2013  –  June 2014  (9 months) Indore Area, India Microsoft looks for talented young minds who can lead the change with Windows 8/8.1. A Windows 8/8.1 campaigner has to introduce his folks and friends to the power of the latest Windows operating system along with improving their technology quotient too. Work closely with Microsoft Products. Marketing And Promotions AIESEC August 2012  –  December 2013  (1 year 5 months) Indore Area, India Worked for the marketing of the AIESEC indore and to increase its brand value and for all other marketing works. I co-organised recruitment of AIESEC and work for all the promotions for the same, online or offline. I have also co-organised many successful events with AIESEC Indore. Worked for Social Media branding of AIESEC and also write Blogs for AIESEC. Google Student Ambassador Google August 2014  – Present (1 year 1 month) India As a GSA I focus on Android, Cloud and Digital Marketing products of Google as a student evangelist. I develop apps for android and organize events & workshops for the same. I am also the club lead of Google Student Club of my college (Medicaps).Google Student Ambassadors are thrilled by new technology, enthusiastic about Google, and involved in their school communities. Google Student Ambassador Google August 2014  – Present (1 year 1 month) India As a GSA I focus on Android, Cloud and Digital Marketing products of Google as a student evangelist. I develop apps for android and organize events & workshops for the same. I am also the club lead of Google Student Club of my college (Medicaps).Google Student Ambassadors are thrilled by new technology, enthusiastic about Google, and involved in their school communities. User Experience Designer Clot.co April 2015  – Present (5 months) India Design the User Interface for the website and the iOS app following best UX practices. Create wireframes and mockups based on the needs and stakeholders and communicate with Developers to efficiently implement it. User Experience Designer Clot.co April 2015  – Present (5 months) India Design the User Interface for the website and the iOS app following best UX practices. Create wireframes and mockups based on the needs and stakeholders and communicate with Developers to efficiently implement it. UX UI Designer Algo Engines - Wind, Solar & Energy Analytics July 2015  – Present (2 months) Work on making the application dashboard cleaner, easier and more usable. Also working with JavaScript Libraries such as D3.js, C3.js. Work is centered to creating an effective interface for the big data derived from client's wind and solar farms UX UI Designer Algo Engines - Wind, Solar & Energy Analytics July 2015  – Present (2 months) Work on making the application dashboard cleaner, easier and more usable. Also working with JavaScript Libraries such as D3.js, C3.js. Work is centered to creating an effective interface for the big data derived from client's wind and solar farms UI UX Designer AdWyze July 2015  – Present (2 months) Work on Improving the overall user experience for the Marketing analysis, automation, and optimization platform. Create simple yet usable prototypes and mockups for the interface of the web application. Also work on email designs and other branding needs. UI UX Designer AdWyze July 2015  – Present (2 months) Work on Improving the overall user experience for the Marketing analysis, automation, and optimization platform. Create simple yet usable prototypes and mockups for the interface of the web application. Also work on email designs and other branding needs. Lead UI Designer Geospot Tech (P) Ltd June 2015  –  August 2015  (3 months) Design the Mobile app for Geospot, an Hyper Local Search App. Work on user experience, usability along with creating low fidelity and high fidelity mockups. Use material design guidelines to design the best experience for the android app. Lead UI Designer Geospot Tech (P) Ltd June 2015  –  August 2015  (3 months) Design the Mobile app for Geospot, an Hyper Local Search App. Work on user experience, usability along with creating low fidelity and high fidelity mockups. Use material design guidelines to design the best experience for the android app. UI Designer and Developer Documendz April 2015  –  August 2015  (5 months) India Develop beautiful interfaces for the website. Gave a design makeover to the landing page and working upon other pages as well as the design of the web app itself. UI Designer and Developer Documendz April 2015  –  August 2015  (5 months) India Develop beautiful interfaces for the website. Gave a design makeover to the landing page and working upon other pages as well as the design of the web app itself. UI Designer Walkover Web Solutions Pvt. Ltd. June 2015  –  July 2015  (2 months) Indore Area, India Worked on contract as UI Designer for a Matrimonial Application. Designed the whole application and made sure that it stands out from other conventional matrimonial applications, communicated with developers to make sure that the desired designs get well converted to real app. UI Designer Walkover Web Solutions Pvt. Ltd. June 2015  –  July 2015  (2 months) Indore Area, India Worked on contract as UI Designer for a Matrimonial Application. Designed the whole application and made sure that it stands out from other conventional matrimonial applications, communicated with developers to make sure that the desired designs get well converted to real app. User Experience Designer Eatlo May 2015  –  July 2015  (3 months) Work on UI/UX and Branding on a contractual basis for the Bangalore-based Online food ordering service Eatlo. User Experience Designer Eatlo May 2015  –  July 2015  (3 months) Work on UI/UX and Branding on a contractual basis for the Bangalore-based Online food ordering service Eatlo. IT Manager Mera Medicare February 2015  –  June 2015  (5 months) Joined as an Intern, got promoted to IT manager in 3 week due to the quality of work delivered and later transitioned into Lead UI/UX Designer. I deal in Website/Application development, UX/UI design, Graphic Creation or any IT related task that needs to be done. Designed whole Mobile Application and Website with a revamped flow and model. Played a crucial role in driving this shift to provide a leaner and better experience to users. Implemented blog and forums in website. IT Manager Mera Medicare February 2015  –  June 2015  (5 months) Joined as an Intern, got promoted to IT manager in 3 week due to the quality of work delivered and later transitioned into Lead UI/UX Designer. I deal in Website/Application development, UX/UI design, Graphic Creation or any IT related task that needs to be done. Designed whole Mobile Application and Website with a revamped flow and model. Played a crucial role in driving this shift to provide a leaner and better experience to users. Implemented blog and forums in website. President And Founder Codechef Medicaps Chapter: Ciphertron August 2013  –  June 2015  (1 year 11 months) Indore Area, India President and founder of official CodeChef Medicaps Chapter: Ciphertron. CodeChef is the online coding arena for students to improve their analytical and programming skills by making them compete with other students worldwide. It allows college student to from a Official CodeChef Community in their college. Me along with the potential and hardworking core committee of Medicaps Chapter organize various coding competition and promote programming as a sport in college instead of just a part of the curriculum. We provide a platform to the budding programmers and IT Professionals to portray their skills and meet other peers from worldwide. We operate the social media for promotion of the Chapter. President And Founder Codechef Medicaps Chapter: Ciphertron August 2013  –  June 2015  (1 year 11 months) Indore Area, India President and founder of official CodeChef Medicaps Chapter: Ciphertron. CodeChef is the online coding arena for students to improve their analytical and programming skills by making them compete with other students worldwide. It allows college student to from a Official CodeChef Community in their college. Me along with the potential and hardworking core committee of Medicaps Chapter organize various coding competition and promote programming as a sport in college instead of just a part of the curriculum. We provide a platform to the budding programmers and IT Professionals to portray their skills and meet other peers from worldwide. We operate the social media for promotion of the Chapter. Microsoft Student Associates (MSA) Microsoft July 2014  –  April 2015  (10 months) India Microsoft Student Associates represent their local campus as technology enthusiasts and social media/marketing evangelists. We work closely with Microsoft technologies and take leadership responsibilities such as: \nDrive student outreach and learning initiatives by hosting activities like workshops, boot camps etc. Microsoft Student Associates (MSA) Microsoft July 2014  –  April 2015  (10 months) India Microsoft Student Associates represent their local campus as technology enthusiasts and social media/marketing evangelists. We work closely with Microsoft technologies and take leadership responsibilities such as: \nDrive student outreach and learning initiatives by hosting activities like workshops, boot camps etc. Android/Web Developer Tele Rickshaw January 2015  –  March 2015  (3 months) Indore Area, India I developed Android App and Website for a taxi calling city-level service. Joined initially as Software Development Intern but later assigned job as Developer. Android/Web Developer Tele Rickshaw January 2015  –  March 2015  (3 months) Indore Area, India I developed Android App and Website for a taxi calling city-level service. Joined initially as Software Development Intern but later assigned job as Developer. Windows U-Crew Student Representative Microsoft October 2013  –  June 2014  (9 months) Indore Area, India Microsoft looks for talented young minds who can lead the change with Windows 8/8.1. A Windows 8/8.1 campaigner has to introduce his folks and friends to the power of the latest Windows operating system along with improving their technology quotient too. Work closely with Microsoft Products. Windows U-Crew Student Representative Microsoft October 2013  –  June 2014  (9 months) Indore Area, India Microsoft looks for talented young minds who can lead the change with Windows 8/8.1. A Windows 8/8.1 campaigner has to introduce his folks and friends to the power of the latest Windows operating system along with improving their technology quotient too. Work closely with Microsoft Products. Marketing And Promotions AIESEC August 2012  –  December 2013  (1 year 5 months) Indore Area, India Worked for the marketing of the AIESEC indore and to increase its brand value and for all other marketing works. I co-organised recruitment of AIESEC and work for all the promotions for the same, online or offline. I have also co-organised many successful events with AIESEC Indore. Worked for Social Media branding of AIESEC and also write Blogs for AIESEC. Marketing And Promotions AIESEC August 2012  –  December 2013  (1 year 5 months) Indore Area, India Worked for the marketing of the AIESEC indore and to increase its brand value and for all other marketing works. I co-organised recruitment of AIESEC and work for all the promotions for the same, online or offline. I have also co-organised many successful events with AIESEC Indore. Worked for Social Media branding of AIESEC and also write Blogs for AIESEC. Languages English Full professional proficiency Hindi Native or bilingual proficiency English Full professional proficiency Hindi Native or bilingual proficiency English Full professional proficiency Hindi Native or bilingual proficiency Full professional proficiency Native or bilingual proficiency Skills Leadership Java HTML JavaScript Photoshop C++ CSS Marketing Blogging Microsoft Office Public Speaking Mobile Applications Social Networking User Interface Design Illustrator Teamwork C Data Analysis Social Media Team Leadership PowerPoint Team Management See 7+     See less Skills  Leadership Java HTML JavaScript Photoshop C++ CSS Marketing Blogging Microsoft Office Public Speaking Mobile Applications Social Networking User Interface Design Illustrator Teamwork C Data Analysis Social Media Team Leadership PowerPoint Team Management See 7+     See less Leadership Java HTML JavaScript Photoshop C++ CSS Marketing Blogging Microsoft Office Public Speaking Mobile Applications Social Networking User Interface Design Illustrator Teamwork C Data Analysis Social Media Team Leadership PowerPoint Team Management See 7+     See less Leadership Java HTML JavaScript Photoshop C++ CSS Marketing Blogging Microsoft Office Public Speaking Mobile Applications Social Networking User Interface Design Illustrator Teamwork C Data Analysis Social Media Team Leadership PowerPoint Team Management See 7+     See less Education Medicaps Institute of Technology and Management,Indore Bachelor of Engineering (BEng),  Information Technology , 7.6 CGPA 2012  – 2016 President of Codechef Medicaps Chapter, Given Seminars, Conducted various activities related to Programming. Activities and Societies:  Coding Competitions ,  Seminars and other IT related events organised by us. Chameli Devi Public School, Indore Schooling,  Physics Chemistry and Maths 2004  – 2012 Debate Competitions, Played Cricket. Activities and Societies:  Football ,  Cricket ,  Debate ,  Quiz etc Medicaps Institute of Technology and Management,Indore Bachelor of Engineering (BEng),  Information Technology , 7.6 CGPA 2012  – 2016 President of Codechef Medicaps Chapter, Given Seminars, Conducted various activities related to Programming. Activities and Societies:  Coding Competitions ,  Seminars and other IT related events organised by us. Medicaps Institute of Technology and Management,Indore Bachelor of Engineering (BEng),  Information Technology , 7.6 CGPA 2012  – 2016 President of Codechef Medicaps Chapter, Given Seminars, Conducted various activities related to Programming. Activities and Societies:  Coding Competitions ,  Seminars and other IT related events organised by us. Medicaps Institute of Technology and Management,Indore Bachelor of Engineering (BEng),  Information Technology , 7.6 CGPA 2012  – 2016 President of Codechef Medicaps Chapter, Given Seminars, Conducted various activities related to Programming. Activities and Societies:  Coding Competitions ,  Seminars and other IT related events organised by us. Chameli Devi Public School, Indore Schooling,  Physics Chemistry and Maths 2004  – 2012 Debate Competitions, Played Cricket. Activities and Societies:  Football ,  Cricket ,  Debate ,  Quiz etc Chameli Devi Public School, Indore Schooling,  Physics Chemistry and Maths 2004  – 2012 Debate Competitions, Played Cricket. Activities and Societies:  Football ,  Cricket ,  Debate ,  Quiz etc Chameli Devi Public School, Indore Schooling,  Physics Chemistry and Maths 2004  – 2012 Debate Competitions, Played Cricket. Activities and Societies:  Football ,  Cricket ,  Debate ,  Quiz etc Honors & Awards ", "Summary I am a trained graphic, UI, UX, visual and interaction designer with over 10 years of agency and corporate experience. I have been primarily focused on web applications and interface design projects. I strongly believe in user experience design, it is what gives products its tactile feel and offers a physical point of engagement for users. Ideally, I would like a position working on mobile UX design; I strongly believe that this is quickly becoming the most tangible computing platform for the non-computing population. Great products can change the world, but great design will let the world use your products. \n \nDo you have a compelling problem that you're passionately solving? Tell me about it; maybe we can solve it together. \n \nSpecialties: UI design, Web design, HTML, Flash design. Design production, Creative direction, Branding, Icon design, Print design, Interaction design \n \nResume Link: https://www.box.com/shared/uh739tqsjv Summary I am a trained graphic, UI, UX, visual and interaction designer with over 10 years of agency and corporate experience. I have been primarily focused on web applications and interface design projects. I strongly believe in user experience design, it is what gives products its tactile feel and offers a physical point of engagement for users. Ideally, I would like a position working on mobile UX design; I strongly believe that this is quickly becoming the most tangible computing platform for the non-computing population. Great products can change the world, but great design will let the world use your products. \n \nDo you have a compelling problem that you're passionately solving? Tell me about it; maybe we can solve it together. \n \nSpecialties: UI design, Web design, HTML, Flash design. Design production, Creative direction, Branding, Icon design, Print design, Interaction design \n \nResume Link: https://www.box.com/shared/uh739tqsjv I am a trained graphic, UI, UX, visual and interaction designer with over 10 years of agency and corporate experience. I have been primarily focused on web applications and interface design projects. I strongly believe in user experience design, it is what gives products its tactile feel and offers a physical point of engagement for users. Ideally, I would like a position working on mobile UX design; I strongly believe that this is quickly becoming the most tangible computing platform for the non-computing population. Great products can change the world, but great design will let the world use your products. \n \nDo you have a compelling problem that you're passionately solving? Tell me about it; maybe we can solve it together. \n \nSpecialties: UI design, Web design, HTML, Flash design. Design production, Creative direction, Branding, Icon design, Print design, Interaction design \n \nResume Link: https://www.box.com/shared/uh739tqsjv I am a trained graphic, UI, UX, visual and interaction designer with over 10 years of agency and corporate experience. I have been primarily focused on web applications and interface design projects. I strongly believe in user experience design, it is what gives products its tactile feel and offers a physical point of engagement for users. Ideally, I would like a position working on mobile UX design; I strongly believe that this is quickly becoming the most tangible computing platform for the non-computing population. Great products can change the world, but great design will let the world use your products. \n \nDo you have a compelling problem that you're passionately solving? Tell me about it; maybe we can solve it together. \n \nSpecialties: UI design, Web design, HTML, Flash design. Design production, Creative direction, Branding, Icon design, Print design, Interaction design \n \nResume Link: https://www.box.com/shared/uh739tqsjv Experience Sr. UI Designer Blue Jeans Network June 2010  – Present (5 years 3 months) Mountain View, CA As a founding team member, I helped define and shape the Blue Jeans Network service. Today the Blue Jeans Network is 30% of the cloud video conferencing business. Our customers love our service; and we're only getting started. \n \n- (UX) User experience and interaction for web and mobile \n- (UI) Visual Interface design for web and mobile \n- Product customizations \n- Hackathon support \n- Marketing communications Senior UI Designer TimeBridge September 2008  –  June 2010  (1 year 10 months) San Francisco Bay Area Redesigned the existing product and redefined new interactions and features. \n \n- UX/UI for Timebridge mobile and web application \n- Corporate re-branding UX Designer Google Inc. July 2007  –  September 2008  (1 year 3 months) Mountain View, CA I joined Google when GrandCentral Communications was acquired. My first objective was to understand and start design efforts to integrate the GrandCentral service into the Google family of applications. Today you know GrandCentral as \"Google Voice\". \n \n- UX/Visual Designer for GrandCentral / Google Voice \n- UX/UI designer for Google Consumer Electronics project in Taipei Principal UX/UI Designer GrandCentral Communications February 2006  –  July 2007  (1 year 6 months) San Francisco Bay Area Principal UX/UI Designer. I helped design and define the user interface and expirence for GrandCentral. I helped launch GrandCentral within 6 months, of hire, at the Fall DEMO 2006 conference. GrandCentral was voted as one of Time Magazine's Top50 websites of 2007. As of July 2007, GrandCentral was acquired by Google, based on its superior service, innovative features, and extremely loyal user base. GrandCentral has since continued to receive praise for its interface design. \n \n- UX/UI designer \n- Marketing communications Contract UI and Graphic Designer NTT Multimedia Communications Laboratories, Inc. October 2005  –  November 2005  (2 months) Palo Alto, CA Contract graphic/UI designer for consumer facing software interface. Helped define highlevel functionality and features. Designed all application screens and icons. I also redesigned the NTTMCL corporate web site. \n \n- UX/UI designer for desktop application \n- Web design Graphic Designer Launchpad Studio September 2001  –  June 2005  (3 years 10 months) San Jose, CA Graphic designer advising and project managing web site design and development. \n \n- (UX/UI) principal web projects designer \n- Managed web site projects from a design and architecture standpoint. Adjunct Professor Ohlone Community College September 2001  –  June 2002  (10 months) Fremont, CA Adjuct professor of graphic design. I developed and taught introductory graphic design courses to college students. Jr Graphic Designer Nimbus Design June 1999  –  September 2001  (2 years 4 months) Redwood City, CA Junior graphic designer assisting senior graphic designers as well as designed and consulted on web design projects. Interface Designer FileMaker June 1998  –  September 1998  (4 months) Santa Clara, CA Contract interface designer, contracted to develop and design tool bar icons for FileMaker 5.0 database software. Also developed themed templates. Product Marketing Assistant Leapfrog Labs September 1997  –  June 1998  (10 months) I evaluated computer products for marketing and retail purposes. I also provided technical assistance. Graphic Designer Coastcom May 1996  –  September 1997  (1 year 5 months) Graphic Designer responsible for development of web site, information design and corporate newsletters. Marketing Assistant Everex Systems Inc./ F.I.C. June 1994  –  May 1996  (2 years) I provided marketing assistence to the marketing team. Designed marketing collateral, managed design contractors, and organized COMDEX tradeshows. Tech First International Computer 1991  –  1993  (2 years) Sr. UI Designer Blue Jeans Network June 2010  – Present (5 years 3 months) Mountain View, CA As a founding team member, I helped define and shape the Blue Jeans Network service. Today the Blue Jeans Network is 30% of the cloud video conferencing business. Our customers love our service; and we're only getting started. \n \n- (UX) User experience and interaction for web and mobile \n- (UI) Visual Interface design for web and mobile \n- Product customizations \n- Hackathon support \n- Marketing communications Sr. UI Designer Blue Jeans Network June 2010  – Present (5 years 3 months) Mountain View, CA As a founding team member, I helped define and shape the Blue Jeans Network service. Today the Blue Jeans Network is 30% of the cloud video conferencing business. Our customers love our service; and we're only getting started. \n \n- (UX) User experience and interaction for web and mobile \n- (UI) Visual Interface design for web and mobile \n- Product customizations \n- Hackathon support \n- Marketing communications Senior UI Designer TimeBridge September 2008  –  June 2010  (1 year 10 months) San Francisco Bay Area Redesigned the existing product and redefined new interactions and features. \n \n- UX/UI for Timebridge mobile and web application \n- Corporate re-branding Senior UI Designer TimeBridge September 2008  –  June 2010  (1 year 10 months) San Francisco Bay Area Redesigned the existing product and redefined new interactions and features. \n \n- UX/UI for Timebridge mobile and web application \n- Corporate re-branding UX Designer Google Inc. July 2007  –  September 2008  (1 year 3 months) Mountain View, CA I joined Google when GrandCentral Communications was acquired. My first objective was to understand and start design efforts to integrate the GrandCentral service into the Google family of applications. Today you know GrandCentral as \"Google Voice\". \n \n- UX/Visual Designer for GrandCentral / Google Voice \n- UX/UI designer for Google Consumer Electronics project in Taipei UX Designer Google Inc. July 2007  –  September 2008  (1 year 3 months) Mountain View, CA I joined Google when GrandCentral Communications was acquired. My first objective was to understand and start design efforts to integrate the GrandCentral service into the Google family of applications. Today you know GrandCentral as \"Google Voice\". \n \n- UX/Visual Designer for GrandCentral / Google Voice \n- UX/UI designer for Google Consumer Electronics project in Taipei Principal UX/UI Designer GrandCentral Communications February 2006  –  July 2007  (1 year 6 months) San Francisco Bay Area Principal UX/UI Designer. I helped design and define the user interface and expirence for GrandCentral. I helped launch GrandCentral within 6 months, of hire, at the Fall DEMO 2006 conference. GrandCentral was voted as one of Time Magazine's Top50 websites of 2007. As of July 2007, GrandCentral was acquired by Google, based on its superior service, innovative features, and extremely loyal user base. GrandCentral has since continued to receive praise for its interface design. \n \n- UX/UI designer \n- Marketing communications Principal UX/UI Designer GrandCentral Communications February 2006  –  July 2007  (1 year 6 months) San Francisco Bay Area Principal UX/UI Designer. I helped design and define the user interface and expirence for GrandCentral. I helped launch GrandCentral within 6 months, of hire, at the Fall DEMO 2006 conference. GrandCentral was voted as one of Time Magazine's Top50 websites of 2007. As of July 2007, GrandCentral was acquired by Google, based on its superior service, innovative features, and extremely loyal user base. GrandCentral has since continued to receive praise for its interface design. \n \n- UX/UI designer \n- Marketing communications Contract UI and Graphic Designer NTT Multimedia Communications Laboratories, Inc. October 2005  –  November 2005  (2 months) Palo Alto, CA Contract graphic/UI designer for consumer facing software interface. Helped define highlevel functionality and features. Designed all application screens and icons. I also redesigned the NTTMCL corporate web site. \n \n- UX/UI designer for desktop application \n- Web design Contract UI and Graphic Designer NTT Multimedia Communications Laboratories, Inc. October 2005  –  November 2005  (2 months) Palo Alto, CA Contract graphic/UI designer for consumer facing software interface. Helped define highlevel functionality and features. Designed all application screens and icons. I also redesigned the NTTMCL corporate web site. \n \n- UX/UI designer for desktop application \n- Web design Graphic Designer Launchpad Studio September 2001  –  June 2005  (3 years 10 months) San Jose, CA Graphic designer advising and project managing web site design and development. \n \n- (UX/UI) principal web projects designer \n- Managed web site projects from a design and architecture standpoint. Graphic Designer Launchpad Studio September 2001  –  June 2005  (3 years 10 months) San Jose, CA Graphic designer advising and project managing web site design and development. \n \n- (UX/UI) principal web projects designer \n- Managed web site projects from a design and architecture standpoint. Adjunct Professor Ohlone Community College September 2001  –  June 2002  (10 months) Fremont, CA Adjuct professor of graphic design. I developed and taught introductory graphic design courses to college students. Adjunct Professor Ohlone Community College September 2001  –  June 2002  (10 months) Fremont, CA Adjuct professor of graphic design. I developed and taught introductory graphic design courses to college students. Jr Graphic Designer Nimbus Design June 1999  –  September 2001  (2 years 4 months) Redwood City, CA Junior graphic designer assisting senior graphic designers as well as designed and consulted on web design projects. Jr Graphic Designer Nimbus Design June 1999  –  September 2001  (2 years 4 months) Redwood City, CA Junior graphic designer assisting senior graphic designers as well as designed and consulted on web design projects. Interface Designer FileMaker June 1998  –  September 1998  (4 months) Santa Clara, CA Contract interface designer, contracted to develop and design tool bar icons for FileMaker 5.0 database software. Also developed themed templates. Interface Designer FileMaker June 1998  –  September 1998  (4 months) Santa Clara, CA Contract interface designer, contracted to develop and design tool bar icons for FileMaker 5.0 database software. Also developed themed templates. Product Marketing Assistant Leapfrog Labs September 1997  –  June 1998  (10 months) I evaluated computer products for marketing and retail purposes. I also provided technical assistance. Product Marketing Assistant Leapfrog Labs September 1997  –  June 1998  (10 months) I evaluated computer products for marketing and retail purposes. I also provided technical assistance. Graphic Designer Coastcom May 1996  –  September 1997  (1 year 5 months) Graphic Designer responsible for development of web site, information design and corporate newsletters. Graphic Designer Coastcom May 1996  –  September 1997  (1 year 5 months) Graphic Designer responsible for development of web site, information design and corporate newsletters. Marketing Assistant Everex Systems Inc./ F.I.C. June 1994  –  May 1996  (2 years) I provided marketing assistence to the marketing team. Designed marketing collateral, managed design contractors, and organized COMDEX tradeshows. Marketing Assistant Everex Systems Inc./ F.I.C. June 1994  –  May 1996  (2 years) I provided marketing assistence to the marketing team. Designed marketing collateral, managed design contractors, and organized COMDEX tradeshows. Tech First International Computer 1991  –  1993  (2 years) Tech First International Computer 1991  –  1993  (2 years) Languages Cantonese Cantonese Cantonese Skills User Experience User Interface Design Interaction Design Web Design Graphic Design User Experience Design Creative Direction HTML Flash User Interface Web Applications Graphics Usability Information Design Visual Design User-centered Design CSS Information Architecture Usability Testing Experience Design Logo Design Heuristic Evaluation Contextual Inquiry Mobile Applications User Research Usability Engineering HTML 5 See 12+     See less Skills  User Experience User Interface Design Interaction Design Web Design Graphic Design User Experience Design Creative Direction HTML Flash User Interface Web Applications Graphics Usability Information Design Visual Design User-centered Design CSS Information Architecture Usability Testing Experience Design Logo Design Heuristic Evaluation Contextual Inquiry Mobile Applications User Research Usability Engineering HTML 5 See 12+     See less User Experience User Interface Design Interaction Design Web Design Graphic Design User Experience Design Creative Direction HTML Flash User Interface Web Applications Graphics Usability Information Design Visual Design User-centered Design CSS Information Architecture Usability Testing Experience Design Logo Design Heuristic Evaluation Contextual Inquiry Mobile Applications User Research Usability Engineering HTML 5 See 12+     See less User Experience User Interface Design Interaction Design Web Design Graphic Design User Experience Design Creative Direction HTML Flash User Interface Web Applications Graphics Usability Information Design Visual Design User-centered Design CSS Information Architecture Usability Testing Experience Design Logo Design Heuristic Evaluation Contextual Inquiry Mobile Applications User Research Usability Engineering HTML 5 See 12+     See less Education San Jose State University BS,  Graphic Design September 1990  – June 1999 Served two terms as design club president, organized design studio tours and arranged lecturers from design community. Activities and Societies:  NEO Graphic Design Club San Jose State University BS,  Graphic Design September 1990  – June 1999 Served two terms as design club president, organized design studio tours and arranged lecturers from design community. Activities and Societies:  NEO Graphic Design Club San Jose State University BS,  Graphic Design September 1990  – June 1999 Served two terms as design club president, organized design studio tours and arranged lecturers from design community. Activities and Societies:  NEO Graphic Design Club San Jose State University BS,  Graphic Design September 1990  – June 1999 Served two terms as design club president, organized design studio tours and arranged lecturers from design community. Activities and Societies:  NEO Graphic Design Club ", "Experience UX/UI Designer Google August 2012  – Present (3 years 1 month) Owner/Designer CRAFTE Studio October 2008  – Present (6 years 11 months) UX/UI Designer Wildfire by Google August 2012  –  April 2014  (1 year 9 months) San Francisco Bay Area Art Director Powerlifting USA Magazine October 2008  –  April 2012  (3 years 7 months) UX/UI Designer Google August 2012  – Present (3 years 1 month) UX/UI Designer Google August 2012  – Present (3 years 1 month) Owner/Designer CRAFTE Studio October 2008  – Present (6 years 11 months) Owner/Designer CRAFTE Studio October 2008  – Present (6 years 11 months) UX/UI Designer Wildfire by Google August 2012  –  April 2014  (1 year 9 months) San Francisco Bay Area UX/UI Designer Wildfire by Google August 2012  –  April 2014  (1 year 9 months) San Francisco Bay Area Art Director Powerlifting USA Magazine October 2008  –  April 2012  (3 years 7 months) Art Director Powerlifting USA Magazine October 2008  –  April 2012  (3 years 7 months) Skills Visual Design User Experience User Interface Design Illustration Graphic Design Web Design Logo Design Calligraphy Skills  Visual Design User Experience User Interface Design Illustration Graphic Design Web Design Logo Design Calligraphy Visual Design User Experience User Interface Design Illustration Graphic Design Web Design Logo Design Calligraphy Visual Design User Experience User Interface Design Illustration Graphic Design Web Design Logo Design Calligraphy Education UCLA Extension Certificate,  Design Communication Arts 2008  – 2009 Point Loma Nazarene University Bachelor of Arts (B.A.),  Family and Consumer Sciences 2003  – 2007 Activities and Societies:  Phi Upsilon Omicron UCLA Extension Certificate,  Design Communication Arts 2008  – 2009 UCLA Extension Certificate,  Design Communication Arts 2008  – 2009 UCLA Extension Certificate,  Design Communication Arts 2008  – 2009 Point Loma Nazarene University Bachelor of Arts (B.A.),  Family and Consumer Sciences 2003  – 2007 Activities and Societies:  Phi Upsilon Omicron Point Loma Nazarene University Bachelor of Arts (B.A.),  Family and Consumer Sciences 2003  – 2007 Activities and Societies:  Phi Upsilon Omicron Point Loma Nazarene University Bachelor of Arts (B.A.),  Family and Consumer Sciences 2003  – 2007 Activities and Societies:  Phi Upsilon Omicron ", "Summary I'm a 10+ year veteran to design. Starting as a web designer and programmer and moving to the more specialized areas of UX and UI design. As a practitioner of user-centered design I believe that user research and user testing are the backbone to any successful design methodology. \n \nI also think that usability, as a term, is a bit overused. To me, most micro-task usability has been pretty well figured out and patterned. You can follow certain design patterns and solutions and generally garner a great amount of usability. What I try to focus on equally are Usefulness and User Experience. Are the features engaging and useful? If they aren't, how can I compliment the functionality with purposeful design? And what is the overall experience the user has with the product? It's those 3 things: Usability, Usefulness and Experience that will make or break a product. A little luck and some good PR never hurts either. \n \nMy experience with product design includes: consumer web applications, enterprise software for data-intensive business applications and I have roots in Flash with experimental navigation and interaction patterns. \n \nI think in Photoshop shortcut keys. Work briskly in Omnigraffle. Dig guerilla usability testing. Am teaching myself Ruby on Rails. Recently certified as an Agile Product Owner. Just won an Interactive Media Award (IMA 2010). Currently probably eating something.  \n \nI'm always open to new ideas and new ventures -- shoot me a message. Specialties:Engineering Negotiations, Requirements Gathering, Contextual Inquiry, User Interviews, Mental Modeling, Heuristic Analysis, Card Sorting, Information Architecture, Whiteboarding with Product Management, Wireframing, Prototyping, Usefulness and Usability Testing, Visual Design, and Creating Specs and Style Guides. Summary I'm a 10+ year veteran to design. Starting as a web designer and programmer and moving to the more specialized areas of UX and UI design. As a practitioner of user-centered design I believe that user research and user testing are the backbone to any successful design methodology. \n \nI also think that usability, as a term, is a bit overused. To me, most micro-task usability has been pretty well figured out and patterned. You can follow certain design patterns and solutions and generally garner a great amount of usability. What I try to focus on equally are Usefulness and User Experience. Are the features engaging and useful? If they aren't, how can I compliment the functionality with purposeful design? And what is the overall experience the user has with the product? It's those 3 things: Usability, Usefulness and Experience that will make or break a product. A little luck and some good PR never hurts either. \n \nMy experience with product design includes: consumer web applications, enterprise software for data-intensive business applications and I have roots in Flash with experimental navigation and interaction patterns. \n \nI think in Photoshop shortcut keys. Work briskly in Omnigraffle. Dig guerilla usability testing. Am teaching myself Ruby on Rails. Recently certified as an Agile Product Owner. Just won an Interactive Media Award (IMA 2010). Currently probably eating something.  \n \nI'm always open to new ideas and new ventures -- shoot me a message. Specialties:Engineering Negotiations, Requirements Gathering, Contextual Inquiry, User Interviews, Mental Modeling, Heuristic Analysis, Card Sorting, Information Architecture, Whiteboarding with Product Management, Wireframing, Prototyping, Usefulness and Usability Testing, Visual Design, and Creating Specs and Style Guides. I'm a 10+ year veteran to design. Starting as a web designer and programmer and moving to the more specialized areas of UX and UI design. As a practitioner of user-centered design I believe that user research and user testing are the backbone to any successful design methodology. \n \nI also think that usability, as a term, is a bit overused. To me, most micro-task usability has been pretty well figured out and patterned. You can follow certain design patterns and solutions and generally garner a great amount of usability. What I try to focus on equally are Usefulness and User Experience. Are the features engaging and useful? If they aren't, how can I compliment the functionality with purposeful design? And what is the overall experience the user has with the product? It's those 3 things: Usability, Usefulness and Experience that will make or break a product. A little luck and some good PR never hurts either. \n \nMy experience with product design includes: consumer web applications, enterprise software for data-intensive business applications and I have roots in Flash with experimental navigation and interaction patterns. \n \nI think in Photoshop shortcut keys. Work briskly in Omnigraffle. Dig guerilla usability testing. Am teaching myself Ruby on Rails. Recently certified as an Agile Product Owner. Just won an Interactive Media Award (IMA 2010). Currently probably eating something.  \n \nI'm always open to new ideas and new ventures -- shoot me a message. Specialties:Engineering Negotiations, Requirements Gathering, Contextual Inquiry, User Interviews, Mental Modeling, Heuristic Analysis, Card Sorting, Information Architecture, Whiteboarding with Product Management, Wireframing, Prototyping, Usefulness and Usability Testing, Visual Design, and Creating Specs and Style Guides. I'm a 10+ year veteran to design. Starting as a web designer and programmer and moving to the more specialized areas of UX and UI design. As a practitioner of user-centered design I believe that user research and user testing are the backbone to any successful design methodology. \n \nI also think that usability, as a term, is a bit overused. To me, most micro-task usability has been pretty well figured out and patterned. You can follow certain design patterns and solutions and generally garner a great amount of usability. What I try to focus on equally are Usefulness and User Experience. Are the features engaging and useful? If they aren't, how can I compliment the functionality with purposeful design? And what is the overall experience the user has with the product? It's those 3 things: Usability, Usefulness and Experience that will make or break a product. A little luck and some good PR never hurts either. \n \nMy experience with product design includes: consumer web applications, enterprise software for data-intensive business applications and I have roots in Flash with experimental navigation and interaction patterns. \n \nI think in Photoshop shortcut keys. Work briskly in Omnigraffle. Dig guerilla usability testing. Am teaching myself Ruby on Rails. Recently certified as an Agile Product Owner. Just won an Interactive Media Award (IMA 2010). Currently probably eating something.  \n \nI'm always open to new ideas and new ventures -- shoot me a message. Specialties:Engineering Negotiations, Requirements Gathering, Contextual Inquiry, User Interviews, Mental Modeling, Heuristic Analysis, Card Sorting, Information Architecture, Whiteboarding with Product Management, Wireframing, Prototyping, Usefulness and Usability Testing, Visual Design, and Creating Specs and Style Guides. Experience Lead UI Designer Google March 2013  – Present (2 years 6 months) Senior Interaction Designer (contractor) Google June 2012  –  March 2013  (10 months) mountain view, ca Lead UX Designer Barnes & Noble Digital - NOOK (mobile & tablet) November 2011  –  June 2012  (8 months) Palo Alto, CA I lead the user experience for some new feature roll-outs on the current Nook Simple Touch eReader and the lcd Nook Tablet. \n \nMy goal is to create a compelling and engaging content consumption device that highlights the B&N ecosystem. \n \nMy day-to-day work is to better understand the domain of the product and it's users, take business and product requirements, and blend them with user research and testing observations, and add a sprinkle of innovation. Interaction Designer eMeter Corporation April 2009  –  May 2011  (2 years 2 months) Performing UX evaluation and usability research to develop user-centered requirements for both enterprise and consumer facing web applications. Coordinating those requirements with both Marketing and Product requirements to form a standard set. Creating component, screen, and design patterns for consistency and promote best practices. Wireframing and prototyping for usability and usefulness testing. Designing look & feel style guides as well as UX and interaction guidelines. User Interaction Designer LimeLife, Inc. June 2008  –  April 2009  (11 months) Co-managed usability testing. Took Product Requirements to whiteboarding to wireframing to final designs for a rich social media set of features including; profile, messaging, commenting, bookmarklet, blog posting, push notifications, flash games, iPhone applications, mobile games, and Facebook applications. Production Designer Gershoni Creative Agency November 2007  –  May 2008  (7 months) Created wireframes and design comps for Interaction Clients like; the BBC, Patron Tequila, The Smithsonian, and many local boutique clients. Webmaster Best Buddies International February 2004  –  November 2007  (3 years 10 months) I designed and coded a majority of this international nonprofit's web properties. Later moving to more of a template system I integrated the main organization's website and all 18 satellite state-office websites to a CMS and CRM system for better consistency and management. In this web management system I was also able to templatize the email and eNewsletter distribution and branding. Along side of this creating flash and html sites for special events and cause related marketing campaigns and ticket/donation transactions in partnership with Audi, Volvo, and Pepsi to name a few. \n \nUltimately managing a staff of 5 including a DBA, Graphic Designer, Marketing Assistant, and 2 Data Entry staff members. Lead UI Designer Google March 2013  – Present (2 years 6 months) Lead UI Designer Google March 2013  – Present (2 years 6 months) Senior Interaction Designer (contractor) Google June 2012  –  March 2013  (10 months) mountain view, ca Senior Interaction Designer (contractor) Google June 2012  –  March 2013  (10 months) mountain view, ca Lead UX Designer Barnes & Noble Digital - NOOK (mobile & tablet) November 2011  –  June 2012  (8 months) Palo Alto, CA I lead the user experience for some new feature roll-outs on the current Nook Simple Touch eReader and the lcd Nook Tablet. \n \nMy goal is to create a compelling and engaging content consumption device that highlights the B&N ecosystem. \n \nMy day-to-day work is to better understand the domain of the product and it's users, take business and product requirements, and blend them with user research and testing observations, and add a sprinkle of innovation. Lead UX Designer Barnes & Noble Digital - NOOK (mobile & tablet) November 2011  –  June 2012  (8 months) Palo Alto, CA I lead the user experience for some new feature roll-outs on the current Nook Simple Touch eReader and the lcd Nook Tablet. \n \nMy goal is to create a compelling and engaging content consumption device that highlights the B&N ecosystem. \n \nMy day-to-day work is to better understand the domain of the product and it's users, take business and product requirements, and blend them with user research and testing observations, and add a sprinkle of innovation. Interaction Designer eMeter Corporation April 2009  –  May 2011  (2 years 2 months) Performing UX evaluation and usability research to develop user-centered requirements for both enterprise and consumer facing web applications. Coordinating those requirements with both Marketing and Product requirements to form a standard set. Creating component, screen, and design patterns for consistency and promote best practices. Wireframing and prototyping for usability and usefulness testing. Designing look & feel style guides as well as UX and interaction guidelines. Interaction Designer eMeter Corporation April 2009  –  May 2011  (2 years 2 months) Performing UX evaluation and usability research to develop user-centered requirements for both enterprise and consumer facing web applications. Coordinating those requirements with both Marketing and Product requirements to form a standard set. Creating component, screen, and design patterns for consistency and promote best practices. Wireframing and prototyping for usability and usefulness testing. Designing look & feel style guides as well as UX and interaction guidelines. User Interaction Designer LimeLife, Inc. June 2008  –  April 2009  (11 months) Co-managed usability testing. Took Product Requirements to whiteboarding to wireframing to final designs for a rich social media set of features including; profile, messaging, commenting, bookmarklet, blog posting, push notifications, flash games, iPhone applications, mobile games, and Facebook applications. User Interaction Designer LimeLife, Inc. June 2008  –  April 2009  (11 months) Co-managed usability testing. Took Product Requirements to whiteboarding to wireframing to final designs for a rich social media set of features including; profile, messaging, commenting, bookmarklet, blog posting, push notifications, flash games, iPhone applications, mobile games, and Facebook applications. Production Designer Gershoni Creative Agency November 2007  –  May 2008  (7 months) Created wireframes and design comps for Interaction Clients like; the BBC, Patron Tequila, The Smithsonian, and many local boutique clients. Production Designer Gershoni Creative Agency November 2007  –  May 2008  (7 months) Created wireframes and design comps for Interaction Clients like; the BBC, Patron Tequila, The Smithsonian, and many local boutique clients. Webmaster Best Buddies International February 2004  –  November 2007  (3 years 10 months) I designed and coded a majority of this international nonprofit's web properties. Later moving to more of a template system I integrated the main organization's website and all 18 satellite state-office websites to a CMS and CRM system for better consistency and management. In this web management system I was also able to templatize the email and eNewsletter distribution and branding. Along side of this creating flash and html sites for special events and cause related marketing campaigns and ticket/donation transactions in partnership with Audi, Volvo, and Pepsi to name a few. \n \nUltimately managing a staff of 5 including a DBA, Graphic Designer, Marketing Assistant, and 2 Data Entry staff members. Webmaster Best Buddies International February 2004  –  November 2007  (3 years 10 months) I designed and coded a majority of this international nonprofit's web properties. Later moving to more of a template system I integrated the main organization's website and all 18 satellite state-office websites to a CMS and CRM system for better consistency and management. In this web management system I was also able to templatize the email and eNewsletter distribution and branding. Along side of this creating flash and html sites for special events and cause related marketing campaigns and ticket/donation transactions in partnership with Audi, Volvo, and Pepsi to name a few. \n \nUltimately managing a staff of 5 including a DBA, Graphic Designer, Marketing Assistant, and 2 Data Entry staff members. Skills User Interface Design User Experience Certified Agile Product... User Experience Design Product Design Product Management Information Architecture Usability Testing User Research User Interface User-centered Design Skills  User Interface Design User Experience Certified Agile Product... User Experience Design Product Design Product Management Information Architecture Usability Testing User Research User Interface User-centered Design User Interface Design User Experience Certified Agile Product... User Experience Design Product Design Product Management Information Architecture Usability Testing User Research User Interface User-centered Design User Interface Design User Experience Certified Agile Product... User Experience Design Product Design Product Management Information Architecture Usability Testing User Research User Interface User-centered Design Education Florida State University Florida State University Florida State University Florida State University Honors & Awards Additional Honors & Awards Interactive Media Award, 2010 \nfor Energy Engage by eMeter \nhttp://www.interactivemediaawards.com/winners/certificate.asp?param=81073&cat=1 Additional Honors & Awards Interactive Media Award, 2010 \nfor Energy Engage by eMeter \nhttp://www.interactivemediaawards.com/winners/certificate.asp?param=81073&cat=1 Additional Honors & Awards Interactive Media Award, 2010 \nfor Energy Engage by eMeter \nhttp://www.interactivemediaawards.com/winners/certificate.asp?param=81073&cat=1 Additional Honors & Awards Interactive Media Award, 2010 \nfor Energy Engage by eMeter \nhttp://www.interactivemediaawards.com/winners/certificate.asp?param=81073&cat=1 ", "Summary Designer in NYC. Summary Designer in NYC. Designer in NYC. Designer in NYC. Experience UX/UI Designer Google March 2015  – Present (6 months) Greater New York City Area Freelance UX/UI Designer for the Google Learn team Freelance Designer Self-Employed February 2015  – Present (7 months) Brooklyn, NY Designer Barrel June 2014  –  February 2015  (9 months) UX/UI Designer Viggle Inc. January 2012  –  May 2014  (2 years 5 months) New York, NY Frontend Web Developer, UX/UI Designer Cellfish Media March 2011  –  August 2011  (6 months) New York, NY Web Designer, Animator, Graphic Designer Start Your Own Rebellion May 2010  –  December 2010  (8 months) Animator, Graphic Designer Unified Field June 2009  –  August 2009  (3 months) Web Designer Strand Management Solutions, Inc. June 2008  –  August 2008  (3 months) UX/UI Designer Google March 2015  – Present (6 months) Greater New York City Area Freelance UX/UI Designer for the Google Learn team UX/UI Designer Google March 2015  – Present (6 months) Greater New York City Area Freelance UX/UI Designer for the Google Learn team Freelance Designer Self-Employed February 2015  – Present (7 months) Brooklyn, NY Freelance Designer Self-Employed February 2015  – Present (7 months) Brooklyn, NY Designer Barrel June 2014  –  February 2015  (9 months) Designer Barrel June 2014  –  February 2015  (9 months) UX/UI Designer Viggle Inc. January 2012  –  May 2014  (2 years 5 months) New York, NY UX/UI Designer Viggle Inc. January 2012  –  May 2014  (2 years 5 months) New York, NY Frontend Web Developer, UX/UI Designer Cellfish Media March 2011  –  August 2011  (6 months) New York, NY Frontend Web Developer, UX/UI Designer Cellfish Media March 2011  –  August 2011  (6 months) New York, NY Web Designer, Animator, Graphic Designer Start Your Own Rebellion May 2010  –  December 2010  (8 months) Web Designer, Animator, Graphic Designer Start Your Own Rebellion May 2010  –  December 2010  (8 months) Animator, Graphic Designer Unified Field June 2009  –  August 2009  (3 months) Animator, Graphic Designer Unified Field June 2009  –  August 2009  (3 months) Web Designer Strand Management Solutions, Inc. June 2008  –  August 2008  (3 months) Web Designer Strand Management Solutions, Inc. June 2008  –  August 2008  (3 months) Skills Adobe Creative Suite Photoshop Graphic Design Illustration Web Design Screen Printing InDesign Animation Illustrator Skills  Adobe Creative Suite Photoshop Graphic Design Illustration Web Design Screen Printing InDesign Animation Illustrator Adobe Creative Suite Photoshop Graphic Design Illustration Web Design Screen Printing InDesign Animation Illustrator Adobe Creative Suite Photoshop Graphic Design Illustration Web Design Screen Printing InDesign Animation Illustrator Education The Cooper Union for the Advancement of Science and Art Certificate in Typeface Design,  Type@Cooper 2013  – 2014 Parsons School of Design Bachelor of Fine Arts (BFA),  Illustration 2008  – 2012 The Cooper Union for the Advancement of Science and Art Certificate in Typeface Design,  Type@Cooper 2013  – 2014 The Cooper Union for the Advancement of Science and Art Certificate in Typeface Design,  Type@Cooper 2013  – 2014 The Cooper Union for the Advancement of Science and Art Certificate in Typeface Design,  Type@Cooper 2013  – 2014 Parsons School of Design Bachelor of Fine Arts (BFA),  Illustration 2008  – 2012 Parsons School of Design Bachelor of Fine Arts (BFA),  Illustration 2008  – 2012 Parsons School of Design Bachelor of Fine Arts (BFA),  Illustration 2008  – 2012 ", "Languages English Native or bilingual proficiency Spanish Elementary proficiency English Native or bilingual proficiency Spanish Elementary proficiency English Native or bilingual proficiency Spanish Elementary proficiency Native or bilingual proficiency Elementary proficiency Skills User Interface Design User Interface Creative Direction Mobile Applications Wireframes Photoshop Illustrator Flash Interaction Design User-centered Design Logo Design Graphics Mobile Devices Visual Design Adobe Fireworks Adobe InDesign Sketch Graphic Design See 3+     See less Skills  User Interface Design User Interface Creative Direction Mobile Applications Wireframes Photoshop Illustrator Flash Interaction Design User-centered Design Logo Design Graphics Mobile Devices Visual Design Adobe Fireworks Adobe InDesign Sketch Graphic Design See 3+     See less User Interface Design User Interface Creative Direction Mobile Applications Wireframes Photoshop Illustrator Flash Interaction Design User-centered Design Logo Design Graphics Mobile Devices Visual Design Adobe Fireworks Adobe InDesign Sketch Graphic Design See 3+     See less User Interface Design User Interface Creative Direction Mobile Applications Wireframes Photoshop Illustrator Flash Interaction Design User-centered Design Logo Design Graphics Mobile Devices Visual Design Adobe Fireworks Adobe InDesign Sketch Graphic Design See 3+     See less Honors & Awards IDEA 2013 Finalist Industrial Designers Society of America (IDSA) September 2013 Helius is a digital service that supports families who remotely care for those who are homebound due to aging or chronic illness. It features an ingestible sensor that communicates with an adhesive patch worn on the torso, which captures such data as heart rate, rest and activity levels. Information can be accessed by patients, caregivers and physicians using smartphone applications, a website, text messages and emails. IDEA 2013 Finalist Industrial Designers Society of America (IDSA) September 2013 Helius is a digital service that supports families who remotely care for those who are homebound due to aging or chronic illness. It features an ingestible sensor that communicates with an adhesive patch worn on the torso, which captures such data as heart rate, rest and activity levels. Information can be accessed by patients, caregivers and physicians using smartphone applications, a website, text messages and emails. IDEA 2013 Finalist Industrial Designers Society of America (IDSA) September 2013 Helius is a digital service that supports families who remotely care for those who are homebound due to aging or chronic illness. It features an ingestible sensor that communicates with an adhesive patch worn on the torso, which captures such data as heart rate, rest and activity levels. Information can be accessed by patients, caregivers and physicians using smartphone applications, a website, text messages and emails. IDEA 2013 Finalist Industrial Designers Society of America (IDSA) September 2013 Helius is a digital service that supports families who remotely care for those who are homebound due to aging or chronic illness. It features an ingestible sensor that communicates with an adhesive patch worn on the torso, which captures such data as heart rate, rest and activity levels. Information can be accessed by patients, caregivers and physicians using smartphone applications, a website, text messages and emails. "]}