{"position": "Site Reliability Engineer II", "company": "Google", "profiles": ["Skills Unix Python Linux Software Development System Architecture Java SQL Cloud Computing Web Development Operating Systems HTML Database Administration Disaster Risk Reduction Security Data Integrity Distributed Systems Software Engineering Scalability C++ MySQL See 5+     See less Skills  Unix Python Linux Software Development System Architecture Java SQL Cloud Computing Web Development Operating Systems HTML Database Administration Disaster Risk Reduction Security Data Integrity Distributed Systems Software Engineering Scalability C++ MySQL See 5+     See less Unix Python Linux Software Development System Architecture Java SQL Cloud Computing Web Development Operating Systems HTML Database Administration Disaster Risk Reduction Security Data Integrity Distributed Systems Software Engineering Scalability C++ MySQL See 5+     See less Unix Python Linux Software Development System Architecture Java SQL Cloud Computing Web Development Operating Systems HTML Database Administration Disaster Risk Reduction Security Data Integrity Distributed Systems Software Engineering Scalability C++ MySQL See 5+     See less ", "Summary * Planet-scale highly reliable systems: experience with running and maintaining reliability of these systems. \n* Distributed Large scale system design: designing robust and highly reliable distributed systems. Able to identify potential weak points, SPOFs and hot spots, cost-benefit/tradeoff analysis. \n* Debugging and problem solving: root-cause analysis of problem, damage control, incident response and management. \n* Production monitoring: experience with designing and maintaining monitoring systems for large scale distributed systems. Ability to design and implement robust monitoring system with low rate of noisy alerts. Summary * Planet-scale highly reliable systems: experience with running and maintaining reliability of these systems. \n* Distributed Large scale system design: designing robust and highly reliable distributed systems. Able to identify potential weak points, SPOFs and hot spots, cost-benefit/tradeoff analysis. \n* Debugging and problem solving: root-cause analysis of problem, damage control, incident response and management. \n* Production monitoring: experience with designing and maintaining monitoring systems for large scale distributed systems. Ability to design and implement robust monitoring system with low rate of noisy alerts. * Planet-scale highly reliable systems: experience with running and maintaining reliability of these systems. \n* Distributed Large scale system design: designing robust and highly reliable distributed systems. Able to identify potential weak points, SPOFs and hot spots, cost-benefit/tradeoff analysis. \n* Debugging and problem solving: root-cause analysis of problem, damage control, incident response and management. \n* Production monitoring: experience with designing and maintaining monitoring systems for large scale distributed systems. Ability to design and implement robust monitoring system with low rate of noisy alerts. * Planet-scale highly reliable systems: experience with running and maintaining reliability of these systems. \n* Distributed Large scale system design: designing robust and highly reliable distributed systems. Able to identify potential weak points, SPOFs and hot spots, cost-benefit/tradeoff analysis. \n* Debugging and problem solving: root-cause analysis of problem, damage control, incident response and management. \n* Production monitoring: experience with designing and maintaining monitoring systems for large scale distributed systems. Ability to design and implement robust monitoring system with low rate of noisy alerts. Experience Site Reliability Engineer Google September 2014  – Present (1 year) San Francisco, California Member of Abuse SRE team in San Francisco. Responsible for running, maintaining and scaling systems that are responsible for detection of malicious content and activities on Google properties. Various responsibilities include: performance and scalability testing, weak point identification, maintaining monitoring, operations automation. Site Reliability Engineer Google January 2013  –  September 2014  (1 year 9 months) Mountain View, California Keeping critical infrastructure up and running. Responsible for scalability and reliability of large-scale low-latency distributed systems. Capacity planning and performance testing, developing tools and automation for various tasks. Member of Search Ads Serving SRE team. Site Reliability Engineer Google January 2010  –  January 2013  (3 years 1 month) Dublin, Ireland Keeping critical infrastructure up and running. Responsible for scalability and reliability of large-scale low-latency distributed systems. Capacity planning and performance testing, developing tools and automation for various tasks. Worked on CRM and Data Warehouse SRE team, transferred into Search Ads Serving SRE team. Senior programmer Koukaam 2005  –  January 2010  (5 years) Design and implementation of \"IPCorder\" surveillance system running on embedded ARM and PowerPC devices. Programmer Try Iris 2004  –  2004  (less than a year) Prague Developing yet another IS for company that was selling gas. Implementing parts of the database client in C++ (UI was built with Borland C++ Builder) Site Reliability Engineer Google September 2014  – Present (1 year) San Francisco, California Member of Abuse SRE team in San Francisco. Responsible for running, maintaining and scaling systems that are responsible for detection of malicious content and activities on Google properties. Various responsibilities include: performance and scalability testing, weak point identification, maintaining monitoring, operations automation. Site Reliability Engineer Google September 2014  – Present (1 year) San Francisco, California Member of Abuse SRE team in San Francisco. Responsible for running, maintaining and scaling systems that are responsible for detection of malicious content and activities on Google properties. Various responsibilities include: performance and scalability testing, weak point identification, maintaining monitoring, operations automation. Site Reliability Engineer Google January 2013  –  September 2014  (1 year 9 months) Mountain View, California Keeping critical infrastructure up and running. Responsible for scalability and reliability of large-scale low-latency distributed systems. Capacity planning and performance testing, developing tools and automation for various tasks. Member of Search Ads Serving SRE team. Site Reliability Engineer Google January 2013  –  September 2014  (1 year 9 months) Mountain View, California Keeping critical infrastructure up and running. Responsible for scalability and reliability of large-scale low-latency distributed systems. Capacity planning and performance testing, developing tools and automation for various tasks. Member of Search Ads Serving SRE team. Site Reliability Engineer Google January 2010  –  January 2013  (3 years 1 month) Dublin, Ireland Keeping critical infrastructure up and running. Responsible for scalability and reliability of large-scale low-latency distributed systems. Capacity planning and performance testing, developing tools and automation for various tasks. Worked on CRM and Data Warehouse SRE team, transferred into Search Ads Serving SRE team. Site Reliability Engineer Google January 2010  –  January 2013  (3 years 1 month) Dublin, Ireland Keeping critical infrastructure up and running. Responsible for scalability and reliability of large-scale low-latency distributed systems. Capacity planning and performance testing, developing tools and automation for various tasks. Worked on CRM and Data Warehouse SRE team, transferred into Search Ads Serving SRE team. Senior programmer Koukaam 2005  –  January 2010  (5 years) Design and implementation of \"IPCorder\" surveillance system running on embedded ARM and PowerPC devices. Senior programmer Koukaam 2005  –  January 2010  (5 years) Design and implementation of \"IPCorder\" surveillance system running on embedded ARM and PowerPC devices. Programmer Try Iris 2004  –  2004  (less than a year) Prague Developing yet another IS for company that was selling gas. Implementing parts of the database client in C++ (UI was built with Borland C++ Builder) Programmer Try Iris 2004  –  2004  (less than a year) Prague Developing yet another IS for company that was selling gas. Implementing parts of the database client in C++ (UI was built with Borland C++ Builder) Languages Czech Native or bilingual proficiency English Full professional proficiency Swedish Elementary proficiency Spanish Elementary proficiency German Elementary proficiency Czech Native or bilingual proficiency English Full professional proficiency Swedish Elementary proficiency Spanish Elementary proficiency German Elementary proficiency Czech Native or bilingual proficiency English Full professional proficiency Swedish Elementary proficiency Spanish Elementary proficiency German Elementary proficiency Native or bilingual proficiency Full professional proficiency Elementary proficiency Elementary proficiency Elementary proficiency Skills Distributed Systems Python Scalability Bash Git C++ Linux Incident Handling Programming Perl MapReduce Computer Science Software Engineering Shell Scripting Unix Apache Hadoop Debugging Algorithms Load Testing Performance Tuning Large Scale Systems System Monitoring Scalability Testing Distributed Storage Manageability Scalable Architecture Scalable Web... See 13+     See less Skills  Distributed Systems Python Scalability Bash Git C++ Linux Incident Handling Programming Perl MapReduce Computer Science Software Engineering Shell Scripting Unix Apache Hadoop Debugging Algorithms Load Testing Performance Tuning Large Scale Systems System Monitoring Scalability Testing Distributed Storage Manageability Scalable Architecture Scalable Web... See 13+     See less Distributed Systems Python Scalability Bash Git C++ Linux Incident Handling Programming Perl MapReduce Computer Science Software Engineering Shell Scripting Unix Apache Hadoop Debugging Algorithms Load Testing Performance Tuning Large Scale Systems System Monitoring Scalability Testing Distributed Storage Manageability Scalable Architecture Scalable Web... See 13+     See less Distributed Systems Python Scalability Bash Git C++ Linux Incident Handling Programming Perl MapReduce Computer Science Software Engineering Shell Scripting Unix Apache Hadoop Debugging Algorithms Load Testing Performance Tuning Large Scale Systems System Monitoring Scalability Testing Distributed Storage Manageability Scalable Architecture Scalable Web... See 13+     See less Education Charles University in Prague Master,  Mathematical Linguistics 2003  – 2009 Computational and formal linguistics/Computer Science Gymnázium špitálská 1996  – 2002 Charles University in Prague Master,  Mathematical Linguistics 2003  – 2009 Computational and formal linguistics/Computer Science Charles University in Prague Master,  Mathematical Linguistics 2003  – 2009 Computational and formal linguistics/Computer Science Charles University in Prague Master,  Mathematical Linguistics 2003  – 2009 Computational and formal linguistics/Computer Science Gymnázium špitálská 1996  – 2002 Gymnázium špitálská 1996  – 2002 Gymnázium špitálská 1996  – 2002 ", "Summary Fault and frustration tolerance. \n \nMaking distributed systems scalable and highly available. \nAutomating work. \nMonitoring and Alerting. \n \nSpecial interests: \nNetworks and infrastructure in sub-saharan Africa Summary Fault and frustration tolerance. \n \nMaking distributed systems scalable and highly available. \nAutomating work. \nMonitoring and Alerting. \n \nSpecial interests: \nNetworks and infrastructure in sub-saharan Africa Fault and frustration tolerance. \n \nMaking distributed systems scalable and highly available. \nAutomating work. \nMonitoring and Alerting. \n \nSpecial interests: \nNetworks and infrastructure in sub-saharan Africa Fault and frustration tolerance. \n \nMaking distributed systems scalable and highly available. \nAutomating work. \nMonitoring and Alerting. \n \nSpecial interests: \nNetworks and infrastructure in sub-saharan Africa Languages French Native or bilingual proficiency English Professional working proficiency German Native or bilingual proficiency French Native or bilingual proficiency English Professional working proficiency German Native or bilingual proficiency French Native or bilingual proficiency English Professional working proficiency German Native or bilingual proficiency Native or bilingual proficiency Professional working proficiency Native or bilingual proficiency Skills Skills     ", "Summary Graduated magna cum laude from Princeton University with a BSE in Computer Science. Summary Graduated magna cum laude from Princeton University with a BSE in Computer Science. Graduated magna cum laude from Princeton University with a BSE in Computer Science. Graduated magna cum laude from Princeton University with a BSE in Computer Science. Experience Software Engineer - Site Reliability Engineer III Google December 2014  – Present (9 months) Greater New York City Area Works on ensuring reliability and scalability of Google's development infrastructure. Software Engineer - Site Reliability Engineer II Google August 2013  –  November 2014  (1 year 4 months) Greater New York City Area Works on ensuring reliability and scalability of Google's development infrastructure. Software Engineering Intern Google June 2012  –  August 2012  (3 months) Greater New York City Area Worked on security-related features on the corporate login infrastructure. Grader Princeton University September 2011  –  May 2012  (9 months) United States One of a few undergraduate students selected to grade fellow juniors and seniors in a challenging theoretical computer science course. Supervisor at Summer School in Theoretical Computer Science Princeton University June 2011  –  August 2011  (3 months) Princeton, NJ As a supervisor at the Summer School in Theoretical Computer Science at Princeton University, I assist with teaching and helping students with their material and homework assignments. In addition, I am also working with an advanced group of students on research in approximation algorithms. Crowdsourcing Team Mozilla Labs June 2010  –  October 2010  (5 months) One of 15 students selected worldwide to work on a project for Mozilla Labs to evaluate the role of crowdsourcing in idea and design generation and to implement a new program to replace the existing Design Challenges program using our findings. Research Assistant Princeton University Computer Science Department June 2010  –  August 2010  (3 months) Worked at the Computer Science department at Princeton University to analyze resource \nusage on PlanetLab and to observe the utility of hypothetical bank/barter models in resource allocation in \nPlanetLab. Software Engineer - Site Reliability Engineer III Google December 2014  – Present (9 months) Greater New York City Area Works on ensuring reliability and scalability of Google's development infrastructure. Software Engineer - Site Reliability Engineer III Google December 2014  – Present (9 months) Greater New York City Area Works on ensuring reliability and scalability of Google's development infrastructure. Software Engineer - Site Reliability Engineer II Google August 2013  –  November 2014  (1 year 4 months) Greater New York City Area Works on ensuring reliability and scalability of Google's development infrastructure. Software Engineer - Site Reliability Engineer II Google August 2013  –  November 2014  (1 year 4 months) Greater New York City Area Works on ensuring reliability and scalability of Google's development infrastructure. Software Engineering Intern Google June 2012  –  August 2012  (3 months) Greater New York City Area Worked on security-related features on the corporate login infrastructure. Software Engineering Intern Google June 2012  –  August 2012  (3 months) Greater New York City Area Worked on security-related features on the corporate login infrastructure. Grader Princeton University September 2011  –  May 2012  (9 months) United States One of a few undergraduate students selected to grade fellow juniors and seniors in a challenging theoretical computer science course. Grader Princeton University September 2011  –  May 2012  (9 months) United States One of a few undergraduate students selected to grade fellow juniors and seniors in a challenging theoretical computer science course. Supervisor at Summer School in Theoretical Computer Science Princeton University June 2011  –  August 2011  (3 months) Princeton, NJ As a supervisor at the Summer School in Theoretical Computer Science at Princeton University, I assist with teaching and helping students with their material and homework assignments. In addition, I am also working with an advanced group of students on research in approximation algorithms. Supervisor at Summer School in Theoretical Computer Science Princeton University June 2011  –  August 2011  (3 months) Princeton, NJ As a supervisor at the Summer School in Theoretical Computer Science at Princeton University, I assist with teaching and helping students with their material and homework assignments. In addition, I am also working with an advanced group of students on research in approximation algorithms. Crowdsourcing Team Mozilla Labs June 2010  –  October 2010  (5 months) One of 15 students selected worldwide to work on a project for Mozilla Labs to evaluate the role of crowdsourcing in idea and design generation and to implement a new program to replace the existing Design Challenges program using our findings. Crowdsourcing Team Mozilla Labs June 2010  –  October 2010  (5 months) One of 15 students selected worldwide to work on a project for Mozilla Labs to evaluate the role of crowdsourcing in idea and design generation and to implement a new program to replace the existing Design Challenges program using our findings. Research Assistant Princeton University Computer Science Department June 2010  –  August 2010  (3 months) Worked at the Computer Science department at Princeton University to analyze resource \nusage on PlanetLab and to observe the utility of hypothetical bank/barter models in resource allocation in \nPlanetLab. Research Assistant Princeton University Computer Science Department June 2010  –  August 2010  (3 months) Worked at the Computer Science department at Princeton University to analyze resource \nusage on PlanetLab and to observe the utility of hypothetical bank/barter models in resource allocation in \nPlanetLab. Skills Algorithm Design Programming Theoretical Computer... Python C Java Bash Linux Android Development Git Matlab Computer Science LaTeX Software Engineering C++ OCaml Algorithms Machine Learning See 3+     See less Skills  Algorithm Design Programming Theoretical Computer... Python C Java Bash Linux Android Development Git Matlab Computer Science LaTeX Software Engineering C++ OCaml Algorithms Machine Learning See 3+     See less Algorithm Design Programming Theoretical Computer... Python C Java Bash Linux Android Development Git Matlab Computer Science LaTeX Software Engineering C++ OCaml Algorithms Machine Learning See 3+     See less Algorithm Design Programming Theoretical Computer... Python C Java Bash Linux Android Development Git Matlab Computer Science LaTeX Software Engineering C++ OCaml Algorithms Machine Learning See 3+     See less Education Princeton University BSE,  Computer Science , Magna Cum Laude 2009  – 2013 Activities and Societies:  Princeton Math Club South Brunswick High School Diploma 2005  – 2009 Key Courses: \nElectronics and Robotics \nAP Computer Science AB (Java) \nAP Calculus AB/BC \nAP Physics B/C (Mechanics and E&M) \nAP Statistics \nScientific Applications of Multivariable Calculus and Linear Algebra \nClassical Mechanics and Differential Equations \nMathematical Analysis Activities and Societies:  Mu Alpha Theta (Math Honors Society) ,  National Honors Society ,  French Honors Society ,  American Red Cross ,  Math Team ,  New Jersey Science League ,  Central Jersey Math League ,  New Jersey Math League ,  US Physics Team ,  US Chemistry Team ,  Science Olympiad Princeton University BSE,  Computer Science , Magna Cum Laude 2009  – 2013 Activities and Societies:  Princeton Math Club Princeton University BSE,  Computer Science , Magna Cum Laude 2009  – 2013 Activities and Societies:  Princeton Math Club Princeton University BSE,  Computer Science , Magna Cum Laude 2009  – 2013 Activities and Societies:  Princeton Math Club South Brunswick High School Diploma 2005  – 2009 Key Courses: \nElectronics and Robotics \nAP Computer Science AB (Java) \nAP Calculus AB/BC \nAP Physics B/C (Mechanics and E&M) \nAP Statistics \nScientific Applications of Multivariable Calculus and Linear Algebra \nClassical Mechanics and Differential Equations \nMathematical Analysis Activities and Societies:  Mu Alpha Theta (Math Honors Society) ,  National Honors Society ,  French Honors Society ,  American Red Cross ,  Math Team ,  New Jersey Science League ,  Central Jersey Math League ,  New Jersey Math League ,  US Physics Team ,  US Chemistry Team ,  Science Olympiad South Brunswick High School Diploma 2005  – 2009 Key Courses: \nElectronics and Robotics \nAP Computer Science AB (Java) \nAP Calculus AB/BC \nAP Physics B/C (Mechanics and E&M) \nAP Statistics \nScientific Applications of Multivariable Calculus and Linear Algebra \nClassical Mechanics and Differential Equations \nMathematical Analysis Activities and Societies:  Mu Alpha Theta (Math Honors Society) ,  National Honors Society ,  French Honors Society ,  American Red Cross ,  Math Team ,  New Jersey Science League ,  Central Jersey Math League ,  New Jersey Math League ,  US Physics Team ,  US Chemistry Team ,  Science Olympiad South Brunswick High School Diploma 2005  – 2009 Key Courses: \nElectronics and Robotics \nAP Computer Science AB (Java) \nAP Calculus AB/BC \nAP Physics B/C (Mechanics and E&M) \nAP Statistics \nScientific Applications of Multivariable Calculus and Linear Algebra \nClassical Mechanics and Differential Equations \nMathematical Analysis Activities and Societies:  Mu Alpha Theta (Math Honors Society) ,  National Honors Society ,  French Honors Society ,  American Red Cross ,  Math Team ,  New Jersey Science League ,  Central Jersey Math League ,  New Jersey Math League ,  US Physics Team ,  US Chemistry Team ,  Science Olympiad ", "Experience Social Storage Site Reliability Engineer Google June 2014  – Present (1 year 3 months) Cambridge, MA Social Storage Site Reliability Engineer Google June 2014  – Present (1 year 3 months) Cambridge, MA Social Storage Site Reliability Engineer Google June 2014  – Present (1 year 3 months) Cambridge, MA Skills Java Shell Scripting Python C++ Skills  Java Shell Scripting Python C++ Java Shell Scripting Python C++ Java Shell Scripting Python C++ ", "Experience Senior Site Reliability Engineer Google October 2014  – Present (11 months) London, United Kingdom Site Reliability Engineer Google March 2010  –  September 2014  (4 years 7 months) Linux System Administrator Intern Google June 2009  –  September 2009  (4 months) Internship as a Linux System Administrator in Dublin (IE) Linux System Administrator Intern Google April 2008  –  July 2008  (4 months) Internship as a Linux System Administrator in Dublin (IE) Freelance system administrator, IT consultant Me, myself and I January 2006  –  December 2007  (2 years) - Unix based solutions \n- Various network services (mail, web, workgroup) \n- Network security \n- Teaching activities System Administrator Renomo 2003  –  2005  (2 years) - Unix based networking solutions Senior Site Reliability Engineer Google October 2014  – Present (11 months) London, United Kingdom Senior Site Reliability Engineer Google October 2014  – Present (11 months) London, United Kingdom Site Reliability Engineer Google March 2010  –  September 2014  (4 years 7 months) Site Reliability Engineer Google March 2010  –  September 2014  (4 years 7 months) Linux System Administrator Intern Google June 2009  –  September 2009  (4 months) Internship as a Linux System Administrator in Dublin (IE) Linux System Administrator Intern Google June 2009  –  September 2009  (4 months) Internship as a Linux System Administrator in Dublin (IE) Linux System Administrator Intern Google April 2008  –  July 2008  (4 months) Internship as a Linux System Administrator in Dublin (IE) Linux System Administrator Intern Google April 2008  –  July 2008  (4 months) Internship as a Linux System Administrator in Dublin (IE) Freelance system administrator, IT consultant Me, myself and I January 2006  –  December 2007  (2 years) - Unix based solutions \n- Various network services (mail, web, workgroup) \n- Network security \n- Teaching activities Freelance system administrator, IT consultant Me, myself and I January 2006  –  December 2007  (2 years) - Unix based solutions \n- Various network services (mail, web, workgroup) \n- Network security \n- Teaching activities System Administrator Renomo 2003  –  2005  (2 years) - Unix based networking solutions System Administrator Renomo 2003  –  2005  (2 years) - Unix based networking solutions Skills Linux Unix Network Security Git Bash TCP/IP Operating Systems Python Scalability C++ Tomcat Distributed Systems Open Source Apache MySQL C Java Shell Scripting Subversion Perl See 5+     See less Skills  Linux Unix Network Security Git Bash TCP/IP Operating Systems Python Scalability C++ Tomcat Distributed Systems Open Source Apache MySQL C Java Shell Scripting Subversion Perl See 5+     See less Linux Unix Network Security Git Bash TCP/IP Operating Systems Python Scalability C++ Tomcat Distributed Systems Open Source Apache MySQL C Java Shell Scripting Subversion Perl See 5+     See less Linux Unix Network Security Git Bash TCP/IP Operating Systems Python Scalability C++ Tomcat Distributed Systems Open Source Apache MySQL C Java Shell Scripting Subversion Perl See 5+     See less Education Università di Bologna Computer Science 2004  – 2009 Activities and Societies:  Operating System Development (virtualization research) Università di Bologna Computer Science 2004  – 2009 Activities and Societies:  Operating System Development (virtualization research) Università di Bologna Computer Science 2004  – 2009 Activities and Societies:  Operating System Development (virtualization research) Università di Bologna Computer Science 2004  – 2009 Activities and Societies:  Operating System Development (virtualization research) ", "Summary I push bytes around for a living. Oftentimes, it involves C/C++, Linux, distributed systems and some other fiddly bits. You can write me if you're curious. Summary I push bytes around for a living. Oftentimes, it involves C/C++, Linux, distributed systems and some other fiddly bits. You can write me if you're curious. I push bytes around for a living. Oftentimes, it involves C/C++, Linux, distributed systems and some other fiddly bits. You can write me if you're curious. I push bytes around for a living. Oftentimes, it involves C/C++, Linux, distributed systems and some other fiddly bits. You can write me if you're curious. Honors & Awards Additional Honors & Awards 3rd place in ACM competition for best bachelor thesis in Czech Republic and Slovakia Additional Honors & Awards 3rd place in ACM competition for best bachelor thesis in Czech Republic and Slovakia Additional Honors & Awards 3rd place in ACM competition for best bachelor thesis in Czech Republic and Slovakia Additional Honors & Awards 3rd place in ACM competition for best bachelor thesis in Czech Republic and Slovakia ", "Summary Since I was a child, I had a strong vocation in technology, the same that inspires every day scientists, engineers, while exploring our Universe or just understanding how things work. \n \nSoftware engineering is my daily bread, creating scalable, reliable architectures is the foundation of my daily job, the spark that spins me up in the morning. \n \nI’ve spent the majority of my work life between being a Software Engineer for embedded or large scale systems, and a Site Reliability Engineer (SRE), running services at scale, and making them scale even more. \n \nI have a strong leadership vocation and love working in challenging environments as individual contributor of a team. Summary Since I was a child, I had a strong vocation in technology, the same that inspires every day scientists, engineers, while exploring our Universe or just understanding how things work. \n \nSoftware engineering is my daily bread, creating scalable, reliable architectures is the foundation of my daily job, the spark that spins me up in the morning. \n \nI’ve spent the majority of my work life between being a Software Engineer for embedded or large scale systems, and a Site Reliability Engineer (SRE), running services at scale, and making them scale even more. \n \nI have a strong leadership vocation and love working in challenging environments as individual contributor of a team. Since I was a child, I had a strong vocation in technology, the same that inspires every day scientists, engineers, while exploring our Universe or just understanding how things work. \n \nSoftware engineering is my daily bread, creating scalable, reliable architectures is the foundation of my daily job, the spark that spins me up in the morning. \n \nI’ve spent the majority of my work life between being a Software Engineer for embedded or large scale systems, and a Site Reliability Engineer (SRE), running services at scale, and making them scale even more. \n \nI have a strong leadership vocation and love working in challenging environments as individual contributor of a team. Since I was a child, I had a strong vocation in technology, the same that inspires every day scientists, engineers, while exploring our Universe or just understanding how things work. \n \nSoftware engineering is my daily bread, creating scalable, reliable architectures is the foundation of my daily job, the spark that spins me up in the morning. \n \nI’ve spent the majority of my work life between being a Software Engineer for embedded or large scale systems, and a Site Reliability Engineer (SRE), running services at scale, and making them scale even more. \n \nI have a strong leadership vocation and love working in challenging environments as individual contributor of a team. Experience Site Reliability Engineer Google April 2014  – Present (1 year 5 months) Dublin, Ireland I am part of the team that runs MySQL at scale at Google, in the Dublin office. Since April 2015, I became the Technical Leader of the team. Trouble Solver² Gentoo Foundation September 2009  – Present (6 years) The interweb I contribute to the Gentoo Linux project in my free time. I've been maintaining key components like Genkernel, systemd, KDE, GNOME. Founder and Master Sabayon Linux 2004  – Present (11 years) The interweb I founded Sabayon in 2004, to fulfil my selfish home server related needs while I was still a high school student. I currently lead the Sabayon Linux project in my free time. Site Reliability Engineer Intern Google September 2012  –  February 2013  (6 months) Dublin I was interning in the team that runs MySQL at scale at Google. Software Engineer / Site Reliability Engineer (SWE-SRE) Weswit Srl June 2010  –  September 2012  (2 years 4 months) Milan Area, Italy I contributed to the development of the Lightstreamer real-time server during that period. \nI also maintained the cloud infrastructure running Lightstreamer services. Software Engineer Myself April 2008  –  August 2012  (4 years 5 months) Milan Area, Italy I contributed to the realization of various SWE projects as contractor. Ranging from embedded systems to Desktop and Mobile applications. Software Engineer ITSME Srl 2009  –  2010  (1 year) Milan Area, Italy I contributed to the technical direction and development of ITSME (a \"venue\" based OS UI) in its early stages of development. Site Reliability Engineer Google April 2014  – Present (1 year 5 months) Dublin, Ireland I am part of the team that runs MySQL at scale at Google, in the Dublin office. Since April 2015, I became the Technical Leader of the team. Site Reliability Engineer Google April 2014  – Present (1 year 5 months) Dublin, Ireland I am part of the team that runs MySQL at scale at Google, in the Dublin office. Since April 2015, I became the Technical Leader of the team. Trouble Solver² Gentoo Foundation September 2009  – Present (6 years) The interweb I contribute to the Gentoo Linux project in my free time. I've been maintaining key components like Genkernel, systemd, KDE, GNOME. Trouble Solver² Gentoo Foundation September 2009  – Present (6 years) The interweb I contribute to the Gentoo Linux project in my free time. I've been maintaining key components like Genkernel, systemd, KDE, GNOME. Founder and Master Sabayon Linux 2004  – Present (11 years) The interweb I founded Sabayon in 2004, to fulfil my selfish home server related needs while I was still a high school student. I currently lead the Sabayon Linux project in my free time. Founder and Master Sabayon Linux 2004  – Present (11 years) The interweb I founded Sabayon in 2004, to fulfil my selfish home server related needs while I was still a high school student. I currently lead the Sabayon Linux project in my free time. Site Reliability Engineer Intern Google September 2012  –  February 2013  (6 months) Dublin I was interning in the team that runs MySQL at scale at Google. Site Reliability Engineer Intern Google September 2012  –  February 2013  (6 months) Dublin I was interning in the team that runs MySQL at scale at Google. Software Engineer / Site Reliability Engineer (SWE-SRE) Weswit Srl June 2010  –  September 2012  (2 years 4 months) Milan Area, Italy I contributed to the development of the Lightstreamer real-time server during that period. \nI also maintained the cloud infrastructure running Lightstreamer services. Software Engineer / Site Reliability Engineer (SWE-SRE) Weswit Srl June 2010  –  September 2012  (2 years 4 months) Milan Area, Italy I contributed to the development of the Lightstreamer real-time server during that period. \nI also maintained the cloud infrastructure running Lightstreamer services. Software Engineer Myself April 2008  –  August 2012  (4 years 5 months) Milan Area, Italy I contributed to the realization of various SWE projects as contractor. Ranging from embedded systems to Desktop and Mobile applications. Software Engineer Myself April 2008  –  August 2012  (4 years 5 months) Milan Area, Italy I contributed to the realization of various SWE projects as contractor. Ranging from embedded systems to Desktop and Mobile applications. Software Engineer ITSME Srl 2009  –  2010  (1 year) Milan Area, Italy I contributed to the technical direction and development of ITSME (a \"venue\" based OS UI) in its early stages of development. Software Engineer ITSME Srl 2009  –  2010  (1 year) Milan Area, Italy I contributed to the technical direction and development of ITSME (a \"venue\" based OS UI) in its early stages of development. Languages   Skills Linux Software Development Free Software Computer Science Java Web Applications Operating Systems Open Source C# HTML Programming CVS Scripting UML C Software Engineering Security PHP Web Services Web Development Apache Bash Python Subversion Git Android Unix Shell Scripting MySQL Shell Scripting Eclipse See 15+     See less Skills  Linux Software Development Free Software Computer Science Java Web Applications Operating Systems Open Source C# HTML Programming CVS Scripting UML C Software Engineering Security PHP Web Services Web Development Apache Bash Python Subversion Git Android Unix Shell Scripting MySQL Shell Scripting Eclipse See 15+     See less Linux Software Development Free Software Computer Science Java Web Applications Operating Systems Open Source C# HTML Programming CVS Scripting UML C Software Engineering Security PHP Web Services Web Development Apache Bash Python Subversion Git Android Unix Shell Scripting MySQL Shell Scripting Eclipse See 15+     See less Linux Software Development Free Software Computer Science Java Web Applications Operating Systems Open Source C# HTML Programming CVS Scripting UML C Software Engineering Security PHP Web Services Web Development Apache Bash Python Subversion Git Android Unix Shell Scripting MySQL Shell Scripting Eclipse See 15+     See less ", "Languages English Full professional proficiency Romanian Native or bilingual proficiency German Limited working proficiency French Elementary proficiency English Full professional proficiency Romanian Native or bilingual proficiency German Limited working proficiency French Elementary proficiency English Full professional proficiency Romanian Native or bilingual proficiency German Limited working proficiency French Elementary proficiency Full professional proficiency Native or bilingual proficiency Limited working proficiency Elementary proficiency Skills Python Scalability Apache Linux Distributed Systems Algorithms Git Bash Shell Scripting Unix Open Source TCP/IP OOP Programming Software Engineering Skills  Python Scalability Apache Linux Distributed Systems Algorithms Git Bash Shell Scripting Unix Open Source TCP/IP OOP Programming Software Engineering Python Scalability Apache Linux Distributed Systems Algorithms Git Bash Shell Scripting Unix Open Source TCP/IP OOP Programming Software Engineering Python Scalability Apache Linux Distributed Systems Algorithms Git Bash Shell Scripting Unix Open Source TCP/IP OOP Programming Software Engineering ", "Summary System Engineer / System Administrator / Tech Writer (Japanese only) Summary System Engineer / System Administrator / Tech Writer (Japanese only) System Engineer / System Administrator / Tech Writer (Japanese only) System Engineer / System Administrator / Tech Writer (Japanese only) Experience Site Reliability Engineer (System Engineer) Google May 2013  – Present (2 years 4 months) San Francisco Bay Area Keep mobile related services running. Site Reliability Engineer (System Engineer) Google Japan April 2010  –  May 2013  (3 years 2 months) Tokyo, Japan System Administrator Google Japan October 2006  –  March 2010  (3 years 6 months) Tokyo, Japan Software Engineer / System Engineer System Design and Research Institute September 1998  –  September 2006  (8 years 1 month) System Administration, Programming, Testing, and etc. Software Engineer / System Engineer Net Agent June 2000  –  December 2000  (7 months) Site Reliability Engineer (System Engineer) Google May 2013  – Present (2 years 4 months) San Francisco Bay Area Keep mobile related services running. Site Reliability Engineer (System Engineer) Google May 2013  – Present (2 years 4 months) San Francisco Bay Area Keep mobile related services running. Site Reliability Engineer (System Engineer) Google Japan April 2010  –  May 2013  (3 years 2 months) Tokyo, Japan Site Reliability Engineer (System Engineer) Google Japan April 2010  –  May 2013  (3 years 2 months) Tokyo, Japan System Administrator Google Japan October 2006  –  March 2010  (3 years 6 months) Tokyo, Japan System Administrator Google Japan October 2006  –  March 2010  (3 years 6 months) Tokyo, Japan Software Engineer / System Engineer System Design and Research Institute September 1998  –  September 2006  (8 years 1 month) System Administration, Programming, Testing, and etc. Software Engineer / System Engineer System Design and Research Institute September 1998  –  September 2006  (8 years 1 month) System Administration, Programming, Testing, and etc. Software Engineer / System Engineer Net Agent June 2000  –  December 2000  (7 months) Software Engineer / System Engineer Net Agent June 2000  –  December 2000  (7 months) Languages 日本語 Native or bilingual proficiency English Limited working proficiency 日本語 Native or bilingual proficiency English Limited working proficiency 日本語 Native or bilingual proficiency English Limited working proficiency Native or bilingual proficiency Limited working proficiency Skills Linux Ruby Python Bash Unix JavaScript C Java C++ Perl Shell & Tube Heat... System Administration Skills  Linux Ruby Python Bash Unix JavaScript C Java C++ Perl Shell & Tube Heat... System Administration Linux Ruby Python Bash Unix JavaScript C Java C++ Perl Shell & Tube Heat... System Administration Linux Ruby Python Bash Unix JavaScript C Java C++ Perl Shell & Tube Heat... System Administration Education The University of Tokyo Master of Science,  Information Science 1997  – 1998 Improvements of Low Discrepancy Sequences Tokyo Institute of Technology Bachelor,  Information Science 1993  – 1996 Activities and Societies:  baseball The University of Tokyo Master of Science,  Information Science 1997  – 1998 Improvements of Low Discrepancy Sequences The University of Tokyo Master of Science,  Information Science 1997  – 1998 Improvements of Low Discrepancy Sequences The University of Tokyo Master of Science,  Information Science 1997  – 1998 Improvements of Low Discrepancy Sequences Tokyo Institute of Technology Bachelor,  Information Science 1993  – 1996 Activities and Societies:  baseball Tokyo Institute of Technology Bachelor,  Information Science 1993  – 1996 Activities and Societies:  baseball Tokyo Institute of Technology Bachelor,  Information Science 1993  – 1996 Activities and Societies:  baseball ", "Summary Application Developer and System and Database Administration. Expertise in open source technologies, business and philosophy. Specialties:Languages: C, C++/Qt/KDE, Perl, Ruby/Rails, Python, Java (J2ME, JTAPI) \nOther: Debian, Ubuntu, Linux Summary Application Developer and System and Database Administration. Expertise in open source technologies, business and philosophy. Specialties:Languages: C, C++/Qt/KDE, Perl, Ruby/Rails, Python, Java (J2ME, JTAPI) \nOther: Debian, Ubuntu, Linux Application Developer and System and Database Administration. Expertise in open source technologies, business and philosophy. Specialties:Languages: C, C++/Qt/KDE, Perl, Ruby/Rails, Python, Java (J2ME, JTAPI) \nOther: Debian, Ubuntu, Linux Application Developer and System and Database Administration. Expertise in open source technologies, business and philosophy. Specialties:Languages: C, C++/Qt/KDE, Perl, Ruby/Rails, Python, Java (J2ME, JTAPI) \nOther: Debian, Ubuntu, Linux Experience Senior Site Reliability Engineer - Software Engineer Google June 2014  – Present (1 year 3 months) Mountain View, California Site Reliability Engineer - Software Engineer Google April 2013  –  May 2014  (1 year 2 months) Mountain View, California Site Reliability Engineer - Software Engineer Google May 2010  –  March 2013  (2 years 11 months) Dublin Software developer eBox Technologies 2008  –  March 2010  (2 years) Contributor KDE 2005  –  2009  (4 years) Software developer Option 2008  –  2008  (less than a year) Developer Warp Networks October 2004  –  2008  (4 years) Software developer in different projects, involving developing in C++/Qt, Perl/modPerl, Ruby on Rails, Java/Cisco JTAPI, ... System Administrator Universidad de Zaragoza November 2005  –  November 2007  (2 years 1 month) Developer Debian 2002  –  2006  (4 years) Senior Site Reliability Engineer - Software Engineer Google June 2014  – Present (1 year 3 months) Mountain View, California Senior Site Reliability Engineer - Software Engineer Google June 2014  – Present (1 year 3 months) Mountain View, California Site Reliability Engineer - Software Engineer Google April 2013  –  May 2014  (1 year 2 months) Mountain View, California Site Reliability Engineer - Software Engineer Google April 2013  –  May 2014  (1 year 2 months) Mountain View, California Site Reliability Engineer - Software Engineer Google May 2010  –  March 2013  (2 years 11 months) Dublin Site Reliability Engineer - Software Engineer Google May 2010  –  March 2013  (2 years 11 months) Dublin Software developer eBox Technologies 2008  –  March 2010  (2 years) Software developer eBox Technologies 2008  –  March 2010  (2 years) Contributor KDE 2005  –  2009  (4 years) Contributor KDE 2005  –  2009  (4 years) Software developer Option 2008  –  2008  (less than a year) Software developer Option 2008  –  2008  (less than a year) Developer Warp Networks October 2004  –  2008  (4 years) Software developer in different projects, involving developing in C++/Qt, Perl/modPerl, Ruby on Rails, Java/Cisco JTAPI, ... Developer Warp Networks October 2004  –  2008  (4 years) Software developer in different projects, involving developing in C++/Qt, Perl/modPerl, Ruby on Rails, Java/Cisco JTAPI, ... System Administrator Universidad de Zaragoza November 2005  –  November 2007  (2 years 1 month) System Administrator Universidad de Zaragoza November 2005  –  November 2007  (2 years 1 month) Developer Debian 2002  –  2006  (4 years) Developer Debian 2002  –  2006  (4 years) Languages Spanish Spanish Spanish Skills Python Debian Linux Perl Ubuntu C Core Java Open Source Git Subversion Apache MySQL Ruby on Rails Bash Free Software jQuery PostgreSQL Shell Scripting Ruby Innovation Unix See 6+     See less Skills  Python Debian Linux Perl Ubuntu C Core Java Open Source Git Subversion Apache MySQL Ruby on Rails Bash Free Software jQuery PostgreSQL Shell Scripting Ruby Innovation Unix See 6+     See less Python Debian Linux Perl Ubuntu C Core Java Open Source Git Subversion Apache MySQL Ruby on Rails Bash Free Software jQuery PostgreSQL Shell Scripting Ruby Innovation Unix See 6+     See less Python Debian Linux Perl Ubuntu C Core Java Open Source Git Subversion Apache MySQL Ruby on Rails Bash Free Software jQuery PostgreSQL Shell Scripting Ruby Innovation Unix See 6+     See less Education Universidad de Zaragoza Bachelor of Science (BS),  Computer Science 1998  – 2004 Universidad de Zaragoza Bachelor of Science (BS),  Computer Science 1998  – 2004 Universidad de Zaragoza Bachelor of Science (BS),  Computer Science 1998  – 2004 Universidad de Zaragoza Bachelor of Science (BS),  Computer Science 1998  – 2004 ", "Experience Site Reliability Engineer Google July 2015  – Present (2 months) Zürich Area, Switzerland Dremel Site Reliability Engineer  Junior Programmer Gameloft October 2014  – Present (11 months) Bucharest, Romania Site Reliability Engineer Intern Google July 2014  –  October 2014  (4 months) Trainee Google 2013  –  2013  (less than a year) Zurich Site Reliability Engineer Google July 2015  – Present (2 months) Zürich Area, Switzerland Dremel Site Reliability Engineer  Site Reliability Engineer Google July 2015  – Present (2 months) Zürich Area, Switzerland Dremel Site Reliability Engineer  Junior Programmer Gameloft October 2014  – Present (11 months) Bucharest, Romania Junior Programmer Gameloft October 2014  – Present (11 months) Bucharest, Romania Site Reliability Engineer Intern Google July 2014  –  October 2014  (4 months) Site Reliability Engineer Intern Google July 2014  –  October 2014  (4 months) Trainee Google 2013  –  2013  (less than a year) Zurich Trainee Google 2013  –  2013  (less than a year) Zurich Languages English Professional working proficiency Romanian Native or bilingual proficiency Japanese Elementary proficiency English Professional working proficiency Romanian Native or bilingual proficiency Japanese Elementary proficiency English Professional working proficiency Romanian Native or bilingual proficiency Japanese Elementary proficiency Professional working proficiency Native or bilingual proficiency Elementary proficiency Skills C++ Programming C Java Data Structures Algorithms English Teamwork OOP Core Java Operating Systems Multithreading Distributed Systems Communication Protocols Skills  C++ Programming C Java Data Structures Algorithms English Teamwork OOP Core Java Operating Systems Multithreading Distributed Systems Communication Protocols C++ Programming C Java Data Structures Algorithms English Teamwork OOP Core Java Operating Systems Multithreading Distributed Systems Communication Protocols C++ Programming C Java Data Structures Algorithms English Teamwork OOP Core Java Operating Systems Multithreading Distributed Systems Communication Protocols Education Universitatea „Politehnica” din București Computer Science 2011  – 2015 I learned and took exams, wtf? Activities and Societies:  ACM contest ,  \"Hard & Soft\" international contest Universitatea „Politehnica” din București Computer Science 2011  – 2015 I learned and took exams, wtf? Activities and Societies:  ACM contest ,  \"Hard & Soft\" international contest Universitatea „Politehnica” din București Computer Science 2011  – 2015 I learned and took exams, wtf? Activities and Societies:  ACM contest ,  \"Hard & Soft\" international contest Universitatea „Politehnica” din București Computer Science 2011  – 2015 I learned and took exams, wtf? Activities and Societies:  ACM contest ,  \"Hard & Soft\" international contest ", "Summary Specialties:managing large scale web services \nperformance tuning and debugging of complex systems \noptimizing compiler \nmicroprocessor architecture Summary Specialties:managing large scale web services \nperformance tuning and debugging of complex systems \noptimizing compiler \nmicroprocessor architecture Specialties:managing large scale web services \nperformance tuning and debugging of complex systems \noptimizing compiler \nmicroprocessor architecture Specialties:managing large scale web services \nperformance tuning and debugging of complex systems \noptimizing compiler \nmicroprocessor architecture Experience Software Engineer/Site Reliability Engineer Google October 2014  – Present (11 months) Identity & authentication Software Engineer/Site Reliability Engineer Google February 2009  –  October 2014  (5 years 9 months) Websearch Software Engineer Google May 2006  –  February 2009  (2 years 10 months) Compiler. Staff Engineer Sun Microsystems, Inc June 1999  –  May 2006  (7 years) optimizing code generator; assembler; fast code generator; register allocation; sotware pipelining; instruction scheduling; optimized code debugging; debuggable code optimization; instruction set architecture; gcc compatibility; SPARC; application binary interface; object code format; debug format; linking and relocation; performance analysis; runtime performance; compile time performance; Software Engineer/Site Reliability Engineer Google October 2014  – Present (11 months) Identity & authentication Software Engineer/Site Reliability Engineer Google October 2014  – Present (11 months) Identity & authentication Software Engineer/Site Reliability Engineer Google February 2009  –  October 2014  (5 years 9 months) Websearch Software Engineer/Site Reliability Engineer Google February 2009  –  October 2014  (5 years 9 months) Websearch Software Engineer Google May 2006  –  February 2009  (2 years 10 months) Compiler. Software Engineer Google May 2006  –  February 2009  (2 years 10 months) Compiler. Staff Engineer Sun Microsystems, Inc June 1999  –  May 2006  (7 years) optimizing code generator; assembler; fast code generator; register allocation; sotware pipelining; instruction scheduling; optimized code debugging; debuggable code optimization; instruction set architecture; gcc compatibility; SPARC; application binary interface; object code format; debug format; linking and relocation; performance analysis; runtime performance; compile time performance; Staff Engineer Sun Microsystems, Inc June 1999  –  May 2006  (7 years) optimizing code generator; assembler; fast code generator; register allocation; sotware pipelining; instruction scheduling; optimized code debugging; debuggable code optimization; instruction set architecture; gcc compatibility; SPARC; application binary interface; object code format; debug format; linking and relocation; performance analysis; runtime performance; compile time performance; Skills Microprocessors Compilers Performance Analysis Debugging Performance Tuning Large Scale Systems Large Scale Deployments Load Balancing Skills  Microprocessors Compilers Performance Analysis Debugging Performance Tuning Large Scale Systems Large Scale Deployments Load Balancing Microprocessors Compilers Performance Analysis Debugging Performance Tuning Large Scale Systems Large Scale Deployments Load Balancing Microprocessors Compilers Performance Analysis Debugging Performance Tuning Large Scale Systems Large Scale Deployments Load Balancing Education Seoul National University MS,  Electrical Engineering March 1997  – February 1999 Seoul National University BS,  Electrical Engineering March 1993  – February 1997 Seoul National University MS,  Electrical Engineering March 1997  – February 1999 Seoul National University MS,  Electrical Engineering March 1997  – February 1999 Seoul National University MS,  Electrical Engineering March 1997  – February 1999 Seoul National University BS,  Electrical Engineering March 1993  – February 1997 Seoul National University BS,  Electrical Engineering March 1993  – February 1997 Seoul National University BS,  Electrical Engineering March 1993  – February 1997 ", "Experience Site Reliability Engineer Google Australia February 2011  – Present (4 years 7 months) Site Reliability Engineer Google India May 2009  –  February 2011  (1 year 10 months) IT Project Manager Google India February 2008  –  May 2009  (1 year 4 months) Unix Administrator Google India October 2006  –  January 2008  (1 year 4 months) Senior Systems Engineer Convergys 2002  –  2006  (4 years) Site Reliability Engineer Google Australia February 2011  – Present (4 years 7 months) Site Reliability Engineer Google Australia February 2011  – Present (4 years 7 months) Site Reliability Engineer Google India May 2009  –  February 2011  (1 year 10 months) Site Reliability Engineer Google India May 2009  –  February 2011  (1 year 10 months) IT Project Manager Google India February 2008  –  May 2009  (1 year 4 months) IT Project Manager Google India February 2008  –  May 2009  (1 year 4 months) Unix Administrator Google India October 2006  –  January 2008  (1 year 4 months) Unix Administrator Google India October 2006  –  January 2008  (1 year 4 months) Senior Systems Engineer Convergys 2002  –  2006  (4 years) Senior Systems Engineer Convergys 2002  –  2006  (4 years) Languages English English English Skills Reliability Engineering Distributed Systems Large Scale Deployments Cloud Computing PaaS Scalability High Availability Data Center System Monitoring SaaS Software Configuration... Change Management Unix Go Java JavaScript AngularJS Python Shell Scripting Git Ubuntu Django Apache Technical Support Hadoop Linux Bash MySQL Ruby jQuery TCP/IP Perl Software Development Servers See 19+     See less Skills  Reliability Engineering Distributed Systems Large Scale Deployments Cloud Computing PaaS Scalability High Availability Data Center System Monitoring SaaS Software Configuration... Change Management Unix Go Java JavaScript AngularJS Python Shell Scripting Git Ubuntu Django Apache Technical Support Hadoop Linux Bash MySQL Ruby jQuery TCP/IP Perl Software Development Servers See 19+     See less Reliability Engineering Distributed Systems Large Scale Deployments Cloud Computing PaaS Scalability High Availability Data Center System Monitoring SaaS Software Configuration... Change Management Unix Go Java JavaScript AngularJS Python Shell Scripting Git Ubuntu Django Apache Technical Support Hadoop Linux Bash MySQL Ruby jQuery TCP/IP Perl Software Development Servers See 19+     See less Reliability Engineering Distributed Systems Large Scale Deployments Cloud Computing PaaS Scalability High Availability Data Center System Monitoring SaaS Software Configuration... Change Management Unix Go Java JavaScript AngularJS Python Shell Scripting Git Ubuntu Django Apache Technical Support Hadoop Linux Bash MySQL Ruby jQuery TCP/IP Perl Software Development Servers See 19+     See less Education Kendriya Vidyalaya aissce 1996  – 1998 Kendriya Vidyalaya aissce 1996  – 1998 Kendriya Vidyalaya aissce 1996  – 1998 Kendriya Vidyalaya aissce 1996  – 1998 ", "Summary In a career spanning 13 years, I started as a web programmer. My stint as linux,solaris system administrator honed my systems knowledge. That coupled with programming knowledge provides me the platform to design and implement solutions potentially using a varied set of technologies. \n \nMy specialities include: \n \n* Linux/Solaris systems administration. \n* Go programming language. \n* Python programming language. \n* Web frameworks like django. \n* Opensource softwares like apache, nginx, squid, mysql. \n* Loadbalancers: Citrix Netscalers. \n* System integration using open source technologies. \n* Largescale/Distributed systems like Google’s bigtable, dremel. Summary In a career spanning 13 years, I started as a web programmer. My stint as linux,solaris system administrator honed my systems knowledge. That coupled with programming knowledge provides me the platform to design and implement solutions potentially using a varied set of technologies. \n \nMy specialities include: \n \n* Linux/Solaris systems administration. \n* Go programming language. \n* Python programming language. \n* Web frameworks like django. \n* Opensource softwares like apache, nginx, squid, mysql. \n* Loadbalancers: Citrix Netscalers. \n* System integration using open source technologies. \n* Largescale/Distributed systems like Google’s bigtable, dremel. In a career spanning 13 years, I started as a web programmer. My stint as linux,solaris system administrator honed my systems knowledge. That coupled with programming knowledge provides me the platform to design and implement solutions potentially using a varied set of technologies. \n \nMy specialities include: \n \n* Linux/Solaris systems administration. \n* Go programming language. \n* Python programming language. \n* Web frameworks like django. \n* Opensource softwares like apache, nginx, squid, mysql. \n* Loadbalancers: Citrix Netscalers. \n* System integration using open source technologies. \n* Largescale/Distributed systems like Google’s bigtable, dremel. In a career spanning 13 years, I started as a web programmer. My stint as linux,solaris system administrator honed my systems knowledge. That coupled with programming knowledge provides me the platform to design and implement solutions potentially using a varied set of technologies. \n \nMy specialities include: \n \n* Linux/Solaris systems administration. \n* Go programming language. \n* Python programming language. \n* Web frameworks like django. \n* Opensource softwares like apache, nginx, squid, mysql. \n* Loadbalancers: Citrix Netscalers. \n* System integration using open source technologies. \n* Largescale/Distributed systems like Google’s bigtable, dremel. Experience Site Reliability Engineer Google August 2012  – Present (3 years 1 month) Bangalore Responsible for managing Google cloud products like Bigquery(https://developers.google.com/bigquery/), Google api serving infrastructure (0.5 million qps). \n \nDetailed Google work experience at http://goo.gl/Q8rAfu Operations Lead InMobi February 2012  –  August 2012  (7 months) Bengaluru Area, India Lead an operations team managing couple of products. Site Reliability Engineer Google January 2006  –  January 2012  (6 years 1 month) Bangalore I started as a system administrator looking after corporate infrastructure. Later I moved to the SRE role along with the others in the team. \n \nI designed, coded and maintained python/django based application to manage ssl certificates. \n \nI wrote and open sourced an apache module in c language (http://code.google.com/p/mod-dosblock/) which enables dos/ddos protection in the http layer.   \n \nI wrote a module (in c language) for privoxy which added load balancing support. \n \nI was the TL managing several infrastructural pieces, \n- the Google corporate intranet. \n- a privoxy proxy based anonymizer service. \n- a python based short url service used inside the organization. \n- a java based directory service. \n \nAs a team member I was involved in managing, \n- iGoogle service with a peak 40k qps traffic. \n- corporate proxy fleet. \n- managed hosting for internal applications. \n- a reverse proxy solution for internal applications. Systems Analyst Birlasoft Limited November 2004  –  January 2006  (1 year 3 months) Noida Area, India I worked as a solaris system administrator. I was involved in server administration for 90 plus solaris,linux servers for GE (Birlasoft's client). I was involved in service transition to India after client site visit. Systems Specialist HCL COMNET LTD June 2003  –  November 2004  (1 year 6 months) Noida, India Primary responsibilities included administration of around 100 Solaris, Linux, Netapp Servers. We had to respond to automated and manual alerts appropriately in a timely manner. We troubleshooted and resolved system related problems. All of these had to be done strictly in line with defined processes. System Adminitrator Samsung SDSI Pvt Ltd August 2002  –  May 2003  (10 months) Gurgaon, India I got hired as a system administrator at Samsun SDSI. I was responsible for migrating some of their key infrastructure from windows to Linux. I also acted as a release engineer there. My prior experience in php,mysql got noticed and I got involved in a project that required expertise in LAMP technology. I was the key member in the project playing the role of mentor for some engineers. System Admin/Integrator SolutionHut India December 1999  –  August 2002  (2 years 9 months) Delhi SoultionHut was a startup during the dotcom days providing primarily web based solutions to its customers. I started off on developing web services using php,mysql. Later I got involved into designing/implementing Linux and open source technology based complete solutions for its clients. Developing and the integrating a custom php based solution with openldap for NTPC was one of the highlights. Site Reliability Engineer Google August 2012  – Present (3 years 1 month) Bangalore Responsible for managing Google cloud products like Bigquery(https://developers.google.com/bigquery/), Google api serving infrastructure (0.5 million qps). \n \nDetailed Google work experience at http://goo.gl/Q8rAfu Site Reliability Engineer Google August 2012  – Present (3 years 1 month) Bangalore Responsible for managing Google cloud products like Bigquery(https://developers.google.com/bigquery/), Google api serving infrastructure (0.5 million qps). \n \nDetailed Google work experience at http://goo.gl/Q8rAfu Operations Lead InMobi February 2012  –  August 2012  (7 months) Bengaluru Area, India Lead an operations team managing couple of products. Operations Lead InMobi February 2012  –  August 2012  (7 months) Bengaluru Area, India Lead an operations team managing couple of products. Site Reliability Engineer Google January 2006  –  January 2012  (6 years 1 month) Bangalore I started as a system administrator looking after corporate infrastructure. Later I moved to the SRE role along with the others in the team. \n \nI designed, coded and maintained python/django based application to manage ssl certificates. \n \nI wrote and open sourced an apache module in c language (http://code.google.com/p/mod-dosblock/) which enables dos/ddos protection in the http layer.   \n \nI wrote a module (in c language) for privoxy which added load balancing support. \n \nI was the TL managing several infrastructural pieces, \n- the Google corporate intranet. \n- a privoxy proxy based anonymizer service. \n- a python based short url service used inside the organization. \n- a java based directory service. \n \nAs a team member I was involved in managing, \n- iGoogle service with a peak 40k qps traffic. \n- corporate proxy fleet. \n- managed hosting for internal applications. \n- a reverse proxy solution for internal applications. Site Reliability Engineer Google January 2006  –  January 2012  (6 years 1 month) Bangalore I started as a system administrator looking after corporate infrastructure. Later I moved to the SRE role along with the others in the team. \n \nI designed, coded and maintained python/django based application to manage ssl certificates. \n \nI wrote and open sourced an apache module in c language (http://code.google.com/p/mod-dosblock/) which enables dos/ddos protection in the http layer.   \n \nI wrote a module (in c language) for privoxy which added load balancing support. \n \nI was the TL managing several infrastructural pieces, \n- the Google corporate intranet. \n- a privoxy proxy based anonymizer service. \n- a python based short url service used inside the organization. \n- a java based directory service. \n \nAs a team member I was involved in managing, \n- iGoogle service with a peak 40k qps traffic. \n- corporate proxy fleet. \n- managed hosting for internal applications. \n- a reverse proxy solution for internal applications. Systems Analyst Birlasoft Limited November 2004  –  January 2006  (1 year 3 months) Noida Area, India I worked as a solaris system administrator. I was involved in server administration for 90 plus solaris,linux servers for GE (Birlasoft's client). I was involved in service transition to India after client site visit. Systems Analyst Birlasoft Limited November 2004  –  January 2006  (1 year 3 months) Noida Area, India I worked as a solaris system administrator. I was involved in server administration for 90 plus solaris,linux servers for GE (Birlasoft's client). I was involved in service transition to India after client site visit. Systems Specialist HCL COMNET LTD June 2003  –  November 2004  (1 year 6 months) Noida, India Primary responsibilities included administration of around 100 Solaris, Linux, Netapp Servers. We had to respond to automated and manual alerts appropriately in a timely manner. We troubleshooted and resolved system related problems. All of these had to be done strictly in line with defined processes. Systems Specialist HCL COMNET LTD June 2003  –  November 2004  (1 year 6 months) Noida, India Primary responsibilities included administration of around 100 Solaris, Linux, Netapp Servers. We had to respond to automated and manual alerts appropriately in a timely manner. We troubleshooted and resolved system related problems. All of these had to be done strictly in line with defined processes. System Adminitrator Samsung SDSI Pvt Ltd August 2002  –  May 2003  (10 months) Gurgaon, India I got hired as a system administrator at Samsun SDSI. I was responsible for migrating some of their key infrastructure from windows to Linux. I also acted as a release engineer there. My prior experience in php,mysql got noticed and I got involved in a project that required expertise in LAMP technology. I was the key member in the project playing the role of mentor for some engineers. System Adminitrator Samsung SDSI Pvt Ltd August 2002  –  May 2003  (10 months) Gurgaon, India I got hired as a system administrator at Samsun SDSI. I was responsible for migrating some of their key infrastructure from windows to Linux. I also acted as a release engineer there. My prior experience in php,mysql got noticed and I got involved in a project that required expertise in LAMP technology. I was the key member in the project playing the role of mentor for some engineers. System Admin/Integrator SolutionHut India December 1999  –  August 2002  (2 years 9 months) Delhi SoultionHut was a startup during the dotcom days providing primarily web based solutions to its customers. I started off on developing web services using php,mysql. Later I got involved into designing/implementing Linux and open source technology based complete solutions for its clients. Developing and the integrating a custom php based solution with openldap for NTPC was one of the highlights. System Admin/Integrator SolutionHut India December 1999  –  August 2002  (2 years 9 months) Delhi SoultionHut was a startup during the dotcom days providing primarily web based solutions to its customers. I started off on developing web services using php,mysql. Later I got involved into designing/implementing Linux and open source technology based complete solutions for its clients. Developing and the integrating a custom php based solution with openldap for NTPC was one of the highlights. Languages English Native or bilingual proficiency Bengali Native or bilingual proficiency Hindi Professional working proficiency English Native or bilingual proficiency Bengali Native or bilingual proficiency Hindi Professional working proficiency English Native or bilingual proficiency Bengali Native or bilingual proficiency Hindi Professional working proficiency Native or bilingual proficiency Native or bilingual proficiency Professional working proficiency Skills Linux Apache Squid Linux System... Python Distributed Systems MySQL Solaris Load Balancing Go Programming Language... Large Scale Systems Nginx Shell Scripting LAMP Django PHP See 1+     See less Skills  Linux Apache Squid Linux System... Python Distributed Systems MySQL Solaris Load Balancing Go Programming Language... Large Scale Systems Nginx Shell Scripting LAMP Django PHP See 1+     See less Linux Apache Squid Linux System... Python Distributed Systems MySQL Solaris Load Balancing Go Programming Language... Large Scale Systems Nginx Shell Scripting LAMP Django PHP See 1+     See less Linux Apache Squid Linux System... Python Distributed Systems MySQL Solaris Load Balancing Go Programming Language... Large Scale Systems Nginx Shell Scripting LAMP Django PHP See 1+     See less Education Tripura University B.Sc,  Physics Hons , Achieved a first class and stood second in the class. 1994  – 1997 Secured a first class in the course and stood second in the class Tripura University B.Sc,  Physics Hons , Achieved a first class and stood second in the class. 1994  – 1997 Secured a first class in the course and stood second in the class Tripura University B.Sc,  Physics Hons , Achieved a first class and stood second in the class. 1994  – 1997 Secured a first class in the course and stood second in the class Tripura University B.Sc,  Physics Hons , Achieved a first class and stood second in the class. 1994  – 1997 Secured a first class in the course and stood second in the class ", "Summary I'm primarily interested in challenges of scale and technical infrastructure - millions of QPS, exabytes of storage, and fleets of hundreds of thousands of machines. \n \nI've been there when things go bump in the night, I've warded off a multitude of failure modes through early design reviews, and I know how to take things apart to make them run faster and scale better. Summary I'm primarily interested in challenges of scale and technical infrastructure - millions of QPS, exabytes of storage, and fleets of hundreds of thousands of machines. \n \nI've been there when things go bump in the night, I've warded off a multitude of failure modes through early design reviews, and I know how to take things apart to make them run faster and scale better. I'm primarily interested in challenges of scale and technical infrastructure - millions of QPS, exabytes of storage, and fleets of hundreds of thousands of machines. \n \nI've been there when things go bump in the night, I've warded off a multitude of failure modes through early design reviews, and I know how to take things apart to make them run faster and scale better. I'm primarily interested in challenges of scale and technical infrastructure - millions of QPS, exabytes of storage, and fleets of hundreds of thousands of machines. \n \nI've been there when things go bump in the night, I've warded off a multitude of failure modes through early design reviews, and I know how to take things apart to make them run faster and scale better. Experience Senior Site Reliability Engineer Google May 2011  – Present (4 years 4 months) * Google eBooks (http://books.google.com/ebooks) SRE \n* Google Frontend SWE \n* Google Flights SRE \n* As of June 2015, managing Bigtable SRE in NYC! Teaching Assistant MIT 2012  –  2013  (1 year) Greater Boston Area Teaching assistant for 6.035 and 6.172; lab assistant for 6.042 Site Reliability Engineer Google January 2008  –  May 2011  (3 years 5 months) * Provided on-call support for 10+ key internal employee productivity applications and for BigTable service. \n* Led team disaster preparedness, privacy/security, and Sarbanes-Oxley compliance efforts. \n* Re-platformed legacy applications onto Google's cloud computing infrastructure to improve supportability. \n* Wrote tools to boost team productivity and give internal HR customers self-service, secure access to data. \n* Led effort to migrate Perforce servers from Red Hat to Ubuntu and wrote tools to verify replication integrity. Lead Sysadmin, Undergraduate Computer Science Cluster; IMSS House Rep California Institute of Technology February 2006  –  January 2008  (2 years) Acted as lead systems administrator for the student volunteer-run UGCS computing cluster at Caltech, overseeing overhaul of the UGCS infrastructure for greater performance, security, and scalability for future growth. \n \nMaintained computer labs, house servers, and provided technical support to students in Blacker House and Dabney House as a student representative of Information Management Systems and Services at Caltech. Technical Operations Manager Three Rings Design March 2005  –  January 2008  (2 years 11 months) Engaged in programming, bugfixes, and technical assistance to support staff for Puzzle Pirates. Wrote support ticket management system currently in use. Undergraduate Research Fellow California Institute of Technology June 2006  –  August 2007  (1 year 3 months) Engaged in ongoing research into stomatal development in Arabidopsis thaliana, and CLE family genes. Contract Software Engineer Demidec June 2005  –  August 2005  (3 months) Acted as principal software architect and programmer of a program to hold a testbank of quiz questions and associated answers, citing sources, and allowing students to access the questions and share lists of questions. Systems Administrator College Preparatory Mathematics June 2004  –  August 2005  (1 year 3 months) Provided network administration and end-user support of Mac OS X, Word, and MathType to working group of 20-30 high school math teachers, including establishing common fileserver, backup scheme, centralized printing without pre-existing network infrastructure. Senior Site Reliability Engineer Google May 2011  – Present (4 years 4 months) * Google eBooks (http://books.google.com/ebooks) SRE \n* Google Frontend SWE \n* Google Flights SRE \n* As of June 2015, managing Bigtable SRE in NYC! Senior Site Reliability Engineer Google May 2011  – Present (4 years 4 months) * Google eBooks (http://books.google.com/ebooks) SRE \n* Google Frontend SWE \n* Google Flights SRE \n* As of June 2015, managing Bigtable SRE in NYC! Teaching Assistant MIT 2012  –  2013  (1 year) Greater Boston Area Teaching assistant for 6.035 and 6.172; lab assistant for 6.042 Teaching Assistant MIT 2012  –  2013  (1 year) Greater Boston Area Teaching assistant for 6.035 and 6.172; lab assistant for 6.042 Site Reliability Engineer Google January 2008  –  May 2011  (3 years 5 months) * Provided on-call support for 10+ key internal employee productivity applications and for BigTable service. \n* Led team disaster preparedness, privacy/security, and Sarbanes-Oxley compliance efforts. \n* Re-platformed legacy applications onto Google's cloud computing infrastructure to improve supportability. \n* Wrote tools to boost team productivity and give internal HR customers self-service, secure access to data. \n* Led effort to migrate Perforce servers from Red Hat to Ubuntu and wrote tools to verify replication integrity. Site Reliability Engineer Google January 2008  –  May 2011  (3 years 5 months) * Provided on-call support for 10+ key internal employee productivity applications and for BigTable service. \n* Led team disaster preparedness, privacy/security, and Sarbanes-Oxley compliance efforts. \n* Re-platformed legacy applications onto Google's cloud computing infrastructure to improve supportability. \n* Wrote tools to boost team productivity and give internal HR customers self-service, secure access to data. \n* Led effort to migrate Perforce servers from Red Hat to Ubuntu and wrote tools to verify replication integrity. Lead Sysadmin, Undergraduate Computer Science Cluster; IMSS House Rep California Institute of Technology February 2006  –  January 2008  (2 years) Acted as lead systems administrator for the student volunteer-run UGCS computing cluster at Caltech, overseeing overhaul of the UGCS infrastructure for greater performance, security, and scalability for future growth. \n \nMaintained computer labs, house servers, and provided technical support to students in Blacker House and Dabney House as a student representative of Information Management Systems and Services at Caltech. Lead Sysadmin, Undergraduate Computer Science Cluster; IMSS House Rep California Institute of Technology February 2006  –  January 2008  (2 years) Acted as lead systems administrator for the student volunteer-run UGCS computing cluster at Caltech, overseeing overhaul of the UGCS infrastructure for greater performance, security, and scalability for future growth. \n \nMaintained computer labs, house servers, and provided technical support to students in Blacker House and Dabney House as a student representative of Information Management Systems and Services at Caltech. Technical Operations Manager Three Rings Design March 2005  –  January 2008  (2 years 11 months) Engaged in programming, bugfixes, and technical assistance to support staff for Puzzle Pirates. Wrote support ticket management system currently in use. Technical Operations Manager Three Rings Design March 2005  –  January 2008  (2 years 11 months) Engaged in programming, bugfixes, and technical assistance to support staff for Puzzle Pirates. Wrote support ticket management system currently in use. Undergraduate Research Fellow California Institute of Technology June 2006  –  August 2007  (1 year 3 months) Engaged in ongoing research into stomatal development in Arabidopsis thaliana, and CLE family genes. Undergraduate Research Fellow California Institute of Technology June 2006  –  August 2007  (1 year 3 months) Engaged in ongoing research into stomatal development in Arabidopsis thaliana, and CLE family genes. Contract Software Engineer Demidec June 2005  –  August 2005  (3 months) Acted as principal software architect and programmer of a program to hold a testbank of quiz questions and associated answers, citing sources, and allowing students to access the questions and share lists of questions. Contract Software Engineer Demidec June 2005  –  August 2005  (3 months) Acted as principal software architect and programmer of a program to hold a testbank of quiz questions and associated answers, citing sources, and allowing students to access the questions and share lists of questions. Systems Administrator College Preparatory Mathematics June 2004  –  August 2005  (1 year 3 months) Provided network administration and end-user support of Mac OS X, Word, and MathType to working group of 20-30 high school math teachers, including establishing common fileserver, backup scheme, centralized printing without pre-existing network infrastructure. Systems Administrator College Preparatory Mathematics June 2004  –  August 2005  (1 year 3 months) Provided network administration and end-user support of Mac OS X, Word, and MathType to working group of 20-30 high school math teachers, including establishing common fileserver, backup scheme, centralized printing without pre-existing network infrastructure. Skills Python Java PHP Clustering Network Administration Skills  Python Java PHP Clustering Network Administration Python Java PHP Clustering Network Administration Python Java PHP Clustering Network Administration Education Massachusetts Institute of Technology Bachelor of Science (BS),  Computer Science 2011  – 2014 Massachusetts Institute of Technology Special Student,  Computer Science 2010  – 2011 Caltech Biology ,  Computer Science 2005  – 2008 Went on indefinite sabbatical in 2008 from BS program. Activities and Societies:  Blacker ,  Dabney ,  UGCS Massachusetts Institute of Technology Bachelor of Science (BS),  Computer Science 2011  – 2014 Massachusetts Institute of Technology Bachelor of Science (BS),  Computer Science 2011  – 2014 Massachusetts Institute of Technology Bachelor of Science (BS),  Computer Science 2011  – 2014 Massachusetts Institute of Technology Special Student,  Computer Science 2010  – 2011 Massachusetts Institute of Technology Special Student,  Computer Science 2010  – 2011 Massachusetts Institute of Technology Special Student,  Computer Science 2010  – 2011 Caltech Biology ,  Computer Science 2005  – 2008 Went on indefinite sabbatical in 2008 from BS program. Activities and Societies:  Blacker ,  Dabney ,  UGCS Caltech Biology ,  Computer Science 2005  – 2008 Went on indefinite sabbatical in 2008 from BS program. Activities and Societies:  Blacker ,  Dabney ,  UGCS Caltech Biology ,  Computer Science 2005  – 2008 Went on indefinite sabbatical in 2008 from BS program. Activities and Societies:  Blacker ,  Dabney ,  UGCS Honors & Awards Additional Honors & Awards National Merit Finalist, 2005 \nRichter Scholar, 2006 Caltech Undergraduate Research Fellowship program Additional Honors & Awards National Merit Finalist, 2005 \nRichter Scholar, 2006 Caltech Undergraduate Research Fellowship program Additional Honors & Awards National Merit Finalist, 2005 \nRichter Scholar, 2006 Caltech Undergraduate Research Fellowship program Additional Honors & Awards National Merit Finalist, 2005 \nRichter Scholar, 2006 Caltech Undergraduate Research Fellowship program ", "Experience Site Reliability Engineer Google August 2014  – Present (1 year 1 month) California, us Expert Production Engineer Alibaba.com July 2013  –  June 2014  (1 year) Beijing, China Site Reliability Engineer Google August 2011  –  July 2013  (2 years) Dublin, Ireland Senior Corporate Operations Engineer Google April 2007  –  August 2011  (4 years 5 months) Beijing City, China Software Engineer IBM CRL(China Research Laboratory) July 2006  –  March 2007  (9 months) Beijing City, China Site Reliability Engineer Google August 2014  – Present (1 year 1 month) California, us Site Reliability Engineer Google August 2014  – Present (1 year 1 month) California, us Expert Production Engineer Alibaba.com July 2013  –  June 2014  (1 year) Beijing, China Expert Production Engineer Alibaba.com July 2013  –  June 2014  (1 year) Beijing, China Site Reliability Engineer Google August 2011  –  July 2013  (2 years) Dublin, Ireland Site Reliability Engineer Google August 2011  –  July 2013  (2 years) Dublin, Ireland Senior Corporate Operations Engineer Google April 2007  –  August 2011  (4 years 5 months) Beijing City, China Senior Corporate Operations Engineer Google April 2007  –  August 2011  (4 years 5 months) Beijing City, China Software Engineer IBM CRL(China Research Laboratory) July 2006  –  March 2007  (9 months) Beijing City, China Software Engineer IBM CRL(China Research Laboratory) July 2006  –  March 2007  (9 months) Beijing City, China Languages Chinese English Chinese English Chinese English Skills Linux System Administration Network Operations Troubleshooting Python C Algorithms Shell Scripting Cloud Computing C++ Operating Systems Scalability Distributed Systems Apache Bash Skills  Linux System Administration Network Operations Troubleshooting Python C Algorithms Shell Scripting Cloud Computing C++ Operating Systems Scalability Distributed Systems Apache Bash Linux System Administration Network Operations Troubleshooting Python C Algorithms Shell Scripting Cloud Computing C++ Operating Systems Scalability Distributed Systems Apache Bash Linux System Administration Network Operations Troubleshooting Python C Algorithms Shell Scripting Cloud Computing C++ Operating Systems Scalability Distributed Systems Apache Bash Education Beijing University of Post and Telecommunications Master,  Computer Science 2004  – 2007 Beijing University of Post and Telecommunications Bachelor,  Economics 2000  – 2004 Beijing University of Post and Telecommunications Master,  Computer Science 2004  – 2007 Beijing University of Post and Telecommunications Master,  Computer Science 2004  – 2007 Beijing University of Post and Telecommunications Master,  Computer Science 2004  – 2007 Beijing University of Post and Telecommunications Bachelor,  Economics 2000  – 2004 Beijing University of Post and Telecommunications Bachelor,  Economics 2000  – 2004 Beijing University of Post and Telecommunications Bachelor,  Economics 2000  – 2004 ", "Experience Site Reliability Engineer Google April 2011  – Present (4 years 5 months) Zurich Flipping bits Site Reliability Engineer Intern Google June 2010  –  September 2010  (4 months) Research Assistant Vrije Universiteit Amsterdam October 2008  –  May 2010  (1 year 8 months) Philosophise with PhD students Linux Systems Administrator Intern Google November 2007  –  May 2008  (7 months) Network Engineer Raising Unified Network February 2006  –  October 2007  (1 year 9 months) Routing packets old-school Junior Software Engineer gelf.net April 2003  –  August 2005  (2 years 5 months) Swearing at JavaScript and patching kernels Site Reliability Engineer Google April 2011  – Present (4 years 5 months) Zurich Flipping bits Site Reliability Engineer Google April 2011  – Present (4 years 5 months) Zurich Flipping bits Site Reliability Engineer Intern Google June 2010  –  September 2010  (4 months) Site Reliability Engineer Intern Google June 2010  –  September 2010  (4 months) Research Assistant Vrije Universiteit Amsterdam October 2008  –  May 2010  (1 year 8 months) Philosophise with PhD students Research Assistant Vrije Universiteit Amsterdam October 2008  –  May 2010  (1 year 8 months) Philosophise with PhD students Linux Systems Administrator Intern Google November 2007  –  May 2008  (7 months) Linux Systems Administrator Intern Google November 2007  –  May 2008  (7 months) Network Engineer Raising Unified Network February 2006  –  October 2007  (1 year 9 months) Routing packets old-school Network Engineer Raising Unified Network February 2006  –  October 2007  (1 year 9 months) Routing packets old-school Junior Software Engineer gelf.net April 2003  –  August 2005  (2 years 5 months) Swearing at JavaScript and patching kernels Junior Software Engineer gelf.net April 2003  –  August 2005  (2 years 5 months) Swearing at JavaScript and patching kernels Languages Kolterisch Native or bilingual proficiency English Full professional proficiency Italian Limited working proficiency German Native or bilingual proficiency Spanish Elementary proficiency Kolterisch Native or bilingual proficiency English Full professional proficiency Italian Limited working proficiency German Native or bilingual proficiency Spanish Elementary proficiency Kolterisch Native or bilingual proficiency English Full professional proficiency Italian Limited working proficiency German Native or bilingual proficiency Spanish Elementary proficiency Native or bilingual proficiency Full professional proficiency Limited working proficiency Native or bilingual proficiency Elementary proficiency Skills Linux Distributed Systems Python C Teamwork Scalability Bash Java TCP/IP Networking Annual Giving Unix Shell Scripting Beer Bikes Organic Farming Skills  Linux Distributed Systems Python C Teamwork Scalability Bash Java TCP/IP Networking Annual Giving Unix Shell Scripting Beer Bikes Organic Farming Linux Distributed Systems Python C Teamwork Scalability Bash Java TCP/IP Networking Annual Giving Unix Shell Scripting Beer Bikes Organic Farming Linux Distributed Systems Python C Teamwork Scalability Bash Java TCP/IP Networking Annual Giving Unix Shell Scripting Beer Bikes Organic Farming Education VU University Amsterdam Master,  Computer Science 2008  – 2010 Graduated with honors in Parallel and Distributed Computer Systems. Received VU Fellowship Program Scholarship 2009/2010. Free University of Bozen - Bolzano Bachelor,  Applied Computer Science 2004  – 2008 Erasmus Program: 1 semester at Vrije Universiteit Amsterdam focus on Grid Computing. Received national scholarship 2004-2008. VU University Amsterdam Master,  Computer Science 2008  – 2010 Graduated with honors in Parallel and Distributed Computer Systems. Received VU Fellowship Program Scholarship 2009/2010. VU University Amsterdam Master,  Computer Science 2008  – 2010 Graduated with honors in Parallel and Distributed Computer Systems. Received VU Fellowship Program Scholarship 2009/2010. VU University Amsterdam Master,  Computer Science 2008  – 2010 Graduated with honors in Parallel and Distributed Computer Systems. Received VU Fellowship Program Scholarship 2009/2010. Free University of Bozen - Bolzano Bachelor,  Applied Computer Science 2004  – 2008 Erasmus Program: 1 semester at Vrije Universiteit Amsterdam focus on Grid Computing. Received national scholarship 2004-2008. Free University of Bozen - Bolzano Bachelor,  Applied Computer Science 2004  – 2008 Erasmus Program: 1 semester at Vrije Universiteit Amsterdam focus on Grid Computing. Received national scholarship 2004-2008. Free University of Bozen - Bolzano Bachelor,  Applied Computer Science 2004  – 2008 Erasmus Program: 1 semester at Vrije Universiteit Amsterdam focus on Grid Computing. Received national scholarship 2004-2008. Honors & Awards Additional Honors & Awards VU Fellowship Programme 2009/2010 scholarship for excellent, promising students who take part in a international Master's programme Additional Honors & Awards VU Fellowship Programme 2009/2010 scholarship for excellent, promising students who take part in a international Master's programme Additional Honors & Awards VU Fellowship Programme 2009/2010 scholarship for excellent, promising students who take part in a international Master's programme Additional Honors & Awards VU Fellowship Programme 2009/2010 scholarship for excellent, promising students who take part in a international Master's programme ", "Summary Please don't contact me unless I've actually met you, preferably more than once. \n \nRecruiters: Please do not contact me with job offers, I'm very happy in my current position. \n \n \nPossesses multiple alternate egos:  \n \nSite Reliability Engineer (aka Systems Engineer) \nInsatiable computer nerd Specialties:Systems Design, Automation Solutions, Customer Service, Designing Scaling Solutions, Large Scale Realtime Systems Monitoring, Large Scale Production Load Balancing, Administration of High Availability Websites, Large Scale Systems Design, Large Scale Production Quality IPv6 Deployments \n \nProfficient with FreeBSD, Linux (many flavours including Debian, Ubuntu and others), MacOS X Summary Please don't contact me unless I've actually met you, preferably more than once. \n \nRecruiters: Please do not contact me with job offers, I'm very happy in my current position. \n \n \nPossesses multiple alternate egos:  \n \nSite Reliability Engineer (aka Systems Engineer) \nInsatiable computer nerd Specialties:Systems Design, Automation Solutions, Customer Service, Designing Scaling Solutions, Large Scale Realtime Systems Monitoring, Large Scale Production Load Balancing, Administration of High Availability Websites, Large Scale Systems Design, Large Scale Production Quality IPv6 Deployments \n \nProfficient with FreeBSD, Linux (many flavours including Debian, Ubuntu and others), MacOS X Please don't contact me unless I've actually met you, preferably more than once. \n \nRecruiters: Please do not contact me with job offers, I'm very happy in my current position. \n \n \nPossesses multiple alternate egos:  \n \nSite Reliability Engineer (aka Systems Engineer) \nInsatiable computer nerd Specialties:Systems Design, Automation Solutions, Customer Service, Designing Scaling Solutions, Large Scale Realtime Systems Monitoring, Large Scale Production Load Balancing, Administration of High Availability Websites, Large Scale Systems Design, Large Scale Production Quality IPv6 Deployments \n \nProfficient with FreeBSD, Linux (many flavours including Debian, Ubuntu and others), MacOS X Please don't contact me unless I've actually met you, preferably more than once. \n \nRecruiters: Please do not contact me with job offers, I'm very happy in my current position. \n \n \nPossesses multiple alternate egos:  \n \nSite Reliability Engineer (aka Systems Engineer) \nInsatiable computer nerd Specialties:Systems Design, Automation Solutions, Customer Service, Designing Scaling Solutions, Large Scale Realtime Systems Monitoring, Large Scale Production Load Balancing, Administration of High Availability Websites, Large Scale Systems Design, Large Scale Production Quality IPv6 Deployments \n \nProfficient with FreeBSD, Linux (many flavours including Debian, Ubuntu and others), MacOS X Experience Senior Site Reliability Engineer - Websearch Google April 2015  – Present (5 months) Dublin Member of Search SRE, the larger team responsible for the running and scaling of Google Websearch. \n \nAccomplishments include technical leadership of small teams, automation, monitoring, process definition and capacity planning Port Maintainer FreeBSD February 2014  – Present (1 year 7 months) Dublin Original contributor and ports maintainer of \"multimedia/py-soco\" python module Port Maintainer MacPorts February 2012  – Present (3 years 7 months) Contributor to the MacPorts open source community. Original creator and ongoing maintainer of a port for the \"py-gflags\" python module Site Reliability Engineer - Websearch Google January 2013  –  April 2015  (2 years 4 months) Dublin Member of Search SRE, the larger team responsible for the running and scaling of Google Websearch. \n \nAccomplishments include technical leadership of small teams, automation, monitoring, process definition and capacity planning Site Reliability Engineer - Traffic Google July 2009  –  December 2012  (3 years 6 months) Dublin Member of Traffic SRE, the team of engineers responsible for running and scaling the load balancing infrastructure for all Google products. \n \nAccomplishments during this time include the qualification and deployment of production quality IPv6 load balancing, capacity planning, monitoring, automation, defined/optimised processes, infrastructure design/qualification and technical leadership of small teams Systems Administrator Google June 2006  –  June 2009  (3 years 1 month) Dublin Member of the SysOps Team, a global team of sysadmins who maintain, design and develop the internal IT infrastructure to support Google employees. Systems & Network Administrator School of Mathematics, Trinity College July 2004  –  June 2006  (2 years) Tamed FreeBSD and Debian Linux servers and Cisco powered networks (wired and wireless), provided IT support to Dept students and staff, taught Unix tutorials to college freshman and liased with IT staff from other college Depts IT Consultant Self-employed June 1998  –  June 2006  (8 years 1 month) Dublin Free Lance IT Consultant who worked with various small business to provide on demand IT experience, expertise and advice within various industries including the Irish Building, Education, Legal and Health sectors. Systems & Network Administrator (Consultant) InfoCAD Data Ltd May 1998  –  June 2006  (8 years 2 months) Dublin Consulting sysadmin and occasional software developer who worked onsite with clients Package Maintainer Debian 2006  –  2006  (less than a year) Developer and original maintainer of the \"queuegraph\" monitoring package Systems Engineer (Contractor) Critical Path June 2004  –  July 2004  (2 months) Senior Site Reliability Engineer - Websearch Google April 2015  – Present (5 months) Dublin Member of Search SRE, the larger team responsible for the running and scaling of Google Websearch. \n \nAccomplishments include technical leadership of small teams, automation, monitoring, process definition and capacity planning Senior Site Reliability Engineer - Websearch Google April 2015  – Present (5 months) Dublin Member of Search SRE, the larger team responsible for the running and scaling of Google Websearch. \n \nAccomplishments include technical leadership of small teams, automation, monitoring, process definition and capacity planning Port Maintainer FreeBSD February 2014  – Present (1 year 7 months) Dublin Original contributor and ports maintainer of \"multimedia/py-soco\" python module Port Maintainer FreeBSD February 2014  – Present (1 year 7 months) Dublin Original contributor and ports maintainer of \"multimedia/py-soco\" python module Port Maintainer MacPorts February 2012  – Present (3 years 7 months) Contributor to the MacPorts open source community. Original creator and ongoing maintainer of a port for the \"py-gflags\" python module Port Maintainer MacPorts February 2012  – Present (3 years 7 months) Contributor to the MacPorts open source community. Original creator and ongoing maintainer of a port for the \"py-gflags\" python module Site Reliability Engineer - Websearch Google January 2013  –  April 2015  (2 years 4 months) Dublin Member of Search SRE, the larger team responsible for the running and scaling of Google Websearch. \n \nAccomplishments include technical leadership of small teams, automation, monitoring, process definition and capacity planning Site Reliability Engineer - Websearch Google January 2013  –  April 2015  (2 years 4 months) Dublin Member of Search SRE, the larger team responsible for the running and scaling of Google Websearch. \n \nAccomplishments include technical leadership of small teams, automation, monitoring, process definition and capacity planning Site Reliability Engineer - Traffic Google July 2009  –  December 2012  (3 years 6 months) Dublin Member of Traffic SRE, the team of engineers responsible for running and scaling the load balancing infrastructure for all Google products. \n \nAccomplishments during this time include the qualification and deployment of production quality IPv6 load balancing, capacity planning, monitoring, automation, defined/optimised processes, infrastructure design/qualification and technical leadership of small teams Site Reliability Engineer - Traffic Google July 2009  –  December 2012  (3 years 6 months) Dublin Member of Traffic SRE, the team of engineers responsible for running and scaling the load balancing infrastructure for all Google products. \n \nAccomplishments during this time include the qualification and deployment of production quality IPv6 load balancing, capacity planning, monitoring, automation, defined/optimised processes, infrastructure design/qualification and technical leadership of small teams Systems Administrator Google June 2006  –  June 2009  (3 years 1 month) Dublin Member of the SysOps Team, a global team of sysadmins who maintain, design and develop the internal IT infrastructure to support Google employees. Systems Administrator Google June 2006  –  June 2009  (3 years 1 month) Dublin Member of the SysOps Team, a global team of sysadmins who maintain, design and develop the internal IT infrastructure to support Google employees. Systems & Network Administrator School of Mathematics, Trinity College July 2004  –  June 2006  (2 years) Tamed FreeBSD and Debian Linux servers and Cisco powered networks (wired and wireless), provided IT support to Dept students and staff, taught Unix tutorials to college freshman and liased with IT staff from other college Depts Systems & Network Administrator School of Mathematics, Trinity College July 2004  –  June 2006  (2 years) Tamed FreeBSD and Debian Linux servers and Cisco powered networks (wired and wireless), provided IT support to Dept students and staff, taught Unix tutorials to college freshman and liased with IT staff from other college Depts IT Consultant Self-employed June 1998  –  June 2006  (8 years 1 month) Dublin Free Lance IT Consultant who worked with various small business to provide on demand IT experience, expertise and advice within various industries including the Irish Building, Education, Legal and Health sectors. IT Consultant Self-employed June 1998  –  June 2006  (8 years 1 month) Dublin Free Lance IT Consultant who worked with various small business to provide on demand IT experience, expertise and advice within various industries including the Irish Building, Education, Legal and Health sectors. Systems & Network Administrator (Consultant) InfoCAD Data Ltd May 1998  –  June 2006  (8 years 2 months) Dublin Consulting sysadmin and occasional software developer who worked onsite with clients Systems & Network Administrator (Consultant) InfoCAD Data Ltd May 1998  –  June 2006  (8 years 2 months) Dublin Consulting sysadmin and occasional software developer who worked onsite with clients Package Maintainer Debian 2006  –  2006  (less than a year) Developer and original maintainer of the \"queuegraph\" monitoring package Package Maintainer Debian 2006  –  2006  (less than a year) Developer and original maintainer of the \"queuegraph\" monitoring package Systems Engineer (Contractor) Critical Path June 2004  –  July 2004  (2 months) Systems Engineer (Contractor) Critical Path June 2004  –  July 2004  (2 months) Languages   Skills Automation Mac OS X System Design OS X Unix Linux Distributed Systems System Administration IPv6 Software Engineering Open Source Ubuntu High Availability Scalability Debian Servers FreeBSD Bash See 3+     See less Skills  Automation Mac OS X System Design OS X Unix Linux Distributed Systems System Administration IPv6 Software Engineering Open Source Ubuntu High Availability Scalability Debian Servers FreeBSD Bash See 3+     See less Automation Mac OS X System Design OS X Unix Linux Distributed Systems System Administration IPv6 Software Engineering Open Source Ubuntu High Availability Scalability Debian Servers FreeBSD Bash See 3+     See less Automation Mac OS X System Design OS X Unix Linux Distributed Systems System Administration IPv6 Software Engineering Open Source Ubuntu High Availability Scalability Debian Servers FreeBSD Bash See 3+     See less Education Trinity College Dublin BA,  Computer Science 2001  – 2006 Blackrock College 1990  – 2001 Children's House Montessori School 1986  – 1990 Trinity College Dublin BA,  Computer Science 2001  – 2006 Trinity College Dublin BA,  Computer Science 2001  – 2006 Trinity College Dublin BA,  Computer Science 2001  – 2006 Blackrock College 1990  – 2001 Blackrock College 1990  – 2001 Blackrock College 1990  – 2001 Children's House Montessori School 1986  – 1990 Children's House Montessori School 1986  – 1990 Children's House Montessori School 1986  – 1990 Honors & Awards ", "Summary I'm a recent Penn State graduate with multiple years of experience in IT support and a strong passion for technology and innovation. I graduated with a major in Information Sciences and Technology where I learned the critical nature of information systems in a business environment. My professional experiences include developing custom web applications with PHP/SQL to meet business expansion needs, consulting at KPMG to assess client IT security and compliance, and over three years of experience in IT support where I worked with multiple departments and customers at one of the nation's largest universities, in order to develop solutions to hardware, software, and network problems.  \n \nOver the last eight years, I have worked with GNU/Linux for my daily computing needs and have become very proficient in its use. I have contributed countless hours of Linux support and testing via online forums and feedback. \n \nI have recently accepted an offer from Google to join their Internal Technology Residency Program where I will offer IT support to employees within one of the world's largest and most advanced computing environments. In this program, I will spend two years developing solutions to all types of computing problems across desktop, server, and mobile platforms and will spend a 3 month period contributing to a Google team that lines up with my future career goals. Summary I'm a recent Penn State graduate with multiple years of experience in IT support and a strong passion for technology and innovation. I graduated with a major in Information Sciences and Technology where I learned the critical nature of information systems in a business environment. My professional experiences include developing custom web applications with PHP/SQL to meet business expansion needs, consulting at KPMG to assess client IT security and compliance, and over three years of experience in IT support where I worked with multiple departments and customers at one of the nation's largest universities, in order to develop solutions to hardware, software, and network problems.  \n \nOver the last eight years, I have worked with GNU/Linux for my daily computing needs and have become very proficient in its use. I have contributed countless hours of Linux support and testing via online forums and feedback. \n \nI have recently accepted an offer from Google to join their Internal Technology Residency Program where I will offer IT support to employees within one of the world's largest and most advanced computing environments. In this program, I will spend two years developing solutions to all types of computing problems across desktop, server, and mobile platforms and will spend a 3 month period contributing to a Google team that lines up with my future career goals. I'm a recent Penn State graduate with multiple years of experience in IT support and a strong passion for technology and innovation. I graduated with a major in Information Sciences and Technology where I learned the critical nature of information systems in a business environment. My professional experiences include developing custom web applications with PHP/SQL to meet business expansion needs, consulting at KPMG to assess client IT security and compliance, and over three years of experience in IT support where I worked with multiple departments and customers at one of the nation's largest universities, in order to develop solutions to hardware, software, and network problems.  \n \nOver the last eight years, I have worked with GNU/Linux for my daily computing needs and have become very proficient in its use. I have contributed countless hours of Linux support and testing via online forums and feedback. \n \nI have recently accepted an offer from Google to join their Internal Technology Residency Program where I will offer IT support to employees within one of the world's largest and most advanced computing environments. In this program, I will spend two years developing solutions to all types of computing problems across desktop, server, and mobile platforms and will spend a 3 month period contributing to a Google team that lines up with my future career goals. I'm a recent Penn State graduate with multiple years of experience in IT support and a strong passion for technology and innovation. I graduated with a major in Information Sciences and Technology where I learned the critical nature of information systems in a business environment. My professional experiences include developing custom web applications with PHP/SQL to meet business expansion needs, consulting at KPMG to assess client IT security and compliance, and over three years of experience in IT support where I worked with multiple departments and customers at one of the nation's largest universities, in order to develop solutions to hardware, software, and network problems.  \n \nOver the last eight years, I have worked with GNU/Linux for my daily computing needs and have become very proficient in its use. I have contributed countless hours of Linux support and testing via online forums and feedback. \n \nI have recently accepted an offer from Google to join their Internal Technology Residency Program where I will offer IT support to employees within one of the world's largest and most advanced computing environments. In this program, I will spend two years developing solutions to all types of computing problems across desktop, server, and mobile platforms and will spend a 3 month period contributing to a Google team that lines up with my future career goals. Experience Site Reliability Engineer Google June 2015  – Present (3 months) Zurich, Switzerland Systems Engineering for Google Docs / Drive Internal Technology Resident Google August 2013  –  June 2015  (1 year 11 months) Mountain View, CA Contributing thousands of lines of code to Google code base for monitoring 370+ jobs, overhauling Gmail SLA monitoring, improving Ads infrastructure and improving support pipelines \nPlanning, designing and implementing multiple code-based projects from start to finish both  \nindividually and within a team \nSupporting a world-leading computing environment with multiple OSs, dozens of devices, and dynamic needs \nDesign, analyze and present SQL data to shape future of video conferencing support team globally \nInteract with multiple teams and systems to create thorough documentation for various project needs Site Reliability Engineer Rotation Google October 2014  –  January 2015  (4 months) Overhauling Gmail SLA Monitoring \nCreating monitoring setup for 370+ Ads infrastructure jobs \nContributing to Google-wide automatic binary evaluation tool Learning Assistant for Legal and Regulatory Environment of Information Technology Penn State University August 2012  –  May 2013  (10 months) State College, PA Assisted a professor of Information Science and Technology with teaching material and classroom needs \nOrganized and managed multiple classroom assignments and activities \nAssisted with research and further knowledge on the legal regulatory environment of information technology Residential Computing Student Manager Penn State University December 2011  –  May 2013  (1 year 6 months) Trained/advised new technicians and managers with regards to policy, troubleshooting techniques, and customer interaction \nCommunicated with multiple departments in order to solve network, security, and policy issues \nManaged a team of twenty technicians to provide customer service and technical support \nWorked with a team of other managers to create policy additions and modifications for constantly updating standards and technology IT Attestation Associate Intern KPMG June 2012  –  August 2012  (3 months) Philadelphia, PA Collaborated with IT attestation team in order to determine IT and operational risks for external organizations \nPerformed interviews and on-site work for clients seeking SOX compliance, SSAE 16 reports, and IT assessment \nAssisted KPMG audit team with financial audit through IT system analysis with regards to risk evaluation IT Intern/Project Manager S&R Management May 2011  –  August 2012  (1 year 4 months) Setup multiple Windows workspaces for 22 offices around the country with VNC, Skype, and other capability \nResearched, ordered, and setup Internet service for all offices with regard to price and performance \nCompletely replaced the existing phone connection with Internet, Skype phone, and workstation installation \nDeveloped website that allowed employees to clock in/out and enter to their daily production numbers \nSetup network of all 22 offices in order to access clock in/out web application with custom MySQL databases Residential Computing Student Technician Penn State University April 2010  –  December 2011  (1 year 9 months) Advised other technicians in dealing with students, parents, and other Penn State departments effectively. \nPersonally assisted over 1700 students throughout the Penn State campus with various computer issues \nWork with a team of other technicians to troubleshoot student computer problems \nOffer consultation and support to assist customers in maintaining and protecting their computers \nTroubleshoot computers for viruses, spyware, hardware issues, software errors, and Penn State network issues Site Reliability Engineer Google June 2015  – Present (3 months) Zurich, Switzerland Systems Engineering for Google Docs / Drive Site Reliability Engineer Google June 2015  – Present (3 months) Zurich, Switzerland Systems Engineering for Google Docs / Drive Internal Technology Resident Google August 2013  –  June 2015  (1 year 11 months) Mountain View, CA Contributing thousands of lines of code to Google code base for monitoring 370+ jobs, overhauling Gmail SLA monitoring, improving Ads infrastructure and improving support pipelines \nPlanning, designing and implementing multiple code-based projects from start to finish both  \nindividually and within a team \nSupporting a world-leading computing environment with multiple OSs, dozens of devices, and dynamic needs \nDesign, analyze and present SQL data to shape future of video conferencing support team globally \nInteract with multiple teams and systems to create thorough documentation for various project needs Internal Technology Resident Google August 2013  –  June 2015  (1 year 11 months) Mountain View, CA Contributing thousands of lines of code to Google code base for monitoring 370+ jobs, overhauling Gmail SLA monitoring, improving Ads infrastructure and improving support pipelines \nPlanning, designing and implementing multiple code-based projects from start to finish both  \nindividually and within a team \nSupporting a world-leading computing environment with multiple OSs, dozens of devices, and dynamic needs \nDesign, analyze and present SQL data to shape future of video conferencing support team globally \nInteract with multiple teams and systems to create thorough documentation for various project needs Site Reliability Engineer Rotation Google October 2014  –  January 2015  (4 months) Overhauling Gmail SLA Monitoring \nCreating monitoring setup for 370+ Ads infrastructure jobs \nContributing to Google-wide automatic binary evaluation tool Site Reliability Engineer Rotation Google October 2014  –  January 2015  (4 months) Overhauling Gmail SLA Monitoring \nCreating monitoring setup for 370+ Ads infrastructure jobs \nContributing to Google-wide automatic binary evaluation tool Learning Assistant for Legal and Regulatory Environment of Information Technology Penn State University August 2012  –  May 2013  (10 months) State College, PA Assisted a professor of Information Science and Technology with teaching material and classroom needs \nOrganized and managed multiple classroom assignments and activities \nAssisted with research and further knowledge on the legal regulatory environment of information technology Learning Assistant for Legal and Regulatory Environment of Information Technology Penn State University August 2012  –  May 2013  (10 months) State College, PA Assisted a professor of Information Science and Technology with teaching material and classroom needs \nOrganized and managed multiple classroom assignments and activities \nAssisted with research and further knowledge on the legal regulatory environment of information technology Residential Computing Student Manager Penn State University December 2011  –  May 2013  (1 year 6 months) Trained/advised new technicians and managers with regards to policy, troubleshooting techniques, and customer interaction \nCommunicated with multiple departments in order to solve network, security, and policy issues \nManaged a team of twenty technicians to provide customer service and technical support \nWorked with a team of other managers to create policy additions and modifications for constantly updating standards and technology Residential Computing Student Manager Penn State University December 2011  –  May 2013  (1 year 6 months) Trained/advised new technicians and managers with regards to policy, troubleshooting techniques, and customer interaction \nCommunicated with multiple departments in order to solve network, security, and policy issues \nManaged a team of twenty technicians to provide customer service and technical support \nWorked with a team of other managers to create policy additions and modifications for constantly updating standards and technology IT Attestation Associate Intern KPMG June 2012  –  August 2012  (3 months) Philadelphia, PA Collaborated with IT attestation team in order to determine IT and operational risks for external organizations \nPerformed interviews and on-site work for clients seeking SOX compliance, SSAE 16 reports, and IT assessment \nAssisted KPMG audit team with financial audit through IT system analysis with regards to risk evaluation IT Attestation Associate Intern KPMG June 2012  –  August 2012  (3 months) Philadelphia, PA Collaborated with IT attestation team in order to determine IT and operational risks for external organizations \nPerformed interviews and on-site work for clients seeking SOX compliance, SSAE 16 reports, and IT assessment \nAssisted KPMG audit team with financial audit through IT system analysis with regards to risk evaluation IT Intern/Project Manager S&R Management May 2011  –  August 2012  (1 year 4 months) Setup multiple Windows workspaces for 22 offices around the country with VNC, Skype, and other capability \nResearched, ordered, and setup Internet service for all offices with regard to price and performance \nCompletely replaced the existing phone connection with Internet, Skype phone, and workstation installation \nDeveloped website that allowed employees to clock in/out and enter to their daily production numbers \nSetup network of all 22 offices in order to access clock in/out web application with custom MySQL databases IT Intern/Project Manager S&R Management May 2011  –  August 2012  (1 year 4 months) Setup multiple Windows workspaces for 22 offices around the country with VNC, Skype, and other capability \nResearched, ordered, and setup Internet service for all offices with regard to price and performance \nCompletely replaced the existing phone connection with Internet, Skype phone, and workstation installation \nDeveloped website that allowed employees to clock in/out and enter to their daily production numbers \nSetup network of all 22 offices in order to access clock in/out web application with custom MySQL databases Residential Computing Student Technician Penn State University April 2010  –  December 2011  (1 year 9 months) Advised other technicians in dealing with students, parents, and other Penn State departments effectively. \nPersonally assisted over 1700 students throughout the Penn State campus with various computer issues \nWork with a team of other technicians to troubleshoot student computer problems \nOffer consultation and support to assist customers in maintaining and protecting their computers \nTroubleshoot computers for viruses, spyware, hardware issues, software errors, and Penn State network issues Residential Computing Student Technician Penn State University April 2010  –  December 2011  (1 year 9 months) Advised other technicians in dealing with students, parents, and other Penn State departments effectively. \nPersonally assisted over 1700 students throughout the Penn State campus with various computer issues \nWork with a team of other technicians to troubleshoot student computer problems \nOffer consultation and support to assist customers in maintaining and protecting their computers \nTroubleshoot computers for viruses, spyware, hardware issues, software errors, and Penn State network issues Languages   Skills SQL Databases PHP Programming C++ Programming Hardware Troubleshooting Network Troubleshooting Mac OS X Linux VMware Written Skills Virus/Spyware Removal Team Leadership Troubleshooting OS X C++ Computer Hardware Python Windows See 2+     See less Skills  SQL Databases PHP Programming C++ Programming Hardware Troubleshooting Network Troubleshooting Mac OS X Linux VMware Written Skills Virus/Spyware Removal Team Leadership Troubleshooting OS X C++ Computer Hardware Python Windows See 2+     See less SQL Databases PHP Programming C++ Programming Hardware Troubleshooting Network Troubleshooting Mac OS X Linux VMware Written Skills Virus/Spyware Removal Team Leadership Troubleshooting OS X C++ Computer Hardware Python Windows See 2+     See less SQL Databases PHP Programming C++ Programming Hardware Troubleshooting Network Troubleshooting Mac OS X Linux VMware Written Skills Virus/Spyware Removal Team Leadership Troubleshooting OS X C++ Computer Hardware Python Windows See 2+     See less Education Penn State University B.S,  Information Sciences and Technology; Integration and Application 2009  – 2013 Activities and Societies:  THON Penn State University B.S,  Information Sciences and Technology; Integration and Application 2009  – 2013 Activities and Societies:  THON Penn State University B.S,  Information Sciences and Technology; Integration and Application 2009  – 2013 Activities and Societies:  THON Penn State University B.S,  Information Sciences and Technology; Integration and Application 2009  – 2013 Activities and Societies:  THON Honors & Awards ", "Experience Site Reliability Engineer Google July 2013  – Present (2 years 2 months) TA for ENGR 131 Case Western Reserve University September 2010  –  May 2013  (2 years 9 months) Site Reliability Engineer Intern Google May 2012  –  August 2012  (4 months) Mountain View I'm working on improving the MySQL codebase at Google! SRE Intern Google May 2011  –  August 2011  (4 months) Technical Intern Mogreet June 2008  –  August 2010  (2 years 3 months) Site Reliability Engineer Google July 2013  – Present (2 years 2 months) Site Reliability Engineer Google July 2013  – Present (2 years 2 months) TA for ENGR 131 Case Western Reserve University September 2010  –  May 2013  (2 years 9 months) TA for ENGR 131 Case Western Reserve University September 2010  –  May 2013  (2 years 9 months) Site Reliability Engineer Intern Google May 2012  –  August 2012  (4 months) Mountain View I'm working on improving the MySQL codebase at Google! Site Reliability Engineer Intern Google May 2012  –  August 2012  (4 months) Mountain View I'm working on improving the MySQL codebase at Google! SRE Intern Google May 2011  –  August 2011  (4 months) SRE Intern Google May 2011  –  August 2011  (4 months) Technical Intern Mogreet June 2008  –  August 2010  (2 years 3 months) Technical Intern Mogreet June 2008  –  August 2010  (2 years 3 months) Skills Java Linux C Python Ruby Bash SQL MySQL Computer Science Git Algorithms Skills  Java Linux C Python Ruby Bash SQL MySQL Computer Science Git Algorithms Java Linux C Python Ruby Bash SQL MySQL Computer Science Git Algorithms Java Linux C Python Ruby Bash SQL MySQL Computer Science Git Algorithms Education Case Western Reserve University BS,  Computer Science 2009  – 2013 Case Western Reserve University BS,  Computer Science 2009  – 2013 Case Western Reserve University BS,  Computer Science 2009  – 2013 Case Western Reserve University BS,  Computer Science 2009  – 2013 ", "Skills Python Linux Bash Machine Learning Distributed Systems Open Source Unix System Architecture Scalability Programming Shell Scripting Linux System... Algorithms Skills  Python Linux Bash Machine Learning Distributed Systems Open Source Unix System Architecture Scalability Programming Shell Scripting Linux System... Algorithms Python Linux Bash Machine Learning Distributed Systems Open Source Unix System Architecture Scalability Programming Shell Scripting Linux System... Algorithms Python Linux Bash Machine Learning Distributed Systems Open Source Unix System Architecture Scalability Programming Shell Scripting Linux System... Algorithms ", "Summary For the past few years I have been working as a software engineer/site reliability engineer on large distributed systems. I have a good understanding of C, C++ and Java as well as of software development methodologies. I also have expertise in algorithms and data structures.  \n \nI am interested in large commercial projects but science projects related to computational mathematics would also be a great experience. \n \nSpecialties: C, C++, Java, Algorithms and Data Structures, Distributed Systems, Linux, Bash, Computer Networks, Python, Software Engineering, Software Quality Summary For the past few years I have been working as a software engineer/site reliability engineer on large distributed systems. I have a good understanding of C, C++ and Java as well as of software development methodologies. I also have expertise in algorithms and data structures.  \n \nI am interested in large commercial projects but science projects related to computational mathematics would also be a great experience. \n \nSpecialties: C, C++, Java, Algorithms and Data Structures, Distributed Systems, Linux, Bash, Computer Networks, Python, Software Engineering, Software Quality For the past few years I have been working as a software engineer/site reliability engineer on large distributed systems. I have a good understanding of C, C++ and Java as well as of software development methodologies. I also have expertise in algorithms and data structures.  \n \nI am interested in large commercial projects but science projects related to computational mathematics would also be a great experience. \n \nSpecialties: C, C++, Java, Algorithms and Data Structures, Distributed Systems, Linux, Bash, Computer Networks, Python, Software Engineering, Software Quality For the past few years I have been working as a software engineer/site reliability engineer on large distributed systems. I have a good understanding of C, C++ and Java as well as of software development methodologies. I also have expertise in algorithms and data structures.  \n \nI am interested in large commercial projects but science projects related to computational mathematics would also be a great experience. \n \nSpecialties: C, C++, Java, Algorithms and Data Structures, Distributed Systems, Linux, Bash, Computer Networks, Python, Software Engineering, Software Quality Experience Senior Site Reliability Engineer/TLM Google January 2013  – Present (2 years 8 months) Zurich I manage the team that runs the infrastructure for Google for Work. \n \nTechnologies used: \n- Different in-house technologies \n- Java \n- Python Site Reliability Engineer Google August 2009  –  December 2012  (3 years 5 months) I worked in a team that managed production environment for Google Apps. \n \nTechnologies used: \n- Different in-house technologies \n- Shell scripting \n- Python \n- Java Software Engineer Google December 2007  –  July 2009  (1 year 8 months) I worked on google contacts API (http://code.google.com/apis/contacts/) and on gmail production environment. \n \nTechnologies used: \n- Java \n- JUnit \n- Python Software Engineer\\Test Leader IBM Poland July 2007  –  December 2007  (6 months) I was responsible for the test team in one of the projects. \n \nTechnologies used: \n- Java \n- JUnit Software Engineer\\Feature Leader Motorola Poland June 2005  –  June 2007  (2 years 1 month) I was responsible for feature development team (around 5 people). Programmer (intern) IGE+XAO Poland 2004  –  2004  (less than a year) During my internship at IGE-XAO Poland I was responsible for implementing a new feature for SEE Electrical Expert. The feature was GUI related. \n \nTechnologies used: \n- C\\C++ \n- OpenGL \n- MFC NEO-BOX programmer Lumix 2000  –  2002  (2 years) Responsible for game development for NEO-BOX. \n \nTechnologies used: \n- C++ \n- DirectX Leader and programmer Chaos Interactive 1996  –  1999  (3 years) Chaos Interactive was a group of few people interested in computer games. It was founded by high school students in 1996. The biggest success was game called Blow it! (the game was selected as a finalist in 1999 ZD Shareware Awards Competition).  \n \nI was the founder and the leader. \n \nTechnologies used: \n- C and C++ \n- DirectX Senior Site Reliability Engineer/TLM Google January 2013  – Present (2 years 8 months) Zurich I manage the team that runs the infrastructure for Google for Work. \n \nTechnologies used: \n- Different in-house technologies \n- Java \n- Python Senior Site Reliability Engineer/TLM Google January 2013  – Present (2 years 8 months) Zurich I manage the team that runs the infrastructure for Google for Work. \n \nTechnologies used: \n- Different in-house technologies \n- Java \n- Python Site Reliability Engineer Google August 2009  –  December 2012  (3 years 5 months) I worked in a team that managed production environment for Google Apps. \n \nTechnologies used: \n- Different in-house technologies \n- Shell scripting \n- Python \n- Java Site Reliability Engineer Google August 2009  –  December 2012  (3 years 5 months) I worked in a team that managed production environment for Google Apps. \n \nTechnologies used: \n- Different in-house technologies \n- Shell scripting \n- Python \n- Java Software Engineer Google December 2007  –  July 2009  (1 year 8 months) I worked on google contacts API (http://code.google.com/apis/contacts/) and on gmail production environment. \n \nTechnologies used: \n- Java \n- JUnit \n- Python Software Engineer Google December 2007  –  July 2009  (1 year 8 months) I worked on google contacts API (http://code.google.com/apis/contacts/) and on gmail production environment. \n \nTechnologies used: \n- Java \n- JUnit \n- Python Software Engineer\\Test Leader IBM Poland July 2007  –  December 2007  (6 months) I was responsible for the test team in one of the projects. \n \nTechnologies used: \n- Java \n- JUnit Software Engineer\\Test Leader IBM Poland July 2007  –  December 2007  (6 months) I was responsible for the test team in one of the projects. \n \nTechnologies used: \n- Java \n- JUnit Software Engineer\\Feature Leader Motorola Poland June 2005  –  June 2007  (2 years 1 month) I was responsible for feature development team (around 5 people). Software Engineer\\Feature Leader Motorola Poland June 2005  –  June 2007  (2 years 1 month) I was responsible for feature development team (around 5 people). Programmer (intern) IGE+XAO Poland 2004  –  2004  (less than a year) During my internship at IGE-XAO Poland I was responsible for implementing a new feature for SEE Electrical Expert. The feature was GUI related. \n \nTechnologies used: \n- C\\C++ \n- OpenGL \n- MFC Programmer (intern) IGE+XAO Poland 2004  –  2004  (less than a year) During my internship at IGE-XAO Poland I was responsible for implementing a new feature for SEE Electrical Expert. The feature was GUI related. \n \nTechnologies used: \n- C\\C++ \n- OpenGL \n- MFC NEO-BOX programmer Lumix 2000  –  2002  (2 years) Responsible for game development for NEO-BOX. \n \nTechnologies used: \n- C++ \n- DirectX NEO-BOX programmer Lumix 2000  –  2002  (2 years) Responsible for game development for NEO-BOX. \n \nTechnologies used: \n- C++ \n- DirectX Leader and programmer Chaos Interactive 1996  –  1999  (3 years) Chaos Interactive was a group of few people interested in computer games. It was founded by high school students in 1996. The biggest success was game called Blow it! (the game was selected as a finalist in 1999 ZD Shareware Awards Competition).  \n \nI was the founder and the leader. \n \nTechnologies used: \n- C and C++ \n- DirectX Leader and programmer Chaos Interactive 1996  –  1999  (3 years) Chaos Interactive was a group of few people interested in computer games. It was founded by high school students in 1996. The biggest success was game called Blow it! (the game was selected as a finalist in 1999 ZD Shareware Awards Competition).  \n \nI was the founder and the leader. \n \nTechnologies used: \n- C and C++ \n- DirectX Languages English Polish German (basic) English Polish German (basic) English Polish German (basic) Skills C C++ Java Python Bash Linux Computer Networks Algorithms and data... Distributed Systems Software Engineering Shell Scripting TCP/IP Programming Skills  C C++ Java Python Bash Linux Computer Networks Algorithms and data... Distributed Systems Software Engineering Shell Scripting TCP/IP Programming C C++ Java Python Bash Linux Computer Networks Algorithms and data... Distributed Systems Software Engineering Shell Scripting TCP/IP Programming C C++ Java Python Bash Linux Computer Networks Algorithms and data... Distributed Systems Software Engineering Shell Scripting TCP/IP Programming Education Jagiellonian University MSc,  Mathematics 2000  – 2005 Jagiellonian University MSc,  Mathematics 2000  – 2005 Jagiellonian University MSc,  Mathematics 2000  – 2005 Jagiellonian University MSc,  Mathematics 2000  – 2005 Honors & Awards Additional Honors & Awards CCNA (Cisco Certified Network Associate) certificate \nCAE (Certificate in Advanced English) certificate Additional Honors & Awards CCNA (Cisco Certified Network Associate) certificate \nCAE (Certificate in Advanced English) certificate Additional Honors & Awards CCNA (Cisco Certified Network Associate) certificate \nCAE (Certificate in Advanced English) certificate Additional Honors & Awards CCNA (Cisco Certified Network Associate) certificate \nCAE (Certificate in Advanced English) certificate ", "Skills Linux Python Bash System Administration Software Engineering Disaster Recovery Troubleshooting Scalability Grant Writing Skills  Linux Python Bash System Administration Software Engineering Disaster Recovery Troubleshooting Scalability Grant Writing Linux Python Bash System Administration Software Engineering Disaster Recovery Troubleshooting Scalability Grant Writing Linux Python Bash System Administration Software Engineering Disaster Recovery Troubleshooting Scalability Grant Writing ", "Skills Skills     "]}