{"position": "Site Reliability Engineer Intern - Monthly", "company": "Google", "profiles": ["Summary Low-level software engineer with a security engineering focus. Worked on several binary reverse engineering (x86, PowerPC, ARM) projects on my own time, and presented some of that work at technical conferences. Summary Low-level software engineer with a security engineering focus. Worked on several binary reverse engineering (x86, PowerPC, ARM) projects on my own time, and presented some of that work at technical conferences. Low-level software engineer with a security engineering focus. Worked on several binary reverse engineering (x86, PowerPC, ARM) projects on my own time, and presented some of that work at technical conferences. Low-level software engineer with a security engineering focus. Worked on several binary reverse engineering (x86, PowerPC, ARM) projects on my own time, and presented some of that work at technical conferences. Experience Site Reliability Engineer Google December 2013  – Present (1 year 9 months) Zurich Python Software Engineer alwaysdata September 2013  –  December 2013  (4 months) Paris Area, France Part time position: porting alwaysdata's frontend HTTP proxy from gevent to a new Python asynchronous API. Student Researcher Epita System and Security Laboratory January 2011  –  September 2013  (2 years 9 months) Paris Area, France Research on computer security, GPGPU programming, reverse engineering on unusual platforms (Gamecube, HP Switch) and development on FPGA boards. Site Reliability Engineer (Intern) Google March 2013  –  August 2013  (6 months) Zürich Area, Switzerland Designed, developed and improved tools used to make Google services reliable. Software Engineer Axalot August 2012  –  December 2012  (5 months) Paris, France Development of a data recovery tool for iPhone and Android devices. C#, C, Win32 API, x86 reverse engineering. Work on the whole stack, from the user interface to the low-level phone flashing protocol reverse engineering. Software Engineer MxM August 2011  –  May 2012  (10 months) Paris Area, France Working on Critsend, a SMTP relay for developers handling deliverability issues and email analytics. System Administrator - Intern excellency June 2010  –  August 2010  (3 months) Paris Area, France System administration and Python development for Alwaysdata, excellency's managed hosting solution. Site Reliability Engineer Google December 2013  – Present (1 year 9 months) Zurich Site Reliability Engineer Google December 2013  – Present (1 year 9 months) Zurich Python Software Engineer alwaysdata September 2013  –  December 2013  (4 months) Paris Area, France Part time position: porting alwaysdata's frontend HTTP proxy from gevent to a new Python asynchronous API. Python Software Engineer alwaysdata September 2013  –  December 2013  (4 months) Paris Area, France Part time position: porting alwaysdata's frontend HTTP proxy from gevent to a new Python asynchronous API. Student Researcher Epita System and Security Laboratory January 2011  –  September 2013  (2 years 9 months) Paris Area, France Research on computer security, GPGPU programming, reverse engineering on unusual platforms (Gamecube, HP Switch) and development on FPGA boards. Student Researcher Epita System and Security Laboratory January 2011  –  September 2013  (2 years 9 months) Paris Area, France Research on computer security, GPGPU programming, reverse engineering on unusual platforms (Gamecube, HP Switch) and development on FPGA boards. Site Reliability Engineer (Intern) Google March 2013  –  August 2013  (6 months) Zürich Area, Switzerland Designed, developed and improved tools used to make Google services reliable. Site Reliability Engineer (Intern) Google March 2013  –  August 2013  (6 months) Zürich Area, Switzerland Designed, developed and improved tools used to make Google services reliable. Software Engineer Axalot August 2012  –  December 2012  (5 months) Paris, France Development of a data recovery tool for iPhone and Android devices. C#, C, Win32 API, x86 reverse engineering. Work on the whole stack, from the user interface to the low-level phone flashing protocol reverse engineering. Software Engineer Axalot August 2012  –  December 2012  (5 months) Paris, France Development of a data recovery tool for iPhone and Android devices. C#, C, Win32 API, x86 reverse engineering. Work on the whole stack, from the user interface to the low-level phone flashing protocol reverse engineering. Software Engineer MxM August 2011  –  May 2012  (10 months) Paris Area, France Working on Critsend, a SMTP relay for developers handling deliverability issues and email analytics. Software Engineer MxM August 2011  –  May 2012  (10 months) Paris Area, France Working on Critsend, a SMTP relay for developers handling deliverability issues and email analytics. System Administrator - Intern excellency June 2010  –  August 2010  (3 months) Paris Area, France System administration and Python development for Alwaysdata, excellency's managed hosting solution. System Administrator - Intern excellency June 2010  –  August 2010  (3 months) Paris Area, France System administration and Python development for Alwaysdata, excellency's managed hosting solution. Languages English French English French English French Skills Computer Security System Administration Systems Programming Kernel Programming C C++ Kernel x86 Assembly Python Git OCaml Qt Emulation PowerPC Algorithms Shell Scripting Linux Unix Java Programming Computer Science Reverse Engineering Open Source Operating Systems See 9+     See less Skills  Computer Security System Administration Systems Programming Kernel Programming C C++ Kernel x86 Assembly Python Git OCaml Qt Emulation PowerPC Algorithms Shell Scripting Linux Unix Java Programming Computer Science Reverse Engineering Open Source Operating Systems See 9+     See less Computer Security System Administration Systems Programming Kernel Programming C C++ Kernel x86 Assembly Python Git OCaml Qt Emulation PowerPC Algorithms Shell Scripting Linux Unix Java Programming Computer Science Reverse Engineering Open Source Operating Systems See 9+     See less Computer Security System Administration Systems Programming Kernel Programming C C++ Kernel x86 Assembly Python Git OCaml Qt Emulation PowerPC Algorithms Shell Scripting Linux Unix Java Programming Computer Science Reverse Engineering Open Source Operating Systems See 9+     See less Education EPITA: Ingénierie Informatique 2008  – 2013 EPITA: Ingénierie Informatique 2008  – 2013 EPITA: Ingénierie Informatique 2008  – 2013 EPITA: Ingénierie Informatique 2008  – 2013 ", "Summary IT professional with strong background in network and unix system administration. Expertise in supporting multiple domestic and overseas locations. Able to provide third-level support for network, operating system, hardware, and software. Knowledgeable in UNIX, Windows and Macintosh environments. Adept at performing training of technical personnel and end users. Well-developed analysis, troubleshooting, and reporting skills. Experience in system and network administration for large multinational companies. \n \nSpecialties: unix, linux, windows, osx, programming, python, c, bash, scripting, troubleshooting, project management, juniper, cisco Summary IT professional with strong background in network and unix system administration. Expertise in supporting multiple domestic and overseas locations. Able to provide third-level support for network, operating system, hardware, and software. Knowledgeable in UNIX, Windows and Macintosh environments. Adept at performing training of technical personnel and end users. Well-developed analysis, troubleshooting, and reporting skills. Experience in system and network administration for large multinational companies. \n \nSpecialties: unix, linux, windows, osx, programming, python, c, bash, scripting, troubleshooting, project management, juniper, cisco IT professional with strong background in network and unix system administration. Expertise in supporting multiple domestic and overseas locations. Able to provide third-level support for network, operating system, hardware, and software. Knowledgeable in UNIX, Windows and Macintosh environments. Adept at performing training of technical personnel and end users. Well-developed analysis, troubleshooting, and reporting skills. Experience in system and network administration for large multinational companies. \n \nSpecialties: unix, linux, windows, osx, programming, python, c, bash, scripting, troubleshooting, project management, juniper, cisco IT professional with strong background in network and unix system administration. Expertise in supporting multiple domestic and overseas locations. Able to provide third-level support for network, operating system, hardware, and software. Knowledgeable in UNIX, Windows and Macintosh environments. Adept at performing training of technical personnel and end users. Well-developed analysis, troubleshooting, and reporting skills. Experience in system and network administration for large multinational companies. \n \nSpecialties: unix, linux, windows, osx, programming, python, c, bash, scripting, troubleshooting, project management, juniper, cisco Experience Network Engineer Google January 2015  – Present (8 months) Dublin google production operations and automation. Network Automation Engineer Groupon September 2014  – Present (1 year) Ireland Primary Focus: Network automation and provisioning systems. \nSecondary: Network operations and Engineering, design, deployment, configuration and support of the production network. Network Engineer google.com operations Google Ireland February 2011  – Present (4 years 7 months) barrow street dublin Responsibility for maintaining the google.com production network. Site Reliability Engineer (Intern) Google September 2009  –  September 2010  (1 year 1 month) Unix/Linux system administration, python/bash scripting and automation. IT Consultant ircona 2006  –  2010  (4 years) Server, Desktop Network equipment installation configuration and support. Corporate Operations Engineer Google February 2007  –  September 2009  (2 years 8 months) Unix / Linux / Windows Troubleshooting , development and project management. Desktop Support Lead Quinn Direct Insurance 2006  –  2007  (1 year) Desktop Support Team Lead. IT Support Lead Xilinx 2004  –  2005  (1 year) Network Engineer Google January 2015  – Present (8 months) Dublin google production operations and automation. Network Engineer Google January 2015  – Present (8 months) Dublin google production operations and automation. Network Automation Engineer Groupon September 2014  – Present (1 year) Ireland Primary Focus: Network automation and provisioning systems. \nSecondary: Network operations and Engineering, design, deployment, configuration and support of the production network. Network Automation Engineer Groupon September 2014  – Present (1 year) Ireland Primary Focus: Network automation and provisioning systems. \nSecondary: Network operations and Engineering, design, deployment, configuration and support of the production network. Network Engineer google.com operations Google Ireland February 2011  – Present (4 years 7 months) barrow street dublin Responsibility for maintaining the google.com production network. Network Engineer google.com operations Google Ireland February 2011  – Present (4 years 7 months) barrow street dublin Responsibility for maintaining the google.com production network. Site Reliability Engineer (Intern) Google September 2009  –  September 2010  (1 year 1 month) Unix/Linux system administration, python/bash scripting and automation. Site Reliability Engineer (Intern) Google September 2009  –  September 2010  (1 year 1 month) Unix/Linux system administration, python/bash scripting and automation. IT Consultant ircona 2006  –  2010  (4 years) Server, Desktop Network equipment installation configuration and support. IT Consultant ircona 2006  –  2010  (4 years) Server, Desktop Network equipment installation configuration and support. Corporate Operations Engineer Google February 2007  –  September 2009  (2 years 8 months) Unix / Linux / Windows Troubleshooting , development and project management. Corporate Operations Engineer Google February 2007  –  September 2009  (2 years 8 months) Unix / Linux / Windows Troubleshooting , development and project management. Desktop Support Lead Quinn Direct Insurance 2006  –  2007  (1 year) Desktop Support Team Lead. Desktop Support Lead Quinn Direct Insurance 2006  –  2007  (1 year) Desktop Support Team Lead. IT Support Lead Xilinx 2004  –  2005  (1 year) IT Support Lead Xilinx 2004  –  2005  (1 year) Skills Bash Linux C Python TCP/IP Juniper Routing Protocols BGP ISIS OSPF Windows Server Mac OS X Unix Administration Unix System Administration Hardware Technical Support Operating Systems Networking OS X Network Administration Cisco Technologies Juniper Technologies See 8+     See less Skills  Bash Linux C Python TCP/IP Juniper Routing Protocols BGP ISIS OSPF Windows Server Mac OS X Unix Administration Unix System Administration Hardware Technical Support Operating Systems Networking OS X Network Administration Cisco Technologies Juniper Technologies See 8+     See less Bash Linux C Python TCP/IP Juniper Routing Protocols BGP ISIS OSPF Windows Server Mac OS X Unix Administration Unix System Administration Hardware Technical Support Operating Systems Networking OS X Network Administration Cisco Technologies Juniper Technologies See 8+     See less Bash Linux C Python TCP/IP Juniper Routing Protocols BGP ISIS OSPF Windows Server Mac OS X Unix Administration Unix System Administration Hardware Technical Support Operating Systems Networking OS X Network Administration Cisco Technologies Juniper Technologies See 8+     See less Education N/A N/A N/A N/A ", "Summary M.Sc in Computer Science. Summary M.Sc in Computer Science. M.Sc in Computer Science. M.Sc in Computer Science. Experience Software Engineer Google January 2013  – Present (2 years 8 months) Site Reliability Engineer Intern Google July 2012  –  October 2012  (4 months) Mountain View Software Developer DreamLab Onet.pl Sp. z o.o. 2011  –  2012  (1 year) Software Engineer Google January 2013  – Present (2 years 8 months) Software Engineer Google January 2013  – Present (2 years 8 months) Site Reliability Engineer Intern Google July 2012  –  October 2012  (4 months) Mountain View Site Reliability Engineer Intern Google July 2012  –  October 2012  (4 months) Mountain View Software Developer DreamLab Onet.pl Sp. z o.o. 2011  –  2012  (1 year) Software Developer DreamLab Onet.pl Sp. z o.o. 2011  –  2012  (1 year) Skills Python Ruby Ruby on Rails Git C++ Subversion TDD Design Patterns JavaScript OOP Test Driven Development Skills  Python Ruby Ruby on Rails Git C++ Subversion TDD Design Patterns JavaScript OOP Test Driven Development Python Ruby Ruby on Rails Git C++ Subversion TDD Design Patterns JavaScript OOP Test Driven Development Python Ruby Ruby on Rails Git C++ Subversion TDD Design Patterns JavaScript OOP Test Driven Development Education Akademia Górniczo-Hutnicza im. Stanisława Staszica w Krakowie Master of Science (MSc),  Computer Science 2011  – 2012 Akademia Górniczo-Hutnicza im. Stanisława Staszica w Krakowie Bachelor of Science (BSc),  Computer Science 2007  – 2011 Akademia Górniczo-Hutnicza im. Stanisława Staszica w Krakowie Master of Science (MSc),  Computer Science 2011  – 2012 Akademia Górniczo-Hutnicza im. Stanisława Staszica w Krakowie Master of Science (MSc),  Computer Science 2011  – 2012 Akademia Górniczo-Hutnicza im. Stanisława Staszica w Krakowie Master of Science (MSc),  Computer Science 2011  – 2012 Akademia Górniczo-Hutnicza im. Stanisława Staszica w Krakowie Bachelor of Science (BSc),  Computer Science 2007  – 2011 Akademia Górniczo-Hutnicza im. Stanisława Staszica w Krakowie Bachelor of Science (BSc),  Computer Science 2007  – 2011 Akademia Górniczo-Hutnicza im. Stanisława Staszica w Krakowie Bachelor of Science (BSc),  Computer Science 2007  – 2011 ", "Summary Software engineer Specialties:Computer Science Summary Software engineer Specialties:Computer Science Software engineer Specialties:Computer Science Software engineer Specialties:Computer Science Experience Site Reliability Engineer Google August 2013  – Present (2 years 1 month) Zürich Area, Switzerland Software Engineer Intern Doodle September 2012  –  July 2013  (11 months) Zürich Area, Switzerland Member ROSEdu 2009  –  March 2013  (4 years) Bucharest, Romania ROSEdu is a community of programming and open-source software enthusiasts in the educational environment. Our mission is to initiate, support and develop education based on the values of Open Source. My responsabilities include teaching during different laboratories, organizing and planning events. Site Reliability Engineer Intern Google June 2012  –  September 2012  (4 months) London, United Kingdom Software Engineer Intern Google July 2011  –  October 2011  (4 months) Mountain View, California Worked on a project in the Search Infrastructure Team. Acquired experience on software development in a professional and fast paced environment. Had the opportunity to work with large distributed systems and a large codebase. Student Google Summer of Code 2010 May 2010  –  September 2010  (5 months) Bucharest, Romania Developed a calendar plugin for Geeklog. Designed and implemented the user interface, the databases and \nother key features (like the support for recurring events). \n \nI've started to be passionate about web technologies and the way algorithms and data structures accomplish complex requirements. Site Reliability Engineer Google August 2013  – Present (2 years 1 month) Zürich Area, Switzerland Site Reliability Engineer Google August 2013  – Present (2 years 1 month) Zürich Area, Switzerland Software Engineer Intern Doodle September 2012  –  July 2013  (11 months) Zürich Area, Switzerland Software Engineer Intern Doodle September 2012  –  July 2013  (11 months) Zürich Area, Switzerland Member ROSEdu 2009  –  March 2013  (4 years) Bucharest, Romania ROSEdu is a community of programming and open-source software enthusiasts in the educational environment. Our mission is to initiate, support and develop education based on the values of Open Source. My responsabilities include teaching during different laboratories, organizing and planning events. Member ROSEdu 2009  –  March 2013  (4 years) Bucharest, Romania ROSEdu is a community of programming and open-source software enthusiasts in the educational environment. Our mission is to initiate, support and develop education based on the values of Open Source. My responsabilities include teaching during different laboratories, organizing and planning events. Site Reliability Engineer Intern Google June 2012  –  September 2012  (4 months) London, United Kingdom Site Reliability Engineer Intern Google June 2012  –  September 2012  (4 months) London, United Kingdom Software Engineer Intern Google July 2011  –  October 2011  (4 months) Mountain View, California Worked on a project in the Search Infrastructure Team. Acquired experience on software development in a professional and fast paced environment. Had the opportunity to work with large distributed systems and a large codebase. Software Engineer Intern Google July 2011  –  October 2011  (4 months) Mountain View, California Worked on a project in the Search Infrastructure Team. Acquired experience on software development in a professional and fast paced environment. Had the opportunity to work with large distributed systems and a large codebase. Student Google Summer of Code 2010 May 2010  –  September 2010  (5 months) Bucharest, Romania Developed a calendar plugin for Geeklog. Designed and implemented the user interface, the databases and \nother key features (like the support for recurring events). \n \nI've started to be passionate about web technologies and the way algorithms and data structures accomplish complex requirements. Student Google Summer of Code 2010 May 2010  –  September 2010  (5 months) Bucharest, Romania Developed a calendar plugin for Geeklog. Designed and implemented the user interface, the databases and \nother key features (like the support for recurring events). \n \nI've started to be passionate about web technologies and the way algorithms and data structures accomplish complex requirements. Skills C C++ Software Engineering Web Development Distributed Systems Data Structures Algorithms Git Open Source Operating Systems Programming Skills  C C++ Software Engineering Web Development Distributed Systems Data Structures Algorithms Git Open Source Operating Systems Programming C C++ Software Engineering Web Development Distributed Systems Data Structures Algorithms Git Open Source Operating Systems Programming C C++ Software Engineering Web Development Distributed Systems Data Structures Algorithms Git Open Source Operating Systems Programming Education Universitatea „Politehnica” din București Bachelor's degree,  Computer Engineering 2008  – 2012 Universitatea „Politehnica” din București Bachelor's degree,  Computer Engineering 2008  – 2012 Universitatea „Politehnica” din București Bachelor's degree,  Computer Engineering 2008  – 2012 Universitatea „Politehnica” din București Bachelor's degree,  Computer Engineering 2008  – 2012 ", "Summary I push bytes around for a living. Oftentimes, it involves C/C++, Linux, distributed systems and some other fiddly bits. You can write me if you're curious. Summary I push bytes around for a living. Oftentimes, it involves C/C++, Linux, distributed systems and some other fiddly bits. You can write me if you're curious. I push bytes around for a living. Oftentimes, it involves C/C++, Linux, distributed systems and some other fiddly bits. You can write me if you're curious. I push bytes around for a living. Oftentimes, it involves C/C++, Linux, distributed systems and some other fiddly bits. You can write me if you're curious. Honors & Awards Additional Honors & Awards 3rd place in ACM competition for best bachelor thesis in Czech Republic and Slovakia Additional Honors & Awards 3rd place in ACM competition for best bachelor thesis in Czech Republic and Slovakia Additional Honors & Awards 3rd place in ACM competition for best bachelor thesis in Czech Republic and Slovakia Additional Honors & Awards 3rd place in ACM competition for best bachelor thesis in Czech Republic and Slovakia ", "Summary Since I was a child, I had a strong vocation in technology, the same that inspires every day scientists, engineers, while exploring our Universe or just understanding how things work. \n \nSoftware engineering is my daily bread, creating scalable, reliable architectures is the foundation of my daily job, the spark that spins me up in the morning. \n \nI’ve spent the majority of my work life between being a Software Engineer for embedded or large scale systems, and a Site Reliability Engineer (SRE), running services at scale, and making them scale even more. \n \nI have a strong leadership vocation and love working in challenging environments as individual contributor of a team. Summary Since I was a child, I had a strong vocation in technology, the same that inspires every day scientists, engineers, while exploring our Universe or just understanding how things work. \n \nSoftware engineering is my daily bread, creating scalable, reliable architectures is the foundation of my daily job, the spark that spins me up in the morning. \n \nI’ve spent the majority of my work life between being a Software Engineer for embedded or large scale systems, and a Site Reliability Engineer (SRE), running services at scale, and making them scale even more. \n \nI have a strong leadership vocation and love working in challenging environments as individual contributor of a team. Since I was a child, I had a strong vocation in technology, the same that inspires every day scientists, engineers, while exploring our Universe or just understanding how things work. \n \nSoftware engineering is my daily bread, creating scalable, reliable architectures is the foundation of my daily job, the spark that spins me up in the morning. \n \nI’ve spent the majority of my work life between being a Software Engineer for embedded or large scale systems, and a Site Reliability Engineer (SRE), running services at scale, and making them scale even more. \n \nI have a strong leadership vocation and love working in challenging environments as individual contributor of a team. Since I was a child, I had a strong vocation in technology, the same that inspires every day scientists, engineers, while exploring our Universe or just understanding how things work. \n \nSoftware engineering is my daily bread, creating scalable, reliable architectures is the foundation of my daily job, the spark that spins me up in the morning. \n \nI’ve spent the majority of my work life between being a Software Engineer for embedded or large scale systems, and a Site Reliability Engineer (SRE), running services at scale, and making them scale even more. \n \nI have a strong leadership vocation and love working in challenging environments as individual contributor of a team. Experience Site Reliability Engineer Google April 2014  – Present (1 year 5 months) Dublin, Ireland I am part of the team that runs MySQL at scale at Google, in the Dublin office. Since April 2015, I became the Technical Leader of the team. Trouble Solver² Gentoo Foundation September 2009  – Present (6 years) The interweb I contribute to the Gentoo Linux project in my free time. I've been maintaining key components like Genkernel, systemd, KDE, GNOME. Founder and Master Sabayon Linux 2004  – Present (11 years) The interweb I founded Sabayon in 2004, to fulfil my selfish home server related needs while I was still a high school student. I currently lead the Sabayon Linux project in my free time. Site Reliability Engineer Intern Google September 2012  –  February 2013  (6 months) Dublin I was interning in the team that runs MySQL at scale at Google. Software Engineer / Site Reliability Engineer (SWE-SRE) Weswit Srl June 2010  –  September 2012  (2 years 4 months) Milan Area, Italy I contributed to the development of the Lightstreamer real-time server during that period. \nI also maintained the cloud infrastructure running Lightstreamer services. Software Engineer Myself April 2008  –  August 2012  (4 years 5 months) Milan Area, Italy I contributed to the realization of various SWE projects as contractor. Ranging from embedded systems to Desktop and Mobile applications. Software Engineer ITSME Srl 2009  –  2010  (1 year) Milan Area, Italy I contributed to the technical direction and development of ITSME (a \"venue\" based OS UI) in its early stages of development. Site Reliability Engineer Google April 2014  – Present (1 year 5 months) Dublin, Ireland I am part of the team that runs MySQL at scale at Google, in the Dublin office. Since April 2015, I became the Technical Leader of the team. Site Reliability Engineer Google April 2014  – Present (1 year 5 months) Dublin, Ireland I am part of the team that runs MySQL at scale at Google, in the Dublin office. Since April 2015, I became the Technical Leader of the team. Trouble Solver² Gentoo Foundation September 2009  – Present (6 years) The interweb I contribute to the Gentoo Linux project in my free time. I've been maintaining key components like Genkernel, systemd, KDE, GNOME. Trouble Solver² Gentoo Foundation September 2009  – Present (6 years) The interweb I contribute to the Gentoo Linux project in my free time. I've been maintaining key components like Genkernel, systemd, KDE, GNOME. Founder and Master Sabayon Linux 2004  – Present (11 years) The interweb I founded Sabayon in 2004, to fulfil my selfish home server related needs while I was still a high school student. I currently lead the Sabayon Linux project in my free time. Founder and Master Sabayon Linux 2004  – Present (11 years) The interweb I founded Sabayon in 2004, to fulfil my selfish home server related needs while I was still a high school student. I currently lead the Sabayon Linux project in my free time. Site Reliability Engineer Intern Google September 2012  –  February 2013  (6 months) Dublin I was interning in the team that runs MySQL at scale at Google. Site Reliability Engineer Intern Google September 2012  –  February 2013  (6 months) Dublin I was interning in the team that runs MySQL at scale at Google. Software Engineer / Site Reliability Engineer (SWE-SRE) Weswit Srl June 2010  –  September 2012  (2 years 4 months) Milan Area, Italy I contributed to the development of the Lightstreamer real-time server during that period. \nI also maintained the cloud infrastructure running Lightstreamer services. Software Engineer / Site Reliability Engineer (SWE-SRE) Weswit Srl June 2010  –  September 2012  (2 years 4 months) Milan Area, Italy I contributed to the development of the Lightstreamer real-time server during that period. \nI also maintained the cloud infrastructure running Lightstreamer services. Software Engineer Myself April 2008  –  August 2012  (4 years 5 months) Milan Area, Italy I contributed to the realization of various SWE projects as contractor. Ranging from embedded systems to Desktop and Mobile applications. Software Engineer Myself April 2008  –  August 2012  (4 years 5 months) Milan Area, Italy I contributed to the realization of various SWE projects as contractor. Ranging from embedded systems to Desktop and Mobile applications. Software Engineer ITSME Srl 2009  –  2010  (1 year) Milan Area, Italy I contributed to the technical direction and development of ITSME (a \"venue\" based OS UI) in its early stages of development. Software Engineer ITSME Srl 2009  –  2010  (1 year) Milan Area, Italy I contributed to the technical direction and development of ITSME (a \"venue\" based OS UI) in its early stages of development. Languages   Skills Linux Software Development Free Software Computer Science Java Web Applications Operating Systems Open Source C# HTML Programming CVS Scripting UML C Software Engineering Security PHP Web Services Web Development Apache Bash Python Subversion Git Android Unix Shell Scripting MySQL Shell Scripting Eclipse See 15+     See less Skills  Linux Software Development Free Software Computer Science Java Web Applications Operating Systems Open Source C# HTML Programming CVS Scripting UML C Software Engineering Security PHP Web Services Web Development Apache Bash Python Subversion Git Android Unix Shell Scripting MySQL Shell Scripting Eclipse See 15+     See less Linux Software Development Free Software Computer Science Java Web Applications Operating Systems Open Source C# HTML Programming CVS Scripting UML C Software Engineering Security PHP Web Services Web Development Apache Bash Python Subversion Git Android Unix Shell Scripting MySQL Shell Scripting Eclipse See 15+     See less Linux Software Development Free Software Computer Science Java Web Applications Operating Systems Open Source C# HTML Programming CVS Scripting UML C Software Engineering Security PHP Web Services Web Development Apache Bash Python Subversion Git Android Unix Shell Scripting MySQL Shell Scripting Eclipse See 15+     See less ", "Experience Software Engineer Google February 2014  – Present (1 year 7 months) Cracow, Poland Software Engineering Intern Google July 2013  –  October 2013  (4 months) Mountain View, California, United States Site Reliability Engineer intern Google July 2012  –  October 2012  (4 months) Zürich Area, Switzerland Google Summer of Code 2011 OpenMRS April 2011  –  September 2011  (6 months) Keywords: Java/JavaEE, Hibernate, Spring, JavaScript, jQuery, REST \nSource code: https://source.openmrs.org/user/bryq \nFinal presentation: http://www.youtube.com/watch?v=BhnURq8psaQ Software Engineer Google February 2014  – Present (1 year 7 months) Cracow, Poland Software Engineer Google February 2014  – Present (1 year 7 months) Cracow, Poland Software Engineering Intern Google July 2013  –  October 2013  (4 months) Mountain View, California, United States Software Engineering Intern Google July 2013  –  October 2013  (4 months) Mountain View, California, United States Site Reliability Engineer intern Google July 2012  –  October 2012  (4 months) Zürich Area, Switzerland Site Reliability Engineer intern Google July 2012  –  October 2012  (4 months) Zürich Area, Switzerland Google Summer of Code 2011 OpenMRS April 2011  –  September 2011  (6 months) Keywords: Java/JavaEE, Hibernate, Spring, JavaScript, jQuery, REST \nSource code: https://source.openmrs.org/user/bryq \nFinal presentation: http://www.youtube.com/watch?v=BhnURq8psaQ Google Summer of Code 2011 OpenMRS April 2011  –  September 2011  (6 months) Keywords: Java/JavaEE, Hibernate, Spring, JavaScript, jQuery, REST \nSource code: https://source.openmrs.org/user/bryq \nFinal presentation: http://www.youtube.com/watch?v=BhnURq8psaQ Languages Polish Native or bilingual proficiency English Professional working proficiency Polish Native or bilingual proficiency English Professional working proficiency Polish Native or bilingual proficiency English Professional working proficiency Native or bilingual proficiency Professional working proficiency Skills Java Python C++ C JavaScript MySQL SQL Unix Google Closure Skills  Java Python C++ C JavaScript MySQL SQL Unix Google Closure Java Python C++ C JavaScript MySQL SQL Unix Google Closure Java Python C++ C JavaScript MySQL SQL Unix Google Closure Education AGH University of Science and Technology in Cracow Bachelor of Science (BSc),  Computer Science 2010  – 2014 AGH University of Science and Technology in Cracow Bachelor of Science (BSc),  Computer Science 2010  – 2014 AGH University of Science and Technology in Cracow Bachelor of Science (BSc),  Computer Science 2010  – 2014 AGH University of Science and Technology in Cracow Bachelor of Science (BSc),  Computer Science 2010  – 2014 Honors & Awards ", "Summary I've recently finished my PhD in Electrical and Computer Engineering at the University of British Columbia. My advisor was Matei Ripeanu, and I worked in the NetSysLab.  \n \nMy research focused on automating the configuration of intermediate storage systems.  \nI was also involved in the Totem project (Graph Processing in Hybrid Architectures).  \n \n \nPast: \n \nDuring the summers of 2009, 2010, and 2013 I had a great time at Google as an intern for the Site Reliability Engineering team for ContentAds (2009), and as Software Engineer intern for the Cluster Management team (2010), and the Google Feedback team (2013) in Mountain View, CA, USA.  \n \nBefore starting at UBC, I worked at the LSD (Distributed Systems Lab) of UFCG (Universidade Federal de Campina Grande) in Brazil where I worked as software engineer and assistant researcher (2006-2008), and I concluded my undergraduate (2003) and MSc studies (2005) contributing to OurGrid project. As part of my research in OurGrid, I undertook an internship at Hewlett Packard Labs in Palo Alto, CA, USA. In 2008, I was also an intern at Fraunhofer ITWM in Kaiserslautern, Germany contributing to their Jawari project for three months. Summary I've recently finished my PhD in Electrical and Computer Engineering at the University of British Columbia. My advisor was Matei Ripeanu, and I worked in the NetSysLab.  \n \nMy research focused on automating the configuration of intermediate storage systems.  \nI was also involved in the Totem project (Graph Processing in Hybrid Architectures).  \n \n \nPast: \n \nDuring the summers of 2009, 2010, and 2013 I had a great time at Google as an intern for the Site Reliability Engineering team for ContentAds (2009), and as Software Engineer intern for the Cluster Management team (2010), and the Google Feedback team (2013) in Mountain View, CA, USA.  \n \nBefore starting at UBC, I worked at the LSD (Distributed Systems Lab) of UFCG (Universidade Federal de Campina Grande) in Brazil where I worked as software engineer and assistant researcher (2006-2008), and I concluded my undergraduate (2003) and MSc studies (2005) contributing to OurGrid project. As part of my research in OurGrid, I undertook an internship at Hewlett Packard Labs in Palo Alto, CA, USA. In 2008, I was also an intern at Fraunhofer ITWM in Kaiserslautern, Germany contributing to their Jawari project for three months. I've recently finished my PhD in Electrical and Computer Engineering at the University of British Columbia. My advisor was Matei Ripeanu, and I worked in the NetSysLab.  \n \nMy research focused on automating the configuration of intermediate storage systems.  \nI was also involved in the Totem project (Graph Processing in Hybrid Architectures).  \n \n \nPast: \n \nDuring the summers of 2009, 2010, and 2013 I had a great time at Google as an intern for the Site Reliability Engineering team for ContentAds (2009), and as Software Engineer intern for the Cluster Management team (2010), and the Google Feedback team (2013) in Mountain View, CA, USA.  \n \nBefore starting at UBC, I worked at the LSD (Distributed Systems Lab) of UFCG (Universidade Federal de Campina Grande) in Brazil where I worked as software engineer and assistant researcher (2006-2008), and I concluded my undergraduate (2003) and MSc studies (2005) contributing to OurGrid project. As part of my research in OurGrid, I undertook an internship at Hewlett Packard Labs in Palo Alto, CA, USA. In 2008, I was also an intern at Fraunhofer ITWM in Kaiserslautern, Germany contributing to their Jawari project for three months. I've recently finished my PhD in Electrical and Computer Engineering at the University of British Columbia. My advisor was Matei Ripeanu, and I worked in the NetSysLab.  \n \nMy research focused on automating the configuration of intermediate storage systems.  \nI was also involved in the Totem project (Graph Processing in Hybrid Architectures).  \n \n \nPast: \n \nDuring the summers of 2009, 2010, and 2013 I had a great time at Google as an intern for the Site Reliability Engineering team for ContentAds (2009), and as Software Engineer intern for the Cluster Management team (2010), and the Google Feedback team (2013) in Mountain View, CA, USA.  \n \nBefore starting at UBC, I worked at the LSD (Distributed Systems Lab) of UFCG (Universidade Federal de Campina Grande) in Brazil where I worked as software engineer and assistant researcher (2006-2008), and I concluded my undergraduate (2003) and MSc studies (2005) contributing to OurGrid project. As part of my research in OurGrid, I undertook an internship at Hewlett Packard Labs in Palo Alto, CA, USA. In 2008, I was also an intern at Fraunhofer ITWM in Kaiserslautern, Germany contributing to their Jawari project for three months. Experience Software Engineer Google December 2014  – Present (9 months) Kitchener, Canada Area Research Assistant University of British Columbia September 2008  –  November 2014  (6 years 3 months) Vancouver, Canada Area Software Engineer Intern Google May 2013  –  August 2013  (4 months) Mountain View, CA Software Engineer at Google Feedback Group  \n Enhancements to handling Android Crash Report for Google Feedback  \n Java, bash, Google internal technology Software Engineer Intern Google June 2010  –  September 2010  (4 months) Software Engineer at Cluster Management group  \n Enhancements in Google protocol buffers specifically to Cluster Management group  \n Improvements in the automatic integration process to test new versions of the system in a testbed  \n C++, Python, Google protocol buffers, Google internal technology Site Reliability Engineer Intern Google June 2009  –  September 2009  (4 months) - Site Reliability Engineering team for ContentAds/AdSense \n- Load balancing, Google internal technology Software Engineer Intern Fraunhofer ITWM March 2008  –  June 2008  (4 months) Development of Jawari, a Grid Computing benchmarking service. Part of the D-Grid Initiative. Details  \nat www.jawari.net  \n Java, Globus, OurGrid, Unicore, Linux, Postgresql, JBoss, Linux, Shell Script Software Eng. and Researcher Universidade Federal de Campina Grande - UFCG / Laboratório de Sistemas Distribuídos January 2006  –  March 2008  (2 years 3 months) Campina Grande Area, Brazil Research, design and implementation of NodeWiz, a Peer-to-Peer and fault-tolerant resource discovery  \nsystem \n Design and implementation of OurGrid software. Details at www.ourgrid.org  \n Java, RMI, Jabber based communication, Linux, Shell Script Visiting Scholar - Intern Hewlett-Packard Laboratories September 2006  –  November 2006  (3 months) Palo Alto, California •\tResearch and development of NodeWiz, a Peer-to-Peer and fault-tolerant resource discovery system \n•\tJava, RMI, Jabber event-based communication, PlanetLab Network Administrator CEFET/AL (current Instituto Federal de Educação, Ciência e Tecnologia de Alagoas) March 1999  –  December 1999  (10 months) Maceió Area, Brazil •\tSystem and network administration of CEFET’s Laboratories \n•\tLinux, Windows NT Software Engineer Google December 2014  – Present (9 months) Kitchener, Canada Area Software Engineer Google December 2014  – Present (9 months) Kitchener, Canada Area Research Assistant University of British Columbia September 2008  –  November 2014  (6 years 3 months) Vancouver, Canada Area Research Assistant University of British Columbia September 2008  –  November 2014  (6 years 3 months) Vancouver, Canada Area Software Engineer Intern Google May 2013  –  August 2013  (4 months) Mountain View, CA Software Engineer at Google Feedback Group  \n Enhancements to handling Android Crash Report for Google Feedback  \n Java, bash, Google internal technology Software Engineer Intern Google May 2013  –  August 2013  (4 months) Mountain View, CA Software Engineer at Google Feedback Group  \n Enhancements to handling Android Crash Report for Google Feedback  \n Java, bash, Google internal technology Software Engineer Intern Google June 2010  –  September 2010  (4 months) Software Engineer at Cluster Management group  \n Enhancements in Google protocol buffers specifically to Cluster Management group  \n Improvements in the automatic integration process to test new versions of the system in a testbed  \n C++, Python, Google protocol buffers, Google internal technology Software Engineer Intern Google June 2010  –  September 2010  (4 months) Software Engineer at Cluster Management group  \n Enhancements in Google protocol buffers specifically to Cluster Management group  \n Improvements in the automatic integration process to test new versions of the system in a testbed  \n C++, Python, Google protocol buffers, Google internal technology Site Reliability Engineer Intern Google June 2009  –  September 2009  (4 months) - Site Reliability Engineering team for ContentAds/AdSense \n- Load balancing, Google internal technology Site Reliability Engineer Intern Google June 2009  –  September 2009  (4 months) - Site Reliability Engineering team for ContentAds/AdSense \n- Load balancing, Google internal technology Software Engineer Intern Fraunhofer ITWM March 2008  –  June 2008  (4 months) Development of Jawari, a Grid Computing benchmarking service. Part of the D-Grid Initiative. Details  \nat www.jawari.net  \n Java, Globus, OurGrid, Unicore, Linux, Postgresql, JBoss, Linux, Shell Script Software Engineer Intern Fraunhofer ITWM March 2008  –  June 2008  (4 months) Development of Jawari, a Grid Computing benchmarking service. Part of the D-Grid Initiative. Details  \nat www.jawari.net  \n Java, Globus, OurGrid, Unicore, Linux, Postgresql, JBoss, Linux, Shell Script Software Eng. and Researcher Universidade Federal de Campina Grande - UFCG / Laboratório de Sistemas Distribuídos January 2006  –  March 2008  (2 years 3 months) Campina Grande Area, Brazil Research, design and implementation of NodeWiz, a Peer-to-Peer and fault-tolerant resource discovery  \nsystem \n Design and implementation of OurGrid software. Details at www.ourgrid.org  \n Java, RMI, Jabber based communication, Linux, Shell Script Software Eng. and Researcher Universidade Federal de Campina Grande - UFCG / Laboratório de Sistemas Distribuídos January 2006  –  March 2008  (2 years 3 months) Campina Grande Area, Brazil Research, design and implementation of NodeWiz, a Peer-to-Peer and fault-tolerant resource discovery  \nsystem \n Design and implementation of OurGrid software. Details at www.ourgrid.org  \n Java, RMI, Jabber based communication, Linux, Shell Script Visiting Scholar - Intern Hewlett-Packard Laboratories September 2006  –  November 2006  (3 months) Palo Alto, California •\tResearch and development of NodeWiz, a Peer-to-Peer and fault-tolerant resource discovery system \n•\tJava, RMI, Jabber event-based communication, PlanetLab Visiting Scholar - Intern Hewlett-Packard Laboratories September 2006  –  November 2006  (3 months) Palo Alto, California •\tResearch and development of NodeWiz, a Peer-to-Peer and fault-tolerant resource discovery system \n•\tJava, RMI, Jabber event-based communication, PlanetLab Network Administrator CEFET/AL (current Instituto Federal de Educação, Ciência e Tecnologia de Alagoas) March 1999  –  December 1999  (10 months) Maceió Area, Brazil •\tSystem and network administration of CEFET’s Laboratories \n•\tLinux, Windows NT Network Administrator CEFET/AL (current Instituto Federal de Educação, Ciência e Tecnologia de Alagoas) March 1999  –  December 1999  (10 months) Maceió Area, Brazil •\tSystem and network administration of CEFET’s Laboratories \n•\tLinux, Windows NT Languages English Full professional proficiency Portuguese Native or bilingual proficiency English Full professional proficiency Portuguese Native or bilingual proficiency English Full professional proficiency Portuguese Native or bilingual proficiency Full professional proficiency Native or bilingual proficiency Skills Distributed Systems Eclipse Java Shell Scripting Linux Grid Computing TCP/IP RMI Peer-to-peer Computer Science Algorithms Machine Learning Python Software Engineering Parallel Computing C++ C LaTeX Bash Programming Software Development PostgreSQL Data Mining See 8+     See less Skills  Distributed Systems Eclipse Java Shell Scripting Linux Grid Computing TCP/IP RMI Peer-to-peer Computer Science Algorithms Machine Learning Python Software Engineering Parallel Computing C++ C LaTeX Bash Programming Software Development PostgreSQL Data Mining See 8+     See less Distributed Systems Eclipse Java Shell Scripting Linux Grid Computing TCP/IP RMI Peer-to-peer Computer Science Algorithms Machine Learning Python Software Engineering Parallel Computing C++ C LaTeX Bash Programming Software Development PostgreSQL Data Mining See 8+     See less Distributed Systems Eclipse Java Shell Scripting Linux Grid Computing TCP/IP RMI Peer-to-peer Computer Science Algorithms Machine Learning Python Software Engineering Parallel Computing C++ C LaTeX Bash Programming Software Development PostgreSQL Data Mining See 8+     See less Education The University of British Columbia PhD,  Electrical and Computer Engineering 2008  – 2014 I've recently finished my PhD in Electrical and Computer Engineering at the University of British Columbia. My advisor was Matei Ripeanu, and I worked in the NetSysLab.  \n \nMy research focused on automating the configuration of intermediate storage systems.  \nI was also involved in the Totem project (Graph Processing in Hybrid Architectures). Activities and Societies:  Totem -- Graph processing on heterogeneous CPU and GPU platforms http://netsyslab.ece.ubc.ca/wiki/index.php/Totem\nMosaStore -- Storage system integrating contributory storage http://netsyslab.ece.ubc.ca/wiki/index.php/MosaStore Universidade Federal de Campina Grande (UFCG) M.Sc.,  Computer Science 2004  – 2005 Activities and Societies:  http://www.ourgrid.org Universidade Federal de Campina Grande (UFCG) BS,  Computer Science 2000  – 2003 Professor Átila Augusto Freitas de Almeida Award \nFor best academic performances among graduates of Technology and Science Center from Federal University \nof Campina Grande - CCT / UFCG Activities and Societies:  http://ourgrid.org Centro Federal de Educação Tecnológica de Alagoas Technical,  Computer Science 1996  – 1999 The University of British Columbia PhD,  Electrical and Computer Engineering 2008  – 2014 I've recently finished my PhD in Electrical and Computer Engineering at the University of British Columbia. My advisor was Matei Ripeanu, and I worked in the NetSysLab.  \n \nMy research focused on automating the configuration of intermediate storage systems.  \nI was also involved in the Totem project (Graph Processing in Hybrid Architectures). Activities and Societies:  Totem -- Graph processing on heterogeneous CPU and GPU platforms http://netsyslab.ece.ubc.ca/wiki/index.php/Totem\nMosaStore -- Storage system integrating contributory storage http://netsyslab.ece.ubc.ca/wiki/index.php/MosaStore The University of British Columbia PhD,  Electrical and Computer Engineering 2008  – 2014 I've recently finished my PhD in Electrical and Computer Engineering at the University of British Columbia. My advisor was Matei Ripeanu, and I worked in the NetSysLab.  \n \nMy research focused on automating the configuration of intermediate storage systems.  \nI was also involved in the Totem project (Graph Processing in Hybrid Architectures). Activities and Societies:  Totem -- Graph processing on heterogeneous CPU and GPU platforms http://netsyslab.ece.ubc.ca/wiki/index.php/Totem\nMosaStore -- Storage system integrating contributory storage http://netsyslab.ece.ubc.ca/wiki/index.php/MosaStore The University of British Columbia PhD,  Electrical and Computer Engineering 2008  – 2014 I've recently finished my PhD in Electrical and Computer Engineering at the University of British Columbia. My advisor was Matei Ripeanu, and I worked in the NetSysLab.  \n \nMy research focused on automating the configuration of intermediate storage systems.  \nI was also involved in the Totem project (Graph Processing in Hybrid Architectures). Activities and Societies:  Totem -- Graph processing on heterogeneous CPU and GPU platforms http://netsyslab.ece.ubc.ca/wiki/index.php/Totem\nMosaStore -- Storage system integrating contributory storage http://netsyslab.ece.ubc.ca/wiki/index.php/MosaStore Universidade Federal de Campina Grande (UFCG) M.Sc.,  Computer Science 2004  – 2005 Activities and Societies:  http://www.ourgrid.org Universidade Federal de Campina Grande (UFCG) M.Sc.,  Computer Science 2004  – 2005 Activities and Societies:  http://www.ourgrid.org Universidade Federal de Campina Grande (UFCG) M.Sc.,  Computer Science 2004  – 2005 Activities and Societies:  http://www.ourgrid.org Universidade Federal de Campina Grande (UFCG) BS,  Computer Science 2000  – 2003 Professor Átila Augusto Freitas de Almeida Award \nFor best academic performances among graduates of Technology and Science Center from Federal University \nof Campina Grande - CCT / UFCG Activities and Societies:  http://ourgrid.org Universidade Federal de Campina Grande (UFCG) BS,  Computer Science 2000  – 2003 Professor Átila Augusto Freitas de Almeida Award \nFor best academic performances among graduates of Technology and Science Center from Federal University \nof Campina Grande - CCT / UFCG Activities and Societies:  http://ourgrid.org Universidade Federal de Campina Grande (UFCG) BS,  Computer Science 2000  – 2003 Professor Átila Augusto Freitas de Almeida Award \nFor best academic performances among graduates of Technology and Science Center from Federal University \nof Campina Grande - CCT / UFCG Activities and Societies:  http://ourgrid.org Centro Federal de Educação Tecnológica de Alagoas Technical,  Computer Science 1996  – 1999 Centro Federal de Educação Tecnológica de Alagoas Technical,  Computer Science 1996  – 1999 Centro Federal de Educação Tecnológica de Alagoas Technical,  Computer Science 1996  – 1999 Honors & Awards Fulbright International Science and Technology Award Fulbright To support PhD studies in the USA. \nDeclined to start at UBC. Additional Honors & Awards Professor Átila Augusto Freitas de Almeida Award \nSecond best academic performance of Technology and Sciences Center of Federal University of Campina Grande - CCT / UFCG Fulbright International Science and Technology Award Fulbright To support PhD studies in the USA. \nDeclined to start at UBC. Fulbright International Science and Technology Award Fulbright To support PhD studies in the USA. \nDeclined to start at UBC. Fulbright International Science and Technology Award Fulbright To support PhD studies in the USA. \nDeclined to start at UBC. Additional Honors & Awards Professor Átila Augusto Freitas de Almeida Award \nSecond best academic performance of Technology and Sciences Center of Federal University of Campina Grande - CCT / UFCG Additional Honors & Awards Professor Átila Augusto Freitas de Almeida Award \nSecond best academic performance of Technology and Sciences Center of Federal University of Campina Grande - CCT / UFCG Additional Honors & Awards Professor Átila Augusto Freitas de Almeida Award \nSecond best academic performance of Technology and Sciences Center of Federal University of Campina Grande - CCT / UFCG ", "Experience Site Reliability Engineer Google August 2015  – Present (1 month) Zürich Area, Switzerland Consultant Electronic Frontier Foundation March 2015  –  July 2015  (5 months) IT Administrator TOY Advertising Company June 2012  –  July 2015  (3 years 2 months) Sosnowiec, Silesian District, Poland Rebuilt and secured whole network infrastructure of about 30 devices, mainly Windows PCs and printers. Deployed FreeBSD firewall and router serving additionally as NAS, Windows Domain Controller with roaming profiles (Samba) and SSO with LDAP backend. RADIUS for enterprise Wi-Fi, OpenVPN and IPSec for the remote access. Everyday support and help desk. IT Officer New College JCR June 2012  –  June 2015  (3 years 1 month) Oxford IT helpdesk for students and consultancy for the JCR committee. Managed SLES server running Nginx+Apache, Mailman, Postfix, MySQL and related services; integration with college and university SSO. Provided virtual webhosting for college societies. Created the new JCR Website based on the Plone CMS with self-written custom content types for i.a. tailored motion submitting system, room database, wine ordering. Systems Administration Co-ordinator The Oxford University Computer Society April 2012  –  June 2015  (3 years 3 months) Oxford, United Kingdom Setup of new main Debian server and the data migration from its predecessor. Maintenance of i.a. OpenLDAP, PostgreSQL, Nginx, Mailman, git repositories hosting. Ansible configuration management. Working in a team of sysadmins in a complex environment build throughout 30 years of the society existence. Site Reliability Engineer Intern Google July 2014  –  October 2014  (4 months) Zürich Area, Switzerland Researched, designed and implemented (Python) automation system and policy for quota and resource management interface for both humans (CLI) and already existing automation. Complex environment, cooperation with experienced SREs and Technical Project Managers. \n \nGmail team. Developer HallSurfing.co.uk March 2012  –  November 2012  (9 months) Oxford, United Kingdom Maintained, optimized and co-developed Django web application for Oxford startup used daily by a few hundred university students. Improved system deployment. Junior IT Admin Stanisław Staszic 4th High School in Sosnowiec 2009  –  2011  (2 years) Sosnowiec, Silesian District, Poland Managed school website based on Joomla and administered school network devices including Ubuntu webserver. Provided general IT support for students and school staff. Set up of sync and backup service (using Unison) for the committee files. Created the SIS project. Site Reliability Engineer Google August 2015  – Present (1 month) Zürich Area, Switzerland Site Reliability Engineer Google August 2015  – Present (1 month) Zürich Area, Switzerland Consultant Electronic Frontier Foundation March 2015  –  July 2015  (5 months) Consultant Electronic Frontier Foundation March 2015  –  July 2015  (5 months) IT Administrator TOY Advertising Company June 2012  –  July 2015  (3 years 2 months) Sosnowiec, Silesian District, Poland Rebuilt and secured whole network infrastructure of about 30 devices, mainly Windows PCs and printers. Deployed FreeBSD firewall and router serving additionally as NAS, Windows Domain Controller with roaming profiles (Samba) and SSO with LDAP backend. RADIUS for enterprise Wi-Fi, OpenVPN and IPSec for the remote access. Everyday support and help desk. IT Administrator TOY Advertising Company June 2012  –  July 2015  (3 years 2 months) Sosnowiec, Silesian District, Poland Rebuilt and secured whole network infrastructure of about 30 devices, mainly Windows PCs and printers. Deployed FreeBSD firewall and router serving additionally as NAS, Windows Domain Controller with roaming profiles (Samba) and SSO with LDAP backend. RADIUS for enterprise Wi-Fi, OpenVPN and IPSec for the remote access. Everyday support and help desk. IT Officer New College JCR June 2012  –  June 2015  (3 years 1 month) Oxford IT helpdesk for students and consultancy for the JCR committee. Managed SLES server running Nginx+Apache, Mailman, Postfix, MySQL and related services; integration with college and university SSO. Provided virtual webhosting for college societies. Created the new JCR Website based on the Plone CMS with self-written custom content types for i.a. tailored motion submitting system, room database, wine ordering. IT Officer New College JCR June 2012  –  June 2015  (3 years 1 month) Oxford IT helpdesk for students and consultancy for the JCR committee. Managed SLES server running Nginx+Apache, Mailman, Postfix, MySQL and related services; integration with college and university SSO. Provided virtual webhosting for college societies. Created the new JCR Website based on the Plone CMS with self-written custom content types for i.a. tailored motion submitting system, room database, wine ordering. Systems Administration Co-ordinator The Oxford University Computer Society April 2012  –  June 2015  (3 years 3 months) Oxford, United Kingdom Setup of new main Debian server and the data migration from its predecessor. Maintenance of i.a. OpenLDAP, PostgreSQL, Nginx, Mailman, git repositories hosting. Ansible configuration management. Working in a team of sysadmins in a complex environment build throughout 30 years of the society existence. Systems Administration Co-ordinator The Oxford University Computer Society April 2012  –  June 2015  (3 years 3 months) Oxford, United Kingdom Setup of new main Debian server and the data migration from its predecessor. Maintenance of i.a. OpenLDAP, PostgreSQL, Nginx, Mailman, git repositories hosting. Ansible configuration management. Working in a team of sysadmins in a complex environment build throughout 30 years of the society existence. Site Reliability Engineer Intern Google July 2014  –  October 2014  (4 months) Zürich Area, Switzerland Researched, designed and implemented (Python) automation system and policy for quota and resource management interface for both humans (CLI) and already existing automation. Complex environment, cooperation with experienced SREs and Technical Project Managers. \n \nGmail team. Site Reliability Engineer Intern Google July 2014  –  October 2014  (4 months) Zürich Area, Switzerland Researched, designed and implemented (Python) automation system and policy for quota and resource management interface for both humans (CLI) and already existing automation. Complex environment, cooperation with experienced SREs and Technical Project Managers. \n \nGmail team. Developer HallSurfing.co.uk March 2012  –  November 2012  (9 months) Oxford, United Kingdom Maintained, optimized and co-developed Django web application for Oxford startup used daily by a few hundred university students. Improved system deployment. Developer HallSurfing.co.uk March 2012  –  November 2012  (9 months) Oxford, United Kingdom Maintained, optimized and co-developed Django web application for Oxford startup used daily by a few hundred university students. Improved system deployment. Junior IT Admin Stanisław Staszic 4th High School in Sosnowiec 2009  –  2011  (2 years) Sosnowiec, Silesian District, Poland Managed school website based on Joomla and administered school network devices including Ubuntu webserver. Provided general IT support for students and school staff. Set up of sync and backup service (using Unison) for the committee files. Created the SIS project. Junior IT Admin Stanisław Staszic 4th High School in Sosnowiec 2009  –  2011  (2 years) Sosnowiec, Silesian District, Poland Managed school website based on Joomla and administered school network devices including Ubuntu webserver. Provided general IT support for students and school staff. Set up of sync and backup service (using Unison) for the committee files. Created the SIS project. Languages Polish Native or bilingual proficiency English Full professional proficiency Russian Elementary proficiency Polish Native or bilingual proficiency English Full professional proficiency Russian Elementary proficiency Polish Native or bilingual proficiency English Full professional proficiency Russian Elementary proficiency Native or bilingual proficiency Full professional proficiency Elementary proficiency Skills Python Linux SQL Java MySQL Scala Haskell OCaml Shell Scripting Computer Science Open Source FreeBSD Debian SLES PostgreSQL SELinux Ejabberd Mailman Nginx Apache Samba OpenVPN IPSec RADIUS PF ZeroMQ Protocol Buffers OOP Pyramid Flask SQLAlchemy Django Plone Munin Nagios See 20+     See less Skills  Python Linux SQL Java MySQL Scala Haskell OCaml Shell Scripting Computer Science Open Source FreeBSD Debian SLES PostgreSQL SELinux Ejabberd Mailman Nginx Apache Samba OpenVPN IPSec RADIUS PF ZeroMQ Protocol Buffers OOP Pyramid Flask SQLAlchemy Django Plone Munin Nagios See 20+     See less Python Linux SQL Java MySQL Scala Haskell OCaml Shell Scripting Computer Science Open Source FreeBSD Debian SLES PostgreSQL SELinux Ejabberd Mailman Nginx Apache Samba OpenVPN IPSec RADIUS PF ZeroMQ Protocol Buffers OOP Pyramid Flask SQLAlchemy Django Plone Munin Nagios See 20+     See less Python Linux SQL Java MySQL Scala Haskell OCaml Shell Scripting Computer Science Open Source FreeBSD Debian SLES PostgreSQL SELinux Ejabberd Mailman Nginx Apache Samba OpenVPN IPSec RADIUS PF ZeroMQ Protocol Buffers OOP Pyramid Flask SQLAlchemy Django Plone Munin Nagios See 20+     See less Education University of Oxford MCompSci,  Computer Science 2011  – 2015 Activities and Societies:  Oxford Computer Society Stanisław Staszic 4th High School in Sosnowiec Maths ,  Physics ,  IT 1900  – 2011 One of the best high schools in Poland Activities and Societies:  Head of the Student Council 25th Bilingual Junior High School in Sosnowiec 2005  – 2008 One of the best junior high schools in Poland University of Oxford MCompSci,  Computer Science 2011  – 2015 Activities and Societies:  Oxford Computer Society University of Oxford MCompSci,  Computer Science 2011  – 2015 Activities and Societies:  Oxford Computer Society University of Oxford MCompSci,  Computer Science 2011  – 2015 Activities and Societies:  Oxford Computer Society Stanisław Staszic 4th High School in Sosnowiec Maths ,  Physics ,  IT 1900  – 2011 One of the best high schools in Poland Activities and Societies:  Head of the Student Council Stanisław Staszic 4th High School in Sosnowiec Maths ,  Physics ,  IT 1900  – 2011 One of the best high schools in Poland Activities and Societies:  Head of the Student Council Stanisław Staszic 4th High School in Sosnowiec Maths ,  Physics ,  IT 1900  – 2011 One of the best high schools in Poland Activities and Societies:  Head of the Student Council 25th Bilingual Junior High School in Sosnowiec 2005  – 2008 One of the best junior high schools in Poland 25th Bilingual Junior High School in Sosnowiec 2005  – 2008 One of the best junior high schools in Poland 25th Bilingual Junior High School in Sosnowiec 2005  – 2008 One of the best junior high schools in Poland Honors & Awards ", "Experience Site Reliability Engineer Google May 2009  – Present (6 years 4 months) New York City Member of the Storage SRE team, taking care of GFS and Bigtable among other internal Google technologies. Researcher Universitat Politècnica de Catalunya July 2007  –  May 2009  (1 year 11 months) Working as a researcher in Computer Architecture and Operating Systems while working on my master's degree (accomplished) and Ph.D. (on hold). Site Reliability Engineer Intern Google July 2008  –  November 2008  (5 months) New York Site Reliability Engineer Google May 2009  – Present (6 years 4 months) New York City Member of the Storage SRE team, taking care of GFS and Bigtable among other internal Google technologies. Site Reliability Engineer Google May 2009  – Present (6 years 4 months) New York City Member of the Storage SRE team, taking care of GFS and Bigtable among other internal Google technologies. Researcher Universitat Politècnica de Catalunya July 2007  –  May 2009  (1 year 11 months) Working as a researcher in Computer Architecture and Operating Systems while working on my master's degree (accomplished) and Ph.D. (on hold). Researcher Universitat Politècnica de Catalunya July 2007  –  May 2009  (1 year 11 months) Working as a researcher in Computer Architecture and Operating Systems while working on my master's degree (accomplished) and Ph.D. (on hold). Site Reliability Engineer Intern Google July 2008  –  November 2008  (5 months) New York Site Reliability Engineer Intern Google July 2008  –  November 2008  (5 months) New York Languages English Full professional proficiency Spanish Native or bilingual proficiency Catalan Native or bilingual proficiency Korean Elementary proficiency English Full professional proficiency Spanish Native or bilingual proficiency Catalan Native or bilingual proficiency Korean Elementary proficiency English Full professional proficiency Spanish Native or bilingual proficiency Catalan Native or bilingual proficiency Korean Elementary proficiency Full professional proficiency Native or bilingual proficiency Native or bilingual proficiency Elementary proficiency Skills Operating Systems Shell Scripting Python C Linux C++ Software Engineering Distributed Systems NetBSD Testing Subversion Git Perl Java Unix LaTeX Unix Shell Scripting FreeBSD See 3+     See less Skills  Operating Systems Shell Scripting Python C Linux C++ Software Engineering Distributed Systems NetBSD Testing Subversion Git Perl Java Unix LaTeX Unix Shell Scripting FreeBSD See 3+     See less Operating Systems Shell Scripting Python C Linux C++ Software Engineering Distributed Systems NetBSD Testing Subversion Git Perl Java Unix LaTeX Unix Shell Scripting FreeBSD See 3+     See less Operating Systems Shell Scripting Python C Linux C++ Software Engineering Distributed Systems NetBSD Testing Subversion Git Perl Java Unix LaTeX Unix Shell Scripting FreeBSD See 3+     See less Education Universitat Politècnica de Catalunya Master's,  Computer Architecture , Networks and Systems 2007  – 2008 Universitat Politècnica de Catalunya Bachelor's,  Computer Engineering 2002  – 2007 Universitat Politècnica de Catalunya Master's,  Computer Architecture , Networks and Systems 2007  – 2008 Universitat Politècnica de Catalunya Master's,  Computer Architecture , Networks and Systems 2007  – 2008 Universitat Politècnica de Catalunya Master's,  Computer Architecture , Networks and Systems 2007  – 2008 Universitat Politècnica de Catalunya Bachelor's,  Computer Engineering 2002  – 2007 Universitat Politècnica de Catalunya Bachelor's,  Computer Engineering 2002  – 2007 Universitat Politècnica de Catalunya Bachelor's,  Computer Engineering 2002  – 2007 ", "Experience Site Reliability Engineer Intern Google March 2015  – Present (6 months) Zurich Founder Candle Path January 2015  – Present (8 months) Software Engineering Intern Microblink December 2014  –  February 2015  (3 months) Zagreb Real time standard (85.60 × 53.98 mm) card detection algorithm for mobile phones written in C++. Technical Associate Intern - Enterprise Team Google June 2014  –  November 2014  (6 months) Paris Area, France Demo sales applications based on Google Enterprise products using Java, Javascript and Python. Software Engineering Intern zoomMediaPlus March 2014  –  June 2014  (4 months) Zagreb Worked on an end to end testing framework written in Python. Software Engineering Intern Raverus August 2013  –  November 2013  (4 months) Zagreb Web Development in C# (ASP.NET and DevExpress) Site Reliability Engineer Intern Google March 2015  – Present (6 months) Zurich Site Reliability Engineer Intern Google March 2015  – Present (6 months) Zurich Founder Candle Path January 2015  – Present (8 months) Founder Candle Path January 2015  – Present (8 months) Software Engineering Intern Microblink December 2014  –  February 2015  (3 months) Zagreb Real time standard (85.60 × 53.98 mm) card detection algorithm for mobile phones written in C++. Software Engineering Intern Microblink December 2014  –  February 2015  (3 months) Zagreb Real time standard (85.60 × 53.98 mm) card detection algorithm for mobile phones written in C++. Technical Associate Intern - Enterprise Team Google June 2014  –  November 2014  (6 months) Paris Area, France Demo sales applications based on Google Enterprise products using Java, Javascript and Python. Technical Associate Intern - Enterprise Team Google June 2014  –  November 2014  (6 months) Paris Area, France Demo sales applications based on Google Enterprise products using Java, Javascript and Python. Software Engineering Intern zoomMediaPlus March 2014  –  June 2014  (4 months) Zagreb Worked on an end to end testing framework written in Python. Software Engineering Intern zoomMediaPlus March 2014  –  June 2014  (4 months) Zagreb Worked on an end to end testing framework written in Python. Software Engineering Intern Raverus August 2013  –  November 2013  (4 months) Zagreb Web Development in C# (ASP.NET and DevExpress) Software Engineering Intern Raverus August 2013  –  November 2013  (4 months) Zagreb Web Development in C# (ASP.NET and DevExpress) Languages Croatian Native or bilingual proficiency English Professional working proficiency German Professional working proficiency Croatian Native or bilingual proficiency English Professional working proficiency German Professional working proficiency Croatian Native or bilingual proficiency English Professional working proficiency German Professional working proficiency Native or bilingual proficiency Professional working proficiency Professional working proficiency Skills Algorithms C++ Data Structures Java Eclipse C# Python OOP JavaScript Machine Learning Hand Tools Evolutionary Algorithms Artificial Intelligence HTML Teamwork CSS Genetic Algorithms Game Theory SQL Web Development Django Unix Google App Engine Android Development Mobile Applications See 10+     See less Skills  Algorithms C++ Data Structures Java Eclipse C# Python OOP JavaScript Machine Learning Hand Tools Evolutionary Algorithms Artificial Intelligence HTML Teamwork CSS Genetic Algorithms Game Theory SQL Web Development Django Unix Google App Engine Android Development Mobile Applications See 10+     See less Algorithms C++ Data Structures Java Eclipse C# Python OOP JavaScript Machine Learning Hand Tools Evolutionary Algorithms Artificial Intelligence HTML Teamwork CSS Genetic Algorithms Game Theory SQL Web Development Django Unix Google App Engine Android Development Mobile Applications See 10+     See less Algorithms C++ Data Structures Java Eclipse C# Python OOP JavaScript Machine Learning Hand Tools Evolutionary Algorithms Artificial Intelligence HTML Teamwork CSS Genetic Algorithms Game Theory SQL Web Development Django Unix Google App Engine Android Development Mobile Applications See 10+     See less Education University of Zagreb/Sveuciliste u Zagrebu Computer Science 2012  – 2015 V. Gimnazija 2008  – 2012 University of Zagreb/Sveuciliste u Zagrebu Computer Science 2012  – 2015 University of Zagreb/Sveuciliste u Zagrebu Computer Science 2012  – 2015 University of Zagreb/Sveuciliste u Zagrebu Computer Science 2012  – 2015 V. Gimnazija 2008  – 2012 V. Gimnazija 2008  – 2012 V. Gimnazija 2008  – 2012 Honors & Awards ", "Experience Site Reliability Engineer Google July 2015  – Present (2 months) Zürich Area, Switzerland Dremel Site Reliability Engineer  Junior Programmer Gameloft October 2014  – Present (11 months) Bucharest, Romania Site Reliability Engineer Intern Google July 2014  –  October 2014  (4 months) Trainee Google 2013  –  2013  (less than a year) Zurich Site Reliability Engineer Google July 2015  – Present (2 months) Zürich Area, Switzerland Dremel Site Reliability Engineer  Site Reliability Engineer Google July 2015  – Present (2 months) Zürich Area, Switzerland Dremel Site Reliability Engineer  Junior Programmer Gameloft October 2014  – Present (11 months) Bucharest, Romania Junior Programmer Gameloft October 2014  – Present (11 months) Bucharest, Romania Site Reliability Engineer Intern Google July 2014  –  October 2014  (4 months) Site Reliability Engineer Intern Google July 2014  –  October 2014  (4 months) Trainee Google 2013  –  2013  (less than a year) Zurich Trainee Google 2013  –  2013  (less than a year) Zurich Languages English Professional working proficiency Romanian Native or bilingual proficiency Japanese Elementary proficiency English Professional working proficiency Romanian Native or bilingual proficiency Japanese Elementary proficiency English Professional working proficiency Romanian Native or bilingual proficiency Japanese Elementary proficiency Professional working proficiency Native or bilingual proficiency Elementary proficiency Skills C++ Programming C Java Data Structures Algorithms English Teamwork OOP Core Java Operating Systems Multithreading Distributed Systems Communication Protocols Skills  C++ Programming C Java Data Structures Algorithms English Teamwork OOP Core Java Operating Systems Multithreading Distributed Systems Communication Protocols C++ Programming C Java Data Structures Algorithms English Teamwork OOP Core Java Operating Systems Multithreading Distributed Systems Communication Protocols C++ Programming C Java Data Structures Algorithms English Teamwork OOP Core Java Operating Systems Multithreading Distributed Systems Communication Protocols Education Universitatea „Politehnica” din București Computer Science 2011  – 2015 I learned and took exams, wtf? Activities and Societies:  ACM contest ,  \"Hard & Soft\" international contest Universitatea „Politehnica” din București Computer Science 2011  – 2015 I learned and took exams, wtf? Activities and Societies:  ACM contest ,  \"Hard & Soft\" international contest Universitatea „Politehnica” din București Computer Science 2011  – 2015 I learned and took exams, wtf? Activities and Societies:  ACM contest ,  \"Hard & Soft\" international contest Universitatea „Politehnica” din București Computer Science 2011  – 2015 I learned and took exams, wtf? Activities and Societies:  ACM contest ,  \"Hard & Soft\" international contest ", "Summary Specialties:Checkpointing. Reversible debuggers. Debuggers. Deterministic replay. High-performance computing. Large space enumeration problems using disk as primary storage. Summary Specialties:Checkpointing. Reversible debuggers. Debuggers. Deterministic replay. High-performance computing. Large space enumeration problems using disk as primary storage. Specialties:Checkpointing. Reversible debuggers. Debuggers. Deterministic replay. High-performance computing. Large space enumeration problems using disk as primary storage. Specialties:Checkpointing. Reversible debuggers. Debuggers. Deterministic replay. High-performance computing. Large space enumeration problems using disk as primary storage. Experience Software Engineer Google June 2012  – Present (3 years 3 months) Mountain View PhD Student Northeastern University October 2006  –  May 2012  (5 years 8 months) Greater Boston Area Thesis title: \"Temporal Meta-programming: treating time as a spatial dimension\". Research Intern Joint Institute for Computational Sciences (University of Tennessee and Oak Ridge National Lab) May 2011  –  August 2011  (4 months) Worked on reversibly debugging MADNESS (Multiresolution ADaptiveNumErical Scientific Simulation), a general purpose parallel programming environment. Site Reliability Engineer Intern Google May 2010  –  August 2010  (4 months) Developed a proxy, a profiles collector and profiles analyzer, for the Geo-SRE group. Software Development Engineer Intern Bloomberg LP June 2009  –  August 2009  (3 months) Redesigned and implemented 3 internal tools (~10,000 LOC Pascal) in C++ and JavaScript, for the Mortgages CMO Group. Software Development Engineer Intern NetApp Inc May 2008  –  August 2008  (4 months) Designed, implemented and integrated an increase to the number of snapshots stored to disk, by a factor of 10, for the WAFL File System Group. Software Engineer Google June 2012  – Present (3 years 3 months) Mountain View Software Engineer Google June 2012  – Present (3 years 3 months) Mountain View PhD Student Northeastern University October 2006  –  May 2012  (5 years 8 months) Greater Boston Area Thesis title: \"Temporal Meta-programming: treating time as a spatial dimension\". PhD Student Northeastern University October 2006  –  May 2012  (5 years 8 months) Greater Boston Area Thesis title: \"Temporal Meta-programming: treating time as a spatial dimension\". Research Intern Joint Institute for Computational Sciences (University of Tennessee and Oak Ridge National Lab) May 2011  –  August 2011  (4 months) Worked on reversibly debugging MADNESS (Multiresolution ADaptiveNumErical Scientific Simulation), a general purpose parallel programming environment. Research Intern Joint Institute for Computational Sciences (University of Tennessee and Oak Ridge National Lab) May 2011  –  August 2011  (4 months) Worked on reversibly debugging MADNESS (Multiresolution ADaptiveNumErical Scientific Simulation), a general purpose parallel programming environment. Site Reliability Engineer Intern Google May 2010  –  August 2010  (4 months) Developed a proxy, a profiles collector and profiles analyzer, for the Geo-SRE group. Site Reliability Engineer Intern Google May 2010  –  August 2010  (4 months) Developed a proxy, a profiles collector and profiles analyzer, for the Geo-SRE group. Software Development Engineer Intern Bloomberg LP June 2009  –  August 2009  (3 months) Redesigned and implemented 3 internal tools (~10,000 LOC Pascal) in C++ and JavaScript, for the Mortgages CMO Group. Software Development Engineer Intern Bloomberg LP June 2009  –  August 2009  (3 months) Redesigned and implemented 3 internal tools (~10,000 LOC Pascal) in C++ and JavaScript, for the Mortgages CMO Group. Software Development Engineer Intern NetApp Inc May 2008  –  August 2008  (4 months) Designed, implemented and integrated an increase to the number of snapshots stored to disk, by a factor of 10, for the WAFL File System Group. Software Development Engineer Intern NetApp Inc May 2008  –  August 2008  (4 months) Designed, implemented and integrated an increase to the number of snapshots stored to disk, by a factor of 10, for the WAFL File System Group. Education Northeastern University PhD,  Computer Science 2006  – 2012 Member of the High-Performance Computing Lab. Politechnica University of Bucharest BSc,  Computer Science 2001  – 2006 Mircea cel Batran Highschool Northeastern University PhD,  Computer Science 2006  – 2012 Member of the High-Performance Computing Lab. Northeastern University PhD,  Computer Science 2006  – 2012 Member of the High-Performance Computing Lab. Northeastern University PhD,  Computer Science 2006  – 2012 Member of the High-Performance Computing Lab. Politechnica University of Bucharest BSc,  Computer Science 2001  – 2006 Politechnica University of Bucharest BSc,  Computer Science 2001  – 2006 Politechnica University of Bucharest BSc,  Computer Science 2001  – 2006 Mircea cel Batran Highschool Mircea cel Batran Highschool Mircea cel Batran Highschool ", "Summary I'm a Computer Engineering PhD working on the Ganeti virtualization cluster management software at Google. \n \nDuring my PhD I worked on languages, virtual machines and code transformation for exploiting modern computer architectures and, in particular, my PhD thesis was on machine learning techniques applied to compilers. \n \nAs a side topic, I also did research on multiagent systems to manage electrical power networks. \n \nMy coding experience includes working on four different compilers (LLVM, GCC, ILDJIT, Petabricks) and implementing a code generator for ARM processors as part of the backend of ILDJIT. \nI designed and implemented from scratch a semantic search engine for finding related concepts inside a set of documents even if they are expressed with different words.  \nI contributed code to an opensource CMS (FlatNuke).  \nI also worked on many other personal or university-related smaller projects, and as a webmaster for several websites. \n \nI’ve worked extensively with the following languages: C, C++, Python, Java, ASP classic, Visual Basic, Bash Scripting.  \nI also have basic knowledge of C# and PHP. \n \nOther interests of mine include operating systems, artificial intelligence and web programming. \n \nDuring the university time, I was a member of the Politecnico di Milano \"Tower of Hanoi\" team, participating in various international computer security competitions. \n \nMy Erdös number is 3. Summary I'm a Computer Engineering PhD working on the Ganeti virtualization cluster management software at Google. \n \nDuring my PhD I worked on languages, virtual machines and code transformation for exploiting modern computer architectures and, in particular, my PhD thesis was on machine learning techniques applied to compilers. \n \nAs a side topic, I also did research on multiagent systems to manage electrical power networks. \n \nMy coding experience includes working on four different compilers (LLVM, GCC, ILDJIT, Petabricks) and implementing a code generator for ARM processors as part of the backend of ILDJIT. \nI designed and implemented from scratch a semantic search engine for finding related concepts inside a set of documents even if they are expressed with different words.  \nI contributed code to an opensource CMS (FlatNuke).  \nI also worked on many other personal or university-related smaller projects, and as a webmaster for several websites. \n \nI’ve worked extensively with the following languages: C, C++, Python, Java, ASP classic, Visual Basic, Bash Scripting.  \nI also have basic knowledge of C# and PHP. \n \nOther interests of mine include operating systems, artificial intelligence and web programming. \n \nDuring the university time, I was a member of the Politecnico di Milano \"Tower of Hanoi\" team, participating in various international computer security competitions. \n \nMy Erdös number is 3. I'm a Computer Engineering PhD working on the Ganeti virtualization cluster management software at Google. \n \nDuring my PhD I worked on languages, virtual machines and code transformation for exploiting modern computer architectures and, in particular, my PhD thesis was on machine learning techniques applied to compilers. \n \nAs a side topic, I also did research on multiagent systems to manage electrical power networks. \n \nMy coding experience includes working on four different compilers (LLVM, GCC, ILDJIT, Petabricks) and implementing a code generator for ARM processors as part of the backend of ILDJIT. \nI designed and implemented from scratch a semantic search engine for finding related concepts inside a set of documents even if they are expressed with different words.  \nI contributed code to an opensource CMS (FlatNuke).  \nI also worked on many other personal or university-related smaller projects, and as a webmaster for several websites. \n \nI’ve worked extensively with the following languages: C, C++, Python, Java, ASP classic, Visual Basic, Bash Scripting.  \nI also have basic knowledge of C# and PHP. \n \nOther interests of mine include operating systems, artificial intelligence and web programming. \n \nDuring the university time, I was a member of the Politecnico di Milano \"Tower of Hanoi\" team, participating in various international computer security competitions. \n \nMy Erdös number is 3. I'm a Computer Engineering PhD working on the Ganeti virtualization cluster management software at Google. \n \nDuring my PhD I worked on languages, virtual machines and code transformation for exploiting modern computer architectures and, in particular, my PhD thesis was on machine learning techniques applied to compilers. \n \nAs a side topic, I also did research on multiagent systems to manage electrical power networks. \n \nMy coding experience includes working on four different compilers (LLVM, GCC, ILDJIT, Petabricks) and implementing a code generator for ARM processors as part of the backend of ILDJIT. \nI designed and implemented from scratch a semantic search engine for finding related concepts inside a set of documents even if they are expressed with different words.  \nI contributed code to an opensource CMS (FlatNuke).  \nI also worked on many other personal or university-related smaller projects, and as a webmaster for several websites. \n \nI’ve worked extensively with the following languages: C, C++, Python, Java, ASP classic, Visual Basic, Bash Scripting.  \nI also have basic knowledge of C# and PHP. \n \nOther interests of mine include operating systems, artificial intelligence and web programming. \n \nDuring the university time, I was a member of the Politecnico di Milano \"Tower of Hanoi\" team, participating in various international computer security competitions. \n \nMy Erdös number is 3. Experience Software Engineer Google May 2013  – Present (2 years 4 months) Munich Area, Germany Ganeti core developer Software Engineer Google May 2013  – Present (2 years 4 months) Munich Area, Germany Ganeti core developer Software Engineer Google May 2013  – Present (2 years 4 months) Munich Area, Germany Ganeti core developer Languages Inglese Full professional proficiency Italiano Native or bilingual proficiency Inglese Full professional proficiency Italiano Native or bilingual proficiency Inglese Full professional proficiency Italiano Native or bilingual proficiency Full professional proficiency Native or bilingual proficiency Skills C Linux Java Python C++ Haskell Compilers Machine learning Iterative compilation Visual Basic ARM9 Shell Scripting Algorithms Software Design Computer Science Open Source Machine Learning Intelligenza artificiale Informatica PHP Bash See 6+     See less Skills  C Linux Java Python C++ Haskell Compilers Machine learning Iterative compilation Visual Basic ARM9 Shell Scripting Algorithms Software Design Computer Science Open Source Machine Learning Intelligenza artificiale Informatica PHP Bash See 6+     See less C Linux Java Python C++ Haskell Compilers Machine learning Iterative compilation Visual Basic ARM9 Shell Scripting Algorithms Software Design Computer Science Open Source Machine Learning Intelligenza artificiale Informatica PHP Bash See 6+     See less C Linux Java Python C++ Haskell Compilers Machine learning Iterative compilation Visual Basic ARM9 Shell Scripting Algorithms Software Design Computer Science Open Source Machine Learning Intelligenza artificiale Informatica PHP Bash See 6+     See less Honors & Awards ", "Experience Software Engineer Google February 2013  – Present (2 years 7 months) Developer Debian April 2009  – Present (6 years 5 months) Software Engineer Google February 2013  – Present (2 years 7 months) Software Engineer Google February 2013  – Present (2 years 7 months) Developer Debian April 2009  – Present (6 years 5 months) Developer Debian April 2009  – Present (6 years 5 months) Languages Italian Native or bilingual proficiency English Full professional proficiency French Professional working proficiency German Elementary proficiency Italian Native or bilingual proficiency English Full professional proficiency French Professional working proficiency German Elementary proficiency Italian Native or bilingual proficiency English Full professional proficiency French Professional working proficiency German Elementary proficiency Native or bilingual proficiency Full professional proficiency Professional working proficiency Elementary proficiency Skills Shell scripting C C++ Python TCP/IP System administration Network administration Network Security LAMP MPEG-4 Go Puppet Cisco IOS MongoDB Varnish Linux Debian Systems Programming Shell Scripting DNS System Administration See 6+     See less Skills  Shell scripting C C++ Python TCP/IP System administration Network administration Network Security LAMP MPEG-4 Go Puppet Cisco IOS MongoDB Varnish Linux Debian Systems Programming Shell Scripting DNS System Administration See 6+     See less Shell scripting C C++ Python TCP/IP System administration Network administration Network Security LAMP MPEG-4 Go Puppet Cisco IOS MongoDB Varnish Linux Debian Systems Programming Shell Scripting DNS System Administration See 6+     See less Shell scripting C C++ Python TCP/IP System administration Network administration Network Security LAMP MPEG-4 Go Puppet Cisco IOS MongoDB Varnish Linux Debian Systems Programming Shell Scripting DNS System Administration See 6+     See less ", "Summary I have background in computer science and mathematics and have experience in software engineering, especially design and implementation of parallel algorithms for computationally demanding numerical problems on CPU clusters (MPI) and on GPU (CUDA). Currently I am pursuing my Ph.D. studies in these areas at Cranfield University, after which I am planning to continue work in research & development either at university or in the industry. Specialties:parallel programming (MPI), GPU programming (CUDA), operations research, discrete optimisation, metaheuristics, C++, Java, numerical solvers for partial differential equations Summary I have background in computer science and mathematics and have experience in software engineering, especially design and implementation of parallel algorithms for computationally demanding numerical problems on CPU clusters (MPI) and on GPU (CUDA). Currently I am pursuing my Ph.D. studies in these areas at Cranfield University, after which I am planning to continue work in research & development either at university or in the industry. Specialties:parallel programming (MPI), GPU programming (CUDA), operations research, discrete optimisation, metaheuristics, C++, Java, numerical solvers for partial differential equations I have background in computer science and mathematics and have experience in software engineering, especially design and implementation of parallel algorithms for computationally demanding numerical problems on CPU clusters (MPI) and on GPU (CUDA). Currently I am pursuing my Ph.D. studies in these areas at Cranfield University, after which I am planning to continue work in research & development either at university or in the industry. Specialties:parallel programming (MPI), GPU programming (CUDA), operations research, discrete optimisation, metaheuristics, C++, Java, numerical solvers for partial differential equations I have background in computer science and mathematics and have experience in software engineering, especially design and implementation of parallel algorithms for computationally demanding numerical problems on CPU clusters (MPI) and on GPU (CUDA). Currently I am pursuing my Ph.D. studies in these areas at Cranfield University, after which I am planning to continue work in research & development either at university or in the industry. Specialties:parallel programming (MPI), GPU programming (CUDA), operations research, discrete optimisation, metaheuristics, C++, Java, numerical solvers for partial differential equations Experience Site Reliability Engineer Google July 2014  – Present (1 year 2 months) Zürich Area, Switzerland Researcher / Teaching Assistant Cranfield University October 2010  –  May 2014  (3 years 8 months) Cranfield Research on performing large-scale scientific computing on advanced parallel architectures, involving multi-core CPUs and many-core GPUs. \n \nFurthermore, I have prepared and delivered lectures and practical lab sessions of a short course on General Purpose Programming on Graphics Processing Units (GPGPU). Site Reliability Engineer - Intern Google March 2012  –  September 2012  (7 months) Zürich Area, Switzerland I was part of the team developing cluster management application in C++ and Python. .NET Developer SMT Software August 2007  –  December 2007  (5 months) I was part of the team developing .NET applications for large industrial partners (mostly in C#). Site Reliability Engineer Google July 2014  – Present (1 year 2 months) Zürich Area, Switzerland Site Reliability Engineer Google July 2014  – Present (1 year 2 months) Zürich Area, Switzerland Researcher / Teaching Assistant Cranfield University October 2010  –  May 2014  (3 years 8 months) Cranfield Research on performing large-scale scientific computing on advanced parallel architectures, involving multi-core CPUs and many-core GPUs. \n \nFurthermore, I have prepared and delivered lectures and practical lab sessions of a short course on General Purpose Programming on Graphics Processing Units (GPGPU). Researcher / Teaching Assistant Cranfield University October 2010  –  May 2014  (3 years 8 months) Cranfield Research on performing large-scale scientific computing on advanced parallel architectures, involving multi-core CPUs and many-core GPUs. \n \nFurthermore, I have prepared and delivered lectures and practical lab sessions of a short course on General Purpose Programming on Graphics Processing Units (GPGPU). Site Reliability Engineer - Intern Google March 2012  –  September 2012  (7 months) Zürich Area, Switzerland I was part of the team developing cluster management application in C++ and Python. Site Reliability Engineer - Intern Google March 2012  –  September 2012  (7 months) Zürich Area, Switzerland I was part of the team developing cluster management application in C++ and Python. .NET Developer SMT Software August 2007  –  December 2007  (5 months) I was part of the team developing .NET applications for large industrial partners (mostly in C#). .NET Developer SMT Software August 2007  –  December 2007  (5 months) I was part of the team developing .NET applications for large industrial partners (mostly in C#). Languages Polish Native or bilingual proficiency English Full professional proficiency German Elementary proficiency Polish Native or bilingual proficiency English Full professional proficiency German Elementary proficiency Polish Native or bilingual proficiency English Full professional proficiency German Elementary proficiency Native or bilingual proficiency Full professional proficiency Elementary proficiency Skills C++ Java C# MPI CUDA Operations Research Parallel Programming GPGPU Numerical Analysis GPU OpenMP C Optimisation SQL Linux Visual Studio Parallel Computing Algorithms Parallel Algorithms Eclipse LaTeX Matlab High Performance... Software Engineering Computer Science Subversion Software Development Distributed Systems Python See 14+     See less Skills  C++ Java C# MPI CUDA Operations Research Parallel Programming GPGPU Numerical Analysis GPU OpenMP C Optimisation SQL Linux Visual Studio Parallel Computing Algorithms Parallel Algorithms Eclipse LaTeX Matlab High Performance... Software Engineering Computer Science Subversion Software Development Distributed Systems Python See 14+     See less C++ Java C# MPI CUDA Operations Research Parallel Programming GPGPU Numerical Analysis GPU OpenMP C Optimisation SQL Linux Visual Studio Parallel Computing Algorithms Parallel Algorithms Eclipse LaTeX Matlab High Performance... Software Engineering Computer Science Subversion Software Development Distributed Systems Python See 14+     See less C++ Java C# MPI CUDA Operations Research Parallel Programming GPGPU Numerical Analysis GPU OpenMP C Optimisation SQL Linux Visual Studio Parallel Computing Algorithms Parallel Algorithms Eclipse LaTeX Matlab High Performance... Software Engineering Computer Science Subversion Software Development Distributed Systems Python See 14+     See less Education Cranfield University Doctor of Philosophy (PhD),  Computer Science ,  Distributed and Parallel Computing 2010  – 2014 Activities and Societies:  President of Cranfield University Handball Club ,  Walk Guide in Cranfield University Walking Club ,  Member of Cranfield University Football Club ,  Member of Cranfield University Badminton Club University of Wroclaw B.Sc.,  Mathematics in Economy and Insurances 2007  – 2010 Cranfield University M.Sc.,  Comutational and Software Techniques in Engineering with option Grid Computing and e-Engineering 2008  – 2009 University of Wroclaw M.Sc.,  Computer Science 2003  – 2008 I was interested in software engineering, operations research and parallel algorithms design. During studies I was part of three 4-months team (4-6 people) software engineering projects. I was a project manager for two of these projects. The main goal was to create relatively large pieces of software following the good software development practices. This include complete documentation (vision, architecture, network protocols, code) and unit testing with coverage analysis. \n \nI was also involved in design of algorithms for discrete optimisation problems (e.g. Flowshop). One of them proved to be particularly effective and it became a main subject of my M.Sc. thesis. \n \nDuring studies I have developed applications in: C, C++ (with MPI), Java, C#, Pascal, PHP, SML, Ada and Smalltalk. Activities and Societies:  KSI Students Association ,  Football Club ,  Badminton Club Cranfield University Doctor of Philosophy (PhD),  Computer Science ,  Distributed and Parallel Computing 2010  – 2014 Activities and Societies:  President of Cranfield University Handball Club ,  Walk Guide in Cranfield University Walking Club ,  Member of Cranfield University Football Club ,  Member of Cranfield University Badminton Club Cranfield University Doctor of Philosophy (PhD),  Computer Science ,  Distributed and Parallel Computing 2010  – 2014 Activities and Societies:  President of Cranfield University Handball Club ,  Walk Guide in Cranfield University Walking Club ,  Member of Cranfield University Football Club ,  Member of Cranfield University Badminton Club Cranfield University Doctor of Philosophy (PhD),  Computer Science ,  Distributed and Parallel Computing 2010  – 2014 Activities and Societies:  President of Cranfield University Handball Club ,  Walk Guide in Cranfield University Walking Club ,  Member of Cranfield University Football Club ,  Member of Cranfield University Badminton Club University of Wroclaw B.Sc.,  Mathematics in Economy and Insurances 2007  – 2010 University of Wroclaw B.Sc.,  Mathematics in Economy and Insurances 2007  – 2010 University of Wroclaw B.Sc.,  Mathematics in Economy and Insurances 2007  – 2010 Cranfield University M.Sc.,  Comutational and Software Techniques in Engineering with option Grid Computing and e-Engineering 2008  – 2009 Cranfield University M.Sc.,  Comutational and Software Techniques in Engineering with option Grid Computing and e-Engineering 2008  – 2009 Cranfield University M.Sc.,  Comutational and Software Techniques in Engineering with option Grid Computing and e-Engineering 2008  – 2009 University of Wroclaw M.Sc.,  Computer Science 2003  – 2008 I was interested in software engineering, operations research and parallel algorithms design. During studies I was part of three 4-months team (4-6 people) software engineering projects. I was a project manager for two of these projects. The main goal was to create relatively large pieces of software following the good software development practices. This include complete documentation (vision, architecture, network protocols, code) and unit testing with coverage analysis. \n \nI was also involved in design of algorithms for discrete optimisation problems (e.g. Flowshop). One of them proved to be particularly effective and it became a main subject of my M.Sc. thesis. \n \nDuring studies I have developed applications in: C, C++ (with MPI), Java, C#, Pascal, PHP, SML, Ada and Smalltalk. Activities and Societies:  KSI Students Association ,  Football Club ,  Badminton Club University of Wroclaw M.Sc.,  Computer Science 2003  – 2008 I was interested in software engineering, operations research and parallel algorithms design. During studies I was part of three 4-months team (4-6 people) software engineering projects. I was a project manager for two of these projects. The main goal was to create relatively large pieces of software following the good software development practices. This include complete documentation (vision, architecture, network protocols, code) and unit testing with coverage analysis. \n \nI was also involved in design of algorithms for discrete optimisation problems (e.g. Flowshop). One of them proved to be particularly effective and it became a main subject of my M.Sc. thesis. \n \nDuring studies I have developed applications in: C, C++ (with MPI), Java, C#, Pascal, PHP, SML, Ada and Smalltalk. Activities and Societies:  KSI Students Association ,  Football Club ,  Badminton Club University of Wroclaw M.Sc.,  Computer Science 2003  – 2008 I was interested in software engineering, operations research and parallel algorithms design. During studies I was part of three 4-months team (4-6 people) software engineering projects. I was a project manager for two of these projects. The main goal was to create relatively large pieces of software following the good software development practices. This include complete documentation (vision, architecture, network protocols, code) and unit testing with coverage analysis. \n \nI was also involved in design of algorithms for discrete optimisation problems (e.g. Flowshop). One of them proved to be particularly effective and it became a main subject of my M.Sc. thesis. \n \nDuring studies I have developed applications in: C, C++ (with MPI), Java, C#, Pascal, PHP, SML, Ada and Smalltalk. Activities and Societies:  KSI Students Association ,  Football Club ,  Badminton Club Honors & Awards Additional Honors & Awards Scholarship from the Polish Ministry of Science and Higher Education for outstanding scientific achievements in academic years 2009/2010 and 2010/2011 \n \nDepartmental Prize for Excellence in Grid Computing and e-Engineering 2008/2009 (Cranfield University) Additional Honors & Awards Scholarship from the Polish Ministry of Science and Higher Education for outstanding scientific achievements in academic years 2009/2010 and 2010/2011 \n \nDepartmental Prize for Excellence in Grid Computing and e-Engineering 2008/2009 (Cranfield University) Additional Honors & Awards Scholarship from the Polish Ministry of Science and Higher Education for outstanding scientific achievements in academic years 2009/2010 and 2010/2011 \n \nDepartmental Prize for Excellence in Grid Computing and e-Engineering 2008/2009 (Cranfield University) Additional Honors & Awards Scholarship from the Polish Ministry of Science and Higher Education for outstanding scientific achievements in academic years 2009/2010 and 2010/2011 \n \nDepartmental Prize for Excellence in Grid Computing and e-Engineering 2008/2009 (Cranfield University) ", "Experience Site Reliability Engineer Intern Google July 2015  – Present (2 months) Zürich Area, Switzerland Software Engineering Intern Google May 2014  –  August 2014  (4 months) Mountain View, CA Software Engineer (Part-Time) Chat Sports, Inc. September 2013  –  January 2014  (5 months) Software Engineering Intern Chat Sports, Inc. May 2013  –  August 2013  (4 months) San Francisco Bay Area Co-Founder Crumble Apps July 2012  –  July 2013  (1 year 1 month) Private Tutor Loyola High School February 2011  –  June 2012  (1 year 5 months) Counselor (Volunteer) YMCA Pasadena June 2010  –  June 2012  (2 years 1 month) Tutor (Volunteer) Loyola High School September 2008  –  June 2012  (3 years 10 months) Los Angeles Global Impact Fellow (Volunteer) Unite For Sight, Global Impact Fellow August 2011  –  August 2011  (1 month) Software Engineering Intern Jet Propulsion Laboratory June 2011  –  August 2011  (3 months) Pasadena, CA Record-keeper Advanced Diagnostic & Surgical Center June 2010  –  July 2010  (2 months) Site Reliability Engineer Intern Google July 2015  – Present (2 months) Zürich Area, Switzerland Site Reliability Engineer Intern Google July 2015  – Present (2 months) Zürich Area, Switzerland Software Engineering Intern Google May 2014  –  August 2014  (4 months) Mountain View, CA Software Engineering Intern Google May 2014  –  August 2014  (4 months) Mountain View, CA Software Engineer (Part-Time) Chat Sports, Inc. September 2013  –  January 2014  (5 months) Software Engineer (Part-Time) Chat Sports, Inc. September 2013  –  January 2014  (5 months) Software Engineering Intern Chat Sports, Inc. May 2013  –  August 2013  (4 months) San Francisco Bay Area Software Engineering Intern Chat Sports, Inc. May 2013  –  August 2013  (4 months) San Francisco Bay Area Co-Founder Crumble Apps July 2012  –  July 2013  (1 year 1 month) Co-Founder Crumble Apps July 2012  –  July 2013  (1 year 1 month) Private Tutor Loyola High School February 2011  –  June 2012  (1 year 5 months) Private Tutor Loyola High School February 2011  –  June 2012  (1 year 5 months) Counselor (Volunteer) YMCA Pasadena June 2010  –  June 2012  (2 years 1 month) Counselor (Volunteer) YMCA Pasadena June 2010  –  June 2012  (2 years 1 month) Tutor (Volunteer) Loyola High School September 2008  –  June 2012  (3 years 10 months) Los Angeles Tutor (Volunteer) Loyola High School September 2008  –  June 2012  (3 years 10 months) Los Angeles Global Impact Fellow (Volunteer) Unite For Sight, Global Impact Fellow August 2011  –  August 2011  (1 month) Global Impact Fellow (Volunteer) Unite For Sight, Global Impact Fellow August 2011  –  August 2011  (1 month) Software Engineering Intern Jet Propulsion Laboratory June 2011  –  August 2011  (3 months) Pasadena, CA Software Engineering Intern Jet Propulsion Laboratory June 2011  –  August 2011  (3 months) Pasadena, CA Record-keeper Advanced Diagnostic & Surgical Center June 2010  –  July 2010  (2 months) Record-keeper Advanced Diagnostic & Surgical Center June 2010  –  July 2010  (2 months) Languages   Skills Skills     Education University of Southern California Bachelor of Science (B.S.) 2012  – 2016 Loyola High School High School Diploma 2008  – 2012 University of Southern California Bachelor of Science (B.S.) 2012  – 2016 University of Southern California Bachelor of Science (B.S.) 2012  – 2016 University of Southern California Bachelor of Science (B.S.) 2012  – 2016 Loyola High School High School Diploma 2008  – 2012 Loyola High School High School Diploma 2008  – 2012 Loyola High School High School Diploma 2008  – 2012 Honors & Awards ", "Experience Site Reliability Engineer Google April 2011  – Present (4 years 5 months) Zurich Flipping bits Site Reliability Engineer Intern Google June 2010  –  September 2010  (4 months) Research Assistant Vrije Universiteit Amsterdam October 2008  –  May 2010  (1 year 8 months) Philosophise with PhD students Linux Systems Administrator Intern Google November 2007  –  May 2008  (7 months) Network Engineer Raising Unified Network February 2006  –  October 2007  (1 year 9 months) Routing packets old-school Junior Software Engineer gelf.net April 2003  –  August 2005  (2 years 5 months) Swearing at JavaScript and patching kernels Site Reliability Engineer Google April 2011  – Present (4 years 5 months) Zurich Flipping bits Site Reliability Engineer Google April 2011  – Present (4 years 5 months) Zurich Flipping bits Site Reliability Engineer Intern Google June 2010  –  September 2010  (4 months) Site Reliability Engineer Intern Google June 2010  –  September 2010  (4 months) Research Assistant Vrije Universiteit Amsterdam October 2008  –  May 2010  (1 year 8 months) Philosophise with PhD students Research Assistant Vrije Universiteit Amsterdam October 2008  –  May 2010  (1 year 8 months) Philosophise with PhD students Linux Systems Administrator Intern Google November 2007  –  May 2008  (7 months) Linux Systems Administrator Intern Google November 2007  –  May 2008  (7 months) Network Engineer Raising Unified Network February 2006  –  October 2007  (1 year 9 months) Routing packets old-school Network Engineer Raising Unified Network February 2006  –  October 2007  (1 year 9 months) Routing packets old-school Junior Software Engineer gelf.net April 2003  –  August 2005  (2 years 5 months) Swearing at JavaScript and patching kernels Junior Software Engineer gelf.net April 2003  –  August 2005  (2 years 5 months) Swearing at JavaScript and patching kernels Languages Kolterisch Native or bilingual proficiency English Full professional proficiency Italian Limited working proficiency German Native or bilingual proficiency Spanish Elementary proficiency Kolterisch Native or bilingual proficiency English Full professional proficiency Italian Limited working proficiency German Native or bilingual proficiency Spanish Elementary proficiency Kolterisch Native or bilingual proficiency English Full professional proficiency Italian Limited working proficiency German Native or bilingual proficiency Spanish Elementary proficiency Native or bilingual proficiency Full professional proficiency Limited working proficiency Native or bilingual proficiency Elementary proficiency Skills Linux Distributed Systems Python C Teamwork Scalability Bash Java TCP/IP Networking Annual Giving Unix Shell Scripting Beer Bikes Organic Farming Skills  Linux Distributed Systems Python C Teamwork Scalability Bash Java TCP/IP Networking Annual Giving Unix Shell Scripting Beer Bikes Organic Farming Linux Distributed Systems Python C Teamwork Scalability Bash Java TCP/IP Networking Annual Giving Unix Shell Scripting Beer Bikes Organic Farming Linux Distributed Systems Python C Teamwork Scalability Bash Java TCP/IP Networking Annual Giving Unix Shell Scripting Beer Bikes Organic Farming Education VU University Amsterdam Master,  Computer Science 2008  – 2010 Graduated with honors in Parallel and Distributed Computer Systems. Received VU Fellowship Program Scholarship 2009/2010. Free University of Bozen - Bolzano Bachelor,  Applied Computer Science 2004  – 2008 Erasmus Program: 1 semester at Vrije Universiteit Amsterdam focus on Grid Computing. Received national scholarship 2004-2008. VU University Amsterdam Master,  Computer Science 2008  – 2010 Graduated with honors in Parallel and Distributed Computer Systems. Received VU Fellowship Program Scholarship 2009/2010. VU University Amsterdam Master,  Computer Science 2008  – 2010 Graduated with honors in Parallel and Distributed Computer Systems. Received VU Fellowship Program Scholarship 2009/2010. VU University Amsterdam Master,  Computer Science 2008  – 2010 Graduated with honors in Parallel and Distributed Computer Systems. Received VU Fellowship Program Scholarship 2009/2010. Free University of Bozen - Bolzano Bachelor,  Applied Computer Science 2004  – 2008 Erasmus Program: 1 semester at Vrije Universiteit Amsterdam focus on Grid Computing. Received national scholarship 2004-2008. Free University of Bozen - Bolzano Bachelor,  Applied Computer Science 2004  – 2008 Erasmus Program: 1 semester at Vrije Universiteit Amsterdam focus on Grid Computing. Received national scholarship 2004-2008. Free University of Bozen - Bolzano Bachelor,  Applied Computer Science 2004  – 2008 Erasmus Program: 1 semester at Vrije Universiteit Amsterdam focus on Grid Computing. Received national scholarship 2004-2008. Honors & Awards Additional Honors & Awards VU Fellowship Programme 2009/2010 scholarship for excellent, promising students who take part in a international Master's programme Additional Honors & Awards VU Fellowship Programme 2009/2010 scholarship for excellent, promising students who take part in a international Master's programme Additional Honors & Awards VU Fellowship Programme 2009/2010 scholarship for excellent, promising students who take part in a international Master's programme Additional Honors & Awards VU Fellowship Programme 2009/2010 scholarship for excellent, promising students who take part in a international Master's programme ", "Experience gTech Software Engineer Google June 2014  – Present (1 year 3 months) London, United Kingdom Software Developer Knowledge Transmission Ltd. June 2013  –  May 2014  (1 year) Cambridge, United Kingdom Pitivi video editor Google Summer of Code June 2012  –  August 2012  (3 months) Testing system improvements and new additional test cases. Implemented interface and part of backend for text (title) overlay on video. Work included some other bug fixes. \nGit commits: \nhttps://git.gnome.org/browse/pitivi/log/?qt=author&q=Matas+Brazdeikis Site Reliability Engineer Intern Google July 2011  –  September 2011  (3 months) Dublin, Ireland Intership in Site Reliability Engineer team. \nWorked with High availability MySQL failovers automation. Software Developer Individual January 2006  –  2010  (4 years) Small websites using Wordpress. Plugins, design (Photoshop, HTML and CSS), requirement analysis. \n \nSample set of still active websites: \nhttp://www.psichologas-psichoterapeutas.lt/ \nhttp://www.psichologeaelita.lt/ \nhttp://www.sportas.silale.lm.lt/, \nhttp://www.eurobaidare.lt/ \n \nProject http://www.nemunolinija.lt/ (offline) \nBarcodes, PDF tickets, image gallery Software Developer Alteria, Computer Science July 2008  –  September 2008  (3 months) Web project, on AJAX, Dojo. gTech Software Engineer Google June 2014  – Present (1 year 3 months) London, United Kingdom gTech Software Engineer Google June 2014  – Present (1 year 3 months) London, United Kingdom Software Developer Knowledge Transmission Ltd. June 2013  –  May 2014  (1 year) Cambridge, United Kingdom Software Developer Knowledge Transmission Ltd. June 2013  –  May 2014  (1 year) Cambridge, United Kingdom Pitivi video editor Google Summer of Code June 2012  –  August 2012  (3 months) Testing system improvements and new additional test cases. Implemented interface and part of backend for text (title) overlay on video. Work included some other bug fixes. \nGit commits: \nhttps://git.gnome.org/browse/pitivi/log/?qt=author&q=Matas+Brazdeikis Pitivi video editor Google Summer of Code June 2012  –  August 2012  (3 months) Testing system improvements and new additional test cases. Implemented interface and part of backend for text (title) overlay on video. Work included some other bug fixes. \nGit commits: \nhttps://git.gnome.org/browse/pitivi/log/?qt=author&q=Matas+Brazdeikis Site Reliability Engineer Intern Google July 2011  –  September 2011  (3 months) Dublin, Ireland Intership in Site Reliability Engineer team. \nWorked with High availability MySQL failovers automation. Site Reliability Engineer Intern Google July 2011  –  September 2011  (3 months) Dublin, Ireland Intership in Site Reliability Engineer team. \nWorked with High availability MySQL failovers automation. Software Developer Individual January 2006  –  2010  (4 years) Small websites using Wordpress. Plugins, design (Photoshop, HTML and CSS), requirement analysis. \n \nSample set of still active websites: \nhttp://www.psichologas-psichoterapeutas.lt/ \nhttp://www.psichologeaelita.lt/ \nhttp://www.sportas.silale.lm.lt/, \nhttp://www.eurobaidare.lt/ \n \nProject http://www.nemunolinija.lt/ (offline) \nBarcodes, PDF tickets, image gallery Software Developer Individual January 2006  –  2010  (4 years) Small websites using Wordpress. Plugins, design (Photoshop, HTML and CSS), requirement analysis. \n \nSample set of still active websites: \nhttp://www.psichologas-psichoterapeutas.lt/ \nhttp://www.psichologeaelita.lt/ \nhttp://www.sportas.silale.lm.lt/, \nhttp://www.eurobaidare.lt/ \n \nProject http://www.nemunolinija.lt/ (offline) \nBarcodes, PDF tickets, image gallery Software Developer Alteria, Computer Science July 2008  –  September 2008  (3 months) Web project, on AJAX, Dojo. Software Developer Alteria, Computer Science July 2008  –  September 2008  (3 months) Web project, on AJAX, Dojo. Languages English Professional working proficiency Lithuanian Native or bilingual proficiency English Professional working proficiency Lithuanian Native or bilingual proficiency English Professional working proficiency Lithuanian Native or bilingual proficiency Professional working proficiency Native or bilingual proficiency Skills MySQL Python Algorithms Java JavaScript Software Development Programming AJAX PHP GWT Amazon Web Services... Skills  MySQL Python Algorithms Java JavaScript Software Development Programming AJAX PHP GWT Amazon Web Services... MySQL Python Algorithms Java JavaScript Software Development Programming AJAX PHP GWT Amazon Web Services... MySQL Python Algorithms Java JavaScript Software Development Programming AJAX PHP GWT Amazon Web Services... Education University of Cambridge Bachelor's Degree,  Computer Science 2010  – 2013 Activities and Societies:  Rowing club ,  Lithuanian society Vilnius lyceum Pupil 2006  – 2010 VšĮ Nacionalinė moksleivių akademija Pupil,  Computer science 2006  – 2010 Activities and Societies:  Help organising learning sessions and other activities. University of Cambridge Bachelor's Degree,  Computer Science 2010  – 2013 Activities and Societies:  Rowing club ,  Lithuanian society University of Cambridge Bachelor's Degree,  Computer Science 2010  – 2013 Activities and Societies:  Rowing club ,  Lithuanian society University of Cambridge Bachelor's Degree,  Computer Science 2010  – 2013 Activities and Societies:  Rowing club ,  Lithuanian society Vilnius lyceum Pupil 2006  – 2010 Vilnius lyceum Pupil 2006  – 2010 Vilnius lyceum Pupil 2006  – 2010 VšĮ Nacionalinė moksleivių akademija Pupil,  Computer science 2006  – 2010 Activities and Societies:  Help organising learning sessions and other activities. VšĮ Nacionalinė moksleivių akademija Pupil,  Computer science 2006  – 2010 Activities and Societies:  Help organising learning sessions and other activities. VšĮ Nacionalinė moksleivių akademija Pupil,  Computer science 2006  – 2010 Activities and Societies:  Help organising learning sessions and other activities. Honors & Awards Bronze medal International Olympiad in Informatics Silver Medal Baltic Olympiad in Informatics Second place (twice) National Olympiad in Informatics Second place National Olympiad in Mathematics Bronze medal International Olympiad in Informatics Bronze medal International Olympiad in Informatics Bronze medal International Olympiad in Informatics Silver Medal Baltic Olympiad in Informatics Silver Medal Baltic Olympiad in Informatics Silver Medal Baltic Olympiad in Informatics Second place (twice) National Olympiad in Informatics Second place (twice) National Olympiad in Informatics Second place (twice) National Olympiad in Informatics Second place National Olympiad in Mathematics Second place National Olympiad in Mathematics Second place National Olympiad in Mathematics ", "Summary Currently an Associate Product Manager at Google. Summary Currently an Associate Product Manager at Google. Currently an Associate Product Manager at Google. Currently an Associate Product Manager at Google. Experience Associate Product Manager Google 2013  – Present (2 years) Currently working on Android Auto to help extend the Android platform into the car in a way that's purpose-built for driving. \n \nPrevious rotation was helping to grow AdWords Express into Google's simple advertising solution for all SMBs. Doctoral Student University of St Andrews 2009  –  2013  (4 years) Studied in the Dependable Systems Group at the University of St Andrews with Prof. Ian Sommerville. \n \nThesis entitled \"Investigating Performance and Energy Efficiency on a Private Cloud\" Site Reliability Engineer Intern Google June 2012  –  September 2012  (4 months) Dublin, Ireland Worked in Traffic SRE and developed a tool for production-oncall engineers. Visiting Researcher McLaren September 2011  –  December 2011  (4 months) Woking, United Kingdom Working with McLaren to implement ideas from my PhD research. Extreme Blue Intern IBM June 2011  –  September 2011  (4 months) IBM Laboratories Hursley Developed solutions to capture, present, analyse and simulate network traffic within large organisations. \n \nTechnical Lead, primarily responsible system architecture, IP disclosure and some non-technical aspects of project such as requirements engineering and scrum organisation. \n \nPresented project to senior management, sales and clients and secured interest for continuation of project after the completion of the internship. One patent submission. R&D Intern NCR June 2008  –  September 2008  (4 months) Dundee, United Kingdom Research Internship within the area of Wireless Sensor Networks. \n \nDeveloped application level software using Microsoft Development environment including Visual Studio and C#. Also developed firmware software for application-specific devices in C. Associate Product Manager Google 2013  – Present (2 years) Currently working on Android Auto to help extend the Android platform into the car in a way that's purpose-built for driving. \n \nPrevious rotation was helping to grow AdWords Express into Google's simple advertising solution for all SMBs. Associate Product Manager Google 2013  – Present (2 years) Currently working on Android Auto to help extend the Android platform into the car in a way that's purpose-built for driving. \n \nPrevious rotation was helping to grow AdWords Express into Google's simple advertising solution for all SMBs. Doctoral Student University of St Andrews 2009  –  2013  (4 years) Studied in the Dependable Systems Group at the University of St Andrews with Prof. Ian Sommerville. \n \nThesis entitled \"Investigating Performance and Energy Efficiency on a Private Cloud\" Doctoral Student University of St Andrews 2009  –  2013  (4 years) Studied in the Dependable Systems Group at the University of St Andrews with Prof. Ian Sommerville. \n \nThesis entitled \"Investigating Performance and Energy Efficiency on a Private Cloud\" Site Reliability Engineer Intern Google June 2012  –  September 2012  (4 months) Dublin, Ireland Worked in Traffic SRE and developed a tool for production-oncall engineers. Site Reliability Engineer Intern Google June 2012  –  September 2012  (4 months) Dublin, Ireland Worked in Traffic SRE and developed a tool for production-oncall engineers. Visiting Researcher McLaren September 2011  –  December 2011  (4 months) Woking, United Kingdom Working with McLaren to implement ideas from my PhD research. Visiting Researcher McLaren September 2011  –  December 2011  (4 months) Woking, United Kingdom Working with McLaren to implement ideas from my PhD research. Extreme Blue Intern IBM June 2011  –  September 2011  (4 months) IBM Laboratories Hursley Developed solutions to capture, present, analyse and simulate network traffic within large organisations. \n \nTechnical Lead, primarily responsible system architecture, IP disclosure and some non-technical aspects of project such as requirements engineering and scrum organisation. \n \nPresented project to senior management, sales and clients and secured interest for continuation of project after the completion of the internship. One patent submission. Extreme Blue Intern IBM June 2011  –  September 2011  (4 months) IBM Laboratories Hursley Developed solutions to capture, present, analyse and simulate network traffic within large organisations. \n \nTechnical Lead, primarily responsible system architecture, IP disclosure and some non-technical aspects of project such as requirements engineering and scrum organisation. \n \nPresented project to senior management, sales and clients and secured interest for continuation of project after the completion of the internship. One patent submission. R&D Intern NCR June 2008  –  September 2008  (4 months) Dundee, United Kingdom Research Internship within the area of Wireless Sensor Networks. \n \nDeveloped application level software using Microsoft Development environment including Visual Studio and C#. Also developed firmware software for application-specific devices in C. R&D Intern NCR June 2008  –  September 2008  (4 months) Dundee, United Kingdom Research Internship within the area of Wireless Sensor Networks. \n \nDeveloped application level software using Microsoft Development environment including Visual Studio and C#. Also developed firmware software for application-specific devices in C. Languages   Skills Java C SQL PHP Linux Technical Presentations System Administration MySQL HTML Teaching Research Unix OOP Python Server Monitoring Agile Methodologies Amazon Web Services... Android R Bash Programming LaTeX Software Engineering Distributed Systems Machine Learning Algorithms Artificial Intelligence Software Development Software Design Public Speaking Presentations Scrum Cloud Computing See 18+     See less Skills  Java C SQL PHP Linux Technical Presentations System Administration MySQL HTML Teaching Research Unix OOP Python Server Monitoring Agile Methodologies Amazon Web Services... Android R Bash Programming LaTeX Software Engineering Distributed Systems Machine Learning Algorithms Artificial Intelligence Software Development Software Design Public Speaking Presentations Scrum Cloud Computing See 18+     See less Java C SQL PHP Linux Technical Presentations System Administration MySQL HTML Teaching Research Unix OOP Python Server Monitoring Agile Methodologies Amazon Web Services... Android R Bash Programming LaTeX Software Engineering Distributed Systems Machine Learning Algorithms Artificial Intelligence Software Development Software Design Public Speaking Presentations Scrum Cloud Computing See 18+     See less Java C SQL PHP Linux Technical Presentations System Administration MySQL HTML Teaching Research Unix OOP Python Server Monitoring Agile Methodologies Amazon Web Services... Android R Bash Programming LaTeX Software Engineering Distributed Systems Machine Learning Algorithms Artificial Intelligence Software Development Software Design Public Speaking Presentations Scrum Cloud Computing See 18+     See less Education University of St. Andrews Doctor of Philosophy (Ph.D.),  Computer Science 2009  – 2013 Working in the Large Scale Complex IT Systems group under the supervision of Professor Ian Sommerville. \n \nTaught courses on Introductory and Advanced Computer Science, Data Structures & Algorithms, Distributed Systems and Software Engineering. Activities and Societies:  DJ ,  Union Events Officer ,  Filmmaker University of St. Andrews B.Sc (Hons),  Computer Science 2005  – 2009 Activities and Societies:  DJ ,  Filmmaker University of St. Andrews Doctor of Philosophy (Ph.D.),  Computer Science 2009  – 2013 Working in the Large Scale Complex IT Systems group under the supervision of Professor Ian Sommerville. \n \nTaught courses on Introductory and Advanced Computer Science, Data Structures & Algorithms, Distributed Systems and Software Engineering. Activities and Societies:  DJ ,  Union Events Officer ,  Filmmaker University of St. Andrews Doctor of Philosophy (Ph.D.),  Computer Science 2009  – 2013 Working in the Large Scale Complex IT Systems group under the supervision of Professor Ian Sommerville. \n \nTaught courses on Introductory and Advanced Computer Science, Data Structures & Algorithms, Distributed Systems and Software Engineering. Activities and Societies:  DJ ,  Union Events Officer ,  Filmmaker University of St. Andrews Doctor of Philosophy (Ph.D.),  Computer Science 2009  – 2013 Working in the Large Scale Complex IT Systems group under the supervision of Professor Ian Sommerville. \n \nTaught courses on Introductory and Advanced Computer Science, Data Structures & Algorithms, Distributed Systems and Software Engineering. Activities and Societies:  DJ ,  Union Events Officer ,  Filmmaker University of St. Andrews B.Sc (Hons),  Computer Science 2005  – 2009 Activities and Societies:  DJ ,  Filmmaker University of St. Andrews B.Sc (Hons),  Computer Science 2005  – 2009 Activities and Societies:  DJ ,  Filmmaker University of St. Andrews B.Sc (Hons),  Computer Science 2005  – 2009 Activities and Societies:  DJ ,  Filmmaker Honors & Awards StACC Research Studentship in Cloud Computing University of St Andrews September 2009 StACC is a research collaboration focusing on research in cloud computing. \n \nThe School of Computer Science at St Andrews provides funding for StACC inlcuding research studentships, an experimental hardware facility, technical support. \n \nI was one of the first graduate students to receive the StACC Research Studentship in Cloud Computing in September 2009. Wardlaw Scholarship University of St Andrews October 2005 The Wardlaw Scholarship scheme provides invaluable support to academically gifted students from low income backgrounds to attend the University of St Andrews. The scholarship benefits are contingent on academic performance. Arkwright Scholarship Arkwright Foundation October 2004 The Arkwright Scholarships Trust administers one of the most prestigious scholarship schemes in the UK. Arkwright exists to inspire future leaders in engineering and related areas of design. \n \nhttp://www.arkwright.org.uk/ StACC Research Studentship in Cloud Computing University of St Andrews September 2009 StACC is a research collaboration focusing on research in cloud computing. \n \nThe School of Computer Science at St Andrews provides funding for StACC inlcuding research studentships, an experimental hardware facility, technical support. \n \nI was one of the first graduate students to receive the StACC Research Studentship in Cloud Computing in September 2009. StACC Research Studentship in Cloud Computing University of St Andrews September 2009 StACC is a research collaboration focusing on research in cloud computing. \n \nThe School of Computer Science at St Andrews provides funding for StACC inlcuding research studentships, an experimental hardware facility, technical support. \n \nI was one of the first graduate students to receive the StACC Research Studentship in Cloud Computing in September 2009. StACC Research Studentship in Cloud Computing University of St Andrews September 2009 StACC is a research collaboration focusing on research in cloud computing. \n \nThe School of Computer Science at St Andrews provides funding for StACC inlcuding research studentships, an experimental hardware facility, technical support. \n \nI was one of the first graduate students to receive the StACC Research Studentship in Cloud Computing in September 2009. Wardlaw Scholarship University of St Andrews October 2005 The Wardlaw Scholarship scheme provides invaluable support to academically gifted students from low income backgrounds to attend the University of St Andrews. The scholarship benefits are contingent on academic performance. Wardlaw Scholarship University of St Andrews October 2005 The Wardlaw Scholarship scheme provides invaluable support to academically gifted students from low income backgrounds to attend the University of St Andrews. The scholarship benefits are contingent on academic performance. Wardlaw Scholarship University of St Andrews October 2005 The Wardlaw Scholarship scheme provides invaluable support to academically gifted students from low income backgrounds to attend the University of St Andrews. The scholarship benefits are contingent on academic performance. Arkwright Scholarship Arkwright Foundation October 2004 The Arkwright Scholarships Trust administers one of the most prestigious scholarship schemes in the UK. Arkwright exists to inspire future leaders in engineering and related areas of design. \n \nhttp://www.arkwright.org.uk/ Arkwright Scholarship Arkwright Foundation October 2004 The Arkwright Scholarships Trust administers one of the most prestigious scholarship schemes in the UK. Arkwright exists to inspire future leaders in engineering and related areas of design. \n \nhttp://www.arkwright.org.uk/ Arkwright Scholarship Arkwright Foundation October 2004 The Arkwright Scholarships Trust administers one of the most prestigious scholarship schemes in the UK. Arkwright exists to inspire future leaders in engineering and related areas of design. \n \nhttp://www.arkwright.org.uk/ ", "Experience Site Reliability Engineer Google July 2013  – Present (2 years 2 months) TA for ENGR 131 Case Western Reserve University September 2010  –  May 2013  (2 years 9 months) Site Reliability Engineer Intern Google May 2012  –  August 2012  (4 months) Mountain View I'm working on improving the MySQL codebase at Google! SRE Intern Google May 2011  –  August 2011  (4 months) Technical Intern Mogreet June 2008  –  August 2010  (2 years 3 months) Site Reliability Engineer Google July 2013  – Present (2 years 2 months) Site Reliability Engineer Google July 2013  – Present (2 years 2 months) TA for ENGR 131 Case Western Reserve University September 2010  –  May 2013  (2 years 9 months) TA for ENGR 131 Case Western Reserve University September 2010  –  May 2013  (2 years 9 months) Site Reliability Engineer Intern Google May 2012  –  August 2012  (4 months) Mountain View I'm working on improving the MySQL codebase at Google! Site Reliability Engineer Intern Google May 2012  –  August 2012  (4 months) Mountain View I'm working on improving the MySQL codebase at Google! SRE Intern Google May 2011  –  August 2011  (4 months) SRE Intern Google May 2011  –  August 2011  (4 months) Technical Intern Mogreet June 2008  –  August 2010  (2 years 3 months) Technical Intern Mogreet June 2008  –  August 2010  (2 years 3 months) Skills Java Linux C Python Ruby Bash SQL MySQL Computer Science Git Algorithms Skills  Java Linux C Python Ruby Bash SQL MySQL Computer Science Git Algorithms Java Linux C Python Ruby Bash SQL MySQL Computer Science Git Algorithms Java Linux C Python Ruby Bash SQL MySQL Computer Science Git Algorithms Education Case Western Reserve University BS,  Computer Science 2009  – 2013 Case Western Reserve University BS,  Computer Science 2009  – 2013 Case Western Reserve University BS,  Computer Science 2009  – 2013 Case Western Reserve University BS,  Computer Science 2009  – 2013 ", "Experience Software Engineer Google September 2014  – Present (1 year) Kraków, Poland C++, Java, Python \ninfrastructure, Google Compute Engine Junior Software Developer u2i March 2014  –  May 2014  (3 months) Kraków, Poland Ruby, Active Record Site Reliability Engineer Intern Google July 2013  –  October 2013  (4 months) London, United Kingdom Python, Calendar SRE team Software Developer Intern Future Processing Sp. z o.o. July 2012  –  August 2012  (2 months) Gliwice, Silesian District, Poland C++: computer vision algorithms, Django: website Software Engineer Google September 2014  – Present (1 year) Kraków, Poland C++, Java, Python \ninfrastructure, Google Compute Engine Software Engineer Google September 2014  – Present (1 year) Kraków, Poland C++, Java, Python \ninfrastructure, Google Compute Engine Junior Software Developer u2i March 2014  –  May 2014  (3 months) Kraków, Poland Ruby, Active Record Junior Software Developer u2i March 2014  –  May 2014  (3 months) Kraków, Poland Ruby, Active Record Site Reliability Engineer Intern Google July 2013  –  October 2013  (4 months) London, United Kingdom Python, Calendar SRE team Site Reliability Engineer Intern Google July 2013  –  October 2013  (4 months) London, United Kingdom Python, Calendar SRE team Software Developer Intern Future Processing Sp. z o.o. July 2012  –  August 2012  (2 months) Gliwice, Silesian District, Poland C++: computer vision algorithms, Django: website Software Developer Intern Future Processing Sp. z o.o. July 2012  –  August 2012  (2 months) Gliwice, Silesian District, Poland C++: computer vision algorithms, Django: website Languages   Skills Skills     Education AGH University of Science and Technology Master of Science in Engineering (M.Sc. Eng.),  Computer Science 2013  – 2014 AGH University of Science and Technology Bachelor of Engineering (B.Eng.),  Computer Science 2009  – 2013 AGH University of Science and Technology Master of Science in Engineering (M.Sc. Eng.),  Computer Science 2013  – 2014 AGH University of Science and Technology Master of Science in Engineering (M.Sc. Eng.),  Computer Science 2013  – 2014 AGH University of Science and Technology Master of Science in Engineering (M.Sc. Eng.),  Computer Science 2013  – 2014 AGH University of Science and Technology Bachelor of Engineering (B.Eng.),  Computer Science 2009  – 2013 AGH University of Science and Technology Bachelor of Engineering (B.Eng.),  Computer Science 2009  – 2013 AGH University of Science and Technology Bachelor of Engineering (B.Eng.),  Computer Science 2009  – 2013 Honors & Awards ", "Experience Site Reliability Engineer Intern Google June 2015  – Present (3 months) Switzerland Software Engineer Intern Google June 2014  –  September 2014  (4 months) Switzerland Developer in Infrastructure Security. Servicepersonal Stockholmsmässan AB January 2013  –  August 2013  (8 months) Site Reliability Engineer Intern Google June 2015  – Present (3 months) Switzerland Site Reliability Engineer Intern Google June 2015  – Present (3 months) Switzerland Software Engineer Intern Google June 2014  –  September 2014  (4 months) Switzerland Developer in Infrastructure Security. Software Engineer Intern Google June 2014  –  September 2014  (4 months) Switzerland Developer in Infrastructure Security. Servicepersonal Stockholmsmässan AB January 2013  –  August 2013  (8 months) Servicepersonal Stockholmsmässan AB January 2013  –  August 2013  (8 months) Languages Swedish Native or bilingual proficiency English Full professional proficiency Swedish Native or bilingual proficiency English Full professional proficiency Swedish Native or bilingual proficiency English Full professional proficiency Native or bilingual proficiency Full professional proficiency Skills Java Golang Github Git Eclipse Skills  Java Golang Github Git Eclipse Java Golang Github Git Eclipse Java Golang Github Git Eclipse Education KTH Royal Institute of Technology Master's degree,  Computer Science 2013  – 2018 Hermods Studentexamen,  Natural Sciences 2011  – 2012 KTH Royal Institute of Technology Master's degree,  Computer Science 2013  – 2018 KTH Royal Institute of Technology Master's degree,  Computer Science 2013  – 2018 KTH Royal Institute of Technology Master's degree,  Computer Science 2013  – 2018 Hermods Studentexamen,  Natural Sciences 2011  – 2012 Hermods Studentexamen,  Natural Sciences 2011  – 2012 Hermods Studentexamen,  Natural Sciences 2011  – 2012 Honors & Awards ", "Skills Programming JavaScript HTML Project Management C Event Management Python Java C++ Algorithms Management Git Microsoft Office Event Planning Windows Linux PHP CSS See 3+     See less Skills  Programming JavaScript HTML Project Management C Event Management Python Java C++ Algorithms Management Git Microsoft Office Event Planning Windows Linux PHP CSS See 3+     See less Programming JavaScript HTML Project Management C Event Management Python Java C++ Algorithms Management Git Microsoft Office Event Planning Windows Linux PHP CSS See 3+     See less Programming JavaScript HTML Project Management C Event Management Python Java C++ Algorithms Management Git Microsoft Office Event Planning Windows Linux PHP CSS See 3+     See less Education University of Southampton MEng Software Engineering 2012  – 2016 Modules included: \n \nYear 1: Programming I, Computer Systems I, Professional Development, Foundations of Computer Science, Programming II, Data Management, Software Modelling and Design, Algorithmics. \n \nYear 2: Distributed Systems and Networks, Intelligent Systems, Programming III, Theory of Computing, Software Engineering Group Project, Programming Language Concepts, Interaction Design, Advanced Software Modelling and Design. \n \nYear 3: Cloud Application Development, Engineering Management and Law, German Language Level 2A and 2B, Part III Individual Project, Individual Research Project. Gdańsk University of Technology Informatics 2011  – 2012 Modules included: Algorithms and Data Structures, Object-oriented programming (basics of C++, C#, Java and Python), Computer Architecture, Basics of Electronics and Metrology, Discrete Mathematics, Digital Circuits, Hypertext and Hypermedia, Physics, Physics II, Linear Algebra, \nMathematical Analysis, Practice of Programming. University of Southampton MEng Software Engineering 2012  – 2016 Modules included: \n \nYear 1: Programming I, Computer Systems I, Professional Development, Foundations of Computer Science, Programming II, Data Management, Software Modelling and Design, Algorithmics. \n \nYear 2: Distributed Systems and Networks, Intelligent Systems, Programming III, Theory of Computing, Software Engineering Group Project, Programming Language Concepts, Interaction Design, Advanced Software Modelling and Design. \n \nYear 3: Cloud Application Development, Engineering Management and Law, German Language Level 2A and 2B, Part III Individual Project, Individual Research Project. University of Southampton MEng Software Engineering 2012  – 2016 Modules included: \n \nYear 1: Programming I, Computer Systems I, Professional Development, Foundations of Computer Science, Programming II, Data Management, Software Modelling and Design, Algorithmics. \n \nYear 2: Distributed Systems and Networks, Intelligent Systems, Programming III, Theory of Computing, Software Engineering Group Project, Programming Language Concepts, Interaction Design, Advanced Software Modelling and Design. \n \nYear 3: Cloud Application Development, Engineering Management and Law, German Language Level 2A and 2B, Part III Individual Project, Individual Research Project. University of Southampton MEng Software Engineering 2012  – 2016 Modules included: \n \nYear 1: Programming I, Computer Systems I, Professional Development, Foundations of Computer Science, Programming II, Data Management, Software Modelling and Design, Algorithmics. \n \nYear 2: Distributed Systems and Networks, Intelligent Systems, Programming III, Theory of Computing, Software Engineering Group Project, Programming Language Concepts, Interaction Design, Advanced Software Modelling and Design. \n \nYear 3: Cloud Application Development, Engineering Management and Law, German Language Level 2A and 2B, Part III Individual Project, Individual Research Project. Gdańsk University of Technology Informatics 2011  – 2012 Modules included: Algorithms and Data Structures, Object-oriented programming (basics of C++, C#, Java and Python), Computer Architecture, Basics of Electronics and Metrology, Discrete Mathematics, Digital Circuits, Hypertext and Hypermedia, Physics, Physics II, Linear Algebra, \nMathematical Analysis, Practice of Programming. Gdańsk University of Technology Informatics 2011  – 2012 Modules included: Algorithms and Data Structures, Object-oriented programming (basics of C++, C#, Java and Python), Computer Architecture, Basics of Electronics and Metrology, Discrete Mathematics, Digital Circuits, Hypertext and Hypermedia, Physics, Physics II, Linear Algebra, \nMathematical Analysis, Practice of Programming. Gdańsk University of Technology Informatics 2011  – 2012 Modules included: Algorithms and Data Structures, Object-oriented programming (basics of C++, C#, Java and Python), Computer Architecture, Basics of Electronics and Metrology, Discrete Mathematics, Digital Circuits, Hypertext and Hypermedia, Physics, Physics II, Linear Algebra, \nMathematical Analysis, Practice of Programming. "]}