{"position": "Software Engineer, Business Applications", "company": "Google", "profiles": ["Summary Having 6 yeras experience as software Engineer of business applications. Particularly interested in developing n-tier applications using SQL Server 2008R2/SSIS/SSRS as database, .NET Framework 4.0 (WCF, Entity Framework, WebApi) for the middle-tier and ASP.NET MVC / HTML5 / JavaScript for the UI. Having a broad experience with Visual Studio 2010 and Team Foundation Server 2010 \nLike to follow the developments from Microsoft and rate them on their applicability in real projects. Good architecture and reusability of code are very important, as well as quality (e.g. through unit testing). \n \nCurrently working on .NET projects linked to Visual Studio 2010. \n \nSpecialties: .NET Framework 4.0 (ASP.NET MVC, Entity Framework), , Visual Studio 2010, Team Foundation Server 2010, SQL Server 2008R2, SSIS,SSRS, Tibco Spotfire. Summary Having 6 yeras experience as software Engineer of business applications. Particularly interested in developing n-tier applications using SQL Server 2008R2/SSIS/SSRS as database, .NET Framework 4.0 (WCF, Entity Framework, WebApi) for the middle-tier and ASP.NET MVC / HTML5 / JavaScript for the UI. Having a broad experience with Visual Studio 2010 and Team Foundation Server 2010 \nLike to follow the developments from Microsoft and rate them on their applicability in real projects. Good architecture and reusability of code are very important, as well as quality (e.g. through unit testing). \n \nCurrently working on .NET projects linked to Visual Studio 2010. \n \nSpecialties: .NET Framework 4.0 (ASP.NET MVC, Entity Framework), , Visual Studio 2010, Team Foundation Server 2010, SQL Server 2008R2, SSIS,SSRS, Tibco Spotfire. Having 6 yeras experience as software Engineer of business applications. Particularly interested in developing n-tier applications using SQL Server 2008R2/SSIS/SSRS as database, .NET Framework 4.0 (WCF, Entity Framework, WebApi) for the middle-tier and ASP.NET MVC / HTML5 / JavaScript for the UI. Having a broad experience with Visual Studio 2010 and Team Foundation Server 2010 \nLike to follow the developments from Microsoft and rate them on their applicability in real projects. Good architecture and reusability of code are very important, as well as quality (e.g. through unit testing). \n \nCurrently working on .NET projects linked to Visual Studio 2010. \n \nSpecialties: .NET Framework 4.0 (ASP.NET MVC, Entity Framework), , Visual Studio 2010, Team Foundation Server 2010, SQL Server 2008R2, SSIS,SSRS, Tibco Spotfire. Having 6 yeras experience as software Engineer of business applications. Particularly interested in developing n-tier applications using SQL Server 2008R2/SSIS/SSRS as database, .NET Framework 4.0 (WCF, Entity Framework, WebApi) for the middle-tier and ASP.NET MVC / HTML5 / JavaScript for the UI. Having a broad experience with Visual Studio 2010 and Team Foundation Server 2010 \nLike to follow the developments from Microsoft and rate them on their applicability in real projects. Good architecture and reusability of code are very important, as well as quality (e.g. through unit testing). \n \nCurrently working on .NET projects linked to Visual Studio 2010. \n \nSpecialties: .NET Framework 4.0 (ASP.NET MVC, Entity Framework), , Visual Studio 2010, Team Foundation Server 2010, SQL Server 2008R2, SSIS,SSRS, Tibco Spotfire. Experience Senior Software Developer Xchanging September 2014  – Present (1 year) Kuala Lumpur, Malaysia Sr. Software Engineer HTC Global Services September 2010  –  September 2014  (4 years 1 month) Penang, Malaysia Development of the Winforms application in manufacturing domain by using C# and .NET framework, WCF, Design of SQL Server databases.SSIS,SSRS. Design, code, test and integration of embedded application and support software. Integration Analyst Accenture April 2010  –  August 2010  (5 months) Chennai Area, India Worked Microsoft Amalga Implementation in SSRS enabled reporting website. Jr. Software Engineer Retailor Technologies Pvt. Ltd. September 2008  –  April 2010  (1 year 8 months) Chennai Area, India Design and development windows and web application using Visual Studio and SQL Server. Senior Software Developer Xchanging September 2014  – Present (1 year) Kuala Lumpur, Malaysia Senior Software Developer Xchanging September 2014  – Present (1 year) Kuala Lumpur, Malaysia Sr. Software Engineer HTC Global Services September 2010  –  September 2014  (4 years 1 month) Penang, Malaysia Development of the Winforms application in manufacturing domain by using C# and .NET framework, WCF, Design of SQL Server databases.SSIS,SSRS. Design, code, test and integration of embedded application and support software. Sr. Software Engineer HTC Global Services September 2010  –  September 2014  (4 years 1 month) Penang, Malaysia Development of the Winforms application in manufacturing domain by using C# and .NET framework, WCF, Design of SQL Server databases.SSIS,SSRS. Design, code, test and integration of embedded application and support software. Integration Analyst Accenture April 2010  –  August 2010  (5 months) Chennai Area, India Worked Microsoft Amalga Implementation in SSRS enabled reporting website. Integration Analyst Accenture April 2010  –  August 2010  (5 months) Chennai Area, India Worked Microsoft Amalga Implementation in SSRS enabled reporting website. Jr. Software Engineer Retailor Technologies Pvt. Ltd. September 2008  –  April 2010  (1 year 8 months) Chennai Area, India Design and development windows and web application using Visual Studio and SQL Server. Jr. Software Engineer Retailor Technologies Pvt. Ltd. September 2008  –  April 2010  (1 year 8 months) Chennai Area, India Design and development windows and web application using Visual Studio and SQL Server. Languages English Full professional proficiency Hindi Native or bilingual proficiency English Full professional proficiency Hindi Native or bilingual proficiency English Full professional proficiency Hindi Native or bilingual proficiency Full professional proficiency Native or bilingual proficiency Skills C# 4.0 SSIS SSRS Visual Studio Team... SQL Server Management... JavaScript HTML CSS LINQ .NET Compact Framework ASP.NET WCF XML Agile Methodolgy Debugging SDLC Unit Testing WinForms Agile Methodologies IIS jQuery SOA Design Patterns JSON C# See 10+     See less Skills  C# 4.0 SSIS SSRS Visual Studio Team... SQL Server Management... JavaScript HTML CSS LINQ .NET Compact Framework ASP.NET WCF XML Agile Methodolgy Debugging SDLC Unit Testing WinForms Agile Methodologies IIS jQuery SOA Design Patterns JSON C# See 10+     See less C# 4.0 SSIS SSRS Visual Studio Team... SQL Server Management... JavaScript HTML CSS LINQ .NET Compact Framework ASP.NET WCF XML Agile Methodolgy Debugging SDLC Unit Testing WinForms Agile Methodologies IIS jQuery SOA Design Patterns JSON C# See 10+     See less C# 4.0 SSIS SSRS Visual Studio Team... SQL Server Management... JavaScript HTML CSS LINQ .NET Compact Framework ASP.NET WCF XML Agile Methodolgy Debugging SDLC Unit Testing WinForms Agile Methodologies IIS jQuery SOA Design Patterns JSON C# See 10+     See less Education Uttar Pradesh Technical University Master of Computer Applications (MCA),  Information Technology 2004  – 2007 Doctor Ram Manohar Lohia Awadh University Bachelor's degree,  Mathematics & Physics 2000  – 2003 Uttar Pradesh Technical University Master of Computer Applications (MCA),  Information Technology 2004  – 2007 Uttar Pradesh Technical University Master of Computer Applications (MCA),  Information Technology 2004  – 2007 Uttar Pradesh Technical University Master of Computer Applications (MCA),  Information Technology 2004  – 2007 Doctor Ram Manohar Lohia Awadh University Bachelor's degree,  Mathematics & Physics 2000  – 2003 Doctor Ram Manohar Lohia Awadh University Bachelor's degree,  Mathematics & Physics 2000  – 2003 Doctor Ram Manohar Lohia Awadh University Bachelor's degree,  Mathematics & Physics 2000  – 2003 ", "Summary Ik ben ondernemer en mede-eigenaar van Master of Code Nederland. Mijn energie en voldoening haal ik uit het prijsbewust ontwikkelen en leveren van maatwerk IT solutions die zijn toegespitst op het realiseren van de bedrijfsdoelstellingen van mijn klanten. Hierbij start ik een project vanuit het gewenste eindresultaat en toets altijd of dit aansluit aan de beoogde bedrijfsdoelstelling van de klant. Pas als dat duidelijk is ga ik samen met mijn organisatie echt voor u aan de slag. \n \nOnderscheidend in onze aanpak is de keuze om specifieke kennis op één plek te beleggen. Ons internationale ontwikkelcentrum concentreert zich op architectuur, bouw en beheer van softwareoplossingen. Ons lokale leveringsmanagement en onze marktkennis helpen u direct en ontzorgen u gedurende de realisatie en het beheer. Master of Code creëert hiermee een dusdanige balans zodat u profiteert van optimale verhouding van kosten en gewenst resultaat. \n \nIn het geval uw bedrijf in de fase verkeert waarbij de bedrijfsdoelstellingen, het bedrijfsmodel of de bedrijfspropositie aan verandering toe is denk ik graag met u mee. Met mijn achtergrond en netwerk kan ik u helpen bij het formuleren van de noodzakelijke aanpassingen en de vertaling daarvan naar een concrete realisatie. Summary Ik ben ondernemer en mede-eigenaar van Master of Code Nederland. Mijn energie en voldoening haal ik uit het prijsbewust ontwikkelen en leveren van maatwerk IT solutions die zijn toegespitst op het realiseren van de bedrijfsdoelstellingen van mijn klanten. Hierbij start ik een project vanuit het gewenste eindresultaat en toets altijd of dit aansluit aan de beoogde bedrijfsdoelstelling van de klant. Pas als dat duidelijk is ga ik samen met mijn organisatie echt voor u aan de slag. \n \nOnderscheidend in onze aanpak is de keuze om specifieke kennis op één plek te beleggen. Ons internationale ontwikkelcentrum concentreert zich op architectuur, bouw en beheer van softwareoplossingen. Ons lokale leveringsmanagement en onze marktkennis helpen u direct en ontzorgen u gedurende de realisatie en het beheer. Master of Code creëert hiermee een dusdanige balans zodat u profiteert van optimale verhouding van kosten en gewenst resultaat. \n \nIn het geval uw bedrijf in de fase verkeert waarbij de bedrijfsdoelstellingen, het bedrijfsmodel of de bedrijfspropositie aan verandering toe is denk ik graag met u mee. Met mijn achtergrond en netwerk kan ik u helpen bij het formuleren van de noodzakelijke aanpassingen en de vertaling daarvan naar een concrete realisatie. Ik ben ondernemer en mede-eigenaar van Master of Code Nederland. Mijn energie en voldoening haal ik uit het prijsbewust ontwikkelen en leveren van maatwerk IT solutions die zijn toegespitst op het realiseren van de bedrijfsdoelstellingen van mijn klanten. Hierbij start ik een project vanuit het gewenste eindresultaat en toets altijd of dit aansluit aan de beoogde bedrijfsdoelstelling van de klant. Pas als dat duidelijk is ga ik samen met mijn organisatie echt voor u aan de slag. \n \nOnderscheidend in onze aanpak is de keuze om specifieke kennis op één plek te beleggen. Ons internationale ontwikkelcentrum concentreert zich op architectuur, bouw en beheer van softwareoplossingen. Ons lokale leveringsmanagement en onze marktkennis helpen u direct en ontzorgen u gedurende de realisatie en het beheer. Master of Code creëert hiermee een dusdanige balans zodat u profiteert van optimale verhouding van kosten en gewenst resultaat. \n \nIn het geval uw bedrijf in de fase verkeert waarbij de bedrijfsdoelstellingen, het bedrijfsmodel of de bedrijfspropositie aan verandering toe is denk ik graag met u mee. Met mijn achtergrond en netwerk kan ik u helpen bij het formuleren van de noodzakelijke aanpassingen en de vertaling daarvan naar een concrete realisatie. Ik ben ondernemer en mede-eigenaar van Master of Code Nederland. Mijn energie en voldoening haal ik uit het prijsbewust ontwikkelen en leveren van maatwerk IT solutions die zijn toegespitst op het realiseren van de bedrijfsdoelstellingen van mijn klanten. Hierbij start ik een project vanuit het gewenste eindresultaat en toets altijd of dit aansluit aan de beoogde bedrijfsdoelstelling van de klant. Pas als dat duidelijk is ga ik samen met mijn organisatie echt voor u aan de slag. \n \nOnderscheidend in onze aanpak is de keuze om specifieke kennis op één plek te beleggen. Ons internationale ontwikkelcentrum concentreert zich op architectuur, bouw en beheer van softwareoplossingen. Ons lokale leveringsmanagement en onze marktkennis helpen u direct en ontzorgen u gedurende de realisatie en het beheer. Master of Code creëert hiermee een dusdanige balans zodat u profiteert van optimale verhouding van kosten en gewenst resultaat. \n \nIn het geval uw bedrijf in de fase verkeert waarbij de bedrijfsdoelstellingen, het bedrijfsmodel of de bedrijfspropositie aan verandering toe is denk ik graag met u mee. Met mijn achtergrond en netwerk kan ik u helpen bij het formuleren van de noodzakelijke aanpassingen en de vertaling daarvan naar een concrete realisatie. Experience Co Owner & Delivery/Sales Director Master Of Code Netherlands October 2014  – Present (11 months) Nederland Voor bedrijven is het vaak de vraag wat ze kunnen verwachten van een softwareontwikkelaar. Kan een ontwikkelaar bijvoorbeeld meedenken over en anticiperen op de marktontwikkeling van het mobiel ontsluiten van informatie? Verder leert de ervaring ons dat de afstemming van bedrijfsdoelstellingen en de vertaling daarvan naar een IT oplossing kostbaar en tijdrovend kan zijn. Onze overtuiging is dat wij het liever in één keer goed doen in plaats van achteraf nog eens de uitgangspunten te herdefiniëren. \n \nMaster of Code Nederland geeft helder, platformonafhankelijk advies en ontwerpt, bouwt en beheert aan de hand hiervan doeltreffende softwareoplossingen. Oplossingen op basis van internet en mobiele technologie ten behoeve van interactie met uw klanten, medewerkers, partners door ontsluiting van uw dienstverlening (backoffice). \n \nHet streven is om samen met u de beoogde bedrijfsdoelstellingen te behalen. Deze doelstellingen worden gekoppeld aan de juiste strategische richting én inrichting van de hele digitale keten. Master of Code houdt tussentijds toezicht en draagt de verantwoordelijkheid voor de volledigheid en betrouwbaarheid van de geboden softwareoplossing. \n \nMaster of Code Nederland maakt deel uit van een internationaal netwerk gevestigd in de US, Canada, de Ukraine en Nederland. Het netwerk bestaat uit een team van 100+ professionals en wordt vertegenwoordigd door applicatie architecten, software ontwikkelaars, project managers, business consultants en analysten, quality assurance en database specialisten. \n \nwww.masterofcode.nl Director Benelux for Application Consulting Oracle June 2012  –  September 2014  (2 years 4 months) Utrecht Area, Netherlands In this position Mark was responsible and accountable for the sales and delivery of Application Consulting Services aimed at IT Architecture, Project Management and Consulting Services to various customers in the Netherlands, Belgium and Luxembourg. Managing Director Accenture 2008  –  2012  (4 years) In this position Mark was responsible and accountable for the sales and delivery of Application Outsourcing Services aimed at onshore and offshore application maintenance, testing and development (SAP & Oracle) to various customers.  \nIn addition Mark was responsible and accountable for the Accenture Delivery Centre in the Netherlands delivering application skills, assets and services. Director Application Outsourcing Logica June 2007  –  February 2008  (9 months) As delivery director Mark was responsible for the delivery of on/near & offshore application services (steady state service and new business development) in the Netherlands. Application services exists of: development, testing, maintenance, packaged service (SAP, Oracle, Microsoft) and product engineering. Delivery Project Executive IBM January 2002  –  May 2007  (5 years 5 months) As Delivery Project Executive Mark was responsible for the delivery of service (infrastructure and application services) to strategic outsourcing customers like Essent, Mitsubishi Motors Europe, KLM, Volker Wessels and Norfolkline. Project Manager EMEA service Logistics IBM April 2000  –  December 2002  (2 years 9 months) As project manager Mark was responsible for design & implementation of the IBM ESL reverse logistical process and the allocation and charging methodology for IBM ESL. Project Manager CMG February 1998  –  March 2000  (2 years 2 months) As project manager I was responsible for the harmonisation of production planning processes and the implementation of standard planning software application for Unilever Food and Beverages Europe. \nAs project manager I was responsible for the implementation of the module Material Management of SAP R/3 at TNO Wegtransport. Software Engineer Business Applications Ericsson August 1996  –  January 1998  (1 year 6 months) Lead programmer SAP ABAP. Co Owner & Delivery/Sales Director Master Of Code Netherlands October 2014  – Present (11 months) Nederland Voor bedrijven is het vaak de vraag wat ze kunnen verwachten van een softwareontwikkelaar. Kan een ontwikkelaar bijvoorbeeld meedenken over en anticiperen op de marktontwikkeling van het mobiel ontsluiten van informatie? Verder leert de ervaring ons dat de afstemming van bedrijfsdoelstellingen en de vertaling daarvan naar een IT oplossing kostbaar en tijdrovend kan zijn. Onze overtuiging is dat wij het liever in één keer goed doen in plaats van achteraf nog eens de uitgangspunten te herdefiniëren. \n \nMaster of Code Nederland geeft helder, platformonafhankelijk advies en ontwerpt, bouwt en beheert aan de hand hiervan doeltreffende softwareoplossingen. Oplossingen op basis van internet en mobiele technologie ten behoeve van interactie met uw klanten, medewerkers, partners door ontsluiting van uw dienstverlening (backoffice). \n \nHet streven is om samen met u de beoogde bedrijfsdoelstellingen te behalen. Deze doelstellingen worden gekoppeld aan de juiste strategische richting én inrichting van de hele digitale keten. Master of Code houdt tussentijds toezicht en draagt de verantwoordelijkheid voor de volledigheid en betrouwbaarheid van de geboden softwareoplossing. \n \nMaster of Code Nederland maakt deel uit van een internationaal netwerk gevestigd in de US, Canada, de Ukraine en Nederland. Het netwerk bestaat uit een team van 100+ professionals en wordt vertegenwoordigd door applicatie architecten, software ontwikkelaars, project managers, business consultants en analysten, quality assurance en database specialisten. \n \nwww.masterofcode.nl Co Owner & Delivery/Sales Director Master Of Code Netherlands October 2014  – Present (11 months) Nederland Voor bedrijven is het vaak de vraag wat ze kunnen verwachten van een softwareontwikkelaar. Kan een ontwikkelaar bijvoorbeeld meedenken over en anticiperen op de marktontwikkeling van het mobiel ontsluiten van informatie? Verder leert de ervaring ons dat de afstemming van bedrijfsdoelstellingen en de vertaling daarvan naar een IT oplossing kostbaar en tijdrovend kan zijn. Onze overtuiging is dat wij het liever in één keer goed doen in plaats van achteraf nog eens de uitgangspunten te herdefiniëren. \n \nMaster of Code Nederland geeft helder, platformonafhankelijk advies en ontwerpt, bouwt en beheert aan de hand hiervan doeltreffende softwareoplossingen. Oplossingen op basis van internet en mobiele technologie ten behoeve van interactie met uw klanten, medewerkers, partners door ontsluiting van uw dienstverlening (backoffice). \n \nHet streven is om samen met u de beoogde bedrijfsdoelstellingen te behalen. Deze doelstellingen worden gekoppeld aan de juiste strategische richting én inrichting van de hele digitale keten. Master of Code houdt tussentijds toezicht en draagt de verantwoordelijkheid voor de volledigheid en betrouwbaarheid van de geboden softwareoplossing. \n \nMaster of Code Nederland maakt deel uit van een internationaal netwerk gevestigd in de US, Canada, de Ukraine en Nederland. Het netwerk bestaat uit een team van 100+ professionals en wordt vertegenwoordigd door applicatie architecten, software ontwikkelaars, project managers, business consultants en analysten, quality assurance en database specialisten. \n \nwww.masterofcode.nl Director Benelux for Application Consulting Oracle June 2012  –  September 2014  (2 years 4 months) Utrecht Area, Netherlands In this position Mark was responsible and accountable for the sales and delivery of Application Consulting Services aimed at IT Architecture, Project Management and Consulting Services to various customers in the Netherlands, Belgium and Luxembourg. Director Benelux for Application Consulting Oracle June 2012  –  September 2014  (2 years 4 months) Utrecht Area, Netherlands In this position Mark was responsible and accountable for the sales and delivery of Application Consulting Services aimed at IT Architecture, Project Management and Consulting Services to various customers in the Netherlands, Belgium and Luxembourg. Managing Director Accenture 2008  –  2012  (4 years) In this position Mark was responsible and accountable for the sales and delivery of Application Outsourcing Services aimed at onshore and offshore application maintenance, testing and development (SAP & Oracle) to various customers.  \nIn addition Mark was responsible and accountable for the Accenture Delivery Centre in the Netherlands delivering application skills, assets and services. Managing Director Accenture 2008  –  2012  (4 years) In this position Mark was responsible and accountable for the sales and delivery of Application Outsourcing Services aimed at onshore and offshore application maintenance, testing and development (SAP & Oracle) to various customers.  \nIn addition Mark was responsible and accountable for the Accenture Delivery Centre in the Netherlands delivering application skills, assets and services. Director Application Outsourcing Logica June 2007  –  February 2008  (9 months) As delivery director Mark was responsible for the delivery of on/near & offshore application services (steady state service and new business development) in the Netherlands. Application services exists of: development, testing, maintenance, packaged service (SAP, Oracle, Microsoft) and product engineering. Director Application Outsourcing Logica June 2007  –  February 2008  (9 months) As delivery director Mark was responsible for the delivery of on/near & offshore application services (steady state service and new business development) in the Netherlands. Application services exists of: development, testing, maintenance, packaged service (SAP, Oracle, Microsoft) and product engineering. Delivery Project Executive IBM January 2002  –  May 2007  (5 years 5 months) As Delivery Project Executive Mark was responsible for the delivery of service (infrastructure and application services) to strategic outsourcing customers like Essent, Mitsubishi Motors Europe, KLM, Volker Wessels and Norfolkline. Delivery Project Executive IBM January 2002  –  May 2007  (5 years 5 months) As Delivery Project Executive Mark was responsible for the delivery of service (infrastructure and application services) to strategic outsourcing customers like Essent, Mitsubishi Motors Europe, KLM, Volker Wessels and Norfolkline. Project Manager EMEA service Logistics IBM April 2000  –  December 2002  (2 years 9 months) As project manager Mark was responsible for design & implementation of the IBM ESL reverse logistical process and the allocation and charging methodology for IBM ESL. Project Manager EMEA service Logistics IBM April 2000  –  December 2002  (2 years 9 months) As project manager Mark was responsible for design & implementation of the IBM ESL reverse logistical process and the allocation and charging methodology for IBM ESL. Project Manager CMG February 1998  –  March 2000  (2 years 2 months) As project manager I was responsible for the harmonisation of production planning processes and the implementation of standard planning software application for Unilever Food and Beverages Europe. \nAs project manager I was responsible for the implementation of the module Material Management of SAP R/3 at TNO Wegtransport. Project Manager CMG February 1998  –  March 2000  (2 years 2 months) As project manager I was responsible for the harmonisation of production planning processes and the implementation of standard planning software application for Unilever Food and Beverages Europe. \nAs project manager I was responsible for the implementation of the module Material Management of SAP R/3 at TNO Wegtransport. Software Engineer Business Applications Ericsson August 1996  –  January 1998  (1 year 6 months) Lead programmer SAP ABAP. Software Engineer Business Applications Ericsson August 1996  –  January 1998  (1 year 6 months) Lead programmer SAP ABAP. Languages Dutch English German Dutch English German Dutch English German Skills Outsourcing IT Service Management Business Operations Change Management IT Project & Program... Interim Management Transition Management Project Management Skills  Outsourcing IT Service Management Business Operations Change Management IT Project & Program... Interim Management Transition Management Project Management Outsourcing IT Service Management Business Operations Change Management IT Project & Program... Interim Management Transition Management Project Management Outsourcing IT Service Management Business Operations Change Management IT Project & Program... Interim Management Transition Management Project Management Education Henley Business School MBA,  finance ,  marketing , HR,  strategic management ,  .... 2003  – 2007 Subject of dissertation was the outsourcing market in the Netherlands. The dissertation provided an academic analysis of the CSF's and a decision model for effective decision making in an outsourcing relationship. Hogeschool van Amsterdam & Open University ing,  logistics 1993  – 1996 Activities and Societies:  Vereniging voor Logistiek en Bedrijfskunde Studenten Henley Business School MBA,  finance ,  marketing , HR,  strategic management ,  .... 2003  – 2007 Subject of dissertation was the outsourcing market in the Netherlands. The dissertation provided an academic analysis of the CSF's and a decision model for effective decision making in an outsourcing relationship. Henley Business School MBA,  finance ,  marketing , HR,  strategic management ,  .... 2003  – 2007 Subject of dissertation was the outsourcing market in the Netherlands. The dissertation provided an academic analysis of the CSF's and a decision model for effective decision making in an outsourcing relationship. Henley Business School MBA,  finance ,  marketing , HR,  strategic management ,  .... 2003  – 2007 Subject of dissertation was the outsourcing market in the Netherlands. The dissertation provided an academic analysis of the CSF's and a decision model for effective decision making in an outsourcing relationship. Hogeschool van Amsterdam & Open University ing,  logistics 1993  – 1996 Activities and Societies:  Vereniging voor Logistiek en Bedrijfskunde Studenten Hogeschool van Amsterdam & Open University ing,  logistics 1993  – 1996 Activities and Societies:  Vereniging voor Logistiek en Bedrijfskunde Studenten Hogeschool van Amsterdam & Open University ing,  logistics 1993  – 1996 Activities and Societies:  Vereniging voor Logistiek en Bedrijfskunde Studenten ", "Summary Seeking a new challenge in IT which effectively utilizes my experience in the Technical field as Software Engineer, Business Applications know how and Team Management experience. Summary Seeking a new challenge in IT which effectively utilizes my experience in the Technical field as Software Engineer, Business Applications know how and Team Management experience. Seeking a new challenge in IT which effectively utilizes my experience in the Technical field as Software Engineer, Business Applications know how and Team Management experience. Seeking a new challenge in IT which effectively utilizes my experience in the Technical field as Software Engineer, Business Applications know how and Team Management experience. Experience Sales Manager / Software Solutions Solutions Pro April 2013  – Present (2 years 5 months) Pre-Sales Team Leader 'IBM Lotus Software' Prosoft Infomation Systems March 2007  –  March 2013  (6 years 1 month) - Covering all lotus software products from deep technical presentations, installation, software configuration and troubleshooting. Provide solution architecture and post sales support for all lotus software products. \n- Technical Presales presentation and proof of concept installations and demos. \n- Support IBM Lotus customers by phone or visits. \n- Assign calls and visits to the technical members in my team. \n- Follow up with customers to handle the upgrading and renewal tasks. \n- Assign the new installation tasks to the technical members in my team. \n- Provide support for customers and our partners’ engineers. \n- Delivering sales sessions to our sales members in IBM’s Business Partners. \n- Starting from 2009 I started to do the Sales role occasionally in some opportunities Certified Technical Instructor Synergy Professional Services May 2005  –  February 2007  (1 year 10 months) Working in the education department as a certified technical instructor for Microsoft MCSE 2003 Messaging and Security Tracks. Certified Technical Support Engineer Synergy Professional Services February 2003  –  April 2005  (2 years 3 months) Working in the technical service department as a certified technical support engineer for the existing customers throw the support contract. Technical Specialist CIS August 2001  –  January 2003  (1 year 6 months) Develop and support business workflow applications on Lotus platform, to support customers in problem solving. Also making proof-of-concept, reviews, stress testing, end user training and technical implementations. Sales Manager / Software Solutions Solutions Pro April 2013  – Present (2 years 5 months) Sales Manager / Software Solutions Solutions Pro April 2013  – Present (2 years 5 months) Pre-Sales Team Leader 'IBM Lotus Software' Prosoft Infomation Systems March 2007  –  March 2013  (6 years 1 month) - Covering all lotus software products from deep technical presentations, installation, software configuration and troubleshooting. Provide solution architecture and post sales support for all lotus software products. \n- Technical Presales presentation and proof of concept installations and demos. \n- Support IBM Lotus customers by phone or visits. \n- Assign calls and visits to the technical members in my team. \n- Follow up with customers to handle the upgrading and renewal tasks. \n- Assign the new installation tasks to the technical members in my team. \n- Provide support for customers and our partners’ engineers. \n- Delivering sales sessions to our sales members in IBM’s Business Partners. \n- Starting from 2009 I started to do the Sales role occasionally in some opportunities Pre-Sales Team Leader 'IBM Lotus Software' Prosoft Infomation Systems March 2007  –  March 2013  (6 years 1 month) - Covering all lotus software products from deep technical presentations, installation, software configuration and troubleshooting. Provide solution architecture and post sales support for all lotus software products. \n- Technical Presales presentation and proof of concept installations and demos. \n- Support IBM Lotus customers by phone or visits. \n- Assign calls and visits to the technical members in my team. \n- Follow up with customers to handle the upgrading and renewal tasks. \n- Assign the new installation tasks to the technical members in my team. \n- Provide support for customers and our partners’ engineers. \n- Delivering sales sessions to our sales members in IBM’s Business Partners. \n- Starting from 2009 I started to do the Sales role occasionally in some opportunities Certified Technical Instructor Synergy Professional Services May 2005  –  February 2007  (1 year 10 months) Working in the education department as a certified technical instructor for Microsoft MCSE 2003 Messaging and Security Tracks. Certified Technical Instructor Synergy Professional Services May 2005  –  February 2007  (1 year 10 months) Working in the education department as a certified technical instructor for Microsoft MCSE 2003 Messaging and Security Tracks. Certified Technical Support Engineer Synergy Professional Services February 2003  –  April 2005  (2 years 3 months) Working in the technical service department as a certified technical support engineer for the existing customers throw the support contract. Certified Technical Support Engineer Synergy Professional Services February 2003  –  April 2005  (2 years 3 months) Working in the technical service department as a certified technical support engineer for the existing customers throw the support contract. Technical Specialist CIS August 2001  –  January 2003  (1 year 6 months) Develop and support business workflow applications on Lotus platform, to support customers in problem solving. Also making proof-of-concept, reviews, stress testing, end user training and technical implementations. Technical Specialist CIS August 2001  –  January 2003  (1 year 6 months) Develop and support business workflow applications on Lotus platform, to support customers in problem solving. Also making proof-of-concept, reviews, stress testing, end user training and technical implementations. Languages Arabic English Arabic English Arabic English Skills Pre-sales ITIL Cloud Computing System Administration Team Management Team Leadership Virtualization Solution Architecture Windows Linux Cisco Technologies Data Center Servers Microsoft Technologies IBM Products ESXi Microsoft Exchange MCSE 2003 Microsoft Certified... Microsoft Office Microsoft Certified... Certified Lotus... Active Directory Databases Microsoft SQL Server VMware See 11+     See less Skills  Pre-sales ITIL Cloud Computing System Administration Team Management Team Leadership Virtualization Solution Architecture Windows Linux Cisco Technologies Data Center Servers Microsoft Technologies IBM Products ESXi Microsoft Exchange MCSE 2003 Microsoft Certified... Microsoft Office Microsoft Certified... Certified Lotus... Active Directory Databases Microsoft SQL Server VMware See 11+     See less Pre-sales ITIL Cloud Computing System Administration Team Management Team Leadership Virtualization Solution Architecture Windows Linux Cisco Technologies Data Center Servers Microsoft Technologies IBM Products ESXi Microsoft Exchange MCSE 2003 Microsoft Certified... Microsoft Office Microsoft Certified... Certified Lotus... Active Directory Databases Microsoft SQL Server VMware See 11+     See less Pre-sales ITIL Cloud Computing System Administration Team Management Team Leadership Virtualization Solution Architecture Windows Linux Cisco Technologies Data Center Servers Microsoft Technologies IBM Products ESXi Microsoft Exchange MCSE 2003 Microsoft Certified... Microsoft Office Microsoft Certified... Certified Lotus... Active Directory Databases Microsoft SQL Server VMware See 11+     See less Education October 6 University BS, Computer Science 1995  – 2000 October 6 University BS, Computer Science 1995  – 2000 October 6 University BS, Computer Science 1995  – 2000 October 6 University BS, Computer Science 1995  – 2000 Honors & Awards Additional Honors & Awards PROSOFT’s Best Pre-Sales of the year 2009, 2010 & 2011 Additional Honors & Awards PROSOFT’s Best Pre-Sales of the year 2009, 2010 & 2011 Additional Honors & Awards PROSOFT’s Best Pre-Sales of the year 2009, 2010 & 2011 Additional Honors & Awards PROSOFT’s Best Pre-Sales of the year 2009, 2010 & 2011 ", "Experience Principal Engineer/Manager Qualcomm India January 2005  – Present (10 years 8 months) Hyderabad I work in Customer Engineering team at QCT and my job involves commercializing the Qualcomm MSM Products as end user products. Lead Engineer - CIsco ODC HCL Technologies April 2002  –  December 2004  (2 years 9 months) Chennai, India Woked at Cisco Offshore Development Centre adminstered by HCL Technologies. Was part of Cisco Systems most suscessfull ISBU -Had worked in Catalyst 6500 Platform SW sustainance team. Day to day job involved fixing Internal and Field reported bugs in Platform SW modules in Cisco IOS for Cat6K family of products. Senior Software Engineer CoSystems India Pvt Ltd. June 2000  –  April 2002  (1 year 11 months) Bangalore BSP development engineer- Worked on several Turn Key Projects for Japanes Customers OKI Networks, NEC etc.. Skills: BSP bring up and Platform SW modules Scientist/Engineer - Grade \"SD\" ISRO SATELLITE CENTER, BANGALORE August 1997  –  June 2000  (2 years 11 months) Bangalore Was part of Communication Systems Group. \nResponsbilities include System level simulation of Transponder Front End ports, passive/active radio circuits and testing.Worked on INSAT-2D, IRS-P5 projects Transponder module design and development which were succesfully launched into orbits and provided crucial communications services for the nation. Software Engineer Trigent Software January 1997  –  August 1997  (8 months) Bangalore Worked as Software engineer for Business Applications Testing in different client projects. Principal Engineer/Manager Qualcomm India January 2005  – Present (10 years 8 months) Hyderabad I work in Customer Engineering team at QCT and my job involves commercializing the Qualcomm MSM Products as end user products. Principal Engineer/Manager Qualcomm India January 2005  – Present (10 years 8 months) Hyderabad I work in Customer Engineering team at QCT and my job involves commercializing the Qualcomm MSM Products as end user products. Lead Engineer - CIsco ODC HCL Technologies April 2002  –  December 2004  (2 years 9 months) Chennai, India Woked at Cisco Offshore Development Centre adminstered by HCL Technologies. Was part of Cisco Systems most suscessfull ISBU -Had worked in Catalyst 6500 Platform SW sustainance team. Day to day job involved fixing Internal and Field reported bugs in Platform SW modules in Cisco IOS for Cat6K family of products. Lead Engineer - CIsco ODC HCL Technologies April 2002  –  December 2004  (2 years 9 months) Chennai, India Woked at Cisco Offshore Development Centre adminstered by HCL Technologies. Was part of Cisco Systems most suscessfull ISBU -Had worked in Catalyst 6500 Platform SW sustainance team. Day to day job involved fixing Internal and Field reported bugs in Platform SW modules in Cisco IOS for Cat6K family of products. Senior Software Engineer CoSystems India Pvt Ltd. June 2000  –  April 2002  (1 year 11 months) Bangalore BSP development engineer- Worked on several Turn Key Projects for Japanes Customers OKI Networks, NEC etc.. Skills: BSP bring up and Platform SW modules Senior Software Engineer CoSystems India Pvt Ltd. June 2000  –  April 2002  (1 year 11 months) Bangalore BSP development engineer- Worked on several Turn Key Projects for Japanes Customers OKI Networks, NEC etc.. Skills: BSP bring up and Platform SW modules Scientist/Engineer - Grade \"SD\" ISRO SATELLITE CENTER, BANGALORE August 1997  –  June 2000  (2 years 11 months) Bangalore Was part of Communication Systems Group. \nResponsbilities include System level simulation of Transponder Front End ports, passive/active radio circuits and testing.Worked on INSAT-2D, IRS-P5 projects Transponder module design and development which were succesfully launched into orbits and provided crucial communications services for the nation. Scientist/Engineer - Grade \"SD\" ISRO SATELLITE CENTER, BANGALORE August 1997  –  June 2000  (2 years 11 months) Bangalore Was part of Communication Systems Group. \nResponsbilities include System level simulation of Transponder Front End ports, passive/active radio circuits and testing.Worked on INSAT-2D, IRS-P5 projects Transponder module design and development which were succesfully launched into orbits and provided crucial communications services for the nation. Software Engineer Trigent Software January 1997  –  August 1997  (8 months) Bangalore Worked as Software engineer for Business Applications Testing in different client projects. Software Engineer Trigent Software January 1997  –  August 1997  (8 months) Bangalore Worked as Software engineer for Business Applications Testing in different client projects. Education Cochin University of Science and Technology M.Tech,  Electronics 1994  – 1996 Nagarjuna University B.Tech,  Electronics & Communications Engineering 1990  – 1994 Cochin University of Science and Technology M.Tech,  Electronics 1994  – 1996 Cochin University of Science and Technology M.Tech,  Electronics 1994  – 1996 Cochin University of Science and Technology M.Tech,  Electronics 1994  – 1996 Nagarjuna University B.Tech,  Electronics & Communications Engineering 1990  – 1994 Nagarjuna University B.Tech,  Electronics & Communications Engineering 1990  – 1994 Nagarjuna University B.Tech,  Electronics & Communications Engineering 1990  – 1994 ", "Summary Professional expertise at software development for optical network products - Currently managing projects of optical line system software group at Infinera. Summary Professional expertise at software development for optical network products - Currently managing projects of optical line system software group at Infinera. Professional expertise at software development for optical network products - Currently managing projects of optical line system software group at Infinera. Professional expertise at software development for optical network products - Currently managing projects of optical line system software group at Infinera. Experience Senior Manager Infinera May 2015  – Present (4 months) Bengaluru Area, India Engineering Management for optical line system software products Consultant Nittio Solutions Private Limited December 2014  –  April 2015  (5 months) Product road-mapping, software development, customer training. Senior Product Manager, Software Infinera May 2014  –  December 2014  (8 months) Bangalore Embedded Software Product Line Management for Infinera products.  \n \nBring in new value added software features to the end product, prioritize customer feature requests, make PRD, interface with sales for product queries and deployment support, internal feature requests from support teams and more... Staff Engineer, Software Infinera February 2007  –  April 2014  (7 years 3 months) Embedded software development for supporting Digital / DWDM FRU's. \n \nInteract with cross-functional teams like Firmware and Hardware during initial development of a line card variant - Perform L-1 and L-2 tests for a new line card variant. Assist testing team during System Integration and System Validation Test Phases for the new line card variant. Assistance for Customer Support teams. Senior Software Engineer Future Software December 2004  –  February 2007  (2 years 3 months) Sustain the Optical Transport Product ( MSPP ) of Nortel. Software Engineer Infosys Technologies June 2003  –  December 2004  (1 year 7 months) Software Engineer - Business Applications - DB2 Senior Manager Infinera May 2015  – Present (4 months) Bengaluru Area, India Engineering Management for optical line system software products Senior Manager Infinera May 2015  – Present (4 months) Bengaluru Area, India Engineering Management for optical line system software products Consultant Nittio Solutions Private Limited December 2014  –  April 2015  (5 months) Product road-mapping, software development, customer training. Consultant Nittio Solutions Private Limited December 2014  –  April 2015  (5 months) Product road-mapping, software development, customer training. Senior Product Manager, Software Infinera May 2014  –  December 2014  (8 months) Bangalore Embedded Software Product Line Management for Infinera products.  \n \nBring in new value added software features to the end product, prioritize customer feature requests, make PRD, interface with sales for product queries and deployment support, internal feature requests from support teams and more... Senior Product Manager, Software Infinera May 2014  –  December 2014  (8 months) Bangalore Embedded Software Product Line Management for Infinera products.  \n \nBring in new value added software features to the end product, prioritize customer feature requests, make PRD, interface with sales for product queries and deployment support, internal feature requests from support teams and more... Staff Engineer, Software Infinera February 2007  –  April 2014  (7 years 3 months) Embedded software development for supporting Digital / DWDM FRU's. \n \nInteract with cross-functional teams like Firmware and Hardware during initial development of a line card variant - Perform L-1 and L-2 tests for a new line card variant. Assist testing team during System Integration and System Validation Test Phases for the new line card variant. Assistance for Customer Support teams. Staff Engineer, Software Infinera February 2007  –  April 2014  (7 years 3 months) Embedded software development for supporting Digital / DWDM FRU's. \n \nInteract with cross-functional teams like Firmware and Hardware during initial development of a line card variant - Perform L-1 and L-2 tests for a new line card variant. Assist testing team during System Integration and System Validation Test Phases for the new line card variant. Assistance for Customer Support teams. Senior Software Engineer Future Software December 2004  –  February 2007  (2 years 3 months) Sustain the Optical Transport Product ( MSPP ) of Nortel. Senior Software Engineer Future Software December 2004  –  February 2007  (2 years 3 months) Sustain the Optical Transport Product ( MSPP ) of Nortel. Software Engineer Infosys Technologies June 2003  –  December 2004  (1 year 7 months) Software Engineer - Business Applications - DB2 Software Engineer Infosys Technologies June 2003  –  December 2004  (1 year 7 months) Software Engineer - Business Applications - DB2 Skills C++ QNX OTN DWDM Embedded Software RTOS C Telecommunications Product Management Device Drivers Skills  C++ QNX OTN DWDM Embedded Software RTOS C Telecommunications Product Management Device Drivers C++ QNX OTN DWDM Embedded Software RTOS C Telecommunications Product Management Device Drivers C++ QNX OTN DWDM Embedded Software RTOS C Telecommunications Product Management Device Drivers Education Anna University B.Tech,  Instrumentation Technology 1999  – 2003 Anna University B.Tech,  Instrumentation Technology 1999  – 2003 Anna University B.Tech,  Instrumentation Technology 1999  – 2003 Anna University B.Tech,  Instrumentation Technology 1999  – 2003 ", "Experience Senior Consultant EY March 2014  – Present (1 year 6 months) Mumbai Area, India Senior Consultant for IT advisory services Business Analyst Colgate Palmolive January 2012  –  December 2013  (2 years) Powai, Mumbai Assistant Manager Mahindra & Mahindra October 2010  –  January 2012  (1 year 4 months) Planning Officer Vishay Intertechnology, Inc. January 2010  –  September 2010  (9 months) Mumbai Area, India Planning officer responsible for Semiconductor product lines Software Engineer (Business Applications) Intertec Software Pvt Ltd September 2009  –  January 2010  (5 months) SNP Planner (SAP SCM 4.0) Mahindra Renault Pvt Ltd November 2007  –  March 2009  (1 year 5 months) Senior Consultant EY March 2014  – Present (1 year 6 months) Mumbai Area, India Senior Consultant for IT advisory services Senior Consultant EY March 2014  – Present (1 year 6 months) Mumbai Area, India Senior Consultant for IT advisory services Business Analyst Colgate Palmolive January 2012  –  December 2013  (2 years) Powai, Mumbai Business Analyst Colgate Palmolive January 2012  –  December 2013  (2 years) Powai, Mumbai Assistant Manager Mahindra & Mahindra October 2010  –  January 2012  (1 year 4 months) Assistant Manager Mahindra & Mahindra October 2010  –  January 2012  (1 year 4 months) Planning Officer Vishay Intertechnology, Inc. January 2010  –  September 2010  (9 months) Mumbai Area, India Planning officer responsible for Semiconductor product lines Planning Officer Vishay Intertechnology, Inc. January 2010  –  September 2010  (9 months) Mumbai Area, India Planning officer responsible for Semiconductor product lines Software Engineer (Business Applications) Intertec Software Pvt Ltd September 2009  –  January 2010  (5 months) Software Engineer (Business Applications) Intertec Software Pvt Ltd September 2009  –  January 2010  (5 months) SNP Planner (SAP SCM 4.0) Mahindra Renault Pvt Ltd November 2007  –  March 2009  (1 year 5 months) SNP Planner (SAP SCM 4.0) Mahindra Renault Pvt Ltd November 2007  –  March 2009  (1 year 5 months) Skills SAP APO Supply Chain Supply Chain Management Project Planning Demand Planning SAP R/3 SAP Production Planning SAP ERP MRP Supply Chain... Business Process Skills  SAP APO Supply Chain Supply Chain Management Project Planning Demand Planning SAP R/3 SAP Production Planning SAP ERP MRP Supply Chain... Business Process SAP APO Supply Chain Supply Chain Management Project Planning Demand Planning SAP R/3 SAP Production Planning SAP ERP MRP Supply Chain... Business Process SAP APO Supply Chain Supply Chain Management Project Planning Demand Planning SAP R/3 SAP Production Planning SAP ERP MRP Supply Chain... Business Process Education University of Mumbai B.E,  Computer Engineering 2002  – 2007 D.G.Ruparel College HSC,  Science 2000  – 2002 John XXIII High School SSC 1999  – 2000 University of Mumbai B.E,  Computer Engineering 2002  – 2007 University of Mumbai B.E,  Computer Engineering 2002  – 2007 University of Mumbai B.E,  Computer Engineering 2002  – 2007 D.G.Ruparel College HSC,  Science 2000  – 2002 D.G.Ruparel College HSC,  Science 2000  – 2002 D.G.Ruparel College HSC,  Science 2000  – 2002 John XXIII High School SSC 1999  – 2000 John XXIII High School SSC 1999  – 2000 John XXIII High School SSC 1999  – 2000 ", "Experience Information Technology Specialist State of Minnesota DEED November 2007  – Present (7 years 10 months) Design and develop web-based information systems. ASP.net, MS SQL Server, Visual Studio. Software Engineer, Business Applications Star Tribune November 1981  –  September 2007  (25 years 11 months) Information Technology Specialist State of Minnesota DEED November 2007  – Present (7 years 10 months) Design and develop web-based information systems. ASP.net, MS SQL Server, Visual Studio. Information Technology Specialist State of Minnesota DEED November 2007  – Present (7 years 10 months) Design and develop web-based information systems. ASP.net, MS SQL Server, Visual Studio. Software Engineer, Business Applications Star Tribune November 1981  –  September 2007  (25 years 11 months) Software Engineer, Business Applications Star Tribune November 1981  –  September 2007  (25 years 11 months) Education University of Minnesota-Twin Cities BA,  English Literature 1978  – 1980 University of Minnesota-Twin Cities BA,  English Literature 1978  – 1980 University of Minnesota-Twin Cities BA,  English Literature 1978  – 1980 University of Minnesota-Twin Cities BA,  English Literature 1978  – 1980 ", "Summary Journalism, Data Visualization, University Teaching, Digital Media Producer. \n \nSoftware development background. \n \nAvailable to conduct data visualization workshops for journalists and other communicators. \n \n \nKnight Science Journalism Fellow, Massachusetts Institute of Technology \nMaster of Science, Journalism, Columbia University \nBachelor's Degree, Economics, University of Massachusetts \nCertificate in object-oriented programming, Clark University \n \nTwitter: @dmfinch \nhttp://www.diannemfinch.com \n \nConsulting, speaking, teaching. \nData-driven storytelling, data mining, analysis and visualization \n \nSpeaking events and workshops include: \n- AEJMC San Francisco, 2015 \n- Boston University Storytelling with Data, Summer 2015 \n- Society of American Business Editors and Reporters: Data Visualization Workshop 2014- AEJMC Montreal, 2014 \n- World Conference of Science Journalists: Data Visualization Lecture and Workshop 2011 \n- National Association of Science Writers: Data Visualization Workshop, Flagstaff, AZ: 2011 \n- Guest lecturer on data journalism and digital media for classes at Harvard University and Boston University 2011 and 2012 Summary Journalism, Data Visualization, University Teaching, Digital Media Producer. \n \nSoftware development background. \n \nAvailable to conduct data visualization workshops for journalists and other communicators. \n \n \nKnight Science Journalism Fellow, Massachusetts Institute of Technology \nMaster of Science, Journalism, Columbia University \nBachelor's Degree, Economics, University of Massachusetts \nCertificate in object-oriented programming, Clark University \n \nTwitter: @dmfinch \nhttp://www.diannemfinch.com \n \nConsulting, speaking, teaching. \nData-driven storytelling, data mining, analysis and visualization \n \nSpeaking events and workshops include: \n- AEJMC San Francisco, 2015 \n- Boston University Storytelling with Data, Summer 2015 \n- Society of American Business Editors and Reporters: Data Visualization Workshop 2014- AEJMC Montreal, 2014 \n- World Conference of Science Journalists: Data Visualization Lecture and Workshop 2011 \n- National Association of Science Writers: Data Visualization Workshop, Flagstaff, AZ: 2011 \n- Guest lecturer on data journalism and digital media for classes at Harvard University and Boston University 2011 and 2012 Journalism, Data Visualization, University Teaching, Digital Media Producer. \n \nSoftware development background. \n \nAvailable to conduct data visualization workshops for journalists and other communicators. \n \n \nKnight Science Journalism Fellow, Massachusetts Institute of Technology \nMaster of Science, Journalism, Columbia University \nBachelor's Degree, Economics, University of Massachusetts \nCertificate in object-oriented programming, Clark University \n \nTwitter: @dmfinch \nhttp://www.diannemfinch.com \n \nConsulting, speaking, teaching. \nData-driven storytelling, data mining, analysis and visualization \n \nSpeaking events and workshops include: \n- AEJMC San Francisco, 2015 \n- Boston University Storytelling with Data, Summer 2015 \n- Society of American Business Editors and Reporters: Data Visualization Workshop 2014- AEJMC Montreal, 2014 \n- World Conference of Science Journalists: Data Visualization Lecture and Workshop 2011 \n- National Association of Science Writers: Data Visualization Workshop, Flagstaff, AZ: 2011 \n- Guest lecturer on data journalism and digital media for classes at Harvard University and Boston University 2011 and 2012 Journalism, Data Visualization, University Teaching, Digital Media Producer. \n \nSoftware development background. \n \nAvailable to conduct data visualization workshops for journalists and other communicators. \n \n \nKnight Science Journalism Fellow, Massachusetts Institute of Technology \nMaster of Science, Journalism, Columbia University \nBachelor's Degree, Economics, University of Massachusetts \nCertificate in object-oriented programming, Clark University \n \nTwitter: @dmfinch \nhttp://www.diannemfinch.com \n \nConsulting, speaking, teaching. \nData-driven storytelling, data mining, analysis and visualization \n \nSpeaking events and workshops include: \n- AEJMC San Francisco, 2015 \n- Boston University Storytelling with Data, Summer 2015 \n- Society of American Business Editors and Reporters: Data Visualization Workshop 2014- AEJMC Montreal, 2014 \n- World Conference of Science Journalists: Data Visualization Lecture and Workshop 2011 \n- National Association of Science Writers: Data Visualization Workshop, Flagstaff, AZ: 2011 \n- Guest lecturer on data journalism and digital media for classes at Harvard University and Boston University 2011 and 2012 Experience Visiting Professor of Journalism, Elon University Donald W. Reynolds National Center for Business Journalism February 2013  – Present (2 years 7 months) Elon, NC Teaching: \nMedia Writing, Web Publishing, Business Reporting, Data Visualization. \nCurrently writing a book on data visualization / big data. Digital Media Manager & Instructor / KSJ at MIT Massachusetts Institute of Technology (MIT) 2008  –  2012  (4 years) MIT, Cambridge, MA Built KSJ's multimedia training program from scratch. Involved selecting all video and audio equipment - from recorders and mics to video editing software. Installed software, computers and server. Designed video and audio production environment and workflow process. Taught data visualization, audio production and basic website development. Assisted 12 fellows with Final Cut Pro 7, Audition and other software. At times, participated on the selection committee for recruiting new fellows. Presented at conferences on data visualization in US and abroad.  \n \nGuest instructor on data visualization and digital media production in journalism classes at Harvard and Boston University.  \n \nJoined in 2008 as one of 11 Knight Science Journalism fellows. Audited courses at Harvard and MIT on neurobiology, microbiology, environmental science, stem cell research and other topics. Built a microbial fuel cell that produced electricity using bacteria in a lab class at Harvard. Digital Media Manager & Instructor Multimedia Producer/Journalist/Instructor 2008  –  2012  (4 years) Cambridge, MA Same as above Digital Media Manager & Instructor MIT 2008  –  2012  (4 years) Cambridge, MA Same as above. Health & Science Reporter New Hampshire Public Radio January 2003  –  July 2008  (5 years 7 months) Concord Hired as the sole health and science reporter in 2006. Covered stories on genetics, robotic heart surgery, healthcare policy, mental health, hospital-acquired infections and other topics. Covered presidential primary. \n \nBefore accepting a full-time position with NHPR in 2006 - produced freelance audio stories for the station on topics including bio-diesel fuel, viruses affecting nursing homes and other topics.  \n \nOther freelance:  \nProduced and wrote stories for Marketplace Productions, Weekend America, Mass High Tech Magazine and other print outlets as a freelancer. Reporter-General Assignment Bloomberg LP 2004  –  January 2006  (2 years) Boston Primarily covered finance including stories on earnings, markets, mergers and acquisitions. Also covered Boston's Big Dig and reported on science and healthcare. My stories published in New York Times, Boston Globe, Chicago Tribune, Philadelphia Inquirer and others. Reporter-Intern Bloomberg LP June 2003  –  August 2003  (3 months) New York, NY Worked as an intern on the corporate finance desk. Filed stories on finance, corporate governance. Two stories published in New York Times. News Data Editor & Consultant Associated Press 2000  –  2002  (2 years) New York, NY While consulting to the software industry, acquired a contract with the AP to conduct data cleaning, analysis and trend-spotting using new Census 2000 data. Programmed an algorithm (dissimilarity index) to calculate racial integration in neighborhoods at the Census block-level for large US cities. Used SAS for filtering data. Assisted reporters with data-driven story ideas. Wrote and co-authored stories as well - including one on race relations in Moreno Valley, California. The contract also included digging into databases beyond Census, including DOT. \n \n \nUpon completion of the contract, attended Columbia University and acquired a master's in journalism - focusing on public radio production. Product Management - Software Industry - US and Asia Software Industry 1995  –  2002  (7 years) USA After returning from Tokyo, I was hired as the Asia Pacific Technical Support Manager at FTP Software in Andover, MA. Created a support channel in Asia for FTP, including a development group in South Korea. Promoted to product manager of the \"Cyber Agent\" technology - one of the first Java-based applications that communicated from the client to software roaming the Internet. Cyber Agents are akin to today's Internet \"cookies\".  \n \nWhen FTP Software closed its doors along with many dotcom companies, Segue Software hired me as a product manager for Java-based technology that conducts QA (quality assurance) testing automatically on software applications and websites. Managed product development from the marketing side - including the \"Silk Bean\" product that sits on a client machine to communicate with Segue's other Java-based testing software. \n \nBy 1997, started my own consulting business offering services including SAS programming, training on \"internationalization\" and \"localization\" of software for Asian markets and introducing software companies to potential partners in Japan and other Asian countries. IT Director - ASI Market Research, Tokyo, Japan Nielsen 1992  –  1995  (3 years) Tokyo, Japan Designed and implemented an English-Japanese network for the Tokyo office following an analysis of the market research work process. Removed outdated IBM mainframe prior to installation. Automated the survey research process, which was still conducted via paper surveys. \n \nTraveled throughout Asia to work with sister companies on design plans for an inter-company wide area network.  \n \nThis was the first bilingual network and application in the market research industry in Japan. Windows had just been released in Japanese for the first time.  \n \nASI was purchased by Dun & Bradstreet while I was there - later sold to A.C. Nielsen. Today, the firm still collects data on consumer behavior throughout Asia. Software Engineer - Business Applications Programmer-Analyst 1983  –  1991  (8 years) USA Early career: Started out as a computer programmer using legacy languages including FORTRAN, Vax Basic, DBASE II & Clipper, Pascal and others. Designed business and accounting systems from concept to product launch - including modules for Kaiser Aluminum's inventory process. Developed systems for clients of Online Data Processing - based in Washington State at the time. \n \nContinued to work part-time in programming while attending the University of Massachusetts. Visiting Professor of Journalism, Elon University Donald W. Reynolds National Center for Business Journalism February 2013  – Present (2 years 7 months) Elon, NC Teaching: \nMedia Writing, Web Publishing, Business Reporting, Data Visualization. \nCurrently writing a book on data visualization / big data. Visiting Professor of Journalism, Elon University Donald W. Reynolds National Center for Business Journalism February 2013  – Present (2 years 7 months) Elon, NC Teaching: \nMedia Writing, Web Publishing, Business Reporting, Data Visualization. \nCurrently writing a book on data visualization / big data. Digital Media Manager & Instructor / KSJ at MIT Massachusetts Institute of Technology (MIT) 2008  –  2012  (4 years) MIT, Cambridge, MA Built KSJ's multimedia training program from scratch. Involved selecting all video and audio equipment - from recorders and mics to video editing software. Installed software, computers and server. Designed video and audio production environment and workflow process. Taught data visualization, audio production and basic website development. Assisted 12 fellows with Final Cut Pro 7, Audition and other software. At times, participated on the selection committee for recruiting new fellows. Presented at conferences on data visualization in US and abroad.  \n \nGuest instructor on data visualization and digital media production in journalism classes at Harvard and Boston University.  \n \nJoined in 2008 as one of 11 Knight Science Journalism fellows. Audited courses at Harvard and MIT on neurobiology, microbiology, environmental science, stem cell research and other topics. Built a microbial fuel cell that produced electricity using bacteria in a lab class at Harvard. Digital Media Manager & Instructor / KSJ at MIT Massachusetts Institute of Technology (MIT) 2008  –  2012  (4 years) MIT, Cambridge, MA Built KSJ's multimedia training program from scratch. Involved selecting all video and audio equipment - from recorders and mics to video editing software. Installed software, computers and server. Designed video and audio production environment and workflow process. Taught data visualization, audio production and basic website development. Assisted 12 fellows with Final Cut Pro 7, Audition and other software. At times, participated on the selection committee for recruiting new fellows. Presented at conferences on data visualization in US and abroad.  \n \nGuest instructor on data visualization and digital media production in journalism classes at Harvard and Boston University.  \n \nJoined in 2008 as one of 11 Knight Science Journalism fellows. Audited courses at Harvard and MIT on neurobiology, microbiology, environmental science, stem cell research and other topics. Built a microbial fuel cell that produced electricity using bacteria in a lab class at Harvard. Digital Media Manager & Instructor Multimedia Producer/Journalist/Instructor 2008  –  2012  (4 years) Cambridge, MA Same as above Digital Media Manager & Instructor Multimedia Producer/Journalist/Instructor 2008  –  2012  (4 years) Cambridge, MA Same as above Digital Media Manager & Instructor MIT 2008  –  2012  (4 years) Cambridge, MA Same as above. Digital Media Manager & Instructor MIT 2008  –  2012  (4 years) Cambridge, MA Same as above. Health & Science Reporter New Hampshire Public Radio January 2003  –  July 2008  (5 years 7 months) Concord Hired as the sole health and science reporter in 2006. Covered stories on genetics, robotic heart surgery, healthcare policy, mental health, hospital-acquired infections and other topics. Covered presidential primary. \n \nBefore accepting a full-time position with NHPR in 2006 - produced freelance audio stories for the station on topics including bio-diesel fuel, viruses affecting nursing homes and other topics.  \n \nOther freelance:  \nProduced and wrote stories for Marketplace Productions, Weekend America, Mass High Tech Magazine and other print outlets as a freelancer. Health & Science Reporter New Hampshire Public Radio January 2003  –  July 2008  (5 years 7 months) Concord Hired as the sole health and science reporter in 2006. Covered stories on genetics, robotic heart surgery, healthcare policy, mental health, hospital-acquired infections and other topics. Covered presidential primary. \n \nBefore accepting a full-time position with NHPR in 2006 - produced freelance audio stories for the station on topics including bio-diesel fuel, viruses affecting nursing homes and other topics.  \n \nOther freelance:  \nProduced and wrote stories for Marketplace Productions, Weekend America, Mass High Tech Magazine and other print outlets as a freelancer. Reporter-General Assignment Bloomberg LP 2004  –  January 2006  (2 years) Boston Primarily covered finance including stories on earnings, markets, mergers and acquisitions. Also covered Boston's Big Dig and reported on science and healthcare. My stories published in New York Times, Boston Globe, Chicago Tribune, Philadelphia Inquirer and others. Reporter-General Assignment Bloomberg LP 2004  –  January 2006  (2 years) Boston Primarily covered finance including stories on earnings, markets, mergers and acquisitions. Also covered Boston's Big Dig and reported on science and healthcare. My stories published in New York Times, Boston Globe, Chicago Tribune, Philadelphia Inquirer and others. Reporter-Intern Bloomberg LP June 2003  –  August 2003  (3 months) New York, NY Worked as an intern on the corporate finance desk. Filed stories on finance, corporate governance. Two stories published in New York Times. Reporter-Intern Bloomberg LP June 2003  –  August 2003  (3 months) New York, NY Worked as an intern on the corporate finance desk. Filed stories on finance, corporate governance. Two stories published in New York Times. News Data Editor & Consultant Associated Press 2000  –  2002  (2 years) New York, NY While consulting to the software industry, acquired a contract with the AP to conduct data cleaning, analysis and trend-spotting using new Census 2000 data. Programmed an algorithm (dissimilarity index) to calculate racial integration in neighborhoods at the Census block-level for large US cities. Used SAS for filtering data. Assisted reporters with data-driven story ideas. Wrote and co-authored stories as well - including one on race relations in Moreno Valley, California. The contract also included digging into databases beyond Census, including DOT. \n \n \nUpon completion of the contract, attended Columbia University and acquired a master's in journalism - focusing on public radio production. News Data Editor & Consultant Associated Press 2000  –  2002  (2 years) New York, NY While consulting to the software industry, acquired a contract with the AP to conduct data cleaning, analysis and trend-spotting using new Census 2000 data. Programmed an algorithm (dissimilarity index) to calculate racial integration in neighborhoods at the Census block-level for large US cities. Used SAS for filtering data. Assisted reporters with data-driven story ideas. Wrote and co-authored stories as well - including one on race relations in Moreno Valley, California. The contract also included digging into databases beyond Census, including DOT. \n \n \nUpon completion of the contract, attended Columbia University and acquired a master's in journalism - focusing on public radio production. Product Management - Software Industry - US and Asia Software Industry 1995  –  2002  (7 years) USA After returning from Tokyo, I was hired as the Asia Pacific Technical Support Manager at FTP Software in Andover, MA. Created a support channel in Asia for FTP, including a development group in South Korea. Promoted to product manager of the \"Cyber Agent\" technology - one of the first Java-based applications that communicated from the client to software roaming the Internet. Cyber Agents are akin to today's Internet \"cookies\".  \n \nWhen FTP Software closed its doors along with many dotcom companies, Segue Software hired me as a product manager for Java-based technology that conducts QA (quality assurance) testing automatically on software applications and websites. Managed product development from the marketing side - including the \"Silk Bean\" product that sits on a client machine to communicate with Segue's other Java-based testing software. \n \nBy 1997, started my own consulting business offering services including SAS programming, training on \"internationalization\" and \"localization\" of software for Asian markets and introducing software companies to potential partners in Japan and other Asian countries. Product Management - Software Industry - US and Asia Software Industry 1995  –  2002  (7 years) USA After returning from Tokyo, I was hired as the Asia Pacific Technical Support Manager at FTP Software in Andover, MA. Created a support channel in Asia for FTP, including a development group in South Korea. Promoted to product manager of the \"Cyber Agent\" technology - one of the first Java-based applications that communicated from the client to software roaming the Internet. Cyber Agents are akin to today's Internet \"cookies\".  \n \nWhen FTP Software closed its doors along with many dotcom companies, Segue Software hired me as a product manager for Java-based technology that conducts QA (quality assurance) testing automatically on software applications and websites. Managed product development from the marketing side - including the \"Silk Bean\" product that sits on a client machine to communicate with Segue's other Java-based testing software. \n \nBy 1997, started my own consulting business offering services including SAS programming, training on \"internationalization\" and \"localization\" of software for Asian markets and introducing software companies to potential partners in Japan and other Asian countries. IT Director - ASI Market Research, Tokyo, Japan Nielsen 1992  –  1995  (3 years) Tokyo, Japan Designed and implemented an English-Japanese network for the Tokyo office following an analysis of the market research work process. Removed outdated IBM mainframe prior to installation. Automated the survey research process, which was still conducted via paper surveys. \n \nTraveled throughout Asia to work with sister companies on design plans for an inter-company wide area network.  \n \nThis was the first bilingual network and application in the market research industry in Japan. Windows had just been released in Japanese for the first time.  \n \nASI was purchased by Dun & Bradstreet while I was there - later sold to A.C. Nielsen. Today, the firm still collects data on consumer behavior throughout Asia. IT Director - ASI Market Research, Tokyo, Japan Nielsen 1992  –  1995  (3 years) Tokyo, Japan Designed and implemented an English-Japanese network for the Tokyo office following an analysis of the market research work process. Removed outdated IBM mainframe prior to installation. Automated the survey research process, which was still conducted via paper surveys. \n \nTraveled throughout Asia to work with sister companies on design plans for an inter-company wide area network.  \n \nThis was the first bilingual network and application in the market research industry in Japan. Windows had just been released in Japanese for the first time.  \n \nASI was purchased by Dun & Bradstreet while I was there - later sold to A.C. Nielsen. Today, the firm still collects data on consumer behavior throughout Asia. Software Engineer - Business Applications Programmer-Analyst 1983  –  1991  (8 years) USA Early career: Started out as a computer programmer using legacy languages including FORTRAN, Vax Basic, DBASE II & Clipper, Pascal and others. Designed business and accounting systems from concept to product launch - including modules for Kaiser Aluminum's inventory process. Developed systems for clients of Online Data Processing - based in Washington State at the time. \n \nContinued to work part-time in programming while attending the University of Massachusetts. Software Engineer - Business Applications Programmer-Analyst 1983  –  1991  (8 years) USA Early career: Started out as a computer programmer using legacy languages including FORTRAN, Vax Basic, DBASE II & Clipper, Pascal and others. Designed business and accounting systems from concept to product launch - including modules for Kaiser Aluminum's inventory process. Developed systems for clients of Online Data Processing - based in Washington State at the time. \n \nContinued to work part-time in programming while attending the University of Massachusetts. Languages Japanese (rusty) Japanese (rusty) Japanese (rusty) Skills Journalism University Teaching Data Visualization Data Cleaning &... Storytelling IT Management Editing Video Final Cut Pro Video Production Social Media Video Editing Editorial Research Digital Media Public Radio Scripting... Digital Media... Adobe Premier Photography Product Management Programming JavaScript JQUERY D3 Tableau Public SQLite SQL See 12+     See less Skills  Journalism University Teaching Data Visualization Data Cleaning &... Storytelling IT Management Editing Video Final Cut Pro Video Production Social Media Video Editing Editorial Research Digital Media Public Radio Scripting... Digital Media... Adobe Premier Photography Product Management Programming JavaScript JQUERY D3 Tableau Public SQLite SQL See 12+     See less Journalism University Teaching Data Visualization Data Cleaning &... Storytelling IT Management Editing Video Final Cut Pro Video Production Social Media Video Editing Editorial Research Digital Media Public Radio Scripting... Digital Media... Adobe Premier Photography Product Management Programming JavaScript JQUERY D3 Tableau Public SQLite SQL See 12+     See less Journalism University Teaching Data Visualization Data Cleaning &... Storytelling IT Management Editing Video Final Cut Pro Video Production Social Media Video Editing Editorial Research Digital Media Public Radio Scripting... Digital Media... Adobe Premier Photography Product Management Programming JavaScript JQUERY D3 Tableau Public SQLite SQL See 12+     See less Education MIT Journalism Fellowship,  Science 2008  – 2009 Knight Science Journalism fellow 2008-09. Activities and Societies:  As a fellow ,  attended courses and lectures covering everything from neuroscience to environmental earth studies ,  stem cell research. Joined a lab at Harvard University where we built fuel cells from scratch and powered them with bacteria we collected from the environment. Columbia University in the City of New York Master of Science,  Journalism 2002  – 2003 University of Massachusetts Boston Bachelor of Arts (BA),  Economics , A 1988  – 1991 Economics with concentration in East Asian Studies MIT Journalism Fellowship,  Science 2008  – 2009 Knight Science Journalism fellow 2008-09. Activities and Societies:  As a fellow ,  attended courses and lectures covering everything from neuroscience to environmental earth studies ,  stem cell research. Joined a lab at Harvard University where we built fuel cells from scratch and powered them with bacteria we collected from the environment. MIT Journalism Fellowship,  Science 2008  – 2009 Knight Science Journalism fellow 2008-09. Activities and Societies:  As a fellow ,  attended courses and lectures covering everything from neuroscience to environmental earth studies ,  stem cell research. Joined a lab at Harvard University where we built fuel cells from scratch and powered them with bacteria we collected from the environment. MIT Journalism Fellowship,  Science 2008  – 2009 Knight Science Journalism fellow 2008-09. Activities and Societies:  As a fellow ,  attended courses and lectures covering everything from neuroscience to environmental earth studies ,  stem cell research. Joined a lab at Harvard University where we built fuel cells from scratch and powered them with bacteria we collected from the environment. Columbia University in the City of New York Master of Science,  Journalism 2002  – 2003 Columbia University in the City of New York Master of Science,  Journalism 2002  – 2003 Columbia University in the City of New York Master of Science,  Journalism 2002  – 2003 University of Massachusetts Boston Bachelor of Arts (BA),  Economics , A 1988  – 1991 Economics with concentration in East Asian Studies University of Massachusetts Boston Bachelor of Arts (BA),  Economics , A 1988  – 1991 Economics with concentration in East Asian Studies University of Massachusetts Boston Bachelor of Arts (BA),  Economics , A 1988  – 1991 Economics with concentration in East Asian Studies Honors & Awards Additional Honors & Awards Fellowship: Knight Science Journalism at MIT 2008-09 \nFellowship: Japan Ministry of Foreign Affairs: 1991 \nScholarship: John Robbins Scholarship for Business Reporting: 2002 - Columbia University \nGraduated with honors in Economics and East Asian Studies from UMASS-Boston Additional Honors & Awards Fellowship: Knight Science Journalism at MIT 2008-09 \nFellowship: Japan Ministry of Foreign Affairs: 1991 \nScholarship: John Robbins Scholarship for Business Reporting: 2002 - Columbia University \nGraduated with honors in Economics and East Asian Studies from UMASS-Boston Additional Honors & Awards Fellowship: Knight Science Journalism at MIT 2008-09 \nFellowship: Japan Ministry of Foreign Affairs: 1991 \nScholarship: John Robbins Scholarship for Business Reporting: 2002 - Columbia University \nGraduated with honors in Economics and East Asian Studies from UMASS-Boston Additional Honors & Awards Fellowship: Knight Science Journalism at MIT 2008-09 \nFellowship: Japan Ministry of Foreign Affairs: 1991 \nScholarship: John Robbins Scholarship for Business Reporting: 2002 - Columbia University \nGraduated with honors in Economics and East Asian Studies from UMASS-Boston ", "Summary Specialties:  \nSAP ABAP, Workflow, Webdynpros, PI & Portals.  \nWorkday Enterprise Integration Summary Specialties:  \nSAP ABAP, Workflow, Webdynpros, PI & Portals.  \nWorkday Enterprise Integration Specialties:  \nSAP ABAP, Workflow, Webdynpros, PI & Portals.  \nWorkday Enterprise Integration Specialties:  \nSAP ABAP, Workflow, Webdynpros, PI & Portals.  \nWorkday Enterprise Integration Experience Principal Software Engineer – Business Applications Zappos.com August 2009  – Present (6 years 1 month) Sr. Consultant Deloitte Consulting June 2008  –  August 2009  (1 year 3 months) Sr. Consultant IBM February 2007  –  June 2008  (1 year 5 months) Principal Software Engineer – Business Applications Zappos.com August 2009  – Present (6 years 1 month) Principal Software Engineer – Business Applications Zappos.com August 2009  – Present (6 years 1 month) Sr. Consultant Deloitte Consulting June 2008  –  August 2009  (1 year 3 months) Sr. Consultant Deloitte Consulting June 2008  –  August 2009  (1 year 3 months) Sr. Consultant IBM February 2007  –  June 2008  (1 year 5 months) Sr. Consultant IBM February 2007  –  June 2008  (1 year 5 months) Skills ABAP SAP Netweaver SAP XI EDI WebDynpro Middleware SAP Implementation SAP ERP SAP Business Process Design SD Master Data Management Technology Integration Business Objects Solution Architecture SOA Business Analysis SDLC ERP Business Intelligence Requirements Analysis See 6+     See less Skills  ABAP SAP Netweaver SAP XI EDI WebDynpro Middleware SAP Implementation SAP ERP SAP Business Process Design SD Master Data Management Technology Integration Business Objects Solution Architecture SOA Business Analysis SDLC ERP Business Intelligence Requirements Analysis See 6+     See less ABAP SAP Netweaver SAP XI EDI WebDynpro Middleware SAP Implementation SAP ERP SAP Business Process Design SD Master Data Management Technology Integration Business Objects Solution Architecture SOA Business Analysis SDLC ERP Business Intelligence Requirements Analysis See 6+     See less ABAP SAP Netweaver SAP XI EDI WebDynpro Middleware SAP Implementation SAP ERP SAP Business Process Design SD Master Data Management Technology Integration Business Objects Solution Architecture SOA Business Analysis SDLC ERP Business Intelligence Requirements Analysis See 6+     See less Education Birla Institute of Technology and Science, Pilani B.E.(Hons.),  Electrical & Electronics 1997  – 2002 Birla Institute of Technology and Science, Pilani M.Sc.(Hons.),  Mathematics 1997  – 2002 Birla Institute of Technology and Science, Pilani B.E.(Hons.),  Electrical & Electronics 1997  – 2002 Birla Institute of Technology and Science, Pilani B.E.(Hons.),  Electrical & Electronics 1997  – 2002 Birla Institute of Technology and Science, Pilani B.E.(Hons.),  Electrical & Electronics 1997  – 2002 Birla Institute of Technology and Science, Pilani M.Sc.(Hons.),  Mathematics 1997  – 2002 Birla Institute of Technology and Science, Pilani M.Sc.(Hons.),  Mathematics 1997  – 2002 Birla Institute of Technology and Science, Pilani M.Sc.(Hons.),  Mathematics 1997  – 2002 ", "Summary More than 3 years of experience in Information Technology with extensive experience in software development, project management, system integration, in depth knowledge various enterprise software solution. \n• Worked as System ANALYSIS, Project Leader, Team Leader, Programmer with requirement specification, design and analysis experiences; possess strong leadership, analytical and relational skills. \n• Successfully managed the projects of ACE Data Systems Co., Ltd as Project Leader, Team Leader, Developer, System Analysts. \n• Worked as a Senior Software Engineer for BUSINESS Applications and Web Applications with strong programming. I have also a strong understanding of programming fundamentals and Object-Oriented Programming (OOP). \n• Have expert level knowledge in ASP.NET, C#.NET and ASP.Net MVC. \n• Strongly interested in Developing Programs which interact with machines and messaging formats, Development Standards, Project Frameworks and Developing BUSINESS Components. \n• Have working knowledge in Software Development Life Cycle (SDLC), such as Requirements Gathering and Analysis, Design, Implementation, Testing and Maintenance, Three-tier Architecture, and BUSINESS Application Processes. \nMy strengths are self-study skill for new technology, new business domain, etc... Summary More than 3 years of experience in Information Technology with extensive experience in software development, project management, system integration, in depth knowledge various enterprise software solution. \n• Worked as System ANALYSIS, Project Leader, Team Leader, Programmer with requirement specification, design and analysis experiences; possess strong leadership, analytical and relational skills. \n• Successfully managed the projects of ACE Data Systems Co., Ltd as Project Leader, Team Leader, Developer, System Analysts. \n• Worked as a Senior Software Engineer for BUSINESS Applications and Web Applications with strong programming. I have also a strong understanding of programming fundamentals and Object-Oriented Programming (OOP). \n• Have expert level knowledge in ASP.NET, C#.NET and ASP.Net MVC. \n• Strongly interested in Developing Programs which interact with machines and messaging formats, Development Standards, Project Frameworks and Developing BUSINESS Components. \n• Have working knowledge in Software Development Life Cycle (SDLC), such as Requirements Gathering and Analysis, Design, Implementation, Testing and Maintenance, Three-tier Architecture, and BUSINESS Application Processes. \nMy strengths are self-study skill for new technology, new business domain, etc... More than 3 years of experience in Information Technology with extensive experience in software development, project management, system integration, in depth knowledge various enterprise software solution. \n• Worked as System ANALYSIS, Project Leader, Team Leader, Programmer with requirement specification, design and analysis experiences; possess strong leadership, analytical and relational skills. \n• Successfully managed the projects of ACE Data Systems Co., Ltd as Project Leader, Team Leader, Developer, System Analysts. \n• Worked as a Senior Software Engineer for BUSINESS Applications and Web Applications with strong programming. I have also a strong understanding of programming fundamentals and Object-Oriented Programming (OOP). \n• Have expert level knowledge in ASP.NET, C#.NET and ASP.Net MVC. \n• Strongly interested in Developing Programs which interact with machines and messaging formats, Development Standards, Project Frameworks and Developing BUSINESS Components. \n• Have working knowledge in Software Development Life Cycle (SDLC), such as Requirements Gathering and Analysis, Design, Implementation, Testing and Maintenance, Three-tier Architecture, and BUSINESS Application Processes. \nMy strengths are self-study skill for new technology, new business domain, etc... More than 3 years of experience in Information Technology with extensive experience in software development, project management, system integration, in depth knowledge various enterprise software solution. \n• Worked as System ANALYSIS, Project Leader, Team Leader, Programmer with requirement specification, design and analysis experiences; possess strong leadership, analytical and relational skills. \n• Successfully managed the projects of ACE Data Systems Co., Ltd as Project Leader, Team Leader, Developer, System Analysts. \n• Worked as a Senior Software Engineer for BUSINESS Applications and Web Applications with strong programming. I have also a strong understanding of programming fundamentals and Object-Oriented Programming (OOP). \n• Have expert level knowledge in ASP.NET, C#.NET and ASP.Net MVC. \n• Strongly interested in Developing Programs which interact with machines and messaging formats, Development Standards, Project Frameworks and Developing BUSINESS Components. \n• Have working knowledge in Software Development Life Cycle (SDLC), such as Requirements Gathering and Analysis, Design, Implementation, Testing and Maintenance, Three-tier Architecture, and BUSINESS Application Processes. \nMy strengths are self-study skill for new technology, new business domain, etc... Experience Application Programmer ECS Techno_Sys (Asia Pacific) Pte Ltd May 2015  – Present (4 months) Singapore Development Team Leader ACE Data Systems November 2011  –  February 2015  (3 years 4 months) Software Engineer ACE Data Systems November 2011  –  January 2015  (3 years 3 months) Yangon Senior Software Engineer, System Analyst, Team Leader, Project Leader \nACE Data Systems Co. Ltd \nNov 2011 – January 2015 (3 years 2 months)Myanmar \nFrom 2011-2012 - Junior Software Developer \nFrom 2012-2013 - Senior Software Developer ,System Analyst \nFrom 2013-2015 - Development Team Leader Application Programmer ECS Techno_Sys (Asia Pacific) Pte Ltd May 2015  – Present (4 months) Singapore Application Programmer ECS Techno_Sys (Asia Pacific) Pte Ltd May 2015  – Present (4 months) Singapore Development Team Leader ACE Data Systems November 2011  –  February 2015  (3 years 4 months) Development Team Leader ACE Data Systems November 2011  –  February 2015  (3 years 4 months) Software Engineer ACE Data Systems November 2011  –  January 2015  (3 years 3 months) Yangon Senior Software Engineer, System Analyst, Team Leader, Project Leader \nACE Data Systems Co. Ltd \nNov 2011 – January 2015 (3 years 2 months)Myanmar \nFrom 2011-2012 - Junior Software Developer \nFrom 2012-2013 - Senior Software Developer ,System Analyst \nFrom 2013-2015 - Development Team Leader Software Engineer ACE Data Systems November 2011  –  January 2015  (3 years 3 months) Yangon Senior Software Engineer, System Analyst, Team Leader, Project Leader \nACE Data Systems Co. Ltd \nNov 2011 – January 2015 (3 years 2 months)Myanmar \nFrom 2011-2012 - Junior Software Developer \nFrom 2012-2013 - Senior Software Developer ,System Analyst \nFrom 2013-2015 - Development Team Leader Languages English English English Skills C Software Engineering C++ XML C# Web Services JavaScript CSS Microsoft SQL Server ASP.NET LINQ SQL Testing Software System Analysis HTML Skills  C Software Engineering C++ XML C# Web Services JavaScript CSS Microsoft SQL Server ASP.NET LINQ SQL Testing Software System Analysis HTML C Software Engineering C++ XML C# Web Services JavaScript CSS Microsoft SQL Server ASP.NET LINQ SQL Testing Software System Analysis HTML C Software Engineering C++ XML C# Web Services JavaScript CSS Microsoft SQL Server ASP.NET LINQ SQL Testing Software System Analysis HTML Education University of Computer Science (Yangon) Bachelor of Computer Science(B.C.Sc),  Computer Science 2006  – 2009 University of Computer Science (Yangon) Bachelor of Computer Science(B.C.Sc),  Computer Science 2006  – 2009 University of Computer Science (Yangon) Bachelor of Computer Science(B.C.Sc),  Computer Science 2006  – 2009 University of Computer Science (Yangon) Bachelor of Computer Science(B.C.Sc),  Computer Science 2006  – 2009 ", "Summary I have some wicked bad debugging skills. Some might say, that is because I have absolutely no idea what I am doing. They would be wrong, because that makes my debugging skills even more amazing. Summary I have some wicked bad debugging skills. Some might say, that is because I have absolutely no idea what I am doing. They would be wrong, because that makes my debugging skills even more amazing. I have some wicked bad debugging skills. Some might say, that is because I have absolutely no idea what I am doing. They would be wrong, because that makes my debugging skills even more amazing. I have some wicked bad debugging skills. Some might say, that is because I have absolutely no idea what I am doing. They would be wrong, because that makes my debugging skills even more amazing. Experience Release Engineer ExactBid March 2012  –  October 2012  (8 months) 6399 San Ignacio Avenue, Suite 100, San Jose Ca. At ExactBid I was responsible for automating their update process in order to make it more scalable. To this end I automated many previously \"hands on\" procedures including website creation, cloning of websites, SQL DB creation and DB updates. This included being able to automate around previous known issues, recognizing them and modifying config issues that were identified. \n \nIn that capacity I was responsible for the upgrade and maintenance of over 200 live mission critical sites. Senior Release Engineer Active Video Networks 2005  –  March 2011  (6 years) I designed, created, and am responsible for the maintenance of 150+ builds and installation programs over multiple codelines. This includes creating sustaining codelines as well as branching and merging existing codelines to allow for new development. \nDebugging developer code on target machines. \nDesigned and implemented a Centos network RSP server install. This included creating the Dom0 and 8 virtual machines with specific purposes. Sr. Engineer Molecular Devices 2004  –  2005  (1 year) Automated build and release processes.  \nWrote installation programs. \nProvided white-box analysis of code failures. \nAfter several developers left the team I also became responsible for debugging problems in the firmware interface and fixing them. Software Engineer Reality Fusion 1999  –  2003  (4 years) Designed and developed C++ applications Senior Member Technical Staff, Applications Server Division Oracle 1996  –  1999  (3 years) JDeveloper is Oracle’s Java database development platform. I worked on the IDE, where I integrated the DAC code produced by my team into the JDeveloper UI. I wrote high profile code that had to function within the legacy code base that was written by engineers who no longer worked at the company, and who left no documentation. \n \nDesigned and developed various components for a Java Word Processor for the Oracle’s Network Computer. This included writing a driver to import Microsoft Excell spreadsheets to our Java Spreadsheet. Software Engineer, Business Applications Division Novell 1994  –  1996  (2 years) As the Release Engineer for the Quattro Pro Development team. I was responsible for automating the daily builds, managing the source code control system, writing the installation programs and creating and archiving the installation images. Software Engineer Borland Software January 1989  –  January 1994  (5 years 1 month) Release Engineer ExactBid March 2012  –  October 2012  (8 months) 6399 San Ignacio Avenue, Suite 100, San Jose Ca. At ExactBid I was responsible for automating their update process in order to make it more scalable. To this end I automated many previously \"hands on\" procedures including website creation, cloning of websites, SQL DB creation and DB updates. This included being able to automate around previous known issues, recognizing them and modifying config issues that were identified. \n \nIn that capacity I was responsible for the upgrade and maintenance of over 200 live mission critical sites. Release Engineer ExactBid March 2012  –  October 2012  (8 months) 6399 San Ignacio Avenue, Suite 100, San Jose Ca. At ExactBid I was responsible for automating their update process in order to make it more scalable. To this end I automated many previously \"hands on\" procedures including website creation, cloning of websites, SQL DB creation and DB updates. This included being able to automate around previous known issues, recognizing them and modifying config issues that were identified. \n \nIn that capacity I was responsible for the upgrade and maintenance of over 200 live mission critical sites. Senior Release Engineer Active Video Networks 2005  –  March 2011  (6 years) I designed, created, and am responsible for the maintenance of 150+ builds and installation programs over multiple codelines. This includes creating sustaining codelines as well as branching and merging existing codelines to allow for new development. \nDebugging developer code on target machines. \nDesigned and implemented a Centos network RSP server install. This included creating the Dom0 and 8 virtual machines with specific purposes. Senior Release Engineer Active Video Networks 2005  –  March 2011  (6 years) I designed, created, and am responsible for the maintenance of 150+ builds and installation programs over multiple codelines. This includes creating sustaining codelines as well as branching and merging existing codelines to allow for new development. \nDebugging developer code on target machines. \nDesigned and implemented a Centos network RSP server install. This included creating the Dom0 and 8 virtual machines with specific purposes. Sr. Engineer Molecular Devices 2004  –  2005  (1 year) Automated build and release processes.  \nWrote installation programs. \nProvided white-box analysis of code failures. \nAfter several developers left the team I also became responsible for debugging problems in the firmware interface and fixing them. Sr. Engineer Molecular Devices 2004  –  2005  (1 year) Automated build and release processes.  \nWrote installation programs. \nProvided white-box analysis of code failures. \nAfter several developers left the team I also became responsible for debugging problems in the firmware interface and fixing them. Software Engineer Reality Fusion 1999  –  2003  (4 years) Designed and developed C++ applications Software Engineer Reality Fusion 1999  –  2003  (4 years) Designed and developed C++ applications Senior Member Technical Staff, Applications Server Division Oracle 1996  –  1999  (3 years) JDeveloper is Oracle’s Java database development platform. I worked on the IDE, where I integrated the DAC code produced by my team into the JDeveloper UI. I wrote high profile code that had to function within the legacy code base that was written by engineers who no longer worked at the company, and who left no documentation. \n \nDesigned and developed various components for a Java Word Processor for the Oracle’s Network Computer. This included writing a driver to import Microsoft Excell spreadsheets to our Java Spreadsheet. Senior Member Technical Staff, Applications Server Division Oracle 1996  –  1999  (3 years) JDeveloper is Oracle’s Java database development platform. I worked on the IDE, where I integrated the DAC code produced by my team into the JDeveloper UI. I wrote high profile code that had to function within the legacy code base that was written by engineers who no longer worked at the company, and who left no documentation. \n \nDesigned and developed various components for a Java Word Processor for the Oracle’s Network Computer. This included writing a driver to import Microsoft Excell spreadsheets to our Java Spreadsheet. Software Engineer, Business Applications Division Novell 1994  –  1996  (2 years) As the Release Engineer for the Quattro Pro Development team. I was responsible for automating the daily builds, managing the source code control system, writing the installation programs and creating and archiving the installation images. Software Engineer, Business Applications Division Novell 1994  –  1996  (2 years) As the Release Engineer for the Quattro Pro Development team. I was responsible for automating the daily builds, managing the source code control system, writing the installation programs and creating and archiving the installation images. Software Engineer Borland Software January 1989  –  January 1994  (5 years 1 month) Software Engineer Borland Software January 1989  –  January 1994  (5 years 1 month) Skills Python InstallShield Perforce Unix SQL Visual C++ Perl Java Linux Windows C C++ Visual Basic Testing Databases Software Engineering TCP/IP Cloud Computing Web Applications Agile Methodologies Quality Assurance XML .NET Teaching Adults See 9+     See less Skills  Python InstallShield Perforce Unix SQL Visual C++ Perl Java Linux Windows C C++ Visual Basic Testing Databases Software Engineering TCP/IP Cloud Computing Web Applications Agile Methodologies Quality Assurance XML .NET Teaching Adults See 9+     See less Python InstallShield Perforce Unix SQL Visual C++ Perl Java Linux Windows C C++ Visual Basic Testing Databases Software Engineering TCP/IP Cloud Computing Web Applications Agile Methodologies Quality Assurance XML .NET Teaching Adults See 9+     See less Python InstallShield Perforce Unix SQL Visual C++ Perl Java Linux Windows C C++ Visual Basic Testing Databases Software Engineering TCP/IP Cloud Computing Web Applications Agile Methodologies Quality Assurance XML .NET Teaching Adults See 9+     See less Education UCSC Computer and Information Science 1985  – 1989 Agoura High UCSC Computer and Information Science 1985  – 1989 UCSC Computer and Information Science 1985  – 1989 UCSC Computer and Information Science 1985  – 1989 Agoura High Agoura High Agoura High ", "Summary A dynamic and passionate certified IT professional with 4+ years of experience in Software development, Workflows applications, Document and Content management, Requirements analysis and Collaboration solutions. Skills to manage multiple tasks from Inception to completion while demonstrating self-motivation, creativity and initiative. I have extensive experience in automation of business processes and have worked on multiple collaboration platforms including IBM Lotus Domino and Microsoft SharePoint 2010/2013. \n \nProficient with listed concepts and technologies: \n \n•\tIBM Lotus Notes® & Domino® \n•\tIBM Domino Designer®\t \n•\tSharePoint 2010/2013 Development \n•\tSharePoint 2010/2013 Administration \n•\tMicrosoft SharePoint & InfoPath Designer \n•\t.NET Framework (C# & CSOM SharePoint)\t \n•\tSQL Server 2008/2012\t \n•\tWindows Server 2008/2012 \n•\tDocument & Content Management\t \n•\tWorkflows applications development \n•\tBusiness Process Automation\t \n•\tHTML5 & JavaScript Summary A dynamic and passionate certified IT professional with 4+ years of experience in Software development, Workflows applications, Document and Content management, Requirements analysis and Collaboration solutions. Skills to manage multiple tasks from Inception to completion while demonstrating self-motivation, creativity and initiative. I have extensive experience in automation of business processes and have worked on multiple collaboration platforms including IBM Lotus Domino and Microsoft SharePoint 2010/2013. \n \nProficient with listed concepts and technologies: \n \n•\tIBM Lotus Notes® & Domino® \n•\tIBM Domino Designer®\t \n•\tSharePoint 2010/2013 Development \n•\tSharePoint 2010/2013 Administration \n•\tMicrosoft SharePoint & InfoPath Designer \n•\t.NET Framework (C# & CSOM SharePoint)\t \n•\tSQL Server 2008/2012\t \n•\tWindows Server 2008/2012 \n•\tDocument & Content Management\t \n•\tWorkflows applications development \n•\tBusiness Process Automation\t \n•\tHTML5 & JavaScript A dynamic and passionate certified IT professional with 4+ years of experience in Software development, Workflows applications, Document and Content management, Requirements analysis and Collaboration solutions. Skills to manage multiple tasks from Inception to completion while demonstrating self-motivation, creativity and initiative. I have extensive experience in automation of business processes and have worked on multiple collaboration platforms including IBM Lotus Domino and Microsoft SharePoint 2010/2013. \n \nProficient with listed concepts and technologies: \n \n•\tIBM Lotus Notes® & Domino® \n•\tIBM Domino Designer®\t \n•\tSharePoint 2010/2013 Development \n•\tSharePoint 2010/2013 Administration \n•\tMicrosoft SharePoint & InfoPath Designer \n•\t.NET Framework (C# & CSOM SharePoint)\t \n•\tSQL Server 2008/2012\t \n•\tWindows Server 2008/2012 \n•\tDocument & Content Management\t \n•\tWorkflows applications development \n•\tBusiness Process Automation\t \n•\tHTML5 & JavaScript A dynamic and passionate certified IT professional with 4+ years of experience in Software development, Workflows applications, Document and Content management, Requirements analysis and Collaboration solutions. Skills to manage multiple tasks from Inception to completion while demonstrating self-motivation, creativity and initiative. I have extensive experience in automation of business processes and have worked on multiple collaboration platforms including IBM Lotus Domino and Microsoft SharePoint 2010/2013. \n \nProficient with listed concepts and technologies: \n \n•\tIBM Lotus Notes® & Domino® \n•\tIBM Domino Designer®\t \n•\tSharePoint 2010/2013 Development \n•\tSharePoint 2010/2013 Administration \n•\tMicrosoft SharePoint & InfoPath Designer \n•\t.NET Framework (C# & CSOM SharePoint)\t \n•\tSQL Server 2008/2012\t \n•\tWindows Server 2008/2012 \n•\tDocument & Content Management\t \n•\tWorkflows applications development \n•\tBusiness Process Automation\t \n•\tHTML5 & JavaScript Experience Software Engineer (Business Applications) LMKT January 2011  – Present (4 years 8 months) Pakistan LMKT is an independent sister company of LMKR providing innovative and customized IT solutions packages that make life, business and governance easier and more efficient. \n \nMy work in this company included:  \nAnalysis, design, development, Implementation and management of IBM lotus domino and Microsoft SharePoint based workflow applications in order to automate predefined office processes for in-house as well as external clients to maximize the productivity and efficiency of daily office work and to ensure paperless work environment.  \nDeveloped SharePoint based workflow applications using InfoPath and SharePoint designer for different teams like business development, administration and finance  \nSharePoint workflows development using SharePoint 2010/2013 designer and Microsoft visual studio.  \nCustom web part, features and event receivers development for SharePoint 2010/2013.  \nDocument and Content Management using Microsoft SharePoint 2010/2013 out of the box features and functionalities.  \nBranding and GUI customization of SharePoint sites by tweaking master pages.  \nAdministration of SharePoint sites, lists, document libraries, service applications, search scenarios, AD sync and user permissions in SharePoint farm environment.  \nUp gradation of SharePoint 2010 sites to SharePoint 2013 using PowerShell scripts and commands.  \nHave worked in agile working environment where requirements and solutions evolve through collaboration between teams.  \nHave worked on SharePoint technology in Jeddah-KSA region on behalf of LMKT technology partner named e-Solutions. JSDP Member AECOM 2014  –  2014  (less than a year) Saudi Arabia Associate LMKR November 2010  –  January 2011  (3 months) Pakistan LMKR is a privately held petroleum technology company which is headquartered in Dubai, UAE and regional offices in Asia, USA, Trinidad and Canada.  \n \nMy work in this company included:  \nManaged and administered custom built workflow applications for In-house in order to automate office processes. Analysis and documentation of the custom built IBM lotus applications to help the migration of applications to Microsoft SharePoint technology.  \nTechnologies Used:  \nIBM Domino, Microsoft SharePoint Internship NADRA July 2009  –  September 2009  (3 months) Pakistan Worked as IT assistant in network operations center (NOC) of NADRA to monitor the network traffic and provided technical support to end user.  \n \nRecord Management for NADRA customer care team in Microsoft using Visual Basic programming language. Software Engineer (Business Applications) LMKT January 2011  – Present (4 years 8 months) Pakistan LMKT is an independent sister company of LMKR providing innovative and customized IT solutions packages that make life, business and governance easier and more efficient. \n \nMy work in this company included:  \nAnalysis, design, development, Implementation and management of IBM lotus domino and Microsoft SharePoint based workflow applications in order to automate predefined office processes for in-house as well as external clients to maximize the productivity and efficiency of daily office work and to ensure paperless work environment.  \nDeveloped SharePoint based workflow applications using InfoPath and SharePoint designer for different teams like business development, administration and finance  \nSharePoint workflows development using SharePoint 2010/2013 designer and Microsoft visual studio.  \nCustom web part, features and event receivers development for SharePoint 2010/2013.  \nDocument and Content Management using Microsoft SharePoint 2010/2013 out of the box features and functionalities.  \nBranding and GUI customization of SharePoint sites by tweaking master pages.  \nAdministration of SharePoint sites, lists, document libraries, service applications, search scenarios, AD sync and user permissions in SharePoint farm environment.  \nUp gradation of SharePoint 2010 sites to SharePoint 2013 using PowerShell scripts and commands.  \nHave worked in agile working environment where requirements and solutions evolve through collaboration between teams.  \nHave worked on SharePoint technology in Jeddah-KSA region on behalf of LMKT technology partner named e-Solutions. Software Engineer (Business Applications) LMKT January 2011  – Present (4 years 8 months) Pakistan LMKT is an independent sister company of LMKR providing innovative and customized IT solutions packages that make life, business and governance easier and more efficient. \n \nMy work in this company included:  \nAnalysis, design, development, Implementation and management of IBM lotus domino and Microsoft SharePoint based workflow applications in order to automate predefined office processes for in-house as well as external clients to maximize the productivity and efficiency of daily office work and to ensure paperless work environment.  \nDeveloped SharePoint based workflow applications using InfoPath and SharePoint designer for different teams like business development, administration and finance  \nSharePoint workflows development using SharePoint 2010/2013 designer and Microsoft visual studio.  \nCustom web part, features and event receivers development for SharePoint 2010/2013.  \nDocument and Content Management using Microsoft SharePoint 2010/2013 out of the box features and functionalities.  \nBranding and GUI customization of SharePoint sites by tweaking master pages.  \nAdministration of SharePoint sites, lists, document libraries, service applications, search scenarios, AD sync and user permissions in SharePoint farm environment.  \nUp gradation of SharePoint 2010 sites to SharePoint 2013 using PowerShell scripts and commands.  \nHave worked in agile working environment where requirements and solutions evolve through collaboration between teams.  \nHave worked on SharePoint technology in Jeddah-KSA region on behalf of LMKT technology partner named e-Solutions. JSDP Member AECOM 2014  –  2014  (less than a year) Saudi Arabia JSDP Member AECOM 2014  –  2014  (less than a year) Saudi Arabia Associate LMKR November 2010  –  January 2011  (3 months) Pakistan LMKR is a privately held petroleum technology company which is headquartered in Dubai, UAE and regional offices in Asia, USA, Trinidad and Canada.  \n \nMy work in this company included:  \nManaged and administered custom built workflow applications for In-house in order to automate office processes. Analysis and documentation of the custom built IBM lotus applications to help the migration of applications to Microsoft SharePoint technology.  \nTechnologies Used:  \nIBM Domino, Microsoft SharePoint Associate LMKR November 2010  –  January 2011  (3 months) Pakistan LMKR is a privately held petroleum technology company which is headquartered in Dubai, UAE and regional offices in Asia, USA, Trinidad and Canada.  \n \nMy work in this company included:  \nManaged and administered custom built workflow applications for In-house in order to automate office processes. Analysis and documentation of the custom built IBM lotus applications to help the migration of applications to Microsoft SharePoint technology.  \nTechnologies Used:  \nIBM Domino, Microsoft SharePoint Internship NADRA July 2009  –  September 2009  (3 months) Pakistan Worked as IT assistant in network operations center (NOC) of NADRA to monitor the network traffic and provided technical support to end user.  \n \nRecord Management for NADRA customer care team in Microsoft using Visual Basic programming language. Internship NADRA July 2009  –  September 2009  (3 months) Pakistan Worked as IT assistant in network operations center (NOC) of NADRA to monitor the network traffic and provided technical support to end user.  \n \nRecord Management for NADRA customer care team in Microsoft using Visual Basic programming language. Languages English Urdu English Urdu English Urdu Skills C# JavaScript Software Development Lotus Domino ASP.NET Lotus Notes Visual Studio LotusScript jQuery Software Development... SharePoint .NET Microsoft SQL Server XML Information Technology Software Project... Windows Server Web Services HTML Microsoft Office... Workflow Applications See 6+     See less Skills  C# JavaScript Software Development Lotus Domino ASP.NET Lotus Notes Visual Studio LotusScript jQuery Software Development... SharePoint .NET Microsoft SQL Server XML Information Technology Software Project... Windows Server Web Services HTML Microsoft Office... Workflow Applications See 6+     See less C# JavaScript Software Development Lotus Domino ASP.NET Lotus Notes Visual Studio LotusScript jQuery Software Development... SharePoint .NET Microsoft SQL Server XML Information Technology Software Project... Windows Server Web Services HTML Microsoft Office... Workflow Applications See 6+     See less C# JavaScript Software Development Lotus Domino ASP.NET Lotus Notes Visual Studio LotusScript jQuery Software Development... SharePoint .NET Microsoft SQL Server XML Information Technology Software Project... Windows Server Web Services HTML Microsoft Office... Workflow Applications See 6+     See less Education C@SE - Center For Advanced Studies In Engineering Engineering Management,  Information Technology Project Management 2013  – 2016 Bahria University Engineering,  Software 2006  – 2010 Activities and Societies:  IEEE C@SE - Center For Advanced Studies In Engineering Engineering Management,  Information Technology Project Management 2013  – 2016 C@SE - Center For Advanced Studies In Engineering Engineering Management,  Information Technology Project Management 2013  – 2016 C@SE - Center For Advanced Studies In Engineering Engineering Management,  Information Technology Project Management 2013  – 2016 Bahria University Engineering,  Software 2006  – 2010 Activities and Societies:  IEEE Bahria University Engineering,  Software 2006  – 2010 Activities and Societies:  IEEE Bahria University Engineering,  Software 2006  – 2010 Activities and Societies:  IEEE Honors & Awards ", "Summary 15+ years experience as a Business Solution Developer, Analyzing Needs, Architecting Solutions, Designing & Building Applications. Basically the full life cycle of business software needs. Specialties:VB.Net, C#,ASP.Net, SQL, OOD, Summary 15+ years experience as a Business Solution Developer, Analyzing Needs, Architecting Solutions, Designing & Building Applications. Basically the full life cycle of business software needs. Specialties:VB.Net, C#,ASP.Net, SQL, OOD, 15+ years experience as a Business Solution Developer, Analyzing Needs, Architecting Solutions, Designing & Building Applications. Basically the full life cycle of business software needs. Specialties:VB.Net, C#,ASP.Net, SQL, OOD, 15+ years experience as a Business Solution Developer, Analyzing Needs, Architecting Solutions, Designing & Building Applications. Basically the full life cycle of business software needs. Specialties:VB.Net, C#,ASP.Net, SQL, OOD, Experience Sr Software Engineer Remembrances LLC 2009  – Present (6 years) Consultant Grafner Business Solutions February 1999  – Present (16 years 7 months) As a consultant, I designed and built custom business software for a variety of industries including commercial distributors, water-treatment systems, HVAC, Auto Finance, and food manufacturing and heath care. This included needs analysis, original system design, software creation, implementation, training, data conversion, system maintenance, and on going customizations. Technologies used: VB.NET, VB, ASP, ADO, VB Script, MS SQL, T-SQL, VSS, OOD, XML, HTML, JavaScript, Crystal Reports Software Engineer III Mercury Payment Systems March 2011  –  June 2012  (1 year 4 months) Sr Software Engineer Planet Group, Inc. October 2010  –  February 2011  (5 months) On assignment at Mercury Payment Systems Sr. Software Engineer Veracity Credit Consultants February 2007  –  July 2010  (3 years 6 months) As Chief Applications Architect of a small team I designed and built an enterprise level CRM system, including secure Client and Partner web portals, Web Services and other integration APIs, metrics dashboards and ecommerce billing systems. In an evolving business environment was able to apply agile methodologies to allow rapid development of new system features. Through system automations and efficiency driven projects the company was able to handle 4 times the original volume with the half number of employees. worked to convert from VB.net to C#. Technologies used: VB.Net, ASP.Net, OOAD, MS SQL, T-SQL, VSS, C# Sr Software Developer ID Watchdog 2007  –  2008  (1 year) Sr Software Engineer Air Methods June 2006  –  January 2007  (8 months) Software Developer 5280 Solutions Inc November 2005  –  January 2007  (1 year 3 months) Designed and built new components for exiting student loan servicing system to fulfill client need for government bid from business design specifications. Integrated these new components with existing routines and database. Design and implemented new table structures and stored procedures. Wrote tech designs and project plans for my project section. Technologies used: VB.Net, ADO.NET, MS SQL, T-SQL, VSS Consultant HCA May 2005  –  June 2006  (1 year 2 months) Software Engineer United Car Care July 2003  –  February 2004  (8 months) As a member of a small team of developers, I helped build the company's interactive agent web site system. This web site allows agents in the field to build pricing sheet, get claims status information, monthly report files and other necessary documents. An emphasis was placed on ensuring the security of the information and on-time project completion. I personally generated the project plan for the web project from the time of my joining the team to the completion of the project. Designed and built systems for secure access to accounting reports and other secured documents. Developed content management sub systems to ensure consistent appearance and format of all pages in the site. Build specifications and complex reports from clients description of needs. Technologies used: VB.NET, VB, MS SQL, T-SQL, ASP, ADO, VB Script, JavaScript, VSS, OOD Sr Software Engineer Motorola June 2000  –  September 2002  (2 years 4 months) As part of the core design team of senior developers, I designed and built a large, scalable n-tier records management system for the public safety industry. This application consisted primarily of a framework allowing other developers to build specific modules, such as traffic tickets and personal arrest history. I personally designed and wrote a number of the core systems including the following. The user validation system used COM objects on the application server to validate user login requests against the Windows domain. The centralized configuration management system allowed the administrator to configure multiple environments for the users to access, specifying application servers, database servers and specific databases to be used for the session, allowing the user to login to multiple production or training configurations. This also allowed assigning connection to different related services for each configuration. The security permissions systems enabled the Administrator to build both complex and simple security groups and assign users to these groups. I then integrated this information in to the data access and data update, screen controls, menus and user controls to respect the various permissions granted. The address validation system took existing Geographical data and parsed user input addresses, this system was capable of validating and providing latitude and longitude for buildings, intersections and commonly named locations. These system utilized XML, COM, DCOM, ADO, MS SQL, T-SQL, VB, OOD MIS Department Manager, Head Programmer Cartel Asset Management, Inc December 1996  –  February 1999  (2 years 3 months) Inherited problematic Access 2.0 Database Tracking system in version 1.0 matured this system through to version 7.9, personally re-engineering all internal company and data processes. Moved the Tracking system in to SQL Server. Hired and trained team of programmers and system administrators to continue system improvements. Implemented NT servers with RAID5 system to handle system needs. Setup and maintained email, data backup, and RAS systems. Completely reworked network to eliminate excessive down times. Developed imaging system using OCR and high-speed scanners to handle mass form recognition and indexing in to the database for numerical analysis and retrevial by the clients. Created a single proposal to improve efficiency to the amount of $150,000 in first year savings through implementation of a fax server. The systems I designed and created enabled a 200% volume jump with 65% of the staffing requirements. Technologies used: VB, ASP, DAO, VB Script, MS SQL, T-SQL, MS Access, MS Excel Computer Services Manager MVG Services Ltd September 1992  –  November 1996  (4 years 3 months) Designed, wrote, implemented, and trained users on integrated database interface software for all aspects of customer job tracking. Database Administrator for customer & job tracking database, generated reports by complex SQL statements. Setup, maintained and optimized LAN system including remote access computers. Was responsible for trouble shooting and repairing all company systems. Recommended and implemented system hardware and software upgrades to deliver optimum performance at best value. Oversaw and maintained Inventory system. Maintained full system backup and anti-virus plan and execution to insure data safety. Also responsible for maintaining all communications systems. VB, ASP, DAO, VB Script, MS SQL, T-SQL, MS Access, MS Excel Sr Software Engineer Remembrances LLC 2009  – Present (6 years) Sr Software Engineer Remembrances LLC 2009  – Present (6 years) Consultant Grafner Business Solutions February 1999  – Present (16 years 7 months) As a consultant, I designed and built custom business software for a variety of industries including commercial distributors, water-treatment systems, HVAC, Auto Finance, and food manufacturing and heath care. This included needs analysis, original system design, software creation, implementation, training, data conversion, system maintenance, and on going customizations. Technologies used: VB.NET, VB, ASP, ADO, VB Script, MS SQL, T-SQL, VSS, OOD, XML, HTML, JavaScript, Crystal Reports Consultant Grafner Business Solutions February 1999  – Present (16 years 7 months) As a consultant, I designed and built custom business software for a variety of industries including commercial distributors, water-treatment systems, HVAC, Auto Finance, and food manufacturing and heath care. This included needs analysis, original system design, software creation, implementation, training, data conversion, system maintenance, and on going customizations. Technologies used: VB.NET, VB, ASP, ADO, VB Script, MS SQL, T-SQL, VSS, OOD, XML, HTML, JavaScript, Crystal Reports Software Engineer III Mercury Payment Systems March 2011  –  June 2012  (1 year 4 months) Software Engineer III Mercury Payment Systems March 2011  –  June 2012  (1 year 4 months) Sr Software Engineer Planet Group, Inc. October 2010  –  February 2011  (5 months) On assignment at Mercury Payment Systems Sr Software Engineer Planet Group, Inc. October 2010  –  February 2011  (5 months) On assignment at Mercury Payment Systems Sr. Software Engineer Veracity Credit Consultants February 2007  –  July 2010  (3 years 6 months) As Chief Applications Architect of a small team I designed and built an enterprise level CRM system, including secure Client and Partner web portals, Web Services and other integration APIs, metrics dashboards and ecommerce billing systems. In an evolving business environment was able to apply agile methodologies to allow rapid development of new system features. Through system automations and efficiency driven projects the company was able to handle 4 times the original volume with the half number of employees. worked to convert from VB.net to C#. Technologies used: VB.Net, ASP.Net, OOAD, MS SQL, T-SQL, VSS, C# Sr. Software Engineer Veracity Credit Consultants February 2007  –  July 2010  (3 years 6 months) As Chief Applications Architect of a small team I designed and built an enterprise level CRM system, including secure Client and Partner web portals, Web Services and other integration APIs, metrics dashboards and ecommerce billing systems. In an evolving business environment was able to apply agile methodologies to allow rapid development of new system features. Through system automations and efficiency driven projects the company was able to handle 4 times the original volume with the half number of employees. worked to convert from VB.net to C#. Technologies used: VB.Net, ASP.Net, OOAD, MS SQL, T-SQL, VSS, C# Sr Software Developer ID Watchdog 2007  –  2008  (1 year) Sr Software Developer ID Watchdog 2007  –  2008  (1 year) Sr Software Engineer Air Methods June 2006  –  January 2007  (8 months) Sr Software Engineer Air Methods June 2006  –  January 2007  (8 months) Software Developer 5280 Solutions Inc November 2005  –  January 2007  (1 year 3 months) Designed and built new components for exiting student loan servicing system to fulfill client need for government bid from business design specifications. Integrated these new components with existing routines and database. Design and implemented new table structures and stored procedures. Wrote tech designs and project plans for my project section. Technologies used: VB.Net, ADO.NET, MS SQL, T-SQL, VSS Software Developer 5280 Solutions Inc November 2005  –  January 2007  (1 year 3 months) Designed and built new components for exiting student loan servicing system to fulfill client need for government bid from business design specifications. Integrated these new components with existing routines and database. Design and implemented new table structures and stored procedures. Wrote tech designs and project plans for my project section. Technologies used: VB.Net, ADO.NET, MS SQL, T-SQL, VSS Consultant HCA May 2005  –  June 2006  (1 year 2 months) Consultant HCA May 2005  –  June 2006  (1 year 2 months) Software Engineer United Car Care July 2003  –  February 2004  (8 months) As a member of a small team of developers, I helped build the company's interactive agent web site system. This web site allows agents in the field to build pricing sheet, get claims status information, monthly report files and other necessary documents. An emphasis was placed on ensuring the security of the information and on-time project completion. I personally generated the project plan for the web project from the time of my joining the team to the completion of the project. Designed and built systems for secure access to accounting reports and other secured documents. Developed content management sub systems to ensure consistent appearance and format of all pages in the site. Build specifications and complex reports from clients description of needs. Technologies used: VB.NET, VB, MS SQL, T-SQL, ASP, ADO, VB Script, JavaScript, VSS, OOD Software Engineer United Car Care July 2003  –  February 2004  (8 months) As a member of a small team of developers, I helped build the company's interactive agent web site system. This web site allows agents in the field to build pricing sheet, get claims status information, monthly report files and other necessary documents. An emphasis was placed on ensuring the security of the information and on-time project completion. I personally generated the project plan for the web project from the time of my joining the team to the completion of the project. Designed and built systems for secure access to accounting reports and other secured documents. Developed content management sub systems to ensure consistent appearance and format of all pages in the site. Build specifications and complex reports from clients description of needs. Technologies used: VB.NET, VB, MS SQL, T-SQL, ASP, ADO, VB Script, JavaScript, VSS, OOD Sr Software Engineer Motorola June 2000  –  September 2002  (2 years 4 months) As part of the core design team of senior developers, I designed and built a large, scalable n-tier records management system for the public safety industry. This application consisted primarily of a framework allowing other developers to build specific modules, such as traffic tickets and personal arrest history. I personally designed and wrote a number of the core systems including the following. The user validation system used COM objects on the application server to validate user login requests against the Windows domain. The centralized configuration management system allowed the administrator to configure multiple environments for the users to access, specifying application servers, database servers and specific databases to be used for the session, allowing the user to login to multiple production or training configurations. This also allowed assigning connection to different related services for each configuration. The security permissions systems enabled the Administrator to build both complex and simple security groups and assign users to these groups. I then integrated this information in to the data access and data update, screen controls, menus and user controls to respect the various permissions granted. The address validation system took existing Geographical data and parsed user input addresses, this system was capable of validating and providing latitude and longitude for buildings, intersections and commonly named locations. These system utilized XML, COM, DCOM, ADO, MS SQL, T-SQL, VB, OOD Sr Software Engineer Motorola June 2000  –  September 2002  (2 years 4 months) As part of the core design team of senior developers, I designed and built a large, scalable n-tier records management system for the public safety industry. This application consisted primarily of a framework allowing other developers to build specific modules, such as traffic tickets and personal arrest history. I personally designed and wrote a number of the core systems including the following. The user validation system used COM objects on the application server to validate user login requests against the Windows domain. The centralized configuration management system allowed the administrator to configure multiple environments for the users to access, specifying application servers, database servers and specific databases to be used for the session, allowing the user to login to multiple production or training configurations. This also allowed assigning connection to different related services for each configuration. The security permissions systems enabled the Administrator to build both complex and simple security groups and assign users to these groups. I then integrated this information in to the data access and data update, screen controls, menus and user controls to respect the various permissions granted. The address validation system took existing Geographical data and parsed user input addresses, this system was capable of validating and providing latitude and longitude for buildings, intersections and commonly named locations. These system utilized XML, COM, DCOM, ADO, MS SQL, T-SQL, VB, OOD MIS Department Manager, Head Programmer Cartel Asset Management, Inc December 1996  –  February 1999  (2 years 3 months) Inherited problematic Access 2.0 Database Tracking system in version 1.0 matured this system through to version 7.9, personally re-engineering all internal company and data processes. Moved the Tracking system in to SQL Server. Hired and trained team of programmers and system administrators to continue system improvements. Implemented NT servers with RAID5 system to handle system needs. Setup and maintained email, data backup, and RAS systems. Completely reworked network to eliminate excessive down times. Developed imaging system using OCR and high-speed scanners to handle mass form recognition and indexing in to the database for numerical analysis and retrevial by the clients. Created a single proposal to improve efficiency to the amount of $150,000 in first year savings through implementation of a fax server. The systems I designed and created enabled a 200% volume jump with 65% of the staffing requirements. Technologies used: VB, ASP, DAO, VB Script, MS SQL, T-SQL, MS Access, MS Excel MIS Department Manager, Head Programmer Cartel Asset Management, Inc December 1996  –  February 1999  (2 years 3 months) Inherited problematic Access 2.0 Database Tracking system in version 1.0 matured this system through to version 7.9, personally re-engineering all internal company and data processes. Moved the Tracking system in to SQL Server. Hired and trained team of programmers and system administrators to continue system improvements. Implemented NT servers with RAID5 system to handle system needs. Setup and maintained email, data backup, and RAS systems. Completely reworked network to eliminate excessive down times. Developed imaging system using OCR and high-speed scanners to handle mass form recognition and indexing in to the database for numerical analysis and retrevial by the clients. Created a single proposal to improve efficiency to the amount of $150,000 in first year savings through implementation of a fax server. The systems I designed and created enabled a 200% volume jump with 65% of the staffing requirements. Technologies used: VB, ASP, DAO, VB Script, MS SQL, T-SQL, MS Access, MS Excel Computer Services Manager MVG Services Ltd September 1992  –  November 1996  (4 years 3 months) Designed, wrote, implemented, and trained users on integrated database interface software for all aspects of customer job tracking. Database Administrator for customer & job tracking database, generated reports by complex SQL statements. Setup, maintained and optimized LAN system including remote access computers. Was responsible for trouble shooting and repairing all company systems. Recommended and implemented system hardware and software upgrades to deliver optimum performance at best value. Oversaw and maintained Inventory system. Maintained full system backup and anti-virus plan and execution to insure data safety. Also responsible for maintaining all communications systems. VB, ASP, DAO, VB Script, MS SQL, T-SQL, MS Access, MS Excel Computer Services Manager MVG Services Ltd September 1992  –  November 1996  (4 years 3 months) Designed, wrote, implemented, and trained users on integrated database interface software for all aspects of customer job tracking. Database Administrator for customer & job tracking database, generated reports by complex SQL statements. Setup, maintained and optimized LAN system including remote access computers. Was responsible for trouble shooting and repairing all company systems. Recommended and implemented system hardware and software upgrades to deliver optimum performance at best value. Oversaw and maintained Inventory system. Maintained full system backup and anti-virus plan and execution to insure data safety. Also responsible for maintaining all communications systems. VB, ASP, DAO, VB Script, MS SQL, T-SQL, MS Access, MS Excel Skills C# Databases Microsoft SQL Server XML Agile Methodologies SQL .NET Web Services SDLC ASP.NET Skills  C# Databases Microsoft SQL Server XML Agile Methodologies SQL .NET Web Services SDLC ASP.NET C# Databases Microsoft SQL Server XML Agile Methodologies SQL .NET Web Services SDLC ASP.NET C# Databases Microsoft SQL Server XML Agile Methodologies SQL .NET Web Services SDLC ASP.NET ", "Experience Sr.Software Engineer LMKT July 2014  – Present (1 year 2 months) Islamabad SharePoint 2013 Customization, Development and Administration Software Engineer LMKT January 2013  –  June 2014  (1 year 6 months) Islamabad SharePoint 2010 customization, Development and Administration Application Engineer LMKT January 2012  –  December 2012  (1 year) Islamabad SharePoint 2010 Customization, Development and Administration Application Engineer LMKR May 2011  –  December 2011  (8 months) Islamabad SharePoint 2010 Customization, Development and Administration Junior Developer Expert Systems (Pvt) Ltd July 2009  –  April 2011  (1 year 10 months) Islamabad SharePoint Development and Administration Sr.Software Engineer LMKT July 2014  – Present (1 year 2 months) Islamabad SharePoint 2013 Customization, Development and Administration Sr.Software Engineer LMKT July 2014  – Present (1 year 2 months) Islamabad SharePoint 2013 Customization, Development and Administration Software Engineer LMKT January 2013  –  June 2014  (1 year 6 months) Islamabad SharePoint 2010 customization, Development and Administration Software Engineer LMKT January 2013  –  June 2014  (1 year 6 months) Islamabad SharePoint 2010 customization, Development and Administration Application Engineer LMKT January 2012  –  December 2012  (1 year) Islamabad SharePoint 2010 Customization, Development and Administration Application Engineer LMKT January 2012  –  December 2012  (1 year) Islamabad SharePoint 2010 Customization, Development and Administration Application Engineer LMKR May 2011  –  December 2011  (8 months) Islamabad SharePoint 2010 Customization, Development and Administration Application Engineer LMKR May 2011  –  December 2011  (8 months) Islamabad SharePoint 2010 Customization, Development and Administration Junior Developer Expert Systems (Pvt) Ltd July 2009  –  April 2011  (1 year 10 months) Islamabad SharePoint Development and Administration Junior Developer Expert Systems (Pvt) Ltd July 2009  –  April 2011  (1 year 10 months) Islamabad SharePoint Development and Administration Languages English Professional working proficiency Urdu Native or bilingual proficiency Pashto Native or bilingual proficiency English Professional working proficiency Urdu Native or bilingual proficiency Pashto Native or bilingual proficiency English Professional working proficiency Urdu Native or bilingual proficiency Pashto Native or bilingual proficiency Professional working proficiency Native or bilingual proficiency Native or bilingual proficiency Skills SharePoint Designer SharePoint Server SharePoint... InfoPath Forms Content Management Web Content Management JavaScript jQuery ASP.NET Business Process... C# HTML XML Microsoft SQL Server CAML Skills  SharePoint Designer SharePoint Server SharePoint... InfoPath Forms Content Management Web Content Management JavaScript jQuery ASP.NET Business Process... C# HTML XML Microsoft SQL Server CAML SharePoint Designer SharePoint Server SharePoint... InfoPath Forms Content Management Web Content Management JavaScript jQuery ASP.NET Business Process... C# HTML XML Microsoft SQL Server CAML SharePoint Designer SharePoint Server SharePoint... InfoPath Forms Content Management Web Content Management JavaScript jQuery ASP.NET Business Process... C# HTML XML Microsoft SQL Server CAML Education University of Arid Agriculture, Rwalpindi MCS,  Computer Science , B 2006  – 2008 Activities and Societies:  Hiking University of Arid Agriculture, Rwalpindi MCS,  Computer Science , B 2006  – 2008 Activities and Societies:  Hiking University of Arid Agriculture, Rwalpindi MCS,  Computer Science , B 2006  – 2008 Activities and Societies:  Hiking University of Arid Agriculture, Rwalpindi MCS,  Computer Science , B 2006  – 2008 Activities and Societies:  Hiking ", "Experience Domain coach BICS November 2010  – Present (4 years 10 months) Senior Software Engineer Belgacom International Carrier Services December 2006  –  November 2010  (4 years) Software Architect Centre familial de bruxelles 2005  –  2006  (1 year) Brussels Area, Belgium Software Engineer Sidmar 2005  –  2005  (less than a year) Software Engineer Digipolis 2004  –  2005  (1 year) Antwerp Area, Belgium Software Engineer Agfa HealthCare 2003  –  2004  (1 year) Gent Area, Belgium Software Engineer Business applications 2001  –  2003  (2 years) Gent Area, Belgium Web Developer The Reference 1999  –  2001  (2 years) Gent Area, Belgium Domain coach BICS November 2010  – Present (4 years 10 months) Domain coach BICS November 2010  – Present (4 years 10 months) Senior Software Engineer Belgacom International Carrier Services December 2006  –  November 2010  (4 years) Senior Software Engineer Belgacom International Carrier Services December 2006  –  November 2010  (4 years) Software Architect Centre familial de bruxelles 2005  –  2006  (1 year) Brussels Area, Belgium Software Architect Centre familial de bruxelles 2005  –  2006  (1 year) Brussels Area, Belgium Software Engineer Sidmar 2005  –  2005  (less than a year) Software Engineer Sidmar 2005  –  2005  (less than a year) Software Engineer Digipolis 2004  –  2005  (1 year) Antwerp Area, Belgium Software Engineer Digipolis 2004  –  2005  (1 year) Antwerp Area, Belgium Software Engineer Agfa HealthCare 2003  –  2004  (1 year) Gent Area, Belgium Software Engineer Agfa HealthCare 2003  –  2004  (1 year) Gent Area, Belgium Software Engineer Business applications 2001  –  2003  (2 years) Gent Area, Belgium Software Engineer Business applications 2001  –  2003  (2 years) Gent Area, Belgium Web Developer The Reference 1999  –  2001  (2 years) Gent Area, Belgium Web Developer The Reference 1999  –  2001  (2 years) Gent Area, Belgium Languages English Full professional proficiency French Native or bilingual proficiency Dutch Native or bilingual proficiency English Full professional proficiency French Native or bilingual proficiency Dutch Native or bilingual proficiency English Full professional proficiency French Native or bilingual proficiency Dutch Native or bilingual proficiency Full professional proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Telecommunications Program Management Project Management Scrum Skills  Telecommunications Program Management Project Management Scrum Telecommunications Program Management Project Management Scrum Telecommunications Program Management Project Management Scrum Education HUB-KAHO Master of Engineering (MEng),  Building Construction Technology 2004  – 2008 HUB-KAHO Master of Engineering (MEng),  Building Construction Technology 2004  – 2008 HUB-KAHO Master of Engineering (MEng),  Building Construction Technology 2004  – 2008 HUB-KAHO Master of Engineering (MEng),  Building Construction Technology 2004  – 2008 ", "Experience Software engineer business applications Agidens November 2010  – Present (4 years 10 months) Zwijndrecht I'm working in the MES group in the Process Automation division of Egemin where i'm developing applications in C# for several industrial activities like: tank terminal, food, automotive, chemicals, .... Voorzitter Studiant vzw July 2008  –  December 2012  (4 years 6 months) Medewerker Technische dienst (Jobstudent) AZ KLINA July 2003  –  August 2009  (6 years 2 months) Brasschaat Stage Cegelec BU Ensysta Automation Cegelec July 2008  –  June 2009  (1 year) Vice-voorzitter Studiant vzw July 2006  –  July 2008  (2 years 1 month) PR Studiant vzw May 2005  –  July 2006  (1 year 3 months) Software engineer business applications Agidens November 2010  – Present (4 years 10 months) Zwijndrecht I'm working in the MES group in the Process Automation division of Egemin where i'm developing applications in C# for several industrial activities like: tank terminal, food, automotive, chemicals, .... Software engineer business applications Agidens November 2010  – Present (4 years 10 months) Zwijndrecht I'm working in the MES group in the Process Automation division of Egemin where i'm developing applications in C# for several industrial activities like: tank terminal, food, automotive, chemicals, .... Voorzitter Studiant vzw July 2008  –  December 2012  (4 years 6 months) Voorzitter Studiant vzw July 2008  –  December 2012  (4 years 6 months) Medewerker Technische dienst (Jobstudent) AZ KLINA July 2003  –  August 2009  (6 years 2 months) Brasschaat Medewerker Technische dienst (Jobstudent) AZ KLINA July 2003  –  August 2009  (6 years 2 months) Brasschaat Stage Cegelec BU Ensysta Automation Cegelec July 2008  –  June 2009  (1 year) Stage Cegelec BU Ensysta Automation Cegelec July 2008  –  June 2009  (1 year) Vice-voorzitter Studiant vzw July 2006  –  July 2008  (2 years 1 month) Vice-voorzitter Studiant vzw July 2006  –  July 2008  (2 years 1 month) PR Studiant vzw May 2005  –  July 2006  (1 year 3 months) PR Studiant vzw May 2005  –  July 2006  (1 year 3 months) Skills C# Automation Microsoft Office SQL Operating Systems Programming PHP VB.NET Visual Basic ASP.NET .NET HTML Testing Visual Studio Project Management Windows XML English Software Development PLC Engineering Microsoft SQL Server MS Project French See 9+     See less Skills  C# Automation Microsoft Office SQL Operating Systems Programming PHP VB.NET Visual Basic ASP.NET .NET HTML Testing Visual Studio Project Management Windows XML English Software Development PLC Engineering Microsoft SQL Server MS Project French See 9+     See less C# Automation Microsoft Office SQL Operating Systems Programming PHP VB.NET Visual Basic ASP.NET .NET HTML Testing Visual Studio Project Management Windows XML English Software Development PLC Engineering Microsoft SQL Server MS Project French See 9+     See less C# Automation Microsoft Office SQL Operating Systems Programming PHP VB.NET Visual Basic ASP.NET .NET HTML Testing Visual Studio Project Management Windows XML English Software Development PLC Engineering Microsoft SQL Server MS Project French See 9+     See less Education Katholieke Hogeschool Zuid-West-Vlaanderen Extra vakken in de,  Toegepaste informatica 2011  – 2012 Universiteit Gent Master in de toegepaste informatica,  Informatica 2009  – 2011 'Karel de Grote' Hogeschool Antwerpen Master of Science (M.Sc.),  Industrieel Ingenieur Elektromechnica optie Automatisering 2003  – 2009 Activities and Societies:  04-05 Voorzitter KdG-Studentenraad dep IWT ,  05-06 Voorzitter KdG-Studentenraad koepel Microsoft MCTS Study for exam 70-516,  Accessing data with Microsoft .Net Framework 4 2012 Katholieke Hogeschool Zuid-West-Vlaanderen Extra vakken in de,  Toegepaste informatica 2011  – 2012 Katholieke Hogeschool Zuid-West-Vlaanderen Extra vakken in de,  Toegepaste informatica 2011  – 2012 Katholieke Hogeschool Zuid-West-Vlaanderen Extra vakken in de,  Toegepaste informatica 2011  – 2012 Universiteit Gent Master in de toegepaste informatica,  Informatica 2009  – 2011 Universiteit Gent Master in de toegepaste informatica,  Informatica 2009  – 2011 Universiteit Gent Master in de toegepaste informatica,  Informatica 2009  – 2011 'Karel de Grote' Hogeschool Antwerpen Master of Science (M.Sc.),  Industrieel Ingenieur Elektromechnica optie Automatisering 2003  – 2009 Activities and Societies:  04-05 Voorzitter KdG-Studentenraad dep IWT ,  05-06 Voorzitter KdG-Studentenraad koepel 'Karel de Grote' Hogeschool Antwerpen Master of Science (M.Sc.),  Industrieel Ingenieur Elektromechnica optie Automatisering 2003  – 2009 Activities and Societies:  04-05 Voorzitter KdG-Studentenraad dep IWT ,  05-06 Voorzitter KdG-Studentenraad koepel 'Karel de Grote' Hogeschool Antwerpen Master of Science (M.Sc.),  Industrieel Ingenieur Elektromechnica optie Automatisering 2003  – 2009 Activities and Societies:  04-05 Voorzitter KdG-Studentenraad dep IWT ,  05-06 Voorzitter KdG-Studentenraad koepel Microsoft MCTS Study for exam 70-516,  Accessing data with Microsoft .Net Framework 4 2012 Microsoft MCTS Study for exam 70-516,  Accessing data with Microsoft .Net Framework 4 2012 Microsoft MCTS Study for exam 70-516,  Accessing data with Microsoft .Net Framework 4 2012 ", "Skills Web Services Perl XML Extreme Programming Problem Solving Android Agile Methodologies Skills  Web Services Perl XML Extreme Programming Problem Solving Android Agile Methodologies Web Services Perl XML Extreme Programming Problem Solving Android Agile Methodologies Web Services Perl XML Extreme Programming Problem Solving Android Agile Methodologies ", "Experience Software developer Freelance November 2012  – Present (2 years 10 months) Tashkent, Uzbekistan Software engineer Business Applications Solutions January 2011  –  October 2012  (1 year 10 months) Developing software for public key infrastructure Consultant Business Applications Solutions August 2008  –  December 2011  (3 years 5 months) Senior Consultant ABS Soft Development June 2006  –  August 2007  (1 year 3 months) Software developer Freelance November 2012  – Present (2 years 10 months) Tashkent, Uzbekistan Software developer Freelance November 2012  – Present (2 years 10 months) Tashkent, Uzbekistan Software engineer Business Applications Solutions January 2011  –  October 2012  (1 year 10 months) Developing software for public key infrastructure Software engineer Business Applications Solutions January 2011  –  October 2012  (1 year 10 months) Developing software for public key infrastructure Consultant Business Applications Solutions August 2008  –  December 2011  (3 years 5 months) Consultant Business Applications Solutions August 2008  –  December 2011  (3 years 5 months) Senior Consultant ABS Soft Development June 2006  –  August 2007  (1 year 3 months) Senior Consultant ABS Soft Development June 2006  –  August 2007  (1 year 3 months) Languages Russian English Russian English Russian English Skills PL/SQL Oracle Java SQL XSLT Software Development Databases Oracle E-Business Suite JavaScript PostgreSQL Android Development Python Cryptography Linux Web Services Oracle Applications ERP Unix Eclipse Performance Tuning Subversion Git HTML Java Concurrency Scala See 10+     See less Skills  PL/SQL Oracle Java SQL XSLT Software Development Databases Oracle E-Business Suite JavaScript PostgreSQL Android Development Python Cryptography Linux Web Services Oracle Applications ERP Unix Eclipse Performance Tuning Subversion Git HTML Java Concurrency Scala See 10+     See less PL/SQL Oracle Java SQL XSLT Software Development Databases Oracle E-Business Suite JavaScript PostgreSQL Android Development Python Cryptography Linux Web Services Oracle Applications ERP Unix Eclipse Performance Tuning Subversion Git HTML Java Concurrency Scala See 10+     See less PL/SQL Oracle Java SQL XSLT Software Development Databases Oracle E-Business Suite JavaScript PostgreSQL Android Development Python Cryptography Linux Web Services Oracle Applications ERP Unix Eclipse Performance Tuning Subversion Git HTML Java Concurrency Scala See 10+     See less Education National University of Uzbekistan named after Mirzo Ulugbek Bachelor's degree,  Computer Science 2001  – 2005 National University of Uzbekistan named after Mirzo Ulugbek Bachelor's degree,  Computer Science 2001  – 2005 National University of Uzbekistan named after Mirzo Ulugbek Bachelor's degree,  Computer Science 2001  – 2005 National University of Uzbekistan named after Mirzo Ulugbek Bachelor's degree,  Computer Science 2001  – 2005 ", "Experience Software Engineer/Business Applications Specialist Moody's Analytics 1995  – Present (20 years) Software Engineer/Business Applications Specialist Moody's Analytics 1995  – Present (20 years) Software Engineer/Business Applications Specialist Moody's Analytics 1995  – Present (20 years) Skills Software Development .NET C# ASP.NET Web Services JavaScript SQL Microsoft SQL Server Oracle Agile Methodologies Requirements Analysis Skills  Software Development .NET C# ASP.NET Web Services JavaScript SQL Microsoft SQL Server Oracle Agile Methodologies Requirements Analysis Software Development .NET C# ASP.NET Web Services JavaScript SQL Microsoft SQL Server Oracle Agile Methodologies Requirements Analysis Software Development .NET C# ASP.NET Web Services JavaScript SQL Microsoft SQL Server Oracle Agile Methodologies Requirements Analysis ", "Summary Experienced Java developer with great communication skills. Willing to take initiative on new ideas. Very strong skills in RCP (Eclipse platform) development and JMS architecture/development. Becoming very proficient with relational database design with regard to data integrity and efficiency. Strong desire to continually grow and learn new things. Specialties:Innovation and efficiency Summary Experienced Java developer with great communication skills. Willing to take initiative on new ideas. Very strong skills in RCP (Eclipse platform) development and JMS architecture/development. Becoming very proficient with relational database design with regard to data integrity and efficiency. Strong desire to continually grow and learn new things. Specialties:Innovation and efficiency Experienced Java developer with great communication skills. Willing to take initiative on new ideas. Very strong skills in RCP (Eclipse platform) development and JMS architecture/development. Becoming very proficient with relational database design with regard to data integrity and efficiency. Strong desire to continually grow and learn new things. Specialties:Innovation and efficiency Experienced Java developer with great communication skills. Willing to take initiative on new ideas. Very strong skills in RCP (Eclipse platform) development and JMS architecture/development. Becoming very proficient with relational database design with regard to data integrity and efficiency. Strong desire to continually grow and learn new things. Specialties:Innovation and efficiency Experience Software Engineer Business Applications Google June 2010  – Present (5 years 3 months) I work as a front-end engineer on Google+ Hangouts and video conferencing. Programmer II State of Colorado August 2007  –  July 2010  (3 years) Primary language used is Java. Heavy development building on the Eclipse platform using RCP, J2EE, Hibernate, and SOA. Large involvement in database design and implementation with DB2. Lead development on a large project using JMS to do live conversion between two completely different live databases. Software Developer Aerostream Communications June 2006  –  August 2007  (1 year 3 months) Primary languages used: C++, C, and even some assembly. Embedded programming with 8051 and AVR microprocessor architecture. GUI design and implementation for rich client Java applications. GUI design and implementation with various LCDs. Software Engineer Business Applications Google June 2010  – Present (5 years 3 months) I work as a front-end engineer on Google+ Hangouts and video conferencing. Software Engineer Business Applications Google June 2010  – Present (5 years 3 months) I work as a front-end engineer on Google+ Hangouts and video conferencing. Programmer II State of Colorado August 2007  –  July 2010  (3 years) Primary language used is Java. Heavy development building on the Eclipse platform using RCP, J2EE, Hibernate, and SOA. Large involvement in database design and implementation with DB2. Lead development on a large project using JMS to do live conversion between two completely different live databases. Programmer II State of Colorado August 2007  –  July 2010  (3 years) Primary language used is Java. Heavy development building on the Eclipse platform using RCP, J2EE, Hibernate, and SOA. Large involvement in database design and implementation with DB2. Lead development on a large project using JMS to do live conversion between two completely different live databases. Software Developer Aerostream Communications June 2006  –  August 2007  (1 year 3 months) Primary languages used: C++, C, and even some assembly. Embedded programming with 8051 and AVR microprocessor architecture. GUI design and implementation for rich client Java applications. GUI design and implementation with various LCDs. Software Developer Aerostream Communications June 2006  –  August 2007  (1 year 3 months) Primary languages used: C++, C, and even some assembly. Embedded programming with 8051 and AVR microprocessor architecture. GUI design and implementation for rich client Java applications. GUI design and implementation with various LCDs. Skills Google Closure GWT AppEngine Eclipse Java Java Enterprise Edition Hibernate SOA JMS DB2 JBoss Application Server REST Spring Databases JSP Python Subversion See 2+     See less Skills  Google Closure GWT AppEngine Eclipse Java Java Enterprise Edition Hibernate SOA JMS DB2 JBoss Application Server REST Spring Databases JSP Python Subversion See 2+     See less Google Closure GWT AppEngine Eclipse Java Java Enterprise Edition Hibernate SOA JMS DB2 JBoss Application Server REST Spring Databases JSP Python Subversion See 2+     See less Google Closure GWT AppEngine Eclipse Java Java Enterprise Edition Hibernate SOA JMS DB2 JBoss Application Server REST Spring Databases JSP Python Subversion See 2+     See less Education Colorado School of Mines Engineering and Technology Management,  Economics and Business 2008  – 2010 Completed in 2 years working full time with a 3.8 GPA. Colorado School of Mines Math and Computer Science,  Math and Computer Science 2004  – 2007 Completed in 3 years. Colorado School of Mines Engineering and Technology Management,  Economics and Business 2008  – 2010 Completed in 2 years working full time with a 3.8 GPA. Colorado School of Mines Engineering and Technology Management,  Economics and Business 2008  – 2010 Completed in 2 years working full time with a 3.8 GPA. Colorado School of Mines Engineering and Technology Management,  Economics and Business 2008  – 2010 Completed in 2 years working full time with a 3.8 GPA. Colorado School of Mines Math and Computer Science,  Math and Computer Science 2004  – 2007 Completed in 3 years. Colorado School of Mines Math and Computer Science,  Math and Computer Science 2004  – 2007 Completed in 3 years. Colorado School of Mines Math and Computer Science,  Math and Computer Science 2004  – 2007 Completed in 3 years. ", "Summary Business and technology savvy professional, with 13+ years of solid experience in strategic management, ERP/Business consulting, Application Upgrades and Production Support, Information Systems development/management, program management, operations, client services and financial management at leading global and blue chip organizations. \n \nSpecialties: Solution conceptualization and implementation, \nBusiness analysis and consulting, \nChange program management \n8+ years of industry experience in Oracle E-Business Suite both functional and technical with the versions from 11 to R12.1.3 in the capacity of project management, consultancy and implementation.  \n13+ years of overall IT industry experience from 2001 to 2014 in diversified business domains. \nProven records in timely delivering innovative solutions using Oracle E-Business Suite and other Business Suites. Good project management.  \n13+ years experience of working with different IT teams, Finance teams, Audit teams and user groups whilst delivering business solutions in diversified business domains with change management. Summary Business and technology savvy professional, with 13+ years of solid experience in strategic management, ERP/Business consulting, Application Upgrades and Production Support, Information Systems development/management, program management, operations, client services and financial management at leading global and blue chip organizations. \n \nSpecialties: Solution conceptualization and implementation, \nBusiness analysis and consulting, \nChange program management \n8+ years of industry experience in Oracle E-Business Suite both functional and technical with the versions from 11 to R12.1.3 in the capacity of project management, consultancy and implementation.  \n13+ years of overall IT industry experience from 2001 to 2014 in diversified business domains. \nProven records in timely delivering innovative solutions using Oracle E-Business Suite and other Business Suites. Good project management.  \n13+ years experience of working with different IT teams, Finance teams, Audit teams and user groups whilst delivering business solutions in diversified business domains with change management. Business and technology savvy professional, with 13+ years of solid experience in strategic management, ERP/Business consulting, Application Upgrades and Production Support, Information Systems development/management, program management, operations, client services and financial management at leading global and blue chip organizations. \n \nSpecialties: Solution conceptualization and implementation, \nBusiness analysis and consulting, \nChange program management \n8+ years of industry experience in Oracle E-Business Suite both functional and technical with the versions from 11 to R12.1.3 in the capacity of project management, consultancy and implementation.  \n13+ years of overall IT industry experience from 2001 to 2014 in diversified business domains. \nProven records in timely delivering innovative solutions using Oracle E-Business Suite and other Business Suites. Good project management.  \n13+ years experience of working with different IT teams, Finance teams, Audit teams and user groups whilst delivering business solutions in diversified business domains with change management. Business and technology savvy professional, with 13+ years of solid experience in strategic management, ERP/Business consulting, Application Upgrades and Production Support, Information Systems development/management, program management, operations, client services and financial management at leading global and blue chip organizations. \n \nSpecialties: Solution conceptualization and implementation, \nBusiness analysis and consulting, \nChange program management \n8+ years of industry experience in Oracle E-Business Suite both functional and technical with the versions from 11 to R12.1.3 in the capacity of project management, consultancy and implementation.  \n13+ years of overall IT industry experience from 2001 to 2014 in diversified business domains. \nProven records in timely delivering innovative solutions using Oracle E-Business Suite and other Business Suites. Good project management.  \n13+ years experience of working with different IT teams, Finance teams, Audit teams and user groups whilst delivering business solutions in diversified business domains with change management. Experience Head of Enterprise Applications, Oracle ERP Pre Sales & Oracle EBS Techno Functional Consultant Aitken Spence Technologies (Pvt) Ltd. April 2011  – Present (4 years 5 months) Oracle ERP Pre Sales \nOracle EBS Techno Functional Consultant \nOracle EBS Project Management \nOracle EBS Delivery Management \nOracle University Training ACB Toastmasters International 2005  –  2013  (8 years) Business Systems Lead SriLankan Airlines June 2010  –  May 2011  (1 year) Project Management IT Project Controller SriLankan Airlines November 2008  –  June 2010  (1 year 8 months) Project Management Software Engineer (Oracle EBS 11, R12 and Financial Systems) SriLankan Airlines November 2005  –  November 2008  (3 years 1 month) Software development, implementation and support Systems Engineer (Financial Systems) Data Management Systems Ltd November 2004  –  November 2005  (1 year 1 month) System development, implementation and support Software Engineer (Business Applications) Bits & Bytes (Pte) Ltd March 2004  –  November 2004  (9 months) Outsourced to Unilever Ceylon Limited Lecturer (Software Engineering) cum Software Engineer (Business Applications) Gateway Computer Services (Pvt) Ltd April 2002  –  March 2004  (2 years) System development, support and maintenance \nTraining Head of Enterprise Applications, Oracle ERP Pre Sales & Oracle EBS Techno Functional Consultant Aitken Spence Technologies (Pvt) Ltd. April 2011  – Present (4 years 5 months) Oracle ERP Pre Sales \nOracle EBS Techno Functional Consultant \nOracle EBS Project Management \nOracle EBS Delivery Management \nOracle University Training Head of Enterprise Applications, Oracle ERP Pre Sales & Oracle EBS Techno Functional Consultant Aitken Spence Technologies (Pvt) Ltd. April 2011  – Present (4 years 5 months) Oracle ERP Pre Sales \nOracle EBS Techno Functional Consultant \nOracle EBS Project Management \nOracle EBS Delivery Management \nOracle University Training ACB Toastmasters International 2005  –  2013  (8 years) ACB Toastmasters International 2005  –  2013  (8 years) Business Systems Lead SriLankan Airlines June 2010  –  May 2011  (1 year) Project Management Business Systems Lead SriLankan Airlines June 2010  –  May 2011  (1 year) Project Management IT Project Controller SriLankan Airlines November 2008  –  June 2010  (1 year 8 months) Project Management IT Project Controller SriLankan Airlines November 2008  –  June 2010  (1 year 8 months) Project Management Software Engineer (Oracle EBS 11, R12 and Financial Systems) SriLankan Airlines November 2005  –  November 2008  (3 years 1 month) Software development, implementation and support Software Engineer (Oracle EBS 11, R12 and Financial Systems) SriLankan Airlines November 2005  –  November 2008  (3 years 1 month) Software development, implementation and support Systems Engineer (Financial Systems) Data Management Systems Ltd November 2004  –  November 2005  (1 year 1 month) System development, implementation and support Systems Engineer (Financial Systems) Data Management Systems Ltd November 2004  –  November 2005  (1 year 1 month) System development, implementation and support Software Engineer (Business Applications) Bits & Bytes (Pte) Ltd March 2004  –  November 2004  (9 months) Outsourced to Unilever Ceylon Limited Software Engineer (Business Applications) Bits & Bytes (Pte) Ltd March 2004  –  November 2004  (9 months) Outsourced to Unilever Ceylon Limited Lecturer (Software Engineering) cum Software Engineer (Business Applications) Gateway Computer Services (Pvt) Ltd April 2002  –  March 2004  (2 years) System development, support and maintenance \nTraining Lecturer (Software Engineering) cum Software Engineer (Business Applications) Gateway Computer Services (Pvt) Ltd April 2002  –  March 2004  (2 years) System development, support and maintenance \nTraining Languages Sinhalese Sinhalese Sinhalese Skills Project Management Oracle E-Business Suite Change Management Java Microsoft SQL Server C# Cloud Computing ASP.NET VB.NET UML SQL C++ Business Analysis Software Project... Outsourcing Cross-functional Team... Business Intelligence Oracle Agile Methodologies Oracle Applications Software Engineering Web Development Software Development Systems Analysis Databases Enterprise Software Requirements Analysis ERP Program Management Leadership See 15+     See less Skills  Project Management Oracle E-Business Suite Change Management Java Microsoft SQL Server C# Cloud Computing ASP.NET VB.NET UML SQL C++ Business Analysis Software Project... Outsourcing Cross-functional Team... Business Intelligence Oracle Agile Methodologies Oracle Applications Software Engineering Web Development Software Development Systems Analysis Databases Enterprise Software Requirements Analysis ERP Program Management Leadership See 15+     See less Project Management Oracle E-Business Suite Change Management Java Microsoft SQL Server C# Cloud Computing ASP.NET VB.NET UML SQL C++ Business Analysis Software Project... Outsourcing Cross-functional Team... Business Intelligence Oracle Agile Methodologies Oracle Applications Software Engineering Web Development Software Development Systems Analysis Databases Enterprise Software Requirements Analysis ERP Program Management Leadership See 15+     See less Project Management Oracle E-Business Suite Change Management Java Microsoft SQL Server C# Cloud Computing ASP.NET VB.NET UML SQL C++ Business Analysis Software Project... Outsourcing Cross-functional Team... Business Intelligence Oracle Agile Methodologies Oracle Applications Software Engineering Web Development Software Development Systems Analysis Databases Enterprise Software Requirements Analysis ERP Program Management Leadership See 15+     See less Education University of Moratuwa MSc,  Computer Science (Specialized in Software Architecture) 2007  – 2010 National University of Ireland BSc (Honours) 2nd Class Upper,  MIS 2000  – 2004 National Institute of Business Management (NIBM) Higher Diploma (2nd Class – Upper),  Computer Based Information Systems 2001  – 2002 National Institute of Business Management (NIBM) Diploma (77% Average),  Computer System Design 2000  – 2001 University of Colombo Certificate,  Information Technology 2000  – 2001 Ananda College, Colombo OL, AL,  Mathematics 1990  – 1999 University of Moratuwa MSc,  Computer Science (Specialized in Software Architecture) 2007  – 2010 University of Moratuwa MSc,  Computer Science (Specialized in Software Architecture) 2007  – 2010 University of Moratuwa MSc,  Computer Science (Specialized in Software Architecture) 2007  – 2010 National University of Ireland BSc (Honours) 2nd Class Upper,  MIS 2000  – 2004 National University of Ireland BSc (Honours) 2nd Class Upper,  MIS 2000  – 2004 National University of Ireland BSc (Honours) 2nd Class Upper,  MIS 2000  – 2004 National Institute of Business Management (NIBM) Higher Diploma (2nd Class – Upper),  Computer Based Information Systems 2001  – 2002 National Institute of Business Management (NIBM) Higher Diploma (2nd Class – Upper),  Computer Based Information Systems 2001  – 2002 National Institute of Business Management (NIBM) Higher Diploma (2nd Class – Upper),  Computer Based Information Systems 2001  – 2002 National Institute of Business Management (NIBM) Diploma (77% Average),  Computer System Design 2000  – 2001 National Institute of Business Management (NIBM) Diploma (77% Average),  Computer System Design 2000  – 2001 National Institute of Business Management (NIBM) Diploma (77% Average),  Computer System Design 2000  – 2001 University of Colombo Certificate,  Information Technology 2000  – 2001 University of Colombo Certificate,  Information Technology 2000  – 2001 University of Colombo Certificate,  Information Technology 2000  – 2001 Ananda College, Colombo OL, AL,  Mathematics 1990  – 1999 Ananda College, Colombo OL, AL,  Mathematics 1990  – 1999 Ananda College, Colombo OL, AL,  Mathematics 1990  – 1999 Honors & Awards Additional Honors & Awards Deputy Head Prefect & Colors Winner of Ananda College 1998 – 1999 \nPresident’s Scout \nSecretary, SriLankan Toastmasters Club, Competent Communicator Advanced – Bronze \nCrew Member, Christmas on Wings 2006 to present \nMember, SriLankan Wushu Club & IT Sports Club \nBest Software Development and Support from DMS Additional Honors & Awards Deputy Head Prefect & Colors Winner of Ananda College 1998 – 1999 \nPresident’s Scout \nSecretary, SriLankan Toastmasters Club, Competent Communicator Advanced – Bronze \nCrew Member, Christmas on Wings 2006 to present \nMember, SriLankan Wushu Club & IT Sports Club \nBest Software Development and Support from DMS Additional Honors & Awards Deputy Head Prefect & Colors Winner of Ananda College 1998 – 1999 \nPresident’s Scout \nSecretary, SriLankan Toastmasters Club, Competent Communicator Advanced – Bronze \nCrew Member, Christmas on Wings 2006 to present \nMember, SriLankan Wushu Club & IT Sports Club \nBest Software Development and Support from DMS Additional Honors & Awards Deputy Head Prefect & Colors Winner of Ananda College 1998 – 1999 \nPresident’s Scout \nSecretary, SriLankan Toastmasters Club, Competent Communicator Advanced – Bronze \nCrew Member, Christmas on Wings 2006 to present \nMember, SriLankan Wushu Club & IT Sports Club \nBest Software Development and Support from DMS ", "Summary IT Financial Management Systems - Planning, Budgeting, Costing, Technology Business Management. Continue enabling IT business advancement by organizing processes and transforming data around financial planning and accountability, transparent service-based costing, and financial business intelligence to make informed decisions for our providers and our partners. \n \nSpecialties: Financial Management - understanding, dissecting, and interpreting service-based costs and their allocations to partners to be a valued provider. \n \nSystem Management - bringing groups, engineers and technologies together to design, enhance, and maintain complex systems. \n \nCareful Analysis - analytical and tactical approach to impact, integration, and long-term strategies. Summary IT Financial Management Systems - Planning, Budgeting, Costing, Technology Business Management. Continue enabling IT business advancement by organizing processes and transforming data around financial planning and accountability, transparent service-based costing, and financial business intelligence to make informed decisions for our providers and our partners. \n \nSpecialties: Financial Management - understanding, dissecting, and interpreting service-based costs and their allocations to partners to be a valued provider. \n \nSystem Management - bringing groups, engineers and technologies together to design, enhance, and maintain complex systems. \n \nCareful Analysis - analytical and tactical approach to impact, integration, and long-term strategies. IT Financial Management Systems - Planning, Budgeting, Costing, Technology Business Management. Continue enabling IT business advancement by organizing processes and transforming data around financial planning and accountability, transparent service-based costing, and financial business intelligence to make informed decisions for our providers and our partners. \n \nSpecialties: Financial Management - understanding, dissecting, and interpreting service-based costs and their allocations to partners to be a valued provider. \n \nSystem Management - bringing groups, engineers and technologies together to design, enhance, and maintain complex systems. \n \nCareful Analysis - analytical and tactical approach to impact, integration, and long-term strategies. IT Financial Management Systems - Planning, Budgeting, Costing, Technology Business Management. Continue enabling IT business advancement by organizing processes and transforming data around financial planning and accountability, transparent service-based costing, and financial business intelligence to make informed decisions for our providers and our partners. \n \nSpecialties: Financial Management - understanding, dissecting, and interpreting service-based costs and their allocations to partners to be a valued provider. \n \nSystem Management - bringing groups, engineers and technologies together to design, enhance, and maintain complex systems. \n \nCareful Analysis - analytical and tactical approach to impact, integration, and long-term strategies. Experience Cost Management Solutions Manager, Office of the CIO The Church of Jesus Christ of Latter-day Saints May 2015  – Present (4 months) Greater Salt Lake City Area IT Financial Management Systems - Planning, Budgeting, Costing, Technology Business Management. Continue enabling IT business advancement by organizing processes and transforming data around financial planning and accountability, transparent service-based costing, and financial business intelligence to make informed decisions for our providers and our partners. \n \nIT Financial Showback and Chargeback - understanding, dissecting, and interpreting service-based costs and their allocations to partners to be a valued provider. \n Software Engineer, Business Applications Intermountain Healthcare May 2014  –  May 2015  (1 year 1 month) Greater Salt Lake City Area Project Lead for a re-implementation of Hyperion Planning and Budgeting \nHyperion/Essbase Technical Lead, performance tuning \nOracle Data Integrator, interfacing multiple finance systems data Database Engineer, Enterprise Information Management The Church of Jesus Christ of Latter-Day Saints May 2010  –  May 2014  (4 years 1 month) Greater Salt Lake City Area Development of an internal Central Planning APEX Application. \nAnalysis and modeling of complex information systems. \nWeb database application development for core systems information. \nDatabase administration: monitoring, provisioning, backups, performance Configurable Computing Teaching/Research Assistant Brigham Young University September 2007  –  April 2010  (2 years 8 months) Developed standards to represent hardware cores for implementation in FPGA-based systems. \nCreated test platforms for bitstream sensitivity analysis and security. \nTaught lab overviews, VHDL design, and microblaze processor. \nAssisted students on lab work with Computer I/O, C-Programming, digital design. Sales Representative Pinnacle Security April 2008  –  August 2008  (5 months) Circulated among potential customers to sell security systems and services. \nMaintained records of accounts and orders. Summer Intern Cox Communications April 2003  –  August 2003  (5 months) Assisted in buildout of network infrastructure, servers and computer systems. \nCompiled and analyzed performance data for presentation to upper management. Cost Management Solutions Manager, Office of the CIO The Church of Jesus Christ of Latter-day Saints May 2015  – Present (4 months) Greater Salt Lake City Area IT Financial Management Systems - Planning, Budgeting, Costing, Technology Business Management. Continue enabling IT business advancement by organizing processes and transforming data around financial planning and accountability, transparent service-based costing, and financial business intelligence to make informed decisions for our providers and our partners. \n \nIT Financial Showback and Chargeback - understanding, dissecting, and interpreting service-based costs and their allocations to partners to be a valued provider. \n Cost Management Solutions Manager, Office of the CIO The Church of Jesus Christ of Latter-day Saints May 2015  – Present (4 months) Greater Salt Lake City Area IT Financial Management Systems - Planning, Budgeting, Costing, Technology Business Management. Continue enabling IT business advancement by organizing processes and transforming data around financial planning and accountability, transparent service-based costing, and financial business intelligence to make informed decisions for our providers and our partners. \n \nIT Financial Showback and Chargeback - understanding, dissecting, and interpreting service-based costs and their allocations to partners to be a valued provider. \n Software Engineer, Business Applications Intermountain Healthcare May 2014  –  May 2015  (1 year 1 month) Greater Salt Lake City Area Project Lead for a re-implementation of Hyperion Planning and Budgeting \nHyperion/Essbase Technical Lead, performance tuning \nOracle Data Integrator, interfacing multiple finance systems data Software Engineer, Business Applications Intermountain Healthcare May 2014  –  May 2015  (1 year 1 month) Greater Salt Lake City Area Project Lead for a re-implementation of Hyperion Planning and Budgeting \nHyperion/Essbase Technical Lead, performance tuning \nOracle Data Integrator, interfacing multiple finance systems data Database Engineer, Enterprise Information Management The Church of Jesus Christ of Latter-Day Saints May 2010  –  May 2014  (4 years 1 month) Greater Salt Lake City Area Development of an internal Central Planning APEX Application. \nAnalysis and modeling of complex information systems. \nWeb database application development for core systems information. \nDatabase administration: monitoring, provisioning, backups, performance Database Engineer, Enterprise Information Management The Church of Jesus Christ of Latter-Day Saints May 2010  –  May 2014  (4 years 1 month) Greater Salt Lake City Area Development of an internal Central Planning APEX Application. \nAnalysis and modeling of complex information systems. \nWeb database application development for core systems information. \nDatabase administration: monitoring, provisioning, backups, performance Configurable Computing Teaching/Research Assistant Brigham Young University September 2007  –  April 2010  (2 years 8 months) Developed standards to represent hardware cores for implementation in FPGA-based systems. \nCreated test platforms for bitstream sensitivity analysis and security. \nTaught lab overviews, VHDL design, and microblaze processor. \nAssisted students on lab work with Computer I/O, C-Programming, digital design. Configurable Computing Teaching/Research Assistant Brigham Young University September 2007  –  April 2010  (2 years 8 months) Developed standards to represent hardware cores for implementation in FPGA-based systems. \nCreated test platforms for bitstream sensitivity analysis and security. \nTaught lab overviews, VHDL design, and microblaze processor. \nAssisted students on lab work with Computer I/O, C-Programming, digital design. Sales Representative Pinnacle Security April 2008  –  August 2008  (5 months) Circulated among potential customers to sell security systems and services. \nMaintained records of accounts and orders. Sales Representative Pinnacle Security April 2008  –  August 2008  (5 months) Circulated among potential customers to sell security systems and services. \nMaintained records of accounts and orders. Summer Intern Cox Communications April 2003  –  August 2003  (5 months) Assisted in buildout of network infrastructure, servers and computer systems. \nCompiled and analyzed performance data for presentation to upper management. Summer Intern Cox Communications April 2003  –  August 2003  (5 months) Assisted in buildout of network infrastructure, servers and computer systems. \nCompiled and analyzed performance data for presentation to upper management. Skills Business Intelligence Databases Database Administration Data Warehousing Database Design SQL Integration Oracle RAC Oracle Application... Linux Data Analysis Servers Visio Oracle PL/SQL ETL Data Modeling Software Development Security Agile Methodologies Web Application Design Analysis Shell Scripting JavaScript Interpersonal Skill Unix MySQL See 12+     See less Skills  Business Intelligence Databases Database Administration Data Warehousing Database Design SQL Integration Oracle RAC Oracle Application... Linux Data Analysis Servers Visio Oracle PL/SQL ETL Data Modeling Software Development Security Agile Methodologies Web Application Design Analysis Shell Scripting JavaScript Interpersonal Skill Unix MySQL See 12+     See less Business Intelligence Databases Database Administration Data Warehousing Database Design SQL Integration Oracle RAC Oracle Application... Linux Data Analysis Servers Visio Oracle PL/SQL ETL Data Modeling Software Development Security Agile Methodologies Web Application Design Analysis Shell Scripting JavaScript Interpersonal Skill Unix MySQL See 12+     See less Business Intelligence Databases Database Administration Data Warehousing Database Design SQL Integration Oracle RAC Oracle Application... Linux Data Analysis Servers Visio Oracle PL/SQL ETL Data Modeling Software Development Security Agile Methodologies Web Application Design Analysis Shell Scripting JavaScript Interpersonal Skill Unix MySQL See 12+     See less Education University of Utah - David Eccles School of Business Masters of Science in Information Systems,  Data Warehousing , Web-Based Systems 2011  – 2012 GPA: 4.0 Brigham Young University Computer Engineering,  Reconfigurable Hardware, FPGAs 2007  – 2010 GPA: 3.9 The University of Tennessee at Chattanooga 2003  – 2004 University of Utah - David Eccles School of Business Masters of Science in Information Systems,  Data Warehousing , Web-Based Systems 2011  – 2012 GPA: 4.0 University of Utah - David Eccles School of Business Masters of Science in Information Systems,  Data Warehousing , Web-Based Systems 2011  – 2012 GPA: 4.0 University of Utah - David Eccles School of Business Masters of Science in Information Systems,  Data Warehousing , Web-Based Systems 2011  – 2012 GPA: 4.0 Brigham Young University Computer Engineering,  Reconfigurable Hardware, FPGAs 2007  – 2010 GPA: 3.9 Brigham Young University Computer Engineering,  Reconfigurable Hardware, FPGAs 2007  – 2010 GPA: 3.9 Brigham Young University Computer Engineering,  Reconfigurable Hardware, FPGAs 2007  – 2010 GPA: 3.9 The University of Tennessee at Chattanooga 2003  – 2004 The University of Tennessee at Chattanooga 2003  – 2004 The University of Tennessee at Chattanooga 2003  – 2004 ", "Summary Over five years of experience in Information Technology with extensive experience in software development, project management, system integration, in depth knowledge various enterprise software solution. \n• Have expert level knowledge in ASP.NET, C#.NET, ASP.NET with AJAX technology, MVC , Entity Framework, Web API, Linq, Team Foundation Server, VB.NET and SQL, . \n• Worked as System Analysis, Project Leader, Team Leader, Programmer with requirement specification, design and analysis experiences; possess strong leadership, analytical and relational skills. \n• Worked as a Senior Software Engineer for Business Applications and Web Applications with strong programming. I have also a strong understanding of programming fundamentals and Object-Oriented Programming (OOP). \n• Strongly interested in Developing Programs which interact with machines and messaging formats, Development Standards, Project Frameworks and Developing Business Components. \n• Have working knowledge in Software Development Life Cycle (SDLC), such as Requirements Gathering and Analysis, Design, Implementation, Testing and Maintenance, Three-tier Architecture, and Business Application Processes. \n• Successfully managed the projects of ACE Data Systems Co., Ltd as Project Leader, Team Leader, Developer, System Analysts. Summary Over five years of experience in Information Technology with extensive experience in software development, project management, system integration, in depth knowledge various enterprise software solution. \n• Have expert level knowledge in ASP.NET, C#.NET, ASP.NET with AJAX technology, MVC , Entity Framework, Web API, Linq, Team Foundation Server, VB.NET and SQL, . \n• Worked as System Analysis, Project Leader, Team Leader, Programmer with requirement specification, design and analysis experiences; possess strong leadership, analytical and relational skills. \n• Worked as a Senior Software Engineer for Business Applications and Web Applications with strong programming. I have also a strong understanding of programming fundamentals and Object-Oriented Programming (OOP). \n• Strongly interested in Developing Programs which interact with machines and messaging formats, Development Standards, Project Frameworks and Developing Business Components. \n• Have working knowledge in Software Development Life Cycle (SDLC), such as Requirements Gathering and Analysis, Design, Implementation, Testing and Maintenance, Three-tier Architecture, and Business Application Processes. \n• Successfully managed the projects of ACE Data Systems Co., Ltd as Project Leader, Team Leader, Developer, System Analysts. Over five years of experience in Information Technology with extensive experience in software development, project management, system integration, in depth knowledge various enterprise software solution. \n• Have expert level knowledge in ASP.NET, C#.NET, ASP.NET with AJAX technology, MVC , Entity Framework, Web API, Linq, Team Foundation Server, VB.NET and SQL, . \n• Worked as System Analysis, Project Leader, Team Leader, Programmer with requirement specification, design and analysis experiences; possess strong leadership, analytical and relational skills. \n• Worked as a Senior Software Engineer for Business Applications and Web Applications with strong programming. I have also a strong understanding of programming fundamentals and Object-Oriented Programming (OOP). \n• Strongly interested in Developing Programs which interact with machines and messaging formats, Development Standards, Project Frameworks and Developing Business Components. \n• Have working knowledge in Software Development Life Cycle (SDLC), such as Requirements Gathering and Analysis, Design, Implementation, Testing and Maintenance, Three-tier Architecture, and Business Application Processes. \n• Successfully managed the projects of ACE Data Systems Co., Ltd as Project Leader, Team Leader, Developer, System Analysts. Over five years of experience in Information Technology with extensive experience in software development, project management, system integration, in depth knowledge various enterprise software solution. \n• Have expert level knowledge in ASP.NET, C#.NET, ASP.NET with AJAX technology, MVC , Entity Framework, Web API, Linq, Team Foundation Server, VB.NET and SQL, . \n• Worked as System Analysis, Project Leader, Team Leader, Programmer with requirement specification, design and analysis experiences; possess strong leadership, analytical and relational skills. \n• Worked as a Senior Software Engineer for Business Applications and Web Applications with strong programming. I have also a strong understanding of programming fundamentals and Object-Oriented Programming (OOP). \n• Strongly interested in Developing Programs which interact with machines and messaging formats, Development Standards, Project Frameworks and Developing Business Components. \n• Have working knowledge in Software Development Life Cycle (SDLC), such as Requirements Gathering and Analysis, Design, Implementation, Testing and Maintenance, Three-tier Architecture, and Business Application Processes. \n• Successfully managed the projects of ACE Data Systems Co., Ltd as Project Leader, Team Leader, Developer, System Analysts. Experience Senior Web Developer Phillip Securities Pte Ltd April 2014  – Present (1 year 5 months) Singapore Key Responsibilities: \n•\tInteract with Business Analysts, study requirements and resolve issues/bugs \n•\tEnhance the existing features and implement the new requirements.  \n•\tDevelopment in ASP.Net, C#.net, MVC, Web API and MS SQL Server version 2005/2008 R2 with Reporting Service \n Senior Software Engineer, System Analyst, Team Leader, Project Leader ACE Data Systems Co. Ltd July 2009  –  January 2014  (4 years 7 months) Myanmar From 2009-2010 - Junior Software Developer \nFrom 2010-2011 - Senior Software Developer ,System Analyst \nFrom 2011-2012 - Development Team Leader \nFrom 2013-2014 - Project Leader Senior Web Developer Phillip Securities Pte Ltd April 2014  – Present (1 year 5 months) Singapore Key Responsibilities: \n•\tInteract with Business Analysts, study requirements and resolve issues/bugs \n•\tEnhance the existing features and implement the new requirements.  \n•\tDevelopment in ASP.Net, C#.net, MVC, Web API and MS SQL Server version 2005/2008 R2 with Reporting Service \n Senior Web Developer Phillip Securities Pte Ltd April 2014  – Present (1 year 5 months) Singapore Key Responsibilities: \n•\tInteract with Business Analysts, study requirements and resolve issues/bugs \n•\tEnhance the existing features and implement the new requirements.  \n•\tDevelopment in ASP.Net, C#.net, MVC, Web API and MS SQL Server version 2005/2008 R2 with Reporting Service \n Senior Software Engineer, System Analyst, Team Leader, Project Leader ACE Data Systems Co. Ltd July 2009  –  January 2014  (4 years 7 months) Myanmar From 2009-2010 - Junior Software Developer \nFrom 2010-2011 - Senior Software Developer ,System Analyst \nFrom 2011-2012 - Development Team Leader \nFrom 2013-2014 - Project Leader Senior Software Engineer, System Analyst, Team Leader, Project Leader ACE Data Systems Co. Ltd July 2009  –  January 2014  (4 years 7 months) Myanmar From 2009-2010 - Junior Software Developer \nFrom 2010-2011 - Senior Software Developer ,System Analyst \nFrom 2011-2012 - Development Team Leader \nFrom 2013-2014 - Project Leader Languages   Skills ASP.NET C# AJAX HTML Microsoft SQL Server Software Project... Java JavaScript VB.NET Web Applications Microsoft Office SDLC Windows Linux CSS .NET XML Visual Basic OOP LINQ Integration Entity Framework Testing ASP.NET MVC ASP.NET Web API See 10+     See less Skills  ASP.NET C# AJAX HTML Microsoft SQL Server Software Project... Java JavaScript VB.NET Web Applications Microsoft Office SDLC Windows Linux CSS .NET XML Visual Basic OOP LINQ Integration Entity Framework Testing ASP.NET MVC ASP.NET Web API See 10+     See less ASP.NET C# AJAX HTML Microsoft SQL Server Software Project... Java JavaScript VB.NET Web Applications Microsoft Office SDLC Windows Linux CSS .NET XML Visual Basic OOP LINQ Integration Entity Framework Testing ASP.NET MVC ASP.NET Web API See 10+     See less ASP.NET C# AJAX HTML Microsoft SQL Server Software Project... Java JavaScript VB.NET Web Applications Microsoft Office SDLC Windows Linux CSS .NET XML Visual Basic OOP LINQ Integration Entity Framework Testing ASP.NET MVC ASP.NET Web API See 10+     See less Education University of Distance Education, Yangon, Myanmar Bachelor of Arts (B.A.),  English Language and Literature/Letters , 1 2011  – 2013 University of Distance Education, Yangon, Myanmar Bachelor of Arts (B.A.),  English Language and Literature/Letters , 1 2011  – 2013 University of Distance Education, Yangon, Myanmar Bachelor of Arts (B.A.),  English Language and Literature/Letters , 1 2011  – 2013 University of Distance Education, Yangon, Myanmar Bachelor of Arts (B.A.),  English Language and Literature/Letters , 1 2011  – 2013 Honors & Awards ", "Experience Principal Software Engineer (Business Applications) Netflix Inc. May 2011  – Present (4 years 4 months) Los Gatos, California, USA Areas of Expertise: \nWorkday Financials Applications. \nOracle Applications. \nCustom Cloud Applications using Ruby on Rails and ember.js Senior Software Engineer (Oracle Applications) Netflix Inc. April 2003  –  May 2011  (8 years 2 months) Senior Oracle Applications Consultant Cisco November 2002  –  April 2003  (6 months) Senior Oracle Applications Consultant Xilinx July 2002  –  October 2002  (4 months) Senior Oracle Applications Consultant Neopost June 1998  –  December 2001  (3 years 7 months) Employer: Alphasoft Corporation Oracle Applications Consultant Cisco September 1997  –  May 1998  (9 months) Employer: Alphasoft Corporation Scientist / Engineer CRIDA November 1992  –  August 1997  (4 years 10 months) Principal Software Engineer (Business Applications) Netflix Inc. May 2011  – Present (4 years 4 months) Los Gatos, California, USA Areas of Expertise: \nWorkday Financials Applications. \nOracle Applications. \nCustom Cloud Applications using Ruby on Rails and ember.js Principal Software Engineer (Business Applications) Netflix Inc. May 2011  – Present (4 years 4 months) Los Gatos, California, USA Areas of Expertise: \nWorkday Financials Applications. \nOracle Applications. \nCustom Cloud Applications using Ruby on Rails and ember.js Senior Software Engineer (Oracle Applications) Netflix Inc. April 2003  –  May 2011  (8 years 2 months) Senior Software Engineer (Oracle Applications) Netflix Inc. April 2003  –  May 2011  (8 years 2 months) Senior Oracle Applications Consultant Cisco November 2002  –  April 2003  (6 months) Senior Oracle Applications Consultant Cisco November 2002  –  April 2003  (6 months) Senior Oracle Applications Consultant Xilinx July 2002  –  October 2002  (4 months) Senior Oracle Applications Consultant Xilinx July 2002  –  October 2002  (4 months) Senior Oracle Applications Consultant Neopost June 1998  –  December 2001  (3 years 7 months) Employer: Alphasoft Corporation Senior Oracle Applications Consultant Neopost June 1998  –  December 2001  (3 years 7 months) Employer: Alphasoft Corporation Oracle Applications Consultant Cisco September 1997  –  May 1998  (9 months) Employer: Alphasoft Corporation Oracle Applications Consultant Cisco September 1997  –  May 1998  (9 months) Employer: Alphasoft Corporation Scientist / Engineer CRIDA November 1992  –  August 1997  (4 years 10 months) Scientist / Engineer CRIDA November 1992  –  August 1997  (4 years 10 months) Languages Telugu Hindi Telugu Hindi Telugu Hindi Skills Oracle OA Framework Java Oracle Applications Unix Linux SQL Procure-to-Pay Oracle E-Business Suite Perl PL/SQL Software Development Cloud Computing Integration Agile Methodologies REST Java Enterprise Edition Consulting Software Engineering Business Intelligence SOA Weblogic XML Solution Architecture Databases Shell Scripting Scrum Solaris See 13+     See less Skills  Oracle OA Framework Java Oracle Applications Unix Linux SQL Procure-to-Pay Oracle E-Business Suite Perl PL/SQL Software Development Cloud Computing Integration Agile Methodologies REST Java Enterprise Edition Consulting Software Engineering Business Intelligence SOA Weblogic XML Solution Architecture Databases Shell Scripting Scrum Solaris See 13+     See less Oracle OA Framework Java Oracle Applications Unix Linux SQL Procure-to-Pay Oracle E-Business Suite Perl PL/SQL Software Development Cloud Computing Integration Agile Methodologies REST Java Enterprise Edition Consulting Software Engineering Business Intelligence SOA Weblogic XML Solution Architecture Databases Shell Scripting Scrum Solaris See 13+     See less Oracle OA Framework Java Oracle Applications Unix Linux SQL Procure-to-Pay Oracle E-Business Suite Perl PL/SQL Software Development Cloud Computing Integration Agile Methodologies REST Java Enterprise Edition Consulting Software Engineering Business Intelligence SOA Weblogic XML Solution Architecture Databases Shell Scripting Scrum Solaris See 13+     See less Education Indian Institute of Technology, Bombay PhD (Discontinued..),  Water Resources Engineering 1990  – 1992 Discontinued the Doctorate studies after completing 3 semesters of Course / Research Work. Govind Ballabh Pant Krishi Evam Praudyogik Vishwavidyalaya Master of Technology,  Irrigation and Drainage Engineering 1987  – 1989 Acharya N.G. Ranga Agricultural University Bachelor of Technology,  Agricultural Engineering Formerly known as Andhra Pradesh Agricultural University (APAU) Indian Institute of Technology, Bombay PhD (Discontinued..),  Water Resources Engineering 1990  – 1992 Discontinued the Doctorate studies after completing 3 semesters of Course / Research Work. Indian Institute of Technology, Bombay PhD (Discontinued..),  Water Resources Engineering 1990  – 1992 Discontinued the Doctorate studies after completing 3 semesters of Course / Research Work. Indian Institute of Technology, Bombay PhD (Discontinued..),  Water Resources Engineering 1990  – 1992 Discontinued the Doctorate studies after completing 3 semesters of Course / Research Work. Govind Ballabh Pant Krishi Evam Praudyogik Vishwavidyalaya Master of Technology,  Irrigation and Drainage Engineering 1987  – 1989 Govind Ballabh Pant Krishi Evam Praudyogik Vishwavidyalaya Master of Technology,  Irrigation and Drainage Engineering 1987  – 1989 Govind Ballabh Pant Krishi Evam Praudyogik Vishwavidyalaya Master of Technology,  Irrigation and Drainage Engineering 1987  – 1989 Acharya N.G. Ranga Agricultural University Bachelor of Technology,  Agricultural Engineering Formerly known as Andhra Pradesh Agricultural University (APAU) Acharya N.G. Ranga Agricultural University Bachelor of Technology,  Agricultural Engineering Formerly known as Andhra Pradesh Agricultural University (APAU) Acharya N.G. Ranga Agricultural University Bachelor of Technology,  Agricultural Engineering Formerly known as Andhra Pradesh Agricultural University (APAU) "]}