{"position": "Software Engineer II Intern - Monthly", "company": "Google", "profiles": ["Experience Product Manager Google April 2011  – Present (4 years 5 months) Beijing/Mountain View Responsible for Southeast Asia/APAC maps, China Maps, and Geo global operation in emerging markets. Vice General Manager Guxiang-Google China Joint Venture Company October 2011  – Present (3 years 11 months) Beijing Set up and manage the engineering team in Guxiang. Technical Program Manager Google August 2009  –  April 2011  (1 year 9 months) Google Maps local data quality. \nGoogle China Maps. Associate Product Manager Google February 2009  –  August 2009  (7 months) Software Engineer Google July 2007  –  February 2009  (1 year 8 months) Software Engineer@Google Maps. \"My Maps\" feature Software Engineer Intern Electronic Arts May 2006  –  August 2006  (4 months) Participated in developing the game \"MySims\" (Sims on Wii) Product Manager Google April 2011  – Present (4 years 5 months) Beijing/Mountain View Responsible for Southeast Asia/APAC maps, China Maps, and Geo global operation in emerging markets. Product Manager Google April 2011  – Present (4 years 5 months) Beijing/Mountain View Responsible for Southeast Asia/APAC maps, China Maps, and Geo global operation in emerging markets. Vice General Manager Guxiang-Google China Joint Venture Company October 2011  – Present (3 years 11 months) Beijing Set up and manage the engineering team in Guxiang. Vice General Manager Guxiang-Google China Joint Venture Company October 2011  – Present (3 years 11 months) Beijing Set up and manage the engineering team in Guxiang. Technical Program Manager Google August 2009  –  April 2011  (1 year 9 months) Google Maps local data quality. \nGoogle China Maps. Technical Program Manager Google August 2009  –  April 2011  (1 year 9 months) Google Maps local data quality. \nGoogle China Maps. Associate Product Manager Google February 2009  –  August 2009  (7 months) Associate Product Manager Google February 2009  –  August 2009  (7 months) Software Engineer Google July 2007  –  February 2009  (1 year 8 months) Software Engineer@Google Maps. \"My Maps\" feature Software Engineer Google July 2007  –  February 2009  (1 year 8 months) Software Engineer@Google Maps. \"My Maps\" feature Software Engineer Intern Electronic Arts May 2006  –  August 2006  (4 months) Participated in developing the game \"MySims\" (Sims on Wii) Software Engineer Intern Electronic Arts May 2006  –  August 2006  (4 months) Participated in developing the game \"MySims\" (Sims on Wii) Skills Mobile Applications Distributed Systems Google Maps Java JavaScript MySQL Cloud Computing Product Management Scalability Software Engineering Algorithms Python Software Development Machine Learning Agile Methodologies Web Applications Hadoop Android Linux Software Design See 5+     See less Skills  Mobile Applications Distributed Systems Google Maps Java JavaScript MySQL Cloud Computing Product Management Scalability Software Engineering Algorithms Python Software Development Machine Learning Agile Methodologies Web Applications Hadoop Android Linux Software Design See 5+     See less Mobile Applications Distributed Systems Google Maps Java JavaScript MySQL Cloud Computing Product Management Scalability Software Engineering Algorithms Python Software Development Machine Learning Agile Methodologies Web Applications Hadoop Android Linux Software Design See 5+     See less Mobile Applications Distributed Systems Google Maps Java JavaScript MySQL Cloud Computing Product Management Scalability Software Engineering Algorithms Python Software Development Machine Learning Agile Methodologies Web Applications Hadoop Android Linux Software Design See 5+     See less Education Zhejiang University BE,  Computer Science 2001  – 2005 Georgia Institute of Technology MS,  Computer Science Zhejiang University BE,  Computer Science 2001  – 2005 Zhejiang University BE,  Computer Science 2001  – 2005 Zhejiang University BE,  Computer Science 2001  – 2005 Georgia Institute of Technology MS,  Computer Science Georgia Institute of Technology MS,  Computer Science Georgia Institute of Technology MS,  Computer Science ", "Experience Software Engineer Intern Google August 2015  – Present (1 month) Zürich, Switzerland Software Engineer Intern Google August 2015  – Present (1 month) Zürich, Switzerland Software Engineer Intern Google August 2015  – Present (1 month) Zürich, Switzerland Languages   Skills Skills     Honors & Awards HackFMI - Hackathon organized in Sofia University Sofia University October 2013 Second place, topic of the hackathon - Hack for Education ACM ICPC South Eastern European Regional Contest October 2013 Honorable mention, Third place on the Bucharest site ACM BCPC – Bulgarian Collegiate Programming Contest May 2013 First place HackFMI - Hackathon organized in Sofia University Sofia University April 2013 First place, topic of the hackaton - Hack for FMI \n ACM ICPC South Eastern European Regional Contest October 2012 Honorable mention \n Bubble Cup 2012 Microsoft Development Center Serbia September 2012 Fourth place \n ACM BCPC – Bulgarian Collegiate Programming Contest May 2012 First place Sofia University Annual Programming Tournament Sofia University December 2011 Fourth place ACM ICPC South Eastern European Regional Contest October 2011 Honorable mention \n Bulgarian Olympiad in Informatics May 2011 Sixth place, group A – Laureate, placed in the extended \nnational team \n HackFMI - Hackathon organized in Sofia University Sofia University October 2013 Second place, topic of the hackathon - Hack for Education HackFMI - Hackathon organized in Sofia University Sofia University October 2013 Second place, topic of the hackathon - Hack for Education HackFMI - Hackathon organized in Sofia University Sofia University October 2013 Second place, topic of the hackathon - Hack for Education ACM ICPC South Eastern European Regional Contest October 2013 Honorable mention, Third place on the Bucharest site ACM ICPC South Eastern European Regional Contest October 2013 Honorable mention, Third place on the Bucharest site ACM ICPC South Eastern European Regional Contest October 2013 Honorable mention, Third place on the Bucharest site ACM BCPC – Bulgarian Collegiate Programming Contest May 2013 First place ACM BCPC – Bulgarian Collegiate Programming Contest May 2013 First place ACM BCPC – Bulgarian Collegiate Programming Contest May 2013 First place HackFMI - Hackathon organized in Sofia University Sofia University April 2013 First place, topic of the hackaton - Hack for FMI \n HackFMI - Hackathon organized in Sofia University Sofia University April 2013 First place, topic of the hackaton - Hack for FMI \n HackFMI - Hackathon organized in Sofia University Sofia University April 2013 First place, topic of the hackaton - Hack for FMI \n ACM ICPC South Eastern European Regional Contest October 2012 Honorable mention \n ACM ICPC South Eastern European Regional Contest October 2012 Honorable mention \n ACM ICPC South Eastern European Regional Contest October 2012 Honorable mention \n Bubble Cup 2012 Microsoft Development Center Serbia September 2012 Fourth place \n Bubble Cup 2012 Microsoft Development Center Serbia September 2012 Fourth place \n Bubble Cup 2012 Microsoft Development Center Serbia September 2012 Fourth place \n ACM BCPC – Bulgarian Collegiate Programming Contest May 2012 First place ACM BCPC – Bulgarian Collegiate Programming Contest May 2012 First place ACM BCPC – Bulgarian Collegiate Programming Contest May 2012 First place Sofia University Annual Programming Tournament Sofia University December 2011 Fourth place Sofia University Annual Programming Tournament Sofia University December 2011 Fourth place Sofia University Annual Programming Tournament Sofia University December 2011 Fourth place ACM ICPC South Eastern European Regional Contest October 2011 Honorable mention \n ACM ICPC South Eastern European Regional Contest October 2011 Honorable mention \n ACM ICPC South Eastern European Regional Contest October 2011 Honorable mention \n Bulgarian Olympiad in Informatics May 2011 Sixth place, group A – Laureate, placed in the extended \nnational team \n Bulgarian Olympiad in Informatics May 2011 Sixth place, group A – Laureate, placed in the extended \nnational team \n Bulgarian Olympiad in Informatics May 2011 Sixth place, group A – Laureate, placed in the extended \nnational team \n ", "Summary Strong operational leader. Expertise in technical support, outsourcing, supplier management, project management, process and workflow improvements. Summary Strong operational leader. Expertise in technical support, outsourcing, supplier management, project management, process and workflow improvements. Strong operational leader. Expertise in technical support, outsourcing, supplier management, project management, process and workflow improvements. Strong operational leader. Expertise in technical support, outsourcing, supplier management, project management, process and workflow improvements. Experience Program Manager Google January 2015  – Present (8 months) Dublin - Responsible for project managing in the vendors strategy team driving efficiency gains across our Support ecosystem - specifically processes, workflows and organisational changes impacting ~1200 agents. \n- Driving process excellence by auditing support workflows and analyzing data. EMEA Vendor Lead, Google for Work Google January 2014  –  December 2014  (1 year) Dublin Leading Google for Work EMEA support sites in providing outstanding technical support for Google Apps. \nDaily activities: \n- Setting quarterly targets and leading 3 different teams into achieving the OKRs. \n- Launching and ramping up new support sites \n- Leading new projects to improve support operations  \n- Managing daily operations at vendor sites, improving the core performance in terms of CSAT and productivity. \n Technical Support Specialist, Google for Work Google February 2013  –  October 2013  (9 months) Dublin, Ireland - Responsible for quality assurance programme for new hires and remote vendors.  \n- Responsible for the training programme for new hires and remote vendors. \n- Google Apps Admin console Product specialist, responsible for identifying and escalating bug reports with Product Management and engineering. \n- Delivering exceptional technical support to Google Apps customers in English. Software Engineer Intern Google October 2012  –  January 2013  (4 months) Mountain View, California, USA Software Engineer Intern Siemens Corp. Research January 2012  –  June 2012  (6 months) Princeton, NJ, USA Research and development of medical applications for Android Tablet; Implementing  \nscanner image 3D visualization and control of an MRI Scanner with the tablet. Software Engineer Intern Exane May 2011  –  August 2011  (4 months) Paris, France Collaboration with Software Engineer System Analysts and Business Analysts \nto capture customer’s needs in financial software area; detailed specifications; \nImplemented required functionalities in C++; delivered the project;  \nTested and analyzed the performances on different OS (Windows and Linux) Software Engineer Intern Schlumberger June 2010  –  August 2010  (3 months) Abingdon, UK Research project in Genetic Algorithm and communication between C# and \nMATLAB for oil industry; implemented Genetic Algorithms in MATLAB and C#; \nIntegrated new algorithms in Petrel software. Program Manager Google January 2015  – Present (8 months) Dublin - Responsible for project managing in the vendors strategy team driving efficiency gains across our Support ecosystem - specifically processes, workflows and organisational changes impacting ~1200 agents. \n- Driving process excellence by auditing support workflows and analyzing data. Program Manager Google January 2015  – Present (8 months) Dublin - Responsible for project managing in the vendors strategy team driving efficiency gains across our Support ecosystem - specifically processes, workflows and organisational changes impacting ~1200 agents. \n- Driving process excellence by auditing support workflows and analyzing data. EMEA Vendor Lead, Google for Work Google January 2014  –  December 2014  (1 year) Dublin Leading Google for Work EMEA support sites in providing outstanding technical support for Google Apps. \nDaily activities: \n- Setting quarterly targets and leading 3 different teams into achieving the OKRs. \n- Launching and ramping up new support sites \n- Leading new projects to improve support operations  \n- Managing daily operations at vendor sites, improving the core performance in terms of CSAT and productivity. \n EMEA Vendor Lead, Google for Work Google January 2014  –  December 2014  (1 year) Dublin Leading Google for Work EMEA support sites in providing outstanding technical support for Google Apps. \nDaily activities: \n- Setting quarterly targets and leading 3 different teams into achieving the OKRs. \n- Launching and ramping up new support sites \n- Leading new projects to improve support operations  \n- Managing daily operations at vendor sites, improving the core performance in terms of CSAT and productivity. \n Technical Support Specialist, Google for Work Google February 2013  –  October 2013  (9 months) Dublin, Ireland - Responsible for quality assurance programme for new hires and remote vendors.  \n- Responsible for the training programme for new hires and remote vendors. \n- Google Apps Admin console Product specialist, responsible for identifying and escalating bug reports with Product Management and engineering. \n- Delivering exceptional technical support to Google Apps customers in English. Technical Support Specialist, Google for Work Google February 2013  –  October 2013  (9 months) Dublin, Ireland - Responsible for quality assurance programme for new hires and remote vendors.  \n- Responsible for the training programme for new hires and remote vendors. \n- Google Apps Admin console Product specialist, responsible for identifying and escalating bug reports with Product Management and engineering. \n- Delivering exceptional technical support to Google Apps customers in English. Software Engineer Intern Google October 2012  –  January 2013  (4 months) Mountain View, California, USA Software Engineer Intern Google October 2012  –  January 2013  (4 months) Mountain View, California, USA Software Engineer Intern Siemens Corp. Research January 2012  –  June 2012  (6 months) Princeton, NJ, USA Research and development of medical applications for Android Tablet; Implementing  \nscanner image 3D visualization and control of an MRI Scanner with the tablet. Software Engineer Intern Siemens Corp. Research January 2012  –  June 2012  (6 months) Princeton, NJ, USA Research and development of medical applications for Android Tablet; Implementing  \nscanner image 3D visualization and control of an MRI Scanner with the tablet. Software Engineer Intern Exane May 2011  –  August 2011  (4 months) Paris, France Collaboration with Software Engineer System Analysts and Business Analysts \nto capture customer’s needs in financial software area; detailed specifications; \nImplemented required functionalities in C++; delivered the project;  \nTested and analyzed the performances on different OS (Windows and Linux) Software Engineer Intern Exane May 2011  –  August 2011  (4 months) Paris, France Collaboration with Software Engineer System Analysts and Business Analysts \nto capture customer’s needs in financial software area; detailed specifications; \nImplemented required functionalities in C++; delivered the project;  \nTested and analyzed the performances on different OS (Windows and Linux) Software Engineer Intern Schlumberger June 2010  –  August 2010  (3 months) Abingdon, UK Research project in Genetic Algorithm and communication between C# and \nMATLAB for oil industry; implemented Genetic Algorithms in MATLAB and C#; \nIntegrated new algorithms in Petrel software. Software Engineer Intern Schlumberger June 2010  –  August 2010  (3 months) Abingdon, UK Research project in Genetic Algorithm and communication between C# and \nMATLAB for oil industry; implemented Genetic Algorithms in MATLAB and C#; \nIntegrated new algorithms in Petrel software. Languages English Full professional proficiency French Full professional proficiency Romanian Native or bilingual proficiency Italian Professional working proficiency English Full professional proficiency French Full professional proficiency Romanian Native or bilingual proficiency Italian Professional working proficiency English Full professional proficiency French Full professional proficiency Romanian Native or bilingual proficiency Italian Professional working proficiency Full professional proficiency Full professional proficiency Native or bilingual proficiency Professional working proficiency Skills C C++ C# Java Android Framework Python Perl CSS XML XSLT Matlab Prolog Scheme SQL UML / USDP UML Eclipse Production Managment Android Development Algorithms Android Technical Support Soft Skills Customer Service Project Management Google Apps See 11+     See less Skills  C C++ C# Java Android Framework Python Perl CSS XML XSLT Matlab Prolog Scheme SQL UML / USDP UML Eclipse Production Managment Android Development Algorithms Android Technical Support Soft Skills Customer Service Project Management Google Apps See 11+     See less C C++ C# Java Android Framework Python Perl CSS XML XSLT Matlab Prolog Scheme SQL UML / USDP UML Eclipse Production Managment Android Development Algorithms Android Technical Support Soft Skills Customer Service Project Management Google Apps See 11+     See less C C++ C# Java Android Framework Python Perl CSS XML XSLT Matlab Prolog Scheme SQL UML / USDP UML Eclipse Production Managment Android Development Algorithms Android Technical Support Soft Skills Customer Service Project Management Google Apps See 11+     See less Education INSA Lyon, France Engineer's degree,  Computer Science (Graduated with Honours) , A 2007  – 2012 Computer Science Engineering Activities and Societies:  BEST - Board of European Students of Technology Saint Edward's University, Texas, USA exchange year,  CS , 4.0 2011  – 2012 Computer Science Engineering Politecnico di Torino Bachelor's degree,  Computer Science , A 2008  – 2009 Double Degree Program Activities and Societies:  BEST Foundations of Business Strategy Online class on coursera.org 2014  – 2014 - Explore the underlying theory and frameworks that provide the foundations of a successful business strategy. \n- Develop the ability to think strategically and using the tools for conducting a strategic analysis. Social Psychology Online class on coursera.org 2014  – 2014 Introduction to classic and contemporary social psychology, covering topics such as decision making, persuasion, group behavior, personal attraction, and factors that promote health and well-being. \nThe course answers questions about human behavior like 'What leads us to like one person and dislike another?', 'How do conflicts and prejudices develop, and how can they be reduced?', 'Can psychological research help protect the environment, and if so, how?'. INSA Lyon, France Engineer's degree,  Computer Science (Graduated with Honours) , A 2007  – 2012 Computer Science Engineering Activities and Societies:  BEST - Board of European Students of Technology INSA Lyon, France Engineer's degree,  Computer Science (Graduated with Honours) , A 2007  – 2012 Computer Science Engineering Activities and Societies:  BEST - Board of European Students of Technology INSA Lyon, France Engineer's degree,  Computer Science (Graduated with Honours) , A 2007  – 2012 Computer Science Engineering Activities and Societies:  BEST - Board of European Students of Technology Saint Edward's University, Texas, USA exchange year,  CS , 4.0 2011  – 2012 Computer Science Engineering Saint Edward's University, Texas, USA exchange year,  CS , 4.0 2011  – 2012 Computer Science Engineering Saint Edward's University, Texas, USA exchange year,  CS , 4.0 2011  – 2012 Computer Science Engineering Politecnico di Torino Bachelor's degree,  Computer Science , A 2008  – 2009 Double Degree Program Activities and Societies:  BEST Politecnico di Torino Bachelor's degree,  Computer Science , A 2008  – 2009 Double Degree Program Activities and Societies:  BEST Politecnico di Torino Bachelor's degree,  Computer Science , A 2008  – 2009 Double Degree Program Activities and Societies:  BEST Foundations of Business Strategy Online class on coursera.org 2014  – 2014 - Explore the underlying theory and frameworks that provide the foundations of a successful business strategy. \n- Develop the ability to think strategically and using the tools for conducting a strategic analysis. Foundations of Business Strategy Online class on coursera.org 2014  – 2014 - Explore the underlying theory and frameworks that provide the foundations of a successful business strategy. \n- Develop the ability to think strategically and using the tools for conducting a strategic analysis. Foundations of Business Strategy Online class on coursera.org 2014  – 2014 - Explore the underlying theory and frameworks that provide the foundations of a successful business strategy. \n- Develop the ability to think strategically and using the tools for conducting a strategic analysis. Social Psychology Online class on coursera.org 2014  – 2014 Introduction to classic and contemporary social psychology, covering topics such as decision making, persuasion, group behavior, personal attraction, and factors that promote health and well-being. \nThe course answers questions about human behavior like 'What leads us to like one person and dislike another?', 'How do conflicts and prejudices develop, and how can they be reduced?', 'Can psychological research help protect the environment, and if so, how?'. Social Psychology Online class on coursera.org 2014  – 2014 Introduction to classic and contemporary social psychology, covering topics such as decision making, persuasion, group behavior, personal attraction, and factors that promote health and well-being. \nThe course answers questions about human behavior like 'What leads us to like one person and dislike another?', 'How do conflicts and prejudices develop, and how can they be reduced?', 'Can psychological research help protect the environment, and if so, how?'. Social Psychology Online class on coursera.org 2014  – 2014 Introduction to classic and contemporary social psychology, covering topics such as decision making, persuasion, group behavior, personal attraction, and factors that promote health and well-being. \nThe course answers questions about human behavior like 'What leads us to like one person and dislike another?', 'How do conflicts and prejudices develop, and how can they be reduced?', 'Can psychological research help protect the environment, and if so, how?'. ", "Experience Software Engineer Intern Google August 2014  – Present (1 year 1 month) Mountain View, California Working with the Google Search Team. CTO & Co-founder Azonia July 2011  – Present (4 years 2 months) Córdoba, Argentina Founder member of Azonia, a start-up that has the goal to create a B2B Marketplace and Networking site for SMEs from Latin America. Member of AIRAUP Human Resources Team Rotaract Program July 2011  – Present (4 years 2 months) Software Engineer Intern Google July 2013  –  November 2013  (5 months) Mountain View, California Worked in Google+ Team on the new Youtube commenting system. \nhttp://youtube-global.blogspot.com.ar/2013/11/youtube-new-comments.html Teacher Assistant Universidad Nacional de Córdoba - Fa.M.A.F January 2011  –  July 2013  (2 years 7 months) Córdoba, Argentina Classes: \nIntroduction to Algorithms \nAlgorithms and Data Structures I \nAlgorithms and Data Structures II \nSoftware Engineering I Software Developer TuQuejaSuma.com March 2012  –  January 2013  (11 months) Córdoba, Argentina Research Intern - Theory of Computation Lab EPFL July 2012  –  August 2012  (2 months) Lausanne Area, Switzerland Director of Communications for District 4815 Rotary International July 2009  –  June 2012  (3 years) Córdoba, Argentina Software Engineer Intern Google August 2014  – Present (1 year 1 month) Mountain View, California Working with the Google Search Team. Software Engineer Intern Google August 2014  – Present (1 year 1 month) Mountain View, California Working with the Google Search Team. CTO & Co-founder Azonia July 2011  – Present (4 years 2 months) Córdoba, Argentina Founder member of Azonia, a start-up that has the goal to create a B2B Marketplace and Networking site for SMEs from Latin America. CTO & Co-founder Azonia July 2011  – Present (4 years 2 months) Córdoba, Argentina Founder member of Azonia, a start-up that has the goal to create a B2B Marketplace and Networking site for SMEs from Latin America. Member of AIRAUP Human Resources Team Rotaract Program July 2011  – Present (4 years 2 months) Member of AIRAUP Human Resources Team Rotaract Program July 2011  – Present (4 years 2 months) Software Engineer Intern Google July 2013  –  November 2013  (5 months) Mountain View, California Worked in Google+ Team on the new Youtube commenting system. \nhttp://youtube-global.blogspot.com.ar/2013/11/youtube-new-comments.html Software Engineer Intern Google July 2013  –  November 2013  (5 months) Mountain View, California Worked in Google+ Team on the new Youtube commenting system. \nhttp://youtube-global.blogspot.com.ar/2013/11/youtube-new-comments.html Teacher Assistant Universidad Nacional de Córdoba - Fa.M.A.F January 2011  –  July 2013  (2 years 7 months) Córdoba, Argentina Classes: \nIntroduction to Algorithms \nAlgorithms and Data Structures I \nAlgorithms and Data Structures II \nSoftware Engineering I Teacher Assistant Universidad Nacional de Córdoba - Fa.M.A.F January 2011  –  July 2013  (2 years 7 months) Córdoba, Argentina Classes: \nIntroduction to Algorithms \nAlgorithms and Data Structures I \nAlgorithms and Data Structures II \nSoftware Engineering I Software Developer TuQuejaSuma.com March 2012  –  January 2013  (11 months) Córdoba, Argentina Software Developer TuQuejaSuma.com March 2012  –  January 2013  (11 months) Córdoba, Argentina Research Intern - Theory of Computation Lab EPFL July 2012  –  August 2012  (2 months) Lausanne Area, Switzerland Research Intern - Theory of Computation Lab EPFL July 2012  –  August 2012  (2 months) Lausanne Area, Switzerland Director of Communications for District 4815 Rotary International July 2009  –  June 2012  (3 years) Córdoba, Argentina Director of Communications for District 4815 Rotary International July 2009  –  June 2012  (3 years) Córdoba, Argentina Languages English English English Skills Python Linux HTML + CSS JavaScript jQuery Google Closure CSS3 Django AJAX SQL MySQL C Subversion Git Algorithms Recommender Systems Graph Theory Social Network Analysis Teamwork Team Leadership Team Building Public Speaking Strategic Planning Project Management Project Planning Lean Startup Lean Software... Lean Thinking College Teaching Software Engineering See 15+     See less Skills  Python Linux HTML + CSS JavaScript jQuery Google Closure CSS3 Django AJAX SQL MySQL C Subversion Git Algorithms Recommender Systems Graph Theory Social Network Analysis Teamwork Team Leadership Team Building Public Speaking Strategic Planning Project Management Project Planning Lean Startup Lean Software... Lean Thinking College Teaching Software Engineering See 15+     See less Python Linux HTML + CSS JavaScript jQuery Google Closure CSS3 Django AJAX SQL MySQL C Subversion Git Algorithms Recommender Systems Graph Theory Social Network Analysis Teamwork Team Leadership Team Building Public Speaking Strategic Planning Project Management Project Planning Lean Startup Lean Software... Lean Thinking College Teaching Software Engineering See 15+     See less Python Linux HTML + CSS JavaScript jQuery Google Closure CSS3 Django AJAX SQL MySQL C Subversion Git Algorithms Recommender Systems Graph Theory Social Network Analysis Teamwork Team Leadership Team Building Public Speaking Strategic Planning Project Management Project Planning Lean Startup Lean Software... Lean Thinking College Teaching Software Engineering See 15+     See less Education Universidad Nacional de Córdoba Licenciatura,  Computer Science 2009  – 2014 Universidad Nacional de Córdoba Licenciatura,  Computer Science 2009  – 2014 Universidad Nacional de Córdoba Licenciatura,  Computer Science 2009  – 2014 Universidad Nacional de Córdoba Licenciatura,  Computer Science 2009  – 2014 ", "Summary - 10+ years of industrial experience in software engineering, especially in the areas of system infrastructure, storage systems, and scalability issues. \n- Seasoned software architect who has designed and implemented several planet-scale distributed backend infrastructure systems with high performance, low latency, and strong consistency, including the Social Graph Service, Music Metadata Management Service, and Music Store Service at Google. \n- 7+ years of technical leadership experience with growing and managing mid-size engineering teams, and driving company-wide impactful initiatives including Google Plus, Google Play Music, and Google Web Suggest. \n- Proven communication and team-working skills from collaborating with numerous teams across functional (engineering, product, UI design, marketing, operations, and testing) and product areas to deliver on large-scale products in Social and Music. \n- Rich experience in Artificial Intelligence, Data Mining, and Information Retrieval, gained from MS education in AI at Stanford, Research Assistantship at Stanford AI Lab, and building Music Metadata Management System and Web Suggest models at Google. \n- Extensive engineering experience in Java, C++, Python, storage technologies (Bigtable, Spanner), and MapReduce. \n- Native command of English and Chinese, and fluent in oral/written Japanese (JLPT level 2). Summary - 10+ years of industrial experience in software engineering, especially in the areas of system infrastructure, storage systems, and scalability issues. \n- Seasoned software architect who has designed and implemented several planet-scale distributed backend infrastructure systems with high performance, low latency, and strong consistency, including the Social Graph Service, Music Metadata Management Service, and Music Store Service at Google. \n- 7+ years of technical leadership experience with growing and managing mid-size engineering teams, and driving company-wide impactful initiatives including Google Plus, Google Play Music, and Google Web Suggest. \n- Proven communication and team-working skills from collaborating with numerous teams across functional (engineering, product, UI design, marketing, operations, and testing) and product areas to deliver on large-scale products in Social and Music. \n- Rich experience in Artificial Intelligence, Data Mining, and Information Retrieval, gained from MS education in AI at Stanford, Research Assistantship at Stanford AI Lab, and building Music Metadata Management System and Web Suggest models at Google. \n- Extensive engineering experience in Java, C++, Python, storage technologies (Bigtable, Spanner), and MapReduce. \n- Native command of English and Chinese, and fluent in oral/written Japanese (JLPT level 2). - 10+ years of industrial experience in software engineering, especially in the areas of system infrastructure, storage systems, and scalability issues. \n- Seasoned software architect who has designed and implemented several planet-scale distributed backend infrastructure systems with high performance, low latency, and strong consistency, including the Social Graph Service, Music Metadata Management Service, and Music Store Service at Google. \n- 7+ years of technical leadership experience with growing and managing mid-size engineering teams, and driving company-wide impactful initiatives including Google Plus, Google Play Music, and Google Web Suggest. \n- Proven communication and team-working skills from collaborating with numerous teams across functional (engineering, product, UI design, marketing, operations, and testing) and product areas to deliver on large-scale products in Social and Music. \n- Rich experience in Artificial Intelligence, Data Mining, and Information Retrieval, gained from MS education in AI at Stanford, Research Assistantship at Stanford AI Lab, and building Music Metadata Management System and Web Suggest models at Google. \n- Extensive engineering experience in Java, C++, Python, storage technologies (Bigtable, Spanner), and MapReduce. \n- Native command of English and Chinese, and fluent in oral/written Japanese (JLPT level 2). - 10+ years of industrial experience in software engineering, especially in the areas of system infrastructure, storage systems, and scalability issues. \n- Seasoned software architect who has designed and implemented several planet-scale distributed backend infrastructure systems with high performance, low latency, and strong consistency, including the Social Graph Service, Music Metadata Management Service, and Music Store Service at Google. \n- 7+ years of technical leadership experience with growing and managing mid-size engineering teams, and driving company-wide impactful initiatives including Google Plus, Google Play Music, and Google Web Suggest. \n- Proven communication and team-working skills from collaborating with numerous teams across functional (engineering, product, UI design, marketing, operations, and testing) and product areas to deliver on large-scale products in Social and Music. \n- Rich experience in Artificial Intelligence, Data Mining, and Information Retrieval, gained from MS education in AI at Stanford, Research Assistantship at Stanford AI Lab, and building Music Metadata Management System and Web Suggest models at Google. \n- Extensive engineering experience in Java, C++, Python, storage technologies (Bigtable, Spanner), and MapReduce. \n- Native command of English and Chinese, and fluent in oral/written Japanese (JLPT level 2). Experience Mobile App Search & Indexing - Engineering Manager, Tech Lead, Staff Software Engineer Google July 2014  – Present (1 year 2 months) Mountain View, CA Manage a team to index, understand, and serve the content in mobile apps. Social Graph Service - Staff Software Engineer, Tech Lead Google January 2012  –  July 2014  (2 years 7 months) Mountain View, CA - The Social Graph Service provides a unified data model and API over all social graph data at Google. It is the central place for reading/writing membership data of G+ Circles, Hangout, G+ Communities, G+ Events and Google Voice, and reading user profiles. The service is a core component of several Google services including Google Plus, Hangout, and Google Voice. \n- As the Tech Lead of the Social Graph Core team, led a team of 5 engineers to develop the main system in Java on top of Spanner storage and ST index, and managed collaboration with clients to support new products and use cases. \n- Drove the design and implementation of the system for scalability (10+B user membership edges and 1M queries/second across 15 data centers), performance (under 12ms mean latency), consistency and client integration (70+ clients). \n- Personally wrote most of the system's backend serving layer and indexing solution. \n- Drove the migration of the system's storage from Megastore to Spanner, in the process significantly increasing the system's scalability (from 100 writes/seconds to 30+K writes/second) and consistency (full serializability). Completed the migration with zero system down-time or change to clients. \n- Led the launch of Hangout, G+ Communities and G+ Vanity URLs on Social Graph Service. Designed and implemented end-to-end indexing solution on top of ST index to support fast group chat lookup and various sorted views in Hangout client. Optimized the system's serving logic to reduce machine usage by 3X. Google Play Music - Senior Software Engineer, Tech Lead, Architect Google November 2007  –  January 2012  (4 years 3 months) Mountain View, CA - The Metadata Management Service handles the storage, relationship management, retrieval, and matching of 30+M tracks and the associated metadata. It aggregates the artist, album and track metadata from hundreds of music labels, and manages the complex relationship in the data. It facilitates the matching of all ingested music content, and powers core functionalities such as music search, Scan-and-Match of user uploaded content, and recommendations. \n- Architected the system end-to-end. Personally wrote the first version of the system in C++ on top of Bigtable storage. \n- Engineered end-to-end metadata matching system that matches raw content from music labels and user uploads to existing music store records. The system supports the re-ingestion and matching of the entire music corpus in under a day, and instant update of newly ingested content in under 2 hours. \n \n- The Music Store Service powers the search and browsing experience in the Google Play music store, and is the central business server for music search results, purchase fulfillment, manually curated content, and customer reviews. It serves 20+K queries/second, 100+K orders and $300+K revenue per day. \n- Built the service in Java on top of ST index (search results), Zipit (reviews), and Checkout (orders). \n \n- Led a team of 6 to develop the frontend service in Java and client music player in JavaScript. Drove product features and designs with product managers and UI designers. Web Suggest - Software Engineer III, Tech Lead Google September 2006  –  November 2007  (1 year 3 months) Mountain View, CA - Web Suggest is the feature that completes your query as you type in the search box. It started out as an experimental feature developed by 20% contributors. I was the first full-time engineer on the project. \n- As the Tech Lead of a 5-engineer team, productionized the system and graduated the product from experimental status. Drove the launch of the product in Asian markets (China, Taiwan, and Hong Kong). Achieved 25% feature adoption, increased average query length by 2%, and saved adopted users 48% keystrokes. \n- Using a Bayesian bigram model trained with query data in web logs, built the Chinese pinyin suggest feature that enabled Chinese users to input pinyin and get a list of matched Chinese character query completions. This greatly improved the search experience of Chinese users, allowing them to perform searches even when they do not have IME installed. Web Search - Software Engineer II Google October 2005  –  September 2006  (1 year) Mountain View, CA - Built using Python the Continuous Quality Evaluation Pipeline for CJK language segmenter to generate quality evaluation runs for quality experiments, and aggregate evaluation results. This enabled the evaluation, optimization, and ultimately the launch of Google's in-house CJK language segmenter that replaced the buggy and black-box third-party segmentation software we were using. \n- Implemented various web search frontend features including search query language encoding detection, and safesearch and results ranking twiddling for CJK queries. Software Engineer Intern Amazon, Epson, Redknee, and ATI (now AMD) 2000  –  2004  (4 years) Various - At Amazon, developed Guaranteed Pub/sub Messaging Framework for Order Management Systems using C++, CORBA, and Oracle AQ. Implemented Fast Track Shipping for 1-Click customers using Perl, Mason, C++ and JavaScript. \n- At Epson, re-designed the printing algorithm of the Webprint client Windows application using Java, C++ and JNI, resulting in significant enhancements to application performance and printing quality. Designed and implemented printing app for Symbian OS using C++, Symbian SDK, and SPP. \n- At Redknee, built CTP (Card Telephony Protocol) Simulation System using Java and SQL. \n- At ATI (now AMD), developed 2D Graphics automation test suites using C++, GDI, Windows SDK, and Visual Test. Mobile App Search & Indexing - Engineering Manager, Tech Lead, Staff Software Engineer Google July 2014  – Present (1 year 2 months) Mountain View, CA Manage a team to index, understand, and serve the content in mobile apps. Mobile App Search & Indexing - Engineering Manager, Tech Lead, Staff Software Engineer Google July 2014  – Present (1 year 2 months) Mountain View, CA Manage a team to index, understand, and serve the content in mobile apps. Social Graph Service - Staff Software Engineer, Tech Lead Google January 2012  –  July 2014  (2 years 7 months) Mountain View, CA - The Social Graph Service provides a unified data model and API over all social graph data at Google. It is the central place for reading/writing membership data of G+ Circles, Hangout, G+ Communities, G+ Events and Google Voice, and reading user profiles. The service is a core component of several Google services including Google Plus, Hangout, and Google Voice. \n- As the Tech Lead of the Social Graph Core team, led a team of 5 engineers to develop the main system in Java on top of Spanner storage and ST index, and managed collaboration with clients to support new products and use cases. \n- Drove the design and implementation of the system for scalability (10+B user membership edges and 1M queries/second across 15 data centers), performance (under 12ms mean latency), consistency and client integration (70+ clients). \n- Personally wrote most of the system's backend serving layer and indexing solution. \n- Drove the migration of the system's storage from Megastore to Spanner, in the process significantly increasing the system's scalability (from 100 writes/seconds to 30+K writes/second) and consistency (full serializability). Completed the migration with zero system down-time or change to clients. \n- Led the launch of Hangout, G+ Communities and G+ Vanity URLs on Social Graph Service. Designed and implemented end-to-end indexing solution on top of ST index to support fast group chat lookup and various sorted views in Hangout client. Optimized the system's serving logic to reduce machine usage by 3X. Social Graph Service - Staff Software Engineer, Tech Lead Google January 2012  –  July 2014  (2 years 7 months) Mountain View, CA - The Social Graph Service provides a unified data model and API over all social graph data at Google. It is the central place for reading/writing membership data of G+ Circles, Hangout, G+ Communities, G+ Events and Google Voice, and reading user profiles. The service is a core component of several Google services including Google Plus, Hangout, and Google Voice. \n- As the Tech Lead of the Social Graph Core team, led a team of 5 engineers to develop the main system in Java on top of Spanner storage and ST index, and managed collaboration with clients to support new products and use cases. \n- Drove the design and implementation of the system for scalability (10+B user membership edges and 1M queries/second across 15 data centers), performance (under 12ms mean latency), consistency and client integration (70+ clients). \n- Personally wrote most of the system's backend serving layer and indexing solution. \n- Drove the migration of the system's storage from Megastore to Spanner, in the process significantly increasing the system's scalability (from 100 writes/seconds to 30+K writes/second) and consistency (full serializability). Completed the migration with zero system down-time or change to clients. \n- Led the launch of Hangout, G+ Communities and G+ Vanity URLs on Social Graph Service. Designed and implemented end-to-end indexing solution on top of ST index to support fast group chat lookup and various sorted views in Hangout client. Optimized the system's serving logic to reduce machine usage by 3X. Google Play Music - Senior Software Engineer, Tech Lead, Architect Google November 2007  –  January 2012  (4 years 3 months) Mountain View, CA - The Metadata Management Service handles the storage, relationship management, retrieval, and matching of 30+M tracks and the associated metadata. It aggregates the artist, album and track metadata from hundreds of music labels, and manages the complex relationship in the data. It facilitates the matching of all ingested music content, and powers core functionalities such as music search, Scan-and-Match of user uploaded content, and recommendations. \n- Architected the system end-to-end. Personally wrote the first version of the system in C++ on top of Bigtable storage. \n- Engineered end-to-end metadata matching system that matches raw content from music labels and user uploads to existing music store records. The system supports the re-ingestion and matching of the entire music corpus in under a day, and instant update of newly ingested content in under 2 hours. \n \n- The Music Store Service powers the search and browsing experience in the Google Play music store, and is the central business server for music search results, purchase fulfillment, manually curated content, and customer reviews. It serves 20+K queries/second, 100+K orders and $300+K revenue per day. \n- Built the service in Java on top of ST index (search results), Zipit (reviews), and Checkout (orders). \n \n- Led a team of 6 to develop the frontend service in Java and client music player in JavaScript. Drove product features and designs with product managers and UI designers. Google Play Music - Senior Software Engineer, Tech Lead, Architect Google November 2007  –  January 2012  (4 years 3 months) Mountain View, CA - The Metadata Management Service handles the storage, relationship management, retrieval, and matching of 30+M tracks and the associated metadata. It aggregates the artist, album and track metadata from hundreds of music labels, and manages the complex relationship in the data. It facilitates the matching of all ingested music content, and powers core functionalities such as music search, Scan-and-Match of user uploaded content, and recommendations. \n- Architected the system end-to-end. Personally wrote the first version of the system in C++ on top of Bigtable storage. \n- Engineered end-to-end metadata matching system that matches raw content from music labels and user uploads to existing music store records. The system supports the re-ingestion and matching of the entire music corpus in under a day, and instant update of newly ingested content in under 2 hours. \n \n- The Music Store Service powers the search and browsing experience in the Google Play music store, and is the central business server for music search results, purchase fulfillment, manually curated content, and customer reviews. It serves 20+K queries/second, 100+K orders and $300+K revenue per day. \n- Built the service in Java on top of ST index (search results), Zipit (reviews), and Checkout (orders). \n \n- Led a team of 6 to develop the frontend service in Java and client music player in JavaScript. Drove product features and designs with product managers and UI designers. Web Suggest - Software Engineer III, Tech Lead Google September 2006  –  November 2007  (1 year 3 months) Mountain View, CA - Web Suggest is the feature that completes your query as you type in the search box. It started out as an experimental feature developed by 20% contributors. I was the first full-time engineer on the project. \n- As the Tech Lead of a 5-engineer team, productionized the system and graduated the product from experimental status. Drove the launch of the product in Asian markets (China, Taiwan, and Hong Kong). Achieved 25% feature adoption, increased average query length by 2%, and saved adopted users 48% keystrokes. \n- Using a Bayesian bigram model trained with query data in web logs, built the Chinese pinyin suggest feature that enabled Chinese users to input pinyin and get a list of matched Chinese character query completions. This greatly improved the search experience of Chinese users, allowing them to perform searches even when they do not have IME installed. Web Suggest - Software Engineer III, Tech Lead Google September 2006  –  November 2007  (1 year 3 months) Mountain View, CA - Web Suggest is the feature that completes your query as you type in the search box. It started out as an experimental feature developed by 20% contributors. I was the first full-time engineer on the project. \n- As the Tech Lead of a 5-engineer team, productionized the system and graduated the product from experimental status. Drove the launch of the product in Asian markets (China, Taiwan, and Hong Kong). Achieved 25% feature adoption, increased average query length by 2%, and saved adopted users 48% keystrokes. \n- Using a Bayesian bigram model trained with query data in web logs, built the Chinese pinyin suggest feature that enabled Chinese users to input pinyin and get a list of matched Chinese character query completions. This greatly improved the search experience of Chinese users, allowing them to perform searches even when they do not have IME installed. Web Search - Software Engineer II Google October 2005  –  September 2006  (1 year) Mountain View, CA - Built using Python the Continuous Quality Evaluation Pipeline for CJK language segmenter to generate quality evaluation runs for quality experiments, and aggregate evaluation results. This enabled the evaluation, optimization, and ultimately the launch of Google's in-house CJK language segmenter that replaced the buggy and black-box third-party segmentation software we were using. \n- Implemented various web search frontend features including search query language encoding detection, and safesearch and results ranking twiddling for CJK queries. Web Search - Software Engineer II Google October 2005  –  September 2006  (1 year) Mountain View, CA - Built using Python the Continuous Quality Evaluation Pipeline for CJK language segmenter to generate quality evaluation runs for quality experiments, and aggregate evaluation results. This enabled the evaluation, optimization, and ultimately the launch of Google's in-house CJK language segmenter that replaced the buggy and black-box third-party segmentation software we were using. \n- Implemented various web search frontend features including search query language encoding detection, and safesearch and results ranking twiddling for CJK queries. Software Engineer Intern Amazon, Epson, Redknee, and ATI (now AMD) 2000  –  2004  (4 years) Various - At Amazon, developed Guaranteed Pub/sub Messaging Framework for Order Management Systems using C++, CORBA, and Oracle AQ. Implemented Fast Track Shipping for 1-Click customers using Perl, Mason, C++ and JavaScript. \n- At Epson, re-designed the printing algorithm of the Webprint client Windows application using Java, C++ and JNI, resulting in significant enhancements to application performance and printing quality. Designed and implemented printing app for Symbian OS using C++, Symbian SDK, and SPP. \n- At Redknee, built CTP (Card Telephony Protocol) Simulation System using Java and SQL. \n- At ATI (now AMD), developed 2D Graphics automation test suites using C++, GDI, Windows SDK, and Visual Test. Software Engineer Intern Amazon, Epson, Redknee, and ATI (now AMD) 2000  –  2004  (4 years) Various - At Amazon, developed Guaranteed Pub/sub Messaging Framework for Order Management Systems using C++, CORBA, and Oracle AQ. Implemented Fast Track Shipping for 1-Click customers using Perl, Mason, C++ and JavaScript. \n- At Epson, re-designed the printing algorithm of the Webprint client Windows application using Java, C++ and JNI, resulting in significant enhancements to application performance and printing quality. Designed and implemented printing app for Symbian OS using C++, Symbian SDK, and SPP. \n- At Redknee, built CTP (Card Telephony Protocol) Simulation System using Java and SQL. \n- At ATI (now AMD), developed 2D Graphics automation test suites using C++, GDI, Windows SDK, and Visual Test. Languages English Native or bilingual proficiency Chinese Native or bilingual proficiency Japanese Professional working proficiency English Native or bilingual proficiency Chinese Native or bilingual proficiency Japanese Professional working proficiency English Native or bilingual proficiency Chinese Native or bilingual proficiency Japanese Professional working proficiency Native or bilingual proficiency Native or bilingual proficiency Professional working proficiency Skills Distributed Systems Scalability Algorithms Software Engineering Android JavaScript MapReduce Linux BigTable Java C++ Python Hadoop Machine Learning Backend Development Systems Engineering Databases AJAX Chinese Japanese Natural Language... Information Retrieval Storage Infrastructure Data Mining See 9+     See less Skills  Distributed Systems Scalability Algorithms Software Engineering Android JavaScript MapReduce Linux BigTable Java C++ Python Hadoop Machine Learning Backend Development Systems Engineering Databases AJAX Chinese Japanese Natural Language... Information Retrieval Storage Infrastructure Data Mining See 9+     See less Distributed Systems Scalability Algorithms Software Engineering Android JavaScript MapReduce Linux BigTable Java C++ Python Hadoop Machine Learning Backend Development Systems Engineering Databases AJAX Chinese Japanese Natural Language... Information Retrieval Storage Infrastructure Data Mining See 9+     See less Distributed Systems Scalability Algorithms Software Engineering Android JavaScript MapReduce Linux BigTable Java C++ Python Hadoop Machine Learning Backend Development Systems Engineering Databases AJAX Chinese Japanese Natural Language... Information Retrieval Storage Infrastructure Data Mining See 9+     See less Education Stanford University MS,  Computer Science (with concentration in Artificial Intelligence) , 4.09 GPA Activities and Societies:  Research Assistantship at Stanford AI Lab: Image Action Classification using Poselets ,  Self-Paced Learning and Latent Structured SVMs (LSSVM). Advisor: Daphne Koller University of Waterloo BS,  Computer Engineering Activities and Societies:  Dean's Honour List ,  with Distinction Stanford University MS,  Computer Science (with concentration in Artificial Intelligence) , 4.09 GPA Activities and Societies:  Research Assistantship at Stanford AI Lab: Image Action Classification using Poselets ,  Self-Paced Learning and Latent Structured SVMs (LSSVM). Advisor: Daphne Koller Stanford University MS,  Computer Science (with concentration in Artificial Intelligence) , 4.09 GPA Activities and Societies:  Research Assistantship at Stanford AI Lab: Image Action Classification using Poselets ,  Self-Paced Learning and Latent Structured SVMs (LSSVM). Advisor: Daphne Koller Stanford University MS,  Computer Science (with concentration in Artificial Intelligence) , 4.09 GPA Activities and Societies:  Research Assistantship at Stanford AI Lab: Image Action Classification using Poselets ,  Self-Paced Learning and Latent Structured SVMs (LSSVM). Advisor: Daphne Koller University of Waterloo BS,  Computer Engineering Activities and Societies:  Dean's Honour List ,  with Distinction University of Waterloo BS,  Computer Engineering Activities and Societies:  Dean's Honour List ,  with Distinction University of Waterloo BS,  Computer Engineering Activities and Societies:  Dean's Honour List ,  with Distinction Honors & Awards OC Award - Google Play Music Google January 2012 For building and launching Google Play Music. OC Award - Google Play Music Google January 2012 For building and launching Google Play Music. OC Award - Google Play Music Google January 2012 For building and launching Google Play Music. OC Award - Google Play Music Google January 2012 For building and launching Google Play Music. ", "Summary I am a student that enjoys playing around with different coding projects. Summary I am a student that enjoys playing around with different coding projects. I am a student that enjoys playing around with different coding projects. I am a student that enjoys playing around with different coding projects. Experience Software Engineer Intern Google July 2015  – Present (2 months) London, United Kingdom Video Ads team Software Engineer Intern Google June 2014  –  August 2014  (3 months) Zürich, Switzerland Developer on Calendar team Software Engineer Intern Google June 2013  –  September 2013  (4 months) New York, NY, USA Developer on Local Search team (places shown in maps). Software Engineer Intern Ixia June 2012  –  September 2012  (4 months) Bucharest, Romania Unit Testing for modules in a C# application. Software Engineer Intern Google July 2015  – Present (2 months) London, United Kingdom Video Ads team Software Engineer Intern Google July 2015  – Present (2 months) London, United Kingdom Video Ads team Software Engineer Intern Google June 2014  –  August 2014  (3 months) Zürich, Switzerland Developer on Calendar team Software Engineer Intern Google June 2014  –  August 2014  (3 months) Zürich, Switzerland Developer on Calendar team Software Engineer Intern Google June 2013  –  September 2013  (4 months) New York, NY, USA Developer on Local Search team (places shown in maps). Software Engineer Intern Google June 2013  –  September 2013  (4 months) New York, NY, USA Developer on Local Search team (places shown in maps). Software Engineer Intern Ixia June 2012  –  September 2012  (4 months) Bucharest, Romania Unit Testing for modules in a C# application. Software Engineer Intern Ixia June 2012  –  September 2012  (4 months) Bucharest, Romania Unit Testing for modules in a C# application. Languages English Full professional proficiency French Elementary proficiency Romanian Native or bilingual proficiency English Full professional proficiency French Elementary proficiency Romanian Native or bilingual proficiency English Full professional proficiency French Elementary proficiency Romanian Native or bilingual proficiency Full professional proficiency Elementary proficiency Native or bilingual proficiency Skills C/C++ PHP Python HTML + CSS JavaScript Java Bash Linux Git Vim English IDE Eclipse Shell Scripting C C++ Algorithms Computer Science C# See 4+     See less Skills  C/C++ PHP Python HTML + CSS JavaScript Java Bash Linux Git Vim English IDE Eclipse Shell Scripting C C++ Algorithms Computer Science C# See 4+     See less C/C++ PHP Python HTML + CSS JavaScript Java Bash Linux Git Vim English IDE Eclipse Shell Scripting C C++ Algorithms Computer Science C# See 4+     See less C/C++ PHP Python HTML + CSS JavaScript Java Bash Linux Git Vim English IDE Eclipse Shell Scripting C C++ Algorithms Computer Science C# See 4+     See less Education WU (Vienna University of Economics and Business) Master's Degree,  Information Systems 2014  – 2016 Universitatea „Politehnica” din București Bachelor's Degree,  Computer Science 2010  – 2014 Tudor Vianu National High School of Computer Science High School Diploma,  Mathematics and Computer Science 2006  – 2010 WU (Vienna University of Economics and Business) Master's Degree,  Information Systems 2014  – 2016 WU (Vienna University of Economics and Business) Master's Degree,  Information Systems 2014  – 2016 WU (Vienna University of Economics and Business) Master's Degree,  Information Systems 2014  – 2016 Universitatea „Politehnica” din București Bachelor's Degree,  Computer Science 2010  – 2014 Universitatea „Politehnica” din București Bachelor's Degree,  Computer Science 2010  – 2014 Universitatea „Politehnica” din București Bachelor's Degree,  Computer Science 2010  – 2014 Tudor Vianu National High School of Computer Science High School Diploma,  Mathematics and Computer Science 2006  – 2010 Tudor Vianu National High School of Computer Science High School Diploma,  Mathematics and Computer Science 2006  – 2010 Tudor Vianu National High School of Computer Science High School Diploma,  Mathematics and Computer Science 2006  – 2010 Honors & Awards ", "Experience Software Engineer Intern Google July 2015  – Present (2 months) Boston, Massachusetts Search Engine Member Serbian Committee for Competitions in Informatics January 2015  –  May 2015  (5 months) Belgrade, Serbia Preparing tasks for and organizing high school competitions in informatics. Software Engineer Intern Google July 2014  –  September 2014  (3 months) Warsaw, Poland Internal infrastructure Teaching Assistant \"Prva kragujevačka gimnazija\" High School September 2013  –  May 2014  (9 months) Kragujevac, Serbia Preparing students for Informatics competitions. Software Engineer Intern Google July 2015  – Present (2 months) Boston, Massachusetts Search Engine Software Engineer Intern Google July 2015  – Present (2 months) Boston, Massachusetts Search Engine Member Serbian Committee for Competitions in Informatics January 2015  –  May 2015  (5 months) Belgrade, Serbia Preparing tasks for and organizing high school competitions in informatics. Member Serbian Committee for Competitions in Informatics January 2015  –  May 2015  (5 months) Belgrade, Serbia Preparing tasks for and organizing high school competitions in informatics. Software Engineer Intern Google July 2014  –  September 2014  (3 months) Warsaw, Poland Internal infrastructure Software Engineer Intern Google July 2014  –  September 2014  (3 months) Warsaw, Poland Internal infrastructure Teaching Assistant \"Prva kragujevačka gimnazija\" High School September 2013  –  May 2014  (9 months) Kragujevac, Serbia Preparing students for Informatics competitions. Teaching Assistant \"Prva kragujevačka gimnazija\" High School September 2013  –  May 2014  (9 months) Kragujevac, Serbia Preparing students for Informatics competitions. Languages English Professional working proficiency Serbian Native or bilingual proficiency English Professional working proficiency Serbian Native or bilingual proficiency English Professional working proficiency Serbian Native or bilingual proficiency Professional working proficiency Native or bilingual proficiency Skills C++ C Algorithms Data Structures Computer Science Programming Software Engineering Operating Systems Mathematical Analysis Computer Networking Discrete Mathematics Java Pascal HTML CSS JavaScript jQuery PHP SQL See 4+     See less Skills  C++ C Algorithms Data Structures Computer Science Programming Software Engineering Operating Systems Mathematical Analysis Computer Networking Discrete Mathematics Java Pascal HTML CSS JavaScript jQuery PHP SQL See 4+     See less C++ C Algorithms Data Structures Computer Science Programming Software Engineering Operating Systems Mathematical Analysis Computer Networking Discrete Mathematics Java Pascal HTML CSS JavaScript jQuery PHP SQL See 4+     See less C++ C Algorithms Data Structures Computer Science Programming Software Engineering Operating Systems Mathematical Analysis Computer Networking Discrete Mathematics Java Pascal HTML CSS JavaScript jQuery PHP SQL See 4+     See less Education Faculty of Computing, Union University Bachelor's degree,  Computer science 2013  – 2017 Faculty of Mathematics, University of Belgrade Bachelor's degree,  Mathematics 2013  – 2017 \"Prva kragujevačka gimnazija\" High School Mathematics ,  Informatics 2009  – 2013 Faculty of Computing, Union University Bachelor's degree,  Computer science 2013  – 2017 Faculty of Computing, Union University Bachelor's degree,  Computer science 2013  – 2017 Faculty of Computing, Union University Bachelor's degree,  Computer science 2013  – 2017 Faculty of Mathematics, University of Belgrade Bachelor's degree,  Mathematics 2013  – 2017 Faculty of Mathematics, University of Belgrade Bachelor's degree,  Mathematics 2013  – 2017 Faculty of Mathematics, University of Belgrade Bachelor's degree,  Mathematics 2013  – 2017 \"Prva kragujevačka gimnazija\" High School Mathematics ,  Informatics 2009  – 2013 \"Prva kragujevačka gimnazija\" High School Mathematics ,  Informatics 2009  – 2013 \"Prva kragujevačka gimnazija\" High School Mathematics ,  Informatics 2009  – 2013 Honors & Awards Bronze Medal on XXV International Olympiad in Informatics July 2013 Bronze Medal on XXI Balkan Olympiad in Informatics September 2013 Bronze Medal on XX Balkan Olympiad in Informatics August 2012 Bronze Medal on XXV International Olympiad in Informatics July 2013 Bronze Medal on XXV International Olympiad in Informatics July 2013 Bronze Medal on XXV International Olympiad in Informatics July 2013 Bronze Medal on XXI Balkan Olympiad in Informatics September 2013 Bronze Medal on XXI Balkan Olympiad in Informatics September 2013 Bronze Medal on XXI Balkan Olympiad in Informatics September 2013 Bronze Medal on XX Balkan Olympiad in Informatics August 2012 Bronze Medal on XX Balkan Olympiad in Informatics August 2012 Bronze Medal on XX Balkan Olympiad in Informatics August 2012 ", "Experience Software Engineer Intern Google August 2015  – Present (1 month) Mountain View, CA Software Engineer VRS January 2015  –  July 2015  (7 months) I worked for the startup in the role of a Software Engineer. I was responsible for both the front and back end implementation of different features. I mainly worked with GWT and Google datastore and used Selenium for automated tests.  Software Engineer Intern Google June 2014  –  November 2014  (6 months) Mountain View, CA Part of the Google Shopping Express Team. I worked in the internal tools and gained experience Android, Java Backend, Exporting data. Software Engineer Trainee Intern Google June 2013  –  September 2013  (4 months) Zurich Part of the Multi Device Experience team which created the feature that allows you to use your mobile device as a remote control to play videos on the YouTube application on your TV. I developed both for Android and on the server side of the project. Intern Musala Soft January 2013  –  January 2013  (1 month) Sofia Intern Musala Soft June 2012  –  August 2012  (3 months) Sofia, Bulgaria Android development team. Technologies used - Java, Android SDK, MySQL Software Engineer Intern Google August 2015  – Present (1 month) Mountain View, CA Software Engineer Intern Google August 2015  – Present (1 month) Mountain View, CA Software Engineer VRS January 2015  –  July 2015  (7 months) I worked for the startup in the role of a Software Engineer. I was responsible for both the front and back end implementation of different features. I mainly worked with GWT and Google datastore and used Selenium for automated tests.  Software Engineer VRS January 2015  –  July 2015  (7 months) I worked for the startup in the role of a Software Engineer. I was responsible for both the front and back end implementation of different features. I mainly worked with GWT and Google datastore and used Selenium for automated tests.  Software Engineer Intern Google June 2014  –  November 2014  (6 months) Mountain View, CA Part of the Google Shopping Express Team. I worked in the internal tools and gained experience Android, Java Backend, Exporting data. Software Engineer Intern Google June 2014  –  November 2014  (6 months) Mountain View, CA Part of the Google Shopping Express Team. I worked in the internal tools and gained experience Android, Java Backend, Exporting data. Software Engineer Trainee Intern Google June 2013  –  September 2013  (4 months) Zurich Part of the Multi Device Experience team which created the feature that allows you to use your mobile device as a remote control to play videos on the YouTube application on your TV. I developed both for Android and on the server side of the project. Software Engineer Trainee Intern Google June 2013  –  September 2013  (4 months) Zurich Part of the Multi Device Experience team which created the feature that allows you to use your mobile device as a remote control to play videos on the YouTube application on your TV. I developed both for Android and on the server side of the project. Intern Musala Soft January 2013  –  January 2013  (1 month) Sofia Intern Musala Soft January 2013  –  January 2013  (1 month) Sofia Intern Musala Soft June 2012  –  August 2012  (3 months) Sofia, Bulgaria Android development team. Technologies used - Java, Android SDK, MySQL Intern Musala Soft June 2012  –  August 2012  (3 months) Sofia, Bulgaria Android development team. Technologies used - Java, Android SDK, MySQL Languages Bulgarian Native or bilingual proficiency Russian Native or bilingual proficiency Ukrainian Full professional proficiency English Full professional proficiency Bulgarian Native or bilingual proficiency Russian Native or bilingual proficiency Ukrainian Full professional proficiency English Full professional proficiency Bulgarian Native or bilingual proficiency Russian Native or bilingual proficiency Ukrainian Full professional proficiency English Full professional proficiency Native or bilingual proficiency Native or bilingual proficiency Full professional proficiency Full professional proficiency Skills Java C# OOP SQL Android Development Haskell Python C Java Servlet Skills  Java C# OOP SQL Android Development Haskell Python C Java Servlet Java C# OOP SQL Android Development Haskell Python C Java Servlet Java C# OOP SQL Android Development Haskell Python C Java Servlet Education New Bulgarian University Computer Science 2014  – 2016 University of St. Andrews BSc of Computer Science 2011  – 2014 Telerik School Academy 2010  – 2011 High School of Mathematics and Natural Science \"Vasil Drumev\", Veliko Tarnovo Mathematics and Computer Science 2007  – 2011 New Bulgarian University Computer Science 2014  – 2016 New Bulgarian University Computer Science 2014  – 2016 New Bulgarian University Computer Science 2014  – 2016 University of St. Andrews BSc of Computer Science 2011  – 2014 University of St. Andrews BSc of Computer Science 2011  – 2014 University of St. Andrews BSc of Computer Science 2011  – 2014 Telerik School Academy 2010  – 2011 Telerik School Academy 2010  – 2011 Telerik School Academy 2010  – 2011 High School of Mathematics and Natural Science \"Vasil Drumev\", Veliko Tarnovo Mathematics and Computer Science 2007  – 2011 High School of Mathematics and Natural Science \"Vasil Drumev\", Veliko Tarnovo Mathematics and Computer Science 2007  – 2011 High School of Mathematics and Natural Science \"Vasil Drumev\", Veliko Tarnovo Mathematics and Computer Science 2007  – 2011 Honors & Awards Class Medal for Excellent Performance University of St Andrews February 2012 Received for excellent performance in first year Computer Science module First place in AI competition University of St Andrews May 2012 Received for winning first place in the university's competition for developing the best AI for the Connect 4 game. 2nd Place National Russian Olympiad May 2010 Class Medal for Excellent Performance University of St Andrews February 2012 Received for excellent performance in first year Computer Science module Class Medal for Excellent Performance University of St Andrews February 2012 Received for excellent performance in first year Computer Science module Class Medal for Excellent Performance University of St Andrews February 2012 Received for excellent performance in first year Computer Science module First place in AI competition University of St Andrews May 2012 Received for winning first place in the university's competition for developing the best AI for the Connect 4 game. First place in AI competition University of St Andrews May 2012 Received for winning first place in the university's competition for developing the best AI for the Connect 4 game. First place in AI competition University of St Andrews May 2012 Received for winning first place in the university's competition for developing the best AI for the Connect 4 game. 2nd Place National Russian Olympiad May 2010 2nd Place National Russian Olympiad May 2010 2nd Place National Russian Olympiad May 2010 ", "Summary I've recently finished my PhD in Electrical and Computer Engineering at the University of British Columbia. My advisor was Matei Ripeanu, and I worked in the NetSysLab.  \n \nMy research focused on automating the configuration of intermediate storage systems.  \nI was also involved in the Totem project (Graph Processing in Hybrid Architectures).  \n \n \nPast: \n \nDuring the summers of 2009, 2010, and 2013 I had a great time at Google as an intern for the Site Reliability Engineering team for ContentAds (2009), and as Software Engineer intern for the Cluster Management team (2010), and the Google Feedback team (2013) in Mountain View, CA, USA.  \n \nBefore starting at UBC, I worked at the LSD (Distributed Systems Lab) of UFCG (Universidade Federal de Campina Grande) in Brazil where I worked as software engineer and assistant researcher (2006-2008), and I concluded my undergraduate (2003) and MSc studies (2005) contributing to OurGrid project. As part of my research in OurGrid, I undertook an internship at Hewlett Packard Labs in Palo Alto, CA, USA. In 2008, I was also an intern at Fraunhofer ITWM in Kaiserslautern, Germany contributing to their Jawari project for three months. Summary I've recently finished my PhD in Electrical and Computer Engineering at the University of British Columbia. My advisor was Matei Ripeanu, and I worked in the NetSysLab.  \n \nMy research focused on automating the configuration of intermediate storage systems.  \nI was also involved in the Totem project (Graph Processing in Hybrid Architectures).  \n \n \nPast: \n \nDuring the summers of 2009, 2010, and 2013 I had a great time at Google as an intern for the Site Reliability Engineering team for ContentAds (2009), and as Software Engineer intern for the Cluster Management team (2010), and the Google Feedback team (2013) in Mountain View, CA, USA.  \n \nBefore starting at UBC, I worked at the LSD (Distributed Systems Lab) of UFCG (Universidade Federal de Campina Grande) in Brazil where I worked as software engineer and assistant researcher (2006-2008), and I concluded my undergraduate (2003) and MSc studies (2005) contributing to OurGrid project. As part of my research in OurGrid, I undertook an internship at Hewlett Packard Labs in Palo Alto, CA, USA. In 2008, I was also an intern at Fraunhofer ITWM in Kaiserslautern, Germany contributing to their Jawari project for three months. I've recently finished my PhD in Electrical and Computer Engineering at the University of British Columbia. My advisor was Matei Ripeanu, and I worked in the NetSysLab.  \n \nMy research focused on automating the configuration of intermediate storage systems.  \nI was also involved in the Totem project (Graph Processing in Hybrid Architectures).  \n \n \nPast: \n \nDuring the summers of 2009, 2010, and 2013 I had a great time at Google as an intern for the Site Reliability Engineering team for ContentAds (2009), and as Software Engineer intern for the Cluster Management team (2010), and the Google Feedback team (2013) in Mountain View, CA, USA.  \n \nBefore starting at UBC, I worked at the LSD (Distributed Systems Lab) of UFCG (Universidade Federal de Campina Grande) in Brazil where I worked as software engineer and assistant researcher (2006-2008), and I concluded my undergraduate (2003) and MSc studies (2005) contributing to OurGrid project. As part of my research in OurGrid, I undertook an internship at Hewlett Packard Labs in Palo Alto, CA, USA. In 2008, I was also an intern at Fraunhofer ITWM in Kaiserslautern, Germany contributing to their Jawari project for three months. I've recently finished my PhD in Electrical and Computer Engineering at the University of British Columbia. My advisor was Matei Ripeanu, and I worked in the NetSysLab.  \n \nMy research focused on automating the configuration of intermediate storage systems.  \nI was also involved in the Totem project (Graph Processing in Hybrid Architectures).  \n \n \nPast: \n \nDuring the summers of 2009, 2010, and 2013 I had a great time at Google as an intern for the Site Reliability Engineering team for ContentAds (2009), and as Software Engineer intern for the Cluster Management team (2010), and the Google Feedback team (2013) in Mountain View, CA, USA.  \n \nBefore starting at UBC, I worked at the LSD (Distributed Systems Lab) of UFCG (Universidade Federal de Campina Grande) in Brazil where I worked as software engineer and assistant researcher (2006-2008), and I concluded my undergraduate (2003) and MSc studies (2005) contributing to OurGrid project. As part of my research in OurGrid, I undertook an internship at Hewlett Packard Labs in Palo Alto, CA, USA. In 2008, I was also an intern at Fraunhofer ITWM in Kaiserslautern, Germany contributing to their Jawari project for three months. Experience Software Engineer Google December 2014  – Present (9 months) Kitchener, Canada Area Research Assistant University of British Columbia September 2008  –  November 2014  (6 years 3 months) Vancouver, Canada Area Software Engineer Intern Google May 2013  –  August 2013  (4 months) Mountain View, CA Software Engineer at Google Feedback Group  \n Enhancements to handling Android Crash Report for Google Feedback  \n Java, bash, Google internal technology Software Engineer Intern Google June 2010  –  September 2010  (4 months) Software Engineer at Cluster Management group  \n Enhancements in Google protocol buffers specifically to Cluster Management group  \n Improvements in the automatic integration process to test new versions of the system in a testbed  \n C++, Python, Google protocol buffers, Google internal technology Site Reliability Engineer Intern Google June 2009  –  September 2009  (4 months) - Site Reliability Engineering team for ContentAds/AdSense \n- Load balancing, Google internal technology Software Engineer Intern Fraunhofer ITWM March 2008  –  June 2008  (4 months) Development of Jawari, a Grid Computing benchmarking service. Part of the D-Grid Initiative. Details  \nat www.jawari.net  \n Java, Globus, OurGrid, Unicore, Linux, Postgresql, JBoss, Linux, Shell Script Software Eng. and Researcher Universidade Federal de Campina Grande - UFCG / Laboratório de Sistemas Distribuídos January 2006  –  March 2008  (2 years 3 months) Campina Grande Area, Brazil Research, design and implementation of NodeWiz, a Peer-to-Peer and fault-tolerant resource discovery  \nsystem \n Design and implementation of OurGrid software. Details at www.ourgrid.org  \n Java, RMI, Jabber based communication, Linux, Shell Script Visiting Scholar - Intern Hewlett-Packard Laboratories September 2006  –  November 2006  (3 months) Palo Alto, California •\tResearch and development of NodeWiz, a Peer-to-Peer and fault-tolerant resource discovery system \n•\tJava, RMI, Jabber event-based communication, PlanetLab Network Administrator CEFET/AL (current Instituto Federal de Educação, Ciência e Tecnologia de Alagoas) March 1999  –  December 1999  (10 months) Maceió Area, Brazil •\tSystem and network administration of CEFET’s Laboratories \n•\tLinux, Windows NT Software Engineer Google December 2014  – Present (9 months) Kitchener, Canada Area Software Engineer Google December 2014  – Present (9 months) Kitchener, Canada Area Research Assistant University of British Columbia September 2008  –  November 2014  (6 years 3 months) Vancouver, Canada Area Research Assistant University of British Columbia September 2008  –  November 2014  (6 years 3 months) Vancouver, Canada Area Software Engineer Intern Google May 2013  –  August 2013  (4 months) Mountain View, CA Software Engineer at Google Feedback Group  \n Enhancements to handling Android Crash Report for Google Feedback  \n Java, bash, Google internal technology Software Engineer Intern Google May 2013  –  August 2013  (4 months) Mountain View, CA Software Engineer at Google Feedback Group  \n Enhancements to handling Android Crash Report for Google Feedback  \n Java, bash, Google internal technology Software Engineer Intern Google June 2010  –  September 2010  (4 months) Software Engineer at Cluster Management group  \n Enhancements in Google protocol buffers specifically to Cluster Management group  \n Improvements in the automatic integration process to test new versions of the system in a testbed  \n C++, Python, Google protocol buffers, Google internal technology Software Engineer Intern Google June 2010  –  September 2010  (4 months) Software Engineer at Cluster Management group  \n Enhancements in Google protocol buffers specifically to Cluster Management group  \n Improvements in the automatic integration process to test new versions of the system in a testbed  \n C++, Python, Google protocol buffers, Google internal technology Site Reliability Engineer Intern Google June 2009  –  September 2009  (4 months) - Site Reliability Engineering team for ContentAds/AdSense \n- Load balancing, Google internal technology Site Reliability Engineer Intern Google June 2009  –  September 2009  (4 months) - Site Reliability Engineering team for ContentAds/AdSense \n- Load balancing, Google internal technology Software Engineer Intern Fraunhofer ITWM March 2008  –  June 2008  (4 months) Development of Jawari, a Grid Computing benchmarking service. Part of the D-Grid Initiative. Details  \nat www.jawari.net  \n Java, Globus, OurGrid, Unicore, Linux, Postgresql, JBoss, Linux, Shell Script Software Engineer Intern Fraunhofer ITWM March 2008  –  June 2008  (4 months) Development of Jawari, a Grid Computing benchmarking service. Part of the D-Grid Initiative. Details  \nat www.jawari.net  \n Java, Globus, OurGrid, Unicore, Linux, Postgresql, JBoss, Linux, Shell Script Software Eng. and Researcher Universidade Federal de Campina Grande - UFCG / Laboratório de Sistemas Distribuídos January 2006  –  March 2008  (2 years 3 months) Campina Grande Area, Brazil Research, design and implementation of NodeWiz, a Peer-to-Peer and fault-tolerant resource discovery  \nsystem \n Design and implementation of OurGrid software. Details at www.ourgrid.org  \n Java, RMI, Jabber based communication, Linux, Shell Script Software Eng. and Researcher Universidade Federal de Campina Grande - UFCG / Laboratório de Sistemas Distribuídos January 2006  –  March 2008  (2 years 3 months) Campina Grande Area, Brazil Research, design and implementation of NodeWiz, a Peer-to-Peer and fault-tolerant resource discovery  \nsystem \n Design and implementation of OurGrid software. Details at www.ourgrid.org  \n Java, RMI, Jabber based communication, Linux, Shell Script Visiting Scholar - Intern Hewlett-Packard Laboratories September 2006  –  November 2006  (3 months) Palo Alto, California •\tResearch and development of NodeWiz, a Peer-to-Peer and fault-tolerant resource discovery system \n•\tJava, RMI, Jabber event-based communication, PlanetLab Visiting Scholar - Intern Hewlett-Packard Laboratories September 2006  –  November 2006  (3 months) Palo Alto, California •\tResearch and development of NodeWiz, a Peer-to-Peer and fault-tolerant resource discovery system \n•\tJava, RMI, Jabber event-based communication, PlanetLab Network Administrator CEFET/AL (current Instituto Federal de Educação, Ciência e Tecnologia de Alagoas) March 1999  –  December 1999  (10 months) Maceió Area, Brazil •\tSystem and network administration of CEFET’s Laboratories \n•\tLinux, Windows NT Network Administrator CEFET/AL (current Instituto Federal de Educação, Ciência e Tecnologia de Alagoas) March 1999  –  December 1999  (10 months) Maceió Area, Brazil •\tSystem and network administration of CEFET’s Laboratories \n•\tLinux, Windows NT Languages English Full professional proficiency Portuguese Native or bilingual proficiency English Full professional proficiency Portuguese Native or bilingual proficiency English Full professional proficiency Portuguese Native or bilingual proficiency Full professional proficiency Native or bilingual proficiency Skills Distributed Systems Eclipse Java Shell Scripting Linux Grid Computing TCP/IP RMI Peer-to-peer Computer Science Algorithms Machine Learning Python Software Engineering Parallel Computing C++ C LaTeX Bash Programming Software Development PostgreSQL Data Mining See 8+     See less Skills  Distributed Systems Eclipse Java Shell Scripting Linux Grid Computing TCP/IP RMI Peer-to-peer Computer Science Algorithms Machine Learning Python Software Engineering Parallel Computing C++ C LaTeX Bash Programming Software Development PostgreSQL Data Mining See 8+     See less Distributed Systems Eclipse Java Shell Scripting Linux Grid Computing TCP/IP RMI Peer-to-peer Computer Science Algorithms Machine Learning Python Software Engineering Parallel Computing C++ C LaTeX Bash Programming Software Development PostgreSQL Data Mining See 8+     See less Distributed Systems Eclipse Java Shell Scripting Linux Grid Computing TCP/IP RMI Peer-to-peer Computer Science Algorithms Machine Learning Python Software Engineering Parallel Computing C++ C LaTeX Bash Programming Software Development PostgreSQL Data Mining See 8+     See less Education The University of British Columbia PhD,  Electrical and Computer Engineering 2008  – 2014 I've recently finished my PhD in Electrical and Computer Engineering at the University of British Columbia. My advisor was Matei Ripeanu, and I worked in the NetSysLab.  \n \nMy research focused on automating the configuration of intermediate storage systems.  \nI was also involved in the Totem project (Graph Processing in Hybrid Architectures). Activities and Societies:  Totem -- Graph processing on heterogeneous CPU and GPU platforms http://netsyslab.ece.ubc.ca/wiki/index.php/Totem\nMosaStore -- Storage system integrating contributory storage http://netsyslab.ece.ubc.ca/wiki/index.php/MosaStore Universidade Federal de Campina Grande (UFCG) M.Sc.,  Computer Science 2004  – 2005 Activities and Societies:  http://www.ourgrid.org Universidade Federal de Campina Grande (UFCG) BS,  Computer Science 2000  – 2003 Professor Átila Augusto Freitas de Almeida Award \nFor best academic performances among graduates of Technology and Science Center from Federal University \nof Campina Grande - CCT / UFCG Activities and Societies:  http://ourgrid.org Centro Federal de Educação Tecnológica de Alagoas Technical,  Computer Science 1996  – 1999 The University of British Columbia PhD,  Electrical and Computer Engineering 2008  – 2014 I've recently finished my PhD in Electrical and Computer Engineering at the University of British Columbia. My advisor was Matei Ripeanu, and I worked in the NetSysLab.  \n \nMy research focused on automating the configuration of intermediate storage systems.  \nI was also involved in the Totem project (Graph Processing in Hybrid Architectures). Activities and Societies:  Totem -- Graph processing on heterogeneous CPU and GPU platforms http://netsyslab.ece.ubc.ca/wiki/index.php/Totem\nMosaStore -- Storage system integrating contributory storage http://netsyslab.ece.ubc.ca/wiki/index.php/MosaStore The University of British Columbia PhD,  Electrical and Computer Engineering 2008  – 2014 I've recently finished my PhD in Electrical and Computer Engineering at the University of British Columbia. My advisor was Matei Ripeanu, and I worked in the NetSysLab.  \n \nMy research focused on automating the configuration of intermediate storage systems.  \nI was also involved in the Totem project (Graph Processing in Hybrid Architectures). Activities and Societies:  Totem -- Graph processing on heterogeneous CPU and GPU platforms http://netsyslab.ece.ubc.ca/wiki/index.php/Totem\nMosaStore -- Storage system integrating contributory storage http://netsyslab.ece.ubc.ca/wiki/index.php/MosaStore The University of British Columbia PhD,  Electrical and Computer Engineering 2008  – 2014 I've recently finished my PhD in Electrical and Computer Engineering at the University of British Columbia. My advisor was Matei Ripeanu, and I worked in the NetSysLab.  \n \nMy research focused on automating the configuration of intermediate storage systems.  \nI was also involved in the Totem project (Graph Processing in Hybrid Architectures). Activities and Societies:  Totem -- Graph processing on heterogeneous CPU and GPU platforms http://netsyslab.ece.ubc.ca/wiki/index.php/Totem\nMosaStore -- Storage system integrating contributory storage http://netsyslab.ece.ubc.ca/wiki/index.php/MosaStore Universidade Federal de Campina Grande (UFCG) M.Sc.,  Computer Science 2004  – 2005 Activities and Societies:  http://www.ourgrid.org Universidade Federal de Campina Grande (UFCG) M.Sc.,  Computer Science 2004  – 2005 Activities and Societies:  http://www.ourgrid.org Universidade Federal de Campina Grande (UFCG) M.Sc.,  Computer Science 2004  – 2005 Activities and Societies:  http://www.ourgrid.org Universidade Federal de Campina Grande (UFCG) BS,  Computer Science 2000  – 2003 Professor Átila Augusto Freitas de Almeida Award \nFor best academic performances among graduates of Technology and Science Center from Federal University \nof Campina Grande - CCT / UFCG Activities and Societies:  http://ourgrid.org Universidade Federal de Campina Grande (UFCG) BS,  Computer Science 2000  – 2003 Professor Átila Augusto Freitas de Almeida Award \nFor best academic performances among graduates of Technology and Science Center from Federal University \nof Campina Grande - CCT / UFCG Activities and Societies:  http://ourgrid.org Universidade Federal de Campina Grande (UFCG) BS,  Computer Science 2000  – 2003 Professor Átila Augusto Freitas de Almeida Award \nFor best academic performances among graduates of Technology and Science Center from Federal University \nof Campina Grande - CCT / UFCG Activities and Societies:  http://ourgrid.org Centro Federal de Educação Tecnológica de Alagoas Technical,  Computer Science 1996  – 1999 Centro Federal de Educação Tecnológica de Alagoas Technical,  Computer Science 1996  – 1999 Centro Federal de Educação Tecnológica de Alagoas Technical,  Computer Science 1996  – 1999 Honors & Awards Fulbright International Science and Technology Award Fulbright To support PhD studies in the USA. \nDeclined to start at UBC. Additional Honors & Awards Professor Átila Augusto Freitas de Almeida Award \nSecond best academic performance of Technology and Sciences Center of Federal University of Campina Grande - CCT / UFCG Fulbright International Science and Technology Award Fulbright To support PhD studies in the USA. \nDeclined to start at UBC. Fulbright International Science and Technology Award Fulbright To support PhD studies in the USA. \nDeclined to start at UBC. Fulbright International Science and Technology Award Fulbright To support PhD studies in the USA. \nDeclined to start at UBC. Additional Honors & Awards Professor Átila Augusto Freitas de Almeida Award \nSecond best academic performance of Technology and Sciences Center of Federal University of Campina Grande - CCT / UFCG Additional Honors & Awards Professor Átila Augusto Freitas de Almeida Award \nSecond best academic performance of Technology and Sciences Center of Federal University of Campina Grande - CCT / UFCG Additional Honors & Awards Professor Átila Augusto Freitas de Almeida Award \nSecond best academic performance of Technology and Sciences Center of Federal University of Campina Grande - CCT / UFCG ", "Summary Hi there. I'm Grant, a web evangelist and University of Washington student majoring in computer science and minoring mathematics. \n \nI love making beautiful user experiences and tackling algorithmic challenges. I'm particularly skilled at building robust web applications (frontend and backend) and am pursuing skills in native mobile development. \n \nInterning at Google this summer on the Developer Platform team. Previous internship include Sift Science, LinkedIn, Tableau Software and Nor1 (nor1.com). \n \nDefinitely check out my website and Github! \n[website]: http://www.grant.cm \n[Github]: https://github.com/grant \n \nContact me about summer internships, side projects, and coffee opportunities :D Summary Hi there. I'm Grant, a web evangelist and University of Washington student majoring in computer science and minoring mathematics. \n \nI love making beautiful user experiences and tackling algorithmic challenges. I'm particularly skilled at building robust web applications (frontend and backend) and am pursuing skills in native mobile development. \n \nInterning at Google this summer on the Developer Platform team. Previous internship include Sift Science, LinkedIn, Tableau Software and Nor1 (nor1.com). \n \nDefinitely check out my website and Github! \n[website]: http://www.grant.cm \n[Github]: https://github.com/grant \n \nContact me about summer internships, side projects, and coffee opportunities :D Hi there. I'm Grant, a web evangelist and University of Washington student majoring in computer science and minoring mathematics. \n \nI love making beautiful user experiences and tackling algorithmic challenges. I'm particularly skilled at building robust web applications (frontend and backend) and am pursuing skills in native mobile development. \n \nInterning at Google this summer on the Developer Platform team. Previous internship include Sift Science, LinkedIn, Tableau Software and Nor1 (nor1.com). \n \nDefinitely check out my website and Github! \n[website]: http://www.grant.cm \n[Github]: https://github.com/grant \n \nContact me about summer internships, side projects, and coffee opportunities :D Hi there. I'm Grant, a web evangelist and University of Washington student majoring in computer science and minoring mathematics. \n \nI love making beautiful user experiences and tackling algorithmic challenges. I'm particularly skilled at building robust web applications (frontend and backend) and am pursuing skills in native mobile development. \n \nInterning at Google this summer on the Developer Platform team. Previous internship include Sift Science, LinkedIn, Tableau Software and Nor1 (nor1.com). \n \nDefinitely check out my website and Github! \n[website]: http://www.grant.cm \n[Github]: https://github.com/grant \n \nContact me about summer internships, side projects, and coffee opportunities :D Experience Software Engineer Intern Google June 2015  – Present (3 months) Mountain View Joining the Android Developer Platform team this summer working on the APIs for wear, auto, tv, cast, nest, wallet etc. Software Engineer Intern Sift Science January 2015  –  March 2015  (3 months) San Francisco, California Built historical Sift scores visualization, feature gating/pricing changes backend and frontend, and redesigned user details page for Sift Science's console. (Java, Maven, HBase, React, SCSS, D3) Software Engineer Intern LinkedIn June 2014  –  September 2014  (4 months) Mountain View, CA Built the server-side infrastructure for internationalizing skills on LinkedIn, allowing recruiters to search for skilled professionals around the world independent of their language. The skills feature affects over 60 million page views per month and 320+ million members. (Java, Kafka, Avro, Rest.li) Facebook Open Academy - Socket.IO Facebook January 2014  –  June 2014  (6 months) Menlo Park, CA Hand-picked to contribute to Facebook’s open-sourced projects as a part of Facebook’s Open Academy Program. \n \nCreated Socket.IO's official example app. \n \nSocket.IO Chat: https://cloudup.com/cMrYoTieM0c \nLive demo: http://socket.io/demos/chat/ Software Engineer Intern Tableau Software June 2013  –  September 2013  (4 months) Seattle, WA Enhanced Tableau’s big data visualization software with two flagship features (see projects). Software Engineer Intern Nor1 June 2012  –  September 2012  (4 months) Sunnyvale Built comprehensive web applications doing both front-end and back-end development. Game Developer Kongregate November 2008  –  November 2011  (3 years 1 month) Professional Flash game developer. Software Engineer Intern Google June 2015  – Present (3 months) Mountain View Joining the Android Developer Platform team this summer working on the APIs for wear, auto, tv, cast, nest, wallet etc. Software Engineer Intern Google June 2015  – Present (3 months) Mountain View Joining the Android Developer Platform team this summer working on the APIs for wear, auto, tv, cast, nest, wallet etc. Software Engineer Intern Sift Science January 2015  –  March 2015  (3 months) San Francisco, California Built historical Sift scores visualization, feature gating/pricing changes backend and frontend, and redesigned user details page for Sift Science's console. (Java, Maven, HBase, React, SCSS, D3) Software Engineer Intern Sift Science January 2015  –  March 2015  (3 months) San Francisco, California Built historical Sift scores visualization, feature gating/pricing changes backend and frontend, and redesigned user details page for Sift Science's console. (Java, Maven, HBase, React, SCSS, D3) Software Engineer Intern LinkedIn June 2014  –  September 2014  (4 months) Mountain View, CA Built the server-side infrastructure for internationalizing skills on LinkedIn, allowing recruiters to search for skilled professionals around the world independent of their language. The skills feature affects over 60 million page views per month and 320+ million members. (Java, Kafka, Avro, Rest.li) Software Engineer Intern LinkedIn June 2014  –  September 2014  (4 months) Mountain View, CA Built the server-side infrastructure for internationalizing skills on LinkedIn, allowing recruiters to search for skilled professionals around the world independent of their language. The skills feature affects over 60 million page views per month and 320+ million members. (Java, Kafka, Avro, Rest.li) Facebook Open Academy - Socket.IO Facebook January 2014  –  June 2014  (6 months) Menlo Park, CA Hand-picked to contribute to Facebook’s open-sourced projects as a part of Facebook’s Open Academy Program. \n \nCreated Socket.IO's official example app. \n \nSocket.IO Chat: https://cloudup.com/cMrYoTieM0c \nLive demo: http://socket.io/demos/chat/ Facebook Open Academy - Socket.IO Facebook January 2014  –  June 2014  (6 months) Menlo Park, CA Hand-picked to contribute to Facebook’s open-sourced projects as a part of Facebook’s Open Academy Program. \n \nCreated Socket.IO's official example app. \n \nSocket.IO Chat: https://cloudup.com/cMrYoTieM0c \nLive demo: http://socket.io/demos/chat/ Software Engineer Intern Tableau Software June 2013  –  September 2013  (4 months) Seattle, WA Enhanced Tableau’s big data visualization software with two flagship features (see projects). Software Engineer Intern Tableau Software June 2013  –  September 2013  (4 months) Seattle, WA Enhanced Tableau’s big data visualization software with two flagship features (see projects). Software Engineer Intern Nor1 June 2012  –  September 2012  (4 months) Sunnyvale Built comprehensive web applications doing both front-end and back-end development. Software Engineer Intern Nor1 June 2012  –  September 2012  (4 months) Sunnyvale Built comprehensive web applications doing both front-end and back-end development. Game Developer Kongregate November 2008  –  November 2011  (3 years 1 month) Professional Flash game developer. Game Developer Kongregate November 2008  –  November 2011  (3 years 1 month) Professional Flash game developer. Languages Chinese Professional working proficiency English Native or bilingual proficiency French Elementary proficiency Chinese Professional working proficiency English Native or bilingual proficiency French Elementary proficiency Chinese Professional working proficiency English Native or bilingual proficiency French Elementary proficiency Professional working proficiency Native or bilingual proficiency Elementary proficiency Skills CSS jQuery JavaScript HTML Java Python Web Applications jQueryUI MySQL Node Django MongoDB C# Git Mathematica Bash Subversion Front-end Swift CoffeeScript Dance Web Development See 7+     See less Skills  CSS jQuery JavaScript HTML Java Python Web Applications jQueryUI MySQL Node Django MongoDB C# Git Mathematica Bash Subversion Front-end Swift CoffeeScript Dance Web Development See 7+     See less CSS jQuery JavaScript HTML Java Python Web Applications jQueryUI MySQL Node Django MongoDB C# Git Mathematica Bash Subversion Front-end Swift CoffeeScript Dance Web Development See 7+     See less CSS jQuery JavaScript HTML Java Python Web Applications jQueryUI MySQL Node Django MongoDB C# Git Mathematica Bash Subversion Front-end Swift CoffeeScript Dance Web Development See 7+     See less Education University of Washington Bachelor of Science (BS),  Computer Science , Mathematics 2012  – 2016 Saint Francis High School High School Diploma 2007  – 2012 Activities and Societies:  Yearbook Editor in Chief ,  President of the Science and Engineering Club ,  Club Soccer Player ,  Freelance web and game developer University of Washington Bachelor of Science (BS),  Computer Science , Mathematics 2012  – 2016 University of Washington Bachelor of Science (BS),  Computer Science , Mathematics 2012  – 2016 University of Washington Bachelor of Science (BS),  Computer Science , Mathematics 2012  – 2016 Saint Francis High School High School Diploma 2007  – 2012 Activities and Societies:  Yearbook Editor in Chief ,  President of the Science and Engineering Club ,  Club Soccer Player ,  Freelance web and game developer Saint Francis High School High School Diploma 2007  – 2012 Activities and Societies:  Yearbook Editor in Chief ,  President of the Science and Engineering Club ,  Club Soccer Player ,  Freelance web and game developer Saint Francis High School High School Diploma 2007  – 2012 Activities and Societies:  Yearbook Editor in Chief ,  President of the Science and Engineering Club ,  Club Soccer Player ,  Freelance web and game developer Honors & Awards Dean's List University of Washington 2012-2014 Dean's List Software Entrepreneurship: Hell Night Winner University of Washington November 2013 1st place winner of Hell Night: a pitching competition among 20 teams in two software entrepreneurship classes. \n \nSee more information about the class at: \nhttps://ugradnews.cs.washington.edu/2013/09/09/software-entrepreneurship-entre-432-cse490b/ Peter Thiel Summiter Peter Thiel Foundation November 2014 Chosen as a visionary entrepreneur and given travel to attend the Peter Thiel Summit in Fall 2014. Additional Honors & Awards Google Games -- 2nd place (2014) Dean's List University of Washington 2012-2014 Dean's List Dean's List University of Washington 2012-2014 Dean's List Dean's List University of Washington 2012-2014 Dean's List Software Entrepreneurship: Hell Night Winner University of Washington November 2013 1st place winner of Hell Night: a pitching competition among 20 teams in two software entrepreneurship classes. \n \nSee more information about the class at: \nhttps://ugradnews.cs.washington.edu/2013/09/09/software-entrepreneurship-entre-432-cse490b/ Software Entrepreneurship: Hell Night Winner University of Washington November 2013 1st place winner of Hell Night: a pitching competition among 20 teams in two software entrepreneurship classes. \n \nSee more information about the class at: \nhttps://ugradnews.cs.washington.edu/2013/09/09/software-entrepreneurship-entre-432-cse490b/ Software Entrepreneurship: Hell Night Winner University of Washington November 2013 1st place winner of Hell Night: a pitching competition among 20 teams in two software entrepreneurship classes. \n \nSee more information about the class at: \nhttps://ugradnews.cs.washington.edu/2013/09/09/software-entrepreneurship-entre-432-cse490b/ Peter Thiel Summiter Peter Thiel Foundation November 2014 Chosen as a visionary entrepreneur and given travel to attend the Peter Thiel Summit in Fall 2014. Peter Thiel Summiter Peter Thiel Foundation November 2014 Chosen as a visionary entrepreneur and given travel to attend the Peter Thiel Summit in Fall 2014. Peter Thiel Summiter Peter Thiel Foundation November 2014 Chosen as a visionary entrepreneur and given travel to attend the Peter Thiel Summit in Fall 2014. Additional Honors & Awards Google Games -- 2nd place (2014) Additional Honors & Awards Google Games -- 2nd place (2014) Additional Honors & Awards Google Games -- 2nd place (2014) ", "Experience Software Engineer Intern Google July 2015  – Present (2 months) Zürich, Switzerland Working on internal testing infrastructure. Junior Software Developer INSOFT Development & Consulting December 2014  –  June 2015  (7 months) Bucharest, Romania Conducted research for Bachelor's thesis on computer vision. Software Engineer Intern Google July 2014  –  October 2014  (4 months) Zürich, Switzerland Interned in the Google Calendar team; worked on the new Google Calendar client for Android. Software Engineer Intern Google July 2015  – Present (2 months) Zürich, Switzerland Working on internal testing infrastructure. Software Engineer Intern Google July 2015  – Present (2 months) Zürich, Switzerland Working on internal testing infrastructure. Junior Software Developer INSOFT Development & Consulting December 2014  –  June 2015  (7 months) Bucharest, Romania Conducted research for Bachelor's thesis on computer vision. Junior Software Developer INSOFT Development & Consulting December 2014  –  June 2015  (7 months) Bucharest, Romania Conducted research for Bachelor's thesis on computer vision. Software Engineer Intern Google July 2014  –  October 2014  (4 months) Zürich, Switzerland Interned in the Google Calendar team; worked on the new Google Calendar client for Android. Software Engineer Intern Google July 2014  –  October 2014  (4 months) Zürich, Switzerland Interned in the Google Calendar team; worked on the new Google Calendar client for Android. Languages English Professional working proficiency French Elementary proficiency English Professional working proficiency French Elementary proficiency English Professional working proficiency French Elementary proficiency Professional working proficiency Elementary proficiency Skills Programming C++ Java JavaScript Android Ruby on Rails Software Development C Software Engineering Computer Vision Skills  Programming C++ Java JavaScript Android Ruby on Rails Software Development C Software Engineering Computer Vision Programming C++ Java JavaScript Android Ruby on Rails Software Development C Software Engineering Computer Vision Programming C++ Java JavaScript Android Ruby on Rails Software Development C Software Engineering Computer Vision Education Eidgenössische Technische Hochschule Zürich Master’s Degree,  Computer Science 2015  – 2017 Facultatea de Matematică și Informatică, Universitatea din București Bachelor’s Degree,  Computer Science , 9.45 / 10.00 2012  – 2015 Eidgenössische Technische Hochschule Zürich Master’s Degree,  Computer Science 2015  – 2017 Eidgenössische Technische Hochschule Zürich Master’s Degree,  Computer Science 2015  – 2017 Eidgenössische Technische Hochschule Zürich Master’s Degree,  Computer Science 2015  – 2017 Facultatea de Matematică și Informatică, Universitatea din București Bachelor’s Degree,  Computer Science , 9.45 / 10.00 2012  – 2015 Facultatea de Matematică și Informatică, Universitatea din București Bachelor’s Degree,  Computer Science , 9.45 / 10.00 2012  – 2015 Facultatea de Matematică și Informatică, Universitatea din București Bachelor’s Degree,  Computer Science , 9.45 / 10.00 2012  – 2015 ", "Experience Software Engineer in Research Google August 2013  – Present (2 years 1 month) Mountain View PhD student Stanford University September 2008  – Present (7 years) Adviser: Tim Roughgarden.  \n \nResearch in Algorithmic Game Theory, Combinatorial Optimization, Approximation Algorithms. Research Intern Google October 2012  –  January 2013  (4 months) Research on targeting in display ads. Research Intern Microsoft June 2012  –  September 2012  (4 months) Mountain View Research in online algorithms and algorithmic game theory Software Engineering Intern 2011 Google June 2011  –  September 2011  (4 months) Mountain View Worked with the ads backend on data analysis and product design. Software Engineer Intern 2008 Google May 2008  –  August 2008  (4 months) Software Development in Python, Statistical Data Modeling. Teaching Assistant Duke University August 2004  –  May 2008  (3 years 10 months) Worked as a Teaching Assistant for various Mathematics and Computer Science courses including Calculus, Abstract Algebra, Analysis, Software Design And Implementation, Algorithms Software Engineer Intern Google May 2007  –  August 2007  (4 months) Software development in Java. Software Engineer in Research Google August 2013  – Present (2 years 1 month) Mountain View Software Engineer in Research Google August 2013  – Present (2 years 1 month) Mountain View PhD student Stanford University September 2008  – Present (7 years) Adviser: Tim Roughgarden.  \n \nResearch in Algorithmic Game Theory, Combinatorial Optimization, Approximation Algorithms. PhD student Stanford University September 2008  – Present (7 years) Adviser: Tim Roughgarden.  \n \nResearch in Algorithmic Game Theory, Combinatorial Optimization, Approximation Algorithms. Research Intern Google October 2012  –  January 2013  (4 months) Research on targeting in display ads. Research Intern Google October 2012  –  January 2013  (4 months) Research on targeting in display ads. Research Intern Microsoft June 2012  –  September 2012  (4 months) Mountain View Research in online algorithms and algorithmic game theory Research Intern Microsoft June 2012  –  September 2012  (4 months) Mountain View Research in online algorithms and algorithmic game theory Software Engineering Intern 2011 Google June 2011  –  September 2011  (4 months) Mountain View Worked with the ads backend on data analysis and product design. Software Engineering Intern 2011 Google June 2011  –  September 2011  (4 months) Mountain View Worked with the ads backend on data analysis and product design. Software Engineer Intern 2008 Google May 2008  –  August 2008  (4 months) Software Development in Python, Statistical Data Modeling. Software Engineer Intern 2008 Google May 2008  –  August 2008  (4 months) Software Development in Python, Statistical Data Modeling. Teaching Assistant Duke University August 2004  –  May 2008  (3 years 10 months) Worked as a Teaching Assistant for various Mathematics and Computer Science courses including Calculus, Abstract Algebra, Analysis, Software Design And Implementation, Algorithms Teaching Assistant Duke University August 2004  –  May 2008  (3 years 10 months) Worked as a Teaching Assistant for various Mathematics and Computer Science courses including Calculus, Abstract Algebra, Analysis, Software Design And Implementation, Algorithms Software Engineer Intern Google May 2007  –  August 2007  (4 months) Software development in Java. Software Engineer Intern Google May 2007  –  August 2007  (4 months) Software development in Java. Languages Marathi Native or bilingual proficiency English Full professional proficiency Hindi Professional working proficiency Marathi Native or bilingual proficiency English Full professional proficiency Hindi Professional working proficiency Marathi Native or bilingual proficiency English Full professional proficiency Hindi Professional working proficiency Native or bilingual proficiency Full professional proficiency Professional working proficiency Skills Algorithms Algorithmic Game Theory Mathematics Game Theory Matlab C++ MapReduce Java LaTeX Skills  Algorithms Algorithmic Game Theory Mathematics Game Theory Matlab C++ MapReduce Java LaTeX Algorithms Algorithmic Game Theory Mathematics Game Theory Matlab C++ MapReduce Java LaTeX Algorithms Algorithmic Game Theory Mathematics Game Theory Matlab C++ MapReduce Java LaTeX Education Stanford University Ph.D.,  Computer Science 2008  – 2013 Activities and Societies:  Women in Computer Science ,  Theory Reading Group Duke University BS,  Mathematics and Computer Science 2004  – 2008 Activities and Societies:  Duke University Math Union(DUMU) ,  Programming Team ,  Math Team Jnana Prabodhini High School 1995  – 2002 Stanford University Ph.D.,  Computer Science 2008  – 2013 Activities and Societies:  Women in Computer Science ,  Theory Reading Group Stanford University Ph.D.,  Computer Science 2008  – 2013 Activities and Societies:  Women in Computer Science ,  Theory Reading Group Stanford University Ph.D.,  Computer Science 2008  – 2013 Activities and Societies:  Women in Computer Science ,  Theory Reading Group Duke University BS,  Mathematics and Computer Science 2004  – 2008 Activities and Societies:  Duke University Math Union(DUMU) ,  Programming Team ,  Math Team Duke University BS,  Mathematics and Computer Science 2004  – 2008 Activities and Societies:  Duke University Math Union(DUMU) ,  Programming Team ,  Math Team Duke University BS,  Mathematics and Computer Science 2004  – 2008 Activities and Societies:  Duke University Math Union(DUMU) ,  Programming Team ,  Math Team Jnana Prabodhini High School 1995  – 2002 Jnana Prabodhini High School 1995  – 2002 Jnana Prabodhini High School 1995  – 2002 Honors & Awards Additional Honors & Awards ACM ICPC World Finals 2005, 2006 - Honorable Mention \nWilliam Lowell Putnam Math Competition 2004-2006, top 5% \nSilver Medal at International Mathematics Olympiad 2004. Additional Honors & Awards ACM ICPC World Finals 2005, 2006 - Honorable Mention \nWilliam Lowell Putnam Math Competition 2004-2006, top 5% \nSilver Medal at International Mathematics Olympiad 2004. Additional Honors & Awards ACM ICPC World Finals 2005, 2006 - Honorable Mention \nWilliam Lowell Putnam Math Competition 2004-2006, top 5% \nSilver Medal at International Mathematics Olympiad 2004. Additional Honors & Awards ACM ICPC World Finals 2005, 2006 - Honorable Mention \nWilliam Lowell Putnam Math Competition 2004-2006, top 5% \nSilver Medal at International Mathematics Olympiad 2004. ", "Experience Software Engineer Google July 2013  – Present (2 years 2 months) Mountain View, CA Software Engineer Intern Google May 2012  – Present (3 years 4 months) Mountain View, CA Student Campus Ambassador Google July 2012  –  May 2013  (11 months) Lawrence, Kansas Area Research Assitant University of Kansas School of Engineering January 2010  –  May 2012  (2 years 5 months) Lawrence, Kansas Area Software Engineer Intern Cerner Corporation June 2011  –  July 2011  (2 months) Kansas City, Missouri Area Worked with Cerner Health on maintenance and feature enhancement. Student Webmaster University of Kansas Libraries March 2010  –  May 2011  (1 year 3 months) Worked with office staff to update and maintain the University of Kansas Libraries websites. Webmaster Bradley Paper August 2008  –  October 2010  (2 years 3 months) Production Worker Bradley Paper November 2006  –  May 2007  (7 months) Software Engineer Google July 2013  – Present (2 years 2 months) Mountain View, CA Software Engineer Google July 2013  – Present (2 years 2 months) Mountain View, CA Software Engineer Intern Google May 2012  – Present (3 years 4 months) Mountain View, CA Software Engineer Intern Google May 2012  – Present (3 years 4 months) Mountain View, CA Student Campus Ambassador Google July 2012  –  May 2013  (11 months) Lawrence, Kansas Area Student Campus Ambassador Google July 2012  –  May 2013  (11 months) Lawrence, Kansas Area Research Assitant University of Kansas School of Engineering January 2010  –  May 2012  (2 years 5 months) Lawrence, Kansas Area Research Assitant University of Kansas School of Engineering January 2010  –  May 2012  (2 years 5 months) Lawrence, Kansas Area Software Engineer Intern Cerner Corporation June 2011  –  July 2011  (2 months) Kansas City, Missouri Area Worked with Cerner Health on maintenance and feature enhancement. Software Engineer Intern Cerner Corporation June 2011  –  July 2011  (2 months) Kansas City, Missouri Area Worked with Cerner Health on maintenance and feature enhancement. Student Webmaster University of Kansas Libraries March 2010  –  May 2011  (1 year 3 months) Worked with office staff to update and maintain the University of Kansas Libraries websites. Student Webmaster University of Kansas Libraries March 2010  –  May 2011  (1 year 3 months) Worked with office staff to update and maintain the University of Kansas Libraries websites. Webmaster Bradley Paper August 2008  –  October 2010  (2 years 3 months) Webmaster Bradley Paper August 2008  –  October 2010  (2 years 3 months) Production Worker Bradley Paper November 2006  –  May 2007  (7 months) Production Worker Bradley Paper November 2006  –  May 2007  (7 months) Skills PHP Django Python CSS Java C++ WordPress Linux HTML Scheme Skills  PHP Django Python CSS Java C++ WordPress Linux HTML Scheme PHP Django Python CSS Java C++ WordPress Linux HTML Scheme PHP Django Python CSS Java C++ WordPress Linux HTML Scheme Education University of Kansas BS,  Computer Engineering 2009  – 2013 Activities and Societies:  Delta Tau Delta\nEta Kappa Nu University of Kansas BS,  Computer Engineering 2009  – 2013 Activities and Societies:  Delta Tau Delta\nEta Kappa Nu University of Kansas BS,  Computer Engineering 2009  – 2013 Activities and Societies:  Delta Tau Delta\nEta Kappa Nu University of Kansas BS,  Computer Engineering 2009  – 2013 Activities and Societies:  Delta Tau Delta\nEta Kappa Nu ", "Experience Software Engineer Google Inc August 2009  – Present (6 years 1 month) Software Engineer Intern for Google Datapush Google Inc September 2008  –  December 2008  (4 months) Software Engineer Intern for Google Datapush Google Inc January 2008  –  April 2008  (4 months) Software Engineer Intern for Google Finance Google Inc May 2007  –  August 2007  (4 months) Software Developer TD Canada Trust September 2006  –  December 2006  (4 months) Software Developer Research In Motion 2004  –  2005  (1 year) Software Engineer Google Inc August 2009  – Present (6 years 1 month) Software Engineer Google Inc August 2009  – Present (6 years 1 month) Software Engineer Intern for Google Datapush Google Inc September 2008  –  December 2008  (4 months) Software Engineer Intern for Google Datapush Google Inc September 2008  –  December 2008  (4 months) Software Engineer Intern for Google Datapush Google Inc January 2008  –  April 2008  (4 months) Software Engineer Intern for Google Datapush Google Inc January 2008  –  April 2008  (4 months) Software Engineer Intern for Google Finance Google Inc May 2007  –  August 2007  (4 months) Software Engineer Intern for Google Finance Google Inc May 2007  –  August 2007  (4 months) Software Developer TD Canada Trust September 2006  –  December 2006  (4 months) Software Developer TD Canada Trust September 2006  –  December 2006  (4 months) Software Developer Research In Motion 2004  –  2005  (1 year) Software Developer Research In Motion 2004  –  2005  (1 year) Skills Python JavaScript Software Development Software Engineering Agile Methodologies Data Mining C++ MapReduce C Algorithms Test Driven Development Distributed Systems Java Bash SQL HTML See 1+     See less Skills  Python JavaScript Software Development Software Engineering Agile Methodologies Data Mining C++ MapReduce C Algorithms Test Driven Development Distributed Systems Java Bash SQL HTML See 1+     See less Python JavaScript Software Development Software Engineering Agile Methodologies Data Mining C++ MapReduce C Algorithms Test Driven Development Distributed Systems Java Bash SQL HTML See 1+     See less Python JavaScript Software Development Software Engineering Agile Methodologies Data Mining C++ MapReduce C Algorithms Test Driven Development Distributed Systems Java Bash SQL HTML See 1+     See less Education University of Waterloo Honours BSE 2004  – 2009 Loyola University of Waterloo Honours BSE 2004  – 2009 University of Waterloo Honours BSE 2004  – 2009 University of Waterloo Honours BSE 2004  – 2009 Loyola Loyola Loyola ", "Summary I want to be a software engineer in Web back-end area. I've take three times Google internship in year 2006, year 2007 and year 2009's summers. \n \nI‘ve got 2nd place at 2005 ACM/ICPC Asia in Chengdu and  \n9th place at 2005 ACM/ICPC Asia in Hangzhou Specialties:Data structure, algorithm Summary I want to be a software engineer in Web back-end area. I've take three times Google internship in year 2006, year 2007 and year 2009's summers. \n \nI‘ve got 2nd place at 2005 ACM/ICPC Asia in Chengdu and  \n9th place at 2005 ACM/ICPC Asia in Hangzhou Specialties:Data structure, algorithm I want to be a software engineer in Web back-end area. I've take three times Google internship in year 2006, year 2007 and year 2009's summers. \n \nI‘ve got 2nd place at 2005 ACM/ICPC Asia in Chengdu and  \n9th place at 2005 ACM/ICPC Asia in Hangzhou Specialties:Data structure, algorithm I want to be a software engineer in Web back-end area. I've take three times Google internship in year 2006, year 2007 and year 2009's summers. \n \nI‘ve got 2nd place at 2005 ACM/ICPC Asia in Chengdu and  \n9th place at 2005 ACM/ICPC Asia in Hangzhou Specialties:Data structure, algorithm Experience Software Engineer Google January 2011  – Present (4 years 8 months) Software Engineer Baidu, Inc. February 2010  –  November 2010  (10 months) I worked in context ads team in Baidu, and wrote program about data parse and PLSI Software Engineer Intern eBay October 2009  –  December 2009  (3 months) Software Engineer Intern Google July 2009  –  September 2009  (3 months) Software Engineer Intern Google July 2007  –  August 2007  (2 months) Software Engineer Intern Google July 2006  –  August 2006  (2 months) Software Engineer Google January 2011  – Present (4 years 8 months) Software Engineer Google January 2011  – Present (4 years 8 months) Software Engineer Baidu, Inc. February 2010  –  November 2010  (10 months) I worked in context ads team in Baidu, and wrote program about data parse and PLSI Software Engineer Baidu, Inc. February 2010  –  November 2010  (10 months) I worked in context ads team in Baidu, and wrote program about data parse and PLSI Software Engineer Intern eBay October 2009  –  December 2009  (3 months) Software Engineer Intern eBay October 2009  –  December 2009  (3 months) Software Engineer Intern Google July 2009  –  September 2009  (3 months) Software Engineer Intern Google July 2009  –  September 2009  (3 months) Software Engineer Intern Google July 2007  –  August 2007  (2 months) Software Engineer Intern Google July 2007  –  August 2007  (2 months) Software Engineer Intern Google July 2006  –  August 2006  (2 months) Software Engineer Intern Google July 2006  –  August 2006  (2 months) Skills Algorithms Distributed Systems Python MapReduce C++ Software Engineering Java Scalability Computer Science Linux C JavaScript Data Structures Information Retrieval Git Data Mining See 1+     See less Skills  Algorithms Distributed Systems Python MapReduce C++ Software Engineering Java Scalability Computer Science Linux C JavaScript Data Structures Information Retrieval Git Data Mining See 1+     See less Algorithms Distributed Systems Python MapReduce C++ Software Engineering Java Scalability Computer Science Linux C JavaScript Data Structures Information Retrieval Git Data Mining See 1+     See less Algorithms Distributed Systems Python MapReduce C++ Software Engineering Java Scalability Computer Science Linux C JavaScript Data Structures Information Retrieval Git Data Mining See 1+     See less Education Shanghai Jiao Tong University master,  Computer Science 2003  – 2010 Second High School Affiliated to East China Normal University High school 2000  – 2003 primary scool Shanghai Jiao Tong University master,  Computer Science 2003  – 2010 Shanghai Jiao Tong University master,  Computer Science 2003  – 2010 Shanghai Jiao Tong University master,  Computer Science 2003  – 2010 Second High School Affiliated to East China Normal University High school 2000  – 2003 Second High School Affiliated to East China Normal University High school 2000  – 2003 Second High School Affiliated to East China Normal University High school 2000  – 2003 primary scool primary scool primary scool ", "Experience Software Engineer Intern Google June 2015  – Present (3 months) Design, create, and improve front-end user experience for search \nClean and maintain team code Lead Web Developer, Server Engineer Fru1tStudios 2010  – Present (5 years) Pioneering experimental web application technologies \nMaintaining server hardware and software infrastructure Software Engineer Revenue Management Systems, Inc. September 2014  –  March 2015  (7 months) Built components to automate mundane processes \nCollaborated and composed web-based internal tools and dashboards \nDeveloped modern, responsive, and dynamic web pages Software Engineer Intern Google June 2014  –  September 2014  (4 months) Mountainview, California Developed tools and utilities that enhanced usability and reliability to internal systems Software Engineer Intern Google June 2015  – Present (3 months) Design, create, and improve front-end user experience for search \nClean and maintain team code Software Engineer Intern Google June 2015  – Present (3 months) Design, create, and improve front-end user experience for search \nClean and maintain team code Lead Web Developer, Server Engineer Fru1tStudios 2010  – Present (5 years) Pioneering experimental web application technologies \nMaintaining server hardware and software infrastructure Lead Web Developer, Server Engineer Fru1tStudios 2010  – Present (5 years) Pioneering experimental web application technologies \nMaintaining server hardware and software infrastructure Software Engineer Revenue Management Systems, Inc. September 2014  –  March 2015  (7 months) Built components to automate mundane processes \nCollaborated and composed web-based internal tools and dashboards \nDeveloped modern, responsive, and dynamic web pages Software Engineer Revenue Management Systems, Inc. September 2014  –  March 2015  (7 months) Built components to automate mundane processes \nCollaborated and composed web-based internal tools and dashboards \nDeveloped modern, responsive, and dynamic web pages Software Engineer Intern Google June 2014  –  September 2014  (4 months) Mountainview, California Developed tools and utilities that enhanced usability and reliability to internal systems Software Engineer Intern Google June 2014  –  September 2014  (4 months) Mountainview, California Developed tools and utilities that enhanced usability and reliability to internal systems Languages English English English Skills Web Development PHP SQL Java JavaScript CSS HTML Photoshop Linux HTML5 CSS3 MySQL SASS Dynamic Websites Eclipse Git Ubuntu Relational Databases See 3+     See less Skills  Web Development PHP SQL Java JavaScript CSS HTML Photoshop Linux HTML5 CSS3 MySQL SASS Dynamic Websites Eclipse Git Ubuntu Relational Databases See 3+     See less Web Development PHP SQL Java JavaScript CSS HTML Photoshop Linux HTML5 CSS3 MySQL SASS Dynamic Websites Eclipse Git Ubuntu Relational Databases See 3+     See less Web Development PHP SQL Java JavaScript CSS HTML Photoshop Linux HTML5 CSS3 MySQL SASS Dynamic Websites Eclipse Git Ubuntu Relational Databases See 3+     See less Education University of Washington Computer and Information Sciences , General 2013  – 2017 Mercer Island High School 2009  – 2013 University of Washington Computer and Information Sciences , General 2013  – 2017 University of Washington Computer and Information Sciences , General 2013  – 2017 University of Washington Computer and Information Sciences , General 2013  – 2017 Mercer Island High School 2009  – 2013 Mercer Island High School 2009  – 2013 Mercer Island High School 2009  – 2013 Honors & Awards Eagle Scout Boy Scouts of America August 2013 Eagle Scout Boy Scouts of America August 2013 Eagle Scout Boy Scouts of America August 2013 Eagle Scout Boy Scouts of America August 2013 ", "Summary I'm a Computer Science student. Always seeking to be unique and trying my best to be. I'm eager to learn new things, work on different projects, get into new topics and subjects. Summary I'm a Computer Science student. Always seeking to be unique and trying my best to be. I'm eager to learn new things, work on different projects, get into new topics and subjects. I'm a Computer Science student. Always seeking to be unique and trying my best to be. I'm eager to learn new things, work on different projects, get into new topics and subjects. I'm a Computer Science student. Always seeking to be unique and trying my best to be. I'm eager to learn new things, work on different projects, get into new topics and subjects. Experience Software Engineer Intern Google June 2015  – Present (3 months) Mountain View, CA Software Engineer Intern Google June 2014  –  September 2014  (4 months) Kraków Area, Poland Worked on Google Coupons Management System Infrastructure for AdWords, Cloud and Enterprise. \nTechnologies: Java, Guice, Dart, AngularDart, Protocol Buffers, RPC, jUnit, Mockito. \n Software Engineer Intern Google June 2015  – Present (3 months) Mountain View, CA Software Engineer Intern Google June 2015  – Present (3 months) Mountain View, CA Software Engineer Intern Google June 2014  –  September 2014  (4 months) Kraków Area, Poland Worked on Google Coupons Management System Infrastructure for AdWords, Cloud and Enterprise. \nTechnologies: Java, Guice, Dart, AngularDart, Protocol Buffers, RPC, jUnit, Mockito. \n Software Engineer Intern Google June 2014  –  September 2014  (4 months) Kraków Area, Poland Worked on Google Coupons Management System Infrastructure for AdWords, Cloud and Enterprise. \nTechnologies: Java, Guice, Dart, AngularDart, Protocol Buffers, RPC, jUnit, Mockito. \n Languages Arabic Native or bilingual proficiency English Professional working proficiency Arabic Native or bilingual proficiency English Professional working proficiency Arabic Native or bilingual proficiency English Professional working proficiency Native or bilingual proficiency Professional working proficiency Skills C++ Java OOP Fundraising Blogging Research Problem Solving Programming Visual C# HTML Programming Language... Git Object Oriented Design Dart AngularDart Computer Science JavaScript C# Algorithms Data Structures See 5+     See less Skills  C++ Java OOP Fundraising Blogging Research Problem Solving Programming Visual C# HTML Programming Language... Git Object Oriented Design Dart AngularDart Computer Science JavaScript C# Algorithms Data Structures See 5+     See less C++ Java OOP Fundraising Blogging Research Problem Solving Programming Visual C# HTML Programming Language... Git Object Oriented Design Dart AngularDart Computer Science JavaScript C# Algorithms Data Structures See 5+     See less C++ Java OOP Fundraising Blogging Research Problem Solving Programming Visual C# HTML Programming Language... Git Object Oriented Design Dart AngularDart Computer Science JavaScript C# Algorithms Data Structures See 5+     See less Education Faculty of Computer and Information Science, Ain Shams University Bachelor's Degree,  Computer Science , Excellent 2012  – 2016 Faculty of Computer and Information Science, Ain Shams University Bachelor's Degree,  Computer Science , Excellent 2012  – 2016 Faculty of Computer and Information Science, Ain Shams University Bachelor's Degree,  Computer Science , Excellent 2012  – 2016 Faculty of Computer and Information Science, Ain Shams University Bachelor's Degree,  Computer Science , Excellent 2012  – 2016 Honors & Awards ", "Skills Machine Learning Software Engineering C Distributed Systems Computer Science Scalability JavaScript Linux Software Development Algorithms Python Java C++ Object Oriented Design Git Bash Software Design See 2+     See less Skills  Machine Learning Software Engineering C Distributed Systems Computer Science Scalability JavaScript Linux Software Development Algorithms Python Java C++ Object Oriented Design Git Bash Software Design See 2+     See less Machine Learning Software Engineering C Distributed Systems Computer Science Scalability JavaScript Linux Software Development Algorithms Python Java C++ Object Oriented Design Git Bash Software Design See 2+     See less Machine Learning Software Engineering C Distributed Systems Computer Science Scalability JavaScript Linux Software Development Algorithms Python Java C++ Object Oriented Design Git Bash Software Design See 2+     See less Honors & Awards ", "Experience Software Engineer Intern Google June 2015  – Present (3 months) Mountain View Software Engineer Intern Google June 2014  –  September 2014  (4 months) Greater New York City Area Software Engineer Intern Google July 2011  –  September 2011  (3 months) Zurich Software Engineer Intern Google June 2010  –  October 2010  (5 months) London, United Kingdom Undergraduate Research Assistant Imperial College London June 2009  –  September 2009  (4 months) London Software Engineer Intern Google June 2015  – Present (3 months) Mountain View Software Engineer Intern Google June 2015  – Present (3 months) Mountain View Software Engineer Intern Google June 2014  –  September 2014  (4 months) Greater New York City Area Software Engineer Intern Google June 2014  –  September 2014  (4 months) Greater New York City Area Software Engineer Intern Google July 2011  –  September 2011  (3 months) Zurich Software Engineer Intern Google July 2011  –  September 2011  (3 months) Zurich Software Engineer Intern Google June 2010  –  October 2010  (5 months) London, United Kingdom Software Engineer Intern Google June 2010  –  October 2010  (5 months) London, United Kingdom Undergraduate Research Assistant Imperial College London June 2009  –  September 2009  (4 months) London Undergraduate Research Assistant Imperial College London June 2009  –  September 2009  (4 months) London Languages English Full professional proficiency German Native or bilingual proficiency French Elementary proficiency Spanish Elementary proficiency English Full professional proficiency German Native or bilingual proficiency French Elementary proficiency Spanish Elementary proficiency English Full professional proficiency German Native or bilingual proficiency French Elementary proficiency Spanish Elementary proficiency Full professional proficiency Native or bilingual proficiency Elementary proficiency Elementary proficiency Skills C++ Python Matlab Java Haskell LaTeX Git Linux SQL Software Engineering Computer Science Algorithms Programming Software Development Machine Learning Skills  C++ Python Matlab Java Haskell LaTeX Git Linux SQL Software Engineering Computer Science Algorithms Programming Software Development Machine Learning C++ Python Matlab Java Haskell LaTeX Git Linux SQL Software Engineering Computer Science Algorithms Programming Software Development Machine Learning C++ Python Matlab Java Haskell LaTeX Git Linux SQL Software Engineering Computer Science Algorithms Programming Software Development Machine Learning Education University of Cambridge Doctor of Philosophy (Ph.D.),  Computer Science 2012  – 2016 University of Oxford MSc,  Mathematics and the Foundations of Computer Science , Distinction 2011  – 2012 Imperial College London BSc,  Mathematics and Computer Science , First Class 2008  – 2011 University of Cambridge Doctor of Philosophy (Ph.D.),  Computer Science 2012  – 2016 University of Cambridge Doctor of Philosophy (Ph.D.),  Computer Science 2012  – 2016 University of Cambridge Doctor of Philosophy (Ph.D.),  Computer Science 2012  – 2016 University of Oxford MSc,  Mathematics and the Foundations of Computer Science , Distinction 2011  – 2012 University of Oxford MSc,  Mathematics and the Foundations of Computer Science , Distinction 2011  – 2012 University of Oxford MSc,  Mathematics and the Foundations of Computer Science , Distinction 2011  – 2012 Imperial College London BSc,  Mathematics and Computer Science , First Class 2008  – 2011 Imperial College London BSc,  Mathematics and Computer Science , First Class 2008  – 2011 Imperial College London BSc,  Mathematics and Computer Science , First Class 2008  – 2011 ", "Summary Currently Developer Programs Engineer at Google - Developer Platforms Engineering. \nPreviously worked as a Java web applications Software Engineer at the French Space Agency and Airbus. \n \nDomains I've worked on: \nScientific Research, E-Commerce, Web APIs, Enterprise, Cloud Storage, Internet Ads, Programming Languages, Developer Platforms. Summary Currently Developer Programs Engineer at Google - Developer Platforms Engineering. \nPreviously worked as a Java web applications Software Engineer at the French Space Agency and Airbus. \n \nDomains I've worked on: \nScientific Research, E-Commerce, Web APIs, Enterprise, Cloud Storage, Internet Ads, Programming Languages, Developer Platforms. Currently Developer Programs Engineer at Google - Developer Platforms Engineering. \nPreviously worked as a Java web applications Software Engineer at the French Space Agency and Airbus. \n \nDomains I've worked on: \nScientific Research, E-Commerce, Web APIs, Enterprise, Cloud Storage, Internet Ads, Programming Languages, Developer Platforms. Currently Developer Programs Engineer at Google - Developer Platforms Engineering. \nPreviously worked as a Java web applications Software Engineer at the French Space Agency and Airbus. \n \nDomains I've worked on: \nScientific Research, E-Commerce, Web APIs, Enterprise, Cloud Storage, Internet Ads, Programming Languages, Developer Platforms. Experience Senior Developer Programs Engineer Google September 2014  – Present (1 year) Zürich Area, Switzerland Developer Programs Engineer on Google Developer Platforms: Android, Chrome \n \nResponsibilities: \n \n• Write sample code and client libraries and contribute to open source projects. \n• Build strong ecosystem for developer products by blogging, writing technical articles, making presentations at developer conferences and working with local developer communities. \n• Work with product engineering teams to improve developer products by conveying feedback from developers, reviewing API designs and testing new features. Senior Developer Advocate Google August 2010  –  September 2014  (4 years 2 months) Zürich Area, Switzerland Developer Advocate on GMail, Google Drive, OAuth and Open ID Connect. \n \nResponsibilities: \n \n• Create momentum and drive the success of Google’s developer products and the open web through your interactions with third party developers building applications and businesses on them. \n• Advocate the adoption of Google developer products to strategic partners and the broader developer community. \n• Participate in technical and design discussions with technical executives at strategic partners to speed adoption and ensure best practices during implementation. \n• Evangelize our developer products in person and online by presenting at conferences, blogging, writing technical tutorials, and other similar activities. \n• Advocate for developers internally, and influence Google developer product strategy by working with Product Management, Engineering, PR, Marketing, Business Development, and other cross-functional teams. Developer Programs Engineer Google August 2008  –  August 2010  (2 years 1 month) Ireland My main achievements in this role are: \n \n• Tech Lead and co-founder of an SMB website builder platform used in developing countries (e.g. http://signup.kbo.co.ke/signup) - Now deprecated \n• Worked on Google client libraries: Contacts, Calendar, Checkout \n• Lead and implemented a number of projects and experiments: \n    ‣ Shopping Buddy Chrome extension \n    ‣ Checkout Click to buy ads \n    ‣ Youtube click to buy ads \n    ‣ Paid Support System prototype \n    ‣ Meeting Scheduler Android application prototype \n• Built Google checkout buy now buttons and Donate buttons integration with Google sites \n• Added Gadget Ads support to the Gadget API library for GWT \n• Wrote numerous sample code, technical articles and technical blog posts to showcase Google APIs. \n• Wrote part of the public technical documentation and troubleshooting articles for Google Checkout API, Tasks API, Calendar API and Contacts API \n• Assisted third-party developers in troubleshooting their integrations with Google Web APIs and use of Google developer products through 1:1 emails and through the public technical forums \n• Local developer community outreach: Bootstrapped the Dublin and the Zurich GTUG and Staffed Google IO 2010 \n• Internally advocated bugs and feature requests from external developers to the Engineering team and participate in API design Software Engineer Centre National d'Études Spatiales May 2006  –  May 2008  (2 years 1 month) Toulouse Area, France Worked on multiple Database driven web applications: \n \n- EcoChange: European project wich goal is to improve modelling approaches used to assess the impact of global change on biodiversity and ecosystems. \nIn charge of knowledge dissemination, I developped a SPIP based website and a data storing/retreiving web application. \nTechs. : Java, Spring, Spring-MVC, Spip \n \n- African Pollen Database: Continued development, see my intership at the CNES for details. \n \n- LDAP Admin: Generic user managment interface. Allow to easily configure and manage LDAP user accounts. \nTechs. : Java, Spring, Spring-MVC, SQL, LDAP, AJAX, Junit Software Engineer Airbus July 2005  –  May 2006  (11 months) Toulouse Area, France Developper at Airbus - SWD2 \nProject AXP - Adoc XSL Publisher \n \nWorked on a Technical ATA Documentation generator \n \nIn details it is an XSL-FO transformer written in Java using TeX for page identation. \nIt uses XSLT stylesheets to transform ATA SGML data to XSL-FO documents. \nThen XSL-FO documents are transformed to viewable HTML or PDF documents. \n \nATA : Air Transport Association. \n \nTechnologies : Java, C, XSL-T, XSL-FO, TeX, Shell, Junit Software Engineer Intern Centre National d'Études Spatiales February 2005  –  July 2005  (6 months) Toulouse Area, France End of studies Internship at the French Space Agency \n \nDevelopment of the African Pollen Database Project. \nWeb based application used to view pollen rates in Africa over a large period of time. Used for long term climatic modeling. \n \nTechnologies : Java + Struts (JSP/Servlets/J2EE) + awt, HTML, Javascript, Tomcat + Apache, Ant, Shell, Awk, SQL (PostGreSQL), UML, LateX, C, Script CGI, Linux, AJAX Software Engineer Intern Iveco - IrisBus July 2004  –  August 2004  (2 months) Lyon Area, France Webapp developpement \n \nMigration/Re-development and evolution of the Chemical Products acceptance workflow software. \n \nMigration of the datas from the former/obsolete Mainframe application to a LotusNotes web application. \n \nTechnologies : LotusNotes + HTML + javascript Software Engineer Iveco - Heuliez Bus July 2002  –  August 2002  (2 months) Nantes Area, France Web application development \n \nImplementation of an interface used to follow the development of buses and view the list of spare parts of buses. \n \nTechnologies : WorkManager Web (CoCreate), HTML, Javascript, SQL (Oracle). Senior Developer Programs Engineer Google September 2014  – Present (1 year) Zürich Area, Switzerland Developer Programs Engineer on Google Developer Platforms: Android, Chrome \n \nResponsibilities: \n \n• Write sample code and client libraries and contribute to open source projects. \n• Build strong ecosystem for developer products by blogging, writing technical articles, making presentations at developer conferences and working with local developer communities. \n• Work with product engineering teams to improve developer products by conveying feedback from developers, reviewing API designs and testing new features. Senior Developer Programs Engineer Google September 2014  – Present (1 year) Zürich Area, Switzerland Developer Programs Engineer on Google Developer Platforms: Android, Chrome \n \nResponsibilities: \n \n• Write sample code and client libraries and contribute to open source projects. \n• Build strong ecosystem for developer products by blogging, writing technical articles, making presentations at developer conferences and working with local developer communities. \n• Work with product engineering teams to improve developer products by conveying feedback from developers, reviewing API designs and testing new features. Senior Developer Advocate Google August 2010  –  September 2014  (4 years 2 months) Zürich Area, Switzerland Developer Advocate on GMail, Google Drive, OAuth and Open ID Connect. \n \nResponsibilities: \n \n• Create momentum and drive the success of Google’s developer products and the open web through your interactions with third party developers building applications and businesses on them. \n• Advocate the adoption of Google developer products to strategic partners and the broader developer community. \n• Participate in technical and design discussions with technical executives at strategic partners to speed adoption and ensure best practices during implementation. \n• Evangelize our developer products in person and online by presenting at conferences, blogging, writing technical tutorials, and other similar activities. \n• Advocate for developers internally, and influence Google developer product strategy by working with Product Management, Engineering, PR, Marketing, Business Development, and other cross-functional teams. Senior Developer Advocate Google August 2010  –  September 2014  (4 years 2 months) Zürich Area, Switzerland Developer Advocate on GMail, Google Drive, OAuth and Open ID Connect. \n \nResponsibilities: \n \n• Create momentum and drive the success of Google’s developer products and the open web through your interactions with third party developers building applications and businesses on them. \n• Advocate the adoption of Google developer products to strategic partners and the broader developer community. \n• Participate in technical and design discussions with technical executives at strategic partners to speed adoption and ensure best practices during implementation. \n• Evangelize our developer products in person and online by presenting at conferences, blogging, writing technical tutorials, and other similar activities. \n• Advocate for developers internally, and influence Google developer product strategy by working with Product Management, Engineering, PR, Marketing, Business Development, and other cross-functional teams. Developer Programs Engineer Google August 2008  –  August 2010  (2 years 1 month) Ireland My main achievements in this role are: \n \n• Tech Lead and co-founder of an SMB website builder platform used in developing countries (e.g. http://signup.kbo.co.ke/signup) - Now deprecated \n• Worked on Google client libraries: Contacts, Calendar, Checkout \n• Lead and implemented a number of projects and experiments: \n    ‣ Shopping Buddy Chrome extension \n    ‣ Checkout Click to buy ads \n    ‣ Youtube click to buy ads \n    ‣ Paid Support System prototype \n    ‣ Meeting Scheduler Android application prototype \n• Built Google checkout buy now buttons and Donate buttons integration with Google sites \n• Added Gadget Ads support to the Gadget API library for GWT \n• Wrote numerous sample code, technical articles and technical blog posts to showcase Google APIs. \n• Wrote part of the public technical documentation and troubleshooting articles for Google Checkout API, Tasks API, Calendar API and Contacts API \n• Assisted third-party developers in troubleshooting their integrations with Google Web APIs and use of Google developer products through 1:1 emails and through the public technical forums \n• Local developer community outreach: Bootstrapped the Dublin and the Zurich GTUG and Staffed Google IO 2010 \n• Internally advocated bugs and feature requests from external developers to the Engineering team and participate in API design Developer Programs Engineer Google August 2008  –  August 2010  (2 years 1 month) Ireland My main achievements in this role are: \n \n• Tech Lead and co-founder of an SMB website builder platform used in developing countries (e.g. http://signup.kbo.co.ke/signup) - Now deprecated \n• Worked on Google client libraries: Contacts, Calendar, Checkout \n• Lead and implemented a number of projects and experiments: \n    ‣ Shopping Buddy Chrome extension \n    ‣ Checkout Click to buy ads \n    ‣ Youtube click to buy ads \n    ‣ Paid Support System prototype \n    ‣ Meeting Scheduler Android application prototype \n• Built Google checkout buy now buttons and Donate buttons integration with Google sites \n• Added Gadget Ads support to the Gadget API library for GWT \n• Wrote numerous sample code, technical articles and technical blog posts to showcase Google APIs. \n• Wrote part of the public technical documentation and troubleshooting articles for Google Checkout API, Tasks API, Calendar API and Contacts API \n• Assisted third-party developers in troubleshooting their integrations with Google Web APIs and use of Google developer products through 1:1 emails and through the public technical forums \n• Local developer community outreach: Bootstrapped the Dublin and the Zurich GTUG and Staffed Google IO 2010 \n• Internally advocated bugs and feature requests from external developers to the Engineering team and participate in API design Software Engineer Centre National d'Études Spatiales May 2006  –  May 2008  (2 years 1 month) Toulouse Area, France Worked on multiple Database driven web applications: \n \n- EcoChange: European project wich goal is to improve modelling approaches used to assess the impact of global change on biodiversity and ecosystems. \nIn charge of knowledge dissemination, I developped a SPIP based website and a data storing/retreiving web application. \nTechs. : Java, Spring, Spring-MVC, Spip \n \n- African Pollen Database: Continued development, see my intership at the CNES for details. \n \n- LDAP Admin: Generic user managment interface. Allow to easily configure and manage LDAP user accounts. \nTechs. : Java, Spring, Spring-MVC, SQL, LDAP, AJAX, Junit Software Engineer Centre National d'Études Spatiales May 2006  –  May 2008  (2 years 1 month) Toulouse Area, France Worked on multiple Database driven web applications: \n \n- EcoChange: European project wich goal is to improve modelling approaches used to assess the impact of global change on biodiversity and ecosystems. \nIn charge of knowledge dissemination, I developped a SPIP based website and a data storing/retreiving web application. \nTechs. : Java, Spring, Spring-MVC, Spip \n \n- African Pollen Database: Continued development, see my intership at the CNES for details. \n \n- LDAP Admin: Generic user managment interface. Allow to easily configure and manage LDAP user accounts. \nTechs. : Java, Spring, Spring-MVC, SQL, LDAP, AJAX, Junit Software Engineer Airbus July 2005  –  May 2006  (11 months) Toulouse Area, France Developper at Airbus - SWD2 \nProject AXP - Adoc XSL Publisher \n \nWorked on a Technical ATA Documentation generator \n \nIn details it is an XSL-FO transformer written in Java using TeX for page identation. \nIt uses XSLT stylesheets to transform ATA SGML data to XSL-FO documents. \nThen XSL-FO documents are transformed to viewable HTML or PDF documents. \n \nATA : Air Transport Association. \n \nTechnologies : Java, C, XSL-T, XSL-FO, TeX, Shell, Junit Software Engineer Airbus July 2005  –  May 2006  (11 months) Toulouse Area, France Developper at Airbus - SWD2 \nProject AXP - Adoc XSL Publisher \n \nWorked on a Technical ATA Documentation generator \n \nIn details it is an XSL-FO transformer written in Java using TeX for page identation. \nIt uses XSLT stylesheets to transform ATA SGML data to XSL-FO documents. \nThen XSL-FO documents are transformed to viewable HTML or PDF documents. \n \nATA : Air Transport Association. \n \nTechnologies : Java, C, XSL-T, XSL-FO, TeX, Shell, Junit Software Engineer Intern Centre National d'Études Spatiales February 2005  –  July 2005  (6 months) Toulouse Area, France End of studies Internship at the French Space Agency \n \nDevelopment of the African Pollen Database Project. \nWeb based application used to view pollen rates in Africa over a large period of time. Used for long term climatic modeling. \n \nTechnologies : Java + Struts (JSP/Servlets/J2EE) + awt, HTML, Javascript, Tomcat + Apache, Ant, Shell, Awk, SQL (PostGreSQL), UML, LateX, C, Script CGI, Linux, AJAX Software Engineer Intern Centre National d'Études Spatiales February 2005  –  July 2005  (6 months) Toulouse Area, France End of studies Internship at the French Space Agency \n \nDevelopment of the African Pollen Database Project. \nWeb based application used to view pollen rates in Africa over a large period of time. Used for long term climatic modeling. \n \nTechnologies : Java + Struts (JSP/Servlets/J2EE) + awt, HTML, Javascript, Tomcat + Apache, Ant, Shell, Awk, SQL (PostGreSQL), UML, LateX, C, Script CGI, Linux, AJAX Software Engineer Intern Iveco - IrisBus July 2004  –  August 2004  (2 months) Lyon Area, France Webapp developpement \n \nMigration/Re-development and evolution of the Chemical Products acceptance workflow software. \n \nMigration of the datas from the former/obsolete Mainframe application to a LotusNotes web application. \n \nTechnologies : LotusNotes + HTML + javascript Software Engineer Intern Iveco - IrisBus July 2004  –  August 2004  (2 months) Lyon Area, France Webapp developpement \n \nMigration/Re-development and evolution of the Chemical Products acceptance workflow software. \n \nMigration of the datas from the former/obsolete Mainframe application to a LotusNotes web application. \n \nTechnologies : LotusNotes + HTML + javascript Software Engineer Iveco - Heuliez Bus July 2002  –  August 2002  (2 months) Nantes Area, France Web application development \n \nImplementation of an interface used to follow the development of buses and view the list of spare parts of buses. \n \nTechnologies : WorkManager Web (CoCreate), HTML, Javascript, SQL (Oracle). Software Engineer Iveco - Heuliez Bus July 2002  –  August 2002  (2 months) Nantes Area, France Web application development \n \nImplementation of an interface used to follow the development of buses and view the list of spare parts of buses. \n \nTechnologies : WorkManager Web (CoCreate), HTML, Javascript, SQL (Oracle). Languages English Native or bilingual proficiency French Native or bilingual proficiency German Elementary proficiency English Native or bilingual proficiency French Native or bilingual proficiency German Elementary proficiency English Native or bilingual proficiency French Native or bilingual proficiency German Elementary proficiency Native or bilingual proficiency Native or bilingual proficiency Elementary proficiency Skills Spring GWT Java AJAX JUnit Struts SQL HTML XSLT JavaScript E-commerce Guice Eclipse Tomcat J2EE Subversion Research Software Design Web Services PostgreSQL XML Software Engineering Computer Science jQuery JSP Linux MySQL Open Source Python SOA Maven CSS Distributed Systems Design Patterns Web 2.0 Ant REST Software Development LDAP Android Hibernate Spring Webflow Google App Engine Cloud Storage OAuth OpenID OAuth 2.0 UML Databases See 34+     See less Skills  Spring GWT Java AJAX JUnit Struts SQL HTML XSLT JavaScript E-commerce Guice Eclipse Tomcat J2EE Subversion Research Software Design Web Services PostgreSQL XML Software Engineering Computer Science jQuery JSP Linux MySQL Open Source Python SOA Maven CSS Distributed Systems Design Patterns Web 2.0 Ant REST Software Development LDAP Android Hibernate Spring Webflow Google App Engine Cloud Storage OAuth OpenID OAuth 2.0 UML Databases See 34+     See less Spring GWT Java AJAX JUnit Struts SQL HTML XSLT JavaScript E-commerce Guice Eclipse Tomcat J2EE Subversion Research Software Design Web Services PostgreSQL XML Software Engineering Computer Science jQuery JSP Linux MySQL Open Source Python SOA Maven CSS Distributed Systems Design Patterns Web 2.0 Ant REST Software Development LDAP Android Hibernate Spring Webflow Google App Engine Cloud Storage OAuth OpenID OAuth 2.0 UML Databases See 34+     See less Spring GWT Java AJAX JUnit Struts SQL HTML XSLT JavaScript E-commerce Guice Eclipse Tomcat J2EE Subversion Research Software Design Web Services PostgreSQL XML Software Engineering Computer Science jQuery JSP Linux MySQL Open Source Python SOA Maven CSS Distributed Systems Design Patterns Web 2.0 Ant REST Software Development LDAP Android Hibernate Spring Webflow Google App Engine Cloud Storage OAuth OpenID OAuth 2.0 UML Databases See 34+     See less Education Institut national des Sciences appliquées de Rennes Ingénieur / MSc,  Computer Sciences 2000  – 2005 Overseas Studies Program : 1 semester at the Université de Montréal - Quebec, Canada Activities and Societies:  Ice Hockey team (Manager) ,  Handball team (Goalie) ,  Yearly Ski trip (Organizer) Lycée Saint Gabriel Baccalauréat Scientifique,  General with focus on hard sciences 1997  – 2000 With Honours - Mention Bien \nSpecialty: Mathematic \nOption: Computer Science \nOverseas Studies Program : 1 year at the Putnam High School - Putnam, CT, USA Institut national des Sciences appliquées de Rennes Ingénieur / MSc,  Computer Sciences 2000  – 2005 Overseas Studies Program : 1 semester at the Université de Montréal - Quebec, Canada Activities and Societies:  Ice Hockey team (Manager) ,  Handball team (Goalie) ,  Yearly Ski trip (Organizer) Institut national des Sciences appliquées de Rennes Ingénieur / MSc,  Computer Sciences 2000  – 2005 Overseas Studies Program : 1 semester at the Université de Montréal - Quebec, Canada Activities and Societies:  Ice Hockey team (Manager) ,  Handball team (Goalie) ,  Yearly Ski trip (Organizer) Institut national des Sciences appliquées de Rennes Ingénieur / MSc,  Computer Sciences 2000  – 2005 Overseas Studies Program : 1 semester at the Université de Montréal - Quebec, Canada Activities and Societies:  Ice Hockey team (Manager) ,  Handball team (Goalie) ,  Yearly Ski trip (Organizer) Lycée Saint Gabriel Baccalauréat Scientifique,  General with focus on hard sciences 1997  – 2000 With Honours - Mention Bien \nSpecialty: Mathematic \nOption: Computer Science \nOverseas Studies Program : 1 year at the Putnam High School - Putnam, CT, USA Lycée Saint Gabriel Baccalauréat Scientifique,  General with focus on hard sciences 1997  – 2000 With Honours - Mention Bien \nSpecialty: Mathematic \nOption: Computer Science \nOverseas Studies Program : 1 year at the Putnam High School - Putnam, CT, USA Lycée Saint Gabriel Baccalauréat Scientifique,  General with focus on hard sciences 1997  – 2000 With Honours - Mention Bien \nSpecialty: Mathematic \nOption: Computer Science \nOverseas Studies Program : 1 year at the Putnam High School - Putnam, CT, USA ", "Summary (Jamie Kerns) Summary (Jamie Kerns) (Jamie Kerns) (Jamie Kerns) Experience Senior Staff Software Engineer Google November 2014  – Present (10 months) Greater Los Angeles Area Engineering Manager and Technical Lead for YouTube Ad Formats and Brand Ad Formats in Los Angeles. \n- Manager of 39 locally. \n- Advisor to the Google Video Network formats team. \n- Mobile Brand and TrueView Ads on YouTube, GVN, AdMob and GDN. \n- TrueView for App Promotion, Shopping Senior Staff Software Engineer YouTube June 2008  – Present (7 years 3 months) Working on Video Ads and Brand Ads in Los Angeles. Technical lead and Engineering Manager for YouTube Ad Formats and Brand Ad Formats in Los Angeles. Staff Software Engineer Google November 2012  –  November 2014  (2 years 1 month) Greater Los Angeles Area Technical lead and Engineering Manager for YouTube Ad Formats and Brand Ad Formats in Los Angeles. \n- Manager of 26 locally. \n- Technical Lead and advisor to the Google Video Network formats team. \n- Mobile Brand and TrueView Ads on YouTube, GVN, AdMob and GDN. \n- TrueView for App Promotion. \n- Scaling across platforms and screens. Senior Software Engineer Google May 2011  –  November 2012  (1 year 7 months) Greater Los Angeles Area Technical lead for AdSense for Interactive Media / YouTube Ad formats. \n- TrueView formats, including Skippable ad formats \n- Cost-per-view bidding \n- Expansion of Google Video Network \n- Interactive Media Ads SDKs \n- YouTube Homepage Ads \n- TrueView Engagement Detection \n- Contributor to IAB VAST3, VPAID 2 and VMAP 1.0. Author of VAST3 XSD. \n- Leading team of 8 with additional resources remotely. Software Engineer III Google May 2009  –  May 2011  (2 years 1 month) Greater Los Angeles Area Technical lead for AdSense for Interactive Media / YouTube Ad formats. \n- TrueView formats, including skippable ad formats \n- Cost-per-view bidding \n- Interactive Media Ads SDKs \n- Led team of 4. Software Engineer II Google June 2008  –  May 2009  (1 year) San Bruno Member of YouTube Ad Formats team. \n- Primary developer on YouTube homepage monetization. Developer White Ink February 2005  –  June 2008  (3 years 5 months) Designing miscellaneous multimedia products ranging from photo applications to full websites. Software Engineer Intern Google May 2007  –  August 2007  (4 months) Worked on an unreleased mobile project. Intern Mentor Graphics June 2006  –  August 2006  (3 months) Senior Staff Software Engineer Google November 2014  – Present (10 months) Greater Los Angeles Area Engineering Manager and Technical Lead for YouTube Ad Formats and Brand Ad Formats in Los Angeles. \n- Manager of 39 locally. \n- Advisor to the Google Video Network formats team. \n- Mobile Brand and TrueView Ads on YouTube, GVN, AdMob and GDN. \n- TrueView for App Promotion, Shopping Senior Staff Software Engineer Google November 2014  – Present (10 months) Greater Los Angeles Area Engineering Manager and Technical Lead for YouTube Ad Formats and Brand Ad Formats in Los Angeles. \n- Manager of 39 locally. \n- Advisor to the Google Video Network formats team. \n- Mobile Brand and TrueView Ads on YouTube, GVN, AdMob and GDN. \n- TrueView for App Promotion, Shopping Senior Staff Software Engineer YouTube June 2008  – Present (7 years 3 months) Working on Video Ads and Brand Ads in Los Angeles. Technical lead and Engineering Manager for YouTube Ad Formats and Brand Ad Formats in Los Angeles. Senior Staff Software Engineer YouTube June 2008  – Present (7 years 3 months) Working on Video Ads and Brand Ads in Los Angeles. Technical lead and Engineering Manager for YouTube Ad Formats and Brand Ad Formats in Los Angeles. Staff Software Engineer Google November 2012  –  November 2014  (2 years 1 month) Greater Los Angeles Area Technical lead and Engineering Manager for YouTube Ad Formats and Brand Ad Formats in Los Angeles. \n- Manager of 26 locally. \n- Technical Lead and advisor to the Google Video Network formats team. \n- Mobile Brand and TrueView Ads on YouTube, GVN, AdMob and GDN. \n- TrueView for App Promotion. \n- Scaling across platforms and screens. Staff Software Engineer Google November 2012  –  November 2014  (2 years 1 month) Greater Los Angeles Area Technical lead and Engineering Manager for YouTube Ad Formats and Brand Ad Formats in Los Angeles. \n- Manager of 26 locally. \n- Technical Lead and advisor to the Google Video Network formats team. \n- Mobile Brand and TrueView Ads on YouTube, GVN, AdMob and GDN. \n- TrueView for App Promotion. \n- Scaling across platforms and screens. Senior Software Engineer Google May 2011  –  November 2012  (1 year 7 months) Greater Los Angeles Area Technical lead for AdSense for Interactive Media / YouTube Ad formats. \n- TrueView formats, including Skippable ad formats \n- Cost-per-view bidding \n- Expansion of Google Video Network \n- Interactive Media Ads SDKs \n- YouTube Homepage Ads \n- TrueView Engagement Detection \n- Contributor to IAB VAST3, VPAID 2 and VMAP 1.0. Author of VAST3 XSD. \n- Leading team of 8 with additional resources remotely. Senior Software Engineer Google May 2011  –  November 2012  (1 year 7 months) Greater Los Angeles Area Technical lead for AdSense for Interactive Media / YouTube Ad formats. \n- TrueView formats, including Skippable ad formats \n- Cost-per-view bidding \n- Expansion of Google Video Network \n- Interactive Media Ads SDKs \n- YouTube Homepage Ads \n- TrueView Engagement Detection \n- Contributor to IAB VAST3, VPAID 2 and VMAP 1.0. Author of VAST3 XSD. \n- Leading team of 8 with additional resources remotely. Software Engineer III Google May 2009  –  May 2011  (2 years 1 month) Greater Los Angeles Area Technical lead for AdSense for Interactive Media / YouTube Ad formats. \n- TrueView formats, including skippable ad formats \n- Cost-per-view bidding \n- Interactive Media Ads SDKs \n- Led team of 4. Software Engineer III Google May 2009  –  May 2011  (2 years 1 month) Greater Los Angeles Area Technical lead for AdSense for Interactive Media / YouTube Ad formats. \n- TrueView formats, including skippable ad formats \n- Cost-per-view bidding \n- Interactive Media Ads SDKs \n- Led team of 4. Software Engineer II Google June 2008  –  May 2009  (1 year) San Bruno Member of YouTube Ad Formats team. \n- Primary developer on YouTube homepage monetization. Software Engineer II Google June 2008  –  May 2009  (1 year) San Bruno Member of YouTube Ad Formats team. \n- Primary developer on YouTube homepage monetization. Developer White Ink February 2005  –  June 2008  (3 years 5 months) Designing miscellaneous multimedia products ranging from photo applications to full websites. Developer White Ink February 2005  –  June 2008  (3 years 5 months) Designing miscellaneous multimedia products ranging from photo applications to full websites. Software Engineer Intern Google May 2007  –  August 2007  (4 months) Worked on an unreleased mobile project. Software Engineer Intern Google May 2007  –  August 2007  (4 months) Worked on an unreleased mobile project. Intern Mentor Graphics June 2006  –  August 2006  (3 months) Intern Mentor Graphics June 2006  –  August 2006  (3 months) Skills Python Software Engineering Advertising Mobile Devices Video User Experience Web Development YouTube Scalability MapReduce Git Skills  Python Software Engineering Advertising Mobile Devices Video User Experience Web Development YouTube Scalability MapReduce Git Python Software Engineering Advertising Mobile Devices Video User Experience Web Development YouTube Scalability MapReduce Git Python Software Engineering Advertising Mobile Devices Video User Experience Web Development YouTube Scalability MapReduce Git Education University of San Diego BS,  Computer Science 2004  – 2008 Graduated Magna Cum Laude \nMinors in Math and Business Administration Activities and Societies:  NSCS University of San Diego BS,  Computer Science 2004  – 2008 Graduated Magna Cum Laude \nMinors in Math and Business Administration Activities and Societies:  NSCS University of San Diego BS,  Computer Science 2004  – 2008 Graduated Magna Cum Laude \nMinors in Math and Business Administration Activities and Societies:  NSCS University of San Diego BS,  Computer Science 2004  – 2008 Graduated Magna Cum Laude \nMinors in Math and Business Administration Activities and Societies:  NSCS Honors & Awards Additional Honors & Awards Departmental Honors in Computer Science - May 2008 \nUSD's Dean's List 2004-2008 \n1 of 10 YouTube Unsung Hero Awards for 2013 \n50 Google Peer Bonuses - 2008-2015 \n1 Google OC Award 2010 \n12 Google Spot Bonuses 2010-2014 \n11 US Patent Applications 2011-2013 \n1 Granted US Patent 2015 \n11 US Patent Applications 2011-2015 Additional Honors & Awards Departmental Honors in Computer Science - May 2008 \nUSD's Dean's List 2004-2008 \n1 of 10 YouTube Unsung Hero Awards for 2013 \n50 Google Peer Bonuses - 2008-2015 \n1 Google OC Award 2010 \n12 Google Spot Bonuses 2010-2014 \n11 US Patent Applications 2011-2013 \n1 Granted US Patent 2015 \n11 US Patent Applications 2011-2015 Additional Honors & Awards Departmental Honors in Computer Science - May 2008 \nUSD's Dean's List 2004-2008 \n1 of 10 YouTube Unsung Hero Awards for 2013 \n50 Google Peer Bonuses - 2008-2015 \n1 Google OC Award 2010 \n12 Google Spot Bonuses 2010-2014 \n11 US Patent Applications 2011-2013 \n1 Granted US Patent 2015 \n11 US Patent Applications 2011-2015 Additional Honors & Awards Departmental Honors in Computer Science - May 2008 \nUSD's Dean's List 2004-2008 \n1 of 10 YouTube Unsung Hero Awards for 2013 \n50 Google Peer Bonuses - 2008-2015 \n1 Google OC Award 2010 \n12 Google Spot Bonuses 2010-2014 \n11 US Patent Applications 2011-2013 \n1 Granted US Patent 2015 \n11 US Patent Applications 2011-2015 ", "Experience Software Engineer Intern Google May 2015  – Present (4 months) San Francisco, CA Teaching Assistant Georgia Institute of Technology August 2013  – Present (2 years 1 month) Teaching weekly recitations, holding office hours during which students can get individual help, creating and grading assessments, writing unit tests used for grading homework Software Engineer Intern Google September 2014  –  December 2014  (4 months) San Francisco, CA Assistant Coach Fields Club Swim Team May 2009  –  August 2013  (4 years 4 months) Norcross, GA Managing other coaches' responsibilities and work schedules, working with the Head Coach to create practices and plan meets Software Engineer Intern Google May 2015  – Present (4 months) San Francisco, CA Software Engineer Intern Google May 2015  – Present (4 months) San Francisco, CA Teaching Assistant Georgia Institute of Technology August 2013  – Present (2 years 1 month) Teaching weekly recitations, holding office hours during which students can get individual help, creating and grading assessments, writing unit tests used for grading homework Teaching Assistant Georgia Institute of Technology August 2013  – Present (2 years 1 month) Teaching weekly recitations, holding office hours during which students can get individual help, creating and grading assessments, writing unit tests used for grading homework Software Engineer Intern Google September 2014  –  December 2014  (4 months) San Francisco, CA Software Engineer Intern Google September 2014  –  December 2014  (4 months) San Francisco, CA Assistant Coach Fields Club Swim Team May 2009  –  August 2013  (4 years 4 months) Norcross, GA Managing other coaches' responsibilities and work schedules, working with the Head Coach to create practices and plan meets Assistant Coach Fields Club Swim Team May 2009  –  August 2013  (4 years 4 months) Norcross, GA Managing other coaches' responsibilities and work schedules, working with the Head Coach to create practices and plan meets Languages French Limited working proficiency French Limited working proficiency French Limited working proficiency Limited working proficiency Skills Java Python Algorithms Data Structures Object Oriented Design UNIX Linux SQL HTML CSS Android Development Weka Skills  Java Python Algorithms Data Structures Object Oriented Design UNIX Linux SQL HTML CSS Android Development Weka Java Python Algorithms Data Structures Object Oriented Design UNIX Linux SQL HTML CSS Android Development Weka Java Python Algorithms Data Structures Object Oriented Design UNIX Linux SQL HTML CSS Android Development Weka Education Georgia Institute of Technology Bachelor of Science (BS),  Computer Science 2012  – 2016 Activities and Societies:  Sympathetic Vibrations ,  Programming Team Norcross High School 2008  – 2012 Georgia Institute of Technology Bachelor of Science (BS),  Computer Science 2012  – 2016 Activities and Societies:  Sympathetic Vibrations ,  Programming Team Georgia Institute of Technology Bachelor of Science (BS),  Computer Science 2012  – 2016 Activities and Societies:  Sympathetic Vibrations ,  Programming Team Georgia Institute of Technology Bachelor of Science (BS),  Computer Science 2012  – 2016 Activities and Societies:  Sympathetic Vibrations ,  Programming Team Norcross High School 2008  – 2012 Norcross High School 2008  – 2012 Norcross High School 2008  – 2012 ", "Summary Looking for job opportunities that improve my creativity and productivity and help me add value to my company. \n \nInterested in Building Software that is efficient, robust and extensible. \n \nSpecialties: Software Engineering, Software development, Computer Vision, Machine learning, Database development. Summary Looking for job opportunities that improve my creativity and productivity and help me add value to my company. \n \nInterested in Building Software that is efficient, robust and extensible. \n \nSpecialties: Software Engineering, Software development, Computer Vision, Machine learning, Database development. Looking for job opportunities that improve my creativity and productivity and help me add value to my company. \n \nInterested in Building Software that is efficient, robust and extensible. \n \nSpecialties: Software Engineering, Software development, Computer Vision, Machine learning, Database development. Looking for job opportunities that improve my creativity and productivity and help me add value to my company. \n \nInterested in Building Software that is efficient, robust and extensible. \n \nSpecialties: Software Engineering, Software development, Computer Vision, Machine learning, Database development. Experience Product Manager Google October 2014  – Present (11 months) San Francisco Bay Area Working with Google Cloud Platform on the developers' tools team as part of my Software Engineer to Product Manager rotation program. Software Engineer Google April 2012  – Present (3 years 5 months) San Francisco Bay Area Joined Google Maps working with the data engineering team. Our team is responsible for building and maintaining aerial and satellite imagery pipelines from data acquisition till it's published. \n \nTechnologies used: Python, C++, Java, and Internal Google technologies. Software Development Engineer Microsoft January 2011  –  March 2012  (1 year 3 months) Greater Seattle Area Joined the Online Services Division. Worked on Bing Mobile with the platforms team. My team was responsible for enlightening Bing experience on the Mobile phones making use of the mobile specific information like Location, Carrier, and Device type, etc. \n \nTechnologies used: C#, Javascript, Web debugging tools, Web services, and Internal Microsoft technologies. Software Engineer - Intern Google July 2010  –  October 2010  (4 months) San Francisco Bay Area Joined the Geo team. Working in Google Earth with the 3D reconstruction team. Mainly providing tools and solutions that help in getting enhanced terrain data from stereo images. \n \nTechnologies used: Java, C++, and Internal Google technologies. Software Engineer - Intern Google April 2009  –  July 2009  (4 months) San Francisco Bay Area Joined the MENA team. The team is working on projects for (Middle East and North Africa). \nExamples of the MENA team's applications are Google Ta3reeb and Google Ejabat. Worked in a yet unreleased Google project for 80% of the time. Built the whole infrastructure of that project. Also worked in Ta3reeb and the Arabic version of news for 20% of the time. \n \nTechnologies used: C++, Java, Python, and Internal Google technologies. Software Engineer Bibliotheca Alexandrina July 2008  –  March 2009  (9 months) Joined the DAR (Digital Assets Repository) team. Our team Built the NEMO Project. NEMO is the infrastructure of the whole library managing the library's users PCs (Desktop Interface) and the librarians PCs (Web Interface) as well as the Multimedia library tools. I was responsible for building the client's interface providing functionalities like web browsing, rich text editing, sending emails with attachments, playing media, and managing a secure folder for each user to the library. \nThese functionalities were provided in a secure Kiosk interface that prevents the user from messing with the existing resources of the library. \n \nTechnologies used: C#, Java, HTML, and Javascript. Software Engineer - Intern GPSExperts August 2007  –  September 2007  (2 months) Worked on a tool for image processing functionalities. The tool was capable of doing some basic image processing tasks like zooming, smoothing, and edge detection. \nTechnologies used: C++ MFC. Software Engineer - Intern ITWorx June 2007  –  August 2007  (3 months) Worked in a DB migration tool to migrate data from an Oracle to a MySQL DB. Switched to work in the DU account http://selfcare.du.ae/. Worked on activating the services on the Blackberry using the DU infrastructure. \nTechnologies used: Java, J2EE, and Javascript Product Manager Google October 2014  – Present (11 months) San Francisco Bay Area Working with Google Cloud Platform on the developers' tools team as part of my Software Engineer to Product Manager rotation program. Product Manager Google October 2014  – Present (11 months) San Francisco Bay Area Working with Google Cloud Platform on the developers' tools team as part of my Software Engineer to Product Manager rotation program. Software Engineer Google April 2012  – Present (3 years 5 months) San Francisco Bay Area Joined Google Maps working with the data engineering team. Our team is responsible for building and maintaining aerial and satellite imagery pipelines from data acquisition till it's published. \n \nTechnologies used: Python, C++, Java, and Internal Google technologies. Software Engineer Google April 2012  – Present (3 years 5 months) San Francisco Bay Area Joined Google Maps working with the data engineering team. Our team is responsible for building and maintaining aerial and satellite imagery pipelines from data acquisition till it's published. \n \nTechnologies used: Python, C++, Java, and Internal Google technologies. Software Development Engineer Microsoft January 2011  –  March 2012  (1 year 3 months) Greater Seattle Area Joined the Online Services Division. Worked on Bing Mobile with the platforms team. My team was responsible for enlightening Bing experience on the Mobile phones making use of the mobile specific information like Location, Carrier, and Device type, etc. \n \nTechnologies used: C#, Javascript, Web debugging tools, Web services, and Internal Microsoft technologies. Software Development Engineer Microsoft January 2011  –  March 2012  (1 year 3 months) Greater Seattle Area Joined the Online Services Division. Worked on Bing Mobile with the platforms team. My team was responsible for enlightening Bing experience on the Mobile phones making use of the mobile specific information like Location, Carrier, and Device type, etc. \n \nTechnologies used: C#, Javascript, Web debugging tools, Web services, and Internal Microsoft technologies. Software Engineer - Intern Google July 2010  –  October 2010  (4 months) San Francisco Bay Area Joined the Geo team. Working in Google Earth with the 3D reconstruction team. Mainly providing tools and solutions that help in getting enhanced terrain data from stereo images. \n \nTechnologies used: Java, C++, and Internal Google technologies. Software Engineer - Intern Google July 2010  –  October 2010  (4 months) San Francisco Bay Area Joined the Geo team. Working in Google Earth with the 3D reconstruction team. Mainly providing tools and solutions that help in getting enhanced terrain data from stereo images. \n \nTechnologies used: Java, C++, and Internal Google technologies. Software Engineer - Intern Google April 2009  –  July 2009  (4 months) San Francisco Bay Area Joined the MENA team. The team is working on projects for (Middle East and North Africa). \nExamples of the MENA team's applications are Google Ta3reeb and Google Ejabat. Worked in a yet unreleased Google project for 80% of the time. Built the whole infrastructure of that project. Also worked in Ta3reeb and the Arabic version of news for 20% of the time. \n \nTechnologies used: C++, Java, Python, and Internal Google technologies. Software Engineer - Intern Google April 2009  –  July 2009  (4 months) San Francisco Bay Area Joined the MENA team. The team is working on projects for (Middle East and North Africa). \nExamples of the MENA team's applications are Google Ta3reeb and Google Ejabat. Worked in a yet unreleased Google project for 80% of the time. Built the whole infrastructure of that project. Also worked in Ta3reeb and the Arabic version of news for 20% of the time. \n \nTechnologies used: C++, Java, Python, and Internal Google technologies. Software Engineer Bibliotheca Alexandrina July 2008  –  March 2009  (9 months) Joined the DAR (Digital Assets Repository) team. Our team Built the NEMO Project. NEMO is the infrastructure of the whole library managing the library's users PCs (Desktop Interface) and the librarians PCs (Web Interface) as well as the Multimedia library tools. I was responsible for building the client's interface providing functionalities like web browsing, rich text editing, sending emails with attachments, playing media, and managing a secure folder for each user to the library. \nThese functionalities were provided in a secure Kiosk interface that prevents the user from messing with the existing resources of the library. \n \nTechnologies used: C#, Java, HTML, and Javascript. Software Engineer Bibliotheca Alexandrina July 2008  –  March 2009  (9 months) Joined the DAR (Digital Assets Repository) team. Our team Built the NEMO Project. NEMO is the infrastructure of the whole library managing the library's users PCs (Desktop Interface) and the librarians PCs (Web Interface) as well as the Multimedia library tools. I was responsible for building the client's interface providing functionalities like web browsing, rich text editing, sending emails with attachments, playing media, and managing a secure folder for each user to the library. \nThese functionalities were provided in a secure Kiosk interface that prevents the user from messing with the existing resources of the library. \n \nTechnologies used: C#, Java, HTML, and Javascript. Software Engineer - Intern GPSExperts August 2007  –  September 2007  (2 months) Worked on a tool for image processing functionalities. The tool was capable of doing some basic image processing tasks like zooming, smoothing, and edge detection. \nTechnologies used: C++ MFC. Software Engineer - Intern GPSExperts August 2007  –  September 2007  (2 months) Worked on a tool for image processing functionalities. The tool was capable of doing some basic image processing tasks like zooming, smoothing, and edge detection. \nTechnologies used: C++ MFC. Software Engineer - Intern ITWorx June 2007  –  August 2007  (3 months) Worked in a DB migration tool to migrate data from an Oracle to a MySQL DB. Switched to work in the DU account http://selfcare.du.ae/. Worked on activating the services on the Blackberry using the DU infrastructure. \nTechnologies used: Java, J2EE, and Javascript Software Engineer - Intern ITWorx June 2007  –  August 2007  (3 months) Worked in a DB migration tool to migrate data from an Oracle to a MySQL DB. Switched to work in the DU account http://selfcare.du.ae/. Worked on activating the services on the Blackberry using the DU infrastructure. \nTechnologies used: Java, J2EE, and Javascript Languages Arabic English Spanish Arabic English Spanish Arabic English Spanish Skills Software Engineering Software Development Computer Vision Machine Learning Databases Algorithms C# C++ Java Python Programming JavaScript Web Services MySQL Skills  Software Engineering Software Development Computer Vision Machine Learning Databases Algorithms C# C++ Java Python Programming JavaScript Web Services MySQL Software Engineering Software Development Computer Vision Machine Learning Databases Algorithms C# C++ Java Python Programming JavaScript Web Services MySQL Software Engineering Software Development Computer Vision Machine Learning Databases Algorithms C# C++ Java Python Programming JavaScript Web Services MySQL Education UCLA Anderson School of Management Masters of Business Administration (MBA) 2013  – 2016 WASEDA Business School Strategic Design Thinking 2015  – 2015 Universitat Autonoma de Barcelona Master of Science (M.Sc.),  Computer Vision and Artificial Intelligence , Distinction 2009  – 2010 Thesis title: Object Localization enhancement by multiple segmentations fusion. Alexandria University Bachelor of Science (B.Sc.),  Computer and Systems Engineering , Very Good 2003  – 2008 Graduation project title: 3D Model reconstruction from an uncalibrated stereo pair of images. UCLA Anderson School of Management Masters of Business Administration (MBA) 2013  – 2016 UCLA Anderson School of Management Masters of Business Administration (MBA) 2013  – 2016 UCLA Anderson School of Management Masters of Business Administration (MBA) 2013  – 2016 WASEDA Business School Strategic Design Thinking 2015  – 2015 WASEDA Business School Strategic Design Thinking 2015  – 2015 WASEDA Business School Strategic Design Thinking 2015  – 2015 Universitat Autonoma de Barcelona Master of Science (M.Sc.),  Computer Vision and Artificial Intelligence , Distinction 2009  – 2010 Thesis title: Object Localization enhancement by multiple segmentations fusion. Universitat Autonoma de Barcelona Master of Science (M.Sc.),  Computer Vision and Artificial Intelligence , Distinction 2009  – 2010 Thesis title: Object Localization enhancement by multiple segmentations fusion. Universitat Autonoma de Barcelona Master of Science (M.Sc.),  Computer Vision and Artificial Intelligence , Distinction 2009  – 2010 Thesis title: Object Localization enhancement by multiple segmentations fusion. Alexandria University Bachelor of Science (B.Sc.),  Computer and Systems Engineering , Very Good 2003  – 2008 Graduation project title: 3D Model reconstruction from an uncalibrated stereo pair of images. Alexandria University Bachelor of Science (B.Sc.),  Computer and Systems Engineering , Very Good 2003  – 2008 Graduation project title: 3D Model reconstruction from an uncalibrated stereo pair of images. Alexandria University Bachelor of Science (B.Sc.),  Computer and Systems Engineering , Very Good 2003  – 2008 Graduation project title: 3D Model reconstruction from an uncalibrated stereo pair of images. "]}