{"position": "Technical Account Manager (Sales Engineer)", "company": "Google", "profiles": ["Summary Technology Executive with extensive experience across a number of industries, countries and cultures. \n \nDeep technical background combined with extensive experience in partnership negotiation, client services offering and pre/post sales support. Strong people manager, team leader and successful recruiter. \n \nIndustry experience includes digital advertising, investment banking, financial services, IT security and infrastructure management Summary Technology Executive with extensive experience across a number of industries, countries and cultures. \n \nDeep technical background combined with extensive experience in partnership negotiation, client services offering and pre/post sales support. Strong people manager, team leader and successful recruiter. \n \nIndustry experience includes digital advertising, investment banking, financial services, IT security and infrastructure management Technology Executive with extensive experience across a number of industries, countries and cultures. \n \nDeep technical background combined with extensive experience in partnership negotiation, client services offering and pre/post sales support. Strong people manager, team leader and successful recruiter. \n \nIndustry experience includes digital advertising, investment banking, financial services, IT security and infrastructure management Technology Executive with extensive experience across a number of industries, countries and cultures. \n \nDeep technical background combined with extensive experience in partnership negotiation, client services offering and pre/post sales support. Strong people manager, team leader and successful recruiter. \n \nIndustry experience includes digital advertising, investment banking, financial services, IT security and infrastructure management Experience Head of Video Consulting for Publishers Google December 2014  – Present (9 months) Greater New York City Area Client Services Manager for ISP&Portal and Retail Publishers Google May 2012  –  December 2014  (2 years 8 months) Greater New York City Area Google gTech Publishers - New York, NY \nResponsible for a senior team of Technical Account Managers supporting top publishers across North America within the ISP & Portals, Retail and Finance verticals accounting for multiple billions of dollars in revenues. Also in charge of technical services and tools around MarketPlace development initiatives (preferred deals and private auctions) Head of DoubleClick BidManager client services (DBM) Google May 2011  –  May 2012  (1 year 1 month) Greater New York City Area Google gTech Ads - New York, NY \nOverall responsibility for the global technical services team providing support to Google's largest advertisers and agencies in North America and EMEA. Recruited a team of 12 Technical Account Managers, lead the migration strategy from the legacy product to the Google stack and created a global support model and SLAs for technical services Sr Technical Account Manager Google May 2006  –  May 2011  (5 years 1 month) London/UK & Milan/Italy Google gTech Publishers - London, UK \nLaunched, optimised and managed some of Google EMEA's largest accounts, closed significant deals in multiple products and verticals (Google Apps, AdSense, YouTube and Google Maps), influenced product direction, and contributed to Google's culture and internal relationships. \n \nYouTube Inc - Milan, Italy \nOverall responsibility of technical operations for Google's YouTube strategic partnerships in Italy and Israel, pre-sale support and technical account management for Google's strategic YouTube partners in EMEA. Infrastructure Architect & Information Security Officer Deutsche Bank October 2002  –  May 2006  (3 years 8 months) London, United Kingdom Responsible for large projects related to infrastructure cost reduction and consolidation, uptime and security of Deutsche Bank's e-commerce services. Manager of the support team including overall responsibility for 24/7 production support and issues affecting globally recognized #1 products such as AutobahnFX and AutobahnFI. IT Consultant Citria January 1999  –  October 2002  (3 years 10 months) London, United Kingdom Responsible for the design and support of the pan-European infrastructure, networks and servers; conducted several security engagements including penetration tests, security policy reviews and lock-downs for small and large businesses across the UK Unix Sysadmin and Web developer SMART.it January 1996  –  December 1998  (3 years) Bologna Area, Italy Responsible for production servers and web development for a large number of web applications Head of Video Consulting for Publishers Google December 2014  – Present (9 months) Greater New York City Area Head of Video Consulting for Publishers Google December 2014  – Present (9 months) Greater New York City Area Client Services Manager for ISP&Portal and Retail Publishers Google May 2012  –  December 2014  (2 years 8 months) Greater New York City Area Google gTech Publishers - New York, NY \nResponsible for a senior team of Technical Account Managers supporting top publishers across North America within the ISP & Portals, Retail and Finance verticals accounting for multiple billions of dollars in revenues. Also in charge of technical services and tools around MarketPlace development initiatives (preferred deals and private auctions) Client Services Manager for ISP&Portal and Retail Publishers Google May 2012  –  December 2014  (2 years 8 months) Greater New York City Area Google gTech Publishers - New York, NY \nResponsible for a senior team of Technical Account Managers supporting top publishers across North America within the ISP & Portals, Retail and Finance verticals accounting for multiple billions of dollars in revenues. Also in charge of technical services and tools around MarketPlace development initiatives (preferred deals and private auctions) Head of DoubleClick BidManager client services (DBM) Google May 2011  –  May 2012  (1 year 1 month) Greater New York City Area Google gTech Ads - New York, NY \nOverall responsibility for the global technical services team providing support to Google's largest advertisers and agencies in North America and EMEA. Recruited a team of 12 Technical Account Managers, lead the migration strategy from the legacy product to the Google stack and created a global support model and SLAs for technical services Head of DoubleClick BidManager client services (DBM) Google May 2011  –  May 2012  (1 year 1 month) Greater New York City Area Google gTech Ads - New York, NY \nOverall responsibility for the global technical services team providing support to Google's largest advertisers and agencies in North America and EMEA. Recruited a team of 12 Technical Account Managers, lead the migration strategy from the legacy product to the Google stack and created a global support model and SLAs for technical services Sr Technical Account Manager Google May 2006  –  May 2011  (5 years 1 month) London/UK & Milan/Italy Google gTech Publishers - London, UK \nLaunched, optimised and managed some of Google EMEA's largest accounts, closed significant deals in multiple products and verticals (Google Apps, AdSense, YouTube and Google Maps), influenced product direction, and contributed to Google's culture and internal relationships. \n \nYouTube Inc - Milan, Italy \nOverall responsibility of technical operations for Google's YouTube strategic partnerships in Italy and Israel, pre-sale support and technical account management for Google's strategic YouTube partners in EMEA. Sr Technical Account Manager Google May 2006  –  May 2011  (5 years 1 month) London/UK & Milan/Italy Google gTech Publishers - London, UK \nLaunched, optimised and managed some of Google EMEA's largest accounts, closed significant deals in multiple products and verticals (Google Apps, AdSense, YouTube and Google Maps), influenced product direction, and contributed to Google's culture and internal relationships. \n \nYouTube Inc - Milan, Italy \nOverall responsibility of technical operations for Google's YouTube strategic partnerships in Italy and Israel, pre-sale support and technical account management for Google's strategic YouTube partners in EMEA. Infrastructure Architect & Information Security Officer Deutsche Bank October 2002  –  May 2006  (3 years 8 months) London, United Kingdom Responsible for large projects related to infrastructure cost reduction and consolidation, uptime and security of Deutsche Bank's e-commerce services. Manager of the support team including overall responsibility for 24/7 production support and issues affecting globally recognized #1 products such as AutobahnFX and AutobahnFI. Infrastructure Architect & Information Security Officer Deutsche Bank October 2002  –  May 2006  (3 years 8 months) London, United Kingdom Responsible for large projects related to infrastructure cost reduction and consolidation, uptime and security of Deutsche Bank's e-commerce services. Manager of the support team including overall responsibility for 24/7 production support and issues affecting globally recognized #1 products such as AutobahnFX and AutobahnFI. IT Consultant Citria January 1999  –  October 2002  (3 years 10 months) London, United Kingdom Responsible for the design and support of the pan-European infrastructure, networks and servers; conducted several security engagements including penetration tests, security policy reviews and lock-downs for small and large businesses across the UK IT Consultant Citria January 1999  –  October 2002  (3 years 10 months) London, United Kingdom Responsible for the design and support of the pan-European infrastructure, networks and servers; conducted several security engagements including penetration tests, security policy reviews and lock-downs for small and large businesses across the UK Unix Sysadmin and Web developer SMART.it January 1996  –  December 1998  (3 years) Bologna Area, Italy Responsible for production servers and web development for a large number of web applications Unix Sysadmin and Web developer SMART.it January 1996  –  December 1998  (3 years) Bologna Area, Italy Responsible for production servers and web development for a large number of web applications Languages English Native or bilingual proficiency Italian Native or bilingual proficiency English Native or bilingual proficiency Italian Native or bilingual proficiency English Native or bilingual proficiency Italian Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Managerial Experience Consulting Online Advertising Management Strategic Partnerships E-commerce Strategy Team Leadership Project Management Cloud Computing Team Management Pre-sales Account Management SaaS Security Outsourcing Business Analysis Business Continuity Program Management Digital Marketing Product Management Mobile Devices Cross-functional Team... Mobile Applications Disaster Recovery Unix Data Center Networking Linux Web Analytics See 15+     See less Skills  Managerial Experience Consulting Online Advertising Management Strategic Partnerships E-commerce Strategy Team Leadership Project Management Cloud Computing Team Management Pre-sales Account Management SaaS Security Outsourcing Business Analysis Business Continuity Program Management Digital Marketing Product Management Mobile Devices Cross-functional Team... Mobile Applications Disaster Recovery Unix Data Center Networking Linux Web Analytics See 15+     See less Managerial Experience Consulting Online Advertising Management Strategic Partnerships E-commerce Strategy Team Leadership Project Management Cloud Computing Team Management Pre-sales Account Management SaaS Security Outsourcing Business Analysis Business Continuity Program Management Digital Marketing Product Management Mobile Devices Cross-functional Team... Mobile Applications Disaster Recovery Unix Data Center Networking Linux Web Analytics See 15+     See less Managerial Experience Consulting Online Advertising Management Strategic Partnerships E-commerce Strategy Team Leadership Project Management Cloud Computing Team Management Pre-sales Account Management SaaS Security Outsourcing Business Analysis Business Continuity Program Management Digital Marketing Product Management Mobile Devices Cross-functional Team... Mobile Applications Disaster Recovery Unix Data Center Networking Linux Web Analytics See 15+     See less Education Università degli Studi di Modena e Reggio Emilia Computer Science 1993  – 1996 ITIS \"Leonardo da Vinci\" - Carpi 1988  – 1993 Università degli Studi di Modena e Reggio Emilia Computer Science 1993  – 1996 Università degli Studi di Modena e Reggio Emilia Computer Science 1993  – 1996 Università degli Studi di Modena e Reggio Emilia Computer Science 1993  – 1996 ITIS \"Leonardo da Vinci\" - Carpi 1988  – 1993 ITIS \"Leonardo da Vinci\" - Carpi 1988  – 1993 ITIS \"Leonardo da Vinci\" - Carpi 1988  – 1993 ", "Summary Accomplished Technical Carrier Account Manager with extensive experience in technical acceptance of innovative Mobile devices, Wearables and Accessories that focuses on delighting end consumer experience. \n \nBackground and extensive experience with AT&T, T-Mobile USA, Cricket Wireless and international partners in negotiating technical requirements, product scope and executing product launches that have included mobile devices and software services.  \n \nRecently managed products: \n- Nexus 6 (Stock Sku) \n- Moto X (1st gen & 2nd gen) \n- Moto G (1st gen & 2nd gen) \n- Moto E (1st gen & 2nd gen) \n \nObsessively passionate about end user experience with great focus on things that matters to customers, and seek to solve everyday problems in innovative ways. Summary Accomplished Technical Carrier Account Manager with extensive experience in technical acceptance of innovative Mobile devices, Wearables and Accessories that focuses on delighting end consumer experience. \n \nBackground and extensive experience with AT&T, T-Mobile USA, Cricket Wireless and international partners in negotiating technical requirements, product scope and executing product launches that have included mobile devices and software services.  \n \nRecently managed products: \n- Nexus 6 (Stock Sku) \n- Moto X (1st gen & 2nd gen) \n- Moto G (1st gen & 2nd gen) \n- Moto E (1st gen & 2nd gen) \n \nObsessively passionate about end user experience with great focus on things that matters to customers, and seek to solve everyday problems in innovative ways. Accomplished Technical Carrier Account Manager with extensive experience in technical acceptance of innovative Mobile devices, Wearables and Accessories that focuses on delighting end consumer experience. \n \nBackground and extensive experience with AT&T, T-Mobile USA, Cricket Wireless and international partners in negotiating technical requirements, product scope and executing product launches that have included mobile devices and software services.  \n \nRecently managed products: \n- Nexus 6 (Stock Sku) \n- Moto X (1st gen & 2nd gen) \n- Moto G (1st gen & 2nd gen) \n- Moto E (1st gen & 2nd gen) \n \nObsessively passionate about end user experience with great focus on things that matters to customers, and seek to solve everyday problems in innovative ways. Accomplished Technical Carrier Account Manager with extensive experience in technical acceptance of innovative Mobile devices, Wearables and Accessories that focuses on delighting end consumer experience. \n \nBackground and extensive experience with AT&T, T-Mobile USA, Cricket Wireless and international partners in negotiating technical requirements, product scope and executing product launches that have included mobile devices and software services.  \n \nRecently managed products: \n- Nexus 6 (Stock Sku) \n- Moto X (1st gen & 2nd gen) \n- Moto G (1st gen & 2nd gen) \n- Moto E (1st gen & 2nd gen) \n \nObsessively passionate about end user experience with great focus on things that matters to customers, and seek to solve everyday problems in innovative ways. Experience Sr. Technical Account Manager and Sales Support - North America Motorola Mobility, a Lenovo Company October 2014  – Present (11 months) San Francisco Bay Area ● Managed daily customer facing operations, including planning for New Product introductions, certification, requirements and delivery of all AT&T handsets in an extremely fast paced environment. “Go to” person for cross functional internal teams as well as for AT&T, T-Mobile and Cricket Wireless for all certification related activities.  \n● Optimized time to market by constantly looking for new opportunities in processes and communicating between internal teams as well as collaborating with sales, marketing, and product teams on new product launches.  \n● Reduced cost of proto samples resulting into significant savings for the company.  \n● Launched over 8 New Products (including award winning Moto G, Moto 360, Moto X, Google Nexus 6 and accessories) between AT&T, Cricket and T-Mobile while supporting 12 OS / HW updates between AT&T, Cricket Wireless and T-Mobile USA.  \n● Supported internal sales team with product queries, crafting technical responses for sales executives at customer end, supporting RFP requests and communicating internally the key customer requirements at various Tier levels to ensure key HW and SW services are supported.  \n● Successfully negotiated roadblocks within AT&T and Cricket technical and marketing team.  \n● Negotiated several dates ahead of schedule and backend activities that resulted into first to market.  \n● Effectively managed over 15 3rd party app developers and worked with cross functional team to ensure the apps permissions were safe from security and legal perspective. Sr. Technical Account Manager for AT&T, T-Mobile USA and Cricket Wireless Carrier Motorola Mobility, a Google Company May 2012  –  October 2014  (2 years 6 months) San Francisco Bay Area ● Successfully launched several award winning Premium and Value category devices in N.American market for Top Tier Carrier Partners such as AT&T, T-Mobile and Cricket Wireless.  \n● Responsible for the overall technical management of carrier certification activities from product ranging to launch. Principal Technical Account Manager for AT&T and T-Mobile Carrier Motorola Mobility May 2002  –  May 2012  (10 years 1 month) Greater Seattle Area ●\tManagement of technical acceptance and relationship between AT&T SPE VC / Marketing and Motorola. \n●\tReduced and controlled expenses by quality control, Identification of quality workarounds and on time market launch. Avoided multiple SW spins and associated 3rd party retesting costs.  \n●\tCoordinated 3rd party test activities including accessory IOT in accordance with Carrier requirement for Technical Acceptance.  \n●\tDisseminated technical information with justification for implementation to appropriate groups & followed through until committed. \n●\tParticipated in review of customer compliance document and stability scripts to ensure compliance. \n●\tManaged quality scorecard performance from TAM perspective - pre and post launch technical support, pre Lab and Lab approval process, Minimizing Escaped defects, Time to Market.  \n●\tExecuted Field Testing of mobile handsets, assisted in troubleshooting of field/lab issues and new technology testing in Carrier labs, Supported AT&T ADAPT testing and Bring up of AT&T Control Plane + Secured User Plane location using Andrew system, Field E911 testing. Technical Account Manager Motorola Personal Communication Sector December 1998  –  April 2002  (3 years 5 months) South Randolph, NJ ● Wireless handset development and technical approvals for North America GSM carriers.  \n● Supported Emerging GSM accounts i.e. Omnipoint, PacBell, BellSouth Mobility,  \nManaged end to end technical approval of wireless handsets from Voicestream, T-Mobile USA.  \n● Developed Strong Relationship with responsible carrier SME and Product Line Manager internally.  \n● Supported New Technology Testing / CES show / sales training, development in Carrier labs – AMR/HR, Link adaptation, GPRS, WAP. Field Design Engineer and Carrier support Philips Consumer Cellular December 1997  –  December 1998  (1 year 1 month) Piscataway, New Jersey Supported Technical approval of Mobile devices for customers (Entel PCS, Chile, Pacbell Wireless, Voice Stream, Bell South). \n \n●\tSupported Technical approval for various customers, deployed required tools and provided their needs in terms of satisfaction, value, quality and speed.  \n●\tINTERNATIONAL ASSIGNMENTS: Met with the customer (Entel) in Santiago, Chili regarding technical approval of 1900 PCS GSM single band product.  \n●\tValidated and supported development of GSM dual band product of Philips Consumer Communications in Le Mans, France for a month.  \n●\tField testing / Product development in European countries: Zurich, Switzerland / Germany / Paris, France  \n● Field tested in various markets to optimize RF performance by conducting Call Processing Tests. \n●\tEstablished drive routes in consultation with service provider/customer, Pass/Fail determination– based on confirmation that mobile is on Voice channel.  \n●\tCaptured significant test data via the following methods: time stamps, comments on failure mode, Environment, Infrastructure conditions, RSSI – range of values on the route, Speed, Individual phone behavior, Messages on display and tracing files. Field Test Engineer - Mobile Devices LUCENT TECHNOLOGIES June 1997  –  December 1997  (7 months) Holmdel, NJ ●\tField testing in different Cellular markets, Call Processing Tests, established Routes in consultation with service provider/customer.  \n●\tTrained new people on tools, troubleshooting techniques, S/W, testing strategies and objectives.  \n●\tAnalyzed test results with team to confirm failure mode and provide modified versions of HW/Firmware/DSP for further analysis and performance improvement. \n●\tWrote test plans and test reports for validation. QA Engineer C & H Associates, Inc December 1995  –  May 1997  (1 year 6 months) New Jersey ●\tBlack Box testing of software products using SQA package in marketing environment.  \n●\tThe system kept track of updated information of orders, stocks from each unit.  \n●\tThe system sub-modules took track of entire invoicing package functions of orders received by sales person working at their client site to the back office at another location.  \n●\tThe project also involved in alerting the management when the stock was below the reorder level.  \n●\tManaged test planning and design, test development and execution, viewing, analyzing results and defect tracking using SQA Manager, SQA Robot, SQA Test Log Viewer and SQA Comparators. Sr. Technical Account Manager and Sales Support - North America Motorola Mobility, a Lenovo Company October 2014  – Present (11 months) San Francisco Bay Area ● Managed daily customer facing operations, including planning for New Product introductions, certification, requirements and delivery of all AT&T handsets in an extremely fast paced environment. “Go to” person for cross functional internal teams as well as for AT&T, T-Mobile and Cricket Wireless for all certification related activities.  \n● Optimized time to market by constantly looking for new opportunities in processes and communicating between internal teams as well as collaborating with sales, marketing, and product teams on new product launches.  \n● Reduced cost of proto samples resulting into significant savings for the company.  \n● Launched over 8 New Products (including award winning Moto G, Moto 360, Moto X, Google Nexus 6 and accessories) between AT&T, Cricket and T-Mobile while supporting 12 OS / HW updates between AT&T, Cricket Wireless and T-Mobile USA.  \n● Supported internal sales team with product queries, crafting technical responses for sales executives at customer end, supporting RFP requests and communicating internally the key customer requirements at various Tier levels to ensure key HW and SW services are supported.  \n● Successfully negotiated roadblocks within AT&T and Cricket technical and marketing team.  \n● Negotiated several dates ahead of schedule and backend activities that resulted into first to market.  \n● Effectively managed over 15 3rd party app developers and worked with cross functional team to ensure the apps permissions were safe from security and legal perspective. Sr. Technical Account Manager and Sales Support - North America Motorola Mobility, a Lenovo Company October 2014  – Present (11 months) San Francisco Bay Area ● Managed daily customer facing operations, including planning for New Product introductions, certification, requirements and delivery of all AT&T handsets in an extremely fast paced environment. “Go to” person for cross functional internal teams as well as for AT&T, T-Mobile and Cricket Wireless for all certification related activities.  \n● Optimized time to market by constantly looking for new opportunities in processes and communicating between internal teams as well as collaborating with sales, marketing, and product teams on new product launches.  \n● Reduced cost of proto samples resulting into significant savings for the company.  \n● Launched over 8 New Products (including award winning Moto G, Moto 360, Moto X, Google Nexus 6 and accessories) between AT&T, Cricket and T-Mobile while supporting 12 OS / HW updates between AT&T, Cricket Wireless and T-Mobile USA.  \n● Supported internal sales team with product queries, crafting technical responses for sales executives at customer end, supporting RFP requests and communicating internally the key customer requirements at various Tier levels to ensure key HW and SW services are supported.  \n● Successfully negotiated roadblocks within AT&T and Cricket technical and marketing team.  \n● Negotiated several dates ahead of schedule and backend activities that resulted into first to market.  \n● Effectively managed over 15 3rd party app developers and worked with cross functional team to ensure the apps permissions were safe from security and legal perspective. Sr. Technical Account Manager for AT&T, T-Mobile USA and Cricket Wireless Carrier Motorola Mobility, a Google Company May 2012  –  October 2014  (2 years 6 months) San Francisco Bay Area ● Successfully launched several award winning Premium and Value category devices in N.American market for Top Tier Carrier Partners such as AT&T, T-Mobile and Cricket Wireless.  \n● Responsible for the overall technical management of carrier certification activities from product ranging to launch. Sr. Technical Account Manager for AT&T, T-Mobile USA and Cricket Wireless Carrier Motorola Mobility, a Google Company May 2012  –  October 2014  (2 years 6 months) San Francisco Bay Area ● Successfully launched several award winning Premium and Value category devices in N.American market for Top Tier Carrier Partners such as AT&T, T-Mobile and Cricket Wireless.  \n● Responsible for the overall technical management of carrier certification activities from product ranging to launch. Principal Technical Account Manager for AT&T and T-Mobile Carrier Motorola Mobility May 2002  –  May 2012  (10 years 1 month) Greater Seattle Area ●\tManagement of technical acceptance and relationship between AT&T SPE VC / Marketing and Motorola. \n●\tReduced and controlled expenses by quality control, Identification of quality workarounds and on time market launch. Avoided multiple SW spins and associated 3rd party retesting costs.  \n●\tCoordinated 3rd party test activities including accessory IOT in accordance with Carrier requirement for Technical Acceptance.  \n●\tDisseminated technical information with justification for implementation to appropriate groups & followed through until committed. \n●\tParticipated in review of customer compliance document and stability scripts to ensure compliance. \n●\tManaged quality scorecard performance from TAM perspective - pre and post launch technical support, pre Lab and Lab approval process, Minimizing Escaped defects, Time to Market.  \n●\tExecuted Field Testing of mobile handsets, assisted in troubleshooting of field/lab issues and new technology testing in Carrier labs, Supported AT&T ADAPT testing and Bring up of AT&T Control Plane + Secured User Plane location using Andrew system, Field E911 testing. Principal Technical Account Manager for AT&T and T-Mobile Carrier Motorola Mobility May 2002  –  May 2012  (10 years 1 month) Greater Seattle Area ●\tManagement of technical acceptance and relationship between AT&T SPE VC / Marketing and Motorola. \n●\tReduced and controlled expenses by quality control, Identification of quality workarounds and on time market launch. Avoided multiple SW spins and associated 3rd party retesting costs.  \n●\tCoordinated 3rd party test activities including accessory IOT in accordance with Carrier requirement for Technical Acceptance.  \n●\tDisseminated technical information with justification for implementation to appropriate groups & followed through until committed. \n●\tParticipated in review of customer compliance document and stability scripts to ensure compliance. \n●\tManaged quality scorecard performance from TAM perspective - pre and post launch technical support, pre Lab and Lab approval process, Minimizing Escaped defects, Time to Market.  \n●\tExecuted Field Testing of mobile handsets, assisted in troubleshooting of field/lab issues and new technology testing in Carrier labs, Supported AT&T ADAPT testing and Bring up of AT&T Control Plane + Secured User Plane location using Andrew system, Field E911 testing. Technical Account Manager Motorola Personal Communication Sector December 1998  –  April 2002  (3 years 5 months) South Randolph, NJ ● Wireless handset development and technical approvals for North America GSM carriers.  \n● Supported Emerging GSM accounts i.e. Omnipoint, PacBell, BellSouth Mobility,  \nManaged end to end technical approval of wireless handsets from Voicestream, T-Mobile USA.  \n● Developed Strong Relationship with responsible carrier SME and Product Line Manager internally.  \n● Supported New Technology Testing / CES show / sales training, development in Carrier labs – AMR/HR, Link adaptation, GPRS, WAP. Technical Account Manager Motorola Personal Communication Sector December 1998  –  April 2002  (3 years 5 months) South Randolph, NJ ● Wireless handset development and technical approvals for North America GSM carriers.  \n● Supported Emerging GSM accounts i.e. Omnipoint, PacBell, BellSouth Mobility,  \nManaged end to end technical approval of wireless handsets from Voicestream, T-Mobile USA.  \n● Developed Strong Relationship with responsible carrier SME and Product Line Manager internally.  \n● Supported New Technology Testing / CES show / sales training, development in Carrier labs – AMR/HR, Link adaptation, GPRS, WAP. Field Design Engineer and Carrier support Philips Consumer Cellular December 1997  –  December 1998  (1 year 1 month) Piscataway, New Jersey Supported Technical approval of Mobile devices for customers (Entel PCS, Chile, Pacbell Wireless, Voice Stream, Bell South). \n \n●\tSupported Technical approval for various customers, deployed required tools and provided their needs in terms of satisfaction, value, quality and speed.  \n●\tINTERNATIONAL ASSIGNMENTS: Met with the customer (Entel) in Santiago, Chili regarding technical approval of 1900 PCS GSM single band product.  \n●\tValidated and supported development of GSM dual band product of Philips Consumer Communications in Le Mans, France for a month.  \n●\tField testing / Product development in European countries: Zurich, Switzerland / Germany / Paris, France  \n● Field tested in various markets to optimize RF performance by conducting Call Processing Tests. \n●\tEstablished drive routes in consultation with service provider/customer, Pass/Fail determination– based on confirmation that mobile is on Voice channel.  \n●\tCaptured significant test data via the following methods: time stamps, comments on failure mode, Environment, Infrastructure conditions, RSSI – range of values on the route, Speed, Individual phone behavior, Messages on display and tracing files. Field Design Engineer and Carrier support Philips Consumer Cellular December 1997  –  December 1998  (1 year 1 month) Piscataway, New Jersey Supported Technical approval of Mobile devices for customers (Entel PCS, Chile, Pacbell Wireless, Voice Stream, Bell South). \n \n●\tSupported Technical approval for various customers, deployed required tools and provided their needs in terms of satisfaction, value, quality and speed.  \n●\tINTERNATIONAL ASSIGNMENTS: Met with the customer (Entel) in Santiago, Chili regarding technical approval of 1900 PCS GSM single band product.  \n●\tValidated and supported development of GSM dual band product of Philips Consumer Communications in Le Mans, France for a month.  \n●\tField testing / Product development in European countries: Zurich, Switzerland / Germany / Paris, France  \n● Field tested in various markets to optimize RF performance by conducting Call Processing Tests. \n●\tEstablished drive routes in consultation with service provider/customer, Pass/Fail determination– based on confirmation that mobile is on Voice channel.  \n●\tCaptured significant test data via the following methods: time stamps, comments on failure mode, Environment, Infrastructure conditions, RSSI – range of values on the route, Speed, Individual phone behavior, Messages on display and tracing files. Field Test Engineer - Mobile Devices LUCENT TECHNOLOGIES June 1997  –  December 1997  (7 months) Holmdel, NJ ●\tField testing in different Cellular markets, Call Processing Tests, established Routes in consultation with service provider/customer.  \n●\tTrained new people on tools, troubleshooting techniques, S/W, testing strategies and objectives.  \n●\tAnalyzed test results with team to confirm failure mode and provide modified versions of HW/Firmware/DSP for further analysis and performance improvement. \n●\tWrote test plans and test reports for validation. Field Test Engineer - Mobile Devices LUCENT TECHNOLOGIES June 1997  –  December 1997  (7 months) Holmdel, NJ ●\tField testing in different Cellular markets, Call Processing Tests, established Routes in consultation with service provider/customer.  \n●\tTrained new people on tools, troubleshooting techniques, S/W, testing strategies and objectives.  \n●\tAnalyzed test results with team to confirm failure mode and provide modified versions of HW/Firmware/DSP for further analysis and performance improvement. \n●\tWrote test plans and test reports for validation. QA Engineer C & H Associates, Inc December 1995  –  May 1997  (1 year 6 months) New Jersey ●\tBlack Box testing of software products using SQA package in marketing environment.  \n●\tThe system kept track of updated information of orders, stocks from each unit.  \n●\tThe system sub-modules took track of entire invoicing package functions of orders received by sales person working at their client site to the back office at another location.  \n●\tThe project also involved in alerting the management when the stock was below the reorder level.  \n●\tManaged test planning and design, test development and execution, viewing, analyzing results and defect tracking using SQA Manager, SQA Robot, SQA Test Log Viewer and SQA Comparators. QA Engineer C & H Associates, Inc December 1995  –  May 1997  (1 year 6 months) New Jersey ●\tBlack Box testing of software products using SQA package in marketing environment.  \n●\tThe system kept track of updated information of orders, stocks from each unit.  \n●\tThe system sub-modules took track of entire invoicing package functions of orders received by sales person working at their client site to the back office at another location.  \n●\tThe project also involved in alerting the management when the stock was below the reorder level.  \n●\tManaged test planning and design, test development and execution, viewing, analyzing results and defect tracking using SQA Manager, SQA Robot, SQA Test Log Viewer and SQA Comparators. Languages English Native or bilingual proficiency Hindi Native or bilingual proficiency Gujarati Native or bilingual proficiency English Native or bilingual proficiency Hindi Native or bilingual proficiency Gujarati Native or bilingual proficiency English Native or bilingual proficiency Hindi Native or bilingual proficiency Gujarati Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Cellular Communications LTE Mobile Devices Wireless Handsets CDMA UMTS Account Management Telecommunications Integration 4G Mobile Communications GPRS Mobile Technology GSM Testing WCDMA 3GPP 3G Product Management TCP/IP VoIP See 7+     See less Skills  Cellular Communications LTE Mobile Devices Wireless Handsets CDMA UMTS Account Management Telecommunications Integration 4G Mobile Communications GPRS Mobile Technology GSM Testing WCDMA 3GPP 3G Product Management TCP/IP VoIP See 7+     See less Cellular Communications LTE Mobile Devices Wireless Handsets CDMA UMTS Account Management Telecommunications Integration 4G Mobile Communications GPRS Mobile Technology GSM Testing WCDMA 3GPP 3G Product Management TCP/IP VoIP See 7+     See less Cellular Communications LTE Mobile Devices Wireless Handsets CDMA UMTS Account Management Telecommunications Integration 4G Mobile Communications GPRS Mobile Technology GSM Testing WCDMA 3GPP 3G Product Management TCP/IP VoIP See 7+     See less Education New Jersey Institute of Technology BS,  Computer Engineering ,  Math New Jersey Institute of Technology BS,  Computer Engineering ,  Math New Jersey Institute of Technology BS,  Computer Engineering ,  Math New Jersey Institute of Technology BS,  Computer Engineering ,  Math Honors & Awards Sr. Technical Account Manager Motorola Mobility CEO and President September 2014 Recognition for successfully managing and launching key financial impacting new products for Q4-2014.  Sr. Technical Account Manager Motorola Mobility CEO and President September 2014 Recognition for successfully managing and launching key financial impacting new products for Q4-2014.  Sr. Technical Account Manager Motorola Mobility CEO and President September 2014 Recognition for successfully managing and launching key financial impacting new products for Q4-2014.  Sr. Technical Account Manager Motorola Mobility CEO and President September 2014 Recognition for successfully managing and launching key financial impacting new products for Q4-2014.  ", "Summary Hands-­on, solution oriented, customer focused, with a proven track record of success demonstrated through 17 years of work experience in application development and technical account management. \n \n● Excellent project management experience with ability to lead multiple projects. \n● Ability to work cross­functionally with all levels of management without supervision. \n● Immersed understanding in online advertising, search engine marketing, online commerce, and web analytics. \n● Strong experience in web application development, testing, and processes. Summary Hands-­on, solution oriented, customer focused, with a proven track record of success demonstrated through 17 years of work experience in application development and technical account management. \n \n● Excellent project management experience with ability to lead multiple projects. \n● Ability to work cross­functionally with all levels of management without supervision. \n● Immersed understanding in online advertising, search engine marketing, online commerce, and web analytics. \n● Strong experience in web application development, testing, and processes. Hands-­on, solution oriented, customer focused, with a proven track record of success demonstrated through 17 years of work experience in application development and technical account management. \n \n● Excellent project management experience with ability to lead multiple projects. \n● Ability to work cross­functionally with all levels of management without supervision. \n● Immersed understanding in online advertising, search engine marketing, online commerce, and web analytics. \n● Strong experience in web application development, testing, and processes. Hands-­on, solution oriented, customer focused, with a proven track record of success demonstrated through 17 years of work experience in application development and technical account management. \n \n● Excellent project management experience with ability to lead multiple projects. \n● Ability to work cross­functionally with all levels of management without supervision. \n● Immersed understanding in online advertising, search engine marketing, online commerce, and web analytics. \n● Strong experience in web application development, testing, and processes. Skills Perl Python C Java Mobile CSS HTML JavaScript Django Requirements Gathering Requirements Management Project Coordination Software Project... Project Planning Mobile Devices Corporate Finance Derivatives Equity Derivatives Bonds Financial Futures Futures Trading LIBOR Interest Rate... See 8+     See less Skills  Perl Python C Java Mobile CSS HTML JavaScript Django Requirements Gathering Requirements Management Project Coordination Software Project... Project Planning Mobile Devices Corporate Finance Derivatives Equity Derivatives Bonds Financial Futures Futures Trading LIBOR Interest Rate... See 8+     See less Perl Python C Java Mobile CSS HTML JavaScript Django Requirements Gathering Requirements Management Project Coordination Software Project... Project Planning Mobile Devices Corporate Finance Derivatives Equity Derivatives Bonds Financial Futures Futures Trading LIBOR Interest Rate... See 8+     See less Perl Python C Java Mobile CSS HTML JavaScript Django Requirements Gathering Requirements Management Project Coordination Software Project... Project Planning Mobile Devices Corporate Finance Derivatives Equity Derivatives Bonds Financial Futures Futures Trading LIBOR Interest Rate... See 8+     See less ", "Experience Director, Product Signal ™ October 2014  – Present (11 months) Greater Chicago Area Product Manager Signal ™ January 2012  –  October 2014  (2 years 10 months) Greater Chicago Area Solutions Engineer Turn November 2010  –  January 2012  (1 year 3 months) Product Manager Google April 2008  –  November 2010  (2 years 8 months) Associate Product Manager DoubleClick March 2008  –  April 2008  (2 months) Product Analyst DoubleClick March 2007  –  February 2008  (1 year) Sr. Technical Account Manager DoubleClick March 2006  –  February 2007  (1 year) Technical Account Manager DoubleClick August 2004  –  February 2006  (1 year 7 months) Proprietary Systems Analyst UBS January 2003  –  August 2004  (1 year 8 months) Director, Product Signal ™ October 2014  – Present (11 months) Greater Chicago Area Director, Product Signal ™ October 2014  – Present (11 months) Greater Chicago Area Product Manager Signal ™ January 2012  –  October 2014  (2 years 10 months) Greater Chicago Area Product Manager Signal ™ January 2012  –  October 2014  (2 years 10 months) Greater Chicago Area Solutions Engineer Turn November 2010  –  January 2012  (1 year 3 months) Solutions Engineer Turn November 2010  –  January 2012  (1 year 3 months) Product Manager Google April 2008  –  November 2010  (2 years 8 months) Product Manager Google April 2008  –  November 2010  (2 years 8 months) Associate Product Manager DoubleClick March 2008  –  April 2008  (2 months) Associate Product Manager DoubleClick March 2008  –  April 2008  (2 months) Product Analyst DoubleClick March 2007  –  February 2008  (1 year) Product Analyst DoubleClick March 2007  –  February 2008  (1 year) Sr. Technical Account Manager DoubleClick March 2006  –  February 2007  (1 year) Sr. Technical Account Manager DoubleClick March 2006  –  February 2007  (1 year) Technical Account Manager DoubleClick August 2004  –  February 2006  (1 year 7 months) Technical Account Manager DoubleClick August 2004  –  February 2006  (1 year 7 months) Proprietary Systems Analyst UBS January 2003  –  August 2004  (1 year 8 months) Proprietary Systems Analyst UBS January 2003  –  August 2004  (1 year 8 months) Skills SEM Online Advertising PPC Product Management Search DSP DMP Sales Engineering Web Analytics Google Adwords Google Analytics SaaS Analytics Start-ups Ad Serving Mobile Marketing Mobile Advertising E-commerce Omniture Display Advertising Digital Strategy DoubleClick Digital Marketing Search Advertising Online Marketing See 10+     See less Skills  SEM Online Advertising PPC Product Management Search DSP DMP Sales Engineering Web Analytics Google Adwords Google Analytics SaaS Analytics Start-ups Ad Serving Mobile Marketing Mobile Advertising E-commerce Omniture Display Advertising Digital Strategy DoubleClick Digital Marketing Search Advertising Online Marketing See 10+     See less SEM Online Advertising PPC Product Management Search DSP DMP Sales Engineering Web Analytics Google Adwords Google Analytics SaaS Analytics Start-ups Ad Serving Mobile Marketing Mobile Advertising E-commerce Omniture Display Advertising Digital Strategy DoubleClick Digital Marketing Search Advertising Online Marketing See 10+     See less SEM Online Advertising PPC Product Management Search DSP DMP Sales Engineering Web Analytics Google Adwords Google Analytics SaaS Analytics Start-ups Ad Serving Mobile Marketing Mobile Advertising E-commerce Omniture Display Advertising Digital Strategy DoubleClick Digital Marketing Search Advertising Online Marketing See 10+     See less Education University of Illinois at Urbana-Champaign BS,  Computer Science 1998  – 2002 University of Illinois at Urbana-Champaign BS,  Computer Science 1998  – 2002 University of Illinois at Urbana-Champaign BS,  Computer Science 1998  – 2002 University of Illinois at Urbana-Champaign BS,  Computer Science 1998  – 2002 ", "Skills HTML Word Excel Advertising Client Services Microsoft Excel DART for Publishers Microsoft Word DART Sales Manager New Media Ad Serving Fashion Online Advertising Entertainment DoubleClick Blogging Google Adwords DFP Digital Strategy See 4+     See less Skills  HTML Word Excel Advertising Client Services Microsoft Excel DART for Publishers Microsoft Word DART Sales Manager New Media Ad Serving Fashion Online Advertising Entertainment DoubleClick Blogging Google Adwords DFP Digital Strategy See 4+     See less HTML Word Excel Advertising Client Services Microsoft Excel DART for Publishers Microsoft Word DART Sales Manager New Media Ad Serving Fashion Online Advertising Entertainment DoubleClick Blogging Google Adwords DFP Digital Strategy See 4+     See less HTML Word Excel Advertising Client Services Microsoft Excel DART for Publishers Microsoft Word DART Sales Manager New Media Ad Serving Fashion Online Advertising Entertainment DoubleClick Blogging Google Adwords DFP Digital Strategy See 4+     See less ", "Experience Manager, Partner Technology and Japan Product, Shopping Google April 2013  – Present (2 years 5 months) mountain view, ca Staff Partner Technology Manager, APAC Partnership Technology Lead Google June 2011  –  March 2013  (1 year 10 months) Tokyo, Japan Sr. Technical Account Manager/Sales Engineer Google June 2007  –  May 2011  (4 years) tokyo, japan Tech Lead Nomura Research Institute April 2000  –  August 2005  (5 years 5 months) tokyo, japan Manager, Partner Technology and Japan Product, Shopping Google April 2013  – Present (2 years 5 months) mountain view, ca Manager, Partner Technology and Japan Product, Shopping Google April 2013  – Present (2 years 5 months) mountain view, ca Staff Partner Technology Manager, APAC Partnership Technology Lead Google June 2011  –  March 2013  (1 year 10 months) Tokyo, Japan Staff Partner Technology Manager, APAC Partnership Technology Lead Google June 2011  –  March 2013  (1 year 10 months) Tokyo, Japan Sr. Technical Account Manager/Sales Engineer Google June 2007  –  May 2011  (4 years) tokyo, japan Sr. Technical Account Manager/Sales Engineer Google June 2007  –  May 2011  (4 years) tokyo, japan Tech Lead Nomura Research Institute April 2000  –  August 2005  (5 years 5 months) tokyo, japan Tech Lead Nomura Research Institute April 2000  –  August 2005  (5 years 5 months) tokyo, japan Languages Japanese Native or bilingual proficiency English Native or bilingual proficiency Chinese Professional working proficiency Japanese Native or bilingual proficiency English Native or bilingual proficiency Chinese Professional working proficiency Japanese Native or bilingual proficiency English Native or bilingual proficiency Chinese Professional working proficiency Native or bilingual proficiency Native or bilingual proficiency Professional working proficiency Skills Mobile Devices Project Management Cloud Computing Product Management E-commerce Strategic Partnerships SaaS Analytics Software Development Competitive Analysis Distributed Systems Business Development Data Analysis Business Intelligence Software Project... Pre-sales Linux Vendor Management Product Development Agile Project Management Web Applications Business Analysis Partner Management Enterprise Software See 9+     See less Skills  Mobile Devices Project Management Cloud Computing Product Management E-commerce Strategic Partnerships SaaS Analytics Software Development Competitive Analysis Distributed Systems Business Development Data Analysis Business Intelligence Software Project... Pre-sales Linux Vendor Management Product Development Agile Project Management Web Applications Business Analysis Partner Management Enterprise Software See 9+     See less Mobile Devices Project Management Cloud Computing Product Management E-commerce Strategic Partnerships SaaS Analytics Software Development Competitive Analysis Distributed Systems Business Development Data Analysis Business Intelligence Software Project... Pre-sales Linux Vendor Management Product Development Agile Project Management Web Applications Business Analysis Partner Management Enterprise Software See 9+     See less Mobile Devices Project Management Cloud Computing Product Management E-commerce Strategic Partnerships SaaS Analytics Software Development Competitive Analysis Distributed Systems Business Development Data Analysis Business Intelligence Software Project... Pre-sales Linux Vendor Management Product Development Agile Project Management Web Applications Business Analysis Partner Management Enterprise Software See 9+     See less Education The University of Tokyo Bachelor of Liberal Arts,  College of Arts and Sciences Activities and Societies:  Boxing team captain ,  won bronze medal in the national amateur boxing championships University of California, Berkeley, Haas School of Business MBA,  Management of Technology Activities and Societies:  VP Communication & Technology ,  Haas Pacific Rim Club; Technology Panel Organizer ,  Berkeley Asia Business Conference 2006; Haas Technology Club The University of Tokyo Bachelor of Liberal Arts,  College of Arts and Sciences Activities and Societies:  Boxing team captain ,  won bronze medal in the national amateur boxing championships The University of Tokyo Bachelor of Liberal Arts,  College of Arts and Sciences Activities and Societies:  Boxing team captain ,  won bronze medal in the national amateur boxing championships The University of Tokyo Bachelor of Liberal Arts,  College of Arts and Sciences Activities and Societies:  Boxing team captain ,  won bronze medal in the national amateur boxing championships University of California, Berkeley, Haas School of Business MBA,  Management of Technology Activities and Societies:  VP Communication & Technology ,  Haas Pacific Rim Club; Technology Panel Organizer ,  Berkeley Asia Business Conference 2006; Haas Technology Club University of California, Berkeley, Haas School of Business MBA,  Management of Technology Activities and Societies:  VP Communication & Technology ,  Haas Pacific Rim Club; Technology Panel Organizer ,  Berkeley Asia Business Conference 2006; Haas Technology Club University of California, Berkeley, Haas School of Business MBA,  Management of Technology Activities and Societies:  VP Communication & Technology ,  Haas Pacific Rim Club; Technology Panel Organizer ,  Berkeley Asia Business Conference 2006; Haas Technology Club Honors & Awards Google OC Award Google Executives December 2009 Google Executive Award for Mobile Monetization effort. Google OC Award Google Executives December 2009 Google Executive Award for Mobile Monetization effort. Google OC Award Google Executives December 2009 Google Executive Award for Mobile Monetization effort. Google OC Award Google Executives December 2009 Google Executive Award for Mobile Monetization effort. ", "Languages English Native or bilingual proficiency German Professional working proficiency English Native or bilingual proficiency German Professional working proficiency English Native or bilingual proficiency German Professional working proficiency Native or bilingual proficiency Professional working proficiency Skills Customer Relations Client Services Ad Serving Customer Service Troubleshooting Documentation Online Advertising Software Documentation Technical Support Advertising Ad Networks Leadership Management E-commerce DoubleClick Digital Media HTML Mobile Devices Rich Media Business Development See 5+     See less Skills  Customer Relations Client Services Ad Serving Customer Service Troubleshooting Documentation Online Advertising Software Documentation Technical Support Advertising Ad Networks Leadership Management E-commerce DoubleClick Digital Media HTML Mobile Devices Rich Media Business Development See 5+     See less Customer Relations Client Services Ad Serving Customer Service Troubleshooting Documentation Online Advertising Software Documentation Technical Support Advertising Ad Networks Leadership Management E-commerce DoubleClick Digital Media HTML Mobile Devices Rich Media Business Development See 5+     See less Customer Relations Client Services Ad Serving Customer Service Troubleshooting Documentation Online Advertising Software Documentation Technical Support Advertising Ad Networks Leadership Management E-commerce DoubleClick Digital Media HTML Mobile Devices Rich Media Business Development See 5+     See less ", "Summary I am currently working as a Sr. Technical Account Manager at Google Italy, after a long stint as an IT Architect for Italy's leading payments and credit cards processing company. My work experience has been often split into a main job, and various side projects which often morphed into full-blown startups. I have also contributed to various Open Source projects. Summary I am currently working as a Sr. Technical Account Manager at Google Italy, after a long stint as an IT Architect for Italy's leading payments and credit cards processing company. My work experience has been often split into a main job, and various side projects which often morphed into full-blown startups. I have also contributed to various Open Source projects. I am currently working as a Sr. Technical Account Manager at Google Italy, after a long stint as an IT Architect for Italy's leading payments and credit cards processing company. My work experience has been often split into a main job, and various side projects which often morphed into full-blown startups. I have also contributed to various Open Source projects. I am currently working as a Sr. Technical Account Manager at Google Italy, after a long stint as an IT Architect for Italy's leading payments and credit cards processing company. My work experience has been often split into a main job, and various side projects which often morphed into full-blown startups. I have also contributed to various Open Source projects. Experience Sr. Technical Account Manager Google February 2015  – Present (7 months) Milan Area, Italy IT Architect SIA spa December 2005  –  January 2015  (9 years 2 months) Milan, Italy SIA is Italy's leader in payments and processing solutions. Founder Blogbabel 2009  –  2009  (less than a year) Blogbabel has been acquired in 2009 by Liquida, a Banzai Group company. Technical Architect Banca Intesa spa April 2002  –  December 2005  (3 years 9 months) Co-Founder Blogo.it October 2004  –  April 2005  (7 months) Blogo.it is the leading Italian nanopublisher, with a network of more than 15 blogs and several million page views per month. All-around geek and general troubleshooter Consultant June 1999  –  March 2002  (2 years 10 months) Designed and implemented Internet/Intranet applications and Network Management infrastructures for several companies: Alcoa Europe, Poste Italiane, Moschino, EMI Music Italy, Infostrada, LTP Trade Limited (winner of several Euromoney awards), etc. Technical Architect SG2 Italia (Societé Génerale) June 1996  –  May 1999  (3 years) Designed and implemented several Systems Integration, Internet, and Networking projects either internally or for customers. Co-Founder Communicate! March 1996  –  June 1998  (2 years 4 months) One of the first Italian web agencies, later sold to an investment group. Co-Founder Starlink October 1994  –  February 1996  (1 year 5 months) Probably the second Internet Provider in Milan (Italy). Later sold to 21Network (Benetton). Sr. Technical Account Manager Google February 2015  – Present (7 months) Milan Area, Italy Sr. Technical Account Manager Google February 2015  – Present (7 months) Milan Area, Italy IT Architect SIA spa December 2005  –  January 2015  (9 years 2 months) Milan, Italy SIA is Italy's leader in payments and processing solutions. IT Architect SIA spa December 2005  –  January 2015  (9 years 2 months) Milan, Italy SIA is Italy's leader in payments and processing solutions. Founder Blogbabel 2009  –  2009  (less than a year) Blogbabel has been acquired in 2009 by Liquida, a Banzai Group company. Founder Blogbabel 2009  –  2009  (less than a year) Blogbabel has been acquired in 2009 by Liquida, a Banzai Group company. Technical Architect Banca Intesa spa April 2002  –  December 2005  (3 years 9 months) Technical Architect Banca Intesa spa April 2002  –  December 2005  (3 years 9 months) Co-Founder Blogo.it October 2004  –  April 2005  (7 months) Blogo.it is the leading Italian nanopublisher, with a network of more than 15 blogs and several million page views per month. Co-Founder Blogo.it October 2004  –  April 2005  (7 months) Blogo.it is the leading Italian nanopublisher, with a network of more than 15 blogs and several million page views per month. All-around geek and general troubleshooter Consultant June 1999  –  March 2002  (2 years 10 months) Designed and implemented Internet/Intranet applications and Network Management infrastructures for several companies: Alcoa Europe, Poste Italiane, Moschino, EMI Music Italy, Infostrada, LTP Trade Limited (winner of several Euromoney awards), etc. All-around geek and general troubleshooter Consultant June 1999  –  March 2002  (2 years 10 months) Designed and implemented Internet/Intranet applications and Network Management infrastructures for several companies: Alcoa Europe, Poste Italiane, Moschino, EMI Music Italy, Infostrada, LTP Trade Limited (winner of several Euromoney awards), etc. Technical Architect SG2 Italia (Societé Génerale) June 1996  –  May 1999  (3 years) Designed and implemented several Systems Integration, Internet, and Networking projects either internally or for customers. Technical Architect SG2 Italia (Societé Génerale) June 1996  –  May 1999  (3 years) Designed and implemented several Systems Integration, Internet, and Networking projects either internally or for customers. Co-Founder Communicate! March 1996  –  June 1998  (2 years 4 months) One of the first Italian web agencies, later sold to an investment group. Co-Founder Communicate! March 1996  –  June 1998  (2 years 4 months) One of the first Italian web agencies, later sold to an investment group. Co-Founder Starlink October 1994  –  February 1996  (1 year 5 months) Probably the second Internet Provider in Milan (Italy). Later sold to 21Network (Benetton). Co-Founder Starlink October 1994  –  February 1996  (1 year 5 months) Probably the second Internet Provider in Milan (Italy). Later sold to 21Network (Benetton). Languages English French English French English French Skills Wordpress MySQL Linux XML PHP Apache CSS HTML Python Web Development JavaScript jQuery SQL Shell Scripting Open Source Software Development Unix XHTML Django Cloud Computing WordPress Network Administration Debian Software Design Ubuntu Web Applications Web 2.0 Start-ups Git Start-up See 15+     See less Skills  Wordpress MySQL Linux XML PHP Apache CSS HTML Python Web Development JavaScript jQuery SQL Shell Scripting Open Source Software Development Unix XHTML Django Cloud Computing WordPress Network Administration Debian Software Design Ubuntu Web Applications Web 2.0 Start-ups Git Start-up See 15+     See less Wordpress MySQL Linux XML PHP Apache CSS HTML Python Web Development JavaScript jQuery SQL Shell Scripting Open Source Software Development Unix XHTML Django Cloud Computing WordPress Network Administration Debian Software Design Ubuntu Web Applications Web 2.0 Start-ups Git Start-up See 15+     See less Wordpress MySQL Linux XML PHP Apache CSS HTML Python Web Development JavaScript jQuery SQL Shell Scripting Open Source Software Development Unix XHTML Django Cloud Computing WordPress Network Administration Debian Software Design Ubuntu Web Applications Web 2.0 Start-ups Git Start-up See 15+     See less Education Politecnico di Milano Doctor,  Architectural Planning , 100/100 1988  – 1995 Liceo Giuseppe Parini maturità classica 1981  – 1984 Istituto Zaccaria 1971  – 1981 MIP-Politecnico Di Milano Master of Business Administration (M.B.A.) , attending 2014 Politecnico di Milano Doctor,  Architectural Planning , 100/100 1988  – 1995 Politecnico di Milano Doctor,  Architectural Planning , 100/100 1988  – 1995 Politecnico di Milano Doctor,  Architectural Planning , 100/100 1988  – 1995 Liceo Giuseppe Parini maturità classica 1981  – 1984 Liceo Giuseppe Parini maturità classica 1981  – 1984 Liceo Giuseppe Parini maturità classica 1981  – 1984 Istituto Zaccaria 1971  – 1981 Istituto Zaccaria 1971  – 1981 Istituto Zaccaria 1971  – 1981 MIP-Politecnico Di Milano Master of Business Administration (M.B.A.) , attending 2014 MIP-Politecnico Di Milano Master of Business Administration (M.B.A.) , attending 2014 MIP-Politecnico Di Milano Master of Business Administration (M.B.A.) , attending 2014 Honors & Awards Additional Honors & Awards Research Assistant, Prof. Michael Witzel, Harvard University (09/1995-06/1996) Additional Honors & Awards Research Assistant, Prof. Michael Witzel, Harvard University (09/1995-06/1996) Additional Honors & Awards Research Assistant, Prof. Michael Witzel, Harvard University (09/1995-06/1996) Additional Honors & Awards Research Assistant, Prof. Michael Witzel, Harvard University (09/1995-06/1996) ", "Experience Associate Software Engineer SpotXchange October 2013  –  December 2014  (1 year 3 months) Sales Engineer SpotXchange February 2012  –  September 2013  (1 year 8 months) Westminster, CO Sales engineer focusing primarily on providing technical support to publishers who are integrating with the SpotXchange video advertising platform. \n \n*Performed comprehensive testing of various types of in-stream and in-banner video integrations to confirm that all technical requirements were met (including VAST/VPAID compliance). \n \n*Investigated/escalated various types of reported technical issues. \n \n*Performed QA testing on advertising campaigns prior to launch. Publisher Relations Strategist Google May 2011  –  February 2012  (10 months) Thornton, CO Rich media technical support professional specializing in the resolution of high priority technical campaign issues and the certification of publishers for DoubleClick’s In-Stream ad serving solution. \n \n*Certified numerous publishers to accept DFA In-Stream (VAST 2.0) tags by generating and providing site-specific test tags, performing testing, and analyzing results to confirm VAST Compliance and proper implementation. \n \n*Developed and compiled internal training materials for the DFA In-Stream Certification process. \n \n*Contributed to various projects regarding internal and external training, quality, efficiency, and process. Server/Takeout/Host BJ's Restaurants, Inc. October 2010  –  July 2011  (10 months) Westminster, CO Was hired as a Host, then moved up to TakeOut and then on to Server. Sr. Technical Account Manager The Nielsen Company July 2010  –  May 2011  (11 months) New York, NY (Remote) Technical project manager specializing in the coordination and execution of online advertising research studies. \n \n*Organized campaign kickoff and status calls to minimize loss of sample size resulting from delayed or improper tagging of campaigns. \n \n*Analyzed media plans, traffic sheets, and creatives to determine necessary steps for tagging. \n \n*Generated research tags and worked directly with various publishers and agencies for implementation. \n \n*Mapped research tags to corresponding surveys for accurate study results. \n \n*Compiled and analyzed ad serving data with research tagging data in order to disclose any possible issues. Sr. Publisher Relations Manager Google April 2007  –  December 2009  (2 years 9 months) Thornton, CO Rich media customer support professional specializing in the investigation and resolution of high priority technical campaign issues.  \n \n*Prevented loss of revenue by successfully managing and prioritizing a continuous queue of urgent technical issues, testing requests and general inquiries from top-tier publishers, agencies, and various internal teams. \n \n*Continuously examined workflow efficiencies and assisted in the development of various processes resulting in quicker resolution times and increased workload balancing among team members. \n \n*Mentored and trained new team members on products, processes, and technical skills. \n \n*Documented various types of technical support information for both internal and external use. Campaign Implementation Manager DoubleClick November 2006  –  April 2007  (6 months) Thornton, CO Rich media support professional specializing in the observation and analysis of campaign delivery goals. \n \n*Compiled and analyzed campaign delivery reports in order to catch any possible campaign delivery issues and investigate immediately. \n \n*Provided campaign management coverage for agency clients while campaign managers were out of the office. Marketing Analyst NetQuote April 2005  –  November 2006  (1 year 8 months) Denver, CO Online media planner, buyer, and campaign manager specializing in  \nsearch, banner, text, and sponsorship campaigns. \n \n*Successfully managed over 40 advertising accounts to meet acquisition and ROI objectives within required CPA goals.  \n \n*Conceptually designed creatives with targeted messaging through copywriting and selection of images. \n \n*Optimized campaigns by compiling and evaluating various reports and developing strategies for improvements including the increase of audience targeting and facilitating tests.  \n \n*Organized and participated in the observation of consumer focus  \ngroups regarding proposed user interface improvements of company  \nwebsite. Administrative Assistant Westcor October 2004  –  April 2005  (7 months) Boulder, CO Administrative Assistant for the Senior Project Manager of the Twenty Ninth Street Redevelopment Project. Responsible for daily operation of construction site office. Front Desk/Snack Bar Associate Skate America September 2003  –  November 2004  (1 year 3 months) Pueblo, CO Worked this job to supply minimal income while going through a divorce and relocation. Ticketing Assistant Pikes Peak International Raceway April 2004  –  August 2004  (5 months) Fountain, CO Assistant to the Ticketing Manager responsible for everyday operation of ticketing department [seasonal position]. New Car Sales Consultant Jerome Duncan Ford February 2003  –  June 2003  (5 months) Sterling Heights, MI Sold new cars with the goal of attaining a career with Ford Motor Company. New Car Sales Consultant McLaughlin Ford September 2002  –  January 2003  (5 months) Royal Oak, MI Sold new cars with the goal of attaining a career with Ford Motor Company. Associate Software Engineer SpotXchange October 2013  –  December 2014  (1 year 3 months) Associate Software Engineer SpotXchange October 2013  –  December 2014  (1 year 3 months) Sales Engineer SpotXchange February 2012  –  September 2013  (1 year 8 months) Westminster, CO Sales engineer focusing primarily on providing technical support to publishers who are integrating with the SpotXchange video advertising platform. \n \n*Performed comprehensive testing of various types of in-stream and in-banner video integrations to confirm that all technical requirements were met (including VAST/VPAID compliance). \n \n*Investigated/escalated various types of reported technical issues. \n \n*Performed QA testing on advertising campaigns prior to launch. Sales Engineer SpotXchange February 2012  –  September 2013  (1 year 8 months) Westminster, CO Sales engineer focusing primarily on providing technical support to publishers who are integrating with the SpotXchange video advertising platform. \n \n*Performed comprehensive testing of various types of in-stream and in-banner video integrations to confirm that all technical requirements were met (including VAST/VPAID compliance). \n \n*Investigated/escalated various types of reported technical issues. \n \n*Performed QA testing on advertising campaigns prior to launch. Publisher Relations Strategist Google May 2011  –  February 2012  (10 months) Thornton, CO Rich media technical support professional specializing in the resolution of high priority technical campaign issues and the certification of publishers for DoubleClick’s In-Stream ad serving solution. \n \n*Certified numerous publishers to accept DFA In-Stream (VAST 2.0) tags by generating and providing site-specific test tags, performing testing, and analyzing results to confirm VAST Compliance and proper implementation. \n \n*Developed and compiled internal training materials for the DFA In-Stream Certification process. \n \n*Contributed to various projects regarding internal and external training, quality, efficiency, and process. Publisher Relations Strategist Google May 2011  –  February 2012  (10 months) Thornton, CO Rich media technical support professional specializing in the resolution of high priority technical campaign issues and the certification of publishers for DoubleClick’s In-Stream ad serving solution. \n \n*Certified numerous publishers to accept DFA In-Stream (VAST 2.0) tags by generating and providing site-specific test tags, performing testing, and analyzing results to confirm VAST Compliance and proper implementation. \n \n*Developed and compiled internal training materials for the DFA In-Stream Certification process. \n \n*Contributed to various projects regarding internal and external training, quality, efficiency, and process. Server/Takeout/Host BJ's Restaurants, Inc. October 2010  –  July 2011  (10 months) Westminster, CO Was hired as a Host, then moved up to TakeOut and then on to Server. Server/Takeout/Host BJ's Restaurants, Inc. October 2010  –  July 2011  (10 months) Westminster, CO Was hired as a Host, then moved up to TakeOut and then on to Server. Sr. Technical Account Manager The Nielsen Company July 2010  –  May 2011  (11 months) New York, NY (Remote) Technical project manager specializing in the coordination and execution of online advertising research studies. \n \n*Organized campaign kickoff and status calls to minimize loss of sample size resulting from delayed or improper tagging of campaigns. \n \n*Analyzed media plans, traffic sheets, and creatives to determine necessary steps for tagging. \n \n*Generated research tags and worked directly with various publishers and agencies for implementation. \n \n*Mapped research tags to corresponding surveys for accurate study results. \n \n*Compiled and analyzed ad serving data with research tagging data in order to disclose any possible issues. Sr. Technical Account Manager The Nielsen Company July 2010  –  May 2011  (11 months) New York, NY (Remote) Technical project manager specializing in the coordination and execution of online advertising research studies. \n \n*Organized campaign kickoff and status calls to minimize loss of sample size resulting from delayed or improper tagging of campaigns. \n \n*Analyzed media plans, traffic sheets, and creatives to determine necessary steps for tagging. \n \n*Generated research tags and worked directly with various publishers and agencies for implementation. \n \n*Mapped research tags to corresponding surveys for accurate study results. \n \n*Compiled and analyzed ad serving data with research tagging data in order to disclose any possible issues. Sr. Publisher Relations Manager Google April 2007  –  December 2009  (2 years 9 months) Thornton, CO Rich media customer support professional specializing in the investigation and resolution of high priority technical campaign issues.  \n \n*Prevented loss of revenue by successfully managing and prioritizing a continuous queue of urgent technical issues, testing requests and general inquiries from top-tier publishers, agencies, and various internal teams. \n \n*Continuously examined workflow efficiencies and assisted in the development of various processes resulting in quicker resolution times and increased workload balancing among team members. \n \n*Mentored and trained new team members on products, processes, and technical skills. \n \n*Documented various types of technical support information for both internal and external use. Sr. Publisher Relations Manager Google April 2007  –  December 2009  (2 years 9 months) Thornton, CO Rich media customer support professional specializing in the investigation and resolution of high priority technical campaign issues.  \n \n*Prevented loss of revenue by successfully managing and prioritizing a continuous queue of urgent technical issues, testing requests and general inquiries from top-tier publishers, agencies, and various internal teams. \n \n*Continuously examined workflow efficiencies and assisted in the development of various processes resulting in quicker resolution times and increased workload balancing among team members. \n \n*Mentored and trained new team members on products, processes, and technical skills. \n \n*Documented various types of technical support information for both internal and external use. Campaign Implementation Manager DoubleClick November 2006  –  April 2007  (6 months) Thornton, CO Rich media support professional specializing in the observation and analysis of campaign delivery goals. \n \n*Compiled and analyzed campaign delivery reports in order to catch any possible campaign delivery issues and investigate immediately. \n \n*Provided campaign management coverage for agency clients while campaign managers were out of the office. Campaign Implementation Manager DoubleClick November 2006  –  April 2007  (6 months) Thornton, CO Rich media support professional specializing in the observation and analysis of campaign delivery goals. \n \n*Compiled and analyzed campaign delivery reports in order to catch any possible campaign delivery issues and investigate immediately. \n \n*Provided campaign management coverage for agency clients while campaign managers were out of the office. Marketing Analyst NetQuote April 2005  –  November 2006  (1 year 8 months) Denver, CO Online media planner, buyer, and campaign manager specializing in  \nsearch, banner, text, and sponsorship campaigns. \n \n*Successfully managed over 40 advertising accounts to meet acquisition and ROI objectives within required CPA goals.  \n \n*Conceptually designed creatives with targeted messaging through copywriting and selection of images. \n \n*Optimized campaigns by compiling and evaluating various reports and developing strategies for improvements including the increase of audience targeting and facilitating tests.  \n \n*Organized and participated in the observation of consumer focus  \ngroups regarding proposed user interface improvements of company  \nwebsite. Marketing Analyst NetQuote April 2005  –  November 2006  (1 year 8 months) Denver, CO Online media planner, buyer, and campaign manager specializing in  \nsearch, banner, text, and sponsorship campaigns. \n \n*Successfully managed over 40 advertising accounts to meet acquisition and ROI objectives within required CPA goals.  \n \n*Conceptually designed creatives with targeted messaging through copywriting and selection of images. \n \n*Optimized campaigns by compiling and evaluating various reports and developing strategies for improvements including the increase of audience targeting and facilitating tests.  \n \n*Organized and participated in the observation of consumer focus  \ngroups regarding proposed user interface improvements of company  \nwebsite. Administrative Assistant Westcor October 2004  –  April 2005  (7 months) Boulder, CO Administrative Assistant for the Senior Project Manager of the Twenty Ninth Street Redevelopment Project. Responsible for daily operation of construction site office. Administrative Assistant Westcor October 2004  –  April 2005  (7 months) Boulder, CO Administrative Assistant for the Senior Project Manager of the Twenty Ninth Street Redevelopment Project. Responsible for daily operation of construction site office. Front Desk/Snack Bar Associate Skate America September 2003  –  November 2004  (1 year 3 months) Pueblo, CO Worked this job to supply minimal income while going through a divorce and relocation. Front Desk/Snack Bar Associate Skate America September 2003  –  November 2004  (1 year 3 months) Pueblo, CO Worked this job to supply minimal income while going through a divorce and relocation. Ticketing Assistant Pikes Peak International Raceway April 2004  –  August 2004  (5 months) Fountain, CO Assistant to the Ticketing Manager responsible for everyday operation of ticketing department [seasonal position]. Ticketing Assistant Pikes Peak International Raceway April 2004  –  August 2004  (5 months) Fountain, CO Assistant to the Ticketing Manager responsible for everyday operation of ticketing department [seasonal position]. New Car Sales Consultant Jerome Duncan Ford February 2003  –  June 2003  (5 months) Sterling Heights, MI Sold new cars with the goal of attaining a career with Ford Motor Company. New Car Sales Consultant Jerome Duncan Ford February 2003  –  June 2003  (5 months) Sterling Heights, MI Sold new cars with the goal of attaining a career with Ford Motor Company. New Car Sales Consultant McLaughlin Ford September 2002  –  January 2003  (5 months) Royal Oak, MI Sold new cars with the goal of attaining a career with Ford Motor Company. New Car Sales Consultant McLaughlin Ford September 2002  –  January 2003  (5 months) Royal Oak, MI Sold new cars with the goal of attaining a career with Ford Motor Company. Skills Online Advertising DoubleClick Ad Serving Advertising Rich Media CSS Digital Marketing HTML Web Analytics Ad Networks Microsoft Office Mobile Applications Mobile Advertising Marketing JavaScript Digital Strategy New Media Flash Git Linux VAST VPAID MySQL JIRA Confluence Certified ScrumMaster See 11+     See less Skills  Online Advertising DoubleClick Ad Serving Advertising Rich Media CSS Digital Marketing HTML Web Analytics Ad Networks Microsoft Office Mobile Applications Mobile Advertising Marketing JavaScript Digital Strategy New Media Flash Git Linux VAST VPAID MySQL JIRA Confluence Certified ScrumMaster See 11+     See less Online Advertising DoubleClick Ad Serving Advertising Rich Media CSS Digital Marketing HTML Web Analytics Ad Networks Microsoft Office Mobile Applications Mobile Advertising Marketing JavaScript Digital Strategy New Media Flash Git Linux VAST VPAID MySQL JIRA Confluence Certified ScrumMaster See 11+     See less Online Advertising DoubleClick Ad Serving Advertising Rich Media CSS Digital Marketing HTML Web Analytics Ad Networks Microsoft Office Mobile Applications Mobile Advertising Marketing JavaScript Digital Strategy New Media Flash Git Linux VAST VPAID MySQL JIRA Confluence Certified ScrumMaster See 11+     See less Education Colorado State University-Pueblo BSBA,  Business Management/Marketing 1998  – 2002 * General Motors Marketing Internship \n- Received Certificate of Completion and Award of Excellence Activities and Societies:  * Secretary of the Racquetball club\n* Member of the Racquetball Team\n- Racquetball Scholarships 2000-2001\n- All American Athlete (United States Racquetball Association) Colorado Christian University MBA - Leadership I did not complete this degree program because I decided to take my education path in a different direction. Colorado State University-Pueblo BSBA,  Business Management/Marketing 1998  – 2002 * General Motors Marketing Internship \n- Received Certificate of Completion and Award of Excellence Activities and Societies:  * Secretary of the Racquetball club\n* Member of the Racquetball Team\n- Racquetball Scholarships 2000-2001\n- All American Athlete (United States Racquetball Association) Colorado State University-Pueblo BSBA,  Business Management/Marketing 1998  – 2002 * General Motors Marketing Internship \n- Received Certificate of Completion and Award of Excellence Activities and Societies:  * Secretary of the Racquetball club\n* Member of the Racquetball Team\n- Racquetball Scholarships 2000-2001\n- All American Athlete (United States Racquetball Association) Colorado State University-Pueblo BSBA,  Business Management/Marketing 1998  – 2002 * General Motors Marketing Internship \n- Received Certificate of Completion and Award of Excellence Activities and Societies:  * Secretary of the Racquetball club\n* Member of the Racquetball Team\n- Racquetball Scholarships 2000-2001\n- All American Athlete (United States Racquetball Association) Colorado Christian University MBA - Leadership I did not complete this degree program because I decided to take my education path in a different direction. Colorado Christian University MBA - Leadership I did not complete this degree program because I decided to take my education path in a different direction. Colorado Christian University MBA - Leadership I did not complete this degree program because I decided to take my education path in a different direction. ", "Skills Strategy Pre-sales Product Management Cloud Computing E-commerce Mobile Devices Mobile Applications Online Advertising Digital Strategy Strategic Partnerships SEM Enterprise Software Web Analytics Consulting Project Management User Experience Analytics Management SaaS Business Analysis Software Development Start-ups Business Strategy Business Development Competitive Analysis Product Marketing CRM See 12+     See less Skills  Strategy Pre-sales Product Management Cloud Computing E-commerce Mobile Devices Mobile Applications Online Advertising Digital Strategy Strategic Partnerships SEM Enterprise Software Web Analytics Consulting Project Management User Experience Analytics Management SaaS Business Analysis Software Development Start-ups Business Strategy Business Development Competitive Analysis Product Marketing CRM See 12+     See less Strategy Pre-sales Product Management Cloud Computing E-commerce Mobile Devices Mobile Applications Online Advertising Digital Strategy Strategic Partnerships SEM Enterprise Software Web Analytics Consulting Project Management User Experience Analytics Management SaaS Business Analysis Software Development Start-ups Business Strategy Business Development Competitive Analysis Product Marketing CRM See 12+     See less Strategy Pre-sales Product Management Cloud Computing E-commerce Mobile Devices Mobile Applications Online Advertising Digital Strategy Strategic Partnerships SEM Enterprise Software Web Analytics Consulting Project Management User Experience Analytics Management SaaS Business Analysis Software Development Start-ups Business Strategy Business Development Competitive Analysis Product Marketing CRM See 12+     See less ", "Summary EdCast is a Softbank / Stanford StartX company that provides personal learning networks to enhance the human ability to collaborate and learn across educational materials, instructors, students and employers Summary EdCast is a Softbank / Stanford StartX company that provides personal learning networks to enhance the human ability to collaborate and learn across educational materials, instructors, students and employers EdCast is a Softbank / Stanford StartX company that provides personal learning networks to enhance the human ability to collaborate and learn across educational materials, instructors, students and employers EdCast is a Softbank / Stanford StartX company that provides personal learning networks to enhance the human ability to collaborate and learn across educational materials, instructors, students and employers Experience Senior Technical Account Manager EdCast Inc July 2015  – Present (2 months) Mountain View Business Development, Sales Operations, & Account Management \n \nCustomer Success Manager North America \n \nVoice of the Customer - Liason Between Clients + Internal Engineering/Product team \n \nFront-end Web Development, Client Website Customization \n \nAmazon Web Services -- EC2 / S3 Cloud Server Deployment  \n \nCustom Domain Setup, Analytics, and SSL Security  \n \nSalesforce Administrator / Leads Automation / Reporting Technical Account Manager EdCast Inc October 2014  –  July 2015  (10 months) Mountain View Consultant EdCast July 2014  –  October 2014  (4 months) Mountain View Web/Mobile Engineering Intern NameCoach April 2014  –  July 2014  (4 months) Stanford, CA Web/Mobile Upgrade \n \nDesigned the look and feel of the website with UI improvements based on user research. \n \nManipulated Javascript and JQuery to create interactive features for our users. \n \nImplemented responsive design for mobile to desktop and cross-browser, etc. \n \nDebugged existing features developed new ones to improve UX. \n \nConducted routine testing for QA purposes and to map improvements. \n \nAdapted existing product for mobile versions and also for new markets. \n \n \nHTML5/CSS  \nTwitter Bootstrap  \nJavascript/JQuery  \nRuby on Rails  \nPostgreSQL  \nGitHub Account Manager ASUS March 2012  –  November 2012  (9 months) Fremont, CA Account Management Role for Amazon, TigerDirect, and Microcenter. \n \nManaged entry/content quality assurance on all three E-commerce platforms. \n \nCoordinated shipping and supply chain management.  \n \nQueried databases to monitor inventory/sales run rates. \n \nCreated promotions to ramp up sales for aging inventory or holiday specials. \n \nTraveled to represent the company at industry trade shows. \n \nPresented product training to customer sales teams. Quality Control Google Inc June 2008  –  September 2008  (4 months) Mountain View Team member of the Google Books Project (books.google.com) \n \nDebugged and tested content quality before final upload to database. Afterschool Teacher Morningstar October 2006  –  July 2007  (10 months) Santa Clara Worked with elementary school students on math, grammar, and soccer. Senior Technical Account Manager EdCast Inc July 2015  – Present (2 months) Mountain View Business Development, Sales Operations, & Account Management \n \nCustomer Success Manager North America \n \nVoice of the Customer - Liason Between Clients + Internal Engineering/Product team \n \nFront-end Web Development, Client Website Customization \n \nAmazon Web Services -- EC2 / S3 Cloud Server Deployment  \n \nCustom Domain Setup, Analytics, and SSL Security  \n \nSalesforce Administrator / Leads Automation / Reporting Senior Technical Account Manager EdCast Inc July 2015  – Present (2 months) Mountain View Business Development, Sales Operations, & Account Management \n \nCustomer Success Manager North America \n \nVoice of the Customer - Liason Between Clients + Internal Engineering/Product team \n \nFront-end Web Development, Client Website Customization \n \nAmazon Web Services -- EC2 / S3 Cloud Server Deployment  \n \nCustom Domain Setup, Analytics, and SSL Security  \n \nSalesforce Administrator / Leads Automation / Reporting Technical Account Manager EdCast Inc October 2014  –  July 2015  (10 months) Mountain View Technical Account Manager EdCast Inc October 2014  –  July 2015  (10 months) Mountain View Consultant EdCast July 2014  –  October 2014  (4 months) Mountain View Consultant EdCast July 2014  –  October 2014  (4 months) Mountain View Web/Mobile Engineering Intern NameCoach April 2014  –  July 2014  (4 months) Stanford, CA Web/Mobile Upgrade \n \nDesigned the look and feel of the website with UI improvements based on user research. \n \nManipulated Javascript and JQuery to create interactive features for our users. \n \nImplemented responsive design for mobile to desktop and cross-browser, etc. \n \nDebugged existing features developed new ones to improve UX. \n \nConducted routine testing for QA purposes and to map improvements. \n \nAdapted existing product for mobile versions and also for new markets. \n \n \nHTML5/CSS  \nTwitter Bootstrap  \nJavascript/JQuery  \nRuby on Rails  \nPostgreSQL  \nGitHub Web/Mobile Engineering Intern NameCoach April 2014  –  July 2014  (4 months) Stanford, CA Web/Mobile Upgrade \n \nDesigned the look and feel of the website with UI improvements based on user research. \n \nManipulated Javascript and JQuery to create interactive features for our users. \n \nImplemented responsive design for mobile to desktop and cross-browser, etc. \n \nDebugged existing features developed new ones to improve UX. \n \nConducted routine testing for QA purposes and to map improvements. \n \nAdapted existing product for mobile versions and also for new markets. \n \n \nHTML5/CSS  \nTwitter Bootstrap  \nJavascript/JQuery  \nRuby on Rails  \nPostgreSQL  \nGitHub Account Manager ASUS March 2012  –  November 2012  (9 months) Fremont, CA Account Management Role for Amazon, TigerDirect, and Microcenter. \n \nManaged entry/content quality assurance on all three E-commerce platforms. \n \nCoordinated shipping and supply chain management.  \n \nQueried databases to monitor inventory/sales run rates. \n \nCreated promotions to ramp up sales for aging inventory or holiday specials. \n \nTraveled to represent the company at industry trade shows. \n \nPresented product training to customer sales teams. Account Manager ASUS March 2012  –  November 2012  (9 months) Fremont, CA Account Management Role for Amazon, TigerDirect, and Microcenter. \n \nManaged entry/content quality assurance on all three E-commerce platforms. \n \nCoordinated shipping and supply chain management.  \n \nQueried databases to monitor inventory/sales run rates. \n \nCreated promotions to ramp up sales for aging inventory or holiday specials. \n \nTraveled to represent the company at industry trade shows. \n \nPresented product training to customer sales teams. Quality Control Google Inc June 2008  –  September 2008  (4 months) Mountain View Team member of the Google Books Project (books.google.com) \n \nDebugged and tested content quality before final upload to database. Quality Control Google Inc June 2008  –  September 2008  (4 months) Mountain View Team member of the Google Books Project (books.google.com) \n \nDebugged and tested content quality before final upload to database. Afterschool Teacher Morningstar October 2006  –  July 2007  (10 months) Santa Clara Worked with elementary school students on math, grammar, and soccer. Afterschool Teacher Morningstar October 2006  –  July 2007  (10 months) Santa Clara Worked with elementary school students on math, grammar, and soccer. Languages   Skills Sales MySQL CSS HTML JavaScript Ruby on Rails Git jQuery Mandarin HubSpot PHP Sales Operations Microsoft Excel Customer Service Heroku jQuery UI E-commerce SSL Certificates Data Analysis PowerPoint Microsoft Office Microsoft Word Account Management Salesforce.com Supply Chain Consulting Object Oriented Design Business Development Photoshop Java Camtasia See 15+     See less Skills  Sales MySQL CSS HTML JavaScript Ruby on Rails Git jQuery Mandarin HubSpot PHP Sales Operations Microsoft Excel Customer Service Heroku jQuery UI E-commerce SSL Certificates Data Analysis PowerPoint Microsoft Office Microsoft Word Account Management Salesforce.com Supply Chain Consulting Object Oriented Design Business Development Photoshop Java Camtasia See 15+     See less Sales MySQL CSS HTML JavaScript Ruby on Rails Git jQuery Mandarin HubSpot PHP Sales Operations Microsoft Excel Customer Service Heroku jQuery UI E-commerce SSL Certificates Data Analysis PowerPoint Microsoft Office Microsoft Word Account Management Salesforce.com Supply Chain Consulting Object Oriented Design Business Development Photoshop Java Camtasia See 15+     See less Sales MySQL CSS HTML JavaScript Ruby on Rails Git jQuery Mandarin HubSpot PHP Sales Operations Microsoft Excel Customer Service Heroku jQuery UI E-commerce SSL Certificates Data Analysis PowerPoint Microsoft Office Microsoft Word Account Management Salesforce.com Supply Chain Consulting Object Oriented Design Business Development Photoshop Java Camtasia See 15+     See less Education University of California, San Diego Bachelors,  Economics 2007  – 2011 Activities and Societies:  Delta Sigma Pi - Professional Business Fraternity - Served as the Intercampus Liason Coding Dojo Full-stack Web Development,  Computer Software Engineering 2014  – 2014 University of California, San Diego Bachelors,  Economics 2007  – 2011 Activities and Societies:  Delta Sigma Pi - Professional Business Fraternity - Served as the Intercampus Liason University of California, San Diego Bachelors,  Economics 2007  – 2011 Activities and Societies:  Delta Sigma Pi - Professional Business Fraternity - Served as the Intercampus Liason University of California, San Diego Bachelors,  Economics 2007  – 2011 Activities and Societies:  Delta Sigma Pi - Professional Business Fraternity - Served as the Intercampus Liason Coding Dojo Full-stack Web Development,  Computer Software Engineering 2014  – 2014 Coding Dojo Full-stack Web Development,  Computer Software Engineering 2014  – 2014 Coding Dojo Full-stack Web Development,  Computer Software Engineering 2014  – 2014 Honors & Awards ", "Summary Strategic client services including project management. Summary Strategic client services including project management. Strategic client services including project management. Strategic client services including project management. Languages German German German Skills DoubleClick Rich Media Behavioral Targeting Display Advertising Ad Networks Mobile Advertising Online Advertising Analytics SEM Digital Strategy Advertising Operations Ad Serving Video Web Analytics Omniture E-commerce Email Marketing PPC Leadership Strategy Google Adwords Affiliate Marketing Mobile Marketing Advertising Conversion Optimization Digital Marketing Web Marketing Management SEO Google Analytics Interactive Marketing Digital Media Search Advertising Online Marketing Customer Acquisition Campaign Management See 21+     See less Skills  DoubleClick Rich Media Behavioral Targeting Display Advertising Ad Networks Mobile Advertising Online Advertising Analytics SEM Digital Strategy Advertising Operations Ad Serving Video Web Analytics Omniture E-commerce Email Marketing PPC Leadership Strategy Google Adwords Affiliate Marketing Mobile Marketing Advertising Conversion Optimization Digital Marketing Web Marketing Management SEO Google Analytics Interactive Marketing Digital Media Search Advertising Online Marketing Customer Acquisition Campaign Management See 21+     See less DoubleClick Rich Media Behavioral Targeting Display Advertising Ad Networks Mobile Advertising Online Advertising Analytics SEM Digital Strategy Advertising Operations Ad Serving Video Web Analytics Omniture E-commerce Email Marketing PPC Leadership Strategy Google Adwords Affiliate Marketing Mobile Marketing Advertising Conversion Optimization Digital Marketing Web Marketing Management SEO Google Analytics Interactive Marketing Digital Media Search Advertising Online Marketing Customer Acquisition Campaign Management See 21+     See less DoubleClick Rich Media Behavioral Targeting Display Advertising Ad Networks Mobile Advertising Online Advertising Analytics SEM Digital Strategy Advertising Operations Ad Serving Video Web Analytics Omniture E-commerce Email Marketing PPC Leadership Strategy Google Adwords Affiliate Marketing Mobile Marketing Advertising Conversion Optimization Digital Marketing Web Marketing Management SEO Google Analytics Interactive Marketing Digital Media Search Advertising Online Marketing Customer Acquisition Campaign Management See 21+     See less ", "Languages English Native or bilingual proficiency German Native or bilingual proficiency English Native or bilingual proficiency German Native or bilingual proficiency English Native or bilingual proficiency German Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Management Project Management Customer Service Strategic Planning New Hires Software Development Problem Solving Analytical Skills Analytic Thinking Microsoft Office HTML scripting PHP Google Docs DoubleClick Online Advertising People Skills Team Leadership Team Management Multicultural Multilingual Ad Serving Mobile Advertising Ad Networks Web Analytics See 9+     See less Skills  Management Project Management Customer Service Strategic Planning New Hires Software Development Problem Solving Analytical Skills Analytic Thinking Microsoft Office HTML scripting PHP Google Docs DoubleClick Online Advertising People Skills Team Leadership Team Management Multicultural Multilingual Ad Serving Mobile Advertising Ad Networks Web Analytics See 9+     See less Management Project Management Customer Service Strategic Planning New Hires Software Development Problem Solving Analytical Skills Analytic Thinking Microsoft Office HTML scripting PHP Google Docs DoubleClick Online Advertising People Skills Team Leadership Team Management Multicultural Multilingual Ad Serving Mobile Advertising Ad Networks Web Analytics See 9+     See less Management Project Management Customer Service Strategic Planning New Hires Software Development Problem Solving Analytical Skills Analytic Thinking Microsoft Office HTML scripting PHP Google Docs DoubleClick Online Advertising People Skills Team Leadership Team Management Multicultural Multilingual Ad Serving Mobile Advertising Ad Networks Web Analytics See 9+     See less ", "Summary I am an established technology professional with wide-ranging expertise in both technical and business roles. I started my career in the mobile world, working on software development, feature design and architecture. Lately, I’ve been working on product definition, technical partnerships and scaling projects. \n \n- Expert in technical partner interaction and data interchange \n- Excel on elegant designs, development paradigms and high software quality \n- Experienced in leading software development teams, using Scrum and Agile development methodologies \n- Extensive background in product development cycles, effective cross functional communication and understanding technical and business aspects \n- Work experience spanning four different countries \n \nTechnical specialties \nC, C++, Java, Javascript, Python, HTML, XML, REST APIs, JSON, Mobile development, AppEngine, SQL \n Summary I am an established technology professional with wide-ranging expertise in both technical and business roles. I started my career in the mobile world, working on software development, feature design and architecture. Lately, I’ve been working on product definition, technical partnerships and scaling projects. \n \n- Expert in technical partner interaction and data interchange \n- Excel on elegant designs, development paradigms and high software quality \n- Experienced in leading software development teams, using Scrum and Agile development methodologies \n- Extensive background in product development cycles, effective cross functional communication and understanding technical and business aspects \n- Work experience spanning four different countries \n \nTechnical specialties \nC, C++, Java, Javascript, Python, HTML, XML, REST APIs, JSON, Mobile development, AppEngine, SQL \n I am an established technology professional with wide-ranging expertise in both technical and business roles. I started my career in the mobile world, working on software development, feature design and architecture. Lately, I’ve been working on product definition, technical partnerships and scaling projects. \n \n- Expert in technical partner interaction and data interchange \n- Excel on elegant designs, development paradigms and high software quality \n- Experienced in leading software development teams, using Scrum and Agile development methodologies \n- Extensive background in product development cycles, effective cross functional communication and understanding technical and business aspects \n- Work experience spanning four different countries \n \nTechnical specialties \nC, C++, Java, Javascript, Python, HTML, XML, REST APIs, JSON, Mobile development, AppEngine, SQL \n I am an established technology professional with wide-ranging expertise in both technical and business roles. I started my career in the mobile world, working on software development, feature design and architecture. Lately, I’ve been working on product definition, technical partnerships and scaling projects. \n \n- Expert in technical partner interaction and data interchange \n- Excel on elegant designs, development paradigms and high software quality \n- Experienced in leading software development teams, using Scrum and Agile development methodologies \n- Extensive background in product development cycles, effective cross functional communication and understanding technical and business aspects \n- Work experience spanning four different countries \n \nTechnical specialties \nC, C++, Java, Javascript, Python, HTML, XML, REST APIs, JSON, Mobile development, AppEngine, SQL \n Experience Sr. Partner Technology Manager - Search Google December 2012  – Present (2 years 9 months) San Francisco Bay Area Lead for civic and electoral data acquisition, driving Google’s Politics & Elections programs. \nDefined requirements and drove implementation of key scaling projects. \nCreated and mentored an international team of Technology Managers, to handle Crisis Response and Elections projects in their regions. \n \nCrisis Response: \nLaunched Crisis Response in various countries, working with government and NGOs. \n- Coordinated partner technical discussions, establishing project plans and driving integration. \n \nCivics & Elections: \n- Set up Google landing pages for multiple world elections, collaborating with regional teams. \n- Drove elections data acquisition in Italy, Australia, India, Brazil, US. \n- Wrote data fetching and parsing components in Python and Java. Sr. Technical Account Manager - Commerce Google February 2011  –  November 2012  (1 year 10 months) San Francisco Bay Area Google Wallet \n- Initial launch of NFC Google Wallet. Drove merchant integration, defining processes and best practices for system integrators. \n \nInternal payments platform \n- Created new team focusing on payments integrations for internal products. \n \nBuy with Google \n- Drove initial partner integrations for the project, while on stealth mode before launch. \n Principal Software Engineer Nokia July 2009  –  March 2011  (1 year 9 months) Copenhagen Area, Denmark Led and designed Qt based applications and components based for the Symbian platform. \nDefined collaboration methodologies with third-party SW providers and aligned technical efforts across MeeGo and Symbian as needed, mainly in Qt Mobility API definition. \nFounded a new Differentiating Software team in Copenhagen, providing internal trainings and guidance. The main focus was ramping up on C++, Symbian and the optimal infrastructure for software development. \nMentored 15 senior software developers and architects on the site's initial projects, from the project's initial architecture definition phase, through the development phase and until architecture verification. \n Services Senior Engineer (Short Term Internal Transfer) Nokia Oulu January 2010  –  March 2010  (3 months) Finland Formed part of the elite team working in Ovi Contacts for Nokia N8, working with Qt Web Runtime technology. \nOwned the Single Sign On integration effort. I worked closely with multiple teams around the globe, responsible for the client component and back end. \nRecommended Nokia's Client Platform team on ways to improve APIs, verification methodologies and overall design. My main focus was on the Software Update flows and SSO. SW Concepting Specialist Nokia Copenhagen January 2009  –  July 2009  (7 months) Copenhagen Area, Denmark As Software Chief I handled all software concepting activities in the product program. \nCollaborated with the program’s leadership team and key stakeholders, to help define the product story in a holistic way. \nEstablished an excellent internal network with teams in multiple software organizations worldwide. \nCoached other team members in our Copenhagen software concepting organization, regarding the Symbian structure and processes. \nAssisted the global software concepting architecture team in reviewing some software studies prepared for other concepting programs. Senior Software Engineer Nokia San Diego March 2004  –  January 2009  (4 years 11 months) Greater San Diego Area Scrum Master and Team Lead in San Diego for the AT&T specific features. In this role, I worked together with the main development team in Bangalore, and the architecture team in Finland. \nLed development for illumination control of the first S60 device created in San Diego, collaborating with Hardware, Software and Middle-ware teams, as well as Product Management. \n- Worked with many software layers in the device, from UI customization, middleware, HW abstraction and device drivers. In this project, I defined the overall architecture and expanded the needed APIs according to the product program needs. \n \nDesigned and developed custom operator requirements for Sprint handsets for the first Nokia handsets approved in Sprint's network. \n \nLed integration work of Nokia PictureMail, using Lightsurf's Multimedia Communications Library. \n- Coordinated development activities with Lightsurf software counterparts, positively influencing their system design in order to meet mobile software requirements. \n- Negotiated PictureMail compliancy with Sprint representatives to resolve gating issues. \n \nLed UI customization project targeting Brazilian operator Vivo, achieving 5 mobile phone approvals according to the original schedule. \n Software Consultant Teleca Software Solutions AB June 2001  –  March 2004  (2 years 10 months) Greater San Diego Area Worked in several in-house and outsourced projects as a consultant. \nDesigend and developed an XML engine for an internal product, 3G IOTA client, using Qualcomm's development platform. \nDeveloped a Bluetooth Basic Printing Profile for the Widcomm Bluetooth stack. Java Software Developer Sony Electronics January 1999  –  June 2001  (2 years 6 months) Mexicali Area, Mexico Designed and implemented multi-tier client-server applications, providing real time monitors for production control. Interfaced with legacy hardware and software to extract production data, converting it into valuable status real-time information. \nDeveloped several intranet sites for internal communications and departmental Electronic Data Interchange. Sr. Partner Technology Manager - Search Google December 2012  – Present (2 years 9 months) San Francisco Bay Area Lead for civic and electoral data acquisition, driving Google’s Politics & Elections programs. \nDefined requirements and drove implementation of key scaling projects. \nCreated and mentored an international team of Technology Managers, to handle Crisis Response and Elections projects in their regions. \n \nCrisis Response: \nLaunched Crisis Response in various countries, working with government and NGOs. \n- Coordinated partner technical discussions, establishing project plans and driving integration. \n \nCivics & Elections: \n- Set up Google landing pages for multiple world elections, collaborating with regional teams. \n- Drove elections data acquisition in Italy, Australia, India, Brazil, US. \n- Wrote data fetching and parsing components in Python and Java. Sr. Partner Technology Manager - Search Google December 2012  – Present (2 years 9 months) San Francisco Bay Area Lead for civic and electoral data acquisition, driving Google’s Politics & Elections programs. \nDefined requirements and drove implementation of key scaling projects. \nCreated and mentored an international team of Technology Managers, to handle Crisis Response and Elections projects in their regions. \n \nCrisis Response: \nLaunched Crisis Response in various countries, working with government and NGOs. \n- Coordinated partner technical discussions, establishing project plans and driving integration. \n \nCivics & Elections: \n- Set up Google landing pages for multiple world elections, collaborating with regional teams. \n- Drove elections data acquisition in Italy, Australia, India, Brazil, US. \n- Wrote data fetching and parsing components in Python and Java. Sr. Technical Account Manager - Commerce Google February 2011  –  November 2012  (1 year 10 months) San Francisco Bay Area Google Wallet \n- Initial launch of NFC Google Wallet. Drove merchant integration, defining processes and best practices for system integrators. \n \nInternal payments platform \n- Created new team focusing on payments integrations for internal products. \n \nBuy with Google \n- Drove initial partner integrations for the project, while on stealth mode before launch. \n Sr. Technical Account Manager - Commerce Google February 2011  –  November 2012  (1 year 10 months) San Francisco Bay Area Google Wallet \n- Initial launch of NFC Google Wallet. Drove merchant integration, defining processes and best practices for system integrators. \n \nInternal payments platform \n- Created new team focusing on payments integrations for internal products. \n \nBuy with Google \n- Drove initial partner integrations for the project, while on stealth mode before launch. \n Principal Software Engineer Nokia July 2009  –  March 2011  (1 year 9 months) Copenhagen Area, Denmark Led and designed Qt based applications and components based for the Symbian platform. \nDefined collaboration methodologies with third-party SW providers and aligned technical efforts across MeeGo and Symbian as needed, mainly in Qt Mobility API definition. \nFounded a new Differentiating Software team in Copenhagen, providing internal trainings and guidance. The main focus was ramping up on C++, Symbian and the optimal infrastructure for software development. \nMentored 15 senior software developers and architects on the site's initial projects, from the project's initial architecture definition phase, through the development phase and until architecture verification. \n Principal Software Engineer Nokia July 2009  –  March 2011  (1 year 9 months) Copenhagen Area, Denmark Led and designed Qt based applications and components based for the Symbian platform. \nDefined collaboration methodologies with third-party SW providers and aligned technical efforts across MeeGo and Symbian as needed, mainly in Qt Mobility API definition. \nFounded a new Differentiating Software team in Copenhagen, providing internal trainings and guidance. The main focus was ramping up on C++, Symbian and the optimal infrastructure for software development. \nMentored 15 senior software developers and architects on the site's initial projects, from the project's initial architecture definition phase, through the development phase and until architecture verification. \n Services Senior Engineer (Short Term Internal Transfer) Nokia Oulu January 2010  –  March 2010  (3 months) Finland Formed part of the elite team working in Ovi Contacts for Nokia N8, working with Qt Web Runtime technology. \nOwned the Single Sign On integration effort. I worked closely with multiple teams around the globe, responsible for the client component and back end. \nRecommended Nokia's Client Platform team on ways to improve APIs, verification methodologies and overall design. My main focus was on the Software Update flows and SSO. Services Senior Engineer (Short Term Internal Transfer) Nokia Oulu January 2010  –  March 2010  (3 months) Finland Formed part of the elite team working in Ovi Contacts for Nokia N8, working with Qt Web Runtime technology. \nOwned the Single Sign On integration effort. I worked closely with multiple teams around the globe, responsible for the client component and back end. \nRecommended Nokia's Client Platform team on ways to improve APIs, verification methodologies and overall design. My main focus was on the Software Update flows and SSO. SW Concepting Specialist Nokia Copenhagen January 2009  –  July 2009  (7 months) Copenhagen Area, Denmark As Software Chief I handled all software concepting activities in the product program. \nCollaborated with the program’s leadership team and key stakeholders, to help define the product story in a holistic way. \nEstablished an excellent internal network with teams in multiple software organizations worldwide. \nCoached other team members in our Copenhagen software concepting organization, regarding the Symbian structure and processes. \nAssisted the global software concepting architecture team in reviewing some software studies prepared for other concepting programs. SW Concepting Specialist Nokia Copenhagen January 2009  –  July 2009  (7 months) Copenhagen Area, Denmark As Software Chief I handled all software concepting activities in the product program. \nCollaborated with the program’s leadership team and key stakeholders, to help define the product story in a holistic way. \nEstablished an excellent internal network with teams in multiple software organizations worldwide. \nCoached other team members in our Copenhagen software concepting organization, regarding the Symbian structure and processes. \nAssisted the global software concepting architecture team in reviewing some software studies prepared for other concepting programs. Senior Software Engineer Nokia San Diego March 2004  –  January 2009  (4 years 11 months) Greater San Diego Area Scrum Master and Team Lead in San Diego for the AT&T specific features. In this role, I worked together with the main development team in Bangalore, and the architecture team in Finland. \nLed development for illumination control of the first S60 device created in San Diego, collaborating with Hardware, Software and Middle-ware teams, as well as Product Management. \n- Worked with many software layers in the device, from UI customization, middleware, HW abstraction and device drivers. In this project, I defined the overall architecture and expanded the needed APIs according to the product program needs. \n \nDesigned and developed custom operator requirements for Sprint handsets for the first Nokia handsets approved in Sprint's network. \n \nLed integration work of Nokia PictureMail, using Lightsurf's Multimedia Communications Library. \n- Coordinated development activities with Lightsurf software counterparts, positively influencing their system design in order to meet mobile software requirements. \n- Negotiated PictureMail compliancy with Sprint representatives to resolve gating issues. \n \nLed UI customization project targeting Brazilian operator Vivo, achieving 5 mobile phone approvals according to the original schedule. \n Senior Software Engineer Nokia San Diego March 2004  –  January 2009  (4 years 11 months) Greater San Diego Area Scrum Master and Team Lead in San Diego for the AT&T specific features. In this role, I worked together with the main development team in Bangalore, and the architecture team in Finland. \nLed development for illumination control of the first S60 device created in San Diego, collaborating with Hardware, Software and Middle-ware teams, as well as Product Management. \n- Worked with many software layers in the device, from UI customization, middleware, HW abstraction and device drivers. In this project, I defined the overall architecture and expanded the needed APIs according to the product program needs. \n \nDesigned and developed custom operator requirements for Sprint handsets for the first Nokia handsets approved in Sprint's network. \n \nLed integration work of Nokia PictureMail, using Lightsurf's Multimedia Communications Library. \n- Coordinated development activities with Lightsurf software counterparts, positively influencing their system design in order to meet mobile software requirements. \n- Negotiated PictureMail compliancy with Sprint representatives to resolve gating issues. \n \nLed UI customization project targeting Brazilian operator Vivo, achieving 5 mobile phone approvals according to the original schedule. \n Software Consultant Teleca Software Solutions AB June 2001  –  March 2004  (2 years 10 months) Greater San Diego Area Worked in several in-house and outsourced projects as a consultant. \nDesigend and developed an XML engine for an internal product, 3G IOTA client, using Qualcomm's development platform. \nDeveloped a Bluetooth Basic Printing Profile for the Widcomm Bluetooth stack. Software Consultant Teleca Software Solutions AB June 2001  –  March 2004  (2 years 10 months) Greater San Diego Area Worked in several in-house and outsourced projects as a consultant. \nDesigend and developed an XML engine for an internal product, 3G IOTA client, using Qualcomm's development platform. \nDeveloped a Bluetooth Basic Printing Profile for the Widcomm Bluetooth stack. Java Software Developer Sony Electronics January 1999  –  June 2001  (2 years 6 months) Mexicali Area, Mexico Designed and implemented multi-tier client-server applications, providing real time monitors for production control. Interfaced with legacy hardware and software to extract production data, converting it into valuable status real-time information. \nDeveloped several intranet sites for internal communications and departmental Electronic Data Interchange. Java Software Developer Sony Electronics January 1999  –  June 2001  (2 years 6 months) Mexicali Area, Mexico Designed and implemented multi-tier client-server applications, providing real time monitors for production control. Interfaced with legacy hardware and software to extract production data, converting it into valuable status real-time information. \nDeveloped several intranet sites for internal communications and departmental Electronic Data Interchange. Languages English Native or bilingual proficiency Spanish Native or bilingual proficiency French Professional working proficiency Danish Elementary proficiency English Native or bilingual proficiency Spanish Native or bilingual proficiency French Professional working proficiency Danish Elementary proficiency English Native or bilingual proficiency Spanish Native or bilingual proficiency French Professional working proficiency Danish Elementary proficiency Native or bilingual proficiency Native or bilingual proficiency Professional working proficiency Elementary proficiency Skills Project Execution Partner Management Software Design Symbian Qt C++ C JavaScript HTML Mobile Agile Software Development API JSON Agile Methodologies Scrum User Interface Mobile Communications Mobile Devices Architecture Project Management Software Engineering APIs Mobile Applications System Architecture Cross-functional Team... User Interface Design Linux Web Development Android Embedded Software Architectures Integration XML Java Agile Project Management Embedded Systems Object Oriented Design See 23+     See less Skills  Project Execution Partner Management Software Design Symbian Qt C++ C JavaScript HTML Mobile Agile Software Development API JSON Agile Methodologies Scrum User Interface Mobile Communications Mobile Devices Architecture Project Management Software Engineering APIs Mobile Applications System Architecture Cross-functional Team... User Interface Design Linux Web Development Android Embedded Software Architectures Integration XML Java Agile Project Management Embedded Systems Object Oriented Design See 23+     See less Project Execution Partner Management Software Design Symbian Qt C++ C JavaScript HTML Mobile Agile Software Development API JSON Agile Methodologies Scrum User Interface Mobile Communications Mobile Devices Architecture Project Management Software Engineering APIs Mobile Applications System Architecture Cross-functional Team... User Interface Design Linux Web Development Android Embedded Software Architectures Integration XML Java Agile Project Management Embedded Systems Object Oriented Design See 23+     See less Project Execution Partner Management Software Design Symbian Qt C++ C JavaScript HTML Mobile Agile Software Development API JSON Agile Methodologies Scrum User Interface Mobile Communications Mobile Devices Architecture Project Management Software Engineering APIs Mobile Applications System Architecture Cross-functional Team... User Interface Design Linux Web Development Android Embedded Software Architectures Integration XML Java Agile Project Management Embedded Systems Object Oriented Design See 23+     See less Education CETYS Universidad Cybernetics Engineering,  BSc. 1996  – 2000 Focused on networks and teleprocessing \n Activities and Societies:  Cetys Orchestra founder Concordia University BS Electrical Engineering (exchange student),  Computer Architecture ,  Operating Systems , Operations Research,  Electronics 1998  – 1999 Activities and Societies:  International Students Associacion CETYS Universidad Cybernetics Engineering,  BSc. 1996  – 2000 Focused on networks and teleprocessing \n Activities and Societies:  Cetys Orchestra founder CETYS Universidad Cybernetics Engineering,  BSc. 1996  – 2000 Focused on networks and teleprocessing \n Activities and Societies:  Cetys Orchestra founder CETYS Universidad Cybernetics Engineering,  BSc. 1996  – 2000 Focused on networks and teleprocessing \n Activities and Societies:  Cetys Orchestra founder Concordia University BS Electrical Engineering (exchange student),  Computer Architecture ,  Operating Systems , Operations Research,  Electronics 1998  – 1999 Activities and Societies:  International Students Associacion Concordia University BS Electrical Engineering (exchange student),  Computer Architecture ,  Operating Systems , Operations Research,  Electronics 1998  – 1999 Activities and Societies:  International Students Associacion Concordia University BS Electrical Engineering (exchange student),  Computer Architecture ,  Operating Systems , Operations Research,  Electronics 1998  – 1999 Activities and Societies:  International Students Associacion ", "Summary Specialties:• Programming Languages/Operating Systems: C++, Visual Basic, Bloomberg, AutoCAD, MATLAB, Windows, UNIX, MS-DOS \n• Languages: Proficient in Spanish, Hindi, and Gujarati \n• Activities: T.V. Asia On-Air Correspondant, Asian Pacific American Forum Executive Board (July 2007 – Present), GE Women’s Network Member (July 2007 – Present), Volleyball Captain (June 2010-Sept 2010), School of Visual Arts (April 2009 – Aug 2009) \n• Hobbies: Piano, Clarinet, Golf, Basketball, International Travel, Art Summary Specialties:• Programming Languages/Operating Systems: C++, Visual Basic, Bloomberg, AutoCAD, MATLAB, Windows, UNIX, MS-DOS \n• Languages: Proficient in Spanish, Hindi, and Gujarati \n• Activities: T.V. Asia On-Air Correspondant, Asian Pacific American Forum Executive Board (July 2007 – Present), GE Women’s Network Member (July 2007 – Present), Volleyball Captain (June 2010-Sept 2010), School of Visual Arts (April 2009 – Aug 2009) \n• Hobbies: Piano, Clarinet, Golf, Basketball, International Travel, Art Specialties:• Programming Languages/Operating Systems: C++, Visual Basic, Bloomberg, AutoCAD, MATLAB, Windows, UNIX, MS-DOS \n• Languages: Proficient in Spanish, Hindi, and Gujarati \n• Activities: T.V. Asia On-Air Correspondant, Asian Pacific American Forum Executive Board (July 2007 – Present), GE Women’s Network Member (July 2007 – Present), Volleyball Captain (June 2010-Sept 2010), School of Visual Arts (April 2009 – Aug 2009) \n• Hobbies: Piano, Clarinet, Golf, Basketball, International Travel, Art Specialties:• Programming Languages/Operating Systems: C++, Visual Basic, Bloomberg, AutoCAD, MATLAB, Windows, UNIX, MS-DOS \n• Languages: Proficient in Spanish, Hindi, and Gujarati \n• Activities: T.V. Asia On-Air Correspondant, Asian Pacific American Forum Executive Board (July 2007 – Present), GE Women’s Network Member (July 2007 – Present), Volleyball Captain (June 2010-Sept 2010), School of Visual Arts (April 2009 – Aug 2009) \n• Hobbies: Piano, Clarinet, Golf, Basketball, International Travel, Art Experience Sr. Technical Account Manager, Ad Exchange Google January 2012  – Present (3 years 8 months) New York Manager of Production Strategy NBC Universal October 2009  –  January 2012  (2 years 4 months) Manage, monitor, and troubleshoot day to day On-Air and Off-Air defects targeting 99.999% reliability for all of NBC and MSNBC live programming covering over 37.5 hours (i.e. Today Show, Nightly News, News Nation with Tamron Hall, Rachel Maddow). Statistically evaluate key metrics and drive analytics to develop short term and long term strategies for east coast production services including Studio Operations, Edit Operations, News Operations, and Graphics, to enable greater workflow efficiencies, project execution, and savings. Operations Management Leadership Program (OMLP) General Electric - NBC Universal July 2007  –  October 2009  (2 years 4 months) Participated in GE’s leadership program comprised of four 6-month rotations designed to strengthen technical and operational acumen to develop business leaders. \n \nOperations Manager, NBC2Go Broadcast Distribution \n• Managed four 24 by 7 channel streams for MSNBC, CNBC, and NBC generating $20mm in revenue per year with 99.998% reliability \n• Led the High Definition mobile migration enabling over $350k in capital & operational savings \n• Prepared the budget to operate the mobile platform and managed the staff and scheduling of 5 direct reports \n \nStrategic Analyst, International Studio Franchise  \n• Analyzed and forecasted film production trends for over 50 countries with $20mm in strategic investments \n• Identified seven attractive partnerships to expand production services with over $4mm operating profit opportunity \n \nDigital Media Manager, Sound Post-Production \n• Process mapped the current & desired film and television asset workflow for 5 business units \n• Developed a detailed proposal for the functionality and CTQs for a Digital Asset Management system for the Universal Sound department \n \nProject Manager, HD Cable Upgrade & New Media Dist.  \n• Project managed the HD Cable upgrade and aided in the completion of 93% high priority issues \n• Led the vendor selection process for a New Media distribution tool and designed the logic for the optimal system Fixed Income/ High Yield Intern UBS Investment Bank June 2006  –  August 2006  (3 months) • Constructed comprehensive financial models and sensitivity analysis for High Yield companies to determine current and future earnings \n• Evaluated and monitored a portfolio of event and market-driven debt investments undergoing balance sheet restructuring and refinancing \n• Analyzed a portfolio of companies based on financials, relative value, and credit risks and presented an investment recommendation Sr. Technical Account Manager, Ad Exchange Google January 2012  – Present (3 years 8 months) New York Sr. Technical Account Manager, Ad Exchange Google January 2012  – Present (3 years 8 months) New York Manager of Production Strategy NBC Universal October 2009  –  January 2012  (2 years 4 months) Manage, monitor, and troubleshoot day to day On-Air and Off-Air defects targeting 99.999% reliability for all of NBC and MSNBC live programming covering over 37.5 hours (i.e. Today Show, Nightly News, News Nation with Tamron Hall, Rachel Maddow). Statistically evaluate key metrics and drive analytics to develop short term and long term strategies for east coast production services including Studio Operations, Edit Operations, News Operations, and Graphics, to enable greater workflow efficiencies, project execution, and savings. Manager of Production Strategy NBC Universal October 2009  –  January 2012  (2 years 4 months) Manage, monitor, and troubleshoot day to day On-Air and Off-Air defects targeting 99.999% reliability for all of NBC and MSNBC live programming covering over 37.5 hours (i.e. Today Show, Nightly News, News Nation with Tamron Hall, Rachel Maddow). Statistically evaluate key metrics and drive analytics to develop short term and long term strategies for east coast production services including Studio Operations, Edit Operations, News Operations, and Graphics, to enable greater workflow efficiencies, project execution, and savings. Operations Management Leadership Program (OMLP) General Electric - NBC Universal July 2007  –  October 2009  (2 years 4 months) Participated in GE’s leadership program comprised of four 6-month rotations designed to strengthen technical and operational acumen to develop business leaders. \n \nOperations Manager, NBC2Go Broadcast Distribution \n• Managed four 24 by 7 channel streams for MSNBC, CNBC, and NBC generating $20mm in revenue per year with 99.998% reliability \n• Led the High Definition mobile migration enabling over $350k in capital & operational savings \n• Prepared the budget to operate the mobile platform and managed the staff and scheduling of 5 direct reports \n \nStrategic Analyst, International Studio Franchise  \n• Analyzed and forecasted film production trends for over 50 countries with $20mm in strategic investments \n• Identified seven attractive partnerships to expand production services with over $4mm operating profit opportunity \n \nDigital Media Manager, Sound Post-Production \n• Process mapped the current & desired film and television asset workflow for 5 business units \n• Developed a detailed proposal for the functionality and CTQs for a Digital Asset Management system for the Universal Sound department \n \nProject Manager, HD Cable Upgrade & New Media Dist.  \n• Project managed the HD Cable upgrade and aided in the completion of 93% high priority issues \n• Led the vendor selection process for a New Media distribution tool and designed the logic for the optimal system Operations Management Leadership Program (OMLP) General Electric - NBC Universal July 2007  –  October 2009  (2 years 4 months) Participated in GE’s leadership program comprised of four 6-month rotations designed to strengthen technical and operational acumen to develop business leaders. \n \nOperations Manager, NBC2Go Broadcast Distribution \n• Managed four 24 by 7 channel streams for MSNBC, CNBC, and NBC generating $20mm in revenue per year with 99.998% reliability \n• Led the High Definition mobile migration enabling over $350k in capital & operational savings \n• Prepared the budget to operate the mobile platform and managed the staff and scheduling of 5 direct reports \n \nStrategic Analyst, International Studio Franchise  \n• Analyzed and forecasted film production trends for over 50 countries with $20mm in strategic investments \n• Identified seven attractive partnerships to expand production services with over $4mm operating profit opportunity \n \nDigital Media Manager, Sound Post-Production \n• Process mapped the current & desired film and television asset workflow for 5 business units \n• Developed a detailed proposal for the functionality and CTQs for a Digital Asset Management system for the Universal Sound department \n \nProject Manager, HD Cable Upgrade & New Media Dist.  \n• Project managed the HD Cable upgrade and aided in the completion of 93% high priority issues \n• Led the vendor selection process for a New Media distribution tool and designed the logic for the optimal system Fixed Income/ High Yield Intern UBS Investment Bank June 2006  –  August 2006  (3 months) • Constructed comprehensive financial models and sensitivity analysis for High Yield companies to determine current and future earnings \n• Evaluated and monitored a portfolio of event and market-driven debt investments undergoing balance sheet restructuring and refinancing \n• Analyzed a portfolio of companies based on financials, relative value, and credit risks and presented an investment recommendation Fixed Income/ High Yield Intern UBS Investment Bank June 2006  –  August 2006  (3 months) • Constructed comprehensive financial models and sensitivity analysis for High Yield companies to determine current and future earnings \n• Evaluated and monitored a portfolio of event and market-driven debt investments undergoing balance sheet restructuring and refinancing \n• Analyzed a portfolio of companies based on financials, relative value, and credit risks and presented an investment recommendation Languages Spanish Gujarati Spanish Gujarati Spanish Gujarati Skills Spanish C++ Visual Basic Unix Bloomberg Matlab AutoCAD Art Piano Golf Hindi Basketball Digital Media Product Management Project Management Analytics Product Development Cross-functional Team... Leadership Financial Modeling Mobile Devices Management New Media See 8+     See less Skills  Spanish C++ Visual Basic Unix Bloomberg Matlab AutoCAD Art Piano Golf Hindi Basketball Digital Media Product Management Project Management Analytics Product Development Cross-functional Team... Leadership Financial Modeling Mobile Devices Management New Media See 8+     See less Spanish C++ Visual Basic Unix Bloomberg Matlab AutoCAD Art Piano Golf Hindi Basketball Digital Media Product Management Project Management Analytics Product Development Cross-functional Team... Leadership Financial Modeling Mobile Devices Management New Media See 8+     See less Spanish C++ Visual Basic Unix Bloomberg Matlab AutoCAD Art Piano Golf Hindi Basketball Digital Media Product Management Project Management Analytics Product Development Cross-functional Team... Leadership Financial Modeling Mobile Devices Management New Media See 8+     See less Education University of Michigan - College of Engineering M.S.E.,  Industrial and Operations Engineering 2006  – 2007 Activities and Societies:  Tauber Institute of Global Operations ,  Engineering Global Leadership Honors Program ,  University of Michigan Raas Association ,  Indian American Student Association ,  T.V. Asia Correspondant Tauber Institute of Global Operations 2005  – 2007 University of Michigan - College of Engineering B.S.E.,  Industrial & Operations Engineering 2002  – 2006 Activities and Societies:  Tauber Institute of Global Operations ,  Engineering Global Leadership Honors Program (Alumni Relations Chair '05-'06) ,  Alpha Pi Mu ,  T.V. Asia Correspondant ,  University of Michigan Raas Association (Chair '05-'06 ,  Logistics Chair '04-'05) ,  Indian American Student Association (Social Networking Chair '03-'04) ,  Dance Marathon University of Michigan - College of Engineering M.S.E.,  Industrial and Operations Engineering 2006  – 2007 Activities and Societies:  Tauber Institute of Global Operations ,  Engineering Global Leadership Honors Program ,  University of Michigan Raas Association ,  Indian American Student Association ,  T.V. Asia Correspondant University of Michigan - College of Engineering M.S.E.,  Industrial and Operations Engineering 2006  – 2007 Activities and Societies:  Tauber Institute of Global Operations ,  Engineering Global Leadership Honors Program ,  University of Michigan Raas Association ,  Indian American Student Association ,  T.V. Asia Correspondant University of Michigan - College of Engineering M.S.E.,  Industrial and Operations Engineering 2006  – 2007 Activities and Societies:  Tauber Institute of Global Operations ,  Engineering Global Leadership Honors Program ,  University of Michigan Raas Association ,  Indian American Student Association ,  T.V. Asia Correspondant Tauber Institute of Global Operations 2005  – 2007 Tauber Institute of Global Operations 2005  – 2007 Tauber Institute of Global Operations 2005  – 2007 University of Michigan - College of Engineering B.S.E.,  Industrial & Operations Engineering 2002  – 2006 Activities and Societies:  Tauber Institute of Global Operations ,  Engineering Global Leadership Honors Program (Alumni Relations Chair '05-'06) ,  Alpha Pi Mu ,  T.V. Asia Correspondant ,  University of Michigan Raas Association (Chair '05-'06 ,  Logistics Chair '04-'05) ,  Indian American Student Association (Social Networking Chair '03-'04) ,  Dance Marathon University of Michigan - College of Engineering B.S.E.,  Industrial & Operations Engineering 2002  – 2006 Activities and Societies:  Tauber Institute of Global Operations ,  Engineering Global Leadership Honors Program (Alumni Relations Chair '05-'06) ,  Alpha Pi Mu ,  T.V. Asia Correspondant ,  University of Michigan Raas Association (Chair '05-'06 ,  Logistics Chair '04-'05) ,  Indian American Student Association (Social Networking Chair '03-'04) ,  Dance Marathon University of Michigan - College of Engineering B.S.E.,  Industrial & Operations Engineering 2002  – 2006 Activities and Societies:  Tauber Institute of Global Operations ,  Engineering Global Leadership Honors Program (Alumni Relations Chair '05-'06) ,  Alpha Pi Mu ,  T.V. Asia Correspondant ,  University of Michigan Raas Association (Chair '05-'06 ,  Logistics Chair '04-'05) ,  Indian American Student Association (Social Networking Chair '03-'04) ,  Dance Marathon ", "Skills Ad Serving Mobile Advertising Display Advertising Web Analytics Analytics Mobile Marketing Online Advertising Digital Strategy Google Adwords SaaS Mobile Devices Digital Media Google Analytics Digital Marketing Strategy Omniture E-commerce Online Marketing DoubleClick Search Advertising Mobile Applications Conversion Optimization Affiliate Marketing SEO Web Development Interactive Marketing PPC See 12+     See less Skills  Ad Serving Mobile Advertising Display Advertising Web Analytics Analytics Mobile Marketing Online Advertising Digital Strategy Google Adwords SaaS Mobile Devices Digital Media Google Analytics Digital Marketing Strategy Omniture E-commerce Online Marketing DoubleClick Search Advertising Mobile Applications Conversion Optimization Affiliate Marketing SEO Web Development Interactive Marketing PPC See 12+     See less Ad Serving Mobile Advertising Display Advertising Web Analytics Analytics Mobile Marketing Online Advertising Digital Strategy Google Adwords SaaS Mobile Devices Digital Media Google Analytics Digital Marketing Strategy Omniture E-commerce Online Marketing DoubleClick Search Advertising Mobile Applications Conversion Optimization Affiliate Marketing SEO Web Development Interactive Marketing PPC See 12+     See less Ad Serving Mobile Advertising Display Advertising Web Analytics Analytics Mobile Marketing Online Advertising Digital Strategy Google Adwords SaaS Mobile Devices Digital Media Google Analytics Digital Marketing Strategy Omniture E-commerce Online Marketing DoubleClick Search Advertising Mobile Applications Conversion Optimization Affiliate Marketing SEO Web Development Interactive Marketing PPC See 12+     See less ", "Skills Agile Methodologies Scalability Strategic Partnerships Distributed Systems Python Skills  Agile Methodologies Scalability Strategic Partnerships Distributed Systems Python Agile Methodologies Scalability Strategic Partnerships Distributed Systems Python Agile Methodologies Scalability Strategic Partnerships Distributed Systems Python ", "Experience Sr Program Manager, Cast Google June 2014  – Present (1 year 3 months) gFiber, City Expansion Program Management Google March 2013  –  June 2014  (1 year 4 months) Manager, Technical Account Management and Program Management, Google TV Google January 2012  –  March 2013  (1 year 3 months) Sr. Program Manager, Google TV Google May 2011  –  January 2012  (9 months) Mountain View, CA Sr. Technical Account Manager Google May 2007  –  May 2011  (4 years 1 month) Manager, Program Management eBay November 2002  –  May 2007  (4 years 7 months) Manage a group of Sr. Project Managers as they release new functionality to the site. Director, Professional Services MetaTV, Inc. January 2000  –  August 2002  (2 years 8 months) Interactive Television Software company. Managed a team of Program Managers, Architect, Software Engineers and Writers to create custom interactive TV solutions for Cox, Comcast and others. Sr. Licensing Program Manager Microsoft/WebTV March 1997  –  December 1999  (2 years 10 months) Managed the technical aspect of the Sony account. Sony licensed the WebTV SW and HW reference platforms and built their own branded products for US and Japanese markets. Sr. Licensing Engineering Program Manager Apple Computer, Inc. 1990  –  1997  (7 years) Licensing Technical Account Mgr Apple Inc. 1990  –  1997  (7 years) Sr Program Manager, Cast Google June 2014  – Present (1 year 3 months) Sr Program Manager, Cast Google June 2014  – Present (1 year 3 months) gFiber, City Expansion Program Management Google March 2013  –  June 2014  (1 year 4 months) gFiber, City Expansion Program Management Google March 2013  –  June 2014  (1 year 4 months) Manager, Technical Account Management and Program Management, Google TV Google January 2012  –  March 2013  (1 year 3 months) Manager, Technical Account Management and Program Management, Google TV Google January 2012  –  March 2013  (1 year 3 months) Sr. Program Manager, Google TV Google May 2011  –  January 2012  (9 months) Mountain View, CA Sr. Program Manager, Google TV Google May 2011  –  January 2012  (9 months) Mountain View, CA Sr. Technical Account Manager Google May 2007  –  May 2011  (4 years 1 month) Sr. Technical Account Manager Google May 2007  –  May 2011  (4 years 1 month) Manager, Program Management eBay November 2002  –  May 2007  (4 years 7 months) Manage a group of Sr. Project Managers as they release new functionality to the site. Manager, Program Management eBay November 2002  –  May 2007  (4 years 7 months) Manage a group of Sr. Project Managers as they release new functionality to the site. Director, Professional Services MetaTV, Inc. January 2000  –  August 2002  (2 years 8 months) Interactive Television Software company. Managed a team of Program Managers, Architect, Software Engineers and Writers to create custom interactive TV solutions for Cox, Comcast and others. Director, Professional Services MetaTV, Inc. January 2000  –  August 2002  (2 years 8 months) Interactive Television Software company. Managed a team of Program Managers, Architect, Software Engineers and Writers to create custom interactive TV solutions for Cox, Comcast and others. Sr. Licensing Program Manager Microsoft/WebTV March 1997  –  December 1999  (2 years 10 months) Managed the technical aspect of the Sony account. Sony licensed the WebTV SW and HW reference platforms and built their own branded products for US and Japanese markets. Sr. Licensing Program Manager Microsoft/WebTV March 1997  –  December 1999  (2 years 10 months) Managed the technical aspect of the Sony account. Sony licensed the WebTV SW and HW reference platforms and built their own branded products for US and Japanese markets. Sr. Licensing Engineering Program Manager Apple Computer, Inc. 1990  –  1997  (7 years) Sr. Licensing Engineering Program Manager Apple Computer, Inc. 1990  –  1997  (7 years) Licensing Technical Account Mgr Apple Inc. 1990  –  1997  (7 years) Licensing Technical Account Mgr Apple Inc. 1990  –  1997  (7 years) Skills Management Program Management Account Management Agile Methodologies Software Engineering Skills  Management Program Management Account Management Agile Methodologies Software Engineering Management Program Management Account Management Agile Methodologies Software Engineering Management Program Management Account Management Agile Methodologies Software Engineering Education University of California, San Diego B.S.,  Mechanical Engineering 1983  – 1989 University of California, San Diego B.S.,  Mechanical Engineering 1983  – 1989 University of California, San Diego B.S.,  Mechanical Engineering 1983  – 1989 University of California, San Diego B.S.,  Mechanical Engineering 1983  – 1989 ", "Experience Sr. Technical Account Manager Motorola Mobility, a Google Company August 2006  – Present (9 years 1 month) Markham, Ontario, Canada Responsible for managing two out of three major cellular carriers accounts in Canada through different phases of product life cycle – compliance, development, product approval and post-launch activities. \n \nMotorola Mobility Canadian Representative with Industry Canada. ASIC Design Engineer Genesis Microchip August 2005  –  December 2005  (5 months) Markham, Ontario, Canada ASIC Qualification Engineer AMD January 2004  –  August 2004  (8 months) Thornhill, Ontario, Canada Test Application Developer BlackBerry February 2002  –  September 2002  (8 months) Waterloo, Ontario, Canada Sr. Technical Account Manager Motorola Mobility, a Google Company August 2006  – Present (9 years 1 month) Markham, Ontario, Canada Responsible for managing two out of three major cellular carriers accounts in Canada through different phases of product life cycle – compliance, development, product approval and post-launch activities. \n \nMotorola Mobility Canadian Representative with Industry Canada. Sr. Technical Account Manager Motorola Mobility, a Google Company August 2006  – Present (9 years 1 month) Markham, Ontario, Canada Responsible for managing two out of three major cellular carriers accounts in Canada through different phases of product life cycle – compliance, development, product approval and post-launch activities. \n \nMotorola Mobility Canadian Representative with Industry Canada. ASIC Design Engineer Genesis Microchip August 2005  –  December 2005  (5 months) Markham, Ontario, Canada ASIC Design Engineer Genesis Microchip August 2005  –  December 2005  (5 months) Markham, Ontario, Canada ASIC Qualification Engineer AMD January 2004  –  August 2004  (8 months) Thornhill, Ontario, Canada ASIC Qualification Engineer AMD January 2004  –  August 2004  (8 months) Thornhill, Ontario, Canada Test Application Developer BlackBerry February 2002  –  September 2002  (8 months) Waterloo, Ontario, Canada Test Application Developer BlackBerry February 2002  –  September 2002  (8 months) Waterloo, Ontario, Canada Languages English Native or bilingual proficiency Serbian Native or bilingual proficiency English Native or bilingual proficiency Serbian Native or bilingual proficiency English Native or bilingual proficiency Serbian Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills CDMA Mobile Platforms GSM UMTS Mobile Devices Wireless Telecommunications Mobile Android HSPA Customer Relations LTE 3G Cellular Communications Customer Service Embedded Software GPRS Integration Product Management See 4+     See less Skills  CDMA Mobile Platforms GSM UMTS Mobile Devices Wireless Telecommunications Mobile Android HSPA Customer Relations LTE 3G Cellular Communications Customer Service Embedded Software GPRS Integration Product Management See 4+     See less CDMA Mobile Platforms GSM UMTS Mobile Devices Wireless Telecommunications Mobile Android HSPA Customer Relations LTE 3G Cellular Communications Customer Service Embedded Software GPRS Integration Product Management See 4+     See less CDMA Mobile Platforms GSM UMTS Mobile Devices Wireless Telecommunications Mobile Android HSPA Customer Relations LTE 3G Cellular Communications Customer Service Embedded Software GPRS Integration Product Management See 4+     See less Education University of Waterloo Bachelor of Applied Sciences,  Electrical Engineering 2001  – 2006 Matematicka Gimnazija Beograd High School Diploma 1996  – 2000 http://www.mg.edu.rs/en/onama-eng/identitet-eng Activities and Societies:  Member of mathematics and physics competition team University of Waterloo Bachelor of Applied Sciences,  Electrical Engineering 2001  – 2006 University of Waterloo Bachelor of Applied Sciences,  Electrical Engineering 2001  – 2006 University of Waterloo Bachelor of Applied Sciences,  Electrical Engineering 2001  – 2006 Matematicka Gimnazija Beograd High School Diploma 1996  – 2000 http://www.mg.edu.rs/en/onama-eng/identitet-eng Activities and Societies:  Member of mathematics and physics competition team Matematicka Gimnazija Beograd High School Diploma 1996  – 2000 http://www.mg.edu.rs/en/onama-eng/identitet-eng Activities and Societies:  Member of mathematics and physics competition team Matematicka Gimnazija Beograd High School Diploma 1996  – 2000 http://www.mg.edu.rs/en/onama-eng/identitet-eng Activities and Societies:  Member of mathematics and physics competition team Honors & Awards Unsung Hero Award Motorola Mobility (Former CEO Sanjay Jha) 2009 Outstanding performance in 2009 Unsung Hero Award Motorola Mobility (Former CEO Sanjay Jha) 2009 Outstanding performance in 2009 Unsung Hero Award Motorola Mobility (Former CEO Sanjay Jha) 2009 Outstanding performance in 2009 Unsung Hero Award Motorola Mobility (Former CEO Sanjay Jha) 2009 Outstanding performance in 2009 ", "Experience Partner Technology Manager Google August 2012  – Present (3 years 1 month) San Francisco Bay Area Sr. Technical Account Manager Google November 2010  –  August 2012  (1 year 10 months) Gangnam-gu, Seoul, Korea Mobile & Devices Partnership \nAds Partnership Senior Engineer & Technical Sales Manager Samsung Electronics France October 2007  –  October 2010  (3 years 1 month) Paris Area, France Senior Engineer Samsung Electronics March 2007  –  September 2007  (7 months) Suwon, Gyeonggi-do, Korea Engineer Samsung Electronics July 2003  –  February 2007  (3 years 8 months) Suwon, Gyeonggi-do, Korea Software Engineer MJL Technology 2001  –  2003  (2 years) Gangnam-gu, Seoul, Korea Founding Partner and SQL Database and Webmaster Spolot March 2000  –  June 2000  (4 months) Mapo-gu, Seoul, Korea Partner Technology Manager Google August 2012  – Present (3 years 1 month) San Francisco Bay Area Partner Technology Manager Google August 2012  – Present (3 years 1 month) San Francisco Bay Area Sr. Technical Account Manager Google November 2010  –  August 2012  (1 year 10 months) Gangnam-gu, Seoul, Korea Mobile & Devices Partnership \nAds Partnership Sr. Technical Account Manager Google November 2010  –  August 2012  (1 year 10 months) Gangnam-gu, Seoul, Korea Mobile & Devices Partnership \nAds Partnership Senior Engineer & Technical Sales Manager Samsung Electronics France October 2007  –  October 2010  (3 years 1 month) Paris Area, France Senior Engineer & Technical Sales Manager Samsung Electronics France October 2007  –  October 2010  (3 years 1 month) Paris Area, France Senior Engineer Samsung Electronics March 2007  –  September 2007  (7 months) Suwon, Gyeonggi-do, Korea Senior Engineer Samsung Electronics March 2007  –  September 2007  (7 months) Suwon, Gyeonggi-do, Korea Engineer Samsung Electronics July 2003  –  February 2007  (3 years 8 months) Suwon, Gyeonggi-do, Korea Engineer Samsung Electronics July 2003  –  February 2007  (3 years 8 months) Suwon, Gyeonggi-do, Korea Software Engineer MJL Technology 2001  –  2003  (2 years) Gangnam-gu, Seoul, Korea Software Engineer MJL Technology 2001  –  2003  (2 years) Gangnam-gu, Seoul, Korea Founding Partner and SQL Database and Webmaster Spolot March 2000  –  June 2000  (4 months) Mapo-gu, Seoul, Korea Founding Partner and SQL Database and Webmaster Spolot March 2000  –  June 2000  (4 months) Mapo-gu, Seoul, Korea Languages English Korean English Korean English Korean Skills Mobile Devices Mobile Communications Embedded Systems Product Management Wireless LTE Embedded Software Telecommunications Android Consumer Electronics Semiconductors Product Marketing Smartphones RTOS CDMA Mobile Applications Go-to-market Strategy Strategic Partnerships GSM Mobile Technology IPTV See 6+     See less Skills  Mobile Devices Mobile Communications Embedded Systems Product Management Wireless LTE Embedded Software Telecommunications Android Consumer Electronics Semiconductors Product Marketing Smartphones RTOS CDMA Mobile Applications Go-to-market Strategy Strategic Partnerships GSM Mobile Technology IPTV See 6+     See less Mobile Devices Mobile Communications Embedded Systems Product Management Wireless LTE Embedded Software Telecommunications Android Consumer Electronics Semiconductors Product Marketing Smartphones RTOS CDMA Mobile Applications Go-to-market Strategy Strategic Partnerships GSM Mobile Technology IPTV See 6+     See less Mobile Devices Mobile Communications Embedded Systems Product Management Wireless LTE Embedded Software Telecommunications Android Consumer Electronics Semiconductors Product Marketing Smartphones RTOS CDMA Mobile Applications Go-to-market Strategy Strategic Partnerships GSM Mobile Technology IPTV See 6+     See less Education Yonsei University M.S.,  Electronics - Digital Signal Processing 1998  – 2000 연세대학교 / Yonsei University Bachelor of Science (BS),  ELECTRONIC Engineering 1994  – 1998 Yonsei University M.S.,  Electronics - Digital Signal Processing 1998  – 2000 Yonsei University M.S.,  Electronics - Digital Signal Processing 1998  – 2000 Yonsei University M.S.,  Electronics - Digital Signal Processing 1998  – 2000 연세대학교 / Yonsei University Bachelor of Science (BS),  ELECTRONIC Engineering 1994  – 1998 연세대학교 / Yonsei University Bachelor of Science (BS),  ELECTRONIC Engineering 1994  – 1998 연세대학교 / Yonsei University Bachelor of Science (BS),  ELECTRONIC Engineering 1994  – 1998 ", "Experience SVP, Product Sailthru March 2014  – Present (1 year 6 months) Greater New York City Area SVP Product Medialets November 2012  –  March 2014  (1 year 5 months) Greater New York City Area Chief Digital Officer Prisa TV January 2011  –  November 2012  (1 year 11 months) Madrid, Spain Product Manager, DoubleClick for Advertisers Google January 2010  –  December 2010  (1 year) Product Manager, DART for Publishers Google July 2007  –  December 2010  (3 years 6 months) Director Program Management Department of Information Technology and Telecommunications, The City of New York October 2006  –  July 2007  (10 months) Program Manager, PMO DoubleClick October 2005  –  October 2006  (1 year 1 month) Manager, GTS Systems DoubleClick March 2003  –  November 2005  (2 years 9 months) Sr. Technical Account Manager DoubleClick 2000  –  2003  (3 years) Manager, Technical Services Steinway & Sons 1996  –  2000  (4 years) Tuner/Technician Kawai America Manufacturing 1994  –  1996  (2 years) SVP, Product Sailthru March 2014  – Present (1 year 6 months) Greater New York City Area SVP, Product Sailthru March 2014  – Present (1 year 6 months) Greater New York City Area SVP Product Medialets November 2012  –  March 2014  (1 year 5 months) Greater New York City Area SVP Product Medialets November 2012  –  March 2014  (1 year 5 months) Greater New York City Area Chief Digital Officer Prisa TV January 2011  –  November 2012  (1 year 11 months) Madrid, Spain Chief Digital Officer Prisa TV January 2011  –  November 2012  (1 year 11 months) Madrid, Spain Product Manager, DoubleClick for Advertisers Google January 2010  –  December 2010  (1 year) Product Manager, DoubleClick for Advertisers Google January 2010  –  December 2010  (1 year) Product Manager, DART for Publishers Google July 2007  –  December 2010  (3 years 6 months) Product Manager, DART for Publishers Google July 2007  –  December 2010  (3 years 6 months) Director Program Management Department of Information Technology and Telecommunications, The City of New York October 2006  –  July 2007  (10 months) Director Program Management Department of Information Technology and Telecommunications, The City of New York October 2006  –  July 2007  (10 months) Program Manager, PMO DoubleClick October 2005  –  October 2006  (1 year 1 month) Program Manager, PMO DoubleClick October 2005  –  October 2006  (1 year 1 month) Manager, GTS Systems DoubleClick March 2003  –  November 2005  (2 years 9 months) Manager, GTS Systems DoubleClick March 2003  –  November 2005  (2 years 9 months) Sr. Technical Account Manager DoubleClick 2000  –  2003  (3 years) Sr. Technical Account Manager DoubleClick 2000  –  2003  (3 years) Manager, Technical Services Steinway & Sons 1996  –  2000  (4 years) Manager, Technical Services Steinway & Sons 1996  –  2000  (4 years) Tuner/Technician Kawai America Manufacturing 1994  –  1996  (2 years) Tuner/Technician Kawai America Manufacturing 1994  –  1996  (2 years) Languages Spanish Spanish Spanish Skills Online Advertising Product Development DoubleClick Product Management Digital Media E-commerce Digital Marketing Web Analytics Online Marketing Advertising B2B Strategy Mobile Advertising Mobile Marketing Digital Strategy Skills  Online Advertising Product Development DoubleClick Product Management Digital Media E-commerce Digital Marketing Web Analytics Online Marketing Advertising B2B Strategy Mobile Advertising Mobile Marketing Digital Strategy Online Advertising Product Development DoubleClick Product Management Digital Media E-commerce Digital Marketing Web Analytics Online Marketing Advertising B2B Strategy Mobile Advertising Mobile Marketing Digital Strategy Online Advertising Product Development DoubleClick Product Management Digital Media E-commerce Digital Marketing Web Analytics Online Marketing Advertising B2B Strategy Mobile Advertising Mobile Marketing Digital Strategy Education Carnegie Mellon, Heinz School Certificate 1998  – 2000 Tulane University BA September 1988  – May 1992 Carnegie Mellon, Heinz School Certificate 1998  – 2000 Carnegie Mellon, Heinz School Certificate 1998  – 2000 Carnegie Mellon, Heinz School Certificate 1998  – 2000 Tulane University BA September 1988  – May 1992 Tulane University BA September 1988  – May 1992 Tulane University BA September 1988  – May 1992 ", "Summary •\t10+ years of experience leading & managing multiple teams in the business operations and client services sectors  \n•\tLead teams of Technical Account Managers in North America, who provide technical consultative solutions for the Google's DoubleClick Platform \n•\t8+ years of technical experience in servicing and evangelizing Online Advertising technologies while working at Google & Microsoft – both Search and Display advertising \n•\tProven track record of helping grow the AdX Real-time Bidding business at Google by 5x.  \n•\tRecipient of the IMPACT Award at Microsoft, a prestigious reward for outstanding performance in project execution and technical partner outreach \n•\t5+ years of practice in designing, developing and implementing Applications with expertise in Object-Oriented Analysis and design \n•\t3+ years of .NET experience - C#, VB.NET, ASP.NET, ADO.NET and SQL SERVER 2000 as a Senior Programmer and Manager, and experience in XML, XSL, HTML, DHTML, CSS, JavaScript and VBScript \n•\tWon awards for excellent Public Speaking and Presentation Skills \n \nSpecialties: People Management in Online Sales and Business Operations. Online search advertising, Ad Exchange, display advertising, troubleshooting online content, people management, information systems, security, Ad Exchange, Production support, technical account management Summary •\t10+ years of experience leading & managing multiple teams in the business operations and client services sectors  \n•\tLead teams of Technical Account Managers in North America, who provide technical consultative solutions for the Google's DoubleClick Platform \n•\t8+ years of technical experience in servicing and evangelizing Online Advertising technologies while working at Google & Microsoft – both Search and Display advertising \n•\tProven track record of helping grow the AdX Real-time Bidding business at Google by 5x.  \n•\tRecipient of the IMPACT Award at Microsoft, a prestigious reward for outstanding performance in project execution and technical partner outreach \n•\t5+ years of practice in designing, developing and implementing Applications with expertise in Object-Oriented Analysis and design \n•\t3+ years of .NET experience - C#, VB.NET, ASP.NET, ADO.NET and SQL SERVER 2000 as a Senior Programmer and Manager, and experience in XML, XSL, HTML, DHTML, CSS, JavaScript and VBScript \n•\tWon awards for excellent Public Speaking and Presentation Skills \n \nSpecialties: People Management in Online Sales and Business Operations. Online search advertising, Ad Exchange, display advertising, troubleshooting online content, people management, information systems, security, Ad Exchange, Production support, technical account management •\t10+ years of experience leading & managing multiple teams in the business operations and client services sectors  \n•\tLead teams of Technical Account Managers in North America, who provide technical consultative solutions for the Google's DoubleClick Platform \n•\t8+ years of technical experience in servicing and evangelizing Online Advertising technologies while working at Google & Microsoft – both Search and Display advertising \n•\tProven track record of helping grow the AdX Real-time Bidding business at Google by 5x.  \n•\tRecipient of the IMPACT Award at Microsoft, a prestigious reward for outstanding performance in project execution and technical partner outreach \n•\t5+ years of practice in designing, developing and implementing Applications with expertise in Object-Oriented Analysis and design \n•\t3+ years of .NET experience - C#, VB.NET, ASP.NET, ADO.NET and SQL SERVER 2000 as a Senior Programmer and Manager, and experience in XML, XSL, HTML, DHTML, CSS, JavaScript and VBScript \n•\tWon awards for excellent Public Speaking and Presentation Skills \n \nSpecialties: People Management in Online Sales and Business Operations. Online search advertising, Ad Exchange, display advertising, troubleshooting online content, people management, information systems, security, Ad Exchange, Production support, technical account management •\t10+ years of experience leading & managing multiple teams in the business operations and client services sectors  \n•\tLead teams of Technical Account Managers in North America, who provide technical consultative solutions for the Google's DoubleClick Platform \n•\t8+ years of technical experience in servicing and evangelizing Online Advertising technologies while working at Google & Microsoft – both Search and Display advertising \n•\tProven track record of helping grow the AdX Real-time Bidding business at Google by 5x.  \n•\tRecipient of the IMPACT Award at Microsoft, a prestigious reward for outstanding performance in project execution and technical partner outreach \n•\t5+ years of practice in designing, developing and implementing Applications with expertise in Object-Oriented Analysis and design \n•\t3+ years of .NET experience - C#, VB.NET, ASP.NET, ADO.NET and SQL SERVER 2000 as a Senior Programmer and Manager, and experience in XML, XSL, HTML, DHTML, CSS, JavaScript and VBScript \n•\tWon awards for excellent Public Speaking and Presentation Skills \n \nSpecialties: People Management in Online Sales and Business Operations. Online search advertising, Ad Exchange, display advertising, troubleshooting online content, people management, information systems, security, Ad Exchange, Production support, technical account management Experience Global Technical Lead - Brand Solutions Google May 2015  – Present (4 months) Greater New York City Area Head of Client Services - DoubleClick Advertising Solutions (Americas) Google July 2014  –  April 2015  (10 months) Greater New York City Area Head of Client Services - Networks and Marketers Google July 2013  –  June 2014  (1 year) New York Head of Ad Exchange & Invite Media Client Services Google June 2012  –  June 2013  (1 year 1 month) New York Head of Ad Exchange Client Services - Americas Google March 2011  –  May 2012  (1 year 3 months) Lead and Manage a team of Technical Account Managers in North America, who provide technical consultative solutions for the Google Ad Exchange \n \nProvided exceptional client service to top tier customers and thereby assisted growing AdX dramatically YoY \n \nMaximize Ad Exchange revenue by ensuring high adoption/usage of strong and consistent processes within the Ad Exchange Services team. \n \nTrack team's performance metrics and develop strategies to increase efficiency and service performance of the business. \n \nWork closely with Product and Engineering to Evangelize RTB(Real Time Bidding) for Buyers on Google's Ad Exchange \n \nManage client escalations, engaging necessary resources and drive resolution. \n \nWork with Product Management to resolve/troubleshoot issues in the UI for future versions of the product. \n \nSupport and develop meaningful relationships with adjacent regions and business units and act as a liaison between clients and internal teams (Account Management, Support, Sales, Engineering, and Product Management) Sr. Technical Account Manager Google July 2010  –  March 2011  (9 months) Responsibilities: \n \n* Provide post-implementation training, consulting services, and best practices to clients. \n \n* Work with business leaders to develop strategy including best practices, change management, and monetization analysis. \n \n* Conduct technical walk-throughs of new product features as they relate to client product usage. \n \n* Collaborate with the Sales team or lead efforts to monitor exchange activity and track performance against goals. Identify delays, budget, or technical quality concerns so they can be proactively addressed. \n \n* Ensure project team, internal management, and external customers are provided with appropriate, timely, and accurate project information and status updates. Lead Technical Support Engineer Microsoft March 2007  –  July 2010  (3 years 5 months) •\tService Microsoft’s Search and Display Advertising Platforms (adCenter and Ad Expert) and online content to resolve highly technical Advertising issues \n \n•\tEngage in technical implementation discussions with Sales teams and clients \n \n•\tWon the IMPACT Award at Microsoft, a prestigious reward for outstanding performance in project execution and technical partner outreach \n \n•\tLead/Manage the NY Ad Support Search Team which is primarily responsible for Escalation Management and product engineering/evangelism \n \n•\tPartner with all internal premium advertising sales managers on technical client campaign optimization and delivery strategy in order to deliver exceptional support for Premium customers \n \n•\tEngage in technical discussions with PM and Engineering teams on a regular basis to identify bugs in tool set and provide support, research and impact information to help prioritize and deploy fixes \n \n•\tBrief project execution and updates to Executive Management of Microsoft, with particular focus on Product Evangelism \n \n•\tCoordinate the creation of support processes and documentation for future ad serving systems  \n \n•\tUse SQL server 2000 to resolve customer escalations and to produce ad-hoc reports for sales teams \n \n•\tHelp foster innovation in tool and process development by submitting features for future releases Lead Technical Product Engineer Affirmative Insurance January 2006  –  March 2007  (1 year 3 months) •\tChiefly responsible for managing a team of programming professionals \n \n•\tInvolved largely in designing and creating new tools in Visual Studio, Visual Studio.NET (Visual Basic, Visual Basic.Net, C#, ADO, ADO.NET 1.1), Java Script, CSS, VBScript, HTML/DHTML, XML/XSLT, Windows Server and SQL Server 2005 \n \n•\tWorked with TRACK IT 6.5 [CRM for work orders] in order to ensure that user problems are fixed within specific deadlines and resolutions are provided \n \n•\tDeveloped a Windows Authentication interface to restrict access to all users except HR Managers \n \n•\tWorked closely with the sales team to understand new application requirements and incorporated acquired feedback into product management lifecycle to continually improve the product \n \n•\tActed as primary lead post deployment to ensure bugs are fixed in a timely manner \n \n•\tAssembled the support team every week to discuss new issues and document critical problems Application Developer Trident Advertisers October 2000  –  May 2004  (3 years 8 months) Involved largely in designing and creating new tools in Visual Studio, Visual Studio.NET (Visual Basic, Visual Basic.Net, C#, ADO, ADO.NET 1.1) \n \nJava Script, CSS, VBScript, HTML/DHTML, XML/XSLT, Windows Server and SQL Server 2005 Global Technical Lead - Brand Solutions Google May 2015  – Present (4 months) Greater New York City Area Global Technical Lead - Brand Solutions Google May 2015  – Present (4 months) Greater New York City Area Head of Client Services - DoubleClick Advertising Solutions (Americas) Google July 2014  –  April 2015  (10 months) Greater New York City Area Head of Client Services - DoubleClick Advertising Solutions (Americas) Google July 2014  –  April 2015  (10 months) Greater New York City Area Head of Client Services - Networks and Marketers Google July 2013  –  June 2014  (1 year) New York Head of Client Services - Networks and Marketers Google July 2013  –  June 2014  (1 year) New York Head of Ad Exchange & Invite Media Client Services Google June 2012  –  June 2013  (1 year 1 month) New York Head of Ad Exchange & Invite Media Client Services Google June 2012  –  June 2013  (1 year 1 month) New York Head of Ad Exchange Client Services - Americas Google March 2011  –  May 2012  (1 year 3 months) Lead and Manage a team of Technical Account Managers in North America, who provide technical consultative solutions for the Google Ad Exchange \n \nProvided exceptional client service to top tier customers and thereby assisted growing AdX dramatically YoY \n \nMaximize Ad Exchange revenue by ensuring high adoption/usage of strong and consistent processes within the Ad Exchange Services team. \n \nTrack team's performance metrics and develop strategies to increase efficiency and service performance of the business. \n \nWork closely with Product and Engineering to Evangelize RTB(Real Time Bidding) for Buyers on Google's Ad Exchange \n \nManage client escalations, engaging necessary resources and drive resolution. \n \nWork with Product Management to resolve/troubleshoot issues in the UI for future versions of the product. \n \nSupport and develop meaningful relationships with adjacent regions and business units and act as a liaison between clients and internal teams (Account Management, Support, Sales, Engineering, and Product Management) Head of Ad Exchange Client Services - Americas Google March 2011  –  May 2012  (1 year 3 months) Lead and Manage a team of Technical Account Managers in North America, who provide technical consultative solutions for the Google Ad Exchange \n \nProvided exceptional client service to top tier customers and thereby assisted growing AdX dramatically YoY \n \nMaximize Ad Exchange revenue by ensuring high adoption/usage of strong and consistent processes within the Ad Exchange Services team. \n \nTrack team's performance metrics and develop strategies to increase efficiency and service performance of the business. \n \nWork closely with Product and Engineering to Evangelize RTB(Real Time Bidding) for Buyers on Google's Ad Exchange \n \nManage client escalations, engaging necessary resources and drive resolution. \n \nWork with Product Management to resolve/troubleshoot issues in the UI for future versions of the product. \n \nSupport and develop meaningful relationships with adjacent regions and business units and act as a liaison between clients and internal teams (Account Management, Support, Sales, Engineering, and Product Management) Sr. Technical Account Manager Google July 2010  –  March 2011  (9 months) Responsibilities: \n \n* Provide post-implementation training, consulting services, and best practices to clients. \n \n* Work with business leaders to develop strategy including best practices, change management, and monetization analysis. \n \n* Conduct technical walk-throughs of new product features as they relate to client product usage. \n \n* Collaborate with the Sales team or lead efforts to monitor exchange activity and track performance against goals. Identify delays, budget, or technical quality concerns so they can be proactively addressed. \n \n* Ensure project team, internal management, and external customers are provided with appropriate, timely, and accurate project information and status updates. Sr. Technical Account Manager Google July 2010  –  March 2011  (9 months) Responsibilities: \n \n* Provide post-implementation training, consulting services, and best practices to clients. \n \n* Work with business leaders to develop strategy including best practices, change management, and monetization analysis. \n \n* Conduct technical walk-throughs of new product features as they relate to client product usage. \n \n* Collaborate with the Sales team or lead efforts to monitor exchange activity and track performance against goals. Identify delays, budget, or technical quality concerns so they can be proactively addressed. \n \n* Ensure project team, internal management, and external customers are provided with appropriate, timely, and accurate project information and status updates. Lead Technical Support Engineer Microsoft March 2007  –  July 2010  (3 years 5 months) •\tService Microsoft’s Search and Display Advertising Platforms (adCenter and Ad Expert) and online content to resolve highly technical Advertising issues \n \n•\tEngage in technical implementation discussions with Sales teams and clients \n \n•\tWon the IMPACT Award at Microsoft, a prestigious reward for outstanding performance in project execution and technical partner outreach \n \n•\tLead/Manage the NY Ad Support Search Team which is primarily responsible for Escalation Management and product engineering/evangelism \n \n•\tPartner with all internal premium advertising sales managers on technical client campaign optimization and delivery strategy in order to deliver exceptional support for Premium customers \n \n•\tEngage in technical discussions with PM and Engineering teams on a regular basis to identify bugs in tool set and provide support, research and impact information to help prioritize and deploy fixes \n \n•\tBrief project execution and updates to Executive Management of Microsoft, with particular focus on Product Evangelism \n \n•\tCoordinate the creation of support processes and documentation for future ad serving systems  \n \n•\tUse SQL server 2000 to resolve customer escalations and to produce ad-hoc reports for sales teams \n \n•\tHelp foster innovation in tool and process development by submitting features for future releases Lead Technical Support Engineer Microsoft March 2007  –  July 2010  (3 years 5 months) •\tService Microsoft’s Search and Display Advertising Platforms (adCenter and Ad Expert) and online content to resolve highly technical Advertising issues \n \n•\tEngage in technical implementation discussions with Sales teams and clients \n \n•\tWon the IMPACT Award at Microsoft, a prestigious reward for outstanding performance in project execution and technical partner outreach \n \n•\tLead/Manage the NY Ad Support Search Team which is primarily responsible for Escalation Management and product engineering/evangelism \n \n•\tPartner with all internal premium advertising sales managers on technical client campaign optimization and delivery strategy in order to deliver exceptional support for Premium customers \n \n•\tEngage in technical discussions with PM and Engineering teams on a regular basis to identify bugs in tool set and provide support, research and impact information to help prioritize and deploy fixes \n \n•\tBrief project execution and updates to Executive Management of Microsoft, with particular focus on Product Evangelism \n \n•\tCoordinate the creation of support processes and documentation for future ad serving systems  \n \n•\tUse SQL server 2000 to resolve customer escalations and to produce ad-hoc reports for sales teams \n \n•\tHelp foster innovation in tool and process development by submitting features for future releases Lead Technical Product Engineer Affirmative Insurance January 2006  –  March 2007  (1 year 3 months) •\tChiefly responsible for managing a team of programming professionals \n \n•\tInvolved largely in designing and creating new tools in Visual Studio, Visual Studio.NET (Visual Basic, Visual Basic.Net, C#, ADO, ADO.NET 1.1), Java Script, CSS, VBScript, HTML/DHTML, XML/XSLT, Windows Server and SQL Server 2005 \n \n•\tWorked with TRACK IT 6.5 [CRM for work orders] in order to ensure that user problems are fixed within specific deadlines and resolutions are provided \n \n•\tDeveloped a Windows Authentication interface to restrict access to all users except HR Managers \n \n•\tWorked closely with the sales team to understand new application requirements and incorporated acquired feedback into product management lifecycle to continually improve the product \n \n•\tActed as primary lead post deployment to ensure bugs are fixed in a timely manner \n \n•\tAssembled the support team every week to discuss new issues and document critical problems Lead Technical Product Engineer Affirmative Insurance January 2006  –  March 2007  (1 year 3 months) •\tChiefly responsible for managing a team of programming professionals \n \n•\tInvolved largely in designing and creating new tools in Visual Studio, Visual Studio.NET (Visual Basic, Visual Basic.Net, C#, ADO, ADO.NET 1.1), Java Script, CSS, VBScript, HTML/DHTML, XML/XSLT, Windows Server and SQL Server 2005 \n \n•\tWorked with TRACK IT 6.5 [CRM for work orders] in order to ensure that user problems are fixed within specific deadlines and resolutions are provided \n \n•\tDeveloped a Windows Authentication interface to restrict access to all users except HR Managers \n \n•\tWorked closely with the sales team to understand new application requirements and incorporated acquired feedback into product management lifecycle to continually improve the product \n \n•\tActed as primary lead post deployment to ensure bugs are fixed in a timely manner \n \n•\tAssembled the support team every week to discuss new issues and document critical problems Application Developer Trident Advertisers October 2000  –  May 2004  (3 years 8 months) Involved largely in designing and creating new tools in Visual Studio, Visual Studio.NET (Visual Basic, Visual Basic.Net, C#, ADO, ADO.NET 1.1) \n \nJava Script, CSS, VBScript, HTML/DHTML, XML/XSLT, Windows Server and SQL Server 2005 Application Developer Trident Advertisers October 2000  –  May 2004  (3 years 8 months) Involved largely in designing and creating new tools in Visual Studio, Visual Studio.NET (Visual Basic, Visual Basic.Net, C#, ADO, ADO.NET 1.1) \n \nJava Script, CSS, VBScript, HTML/DHTML, XML/XSLT, Windows Server and SQL Server 2005 Languages Hindi Hindi Hindi Skills People Management Production Support SQL Server .NET Commercialization Real time bidding Client Services Optimization Communications Audits Microsoft SQL Server Optimizations C# Ad Serving Management Financial Services Display Advertising CSS Real-Time Bidding JavaScript Online Advertising Product Management HTML See 7+     See less Skills  People Management Production Support SQL Server .NET Commercialization Real time bidding Client Services Optimization Communications Audits Microsoft SQL Server Optimizations C# Ad Serving Management Financial Services Display Advertising CSS Real-Time Bidding JavaScript Online Advertising Product Management HTML See 7+     See less People Management Production Support SQL Server .NET Commercialization Real time bidding Client Services Optimization Communications Audits Microsoft SQL Server Optimizations C# Ad Serving Management Financial Services Display Advertising CSS Real-Time Bidding JavaScript Online Advertising Product Management HTML See 7+     See less People Management Production Support SQL Server .NET Commercialization Real time bidding Client Services Optimization Communications Audits Microsoft SQL Server Optimizations C# Ad Serving Management Financial Services Display Advertising CSS Real-Time Bidding JavaScript Online Advertising Product Management HTML See 7+     See less Education Western Carolina University MBA,  International Business 2004  – 2005 Sri Chandrasekharendra Saraswathi Viswa Mahavidyalaya Bachelor of Engineering,  Computer Science Western Carolina University MBA,  International Business 2004  – 2005 Western Carolina University MBA,  International Business 2004  – 2005 Western Carolina University MBA,  International Business 2004  – 2005 Sri Chandrasekharendra Saraswathi Viswa Mahavidyalaya Bachelor of Engineering,  Computer Science Sri Chandrasekharendra Saraswathi Viswa Mahavidyalaya Bachelor of Engineering,  Computer Science Sri Chandrasekharendra Saraswathi Viswa Mahavidyalaya Bachelor of Engineering,  Computer Science ", "Summary Expertise at providing scalable technical solutions for partners using Google's suite of products in display advertising. Proficient at leveraging technology for innovative solutions in many industries like publishing, telecommunication, construction and digital advertising. \n \nSpecialties: Consultation and Service excellence, Leadership and building teams, Digital and Mobile advertising, quantitative analysis, Business Development and Strategy Summary Expertise at providing scalable technical solutions for partners using Google's suite of products in display advertising. Proficient at leveraging technology for innovative solutions in many industries like publishing, telecommunication, construction and digital advertising. \n \nSpecialties: Consultation and Service excellence, Leadership and building teams, Digital and Mobile advertising, quantitative analysis, Business Development and Strategy Expertise at providing scalable technical solutions for partners using Google's suite of products in display advertising. Proficient at leveraging technology for innovative solutions in many industries like publishing, telecommunication, construction and digital advertising. \n \nSpecialties: Consultation and Service excellence, Leadership and building teams, Digital and Mobile advertising, quantitative analysis, Business Development and Strategy Expertise at providing scalable technical solutions for partners using Google's suite of products in display advertising. Proficient at leveraging technology for innovative solutions in many industries like publishing, telecommunication, construction and digital advertising. \n \nSpecialties: Consultation and Service excellence, Leadership and building teams, Digital and Mobile advertising, quantitative analysis, Business Development and Strategy Experience Mobile Solutions Consultant Google August 2015  – Present (1 month) Sr. Technical Account Manager Google July 2013  –  August 2015  (2 years 2 months) New York, NY Provide innovative technical solutions to Google's most strategic publisher partners in digital advertising Candidate for MBA Class of 2013 Carnegie Mellon Tepper School of Business August 2011  –  May 2013  (1 year 10 months) Greater Pittsburgh Area Marketing, Information Systems, Strategy MBA Google Intern Google May 2012  –  August 2012  (4 months) Greater New York City Area Created a service model for one of Google's products to provide service excellence to the most strategic partners. Sr. Web Developer USA TODAY October 2008  –  July 2011  (2 years 10 months) McLean, Virginia Received \"Peer Recognition Award\" for outstanding performance, excellence and teamwork in a major Sports Project \nPrize winning team in \"Developer Mashup Challenge\" conducted by parent company Gannett Co. to unearth marketable innovative ideas \nWorked in high profile projects such as Vancouver Winter Olympics 2010, FIFA World Cup 2010, Mid-term elections, etc. Programmer\\Analyst PBDewberry March 2008  –  October 2008  (8 months) Arlington, Virginia Proactively designed solutions to improve the process of construction site progress tracking through photos and relevant information. It is used to help manage 120+ job corp locations for the Department of Labor Software Engineer Wipro Technologies October 2005  –  July 2007  (1 year 10 months) Chennai Area, India, Bangalore Area, India Used problem solving skills to stem the growing list of product backlog issues. Crafted test plan, consolidated test case scenarios and conducted user acceptance testing to bring down issues from 70 to 0, significantly improving issue resolution time. \n \nMicrosoft Tech-Ed: Personality Contest Runner up \nWipro Idol: best vocalist among 10,000 employees Mobile Solutions Consultant Google August 2015  – Present (1 month) Mobile Solutions Consultant Google August 2015  – Present (1 month) Sr. Technical Account Manager Google July 2013  –  August 2015  (2 years 2 months) New York, NY Provide innovative technical solutions to Google's most strategic publisher partners in digital advertising Sr. Technical Account Manager Google July 2013  –  August 2015  (2 years 2 months) New York, NY Provide innovative technical solutions to Google's most strategic publisher partners in digital advertising Candidate for MBA Class of 2013 Carnegie Mellon Tepper School of Business August 2011  –  May 2013  (1 year 10 months) Greater Pittsburgh Area Marketing, Information Systems, Strategy Candidate for MBA Class of 2013 Carnegie Mellon Tepper School of Business August 2011  –  May 2013  (1 year 10 months) Greater Pittsburgh Area Marketing, Information Systems, Strategy MBA Google Intern Google May 2012  –  August 2012  (4 months) Greater New York City Area Created a service model for one of Google's products to provide service excellence to the most strategic partners. MBA Google Intern Google May 2012  –  August 2012  (4 months) Greater New York City Area Created a service model for one of Google's products to provide service excellence to the most strategic partners. Sr. Web Developer USA TODAY October 2008  –  July 2011  (2 years 10 months) McLean, Virginia Received \"Peer Recognition Award\" for outstanding performance, excellence and teamwork in a major Sports Project \nPrize winning team in \"Developer Mashup Challenge\" conducted by parent company Gannett Co. to unearth marketable innovative ideas \nWorked in high profile projects such as Vancouver Winter Olympics 2010, FIFA World Cup 2010, Mid-term elections, etc. Sr. Web Developer USA TODAY October 2008  –  July 2011  (2 years 10 months) McLean, Virginia Received \"Peer Recognition Award\" for outstanding performance, excellence and teamwork in a major Sports Project \nPrize winning team in \"Developer Mashup Challenge\" conducted by parent company Gannett Co. to unearth marketable innovative ideas \nWorked in high profile projects such as Vancouver Winter Olympics 2010, FIFA World Cup 2010, Mid-term elections, etc. Programmer\\Analyst PBDewberry March 2008  –  October 2008  (8 months) Arlington, Virginia Proactively designed solutions to improve the process of construction site progress tracking through photos and relevant information. It is used to help manage 120+ job corp locations for the Department of Labor Programmer\\Analyst PBDewberry March 2008  –  October 2008  (8 months) Arlington, Virginia Proactively designed solutions to improve the process of construction site progress tracking through photos and relevant information. It is used to help manage 120+ job corp locations for the Department of Labor Software Engineer Wipro Technologies October 2005  –  July 2007  (1 year 10 months) Chennai Area, India, Bangalore Area, India Used problem solving skills to stem the growing list of product backlog issues. Crafted test plan, consolidated test case scenarios and conducted user acceptance testing to bring down issues from 70 to 0, significantly improving issue resolution time. \n \nMicrosoft Tech-Ed: Personality Contest Runner up \nWipro Idol: best vocalist among 10,000 employees Software Engineer Wipro Technologies October 2005  –  July 2007  (1 year 10 months) Chennai Area, India, Bangalore Area, India Used problem solving skills to stem the growing list of product backlog issues. Crafted test plan, consolidated test case scenarios and conducted user acceptance testing to bring down issues from 70 to 0, significantly improving issue resolution time. \n \nMicrosoft Tech-Ed: Personality Contest Runner up \nWipro Idol: best vocalist among 10,000 employees Languages Hindi Tamil Hindi Tamil Hindi Tamil Skills Project Management Manage Client... Team Leadership Mobile Advertising Strategy Presenting to Senior... Strategic Partnerships Quantitative Analysis Thought Leadership Data Analysis Analytics Programming Leadership Business Development Account Management Marketing Strategy SQL XML Mobile Applications Consulting Problem Solving .NET Business Analysis Management Software Development Business Intelligence Teamwork Microsoft Excel Software Project... Agile Methodologies Digital Media CSS HTML Data Mining Requirements Analysis Product Management SQL Server Microsoft Office Analysis Web Applications Excel Cross-functional Team... Team Management Technical Leadership Post-Sales Microsoft SQL Server See 31+     See less Skills  Project Management Manage Client... Team Leadership Mobile Advertising Strategy Presenting to Senior... Strategic Partnerships Quantitative Analysis Thought Leadership Data Analysis Analytics Programming Leadership Business Development Account Management Marketing Strategy SQL XML Mobile Applications Consulting Problem Solving .NET Business Analysis Management Software Development Business Intelligence Teamwork Microsoft Excel Software Project... Agile Methodologies Digital Media CSS HTML Data Mining Requirements Analysis Product Management SQL Server Microsoft Office Analysis Web Applications Excel Cross-functional Team... Team Management Technical Leadership Post-Sales Microsoft SQL Server See 31+     See less Project Management Manage Client... Team Leadership Mobile Advertising Strategy Presenting to Senior... Strategic Partnerships Quantitative Analysis Thought Leadership Data Analysis Analytics Programming Leadership Business Development Account Management Marketing Strategy SQL XML Mobile Applications Consulting Problem Solving .NET Business Analysis Management Software Development Business Intelligence Teamwork Microsoft Excel Software Project... Agile Methodologies Digital Media CSS HTML Data Mining Requirements Analysis Product Management SQL Server Microsoft Office Analysis Web Applications Excel Cross-functional Team... Team Management Technical Leadership Post-Sales Microsoft SQL Server See 31+     See less Project Management Manage Client... Team Leadership Mobile Advertising Strategy Presenting to Senior... Strategic Partnerships Quantitative Analysis Thought Leadership Data Analysis Analytics Programming Leadership Business Development Account Management Marketing Strategy SQL XML Mobile Applications Consulting Problem Solving .NET Business Analysis Management Software Development Business Intelligence Teamwork Microsoft Excel Software Project... Agile Methodologies Digital Media CSS HTML Data Mining Requirements Analysis Product Management SQL Server Microsoft Office Analysis Web Applications Excel Cross-functional Team... Team Management Technical Leadership Post-Sales Microsoft SQL Server See 31+     See less Education Carnegie Mellon University - Tepper School of Business MBA,  Marketing , Strategy, Information Systems,  Operations 2011  – 2013 Forte fellow and merit scholarship recipient Activities and Societies:  Marketing ,  Business & Technology ,  Consulting ,  Operations ,  Poker Anna University B.E.,  Computer Science 2001  – 2005 Merit Certificate for 2nd highest rank in Mathematics \nMicrosoft Student projects - Retail Outlet Operations \nFounder and President of Music Club \nPresident of Cultural Club Activities and Societies:  Music club ,  Cultural club Hindu Sr. Sec School, Indira Nagar High School 1992  – 2001 Carnegie Mellon University - Tepper School of Business MBA,  Marketing , Strategy, Information Systems,  Operations 2011  – 2013 Forte fellow and merit scholarship recipient Activities and Societies:  Marketing ,  Business & Technology ,  Consulting ,  Operations ,  Poker Carnegie Mellon University - Tepper School of Business MBA,  Marketing , Strategy, Information Systems,  Operations 2011  – 2013 Forte fellow and merit scholarship recipient Activities and Societies:  Marketing ,  Business & Technology ,  Consulting ,  Operations ,  Poker Carnegie Mellon University - Tepper School of Business MBA,  Marketing , Strategy, Information Systems,  Operations 2011  – 2013 Forte fellow and merit scholarship recipient Activities and Societies:  Marketing ,  Business & Technology ,  Consulting ,  Operations ,  Poker Anna University B.E.,  Computer Science 2001  – 2005 Merit Certificate for 2nd highest rank in Mathematics \nMicrosoft Student projects - Retail Outlet Operations \nFounder and President of Music Club \nPresident of Cultural Club Activities and Societies:  Music club ,  Cultural club Anna University B.E.,  Computer Science 2001  – 2005 Merit Certificate for 2nd highest rank in Mathematics \nMicrosoft Student projects - Retail Outlet Operations \nFounder and President of Music Club \nPresident of Cultural Club Activities and Societies:  Music club ,  Cultural club Anna University B.E.,  Computer Science 2001  – 2005 Merit Certificate for 2nd highest rank in Mathematics \nMicrosoft Student projects - Retail Outlet Operations \nFounder and President of Music Club \nPresident of Cultural Club Activities and Societies:  Music club ,  Cultural club Hindu Sr. Sec School, Indira Nagar High School 1992  – 2001 Hindu Sr. Sec School, Indira Nagar High School 1992  – 2001 Hindu Sr. Sec School, Indira Nagar High School 1992  – 2001 "]}