{"position": "Technical Advisor", "company": "Google", "profiles": ["Summary As part of the Millennial Generation, I have grown up within a digital media culture and I enjoy following new trends and developments. I am innovative, proactive and a real team player. I also have the ability to learn new processes quickly. I am bilingual in French and English. Summary As part of the Millennial Generation, I have grown up within a digital media culture and I enjoy following new trends and developments. I am innovative, proactive and a real team player. I also have the ability to learn new processes quickly. I am bilingual in French and English. As part of the Millennial Generation, I have grown up within a digital media culture and I enjoy following new trends and developments. I am innovative, proactive and a real team player. I also have the ability to learn new processes quickly. I am bilingual in French and English. As part of the Millennial Generation, I have grown up within a digital media culture and I enjoy following new trends and developments. I am innovative, proactive and a real team player. I also have the ability to learn new processes quickly. I am bilingual in French and English. Experience Technical Support Advisor SELLBYTEL Group Spain May 2015  – Present (4 months) Barcelona Area, Spain • Part of the Google Android project for the French and the UK markets.  Customer Service Advisor Mezzo Relation Client February 2015  –  February 2015  (1 month) Barcelona Area, Spain • Took orders, gave appropriate information on products, negotiated and treated reclamations. \n• Applied accurate communication strategies depending on customers’ queries. \n• Suggested commercial solutions that would be beneficial for both the client and the company. Trainee TBWA\\Worldwide September 2013  –  September 2013  (1 month) Nairobi • Attended pitch meetings with prospective clients such as PZ Cussons. \n• Helped organize and attended brief meetings including one that was hosted by the British American Tobacco Company. \n• Worked on the improvement and review of the social network pages of certain clients such as Royco and Jameson. Internal Communication Assistant Public Centre For Social Aid June 2013  –  June 2013  (1 month) Waterloo, Belgium • Supported the entire team with various administrative tasks such as answering the phone and keeping the appointment list up-to-date. \n• Internal communications duties to insure that the exchange of information between employees was correctly kept. Administrative Assistant Public Centre For Social Aid June 2012  –  June 2012  (1 month) Waterloo, Belgium • In charge of setting up the weekly meals for all the community within the Centre. \n• Provided weekly accounting reports on suppliers. \n• Held weekly workshop activities for all members. Work Placement Botermans Civil-Law Notary January 2011  –  May 2011  (5 months) Waterloo, Belgium • Assisted the notary with a broad series of tasks such as drafting and reviewing documents. This role helped me develop a strong attention to details and accurate writing style. Technical Support Advisor SELLBYTEL Group Spain May 2015  – Present (4 months) Barcelona Area, Spain • Part of the Google Android project for the French and the UK markets.  Technical Support Advisor SELLBYTEL Group Spain May 2015  – Present (4 months) Barcelona Area, Spain • Part of the Google Android project for the French and the UK markets.  Customer Service Advisor Mezzo Relation Client February 2015  –  February 2015  (1 month) Barcelona Area, Spain • Took orders, gave appropriate information on products, negotiated and treated reclamations. \n• Applied accurate communication strategies depending on customers’ queries. \n• Suggested commercial solutions that would be beneficial for both the client and the company. Customer Service Advisor Mezzo Relation Client February 2015  –  February 2015  (1 month) Barcelona Area, Spain • Took orders, gave appropriate information on products, negotiated and treated reclamations. \n• Applied accurate communication strategies depending on customers’ queries. \n• Suggested commercial solutions that would be beneficial for both the client and the company. Trainee TBWA\\Worldwide September 2013  –  September 2013  (1 month) Nairobi • Attended pitch meetings with prospective clients such as PZ Cussons. \n• Helped organize and attended brief meetings including one that was hosted by the British American Tobacco Company. \n• Worked on the improvement and review of the social network pages of certain clients such as Royco and Jameson. Trainee TBWA\\Worldwide September 2013  –  September 2013  (1 month) Nairobi • Attended pitch meetings with prospective clients such as PZ Cussons. \n• Helped organize and attended brief meetings including one that was hosted by the British American Tobacco Company. \n• Worked on the improvement and review of the social network pages of certain clients such as Royco and Jameson. Internal Communication Assistant Public Centre For Social Aid June 2013  –  June 2013  (1 month) Waterloo, Belgium • Supported the entire team with various administrative tasks such as answering the phone and keeping the appointment list up-to-date. \n• Internal communications duties to insure that the exchange of information between employees was correctly kept. Internal Communication Assistant Public Centre For Social Aid June 2013  –  June 2013  (1 month) Waterloo, Belgium • Supported the entire team with various administrative tasks such as answering the phone and keeping the appointment list up-to-date. \n• Internal communications duties to insure that the exchange of information between employees was correctly kept. Administrative Assistant Public Centre For Social Aid June 2012  –  June 2012  (1 month) Waterloo, Belgium • In charge of setting up the weekly meals for all the community within the Centre. \n• Provided weekly accounting reports on suppliers. \n• Held weekly workshop activities for all members. Administrative Assistant Public Centre For Social Aid June 2012  –  June 2012  (1 month) Waterloo, Belgium • In charge of setting up the weekly meals for all the community within the Centre. \n• Provided weekly accounting reports on suppliers. \n• Held weekly workshop activities for all members. Work Placement Botermans Civil-Law Notary January 2011  –  May 2011  (5 months) Waterloo, Belgium • Assisted the notary with a broad series of tasks such as drafting and reviewing documents. This role helped me develop a strong attention to details and accurate writing style. Work Placement Botermans Civil-Law Notary January 2011  –  May 2011  (5 months) Waterloo, Belgium • Assisted the notary with a broad series of tasks such as drafting and reviewing documents. This role helped me develop a strong attention to details and accurate writing style. Languages Français Native or bilingual proficiency Anglais Native or bilingual proficiency Français Native or bilingual proficiency Anglais Native or bilingual proficiency Français Native or bilingual proficiency Anglais Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Digital Media Social Media Analytical Skills Social Skills Interpersonal... Intercultural... Internal Communications Account Management Skills  Digital Media Social Media Analytical Skills Social Skills Interpersonal... Intercultural... Internal Communications Account Management Digital Media Social Media Analytical Skills Social Skills Interpersonal... Intercultural... Internal Communications Account Management Digital Media Social Media Analytical Skills Social Skills Interpersonal... Intercultural... Internal Communications Account Management Education Aberystwyth University Bachelor of Arts (B.A.),  Media and Communication 2011  – 2014 Collège Cardinal Mercier High School Diploma,  Accounting and Economics 2005  – 2011 Aberystwyth University Bachelor of Arts (B.A.),  Media and Communication 2011  – 2014 Aberystwyth University Bachelor of Arts (B.A.),  Media and Communication 2011  – 2014 Aberystwyth University Bachelor of Arts (B.A.),  Media and Communication 2011  – 2014 Collège Cardinal Mercier High School Diploma,  Accounting and Economics 2005  – 2011 Collège Cardinal Mercier High School Diploma,  Accounting and Economics 2005  – 2011 Collège Cardinal Mercier High School Diploma,  Accounting and Economics 2005  – 2011 ", "Summary Highly numerate with logical approach to problem solving. MSc Economics. BA (Hons) Business Economics. Multilingual (Italian, English and Spanish). High level of customer care and flexibility. Strong team player and self-confident. Ability to operate in high pressure situations. Comfortable in multicultural environments. Currently working for a global outsourcing provider specialising in delivering Sales, Customer Service, Human Resources and Training solutions. Summary Highly numerate with logical approach to problem solving. MSc Economics. BA (Hons) Business Economics. Multilingual (Italian, English and Spanish). High level of customer care and flexibility. Strong team player and self-confident. Ability to operate in high pressure situations. Comfortable in multicultural environments. Currently working for a global outsourcing provider specialising in delivering Sales, Customer Service, Human Resources and Training solutions. Highly numerate with logical approach to problem solving. MSc Economics. BA (Hons) Business Economics. Multilingual (Italian, English and Spanish). High level of customer care and flexibility. Strong team player and self-confident. Ability to operate in high pressure situations. Comfortable in multicultural environments. Currently working for a global outsourcing provider specialising in delivering Sales, Customer Service, Human Resources and Training solutions. Highly numerate with logical approach to problem solving. MSc Economics. BA (Hons) Business Economics. Multilingual (Italian, English and Spanish). High level of customer care and flexibility. Strong team player and self-confident. Ability to operate in high pressure situations. Comfortable in multicultural environments. Currently working for a global outsourcing provider specialising in delivering Sales, Customer Service, Human Resources and Training solutions. Experience Team Lead SELLBYTEL Group Spain May 2015  – Present (4 months) Barcelona Area, Spain o Case evaluation and DSAT analysis \no Providing feedback on agents performance \no 1-2-1 Coaching on a monthly basis Technical Support Advisor – Google Android SELLBYTEL Group Spain June 2014  – Present (1 year 3 months) Barcelona Area, Spain o\tAddressing customers’ issues in terms of payments, refunds, frauds, account recovery. \no\tManaging effectively all incoming incidents in a customer service environment. \no\tTroubleshooting technical issues (devices Nexus and Google Play Store). Technical Support – Brother printers SELLBYTEL Group Spain October 2013  –  June 2014  (9 months) Barcelona Area, Spain o\tProviding first level technical support of printing equipment for B2B and B2C. \no\tResponding to customers’ requirements in efficient and timely manner to ensure high customer satisfaction. \no\tEnsuring quality of data capture from customers. \no\tEscalating issues to concerned departments when required. Marketing Assistant/Administrator Franco's Coffee Solutions September 2012  –  September 2013  (1 year 1 month) Headcorn, United Kingdom o\tSetting up the business and organising the workshop. \no\tManaging and developing relationships with customers and suppliers. \no\tIdentifying new opportunities and sales targets. \no Up-selling and cross-selling. Key Support Worker mcch society ltd November 2008  –  September 2012  (3 years 11 months) Maidstone, United Kingdom o\tReviewing and updating care plans and risk assessments on regular basis. \no\tManaging relationships with external professionals and patients’ relatives. \no\tHandling many sensitive issues and information Volunteer Research Assistant Citizens Advice March 2010  –  July 2010  (5 months) Tunbridge Wells, United Kingdom o\tProviding free, independent, confidential and impartial advice in legal and financial matters. \no Handling clients’ enquiries. Assistant Manager Azzurro Restaurant February 2007  –  November 2008  (1 year 10 months) Maidstone, United Kingdom o\tApproaching and welcoming customers. \no\tTraining new team members and planning the rota. \no\tDealing with complaints. \no\tEnsuring that customers were satisfied with their dining experience. \no\tOptimizing revenue. Cashing up and financial reports. Waiter Azzurro Restaurant September 2006  –  February 2007  (6 months) Maidstone, United Kingdom o\tProlonged customer-facing experience strengthened my customer service skills. Graduate Internship Scheme in Retail Department Manager Auchan S.p.A. March 2006  –  September 2006  (7 months) Vicenza Area, Italy o Activities included sales, account analysis, forecasting, stock management, customer service. \no Assisting in the development of effective selling strategies to support the sales team. Quality Officer Centro Linea Club S.r.l. January 2004  –  February 2006  (2 years 2 months) Naples Area, Italy o\tUpdating and maintaining the Quality Management System, including procedures and working practises. \no\tPlanning and executing quality audits. \no\tMeasuring and analysing customer satisfaction. Team Lead SELLBYTEL Group Spain May 2015  – Present (4 months) Barcelona Area, Spain o Case evaluation and DSAT analysis \no Providing feedback on agents performance \no 1-2-1 Coaching on a monthly basis Team Lead SELLBYTEL Group Spain May 2015  – Present (4 months) Barcelona Area, Spain o Case evaluation and DSAT analysis \no Providing feedback on agents performance \no 1-2-1 Coaching on a monthly basis Technical Support Advisor – Google Android SELLBYTEL Group Spain June 2014  – Present (1 year 3 months) Barcelona Area, Spain o\tAddressing customers’ issues in terms of payments, refunds, frauds, account recovery. \no\tManaging effectively all incoming incidents in a customer service environment. \no\tTroubleshooting technical issues (devices Nexus and Google Play Store). Technical Support Advisor – Google Android SELLBYTEL Group Spain June 2014  – Present (1 year 3 months) Barcelona Area, Spain o\tAddressing customers’ issues in terms of payments, refunds, frauds, account recovery. \no\tManaging effectively all incoming incidents in a customer service environment. \no\tTroubleshooting technical issues (devices Nexus and Google Play Store). Technical Support – Brother printers SELLBYTEL Group Spain October 2013  –  June 2014  (9 months) Barcelona Area, Spain o\tProviding first level technical support of printing equipment for B2B and B2C. \no\tResponding to customers’ requirements in efficient and timely manner to ensure high customer satisfaction. \no\tEnsuring quality of data capture from customers. \no\tEscalating issues to concerned departments when required. Technical Support – Brother printers SELLBYTEL Group Spain October 2013  –  June 2014  (9 months) Barcelona Area, Spain o\tProviding first level technical support of printing equipment for B2B and B2C. \no\tResponding to customers’ requirements in efficient and timely manner to ensure high customer satisfaction. \no\tEnsuring quality of data capture from customers. \no\tEscalating issues to concerned departments when required. Marketing Assistant/Administrator Franco's Coffee Solutions September 2012  –  September 2013  (1 year 1 month) Headcorn, United Kingdom o\tSetting up the business and organising the workshop. \no\tManaging and developing relationships with customers and suppliers. \no\tIdentifying new opportunities and sales targets. \no Up-selling and cross-selling. Marketing Assistant/Administrator Franco's Coffee Solutions September 2012  –  September 2013  (1 year 1 month) Headcorn, United Kingdom o\tSetting up the business and organising the workshop. \no\tManaging and developing relationships with customers and suppliers. \no\tIdentifying new opportunities and sales targets. \no Up-selling and cross-selling. Key Support Worker mcch society ltd November 2008  –  September 2012  (3 years 11 months) Maidstone, United Kingdom o\tReviewing and updating care plans and risk assessments on regular basis. \no\tManaging relationships with external professionals and patients’ relatives. \no\tHandling many sensitive issues and information Key Support Worker mcch society ltd November 2008  –  September 2012  (3 years 11 months) Maidstone, United Kingdom o\tReviewing and updating care plans and risk assessments on regular basis. \no\tManaging relationships with external professionals and patients’ relatives. \no\tHandling many sensitive issues and information Volunteer Research Assistant Citizens Advice March 2010  –  July 2010  (5 months) Tunbridge Wells, United Kingdom o\tProviding free, independent, confidential and impartial advice in legal and financial matters. \no Handling clients’ enquiries. Volunteer Research Assistant Citizens Advice March 2010  –  July 2010  (5 months) Tunbridge Wells, United Kingdom o\tProviding free, independent, confidential and impartial advice in legal and financial matters. \no Handling clients’ enquiries. Assistant Manager Azzurro Restaurant February 2007  –  November 2008  (1 year 10 months) Maidstone, United Kingdom o\tApproaching and welcoming customers. \no\tTraining new team members and planning the rota. \no\tDealing with complaints. \no\tEnsuring that customers were satisfied with their dining experience. \no\tOptimizing revenue. Cashing up and financial reports. Assistant Manager Azzurro Restaurant February 2007  –  November 2008  (1 year 10 months) Maidstone, United Kingdom o\tApproaching and welcoming customers. \no\tTraining new team members and planning the rota. \no\tDealing with complaints. \no\tEnsuring that customers were satisfied with their dining experience. \no\tOptimizing revenue. Cashing up and financial reports. Waiter Azzurro Restaurant September 2006  –  February 2007  (6 months) Maidstone, United Kingdom o\tProlonged customer-facing experience strengthened my customer service skills. Waiter Azzurro Restaurant September 2006  –  February 2007  (6 months) Maidstone, United Kingdom o\tProlonged customer-facing experience strengthened my customer service skills. Graduate Internship Scheme in Retail Department Manager Auchan S.p.A. March 2006  –  September 2006  (7 months) Vicenza Area, Italy o Activities included sales, account analysis, forecasting, stock management, customer service. \no Assisting in the development of effective selling strategies to support the sales team. Graduate Internship Scheme in Retail Department Manager Auchan S.p.A. March 2006  –  September 2006  (7 months) Vicenza Area, Italy o Activities included sales, account analysis, forecasting, stock management, customer service. \no Assisting in the development of effective selling strategies to support the sales team. Quality Officer Centro Linea Club S.r.l. January 2004  –  February 2006  (2 years 2 months) Naples Area, Italy o\tUpdating and maintaining the Quality Management System, including procedures and working practises. \no\tPlanning and executing quality audits. \no\tMeasuring and analysing customer satisfaction. Quality Officer Centro Linea Club S.r.l. January 2004  –  February 2006  (2 years 2 months) Naples Area, Italy o\tUpdating and maintaining the Quality Management System, including procedures and working practises. \no\tPlanning and executing quality audits. \no\tMeasuring and analysing customer satisfaction. Languages English Full professional proficiency Italian Native or bilingual proficiency Spanish Professional working proficiency English Full professional proficiency Italian Native or bilingual proficiency Spanish Professional working proficiency English Full professional proficiency Italian Native or bilingual proficiency Spanish Professional working proficiency Full professional proficiency Native or bilingual proficiency Professional working proficiency Skills Econometrics Economics Market Research English Econometric Modeling Customer Service Customer Support Google Drive Microsoft Office CRM Technical Support Spanish Skills  Econometrics Economics Market Research English Econometric Modeling Customer Service Customer Support Google Drive Microsoft Office CRM Technical Support Spanish Econometrics Economics Market Research English Econometric Modeling Customer Service Customer Support Google Drive Microsoft Office CRM Technical Support Spanish Econometrics Economics Market Research English Econometric Modeling Customer Service Customer Support Google Drive Microsoft Office CRM Technical Support Spanish Education University of Kent Master of Science (MSc),  Agricultural Economics , 2:1 2011  – 2012 Dissertation: “An Analysis of Inter-regional Migration in Italy”. The research involved an empirical analysis of migration based on macrodata collected from different sources and the employment of a Negative Binomial Regression model, as well as a theoretical and empirical literature review. Considered \"an interesting piece of applied work\". Awarded distinction. University of Naples \"Parthenope\" BA Hons, Business Economics 1998  – 2003 Thesis debated: “The Distribution of Organic Products: Innovative Channels”. I conducted a research on organic farms in a specific region of Southern Italy. In particular, I investigated how a particular element of the Marketing Mix (Place) could affect the ROI and the level of sales of the businesses. The research involved also an analysis of the application of the concept of Sustainable Development in the agricultural production system. University of Kent Master of Science (MSc),  Agricultural Economics , 2:1 2011  – 2012 Dissertation: “An Analysis of Inter-regional Migration in Italy”. The research involved an empirical analysis of migration based on macrodata collected from different sources and the employment of a Negative Binomial Regression model, as well as a theoretical and empirical literature review. Considered \"an interesting piece of applied work\". Awarded distinction. University of Kent Master of Science (MSc),  Agricultural Economics , 2:1 2011  – 2012 Dissertation: “An Analysis of Inter-regional Migration in Italy”. The research involved an empirical analysis of migration based on macrodata collected from different sources and the employment of a Negative Binomial Regression model, as well as a theoretical and empirical literature review. Considered \"an interesting piece of applied work\". Awarded distinction. University of Kent Master of Science (MSc),  Agricultural Economics , 2:1 2011  – 2012 Dissertation: “An Analysis of Inter-regional Migration in Italy”. The research involved an empirical analysis of migration based on macrodata collected from different sources and the employment of a Negative Binomial Regression model, as well as a theoretical and empirical literature review. Considered \"an interesting piece of applied work\". Awarded distinction. University of Naples \"Parthenope\" BA Hons, Business Economics 1998  – 2003 Thesis debated: “The Distribution of Organic Products: Innovative Channels”. I conducted a research on organic farms in a specific region of Southern Italy. In particular, I investigated how a particular element of the Marketing Mix (Place) could affect the ROI and the level of sales of the businesses. The research involved also an analysis of the application of the concept of Sustainable Development in the agricultural production system. University of Naples \"Parthenope\" BA Hons, Business Economics 1998  – 2003 Thesis debated: “The Distribution of Organic Products: Innovative Channels”. I conducted a research on organic farms in a specific region of Southern Italy. In particular, I investigated how a particular element of the Marketing Mix (Place) could affect the ROI and the level of sales of the businesses. The research involved also an analysis of the application of the concept of Sustainable Development in the agricultural production system. University of Naples \"Parthenope\" BA Hons, Business Economics 1998  – 2003 Thesis debated: “The Distribution of Organic Products: Innovative Channels”. I conducted a research on organic farms in a specific region of Southern Italy. In particular, I investigated how a particular element of the Marketing Mix (Place) could affect the ROI and the level of sales of the businesses. The research involved also an analysis of the application of the concept of Sustainable Development in the agricultural production system. Honors & Awards ", "Summary I have a core technology background with a strong focus on games design for both entertainment and educational purposes. I'm currently developing an entertainment product as an indie developer, while working with different partners to design eLearning products for various platforms and markets. Specialties:Game Design, eLearning, Edutainment, Digital Technology, Prototyping Summary I have a core technology background with a strong focus on games design for both entertainment and educational purposes. I'm currently developing an entertainment product as an indie developer, while working with different partners to design eLearning products for various platforms and markets. Specialties:Game Design, eLearning, Edutainment, Digital Technology, Prototyping I have a core technology background with a strong focus on games design for both entertainment and educational purposes. I'm currently developing an entertainment product as an indie developer, while working with different partners to design eLearning products for various platforms and markets. Specialties:Game Design, eLearning, Edutainment, Digital Technology, Prototyping I have a core technology background with a strong focus on games design for both entertainment and educational purposes. I'm currently developing an entertainment product as an indie developer, while working with different partners to design eLearning products for various platforms and markets. Specialties:Game Design, eLearning, Edutainment, Digital Technology, Prototyping Experience Educational Blipp Designer and Developer Blippar April 2015  – Present (5 months) Amsterdam Area, Netherlands Designing and developing AR concepts for educational use. Blipp Developer Blippar July 2014  – Present (1 year 2 months) Amsterdam Owner Parabolic Games April 2011  –  June 2013  (2 years 3 months) While working under the banner of my own company I worked on a number of e-learning contracts, developing educational game designs and HTML5 games. Unity Developer Kuato Studios May 2012  –  May 2013  (1 year 1 month) London, United Kingdom HTML5 Developer Soda April 2012  –  July 2012  (4 months) London, United Kingdom I'm currently developing HTML5 canvas activities with Soda for leading educational publisher Pearson. Guest Lecturer London South Bank University September 2011  –  March 2012  (7 months) I was invited to teach Unity3D and Level Design at LSBU to 2nd year students of the Game Cultures course. Lead Game Designer - Nursing Project London South Bank University July 2011  –  September 2011  (3 months) London, United Kingdom I designed a prototype teaching tool for the nursing department with the aim to provide their students with a simulation of a virtual children's ward. Lead Game Designer Pearson Education October 2007  –  April 2011  (3 years 7 months) I designed and produced 6 educational games to help children learn English as a foreign language (ELT/ESL). Video Editor West Yorkshire Police January 2007  –  May 2007  (5 months) Preparation of headshots for inclusion in the National Video Identification Database. Tasks included vetting clips, colour balancing, repositioning and timing adjustments.  \n \nI was also checked by the Criminal Records Bureau before being offered the job, which of course I passed. Technical Support Advisor DSL Warehouse 2002  –  2002  (less than a year) As the sole technical support provider I dealt with all customer issues with broadband hardware. While I already had a good understanding of LAN based technologies, I learnt a huge amount about xDSL and routing. Educational Blipp Designer and Developer Blippar April 2015  – Present (5 months) Amsterdam Area, Netherlands Designing and developing AR concepts for educational use. Educational Blipp Designer and Developer Blippar April 2015  – Present (5 months) Amsterdam Area, Netherlands Designing and developing AR concepts for educational use. Blipp Developer Blippar July 2014  – Present (1 year 2 months) Amsterdam Blipp Developer Blippar July 2014  – Present (1 year 2 months) Amsterdam Owner Parabolic Games April 2011  –  June 2013  (2 years 3 months) While working under the banner of my own company I worked on a number of e-learning contracts, developing educational game designs and HTML5 games. Owner Parabolic Games April 2011  –  June 2013  (2 years 3 months) While working under the banner of my own company I worked on a number of e-learning contracts, developing educational game designs and HTML5 games. Unity Developer Kuato Studios May 2012  –  May 2013  (1 year 1 month) London, United Kingdom Unity Developer Kuato Studios May 2012  –  May 2013  (1 year 1 month) London, United Kingdom HTML5 Developer Soda April 2012  –  July 2012  (4 months) London, United Kingdom I'm currently developing HTML5 canvas activities with Soda for leading educational publisher Pearson. HTML5 Developer Soda April 2012  –  July 2012  (4 months) London, United Kingdom I'm currently developing HTML5 canvas activities with Soda for leading educational publisher Pearson. Guest Lecturer London South Bank University September 2011  –  March 2012  (7 months) I was invited to teach Unity3D and Level Design at LSBU to 2nd year students of the Game Cultures course. Guest Lecturer London South Bank University September 2011  –  March 2012  (7 months) I was invited to teach Unity3D and Level Design at LSBU to 2nd year students of the Game Cultures course. Lead Game Designer - Nursing Project London South Bank University July 2011  –  September 2011  (3 months) London, United Kingdom I designed a prototype teaching tool for the nursing department with the aim to provide their students with a simulation of a virtual children's ward. Lead Game Designer - Nursing Project London South Bank University July 2011  –  September 2011  (3 months) London, United Kingdom I designed a prototype teaching tool for the nursing department with the aim to provide their students with a simulation of a virtual children's ward. Lead Game Designer Pearson Education October 2007  –  April 2011  (3 years 7 months) I designed and produced 6 educational games to help children learn English as a foreign language (ELT/ESL). Lead Game Designer Pearson Education October 2007  –  April 2011  (3 years 7 months) I designed and produced 6 educational games to help children learn English as a foreign language (ELT/ESL). Video Editor West Yorkshire Police January 2007  –  May 2007  (5 months) Preparation of headshots for inclusion in the National Video Identification Database. Tasks included vetting clips, colour balancing, repositioning and timing adjustments.  \n \nI was also checked by the Criminal Records Bureau before being offered the job, which of course I passed. Video Editor West Yorkshire Police January 2007  –  May 2007  (5 months) Preparation of headshots for inclusion in the National Video Identification Database. Tasks included vetting clips, colour balancing, repositioning and timing adjustments.  \n \nI was also checked by the Criminal Records Bureau before being offered the job, which of course I passed. Technical Support Advisor DSL Warehouse 2002  –  2002  (less than a year) As the sole technical support provider I dealt with all customer issues with broadband hardware. While I already had a good understanding of LAN based technologies, I learnt a huge amount about xDSL and routing. Technical Support Advisor DSL Warehouse 2002  –  2002  (less than a year) As the sole technical support provider I dealt with all customer issues with broadband hardware. While I already had a good understanding of LAN based technologies, I learnt a huge amount about xDSL and routing. Skills Teaching E-learning Production XML Publishing JavaScript Digital Media New Media Unity3D Flash Game Design Game Development Educational Technology E-Learning ActionScript CSS Mobile Games Video Games Level Design HTML 5 Content Management See 6+     See less Skills  Teaching E-learning Production XML Publishing JavaScript Digital Media New Media Unity3D Flash Game Design Game Development Educational Technology E-Learning ActionScript CSS Mobile Games Video Games Level Design HTML 5 Content Management See 6+     See less Teaching E-learning Production XML Publishing JavaScript Digital Media New Media Unity3D Flash Game Design Game Development Educational Technology E-Learning ActionScript CSS Mobile Games Video Games Level Design HTML 5 Content Management See 6+     See less Teaching E-learning Production XML Publishing JavaScript Digital Media New Media Unity3D Flash Game Design Game Development Educational Technology E-Learning ActionScript CSS Mobile Games Video Games Level Design HTML 5 Content Management See 6+     See less Education University of Bradford BSc Hons,  Interactive Systems & Video Games Design 2002  – 2006 University of Bradford BSc Hons,  Interactive Systems & Video Games Design 2002  – 2006 University of Bradford BSc Hons,  Interactive Systems & Video Games Design 2002  – 2006 University of Bradford BSc Hons,  Interactive Systems & Video Games Design 2002  – 2006 ", "Experience Technical Support Advisor SELLBYTEL Group October 2014  – Present (11 months) Barcelona Area, Spain I am in charge of providing technical support of Google Android products, for both the Spanish and the UK markets. \n \nMy main responsabilities are: \n \n-Troubleshooting technical issues of hardware products and digital content \n-Act as a liaison between users and a higher tier support \n-Reporting recurring issues to management Fashion Support Advisor Concentrix May 2013  –  September 2014  (1 year 5 months) Belfast, United Kingdom I was working as an advisor for ASOS, which is the first online fashion retailer in the UK. I provided support mainly for the Spanish and the UK markets. \n \nMy main responsibilities were: \n \n-Order management \n-Social media management (Facebook, Twitter) \n-Translate website content from English to Spanish \n-Translate documents from English to Spanish  Technical Support Advisor SELLBYTEL Group October 2014  – Present (11 months) Barcelona Area, Spain I am in charge of providing technical support of Google Android products, for both the Spanish and the UK markets. \n \nMy main responsabilities are: \n \n-Troubleshooting technical issues of hardware products and digital content \n-Act as a liaison between users and a higher tier support \n-Reporting recurring issues to management Technical Support Advisor SELLBYTEL Group October 2014  – Present (11 months) Barcelona Area, Spain I am in charge of providing technical support of Google Android products, for both the Spanish and the UK markets. \n \nMy main responsabilities are: \n \n-Troubleshooting technical issues of hardware products and digital content \n-Act as a liaison between users and a higher tier support \n-Reporting recurring issues to management Fashion Support Advisor Concentrix May 2013  –  September 2014  (1 year 5 months) Belfast, United Kingdom I was working as an advisor for ASOS, which is the first online fashion retailer in the UK. I provided support mainly for the Spanish and the UK markets. \n \nMy main responsibilities were: \n \n-Order management \n-Social media management (Facebook, Twitter) \n-Translate website content from English to Spanish \n-Translate documents from English to Spanish  Fashion Support Advisor Concentrix May 2013  –  September 2014  (1 year 5 months) Belfast, United Kingdom I was working as an advisor for ASOS, which is the first online fashion retailer in the UK. I provided support mainly for the Spanish and the UK markets. \n \nMy main responsibilities were: \n \n-Order management \n-Social media management (Facebook, Twitter) \n-Translate website content from English to Spanish \n-Translate documents from English to Spanish  Languages Catalan Native or bilingual proficiency Spanish Native or bilingual proficiency English Full professional proficiency Japanese Full professional proficiency Catalan Native or bilingual proficiency Spanish Native or bilingual proficiency English Full professional proficiency Japanese Full professional proficiency Catalan Native or bilingual proficiency Spanish Native or bilingual proficiency English Full professional proficiency Japanese Full professional proficiency Native or bilingual proficiency Native or bilingual proficiency Full professional proficiency Full professional proficiency Skills Translation English language CAT tools Text Editing Proofreading Microsoft Office Trados MemoQ OmegaT Backoffice Oracle Cloud eGain Salesforce Metapack Photoshop Social Media Technical support Team work Communication Flexibility Self-Motivated Problem-Solving Willingness to learn See 8+     See less Skills  Translation English language CAT tools Text Editing Proofreading Microsoft Office Trados MemoQ OmegaT Backoffice Oracle Cloud eGain Salesforce Metapack Photoshop Social Media Technical support Team work Communication Flexibility Self-Motivated Problem-Solving Willingness to learn See 8+     See less Translation English language CAT tools Text Editing Proofreading Microsoft Office Trados MemoQ OmegaT Backoffice Oracle Cloud eGain Salesforce Metapack Photoshop Social Media Technical support Team work Communication Flexibility Self-Motivated Problem-Solving Willingness to learn See 8+     See less Translation English language CAT tools Text Editing Proofreading Microsoft Office Trados MemoQ OmegaT Backoffice Oracle Cloud eGain Salesforce Metapack Photoshop Social Media Technical support Team work Communication Flexibility Self-Motivated Problem-Solving Willingness to learn See 8+     See less Education Universitat Autònoma de Barcelona Translation and Interpretation,  English and Japanese 2007  – 2012 Josai International University Japanese Language Studies 2010  – 2011 Universitat Autònoma de Barcelona Translation and Interpretation,  English and Japanese 2007  – 2012 Universitat Autònoma de Barcelona Translation and Interpretation,  English and Japanese 2007  – 2012 Universitat Autònoma de Barcelona Translation and Interpretation,  English and Japanese 2007  – 2012 Josai International University Japanese Language Studies 2010  – 2011 Josai International University Japanese Language Studies 2010  – 2011 Josai International University Japanese Language Studies 2010  – 2011 ", "Summary Desarrollarme a nivel profesional en una posición que exija habilidades y conocimientos. \nAplicar las herramientas adquiridas a lo largo de mis estudios profesionales y experiencia laboral para el mejoramiento y el aprendizaje continuo, con el fin de contribuir al crecimiento de la empresa y mejora de la sociedad con un gran sentido de pertenencia por ambas. \nSaber que cambio el mundo a mejor gracias a mis acciones. Summary Desarrollarme a nivel profesional en una posición que exija habilidades y conocimientos. \nAplicar las herramientas adquiridas a lo largo de mis estudios profesionales y experiencia laboral para el mejoramiento y el aprendizaje continuo, con el fin de contribuir al crecimiento de la empresa y mejora de la sociedad con un gran sentido de pertenencia por ambas. \nSaber que cambio el mundo a mejor gracias a mis acciones. Desarrollarme a nivel profesional en una posición que exija habilidades y conocimientos. \nAplicar las herramientas adquiridas a lo largo de mis estudios profesionales y experiencia laboral para el mejoramiento y el aprendizaje continuo, con el fin de contribuir al crecimiento de la empresa y mejora de la sociedad con un gran sentido de pertenencia por ambas. \nSaber que cambio el mundo a mejor gracias a mis acciones. Desarrollarme a nivel profesional en una posición que exija habilidades y conocimientos. \nAplicar las herramientas adquiridas a lo largo de mis estudios profesionales y experiencia laboral para el mejoramiento y el aprendizaje continuo, con el fin de contribuir al crecimiento de la empresa y mejora de la sociedad con un gran sentido de pertenencia por ambas. \nSaber que cambio el mundo a mejor gracias a mis acciones. Experience Google Technical Support Advisor Spain and UK. Google by sellbytel team February 2015  – Present (7 months) Barcelona Area, Spain -Provide basic to moderately complex support to customers on all ltopics, as account and billing issues, purchases downloads, authorisation, gift cards and other. \n \n-Demostrate a high level of customer service showing empathy when assinsting a customer, and if necessary escale complex issues to a more experienced advisor. \n \n-Available to receive email or chats for mínimum 80% of the on-line time. \n \n-Maintain knowledge and expertise associated with applications specific to users. \n \n-Progress / close service requests to a satisfactory conclusion on management system. \n \n-Achive an excellent customer satisfacción level. Costumer Experience Airbnb Airbnb March 2014  –  January 2015  (11 months) passeig de gracia, 6 Working to increase the presence of Airbnb in Spain.  \nMaking direct sales calls to potential users. \nSending emails to new users. \nBeing point of contact for new users and helping them to succeed on the platform. \nDemonstrates effective, clear and professional written and oral communication. \nBuilds platform and business knowledge to better serve sellers. \nActively seeks solutions through logical reasoning and data interpretation skills, and identifies trends to appropriate channel including improvement suggestions. \nContributes to a positive team environment and proactively aids team members with difficult contacts as needed. \nMaintains acceptable performance metrics such as quality, productivity, first contact resolution, and attendance. \n \nIncrementando la presencia de Airbnb en el mercado Español \nHaciendo venta directas y negociaciones telefónicas a usuarios potenciales \nEnvió de emails a nuevos usuarios. \nSiendo el punto de contacto para nuevos usuarios y ayudándoles al uso debido de la plataforma web. Limpia y profesional comunicación escrita y oral para mejorar y construir un excelente servicio de ventas. \nBúsqueda activa de soluciones a través del razonamiento e interpretación de datos lógicos y sus tendencia al canal adecuado, incluyendo sugerencia y mejoras. \nConstrucción de un buen ambiente de trabajo en equipo positivo ayudando a los miembros del equipo de manera proactiva con contactos difíciles cuando sea necesario. \nManteniendo las metas de rendimiento aceptables, tales como calidad, productividad y primera resolución de contactos y asistencia Manager Sales Consulter Orange May 2013  –  December 2013  (8 months) Guinardo Barcelona Targeting focused direct sales of mobile and fixed contracts for the personal and business market, manager to increase ratio of turnover for the shop (increased 30%), increasing the daily “walk-in” customers to the shop in the zone Guinardo, Barcelona. \n \n \nenfocado a objetivos planteados por la empresa en la venta directa líneas móviles y fijas para particulares y empresas, responsable del aumento del Ratio de Conversión de tienda (30%) incrementado fluido peatonal dentro de la misma y aumentando oportunidad de ventas en la zona de Guidarno Barcelona. Sales Supervisor The Phone House Telecom GmbH November 2009  –  January 2013  (3 years 3 months) Barcelona Area, Spain Sales focused on store sales-targets, sales of mobile and fixed line contracts for personal and business customers in La Maquinista shopping mall. This store is ranked no.1 in Spain and my sales skills in this store got me on a 5th place regarding sales statistics on a national level. \nManager Store Type C The Phone House \nGeneral manager of a shop with category C (September 2011) in Carretera de Sants Barcelona with direct responsibility over 2 employees. Responsible for increasing sales of the shop (from 8,000€ to 21,000€ per month) and handling logistics with the head office. \nManager Store Type B The Phone House  \nGeneral manager of a shop with category B (March 2012) in Travessera de Gracia Barcelona, direct responsibility over 5 employees, increasing volume of sales and logistics with the head office. \nSupervisor of Stores The Phone House \nSupervisor of shops situated in the “high Zone” of Barcelona (July 2012) (travessera de Gracia, Tuset, Muntaner) applying models of sales methods and negotiations for the stores.  \n \nComercial de ventas enfocado a objetivos pautados por la tienda, venta de líneas telefónicas móviles y fijas para particulares y empresas en el Centro Comercial La Maquinista, tienda No 1 en España y vendedor numero 5 de España. \nManager tienda Tipo C The Phone House \nManager general de tienda en Carretera de Sants categoría C (11/11) con competencia directa en 2 trabajadores y responsable del incremento de ventas de la tienda (de 8,000€ a 21,000€ por mes) y manejo logística con la central. \nManager tienda Tipo B The Phone House  \nManager general de tienda categoría B (03/12) en Travessera de Gracia, competencia directa con 5 trabajadores, incrementando volumen de ventas y logística con la central. \nSupervisor de tiendas The Phone House \nSupervisor de tiendas ubicadas en la Zona alta de Barcelona (07/12) aplicando modelos de negociaciones para vendedores con el uso de las herramientas otorgadas por la compañía mediante cursos realizados en la misma. Logística productos industriales supermercados grandes plataformas. Hindustan Unilever Limited August 2009  –  September 2009  (2 months) Barcelona Area, Spain Managing logistics products such as deodorants, perfumes, sun screens, detergents, air fresheners, shampoos, hair products, soaps, etc. Product positioning within the supermarkets Alcampo, Carrefour and Mercadona, ensuring that these have sufficient inventories in stock, ordering products, working together with the department managers for the perfumery and pharmacy inside the stores. \n \nGestionando logística de productos personales, desodorantes, perfumes, protectores solares, detergentes, ambientadores, champoos, etc… y su posición dentro de los supermercados Alcampo, Carrefour y Mercadona, asegurándome de inventarios y haciendo pedidos directos, trabajando conjuntamente con departamentos perfumería y droguería. Logística productos industriales supermercados grandes plataformas. Merchanservis February 2009  –  August 2009  (7 months) Barcelona Area, Spain Our main client UNILEVER, S. A., would hire the services of our company to ensure that the supermarkets have sufficient inventory and also for logistics of products like deodorants, hair products, detergents, products related to perfumery and cleaning products. Direct relation with supermarkets and their warehouses of the products described above for maintaining the inventory, logistics and organizing the pallets of the products. \n \nNuestro principal cliente UNILLEVER, S. A., contrata los servicios de nuestra empresa para hacerle una parte de la logística de sus productos como desodorantes, productos capilares, detergentes, productos relacionados con perfumería y limpieza del hogar, relación directa con hipermercados y sus almacenes para la organización de los productos dentro y fuera de la plataforma, solicitando pedidos a encargados directo con la compañía-cliente para mantener inventarios mínimos. Jefe departamento perfumería y droguería Auchan August 2008  –  January 2009  (6 months) Barcelona Area, Spain Managing logistics of two departments with direct responsibility over 10 workers for the set up of products in supermarkets corridors, organization of pallets in warehouse with heavy machinery for transfers of products, controlling systems for damaged goods, scheduling directly with managers of big companies like UNILEVER, PROCTER&GAMBLE, HENKEL, JOHNSON&JOHNSON, etc., for strategic locations of their products and scheduling calendar for summer campaigns and products related to current promotions. \n \nGestionando logística de dos departamentos con competencia directa de 10 trabajadores para la puesta en marcha de productos en pasillo en el hipermercado, organización de almacenes con maquinaria pesada para traslados de productos en palets y controlando sistemas de disminución de rotura, planificando directamente con jefes de grandes empresas como UNILEVER, PROCTER&GAMBLE, HENKEL, JHONSON&JHONSON, etc…, ubicaciones estratégicas de sus productos y planificando calendario para campañas de Verano y Navidades de sus productos. Comercial de compra y venta de inmuebles. Tecnocasa Tunisie February 2008  –  July 2008  (6 months) Barcelona Area, Spain Senior sales for the zone of Eixample and Raval in Barcelona, door-to-door sales, measuring and calculating square meter value of flats. Attracting clients in the street, economic study of the market with internal office tools and courses.  \n \nAsesor inmobiliario para la zona de Example y Raval Barcelona, vendedor de puerta fría, tasador de pisos, y captación de clientes en la calle, estudio económico del mercado con herramientas y cursos realizados dentro de la empresa en sus centrales por profesionales del sector Socio y Gerente General. El Rincón del Caballista August 1998  –  February 2007  (8 years 7 months) San Cristobal, Venezuela Owner of a country club with hotel, restaurant, disco, parking, recreational zones, swimming pool and sportive areas, the total size of this club is 6000m2. Directly managing 90 workers, working in all the departments (kitchen, bar, laundry, service room, parking, cleaning, administration, patents, etc..) for later managing the direction of the club since the year 2000. \n \nPropietario de un country club con hotel, restaurante, disco, parking, zonas recreativas, piscina y canchas deportivas, área 6000mts2, competencia directa en 90 trabajadores, laborando en todos sus departamentos (cocina, barra, lavandería, salón, parking, limpieza, administración, patentes, etc..) para posteriormente gestionar la dirección del club en el año 2000. Google Technical Support Advisor Spain and UK. Google by sellbytel team February 2015  – Present (7 months) Barcelona Area, Spain -Provide basic to moderately complex support to customers on all ltopics, as account and billing issues, purchases downloads, authorisation, gift cards and other. \n \n-Demostrate a high level of customer service showing empathy when assinsting a customer, and if necessary escale complex issues to a more experienced advisor. \n \n-Available to receive email or chats for mínimum 80% of the on-line time. \n \n-Maintain knowledge and expertise associated with applications specific to users. \n \n-Progress / close service requests to a satisfactory conclusion on management system. \n \n-Achive an excellent customer satisfacción level. Google Technical Support Advisor Spain and UK. Google by sellbytel team February 2015  – Present (7 months) Barcelona Area, Spain -Provide basic to moderately complex support to customers on all ltopics, as account and billing issues, purchases downloads, authorisation, gift cards and other. \n \n-Demostrate a high level of customer service showing empathy when assinsting a customer, and if necessary escale complex issues to a more experienced advisor. \n \n-Available to receive email or chats for mínimum 80% of the on-line time. \n \n-Maintain knowledge and expertise associated with applications specific to users. \n \n-Progress / close service requests to a satisfactory conclusion on management system. \n \n-Achive an excellent customer satisfacción level. Costumer Experience Airbnb Airbnb March 2014  –  January 2015  (11 months) passeig de gracia, 6 Working to increase the presence of Airbnb in Spain.  \nMaking direct sales calls to potential users. \nSending emails to new users. \nBeing point of contact for new users and helping them to succeed on the platform. \nDemonstrates effective, clear and professional written and oral communication. \nBuilds platform and business knowledge to better serve sellers. \nActively seeks solutions through logical reasoning and data interpretation skills, and identifies trends to appropriate channel including improvement suggestions. \nContributes to a positive team environment and proactively aids team members with difficult contacts as needed. \nMaintains acceptable performance metrics such as quality, productivity, first contact resolution, and attendance. \n \nIncrementando la presencia de Airbnb en el mercado Español \nHaciendo venta directas y negociaciones telefónicas a usuarios potenciales \nEnvió de emails a nuevos usuarios. \nSiendo el punto de contacto para nuevos usuarios y ayudándoles al uso debido de la plataforma web. Limpia y profesional comunicación escrita y oral para mejorar y construir un excelente servicio de ventas. \nBúsqueda activa de soluciones a través del razonamiento e interpretación de datos lógicos y sus tendencia al canal adecuado, incluyendo sugerencia y mejoras. \nConstrucción de un buen ambiente de trabajo en equipo positivo ayudando a los miembros del equipo de manera proactiva con contactos difíciles cuando sea necesario. \nManteniendo las metas de rendimiento aceptables, tales como calidad, productividad y primera resolución de contactos y asistencia Costumer Experience Airbnb Airbnb March 2014  –  January 2015  (11 months) passeig de gracia, 6 Working to increase the presence of Airbnb in Spain.  \nMaking direct sales calls to potential users. \nSending emails to new users. \nBeing point of contact for new users and helping them to succeed on the platform. \nDemonstrates effective, clear and professional written and oral communication. \nBuilds platform and business knowledge to better serve sellers. \nActively seeks solutions through logical reasoning and data interpretation skills, and identifies trends to appropriate channel including improvement suggestions. \nContributes to a positive team environment and proactively aids team members with difficult contacts as needed. \nMaintains acceptable performance metrics such as quality, productivity, first contact resolution, and attendance. \n \nIncrementando la presencia de Airbnb en el mercado Español \nHaciendo venta directas y negociaciones telefónicas a usuarios potenciales \nEnvió de emails a nuevos usuarios. \nSiendo el punto de contacto para nuevos usuarios y ayudándoles al uso debido de la plataforma web. Limpia y profesional comunicación escrita y oral para mejorar y construir un excelente servicio de ventas. \nBúsqueda activa de soluciones a través del razonamiento e interpretación de datos lógicos y sus tendencia al canal adecuado, incluyendo sugerencia y mejoras. \nConstrucción de un buen ambiente de trabajo en equipo positivo ayudando a los miembros del equipo de manera proactiva con contactos difíciles cuando sea necesario. \nManteniendo las metas de rendimiento aceptables, tales como calidad, productividad y primera resolución de contactos y asistencia Manager Sales Consulter Orange May 2013  –  December 2013  (8 months) Guinardo Barcelona Targeting focused direct sales of mobile and fixed contracts for the personal and business market, manager to increase ratio of turnover for the shop (increased 30%), increasing the daily “walk-in” customers to the shop in the zone Guinardo, Barcelona. \n \n \nenfocado a objetivos planteados por la empresa en la venta directa líneas móviles y fijas para particulares y empresas, responsable del aumento del Ratio de Conversión de tienda (30%) incrementado fluido peatonal dentro de la misma y aumentando oportunidad de ventas en la zona de Guidarno Barcelona. Manager Sales Consulter Orange May 2013  –  December 2013  (8 months) Guinardo Barcelona Targeting focused direct sales of mobile and fixed contracts for the personal and business market, manager to increase ratio of turnover for the shop (increased 30%), increasing the daily “walk-in” customers to the shop in the zone Guinardo, Barcelona. \n \n \nenfocado a objetivos planteados por la empresa en la venta directa líneas móviles y fijas para particulares y empresas, responsable del aumento del Ratio de Conversión de tienda (30%) incrementado fluido peatonal dentro de la misma y aumentando oportunidad de ventas en la zona de Guidarno Barcelona. Sales Supervisor The Phone House Telecom GmbH November 2009  –  January 2013  (3 years 3 months) Barcelona Area, Spain Sales focused on store sales-targets, sales of mobile and fixed line contracts for personal and business customers in La Maquinista shopping mall. This store is ranked no.1 in Spain and my sales skills in this store got me on a 5th place regarding sales statistics on a national level. \nManager Store Type C The Phone House \nGeneral manager of a shop with category C (September 2011) in Carretera de Sants Barcelona with direct responsibility over 2 employees. Responsible for increasing sales of the shop (from 8,000€ to 21,000€ per month) and handling logistics with the head office. \nManager Store Type B The Phone House  \nGeneral manager of a shop with category B (March 2012) in Travessera de Gracia Barcelona, direct responsibility over 5 employees, increasing volume of sales and logistics with the head office. \nSupervisor of Stores The Phone House \nSupervisor of shops situated in the “high Zone” of Barcelona (July 2012) (travessera de Gracia, Tuset, Muntaner) applying models of sales methods and negotiations for the stores.  \n \nComercial de ventas enfocado a objetivos pautados por la tienda, venta de líneas telefónicas móviles y fijas para particulares y empresas en el Centro Comercial La Maquinista, tienda No 1 en España y vendedor numero 5 de España. \nManager tienda Tipo C The Phone House \nManager general de tienda en Carretera de Sants categoría C (11/11) con competencia directa en 2 trabajadores y responsable del incremento de ventas de la tienda (de 8,000€ a 21,000€ por mes) y manejo logística con la central. \nManager tienda Tipo B The Phone House  \nManager general de tienda categoría B (03/12) en Travessera de Gracia, competencia directa con 5 trabajadores, incrementando volumen de ventas y logística con la central. \nSupervisor de tiendas The Phone House \nSupervisor de tiendas ubicadas en la Zona alta de Barcelona (07/12) aplicando modelos de negociaciones para vendedores con el uso de las herramientas otorgadas por la compañía mediante cursos realizados en la misma. Sales Supervisor The Phone House Telecom GmbH November 2009  –  January 2013  (3 years 3 months) Barcelona Area, Spain Sales focused on store sales-targets, sales of mobile and fixed line contracts for personal and business customers in La Maquinista shopping mall. This store is ranked no.1 in Spain and my sales skills in this store got me on a 5th place regarding sales statistics on a national level. \nManager Store Type C The Phone House \nGeneral manager of a shop with category C (September 2011) in Carretera de Sants Barcelona with direct responsibility over 2 employees. Responsible for increasing sales of the shop (from 8,000€ to 21,000€ per month) and handling logistics with the head office. \nManager Store Type B The Phone House  \nGeneral manager of a shop with category B (March 2012) in Travessera de Gracia Barcelona, direct responsibility over 5 employees, increasing volume of sales and logistics with the head office. \nSupervisor of Stores The Phone House \nSupervisor of shops situated in the “high Zone” of Barcelona (July 2012) (travessera de Gracia, Tuset, Muntaner) applying models of sales methods and negotiations for the stores.  \n \nComercial de ventas enfocado a objetivos pautados por la tienda, venta de líneas telefónicas móviles y fijas para particulares y empresas en el Centro Comercial La Maquinista, tienda No 1 en España y vendedor numero 5 de España. \nManager tienda Tipo C The Phone House \nManager general de tienda en Carretera de Sants categoría C (11/11) con competencia directa en 2 trabajadores y responsable del incremento de ventas de la tienda (de 8,000€ a 21,000€ por mes) y manejo logística con la central. \nManager tienda Tipo B The Phone House  \nManager general de tienda categoría B (03/12) en Travessera de Gracia, competencia directa con 5 trabajadores, incrementando volumen de ventas y logística con la central. \nSupervisor de tiendas The Phone House \nSupervisor de tiendas ubicadas en la Zona alta de Barcelona (07/12) aplicando modelos de negociaciones para vendedores con el uso de las herramientas otorgadas por la compañía mediante cursos realizados en la misma. Logística productos industriales supermercados grandes plataformas. Hindustan Unilever Limited August 2009  –  September 2009  (2 months) Barcelona Area, Spain Managing logistics products such as deodorants, perfumes, sun screens, detergents, air fresheners, shampoos, hair products, soaps, etc. Product positioning within the supermarkets Alcampo, Carrefour and Mercadona, ensuring that these have sufficient inventories in stock, ordering products, working together with the department managers for the perfumery and pharmacy inside the stores. \n \nGestionando logística de productos personales, desodorantes, perfumes, protectores solares, detergentes, ambientadores, champoos, etc… y su posición dentro de los supermercados Alcampo, Carrefour y Mercadona, asegurándome de inventarios y haciendo pedidos directos, trabajando conjuntamente con departamentos perfumería y droguería. Logística productos industriales supermercados grandes plataformas. Hindustan Unilever Limited August 2009  –  September 2009  (2 months) Barcelona Area, Spain Managing logistics products such as deodorants, perfumes, sun screens, detergents, air fresheners, shampoos, hair products, soaps, etc. Product positioning within the supermarkets Alcampo, Carrefour and Mercadona, ensuring that these have sufficient inventories in stock, ordering products, working together with the department managers for the perfumery and pharmacy inside the stores. \n \nGestionando logística de productos personales, desodorantes, perfumes, protectores solares, detergentes, ambientadores, champoos, etc… y su posición dentro de los supermercados Alcampo, Carrefour y Mercadona, asegurándome de inventarios y haciendo pedidos directos, trabajando conjuntamente con departamentos perfumería y droguería. Logística productos industriales supermercados grandes plataformas. Merchanservis February 2009  –  August 2009  (7 months) Barcelona Area, Spain Our main client UNILEVER, S. A., would hire the services of our company to ensure that the supermarkets have sufficient inventory and also for logistics of products like deodorants, hair products, detergents, products related to perfumery and cleaning products. Direct relation with supermarkets and their warehouses of the products described above for maintaining the inventory, logistics and organizing the pallets of the products. \n \nNuestro principal cliente UNILLEVER, S. A., contrata los servicios de nuestra empresa para hacerle una parte de la logística de sus productos como desodorantes, productos capilares, detergentes, productos relacionados con perfumería y limpieza del hogar, relación directa con hipermercados y sus almacenes para la organización de los productos dentro y fuera de la plataforma, solicitando pedidos a encargados directo con la compañía-cliente para mantener inventarios mínimos. Logística productos industriales supermercados grandes plataformas. Merchanservis February 2009  –  August 2009  (7 months) Barcelona Area, Spain Our main client UNILEVER, S. A., would hire the services of our company to ensure that the supermarkets have sufficient inventory and also for logistics of products like deodorants, hair products, detergents, products related to perfumery and cleaning products. Direct relation with supermarkets and their warehouses of the products described above for maintaining the inventory, logistics and organizing the pallets of the products. \n \nNuestro principal cliente UNILLEVER, S. A., contrata los servicios de nuestra empresa para hacerle una parte de la logística de sus productos como desodorantes, productos capilares, detergentes, productos relacionados con perfumería y limpieza del hogar, relación directa con hipermercados y sus almacenes para la organización de los productos dentro y fuera de la plataforma, solicitando pedidos a encargados directo con la compañía-cliente para mantener inventarios mínimos. Jefe departamento perfumería y droguería Auchan August 2008  –  January 2009  (6 months) Barcelona Area, Spain Managing logistics of two departments with direct responsibility over 10 workers for the set up of products in supermarkets corridors, organization of pallets in warehouse with heavy machinery for transfers of products, controlling systems for damaged goods, scheduling directly with managers of big companies like UNILEVER, PROCTER&GAMBLE, HENKEL, JOHNSON&JOHNSON, etc., for strategic locations of their products and scheduling calendar for summer campaigns and products related to current promotions. \n \nGestionando logística de dos departamentos con competencia directa de 10 trabajadores para la puesta en marcha de productos en pasillo en el hipermercado, organización de almacenes con maquinaria pesada para traslados de productos en palets y controlando sistemas de disminución de rotura, planificando directamente con jefes de grandes empresas como UNILEVER, PROCTER&GAMBLE, HENKEL, JHONSON&JHONSON, etc…, ubicaciones estratégicas de sus productos y planificando calendario para campañas de Verano y Navidades de sus productos. Jefe departamento perfumería y droguería Auchan August 2008  –  January 2009  (6 months) Barcelona Area, Spain Managing logistics of two departments with direct responsibility over 10 workers for the set up of products in supermarkets corridors, organization of pallets in warehouse with heavy machinery for transfers of products, controlling systems for damaged goods, scheduling directly with managers of big companies like UNILEVER, PROCTER&GAMBLE, HENKEL, JOHNSON&JOHNSON, etc., for strategic locations of their products and scheduling calendar for summer campaigns and products related to current promotions. \n \nGestionando logística de dos departamentos con competencia directa de 10 trabajadores para la puesta en marcha de productos en pasillo en el hipermercado, organización de almacenes con maquinaria pesada para traslados de productos en palets y controlando sistemas de disminución de rotura, planificando directamente con jefes de grandes empresas como UNILEVER, PROCTER&GAMBLE, HENKEL, JHONSON&JHONSON, etc…, ubicaciones estratégicas de sus productos y planificando calendario para campañas de Verano y Navidades de sus productos. Comercial de compra y venta de inmuebles. Tecnocasa Tunisie February 2008  –  July 2008  (6 months) Barcelona Area, Spain Senior sales for the zone of Eixample and Raval in Barcelona, door-to-door sales, measuring and calculating square meter value of flats. Attracting clients in the street, economic study of the market with internal office tools and courses.  \n \nAsesor inmobiliario para la zona de Example y Raval Barcelona, vendedor de puerta fría, tasador de pisos, y captación de clientes en la calle, estudio económico del mercado con herramientas y cursos realizados dentro de la empresa en sus centrales por profesionales del sector Comercial de compra y venta de inmuebles. Tecnocasa Tunisie February 2008  –  July 2008  (6 months) Barcelona Area, Spain Senior sales for the zone of Eixample and Raval in Barcelona, door-to-door sales, measuring and calculating square meter value of flats. Attracting clients in the street, economic study of the market with internal office tools and courses.  \n \nAsesor inmobiliario para la zona de Example y Raval Barcelona, vendedor de puerta fría, tasador de pisos, y captación de clientes en la calle, estudio económico del mercado con herramientas y cursos realizados dentro de la empresa en sus centrales por profesionales del sector Socio y Gerente General. El Rincón del Caballista August 1998  –  February 2007  (8 years 7 months) San Cristobal, Venezuela Owner of a country club with hotel, restaurant, disco, parking, recreational zones, swimming pool and sportive areas, the total size of this club is 6000m2. Directly managing 90 workers, working in all the departments (kitchen, bar, laundry, service room, parking, cleaning, administration, patents, etc..) for later managing the direction of the club since the year 2000. \n \nPropietario de un country club con hotel, restaurante, disco, parking, zonas recreativas, piscina y canchas deportivas, área 6000mts2, competencia directa en 90 trabajadores, laborando en todos sus departamentos (cocina, barra, lavandería, salón, parking, limpieza, administración, patentes, etc..) para posteriormente gestionar la dirección del club en el año 2000. Socio y Gerente General. El Rincón del Caballista August 1998  –  February 2007  (8 years 7 months) San Cristobal, Venezuela Owner of a country club with hotel, restaurant, disco, parking, recreational zones, swimming pool and sportive areas, the total size of this club is 6000m2. Directly managing 90 workers, working in all the departments (kitchen, bar, laundry, service room, parking, cleaning, administration, patents, etc..) for later managing the direction of the club since the year 2000. \n \nPropietario de un country club con hotel, restaurante, disco, parking, zonas recreativas, piscina y canchas deportivas, área 6000mts2, competencia directa en 90 trabajadores, laborando en todos sus departamentos (cocina, barra, lavandería, salón, parking, limpieza, administración, patentes, etc..) para posteriormente gestionar la dirección del club en el año 2000. Languages Inglés Full professional proficiency castellano Native or bilingual proficiency catalan Elementary proficiency Sueco Limited working proficiency Inglés Full professional proficiency castellano Native or bilingual proficiency catalan Elementary proficiency Sueco Limited working proficiency Inglés Full professional proficiency castellano Native or bilingual proficiency catalan Elementary proficiency Sueco Limited working proficiency Full professional proficiency Native or bilingual proficiency Elementary proficiency Limited working proficiency Skills Organizational... Organizational... Project Planning Resolving Conflicts Process Optimization Quality Control Strategic Planning Process Engineering Project Management Market Planning Logistics Logistics Management Requirements Analysis Analytics Market Analysis Industrial Engineering Organizational Structure Organization Inglés Gestión de proyectos Administración y... Planificación... Ventas Logística Redes sociales Servicio de atención al... Comunicaciones de... Negociación Planeamiento de... Español Estrategia empresarial Microsoft Office Estrategia Estrategia de... See 19+     See less Skills  Organizational... Organizational... Project Planning Resolving Conflicts Process Optimization Quality Control Strategic Planning Process Engineering Project Management Market Planning Logistics Logistics Management Requirements Analysis Analytics Market Analysis Industrial Engineering Organizational Structure Organization Inglés Gestión de proyectos Administración y... Planificación... Ventas Logística Redes sociales Servicio de atención al... Comunicaciones de... Negociación Planeamiento de... Español Estrategia empresarial Microsoft Office Estrategia Estrategia de... See 19+     See less Organizational... Organizational... Project Planning Resolving Conflicts Process Optimization Quality Control Strategic Planning Process Engineering Project Management Market Planning Logistics Logistics Management Requirements Analysis Analytics Market Analysis Industrial Engineering Organizational Structure Organization Inglés Gestión de proyectos Administración y... Planificación... Ventas Logística Redes sociales Servicio de atención al... Comunicaciones de... Negociación Planeamiento de... Español Estrategia empresarial Microsoft Office Estrategia Estrategia de... See 19+     See less Organizational... Organizational... Project Planning Resolving Conflicts Process Optimization Quality Control Strategic Planning Process Engineering Project Management Market Planning Logistics Logistics Management Requirements Analysis Analytics Market Analysis Industrial Engineering Organizational Structure Organization Inglés Gestión de proyectos Administración y... Planificación... Ventas Logística Redes sociales Servicio de atención al... Comunicaciones de... Negociación Planeamiento de... Español Estrategia empresarial Microsoft Office Estrategia Estrategia de... See 19+     See less Education Informática i Oficis Master,  Gestión Informatizada de Empresas 2011  – 2012 Instituto Universitario de Tecnología Industrial Ingeniero Técnico,  producción Industrial 2002  – 2006 Universidad Nacional Experimental de los Llanos Occidentales formador de cooperativas,  Empresas Grandes/Medianas Plataformas 2005  – 2005 Informática i Oficis Master,  Gestión Informatizada de Empresas 2011  – 2012 Informática i Oficis Master,  Gestión Informatizada de Empresas 2011  – 2012 Informática i Oficis Master,  Gestión Informatizada de Empresas 2011  – 2012 Instituto Universitario de Tecnología Industrial Ingeniero Técnico,  producción Industrial 2002  – 2006 Instituto Universitario de Tecnología Industrial Ingeniero Técnico,  producción Industrial 2002  – 2006 Instituto Universitario de Tecnología Industrial Ingeniero Técnico,  producción Industrial 2002  – 2006 Universidad Nacional Experimental de los Llanos Occidentales formador de cooperativas,  Empresas Grandes/Medianas Plataformas 2005  – 2005 Universidad Nacional Experimental de los Llanos Occidentales formador de cooperativas,  Empresas Grandes/Medianas Plataformas 2005  – 2005 Universidad Nacional Experimental de los Llanos Occidentales formador de cooperativas,  Empresas Grandes/Medianas Plataformas 2005  – 2005 Honors & Awards ", "Experience Technical Support Advisor - Google/Android project SELLBYTEL Group Spain October 2014  – Present (11 months) Junior Recruiter SGF Global February 2014  –  June 2014  (5 months) Captación de talentos a través de portales de reclutamiento, redes sociales, anuncios de prensa, ferias de empleo y referencias. \nManejo de los diferentes portales de reclutamiento tanto nacionales (Bumeran, Empleate, Computrabajo, Perfilnet, etc) como internacionales (Monster, Empleo, OccMundial, Oil careers, Rigzone, etc.), al igual que las distintas redes sociales (Linkedin, Twitter, Facebook). \nRevisión de CVs y pre-entrevistas telefónicas. \nChequeo de referencias. \nElaboración de informes. \nCoordinación de exámenes pre empleo. \nInvestigación de mercado. \nHead-hunting. \nConsultoría. \nMantenimiento de base de datos de candidatos elegibles. \nManejo del Sistema Bullhorne. Asistente de Reclutamiento SGF Global October 2013  –  February 2014  (5 months) Venezuela Dar formato a CVs en español e inglés. \nBúsqueda de pre-candidatos en portales web. \nTraducción de CVs español-inglés. \nAtención y soporte a reclutadores. Junior Account Manager budgetplaces.com May 2013  –  July 2013  (3 months) Barcelona Area, Spain Gestionar relación con más de 500 hoteles, hostales y B&B. \nRevisión y puesta en funcionamiento de perfiles en el portal web de la empresa. \nAtención telefónica a hoteleros. Technical Support Advisor - Google/Android project SELLBYTEL Group Spain October 2014  – Present (11 months) Technical Support Advisor - Google/Android project SELLBYTEL Group Spain October 2014  – Present (11 months) Junior Recruiter SGF Global February 2014  –  June 2014  (5 months) Captación de talentos a través de portales de reclutamiento, redes sociales, anuncios de prensa, ferias de empleo y referencias. \nManejo de los diferentes portales de reclutamiento tanto nacionales (Bumeran, Empleate, Computrabajo, Perfilnet, etc) como internacionales (Monster, Empleo, OccMundial, Oil careers, Rigzone, etc.), al igual que las distintas redes sociales (Linkedin, Twitter, Facebook). \nRevisión de CVs y pre-entrevistas telefónicas. \nChequeo de referencias. \nElaboración de informes. \nCoordinación de exámenes pre empleo. \nInvestigación de mercado. \nHead-hunting. \nConsultoría. \nMantenimiento de base de datos de candidatos elegibles. \nManejo del Sistema Bullhorne. Junior Recruiter SGF Global February 2014  –  June 2014  (5 months) Captación de talentos a través de portales de reclutamiento, redes sociales, anuncios de prensa, ferias de empleo y referencias. \nManejo de los diferentes portales de reclutamiento tanto nacionales (Bumeran, Empleate, Computrabajo, Perfilnet, etc) como internacionales (Monster, Empleo, OccMundial, Oil careers, Rigzone, etc.), al igual que las distintas redes sociales (Linkedin, Twitter, Facebook). \nRevisión de CVs y pre-entrevistas telefónicas. \nChequeo de referencias. \nElaboración de informes. \nCoordinación de exámenes pre empleo. \nInvestigación de mercado. \nHead-hunting. \nConsultoría. \nMantenimiento de base de datos de candidatos elegibles. \nManejo del Sistema Bullhorne. Asistente de Reclutamiento SGF Global October 2013  –  February 2014  (5 months) Venezuela Dar formato a CVs en español e inglés. \nBúsqueda de pre-candidatos en portales web. \nTraducción de CVs español-inglés. \nAtención y soporte a reclutadores. Asistente de Reclutamiento SGF Global October 2013  –  February 2014  (5 months) Venezuela Dar formato a CVs en español e inglés. \nBúsqueda de pre-candidatos en portales web. \nTraducción de CVs español-inglés. \nAtención y soporte a reclutadores. Junior Account Manager budgetplaces.com May 2013  –  July 2013  (3 months) Barcelona Area, Spain Gestionar relación con más de 500 hoteles, hostales y B&B. \nRevisión y puesta en funcionamiento de perfiles en el portal web de la empresa. \nAtención telefónica a hoteleros. Junior Account Manager budgetplaces.com May 2013  –  July 2013  (3 months) Barcelona Area, Spain Gestionar relación con más de 500 hoteles, hostales y B&B. \nRevisión y puesta en funcionamiento de perfiles en el portal web de la empresa. \nAtención telefónica a hoteleros. Languages Español Native or bilingual proficiency Inglés Native or bilingual proficiency Español Native or bilingual proficiency Inglés Native or bilingual proficiency Español Native or bilingual proficiency Inglés Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Digital Cinema WordPress Blogger Final Cut Pro Sound English International... Inglés Microsoft Word Gas Trabajo en equipo Ingeniería Recruiting Redes sociales Selección de personal Planificación... Petróleo y gas natural Servicio de atención al... Microsoft Office Recursos humanos Customer Service See 6+     See less Skills  Digital Cinema WordPress Blogger Final Cut Pro Sound English International... Inglés Microsoft Word Gas Trabajo en equipo Ingeniería Recruiting Redes sociales Selección de personal Planificación... Petróleo y gas natural Servicio de atención al... Microsoft Office Recursos humanos Customer Service See 6+     See less Digital Cinema WordPress Blogger Final Cut Pro Sound English International... Inglés Microsoft Word Gas Trabajo en equipo Ingeniería Recruiting Redes sociales Selección de personal Planificación... Petróleo y gas natural Servicio de atención al... Microsoft Office Recursos humanos Customer Service See 6+     See less Digital Cinema WordPress Blogger Final Cut Pro Sound English International... Inglés Microsoft Word Gas Trabajo en equipo Ingeniería Recruiting Redes sociales Selección de personal Planificación... Petróleo y gas natural Servicio de atención al... Microsoft Office Recursos humanos Customer Service See 6+     See less Education Universitat Pompeu Fabra Máster en estudios comparados de literatura, arte y pensamiento,  Artes liberales y ciencias, estudios generales y humanidades 2011  – 2015 ESCAC Máster en Documental y Sociedad,  Cinematography and Film/Video Production 2010  – 2010 ESCAC Máster en Montaje Cinematográfico,  Cinematography and Film/Video Production 2010  – 2010 Universidad Metropolitana (VE) Licenciatura en Estudios Liberales,  Ciencias sociales 2004  – 2009 Universitat Pompeu Fabra Máster en estudios comparados de literatura, arte y pensamiento,  Artes liberales y ciencias, estudios generales y humanidades 2011  – 2015 Universitat Pompeu Fabra Máster en estudios comparados de literatura, arte y pensamiento,  Artes liberales y ciencias, estudios generales y humanidades 2011  – 2015 Universitat Pompeu Fabra Máster en estudios comparados de literatura, arte y pensamiento,  Artes liberales y ciencias, estudios generales y humanidades 2011  – 2015 ESCAC Máster en Documental y Sociedad,  Cinematography and Film/Video Production 2010  – 2010 ESCAC Máster en Documental y Sociedad,  Cinematography and Film/Video Production 2010  – 2010 ESCAC Máster en Documental y Sociedad,  Cinematography and Film/Video Production 2010  – 2010 ESCAC Máster en Montaje Cinematográfico,  Cinematography and Film/Video Production 2010  – 2010 ESCAC Máster en Montaje Cinematográfico,  Cinematography and Film/Video Production 2010  – 2010 ESCAC Máster en Montaje Cinematográfico,  Cinematography and Film/Video Production 2010  – 2010 Universidad Metropolitana (VE) Licenciatura en Estudios Liberales,  Ciencias sociales 2004  – 2009 Universidad Metropolitana (VE) Licenciatura en Estudios Liberales,  Ciencias sociales 2004  – 2009 Universidad Metropolitana (VE) Licenciatura en Estudios Liberales,  Ciencias sociales 2004  – 2009 ", "Summary Specialties:Deportes Summary Specialties:Deportes Specialties:Deportes Specialties:Deportes Experience Real Time Monitor -Work Force Management SELLBYTEL Group Spain June 2015  – Present (3 months) Barcelona Area, Spain Spanish/UK Technical Support Advisor for Google Android SELLBYTEL Group Spain February 2015  –  June 2015  (5 months) Quality Analyst Evaluator BPA Quality May 2013  –  November 2014  (1 year 7 months) Exeter, United Kingdom Redactor Deportes telemadrid January 2011  –  July 2011  (7 months) Madrid Area, Spain Real Time Monitor -Work Force Management SELLBYTEL Group Spain June 2015  – Present (3 months) Barcelona Area, Spain Real Time Monitor -Work Force Management SELLBYTEL Group Spain June 2015  – Present (3 months) Barcelona Area, Spain Spanish/UK Technical Support Advisor for Google Android SELLBYTEL Group Spain February 2015  –  June 2015  (5 months) Spanish/UK Technical Support Advisor for Google Android SELLBYTEL Group Spain February 2015  –  June 2015  (5 months) Quality Analyst Evaluator BPA Quality May 2013  –  November 2014  (1 year 7 months) Exeter, United Kingdom Quality Analyst Evaluator BPA Quality May 2013  –  November 2014  (1 year 7 months) Exeter, United Kingdom Redactor Deportes telemadrid January 2011  –  July 2011  (7 months) Madrid Area, Spain Redactor Deportes telemadrid January 2011  –  July 2011  (7 months) Madrid Area, Spain Languages Inglés Vasco Inglés Vasco Inglés Vasco Skills Blogs Microsoft Office Redes sociales Periodismo Mercadotecnia en medios... Publicidad en Internet Televisión Relaciones públicas Skills  Blogs Microsoft Office Redes sociales Periodismo Mercadotecnia en medios... Publicidad en Internet Televisión Relaciones públicas Blogs Microsoft Office Redes sociales Periodismo Mercadotecnia en medios... Publicidad en Internet Televisión Relaciones públicas Blogs Microsoft Office Redes sociales Periodismo Mercadotecnia en medios... Publicidad en Internet Televisión Relaciones públicas Education Escuela Superior de Imagen y Sonido de Madrid Master,  Periodismo Deportivo 2010  – 2011 Activities and Societies:  Desplazamiento para cubrir entrenamientos y ruedas de prensa de Getafe C.F. y Rayo Vallecano. Universidad Pontificia de Salamanca Licenciatura,  Periodismo 2004  – 2010 Escuela Superior de Imagen y Sonido de Madrid Master,  Periodismo Deportivo 2010  – 2011 Activities and Societies:  Desplazamiento para cubrir entrenamientos y ruedas de prensa de Getafe C.F. y Rayo Vallecano. Escuela Superior de Imagen y Sonido de Madrid Master,  Periodismo Deportivo 2010  – 2011 Activities and Societies:  Desplazamiento para cubrir entrenamientos y ruedas de prensa de Getafe C.F. y Rayo Vallecano. Escuela Superior de Imagen y Sonido de Madrid Master,  Periodismo Deportivo 2010  – 2011 Activities and Societies:  Desplazamiento para cubrir entrenamientos y ruedas de prensa de Getafe C.F. y Rayo Vallecano. Universidad Pontificia de Salamanca Licenciatura,  Periodismo 2004  – 2010 Universidad Pontificia de Salamanca Licenciatura,  Periodismo 2004  – 2010 Universidad Pontificia de Salamanca Licenciatura,  Periodismo 2004  – 2010 ", "Summary I´m a Marketing and Community Management specialist with experience working as a Community Manager and performing marketing research. I´ve also got experience in management, sales, online sales, customer support. I completed the following courses related to this field: \n- ECommerce \n- Community Management \n- Wordpress \n- Foundations of Business Strategy \n \nI´ve also got degree in Law and Master degree in International Business.  \n \nI write my own blog: www.lilyandspain.wordpress.com. Writing is my hobby and profession. \nMy goal is to develop my professional skills and generally to grow as a person. Summary I´m a Marketing and Community Management specialist with experience working as a Community Manager and performing marketing research. I´ve also got experience in management, sales, online sales, customer support. I completed the following courses related to this field: \n- ECommerce \n- Community Management \n- Wordpress \n- Foundations of Business Strategy \n \nI´ve also got degree in Law and Master degree in International Business.  \n \nI write my own blog: www.lilyandspain.wordpress.com. Writing is my hobby and profession. \nMy goal is to develop my professional skills and generally to grow as a person. I´m a Marketing and Community Management specialist with experience working as a Community Manager and performing marketing research. I´ve also got experience in management, sales, online sales, customer support. I completed the following courses related to this field: \n- ECommerce \n- Community Management \n- Wordpress \n- Foundations of Business Strategy \n \nI´ve also got degree in Law and Master degree in International Business.  \n \nI write my own blog: www.lilyandspain.wordpress.com. Writing is my hobby and profession. \nMy goal is to develop my professional skills and generally to grow as a person. I´m a Marketing and Community Management specialist with experience working as a Community Manager and performing marketing research. I´ve also got experience in management, sales, online sales, customer support. I completed the following courses related to this field: \n- ECommerce \n- Community Management \n- Wordpress \n- Foundations of Business Strategy \n \nI´ve also got degree in Law and Master degree in International Business.  \n \nI write my own blog: www.lilyandspain.wordpress.com. Writing is my hobby and profession. \nMy goal is to develop my professional skills and generally to grow as a person. Experience Technical Support Advisor at Google Android SELLBYTEL Group March 2015  – Present (6 months) Barcelona Area, Spain -Maintaining client relationships through product support  \n-Responding to incoming calls and emails from end users \n-Managing effectively all incoming incidents  \n-Gathering information from customers, troubleshooting technical issues \n Senior Sales Associate Burberry May 2013  –  November 2014  (1 year 7 months) Barcelona, Spain - organizing daily routine \n- customer service, also via phone and email \n- till operations \n- stylism advice for customers \n- support for team  \n- customer base creation and maintaining contact with existing customers \n- preparing weekly feedback on sales and customer information \n- online sales Content&Community Manager EUeasy January 2013  –  August 2013  (8 months) Spain - Creating content for blog of the company and administrating group of the company in social nets \n- Responsible for Online Reputation of the company \n- Promotion of the company via Marketing Online \n- Managing groups of the company in different social nets \n- Customer service via email and online Translator individual entrepreneur January 2009  –  July 2013  (4 years 7 months) English into Russian, Russian into English, Spanish into Russian, Russian into Spanish translations Assistant at Export Department Opera Global Business March 2012  –  July 2012  (5 months) Cordoba - marketing research \n- creating detailed marketing related documents \n- organization of events and supporting business travels \n- working on international projects \n- customer service \n- administrative tasks Internet Assessor Lionbridge March 2011  –  September 2011  (7 months) Russia - Analysis of Web content \n- Suggestions on how to improve the quality of internet search \n- Translations \n- Suggestions on how to improve automatic translation systems \n- Working on various Google projects Legal and Administrative Assistant SRL Kardinal January 2009  –  February 2011  (2 years 2 months) Kazan, Russia - legal research \n- preparing and editing legal documents \n- customer base creation \n- support for the general manager \n- invoices Technical Support Advisor at Google Android SELLBYTEL Group March 2015  – Present (6 months) Barcelona Area, Spain -Maintaining client relationships through product support  \n-Responding to incoming calls and emails from end users \n-Managing effectively all incoming incidents  \n-Gathering information from customers, troubleshooting technical issues \n Technical Support Advisor at Google Android SELLBYTEL Group March 2015  – Present (6 months) Barcelona Area, Spain -Maintaining client relationships through product support  \n-Responding to incoming calls and emails from end users \n-Managing effectively all incoming incidents  \n-Gathering information from customers, troubleshooting technical issues \n Senior Sales Associate Burberry May 2013  –  November 2014  (1 year 7 months) Barcelona, Spain - organizing daily routine \n- customer service, also via phone and email \n- till operations \n- stylism advice for customers \n- support for team  \n- customer base creation and maintaining contact with existing customers \n- preparing weekly feedback on sales and customer information \n- online sales Senior Sales Associate Burberry May 2013  –  November 2014  (1 year 7 months) Barcelona, Spain - organizing daily routine \n- customer service, also via phone and email \n- till operations \n- stylism advice for customers \n- support for team  \n- customer base creation and maintaining contact with existing customers \n- preparing weekly feedback on sales and customer information \n- online sales Content&Community Manager EUeasy January 2013  –  August 2013  (8 months) Spain - Creating content for blog of the company and administrating group of the company in social nets \n- Responsible for Online Reputation of the company \n- Promotion of the company via Marketing Online \n- Managing groups of the company in different social nets \n- Customer service via email and online Content&Community Manager EUeasy January 2013  –  August 2013  (8 months) Spain - Creating content for blog of the company and administrating group of the company in social nets \n- Responsible for Online Reputation of the company \n- Promotion of the company via Marketing Online \n- Managing groups of the company in different social nets \n- Customer service via email and online Translator individual entrepreneur January 2009  –  July 2013  (4 years 7 months) English into Russian, Russian into English, Spanish into Russian, Russian into Spanish translations Translator individual entrepreneur January 2009  –  July 2013  (4 years 7 months) English into Russian, Russian into English, Spanish into Russian, Russian into Spanish translations Assistant at Export Department Opera Global Business March 2012  –  July 2012  (5 months) Cordoba - marketing research \n- creating detailed marketing related documents \n- organization of events and supporting business travels \n- working on international projects \n- customer service \n- administrative tasks Assistant at Export Department Opera Global Business March 2012  –  July 2012  (5 months) Cordoba - marketing research \n- creating detailed marketing related documents \n- organization of events and supporting business travels \n- working on international projects \n- customer service \n- administrative tasks Internet Assessor Lionbridge March 2011  –  September 2011  (7 months) Russia - Analysis of Web content \n- Suggestions on how to improve the quality of internet search \n- Translations \n- Suggestions on how to improve automatic translation systems \n- Working on various Google projects Internet Assessor Lionbridge March 2011  –  September 2011  (7 months) Russia - Analysis of Web content \n- Suggestions on how to improve the quality of internet search \n- Translations \n- Suggestions on how to improve automatic translation systems \n- Working on various Google projects Legal and Administrative Assistant SRL Kardinal January 2009  –  February 2011  (2 years 2 months) Kazan, Russia - legal research \n- preparing and editing legal documents \n- customer base creation \n- support for the general manager \n- invoices Legal and Administrative Assistant SRL Kardinal January 2009  –  February 2011  (2 years 2 months) Kazan, Russia - legal research \n- preparing and editing legal documents \n- customer base creation \n- support for the general manager \n- invoices Languages Russian Native or bilingual proficiency English Full professional proficiency Spanish Full professional proficiency Italian Elementary proficiency Russian Native or bilingual proficiency English Full professional proficiency Spanish Full professional proficiency Italian Elementary proficiency Russian Native or bilingual proficiency English Full professional proficiency Spanish Full professional proficiency Italian Elementary proficiency Native or bilingual proficiency Full professional proficiency Full professional proficiency Elementary proficiency Skills Spanish International business English Marketing Research International Sales Marketing Management Business Strategy E-commerce Russian Business Law WordPress Italian Blogging Retail Styling Writing See 1+     See less Skills  Spanish International business English Marketing Research International Sales Marketing Management Business Strategy E-commerce Russian Business Law WordPress Italian Blogging Retail Styling Writing See 1+     See less Spanish International business English Marketing Research International Sales Marketing Management Business Strategy E-commerce Russian Business Law WordPress Italian Blogging Retail Styling Writing See 1+     See less Spanish International business English Marketing Research International Sales Marketing Management Business Strategy E-commerce Russian Business Law WordPress Italian Blogging Retail Styling Writing See 1+     See less Education OnTesol English Teacher 2012  – 2012 Università Commerciale 'Luigi Bocconi' Managing Fashion and Luxury Companies 2014  – 2014 University of Virginia Foundations of Business Strategy 2013  – 2013 Instituto Marketing Online Community Management 2013  – 2013 Universidad de Córdoba Master's degree,  International Business , 7.5 2011  – 2012 Instituto Marketing Online WordPress 2013 Instituto Marketing Online Certificate,  E-Commerce/Electronic Commerce 2013 30 hours course Albe formación specialist,  Personal Shopper 2012 1000 hours course Federal University of Volga region postgraduate certificate,  Spanish and Spanish literature 2008  – 2011 Russian Academy of Justice Specialist (5 years),  Civil Law 2004  – 2009 OnTesol English Teacher 2012  – 2012 OnTesol English Teacher 2012  – 2012 OnTesol English Teacher 2012  – 2012 Università Commerciale 'Luigi Bocconi' Managing Fashion and Luxury Companies 2014  – 2014 Università Commerciale 'Luigi Bocconi' Managing Fashion and Luxury Companies 2014  – 2014 Università Commerciale 'Luigi Bocconi' Managing Fashion and Luxury Companies 2014  – 2014 University of Virginia Foundations of Business Strategy 2013  – 2013 University of Virginia Foundations of Business Strategy 2013  – 2013 University of Virginia Foundations of Business Strategy 2013  – 2013 Instituto Marketing Online Community Management 2013  – 2013 Instituto Marketing Online Community Management 2013  – 2013 Instituto Marketing Online Community Management 2013  – 2013 Universidad de Córdoba Master's degree,  International Business , 7.5 2011  – 2012 Universidad de Córdoba Master's degree,  International Business , 7.5 2011  – 2012 Universidad de Córdoba Master's degree,  International Business , 7.5 2011  – 2012 Instituto Marketing Online WordPress 2013 Instituto Marketing Online WordPress 2013 Instituto Marketing Online WordPress 2013 Instituto Marketing Online Certificate,  E-Commerce/Electronic Commerce 2013 30 hours course Instituto Marketing Online Certificate,  E-Commerce/Electronic Commerce 2013 30 hours course Instituto Marketing Online Certificate,  E-Commerce/Electronic Commerce 2013 30 hours course Albe formación specialist,  Personal Shopper 2012 1000 hours course Albe formación specialist,  Personal Shopper 2012 1000 hours course Albe formación specialist,  Personal Shopper 2012 1000 hours course Federal University of Volga region postgraduate certificate,  Spanish and Spanish literature 2008  – 2011 Federal University of Volga region postgraduate certificate,  Spanish and Spanish literature 2008  – 2011 Federal University of Volga region postgraduate certificate,  Spanish and Spanish literature 2008  – 2011 Russian Academy of Justice Specialist (5 years),  Civil Law 2004  – 2009 Russian Academy of Justice Specialist (5 years),  Civil Law 2004  – 2009 Russian Academy of Justice Specialist (5 years),  Civil Law 2004  – 2009 ", "Experience Team leader SELLBYTEL Group Spain June 2015  – Present (3 months) Google Chromecast project Technical Support Advisor SELLBYTEL Group Spain December 2014  –  June 2015  (7 months) Google Android project Translator - English / French / Norwegian/ Spanish Freelance 2014  –  June 2015  (1 year) Barcelona Area, Spain Translation of business and marketing documents between English, French and Norwegian. Event Coordinator Gyro AS August 2006  –  August 2012  (6 years 1 month) Oslo Area, Norway The job consisted of planning and executing events. Legal Trainee Gram, Hambro & Garman Advokatfirma AS November 2008  –  February 2010  (1 year 4 months) Oslo Area, Norway The job consisted of assisting in providing legal services to domestic and international business clients, public organizations, authorities and private individuals. The main emphasis was towards business law, EU and EEA law, international treaties and conventions. Team leader SELLBYTEL Group Spain June 2015  – Present (3 months) Google Chromecast project Team leader SELLBYTEL Group Spain June 2015  – Present (3 months) Google Chromecast project Technical Support Advisor SELLBYTEL Group Spain December 2014  –  June 2015  (7 months) Google Android project Technical Support Advisor SELLBYTEL Group Spain December 2014  –  June 2015  (7 months) Google Android project Translator - English / French / Norwegian/ Spanish Freelance 2014  –  June 2015  (1 year) Barcelona Area, Spain Translation of business and marketing documents between English, French and Norwegian. Translator - English / French / Norwegian/ Spanish Freelance 2014  –  June 2015  (1 year) Barcelona Area, Spain Translation of business and marketing documents between English, French and Norwegian. Event Coordinator Gyro AS August 2006  –  August 2012  (6 years 1 month) Oslo Area, Norway The job consisted of planning and executing events. Event Coordinator Gyro AS August 2006  –  August 2012  (6 years 1 month) Oslo Area, Norway The job consisted of planning and executing events. Legal Trainee Gram, Hambro & Garman Advokatfirma AS November 2008  –  February 2010  (1 year 4 months) Oslo Area, Norway The job consisted of assisting in providing legal services to domestic and international business clients, public organizations, authorities and private individuals. The main emphasis was towards business law, EU and EEA law, international treaties and conventions. Legal Trainee Gram, Hambro & Garman Advokatfirma AS November 2008  –  February 2010  (1 year 4 months) Oslo Area, Norway The job consisted of assisting in providing legal services to domestic and international business clients, public organizations, authorities and private individuals. The main emphasis was towards business law, EU and EEA law, international treaties and conventions. Languages English Native or bilingual proficiency French Native or bilingual proficiency Norwegian Native or bilingual proficiency Spanish Full professional proficiency German Limited working proficiency Catalan Limited working proficiency Latin Elementary proficiency English Native or bilingual proficiency French Native or bilingual proficiency Norwegian Native or bilingual proficiency Spanish Full professional proficiency German Limited working proficiency Catalan Limited working proficiency Latin Elementary proficiency English Native or bilingual proficiency French Native or bilingual proficiency Norwegian Native or bilingual proficiency Spanish Full professional proficiency German Limited working proficiency Catalan Limited working proficiency Latin Elementary proficiency Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Full professional proficiency Limited working proficiency Limited working proficiency Elementary proficiency Skills Skills     Education Universitat de Barcelona Master's degree 2013  – 2015 ESADE Business School Bachelor of Business Administration (BBA) 2012  – 2013 BI Norwegian Business School Bachelor of International Marketing 2010  – 2012 Lycée français René Cassin Baccalauréat économique et social 1989  – 2004 Collège du Léman 1996  – 2000 Universitat de Barcelona Master's degree 2013  – 2015 Universitat de Barcelona Master's degree 2013  – 2015 Universitat de Barcelona Master's degree 2013  – 2015 ESADE Business School Bachelor of Business Administration (BBA) 2012  – 2013 ESADE Business School Bachelor of Business Administration (BBA) 2012  – 2013 ESADE Business School Bachelor of Business Administration (BBA) 2012  – 2013 BI Norwegian Business School Bachelor of International Marketing 2010  – 2012 BI Norwegian Business School Bachelor of International Marketing 2010  – 2012 BI Norwegian Business School Bachelor of International Marketing 2010  – 2012 Lycée français René Cassin Baccalauréat économique et social 1989  – 2004 Lycée français René Cassin Baccalauréat économique et social 1989  – 2004 Lycée français René Cassin Baccalauréat économique et social 1989  – 2004 Collège du Léman 1996  – 2000 Collège du Léman 1996  – 2000 Collège du Léman 1996  – 2000 Honors & Awards ", "Summary - Almost 10 years experience in mass media, focused in radio broadcast and commercial advertising \n- Team player \n- Brand lover \n- Travel passionate \n- Focused in process improvements \n- Self-taught person Summary - Almost 10 years experience in mass media, focused in radio broadcast and commercial advertising \n- Team player \n- Brand lover \n- Travel passionate \n- Focused in process improvements \n- Self-taught person - Almost 10 years experience in mass media, focused in radio broadcast and commercial advertising \n- Team player \n- Brand lover \n- Travel passionate \n- Focused in process improvements \n- Self-taught person - Almost 10 years experience in mass media, focused in radio broadcast and commercial advertising \n- Team player \n- Brand lover \n- Travel passionate \n- Focused in process improvements \n- Self-taught person Experience Google Android Technical Support Advisor SELLBYTEL Group Spain - Google Android Project October 2014  – Present (11 months) Barcelona Area, Spain Part of the Technical Support and Service team. \nRepresenting one of the most prominent companies within IT/Communications sector. \n \nHandle direct client relationship assisting them within all related to services and products usage. HP Data Administrator SELLBYTEL Group Spain July 2014  –  October 2014  (4 months) Barcelona Area, Spain Working with Germany, UK, Italy, France, Spain, Switzerland and Netherlands account teams. \n \nEntry of customer, product type and quantity data into Smart Quote system, in order to request a \nquotation for Special Pricing for each partners’ opportunity. \n \nConduct the Self-Approval Process for Pricing, adhering to process description, TAT and  \nSLA defined \n \nManagement of quotations where additional discount level is requested, ensuring necessary  \njustification and approval details have been provided by Sales Team and captured correctly within  \nquotation request. \n \nCo-Ordinate Approval/Rejection Notifications from Bid Desk to Sales Teams Marketing Executive Volotea July 2013  –  July 2014  (1 year 1 month) Barcelona Area, Spain BTL, ATL,Online, Offline and Brand Awareness Campaign management for over 50 European markets \nBrand Guardianship Projects \nTracing of spending and efficiency on advertising production Quality Control Assistant Algier´s Impresores S.A. de C.V. December 2011  –  September 2012  (10 months) El Salvador Industrial Safety Committee Collaboration \nImplemented Maintenance and use of equipment policies and procedures \nNational Ballot Print Project Commercial Broadcaster / Radio Host Radio Femenina 102.5 FM, Grupo Radio Stereo March 2003  –  September 2012  (9 years 7 months) El Salvador Responsible for the production, conduction and marketing of a prime time show \nSales and Mass Media Negotiation Experience  \nCampaign Creation and Events Organization HHRR Assistant Algier´s Impresores S.A. de C.V. November 2010  –  December 2011  (1 year 2 months) El Salvador Organization Climate and Labor Environment Survey Support \nStaff Management Google Android Technical Support Advisor SELLBYTEL Group Spain - Google Android Project October 2014  – Present (11 months) Barcelona Area, Spain Part of the Technical Support and Service team. \nRepresenting one of the most prominent companies within IT/Communications sector. \n \nHandle direct client relationship assisting them within all related to services and products usage. Google Android Technical Support Advisor SELLBYTEL Group Spain - Google Android Project October 2014  – Present (11 months) Barcelona Area, Spain Part of the Technical Support and Service team. \nRepresenting one of the most prominent companies within IT/Communications sector. \n \nHandle direct client relationship assisting them within all related to services and products usage. HP Data Administrator SELLBYTEL Group Spain July 2014  –  October 2014  (4 months) Barcelona Area, Spain Working with Germany, UK, Italy, France, Spain, Switzerland and Netherlands account teams. \n \nEntry of customer, product type and quantity data into Smart Quote system, in order to request a \nquotation for Special Pricing for each partners’ opportunity. \n \nConduct the Self-Approval Process for Pricing, adhering to process description, TAT and  \nSLA defined \n \nManagement of quotations where additional discount level is requested, ensuring necessary  \njustification and approval details have been provided by Sales Team and captured correctly within  \nquotation request. \n \nCo-Ordinate Approval/Rejection Notifications from Bid Desk to Sales Teams HP Data Administrator SELLBYTEL Group Spain July 2014  –  October 2014  (4 months) Barcelona Area, Spain Working with Germany, UK, Italy, France, Spain, Switzerland and Netherlands account teams. \n \nEntry of customer, product type and quantity data into Smart Quote system, in order to request a \nquotation for Special Pricing for each partners’ opportunity. \n \nConduct the Self-Approval Process for Pricing, adhering to process description, TAT and  \nSLA defined \n \nManagement of quotations where additional discount level is requested, ensuring necessary  \njustification and approval details have been provided by Sales Team and captured correctly within  \nquotation request. \n \nCo-Ordinate Approval/Rejection Notifications from Bid Desk to Sales Teams Marketing Executive Volotea July 2013  –  July 2014  (1 year 1 month) Barcelona Area, Spain BTL, ATL,Online, Offline and Brand Awareness Campaign management for over 50 European markets \nBrand Guardianship Projects \nTracing of spending and efficiency on advertising production Marketing Executive Volotea July 2013  –  July 2014  (1 year 1 month) Barcelona Area, Spain BTL, ATL,Online, Offline and Brand Awareness Campaign management for over 50 European markets \nBrand Guardianship Projects \nTracing of spending and efficiency on advertising production Quality Control Assistant Algier´s Impresores S.A. de C.V. December 2011  –  September 2012  (10 months) El Salvador Industrial Safety Committee Collaboration \nImplemented Maintenance and use of equipment policies and procedures \nNational Ballot Print Project Quality Control Assistant Algier´s Impresores S.A. de C.V. December 2011  –  September 2012  (10 months) El Salvador Industrial Safety Committee Collaboration \nImplemented Maintenance and use of equipment policies and procedures \nNational Ballot Print Project Commercial Broadcaster / Radio Host Radio Femenina 102.5 FM, Grupo Radio Stereo March 2003  –  September 2012  (9 years 7 months) El Salvador Responsible for the production, conduction and marketing of a prime time show \nSales and Mass Media Negotiation Experience  \nCampaign Creation and Events Organization Commercial Broadcaster / Radio Host Radio Femenina 102.5 FM, Grupo Radio Stereo March 2003  –  September 2012  (9 years 7 months) El Salvador Responsible for the production, conduction and marketing of a prime time show \nSales and Mass Media Negotiation Experience  \nCampaign Creation and Events Organization HHRR Assistant Algier´s Impresores S.A. de C.V. November 2010  –  December 2011  (1 year 2 months) El Salvador Organization Climate and Labor Environment Survey Support \nStaff Management HHRR Assistant Algier´s Impresores S.A. de C.V. November 2010  –  December 2011  (1 year 2 months) El Salvador Organization Climate and Labor Environment Survey Support \nStaff Management Skills Communication Marketing Communications Human Resources Quality Assurance English Microsoft Office Brand Management Brand Awareness Publicity Public Speaking Public Relations Branding & Identity Teamwork Multi Tasking Publicidad en Internet Comunicaciones de... Gestión de marca Percepción de la marca Publicidad Relaciones públicas Advertising Inglés See 7+     See less Skills  Communication Marketing Communications Human Resources Quality Assurance English Microsoft Office Brand Management Brand Awareness Publicity Public Speaking Public Relations Branding & Identity Teamwork Multi Tasking Publicidad en Internet Comunicaciones de... Gestión de marca Percepción de la marca Publicidad Relaciones públicas Advertising Inglés See 7+     See less Communication Marketing Communications Human Resources Quality Assurance English Microsoft Office Brand Management Brand Awareness Publicity Public Speaking Public Relations Branding & Identity Teamwork Multi Tasking Publicidad en Internet Comunicaciones de... Gestión de marca Percepción de la marca Publicidad Relaciones públicas Advertising Inglés See 7+     See less Communication Marketing Communications Human Resources Quality Assurance English Microsoft Office Brand Management Brand Awareness Publicity Public Speaking Public Relations Branding & Identity Teamwork Multi Tasking Publicidad en Internet Comunicaciones de... Gestión de marca Percepción de la marca Publicidad Relaciones públicas Advertising Inglés See 7+     See less Education EAE Business School Master's degree,  Marketing/Marketing Management , General 2012  – 2013 Universidad Francisco Gavidia Licentiate degree,  Public Relations/Image Management 2006  – 2012 Universidad Francisco Gavidia Minor,  Human Management and Abilites Development 2011  – 2011 EAE Business School Master's degree,  Marketing/Marketing Management , General 2012  – 2013 EAE Business School Master's degree,  Marketing/Marketing Management , General 2012  – 2013 EAE Business School Master's degree,  Marketing/Marketing Management , General 2012  – 2013 Universidad Francisco Gavidia Licentiate degree,  Public Relations/Image Management 2006  – 2012 Universidad Francisco Gavidia Licentiate degree,  Public Relations/Image Management 2006  – 2012 Universidad Francisco Gavidia Licentiate degree,  Public Relations/Image Management 2006  – 2012 Universidad Francisco Gavidia Minor,  Human Management and Abilites Development 2011  – 2011 Universidad Francisco Gavidia Minor,  Human Management and Abilites Development 2011  – 2011 Universidad Francisco Gavidia Minor,  Human Management and Abilites Development 2011  – 2011 Honors & Awards Nuestras Estrellas El Diario de Hoy, El Salvador March 2005 Nomination for \"Nuestras Estrellas 2005\" Awards in category for \"Best youth radio show\".  Nuestras Estrellas El Diario de Hoy, El Salvador March 2005 Nomination for \"Nuestras Estrellas 2005\" Awards in category for \"Best youth radio show\".  Nuestras Estrellas El Diario de Hoy, El Salvador March 2005 Nomination for \"Nuestras Estrellas 2005\" Awards in category for \"Best youth radio show\".  Nuestras Estrellas El Diario de Hoy, El Salvador March 2005 Nomination for \"Nuestras Estrellas 2005\" Awards in category for \"Best youth radio show\".  ", "Summary Subject Matter Expert (Tier2) for a Google Android project. \n \nTech Savvy with an International Master in Marketing at EADA Business School and Bachelor of Business Administration at European University; fluently speaking Russian, English, Spanish , detail-oriented, organized and working well under pressure; with an experience of more than 2 years in on-line and off-line marketing departments. Summary Subject Matter Expert (Tier2) for a Google Android project. \n \nTech Savvy with an International Master in Marketing at EADA Business School and Bachelor of Business Administration at European University; fluently speaking Russian, English, Spanish , detail-oriented, organized and working well under pressure; with an experience of more than 2 years in on-line and off-line marketing departments. Subject Matter Expert (Tier2) for a Google Android project. \n \nTech Savvy with an International Master in Marketing at EADA Business School and Bachelor of Business Administration at European University; fluently speaking Russian, English, Spanish , detail-oriented, organized and working well under pressure; with an experience of more than 2 years in on-line and off-line marketing departments. Subject Matter Expert (Tier2) for a Google Android project. \n \nTech Savvy with an International Master in Marketing at EADA Business School and Bachelor of Business Administration at European University; fluently speaking Russian, English, Spanish , detail-oriented, organized and working well under pressure; with an experience of more than 2 years in on-line and off-line marketing departments. Experience Blogger & Creator kristinapoluyanova.wix.com/yourfoodguide September 2014  – Present (1 year) Madrid Area, Spain This blog is just a reflection of one of my passions- passion for food. \nIt exists in order to share my opinion about restaurants/cafes/bars visited and is divided into sections by cities where I've been living at some point of my life. More than an actual job it is just something i really love doing in my free time. \n-Content creation \n-Design \n-Simple HTML coding \n-Managing Social Media  \n-SEO \n \nhttp://kristinapoluyanova.wix.com/yourfoodguide Subject Matter Expert (Tier2) for Google Android SELLBYTEL Group Spain April 2015  – Present (5 months) Barcelona Area, Spain -Investigating & Solving complicated EMEA cases (60% Russian, 40% other EU countries) \n-Escalating cases to Tier 3 (Google Ireland) \n-Investigating emerging issues within the markets \n-Providing help and daily training to Tier 1 agents \n-Directly responsible for the team of 10 Tier 1 agents  \n-Working with Digital Content(apps, in-app content,google play music, books,newsstand, movies) Hardware (shipping, order management, warranty) Google Payments \n \n Russian /UK Technical Support Advisor for Google Android SELLBYTEL Group Spain January 2015  –  March 2015  (3 months) Barcelona Area, Spain Google Android project:  \n \n•Maintain client relationships through product support over the phone for GooglePlay (Apps,Movies, Music, Books, Newsstand, Devices: Chromecast & other Android OS devices ) & Hardware \n \n•Respond to incoming calls and emails from end users \n \n•Manage effectively all incoming incidents in a customer service environment  \n \n•Gather information from customers, troubleshoot technical issues, escalate bug reports \n \n Assistant Store Manager Marta Alcolea Joyas SL September 2014  –  November 2014  (3 months) Madrid Area, Spain Marta Alcolea is a jewelry store that specializes in buying & selling luxury items of 19-20 century. \n \nAs a store manager assistant I am responsible for: \n \n- Interaction with customers in Spanish & English \n- Stock control (Spanish) \n- Accounting & financial control (Spanish) \n- Store design (inside & outside)  \n- Interaction with employees & another store in Barcelona (Spanish) \n- Participation in auctions of the following auction houses: Christie's, Sotheby's, Alcala Subastas Website translator (freelancer) & administrative work Bonhill Group May 2014  –  June 2014  (2 months) barcelona area, spain • Bonhill group is the most exclusive buyer of jewelry, watches and diamonds \n• Translation of the website from Spanish into English & Russian : http://www.bonhillgroup.com  \n• Creation of Power Point presentations for distributors in english & spanish, editing word documents AdWords Campaign development as a part of Google Online Marketing Challenge 2014 Google April 2014  –  June 2014  (3 months) AdWords campaign development for Surfears.com as a part of Google Online Marketing Challenge 2014. (http://surfears.com/)  \n \nGoogle Online Marketing Challenge is a yearly global online marketing competition for students from higher education institutions around the world. Student teams develop and run a successful online advertising campaign using Google AdWords and Google+ for a real business or non-profit organization, using budget provided by Google. \n \nThe project is being done with 2 other team members from EADA business school Marketing Plan Developer Salads & Smoothies September 2013  –  June 2014  (10 months) Barcelona Area, Spain Marketing plan for a Swedish chain of Salad and Smoothies restaurants  \nAim: Expansion to Barcelona \nProject outline: \n-Internal Analysis of the company \n-External Analysis: Porter 5 forces, PESTEL \n-SWOT \n-Market Research: 36 in-depth interviews, 139 online surveys, 6 competitor observations \n-4P's (7 P's) \n-Sales Forecast \n-Financial Analysis : P&L analysis, Cash Flow, BEP, NPV, IRR, Ratios \n \nConducted within EADA business school Marketing manager assistant & Analyst СМП-М ООО July 2012  –  December 2013  (1 year 6 months) Moscow, Russian Federation Internship 1: Marketing department  \nInternship 2: Analytical department responsable for the market of construction materials in Russia \n \nAfter my internship I continue working for the company online. \n \nTasks completed: \n-Searching for suppliers & contacting them; negotiation of prices for raw materials required for different projects \n-Creating supplier database \n-Contacting clients  \n-Contribution to the marketing plan 2012 creation  \n-Benchmarking (analysis of the market of construction materials ; competition) \n-Simultaneous interpreter at the International Construction Fair, Moscow (Russian-English & English- Russian) \n \n \nResults:  \n1)Projects for open joint stock company \"Waterworks\" - Russia's largest water company, provider of high quality drinking water to 13 million people in Moscow \n \n2)10% savings on the purchase of construction materials as the result of my analysis of the market Facebook community manager Glamthings.com December 2012  –  October 2013  (11 months) Barcelona Area, Spain In charge of creating and updating daily posts for Glamthings.com Facebook page (http://www.facebook.com/GlamThings). \nWorking with such social media networks as : Hootsuite, Pintrest, Facebook, Twitter \nWriting and scheduling content with Hootsuite for the company SM profiles \n \nResults:During my work the target audience increased by at least 10% Blogger & Creator kristinapoluyanova.wix.com/yourfoodguide September 2014  – Present (1 year) Madrid Area, Spain This blog is just a reflection of one of my passions- passion for food. \nIt exists in order to share my opinion about restaurants/cafes/bars visited and is divided into sections by cities where I've been living at some point of my life. More than an actual job it is just something i really love doing in my free time. \n-Content creation \n-Design \n-Simple HTML coding \n-Managing Social Media  \n-SEO \n \nhttp://kristinapoluyanova.wix.com/yourfoodguide Blogger & Creator kristinapoluyanova.wix.com/yourfoodguide September 2014  – Present (1 year) Madrid Area, Spain This blog is just a reflection of one of my passions- passion for food. \nIt exists in order to share my opinion about restaurants/cafes/bars visited and is divided into sections by cities where I've been living at some point of my life. More than an actual job it is just something i really love doing in my free time. \n-Content creation \n-Design \n-Simple HTML coding \n-Managing Social Media  \n-SEO \n \nhttp://kristinapoluyanova.wix.com/yourfoodguide Subject Matter Expert (Tier2) for Google Android SELLBYTEL Group Spain April 2015  – Present (5 months) Barcelona Area, Spain -Investigating & Solving complicated EMEA cases (60% Russian, 40% other EU countries) \n-Escalating cases to Tier 3 (Google Ireland) \n-Investigating emerging issues within the markets \n-Providing help and daily training to Tier 1 agents \n-Directly responsible for the team of 10 Tier 1 agents  \n-Working with Digital Content(apps, in-app content,google play music, books,newsstand, movies) Hardware (shipping, order management, warranty) Google Payments \n \n Subject Matter Expert (Tier2) for Google Android SELLBYTEL Group Spain April 2015  – Present (5 months) Barcelona Area, Spain -Investigating & Solving complicated EMEA cases (60% Russian, 40% other EU countries) \n-Escalating cases to Tier 3 (Google Ireland) \n-Investigating emerging issues within the markets \n-Providing help and daily training to Tier 1 agents \n-Directly responsible for the team of 10 Tier 1 agents  \n-Working with Digital Content(apps, in-app content,google play music, books,newsstand, movies) Hardware (shipping, order management, warranty) Google Payments \n \n Russian /UK Technical Support Advisor for Google Android SELLBYTEL Group Spain January 2015  –  March 2015  (3 months) Barcelona Area, Spain Google Android project:  \n \n•Maintain client relationships through product support over the phone for GooglePlay (Apps,Movies, Music, Books, Newsstand, Devices: Chromecast & other Android OS devices ) & Hardware \n \n•Respond to incoming calls and emails from end users \n \n•Manage effectively all incoming incidents in a customer service environment  \n \n•Gather information from customers, troubleshoot technical issues, escalate bug reports \n \n Russian /UK Technical Support Advisor for Google Android SELLBYTEL Group Spain January 2015  –  March 2015  (3 months) Barcelona Area, Spain Google Android project:  \n \n•Maintain client relationships through product support over the phone for GooglePlay (Apps,Movies, Music, Books, Newsstand, Devices: Chromecast & other Android OS devices ) & Hardware \n \n•Respond to incoming calls and emails from end users \n \n•Manage effectively all incoming incidents in a customer service environment  \n \n•Gather information from customers, troubleshoot technical issues, escalate bug reports \n \n Assistant Store Manager Marta Alcolea Joyas SL September 2014  –  November 2014  (3 months) Madrid Area, Spain Marta Alcolea is a jewelry store that specializes in buying & selling luxury items of 19-20 century. \n \nAs a store manager assistant I am responsible for: \n \n- Interaction with customers in Spanish & English \n- Stock control (Spanish) \n- Accounting & financial control (Spanish) \n- Store design (inside & outside)  \n- Interaction with employees & another store in Barcelona (Spanish) \n- Participation in auctions of the following auction houses: Christie's, Sotheby's, Alcala Subastas Assistant Store Manager Marta Alcolea Joyas SL September 2014  –  November 2014  (3 months) Madrid Area, Spain Marta Alcolea is a jewelry store that specializes in buying & selling luxury items of 19-20 century. \n \nAs a store manager assistant I am responsible for: \n \n- Interaction with customers in Spanish & English \n- Stock control (Spanish) \n- Accounting & financial control (Spanish) \n- Store design (inside & outside)  \n- Interaction with employees & another store in Barcelona (Spanish) \n- Participation in auctions of the following auction houses: Christie's, Sotheby's, Alcala Subastas Website translator (freelancer) & administrative work Bonhill Group May 2014  –  June 2014  (2 months) barcelona area, spain • Bonhill group is the most exclusive buyer of jewelry, watches and diamonds \n• Translation of the website from Spanish into English & Russian : http://www.bonhillgroup.com  \n• Creation of Power Point presentations for distributors in english & spanish, editing word documents Website translator (freelancer) & administrative work Bonhill Group May 2014  –  June 2014  (2 months) barcelona area, spain • Bonhill group is the most exclusive buyer of jewelry, watches and diamonds \n• Translation of the website from Spanish into English & Russian : http://www.bonhillgroup.com  \n• Creation of Power Point presentations for distributors in english & spanish, editing word documents AdWords Campaign development as a part of Google Online Marketing Challenge 2014 Google April 2014  –  June 2014  (3 months) AdWords campaign development for Surfears.com as a part of Google Online Marketing Challenge 2014. (http://surfears.com/)  \n \nGoogle Online Marketing Challenge is a yearly global online marketing competition for students from higher education institutions around the world. Student teams develop and run a successful online advertising campaign using Google AdWords and Google+ for a real business or non-profit organization, using budget provided by Google. \n \nThe project is being done with 2 other team members from EADA business school AdWords Campaign development as a part of Google Online Marketing Challenge 2014 Google April 2014  –  June 2014  (3 months) AdWords campaign development for Surfears.com as a part of Google Online Marketing Challenge 2014. (http://surfears.com/)  \n \nGoogle Online Marketing Challenge is a yearly global online marketing competition for students from higher education institutions around the world. Student teams develop and run a successful online advertising campaign using Google AdWords and Google+ for a real business or non-profit organization, using budget provided by Google. \n \nThe project is being done with 2 other team members from EADA business school Marketing Plan Developer Salads & Smoothies September 2013  –  June 2014  (10 months) Barcelona Area, Spain Marketing plan for a Swedish chain of Salad and Smoothies restaurants  \nAim: Expansion to Barcelona \nProject outline: \n-Internal Analysis of the company \n-External Analysis: Porter 5 forces, PESTEL \n-SWOT \n-Market Research: 36 in-depth interviews, 139 online surveys, 6 competitor observations \n-4P's (7 P's) \n-Sales Forecast \n-Financial Analysis : P&L analysis, Cash Flow, BEP, NPV, IRR, Ratios \n \nConducted within EADA business school Marketing Plan Developer Salads & Smoothies September 2013  –  June 2014  (10 months) Barcelona Area, Spain Marketing plan for a Swedish chain of Salad and Smoothies restaurants  \nAim: Expansion to Barcelona \nProject outline: \n-Internal Analysis of the company \n-External Analysis: Porter 5 forces, PESTEL \n-SWOT \n-Market Research: 36 in-depth interviews, 139 online surveys, 6 competitor observations \n-4P's (7 P's) \n-Sales Forecast \n-Financial Analysis : P&L analysis, Cash Flow, BEP, NPV, IRR, Ratios \n \nConducted within EADA business school Marketing manager assistant & Analyst СМП-М ООО July 2012  –  December 2013  (1 year 6 months) Moscow, Russian Federation Internship 1: Marketing department  \nInternship 2: Analytical department responsable for the market of construction materials in Russia \n \nAfter my internship I continue working for the company online. \n \nTasks completed: \n-Searching for suppliers & contacting them; negotiation of prices for raw materials required for different projects \n-Creating supplier database \n-Contacting clients  \n-Contribution to the marketing plan 2012 creation  \n-Benchmarking (analysis of the market of construction materials ; competition) \n-Simultaneous interpreter at the International Construction Fair, Moscow (Russian-English & English- Russian) \n \n \nResults:  \n1)Projects for open joint stock company \"Waterworks\" - Russia's largest water company, provider of high quality drinking water to 13 million people in Moscow \n \n2)10% savings on the purchase of construction materials as the result of my analysis of the market Marketing manager assistant & Analyst СМП-М ООО July 2012  –  December 2013  (1 year 6 months) Moscow, Russian Federation Internship 1: Marketing department  \nInternship 2: Analytical department responsable for the market of construction materials in Russia \n \nAfter my internship I continue working for the company online. \n \nTasks completed: \n-Searching for suppliers & contacting them; negotiation of prices for raw materials required for different projects \n-Creating supplier database \n-Contacting clients  \n-Contribution to the marketing plan 2012 creation  \n-Benchmarking (analysis of the market of construction materials ; competition) \n-Simultaneous interpreter at the International Construction Fair, Moscow (Russian-English & English- Russian) \n \n \nResults:  \n1)Projects for open joint stock company \"Waterworks\" - Russia's largest water company, provider of high quality drinking water to 13 million people in Moscow \n \n2)10% savings on the purchase of construction materials as the result of my analysis of the market Facebook community manager Glamthings.com December 2012  –  October 2013  (11 months) Barcelona Area, Spain In charge of creating and updating daily posts for Glamthings.com Facebook page (http://www.facebook.com/GlamThings). \nWorking with such social media networks as : Hootsuite, Pintrest, Facebook, Twitter \nWriting and scheduling content with Hootsuite for the company SM profiles \n \nResults:During my work the target audience increased by at least 10% Facebook community manager Glamthings.com December 2012  –  October 2013  (11 months) Barcelona Area, Spain In charge of creating and updating daily posts for Glamthings.com Facebook page (http://www.facebook.com/GlamThings). \nWorking with such social media networks as : Hootsuite, Pintrest, Facebook, Twitter \nWriting and scheduling content with Hootsuite for the company SM profiles \n \nResults:During my work the target audience increased by at least 10% Languages English Native or bilingual proficiency Russian Native or bilingual proficiency Spanish Professional working proficiency German Limited working proficiency English Native or bilingual proficiency Russian Native or bilingual proficiency Spanish Professional working proficiency German Limited working proficiency English Native or bilingual proficiency Russian Native or bilingual proficiency Spanish Professional working proficiency German Limited working proficiency Native or bilingual proficiency Native or bilingual proficiency Professional working proficiency Limited working proficiency Skills Marketing Social Media Facebook English Spanish Communication Skills Public Speaking Russian Multi-Cultural Team... Social Media Marketing Leadership Time Management Public Relations Microsoft Office Teamwork Online Marketing Marketing Communications PowerPoint Creativity Facebook Fan Page... Event Planning Analytical Skills Data Analysis Hootsuite Negotiation Designs Highly detail oriented Highly responsible HootSuite Communication Team Leadership Marketing Strategy Team Building See 18+     See less Skills  Marketing Social Media Facebook English Spanish Communication Skills Public Speaking Russian Multi-Cultural Team... Social Media Marketing Leadership Time Management Public Relations Microsoft Office Teamwork Online Marketing Marketing Communications PowerPoint Creativity Facebook Fan Page... Event Planning Analytical Skills Data Analysis Hootsuite Negotiation Designs Highly detail oriented Highly responsible HootSuite Communication Team Leadership Marketing Strategy Team Building See 18+     See less Marketing Social Media Facebook English Spanish Communication Skills Public Speaking Russian Multi-Cultural Team... Social Media Marketing Leadership Time Management Public Relations Microsoft Office Teamwork Online Marketing Marketing Communications PowerPoint Creativity Facebook Fan Page... Event Planning Analytical Skills Data Analysis Hootsuite Negotiation Designs Highly detail oriented Highly responsible HootSuite Communication Team Leadership Marketing Strategy Team Building See 18+     See less Marketing Social Media Facebook English Spanish Communication Skills Public Speaking Russian Multi-Cultural Team... Social Media Marketing Leadership Time Management Public Relations Microsoft Office Teamwork Online Marketing Marketing Communications PowerPoint Creativity Facebook Fan Page... Event Planning Analytical Skills Data Analysis Hootsuite Negotiation Designs Highly detail oriented Highly responsible HootSuite Communication Team Leadership Marketing Strategy Team Building See 18+     See less Education EADA - Escuela de Alta Dirección y Administración Masters in International Marketing,  International Marketing 2013  – 2014 EADA Business School is an international business school located in Barcelona. \nEADA holds 25th place on the ranking published by the Financial Times in 2013. \nEADA study method is based on Harvard Business Case Approach Activities and Societies:  Cources: Branding ,  Strategic Marketing ,  Market Research ,  Sustainability Marketing ,  Analytical Marketing ,  Marketing Plan ,  Supply Chain Management ,  Distribution ,  Product Policy ,  Pricing ,  Customer Experience Management ,  Creativity and Design in Innovation and Strategy ,  SEO ,  SEM European University Barcelona Bachelor of Business Administration (B.B.A.),  Finance ,  marketing , accounting,  management ,  economics , GPA 3.6 2010  – 2013 As a social activity representative I was assigned to do the following : \n- organize Christmas dinner, Welcome drinks, cultural events \n- communicate with managers and directors of restaurants/bars/clubs/museums \n- develop communication between students from different years in EU \n- create PPT about the work done Activities and Societies:  Student Board: Social Activity representative EADA - Escuela de Alta Dirección y Administración Masters in International Marketing,  International Marketing 2013  – 2014 EADA Business School is an international business school located in Barcelona. \nEADA holds 25th place on the ranking published by the Financial Times in 2013. \nEADA study method is based on Harvard Business Case Approach Activities and Societies:  Cources: Branding ,  Strategic Marketing ,  Market Research ,  Sustainability Marketing ,  Analytical Marketing ,  Marketing Plan ,  Supply Chain Management ,  Distribution ,  Product Policy ,  Pricing ,  Customer Experience Management ,  Creativity and Design in Innovation and Strategy ,  SEO ,  SEM EADA - Escuela de Alta Dirección y Administración Masters in International Marketing,  International Marketing 2013  – 2014 EADA Business School is an international business school located in Barcelona. \nEADA holds 25th place on the ranking published by the Financial Times in 2013. \nEADA study method is based on Harvard Business Case Approach Activities and Societies:  Cources: Branding ,  Strategic Marketing ,  Market Research ,  Sustainability Marketing ,  Analytical Marketing ,  Marketing Plan ,  Supply Chain Management ,  Distribution ,  Product Policy ,  Pricing ,  Customer Experience Management ,  Creativity and Design in Innovation and Strategy ,  SEO ,  SEM EADA - Escuela de Alta Dirección y Administración Masters in International Marketing,  International Marketing 2013  – 2014 EADA Business School is an international business school located in Barcelona. \nEADA holds 25th place on the ranking published by the Financial Times in 2013. \nEADA study method is based on Harvard Business Case Approach Activities and Societies:  Cources: Branding ,  Strategic Marketing ,  Market Research ,  Sustainability Marketing ,  Analytical Marketing ,  Marketing Plan ,  Supply Chain Management ,  Distribution ,  Product Policy ,  Pricing ,  Customer Experience Management ,  Creativity and Design in Innovation and Strategy ,  SEO ,  SEM European University Barcelona Bachelor of Business Administration (B.B.A.),  Finance ,  marketing , accounting,  management ,  economics , GPA 3.6 2010  – 2013 As a social activity representative I was assigned to do the following : \n- organize Christmas dinner, Welcome drinks, cultural events \n- communicate with managers and directors of restaurants/bars/clubs/museums \n- develop communication between students from different years in EU \n- create PPT about the work done Activities and Societies:  Student Board: Social Activity representative European University Barcelona Bachelor of Business Administration (B.B.A.),  Finance ,  marketing , accounting,  management ,  economics , GPA 3.6 2010  – 2013 As a social activity representative I was assigned to do the following : \n- organize Christmas dinner, Welcome drinks, cultural events \n- communicate with managers and directors of restaurants/bars/clubs/museums \n- develop communication between students from different years in EU \n- create PPT about the work done Activities and Societies:  Student Board: Social Activity representative European University Barcelona Bachelor of Business Administration (B.B.A.),  Finance ,  marketing , accounting,  management ,  economics , GPA 3.6 2010  – 2013 As a social activity representative I was assigned to do the following : \n- organize Christmas dinner, Welcome drinks, cultural events \n- communicate with managers and directors of restaurants/bars/clubs/museums \n- develop communication between students from different years in EU \n- create PPT about the work done Activities and Societies:  Student Board: Social Activity representative Honors & Awards Magna Cum Laude President of European University Dr.Dirk Craen June 2013 3.6 GPA (out of 4) Prince Fellow Award President of European University Dr.Dirk Craen June 2013 In appreciation of my commitment and dedication to the EU Barcelona Student Board and my involvement at the university. Magna Cum Laude President of European University Dr.Dirk Craen June 2013 3.6 GPA (out of 4) Magna Cum Laude President of European University Dr.Dirk Craen June 2013 3.6 GPA (out of 4) Magna Cum Laude President of European University Dr.Dirk Craen June 2013 3.6 GPA (out of 4) Prince Fellow Award President of European University Dr.Dirk Craen June 2013 In appreciation of my commitment and dedication to the EU Barcelona Student Board and my involvement at the university. Prince Fellow Award President of European University Dr.Dirk Craen June 2013 In appreciation of my commitment and dedication to the EU Barcelona Student Board and my involvement at the university. Prince Fellow Award President of European University Dr.Dirk Craen June 2013 In appreciation of my commitment and dedication to the EU Barcelona Student Board and my involvement at the university. "]}