{"position": "Administrative Support", "company": "Intel Corporation", "profiles": ["Experience Administrative and operation management Northwest Monuments (formally Rock and Wood Engraving) January 2010  – Present (5 years 8 months) Engraving of materials such as granite, rocks, wood, bricks, glass. Forklift operator, warehouse cleanliness and organization, equipment maintenance, product installation, shipping and receiving, customer relations, business planning and forecasting. Volunteer - Event/Project support, Building/Lawn maintenance Support, Media/Tech Support Evergreen Christian Center May 2011  –  November 2011  (7 months) Hillsboro, OR VOLUNTEER support to: \nOffice administrative tasks, grounds maintenance, small equipment & building maintenance, youth ministries, camp counselor, program design, set-up for special events, senior lunches, men’s breakfast, media/sound, team leader for Alpha (course on fundamentals of Christianity), script editing and backstage production for dramas, community outreach Volunteer - Library Steward Hillsboro Library May 2009  –  July 2009  (3 months) Organizing books and supplies in public area. Keeping the public area neat and presentable. Help and directing guests with questions. Department-Wide Sr Administrative Support Intel Corporation December 2007  –  January 2009  (1 year 2 months) Provided administrative support for manager, department and group leaders. Performed calendar scheduling for manager, department, and admin meetings/projects. Ordered office supplies, performed timecard data and headcount reporting, booked travel arrangements and conference registration, compiled data into travel packet(s), arranged office moves, provided logistical support for meetings (room booking, bridge, net meeting, room set-up, etc.), carried out mail sorting and delivery, arranged catering, covered for previous job position and for the positions of other departmental admins (vacation, sick time, leave of absence, projects). Projects & Events Administrative Support Intel Corporation January 2000  –  December 2007  (8 years) Provided logistical support for the execution of projects, events, and site visits. Managed factory access program gated according to safety training and security requirements. Managed and participated in creation of recognition programs at multiple levels from group/department, to enterprise-wide. Provided logistical support (calendaring, communication, room booking, telephone bridges, room set-up, catering) to quarterly corporate business meetings and departmental/project meetings. Reviewed and published campus communications, policies and procedures via email, web posting, and print. Trained new hires and peers, participated in safety projects and teams. On-site Customer Service Rep Xerox Corporation May 1998  –  January 2000  (1 year 9 months) Xerox Business Solutions (XBS)  \nProvided on-site customer service, at Intel Corporation, for printing needs and maintenance for copiers, fax machines and mail/courier delivery. Assisted print center to process customer print jobs. Print-Shop/Mailroom Clerk Competitive Media Reporting (VMU Marketing) July 1995  –  March 1998  (2 years 9 months) Printed, bound, finished, and shipped marketing books to customers \nPerformed inventory and organization of the warehouse that contained all the company’s publications for the prior decade, thereby streamlining reorders and historical searches. Administrative and operation management Northwest Monuments (formally Rock and Wood Engraving) January 2010  – Present (5 years 8 months) Engraving of materials such as granite, rocks, wood, bricks, glass. Forklift operator, warehouse cleanliness and organization, equipment maintenance, product installation, shipping and receiving, customer relations, business planning and forecasting. Administrative and operation management Northwest Monuments (formally Rock and Wood Engraving) January 2010  – Present (5 years 8 months) Engraving of materials such as granite, rocks, wood, bricks, glass. Forklift operator, warehouse cleanliness and organization, equipment maintenance, product installation, shipping and receiving, customer relations, business planning and forecasting. Volunteer - Event/Project support, Building/Lawn maintenance Support, Media/Tech Support Evergreen Christian Center May 2011  –  November 2011  (7 months) Hillsboro, OR VOLUNTEER support to: \nOffice administrative tasks, grounds maintenance, small equipment & building maintenance, youth ministries, camp counselor, program design, set-up for special events, senior lunches, men’s breakfast, media/sound, team leader for Alpha (course on fundamentals of Christianity), script editing and backstage production for dramas, community outreach Volunteer - Event/Project support, Building/Lawn maintenance Support, Media/Tech Support Evergreen Christian Center May 2011  –  November 2011  (7 months) Hillsboro, OR VOLUNTEER support to: \nOffice administrative tasks, grounds maintenance, small equipment & building maintenance, youth ministries, camp counselor, program design, set-up for special events, senior lunches, men’s breakfast, media/sound, team leader for Alpha (course on fundamentals of Christianity), script editing and backstage production for dramas, community outreach Volunteer - Library Steward Hillsboro Library May 2009  –  July 2009  (3 months) Organizing books and supplies in public area. Keeping the public area neat and presentable. Help and directing guests with questions. Volunteer - Library Steward Hillsboro Library May 2009  –  July 2009  (3 months) Organizing books and supplies in public area. Keeping the public area neat and presentable. Help and directing guests with questions. Department-Wide Sr Administrative Support Intel Corporation December 2007  –  January 2009  (1 year 2 months) Provided administrative support for manager, department and group leaders. Performed calendar scheduling for manager, department, and admin meetings/projects. Ordered office supplies, performed timecard data and headcount reporting, booked travel arrangements and conference registration, compiled data into travel packet(s), arranged office moves, provided logistical support for meetings (room booking, bridge, net meeting, room set-up, etc.), carried out mail sorting and delivery, arranged catering, covered for previous job position and for the positions of other departmental admins (vacation, sick time, leave of absence, projects). Department-Wide Sr Administrative Support Intel Corporation December 2007  –  January 2009  (1 year 2 months) Provided administrative support for manager, department and group leaders. Performed calendar scheduling for manager, department, and admin meetings/projects. Ordered office supplies, performed timecard data and headcount reporting, booked travel arrangements and conference registration, compiled data into travel packet(s), arranged office moves, provided logistical support for meetings (room booking, bridge, net meeting, room set-up, etc.), carried out mail sorting and delivery, arranged catering, covered for previous job position and for the positions of other departmental admins (vacation, sick time, leave of absence, projects). Projects & Events Administrative Support Intel Corporation January 2000  –  December 2007  (8 years) Provided logistical support for the execution of projects, events, and site visits. Managed factory access program gated according to safety training and security requirements. Managed and participated in creation of recognition programs at multiple levels from group/department, to enterprise-wide. Provided logistical support (calendaring, communication, room booking, telephone bridges, room set-up, catering) to quarterly corporate business meetings and departmental/project meetings. Reviewed and published campus communications, policies and procedures via email, web posting, and print. Trained new hires and peers, participated in safety projects and teams. Projects & Events Administrative Support Intel Corporation January 2000  –  December 2007  (8 years) Provided logistical support for the execution of projects, events, and site visits. Managed factory access program gated according to safety training and security requirements. Managed and participated in creation of recognition programs at multiple levels from group/department, to enterprise-wide. Provided logistical support (calendaring, communication, room booking, telephone bridges, room set-up, catering) to quarterly corporate business meetings and departmental/project meetings. Reviewed and published campus communications, policies and procedures via email, web posting, and print. Trained new hires and peers, participated in safety projects and teams. On-site Customer Service Rep Xerox Corporation May 1998  –  January 2000  (1 year 9 months) Xerox Business Solutions (XBS)  \nProvided on-site customer service, at Intel Corporation, for printing needs and maintenance for copiers, fax machines and mail/courier delivery. Assisted print center to process customer print jobs. On-site Customer Service Rep Xerox Corporation May 1998  –  January 2000  (1 year 9 months) Xerox Business Solutions (XBS)  \nProvided on-site customer service, at Intel Corporation, for printing needs and maintenance for copiers, fax machines and mail/courier delivery. Assisted print center to process customer print jobs. Print-Shop/Mailroom Clerk Competitive Media Reporting (VMU Marketing) July 1995  –  March 1998  (2 years 9 months) Printed, bound, finished, and shipped marketing books to customers \nPerformed inventory and organization of the warehouse that contained all the company’s publications for the prior decade, thereby streamlining reorders and historical searches. Print-Shop/Mailroom Clerk Competitive Media Reporting (VMU Marketing) July 1995  –  March 1998  (2 years 9 months) Printed, bound, finished, and shipped marketing books to customers \nPerformed inventory and organization of the warehouse that contained all the company’s publications for the prior decade, thereby streamlining reorders and historical searches. Skills Program Management Semiconductors Management Project Management Event Planning Process Improvement JMP Leadership Customer Service Training Shrinkage Strategic Planning Budgets Marketing Access Administrative... Analysis Cross-functional Team... Customer Satisfaction Event Management Microsoft Office Policy Team Leadership Time Management Community Outreach Microsoft Excel Team Building See 12+     See less Skills  Program Management Semiconductors Management Project Management Event Planning Process Improvement JMP Leadership Customer Service Training Shrinkage Strategic Planning Budgets Marketing Access Administrative... Analysis Cross-functional Team... Customer Satisfaction Event Management Microsoft Office Policy Team Leadership Time Management Community Outreach Microsoft Excel Team Building See 12+     See less Program Management Semiconductors Management Project Management Event Planning Process Improvement JMP Leadership Customer Service Training Shrinkage Strategic Planning Budgets Marketing Access Administrative... Analysis Cross-functional Team... Customer Satisfaction Event Management Microsoft Office Policy Team Leadership Time Management Community Outreach Microsoft Excel Team Building See 12+     See less Program Management Semiconductors Management Project Management Event Planning Process Improvement JMP Leadership Customer Service Training Shrinkage Strategic Planning Budgets Marketing Access Administrative... Analysis Cross-functional Team... Customer Satisfaction Event Management Microsoft Office Policy Team Leadership Time Management Community Outreach Microsoft Excel Team Building See 12+     See less ", "Summary Extremely driven Executive Assistant with over 15 years of executive management and office organization. Extensive experience managing customer meetings for CES, IDF, MWC conferences, all hands meetings, and team building/moral boosting events. Process visas, passports and invitation letters for international travel. Travel with executive team as needed. \n \nTechnical Skills include: Advanced in Microsoft Office including Outlook, Word, Excel, PowerPoint, Lync/Skype and SharePoint. Expertise in SAP, Concur and American Express/Ultramar Travel tools Summary Extremely driven Executive Assistant with over 15 years of executive management and office organization. Extensive experience managing customer meetings for CES, IDF, MWC conferences, all hands meetings, and team building/moral boosting events. Process visas, passports and invitation letters for international travel. Travel with executive team as needed. \n \nTechnical Skills include: Advanced in Microsoft Office including Outlook, Word, Excel, PowerPoint, Lync/Skype and SharePoint. Expertise in SAP, Concur and American Express/Ultramar Travel tools Extremely driven Executive Assistant with over 15 years of executive management and office organization. Extensive experience managing customer meetings for CES, IDF, MWC conferences, all hands meetings, and team building/moral boosting events. Process visas, passports and invitation letters for international travel. Travel with executive team as needed. \n \nTechnical Skills include: Advanced in Microsoft Office including Outlook, Word, Excel, PowerPoint, Lync/Skype and SharePoint. Expertise in SAP, Concur and American Express/Ultramar Travel tools Extremely driven Executive Assistant with over 15 years of executive management and office organization. Extensive experience managing customer meetings for CES, IDF, MWC conferences, all hands meetings, and team building/moral boosting events. Process visas, passports and invitation letters for international travel. Travel with executive team as needed. \n \nTechnical Skills include: Advanced in Microsoft Office including Outlook, Word, Excel, PowerPoint, Lync/Skype and SharePoint. Expertise in SAP, Concur and American Express/Ultramar Travel tools Languages English English English Skills Calendars Administrative... Office Management Outlook PeopleSoft Event Planning Contract Negotiation Process Scheduler Management Office Administration Purchasing Lotus Notes Microsoft Excel Administration Event Management SharePoint Project Management Leadership Expenses PowerPoint Administrative... Customer Service Meeting Planning Hospitality Microsoft Office Trade Shows Corporate Events See 12+     See less Skills  Calendars Administrative... Office Management Outlook PeopleSoft Event Planning Contract Negotiation Process Scheduler Management Office Administration Purchasing Lotus Notes Microsoft Excel Administration Event Management SharePoint Project Management Leadership Expenses PowerPoint Administrative... Customer Service Meeting Planning Hospitality Microsoft Office Trade Shows Corporate Events See 12+     See less Calendars Administrative... Office Management Outlook PeopleSoft Event Planning Contract Negotiation Process Scheduler Management Office Administration Purchasing Lotus Notes Microsoft Excel Administration Event Management SharePoint Project Management Leadership Expenses PowerPoint Administrative... Customer Service Meeting Planning Hospitality Microsoft Office Trade Shows Corporate Events See 12+     See less Calendars Administrative... Office Management Outlook PeopleSoft Event Planning Contract Negotiation Process Scheduler Management Office Administration Purchasing Lotus Notes Microsoft Excel Administration Event Management SharePoint Project Management Leadership Expenses PowerPoint Administrative... Customer Service Meeting Planning Hospitality Microsoft Office Trade Shows Corporate Events See 12+     See less ", "Skills Certified for I-9... Project Management SharePoint Outlook Skills  Certified for I-9... Project Management SharePoint Outlook Certified for I-9... Project Management SharePoint Outlook Certified for I-9... Project Management SharePoint Outlook ", "Experience Administrative Support Intel Corporation August 1991  – Present (24 years 1 month) Chandler, Arizona Admin Support Intel Corporation 2009  –  2012  (3 years) Telecom Administrative Analyst Intel Corporation August 2010  –  April 2011  (9 months) Chandler, Arizona Administrative Support Intel Corporation August 1991  – Present (24 years 1 month) Chandler, Arizona Administrative Support Intel Corporation August 1991  – Present (24 years 1 month) Chandler, Arizona Admin Support Intel Corporation 2009  –  2012  (3 years) Admin Support Intel Corporation 2009  –  2012  (3 years) Telecom Administrative Analyst Intel Corporation August 2010  –  April 2011  (9 months) Chandler, Arizona Telecom Administrative Analyst Intel Corporation August 2010  –  April 2011  (9 months) Chandler, Arizona Skills Cross-functional Team... Process Improvement Project Management Team Leadership Business Analysis Project Planning Product Management SharePoint Program Management Customer Service Vendor Management Business Process... Leadership Software Development Microsoft Office Analysis Management Testing See 3+     See less Skills  Cross-functional Team... Process Improvement Project Management Team Leadership Business Analysis Project Planning Product Management SharePoint Program Management Customer Service Vendor Management Business Process... Leadership Software Development Microsoft Office Analysis Management Testing See 3+     See less Cross-functional Team... Process Improvement Project Management Team Leadership Business Analysis Project Planning Product Management SharePoint Program Management Customer Service Vendor Management Business Process... Leadership Software Development Microsoft Office Analysis Management Testing See 3+     See less Cross-functional Team... Process Improvement Project Management Team Leadership Business Analysis Project Planning Product Management SharePoint Program Management Customer Service Vendor Management Business Process... Leadership Software Development Microsoft Office Analysis Management Testing See 3+     See less ", "Skills Semiconductors Venture Capital Administrative... Skills  Semiconductors Venture Capital Administrative... Semiconductors Venture Capital Administrative... Semiconductors Venture Capital Administrative... ", "Experience Marketing Specialist & Administrative Support Intel Corporation Marketing Specialist & Administrative Support Intel Corporation Marketing Specialist & Administrative Support Intel Corporation ", "Experience Administrative Support Intel Corporation Administrative Support Intel Corporation Administrative Support Intel Corporation ", "Summary Specialties: Bachelor’s Degree in Sociology… Senior -Executive Administration Support … Excellent Communication Skills… Detailed Project Coordination… Results Oriented… Prominent Self-Starter..Inteterview Coordination Summary Specialties: Bachelor’s Degree in Sociology… Senior -Executive Administration Support … Excellent Communication Skills… Detailed Project Coordination… Results Oriented… Prominent Self-Starter..Inteterview Coordination Specialties: Bachelor’s Degree in Sociology… Senior -Executive Administration Support … Excellent Communication Skills… Detailed Project Coordination… Results Oriented… Prominent Self-Starter..Inteterview Coordination Specialties: Bachelor’s Degree in Sociology… Senior -Executive Administration Support … Excellent Communication Skills… Detailed Project Coordination… Results Oriented… Prominent Self-Starter..Inteterview Coordination Experience Operations/Project Manager BMG Venture Partners, LLC March 2011  – Present (4 years 6 months) Manage and oversee the daily operations of the housing communities. This includes management of the leasing office, maintenance, grounds and housekeeping staff. Maintain compliance with established fair housing policies and the HOA’s. Responsible for analyzing, developing and implementing marketing plans. Assist as appropriate in the overall management of the property; includes day-to-day operations, fiscal management and administration. Manage and oversee with minimal supervision to property policies and procedures pertaining to the HOA. Sr. Administrative Support/Interview Coordinator Intel Corporation July 2010  –  February 2011  (8 months) As the executive administrator to two Directors and one hiring manager (Director of Digital Home Group - Software Group, Director of Marketing, and HR), my responsibilities included providing administration support to the directors and the software, marketing and HR teams (25). Primary responsibilities included scheduling interviews for the open requisitions, managing the department's office space logistics, mail distribution, and office supply provisioning. Assisted with scheduling team meetings, travel logistics and meeting preparations for the directors. Responsibilities also included assisting in scheduling and preparing for group quarterlies. I was responsible for managing \"First Day of Office\" cube configuration including setup of PC/Laptop, network and phone support, as well as managing \"Last Day of Office\" cube closeout. Also responsible for small and medium technical office projects for demonstration of team products. Dealing with external custumers such as Sony and Cox Cable to help the HPG product be successful. Administrative Support Intel Corporation October 2008  –  October 2009  (1 year 1 month) As the administrator to four division managers, my responsibilities included providing administrative support for all 400+ Fab 68 employees located in Arizona. I was primarily responsible for the division manager's scheduling, coordination and facilitation of department meetings, preparing presentations, and department purchasing. I was also responsible for managing user SharePoint access, as well as assisting with their training and site configuration. I was responsible for assimilating new hires, including managing FDO cube configuration, and when employees were transferring / leaving Intel, I managed their LDO cube closeout. Property Manager M & T Properties March 2002  –  October 2008  (6 years 8 months) Phoenix, Arizona Area Manage and oversee the daily operations of the housing communities. This includes management of the leasing office, maintenance, grounds and housekeeping staff.  Maintain compliance with established fair housing policies and the HOA’s. Responsible for analyzing, developing and implementing marketing plans. Assist as appropriate in the overall management of the property; includes day-to-day operations, fiscal management and administration. Manage and oversee with some supervision property policies and procedures pertaining to the HOA. Senior Executive Administrative Support - Advance Imaging Team Intel Corporation December 2000  –  March 2002  (1 year 4 months) As the senior administrator to the department manager my responsibilities included providing administrative support for 30 engineers and product managers in the Advanced Imaging Team. I was primarily responsible for the department manager's scheduling, coordination of department meetings, presentation preparation, file share administration, and department purchasing. I also managed the department's office space logistics, mail distribution, documentation for weekly staff meetings and office supply provisioning. As a leader of the AIT recreation committee, I was responsible for driving the successful planning of team-building events. I managed the staffing process for AIT including: contacting candidates and coordinating interviews, utilizing staff web tools for opening/closing requisitions, assimilating new hires and maintaining & tracking staffing data. I was responsible for creating and updating web content for the department website, which required coordinating with content owners for timely updates. Executive Administrative Support- Intel Corporation Home Products Group September 1999  –  December 2000  (1 year 4 months) were to maintain the division manager's calendar responsible for over 70 people, which included managing the logistics and agenda for his weekly staff, group and 1:1 meetings. I facilitated theTeam Leads and Program Manager's staff meetings, and various product-related meetings. I coordinated \nrequired-training classes, which included managing the logistics with attendees from other sites, working with site scheduling for locations, materials readiness, and rescheduling attendees as needed. I managed \nthe staffing process which included contacting candidates and coordinating interviews, utilizing staffing \nweb tools for opening/closing requisitions, assimilating new hires prior to & upon arrival to Intel, and maintain & tracked staffing data. Day-to-day activities also included department purchasing, coordinating travel arrangements, and ensuring timely communications to all staff members. I assumed the web master responsibilities for the Arizona HBS website utilizing FrontPage for updates. This required me to \nmaintain content and coordinate ongoing changes with the corporate HBS web master. I assumed a lead role in the Arizona HPG Activities Committee, which included organizing and coordinating group events for the 70 employees within HPG. Senior Worldwide Meeting Coordinator Rosenbluth International March 1997  –  September 1999  (2 years 7 months) Responsibilities were to manage project details for meetings held worldwide for Intel. The role required a \nhighly organized team player with excellent communication skills. It also required collaboration with a \ndiverse collection of Intel employee's and Intel suppliers both domestically and internationally. Position \nrequired working unsupervised in a fast paced environment to understand and communicate business meeting requirements. Details include negotiating the rates of air and ground transportation as well as hotel accommodations including technical for meeting rooms. The position also required me to stay current on the latest technologies to effectively complete transportation arrangements. I was responsible for mentoring department associates and for training of employees on process & procedures. Operations/Project Manager BMG Venture Partners, LLC March 2011  – Present (4 years 6 months) Manage and oversee the daily operations of the housing communities. This includes management of the leasing office, maintenance, grounds and housekeeping staff. Maintain compliance with established fair housing policies and the HOA’s. Responsible for analyzing, developing and implementing marketing plans. Assist as appropriate in the overall management of the property; includes day-to-day operations, fiscal management and administration. Manage and oversee with minimal supervision to property policies and procedures pertaining to the HOA. Operations/Project Manager BMG Venture Partners, LLC March 2011  – Present (4 years 6 months) Manage and oversee the daily operations of the housing communities. This includes management of the leasing office, maintenance, grounds and housekeeping staff. Maintain compliance with established fair housing policies and the HOA’s. Responsible for analyzing, developing and implementing marketing plans. Assist as appropriate in the overall management of the property; includes day-to-day operations, fiscal management and administration. Manage and oversee with minimal supervision to property policies and procedures pertaining to the HOA. Sr. Administrative Support/Interview Coordinator Intel Corporation July 2010  –  February 2011  (8 months) As the executive administrator to two Directors and one hiring manager (Director of Digital Home Group - Software Group, Director of Marketing, and HR), my responsibilities included providing administration support to the directors and the software, marketing and HR teams (25). Primary responsibilities included scheduling interviews for the open requisitions, managing the department's office space logistics, mail distribution, and office supply provisioning. Assisted with scheduling team meetings, travel logistics and meeting preparations for the directors. Responsibilities also included assisting in scheduling and preparing for group quarterlies. I was responsible for managing \"First Day of Office\" cube configuration including setup of PC/Laptop, network and phone support, as well as managing \"Last Day of Office\" cube closeout. Also responsible for small and medium technical office projects for demonstration of team products. Dealing with external custumers such as Sony and Cox Cable to help the HPG product be successful. Sr. Administrative Support/Interview Coordinator Intel Corporation July 2010  –  February 2011  (8 months) As the executive administrator to two Directors and one hiring manager (Director of Digital Home Group - Software Group, Director of Marketing, and HR), my responsibilities included providing administration support to the directors and the software, marketing and HR teams (25). Primary responsibilities included scheduling interviews for the open requisitions, managing the department's office space logistics, mail distribution, and office supply provisioning. Assisted with scheduling team meetings, travel logistics and meeting preparations for the directors. Responsibilities also included assisting in scheduling and preparing for group quarterlies. I was responsible for managing \"First Day of Office\" cube configuration including setup of PC/Laptop, network and phone support, as well as managing \"Last Day of Office\" cube closeout. Also responsible for small and medium technical office projects for demonstration of team products. Dealing with external custumers such as Sony and Cox Cable to help the HPG product be successful. Administrative Support Intel Corporation October 2008  –  October 2009  (1 year 1 month) As the administrator to four division managers, my responsibilities included providing administrative support for all 400+ Fab 68 employees located in Arizona. I was primarily responsible for the division manager's scheduling, coordination and facilitation of department meetings, preparing presentations, and department purchasing. I was also responsible for managing user SharePoint access, as well as assisting with their training and site configuration. I was responsible for assimilating new hires, including managing FDO cube configuration, and when employees were transferring / leaving Intel, I managed their LDO cube closeout. Administrative Support Intel Corporation October 2008  –  October 2009  (1 year 1 month) As the administrator to four division managers, my responsibilities included providing administrative support for all 400+ Fab 68 employees located in Arizona. I was primarily responsible for the division manager's scheduling, coordination and facilitation of department meetings, preparing presentations, and department purchasing. I was also responsible for managing user SharePoint access, as well as assisting with their training and site configuration. I was responsible for assimilating new hires, including managing FDO cube configuration, and when employees were transferring / leaving Intel, I managed their LDO cube closeout. Property Manager M & T Properties March 2002  –  October 2008  (6 years 8 months) Phoenix, Arizona Area Manage and oversee the daily operations of the housing communities. This includes management of the leasing office, maintenance, grounds and housekeeping staff.  Maintain compliance with established fair housing policies and the HOA’s. Responsible for analyzing, developing and implementing marketing plans. Assist as appropriate in the overall management of the property; includes day-to-day operations, fiscal management and administration. Manage and oversee with some supervision property policies and procedures pertaining to the HOA. Property Manager M & T Properties March 2002  –  October 2008  (6 years 8 months) Phoenix, Arizona Area Manage and oversee the daily operations of the housing communities. This includes management of the leasing office, maintenance, grounds and housekeeping staff.  Maintain compliance with established fair housing policies and the HOA’s. Responsible for analyzing, developing and implementing marketing plans. Assist as appropriate in the overall management of the property; includes day-to-day operations, fiscal management and administration. Manage and oversee with some supervision property policies and procedures pertaining to the HOA. Senior Executive Administrative Support - Advance Imaging Team Intel Corporation December 2000  –  March 2002  (1 year 4 months) As the senior administrator to the department manager my responsibilities included providing administrative support for 30 engineers and product managers in the Advanced Imaging Team. I was primarily responsible for the department manager's scheduling, coordination of department meetings, presentation preparation, file share administration, and department purchasing. I also managed the department's office space logistics, mail distribution, documentation for weekly staff meetings and office supply provisioning. As a leader of the AIT recreation committee, I was responsible for driving the successful planning of team-building events. I managed the staffing process for AIT including: contacting candidates and coordinating interviews, utilizing staff web tools for opening/closing requisitions, assimilating new hires and maintaining & tracking staffing data. I was responsible for creating and updating web content for the department website, which required coordinating with content owners for timely updates. Senior Executive Administrative Support - Advance Imaging Team Intel Corporation December 2000  –  March 2002  (1 year 4 months) As the senior administrator to the department manager my responsibilities included providing administrative support for 30 engineers and product managers in the Advanced Imaging Team. I was primarily responsible for the department manager's scheduling, coordination of department meetings, presentation preparation, file share administration, and department purchasing. I also managed the department's office space logistics, mail distribution, documentation for weekly staff meetings and office supply provisioning. As a leader of the AIT recreation committee, I was responsible for driving the successful planning of team-building events. I managed the staffing process for AIT including: contacting candidates and coordinating interviews, utilizing staff web tools for opening/closing requisitions, assimilating new hires and maintaining & tracking staffing data. I was responsible for creating and updating web content for the department website, which required coordinating with content owners for timely updates. Executive Administrative Support- Intel Corporation Home Products Group September 1999  –  December 2000  (1 year 4 months) were to maintain the division manager's calendar responsible for over 70 people, which included managing the logistics and agenda for his weekly staff, group and 1:1 meetings. I facilitated theTeam Leads and Program Manager's staff meetings, and various product-related meetings. I coordinated \nrequired-training classes, which included managing the logistics with attendees from other sites, working with site scheduling for locations, materials readiness, and rescheduling attendees as needed. I managed \nthe staffing process which included contacting candidates and coordinating interviews, utilizing staffing \nweb tools for opening/closing requisitions, assimilating new hires prior to & upon arrival to Intel, and maintain & tracked staffing data. Day-to-day activities also included department purchasing, coordinating travel arrangements, and ensuring timely communications to all staff members. I assumed the web master responsibilities for the Arizona HBS website utilizing FrontPage for updates. This required me to \nmaintain content and coordinate ongoing changes with the corporate HBS web master. I assumed a lead role in the Arizona HPG Activities Committee, which included organizing and coordinating group events for the 70 employees within HPG. Executive Administrative Support- Intel Corporation Home Products Group September 1999  –  December 2000  (1 year 4 months) were to maintain the division manager's calendar responsible for over 70 people, which included managing the logistics and agenda for his weekly staff, group and 1:1 meetings. I facilitated theTeam Leads and Program Manager's staff meetings, and various product-related meetings. I coordinated \nrequired-training classes, which included managing the logistics with attendees from other sites, working with site scheduling for locations, materials readiness, and rescheduling attendees as needed. I managed \nthe staffing process which included contacting candidates and coordinating interviews, utilizing staffing \nweb tools for opening/closing requisitions, assimilating new hires prior to & upon arrival to Intel, and maintain & tracked staffing data. Day-to-day activities also included department purchasing, coordinating travel arrangements, and ensuring timely communications to all staff members. I assumed the web master responsibilities for the Arizona HBS website utilizing FrontPage for updates. This required me to \nmaintain content and coordinate ongoing changes with the corporate HBS web master. I assumed a lead role in the Arizona HPG Activities Committee, which included organizing and coordinating group events for the 70 employees within HPG. Senior Worldwide Meeting Coordinator Rosenbluth International March 1997  –  September 1999  (2 years 7 months) Responsibilities were to manage project details for meetings held worldwide for Intel. The role required a \nhighly organized team player with excellent communication skills. It also required collaboration with a \ndiverse collection of Intel employee's and Intel suppliers both domestically and internationally. Position \nrequired working unsupervised in a fast paced environment to understand and communicate business meeting requirements. Details include negotiating the rates of air and ground transportation as well as hotel accommodations including technical for meeting rooms. The position also required me to stay current on the latest technologies to effectively complete transportation arrangements. I was responsible for mentoring department associates and for training of employees on process & procedures. Senior Worldwide Meeting Coordinator Rosenbluth International March 1997  –  September 1999  (2 years 7 months) Responsibilities were to manage project details for meetings held worldwide for Intel. The role required a \nhighly organized team player with excellent communication skills. It also required collaboration with a \ndiverse collection of Intel employee's and Intel suppliers both domestically and internationally. Position \nrequired working unsupervised in a fast paced environment to understand and communicate business meeting requirements. Details include negotiating the rates of air and ground transportation as well as hotel accommodations including technical for meeting rooms. The position also required me to stay current on the latest technologies to effectively complete transportation arrangements. I was responsible for mentoring department associates and for training of employees on process & procedures. Skills Leadership Management Training Team Building Analysis Marketing Start-ups Software Documentation Sales Recruiting Human Resources Project Planning Negotiation Customer Service Skills  Leadership Management Training Team Building Analysis Marketing Start-ups Software Documentation Sales Recruiting Human Resources Project Planning Negotiation Customer Service Leadership Management Training Team Building Analysis Marketing Start-ups Software Documentation Sales Recruiting Human Resources Project Planning Negotiation Customer Service Leadership Management Training Team Building Analysis Marketing Start-ups Software Documentation Sales Recruiting Human Resources Project Planning Negotiation Customer Service Education University of Phoenix Progress towards Master's degree,  E-Business 2001  – 2001 Arizona State University Bachelor of Arts,  Sociology 1992  – 1995 Mesa Community College Business Associate's Degree University of Phoenix Progress towards Master's degree,  E-Business 2001  – 2001 University of Phoenix Progress towards Master's degree,  E-Business 2001  – 2001 University of Phoenix Progress towards Master's degree,  E-Business 2001  – 2001 Arizona State University Bachelor of Arts,  Sociology 1992  – 1995 Arizona State University Bachelor of Arts,  Sociology 1992  – 1995 Arizona State University Bachelor of Arts,  Sociology 1992  – 1995 Mesa Community College Business Associate's Degree Mesa Community College Business Associate's Degree Mesa Community College Business Associate's Degree ", "Summary Barbara is a highly motivated and dedicated employee with many years of progressively challenging experiences. Her professional background spans through many industry facets including Banking, Computer Technology, Design, Healthcare, Insurance, Manufacturing, Wholesale Fuels, and the Large Format Print Industry. Barbara easily adapts to new concepts and responsibilities. She possesses and exhibits the ability to handle confidential and sensitive information with discretion and professionalism. Additionally, she is adept in client needs assessment, problem identification, complaint resolution, customer tracking, and assuring customer satisfaction. Barbara wants to share her skills with an employer who wants a high quality employee on their team; one that will be a quantifiable asset to their company. Specialties:QB, NetSuite, Word, Excel, PowerPoint, Outlook, Typing 60wpm. Excellent spelling, grammar, composition, proofreading & editing skills. Outstanding interpersonal & negotiation skills. Proven ability to interact effectively & professionally. Excellent problem solving, analytical, organizational, & ‘follow through’ skills. Flexible, w/strong ability to multi-task. Proactive, Self-Starter & Self-Directed. Very organized; able to set priorities. Summary Barbara is a highly motivated and dedicated employee with many years of progressively challenging experiences. Her professional background spans through many industry facets including Banking, Computer Technology, Design, Healthcare, Insurance, Manufacturing, Wholesale Fuels, and the Large Format Print Industry. Barbara easily adapts to new concepts and responsibilities. She possesses and exhibits the ability to handle confidential and sensitive information with discretion and professionalism. Additionally, she is adept in client needs assessment, problem identification, complaint resolution, customer tracking, and assuring customer satisfaction. Barbara wants to share her skills with an employer who wants a high quality employee on their team; one that will be a quantifiable asset to their company. Specialties:QB, NetSuite, Word, Excel, PowerPoint, Outlook, Typing 60wpm. Excellent spelling, grammar, composition, proofreading & editing skills. Outstanding interpersonal & negotiation skills. Proven ability to interact effectively & professionally. Excellent problem solving, analytical, organizational, & ‘follow through’ skills. Flexible, w/strong ability to multi-task. Proactive, Self-Starter & Self-Directed. Very organized; able to set priorities. Barbara is a highly motivated and dedicated employee with many years of progressively challenging experiences. Her professional background spans through many industry facets including Banking, Computer Technology, Design, Healthcare, Insurance, Manufacturing, Wholesale Fuels, and the Large Format Print Industry. Barbara easily adapts to new concepts and responsibilities. She possesses and exhibits the ability to handle confidential and sensitive information with discretion and professionalism. Additionally, she is adept in client needs assessment, problem identification, complaint resolution, customer tracking, and assuring customer satisfaction. Barbara wants to share her skills with an employer who wants a high quality employee on their team; one that will be a quantifiable asset to their company. Specialties:QB, NetSuite, Word, Excel, PowerPoint, Outlook, Typing 60wpm. Excellent spelling, grammar, composition, proofreading & editing skills. Outstanding interpersonal & negotiation skills. Proven ability to interact effectively & professionally. Excellent problem solving, analytical, organizational, & ‘follow through’ skills. Flexible, w/strong ability to multi-task. Proactive, Self-Starter & Self-Directed. Very organized; able to set priorities. Barbara is a highly motivated and dedicated employee with many years of progressively challenging experiences. Her professional background spans through many industry facets including Banking, Computer Technology, Design, Healthcare, Insurance, Manufacturing, Wholesale Fuels, and the Large Format Print Industry. Barbara easily adapts to new concepts and responsibilities. She possesses and exhibits the ability to handle confidential and sensitive information with discretion and professionalism. Additionally, she is adept in client needs assessment, problem identification, complaint resolution, customer tracking, and assuring customer satisfaction. Barbara wants to share her skills with an employer who wants a high quality employee on their team; one that will be a quantifiable asset to their company. Specialties:QB, NetSuite, Word, Excel, PowerPoint, Outlook, Typing 60wpm. Excellent spelling, grammar, composition, proofreading & editing skills. Outstanding interpersonal & negotiation skills. Proven ability to interact effectively & professionally. Excellent problem solving, analytical, organizational, & ‘follow through’ skills. Flexible, w/strong ability to multi-task. Proactive, Self-Starter & Self-Directed. Very organized; able to set priorities. Experience Customer Service / Office Manager 360 Digital Imaging Solutions December 2011  – Present (3 years 9 months) Greater San Diego Area 360 Digital Imaging Solutions is here to meet your business needs by offering a complete solution; tying together ink, media, laminates and equipment.  \n \nHere at 360 DIS we have industry specific, knowledgeable sales reps available, that can come by to personally discuss products; or to provide you with samples of our media. We always have exciting new products to share with our customers! \n \nWe would love to add Your Business to our long list of satisfied 360 Digital Imaging Solutions customers! \n \nPlease feel free to contact me, directly, should you have any questions or inquiries. We look forward to the opportunity to work together and to provide products and services that can add value to your business! Office Manager & Bookkeeper Lamb Fuels, Inc. October 2007  –  July 2011  (3 years 10 months) Chula Vista, CA •\tStepped into a young, small company, and was instrumental in growing it to a $6mil+ nationwide business. Documented savings of $30k+ over a two year span. \n•\tHeavy QuickBooks, including A/P, A/R, HR, invoicing, reconciliation of multiple bank & credit card accounts, cash management, month-end & year-end financial closing…etc.  \n•\tSuccessfully forged strong business relationships. Closed the largest, single transaction. Personal Assistant & Office Manager 303 Solutions LLC January 2006  –  October 2007  (1 year 10 months) Coronado, CA •\tInvolved at all levels of the business; directly reporting to the company owner/President. \n•\tKey role in startup company (Computer Champions). Responsible for ensuring all aspects of new business activities were met, processed, and filed in a timely manner. \n•\tTasks included, but were not limited to preparing/receiving business correspondence, setting up and reporting payroll, research projects, reconciling statements, accounts payable, and accounts receivable. I developed reports & workflows, filed, organized, and tracked just about everything. \n•\tResponsible for various HR activities; including resume tracking/pre-screening, interviewing and maintenance of confidential employee files.  \n•\tResponsible for Nevada LLC (303 Solutions). Prepared and filed various Monthly, Quarterly, Bi-annual, and Annual Reports, via multiple entities; including Nevada Department of Taxation - Modified Business Tax Return, General Business, Sales & Use Tax Report, Annual State Business License Renewal, Secretary of the State filings, including the Operating agreement, Articles of Organization LLC, Resident Agent, Member List, Annual list of Managers or Managing Members and Resident Agent. City of Henderson, Business License Renewals \n•\tResponsible for household tasks, too, including managing/tracking/processing DMV renewals, mortgage payments, utilities, property taxes, investment accounts, wires, bank reconciliation, credit card payments, etc. \n•\tOffice lacked structure. Created reports and filing system for two years of business and personal records, from scratch. Then input all info into QuickBooks. Generated tax reports. Compiled financial records for accountant. Customer Service Specialist/Sr. Project Manager KOJO Worldwide August 2004  –  December 2006  (2 years 5 months) San Diego, CA & Rosarito Beach, Mexico •\tMy expertise as a project manager allows me to coordinate every detail of a project from start to finish, assuring quality, price, delivery and value. \n•\tI was the account representative responsible for servicing, tracking and supporting one of the company’s largest, most prestigious, multi-million dollar clients.  \n•\tI implemented new processes and tracking methods, and in turn revived a customer account that was slipping away, by providing effective, personal and professional overall service.  \n•\tActed as a liaison between the customer, the KOJO sales staff, and the factory production product managers, ensuring accurate orders and a high level customer satisfaction. \n•\tInvolved at all levels of the company; directly reporting to the company owner/CEO. \n•\tI provided direct support to the company’s leading sales person ($7 Million annual sales). HELOC (Home Equity Line of Credit) Team Member & Member Business Loan Specialist North Island Financial Credit Union January 2003  –  July 2004  (1 year 7 months) Chula Vista, CA •\tResponsible for processing all incoming new HELOC applications in a timely and accurate manner. \n•\tPrepared member file for underwriting by gathering the appropriate documentation, to include credit reports, comps, insurance, title, flood, and appraisals.  \n•\tAudit docs to maintain accuracy and ensure signed docs are submitted correctly for county recording. \n•\tDraw docs for approved loans. Prepare package for customer signing. Verify all necessary documents are in order. \n•\tResponsible for maintaining sufficient office supplies. Key contact for ordering and stocking the department supplies.  \n•\tSupported the Credit Union’s mission/vision, corporate values and service guarantees, including a $9MM Business Loan Production Goal \n•\tPerformed to the standards that meet or exceed the Credit Union and divisional objectives and fulfilled the expectations of all internal and external customers. \n•\tRepresented the Credit Union in a professional, responsive manner and promoted team participation on branch and organizational levels. \n•\tObtained credit reports, UCC searches and filings. Processed loan participations – posted activity and submitted wires. Processed loan payoffs. \n•\tReports Administration – reconciled and circulated department reports, including daily review and processing of rejected items. Track and process charges for analyzed accounts. Update/Maintain Pipeline Reports and Rate Sheets. \n•\tAudit Business Account Signature Cards. \n•\tCovenant Tracking on all Business Loans and Commercial Real Estate Loans. Sr. Administrative Support Intel Corporation October 1996  –  May 2002  (5 years 8 months) Folsom, CA •In a fast paced, high-pressure work environment, supported a Senior Level Engineering Manager, his direct staff of 10 managers, & their 130+ technical individual contributors, across 3 states; which I traveled to periodically. Minimal supervision. \n•Scheduled in-house & off-site meetings; local & cross site/state. \n•Set travel arrangements, including air travel, transportation, hotel, & catering. \n•Managed and stocked departmental supplies & employee recognition awards. \n•Reconciled VISA card orders & expense reports. \n•Attended department meetings;prepared minutes & distributed to staff. \n•Responsible for department WEB page maintenance.  \n•Various HR activities; resume tracking/pre-screening, maintenance of confidential employee files, & processing ‘Change of Status’ updates. Liaison to HR for focal review process.  \n•Planned & coordinated team business events and fun events. \n•Telecommute 40-50%; from home (700 miles from work site), for 2 ½ years.  \n•Developed & implemented a security, audit process. Eliminated the risk of unauthorized users. Superb attention to detail was essential. Deadlines were abundant & met regularly. \n•Reduced an unexpected backlog of over 800 inquiries down to fewer than 100, in record time, keeping users productive and saving the company thousands of dollars.  \n•Negotiated w/select vendors to secure the most competitive pricing. Saved thousands. \n•Handled a high volume of incoming calls in a timely & accurate manner. Additionally, processed/responded to incoming reservation requests, via cc: Mail and voice mail. \n•Scheduled conference rooms, audio bridges, and video reservations (both, point to point and multiple site reservations). 24x7 team, worldwide customer base. \n•Actively participated in Team Development Activities to enhance & further develop existing skills within the team.  \n•Consistently maintained flexibility & periodically worked alternate shifts to cover for other team members, when necessary, to meet business needs. Customer Service Representative, Provider Relations & Claims Blue Shield of California October 1991  –  August 1996  (4 years 11 months) Folsom, CA •\tHandled a high volume of both oral and written communications from providers, subscribers, local, State and Federal agencies, to resolve complex problems relating to claim activity. Worked independently with little supervision. \n•\tConfidently made decisions regarding claims of above average difficulty, in a timely manner, with speed and accuracy and offered choices of resolution, when appropriate.  \n•\tDemonstrated analytical abilities and performed thorough in depth and independent research. Implemented ICD-9 and CPT coding knowledge. \n•\tMaintained 100% accuracy on audits for over one year. Customer Assistance Representative First Interstate Bank July 1981  –  September 1991  (10 years 3 months) Modesto, CA and Placerville, CA •\tResponded to and resolved problems pertaining to all bank services and products to provide quality customer service. \n•\tAuthorized signer. Made decisions independently and authorized transactions needing supervisor override. \n•\tControlled daily workflow including collections for returned and rejected items. Maintained a high standard of confidentiality.  \n•\tEstablished work flows in newly opened office. Trained employees on new computer system. \n•\tResponsible for ordering cash and supplies. Processed incoming/outgoing wire transfers. Researched and reconciled accounts, cash, and receipts. \n•\tNotarized company documents. Notary/State of California. \n•\tExperienced in all operational aspects of banking, including Vault Teller, Merchant Teller and Note Teller. Also, experienced in New Accounts. Customer Service / Office Manager 360 Digital Imaging Solutions December 2011  – Present (3 years 9 months) Greater San Diego Area 360 Digital Imaging Solutions is here to meet your business needs by offering a complete solution; tying together ink, media, laminates and equipment.  \n \nHere at 360 DIS we have industry specific, knowledgeable sales reps available, that can come by to personally discuss products; or to provide you with samples of our media. We always have exciting new products to share with our customers! \n \nWe would love to add Your Business to our long list of satisfied 360 Digital Imaging Solutions customers! \n \nPlease feel free to contact me, directly, should you have any questions or inquiries. We look forward to the opportunity to work together and to provide products and services that can add value to your business! Customer Service / Office Manager 360 Digital Imaging Solutions December 2011  – Present (3 years 9 months) Greater San Diego Area 360 Digital Imaging Solutions is here to meet your business needs by offering a complete solution; tying together ink, media, laminates and equipment.  \n \nHere at 360 DIS we have industry specific, knowledgeable sales reps available, that can come by to personally discuss products; or to provide you with samples of our media. We always have exciting new products to share with our customers! \n \nWe would love to add Your Business to our long list of satisfied 360 Digital Imaging Solutions customers! \n \nPlease feel free to contact me, directly, should you have any questions or inquiries. We look forward to the opportunity to work together and to provide products and services that can add value to your business! Office Manager & Bookkeeper Lamb Fuels, Inc. October 2007  –  July 2011  (3 years 10 months) Chula Vista, CA •\tStepped into a young, small company, and was instrumental in growing it to a $6mil+ nationwide business. Documented savings of $30k+ over a two year span. \n•\tHeavy QuickBooks, including A/P, A/R, HR, invoicing, reconciliation of multiple bank & credit card accounts, cash management, month-end & year-end financial closing…etc.  \n•\tSuccessfully forged strong business relationships. Closed the largest, single transaction. Office Manager & Bookkeeper Lamb Fuels, Inc. October 2007  –  July 2011  (3 years 10 months) Chula Vista, CA •\tStepped into a young, small company, and was instrumental in growing it to a $6mil+ nationwide business. Documented savings of $30k+ over a two year span. \n•\tHeavy QuickBooks, including A/P, A/R, HR, invoicing, reconciliation of multiple bank & credit card accounts, cash management, month-end & year-end financial closing…etc.  \n•\tSuccessfully forged strong business relationships. Closed the largest, single transaction. Personal Assistant & Office Manager 303 Solutions LLC January 2006  –  October 2007  (1 year 10 months) Coronado, CA •\tInvolved at all levels of the business; directly reporting to the company owner/President. \n•\tKey role in startup company (Computer Champions). Responsible for ensuring all aspects of new business activities were met, processed, and filed in a timely manner. \n•\tTasks included, but were not limited to preparing/receiving business correspondence, setting up and reporting payroll, research projects, reconciling statements, accounts payable, and accounts receivable. I developed reports & workflows, filed, organized, and tracked just about everything. \n•\tResponsible for various HR activities; including resume tracking/pre-screening, interviewing and maintenance of confidential employee files.  \n•\tResponsible for Nevada LLC (303 Solutions). Prepared and filed various Monthly, Quarterly, Bi-annual, and Annual Reports, via multiple entities; including Nevada Department of Taxation - Modified Business Tax Return, General Business, Sales & Use Tax Report, Annual State Business License Renewal, Secretary of the State filings, including the Operating agreement, Articles of Organization LLC, Resident Agent, Member List, Annual list of Managers or Managing Members and Resident Agent. City of Henderson, Business License Renewals \n•\tResponsible for household tasks, too, including managing/tracking/processing DMV renewals, mortgage payments, utilities, property taxes, investment accounts, wires, bank reconciliation, credit card payments, etc. \n•\tOffice lacked structure. Created reports and filing system for two years of business and personal records, from scratch. Then input all info into QuickBooks. Generated tax reports. Compiled financial records for accountant. Personal Assistant & Office Manager 303 Solutions LLC January 2006  –  October 2007  (1 year 10 months) Coronado, CA •\tInvolved at all levels of the business; directly reporting to the company owner/President. \n•\tKey role in startup company (Computer Champions). Responsible for ensuring all aspects of new business activities were met, processed, and filed in a timely manner. \n•\tTasks included, but were not limited to preparing/receiving business correspondence, setting up and reporting payroll, research projects, reconciling statements, accounts payable, and accounts receivable. I developed reports & workflows, filed, organized, and tracked just about everything. \n•\tResponsible for various HR activities; including resume tracking/pre-screening, interviewing and maintenance of confidential employee files.  \n•\tResponsible for Nevada LLC (303 Solutions). Prepared and filed various Monthly, Quarterly, Bi-annual, and Annual Reports, via multiple entities; including Nevada Department of Taxation - Modified Business Tax Return, General Business, Sales & Use Tax Report, Annual State Business License Renewal, Secretary of the State filings, including the Operating agreement, Articles of Organization LLC, Resident Agent, Member List, Annual list of Managers or Managing Members and Resident Agent. City of Henderson, Business License Renewals \n•\tResponsible for household tasks, too, including managing/tracking/processing DMV renewals, mortgage payments, utilities, property taxes, investment accounts, wires, bank reconciliation, credit card payments, etc. \n•\tOffice lacked structure. Created reports and filing system for two years of business and personal records, from scratch. Then input all info into QuickBooks. Generated tax reports. Compiled financial records for accountant. Customer Service Specialist/Sr. Project Manager KOJO Worldwide August 2004  –  December 2006  (2 years 5 months) San Diego, CA & Rosarito Beach, Mexico •\tMy expertise as a project manager allows me to coordinate every detail of a project from start to finish, assuring quality, price, delivery and value. \n•\tI was the account representative responsible for servicing, tracking and supporting one of the company’s largest, most prestigious, multi-million dollar clients.  \n•\tI implemented new processes and tracking methods, and in turn revived a customer account that was slipping away, by providing effective, personal and professional overall service.  \n•\tActed as a liaison between the customer, the KOJO sales staff, and the factory production product managers, ensuring accurate orders and a high level customer satisfaction. \n•\tInvolved at all levels of the company; directly reporting to the company owner/CEO. \n•\tI provided direct support to the company’s leading sales person ($7 Million annual sales). Customer Service Specialist/Sr. Project Manager KOJO Worldwide August 2004  –  December 2006  (2 years 5 months) San Diego, CA & Rosarito Beach, Mexico •\tMy expertise as a project manager allows me to coordinate every detail of a project from start to finish, assuring quality, price, delivery and value. \n•\tI was the account representative responsible for servicing, tracking and supporting one of the company’s largest, most prestigious, multi-million dollar clients.  \n•\tI implemented new processes and tracking methods, and in turn revived a customer account that was slipping away, by providing effective, personal and professional overall service.  \n•\tActed as a liaison between the customer, the KOJO sales staff, and the factory production product managers, ensuring accurate orders and a high level customer satisfaction. \n•\tInvolved at all levels of the company; directly reporting to the company owner/CEO. \n•\tI provided direct support to the company’s leading sales person ($7 Million annual sales). HELOC (Home Equity Line of Credit) Team Member & Member Business Loan Specialist North Island Financial Credit Union January 2003  –  July 2004  (1 year 7 months) Chula Vista, CA •\tResponsible for processing all incoming new HELOC applications in a timely and accurate manner. \n•\tPrepared member file for underwriting by gathering the appropriate documentation, to include credit reports, comps, insurance, title, flood, and appraisals.  \n•\tAudit docs to maintain accuracy and ensure signed docs are submitted correctly for county recording. \n•\tDraw docs for approved loans. Prepare package for customer signing. Verify all necessary documents are in order. \n•\tResponsible for maintaining sufficient office supplies. Key contact for ordering and stocking the department supplies.  \n•\tSupported the Credit Union’s mission/vision, corporate values and service guarantees, including a $9MM Business Loan Production Goal \n•\tPerformed to the standards that meet or exceed the Credit Union and divisional objectives and fulfilled the expectations of all internal and external customers. \n•\tRepresented the Credit Union in a professional, responsive manner and promoted team participation on branch and organizational levels. \n•\tObtained credit reports, UCC searches and filings. Processed loan participations – posted activity and submitted wires. Processed loan payoffs. \n•\tReports Administration – reconciled and circulated department reports, including daily review and processing of rejected items. Track and process charges for analyzed accounts. Update/Maintain Pipeline Reports and Rate Sheets. \n•\tAudit Business Account Signature Cards. \n•\tCovenant Tracking on all Business Loans and Commercial Real Estate Loans. HELOC (Home Equity Line of Credit) Team Member & Member Business Loan Specialist North Island Financial Credit Union January 2003  –  July 2004  (1 year 7 months) Chula Vista, CA •\tResponsible for processing all incoming new HELOC applications in a timely and accurate manner. \n•\tPrepared member file for underwriting by gathering the appropriate documentation, to include credit reports, comps, insurance, title, flood, and appraisals.  \n•\tAudit docs to maintain accuracy and ensure signed docs are submitted correctly for county recording. \n•\tDraw docs for approved loans. Prepare package for customer signing. Verify all necessary documents are in order. \n•\tResponsible for maintaining sufficient office supplies. Key contact for ordering and stocking the department supplies.  \n•\tSupported the Credit Union’s mission/vision, corporate values and service guarantees, including a $9MM Business Loan Production Goal \n•\tPerformed to the standards that meet or exceed the Credit Union and divisional objectives and fulfilled the expectations of all internal and external customers. \n•\tRepresented the Credit Union in a professional, responsive manner and promoted team participation on branch and organizational levels. \n•\tObtained credit reports, UCC searches and filings. Processed loan participations – posted activity and submitted wires. Processed loan payoffs. \n•\tReports Administration – reconciled and circulated department reports, including daily review and processing of rejected items. Track and process charges for analyzed accounts. Update/Maintain Pipeline Reports and Rate Sheets. \n•\tAudit Business Account Signature Cards. \n•\tCovenant Tracking on all Business Loans and Commercial Real Estate Loans. Sr. Administrative Support Intel Corporation October 1996  –  May 2002  (5 years 8 months) Folsom, CA •In a fast paced, high-pressure work environment, supported a Senior Level Engineering Manager, his direct staff of 10 managers, & their 130+ technical individual contributors, across 3 states; which I traveled to periodically. Minimal supervision. \n•Scheduled in-house & off-site meetings; local & cross site/state. \n•Set travel arrangements, including air travel, transportation, hotel, & catering. \n•Managed and stocked departmental supplies & employee recognition awards. \n•Reconciled VISA card orders & expense reports. \n•Attended department meetings;prepared minutes & distributed to staff. \n•Responsible for department WEB page maintenance.  \n•Various HR activities; resume tracking/pre-screening, maintenance of confidential employee files, & processing ‘Change of Status’ updates. Liaison to HR for focal review process.  \n•Planned & coordinated team business events and fun events. \n•Telecommute 40-50%; from home (700 miles from work site), for 2 ½ years.  \n•Developed & implemented a security, audit process. Eliminated the risk of unauthorized users. Superb attention to detail was essential. Deadlines were abundant & met regularly. \n•Reduced an unexpected backlog of over 800 inquiries down to fewer than 100, in record time, keeping users productive and saving the company thousands of dollars.  \n•Negotiated w/select vendors to secure the most competitive pricing. Saved thousands. \n•Handled a high volume of incoming calls in a timely & accurate manner. Additionally, processed/responded to incoming reservation requests, via cc: Mail and voice mail. \n•Scheduled conference rooms, audio bridges, and video reservations (both, point to point and multiple site reservations). 24x7 team, worldwide customer base. \n•Actively participated in Team Development Activities to enhance & further develop existing skills within the team.  \n•Consistently maintained flexibility & periodically worked alternate shifts to cover for other team members, when necessary, to meet business needs. Sr. Administrative Support Intel Corporation October 1996  –  May 2002  (5 years 8 months) Folsom, CA •In a fast paced, high-pressure work environment, supported a Senior Level Engineering Manager, his direct staff of 10 managers, & their 130+ technical individual contributors, across 3 states; which I traveled to periodically. Minimal supervision. \n•Scheduled in-house & off-site meetings; local & cross site/state. \n•Set travel arrangements, including air travel, transportation, hotel, & catering. \n•Managed and stocked departmental supplies & employee recognition awards. \n•Reconciled VISA card orders & expense reports. \n•Attended department meetings;prepared minutes & distributed to staff. \n•Responsible for department WEB page maintenance.  \n•Various HR activities; resume tracking/pre-screening, maintenance of confidential employee files, & processing ‘Change of Status’ updates. Liaison to HR for focal review process.  \n•Planned & coordinated team business events and fun events. \n•Telecommute 40-50%; from home (700 miles from work site), for 2 ½ years.  \n•Developed & implemented a security, audit process. Eliminated the risk of unauthorized users. Superb attention to detail was essential. Deadlines were abundant & met regularly. \n•Reduced an unexpected backlog of over 800 inquiries down to fewer than 100, in record time, keeping users productive and saving the company thousands of dollars.  \n•Negotiated w/select vendors to secure the most competitive pricing. Saved thousands. \n•Handled a high volume of incoming calls in a timely & accurate manner. Additionally, processed/responded to incoming reservation requests, via cc: Mail and voice mail. \n•Scheduled conference rooms, audio bridges, and video reservations (both, point to point and multiple site reservations). 24x7 team, worldwide customer base. \n•Actively participated in Team Development Activities to enhance & further develop existing skills within the team.  \n•Consistently maintained flexibility & periodically worked alternate shifts to cover for other team members, when necessary, to meet business needs. Customer Service Representative, Provider Relations & Claims Blue Shield of California October 1991  –  August 1996  (4 years 11 months) Folsom, CA •\tHandled a high volume of both oral and written communications from providers, subscribers, local, State and Federal agencies, to resolve complex problems relating to claim activity. Worked independently with little supervision. \n•\tConfidently made decisions regarding claims of above average difficulty, in a timely manner, with speed and accuracy and offered choices of resolution, when appropriate.  \n•\tDemonstrated analytical abilities and performed thorough in depth and independent research. Implemented ICD-9 and CPT coding knowledge. \n•\tMaintained 100% accuracy on audits for over one year. Customer Service Representative, Provider Relations & Claims Blue Shield of California October 1991  –  August 1996  (4 years 11 months) Folsom, CA •\tHandled a high volume of both oral and written communications from providers, subscribers, local, State and Federal agencies, to resolve complex problems relating to claim activity. Worked independently with little supervision. \n•\tConfidently made decisions regarding claims of above average difficulty, in a timely manner, with speed and accuracy and offered choices of resolution, when appropriate.  \n•\tDemonstrated analytical abilities and performed thorough in depth and independent research. Implemented ICD-9 and CPT coding knowledge. \n•\tMaintained 100% accuracy on audits for over one year. Customer Assistance Representative First Interstate Bank July 1981  –  September 1991  (10 years 3 months) Modesto, CA and Placerville, CA •\tResponded to and resolved problems pertaining to all bank services and products to provide quality customer service. \n•\tAuthorized signer. Made decisions independently and authorized transactions needing supervisor override. \n•\tControlled daily workflow including collections for returned and rejected items. Maintained a high standard of confidentiality.  \n•\tEstablished work flows in newly opened office. Trained employees on new computer system. \n•\tResponsible for ordering cash and supplies. Processed incoming/outgoing wire transfers. Researched and reconciled accounts, cash, and receipts. \n•\tNotarized company documents. Notary/State of California. \n•\tExperienced in all operational aspects of banking, including Vault Teller, Merchant Teller and Note Teller. Also, experienced in New Accounts. Customer Assistance Representative First Interstate Bank July 1981  –  September 1991  (10 years 3 months) Modesto, CA and Placerville, CA •\tResponded to and resolved problems pertaining to all bank services and products to provide quality customer service. \n•\tAuthorized signer. Made decisions independently and authorized transactions needing supervisor override. \n•\tControlled daily workflow including collections for returned and rejected items. Maintained a high standard of confidentiality.  \n•\tEstablished work flows in newly opened office. Trained employees on new computer system. \n•\tResponsible for ordering cash and supplies. Processed incoming/outgoing wire transfers. Researched and reconciled accounts, cash, and receipts. \n•\tNotarized company documents. Notary/State of California. \n•\tExperienced in all operational aspects of banking, including Vault Teller, Merchant Teller and Note Teller. Also, experienced in New Accounts. Skills PowerPoint Outlook NetSuite QB Composition Set Priorities Grammar Microsoft Excel Microsoft Word Customer Service Microsoft Office Office Management QuickBooks Data Entry Accounts Payable Accounts Receivable Operations Management Human Resources Sales Accounting Payroll Invoicing Team Building Marketing See 9+     See less Skills  PowerPoint Outlook NetSuite QB Composition Set Priorities Grammar Microsoft Excel Microsoft Word Customer Service Microsoft Office Office Management QuickBooks Data Entry Accounts Payable Accounts Receivable Operations Management Human Resources Sales Accounting Payroll Invoicing Team Building Marketing See 9+     See less PowerPoint Outlook NetSuite QB Composition Set Priorities Grammar Microsoft Excel Microsoft Word Customer Service Microsoft Office Office Management QuickBooks Data Entry Accounts Payable Accounts Receivable Operations Management Human Resources Sales Accounting Payroll Invoicing Team Building Marketing See 9+     See less PowerPoint Outlook NetSuite QB Composition Set Priorities Grammar Microsoft Excel Microsoft Word Customer Service Microsoft Office Office Management QuickBooks Data Entry Accounts Payable Accounts Receivable Operations Management Human Resources Sales Accounting Payroll Invoicing Team Building Marketing See 9+     See less Education Consumnes River College Modesto Junior College Consumnes River College Consumnes River College Consumnes River College Modesto Junior College Modesto Junior College Modesto Junior College ", "Experience Administrative Support Intel Corporation May 2010  – Present (5 years 4 months) My responsibilities include personal assistant to manager, events organisation for company such as: Tet Gala, team building, community, etc.; responsible for office functions and review documents in the system Admin & HR CHINA STATE CONSTRUCTION ENGRG. CORP. (MIDDLE EAST) (L.L.C.) July 2008  –  May 2010  (1 year 11 months) Be in charge for office function, document control, cars and drivers management and other HR jobs such as monthly salary and social insurrance Administrative Support Intel Corporation May 2010  – Present (5 years 4 months) My responsibilities include personal assistant to manager, events organisation for company such as: Tet Gala, team building, community, etc.; responsible for office functions and review documents in the system Administrative Support Intel Corporation May 2010  – Present (5 years 4 months) My responsibilities include personal assistant to manager, events organisation for company such as: Tet Gala, team building, community, etc.; responsible for office functions and review documents in the system Admin & HR CHINA STATE CONSTRUCTION ENGRG. CORP. (MIDDLE EAST) (L.L.C.) July 2008  –  May 2010  (1 year 11 months) Be in charge for office function, document control, cars and drivers management and other HR jobs such as monthly salary and social insurrance Admin & HR CHINA STATE CONSTRUCTION ENGRG. CORP. (MIDDLE EAST) (L.L.C.) July 2008  –  May 2010  (1 year 11 months) Be in charge for office function, document control, cars and drivers management and other HR jobs such as monthly salary and social insurrance Languages English English English Skills Event Management Office Management Manager assistant Headcount Management Human Resources Skills  Event Management Office Management Manager assistant Headcount Management Human Resources Event Management Office Management Manager assistant Headcount Management Human Resources Event Management Office Management Manager assistant Headcount Management Human Resources Education HCMC University of Natural Science Biology , General 2001  – 2006 HCMC University of Natural Science Biology , General 2001  – 2006 HCMC University of Natural Science Biology , General 2001  – 2006 HCMC University of Natural Science Biology , General 2001  – 2006 ", "Experience Office Assistant Garcia Realty Advisors, Inc. 2015  –  2015  (less than a year) Office Assistant Garcia Realty Advisors, Inc. 2015  –  2015  (less than a year) Documentation Specialist Microchip Technology January 2000  –  June 2007  (7 years 6 months) I prepared PPAPs for Automotive Customers worldwide. I had daily contact with Microchip engineers, quality people, sales people, marketing people, worldwide. I had weekly contact with Automotive customers. I worked closely with the Automotive Quality Engineers and Automotive Planning and Logistics Manager. Sr. Administrative Support Intel Corporation January 1991  –  April 1997  (6 years 4 months) I was an Sr. Business Administrative support staff member at Intel for 7 years. I worked for various department managers: calendaring meetings, international and domestic travel arrangements, transcription, worked with diverse population. Document Controller W. L. Gore & Associates, Flagstaff, AZ September 1980  –  April 1986  (5 years 8 months) I started at Gore in the Electronics Division in Flagstaff, in Auust 1980 as a Senior Administrative Assistant. I supported the Sales and Marketing Departments. \nI transfered to the Medical Division in 1982, and worked as a Document Controller in the Vascular Graft Department, Heart Valve Department, and Ligament/Suture Departments over the following four years. Office Assistant Garcia Realty Advisors, Inc. 2015  –  2015  (less than a year) Office Assistant Garcia Realty Advisors, Inc. 2015  –  2015  (less than a year) Office Assistant Garcia Realty Advisors, Inc. 2015  –  2015  (less than a year) Office Assistant Garcia Realty Advisors, Inc. 2015  –  2015  (less than a year) Documentation Specialist Microchip Technology January 2000  –  June 2007  (7 years 6 months) I prepared PPAPs for Automotive Customers worldwide. I had daily contact with Microchip engineers, quality people, sales people, marketing people, worldwide. I had weekly contact with Automotive customers. I worked closely with the Automotive Quality Engineers and Automotive Planning and Logistics Manager. Documentation Specialist Microchip Technology January 2000  –  June 2007  (7 years 6 months) I prepared PPAPs for Automotive Customers worldwide. I had daily contact with Microchip engineers, quality people, sales people, marketing people, worldwide. I had weekly contact with Automotive customers. I worked closely with the Automotive Quality Engineers and Automotive Planning and Logistics Manager. Sr. Administrative Support Intel Corporation January 1991  –  April 1997  (6 years 4 months) I was an Sr. Business Administrative support staff member at Intel for 7 years. I worked for various department managers: calendaring meetings, international and domestic travel arrangements, transcription, worked with diverse population. Sr. Administrative Support Intel Corporation January 1991  –  April 1997  (6 years 4 months) I was an Sr. Business Administrative support staff member at Intel for 7 years. I worked for various department managers: calendaring meetings, international and domestic travel arrangements, transcription, worked with diverse population. Document Controller W. L. Gore & Associates, Flagstaff, AZ September 1980  –  April 1986  (5 years 8 months) I started at Gore in the Electronics Division in Flagstaff, in Auust 1980 as a Senior Administrative Assistant. I supported the Sales and Marketing Departments. \nI transfered to the Medical Division in 1982, and worked as a Document Controller in the Vascular Graft Department, Heart Valve Department, and Ligament/Suture Departments over the following four years. Document Controller W. L. Gore & Associates, Flagstaff, AZ September 1980  –  April 1986  (5 years 8 months) I started at Gore in the Electronics Division in Flagstaff, in Auust 1980 as a Senior Administrative Assistant. I supported the Sales and Marketing Departments. \nI transfered to the Medical Division in 1982, and worked as a Document Controller in the Vascular Graft Department, Heart Valve Department, and Ligament/Suture Departments over the following four years. Skills Electronics New Business Development Public Speaking PowerPoint Automotive Semiconductors Program Management Product Marketing Project Management Strategic Planning Microsoft Office Organizational... Research Team Building Coaching Microsoft Word Microsoft Excel Product Development Customer Service Visio Training Management Process Improvement Teaching Testing Nonprofits Sales Inventory Management Team Leadership Leadership Cross-functional Team... Customer Satisfaction Marketing Marketing Strategy Budgets Leadership Development Change Management Business Development Manufacturing See 24+     See less Skills  Electronics New Business Development Public Speaking PowerPoint Automotive Semiconductors Program Management Product Marketing Project Management Strategic Planning Microsoft Office Organizational... Research Team Building Coaching Microsoft Word Microsoft Excel Product Development Customer Service Visio Training Management Process Improvement Teaching Testing Nonprofits Sales Inventory Management Team Leadership Leadership Cross-functional Team... Customer Satisfaction Marketing Marketing Strategy Budgets Leadership Development Change Management Business Development Manufacturing See 24+     See less Electronics New Business Development Public Speaking PowerPoint Automotive Semiconductors Program Management Product Marketing Project Management Strategic Planning Microsoft Office Organizational... Research Team Building Coaching Microsoft Word Microsoft Excel Product Development Customer Service Visio Training Management Process Improvement Teaching Testing Nonprofits Sales Inventory Management Team Leadership Leadership Cross-functional Team... Customer Satisfaction Marketing Marketing Strategy Budgets Leadership Development Change Management Business Development Manufacturing See 24+     See less Electronics New Business Development Public Speaking PowerPoint Automotive Semiconductors Program Management Product Marketing Project Management Strategic Planning Microsoft Office Organizational... Research Team Building Coaching Microsoft Word Microsoft Excel Product Development Customer Service Visio Training Management Process Improvement Teaching Testing Nonprofits Sales Inventory Management Team Leadership Leadership Cross-functional Team... Customer Satisfaction Marketing Marketing Strategy Budgets Leadership Development Change Management Business Development Manufacturing See 24+     See less Education University of Phoenix Bachelors,  Business Managment 1996  – 1999 Bachelor's in Business Management University of Phoenix Bachelor of Business Administration (BBA),  Business Administration and Management , General 1995  – 1999 Ed2go Ed2go University of Phoenix Bachelors,  Business Managment 1996  – 1999 Bachelor's in Business Management University of Phoenix Bachelors,  Business Managment 1996  – 1999 Bachelor's in Business Management University of Phoenix Bachelors,  Business Managment 1996  – 1999 Bachelor's in Business Management University of Phoenix Bachelor of Business Administration (BBA),  Business Administration and Management , General 1995  – 1999 University of Phoenix Bachelor of Business Administration (BBA),  Business Administration and Management , General 1995  – 1999 University of Phoenix Bachelor of Business Administration (BBA),  Business Administration and Management , General 1995  – 1999 Ed2go Ed2go Ed2go Ed2go Ed2go Ed2go ", "Summary Secretary / Administrative support with over 10 years of experience at an international semiconductor company, an electric company and medical industry. \nHave experience of international conference coordination. \n \nAble to work under pressure and effectively handle various duties simultaneously, good \ncommunicator with excellent interpersonal skills. \n Summary Secretary / Administrative support with over 10 years of experience at an international semiconductor company, an electric company and medical industry. \nHave experience of international conference coordination. \n \nAble to work under pressure and effectively handle various duties simultaneously, good \ncommunicator with excellent interpersonal skills. \n Secretary / Administrative support with over 10 years of experience at an international semiconductor company, an electric company and medical industry. \nHave experience of international conference coordination. \n \nAble to work under pressure and effectively handle various duties simultaneously, good \ncommunicator with excellent interpersonal skills. \n Secretary / Administrative support with over 10 years of experience at an international semiconductor company, an electric company and medical industry. \nHave experience of international conference coordination. \n \nAble to work under pressure and effectively handle various duties simultaneously, good \ncommunicator with excellent interpersonal skills. \n Experience Administrative support Intel Corporation January 2014  – Present (1 year 8 months) Osaka, Japan Administrative support to Executive Officer and Technical assistant. Administrative support Intel Corporation April 2011  –  March 2013  (2 years) Osaka, Japan Administrative support to Senior managers Administrative support Tempstaff Co., Ltd November 2008  –  March 2011  (2 years 5 months) Osaka, Japan Administrative support to managers (Intel Japan) Secretary Panasonic Excel Staff January 2006  –  June 2008  (2 years 6 months) Osaka, Japan Secretary to Director Administrative support Intel Corporation January 2014  – Present (1 year 8 months) Osaka, Japan Administrative support to Executive Officer and Technical assistant. Administrative support Intel Corporation January 2014  – Present (1 year 8 months) Osaka, Japan Administrative support to Executive Officer and Technical assistant. Administrative support Intel Corporation April 2011  –  March 2013  (2 years) Osaka, Japan Administrative support to Senior managers Administrative support Intel Corporation April 2011  –  March 2013  (2 years) Osaka, Japan Administrative support to Senior managers Administrative support Tempstaff Co., Ltd November 2008  –  March 2011  (2 years 5 months) Osaka, Japan Administrative support to managers (Intel Japan) Administrative support Tempstaff Co., Ltd November 2008  –  March 2011  (2 years 5 months) Osaka, Japan Administrative support to managers (Intel Japan) Secretary Panasonic Excel Staff January 2006  –  June 2008  (2 years 6 months) Osaka, Japan Secretary to Director Secretary Panasonic Excel Staff January 2006  –  June 2008  (2 years 6 months) Osaka, Japan Secretary to Director Languages Japanese English Japanese English Japanese English Skills Administrative... Events Coordination Travel logistics Outlook Correspondence handling Office Procedures Supplies management Multicultural... Word PowerPoint SharePoint Skills  Administrative... Events Coordination Travel logistics Outlook Correspondence handling Office Procedures Supplies management Multicultural... Word PowerPoint SharePoint Administrative... Events Coordination Travel logistics Outlook Correspondence handling Office Procedures Supplies management Multicultural... Word PowerPoint SharePoint Administrative... Events Coordination Travel logistics Outlook Correspondence handling Office Procedures Supplies management Multicultural... Word PowerPoint SharePoint Education Kyoto Tachibana University Psychology 2014  – 2016 Jiyugaoka Sanno College Associates degree,  Business Administration Kyoto Tachibana University Psychology 2014  – 2016 Kyoto Tachibana University Psychology 2014  – 2016 Kyoto Tachibana University Psychology 2014  – 2016 Jiyugaoka Sanno College Associates degree,  Business Administration Jiyugaoka Sanno College Associates degree,  Business Administration Jiyugaoka Sanno College Associates degree,  Business Administration ", "Experience Sr Administrative Support Intel Corporation March 1991  – Present (24 years 6 months) Rio Rancho Sr Assistant to Vice President TMG/NM Site Plant Manager & Factory Manager Room Scheduler Albuquerque Public Schools June 1988  –  March 1991  (2 years 10 months) Sr Administrative Support Intel Corporation March 1991  – Present (24 years 6 months) Rio Rancho Sr Assistant to Vice President TMG/NM Site Plant Manager & Factory Manager Sr Administrative Support Intel Corporation March 1991  – Present (24 years 6 months) Rio Rancho Sr Assistant to Vice President TMG/NM Site Plant Manager & Factory Manager Room Scheduler Albuquerque Public Schools June 1988  –  March 1991  (2 years 10 months) Room Scheduler Albuquerque Public Schools June 1988  –  March 1991  (2 years 10 months) Skills SharePoint SAP Outlook Process Improvement Project Management PowerPoint Microsoft Word ISM Cost Improvements Calendaring Manufacturing Microsoft Office Cross-functional Team... Skills  SharePoint SAP Outlook Process Improvement Project Management PowerPoint Microsoft Word ISM Cost Improvements Calendaring Manufacturing Microsoft Office Cross-functional Team... SharePoint SAP Outlook Process Improvement Project Management PowerPoint Microsoft Word ISM Cost Improvements Calendaring Manufacturing Microsoft Office Cross-functional Team... SharePoint SAP Outlook Process Improvement Project Management PowerPoint Microsoft Word ISM Cost Improvements Calendaring Manufacturing Microsoft Office Cross-functional Team... Education NAU 1 year,  Business Managemet NAU 1 year,  Business Managemet NAU 1 year,  Business Managemet NAU 1 year,  Business Managemet ", "Experience Sr. Administrative Support Intel Corporation January 1997  – Present (18 years 8 months) Albuquerque, New Mexico Area Sr. Administrative Support Intel Corporation January 1997  – Present (18 years 8 months) Albuquerque, New Mexico Area Sr. Administrative Support Intel Corporation January 1997  – Present (18 years 8 months) Albuquerque, New Mexico Area Education LVTI 1987  – 1990 LVTI 1987  – 1990 LVTI 1987  – 1990 LVTI 1987  – 1990 ", "Summary Skillful, dedicated Administrative Professional/Project Manager with a reputation as being the ‘go to’ person to get things done. Strong back-ground in information gathering, travel/hospitality, and exceptional customer service, and proven proficiency in Microsoft Office Systems, to include SharePoint, Visio, and Projects. Specialties:International and Domestic Travel Coordination, \"Above and Beyond\" Customer Service (Internal/External) Summary Skillful, dedicated Administrative Professional/Project Manager with a reputation as being the ‘go to’ person to get things done. Strong back-ground in information gathering, travel/hospitality, and exceptional customer service, and proven proficiency in Microsoft Office Systems, to include SharePoint, Visio, and Projects. Specialties:International and Domestic Travel Coordination, \"Above and Beyond\" Customer Service (Internal/External) Skillful, dedicated Administrative Professional/Project Manager with a reputation as being the ‘go to’ person to get things done. Strong back-ground in information gathering, travel/hospitality, and exceptional customer service, and proven proficiency in Microsoft Office Systems, to include SharePoint, Visio, and Projects. Specialties:International and Domestic Travel Coordination, \"Above and Beyond\" Customer Service (Internal/External) Skillful, dedicated Administrative Professional/Project Manager with a reputation as being the ‘go to’ person to get things done. Strong back-ground in information gathering, travel/hospitality, and exceptional customer service, and proven proficiency in Microsoft Office Systems, to include SharePoint, Visio, and Projects. Specialties:International and Domestic Travel Coordination, \"Above and Beyond\" Customer Service (Internal/External) Experience Department Administrator Intel Corporation August 2011  – Present (4 years 1 month) Chandler, AZ Administrative Assistant to Intel Fellow and LTD Department Department Admin contracted to Intel LTD-Automation Kelly Services April 2011  –  August 2011  (5 months) Office Administrator contracted to ASU Gammage Kelly Services March 2011  –  April 2011  (2 months) Administrative & Research Assistant, contracted to Healthways Kelly Services February 2011  –  March 2011  (2 months) Project based assignment, data mining for marketing outreach project to introduce Wellness program. Staffing Assistant contracted to Intel Corp-Ocotillo Kelly Services October 2010  –  December 2010  (3 months) Executive Administrative Assistant Honeywell February 2007  –  June 2010  (3 years 5 months) •Provide full administrative support for up to 3 Vice Presidents, 2 Directors and various members of their respective teams \n•Detailed calendar management to include domestic and international travel and the various arrangements at destination and departmental weekly and one-on-one meetings \no Process, track and record detailed and accurate expense reports in a timely manner upon return \n•Serve as “First Contact” conduit for VP/Directors in regards to various sales persons and personnel to ensure that VP/Directors are informed and that time is used as effectively and efficiently as possible, this includes verbal, mail and email communications \n•Created and Maintained detailed files to track and budget for various office supplies to effectively use limited budget dollars, this included interaction with several office supplies representatives and maintaining accountability reports to leadership \n•Significant Projects: \no Spring 2010, successful scheduling coordination of consolidation of nearly 400 team members into one area, to include final location information, transition information, maintaining accurate bi weekly/weekly meeting notes and project assignments and coordinate post-move communication. Self-taught MS Visio to more effectively facilitate project \no Since spring 2009, served as an administrative member of work Site “Green Team” which worked to promote environmental responsibility through-out campus which houses over 1000 employees. \no Fall/Winter 2008, completion of Six Sigma/Green Belt project to create a self service information center for visitors to Tempe facility \no Through-out tenure served as Administrative Project Manager for bi-yearly project team awards; including information gathering on various nominations, arrangements for certificates (signatures and presentation compilation) and development of Global awards presentation Administrative Assistant Manpower Inc November 2006  –  February 2007  (4 months) CONTRACTED TO HONEYWELL, GLOBAL TECHNOLOGY SERVICES \n \nDirect support to various Corporate Suite personnel through use of Microsoft Office Tools, to include Outlook, Excel, Word and PowerPoint \nTravel arrangements as requested to include processing expense reports upon return \nGeneral Office Manager duties to include office and coffee supply maintenance and management of space allocation requests \nCoordinate departmental meetings and team building events including agenda details and maintaining meeting notes and project assignments Administrative Assistant Kelly Services October 2005  –  October 2006  (1 year 1 month) CONTRACTED TO INTEL CORPORATION \nDirect support to 2 Departmental Directors and their various team members through extensive use of various Microsoft Office Tools \nCoordinate departmental meetings and team building events including agenda details and maintaining meeting notes and project assignments \nServe on various Administrative Committees for department activities, projects and community fundraisers \nCreate and maintain team Intranet sites through Microsoft SharePoint \nOrganize New Hire/Internal Employee moves; including all phone, computer and desk arrangements Corporate Travel Coordinator/Office Administrator Ceiba Technologies August 2004  –  October 2005  (1 year 3 months) Arrange and confirm all International and Domestic Travel (air, hotel, car) for President and Vice President to include confirming various meetings and sales calls while traveling \nWhile with company saved over 75K in various fees by processing requests 'in house' rather than utilizing agency services \nProcess credits/debits for company corporate division to include collection account management \nUphold professional office environment to include various supplies and area maintenance \nAnswering and directing an average of 100 calls per day Travel Coordinator Benson Security Systems 2003  –  2004  (1 year) Arrangments for various Sales and Technical Staff, International and Domestic. Also served as Assistant to CFO and Receptionist QM/Reservations Agent America West Airlines 1999  –  2003  (4 years) Administrative Assistant Motorola Inc 1996  –  1998  (2 years) Customer Service Representative Cruise West 1990  –  1993  (3 years) Customer Service Representative Alaska Sightseeing Tours 1990  –  1993  (3 years) Department Administrator Intel Corporation August 2011  – Present (4 years 1 month) Chandler, AZ Administrative Assistant to Intel Fellow and LTD Department Department Administrator Intel Corporation August 2011  – Present (4 years 1 month) Chandler, AZ Administrative Assistant to Intel Fellow and LTD Department Department Admin contracted to Intel LTD-Automation Kelly Services April 2011  –  August 2011  (5 months) Department Admin contracted to Intel LTD-Automation Kelly Services April 2011  –  August 2011  (5 months) Office Administrator contracted to ASU Gammage Kelly Services March 2011  –  April 2011  (2 months) Office Administrator contracted to ASU Gammage Kelly Services March 2011  –  April 2011  (2 months) Administrative & Research Assistant, contracted to Healthways Kelly Services February 2011  –  March 2011  (2 months) Project based assignment, data mining for marketing outreach project to introduce Wellness program. Administrative & Research Assistant, contracted to Healthways Kelly Services February 2011  –  March 2011  (2 months) Project based assignment, data mining for marketing outreach project to introduce Wellness program. Staffing Assistant contracted to Intel Corp-Ocotillo Kelly Services October 2010  –  December 2010  (3 months) Staffing Assistant contracted to Intel Corp-Ocotillo Kelly Services October 2010  –  December 2010  (3 months) Executive Administrative Assistant Honeywell February 2007  –  June 2010  (3 years 5 months) •Provide full administrative support for up to 3 Vice Presidents, 2 Directors and various members of their respective teams \n•Detailed calendar management to include domestic and international travel and the various arrangements at destination and departmental weekly and one-on-one meetings \no Process, track and record detailed and accurate expense reports in a timely manner upon return \n•Serve as “First Contact” conduit for VP/Directors in regards to various sales persons and personnel to ensure that VP/Directors are informed and that time is used as effectively and efficiently as possible, this includes verbal, mail and email communications \n•Created and Maintained detailed files to track and budget for various office supplies to effectively use limited budget dollars, this included interaction with several office supplies representatives and maintaining accountability reports to leadership \n•Significant Projects: \no Spring 2010, successful scheduling coordination of consolidation of nearly 400 team members into one area, to include final location information, transition information, maintaining accurate bi weekly/weekly meeting notes and project assignments and coordinate post-move communication. Self-taught MS Visio to more effectively facilitate project \no Since spring 2009, served as an administrative member of work Site “Green Team” which worked to promote environmental responsibility through-out campus which houses over 1000 employees. \no Fall/Winter 2008, completion of Six Sigma/Green Belt project to create a self service information center for visitors to Tempe facility \no Through-out tenure served as Administrative Project Manager for bi-yearly project team awards; including information gathering on various nominations, arrangements for certificates (signatures and presentation compilation) and development of Global awards presentation Executive Administrative Assistant Honeywell February 2007  –  June 2010  (3 years 5 months) •Provide full administrative support for up to 3 Vice Presidents, 2 Directors and various members of their respective teams \n•Detailed calendar management to include domestic and international travel and the various arrangements at destination and departmental weekly and one-on-one meetings \no Process, track and record detailed and accurate expense reports in a timely manner upon return \n•Serve as “First Contact” conduit for VP/Directors in regards to various sales persons and personnel to ensure that VP/Directors are informed and that time is used as effectively and efficiently as possible, this includes verbal, mail and email communications \n•Created and Maintained detailed files to track and budget for various office supplies to effectively use limited budget dollars, this included interaction with several office supplies representatives and maintaining accountability reports to leadership \n•Significant Projects: \no Spring 2010, successful scheduling coordination of consolidation of nearly 400 team members into one area, to include final location information, transition information, maintaining accurate bi weekly/weekly meeting notes and project assignments and coordinate post-move communication. Self-taught MS Visio to more effectively facilitate project \no Since spring 2009, served as an administrative member of work Site “Green Team” which worked to promote environmental responsibility through-out campus which houses over 1000 employees. \no Fall/Winter 2008, completion of Six Sigma/Green Belt project to create a self service information center for visitors to Tempe facility \no Through-out tenure served as Administrative Project Manager for bi-yearly project team awards; including information gathering on various nominations, arrangements for certificates (signatures and presentation compilation) and development of Global awards presentation Administrative Assistant Manpower Inc November 2006  –  February 2007  (4 months) CONTRACTED TO HONEYWELL, GLOBAL TECHNOLOGY SERVICES \n \nDirect support to various Corporate Suite personnel through use of Microsoft Office Tools, to include Outlook, Excel, Word and PowerPoint \nTravel arrangements as requested to include processing expense reports upon return \nGeneral Office Manager duties to include office and coffee supply maintenance and management of space allocation requests \nCoordinate departmental meetings and team building events including agenda details and maintaining meeting notes and project assignments Administrative Assistant Manpower Inc November 2006  –  February 2007  (4 months) CONTRACTED TO HONEYWELL, GLOBAL TECHNOLOGY SERVICES \n \nDirect support to various Corporate Suite personnel through use of Microsoft Office Tools, to include Outlook, Excel, Word and PowerPoint \nTravel arrangements as requested to include processing expense reports upon return \nGeneral Office Manager duties to include office and coffee supply maintenance and management of space allocation requests \nCoordinate departmental meetings and team building events including agenda details and maintaining meeting notes and project assignments Administrative Assistant Kelly Services October 2005  –  October 2006  (1 year 1 month) CONTRACTED TO INTEL CORPORATION \nDirect support to 2 Departmental Directors and their various team members through extensive use of various Microsoft Office Tools \nCoordinate departmental meetings and team building events including agenda details and maintaining meeting notes and project assignments \nServe on various Administrative Committees for department activities, projects and community fundraisers \nCreate and maintain team Intranet sites through Microsoft SharePoint \nOrganize New Hire/Internal Employee moves; including all phone, computer and desk arrangements Administrative Assistant Kelly Services October 2005  –  October 2006  (1 year 1 month) CONTRACTED TO INTEL CORPORATION \nDirect support to 2 Departmental Directors and their various team members through extensive use of various Microsoft Office Tools \nCoordinate departmental meetings and team building events including agenda details and maintaining meeting notes and project assignments \nServe on various Administrative Committees for department activities, projects and community fundraisers \nCreate and maintain team Intranet sites through Microsoft SharePoint \nOrganize New Hire/Internal Employee moves; including all phone, computer and desk arrangements Corporate Travel Coordinator/Office Administrator Ceiba Technologies August 2004  –  October 2005  (1 year 3 months) Arrange and confirm all International and Domestic Travel (air, hotel, car) for President and Vice President to include confirming various meetings and sales calls while traveling \nWhile with company saved over 75K in various fees by processing requests 'in house' rather than utilizing agency services \nProcess credits/debits for company corporate division to include collection account management \nUphold professional office environment to include various supplies and area maintenance \nAnswering and directing an average of 100 calls per day Corporate Travel Coordinator/Office Administrator Ceiba Technologies August 2004  –  October 2005  (1 year 3 months) Arrange and confirm all International and Domestic Travel (air, hotel, car) for President and Vice President to include confirming various meetings and sales calls while traveling \nWhile with company saved over 75K in various fees by processing requests 'in house' rather than utilizing agency services \nProcess credits/debits for company corporate division to include collection account management \nUphold professional office environment to include various supplies and area maintenance \nAnswering and directing an average of 100 calls per day Travel Coordinator Benson Security Systems 2003  –  2004  (1 year) Arrangments for various Sales and Technical Staff, International and Domestic. Also served as Assistant to CFO and Receptionist Travel Coordinator Benson Security Systems 2003  –  2004  (1 year) Arrangments for various Sales and Technical Staff, International and Domestic. Also served as Assistant to CFO and Receptionist QM/Reservations Agent America West Airlines 1999  –  2003  (4 years) QM/Reservations Agent America West Airlines 1999  –  2003  (4 years) Administrative Assistant Motorola Inc 1996  –  1998  (2 years) Administrative Assistant Motorola Inc 1996  –  1998  (2 years) Customer Service Representative Cruise West 1990  –  1993  (3 years) Customer Service Representative Cruise West 1990  –  1993  (3 years) Customer Service Representative Alaska Sightseeing Tours 1990  –  1993  (3 years) Customer Service Representative Alaska Sightseeing Tours 1990  –  1993  (3 years) Skills Outlook Microsoft Excel Leadership Visio Customer Service Microsoft Office Process Scheduler Event Planning PowerPoint Employee Relations Administrative... Microsoft Word Human Resources Data Entry Access Recruiting Event Management Office Management Travel Arrangements Budget Program Management Budgets Project Management Vendor Management Training Management System Administration Government SharePoint Time Management Team Building Process Improvement Customer Satisfaction Software Documentation Employee Benefits Project Planning Business Intelligence Account Management See 23+     See less Skills  Outlook Microsoft Excel Leadership Visio Customer Service Microsoft Office Process Scheduler Event Planning PowerPoint Employee Relations Administrative... Microsoft Word Human Resources Data Entry Access Recruiting Event Management Office Management Travel Arrangements Budget Program Management Budgets Project Management Vendor Management Training Management System Administration Government SharePoint Time Management Team Building Process Improvement Customer Satisfaction Software Documentation Employee Benefits Project Planning Business Intelligence Account Management See 23+     See less Outlook Microsoft Excel Leadership Visio Customer Service Microsoft Office Process Scheduler Event Planning PowerPoint Employee Relations Administrative... Microsoft Word Human Resources Data Entry Access Recruiting Event Management Office Management Travel Arrangements Budget Program Management Budgets Project Management Vendor Management Training Management System Administration Government SharePoint Time Management Team Building Process Improvement Customer Satisfaction Software Documentation Employee Benefits Project Planning Business Intelligence Account Management See 23+     See less Outlook Microsoft Excel Leadership Visio Customer Service Microsoft Office Process Scheduler Event Planning PowerPoint Employee Relations Administrative... Microsoft Word Human Resources Data Entry Access Recruiting Event Management Office Management Travel Arrangements Budget Program Management Budgets Project Management Vendor Management Training Management System Administration Government SharePoint Time Management Team Building Process Improvement Customer Satisfaction Software Documentation Employee Benefits Project Planning Business Intelligence Account Management See 23+     See less Education Chandler-Gilbert Community College Associate's Degree,  AAS , Organizational Management , Graduated with Highest Distinction, 3.75 and above 1999  – 2014 Celebrated Graduation on May 9, 2014 Activities and Societies:  Phi Theta Kappa Member Robert Service Senior High School Diploma,  General Studies; Travel/Hospitality 1984  – 1988 Chandler-Gilbert Community College Associate's Degree,  AAS , Organizational Management , Graduated with Highest Distinction, 3.75 and above 1999  – 2014 Celebrated Graduation on May 9, 2014 Activities and Societies:  Phi Theta Kappa Member Chandler-Gilbert Community College Associate's Degree,  AAS , Organizational Management , Graduated with Highest Distinction, 3.75 and above 1999  – 2014 Celebrated Graduation on May 9, 2014 Activities and Societies:  Phi Theta Kappa Member Chandler-Gilbert Community College Associate's Degree,  AAS , Organizational Management , Graduated with Highest Distinction, 3.75 and above 1999  – 2014 Celebrated Graduation on May 9, 2014 Activities and Societies:  Phi Theta Kappa Member Robert Service Senior High School Diploma,  General Studies; Travel/Hospitality 1984  – 1988 Robert Service Senior High School Diploma,  General Studies; Travel/Hospitality 1984  – 1988 Robert Service Senior High School Diploma,  General Studies; Travel/Hospitality 1984  – 1988 ", "Summary 15+ years Customer Service Support Specialist;  \n \n6+ years working for pharmaceutical industry in various positions, including IT Tech support, Quality Assurance Documentation, and Clinical Affairs controlled documents and forms creation;  \n \n>> Primary role as a Sr. IT Support Specialist providing front-line IT support from configuring desktop / laptops to trouble-shooting software, hardware and printers. \n \n>> Secondary role creating Clinical / Safety Reporting Forms, reviewing / editing clinical protocols and other regulated documentation; participation in review meetings with Clinical, QA, RA, and DM for clinical study design; Specialties:Outstanding Customer Service Support - call center, in person, and via email; \n \nIT Technical Support for hardware and software end-users; \n \nClinical / Safety Report design; document review / formatting; familiarity with FDA and ICH guidelines for clinical studies; Summary 15+ years Customer Service Support Specialist;  \n \n6+ years working for pharmaceutical industry in various positions, including IT Tech support, Quality Assurance Documentation, and Clinical Affairs controlled documents and forms creation;  \n \n>> Primary role as a Sr. IT Support Specialist providing front-line IT support from configuring desktop / laptops to trouble-shooting software, hardware and printers. \n \n>> Secondary role creating Clinical / Safety Reporting Forms, reviewing / editing clinical protocols and other regulated documentation; participation in review meetings with Clinical, QA, RA, and DM for clinical study design; Specialties:Outstanding Customer Service Support - call center, in person, and via email; \n \nIT Technical Support for hardware and software end-users; \n \nClinical / Safety Report design; document review / formatting; familiarity with FDA and ICH guidelines for clinical studies; 15+ years Customer Service Support Specialist;  \n \n6+ years working for pharmaceutical industry in various positions, including IT Tech support, Quality Assurance Documentation, and Clinical Affairs controlled documents and forms creation;  \n \n>> Primary role as a Sr. IT Support Specialist providing front-line IT support from configuring desktop / laptops to trouble-shooting software, hardware and printers. \n \n>> Secondary role creating Clinical / Safety Reporting Forms, reviewing / editing clinical protocols and other regulated documentation; participation in review meetings with Clinical, QA, RA, and DM for clinical study design; Specialties:Outstanding Customer Service Support - call center, in person, and via email; \n \nIT Technical Support for hardware and software end-users; \n \nClinical / Safety Report design; document review / formatting; familiarity with FDA and ICH guidelines for clinical studies; 15+ years Customer Service Support Specialist;  \n \n6+ years working for pharmaceutical industry in various positions, including IT Tech support, Quality Assurance Documentation, and Clinical Affairs controlled documents and forms creation;  \n \n>> Primary role as a Sr. IT Support Specialist providing front-line IT support from configuring desktop / laptops to trouble-shooting software, hardware and printers. \n \n>> Secondary role creating Clinical / Safety Reporting Forms, reviewing / editing clinical protocols and other regulated documentation; participation in review meetings with Clinical, QA, RA, and DM for clinical study design; Specialties:Outstanding Customer Service Support - call center, in person, and via email; \n \nIT Technical Support for hardware and software end-users; \n \nClinical / Safety Report design; document review / formatting; familiarity with FDA and ICH guidelines for clinical studies; Skills Pharmaceutical Industry Quality Assurance Software Documentation Troubleshooting FDA XP Technical Support Clinical Research Validation Databases Call Center Servers Training Time Management Customer Service Strategic Planning Regulatory Affairs Sop Sales Access Business Process See 6+     See less Skills  Pharmaceutical Industry Quality Assurance Software Documentation Troubleshooting FDA XP Technical Support Clinical Research Validation Databases Call Center Servers Training Time Management Customer Service Strategic Planning Regulatory Affairs Sop Sales Access Business Process See 6+     See less Pharmaceutical Industry Quality Assurance Software Documentation Troubleshooting FDA XP Technical Support Clinical Research Validation Databases Call Center Servers Training Time Management Customer Service Strategic Planning Regulatory Affairs Sop Sales Access Business Process See 6+     See less Pharmaceutical Industry Quality Assurance Software Documentation Troubleshooting FDA XP Technical Support Clinical Research Validation Databases Call Center Servers Training Time Management Customer Service Strategic Planning Regulatory Affairs Sop Sales Access Business Process See 6+     See less Honors & Awards ", "Experience Administrative Support Intel Corporation March 2013  – Present (2 years 6 months) Hillsboro, OR Manage Staff member's calendar \nMake travel arrangements and prepare expense reports \nTrack headcount and spending \nSchedule and coordinate logistics for meetings and events \nManage departmental/team recognition \nServe as an information resource/communication channel for policies and procedures \nManage team's SharePoint sites \nPhotography; events and portraits Administrative Assistant Intel Corporation October 2011  –  March 2013  (1 year 6 months) Hillsboro, OR Schedule meetings and events and book conference rooms for over 30 people \nAssist with travel (domestic and international) \nCreate fliers, posters and PowerPoint presentations for various events \nManage space and office moves \nUpdate and maintain rolling calendar, aisle signs, floor map Finance Project Intel Corporation 2012  –  2013  (1 year) Asset Reconciliation Project \n•Align SAP capital data with lab data \n•Work with large amount of data \n•Develop template for data collection \n \nAsset Reuse Project \n•Work with lab owners to create reuse opportunities for Intel assets \n•Identify unused equipment and post it on Asset Reuse Tool (ART) \n•Complete Intel Property Asset Requests (IPAR) \n•Coordinate lab reconfiguration for space efficiency \n•Saved $2 million in Asset Reuse Administrative Support Intel Corporation March 2013  – Present (2 years 6 months) Hillsboro, OR Manage Staff member's calendar \nMake travel arrangements and prepare expense reports \nTrack headcount and spending \nSchedule and coordinate logistics for meetings and events \nManage departmental/team recognition \nServe as an information resource/communication channel for policies and procedures \nManage team's SharePoint sites \nPhotography; events and portraits Administrative Support Intel Corporation March 2013  – Present (2 years 6 months) Hillsboro, OR Manage Staff member's calendar \nMake travel arrangements and prepare expense reports \nTrack headcount and spending \nSchedule and coordinate logistics for meetings and events \nManage departmental/team recognition \nServe as an information resource/communication channel for policies and procedures \nManage team's SharePoint sites \nPhotography; events and portraits Administrative Assistant Intel Corporation October 2011  –  March 2013  (1 year 6 months) Hillsboro, OR Schedule meetings and events and book conference rooms for over 30 people \nAssist with travel (domestic and international) \nCreate fliers, posters and PowerPoint presentations for various events \nManage space and office moves \nUpdate and maintain rolling calendar, aisle signs, floor map Administrative Assistant Intel Corporation October 2011  –  March 2013  (1 year 6 months) Hillsboro, OR Schedule meetings and events and book conference rooms for over 30 people \nAssist with travel (domestic and international) \nCreate fliers, posters and PowerPoint presentations for various events \nManage space and office moves \nUpdate and maintain rolling calendar, aisle signs, floor map Finance Project Intel Corporation 2012  –  2013  (1 year) Asset Reconciliation Project \n•Align SAP capital data with lab data \n•Work with large amount of data \n•Develop template for data collection \n \nAsset Reuse Project \n•Work with lab owners to create reuse opportunities for Intel assets \n•Identify unused equipment and post it on Asset Reuse Tool (ART) \n•Complete Intel Property Asset Requests (IPAR) \n•Coordinate lab reconfiguration for space efficiency \n•Saved $2 million in Asset Reuse Finance Project Intel Corporation 2012  –  2013  (1 year) Asset Reconciliation Project \n•Align SAP capital data with lab data \n•Work with large amount of data \n•Develop template for data collection \n \nAsset Reuse Project \n•Work with lab owners to create reuse opportunities for Intel assets \n•Identify unused equipment and post it on Asset Reuse Tool (ART) \n•Complete Intel Property Asset Requests (IPAR) \n•Coordinate lab reconfiguration for space efficiency \n•Saved $2 million in Asset Reuse Skills Compilers Time Management Microsoft Excel PowerPoint Problem Solving Fast-paced Learning Quickly Positive Personality Calendars Management Office Management Administrative... SharePoint Photography Spreadsheets Invoicing Customer Service Team Building Teamwork See 4+     See less Skills  Compilers Time Management Microsoft Excel PowerPoint Problem Solving Fast-paced Learning Quickly Positive Personality Calendars Management Office Management Administrative... SharePoint Photography Spreadsheets Invoicing Customer Service Team Building Teamwork See 4+     See less Compilers Time Management Microsoft Excel PowerPoint Problem Solving Fast-paced Learning Quickly Positive Personality Calendars Management Office Management Administrative... SharePoint Photography Spreadsheets Invoicing Customer Service Team Building Teamwork See 4+     See less Compilers Time Management Microsoft Excel PowerPoint Problem Solving Fast-paced Learning Quickly Positive Personality Calendars Management Office Management Administrative... SharePoint Photography Spreadsheets Invoicing Customer Service Team Building Teamwork See 4+     See less Education Eastern Oregon University Bachelor of Science (BS),  Accounting 2011  – 2013 David Douglas High School Eastern Oregon University Bachelor of Science (BS),  Accounting 2011  – 2013 Eastern Oregon University Bachelor of Science (BS),  Accounting 2011  – 2013 Eastern Oregon University Bachelor of Science (BS),  Accounting 2011  – 2013 David Douglas High School David Douglas High School David Douglas High School ", "Experience Administrative Support Intel Corporation May 2000  – Present (15 years 4 months) Marketing Associate Kuck & Associates, Inc March 1995  –  May 2000  (5 years 3 months) Account Rep American Software & Hardware Distributors February 1994  –  March 1995  (1 year 2 months) Sales Associate Global Information Systems Technology, Inc. January 1989  –  January 1994  (5 years 1 month) Sales Associate subLOGIC Corporation September 1986  –  November 1988  (2 years 3 months) Administrative Support Intel Corporation May 2000  – Present (15 years 4 months) Administrative Support Intel Corporation May 2000  – Present (15 years 4 months) Marketing Associate Kuck & Associates, Inc March 1995  –  May 2000  (5 years 3 months) Marketing Associate Kuck & Associates, Inc March 1995  –  May 2000  (5 years 3 months) Account Rep American Software & Hardware Distributors February 1994  –  March 1995  (1 year 2 months) Account Rep American Software & Hardware Distributors February 1994  –  March 1995  (1 year 2 months) Sales Associate Global Information Systems Technology, Inc. January 1989  –  January 1994  (5 years 1 month) Sales Associate Global Information Systems Technology, Inc. January 1989  –  January 1994  (5 years 1 month) Sales Associate subLOGIC Corporation September 1986  –  November 1988  (2 years 3 months) Sales Associate subLOGIC Corporation September 1986  –  November 1988  (2 years 3 months) Skills Marketing Sales Product Marketing Microsoft Office Microsoft Excel Marketing Strategy Process Improvement PowerPoint Market Research Skills  Marketing Sales Product Marketing Microsoft Office Microsoft Excel Marketing Strategy Process Improvement PowerPoint Market Research Marketing Sales Product Marketing Microsoft Office Microsoft Excel Marketing Strategy Process Improvement PowerPoint Market Research Marketing Sales Product Marketing Microsoft Office Microsoft Excel Marketing Strategy Process Improvement PowerPoint Market Research ", "Summary Specialties:Administrative support professional with expertise in information management, logistics coordination, business communications, project management and expense tracking. Strong organizational and planning skills. Demonstrated success communicating across all departmental levels, managing multiple priorities and discretely handling confidential information. Works effectively with a team or individually to complete projects on schedule. Summary Specialties:Administrative support professional with expertise in information management, logistics coordination, business communications, project management and expense tracking. Strong organizational and planning skills. Demonstrated success communicating across all departmental levels, managing multiple priorities and discretely handling confidential information. Works effectively with a team or individually to complete projects on schedule. Specialties:Administrative support professional with expertise in information management, logistics coordination, business communications, project management and expense tracking. Strong organizational and planning skills. Demonstrated success communicating across all departmental levels, managing multiple priorities and discretely handling confidential information. Works effectively with a team or individually to complete projects on schedule. Specialties:Administrative support professional with expertise in information management, logistics coordination, business communications, project management and expense tracking. Strong organizational and planning skills. Demonstrated success communicating across all departmental levels, managing multiple priorities and discretely handling confidential information. Works effectively with a team or individually to complete projects on schedule. Experience Sr. Administrative Support Intel Corporation April 2011  – Present (4 years 5 months) Sr. Administrative Support Intel Corporation April 2011  – Present (4 years 5 months) Sr. Administrative Support Intel Corporation April 2011  – Present (4 years 5 months) Education The University of Texas at Austin Bachelor of Science Completed two years The University of Texas at Austin Bachelor of Science Completed two years The University of Texas at Austin Bachelor of Science Completed two years The University of Texas at Austin Bachelor of Science Completed two years ", "Experience Administrative Support Intel Corporation July 2013  – Present (2 years 2 months) Hillsboro, OR Master Data Management DPI Specialty Foods March 2011  – Present (4 years 6 months) Tualatin, OR Forecast Analyst (Wal-Mart Canada & Cherokee Workwear Accounts) Strategic Partners, Inc. April 2008  –  October 2010  (2 years 7 months) Chatsworth, CA Database Manager P3 Corporation October 2007  –  April 2008  (7 months) Valencia, CA Custodial Specialist III Bank of America FKA Countrywide Bank March 2005  –  October 2007  (2 years 8 months) Simi Valley, CA Transcriptionist The Transcription Company July 2004  –  March 2005  (9 months) Burbank, CA Sales Administration Assistant Security of Los Angeles May 2003  –  April 2004  (1 year) Van Nuys, CA Tutor John Muir Elementary School January 2002  –  May 2002  (5 months) Berkeley, CA Administrative Support Intel Corporation July 2013  – Present (2 years 2 months) Hillsboro, OR Administrative Support Intel Corporation July 2013  – Present (2 years 2 months) Hillsboro, OR Master Data Management DPI Specialty Foods March 2011  – Present (4 years 6 months) Tualatin, OR Master Data Management DPI Specialty Foods March 2011  – Present (4 years 6 months) Tualatin, OR Forecast Analyst (Wal-Mart Canada & Cherokee Workwear Accounts) Strategic Partners, Inc. April 2008  –  October 2010  (2 years 7 months) Chatsworth, CA Forecast Analyst (Wal-Mart Canada & Cherokee Workwear Accounts) Strategic Partners, Inc. April 2008  –  October 2010  (2 years 7 months) Chatsworth, CA Database Manager P3 Corporation October 2007  –  April 2008  (7 months) Valencia, CA Database Manager P3 Corporation October 2007  –  April 2008  (7 months) Valencia, CA Custodial Specialist III Bank of America FKA Countrywide Bank March 2005  –  October 2007  (2 years 8 months) Simi Valley, CA Custodial Specialist III Bank of America FKA Countrywide Bank March 2005  –  October 2007  (2 years 8 months) Simi Valley, CA Transcriptionist The Transcription Company July 2004  –  March 2005  (9 months) Burbank, CA Transcriptionist The Transcription Company July 2004  –  March 2005  (9 months) Burbank, CA Sales Administration Assistant Security of Los Angeles May 2003  –  April 2004  (1 year) Van Nuys, CA Sales Administration Assistant Security of Los Angeles May 2003  –  April 2004  (1 year) Van Nuys, CA Tutor John Muir Elementary School January 2002  –  May 2002  (5 months) Berkeley, CA Tutor John Muir Elementary School January 2002  –  May 2002  (5 months) Berkeley, CA Skills Microsoft Excel Forecasting Outlook Databases Access Oracle Lotus Notes Change Management Customer Service Process Improvement Project Management Research Tactical Planning Training Management Product Development See 1+     See less Skills  Microsoft Excel Forecasting Outlook Databases Access Oracle Lotus Notes Change Management Customer Service Process Improvement Project Management Research Tactical Planning Training Management Product Development See 1+     See less Microsoft Excel Forecasting Outlook Databases Access Oracle Lotus Notes Change Management Customer Service Process Improvement Project Management Research Tactical Planning Training Management Product Development See 1+     See less Microsoft Excel Forecasting Outlook Databases Access Oracle Lotus Notes Change Management Customer Service Process Improvement Project Management Research Tactical Planning Training Management Product Development See 1+     See less Education UC Berkeley Bachelor of Arts (B.A.),  Film Studies 2000  – 2003 Activities and Societies:  Event Coordinator--UC Berkeley Superb Sneak Movies ,  Archivist Intern--UC Berkeley Pacific Film Archive UC Berkeley Bachelor of Arts (B.A.),  Film Studies 2000  – 2003 Activities and Societies:  Event Coordinator--UC Berkeley Superb Sneak Movies ,  Archivist Intern--UC Berkeley Pacific Film Archive UC Berkeley Bachelor of Arts (B.A.),  Film Studies 2000  – 2003 Activities and Societies:  Event Coordinator--UC Berkeley Superb Sneak Movies ,  Archivist Intern--UC Berkeley Pacific Film Archive UC Berkeley Bachelor of Arts (B.A.),  Film Studies 2000  – 2003 Activities and Societies:  Event Coordinator--UC Berkeley Superb Sneak Movies ,  Archivist Intern--UC Berkeley Pacific Film Archive ", "Experience Administrative Support Intel Corporation December 2012  – Present (2 years 9 months) champaign, il Administration Morgan Stanley Smith Barney March 2006  –  September 2010  (4 years 7 months) Administrative Support Intel Corporation December 2012  – Present (2 years 9 months) champaign, il Administrative Support Intel Corporation December 2012  – Present (2 years 9 months) champaign, il Administration Morgan Stanley Smith Barney March 2006  –  September 2010  (4 years 7 months) Administration Morgan Stanley Smith Barney March 2006  –  September 2010  (4 years 7 months) Skills Customer Service Sales Microsoft Office Event Planning Sales Management Team Leadership Social Media Negotiation Skills  Customer Service Sales Microsoft Office Event Planning Sales Management Team Leadership Social Media Negotiation Customer Service Sales Microsoft Office Event Planning Sales Management Team Leadership Social Media Negotiation Customer Service Sales Microsoft Office Event Planning Sales Management Team Leadership Social Media Negotiation Education University of Illinois at Urbana-Champaign Bachelors Degree,  Communications 2010  – 2012 College of DuPage Associates of the Arts 2005  – 2010 Activities and Societies:  Academic Honors- Deans List University of Illinois at Urbana-Champaign Bachelors Degree,  Communications 2010  – 2012 University of Illinois at Urbana-Champaign Bachelors Degree,  Communications 2010  – 2012 University of Illinois at Urbana-Champaign Bachelors Degree,  Communications 2010  – 2012 College of DuPage Associates of the Arts 2005  – 2010 Activities and Societies:  Academic Honors- Deans List College of DuPage Associates of the Arts 2005  – 2010 Activities and Societies:  Academic Honors- Deans List College of DuPage Associates of the Arts 2005  – 2010 Activities and Societies:  Academic Honors- Deans List ", "Experience Finance - Logistics Analyst Intel Corporation May 2013  – Present (2 years 4 months) Costa Rica •Responsible of the department’s budget management (POR-Plan),  \n•Perform ROI analysis considering all elements of the supply chain.  \n•Responsible of cost saving analysis for the raw materials and transportation groups for Intel Costa Rica, managing success indicators and proposing dollars per KG reduction ideas.  \n•Manipulate Data into Information in order to draws Conclusions and proposes solutions utilizing modeling tools. \n•In charge of determining causes and possible solutions to diverse situations presented in the different functional areas. Develop solutions and determine the effectiveness of those solutions. Expatriate Tax Services Account Reconciler Intel Corporation September 2012  –  August 2013  (1 year) Costa Rica •Responsible of the monthly maintenance, reconciliation and analysis of Expat Reserve balance sheet account in accordance with GAAP and GLARE. \n•In charge of complete quarterly accruals for the Inpat reserved account  \n•Responsible to answer any question related with the account owned to partners, auditors, others Administrative Support Intel Corporation February 2009  –  May 2013  (4 years 4 months) Costa Rica •Provide support to multiple areas within CR Logistics. Responsible to organize key dept. meetings, manage, purchase and provide office supplies fulfilling with excellence all the department needs. \n•Lead the Department GPTW team responsible for the roadmap and activities for the entire year, achieving all objectives, keeping the budget in control \n•Responsible for the MOSS site administration and migration \n•Responsible of the Purchase Orders support for all functional areas including the system entry and follow up. \n•Became the single point of contact for supplier’s escalation in regards purchasing, payments, events, tools, and others. \n•Develop and manage of the Dept. Balance scorecard, training people and make sure it was successfully deploy, as well as maintained across the year. E-Buss Migration Analyst Oracle July 2007  –  February 2009  (1 year 8 months) Costa Rica •In charge of cost analysis at the time to migrate licenses, calculate credits for support and license assignments.  \n•Drafting of standard contracts that will be used for License Assignments. \n•In charge of disputes generated prior or after booking the contract, be the main contact with the Sales Representative in order to resolve any inquiry regarding the cancellation / replacement procedures of any contract. \n•Responsible to follow up all the issues related to the booking of the contracts Finance - Logistics Analyst Intel Corporation May 2013  – Present (2 years 4 months) Costa Rica •Responsible of the department’s budget management (POR-Plan),  \n•Perform ROI analysis considering all elements of the supply chain.  \n•Responsible of cost saving analysis for the raw materials and transportation groups for Intel Costa Rica, managing success indicators and proposing dollars per KG reduction ideas.  \n•Manipulate Data into Information in order to draws Conclusions and proposes solutions utilizing modeling tools. \n•In charge of determining causes and possible solutions to diverse situations presented in the different functional areas. Develop solutions and determine the effectiveness of those solutions. Finance - Logistics Analyst Intel Corporation May 2013  – Present (2 years 4 months) Costa Rica •Responsible of the department’s budget management (POR-Plan),  \n•Perform ROI analysis considering all elements of the supply chain.  \n•Responsible of cost saving analysis for the raw materials and transportation groups for Intel Costa Rica, managing success indicators and proposing dollars per KG reduction ideas.  \n•Manipulate Data into Information in order to draws Conclusions and proposes solutions utilizing modeling tools. \n•In charge of determining causes and possible solutions to diverse situations presented in the different functional areas. Develop solutions and determine the effectiveness of those solutions. Expatriate Tax Services Account Reconciler Intel Corporation September 2012  –  August 2013  (1 year) Costa Rica •Responsible of the monthly maintenance, reconciliation and analysis of Expat Reserve balance sheet account in accordance with GAAP and GLARE. \n•In charge of complete quarterly accruals for the Inpat reserved account  \n•Responsible to answer any question related with the account owned to partners, auditors, others Expatriate Tax Services Account Reconciler Intel Corporation September 2012  –  August 2013  (1 year) Costa Rica •Responsible of the monthly maintenance, reconciliation and analysis of Expat Reserve balance sheet account in accordance with GAAP and GLARE. \n•In charge of complete quarterly accruals for the Inpat reserved account  \n•Responsible to answer any question related with the account owned to partners, auditors, others Administrative Support Intel Corporation February 2009  –  May 2013  (4 years 4 months) Costa Rica •Provide support to multiple areas within CR Logistics. Responsible to organize key dept. meetings, manage, purchase and provide office supplies fulfilling with excellence all the department needs. \n•Lead the Department GPTW team responsible for the roadmap and activities for the entire year, achieving all objectives, keeping the budget in control \n•Responsible for the MOSS site administration and migration \n•Responsible of the Purchase Orders support for all functional areas including the system entry and follow up. \n•Became the single point of contact for supplier’s escalation in regards purchasing, payments, events, tools, and others. \n•Develop and manage of the Dept. Balance scorecard, training people and make sure it was successfully deploy, as well as maintained across the year. Administrative Support Intel Corporation February 2009  –  May 2013  (4 years 4 months) Costa Rica •Provide support to multiple areas within CR Logistics. Responsible to organize key dept. meetings, manage, purchase and provide office supplies fulfilling with excellence all the department needs. \n•Lead the Department GPTW team responsible for the roadmap and activities for the entire year, achieving all objectives, keeping the budget in control \n•Responsible for the MOSS site administration and migration \n•Responsible of the Purchase Orders support for all functional areas including the system entry and follow up. \n•Became the single point of contact for supplier’s escalation in regards purchasing, payments, events, tools, and others. \n•Develop and manage of the Dept. Balance scorecard, training people and make sure it was successfully deploy, as well as maintained across the year. E-Buss Migration Analyst Oracle July 2007  –  February 2009  (1 year 8 months) Costa Rica •In charge of cost analysis at the time to migrate licenses, calculate credits for support and license assignments.  \n•Drafting of standard contracts that will be used for License Assignments. \n•In charge of disputes generated prior or after booking the contract, be the main contact with the Sales Representative in order to resolve any inquiry regarding the cancellation / replacement procedures of any contract. \n•Responsible to follow up all the issues related to the booking of the contracts E-Buss Migration Analyst Oracle July 2007  –  February 2009  (1 year 8 months) Costa Rica •In charge of cost analysis at the time to migrate licenses, calculate credits for support and license assignments.  \n•Drafting of standard contracts that will be used for License Assignments. \n•In charge of disputes generated prior or after booking the contract, be the main contact with the Sales Representative in order to resolve any inquiry regarding the cancellation / replacement procedures of any contract. \n•Responsible to follow up all the issues related to the booking of the contracts Languages English Full professional proficiency Portuguese Professional working proficiency English Full professional proficiency Portuguese Professional working proficiency English Full professional proficiency Portuguese Professional working proficiency Full professional proficiency Professional working proficiency Skills Business Analysis Requirements Analysis Oracle Requirements Gathering Analytics Business Process Data Analysis Data Mining Communication Skills Proactive self-starter Business Intelligence Finance Supply Chain Training Cross-functional Team... Customer Service Microsoft Excel Process Improvement Six Sigma See 4+     See less Skills  Business Analysis Requirements Analysis Oracle Requirements Gathering Analytics Business Process Data Analysis Data Mining Communication Skills Proactive self-starter Business Intelligence Finance Supply Chain Training Cross-functional Team... Customer Service Microsoft Excel Process Improvement Six Sigma See 4+     See less Business Analysis Requirements Analysis Oracle Requirements Gathering Analytics Business Process Data Analysis Data Mining Communication Skills Proactive self-starter Business Intelligence Finance Supply Chain Training Cross-functional Team... Customer Service Microsoft Excel Process Improvement Six Sigma See 4+     See less Business Analysis Requirements Analysis Oracle Requirements Gathering Analytics Business Process Data Analysis Data Mining Communication Skills Proactive self-starter Business Intelligence Finance Supply Chain Training Cross-functional Team... Customer Service Microsoft Excel Process Improvement Six Sigma See 4+     See less Education Universidad Hispanoamericana (CR) Licentiate degree,  Business Administration and Management , General 2009  – 2013 Universidad Hispanoamericana (CR) Licentiate degree,  Business Administration and Management , General 2009  – 2013 Universidad Hispanoamericana (CR) Licentiate degree,  Business Administration and Management , General 2009  – 2013 Universidad Hispanoamericana (CR) Licentiate degree,  Business Administration and Management , General 2009  – 2013 ", "Summary Highly skilled Executive Assistant; managing any type of office, excellent customer service, top notch with Microsoft office suite, available for work immediately. \n \nKnowledge/Work Experience:  \n•\t21 years of Motion Picture Industry background - 12 years at Universal Studios - Mgr. of Personnel Operations / Secty to Post Production Editors / 9 years Freelance Production Coordinator in the Seattle area \n•\t4 years Sr. Administrative Assistant at Intel Corporation \n•\t5 years Executive Assistant at Spirent Communications \n•\t4 1/2 years Sr. Administrative Assistant/New Hire/Events Coordinator at Microsoft Corp,  \n•\t3 years Executive Assistant, contractor at Microsoft Corp \n•\t8 mos. Executive Assistant, contractor at Amazon.com \n \nExtensive Events Coordinator and Interview Scheduling experience: \n•\tEvent logistics for 300 to 600 people.  \n•\tManaging interview process including sourcing, phone screening, interview and travel arrangements, and assisting new hire with on-boarding process and orientation \n \nSelf-starter, a team player with excellent communication, organizational and interpersonal skills; and the ability to work independently and professionally at all levels. Ability to work effectively under pressure, within tight time constraints, prioritize while multi-tasking, and the aptitude to work independently without significant oversight or instruction to achieve results with a high degree of accuracy and attention to detail. Summary Highly skilled Executive Assistant; managing any type of office, excellent customer service, top notch with Microsoft office suite, available for work immediately. \n \nKnowledge/Work Experience:  \n•\t21 years of Motion Picture Industry background - 12 years at Universal Studios - Mgr. of Personnel Operations / Secty to Post Production Editors / 9 years Freelance Production Coordinator in the Seattle area \n•\t4 years Sr. Administrative Assistant at Intel Corporation \n•\t5 years Executive Assistant at Spirent Communications \n•\t4 1/2 years Sr. Administrative Assistant/New Hire/Events Coordinator at Microsoft Corp,  \n•\t3 years Executive Assistant, contractor at Microsoft Corp \n•\t8 mos. Executive Assistant, contractor at Amazon.com \n \nExtensive Events Coordinator and Interview Scheduling experience: \n•\tEvent logistics for 300 to 600 people.  \n•\tManaging interview process including sourcing, phone screening, interview and travel arrangements, and assisting new hire with on-boarding process and orientation \n \nSelf-starter, a team player with excellent communication, organizational and interpersonal skills; and the ability to work independently and professionally at all levels. Ability to work effectively under pressure, within tight time constraints, prioritize while multi-tasking, and the aptitude to work independently without significant oversight or instruction to achieve results with a high degree of accuracy and attention to detail. Highly skilled Executive Assistant; managing any type of office, excellent customer service, top notch with Microsoft office suite, available for work immediately. \n \nKnowledge/Work Experience:  \n•\t21 years of Motion Picture Industry background - 12 years at Universal Studios - Mgr. of Personnel Operations / Secty to Post Production Editors / 9 years Freelance Production Coordinator in the Seattle area \n•\t4 years Sr. Administrative Assistant at Intel Corporation \n•\t5 years Executive Assistant at Spirent Communications \n•\t4 1/2 years Sr. Administrative Assistant/New Hire/Events Coordinator at Microsoft Corp,  \n•\t3 years Executive Assistant, contractor at Microsoft Corp \n•\t8 mos. Executive Assistant, contractor at Amazon.com \n \nExtensive Events Coordinator and Interview Scheduling experience: \n•\tEvent logistics for 300 to 600 people.  \n•\tManaging interview process including sourcing, phone screening, interview and travel arrangements, and assisting new hire with on-boarding process and orientation \n \nSelf-starter, a team player with excellent communication, organizational and interpersonal skills; and the ability to work independently and professionally at all levels. Ability to work effectively under pressure, within tight time constraints, prioritize while multi-tasking, and the aptitude to work independently without significant oversight or instruction to achieve results with a high degree of accuracy and attention to detail. Highly skilled Executive Assistant; managing any type of office, excellent customer service, top notch with Microsoft office suite, available for work immediately. \n \nKnowledge/Work Experience:  \n•\t21 years of Motion Picture Industry background - 12 years at Universal Studios - Mgr. of Personnel Operations / Secty to Post Production Editors / 9 years Freelance Production Coordinator in the Seattle area \n•\t4 years Sr. Administrative Assistant at Intel Corporation \n•\t5 years Executive Assistant at Spirent Communications \n•\t4 1/2 years Sr. Administrative Assistant/New Hire/Events Coordinator at Microsoft Corp,  \n•\t3 years Executive Assistant, contractor at Microsoft Corp \n•\t8 mos. Executive Assistant, contractor at Amazon.com \n \nExtensive Events Coordinator and Interview Scheduling experience: \n•\tEvent logistics for 300 to 600 people.  \n•\tManaging interview process including sourcing, phone screening, interview and travel arrangements, and assisting new hire with on-boarding process and orientation \n \nSelf-starter, a team player with excellent communication, organizational and interpersonal skills; and the ability to work independently and professionally at all levels. Ability to work effectively under pressure, within tight time constraints, prioritize while multi-tasking, and the aptitude to work independently without significant oversight or instruction to achieve results with a high degree of accuracy and attention to detail. Experience Administrative Assistant to Director of Elections / Secretary of State / Elections Division State of WA July 2014  – Present (1 year 2 months) Olympia, WA tba on responsibilities Executive Assistant Microsoft Corp / Executive Assistant (contractor with EASi) August 2013  –  July 2014  (1 year) Microsoft Corporation, Redmond, WA Provides administrative support to 1 Vice President, 1 General Manager, and 3 Senior Directors plus team administrative support for team of 260 employees. \n•\tComplex Calendar Management with utmost attention to accuracy, detail and allocation of time to promote productivity (day to day, fiscal year planning, and time management across multiple time zones). \no\tAug 2013 thru Mar 2014 – delegate to 5 calendars – 1 VP, 1 GM and 3 Directors. \no\tMar 2014 to preset – delegate to 4 calendars – 1 GM and 3 Directors. \no\tCo-owner to the TwC Security Events Calendar. \n•\tSupporting the rhythm of the business by synchronizing, scheduling and implementing events including team and departmental meetings, offsites, and morale events for both onsite and offsite locations. \n•\tAble to work with all levels of Microsoft employees including Corporate VPs. \n•\tHeadcount Management – assist Operations PM with managing group headcount information, space coordination, new employee setup, and other administrative processes. \n•\tProcurement of goods and services including computer equipment, offices supplies, reference materials, and facility requests, processing of group purchases: equipment requests and invoice processing and services. \n•\tArranging domestic/international travel.  \n•\tManagement of systems, tools, and processes including: assist with team distribution lists; sharing management and content update on the team SharePoint portal site. \n•\tRecommending and driving solutions for departmental operations or processes. \n•\tSpecial projects as assigned. \n•\tManaging confidential information. \n•\tCoordinate with other Executive Assistants for operational excellence. \n. Executive Assistant Amazon.com / Executive Assistant (contractor w/Aerotek) November 2012  –  August 2013  (10 months) Amazon.com, Seattle, WA Provides administrative support to 1 Vice President, 1 Director and 1 Senior Manager plus team administrative support for team of 150 employees WW. \n•\tSupport entire organization comprised of software development, operations, process improvement, and strategic programs (supporting individuals who use PC and Mac technology).  \n•\tHigh volume management of 3 calendars (1 VP, 1 Director and 1 Sr. Manager), including coordinating travel logistics (domestic & international) and expense reports. \n•\tProcess Improvement: developed a ROB Calendar (VP’s Rhythm of Business calendar) that has been recognized as a new approach and has been adopted by other organizations.  \n•\tTeam Morale Project: Email listings, birthdays and Amazon anniversary dates, on-boarding new hires (developed a Welcome letter, with VP and Manager Bios, arriving in new hires inbox their first day at work), photo org chart.  \n•\tSpace Administration: Office Space, Bldg. access requests and conference room reservation permissions in a restricted area. \n•\tEvent Management: Coordinate VP summits, morale events and team meetings. \n•\tHandle special projects as needed. Executive Assistant Microsoft Corp / Executive Assistant (contractor with Robert Half) January 2011  –  November 2012  (1 year 11 months) Microsoft Corp, Redmond, WA Provided administrative support for 3 organizations over a period of 2 ½ years – Senior Finance Manager and team of 38 employees, General Manager of Operations Finance and 57 employees, General Manager of Services/Emerging Solutions plus 1 Business Manager and 125 employees WW. \n•\tComplex Calendar Management with utmost attention to accuracy, detail and allocation of time to promote productivity (day to day, fiscal year planning, and time management across multiple time zones). \n•\tSupporting the rhythm of the business by synchronizing, scheduling and implementing events including team and departmental meetings, offsites, and morale events for both onsite and offsite locations; domestic and international. \n•\tAble to work with all levels of Microsoft employees including Corporate VPs. \n•\tBudget Management - manage the team budget by attending monthly budget meetings, submit re-classes as needed, and assist with budget planning; assist with requests to track or confirm PO processing and payments to our partners/vendors. \n•\tHeadcount Management - manage group headcount information, space coordination, new employee setup, and other administrative processes. \n•\tProcurement of goods and services including computer equipment, offices supplies, reference materials, and facility requests, processing of group purchases: equipment requests and invoice processing and services. \n•\tArranging domestic/international travel.  \n•\tManagement of systems, tools, and processes including: managing team distribution lists; owning management and content update on the team SharePoint portal sites and applicable sub-sites; updating team contact lists. \n•\tRecommending and driving solutions for departmental operations or processes. \n•\tClose cooperation and support with Business Manager on projects. \n•\tSpecial projects as assigned. \n•\tManaging confidential information. \n•\tCoordinate with other Executive Assistants for operational excellence. Sr. Administrative Assistant / New Hire Coordinator Microsoft April 2006  –  September 2010  (4 years 6 months) Microsoft Corp, Issaquah, WA (SAMM site) Provided administrative support to 2 Directors, administrative support to 150 employees in US West Region and Canada, and coordinated on-boarding for over 300 new employees. \n• Supported the Director of US West Region & Director of Canada with a total of 140+ employees.  \n• North American New Hire On-Boarding Coordinator - processing new hires ensuring a smooth onboarding experience.  \n• Logistics coordinator for annual region wide events (600+ attendees) – arranged logistics for 3 offsite locations, per year, including transportation to and from the airports; several morale event choices for morale day. \n• Arranging domestic/international travel.  \n• Complex Calendar Management with utmost attention to accuracy, detail and allocation of time to promote productivity. \n• Coordinating and scheduling internal and external meetings. \n• Communicate and drive all administrative tasks across the group. \n• Volunteer to lead the entire CSS Administrative; coordinating quarterly meetings for the admin team. \n• Budget Management - manage the team budget by attending monthly budget meetings, submit re-classes as needed, and assist with budget planning; assist with requests to track or confirm PO processing and payments to our partners/vendors. \n• Headcount Management - manage group headcount information, space coordination, new employee setup, and other administrative processes. \n• Procurement of goods and services including computer equipment, offices supplies, reference materials, and facility requests, processing of group purchases: equipment requests and invoice processing and services. \n• Space planning – creating space diagram of assigned space; scheduling office moves; collaborating with other admins and facility coordinators during large office moves. \n• Management of systems, tools, and processes including: managing team distribution lists; owning management and content update on the team SharePoint portal sites and applicable sub-sites; updating team contact lists. Executive Assistant Spirent Communications December 2001  –  April 2006  (4 years 5 months) Calabasas, CA Executive Assistant – VP Corporate and VP of Engineering \n•\tSupported Corporate VP and VP of Engineering with a total of 300 employees in Calabasas, CA, Sunnyvale, CA, Honolulu, HI, and Raleigh, NC. \n•\tSpace planning – creating space diagram of assigned space; scheduling office moves for all 4 locations. \n•\tLogistics coordinator for quarterly department meetings and morale events for over 300 employees. \n•\tOwning management and content update on the department SharePoint portal sites. \n•\tPartnered with recruiting on job req’s and scheduling interviews \n•\tComplex Calendar Management with utmost attention to accuracy, detail and allocation of time to promote productivity. \n•\tArranging domestic/international travel.  \n•\tCommunicate and drive all administrative tasks across the group. \n•\tHandle special projects as needed. Sr. Administrative Support Intel Corporation March 1997  –  July 2001  (4 years 5 months) Dupont, WA Senior Administrative Support – Engineering Department \n \n•\tSupported the Engineering Department Management and organization of 100 employees. \n•\tServices & Supply Vendor Fair Committee Chairperson (50+ vendors, 2000+ attendees) – handling logistics with vendors for the fair; delegated responsibility within the volunteer administrative team such as room set up, name tags for vendors, signs for vendors, and any type of electrical hook ups needs to computers, etc.; collaborated with volunteers on creating posters/advertising for the fair within the Intel plant. \n•\tLogistics coordinator for bi-annual division-wide meetings and events (300+ attendees) – handling transportation and catering. \n•\tLogistics coordinator for quarterly department meetings and events (80+ attendees) – assisting putting together all presentations into one PowerPoint presentation; catering; communication on meetings/events with logistics and agenda. \n•\tWeb team leader for Intel's IASC/IRT team managing IASC website – part of an administrative team for the WW Fact Finder – we all shared responsibility for editing, updating, creating new content, training new IRT members, and facilitating bi-weekly web team meetings.  \n•\tRecruiting and staffing coordinator for Engineering Department - opened job requisition, searched resume database, prescreened applicants, coordinated and scheduled interviews including travel – searched for applicants in the Intel data base – scheduled phone and in-person interviews. \n•\tSupervised high school intern and temp admin on various projects.  \n•\tComplex Calendar Management with utmost attention to accuracy, detail and allocation of time to promote productivity (day to day, and time management across multiple time zones). \n•\tArranged domestic and international travel. Production Secretary Various Film Production Companies in Pacific NW 1988  –  1994  (6 years) Greater Seattle Area Manager of Personnel Operations MCA-Universal Studios 1970  –  1982  (12 years) Universal City, CA Administrative Assistant to Director of Elections / Secretary of State / Elections Division State of WA July 2014  – Present (1 year 2 months) Olympia, WA tba on responsibilities Administrative Assistant to Director of Elections / Secretary of State / Elections Division State of WA July 2014  – Present (1 year 2 months) Olympia, WA tba on responsibilities Executive Assistant Microsoft Corp / Executive Assistant (contractor with EASi) August 2013  –  July 2014  (1 year) Microsoft Corporation, Redmond, WA Provides administrative support to 1 Vice President, 1 General Manager, and 3 Senior Directors plus team administrative support for team of 260 employees. \n•\tComplex Calendar Management with utmost attention to accuracy, detail and allocation of time to promote productivity (day to day, fiscal year planning, and time management across multiple time zones). \no\tAug 2013 thru Mar 2014 – delegate to 5 calendars – 1 VP, 1 GM and 3 Directors. \no\tMar 2014 to preset – delegate to 4 calendars – 1 GM and 3 Directors. \no\tCo-owner to the TwC Security Events Calendar. \n•\tSupporting the rhythm of the business by synchronizing, scheduling and implementing events including team and departmental meetings, offsites, and morale events for both onsite and offsite locations. \n•\tAble to work with all levels of Microsoft employees including Corporate VPs. \n•\tHeadcount Management – assist Operations PM with managing group headcount information, space coordination, new employee setup, and other administrative processes. \n•\tProcurement of goods and services including computer equipment, offices supplies, reference materials, and facility requests, processing of group purchases: equipment requests and invoice processing and services. \n•\tArranging domestic/international travel.  \n•\tManagement of systems, tools, and processes including: assist with team distribution lists; sharing management and content update on the team SharePoint portal site. \n•\tRecommending and driving solutions for departmental operations or processes. \n•\tSpecial projects as assigned. \n•\tManaging confidential information. \n•\tCoordinate with other Executive Assistants for operational excellence. \n. Executive Assistant Microsoft Corp / Executive Assistant (contractor with EASi) August 2013  –  July 2014  (1 year) Microsoft Corporation, Redmond, WA Provides administrative support to 1 Vice President, 1 General Manager, and 3 Senior Directors plus team administrative support for team of 260 employees. \n•\tComplex Calendar Management with utmost attention to accuracy, detail and allocation of time to promote productivity (day to day, fiscal year planning, and time management across multiple time zones). \no\tAug 2013 thru Mar 2014 – delegate to 5 calendars – 1 VP, 1 GM and 3 Directors. \no\tMar 2014 to preset – delegate to 4 calendars – 1 GM and 3 Directors. \no\tCo-owner to the TwC Security Events Calendar. \n•\tSupporting the rhythm of the business by synchronizing, scheduling and implementing events including team and departmental meetings, offsites, and morale events for both onsite and offsite locations. \n•\tAble to work with all levels of Microsoft employees including Corporate VPs. \n•\tHeadcount Management – assist Operations PM with managing group headcount information, space coordination, new employee setup, and other administrative processes. \n•\tProcurement of goods and services including computer equipment, offices supplies, reference materials, and facility requests, processing of group purchases: equipment requests and invoice processing and services. \n•\tArranging domestic/international travel.  \n•\tManagement of systems, tools, and processes including: assist with team distribution lists; sharing management and content update on the team SharePoint portal site. \n•\tRecommending and driving solutions for departmental operations or processes. \n•\tSpecial projects as assigned. \n•\tManaging confidential information. \n•\tCoordinate with other Executive Assistants for operational excellence. \n. Executive Assistant Amazon.com / Executive Assistant (contractor w/Aerotek) November 2012  –  August 2013  (10 months) Amazon.com, Seattle, WA Provides administrative support to 1 Vice President, 1 Director and 1 Senior Manager plus team administrative support for team of 150 employees WW. \n•\tSupport entire organization comprised of software development, operations, process improvement, and strategic programs (supporting individuals who use PC and Mac technology).  \n•\tHigh volume management of 3 calendars (1 VP, 1 Director and 1 Sr. Manager), including coordinating travel logistics (domestic & international) and expense reports. \n•\tProcess Improvement: developed a ROB Calendar (VP’s Rhythm of Business calendar) that has been recognized as a new approach and has been adopted by other organizations.  \n•\tTeam Morale Project: Email listings, birthdays and Amazon anniversary dates, on-boarding new hires (developed a Welcome letter, with VP and Manager Bios, arriving in new hires inbox their first day at work), photo org chart.  \n•\tSpace Administration: Office Space, Bldg. access requests and conference room reservation permissions in a restricted area. \n•\tEvent Management: Coordinate VP summits, morale events and team meetings. \n•\tHandle special projects as needed. Executive Assistant Amazon.com / Executive Assistant (contractor w/Aerotek) November 2012  –  August 2013  (10 months) Amazon.com, Seattle, WA Provides administrative support to 1 Vice President, 1 Director and 1 Senior Manager plus team administrative support for team of 150 employees WW. \n•\tSupport entire organization comprised of software development, operations, process improvement, and strategic programs (supporting individuals who use PC and Mac technology).  \n•\tHigh volume management of 3 calendars (1 VP, 1 Director and 1 Sr. Manager), including coordinating travel logistics (domestic & international) and expense reports. \n•\tProcess Improvement: developed a ROB Calendar (VP’s Rhythm of Business calendar) that has been recognized as a new approach and has been adopted by other organizations.  \n•\tTeam Morale Project: Email listings, birthdays and Amazon anniversary dates, on-boarding new hires (developed a Welcome letter, with VP and Manager Bios, arriving in new hires inbox their first day at work), photo org chart.  \n•\tSpace Administration: Office Space, Bldg. access requests and conference room reservation permissions in a restricted area. \n•\tEvent Management: Coordinate VP summits, morale events and team meetings. \n•\tHandle special projects as needed. Executive Assistant Microsoft Corp / Executive Assistant (contractor with Robert Half) January 2011  –  November 2012  (1 year 11 months) Microsoft Corp, Redmond, WA Provided administrative support for 3 organizations over a period of 2 ½ years – Senior Finance Manager and team of 38 employees, General Manager of Operations Finance and 57 employees, General Manager of Services/Emerging Solutions plus 1 Business Manager and 125 employees WW. \n•\tComplex Calendar Management with utmost attention to accuracy, detail and allocation of time to promote productivity (day to day, fiscal year planning, and time management across multiple time zones). \n•\tSupporting the rhythm of the business by synchronizing, scheduling and implementing events including team and departmental meetings, offsites, and morale events for both onsite and offsite locations; domestic and international. \n•\tAble to work with all levels of Microsoft employees including Corporate VPs. \n•\tBudget Management - manage the team budget by attending monthly budget meetings, submit re-classes as needed, and assist with budget planning; assist with requests to track or confirm PO processing and payments to our partners/vendors. \n•\tHeadcount Management - manage group headcount information, space coordination, new employee setup, and other administrative processes. \n•\tProcurement of goods and services including computer equipment, offices supplies, reference materials, and facility requests, processing of group purchases: equipment requests and invoice processing and services. \n•\tArranging domestic/international travel.  \n•\tManagement of systems, tools, and processes including: managing team distribution lists; owning management and content update on the team SharePoint portal sites and applicable sub-sites; updating team contact lists. \n•\tRecommending and driving solutions for departmental operations or processes. \n•\tClose cooperation and support with Business Manager on projects. \n•\tSpecial projects as assigned. \n•\tManaging confidential information. \n•\tCoordinate with other Executive Assistants for operational excellence. Executive Assistant Microsoft Corp / Executive Assistant (contractor with Robert Half) January 2011  –  November 2012  (1 year 11 months) Microsoft Corp, Redmond, WA Provided administrative support for 3 organizations over a period of 2 ½ years – Senior Finance Manager and team of 38 employees, General Manager of Operations Finance and 57 employees, General Manager of Services/Emerging Solutions plus 1 Business Manager and 125 employees WW. \n•\tComplex Calendar Management with utmost attention to accuracy, detail and allocation of time to promote productivity (day to day, fiscal year planning, and time management across multiple time zones). \n•\tSupporting the rhythm of the business by synchronizing, scheduling and implementing events including team and departmental meetings, offsites, and morale events for both onsite and offsite locations; domestic and international. \n•\tAble to work with all levels of Microsoft employees including Corporate VPs. \n•\tBudget Management - manage the team budget by attending monthly budget meetings, submit re-classes as needed, and assist with budget planning; assist with requests to track or confirm PO processing and payments to our partners/vendors. \n•\tHeadcount Management - manage group headcount information, space coordination, new employee setup, and other administrative processes. \n•\tProcurement of goods and services including computer equipment, offices supplies, reference materials, and facility requests, processing of group purchases: equipment requests and invoice processing and services. \n•\tArranging domestic/international travel.  \n•\tManagement of systems, tools, and processes including: managing team distribution lists; owning management and content update on the team SharePoint portal sites and applicable sub-sites; updating team contact lists. \n•\tRecommending and driving solutions for departmental operations or processes. \n•\tClose cooperation and support with Business Manager on projects. \n•\tSpecial projects as assigned. \n•\tManaging confidential information. \n•\tCoordinate with other Executive Assistants for operational excellence. Sr. Administrative Assistant / New Hire Coordinator Microsoft April 2006  –  September 2010  (4 years 6 months) Microsoft Corp, Issaquah, WA (SAMM site) Provided administrative support to 2 Directors, administrative support to 150 employees in US West Region and Canada, and coordinated on-boarding for over 300 new employees. \n• Supported the Director of US West Region & Director of Canada with a total of 140+ employees.  \n• North American New Hire On-Boarding Coordinator - processing new hires ensuring a smooth onboarding experience.  \n• Logistics coordinator for annual region wide events (600+ attendees) – arranged logistics for 3 offsite locations, per year, including transportation to and from the airports; several morale event choices for morale day. \n• Arranging domestic/international travel.  \n• Complex Calendar Management with utmost attention to accuracy, detail and allocation of time to promote productivity. \n• Coordinating and scheduling internal and external meetings. \n• Communicate and drive all administrative tasks across the group. \n• Volunteer to lead the entire CSS Administrative; coordinating quarterly meetings for the admin team. \n• Budget Management - manage the team budget by attending monthly budget meetings, submit re-classes as needed, and assist with budget planning; assist with requests to track or confirm PO processing and payments to our partners/vendors. \n• Headcount Management - manage group headcount information, space coordination, new employee setup, and other administrative processes. \n• Procurement of goods and services including computer equipment, offices supplies, reference materials, and facility requests, processing of group purchases: equipment requests and invoice processing and services. \n• Space planning – creating space diagram of assigned space; scheduling office moves; collaborating with other admins and facility coordinators during large office moves. \n• Management of systems, tools, and processes including: managing team distribution lists; owning management and content update on the team SharePoint portal sites and applicable sub-sites; updating team contact lists. Sr. Administrative Assistant / New Hire Coordinator Microsoft April 2006  –  September 2010  (4 years 6 months) Microsoft Corp, Issaquah, WA (SAMM site) Provided administrative support to 2 Directors, administrative support to 150 employees in US West Region and Canada, and coordinated on-boarding for over 300 new employees. \n• Supported the Director of US West Region & Director of Canada with a total of 140+ employees.  \n• North American New Hire On-Boarding Coordinator - processing new hires ensuring a smooth onboarding experience.  \n• Logistics coordinator for annual region wide events (600+ attendees) – arranged logistics for 3 offsite locations, per year, including transportation to and from the airports; several morale event choices for morale day. \n• Arranging domestic/international travel.  \n• Complex Calendar Management with utmost attention to accuracy, detail and allocation of time to promote productivity. \n• Coordinating and scheduling internal and external meetings. \n• Communicate and drive all administrative tasks across the group. \n• Volunteer to lead the entire CSS Administrative; coordinating quarterly meetings for the admin team. \n• Budget Management - manage the team budget by attending monthly budget meetings, submit re-classes as needed, and assist with budget planning; assist with requests to track or confirm PO processing and payments to our partners/vendors. \n• Headcount Management - manage group headcount information, space coordination, new employee setup, and other administrative processes. \n• Procurement of goods and services including computer equipment, offices supplies, reference materials, and facility requests, processing of group purchases: equipment requests and invoice processing and services. \n• Space planning – creating space diagram of assigned space; scheduling office moves; collaborating with other admins and facility coordinators during large office moves. \n• Management of systems, tools, and processes including: managing team distribution lists; owning management and content update on the team SharePoint portal sites and applicable sub-sites; updating team contact lists. Executive Assistant Spirent Communications December 2001  –  April 2006  (4 years 5 months) Calabasas, CA Executive Assistant – VP Corporate and VP of Engineering \n•\tSupported Corporate VP and VP of Engineering with a total of 300 employees in Calabasas, CA, Sunnyvale, CA, Honolulu, HI, and Raleigh, NC. \n•\tSpace planning – creating space diagram of assigned space; scheduling office moves for all 4 locations. \n•\tLogistics coordinator for quarterly department meetings and morale events for over 300 employees. \n•\tOwning management and content update on the department SharePoint portal sites. \n•\tPartnered with recruiting on job req’s and scheduling interviews \n•\tComplex Calendar Management with utmost attention to accuracy, detail and allocation of time to promote productivity. \n•\tArranging domestic/international travel.  \n•\tCommunicate and drive all administrative tasks across the group. \n•\tHandle special projects as needed. Executive Assistant Spirent Communications December 2001  –  April 2006  (4 years 5 months) Calabasas, CA Executive Assistant – VP Corporate and VP of Engineering \n•\tSupported Corporate VP and VP of Engineering with a total of 300 employees in Calabasas, CA, Sunnyvale, CA, Honolulu, HI, and Raleigh, NC. \n•\tSpace planning – creating space diagram of assigned space; scheduling office moves for all 4 locations. \n•\tLogistics coordinator for quarterly department meetings and morale events for over 300 employees. \n•\tOwning management and content update on the department SharePoint portal sites. \n•\tPartnered with recruiting on job req’s and scheduling interviews \n•\tComplex Calendar Management with utmost attention to accuracy, detail and allocation of time to promote productivity. \n•\tArranging domestic/international travel.  \n•\tCommunicate and drive all administrative tasks across the group. \n•\tHandle special projects as needed. Sr. Administrative Support Intel Corporation March 1997  –  July 2001  (4 years 5 months) Dupont, WA Senior Administrative Support – Engineering Department \n \n•\tSupported the Engineering Department Management and organization of 100 employees. \n•\tServices & Supply Vendor Fair Committee Chairperson (50+ vendors, 2000+ attendees) – handling logistics with vendors for the fair; delegated responsibility within the volunteer administrative team such as room set up, name tags for vendors, signs for vendors, and any type of electrical hook ups needs to computers, etc.; collaborated with volunteers on creating posters/advertising for the fair within the Intel plant. \n•\tLogistics coordinator for bi-annual division-wide meetings and events (300+ attendees) – handling transportation and catering. \n•\tLogistics coordinator for quarterly department meetings and events (80+ attendees) – assisting putting together all presentations into one PowerPoint presentation; catering; communication on meetings/events with logistics and agenda. \n•\tWeb team leader for Intel's IASC/IRT team managing IASC website – part of an administrative team for the WW Fact Finder – we all shared responsibility for editing, updating, creating new content, training new IRT members, and facilitating bi-weekly web team meetings.  \n•\tRecruiting and staffing coordinator for Engineering Department - opened job requisition, searched resume database, prescreened applicants, coordinated and scheduled interviews including travel – searched for applicants in the Intel data base – scheduled phone and in-person interviews. \n•\tSupervised high school intern and temp admin on various projects.  \n•\tComplex Calendar Management with utmost attention to accuracy, detail and allocation of time to promote productivity (day to day, and time management across multiple time zones). \n•\tArranged domestic and international travel. Sr. Administrative Support Intel Corporation March 1997  –  July 2001  (4 years 5 months) Dupont, WA Senior Administrative Support – Engineering Department \n \n•\tSupported the Engineering Department Management and organization of 100 employees. \n•\tServices & Supply Vendor Fair Committee Chairperson (50+ vendors, 2000+ attendees) – handling logistics with vendors for the fair; delegated responsibility within the volunteer administrative team such as room set up, name tags for vendors, signs for vendors, and any type of electrical hook ups needs to computers, etc.; collaborated with volunteers on creating posters/advertising for the fair within the Intel plant. \n•\tLogistics coordinator for bi-annual division-wide meetings and events (300+ attendees) – handling transportation and catering. \n•\tLogistics coordinator for quarterly department meetings and events (80+ attendees) – assisting putting together all presentations into one PowerPoint presentation; catering; communication on meetings/events with logistics and agenda. \n•\tWeb team leader for Intel's IASC/IRT team managing IASC website – part of an administrative team for the WW Fact Finder – we all shared responsibility for editing, updating, creating new content, training new IRT members, and facilitating bi-weekly web team meetings.  \n•\tRecruiting and staffing coordinator for Engineering Department - opened job requisition, searched resume database, prescreened applicants, coordinated and scheduled interviews including travel – searched for applicants in the Intel data base – scheduled phone and in-person interviews. \n•\tSupervised high school intern and temp admin on various projects.  \n•\tComplex Calendar Management with utmost attention to accuracy, detail and allocation of time to promote productivity (day to day, and time management across multiple time zones). \n•\tArranged domestic and international travel. Production Secretary Various Film Production Companies in Pacific NW 1988  –  1994  (6 years) Greater Seattle Area Production Secretary Various Film Production Companies in Pacific NW 1988  –  1994  (6 years) Greater Seattle Area Manager of Personnel Operations MCA-Universal Studios 1970  –  1982  (12 years) Universal City, CA Manager of Personnel Operations MCA-Universal Studios 1970  –  1982  (12 years) Universal City, CA Skills SharePoint Administrative... Management Event Planning Windows Server Recruiting Event Management Training Databases Human Resources Disaster Recovery Active Directory Microsoft Office Vendor Management Microsoft Technologies Process Improvement Events Coordination Cloud Computing Program Management Asset Management Interviews Networking Sourcing Project Planning See 9+     See less Skills  SharePoint Administrative... Management Event Planning Windows Server Recruiting Event Management Training Databases Human Resources Disaster Recovery Active Directory Microsoft Office Vendor Management Microsoft Technologies Process Improvement Events Coordination Cloud Computing Program Management Asset Management Interviews Networking Sourcing Project Planning See 9+     See less SharePoint Administrative... Management Event Planning Windows Server Recruiting Event Management Training Databases Human Resources Disaster Recovery Active Directory Microsoft Office Vendor Management Microsoft Technologies Process Improvement Events Coordination Cloud Computing Program Management Asset Management Interviews Networking Sourcing Project Planning See 9+     See less SharePoint Administrative... Management Event Planning Windows Server Recruiting Event Management Training Databases Human Resources Disaster Recovery Active Directory Microsoft Office Vendor Management Microsoft Technologies Process Improvement Events Coordination Cloud Computing Program Management Asset Management Interviews Networking Sourcing Project Planning See 9+     See less Education James Monroe High School James Monroe High School James Monroe High School James Monroe High School "]}