{"position": "Applications Engineering Manager", "company": "Intel Corporation", "profiles": ["Summary Summary \n•\tOver twenty years of experience spanning all phases of the system development life cycle, including analysis, design, coding, testing, implementation, user training, and documentation. \n•\tManagement of employees and projects, both hardware and software. \n•\tExperience in technical marketing/applications engineering; project management; production support and engineering areas; Legacy and Client-Server systems.  \n•\tSoftware experience includes UNIX, client-server relational database development, MVS mainframes, GUI prototyping, C, C++, and LAN support.  \n•\tWilling to travel. Specialties:Technical Marketing; UNIX; Mainframe; C ; C++ ; GUI; Motif; X-windows; software; XScale; PXA27x; cellular processors; Client/Server; Applications Engineering Summary Summary \n•\tOver twenty years of experience spanning all phases of the system development life cycle, including analysis, design, coding, testing, implementation, user training, and documentation. \n•\tManagement of employees and projects, both hardware and software. \n•\tExperience in technical marketing/applications engineering; project management; production support and engineering areas; Legacy and Client-Server systems.  \n•\tSoftware experience includes UNIX, client-server relational database development, MVS mainframes, GUI prototyping, C, C++, and LAN support.  \n•\tWilling to travel. Specialties:Technical Marketing; UNIX; Mainframe; C ; C++ ; GUI; Motif; X-windows; software; XScale; PXA27x; cellular processors; Client/Server; Applications Engineering Summary \n•\tOver twenty years of experience spanning all phases of the system development life cycle, including analysis, design, coding, testing, implementation, user training, and documentation. \n•\tManagement of employees and projects, both hardware and software. \n•\tExperience in technical marketing/applications engineering; project management; production support and engineering areas; Legacy and Client-Server systems.  \n•\tSoftware experience includes UNIX, client-server relational database development, MVS mainframes, GUI prototyping, C, C++, and LAN support.  \n•\tWilling to travel. Specialties:Technical Marketing; UNIX; Mainframe; C ; C++ ; GUI; Motif; X-windows; software; XScale; PXA27x; cellular processors; Client/Server; Applications Engineering Summary \n•\tOver twenty years of experience spanning all phases of the system development life cycle, including analysis, design, coding, testing, implementation, user training, and documentation. \n•\tManagement of employees and projects, both hardware and software. \n•\tExperience in technical marketing/applications engineering; project management; production support and engineering areas; Legacy and Client-Server systems.  \n•\tSoftware experience includes UNIX, client-server relational database development, MVS mainframes, GUI prototyping, C, C++, and LAN support.  \n•\tWilling to travel. Specialties:Technical Marketing; UNIX; Mainframe; C ; C++ ; GUI; Motif; X-windows; software; XScale; PXA27x; cellular processors; Client/Server; Applications Engineering Experience Data Processing Manager II California Department of Justice March 2015  – Present (6 months) Sacramento, California Area Chief, Offender Registry Applications Section Data Processing Manager II State of California Department of Public Health April 2009  –  March 2015  (6 years) Program Applications Support Section Chief, 23 direct reports. Wrote Budget Change Proposals (BCPs), Feasibility Study Reports (FSRs), evaluated vendor Request For Information (RFI). Performed probationary reviews and annual performance appraisals. Handled employee grievance response coordinating with Office of Labor Relations. Performed workplace violence investigations for office of Health and Safety. Associate Information Systems Analyst State of California Department of Social Services August 2007  –  October 2009  (2 years 3 months) coordinate the acquisition, review , compilation, and tranmission of timely and accurate date for the Temporary Assistance for Needy Families (TANF) and Food Stamps programs as mandated by Federal regulations. Technical Marketing Engineer INTEL - Server Platforms Technical Marketing October 2005  –  January 2007  (1 year 4 months) Managed ESB2 Server Manageability Firmware and Drivers team including TechPubs in US and Taiwan. Coordinated support for Time-to-Market launches for customers Lenovo and Iwill. Managed PowerTools utilities and PECI software support. With his team, supported Manageability customers through development and successful launch of the ESB2 chipset. Worked with other stakeholders, including PDT leader and validation lead to accurately disposition open defects and sightings to reduce validation failures; also worked with ISV Enabling to make sure the ecosystem was enabled. Independently audited the Manageability technical collaterals, finding deficiencies in customer-orderable ESB2 Baseboard Management Controller firmware documents and drove appropriate changes. Provided two weeks on-site customer support for Lenovo in Shenzhen, China, also presenting technical information on BMC firmware and utilities. Worked with Techpubs to make the BMC firmware README files conform to corporate guidelines. Applications Engineering Manager Intel Corporation 1996  –  2007  (11 years) Platform Applications Engineering INTEL Business Client Group July 2004  –  October 2005  (1 year 4 months) Managed the US-based Lakeport SW PAE team and was directly responsible for the Lakeport Validation Customer program. Represented S/W PAE in the Lakeport S/W PDT, ICH7 Forum, iA Marketing Synch, and SW Marketing meetings by providing timely updates to participants and managers. Coordinated efforts across Folsom and Bangalore sites. Supported customers through development, successful launch and production of the 945G chipset. Pro-actively managed customer relationships as well as negotiated with customers to launch with PV14.12 when last minute stop-ship issues were reported, resulting in the first launch driver for a new Intel chipset that does not have any requests for a hotfix at the time of launch (DRA). Engineering Manager INTEL Cellular and Handheld Division July 2000  –  June 2004  (4 years) Managed geographically dispersed teams for Manitoba (PXA800F) Cellular Processor AE and TechPubs areas, with direct reports at San Diego, Folsom, Austin, and Israel sites. Wrote & delivered Focal reviews; mentored and coached individual contributors, establishing development plans. Planned technical collateral delivery and F2F training for customers in PRC and Korea. Organized F2F teambuilders including \"Working With China\" class and cultural profiling exercises to help team members bridge cross-cultural differences between team members and the customer. Balanced workload by delegating collateral generation and PDT representation across multiple team members. Set up custom product categories in QuAD for targeted collateral push to specific customers; established multi-company collaboration method in QuAD. Managed HW Debug Lab, overseeing lab expansion for RF analysis capability. Interviewed and dispositioned internal and external candidates for open job requisitions. Computer Graphics AE Team Lead INTEL Graphics Components Division Marketing 1998  –  1999  (1 year) Team leader for AGP graphics adapter card Compatibility Validation (CV), System Validation (SV) and Design Verification (DV).  \n \nCoordinated staffing the Add-In Card development team. Phone-screened candidates, coordinated on-site interviews, performed technical interviewing and candidate review sessions.  \nGathered requirements for high-volume remote-site manufacturing test, including In-Circuit Test (ICT), Functional Test (FT) and Final Outgoing Quality Monitor (FOQM).  \nFamiliar with Intel DFT, DFM, DFQ&R (DFx) specifications for add-in cards (PCBs).  \n \nEstablished Software Configuration Management (SCM) environment with Microsoft Visual Source Safe (VSS).  \nLed cross-site utilities PDT meeting, assigning tasks and priorites.  \nPerformed diagnostic troubleshooting of customer problems with Intel740(tm) graphics accelerator.  \nCoordinated pre-release of Alpha and Beta software packages. Software Engineer INTEL Mask Operations 1996  –  1998  (2 years) 1996 to 1998:INTEL IMO Automation and Services \nProject leader in charge of Tapeout Next Generation User Interface. Championed proposal for multimedia user interface based on intranet web browser (Netscape 3.0 Gold) and JDBC connectivity to Informix/Illustra object-relational database. Installed and configured Apache HTTP server on UNIX. Implemented internal web site using HTML, JavaScript, Java applets and Abstract Windowing Toolkit (AWT). Maintained an interactive graphics layout editing tool (GUI) consisting of 55,000 LOC of C++ and X-windows/Motif. Programmer SONY 1995  –  1995  (less than a year) 1995:SONY Disc Manufacturing, Springfield, OR  \n•\tDeveloped SNA communication (WAN) software for automated material handling system (MHS) written in C, facilitating remote IBM mainframe running CICS to communicate through LU 6.2 to AIX (UNIX) system running Oracle RDBMS. \n•\tVolunteered for six month temporary assignment at system integrator HK Systems in Salt Lake City. Worked as a member of the team integrating vendor software and hardware for 7X24 factory floor automation. \n•\tInstalled and configured SQL*NET for client/server access to Oracle 7 database using TCP/IP. \n•\tDeveloped PRO*C programs to access Oracle 7 relational database with embedded SQL. \n•\tDeveloped GUI interface using Oracle Forms 4.5 Programmer IBM 1992  –  1994  (2 years) IBM SSD Mask Manufacturing Department \n•\tGroup leader for LAN-based client/server software development project using the DB2/2 relational DBMS engine and C++. Developed customized OS/2 Presentation Manager (PM) GUI front-end using CSet++.  \n•\tInstalled and administered Lotus Notes. Developed prototype workflow application using Lotus Notes.  \n•\tCreated and administered departmental LAN consisting of multiple RISC/System 6000s and PS/2s. Programmer IBM - VLSI Advanced Tools/AD Graphics 1987  –  1992  (5 years) 1990 to 1992: AD Graphics Department \n•\tContributed as a member of a large team project developing and documenting a CUA-compliant client/server OS/2 Presentation Manager graphical user interface program product written in C.  \n•\tCoordinated and customized PVCS configuration management source code control system.  \n•\tAdministered multiple server token-ring LAN running IBM OS/2 LAN Server.  \n1987 to 1990: VLSI Advanced Software Tools Department \nParticipated in the design, development, and technical documentation of a CAD support (design verification) system written in Pascal. Became project technical coordinator, 1989. Programmer IBM 1982  –  1986  (4 years) 1982 to 1986:IBM San Jose Mask Engineering Department \n•\tProject Leader in charge of design, development, coding, testing and documenting a state-of-the art mask data fracturing (tapeout) tool system, which takes GL/1 graphics design data describing logic or memory IC chips, and creates MEBES electron-beam NC data.  \n•\tDeveloped interactive graphics support utilities to support 1X thin-film head mask manufacture.  \n•\tProvided software support for six IBM user locations world-wide.  \n•\tHonored with IBM Corporate Outstanding Technical Achievement Award (OTAA, $10,000), December, 1986. Data Processing Manager II California Department of Justice March 2015  – Present (6 months) Sacramento, California Area Chief, Offender Registry Applications Section Data Processing Manager II California Department of Justice March 2015  – Present (6 months) Sacramento, California Area Chief, Offender Registry Applications Section Data Processing Manager II State of California Department of Public Health April 2009  –  March 2015  (6 years) Program Applications Support Section Chief, 23 direct reports. Wrote Budget Change Proposals (BCPs), Feasibility Study Reports (FSRs), evaluated vendor Request For Information (RFI). Performed probationary reviews and annual performance appraisals. Handled employee grievance response coordinating with Office of Labor Relations. Performed workplace violence investigations for office of Health and Safety. Data Processing Manager II State of California Department of Public Health April 2009  –  March 2015  (6 years) Program Applications Support Section Chief, 23 direct reports. Wrote Budget Change Proposals (BCPs), Feasibility Study Reports (FSRs), evaluated vendor Request For Information (RFI). Performed probationary reviews and annual performance appraisals. Handled employee grievance response coordinating with Office of Labor Relations. Performed workplace violence investigations for office of Health and Safety. Associate Information Systems Analyst State of California Department of Social Services August 2007  –  October 2009  (2 years 3 months) coordinate the acquisition, review , compilation, and tranmission of timely and accurate date for the Temporary Assistance for Needy Families (TANF) and Food Stamps programs as mandated by Federal regulations. Associate Information Systems Analyst State of California Department of Social Services August 2007  –  October 2009  (2 years 3 months) coordinate the acquisition, review , compilation, and tranmission of timely and accurate date for the Temporary Assistance for Needy Families (TANF) and Food Stamps programs as mandated by Federal regulations. Technical Marketing Engineer INTEL - Server Platforms Technical Marketing October 2005  –  January 2007  (1 year 4 months) Managed ESB2 Server Manageability Firmware and Drivers team including TechPubs in US and Taiwan. Coordinated support for Time-to-Market launches for customers Lenovo and Iwill. Managed PowerTools utilities and PECI software support. With his team, supported Manageability customers through development and successful launch of the ESB2 chipset. Worked with other stakeholders, including PDT leader and validation lead to accurately disposition open defects and sightings to reduce validation failures; also worked with ISV Enabling to make sure the ecosystem was enabled. Independently audited the Manageability technical collaterals, finding deficiencies in customer-orderable ESB2 Baseboard Management Controller firmware documents and drove appropriate changes. Provided two weeks on-site customer support for Lenovo in Shenzhen, China, also presenting technical information on BMC firmware and utilities. Worked with Techpubs to make the BMC firmware README files conform to corporate guidelines. Technical Marketing Engineer INTEL - Server Platforms Technical Marketing October 2005  –  January 2007  (1 year 4 months) Managed ESB2 Server Manageability Firmware and Drivers team including TechPubs in US and Taiwan. Coordinated support for Time-to-Market launches for customers Lenovo and Iwill. Managed PowerTools utilities and PECI software support. With his team, supported Manageability customers through development and successful launch of the ESB2 chipset. Worked with other stakeholders, including PDT leader and validation lead to accurately disposition open defects and sightings to reduce validation failures; also worked with ISV Enabling to make sure the ecosystem was enabled. Independently audited the Manageability technical collaterals, finding deficiencies in customer-orderable ESB2 Baseboard Management Controller firmware documents and drove appropriate changes. Provided two weeks on-site customer support for Lenovo in Shenzhen, China, also presenting technical information on BMC firmware and utilities. Worked with Techpubs to make the BMC firmware README files conform to corporate guidelines. Applications Engineering Manager Intel Corporation 1996  –  2007  (11 years) Applications Engineering Manager Intel Corporation 1996  –  2007  (11 years) Platform Applications Engineering INTEL Business Client Group July 2004  –  October 2005  (1 year 4 months) Managed the US-based Lakeport SW PAE team and was directly responsible for the Lakeport Validation Customer program. Represented S/W PAE in the Lakeport S/W PDT, ICH7 Forum, iA Marketing Synch, and SW Marketing meetings by providing timely updates to participants and managers. Coordinated efforts across Folsom and Bangalore sites. Supported customers through development, successful launch and production of the 945G chipset. Pro-actively managed customer relationships as well as negotiated with customers to launch with PV14.12 when last minute stop-ship issues were reported, resulting in the first launch driver for a new Intel chipset that does not have any requests for a hotfix at the time of launch (DRA). Platform Applications Engineering INTEL Business Client Group July 2004  –  October 2005  (1 year 4 months) Managed the US-based Lakeport SW PAE team and was directly responsible for the Lakeport Validation Customer program. Represented S/W PAE in the Lakeport S/W PDT, ICH7 Forum, iA Marketing Synch, and SW Marketing meetings by providing timely updates to participants and managers. Coordinated efforts across Folsom and Bangalore sites. Supported customers through development, successful launch and production of the 945G chipset. Pro-actively managed customer relationships as well as negotiated with customers to launch with PV14.12 when last minute stop-ship issues were reported, resulting in the first launch driver for a new Intel chipset that does not have any requests for a hotfix at the time of launch (DRA). Engineering Manager INTEL Cellular and Handheld Division July 2000  –  June 2004  (4 years) Managed geographically dispersed teams for Manitoba (PXA800F) Cellular Processor AE and TechPubs areas, with direct reports at San Diego, Folsom, Austin, and Israel sites. Wrote & delivered Focal reviews; mentored and coached individual contributors, establishing development plans. Planned technical collateral delivery and F2F training for customers in PRC and Korea. Organized F2F teambuilders including \"Working With China\" class and cultural profiling exercises to help team members bridge cross-cultural differences between team members and the customer. Balanced workload by delegating collateral generation and PDT representation across multiple team members. Set up custom product categories in QuAD for targeted collateral push to specific customers; established multi-company collaboration method in QuAD. Managed HW Debug Lab, overseeing lab expansion for RF analysis capability. Interviewed and dispositioned internal and external candidates for open job requisitions. Engineering Manager INTEL Cellular and Handheld Division July 2000  –  June 2004  (4 years) Managed geographically dispersed teams for Manitoba (PXA800F) Cellular Processor AE and TechPubs areas, with direct reports at San Diego, Folsom, Austin, and Israel sites. Wrote & delivered Focal reviews; mentored and coached individual contributors, establishing development plans. Planned technical collateral delivery and F2F training for customers in PRC and Korea. Organized F2F teambuilders including \"Working With China\" class and cultural profiling exercises to help team members bridge cross-cultural differences between team members and the customer. Balanced workload by delegating collateral generation and PDT representation across multiple team members. Set up custom product categories in QuAD for targeted collateral push to specific customers; established multi-company collaboration method in QuAD. Managed HW Debug Lab, overseeing lab expansion for RF analysis capability. Interviewed and dispositioned internal and external candidates for open job requisitions. Computer Graphics AE Team Lead INTEL Graphics Components Division Marketing 1998  –  1999  (1 year) Team leader for AGP graphics adapter card Compatibility Validation (CV), System Validation (SV) and Design Verification (DV).  \n \nCoordinated staffing the Add-In Card development team. Phone-screened candidates, coordinated on-site interviews, performed technical interviewing and candidate review sessions.  \nGathered requirements for high-volume remote-site manufacturing test, including In-Circuit Test (ICT), Functional Test (FT) and Final Outgoing Quality Monitor (FOQM).  \nFamiliar with Intel DFT, DFM, DFQ&R (DFx) specifications for add-in cards (PCBs).  \n \nEstablished Software Configuration Management (SCM) environment with Microsoft Visual Source Safe (VSS).  \nLed cross-site utilities PDT meeting, assigning tasks and priorites.  \nPerformed diagnostic troubleshooting of customer problems with Intel740(tm) graphics accelerator.  \nCoordinated pre-release of Alpha and Beta software packages. Computer Graphics AE Team Lead INTEL Graphics Components Division Marketing 1998  –  1999  (1 year) Team leader for AGP graphics adapter card Compatibility Validation (CV), System Validation (SV) and Design Verification (DV).  \n \nCoordinated staffing the Add-In Card development team. Phone-screened candidates, coordinated on-site interviews, performed technical interviewing and candidate review sessions.  \nGathered requirements for high-volume remote-site manufacturing test, including In-Circuit Test (ICT), Functional Test (FT) and Final Outgoing Quality Monitor (FOQM).  \nFamiliar with Intel DFT, DFM, DFQ&R (DFx) specifications for add-in cards (PCBs).  \n \nEstablished Software Configuration Management (SCM) environment with Microsoft Visual Source Safe (VSS).  \nLed cross-site utilities PDT meeting, assigning tasks and priorites.  \nPerformed diagnostic troubleshooting of customer problems with Intel740(tm) graphics accelerator.  \nCoordinated pre-release of Alpha and Beta software packages. Software Engineer INTEL Mask Operations 1996  –  1998  (2 years) 1996 to 1998:INTEL IMO Automation and Services \nProject leader in charge of Tapeout Next Generation User Interface. Championed proposal for multimedia user interface based on intranet web browser (Netscape 3.0 Gold) and JDBC connectivity to Informix/Illustra object-relational database. Installed and configured Apache HTTP server on UNIX. Implemented internal web site using HTML, JavaScript, Java applets and Abstract Windowing Toolkit (AWT). Maintained an interactive graphics layout editing tool (GUI) consisting of 55,000 LOC of C++ and X-windows/Motif. Software Engineer INTEL Mask Operations 1996  –  1998  (2 years) 1996 to 1998:INTEL IMO Automation and Services \nProject leader in charge of Tapeout Next Generation User Interface. Championed proposal for multimedia user interface based on intranet web browser (Netscape 3.0 Gold) and JDBC connectivity to Informix/Illustra object-relational database. Installed and configured Apache HTTP server on UNIX. Implemented internal web site using HTML, JavaScript, Java applets and Abstract Windowing Toolkit (AWT). Maintained an interactive graphics layout editing tool (GUI) consisting of 55,000 LOC of C++ and X-windows/Motif. Programmer SONY 1995  –  1995  (less than a year) 1995:SONY Disc Manufacturing, Springfield, OR  \n•\tDeveloped SNA communication (WAN) software for automated material handling system (MHS) written in C, facilitating remote IBM mainframe running CICS to communicate through LU 6.2 to AIX (UNIX) system running Oracle RDBMS. \n•\tVolunteered for six month temporary assignment at system integrator HK Systems in Salt Lake City. Worked as a member of the team integrating vendor software and hardware for 7X24 factory floor automation. \n•\tInstalled and configured SQL*NET for client/server access to Oracle 7 database using TCP/IP. \n•\tDeveloped PRO*C programs to access Oracle 7 relational database with embedded SQL. \n•\tDeveloped GUI interface using Oracle Forms 4.5 Programmer SONY 1995  –  1995  (less than a year) 1995:SONY Disc Manufacturing, Springfield, OR  \n•\tDeveloped SNA communication (WAN) software for automated material handling system (MHS) written in C, facilitating remote IBM mainframe running CICS to communicate through LU 6.2 to AIX (UNIX) system running Oracle RDBMS. \n•\tVolunteered for six month temporary assignment at system integrator HK Systems in Salt Lake City. Worked as a member of the team integrating vendor software and hardware for 7X24 factory floor automation. \n•\tInstalled and configured SQL*NET for client/server access to Oracle 7 database using TCP/IP. \n•\tDeveloped PRO*C programs to access Oracle 7 relational database with embedded SQL. \n•\tDeveloped GUI interface using Oracle Forms 4.5 Programmer IBM 1992  –  1994  (2 years) IBM SSD Mask Manufacturing Department \n•\tGroup leader for LAN-based client/server software development project using the DB2/2 relational DBMS engine and C++. Developed customized OS/2 Presentation Manager (PM) GUI front-end using CSet++.  \n•\tInstalled and administered Lotus Notes. Developed prototype workflow application using Lotus Notes.  \n•\tCreated and administered departmental LAN consisting of multiple RISC/System 6000s and PS/2s. Programmer IBM 1992  –  1994  (2 years) IBM SSD Mask Manufacturing Department \n•\tGroup leader for LAN-based client/server software development project using the DB2/2 relational DBMS engine and C++. Developed customized OS/2 Presentation Manager (PM) GUI front-end using CSet++.  \n•\tInstalled and administered Lotus Notes. Developed prototype workflow application using Lotus Notes.  \n•\tCreated and administered departmental LAN consisting of multiple RISC/System 6000s and PS/2s. Programmer IBM - VLSI Advanced Tools/AD Graphics 1987  –  1992  (5 years) 1990 to 1992: AD Graphics Department \n•\tContributed as a member of a large team project developing and documenting a CUA-compliant client/server OS/2 Presentation Manager graphical user interface program product written in C.  \n•\tCoordinated and customized PVCS configuration management source code control system.  \n•\tAdministered multiple server token-ring LAN running IBM OS/2 LAN Server.  \n1987 to 1990: VLSI Advanced Software Tools Department \nParticipated in the design, development, and technical documentation of a CAD support (design verification) system written in Pascal. Became project technical coordinator, 1989. Programmer IBM - VLSI Advanced Tools/AD Graphics 1987  –  1992  (5 years) 1990 to 1992: AD Graphics Department \n•\tContributed as a member of a large team project developing and documenting a CUA-compliant client/server OS/2 Presentation Manager graphical user interface program product written in C.  \n•\tCoordinated and customized PVCS configuration management source code control system.  \n•\tAdministered multiple server token-ring LAN running IBM OS/2 LAN Server.  \n1987 to 1990: VLSI Advanced Software Tools Department \nParticipated in the design, development, and technical documentation of a CAD support (design verification) system written in Pascal. Became project technical coordinator, 1989. Programmer IBM 1982  –  1986  (4 years) 1982 to 1986:IBM San Jose Mask Engineering Department \n•\tProject Leader in charge of design, development, coding, testing and documenting a state-of-the art mask data fracturing (tapeout) tool system, which takes GL/1 graphics design data describing logic or memory IC chips, and creates MEBES electron-beam NC data.  \n•\tDeveloped interactive graphics support utilities to support 1X thin-film head mask manufacture.  \n•\tProvided software support for six IBM user locations world-wide.  \n•\tHonored with IBM Corporate Outstanding Technical Achievement Award (OTAA, $10,000), December, 1986. Programmer IBM 1982  –  1986  (4 years) 1982 to 1986:IBM San Jose Mask Engineering Department \n•\tProject Leader in charge of design, development, coding, testing and documenting a state-of-the art mask data fracturing (tapeout) tool system, which takes GL/1 graphics design data describing logic or memory IC chips, and creates MEBES electron-beam NC data.  \n•\tDeveloped interactive graphics support utilities to support 1X thin-film head mask manufacture.  \n•\tProvided software support for six IBM user locations world-wide.  \n•\tHonored with IBM Corporate Outstanding Technical Achievement Award (OTAA, $10,000), December, 1986. Skills Unix Skills  Unix Unix Unix Education State University of New York at Binghamton Bachelors,  Mathematics New York State Regents Scholarship University of Arizona MBA,  Management State University of New York at Binghamton Bachelors,  Mathematics New York State Regents Scholarship State University of New York at Binghamton Bachelors,  Mathematics New York State Regents Scholarship State University of New York at Binghamton Bachelors,  Mathematics New York State Regents Scholarship University of Arizona MBA,  Management University of Arizona MBA,  Management University of Arizona MBA,  Management ", "Summary Specialties:SoC • System-on-Chip • Microcontrollers • Software • Hardware • Digital Design • Engineering managemen • System architecture • 8051 • ARM • XScale • Battery Powered/Handheld Devices • Low Power System Architecture • Digital Control Logic • Hardware/Software Troubleshooting • Systems BOM Cost Analysis • Firmware/Device Driver Development • Instrumentation & Control • Communications • C/Assembly Programming • Real Time Operating Systems (RTOS) Summary Specialties:SoC • System-on-Chip • Microcontrollers • Software • Hardware • Digital Design • Engineering managemen • System architecture • 8051 • ARM • XScale • Battery Powered/Handheld Devices • Low Power System Architecture • Digital Control Logic • Hardware/Software Troubleshooting • Systems BOM Cost Analysis • Firmware/Device Driver Development • Instrumentation & Control • Communications • C/Assembly Programming • Real Time Operating Systems (RTOS) Specialties:SoC • System-on-Chip • Microcontrollers • Software • Hardware • Digital Design • Engineering managemen • System architecture • 8051 • ARM • XScale • Battery Powered/Handheld Devices • Low Power System Architecture • Digital Control Logic • Hardware/Software Troubleshooting • Systems BOM Cost Analysis • Firmware/Device Driver Development • Instrumentation & Control • Communications • C/Assembly Programming • Real Time Operating Systems (RTOS) Specialties:SoC • System-on-Chip • Microcontrollers • Software • Hardware • Digital Design • Engineering managemen • System architecture • 8051 • ARM • XScale • Battery Powered/Handheld Devices • Low Power System Architecture • Digital Control Logic • Hardware/Software Troubleshooting • Systems BOM Cost Analysis • Firmware/Device Driver Development • Instrumentation & Control • Communications • C/Assembly Programming • Real Time Operating Systems (RTOS) Experience Pre-silicon Platform Integration Lead Intel Corporation January 2015  – Present (8 months) SoC Firmware Architect Intel Corporation October 2011  –  December 2014  (3 years 3 months) Sr. Program Manager/Analyst Intel Corporation November 2010  –  October 2011  (1 year) Electrical Engineering Manager National Presort May 2009  –  November 2010  (1 year 7 months) Independent Consultant Asterisc Solutions August 2008  –  May 2009  (10 months) Marketing Manager Marvell Semiconductor November 2006  –  December 2007  (1 year 2 months) Program Manager, Cell Phone Reference Designs Intel Corporation May 2006  –  November 2006  (7 months) Worldwide Applications Engineering Manager Intel Corporation May 2005  –  May 2006  (1 year 1 month) Worldwide Applications Engineering Manager Sharp Microelectronics of the Americas August 1997  –  May 2005  (7 years 10 months) Firmware Engineer Interdigital Communications Corporation November 1996  –  August 1997  (10 months) Firmware Engineer Vicon Industries, Inc. August 1989  –  November 1996  (7 years 4 months) Firmware Engineer Fire Research Corp May 1981  –  August 1989  (8 years 4 months) Pre-silicon Platform Integration Lead Intel Corporation January 2015  – Present (8 months) Pre-silicon Platform Integration Lead Intel Corporation January 2015  – Present (8 months) SoC Firmware Architect Intel Corporation October 2011  –  December 2014  (3 years 3 months) SoC Firmware Architect Intel Corporation October 2011  –  December 2014  (3 years 3 months) Sr. Program Manager/Analyst Intel Corporation November 2010  –  October 2011  (1 year) Sr. Program Manager/Analyst Intel Corporation November 2010  –  October 2011  (1 year) Electrical Engineering Manager National Presort May 2009  –  November 2010  (1 year 7 months) Electrical Engineering Manager National Presort May 2009  –  November 2010  (1 year 7 months) Independent Consultant Asterisc Solutions August 2008  –  May 2009  (10 months) Independent Consultant Asterisc Solutions August 2008  –  May 2009  (10 months) Marketing Manager Marvell Semiconductor November 2006  –  December 2007  (1 year 2 months) Marketing Manager Marvell Semiconductor November 2006  –  December 2007  (1 year 2 months) Program Manager, Cell Phone Reference Designs Intel Corporation May 2006  –  November 2006  (7 months) Program Manager, Cell Phone Reference Designs Intel Corporation May 2006  –  November 2006  (7 months) Worldwide Applications Engineering Manager Intel Corporation May 2005  –  May 2006  (1 year 1 month) Worldwide Applications Engineering Manager Intel Corporation May 2005  –  May 2006  (1 year 1 month) Worldwide Applications Engineering Manager Sharp Microelectronics of the Americas August 1997  –  May 2005  (7 years 10 months) Worldwide Applications Engineering Manager Sharp Microelectronics of the Americas August 1997  –  May 2005  (7 years 10 months) Firmware Engineer Interdigital Communications Corporation November 1996  –  August 1997  (10 months) Firmware Engineer Interdigital Communications Corporation November 1996  –  August 1997  (10 months) Firmware Engineer Vicon Industries, Inc. August 1989  –  November 1996  (7 years 4 months) Firmware Engineer Vicon Industries, Inc. August 1989  –  November 1996  (7 years 4 months) Firmware Engineer Fire Research Corp May 1981  –  August 1989  (8 years 4 months) Firmware Engineer Fire Research Corp May 1981  –  August 1989  (8 years 4 months) Skills Semiconductors SoC ARM Embedded Systems ASIC Embedded Software Debugging IC Firmware Device Drivers Processors Technical Marketing Microcontrollers Intel 8051 Microcontroller Program Management Project Management CPU Systems Engineering Platform Architecture Electrical Engineering RTOS Hardware Architecture Digital Control Instrumentation Semiconductor Industry Wireless Engineering Management Product Management Consumer Electronics PCB design System Architecture System Design FPGA Microprocessors Product Development Management Hardware Cross-functional Team... Electronics Product Marketing See 26+     See less Skills  Semiconductors SoC ARM Embedded Systems ASIC Embedded Software Debugging IC Firmware Device Drivers Processors Technical Marketing Microcontrollers Intel 8051 Microcontroller Program Management Project Management CPU Systems Engineering Platform Architecture Electrical Engineering RTOS Hardware Architecture Digital Control Instrumentation Semiconductor Industry Wireless Engineering Management Product Management Consumer Electronics PCB design System Architecture System Design FPGA Microprocessors Product Development Management Hardware Cross-functional Team... Electronics Product Marketing See 26+     See less Semiconductors SoC ARM Embedded Systems ASIC Embedded Software Debugging IC Firmware Device Drivers Processors Technical Marketing Microcontrollers Intel 8051 Microcontroller Program Management Project Management CPU Systems Engineering Platform Architecture Electrical Engineering RTOS Hardware Architecture Digital Control Instrumentation Semiconductor Industry Wireless Engineering Management Product Management Consumer Electronics PCB design System Architecture System Design FPGA Microprocessors Product Development Management Hardware Cross-functional Team... Electronics Product Marketing See 26+     See less Semiconductors SoC ARM Embedded Systems ASIC Embedded Software Debugging IC Firmware Device Drivers Processors Technical Marketing Microcontrollers Intel 8051 Microcontroller Program Management Project Management CPU Systems Engineering Platform Architecture Electrical Engineering RTOS Hardware Architecture Digital Control Instrumentation Semiconductor Industry Wireless Engineering Management Product Management Consumer Electronics PCB design System Architecture System Design FPGA Microprocessors Product Development Management Hardware Cross-functional Team... Electronics Product Marketing See 26+     See less ", "Experience Applications Engineering Manager Intel Corporation September 1990  – Present (25 years) Applications Engineering Manager Intel Corporation September 1990  – Present (25 years) Applications Engineering Manager Intel Corporation September 1990  – Present (25 years) Education University of Phoenix Master of Business Administration (MBA),  Business Administration and Management , General 1996  – 1998 California State University-Sacramento Bachelor of Science (BS),  Computer Engineering 1987  – 1990 University of Phoenix Master of Business Administration (MBA),  Business Administration and Management , General 1996  – 1998 University of Phoenix Master of Business Administration (MBA),  Business Administration and Management , General 1996  – 1998 University of Phoenix Master of Business Administration (MBA),  Business Administration and Management , General 1996  – 1998 California State University-Sacramento Bachelor of Science (BS),  Computer Engineering 1987  – 1990 California State University-Sacramento Bachelor of Science (BS),  Computer Engineering 1987  – 1990 California State University-Sacramento Bachelor of Science (BS),  Computer Engineering 1987  – 1990 ", "Summary As a Professional Engineer with training in electrical an computer engineering, I have found that completely understanding an existing system is required before designing a replacement. \n \nMy background includes over 20 years of working at Intel in microcontroller system applications, field training and product validation. I have been involved in projects from microwatts to megawats and DC to light, covering electronics, power, audio, HVAC and computer systems. \n \nEnergy costs are a big portion of many budgets. I am focuing in this area and using my broad engineering background to save clients 10% to 20% on their electric bills. \nI am also assisting small businesses and non-profits with computer sytem architecture, ensuring they get a system optimized for their business needs and budget. \n \nSpecialties: In additon to Computer Hardware I have also worked on embedded software, analog design projects, RF projects, and audio/stage projects. My current focus is Energy Conservation. Summary As a Professional Engineer with training in electrical an computer engineering, I have found that completely understanding an existing system is required before designing a replacement. \n \nMy background includes over 20 years of working at Intel in microcontroller system applications, field training and product validation. I have been involved in projects from microwatts to megawats and DC to light, covering electronics, power, audio, HVAC and computer systems. \n \nEnergy costs are a big portion of many budgets. I am focuing in this area and using my broad engineering background to save clients 10% to 20% on their electric bills. \nI am also assisting small businesses and non-profits with computer sytem architecture, ensuring they get a system optimized for their business needs and budget. \n \nSpecialties: In additon to Computer Hardware I have also worked on embedded software, analog design projects, RF projects, and audio/stage projects. My current focus is Energy Conservation. As a Professional Engineer with training in electrical an computer engineering, I have found that completely understanding an existing system is required before designing a replacement. \n \nMy background includes over 20 years of working at Intel in microcontroller system applications, field training and product validation. I have been involved in projects from microwatts to megawats and DC to light, covering electronics, power, audio, HVAC and computer systems. \n \nEnergy costs are a big portion of many budgets. I am focuing in this area and using my broad engineering background to save clients 10% to 20% on their electric bills. \nI am also assisting small businesses and non-profits with computer sytem architecture, ensuring they get a system optimized for their business needs and budget. \n \nSpecialties: In additon to Computer Hardware I have also worked on embedded software, analog design projects, RF projects, and audio/stage projects. My current focus is Energy Conservation. As a Professional Engineer with training in electrical an computer engineering, I have found that completely understanding an existing system is required before designing a replacement. \n \nMy background includes over 20 years of working at Intel in microcontroller system applications, field training and product validation. I have been involved in projects from microwatts to megawats and DC to light, covering electronics, power, audio, HVAC and computer systems. \n \nEnergy costs are a big portion of many budgets. I am focuing in this area and using my broad engineering background to save clients 10% to 20% on their electric bills. \nI am also assisting small businesses and non-profits with computer sytem architecture, ensuring they get a system optimized for their business needs and budget. \n \nSpecialties: In additon to Computer Hardware I have also worked on embedded software, analog design projects, RF projects, and audio/stage projects. My current focus is Energy Conservation. Skills Embedded Systems Semiconductors ASIC Analog Hardware Architecture System Design System Architecture Electrical Engineering Manufacturing Microcontrollers Analog Circuit Design Testing Engineering SoC Embedded Software Systems Engineering Ethernet Product Marketing See 3+     See less Skills  Embedded Systems Semiconductors ASIC Analog Hardware Architecture System Design System Architecture Electrical Engineering Manufacturing Microcontrollers Analog Circuit Design Testing Engineering SoC Embedded Software Systems Engineering Ethernet Product Marketing See 3+     See less Embedded Systems Semiconductors ASIC Analog Hardware Architecture System Design System Architecture Electrical Engineering Manufacturing Microcontrollers Analog Circuit Design Testing Engineering SoC Embedded Software Systems Engineering Ethernet Product Marketing See 3+     See less Embedded Systems Semiconductors ASIC Analog Hardware Architecture System Design System Architecture Electrical Engineering Manufacturing Microcontrollers Analog Circuit Design Testing Engineering SoC Embedded Software Systems Engineering Ethernet Product Marketing See 3+     See less Honors & Awards ", "Experience Intel(R) Many Integrated Core Architecture Technical Marketing Manager Intel Corporation June 2011  – Present (4 years 3 months) Technical Marketing Lead, Intel(R) Many Integrated Core Architecture Intel Corporation September 2010  –  July 2011  (11 months) Platform Application Engineering Manager Intel Corporation February 2006  –  October 2010  (4 years 9 months) Platform Applications Engineer/Technical Marketing Engineer Intel Corporation May 1994  –  February 2006  (11 years 10 months) Intel(R) Many Integrated Core Architecture Technical Marketing Manager Intel Corporation June 2011  – Present (4 years 3 months) Intel(R) Many Integrated Core Architecture Technical Marketing Manager Intel Corporation June 2011  – Present (4 years 3 months) Technical Marketing Lead, Intel(R) Many Integrated Core Architecture Intel Corporation September 2010  –  July 2011  (11 months) Technical Marketing Lead, Intel(R) Many Integrated Core Architecture Intel Corporation September 2010  –  July 2011  (11 months) Platform Application Engineering Manager Intel Corporation February 2006  –  October 2010  (4 years 9 months) Platform Application Engineering Manager Intel Corporation February 2006  –  October 2010  (4 years 9 months) Platform Applications Engineer/Technical Marketing Engineer Intel Corporation May 1994  –  February 2006  (11 years 10 months) Platform Applications Engineer/Technical Marketing Engineer Intel Corporation May 1994  –  February 2006  (11 years 10 months) Skills Intel Processors Semiconductors Technical Marketing Microprocessors Computer Architecture Semiconductor Industry Hardware Architecture Firmware X86 Analog High Performance... Management Leadership Development Organizational... System Architecture Platform Architecture See 2+     See less Skills  Intel Processors Semiconductors Technical Marketing Microprocessors Computer Architecture Semiconductor Industry Hardware Architecture Firmware X86 Analog High Performance... Management Leadership Development Organizational... System Architecture Platform Architecture See 2+     See less Intel Processors Semiconductors Technical Marketing Microprocessors Computer Architecture Semiconductor Industry Hardware Architecture Firmware X86 Analog High Performance... Management Leadership Development Organizational... System Architecture Platform Architecture See 2+     See less Intel Processors Semiconductors Technical Marketing Microprocessors Computer Architecture Semiconductor Industry Hardware Architecture Firmware X86 Analog High Performance... Management Leadership Development Organizational... System Architecture Platform Architecture See 2+     See less Education University of Michigan BSEE, BSCE,  Electrical Engineering ,  Computer Engineering 1989  – 1994 University of Michigan BSEE, BSCE,  Electrical Engineering ,  Computer Engineering 1989  – 1994 University of Michigan BSEE, BSCE,  Electrical Engineering ,  Computer Engineering 1989  – 1994 University of Michigan BSEE, BSCE,  Electrical Engineering ,  Computer Engineering 1989  – 1994 ", "Experience Platform Applications Engineering Manager Intel Corporation January 2008  – Present (7 years 8 months) Folsom, CA Hardware Engineer Intel Corporation January 1999  –  January 2008  (9 years 1 month) Folsom CA Graphics Hardware Applications Engineer Intel Corporation January 1998  –  January 1999  (1 year 1 month) Folsom, CA Test Software Engineer Packard Bell NEC August 1996  –  January 1998  (1 year 6 months) Platform Applications Engineering Manager Intel Corporation January 2008  – Present (7 years 8 months) Folsom, CA Platform Applications Engineering Manager Intel Corporation January 2008  – Present (7 years 8 months) Folsom, CA Hardware Engineer Intel Corporation January 1999  –  January 2008  (9 years 1 month) Folsom CA Hardware Engineer Intel Corporation January 1999  –  January 2008  (9 years 1 month) Folsom CA Graphics Hardware Applications Engineer Intel Corporation January 1998  –  January 1999  (1 year 1 month) Folsom, CA Graphics Hardware Applications Engineer Intel Corporation January 1998  –  January 1999  (1 year 1 month) Folsom, CA Test Software Engineer Packard Bell NEC August 1996  –  January 1998  (1 year 6 months) Test Software Engineer Packard Bell NEC August 1996  –  January 1998  (1 year 6 months) ", "Summary I am a technology leader with 20+ years of industry experience and entrepreneurial spirit, specializing in bootstrapping technology start-ups. Summary I am a technology leader with 20+ years of industry experience and entrepreneurial spirit, specializing in bootstrapping technology start-ups. I am a technology leader with 20+ years of industry experience and entrepreneurial spirit, specializing in bootstrapping technology start-ups. I am a technology leader with 20+ years of industry experience and entrepreneurial spirit, specializing in bootstrapping technology start-ups. Experience Co-founder and CTO doctoc, engineered for efficiency November 2014  – Present (10 months) Phoenix, Arizona Area CEO MightyMob, love your mobile January 2010  – Present (5 years 8 months) Phoenix, Arizona Area Cloud Marketing Manager Intel Corporation August 2010  –  December 2012  (2 years 5 months) Applications Engineering Manager Intel Corporation August 2008  –  August 2010  (2 years 1 month) Principal Applications Engineer Microchip Technology August 2006  –  August 2008  (2 years 1 month) Owner Netematics Systems August 2005  –  August 2006  (1 year 1 month) Marketing Manager and SW Architect Corrent Corporation January 2001  –  August 2005  (4 years 8 months) Sr. Software Engineer Intel Corporation August 1995  –  December 2000  (5 years 5 months) Software Engineer CEDAR August 1992  –  July 1995  (3 years) Co-founder and CTO doctoc, engineered for efficiency November 2014  – Present (10 months) Phoenix, Arizona Area Co-founder and CTO doctoc, engineered for efficiency November 2014  – Present (10 months) Phoenix, Arizona Area CEO MightyMob, love your mobile January 2010  – Present (5 years 8 months) Phoenix, Arizona Area CEO MightyMob, love your mobile January 2010  – Present (5 years 8 months) Phoenix, Arizona Area Cloud Marketing Manager Intel Corporation August 2010  –  December 2012  (2 years 5 months) Cloud Marketing Manager Intel Corporation August 2010  –  December 2012  (2 years 5 months) Applications Engineering Manager Intel Corporation August 2008  –  August 2010  (2 years 1 month) Applications Engineering Manager Intel Corporation August 2008  –  August 2010  (2 years 1 month) Principal Applications Engineer Microchip Technology August 2006  –  August 2008  (2 years 1 month) Principal Applications Engineer Microchip Technology August 2006  –  August 2008  (2 years 1 month) Owner Netematics Systems August 2005  –  August 2006  (1 year 1 month) Owner Netematics Systems August 2005  –  August 2006  (1 year 1 month) Marketing Manager and SW Architect Corrent Corporation January 2001  –  August 2005  (4 years 8 months) Marketing Manager and SW Architect Corrent Corporation January 2001  –  August 2005  (4 years 8 months) Sr. Software Engineer Intel Corporation August 1995  –  December 2000  (5 years 5 months) Sr. Software Engineer Intel Corporation August 1995  –  December 2000  (5 years 5 months) Software Engineer CEDAR August 1992  –  July 1995  (3 years) Software Engineer CEDAR August 1992  –  July 1995  (3 years) Languages Hindi Gujarati Hindi Gujarati Hindi Gujarati Skills Product Marketing Storage Device Drivers Software Development Embedded Systems Program Management Entrepreneurship Software Engineering Business Development Management Operating Systems Leadership Product Management Creative Direction Networking Cloud Computing Marketing Wireless SaaS Mobile Devices Enterprise Software Selling Strategic Partnerships Go-to-market Strategy Strategy Start-ups Mobile Applications System Architecture Firmware Cross-functional Team... Competitive Analysis Telecommunications iOS Development See 18+     See less Skills  Product Marketing Storage Device Drivers Software Development Embedded Systems Program Management Entrepreneurship Software Engineering Business Development Management Operating Systems Leadership Product Management Creative Direction Networking Cloud Computing Marketing Wireless SaaS Mobile Devices Enterprise Software Selling Strategic Partnerships Go-to-market Strategy Strategy Start-ups Mobile Applications System Architecture Firmware Cross-functional Team... Competitive Analysis Telecommunications iOS Development See 18+     See less Product Marketing Storage Device Drivers Software Development Embedded Systems Program Management Entrepreneurship Software Engineering Business Development Management Operating Systems Leadership Product Management Creative Direction Networking Cloud Computing Marketing Wireless SaaS Mobile Devices Enterprise Software Selling Strategic Partnerships Go-to-market Strategy Strategy Start-ups Mobile Applications System Architecture Firmware Cross-functional Team... Competitive Analysis Telecommunications iOS Development See 18+     See less Product Marketing Storage Device Drivers Software Development Embedded Systems Program Management Entrepreneurship Software Engineering Business Development Management Operating Systems Leadership Product Management Creative Direction Networking Cloud Computing Marketing Wireless SaaS Mobile Devices Enterprise Software Selling Strategic Partnerships Go-to-market Strategy Strategy Start-ups Mobile Applications System Architecture Firmware Cross-functional Team... Competitive Analysis Telecommunications iOS Development See 18+     See less Education State University of New York at Buffalo M.S. January 1992  – August 1995 Gujarat University Bachelor of Engineering (B.E.) 1988  – 1991 State University of New York at Buffalo M.S. January 1992  – August 1995 State University of New York at Buffalo M.S. January 1992  – August 1995 State University of New York at Buffalo M.S. January 1992  – August 1995 Gujarat University Bachelor of Engineering (B.E.) 1988  – 1991 Gujarat University Bachelor of Engineering (B.E.) 1988  – 1991 Gujarat University Bachelor of Engineering (B.E.) 1988  – 1991 Honors & Awards Additional Honors & Awards 2 US Patents. Additional Honors & Awards 2 US Patents. Additional Honors & Awards 2 US Patents. Additional Honors & Awards 2 US Patents. ", "Summary Applications Engineering/Technical Marketing Summary Applications Engineering/Technical Marketing Applications Engineering/Technical Marketing Applications Engineering/Technical Marketing Experience Field Applications Engineer Micron Technology June 2013  –  February 2015  (1 year 9 months) San Jose, CA Supported networking and server companies in memory and storage specification, design, debug, and post-production field issues. Product portfolio included DRAM components and modules, NAND and NOR Flash components, and SSDs. Marketing Manager Intel Corporation 2006  –  2007  (1 year) Synchronized program messaging and schedules with Intel’s worldwide hardware and software partners to ensure timely adoption and effective promotion of the Intel Viiv™ technology digital home platform. Edited partners’ marketing collaterals and end-user documentation for content and format conformance to Intel branding requirements. Market Research Specialist Intel Corporation 2006  –  2006  (less than a year) Researched and documented market requirements for a barcode reader in the new Mobile Clinical Assistant healthcare-specific tablet PC platform. Developed market research proposals specifying and justifying further exploration of the barcode reader feature. Program Manager Intel Corporation 2005  –  2006  (1 year) Negotiated and tracked schedule and deliverables for both hardware and software elements of a new Mobile Clinical Assistant healthcare-specific tablet PC reference platform. Applications Engineering Manager Intel Corporation 2005  –  2005  (less than a year) Managed a six-person team responsible for enabling key third party vendor components for Intel mobile computing platforms. Directly managed four engineers and matrix-managed two others. Applications Engineer Intel Corporation 2000  –  2005  (5 years) Owned Intel’s relationships with four mobile graphics controller vendors (ATI, NVIDIA, S3 Graphics, and XGI/Trident Microsystems) and with the Mobile Connectivity division of Texas Instruments. Worked with vendors’ upper management for strategic roadmap alignment, and with their technical staff for enabling support. Instituted new, more stringent procedures for exchanging confidential information with vendors, and influenced other Intel divisions to do the same. Managed one engineer and a technician. CPU Program Manager Intel Corporation 1999  –  2000  (1 year) Coordinated all aspects of program management for the development, introduction, and production of a new CPU. ASIC Design Engineering Manager Intel Corporation 1998  –  1999  (1 year) Managed a team of five engineers responsible for microarchitecting, implementing, documenting, and debugging mobile chipset components. Sr. ASIC Design Engineer Intel Corporation 1993  –  1998  (5 years) Microarchitected, implemented, documented, and debugged mobile chipset components. Sr. Design Engineer Intel Corporation 1992  –  1993  (1 year) Validated full-chip schematics; managed simulation regressions. Technical Marketing Engineer Intel Corporation 1989  –  1992  (3 years) Wrote and maintained CPU data sheets and errata documents, as well as technical white papers and magazine articles. Developed and presented technical courses for the worldwide sales force. Resolved customer issues by directing debug efforts and developing workarounds. Led trade show demo teams. Field Applications Engineer Micron Technology June 2013  –  February 2015  (1 year 9 months) San Jose, CA Supported networking and server companies in memory and storage specification, design, debug, and post-production field issues. Product portfolio included DRAM components and modules, NAND and NOR Flash components, and SSDs. Field Applications Engineer Micron Technology June 2013  –  February 2015  (1 year 9 months) San Jose, CA Supported networking and server companies in memory and storage specification, design, debug, and post-production field issues. Product portfolio included DRAM components and modules, NAND and NOR Flash components, and SSDs. Marketing Manager Intel Corporation 2006  –  2007  (1 year) Synchronized program messaging and schedules with Intel’s worldwide hardware and software partners to ensure timely adoption and effective promotion of the Intel Viiv™ technology digital home platform. Edited partners’ marketing collaterals and end-user documentation for content and format conformance to Intel branding requirements. Marketing Manager Intel Corporation 2006  –  2007  (1 year) Synchronized program messaging and schedules with Intel’s worldwide hardware and software partners to ensure timely adoption and effective promotion of the Intel Viiv™ technology digital home platform. Edited partners’ marketing collaterals and end-user documentation for content and format conformance to Intel branding requirements. Market Research Specialist Intel Corporation 2006  –  2006  (less than a year) Researched and documented market requirements for a barcode reader in the new Mobile Clinical Assistant healthcare-specific tablet PC platform. Developed market research proposals specifying and justifying further exploration of the barcode reader feature. Market Research Specialist Intel Corporation 2006  –  2006  (less than a year) Researched and documented market requirements for a barcode reader in the new Mobile Clinical Assistant healthcare-specific tablet PC platform. Developed market research proposals specifying and justifying further exploration of the barcode reader feature. Program Manager Intel Corporation 2005  –  2006  (1 year) Negotiated and tracked schedule and deliverables for both hardware and software elements of a new Mobile Clinical Assistant healthcare-specific tablet PC reference platform. Program Manager Intel Corporation 2005  –  2006  (1 year) Negotiated and tracked schedule and deliverables for both hardware and software elements of a new Mobile Clinical Assistant healthcare-specific tablet PC reference platform. Applications Engineering Manager Intel Corporation 2005  –  2005  (less than a year) Managed a six-person team responsible for enabling key third party vendor components for Intel mobile computing platforms. Directly managed four engineers and matrix-managed two others. Applications Engineering Manager Intel Corporation 2005  –  2005  (less than a year) Managed a six-person team responsible for enabling key third party vendor components for Intel mobile computing platforms. Directly managed four engineers and matrix-managed two others. Applications Engineer Intel Corporation 2000  –  2005  (5 years) Owned Intel’s relationships with four mobile graphics controller vendors (ATI, NVIDIA, S3 Graphics, and XGI/Trident Microsystems) and with the Mobile Connectivity division of Texas Instruments. Worked with vendors’ upper management for strategic roadmap alignment, and with their technical staff for enabling support. Instituted new, more stringent procedures for exchanging confidential information with vendors, and influenced other Intel divisions to do the same. Managed one engineer and a technician. Applications Engineer Intel Corporation 2000  –  2005  (5 years) Owned Intel’s relationships with four mobile graphics controller vendors (ATI, NVIDIA, S3 Graphics, and XGI/Trident Microsystems) and with the Mobile Connectivity division of Texas Instruments. Worked with vendors’ upper management for strategic roadmap alignment, and with their technical staff for enabling support. Instituted new, more stringent procedures for exchanging confidential information with vendors, and influenced other Intel divisions to do the same. Managed one engineer and a technician. CPU Program Manager Intel Corporation 1999  –  2000  (1 year) Coordinated all aspects of program management for the development, introduction, and production of a new CPU. CPU Program Manager Intel Corporation 1999  –  2000  (1 year) Coordinated all aspects of program management for the development, introduction, and production of a new CPU. ASIC Design Engineering Manager Intel Corporation 1998  –  1999  (1 year) Managed a team of five engineers responsible for microarchitecting, implementing, documenting, and debugging mobile chipset components. ASIC Design Engineering Manager Intel Corporation 1998  –  1999  (1 year) Managed a team of five engineers responsible for microarchitecting, implementing, documenting, and debugging mobile chipset components. Sr. ASIC Design Engineer Intel Corporation 1993  –  1998  (5 years) Microarchitected, implemented, documented, and debugged mobile chipset components. Sr. ASIC Design Engineer Intel Corporation 1993  –  1998  (5 years) Microarchitected, implemented, documented, and debugged mobile chipset components. Sr. Design Engineer Intel Corporation 1992  –  1993  (1 year) Validated full-chip schematics; managed simulation regressions. Sr. Design Engineer Intel Corporation 1992  –  1993  (1 year) Validated full-chip schematics; managed simulation regressions. Technical Marketing Engineer Intel Corporation 1989  –  1992  (3 years) Wrote and maintained CPU data sheets and errata documents, as well as technical white papers and magazine articles. Developed and presented technical courses for the worldwide sales force. Resolved customer issues by directing debug efforts and developing workarounds. Led trade show demo teams. Technical Marketing Engineer Intel Corporation 1989  –  1992  (3 years) Wrote and maintained CPU data sheets and errata documents, as well as technical white papers and magazine articles. Developed and presented technical courses for the worldwide sales force. Resolved customer issues by directing debug efforts and developing workarounds. Led trade show demo teams. Skills Semiconductors Technical Marketing Program Management Project Management Third Party Vendor... Technical Editing Technical Writing Technical Documentation MS Project IC Debugging ASIC Cross-functional Team... Simulations Product Marketing Strategy Processors Intel Product Management Hardware See 5+     See less Skills  Semiconductors Technical Marketing Program Management Project Management Third Party Vendor... Technical Editing Technical Writing Technical Documentation MS Project IC Debugging ASIC Cross-functional Team... Simulations Product Marketing Strategy Processors Intel Product Management Hardware See 5+     See less Semiconductors Technical Marketing Program Management Project Management Third Party Vendor... Technical Editing Technical Writing Technical Documentation MS Project IC Debugging ASIC Cross-functional Team... Simulations Product Marketing Strategy Processors Intel Product Management Hardware See 5+     See less Semiconductors Technical Marketing Program Management Project Management Third Party Vendor... Technical Editing Technical Writing Technical Documentation MS Project IC Debugging ASIC Cross-functional Team... Simulations Product Marketing Strategy Processors Intel Product Management Hardware See 5+     See less Education Massachusetts Institute of Technology M.S.,  Electrical Engineering 1985  – 1989 M.S. and E.Eng. in Electrical Engineering. Harvard University A.B.,  Biochemistry 1981  – 1985 A.B. magna cum laude in Biochemistry. John F. Kennedy High School Massachusetts Institute of Technology M.S.,  Electrical Engineering 1985  – 1989 M.S. and E.Eng. in Electrical Engineering. Massachusetts Institute of Technology M.S.,  Electrical Engineering 1985  – 1989 M.S. and E.Eng. in Electrical Engineering. Massachusetts Institute of Technology M.S.,  Electrical Engineering 1985  – 1989 M.S. and E.Eng. in Electrical Engineering. Harvard University A.B.,  Biochemistry 1981  – 1985 A.B. magna cum laude in Biochemistry. Harvard University A.B.,  Biochemistry 1981  – 1985 A.B. magna cum laude in Biochemistry. Harvard University A.B.,  Biochemistry 1981  – 1985 A.B. magna cum laude in Biochemistry. John F. Kennedy High School John F. Kennedy High School John F. Kennedy High School Honors & Awards Additional Honors & Awards Inventor on 7 US patents; primary inventor on 2. \nPublished author in Dr. Dobb's Journal and Intel Solutions Magazine. Additional Honors & Awards Inventor on 7 US patents; primary inventor on 2. \nPublished author in Dr. Dobb's Journal and Intel Solutions Magazine. Additional Honors & Awards Inventor on 7 US patents; primary inventor on 2. \nPublished author in Dr. Dobb's Journal and Intel Solutions Magazine. Additional Honors & Awards Inventor on 7 US patents; primary inventor on 2. \nPublished author in Dr. Dobb's Journal and Intel Solutions Magazine. ", "Skills Ethernet Embedded Systems Hardware Architecture Intel Product Management Semiconductors Product Marketing Program Management Cross-functional Team... Telecommunications Debugging Software Development Processors Computer Architecture Testing Software Engineering Device Drivers Wireless FPGA IC Embedded Software Technical Marketing Product Development Microprocessors Competitive Analysis PCIe ASIC Analog Circuit Design System Architecture See 14+     See less Skills  Ethernet Embedded Systems Hardware Architecture Intel Product Management Semiconductors Product Marketing Program Management Cross-functional Team... Telecommunications Debugging Software Development Processors Computer Architecture Testing Software Engineering Device Drivers Wireless FPGA IC Embedded Software Technical Marketing Product Development Microprocessors Competitive Analysis PCIe ASIC Analog Circuit Design System Architecture See 14+     See less Ethernet Embedded Systems Hardware Architecture Intel Product Management Semiconductors Product Marketing Program Management Cross-functional Team... Telecommunications Debugging Software Development Processors Computer Architecture Testing Software Engineering Device Drivers Wireless FPGA IC Embedded Software Technical Marketing Product Development Microprocessors Competitive Analysis PCIe ASIC Analog Circuit Design System Architecture See 14+     See less Ethernet Embedded Systems Hardware Architecture Intel Product Management Semiconductors Product Marketing Program Management Cross-functional Team... Telecommunications Debugging Software Development Processors Computer Architecture Testing Software Engineering Device Drivers Wireless FPGA IC Embedded Software Technical Marketing Product Development Microprocessors Competitive Analysis PCIe ASIC Analog Circuit Design System Architecture See 14+     See less ", "Languages Tamil Hindi Tamil Hindi Tamil Hindi Skills IC Semiconductors Intel SoC ASIC Verilog Debugging Mixed Signal Processors Testing Technical Marketing Embedded Systems Flash Memory Analog Hardware Architecture Semiconductor Industry See 1+     See less Skills  IC Semiconductors Intel SoC ASIC Verilog Debugging Mixed Signal Processors Testing Technical Marketing Embedded Systems Flash Memory Analog Hardware Architecture Semiconductor Industry See 1+     See less IC Semiconductors Intel SoC ASIC Verilog Debugging Mixed Signal Processors Testing Technical Marketing Embedded Systems Flash Memory Analog Hardware Architecture Semiconductor Industry See 1+     See less IC Semiconductors Intel SoC ASIC Verilog Debugging Mixed Signal Processors Testing Technical Marketing Embedded Systems Flash Memory Analog Hardware Architecture Semiconductor Industry See 1+     See less ", "Experience Server and Data Center Solutions Director Intel June 2006  – Present (9 years 3 months) Manager of Distributed Solutions Intel 2002  –  2004  (2 years) Technical Consulting and Engineering Manager Intel May 2000  –  June 2002  (2 years 2 months) Applications Engineering Manager Intel Corporation 1996  –  1999  (3 years) Server and Data Center Solutions Director Intel June 2006  – Present (9 years 3 months) Server and Data Center Solutions Director Intel June 2006  – Present (9 years 3 months) Manager of Distributed Solutions Intel 2002  –  2004  (2 years) Manager of Distributed Solutions Intel 2002  –  2004  (2 years) Technical Consulting and Engineering Manager Intel May 2000  –  June 2002  (2 years 2 months) Technical Consulting and Engineering Manager Intel May 2000  –  June 2002  (2 years 2 months) Applications Engineering Manager Intel Corporation 1996  –  1999  (3 years) Applications Engineering Manager Intel Corporation 1996  –  1999  (3 years) Skills Virtualization Data Center Cloud Computing Management High Performance... Intel Team Management Storage Semiconductors Scripting Product Management Skills  Virtualization Data Center Cloud Computing Management High Performance... Intel Team Management Storage Semiconductors Scripting Product Management Virtualization Data Center Cloud Computing Management High Performance... Intel Team Management Storage Semiconductors Scripting Product Management Virtualization Data Center Cloud Computing Management High Performance... Intel Team Management Storage Semiconductors Scripting Product Management Education University of Kansas Bachelors of Science,  Electrical and Computer Engineering 1983  – 1987 University of Kansas Bachelors of Science,  Electrical and Computer Engineering 1983  – 1987 University of Kansas Bachelors of Science,  Electrical and Computer Engineering 1983  – 1987 University of Kansas Bachelors of Science,  Electrical and Computer Engineering 1983  – 1987 ", "Experience District Sales Manager - OEM MNC Account Intel Corporation June 2014  – Present (1 year 3 months) Taipei City, Taiwan Applications Engineering Manager Intel Corporation September 2011  –  May 2014  (2 years 9 months) Taipei, Taiwan Technical Marketing Engineer Intel April 2005  –  September 2011  (6 years 6 months) Portland, Oregon Area and Taipei, Taiwan Microprocessor Validation Engineer Intel Corporation February 2001  –  March 2005  (4 years 2 months) Portland, Oregon Area District Sales Manager - OEM MNC Account Intel Corporation June 2014  – Present (1 year 3 months) Taipei City, Taiwan District Sales Manager - OEM MNC Account Intel Corporation June 2014  – Present (1 year 3 months) Taipei City, Taiwan Applications Engineering Manager Intel Corporation September 2011  –  May 2014  (2 years 9 months) Taipei, Taiwan Applications Engineering Manager Intel Corporation September 2011  –  May 2014  (2 years 9 months) Taipei, Taiwan Technical Marketing Engineer Intel April 2005  –  September 2011  (6 years 6 months) Portland, Oregon Area and Taipei, Taiwan Technical Marketing Engineer Intel April 2005  –  September 2011  (6 years 6 months) Portland, Oregon Area and Taipei, Taiwan Microprocessor Validation Engineer Intel Corporation February 2001  –  March 2005  (4 years 2 months) Portland, Oregon Area Microprocessor Validation Engineer Intel Corporation February 2001  –  March 2005  (4 years 2 months) Portland, Oregon Area Education University of Illinois at Urbana-Champaign 1998  – 2000 University of Illinois at Urbana-Champaign 1998  – 2000 University of Illinois at Urbana-Champaign 1998  – 2000 University of Illinois at Urbana-Champaign 1998  – 2000 ", "Summary Senior-level Software Professional (MSEE), successful in multiple roles as developer, manager, virtual team lead, senior architect, and customer solutions. As a serial “intrapreneur”, I have a strong track record pursuing & developing new ideas, and building successful, high output execution teams. I have extensive experience with Web-based & native client apps, and OS Internals for Windows & Android. I bring engineering breadth & depth, industry & business awareness, influencing skills, personal integrity, and strong focus on user experience. I ask questions, love to learn, incorporate new ideas, and solve difficult problems. I enjoy working in small teams, using Agile processes to build and improve the user experience. \n \nSpecialties: Client/server software architecture & development, Agile processes, global engineering management, virtual team leadership, in-depth knowledge of client hardware platforms, OEM/ODM and ISV ecosystem enabling, customer solutions engineering, UI/UX definition, program management. Summary Senior-level Software Professional (MSEE), successful in multiple roles as developer, manager, virtual team lead, senior architect, and customer solutions. As a serial “intrapreneur”, I have a strong track record pursuing & developing new ideas, and building successful, high output execution teams. I have extensive experience with Web-based & native client apps, and OS Internals for Windows & Android. I bring engineering breadth & depth, industry & business awareness, influencing skills, personal integrity, and strong focus on user experience. I ask questions, love to learn, incorporate new ideas, and solve difficult problems. I enjoy working in small teams, using Agile processes to build and improve the user experience. \n \nSpecialties: Client/server software architecture & development, Agile processes, global engineering management, virtual team leadership, in-depth knowledge of client hardware platforms, OEM/ODM and ISV ecosystem enabling, customer solutions engineering, UI/UX definition, program management. Senior-level Software Professional (MSEE), successful in multiple roles as developer, manager, virtual team lead, senior architect, and customer solutions. As a serial “intrapreneur”, I have a strong track record pursuing & developing new ideas, and building successful, high output execution teams. I have extensive experience with Web-based & native client apps, and OS Internals for Windows & Android. I bring engineering breadth & depth, industry & business awareness, influencing skills, personal integrity, and strong focus on user experience. I ask questions, love to learn, incorporate new ideas, and solve difficult problems. I enjoy working in small teams, using Agile processes to build and improve the user experience. \n \nSpecialties: Client/server software architecture & development, Agile processes, global engineering management, virtual team leadership, in-depth knowledge of client hardware platforms, OEM/ODM and ISV ecosystem enabling, customer solutions engineering, UI/UX definition, program management. Senior-level Software Professional (MSEE), successful in multiple roles as developer, manager, virtual team lead, senior architect, and customer solutions. As a serial “intrapreneur”, I have a strong track record pursuing & developing new ideas, and building successful, high output execution teams. I have extensive experience with Web-based & native client apps, and OS Internals for Windows & Android. I bring engineering breadth & depth, industry & business awareness, influencing skills, personal integrity, and strong focus on user experience. I ask questions, love to learn, incorporate new ideas, and solve difficult problems. I enjoy working in small teams, using Agile processes to build and improve the user experience. \n \nSpecialties: Client/server software architecture & development, Agile processes, global engineering management, virtual team leadership, in-depth knowledge of client hardware platforms, OEM/ODM and ISV ecosystem enabling, customer solutions engineering, UI/UX definition, program management. Skills Programming SoC Semiconductors Intel Debugging Program Management Microprocessors Product Management Computer Architecture ASIC PCIe Firmware Processors Device Drivers Skills  Programming SoC Semiconductors Intel Debugging Program Management Microprocessors Product Management Computer Architecture ASIC PCIe Firmware Processors Device Drivers Programming SoC Semiconductors Intel Debugging Program Management Microprocessors Product Management Computer Architecture ASIC PCIe Firmware Processors Device Drivers Programming SoC Semiconductors Intel Debugging Program Management Microprocessors Product Management Computer Architecture ASIC PCIe Firmware Processors Device Drivers ", "Summary Senior manager with track record of building teams and delivering results across SW Development, Validation, Customer and Partner enabling, technical and product marketing. Engineering experience across mobile applications on Android, Linux and Windows, cloud services, board support packages, networking solutions etc. Summary Senior manager with track record of building teams and delivering results across SW Development, Validation, Customer and Partner enabling, technical and product marketing. Engineering experience across mobile applications on Android, Linux and Windows, cloud services, board support packages, networking solutions etc. Senior manager with track record of building teams and delivering results across SW Development, Validation, Customer and Partner enabling, technical and product marketing. Engineering experience across mobile applications on Android, Linux and Windows, cloud services, board support packages, networking solutions etc. Senior manager with track record of building teams and delivering results across SW Development, Validation, Customer and Partner enabling, technical and product marketing. Engineering experience across mobile applications on Android, Linux and Windows, cloud services, board support packages, networking solutions etc. ", "Summary Lorenzo’s passion is using data insights to create organization change. He leads people analytics at LinkedIn, where the company vision is to create economic opportunity for every member of the global workforce. The talent analytics team is an amazing team of passionate individuals who help LinkedIn’s HR team make evidence-based people decisions for all stages of the employee lifecycle. Prior to joining LinkedIn, Lorenzo spent over eight years at McKinsey & Company and Accenture where he advised fortune 500 clients on product strategy, operations, organization design, and large-scale transformation. He has also worked as a product manager and engineer at IBM and Intel Corporation. He holds an MBA from the UC Berkeley Haas School of Business and a BS in Electrical Engineering from Cornell University. Summary Lorenzo’s passion is using data insights to create organization change. He leads people analytics at LinkedIn, where the company vision is to create economic opportunity for every member of the global workforce. The talent analytics team is an amazing team of passionate individuals who help LinkedIn’s HR team make evidence-based people decisions for all stages of the employee lifecycle. Prior to joining LinkedIn, Lorenzo spent over eight years at McKinsey & Company and Accenture where he advised fortune 500 clients on product strategy, operations, organization design, and large-scale transformation. He has also worked as a product manager and engineer at IBM and Intel Corporation. He holds an MBA from the UC Berkeley Haas School of Business and a BS in Electrical Engineering from Cornell University. Lorenzo’s passion is using data insights to create organization change. He leads people analytics at LinkedIn, where the company vision is to create economic opportunity for every member of the global workforce. The talent analytics team is an amazing team of passionate individuals who help LinkedIn’s HR team make evidence-based people decisions for all stages of the employee lifecycle. Prior to joining LinkedIn, Lorenzo spent over eight years at McKinsey & Company and Accenture where he advised fortune 500 clients on product strategy, operations, organization design, and large-scale transformation. He has also worked as a product manager and engineer at IBM and Intel Corporation. He holds an MBA from the UC Berkeley Haas School of Business and a BS in Electrical Engineering from Cornell University. Lorenzo’s passion is using data insights to create organization change. He leads people analytics at LinkedIn, where the company vision is to create economic opportunity for every member of the global workforce. The talent analytics team is an amazing team of passionate individuals who help LinkedIn’s HR team make evidence-based people decisions for all stages of the employee lifecycle. Prior to joining LinkedIn, Lorenzo spent over eight years at McKinsey & Company and Accenture where he advised fortune 500 clients on product strategy, operations, organization design, and large-scale transformation. He has also worked as a product manager and engineer at IBM and Intel Corporation. He holds an MBA from the UC Berkeley Haas School of Business and a BS in Electrical Engineering from Cornell University. Skills Strategy Cross-functional Team... Product Management Go-to-market Strategy Business Strategy Competitive Analysis Analytics IT Strategy Management Consulting Consulting Business Development Leadership Start-ups Product Development Stata Statistics SQL Tableau Data Analysis Business Process... Product Marketing Financial Analysis See 7+     See less Skills  Strategy Cross-functional Team... Product Management Go-to-market Strategy Business Strategy Competitive Analysis Analytics IT Strategy Management Consulting Consulting Business Development Leadership Start-ups Product Development Stata Statistics SQL Tableau Data Analysis Business Process... Product Marketing Financial Analysis See 7+     See less Strategy Cross-functional Team... Product Management Go-to-market Strategy Business Strategy Competitive Analysis Analytics IT Strategy Management Consulting Consulting Business Development Leadership Start-ups Product Development Stata Statistics SQL Tableau Data Analysis Business Process... Product Marketing Financial Analysis See 7+     See less Strategy Cross-functional Team... Product Management Go-to-market Strategy Business Strategy Competitive Analysis Analytics IT Strategy Management Consulting Consulting Business Development Leadership Start-ups Product Development Stata Statistics SQL Tableau Data Analysis Business Process... Product Marketing Financial Analysis See 7+     See less ", "Skills Embedded Systems Semiconductors Engineering Management Engineering Debugging Wireless Software Engineering SoC Mobile Devices Business Strategy Product Management Software Development C Embedded Software Cross-functional Team... Product Marketing See 1+     See less Skills  Embedded Systems Semiconductors Engineering Management Engineering Debugging Wireless Software Engineering SoC Mobile Devices Business Strategy Product Management Software Development C Embedded Software Cross-functional Team... Product Marketing See 1+     See less Embedded Systems Semiconductors Engineering Management Engineering Debugging Wireless Software Engineering SoC Mobile Devices Business Strategy Product Management Software Development C Embedded Software Cross-functional Team... Product Marketing See 1+     See less Embedded Systems Semiconductors Engineering Management Engineering Debugging Wireless Software Engineering SoC Mobile Devices Business Strategy Product Management Software Development C Embedded Software Cross-functional Team... Product Marketing See 1+     See less ", "Experience Applications Engineering Manager Intel Corporation Applications Engineering Manager Intel Corporation Applications Engineering Manager Intel Corporation ", "Experience Technical Product Manager Hitachi Data Systems November 2010  – Present (4 years 10 months) Principal Product Manager EMC Corporation April 2007  –  August 2010  (3 years 5 months) Managed the low and mid-range hardware platforms in the Celerra group from definition through to launch. Created Product Requirement Documents, Product Data Sheets and implemented the configuration and ordering systems for each platform. Close work with manufacturing, support, training and marketing ensured successful product launches in this rapidly growing segment for EMC. \n \nPreviously owned the feature definition and prioritization for the NAS product roadmap for File systems, Protocols and iSCSI. Created Product Requirement Documents and coordinated efforts from engineering, manufacturing and marketing to define and deliver increased functionality on the NAS product lineup. \n \nWorked with the field to gather intelligence and market direction and coordinate all requests for new features and functionality for incorporation into market leading products on the NAS roadmap. Product Marketing Manager Intel Corporation 2006  –  April 2007  (1 year) Owned driving the process for embedded processors and chipsets through the Product Life Cycle from concept to production. Coordinated representatives and gathered input from engineering (H/W & S/W), manufacture, marketing and finance to created Marketing and Product Requirements Documents. Program Manager Intel Corporation June 2004  –  June 2006  (2 years 1 month) Working with key customers for the (Dialogic) telecoms boards products and HMP VoIP software to ensure the successful launch of the customers complete application. Coordinated all aspects of the Intel product from influencing product features through to technical issue resolution and sample and product availability. Worked closely with sales, manufacturing, design, support, Q&R and up to the executive level at my customer accounts. Applications Engineering Manager Intel Corporation (UK) Ltd June 1997  –  June 2004  (7 years 1 month) Managed team of up to 15 application engineers for all Intel embedded products across the whole of EMEA. Ensured key customers designs were properly resourced and managed to production. Measured and reported support metrics. Worked closely with marketing and the field to define and deliver on demonstrations, presentations and training in support of product launches and major marketing events. Helped define and improve tool usage. Managed equipment budget of over £1M. Technical Product Manager Hitachi Data Systems November 2010  – Present (4 years 10 months) Technical Product Manager Hitachi Data Systems November 2010  – Present (4 years 10 months) Principal Product Manager EMC Corporation April 2007  –  August 2010  (3 years 5 months) Managed the low and mid-range hardware platforms in the Celerra group from definition through to launch. Created Product Requirement Documents, Product Data Sheets and implemented the configuration and ordering systems for each platform. Close work with manufacturing, support, training and marketing ensured successful product launches in this rapidly growing segment for EMC. \n \nPreviously owned the feature definition and prioritization for the NAS product roadmap for File systems, Protocols and iSCSI. Created Product Requirement Documents and coordinated efforts from engineering, manufacturing and marketing to define and deliver increased functionality on the NAS product lineup. \n \nWorked with the field to gather intelligence and market direction and coordinate all requests for new features and functionality for incorporation into market leading products on the NAS roadmap. Principal Product Manager EMC Corporation April 2007  –  August 2010  (3 years 5 months) Managed the low and mid-range hardware platforms in the Celerra group from definition through to launch. Created Product Requirement Documents, Product Data Sheets and implemented the configuration and ordering systems for each platform. Close work with manufacturing, support, training and marketing ensured successful product launches in this rapidly growing segment for EMC. \n \nPreviously owned the feature definition and prioritization for the NAS product roadmap for File systems, Protocols and iSCSI. Created Product Requirement Documents and coordinated efforts from engineering, manufacturing and marketing to define and deliver increased functionality on the NAS product lineup. \n \nWorked with the field to gather intelligence and market direction and coordinate all requests for new features and functionality for incorporation into market leading products on the NAS roadmap. Product Marketing Manager Intel Corporation 2006  –  April 2007  (1 year) Owned driving the process for embedded processors and chipsets through the Product Life Cycle from concept to production. Coordinated representatives and gathered input from engineering (H/W & S/W), manufacture, marketing and finance to created Marketing and Product Requirements Documents. Product Marketing Manager Intel Corporation 2006  –  April 2007  (1 year) Owned driving the process for embedded processors and chipsets through the Product Life Cycle from concept to production. Coordinated representatives and gathered input from engineering (H/W & S/W), manufacture, marketing and finance to created Marketing and Product Requirements Documents. Program Manager Intel Corporation June 2004  –  June 2006  (2 years 1 month) Working with key customers for the (Dialogic) telecoms boards products and HMP VoIP software to ensure the successful launch of the customers complete application. Coordinated all aspects of the Intel product from influencing product features through to technical issue resolution and sample and product availability. Worked closely with sales, manufacturing, design, support, Q&R and up to the executive level at my customer accounts. Program Manager Intel Corporation June 2004  –  June 2006  (2 years 1 month) Working with key customers for the (Dialogic) telecoms boards products and HMP VoIP software to ensure the successful launch of the customers complete application. Coordinated all aspects of the Intel product from influencing product features through to technical issue resolution and sample and product availability. Worked closely with sales, manufacturing, design, support, Q&R and up to the executive level at my customer accounts. Applications Engineering Manager Intel Corporation (UK) Ltd June 1997  –  June 2004  (7 years 1 month) Managed team of up to 15 application engineers for all Intel embedded products across the whole of EMEA. Ensured key customers designs were properly resourced and managed to production. Measured and reported support metrics. Worked closely with marketing and the field to define and deliver on demonstrations, presentations and training in support of product launches and major marketing events. Helped define and improve tool usage. Managed equipment budget of over £1M. Applications Engineering Manager Intel Corporation (UK) Ltd June 1997  –  June 2004  (7 years 1 month) Managed team of up to 15 application engineers for all Intel embedded products across the whole of EMEA. Ensured key customers designs were properly resourced and managed to production. Measured and reported support metrics. Worked closely with marketing and the field to define and deliver on demonstrations, presentations and training in support of product launches and major marketing events. Helped define and improve tool usage. Managed equipment budget of over £1M. Skills NAS Product Requirements File Systems Product Strategy Storage Telecommunications Product Management Product Marketing Embedded Systems Product Launch Partner Management Cloud Computing VoIP Storage Virtualization Skills  NAS Product Requirements File Systems Product Strategy Storage Telecommunications Product Management Product Marketing Embedded Systems Product Launch Partner Management Cloud Computing VoIP Storage Virtualization NAS Product Requirements File Systems Product Strategy Storage Telecommunications Product Management Product Marketing Embedded Systems Product Launch Partner Management Cloud Computing VoIP Storage Virtualization NAS Product Requirements File Systems Product Strategy Storage Telecommunications Product Management Product Marketing Embedded Systems Product Launch Partner Management Cloud Computing VoIP Storage Virtualization Education Heriot-Watt University Bachelor of Science (BSc),  Electrical and Electronics Engineering 1981  – 1985 Heriot-Watt University Bachelor of Science (BSc),  Electrical and Electronics Engineering 1981  – 1985 Heriot-Watt University Bachelor of Science (BSc),  Electrical and Electronics Engineering 1981  – 1985 Heriot-Watt University Bachelor of Science (BSc),  Electrical and Electronics Engineering 1981  – 1985 ", "Experience Founder, President & CEO Arada Systems July 2006  – Present (9 years 2 months) Santa Clara, CA Arada Systems was formed as a spin-off from Qualcomm-Atheros to enable advanced and disruptive Wi-Fi Technology and has enabled more than 150 companies including seeding companies like Aruba Networks, Meraki, Aerohive, Xirrus, Meru Networks, Proxim, Siemens, Symbol/Motorola, Ubiquiti, Anritsu, Bel-Air, Bluesocket, Firetide, Card-Access, Hitachi, Alvarion, LitePointe, Netgear, Philips, QNX, and Tropos to name a few... \nArada Systems is now focused on developing Advanced Automotive (DSRC) and Enterprise/SMB grade solutions to again disrupt the market. Atheros Authorized Design Center Manager, FAE Manager Europe, Country Manager India Atheros Communications February 2001  –  July 2006  (5 years 6 months) Applications Engineering Manager Intel Corporation May 1998  –  March 2001  (2 years 11 months) Manager of Applications Engineering group for Level One Communications' Wireless CMOS Radio group (acquired by Intel) that developed 2.4GHz and 900MHz radio solutions for cordless phones. Applications Engineering Manager Intel Corporation May 1998  –  March 2001  (2 years 11 months) Manager of Applications Engineering group for Level One Communications' Wireless CMOS Radio group (acquired by Intel) that developed 2.4GHz and 900MHz radio solutions for cordless phones. Applications Engineering Manager Intel Corporation May 1998  –  March 2001  (2 years 11 months) Manager of Applications Engineering group for Level One Communications' Wireless CMOS Radio group (acquired by Intel) that developed 2.4GHz and 900MHz radio solutions for cordless phones. Applications Engineering Manager Level One Communications 1998  –  2001  (3 years) Member of Technical Staff Watkins Johnson 1995  –  1998  (3 years) Member of Technical Staff, RF Engineer WJ Communications 1994  –  1997  (3 years) Founder, President & CEO Arada Systems July 2006  – Present (9 years 2 months) Santa Clara, CA Arada Systems was formed as a spin-off from Qualcomm-Atheros to enable advanced and disruptive Wi-Fi Technology and has enabled more than 150 companies including seeding companies like Aruba Networks, Meraki, Aerohive, Xirrus, Meru Networks, Proxim, Siemens, Symbol/Motorola, Ubiquiti, Anritsu, Bel-Air, Bluesocket, Firetide, Card-Access, Hitachi, Alvarion, LitePointe, Netgear, Philips, QNX, and Tropos to name a few... \nArada Systems is now focused on developing Advanced Automotive (DSRC) and Enterprise/SMB grade solutions to again disrupt the market. Founder, President & CEO Arada Systems July 2006  – Present (9 years 2 months) Santa Clara, CA Arada Systems was formed as a spin-off from Qualcomm-Atheros to enable advanced and disruptive Wi-Fi Technology and has enabled more than 150 companies including seeding companies like Aruba Networks, Meraki, Aerohive, Xirrus, Meru Networks, Proxim, Siemens, Symbol/Motorola, Ubiquiti, Anritsu, Bel-Air, Bluesocket, Firetide, Card-Access, Hitachi, Alvarion, LitePointe, Netgear, Philips, QNX, and Tropos to name a few... \nArada Systems is now focused on developing Advanced Automotive (DSRC) and Enterprise/SMB grade solutions to again disrupt the market. Atheros Authorized Design Center Manager, FAE Manager Europe, Country Manager India Atheros Communications February 2001  –  July 2006  (5 years 6 months) Atheros Authorized Design Center Manager, FAE Manager Europe, Country Manager India Atheros Communications February 2001  –  July 2006  (5 years 6 months) Applications Engineering Manager Intel Corporation May 1998  –  March 2001  (2 years 11 months) Manager of Applications Engineering group for Level One Communications' Wireless CMOS Radio group (acquired by Intel) that developed 2.4GHz and 900MHz radio solutions for cordless phones. Applications Engineering Manager Intel Corporation May 1998  –  March 2001  (2 years 11 months) Manager of Applications Engineering group for Level One Communications' Wireless CMOS Radio group (acquired by Intel) that developed 2.4GHz and 900MHz radio solutions for cordless phones. Applications Engineering Manager Intel Corporation May 1998  –  March 2001  (2 years 11 months) Manager of Applications Engineering group for Level One Communications' Wireless CMOS Radio group (acquired by Intel) that developed 2.4GHz and 900MHz radio solutions for cordless phones. Applications Engineering Manager Intel Corporation May 1998  –  March 2001  (2 years 11 months) Manager of Applications Engineering group for Level One Communications' Wireless CMOS Radio group (acquired by Intel) that developed 2.4GHz and 900MHz radio solutions for cordless phones. Applications Engineering Manager Intel Corporation May 1998  –  March 2001  (2 years 11 months) Manager of Applications Engineering group for Level One Communications' Wireless CMOS Radio group (acquired by Intel) that developed 2.4GHz and 900MHz radio solutions for cordless phones. Applications Engineering Manager Intel Corporation May 1998  –  March 2001  (2 years 11 months) Manager of Applications Engineering group for Level One Communications' Wireless CMOS Radio group (acquired by Intel) that developed 2.4GHz and 900MHz radio solutions for cordless phones. Applications Engineering Manager Level One Communications 1998  –  2001  (3 years) Applications Engineering Manager Level One Communications 1998  –  2001  (3 years) Member of Technical Staff Watkins Johnson 1995  –  1998  (3 years) Member of Technical Staff Watkins Johnson 1995  –  1998  (3 years) Member of Technical Staff, RF Engineer WJ Communications 1994  –  1997  (3 years) Member of Technical Staff, RF Engineer WJ Communications 1994  –  1997  (3 years) Education Stanford University Master of Science,  Electrical Engineering 1996  – 1998 California State Polytechnic University-Pomona BSEE,  Electrical Engineering 1991  – 1995 Stanford University Master of Science,  Electrical Engineering 1996  – 1998 Stanford University Master of Science,  Electrical Engineering 1996  – 1998 Stanford University Master of Science,  Electrical Engineering 1996  – 1998 California State Polytechnic University-Pomona BSEE,  Electrical Engineering 1991  – 1995 California State Polytechnic University-Pomona BSEE,  Electrical Engineering 1991  – 1995 California State Polytechnic University-Pomona BSEE,  Electrical Engineering 1991  – 1995 ", "Summary Focused, critical thinker guaranteed to achieve business results in cross-functional, global team environments. Proven ability to handle and prioritize multiple projects, manage budgets and understand emerging technologies and business strategies. \n \nSpecialties:  \n•Leadership and stakeholder management \n•Expert relationship builder and problem solver \n•Digital marketing governance \n•Business solutions delivery \n•Business intelligence and data analytics \n•Program/project management  \n•Matrix management \n•Working across geographies \n•Coaching, building high performing teams \n•Technology and business acumen  \n•Budget management \n•Shared services management  \n•Transition and organizational change management Summary Focused, critical thinker guaranteed to achieve business results in cross-functional, global team environments. Proven ability to handle and prioritize multiple projects, manage budgets and understand emerging technologies and business strategies. \n \nSpecialties:  \n•Leadership and stakeholder management \n•Expert relationship builder and problem solver \n•Digital marketing governance \n•Business solutions delivery \n•Business intelligence and data analytics \n•Program/project management  \n•Matrix management \n•Working across geographies \n•Coaching, building high performing teams \n•Technology and business acumen  \n•Budget management \n•Shared services management  \n•Transition and organizational change management Focused, critical thinker guaranteed to achieve business results in cross-functional, global team environments. Proven ability to handle and prioritize multiple projects, manage budgets and understand emerging technologies and business strategies. \n \nSpecialties:  \n•Leadership and stakeholder management \n•Expert relationship builder and problem solver \n•Digital marketing governance \n•Business solutions delivery \n•Business intelligence and data analytics \n•Program/project management  \n•Matrix management \n•Working across geographies \n•Coaching, building high performing teams \n•Technology and business acumen  \n•Budget management \n•Shared services management  \n•Transition and organizational change management Focused, critical thinker guaranteed to achieve business results in cross-functional, global team environments. Proven ability to handle and prioritize multiple projects, manage budgets and understand emerging technologies and business strategies. \n \nSpecialties:  \n•Leadership and stakeholder management \n•Expert relationship builder and problem solver \n•Digital marketing governance \n•Business solutions delivery \n•Business intelligence and data analytics \n•Program/project management  \n•Matrix management \n•Working across geographies \n•Coaching, building high performing teams \n•Technology and business acumen  \n•Budget management \n•Shared services management  \n•Transition and organizational change management Experience Program Manager Intel Corporation/Intel Federal LLC February 2015  – Present (7 months) Provide program leadership for Intel Federal technical programs delivering products or services to the US Government. Accountable for all aspects of program execution from bid/proposal phase through execution. Responsible for compliance assurance to US Government regulations. Digital Governance Manager Intel Corporation October 2012  –  February 2015  (2 years 5 months) Portfolio Manager BPA May 2011  –  October 2012  (1 year 6 months) Portland, Oregon IT Specialist US Army Corps of Engineers July 2010  –  May 2011  (11 months) Sr Business Solutions Delivery Manager Nike Inc October 2006  –  June 2010  (3 years 9 months) IT Manager/Program Manager Intel Corp August 2003  –  October 2006  (3 years 3 months) Applications and Engineering Manager Intel Corporation August 1998  –  August 2003  (5 years 1 month) Systems Integrator Intel Corp February 1996  –  August 1998  (2 years 7 months) Computer Specialist Department of Defense May 1988  –  February 1996  (7 years 10 months) Program Manager Intel Corporation/Intel Federal LLC February 2015  – Present (7 months) Provide program leadership for Intel Federal technical programs delivering products or services to the US Government. Accountable for all aspects of program execution from bid/proposal phase through execution. Responsible for compliance assurance to US Government regulations. Program Manager Intel Corporation/Intel Federal LLC February 2015  – Present (7 months) Provide program leadership for Intel Federal technical programs delivering products or services to the US Government. Accountable for all aspects of program execution from bid/proposal phase through execution. Responsible for compliance assurance to US Government regulations. Digital Governance Manager Intel Corporation October 2012  –  February 2015  (2 years 5 months) Digital Governance Manager Intel Corporation October 2012  –  February 2015  (2 years 5 months) Portfolio Manager BPA May 2011  –  October 2012  (1 year 6 months) Portland, Oregon Portfolio Manager BPA May 2011  –  October 2012  (1 year 6 months) Portland, Oregon IT Specialist US Army Corps of Engineers July 2010  –  May 2011  (11 months) IT Specialist US Army Corps of Engineers July 2010  –  May 2011  (11 months) Sr Business Solutions Delivery Manager Nike Inc October 2006  –  June 2010  (3 years 9 months) Sr Business Solutions Delivery Manager Nike Inc October 2006  –  June 2010  (3 years 9 months) IT Manager/Program Manager Intel Corp August 2003  –  October 2006  (3 years 3 months) IT Manager/Program Manager Intel Corp August 2003  –  October 2006  (3 years 3 months) Applications and Engineering Manager Intel Corporation August 1998  –  August 2003  (5 years 1 month) Applications and Engineering Manager Intel Corporation August 1998  –  August 2003  (5 years 1 month) Systems Integrator Intel Corp February 1996  –  August 1998  (2 years 7 months) Systems Integrator Intel Corp February 1996  –  August 1998  (2 years 7 months) Computer Specialist Department of Defense May 1988  –  February 1996  (7 years 10 months) Computer Specialist Department of Defense May 1988  –  February 1996  (7 years 10 months) Skills Skills     ", "Skills Engineering Coaching Research Program Management Product Management Strategic Planning Process Improvement Cross-functional Team... Problem Solving Public Speaking Business Strategy Mentoring Change Management Product Marketing Team Building Team Leadership Requirements Analysis Semiconductors Marketing Management Training Software Development Product Development Strategy Leadership Project Management Executive Management Strategic Partnerships Business Development See 14+     See less Skills  Engineering Coaching Research Program Management Product Management Strategic Planning Process Improvement Cross-functional Team... Problem Solving Public Speaking Business Strategy Mentoring Change Management Product Marketing Team Building Team Leadership Requirements Analysis Semiconductors Marketing Management Training Software Development Product Development Strategy Leadership Project Management Executive Management Strategic Partnerships Business Development See 14+     See less Engineering Coaching Research Program Management Product Management Strategic Planning Process Improvement Cross-functional Team... Problem Solving Public Speaking Business Strategy Mentoring Change Management Product Marketing Team Building Team Leadership Requirements Analysis Semiconductors Marketing Management Training Software Development Product Development Strategy Leadership Project Management Executive Management Strategic Partnerships Business Development See 14+     See less Engineering Coaching Research Program Management Product Management Strategic Planning Process Improvement Cross-functional Team... Problem Solving Public Speaking Business Strategy Mentoring Change Management Product Marketing Team Building Team Leadership Requirements Analysis Semiconductors Marketing Management Training Software Development Product Development Strategy Leadership Project Management Executive Management Strategic Partnerships Business Development See 14+     See less Honors & Awards ", "Skills Servers EDA Intel Algorithms Enterprise Software Management Computer Security Debugging Firmware SoC Security Semiconductors Bios Processors Manufacturing X86 See 1+     See less Skills  Servers EDA Intel Algorithms Enterprise Software Management Computer Security Debugging Firmware SoC Security Semiconductors Bios Processors Manufacturing X86 See 1+     See less Servers EDA Intel Algorithms Enterprise Software Management Computer Security Debugging Firmware SoC Security Semiconductors Bios Processors Manufacturing X86 See 1+     See less Servers EDA Intel Algorithms Enterprise Software Management Computer Security Debugging Firmware SoC Security Semiconductors Bios Processors Manufacturing X86 See 1+     See less "]}