{"position": "ASIC Engineer", "company": "Intel Corporation", "profiles": ["Summary Staff ASIC Design Engineer with 15 years of experience in Top level, Synthesis, Static Timing Analysis, DFT insertion, ATPG generation, HDL Design and Verification of top leevel modules in a multi-million gate designs with the leading provider of Fibre Channel Controllers and Host Bust Adapters for Enterprise and SMB Storage Sector. \nParticipated in the development of more than 10 silicon proven ASIC controllers at various phases of the design from design architecture to tape out. Familiar with Xilinx Vivado environment. Experience is relavant and applicable in ASIC and FPGA design developments. Summary Staff ASIC Design Engineer with 15 years of experience in Top level, Synthesis, Static Timing Analysis, DFT insertion, ATPG generation, HDL Design and Verification of top leevel modules in a multi-million gate designs with the leading provider of Fibre Channel Controllers and Host Bust Adapters for Enterprise and SMB Storage Sector. \nParticipated in the development of more than 10 silicon proven ASIC controllers at various phases of the design from design architecture to tape out. Familiar with Xilinx Vivado environment. Experience is relavant and applicable in ASIC and FPGA design developments. Staff ASIC Design Engineer with 15 years of experience in Top level, Synthesis, Static Timing Analysis, DFT insertion, ATPG generation, HDL Design and Verification of top leevel modules in a multi-million gate designs with the leading provider of Fibre Channel Controllers and Host Bust Adapters for Enterprise and SMB Storage Sector. \nParticipated in the development of more than 10 silicon proven ASIC controllers at various phases of the design from design architecture to tape out. Familiar with Xilinx Vivado environment. Experience is relavant and applicable in ASIC and FPGA design developments. Staff ASIC Design Engineer with 15 years of experience in Top level, Synthesis, Static Timing Analysis, DFT insertion, ATPG generation, HDL Design and Verification of top leevel modules in a multi-million gate designs with the leading provider of Fibre Channel Controllers and Host Bust Adapters for Enterprise and SMB Storage Sector. \nParticipated in the development of more than 10 silicon proven ASIC controllers at various phases of the design from design architecture to tape out. Familiar with Xilinx Vivado environment. Experience is relavant and applicable in ASIC and FPGA design developments. Experience Physical Design Engineer Intel Corporation December 2014  – Present (9 months) Irvine ASIC Design Engineer QLogic 1999  –  May 2014  (15 years) Owned 3 multi-million gate Subchips by performing all the needed tasks from synthesis, timing analysis, linting and DRC check. Worked closely with RTL designers as well as the backend P&R engineers to ensure timing closure. \nImplemented and verified DFT which includes  \nStuck at Scan, Transition Delay Fault (TDF), Scan compression using Tetramax \nMemory BIST and logic BIST, JTAG IEEE1149.1, IEEE1149.6, using Logicvision.  \nATPG and Functional test vector generation.  \nGenerated and simulated test benches for all the above cases. \nWorked with ASIC vendors DFT teams to define a methodology that worked efficiently to meet the requirement of both companies. \nDesigned and implemented verification testbench for probe logic Responsibility for memory selection and implementation of more than 250 different types and sizes.  \nIdentified and simplified the memory selection and generation process and transferred knowledge to junior engineers. \nWrote perl/sed scripts to increase engineering productivity and to simplify and automate design processes. \nDefined ECO process used by the entire team. Including: \nChecking the ECO flow plus finding and fixing holes in the flow \nGenerating and reviewing documentation \nTeaching other engineers the ECO process \nSetup and installed DRC tools, Spyglass and spotlight. \nFull chip integration responsibility. Maintained full chip RTL, which included clock module, probe module, test logic, interconnection between all the modules, JTAG, and primary IOs for 2.6M gates chip with 120mm2 die size. \nGenerated SDC files and run PrimeTime at the top level and block levels. Analyzed paths and wrote constraints. \nWrote ECO change files for metal spin. Used back end tools, First Encounter to display spare cells, ECO logic and nets. \nRan equivalency check tools, Formality, Verity, Conformal to verify RTL to netlist equivalency, and also netlist to netlist for pre and post layout, DFT, and ECO netlists. Chairman of Parish council St. Peter Armenian church January 2012  –  January 2014  (2 years 1 month) Glendale, CA Conduct monthly meeting with the parish council and the parish priest \nReview annual budget and approval of new expenses. \nIdentify sources and work on events to raise funds for general operations of the church. \nHire qualified office staff \nGet monthly reports from office staff, attend to their needs and concerns. \nIdentify and resolve challenges during Sunday mass, attend to the needs of the parishioners.  \nCommunicate the parishes concerns to the diocese and find reasonable solutions. Chairman St. Peter Armenian Church and Youth Ministeries Center February 2006  –  February 2010  (4 years 1 month) this is a small and unique Armenian church in glendale, ca. I am the chairman of the parish council. President Armenian Engineers and Scientists of America January 2009  –  January 2010  (1 year 1 month) Armenian Engineers and Scientists of America. 25 year organization serving the needs of the engineering and scientific communities all over the world. Photographer and digital Artists dbazad.com June 1999  –  November 2007  (8 years 6 months) I enjoy taking pictures of landscapes architectures and water bodies.  \nI have also developed a special technique to make abstract digital art based on my photos Physical Design Engineer Intel Corporation December 2014  – Present (9 months) Irvine Physical Design Engineer Intel Corporation December 2014  – Present (9 months) Irvine ASIC Design Engineer QLogic 1999  –  May 2014  (15 years) Owned 3 multi-million gate Subchips by performing all the needed tasks from synthesis, timing analysis, linting and DRC check. Worked closely with RTL designers as well as the backend P&R engineers to ensure timing closure. \nImplemented and verified DFT which includes  \nStuck at Scan, Transition Delay Fault (TDF), Scan compression using Tetramax \nMemory BIST and logic BIST, JTAG IEEE1149.1, IEEE1149.6, using Logicvision.  \nATPG and Functional test vector generation.  \nGenerated and simulated test benches for all the above cases. \nWorked with ASIC vendors DFT teams to define a methodology that worked efficiently to meet the requirement of both companies. \nDesigned and implemented verification testbench for probe logic Responsibility for memory selection and implementation of more than 250 different types and sizes.  \nIdentified and simplified the memory selection and generation process and transferred knowledge to junior engineers. \nWrote perl/sed scripts to increase engineering productivity and to simplify and automate design processes. \nDefined ECO process used by the entire team. Including: \nChecking the ECO flow plus finding and fixing holes in the flow \nGenerating and reviewing documentation \nTeaching other engineers the ECO process \nSetup and installed DRC tools, Spyglass and spotlight. \nFull chip integration responsibility. Maintained full chip RTL, which included clock module, probe module, test logic, interconnection between all the modules, JTAG, and primary IOs for 2.6M gates chip with 120mm2 die size. \nGenerated SDC files and run PrimeTime at the top level and block levels. Analyzed paths and wrote constraints. \nWrote ECO change files for metal spin. Used back end tools, First Encounter to display spare cells, ECO logic and nets. \nRan equivalency check tools, Formality, Verity, Conformal to verify RTL to netlist equivalency, and also netlist to netlist for pre and post layout, DFT, and ECO netlists. ASIC Design Engineer QLogic 1999  –  May 2014  (15 years) Owned 3 multi-million gate Subchips by performing all the needed tasks from synthesis, timing analysis, linting and DRC check. Worked closely with RTL designers as well as the backend P&R engineers to ensure timing closure. \nImplemented and verified DFT which includes  \nStuck at Scan, Transition Delay Fault (TDF), Scan compression using Tetramax \nMemory BIST and logic BIST, JTAG IEEE1149.1, IEEE1149.6, using Logicvision.  \nATPG and Functional test vector generation.  \nGenerated and simulated test benches for all the above cases. \nWorked with ASIC vendors DFT teams to define a methodology that worked efficiently to meet the requirement of both companies. \nDesigned and implemented verification testbench for probe logic Responsibility for memory selection and implementation of more than 250 different types and sizes.  \nIdentified and simplified the memory selection and generation process and transferred knowledge to junior engineers. \nWrote perl/sed scripts to increase engineering productivity and to simplify and automate design processes. \nDefined ECO process used by the entire team. Including: \nChecking the ECO flow plus finding and fixing holes in the flow \nGenerating and reviewing documentation \nTeaching other engineers the ECO process \nSetup and installed DRC tools, Spyglass and spotlight. \nFull chip integration responsibility. Maintained full chip RTL, which included clock module, probe module, test logic, interconnection between all the modules, JTAG, and primary IOs for 2.6M gates chip with 120mm2 die size. \nGenerated SDC files and run PrimeTime at the top level and block levels. Analyzed paths and wrote constraints. \nWrote ECO change files for metal spin. Used back end tools, First Encounter to display spare cells, ECO logic and nets. \nRan equivalency check tools, Formality, Verity, Conformal to verify RTL to netlist equivalency, and also netlist to netlist for pre and post layout, DFT, and ECO netlists. Chairman of Parish council St. Peter Armenian church January 2012  –  January 2014  (2 years 1 month) Glendale, CA Conduct monthly meeting with the parish council and the parish priest \nReview annual budget and approval of new expenses. \nIdentify sources and work on events to raise funds for general operations of the church. \nHire qualified office staff \nGet monthly reports from office staff, attend to their needs and concerns. \nIdentify and resolve challenges during Sunday mass, attend to the needs of the parishioners.  \nCommunicate the parishes concerns to the diocese and find reasonable solutions. Chairman of Parish council St. Peter Armenian church January 2012  –  January 2014  (2 years 1 month) Glendale, CA Conduct monthly meeting with the parish council and the parish priest \nReview annual budget and approval of new expenses. \nIdentify sources and work on events to raise funds for general operations of the church. \nHire qualified office staff \nGet monthly reports from office staff, attend to their needs and concerns. \nIdentify and resolve challenges during Sunday mass, attend to the needs of the parishioners.  \nCommunicate the parishes concerns to the diocese and find reasonable solutions. Chairman St. Peter Armenian Church and Youth Ministeries Center February 2006  –  February 2010  (4 years 1 month) this is a small and unique Armenian church in glendale, ca. I am the chairman of the parish council. Chairman St. Peter Armenian Church and Youth Ministeries Center February 2006  –  February 2010  (4 years 1 month) this is a small and unique Armenian church in glendale, ca. I am the chairman of the parish council. President Armenian Engineers and Scientists of America January 2009  –  January 2010  (1 year 1 month) Armenian Engineers and Scientists of America. 25 year organization serving the needs of the engineering and scientific communities all over the world. President Armenian Engineers and Scientists of America January 2009  –  January 2010  (1 year 1 month) Armenian Engineers and Scientists of America. 25 year organization serving the needs of the engineering and scientific communities all over the world. Photographer and digital Artists dbazad.com June 1999  –  November 2007  (8 years 6 months) I enjoy taking pictures of landscapes architectures and water bodies.  \nI have also developed a special technique to make abstract digital art based on my photos Photographer and digital Artists dbazad.com June 1999  –  November 2007  (8 years 6 months) I enjoy taking pictures of landscapes architectures and water bodies.  \nI have also developed a special technique to make abstract digital art based on my photos Languages Armenian Arabic Armenian Arabic Armenian Arabic Skills Verilog ASIC SystemVerilog Electrical Engineering Engineering Management SoC Hardware Architecture FPGA IC Static Timing Analysis RTL design Firmware Functional Verification TCL DFT RTL Design Debugging See 2+     See less Skills  Verilog ASIC SystemVerilog Electrical Engineering Engineering Management SoC Hardware Architecture FPGA IC Static Timing Analysis RTL design Firmware Functional Verification TCL DFT RTL Design Debugging See 2+     See less Verilog ASIC SystemVerilog Electrical Engineering Engineering Management SoC Hardware Architecture FPGA IC Static Timing Analysis RTL design Firmware Functional Verification TCL DFT RTL Design Debugging See 2+     See less Verilog ASIC SystemVerilog Electrical Engineering Engineering Management SoC Hardware Architecture FPGA IC Static Timing Analysis RTL design Firmware Functional Verification TCL DFT RTL Design Debugging See 2+     See less Education California State Polytechnic University-Pomona B.Sc.,  Electrical and Computer Engineering 1997  – 1999 California State Polytechnic University-Pomona B.Sc.,  Electrical and Computer Engineering 1997  – 1999 California State Polytechnic University-Pomona B.Sc.,  Electrical and Computer Engineering 1997  – 1999 California State Polytechnic University-Pomona B.Sc.,  Electrical and Computer Engineering 1997  – 1999 ", "Summary Senior level electrical engineer with over 20 years of industry experience. 15+ years specifically in FPGA/ASIC design, writing Verilog and VHDL RTL for synthesis and test, managing EDA tools and tool flow. CVS, ClearCase, Subversion expereince. 10+ years of board level hardware design. \n \nSpecialties: FPGA and ASIC development. \nVerilog, VHDL. \nEDA tool management. \nEDA tool flow. \nScripting EDA tool flows. \nFPGA verification. \nASIC verification. \nLow-level embedded software. \nIP integration - PCIE, XAUI, USB3 Summary Senior level electrical engineer with over 20 years of industry experience. 15+ years specifically in FPGA/ASIC design, writing Verilog and VHDL RTL for synthesis and test, managing EDA tools and tool flow. CVS, ClearCase, Subversion expereince. 10+ years of board level hardware design. \n \nSpecialties: FPGA and ASIC development. \nVerilog, VHDL. \nEDA tool management. \nEDA tool flow. \nScripting EDA tool flows. \nFPGA verification. \nASIC verification. \nLow-level embedded software. \nIP integration - PCIE, XAUI, USB3 Senior level electrical engineer with over 20 years of industry experience. 15+ years specifically in FPGA/ASIC design, writing Verilog and VHDL RTL for synthesis and test, managing EDA tools and tool flow. CVS, ClearCase, Subversion expereince. 10+ years of board level hardware design. \n \nSpecialties: FPGA and ASIC development. \nVerilog, VHDL. \nEDA tool management. \nEDA tool flow. \nScripting EDA tool flows. \nFPGA verification. \nASIC verification. \nLow-level embedded software. \nIP integration - PCIE, XAUI, USB3 Senior level electrical engineer with over 20 years of industry experience. 15+ years specifically in FPGA/ASIC design, writing Verilog and VHDL RTL for synthesis and test, managing EDA tools and tool flow. CVS, ClearCase, Subversion expereince. 10+ years of board level hardware design. \n \nSpecialties: FPGA and ASIC development. \nVerilog, VHDL. \nEDA tool management. \nEDA tool flow. \nScripting EDA tool flows. \nFPGA verification. \nASIC verification. \nLow-level embedded software. \nIP integration - PCIE, XAUI, USB3 Experience FPGA/ASIC Engineer Intel Corporation December 2012  – Present (2 years 9 months) Hillsboro FPGA/ASIC Development in the Perceptual Computing Group FPGA/ASIC Design Engineer (contract through Volt Technical Staffing) Intel Corporation October 2012  –  November 2012  (2 months) Hillsboro FPGA/ASIC Development Senior FPGA Engineer, contract through Azad Consulting Tektronix June 2011  –  August 2012  (1 year 3 months) Beaverton, Oregon Working in the Video Product Line group, developed an Altera Cyclone-IV design for monitoring QAM/DOCSIS signal quality. The design incorporated 4 FPGA’s, a CPLD, QAM demodulator IP, DDR2, A-to-D interface, and a PCIe gen2 interface on a PCIe card in a Linux server. Wrote software for embedded soft Nios2 processor. Developed a custom method for reprogramming the FPGA image via the PCIe. Used Verilog, with IP in VHDL, Modelsim, NC-Verilog, LSF, Quartus and Eclipse and GCC for software development. Participated in extensive hardware design reviews and collaboration. This project required simultaneous development of the hardware, embedded Nios software, Linux drivers, and a UI. Senior FPGA Engineer RadiSys Corporation December 2006  –  June 2011  (4 years 7 months) Hillsboro, Oregon Completed several FPGA designs start to finish. Developed a Xilinx Spartan-3A design for specialized telecom and custom OS functions in an embedded Pentium blade, with fail-safe features. Completed a Spartan-6 Design with XAUI . Did several new designs for Lattice and Actel devices. Sustaining work on legacy designs with Lattice, Altera, Actel and Xilinx devices. Management of the Linux system, EDA tool management. Transitioned the FPGA development flow from CVS to ClearCase. Left due to transition of design work to China Senior FPGA Engineer Rockwell Collins September 2005  –  September 2006  (1 year 1 month) Developed a Xilinx Virtex-4 VHDL design for a head-up display, processing video data received via a fibre-channel interface and formatted for display on a projection LCD. Senior EDA Engineer Focus Enhancements 2000  –  2005  (5 years) Focus Enhancements is a small fabless semiconductor company, specializing in video processors. I worked in all aspects of the ASIC design and FPGA emulation flow, while using an outside vendor for physical design. One of our ASICs went into the MS X-Box, over 10,000,000 sold. Managed the tool flow, maintained the build scripts, wrote scripts for sign-off timing verification with Synopsys PrimeTime. Managed dual-target development flow using various scripts, makefiles, etc. to target FPGA for development of ASIC end product. Senior Electrical Engineer FLIR Systems 1998  –  2000  (2 years) Developed digital electronic hardware and software. Wrote ‘C’ code for a five-processor (8031) embedded system controlling an airborne video surveillance camera system. Senior engineer position, directed the work of other engineers. Performed sustaining engineering on several products. Senior Electrical Engineer Kentrox ADC 1997  –  1998  (1 year) Beaverton, Oregon Modified several physical-layer protocol boards in an ATM WAN access device, making changes to hardware, software and FPGAs (using VHDL, Mentor Graphics tool set), to incorporate new capabilities into the existing products. Sustaining work on existing products Senior Electrical Engineer Peek Traffic 1996  –  1997  (1 year) Developed several microprocessor-based products for traffic control applications. Developed 'C' code for those products. Sole electrical engineer on staff. Member, Technical Staff Synopsys June 1995  –  June 1996  (1 year 1 month) Worked for the Logic Modeling Group in Hillsboro, Oregon. Developed RTL models, wrote verification test suites and RTL models of several micro-controllers in VHDL. Senior Electrical Engineer II Morrow Inc. 1987  –  1995  (8 years) Worked on a wide variety of avionic and electronic devices, developing both hardware and software development. Supervised a staff of 3 in hardware development of the DIAD, an electronic clipboard used by 60,000 United Parcel Service drivers. FPGA/ASIC Engineer Intel Corporation December 2012  – Present (2 years 9 months) Hillsboro FPGA/ASIC Development in the Perceptual Computing Group FPGA/ASIC Engineer Intel Corporation December 2012  – Present (2 years 9 months) Hillsboro FPGA/ASIC Development in the Perceptual Computing Group FPGA/ASIC Design Engineer (contract through Volt Technical Staffing) Intel Corporation October 2012  –  November 2012  (2 months) Hillsboro FPGA/ASIC Development FPGA/ASIC Design Engineer (contract through Volt Technical Staffing) Intel Corporation October 2012  –  November 2012  (2 months) Hillsboro FPGA/ASIC Development Senior FPGA Engineer, contract through Azad Consulting Tektronix June 2011  –  August 2012  (1 year 3 months) Beaverton, Oregon Working in the Video Product Line group, developed an Altera Cyclone-IV design for monitoring QAM/DOCSIS signal quality. The design incorporated 4 FPGA’s, a CPLD, QAM demodulator IP, DDR2, A-to-D interface, and a PCIe gen2 interface on a PCIe card in a Linux server. Wrote software for embedded soft Nios2 processor. Developed a custom method for reprogramming the FPGA image via the PCIe. Used Verilog, with IP in VHDL, Modelsim, NC-Verilog, LSF, Quartus and Eclipse and GCC for software development. Participated in extensive hardware design reviews and collaboration. This project required simultaneous development of the hardware, embedded Nios software, Linux drivers, and a UI. Senior FPGA Engineer, contract through Azad Consulting Tektronix June 2011  –  August 2012  (1 year 3 months) Beaverton, Oregon Working in the Video Product Line group, developed an Altera Cyclone-IV design for monitoring QAM/DOCSIS signal quality. The design incorporated 4 FPGA’s, a CPLD, QAM demodulator IP, DDR2, A-to-D interface, and a PCIe gen2 interface on a PCIe card in a Linux server. Wrote software for embedded soft Nios2 processor. Developed a custom method for reprogramming the FPGA image via the PCIe. Used Verilog, with IP in VHDL, Modelsim, NC-Verilog, LSF, Quartus and Eclipse and GCC for software development. Participated in extensive hardware design reviews and collaboration. This project required simultaneous development of the hardware, embedded Nios software, Linux drivers, and a UI. Senior FPGA Engineer RadiSys Corporation December 2006  –  June 2011  (4 years 7 months) Hillsboro, Oregon Completed several FPGA designs start to finish. Developed a Xilinx Spartan-3A design for specialized telecom and custom OS functions in an embedded Pentium blade, with fail-safe features. Completed a Spartan-6 Design with XAUI . Did several new designs for Lattice and Actel devices. Sustaining work on legacy designs with Lattice, Altera, Actel and Xilinx devices. Management of the Linux system, EDA tool management. Transitioned the FPGA development flow from CVS to ClearCase. Left due to transition of design work to China Senior FPGA Engineer RadiSys Corporation December 2006  –  June 2011  (4 years 7 months) Hillsboro, Oregon Completed several FPGA designs start to finish. Developed a Xilinx Spartan-3A design for specialized telecom and custom OS functions in an embedded Pentium blade, with fail-safe features. Completed a Spartan-6 Design with XAUI . Did several new designs for Lattice and Actel devices. Sustaining work on legacy designs with Lattice, Altera, Actel and Xilinx devices. Management of the Linux system, EDA tool management. Transitioned the FPGA development flow from CVS to ClearCase. Left due to transition of design work to China Senior FPGA Engineer Rockwell Collins September 2005  –  September 2006  (1 year 1 month) Developed a Xilinx Virtex-4 VHDL design for a head-up display, processing video data received via a fibre-channel interface and formatted for display on a projection LCD. Senior FPGA Engineer Rockwell Collins September 2005  –  September 2006  (1 year 1 month) Developed a Xilinx Virtex-4 VHDL design for a head-up display, processing video data received via a fibre-channel interface and formatted for display on a projection LCD. Senior EDA Engineer Focus Enhancements 2000  –  2005  (5 years) Focus Enhancements is a small fabless semiconductor company, specializing in video processors. I worked in all aspects of the ASIC design and FPGA emulation flow, while using an outside vendor for physical design. One of our ASICs went into the MS X-Box, over 10,000,000 sold. Managed the tool flow, maintained the build scripts, wrote scripts for sign-off timing verification with Synopsys PrimeTime. Managed dual-target development flow using various scripts, makefiles, etc. to target FPGA for development of ASIC end product. Senior EDA Engineer Focus Enhancements 2000  –  2005  (5 years) Focus Enhancements is a small fabless semiconductor company, specializing in video processors. I worked in all aspects of the ASIC design and FPGA emulation flow, while using an outside vendor for physical design. One of our ASICs went into the MS X-Box, over 10,000,000 sold. Managed the tool flow, maintained the build scripts, wrote scripts for sign-off timing verification with Synopsys PrimeTime. Managed dual-target development flow using various scripts, makefiles, etc. to target FPGA for development of ASIC end product. Senior Electrical Engineer FLIR Systems 1998  –  2000  (2 years) Developed digital electronic hardware and software. Wrote ‘C’ code for a five-processor (8031) embedded system controlling an airborne video surveillance camera system. Senior engineer position, directed the work of other engineers. Performed sustaining engineering on several products. Senior Electrical Engineer FLIR Systems 1998  –  2000  (2 years) Developed digital electronic hardware and software. Wrote ‘C’ code for a five-processor (8031) embedded system controlling an airborne video surveillance camera system. Senior engineer position, directed the work of other engineers. Performed sustaining engineering on several products. Senior Electrical Engineer Kentrox ADC 1997  –  1998  (1 year) Beaverton, Oregon Modified several physical-layer protocol boards in an ATM WAN access device, making changes to hardware, software and FPGAs (using VHDL, Mentor Graphics tool set), to incorporate new capabilities into the existing products. Sustaining work on existing products Senior Electrical Engineer Kentrox ADC 1997  –  1998  (1 year) Beaverton, Oregon Modified several physical-layer protocol boards in an ATM WAN access device, making changes to hardware, software and FPGAs (using VHDL, Mentor Graphics tool set), to incorporate new capabilities into the existing products. Sustaining work on existing products Senior Electrical Engineer Peek Traffic 1996  –  1997  (1 year) Developed several microprocessor-based products for traffic control applications. Developed 'C' code for those products. Sole electrical engineer on staff. Senior Electrical Engineer Peek Traffic 1996  –  1997  (1 year) Developed several microprocessor-based products for traffic control applications. Developed 'C' code for those products. Sole electrical engineer on staff. Member, Technical Staff Synopsys June 1995  –  June 1996  (1 year 1 month) Worked for the Logic Modeling Group in Hillsboro, Oregon. Developed RTL models, wrote verification test suites and RTL models of several micro-controllers in VHDL. Member, Technical Staff Synopsys June 1995  –  June 1996  (1 year 1 month) Worked for the Logic Modeling Group in Hillsboro, Oregon. Developed RTL models, wrote verification test suites and RTL models of several micro-controllers in VHDL. Senior Electrical Engineer II Morrow Inc. 1987  –  1995  (8 years) Worked on a wide variety of avionic and electronic devices, developing both hardware and software development. Supervised a staff of 3 in hardware development of the DIAD, an electronic clipboard used by 60,000 United Parcel Service drivers. Senior Electrical Engineer II Morrow Inc. 1987  –  1995  (8 years) Worked on a wide variety of avionic and electronic devices, developing both hardware and software development. Supervised a staff of 3 in hardware development of the DIAD, an electronic clipboard used by 60,000 United Parcel Service drivers. Skills ASIC VHDL Verilog FPGA RTL design EDA ClearCase TCL Embedded Software ModelSim Xilinx PCIe Perl Altera SPI I2C Simulation VCS CVS FPGA Verfication Debugging Veritas Cluster Server Hardware Architecture Simulations PCB design Schematic Capture Analog Firmware Logic Synthesis Hardware Orcad Processors Electronics Semiconductors Device Drivers Microcontrollers CPLD C NCSim Testing Signal Integrity See 26+     See less Skills  ASIC VHDL Verilog FPGA RTL design EDA ClearCase TCL Embedded Software ModelSim Xilinx PCIe Perl Altera SPI I2C Simulation VCS CVS FPGA Verfication Debugging Veritas Cluster Server Hardware Architecture Simulations PCB design Schematic Capture Analog Firmware Logic Synthesis Hardware Orcad Processors Electronics Semiconductors Device Drivers Microcontrollers CPLD C NCSim Testing Signal Integrity See 26+     See less ASIC VHDL Verilog FPGA RTL design EDA ClearCase TCL Embedded Software ModelSim Xilinx PCIe Perl Altera SPI I2C Simulation VCS CVS FPGA Verfication Debugging Veritas Cluster Server Hardware Architecture Simulations PCB design Schematic Capture Analog Firmware Logic Synthesis Hardware Orcad Processors Electronics Semiconductors Device Drivers Microcontrollers CPLD C NCSim Testing Signal Integrity See 26+     See less ASIC VHDL Verilog FPGA RTL design EDA ClearCase TCL Embedded Software ModelSim Xilinx PCIe Perl Altera SPI I2C Simulation VCS CVS FPGA Verfication Debugging Veritas Cluster Server Hardware Architecture Simulations PCB design Schematic Capture Analog Firmware Logic Synthesis Hardware Orcad Processors Electronics Semiconductors Device Drivers Microcontrollers CPLD C NCSim Testing Signal Integrity See 26+     See less Education OCATE Post-Graduate Classes,  VHDL, FPGA 1995  – 1995 Oregon State University BSEE,  Electrical Engineering 1980  – 1985 Activities and Societies:  Studying OCATE Post-Graduate Classes,  VHDL, FPGA 1995  – 1995 OCATE Post-Graduate Classes,  VHDL, FPGA 1995  – 1995 OCATE Post-Graduate Classes,  VHDL, FPGA 1995  – 1995 Oregon State University BSEE,  Electrical Engineering 1980  – 1985 Activities and Societies:  Studying Oregon State University BSEE,  Electrical Engineering 1980  – 1985 Activities and Societies:  Studying Oregon State University BSEE,  Electrical Engineering 1980  – 1985 Activities and Societies:  Studying ", "Experience VLSI ASIC engineer Intel Corporation May 2014  – Present (1 year 4 months) Yakum, Israek VLSI ASIC Engineer Copper-Gate April 2008  –  May 2014  (6 years 2 months) Tel Aviv VLSI ASIC designer Marvell Israel Ltd. August 2006  –  April 2008  (1 year 9 months) VLSI ASIC engineer Intel Corporation November 1999  –  August 2006  (6 years 10 months) VLSI ASIC engineer Intel Corporation May 2014  – Present (1 year 4 months) Yakum, Israek VLSI ASIC engineer Intel Corporation May 2014  – Present (1 year 4 months) Yakum, Israek VLSI ASIC Engineer Copper-Gate April 2008  –  May 2014  (6 years 2 months) Tel Aviv VLSI ASIC Engineer Copper-Gate April 2008  –  May 2014  (6 years 2 months) Tel Aviv VLSI ASIC designer Marvell Israel Ltd. August 2006  –  April 2008  (1 year 9 months) VLSI ASIC designer Marvell Israel Ltd. August 2006  –  April 2008  (1 year 9 months) VLSI ASIC engineer Intel Corporation November 1999  –  August 2006  (6 years 10 months) VLSI ASIC engineer Intel Corporation November 1999  –  August 2006  (6 years 10 months) Languages English English English Skills Debugging ASIC SystemVerilog RTL design VLSI Verilog Logic Design FPGA SoC Functional Verification Static Timing Analysis DFT Processors ARM Digital Signal... IC Mixed Signal See 2+     See less Skills  Debugging ASIC SystemVerilog RTL design VLSI Verilog Logic Design FPGA SoC Functional Verification Static Timing Analysis DFT Processors ARM Digital Signal... IC Mixed Signal See 2+     See less Debugging ASIC SystemVerilog RTL design VLSI Verilog Logic Design FPGA SoC Functional Verification Static Timing Analysis DFT Processors ARM Digital Signal... IC Mixed Signal See 2+     See less Debugging ASIC SystemVerilog RTL design VLSI Verilog Logic Design FPGA SoC Functional Verification Static Timing Analysis DFT Processors ARM Digital Signal... IC Mixed Signal See 2+     See less Education Technion - Israel Institute of Technology 1996  – 1999 Technion - Israel Institute of Technology 1996  – 1999 Technion - Israel Institute of Technology 1996  – 1999 Technion - Israel Institute of Technology 1996  – 1999 "]}