{"position": "Buyer", "company": "Intel Corporation", "profiles": ["Experience 3PL Supplier Manager Intel Corporation September 2014  – Present (1 year) Intel Ireland Supplier Manager responsible for site's chemical and gas 3PL provider Gases Buyer Intel Corporation November 2011  –  September 2014  (2 years 11 months) Intel Ireland Buyer responsible for procurement of gases for factory operations Ireland Site Supply Line POC Intel Corporation April 2011  –  November 2011  (8 months) Intel Ireland Project Management role. Site POC responsible for supply line management of spare parts for factory install and qual project. Gas and Chemicals Buyer Intel Corporation January 2009  –  April 2011  (2 years 4 months) Intel Ireland Buyer responsible for procurement of gas and chemicals for factory operations Spare Parts Buyer Intel Corporation January 2007  –  December 2008  (2 years) Intel Ireland Buyer responsible for procurement of spare parts from major semiconductor equipment supplier. Spare Parts Buyer Intel Corporation January 2006  –  December 2006  (1 year) Intel Ireland Buyer responsible for procurement of spare parts from multiple medium-sized semiconductor equipment suppliers Inventory Analyst Intel Corporation October 2004  –  December 2005  (1 year 3 months) Intel Ireland Responsible for new part adds to site Bill of Materials and analysis of inventory profile to minimise inventory on hand. Capital Finance Analyst Intel Corporation June 2003  –  September 2004  (1 year 4 months) Intel Ireland Responsible for capital project spending and depreciation forecasting 3PL Supplier Manager Intel Corporation September 2014  – Present (1 year) Intel Ireland Supplier Manager responsible for site's chemical and gas 3PL provider 3PL Supplier Manager Intel Corporation September 2014  – Present (1 year) Intel Ireland Supplier Manager responsible for site's chemical and gas 3PL provider Gases Buyer Intel Corporation November 2011  –  September 2014  (2 years 11 months) Intel Ireland Buyer responsible for procurement of gases for factory operations Gases Buyer Intel Corporation November 2011  –  September 2014  (2 years 11 months) Intel Ireland Buyer responsible for procurement of gases for factory operations Ireland Site Supply Line POC Intel Corporation April 2011  –  November 2011  (8 months) Intel Ireland Project Management role. Site POC responsible for supply line management of spare parts for factory install and qual project. Ireland Site Supply Line POC Intel Corporation April 2011  –  November 2011  (8 months) Intel Ireland Project Management role. Site POC responsible for supply line management of spare parts for factory install and qual project. Gas and Chemicals Buyer Intel Corporation January 2009  –  April 2011  (2 years 4 months) Intel Ireland Buyer responsible for procurement of gas and chemicals for factory operations Gas and Chemicals Buyer Intel Corporation January 2009  –  April 2011  (2 years 4 months) Intel Ireland Buyer responsible for procurement of gas and chemicals for factory operations Spare Parts Buyer Intel Corporation January 2007  –  December 2008  (2 years) Intel Ireland Buyer responsible for procurement of spare parts from major semiconductor equipment supplier. Spare Parts Buyer Intel Corporation January 2007  –  December 2008  (2 years) Intel Ireland Buyer responsible for procurement of spare parts from major semiconductor equipment supplier. Spare Parts Buyer Intel Corporation January 2006  –  December 2006  (1 year) Intel Ireland Buyer responsible for procurement of spare parts from multiple medium-sized semiconductor equipment suppliers Spare Parts Buyer Intel Corporation January 2006  –  December 2006  (1 year) Intel Ireland Buyer responsible for procurement of spare parts from multiple medium-sized semiconductor equipment suppliers Inventory Analyst Intel Corporation October 2004  –  December 2005  (1 year 3 months) Intel Ireland Responsible for new part adds to site Bill of Materials and analysis of inventory profile to minimise inventory on hand. Inventory Analyst Intel Corporation October 2004  –  December 2005  (1 year 3 months) Intel Ireland Responsible for new part adds to site Bill of Materials and analysis of inventory profile to minimise inventory on hand. Capital Finance Analyst Intel Corporation June 2003  –  September 2004  (1 year 4 months) Intel Ireland Responsible for capital project spending and depreciation forecasting Capital Finance Analyst Intel Corporation June 2003  –  September 2004  (1 year 4 months) Intel Ireland Responsible for capital project spending and depreciation forecasting Skills Procurement Supply Management Forecasting Project Management Data Analysis Supply Chain Management Process Improvement Skills  Procurement Supply Management Forecasting Project Management Data Analysis Supply Chain Management Process Improvement Procurement Supply Management Forecasting Project Management Data Analysis Supply Chain Management Process Improvement Procurement Supply Management Forecasting Project Management Data Analysis Supply Chain Management Process Improvement Education Dublin City University BBS,  Finance 1999  – 2003 Supplier Manager responsible for overseeing chemical and gas 3PL provider Dublin City University BBS,  Finance 1999  – 2003 Supplier Manager responsible for overseeing chemical and gas 3PL provider Dublin City University BBS,  Finance 1999  – 2003 Supplier Manager responsible for overseeing chemical and gas 3PL provider Dublin City University BBS,  Finance 1999  – 2003 Supplier Manager responsible for overseeing chemical and gas 3PL provider ", "Summary Graduate of Michigan State University with a B.A. in Supply Chain Management with Specialization in Information Technology  \n \nGoals:  \n \nHelp pass on knowledge and information to other individuals and future generations to better benefit them Summary Graduate of Michigan State University with a B.A. in Supply Chain Management with Specialization in Information Technology  \n \nGoals:  \n \nHelp pass on knowledge and information to other individuals and future generations to better benefit them Graduate of Michigan State University with a B.A. in Supply Chain Management with Specialization in Information Technology  \n \nGoals:  \n \nHelp pass on knowledge and information to other individuals and future generations to better benefit them Graduate of Michigan State University with a B.A. in Supply Chain Management with Specialization in Information Technology  \n \nGoals:  \n \nHelp pass on knowledge and information to other individuals and future generations to better benefit them Experience Buyer Intel Corporation March 2014  – Present (1 year 6 months) hillsboro, or GSC - UR Sourcing & Contracting - Unconventionals Intern Hess Corporation May 2013  –  August 2013  (4 months) houston, texas area •Provided cost savings for Hess Corporation by recommending and implementing new supply chain strategies to increase efficiency for the P2P invoicing process  \n•Created internal materials including score card metrics for Bakken engineering design RFPs \n•Conducted spend analysis & managerial reports used by VPs and executives in determining progress of company reorganization Global Procurement: Transportation & Logistics Intern Marathon Petroleum Company May 2012  –  August 2012  (4 months) Findlay, OH • Planned and analyzed six successful bids regarding major projects for the benefit of the company, resulting in reduced expenses \n• Executed business necessary reports including the expedite, lead time, and ProPurchaser report \n• Fabricated the T & L Contractor Reference Guide to increase efficiency and simplicity. Guest Services Intern Marriott International May 2011  –  August 2011  (4 months) Charleston, South Carolina Area Guest and Rooms Relations \nConducted Managerial Reports regarding resort information/issues \nMaintained proper upkeep of 192 villas across three properties \nDeveloped new templates and methods for the front office for efficiency and simplicity Buyer Intel Corporation March 2014  – Present (1 year 6 months) hillsboro, or Buyer Intel Corporation March 2014  – Present (1 year 6 months) hillsboro, or GSC - UR Sourcing & Contracting - Unconventionals Intern Hess Corporation May 2013  –  August 2013  (4 months) houston, texas area •Provided cost savings for Hess Corporation by recommending and implementing new supply chain strategies to increase efficiency for the P2P invoicing process  \n•Created internal materials including score card metrics for Bakken engineering design RFPs \n•Conducted spend analysis & managerial reports used by VPs and executives in determining progress of company reorganization GSC - UR Sourcing & Contracting - Unconventionals Intern Hess Corporation May 2013  –  August 2013  (4 months) houston, texas area •Provided cost savings for Hess Corporation by recommending and implementing new supply chain strategies to increase efficiency for the P2P invoicing process  \n•Created internal materials including score card metrics for Bakken engineering design RFPs \n•Conducted spend analysis & managerial reports used by VPs and executives in determining progress of company reorganization Global Procurement: Transportation & Logistics Intern Marathon Petroleum Company May 2012  –  August 2012  (4 months) Findlay, OH • Planned and analyzed six successful bids regarding major projects for the benefit of the company, resulting in reduced expenses \n• Executed business necessary reports including the expedite, lead time, and ProPurchaser report \n• Fabricated the T & L Contractor Reference Guide to increase efficiency and simplicity. Global Procurement: Transportation & Logistics Intern Marathon Petroleum Company May 2012  –  August 2012  (4 months) Findlay, OH • Planned and analyzed six successful bids regarding major projects for the benefit of the company, resulting in reduced expenses \n• Executed business necessary reports including the expedite, lead time, and ProPurchaser report \n• Fabricated the T & L Contractor Reference Guide to increase efficiency and simplicity. Guest Services Intern Marriott International May 2011  –  August 2011  (4 months) Charleston, South Carolina Area Guest and Rooms Relations \nConducted Managerial Reports regarding resort information/issues \nMaintained proper upkeep of 192 villas across three properties \nDeveloped new templates and methods for the front office for efficiency and simplicity Guest Services Intern Marriott International May 2011  –  August 2011  (4 months) Charleston, South Carolina Area Guest and Rooms Relations \nConducted Managerial Reports regarding resort information/issues \nMaintained proper upkeep of 192 villas across three properties \nDeveloped new templates and methods for the front office for efficiency and simplicity Skills Microsoft Office Microsoft Excel Marketing Sales Leadership Social Networking Supply Chain Management Market Research Customer Service Procurement Public Speaking PowerPoint Accounting Social Media Budgets Teamwork Microsoft Word Logistics Event Planning Team Leadership CRM Data Analysis Event Management Inventory Management Facebook Social Media Marketing Sourcing Purchasing Time Management Supply Chain See 15+     See less Skills  Microsoft Office Microsoft Excel Marketing Sales Leadership Social Networking Supply Chain Management Market Research Customer Service Procurement Public Speaking PowerPoint Accounting Social Media Budgets Teamwork Microsoft Word Logistics Event Planning Team Leadership CRM Data Analysis Event Management Inventory Management Facebook Social Media Marketing Sourcing Purchasing Time Management Supply Chain See 15+     See less Microsoft Office Microsoft Excel Marketing Sales Leadership Social Networking Supply Chain Management Market Research Customer Service Procurement Public Speaking PowerPoint Accounting Social Media Budgets Teamwork Microsoft Word Logistics Event Planning Team Leadership CRM Data Analysis Event Management Inventory Management Facebook Social Media Marketing Sourcing Purchasing Time Management Supply Chain See 15+     See less Microsoft Office Microsoft Excel Marketing Sales Leadership Social Networking Supply Chain Management Market Research Customer Service Procurement Public Speaking PowerPoint Accounting Social Media Budgets Teamwork Microsoft Word Logistics Event Planning Team Leadership CRM Data Analysis Event Management Inventory Management Facebook Social Media Marketing Sourcing Purchasing Time Management Supply Chain See 15+     See less Education Michigan State University, Eli Broad College of Business Bachelor of Arts,  Supply Chain 2010  – 2014 Activities and Societies:  Michigan State University Honors College Member\nPublicity Chair of Native American Hispanic Business Students\nMulticultural Business Progams\nNational Society of Minorities in Hospitality\nTreasurer of Chinese Student Coalition Ithaca High School Diploma 2006  – 2010 Michigan State University Michigan State University, Eli Broad College of Business Bachelor of Arts,  Supply Chain 2010  – 2014 Activities and Societies:  Michigan State University Honors College Member\nPublicity Chair of Native American Hispanic Business Students\nMulticultural Business Progams\nNational Society of Minorities in Hospitality\nTreasurer of Chinese Student Coalition Michigan State University, Eli Broad College of Business Bachelor of Arts,  Supply Chain 2010  – 2014 Activities and Societies:  Michigan State University Honors College Member\nPublicity Chair of Native American Hispanic Business Students\nMulticultural Business Progams\nNational Society of Minorities in Hospitality\nTreasurer of Chinese Student Coalition Michigan State University, Eli Broad College of Business Bachelor of Arts,  Supply Chain 2010  – 2014 Activities and Societies:  Michigan State University Honors College Member\nPublicity Chair of Native American Hispanic Business Students\nMulticultural Business Progams\nNational Society of Minorities in Hospitality\nTreasurer of Chinese Student Coalition Ithaca High School Diploma 2006  – 2010 Ithaca High School Diploma 2006  – 2010 Ithaca High School Diploma 2006  – 2010 Michigan State University Michigan State University Michigan State University Honors & Awards ", "Summary A motivated individual contributor with a bachelor’s degree in business, majoring in finance and minoring in math and economics. A desire to work with emerging technologies at a growing company. A six year career in the fast paced high tech industry at Intel. A planner by nature who excels at working with customers. Successful forecaster for spares, services, chemicals and gases. A win-win negotiator when working with suppliers and customers. Mentor and trainer in both one-on-one and small group settings. Awarded for results orientation, discipline and exceeding inventory management goals. Summary A motivated individual contributor with a bachelor’s degree in business, majoring in finance and minoring in math and economics. A desire to work with emerging technologies at a growing company. A six year career in the fast paced high tech industry at Intel. A planner by nature who excels at working with customers. Successful forecaster for spares, services, chemicals and gases. A win-win negotiator when working with suppliers and customers. Mentor and trainer in both one-on-one and small group settings. Awarded for results orientation, discipline and exceeding inventory management goals. A motivated individual contributor with a bachelor’s degree in business, majoring in finance and minoring in math and economics. A desire to work with emerging technologies at a growing company. A six year career in the fast paced high tech industry at Intel. A planner by nature who excels at working with customers. Successful forecaster for spares, services, chemicals and gases. A win-win negotiator when working with suppliers and customers. Mentor and trainer in both one-on-one and small group settings. Awarded for results orientation, discipline and exceeding inventory management goals. A motivated individual contributor with a bachelor’s degree in business, majoring in finance and minoring in math and economics. A desire to work with emerging technologies at a growing company. A six year career in the fast paced high tech industry at Intel. A planner by nature who excels at working with customers. Successful forecaster for spares, services, chemicals and gases. A win-win negotiator when working with suppliers and customers. Mentor and trainer in both one-on-one and small group settings. Awarded for results orientation, discipline and exceeding inventory management goals. Experience Volunteer community 2005  – Present (10 years) Teacher; Small group facilitator; Event planner; Tutor; Coach Foster Parent Oregon Department of Human Services October 2012  –  February 2014  (1 year 5 months) Advocated for the needs of the child; Initiated and coordinated treatment plans; Demonstrated diplomacy and persistence in working with case worker, lawyers and parents; Successfully transitioned child home to parent Commodity Specialist Intel Corporation 2003  –  2005  (2 years) Forecasted the supply of chemicals and gases for all Oregon factories including manufacturing and development sites. Used influencing and strong knowledge of process-flow through supply chain to improve department’s logistics routing compliance from 64 to 92%. Negotiated portions of spares and services contract with supplier. Led data transition for department during implementation of SAP. Trained department on SAP as a team member of the training team. Visualized and implemented a new supplier management structure for a small commodity requiring coordination and buy in from factory customers, finance, other sites, and supplier. Senior Buyer Intel Corporation 2001  –  2003  (2 years) Hillsboro, OR Influenced factory customers resulting in a 20% reduction in inventory with no impact to availability. Meeting facilitation and presentations in person and via phone with sites world wide. Vital role in implementing Total Supplier Management for Intel’s largest supplier Resulted in a record breaking inventory buyback and increased availability. Consistently ranked in the top tier for customer satisfaction on peer and customer feedback and manager reviews. Buyer Intel Corporation 1999  –  2001  (2 years) Hillsboro, OR Worked with factory customers and suppliers to maintain spare part availability while limiting the financial exposure of both the company and supplier. Collaborated across multiple organizations and sites worldwide. Managed expedited delivery schedule for installation of pumps in new factory. Resolved inventory issues, past due orders and invoices. Volunteer community 2005  – Present (10 years) Teacher; Small group facilitator; Event planner; Tutor; Coach Volunteer community 2005  – Present (10 years) Teacher; Small group facilitator; Event planner; Tutor; Coach Foster Parent Oregon Department of Human Services October 2012  –  February 2014  (1 year 5 months) Advocated for the needs of the child; Initiated and coordinated treatment plans; Demonstrated diplomacy and persistence in working with case worker, lawyers and parents; Successfully transitioned child home to parent Foster Parent Oregon Department of Human Services October 2012  –  February 2014  (1 year 5 months) Advocated for the needs of the child; Initiated and coordinated treatment plans; Demonstrated diplomacy and persistence in working with case worker, lawyers and parents; Successfully transitioned child home to parent Commodity Specialist Intel Corporation 2003  –  2005  (2 years) Forecasted the supply of chemicals and gases for all Oregon factories including manufacturing and development sites. Used influencing and strong knowledge of process-flow through supply chain to improve department’s logistics routing compliance from 64 to 92%. Negotiated portions of spares and services contract with supplier. Led data transition for department during implementation of SAP. Trained department on SAP as a team member of the training team. Visualized and implemented a new supplier management structure for a small commodity requiring coordination and buy in from factory customers, finance, other sites, and supplier. Commodity Specialist Intel Corporation 2003  –  2005  (2 years) Forecasted the supply of chemicals and gases for all Oregon factories including manufacturing and development sites. Used influencing and strong knowledge of process-flow through supply chain to improve department’s logistics routing compliance from 64 to 92%. Negotiated portions of spares and services contract with supplier. Led data transition for department during implementation of SAP. Trained department on SAP as a team member of the training team. Visualized and implemented a new supplier management structure for a small commodity requiring coordination and buy in from factory customers, finance, other sites, and supplier. Senior Buyer Intel Corporation 2001  –  2003  (2 years) Hillsboro, OR Influenced factory customers resulting in a 20% reduction in inventory with no impact to availability. Meeting facilitation and presentations in person and via phone with sites world wide. Vital role in implementing Total Supplier Management for Intel’s largest supplier Resulted in a record breaking inventory buyback and increased availability. Consistently ranked in the top tier for customer satisfaction on peer and customer feedback and manager reviews. Senior Buyer Intel Corporation 2001  –  2003  (2 years) Hillsboro, OR Influenced factory customers resulting in a 20% reduction in inventory with no impact to availability. Meeting facilitation and presentations in person and via phone with sites world wide. Vital role in implementing Total Supplier Management for Intel’s largest supplier Resulted in a record breaking inventory buyback and increased availability. Consistently ranked in the top tier for customer satisfaction on peer and customer feedback and manager reviews. Buyer Intel Corporation 1999  –  2001  (2 years) Hillsboro, OR Worked with factory customers and suppliers to maintain spare part availability while limiting the financial exposure of both the company and supplier. Collaborated across multiple organizations and sites worldwide. Managed expedited delivery schedule for installation of pumps in new factory. Resolved inventory issues, past due orders and invoices. Buyer Intel Corporation 1999  –  2001  (2 years) Hillsboro, OR Worked with factory customers and suppliers to maintain spare part availability while limiting the financial exposure of both the company and supplier. Collaborated across multiple organizations and sites worldwide. Managed expedited delivery schedule for installation of pumps in new factory. Resolved inventory issues, past due orders and invoices. Skills Customer Service Skills  Customer Service Customer Service Customer Service Education Linfield College Bachelor of Science (B.S.),  Finance , General 1995  – 1999 Major:Finance  \nMinors: Math and Economics Activities and Societies:  Alpha Phi ,  SPURs ,  math tutor Intel Corporation 33 hours of project management courses \n40 hours of people management courses Linfield College Bachelor of Science (B.S.),  Finance , General 1995  – 1999 Major:Finance  \nMinors: Math and Economics Activities and Societies:  Alpha Phi ,  SPURs ,  math tutor Linfield College Bachelor of Science (B.S.),  Finance , General 1995  – 1999 Major:Finance  \nMinors: Math and Economics Activities and Societies:  Alpha Phi ,  SPURs ,  math tutor Linfield College Bachelor of Science (B.S.),  Finance , General 1995  – 1999 Major:Finance  \nMinors: Math and Economics Activities and Societies:  Alpha Phi ,  SPURs ,  math tutor Intel Corporation 33 hours of project management courses \n40 hours of people management courses Intel Corporation 33 hours of project management courses \n40 hours of people management courses Intel Corporation 33 hours of project management courses \n40 hours of people management courses ", "Experience Senior Buyer Intel Corporation May 2013  – Present (2 years 4 months) Senior Buyer Intel Corporation May 2013  – Present (2 years 4 months) Senior Buyer Intel Corporation May 2013  – Present (2 years 4 months) ", "Experience Buyer Intel Corporation Master Scheduler/Program Specialist Honeywell 1987  –  2005  (18 years) Buyer Intel Corporation Buyer Intel Corporation Master Scheduler/Program Specialist Honeywell 1987  –  2005  (18 years) Master Scheduler/Program Specialist Honeywell 1987  –  2005  (18 years) Skills Supply Chain Semiconductors Manufacturing Supply Chain Management Materials Management Supply Management Strategic Sourcing MRP Global Sourcing Cross-functional Team... Procurement Supplier Development Spend Analysis Supplier Negotiation Supplier Evaluation Skills  Supply Chain Semiconductors Manufacturing Supply Chain Management Materials Management Supply Management Strategic Sourcing MRP Global Sourcing Cross-functional Team... Procurement Supplier Development Spend Analysis Supplier Negotiation Supplier Evaluation Supply Chain Semiconductors Manufacturing Supply Chain Management Materials Management Supply Management Strategic Sourcing MRP Global Sourcing Cross-functional Team... Procurement Supplier Development Spend Analysis Supplier Negotiation Supplier Evaluation Supply Chain Semiconductors Manufacturing Supply Chain Management Materials Management Supply Management Strategic Sourcing MRP Global Sourcing Cross-functional Team... Procurement Supplier Development Spend Analysis Supplier Negotiation Supplier Evaluation ", "Skills Customer Relations SAP Supply Chain Management Logistics Order Management Supply Management Cross-functional Team... Strategic Sourcing Process Improvement Supply Chain Program Management Six Sigma MRP Semiconductors Lean Manufacturing Project Management Product Marketing Product Lifecycle... See 3+     See less Skills  Customer Relations SAP Supply Chain Management Logistics Order Management Supply Management Cross-functional Team... Strategic Sourcing Process Improvement Supply Chain Program Management Six Sigma MRP Semiconductors Lean Manufacturing Project Management Product Marketing Product Lifecycle... See 3+     See less Customer Relations SAP Supply Chain Management Logistics Order Management Supply Management Cross-functional Team... Strategic Sourcing Process Improvement Supply Chain Program Management Six Sigma MRP Semiconductors Lean Manufacturing Project Management Product Marketing Product Lifecycle... See 3+     See less Customer Relations SAP Supply Chain Management Logistics Order Management Supply Management Cross-functional Team... Strategic Sourcing Process Improvement Supply Chain Program Management Six Sigma MRP Semiconductors Lean Manufacturing Project Management Product Marketing Product Lifecycle... See 3+     See less ", "Experience Supply Chain Analyst Intel Corporation June 2013  – Present (2 years 3 months) Responsible for defining and developing customer supply chain solutions to enable Intel demand fulfilment strategic objectives. Involves timely stakeholder management and coordination of activities in support of exploration, planning, development and deployment phases of business transformation process Senior Indirect Materials Buyer Intel Corporation 2011  –  2013  (2 years) Responsible for spares and services purchasing and inventory management for Thin Films, Diffusion, Implant and Dry Etch. Responsible for supply chain management, supplier management, on-time delivery tracking, quality control, consignment opportunities, and cost savings initiatives. Demand forecasting and inventory optimization for indirect materials. Indirect Material Buyer Intel Corporation 2009  –  2011  (2 years) Coordinated purchasing activities to plan, schedule and monitor the acquisition of materials to meet the consumption cycle requirements. Forecasts and maintains inventory at planned levels. Responsibilities include overseen Novellus, Kokusay, Hitachi and LAM spares parts management. Silicon Systems Engineer Intel Corporation 2006  –  2009  (3 years) As a Silicon Systems Engineer, I partnered with Process Engineering, Manufacturing, Automation, and Industrial Engineering to ensure sustaining and test wafer forecasting, quality, cost and usage reduction, availability, and related Test Wafer systems to meet F17 module team needs. Supply Chain Analyst Intel Corporation June 2013  – Present (2 years 3 months) Responsible for defining and developing customer supply chain solutions to enable Intel demand fulfilment strategic objectives. Involves timely stakeholder management and coordination of activities in support of exploration, planning, development and deployment phases of business transformation process Supply Chain Analyst Intel Corporation June 2013  – Present (2 years 3 months) Responsible for defining and developing customer supply chain solutions to enable Intel demand fulfilment strategic objectives. Involves timely stakeholder management and coordination of activities in support of exploration, planning, development and deployment phases of business transformation process Senior Indirect Materials Buyer Intel Corporation 2011  –  2013  (2 years) Responsible for spares and services purchasing and inventory management for Thin Films, Diffusion, Implant and Dry Etch. Responsible for supply chain management, supplier management, on-time delivery tracking, quality control, consignment opportunities, and cost savings initiatives. Demand forecasting and inventory optimization for indirect materials. Senior Indirect Materials Buyer Intel Corporation 2011  –  2013  (2 years) Responsible for spares and services purchasing and inventory management for Thin Films, Diffusion, Implant and Dry Etch. Responsible for supply chain management, supplier management, on-time delivery tracking, quality control, consignment opportunities, and cost savings initiatives. Demand forecasting and inventory optimization for indirect materials. Indirect Material Buyer Intel Corporation 2009  –  2011  (2 years) Coordinated purchasing activities to plan, schedule and monitor the acquisition of materials to meet the consumption cycle requirements. Forecasts and maintains inventory at planned levels. Responsibilities include overseen Novellus, Kokusay, Hitachi and LAM spares parts management. Indirect Material Buyer Intel Corporation 2009  –  2011  (2 years) Coordinated purchasing activities to plan, schedule and monitor the acquisition of materials to meet the consumption cycle requirements. Forecasts and maintains inventory at planned levels. Responsibilities include overseen Novellus, Kokusay, Hitachi and LAM spares parts management. Silicon Systems Engineer Intel Corporation 2006  –  2009  (3 years) As a Silicon Systems Engineer, I partnered with Process Engineering, Manufacturing, Automation, and Industrial Engineering to ensure sustaining and test wafer forecasting, quality, cost and usage reduction, availability, and related Test Wafer systems to meet F17 module team needs. Silicon Systems Engineer Intel Corporation 2006  –  2009  (3 years) As a Silicon Systems Engineer, I partnered with Process Engineering, Manufacturing, Automation, and Industrial Engineering to ensure sustaining and test wafer forecasting, quality, cost and usage reduction, availability, and related Test Wafer systems to meet F17 module team needs. Skills Semiconductors Cross-functional Team... Lean Manufacturing Continuous Improvement Semiconductor Industry Process Improvement Six Sigma Failure Analysis Manufacturing Skills  Semiconductors Cross-functional Team... Lean Manufacturing Continuous Improvement Semiconductor Industry Process Improvement Six Sigma Failure Analysis Manufacturing Semiconductors Cross-functional Team... Lean Manufacturing Continuous Improvement Semiconductor Industry Process Improvement Six Sigma Failure Analysis Manufacturing Semiconductors Cross-functional Team... Lean Manufacturing Continuous Improvement Semiconductor Industry Process Improvement Six Sigma Failure Analysis Manufacturing ", "Summary I’m a proud Penn State University and Schreyer Honors College graduate with concentrations in both Supply Chain Management and International Business. My background has provided me with many challenging and rewarding opportunities that have helped prepare me to take on real world business situations with a knowledge base that continues to grow on a daily basis.  \n \nRecognizing this, my interests within each of these areas have grown around creativity and optimization, two key supply chain and international business elements that help companies differentiate themselves from their competitors and streamline their operations. Being able to think strategically and communicate effectively to work towards solving complex problems that arise have helped me grow professionally in these two areas of interest.  \n \nNow working as a Chemical Buyer on the Direct Materials Operations Team in Global Supply Management at Intel Corporation, my role is to help provide support for all domestic U.S. Fabs (computer chip factories) by creating 6-month forecasts for materials needed, ensuring current availability of inventory, and overseeing proper payment allocation of associated fees between Intel and its suppliers. Intel is a global company that sources materials from all over the world, and I find working with our international counterparts to be exciting, challenging, and enriching. \n \nOutside of my direct role, I also act as an active board member in the Intel NextGen Professionals Employee Resource Group and assist in managing their social media marketing efforts (Instagram, Twitter), event planning, and on-site assistance for large social gatherings. \n \n**** \n \nMy areas of expertise include: business analytics, material forecasting, strategic planning, supply management, supplier management, digital and social media marketing, relationship building, business process acumen, event coordination, overall technology awareness, and outside of work: photography, film/editing Summary I’m a proud Penn State University and Schreyer Honors College graduate with concentrations in both Supply Chain Management and International Business. My background has provided me with many challenging and rewarding opportunities that have helped prepare me to take on real world business situations with a knowledge base that continues to grow on a daily basis.  \n \nRecognizing this, my interests within each of these areas have grown around creativity and optimization, two key supply chain and international business elements that help companies differentiate themselves from their competitors and streamline their operations. Being able to think strategically and communicate effectively to work towards solving complex problems that arise have helped me grow professionally in these two areas of interest.  \n \nNow working as a Chemical Buyer on the Direct Materials Operations Team in Global Supply Management at Intel Corporation, my role is to help provide support for all domestic U.S. Fabs (computer chip factories) by creating 6-month forecasts for materials needed, ensuring current availability of inventory, and overseeing proper payment allocation of associated fees between Intel and its suppliers. Intel is a global company that sources materials from all over the world, and I find working with our international counterparts to be exciting, challenging, and enriching. \n \nOutside of my direct role, I also act as an active board member in the Intel NextGen Professionals Employee Resource Group and assist in managing their social media marketing efforts (Instagram, Twitter), event planning, and on-site assistance for large social gatherings. \n \n**** \n \nMy areas of expertise include: business analytics, material forecasting, strategic planning, supply management, supplier management, digital and social media marketing, relationship building, business process acumen, event coordination, overall technology awareness, and outside of work: photography, film/editing I’m a proud Penn State University and Schreyer Honors College graduate with concentrations in both Supply Chain Management and International Business. My background has provided me with many challenging and rewarding opportunities that have helped prepare me to take on real world business situations with a knowledge base that continues to grow on a daily basis.  \n \nRecognizing this, my interests within each of these areas have grown around creativity and optimization, two key supply chain and international business elements that help companies differentiate themselves from their competitors and streamline their operations. Being able to think strategically and communicate effectively to work towards solving complex problems that arise have helped me grow professionally in these two areas of interest.  \n \nNow working as a Chemical Buyer on the Direct Materials Operations Team in Global Supply Management at Intel Corporation, my role is to help provide support for all domestic U.S. Fabs (computer chip factories) by creating 6-month forecasts for materials needed, ensuring current availability of inventory, and overseeing proper payment allocation of associated fees between Intel and its suppliers. Intel is a global company that sources materials from all over the world, and I find working with our international counterparts to be exciting, challenging, and enriching. \n \nOutside of my direct role, I also act as an active board member in the Intel NextGen Professionals Employee Resource Group and assist in managing their social media marketing efforts (Instagram, Twitter), event planning, and on-site assistance for large social gatherings. \n \n**** \n \nMy areas of expertise include: business analytics, material forecasting, strategic planning, supply management, supplier management, digital and social media marketing, relationship building, business process acumen, event coordination, overall technology awareness, and outside of work: photography, film/editing I’m a proud Penn State University and Schreyer Honors College graduate with concentrations in both Supply Chain Management and International Business. My background has provided me with many challenging and rewarding opportunities that have helped prepare me to take on real world business situations with a knowledge base that continues to grow on a daily basis.  \n \nRecognizing this, my interests within each of these areas have grown around creativity and optimization, two key supply chain and international business elements that help companies differentiate themselves from their competitors and streamline their operations. Being able to think strategically and communicate effectively to work towards solving complex problems that arise have helped me grow professionally in these two areas of interest.  \n \nNow working as a Chemical Buyer on the Direct Materials Operations Team in Global Supply Management at Intel Corporation, my role is to help provide support for all domestic U.S. Fabs (computer chip factories) by creating 6-month forecasts for materials needed, ensuring current availability of inventory, and overseeing proper payment allocation of associated fees between Intel and its suppliers. Intel is a global company that sources materials from all over the world, and I find working with our international counterparts to be exciting, challenging, and enriching. \n \nOutside of my direct role, I also act as an active board member in the Intel NextGen Professionals Employee Resource Group and assist in managing their social media marketing efforts (Instagram, Twitter), event planning, and on-site assistance for large social gatherings. \n \n**** \n \nMy areas of expertise include: business analytics, material forecasting, strategic planning, supply management, supplier management, digital and social media marketing, relationship building, business process acumen, event coordination, overall technology awareness, and outside of work: photography, film/editing Experience Buyer Intel Corporation March 2014  – Present (1 year 6 months) Hillsboro, OR Research Assistant Penn State University, Center for Global Business Studies April 2011  –  December 2011  (9 months) Assist in research with Penn State University MBA Professor, Dr. Fariborz Ghadar, William A. Schreyer Professor of Global Management, in multiple areas. Aid in preparing case studies for conference use; update, edit, and manage powerpoint and keynote documents to be used in Dr. Ghadar's graduate courses and presentations. Procurement Services Intern Penn State University January 2013  –  December 2013  (1 year) University Park, PA Continued to develop supply chain procurement skills and marketing knowledge through the creation of multiple strategic surveys sent out to employees at Penn State University involving a variety of desired issues. Received and interpreted findings through Microsoft Excel and data analysis software. Reviewed RFP's and engaged in proving support towards negotiation logic.  \n \nProject topics included: \n-Sustainability & Improvement \n-Cost Reduction \n-Supplier Comparisons Global Sourcing and Procurement Intern Intel Corporation May 2013  –  August 2013  (4 months) Hillsboro, OR Department: Global Materials Platform Outsourcing within the Technology Manufacturing Group \n \nInitiated pilot program for a new third party part selection and data management resource across various business units. Became the point person for the pilot program and coordinated user engagement and feedback amongst a cross section of material program managers, commodity managers, and design engineers. Analyzed both quantitative and qualitative feedback to formulate actionable options for the business group to advance negotiations and continue working on getting the new resource put into place. Corporate Purchasing, Packaging Intern The J.M. Smucker Company June 2012  –  December 2012  (7 months) Orrville, OH Collaborated with the Supply Chain: Corporate Purchasing Team, as well as various other departments within the company, to work on projects that will help further progress The J.M. Smucker Company towards it's current goals and strategic business strategies.  \n \nProject topics included: \n-Inbound Freight Cost Optimization \n-Foreign Exchange Rate Study \n-Supplier Portal Database \n-Industry & Supplier Analyses \n-Fleet Utilization Project \n \n-Chosen to be a J.M. Smucker Company Campus Ambassador for Penn State University during the 2012-2013 academic year. Campus Representative Apple Inc. January 2011  –  December 2011  (1 year) Promote the Apple brand on the Penn State University: University Park campus through planning and launching different marketing and advertising events for students, faculty, and staff to take part in using Apple technology. In charge of teaching application workshops on campus as well as searching for new ways to implement Apply technology into the university that will be educationally beneficial to students and faculty. Peer-Network Engagement Intern, Penn State Hillel Hillel August 2010  –  December 2011  (1 year 5 months) United States Help in the direction, supervision, and the formation of relationships with other Jewish students on campus and getting them involved with their own Jewish lives (promoting their Jewish identity). Serve as a resource to help connect them to several different opportunities and meaningful Jewish experiences through campus-based organizations and other activities/linkages. Created and manage a new initiative on campus: the launch of a new organization called J.O.G (Jewish Outdoor Group) designed to encourage students to interact with each other through engaging in a number of outdoor/outgoing activities. Business Plan Development Team Onward State August 2010  –  December 2010  (5 months) As a part of the development team, worked to produce a five-year business plan for the hyper-local news media website that was seeking to develop and expand within upcoming years. Designed to implement a strategic business plan to help Onward State operate its tasks in accordance with the estimated outlook of their company. Looked into all areas of business, from their market description, target audience, marketing plan and social responsibility, technology, management and operations, to their financials, our business plan provided well-rounded information and research critical toward assisting the company in their success as they begin their expansion. Shift Manager & Staff Member Dunkin' Donuts June 2006  –  December 2010  (4 years 7 months) For the past four years, worked up the ladder from a staff counter-help position to a shift manager position. Promotion to this management position carried the responsibility to direct and supervise organized shifts of up to 8 or more co-workers. Became experienced in assigning daily tasks and reminders, handling cash sales at the end of shift/day (ranging between $500-$2,000), up-selling products to customers in order to increase sales, and setting up marketing campaign materials at the beginning of each window period. Co-Investigator Sony Corporation August 2009  –  December 2009  (5 months) Studied Sony Electronic Reader* as a device to identify advantages of its potential adoption as part of the college lifestyle; designed and created a marketing plan for Sony Corp. with creative ideas as to how the company might reach its goals for the product; explained the results and reasoning from the study to Sony executives and other Penn State officials. Buyer Intel Corporation March 2014  – Present (1 year 6 months) Hillsboro, OR Buyer Intel Corporation March 2014  – Present (1 year 6 months) Hillsboro, OR Research Assistant Penn State University, Center for Global Business Studies April 2011  –  December 2011  (9 months) Assist in research with Penn State University MBA Professor, Dr. Fariborz Ghadar, William A. Schreyer Professor of Global Management, in multiple areas. Aid in preparing case studies for conference use; update, edit, and manage powerpoint and keynote documents to be used in Dr. Ghadar's graduate courses and presentations. Research Assistant Penn State University, Center for Global Business Studies April 2011  –  December 2011  (9 months) Assist in research with Penn State University MBA Professor, Dr. Fariborz Ghadar, William A. Schreyer Professor of Global Management, in multiple areas. Aid in preparing case studies for conference use; update, edit, and manage powerpoint and keynote documents to be used in Dr. Ghadar's graduate courses and presentations. Procurement Services Intern Penn State University January 2013  –  December 2013  (1 year) University Park, PA Continued to develop supply chain procurement skills and marketing knowledge through the creation of multiple strategic surveys sent out to employees at Penn State University involving a variety of desired issues. Received and interpreted findings through Microsoft Excel and data analysis software. Reviewed RFP's and engaged in proving support towards negotiation logic.  \n \nProject topics included: \n-Sustainability & Improvement \n-Cost Reduction \n-Supplier Comparisons Procurement Services Intern Penn State University January 2013  –  December 2013  (1 year) University Park, PA Continued to develop supply chain procurement skills and marketing knowledge through the creation of multiple strategic surveys sent out to employees at Penn State University involving a variety of desired issues. Received and interpreted findings through Microsoft Excel and data analysis software. Reviewed RFP's and engaged in proving support towards negotiation logic.  \n \nProject topics included: \n-Sustainability & Improvement \n-Cost Reduction \n-Supplier Comparisons Global Sourcing and Procurement Intern Intel Corporation May 2013  –  August 2013  (4 months) Hillsboro, OR Department: Global Materials Platform Outsourcing within the Technology Manufacturing Group \n \nInitiated pilot program for a new third party part selection and data management resource across various business units. Became the point person for the pilot program and coordinated user engagement and feedback amongst a cross section of material program managers, commodity managers, and design engineers. Analyzed both quantitative and qualitative feedback to formulate actionable options for the business group to advance negotiations and continue working on getting the new resource put into place. Global Sourcing and Procurement Intern Intel Corporation May 2013  –  August 2013  (4 months) Hillsboro, OR Department: Global Materials Platform Outsourcing within the Technology Manufacturing Group \n \nInitiated pilot program for a new third party part selection and data management resource across various business units. Became the point person for the pilot program and coordinated user engagement and feedback amongst a cross section of material program managers, commodity managers, and design engineers. Analyzed both quantitative and qualitative feedback to formulate actionable options for the business group to advance negotiations and continue working on getting the new resource put into place. Corporate Purchasing, Packaging Intern The J.M. Smucker Company June 2012  –  December 2012  (7 months) Orrville, OH Collaborated with the Supply Chain: Corporate Purchasing Team, as well as various other departments within the company, to work on projects that will help further progress The J.M. Smucker Company towards it's current goals and strategic business strategies.  \n \nProject topics included: \n-Inbound Freight Cost Optimization \n-Foreign Exchange Rate Study \n-Supplier Portal Database \n-Industry & Supplier Analyses \n-Fleet Utilization Project \n \n-Chosen to be a J.M. Smucker Company Campus Ambassador for Penn State University during the 2012-2013 academic year. Corporate Purchasing, Packaging Intern The J.M. Smucker Company June 2012  –  December 2012  (7 months) Orrville, OH Collaborated with the Supply Chain: Corporate Purchasing Team, as well as various other departments within the company, to work on projects that will help further progress The J.M. Smucker Company towards it's current goals and strategic business strategies.  \n \nProject topics included: \n-Inbound Freight Cost Optimization \n-Foreign Exchange Rate Study \n-Supplier Portal Database \n-Industry & Supplier Analyses \n-Fleet Utilization Project \n \n-Chosen to be a J.M. Smucker Company Campus Ambassador for Penn State University during the 2012-2013 academic year. Campus Representative Apple Inc. January 2011  –  December 2011  (1 year) Promote the Apple brand on the Penn State University: University Park campus through planning and launching different marketing and advertising events for students, faculty, and staff to take part in using Apple technology. In charge of teaching application workshops on campus as well as searching for new ways to implement Apply technology into the university that will be educationally beneficial to students and faculty. Campus Representative Apple Inc. January 2011  –  December 2011  (1 year) Promote the Apple brand on the Penn State University: University Park campus through planning and launching different marketing and advertising events for students, faculty, and staff to take part in using Apple technology. In charge of teaching application workshops on campus as well as searching for new ways to implement Apply technology into the university that will be educationally beneficial to students and faculty. Peer-Network Engagement Intern, Penn State Hillel Hillel August 2010  –  December 2011  (1 year 5 months) United States Help in the direction, supervision, and the formation of relationships with other Jewish students on campus and getting them involved with their own Jewish lives (promoting their Jewish identity). Serve as a resource to help connect them to several different opportunities and meaningful Jewish experiences through campus-based organizations and other activities/linkages. Created and manage a new initiative on campus: the launch of a new organization called J.O.G (Jewish Outdoor Group) designed to encourage students to interact with each other through engaging in a number of outdoor/outgoing activities. Peer-Network Engagement Intern, Penn State Hillel Hillel August 2010  –  December 2011  (1 year 5 months) United States Help in the direction, supervision, and the formation of relationships with other Jewish students on campus and getting them involved with their own Jewish lives (promoting their Jewish identity). Serve as a resource to help connect them to several different opportunities and meaningful Jewish experiences through campus-based organizations and other activities/linkages. Created and manage a new initiative on campus: the launch of a new organization called J.O.G (Jewish Outdoor Group) designed to encourage students to interact with each other through engaging in a number of outdoor/outgoing activities. Business Plan Development Team Onward State August 2010  –  December 2010  (5 months) As a part of the development team, worked to produce a five-year business plan for the hyper-local news media website that was seeking to develop and expand within upcoming years. Designed to implement a strategic business plan to help Onward State operate its tasks in accordance with the estimated outlook of their company. Looked into all areas of business, from their market description, target audience, marketing plan and social responsibility, technology, management and operations, to their financials, our business plan provided well-rounded information and research critical toward assisting the company in their success as they begin their expansion. Business Plan Development Team Onward State August 2010  –  December 2010  (5 months) As a part of the development team, worked to produce a five-year business plan for the hyper-local news media website that was seeking to develop and expand within upcoming years. Designed to implement a strategic business plan to help Onward State operate its tasks in accordance with the estimated outlook of their company. Looked into all areas of business, from their market description, target audience, marketing plan and social responsibility, technology, management and operations, to their financials, our business plan provided well-rounded information and research critical toward assisting the company in their success as they begin their expansion. Shift Manager & Staff Member Dunkin' Donuts June 2006  –  December 2010  (4 years 7 months) For the past four years, worked up the ladder from a staff counter-help position to a shift manager position. Promotion to this management position carried the responsibility to direct and supervise organized shifts of up to 8 or more co-workers. Became experienced in assigning daily tasks and reminders, handling cash sales at the end of shift/day (ranging between $500-$2,000), up-selling products to customers in order to increase sales, and setting up marketing campaign materials at the beginning of each window period. Shift Manager & Staff Member Dunkin' Donuts June 2006  –  December 2010  (4 years 7 months) For the past four years, worked up the ladder from a staff counter-help position to a shift manager position. Promotion to this management position carried the responsibility to direct and supervise organized shifts of up to 8 or more co-workers. Became experienced in assigning daily tasks and reminders, handling cash sales at the end of shift/day (ranging between $500-$2,000), up-selling products to customers in order to increase sales, and setting up marketing campaign materials at the beginning of each window period. Co-Investigator Sony Corporation August 2009  –  December 2009  (5 months) Studied Sony Electronic Reader* as a device to identify advantages of its potential adoption as part of the college lifestyle; designed and created a marketing plan for Sony Corp. with creative ideas as to how the company might reach its goals for the product; explained the results and reasoning from the study to Sony executives and other Penn State officials. Co-Investigator Sony Corporation August 2009  –  December 2009  (5 months) Studied Sony Electronic Reader* as a device to identify advantages of its potential adoption as part of the college lifestyle; designed and created a marketing plan for Sony Corp. with creative ideas as to how the company might reach its goals for the product; explained the results and reasoning from the study to Sony executives and other Penn State officials. Skills Final Cut Pro iWork Windows Apple Aperture Microsoft Office PowerPoint Microsoft Excel HTML Mac Software Microsoft Word Social Media OS X Management Editing Marketing Analysis Data Analysis Cross Functional... Procurement Strategic Sourcing Technical Project... Research Sales See 9+     See less Skills  Final Cut Pro iWork Windows Apple Aperture Microsoft Office PowerPoint Microsoft Excel HTML Mac Software Microsoft Word Social Media OS X Management Editing Marketing Analysis Data Analysis Cross Functional... Procurement Strategic Sourcing Technical Project... Research Sales See 9+     See less Final Cut Pro iWork Windows Apple Aperture Microsoft Office PowerPoint Microsoft Excel HTML Mac Software Microsoft Word Social Media OS X Management Editing Marketing Analysis Data Analysis Cross Functional... Procurement Strategic Sourcing Technical Project... Research Sales See 9+     See less Final Cut Pro iWork Windows Apple Aperture Microsoft Office PowerPoint Microsoft Excel HTML Mac Software Microsoft Word Social Media OS X Management Editing Marketing Analysis Data Analysis Cross Functional... Procurement Strategic Sourcing Technical Project... Research Sales See 9+     See less Education The Pennsylvania State University, University Park Supply Chain Management ,  International Business ,  Economics ,  Marketing 2009  – 2013 *THON: The nation's largest college-based student charitable campaign that in 2013 raised 12.3 million dollars for the Four Diamonds Fund, a fund to help raise awareness and research for children's pediatric cancer. Activities and Societies:  Jewish Outdoor Group (Founder ,  President) ,  Phi Beta Lambda (Rush Co-Chair ,  Historian) ,  Global Business Brigades (Secretary) ,  Altria Sophomore Leadership Development Program (Selected Participant) ,  Schreyer Honors Student Council (Member) ,  The Penn State Marketing Association (Member) ,  Atlas THON* (Member) ,  Penn State Hillel (Member) Smeal College of Business 2009  – 2013 City University London International Business ,  Economics 2012  – 2012 -Working to fulfill requirements toward my International Business and Economics minors at Penn State University. \n \n-IES Study Abroad Program. \n-Spring 2012 Semester. Activities and Societies:  Cass Business School The Pennsylvania State University, University Park Supply Chain Management ,  International Business ,  Economics ,  Marketing 2009  – 2013 *THON: The nation's largest college-based student charitable campaign that in 2013 raised 12.3 million dollars for the Four Diamonds Fund, a fund to help raise awareness and research for children's pediatric cancer. Activities and Societies:  Jewish Outdoor Group (Founder ,  President) ,  Phi Beta Lambda (Rush Co-Chair ,  Historian) ,  Global Business Brigades (Secretary) ,  Altria Sophomore Leadership Development Program (Selected Participant) ,  Schreyer Honors Student Council (Member) ,  The Penn State Marketing Association (Member) ,  Atlas THON* (Member) ,  Penn State Hillel (Member) The Pennsylvania State University, University Park Supply Chain Management ,  International Business ,  Economics ,  Marketing 2009  – 2013 *THON: The nation's largest college-based student charitable campaign that in 2013 raised 12.3 million dollars for the Four Diamonds Fund, a fund to help raise awareness and research for children's pediatric cancer. Activities and Societies:  Jewish Outdoor Group (Founder ,  President) ,  Phi Beta Lambda (Rush Co-Chair ,  Historian) ,  Global Business Brigades (Secretary) ,  Altria Sophomore Leadership Development Program (Selected Participant) ,  Schreyer Honors Student Council (Member) ,  The Penn State Marketing Association (Member) ,  Atlas THON* (Member) ,  Penn State Hillel (Member) The Pennsylvania State University, University Park Supply Chain Management ,  International Business ,  Economics ,  Marketing 2009  – 2013 *THON: The nation's largest college-based student charitable campaign that in 2013 raised 12.3 million dollars for the Four Diamonds Fund, a fund to help raise awareness and research for children's pediatric cancer. Activities and Societies:  Jewish Outdoor Group (Founder ,  President) ,  Phi Beta Lambda (Rush Co-Chair ,  Historian) ,  Global Business Brigades (Secretary) ,  Altria Sophomore Leadership Development Program (Selected Participant) ,  Schreyer Honors Student Council (Member) ,  The Penn State Marketing Association (Member) ,  Atlas THON* (Member) ,  Penn State Hillel (Member) Smeal College of Business 2009  – 2013 Smeal College of Business 2009  – 2013 Smeal College of Business 2009  – 2013 City University London International Business ,  Economics 2012  – 2012 -Working to fulfill requirements toward my International Business and Economics minors at Penn State University. \n \n-IES Study Abroad Program. \n-Spring 2012 Semester. Activities and Societies:  Cass Business School City University London International Business ,  Economics 2012  – 2012 -Working to fulfill requirements toward my International Business and Economics minors at Penn State University. \n \n-IES Study Abroad Program. \n-Spring 2012 Semester. Activities and Societies:  Cass Business School City University London International Business ,  Economics 2012  – 2012 -Working to fulfill requirements toward my International Business and Economics minors at Penn State University. \n \n-IES Study Abroad Program. \n-Spring 2012 Semester. Activities and Societies:  Cass Business School Honors & Awards Additional Honors & Awards December 2013: Schreyer Honors College Scholars Medal Recipient \nAugust 2012, August 2013: Phi Sigma Delta Sigma Educational Scholarship Recipient \nMarch 2011, March 2012: Gloria Kaufman Klein Smith Scholarship Recipient \nFall 2010- Spring 2011: Altria Sophomore Leadership Development Program Participant \nJanuary 2011: Chosen to be a SHO TIME 2011 Gateway Leadership Mentor for incoming students in Fall 2011. \nFall 2009- Spring 2013: The Pennsylvania State University: Dean’s List Recognition. \nApril 2010: Chosen to become a member of the National Society of Collegiate Scholars \nJanuary 2010: Chosen to be a SHO TIME 2010 Gateway Leadership Mentor for incoming students in Fall 2010. \nYears: (2009-10, 2010-11, 2011-12, 2012-13, Fall 2013): Schreyer Honors College Scholarship, Pennsylvania State University. \nFebruary 2007: Hugh O’Brian Youth Leadership Award (HOBY) for Leadership Excellence Nominee. Additional Honors & Awards December 2013: Schreyer Honors College Scholars Medal Recipient \nAugust 2012, August 2013: Phi Sigma Delta Sigma Educational Scholarship Recipient \nMarch 2011, March 2012: Gloria Kaufman Klein Smith Scholarship Recipient \nFall 2010- Spring 2011: Altria Sophomore Leadership Development Program Participant \nJanuary 2011: Chosen to be a SHO TIME 2011 Gateway Leadership Mentor for incoming students in Fall 2011. \nFall 2009- Spring 2013: The Pennsylvania State University: Dean’s List Recognition. \nApril 2010: Chosen to become a member of the National Society of Collegiate Scholars \nJanuary 2010: Chosen to be a SHO TIME 2010 Gateway Leadership Mentor for incoming students in Fall 2010. \nYears: (2009-10, 2010-11, 2011-12, 2012-13, Fall 2013): Schreyer Honors College Scholarship, Pennsylvania State University. \nFebruary 2007: Hugh O’Brian Youth Leadership Award (HOBY) for Leadership Excellence Nominee. Additional Honors & Awards December 2013: Schreyer Honors College Scholars Medal Recipient \nAugust 2012, August 2013: Phi Sigma Delta Sigma Educational Scholarship Recipient \nMarch 2011, March 2012: Gloria Kaufman Klein Smith Scholarship Recipient \nFall 2010- Spring 2011: Altria Sophomore Leadership Development Program Participant \nJanuary 2011: Chosen to be a SHO TIME 2011 Gateway Leadership Mentor for incoming students in Fall 2011. \nFall 2009- Spring 2013: The Pennsylvania State University: Dean’s List Recognition. \nApril 2010: Chosen to become a member of the National Society of Collegiate Scholars \nJanuary 2010: Chosen to be a SHO TIME 2010 Gateway Leadership Mentor for incoming students in Fall 2010. \nYears: (2009-10, 2010-11, 2011-12, 2012-13, Fall 2013): Schreyer Honors College Scholarship, Pennsylvania State University. \nFebruary 2007: Hugh O’Brian Youth Leadership Award (HOBY) for Leadership Excellence Nominee. Additional Honors & Awards December 2013: Schreyer Honors College Scholars Medal Recipient \nAugust 2012, August 2013: Phi Sigma Delta Sigma Educational Scholarship Recipient \nMarch 2011, March 2012: Gloria Kaufman Klein Smith Scholarship Recipient \nFall 2010- Spring 2011: Altria Sophomore Leadership Development Program Participant \nJanuary 2011: Chosen to be a SHO TIME 2011 Gateway Leadership Mentor for incoming students in Fall 2011. \nFall 2009- Spring 2013: The Pennsylvania State University: Dean’s List Recognition. \nApril 2010: Chosen to become a member of the National Society of Collegiate Scholars \nJanuary 2010: Chosen to be a SHO TIME 2010 Gateway Leadership Mentor for incoming students in Fall 2010. \nYears: (2009-10, 2010-11, 2011-12, 2012-13, Fall 2013): Schreyer Honors College Scholarship, Pennsylvania State University. \nFebruary 2007: Hugh O’Brian Youth Leadership Award (HOBY) for Leadership Excellence Nominee. ", "Experience Factory Indirect Material Buyer Intel Corporation October 2013  – Present (1 year 11 months) Chengdu, Sichuan, China Direct Material Buyer Intel Corporation November 2011  –  October 2013  (2 years) Chengdu, Sichuan, China Security Operation Specialist Intel Corporation May 2010  –  November 2011  (1 year 7 months) Chengdu, Sichuan, China Security System Specialist Intel Corporation May 2005  –  May 2010  (5 years 1 month) Chengdu, Sichuan, China maintenance/troubleshooting of security system, Management of security system supplier and small security projects in Intel Chengdu Site Factory Indirect Material Buyer Intel Corporation October 2013  – Present (1 year 11 months) Chengdu, Sichuan, China Factory Indirect Material Buyer Intel Corporation October 2013  – Present (1 year 11 months) Chengdu, Sichuan, China Direct Material Buyer Intel Corporation November 2011  –  October 2013  (2 years) Chengdu, Sichuan, China Direct Material Buyer Intel Corporation November 2011  –  October 2013  (2 years) Chengdu, Sichuan, China Security Operation Specialist Intel Corporation May 2010  –  November 2011  (1 year 7 months) Chengdu, Sichuan, China Security Operation Specialist Intel Corporation May 2010  –  November 2011  (1 year 7 months) Chengdu, Sichuan, China Security System Specialist Intel Corporation May 2005  –  May 2010  (5 years 1 month) Chengdu, Sichuan, China maintenance/troubleshooting of security system, Management of security system supplier and small security projects in Intel Chengdu Site Security System Specialist Intel Corporation May 2005  –  May 2010  (5 years 1 month) Chengdu, Sichuan, China maintenance/troubleshooting of security system, Management of security system supplier and small security projects in Intel Chengdu Site Skills Purchasing Processes Factory Direct/Indirect... Inventory Management SAP Security Management CCTV Access Control Security System Design Skills  Purchasing Processes Factory Direct/Indirect... Inventory Management SAP Security Management CCTV Access Control Security System Design Purchasing Processes Factory Direct/Indirect... Inventory Management SAP Security Management CCTV Access Control Security System Design Purchasing Processes Factory Direct/Indirect... Inventory Management SAP Security Management CCTV Access Control Security System Design ", "Experience Global Sourcing & Procurement - Chemical Buyer Intel Corporation December 2010  – Present (4 years 9 months) Hillsboro, Oregon Founder & Senior Custodian Pedal Nation Events January 2010  – Present (5 years 8 months) Portland, Oregon Area Organizers of bicycling events big and small in the most bike friendliest state of them all.....Oregon.  \n \nJoin us for \n--Pedal Nation/PDX Bicycle Show, March, at Portland Expo Center \n--Oregon Handmade Bicycle Show, October, Portland, OR \n--Cascade to Crown Bike Ride, July, Cascade Locks, OR \n \nIf you need help planning, organizing, or marketing your bike event, give us a holler. We know how to heard cats. \n \naaron@pedalnationevents.com Buyer Intel Corporation July 2009  –  November 2010  (1 year 5 months) Commodity Manager Intel Corporation November 2008  –  June 2009  (8 months) Commodity Specialist Intel Corporation June 2007  –  October 2008  (1 year 5 months) Manufacturing Equipment Technician Intel Corporation August 1999  –  June 2007  (7 years 11 months) Global Sourcing & Procurement - Chemical Buyer Intel Corporation December 2010  – Present (4 years 9 months) Hillsboro, Oregon Global Sourcing & Procurement - Chemical Buyer Intel Corporation December 2010  – Present (4 years 9 months) Hillsboro, Oregon Founder & Senior Custodian Pedal Nation Events January 2010  – Present (5 years 8 months) Portland, Oregon Area Organizers of bicycling events big and small in the most bike friendliest state of them all.....Oregon.  \n \nJoin us for \n--Pedal Nation/PDX Bicycle Show, March, at Portland Expo Center \n--Oregon Handmade Bicycle Show, October, Portland, OR \n--Cascade to Crown Bike Ride, July, Cascade Locks, OR \n \nIf you need help planning, organizing, or marketing your bike event, give us a holler. We know how to heard cats. \n \naaron@pedalnationevents.com Founder & Senior Custodian Pedal Nation Events January 2010  – Present (5 years 8 months) Portland, Oregon Area Organizers of bicycling events big and small in the most bike friendliest state of them all.....Oregon.  \n \nJoin us for \n--Pedal Nation/PDX Bicycle Show, March, at Portland Expo Center \n--Oregon Handmade Bicycle Show, October, Portland, OR \n--Cascade to Crown Bike Ride, July, Cascade Locks, OR \n \nIf you need help planning, organizing, or marketing your bike event, give us a holler. We know how to heard cats. \n \naaron@pedalnationevents.com Buyer Intel Corporation July 2009  –  November 2010  (1 year 5 months) Buyer Intel Corporation July 2009  –  November 2010  (1 year 5 months) Commodity Manager Intel Corporation November 2008  –  June 2009  (8 months) Commodity Manager Intel Corporation November 2008  –  June 2009  (8 months) Commodity Specialist Intel Corporation June 2007  –  October 2008  (1 year 5 months) Commodity Specialist Intel Corporation June 2007  –  October 2008  (1 year 5 months) Manufacturing Equipment Technician Intel Corporation August 1999  –  June 2007  (7 years 11 months) Manufacturing Equipment Technician Intel Corporation August 1999  –  June 2007  (7 years 11 months) Skills Cross-functional Team... SPC Supply Management Product Development Lean Manufacturing Program Management Strategic Sourcing Semiconductors Supply Chain Management Supplier Development MRP Global Sourcing Process Improvement Product Management Skills  Cross-functional Team... SPC Supply Management Product Development Lean Manufacturing Program Management Strategic Sourcing Semiconductors Supply Chain Management Supplier Development MRP Global Sourcing Process Improvement Product Management Cross-functional Team... SPC Supply Management Product Development Lean Manufacturing Program Management Strategic Sourcing Semiconductors Supply Chain Management Supplier Development MRP Global Sourcing Process Improvement Product Management Cross-functional Team... SPC Supply Management Product Development Lean Manufacturing Program Management Strategic Sourcing Semiconductors Supply Chain Management Supplier Development MRP Global Sourcing Process Improvement Product Management Education Portland State University BS,  Supply Chain and Logistics Mgmt 2004  – 2006 Tarrant County College AAS,  Semiconductor Manufacturing 1997  – 1999 Portland State University BS,  Supply Chain and Logistics Mgmt 2004  – 2006 Portland State University BS,  Supply Chain and Logistics Mgmt 2004  – 2006 Portland State University BS,  Supply Chain and Logistics Mgmt 2004  – 2006 Tarrant County College AAS,  Semiconductor Manufacturing 1997  – 1999 Tarrant County College AAS,  Semiconductor Manufacturing 1997  – 1999 Tarrant County College AAS,  Semiconductor Manufacturing 1997  – 1999 ", "Experience Supply Chain Analyst/Buyer Intel Corporation March 2011  – Present (4 years 6 months) Supply Management Analyst Intel Corporation January 2006  –  February 2011  (5 years 2 months) Supply Chain Specialist Honeywell Aerospace August 2000  –  February 2006  (5 years 7 months) Supply Chain Analyst/Buyer Intel Corporation March 2011  – Present (4 years 6 months) Supply Chain Analyst/Buyer Intel Corporation March 2011  – Present (4 years 6 months) Supply Management Analyst Intel Corporation January 2006  –  February 2011  (5 years 2 months) Supply Management Analyst Intel Corporation January 2006  –  February 2011  (5 years 2 months) Supply Chain Specialist Honeywell Aerospace August 2000  –  February 2006  (5 years 7 months) Supply Chain Specialist Honeywell Aerospace August 2000  –  February 2006  (5 years 7 months) Education University of Phoenix Master of Business Administration (MBA) 2005  – 2009 Arizona State University Bachelor of Arts (BA),  Spanish/Translation 1997  – 2000 University of Phoenix Master of Business Administration (MBA) 2005  – 2009 University of Phoenix Master of Business Administration (MBA) 2005  – 2009 University of Phoenix Master of Business Administration (MBA) 2005  – 2009 Arizona State University Bachelor of Arts (BA),  Spanish/Translation 1997  – 2000 Arizona State University Bachelor of Arts (BA),  Spanish/Translation 1997  – 2000 Arizona State University Bachelor of Arts (BA),  Spanish/Translation 1997  – 2000 ", "Summary Materials Program Manager with broad experience in supply chain management including cost savings, material availability or on-time delivery, customer satisfaction and inventory control, and contract negotiations, Proven track record in performance and accountability management, having been honored to receive several recognitions from management and customers for role modeling, risk taking, and results orientation. Self-motivated, high achieving team player with strong communication skills. Specialties:Purchasing, SAP, MRP Systems, Inventory Management, Inventory Control Methodology, contract negotiation, program management, mergers and acquisitions Summary Materials Program Manager with broad experience in supply chain management including cost savings, material availability or on-time delivery, customer satisfaction and inventory control, and contract negotiations, Proven track record in performance and accountability management, having been honored to receive several recognitions from management and customers for role modeling, risk taking, and results orientation. Self-motivated, high achieving team player with strong communication skills. Specialties:Purchasing, SAP, MRP Systems, Inventory Management, Inventory Control Methodology, contract negotiation, program management, mergers and acquisitions Materials Program Manager with broad experience in supply chain management including cost savings, material availability or on-time delivery, customer satisfaction and inventory control, and contract negotiations, Proven track record in performance and accountability management, having been honored to receive several recognitions from management and customers for role modeling, risk taking, and results orientation. Self-motivated, high achieving team player with strong communication skills. Specialties:Purchasing, SAP, MRP Systems, Inventory Management, Inventory Control Methodology, contract negotiation, program management, mergers and acquisitions Materials Program Manager with broad experience in supply chain management including cost savings, material availability or on-time delivery, customer satisfaction and inventory control, and contract negotiations, Proven track record in performance and accountability management, having been honored to receive several recognitions from management and customers for role modeling, risk taking, and results orientation. Self-motivated, high achieving team player with strong communication skills. Specialties:Purchasing, SAP, MRP Systems, Inventory Management, Inventory Control Methodology, contract negotiation, program management, mergers and acquisitions Experience Materials Program Manager Intel Corporation April 2010  –  October 2014  (4 years 7 months) DuPont, WA Responsible for providing functional leadership for the Materials Project Team and key interfaces to the project or program while ensuring materials support for system level factory builds. Serves as the primary interface for material or supply line issues and ensures a continuous line of supply for build schedules. Works directly with Design Engineers to select components optimized for quality, cost, and availability. Responsible for the metrics of success: cost savings, material availability or on-time delivery, customer satisfaction and inventory control. Buyer Intel Corporation November 2009  –  April 2010  (6 months) Responsible for planning and direction of Intel supplied purchasing functions in support of Intel Boards and Systems Manufacturing. Works closely with planners, BU customers, cross site teams, and suppliers to ensure material supply lines are well communicated and reconciled to commits. Also responsible for ensuring overall inventory goals are met. Other job activities include disposition of excess/obsolete material, ECO management, AP issues management, and materials tracking. Materials Program Manager Intel Corporation March 2008  –  March 2009  (1 year 1 month) Member of the TSA Supply Chain team for both Radisys and Kontron divestitures. \nResponsible for purchasing materials at best price and delivery cycle \nInfluenced cross functional teams to support the supply chain organization. \nActively managed inventory aging and excess/obsolete inventory. \nAPICS experience. Buyer Intel Corporation May 2007  –  March 2008  (11 months) Coordinated corporate purchasing activities with customers supporting validation and fabrication. Resolved accounts payable and receiving issues. Managed inventory control, workflow process and supply management problems. Supplier support, set-up and negotiation. Program Support Specialist Intel Corporation November 2005  –  August 2006  (10 months) Oversaw program coordination for various programs including department purchasing supporting silicon validation and test lab supply, information engineering, non-profit association management, and EPA programs. Coordination and support of various internal and external events and meetings. Independent Consultant University of Arizona August 1998  –  November 1998  (4 months) Manager, Global Trade Shows & Events RightFAX January 1997  –  August 1998  (1 year 8 months) Project Coordinator SOFTBANK Expos August 1995  –  August 1996  (1 year 1 month) Events Coordinator XSoft August 1994  –  August 1995  (1 year 1 month) Materials Program Manager Intel Corporation April 2010  –  October 2014  (4 years 7 months) DuPont, WA Responsible for providing functional leadership for the Materials Project Team and key interfaces to the project or program while ensuring materials support for system level factory builds. Serves as the primary interface for material or supply line issues and ensures a continuous line of supply for build schedules. Works directly with Design Engineers to select components optimized for quality, cost, and availability. Responsible for the metrics of success: cost savings, material availability or on-time delivery, customer satisfaction and inventory control. Materials Program Manager Intel Corporation April 2010  –  October 2014  (4 years 7 months) DuPont, WA Responsible for providing functional leadership for the Materials Project Team and key interfaces to the project or program while ensuring materials support for system level factory builds. Serves as the primary interface for material or supply line issues and ensures a continuous line of supply for build schedules. Works directly with Design Engineers to select components optimized for quality, cost, and availability. Responsible for the metrics of success: cost savings, material availability or on-time delivery, customer satisfaction and inventory control. Buyer Intel Corporation November 2009  –  April 2010  (6 months) Responsible for planning and direction of Intel supplied purchasing functions in support of Intel Boards and Systems Manufacturing. Works closely with planners, BU customers, cross site teams, and suppliers to ensure material supply lines are well communicated and reconciled to commits. Also responsible for ensuring overall inventory goals are met. Other job activities include disposition of excess/obsolete material, ECO management, AP issues management, and materials tracking. Buyer Intel Corporation November 2009  –  April 2010  (6 months) Responsible for planning and direction of Intel supplied purchasing functions in support of Intel Boards and Systems Manufacturing. Works closely with planners, BU customers, cross site teams, and suppliers to ensure material supply lines are well communicated and reconciled to commits. Also responsible for ensuring overall inventory goals are met. Other job activities include disposition of excess/obsolete material, ECO management, AP issues management, and materials tracking. Materials Program Manager Intel Corporation March 2008  –  March 2009  (1 year 1 month) Member of the TSA Supply Chain team for both Radisys and Kontron divestitures. \nResponsible for purchasing materials at best price and delivery cycle \nInfluenced cross functional teams to support the supply chain organization. \nActively managed inventory aging and excess/obsolete inventory. \nAPICS experience. Materials Program Manager Intel Corporation March 2008  –  March 2009  (1 year 1 month) Member of the TSA Supply Chain team for both Radisys and Kontron divestitures. \nResponsible for purchasing materials at best price and delivery cycle \nInfluenced cross functional teams to support the supply chain organization. \nActively managed inventory aging and excess/obsolete inventory. \nAPICS experience. Buyer Intel Corporation May 2007  –  March 2008  (11 months) Coordinated corporate purchasing activities with customers supporting validation and fabrication. Resolved accounts payable and receiving issues. Managed inventory control, workflow process and supply management problems. Supplier support, set-up and negotiation. Buyer Intel Corporation May 2007  –  March 2008  (11 months) Coordinated corporate purchasing activities with customers supporting validation and fabrication. Resolved accounts payable and receiving issues. Managed inventory control, workflow process and supply management problems. Supplier support, set-up and negotiation. Program Support Specialist Intel Corporation November 2005  –  August 2006  (10 months) Oversaw program coordination for various programs including department purchasing supporting silicon validation and test lab supply, information engineering, non-profit association management, and EPA programs. Coordination and support of various internal and external events and meetings. Program Support Specialist Intel Corporation November 2005  –  August 2006  (10 months) Oversaw program coordination for various programs including department purchasing supporting silicon validation and test lab supply, information engineering, non-profit association management, and EPA programs. Coordination and support of various internal and external events and meetings. Independent Consultant University of Arizona August 1998  –  November 1998  (4 months) Independent Consultant University of Arizona August 1998  –  November 1998  (4 months) Manager, Global Trade Shows & Events RightFAX January 1997  –  August 1998  (1 year 8 months) Manager, Global Trade Shows & Events RightFAX January 1997  –  August 1998  (1 year 8 months) Project Coordinator SOFTBANK Expos August 1995  –  August 1996  (1 year 1 month) Project Coordinator SOFTBANK Expos August 1995  –  August 1996  (1 year 1 month) Events Coordinator XSoft August 1994  –  August 1995  (1 year 1 month) Events Coordinator XSoft August 1994  –  August 1995  (1 year 1 month) Skills Purchasing Inventory Management MRP Supply Chain Management Supply Management Supply Chain Manufacturing Cross-functional Team... Contract Negotiation Management Communication Project Management Program Management Lean Manufacturing Project Planning Materials Management Strategic Planning Procurement Semiconductor Industry Process Improvement Intel Logistics Six Sigma Materials Semiconductors Continuous Improvement See 11+     See less Skills  Purchasing Inventory Management MRP Supply Chain Management Supply Management Supply Chain Manufacturing Cross-functional Team... Contract Negotiation Management Communication Project Management Program Management Lean Manufacturing Project Planning Materials Management Strategic Planning Procurement Semiconductor Industry Process Improvement Intel Logistics Six Sigma Materials Semiconductors Continuous Improvement See 11+     See less Purchasing Inventory Management MRP Supply Chain Management Supply Management Supply Chain Manufacturing Cross-functional Team... Contract Negotiation Management Communication Project Management Program Management Lean Manufacturing Project Planning Materials Management Strategic Planning Procurement Semiconductor Industry Process Improvement Intel Logistics Six Sigma Materials Semiconductors Continuous Improvement See 11+     See less Purchasing Inventory Management MRP Supply Chain Management Supply Management Supply Chain Manufacturing Cross-functional Team... Contract Negotiation Management Communication Project Management Program Management Lean Manufacturing Project Planning Materials Management Strategic Planning Procurement Semiconductor Industry Process Improvement Intel Logistics Six Sigma Materials Semiconductors Continuous Improvement See 11+     See less Education De Anza College Logistics & Supply Chain Management 2009  – 2010 Obtaining my certification in Logistics & Supply Chain Management University of Arizona Business Management 1998  – 2001 De Anza College AA,  Behavioral Science 1987  – 1989 Saint Francis High School 1981  – 1985 Resurrection De Anza College Logistics & Supply Chain Management 2009  – 2010 Obtaining my certification in Logistics & Supply Chain Management De Anza College Logistics & Supply Chain Management 2009  – 2010 Obtaining my certification in Logistics & Supply Chain Management De Anza College Logistics & Supply Chain Management 2009  – 2010 Obtaining my certification in Logistics & Supply Chain Management University of Arizona Business Management 1998  – 2001 University of Arizona Business Management 1998  – 2001 University of Arizona Business Management 1998  – 2001 De Anza College AA,  Behavioral Science 1987  – 1989 De Anza College AA,  Behavioral Science 1987  – 1989 De Anza College AA,  Behavioral Science 1987  – 1989 Saint Francis High School 1981  – 1985 Saint Francis High School 1981  – 1985 Saint Francis High School 1981  – 1985 Resurrection Resurrection Resurrection Honors & Awards Additional Honors & Awards Divisional Recognition Award, Intel Corporation - Q3 '08 Additional Honors & Awards Divisional Recognition Award, Intel Corporation - Q3 '08 Additional Honors & Awards Divisional Recognition Award, Intel Corporation - Q3 '08 Additional Honors & Awards Divisional Recognition Award, Intel Corporation - Q3 '08 ", "Experience Buyer Intel Corporation August 2010  – Present (5 years 1 month) Istael PMO Intel Corporation December 2005  –  March 2012  (6 years 4 months) Israel Fab28 Group leader Intel Corporation October 2002  –  December 2005  (3 years 3 months) Israel Managing team at Fab18 production Prodiction support center manager Intel Corporation March 2001  –  November 2002  (1 year 9 months) Israel Software Engineer Intel Corporation October 1996  –  March 2001  (4 years 6 months) Israel Buyer Intel Corporation August 2010  – Present (5 years 1 month) Istael Buyer Intel Corporation August 2010  – Present (5 years 1 month) Istael PMO Intel Corporation December 2005  –  March 2012  (6 years 4 months) Israel Fab28 PMO Intel Corporation December 2005  –  March 2012  (6 years 4 months) Israel Fab28 Group leader Intel Corporation October 2002  –  December 2005  (3 years 3 months) Israel Managing team at Fab18 production Group leader Intel Corporation October 2002  –  December 2005  (3 years 3 months) Israel Managing team at Fab18 production Prodiction support center manager Intel Corporation March 2001  –  November 2002  (1 year 9 months) Israel Prodiction support center manager Intel Corporation March 2001  –  November 2002  (1 year 9 months) Israel Software Engineer Intel Corporation October 1996  –  March 2001  (4 years 6 months) Israel Software Engineer Intel Corporation October 1996  –  March 2001  (4 years 6 months) Israel Skills Management Project Management Purchasing Software Engineering Semiconductors SoC PMO Intel Skills  Management Project Management Purchasing Software Engineering Semiconductors SoC PMO Intel Management Project Management Purchasing Software Engineering Semiconductors SoC PMO Intel Management Project Management Purchasing Software Engineering Semiconductors SoC PMO Intel Education Ben-Gurion University of the Negev Bachelor of Engineering (B.Eng.),  Indus 1992  – 1996 Ben-Gurion University of the Negev Bachelor of Engineering (B.Eng.),  Indus 1992  – 1996 Ben-Gurion University of the Negev Bachelor of Engineering (B.Eng.),  Indus 1992  – 1996 Ben-Gurion University of the Negev Bachelor of Engineering (B.Eng.),  Indus 1992  – 1996 ", "Summary In July 2012 gained graduate position as a Buyer of indirect materials for Intel. \n \nGraduate from Dublin Institute of Technology with a 2:1 in Logistics and Supply Chain Management. \n \n. Summary In July 2012 gained graduate position as a Buyer of indirect materials for Intel. \n \nGraduate from Dublin Institute of Technology with a 2:1 in Logistics and Supply Chain Management. \n \n. In July 2012 gained graduate position as a Buyer of indirect materials for Intel. \n \nGraduate from Dublin Institute of Technology with a 2:1 in Logistics and Supply Chain Management. \n \n. In July 2012 gained graduate position as a Buyer of indirect materials for Intel. \n \nGraduate from Dublin Institute of Technology with a 2:1 in Logistics and Supply Chain Management. \n \n. Experience Supply Chain Intern Abbott Diagnostics February 2011  –  August 2011  (7 months) Purchasing Department \n \nWorked as part of the purchasing team, assisting colleagues with a variety of purchasing activities. \n \nCommunicated with suppliers to ensure on time delivery of open purchase orders to meet manufacturing requirements. \n \nManaged and analysed MRP information to highlight raw materials which needed to be expedited. \n \nRepresented the purchasing department as part of a cross functional team on a cost improvement project. Retail Betting Assistant Hacketts Bookmakers July 2007  –  January 2011  (3 years 7 months) Accepted and settled customer bets, ensuring fast and accurate calculation and settlement of winnings. \n \nBuilt customer relationships in order to create a desirable shop atmosphere and obtain customer loyalty. \n \nCommunicated with head office to ensure effective levels of service. Supply Chain Intern Abbott Diagnostics February 2011  –  August 2011  (7 months) Purchasing Department \n \nWorked as part of the purchasing team, assisting colleagues with a variety of purchasing activities. \n \nCommunicated with suppliers to ensure on time delivery of open purchase orders to meet manufacturing requirements. \n \nManaged and analysed MRP information to highlight raw materials which needed to be expedited. \n \nRepresented the purchasing department as part of a cross functional team on a cost improvement project. Supply Chain Intern Abbott Diagnostics February 2011  –  August 2011  (7 months) Purchasing Department \n \nWorked as part of the purchasing team, assisting colleagues with a variety of purchasing activities. \n \nCommunicated with suppliers to ensure on time delivery of open purchase orders to meet manufacturing requirements. \n \nManaged and analysed MRP information to highlight raw materials which needed to be expedited. \n \nRepresented the purchasing department as part of a cross functional team on a cost improvement project. Retail Betting Assistant Hacketts Bookmakers July 2007  –  January 2011  (3 years 7 months) Accepted and settled customer bets, ensuring fast and accurate calculation and settlement of winnings. \n \nBuilt customer relationships in order to create a desirable shop atmosphere and obtain customer loyalty. \n \nCommunicated with head office to ensure effective levels of service. Retail Betting Assistant Hacketts Bookmakers July 2007  –  January 2011  (3 years 7 months) Accepted and settled customer bets, ensuring fast and accurate calculation and settlement of winnings. \n \nBuilt customer relationships in order to create a desirable shop atmosphere and obtain customer loyalty. \n \nCommunicated with head office to ensure effective levels of service. Skills Supply Chain Management Supply Chain Procurement Financial Analysis Teamwork Skills  Supply Chain Management Supply Chain Procurement Financial Analysis Teamwork Supply Chain Management Supply Chain Procurement Financial Analysis Teamwork Supply Chain Management Supply Chain Procurement Financial Analysis Teamwork Education Dublin Institute of Technology Logistics & Supply Chain Management , 2:1 2008  – 2012 Completed thesis as part of final year titled- ‘The Evolution of the Procurement Function within Supply Chain Management- A Manufacturing Case Study’ Dublin Institute of Technology Logistics & Supply Chain Management , 2:1 2008  – 2012 Completed thesis as part of final year titled- ‘The Evolution of the Procurement Function within Supply Chain Management- A Manufacturing Case Study’ Dublin Institute of Technology Logistics & Supply Chain Management , 2:1 2008  – 2012 Completed thesis as part of final year titled- ‘The Evolution of the Procurement Function within Supply Chain Management- A Manufacturing Case Study’ Dublin Institute of Technology Logistics & Supply Chain Management , 2:1 2008  – 2012 Completed thesis as part of final year titled- ‘The Evolution of the Procurement Function within Supply Chain Management- A Manufacturing Case Study’ ", "Experience GFM Buyer Intel Corporation December 2011  – Present (3 years 9 months) Dalian Litho Process Engineer Intel Corporation July 2009  –  December 2011  (2 years 6 months) Dalian Litho Seed Process Engineer Senior Application Engineer AZ Electronic Materials 2005  –  2009  (4 years) Litho Process Engineer SMIC August 2003  –  December 2005  (2 years 5 months) Shanghai / Beijing Seed process engineer for China's 1st 12inch FAB. GFM Buyer Intel Corporation December 2011  – Present (3 years 9 months) Dalian GFM Buyer Intel Corporation December 2011  – Present (3 years 9 months) Dalian Litho Process Engineer Intel Corporation July 2009  –  December 2011  (2 years 6 months) Dalian Litho Seed Process Engineer Litho Process Engineer Intel Corporation July 2009  –  December 2011  (2 years 6 months) Dalian Litho Seed Process Engineer Senior Application Engineer AZ Electronic Materials 2005  –  2009  (4 years) Senior Application Engineer AZ Electronic Materials 2005  –  2009  (4 years) Litho Process Engineer SMIC August 2003  –  December 2005  (2 years 5 months) Shanghai / Beijing Seed process engineer for China's 1st 12inch FAB. Litho Process Engineer SMIC August 2003  –  December 2005  (2 years 5 months) Shanghai / Beijing Seed process engineer for China's 1st 12inch FAB. Skills Semiconductor Industry Manufacturing Lithography Semiconductors Skills  Semiconductor Industry Manufacturing Lithography Semiconductors Semiconductor Industry Manufacturing Lithography Semiconductors Semiconductor Industry Manufacturing Lithography Semiconductors Education Beijing Jiaotong University Bachelor,  Physics 1999  – 2003 Activities and Societies:  Table Tennis Beijing Jiaotong University Bachelor,  Physics 1999  – 2003 Activities and Societies:  Table Tennis Beijing Jiaotong University Bachelor,  Physics 1999  – 2003 Activities and Societies:  Table Tennis Beijing Jiaotong University Bachelor,  Physics 1999  – 2003 Activities and Societies:  Table Tennis ", "Experience Senior Fab buyer Intel Corporation April 1984  – Present (31 years 5 months) Senior Fab buyer Intel Corporation April 1984  – Present (31 years 5 months) Senior Fab buyer Intel Corporation April 1984  – Present (31 years 5 months) Skills Cross-functional Team... Intel Semiconductors Semiconductor Industry Supply Management Supply Chain Management SPC Electronics Manufacturing Product Management Skills  Cross-functional Team... Intel Semiconductors Semiconductor Industry Supply Management Supply Chain Management SPC Electronics Manufacturing Product Management Cross-functional Team... Intel Semiconductors Semiconductor Industry Supply Management Supply Chain Management SPC Electronics Manufacturing Product Management Cross-functional Team... Intel Semiconductors Semiconductor Industry Supply Management Supply Chain Management SPC Electronics Manufacturing Product Management Education San Jose State University BS,  IE 1979  – 1983 San Jose State University BS,  IE 1979  – 1983 San Jose State University BS,  IE 1979  – 1983 San Jose State University BS,  IE 1979  – 1983 ", "Summary I’m looking for an opportunity that aligns with my passions and my work experience related to efficiency and productivity. In Intel’s manufacturing and purchasing teams I found ways to streamline processes and reduce confusion and conflict. In my marketing experience for a non-profit I expanded the use of charts and graphs to better understand and grow the base of support. I’m not just seeking a management position. I’m good with people, I’m a team player and my hope is to experience a new environment where I can use my best skills to make the maximum contribution. Summary I’m looking for an opportunity that aligns with my passions and my work experience related to efficiency and productivity. In Intel’s manufacturing and purchasing teams I found ways to streamline processes and reduce confusion and conflict. In my marketing experience for a non-profit I expanded the use of charts and graphs to better understand and grow the base of support. I’m not just seeking a management position. I’m good with people, I’m a team player and my hope is to experience a new environment where I can use my best skills to make the maximum contribution. I’m looking for an opportunity that aligns with my passions and my work experience related to efficiency and productivity. In Intel’s manufacturing and purchasing teams I found ways to streamline processes and reduce confusion and conflict. In my marketing experience for a non-profit I expanded the use of charts and graphs to better understand and grow the base of support. I’m not just seeking a management position. I’m good with people, I’m a team player and my hope is to experience a new environment where I can use my best skills to make the maximum contribution. I’m looking for an opportunity that aligns with my passions and my work experience related to efficiency and productivity. In Intel’s manufacturing and purchasing teams I found ways to streamline processes and reduce confusion and conflict. In my marketing experience for a non-profit I expanded the use of charts and graphs to better understand and grow the base of support. I’m not just seeking a management position. I’m good with people, I’m a team player and my hope is to experience a new environment where I can use my best skills to make the maximum contribution. Experience Fundraising Administrator Luis Palau Association May 1999  –  October 2008  (9 years 6 months) Wrote fundraising letters and developed phone calling scripts to warmly encourage supporters, providing updates regarding current projects and encouraging their participation in giving financially.  \n \nExpanded the use of spreadsheets, charts and graphs to report fundraising activities and more clearly determine the effectiveness of specific fundraising initiatives. Buyer Intel Corporation November 1997  –  April 1999  (1 year 6 months) Purchased products and oversaw international vendor supply lines with a view to meeting delivery commitments to the factory. Devised a proactive vendor management methodology adapted by the entire division. Self Employed Consultant Consultant January 1993  –  October 1997  (4 years 10 months) Helped design and build a business facility in order maximize productivity.  \nTrimmed considerable hours of manual calculations by utilizing computer generated data for production floor capacity planning and control.  \n \nReorganized warehouse physical space, defined process measurements and corrective actions which virtually eliminated warehouse packaging errors and significantly increased efficiency. Production Supervisor - Buyer Intel Corporation June 1979  –  December 1992  (13 years 7 months) Devised a work-in-process planner that increased forecasting accuracy, improved line balance, and led to better coordination and execution of production floor priorities.  \n \nRemoved over $200,000 capital investment in manufacturing spare parts inventories by setting up an in-house, supplier managed, consignment program. Fundraising Administrator Luis Palau Association May 1999  –  October 2008  (9 years 6 months) Wrote fundraising letters and developed phone calling scripts to warmly encourage supporters, providing updates regarding current projects and encouraging their participation in giving financially.  \n \nExpanded the use of spreadsheets, charts and graphs to report fundraising activities and more clearly determine the effectiveness of specific fundraising initiatives. Fundraising Administrator Luis Palau Association May 1999  –  October 2008  (9 years 6 months) Wrote fundraising letters and developed phone calling scripts to warmly encourage supporters, providing updates regarding current projects and encouraging their participation in giving financially.  \n \nExpanded the use of spreadsheets, charts and graphs to report fundraising activities and more clearly determine the effectiveness of specific fundraising initiatives. Buyer Intel Corporation November 1997  –  April 1999  (1 year 6 months) Purchased products and oversaw international vendor supply lines with a view to meeting delivery commitments to the factory. Devised a proactive vendor management methodology adapted by the entire division. Buyer Intel Corporation November 1997  –  April 1999  (1 year 6 months) Purchased products and oversaw international vendor supply lines with a view to meeting delivery commitments to the factory. Devised a proactive vendor management methodology adapted by the entire division. Self Employed Consultant Consultant January 1993  –  October 1997  (4 years 10 months) Helped design and build a business facility in order maximize productivity.  \nTrimmed considerable hours of manual calculations by utilizing computer generated data for production floor capacity planning and control.  \n \nReorganized warehouse physical space, defined process measurements and corrective actions which virtually eliminated warehouse packaging errors and significantly increased efficiency. Self Employed Consultant Consultant January 1993  –  October 1997  (4 years 10 months) Helped design and build a business facility in order maximize productivity.  \nTrimmed considerable hours of manual calculations by utilizing computer generated data for production floor capacity planning and control.  \n \nReorganized warehouse physical space, defined process measurements and corrective actions which virtually eliminated warehouse packaging errors and significantly increased efficiency. Production Supervisor - Buyer Intel Corporation June 1979  –  December 1992  (13 years 7 months) Devised a work-in-process planner that increased forecasting accuracy, improved line balance, and led to better coordination and execution of production floor priorities.  \n \nRemoved over $200,000 capital investment in manufacturing spare parts inventories by setting up an in-house, supplier managed, consignment program. Production Supervisor - Buyer Intel Corporation June 1979  –  December 1992  (13 years 7 months) Devised a work-in-process planner that increased forecasting accuracy, improved line balance, and led to better coordination and execution of production floor priorities.  \n \nRemoved over $200,000 capital investment in manufacturing spare parts inventories by setting up an in-house, supplier managed, consignment program. Education Western Seminary MA,  Christian Ministry 1999  – 2001 GPA 4.0 Biola University BA,  Education 1970  – 1974 Western Seminary MA,  Christian Ministry 1999  – 2001 GPA 4.0 Western Seminary MA,  Christian Ministry 1999  – 2001 GPA 4.0 Western Seminary MA,  Christian Ministry 1999  – 2001 GPA 4.0 Biola University BA,  Education 1970  – 1974 Biola University BA,  Education 1970  – 1974 Biola University BA,  Education 1970  – 1974 ", "Experience Global Sourcing and Procurement - Buyer Intel Corporation December 2010  – Present (4 years 9 months) Global Sourcing and Procurement - Buyer Intel Corporation December 2010  – Present (4 years 9 months) Global Sourcing and Procurement - Buyer Intel Corporation December 2010  – Present (4 years 9 months) Skills Supply Chain Logistics Skills  Supply Chain Logistics Supply Chain Logistics Supply Chain Logistics Education Arizona State University - W. P. Carey School of Business Certificate of International Business,  International Business 2009  – 2009 Arizona State University - W. P. Carey School of Business B.S.,  Supply Chain Management 2008  – 2009 Mesa Community College Associate Degree,  Accounting 2006  – 2008 Arizona State University - W. P. Carey School of Business Certificate of International Business,  International Business 2009  – 2009 Arizona State University - W. P. Carey School of Business Certificate of International Business,  International Business 2009  – 2009 Arizona State University - W. P. Carey School of Business Certificate of International Business,  International Business 2009  – 2009 Arizona State University - W. P. Carey School of Business B.S.,  Supply Chain Management 2008  – 2009 Arizona State University - W. P. Carey School of Business B.S.,  Supply Chain Management 2008  – 2009 Arizona State University - W. P. Carey School of Business B.S.,  Supply Chain Management 2008  – 2009 Mesa Community College Associate Degree,  Accounting 2006  – 2008 Mesa Community College Associate Degree,  Accounting 2006  – 2008 Mesa Community College Associate Degree,  Accounting 2006  – 2008 ", "Experience Material Master Program Manager/ Capital Commodity Specialist (Capital Buyer) Intel Corporation January 2013  – Present (2 years 8 months) Hillsboro, Oregon Material Master Program Manager Intel Corporation June 1999  – Present (16 years 3 months) RA Oregon Production and Traffic Manager JVNW Inc. May 1994  –  January 1999  (4 years 9 months) Material Master Program Manager/ Capital Commodity Specialist (Capital Buyer) Intel Corporation January 2013  – Present (2 years 8 months) Hillsboro, Oregon Material Master Program Manager/ Capital Commodity Specialist (Capital Buyer) Intel Corporation January 2013  – Present (2 years 8 months) Hillsboro, Oregon Material Master Program Manager Intel Corporation June 1999  – Present (16 years 3 months) RA Oregon Material Master Program Manager Intel Corporation June 1999  – Present (16 years 3 months) RA Oregon Production and Traffic Manager JVNW Inc. May 1994  –  January 1999  (4 years 9 months) Production and Traffic Manager JVNW Inc. May 1994  –  January 1999  (4 years 9 months) Skills Product Marketing Production Planning Management Troubleshooting Product Development Project Planning Product Management Project Management Semiconductors Supply Chain Management Cross-functional Team... Matlab C R&D Engineering Electronics Manufacturing Embedded Systems Testing See 4+     See less Skills  Product Marketing Production Planning Management Troubleshooting Product Development Project Planning Product Management Project Management Semiconductors Supply Chain Management Cross-functional Team... Matlab C R&D Engineering Electronics Manufacturing Embedded Systems Testing See 4+     See less Product Marketing Production Planning Management Troubleshooting Product Development Project Planning Product Management Project Management Semiconductors Supply Chain Management Cross-functional Team... Matlab C R&D Engineering Electronics Manufacturing Embedded Systems Testing See 4+     See less Product Marketing Production Planning Management Troubleshooting Product Development Project Planning Product Management Project Management Semiconductors Supply Chain Management Cross-functional Team... Matlab C R&D Engineering Electronics Manufacturing Embedded Systems Testing See 4+     See less Education Linfield College-Adult Degree Program Bachelor of Arts (B.S.),  Business/Computer Science , 3.81 2002  – 2005 Linfield College-Adult Degree Program Bachelor of Arts (B.S.),  Business/Computer Science , 3.81 2002  – 2005 Linfield College-Adult Degree Program Bachelor of Arts (B.S.),  Business/Computer Science , 3.81 2002  – 2005 Linfield College-Adult Degree Program Bachelor of Arts (B.S.),  Business/Computer Science , 3.81 2002  – 2005 ", "Summary Bilingual professional with solid experience of 16 years in the supply chain field with a world leading multinational company, managing local and global inventory strategies, executing saving projects worth millions of dollars, developing and implementing processes and systems, project management, supplier negotiations and supplier management.  \n \nExperience in working with multicultural teams across the world and driving them to reach desired outcome, at ease with working on highly ambiguous environment with aggressive timelines. Experience in managing teams of 6-10 people and executing performance management. \n \nStrong leadership, attention to details, results and customer service oriented, used to successfully achieve company´s goals while meeting critical deadlines, and with excellent interpersonal and communication skills. Summary Bilingual professional with solid experience of 16 years in the supply chain field with a world leading multinational company, managing local and global inventory strategies, executing saving projects worth millions of dollars, developing and implementing processes and systems, project management, supplier negotiations and supplier management.  \n \nExperience in working with multicultural teams across the world and driving them to reach desired outcome, at ease with working on highly ambiguous environment with aggressive timelines. Experience in managing teams of 6-10 people and executing performance management. \n \nStrong leadership, attention to details, results and customer service oriented, used to successfully achieve company´s goals while meeting critical deadlines, and with excellent interpersonal and communication skills. Bilingual professional with solid experience of 16 years in the supply chain field with a world leading multinational company, managing local and global inventory strategies, executing saving projects worth millions of dollars, developing and implementing processes and systems, project management, supplier negotiations and supplier management.  \n \nExperience in working with multicultural teams across the world and driving them to reach desired outcome, at ease with working on highly ambiguous environment with aggressive timelines. Experience in managing teams of 6-10 people and executing performance management. \n \nStrong leadership, attention to details, results and customer service oriented, used to successfully achieve company´s goals while meeting critical deadlines, and with excellent interpersonal and communication skills. Bilingual professional with solid experience of 16 years in the supply chain field with a world leading multinational company, managing local and global inventory strategies, executing saving projects worth millions of dollars, developing and implementing processes and systems, project management, supplier negotiations and supplier management.  \n \nExperience in working with multicultural teams across the world and driving them to reach desired outcome, at ease with working on highly ambiguous environment with aggressive timelines. Experience in managing teams of 6-10 people and executing performance management. \n \nStrong leadership, attention to details, results and customer service oriented, used to successfully achieve company´s goals while meeting critical deadlines, and with excellent interpersonal and communication skills. Experience Strategic Sourcing Manager Citi August 2014  – Present (1 year 1 month) • Lead the development, management and analysis of Requests for Proposal, eAuctions, supplier negotiations, financial analysis, contract administration and project management. \n• Work with suppliers to measure and track performance and any reporting requirements. \n• Communicate and work with the stakeholders with the purpose of reducing the total cost of ownership of the dedicated commodity to Citi. \n• Manage the analysis, negotiation, drafting and implementation of contracts, and management of contracts and suppliers for contract compliance, deliverables and opportunities. \n• Lead and be part of complex sourcing projects for the commodity, which would include developing and directing RFPs and/or eAuctions; analyze supplier proposals to determine savings, commitments and opportunities. \n• Effectively plan and negotiate enterprise wide services agreements that minimize risk and exposure and provide optimal terms and conditions. \n• Develop and maintain close business relationships with key internal and external stakeholders to identify needs, and ensuring business goals are met. \n• Monitor the supplier market and identify opportunities resulting from new product offerings and/or market shifts. \n• Assist Global Category lead with developing the global supplier strategy and work with regions to implement strategies. \n• Support corporate wide divestiture and acquisition activities Commodity Manager Intel Corporation August 2012  –  August 2014  (2 years 1 month) \tResponsible for managing end to end Tactical Supply Line Operations. Focus primary on Passives & Metal Media commodities across all Intel factories worldwide. \n•\tAccountable for availability to support build plan, which includes understanding latest demand and communicating on weekly build plan with suppliers, conducting scenario planning & coordinating availability response during crisis/excursion management, ensuring supplier MOR/capacity is accurate, setting & monitoring DOI to ensure ATM supports meets ATGM 99% SLA. In this last capacity savings of $8.5M were achieved thru the creation of a statistical DOI tool. Direct Materials Group Leader Intel Corporation December 2007  –  July 2012  (4 years 8 months) \tResponsible for managing local DM Buyer team of 6 people, ensuring process compliance and optimization \n•\tResponsible for providing GSP response to weekly Gameplan process, negotiating Factory strategies and aligning with Commodity Management/Suppliers team, as well as ATM CPLG & Division \n•\tCoordinated quarterly suppliers visits to the site to align on strategies \n•\tResponsible for meeting 100% of demand request across all commodities, managing personally substrates & PSMT Direct Material Buyer Intel Corporation December 2006  –  November 2007  (1 year) •\tCoordinator of new technology introduction, integrating the resources to implement projects, single point of contact for the Factories for Materials related issues, maintaining PAS at 100% and achieving 100% on time completion  \n•\tResponsible for defining proper inventory levels for an inventory worth $2.1M of spare parts (2000+ part numbers), responsible for the purchasing policy & procedure, placing POs, following up orders, verifying delivery, approving payment, and maintaining necessary purchasing records \n•\tSupervised activities related to inventory management, contracts, vendor ability to meet specifications and the purchase of spares, equipment, tools, services and operational supplies. Responsible for developing, coaching and performance evaluation for a team of 4 buyers and 2 transaction specialists. Engaging with Factory stakeholders and synergy with global purchasing partners Materials Buyer Intel Corporation November 2005  –  November 2006  (1 year 1 month) Rios Rancho, New Mexico \tResponsible for implementing a closed loop warranty process that saved $850K \n•\tResponsible for setting up Factory spares replenishment and defining material flow with Fab warehouse. \n•\tEnsuring successful closure of 3000+ line items to allow readiness of Fab 7 IDM Buyer Intel Corporation March 1998  –  October 2005  (7 years 8 months) San Jose, Costa Rica Ramp Readiness EST Global Leader \n Responsible for managing a global team of 6 people, assuring savings of $381K, inventory availability and supplier readiness \n \nSenior Spares Buyer \n•\tResponsible for defining proper inventory levels for an inventory worth $2.1M of spare parts (2000+ part numbers), responsible for the purchasing policy & procedure, placing POs, following up orders, verifying delivery, approving payment, and maintaining necessary purchasing records \n•\tNetworking across several organizations successfully deployed WIINGS to ATM, which enabled implementation of the Spares Harvest Project with actual savings of $5.3M \n \nNew Product Introduction Integrator \n•\tCoordinator of new technology introduction, integrating the resources to implement projects, single point of contact for the Factories for Materials related issues, maintaining PAS at 100%  \n \nCR Indirect Materials Group Leader  \n•\tSupervised activities related to inventory management, contracts, vendor ability to meet specifications and the purchase of spares, equipment, tools, services and operational supplies. Responsible for developing, coaching and performance evaluation for a team of 4 buyers and 2 transaction specialists.  \n \nCR Inventory Management Team leader & CR representative in the Virtual Factory\t \n•\tLeader of the local Inventory Team responsible for achieving the inventory indicators and optimizing inventory.  \nSenior Transport Media Buyer \n•\tManage Transport Media inventory by defining & maintaining healthy stoking levels (min/max), identifying and engaging in cost savings and inventory reduction activities, negotiating local contracts and executing procurement activities \n•\tAs a project manager lead the VF Buffer Reduction Team, which drove the reduction in the requirements for Handling Media across the VF, which resulted in $2.03M reduction of materials Strategic Sourcing Manager Citi August 2014  – Present (1 year 1 month) • Lead the development, management and analysis of Requests for Proposal, eAuctions, supplier negotiations, financial analysis, contract administration and project management. \n• Work with suppliers to measure and track performance and any reporting requirements. \n• Communicate and work with the stakeholders with the purpose of reducing the total cost of ownership of the dedicated commodity to Citi. \n• Manage the analysis, negotiation, drafting and implementation of contracts, and management of contracts and suppliers for contract compliance, deliverables and opportunities. \n• Lead and be part of complex sourcing projects for the commodity, which would include developing and directing RFPs and/or eAuctions; analyze supplier proposals to determine savings, commitments and opportunities. \n• Effectively plan and negotiate enterprise wide services agreements that minimize risk and exposure and provide optimal terms and conditions. \n• Develop and maintain close business relationships with key internal and external stakeholders to identify needs, and ensuring business goals are met. \n• Monitor the supplier market and identify opportunities resulting from new product offerings and/or market shifts. \n• Assist Global Category lead with developing the global supplier strategy and work with regions to implement strategies. \n• Support corporate wide divestiture and acquisition activities Strategic Sourcing Manager Citi August 2014  – Present (1 year 1 month) • Lead the development, management and analysis of Requests for Proposal, eAuctions, supplier negotiations, financial analysis, contract administration and project management. \n• Work with suppliers to measure and track performance and any reporting requirements. \n• Communicate and work with the stakeholders with the purpose of reducing the total cost of ownership of the dedicated commodity to Citi. \n• Manage the analysis, negotiation, drafting and implementation of contracts, and management of contracts and suppliers for contract compliance, deliverables and opportunities. \n• Lead and be part of complex sourcing projects for the commodity, which would include developing and directing RFPs and/or eAuctions; analyze supplier proposals to determine savings, commitments and opportunities. \n• Effectively plan and negotiate enterprise wide services agreements that minimize risk and exposure and provide optimal terms and conditions. \n• Develop and maintain close business relationships with key internal and external stakeholders to identify needs, and ensuring business goals are met. \n• Monitor the supplier market and identify opportunities resulting from new product offerings and/or market shifts. \n• Assist Global Category lead with developing the global supplier strategy and work with regions to implement strategies. \n• Support corporate wide divestiture and acquisition activities Commodity Manager Intel Corporation August 2012  –  August 2014  (2 years 1 month) \tResponsible for managing end to end Tactical Supply Line Operations. Focus primary on Passives & Metal Media commodities across all Intel factories worldwide. \n•\tAccountable for availability to support build plan, which includes understanding latest demand and communicating on weekly build plan with suppliers, conducting scenario planning & coordinating availability response during crisis/excursion management, ensuring supplier MOR/capacity is accurate, setting & monitoring DOI to ensure ATM supports meets ATGM 99% SLA. In this last capacity savings of $8.5M were achieved thru the creation of a statistical DOI tool. Commodity Manager Intel Corporation August 2012  –  August 2014  (2 years 1 month) \tResponsible for managing end to end Tactical Supply Line Operations. Focus primary on Passives & Metal Media commodities across all Intel factories worldwide. \n•\tAccountable for availability to support build plan, which includes understanding latest demand and communicating on weekly build plan with suppliers, conducting scenario planning & coordinating availability response during crisis/excursion management, ensuring supplier MOR/capacity is accurate, setting & monitoring DOI to ensure ATM supports meets ATGM 99% SLA. In this last capacity savings of $8.5M were achieved thru the creation of a statistical DOI tool. Direct Materials Group Leader Intel Corporation December 2007  –  July 2012  (4 years 8 months) \tResponsible for managing local DM Buyer team of 6 people, ensuring process compliance and optimization \n•\tResponsible for providing GSP response to weekly Gameplan process, negotiating Factory strategies and aligning with Commodity Management/Suppliers team, as well as ATM CPLG & Division \n•\tCoordinated quarterly suppliers visits to the site to align on strategies \n•\tResponsible for meeting 100% of demand request across all commodities, managing personally substrates & PSMT Direct Materials Group Leader Intel Corporation December 2007  –  July 2012  (4 years 8 months) \tResponsible for managing local DM Buyer team of 6 people, ensuring process compliance and optimization \n•\tResponsible for providing GSP response to weekly Gameplan process, negotiating Factory strategies and aligning with Commodity Management/Suppliers team, as well as ATM CPLG & Division \n•\tCoordinated quarterly suppliers visits to the site to align on strategies \n•\tResponsible for meeting 100% of demand request across all commodities, managing personally substrates & PSMT Direct Material Buyer Intel Corporation December 2006  –  November 2007  (1 year) •\tCoordinator of new technology introduction, integrating the resources to implement projects, single point of contact for the Factories for Materials related issues, maintaining PAS at 100% and achieving 100% on time completion  \n•\tResponsible for defining proper inventory levels for an inventory worth $2.1M of spare parts (2000+ part numbers), responsible for the purchasing policy & procedure, placing POs, following up orders, verifying delivery, approving payment, and maintaining necessary purchasing records \n•\tSupervised activities related to inventory management, contracts, vendor ability to meet specifications and the purchase of spares, equipment, tools, services and operational supplies. Responsible for developing, coaching and performance evaluation for a team of 4 buyers and 2 transaction specialists. Engaging with Factory stakeholders and synergy with global purchasing partners Direct Material Buyer Intel Corporation December 2006  –  November 2007  (1 year) •\tCoordinator of new technology introduction, integrating the resources to implement projects, single point of contact for the Factories for Materials related issues, maintaining PAS at 100% and achieving 100% on time completion  \n•\tResponsible for defining proper inventory levels for an inventory worth $2.1M of spare parts (2000+ part numbers), responsible for the purchasing policy & procedure, placing POs, following up orders, verifying delivery, approving payment, and maintaining necessary purchasing records \n•\tSupervised activities related to inventory management, contracts, vendor ability to meet specifications and the purchase of spares, equipment, tools, services and operational supplies. Responsible for developing, coaching and performance evaluation for a team of 4 buyers and 2 transaction specialists. Engaging with Factory stakeholders and synergy with global purchasing partners Materials Buyer Intel Corporation November 2005  –  November 2006  (1 year 1 month) Rios Rancho, New Mexico \tResponsible for implementing a closed loop warranty process that saved $850K \n•\tResponsible for setting up Factory spares replenishment and defining material flow with Fab warehouse. \n•\tEnsuring successful closure of 3000+ line items to allow readiness of Fab 7 Materials Buyer Intel Corporation November 2005  –  November 2006  (1 year 1 month) Rios Rancho, New Mexico \tResponsible for implementing a closed loop warranty process that saved $850K \n•\tResponsible for setting up Factory spares replenishment and defining material flow with Fab warehouse. \n•\tEnsuring successful closure of 3000+ line items to allow readiness of Fab 7 IDM Buyer Intel Corporation March 1998  –  October 2005  (7 years 8 months) San Jose, Costa Rica Ramp Readiness EST Global Leader \n Responsible for managing a global team of 6 people, assuring savings of $381K, inventory availability and supplier readiness \n \nSenior Spares Buyer \n•\tResponsible for defining proper inventory levels for an inventory worth $2.1M of spare parts (2000+ part numbers), responsible for the purchasing policy & procedure, placing POs, following up orders, verifying delivery, approving payment, and maintaining necessary purchasing records \n•\tNetworking across several organizations successfully deployed WIINGS to ATM, which enabled implementation of the Spares Harvest Project with actual savings of $5.3M \n \nNew Product Introduction Integrator \n•\tCoordinator of new technology introduction, integrating the resources to implement projects, single point of contact for the Factories for Materials related issues, maintaining PAS at 100%  \n \nCR Indirect Materials Group Leader  \n•\tSupervised activities related to inventory management, contracts, vendor ability to meet specifications and the purchase of spares, equipment, tools, services and operational supplies. Responsible for developing, coaching and performance evaluation for a team of 4 buyers and 2 transaction specialists.  \n \nCR Inventory Management Team leader & CR representative in the Virtual Factory\t \n•\tLeader of the local Inventory Team responsible for achieving the inventory indicators and optimizing inventory.  \nSenior Transport Media Buyer \n•\tManage Transport Media inventory by defining & maintaining healthy stoking levels (min/max), identifying and engaging in cost savings and inventory reduction activities, negotiating local contracts and executing procurement activities \n•\tAs a project manager lead the VF Buffer Reduction Team, which drove the reduction in the requirements for Handling Media across the VF, which resulted in $2.03M reduction of materials IDM Buyer Intel Corporation March 1998  –  October 2005  (7 years 8 months) San Jose, Costa Rica Ramp Readiness EST Global Leader \n Responsible for managing a global team of 6 people, assuring savings of $381K, inventory availability and supplier readiness \n \nSenior Spares Buyer \n•\tResponsible for defining proper inventory levels for an inventory worth $2.1M of spare parts (2000+ part numbers), responsible for the purchasing policy & procedure, placing POs, following up orders, verifying delivery, approving payment, and maintaining necessary purchasing records \n•\tNetworking across several organizations successfully deployed WIINGS to ATM, which enabled implementation of the Spares Harvest Project with actual savings of $5.3M \n \nNew Product Introduction Integrator \n•\tCoordinator of new technology introduction, integrating the resources to implement projects, single point of contact for the Factories for Materials related issues, maintaining PAS at 100%  \n \nCR Indirect Materials Group Leader  \n•\tSupervised activities related to inventory management, contracts, vendor ability to meet specifications and the purchase of spares, equipment, tools, services and operational supplies. Responsible for developing, coaching and performance evaluation for a team of 4 buyers and 2 transaction specialists.  \n \nCR Inventory Management Team leader & CR representative in the Virtual Factory\t \n•\tLeader of the local Inventory Team responsible for achieving the inventory indicators and optimizing inventory.  \nSenior Transport Media Buyer \n•\tManage Transport Media inventory by defining & maintaining healthy stoking levels (min/max), identifying and engaging in cost savings and inventory reduction activities, negotiating local contracts and executing procurement activities \n•\tAs a project manager lead the VF Buffer Reduction Team, which drove the reduction in the requirements for Handling Media across the VF, which resulted in $2.03M reduction of materials Languages English English English Skills Supplier Negotiation Supply Chain Management Supply Chain... Team Management Inventory Management Vendor Managed Inventory Vendor Relationships Contract Negotiation Contract Management Six Sigma Lean Tools Continuous Improvement Cross-functional Team... Procurement Product Development Program Management Project Management Strategic Sourcing Supply Chain See 4+     See less Skills  Supplier Negotiation Supply Chain Management Supply Chain... Team Management Inventory Management Vendor Managed Inventory Vendor Relationships Contract Negotiation Contract Management Six Sigma Lean Tools Continuous Improvement Cross-functional Team... Procurement Product Development Program Management Project Management Strategic Sourcing Supply Chain See 4+     See less Supplier Negotiation Supply Chain Management Supply Chain... Team Management Inventory Management Vendor Managed Inventory Vendor Relationships Contract Negotiation Contract Management Six Sigma Lean Tools Continuous Improvement Cross-functional Team... Procurement Product Development Program Management Project Management Strategic Sourcing Supply Chain See 4+     See less Supplier Negotiation Supply Chain Management Supply Chain... Team Management Inventory Management Vendor Managed Inventory Vendor Relationships Contract Negotiation Contract Management Six Sigma Lean Tools Continuous Improvement Cross-functional Team... Procurement Product Development Program Management Project Management Strategic Sourcing Supply Chain See 4+     See less Education La Salle Universidad Fidelitas Bachelor's degree,  Industrial Engineering La Salle La Salle La Salle Universidad Fidelitas Bachelor's degree,  Industrial Engineering Universidad Fidelitas Bachelor's degree,  Industrial Engineering Universidad Fidelitas Bachelor's degree,  Industrial Engineering ", "Experience Transaction Specialist/Buyer Intel Corporation Transaction Specialist/Buyer Intel Corporation Transaction Specialist/Buyer Intel Corporation Education Saint Louis University 1967  – 1969 Saint Louis University 1967  – 1969 Saint Louis University 1967  – 1969 Saint Louis University 1967  – 1969 ", "Summary Results oriented business leader and strategy professional, experienced in managing global onsite and remote teams and driving increased efficiency and results while reducing costs. Managed all business operations and P&L for multinational company with the ability to manage at a strategic level, yet also operate with tactical flawlessness. Additional experience in account, supply chain, marketing, and project management. Specialties:Customer Service, Team Leadership, Business Strategy, Training, Operations, Process Improvement, Project Management, Online Marketing, Sales Strategy, Negotiations, Sourcing/Supply Chain Management, Finance, Analytics/Metrics. Summary Results oriented business leader and strategy professional, experienced in managing global onsite and remote teams and driving increased efficiency and results while reducing costs. Managed all business operations and P&L for multinational company with the ability to manage at a strategic level, yet also operate with tactical flawlessness. Additional experience in account, supply chain, marketing, and project management. Specialties:Customer Service, Team Leadership, Business Strategy, Training, Operations, Process Improvement, Project Management, Online Marketing, Sales Strategy, Negotiations, Sourcing/Supply Chain Management, Finance, Analytics/Metrics. Results oriented business leader and strategy professional, experienced in managing global onsite and remote teams and driving increased efficiency and results while reducing costs. Managed all business operations and P&L for multinational company with the ability to manage at a strategic level, yet also operate with tactical flawlessness. Additional experience in account, supply chain, marketing, and project management. Specialties:Customer Service, Team Leadership, Business Strategy, Training, Operations, Process Improvement, Project Management, Online Marketing, Sales Strategy, Negotiations, Sourcing/Supply Chain Management, Finance, Analytics/Metrics. Results oriented business leader and strategy professional, experienced in managing global onsite and remote teams and driving increased efficiency and results while reducing costs. Managed all business operations and P&L for multinational company with the ability to manage at a strategic level, yet also operate with tactical flawlessness. Additional experience in account, supply chain, marketing, and project management. Specialties:Customer Service, Team Leadership, Business Strategy, Training, Operations, Process Improvement, Project Management, Online Marketing, Sales Strategy, Negotiations, Sourcing/Supply Chain Management, Finance, Analytics/Metrics. Skills Marketing Strategy SEM Business Strategy Business Development Vendor Management Strategic Sourcing Supply Chain Strategic Partnerships Competitive Analysis Product Marketing Cross-functional Team... Product Management Analytics Leadership Project Management Program Management Contract Negotiation Process Improvement Training Strategy Management P&L Management Negotiation Start-ups Strategic Planning SEO Supply Chain Management Online Marketing Supply Management Analysis Marketing Budgets Market Research Online Advertising Team Leadership Product Development Business Process Team Building Sales See 24+     See less Skills  Marketing Strategy SEM Business Strategy Business Development Vendor Management Strategic Sourcing Supply Chain Strategic Partnerships Competitive Analysis Product Marketing Cross-functional Team... Product Management Analytics Leadership Project Management Program Management Contract Negotiation Process Improvement Training Strategy Management P&L Management Negotiation Start-ups Strategic Planning SEO Supply Chain Management Online Marketing Supply Management Analysis Marketing Budgets Market Research Online Advertising Team Leadership Product Development Business Process Team Building Sales See 24+     See less Marketing Strategy SEM Business Strategy Business Development Vendor Management Strategic Sourcing Supply Chain Strategic Partnerships Competitive Analysis Product Marketing Cross-functional Team... Product Management Analytics Leadership Project Management Program Management Contract Negotiation Process Improvement Training Strategy Management P&L Management Negotiation Start-ups Strategic Planning SEO Supply Chain Management Online Marketing Supply Management Analysis Marketing Budgets Market Research Online Advertising Team Leadership Product Development Business Process Team Building Sales See 24+     See less Marketing Strategy SEM Business Strategy Business Development Vendor Management Strategic Sourcing Supply Chain Strategic Partnerships Competitive Analysis Product Marketing Cross-functional Team... Product Management Analytics Leadership Project Management Program Management Contract Negotiation Process Improvement Training Strategy Management P&L Management Negotiation Start-ups Strategic Planning SEO Supply Chain Management Online Marketing Supply Management Analysis Marketing Budgets Market Research Online Advertising Team Leadership Product Development Business Process Team Building Sales See 24+     See less ", "Experience Buyer Intel Corporation September 2012  – Present (3 years) Buyer Intel Corporation September 2012  – Present (3 years) Buyer Intel Corporation September 2012  – Present (3 years) Skills SPSS Hebrew PowerPoint Microsoft Office Microsoft Word Research Microsoft Excel Data Analysis Customer Service English Skills  SPSS Hebrew PowerPoint Microsoft Office Microsoft Word Research Microsoft Excel Data Analysis Customer Service English SPSS Hebrew PowerPoint Microsoft Office Microsoft Word Research Microsoft Excel Data Analysis Customer Service English SPSS Hebrew PowerPoint Microsoft Office Microsoft Word Research Microsoft Excel Data Analysis Customer Service English Education The Hebrew University Master of Business Administration (MBA) 2012  – 2014 The Hebrew University Bachelor of Arts (B.A.) 2009  – 2012 The Hebrew University Master of Business Administration (MBA) 2012  – 2014 The Hebrew University Master of Business Administration (MBA) 2012  – 2014 The Hebrew University Master of Business Administration (MBA) 2012  – 2014 The Hebrew University Bachelor of Arts (B.A.) 2009  – 2012 The Hebrew University Bachelor of Arts (B.A.) 2009  – 2012 The Hebrew University Bachelor of Arts (B.A.) 2009  – 2012 ", "Summary A multilingual (English, Mandarin and Shanghainese) Supply Chain professional and MBA with experience working in Fortune 500 companies. Experience in supplier management, inventory management, negotiation, NPI and lean project (cross-functional process improvement), data analysis, forecasting, negotiation, communication and collaboration. Reputation for initiating cross-functional process improvement and cost reduction projects. Summary A multilingual (English, Mandarin and Shanghainese) Supply Chain professional and MBA with experience working in Fortune 500 companies. Experience in supplier management, inventory management, negotiation, NPI and lean project (cross-functional process improvement), data analysis, forecasting, negotiation, communication and collaboration. Reputation for initiating cross-functional process improvement and cost reduction projects. A multilingual (English, Mandarin and Shanghainese) Supply Chain professional and MBA with experience working in Fortune 500 companies. Experience in supplier management, inventory management, negotiation, NPI and lean project (cross-functional process improvement), data analysis, forecasting, negotiation, communication and collaboration. Reputation for initiating cross-functional process improvement and cost reduction projects. A multilingual (English, Mandarin and Shanghainese) Supply Chain professional and MBA with experience working in Fortune 500 companies. Experience in supplier management, inventory management, negotiation, NPI and lean project (cross-functional process improvement), data analysis, forecasting, negotiation, communication and collaboration. Reputation for initiating cross-functional process improvement and cost reduction projects. Experience Purchasing Specialist and demand planner Dana Innovations April 2013  – Present (2 years 5 months) San Clemente Managed key product's forecast, demand planning and purchasing, and led cross-functional projects to improve operational efficiency. Manage 10 global suppliers and their price contracts (14 million annual spending). \n•\tManaged key products' monthly forecasts and demand plans, which contributed to 80% of company’s revenue. Successfully increased the inventory turnover rate by 40%, and decreased the monthly backorder amount by 70%, through introduction and implementation of new inventory classification method.  \n•\tAchieved the shortening of the purchasing lead-time by 30 days by forecast sharing with vendors, and the enhancement of the supply chain's flexibility to support expanding numbers of large job orders. \n•\tLed cross-functional projects such as operation dashboard and supply portal project, fed real-time inventory status to CRM, and brought about improved client communication process. Intern Sr Graduate advisor Dell June 2012  –  September 2012  (4 months) Austin, Texas Area Responsible for managing a $1M outsourcing project focused on evaluating the internal auditing procedure for travel and expense reimbursement in the World Wide Procurement, General Procurement, Travel and Expense department. \n•\tBuilt a financial model to evaluate the costs and benefits of the existing internal audit process. \n•\tDeveloped a uniform auditor performance dashboard identifying and quantifying risk and cost savings by collaborating with regional representatives. \n•\tLed industry best practice benchmarking on T&E internal audit rate and vendor audit services. \n•\tCollaborated with commodity manager to evaluate vendor’s proposals based on the cost benefit analysis. Recommended department not outsource, but improve the existing process by working with ethic and internal control group. Global Buyer Intel Corporation November 2009  –  July 2011  (1 year 9 months) Chengdu Global Buyer (Chengdu, China 11/2009-07/2011) \nManaged 10 global suppliers to support 60% production of CPU and chipset for world market; Led NPI (new product) project and Lean project in purchasing department, contributed to cost reduction;  \n•\tIncreased by 60% of On Time Delivery record for two problematic vendors by initiating meetings to understand vendors’ constrain, finding alternatives and leveraging power of commodity managers and factory managers to drive vendors to make commitment.  \n•\tCo-negotiated the quotation of vendors’ on-site support, and reduced costs by 63%. \n•\tAchieve 0% office injuries goal by representing purchasing department to attend Site Safety meeting, nominating safety stars and holding different safety training, events and activities to enhance the office safety culture. \n•\tLed NPI project to schedule the material purchasing according to the production milestone; 0% shut down cases caused by material shortage in the last 2 years, especially succeeded in Japan earthquake \n•\tCollaborated with finance department to make a thorough cost reduction plan for CD6, plan included 75% dead inventory clean up, spare parts usage control and local source development. \n•\tIdentified the root cause of Aging Purchasing Orders by fish bone analysis; created and improved Aging Purchase Order tracking process. \n•\tLed global buyer sub-team for one key vendor, initiate meeting regarding to solve different local issues; created a communication bridge for buyers and commodity managers. \n•\tAnalyzed and compiled statistical data by IMRT, SAP and GPR, worked with vendors to help develop and ensure product specifications, tracks trends and manufacturing processes and maintains necessary records. Global Buyer Intel Corporation August 2008  –  November 2009  (1 year 4 months) Shanghai Managed 8 global suppliers for both Shanghai and Chengdu site \nDeveloped long term relationship with honorific suppliers. By teaming Intel global factory buyers and commodity managers to ensure suppliers implement all contractual obligations. \nUnder volatile business environment, cooperated with factory personnel, involving various cost saving projects such as CV Supplier Chain Department Intern Perfetti Van Melle June 2005  –  August 2005  (3 months) Worked in purchasing and planning group to support daily manufacturing. Purchasing Specialist and demand planner Dana Innovations April 2013  – Present (2 years 5 months) San Clemente Managed key product's forecast, demand planning and purchasing, and led cross-functional projects to improve operational efficiency. Manage 10 global suppliers and their price contracts (14 million annual spending). \n•\tManaged key products' monthly forecasts and demand plans, which contributed to 80% of company’s revenue. Successfully increased the inventory turnover rate by 40%, and decreased the monthly backorder amount by 70%, through introduction and implementation of new inventory classification method.  \n•\tAchieved the shortening of the purchasing lead-time by 30 days by forecast sharing with vendors, and the enhancement of the supply chain's flexibility to support expanding numbers of large job orders. \n•\tLed cross-functional projects such as operation dashboard and supply portal project, fed real-time inventory status to CRM, and brought about improved client communication process. Purchasing Specialist and demand planner Dana Innovations April 2013  – Present (2 years 5 months) San Clemente Managed key product's forecast, demand planning and purchasing, and led cross-functional projects to improve operational efficiency. Manage 10 global suppliers and their price contracts (14 million annual spending). \n•\tManaged key products' monthly forecasts and demand plans, which contributed to 80% of company’s revenue. Successfully increased the inventory turnover rate by 40%, and decreased the monthly backorder amount by 70%, through introduction and implementation of new inventory classification method.  \n•\tAchieved the shortening of the purchasing lead-time by 30 days by forecast sharing with vendors, and the enhancement of the supply chain's flexibility to support expanding numbers of large job orders. \n•\tLed cross-functional projects such as operation dashboard and supply portal project, fed real-time inventory status to CRM, and brought about improved client communication process. Intern Sr Graduate advisor Dell June 2012  –  September 2012  (4 months) Austin, Texas Area Responsible for managing a $1M outsourcing project focused on evaluating the internal auditing procedure for travel and expense reimbursement in the World Wide Procurement, General Procurement, Travel and Expense department. \n•\tBuilt a financial model to evaluate the costs and benefits of the existing internal audit process. \n•\tDeveloped a uniform auditor performance dashboard identifying and quantifying risk and cost savings by collaborating with regional representatives. \n•\tLed industry best practice benchmarking on T&E internal audit rate and vendor audit services. \n•\tCollaborated with commodity manager to evaluate vendor’s proposals based on the cost benefit analysis. Recommended department not outsource, but improve the existing process by working with ethic and internal control group. Intern Sr Graduate advisor Dell June 2012  –  September 2012  (4 months) Austin, Texas Area Responsible for managing a $1M outsourcing project focused on evaluating the internal auditing procedure for travel and expense reimbursement in the World Wide Procurement, General Procurement, Travel and Expense department. \n•\tBuilt a financial model to evaluate the costs and benefits of the existing internal audit process. \n•\tDeveloped a uniform auditor performance dashboard identifying and quantifying risk and cost savings by collaborating with regional representatives. \n•\tLed industry best practice benchmarking on T&E internal audit rate and vendor audit services. \n•\tCollaborated with commodity manager to evaluate vendor’s proposals based on the cost benefit analysis. Recommended department not outsource, but improve the existing process by working with ethic and internal control group. Global Buyer Intel Corporation November 2009  –  July 2011  (1 year 9 months) Chengdu Global Buyer (Chengdu, China 11/2009-07/2011) \nManaged 10 global suppliers to support 60% production of CPU and chipset for world market; Led NPI (new product) project and Lean project in purchasing department, contributed to cost reduction;  \n•\tIncreased by 60% of On Time Delivery record for two problematic vendors by initiating meetings to understand vendors’ constrain, finding alternatives and leveraging power of commodity managers and factory managers to drive vendors to make commitment.  \n•\tCo-negotiated the quotation of vendors’ on-site support, and reduced costs by 63%. \n•\tAchieve 0% office injuries goal by representing purchasing department to attend Site Safety meeting, nominating safety stars and holding different safety training, events and activities to enhance the office safety culture. \n•\tLed NPI project to schedule the material purchasing according to the production milestone; 0% shut down cases caused by material shortage in the last 2 years, especially succeeded in Japan earthquake \n•\tCollaborated with finance department to make a thorough cost reduction plan for CD6, plan included 75% dead inventory clean up, spare parts usage control and local source development. \n•\tIdentified the root cause of Aging Purchasing Orders by fish bone analysis; created and improved Aging Purchase Order tracking process. \n•\tLed global buyer sub-team for one key vendor, initiate meeting regarding to solve different local issues; created a communication bridge for buyers and commodity managers. \n•\tAnalyzed and compiled statistical data by IMRT, SAP and GPR, worked with vendors to help develop and ensure product specifications, tracks trends and manufacturing processes and maintains necessary records. Global Buyer Intel Corporation November 2009  –  July 2011  (1 year 9 months) Chengdu Global Buyer (Chengdu, China 11/2009-07/2011) \nManaged 10 global suppliers to support 60% production of CPU and chipset for world market; Led NPI (new product) project and Lean project in purchasing department, contributed to cost reduction;  \n•\tIncreased by 60% of On Time Delivery record for two problematic vendors by initiating meetings to understand vendors’ constrain, finding alternatives and leveraging power of commodity managers and factory managers to drive vendors to make commitment.  \n•\tCo-negotiated the quotation of vendors’ on-site support, and reduced costs by 63%. \n•\tAchieve 0% office injuries goal by representing purchasing department to attend Site Safety meeting, nominating safety stars and holding different safety training, events and activities to enhance the office safety culture. \n•\tLed NPI project to schedule the material purchasing according to the production milestone; 0% shut down cases caused by material shortage in the last 2 years, especially succeeded in Japan earthquake \n•\tCollaborated with finance department to make a thorough cost reduction plan for CD6, plan included 75% dead inventory clean up, spare parts usage control and local source development. \n•\tIdentified the root cause of Aging Purchasing Orders by fish bone analysis; created and improved Aging Purchase Order tracking process. \n•\tLed global buyer sub-team for one key vendor, initiate meeting regarding to solve different local issues; created a communication bridge for buyers and commodity managers. \n•\tAnalyzed and compiled statistical data by IMRT, SAP and GPR, worked with vendors to help develop and ensure product specifications, tracks trends and manufacturing processes and maintains necessary records. Global Buyer Intel Corporation August 2008  –  November 2009  (1 year 4 months) Shanghai Managed 8 global suppliers for both Shanghai and Chengdu site \nDeveloped long term relationship with honorific suppliers. By teaming Intel global factory buyers and commodity managers to ensure suppliers implement all contractual obligations. \nUnder volatile business environment, cooperated with factory personnel, involving various cost saving projects such as CV Global Buyer Intel Corporation August 2008  –  November 2009  (1 year 4 months) Shanghai Managed 8 global suppliers for both Shanghai and Chengdu site \nDeveloped long term relationship with honorific suppliers. By teaming Intel global factory buyers and commodity managers to ensure suppliers implement all contractual obligations. \nUnder volatile business environment, cooperated with factory personnel, involving various cost saving projects such as CV Supplier Chain Department Intern Perfetti Van Melle June 2005  –  August 2005  (3 months) Worked in purchasing and planning group to support daily manufacturing. Supplier Chain Department Intern Perfetti Van Melle June 2005  –  August 2005  (3 months) Worked in purchasing and planning group to support daily manufacturing. Languages English Full professional proficiency Chinese Native or bilingual proficiency Cantonese Limited working proficiency English Full professional proficiency Chinese Native or bilingual proficiency Cantonese Limited working proficiency English Full professional proficiency Chinese Native or bilingual proficiency Cantonese Limited working proficiency Full professional proficiency Native or bilingual proficiency Limited working proficiency Skills Cross-functional Team... Supply Chain Management Project Management Forecasting Product Management Competitive Analysis Process Improvement Product Development SAP Mandarin Market Research Analysis Strategic Sourcing Microsoft Excel Contract Negotiation Negotiation Manufacturing Six Sigma Procurement Financial Modeling Project Planning Purchasing Sourcing Financial Analysis Management Supply Management Supply Chain Leadership Data Analysis Lean Manufacturing See 15+     See less Skills  Cross-functional Team... Supply Chain Management Project Management Forecasting Product Management Competitive Analysis Process Improvement Product Development SAP Mandarin Market Research Analysis Strategic Sourcing Microsoft Excel Contract Negotiation Negotiation Manufacturing Six Sigma Procurement Financial Modeling Project Planning Purchasing Sourcing Financial Analysis Management Supply Management Supply Chain Leadership Data Analysis Lean Manufacturing See 15+     See less Cross-functional Team... Supply Chain Management Project Management Forecasting Product Management Competitive Analysis Process Improvement Product Development SAP Mandarin Market Research Analysis Strategic Sourcing Microsoft Excel Contract Negotiation Negotiation Manufacturing Six Sigma Procurement Financial Modeling Project Planning Purchasing Sourcing Financial Analysis Management Supply Management Supply Chain Leadership Data Analysis Lean Manufacturing See 15+     See less Cross-functional Team... Supply Chain Management Project Management Forecasting Product Management Competitive Analysis Process Improvement Product Development SAP Mandarin Market Research Analysis Strategic Sourcing Microsoft Excel Contract Negotiation Negotiation Manufacturing Six Sigma Procurement Financial Modeling Project Planning Purchasing Sourcing Financial Analysis Management Supply Management Supply Chain Leadership Data Analysis Lean Manufacturing See 15+     See less Education University of California, Irvine - The Paul Merage School of Business Master,  Business Administration; Supply Chain Management 2011  – 2013 Scholarship \nGMAT score 740 University of Toronto - Rotman School of Management Bachelor of Commerce,  specialist in Finance; Economics 2005  – 2008 闵行中学 University of California, Irvine - The Paul Merage School of Business Master,  Business Administration; Supply Chain Management 2011  – 2013 Scholarship \nGMAT score 740 University of California, Irvine - The Paul Merage School of Business Master,  Business Administration; Supply Chain Management 2011  – 2013 Scholarship \nGMAT score 740 University of California, Irvine - The Paul Merage School of Business Master,  Business Administration; Supply Chain Management 2011  – 2013 Scholarship \nGMAT score 740 University of Toronto - Rotman School of Management Bachelor of Commerce,  specialist in Finance; Economics 2005  – 2008 University of Toronto - Rotman School of Management Bachelor of Commerce,  specialist in Finance; Economics 2005  – 2008 University of Toronto - Rotman School of Management Bachelor of Commerce,  specialist in Finance; Economics 2005  – 2008 闵行中学 闵行中学 闵行中学 Honors & Awards Winner of Best Business Concept, UCI Business Plan Competition, 2012 UCI May 2012 Winner of Best Business Concept, UCI Business Plan Competition, 2012 UCI May 2012 Winner of Best Business Concept, UCI Business Plan Competition, 2012 UCI May 2012 Winner of Best Business Concept, UCI Business Plan Competition, 2012 UCI May 2012 "]}