{"position": "Capital Capacity Manager", "company": "Intel Corporation", "profiles": ["Experience Supply Line Program Manager Intel Corporation July 2012  – Present (3 years 2 months) Chandler, Arizona Capital Capacity Manager Intel Corporation May 2011  –  June 2012  (1 year 2 months) Chandler, Arizona Business Analyst Intern Chevron May 2010  –  August 2010  (4 months) Project Manager 6K Consulting LLC July 2005  –  May 2010  (4 years 11 months) Purchasing - Purchasing Manager and Purchasing Agent Archon, Inc. February 2003  –  July 2005  (2 years 6 months) Supply Line Program Manager Intel Corporation July 2012  – Present (3 years 2 months) Chandler, Arizona Supply Line Program Manager Intel Corporation July 2012  – Present (3 years 2 months) Chandler, Arizona Capital Capacity Manager Intel Corporation May 2011  –  June 2012  (1 year 2 months) Chandler, Arizona Capital Capacity Manager Intel Corporation May 2011  –  June 2012  (1 year 2 months) Chandler, Arizona Business Analyst Intern Chevron May 2010  –  August 2010  (4 months) Business Analyst Intern Chevron May 2010  –  August 2010  (4 months) Project Manager 6K Consulting LLC July 2005  –  May 2010  (4 years 11 months) Project Manager 6K Consulting LLC July 2005  –  May 2010  (4 years 11 months) Purchasing - Purchasing Manager and Purchasing Agent Archon, Inc. February 2003  –  July 2005  (2 years 6 months) Purchasing - Purchasing Manager and Purchasing Agent Archon, Inc. February 2003  –  July 2005  (2 years 6 months) Skills Strategic Sourcing Skills  Strategic Sourcing Strategic Sourcing Strategic Sourcing Education Arizona State University - W. P. Carey School of Business 2009  – 2011 University of Phoenix B.S. 2003  – 2005 Arizona State University - W. P. Carey School of Business 2009  – 2011 Arizona State University - W. P. Carey School of Business 2009  – 2011 Arizona State University - W. P. Carey School of Business 2009  – 2011 University of Phoenix B.S. 2003  – 2005 University of Phoenix B.S. 2003  – 2005 University of Phoenix B.S. 2003  – 2005 ", "Summary Senior professional with 12 years of experience in strategic supply chain positions in the aerospace industry. Extensive experience in special projects and assignments towards risk mitigation strategies for new product launch and improvement of low performing suppliers. Summary Senior professional with 12 years of experience in strategic supply chain positions in the aerospace industry. Extensive experience in special projects and assignments towards risk mitigation strategies for new product launch and improvement of low performing suppliers. Senior professional with 12 years of experience in strategic supply chain positions in the aerospace industry. Extensive experience in special projects and assignments towards risk mitigation strategies for new product launch and improvement of low performing suppliers. Senior professional with 12 years of experience in strategic supply chain positions in the aerospace industry. Extensive experience in special projects and assignments towards risk mitigation strategies for new product launch and improvement of low performing suppliers. Experience Capital Capacity Manager Intel Corporation June 2015  – Present (3 months) Chandler, Arizona Supply Chain Performance Manager Embraer US June 2008  –  June 2015  (7 years 1 month) Phoenix, Arizona Area Responsible for the Performance Management of Several strategic suppliers including avionics systems suppliers, propulsion systems, cabin management system and other electronic aircraft systems. Field Service Representative / VMI Leader ELEB Aerospace, Inc July 2007  –  June 2008  (1 year) Wichita, Kansas Area Responsible for a VMI – Vendor Managed Inventory for Landing Gear based at our customer facility (Hawker Beechcraft – Wichita, KS). In this role I have acquired very strong self-management skills, time management skills and “work-under pressure skills”. Program Leader ELEB August 2006  –  June 2007  (11 months) São José dos Campos Area, Brazil Responsible for contract administration and assembly line transition activities for 02 product lines (Landing Gear development program), including P&L Reporting and improvement strategies. Export Analyst ELEB June 2001  –  August 2006  (5 years 3 months) São José dos Campos Area, Brazil Developed Company's Export Procedures and establishment of protocols for interfacing with Brazilian Customs agencies. Also acted as focal point for Export Dept. during SAP Implementation. Capital Capacity Manager Intel Corporation June 2015  – Present (3 months) Chandler, Arizona Capital Capacity Manager Intel Corporation June 2015  – Present (3 months) Chandler, Arizona Supply Chain Performance Manager Embraer US June 2008  –  June 2015  (7 years 1 month) Phoenix, Arizona Area Responsible for the Performance Management of Several strategic suppliers including avionics systems suppliers, propulsion systems, cabin management system and other electronic aircraft systems. Supply Chain Performance Manager Embraer US June 2008  –  June 2015  (7 years 1 month) Phoenix, Arizona Area Responsible for the Performance Management of Several strategic suppliers including avionics systems suppliers, propulsion systems, cabin management system and other electronic aircraft systems. Field Service Representative / VMI Leader ELEB Aerospace, Inc July 2007  –  June 2008  (1 year) Wichita, Kansas Area Responsible for a VMI – Vendor Managed Inventory for Landing Gear based at our customer facility (Hawker Beechcraft – Wichita, KS). In this role I have acquired very strong self-management skills, time management skills and “work-under pressure skills”. Field Service Representative / VMI Leader ELEB Aerospace, Inc July 2007  –  June 2008  (1 year) Wichita, Kansas Area Responsible for a VMI – Vendor Managed Inventory for Landing Gear based at our customer facility (Hawker Beechcraft – Wichita, KS). In this role I have acquired very strong self-management skills, time management skills and “work-under pressure skills”. Program Leader ELEB August 2006  –  June 2007  (11 months) São José dos Campos Area, Brazil Responsible for contract administration and assembly line transition activities for 02 product lines (Landing Gear development program), including P&L Reporting and improvement strategies. Program Leader ELEB August 2006  –  June 2007  (11 months) São José dos Campos Area, Brazil Responsible for contract administration and assembly line transition activities for 02 product lines (Landing Gear development program), including P&L Reporting and improvement strategies. Export Analyst ELEB June 2001  –  August 2006  (5 years 3 months) São José dos Campos Area, Brazil Developed Company's Export Procedures and establishment of protocols for interfacing with Brazilian Customs agencies. Also acted as focal point for Export Dept. during SAP Implementation. Export Analyst ELEB June 2001  –  August 2006  (5 years 3 months) São José dos Campos Area, Brazil Developed Company's Export Procedures and establishment of protocols for interfacing with Brazilian Customs agencies. Also acted as focal point for Export Dept. during SAP Implementation. Languages Portuguese - Brazilian Native or bilingual proficiency English Full professional proficiency Portuguese - Brazilian Native or bilingual proficiency English Full professional proficiency Portuguese - Brazilian Native or bilingual proficiency English Full professional proficiency Native or bilingual proficiency Full professional proficiency Skills Supplier Performance... Product Development Program Management Contract Administration Upper Management... Conflict Resolution Work Under Pressure Project Management Product Obsolescence... Aerospace Industries Avionics Aviation Aerospace Aeronautics Aircraft Contract Management Supply Chain Management ERP Crisis Management Kaizen Supply Chain Manufacturing Process Improvement Logistics Leadership Management Six Sigma Negotiation Supplier Performance See 14+     See less Skills  Supplier Performance... Product Development Program Management Contract Administration Upper Management... Conflict Resolution Work Under Pressure Project Management Product Obsolescence... Aerospace Industries Avionics Aviation Aerospace Aeronautics Aircraft Contract Management Supply Chain Management ERP Crisis Management Kaizen Supply Chain Manufacturing Process Improvement Logistics Leadership Management Six Sigma Negotiation Supplier Performance See 14+     See less Supplier Performance... Product Development Program Management Contract Administration Upper Management... Conflict Resolution Work Under Pressure Project Management Product Obsolescence... Aerospace Industries Avionics Aviation Aerospace Aeronautics Aircraft Contract Management Supply Chain Management ERP Crisis Management Kaizen Supply Chain Manufacturing Process Improvement Logistics Leadership Management Six Sigma Negotiation Supplier Performance See 14+     See less Supplier Performance... Product Development Program Management Contract Administration Upper Management... Conflict Resolution Work Under Pressure Project Management Product Obsolescence... Aerospace Industries Avionics Aviation Aerospace Aeronautics Aircraft Contract Management Supply Chain Management ERP Crisis Management Kaizen Supply Chain Manufacturing Process Improvement Logistics Leadership Management Six Sigma Negotiation Supplier Performance See 14+     See less Education University of Arizona, Eller College of Management Master of Business Administration (M.B.A.) , 3.9 2013  – 2014 Fundação Armando Alvares Penteado Post Graduation in Logistics,  Logistics , Materials, and Supply Chain Management 2004  – 2005 PMI - Project Management Institute Project Management: Methods and Mechanics,  Project Management 2009  – 2009 Nova Southeastern University Lean Six Sigma 2008  – 2008 UNIP - Universidade Paulista Bachelor of Business Administration (B.B.A.),  International Business/Trade/Commerce 2000  – 2003 University of Arizona, Eller College of Management Master of Business Administration (M.B.A.) , 3.9 2013  – 2014 University of Arizona, Eller College of Management Master of Business Administration (M.B.A.) , 3.9 2013  – 2014 University of Arizona, Eller College of Management Master of Business Administration (M.B.A.) , 3.9 2013  – 2014 Fundação Armando Alvares Penteado Post Graduation in Logistics,  Logistics , Materials, and Supply Chain Management 2004  – 2005 Fundação Armando Alvares Penteado Post Graduation in Logistics,  Logistics , Materials, and Supply Chain Management 2004  – 2005 Fundação Armando Alvares Penteado Post Graduation in Logistics,  Logistics , Materials, and Supply Chain Management 2004  – 2005 PMI - Project Management Institute Project Management: Methods and Mechanics,  Project Management 2009  – 2009 PMI - Project Management Institute Project Management: Methods and Mechanics,  Project Management 2009  – 2009 PMI - Project Management Institute Project Management: Methods and Mechanics,  Project Management 2009  – 2009 Nova Southeastern University Lean Six Sigma 2008  – 2008 Nova Southeastern University Lean Six Sigma 2008  – 2008 Nova Southeastern University Lean Six Sigma 2008  – 2008 UNIP - Universidade Paulista Bachelor of Business Administration (B.B.A.),  International Business/Trade/Commerce 2000  – 2003 UNIP - Universidade Paulista Bachelor of Business Administration (B.B.A.),  International Business/Trade/Commerce 2000  – 2003 UNIP - Universidade Paulista Bachelor of Business Administration (B.B.A.),  International Business/Trade/Commerce 2000  – 2003 Honors & Awards ", "Experience Capital Capacity Manager Intel Corporation Capital Capacity Manager Intel Corporation Capital Capacity Manager Intel Corporation ", "Experience Capital Supply Manager Intel Corporation October 2011  – Present (3 years 11 months) Capital Capacity Manager Intel Corporation May 2008  –  October 2011  (3 years 6 months) Capital Supply Manager Intel Corporation October 2011  – Present (3 years 11 months) Capital Supply Manager Intel Corporation October 2011  – Present (3 years 11 months) Capital Capacity Manager Intel Corporation May 2008  –  October 2011  (3 years 6 months) Capital Capacity Manager Intel Corporation May 2008  –  October 2011  (3 years 6 months) Skills Supply Management Lean Manufacturing Supply Chain Management Supply Chain... Strategic Sourcing Supply Chain Cross-functional Team... Six Sigma Materials Management Global Sourcing Procurement Skills  Supply Management Lean Manufacturing Supply Chain Management Supply Chain... Strategic Sourcing Supply Chain Cross-functional Team... Six Sigma Materials Management Global Sourcing Procurement Supply Management Lean Manufacturing Supply Chain Management Supply Chain... Strategic Sourcing Supply Chain Cross-functional Team... Six Sigma Materials Management Global Sourcing Procurement Supply Management Lean Manufacturing Supply Chain Management Supply Chain... Strategic Sourcing Supply Chain Cross-functional Team... Six Sigma Materials Management Global Sourcing Procurement Education University of Arizona, Eller College of Management Master of Business Administration (MBA) 2015  – 2016 Arizona State University - W. P. Carey School of Business Bachelors,  Supply Chain Management 2005  – 2008 University of Arizona, Eller College of Management Master of Business Administration (MBA) 2015  – 2016 University of Arizona, Eller College of Management Master of Business Administration (MBA) 2015  – 2016 University of Arizona, Eller College of Management Master of Business Administration (MBA) 2015  – 2016 Arizona State University - W. P. Carey School of Business Bachelors,  Supply Chain Management 2005  – 2008 Arizona State University - W. P. Carey School of Business Bachelors,  Supply Chain Management 2005  – 2008 Arizona State University - W. P. Carey School of Business Bachelors,  Supply Chain Management 2005  – 2008 ", "Experience Capital Capacity Manager Intel Corporation 2011  – Present (4 years) Judge United States Academic Decathlon August 2005  – Present (10 years 1 month) volunteer Mesa Community College 2007  –  2007  (less than a year) Capital Capacity Manager Intel Corporation 2011  – Present (4 years) Capital Capacity Manager Intel Corporation 2011  – Present (4 years) Judge United States Academic Decathlon August 2005  – Present (10 years 1 month) Judge United States Academic Decathlon August 2005  – Present (10 years 1 month) volunteer Mesa Community College 2007  –  2007  (less than a year) volunteer Mesa Community College 2007  –  2007  (less than a year) Education Arizona State University - W. P. Carey School of Business Finance ,  Supply Chain Management ,  International Business 2007  – 2009 Mesa Community College Associate's in Business,  Finance 2005  – 2007 Arizona State University - W. P. Carey School of Business Finance ,  Supply Chain Management ,  International Business 2007  – 2009 Arizona State University - W. P. Carey School of Business Finance ,  Supply Chain Management ,  International Business 2007  – 2009 Arizona State University - W. P. Carey School of Business Finance ,  Supply Chain Management ,  International Business 2007  – 2009 Mesa Community College Associate's in Business,  Finance 2005  – 2007 Mesa Community College Associate's in Business,  Finance 2005  – 2007 Mesa Community College Associate's in Business,  Finance 2005  – 2007 Honors & Awards Additional Honors & Awards Presidential Scholarship \nEmil Barberich Scholarship \nAmerican Society of Transportation and Logistics \nJane A. Perrot Memorial Scholarship \nSCMA Scholarhip Additional Honors & Awards Presidential Scholarship \nEmil Barberich Scholarship \nAmerican Society of Transportation and Logistics \nJane A. Perrot Memorial Scholarship \nSCMA Scholarhip Additional Honors & Awards Presidential Scholarship \nEmil Barberich Scholarship \nAmerican Society of Transportation and Logistics \nJane A. Perrot Memorial Scholarship \nSCMA Scholarhip Additional Honors & Awards Presidential Scholarship \nEmil Barberich Scholarship \nAmerican Society of Transportation and Logistics \nJane A. Perrot Memorial Scholarship \nSCMA Scholarhip ", "Summary Seeking a supply chain internship to enhance my background in operations and procurement. Experienced in process improvement, negotiations, supplier relationship management, and cost savings techniques. Summary Seeking a supply chain internship to enhance my background in operations and procurement. Experienced in process improvement, negotiations, supplier relationship management, and cost savings techniques. Seeking a supply chain internship to enhance my background in operations and procurement. Experienced in process improvement, negotiations, supplier relationship management, and cost savings techniques. Seeking a supply chain internship to enhance my background in operations and procurement. Experienced in process improvement, negotiations, supplier relationship management, and cost savings techniques. Experience MBA Candidate The Ohio State University August 2015  – Present (1 month) Columbus, Ohio Area Full-Time MBA candidate with a dual focus in Operations and Logistics & Strategy. Teaching Assistant The Ohio State University August 2015  – Present (1 month) Columbus, Ohio Area Teaching Assistant for undergraduate Logistics Management course. Responsible for student correspondence, grades, and office hours. Capital Capacity Manager Intel Corporation June 2013  – Present (2 years 3 months) VP of Finance Supply Chain Management Association August 2012  –  May 2013  (10 months) W. P. Carey School of Business ASU Managed and allocated funds for club sponsored events and career fairs. \nSupervised and managed all necessary payments and registration for 510(c) (6) accreditation. Leadership Operations Intern Amazon May 2012  –  August 2012  (4 months) PHX 6 Fulfillment Center Phoenix, AZ Directed day-to-day inbound stow operations in a 3.2 million square foot fulfillment center to receive 350,000 plus items a week. \nBalanced the daily direct and indirect labor throughout the shift to ensure proper flow of resources and to meet the output plan, while mentoring a staff of 40-80 associates.  \nUtilized the customer centric First-In-First-Out process to make sure that the items in the building met the Service Level Agreements, and followed the 5S (Sort, Straighten, Sweep, Standardize, and Sustain) process to ensure that the workplace was safe, clean, and efficient. \nImplemented the Plan-Do-Check-Act (PDCA) cycle to evaluate and revamp the standard work stow Andon system. It reduced the time associates had to wait for problem solvers to assist them by 500%.  \nParticipated in a group Kaizen project using the APEPP (Attacking Processes Engaging People Process) model. Collaborated with Area Managers, Software Engineers, Supply Chain Experts, Associates, and Senior Operations Managers to improve the LP (License Plate) receiving process and decrease the amount of missed opportunities on the dock. Community Assistant Arizona State University August 2010  –  May 2012  (1 year 10 months) Ensured that residents in the academic community were safe and satisfied with their accommodations while enforcing policies. \nDeveloped programming to build a sense of community on the floor and educate students on issues pertaining to college life. \nOversaw all other floor operations and was responsible for 38 residents Peer Facilitator Arizona State University August 2010  –  December 2010  (5 months) Created lesson plans, lead discussions, and graded papers for an introductory success in business course to incoming freshmen. \nTaught 18 students and acted as the sole instructor for a 15 week semester. MBA Candidate The Ohio State University August 2015  – Present (1 month) Columbus, Ohio Area Full-Time MBA candidate with a dual focus in Operations and Logistics & Strategy. MBA Candidate The Ohio State University August 2015  – Present (1 month) Columbus, Ohio Area Full-Time MBA candidate with a dual focus in Operations and Logistics & Strategy. Teaching Assistant The Ohio State University August 2015  – Present (1 month) Columbus, Ohio Area Teaching Assistant for undergraduate Logistics Management course. Responsible for student correspondence, grades, and office hours. Teaching Assistant The Ohio State University August 2015  – Present (1 month) Columbus, Ohio Area Teaching Assistant for undergraduate Logistics Management course. Responsible for student correspondence, grades, and office hours. Capital Capacity Manager Intel Corporation June 2013  – Present (2 years 3 months) Capital Capacity Manager Intel Corporation June 2013  – Present (2 years 3 months) VP of Finance Supply Chain Management Association August 2012  –  May 2013  (10 months) W. P. Carey School of Business ASU Managed and allocated funds for club sponsored events and career fairs. \nSupervised and managed all necessary payments and registration for 510(c) (6) accreditation. VP of Finance Supply Chain Management Association August 2012  –  May 2013  (10 months) W. P. Carey School of Business ASU Managed and allocated funds for club sponsored events and career fairs. \nSupervised and managed all necessary payments and registration for 510(c) (6) accreditation. Leadership Operations Intern Amazon May 2012  –  August 2012  (4 months) PHX 6 Fulfillment Center Phoenix, AZ Directed day-to-day inbound stow operations in a 3.2 million square foot fulfillment center to receive 350,000 plus items a week. \nBalanced the daily direct and indirect labor throughout the shift to ensure proper flow of resources and to meet the output plan, while mentoring a staff of 40-80 associates.  \nUtilized the customer centric First-In-First-Out process to make sure that the items in the building met the Service Level Agreements, and followed the 5S (Sort, Straighten, Sweep, Standardize, and Sustain) process to ensure that the workplace was safe, clean, and efficient. \nImplemented the Plan-Do-Check-Act (PDCA) cycle to evaluate and revamp the standard work stow Andon system. It reduced the time associates had to wait for problem solvers to assist them by 500%.  \nParticipated in a group Kaizen project using the APEPP (Attacking Processes Engaging People Process) model. Collaborated with Area Managers, Software Engineers, Supply Chain Experts, Associates, and Senior Operations Managers to improve the LP (License Plate) receiving process and decrease the amount of missed opportunities on the dock. Leadership Operations Intern Amazon May 2012  –  August 2012  (4 months) PHX 6 Fulfillment Center Phoenix, AZ Directed day-to-day inbound stow operations in a 3.2 million square foot fulfillment center to receive 350,000 plus items a week. \nBalanced the daily direct and indirect labor throughout the shift to ensure proper flow of resources and to meet the output plan, while mentoring a staff of 40-80 associates.  \nUtilized the customer centric First-In-First-Out process to make sure that the items in the building met the Service Level Agreements, and followed the 5S (Sort, Straighten, Sweep, Standardize, and Sustain) process to ensure that the workplace was safe, clean, and efficient. \nImplemented the Plan-Do-Check-Act (PDCA) cycle to evaluate and revamp the standard work stow Andon system. It reduced the time associates had to wait for problem solvers to assist them by 500%.  \nParticipated in a group Kaizen project using the APEPP (Attacking Processes Engaging People Process) model. Collaborated with Area Managers, Software Engineers, Supply Chain Experts, Associates, and Senior Operations Managers to improve the LP (License Plate) receiving process and decrease the amount of missed opportunities on the dock. Community Assistant Arizona State University August 2010  –  May 2012  (1 year 10 months) Ensured that residents in the academic community were safe and satisfied with their accommodations while enforcing policies. \nDeveloped programming to build a sense of community on the floor and educate students on issues pertaining to college life. \nOversaw all other floor operations and was responsible for 38 residents Community Assistant Arizona State University August 2010  –  May 2012  (1 year 10 months) Ensured that residents in the academic community were safe and satisfied with their accommodations while enforcing policies. \nDeveloped programming to build a sense of community on the floor and educate students on issues pertaining to college life. \nOversaw all other floor operations and was responsible for 38 residents Peer Facilitator Arizona State University August 2010  –  December 2010  (5 months) Created lesson plans, lead discussions, and graded papers for an introductory success in business course to incoming freshmen. \nTaught 18 students and acted as the sole instructor for a 15 week semester. Peer Facilitator Arizona State University August 2010  –  December 2010  (5 months) Created lesson plans, lead discussions, and graded papers for an introductory success in business course to incoming freshmen. \nTaught 18 students and acted as the sole instructor for a 15 week semester. Languages   Skills Social Media Public Speaking Microsoft Office PowerPoint Event Planning Microsoft Excel Microsoft Word Customer Service Facebook Teamwork Research Marketing Management Skills  Social Media Public Speaking Microsoft Office PowerPoint Event Planning Microsoft Excel Microsoft Word Customer Service Facebook Teamwork Research Marketing Management Social Media Public Speaking Microsoft Office PowerPoint Event Planning Microsoft Excel Microsoft Word Customer Service Facebook Teamwork Research Marketing Management Social Media Public Speaking Microsoft Office PowerPoint Event Planning Microsoft Excel Microsoft Word Customer Service Facebook Teamwork Research Marketing Management Education The Ohio State University Fisher College of Business Master of Business Administration (M.B.A.),  Operations and Logistics/ Strategy 2015  – 2017 Arizona State University, W. P. Carey School of Business Bachelor of Science (B.S.),  Supply Chain Management and Marketing 2009  – 2013 Activities and Societies:  Business Ambassadors ,  VP of Activities for the Business School Council ,  VP of Finance for the Supply Chain Management Association Arizona School of Real Estate and Business Real Estate Salesperson License 2008  – 2009 Invested over 90 hours of classroom education to obtain the Arizona real estate license in high school and is taking continuing education to maintain opportunities in the future. The Ohio State University Fisher College of Business Master of Business Administration (M.B.A.),  Operations and Logistics/ Strategy 2015  – 2017 The Ohio State University Fisher College of Business Master of Business Administration (M.B.A.),  Operations and Logistics/ Strategy 2015  – 2017 The Ohio State University Fisher College of Business Master of Business Administration (M.B.A.),  Operations and Logistics/ Strategy 2015  – 2017 Arizona State University, W. P. Carey School of Business Bachelor of Science (B.S.),  Supply Chain Management and Marketing 2009  – 2013 Activities and Societies:  Business Ambassadors ,  VP of Activities for the Business School Council ,  VP of Finance for the Supply Chain Management Association Arizona State University, W. P. Carey School of Business Bachelor of Science (B.S.),  Supply Chain Management and Marketing 2009  – 2013 Activities and Societies:  Business Ambassadors ,  VP of Activities for the Business School Council ,  VP of Finance for the Supply Chain Management Association Arizona State University, W. P. Carey School of Business Bachelor of Science (B.S.),  Supply Chain Management and Marketing 2009  – 2013 Activities and Societies:  Business Ambassadors ,  VP of Activities for the Business School Council ,  VP of Finance for the Supply Chain Management Association Arizona School of Real Estate and Business Real Estate Salesperson License 2008  – 2009 Invested over 90 hours of classroom education to obtain the Arizona real estate license in high school and is taking continuing education to maintain opportunities in the future. Arizona School of Real Estate and Business Real Estate Salesperson License 2008  – 2009 Invested over 90 hours of classroom education to obtain the Arizona real estate license in high school and is taking continuing education to maintain opportunities in the future. Arizona School of Real Estate and Business Real Estate Salesperson License 2008  – 2009 Invested over 90 hours of classroom education to obtain the Arizona real estate license in high school and is taking continuing education to maintain opportunities in the future. Honors & Awards Additional Honors & Awards -SCM Network Scholar \n- W. P. Carey Leaders Academy Additional Honors & Awards -SCM Network Scholar \n- W. P. Carey Leaders Academy Additional Honors & Awards -SCM Network Scholar \n- W. P. Carey Leaders Academy Additional Honors & Awards -SCM Network Scholar \n- W. P. Carey Leaders Academy ", "Summary Through serving as a Marine Corps Infantry Commander in Iraq and Afghanistan, managing multiple market strategy and supply chain projects, and having had a rigorous academic background, I have gained valuable insights, skills, and experiences. \n \nAs a military leader, MBA student, and summer intern I persistently recognize team members as the source of success, collaborate with diverse groups, and maintain a performance-driven culture. Throughout my five years of experience as an infantry commander, I grew as a strategic problem-solver who cultivates culture, motivation, and pride. This led to autonomy and team success during training and while on deployment. As an MBA student, I had the opportunity to work on projects with very diverse groups. Through building strong relationships, collaboration, and respect with domestic and international students alike, I was elected as president of the Multicultural MBA Association. During my internship, I led the engineering and facilities department comprised of nine members with an average tenure of 27 years. Together, we kept a 1.5 million square foot distribution center at the highest level of service throughout the ten weeks of my internship. These successes would not have been possible without constant emphasis on collaboration, team focus, and a performance driven culture. \n \nAs someone who embraces challenges and readily takes on ambiguous tasks, I have always relied on my problem-solving and leadership skills to overcome obstacles and pursue opportunities. These opportunities include building teams, taking on new projects, and developing an action plan with milestones and defining what success looks like. I welcome the opportunity to further discuss my skills and qualifications in project management, supply chain, or business development. Summary Through serving as a Marine Corps Infantry Commander in Iraq and Afghanistan, managing multiple market strategy and supply chain projects, and having had a rigorous academic background, I have gained valuable insights, skills, and experiences. \n \nAs a military leader, MBA student, and summer intern I persistently recognize team members as the source of success, collaborate with diverse groups, and maintain a performance-driven culture. Throughout my five years of experience as an infantry commander, I grew as a strategic problem-solver who cultivates culture, motivation, and pride. This led to autonomy and team success during training and while on deployment. As an MBA student, I had the opportunity to work on projects with very diverse groups. Through building strong relationships, collaboration, and respect with domestic and international students alike, I was elected as president of the Multicultural MBA Association. During my internship, I led the engineering and facilities department comprised of nine members with an average tenure of 27 years. Together, we kept a 1.5 million square foot distribution center at the highest level of service throughout the ten weeks of my internship. These successes would not have been possible without constant emphasis on collaboration, team focus, and a performance driven culture. \n \nAs someone who embraces challenges and readily takes on ambiguous tasks, I have always relied on my problem-solving and leadership skills to overcome obstacles and pursue opportunities. These opportunities include building teams, taking on new projects, and developing an action plan with milestones and defining what success looks like. I welcome the opportunity to further discuss my skills and qualifications in project management, supply chain, or business development. Through serving as a Marine Corps Infantry Commander in Iraq and Afghanistan, managing multiple market strategy and supply chain projects, and having had a rigorous academic background, I have gained valuable insights, skills, and experiences. \n \nAs a military leader, MBA student, and summer intern I persistently recognize team members as the source of success, collaborate with diverse groups, and maintain a performance-driven culture. Throughout my five years of experience as an infantry commander, I grew as a strategic problem-solver who cultivates culture, motivation, and pride. This led to autonomy and team success during training and while on deployment. As an MBA student, I had the opportunity to work on projects with very diverse groups. Through building strong relationships, collaboration, and respect with domestic and international students alike, I was elected as president of the Multicultural MBA Association. During my internship, I led the engineering and facilities department comprised of nine members with an average tenure of 27 years. Together, we kept a 1.5 million square foot distribution center at the highest level of service throughout the ten weeks of my internship. These successes would not have been possible without constant emphasis on collaboration, team focus, and a performance driven culture. \n \nAs someone who embraces challenges and readily takes on ambiguous tasks, I have always relied on my problem-solving and leadership skills to overcome obstacles and pursue opportunities. These opportunities include building teams, taking on new projects, and developing an action plan with milestones and defining what success looks like. I welcome the opportunity to further discuss my skills and qualifications in project management, supply chain, or business development. Through serving as a Marine Corps Infantry Commander in Iraq and Afghanistan, managing multiple market strategy and supply chain projects, and having had a rigorous academic background, I have gained valuable insights, skills, and experiences. \n \nAs a military leader, MBA student, and summer intern I persistently recognize team members as the source of success, collaborate with diverse groups, and maintain a performance-driven culture. Throughout my five years of experience as an infantry commander, I grew as a strategic problem-solver who cultivates culture, motivation, and pride. This led to autonomy and team success during training and while on deployment. As an MBA student, I had the opportunity to work on projects with very diverse groups. Through building strong relationships, collaboration, and respect with domestic and international students alike, I was elected as president of the Multicultural MBA Association. During my internship, I led the engineering and facilities department comprised of nine members with an average tenure of 27 years. Together, we kept a 1.5 million square foot distribution center at the highest level of service throughout the ten weeks of my internship. These successes would not have been possible without constant emphasis on collaboration, team focus, and a performance driven culture. \n \nAs someone who embraces challenges and readily takes on ambiguous tasks, I have always relied on my problem-solving and leadership skills to overcome obstacles and pursue opportunities. These opportunities include building teams, taking on new projects, and developing an action plan with milestones and defining what success looks like. I welcome the opportunity to further discuss my skills and qualifications in project management, supply chain, or business development. Experience Capital Capacity Manager Intel Corporation May 2014  – Present (1 year 4 months) hillsboro, oregon Capital Capacity Manager  \nSLM AT OPS \nCoordinates purchasing activities with manufacturing and engineering departments to acquire materials, components and equipment in a cost effective and timely manner. Supports commodity deliverables to assure cost, quality, availability and time to market objectives are met. Monitors the cost, schedule and scope. Supply Chain Management Consultant Spartan Consulting Inc. March 2014  –  May 2014  (3 months) east lansing, michigan Analyze container, truck, and rail transportation data from multiple Michigan-based companies. \nProvide the Chamber of Commerce with the results of our research to determine the feasibility of building a logistics hub. Broad MBA Candidate Michigan State University August 2012  –  May 2014  (1 year 10 months) East Lansing, Michigan Supply Chain Management Supply Chain Analyst - New Product Innovation Demmer Center For Business Transformation January 2013  –  January 2014  (1 year 1 month) Lansing, Michigan Area Conducted a market potential and supply chain analysis for Peckham Farms Incorporated resulting in the development of a new food product for placement on more than 200 store shelves by 2014. Product Manager - Strategy & Sourcing Analyst Intern Buztronics Inc July 2013  –  August 2013  (2 months) Indianapolis, Indiana Developed an in-depth market positioning, financial, and strategic pricing analysis for two new consumer product lines resulting in a 43% increase in projected annual profits.  \nHelped refine the mission statements for two company divisions. \nPresented the results directly to the CEO. Engineering & Facilities Group Leader - Distribution Operations Intern Target May 2013  –  August 2013  (4 months) Indianapolis, Indiana area Collaborated daily with vendors and team members to maintain a 1.5M square foot distribution facility supplying 69 stores, resulting in a #2 nationwide level of service ranking. \nManaged projects in battery run-time optimization, best practice compliance, and environmentally sensitive materials process flow. Executive Officer - Captain United States Marine Corps August 2010  –  August 2011  (1 year 1 month) 2nd Battalion, 1st Marines, Company E Helmand Province, Afghanistan \nDeveloped a database which led to effective documentation of the location and condition of $25M of government property, dispersed amongst 9 combat outposts in Afghanistan. \nDirected weekly meetings with the Mayor of Safar, Afghanistan resulting in enhanced local security, the formation of a city budget, and increased civil capacity. \nCoordinated pre-deployment training for 210 Marines who exceeded qualifications by 26%. \nLed 6 officers and 4 non-commissioned officers during 9 pre-deployment company exercises and during combat operations in Afghanistan. Infantry Platoon Commander - 2nd/1st Lieutenant United States Marine Corps June 2007  –  August 2010  (3 years 3 months) 2nd Battalion, 1st Marines, Company E Al Anbar Province, Iraq \nDeveloped a physical and educational training program for 35 Marines and Sailors which resulted in 5 achievement medals and the most promotions of any platoon in the battalion. \nMentored leaders of the local police and city council of Ubaydi, Iraq, resulting in increased communication among Iraqi community leaders.  \nLed the company’s head platoon for every company operation in Iraq and during pre-deployment training for Afghanistan. Recognized by the company commander as the company’s most accomplished platoon commander and promoted to 1st Lieutenant. Combat Engineer - Lance Corporal United States Marine Corps June 2006  –  June 2007  (1 year 1 month) 4th CEB, Company A (South Charleston, WV) Performed the duties of a full-time student while working 2 campus jobs and fulfilling monthly Marine Corps Reserve requirements. \nIdentified as high potential, future leader and selected for the Marine Corps Officer Candidate School following college graduation. Capital Capacity Manager Intel Corporation May 2014  – Present (1 year 4 months) hillsboro, oregon Capital Capacity Manager  \nSLM AT OPS \nCoordinates purchasing activities with manufacturing and engineering departments to acquire materials, components and equipment in a cost effective and timely manner. Supports commodity deliverables to assure cost, quality, availability and time to market objectives are met. Monitors the cost, schedule and scope. Capital Capacity Manager Intel Corporation May 2014  – Present (1 year 4 months) hillsboro, oregon Capital Capacity Manager  \nSLM AT OPS \nCoordinates purchasing activities with manufacturing and engineering departments to acquire materials, components and equipment in a cost effective and timely manner. Supports commodity deliverables to assure cost, quality, availability and time to market objectives are met. Monitors the cost, schedule and scope. Supply Chain Management Consultant Spartan Consulting Inc. March 2014  –  May 2014  (3 months) east lansing, michigan Analyze container, truck, and rail transportation data from multiple Michigan-based companies. \nProvide the Chamber of Commerce with the results of our research to determine the feasibility of building a logistics hub. Supply Chain Management Consultant Spartan Consulting Inc. March 2014  –  May 2014  (3 months) east lansing, michigan Analyze container, truck, and rail transportation data from multiple Michigan-based companies. \nProvide the Chamber of Commerce with the results of our research to determine the feasibility of building a logistics hub. Broad MBA Candidate Michigan State University August 2012  –  May 2014  (1 year 10 months) East Lansing, Michigan Supply Chain Management Broad MBA Candidate Michigan State University August 2012  –  May 2014  (1 year 10 months) East Lansing, Michigan Supply Chain Management Supply Chain Analyst - New Product Innovation Demmer Center For Business Transformation January 2013  –  January 2014  (1 year 1 month) Lansing, Michigan Area Conducted a market potential and supply chain analysis for Peckham Farms Incorporated resulting in the development of a new food product for placement on more than 200 store shelves by 2014. Supply Chain Analyst - New Product Innovation Demmer Center For Business Transformation January 2013  –  January 2014  (1 year 1 month) Lansing, Michigan Area Conducted a market potential and supply chain analysis for Peckham Farms Incorporated resulting in the development of a new food product for placement on more than 200 store shelves by 2014. Product Manager - Strategy & Sourcing Analyst Intern Buztronics Inc July 2013  –  August 2013  (2 months) Indianapolis, Indiana Developed an in-depth market positioning, financial, and strategic pricing analysis for two new consumer product lines resulting in a 43% increase in projected annual profits.  \nHelped refine the mission statements for two company divisions. \nPresented the results directly to the CEO. Product Manager - Strategy & Sourcing Analyst Intern Buztronics Inc July 2013  –  August 2013  (2 months) Indianapolis, Indiana Developed an in-depth market positioning, financial, and strategic pricing analysis for two new consumer product lines resulting in a 43% increase in projected annual profits.  \nHelped refine the mission statements for two company divisions. \nPresented the results directly to the CEO. Engineering & Facilities Group Leader - Distribution Operations Intern Target May 2013  –  August 2013  (4 months) Indianapolis, Indiana area Collaborated daily with vendors and team members to maintain a 1.5M square foot distribution facility supplying 69 stores, resulting in a #2 nationwide level of service ranking. \nManaged projects in battery run-time optimization, best practice compliance, and environmentally sensitive materials process flow. Engineering & Facilities Group Leader - Distribution Operations Intern Target May 2013  –  August 2013  (4 months) Indianapolis, Indiana area Collaborated daily with vendors and team members to maintain a 1.5M square foot distribution facility supplying 69 stores, resulting in a #2 nationwide level of service ranking. \nManaged projects in battery run-time optimization, best practice compliance, and environmentally sensitive materials process flow. Executive Officer - Captain United States Marine Corps August 2010  –  August 2011  (1 year 1 month) 2nd Battalion, 1st Marines, Company E Helmand Province, Afghanistan \nDeveloped a database which led to effective documentation of the location and condition of $25M of government property, dispersed amongst 9 combat outposts in Afghanistan. \nDirected weekly meetings with the Mayor of Safar, Afghanistan resulting in enhanced local security, the formation of a city budget, and increased civil capacity. \nCoordinated pre-deployment training for 210 Marines who exceeded qualifications by 26%. \nLed 6 officers and 4 non-commissioned officers during 9 pre-deployment company exercises and during combat operations in Afghanistan. Executive Officer - Captain United States Marine Corps August 2010  –  August 2011  (1 year 1 month) 2nd Battalion, 1st Marines, Company E Helmand Province, Afghanistan \nDeveloped a database which led to effective documentation of the location and condition of $25M of government property, dispersed amongst 9 combat outposts in Afghanistan. \nDirected weekly meetings with the Mayor of Safar, Afghanistan resulting in enhanced local security, the formation of a city budget, and increased civil capacity. \nCoordinated pre-deployment training for 210 Marines who exceeded qualifications by 26%. \nLed 6 officers and 4 non-commissioned officers during 9 pre-deployment company exercises and during combat operations in Afghanistan. Infantry Platoon Commander - 2nd/1st Lieutenant United States Marine Corps June 2007  –  August 2010  (3 years 3 months) 2nd Battalion, 1st Marines, Company E Al Anbar Province, Iraq \nDeveloped a physical and educational training program for 35 Marines and Sailors which resulted in 5 achievement medals and the most promotions of any platoon in the battalion. \nMentored leaders of the local police and city council of Ubaydi, Iraq, resulting in increased communication among Iraqi community leaders.  \nLed the company’s head platoon for every company operation in Iraq and during pre-deployment training for Afghanistan. Recognized by the company commander as the company’s most accomplished platoon commander and promoted to 1st Lieutenant. Infantry Platoon Commander - 2nd/1st Lieutenant United States Marine Corps June 2007  –  August 2010  (3 years 3 months) 2nd Battalion, 1st Marines, Company E Al Anbar Province, Iraq \nDeveloped a physical and educational training program for 35 Marines and Sailors which resulted in 5 achievement medals and the most promotions of any platoon in the battalion. \nMentored leaders of the local police and city council of Ubaydi, Iraq, resulting in increased communication among Iraqi community leaders.  \nLed the company’s head platoon for every company operation in Iraq and during pre-deployment training for Afghanistan. Recognized by the company commander as the company’s most accomplished platoon commander and promoted to 1st Lieutenant. Combat Engineer - Lance Corporal United States Marine Corps June 2006  –  June 2007  (1 year 1 month) 4th CEB, Company A (South Charleston, WV) Performed the duties of a full-time student while working 2 campus jobs and fulfilling monthly Marine Corps Reserve requirements. \nIdentified as high potential, future leader and selected for the Marine Corps Officer Candidate School following college graduation. Combat Engineer - Lance Corporal United States Marine Corps June 2006  –  June 2007  (1 year 1 month) 4th CEB, Company A (South Charleston, WV) Performed the duties of a full-time student while working 2 campus jobs and fulfilling monthly Marine Corps Reserve requirements. \nIdentified as high potential, future leader and selected for the Marine Corps Officer Candidate School following college graduation. Skills Excel PowerPoint Web Design basic Arabic basic Spanish Six Sigma Microsoft Excel Forecast X Logistics Project Management Process Improvement Microsoft Office Training Afghanistan Arabic Security Weapons Leadership Supply Chain Management Data Analysis Team Leadership Business Development Military Marketing Strategy Security Clearance Product Development Analysis Strategy Sales Management Program Management Government Operations Management Performance Management Team Building Budgets Supply Chain Inventory Management Cross-functional Team... Project Planning Leadership Development Sourcing Procurement Operational Planning Marketing Logistics Management Strategic Planning Military Operations Military Experience Supervisory Skills See 35+     See less Skills  Excel PowerPoint Web Design basic Arabic basic Spanish Six Sigma Microsoft Excel Forecast X Logistics Project Management Process Improvement Microsoft Office Training Afghanistan Arabic Security Weapons Leadership Supply Chain Management Data Analysis Team Leadership Business Development Military Marketing Strategy Security Clearance Product Development Analysis Strategy Sales Management Program Management Government Operations Management Performance Management Team Building Budgets Supply Chain Inventory Management Cross-functional Team... Project Planning Leadership Development Sourcing Procurement Operational Planning Marketing Logistics Management Strategic Planning Military Operations Military Experience Supervisory Skills See 35+     See less Excel PowerPoint Web Design basic Arabic basic Spanish Six Sigma Microsoft Excel Forecast X Logistics Project Management Process Improvement Microsoft Office Training Afghanistan Arabic Security Weapons Leadership Supply Chain Management Data Analysis Team Leadership Business Development Military Marketing Strategy Security Clearance Product Development Analysis Strategy Sales Management Program Management Government Operations Management Performance Management Team Building Budgets Supply Chain Inventory Management Cross-functional Team... Project Planning Leadership Development Sourcing Procurement Operational Planning Marketing Logistics Management Strategic Planning Military Operations Military Experience Supervisory Skills See 35+     See less Excel PowerPoint Web Design basic Arabic basic Spanish Six Sigma Microsoft Excel Forecast X Logistics Project Management Process Improvement Microsoft Office Training Afghanistan Arabic Security Weapons Leadership Supply Chain Management Data Analysis Team Leadership Business Development Military Marketing Strategy Security Clearance Product Development Analysis Strategy Sales Management Program Management Government Operations Management Performance Management Team Building Budgets Supply Chain Inventory Management Cross-functional Team... Project Planning Leadership Development Sourcing Procurement Operational Planning Marketing Logistics Management Strategic Planning Military Operations Military Experience Supervisory Skills See 35+     See less Education Michigan State University MBA,  Supply Chain Management 2012  – 2014 Ohio University BA,  Recreation Management ,  Business Administration 2003  – 2007 + Three years of Mechanical Engineering coursework Michigan State University MBA,  Supply Chain Management 2012  – 2014 Michigan State University MBA,  Supply Chain Management 2012  – 2014 Michigan State University MBA,  Supply Chain Management 2012  – 2014 Ohio University BA,  Recreation Management ,  Business Administration 2003  – 2007 + Three years of Mechanical Engineering coursework Ohio University BA,  Recreation Management ,  Business Administration 2003  – 2007 + Three years of Mechanical Engineering coursework Ohio University BA,  Recreation Management ,  Business Administration 2003  – 2007 + Three years of Mechanical Engineering coursework Honors & Awards Additional Honors & Awards Navy and Marine Corps Achievement Medal \nEagle Scout - BSA Additional Honors & Awards Navy and Marine Corps Achievement Medal \nEagle Scout - BSA Additional Honors & Awards Navy and Marine Corps Achievement Medal \nEagle Scout - BSA Additional Honors & Awards Navy and Marine Corps Achievement Medal \nEagle Scout - BSA ", "Skills Semiconductors Program Management Purchasing Supply Chain Management Supply Management Cross-functional Team... Procurement Manufacturing Process Engineering Project Management Employee Management Supplier Development Process Improvement Cost Benefit Business Operations Lean Manufacturing Virtual Teams Go-to-market Strategy CRM Performance Management SPC International Project... Supply Chain Management See 9+     See less Skills  Semiconductors Program Management Purchasing Supply Chain Management Supply Management Cross-functional Team... Procurement Manufacturing Process Engineering Project Management Employee Management Supplier Development Process Improvement Cost Benefit Business Operations Lean Manufacturing Virtual Teams Go-to-market Strategy CRM Performance Management SPC International Project... Supply Chain Management See 9+     See less Semiconductors Program Management Purchasing Supply Chain Management Supply Management Cross-functional Team... Procurement Manufacturing Process Engineering Project Management Employee Management Supplier Development Process Improvement Cost Benefit Business Operations Lean Manufacturing Virtual Teams Go-to-market Strategy CRM Performance Management SPC International Project... Supply Chain Management See 9+     See less Semiconductors Program Management Purchasing Supply Chain Management Supply Management Cross-functional Team... Procurement Manufacturing Process Engineering Project Management Employee Management Supplier Development Process Improvement Cost Benefit Business Operations Lean Manufacturing Virtual Teams Go-to-market Strategy CRM Performance Management SPC International Project... Supply Chain Management See 9+     See less ", "Experience Capital Capacity Manager Intel Corporation June 2015  – Present (3 months) Chandler, Arizona Student Barrett the Honors College at Arizona State University August 2011  –  May 2015  (3 years 10 months) Honors Creative Thesis: UCare: A Sophisticated Approach to Gaining Market Share in the e Grocery Industry \n Corporate Strategic Procurement Intern Intel Corporation May 2014  –  August 2014  (4 months) Chandler, Arizona Developed an internal, sustainable agency compensation benchmarking tool using Microsoft Excel with primary purpose of improving ROI \n \nResearched industry accepted agency remuneration models and recommended external benchmark options for group to pursue Supply Chain Management Intern Arizona Public Service May 2013  –  August 2013  (4 months) Led a project to standardize the competitive bidding process using a web-based interface, PowerAdvocate. Decreased bid preparation time from 2 days to 3 hours. \nDeveloped and delivered training seminars to implement the competitive bidding process site-wide.  \nCreated an Excel-based budgeting tool to more accurately forecast the inventory budget. Member Activities Team Member Life Time Fitness September 2010  –  December 2012  (2 years 4 months) Supervise use of the rock wall in order to maintain safety conditions for all climbers. \nAssist/instruct members on the proper use of equipment and rope climbing belay techniques. Provide instructional support to those who participate.; Greet and admit members into facility as to create an inviting atmosphere for members. \nAssist in the resolution of guest services issues over the phone and throughout the club. \nProcess club monthly membership payments and extra member expenses. Production Associate Pantheon Chemicals June 2011  –  August 2011  (3 months) Filled/labeled bottles with gun cleaning fluid. \nStaged/assembled/packaged gun cleaning kits to ensure that they are store-ready. Owner’s Assistant Glitzi Girlz Mobile Boutique May 2009  –  May 2010  (1 year 1 month) Capital Capacity Manager Intel Corporation June 2015  – Present (3 months) Chandler, Arizona Capital Capacity Manager Intel Corporation June 2015  – Present (3 months) Chandler, Arizona Student Barrett the Honors College at Arizona State University August 2011  –  May 2015  (3 years 10 months) Honors Creative Thesis: UCare: A Sophisticated Approach to Gaining Market Share in the e Grocery Industry \n Student Barrett the Honors College at Arizona State University August 2011  –  May 2015  (3 years 10 months) Honors Creative Thesis: UCare: A Sophisticated Approach to Gaining Market Share in the e Grocery Industry \n Corporate Strategic Procurement Intern Intel Corporation May 2014  –  August 2014  (4 months) Chandler, Arizona Developed an internal, sustainable agency compensation benchmarking tool using Microsoft Excel with primary purpose of improving ROI \n \nResearched industry accepted agency remuneration models and recommended external benchmark options for group to pursue Corporate Strategic Procurement Intern Intel Corporation May 2014  –  August 2014  (4 months) Chandler, Arizona Developed an internal, sustainable agency compensation benchmarking tool using Microsoft Excel with primary purpose of improving ROI \n \nResearched industry accepted agency remuneration models and recommended external benchmark options for group to pursue Supply Chain Management Intern Arizona Public Service May 2013  –  August 2013  (4 months) Led a project to standardize the competitive bidding process using a web-based interface, PowerAdvocate. Decreased bid preparation time from 2 days to 3 hours. \nDeveloped and delivered training seminars to implement the competitive bidding process site-wide.  \nCreated an Excel-based budgeting tool to more accurately forecast the inventory budget. Supply Chain Management Intern Arizona Public Service May 2013  –  August 2013  (4 months) Led a project to standardize the competitive bidding process using a web-based interface, PowerAdvocate. Decreased bid preparation time from 2 days to 3 hours. \nDeveloped and delivered training seminars to implement the competitive bidding process site-wide.  \nCreated an Excel-based budgeting tool to more accurately forecast the inventory budget. Member Activities Team Member Life Time Fitness September 2010  –  December 2012  (2 years 4 months) Supervise use of the rock wall in order to maintain safety conditions for all climbers. \nAssist/instruct members on the proper use of equipment and rope climbing belay techniques. Provide instructional support to those who participate.; Greet and admit members into facility as to create an inviting atmosphere for members. \nAssist in the resolution of guest services issues over the phone and throughout the club. \nProcess club monthly membership payments and extra member expenses. Member Activities Team Member Life Time Fitness September 2010  –  December 2012  (2 years 4 months) Supervise use of the rock wall in order to maintain safety conditions for all climbers. \nAssist/instruct members on the proper use of equipment and rope climbing belay techniques. Provide instructional support to those who participate.; Greet and admit members into facility as to create an inviting atmosphere for members. \nAssist in the resolution of guest services issues over the phone and throughout the club. \nProcess club monthly membership payments and extra member expenses. Production Associate Pantheon Chemicals June 2011  –  August 2011  (3 months) Filled/labeled bottles with gun cleaning fluid. \nStaged/assembled/packaged gun cleaning kits to ensure that they are store-ready. Production Associate Pantheon Chemicals June 2011  –  August 2011  (3 months) Filled/labeled bottles with gun cleaning fluid. \nStaged/assembled/packaged gun cleaning kits to ensure that they are store-ready. Owner’s Assistant Glitzi Girlz Mobile Boutique May 2009  –  May 2010  (1 year 1 month) Owner’s Assistant Glitzi Girlz Mobile Boutique May 2009  –  May 2010  (1 year 1 month) Skills Time Management Supply Chain Management Budgets Finance Facilities Management Customer Service Teamwork Leadership Skills  Time Management Supply Chain Management Budgets Finance Facilities Management Customer Service Teamwork Leadership Time Management Supply Chain Management Budgets Finance Facilities Management Customer Service Teamwork Leadership Time Management Supply Chain Management Budgets Finance Facilities Management Customer Service Teamwork Leadership Education W.P. Carey School of Business Bachelor's Degree,  Supply Chain Management and Finance , Senior 2011  – 2015 Double Major: Supply Chain Management and Finance Arizona State University – Barrett The Honors College W.P. Carey School of Business Bachelor's Degree,  Supply Chain Management and Finance , Senior 2011  – 2015 Double Major: Supply Chain Management and Finance W.P. Carey School of Business Bachelor's Degree,  Supply Chain Management and Finance , Senior 2011  – 2015 Double Major: Supply Chain Management and Finance W.P. Carey School of Business Bachelor's Degree,  Supply Chain Management and Finance , Senior 2011  – 2015 Double Major: Supply Chain Management and Finance Arizona State University – Barrett The Honors College Arizona State University – Barrett The Honors College Arizona State University – Barrett The Honors College ", "Experience Commodity Manager Intel Corporation June 2012  – Present (3 years 3 months) Phoenix, Arizona Area Capital Capacity Manager Intel Corporation August 2010  –  June 2012  (1 year 11 months) Phoenix, Arizona Area Career Preparation Mentor Brigham Young University-Idaho January 2009  –  August 2010  (1 year 8 months) Rexburg, Idaho General Manager Intern Zion Ponderosa Ranch Resort August 2009  –  December 2009  (5 months) Mount Carmel, Utah Commodity Manager Intel Corporation June 2012  – Present (3 years 3 months) Phoenix, Arizona Area Commodity Manager Intel Corporation June 2012  – Present (3 years 3 months) Phoenix, Arizona Area Capital Capacity Manager Intel Corporation August 2010  –  June 2012  (1 year 11 months) Phoenix, Arizona Area Capital Capacity Manager Intel Corporation August 2010  –  June 2012  (1 year 11 months) Phoenix, Arizona Area Career Preparation Mentor Brigham Young University-Idaho January 2009  –  August 2010  (1 year 8 months) Rexburg, Idaho Career Preparation Mentor Brigham Young University-Idaho January 2009  –  August 2010  (1 year 8 months) Rexburg, Idaho General Manager Intern Zion Ponderosa Ranch Resort August 2009  –  December 2009  (5 months) Mount Carmel, Utah General Manager Intern Zion Ponderosa Ranch Resort August 2009  –  December 2009  (5 months) Mount Carmel, Utah Languages English Native or bilingual proficiency Thai English Native or bilingual proficiency Thai English Native or bilingual proficiency Thai Native or bilingual proficiency Skills Supply Chain Management Leadership Training Management Purchasing Six Sigma Supply Chain Manufacturing Lean Manufacturing Inventory Management Process Improvement Materials Management Forecasting Cross-functional Team... Supply Management Production Planning Logistics Microsoft Office See 3+     See less Skills  Supply Chain Management Leadership Training Management Purchasing Six Sigma Supply Chain Manufacturing Lean Manufacturing Inventory Management Process Improvement Materials Management Forecasting Cross-functional Team... Supply Management Production Planning Logistics Microsoft Office See 3+     See less Supply Chain Management Leadership Training Management Purchasing Six Sigma Supply Chain Manufacturing Lean Manufacturing Inventory Management Process Improvement Materials Management Forecasting Cross-functional Team... Supply Management Production Planning Logistics Microsoft Office See 3+     See less Supply Chain Management Leadership Training Management Purchasing Six Sigma Supply Chain Manufacturing Lean Manufacturing Inventory Management Process Improvement Materials Management Forecasting Cross-functional Team... Supply Management Production Planning Logistics Microsoft Office See 3+     See less Education Brigham Young University - Idaho Bachelor of Science (B.S.),  Business Management; Emphasis in Supply Chain 2007  – 2010 Brigham Young University - Idaho Bachelor of Science (B.S.),  Business Management; Emphasis in Supply Chain 2007  – 2010 Brigham Young University - Idaho Bachelor of Science (B.S.),  Business Management; Emphasis in Supply Chain 2007  – 2010 Brigham Young University - Idaho Bachelor of Science (B.S.),  Business Management; Emphasis in Supply Chain 2007  – 2010 ", "Experience Commodity Manager Intel Corporation October 2012  – Present (2 years 11 months) Chandler, AZ Capital Capacity Manager Intel Corporation August 2011  –  October 2012  (1 year 3 months) Chandler, AZ Haz Mat International Logistics Specialist Rinchem February 2010  –  August 2011  (1 year 7 months) Chandler, AZ Assistant to Branch Manager HSBC Group Beijing Central Branch May 2002  –  August 2004  (2 years 4 months) Commodity Manager Intel Corporation October 2012  – Present (2 years 11 months) Chandler, AZ Commodity Manager Intel Corporation October 2012  – Present (2 years 11 months) Chandler, AZ Capital Capacity Manager Intel Corporation August 2011  –  October 2012  (1 year 3 months) Chandler, AZ Capital Capacity Manager Intel Corporation August 2011  –  October 2012  (1 year 3 months) Chandler, AZ Haz Mat International Logistics Specialist Rinchem February 2010  –  August 2011  (1 year 7 months) Chandler, AZ Haz Mat International Logistics Specialist Rinchem February 2010  –  August 2011  (1 year 7 months) Chandler, AZ Assistant to Branch Manager HSBC Group Beijing Central Branch May 2002  –  August 2004  (2 years 4 months) Assistant to Branch Manager HSBC Group Beijing Central Branch May 2002  –  August 2004  (2 years 4 months) Skills Supply Chain Management Operations Management Process Improvement Six Sigma Cross-functional Team... Forecasting Supply Chain Procurement Program Management Logistics Lean Manufacturing Continuous Improvement Project Management Contract Negotiation Inventory Management Negotiation Strategic Planning Contract Management SAP Team Building Management Manufacturing Analysis See 8+     See less Skills  Supply Chain Management Operations Management Process Improvement Six Sigma Cross-functional Team... Forecasting Supply Chain Procurement Program Management Logistics Lean Manufacturing Continuous Improvement Project Management Contract Negotiation Inventory Management Negotiation Strategic Planning Contract Management SAP Team Building Management Manufacturing Analysis See 8+     See less Supply Chain Management Operations Management Process Improvement Six Sigma Cross-functional Team... Forecasting Supply Chain Procurement Program Management Logistics Lean Manufacturing Continuous Improvement Project Management Contract Negotiation Inventory Management Negotiation Strategic Planning Contract Management SAP Team Building Management Manufacturing Analysis See 8+     See less Supply Chain Management Operations Management Process Improvement Six Sigma Cross-functional Team... Forecasting Supply Chain Procurement Program Management Logistics Lean Manufacturing Continuous Improvement Project Management Contract Negotiation Inventory Management Negotiation Strategic Planning Contract Management SAP Team Building Management Manufacturing Analysis See 8+     See less Education Arizona State University - W. P. Carey School of Business MBA,  MBA 2008  – 2010 Beijing International Studies University BA,  Business Administration and Management , General 1998  – 2002 Arizona State University - W. P. Carey School of Business MBA,  MBA 2008  – 2010 Arizona State University - W. P. Carey School of Business MBA,  MBA 2008  – 2010 Arizona State University - W. P. Carey School of Business MBA,  MBA 2008  – 2010 Beijing International Studies University BA,  Business Administration and Management , General 1998  – 2002 Beijing International Studies University BA,  Business Administration and Management , General 1998  – 2002 Beijing International Studies University BA,  Business Administration and Management , General 1998  – 2002 ", "Summary Common misspellings: Winn Jones, Wyn Jones, Win Jones, Summary Common misspellings: Winn Jones, Wyn Jones, Win Jones, Common misspellings: Winn Jones, Wyn Jones, Win Jones, Common misspellings: Winn Jones, Wyn Jones, Win Jones, Experience Capital Capacity Manager Intel Corporation June 2015  – Present (3 months) Chandler, Arizona MBA Intern- Global Supply Management Intel Corporation May 2014  –  August 2014  (4 months) Chandler, AZ •\t$1.8M cost avoidance through an innovative training solution using existing equipment in lieu of new purchase \n•\tCreated a labor vs. production database sourced from separate business units to identify trends across factories \n•\tSynthesized a supplier cost model to find opportunities for in-sourcing equipment maintenance services \n•\tReplaced employee on leave as lead training liaison between all Intel factories & an Intel core supplier \n•\tNegotiated training requirements & fees to ensure efficacy & utilization of supplier-provided instruction Senior Procurement Agent Richmond American Homes February 2012  –  August 2013  (1 year 7 months) Greater Salt Lake City Area Qualified, assembled, dissected, & negotiated subcontractor bids for new subdivisions \n•\tSaved $1.2M annually by reducing average house cost with vendor negotiations & manufacturer agreements \n•\tManaged 130,000 active item costs in Oracle ERP system resulting in more accurate budgets & expenditures \n•\tRegulated costs on a $30M+ annual purchasing budget \n•\tNegotiated new contracts with over 60 subcontractors in 30+ communities to build 360 homes Field Operations Manager Kiewit April 2008  –  February 2012  (3 years 11 months) American Fork, Utah Managed costs, schedules, quality, safety, & subcontracts for earthwork operations on the $230M Mountain View Corridor freeway project \n•\t$3.6M saved through creation of cost/benefit analyses that optimized crew sizes & types \n•\tManaged costs of up to $85,000/day \n•\tMaximized profit & beat operational budgets by an average of 18% \n•\t$20M forecasted using production schedules, current costs, & future estimates \n•\tTrained salaried peers in new cost estimating methods & technologies leading to over $1.7B in estimated work Volunteer Representative The Church of Jesus Christ of Latter-day Saints May 2004  –  June 2006  (2 years 2 months) Arequipa, Peru •\tTrained & led 80+ peers responsible for field operations in 4 regions of southern Peru \n•\tConversational in Spanish (speak, read, write) \n•\tAnalyzed & adapted team’s field strategies in 13 cities based on tracked leading indicators \n. Capital Capacity Manager Intel Corporation June 2015  – Present (3 months) Chandler, Arizona Capital Capacity Manager Intel Corporation June 2015  – Present (3 months) Chandler, Arizona MBA Intern- Global Supply Management Intel Corporation May 2014  –  August 2014  (4 months) Chandler, AZ •\t$1.8M cost avoidance through an innovative training solution using existing equipment in lieu of new purchase \n•\tCreated a labor vs. production database sourced from separate business units to identify trends across factories \n•\tSynthesized a supplier cost model to find opportunities for in-sourcing equipment maintenance services \n•\tReplaced employee on leave as lead training liaison between all Intel factories & an Intel core supplier \n•\tNegotiated training requirements & fees to ensure efficacy & utilization of supplier-provided instruction MBA Intern- Global Supply Management Intel Corporation May 2014  –  August 2014  (4 months) Chandler, AZ •\t$1.8M cost avoidance through an innovative training solution using existing equipment in lieu of new purchase \n•\tCreated a labor vs. production database sourced from separate business units to identify trends across factories \n•\tSynthesized a supplier cost model to find opportunities for in-sourcing equipment maintenance services \n•\tReplaced employee on leave as lead training liaison between all Intel factories & an Intel core supplier \n•\tNegotiated training requirements & fees to ensure efficacy & utilization of supplier-provided instruction Senior Procurement Agent Richmond American Homes February 2012  –  August 2013  (1 year 7 months) Greater Salt Lake City Area Qualified, assembled, dissected, & negotiated subcontractor bids for new subdivisions \n•\tSaved $1.2M annually by reducing average house cost with vendor negotiations & manufacturer agreements \n•\tManaged 130,000 active item costs in Oracle ERP system resulting in more accurate budgets & expenditures \n•\tRegulated costs on a $30M+ annual purchasing budget \n•\tNegotiated new contracts with over 60 subcontractors in 30+ communities to build 360 homes Senior Procurement Agent Richmond American Homes February 2012  –  August 2013  (1 year 7 months) Greater Salt Lake City Area Qualified, assembled, dissected, & negotiated subcontractor bids for new subdivisions \n•\tSaved $1.2M annually by reducing average house cost with vendor negotiations & manufacturer agreements \n•\tManaged 130,000 active item costs in Oracle ERP system resulting in more accurate budgets & expenditures \n•\tRegulated costs on a $30M+ annual purchasing budget \n•\tNegotiated new contracts with over 60 subcontractors in 30+ communities to build 360 homes Field Operations Manager Kiewit April 2008  –  February 2012  (3 years 11 months) American Fork, Utah Managed costs, schedules, quality, safety, & subcontracts for earthwork operations on the $230M Mountain View Corridor freeway project \n•\t$3.6M saved through creation of cost/benefit analyses that optimized crew sizes & types \n•\tManaged costs of up to $85,000/day \n•\tMaximized profit & beat operational budgets by an average of 18% \n•\t$20M forecasted using production schedules, current costs, & future estimates \n•\tTrained salaried peers in new cost estimating methods & technologies leading to over $1.7B in estimated work Field Operations Manager Kiewit April 2008  –  February 2012  (3 years 11 months) American Fork, Utah Managed costs, schedules, quality, safety, & subcontracts for earthwork operations on the $230M Mountain View Corridor freeway project \n•\t$3.6M saved through creation of cost/benefit analyses that optimized crew sizes & types \n•\tManaged costs of up to $85,000/day \n•\tMaximized profit & beat operational budgets by an average of 18% \n•\t$20M forecasted using production schedules, current costs, & future estimates \n•\tTrained salaried peers in new cost estimating methods & technologies leading to over $1.7B in estimated work Volunteer Representative The Church of Jesus Christ of Latter-day Saints May 2004  –  June 2006  (2 years 2 months) Arequipa, Peru •\tTrained & led 80+ peers responsible for field operations in 4 regions of southern Peru \n•\tConversational in Spanish (speak, read, write) \n•\tAnalyzed & adapted team’s field strategies in 13 cities based on tracked leading indicators \n. Volunteer Representative The Church of Jesus Christ of Latter-day Saints May 2004  –  June 2006  (2 years 2 months) Arequipa, Peru •\tTrained & led 80+ peers responsible for field operations in 4 regions of southern Peru \n•\tConversational in Spanish (speak, read, write) \n•\tAnalyzed & adapted team’s field strategies in 13 cities based on tracked leading indicators \n. Languages Spanish Spanish Spanish Skills Subcontracting Change Orders Construction Management Budgets Microsoft Excel Autodesk Software JDE Enterprise One Value Engineering Process Scheduler Goal-driven leader Contract Management Integrity CPM Scheduling Goal Oriented Project Estimation Operations Management Project Bidding Procurement Purchasing Process Improvement Supplier Negotiation Data Analysis Construction See 8+     See less Skills  Subcontracting Change Orders Construction Management Budgets Microsoft Excel Autodesk Software JDE Enterprise One Value Engineering Process Scheduler Goal-driven leader Contract Management Integrity CPM Scheduling Goal Oriented Project Estimation Operations Management Project Bidding Procurement Purchasing Process Improvement Supplier Negotiation Data Analysis Construction See 8+     See less Subcontracting Change Orders Construction Management Budgets Microsoft Excel Autodesk Software JDE Enterprise One Value Engineering Process Scheduler Goal-driven leader Contract Management Integrity CPM Scheduling Goal Oriented Project Estimation Operations Management Project Bidding Procurement Purchasing Process Improvement Supplier Negotiation Data Analysis Construction See 8+     See less Subcontracting Change Orders Construction Management Budgets Microsoft Excel Autodesk Software JDE Enterprise One Value Engineering Process Scheduler Goal-driven leader Contract Management Integrity CPM Scheduling Goal Oriented Project Estimation Operations Management Project Bidding Procurement Purchasing Process Improvement Supplier Negotiation Data Analysis Construction See 8+     See less Education Brigham Young University Master of Business Administration (M.B.A.),  Supply Chain Management 2013  – 2015 •\tRanked in Top 10% of Class (3.83 GPA)  \n•\t700 GMAT score (Top 1% verbal score) \n•\tSelected by program leadership as lead career mentor for Supply Chain students \n•\tInterviewed, selected, trained, & led other Supply Chain career mentors \n•\tIncreased training abilities as Graduate Assistant of Strategic Logistics Management course \n•\tRecipient of the Dean’s, Victor, & Huckvale Scholarships based on merit & potential \n•\tEarned Global Management Certificate (specialized courses & business study abroad) Activities and Societies:  Member of the BYU Graduate Supply Chain Management Association. BYU-Idaho Bachelor's degree,  Construction Management ,  Business Management , 3.97 2003  – 2009 •\tGraduated Magna Cum Laude (Top 5% of class) Activities and Societies:  Member of Architecture and Construction Management Society Brigham Young University Master of Business Administration (M.B.A.),  Supply Chain Management 2013  – 2015 •\tRanked in Top 10% of Class (3.83 GPA)  \n•\t700 GMAT score (Top 1% verbal score) \n•\tSelected by program leadership as lead career mentor for Supply Chain students \n•\tInterviewed, selected, trained, & led other Supply Chain career mentors \n•\tIncreased training abilities as Graduate Assistant of Strategic Logistics Management course \n•\tRecipient of the Dean’s, Victor, & Huckvale Scholarships based on merit & potential \n•\tEarned Global Management Certificate (specialized courses & business study abroad) Activities and Societies:  Member of the BYU Graduate Supply Chain Management Association. Brigham Young University Master of Business Administration (M.B.A.),  Supply Chain Management 2013  – 2015 •\tRanked in Top 10% of Class (3.83 GPA)  \n•\t700 GMAT score (Top 1% verbal score) \n•\tSelected by program leadership as lead career mentor for Supply Chain students \n•\tInterviewed, selected, trained, & led other Supply Chain career mentors \n•\tIncreased training abilities as Graduate Assistant of Strategic Logistics Management course \n•\tRecipient of the Dean’s, Victor, & Huckvale Scholarships based on merit & potential \n•\tEarned Global Management Certificate (specialized courses & business study abroad) Activities and Societies:  Member of the BYU Graduate Supply Chain Management Association. Brigham Young University Master of Business Administration (M.B.A.),  Supply Chain Management 2013  – 2015 •\tRanked in Top 10% of Class (3.83 GPA)  \n•\t700 GMAT score (Top 1% verbal score) \n•\tSelected by program leadership as lead career mentor for Supply Chain students \n•\tInterviewed, selected, trained, & led other Supply Chain career mentors \n•\tIncreased training abilities as Graduate Assistant of Strategic Logistics Management course \n•\tRecipient of the Dean’s, Victor, & Huckvale Scholarships based on merit & potential \n•\tEarned Global Management Certificate (specialized courses & business study abroad) Activities and Societies:  Member of the BYU Graduate Supply Chain Management Association. BYU-Idaho Bachelor's degree,  Construction Management ,  Business Management , 3.97 2003  – 2009 •\tGraduated Magna Cum Laude (Top 5% of class) Activities and Societies:  Member of Architecture and Construction Management Society BYU-Idaho Bachelor's degree,  Construction Management ,  Business Management , 3.97 2003  – 2009 •\tGraduated Magna Cum Laude (Top 5% of class) Activities and Societies:  Member of Architecture and Construction Management Society BYU-Idaho Bachelor's degree,  Construction Management ,  Business Management , 3.97 2003  – 2009 •\tGraduated Magna Cum Laude (Top 5% of class) Activities and Societies:  Member of Architecture and Construction Management Society Honors & Awards ", "Experience Commodity Manager Intel Corporation August 2012  – Present (3 years 1 month) Capital Capacity Manager Intel Corporation June 2011  –  August 2012  (1 year 3 months) Chandler, AZ Sr. Buyer - Powertrain Components General Motors May 2010  –  May 2011  (1 year 1 month) Sr. Industrial Engineer General Motors January 1999  –  April 2010  (11 years 4 months) Commodity Manager Intel Corporation August 2012  – Present (3 years 1 month) Commodity Manager Intel Corporation August 2012  – Present (3 years 1 month) Capital Capacity Manager Intel Corporation June 2011  –  August 2012  (1 year 3 months) Chandler, AZ Capital Capacity Manager Intel Corporation June 2011  –  August 2012  (1 year 3 months) Chandler, AZ Sr. Buyer - Powertrain Components General Motors May 2010  –  May 2011  (1 year 1 month) Sr. Buyer - Powertrain Components General Motors May 2010  –  May 2011  (1 year 1 month) Sr. Industrial Engineer General Motors January 1999  –  April 2010  (11 years 4 months) Sr. Industrial Engineer General Motors January 1999  –  April 2010  (11 years 4 months) Skills Purchasing MS Project Lean Manufacturing SPC Cross-functional Team... Supply Management Change Management Manufacturing FMEA Global Sourcing Process Improvement Project Management Continuous Improvement Six Sigma Automotive Supply Chain Management Supply Chain Process Engineering 5S Root Cause Analysis Kaizen Engineering See 7+     See less Skills  Purchasing MS Project Lean Manufacturing SPC Cross-functional Team... Supply Management Change Management Manufacturing FMEA Global Sourcing Process Improvement Project Management Continuous Improvement Six Sigma Automotive Supply Chain Management Supply Chain Process Engineering 5S Root Cause Analysis Kaizen Engineering See 7+     See less Purchasing MS Project Lean Manufacturing SPC Cross-functional Team... Supply Management Change Management Manufacturing FMEA Global Sourcing Process Improvement Project Management Continuous Improvement Six Sigma Automotive Supply Chain Management Supply Chain Process Engineering 5S Root Cause Analysis Kaizen Engineering See 7+     See less Purchasing MS Project Lean Manufacturing SPC Cross-functional Team... Supply Management Change Management Manufacturing FMEA Global Sourcing Process Improvement Project Management Continuous Improvement Six Sigma Automotive Supply Chain Management Supply Chain Process Engineering 5S Root Cause Analysis Kaizen Engineering See 7+     See less Education Michigan State University - The Eli Broad Graduate School of Management MBA 2009  – 2011 Wayne State University M.S,  Industrial/Manufacturing Engineering 1997  – 1998 Vasavi College of Engineering B.S,  Production Engineering 1992  – 1996 Michigan State University - The Eli Broad Graduate School of Management MBA 2009  – 2011 Michigan State University - The Eli Broad Graduate School of Management MBA 2009  – 2011 Michigan State University - The Eli Broad Graduate School of Management MBA 2009  – 2011 Wayne State University M.S,  Industrial/Manufacturing Engineering 1997  – 1998 Wayne State University M.S,  Industrial/Manufacturing Engineering 1997  – 1998 Wayne State University M.S,  Industrial/Manufacturing Engineering 1997  – 1998 Vasavi College of Engineering B.S,  Production Engineering 1992  – 1996 Vasavi College of Engineering B.S,  Production Engineering 1992  – 1996 Vasavi College of Engineering B.S,  Production Engineering 1992  – 1996 ", "Experience Commodity Manager Intel Corporation June 2009  –  July 2015  (6 years 2 months) Phoenix, Arizona Area Capital Capacity Manager Intel Corporation March 2006  –  June 2009  (3 years 4 months) Phoenix, Arizona Area Logistics Supervisor Intel Corporation April 2001  –  February 2006  (4 years 11 months) Phoenix, Arizona Area Logistics Analyst Intel Corporation September 2000  –  March 2001  (7 months) Phoenix, Arizona Area Production Planner Varian, Inc. 1997  –  2000  (3 years) Phoenix, Arizona Area Commodity Manager Intel Corporation June 2009  –  July 2015  (6 years 2 months) Phoenix, Arizona Area Commodity Manager Intel Corporation June 2009  –  July 2015  (6 years 2 months) Phoenix, Arizona Area Capital Capacity Manager Intel Corporation March 2006  –  June 2009  (3 years 4 months) Phoenix, Arizona Area Capital Capacity Manager Intel Corporation March 2006  –  June 2009  (3 years 4 months) Phoenix, Arizona Area Logistics Supervisor Intel Corporation April 2001  –  February 2006  (4 years 11 months) Phoenix, Arizona Area Logistics Supervisor Intel Corporation April 2001  –  February 2006  (4 years 11 months) Phoenix, Arizona Area Logistics Analyst Intel Corporation September 2000  –  March 2001  (7 months) Phoenix, Arizona Area Logistics Analyst Intel Corporation September 2000  –  March 2001  (7 months) Phoenix, Arizona Area Production Planner Varian, Inc. 1997  –  2000  (3 years) Phoenix, Arizona Area Production Planner Varian, Inc. 1997  –  2000  (3 years) Phoenix, Arizona Area Languages English English English Skills Supply Management Supply Chain Management Contract Negotiation Negotiation Cross-functional Team... Supply Chain Customer Service Program Management Skills  Supply Management Supply Chain Management Contract Negotiation Negotiation Cross-functional Team... Supply Chain Customer Service Program Management Supply Management Supply Chain Management Contract Negotiation Negotiation Cross-functional Team... Supply Chain Customer Service Program Management Supply Management Supply Chain Management Contract Negotiation Negotiation Cross-functional Team... Supply Chain Customer Service Program Management Education Arizona State University Bachelor of science business management,  Business Administration and Management , General 1992  – 1996 Activities and Societies:  Delta Sigma Pi Arizona State University Bachelor of science business management,  Business Administration and Management , General 1992  – 1996 Activities and Societies:  Delta Sigma Pi Arizona State University Bachelor of science business management,  Business Administration and Management , General 1992  – 1996 Activities and Societies:  Delta Sigma Pi Arizona State University Bachelor of science business management,  Business Administration and Management , General 1992  – 1996 Activities and Societies:  Delta Sigma Pi ", "Experience Global Supply Manager Apple April 2014  – Present (1 year 5 months) San Francisco Bay Area Capital Equipment Commodity Manager Intel Corporation March 2012  –  March 2014  (2 years 1 month) Phoenix, Arizona Area Capital Capacity Manager Intel Corporation July 2011  –  March 2012  (9 months) Chandler, AZ MBA Intern Intel Corporation May 2010  –  August 2010  (4 months) Santa Clara, CA Developed a financial model to forecast and analyze the lithography tool market and its impact on Intel's $1B+ annual purchases. Market Research Analyst Fox Systems November 2007  –  August 2009  (1 year 10 months) Global Supply Manager Apple April 2014  – Present (1 year 5 months) San Francisco Bay Area Global Supply Manager Apple April 2014  – Present (1 year 5 months) San Francisco Bay Area Capital Equipment Commodity Manager Intel Corporation March 2012  –  March 2014  (2 years 1 month) Phoenix, Arizona Area Capital Equipment Commodity Manager Intel Corporation March 2012  –  March 2014  (2 years 1 month) Phoenix, Arizona Area Capital Capacity Manager Intel Corporation July 2011  –  March 2012  (9 months) Chandler, AZ Capital Capacity Manager Intel Corporation July 2011  –  March 2012  (9 months) Chandler, AZ MBA Intern Intel Corporation May 2010  –  August 2010  (4 months) Santa Clara, CA Developed a financial model to forecast and analyze the lithography tool market and its impact on Intel's $1B+ annual purchases. MBA Intern Intel Corporation May 2010  –  August 2010  (4 months) Santa Clara, CA Developed a financial model to forecast and analyze the lithography tool market and its impact on Intel's $1B+ annual purchases. Market Research Analyst Fox Systems November 2007  –  August 2009  (1 year 10 months) Market Research Analyst Fox Systems November 2007  –  August 2009  (1 year 10 months) Skills Financial Modeling Analysis Market Research Cross-functional Team... Marketing Research Strategy Competitive Analysis Process Improvement Product Management Data Analysis Business Strategy Project Management Leadership Management Program Management Skills  Financial Modeling Analysis Market Research Cross-functional Team... Marketing Research Strategy Competitive Analysis Process Improvement Product Management Data Analysis Business Strategy Project Management Leadership Management Program Management Financial Modeling Analysis Market Research Cross-functional Team... Marketing Research Strategy Competitive Analysis Process Improvement Product Management Data Analysis Business Strategy Project Management Leadership Management Program Management Financial Modeling Analysis Market Research Cross-functional Team... Marketing Research Strategy Competitive Analysis Process Improvement Product Management Data Analysis Business Strategy Project Management Leadership Management Program Management Education Brigham Young University MBA,  Business Management 2009  – 2011 Brigham Young University Bachelor of Science (B.S.),  Political Science and Government 2001  – 2007 Brigham Young University MBA,  Business Management 2009  – 2011 Brigham Young University MBA,  Business Management 2009  – 2011 Brigham Young University MBA,  Business Management 2009  – 2011 Brigham Young University Bachelor of Science (B.S.),  Political Science and Government 2001  – 2007 Brigham Young University Bachelor of Science (B.S.),  Political Science and Government 2001  – 2007 Brigham Young University Bachelor of Science (B.S.),  Political Science and Government 2001  – 2007 ", "Summary Supply Chain Analyst with a passion for: \n \n-Process improvement & supply chain optimization \n-Project management  \n-Supplier development and relationship-management \n-Cross-organizational collaboration-continued learning about partnering organizations  \n-Recruiting and university partnerships Summary Supply Chain Analyst with a passion for: \n \n-Process improvement & supply chain optimization \n-Project management  \n-Supplier development and relationship-management \n-Cross-organizational collaboration-continued learning about partnering organizations  \n-Recruiting and university partnerships Supply Chain Analyst with a passion for: \n \n-Process improvement & supply chain optimization \n-Project management  \n-Supplier development and relationship-management \n-Cross-organizational collaboration-continued learning about partnering organizations  \n-Recruiting and university partnerships Supply Chain Analyst with a passion for: \n \n-Process improvement & supply chain optimization \n-Project management  \n-Supplier development and relationship-management \n-Cross-organizational collaboration-continued learning about partnering organizations  \n-Recruiting and university partnerships Experience GSM Capital Capacity Manager Intel Corporation May 2012  – Present (3 years 4 months) Phoenix, Arizona Area Supply Line Management Procurement Project Manager: Supporting internal procurement enhancement programs as SLM business process owner. Provides input and direction on future-state business processes/system designs. Responsible for entire life-cycle of procurement problem/solution with delegation and collaboration with stakeholders as needed. Ensures new requirements meet the needs of the Supply Line Management group, while working seamlessly with all upstream and downstream procurement applications and business groups.  \n \nSupply Line Management Capital Capacity Manager: Coordinates purchasing activities with manufacturing and engineering departments to acquire materials, components, equipment, and services in a cost effective and timely manner in support of the Global Supply Management group at Intel. Owns the equipment purchase life cycle including Forecast, Order, Delivery, and receipt of capital equipment within Intel's factories worldwide.  \n \nResponsibilities Include: - Providing accurate capital and assembly test equipment forecasts and POs to suppliers - Understanding and managing equipment dock dates on POs - Responding to Intel's forecast - Escalating equipment capacity issues for resolution with suppliers and sites - Holding suppliers accountable for on time delivery of equipment - Managing factory equipment acceptance process and resolving supplier payment issues - Maintaining SAP* procurement system with accurate info (pricing, lead-time, and/or and others) - Managing equipment allocations and reuse conversion kit orders within VF - Monitoring shipment and delivery of reuse tools among Intel's sites - Creating indicators and/or reports to track success in meeting sites, required dock dates and negotiate equipment upgrades and/or conversions - Acting as key interface for factory Site Capacity Program Managers on capacity management activity Audit Intern Heinfeld Meech & Co September 2010  –  October 2010  (2 months) Assisted in audit engagements by entering financial data, updating prior year schedules, and assisted in the final production and quality control of audit reports by completing final-footing process.  \n \nWorked one-on-one with audit clients during fieldwork, and performed various analytics for audit engagements to determine validity of provided client data, and compliance with state regulations. GSM Capital Capacity Manager Intel Corporation May 2012  – Present (3 years 4 months) Phoenix, Arizona Area Supply Line Management Procurement Project Manager: Supporting internal procurement enhancement programs as SLM business process owner. Provides input and direction on future-state business processes/system designs. Responsible for entire life-cycle of procurement problem/solution with delegation and collaboration with stakeholders as needed. Ensures new requirements meet the needs of the Supply Line Management group, while working seamlessly with all upstream and downstream procurement applications and business groups.  \n \nSupply Line Management Capital Capacity Manager: Coordinates purchasing activities with manufacturing and engineering departments to acquire materials, components, equipment, and services in a cost effective and timely manner in support of the Global Supply Management group at Intel. Owns the equipment purchase life cycle including Forecast, Order, Delivery, and receipt of capital equipment within Intel's factories worldwide.  \n \nResponsibilities Include: - Providing accurate capital and assembly test equipment forecasts and POs to suppliers - Understanding and managing equipment dock dates on POs - Responding to Intel's forecast - Escalating equipment capacity issues for resolution with suppliers and sites - Holding suppliers accountable for on time delivery of equipment - Managing factory equipment acceptance process and resolving supplier payment issues - Maintaining SAP* procurement system with accurate info (pricing, lead-time, and/or and others) - Managing equipment allocations and reuse conversion kit orders within VF - Monitoring shipment and delivery of reuse tools among Intel's sites - Creating indicators and/or reports to track success in meeting sites, required dock dates and negotiate equipment upgrades and/or conversions - Acting as key interface for factory Site Capacity Program Managers on capacity management activity GSM Capital Capacity Manager Intel Corporation May 2012  – Present (3 years 4 months) Phoenix, Arizona Area Supply Line Management Procurement Project Manager: Supporting internal procurement enhancement programs as SLM business process owner. Provides input and direction on future-state business processes/system designs. Responsible for entire life-cycle of procurement problem/solution with delegation and collaboration with stakeholders as needed. Ensures new requirements meet the needs of the Supply Line Management group, while working seamlessly with all upstream and downstream procurement applications and business groups.  \n \nSupply Line Management Capital Capacity Manager: Coordinates purchasing activities with manufacturing and engineering departments to acquire materials, components, equipment, and services in a cost effective and timely manner in support of the Global Supply Management group at Intel. Owns the equipment purchase life cycle including Forecast, Order, Delivery, and receipt of capital equipment within Intel's factories worldwide.  \n \nResponsibilities Include: - Providing accurate capital and assembly test equipment forecasts and POs to suppliers - Understanding and managing equipment dock dates on POs - Responding to Intel's forecast - Escalating equipment capacity issues for resolution with suppliers and sites - Holding suppliers accountable for on time delivery of equipment - Managing factory equipment acceptance process and resolving supplier payment issues - Maintaining SAP* procurement system with accurate info (pricing, lead-time, and/or and others) - Managing equipment allocations and reuse conversion kit orders within VF - Monitoring shipment and delivery of reuse tools among Intel's sites - Creating indicators and/or reports to track success in meeting sites, required dock dates and negotiate equipment upgrades and/or conversions - Acting as key interface for factory Site Capacity Program Managers on capacity management activity Audit Intern Heinfeld Meech & Co September 2010  –  October 2010  (2 months) Assisted in audit engagements by entering financial data, updating prior year schedules, and assisted in the final production and quality control of audit reports by completing final-footing process.  \n \nWorked one-on-one with audit clients during fieldwork, and performed various analytics for audit engagements to determine validity of provided client data, and compliance with state regulations. Audit Intern Heinfeld Meech & Co September 2010  –  October 2010  (2 months) Assisted in audit engagements by entering financial data, updating prior year schedules, and assisted in the final production and quality control of audit reports by completing final-footing process.  \n \nWorked one-on-one with audit clients during fieldwork, and performed various analytics for audit engagements to determine validity of provided client data, and compliance with state regulations. Languages   Skills Supply Management Process Improvement Project Management Project Planning Lean Thinking Team Leadership Purchasing Forecasting SAP Supply Chain... Quality Management Supply Chain Management Logistics Procurement Customer Service Data Analysis Stakeholder Management Business Development Supplier Quality... Affordability Supplier Management Supplier Relationship... Recruiting College Recruiting Cross-functional Team... Supply Chain Leadership Continuous Improvement Analysis See 14+     See less Skills  Supply Management Process Improvement Project Management Project Planning Lean Thinking Team Leadership Purchasing Forecasting SAP Supply Chain... Quality Management Supply Chain Management Logistics Procurement Customer Service Data Analysis Stakeholder Management Business Development Supplier Quality... Affordability Supplier Management Supplier Relationship... Recruiting College Recruiting Cross-functional Team... Supply Chain Leadership Continuous Improvement Analysis See 14+     See less Supply Management Process Improvement Project Management Project Planning Lean Thinking Team Leadership Purchasing Forecasting SAP Supply Chain... Quality Management Supply Chain Management Logistics Procurement Customer Service Data Analysis Stakeholder Management Business Development Supplier Quality... Affordability Supplier Management Supplier Relationship... Recruiting College Recruiting Cross-functional Team... Supply Chain Leadership Continuous Improvement Analysis See 14+     See less Supply Management Process Improvement Project Management Project Planning Lean Thinking Team Leadership Purchasing Forecasting SAP Supply Chain... Quality Management Supply Chain Management Logistics Procurement Customer Service Data Analysis Stakeholder Management Business Development Supplier Quality... Affordability Supplier Management Supplier Relationship... Recruiting College Recruiting Cross-functional Team... Supply Chain Leadership Continuous Improvement Analysis See 14+     See less Education Arizona State University Bachelor of Science (B.S.),  Logistics , Materials, and Supply Chain Management 2008  – 2012 Activities and Societies:  Supply Chain Management Association Arizona State University, W. P. Carey School of Business Bachelor of Science,  Supply Chain Management 2008  – 2012 •Logistics Management, Quality Management & Measurement, Supply Management, Planning & Control Systems \n \n-2nd Place in Target® Spring 2011 Case Study Competition:  \nParticipated in Target’s Case Study competition focusing on logistical process-improvement for their seasonal in-store transitions. Team placed second out of approximately twenty-eight groups. Successfully carried out role as project manager by: \n•\tConstructing a hypothesis for the given problem and proposing a solution. \n•\tDesigning and building a quantitative model used to test the hypothesis and support the solution, by using Excel and Visio to analyze current and future states for Target’s backlog planning in their distribution centers. Activities and Societies:  Supply Chain Management Association Arizona State University Bachelor of Science (B.S.),  Logistics , Materials, and Supply Chain Management 2008  – 2012 Activities and Societies:  Supply Chain Management Association Arizona State University Bachelor of Science (B.S.),  Logistics , Materials, and Supply Chain Management 2008  – 2012 Activities and Societies:  Supply Chain Management Association Arizona State University Bachelor of Science (B.S.),  Logistics , Materials, and Supply Chain Management 2008  – 2012 Activities and Societies:  Supply Chain Management Association Arizona State University, W. P. Carey School of Business Bachelor of Science,  Supply Chain Management 2008  – 2012 •Logistics Management, Quality Management & Measurement, Supply Management, Planning & Control Systems \n \n-2nd Place in Target® Spring 2011 Case Study Competition:  \nParticipated in Target’s Case Study competition focusing on logistical process-improvement for their seasonal in-store transitions. Team placed second out of approximately twenty-eight groups. Successfully carried out role as project manager by: \n•\tConstructing a hypothesis for the given problem and proposing a solution. \n•\tDesigning and building a quantitative model used to test the hypothesis and support the solution, by using Excel and Visio to analyze current and future states for Target’s backlog planning in their distribution centers. Activities and Societies:  Supply Chain Management Association Arizona State University, W. P. Carey School of Business Bachelor of Science,  Supply Chain Management 2008  – 2012 •Logistics Management, Quality Management & Measurement, Supply Management, Planning & Control Systems \n \n-2nd Place in Target® Spring 2011 Case Study Competition:  \nParticipated in Target’s Case Study competition focusing on logistical process-improvement for their seasonal in-store transitions. Team placed second out of approximately twenty-eight groups. Successfully carried out role as project manager by: \n•\tConstructing a hypothesis for the given problem and proposing a solution. \n•\tDesigning and building a quantitative model used to test the hypothesis and support the solution, by using Excel and Visio to analyze current and future states for Target’s backlog planning in their distribution centers. Activities and Societies:  Supply Chain Management Association Arizona State University, W. P. Carey School of Business Bachelor of Science,  Supply Chain Management 2008  – 2012 •Logistics Management, Quality Management & Measurement, Supply Management, Planning & Control Systems \n \n-2nd Place in Target® Spring 2011 Case Study Competition:  \nParticipated in Target’s Case Study competition focusing on logistical process-improvement for their seasonal in-store transitions. Team placed second out of approximately twenty-eight groups. Successfully carried out role as project manager by: \n•\tConstructing a hypothesis for the given problem and proposing a solution. \n•\tDesigning and building a quantitative model used to test the hypothesis and support the solution, by using Excel and Visio to analyze current and future states for Target’s backlog planning in their distribution centers. Activities and Societies:  Supply Chain Management Association Honors & Awards Additional Honors & Awards 2nd Place in Target Corporation's 2011 Case Study Competition. Additional Honors & Awards 2nd Place in Target Corporation's 2011 Case Study Competition. Additional Honors & Awards 2nd Place in Target Corporation's 2011 Case Study Competition. Additional Honors & Awards 2nd Place in Target Corporation's 2011 Case Study Competition. ", "Summary Six sigma certification From Arizona State University  \nNovember 2011 - April 2012 Summary Six sigma certification From Arizona State University  \nNovember 2011 - April 2012 Six sigma certification From Arizona State University  \nNovember 2011 - April 2012 Six sigma certification From Arizona State University  \nNovember 2011 - April 2012 Experience SLM Capital Capacity Manager Intel Corporation June 2014  – Present (1 year 3 months) EWC Intern Intel Corporation May 2013  –  August 2013  (4 months) Arizona Store Operations Manager Interior Fabrics October 2004  –  December 2012  (8 years 3 months) Scottsdale •\tLead a lean Six Sigma project to reduce errors and speed up a shipping process in the company UPS order system. Using DMAIC guideline, define and measure waste and a current process and improve errors and shipping delays by 80%. \n•\tExecute necessary measures for recruiting, training and coordinating store personnel. \n•\tSystemize inventory control and store displays including store layout and remodeling. \n•\tFormulate weekly and monthly sales and end of the month sales tax. \n•\tMaximize profits by 50 % by adjusting our costs and creating prices for new products and sale items. \n•\tInitiate new prices for specialty items and expand sale products resulting in more than 25 % increase in average price and in turn raise higher profit margins. \n•\tDevelop payroll/schedule coordination to reduce labor costs by 20%. \n•\tImplement energy efficiency effort to reduce utility and operational costs by 15 % to 20 %. Lead store to accomplish 100% score or better on secret shopper test every month. \n•\tGain/Negotiate exclusive right to purchase and sell products. Realtor Century 21 May 2007  –  January 2011  (3 years 9 months) Tempe,AZ •\tExecuted listing and purchase contracts. \n•\tPerformed communication and negotiating skills on a daily basis. \n•\tPrepared documents such as purchase contracts, listing agreements, and broker agreements. \n•\tInterviewed clients to determine and to understand their needs. \n•\tGenerated lists of properties for buyers and analyze comparable properties for sellers. \n•\tCoordinated property closings, overseeing signing of documents, and disbursement of funds. \n•\tFormulated Market analysis and promoted real estate properties. Operations Management Sambhali International January 2007  –  January 2008  (1 year 1 month) Tempe,AZ •\tImproved customer service and established vendor relationships from satisfactory to excellent via president review. \n•\tConsulted with project manager to execute improvements in the areas of quality control, supply management, cost and delivery management, and other operational costs. \n•\tPlanned operational processes and templates for the creation of vendor purchase orders. Assistant Produce Manager IGA November 2001  –  May 2003  (1 year 7 months) Tempe AZ •Track order history, inventory control, forecast and estimate purchase/sale figures and shrinkage control \n•Good communication skills with customers and co workers \n•Responsible for setting product displays  \n•Cashier service SLM Capital Capacity Manager Intel Corporation June 2014  – Present (1 year 3 months) SLM Capital Capacity Manager Intel Corporation June 2014  – Present (1 year 3 months) EWC Intern Intel Corporation May 2013  –  August 2013  (4 months) Arizona EWC Intern Intel Corporation May 2013  –  August 2013  (4 months) Arizona Store Operations Manager Interior Fabrics October 2004  –  December 2012  (8 years 3 months) Scottsdale •\tLead a lean Six Sigma project to reduce errors and speed up a shipping process in the company UPS order system. Using DMAIC guideline, define and measure waste and a current process and improve errors and shipping delays by 80%. \n•\tExecute necessary measures for recruiting, training and coordinating store personnel. \n•\tSystemize inventory control and store displays including store layout and remodeling. \n•\tFormulate weekly and monthly sales and end of the month sales tax. \n•\tMaximize profits by 50 % by adjusting our costs and creating prices for new products and sale items. \n•\tInitiate new prices for specialty items and expand sale products resulting in more than 25 % increase in average price and in turn raise higher profit margins. \n•\tDevelop payroll/schedule coordination to reduce labor costs by 20%. \n•\tImplement energy efficiency effort to reduce utility and operational costs by 15 % to 20 %. Lead store to accomplish 100% score or better on secret shopper test every month. \n•\tGain/Negotiate exclusive right to purchase and sell products. Store Operations Manager Interior Fabrics October 2004  –  December 2012  (8 years 3 months) Scottsdale •\tLead a lean Six Sigma project to reduce errors and speed up a shipping process in the company UPS order system. Using DMAIC guideline, define and measure waste and a current process and improve errors and shipping delays by 80%. \n•\tExecute necessary measures for recruiting, training and coordinating store personnel. \n•\tSystemize inventory control and store displays including store layout and remodeling. \n•\tFormulate weekly and monthly sales and end of the month sales tax. \n•\tMaximize profits by 50 % by adjusting our costs and creating prices for new products and sale items. \n•\tInitiate new prices for specialty items and expand sale products resulting in more than 25 % increase in average price and in turn raise higher profit margins. \n•\tDevelop payroll/schedule coordination to reduce labor costs by 20%. \n•\tImplement energy efficiency effort to reduce utility and operational costs by 15 % to 20 %. Lead store to accomplish 100% score or better on secret shopper test every month. \n•\tGain/Negotiate exclusive right to purchase and sell products. Realtor Century 21 May 2007  –  January 2011  (3 years 9 months) Tempe,AZ •\tExecuted listing and purchase contracts. \n•\tPerformed communication and negotiating skills on a daily basis. \n•\tPrepared documents such as purchase contracts, listing agreements, and broker agreements. \n•\tInterviewed clients to determine and to understand their needs. \n•\tGenerated lists of properties for buyers and analyze comparable properties for sellers. \n•\tCoordinated property closings, overseeing signing of documents, and disbursement of funds. \n•\tFormulated Market analysis and promoted real estate properties. Realtor Century 21 May 2007  –  January 2011  (3 years 9 months) Tempe,AZ •\tExecuted listing and purchase contracts. \n•\tPerformed communication and negotiating skills on a daily basis. \n•\tPrepared documents such as purchase contracts, listing agreements, and broker agreements. \n•\tInterviewed clients to determine and to understand their needs. \n•\tGenerated lists of properties for buyers and analyze comparable properties for sellers. \n•\tCoordinated property closings, overseeing signing of documents, and disbursement of funds. \n•\tFormulated Market analysis and promoted real estate properties. Operations Management Sambhali International January 2007  –  January 2008  (1 year 1 month) Tempe,AZ •\tImproved customer service and established vendor relationships from satisfactory to excellent via president review. \n•\tConsulted with project manager to execute improvements in the areas of quality control, supply management, cost and delivery management, and other operational costs. \n•\tPlanned operational processes and templates for the creation of vendor purchase orders. Operations Management Sambhali International January 2007  –  January 2008  (1 year 1 month) Tempe,AZ •\tImproved customer service and established vendor relationships from satisfactory to excellent via president review. \n•\tConsulted with project manager to execute improvements in the areas of quality control, supply management, cost and delivery management, and other operational costs. \n•\tPlanned operational processes and templates for the creation of vendor purchase orders. Assistant Produce Manager IGA November 2001  –  May 2003  (1 year 7 months) Tempe AZ •Track order history, inventory control, forecast and estimate purchase/sale figures and shrinkage control \n•Good communication skills with customers and co workers \n•Responsible for setting product displays  \n•Cashier service Assistant Produce Manager IGA November 2001  –  May 2003  (1 year 7 months) Tempe AZ •Track order history, inventory control, forecast and estimate purchase/sale figures and shrinkage control \n•Good communication skills with customers and co workers \n•Responsible for setting product displays  \n•Cashier service Languages Korean Korean Korean Skills Analysis Six Sigma Operations Management Process Improvement Project Management Change Management Negotiation Customer Service Sales Human Resources Training Inventory Management Team Building Lean Manufacturing Leadership Microsoft Excel Management See 2+     See less Skills  Analysis Six Sigma Operations Management Process Improvement Project Management Change Management Negotiation Customer Service Sales Human Resources Training Inventory Management Team Building Lean Manufacturing Leadership Microsoft Excel Management See 2+     See less Analysis Six Sigma Operations Management Process Improvement Project Management Change Management Negotiation Customer Service Sales Human Resources Training Inventory Management Team Building Lean Manufacturing Leadership Microsoft Excel Management See 2+     See less Analysis Six Sigma Operations Management Process Improvement Project Management Change Management Negotiation Customer Service Sales Human Resources Training Inventory Management Team Building Lean Manufacturing Leadership Microsoft Excel Management See 2+     See less Education Arizona State University, W. P. Carey School of Business Master of Business Administration (M.B.A.),  Logistics , Materials, and Supply Chain Management 2012  – 2014 Arizona State University Professional certification,  Six sigma Greenbelt , A 2011  – 2012 Arizona State University BFA,  Computer graphics Activities and Societies:  Instructor at a martial art club at Arizona State University. University of Advancing Technology Associate,  Computer animation Arizona State University, W. P. Carey School of Business Master of Business Administration (M.B.A.),  Logistics , Materials, and Supply Chain Management 2012  – 2014 Arizona State University, W. P. Carey School of Business Master of Business Administration (M.B.A.),  Logistics , Materials, and Supply Chain Management 2012  – 2014 Arizona State University, W. P. Carey School of Business Master of Business Administration (M.B.A.),  Logistics , Materials, and Supply Chain Management 2012  – 2014 Arizona State University Professional certification,  Six sigma Greenbelt , A 2011  – 2012 Arizona State University Professional certification,  Six sigma Greenbelt , A 2011  – 2012 Arizona State University Professional certification,  Six sigma Greenbelt , A 2011  – 2012 Arizona State University BFA,  Computer graphics Activities and Societies:  Instructor at a martial art club at Arizona State University. Arizona State University BFA,  Computer graphics Activities and Societies:  Instructor at a martial art club at Arizona State University. Arizona State University BFA,  Computer graphics Activities and Societies:  Instructor at a martial art club at Arizona State University. University of Advancing Technology Associate,  Computer animation University of Advancing Technology Associate,  Computer animation University of Advancing Technology Associate,  Computer animation Honors & Awards Additional Honors & Awards Customer service award \nOutstanding performance award Additional Honors & Awards Customer service award \nOutstanding performance award Additional Honors & Awards Customer service award \nOutstanding performance award Additional Honors & Awards Customer service award \nOutstanding performance award ", "Experience Commodity Manager Intel Corporation October 2014  – Present (11 months) Capital Capacity Manager Intel Corporation June 2013  –  September 2014  (1 year 4 months) Chandler, AZ Capital Project Manager Honeywell Aerospace February 2012  –  May 2013  (1 year 4 months) Engineering Test Services • Managed portfolio of over 300 critical Honeywell Engineering capital projects while maintaining >95% spend forecast accuracy by maintaining strict discipline in organization, adherence to self-created best practices, and attention to detail \n• Designed, vetted, and implemented new, streamlined management operating system for Commercial Off-The-Shelf capital purchases enabling reintegration of portfolio among Capital Management team, eliminating need for a dedicated project manager to those projects Product Engineer Honeywell Aerospace July 2009  –  January 2012  (2 years 7 months) Tempe Product Center •\tInitiate and manage Entanglement projects to reduce cost and cycle time for high volume product with ROI of 5+:1. \n•\tPCPX - Lead cell-level process capability projects using Process Mapping, PFMEA and Control Plans to reduce and mitigate quality escapes and identify and address areas of high risk among multiple product lines. \n•\tMentored and coached intern through summer of 2011. Established goals and accountability to create successful and productive internship. \n•\tC07 Cell Transformation – managed team implementing best practice HOS principles improving 5S, product quality, and productivity of cell. Implemented flow line, streamlined production process, optimized cell design. Potential Lean Expert project. \n•\tPreliminary Review Board – manage and disposition internal non-conforming hardware, investigate and implement improvements at supplier using in-depth knowledge of RCCA. \n•\tLead weekly cell Corrective Action Board meetings to status cell RAIL items, share quality improvement ideas. \n•\tIdentify opportunities for improvement through analysis of cell product performance metrics such as cycle time, FPY, TPY and COPQ. Product Quality Engineer Honeywell Aerospace January 2009  –  June 2009  (6 months) Deer Valley •\tIdentified chronic failures in Displays and RF factories and developed actions to increase yield by 10% \n•\tTook leadership in Quality Improvement Team meetings to address finding root cause in customer returns Manufacturing Engineer Honeywell Aerospace July 2008  –  December 2008  (6 months) Engines Product Center •\tCreated entire assembly process and manufacturing instructions for a new propulsion engine gearbox \n•\tMeasured and designed complete tooling kit in CATIA V5 for assembly and testing of gearbox Continuous Improvement Co-op Pratt & Whitney February 2007  –  August 2007  (7 months) East Hartford •\tCreated and populated TPM Visual Factory Boards used as information centers for each machine. \n•\tCreated Value Stream Maps for entire Business Unit including all part numbers processed through department. \n•\tCreated Standard Work for processes and utilized Standard Work Combination Sheets. Commodity Manager Intel Corporation October 2014  – Present (11 months) Commodity Manager Intel Corporation October 2014  – Present (11 months) Capital Capacity Manager Intel Corporation June 2013  –  September 2014  (1 year 4 months) Chandler, AZ Capital Capacity Manager Intel Corporation June 2013  –  September 2014  (1 year 4 months) Chandler, AZ Capital Project Manager Honeywell Aerospace February 2012  –  May 2013  (1 year 4 months) Engineering Test Services • Managed portfolio of over 300 critical Honeywell Engineering capital projects while maintaining >95% spend forecast accuracy by maintaining strict discipline in organization, adherence to self-created best practices, and attention to detail \n• Designed, vetted, and implemented new, streamlined management operating system for Commercial Off-The-Shelf capital purchases enabling reintegration of portfolio among Capital Management team, eliminating need for a dedicated project manager to those projects Capital Project Manager Honeywell Aerospace February 2012  –  May 2013  (1 year 4 months) Engineering Test Services • Managed portfolio of over 300 critical Honeywell Engineering capital projects while maintaining >95% spend forecast accuracy by maintaining strict discipline in organization, adherence to self-created best practices, and attention to detail \n• Designed, vetted, and implemented new, streamlined management operating system for Commercial Off-The-Shelf capital purchases enabling reintegration of portfolio among Capital Management team, eliminating need for a dedicated project manager to those projects Product Engineer Honeywell Aerospace July 2009  –  January 2012  (2 years 7 months) Tempe Product Center •\tInitiate and manage Entanglement projects to reduce cost and cycle time for high volume product with ROI of 5+:1. \n•\tPCPX - Lead cell-level process capability projects using Process Mapping, PFMEA and Control Plans to reduce and mitigate quality escapes and identify and address areas of high risk among multiple product lines. \n•\tMentored and coached intern through summer of 2011. Established goals and accountability to create successful and productive internship. \n•\tC07 Cell Transformation – managed team implementing best practice HOS principles improving 5S, product quality, and productivity of cell. Implemented flow line, streamlined production process, optimized cell design. Potential Lean Expert project. \n•\tPreliminary Review Board – manage and disposition internal non-conforming hardware, investigate and implement improvements at supplier using in-depth knowledge of RCCA. \n•\tLead weekly cell Corrective Action Board meetings to status cell RAIL items, share quality improvement ideas. \n•\tIdentify opportunities for improvement through analysis of cell product performance metrics such as cycle time, FPY, TPY and COPQ. Product Engineer Honeywell Aerospace July 2009  –  January 2012  (2 years 7 months) Tempe Product Center •\tInitiate and manage Entanglement projects to reduce cost and cycle time for high volume product with ROI of 5+:1. \n•\tPCPX - Lead cell-level process capability projects using Process Mapping, PFMEA and Control Plans to reduce and mitigate quality escapes and identify and address areas of high risk among multiple product lines. \n•\tMentored and coached intern through summer of 2011. Established goals and accountability to create successful and productive internship. \n•\tC07 Cell Transformation – managed team implementing best practice HOS principles improving 5S, product quality, and productivity of cell. Implemented flow line, streamlined production process, optimized cell design. Potential Lean Expert project. \n•\tPreliminary Review Board – manage and disposition internal non-conforming hardware, investigate and implement improvements at supplier using in-depth knowledge of RCCA. \n•\tLead weekly cell Corrective Action Board meetings to status cell RAIL items, share quality improvement ideas. \n•\tIdentify opportunities for improvement through analysis of cell product performance metrics such as cycle time, FPY, TPY and COPQ. Product Quality Engineer Honeywell Aerospace January 2009  –  June 2009  (6 months) Deer Valley •\tIdentified chronic failures in Displays and RF factories and developed actions to increase yield by 10% \n•\tTook leadership in Quality Improvement Team meetings to address finding root cause in customer returns Product Quality Engineer Honeywell Aerospace January 2009  –  June 2009  (6 months) Deer Valley •\tIdentified chronic failures in Displays and RF factories and developed actions to increase yield by 10% \n•\tTook leadership in Quality Improvement Team meetings to address finding root cause in customer returns Manufacturing Engineer Honeywell Aerospace July 2008  –  December 2008  (6 months) Engines Product Center •\tCreated entire assembly process and manufacturing instructions for a new propulsion engine gearbox \n•\tMeasured and designed complete tooling kit in CATIA V5 for assembly and testing of gearbox Manufacturing Engineer Honeywell Aerospace July 2008  –  December 2008  (6 months) Engines Product Center •\tCreated entire assembly process and manufacturing instructions for a new propulsion engine gearbox \n•\tMeasured and designed complete tooling kit in CATIA V5 for assembly and testing of gearbox Continuous Improvement Co-op Pratt & Whitney February 2007  –  August 2007  (7 months) East Hartford •\tCreated and populated TPM Visual Factory Boards used as information centers for each machine. \n•\tCreated Value Stream Maps for entire Business Unit including all part numbers processed through department. \n•\tCreated Standard Work for processes and utilized Standard Work Combination Sheets. Continuous Improvement Co-op Pratt & Whitney February 2007  –  August 2007  (7 months) East Hartford •\tCreated and populated TPM Visual Factory Boards used as information centers for each machine. \n•\tCreated Value Stream Maps for entire Business Unit including all part numbers processed through department. \n•\tCreated Standard Work for processes and utilized Standard Work Combination Sheets. Skills Six Sigma Continuous Improvement 5S Lean Manufacturing Manufacturing... Aerospace Project Management Tooling Design GD&T Process Engineering Capital Budgeting Financial Statement... Engineering Supply Chain Management Skills  Six Sigma Continuous Improvement 5S Lean Manufacturing Manufacturing... Aerospace Project Management Tooling Design GD&T Process Engineering Capital Budgeting Financial Statement... Engineering Supply Chain Management Six Sigma Continuous Improvement 5S Lean Manufacturing Manufacturing... Aerospace Project Management Tooling Design GD&T Process Engineering Capital Budgeting Financial Statement... Engineering Supply Chain Management Six Sigma Continuous Improvement 5S Lean Manufacturing Manufacturing... Aerospace Project Management Tooling Design GD&T Process Engineering Capital Budgeting Financial Statement... Engineering Supply Chain Management Education Arizona State University Masters,  Business Administration 2011  – 2013 Michigan State University Bachelor's Degree,  Applied Engineering Sciences 2003  – 2008 Supply Chain Management Cognate Activities and Societies:  Michigan State University Spartans Baseball Arizona State University Masters,  Business Administration 2011  – 2013 Arizona State University Masters,  Business Administration 2011  – 2013 Arizona State University Masters,  Business Administration 2011  – 2013 Michigan State University Bachelor's Degree,  Applied Engineering Sciences 2003  – 2008 Supply Chain Management Cognate Activities and Societies:  Michigan State University Spartans Baseball Michigan State University Bachelor's Degree,  Applied Engineering Sciences 2003  – 2008 Supply Chain Management Cognate Activities and Societies:  Michigan State University Spartans Baseball Michigan State University Bachelor's Degree,  Applied Engineering Sciences 2003  – 2008 Supply Chain Management Cognate Activities and Societies:  Michigan State University Spartans Baseball ", "Experience Comodity Manager Intel Corp June 2009  – Present (6 years 3 months) Capital Capacity Manager Intel Corporation March 2006  –  June 2009  (3 years 4 months) Logistics Supervisor Intel April 2001  –  February 2006  (4 years 11 months) Logistics Analyst Intel September 2000  –  March 2001  (7 months) Production Planner Varian Electronics Manufacturer 1997  –  2000  (3 years) Comodity Manager Intel Corp June 2009  – Present (6 years 3 months) Comodity Manager Intel Corp June 2009  – Present (6 years 3 months) Capital Capacity Manager Intel Corporation March 2006  –  June 2009  (3 years 4 months) Capital Capacity Manager Intel Corporation March 2006  –  June 2009  (3 years 4 months) Logistics Supervisor Intel April 2001  –  February 2006  (4 years 11 months) Logistics Supervisor Intel April 2001  –  February 2006  (4 years 11 months) Logistics Analyst Intel September 2000  –  March 2001  (7 months) Logistics Analyst Intel September 2000  –  March 2001  (7 months) Production Planner Varian Electronics Manufacturer 1997  –  2000  (3 years) Production Planner Varian Electronics Manufacturer 1997  –  2000  (3 years) Skills Logistics Supply Chain Supply Management Strategic Sourcing Supply Chain Management Skills  Logistics Supply Chain Supply Management Strategic Sourcing Supply Chain Management Logistics Supply Chain Supply Management Strategic Sourcing Supply Chain Management Logistics Supply Chain Supply Management Strategic Sourcing Supply Chain Management Education Arizona State University BS,  Business Management 1992  – 1996 Arizona State University BS,  Business Management 1992  – 1996 Arizona State University BS,  Business Management 1992  – 1996 Arizona State University BS,  Business Management 1992  – 1996 ", "Summary Specialties:Supply Chain Operations and Logistics Summary Specialties:Supply Chain Operations and Logistics Specialties:Supply Chain Operations and Logistics Specialties:Supply Chain Operations and Logistics Experience Capital Capacity Manager Intel Corporation November 2014  – Present (10 months) Chandler, AZ Upstream Market Intelligence Specialist - Logistics BP June 2013  –  October 2014  (1 year 5 months) Houston, Texas Area - Constructed should-cost models, providing cost transparency and negotiation leverage, $3.5M yearly savings.  \n- Analyzed global market sector strategies, aligning strategy to capitalize most effectively on supply and demand dynamics.  \n- Automated global supplier financial health analysis, reducing staffing requirements by one full time analyst. MBA Candidate 2013 Michigan State University July 2011  –  May 2013  (1 year 11 months) East Lansing, MI Lead Associate Fleet Operations Intern AT&T May 2012  –  August 2012  (4 months) Greater St. Louis Area - Executed purchase vs. lease analysis for new vehicle acquisition strategy, $2.6M annual savings. \n- Developed cost avoidance model to capture warranty eligible events, $250K annual savings.  \n- Engineered process redesign for title management resulting in significant cycle time reduction for asset disposition and title transfer. Rental Manager Penske Truck Leasing July 2010  –  August 2011  (1 year 2 months) - Completed software implementation and in-house training improving labor efficiency by 50% \n- Revamped customer communication and proper forecasting to increase on-time delivery from 75% to 95% \n- Spearheaded process redesign reducing staff needs by 50% Operations Manager Dixon Brothers Painting August 2004  –  December 2008  (4 years 5 months) - Designed inventory control system, reduced on-hand inventory by $500,000 \n- Collaborated with senior executives to revamp multi-site operations, introduced separation of duties, removed duplicate functions, and reduced labor by 20% \n- Redesigned procurement process, increased profitability by 10% Capital Capacity Manager Intel Corporation November 2014  – Present (10 months) Chandler, AZ Capital Capacity Manager Intel Corporation November 2014  – Present (10 months) Chandler, AZ Upstream Market Intelligence Specialist - Logistics BP June 2013  –  October 2014  (1 year 5 months) Houston, Texas Area - Constructed should-cost models, providing cost transparency and negotiation leverage, $3.5M yearly savings.  \n- Analyzed global market sector strategies, aligning strategy to capitalize most effectively on supply and demand dynamics.  \n- Automated global supplier financial health analysis, reducing staffing requirements by one full time analyst. Upstream Market Intelligence Specialist - Logistics BP June 2013  –  October 2014  (1 year 5 months) Houston, Texas Area - Constructed should-cost models, providing cost transparency and negotiation leverage, $3.5M yearly savings.  \n- Analyzed global market sector strategies, aligning strategy to capitalize most effectively on supply and demand dynamics.  \n- Automated global supplier financial health analysis, reducing staffing requirements by one full time analyst. MBA Candidate 2013 Michigan State University July 2011  –  May 2013  (1 year 11 months) East Lansing, MI MBA Candidate 2013 Michigan State University July 2011  –  May 2013  (1 year 11 months) East Lansing, MI Lead Associate Fleet Operations Intern AT&T May 2012  –  August 2012  (4 months) Greater St. Louis Area - Executed purchase vs. lease analysis for new vehicle acquisition strategy, $2.6M annual savings. \n- Developed cost avoidance model to capture warranty eligible events, $250K annual savings.  \n- Engineered process redesign for title management resulting in significant cycle time reduction for asset disposition and title transfer. Lead Associate Fleet Operations Intern AT&T May 2012  –  August 2012  (4 months) Greater St. Louis Area - Executed purchase vs. lease analysis for new vehicle acquisition strategy, $2.6M annual savings. \n- Developed cost avoidance model to capture warranty eligible events, $250K annual savings.  \n- Engineered process redesign for title management resulting in significant cycle time reduction for asset disposition and title transfer. Rental Manager Penske Truck Leasing July 2010  –  August 2011  (1 year 2 months) - Completed software implementation and in-house training improving labor efficiency by 50% \n- Revamped customer communication and proper forecasting to increase on-time delivery from 75% to 95% \n- Spearheaded process redesign reducing staff needs by 50% Rental Manager Penske Truck Leasing July 2010  –  August 2011  (1 year 2 months) - Completed software implementation and in-house training improving labor efficiency by 50% \n- Revamped customer communication and proper forecasting to increase on-time delivery from 75% to 95% \n- Spearheaded process redesign reducing staff needs by 50% Operations Manager Dixon Brothers Painting August 2004  –  December 2008  (4 years 5 months) - Designed inventory control system, reduced on-hand inventory by $500,000 \n- Collaborated with senior executives to revamp multi-site operations, introduced separation of duties, removed duplicate functions, and reduced labor by 20% \n- Redesigned procurement process, increased profitability by 10% Operations Manager Dixon Brothers Painting August 2004  –  December 2008  (4 years 5 months) - Designed inventory control system, reduced on-hand inventory by $500,000 \n- Collaborated with senior executives to revamp multi-site operations, introduced separation of duties, removed duplicate functions, and reduced labor by 20% \n- Redesigned procurement process, increased profitability by 10% Languages Spanish Spanish Spanish Skills Logistics Excel Forecasting Process Improvement Procurement Data Analysis Financial Analysis Leadership Supply Chain Management Sales Management Customer Service Inventory Control SAP Microsoft Excel Marketing Training Cross-functional Team... Product Development Analysis Inventory Management Supply Chain Operations Management Six Sigma Negotiation Strategic Planning Contract Negotiation Team Building PowerPoint Team Leadership Mergers & Acquisitions Teamwork Budgets Project Planning Business Planning Access Project Management Strategic Sourcing Strategy Market Research Microsoft Office Program Management Business Process... Continuous Improvement See 29+     See less Skills  Logistics Excel Forecasting Process Improvement Procurement Data Analysis Financial Analysis Leadership Supply Chain Management Sales Management Customer Service Inventory Control SAP Microsoft Excel Marketing Training Cross-functional Team... Product Development Analysis Inventory Management Supply Chain Operations Management Six Sigma Negotiation Strategic Planning Contract Negotiation Team Building PowerPoint Team Leadership Mergers & Acquisitions Teamwork Budgets Project Planning Business Planning Access Project Management Strategic Sourcing Strategy Market Research Microsoft Office Program Management Business Process... Continuous Improvement See 29+     See less Logistics Excel Forecasting Process Improvement Procurement Data Analysis Financial Analysis Leadership Supply Chain Management Sales Management Customer Service Inventory Control SAP Microsoft Excel Marketing Training Cross-functional Team... Product Development Analysis Inventory Management Supply Chain Operations Management Six Sigma Negotiation Strategic Planning Contract Negotiation Team Building PowerPoint Team Leadership Mergers & Acquisitions Teamwork Budgets Project Planning Business Planning Access Project Management Strategic Sourcing Strategy Market Research Microsoft Office Program Management Business Process... Continuous Improvement See 29+     See less Logistics Excel Forecasting Process Improvement Procurement Data Analysis Financial Analysis Leadership Supply Chain Management Sales Management Customer Service Inventory Control SAP Microsoft Excel Marketing Training Cross-functional Team... Product Development Analysis Inventory Management Supply Chain Operations Management Six Sigma Negotiation Strategic Planning Contract Negotiation Team Building PowerPoint Team Leadership Mergers & Acquisitions Teamwork Budgets Project Planning Business Planning Access Project Management Strategic Sourcing Strategy Market Research Microsoft Office Program Management Business Process... Continuous Improvement See 29+     See less Education Michigan State University Master of Business Administration (MBA),  Logistics , Materials, and Supply Chain Management 2011  – 2013 Activities and Societies:  MBAA ,  Graduate Supply Chain Management Association Michigan State University - The Eli Broad Graduate School of Management Master of Business Administration (MBA),  Logistics , Materials, and Supply Chain Management 2011  – 2013 Activities and Societies:  MBAA Arizona State University, W. P. Carey School of Business BS,  Accounting 2000  – 2006 Activities and Societies:  - Accounting Honors Society\n- Dean's List - 4 years Michigan State University Master of Business Administration (MBA),  Logistics , Materials, and Supply Chain Management 2011  – 2013 Activities and Societies:  MBAA ,  Graduate Supply Chain Management Association Michigan State University Master of Business Administration (MBA),  Logistics , Materials, and Supply Chain Management 2011  – 2013 Activities and Societies:  MBAA ,  Graduate Supply Chain Management Association Michigan State University Master of Business Administration (MBA),  Logistics , Materials, and Supply Chain Management 2011  – 2013 Activities and Societies:  MBAA ,  Graduate Supply Chain Management Association Michigan State University - The Eli Broad Graduate School of Management Master of Business Administration (MBA),  Logistics , Materials, and Supply Chain Management 2011  – 2013 Activities and Societies:  MBAA Michigan State University - The Eli Broad Graduate School of Management Master of Business Administration (MBA),  Logistics , Materials, and Supply Chain Management 2011  – 2013 Activities and Societies:  MBAA Michigan State University - The Eli Broad Graduate School of Management Master of Business Administration (MBA),  Logistics , Materials, and Supply Chain Management 2011  – 2013 Activities and Societies:  MBAA Arizona State University, W. P. Carey School of Business BS,  Accounting 2000  – 2006 Activities and Societies:  - Accounting Honors Society\n- Dean's List - 4 years Arizona State University, W. P. Carey School of Business BS,  Accounting 2000  – 2006 Activities and Societies:  - Accounting Honors Society\n- Dean's List - 4 years Arizona State University, W. P. Carey School of Business BS,  Accounting 2000  – 2006 Activities and Societies:  - Accounting Honors Society\n- Dean's List - 4 years ", "Summary I am an Operations Research Engineer interested in data-based decision making through optimization and mathematical modeling. I also have experience with capacity modeling and analysis through the application of Industrial Engineering in the manufacturing industry. \n \nSkills: Excel Solver, VBA, OPL, GAMS, SAP, SQL-Server, JMP, MATLAB, LINGO, Maple, Arena \n \nLean Six Sigma Green Belt Certified Summary I am an Operations Research Engineer interested in data-based decision making through optimization and mathematical modeling. I also have experience with capacity modeling and analysis through the application of Industrial Engineering in the manufacturing industry. \n \nSkills: Excel Solver, VBA, OPL, GAMS, SAP, SQL-Server, JMP, MATLAB, LINGO, Maple, Arena \n \nLean Six Sigma Green Belt Certified I am an Operations Research Engineer interested in data-based decision making through optimization and mathematical modeling. I also have experience with capacity modeling and analysis through the application of Industrial Engineering in the manufacturing industry. \n \nSkills: Excel Solver, VBA, OPL, GAMS, SAP, SQL-Server, JMP, MATLAB, LINGO, Maple, Arena \n \nLean Six Sigma Green Belt Certified I am an Operations Research Engineer interested in data-based decision making through optimization and mathematical modeling. I also have experience with capacity modeling and analysis through the application of Industrial Engineering in the manufacturing industry. \n \nSkills: Excel Solver, VBA, OPL, GAMS, SAP, SQL-Server, JMP, MATLAB, LINGO, Maple, Arena \n \nLean Six Sigma Green Belt Certified Experience Algorithm Expert Quintiq October 2014  – Present (11 months) Radnor, PA Develop and deliver optimization algorithms and models in object-oriented programming language for Supply Chain and Optimization applications. \n \n Industrial Engineer Intel Corporation July 2011  – Present (4 years 2 months) Phoenix, AZ Work cross-functionally to develop, validate, and implement optimization models that drive strategic decisions required to ensure successful new tool and new product implementation \n \nCoordinate, generate, and publish long-range capital tool forecasts which are utilized by VPs to set budget and supplier strategies for Intel’s entire back-end manufacturing division \n \nConduct detailed “What-If” analyses to identify multi-million dollar cost mitigation opportunities \n \nImplemented continuous improvement projects that have reduced business process cycle times by more than 50% Capital Capacity Manager Intel Corporation July 2010  –  July 2011  (1 year 1 month) Phoenix, AZ Independently managed hundreds of high-value capital Purchase Orders supporting Intel’s complex supply chain \n \nDeveloped effective documentation and management strategies for new supplier setup and multi-million dollar Purchase Orders for new, unique toolsets that supported a novel, high-profile Pilot Line \n \nEarned Six Sigma Green Belt certification by analyzing the order process for a unique supplier, eliminating 50% of the process steps and saving 330 hours per year Teaching Assistant Penn State University January 2009  –  May 2010  (1 year 5 months) University Park, PA Provide assistance for a Process Quality Engineering undergraduate class by grading homework and exams, in addition to developing and conducting labs throughout each semester. Line Speed Analyst ConAgra Foods May 2009  –  August 2009  (4 months) Lewisburg, PA Took initiative to lead a chokepoint analysis using line speed analysis techniques to highlight areas for improvement \nGained exposure to operations, management, and manufacturing in the food industry Research Assistant Virginia Commonwealth University May 2008  –  August 2008  (4 months) Richmond, VA Co-author: McLay, L. A., Lloyd, J. D., Niman, E. (2011). Interdicting Nuclear Material on Cargo Containers using Knapsack Problem Models. Annals of Operations Research, 187 (1) 185-205 \n \nUtilized Excel Solver and MATLAB to analyze and improve nuclear material detection strategies to ensure port security BioBIKE Programmer and Editor Bioengineering and Bioinformatics Summer Institute (BBSI) May 2006  –  August 2006  (4 months) Richmond, VA Worked independently and with a team on a biology programming language in a productive, deadline-driven environment \nUsed HTML to program, edit, and test the site architecture and navigation of a web-based biology application Algorithm Expert Quintiq October 2014  – Present (11 months) Radnor, PA Develop and deliver optimization algorithms and models in object-oriented programming language for Supply Chain and Optimization applications. \n \n Algorithm Expert Quintiq October 2014  – Present (11 months) Radnor, PA Develop and deliver optimization algorithms and models in object-oriented programming language for Supply Chain and Optimization applications. \n \n Industrial Engineer Intel Corporation July 2011  – Present (4 years 2 months) Phoenix, AZ Work cross-functionally to develop, validate, and implement optimization models that drive strategic decisions required to ensure successful new tool and new product implementation \n \nCoordinate, generate, and publish long-range capital tool forecasts which are utilized by VPs to set budget and supplier strategies for Intel’s entire back-end manufacturing division \n \nConduct detailed “What-If” analyses to identify multi-million dollar cost mitigation opportunities \n \nImplemented continuous improvement projects that have reduced business process cycle times by more than 50% Industrial Engineer Intel Corporation July 2011  – Present (4 years 2 months) Phoenix, AZ Work cross-functionally to develop, validate, and implement optimization models that drive strategic decisions required to ensure successful new tool and new product implementation \n \nCoordinate, generate, and publish long-range capital tool forecasts which are utilized by VPs to set budget and supplier strategies for Intel’s entire back-end manufacturing division \n \nConduct detailed “What-If” analyses to identify multi-million dollar cost mitigation opportunities \n \nImplemented continuous improvement projects that have reduced business process cycle times by more than 50% Capital Capacity Manager Intel Corporation July 2010  –  July 2011  (1 year 1 month) Phoenix, AZ Independently managed hundreds of high-value capital Purchase Orders supporting Intel’s complex supply chain \n \nDeveloped effective documentation and management strategies for new supplier setup and multi-million dollar Purchase Orders for new, unique toolsets that supported a novel, high-profile Pilot Line \n \nEarned Six Sigma Green Belt certification by analyzing the order process for a unique supplier, eliminating 50% of the process steps and saving 330 hours per year Capital Capacity Manager Intel Corporation July 2010  –  July 2011  (1 year 1 month) Phoenix, AZ Independently managed hundreds of high-value capital Purchase Orders supporting Intel’s complex supply chain \n \nDeveloped effective documentation and management strategies for new supplier setup and multi-million dollar Purchase Orders for new, unique toolsets that supported a novel, high-profile Pilot Line \n \nEarned Six Sigma Green Belt certification by analyzing the order process for a unique supplier, eliminating 50% of the process steps and saving 330 hours per year Teaching Assistant Penn State University January 2009  –  May 2010  (1 year 5 months) University Park, PA Provide assistance for a Process Quality Engineering undergraduate class by grading homework and exams, in addition to developing and conducting labs throughout each semester. Teaching Assistant Penn State University January 2009  –  May 2010  (1 year 5 months) University Park, PA Provide assistance for a Process Quality Engineering undergraduate class by grading homework and exams, in addition to developing and conducting labs throughout each semester. Line Speed Analyst ConAgra Foods May 2009  –  August 2009  (4 months) Lewisburg, PA Took initiative to lead a chokepoint analysis using line speed analysis techniques to highlight areas for improvement \nGained exposure to operations, management, and manufacturing in the food industry Line Speed Analyst ConAgra Foods May 2009  –  August 2009  (4 months) Lewisburg, PA Took initiative to lead a chokepoint analysis using line speed analysis techniques to highlight areas for improvement \nGained exposure to operations, management, and manufacturing in the food industry Research Assistant Virginia Commonwealth University May 2008  –  August 2008  (4 months) Richmond, VA Co-author: McLay, L. A., Lloyd, J. D., Niman, E. (2011). Interdicting Nuclear Material on Cargo Containers using Knapsack Problem Models. Annals of Operations Research, 187 (1) 185-205 \n \nUtilized Excel Solver and MATLAB to analyze and improve nuclear material detection strategies to ensure port security Research Assistant Virginia Commonwealth University May 2008  –  August 2008  (4 months) Richmond, VA Co-author: McLay, L. A., Lloyd, J. D., Niman, E. (2011). Interdicting Nuclear Material on Cargo Containers using Knapsack Problem Models. Annals of Operations Research, 187 (1) 185-205 \n \nUtilized Excel Solver and MATLAB to analyze and improve nuclear material detection strategies to ensure port security BioBIKE Programmer and Editor Bioengineering and Bioinformatics Summer Institute (BBSI) May 2006  –  August 2006  (4 months) Richmond, VA Worked independently and with a team on a biology programming language in a productive, deadline-driven environment \nUsed HTML to program, edit, and test the site architecture and navigation of a web-based biology application BioBIKE Programmer and Editor Bioengineering and Bioinformatics Summer Institute (BBSI) May 2006  –  August 2006  (4 months) Richmond, VA Worked independently and with a team on a biology programming language in a productive, deadline-driven environment \nUsed HTML to program, edit, and test the site architecture and navigation of a web-based biology application Skills Minitab Matlab VBA Arena Simulation... Microsoft Excel Java Maple AMPL Operations Research Simulations Statistical Modeling Mathematical Modeling Statistics Skills  Minitab Matlab VBA Arena Simulation... Microsoft Excel Java Maple AMPL Operations Research Simulations Statistical Modeling Mathematical Modeling Statistics Minitab Matlab VBA Arena Simulation... Microsoft Excel Java Maple AMPL Operations Research Simulations Statistical Modeling Mathematical Modeling Statistics Minitab Matlab VBA Arena Simulation... Microsoft Excel Java Maple AMPL Operations Research Simulations Statistical Modeling Mathematical Modeling Statistics Education Penn State University M.S.,  Industrial Engineering and Operations Research 2008  – 2010 Thesis: A Multi-Criteria Optimization Model for a Four-Stage Multi-Product Supply Chain Activities and Societies:  Industrial Engineering Graduate Association (IEGA) Secretary Virginia Commonwealth University B.S.,  Mathematical Sciences: Operations Research and Applied Mathematics 2001  – 2008 Activities and Societies:  VCU Women's Soccer Team ,  Phi Kappa Phi Honors Society ,  VCU Honors College ,  VCU Athletic Department Tutor and Mentor Penn State University M.S.,  Industrial Engineering and Operations Research 2008  – 2010 Thesis: A Multi-Criteria Optimization Model for a Four-Stage Multi-Product Supply Chain Activities and Societies:  Industrial Engineering Graduate Association (IEGA) Secretary Penn State University M.S.,  Industrial Engineering and Operations Research 2008  – 2010 Thesis: A Multi-Criteria Optimization Model for a Four-Stage Multi-Product Supply Chain Activities and Societies:  Industrial Engineering Graduate Association (IEGA) Secretary Penn State University M.S.,  Industrial Engineering and Operations Research 2008  – 2010 Thesis: A Multi-Criteria Optimization Model for a Four-Stage Multi-Product Supply Chain Activities and Societies:  Industrial Engineering Graduate Association (IEGA) Secretary Virginia Commonwealth University B.S.,  Mathematical Sciences: Operations Research and Applied Mathematics 2001  – 2008 Activities and Societies:  VCU Women's Soccer Team ,  Phi Kappa Phi Honors Society ,  VCU Honors College ,  VCU Athletic Department Tutor and Mentor Virginia Commonwealth University B.S.,  Mathematical Sciences: Operations Research and Applied Mathematics 2001  – 2008 Activities and Societies:  VCU Women's Soccer Team ,  Phi Kappa Phi Honors Society ,  VCU Honors College ,  VCU Athletic Department Tutor and Mentor Virginia Commonwealth University B.S.,  Mathematical Sciences: Operations Research and Applied Mathematics 2001  – 2008 Activities and Societies:  VCU Women's Soccer Team ,  Phi Kappa Phi Honors Society ,  VCU Honors College ,  VCU Athletic Department Tutor and Mentor Honors & Awards Additional Honors & Awards Academic:  \nTeaching Assistantship with Full Financial Support, PSU Department of Industrial Engineering: 2009 – 2010 \nHarold and Inge Marcus Graduate Fellowship Recipient, PSU Department of Industrial Engineering: 2008 \nDavid P. Minton Graduating Senior Award, VCU Department of Operations Research: 2008 \nPhi Kappa Phi Honors Society: 2007 – 2008  \nVirginia Commonwealth University Honors College: 2005 – 2008 \nAcademic Provost Scholarship: 2004 – 2008 \n \nAthletic: \nAnnual Black and Gold Award: Outstanding Athletic and Academic Achievement, VCU Athletic Department: 2008 \nTeam Season MVP: VCU Women’s Soccer: 2007 \nDivision I Athletic Scholarship: Women’s Soccer Goalkeeper: 2004 – 2008 \nCAA All-Championship Team: 2007 \nVCU All-Tournament Team: 2007 Additional Honors & Awards Academic:  \nTeaching Assistantship with Full Financial Support, PSU Department of Industrial Engineering: 2009 – 2010 \nHarold and Inge Marcus Graduate Fellowship Recipient, PSU Department of Industrial Engineering: 2008 \nDavid P. Minton Graduating Senior Award, VCU Department of Operations Research: 2008 \nPhi Kappa Phi Honors Society: 2007 – 2008  \nVirginia Commonwealth University Honors College: 2005 – 2008 \nAcademic Provost Scholarship: 2004 – 2008 \n \nAthletic: \nAnnual Black and Gold Award: Outstanding Athletic and Academic Achievement, VCU Athletic Department: 2008 \nTeam Season MVP: VCU Women’s Soccer: 2007 \nDivision I Athletic Scholarship: Women’s Soccer Goalkeeper: 2004 – 2008 \nCAA All-Championship Team: 2007 \nVCU All-Tournament Team: 2007 Additional Honors & Awards Academic:  \nTeaching Assistantship with Full Financial Support, PSU Department of Industrial Engineering: 2009 – 2010 \nHarold and Inge Marcus Graduate Fellowship Recipient, PSU Department of Industrial Engineering: 2008 \nDavid P. Minton Graduating Senior Award, VCU Department of Operations Research: 2008 \nPhi Kappa Phi Honors Society: 2007 – 2008  \nVirginia Commonwealth University Honors College: 2005 – 2008 \nAcademic Provost Scholarship: 2004 – 2008 \n \nAthletic: \nAnnual Black and Gold Award: Outstanding Athletic and Academic Achievement, VCU Athletic Department: 2008 \nTeam Season MVP: VCU Women’s Soccer: 2007 \nDivision I Athletic Scholarship: Women’s Soccer Goalkeeper: 2004 – 2008 \nCAA All-Championship Team: 2007 \nVCU All-Tournament Team: 2007 Additional Honors & Awards Academic:  \nTeaching Assistantship with Full Financial Support, PSU Department of Industrial Engineering: 2009 – 2010 \nHarold and Inge Marcus Graduate Fellowship Recipient, PSU Department of Industrial Engineering: 2008 \nDavid P. Minton Graduating Senior Award, VCU Department of Operations Research: 2008 \nPhi Kappa Phi Honors Society: 2007 – 2008  \nVirginia Commonwealth University Honors College: 2005 – 2008 \nAcademic Provost Scholarship: 2004 – 2008 \n \nAthletic: \nAnnual Black and Gold Award: Outstanding Athletic and Academic Achievement, VCU Athletic Department: 2008 \nTeam Season MVP: VCU Women’s Soccer: 2007 \nDivision I Athletic Scholarship: Women’s Soccer Goalkeeper: 2004 – 2008 \nCAA All-Championship Team: 2007 \nVCU All-Tournament Team: 2007 ", "Summary •\t720 GMAT Equivalent: 1470 GRE score \n•\tResults Oriented: Identified $7.6M in supply chain savings by building Excel inventory management model and analysis to advise CEO about building a future 700,000 ft2 facility \n•\tLeadership Experienced: Managed a 50% cut in lead time for all orders and a 60% departmental productivity gain \nwww.linkedin.com/in/sheffielddavid Summary •\t720 GMAT Equivalent: 1470 GRE score \n•\tResults Oriented: Identified $7.6M in supply chain savings by building Excel inventory management model and analysis to advise CEO about building a future 700,000 ft2 facility \n•\tLeadership Experienced: Managed a 50% cut in lead time for all orders and a 60% departmental productivity gain \nwww.linkedin.com/in/sheffielddavid •\t720 GMAT Equivalent: 1470 GRE score \n•\tResults Oriented: Identified $7.6M in supply chain savings by building Excel inventory management model and analysis to advise CEO about building a future 700,000 ft2 facility \n•\tLeadership Experienced: Managed a 50% cut in lead time for all orders and a 60% departmental productivity gain \nwww.linkedin.com/in/sheffielddavid •\t720 GMAT Equivalent: 1470 GRE score \n•\tResults Oriented: Identified $7.6M in supply chain savings by building Excel inventory management model and analysis to advise CEO about building a future 700,000 ft2 facility \n•\tLeadership Experienced: Managed a 50% cut in lead time for all orders and a 60% departmental productivity gain \nwww.linkedin.com/in/sheffielddavid Experience Data Scientist Intel Corporation August 2015  – Present (1 month) Phoenix, Arizona Area Global manufacturer, Fortune 100 company with $52.7B and 100,000+ employees \n \n•\tPart business analyst, part statistician, and part programmer \n \n•\tExtract data from multiple sources, and analyze that data to produce actionable insights \n \n•\tCombine analytics with strong business understanding and effective communication to change the way the business approaches challenges Capital Capacity Manager Intel Corporation June 2014  – Present (1 year 3 months) Phoenix, Arizona Area Global manufacturer, Fortune 100 company with $52.7B and 100,000+ employees \n \n•\tManage spends of $40.7M (1,253 POs) \n \n•\tAutomated/Programmed Department PO Audit—workload equivalent to 86% of one headcount + 2.85 times better PO failure detection rate than former system \n \n•\tdiscovered breakthrough trends that predict more than 1 year in advance supplier forecast cancellations and forecast pull-ins with >70% accuracy by applying data analytics \n \n•\tISM Member Process Consultant Nestle October 2013  –  December 2013  (3 months) Provo, Utah Area •\tIdentified $1.17M in cost savings through discrete simulation, benchmarking, stochastic modelling, statistical analysis using JMP software, process and value-stream mapping \n \n•\tConsulted the implementation of recommendations Capital Buyer Intern Intel Corporation May 2013  –  August 2013  (4 months) Phoenix, Arizona Area Offered full-time employment beginning June 2014 Operations / Supply Chain Co-Op Aquatherm January 2013  –  April 2013  (4 months) Lindon, UT Global manufacturer and Forbes Most Promising Company with $1B sales and 1,200 employees \n \n•\tReceived job offer at the end of consulting job \n \n•\tIdentified $7.6M in savings by building inventory management model to advise CEO about future 700,000 ft2 facility \n \n•\tDocumented efficiencies to free up 30% of current inventory space by analyzing purchasing and inventory in Excel \n \n•\tIncreased potential sales 20% per year by advising company strategy with regulatory research Process Improvement Consultant Intern The Dialog Group May 2012  –  July 2012  (3 months) Austin, Texas Area Regional consulting firm for Apple, Adobe, HP and Dell with $20M sales and 60 employees \n \n•\tEconomized ~$50,000 in one month by value stream mapping, benchmarking and implementing improvement plan \n \n•\tVitally contributed to a $3M sale by publishing two thought-leadership articles for Adobe \n \n•\tWorked closely with senior-level leadership and presented weekly to CEO Operations Quality Improvement LPL Financial May 2009  –  August 2011  (2 years 4 months) Greater San Diego Area Nation’s largest independent broker/dealer with $3.48B sales and 16,000 employees & financial consultants \n \n•\tImproved client communication efficiency 800% by developing searchable databases \n \n•\tReduced database processing time 98% by developing Visual Basic macro solutions for employees \n \n•\tCondensed client-request resolution times 15% by streamlining client-request forms from 7 to 1 \n \n•\tPrevented the loss of ~50,000 critical client records by creating Visual Basic macro to reverse data corruption Operations Specialist LPL Financial March 2008  –  May 2009  (1 year 3 months) Greater San Diego Area Nation’s largest independent broker/dealer with $3.48B sales and 16,000 employees & financial consultants \n \n•\tCondensed average lead time 50% for 4,000 client requests per month from four weeks to two weeks in one year \n \n•\tAchieved highest levels of service level agreement (SLA) compliance in the department Data Scientist Intel Corporation August 2015  – Present (1 month) Phoenix, Arizona Area Global manufacturer, Fortune 100 company with $52.7B and 100,000+ employees \n \n•\tPart business analyst, part statistician, and part programmer \n \n•\tExtract data from multiple sources, and analyze that data to produce actionable insights \n \n•\tCombine analytics with strong business understanding and effective communication to change the way the business approaches challenges Data Scientist Intel Corporation August 2015  – Present (1 month) Phoenix, Arizona Area Global manufacturer, Fortune 100 company with $52.7B and 100,000+ employees \n \n•\tPart business analyst, part statistician, and part programmer \n \n•\tExtract data from multiple sources, and analyze that data to produce actionable insights \n \n•\tCombine analytics with strong business understanding and effective communication to change the way the business approaches challenges Capital Capacity Manager Intel Corporation June 2014  – Present (1 year 3 months) Phoenix, Arizona Area Global manufacturer, Fortune 100 company with $52.7B and 100,000+ employees \n \n•\tManage spends of $40.7M (1,253 POs) \n \n•\tAutomated/Programmed Department PO Audit—workload equivalent to 86% of one headcount + 2.85 times better PO failure detection rate than former system \n \n•\tdiscovered breakthrough trends that predict more than 1 year in advance supplier forecast cancellations and forecast pull-ins with >70% accuracy by applying data analytics \n \n•\tISM Member Capital Capacity Manager Intel Corporation June 2014  – Present (1 year 3 months) Phoenix, Arizona Area Global manufacturer, Fortune 100 company with $52.7B and 100,000+ employees \n \n•\tManage spends of $40.7M (1,253 POs) \n \n•\tAutomated/Programmed Department PO Audit—workload equivalent to 86% of one headcount + 2.85 times better PO failure detection rate than former system \n \n•\tdiscovered breakthrough trends that predict more than 1 year in advance supplier forecast cancellations and forecast pull-ins with >70% accuracy by applying data analytics \n \n•\tISM Member Process Consultant Nestle October 2013  –  December 2013  (3 months) Provo, Utah Area •\tIdentified $1.17M in cost savings through discrete simulation, benchmarking, stochastic modelling, statistical analysis using JMP software, process and value-stream mapping \n \n•\tConsulted the implementation of recommendations Process Consultant Nestle October 2013  –  December 2013  (3 months) Provo, Utah Area •\tIdentified $1.17M in cost savings through discrete simulation, benchmarking, stochastic modelling, statistical analysis using JMP software, process and value-stream mapping \n \n•\tConsulted the implementation of recommendations Capital Buyer Intern Intel Corporation May 2013  –  August 2013  (4 months) Phoenix, Arizona Area Offered full-time employment beginning June 2014 Capital Buyer Intern Intel Corporation May 2013  –  August 2013  (4 months) Phoenix, Arizona Area Offered full-time employment beginning June 2014 Operations / Supply Chain Co-Op Aquatherm January 2013  –  April 2013  (4 months) Lindon, UT Global manufacturer and Forbes Most Promising Company with $1B sales and 1,200 employees \n \n•\tReceived job offer at the end of consulting job \n \n•\tIdentified $7.6M in savings by building inventory management model to advise CEO about future 700,000 ft2 facility \n \n•\tDocumented efficiencies to free up 30% of current inventory space by analyzing purchasing and inventory in Excel \n \n•\tIncreased potential sales 20% per year by advising company strategy with regulatory research Operations / Supply Chain Co-Op Aquatherm January 2013  –  April 2013  (4 months) Lindon, UT Global manufacturer and Forbes Most Promising Company with $1B sales and 1,200 employees \n \n•\tReceived job offer at the end of consulting job \n \n•\tIdentified $7.6M in savings by building inventory management model to advise CEO about future 700,000 ft2 facility \n \n•\tDocumented efficiencies to free up 30% of current inventory space by analyzing purchasing and inventory in Excel \n \n•\tIncreased potential sales 20% per year by advising company strategy with regulatory research Process Improvement Consultant Intern The Dialog Group May 2012  –  July 2012  (3 months) Austin, Texas Area Regional consulting firm for Apple, Adobe, HP and Dell with $20M sales and 60 employees \n \n•\tEconomized ~$50,000 in one month by value stream mapping, benchmarking and implementing improvement plan \n \n•\tVitally contributed to a $3M sale by publishing two thought-leadership articles for Adobe \n \n•\tWorked closely with senior-level leadership and presented weekly to CEO Process Improvement Consultant Intern The Dialog Group May 2012  –  July 2012  (3 months) Austin, Texas Area Regional consulting firm for Apple, Adobe, HP and Dell with $20M sales and 60 employees \n \n•\tEconomized ~$50,000 in one month by value stream mapping, benchmarking and implementing improvement plan \n \n•\tVitally contributed to a $3M sale by publishing two thought-leadership articles for Adobe \n \n•\tWorked closely with senior-level leadership and presented weekly to CEO Operations Quality Improvement LPL Financial May 2009  –  August 2011  (2 years 4 months) Greater San Diego Area Nation’s largest independent broker/dealer with $3.48B sales and 16,000 employees & financial consultants \n \n•\tImproved client communication efficiency 800% by developing searchable databases \n \n•\tReduced database processing time 98% by developing Visual Basic macro solutions for employees \n \n•\tCondensed client-request resolution times 15% by streamlining client-request forms from 7 to 1 \n \n•\tPrevented the loss of ~50,000 critical client records by creating Visual Basic macro to reverse data corruption Operations Quality Improvement LPL Financial May 2009  –  August 2011  (2 years 4 months) Greater San Diego Area Nation’s largest independent broker/dealer with $3.48B sales and 16,000 employees & financial consultants \n \n•\tImproved client communication efficiency 800% by developing searchable databases \n \n•\tReduced database processing time 98% by developing Visual Basic macro solutions for employees \n \n•\tCondensed client-request resolution times 15% by streamlining client-request forms from 7 to 1 \n \n•\tPrevented the loss of ~50,000 critical client records by creating Visual Basic macro to reverse data corruption Operations Specialist LPL Financial March 2008  –  May 2009  (1 year 3 months) Greater San Diego Area Nation’s largest independent broker/dealer with $3.48B sales and 16,000 employees & financial consultants \n \n•\tCondensed average lead time 50% for 4,000 client requests per month from four weeks to two weeks in one year \n \n•\tAchieved highest levels of service level agreement (SLA) compliance in the department Operations Specialist LPL Financial March 2008  –  May 2009  (1 year 3 months) Greater San Diego Area Nation’s largest independent broker/dealer with $3.48B sales and 16,000 employees & financial consultants \n \n•\tCondensed average lead time 50% for 4,000 client requests per month from four weeks to two weeks in one year \n \n•\tAchieved highest levels of service level agreement (SLA) compliance in the department Languages English Native or bilingual proficiency Spanish Limited working proficiency Portuguese Professional working proficiency English Native or bilingual proficiency Spanish Limited working proficiency Portuguese Professional working proficiency English Native or bilingual proficiency Spanish Limited working proficiency Portuguese Professional working proficiency Native or bilingual proficiency Limited working proficiency Professional working proficiency Skills Skills     Education Brigham Young University Master of Business Administration (MBA),  Supply Chain , 3.72 GPA 2012  – 2014 •\tSociety memberships: ASQ, ISM and GSCMA Brigham Young University Master of Science (M.S.),  Manufacturing Engineering , 3.85 GPA 2011  – 2014 •\tQuality, Lean, Six Sigma and Process focus \n•\tProcess improvement projects with Nestle and Boeing utilizing process mapping, statistical analysis, and simulation software (ProModel) \n•\tEmployed statistical quality tools to control and optimize production; e.g., loss function, SPC, DOE and FMEA Brigham Young University Bachelor of Science (BS),  Business Administration and Management , General 2003  – 2007 •\tCompeted in BYU Business Plan Competition; the business (Sub Zero Ice Cream) now has 19 store locations \n•\tMinor, Spanish La Costa Canyon High School Diploma,  General Education 1996  – 2000 Activities and Societies:  Wrestling ,  Baseball ,  Track ,  NHS Brigham Young University Master of Business Administration (MBA),  Supply Chain , 3.72 GPA 2012  – 2014 •\tSociety memberships: ASQ, ISM and GSCMA Brigham Young University Master of Business Administration (MBA),  Supply Chain , 3.72 GPA 2012  – 2014 •\tSociety memberships: ASQ, ISM and GSCMA Brigham Young University Master of Business Administration (MBA),  Supply Chain , 3.72 GPA 2012  – 2014 •\tSociety memberships: ASQ, ISM and GSCMA Brigham Young University Master of Science (M.S.),  Manufacturing Engineering , 3.85 GPA 2011  – 2014 •\tQuality, Lean, Six Sigma and Process focus \n•\tProcess improvement projects with Nestle and Boeing utilizing process mapping, statistical analysis, and simulation software (ProModel) \n•\tEmployed statistical quality tools to control and optimize production; e.g., loss function, SPC, DOE and FMEA Brigham Young University Master of Science (M.S.),  Manufacturing Engineering , 3.85 GPA 2011  – 2014 •\tQuality, Lean, Six Sigma and Process focus \n•\tProcess improvement projects with Nestle and Boeing utilizing process mapping, statistical analysis, and simulation software (ProModel) \n•\tEmployed statistical quality tools to control and optimize production; e.g., loss function, SPC, DOE and FMEA Brigham Young University Master of Science (M.S.),  Manufacturing Engineering , 3.85 GPA 2011  – 2014 •\tQuality, Lean, Six Sigma and Process focus \n•\tProcess improvement projects with Nestle and Boeing utilizing process mapping, statistical analysis, and simulation software (ProModel) \n•\tEmployed statistical quality tools to control and optimize production; e.g., loss function, SPC, DOE and FMEA Brigham Young University Bachelor of Science (BS),  Business Administration and Management , General 2003  – 2007 •\tCompeted in BYU Business Plan Competition; the business (Sub Zero Ice Cream) now has 19 store locations \n•\tMinor, Spanish Brigham Young University Bachelor of Science (BS),  Business Administration and Management , General 2003  – 2007 •\tCompeted in BYU Business Plan Competition; the business (Sub Zero Ice Cream) now has 19 store locations \n•\tMinor, Spanish Brigham Young University Bachelor of Science (BS),  Business Administration and Management , General 2003  – 2007 •\tCompeted in BYU Business Plan Competition; the business (Sub Zero Ice Cream) now has 19 store locations \n•\tMinor, Spanish La Costa Canyon High School Diploma,  General Education 1996  – 2000 Activities and Societies:  Wrestling ,  Baseball ,  Track ,  NHS La Costa Canyon High School Diploma,  General Education 1996  – 2000 Activities and Societies:  Wrestling ,  Baseball ,  Track ,  NHS La Costa Canyon High School Diploma,  General Education 1996  – 2000 Activities and Societies:  Wrestling ,  Baseball ,  Track ,  NHS Honors & Awards ", "Experience MBA Candidate and Graduate Assistant Eli Broad Graduate School of Management August 2013  –  June 2015  (1 year 11 months) Lansing, Michigan Area MBA Supply Chain Intern Cummins Inc. May 2014  –  August 2014  (4 months) Ladson, South Carolina Network Analyst Network Technologies International January 2012  –  July 2013  (1 year 7 months) Scottsdale, AZ Database/GIS Analyst Network Technologies International January 2009  –  December 2011  (3 years) Scottsdale, AZ Data Analyst Network Technologies International June 2008  –  December 2009  (1 year 7 months) Scottsdale, AZ Software Developer Intern CXT Software February 2007  –  July 2007  (6 months) Phoenix, Arizona Area MBA Candidate and Graduate Assistant Eli Broad Graduate School of Management August 2013  –  June 2015  (1 year 11 months) Lansing, Michigan Area MBA Candidate and Graduate Assistant Eli Broad Graduate School of Management August 2013  –  June 2015  (1 year 11 months) Lansing, Michigan Area MBA Supply Chain Intern Cummins Inc. May 2014  –  August 2014  (4 months) Ladson, South Carolina MBA Supply Chain Intern Cummins Inc. May 2014  –  August 2014  (4 months) Ladson, South Carolina Network Analyst Network Technologies International January 2012  –  July 2013  (1 year 7 months) Scottsdale, AZ Network Analyst Network Technologies International January 2012  –  July 2013  (1 year 7 months) Scottsdale, AZ Database/GIS Analyst Network Technologies International January 2009  –  December 2011  (3 years) Scottsdale, AZ Database/GIS Analyst Network Technologies International January 2009  –  December 2011  (3 years) Scottsdale, AZ Data Analyst Network Technologies International June 2008  –  December 2009  (1 year 7 months) Scottsdale, AZ Data Analyst Network Technologies International June 2008  –  December 2009  (1 year 7 months) Scottsdale, AZ Software Developer Intern CXT Software February 2007  –  July 2007  (6 months) Phoenix, Arizona Area Software Developer Intern CXT Software February 2007  –  July 2007  (6 months) Phoenix, Arizona Area Languages Portuguese Native or bilingual proficiency Portuguese Native or bilingual proficiency Portuguese Native or bilingual proficiency Native or bilingual proficiency Skills SQL PL/SQL ArcGIS Data Analysis Microsoft Office Visio NGN PSTN Access Telecommunications Databases Relational Databases Visual Basic SDLC Analysis C# Supply Chain Management Teamwork Quality Control Public Speaking See 5+     See less Skills  SQL PL/SQL ArcGIS Data Analysis Microsoft Office Visio NGN PSTN Access Telecommunications Databases Relational Databases Visual Basic SDLC Analysis C# Supply Chain Management Teamwork Quality Control Public Speaking See 5+     See less SQL PL/SQL ArcGIS Data Analysis Microsoft Office Visio NGN PSTN Access Telecommunications Databases Relational Databases Visual Basic SDLC Analysis C# Supply Chain Management Teamwork Quality Control Public Speaking See 5+     See less SQL PL/SQL ArcGIS Data Analysis Microsoft Office Visio NGN PSTN Access Telecommunications Databases Relational Databases Visual Basic SDLC Analysis C# Supply Chain Management Teamwork Quality Control Public Speaking See 5+     See less Education Michigan State University - The Eli Broad Graduate School of Management MBA,  Supply Chain Management 2013  – 2015 Graduate Assistant Scholarship Recipient - Admissions Office Arizona State University, W. P. Carey School of Business Computer Information Systems , 3.84 2002  – 2008 CIS340: Object Oriented Programming and Analysis \nC# programming, Unified Modeling Language, SDLC \n \nCIS360: Database Management and Design \nMSSQL, SQL, ER Modeling, MS Access \n \nCIS425: E-Commerce Strategies and Design \nASP.Net, C# programming, SQL \n \nCIS430: Distributed Information Systems \nMultithreaded programming in C#, Client/Server Architecture, Network Design \n \nCIS440: Systems Analysis and Design \nSystems documentation, Unified Modeling Language, SDLC methodologies, Project Management Michigan State University - The Eli Broad Graduate School of Management MBA,  Supply Chain Management 2013  – 2015 Graduate Assistant Scholarship Recipient - Admissions Office Michigan State University - The Eli Broad Graduate School of Management MBA,  Supply Chain Management 2013  – 2015 Graduate Assistant Scholarship Recipient - Admissions Office Michigan State University - The Eli Broad Graduate School of Management MBA,  Supply Chain Management 2013  – 2015 Graduate Assistant Scholarship Recipient - Admissions Office Arizona State University, W. P. Carey School of Business Computer Information Systems , 3.84 2002  – 2008 CIS340: Object Oriented Programming and Analysis \nC# programming, Unified Modeling Language, SDLC \n \nCIS360: Database Management and Design \nMSSQL, SQL, ER Modeling, MS Access \n \nCIS425: E-Commerce Strategies and Design \nASP.Net, C# programming, SQL \n \nCIS430: Distributed Information Systems \nMultithreaded programming in C#, Client/Server Architecture, Network Design \n \nCIS440: Systems Analysis and Design \nSystems documentation, Unified Modeling Language, SDLC methodologies, Project Management Arizona State University, W. P. Carey School of Business Computer Information Systems , 3.84 2002  – 2008 CIS340: Object Oriented Programming and Analysis \nC# programming, Unified Modeling Language, SDLC \n \nCIS360: Database Management and Design \nMSSQL, SQL, ER Modeling, MS Access \n \nCIS425: E-Commerce Strategies and Design \nASP.Net, C# programming, SQL \n \nCIS430: Distributed Information Systems \nMultithreaded programming in C#, Client/Server Architecture, Network Design \n \nCIS440: Systems Analysis and Design \nSystems documentation, Unified Modeling Language, SDLC methodologies, Project Management Arizona State University, W. P. Carey School of Business Computer Information Systems , 3.84 2002  – 2008 CIS340: Object Oriented Programming and Analysis \nC# programming, Unified Modeling Language, SDLC \n \nCIS360: Database Management and Design \nMSSQL, SQL, ER Modeling, MS Access \n \nCIS425: E-Commerce Strategies and Design \nASP.Net, C# programming, SQL \n \nCIS430: Distributed Information Systems \nMultithreaded programming in C#, Client/Server Architecture, Network Design \n \nCIS440: Systems Analysis and Design \nSystems documentation, Unified Modeling Language, SDLC methodologies, Project Management ", "Summary A dedicated materials/purchasing professional that possesses a broad skill base including: controls & compliance, customer service, people management, project management, LEAN methodologies, leadership, coaching, training, purchasing & supply line management, with strong analytical & verbal/written communication skills. Specialties:SAP \nLEAN Summary A dedicated materials/purchasing professional that possesses a broad skill base including: controls & compliance, customer service, people management, project management, LEAN methodologies, leadership, coaching, training, purchasing & supply line management, with strong analytical & verbal/written communication skills. Specialties:SAP \nLEAN A dedicated materials/purchasing professional that possesses a broad skill base including: controls & compliance, customer service, people management, project management, LEAN methodologies, leadership, coaching, training, purchasing & supply line management, with strong analytical & verbal/written communication skills. Specialties:SAP \nLEAN A dedicated materials/purchasing professional that possesses a broad skill base including: controls & compliance, customer service, people management, project management, LEAN methodologies, leadership, coaching, training, purchasing & supply line management, with strong analytical & verbal/written communication skills. Specialties:SAP \nLEAN Experience Capital Capacity Manager Intel Corporation November 2009  – Present (5 years 10 months) Capital Capacity Manager in the Supply Line Management Group within Capital Planning organization that is responsible for driving Forecast, Order, Delivery, Receipt, and Payment on capital equipment, tooling equipment, and conversion kits for fabrication sites on a global level. Purchasing Manager Intel Corporation October 2006  –  May 2009  (2 years 8 months) Rio Rancho, New Mexico Purchasing Manager that drove globalization of workforce in support of purchasing transactions across multiple site/geographies. Drove continuous improvement and standardization through LEAN concepts. Capital Capacity Manager Intel Corporation November 2009  – Present (5 years 10 months) Capital Capacity Manager in the Supply Line Management Group within Capital Planning organization that is responsible for driving Forecast, Order, Delivery, Receipt, and Payment on capital equipment, tooling equipment, and conversion kits for fabrication sites on a global level. Capital Capacity Manager Intel Corporation November 2009  – Present (5 years 10 months) Capital Capacity Manager in the Supply Line Management Group within Capital Planning organization that is responsible for driving Forecast, Order, Delivery, Receipt, and Payment on capital equipment, tooling equipment, and conversion kits for fabrication sites on a global level. Purchasing Manager Intel Corporation October 2006  –  May 2009  (2 years 8 months) Rio Rancho, New Mexico Purchasing Manager that drove globalization of workforce in support of purchasing transactions across multiple site/geographies. Drove continuous improvement and standardization through LEAN concepts. Purchasing Manager Intel Corporation October 2006  –  May 2009  (2 years 8 months) Rio Rancho, New Mexico Purchasing Manager that drove globalization of workforce in support of purchasing transactions across multiple site/geographies. Drove continuous improvement and standardization through LEAN concepts. Skills Supply Management Lean Manufacturing Strategic Sourcing SAP Supply Chain Management Operations Management Materials Management Demand Planning Cross-functional Team... Key Performance... Negotiation ERP Forecasting Supply Chain... Project Management Inventory Management Business Process... Materials Program Management Root Cause Analysis Purchasing Supply Chain Project Planning Manufacturing... Contract Negotiation Six Sigma Sourcing Process Improvement Supplier Development Training Continuous Improvement Change Management Semiconductors Production Planning Engineering Management Logistics Team Building Global Sourcing Strategy Strategic Planning Business Strategy Logistics Management Procurement Supplier Negotiation MRP Team Leadership Management Inventory Control SPC Contract Management See 35+     See less Skills  Supply Management Lean Manufacturing Strategic Sourcing SAP Supply Chain Management Operations Management Materials Management Demand Planning Cross-functional Team... Key Performance... Negotiation ERP Forecasting Supply Chain... Project Management Inventory Management Business Process... Materials Program Management Root Cause Analysis Purchasing Supply Chain Project Planning Manufacturing... Contract Negotiation Six Sigma Sourcing Process Improvement Supplier Development Training Continuous Improvement Change Management Semiconductors Production Planning Engineering Management Logistics Team Building Global Sourcing Strategy Strategic Planning Business Strategy Logistics Management Procurement Supplier Negotiation MRP Team Leadership Management Inventory Control SPC Contract Management See 35+     See less Supply Management Lean Manufacturing Strategic Sourcing SAP Supply Chain Management Operations Management Materials Management Demand Planning Cross-functional Team... Key Performance... Negotiation ERP Forecasting Supply Chain... Project Management Inventory Management Business Process... Materials Program Management Root Cause Analysis Purchasing Supply Chain Project Planning Manufacturing... Contract Negotiation Six Sigma Sourcing Process Improvement Supplier Development Training Continuous Improvement Change Management Semiconductors Production Planning Engineering Management Logistics Team Building Global Sourcing Strategy Strategic Planning Business Strategy Logistics Management Procurement Supplier Negotiation MRP Team Leadership Management Inventory Control SPC Contract Management See 35+     See less Supply Management Lean Manufacturing Strategic Sourcing SAP Supply Chain Management Operations Management Materials Management Demand Planning Cross-functional Team... Key Performance... Negotiation ERP Forecasting Supply Chain... Project Management Inventory Management Business Process... Materials Program Management Root Cause Analysis Purchasing Supply Chain Project Planning Manufacturing... Contract Negotiation Six Sigma Sourcing Process Improvement Supplier Development Training Continuous Improvement Change Management Semiconductors Production Planning Engineering Management Logistics Team Building Global Sourcing Strategy Strategic Planning Business Strategy Logistics Management Procurement Supplier Negotiation MRP Team Leadership Management Inventory Control SPC Contract Management See 35+     See less "]}