{"position": "Chemical Engineer", "company": "Intel Corporation", "profiles": ["Summary Operations Manager responsible for the business interests of a consumer products paper company. Responsiblities include supervision of employees, finished product quality, paper machine performance, vendor management, and oversite of all other day to day mill activities. Summary Operations Manager responsible for the business interests of a consumer products paper company. Responsiblities include supervision of employees, finished product quality, paper machine performance, vendor management, and oversite of all other day to day mill activities. Operations Manager responsible for the business interests of a consumer products paper company. Responsiblities include supervision of employees, finished product quality, paper machine performance, vendor management, and oversite of all other day to day mill activities. Operations Manager responsible for the business interests of a consumer products paper company. Responsiblities include supervision of employees, finished product quality, paper machine performance, vendor management, and oversite of all other day to day mill activities. Experience Operations Manager Doubletree Paper Mills June 2013  – Present (2 years 3 months) Account Manager Nalco September 2004  –  May 2013  (8 years 9 months) ACCOUNT MANAGER – PROMOTED APRIL 2010 \n-Mountaineer Masters Gold Level Award Winner. This award recognizes a cumulative territory profit increase of over $400K and a minimum of three consecutive years over target. \n-Meet regularly with mill and department managers to document value and progress of projects. \n-Respond to requests for proposals and negotiate contract terms with purchasing departments. \n-Develop sustainable solutions to reduce total cost of operations and reduce environmental footprint. \nDISTRICT REPRESENTATIVE I – PROMOTED APRIL 2008 \n- Primary Trainer for new sales representative. \nDISTRICT REPRESENTATIVE II – PROMOTED APRIL 2007 \n- Create and deliver technical presentations on industrial water treatment, boiler chemistry, paper process chemicals, quarterly executive summaries, and annual business reviews. \nDISTRICT REPRESENTATIVE III – PROMOTED JUNE 2005\t \n- Took over account in jeopardy, created stability, and increased profit margin. \n-Manage all aspects of chemical ordering, inventory, and usage. \nAPPLICATIONS ENGINEER\t \n- Analyzed customer data relating to specialty chemical applications and recommend process improvements. Sales Engineer Bryan Research and Engineering April 2003  –  January 2004  (10 months) SALES ENGINEER \n- Sold process simulation software utilizing value based selling techniques. \n- Provided technical modeling expertise for optimization of natural gas and oil refining processes. Field Consultant/Sales Blue Mountain Environmental & Consulting March 2002  –  March 2003  (1 year 1 month) Waitsburg, Washington - Generated and conducted Phase I & II environmental site assessments in OR, WA, & ID. Chemical Engineer Intel Corporation August 2000  –  November 2001  (1 year 4 months) Hillsboro, Oregon - Responsible for chemical waste systems at the Ronler Acres microprocessor R&D facility.  \n- Consulted at several Intel locations on best practices for chemical waste stream management. Operations Manager Doubletree Paper Mills June 2013  – Present (2 years 3 months) Operations Manager Doubletree Paper Mills June 2013  – Present (2 years 3 months) Account Manager Nalco September 2004  –  May 2013  (8 years 9 months) ACCOUNT MANAGER – PROMOTED APRIL 2010 \n-Mountaineer Masters Gold Level Award Winner. This award recognizes a cumulative territory profit increase of over $400K and a minimum of three consecutive years over target. \n-Meet regularly with mill and department managers to document value and progress of projects. \n-Respond to requests for proposals and negotiate contract terms with purchasing departments. \n-Develop sustainable solutions to reduce total cost of operations and reduce environmental footprint. \nDISTRICT REPRESENTATIVE I – PROMOTED APRIL 2008 \n- Primary Trainer for new sales representative. \nDISTRICT REPRESENTATIVE II – PROMOTED APRIL 2007 \n- Create and deliver technical presentations on industrial water treatment, boiler chemistry, paper process chemicals, quarterly executive summaries, and annual business reviews. \nDISTRICT REPRESENTATIVE III – PROMOTED JUNE 2005\t \n- Took over account in jeopardy, created stability, and increased profit margin. \n-Manage all aspects of chemical ordering, inventory, and usage. \nAPPLICATIONS ENGINEER\t \n- Analyzed customer data relating to specialty chemical applications and recommend process improvements. Account Manager Nalco September 2004  –  May 2013  (8 years 9 months) ACCOUNT MANAGER – PROMOTED APRIL 2010 \n-Mountaineer Masters Gold Level Award Winner. This award recognizes a cumulative territory profit increase of over $400K and a minimum of three consecutive years over target. \n-Meet regularly with mill and department managers to document value and progress of projects. \n-Respond to requests for proposals and negotiate contract terms with purchasing departments. \n-Develop sustainable solutions to reduce total cost of operations and reduce environmental footprint. \nDISTRICT REPRESENTATIVE I – PROMOTED APRIL 2008 \n- Primary Trainer for new sales representative. \nDISTRICT REPRESENTATIVE II – PROMOTED APRIL 2007 \n- Create and deliver technical presentations on industrial water treatment, boiler chemistry, paper process chemicals, quarterly executive summaries, and annual business reviews. \nDISTRICT REPRESENTATIVE III – PROMOTED JUNE 2005\t \n- Took over account in jeopardy, created stability, and increased profit margin. \n-Manage all aspects of chemical ordering, inventory, and usage. \nAPPLICATIONS ENGINEER\t \n- Analyzed customer data relating to specialty chemical applications and recommend process improvements. Sales Engineer Bryan Research and Engineering April 2003  –  January 2004  (10 months) SALES ENGINEER \n- Sold process simulation software utilizing value based selling techniques. \n- Provided technical modeling expertise for optimization of natural gas and oil refining processes. Sales Engineer Bryan Research and Engineering April 2003  –  January 2004  (10 months) SALES ENGINEER \n- Sold process simulation software utilizing value based selling techniques. \n- Provided technical modeling expertise for optimization of natural gas and oil refining processes. Field Consultant/Sales Blue Mountain Environmental & Consulting March 2002  –  March 2003  (1 year 1 month) Waitsburg, Washington - Generated and conducted Phase I & II environmental site assessments in OR, WA, & ID. Field Consultant/Sales Blue Mountain Environmental & Consulting March 2002  –  March 2003  (1 year 1 month) Waitsburg, Washington - Generated and conducted Phase I & II environmental site assessments in OR, WA, & ID. Chemical Engineer Intel Corporation August 2000  –  November 2001  (1 year 4 months) Hillsboro, Oregon - Responsible for chemical waste systems at the Ronler Acres microprocessor R&D facility.  \n- Consulted at several Intel locations on best practices for chemical waste stream management. Chemical Engineer Intel Corporation August 2000  –  November 2001  (1 year 4 months) Hillsboro, Oregon - Responsible for chemical waste systems at the Ronler Acres microprocessor R&D facility.  \n- Consulted at several Intel locations on best practices for chemical waste stream management. Skills Sales Operations Sales Process Improvement Management Chemistry Negotiation Product Development Manufacturing Continuous Improvement Chemical Engineering Cross-functional Team... Engineering Process Engineering Sales Management Skills  Sales Operations Sales Process Improvement Management Chemistry Negotiation Product Development Manufacturing Continuous Improvement Chemical Engineering Cross-functional Team... Engineering Process Engineering Sales Management Sales Operations Sales Process Improvement Management Chemistry Negotiation Product Development Manufacturing Continuous Improvement Chemical Engineering Cross-functional Team... Engineering Process Engineering Sales Management Sales Operations Sales Process Improvement Management Chemistry Negotiation Product Development Manufacturing Continuous Improvement Chemical Engineering Cross-functional Team... Engineering Process Engineering Sales Management Education Oregon State University Bachelor of Science,  Chemical Engineering 1995  – 2000 Activities and Societies:  Sigma Phi Epsilon ,  MECOP (Multiple Engineering CoOperative Program) Internships 6 months each with Armstrong World Industries & Merix Corporation Oregon State University Bachelor of Science,  Chemical Engineering 1995  – 2000 Activities and Societies:  Sigma Phi Epsilon ,  MECOP (Multiple Engineering CoOperative Program) Internships 6 months each with Armstrong World Industries & Merix Corporation Oregon State University Bachelor of Science,  Chemical Engineering 1995  – 2000 Activities and Societies:  Sigma Phi Epsilon ,  MECOP (Multiple Engineering CoOperative Program) Internships 6 months each with Armstrong World Industries & Merix Corporation Oregon State University Bachelor of Science,  Chemical Engineering 1995  – 2000 Activities and Societies:  Sigma Phi Epsilon ,  MECOP (Multiple Engineering CoOperative Program) Internships 6 months each with Armstrong World Industries & Merix Corporation ", "Summary My carrier has focused on technology transfer, introduction and development of new process and products, installation and Qualification of equipment and certification of new manufacturing site in semiconductor area. Seventeen years of experience working at Intel Corporation in Costa Rica. \nI worked in several technology, products, process and equipment development projects in Arizona USA, Germany and Malaysia. Some of them I led and for which the results became worldwide standard for the manufacturing process of microprocessors at Intel across all factories. I led and managed teams of multi-disciplinary (Mechanical, Industrial, Electronics, Quality Engineers and other areas like finance) and multi-cultural (From USA, Costa Rica, India, Malaysia, Germany, Philippines, China) professionals for new process and products transfer, equipment install and qualification, continuous improvement and process management and control.  \nI also worked in a technology transfer project with the International Research Center of Canada and the chambers of Industry of a Central America during 1995-1997. Speaker on Behalf of the Organization of American States in technology transfer conferences to chambers of Industry in Trinidad&Tobago, Colombia, Ecuador and Costa Rica. Summary My carrier has focused on technology transfer, introduction and development of new process and products, installation and Qualification of equipment and certification of new manufacturing site in semiconductor area. Seventeen years of experience working at Intel Corporation in Costa Rica. \nI worked in several technology, products, process and equipment development projects in Arizona USA, Germany and Malaysia. Some of them I led and for which the results became worldwide standard for the manufacturing process of microprocessors at Intel across all factories. I led and managed teams of multi-disciplinary (Mechanical, Industrial, Electronics, Quality Engineers and other areas like finance) and multi-cultural (From USA, Costa Rica, India, Malaysia, Germany, Philippines, China) professionals for new process and products transfer, equipment install and qualification, continuous improvement and process management and control.  \nI also worked in a technology transfer project with the International Research Center of Canada and the chambers of Industry of a Central America during 1995-1997. Speaker on Behalf of the Organization of American States in technology transfer conferences to chambers of Industry in Trinidad&Tobago, Colombia, Ecuador and Costa Rica. My carrier has focused on technology transfer, introduction and development of new process and products, installation and Qualification of equipment and certification of new manufacturing site in semiconductor area. Seventeen years of experience working at Intel Corporation in Costa Rica. \nI worked in several technology, products, process and equipment development projects in Arizona USA, Germany and Malaysia. Some of them I led and for which the results became worldwide standard for the manufacturing process of microprocessors at Intel across all factories. I led and managed teams of multi-disciplinary (Mechanical, Industrial, Electronics, Quality Engineers and other areas like finance) and multi-cultural (From USA, Costa Rica, India, Malaysia, Germany, Philippines, China) professionals for new process and products transfer, equipment install and qualification, continuous improvement and process management and control.  \nI also worked in a technology transfer project with the International Research Center of Canada and the chambers of Industry of a Central America during 1995-1997. Speaker on Behalf of the Organization of American States in technology transfer conferences to chambers of Industry in Trinidad&Tobago, Colombia, Ecuador and Costa Rica. My carrier has focused on technology transfer, introduction and development of new process and products, installation and Qualification of equipment and certification of new manufacturing site in semiconductor area. Seventeen years of experience working at Intel Corporation in Costa Rica. \nI worked in several technology, products, process and equipment development projects in Arizona USA, Germany and Malaysia. Some of them I led and for which the results became worldwide standard for the manufacturing process of microprocessors at Intel across all factories. I led and managed teams of multi-disciplinary (Mechanical, Industrial, Electronics, Quality Engineers and other areas like finance) and multi-cultural (From USA, Costa Rica, India, Malaysia, Germany, Philippines, China) professionals for new process and products transfer, equipment install and qualification, continuous improvement and process management and control.  \nI also worked in a technology transfer project with the International Research Center of Canada and the chambers of Industry of a Central America during 1995-1997. Speaker on Behalf of the Organization of American States in technology transfer conferences to chambers of Industry in Trinidad&Tobago, Colombia, Ecuador and Costa Rica. Experience Technical Lead Intel May 1997  – Present (18 years 4 months) Costa Rica Currently working as a Technical leader across different modules in Assembly engineering area, in charge of continuous improvement projects; Installation and qualification of new equipment and new processes; Transfer of new technologies, platforms and products; Engineering development and up-skilling; New engineers interviewing and selection; manufacturing indicators improvement like Maintenance, Conversions and Machine Availability; Chip Attach (CAM) Assembly & Test Operations Transfer Manager Intel Corporation February 2010  –  February 2012  (2 years 1 month) Phoenix, Arizona Area Moved to Arizona in a two way temporary assignment for 2 years to work as Chip Attach Module transfer manager with Assembly and Test Operations, in charge of technology transfer between the Development site in Arizona for Assembly and Test technology and the seven factories around the world in charge of High volume manufacturing of Microprocessors. Main roles were: to create, maintain and publish schedules for the transfer of several new platforms and products; approval of process changes and responsible for the success of the new product, process and technology transfer to all seven sites and ensure new technologies and processes being developed were ready for High Volume manufacturing; Selection of early involvement engineers from the Manufacturing factories and Manage them while on assignment in Arizona. Project manager for Chipset Assembly and Manufacturing Transfer Line Readiness Intel Corporation January 2009  –  February 2010  (1 year 2 months) Costa Rica Project Manager for the LRT (Line Readiness Team) in Assembly area and the MRT (Manufacturing Readiness Team) for the new 17 chipset products being transfer from the closing factories in Malaysia and China. Responsible for the transfer, readiness and ramp to production of the new products across all modules and departments involved, from Engineering, Manufacturing, Finance, Materials Eng., Industrial Eng., Planning and Information Technologies. Chip Attach (CAM) Group Leader (GL) for both CPU and Chipset factories in CR Intel Corporation November 2006  –  January 2009  (2 years 3 months) Costa Rica Chip Attach New Technologies and Product Introduction Manager for both CPU and Chipset factories. On this role, I was responsible for directly managing CAM, Deflux, AOI, Pico Rework, Micro Rework, X-ray and APL operations for both factories. I supervise 21 Engineers and Indirectly (dotted line) 10 manufacturing supervisors in the area. On this position, I was focused on Engineering activities, New Product Introduction and technical issues; having excellent networking with other departments across CR site like NPI, Q&R, Yield, Integration and MFG, as well as other Assembly modules. Managed a annual Budget of $4 to 6 million. Chip Attach Module Sr Process Engineer Intel Corporation May 1999  –  January 2006  (6 years 9 months) Costa Rica \tResponsible for the overall performance of the area as measured by: Safety, Quality, Yield, output, and cost. Responsibilities include continuous improvement and sustaining Engineering, Install and Qualification activities for new machines and to supervise three Engineering Technicians. \n\tChair for the Assembly PIT (Productivity Improvement Team) during 1.5 years. As major accomplishments are $15.7M savings on capital equipment on 2002 and first half 2003 being the best PIT across CR site. \n\tProject Coordinator for NGCAM development and implementation in CR during 2002. \n\tTo participate in several Development projects/assignment out of CR:  \n-\tLead Eng in Arizona for development of 1264 Ph2 (Tulsa) . Led the Spray flux path finding team achieving “prove of concept” and process feasibility. Defined the basic process variables, flux materials and developed the basic process for spray flux on which all new platforms at Intel are being developed for CAM module manufacturing process across the world. Received the ATD Module Engineering award June 2006 and the ATTD Divisional Award Q3’2006. \n-\tCR team leader for the No Flow Underfill (NUF) project. Assignment to Germany and ATD from July-Nov 2004. In charged of the Process and equipment qualification runs at Grohmann supplier, leading the VF team from Malaysia, Philippines and Costa Rica. Received the Quarter 4’ 2004 Assembly Capital Equipment Development/Assembly Operations Department award. \n-\tAssignment to ATD for one year during 2000 for the development and qualification of X60 platform. Costa Rica site Sr. Chemical Engineer Intel Corporation November 1998  –  May 1999  (7 months) Costa Rica \tWork in facilities as the site chemical engineer, responsible for the overall performance of some of the systems that supply facilities to the CR1 and CR3 production factories. The specific systems are Nitrogen plant and Liquid Nitrogen distribution system, Ultra Pure Water (RODI), Hydrogen pad, CO2 storage and distribution system and Waste water treatment plant. The performance of the systems was measured by: Safety, Quality of the supply and cost. Responsibilities included continuous improvement and sustaining Engineering. Direct responsibility over 8 contractor technicians as sponsor. SECC MHS Install Qual Engineer Intel Corporation May 1997  –  November 1998  (1 year 7 months) Costa Rica Responsible for installing and Qualifying the Material Handling (MHS) equipment for Intel’s first factory in CR. As a brand new factory and green site, the SECC production lines in CR1 factory were measured by installation duration, stability on the production ramp, cost and safety parameters pre-established. It also included planning of the activities, continuous improvement, certification of the equipment and troubleshooting. Direct responsibility over 2 technicians Director Assistant Industrial Support Network Federation Of Chambers of Industry of Central America August 1995  –  May 1997  (1 year 10 months) Costa Rica This network was a international cooperation program supported by the government of Canada through the International Development and Research Center of Canada (IDRC). The main responsibilities were the coordination of the program, elaboration of budget and to bring support to the industrial sector of Central America on the modernization and introduction of new technologies by strategic alliances and technology transfer with partners in Canada. Also give technical advice on specific problem solving on the manufacturing process.  \nAmong other achievements are: Speaker in conferences sponsored by the Organization of American States (OAS) in Ecuador, Trinidad & Tobago and Costa Rica on the technology transfer and Industrial support. Technical Lead Intel May 1997  – Present (18 years 4 months) Costa Rica Currently working as a Technical leader across different modules in Assembly engineering area, in charge of continuous improvement projects; Installation and qualification of new equipment and new processes; Transfer of new technologies, platforms and products; Engineering development and up-skilling; New engineers interviewing and selection; manufacturing indicators improvement like Maintenance, Conversions and Machine Availability; Technical Lead Intel May 1997  – Present (18 years 4 months) Costa Rica Currently working as a Technical leader across different modules in Assembly engineering area, in charge of continuous improvement projects; Installation and qualification of new equipment and new processes; Transfer of new technologies, platforms and products; Engineering development and up-skilling; New engineers interviewing and selection; manufacturing indicators improvement like Maintenance, Conversions and Machine Availability; Chip Attach (CAM) Assembly & Test Operations Transfer Manager Intel Corporation February 2010  –  February 2012  (2 years 1 month) Phoenix, Arizona Area Moved to Arizona in a two way temporary assignment for 2 years to work as Chip Attach Module transfer manager with Assembly and Test Operations, in charge of technology transfer between the Development site in Arizona for Assembly and Test technology and the seven factories around the world in charge of High volume manufacturing of Microprocessors. Main roles were: to create, maintain and publish schedules for the transfer of several new platforms and products; approval of process changes and responsible for the success of the new product, process and technology transfer to all seven sites and ensure new technologies and processes being developed were ready for High Volume manufacturing; Selection of early involvement engineers from the Manufacturing factories and Manage them while on assignment in Arizona. Chip Attach (CAM) Assembly & Test Operations Transfer Manager Intel Corporation February 2010  –  February 2012  (2 years 1 month) Phoenix, Arizona Area Moved to Arizona in a two way temporary assignment for 2 years to work as Chip Attach Module transfer manager with Assembly and Test Operations, in charge of technology transfer between the Development site in Arizona for Assembly and Test technology and the seven factories around the world in charge of High volume manufacturing of Microprocessors. Main roles were: to create, maintain and publish schedules for the transfer of several new platforms and products; approval of process changes and responsible for the success of the new product, process and technology transfer to all seven sites and ensure new technologies and processes being developed were ready for High Volume manufacturing; Selection of early involvement engineers from the Manufacturing factories and Manage them while on assignment in Arizona. Project manager for Chipset Assembly and Manufacturing Transfer Line Readiness Intel Corporation January 2009  –  February 2010  (1 year 2 months) Costa Rica Project Manager for the LRT (Line Readiness Team) in Assembly area and the MRT (Manufacturing Readiness Team) for the new 17 chipset products being transfer from the closing factories in Malaysia and China. Responsible for the transfer, readiness and ramp to production of the new products across all modules and departments involved, from Engineering, Manufacturing, Finance, Materials Eng., Industrial Eng., Planning and Information Technologies. Project manager for Chipset Assembly and Manufacturing Transfer Line Readiness Intel Corporation January 2009  –  February 2010  (1 year 2 months) Costa Rica Project Manager for the LRT (Line Readiness Team) in Assembly area and the MRT (Manufacturing Readiness Team) for the new 17 chipset products being transfer from the closing factories in Malaysia and China. Responsible for the transfer, readiness and ramp to production of the new products across all modules and departments involved, from Engineering, Manufacturing, Finance, Materials Eng., Industrial Eng., Planning and Information Technologies. Chip Attach (CAM) Group Leader (GL) for both CPU and Chipset factories in CR Intel Corporation November 2006  –  January 2009  (2 years 3 months) Costa Rica Chip Attach New Technologies and Product Introduction Manager for both CPU and Chipset factories. On this role, I was responsible for directly managing CAM, Deflux, AOI, Pico Rework, Micro Rework, X-ray and APL operations for both factories. I supervise 21 Engineers and Indirectly (dotted line) 10 manufacturing supervisors in the area. On this position, I was focused on Engineering activities, New Product Introduction and technical issues; having excellent networking with other departments across CR site like NPI, Q&R, Yield, Integration and MFG, as well as other Assembly modules. Managed a annual Budget of $4 to 6 million. Chip Attach (CAM) Group Leader (GL) for both CPU and Chipset factories in CR Intel Corporation November 2006  –  January 2009  (2 years 3 months) Costa Rica Chip Attach New Technologies and Product Introduction Manager for both CPU and Chipset factories. On this role, I was responsible for directly managing CAM, Deflux, AOI, Pico Rework, Micro Rework, X-ray and APL operations for both factories. I supervise 21 Engineers and Indirectly (dotted line) 10 manufacturing supervisors in the area. On this position, I was focused on Engineering activities, New Product Introduction and technical issues; having excellent networking with other departments across CR site like NPI, Q&R, Yield, Integration and MFG, as well as other Assembly modules. Managed a annual Budget of $4 to 6 million. Chip Attach Module Sr Process Engineer Intel Corporation May 1999  –  January 2006  (6 years 9 months) Costa Rica \tResponsible for the overall performance of the area as measured by: Safety, Quality, Yield, output, and cost. Responsibilities include continuous improvement and sustaining Engineering, Install and Qualification activities for new machines and to supervise three Engineering Technicians. \n\tChair for the Assembly PIT (Productivity Improvement Team) during 1.5 years. As major accomplishments are $15.7M savings on capital equipment on 2002 and first half 2003 being the best PIT across CR site. \n\tProject Coordinator for NGCAM development and implementation in CR during 2002. \n\tTo participate in several Development projects/assignment out of CR:  \n-\tLead Eng in Arizona for development of 1264 Ph2 (Tulsa) . Led the Spray flux path finding team achieving “prove of concept” and process feasibility. Defined the basic process variables, flux materials and developed the basic process for spray flux on which all new platforms at Intel are being developed for CAM module manufacturing process across the world. Received the ATD Module Engineering award June 2006 and the ATTD Divisional Award Q3’2006. \n-\tCR team leader for the No Flow Underfill (NUF) project. Assignment to Germany and ATD from July-Nov 2004. In charged of the Process and equipment qualification runs at Grohmann supplier, leading the VF team from Malaysia, Philippines and Costa Rica. Received the Quarter 4’ 2004 Assembly Capital Equipment Development/Assembly Operations Department award. \n-\tAssignment to ATD for one year during 2000 for the development and qualification of X60 platform. Chip Attach Module Sr Process Engineer Intel Corporation May 1999  –  January 2006  (6 years 9 months) Costa Rica \tResponsible for the overall performance of the area as measured by: Safety, Quality, Yield, output, and cost. Responsibilities include continuous improvement and sustaining Engineering, Install and Qualification activities for new machines and to supervise three Engineering Technicians. \n\tChair for the Assembly PIT (Productivity Improvement Team) during 1.5 years. As major accomplishments are $15.7M savings on capital equipment on 2002 and first half 2003 being the best PIT across CR site. \n\tProject Coordinator for NGCAM development and implementation in CR during 2002. \n\tTo participate in several Development projects/assignment out of CR:  \n-\tLead Eng in Arizona for development of 1264 Ph2 (Tulsa) . Led the Spray flux path finding team achieving “prove of concept” and process feasibility. Defined the basic process variables, flux materials and developed the basic process for spray flux on which all new platforms at Intel are being developed for CAM module manufacturing process across the world. Received the ATD Module Engineering award June 2006 and the ATTD Divisional Award Q3’2006. \n-\tCR team leader for the No Flow Underfill (NUF) project. Assignment to Germany and ATD from July-Nov 2004. In charged of the Process and equipment qualification runs at Grohmann supplier, leading the VF team from Malaysia, Philippines and Costa Rica. Received the Quarter 4’ 2004 Assembly Capital Equipment Development/Assembly Operations Department award. \n-\tAssignment to ATD for one year during 2000 for the development and qualification of X60 platform. Costa Rica site Sr. Chemical Engineer Intel Corporation November 1998  –  May 1999  (7 months) Costa Rica \tWork in facilities as the site chemical engineer, responsible for the overall performance of some of the systems that supply facilities to the CR1 and CR3 production factories. The specific systems are Nitrogen plant and Liquid Nitrogen distribution system, Ultra Pure Water (RODI), Hydrogen pad, CO2 storage and distribution system and Waste water treatment plant. The performance of the systems was measured by: Safety, Quality of the supply and cost. Responsibilities included continuous improvement and sustaining Engineering. Direct responsibility over 8 contractor technicians as sponsor. Costa Rica site Sr. Chemical Engineer Intel Corporation November 1998  –  May 1999  (7 months) Costa Rica \tWork in facilities as the site chemical engineer, responsible for the overall performance of some of the systems that supply facilities to the CR1 and CR3 production factories. The specific systems are Nitrogen plant and Liquid Nitrogen distribution system, Ultra Pure Water (RODI), Hydrogen pad, CO2 storage and distribution system and Waste water treatment plant. The performance of the systems was measured by: Safety, Quality of the supply and cost. Responsibilities included continuous improvement and sustaining Engineering. Direct responsibility over 8 contractor technicians as sponsor. SECC MHS Install Qual Engineer Intel Corporation May 1997  –  November 1998  (1 year 7 months) Costa Rica Responsible for installing and Qualifying the Material Handling (MHS) equipment for Intel’s first factory in CR. As a brand new factory and green site, the SECC production lines in CR1 factory were measured by installation duration, stability on the production ramp, cost and safety parameters pre-established. It also included planning of the activities, continuous improvement, certification of the equipment and troubleshooting. Direct responsibility over 2 technicians SECC MHS Install Qual Engineer Intel Corporation May 1997  –  November 1998  (1 year 7 months) Costa Rica Responsible for installing and Qualifying the Material Handling (MHS) equipment for Intel’s first factory in CR. As a brand new factory and green site, the SECC production lines in CR1 factory were measured by installation duration, stability on the production ramp, cost and safety parameters pre-established. It also included planning of the activities, continuous improvement, certification of the equipment and troubleshooting. Direct responsibility over 2 technicians Director Assistant Industrial Support Network Federation Of Chambers of Industry of Central America August 1995  –  May 1997  (1 year 10 months) Costa Rica This network was a international cooperation program supported by the government of Canada through the International Development and Research Center of Canada (IDRC). The main responsibilities were the coordination of the program, elaboration of budget and to bring support to the industrial sector of Central America on the modernization and introduction of new technologies by strategic alliances and technology transfer with partners in Canada. Also give technical advice on specific problem solving on the manufacturing process.  \nAmong other achievements are: Speaker in conferences sponsored by the Organization of American States (OAS) in Ecuador, Trinidad & Tobago and Costa Rica on the technology transfer and Industrial support. Director Assistant Industrial Support Network Federation Of Chambers of Industry of Central America August 1995  –  May 1997  (1 year 10 months) Costa Rica This network was a international cooperation program supported by the government of Canada through the International Development and Research Center of Canada (IDRC). The main responsibilities were the coordination of the program, elaboration of budget and to bring support to the industrial sector of Central America on the modernization and introduction of new technologies by strategic alliances and technology transfer with partners in Canada. Also give technical advice on specific problem solving on the manufacturing process.  \nAmong other achievements are: Speaker in conferences sponsored by the Organization of American States (OAS) in Ecuador, Trinidad & Tobago and Costa Rica on the technology transfer and Industrial support. Skills Bilingual-English/Spanis... Wide experience working... People management: 8... Very extensive... New Factory Start Up:... Facilities experience... ISO - ISO9001 and Basic... Copy Exactly... LEAN and Productivity –... MBPS – Model Based... Skills  Bilingual-English/Spanis... Wide experience working... People management: 8... Very extensive... New Factory Start Up:... Facilities experience... ISO - ISO9001 and Basic... Copy Exactly... LEAN and Productivity –... MBPS – Model Based... Bilingual-English/Spanis... Wide experience working... People management: 8... Very extensive... New Factory Start Up:... Facilities experience... ISO - ISO9001 and Basic... Copy Exactly... LEAN and Productivity –... MBPS – Model Based... Bilingual-English/Spanis... Wide experience working... People management: 8... Very extensive... New Factory Start Up:... Facilities experience... ISO - ISO9001 and Basic... Copy Exactly... LEAN and Productivity –... MBPS – Model Based... Education Universidad de Costa Rica, San José, Costa Rica Licensee, Chemical Engineering.,  Chemical Engineering. , Licensee - Professional Eng 1987  – 1993 Universidad Interamericana, Heredia, Costa Rica Master of Business Administration (MBA),  Business Administration emphasis on Industrial Management. , On Going - Not completed 2009  – 2010 Universidad Veritas, San José, Costa Rica. Bachelor of Science, Electronics Engineering,  Electrical and Electronics Engineering , Completed until Junior Year 1999  – 2000 Hustisford High School, Wisconsin USA High School Diploma,  High School/Secondary Diplomas and Certificates , Senior 1986  – 1987 Universidad de Costa Rica, San José, Costa Rica Licensee, Chemical Engineering.,  Chemical Engineering. , Licensee - Professional Eng 1987  – 1993 Universidad de Costa Rica, San José, Costa Rica Licensee, Chemical Engineering.,  Chemical Engineering. , Licensee - Professional Eng 1987  – 1993 Universidad de Costa Rica, San José, Costa Rica Licensee, Chemical Engineering.,  Chemical Engineering. , Licensee - Professional Eng 1987  – 1993 Universidad Interamericana, Heredia, Costa Rica Master of Business Administration (MBA),  Business Administration emphasis on Industrial Management. , On Going - Not completed 2009  – 2010 Universidad Interamericana, Heredia, Costa Rica Master of Business Administration (MBA),  Business Administration emphasis on Industrial Management. , On Going - Not completed 2009  – 2010 Universidad Interamericana, Heredia, Costa Rica Master of Business Administration (MBA),  Business Administration emphasis on Industrial Management. , On Going - Not completed 2009  – 2010 Universidad Veritas, San José, Costa Rica. Bachelor of Science, Electronics Engineering,  Electrical and Electronics Engineering , Completed until Junior Year 1999  – 2000 Universidad Veritas, San José, Costa Rica. Bachelor of Science, Electronics Engineering,  Electrical and Electronics Engineering , Completed until Junior Year 1999  – 2000 Universidad Veritas, San José, Costa Rica. Bachelor of Science, Electronics Engineering,  Electrical and Electronics Engineering , Completed until Junior Year 1999  – 2000 Hustisford High School, Wisconsin USA High School Diploma,  High School/Secondary Diplomas and Certificates , Senior 1986  – 1987 Hustisford High School, Wisconsin USA High School Diploma,  High School/Secondary Diplomas and Certificates , Senior 1986  – 1987 Hustisford High School, Wisconsin USA High School Diploma,  High School/Secondary Diplomas and Certificates , Senior 1986  – 1987 ", "Experience Chemical Engineer Intel Corporation Chemical Engineer Intel Corporation Chemical Engineer Intel Corporation ", "Experience Researcher Arizona State University August 2013  – Present (2 years 1 month) IT Systems & Efficiency Consultant Biltmore Eye Physicians May 2013  – Present (2 years 4 months) -Built Windows Server 2012 network based on client need for zero downtime and patient security \n-Created automated maintenance functions to eliminate network downtime \n-Did cost/benefit analyses to create a cost-saving technology plan for office functions \n-Saved Biltmore Eye Physicians an estimated $18,000+ over the course of the next three years \n-Continue to oversee and maintain network as well as provide consulting on technology purchases Graduate Intern - Facility Chemical Engineer Intel Corporation April 2015  –  August 2015  (5 months) Liquid Industrial Wastewater Treatment Facilitator & Mentor César Chavez Leadership Institute June 2013  –  June 2014  (1 year 1 month) Tempe, AZ -Taught Arizona high school juniors and seniors the importance of civil engagement and leadership \n-Encouraged students to see the value of critical thinking and advocacy for one another \n-Handled transportation logistics for up to 80 people at any given time Busboy Arcadia Tavern October 2009  –  September 2012  (3 years) Phoenix, Arizona -Kept restaurant clean, functional, and running smoothly \n-Seamless service with a smile \n-Developed excellent communication and personal skills from customer and staff interactions Researcher Arizona State University August 2013  – Present (2 years 1 month) Researcher Arizona State University August 2013  – Present (2 years 1 month) IT Systems & Efficiency Consultant Biltmore Eye Physicians May 2013  – Present (2 years 4 months) -Built Windows Server 2012 network based on client need for zero downtime and patient security \n-Created automated maintenance functions to eliminate network downtime \n-Did cost/benefit analyses to create a cost-saving technology plan for office functions \n-Saved Biltmore Eye Physicians an estimated $18,000+ over the course of the next three years \n-Continue to oversee and maintain network as well as provide consulting on technology purchases IT Systems & Efficiency Consultant Biltmore Eye Physicians May 2013  – Present (2 years 4 months) -Built Windows Server 2012 network based on client need for zero downtime and patient security \n-Created automated maintenance functions to eliminate network downtime \n-Did cost/benefit analyses to create a cost-saving technology plan for office functions \n-Saved Biltmore Eye Physicians an estimated $18,000+ over the course of the next three years \n-Continue to oversee and maintain network as well as provide consulting on technology purchases Graduate Intern - Facility Chemical Engineer Intel Corporation April 2015  –  August 2015  (5 months) Liquid Industrial Wastewater Treatment Graduate Intern - Facility Chemical Engineer Intel Corporation April 2015  –  August 2015  (5 months) Liquid Industrial Wastewater Treatment Facilitator & Mentor César Chavez Leadership Institute June 2013  –  June 2014  (1 year 1 month) Tempe, AZ -Taught Arizona high school juniors and seniors the importance of civil engagement and leadership \n-Encouraged students to see the value of critical thinking and advocacy for one another \n-Handled transportation logistics for up to 80 people at any given time Facilitator & Mentor César Chavez Leadership Institute June 2013  –  June 2014  (1 year 1 month) Tempe, AZ -Taught Arizona high school juniors and seniors the importance of civil engagement and leadership \n-Encouraged students to see the value of critical thinking and advocacy for one another \n-Handled transportation logistics for up to 80 people at any given time Busboy Arcadia Tavern October 2009  –  September 2012  (3 years) Phoenix, Arizona -Kept restaurant clean, functional, and running smoothly \n-Seamless service with a smile \n-Developed excellent communication and personal skills from customer and staff interactions Busboy Arcadia Tavern October 2009  –  September 2012  (3 years) Phoenix, Arizona -Kept restaurant clean, functional, and running smoothly \n-Seamless service with a smile \n-Developed excellent communication and personal skills from customer and staff interactions Skills Matlab Data Analysis Research Microsoft Office Six Sigma Leadership Time Management Chemistry Technical Writing Materials Science Engineering Statistics Chemical Engineering Customer Service Communication Skills  Matlab Data Analysis Research Microsoft Office Six Sigma Leadership Time Management Chemistry Technical Writing Materials Science Engineering Statistics Chemical Engineering Customer Service Communication Matlab Data Analysis Research Microsoft Office Six Sigma Leadership Time Management Chemistry Technical Writing Materials Science Engineering Statistics Chemical Engineering Customer Service Communication Matlab Data Analysis Research Microsoft Office Six Sigma Leadership Time Management Chemistry Technical Writing Materials Science Engineering Statistics Chemical Engineering Customer Service Communication Education Ira A. Fulton Schools of Engineering at Arizona State University BSE,  Chemical Engineering 2012  – 2015 Activities and Societies:  American Institute of Chemical Engineers ,  Tau Beta Pi (Volunteering Chair ,  Vice President Elect) ,  and The Printing Press (ASU 3D Printing club ,  Co-founder & Secretary) Arizona State University Master of Science (MS),  Chemical Engineering 2013  – 2016 Part of ASU's competitive 4+1 program for an accelerated Master's Degree Ira A. Fulton Schools of Engineering at Arizona State University BSE,  Chemical Engineering 2012  – 2015 Activities and Societies:  American Institute of Chemical Engineers ,  Tau Beta Pi (Volunteering Chair ,  Vice President Elect) ,  and The Printing Press (ASU 3D Printing club ,  Co-founder & Secretary) Ira A. Fulton Schools of Engineering at Arizona State University BSE,  Chemical Engineering 2012  – 2015 Activities and Societies:  American Institute of Chemical Engineers ,  Tau Beta Pi (Volunteering Chair ,  Vice President Elect) ,  and The Printing Press (ASU 3D Printing club ,  Co-founder & Secretary) Ira A. Fulton Schools of Engineering at Arizona State University BSE,  Chemical Engineering 2012  – 2015 Activities and Societies:  American Institute of Chemical Engineers ,  Tau Beta Pi (Volunteering Chair ,  Vice President Elect) ,  and The Printing Press (ASU 3D Printing club ,  Co-founder & Secretary) Arizona State University Master of Science (MS),  Chemical Engineering 2013  – 2016 Part of ASU's competitive 4+1 program for an accelerated Master's Degree Arizona State University Master of Science (MS),  Chemical Engineering 2013  – 2016 Part of ASU's competitive 4+1 program for an accelerated Master's Degree Arizona State University Master of Science (MS),  Chemical Engineering 2013  – 2016 Part of ASU's competitive 4+1 program for an accelerated Master's Degree ", "Languages French French French Skills Chemical Engineering Data Analysis Problem Solving Troubleshooting Microsoft Excel Water Engineering Manufacturing Environmental Compliance Semiconductors Environmental Awareness Process Engineering Energy Renewable Energy Skills  Chemical Engineering Data Analysis Problem Solving Troubleshooting Microsoft Excel Water Engineering Manufacturing Environmental Compliance Semiconductors Environmental Awareness Process Engineering Energy Renewable Energy Chemical Engineering Data Analysis Problem Solving Troubleshooting Microsoft Excel Water Engineering Manufacturing Environmental Compliance Semiconductors Environmental Awareness Process Engineering Energy Renewable Energy Chemical Engineering Data Analysis Problem Solving Troubleshooting Microsoft Excel Water Engineering Manufacturing Environmental Compliance Semiconductors Environmental Awareness Process Engineering Energy Renewable Energy ", "Summary Experienced Electrical/Electronic Technician. Proven track record in Project Management (not capital projects) and Lean implementation processes. Experienced People manager and motivator Specialties:Maintenance Scheduling. Waste elimination (Lean implementation). People Management Summary Experienced Electrical/Electronic Technician. Proven track record in Project Management (not capital projects) and Lean implementation processes. Experienced People manager and motivator Specialties:Maintenance Scheduling. Waste elimination (Lean implementation). People Management Experienced Electrical/Electronic Technician. Proven track record in Project Management (not capital projects) and Lean implementation processes. Experienced People manager and motivator Specialties:Maintenance Scheduling. Waste elimination (Lean implementation). People Management Experienced Electrical/Electronic Technician. Proven track record in Project Management (not capital projects) and Lean implementation processes. Experienced People manager and motivator Specialties:Maintenance Scheduling. Waste elimination (Lean implementation). People Management Experience Continuous Improvement Manager Global Closure Systems April 2015  – Present (5 months) Norwich, United Kingdom Gas and Chemical Engineer Intel Corporation August 2011  –  December 2014  (3 years 5 months) Manufacturing Engineering Supervisor Flakt Woods November 2010  –  July 2011  (9 months) Managing a team of 5 Manufacturing Engineers responsible for the trouble shooting, process flow, design of new manufacturing lines. Change Initiative, 5S, and the introduction of lean manufacturing. \nPromoted to the Supervisor after 6 weeks due to demonstrated lean manufacturing and engineering skills SENIOR EQUIPMENT SUPERVISOR World leading semi-conductor manufacturer January 2007  –  June 2009  (2 years 6 months) Deputised for Shift/Production Manager managing a shift of 180 people, leading the daily operations meeting and setting priorities for the factory for the day. \nLed five Lean Kaizon projects to eliminate waste and improve efficiency which resulted in the reduction in headcount and material used and improved availability of production tools - €2.7m cost savings. \nManaged the Lithography Quality Team to ensure rapid response to any quality event and also to ensure that corrective action was put in place. Senior Equipment Supervisor INTEL IRELAND March 2000  –  June 2009  (9 years 4 months) Maintenance Supervisor Intel 2000  –  2009  (9 years) EQUIPMENT SUPERVISOR Intel Ireland January 2004  –  January 2007  (3 years 1 month) Controlled all the Lithography Equipment in the Fabrication (Fab) Unit (246 tool sets) during a 12-hour shift, delivering the required availability and set correct priorities for equipment repairs. \nDesigned and delivered equipment maintenance training programmes ensuring that Intel had the required skills to the correct standards. These programmes were part of the maintenance technicians' development programme. \nIdentified technicians from Operations for transfer into the Equipment Team from the five key areas within the Fab, to maintain correct manning and skill levels. \nPerformed complete people management duties for a shift of 25 personnel, which included promotion, evaluation and awarding of percentage pay rise, discipline up to and including dismissal, attendance, safety management and long term absence management.  \nLed the Emergency Response Team (ERT), controlled 40 ERT personnel on a shift to respond to any safety incident including factory evacuations; chemical & fire incidences. First Aid trained. Equipment Technician Intel Ireland March 2000  –  December 2003  (3 years 10 months) Promoted three times in three years from G45 to G48 (highest technical grade). \nServiced, repaired and upgraded the micrascan ii and iii to maintain quality. \nDeveloped a strong understanding and operational knowledge in Robotics, Optical Control; Electro/Mechanical, Pneumatics and Software. \nCoordinated the maintenance activity of up to eight technicians in the cluster with responsibility for Quality Control of maintenance tasks and minimising downtime for periodic maintenance. Network Support Specialist DELL COMPUTERS November 1999  –  March 2000  (5 months) Supported business customer's networks through telephone and occasional field support on the NT4 Server platform. FOUNDING PARTNER JDS SERVICES December 1997  –  November 1999  (2 years) Installed Central Heating Systems, Compressed air line systems, water purification systems and carried out routine maintenance and repairs to industry standards. \nCertified by Grant and Firebird as Regional maintenance providers in Kildare and Offaly areas. \nPerformed all recruitment, people management, rostering and route planning for the company. \nControlled the stock and prepared the three monthly company accounts and for the accountant and audit. Instrument and Electrical Supervisor BAE Systems March 1993  –  December 1997  (4 years 10 months) Responsible for the Scheduled Servicing of Tornado Aircraft in the Phased Maintenance Facility \nAchieved two awards for Innovation and a letter of commendation from the Maintenance Squadron Commander. \nDeputised for Tornado Phase Dock Superintendent during extended absence covering two shifts totalling c. 80 people. INSTRUMENT AND ELECTRICAL TECHNICIAN BAE Systems August 1990  –  March 1993  (2 years 8 months) Serviced Tornado Aircraft (ADV IDS) for instrument and electrical systems to include maintenance, repair, modification and upgrade and received recognition awards from the SMTM for innovation. Aircraft Technician Electrical (Corporal) Royal Air Force May 1979  –  August 1990  (11 years 4 months) Delivered all aspects of Aircraft Electrical and Instrument Maintenance, including flight line maintenance; scheduled maintenance; aircraft modifications and battle damage repairs.  \nReceived letter of commendation from the Officer Commanding for IR Jammer Installation on Wessex Aircraft for his knowledge, expertise and particular application to the detail of the task. \nAcquired expertise to the highest standard in Jaguar GR1 1st and 2nd line maintenance, Wessex 1st, 2nd and 3rd line maintenance and Tornado GR1 3rd line modification and mid life update. Motor Vehicle Apprenticeship LONGS GARAGE August 1977  –  May 1979  (1 year 10 months) Motor Vehicle Apprenticeship Continuous Improvement Manager Global Closure Systems April 2015  – Present (5 months) Norwich, United Kingdom Continuous Improvement Manager Global Closure Systems April 2015  – Present (5 months) Norwich, United Kingdom Gas and Chemical Engineer Intel Corporation August 2011  –  December 2014  (3 years 5 months) Gas and Chemical Engineer Intel Corporation August 2011  –  December 2014  (3 years 5 months) Manufacturing Engineering Supervisor Flakt Woods November 2010  –  July 2011  (9 months) Managing a team of 5 Manufacturing Engineers responsible for the trouble shooting, process flow, design of new manufacturing lines. Change Initiative, 5S, and the introduction of lean manufacturing. \nPromoted to the Supervisor after 6 weeks due to demonstrated lean manufacturing and engineering skills Manufacturing Engineering Supervisor Flakt Woods November 2010  –  July 2011  (9 months) Managing a team of 5 Manufacturing Engineers responsible for the trouble shooting, process flow, design of new manufacturing lines. Change Initiative, 5S, and the introduction of lean manufacturing. \nPromoted to the Supervisor after 6 weeks due to demonstrated lean manufacturing and engineering skills SENIOR EQUIPMENT SUPERVISOR World leading semi-conductor manufacturer January 2007  –  June 2009  (2 years 6 months) Deputised for Shift/Production Manager managing a shift of 180 people, leading the daily operations meeting and setting priorities for the factory for the day. \nLed five Lean Kaizon projects to eliminate waste and improve efficiency which resulted in the reduction in headcount and material used and improved availability of production tools - €2.7m cost savings. \nManaged the Lithography Quality Team to ensure rapid response to any quality event and also to ensure that corrective action was put in place. SENIOR EQUIPMENT SUPERVISOR World leading semi-conductor manufacturer January 2007  –  June 2009  (2 years 6 months) Deputised for Shift/Production Manager managing a shift of 180 people, leading the daily operations meeting and setting priorities for the factory for the day. \nLed five Lean Kaizon projects to eliminate waste and improve efficiency which resulted in the reduction in headcount and material used and improved availability of production tools - €2.7m cost savings. \nManaged the Lithography Quality Team to ensure rapid response to any quality event and also to ensure that corrective action was put in place. Senior Equipment Supervisor INTEL IRELAND March 2000  –  June 2009  (9 years 4 months) Senior Equipment Supervisor INTEL IRELAND March 2000  –  June 2009  (9 years 4 months) Maintenance Supervisor Intel 2000  –  2009  (9 years) Maintenance Supervisor Intel 2000  –  2009  (9 years) EQUIPMENT SUPERVISOR Intel Ireland January 2004  –  January 2007  (3 years 1 month) Controlled all the Lithography Equipment in the Fabrication (Fab) Unit (246 tool sets) during a 12-hour shift, delivering the required availability and set correct priorities for equipment repairs. \nDesigned and delivered equipment maintenance training programmes ensuring that Intel had the required skills to the correct standards. These programmes were part of the maintenance technicians' development programme. \nIdentified technicians from Operations for transfer into the Equipment Team from the five key areas within the Fab, to maintain correct manning and skill levels. \nPerformed complete people management duties for a shift of 25 personnel, which included promotion, evaluation and awarding of percentage pay rise, discipline up to and including dismissal, attendance, safety management and long term absence management.  \nLed the Emergency Response Team (ERT), controlled 40 ERT personnel on a shift to respond to any safety incident including factory evacuations; chemical & fire incidences. First Aid trained. EQUIPMENT SUPERVISOR Intel Ireland January 2004  –  January 2007  (3 years 1 month) Controlled all the Lithography Equipment in the Fabrication (Fab) Unit (246 tool sets) during a 12-hour shift, delivering the required availability and set correct priorities for equipment repairs. \nDesigned and delivered equipment maintenance training programmes ensuring that Intel had the required skills to the correct standards. These programmes were part of the maintenance technicians' development programme. \nIdentified technicians from Operations for transfer into the Equipment Team from the five key areas within the Fab, to maintain correct manning and skill levels. \nPerformed complete people management duties for a shift of 25 personnel, which included promotion, evaluation and awarding of percentage pay rise, discipline up to and including dismissal, attendance, safety management and long term absence management.  \nLed the Emergency Response Team (ERT), controlled 40 ERT personnel on a shift to respond to any safety incident including factory evacuations; chemical & fire incidences. First Aid trained. Equipment Technician Intel Ireland March 2000  –  December 2003  (3 years 10 months) Promoted three times in three years from G45 to G48 (highest technical grade). \nServiced, repaired and upgraded the micrascan ii and iii to maintain quality. \nDeveloped a strong understanding and operational knowledge in Robotics, Optical Control; Electro/Mechanical, Pneumatics and Software. \nCoordinated the maintenance activity of up to eight technicians in the cluster with responsibility for Quality Control of maintenance tasks and minimising downtime for periodic maintenance. Equipment Technician Intel Ireland March 2000  –  December 2003  (3 years 10 months) Promoted three times in three years from G45 to G48 (highest technical grade). \nServiced, repaired and upgraded the micrascan ii and iii to maintain quality. \nDeveloped a strong understanding and operational knowledge in Robotics, Optical Control; Electro/Mechanical, Pneumatics and Software. \nCoordinated the maintenance activity of up to eight technicians in the cluster with responsibility for Quality Control of maintenance tasks and minimising downtime for periodic maintenance. Network Support Specialist DELL COMPUTERS November 1999  –  March 2000  (5 months) Supported business customer's networks through telephone and occasional field support on the NT4 Server platform. Network Support Specialist DELL COMPUTERS November 1999  –  March 2000  (5 months) Supported business customer's networks through telephone and occasional field support on the NT4 Server platform. FOUNDING PARTNER JDS SERVICES December 1997  –  November 1999  (2 years) Installed Central Heating Systems, Compressed air line systems, water purification systems and carried out routine maintenance and repairs to industry standards. \nCertified by Grant and Firebird as Regional maintenance providers in Kildare and Offaly areas. \nPerformed all recruitment, people management, rostering and route planning for the company. \nControlled the stock and prepared the three monthly company accounts and for the accountant and audit. FOUNDING PARTNER JDS SERVICES December 1997  –  November 1999  (2 years) Installed Central Heating Systems, Compressed air line systems, water purification systems and carried out routine maintenance and repairs to industry standards. \nCertified by Grant and Firebird as Regional maintenance providers in Kildare and Offaly areas. \nPerformed all recruitment, people management, rostering and route planning for the company. \nControlled the stock and prepared the three monthly company accounts and for the accountant and audit. Instrument and Electrical Supervisor BAE Systems March 1993  –  December 1997  (4 years 10 months) Responsible for the Scheduled Servicing of Tornado Aircraft in the Phased Maintenance Facility \nAchieved two awards for Innovation and a letter of commendation from the Maintenance Squadron Commander. \nDeputised for Tornado Phase Dock Superintendent during extended absence covering two shifts totalling c. 80 people. Instrument and Electrical Supervisor BAE Systems March 1993  –  December 1997  (4 years 10 months) Responsible for the Scheduled Servicing of Tornado Aircraft in the Phased Maintenance Facility \nAchieved two awards for Innovation and a letter of commendation from the Maintenance Squadron Commander. \nDeputised for Tornado Phase Dock Superintendent during extended absence covering two shifts totalling c. 80 people. INSTRUMENT AND ELECTRICAL TECHNICIAN BAE Systems August 1990  –  March 1993  (2 years 8 months) Serviced Tornado Aircraft (ADV IDS) for instrument and electrical systems to include maintenance, repair, modification and upgrade and received recognition awards from the SMTM for innovation. INSTRUMENT AND ELECTRICAL TECHNICIAN BAE Systems August 1990  –  March 1993  (2 years 8 months) Serviced Tornado Aircraft (ADV IDS) for instrument and electrical systems to include maintenance, repair, modification and upgrade and received recognition awards from the SMTM for innovation. Aircraft Technician Electrical (Corporal) Royal Air Force May 1979  –  August 1990  (11 years 4 months) Delivered all aspects of Aircraft Electrical and Instrument Maintenance, including flight line maintenance; scheduled maintenance; aircraft modifications and battle damage repairs.  \nReceived letter of commendation from the Officer Commanding for IR Jammer Installation on Wessex Aircraft for his knowledge, expertise and particular application to the detail of the task. \nAcquired expertise to the highest standard in Jaguar GR1 1st and 2nd line maintenance, Wessex 1st, 2nd and 3rd line maintenance and Tornado GR1 3rd line modification and mid life update. Aircraft Technician Electrical (Corporal) Royal Air Force May 1979  –  August 1990  (11 years 4 months) Delivered all aspects of Aircraft Electrical and Instrument Maintenance, including flight line maintenance; scheduled maintenance; aircraft modifications and battle damage repairs.  \nReceived letter of commendation from the Officer Commanding for IR Jammer Installation on Wessex Aircraft for his knowledge, expertise and particular application to the detail of the task. \nAcquired expertise to the highest standard in Jaguar GR1 1st and 2nd line maintenance, Wessex 1st, 2nd and 3rd line maintenance and Tornado GR1 3rd line modification and mid life update. Motor Vehicle Apprenticeship LONGS GARAGE August 1977  –  May 1979  (1 year 10 months) Motor Vehicle Apprenticeship Motor Vehicle Apprenticeship LONGS GARAGE August 1977  –  May 1979  (1 year 10 months) Motor Vehicle Apprenticeship Skills Lean Manufacturing Manufacturing Fabrication Electronics SPC Process Improvement Reliability Equipment Maintenance Troubleshooting Failure Analysis Semiconductors Continuous Improvement 5S Engineering Semiconductor Industry Design of Experiments Process Engineering Root Cause Analysis Six Sigma Metal Fabrication Electricians Cross-functional Team... Project Management Program Management Manufacturing... Engineering Management See 11+     See less Skills  Lean Manufacturing Manufacturing Fabrication Electronics SPC Process Improvement Reliability Equipment Maintenance Troubleshooting Failure Analysis Semiconductors Continuous Improvement 5S Engineering Semiconductor Industry Design of Experiments Process Engineering Root Cause Analysis Six Sigma Metal Fabrication Electricians Cross-functional Team... Project Management Program Management Manufacturing... Engineering Management See 11+     See less Lean Manufacturing Manufacturing Fabrication Electronics SPC Process Improvement Reliability Equipment Maintenance Troubleshooting Failure Analysis Semiconductors Continuous Improvement 5S Engineering Semiconductor Industry Design of Experiments Process Engineering Root Cause Analysis Six Sigma Metal Fabrication Electricians Cross-functional Team... Project Management Program Management Manufacturing... Engineering Management See 11+     See less Lean Manufacturing Manufacturing Fabrication Electronics SPC Process Improvement Reliability Equipment Maintenance Troubleshooting Failure Analysis Semiconductors Continuous Improvement 5S Engineering Semiconductor Industry Design of Experiments Process Engineering Root Cause Analysis Six Sigma Metal Fabrication Electricians Cross-functional Team... Project Management Program Management Manufacturing... Engineering Management See 11+     See less Education ILAX Foundation,  Prince 2 Project Management 2010  – 2010 Self Study and exam due at British Consulate University of Limerick Diploma,  Quality Management Systems Lean 2009  – 2010 Exams In May2010 Dublin Institute of Technology BA Bus (Hons),  People Management 2004  – 2007 2:1 pass ILAX Foundation,  Prince 2 Project Management 2010  – 2010 Self Study and exam due at British Consulate ILAX Foundation,  Prince 2 Project Management 2010  – 2010 Self Study and exam due at British Consulate ILAX Foundation,  Prince 2 Project Management 2010  – 2010 Self Study and exam due at British Consulate University of Limerick Diploma,  Quality Management Systems Lean 2009  – 2010 Exams In May2010 University of Limerick Diploma,  Quality Management Systems Lean 2009  – 2010 Exams In May2010 University of Limerick Diploma,  Quality Management Systems Lean 2009  – 2010 Exams In May2010 Dublin Institute of Technology BA Bus (Hons),  People Management 2004  – 2007 2:1 pass Dublin Institute of Technology BA Bus (Hons),  People Management 2004  – 2007 2:1 pass Dublin Institute of Technology BA Bus (Hons),  People Management 2004  – 2007 2:1 pass ", "Skills Chemical Engineering Design of Experiments Process Simulation Characterization Engineering Matlab Surface Chemistry Heat Transfer Six Sigma Chemistry Spectroscopy Product Development Electronics CFD Data Analysis Project Management Solidworks Mathematical Modeling Software Development High Performance... See 5+     See less Skills  Chemical Engineering Design of Experiments Process Simulation Characterization Engineering Matlab Surface Chemistry Heat Transfer Six Sigma Chemistry Spectroscopy Product Development Electronics CFD Data Analysis Project Management Solidworks Mathematical Modeling Software Development High Performance... See 5+     See less Chemical Engineering Design of Experiments Process Simulation Characterization Engineering Matlab Surface Chemistry Heat Transfer Six Sigma Chemistry Spectroscopy Product Development Electronics CFD Data Analysis Project Management Solidworks Mathematical Modeling Software Development High Performance... See 5+     See less Chemical Engineering Design of Experiments Process Simulation Characterization Engineering Matlab Surface Chemistry Heat Transfer Six Sigma Chemistry Spectroscopy Product Development Electronics CFD Data Analysis Project Management Solidworks Mathematical Modeling Software Development High Performance... See 5+     See less ", "Skills Insurance Engineering Environmental Research Litigation Manufacturing Semiconductors Litigation Support Commercial Litigation Legal Research Civil Litigation Writing Contract Negotiations Problem Solving Contract Negotiation Legal Writing Product Liability Appeals Personal Injury Licensing Trials Courts Corporate Law Westlaw Process Simulation Chemical Engineering Environmental Awareness See 12+     See less Skills  Insurance Engineering Environmental Research Litigation Manufacturing Semiconductors Litigation Support Commercial Litigation Legal Research Civil Litigation Writing Contract Negotiations Problem Solving Contract Negotiation Legal Writing Product Liability Appeals Personal Injury Licensing Trials Courts Corporate Law Westlaw Process Simulation Chemical Engineering Environmental Awareness See 12+     See less Insurance Engineering Environmental Research Litigation Manufacturing Semiconductors Litigation Support Commercial Litigation Legal Research Civil Litigation Writing Contract Negotiations Problem Solving Contract Negotiation Legal Writing Product Liability Appeals Personal Injury Licensing Trials Courts Corporate Law Westlaw Process Simulation Chemical Engineering Environmental Awareness See 12+     See less Insurance Engineering Environmental Research Litigation Manufacturing Semiconductors Litigation Support Commercial Litigation Legal Research Civil Litigation Writing Contract Negotiations Problem Solving Contract Negotiation Legal Writing Product Liability Appeals Personal Injury Licensing Trials Courts Corporate Law Westlaw Process Simulation Chemical Engineering Environmental Awareness See 12+     See less Education The University of New Mexico School of Law J.D. 2000  – 2003 Texas Tech University B.S.,  Chemical Engineering 1992  – 1997 Los Alamos High School High School Diploma 1989  – 1992 The University of New Mexico School of Law J.D. 2000  – 2003 The University of New Mexico School of Law J.D. 2000  – 2003 The University of New Mexico School of Law J.D. 2000  – 2003 Texas Tech University B.S.,  Chemical Engineering 1992  – 1997 Texas Tech University B.S.,  Chemical Engineering 1992  – 1997 Texas Tech University B.S.,  Chemical Engineering 1992  – 1997 Los Alamos High School High School Diploma 1989  – 1992 Los Alamos High School High School Diploma 1989  – 1992 Los Alamos High School High School Diploma 1989  – 1992 ", "Experience Facility Chemical Engineer Intel Corporation December 2005  – Present (9 years 9 months) Facility Chemical Engineer Intel Corporation December 2005  – Present (9 years 9 months) Facility Chemical Engineer Intel Corporation December 2005  – Present (9 years 9 months) Education Bsc,  Chemical & Biology Bsc,  Chemical & Biology Bsc,  Chemical & Biology Bsc,  Chemical & Biology ", "Experience Chemical Engineer Intel Corporation July 2010  – Present (5 years 2 months) Environmental Intern Genie Industries March 2008  –  September 2008  (7 months) Apprenticeships in Science and Engineering Welch Allyn June 2004  –  September 2004  (4 months) Chemical Engineer Intel Corporation July 2010  – Present (5 years 2 months) Chemical Engineer Intel Corporation July 2010  – Present (5 years 2 months) Environmental Intern Genie Industries March 2008  –  September 2008  (7 months) Environmental Intern Genie Industries March 2008  –  September 2008  (7 months) Apprenticeships in Science and Engineering Welch Allyn June 2004  –  September 2004  (4 months) Apprenticeships in Science and Engineering Welch Allyn June 2004  –  September 2004  (4 months) Skills Process Simulation Chemical Engineering Engineering Process Engineering Design of Experiments Six Sigma Skills  Process Simulation Chemical Engineering Engineering Process Engineering Design of Experiments Six Sigma Process Simulation Chemical Engineering Engineering Process Engineering Design of Experiments Six Sigma Process Simulation Chemical Engineering Engineering Process Engineering Design of Experiments Six Sigma Education Oregon State University Bachelor of Science (BS),  Chemical Engineering 2005  – 2010 Oregon State University Bachelor of Science (BS),  Chemical Engineering 2005  – 2010 Oregon State University Bachelor of Science (BS),  Chemical Engineering 2005  – 2010 Oregon State University Bachelor of Science (BS),  Chemical Engineering 2005  – 2010 ", "Experience Reliability Engineer Chevron Phillips Chemical Company October 2012  – Present (2 years 11 months) Borger, Texas Tooling Design Engineer BWXT Pantex May 2008  –  October 2012  (4 years 6 months) Design and analyze tooling systems for weapon assembly/disassembly operations. Bulk Chemical Engineer Intel Corporation June 2005  –  October 2007  (2 years 5 months) Oversee commissioning and startup of new tools, statistical process monitoring and report out of chemical systems, systems modification, operations training, and documentation support. Perform specification review and cost analysis on new install and system modification projects. Perform chemical supplier audits on manufacturing and controls. Investigation of incoming process chemical stability via observation, experimentation, and structured problem solving processes. Set statistical control limits for chemical trace metal analysis and liquid particle counters using JMP software. Support the factory with installation, maintenance, and troubleshooting of chemical delivery systems. Reliability Engineer Chevron Phillips Chemical Company October 2012  – Present (2 years 11 months) Borger, Texas Reliability Engineer Chevron Phillips Chemical Company October 2012  – Present (2 years 11 months) Borger, Texas Tooling Design Engineer BWXT Pantex May 2008  –  October 2012  (4 years 6 months) Design and analyze tooling systems for weapon assembly/disassembly operations. Tooling Design Engineer BWXT Pantex May 2008  –  October 2012  (4 years 6 months) Design and analyze tooling systems for weapon assembly/disassembly operations. Bulk Chemical Engineer Intel Corporation June 2005  –  October 2007  (2 years 5 months) Oversee commissioning and startup of new tools, statistical process monitoring and report out of chemical systems, systems modification, operations training, and documentation support. Perform specification review and cost analysis on new install and system modification projects. Perform chemical supplier audits on manufacturing and controls. Investigation of incoming process chemical stability via observation, experimentation, and structured problem solving processes. Set statistical control limits for chemical trace metal analysis and liquid particle counters using JMP software. Support the factory with installation, maintenance, and troubleshooting of chemical delivery systems. Bulk Chemical Engineer Intel Corporation June 2005  –  October 2007  (2 years 5 months) Oversee commissioning and startup of new tools, statistical process monitoring and report out of chemical systems, systems modification, operations training, and documentation support. Perform specification review and cost analysis on new install and system modification projects. Perform chemical supplier audits on manufacturing and controls. Investigation of incoming process chemical stability via observation, experimentation, and structured problem solving processes. Set statistical control limits for chemical trace metal analysis and liquid particle counters using JMP software. Support the factory with installation, maintenance, and troubleshooting of chemical delivery systems. Skills Pro Engineer MathCAD Mechanical Engineering Design for Manufacturing ANSYS Engineering Machine Design Project Engineering CAD Engineering Management Finite Element Analysis Heat Transfer Root Cause Analysis Manufacturing Process Engineering Skills  Pro Engineer MathCAD Mechanical Engineering Design for Manufacturing ANSYS Engineering Machine Design Project Engineering CAD Engineering Management Finite Element Analysis Heat Transfer Root Cause Analysis Manufacturing Process Engineering Pro Engineer MathCAD Mechanical Engineering Design for Manufacturing ANSYS Engineering Machine Design Project Engineering CAD Engineering Management Finite Element Analysis Heat Transfer Root Cause Analysis Manufacturing Process Engineering Pro Engineer MathCAD Mechanical Engineering Design for Manufacturing ANSYS Engineering Machine Design Project Engineering CAD Engineering Management Finite Element Analysis Heat Transfer Root Cause Analysis Manufacturing Process Engineering Education The University of New Mexico Master of Science,  Mechanical Engineering 2004  – 2006 Washington State University Mechanical Engineering 1999  – 2003 The University of New Mexico Master of Science,  Mechanical Engineering 2004  – 2006 The University of New Mexico Master of Science,  Mechanical Engineering 2004  – 2006 The University of New Mexico Master of Science,  Mechanical Engineering 2004  – 2006 Washington State University Mechanical Engineering 1999  – 2003 Washington State University Mechanical Engineering 1999  – 2003 Washington State University Mechanical Engineering 1999  – 2003 ", "Summary Manage information security for Garmin International and associated companies. \n \nGCIA, GCIH, GCFA, CISSP Summary Manage information security for Garmin International and associated companies. \n \nGCIA, GCIH, GCFA, CISSP Manage information security for Garmin International and associated companies. \n \nGCIA, GCIH, GCFA, CISSP Manage information security for Garmin International and associated companies. \n \nGCIA, GCIH, GCFA, CISSP Experience Information Security Manager Garmin October 2007  – Present (7 years 11 months) Olathe, KS Security Operation Center Team Lead Intel Corporation May 2003  –  October 2007  (4 years 6 months) UNIX System Administrator Intel Corporation February 2000  –  June 2003  (3 years 5 months) Chemical Engineer Intel Corporation December 1996  –  January 2000  (3 years 2 months) Information Security Manager Garmin October 2007  – Present (7 years 11 months) Olathe, KS Information Security Manager Garmin October 2007  – Present (7 years 11 months) Olathe, KS Security Operation Center Team Lead Intel Corporation May 2003  –  October 2007  (4 years 6 months) Security Operation Center Team Lead Intel Corporation May 2003  –  October 2007  (4 years 6 months) UNIX System Administrator Intel Corporation February 2000  –  June 2003  (3 years 5 months) UNIX System Administrator Intel Corporation February 2000  –  June 2003  (3 years 5 months) Chemical Engineer Intel Corporation December 1996  –  January 2000  (3 years 2 months) Chemical Engineer Intel Corporation December 1996  –  January 2000  (3 years 2 months) Languages   Skills Information Security CISSP IDS Penetration Testing PKI ITIL TCP/IP Perl Bash IPS Digital Certificates Tcpdump Nessus Metasploit Nmap Snort Backtrack ArcSight Sourcefire Wireshark ruby Corporate Finance SSL SSL Certificates ITIL Certified Scrum Vendor Management Performance Management Risk Management Budget Management Information Security... See 16+     See less Skills  Information Security CISSP IDS Penetration Testing PKI ITIL TCP/IP Perl Bash IPS Digital Certificates Tcpdump Nessus Metasploit Nmap Snort Backtrack ArcSight Sourcefire Wireshark ruby Corporate Finance SSL SSL Certificates ITIL Certified Scrum Vendor Management Performance Management Risk Management Budget Management Information Security... See 16+     See less Information Security CISSP IDS Penetration Testing PKI ITIL TCP/IP Perl Bash IPS Digital Certificates Tcpdump Nessus Metasploit Nmap Snort Backtrack ArcSight Sourcefire Wireshark ruby Corporate Finance SSL SSL Certificates ITIL Certified Scrum Vendor Management Performance Management Risk Management Budget Management Information Security... See 16+     See less Information Security CISSP IDS Penetration Testing PKI ITIL TCP/IP Perl Bash IPS Digital Certificates Tcpdump Nessus Metasploit Nmap Snort Backtrack ArcSight Sourcefire Wireshark ruby Corporate Finance SSL SSL Certificates ITIL Certified Scrum Vendor Management Performance Management Risk Management Budget Management Information Security... See 16+     See less Education University of Kansas - Graduate School of Business MBA,  MIS ,  Finance , 4.0 2006  – 2009 MIS and Corporate Finance The University of Kansas BS,  Chemical Engineering , 3.3 1991  – 1996 University of Kansas - Graduate School of Business MBA,  MIS ,  Finance , 4.0 2006  – 2009 MIS and Corporate Finance University of Kansas - Graduate School of Business MBA,  MIS ,  Finance , 4.0 2006  – 2009 MIS and Corporate Finance University of Kansas - Graduate School of Business MBA,  MIS ,  Finance , 4.0 2006  – 2009 MIS and Corporate Finance The University of Kansas BS,  Chemical Engineering , 3.3 1991  – 1996 The University of Kansas BS,  Chemical Engineering , 3.3 1991  – 1996 The University of Kansas BS,  Chemical Engineering , 3.3 1991  – 1996 ", "Summary I'm Looking for a job that able me to apply and practice my qualification and experience in order to pursue an opportunity to better serve and contribute to the growth of the company. Summary I'm Looking for a job that able me to apply and practice my qualification and experience in order to pursue an opportunity to better serve and contribute to the growth of the company. I'm Looking for a job that able me to apply and practice my qualification and experience in order to pursue an opportunity to better serve and contribute to the growth of the company. I'm Looking for a job that able me to apply and practice my qualification and experience in order to pursue an opportunity to better serve and contribute to the growth of the company. Experience Facilities Chemical Engineer Intel Corporation February 2013  – Present (2 years 7 months) •Overseeing the planning, design, reconfiguration, construction, maintenance and alteration of facility chemical system which includes Gases, Waste Water Treatment (WWT) and Reverse Osmosis De-Ionized (RODI) system. \n•Provide facilities engineering leadership to the site organizations in support of safety, reliability, quality, environmental and cost objective \n•Owning safety within area of influence \n•Ensuring systems operate reliably to avoid manufacturing/facility (or operations) impacts by meeting uptime goals \n•Overlooking projects to meet design criteria, scope, budget, and schedule \n•\tOversight of planning, design, reconfiguration, construction, maintenance, and modifications to equipment, machinery, facilities systems, buildings, and structures as required to support business requirements \n•Delivering operational efficiency, maintenance, testing and commissioning solutions \n•\tEffective collaboration with construction and operations teams to coordinate work in the field \n•Identify and implement opportunities to achieve lowest cost of ownership to key stakeholders while maintaining reliability.  \n•Results are delivered through the application of engineering skills and tools \n•Systematic problem solving and perform statistical validation of system performance \n•Collaboration with the Site Facility management team, suppliers, key stakeholders and through in-depth understanding of the operating systems to determine and ensure compliance to existing standards, specifications, building codes, and processes. Product Development Graduate Engineer Philips Lumileds April 2012  –  February 2013  (11 months) •Contribute ideas and works in team in developing new products.  \n•Accountable for the successful completion of engineering projects and ensure the effectiveness of communication on assigned projects between all disciplines and all other project participants. \n•Responsible for planning, scheduling, conducting and coordinating the technical and management aspects of projects. Facilities Chemical Engineer Intel Corporation February 2013  – Present (2 years 7 months) •Overseeing the planning, design, reconfiguration, construction, maintenance and alteration of facility chemical system which includes Gases, Waste Water Treatment (WWT) and Reverse Osmosis De-Ionized (RODI) system. \n•Provide facilities engineering leadership to the site organizations in support of safety, reliability, quality, environmental and cost objective \n•Owning safety within area of influence \n•Ensuring systems operate reliably to avoid manufacturing/facility (or operations) impacts by meeting uptime goals \n•Overlooking projects to meet design criteria, scope, budget, and schedule \n•\tOversight of planning, design, reconfiguration, construction, maintenance, and modifications to equipment, machinery, facilities systems, buildings, and structures as required to support business requirements \n•Delivering operational efficiency, maintenance, testing and commissioning solutions \n•\tEffective collaboration with construction and operations teams to coordinate work in the field \n•Identify and implement opportunities to achieve lowest cost of ownership to key stakeholders while maintaining reliability.  \n•Results are delivered through the application of engineering skills and tools \n•Systematic problem solving and perform statistical validation of system performance \n•Collaboration with the Site Facility management team, suppliers, key stakeholders and through in-depth understanding of the operating systems to determine and ensure compliance to existing standards, specifications, building codes, and processes. Facilities Chemical Engineer Intel Corporation February 2013  – Present (2 years 7 months) •Overseeing the planning, design, reconfiguration, construction, maintenance and alteration of facility chemical system which includes Gases, Waste Water Treatment (WWT) and Reverse Osmosis De-Ionized (RODI) system. \n•Provide facilities engineering leadership to the site organizations in support of safety, reliability, quality, environmental and cost objective \n•Owning safety within area of influence \n•Ensuring systems operate reliably to avoid manufacturing/facility (or operations) impacts by meeting uptime goals \n•Overlooking projects to meet design criteria, scope, budget, and schedule \n•\tOversight of planning, design, reconfiguration, construction, maintenance, and modifications to equipment, machinery, facilities systems, buildings, and structures as required to support business requirements \n•Delivering operational efficiency, maintenance, testing and commissioning solutions \n•\tEffective collaboration with construction and operations teams to coordinate work in the field \n•Identify and implement opportunities to achieve lowest cost of ownership to key stakeholders while maintaining reliability.  \n•Results are delivered through the application of engineering skills and tools \n•Systematic problem solving and perform statistical validation of system performance \n•Collaboration with the Site Facility management team, suppliers, key stakeholders and through in-depth understanding of the operating systems to determine and ensure compliance to existing standards, specifications, building codes, and processes. Product Development Graduate Engineer Philips Lumileds April 2012  –  February 2013  (11 months) •Contribute ideas and works in team in developing new products.  \n•Accountable for the successful completion of engineering projects and ensure the effectiveness of communication on assigned projects between all disciplines and all other project participants. \n•Responsible for planning, scheduling, conducting and coordinating the technical and management aspects of projects. Product Development Graduate Engineer Philips Lumileds April 2012  –  February 2013  (11 months) •Contribute ideas and works in team in developing new products.  \n•Accountable for the successful completion of engineering projects and ensure the effectiveness of communication on assigned projects between all disciplines and all other project participants. \n•Responsible for planning, scheduling, conducting and coordinating the technical and management aspects of projects. Languages English English English Skills Waste Water Treatment... Reverse Osmosis Water Quality Product Development Project Engineering Communication Environmental Awareness Skills  Waste Water Treatment... Reverse Osmosis Water Quality Product Development Project Engineering Communication Environmental Awareness Waste Water Treatment... Reverse Osmosis Water Quality Product Development Project Engineering Communication Environmental Awareness Waste Water Treatment... Reverse Osmosis Water Quality Product Development Project Engineering Communication Environmental Awareness Education Universiti Sains Malaysia Bachelor's degree,  Chemical Engineering 2007  – 2012 Universiti Sains Malaysia Bachelor's degree,  Chemical Engineering 2007  – 2012 Universiti Sains Malaysia Bachelor's degree,  Chemical Engineering 2007  – 2012 Universiti Sains Malaysia Bachelor's degree,  Chemical Engineering 2007  – 2012 ", "Experience Chemical Engineer Intel Corporation Chemical Engineer Intel Corporation Chemical Engineer Intel Corporation Education Lewis & Clark Law School 2004  – 2008 University of Washington B.S.,  Chemical Engineer 1976  – 1978 Lewis & Clark Law School 2004  – 2008 Lewis & Clark Law School 2004  – 2008 Lewis & Clark Law School 2004  – 2008 University of Washington B.S.,  Chemical Engineer 1976  – 1978 University of Washington B.S.,  Chemical Engineer 1976  – 1978 University of Washington B.S.,  Chemical Engineer 1976  – 1978 ", "Languages English Native or bilingual proficiency Hindi Native or bilingual proficiency English Native or bilingual proficiency Hindi Native or bilingual proficiency English Native or bilingual proficiency Hindi Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Analytics Business Intelligence comScore Data Analysis Forecasting Forrester Microsoft Excel Microstrategy Multivariate Testing Omniture Optimization SPSS SQL Strategic Planning Tableau Tealeaf Web Analytics E-commerce Strategy Marketing Analytics SEM See 6+     See less Skills  Analytics Business Intelligence comScore Data Analysis Forecasting Forrester Microsoft Excel Microstrategy Multivariate Testing Omniture Optimization SPSS SQL Strategic Planning Tableau Tealeaf Web Analytics E-commerce Strategy Marketing Analytics SEM See 6+     See less Analytics Business Intelligence comScore Data Analysis Forecasting Forrester Microsoft Excel Microstrategy Multivariate Testing Omniture Optimization SPSS SQL Strategic Planning Tableau Tealeaf Web Analytics E-commerce Strategy Marketing Analytics SEM See 6+     See less Analytics Business Intelligence comScore Data Analysis Forecasting Forrester Microsoft Excel Microstrategy Multivariate Testing Omniture Optimization SPSS SQL Strategic Planning Tableau Tealeaf Web Analytics E-commerce Strategy Marketing Analytics SEM See 6+     See less ", "Experience Sr. Process Engineer Genentech January 2013  – Present (2 years 8 months) Environmental Group Lead Intel Corporation May 2008  –  January 2013  (4 years 9 months) Environmental Process Engineer Intel Corporation June 2003  –  May 2008  (5 years) Staff Chemical Engineer Intel Corporation May 2000  –  June 2003  (3 years 2 months) Project Work Group Lead Intel Corporation May 1999  –  May 2000  (1 year 1 month) Chemical Engineer Intel Corporation June 1997  –  May 1999  (2 years) Sr. Process Engineer Genentech January 2013  – Present (2 years 8 months) Sr. Process Engineer Genentech January 2013  – Present (2 years 8 months) Environmental Group Lead Intel Corporation May 2008  –  January 2013  (4 years 9 months) Environmental Group Lead Intel Corporation May 2008  –  January 2013  (4 years 9 months) Environmental Process Engineer Intel Corporation June 2003  –  May 2008  (5 years) Environmental Process Engineer Intel Corporation June 2003  –  May 2008  (5 years) Staff Chemical Engineer Intel Corporation May 2000  –  June 2003  (3 years 2 months) Staff Chemical Engineer Intel Corporation May 2000  –  June 2003  (3 years 2 months) Project Work Group Lead Intel Corporation May 1999  –  May 2000  (1 year 1 month) Project Work Group Lead Intel Corporation May 1999  –  May 2000  (1 year 1 month) Chemical Engineer Intel Corporation June 1997  –  May 1999  (2 years) Chemical Engineer Intel Corporation June 1997  –  May 1999  (2 years) Skills Chemical Engineering Environmental Awareness Design of Experiments Semiconductors Process Engineering Process Simulation SPC Cross-functional Team... Engineering Engineering Management Manufacturing Process Improvement Program Management R Root Cause Analysis Skills  Chemical Engineering Environmental Awareness Design of Experiments Semiconductors Process Engineering Process Simulation SPC Cross-functional Team... Engineering Engineering Management Manufacturing Process Improvement Program Management R Root Cause Analysis Chemical Engineering Environmental Awareness Design of Experiments Semiconductors Process Engineering Process Simulation SPC Cross-functional Team... Engineering Engineering Management Manufacturing Process Improvement Program Management R Root Cause Analysis Chemical Engineering Environmental Awareness Design of Experiments Semiconductors Process Engineering Process Simulation SPC Cross-functional Team... Engineering Engineering Management Manufacturing Process Improvement Program Management R Root Cause Analysis Education Arizona State University BSE,  Chemical Engineering 1995  – 1997 Arizona State University BSE,  Chemical Engineering 1995  – 1997 Arizona State University BSE,  Chemical Engineering 1995  – 1997 Arizona State University BSE,  Chemical Engineering 1995  – 1997 ", "Experience Owner CNA Auto Service April 2013  – Present (2 years 5 months) san jose, california Small business owner. Compliance to BAR, EPA, and local jurisdictions. Business development. Chemical Engineer Intel Corporation May 1997  – Present (18 years 4 months) santa clara, california Engineer with hands-on experience on all facilities-related systems: chemical and gas delivery, waste treatment, ultrapure water systems, dry and wet process mechanical systems, HVAC, and energy conservation related projects. Product Development Engineer SurgX Corporation June 1996  –  April 1997  (11 months) fremont, california Product engineer for polymer-based product to protect ICs from electric static discharge. Quality Control Specialist Mohawk Laboratories January 1994  –  May 1996  (2 years 5 months) santa clara, california Managed an ISO quality control lab for all incoming raw materials and products. Owner CNA Auto Service April 2013  – Present (2 years 5 months) san jose, california Small business owner. Compliance to BAR, EPA, and local jurisdictions. Business development. Owner CNA Auto Service April 2013  – Present (2 years 5 months) san jose, california Small business owner. Compliance to BAR, EPA, and local jurisdictions. Business development. Chemical Engineer Intel Corporation May 1997  – Present (18 years 4 months) santa clara, california Engineer with hands-on experience on all facilities-related systems: chemical and gas delivery, waste treatment, ultrapure water systems, dry and wet process mechanical systems, HVAC, and energy conservation related projects. Chemical Engineer Intel Corporation May 1997  – Present (18 years 4 months) santa clara, california Engineer with hands-on experience on all facilities-related systems: chemical and gas delivery, waste treatment, ultrapure water systems, dry and wet process mechanical systems, HVAC, and energy conservation related projects. Product Development Engineer SurgX Corporation June 1996  –  April 1997  (11 months) fremont, california Product engineer for polymer-based product to protect ICs from electric static discharge. Product Development Engineer SurgX Corporation June 1996  –  April 1997  (11 months) fremont, california Product engineer for polymer-based product to protect ICs from electric static discharge. Quality Control Specialist Mohawk Laboratories January 1994  –  May 1996  (2 years 5 months) santa clara, california Managed an ISO quality control lab for all incoming raw materials and products. Quality Control Specialist Mohawk Laboratories January 1994  –  May 1996  (2 years 5 months) santa clara, california Managed an ISO quality control lab for all incoming raw materials and products. Languages Vietnamese Limited working proficiency English Full professional proficiency Vietnamese Limited working proficiency English Full professional proficiency Vietnamese Limited working proficiency English Full professional proficiency Limited working proficiency Full professional proficiency Skills JMP Semiconductors Design of Experiments SPC CVD Thin Films Semiconductor Industry PVD Failure Analysis Process Simulation Metrology Etching Photovoltaics Process Integration Yield Engineering Manufacturing CMOS Silicon Characterization IC See 6+     See less Skills  JMP Semiconductors Design of Experiments SPC CVD Thin Films Semiconductor Industry PVD Failure Analysis Process Simulation Metrology Etching Photovoltaics Process Integration Yield Engineering Manufacturing CMOS Silicon Characterization IC See 6+     See less JMP Semiconductors Design of Experiments SPC CVD Thin Films Semiconductor Industry PVD Failure Analysis Process Simulation Metrology Etching Photovoltaics Process Integration Yield Engineering Manufacturing CMOS Silicon Characterization IC See 6+     See less JMP Semiconductors Design of Experiments SPC CVD Thin Films Semiconductor Industry PVD Failure Analysis Process Simulation Metrology Etching Photovoltaics Process Integration Yield Engineering Manufacturing CMOS Silicon Characterization IC See 6+     See less Education University Berkeley extension Certification in HVAC Design,  Mechanical Engineering 2009  – 2013 San Jose State University Master of Science (M.S.),  Chemical Engineering 2007  – 2009 San Jose State University Bachelor of Science (B.S.),  Chemical Engineering 1992  – 1996 University Berkeley extension Certification in HVAC Design,  Mechanical Engineering 2009  – 2013 University Berkeley extension Certification in HVAC Design,  Mechanical Engineering 2009  – 2013 University Berkeley extension Certification in HVAC Design,  Mechanical Engineering 2009  – 2013 San Jose State University Master of Science (M.S.),  Chemical Engineering 2007  – 2009 San Jose State University Master of Science (M.S.),  Chemical Engineering 2007  – 2009 San Jose State University Master of Science (M.S.),  Chemical Engineering 2007  – 2009 San Jose State University Bachelor of Science (B.S.),  Chemical Engineering 1992  – 1996 San Jose State University Bachelor of Science (B.S.),  Chemical Engineering 1992  – 1996 San Jose State University Bachelor of Science (B.S.),  Chemical Engineering 1992  – 1996 ", "Languages English Full professional proficiency Spanish Native or bilingual proficiency English Full professional proficiency Spanish Native or bilingual proficiency English Full professional proficiency Spanish Native or bilingual proficiency Full professional proficiency Native or bilingual proficiency Skills JMP Design of Experiments SPC Semiconductors Process Engineering Manufacturing Six Sigma Electronics Process Improvement Lean Manufacturing Start-ups R&D FMEA Root Cause Analysis Product Development Cross-functional Team... Engineering Management Waste Reduction Solid Waste Waste Management Manufacturing Operations Testing Quality Assurance Waste Water Treatment... Wastewater Treatment Continuous Improvement Management DMAIC Chemical Engineering Operational Excellence Water Treatment ISO 14001 Iso 9000 Process Optimization Semiconductor Industry Engineering Failure Analysis Process Control ISO Minitab Quality System 5S Quality Management Industrial Engineering Quality Control Manufacturing... Factory Kaizen Value Stream Mapping TRIZ See 35+     See less Skills  JMP Design of Experiments SPC Semiconductors Process Engineering Manufacturing Six Sigma Electronics Process Improvement Lean Manufacturing Start-ups R&D FMEA Root Cause Analysis Product Development Cross-functional Team... Engineering Management Waste Reduction Solid Waste Waste Management Manufacturing Operations Testing Quality Assurance Waste Water Treatment... Wastewater Treatment Continuous Improvement Management DMAIC Chemical Engineering Operational Excellence Water Treatment ISO 14001 Iso 9000 Process Optimization Semiconductor Industry Engineering Failure Analysis Process Control ISO Minitab Quality System 5S Quality Management Industrial Engineering Quality Control Manufacturing... Factory Kaizen Value Stream Mapping TRIZ See 35+     See less JMP Design of Experiments SPC Semiconductors Process Engineering Manufacturing Six Sigma Electronics Process Improvement Lean Manufacturing Start-ups R&D FMEA Root Cause Analysis Product Development Cross-functional Team... Engineering Management Waste Reduction Solid Waste Waste Management Manufacturing Operations Testing Quality Assurance Waste Water Treatment... Wastewater Treatment Continuous Improvement Management DMAIC Chemical Engineering Operational Excellence Water Treatment ISO 14001 Iso 9000 Process Optimization Semiconductor Industry Engineering Failure Analysis Process Control ISO Minitab Quality System 5S Quality Management Industrial Engineering Quality Control Manufacturing... Factory Kaizen Value Stream Mapping TRIZ See 35+     See less JMP Design of Experiments SPC Semiconductors Process Engineering Manufacturing Six Sigma Electronics Process Improvement Lean Manufacturing Start-ups R&D FMEA Root Cause Analysis Product Development Cross-functional Team... Engineering Management Waste Reduction Solid Waste Waste Management Manufacturing Operations Testing Quality Assurance Waste Water Treatment... Wastewater Treatment Continuous Improvement Management DMAIC Chemical Engineering Operational Excellence Water Treatment ISO 14001 Iso 9000 Process Optimization Semiconductor Industry Engineering Failure Analysis Process Control ISO Minitab Quality System 5S Quality Management Industrial Engineering Quality Control Manufacturing... Factory Kaizen Value Stream Mapping TRIZ See 35+     See less ", "Experience chemical engineer Intel Corporation March 2005  – Present (10 years 6 months) Chemical Engineer Metalic Power October 2000  –  November 2002  (2 years 2 months) Process Engineer Nalco July 1995  –  October 2000  (5 years 4 months) chemical engineer Intel Corporation March 2005  – Present (10 years 6 months) chemical engineer Intel Corporation March 2005  – Present (10 years 6 months) Chemical Engineer Metalic Power October 2000  –  November 2002  (2 years 2 months) Chemical Engineer Metalic Power October 2000  –  November 2002  (2 years 2 months) Process Engineer Nalco July 1995  –  October 2000  (5 years 4 months) Process Engineer Nalco July 1995  –  October 2000  (5 years 4 months) Skills Semiconductors Engineering Management Design of Experiments Manufacturing Continuous Improvement Process Engineering SPC Engineering Process Simulation Cross-functional Team... JMP Failure Analysis Product Development Skills  Semiconductors Engineering Management Design of Experiments Manufacturing Continuous Improvement Process Engineering SPC Engineering Process Simulation Cross-functional Team... JMP Failure Analysis Product Development Semiconductors Engineering Management Design of Experiments Manufacturing Continuous Improvement Process Engineering SPC Engineering Process Simulation Cross-functional Team... JMP Failure Analysis Product Development Semiconductors Engineering Management Design of Experiments Manufacturing Continuous Improvement Process Engineering SPC Engineering Process Simulation Cross-functional Team... JMP Failure Analysis Product Development Education University of Illinois at Urbana-Champaign Bachelor of Science (BS),  Chemical Engineering 1991  – 1995 University of Illinois at Urbana-Champaign Bachelor of Science (BS),  Chemical Engineering 1991  – 1995 University of Illinois at Urbana-Champaign Bachelor of Science (BS),  Chemical Engineering 1991  – 1995 University of Illinois at Urbana-Champaign Bachelor of Science (BS),  Chemical Engineering 1991  – 1995 ", "Experience Chemical Engineer Intel Corporation May 2012  – Present (3 years 4 months) Phoenix, Arizona Area Research Assistant Washington State University May 2010  –  May 2013  (3 years 1 month) Graduate Intern Intel Corporation 2012  –  2012  (less than a year) Teaching Assistant Washington State University August 2009  –  May 2010  (10 months) Spokane, Washington Area Lecturer Bangladesh University of Engineering & Technology June 2005  –  May 2009  (4 years) Bangladesh Assistant Professor Bangladesh University of Engineering & Technology 2009  –  2009  (less than a year) Student Bangladesh University of Engineering & Technology October 1999  –  November 2004  (5 years 2 months) Bangladesh Batch 39 FCC 1992  –  1998  (6 years) Chemical Engineer Intel Corporation May 2012  – Present (3 years 4 months) Phoenix, Arizona Area Chemical Engineer Intel Corporation May 2012  – Present (3 years 4 months) Phoenix, Arizona Area Research Assistant Washington State University May 2010  –  May 2013  (3 years 1 month) Research Assistant Washington State University May 2010  –  May 2013  (3 years 1 month) Graduate Intern Intel Corporation 2012  –  2012  (less than a year) Graduate Intern Intel Corporation 2012  –  2012  (less than a year) Teaching Assistant Washington State University August 2009  –  May 2010  (10 months) Spokane, Washington Area Teaching Assistant Washington State University August 2009  –  May 2010  (10 months) Spokane, Washington Area Lecturer Bangladesh University of Engineering & Technology June 2005  –  May 2009  (4 years) Bangladesh Lecturer Bangladesh University of Engineering & Technology June 2005  –  May 2009  (4 years) Bangladesh Assistant Professor Bangladesh University of Engineering & Technology 2009  –  2009  (less than a year) Assistant Professor Bangladesh University of Engineering & Technology 2009  –  2009  (less than a year) Student Bangladesh University of Engineering & Technology October 1999  –  November 2004  (5 years 2 months) Bangladesh Student Bangladesh University of Engineering & Technology October 1999  –  November 2004  (5 years 2 months) Bangladesh Batch 39 FCC 1992  –  1998  (6 years) Batch 39 FCC 1992  –  1998  (6 years) Skills Matlab Research AFM PHP AutoCAD Fortran Simulation Microsoft Office Finite Element Analysis Engineering Modeling Excel Chemical Engineering Simulations Powder X-ray Diffraction Microsoft Excel Process Simulation Heat Transfer C TGA Differential Scanning... FTIR Scanning Electron... Characterization COMSOL Nanotechnology Experimentation Photolithography Mathematica Design of Experiments See 15+     See less Skills  Matlab Research AFM PHP AutoCAD Fortran Simulation Microsoft Office Finite Element Analysis Engineering Modeling Excel Chemical Engineering Simulations Powder X-ray Diffraction Microsoft Excel Process Simulation Heat Transfer C TGA Differential Scanning... FTIR Scanning Electron... Characterization COMSOL Nanotechnology Experimentation Photolithography Mathematica Design of Experiments See 15+     See less Matlab Research AFM PHP AutoCAD Fortran Simulation Microsoft Office Finite Element Analysis Engineering Modeling Excel Chemical Engineering Simulations Powder X-ray Diffraction Microsoft Excel Process Simulation Heat Transfer C TGA Differential Scanning... FTIR Scanning Electron... Characterization COMSOL Nanotechnology Experimentation Photolithography Mathematica Design of Experiments See 15+     See less Matlab Research AFM PHP AutoCAD Fortran Simulation Microsoft Office Finite Element Analysis Engineering Modeling Excel Chemical Engineering Simulations Powder X-ray Diffraction Microsoft Excel Process Simulation Heat Transfer C TGA Differential Scanning... FTIR Scanning Electron... Characterization COMSOL Nanotechnology Experimentation Photolithography Mathematica Design of Experiments See 15+     See less Education Washington State University Master's degree,  Engineering Science 2009  – 2013 Bangladesh University of Engineering and Technology B.Sc,  Chemical Engineering 1999  – 2004 Faujdarhat Cadet College 1992  – 1998 Washington State University Doctor of Philosophy (PhD),  Chemical Engineering 2013 Washington State University Master's degree,  Engineering Science 2009  – 2013 Washington State University Master's degree,  Engineering Science 2009  – 2013 Washington State University Master's degree,  Engineering Science 2009  – 2013 Bangladesh University of Engineering and Technology B.Sc,  Chemical Engineering 1999  – 2004 Bangladesh University of Engineering and Technology B.Sc,  Chemical Engineering 1999  – 2004 Bangladesh University of Engineering and Technology B.Sc,  Chemical Engineering 1999  – 2004 Faujdarhat Cadet College 1992  – 1998 Faujdarhat Cadet College 1992  – 1998 Faujdarhat Cadet College 1992  – 1998 Washington State University Doctor of Philosophy (PhD),  Chemical Engineering 2013 Washington State University Doctor of Philosophy (PhD),  Chemical Engineering 2013 Washington State University Doctor of Philosophy (PhD),  Chemical Engineering 2013 ", "Experience Chemical Engineer Intel Corporation April 2010  –  November 2014  (4 years 8 months) Chemical Engineer Intel Corporation April 2010  –  November 2014  (4 years 8 months) Chemical Engineer Intel Corporation April 2010  –  November 2014  (4 years 8 months) Skills Manufacturing Engineering Process Engineering Skills  Manufacturing Engineering Process Engineering Manufacturing Engineering Process Engineering Manufacturing Engineering Process Engineering Education Ariel University Bachelor of Science (BSc),  Chemistry & Biotechnology 2005  – 2009 Ariel University Bachelor of Science (BSc),  Chemistry & Biotechnology 2005  – 2009 Ariel University Bachelor of Science (BSc),  Chemistry & Biotechnology 2005  – 2009 Ariel University Bachelor of Science (BSc),  Chemistry & Biotechnology 2005  – 2009 ", "Summary Data-driven process engineer with over 14 years of experience and a focus on operations leadership, projects, system development and customer satisfaction. Experienced as a facilities manager of engineers and technicians where I set direction and use indicators to focus on reliable operations while reducing cost and lowering work load. Successfully use the philosophies of Lean and Maintenance Science to create an efficient work environment. Drive problem solving and root cause analysis using techniques such as Model Based Problem Solving among others. As an engineer I successfully implemented complex systems from initial research and development to sustaining operations with emphasis on reliability, safety, budget and schedule. Extensive experience in: \n \n• Industrial Wastewater Treatment and Recycling \n• Ultra-Pure and Industrial Water Treatment \n• Operations Management \n• Structured Problem Solving \n• Statistical Process Control and Instrumentation \n• LEAN Continuous Improvement \n• Experiment Design, Regulatory Compliance, RCRA \n• Team and Project Leadership/Management \n• System Design and Construction Documents \n• System Operations and Training Summary Data-driven process engineer with over 14 years of experience and a focus on operations leadership, projects, system development and customer satisfaction. Experienced as a facilities manager of engineers and technicians where I set direction and use indicators to focus on reliable operations while reducing cost and lowering work load. Successfully use the philosophies of Lean and Maintenance Science to create an efficient work environment. Drive problem solving and root cause analysis using techniques such as Model Based Problem Solving among others. As an engineer I successfully implemented complex systems from initial research and development to sustaining operations with emphasis on reliability, safety, budget and schedule. Extensive experience in: \n \n• Industrial Wastewater Treatment and Recycling \n• Ultra-Pure and Industrial Water Treatment \n• Operations Management \n• Structured Problem Solving \n• Statistical Process Control and Instrumentation \n• LEAN Continuous Improvement \n• Experiment Design, Regulatory Compliance, RCRA \n• Team and Project Leadership/Management \n• System Design and Construction Documents \n• System Operations and Training Data-driven process engineer with over 14 years of experience and a focus on operations leadership, projects, system development and customer satisfaction. Experienced as a facilities manager of engineers and technicians where I set direction and use indicators to focus on reliable operations while reducing cost and lowering work load. Successfully use the philosophies of Lean and Maintenance Science to create an efficient work environment. Drive problem solving and root cause analysis using techniques such as Model Based Problem Solving among others. As an engineer I successfully implemented complex systems from initial research and development to sustaining operations with emphasis on reliability, safety, budget and schedule. Extensive experience in: \n \n• Industrial Wastewater Treatment and Recycling \n• Ultra-Pure and Industrial Water Treatment \n• Operations Management \n• Structured Problem Solving \n• Statistical Process Control and Instrumentation \n• LEAN Continuous Improvement \n• Experiment Design, Regulatory Compliance, RCRA \n• Team and Project Leadership/Management \n• System Design and Construction Documents \n• System Operations and Training Data-driven process engineer with over 14 years of experience and a focus on operations leadership, projects, system development and customer satisfaction. Experienced as a facilities manager of engineers and technicians where I set direction and use indicators to focus on reliable operations while reducing cost and lowering work load. Successfully use the philosophies of Lean and Maintenance Science to create an efficient work environment. Drive problem solving and root cause analysis using techniques such as Model Based Problem Solving among others. As an engineer I successfully implemented complex systems from initial research and development to sustaining operations with emphasis on reliability, safety, budget and schedule. Extensive experience in: \n \n• Industrial Wastewater Treatment and Recycling \n• Ultra-Pure and Industrial Water Treatment \n• Operations Management \n• Structured Problem Solving \n• Statistical Process Control and Instrumentation \n• LEAN Continuous Improvement \n• Experiment Design, Regulatory Compliance, RCRA \n• Team and Project Leadership/Management \n• System Design and Construction Documents \n• System Operations and Training Experience Facilities Chemical Engineer Intel Sr. Facilities Engineer Intel Corporation March 2013  – Present (2 years 6 months) Hillsboro, Oregon Develop, design and operate UPW treatment and environmental system. Lead engineer on construction projects and problem solving. Group Lead/Operations Manager Intel Corporation January 2010  –  March 2013  (3 years 3 months) Hillsboro, Oregon Managed a team of UPW and Industrial Waste Engineers and Technicians responsible for operations and maintenance to include budget accuracy, safety programs, goal setting, work prioritization, indicator development, headcount modeling and hiring. Lead work load reduction effort using Lean and maintenance science principals to reduce work load. Improved systems reliability year over year by focusing on root cause analysis of quality events and maintained programs to assure RCRA and environmental compliance. Facilities Chemical Engineer Intel Corporation June 2001  –  January 2010  (8 years 8 months) Hillsboro, Oregon Provided ownership of UPW and industrial waste treatment systems such as Hydrofluoric acid, Acid waste, solvents, copper, etc. Worked with factory customers to develop new waste treatment systems as factory chemistries changed. Lead work groups and construction projects. Experience with RCRA, ISO, PHA and FMEAs. Facilities Technician Intel Corporation May 2000  –  June 2001  (1 year 2 months) Hillsboro, Oregon Operated and maintained ultra-pure water and environmental systems. Facilities Chemical Engineer Intel Facilities Chemical Engineer Intel Sr. Facilities Engineer Intel Corporation March 2013  – Present (2 years 6 months) Hillsboro, Oregon Develop, design and operate UPW treatment and environmental system. Lead engineer on construction projects and problem solving. Sr. Facilities Engineer Intel Corporation March 2013  – Present (2 years 6 months) Hillsboro, Oregon Develop, design and operate UPW treatment and environmental system. Lead engineer on construction projects and problem solving. Group Lead/Operations Manager Intel Corporation January 2010  –  March 2013  (3 years 3 months) Hillsboro, Oregon Managed a team of UPW and Industrial Waste Engineers and Technicians responsible for operations and maintenance to include budget accuracy, safety programs, goal setting, work prioritization, indicator development, headcount modeling and hiring. Lead work load reduction effort using Lean and maintenance science principals to reduce work load. Improved systems reliability year over year by focusing on root cause analysis of quality events and maintained programs to assure RCRA and environmental compliance. Group Lead/Operations Manager Intel Corporation January 2010  –  March 2013  (3 years 3 months) Hillsboro, Oregon Managed a team of UPW and Industrial Waste Engineers and Technicians responsible for operations and maintenance to include budget accuracy, safety programs, goal setting, work prioritization, indicator development, headcount modeling and hiring. Lead work load reduction effort using Lean and maintenance science principals to reduce work load. Improved systems reliability year over year by focusing on root cause analysis of quality events and maintained programs to assure RCRA and environmental compliance. Facilities Chemical Engineer Intel Corporation June 2001  –  January 2010  (8 years 8 months) Hillsboro, Oregon Provided ownership of UPW and industrial waste treatment systems such as Hydrofluoric acid, Acid waste, solvents, copper, etc. Worked with factory customers to develop new waste treatment systems as factory chemistries changed. Lead work groups and construction projects. Experience with RCRA, ISO, PHA and FMEAs. Facilities Chemical Engineer Intel Corporation June 2001  –  January 2010  (8 years 8 months) Hillsboro, Oregon Provided ownership of UPW and industrial waste treatment systems such as Hydrofluoric acid, Acid waste, solvents, copper, etc. Worked with factory customers to develop new waste treatment systems as factory chemistries changed. Lead work groups and construction projects. Experience with RCRA, ISO, PHA and FMEAs. Facilities Technician Intel Corporation May 2000  –  June 2001  (1 year 2 months) Hillsboro, Oregon Operated and maintained ultra-pure water and environmental systems. Facilities Technician Intel Corporation May 2000  –  June 2001  (1 year 2 months) Hillsboro, Oregon Operated and maintained ultra-pure water and environmental systems. Skills Semiconductors Skills  Semiconductors Semiconductors Semiconductors Education Oregon State University 1992  – 1996 Oregon State University 1992  – 1996 Oregon State University 1992  – 1996 Oregon State University 1992  – 1996 ", "Experience Chemical Engineer Intel Corporation July 2011  – Present (4 years 2 months) Hillsboro, OR Chemical engineer in a analytical chemistry lab. Responsible for creating test methods for analytical tools such as FTIR, GC-MS, and XRF. Chemical Engineer Intel Corporation July 2011  – Present (4 years 2 months) Hillsboro, OR Chemical engineer in a analytical chemistry lab. Responsible for creating test methods for analytical tools such as FTIR, GC-MS, and XRF. Chemical Engineer Intel Corporation July 2011  – Present (4 years 2 months) Hillsboro, OR Chemical engineer in a analytical chemistry lab. Responsible for creating test methods for analytical tools such as FTIR, GC-MS, and XRF. Education Oregon State University Bachelor's Degree,  Chemical Engineering 2006  – 2011 Oregon State University Bachelor's Degree,  Chemical Engineering 2006  – 2011 Oregon State University Bachelor's Degree,  Chemical Engineering 2006  – 2011 Oregon State University Bachelor's Degree,  Chemical Engineering 2006  – 2011 ", "Experience Neuroradiologist Radiology Associates P.C. August 2013  – Present (2 years 1 month) Neuroradiology Fellow University of Utah Hospitals and Clinics August 2011  –  August 2013  (2 years 1 month) Radiology Resident University of Utah August 2007  –  July 2011  (4 years) Surgery Intern University of Washington 2006  –  2007  (1 year) Chemical Engineer Intel Corporation 2001  –  2002  (1 year) Neuroradiologist Radiology Associates P.C. August 2013  – Present (2 years 1 month) Neuroradiologist Radiology Associates P.C. August 2013  – Present (2 years 1 month) Neuroradiology Fellow University of Utah Hospitals and Clinics August 2011  –  August 2013  (2 years 1 month) Neuroradiology Fellow University of Utah Hospitals and Clinics August 2011  –  August 2013  (2 years 1 month) Radiology Resident University of Utah August 2007  –  July 2011  (4 years) Radiology Resident University of Utah August 2007  –  July 2011  (4 years) Surgery Intern University of Washington 2006  –  2007  (1 year) Surgery Intern University of Washington 2006  –  2007  (1 year) Chemical Engineer Intel Corporation 2001  –  2002  (1 year) Chemical Engineer Intel Corporation 2001  –  2002  (1 year) Skills Clinical Research Hospitals Healthcare Information... Informatics Medicine Research Medical Education Healthcare Medical Imaging Skills  Clinical Research Hospitals Healthcare Information... Informatics Medicine Research Medical Education Healthcare Medical Imaging Clinical Research Hospitals Healthcare Information... Informatics Medicine Research Medical Education Healthcare Medical Imaging Clinical Research Hospitals Healthcare Information... Informatics Medicine Research Medical Education Healthcare Medical Imaging Education University of Wisconsin-Madison Doctor of Medicine (MD) 2002  – 2006 Medicine University of Minnesota-Twin Cities Bachelor's degree,  Chemical Engineering and Chemistry 1995  – 2000 Chemistry and Chemical Engineering University of Wisconsin-Madison Doctor of Medicine (MD) 2002  – 2006 Medicine University of Wisconsin-Madison Doctor of Medicine (MD) 2002  – 2006 Medicine University of Wisconsin-Madison Doctor of Medicine (MD) 2002  – 2006 Medicine University of Minnesota-Twin Cities Bachelor's degree,  Chemical Engineering and Chemistry 1995  – 2000 Chemistry and Chemical Engineering University of Minnesota-Twin Cities Bachelor's degree,  Chemical Engineering and Chemistry 1995  – 2000 Chemistry and Chemical Engineering University of Minnesota-Twin Cities Bachelor's degree,  Chemical Engineering and Chemistry 1995  – 2000 Chemistry and Chemical Engineering ", "Skills Vacuum Systems Semiconductors Wet Etching Semiconductor... JMP Design of Experiments DOE SPC Lean Manufacturing Electronics Manufacturing Intel Six Sigma Statistics Troubleshooting Problem Solving Windows Process Improvement Team Leadership Start-ups Microsoft Office C++ Excel Characterization Word PowerPoint Inventory Management Failure Analysis Engineering Etching Silicon CVD Plasma Etch Chemical Engineering Process Engineering Facilities Engineering Metrology Thin Films Semiconductor Industry Photolithography Semiconductor Process Yield PVD Vacuum See 29+     See less Skills  Vacuum Systems Semiconductors Wet Etching Semiconductor... JMP Design of Experiments DOE SPC Lean Manufacturing Electronics Manufacturing Intel Six Sigma Statistics Troubleshooting Problem Solving Windows Process Improvement Team Leadership Start-ups Microsoft Office C++ Excel Characterization Word PowerPoint Inventory Management Failure Analysis Engineering Etching Silicon CVD Plasma Etch Chemical Engineering Process Engineering Facilities Engineering Metrology Thin Films Semiconductor Industry Photolithography Semiconductor Process Yield PVD Vacuum See 29+     See less Vacuum Systems Semiconductors Wet Etching Semiconductor... JMP Design of Experiments DOE SPC Lean Manufacturing Electronics Manufacturing Intel Six Sigma Statistics Troubleshooting Problem Solving Windows Process Improvement Team Leadership Start-ups Microsoft Office C++ Excel Characterization Word PowerPoint Inventory Management Failure Analysis Engineering Etching Silicon CVD Plasma Etch Chemical Engineering Process Engineering Facilities Engineering Metrology Thin Films Semiconductor Industry Photolithography Semiconductor Process Yield PVD Vacuum See 29+     See less Vacuum Systems Semiconductors Wet Etching Semiconductor... JMP Design of Experiments DOE SPC Lean Manufacturing Electronics Manufacturing Intel Six Sigma Statistics Troubleshooting Problem Solving Windows Process Improvement Team Leadership Start-ups Microsoft Office C++ Excel Characterization Word PowerPoint Inventory Management Failure Analysis Engineering Etching Silicon CVD Plasma Etch Chemical Engineering Process Engineering Facilities Engineering Metrology Thin Films Semiconductor Industry Photolithography Semiconductor Process Yield PVD Vacuum See 29+     See less "]}