{"position": "Commodity Specialist", "company": "Intel Corporation", "profiles": ["Experience Commodity Manager Intel Corporation Commodity Manager Intel Corporation Commodity Manager Intel Corporation Skills Supply Management Cross-functional Team... Semiconductors Strategic Sourcing Supply Chain Management Semiconductor Industry Manufacturing Skills  Supply Management Cross-functional Team... Semiconductors Strategic Sourcing Supply Chain Management Semiconductor Industry Manufacturing Supply Management Cross-functional Team... Semiconductors Strategic Sourcing Supply Chain Management Semiconductor Industry Manufacturing Supply Management Cross-functional Team... Semiconductors Strategic Sourcing Supply Chain Management Semiconductor Industry Manufacturing ", "Experience Buyer/ Commodity Specialist Intel Corporation Buyer/ Commodity Specialist Intel Corporation Buyer/ Commodity Specialist Intel Corporation ", "Experience Commodity Specialist Intel Corporation May 2011  – Present (4 years 4 months) Commodity Specialist Intel Corporation May 2011  – Present (4 years 4 months) Commodity Specialist Intel Corporation May 2011  – Present (4 years 4 months) Skills Management PowerPoint Training Leadership Microsoft Excel Microsoft Word Microsoft Office Research Sales Skills  Management PowerPoint Training Leadership Microsoft Excel Microsoft Word Microsoft Office Research Sales Management PowerPoint Training Leadership Microsoft Excel Microsoft Word Microsoft Office Research Sales Management PowerPoint Training Leadership Microsoft Excel Microsoft Word Microsoft Office Research Sales ", "Experience Parts Clean Commodity Specialist Intel Corporation Parts Clean Commodity Specialist Intel Corporation Parts Clean Commodity Specialist Intel Corporation ", "Experience Commodity Manager Intel Corporation May 1996  – Present (19 years 4 months) Commodity Manager Intel Corporation May 1996  – Present (19 years 4 months) Commodity Manager Intel Corporation May 1996  – Present (19 years 4 months) Education San Jose State University 1988  – 1993 San Jose State University 1988  – 1993 San Jose State University 1988  – 1993 San Jose State University 1988  – 1993 ", "Summary Senior Purchasing management professional with experience using MRP and SAP for inventory control. Strengths include, customer orientation, identifying opportunities for efficiency (LEAN Methodology), cost reduction initiatives, lead-time reductions, working with process engineering to proactively maintain accurate stocking levels. Interacts effectively with all levels of management. Works well independently and as a team member.  Summary Senior Purchasing management professional with experience using MRP and SAP for inventory control. Strengths include, customer orientation, identifying opportunities for efficiency (LEAN Methodology), cost reduction initiatives, lead-time reductions, working with process engineering to proactively maintain accurate stocking levels. Interacts effectively with all levels of management. Works well independently and as a team member.  Senior Purchasing management professional with experience using MRP and SAP for inventory control. Strengths include, customer orientation, identifying opportunities for efficiency (LEAN Methodology), cost reduction initiatives, lead-time reductions, working with process engineering to proactively maintain accurate stocking levels. Interacts effectively with all levels of management. Works well independently and as a team member.  Senior Purchasing management professional with experience using MRP and SAP for inventory control. Strengths include, customer orientation, identifying opportunities for efficiency (LEAN Methodology), cost reduction initiatives, lead-time reductions, working with process engineering to proactively maintain accurate stocking levels. Interacts effectively with all levels of management. Works well independently and as a team member.  Experience Senior buyer/planner Intel Corporation February 2010  –  August 2015  (5 years 7 months) Hudson, MA. •\tManaged repair and logistics for all parts clean kits and repairable parts for sub-fab sort tools. Documented processes and educated the factory stakeholders. \n•\tForecasted and maintained inventory at planned levels to support availability and cost optimization. \n•\tIntegrated with factory operations by attending daily operations meetings and aligning procurement methods with manufacturing needs. \n•\tReported out inventory health CSI’s (Critical Success Indicators) on a weekly basis. \n•\tOptimized spares inventory to support ramping and end of life factory activities over an 18 month period. \n•\tLiaised with engineering stakeholders, built, managed and maintained inventory for two new product lines.  \n•\tNegotiated with suppliers to accelerate or delay delivery to meet production consumption requirements \n•\tObtained NDAs to support new product line. \n \n Global Commodity Specialist Intel March 2006  –  February 2010  (4 years) Hudson,MA. •\t•\tWith the announcement of Arizona Fab ‘end of life’, worked with the other Intel global factories to redistribute tool and spare parts to their stock rooms. \n•\tDeveloped and maintained excellent communications and relationships with all business partners at eight sites across the US and Ireland. \n•\tTeam member and content expert of the MRP conversion team \n•\tManaged end of life activities for New Mexico Fab with a focus on Sub-fab tools to minimize liability. \n•\tEffectively lead and managed 130 suppliers to deliver a solid supply chain for spares and services \n•\tInternational travel that allowed for understanding of foreign cultures and work practices. \n Transaction Specialist Intel Corp. February 1998  –  March 2006  (8 years 2 months) Hudson MA> •\tSupported construction organization by submitting RFQ (Request for Quotation) and converting requisitions into purchase orders \n•\tManaged tactical support for procurement operations (Invoice resolution, exception resolution and past due PO’s management) for various commodities (Quartz, Metals, Targets, etc.). \n•\tInterfaced with multiple organizations including finance and accounts payable. \n•\tRemotely managed from Arizona and Oregon – demonstrated the ability to work independently. \n•\tInsured timely three way match requirements to keep all suppliers current and reduce liability. \n•\tReceived and processed requisitions into purchase orders to support various project teams. \n Senior buyer/planner Intel Corporation February 2010  –  August 2015  (5 years 7 months) Hudson, MA. •\tManaged repair and logistics for all parts clean kits and repairable parts for sub-fab sort tools. Documented processes and educated the factory stakeholders. \n•\tForecasted and maintained inventory at planned levels to support availability and cost optimization. \n•\tIntegrated with factory operations by attending daily operations meetings and aligning procurement methods with manufacturing needs. \n•\tReported out inventory health CSI’s (Critical Success Indicators) on a weekly basis. \n•\tOptimized spares inventory to support ramping and end of life factory activities over an 18 month period. \n•\tLiaised with engineering stakeholders, built, managed and maintained inventory for two new product lines.  \n•\tNegotiated with suppliers to accelerate or delay delivery to meet production consumption requirements \n•\tObtained NDAs to support new product line. \n \n Senior buyer/planner Intel Corporation February 2010  –  August 2015  (5 years 7 months) Hudson, MA. •\tManaged repair and logistics for all parts clean kits and repairable parts for sub-fab sort tools. Documented processes and educated the factory stakeholders. \n•\tForecasted and maintained inventory at planned levels to support availability and cost optimization. \n•\tIntegrated with factory operations by attending daily operations meetings and aligning procurement methods with manufacturing needs. \n•\tReported out inventory health CSI’s (Critical Success Indicators) on a weekly basis. \n•\tOptimized spares inventory to support ramping and end of life factory activities over an 18 month period. \n•\tLiaised with engineering stakeholders, built, managed and maintained inventory for two new product lines.  \n•\tNegotiated with suppliers to accelerate or delay delivery to meet production consumption requirements \n•\tObtained NDAs to support new product line. \n \n Global Commodity Specialist Intel March 2006  –  February 2010  (4 years) Hudson,MA. •\t•\tWith the announcement of Arizona Fab ‘end of life’, worked with the other Intel global factories to redistribute tool and spare parts to their stock rooms. \n•\tDeveloped and maintained excellent communications and relationships with all business partners at eight sites across the US and Ireland. \n•\tTeam member and content expert of the MRP conversion team \n•\tManaged end of life activities for New Mexico Fab with a focus on Sub-fab tools to minimize liability. \n•\tEffectively lead and managed 130 suppliers to deliver a solid supply chain for spares and services \n•\tInternational travel that allowed for understanding of foreign cultures and work practices. \n Global Commodity Specialist Intel March 2006  –  February 2010  (4 years) Hudson,MA. •\t•\tWith the announcement of Arizona Fab ‘end of life’, worked with the other Intel global factories to redistribute tool and spare parts to their stock rooms. \n•\tDeveloped and maintained excellent communications and relationships with all business partners at eight sites across the US and Ireland. \n•\tTeam member and content expert of the MRP conversion team \n•\tManaged end of life activities for New Mexico Fab with a focus on Sub-fab tools to minimize liability. \n•\tEffectively lead and managed 130 suppliers to deliver a solid supply chain for spares and services \n•\tInternational travel that allowed for understanding of foreign cultures and work practices. \n Transaction Specialist Intel Corp. February 1998  –  March 2006  (8 years 2 months) Hudson MA> •\tSupported construction organization by submitting RFQ (Request for Quotation) and converting requisitions into purchase orders \n•\tManaged tactical support for procurement operations (Invoice resolution, exception resolution and past due PO’s management) for various commodities (Quartz, Metals, Targets, etc.). \n•\tInterfaced with multiple organizations including finance and accounts payable. \n•\tRemotely managed from Arizona and Oregon – demonstrated the ability to work independently. \n•\tInsured timely three way match requirements to keep all suppliers current and reduce liability. \n•\tReceived and processed requisitions into purchase orders to support various project teams. \n Transaction Specialist Intel Corp. February 1998  –  March 2006  (8 years 2 months) Hudson MA> •\tSupported construction organization by submitting RFQ (Request for Quotation) and converting requisitions into purchase orders \n•\tManaged tactical support for procurement operations (Invoice resolution, exception resolution and past due PO’s management) for various commodities (Quartz, Metals, Targets, etc.). \n•\tInterfaced with multiple organizations including finance and accounts payable. \n•\tRemotely managed from Arizona and Oregon – demonstrated the ability to work independently. \n•\tInsured timely three way match requirements to keep all suppliers current and reduce liability. \n•\tReceived and processed requisitions into purchase orders to support various project teams. \n Skills Supply Management Process Improvement Semiconductors MRP Strategic Sourcing Cross-functional Team... Lean Manufacturing Global Sourcing Supply Chain Management Supply Chain Supplier Development Microsoft Excel Forecasting Lean Management Data Analysis Microsoft Office Microsoft Word Creative Problem Solving Quality Assurance SAP See 5+     See less Skills  Supply Management Process Improvement Semiconductors MRP Strategic Sourcing Cross-functional Team... Lean Manufacturing Global Sourcing Supply Chain Management Supply Chain Supplier Development Microsoft Excel Forecasting Lean Management Data Analysis Microsoft Office Microsoft Word Creative Problem Solving Quality Assurance SAP See 5+     See less Supply Management Process Improvement Semiconductors MRP Strategic Sourcing Cross-functional Team... Lean Manufacturing Global Sourcing Supply Chain Management Supply Chain Supplier Development Microsoft Excel Forecasting Lean Management Data Analysis Microsoft Office Microsoft Word Creative Problem Solving Quality Assurance SAP See 5+     See less Supply Management Process Improvement Semiconductors MRP Strategic Sourcing Cross-functional Team... Lean Manufacturing Global Sourcing Supply Chain Management Supply Chain Supplier Development Microsoft Excel Forecasting Lean Management Data Analysis Microsoft Office Microsoft Word Creative Problem Solving Quality Assurance SAP See 5+     See less Education Billerica Memorial High School High School Diploma Middlesex Community College Billerica Memorial High School High School Diploma Billerica Memorial High School High School Diploma Billerica Memorial High School High School Diploma Middlesex Community College Middlesex Community College Middlesex Community College ", "Experience Retired in June 2010 Intel Corporation July 1994  –  June 2010  (16 years) Retirement is everything, and more. Intel is/was a wonderful company to work for. Miss the people alot. Retired in June 2010 Intel Corporation July 1994  –  June 2010  (16 years) Retirement is everything, and more. Intel is/was a wonderful company to work for. Miss the people alot. Retired in June 2010 Intel Corporation July 1994  –  June 2010  (16 years) Retirement is everything, and more. Intel is/was a wonderful company to work for. Miss the people alot. ", "Experience Chemical & Gas Commodity Specialist Intel Corporation Chemical & Gas Commodity Specialist Intel Corporation Chemical & Gas Commodity Specialist Intel Corporation Education California State University-Chico 1985  – 1989 California State University-Chico 1985  – 1989 California State University-Chico 1985  – 1989 California State University-Chico 1985  – 1989 ", "Experience Commodity Specialist Intel Corporation Comm. Spec. Intel Corporation March 1996  –  February 2014  (18 years) Rio Rancho, NM Commodity Specialist Intel Corporation Commodity Specialist Intel Corporation Comm. Spec. Intel Corporation March 1996  –  February 2014  (18 years) Rio Rancho, NM Comm. Spec. Intel Corporation March 1996  –  February 2014  (18 years) Rio Rancho, NM Skills Supplier Development Strategic Sourcing Supply Management Supplier Negotiation Lean Manufacturing SPC Continuous Improvement Manufacturing Cross-functional Team... Semiconductors Skills  Supplier Development Strategic Sourcing Supply Management Supplier Negotiation Lean Manufacturing SPC Continuous Improvement Manufacturing Cross-functional Team... Semiconductors Supplier Development Strategic Sourcing Supply Management Supplier Negotiation Lean Manufacturing SPC Continuous Improvement Manufacturing Cross-functional Team... Semiconductors Supplier Development Strategic Sourcing Supply Management Supplier Negotiation Lean Manufacturing SPC Continuous Improvement Manufacturing Cross-functional Team... Semiconductors ", "Experience Commodity Specialist Intel Corporation Commodity Specialist Intel Corporation Commodity Specialist Intel Corporation Education Howard University 2004  – 2006 Howard University 2004  – 2006 Howard University 2004  – 2006 Howard University 2004  – 2006 ", "Experience Senior Buyer Intel Corporation September 2004  – Present (11 years) Spares consumption RECON for 8 TSM Suppliers, Systems POC, and Department trainer for new employees. Transaction Specialist Intel Corporation November 1997  –  September 2004  (6 years 11 months) Module Repair Finance Analyst Intel June 1994  –  November 1997  (3 years 6 months) Managing inbound and outbound modules for repair from VF sites. Ordering spares parts required to process modules for the IMR repair facility as well as for neighboring labs. Monthly finacial rollup of spends and bill backs to the VF factories. Material Specialist Intel May 1988  –  June 1994  (6 years 2 months) Accepting and processing inbound and outbound freight for the Chandler site. Issuing spares from inventory to the factory for machine maintance. Assistant Store Manager Store 99 April 1987  –  May 1988  (1 year 2 months) Assistant store manager in charge of customer service, employee scheduling, opening and closing, and bank deposits. Senior Buyer Intel Corporation September 2004  – Present (11 years) Spares consumption RECON for 8 TSM Suppliers, Systems POC, and Department trainer for new employees. Senior Buyer Intel Corporation September 2004  – Present (11 years) Spares consumption RECON for 8 TSM Suppliers, Systems POC, and Department trainer for new employees. Transaction Specialist Intel Corporation November 1997  –  September 2004  (6 years 11 months) Transaction Specialist Intel Corporation November 1997  –  September 2004  (6 years 11 months) Module Repair Finance Analyst Intel June 1994  –  November 1997  (3 years 6 months) Managing inbound and outbound modules for repair from VF sites. Ordering spares parts required to process modules for the IMR repair facility as well as for neighboring labs. Monthly finacial rollup of spends and bill backs to the VF factories. Module Repair Finance Analyst Intel June 1994  –  November 1997  (3 years 6 months) Managing inbound and outbound modules for repair from VF sites. Ordering spares parts required to process modules for the IMR repair facility as well as for neighboring labs. Monthly finacial rollup of spends and bill backs to the VF factories. Material Specialist Intel May 1988  –  June 1994  (6 years 2 months) Accepting and processing inbound and outbound freight for the Chandler site. Issuing spares from inventory to the factory for machine maintance. Material Specialist Intel May 1988  –  June 1994  (6 years 2 months) Accepting and processing inbound and outbound freight for the Chandler site. Issuing spares from inventory to the factory for machine maintance. Assistant Store Manager Store 99 April 1987  –  May 1988  (1 year 2 months) Assistant store manager in charge of customer service, employee scheduling, opening and closing, and bank deposits. Assistant Store Manager Store 99 April 1987  –  May 1988  (1 year 2 months) Assistant store manager in charge of customer service, employee scheduling, opening and closing, and bank deposits. Skills SAP Training Supply Chain Management Program Management Procurement Purchasing Process Improvement Strategic Sourcing Contract Negotiation Management Cross-functional Team... Supply Management Forecasting Supply Chain Continuous Improvement Sourcing Customer Service Global Sourcing Manufacturing Logistics Materials Management See 6+     See less Skills  SAP Training Supply Chain Management Program Management Procurement Purchasing Process Improvement Strategic Sourcing Contract Negotiation Management Cross-functional Team... Supply Management Forecasting Supply Chain Continuous Improvement Sourcing Customer Service Global Sourcing Manufacturing Logistics Materials Management See 6+     See less SAP Training Supply Chain Management Program Management Procurement Purchasing Process Improvement Strategic Sourcing Contract Negotiation Management Cross-functional Team... Supply Management Forecasting Supply Chain Continuous Improvement Sourcing Customer Service Global Sourcing Manufacturing Logistics Materials Management See 6+     See less SAP Training Supply Chain Management Program Management Procurement Purchasing Process Improvement Strategic Sourcing Contract Negotiation Management Cross-functional Team... Supply Management Forecasting Supply Chain Continuous Improvement Sourcing Customer Service Global Sourcing Manufacturing Logistics Materials Management See 6+     See less Education Mesa Community College 1986  – 1988 Arizona State University Mesa Community College 1986  – 1988 Mesa Community College 1986  – 1988 Mesa Community College 1986  – 1988 Arizona State University Arizona State University Arizona State University ", "Experience Commodity Specialist Intel Corporation June 2009  –  November 2012  (3 years 6 months) Rio Rancho Commodity Specialist Intel Corporation June 2009  –  November 2012  (3 years 6 months) Rio Rancho Commodity Specialist Intel Corporation June 2009  –  November 2012  (3 years 6 months) Rio Rancho Education University of Notre Dame - Mendoza College of Business Master of Business Administration (M.B.A.),  Corp. Finance & Operations 2006  – 2008 Wright State University Bachelor of Science (BSc),  Accounting 1995  – 1998 University of Notre Dame - Mendoza College of Business Master of Business Administration (M.B.A.),  Corp. Finance & Operations 2006  – 2008 University of Notre Dame - Mendoza College of Business Master of Business Administration (M.B.A.),  Corp. Finance & Operations 2006  – 2008 University of Notre Dame - Mendoza College of Business Master of Business Administration (M.B.A.),  Corp. Finance & Operations 2006  – 2008 Wright State University Bachelor of Science (BSc),  Accounting 1995  – 1998 Wright State University Bachelor of Science (BSc),  Accounting 1995  – 1998 Wright State University Bachelor of Science (BSc),  Accounting 1995  – 1998 ", "Experience Commodity Specialist Intel Corporation June 2005  – Present (10 years 3 months) Buyer Intel - Colorado Springs 2005  – Present (10 years) Manager, Document Handler, Purchasing Agent Lawrence Livermore National Laboratory June 1988  –  April 2004  (15 years 11 months) Commodity Specialist Intel Corporation June 2005  – Present (10 years 3 months) Commodity Specialist Intel Corporation June 2005  – Present (10 years 3 months) Buyer Intel - Colorado Springs 2005  – Present (10 years) Buyer Intel - Colorado Springs 2005  – Present (10 years) Manager, Document Handler, Purchasing Agent Lawrence Livermore National Laboratory June 1988  –  April 2004  (15 years 11 months) Manager, Document Handler, Purchasing Agent Lawrence Livermore National Laboratory June 1988  –  April 2004  (15 years 11 months) Education University of California, Berkeley BS,  Business, Option in Computer Info Systems 1984  – 1988 University of California, Berkeley BS,  Business, Option in Computer Info Systems 1984  – 1988 University of California, Berkeley BS,  Business, Option in Computer Info Systems 1984  – 1988 University of California, Berkeley BS,  Business, Option in Computer Info Systems 1984  – 1988 ", "Experience Commodity Specialist Intel Corporation July 2007  – Present (8 years 2 months) Commodity Specialist Intel Corporation July 2007  – Present (8 years 2 months) Commodity Specialist Intel Corporation July 2007  – Present (8 years 2 months) ", "Experience Commodity Specialist Intel Corporation Commodity Specialist Intel Corporation Commodity Specialist Intel Corporation "]}