{"position": "Computer Architect", "company": "Intel Corporation", "profiles": ["Skills C Circuit Design Computer Architecture Logic Design Microprocessors Processors Semiconductors VLSI Skills  C Circuit Design Computer Architecture Logic Design Microprocessors Processors Semiconductors VLSI C Circuit Design Computer Architecture Logic Design Microprocessors Processors Semiconductors VLSI C Circuit Design Computer Architecture Logic Design Microprocessors Processors Semiconductors VLSI Honors & Awards ", "Summary Expert in integrated I/O subsystems for servers and workstations. Summary Expert in integrated I/O subsystems for servers and workstations. Expert in integrated I/O subsystems for servers and workstations. Expert in integrated I/O subsystems for servers and workstations. Experience Computer Architect Intel Corporation CPU I/O Architect Intel Corporation 2008  –  2015  (7 years) Computer Architect Intel Corporation Computer Architect Intel Corporation CPU I/O Architect Intel Corporation 2008  –  2015  (7 years) CPU I/O Architect Intel Corporation 2008  –  2015  (7 years) Education Oregon State University Bachelor's degree,  Electrical and Electronics Engineering 1990  – 1994 Emphasis on computer design, microcontrollers, and control systems. Activities and Societies:  IEEE Student President of OSU chapter (1 year) Oregon State University Bachelor's degree,  Electrical and Electronics Engineering 1990  – 1994 Emphasis on computer design, microcontrollers, and control systems. Activities and Societies:  IEEE Student President of OSU chapter (1 year) Oregon State University Bachelor's degree,  Electrical and Electronics Engineering 1990  – 1994 Emphasis on computer design, microcontrollers, and control systems. Activities and Societies:  IEEE Student President of OSU chapter (1 year) Oregon State University Bachelor's degree,  Electrical and Electronics Engineering 1990  – 1994 Emphasis on computer design, microcontrollers, and control systems. Activities and Societies:  IEEE Student President of OSU chapter (1 year) ", "Skills Microarchitecture Hardware Architecture Processors Computer Architecture Microprocessors Logic Design X86 SoC VLSI Skills  Microarchitecture Hardware Architecture Processors Computer Architecture Microprocessors Logic Design X86 SoC VLSI Microarchitecture Hardware Architecture Processors Computer Architecture Microprocessors Logic Design X86 SoC VLSI Microarchitecture Hardware Architecture Processors Computer Architecture Microprocessors Logic Design X86 SoC VLSI ", "Summary Component Design Engineer who has worked on Intel's first 45nm, first 32nm, and first 22nm processors. Experienced in most aspects of processor design: custom circuit design, layout, logic synthesis, logic design, micro-architecture, architecture, and component debug.  \n \nSpecialties:  \nLogic design using System Verilog \nLogic debug with Verdi \nDefining Micro-architecture specs \nLow power design/architecture \nSynthesis and APR with Synopsys DC and ICC  \nLogic quality checks such as lintra, equivalence checking, clock domain cross checks, low power design checks.  Summary Component Design Engineer who has worked on Intel's first 45nm, first 32nm, and first 22nm processors. Experienced in most aspects of processor design: custom circuit design, layout, logic synthesis, logic design, micro-architecture, architecture, and component debug.  \n \nSpecialties:  \nLogic design using System Verilog \nLogic debug with Verdi \nDefining Micro-architecture specs \nLow power design/architecture \nSynthesis and APR with Synopsys DC and ICC  \nLogic quality checks such as lintra, equivalence checking, clock domain cross checks, low power design checks.  Component Design Engineer who has worked on Intel's first 45nm, first 32nm, and first 22nm processors. Experienced in most aspects of processor design: custom circuit design, layout, logic synthesis, logic design, micro-architecture, architecture, and component debug.  \n \nSpecialties:  \nLogic design using System Verilog \nLogic debug with Verdi \nDefining Micro-architecture specs \nLow power design/architecture \nSynthesis and APR with Synopsys DC and ICC  \nLogic quality checks such as lintra, equivalence checking, clock domain cross checks, low power design checks.  Component Design Engineer who has worked on Intel's first 45nm, first 32nm, and first 22nm processors. Experienced in most aspects of processor design: custom circuit design, layout, logic synthesis, logic design, micro-architecture, architecture, and component debug.  \n \nSpecialties:  \nLogic design using System Verilog \nLogic debug with Verdi \nDefining Micro-architecture specs \nLow power design/architecture \nSynthesis and APR with Synopsys DC and ICC  \nLogic quality checks such as lintra, equivalence checking, clock domain cross checks, low power design checks.  Experience Senior Logic Design Engineer Intel Corporation December 2012  – Present (2 years 9 months) IP Logic Design Engineer working on MIPI PHY digital front end design for IO blocks delivered to all Intel phone and tablet products. Computer Architect Intel Corporation January 2012  –  December 2012  (1 year) Worked on power management features for 2015 SoC. Defined save/restore flows for SoC timer microarchitecture and Graphics power management. Component Design Engineer Intel February 2005  –  December 2012  (7 years 11 months) Component Design Engineer responsible for custom circuit design meeting timing and power requirements for high speed processor core circuits. Also responsible for logic synthesis of power management circuits and logic coding of power management features. Component Debug Engineer Intel Corporation August 2010  –  December 2011  (1 year 5 months) Worked in post silicon debug on IvyBridge project to debug yeild failure issues and design issues. Increased yield percentage through failure identification and analysis. Increased scanout coverage for chip testing. Electronics Design Engineer SoMat Corporation July 1999  –  July 2002  (3 years 1 month) Worked on circuit design, FPGA design, and board design of rugged portable data acquisition systems. Also responsible for some manufacturing and testing oversight of products. Intern Lockheed Missiles and Space June 1998  –  August 1998  (3 months) Worked with a team designing next generation Hubble Telescope. Performed schematic entry and debugging of Digital I/O circuitry. Completed PCB layout of optics laboratory electronics. Intern Lockheed Missiles and Space August 1997  –  January 1998  (6 months) Worked in a group that designed long term atmosphere sensing satellite payload. Performed stress analysis on electronics components to ensure long term upper atmosphere reliability. Completed research and design of processor testing interface for part of the satellite payload. Senior Logic Design Engineer Intel Corporation December 2012  – Present (2 years 9 months) IP Logic Design Engineer working on MIPI PHY digital front end design for IO blocks delivered to all Intel phone and tablet products. Senior Logic Design Engineer Intel Corporation December 2012  – Present (2 years 9 months) IP Logic Design Engineer working on MIPI PHY digital front end design for IO blocks delivered to all Intel phone and tablet products. Computer Architect Intel Corporation January 2012  –  December 2012  (1 year) Worked on power management features for 2015 SoC. Defined save/restore flows for SoC timer microarchitecture and Graphics power management. Computer Architect Intel Corporation January 2012  –  December 2012  (1 year) Worked on power management features for 2015 SoC. Defined save/restore flows for SoC timer microarchitecture and Graphics power management. Component Design Engineer Intel February 2005  –  December 2012  (7 years 11 months) Component Design Engineer responsible for custom circuit design meeting timing and power requirements for high speed processor core circuits. Also responsible for logic synthesis of power management circuits and logic coding of power management features. Component Design Engineer Intel February 2005  –  December 2012  (7 years 11 months) Component Design Engineer responsible for custom circuit design meeting timing and power requirements for high speed processor core circuits. Also responsible for logic synthesis of power management circuits and logic coding of power management features. Component Debug Engineer Intel Corporation August 2010  –  December 2011  (1 year 5 months) Worked in post silicon debug on IvyBridge project to debug yeild failure issues and design issues. Increased yield percentage through failure identification and analysis. Increased scanout coverage for chip testing. Component Debug Engineer Intel Corporation August 2010  –  December 2011  (1 year 5 months) Worked in post silicon debug on IvyBridge project to debug yeild failure issues and design issues. Increased yield percentage through failure identification and analysis. Increased scanout coverage for chip testing. Electronics Design Engineer SoMat Corporation July 1999  –  July 2002  (3 years 1 month) Worked on circuit design, FPGA design, and board design of rugged portable data acquisition systems. Also responsible for some manufacturing and testing oversight of products. Electronics Design Engineer SoMat Corporation July 1999  –  July 2002  (3 years 1 month) Worked on circuit design, FPGA design, and board design of rugged portable data acquisition systems. Also responsible for some manufacturing and testing oversight of products. Intern Lockheed Missiles and Space June 1998  –  August 1998  (3 months) Worked with a team designing next generation Hubble Telescope. Performed schematic entry and debugging of Digital I/O circuitry. Completed PCB layout of optics laboratory electronics. Intern Lockheed Missiles and Space June 1998  –  August 1998  (3 months) Worked with a team designing next generation Hubble Telescope. Performed schematic entry and debugging of Digital I/O circuitry. Completed PCB layout of optics laboratory electronics. Intern Lockheed Missiles and Space August 1997  –  January 1998  (6 months) Worked in a group that designed long term atmosphere sensing satellite payload. Performed stress analysis on electronics components to ensure long term upper atmosphere reliability. Completed research and design of processor testing interface for part of the satellite payload. Intern Lockheed Missiles and Space August 1997  –  January 1998  (6 months) Worked in a group that designed long term atmosphere sensing satellite payload. Performed stress analysis on electronics components to ensure long term upper atmosphere reliability. Completed research and design of processor testing interface for part of the satellite payload. Skills Skills     Education UC Davis M.S.,  Electrical and Computer Engineering 2002  – 2004 Cornell University B.S.,  Engineering Physics August 1995  – May 1999 UC Davis M.S.,  Electrical and Computer Engineering 2002  – 2004 UC Davis M.S.,  Electrical and Computer Engineering 2002  – 2004 UC Davis M.S.,  Electrical and Computer Engineering 2002  – 2004 Cornell University B.S.,  Engineering Physics August 1995  – May 1999 Cornell University B.S.,  Engineering Physics August 1995  – May 1999 Cornell University B.S.,  Engineering Physics August 1995  – May 1999 ", "Summary • Track record on technology definition, product development, leading high-performance development teams and execution. \n• Established working relationships with worldwide computer manufacturers and enterprise software partners from US, Japan and China. Summary • Track record on technology definition, product development, leading high-performance development teams and execution. \n• Established working relationships with worldwide computer manufacturers and enterprise software partners from US, Japan and China. • Track record on technology definition, product development, leading high-performance development teams and execution. \n• Established working relationships with worldwide computer manufacturers and enterprise software partners from US, Japan and China. • Track record on technology definition, product development, leading high-performance development teams and execution. \n• Established working relationships with worldwide computer manufacturers and enterprise software partners from US, Japan and China. Languages English Native or bilingual proficiency Cantonese Native or bilingual proficiency Mandarin Native or bilingual proficiency Japanese Elementary proficiency English Native or bilingual proficiency Cantonese Native or bilingual proficiency Mandarin Native or bilingual proficiency Japanese Elementary proficiency English Native or bilingual proficiency Cantonese Native or bilingual proficiency Mandarin Native or bilingual proficiency Japanese Elementary proficiency Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Elementary proficiency Skills Embedded Systems Semiconductors Debugging ASIC Verilog SoC Computer Architecture Perl Software Engineering C Software Development Simulations Data Center High Performance... Operating Systems Architectures C++ Firmware Program Management See 4+     See less Skills  Embedded Systems Semiconductors Debugging ASIC Verilog SoC Computer Architecture Perl Software Engineering C Software Development Simulations Data Center High Performance... Operating Systems Architectures C++ Firmware Program Management See 4+     See less Embedded Systems Semiconductors Debugging ASIC Verilog SoC Computer Architecture Perl Software Engineering C Software Development Simulations Data Center High Performance... Operating Systems Architectures C++ Firmware Program Management See 4+     See less Embedded Systems Semiconductors Debugging ASIC Verilog SoC Computer Architecture Perl Software Engineering C Software Development Simulations Data Center High Performance... Operating Systems Architectures C++ Firmware Program Management See 4+     See less ", "Languages Hindi Native or bilingual proficiency marathi Native or bilingual proficiency Hindi Native or bilingual proficiency marathi Native or bilingual proficiency Hindi Native or bilingual proficiency marathi Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Sales Closing Deals Integration Data Warehousing Cloud Computing SaaS Enterprise Software Business Intelligence Product Management Business Process Marketing Negotiation Networking IT Strategy Deal Closure Sales Management PaaS Sales Enablement Sales Process CRM Salesforce.com Cross-functional Team... Go-to-market Strategy Vendor Management Pre-sales Leadership Solution Selling Selling Business Development Strategic Partnerships Professional Services Start-ups Lead Generation See 18+     See less Skills  Sales Closing Deals Integration Data Warehousing Cloud Computing SaaS Enterprise Software Business Intelligence Product Management Business Process Marketing Negotiation Networking IT Strategy Deal Closure Sales Management PaaS Sales Enablement Sales Process CRM Salesforce.com Cross-functional Team... Go-to-market Strategy Vendor Management Pre-sales Leadership Solution Selling Selling Business Development Strategic Partnerships Professional Services Start-ups Lead Generation See 18+     See less Sales Closing Deals Integration Data Warehousing Cloud Computing SaaS Enterprise Software Business Intelligence Product Management Business Process Marketing Negotiation Networking IT Strategy Deal Closure Sales Management PaaS Sales Enablement Sales Process CRM Salesforce.com Cross-functional Team... Go-to-market Strategy Vendor Management Pre-sales Leadership Solution Selling Selling Business Development Strategic Partnerships Professional Services Start-ups Lead Generation See 18+     See less Sales Closing Deals Integration Data Warehousing Cloud Computing SaaS Enterprise Software Business Intelligence Product Management Business Process Marketing Negotiation Networking IT Strategy Deal Closure Sales Management PaaS Sales Enablement Sales Process CRM Salesforce.com Cross-functional Team... Go-to-market Strategy Vendor Management Pre-sales Leadership Solution Selling Selling Business Development Strategic Partnerships Professional Services Start-ups Lead Generation See 18+     See less ", "Languages English Native or bilingual proficiency Hebrew Native or bilingual proficiency English Native or bilingual proficiency Hebrew Native or bilingual proficiency English Native or bilingual proficiency Hebrew Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Processors Microprocessors Hardware Architecture VLSI Intel Architectures Hardware Technical Leadership Low-power Design Servers SoC Computer Architecture Systems Engineering ASIC Skills  Processors Microprocessors Hardware Architecture VLSI Intel Architectures Hardware Technical Leadership Low-power Design Servers SoC Computer Architecture Systems Engineering ASIC Processors Microprocessors Hardware Architecture VLSI Intel Architectures Hardware Technical Leadership Low-power Design Servers SoC Computer Architecture Systems Engineering ASIC Processors Microprocessors Hardware Architecture VLSI Intel Architectures Hardware Technical Leadership Low-power Design Servers SoC Computer Architecture Systems Engineering ASIC ", "Skills Algorithms Embedded Systems Computer Architecture Simulink C Verilog Perl Simulations SystemVerilog Parallel Computing Architecture Matlab Python Java VHDL ASIC Labview Architectures Machine Learning Programming Data Analysis VLSI Linux C++ See 9+     See less Skills  Algorithms Embedded Systems Computer Architecture Simulink C Verilog Perl Simulations SystemVerilog Parallel Computing Architecture Matlab Python Java VHDL ASIC Labview Architectures Machine Learning Programming Data Analysis VLSI Linux C++ See 9+     See less Algorithms Embedded Systems Computer Architecture Simulink C Verilog Perl Simulations SystemVerilog Parallel Computing Architecture Matlab Python Java VHDL ASIC Labview Architectures Machine Learning Programming Data Analysis VLSI Linux C++ See 9+     See less Algorithms Embedded Systems Computer Architecture Simulink C Verilog Perl Simulations SystemVerilog Parallel Computing Architecture Matlab Python Java VHDL ASIC Labview Architectures Machine Learning Programming Data Analysis VLSI Linux C++ See 9+     See less ", "Summary Specialties:Computer Architecture, Operating Systems,LTE Summary Specialties:Computer Architecture, Operating Systems,LTE Specialties:Computer Architecture, Operating Systems,LTE Specialties:Computer Architecture, Operating Systems,LTE Experience Computer Architect Intel Corporation December 2013  – Present (1 year 9 months) San Francisco Bay Area Working as a Computer Architect in the Server Architecture Team. Test Engineer Intel Corporation June 2012  –  December 2013  (1 year 7 months) San Francisco Bay Area Responsibilities included testing of MMS and RCS on various flavors of Android OS on different mobile devices, raising bugs, following up on them and getting the issues fixed. \no\tMMS Testing: Tested MMS on various flavors of Android across multiple phone products. Executed a feature-based test suite (selected from a baseline of ~150 test), triaged the failures and debugged to root cause.  \no\tRCS (Rich Communication Suite) Testing: Proactively worked to validate the test suite functionality, and engaged with application development team early on. Svcs Software Engineer II Ericsson April 2012  –  June 2012  (3 months) Dallas/Fort Worth Area Create and or review Method of Procedures for various activities in RAN team. \nProvide time estimates for activities performed during deployment. Field Service Engineer II Ericsson July 2010  –  April 2012  (1 year 10 months) Dallas/Fort Worth Area Field Service Engineer 2 (Network Deployment Services) - Ericsson: From Jul 2010  \n•\tMarket lead for various LTE markets and different customers. \n•\tTroubleshoot hardware performance issues. Create and verify network status reports.  \n•\tCreate and run scripts in a Linux based environment to implement different features in the node. \n•\tAssist in site shakedown, tuning and cluster drive activities. \n•\tCo-ordinate between different teams to solve issues. \n \nField Service Engineer 2(Integration) – Ericsson: Dec 2010 – Mar 2011 \n•\tScratch load the node with basic software. \n•\tPerform software upgrades. \n•\tRun scripts to set various parameters that affect network performance in a Linux based environment. \n•\tSolve IP mismatch problem in OSS (Operations Support System). Intern Delphi –TVS December 2007  –  January 2008  (2 months) Sriperumbudur, Tamil Nadu •\tHardware and Software Testing of Exhaust Gas Regulator (EGR) using Motorola (FreeScale) HC08 Microcontroller.  \n•\tDesigned an efficient automated testing circuitry for the existing EGR controller to ensure 100% check in the production line. Computer Architect Intel Corporation December 2013  – Present (1 year 9 months) San Francisco Bay Area Working as a Computer Architect in the Server Architecture Team. Computer Architect Intel Corporation December 2013  – Present (1 year 9 months) San Francisco Bay Area Working as a Computer Architect in the Server Architecture Team. Test Engineer Intel Corporation June 2012  –  December 2013  (1 year 7 months) San Francisco Bay Area Responsibilities included testing of MMS and RCS on various flavors of Android OS on different mobile devices, raising bugs, following up on them and getting the issues fixed. \no\tMMS Testing: Tested MMS on various flavors of Android across multiple phone products. Executed a feature-based test suite (selected from a baseline of ~150 test), triaged the failures and debugged to root cause.  \no\tRCS (Rich Communication Suite) Testing: Proactively worked to validate the test suite functionality, and engaged with application development team early on. Test Engineer Intel Corporation June 2012  –  December 2013  (1 year 7 months) San Francisco Bay Area Responsibilities included testing of MMS and RCS on various flavors of Android OS on different mobile devices, raising bugs, following up on them and getting the issues fixed. \no\tMMS Testing: Tested MMS on various flavors of Android across multiple phone products. Executed a feature-based test suite (selected from a baseline of ~150 test), triaged the failures and debugged to root cause.  \no\tRCS (Rich Communication Suite) Testing: Proactively worked to validate the test suite functionality, and engaged with application development team early on. Svcs Software Engineer II Ericsson April 2012  –  June 2012  (3 months) Dallas/Fort Worth Area Create and or review Method of Procedures for various activities in RAN team. \nProvide time estimates for activities performed during deployment. Svcs Software Engineer II Ericsson April 2012  –  June 2012  (3 months) Dallas/Fort Worth Area Create and or review Method of Procedures for various activities in RAN team. \nProvide time estimates for activities performed during deployment. Field Service Engineer II Ericsson July 2010  –  April 2012  (1 year 10 months) Dallas/Fort Worth Area Field Service Engineer 2 (Network Deployment Services) - Ericsson: From Jul 2010  \n•\tMarket lead for various LTE markets and different customers. \n•\tTroubleshoot hardware performance issues. Create and verify network status reports.  \n•\tCreate and run scripts in a Linux based environment to implement different features in the node. \n•\tAssist in site shakedown, tuning and cluster drive activities. \n•\tCo-ordinate between different teams to solve issues. \n \nField Service Engineer 2(Integration) – Ericsson: Dec 2010 – Mar 2011 \n•\tScratch load the node with basic software. \n•\tPerform software upgrades. \n•\tRun scripts to set various parameters that affect network performance in a Linux based environment. \n•\tSolve IP mismatch problem in OSS (Operations Support System). Field Service Engineer II Ericsson July 2010  –  April 2012  (1 year 10 months) Dallas/Fort Worth Area Field Service Engineer 2 (Network Deployment Services) - Ericsson: From Jul 2010  \n•\tMarket lead for various LTE markets and different customers. \n•\tTroubleshoot hardware performance issues. Create and verify network status reports.  \n•\tCreate and run scripts in a Linux based environment to implement different features in the node. \n•\tAssist in site shakedown, tuning and cluster drive activities. \n•\tCo-ordinate between different teams to solve issues. \n \nField Service Engineer 2(Integration) – Ericsson: Dec 2010 – Mar 2011 \n•\tScratch load the node with basic software. \n•\tPerform software upgrades. \n•\tRun scripts to set various parameters that affect network performance in a Linux based environment. \n•\tSolve IP mismatch problem in OSS (Operations Support System). Intern Delphi –TVS December 2007  –  January 2008  (2 months) Sriperumbudur, Tamil Nadu •\tHardware and Software Testing of Exhaust Gas Regulator (EGR) using Motorola (FreeScale) HC08 Microcontroller.  \n•\tDesigned an efficient automated testing circuitry for the existing EGR controller to ensure 100% check in the production line. Intern Delphi –TVS December 2007  –  January 2008  (2 months) Sriperumbudur, Tamil Nadu •\tHardware and Software Testing of Exhaust Gas Regulator (EGR) using Motorola (FreeScale) HC08 Microcontroller.  \n•\tDesigned an efficient automated testing circuitry for the existing EGR controller to ensure 100% check in the production line. Languages English Tamil Hindi English Tamil Hindi English Tamil Hindi Skills C C++ Unix Linux Operating Systems Computer Architecture Hardware Troubleshooting Programming LTE Analytical Capability Problem Solving Test Automation IP Electronics Networking Debugging VLSI See 3+     See less Skills  C C++ Unix Linux Operating Systems Computer Architecture Hardware Troubleshooting Programming LTE Analytical Capability Problem Solving Test Automation IP Electronics Networking Debugging VLSI See 3+     See less C C++ Unix Linux Operating Systems Computer Architecture Hardware Troubleshooting Programming LTE Analytical Capability Problem Solving Test Automation IP Electronics Networking Debugging VLSI See 3+     See less C C++ Unix Linux Operating Systems Computer Architecture Hardware Troubleshooting Programming LTE Analytical Capability Problem Solving Test Automation IP Electronics Networking Debugging VLSI See 3+     See less Education The University of Texas at Dallas MS,  Computer Engineering 2008  – 2010 Shanmugha Arts, Science, Technology and Research Academy Bachelor of Technology,  Electronics & Communication Engineering 2004  – 2008 RSK Higher Secondary School 2002  – 2004 The University of Texas at Dallas MS,  Computer Engineering 2008  – 2010 The University of Texas at Dallas MS,  Computer Engineering 2008  – 2010 The University of Texas at Dallas MS,  Computer Engineering 2008  – 2010 Shanmugha Arts, Science, Technology and Research Academy Bachelor of Technology,  Electronics & Communication Engineering 2004  – 2008 Shanmugha Arts, Science, Technology and Research Academy Bachelor of Technology,  Electronics & Communication Engineering 2004  – 2008 Shanmugha Arts, Science, Technology and Research Academy Bachelor of Technology,  Electronics & Communication Engineering 2004  – 2008 RSK Higher Secondary School 2002  – 2004 RSK Higher Secondary School 2002  – 2004 RSK Higher Secondary School 2002  – 2004 Honors & Awards Overall second position in the SASTRA University Exam SASTRA University May 2005 Overall second position in Programming in C SASTRA University December 2005 Scholarship award SASTRA University May 2005 Awarded scholarship for securing the highest % in all papers in B.Tech I Year (II semester) examinations held in May 2005. Merit Scholarship SASTRA University May 2005 ‘Merit Scholarship’ for being among the top 10% of the batch during 2004-05, in the SASTRA University. Overall second position in the SASTRA University Exam SASTRA University May 2005 Overall second position in the SASTRA University Exam SASTRA University May 2005 Overall second position in the SASTRA University Exam SASTRA University May 2005 Overall second position in Programming in C SASTRA University December 2005 Overall second position in Programming in C SASTRA University December 2005 Overall second position in Programming in C SASTRA University December 2005 Scholarship award SASTRA University May 2005 Awarded scholarship for securing the highest % in all papers in B.Tech I Year (II semester) examinations held in May 2005. Scholarship award SASTRA University May 2005 Awarded scholarship for securing the highest % in all papers in B.Tech I Year (II semester) examinations held in May 2005. Scholarship award SASTRA University May 2005 Awarded scholarship for securing the highest % in all papers in B.Tech I Year (II semester) examinations held in May 2005. Merit Scholarship SASTRA University May 2005 ‘Merit Scholarship’ for being among the top 10% of the batch during 2004-05, in the SASTRA University. Merit Scholarship SASTRA University May 2005 ‘Merit Scholarship’ for being among the top 10% of the batch during 2004-05, in the SASTRA University. Merit Scholarship SASTRA University May 2005 ‘Merit Scholarship’ for being among the top 10% of the batch during 2004-05, in the SASTRA University. ", "Languages   Skills Skills     Education University of Wisconsin-Madison 1990  – 1997 Madison Area Technical College 1989  – 1990 University of Wisconsin-Madison 1990  – 1997 University of Wisconsin-Madison 1990  – 1997 University of Wisconsin-Madison 1990  – 1997 Madison Area Technical College 1989  – 1990 Madison Area Technical College 1989  – 1990 Madison Area Technical College 1989  – 1990 Honors & Awards ", "Skills Computer Vision Image Processing Pattern Recognition Signal Processing C++ Algorithms Machine Learning Software Engineering Skills  Computer Vision Image Processing Pattern Recognition Signal Processing C++ Algorithms Machine Learning Software Engineering Computer Vision Image Processing Pattern Recognition Signal Processing C++ Algorithms Machine Learning Software Engineering Computer Vision Image Processing Pattern Recognition Signal Processing C++ Algorithms Machine Learning Software Engineering Honors & Awards ", "Experience Computer Architect Intel Corporation November 2013  – Present (1 year 10 months) Computer Architect Tilera Corporation February 2006  –  November 2013  (7 years 10 months) Computer Architect Intel Corporation 2001  –  2006  (5 years) Research Associate Brown University 1997  –  2001  (4 years) Computer Architect Intel Corporation November 2013  – Present (1 year 10 months) Computer Architect Intel Corporation November 2013  – Present (1 year 10 months) Computer Architect Tilera Corporation February 2006  –  November 2013  (7 years 10 months) Computer Architect Tilera Corporation February 2006  –  November 2013  (7 years 10 months) Computer Architect Intel Corporation 2001  –  2006  (5 years) Computer Architect Intel Corporation 2001  –  2006  (5 years) Research Associate Brown University 1997  –  2001  (4 years) Research Associate Brown University 1997  –  2001  (4 years) Education University of Michigan Ph.D,  Physics 1990  – 1997 國立清華大學 Bachelor of Science (BS),  Physics 1984  – 1988 University of Michigan Ph.D,  Physics 1990  – 1997 University of Michigan Ph.D,  Physics 1990  – 1997 University of Michigan Ph.D,  Physics 1990  – 1997 國立清華大學 Bachelor of Science (BS),  Physics 1984  – 1988 國立清華大學 Bachelor of Science (BS),  Physics 1984  – 1988 國立清華大學 Bachelor of Science (BS),  Physics 1984  – 1988 ", "Skills Microprocessors Computer Architecture Processors SoC Microarchitecture Debugging Verilog VLSI RTL design SystemVerilog Perl Hardware Architecture Semiconductors Simulations RTL Design Skills  Microprocessors Computer Architecture Processors SoC Microarchitecture Debugging Verilog VLSI RTL design SystemVerilog Perl Hardware Architecture Semiconductors Simulations RTL Design Microprocessors Computer Architecture Processors SoC Microarchitecture Debugging Verilog VLSI RTL design SystemVerilog Perl Hardware Architecture Semiconductors Simulations RTL Design Microprocessors Computer Architecture Processors SoC Microarchitecture Debugging Verilog VLSI RTL design SystemVerilog Perl Hardware Architecture Semiconductors Simulations RTL Design ", "Experience Computer Architect Intel Corporation November 2010  – Present (4 years 10 months) Computer Architect Intel Corporation November 2010  – Present (4 years 10 months) Computer Architect Intel Corporation November 2010  – Present (4 years 10 months) Skills Embedded Systems Verilog Simulations Skills  Embedded Systems Verilog Simulations Embedded Systems Verilog Simulations Embedded Systems Verilog Simulations Education University of California, Los Angeles Doctor of Philosophy (PhD),  Computer Science 2007  – 2011 University of California, Los Angeles Bachelor of Science (BS),  Computer Science and Engineering 2004  – 2007 University of California, Los Angeles Doctor of Philosophy (PhD),  Computer Science 2007  – 2011 University of California, Los Angeles Doctor of Philosophy (PhD),  Computer Science 2007  – 2011 University of California, Los Angeles Doctor of Philosophy (PhD),  Computer Science 2007  – 2011 University of California, Los Angeles Bachelor of Science (BS),  Computer Science and Engineering 2004  – 2007 University of California, Los Angeles Bachelor of Science (BS),  Computer Science and Engineering 2004  – 2007 University of California, Los Angeles Bachelor of Science (BS),  Computer Science and Engineering 2004  – 2007 ", "Experience Sr. Computer Architect Intel Corporation January 2003  – Present (12 years 8 months) Hillsboro, OR Member of performance/power architecture and modeling group Analyzing simulations to quantify tradeoffs, compare alternatives, and make recommendations. Current work in performance modeling of high-end graphics systems. Leader of team modeling and testing central system agent of SoC projects, with emphasis on Quality-of-Service targets. Significant contributions to cache and memory controller of 5 microprocessor generations and Arrandale chipset. Led team doing performance modeling and validation of Arrandale chipset. Extended microprocessor/platform model, boosted its speed 30%, and added major components, including interface with graphics simulator, fast cache warmup, flexible C++ library for cache modeling, and 5x compression for large trace files. Assistant Professor University of Delaware January 1997  –  January 2003  (6 years 1 month) Newark, DE Founding member of CAPSL (Computer Architecture and Parallel Systems Laboratory) when advisor (Guang R. Gao) moved to UDel. Postdoc after finishing Ph.D. at McGill; Assistant Professor in 2000. Implemented FPGA co-processor, parallel programming models, environments and languages for multithreaded architectures, based on EARTH system in Ph.D. dissertation. Helped apply EARTH concepts to Hybrid Technology Multi-Threading (HTMT) project involving nearly a dozen research groups. Co-designed parallel runtime system to emulate EARTH on Beowulf clusters. Made improvements to networking, runtime system, and Linux kernel to scale performance to 100+ nodes. Developed compilation and code translation techniques for both EARTH and HTMT. Designed and taught courses in computer architecture, parallel computing, and digital logic. System administration (Solaris, Linux) and lab management. CTO ET International, Inc 2000  –  2003  (3 years) Newark, DE Helped establish computer start-up at the University of Delaware with Guang R. Gao and a board of technical, legal and financial experts. Research and Teaching Assistant McGill University September 1990  –  December 1996  (6 years 4 months) Montreal, Quebec Areas of research included parallelism, speculation and branch prediction, caches, multithreading, and parallel systems. Co-developed EARTH, a new multithreading model based on principles of dataflow computation but leveraging the efficiencies and economies-of-scale of conventional microprocessors (research described in dissertation). Four-term Faculty Lecturer for introductory programming course (1993-1994). Teaching Assistant for graduate VLSI course for four terms,  \nresponsible for designing course projects.  \n Sr. Engineer Codex Corporation September 1985  –  September 1990  (5 years 1 month) Canton, MA Primary engineer responsible for specification, design and support of a 30K-transistor full-custom \nrandom-logic data communications chip for in-house use. Interfaced with diverse product groups to \ndefine product needs; implemented logic, developed tests, wrote documentation. Verilog design of \nhigh-speed data-communications chip. Development of in-house tools, including CAD software and a data-specific 30x compression tool. Research and Teaching Assistant Massachusetts Institute of Technology (MIT) September 1983  –  August 1985  (2 years) Cambridge, MA Devised techniques for fault-tolerance in dataflow computer systems. Designed \"Enable Memory\"​ for synchronizing operations in dataflow computers with Guang R. Gao (later fabricated and tested). Taught recitation sections for undergraduate software engineering lab course, designed and graded lab work and exams. Software Engineer Codex Corporation June 1984  –  August 1984  (3 months) Canton, MA Designed and produced a major component of a user interface for a network \ncontroller. Programmer Computervision Corporation February 1983  –  August 1983  (7 months) Bedford, MA Specified and designed a programmable package for interfacing company minicomputers with customer LANs. Supervised second programmer and traveled to customer site in Japan for beta test. Also wrote programmable user interfaces and rewrote critical code in assembly language for speed. Programmer Santa Barbara Research Center June 1981  –  August 1981  (3 months) Goleta, CA Specified, designed and produced a database system for semiconductor test data. Summer Student TRW June 1980  –  August 1980  (3 months) Greater Los Angeles Area Provided software support for a team developing satellite guidance software. Sr. Computer Architect Intel Corporation January 2003  – Present (12 years 8 months) Hillsboro, OR Member of performance/power architecture and modeling group Analyzing simulations to quantify tradeoffs, compare alternatives, and make recommendations. Current work in performance modeling of high-end graphics systems. Leader of team modeling and testing central system agent of SoC projects, with emphasis on Quality-of-Service targets. Significant contributions to cache and memory controller of 5 microprocessor generations and Arrandale chipset. Led team doing performance modeling and validation of Arrandale chipset. Extended microprocessor/platform model, boosted its speed 30%, and added major components, including interface with graphics simulator, fast cache warmup, flexible C++ library for cache modeling, and 5x compression for large trace files. Sr. Computer Architect Intel Corporation January 2003  – Present (12 years 8 months) Hillsboro, OR Member of performance/power architecture and modeling group Analyzing simulations to quantify tradeoffs, compare alternatives, and make recommendations. Current work in performance modeling of high-end graphics systems. Leader of team modeling and testing central system agent of SoC projects, with emphasis on Quality-of-Service targets. Significant contributions to cache and memory controller of 5 microprocessor generations and Arrandale chipset. Led team doing performance modeling and validation of Arrandale chipset. Extended microprocessor/platform model, boosted its speed 30%, and added major components, including interface with graphics simulator, fast cache warmup, flexible C++ library for cache modeling, and 5x compression for large trace files. Assistant Professor University of Delaware January 1997  –  January 2003  (6 years 1 month) Newark, DE Founding member of CAPSL (Computer Architecture and Parallel Systems Laboratory) when advisor (Guang R. Gao) moved to UDel. Postdoc after finishing Ph.D. at McGill; Assistant Professor in 2000. Implemented FPGA co-processor, parallel programming models, environments and languages for multithreaded architectures, based on EARTH system in Ph.D. dissertation. Helped apply EARTH concepts to Hybrid Technology Multi-Threading (HTMT) project involving nearly a dozen research groups. Co-designed parallel runtime system to emulate EARTH on Beowulf clusters. Made improvements to networking, runtime system, and Linux kernel to scale performance to 100+ nodes. Developed compilation and code translation techniques for both EARTH and HTMT. Designed and taught courses in computer architecture, parallel computing, and digital logic. System administration (Solaris, Linux) and lab management. Assistant Professor University of Delaware January 1997  –  January 2003  (6 years 1 month) Newark, DE Founding member of CAPSL (Computer Architecture and Parallel Systems Laboratory) when advisor (Guang R. Gao) moved to UDel. Postdoc after finishing Ph.D. at McGill; Assistant Professor in 2000. Implemented FPGA co-processor, parallel programming models, environments and languages for multithreaded architectures, based on EARTH system in Ph.D. dissertation. Helped apply EARTH concepts to Hybrid Technology Multi-Threading (HTMT) project involving nearly a dozen research groups. Co-designed parallel runtime system to emulate EARTH on Beowulf clusters. Made improvements to networking, runtime system, and Linux kernel to scale performance to 100+ nodes. Developed compilation and code translation techniques for both EARTH and HTMT. Designed and taught courses in computer architecture, parallel computing, and digital logic. System administration (Solaris, Linux) and lab management. CTO ET International, Inc 2000  –  2003  (3 years) Newark, DE Helped establish computer start-up at the University of Delaware with Guang R. Gao and a board of technical, legal and financial experts. CTO ET International, Inc 2000  –  2003  (3 years) Newark, DE Helped establish computer start-up at the University of Delaware with Guang R. Gao and a board of technical, legal and financial experts. Research and Teaching Assistant McGill University September 1990  –  December 1996  (6 years 4 months) Montreal, Quebec Areas of research included parallelism, speculation and branch prediction, caches, multithreading, and parallel systems. Co-developed EARTH, a new multithreading model based on principles of dataflow computation but leveraging the efficiencies and economies-of-scale of conventional microprocessors (research described in dissertation). Four-term Faculty Lecturer for introductory programming course (1993-1994). Teaching Assistant for graduate VLSI course for four terms,  \nresponsible for designing course projects.  \n Research and Teaching Assistant McGill University September 1990  –  December 1996  (6 years 4 months) Montreal, Quebec Areas of research included parallelism, speculation and branch prediction, caches, multithreading, and parallel systems. Co-developed EARTH, a new multithreading model based on principles of dataflow computation but leveraging the efficiencies and economies-of-scale of conventional microprocessors (research described in dissertation). Four-term Faculty Lecturer for introductory programming course (1993-1994). Teaching Assistant for graduate VLSI course for four terms,  \nresponsible for designing course projects.  \n Sr. Engineer Codex Corporation September 1985  –  September 1990  (5 years 1 month) Canton, MA Primary engineer responsible for specification, design and support of a 30K-transistor full-custom \nrandom-logic data communications chip for in-house use. Interfaced with diverse product groups to \ndefine product needs; implemented logic, developed tests, wrote documentation. Verilog design of \nhigh-speed data-communications chip. Development of in-house tools, including CAD software and a data-specific 30x compression tool. Sr. Engineer Codex Corporation September 1985  –  September 1990  (5 years 1 month) Canton, MA Primary engineer responsible for specification, design and support of a 30K-transistor full-custom \nrandom-logic data communications chip for in-house use. Interfaced with diverse product groups to \ndefine product needs; implemented logic, developed tests, wrote documentation. Verilog design of \nhigh-speed data-communications chip. Development of in-house tools, including CAD software and a data-specific 30x compression tool. Research and Teaching Assistant Massachusetts Institute of Technology (MIT) September 1983  –  August 1985  (2 years) Cambridge, MA Devised techniques for fault-tolerance in dataflow computer systems. Designed \"Enable Memory\"​ for synchronizing operations in dataflow computers with Guang R. Gao (later fabricated and tested). Taught recitation sections for undergraduate software engineering lab course, designed and graded lab work and exams. Research and Teaching Assistant Massachusetts Institute of Technology (MIT) September 1983  –  August 1985  (2 years) Cambridge, MA Devised techniques for fault-tolerance in dataflow computer systems. Designed \"Enable Memory\"​ for synchronizing operations in dataflow computers with Guang R. Gao (later fabricated and tested). Taught recitation sections for undergraduate software engineering lab course, designed and graded lab work and exams. Software Engineer Codex Corporation June 1984  –  August 1984  (3 months) Canton, MA Designed and produced a major component of a user interface for a network \ncontroller. Software Engineer Codex Corporation June 1984  –  August 1984  (3 months) Canton, MA Designed and produced a major component of a user interface for a network \ncontroller. Programmer Computervision Corporation February 1983  –  August 1983  (7 months) Bedford, MA Specified and designed a programmable package for interfacing company minicomputers with customer LANs. Supervised second programmer and traveled to customer site in Japan for beta test. Also wrote programmable user interfaces and rewrote critical code in assembly language for speed. Programmer Computervision Corporation February 1983  –  August 1983  (7 months) Bedford, MA Specified and designed a programmable package for interfacing company minicomputers with customer LANs. Supervised second programmer and traveled to customer site in Japan for beta test. Also wrote programmable user interfaces and rewrote critical code in assembly language for speed. Programmer Santa Barbara Research Center June 1981  –  August 1981  (3 months) Goleta, CA Specified, designed and produced a database system for semiconductor test data. Programmer Santa Barbara Research Center June 1981  –  August 1981  (3 months) Goleta, CA Specified, designed and produced a database system for semiconductor test data. Summer Student TRW June 1980  –  August 1980  (3 months) Greater Los Angeles Area Provided software support for a team developing satellite guidance software. Summer Student TRW June 1980  –  August 1980  (3 months) Greater Los Angeles Area Provided software support for a team developing satellite guidance software. Skills Computer Architecture Parallel Computing High Performance... Multithreading SoC Simulation Software Memory Hierarchies C++ Verilog Debugging Perl QoS Data Compression Linux C Beowulf Clusters Dataflow Computers Logic Design Cache Coherency Fault Tolerance LaTeX Discrete Mathematics Assembly Language Microcode MPI Algorithms See 11+     See less Skills  Computer Architecture Parallel Computing High Performance... Multithreading SoC Simulation Software Memory Hierarchies C++ Verilog Debugging Perl QoS Data Compression Linux C Beowulf Clusters Dataflow Computers Logic Design Cache Coherency Fault Tolerance LaTeX Discrete Mathematics Assembly Language Microcode MPI Algorithms See 11+     See less Computer Architecture Parallel Computing High Performance... Multithreading SoC Simulation Software Memory Hierarchies C++ Verilog Debugging Perl QoS Data Compression Linux C Beowulf Clusters Dataflow Computers Logic Design Cache Coherency Fault Tolerance LaTeX Discrete Mathematics Assembly Language Microcode MPI Algorithms See 11+     See less Computer Architecture Parallel Computing High Performance... Multithreading SoC Simulation Software Memory Hierarchies C++ Verilog Debugging Perl QoS Data Compression Linux C Beowulf Clusters Dataflow Computers Logic Design Cache Coherency Fault Tolerance LaTeX Discrete Mathematics Assembly Language Microcode MPI Algorithms See 11+     See less Education McGill University Doctor of Philosophy (Ph.D.),  Computer Science , 4.0 1990  – 1999 Member of ACAPS lab (Advanced Compilers, Architectures and Parallel Systems), research assistant for Guang R. Gao. Dissertation: \"EARTH: An Efficient Architecture for Running Threads,\"  \nCourses: Information Structures; Digital Signal Processing Massachusetts Institute of Technology Master of Science (MS),  Computer Science , 5.0/5.0 1983  – 1985 Member of Computation Structures Group under Jack B. Dennis. Thesis: \"Adding Fault-Tolerance to a Static Data Flow Supercomputer.\" Courses: Concepts in Modern Programming Languages; Computer System Architecture; Dataflow Computer Systems; Introduction to VLSI Systems Massachusetts Institute of Technology Bachelor of Science (BS),  Electrical Engineering and Computer Science , 4.8/5.0 1979  – 1983 Undergraduate research in Computation Structures Group under Jack B. Dennis. Thesis: \"Text Compression by Mapping Keywords into Infrequent Character Codes\" (supervised by Peter Elias). Courses included: Structure and Interpretation of Computer Programs; Computation Structures; Computer Systems Engineering; Computer Language Engineering; Introduction to Software Engineering; Computability, Automata, and Formal Languages; Introduction to Algorithms; Artificial Intelligence; Digital Systems Lab; Circuits and Electronics; Signals and Systems; Probabilistic Systems Analysis; Technical Writing. Humanities concentration in History. Clairemont HS (San Diego, CA) High School , 3.9/4.0 1976  – 1979 The real school from \"Fast Times at Ridgemont High\" (though the events therein took place the year after I graduated, so I never met Cameron Crowe; besides, most of the characters were composites). Activities and Societies:  Math team (placed in top 100 nationwide in MAA math test in senior year). Computer club; finalist in California science fair for project writing BASIC compiler for microcomputers. Voted \"Most Intellectual\" (male). McGill University Doctor of Philosophy (Ph.D.),  Computer Science , 4.0 1990  – 1999 Member of ACAPS lab (Advanced Compilers, Architectures and Parallel Systems), research assistant for Guang R. Gao. Dissertation: \"EARTH: An Efficient Architecture for Running Threads,\"  \nCourses: Information Structures; Digital Signal Processing McGill University Doctor of Philosophy (Ph.D.),  Computer Science , 4.0 1990  – 1999 Member of ACAPS lab (Advanced Compilers, Architectures and Parallel Systems), research assistant for Guang R. Gao. Dissertation: \"EARTH: An Efficient Architecture for Running Threads,\"  \nCourses: Information Structures; Digital Signal Processing McGill University Doctor of Philosophy (Ph.D.),  Computer Science , 4.0 1990  – 1999 Member of ACAPS lab (Advanced Compilers, Architectures and Parallel Systems), research assistant for Guang R. Gao. Dissertation: \"EARTH: An Efficient Architecture for Running Threads,\"  \nCourses: Information Structures; Digital Signal Processing Massachusetts Institute of Technology Master of Science (MS),  Computer Science , 5.0/5.0 1983  – 1985 Member of Computation Structures Group under Jack B. Dennis. Thesis: \"Adding Fault-Tolerance to a Static Data Flow Supercomputer.\" Courses: Concepts in Modern Programming Languages; Computer System Architecture; Dataflow Computer Systems; Introduction to VLSI Systems Massachusetts Institute of Technology Master of Science (MS),  Computer Science , 5.0/5.0 1983  – 1985 Member of Computation Structures Group under Jack B. Dennis. Thesis: \"Adding Fault-Tolerance to a Static Data Flow Supercomputer.\" Courses: Concepts in Modern Programming Languages; Computer System Architecture; Dataflow Computer Systems; Introduction to VLSI Systems Massachusetts Institute of Technology Master of Science (MS),  Computer Science , 5.0/5.0 1983  – 1985 Member of Computation Structures Group under Jack B. Dennis. Thesis: \"Adding Fault-Tolerance to a Static Data Flow Supercomputer.\" Courses: Concepts in Modern Programming Languages; Computer System Architecture; Dataflow Computer Systems; Introduction to VLSI Systems Massachusetts Institute of Technology Bachelor of Science (BS),  Electrical Engineering and Computer Science , 4.8/5.0 1979  – 1983 Undergraduate research in Computation Structures Group under Jack B. Dennis. Thesis: \"Text Compression by Mapping Keywords into Infrequent Character Codes\" (supervised by Peter Elias). Courses included: Structure and Interpretation of Computer Programs; Computation Structures; Computer Systems Engineering; Computer Language Engineering; Introduction to Software Engineering; Computability, Automata, and Formal Languages; Introduction to Algorithms; Artificial Intelligence; Digital Systems Lab; Circuits and Electronics; Signals and Systems; Probabilistic Systems Analysis; Technical Writing. Humanities concentration in History. Massachusetts Institute of Technology Bachelor of Science (BS),  Electrical Engineering and Computer Science , 4.8/5.0 1979  – 1983 Undergraduate research in Computation Structures Group under Jack B. Dennis. Thesis: \"Text Compression by Mapping Keywords into Infrequent Character Codes\" (supervised by Peter Elias). Courses included: Structure and Interpretation of Computer Programs; Computation Structures; Computer Systems Engineering; Computer Language Engineering; Introduction to Software Engineering; Computability, Automata, and Formal Languages; Introduction to Algorithms; Artificial Intelligence; Digital Systems Lab; Circuits and Electronics; Signals and Systems; Probabilistic Systems Analysis; Technical Writing. Humanities concentration in History. Massachusetts Institute of Technology Bachelor of Science (BS),  Electrical Engineering and Computer Science , 4.8/5.0 1979  – 1983 Undergraduate research in Computation Structures Group under Jack B. Dennis. Thesis: \"Text Compression by Mapping Keywords into Infrequent Character Codes\" (supervised by Peter Elias). Courses included: Structure and Interpretation of Computer Programs; Computation Structures; Computer Systems Engineering; Computer Language Engineering; Introduction to Software Engineering; Computability, Automata, and Formal Languages; Introduction to Algorithms; Artificial Intelligence; Digital Systems Lab; Circuits and Electronics; Signals and Systems; Probabilistic Systems Analysis; Technical Writing. Humanities concentration in History. Clairemont HS (San Diego, CA) High School , 3.9/4.0 1976  – 1979 The real school from \"Fast Times at Ridgemont High\" (though the events therein took place the year after I graduated, so I never met Cameron Crowe; besides, most of the characters were composites). Activities and Societies:  Math team (placed in top 100 nationwide in MAA math test in senior year). Computer club; finalist in California science fair for project writing BASIC compiler for microcomputers. Voted \"Most Intellectual\" (male). Clairemont HS (San Diego, CA) High School , 3.9/4.0 1976  – 1979 The real school from \"Fast Times at Ridgemont High\" (though the events therein took place the year after I graduated, so I never met Cameron Crowe; besides, most of the characters were composites). Activities and Societies:  Math team (placed in top 100 nationwide in MAA math test in senior year). Computer club; finalist in California science fair for project writing BASIC compiler for microcomputers. Voted \"Most Intellectual\" (male). Clairemont HS (San Diego, CA) High School , 3.9/4.0 1976  – 1979 The real school from \"Fast Times at Ridgemont High\" (though the events therein took place the year after I graduated, so I never met Cameron Crowe; besides, most of the characters were composites). Activities and Societies:  Math team (placed in top 100 nationwide in MAA math test in senior year). Computer club; finalist in California science fair for project writing BASIC compiler for microcomputers. Voted \"Most Intellectual\" (male). ", "Skills RTL design C++ Digital Circuit... Computer Architecture RTL coding Optimization Research Electrical Engineering C Matlab Python Programming Systems Engineering Software Development Linux Start-ups Software Engineering Microsoft Office Perl Unix Circuit Design High Performance... Parallel Computing Algorithms Simulations Computer Vision FPGA See 12+     See less Skills  RTL design C++ Digital Circuit... Computer Architecture RTL coding Optimization Research Electrical Engineering C Matlab Python Programming Systems Engineering Software Development Linux Start-ups Software Engineering Microsoft Office Perl Unix Circuit Design High Performance... Parallel Computing Algorithms Simulations Computer Vision FPGA See 12+     See less RTL design C++ Digital Circuit... Computer Architecture RTL coding Optimization Research Electrical Engineering C Matlab Python Programming Systems Engineering Software Development Linux Start-ups Software Engineering Microsoft Office Perl Unix Circuit Design High Performance... Parallel Computing Algorithms Simulations Computer Vision FPGA See 12+     See less RTL design C++ Digital Circuit... Computer Architecture RTL coding Optimization Research Electrical Engineering C Matlab Python Programming Systems Engineering Software Development Linux Start-ups Software Engineering Microsoft Office Perl Unix Circuit Design High Performance... Parallel Computing Algorithms Simulations Computer Vision FPGA See 12+     See less ", "Experience Computer Architect Intel Corporation Computer Architect Intel Corporation Computer Architect Intel Corporation ", "Experience Computer Architect Intel Corporation February 2006  – Present (9 years 7 months) Power management Computer Architect Intel Corporation February 2006  – Present (9 years 7 months) Power management Computer Architect Intel Corporation February 2006  – Present (9 years 7 months) Power management Education University of Illinois at Urbana-Champaign Master of Science (MS),  Electrical and Electronics Engineering 2005  – 2006 University of Illinois at Urbana-Champaign Bachelor of Science (B.S.),  Computer Engineering 1999  – 2004 University of Illinois at Urbana-Champaign Master of Science (MS),  Electrical and Electronics Engineering 2005  – 2006 University of Illinois at Urbana-Champaign Master of Science (MS),  Electrical and Electronics Engineering 2005  – 2006 University of Illinois at Urbana-Champaign Master of Science (MS),  Electrical and Electronics Engineering 2005  – 2006 University of Illinois at Urbana-Champaign Bachelor of Science (B.S.),  Computer Engineering 1999  – 2004 University of Illinois at Urbana-Champaign Bachelor of Science (B.S.),  Computer Engineering 1999  – 2004 University of Illinois at Urbana-Champaign Bachelor of Science (B.S.),  Computer Engineering 1999  – 2004 ", "Skills Computer Architecture Verilog C C++ Algorithms Embedded Systems Simulations Debugging VLSI Perl High Performance... Skills  Computer Architecture Verilog C C++ Algorithms Embedded Systems Simulations Debugging VLSI Perl High Performance... Computer Architecture Verilog C C++ Algorithms Embedded Systems Simulations Debugging VLSI Perl High Performance... Computer Architecture Verilog C C++ Algorithms Embedded Systems Simulations Debugging VLSI Perl High Performance... ", "Summary I am interested in problem solving and detailed analysis of computer platform architecture and micro-architecture. I write software tools for analysis, including cycle-based simulation models. My objectives include defining high performance computer products, validating performance, and seeing these products successfully launch in their markets. My focus since 2001 has been server memory subsystem performance. Summary I am interested in problem solving and detailed analysis of computer platform architecture and micro-architecture. I write software tools for analysis, including cycle-based simulation models. My objectives include defining high performance computer products, validating performance, and seeing these products successfully launch in their markets. My focus since 2001 has been server memory subsystem performance. I am interested in problem solving and detailed analysis of computer platform architecture and micro-architecture. I write software tools for analysis, including cycle-based simulation models. My objectives include defining high performance computer products, validating performance, and seeing these products successfully launch in their markets. My focus since 2001 has been server memory subsystem performance. I am interested in problem solving and detailed analysis of computer platform architecture and micro-architecture. I write software tools for analysis, including cycle-based simulation models. My objectives include defining high performance computer products, validating performance, and seeing these products successfully launch in their markets. My focus since 2001 has been server memory subsystem performance. Experience Computer Architect Intel Corporation June 1998  – Present (17 years 3 months) Hillsboro, OR Server memory subsystem performance analysis. Intern Intel Corporation January 1997  –  September 1997  (9 months) Hillsboro, OR Post silicon, server platforms, RAID adapters. Java Applet Developer University of Wisconsin-Madison October 1996  –  January 1997  (4 months) Madison, WI Wrote Java applets of cellular automata for Prof. David Griffeath, Math department. Intern State of Wisconsin June 1996  –  September 1996  (4 months) Madison, WI Worked on the transition of the state's supercomputer-based data warehousing project from one external vendor to another. Worked with two external companies and state employees to ensure a smooth transition. Computer Architect Intel Corporation June 1998  – Present (17 years 3 months) Hillsboro, OR Server memory subsystem performance analysis. Computer Architect Intel Corporation June 1998  – Present (17 years 3 months) Hillsboro, OR Server memory subsystem performance analysis. Intern Intel Corporation January 1997  –  September 1997  (9 months) Hillsboro, OR Post silicon, server platforms, RAID adapters. Intern Intel Corporation January 1997  –  September 1997  (9 months) Hillsboro, OR Post silicon, server platforms, RAID adapters. Java Applet Developer University of Wisconsin-Madison October 1996  –  January 1997  (4 months) Madison, WI Wrote Java applets of cellular automata for Prof. David Griffeath, Math department. Java Applet Developer University of Wisconsin-Madison October 1996  –  January 1997  (4 months) Madison, WI Wrote Java applets of cellular automata for Prof. David Griffeath, Math department. Intern State of Wisconsin June 1996  –  September 1996  (4 months) Madison, WI Worked on the transition of the state's supercomputer-based data warehousing project from one external vendor to another. Worked with two external companies and state employees to ensure a smooth transition. Intern State of Wisconsin June 1996  –  September 1996  (4 months) Madison, WI Worked on the transition of the state's supercomputer-based data warehousing project from one external vendor to another. Worked with two external companies and state employees to ensure a smooth transition. Languages English Native or bilingual proficiency English Native or bilingual proficiency English Native or bilingual proficiency Native or bilingual proficiency Skills Performance Analysis Memory Simulations Servers Server Architecture Management DRAM Cache Coherency Interconnects Analysis C++ Python Linux Technical Writing Interviewing Skills High Performance... Processors Microarchitecture Computer Architecture Intel Debugging Microprocessors SoC Verilog Semiconductors Perl See 11+     See less Skills  Performance Analysis Memory Simulations Servers Server Architecture Management DRAM Cache Coherency Interconnects Analysis C++ Python Linux Technical Writing Interviewing Skills High Performance... Processors Microarchitecture Computer Architecture Intel Debugging Microprocessors SoC Verilog Semiconductors Perl See 11+     See less Performance Analysis Memory Simulations Servers Server Architecture Management DRAM Cache Coherency Interconnects Analysis C++ Python Linux Technical Writing Interviewing Skills High Performance... Processors Microarchitecture Computer Architecture Intel Debugging Microprocessors SoC Verilog Semiconductors Perl See 11+     See less Performance Analysis Memory Simulations Servers Server Architecture Management DRAM Cache Coherency Interconnects Analysis C++ Python Linux Technical Writing Interviewing Skills High Performance... Processors Microarchitecture Computer Architecture Intel Debugging Microprocessors SoC Verilog Semiconductors Perl See 11+     See less Education OGI at Oregon Health and Science University Master of Science (MS),  Computer Science 1998  – 2001 Activities and Societies:  Causing trouble with Dylan MacNamee and Dave Steere. University of Wisconsin-Madison Bachelor of Science (BS),  Electrical Engineering 1993  – 1998 Electrical and Computer Engineering (ECE), focus on Computer Engineering, in the College of Engineering. Second major in Computer Science, in the College of Letters & Science. Activities and Societies:  Cafeteria-tray sledding down Bascom Hill. OGI at Oregon Health and Science University Master of Science (MS),  Computer Science 1998  – 2001 Activities and Societies:  Causing trouble with Dylan MacNamee and Dave Steere. OGI at Oregon Health and Science University Master of Science (MS),  Computer Science 1998  – 2001 Activities and Societies:  Causing trouble with Dylan MacNamee and Dave Steere. OGI at Oregon Health and Science University Master of Science (MS),  Computer Science 1998  – 2001 Activities and Societies:  Causing trouble with Dylan MacNamee and Dave Steere. University of Wisconsin-Madison Bachelor of Science (BS),  Electrical Engineering 1993  – 1998 Electrical and Computer Engineering (ECE), focus on Computer Engineering, in the College of Engineering. Second major in Computer Science, in the College of Letters & Science. Activities and Societies:  Cafeteria-tray sledding down Bascom Hill. University of Wisconsin-Madison Bachelor of Science (BS),  Electrical Engineering 1993  – 1998 Electrical and Computer Engineering (ECE), focus on Computer Engineering, in the College of Engineering. Second major in Computer Science, in the College of Letters & Science. Activities and Societies:  Cafeteria-tray sledding down Bascom Hill. University of Wisconsin-Madison Bachelor of Science (BS),  Electrical Engineering 1993  – 1998 Electrical and Computer Engineering (ECE), focus on Computer Engineering, in the College of Engineering. Second major in Computer Science, in the College of Letters & Science. Activities and Societies:  Cafeteria-tray sledding down Bascom Hill. ", "Summary Dr. Theodore Omtzigt is the CEO and Founder of Stillwater Supercomputing, Inc. With a focus on leading and enabling teams to create and introduce award winning products, he has a proven track record of delivering goal-oriented innovations and industry transformations at Intel, NVIDIA, and Stillwater. \n \nDr. Omtzigt has brought together a global team of entrepreneurs, technologists, and business leaders to build the next generation platform for big data knowledge processing to create adaptive, secure, scalable intelligent systems for healthcare, business, and mobility. The platform is based on the world's first distributed data flow machine, called the Stillwater Knowledge Processing Unit, or KPU(TM) and a physical programming model called Domain Flow. \n \nDr. Omtzigt has the rare ability to span multiple technologies and business processes to identify valuable business process improvements and possesses the technical depth and leadership that allows him to seize these opportunities. The current opportunity is solving high velocity big data problems through workload optimized appliances. For more detail, visit http://www.stillwater-sc.com \n \nSpecialties: High velocity big data, datafication, cloud computing, cloud security, application architecture and micro-architecture development and validation. Team building and skill development of product development teams. Fund-raising and technology partnership development. Summary Dr. Theodore Omtzigt is the CEO and Founder of Stillwater Supercomputing, Inc. With a focus on leading and enabling teams to create and introduce award winning products, he has a proven track record of delivering goal-oriented innovations and industry transformations at Intel, NVIDIA, and Stillwater. \n \nDr. Omtzigt has brought together a global team of entrepreneurs, technologists, and business leaders to build the next generation platform for big data knowledge processing to create adaptive, secure, scalable intelligent systems for healthcare, business, and mobility. The platform is based on the world's first distributed data flow machine, called the Stillwater Knowledge Processing Unit, or KPU(TM) and a physical programming model called Domain Flow. \n \nDr. Omtzigt has the rare ability to span multiple technologies and business processes to identify valuable business process improvements and possesses the technical depth and leadership that allows him to seize these opportunities. The current opportunity is solving high velocity big data problems through workload optimized appliances. For more detail, visit http://www.stillwater-sc.com \n \nSpecialties: High velocity big data, datafication, cloud computing, cloud security, application architecture and micro-architecture development and validation. Team building and skill development of product development teams. Fund-raising and technology partnership development. Dr. Theodore Omtzigt is the CEO and Founder of Stillwater Supercomputing, Inc. With a focus on leading and enabling teams to create and introduce award winning products, he has a proven track record of delivering goal-oriented innovations and industry transformations at Intel, NVIDIA, and Stillwater. \n \nDr. Omtzigt has brought together a global team of entrepreneurs, technologists, and business leaders to build the next generation platform for big data knowledge processing to create adaptive, secure, scalable intelligent systems for healthcare, business, and mobility. The platform is based on the world's first distributed data flow machine, called the Stillwater Knowledge Processing Unit, or KPU(TM) and a physical programming model called Domain Flow. \n \nDr. Omtzigt has the rare ability to span multiple technologies and business processes to identify valuable business process improvements and possesses the technical depth and leadership that allows him to seize these opportunities. The current opportunity is solving high velocity big data problems through workload optimized appliances. For more detail, visit http://www.stillwater-sc.com \n \nSpecialties: High velocity big data, datafication, cloud computing, cloud security, application architecture and micro-architecture development and validation. Team building and skill development of product development teams. Fund-raising and technology partnership development. Dr. Theodore Omtzigt is the CEO and Founder of Stillwater Supercomputing, Inc. With a focus on leading and enabling teams to create and introduce award winning products, he has a proven track record of delivering goal-oriented innovations and industry transformations at Intel, NVIDIA, and Stillwater. \n \nDr. Omtzigt has brought together a global team of entrepreneurs, technologists, and business leaders to build the next generation platform for big data knowledge processing to create adaptive, secure, scalable intelligent systems for healthcare, business, and mobility. The platform is based on the world's first distributed data flow machine, called the Stillwater Knowledge Processing Unit, or KPU(TM) and a physical programming model called Domain Flow. \n \nDr. Omtzigt has the rare ability to span multiple technologies and business processes to identify valuable business process improvements and possesses the technical depth and leadership that allows him to seize these opportunities. The current opportunity is solving high velocity big data problems through workload optimized appliances. For more detail, visit http://www.stillwater-sc.com \n \nSpecialties: High velocity big data, datafication, cloud computing, cloud security, application architecture and micro-architecture development and validation. Team building and skill development of product development teams. Fund-raising and technology partnership development. Experience President and Founder Stillwater Supercomputing, Inc. August 2006  – Present (9 years 1 month) San Jose, California Stillwater Supercomputing is developing a new high-productivity platform for real-time intelligence. Our first product is a genome assembler for bioinformatics. Full human genome at 40x coverage assembled in less than an hour. Architect NVIDIA December 2000  –  August 2006  (5 years 9 months) Performance Engineering of next generation graphics platforms Principal Engineer 3Dfx Interactive, Inc. April 1998  –  December 2000  (2 years 9 months) Performance Engineering R&D of 3D graphics drivers and programmable pixel pipelines Senior Computer Architect Intel Corporation April 1992  –  April 1998  (6 years 1 month) Architect/micro-architect on the following products: \nPentium PCI i430 chipsets: cache and MC design \nPentium III: BIU and ROB \nPentium II/III AGP i440 chipsets: AGP bus definition, MC design \ni740 GPU: Observation Architecture Research Assistant Yale University 1987  –  1992  (5 years) New Haven, Connecticut Developed silicon compilation strategies for fine-grain parallel algorithms that span multiple chips. student Alkwin Kollege 1976  –  1982  (6 years) vwo President and Founder Stillwater Supercomputing, Inc. August 2006  – Present (9 years 1 month) San Jose, California Stillwater Supercomputing is developing a new high-productivity platform for real-time intelligence. Our first product is a genome assembler for bioinformatics. Full human genome at 40x coverage assembled in less than an hour. President and Founder Stillwater Supercomputing, Inc. August 2006  – Present (9 years 1 month) San Jose, California Stillwater Supercomputing is developing a new high-productivity platform for real-time intelligence. Our first product is a genome assembler for bioinformatics. Full human genome at 40x coverage assembled in less than an hour. Architect NVIDIA December 2000  –  August 2006  (5 years 9 months) Performance Engineering of next generation graphics platforms Architect NVIDIA December 2000  –  August 2006  (5 years 9 months) Performance Engineering of next generation graphics platforms Principal Engineer 3Dfx Interactive, Inc. April 1998  –  December 2000  (2 years 9 months) Performance Engineering R&D of 3D graphics drivers and programmable pixel pipelines Principal Engineer 3Dfx Interactive, Inc. April 1998  –  December 2000  (2 years 9 months) Performance Engineering R&D of 3D graphics drivers and programmable pixel pipelines Senior Computer Architect Intel Corporation April 1992  –  April 1998  (6 years 1 month) Architect/micro-architect on the following products: \nPentium PCI i430 chipsets: cache and MC design \nPentium III: BIU and ROB \nPentium II/III AGP i440 chipsets: AGP bus definition, MC design \ni740 GPU: Observation Architecture Senior Computer Architect Intel Corporation April 1992  –  April 1998  (6 years 1 month) Architect/micro-architect on the following products: \nPentium PCI i430 chipsets: cache and MC design \nPentium III: BIU and ROB \nPentium II/III AGP i440 chipsets: AGP bus definition, MC design \ni740 GPU: Observation Architecture Research Assistant Yale University 1987  –  1992  (5 years) New Haven, Connecticut Developed silicon compilation strategies for fine-grain parallel algorithms that span multiple chips. Research Assistant Yale University 1987  –  1992  (5 years) New Haven, Connecticut Developed silicon compilation strategies for fine-grain parallel algorithms that span multiple chips. student Alkwin Kollege 1976  –  1982  (6 years) vwo student Alkwin Kollege 1976  –  1982  (6 years) vwo Languages dutch, german dutch, german dutch, german Skills KPU Knowledge Processing High Performance... Machine Learning Data Flow Architecture Entrepreneurship Cloud Computing Scalability Architecture Python C++ C Software Project... Competitive Analysis IT Strategy Business Strategy Strategy Development Software Development Algorithms Data Mining System Design Distributed Systems System Architecture Start-ups Product Management Software Engineering Engineering Management Embedded Systems Product Development OpenStack Programming Data Flow Scientific Computing Innovation Leadership Start-up Ventures Processors Go-to-market Strategy Computer Architecture Microprocessors Optimization Device Drivers Hardware Analytics Simulations IC Semiconductors SaaS FPGA Strategy See 35+     See less Skills  KPU Knowledge Processing High Performance... Machine Learning Data Flow Architecture Entrepreneurship Cloud Computing Scalability Architecture Python C++ C Software Project... Competitive Analysis IT Strategy Business Strategy Strategy Development Software Development Algorithms Data Mining System Design Distributed Systems System Architecture Start-ups Product Management Software Engineering Engineering Management Embedded Systems Product Development OpenStack Programming Data Flow Scientific Computing Innovation Leadership Start-up Ventures Processors Go-to-market Strategy Computer Architecture Microprocessors Optimization Device Drivers Hardware Analytics Simulations IC Semiconductors SaaS FPGA Strategy See 35+     See less KPU Knowledge Processing High Performance... Machine Learning Data Flow Architecture Entrepreneurship Cloud Computing Scalability Architecture Python C++ C Software Project... Competitive Analysis IT Strategy Business Strategy Strategy Development Software Development Algorithms Data Mining System Design Distributed Systems System Architecture Start-ups Product Management Software Engineering Engineering Management Embedded Systems Product Development OpenStack Programming Data Flow Scientific Computing Innovation Leadership Start-up Ventures Processors Go-to-market Strategy Computer Architecture Microprocessors Optimization Device Drivers Hardware Analytics Simulations IC Semiconductors SaaS FPGA Strategy See 35+     See less KPU Knowledge Processing High Performance... Machine Learning Data Flow Architecture Entrepreneurship Cloud Computing Scalability Architecture Python C++ C Software Project... Competitive Analysis IT Strategy Business Strategy Strategy Development Software Development Algorithms Data Mining System Design Distributed Systems System Architecture Start-ups Product Management Software Engineering Engineering Management Embedded Systems Product Development OpenStack Programming Data Flow Scientific Computing Innovation Leadership Start-up Ventures Processors Go-to-market Strategy Computer Architecture Microprocessors Optimization Device Drivers Hardware Analytics Simulations IC Semiconductors SaaS FPGA Strategy See 35+     See less Education Yale University Ph.D.,  Computer Engineering 1987  – 1992 Dissertation research focused on silicon compilation of real-time algorithms to distributed systems consisting of multiple chips. Delft University of Technology Ingenieur,  Electrical Engineering 1982  – 1987 Focus was on Solid State Physics, in particular crystal scattering problems of photons, and computer aided design software for full custom chip design. Activities and Societies:  President of IEEE Student Chapter Alkwin College vwo,  General Education 1976  – 1982 Yale University Ph.D.,  Computer Engineering 1987  – 1992 Dissertation research focused on silicon compilation of real-time algorithms to distributed systems consisting of multiple chips. Yale University Ph.D.,  Computer Engineering 1987  – 1992 Dissertation research focused on silicon compilation of real-time algorithms to distributed systems consisting of multiple chips. Yale University Ph.D.,  Computer Engineering 1987  – 1992 Dissertation research focused on silicon compilation of real-time algorithms to distributed systems consisting of multiple chips. Delft University of Technology Ingenieur,  Electrical Engineering 1982  – 1987 Focus was on Solid State Physics, in particular crystal scattering problems of photons, and computer aided design software for full custom chip design. Activities and Societies:  President of IEEE Student Chapter Delft University of Technology Ingenieur,  Electrical Engineering 1982  – 1987 Focus was on Solid State Physics, in particular crystal scattering problems of photons, and computer aided design software for full custom chip design. Activities and Societies:  President of IEEE Student Chapter Delft University of Technology Ingenieur,  Electrical Engineering 1982  – 1987 Focus was on Solid State Physics, in particular crystal scattering problems of photons, and computer aided design software for full custom chip design. Activities and Societies:  President of IEEE Student Chapter Alkwin College vwo,  General Education 1976  – 1982 Alkwin College vwo,  General Education 1976  – 1982 Alkwin College vwo,  General Education 1976  – 1982 "]}