{"position": "Construction Manager", "company": "Intel Corporation", "profiles": ["Summary Through my career I have utilized my leadership, strategic vision, broad experience, and the ability to deliver superior results to consistently increase efficiency, reduce costs, and drive customer satisfaction. I currently work with senior leaders in the high-tech sector, providing a wide spectrum of deliverables, and excelling in a fast-paced and extremely dynamic environment.  \n \nHave become a well rounded leader by leveraging my technical experience and military background with my drive for results. My success is due, in part, to my good interpersonal communications skills. technical background and my desire to embrace new technologies. It has enabled me to harness the potential of all levels of employees and motivate them to achieve superior results Summary Through my career I have utilized my leadership, strategic vision, broad experience, and the ability to deliver superior results to consistently increase efficiency, reduce costs, and drive customer satisfaction. I currently work with senior leaders in the high-tech sector, providing a wide spectrum of deliverables, and excelling in a fast-paced and extremely dynamic environment.  \n \nHave become a well rounded leader by leveraging my technical experience and military background with my drive for results. My success is due, in part, to my good interpersonal communications skills. technical background and my desire to embrace new technologies. It has enabled me to harness the potential of all levels of employees and motivate them to achieve superior results Through my career I have utilized my leadership, strategic vision, broad experience, and the ability to deliver superior results to consistently increase efficiency, reduce costs, and drive customer satisfaction. I currently work with senior leaders in the high-tech sector, providing a wide spectrum of deliverables, and excelling in a fast-paced and extremely dynamic environment.  \n \nHave become a well rounded leader by leveraging my technical experience and military background with my drive for results. My success is due, in part, to my good interpersonal communications skills. technical background and my desire to embrace new technologies. It has enabled me to harness the potential of all levels of employees and motivate them to achieve superior results Through my career I have utilized my leadership, strategic vision, broad experience, and the ability to deliver superior results to consistently increase efficiency, reduce costs, and drive customer satisfaction. I currently work with senior leaders in the high-tech sector, providing a wide spectrum of deliverables, and excelling in a fast-paced and extremely dynamic environment.  \n \nHave become a well rounded leader by leveraging my technical experience and military background with my drive for results. My success is due, in part, to my good interpersonal communications skills. technical background and my desire to embrace new technologies. It has enabled me to harness the potential of all levels of employees and motivate them to achieve superior results Experience Global Tool Install Strategic Analyst Intel Corporation 2014  – Present (1 year) Project Controls Manager Intel Corporation January 2008  –  2014  (6 years) Hillsboro Oregon RA Campus CSCF TI Finance Intel Corporation June 2011  –  June 2012  (1 year 1 month) Hillsboro Oregon Strategic Analyst Intel January 2005  –  January 2007  (2 years 1 month) Construction Manager Intel Corporation 2002  –  2004  (2 years) Construction Manager D1C Ramp Intel January 2001  –  July 2002  (1 year 7 months) Process Engineer Intel January 1998  –  January 2000  (2 years 1 month) Project Manager Intel January 1997  –  January 1998  (1 year 1 month) Process Engineer (Metals, Thin Films & Implant) Motorola January 1988  –  January 1997  (9 years 1 month) Mesa AZ Global Tool Install Strategic Analyst Intel Corporation 2014  – Present (1 year) Global Tool Install Strategic Analyst Intel Corporation 2014  – Present (1 year) Project Controls Manager Intel Corporation January 2008  –  2014  (6 years) Hillsboro Oregon Project Controls Manager Intel Corporation January 2008  –  2014  (6 years) Hillsboro Oregon RA Campus CSCF TI Finance Intel Corporation June 2011  –  June 2012  (1 year 1 month) Hillsboro Oregon RA Campus CSCF TI Finance Intel Corporation June 2011  –  June 2012  (1 year 1 month) Hillsboro Oregon Strategic Analyst Intel January 2005  –  January 2007  (2 years 1 month) Strategic Analyst Intel January 2005  –  January 2007  (2 years 1 month) Construction Manager Intel Corporation 2002  –  2004  (2 years) Construction Manager Intel Corporation 2002  –  2004  (2 years) Construction Manager D1C Ramp Intel January 2001  –  July 2002  (1 year 7 months) Construction Manager D1C Ramp Intel January 2001  –  July 2002  (1 year 7 months) Process Engineer Intel January 1998  –  January 2000  (2 years 1 month) Process Engineer Intel January 1998  –  January 2000  (2 years 1 month) Project Manager Intel January 1997  –  January 1998  (1 year 1 month) Project Manager Intel January 1997  –  January 1998  (1 year 1 month) Process Engineer (Metals, Thin Films & Implant) Motorola January 1988  –  January 1997  (9 years 1 month) Mesa AZ Process Engineer (Metals, Thin Films & Implant) Motorola January 1988  –  January 1997  (9 years 1 month) Mesa AZ Skills Visual Basic Project Finance Business Intelligence Program Management Project Management Engineering Management Management Project Planning Cross-functional Team... MS Project Operations Management Procurement Risk Management Leadership Contract Management Team Leadership Construction Visio Contract Negotiation Business Analysis Strategy Supply Chain Management Business Process... SAP Manufacturing Project Control Process Scheduler Quality Assurance Process Engineering Budgets Engineering Cost Management Analysis Six Sigma Process Improvement Semiconductors Software Development PMP Forecasting Microsoft Project Construction Management Project Estimation Value Engineering Cost Control Strategic Planning Project Engineering See 31+     See less Skills  Visual Basic Project Finance Business Intelligence Program Management Project Management Engineering Management Management Project Planning Cross-functional Team... MS Project Operations Management Procurement Risk Management Leadership Contract Management Team Leadership Construction Visio Contract Negotiation Business Analysis Strategy Supply Chain Management Business Process... SAP Manufacturing Project Control Process Scheduler Quality Assurance Process Engineering Budgets Engineering Cost Management Analysis Six Sigma Process Improvement Semiconductors Software Development PMP Forecasting Microsoft Project Construction Management Project Estimation Value Engineering Cost Control Strategic Planning Project Engineering See 31+     See less Visual Basic Project Finance Business Intelligence Program Management Project Management Engineering Management Management Project Planning Cross-functional Team... MS Project Operations Management Procurement Risk Management Leadership Contract Management Team Leadership Construction Visio Contract Negotiation Business Analysis Strategy Supply Chain Management Business Process... SAP Manufacturing Project Control Process Scheduler Quality Assurance Process Engineering Budgets Engineering Cost Management Analysis Six Sigma Process Improvement Semiconductors Software Development PMP Forecasting Microsoft Project Construction Management Project Estimation Value Engineering Cost Control Strategic Planning Project Engineering See 31+     See less Visual Basic Project Finance Business Intelligence Program Management Project Management Engineering Management Management Project Planning Cross-functional Team... MS Project Operations Management Procurement Risk Management Leadership Contract Management Team Leadership Construction Visio Contract Negotiation Business Analysis Strategy Supply Chain Management Business Process... SAP Manufacturing Project Control Process Scheduler Quality Assurance Process Engineering Budgets Engineering Cost Management Analysis Six Sigma Process Improvement Semiconductors Software Development PMP Forecasting Microsoft Project Construction Management Project Estimation Value Engineering Cost Control Strategic Planning Project Engineering See 31+     See less ", "Experience Senior Project Manager Equinix February 2010  – Present (5 years 7 months) Senior Construction Manager Intel Corporation 2000  –  2010  (10 years) Senior Project Manager Equinix February 2010  – Present (5 years 7 months) Senior Project Manager Equinix February 2010  – Present (5 years 7 months) Senior Construction Manager Intel Corporation 2000  –  2010  (10 years) Senior Construction Manager Intel Corporation 2000  –  2010  (10 years) Languages Iranian English Iranian English Iranian English Skills Vendor Management Project Management Cross-functional Team... Program Management Skills  Vendor Management Project Management Cross-functional Team... Program Management Vendor Management Project Management Cross-functional Team... Program Management Vendor Management Project Management Cross-functional Team... Program Management Education Syracuse University Master of Science (MS),  Electrical and Electronics Engineering 1993  – 1995 Fairleigh Dickinson University-Metropolitan Campus Engineer's Degree,  Mechanical Engineering 1978  – 1981 Syracuse University Master of Science (MS),  Electrical and Electronics Engineering 1993  – 1995 Syracuse University Master of Science (MS),  Electrical and Electronics Engineering 1993  – 1995 Syracuse University Master of Science (MS),  Electrical and Electronics Engineering 1993  – 1995 Fairleigh Dickinson University-Metropolitan Campus Engineer's Degree,  Mechanical Engineering 1978  – 1981 Fairleigh Dickinson University-Metropolitan Campus Engineer's Degree,  Mechanical Engineering 1978  – 1981 Fairleigh Dickinson University-Metropolitan Campus Engineer's Degree,  Mechanical Engineering 1978  – 1981 ", "Summary Project management professional (PMP) experienced in construction and design projects. International and Domestic project management experience as Owner, Contractor, Construction Manager, and Engineering/Design Manager in many industrial sectors. \n \nAnalytical, innovative problem solver. Adept at building productive relationships with customers, co-workers, suppliers and contractors. Excellent communication, motivation and teamwork skills. Tenacious at directing projects through to successful completion. Strong organization, time management and prioritizing skills. Developed and administered project and operations budgets up to $140 million.  \n \nKnowledgeable in use of MS Office (Word, Excel, Powerpoint, Outlook, Access, Visio), Project, Primevera, Versapro & CCpro. Summary Project management professional (PMP) experienced in construction and design projects. International and Domestic project management experience as Owner, Contractor, Construction Manager, and Engineering/Design Manager in many industrial sectors. \n \nAnalytical, innovative problem solver. Adept at building productive relationships with customers, co-workers, suppliers and contractors. Excellent communication, motivation and teamwork skills. Tenacious at directing projects through to successful completion. Strong organization, time management and prioritizing skills. Developed and administered project and operations budgets up to $140 million.  \n \nKnowledgeable in use of MS Office (Word, Excel, Powerpoint, Outlook, Access, Visio), Project, Primevera, Versapro & CCpro. Project management professional (PMP) experienced in construction and design projects. International and Domestic project management experience as Owner, Contractor, Construction Manager, and Engineering/Design Manager in many industrial sectors. \n \nAnalytical, innovative problem solver. Adept at building productive relationships with customers, co-workers, suppliers and contractors. Excellent communication, motivation and teamwork skills. Tenacious at directing projects through to successful completion. Strong organization, time management and prioritizing skills. Developed and administered project and operations budgets up to $140 million.  \n \nKnowledgeable in use of MS Office (Word, Excel, Powerpoint, Outlook, Access, Visio), Project, Primevera, Versapro & CCpro. Project management professional (PMP) experienced in construction and design projects. International and Domestic project management experience as Owner, Contractor, Construction Manager, and Engineering/Design Manager in many industrial sectors. \n \nAnalytical, innovative problem solver. Adept at building productive relationships with customers, co-workers, suppliers and contractors. Excellent communication, motivation and teamwork skills. Tenacious at directing projects through to successful completion. Strong organization, time management and prioritizing skills. Developed and administered project and operations budgets up to $140 million.  \n \nKnowledgeable in use of MS Office (Word, Excel, Powerpoint, Outlook, Access, Visio), Project, Primevera, Versapro & CCpro. Experience Project/Construction Management Consultant April 2009  –  December 2009  (9 months) Performed consulting work while seeking my next career opportunity where I could utilize my Project Management and Construction Management Skills. Projects worked on included \n- Product Development Project Manager for a medical device which enhances the patient-care giver interface. Documented data and information in order to apply for a patent and grants. \n- Guest Lecturer on Project Management at a local Community College. \n- Providing input to various company proposals for future projects in the industrial/manufacturing sector. Project/Construction Manager Intel Corporation January 1997  –  March 2009  (12 years 3 months) Project Manager and Construction Manager, Hillsboro OR  \nInstallation of process tools for latest state-of-the-art chip manufacturing processes. Drove installation of processing tools in technical development and high volume manufacturing fabs. \n \n• Successfully managed team of tool install project managers on $120M technical development and high volume manufacturing project. Nearly 2 million manhours of work completed with no recordable injuries and no lost day case injuries. \n \n•\tDeveloped and maintained Excel-based system for bottoms-up-estimates which accurately forecasted project indirects budgets to $40 million. Developed and delivered presentations to customers and project managers to review budgets/forecasts and to educate them on indirects funding process and needs. \n \n•\tManaged Labor Relations Team. Developed Dual Gate Plan for managing/mitigating labor issues on OR Sites. Developed and maintained manpower forecasts for OR Sites Projects in order to proactively manage site logistics (parking, orientation, lunch tent, all-hands meetings) and for developing contracting strategies. \n \n•\tDeveloped, presented and sold processes & procedures for managing change orders and invoices for the many contracts involved in $100+ million projects. These processes minimized the number of change orders & invoices processed . \n \n•\tAs construction manager, managed contracting process for multi-prime strategy utilizing lump sum unit rate pricing for tool installs. \n \n•\tAs tool install project manager, assembled and led functional area teams which included factory customers, tool supplier reps, design leads, construction crews, safety reps, QA/QC reps. Managed tool installs in the lithography, etch and support areas. \n \n•\tManaged staff of 4-7 Quality Assurance Techs who inspected all Intel OR construction work for compliance with Intel drawings & specs and local jurisdictional codes. Project/Construction Manager Harris Group Inc 1978  –  1996  (18 years) Project Manager and Owner's Representative, Portland OR and Seattle WA \nFor major industrial rebuilds and modernizations. Responsible for building customer relations and bases. Served as day-to-day contact with owner's project manager. Managed various functions necessary to complete a successful project: feasibility studies, preliminary engineering, scope and estimates, detailed design, procurement, construction management, training, commissioning, start-up and performance warranty checks. \n \n•\tPlanned, implemented and completed installation of new technology equipment as owner’s right hand man and guide. Successfully started up and operated for owner. Led to award of $3 million in new projects for firm and to award of new orders for the equipment supplier.  \n \n•\tManaged successful initial project with new customer, resulting in $1.2 million project savings and award of $3 million of new projects to company. \n \n•\tPrepared, presented, sold and implemented risk management plan on $40 million upgrade project. Project team responded quickly with prepared plans to risks events, reducing project time and costs; and minimizing stress on people. \n \n•\tEstablished and maintained communications channels with overseas supplier. Extensive details worked out with daily fax communication and minimal meetings, resulting in lower cost installation. \n \n•\tDeveloped and gave presentations to prospective customers, increasing exposure to market place and building credibility for future projects. \n \nOperations Manager, Bellingham WA \nResponsible for generating profits and building a customer base for a 12-20 person engineering office providing engineering and design services to various process industries. Prepared yearly operating plans, maintained and built customer relations, guided personnel in methods and procedures for delivering customer focused services and developed team work atmosphere. Field Engineer JF Pritchard September 1976  –  June 1977  (10 months) Handled all field engineering aspects in the construction of a sugar refinery in third world country. Secured all plans and specifications from consulting engineer in USA and from suppliers around the world. Resolved conflicts within plans, specifications, supplied equipment and materials and field conditions. Supervised construction crews. Project completed on-time with work force of two thirds local construction workers. Project/Construction Management Consultant April 2009  –  December 2009  (9 months) Performed consulting work while seeking my next career opportunity where I could utilize my Project Management and Construction Management Skills. Projects worked on included \n- Product Development Project Manager for a medical device which enhances the patient-care giver interface. Documented data and information in order to apply for a patent and grants. \n- Guest Lecturer on Project Management at a local Community College. \n- Providing input to various company proposals for future projects in the industrial/manufacturing sector. Project/Construction Management Consultant April 2009  –  December 2009  (9 months) Performed consulting work while seeking my next career opportunity where I could utilize my Project Management and Construction Management Skills. Projects worked on included \n- Product Development Project Manager for a medical device which enhances the patient-care giver interface. Documented data and information in order to apply for a patent and grants. \n- Guest Lecturer on Project Management at a local Community College. \n- Providing input to various company proposals for future projects in the industrial/manufacturing sector. Project/Construction Manager Intel Corporation January 1997  –  March 2009  (12 years 3 months) Project Manager and Construction Manager, Hillsboro OR  \nInstallation of process tools for latest state-of-the-art chip manufacturing processes. Drove installation of processing tools in technical development and high volume manufacturing fabs. \n \n• Successfully managed team of tool install project managers on $120M technical development and high volume manufacturing project. Nearly 2 million manhours of work completed with no recordable injuries and no lost day case injuries. \n \n•\tDeveloped and maintained Excel-based system for bottoms-up-estimates which accurately forecasted project indirects budgets to $40 million. Developed and delivered presentations to customers and project managers to review budgets/forecasts and to educate them on indirects funding process and needs. \n \n•\tManaged Labor Relations Team. Developed Dual Gate Plan for managing/mitigating labor issues on OR Sites. Developed and maintained manpower forecasts for OR Sites Projects in order to proactively manage site logistics (parking, orientation, lunch tent, all-hands meetings) and for developing contracting strategies. \n \n•\tDeveloped, presented and sold processes & procedures for managing change orders and invoices for the many contracts involved in $100+ million projects. These processes minimized the number of change orders & invoices processed . \n \n•\tAs construction manager, managed contracting process for multi-prime strategy utilizing lump sum unit rate pricing for tool installs. \n \n•\tAs tool install project manager, assembled and led functional area teams which included factory customers, tool supplier reps, design leads, construction crews, safety reps, QA/QC reps. Managed tool installs in the lithography, etch and support areas. \n \n•\tManaged staff of 4-7 Quality Assurance Techs who inspected all Intel OR construction work for compliance with Intel drawings & specs and local jurisdictional codes. Project/Construction Manager Intel Corporation January 1997  –  March 2009  (12 years 3 months) Project Manager and Construction Manager, Hillsboro OR  \nInstallation of process tools for latest state-of-the-art chip manufacturing processes. Drove installation of processing tools in technical development and high volume manufacturing fabs. \n \n• Successfully managed team of tool install project managers on $120M technical development and high volume manufacturing project. Nearly 2 million manhours of work completed with no recordable injuries and no lost day case injuries. \n \n•\tDeveloped and maintained Excel-based system for bottoms-up-estimates which accurately forecasted project indirects budgets to $40 million. Developed and delivered presentations to customers and project managers to review budgets/forecasts and to educate them on indirects funding process and needs. \n \n•\tManaged Labor Relations Team. Developed Dual Gate Plan for managing/mitigating labor issues on OR Sites. Developed and maintained manpower forecasts for OR Sites Projects in order to proactively manage site logistics (parking, orientation, lunch tent, all-hands meetings) and for developing contracting strategies. \n \n•\tDeveloped, presented and sold processes & procedures for managing change orders and invoices for the many contracts involved in $100+ million projects. These processes minimized the number of change orders & invoices processed . \n \n•\tAs construction manager, managed contracting process for multi-prime strategy utilizing lump sum unit rate pricing for tool installs. \n \n•\tAs tool install project manager, assembled and led functional area teams which included factory customers, tool supplier reps, design leads, construction crews, safety reps, QA/QC reps. Managed tool installs in the lithography, etch and support areas. \n \n•\tManaged staff of 4-7 Quality Assurance Techs who inspected all Intel OR construction work for compliance with Intel drawings & specs and local jurisdictional codes. Project/Construction Manager Harris Group Inc 1978  –  1996  (18 years) Project Manager and Owner's Representative, Portland OR and Seattle WA \nFor major industrial rebuilds and modernizations. Responsible for building customer relations and bases. Served as day-to-day contact with owner's project manager. Managed various functions necessary to complete a successful project: feasibility studies, preliminary engineering, scope and estimates, detailed design, procurement, construction management, training, commissioning, start-up and performance warranty checks. \n \n•\tPlanned, implemented and completed installation of new technology equipment as owner’s right hand man and guide. Successfully started up and operated for owner. Led to award of $3 million in new projects for firm and to award of new orders for the equipment supplier.  \n \n•\tManaged successful initial project with new customer, resulting in $1.2 million project savings and award of $3 million of new projects to company. \n \n•\tPrepared, presented, sold and implemented risk management plan on $40 million upgrade project. Project team responded quickly with prepared plans to risks events, reducing project time and costs; and minimizing stress on people. \n \n•\tEstablished and maintained communications channels with overseas supplier. Extensive details worked out with daily fax communication and minimal meetings, resulting in lower cost installation. \n \n•\tDeveloped and gave presentations to prospective customers, increasing exposure to market place and building credibility for future projects. \n \nOperations Manager, Bellingham WA \nResponsible for generating profits and building a customer base for a 12-20 person engineering office providing engineering and design services to various process industries. Prepared yearly operating plans, maintained and built customer relations, guided personnel in methods and procedures for delivering customer focused services and developed team work atmosphere. Project/Construction Manager Harris Group Inc 1978  –  1996  (18 years) Project Manager and Owner's Representative, Portland OR and Seattle WA \nFor major industrial rebuilds and modernizations. Responsible for building customer relations and bases. Served as day-to-day contact with owner's project manager. Managed various functions necessary to complete a successful project: feasibility studies, preliminary engineering, scope and estimates, detailed design, procurement, construction management, training, commissioning, start-up and performance warranty checks. \n \n•\tPlanned, implemented and completed installation of new technology equipment as owner’s right hand man and guide. Successfully started up and operated for owner. Led to award of $3 million in new projects for firm and to award of new orders for the equipment supplier.  \n \n•\tManaged successful initial project with new customer, resulting in $1.2 million project savings and award of $3 million of new projects to company. \n \n•\tPrepared, presented, sold and implemented risk management plan on $40 million upgrade project. Project team responded quickly with prepared plans to risks events, reducing project time and costs; and minimizing stress on people. \n \n•\tEstablished and maintained communications channels with overseas supplier. Extensive details worked out with daily fax communication and minimal meetings, resulting in lower cost installation. \n \n•\tDeveloped and gave presentations to prospective customers, increasing exposure to market place and building credibility for future projects. \n \nOperations Manager, Bellingham WA \nResponsible for generating profits and building a customer base for a 12-20 person engineering office providing engineering and design services to various process industries. Prepared yearly operating plans, maintained and built customer relations, guided personnel in methods and procedures for delivering customer focused services and developed team work atmosphere. Field Engineer JF Pritchard September 1976  –  June 1977  (10 months) Handled all field engineering aspects in the construction of a sugar refinery in third world country. Secured all plans and specifications from consulting engineer in USA and from suppliers around the world. Resolved conflicts within plans, specifications, supplied equipment and materials and field conditions. Supervised construction crews. Project completed on-time with work force of two thirds local construction workers. Field Engineer JF Pritchard September 1976  –  June 1977  (10 months) Handled all field engineering aspects in the construction of a sugar refinery in third world country. Secured all plans and specifications from consulting engineer in USA and from suppliers around the world. Resolved conflicts within plans, specifications, supplied equipment and materials and field conditions. Supervised construction crews. Project completed on-time with work force of two thirds local construction workers. Skills Visio Projects Access Microsoft Excel Outlook Microsoft Word PowerPoint Program Management Project Management MS Project Construction Management Contract Management Engineering Project Planning Process Improvement Construction Training Contract Negotiation Analysis Change Management Management Procurement Leadership Risk Management Budgets Manufacturing PMP Process Scheduler Proposal Writing Commissioning Product Development Negotiation Forecasting Strategy Logistics Process Engineering Contractors Project Control Construction Safety Engineering Management Change Orders Project Estimation Primavera P6 Value Engineering Civil Engineering Cost Control Cost Management Materials CPM Scheduling Cost Engineering See 35+     See less Skills  Visio Projects Access Microsoft Excel Outlook Microsoft Word PowerPoint Program Management Project Management MS Project Construction Management Contract Management Engineering Project Planning Process Improvement Construction Training Contract Negotiation Analysis Change Management Management Procurement Leadership Risk Management Budgets Manufacturing PMP Process Scheduler Proposal Writing Commissioning Product Development Negotiation Forecasting Strategy Logistics Process Engineering Contractors Project Control Construction Safety Engineering Management Change Orders Project Estimation Primavera P6 Value Engineering Civil Engineering Cost Control Cost Management Materials CPM Scheduling Cost Engineering See 35+     See less Visio Projects Access Microsoft Excel Outlook Microsoft Word PowerPoint Program Management Project Management MS Project Construction Management Contract Management Engineering Project Planning Process Improvement Construction Training Contract Negotiation Analysis Change Management Management Procurement Leadership Risk Management Budgets Manufacturing PMP Process Scheduler Proposal Writing Commissioning Product Development Negotiation Forecasting Strategy Logistics Process Engineering Contractors Project Control Construction Safety Engineering Management Change Orders Project Estimation Primavera P6 Value Engineering Civil Engineering Cost Control Cost Management Materials CPM Scheduling Cost Engineering See 35+     See less Visio Projects Access Microsoft Excel Outlook Microsoft Word PowerPoint Program Management Project Management MS Project Construction Management Contract Management Engineering Project Planning Process Improvement Construction Training Contract Negotiation Analysis Change Management Management Procurement Leadership Risk Management Budgets Manufacturing PMP Process Scheduler Proposal Writing Commissioning Product Development Negotiation Forecasting Strategy Logistics Process Engineering Contractors Project Control Construction Safety Engineering Management Change Orders Project Estimation Primavera P6 Value Engineering Civil Engineering Cost Control Cost Management Materials CPM Scheduling Cost Engineering See 35+     See less Education Michigan Technological University BS,  Civil Engineering - Construction 1968  – 1972 Activities and Societies:  Tau Beta Pi; Chi Epsilon; Intramural Sports; Basketball Team; Blue Bombers Association Michigan Technological University BS,  Civil Engineering - Construction 1968  – 1972 Activities and Societies:  Tau Beta Pi; Chi Epsilon; Intramural Sports; Basketball Team; Blue Bombers Association Michigan Technological University BS,  Civil Engineering - Construction 1968  – 1972 Activities and Societies:  Tau Beta Pi; Chi Epsilon; Intramural Sports; Basketball Team; Blue Bombers Association Michigan Technological University BS,  Civil Engineering - Construction 1968  – 1972 Activities and Societies:  Tau Beta Pi; Chi Epsilon; Intramural Sports; Basketball Team; Blue Bombers Association ", "Skills Data Center IT Operations ITIL IT Management Disaster Recovery Business Continuity IT Strategy Process Improvement Security Project Management Team Leadership Vendor Management Cross-functional Team... Program Management Integration Skills  Data Center IT Operations ITIL IT Management Disaster Recovery Business Continuity IT Strategy Process Improvement Security Project Management Team Leadership Vendor Management Cross-functional Team... Program Management Integration Data Center IT Operations ITIL IT Management Disaster Recovery Business Continuity IT Strategy Process Improvement Security Project Management Team Leadership Vendor Management Cross-functional Team... Program Management Integration Data Center IT Operations ITIL IT Management Disaster Recovery Business Continuity IT Strategy Process Improvement Security Project Management Team Leadership Vendor Management Cross-functional Team... Program Management Integration ", "Experience Site Construction Manager Intel Corporation 2006  – Present (9 years) Chandler Arizona Site Construction Manager Intel Corporation 2006  – Present (9 years) Chandler Arizona Site Construction Manager Intel Corporation 2006  – Present (9 years) Chandler Arizona Education Brigham Young University Bachelor's Degree,  Construction Management 1992  – 1998 Brigham Young University Bachelor's Degree,  Construction Management 1992  – 1998 Brigham Young University Bachelor's Degree,  Construction Management 1992  – 1998 Brigham Young University Bachelor's Degree,  Construction Management 1992  – 1998 ", "Summary IT executive with over 20 years experience leading a variety of IT organizations from focused engineering teams to global operations and services management. I have extensive experience managing large global teams in both a direct and outsourced arrangement. I also have experience managing large outsourcing migrations and ongoing outsourced operations. \n \nSpecialties: IT management including organizational development, strategic assessment and alignment, process improvement and implementation, production operations, data center management, release management, platform engineering and IT governance. Assessment and implementation of IT Service Management best practices using ITIL, ISO/IEC 20000 and COBIT frameworks. Summary IT executive with over 20 years experience leading a variety of IT organizations from focused engineering teams to global operations and services management. I have extensive experience managing large global teams in both a direct and outsourced arrangement. I also have experience managing large outsourcing migrations and ongoing outsourced operations. \n \nSpecialties: IT management including organizational development, strategic assessment and alignment, process improvement and implementation, production operations, data center management, release management, platform engineering and IT governance. Assessment and implementation of IT Service Management best practices using ITIL, ISO/IEC 20000 and COBIT frameworks. IT executive with over 20 years experience leading a variety of IT organizations from focused engineering teams to global operations and services management. I have extensive experience managing large global teams in both a direct and outsourced arrangement. I also have experience managing large outsourcing migrations and ongoing outsourced operations. \n \nSpecialties: IT management including organizational development, strategic assessment and alignment, process improvement and implementation, production operations, data center management, release management, platform engineering and IT governance. Assessment and implementation of IT Service Management best practices using ITIL, ISO/IEC 20000 and COBIT frameworks. IT executive with over 20 years experience leading a variety of IT organizations from focused engineering teams to global operations and services management. I have extensive experience managing large global teams in both a direct and outsourced arrangement. I also have experience managing large outsourcing migrations and ongoing outsourced operations. \n \nSpecialties: IT management including organizational development, strategic assessment and alignment, process improvement and implementation, production operations, data center management, release management, platform engineering and IT governance. Assessment and implementation of IT Service Management best practices using ITIL, ISO/IEC 20000 and COBIT frameworks. Experience Vice President, IT Enterprise Services The Standard April 2008  – Present (7 years 5 months) Portland, Oregon Area I lead a diverse IT organization focused on driving new technology and information delivery services that keep our users and customers competitive in the marketplace. Functions I am responsible for include IT End User Services, Infrastructure Services, Infrastructure Architecture & Engineering, IT Supplier Management, Corporate Records and Imaging, Mail and Print Operations.  \n \nWe deliver our services through a combination of dedicated internal employees and a variety of outsourced vendors. We seek and retain the best talent internally and partner with industry leaders to bring the best solutions to our customers. \n \nWe are currently focused on transforming the user experience through modernization of our desktop and Office 365. We will leverage SharePoint Online, Exchange Online, Lync and other technologies to provide a seamless mobile experience enabling our users to access information and collaborate more effectively. We are also modernizing a variety of back office technologies to improve our Service Management, databases and server platforms. Director, IT Operations The Standard April 2008  –  November 2009  (1 year 8 months) IT Global Operations Mgr. Intel Corp. 2004  –  January 2008  (4 years) Manager, IT Operations Service Center Intel Corp. 2002  –  2004  (2 years) IT Construction Manager Intel Corporation 1998  –  2002  (4 years) Network Engineering Manager Intel Corporation June 1995  –  1998  (3 years) Hillsboro, OR Sr. Network Engineer Intel Corporation June 1994  –  June 1995  (1 year 1 month) Hillsboro, OR Systems Engineer Novell 1993  –  1994  (1 year) San Francisco Bay Area Network Engineer Cabletron Systems 1992  –  1993  (1 year) San Jose, CA ASM Marketing Asst. IBM 1988  –  1992  (4 years) Vice President, IT Enterprise Services The Standard April 2008  – Present (7 years 5 months) Portland, Oregon Area I lead a diverse IT organization focused on driving new technology and information delivery services that keep our users and customers competitive in the marketplace. Functions I am responsible for include IT End User Services, Infrastructure Services, Infrastructure Architecture & Engineering, IT Supplier Management, Corporate Records and Imaging, Mail and Print Operations.  \n \nWe deliver our services through a combination of dedicated internal employees and a variety of outsourced vendors. We seek and retain the best talent internally and partner with industry leaders to bring the best solutions to our customers. \n \nWe are currently focused on transforming the user experience through modernization of our desktop and Office 365. We will leverage SharePoint Online, Exchange Online, Lync and other technologies to provide a seamless mobile experience enabling our users to access information and collaborate more effectively. We are also modernizing a variety of back office technologies to improve our Service Management, databases and server platforms. Vice President, IT Enterprise Services The Standard April 2008  – Present (7 years 5 months) Portland, Oregon Area I lead a diverse IT organization focused on driving new technology and information delivery services that keep our users and customers competitive in the marketplace. Functions I am responsible for include IT End User Services, Infrastructure Services, Infrastructure Architecture & Engineering, IT Supplier Management, Corporate Records and Imaging, Mail and Print Operations.  \n \nWe deliver our services through a combination of dedicated internal employees and a variety of outsourced vendors. We seek and retain the best talent internally and partner with industry leaders to bring the best solutions to our customers. \n \nWe are currently focused on transforming the user experience through modernization of our desktop and Office 365. We will leverage SharePoint Online, Exchange Online, Lync and other technologies to provide a seamless mobile experience enabling our users to access information and collaborate more effectively. We are also modernizing a variety of back office technologies to improve our Service Management, databases and server platforms. Director, IT Operations The Standard April 2008  –  November 2009  (1 year 8 months) Director, IT Operations The Standard April 2008  –  November 2009  (1 year 8 months) IT Global Operations Mgr. Intel Corp. 2004  –  January 2008  (4 years) IT Global Operations Mgr. Intel Corp. 2004  –  January 2008  (4 years) Manager, IT Operations Service Center Intel Corp. 2002  –  2004  (2 years) Manager, IT Operations Service Center Intel Corp. 2002  –  2004  (2 years) IT Construction Manager Intel Corporation 1998  –  2002  (4 years) IT Construction Manager Intel Corporation 1998  –  2002  (4 years) Network Engineering Manager Intel Corporation June 1995  –  1998  (3 years) Hillsboro, OR Network Engineering Manager Intel Corporation June 1995  –  1998  (3 years) Hillsboro, OR Sr. Network Engineer Intel Corporation June 1994  –  June 1995  (1 year 1 month) Hillsboro, OR Sr. Network Engineer Intel Corporation June 1994  –  June 1995  (1 year 1 month) Hillsboro, OR Systems Engineer Novell 1993  –  1994  (1 year) San Francisco Bay Area Systems Engineer Novell 1993  –  1994  (1 year) San Francisco Bay Area Network Engineer Cabletron Systems 1992  –  1993  (1 year) San Jose, CA Network Engineer Cabletron Systems 1992  –  1993  (1 year) San Jose, CA ASM Marketing Asst. IBM 1988  –  1992  (4 years) ASM Marketing Asst. IBM 1988  –  1992  (4 years) Skills IT Management IT Strategy ITIL Vendor Management IT Operations Data Center IT Service Management Disaster Recovery Governance Process Improvement Outsourcing Integration Program Management Infrastructure SDLC Information Technology Servers Management Project Management Networking Service Management Leadership Microsoft Exchange See 8+     See less Skills  IT Management IT Strategy ITIL Vendor Management IT Operations Data Center IT Service Management Disaster Recovery Governance Process Improvement Outsourcing Integration Program Management Infrastructure SDLC Information Technology Servers Management Project Management Networking Service Management Leadership Microsoft Exchange See 8+     See less IT Management IT Strategy ITIL Vendor Management IT Operations Data Center IT Service Management Disaster Recovery Governance Process Improvement Outsourcing Integration Program Management Infrastructure SDLC Information Technology Servers Management Project Management Networking Service Management Leadership Microsoft Exchange See 8+     See less IT Management IT Strategy ITIL Vendor Management IT Operations Data Center IT Service Management Disaster Recovery Governance Process Improvement Outsourcing Integration Program Management Infrastructure SDLC Information Technology Servers Management Project Management Networking Service Management Leadership Microsoft Exchange See 8+     See less Education University of California, Santa Cruz BA,  Economics ,  Computer Science 1984  – 1987 Majored in Economics with minor focus in Computer Science. University of California, Santa Cruz BA,  Economics ,  Computer Science 1984  – 1987 Majored in Economics with minor focus in Computer Science. University of California, Santa Cruz BA,  Economics ,  Computer Science 1984  – 1987 Majored in Economics with minor focus in Computer Science. University of California, Santa Cruz BA,  Economics ,  Computer Science 1984  – 1987 Majored in Economics with minor focus in Computer Science. ", "Summary A senior executive professional proficient in providing safe, reliable, cost-effective facilities services, by using a unique skill set in management, operations, construction and industrial engineering experience. A proven innovator interfaces effectively at all levels of management by implementing programs and projects, and optimizing organization productivity, service quality and profitability.  \n \nQUALIFICATIONS SUMMARY \n• Extensive facility management knowledge and skills in a technical environment. \n• Senior leader producing increasing productivity by reducing costs and enhancing profitability. \n• Responsible for successful delivery of complex projects on time and within budget. \n• Outstanding financial and budget management with proficiency managing complex budgets. \n• Effective strategic vision which leads to organizations consistently delivering superior results. \n• Versatile project management experience with a passion for teamwork to achieve deliverables. Summary A senior executive professional proficient in providing safe, reliable, cost-effective facilities services, by using a unique skill set in management, operations, construction and industrial engineering experience. A proven innovator interfaces effectively at all levels of management by implementing programs and projects, and optimizing organization productivity, service quality and profitability.  \n \nQUALIFICATIONS SUMMARY \n• Extensive facility management knowledge and skills in a technical environment. \n• Senior leader producing increasing productivity by reducing costs and enhancing profitability. \n• Responsible for successful delivery of complex projects on time and within budget. \n• Outstanding financial and budget management with proficiency managing complex budgets. \n• Effective strategic vision which leads to organizations consistently delivering superior results. \n• Versatile project management experience with a passion for teamwork to achieve deliverables. A senior executive professional proficient in providing safe, reliable, cost-effective facilities services, by using a unique skill set in management, operations, construction and industrial engineering experience. A proven innovator interfaces effectively at all levels of management by implementing programs and projects, and optimizing organization productivity, service quality and profitability.  \n \nQUALIFICATIONS SUMMARY \n• Extensive facility management knowledge and skills in a technical environment. \n• Senior leader producing increasing productivity by reducing costs and enhancing profitability. \n• Responsible for successful delivery of complex projects on time and within budget. \n• Outstanding financial and budget management with proficiency managing complex budgets. \n• Effective strategic vision which leads to organizations consistently delivering superior results. \n• Versatile project management experience with a passion for teamwork to achieve deliverables. A senior executive professional proficient in providing safe, reliable, cost-effective facilities services, by using a unique skill set in management, operations, construction and industrial engineering experience. A proven innovator interfaces effectively at all levels of management by implementing programs and projects, and optimizing organization productivity, service quality and profitability.  \n \nQUALIFICATIONS SUMMARY \n• Extensive facility management knowledge and skills in a technical environment. \n• Senior leader producing increasing productivity by reducing costs and enhancing profitability. \n• Responsible for successful delivery of complex projects on time and within budget. \n• Outstanding financial and budget management with proficiency managing complex budgets. \n• Effective strategic vision which leads to organizations consistently delivering superior results. \n• Versatile project management experience with a passion for teamwork to achieve deliverables. Experience Senior Project Manager CH2M HILL September 2014  – Present (1 year) Portland, Oregon Area Sr Project Manager (Associate) SSOE Group March 2011  –  August 2014  (3 years 6 months) Portland, Oregon Area SSOE (formally Evergreen EDC) - Global full-service multidiscipline engineering, design and construction services firm supporting semiconductor, solar/photovoltaic, life sciences, advanced technologies, laboratories and data center industries.  \n \nDirected >$6 million high volume manufacturing tool install design project. Increased demand for a customer’s new products initiated conversion of existing factories. Managed a multi discipline 40 person design team of design leads, engineers, designers producing detailed design packages for semiconductor manufacturing equipment installations. Results exceeded project milestones allowing customer to achieve factory start up on time and within budget. Received near 100% supplier rating. Project Manager MEC Electrical Engineering, Inc. November 2010  –  March 2011  (5 months) Portland, Oregon Area Manage construction projects for a Semiconductor Manufacturing company up to $5M from design to project completion. Director of Facilities Intel Corporation March 2002  –  May 2009  (7 years 3 months) Portland, Oregon Area Executive level Management for 570-acre site, with 5.5+ million GSF serving over 7,500 employees, an annual operating budget of $33M and a multi-level organization of 230, plus a contingent workforce of 500-1000. Site included 4 manufacturing factories, 6 multi-story office buildings, 8 general support buildings; 2 warehouses, plus 1 R&D Factory. Consistently achieved corporate goals to maximize factory productivity/uptime and cost effectiveness. Key leadership role directing programs that ensured seamless transfer of innovative facility technologies to all Intel locations. Led strategic financial, productivity & quality programs which saved millions of dollars in facilities and engineering service costs. Senior Operations Manager Intel Corporation June 1998  –  March 2002  (3 years 10 months) Portland, Oregon Area Responsible for real estate and facilities of over 2+ million GSF serving 2600 employees in three factories, two multi-story office buildings. Administration of annual budget of $11M. Leading a multi-level organization of 110 plus a contingent workforce of 250-350.  \n \n+ Initiated National Incident Management System to ensure that major site interfaced seamless with Hillsboro, OR emergency operations. Intel later adopted system company-wide. \n \n+ Orchestrated and managed conversion of R&D factory to high-volume manufacturing facility. To meet demand for technologically advanced products, Intel needed a new HVM plant. As site manager oversaw facilities/infrastructure management team. Delivered a superior production plant with the best product quality/least facility downtime. \n \n+ Averted major production crisis. An ultra pure water contamination problem forced shut down of three Intel factories. A permanent solution was projected to take 10 months and cost Intel tens of millions of dollars in production delays. Led cross-site team which devised an innovative solution, utilizing temporary controls to mitigate losses from this major crisis.  \n \n+ Streamlined campus operations. Growth projections for campus wide services required by Intel’s expanding Oregon campus required a major reorganization. Executive manager directing activities that remodeled the engineering and facilities operations. Result was a leaner more responsive organization reducing overall cost by $2M per year. Design and Construction Manager Intel Corporation August 1995  –  June 1998  (2 years 11 months) Portland, Oregon Area Led an eight person project and construction team with additional contractor workforce of >500 utilizing $5M annual budget to support clean room factory operations. Project execution included campus wide capital, expense project budgets, overall schedule, and scope, minimizing production down-time and safety incidents. End result enabled Intel to capitalize on latest technology to maintain its market leadership.  \n \n+ Developed/implemented superior Project Management Operations policies/procedures. Intel’s new 400-acre campus required more efficient and cost-effective management systems to meet demanding schedule of construction and engineering projects. Established new sustaining PM business systems, enabling first-rate results for projects up to $1.5B in scope. \n \n+ Initiated superior continuous improvement program. Soon after launch of R&D facility, it was clear that not all systems, processes and procedures were in place/at a level that met Intel’s demanding standards. As task force leader established a new quality program, following a TQM methodology to ensure that all operational disciplines, electrical, mechanical, process systems, would consistently perform at a level commensurate with company’s industry stature. Results were greatly improved facility’s reliability and organizational productivity at $500K less cost.  \n \n+ Met demanding schedule for factory build-out. Intel’s newly acquired Colorado plant needed a facilities/engineering team, but lacked ability to develop one. Concurrent with duties in Oregon, directed CO management start-up team in establishing an entire facilities organization, complete with initial building facilities site risk assessment. Start-up team achieved task of having site infrastructure in place on time, enabling factory to meet production demands, capture market share and boost overall revenues. Senior Industrial Engineering Group Leader Intel Corporation September 1987  –  August 1995  (8 years) Albuquerque, New Mexico Area Senior Project Manager CH2M HILL September 2014  – Present (1 year) Portland, Oregon Area Senior Project Manager CH2M HILL September 2014  – Present (1 year) Portland, Oregon Area Sr Project Manager (Associate) SSOE Group March 2011  –  August 2014  (3 years 6 months) Portland, Oregon Area SSOE (formally Evergreen EDC) - Global full-service multidiscipline engineering, design and construction services firm supporting semiconductor, solar/photovoltaic, life sciences, advanced technologies, laboratories and data center industries.  \n \nDirected >$6 million high volume manufacturing tool install design project. Increased demand for a customer’s new products initiated conversion of existing factories. Managed a multi discipline 40 person design team of design leads, engineers, designers producing detailed design packages for semiconductor manufacturing equipment installations. Results exceeded project milestones allowing customer to achieve factory start up on time and within budget. Received near 100% supplier rating. Sr Project Manager (Associate) SSOE Group March 2011  –  August 2014  (3 years 6 months) Portland, Oregon Area SSOE (formally Evergreen EDC) - Global full-service multidiscipline engineering, design and construction services firm supporting semiconductor, solar/photovoltaic, life sciences, advanced technologies, laboratories and data center industries.  \n \nDirected >$6 million high volume manufacturing tool install design project. Increased demand for a customer’s new products initiated conversion of existing factories. Managed a multi discipline 40 person design team of design leads, engineers, designers producing detailed design packages for semiconductor manufacturing equipment installations. Results exceeded project milestones allowing customer to achieve factory start up on time and within budget. Received near 100% supplier rating. Project Manager MEC Electrical Engineering, Inc. November 2010  –  March 2011  (5 months) Portland, Oregon Area Manage construction projects for a Semiconductor Manufacturing company up to $5M from design to project completion. Project Manager MEC Electrical Engineering, Inc. November 2010  –  March 2011  (5 months) Portland, Oregon Area Manage construction projects for a Semiconductor Manufacturing company up to $5M from design to project completion. Director of Facilities Intel Corporation March 2002  –  May 2009  (7 years 3 months) Portland, Oregon Area Executive level Management for 570-acre site, with 5.5+ million GSF serving over 7,500 employees, an annual operating budget of $33M and a multi-level organization of 230, plus a contingent workforce of 500-1000. Site included 4 manufacturing factories, 6 multi-story office buildings, 8 general support buildings; 2 warehouses, plus 1 R&D Factory. Consistently achieved corporate goals to maximize factory productivity/uptime and cost effectiveness. Key leadership role directing programs that ensured seamless transfer of innovative facility technologies to all Intel locations. Led strategic financial, productivity & quality programs which saved millions of dollars in facilities and engineering service costs. Director of Facilities Intel Corporation March 2002  –  May 2009  (7 years 3 months) Portland, Oregon Area Executive level Management for 570-acre site, with 5.5+ million GSF serving over 7,500 employees, an annual operating budget of $33M and a multi-level organization of 230, plus a contingent workforce of 500-1000. Site included 4 manufacturing factories, 6 multi-story office buildings, 8 general support buildings; 2 warehouses, plus 1 R&D Factory. Consistently achieved corporate goals to maximize factory productivity/uptime and cost effectiveness. Key leadership role directing programs that ensured seamless transfer of innovative facility technologies to all Intel locations. Led strategic financial, productivity & quality programs which saved millions of dollars in facilities and engineering service costs. Senior Operations Manager Intel Corporation June 1998  –  March 2002  (3 years 10 months) Portland, Oregon Area Responsible for real estate and facilities of over 2+ million GSF serving 2600 employees in three factories, two multi-story office buildings. Administration of annual budget of $11M. Leading a multi-level organization of 110 plus a contingent workforce of 250-350.  \n \n+ Initiated National Incident Management System to ensure that major site interfaced seamless with Hillsboro, OR emergency operations. Intel later adopted system company-wide. \n \n+ Orchestrated and managed conversion of R&D factory to high-volume manufacturing facility. To meet demand for technologically advanced products, Intel needed a new HVM plant. As site manager oversaw facilities/infrastructure management team. Delivered a superior production plant with the best product quality/least facility downtime. \n \n+ Averted major production crisis. An ultra pure water contamination problem forced shut down of three Intel factories. A permanent solution was projected to take 10 months and cost Intel tens of millions of dollars in production delays. Led cross-site team which devised an innovative solution, utilizing temporary controls to mitigate losses from this major crisis.  \n \n+ Streamlined campus operations. Growth projections for campus wide services required by Intel’s expanding Oregon campus required a major reorganization. Executive manager directing activities that remodeled the engineering and facilities operations. Result was a leaner more responsive organization reducing overall cost by $2M per year. Senior Operations Manager Intel Corporation June 1998  –  March 2002  (3 years 10 months) Portland, Oregon Area Responsible for real estate and facilities of over 2+ million GSF serving 2600 employees in three factories, two multi-story office buildings. Administration of annual budget of $11M. Leading a multi-level organization of 110 plus a contingent workforce of 250-350.  \n \n+ Initiated National Incident Management System to ensure that major site interfaced seamless with Hillsboro, OR emergency operations. Intel later adopted system company-wide. \n \n+ Orchestrated and managed conversion of R&D factory to high-volume manufacturing facility. To meet demand for technologically advanced products, Intel needed a new HVM plant. As site manager oversaw facilities/infrastructure management team. Delivered a superior production plant with the best product quality/least facility downtime. \n \n+ Averted major production crisis. An ultra pure water contamination problem forced shut down of three Intel factories. A permanent solution was projected to take 10 months and cost Intel tens of millions of dollars in production delays. Led cross-site team which devised an innovative solution, utilizing temporary controls to mitigate losses from this major crisis.  \n \n+ Streamlined campus operations. Growth projections for campus wide services required by Intel’s expanding Oregon campus required a major reorganization. Executive manager directing activities that remodeled the engineering and facilities operations. Result was a leaner more responsive organization reducing overall cost by $2M per year. Design and Construction Manager Intel Corporation August 1995  –  June 1998  (2 years 11 months) Portland, Oregon Area Led an eight person project and construction team with additional contractor workforce of >500 utilizing $5M annual budget to support clean room factory operations. Project execution included campus wide capital, expense project budgets, overall schedule, and scope, minimizing production down-time and safety incidents. End result enabled Intel to capitalize on latest technology to maintain its market leadership.  \n \n+ Developed/implemented superior Project Management Operations policies/procedures. Intel’s new 400-acre campus required more efficient and cost-effective management systems to meet demanding schedule of construction and engineering projects. Established new sustaining PM business systems, enabling first-rate results for projects up to $1.5B in scope. \n \n+ Initiated superior continuous improvement program. Soon after launch of R&D facility, it was clear that not all systems, processes and procedures were in place/at a level that met Intel’s demanding standards. As task force leader established a new quality program, following a TQM methodology to ensure that all operational disciplines, electrical, mechanical, process systems, would consistently perform at a level commensurate with company’s industry stature. Results were greatly improved facility’s reliability and organizational productivity at $500K less cost.  \n \n+ Met demanding schedule for factory build-out. Intel’s newly acquired Colorado plant needed a facilities/engineering team, but lacked ability to develop one. Concurrent with duties in Oregon, directed CO management start-up team in establishing an entire facilities organization, complete with initial building facilities site risk assessment. Start-up team achieved task of having site infrastructure in place on time, enabling factory to meet production demands, capture market share and boost overall revenues. Design and Construction Manager Intel Corporation August 1995  –  June 1998  (2 years 11 months) Portland, Oregon Area Led an eight person project and construction team with additional contractor workforce of >500 utilizing $5M annual budget to support clean room factory operations. Project execution included campus wide capital, expense project budgets, overall schedule, and scope, minimizing production down-time and safety incidents. End result enabled Intel to capitalize on latest technology to maintain its market leadership.  \n \n+ Developed/implemented superior Project Management Operations policies/procedures. Intel’s new 400-acre campus required more efficient and cost-effective management systems to meet demanding schedule of construction and engineering projects. Established new sustaining PM business systems, enabling first-rate results for projects up to $1.5B in scope. \n \n+ Initiated superior continuous improvement program. Soon after launch of R&D facility, it was clear that not all systems, processes and procedures were in place/at a level that met Intel’s demanding standards. As task force leader established a new quality program, following a TQM methodology to ensure that all operational disciplines, electrical, mechanical, process systems, would consistently perform at a level commensurate with company’s industry stature. Results were greatly improved facility’s reliability and organizational productivity at $500K less cost.  \n \n+ Met demanding schedule for factory build-out. Intel’s newly acquired Colorado plant needed a facilities/engineering team, but lacked ability to develop one. Concurrent with duties in Oregon, directed CO management start-up team in establishing an entire facilities organization, complete with initial building facilities site risk assessment. Start-up team achieved task of having site infrastructure in place on time, enabling factory to meet production demands, capture market share and boost overall revenues. Senior Industrial Engineering Group Leader Intel Corporation September 1987  –  August 1995  (8 years) Albuquerque, New Mexico Area Senior Industrial Engineering Group Leader Intel Corporation September 1987  –  August 1995  (8 years) Albuquerque, New Mexico Area Languages English English English Skills Facilities Management Management Risk Assessment Engineering Management Operations Management Program Management Process Improvement Cross-functional Team... Project Management Project Planning Product Management Construction Management Semiconductors Continuous Improvement Contract Negotiation Change Management Budgets Strategic Planning Leadership Six Sigma Data Center Vendor Management Project Engineering Contract Management Coaching Process Engineering Analysis Product Development Electricians Factory Energy Training Disaster Recovery Team Leadership Business Process... Lean Manufacturing Negotiation Procurement Commissioning Start-ups Process Scheduler Root Cause Analysis Strategy MS Project Process Simulation Industrial Engineering Microsoft Project See 32+     See less Skills  Facilities Management Management Risk Assessment Engineering Management Operations Management Program Management Process Improvement Cross-functional Team... Project Management Project Planning Product Management Construction Management Semiconductors Continuous Improvement Contract Negotiation Change Management Budgets Strategic Planning Leadership Six Sigma Data Center Vendor Management Project Engineering Contract Management Coaching Process Engineering Analysis Product Development Electricians Factory Energy Training Disaster Recovery Team Leadership Business Process... Lean Manufacturing Negotiation Procurement Commissioning Start-ups Process Scheduler Root Cause Analysis Strategy MS Project Process Simulation Industrial Engineering Microsoft Project See 32+     See less Facilities Management Management Risk Assessment Engineering Management Operations Management Program Management Process Improvement Cross-functional Team... Project Management Project Planning Product Management Construction Management Semiconductors Continuous Improvement Contract Negotiation Change Management Budgets Strategic Planning Leadership Six Sigma Data Center Vendor Management Project Engineering Contract Management Coaching Process Engineering Analysis Product Development Electricians Factory Energy Training Disaster Recovery Team Leadership Business Process... Lean Manufacturing Negotiation Procurement Commissioning Start-ups Process Scheduler Root Cause Analysis Strategy MS Project Process Simulation Industrial Engineering Microsoft Project See 32+     See less Facilities Management Management Risk Assessment Engineering Management Operations Management Program Management Process Improvement Cross-functional Team... Project Management Project Planning Product Management Construction Management Semiconductors Continuous Improvement Contract Negotiation Change Management Budgets Strategic Planning Leadership Six Sigma Data Center Vendor Management Project Engineering Contract Management Coaching Process Engineering Analysis Product Development Electricians Factory Energy Training Disaster Recovery Team Leadership Business Process... Lean Manufacturing Negotiation Procurement Commissioning Start-ups Process Scheduler Root Cause Analysis Strategy MS Project Process Simulation Industrial Engineering Microsoft Project See 32+     See less Education University of Phoenix MBA,  Business Administration 1990  – 1993 California Polytechnic State University-San Luis Obispo BS Industrial Technology,  Plant Facilities Management 1979  – 1982 San Jose City College Associate of Science,  Fire Science University of Phoenix MBA,  Business Administration 1990  – 1993 University of Phoenix MBA,  Business Administration 1990  – 1993 University of Phoenix MBA,  Business Administration 1990  – 1993 California Polytechnic State University-San Luis Obispo BS Industrial Technology,  Plant Facilities Management 1979  – 1982 California Polytechnic State University-San Luis Obispo BS Industrial Technology,  Plant Facilities Management 1979  – 1982 California Polytechnic State University-San Luis Obispo BS Industrial Technology,  Plant Facilities Management 1979  – 1982 San Jose City College Associate of Science,  Fire Science San Jose City College Associate of Science,  Fire Science San Jose City College Associate of Science,  Fire Science Honors & Awards Additional Honors & Awards Division Recognition Awards: Honored for significant division impact. \n1) Q2’ 2008: Created detailed process to protect company Intellectual Property in the CS facilities services environment.  \n \n2) Q3’ 2005: Outstanding improvement in reliability of facility systems with a 30% in 2003 and 20% improvement in 2004. \n \n3) Q1’ 2004: for driving Corporate Services operational improvements, collaboration and standardization at all factory sites in US and Europe. \n \n4) Q4’ 1997: Site projects team safely attaining outstanding tool install costs, meeting dynamic schedule, effectively growing project delivery organization.  \n \nPegasus Award (1996): Construction Project Value engineering and productivity improvements that reduced overall construction project costs by 37% and set new company benchmarks. \n \nQuality Achievement Award (1990): 1-year team development project which improved area factory quality, output and decreased overall manufacturing through put time. Additional Honors & Awards Division Recognition Awards: Honored for significant division impact. \n1) Q2’ 2008: Created detailed process to protect company Intellectual Property in the CS facilities services environment.  \n \n2) Q3’ 2005: Outstanding improvement in reliability of facility systems with a 30% in 2003 and 20% improvement in 2004. \n \n3) Q1’ 2004: for driving Corporate Services operational improvements, collaboration and standardization at all factory sites in US and Europe. \n \n4) Q4’ 1997: Site projects team safely attaining outstanding tool install costs, meeting dynamic schedule, effectively growing project delivery organization.  \n \nPegasus Award (1996): Construction Project Value engineering and productivity improvements that reduced overall construction project costs by 37% and set new company benchmarks. \n \nQuality Achievement Award (1990): 1-year team development project which improved area factory quality, output and decreased overall manufacturing through put time. Additional Honors & Awards Division Recognition Awards: Honored for significant division impact. \n1) Q2’ 2008: Created detailed process to protect company Intellectual Property in the CS facilities services environment.  \n \n2) Q3’ 2005: Outstanding improvement in reliability of facility systems with a 30% in 2003 and 20% improvement in 2004. \n \n3) Q1’ 2004: for driving Corporate Services operational improvements, collaboration and standardization at all factory sites in US and Europe. \n \n4) Q4’ 1997: Site projects team safely attaining outstanding tool install costs, meeting dynamic schedule, effectively growing project delivery organization.  \n \nPegasus Award (1996): Construction Project Value engineering and productivity improvements that reduced overall construction project costs by 37% and set new company benchmarks. \n \nQuality Achievement Award (1990): 1-year team development project which improved area factory quality, output and decreased overall manufacturing through put time. Additional Honors & Awards Division Recognition Awards: Honored for significant division impact. \n1) Q2’ 2008: Created detailed process to protect company Intellectual Property in the CS facilities services environment.  \n \n2) Q3’ 2005: Outstanding improvement in reliability of facility systems with a 30% in 2003 and 20% improvement in 2004. \n \n3) Q1’ 2004: for driving Corporate Services operational improvements, collaboration and standardization at all factory sites in US and Europe. \n \n4) Q4’ 1997: Site projects team safely attaining outstanding tool install costs, meeting dynamic schedule, effectively growing project delivery organization.  \n \nPegasus Award (1996): Construction Project Value engineering and productivity improvements that reduced overall construction project costs by 37% and set new company benchmarks. \n \nQuality Achievement Award (1990): 1-year team development project which improved area factory quality, output and decreased overall manufacturing through put time. ", "Summary Accomplished Facilities Executive with international management experience and complementary strengths in project management, energy conservation, and mechanical engineering.  Summary Accomplished Facilities Executive with international management experience and complementary strengths in project management, energy conservation, and mechanical engineering.  Accomplished Facilities Executive with international management experience and complementary strengths in project management, energy conservation, and mechanical engineering.  Accomplished Facilities Executive with international management experience and complementary strengths in project management, energy conservation, and mechanical engineering.  Experience Senior Vice President Jones Lang LaSalle July 2013  – Present (2 years 2 months) Chandler, AZ National Operations Director/National Engineering Director: \nDirecting the activities of 230 technicians, engineers and 1200 contractors to provide IFM service delivery across a network of 4 client sites consisting of 15 million sq-ft of commercial and industrial space in Arizona, New Mexico and Massachusetts.  \n•\tRe-organized 2 site management structures to improve service delivery and accountability \n•\tManage Operating Budget of over $45 million and associated contribution to P&L \n•\tAdditional P&L contribution through identification and successful delivery of major maintenance projects to improve facility reliability \n•\tManage risk to firm and client through partnership with Risk Management as well as delivery of Corporate Engineering Services Compliance Program,  \n•\tSubject Matter Expert for operations, maintenance, engineering of cleanroom and general facility systems  \n•\tDrive insourcing of maintenance ranging from chillers to Fire Extinguishers to reduce cost, improve service delivery and manage risk to the firm.  \n•\tDevelop new client relationships across the Manufacturing and Technology Development portfolio  \n•\tSuccessfully sold $250k Intellicommand Smart Building Product for deployment at a pilot site in California. \n•\tGraduate of JLL “NEXT Leader of Leaders” Program \n Vice President/National Engineering Director Jones Lang LaSalle February 2012  –  July 2013  (1 year 6 months) Chandler, Arizona/Nationwide Upon repatriation to the US, assumed responsibility for 6.8 million sq-ft of space in Arizona as well as service line responsibility of all Hard Services across 30 million sq-ft of commercial and industrial space. \nPeople Management & Development: \no\tLead a team of 120 JLL employees and over 700 contractors. \no\tIdentified need for a comprehensive Technician Development program. Assembled team, developed program that is successfully providing training of over 1,400 hours per year. \no\tContinually assess organizational health, make adjustments to suit skill sets and growth and hold employees accountable. Ongoing management of low performing talent to improve or exit the firm. \nFinancial Management \no\tLed team to meet operating budget targets of $25 million  \no\tAdded $1.5 million of project related spends and associated contribution to the P&L \n \nClient Relationship : \no\tAdded 285,000 sq-ft of factory space under JLL management and $4.95 million additional spends. Added 25 headcount and provided commissioning oversight services to startup of new facility systems. \no\tDeployed a proactive incident reduction program resulting in a 53% reduction of interruptions to client operations/production. This resulted in a Positive contribution of fee to the P&L of 1.5x fees by hitting the “high quality” incentive in 2012 and 2013. \no\tSuccessfully sold $250k Intellicommand Product for deployment at a pilot site in California. \nAwards: \n•\tJLL FM Lead of the year - 2013 \n•\tQ3’2013 Innovation Award – Elevator Reliability Dashboard \n•\tBeacon Award for excellence in management 2013 – runner up  \n•\tPromoted to Senior Vice President in July 2013 Vice President/Account Director - Intel EMEA Jones Lang LaSalle April 2010  –  February 2012  (1 year 11 months) Ireland Promoted to Regional leadership role for the Intel EMEA IFM account (newly acquired IFM account) as an Ex-Pat. Direct P&L responsibility to the EMEA IFM business line and service delivery to the client. Focused on achievement of CPI (contract performance indicators) and financial goals to achieve a successful startup. Leveraged deep understanding of the Client operations and company culture to manage EMEA Regional contract. \no\tManagement Scope: Reporting to Managing Director EMEA IFM. Lead diverse team of 98 JLL employees and over 700 contractors across 34 sites and 14 European and Middle East countries. Act as Primary client interface with full P&L to the Firm.  \no\tManage services for 8.5 million square-feet of client space, including: technical services (chillers, power systems), cleanroom custodial, catering, security, logistics, and call center.  \no\tLed team that identified $7.1M in savings on a baseline of $41.2M. \no\tManage delivery as Principal of Small Projects and Construction services across mainland Europe sites for all work under $5 million. \no\tAchieved world-class safety record by enforcing OSHA Recordable Rate at 0.4, which earned 2 safety-performance awards for EMEA IFM: British Safety Council International Safety Award for Merit and the RoSPA Gold Award. \no\tManaged startup of the account by stabilizing operational Contract Performance Indicators (CPIs) and Quality Performance Indicators (QPIs). Vice President/Arizona Site Manager Jones Lang LaSalle January 2009  –  April 2010  (1 year 4 months) Chandler, AZ Led a team of engineers and technicians to deliver the IFM program on campuses. Achieved quarterly budget targets, and delivered services on schedule. \n•\tManaged operations team – 61 JLL employees and 200+ contractors.  \n•\tOut-performed budget target by 2.7% – quarterly average – on $24.5M budget. \n•\tDelivered IFM services for 6.8 million square-feet of client space including: technical services (chillers, power systems), and clean room custodial. \n•\tAchieved 98% PM PAS (Preventative Maintenance Performance Against Schedule); achieved 99.5% Reactive work PAS; and increased Reactive Survey Customer Satisfaction to 90%. \n•\tMet contract performance goals by implementing a reorganization and headcount reduction. Mechanical Engineering Manager Intel Corporation February 2008  –  December 2008  (11 months) Chandler, AZ Selected to lead mechanical engineering team – based on experience in mechanical engineering for semiconductor manufacturing – and provided matrix-management support to the mechanical operations team. Managed 8 engineers and set technical direction and goals for engineering plans.  \n•\tAs Mechanical Module Team leader, led 32 mechanical technicians, 8 engineers and 4 supervisors. Managed $9M annual Natural Gas budget and $7M mechanical maintenance budget (including 50+ direct contracts). Set overall direction for the Mechanical group.  \n•\tReorganized module team, which increased effectiveness and achieved 100% on-job attendance. \n•\tImplemented several development programs including mentoring for junior engineers, KPIs for system performance, and an Engineering Excellence program. \n•\tAchieved $1.25 million annual energy savings – conserved12 million kW-h and 500,000 therms of natural gas. Project Engineer & Construction Manager Intel Corporation November 2005  –  February 2008  (2 years 4 months) Qiryat Gat, Israel Led design and construction for the process-mechanical scope of a new semiconductor factory. Executed $100M construction scope despite significant challenges with resources and personnel. Led multinational design, construction, and commissioning team that met schedule, scope, and budget. Negotiated contracts with sub-contractors. \n•\tAchieved safe, accurate, maintainable design that aligned with reference factory. Managed Process Mechanical and UPW (Ultra Pure Water) construction PAS (Progress Against Schedule).  \n•\tApplied S-curves, headcount charts, and micro schedules to avoid trade & resource constraints. \n•\tManaged Change Orders and Design Changes, which eliminated schedule delays. Ensured accuracy of financial forecasts via tie-in to project schedules \n•\tMentored new Israeli employees as a part of succession planning. Implemented capacity database for mechanical, process mechanical, UPW, Gases and waste systems Senior Facilities Engineer Intel Corporation November 1997  –  November 2005  (8 years 1 month) Chandler, AZ Subject matter expert on Facilites systems including chillers, boilers, Acid fume scrubbers, air handler, Cleanroom HVAC, etc Project Manager/Controls Engineer Landis & Staefa January 1996  –  October 1997  (1 year 10 months) •\tResponsible for design, and project management of Landis & Staefa DDC systems in office buildings and industrial facilities in and around the Austin Metropolitan Area.  \n•\tWorked directly with Customers, A/E & General Contractor’s to develop solutions that met their needs. \n•\tAssisted the sales department in selling extremely technical jobs. \n•\tManaged resources and budgets from design through startup to maintain within +/-3% of sales price. \n•\tTechnical resource for field staff and customer point of contact Senior Vice President Jones Lang LaSalle July 2013  – Present (2 years 2 months) Chandler, AZ National Operations Director/National Engineering Director: \nDirecting the activities of 230 technicians, engineers and 1200 contractors to provide IFM service delivery across a network of 4 client sites consisting of 15 million sq-ft of commercial and industrial space in Arizona, New Mexico and Massachusetts.  \n•\tRe-organized 2 site management structures to improve service delivery and accountability \n•\tManage Operating Budget of over $45 million and associated contribution to P&L \n•\tAdditional P&L contribution through identification and successful delivery of major maintenance projects to improve facility reliability \n•\tManage risk to firm and client through partnership with Risk Management as well as delivery of Corporate Engineering Services Compliance Program,  \n•\tSubject Matter Expert for operations, maintenance, engineering of cleanroom and general facility systems  \n•\tDrive insourcing of maintenance ranging from chillers to Fire Extinguishers to reduce cost, improve service delivery and manage risk to the firm.  \n•\tDevelop new client relationships across the Manufacturing and Technology Development portfolio  \n•\tSuccessfully sold $250k Intellicommand Smart Building Product for deployment at a pilot site in California. \n•\tGraduate of JLL “NEXT Leader of Leaders” Program \n Senior Vice President Jones Lang LaSalle July 2013  – Present (2 years 2 months) Chandler, AZ National Operations Director/National Engineering Director: \nDirecting the activities of 230 technicians, engineers and 1200 contractors to provide IFM service delivery across a network of 4 client sites consisting of 15 million sq-ft of commercial and industrial space in Arizona, New Mexico and Massachusetts.  \n•\tRe-organized 2 site management structures to improve service delivery and accountability \n•\tManage Operating Budget of over $45 million and associated contribution to P&L \n•\tAdditional P&L contribution through identification and successful delivery of major maintenance projects to improve facility reliability \n•\tManage risk to firm and client through partnership with Risk Management as well as delivery of Corporate Engineering Services Compliance Program,  \n•\tSubject Matter Expert for operations, maintenance, engineering of cleanroom and general facility systems  \n•\tDrive insourcing of maintenance ranging from chillers to Fire Extinguishers to reduce cost, improve service delivery and manage risk to the firm.  \n•\tDevelop new client relationships across the Manufacturing and Technology Development portfolio  \n•\tSuccessfully sold $250k Intellicommand Smart Building Product for deployment at a pilot site in California. \n•\tGraduate of JLL “NEXT Leader of Leaders” Program \n Vice President/National Engineering Director Jones Lang LaSalle February 2012  –  July 2013  (1 year 6 months) Chandler, Arizona/Nationwide Upon repatriation to the US, assumed responsibility for 6.8 million sq-ft of space in Arizona as well as service line responsibility of all Hard Services across 30 million sq-ft of commercial and industrial space. \nPeople Management & Development: \no\tLead a team of 120 JLL employees and over 700 contractors. \no\tIdentified need for a comprehensive Technician Development program. Assembled team, developed program that is successfully providing training of over 1,400 hours per year. \no\tContinually assess organizational health, make adjustments to suit skill sets and growth and hold employees accountable. Ongoing management of low performing talent to improve or exit the firm. \nFinancial Management \no\tLed team to meet operating budget targets of $25 million  \no\tAdded $1.5 million of project related spends and associated contribution to the P&L \n \nClient Relationship : \no\tAdded 285,000 sq-ft of factory space under JLL management and $4.95 million additional spends. Added 25 headcount and provided commissioning oversight services to startup of new facility systems. \no\tDeployed a proactive incident reduction program resulting in a 53% reduction of interruptions to client operations/production. This resulted in a Positive contribution of fee to the P&L of 1.5x fees by hitting the “high quality” incentive in 2012 and 2013. \no\tSuccessfully sold $250k Intellicommand Product for deployment at a pilot site in California. \nAwards: \n•\tJLL FM Lead of the year - 2013 \n•\tQ3’2013 Innovation Award – Elevator Reliability Dashboard \n•\tBeacon Award for excellence in management 2013 – runner up  \n•\tPromoted to Senior Vice President in July 2013 Vice President/National Engineering Director Jones Lang LaSalle February 2012  –  July 2013  (1 year 6 months) Chandler, Arizona/Nationwide Upon repatriation to the US, assumed responsibility for 6.8 million sq-ft of space in Arizona as well as service line responsibility of all Hard Services across 30 million sq-ft of commercial and industrial space. \nPeople Management & Development: \no\tLead a team of 120 JLL employees and over 700 contractors. \no\tIdentified need for a comprehensive Technician Development program. Assembled team, developed program that is successfully providing training of over 1,400 hours per year. \no\tContinually assess organizational health, make adjustments to suit skill sets and growth and hold employees accountable. Ongoing management of low performing talent to improve or exit the firm. \nFinancial Management \no\tLed team to meet operating budget targets of $25 million  \no\tAdded $1.5 million of project related spends and associated contribution to the P&L \n \nClient Relationship : \no\tAdded 285,000 sq-ft of factory space under JLL management and $4.95 million additional spends. Added 25 headcount and provided commissioning oversight services to startup of new facility systems. \no\tDeployed a proactive incident reduction program resulting in a 53% reduction of interruptions to client operations/production. This resulted in a Positive contribution of fee to the P&L of 1.5x fees by hitting the “high quality” incentive in 2012 and 2013. \no\tSuccessfully sold $250k Intellicommand Product for deployment at a pilot site in California. \nAwards: \n•\tJLL FM Lead of the year - 2013 \n•\tQ3’2013 Innovation Award – Elevator Reliability Dashboard \n•\tBeacon Award for excellence in management 2013 – runner up  \n•\tPromoted to Senior Vice President in July 2013 Vice President/Account Director - Intel EMEA Jones Lang LaSalle April 2010  –  February 2012  (1 year 11 months) Ireland Promoted to Regional leadership role for the Intel EMEA IFM account (newly acquired IFM account) as an Ex-Pat. Direct P&L responsibility to the EMEA IFM business line and service delivery to the client. Focused on achievement of CPI (contract performance indicators) and financial goals to achieve a successful startup. Leveraged deep understanding of the Client operations and company culture to manage EMEA Regional contract. \no\tManagement Scope: Reporting to Managing Director EMEA IFM. Lead diverse team of 98 JLL employees and over 700 contractors across 34 sites and 14 European and Middle East countries. Act as Primary client interface with full P&L to the Firm.  \no\tManage services for 8.5 million square-feet of client space, including: technical services (chillers, power systems), cleanroom custodial, catering, security, logistics, and call center.  \no\tLed team that identified $7.1M in savings on a baseline of $41.2M. \no\tManage delivery as Principal of Small Projects and Construction services across mainland Europe sites for all work under $5 million. \no\tAchieved world-class safety record by enforcing OSHA Recordable Rate at 0.4, which earned 2 safety-performance awards for EMEA IFM: British Safety Council International Safety Award for Merit and the RoSPA Gold Award. \no\tManaged startup of the account by stabilizing operational Contract Performance Indicators (CPIs) and Quality Performance Indicators (QPIs). Vice President/Account Director - Intel EMEA Jones Lang LaSalle April 2010  –  February 2012  (1 year 11 months) Ireland Promoted to Regional leadership role for the Intel EMEA IFM account (newly acquired IFM account) as an Ex-Pat. Direct P&L responsibility to the EMEA IFM business line and service delivery to the client. Focused on achievement of CPI (contract performance indicators) and financial goals to achieve a successful startup. Leveraged deep understanding of the Client operations and company culture to manage EMEA Regional contract. \no\tManagement Scope: Reporting to Managing Director EMEA IFM. Lead diverse team of 98 JLL employees and over 700 contractors across 34 sites and 14 European and Middle East countries. Act as Primary client interface with full P&L to the Firm.  \no\tManage services for 8.5 million square-feet of client space, including: technical services (chillers, power systems), cleanroom custodial, catering, security, logistics, and call center.  \no\tLed team that identified $7.1M in savings on a baseline of $41.2M. \no\tManage delivery as Principal of Small Projects and Construction services across mainland Europe sites for all work under $5 million. \no\tAchieved world-class safety record by enforcing OSHA Recordable Rate at 0.4, which earned 2 safety-performance awards for EMEA IFM: British Safety Council International Safety Award for Merit and the RoSPA Gold Award. \no\tManaged startup of the account by stabilizing operational Contract Performance Indicators (CPIs) and Quality Performance Indicators (QPIs). Vice President/Arizona Site Manager Jones Lang LaSalle January 2009  –  April 2010  (1 year 4 months) Chandler, AZ Led a team of engineers and technicians to deliver the IFM program on campuses. Achieved quarterly budget targets, and delivered services on schedule. \n•\tManaged operations team – 61 JLL employees and 200+ contractors.  \n•\tOut-performed budget target by 2.7% – quarterly average – on $24.5M budget. \n•\tDelivered IFM services for 6.8 million square-feet of client space including: technical services (chillers, power systems), and clean room custodial. \n•\tAchieved 98% PM PAS (Preventative Maintenance Performance Against Schedule); achieved 99.5% Reactive work PAS; and increased Reactive Survey Customer Satisfaction to 90%. \n•\tMet contract performance goals by implementing a reorganization and headcount reduction. Vice President/Arizona Site Manager Jones Lang LaSalle January 2009  –  April 2010  (1 year 4 months) Chandler, AZ Led a team of engineers and technicians to deliver the IFM program on campuses. Achieved quarterly budget targets, and delivered services on schedule. \n•\tManaged operations team – 61 JLL employees and 200+ contractors.  \n•\tOut-performed budget target by 2.7% – quarterly average – on $24.5M budget. \n•\tDelivered IFM services for 6.8 million square-feet of client space including: technical services (chillers, power systems), and clean room custodial. \n•\tAchieved 98% PM PAS (Preventative Maintenance Performance Against Schedule); achieved 99.5% Reactive work PAS; and increased Reactive Survey Customer Satisfaction to 90%. \n•\tMet contract performance goals by implementing a reorganization and headcount reduction. Mechanical Engineering Manager Intel Corporation February 2008  –  December 2008  (11 months) Chandler, AZ Selected to lead mechanical engineering team – based on experience in mechanical engineering for semiconductor manufacturing – and provided matrix-management support to the mechanical operations team. Managed 8 engineers and set technical direction and goals for engineering plans.  \n•\tAs Mechanical Module Team leader, led 32 mechanical technicians, 8 engineers and 4 supervisors. Managed $9M annual Natural Gas budget and $7M mechanical maintenance budget (including 50+ direct contracts). Set overall direction for the Mechanical group.  \n•\tReorganized module team, which increased effectiveness and achieved 100% on-job attendance. \n•\tImplemented several development programs including mentoring for junior engineers, KPIs for system performance, and an Engineering Excellence program. \n•\tAchieved $1.25 million annual energy savings – conserved12 million kW-h and 500,000 therms of natural gas. Mechanical Engineering Manager Intel Corporation February 2008  –  December 2008  (11 months) Chandler, AZ Selected to lead mechanical engineering team – based on experience in mechanical engineering for semiconductor manufacturing – and provided matrix-management support to the mechanical operations team. Managed 8 engineers and set technical direction and goals for engineering plans.  \n•\tAs Mechanical Module Team leader, led 32 mechanical technicians, 8 engineers and 4 supervisors. Managed $9M annual Natural Gas budget and $7M mechanical maintenance budget (including 50+ direct contracts). Set overall direction for the Mechanical group.  \n•\tReorganized module team, which increased effectiveness and achieved 100% on-job attendance. \n•\tImplemented several development programs including mentoring for junior engineers, KPIs for system performance, and an Engineering Excellence program. \n•\tAchieved $1.25 million annual energy savings – conserved12 million kW-h and 500,000 therms of natural gas. Project Engineer & Construction Manager Intel Corporation November 2005  –  February 2008  (2 years 4 months) Qiryat Gat, Israel Led design and construction for the process-mechanical scope of a new semiconductor factory. Executed $100M construction scope despite significant challenges with resources and personnel. Led multinational design, construction, and commissioning team that met schedule, scope, and budget. Negotiated contracts with sub-contractors. \n•\tAchieved safe, accurate, maintainable design that aligned with reference factory. Managed Process Mechanical and UPW (Ultra Pure Water) construction PAS (Progress Against Schedule).  \n•\tApplied S-curves, headcount charts, and micro schedules to avoid trade & resource constraints. \n•\tManaged Change Orders and Design Changes, which eliminated schedule delays. Ensured accuracy of financial forecasts via tie-in to project schedules \n•\tMentored new Israeli employees as a part of succession planning. Implemented capacity database for mechanical, process mechanical, UPW, Gases and waste systems Project Engineer & Construction Manager Intel Corporation November 2005  –  February 2008  (2 years 4 months) Qiryat Gat, Israel Led design and construction for the process-mechanical scope of a new semiconductor factory. Executed $100M construction scope despite significant challenges with resources and personnel. Led multinational design, construction, and commissioning team that met schedule, scope, and budget. Negotiated contracts with sub-contractors. \n•\tAchieved safe, accurate, maintainable design that aligned with reference factory. Managed Process Mechanical and UPW (Ultra Pure Water) construction PAS (Progress Against Schedule).  \n•\tApplied S-curves, headcount charts, and micro schedules to avoid trade & resource constraints. \n•\tManaged Change Orders and Design Changes, which eliminated schedule delays. Ensured accuracy of financial forecasts via tie-in to project schedules \n•\tMentored new Israeli employees as a part of succession planning. Implemented capacity database for mechanical, process mechanical, UPW, Gases and waste systems Senior Facilities Engineer Intel Corporation November 1997  –  November 2005  (8 years 1 month) Chandler, AZ Subject matter expert on Facilites systems including chillers, boilers, Acid fume scrubbers, air handler, Cleanroom HVAC, etc Senior Facilities Engineer Intel Corporation November 1997  –  November 2005  (8 years 1 month) Chandler, AZ Subject matter expert on Facilites systems including chillers, boilers, Acid fume scrubbers, air handler, Cleanroom HVAC, etc Project Manager/Controls Engineer Landis & Staefa January 1996  –  October 1997  (1 year 10 months) •\tResponsible for design, and project management of Landis & Staefa DDC systems in office buildings and industrial facilities in and around the Austin Metropolitan Area.  \n•\tWorked directly with Customers, A/E & General Contractor’s to develop solutions that met their needs. \n•\tAssisted the sales department in selling extremely technical jobs. \n•\tManaged resources and budgets from design through startup to maintain within +/-3% of sales price. \n•\tTechnical resource for field staff and customer point of contact Project Manager/Controls Engineer Landis & Staefa January 1996  –  October 1997  (1 year 10 months) •\tResponsible for design, and project management of Landis & Staefa DDC systems in office buildings and industrial facilities in and around the Austin Metropolitan Area.  \n•\tWorked directly with Customers, A/E & General Contractor’s to develop solutions that met their needs. \n•\tAssisted the sales department in selling extremely technical jobs. \n•\tManaged resources and budgets from design through startup to maintain within +/-3% of sales price. \n•\tTechnical resource for field staff and customer point of contact Skills Facilities Management HVAC Energy Management Contract Management Energy Efficiency Contract Negotiation Construction Management Cross-functional Team... Procurement Engineering Management Project Management Operations Management Engineering MS Project Skills  Facilities Management HVAC Energy Management Contract Management Energy Efficiency Contract Negotiation Construction Management Cross-functional Team... Procurement Engineering Management Project Management Operations Management Engineering MS Project Facilities Management HVAC Energy Management Contract Management Energy Efficiency Contract Negotiation Construction Management Cross-functional Team... Procurement Engineering Management Project Management Operations Management Engineering MS Project Facilities Management HVAC Energy Management Contract Management Energy Efficiency Contract Negotiation Construction Management Cross-functional Team... Procurement Engineering Management Project Management Operations Management Engineering MS Project Education Arizona State University, W. P. Carey School of Business MBA,  MBA 1999  – 2001 Purdue University BSMET,  Mechanical Engineering Technology 1990  – 1995 Activities and Societies:  Alpha Sigma Phi Arizona State University, W. P. Carey School of Business MBA,  MBA 1999  – 2001 Arizona State University, W. P. Carey School of Business MBA,  MBA 1999  – 2001 Arizona State University, W. P. Carey School of Business MBA,  MBA 1999  – 2001 Purdue University BSMET,  Mechanical Engineering Technology 1990  – 1995 Activities and Societies:  Alpha Sigma Phi Purdue University BSMET,  Mechanical Engineering Technology 1990  – 1995 Activities and Societies:  Alpha Sigma Phi Purdue University BSMET,  Mechanical Engineering Technology 1990  – 1995 Activities and Societies:  Alpha Sigma Phi ", "Experience Construction Manager Intel Corporation May 1998  – Present (17 years 4 months) Construction Manager Intel Corporation May 1998  – Present (17 years 4 months) Construction Manager Intel Corporation May 1998  – Present (17 years 4 months) Skills Construction Management Project Planning Contract Management Construction Contract Negotiation Value Engineering Project Estimation Procurement Engineering Process Scheduler Cross-functional Team... Skills  Construction Management Project Planning Contract Management Construction Contract Negotiation Value Engineering Project Estimation Procurement Engineering Process Scheduler Cross-functional Team... Construction Management Project Planning Contract Management Construction Contract Negotiation Value Engineering Project Estimation Procurement Engineering Process Scheduler Cross-functional Team... Construction Management Project Planning Contract Management Construction Contract Negotiation Value Engineering Project Estimation Procurement Engineering Process Scheduler Cross-functional Team... Education Brigham Young University Bachelor of Science (B.S.),  Construction Management 1995  – 1998 Minor in Business Management Brigham Young University Bachelor of Science (B.S.),  Construction Management 1995  – 1998 Minor in Business Management Brigham Young University Bachelor of Science (B.S.),  Construction Management 1995  – 1998 Minor in Business Management Brigham Young University Bachelor of Science (B.S.),  Construction Management 1995  – 1998 Minor in Business Management ", "Experience PRC Construction Manager Intel Corporation May 2011  – Present (4 years 4 months) Chengdu, Sichuan, China Manage construction business in China including construction for Assembly/Test factories in Chengdu and other general purpose construction in non-manufacturing sites like Shanghai, Beijing and Shenzhen.  \nResponsibilities including managing internal construction enterprise team (~20 employees) and external contractors to deliver positioning, programming/design and construction for all China AT & Non-manufacturing construction projects to enable Intel’s business; leading Supplier Strategy Team to develop & implement supplier strategy for Asia construction biz and establish/manage strategic suppliers; Being the Cost Champion of Asia region to drive construction project cost down through innovation or process improvement; Controls owner for Asia region to manage construction projects’ risks and controls compliance including customs compliance for import/export, etc. \nExamples on accomplishments or projects \nŸ\tDrove 30% (~$15M) cost down for Asia region construction projects in 2013 through scope optimization/value engineering or creative solutions on major projects, supplier consolidation and establish regional contracts for major equipment/construction materials, etc. \nŸ\tLed the team to deliver facility upgrades to enable Intel new generation process technology transfer & product roadmap while achieving 60% reduction on total project costŸ\tLed the team to reduce tool installation & qualification project TPT (through put time) over 50% to pull in schedule for critical product ramp \nŸ\tSet up duty free item tracking process when import/export for free trade zone operation to ensure customs regulation compliance which can avoid significant amount of potential tax penalty \nEstablished an efficient regional model to manage construction safety while achieved world class safety performance and no interrupt to production/service caused by construction \nŸ\tDeliver Beijing office consolidation with ~20% cost saving while received great customer satisfaction Site Manager of Construction Intel March 2009  –  May 2011  (2 years 3 months) Chengdu, Sichuan, China Responsible for construction business both for Chipset factory/CPU factory and other general purpose construction in Chengdu site. Fulfill the responsibilities through all phases of project cycle like feasibility study/positioning, programming and construction (design, bidding, constructing) of projects. Managing external general contractors and internal construction enterprise team to execute the construction scope, per Intel specification, within budget and on schedule while meeting safety goal to enable factories/site business. The construction projects in scope include Basebuild/Progressive Build for semiconductor assemble/test factories, office building, integrated warehouse, central utility building and other supporting facilities; tool installation, retrofit/conversion for production line; interior construction & fit-up for general purpose buildings, etc \nProject examples are’ \n1.\tChipset Assembly/Test factory programming & design \n2.\tWhole project cycle management for Centralized Die Prep Basebuild project \n3.\tTool Install and production line retrofit \n4.\tFactory consolidation \n5.\tChengdu canteen expansion, soccer field/tennis field and outdoor recreation center project \n6.\tShenzhen office relocation \n7.\tShanghai Zizhu office/labs fit-up and relocation \n8.\tChengdu data Center project \n9.\tChengdu multipurpose building project, etc Install & Qual Manager Intel August 2007  –  February 2009  (1 year 7 months) Responsible for the CD site Assembly Test factories’ facility upgrade, Equipment installation & qualification program both for Chipset factory and CPU factory, managing external general contractor and internal project team to execute the facility upgrade, tool install & fitup construction scope, per Intel specification and within budget and on schedule and leading internal engineer resource to execute machine qualification per Intel spec and on schedule. Layout IE and Module IE GL Intel June 2004  –  July 2007  (3 years 2 months) Execution to objectives by managing Space & Area Industrial Engineering team (8 employees) to fulfill factory layout designs; strategic space analyses for space optimization to support roadmap; factory max equipped capacity analysis; partner with construction team for construction project programming, equipment movement, installation, and facility readiness; calculation and validation of area capacity to prioritize productivity improvement; use data mining tools to track actual equipment performance; apply statistics to validate equipment performance against MOR; partner with module engineering, product engineering, and manufacturing to drive/implement improvement of MOR (headcount manning ratio, equipment run-rate).  \nLeading factory Facility Readiness Team to secure equipment delivery, space & facility readiness and capacity readiness and Productivity Task Force to drive factory productivity improvement continuously Project Engineer Design Institute of Kunming Shipbuilding Equipment Co. Ltd. (Group) July 1999  –  November 2002  (3 years 5 months) Kunming/Shenzhen Space planning & layout design for tobacco industry factories; Overall design coordination for architecture, civil, M&E, production process flow, etc. Factory capacity planning & facility capacity modeling; Production & logistics operations design & optimization;  \nProgramming for industrial systems, including auxiliary facilities systems such as PCW, steam, oil free compressed air, vacuum, exhaust etc. Providing technical consultation for customers; Technical coordination between customers, equipment manufacturers and general contractor during project life cycle, etc. PRC Construction Manager Intel Corporation May 2011  – Present (4 years 4 months) Chengdu, Sichuan, China Manage construction business in China including construction for Assembly/Test factories in Chengdu and other general purpose construction in non-manufacturing sites like Shanghai, Beijing and Shenzhen.  \nResponsibilities including managing internal construction enterprise team (~20 employees) and external contractors to deliver positioning, programming/design and construction for all China AT & Non-manufacturing construction projects to enable Intel’s business; leading Supplier Strategy Team to develop & implement supplier strategy for Asia construction biz and establish/manage strategic suppliers; Being the Cost Champion of Asia region to drive construction project cost down through innovation or process improvement; Controls owner for Asia region to manage construction projects’ risks and controls compliance including customs compliance for import/export, etc. \nExamples on accomplishments or projects \nŸ\tDrove 30% (~$15M) cost down for Asia region construction projects in 2013 through scope optimization/value engineering or creative solutions on major projects, supplier consolidation and establish regional contracts for major equipment/construction materials, etc. \nŸ\tLed the team to deliver facility upgrades to enable Intel new generation process technology transfer & product roadmap while achieving 60% reduction on total project costŸ\tLed the team to reduce tool installation & qualification project TPT (through put time) over 50% to pull in schedule for critical product ramp \nŸ\tSet up duty free item tracking process when import/export for free trade zone operation to ensure customs regulation compliance which can avoid significant amount of potential tax penalty \nEstablished an efficient regional model to manage construction safety while achieved world class safety performance and no interrupt to production/service caused by construction \nŸ\tDeliver Beijing office consolidation with ~20% cost saving while received great customer satisfaction PRC Construction Manager Intel Corporation May 2011  – Present (4 years 4 months) Chengdu, Sichuan, China Manage construction business in China including construction for Assembly/Test factories in Chengdu and other general purpose construction in non-manufacturing sites like Shanghai, Beijing and Shenzhen.  \nResponsibilities including managing internal construction enterprise team (~20 employees) and external contractors to deliver positioning, programming/design and construction for all China AT & Non-manufacturing construction projects to enable Intel’s business; leading Supplier Strategy Team to develop & implement supplier strategy for Asia construction biz and establish/manage strategic suppliers; Being the Cost Champion of Asia region to drive construction project cost down through innovation or process improvement; Controls owner for Asia region to manage construction projects’ risks and controls compliance including customs compliance for import/export, etc. \nExamples on accomplishments or projects \nŸ\tDrove 30% (~$15M) cost down for Asia region construction projects in 2013 through scope optimization/value engineering or creative solutions on major projects, supplier consolidation and establish regional contracts for major equipment/construction materials, etc. \nŸ\tLed the team to deliver facility upgrades to enable Intel new generation process technology transfer & product roadmap while achieving 60% reduction on total project costŸ\tLed the team to reduce tool installation & qualification project TPT (through put time) over 50% to pull in schedule for critical product ramp \nŸ\tSet up duty free item tracking process when import/export for free trade zone operation to ensure customs regulation compliance which can avoid significant amount of potential tax penalty \nEstablished an efficient regional model to manage construction safety while achieved world class safety performance and no interrupt to production/service caused by construction \nŸ\tDeliver Beijing office consolidation with ~20% cost saving while received great customer satisfaction Site Manager of Construction Intel March 2009  –  May 2011  (2 years 3 months) Chengdu, Sichuan, China Responsible for construction business both for Chipset factory/CPU factory and other general purpose construction in Chengdu site. Fulfill the responsibilities through all phases of project cycle like feasibility study/positioning, programming and construction (design, bidding, constructing) of projects. Managing external general contractors and internal construction enterprise team to execute the construction scope, per Intel specification, within budget and on schedule while meeting safety goal to enable factories/site business. The construction projects in scope include Basebuild/Progressive Build for semiconductor assemble/test factories, office building, integrated warehouse, central utility building and other supporting facilities; tool installation, retrofit/conversion for production line; interior construction & fit-up for general purpose buildings, etc \nProject examples are’ \n1.\tChipset Assembly/Test factory programming & design \n2.\tWhole project cycle management for Centralized Die Prep Basebuild project \n3.\tTool Install and production line retrofit \n4.\tFactory consolidation \n5.\tChengdu canteen expansion, soccer field/tennis field and outdoor recreation center project \n6.\tShenzhen office relocation \n7.\tShanghai Zizhu office/labs fit-up and relocation \n8.\tChengdu data Center project \n9.\tChengdu multipurpose building project, etc Site Manager of Construction Intel March 2009  –  May 2011  (2 years 3 months) Chengdu, Sichuan, China Responsible for construction business both for Chipset factory/CPU factory and other general purpose construction in Chengdu site. Fulfill the responsibilities through all phases of project cycle like feasibility study/positioning, programming and construction (design, bidding, constructing) of projects. Managing external general contractors and internal construction enterprise team to execute the construction scope, per Intel specification, within budget and on schedule while meeting safety goal to enable factories/site business. The construction projects in scope include Basebuild/Progressive Build for semiconductor assemble/test factories, office building, integrated warehouse, central utility building and other supporting facilities; tool installation, retrofit/conversion for production line; interior construction & fit-up for general purpose buildings, etc \nProject examples are’ \n1.\tChipset Assembly/Test factory programming & design \n2.\tWhole project cycle management for Centralized Die Prep Basebuild project \n3.\tTool Install and production line retrofit \n4.\tFactory consolidation \n5.\tChengdu canteen expansion, soccer field/tennis field and outdoor recreation center project \n6.\tShenzhen office relocation \n7.\tShanghai Zizhu office/labs fit-up and relocation \n8.\tChengdu data Center project \n9.\tChengdu multipurpose building project, etc Install & Qual Manager Intel August 2007  –  February 2009  (1 year 7 months) Responsible for the CD site Assembly Test factories’ facility upgrade, Equipment installation & qualification program both for Chipset factory and CPU factory, managing external general contractor and internal project team to execute the facility upgrade, tool install & fitup construction scope, per Intel specification and within budget and on schedule and leading internal engineer resource to execute machine qualification per Intel spec and on schedule. Install & Qual Manager Intel August 2007  –  February 2009  (1 year 7 months) Responsible for the CD site Assembly Test factories’ facility upgrade, Equipment installation & qualification program both for Chipset factory and CPU factory, managing external general contractor and internal project team to execute the facility upgrade, tool install & fitup construction scope, per Intel specification and within budget and on schedule and leading internal engineer resource to execute machine qualification per Intel spec and on schedule. Layout IE and Module IE GL Intel June 2004  –  July 2007  (3 years 2 months) Execution to objectives by managing Space & Area Industrial Engineering team (8 employees) to fulfill factory layout designs; strategic space analyses for space optimization to support roadmap; factory max equipped capacity analysis; partner with construction team for construction project programming, equipment movement, installation, and facility readiness; calculation and validation of area capacity to prioritize productivity improvement; use data mining tools to track actual equipment performance; apply statistics to validate equipment performance against MOR; partner with module engineering, product engineering, and manufacturing to drive/implement improvement of MOR (headcount manning ratio, equipment run-rate).  \nLeading factory Facility Readiness Team to secure equipment delivery, space & facility readiness and capacity readiness and Productivity Task Force to drive factory productivity improvement continuously Layout IE and Module IE GL Intel June 2004  –  July 2007  (3 years 2 months) Execution to objectives by managing Space & Area Industrial Engineering team (8 employees) to fulfill factory layout designs; strategic space analyses for space optimization to support roadmap; factory max equipped capacity analysis; partner with construction team for construction project programming, equipment movement, installation, and facility readiness; calculation and validation of area capacity to prioritize productivity improvement; use data mining tools to track actual equipment performance; apply statistics to validate equipment performance against MOR; partner with module engineering, product engineering, and manufacturing to drive/implement improvement of MOR (headcount manning ratio, equipment run-rate).  \nLeading factory Facility Readiness Team to secure equipment delivery, space & facility readiness and capacity readiness and Productivity Task Force to drive factory productivity improvement continuously Project Engineer Design Institute of Kunming Shipbuilding Equipment Co. Ltd. (Group) July 1999  –  November 2002  (3 years 5 months) Kunming/Shenzhen Space planning & layout design for tobacco industry factories; Overall design coordination for architecture, civil, M&E, production process flow, etc. Factory capacity planning & facility capacity modeling; Production & logistics operations design & optimization;  \nProgramming for industrial systems, including auxiliary facilities systems such as PCW, steam, oil free compressed air, vacuum, exhaust etc. Providing technical consultation for customers; Technical coordination between customers, equipment manufacturers and general contractor during project life cycle, etc. Project Engineer Design Institute of Kunming Shipbuilding Equipment Co. Ltd. (Group) July 1999  –  November 2002  (3 years 5 months) Kunming/Shenzhen Space planning & layout design for tobacco industry factories; Overall design coordination for architecture, civil, M&E, production process flow, etc. Factory capacity planning & facility capacity modeling; Production & logistics operations design & optimization;  \nProgramming for industrial systems, including auxiliary facilities systems such as PCW, steam, oil free compressed air, vacuum, exhaust etc. Providing technical consultation for customers; Technical coordination between customers, equipment manufacturers and general contractor during project life cycle, etc. Skills Semiconductors Microprocessors Project Management People Development Risk Management Procurement Facility Start-up Industrial Engineering Construction Facility Master Planning Cost Control Project Estimation Programme Delivery Supplier Performance Plant Layout IC Failure Analysis See 2+     See less Skills  Semiconductors Microprocessors Project Management People Development Risk Management Procurement Facility Start-up Industrial Engineering Construction Facility Master Planning Cost Control Project Estimation Programme Delivery Supplier Performance Plant Layout IC Failure Analysis See 2+     See less Semiconductors Microprocessors Project Management People Development Risk Management Procurement Facility Start-up Industrial Engineering Construction Facility Master Planning Cost Control Project Estimation Programme Delivery Supplier Performance Plant Layout IC Failure Analysis See 2+     See less Semiconductors Microprocessors Project Management People Development Risk Management Procurement Facility Start-up Industrial Engineering Construction Facility Master Planning Cost Control Project Estimation Programme Delivery Supplier Performance Plant Layout IC Failure Analysis See 2+     See less Education Arizona State University Project Management Development Program Certification,  Project Management 2009  – 2010 Joint project management development program by ASU and Intel Shanghai Jiao Tong University Bachelor,  Mechanical Engineering 1995  – 1999 Arizona State University Project Management Development Program Certification,  Project Management 2009  – 2010 Joint project management development program by ASU and Intel Arizona State University Project Management Development Program Certification,  Project Management 2009  – 2010 Joint project management development program by ASU and Intel Arizona State University Project Management Development Program Certification,  Project Management 2009  – 2010 Joint project management development program by ASU and Intel Shanghai Jiao Tong University Bachelor,  Mechanical Engineering 1995  – 1999 Shanghai Jiao Tong University Bachelor,  Mechanical Engineering 1995  – 1999 Shanghai Jiao Tong University Bachelor,  Mechanical Engineering 1995  – 1999 ", "Skills Geotechnical Engineering Contract Management Construction Management Construction Project Estimation Civil Engineering Road Primavera P6 Concrete Project Control Pavement Engineering Highways Project Management Value Engineering MS Project Project Coordination Engineering See 2+     See less Skills  Geotechnical Engineering Contract Management Construction Management Construction Project Estimation Civil Engineering Road Primavera P6 Concrete Project Control Pavement Engineering Highways Project Management Value Engineering MS Project Project Coordination Engineering See 2+     See less Geotechnical Engineering Contract Management Construction Management Construction Project Estimation Civil Engineering Road Primavera P6 Concrete Project Control Pavement Engineering Highways Project Management Value Engineering MS Project Project Coordination Engineering See 2+     See less Geotechnical Engineering Contract Management Construction Management Construction Project Estimation Civil Engineering Road Primavera P6 Concrete Project Control Pavement Engineering Highways Project Management Value Engineering MS Project Project Coordination Engineering See 2+     See less ", "Skills Program Management People Manager Asbestos PMP Management Process Engineering Engineering Management Manufacturing Semiconductors Process Improvement Engineering Procurement Project Management Lean Manufacturing Electricians Electronics Wireless Vendor Management Contract Negotiation Construction Data Center Energy MS Project Leadership SPC Electrical Engineering Root Cause Analysis Budgets Logistics Process Simulation Integration Troubleshooting Quality Assurance Contract Management Six Sigma Inspection Operations Management Product Management Project Planning Quality Management Cross-functional Team... Facilities Management Supply Chain Management Team Leadership Continuous Improvement Testing Team Building Product Development Strategic Planning Materials See 35+     See less Skills  Program Management People Manager Asbestos PMP Management Process Engineering Engineering Management Manufacturing Semiconductors Process Improvement Engineering Procurement Project Management Lean Manufacturing Electricians Electronics Wireless Vendor Management Contract Negotiation Construction Data Center Energy MS Project Leadership SPC Electrical Engineering Root Cause Analysis Budgets Logistics Process Simulation Integration Troubleshooting Quality Assurance Contract Management Six Sigma Inspection Operations Management Product Management Project Planning Quality Management Cross-functional Team... Facilities Management Supply Chain Management Team Leadership Continuous Improvement Testing Team Building Product Development Strategic Planning Materials See 35+     See less Program Management People Manager Asbestos PMP Management Process Engineering Engineering Management Manufacturing Semiconductors Process Improvement Engineering Procurement Project Management Lean Manufacturing Electricians Electronics Wireless Vendor Management Contract Negotiation Construction Data Center Energy MS Project Leadership SPC Electrical Engineering Root Cause Analysis Budgets Logistics Process Simulation Integration Troubleshooting Quality Assurance Contract Management Six Sigma Inspection Operations Management Product Management Project Planning Quality Management Cross-functional Team... Facilities Management Supply Chain Management Team Leadership Continuous Improvement Testing Team Building Product Development Strategic Planning Materials See 35+     See less Program Management People Manager Asbestos PMP Management Process Engineering Engineering Management Manufacturing Semiconductors Process Improvement Engineering Procurement Project Management Lean Manufacturing Electricians Electronics Wireless Vendor Management Contract Negotiation Construction Data Center Energy MS Project Leadership SPC Electrical Engineering Root Cause Analysis Budgets Logistics Process Simulation Integration Troubleshooting Quality Assurance Contract Management Six Sigma Inspection Operations Management Product Management Project Planning Quality Management Cross-functional Team... Facilities Management Supply Chain Management Team Leadership Continuous Improvement Testing Team Building Product Development Strategic Planning Materials See 35+     See less ", "Experience Construction Manager Intel Corporation June 2013  – Present (2 years 3 months) Portland, Oregon Area Construction Manager Intel Corporation June 2013  – Present (2 years 3 months) Portland, Oregon Area Construction Manager Intel Corporation June 2013  – Present (2 years 3 months) Portland, Oregon Area Skills Skills     ", "Experience Real Estate and Fit-up construction Manager Intel Corporation February 2004  – Present (11 years 7 months) Bangalore Managing South East ASIA and EMEA (Europe, Middle East and Africa) Project Manager Intel Technology India Pvt Ltd February 2004  – Present (11 years 7 months) Real Estate; Manage Portfolio of 1.2Msft in 13 countries \nEnsure compliance of Intel’s Real Estate portfolio, manage Real Estate vendors, landlord relations, fit-up construction vendors and approve rental release, etc.  \nProvide Real Estate content expertise in support of local BU RE needs in order to deliver the Best Value Real Estate Solution for Intel.  \nNegotiated to retain current rent in Spain irrespective of market increase by 20%. \nRenegotiated below market rent in Egypt and Mumbai; coordinate with planner on strategy for consolidation of owned and acquired company. \nReduced rent by ~40% in most of the leased locations in India \nNegotiated termination of space without penalty for 3 leases of ~60ksf in India  \nAs a part of M&A, worked on acquisition of Infineon in India with zero issues as a part of Day 1 activity; renegotiated with multiple LL’s to reduce their rent by ~10%, waiver of reinstatement obligation without penalty. \nPartnered to fit-up 217ksf in Bangalore  \nLed fit-up for one of the acquired Company in Noida (50 seater office) and 12.5ksft in Pune for Intel \nCurrently fitting up ~180ksf in Bangalore. \nDevelop RE global Indicators on a quarterly basis Real Estate and Fit-up construction Manager Intel Corporation February 2004  – Present (11 years 7 months) Bangalore Managing South East ASIA and EMEA (Europe, Middle East and Africa) Real Estate and Fit-up construction Manager Intel Corporation February 2004  – Present (11 years 7 months) Bangalore Managing South East ASIA and EMEA (Europe, Middle East and Africa) Project Manager Intel Technology India Pvt Ltd February 2004  – Present (11 years 7 months) Real Estate; Manage Portfolio of 1.2Msft in 13 countries \nEnsure compliance of Intel’s Real Estate portfolio, manage Real Estate vendors, landlord relations, fit-up construction vendors and approve rental release, etc.  \nProvide Real Estate content expertise in support of local BU RE needs in order to deliver the Best Value Real Estate Solution for Intel.  \nNegotiated to retain current rent in Spain irrespective of market increase by 20%. \nRenegotiated below market rent in Egypt and Mumbai; coordinate with planner on strategy for consolidation of owned and acquired company. \nReduced rent by ~40% in most of the leased locations in India \nNegotiated termination of space without penalty for 3 leases of ~60ksf in India  \nAs a part of M&A, worked on acquisition of Infineon in India with zero issues as a part of Day 1 activity; renegotiated with multiple LL’s to reduce their rent by ~10%, waiver of reinstatement obligation without penalty. \nPartnered to fit-up 217ksf in Bangalore  \nLed fit-up for one of the acquired Company in Noida (50 seater office) and 12.5ksft in Pune for Intel \nCurrently fitting up ~180ksf in Bangalore. \nDevelop RE global Indicators on a quarterly basis Project Manager Intel Technology India Pvt Ltd February 2004  – Present (11 years 7 months) Real Estate; Manage Portfolio of 1.2Msft in 13 countries \nEnsure compliance of Intel’s Real Estate portfolio, manage Real Estate vendors, landlord relations, fit-up construction vendors and approve rental release, etc.  \nProvide Real Estate content expertise in support of local BU RE needs in order to deliver the Best Value Real Estate Solution for Intel.  \nNegotiated to retain current rent in Spain irrespective of market increase by 20%. \nRenegotiated below market rent in Egypt and Mumbai; coordinate with planner on strategy for consolidation of owned and acquired company. \nReduced rent by ~40% in most of the leased locations in India \nNegotiated termination of space without penalty for 3 leases of ~60ksf in India  \nAs a part of M&A, worked on acquisition of Infineon in India with zero issues as a part of Day 1 activity; renegotiated with multiple LL’s to reduce their rent by ~10%, waiver of reinstatement obligation without penalty. \nPartnered to fit-up 217ksf in Bangalore  \nLed fit-up for one of the acquired Company in Noida (50 seater office) and 12.5ksft in Pune for Intel \nCurrently fitting up ~180ksf in Bangalore. \nDevelop RE global Indicators on a quarterly basis Languages English Full professional proficiency Hindi Full professional proficiency Kannada Full professional proficiency Tamil Full professional proficiency Telegu Professional working proficiency English Full professional proficiency Hindi Full professional proficiency Kannada Full professional proficiency Tamil Full professional proficiency Telegu Professional working proficiency English Full professional proficiency Hindi Full professional proficiency Kannada Full professional proficiency Tamil Full professional proficiency Telegu Professional working proficiency Full professional proficiency Full professional proficiency Full professional proficiency Full professional proficiency Professional working proficiency Skills Budgets Strategic Planning Cross-functional Team... Project Management Microsoft Excel Windows Microsoft Office Process Improvement Negotiation Project Planning Financial Analysis Program Management Team Management Software Project... Finance Strategy Management See 2+     See less Skills  Budgets Strategic Planning Cross-functional Team... Project Management Microsoft Excel Windows Microsoft Office Process Improvement Negotiation Project Planning Financial Analysis Program Management Team Management Software Project... Finance Strategy Management See 2+     See less Budgets Strategic Planning Cross-functional Team... Project Management Microsoft Excel Windows Microsoft Office Process Improvement Negotiation Project Planning Financial Analysis Program Management Team Management Software Project... Finance Strategy Management See 2+     See less Budgets Strategic Planning Cross-functional Team... Project Management Microsoft Excel Windows Microsoft Office Process Improvement Negotiation Project Planning Financial Analysis Program Management Team Management Software Project... Finance Strategy Management See 2+     See less Education Vinakaya Mission University Master of Business Administration,  Finance 2008  – 2009 Vinayaka Mission's Research Foundation - University MBA,  Finance 2008  – 2009 Bangalore University B. Com,  commerce 1996  – 1998 Bangalore University Bachelor,  Commerce 1998 Vinakaya Mission University Master of Business Administration,  Finance 2008  – 2009 Vinakaya Mission University Master of Business Administration,  Finance 2008  – 2009 Vinakaya Mission University Master of Business Administration,  Finance 2008  – 2009 Vinayaka Mission's Research Foundation - University MBA,  Finance 2008  – 2009 Vinayaka Mission's Research Foundation - University MBA,  Finance 2008  – 2009 Vinayaka Mission's Research Foundation - University MBA,  Finance 2008  – 2009 Bangalore University B. Com,  commerce 1996  – 1998 Bangalore University B. Com,  commerce 1996  – 1998 Bangalore University B. Com,  commerce 1996  – 1998 Bangalore University Bachelor,  Commerce 1998 Bangalore University Bachelor,  Commerce 1998 Bangalore University Bachelor,  Commerce 1998 Honors & Awards ", "Experience Construction Manager Intel Corporation Construction Manager Intel Corporation Construction Manager Intel Corporation Skills Contract Management Program Management Contract Negotiation Construction Management Construction Project Planning Procurement Project Management Semiconductors Engineering Management Value Engineering MS Project Cost Management Project Estimation Cross-functional Team... Engineering See 1+     See less Skills  Contract Management Program Management Contract Negotiation Construction Management Construction Project Planning Procurement Project Management Semiconductors Engineering Management Value Engineering MS Project Cost Management Project Estimation Cross-functional Team... Engineering See 1+     See less Contract Management Program Management Contract Negotiation Construction Management Construction Project Planning Procurement Project Management Semiconductors Engineering Management Value Engineering MS Project Cost Management Project Estimation Cross-functional Team... Engineering See 1+     See less Contract Management Program Management Contract Negotiation Construction Management Construction Project Planning Procurement Project Management Semiconductors Engineering Management Value Engineering MS Project Cost Management Project Estimation Cross-functional Team... Engineering See 1+     See less ", "Summary Yogi Cho (aka Simon Skinner) lives in Co Cork, Ireland. He started his Martial Arts practice in Glasgow in 1978 and won his Judo Black Belt in Nagasaki in 1989. Since then on his many travels he has accumulated a wealth of Yogic, Buddhist, Tantric, Taoist and worldly wisdom and ways from ancient sages and saints as well as contemporary masters. He has over 35 years training and practice in Martial Arts and Yoga as well as having received intensive instruction in Advanced Tai Chi, Chi Kung, Chi Yoga, Ling Chi Healing Art and Meditation from Master Jason Chan creator of The Infinite Arts. Simon graduated from The University of Strathclyde, Glasgow in 1982 with an Honours degree in Chemical Engineering. He became a Corporate Member of the Institute of Chemical Engineers (CEng MIChemE) in 1989. Since 1991 he has worked in Ireland as a Project, Process and Process Safety and Environmental Engineer for multi-national clients on small, medium and large scale projects. He has been responsible for the Safety, Design, Scope, Schedule, Budget, Installation, Construction Management, Good Manufacturing Practice, Validation and Commissioning of Process, Environmental and Safety Projects in the Oil, Pharmaceutical, Information Technology, Food and Health Care Industries.  \n \nSpecialties: Tai Chi, Chi Kung, Yoga, Meditation, Teacher and Ling Chi Healing Art practitioner. \nAuthor and Video Producer. Project, Process, Safety and Environmental Engineering.  \nRegistered with the Teaching Council of Ireland. \n Summary Yogi Cho (aka Simon Skinner) lives in Co Cork, Ireland. He started his Martial Arts practice in Glasgow in 1978 and won his Judo Black Belt in Nagasaki in 1989. Since then on his many travels he has accumulated a wealth of Yogic, Buddhist, Tantric, Taoist and worldly wisdom and ways from ancient sages and saints as well as contemporary masters. He has over 35 years training and practice in Martial Arts and Yoga as well as having received intensive instruction in Advanced Tai Chi, Chi Kung, Chi Yoga, Ling Chi Healing Art and Meditation from Master Jason Chan creator of The Infinite Arts. Simon graduated from The University of Strathclyde, Glasgow in 1982 with an Honours degree in Chemical Engineering. He became a Corporate Member of the Institute of Chemical Engineers (CEng MIChemE) in 1989. Since 1991 he has worked in Ireland as a Project, Process and Process Safety and Environmental Engineer for multi-national clients on small, medium and large scale projects. He has been responsible for the Safety, Design, Scope, Schedule, Budget, Installation, Construction Management, Good Manufacturing Practice, Validation and Commissioning of Process, Environmental and Safety Projects in the Oil, Pharmaceutical, Information Technology, Food and Health Care Industries.  \n \nSpecialties: Tai Chi, Chi Kung, Yoga, Meditation, Teacher and Ling Chi Healing Art practitioner. \nAuthor and Video Producer. Project, Process, Safety and Environmental Engineering.  \nRegistered with the Teaching Council of Ireland. \n Yogi Cho (aka Simon Skinner) lives in Co Cork, Ireland. He started his Martial Arts practice in Glasgow in 1978 and won his Judo Black Belt in Nagasaki in 1989. Since then on his many travels he has accumulated a wealth of Yogic, Buddhist, Tantric, Taoist and worldly wisdom and ways from ancient sages and saints as well as contemporary masters. He has over 35 years training and practice in Martial Arts and Yoga as well as having received intensive instruction in Advanced Tai Chi, Chi Kung, Chi Yoga, Ling Chi Healing Art and Meditation from Master Jason Chan creator of The Infinite Arts. Simon graduated from The University of Strathclyde, Glasgow in 1982 with an Honours degree in Chemical Engineering. He became a Corporate Member of the Institute of Chemical Engineers (CEng MIChemE) in 1989. Since 1991 he has worked in Ireland as a Project, Process and Process Safety and Environmental Engineer for multi-national clients on small, medium and large scale projects. He has been responsible for the Safety, Design, Scope, Schedule, Budget, Installation, Construction Management, Good Manufacturing Practice, Validation and Commissioning of Process, Environmental and Safety Projects in the Oil, Pharmaceutical, Information Technology, Food and Health Care Industries.  \n \nSpecialties: Tai Chi, Chi Kung, Yoga, Meditation, Teacher and Ling Chi Healing Art practitioner. \nAuthor and Video Producer. Project, Process, Safety and Environmental Engineering.  \nRegistered with the Teaching Council of Ireland. \n Yogi Cho (aka Simon Skinner) lives in Co Cork, Ireland. He started his Martial Arts practice in Glasgow in 1978 and won his Judo Black Belt in Nagasaki in 1989. Since then on his many travels he has accumulated a wealth of Yogic, Buddhist, Tantric, Taoist and worldly wisdom and ways from ancient sages and saints as well as contemporary masters. He has over 35 years training and practice in Martial Arts and Yoga as well as having received intensive instruction in Advanced Tai Chi, Chi Kung, Chi Yoga, Ling Chi Healing Art and Meditation from Master Jason Chan creator of The Infinite Arts. Simon graduated from The University of Strathclyde, Glasgow in 1982 with an Honours degree in Chemical Engineering. He became a Corporate Member of the Institute of Chemical Engineers (CEng MIChemE) in 1989. Since 1991 he has worked in Ireland as a Project, Process and Process Safety and Environmental Engineer for multi-national clients on small, medium and large scale projects. He has been responsible for the Safety, Design, Scope, Schedule, Budget, Installation, Construction Management, Good Manufacturing Practice, Validation and Commissioning of Process, Environmental and Safety Projects in the Oil, Pharmaceutical, Information Technology, Food and Health Care Industries.  \n \nSpecialties: Tai Chi, Chi Kung, Yoga, Meditation, Teacher and Ling Chi Healing Art practitioner. \nAuthor and Video Producer. Project, Process, Safety and Environmental Engineering.  \nRegistered with the Teaching Council of Ireland. \n Experience Process Safety Consultant GSK March 2015  – Present (6 months) Currabinny Carrigaline Cork Co. Cork, Ireland Process Safety; General & Occupational Safety; Occupational Hygiene & Ergonomics; Environmental Protection & Sustainability. Director Chomolongma Ltd 1998  – Present (17 years) Ireland Tai Chi, Chi Kung, Yoga, Meditation, Teacher and Ling Chi Healing Art practitioner. Author and Video Producer. Safety, Design, Scope, Schedule, Budget, Installation, Construction Management, Good Manufacturing Practice, Validation and Commissioning of Process, Environmental and Safety Projects in the Oil, Pharmaceutical, Information Technology, Food and Health Care Industries.  Infinite Tai Chi, Chi Kung, Yoga, Meditation and YogiChild Course Train the Trainer Chomolongma Ltd September 2014  – Present (1 year) Uppsala, Sweden http://www.yogicho.com \n \nInfinite Tai Chi is a unique form of the ancient Chinese holistic art of tai chi, created to meet the specific needs of modern Westerners to enable us to raise our vitality and consciousness levels. Infinite Tai Chi can be taught at many different levels and to people of all ages, abilities and all levels of fitness. On his courses you will learn a range of warm up exercises , the Infinite Tai Chi Long Form (Stages 1-5), YogiChild Tai Chi Short form, numerous Chi Kung & Chi Yoga techniques including The Golden Sun, Butterfly Sweeping, the 18 Healing Sounds, 12 Directional Exercises, Spirals in the Air, Meridian Stretching and Standing Like A Tree Chi Kung and most importantly Meditation. \n \nThere are two Approaches to the courses. You can take the courses in order to qualify as an Infinite Tai Chi or YogiChild teacher or alternatively you can take the course solely for your own personal and spiritual development. After graduating from this course students will be qualified to teach Infinite Tai Chi and Chi Kung to the general public. This gives graduates a wonderful opportunity to pursue an alternative career. Graduates from the course teach in a wide range of settings including health centres, private companies, prisons, care homes, sheltered housing, yoga studios, schools and colleges. \n \nTai Chi activates the body’s natural ability to heal itself, releasing blocked energy, cleansing the body of toxins and strengthening the practitioner’s physical and energetic systems. Some of the numerous benefits from the ancient art of Tai Chi are: rejuvenation, longevity, natural health, inner strength, grace and beauty. \n \nhttp://www.yogicho.com Process Safety Consultant Stryker March 2014  –  March 2015  (1 year 1 month) Carrigtohill, Co Cork Environmental, Health & Safety Consultant Process Design Engineer Roche July 2013  –  March 2014  (9 months) Clarecastle Process engineering design function for capital projects. Senior Process Enginneer Project Management March 2013  –  June 2013  (4 months) Cork Senior Process Engineer: Utilities design for a small scale, multi product, high containment facility. Ultra Pure Water Construction Manager Intel Corporation August 2012  –  March 2013  (8 months) Refurbishment of an Ultra-pure Water (UPW) Plant. Responsible for managing the construction on site, maintaining schedule, safety, quality, identifying problems and facilitating solutions. Project Engineer Pfizer March 2011  –  August 2012  (1 year 6 months) Co Kildare Design, scope, schedule, budget, installation, construction management, GMP, validation and \ncommissioning of a tablet manufacturing process project. Process Safety Engineering Consultant Pilz Ireland October 2010  –  March 2011  (6 months) Explosion Protection Documentation, ATEX Risk Assessment, Hazardous Area Analysis, Quantitative Risk Assessment and HAZOP for the Food and Process Industries. Commissioning Engineer Intel Corporation August 2008  –  September 2009  (1 year 2 months) Refurbishment, commissioning and safe start up of a dormant Ultra-pure Water (UPW) Plant. Lead Process/Project/Automation Engineer UCB Pharma April 2006  –  June 2008  (2 years 3 months) Site Development Projects Team Project Engineer ConocoPhillips August 2005  –  March 2006  (8 months) Project Engineer Pfizer April 2003  –  July 2005  (2 years 4 months) Site Process Safety Engineer Eli Lilly and Company August 2002  –  April 2003  (9 months) Project Engineer Eli Lilly and Company January 1999  –  June 2002  (3 years 6 months) Senior Process Engineer Jacobs Engineering September 1995  –  February 1997  (1 year 6 months) Project Engineer Project Management August 1991  –  May 1995  (3 years 10 months) Process Engineering on site and in the Dublin & Cork Offices. Senior Process Engineer élan corporation PLC May 1992  –  June 1994  (2 years 2 months) Project Engineer BHRA, The Fluid Engineering Centre, October 1987  –  October 1989  (2 years 1 month) Process Engineer Beecham Pharmaceuticals October 1983  –  July 1987  (3 years 10 months) Management Trainee Scottish and Newcastle Breweries Ltd, Edinburgh August 1982  –  August 1983  (1 year 1 month) Process Safety Consultant GSK March 2015  – Present (6 months) Currabinny Carrigaline Cork Co. Cork, Ireland Process Safety; General & Occupational Safety; Occupational Hygiene & Ergonomics; Environmental Protection & Sustainability. Process Safety Consultant GSK March 2015  – Present (6 months) Currabinny Carrigaline Cork Co. Cork, Ireland Process Safety; General & Occupational Safety; Occupational Hygiene & Ergonomics; Environmental Protection & Sustainability. Director Chomolongma Ltd 1998  – Present (17 years) Ireland Tai Chi, Chi Kung, Yoga, Meditation, Teacher and Ling Chi Healing Art practitioner. Author and Video Producer. Safety, Design, Scope, Schedule, Budget, Installation, Construction Management, Good Manufacturing Practice, Validation and Commissioning of Process, Environmental and Safety Projects in the Oil, Pharmaceutical, Information Technology, Food and Health Care Industries.  Director Chomolongma Ltd 1998  – Present (17 years) Ireland Tai Chi, Chi Kung, Yoga, Meditation, Teacher and Ling Chi Healing Art practitioner. Author and Video Producer. Safety, Design, Scope, Schedule, Budget, Installation, Construction Management, Good Manufacturing Practice, Validation and Commissioning of Process, Environmental and Safety Projects in the Oil, Pharmaceutical, Information Technology, Food and Health Care Industries.  Infinite Tai Chi, Chi Kung, Yoga, Meditation and YogiChild Course Train the Trainer Chomolongma Ltd September 2014  – Present (1 year) Uppsala, Sweden http://www.yogicho.com \n \nInfinite Tai Chi is a unique form of the ancient Chinese holistic art of tai chi, created to meet the specific needs of modern Westerners to enable us to raise our vitality and consciousness levels. Infinite Tai Chi can be taught at many different levels and to people of all ages, abilities and all levels of fitness. On his courses you will learn a range of warm up exercises , the Infinite Tai Chi Long Form (Stages 1-5), YogiChild Tai Chi Short form, numerous Chi Kung & Chi Yoga techniques including The Golden Sun, Butterfly Sweeping, the 18 Healing Sounds, 12 Directional Exercises, Spirals in the Air, Meridian Stretching and Standing Like A Tree Chi Kung and most importantly Meditation. \n \nThere are two Approaches to the courses. You can take the courses in order to qualify as an Infinite Tai Chi or YogiChild teacher or alternatively you can take the course solely for your own personal and spiritual development. After graduating from this course students will be qualified to teach Infinite Tai Chi and Chi Kung to the general public. This gives graduates a wonderful opportunity to pursue an alternative career. Graduates from the course teach in a wide range of settings including health centres, private companies, prisons, care homes, sheltered housing, yoga studios, schools and colleges. \n \nTai Chi activates the body’s natural ability to heal itself, releasing blocked energy, cleansing the body of toxins and strengthening the practitioner’s physical and energetic systems. Some of the numerous benefits from the ancient art of Tai Chi are: rejuvenation, longevity, natural health, inner strength, grace and beauty. \n \nhttp://www.yogicho.com Infinite Tai Chi, Chi Kung, Yoga, Meditation and YogiChild Course Train the Trainer Chomolongma Ltd September 2014  – Present (1 year) Uppsala, Sweden http://www.yogicho.com \n \nInfinite Tai Chi is a unique form of the ancient Chinese holistic art of tai chi, created to meet the specific needs of modern Westerners to enable us to raise our vitality and consciousness levels. Infinite Tai Chi can be taught at many different levels and to people of all ages, abilities and all levels of fitness. On his courses you will learn a range of warm up exercises , the Infinite Tai Chi Long Form (Stages 1-5), YogiChild Tai Chi Short form, numerous Chi Kung & Chi Yoga techniques including The Golden Sun, Butterfly Sweeping, the 18 Healing Sounds, 12 Directional Exercises, Spirals in the Air, Meridian Stretching and Standing Like A Tree Chi Kung and most importantly Meditation. \n \nThere are two Approaches to the courses. You can take the courses in order to qualify as an Infinite Tai Chi or YogiChild teacher or alternatively you can take the course solely for your own personal and spiritual development. After graduating from this course students will be qualified to teach Infinite Tai Chi and Chi Kung to the general public. This gives graduates a wonderful opportunity to pursue an alternative career. Graduates from the course teach in a wide range of settings including health centres, private companies, prisons, care homes, sheltered housing, yoga studios, schools and colleges. \n \nTai Chi activates the body’s natural ability to heal itself, releasing blocked energy, cleansing the body of toxins and strengthening the practitioner’s physical and energetic systems. Some of the numerous benefits from the ancient art of Tai Chi are: rejuvenation, longevity, natural health, inner strength, grace and beauty. \n \nhttp://www.yogicho.com Process Safety Consultant Stryker March 2014  –  March 2015  (1 year 1 month) Carrigtohill, Co Cork Environmental, Health & Safety Consultant Process Safety Consultant Stryker March 2014  –  March 2015  (1 year 1 month) Carrigtohill, Co Cork Environmental, Health & Safety Consultant Process Design Engineer Roche July 2013  –  March 2014  (9 months) Clarecastle Process engineering design function for capital projects. Process Design Engineer Roche July 2013  –  March 2014  (9 months) Clarecastle Process engineering design function for capital projects. Senior Process Enginneer Project Management March 2013  –  June 2013  (4 months) Cork Senior Process Engineer: Utilities design for a small scale, multi product, high containment facility. Senior Process Enginneer Project Management March 2013  –  June 2013  (4 months) Cork Senior Process Engineer: Utilities design for a small scale, multi product, high containment facility. Ultra Pure Water Construction Manager Intel Corporation August 2012  –  March 2013  (8 months) Refurbishment of an Ultra-pure Water (UPW) Plant. Responsible for managing the construction on site, maintaining schedule, safety, quality, identifying problems and facilitating solutions. Ultra Pure Water Construction Manager Intel Corporation August 2012  –  March 2013  (8 months) Refurbishment of an Ultra-pure Water (UPW) Plant. Responsible for managing the construction on site, maintaining schedule, safety, quality, identifying problems and facilitating solutions. Project Engineer Pfizer March 2011  –  August 2012  (1 year 6 months) Co Kildare Design, scope, schedule, budget, installation, construction management, GMP, validation and \ncommissioning of a tablet manufacturing process project. Project Engineer Pfizer March 2011  –  August 2012  (1 year 6 months) Co Kildare Design, scope, schedule, budget, installation, construction management, GMP, validation and \ncommissioning of a tablet manufacturing process project. Process Safety Engineering Consultant Pilz Ireland October 2010  –  March 2011  (6 months) Explosion Protection Documentation, ATEX Risk Assessment, Hazardous Area Analysis, Quantitative Risk Assessment and HAZOP for the Food and Process Industries. Process Safety Engineering Consultant Pilz Ireland October 2010  –  March 2011  (6 months) Explosion Protection Documentation, ATEX Risk Assessment, Hazardous Area Analysis, Quantitative Risk Assessment and HAZOP for the Food and Process Industries. Commissioning Engineer Intel Corporation August 2008  –  September 2009  (1 year 2 months) Refurbishment, commissioning and safe start up of a dormant Ultra-pure Water (UPW) Plant. Commissioning Engineer Intel Corporation August 2008  –  September 2009  (1 year 2 months) Refurbishment, commissioning and safe start up of a dormant Ultra-pure Water (UPW) Plant. Lead Process/Project/Automation Engineer UCB Pharma April 2006  –  June 2008  (2 years 3 months) Site Development Projects Team Lead Process/Project/Automation Engineer UCB Pharma April 2006  –  June 2008  (2 years 3 months) Site Development Projects Team Project Engineer ConocoPhillips August 2005  –  March 2006  (8 months) Project Engineer ConocoPhillips August 2005  –  March 2006  (8 months) Project Engineer Pfizer April 2003  –  July 2005  (2 years 4 months) Project Engineer Pfizer April 2003  –  July 2005  (2 years 4 months) Site Process Safety Engineer Eli Lilly and Company August 2002  –  April 2003  (9 months) Site Process Safety Engineer Eli Lilly and Company August 2002  –  April 2003  (9 months) Project Engineer Eli Lilly and Company January 1999  –  June 2002  (3 years 6 months) Project Engineer Eli Lilly and Company January 1999  –  June 2002  (3 years 6 months) Senior Process Engineer Jacobs Engineering September 1995  –  February 1997  (1 year 6 months) Senior Process Engineer Jacobs Engineering September 1995  –  February 1997  (1 year 6 months) Project Engineer Project Management August 1991  –  May 1995  (3 years 10 months) Process Engineering on site and in the Dublin & Cork Offices. Project Engineer Project Management August 1991  –  May 1995  (3 years 10 months) Process Engineering on site and in the Dublin & Cork Offices. Senior Process Engineer élan corporation PLC May 1992  –  June 1994  (2 years 2 months) Senior Process Engineer élan corporation PLC May 1992  –  June 1994  (2 years 2 months) Project Engineer BHRA, The Fluid Engineering Centre, October 1987  –  October 1989  (2 years 1 month) Project Engineer BHRA, The Fluid Engineering Centre, October 1987  –  October 1989  (2 years 1 month) Process Engineer Beecham Pharmaceuticals October 1983  –  July 1987  (3 years 10 months) Process Engineer Beecham Pharmaceuticals October 1983  –  July 1987  (3 years 10 months) Management Trainee Scottish and Newcastle Breweries Ltd, Edinburgh August 1982  –  August 1983  (1 year 1 month) Management Trainee Scottish and Newcastle Breweries Ltd, Edinburgh August 1982  –  August 1983  (1 year 1 month) Skills Commissioning Validation Process Engineering Engineering GMP Chemical Engineering Project Management HAZOP Management Software Documentation Skills  Commissioning Validation Process Engineering Engineering GMP Chemical Engineering Project Management HAZOP Management Software Documentation Commissioning Validation Process Engineering Engineering GMP Chemical Engineering Project Management HAZOP Management Software Documentation Commissioning Validation Process Engineering Engineering GMP Chemical Engineering Project Management HAZOP Management Software Documentation Education Strathclyde University Chemical & Process Engineering BSc Honours 1978  – 1982 Strathclyde University Chemical & Process Engineering BSc Honours 1978  – 1982 Strathclyde University Chemical & Process Engineering BSc Honours 1978  – 1982 Strathclyde University Chemical & Process Engineering BSc Honours 1978  – 1982 ", "Experience Construction Manager Intel Corporation November 2000  – Present (14 years 10 months) Process Technician Motorola February 1997  –  November 2000  (3 years 10 months) Construction Manager Intel Corporation November 2000  – Present (14 years 10 months) Construction Manager Intel Corporation November 2000  – Present (14 years 10 months) Process Technician Motorola February 1997  –  November 2000  (3 years 10 months) Process Technician Motorola February 1997  –  November 2000  (3 years 10 months) ", "Experience Manufacturing Engineering Manager, Silicon Photonics Data Center Group, Intel Corporation July 2013  – Present (2 years 2 months) Portland/Santa Clara/Asia Managing a team of materials program managers and development engineers to deliver sort, die prep, assembly and test capability for Intel’s silicon photonics transceivers. Driving the team to develop and introduce five new products in a three year span, ensuring HVM meets the affordability and quality targets. In this position has developed outsourced manufacturing procurement skills for both ODM and CM models, plus a strong understanding of how external companies provide affordable package and test solutions. Industrial Engineering Director Intel March 2009  –  July 2013  (4 years 5 months) Chengdu, China Managed an organization of fifty Industrial Engineering managers and engineers to deliver and improve efficiency of Intel Assembly/Test capital equipment. The team led the factory in equipment and labour productivity initiatives, driving world class affordability. In this assignment gained extensive overseas leadership experience. Developed the full range of engineers, from new hire to department manager. Ramped the site up to 6million units per week with western standards in safety and quality.Drove Intel best in class labor and machine productivity in a geo with low cost labor APAC Capital Projects and Construction Manager Intel Corporation September 2005  –  March 2009  (3 years 7 months) Asia Managed a team of project managers, fitting up Assembly/Test factories throughout Asia. This resulted in a 50% reduction of both global fit-up costs and execution durations by proliferating best practices to factories in Malaysia, Shanghai, Costa Rica and Philippines. In this assignment gained emergency business recovery experience, by leading an international team of structural experts to assess and repair the Chengdu facility after the 7.9 Richter scale Sichuan earthquake. In addition gained experience in factory closures, when we transferred capacity from closure plants in Shanghai and Philippines into the existing APAC network. Fab Conversion Lithography Program Manager Intel October 2002  –  September 2005  (3 years) Arizona Managed a team to convert a 200mm wafer fab to a 300mm fab. Demolition phase consisted of managing the removal of $300m worth of Lithography and Etch capital equipment, selling it to external customers or reusing it at other Intel facilities. The installation phase consisted of $750m worth of Lithography equipment, necessary to ramp Intel's first 300mm 65nm HVM factory. To prepare for the conversion also gained R&D experience developing specifications and procedures to enable a successful transfer of the technology from R&D to the high volume facilities. Lithography Engineering Group Leader Intel August 2000  –  October 2002  (2 years 3 months) Arizona Managed a team of engineering group leader, technologists and operations supervisors for the installation and qualification of $500m of Lithography capital equipment, ramping Arizona's second 200mm factory on 0.13um technology. Through creative scheduling and close partnership with our suppliers, the team held the project on schedule in spite of significant process and technology scope additions, throughout the project. Yield Engineer Intel January 1996  –  August 2000  (4 years 8 months) Arizona Responsible for the maintenance and performance of the factory fleet of defect metrology tools. This equipment was the only source of inline product quality control, monitoring the chips at various stages of the production cycle, categorizing product defect trends, ultimately to improve the line yield of the factory. Quality Control Engineer Seagate Technology September 1993  –  1996  (3 years) Established machine quality control processes in Seagates first R&D and operations facility. Manufacturing Engineering Manager, Silicon Photonics Data Center Group, Intel Corporation July 2013  – Present (2 years 2 months) Portland/Santa Clara/Asia Managing a team of materials program managers and development engineers to deliver sort, die prep, assembly and test capability for Intel’s silicon photonics transceivers. Driving the team to develop and introduce five new products in a three year span, ensuring HVM meets the affordability and quality targets. In this position has developed outsourced manufacturing procurement skills for both ODM and CM models, plus a strong understanding of how external companies provide affordable package and test solutions. Manufacturing Engineering Manager, Silicon Photonics Data Center Group, Intel Corporation July 2013  – Present (2 years 2 months) Portland/Santa Clara/Asia Managing a team of materials program managers and development engineers to deliver sort, die prep, assembly and test capability for Intel’s silicon photonics transceivers. Driving the team to develop and introduce five new products in a three year span, ensuring HVM meets the affordability and quality targets. In this position has developed outsourced manufacturing procurement skills for both ODM and CM models, plus a strong understanding of how external companies provide affordable package and test solutions. Industrial Engineering Director Intel March 2009  –  July 2013  (4 years 5 months) Chengdu, China Managed an organization of fifty Industrial Engineering managers and engineers to deliver and improve efficiency of Intel Assembly/Test capital equipment. The team led the factory in equipment and labour productivity initiatives, driving world class affordability. In this assignment gained extensive overseas leadership experience. Developed the full range of engineers, from new hire to department manager. Ramped the site up to 6million units per week with western standards in safety and quality.Drove Intel best in class labor and machine productivity in a geo with low cost labor Industrial Engineering Director Intel March 2009  –  July 2013  (4 years 5 months) Chengdu, China Managed an organization of fifty Industrial Engineering managers and engineers to deliver and improve efficiency of Intel Assembly/Test capital equipment. The team led the factory in equipment and labour productivity initiatives, driving world class affordability. In this assignment gained extensive overseas leadership experience. Developed the full range of engineers, from new hire to department manager. Ramped the site up to 6million units per week with western standards in safety and quality.Drove Intel best in class labor and machine productivity in a geo with low cost labor APAC Capital Projects and Construction Manager Intel Corporation September 2005  –  March 2009  (3 years 7 months) Asia Managed a team of project managers, fitting up Assembly/Test factories throughout Asia. This resulted in a 50% reduction of both global fit-up costs and execution durations by proliferating best practices to factories in Malaysia, Shanghai, Costa Rica and Philippines. In this assignment gained emergency business recovery experience, by leading an international team of structural experts to assess and repair the Chengdu facility after the 7.9 Richter scale Sichuan earthquake. In addition gained experience in factory closures, when we transferred capacity from closure plants in Shanghai and Philippines into the existing APAC network. APAC Capital Projects and Construction Manager Intel Corporation September 2005  –  March 2009  (3 years 7 months) Asia Managed a team of project managers, fitting up Assembly/Test factories throughout Asia. This resulted in a 50% reduction of both global fit-up costs and execution durations by proliferating best practices to factories in Malaysia, Shanghai, Costa Rica and Philippines. In this assignment gained emergency business recovery experience, by leading an international team of structural experts to assess and repair the Chengdu facility after the 7.9 Richter scale Sichuan earthquake. In addition gained experience in factory closures, when we transferred capacity from closure plants in Shanghai and Philippines into the existing APAC network. Fab Conversion Lithography Program Manager Intel October 2002  –  September 2005  (3 years) Arizona Managed a team to convert a 200mm wafer fab to a 300mm fab. Demolition phase consisted of managing the removal of $300m worth of Lithography and Etch capital equipment, selling it to external customers or reusing it at other Intel facilities. The installation phase consisted of $750m worth of Lithography equipment, necessary to ramp Intel's first 300mm 65nm HVM factory. To prepare for the conversion also gained R&D experience developing specifications and procedures to enable a successful transfer of the technology from R&D to the high volume facilities. Fab Conversion Lithography Program Manager Intel October 2002  –  September 2005  (3 years) Arizona Managed a team to convert a 200mm wafer fab to a 300mm fab. Demolition phase consisted of managing the removal of $300m worth of Lithography and Etch capital equipment, selling it to external customers or reusing it at other Intel facilities. The installation phase consisted of $750m worth of Lithography equipment, necessary to ramp Intel's first 300mm 65nm HVM factory. To prepare for the conversion also gained R&D experience developing specifications and procedures to enable a successful transfer of the technology from R&D to the high volume facilities. Lithography Engineering Group Leader Intel August 2000  –  October 2002  (2 years 3 months) Arizona Managed a team of engineering group leader, technologists and operations supervisors for the installation and qualification of $500m of Lithography capital equipment, ramping Arizona's second 200mm factory on 0.13um technology. Through creative scheduling and close partnership with our suppliers, the team held the project on schedule in spite of significant process and technology scope additions, throughout the project. Lithography Engineering Group Leader Intel August 2000  –  October 2002  (2 years 3 months) Arizona Managed a team of engineering group leader, technologists and operations supervisors for the installation and qualification of $500m of Lithography capital equipment, ramping Arizona's second 200mm factory on 0.13um technology. Through creative scheduling and close partnership with our suppliers, the team held the project on schedule in spite of significant process and technology scope additions, throughout the project. Yield Engineer Intel January 1996  –  August 2000  (4 years 8 months) Arizona Responsible for the maintenance and performance of the factory fleet of defect metrology tools. This equipment was the only source of inline product quality control, monitoring the chips at various stages of the production cycle, categorizing product defect trends, ultimately to improve the line yield of the factory. Yield Engineer Intel January 1996  –  August 2000  (4 years 8 months) Arizona Responsible for the maintenance and performance of the factory fleet of defect metrology tools. This equipment was the only source of inline product quality control, monitoring the chips at various stages of the production cycle, categorizing product defect trends, ultimately to improve the line yield of the factory. Quality Control Engineer Seagate Technology September 1993  –  1996  (3 years) Established machine quality control processes in Seagates first R&D and operations facility. Quality Control Engineer Seagate Technology September 1993  –  1996  (3 years) Established machine quality control processes in Seagates first R&D and operations facility. Skills Lean Manufacturing Semiconductor... Technology Transfer Industrial Engineering Capital Equipment... Construction Management Large Capital Projects Strategic Leadership Organizational... TCM Lithography Quality Control Mandarin Skills  Lean Manufacturing Semiconductor... Technology Transfer Industrial Engineering Capital Equipment... Construction Management Large Capital Projects Strategic Leadership Organizational... TCM Lithography Quality Control Mandarin Lean Manufacturing Semiconductor... Technology Transfer Industrial Engineering Capital Equipment... Construction Management Large Capital Projects Strategic Leadership Organizational... TCM Lithography Quality Control Mandarin Lean Manufacturing Semiconductor... Technology Transfer Industrial Engineering Capital Equipment... Construction Management Large Capital Projects Strategic Leadership Organizational... TCM Lithography Quality Control Mandarin Education Heriot-Watt University Bachelor of Engineering (B.Eng.),  Mechanical Engineering , Honours 1989  – 1993 Mechanical Engineering Activities and Societies:  Heriot Watt Rugby Club Limavady Grammar 1982  – 1989 A-levels in Maths, Physics and Economics Activities and Societies:  Duke of Edinburgh Award Scheme ,  rugby team Heriot-Watt University Bachelor of Engineering (B.Eng.),  Mechanical Engineering , Honours 1989  – 1993 Mechanical Engineering Activities and Societies:  Heriot Watt Rugby Club Heriot-Watt University Bachelor of Engineering (B.Eng.),  Mechanical Engineering , Honours 1989  – 1993 Mechanical Engineering Activities and Societies:  Heriot Watt Rugby Club Heriot-Watt University Bachelor of Engineering (B.Eng.),  Mechanical Engineering , Honours 1989  – 1993 Mechanical Engineering Activities and Societies:  Heriot Watt Rugby Club Limavady Grammar 1982  – 1989 A-levels in Maths, Physics and Economics Activities and Societies:  Duke of Edinburgh Award Scheme ,  rugby team Limavady Grammar 1982  – 1989 A-levels in Maths, Physics and Economics Activities and Societies:  Duke of Edinburgh Award Scheme ,  rugby team Limavady Grammar 1982  – 1989 A-levels in Maths, Physics and Economics Activities and Societies:  Duke of Edinburgh Award Scheme ,  rugby team ", "Languages   Skills Program Management Construction Management Contract Management Project Planning Process Scheduler Engineering Construction Engineering Management Contract Negotiation Procurement MS Project Budgets Project Management Management Operations Management AutoCAD Project Coordination Cross-functional Team... Contractors Project Estimation Proposal Writing Primavera P6 Negotiation Facilities Management Inspection Cost Control Semiconductor Industry Team Leadership Six Sigma Risk Management Process Engineering Leadership Lean Manufacturing Renewable Energy Analysis Microsoft Office Team Building Electricians Process Improvement Project Engineering Microsoft Excel Strategic Planning HVAC Value Engineering Cost Management Manufacturing Architecture See 32+     See less Skills  Program Management Construction Management Contract Management Project Planning Process Scheduler Engineering Construction Engineering Management Contract Negotiation Procurement MS Project Budgets Project Management Management Operations Management AutoCAD Project Coordination Cross-functional Team... Contractors Project Estimation Proposal Writing Primavera P6 Negotiation Facilities Management Inspection Cost Control Semiconductor Industry Team Leadership Six Sigma Risk Management Process Engineering Leadership Lean Manufacturing Renewable Energy Analysis Microsoft Office Team Building Electricians Process Improvement Project Engineering Microsoft Excel Strategic Planning HVAC Value Engineering Cost Management Manufacturing Architecture See 32+     See less Program Management Construction Management Contract Management Project Planning Process Scheduler Engineering Construction Engineering Management Contract Negotiation Procurement MS Project Budgets Project Management Management Operations Management AutoCAD Project Coordination Cross-functional Team... Contractors Project Estimation Proposal Writing Primavera P6 Negotiation Facilities Management Inspection Cost Control Semiconductor Industry Team Leadership Six Sigma Risk Management Process Engineering Leadership Lean Manufacturing Renewable Energy Analysis Microsoft Office Team Building Electricians Process Improvement Project Engineering Microsoft Excel Strategic Planning HVAC Value Engineering Cost Management Manufacturing Architecture See 32+     See less Program Management Construction Management Contract Management Project Planning Process Scheduler Engineering Construction Engineering Management Contract Negotiation Procurement MS Project Budgets Project Management Management Operations Management AutoCAD Project Coordination Cross-functional Team... Contractors Project Estimation Proposal Writing Primavera P6 Negotiation Facilities Management Inspection Cost Control Semiconductor Industry Team Leadership Six Sigma Risk Management Process Engineering Leadership Lean Manufacturing Renewable Energy Analysis Microsoft Office Team Building Electricians Process Improvement Project Engineering Microsoft Excel Strategic Planning HVAC Value Engineering Cost Management Manufacturing Architecture See 32+     See less Honors & Awards ", "Summary My primary experience has been in Semiconductor wafer Fab equipment engineering, install & Qualification, and Factory automation systems. I have also held several factory management positions as well since 1980.  \n \nI started my work in IT in 2004. I was the Global Infrastructure Services Group leader for Intel Corporations Ocotillo Site. I moved to Data Center Services in late 2006 as a strategic/tactical data center planner. \n \nSpecialties: Wafer Fab factory planning, engineering, management and automation systems, IT planning -facilities assessments and strategic planning. Summary My primary experience has been in Semiconductor wafer Fab equipment engineering, install & Qualification, and Factory automation systems. I have also held several factory management positions as well since 1980.  \n \nI started my work in IT in 2004. I was the Global Infrastructure Services Group leader for Intel Corporations Ocotillo Site. I moved to Data Center Services in late 2006 as a strategic/tactical data center planner. \n \nSpecialties: Wafer Fab factory planning, engineering, management and automation systems, IT planning -facilities assessments and strategic planning. My primary experience has been in Semiconductor wafer Fab equipment engineering, install & Qualification, and Factory automation systems. I have also held several factory management positions as well since 1980.  \n \nI started my work in IT in 2004. I was the Global Infrastructure Services Group leader for Intel Corporations Ocotillo Site. I moved to Data Center Services in late 2006 as a strategic/tactical data center planner. \n \nSpecialties: Wafer Fab factory planning, engineering, management and automation systems, IT planning -facilities assessments and strategic planning. My primary experience has been in Semiconductor wafer Fab equipment engineering, install & Qualification, and Factory automation systems. I have also held several factory management positions as well since 1980.  \n \nI started my work in IT in 2004. I was the Global Infrastructure Services Group leader for Intel Corporations Ocotillo Site. I moved to Data Center Services in late 2006 as a strategic/tactical data center planner. \n \nSpecialties: Wafer Fab factory planning, engineering, management and automation systems, IT planning -facilities assessments and strategic planning. Experience Technical Master Manufacturing Capability Engineer June 2015  – Present (3 months) Understanding efficiencies, deficiencies, operational opportunities to improve Through out, increase uptime and availability of factory equipment  Technical Training Leader/ Lab construction Manager Intel Corporation August 2012  – Present (3 years 1 month) Project management, Planning, Design, Electrical, Mechanical evaluations of proposed factory tool installation for Intel's new Learning labs. I coordinate trades and manage the tool installs from conception through qualification. The learning labs are a new methodology that creates a factory atmosphere in a lab environment. Having factory tools in a lab condition allows many activities and is non intrusive to Manufacturing throughput. ROI is big!! Engineering Manager Intel Corporation May 2011  –  August 2012  (1 year 4 months) Ocotillo, Arizona DCS Planning Analyst Intel Technology 1988  –  2011  (23 years) Data Center Planning Analyst Intel Corp. DCS December 1989  –  2010  (21 years) Global Infrastructure Manager Intel July 2005  –  October 2006  (1 year 4 months) Technical Master Manufacturing Capability Engineer June 2015  – Present (3 months) Understanding efficiencies, deficiencies, operational opportunities to improve Through out, increase uptime and availability of factory equipment  Technical Master Manufacturing Capability Engineer June 2015  – Present (3 months) Understanding efficiencies, deficiencies, operational opportunities to improve Through out, increase uptime and availability of factory equipment  Technical Training Leader/ Lab construction Manager Intel Corporation August 2012  – Present (3 years 1 month) Project management, Planning, Design, Electrical, Mechanical evaluations of proposed factory tool installation for Intel's new Learning labs. I coordinate trades and manage the tool installs from conception through qualification. The learning labs are a new methodology that creates a factory atmosphere in a lab environment. Having factory tools in a lab condition allows many activities and is non intrusive to Manufacturing throughput. ROI is big!! Technical Training Leader/ Lab construction Manager Intel Corporation August 2012  – Present (3 years 1 month) Project management, Planning, Design, Electrical, Mechanical evaluations of proposed factory tool installation for Intel's new Learning labs. I coordinate trades and manage the tool installs from conception through qualification. The learning labs are a new methodology that creates a factory atmosphere in a lab environment. Having factory tools in a lab condition allows many activities and is non intrusive to Manufacturing throughput. ROI is big!! Engineering Manager Intel Corporation May 2011  –  August 2012  (1 year 4 months) Ocotillo, Arizona Engineering Manager Intel Corporation May 2011  –  August 2012  (1 year 4 months) Ocotillo, Arizona DCS Planning Analyst Intel Technology 1988  –  2011  (23 years) DCS Planning Analyst Intel Technology 1988  –  2011  (23 years) Data Center Planning Analyst Intel Corp. DCS December 1989  –  2010  (21 years) Data Center Planning Analyst Intel Corp. DCS December 1989  –  2010  (21 years) Global Infrastructure Manager Intel July 2005  –  October 2006  (1 year 4 months) Global Infrastructure Manager Intel July 2005  –  October 2006  (1 year 4 months) Languages English English English Skills Engineering Technology Planning Intel Data Center Semiconductors Program Management Processors Engineering Management IT Operations Automation Six Sigma Capacity Planning Cloud Computing Semiconductor Industry Integration Vendor Management Project Management SPC ITIL System Architecture Manufacturing SDLC Failure Analysis Strategy Design of Experiments IC Product Engineering JMP Security CMOS SoC ASIC Analog Silicon Thin Films Metrology Debugging MEMS VLSI Electronics See 25+     See less Skills  Engineering Technology Planning Intel Data Center Semiconductors Program Management Processors Engineering Management IT Operations Automation Six Sigma Capacity Planning Cloud Computing Semiconductor Industry Integration Vendor Management Project Management SPC ITIL System Architecture Manufacturing SDLC Failure Analysis Strategy Design of Experiments IC Product Engineering JMP Security CMOS SoC ASIC Analog Silicon Thin Films Metrology Debugging MEMS VLSI Electronics See 25+     See less Engineering Technology Planning Intel Data Center Semiconductors Program Management Processors Engineering Management IT Operations Automation Six Sigma Capacity Planning Cloud Computing Semiconductor Industry Integration Vendor Management Project Management SPC ITIL System Architecture Manufacturing SDLC Failure Analysis Strategy Design of Experiments IC Product Engineering JMP Security CMOS SoC ASIC Analog Silicon Thin Films Metrology Debugging MEMS VLSI Electronics See 25+     See less Engineering Technology Planning Intel Data Center Semiconductors Program Management Processors Engineering Management IT Operations Automation Six Sigma Capacity Planning Cloud Computing Semiconductor Industry Integration Vendor Management Project Management SPC ITIL System Architecture Manufacturing SDLC Failure Analysis Strategy Design of Experiments IC Product Engineering JMP Security CMOS SoC ASIC Analog Silicon Thin Films Metrology Debugging MEMS VLSI Electronics See 25+     See less Education Brigham Young University BSEE 1981  – 1983 Utah Valley University AAS 1977  – 1981 Brigham Young University BSEE 1981  – 1983 Brigham Young University BSEE 1981  – 1983 Brigham Young University BSEE 1981  – 1983 Utah Valley University AAS 1977  – 1981 Utah Valley University AAS 1977  – 1981 Utah Valley University AAS 1977  – 1981 ", "Experience Owner/Broker Pinnacle Real Estate Group May 1997  – Present (18 years 4 months) Construction Manager Intel Corporation 1994  –  1997  (3 years) Construction Manager PCL Construction 1992  –  1994  (2 years) Owner/Broker Pinnacle Real Estate Group May 1997  – Present (18 years 4 months) Owner/Broker Pinnacle Real Estate Group May 1997  – Present (18 years 4 months) Construction Manager Intel Corporation 1994  –  1997  (3 years) Construction Manager Intel Corporation 1994  –  1997  (3 years) Construction Manager PCL Construction 1992  –  1994  (2 years) Construction Manager PCL Construction 1992  –  1994  (2 years) Education Los Alamos High School, University of New Mexico Los Alamos High School, University of New Mexico Los Alamos High School, University of New Mexico Los Alamos High School, University of New Mexico ", "Experience CSC Construction Manager Intel Corporation May 2014  – Present (1 year 4 months) Ireland Construction Project Manager Intel Corporation August 2012  –  April 2014  (1 year 9 months) Ireland Tool DeInstall Construction Project Manager PMO Manager Bord na Mona September 2008  –  July 2012  (3 years 11 months) Ireland IT Automation PMO Manager Intel Corporation 2005  –  2007  (2 years) Ireland IT Infrastructure Program Manager Intel Corporation 2003  –  2005  (2 years) Ireland Senior IT Project Manager Intel Corporation 2001  –  2003  (2 years) Ireland IT Infrastructure Systems Engineer Intel Corporation 1998  –  2001  (3 years) Ireland CSC Construction Manager Intel Corporation May 2014  – Present (1 year 4 months) Ireland CSC Construction Manager Intel Corporation May 2014  – Present (1 year 4 months) Ireland Construction Project Manager Intel Corporation August 2012  –  April 2014  (1 year 9 months) Ireland Tool DeInstall Construction Project Manager Construction Project Manager Intel Corporation August 2012  –  April 2014  (1 year 9 months) Ireland Tool DeInstall Construction Project Manager PMO Manager Bord na Mona September 2008  –  July 2012  (3 years 11 months) Ireland PMO Manager Bord na Mona September 2008  –  July 2012  (3 years 11 months) Ireland IT Automation PMO Manager Intel Corporation 2005  –  2007  (2 years) Ireland IT Automation PMO Manager Intel Corporation 2005  –  2007  (2 years) Ireland IT Infrastructure Program Manager Intel Corporation 2003  –  2005  (2 years) Ireland IT Infrastructure Program Manager Intel Corporation 2003  –  2005  (2 years) Ireland Senior IT Project Manager Intel Corporation 2001  –  2003  (2 years) Ireland Senior IT Project Manager Intel Corporation 2001  –  2003  (2 years) Ireland IT Infrastructure Systems Engineer Intel Corporation 1998  –  2001  (3 years) Ireland IT Infrastructure Systems Engineer Intel Corporation 1998  –  2001  (3 years) Ireland Skills Program Management Infrastructure Information Technology Management Project Portfolio... Process Improvement Integration Cross-functional Team... Business Process Project Delivery Microsoft Project Primavera P6 Construction Management Skills  Program Management Infrastructure Information Technology Management Project Portfolio... Process Improvement Integration Cross-functional Team... Business Process Project Delivery Microsoft Project Primavera P6 Construction Management Program Management Infrastructure Information Technology Management Project Portfolio... Process Improvement Integration Cross-functional Team... Business Process Project Delivery Microsoft Project Primavera P6 Construction Management Program Management Infrastructure Information Technology Management Project Portfolio... Process Improvement Integration Cross-functional Team... Business Process Project Delivery Microsoft Project Primavera P6 Construction Management Education Dublin City University Bachelor of Science (BSc),  Computer Applications 1990  – 1994 Dublin City University Bachelor of Science (BSc),  Computer Applications 1990  – 1994 Dublin City University Bachelor of Science (BSc),  Computer Applications 1990  – 1994 Dublin City University Bachelor of Science (BSc),  Computer Applications 1990  – 1994 ", "Experience Engineering Manager Intel Commodity and Construction Manager Intel Corporation November 2000  – Present (14 years 10 months) Chandler Engineering Manager Intel Engineering Manager Intel Commodity and Construction Manager Intel Corporation November 2000  – Present (14 years 10 months) Chandler Commodity and Construction Manager Intel Corporation November 2000  – Present (14 years 10 months) Chandler "]}