{"position": "Consultant", "company": "Intel Corporation", "profiles": ["Experience Business Transformation Consultant Intel Corporation August 2012  – Present (3 years 1 month) Hillsboro, Oregon Engage with Intel leaders to facilitate business transformation by driving change from strategy to execution. Provide consultation in areas like strategic leadership alignment, organizational architecture, organizational design and transformation, process definition, people development practices and implementation of sustainable processes. As a Business Transformation Consultant I pair deep business acumen with excellent systems thinking to engage with business leaders to design, build and transform organizations to help them successfully fulfill their role in Intel’s current and future success. HR Business Partner Manager Intel Corporation February 2009  –  August 2012  (3 years 7 months) Hillsboro, Oregon Managed a team of Employee Engagement Specialists supporting Intel's Technology Development organization. Actively coached on core HR areas of expertise such as performance management, guidelines and practices, organization health, manager/leader development, annual performance assessments, diversity and hiring. Senior HR Business Partner Intel Corporation August 2006  –  February 2009  (2 years 7 months) Hillsboro, Oregon Organization Development Consultant Intel Corporation January 1998  –  August 2006  (8 years 8 months) Hillsboro, Oregon Training Development Specialist Intel Corporation April 1995  –  December 1997  (2 years 9 months) Hillsboro, Oregon Business Transformation Consultant Intel Corporation August 2012  – Present (3 years 1 month) Hillsboro, Oregon Engage with Intel leaders to facilitate business transformation by driving change from strategy to execution. Provide consultation in areas like strategic leadership alignment, organizational architecture, organizational design and transformation, process definition, people development practices and implementation of sustainable processes. As a Business Transformation Consultant I pair deep business acumen with excellent systems thinking to engage with business leaders to design, build and transform organizations to help them successfully fulfill their role in Intel’s current and future success. Business Transformation Consultant Intel Corporation August 2012  – Present (3 years 1 month) Hillsboro, Oregon Engage with Intel leaders to facilitate business transformation by driving change from strategy to execution. Provide consultation in areas like strategic leadership alignment, organizational architecture, organizational design and transformation, process definition, people development practices and implementation of sustainable processes. As a Business Transformation Consultant I pair deep business acumen with excellent systems thinking to engage with business leaders to design, build and transform organizations to help them successfully fulfill their role in Intel’s current and future success. HR Business Partner Manager Intel Corporation February 2009  –  August 2012  (3 years 7 months) Hillsboro, Oregon Managed a team of Employee Engagement Specialists supporting Intel's Technology Development organization. Actively coached on core HR areas of expertise such as performance management, guidelines and practices, organization health, manager/leader development, annual performance assessments, diversity and hiring. HR Business Partner Manager Intel Corporation February 2009  –  August 2012  (3 years 7 months) Hillsboro, Oregon Managed a team of Employee Engagement Specialists supporting Intel's Technology Development organization. Actively coached on core HR areas of expertise such as performance management, guidelines and practices, organization health, manager/leader development, annual performance assessments, diversity and hiring. Senior HR Business Partner Intel Corporation August 2006  –  February 2009  (2 years 7 months) Hillsboro, Oregon Senior HR Business Partner Intel Corporation August 2006  –  February 2009  (2 years 7 months) Hillsboro, Oregon Organization Development Consultant Intel Corporation January 1998  –  August 2006  (8 years 8 months) Hillsboro, Oregon Organization Development Consultant Intel Corporation January 1998  –  August 2006  (8 years 8 months) Hillsboro, Oregon Training Development Specialist Intel Corporation April 1995  –  December 1997  (2 years 9 months) Hillsboro, Oregon Training Development Specialist Intel Corporation April 1995  –  December 1997  (2 years 9 months) Hillsboro, Oregon Skills Organizational Design Organizational... Organizational... Leadership Development Organizational... Leading Organizational... Business Transformation Systems Thinking Situational Leadership Group Dynamics Organizational Culture Skills  Organizational Design Organizational... Organizational... Leadership Development Organizational... Leading Organizational... Business Transformation Systems Thinking Situational Leadership Group Dynamics Organizational Culture Organizational Design Organizational... Organizational... Leadership Development Organizational... Leading Organizational... Business Transformation Systems Thinking Situational Leadership Group Dynamics Organizational Culture Organizational Design Organizational... Organizational... Leadership Development Organizational... Leading Organizational... Business Transformation Systems Thinking Situational Leadership Group Dynamics Organizational Culture Education Fielding Graduate University Master of Arts (M.A.),  Organization Design & Effectiveness 1997  – 1998 Portland State University Bachelor of Science (B.S.),  Industrial and Organizational Psychology 1992 Fielding Graduate University Master of Arts (M.A.),  Organization Design & Effectiveness 1997  – 1998 Fielding Graduate University Master of Arts (M.A.),  Organization Design & Effectiveness 1997  – 1998 Fielding Graduate University Master of Arts (M.A.),  Organization Design & Effectiveness 1997  – 1998 Portland State University Bachelor of Science (B.S.),  Industrial and Organizational Psychology 1992 Portland State University Bachelor of Science (B.S.),  Industrial and Organizational Psychology 1992 Portland State University Bachelor of Science (B.S.),  Industrial and Organizational Psychology 1992 ", "Skills SystemVerilog SoC Verilog ASIC RTL design OVM Verification Open Verification... DFT Functional Verification ModelSim VHDL Semiconductors Perl Simulations IC Embedded Systems Veritas Cluster Server Mixed Signal Debugging Cadence See 6+     See less Skills  SystemVerilog SoC Verilog ASIC RTL design OVM Verification Open Verification... DFT Functional Verification ModelSim VHDL Semiconductors Perl Simulations IC Embedded Systems Veritas Cluster Server Mixed Signal Debugging Cadence See 6+     See less SystemVerilog SoC Verilog ASIC RTL design OVM Verification Open Verification... DFT Functional Verification ModelSim VHDL Semiconductors Perl Simulations IC Embedded Systems Veritas Cluster Server Mixed Signal Debugging Cadence See 6+     See less SystemVerilog SoC Verilog ASIC RTL design OVM Verification Open Verification... DFT Functional Verification ModelSim VHDL Semiconductors Perl Simulations IC Embedded Systems Veritas Cluster Server Mixed Signal Debugging Cadence See 6+     See less ", "Skills Talent Management Organizational... Succession Planning Performance Management Employee Engagement Employee Relations Organizational Design Organizational... Leadership Development Onboarding Change Management Management Development Career Development Program Management Customer Service Customer Experience Sourcing Workforce Planning Applicant Tracking... Process Improvement Training Strategy Cross-functional Team... Leadership Talent Acquisition Personnel Management Human Resources HRIS College Recruiting Management HR Consulting Employer Branding Recruiting Strategic Planning See 19+     See less Skills  Talent Management Organizational... Succession Planning Performance Management Employee Engagement Employee Relations Organizational Design Organizational... Leadership Development Onboarding Change Management Management Development Career Development Program Management Customer Service Customer Experience Sourcing Workforce Planning Applicant Tracking... Process Improvement Training Strategy Cross-functional Team... Leadership Talent Acquisition Personnel Management Human Resources HRIS College Recruiting Management HR Consulting Employer Branding Recruiting Strategic Planning See 19+     See less Talent Management Organizational... Succession Planning Performance Management Employee Engagement Employee Relations Organizational Design Organizational... Leadership Development Onboarding Change Management Management Development Career Development Program Management Customer Service Customer Experience Sourcing Workforce Planning Applicant Tracking... Process Improvement Training Strategy Cross-functional Team... Leadership Talent Acquisition Personnel Management Human Resources HRIS College Recruiting Management HR Consulting Employer Branding Recruiting Strategic Planning See 19+     See less Talent Management Organizational... Succession Planning Performance Management Employee Engagement Employee Relations Organizational Design Organizational... Leadership Development Onboarding Change Management Management Development Career Development Program Management Customer Service Customer Experience Sourcing Workforce Planning Applicant Tracking... Process Improvement Training Strategy Cross-functional Team... Leadership Talent Acquisition Personnel Management Human Resources HRIS College Recruiting Management HR Consulting Employer Branding Recruiting Strategic Planning See 19+     See less ", "Experience Business Transformation Consultant Intel Corporation August 2012  – Present (3 years 1 month) Business Transformation Consultant Intel Corporation August 2012  – Present (3 years 1 month) Business Transformation Consultant Intel Corporation August 2012  – Present (3 years 1 month) Skills Performance Management Workforce Planning Organizational... Employee Relations Talent Management Succession Planning Human Resources Organizational... Organizational Design Deferred Compensation Employee Engagement HRIS Personnel Management Onboarding HR Policies HR Transformation HR Consulting Management Development Talent Acquisition College Recruiting Compensation & Benefit Career Development See 7+     See less Skills  Performance Management Workforce Planning Organizational... Employee Relations Talent Management Succession Planning Human Resources Organizational... Organizational Design Deferred Compensation Employee Engagement HRIS Personnel Management Onboarding HR Policies HR Transformation HR Consulting Management Development Talent Acquisition College Recruiting Compensation & Benefit Career Development See 7+     See less Performance Management Workforce Planning Organizational... Employee Relations Talent Management Succession Planning Human Resources Organizational... Organizational Design Deferred Compensation Employee Engagement HRIS Personnel Management Onboarding HR Policies HR Transformation HR Consulting Management Development Talent Acquisition College Recruiting Compensation & Benefit Career Development See 7+     See less Performance Management Workforce Planning Organizational... Employee Relations Talent Management Succession Planning Human Resources Organizational... Organizational Design Deferred Compensation Employee Engagement HRIS Personnel Management Onboarding HR Policies HR Transformation HR Consulting Management Development Talent Acquisition College Recruiting Compensation & Benefit Career Development See 7+     See less ", "Summary •\tHighly motivated, self-directed senior software professional with 20 years' experience in software development, product life-cycle management and process improvement.  \n•\tEffective oral and written communication skills with individuals across all levels of the organization. Consistently recognized by management for superior performance and creative problem-solving ability. \n•\tPassionate about quality and efficiency of processes. \n•\tExperienced with “traditional” development life cycle as well as agile methodologies (Scrum). \n•\tCapable of successfully managing multiple projects with competing deadlines, resource and schedule conflicts and changing priorities.Makes sound decisions under pressure in fast paced and unpredictable environments. \n•\tHighly organized, detail oriented, capable of seeing the big picture and thinking out of the box. Summary •\tHighly motivated, self-directed senior software professional with 20 years' experience in software development, product life-cycle management and process improvement.  \n•\tEffective oral and written communication skills with individuals across all levels of the organization. Consistently recognized by management for superior performance and creative problem-solving ability. \n•\tPassionate about quality and efficiency of processes. \n•\tExperienced with “traditional” development life cycle as well as agile methodologies (Scrum). \n•\tCapable of successfully managing multiple projects with competing deadlines, resource and schedule conflicts and changing priorities.Makes sound decisions under pressure in fast paced and unpredictable environments. \n•\tHighly organized, detail oriented, capable of seeing the big picture and thinking out of the box. •\tHighly motivated, self-directed senior software professional with 20 years' experience in software development, product life-cycle management and process improvement.  \n•\tEffective oral and written communication skills with individuals across all levels of the organization. Consistently recognized by management for superior performance and creative problem-solving ability. \n•\tPassionate about quality and efficiency of processes. \n•\tExperienced with “traditional” development life cycle as well as agile methodologies (Scrum). \n•\tCapable of successfully managing multiple projects with competing deadlines, resource and schedule conflicts and changing priorities.Makes sound decisions under pressure in fast paced and unpredictable environments. \n•\tHighly organized, detail oriented, capable of seeing the big picture and thinking out of the box. •\tHighly motivated, self-directed senior software professional with 20 years' experience in software development, product life-cycle management and process improvement.  \n•\tEffective oral and written communication skills with individuals across all levels of the organization. Consistently recognized by management for superior performance and creative problem-solving ability. \n•\tPassionate about quality and efficiency of processes. \n•\tExperienced with “traditional” development life cycle as well as agile methodologies (Scrum). \n•\tCapable of successfully managing multiple projects with competing deadlines, resource and schedule conflicts and changing priorities.Makes sound decisions under pressure in fast paced and unpredictable environments. \n•\tHighly organized, detail oriented, capable of seeing the big picture and thinking out of the box. Experience Software Engineering Consultant Intel Corporation April 2013  – Present (2 years 5 months) Santa Clara, CA Co-founder Stealth Startup 2012  –  2013  (1 year) Software Engineering Manager TiVo October 2011  –  September 2012  (1 year) Alviso, CA System Software Engineering Manager 2Wire May 2008  –  October 2011  (3 years 6 months) San Jose, CA Principal Staff Software Engineer / Project Lead Motorola (formerly Symbol Technologies) April 2004  –  May 2008  (4 years 2 months) San Jose, CA Senior Software Engineer, Lead Terayon 1999  –  2004  (5 years) Senior Software Engineer AudioCodes 1999  –  1999  (less than a year) Israel Software Engineer Elbit 1997  –  1999  (2 years) Israel Software Developer M.I.R 1993  –  1997  (4 years) Israel Software Developer Israel Defense Forces 1992  –  1993  (1 year) Israel Electronic Technician Israel Defense Forces 1989  –  1992  (3 years) Israel Software Engineering Consultant Intel Corporation April 2013  – Present (2 years 5 months) Santa Clara, CA Software Engineering Consultant Intel Corporation April 2013  – Present (2 years 5 months) Santa Clara, CA Co-founder Stealth Startup 2012  –  2013  (1 year) Co-founder Stealth Startup 2012  –  2013  (1 year) Software Engineering Manager TiVo October 2011  –  September 2012  (1 year) Alviso, CA Software Engineering Manager TiVo October 2011  –  September 2012  (1 year) Alviso, CA System Software Engineering Manager 2Wire May 2008  –  October 2011  (3 years 6 months) San Jose, CA System Software Engineering Manager 2Wire May 2008  –  October 2011  (3 years 6 months) San Jose, CA Principal Staff Software Engineer / Project Lead Motorola (formerly Symbol Technologies) April 2004  –  May 2008  (4 years 2 months) San Jose, CA Principal Staff Software Engineer / Project Lead Motorola (formerly Symbol Technologies) April 2004  –  May 2008  (4 years 2 months) San Jose, CA Senior Software Engineer, Lead Terayon 1999  –  2004  (5 years) Senior Software Engineer, Lead Terayon 1999  –  2004  (5 years) Senior Software Engineer AudioCodes 1999  –  1999  (less than a year) Israel Senior Software Engineer AudioCodes 1999  –  1999  (less than a year) Israel Software Engineer Elbit 1997  –  1999  (2 years) Israel Software Engineer Elbit 1997  –  1999  (2 years) Israel Software Developer M.I.R 1993  –  1997  (4 years) Israel Software Developer M.I.R 1993  –  1997  (4 years) Israel Software Developer Israel Defense Forces 1992  –  1993  (1 year) Israel Software Developer Israel Defense Forces 1992  –  1993  (1 year) Israel Electronic Technician Israel Defense Forces 1989  –  1992  (3 years) Israel Electronic Technician Israel Defense Forces 1989  –  1992  (3 years) Israel Skills Embedded Systems Embedded Software Device Drivers Embedded Linux Software Development Software Engineering C Software Design Linux Software Project... Program Management Networking VoIP TCP/IP Firmware Scrum System Architecture Agile Methodologies Management Team Leadership Cross-functional Team... Project Management Quality Management Release Management Quality Auditing Communication Protocols Android Java Wireless Networking Routers Switches Mobile Applications Mobile Devices Bluetooth SNMP See 20+     See less Skills  Embedded Systems Embedded Software Device Drivers Embedded Linux Software Development Software Engineering C Software Design Linux Software Project... Program Management Networking VoIP TCP/IP Firmware Scrum System Architecture Agile Methodologies Management Team Leadership Cross-functional Team... Project Management Quality Management Release Management Quality Auditing Communication Protocols Android Java Wireless Networking Routers Switches Mobile Applications Mobile Devices Bluetooth SNMP See 20+     See less Embedded Systems Embedded Software Device Drivers Embedded Linux Software Development Software Engineering C Software Design Linux Software Project... Program Management Networking VoIP TCP/IP Firmware Scrum System Architecture Agile Methodologies Management Team Leadership Cross-functional Team... Project Management Quality Management Release Management Quality Auditing Communication Protocols Android Java Wireless Networking Routers Switches Mobile Applications Mobile Devices Bluetooth SNMP See 20+     See less Embedded Systems Embedded Software Device Drivers Embedded Linux Software Development Software Engineering C Software Design Linux Software Project... Program Management Networking VoIP TCP/IP Firmware Scrum System Architecture Agile Methodologies Management Team Leadership Cross-functional Team... Project Management Quality Management Release Management Quality Auditing Communication Protocols Android Java Wireless Networking Routers Switches Mobile Applications Mobile Devices Bluetooth SNMP See 20+     See less ", "Skills Strategy Cross-functional Team... Management Program Management Strategic Planning Enterprise Software Product Management Process Improvement Leadership Business Strategy Skills  Strategy Cross-functional Team... Management Program Management Strategic Planning Enterprise Software Product Management Process Improvement Leadership Business Strategy Strategy Cross-functional Team... Management Program Management Strategic Planning Enterprise Software Product Management Process Improvement Leadership Business Strategy Strategy Cross-functional Team... Management Program Management Strategic Planning Enterprise Software Product Management Process Improvement Leadership Business Strategy ", "Summary I thrive on gathering complete information and building smart, insightful, strategic business decisions. \n \nI interact in the space between Technology and Psychology. I'm an SME in Experience Research, Customer Experience, and Technical Content Strategy. \n \nI've over 15 years experience working as a subject matter expert as well as managing direct-­reports in a matrixed organization while supporting cross-­functional relationships with other managers. Additionally have done recruiting and hiring, provided performance reviews, done salary negotiations, and maintained department budget. \n \n:: Multivariate Testing :: Ethnography :: Content Best Practices :: Persona Creation :: User Experience Research :: Digital Strategy :: User Profiling :: Content Experience :: Localization:: Summary I thrive on gathering complete information and building smart, insightful, strategic business decisions. \n \nI interact in the space between Technology and Psychology. I'm an SME in Experience Research, Customer Experience, and Technical Content Strategy. \n \nI've over 15 years experience working as a subject matter expert as well as managing direct-­reports in a matrixed organization while supporting cross-­functional relationships with other managers. Additionally have done recruiting and hiring, provided performance reviews, done salary negotiations, and maintained department budget. \n \n:: Multivariate Testing :: Ethnography :: Content Best Practices :: Persona Creation :: User Experience Research :: Digital Strategy :: User Profiling :: Content Experience :: Localization:: I thrive on gathering complete information and building smart, insightful, strategic business decisions. \n \nI interact in the space between Technology and Psychology. I'm an SME in Experience Research, Customer Experience, and Technical Content Strategy. \n \nI've over 15 years experience working as a subject matter expert as well as managing direct-­reports in a matrixed organization while supporting cross-­functional relationships with other managers. Additionally have done recruiting and hiring, provided performance reviews, done salary negotiations, and maintained department budget. \n \n:: Multivariate Testing :: Ethnography :: Content Best Practices :: Persona Creation :: User Experience Research :: Digital Strategy :: User Profiling :: Content Experience :: Localization:: I thrive on gathering complete information and building smart, insightful, strategic business decisions. \n \nI interact in the space between Technology and Psychology. I'm an SME in Experience Research, Customer Experience, and Technical Content Strategy. \n \nI've over 15 years experience working as a subject matter expert as well as managing direct-­reports in a matrixed organization while supporting cross-­functional relationships with other managers. Additionally have done recruiting and hiring, provided performance reviews, done salary negotiations, and maintained department budget. \n \n:: Multivariate Testing :: Ethnography :: Content Best Practices :: Persona Creation :: User Experience Research :: Digital Strategy :: User Profiling :: Content Experience :: Localization:: Languages   Skills Skills     Honors & Awards ", "Experience Team Lead - P2P Firestone Building Products (as Client of Hitachi Consulting) June 2014  –  August 2014  (3 months) Indianapolis, Indiana Senior SAP MM Consultant Johnson Controls (as Client of Infosys Limited) September 2013  –  May 2014  (9 months) Plymouth, Michigan Senior SAP MM Consultant Apple (as Client of Infosys Limited) October 2012  –  August 2013  (11 months) Cupertino, California Senior SAP MM Consultant Intel Corporation (as Client of Infosys Limited) March 2009  –  September 2012  (3 years 7 months) Phoenix, Arizona Area SAP MM Consultant Intel Corporation (as Client of Infosys Limited) October 2007  –  February 2009  (1 year 5 months) Phoenix, Arizona Area SAP MM Consultant Intel Corporation (as Client of Infosys Limited) January 2007  –  September 2007  (9 months) Bengaluru Area, India SAP MM Consultant Analog Devices (as Client of Infosys Limited) June 2006  –  December 2006  (7 months) Bengaluru Area, India SAP MM Associate Consultant Air Liquide (as Client of Infosys Limited) August 2005  –  May 2006  (10 months) Bengaluru Area, India Team Lead - P2P Firestone Building Products (as Client of Hitachi Consulting) June 2014  –  August 2014  (3 months) Indianapolis, Indiana Team Lead - P2P Firestone Building Products (as Client of Hitachi Consulting) June 2014  –  August 2014  (3 months) Indianapolis, Indiana Senior SAP MM Consultant Johnson Controls (as Client of Infosys Limited) September 2013  –  May 2014  (9 months) Plymouth, Michigan Senior SAP MM Consultant Johnson Controls (as Client of Infosys Limited) September 2013  –  May 2014  (9 months) Plymouth, Michigan Senior SAP MM Consultant Apple (as Client of Infosys Limited) October 2012  –  August 2013  (11 months) Cupertino, California Senior SAP MM Consultant Apple (as Client of Infosys Limited) October 2012  –  August 2013  (11 months) Cupertino, California Senior SAP MM Consultant Intel Corporation (as Client of Infosys Limited) March 2009  –  September 2012  (3 years 7 months) Phoenix, Arizona Area Senior SAP MM Consultant Intel Corporation (as Client of Infosys Limited) March 2009  –  September 2012  (3 years 7 months) Phoenix, Arizona Area SAP MM Consultant Intel Corporation (as Client of Infosys Limited) October 2007  –  February 2009  (1 year 5 months) Phoenix, Arizona Area SAP MM Consultant Intel Corporation (as Client of Infosys Limited) October 2007  –  February 2009  (1 year 5 months) Phoenix, Arizona Area SAP MM Consultant Intel Corporation (as Client of Infosys Limited) January 2007  –  September 2007  (9 months) Bengaluru Area, India SAP MM Consultant Intel Corporation (as Client of Infosys Limited) January 2007  –  September 2007  (9 months) Bengaluru Area, India SAP MM Consultant Analog Devices (as Client of Infosys Limited) June 2006  –  December 2006  (7 months) Bengaluru Area, India SAP MM Consultant Analog Devices (as Client of Infosys Limited) June 2006  –  December 2006  (7 months) Bengaluru Area, India SAP MM Associate Consultant Air Liquide (as Client of Infosys Limited) August 2005  –  May 2006  (10 months) Bengaluru Area, India SAP MM Associate Consultant Air Liquide (as Client of Infosys Limited) August 2005  –  May 2006  (10 months) Bengaluru Area, India Languages   Skills SAP R/3 SAP ERP Data Migration QTP Business Process Materials Management Legacy Systems Project Management Business Analysis Integration SAP MM Requirements Gathering Pre-sales SAP Implementation SAP ECC 6.0 LSMW HP Quick Test... ERP Requirements Analysis See 4+     See less Skills  SAP R/3 SAP ERP Data Migration QTP Business Process Materials Management Legacy Systems Project Management Business Analysis Integration SAP MM Requirements Gathering Pre-sales SAP Implementation SAP ECC 6.0 LSMW HP Quick Test... ERP Requirements Analysis See 4+     See less SAP R/3 SAP ERP Data Migration QTP Business Process Materials Management Legacy Systems Project Management Business Analysis Integration SAP MM Requirements Gathering Pre-sales SAP Implementation SAP ECC 6.0 LSMW HP Quick Test... ERP Requirements Analysis See 4+     See less SAP R/3 SAP ERP Data Migration QTP Business Process Materials Management Legacy Systems Project Management Business Analysis Integration SAP MM Requirements Gathering Pre-sales SAP Implementation SAP ECC 6.0 LSMW HP Quick Test... ERP Requirements Analysis See 4+     See less Education Indian Institute of Technology, Bombay Master of Management (MBA),  Operations and Systems Management , 7.66/10 2003  – 2005 Thapar Institute of Engineering and Technology Bachelor of Engineering (BE),  Computer Engineering , 7.7/10 (First Division) 1999  – 2003 Kendriya Vidyalaya +2,  Mathematics-Physics-Chemistry 1987  – 1999 Activities and Societies:  House Captain ,  Sports Captain Indian Institute of Technology, Bombay Master of Management (MBA),  Operations and Systems Management , 7.66/10 2003  – 2005 Indian Institute of Technology, Bombay Master of Management (MBA),  Operations and Systems Management , 7.66/10 2003  – 2005 Indian Institute of Technology, Bombay Master of Management (MBA),  Operations and Systems Management , 7.66/10 2003  – 2005 Thapar Institute of Engineering and Technology Bachelor of Engineering (BE),  Computer Engineering , 7.7/10 (First Division) 1999  – 2003 Thapar Institute of Engineering and Technology Bachelor of Engineering (BE),  Computer Engineering , 7.7/10 (First Division) 1999  – 2003 Thapar Institute of Engineering and Technology Bachelor of Engineering (BE),  Computer Engineering , 7.7/10 (First Division) 1999  – 2003 Kendriya Vidyalaya +2,  Mathematics-Physics-Chemistry 1987  – 1999 Activities and Societies:  House Captain ,  Sports Captain Kendriya Vidyalaya +2,  Mathematics-Physics-Chemistry 1987  – 1999 Activities and Societies:  House Captain ,  Sports Captain Kendriya Vidyalaya +2,  Mathematics-Physics-Chemistry 1987  – 1999 Activities and Societies:  House Captain ,  Sports Captain ", "Summary Highly motivated, organized, driven, always focused on customer and business needs and the people who can make a program a success! \n \nSpecialties:  \n• Over 15 years of Program/Product Management Experience \n• Proven experience in leading complex programs to successful completion \n• Self-Starter and a leader that can maintain focus and results consistently through teams \n• Organized, highly motivated, and willing to do what it takes to get the job done! \n• Able to work in unison with cross-functional teams, customers, and clients \n• Always focused on business /customer needs and requirements \n \nOthers: \n* PMP; Agile/Scrum Methodology; ITIL Summary Highly motivated, organized, driven, always focused on customer and business needs and the people who can make a program a success! \n \nSpecialties:  \n• Over 15 years of Program/Product Management Experience \n• Proven experience in leading complex programs to successful completion \n• Self-Starter and a leader that can maintain focus and results consistently through teams \n• Organized, highly motivated, and willing to do what it takes to get the job done! \n• Able to work in unison with cross-functional teams, customers, and clients \n• Always focused on business /customer needs and requirements \n \nOthers: \n* PMP; Agile/Scrum Methodology; ITIL Highly motivated, organized, driven, always focused on customer and business needs and the people who can make a program a success! \n \nSpecialties:  \n• Over 15 years of Program/Product Management Experience \n• Proven experience in leading complex programs to successful completion \n• Self-Starter and a leader that can maintain focus and results consistently through teams \n• Organized, highly motivated, and willing to do what it takes to get the job done! \n• Able to work in unison with cross-functional teams, customers, and clients \n• Always focused on business /customer needs and requirements \n \nOthers: \n* PMP; Agile/Scrum Methodology; ITIL Highly motivated, organized, driven, always focused on customer and business needs and the people who can make a program a success! \n \nSpecialties:  \n• Over 15 years of Program/Product Management Experience \n• Proven experience in leading complex programs to successful completion \n• Self-Starter and a leader that can maintain focus and results consistently through teams \n• Organized, highly motivated, and willing to do what it takes to get the job done! \n• Able to work in unison with cross-functional teams, customers, and clients \n• Always focused on business /customer needs and requirements \n \nOthers: \n* PMP; Agile/Scrum Methodology; ITIL Experience Sr. Program Manager Consultant Intel Corporation/HCL March 2013  – Present (2 years 6 months) •\tManaging program features, requirements and execution of “No-Password”, Intel’s new Biometrics Multi-Factor security engine and services for the Mobile Communication space. \n•\tDevelop Partnerships with McAfee, PCCG, SSG, and other extended teams to define No-Password MFA architecture, engineering, validation, and other related requirements. \n•\tPreform program management practices and communicate status, KPI, risks, and execution requirements with MCG stakeholders and extended teams.  \n•\tWork with Intel CTS teams to define OEM/ODM customer scalability requirements and engineering readiness and support for Cherry Trail Windows. \n•\tForged successful partnerships with ISH, Advanced Sensors, and PCCG in successfully carrying out the Lift & Look feature Technical Requirements and overall Proof of Concept (POC). Sr. Program Manager Consultant Intel Corporation/HCL March 2013  – Present (2 years 6 months) •\tManaging program features, requirements and execution of “No-Password”, Intel’s new Biometrics Multi-Factor security engine and services for the Mobile Communication space. \n•\tDevelop Partnerships with McAfee, PCCG, SSG, and other extended teams to define No-Password MFA architecture, engineering, validation, and other related requirements. \n•\tPreform program management practices and communicate status, KPI, risks, and execution requirements with MCG stakeholders and extended teams.  \n•\tWork with Intel CTS teams to define OEM/ODM customer scalability requirements and engineering readiness and support for Cherry Trail Windows. \n•\tForged successful partnerships with ISH, Advanced Sensors, and PCCG in successfully carrying out the Lift & Look feature Technical Requirements and overall Proof of Concept (POC). Sr. Program Manager Consultant Intel Corporation/HCL March 2013  – Present (2 years 6 months) •\tManaging program features, requirements and execution of “No-Password”, Intel’s new Biometrics Multi-Factor security engine and services for the Mobile Communication space. \n•\tDevelop Partnerships with McAfee, PCCG, SSG, and other extended teams to define No-Password MFA architecture, engineering, validation, and other related requirements. \n•\tPreform program management practices and communicate status, KPI, risks, and execution requirements with MCG stakeholders and extended teams.  \n•\tWork with Intel CTS teams to define OEM/ODM customer scalability requirements and engineering readiness and support for Cherry Trail Windows. \n•\tForged successful partnerships with ISH, Advanced Sensors, and PCCG in successfully carrying out the Lift & Look feature Technical Requirements and overall Proof of Concept (POC). Languages English Native or bilingual proficiency English Native or bilingual proficiency English Native or bilingual proficiency Native or bilingual proficiency Skills Product Management Program Management Release Management Process Improvement Productivity Tools ITIL PMP Management Team Leadership Project Management SharePoint Cross-functional Team... Training Agile Project Management Agile Methodologies Scrum Vendor Management Communication Skills Project Planning Leadership SDLC Software Project... See 7+     See less Skills  Product Management Program Management Release Management Process Improvement Productivity Tools ITIL PMP Management Team Leadership Project Management SharePoint Cross-functional Team... Training Agile Project Management Agile Methodologies Scrum Vendor Management Communication Skills Project Planning Leadership SDLC Software Project... See 7+     See less Product Management Program Management Release Management Process Improvement Productivity Tools ITIL PMP Management Team Leadership Project Management SharePoint Cross-functional Team... Training Agile Project Management Agile Methodologies Scrum Vendor Management Communication Skills Project Planning Leadership SDLC Software Project... See 7+     See less Product Management Program Management Release Management Process Improvement Productivity Tools ITIL PMP Management Team Leadership Project Management SharePoint Cross-functional Team... Training Agile Project Management Agile Methodologies Scrum Vendor Management Communication Skills Project Planning Leadership SDLC Software Project... See 7+     See less Honors & Awards ", "Summary A visionary learning and knowledge strategist with a proven track record in getting results. Tom is able to strategically assess top priority organizational learning and knowledge needs and then design and implement innovative and practical short and long-term solutions. A thought leader in informal and problem-based learning with a broad range of experience in training management, organizational development, leadership development, knowledge management, and learning and performance improvement initiatives across a range of organizational settings. Specialties:Problem-based learning, immersive simulations, knowledge systems design, and business process improvement. Summary A visionary learning and knowledge strategist with a proven track record in getting results. Tom is able to strategically assess top priority organizational learning and knowledge needs and then design and implement innovative and practical short and long-term solutions. A thought leader in informal and problem-based learning with a broad range of experience in training management, organizational development, leadership development, knowledge management, and learning and performance improvement initiatives across a range of organizational settings. Specialties:Problem-based learning, immersive simulations, knowledge systems design, and business process improvement. A visionary learning and knowledge strategist with a proven track record in getting results. Tom is able to strategically assess top priority organizational learning and knowledge needs and then design and implement innovative and practical short and long-term solutions. A thought leader in informal and problem-based learning with a broad range of experience in training management, organizational development, leadership development, knowledge management, and learning and performance improvement initiatives across a range of organizational settings. Specialties:Problem-based learning, immersive simulations, knowledge systems design, and business process improvement. A visionary learning and knowledge strategist with a proven track record in getting results. Tom is able to strategically assess top priority organizational learning and knowledge needs and then design and implement innovative and practical short and long-term solutions. A thought leader in informal and problem-based learning with a broad range of experience in training management, organizational development, leadership development, knowledge management, and learning and performance improvement initiatives across a range of organizational settings. Specialties:Problem-based learning, immersive simulations, knowledge systems design, and business process improvement. Experience Principal TREucker Training & Consulting July 2015  – Present (2 months) Ballston Lake, New York The sole proprietor of training and consulting firm.  \nProviding unique tailored consulting and custom seminars regarding effective leadership, organizational performance, learning and training strategies. \n Sr. Staff Organization Development Consultant GLOBALFOUNDRIES July 2014  –  July 2015  (1 year 1 month) Malta, New York Develop and deploy multi-tiered Leadership Development series for the site and globally. \nOngoing Organization Development support activities for the Malta site. Learning & Development Specialist GLOBALFOUNDRIES December 2010  –  July 2014  (3 years 8 months) Malta, New York Coordinated and program managed manufacturing factory systems training curriculum for factory startup. \nDelivered Learning Plans for all Fab 8 jobs to support factory start-up and audit activities. \nAs Interim Department manager supported direct reports and matrixed reports during transition to operations from HR. Principal TREucker Training & Consulting November 2007  –  December 2010  (3 years 2 months) Beaverton, Oregon The sole proprietor of training and consulting firm.  \n\tProviding unique tailored consulting and custom seminars regarding effective performance, learning and training strategies. \n\tAn acclaimed associate of Clark Training & Consulting; delivering award winning seminars on performance analysis, training design and development to Fortune 100 companies. Global Learning Manager Sourcecode July 2007  –  November 2007  (5 months) Malta, New York A key player in Business Process Management, K2 software has been improving business processes since 2000. Headquartered in Redmond Washington K2 is a primary Microsoft partner and holds an 8 percent share of the Windows-based BPMS market. \nInitially developed marketing collateral for innovative Business Process Management (BPM) software product launch before being asked to manage all aspects of internal personnel and customer learning for Sourcecode worldwide. \nIntroduced a basic strategy for Black Pearl® product training design and development and worked with regional training managers in support of deployment strategies. Product Marketing Manager Sourcecode North America, Inc. May 2007  –  July 2007  (3 months) Beaverton, Oregon Responsible for worldwide K2 product marketing strategy and content with a focus on helping business executives understand the compelling advantage that the K2 platform can give their organization by creating dynamic business applications that automate and improve key business processes across the enterprise. Worked with software developers in generating the basic and advanced content related to Black Pearl® features and functions for use with Sourcecode field personnel and customers to support tight launch schedule. Knowledge Strategist Intel Corporation January 2002  –  May 2007  (5 years 5 months) Chandler, Arizona Intel (NASDAQ: INTC) is a world leader in computing innovation. The company designs and builds the essential technologies that serve as the foundation for the world’s computing devices. \nOne of a team of Knowledge Strategists working with global manufacturing business units to craft knowledge strategies in support of business strategic objectives. \n\tIdentified, defined and developed innovative knowledge management capabilities resulting in reduced engineering process cycle time and increased visibility to the change control & management process. \n\tProvided leadership to a variety of knowledge management projects to improve working group productivity and reduce roadmap cycle times. Organization Effectiveness Specialist Intel Corporation / Business Practices & Services, Intel Communications Group September 2003  –  February 2005  (1 year 6 months) Chandler, Arizona Devised, promoted and deployed applications and methods for improved PDT (Product Development Team) collaboration effectiveness and knowledge management initiatives across the Intel Communications products division. \n\tCoordinated the application and deployment of a Microsoft SharePoint based Team Collaboration Tool (TCT) resulting in significant improvement in team communication.  \n\tAssessed and defined improved Program Management (PM) practices (including cross industry benchmarking) resulting in increased effectiveness and more focused development across Intel’s Communication Group. Leadership Development Consultant Intel Corporation / TMG Training, Technology & Manufacturing Group September 1999  –  December 2001  (2 years 4 months) Chandler, Arizona Assigned to the TMG People Systems Group full time throughout 2000 and half time for 2001. Focused on the sharing of leadership development best practices and resources. Designed and coordinated a Leadership Developers Conference with 80 people in attendance to improve cross TMG networking and knowledge of leadership development activities. Additionally provided a variety of consulting services; including a world-wide people movement summit, corporate and TMG staffing organizations and annual TME Supplier Day. Dean & Faculty Intel Corporation / College of Manufacturing, Technology & Manufacturing Group January 1995  –  September 1999  (4 years 9 months) Chandler, Arizona Provided the strategic vision and direction for the development of manufacturing science programs for professionals in Intel’s worldwide manufacturing organization and leadership to the dozen professionals of the College of Manufacturing.  \n\tDoubled the number and reach of manufacturing science programs accessible to Intel’s global manufacturing network while reducing resource costs by 50% and material costs by 75%. \n\tExpanded of the “suite” of programs including two additional versions of the award winning “Manufacturing 101” and “Engineering 101.” Showcased the MFG 101 program to MIT and partnered with Ford in the design of their version of the innovative immersive factory simulation. \n\tA key contributor to the development of first line manager curriculum development and exempt development strategies as a partner with the TMG People Systems Group. Training & Development Manager Intel Corporation / A4/T11, Components Manufacturing February 1990  –  January 1995  (5 years) Chandler, Arizona Department manager for high volume / new technology assembly & test factory located in Chandler Arizona. Responsible for the training and development of over 700 personnel and related organizations in the factory. Managed a staff of 10 regular full time, plus 4 to 6 contract employees in organization development, human factors engineering and curriculum / instructional design and development. Organization Development Consultant Intel Corporation / Corporate Training & Development March 1989  –  February 1990  (1 year) Chandler, Arizona One of 5 senior consultants supporting the corporation in organization development. Primarily responsible for supporting the Components Manufacturing businesses in efforts to increase manufacturing competitiveness through restructuring and the improvement of long-term human resource development strategies. Areas of specialization included; organization systems design, team development and team building, quality improvement methodologies and manufacturing competitiveness. Fab 4 Training & Development Manager Intel Corporation 1984  –  1987  (3 years) Aloha, Oregon Department manager for a wafer fabrication facility in Aloha Oregon. Responsible for the training and development of over 500 people including; managerial, technical, and direct labor personnel. Initiated a major shift toward a more systematic training methodology and an expansion of responsibility toward cost effective improvement of total factory performance involving all aspects of human resource development. Assisted in the development of the factory management team. Principal TREucker Training & Consulting July 2015  – Present (2 months) Ballston Lake, New York The sole proprietor of training and consulting firm.  \nProviding unique tailored consulting and custom seminars regarding effective leadership, organizational performance, learning and training strategies. \n Principal TREucker Training & Consulting July 2015  – Present (2 months) Ballston Lake, New York The sole proprietor of training and consulting firm.  \nProviding unique tailored consulting and custom seminars regarding effective leadership, organizational performance, learning and training strategies. \n Sr. Staff Organization Development Consultant GLOBALFOUNDRIES July 2014  –  July 2015  (1 year 1 month) Malta, New York Develop and deploy multi-tiered Leadership Development series for the site and globally. \nOngoing Organization Development support activities for the Malta site. Sr. Staff Organization Development Consultant GLOBALFOUNDRIES July 2014  –  July 2015  (1 year 1 month) Malta, New York Develop and deploy multi-tiered Leadership Development series for the site and globally. \nOngoing Organization Development support activities for the Malta site. Learning & Development Specialist GLOBALFOUNDRIES December 2010  –  July 2014  (3 years 8 months) Malta, New York Coordinated and program managed manufacturing factory systems training curriculum for factory startup. \nDelivered Learning Plans for all Fab 8 jobs to support factory start-up and audit activities. \nAs Interim Department manager supported direct reports and matrixed reports during transition to operations from HR. Learning & Development Specialist GLOBALFOUNDRIES December 2010  –  July 2014  (3 years 8 months) Malta, New York Coordinated and program managed manufacturing factory systems training curriculum for factory startup. \nDelivered Learning Plans for all Fab 8 jobs to support factory start-up and audit activities. \nAs Interim Department manager supported direct reports and matrixed reports during transition to operations from HR. Principal TREucker Training & Consulting November 2007  –  December 2010  (3 years 2 months) Beaverton, Oregon The sole proprietor of training and consulting firm.  \n\tProviding unique tailored consulting and custom seminars regarding effective performance, learning and training strategies. \n\tAn acclaimed associate of Clark Training & Consulting; delivering award winning seminars on performance analysis, training design and development to Fortune 100 companies. Principal TREucker Training & Consulting November 2007  –  December 2010  (3 years 2 months) Beaverton, Oregon The sole proprietor of training and consulting firm.  \n\tProviding unique tailored consulting and custom seminars regarding effective performance, learning and training strategies. \n\tAn acclaimed associate of Clark Training & Consulting; delivering award winning seminars on performance analysis, training design and development to Fortune 100 companies. Global Learning Manager Sourcecode July 2007  –  November 2007  (5 months) Malta, New York A key player in Business Process Management, K2 software has been improving business processes since 2000. Headquartered in Redmond Washington K2 is a primary Microsoft partner and holds an 8 percent share of the Windows-based BPMS market. \nInitially developed marketing collateral for innovative Business Process Management (BPM) software product launch before being asked to manage all aspects of internal personnel and customer learning for Sourcecode worldwide. \nIntroduced a basic strategy for Black Pearl® product training design and development and worked with regional training managers in support of deployment strategies. Global Learning Manager Sourcecode July 2007  –  November 2007  (5 months) Malta, New York A key player in Business Process Management, K2 software has been improving business processes since 2000. Headquartered in Redmond Washington K2 is a primary Microsoft partner and holds an 8 percent share of the Windows-based BPMS market. \nInitially developed marketing collateral for innovative Business Process Management (BPM) software product launch before being asked to manage all aspects of internal personnel and customer learning for Sourcecode worldwide. \nIntroduced a basic strategy for Black Pearl® product training design and development and worked with regional training managers in support of deployment strategies. Product Marketing Manager Sourcecode North America, Inc. May 2007  –  July 2007  (3 months) Beaverton, Oregon Responsible for worldwide K2 product marketing strategy and content with a focus on helping business executives understand the compelling advantage that the K2 platform can give their organization by creating dynamic business applications that automate and improve key business processes across the enterprise. Worked with software developers in generating the basic and advanced content related to Black Pearl® features and functions for use with Sourcecode field personnel and customers to support tight launch schedule. Product Marketing Manager Sourcecode North America, Inc. May 2007  –  July 2007  (3 months) Beaverton, Oregon Responsible for worldwide K2 product marketing strategy and content with a focus on helping business executives understand the compelling advantage that the K2 platform can give their organization by creating dynamic business applications that automate and improve key business processes across the enterprise. Worked with software developers in generating the basic and advanced content related to Black Pearl® features and functions for use with Sourcecode field personnel and customers to support tight launch schedule. Knowledge Strategist Intel Corporation January 2002  –  May 2007  (5 years 5 months) Chandler, Arizona Intel (NASDAQ: INTC) is a world leader in computing innovation. The company designs and builds the essential technologies that serve as the foundation for the world’s computing devices. \nOne of a team of Knowledge Strategists working with global manufacturing business units to craft knowledge strategies in support of business strategic objectives. \n\tIdentified, defined and developed innovative knowledge management capabilities resulting in reduced engineering process cycle time and increased visibility to the change control & management process. \n\tProvided leadership to a variety of knowledge management projects to improve working group productivity and reduce roadmap cycle times. Knowledge Strategist Intel Corporation January 2002  –  May 2007  (5 years 5 months) Chandler, Arizona Intel (NASDAQ: INTC) is a world leader in computing innovation. The company designs and builds the essential technologies that serve as the foundation for the world’s computing devices. \nOne of a team of Knowledge Strategists working with global manufacturing business units to craft knowledge strategies in support of business strategic objectives. \n\tIdentified, defined and developed innovative knowledge management capabilities resulting in reduced engineering process cycle time and increased visibility to the change control & management process. \n\tProvided leadership to a variety of knowledge management projects to improve working group productivity and reduce roadmap cycle times. Organization Effectiveness Specialist Intel Corporation / Business Practices & Services, Intel Communications Group September 2003  –  February 2005  (1 year 6 months) Chandler, Arizona Devised, promoted and deployed applications and methods for improved PDT (Product Development Team) collaboration effectiveness and knowledge management initiatives across the Intel Communications products division. \n\tCoordinated the application and deployment of a Microsoft SharePoint based Team Collaboration Tool (TCT) resulting in significant improvement in team communication.  \n\tAssessed and defined improved Program Management (PM) practices (including cross industry benchmarking) resulting in increased effectiveness and more focused development across Intel’s Communication Group. Organization Effectiveness Specialist Intel Corporation / Business Practices & Services, Intel Communications Group September 2003  –  February 2005  (1 year 6 months) Chandler, Arizona Devised, promoted and deployed applications and methods for improved PDT (Product Development Team) collaboration effectiveness and knowledge management initiatives across the Intel Communications products division. \n\tCoordinated the application and deployment of a Microsoft SharePoint based Team Collaboration Tool (TCT) resulting in significant improvement in team communication.  \n\tAssessed and defined improved Program Management (PM) practices (including cross industry benchmarking) resulting in increased effectiveness and more focused development across Intel’s Communication Group. Leadership Development Consultant Intel Corporation / TMG Training, Technology & Manufacturing Group September 1999  –  December 2001  (2 years 4 months) Chandler, Arizona Assigned to the TMG People Systems Group full time throughout 2000 and half time for 2001. Focused on the sharing of leadership development best practices and resources. Designed and coordinated a Leadership Developers Conference with 80 people in attendance to improve cross TMG networking and knowledge of leadership development activities. Additionally provided a variety of consulting services; including a world-wide people movement summit, corporate and TMG staffing organizations and annual TME Supplier Day. Leadership Development Consultant Intel Corporation / TMG Training, Technology & Manufacturing Group September 1999  –  December 2001  (2 years 4 months) Chandler, Arizona Assigned to the TMG People Systems Group full time throughout 2000 and half time for 2001. Focused on the sharing of leadership development best practices and resources. Designed and coordinated a Leadership Developers Conference with 80 people in attendance to improve cross TMG networking and knowledge of leadership development activities. Additionally provided a variety of consulting services; including a world-wide people movement summit, corporate and TMG staffing organizations and annual TME Supplier Day. Dean & Faculty Intel Corporation / College of Manufacturing, Technology & Manufacturing Group January 1995  –  September 1999  (4 years 9 months) Chandler, Arizona Provided the strategic vision and direction for the development of manufacturing science programs for professionals in Intel’s worldwide manufacturing organization and leadership to the dozen professionals of the College of Manufacturing.  \n\tDoubled the number and reach of manufacturing science programs accessible to Intel’s global manufacturing network while reducing resource costs by 50% and material costs by 75%. \n\tExpanded of the “suite” of programs including two additional versions of the award winning “Manufacturing 101” and “Engineering 101.” Showcased the MFG 101 program to MIT and partnered with Ford in the design of their version of the innovative immersive factory simulation. \n\tA key contributor to the development of first line manager curriculum development and exempt development strategies as a partner with the TMG People Systems Group. Dean & Faculty Intel Corporation / College of Manufacturing, Technology & Manufacturing Group January 1995  –  September 1999  (4 years 9 months) Chandler, Arizona Provided the strategic vision and direction for the development of manufacturing science programs for professionals in Intel’s worldwide manufacturing organization and leadership to the dozen professionals of the College of Manufacturing.  \n\tDoubled the number and reach of manufacturing science programs accessible to Intel’s global manufacturing network while reducing resource costs by 50% and material costs by 75%. \n\tExpanded of the “suite” of programs including two additional versions of the award winning “Manufacturing 101” and “Engineering 101.” Showcased the MFG 101 program to MIT and partnered with Ford in the design of their version of the innovative immersive factory simulation. \n\tA key contributor to the development of first line manager curriculum development and exempt development strategies as a partner with the TMG People Systems Group. Training & Development Manager Intel Corporation / A4/T11, Components Manufacturing February 1990  –  January 1995  (5 years) Chandler, Arizona Department manager for high volume / new technology assembly & test factory located in Chandler Arizona. Responsible for the training and development of over 700 personnel and related organizations in the factory. Managed a staff of 10 regular full time, plus 4 to 6 contract employees in organization development, human factors engineering and curriculum / instructional design and development. Training & Development Manager Intel Corporation / A4/T11, Components Manufacturing February 1990  –  January 1995  (5 years) Chandler, Arizona Department manager for high volume / new technology assembly & test factory located in Chandler Arizona. Responsible for the training and development of over 700 personnel and related organizations in the factory. Managed a staff of 10 regular full time, plus 4 to 6 contract employees in organization development, human factors engineering and curriculum / instructional design and development. Organization Development Consultant Intel Corporation / Corporate Training & Development March 1989  –  February 1990  (1 year) Chandler, Arizona One of 5 senior consultants supporting the corporation in organization development. Primarily responsible for supporting the Components Manufacturing businesses in efforts to increase manufacturing competitiveness through restructuring and the improvement of long-term human resource development strategies. Areas of specialization included; organization systems design, team development and team building, quality improvement methodologies and manufacturing competitiveness. Organization Development Consultant Intel Corporation / Corporate Training & Development March 1989  –  February 1990  (1 year) Chandler, Arizona One of 5 senior consultants supporting the corporation in organization development. Primarily responsible for supporting the Components Manufacturing businesses in efforts to increase manufacturing competitiveness through restructuring and the improvement of long-term human resource development strategies. Areas of specialization included; organization systems design, team development and team building, quality improvement methodologies and manufacturing competitiveness. Fab 4 Training & Development Manager Intel Corporation 1984  –  1987  (3 years) Aloha, Oregon Department manager for a wafer fabrication facility in Aloha Oregon. Responsible for the training and development of over 500 people including; managerial, technical, and direct labor personnel. Initiated a major shift toward a more systematic training methodology and an expansion of responsibility toward cost effective improvement of total factory performance involving all aspects of human resource development. Assisted in the development of the factory management team. Fab 4 Training & Development Manager Intel Corporation 1984  –  1987  (3 years) Aloha, Oregon Department manager for a wafer fabrication facility in Aloha Oregon. Responsible for the training and development of over 500 people including; managerial, technical, and direct labor personnel. Initiated a major shift toward a more systematic training methodology and an expansion of responsibility toward cost effective improvement of total factory performance involving all aspects of human resource development. Assisted in the development of the factory management team. Skills Business Process... Problem-based Learning Organizational... Leadership Development Knowledge Management Simulations Needs Analysis Instructor-led Training Instructional Design Program Management Organizational... Process Improvement Performance Management E-Learning Change Management Semiconductors Talent Management Succession Planning Project Management Learning Management... Training Learning Management Employee Training Management Cross-functional Team... Human Resources SharePoint Team Building Workforce Planning Analysis Performance Improvement Business Process Organizational Design Employee Engagement Training Delivery See 20+     See less Skills  Business Process... Problem-based Learning Organizational... Leadership Development Knowledge Management Simulations Needs Analysis Instructor-led Training Instructional Design Program Management Organizational... Process Improvement Performance Management E-Learning Change Management Semiconductors Talent Management Succession Planning Project Management Learning Management... Training Learning Management Employee Training Management Cross-functional Team... Human Resources SharePoint Team Building Workforce Planning Analysis Performance Improvement Business Process Organizational Design Employee Engagement Training Delivery See 20+     See less Business Process... Problem-based Learning Organizational... Leadership Development Knowledge Management Simulations Needs Analysis Instructor-led Training Instructional Design Program Management Organizational... Process Improvement Performance Management E-Learning Change Management Semiconductors Talent Management Succession Planning Project Management Learning Management... Training Learning Management Employee Training Management Cross-functional Team... Human Resources SharePoint Team Building Workforce Planning Analysis Performance Improvement Business Process Organizational Design Employee Engagement Training Delivery See 20+     See less Business Process... Problem-based Learning Organizational... Leadership Development Knowledge Management Simulations Needs Analysis Instructor-led Training Instructional Design Program Management Organizational... Process Improvement Performance Management E-Learning Change Management Semiconductors Talent Management Succession Planning Project Management Learning Management... Training Learning Management Employee Training Management Cross-functional Team... Human Resources SharePoint Team Building Workforce Planning Analysis Performance Improvement Business Process Organizational Design Employee Engagement Training Delivery See 20+     See less Education University of Southern California Doctor of Philosophy (Ph.D.),  Instructional Psychology 1979  – 1984 Linfield College Bachelor's Degree,  Psychology 1974  – 1978 University of Southern California Doctor of Philosophy (Ph.D.),  Instructional Psychology 1979  – 1984 University of Southern California Doctor of Philosophy (Ph.D.),  Instructional Psychology 1979  – 1984 University of Southern California Doctor of Philosophy (Ph.D.),  Instructional Psychology 1979  – 1984 Linfield College Bachelor's Degree,  Psychology 1974  – 1978 Linfield College Bachelor's Degree,  Psychology 1974  – 1978 Linfield College Bachelor's Degree,  Psychology 1974  – 1978 Honors & Awards ", "Experience Lead Sales Engineer Google January 2008  –  November 2009  (1 year 11 months) San Francisco Bay Area Google TV Ads Senior Technology Program Manager & Product Manager Google May 2005  –  November 2009  (4 years 7 months) San Francisco Bay Area Google Checkout and Google Base Co-Founder and CTO VentureLoop January 2000  –  May 2005  (5 years 5 months) San Francisco Bay Area Our products and services connect growth companies, talent, entrepreneurs and resources. We create long-term relationships with venture capital firms, entrepreneurial individuals and service providers to develop a valuable pool of relationship capital for our venture-backed customers. \n \nFor Job Seekers \nVentureLoop is the worldwide leader in job postings focused on venture-backed companies. Many of the job postings found on VentureLoop cannot be found on any other job board. SAP / IT Enterprise Architect Avanade April 2003  –  April 2005  (2 years 1 month) San Francisco Bay Area SAP R/3 Basis Consultant working on proposals for new work, helping to build the R/3 business practice, and working for the Department of Washington's SAP HRIS Implementation Co-Founder, President & CTO EndUse, Inc January 2000  –  February 2003  (3 years 2 months) San Francisco, CA B2B high-volume auction platform that leveraged our patented self-discounting auction format Founder / CEO Corporate Consulting Solutions June 1995  –  January 2000  (4 years 8 months) San Francisco Bay Area Developed SAP R/3 Data Loading and Regression Testing software module called \"DataWizard for R/3\" and licensed to Fortune 500 companies and IT Consulting Partners. \n \nConsulting and Services for all things SAP R/3 and Web/Internet related SAP Basis Consultant Intel Corporation 1996  –  2000  (4 years) SAP Basis Consultant Intel Corporation 1996  –  2000  (4 years) Senior Consultant Accenture May 1993  –  May 1995  (2 years 1 month) San Francisco Bay Area Systems Integration Consulting Lead Sales Engineer Google January 2008  –  November 2009  (1 year 11 months) San Francisco Bay Area Google TV Ads Lead Sales Engineer Google January 2008  –  November 2009  (1 year 11 months) San Francisco Bay Area Google TV Ads Senior Technology Program Manager & Product Manager Google May 2005  –  November 2009  (4 years 7 months) San Francisco Bay Area Google Checkout and Google Base Senior Technology Program Manager & Product Manager Google May 2005  –  November 2009  (4 years 7 months) San Francisco Bay Area Google Checkout and Google Base Co-Founder and CTO VentureLoop January 2000  –  May 2005  (5 years 5 months) San Francisco Bay Area Our products and services connect growth companies, talent, entrepreneurs and resources. We create long-term relationships with venture capital firms, entrepreneurial individuals and service providers to develop a valuable pool of relationship capital for our venture-backed customers. \n \nFor Job Seekers \nVentureLoop is the worldwide leader in job postings focused on venture-backed companies. Many of the job postings found on VentureLoop cannot be found on any other job board. Co-Founder and CTO VentureLoop January 2000  –  May 2005  (5 years 5 months) San Francisco Bay Area Our products and services connect growth companies, talent, entrepreneurs and resources. We create long-term relationships with venture capital firms, entrepreneurial individuals and service providers to develop a valuable pool of relationship capital for our venture-backed customers. \n \nFor Job Seekers \nVentureLoop is the worldwide leader in job postings focused on venture-backed companies. Many of the job postings found on VentureLoop cannot be found on any other job board. SAP / IT Enterprise Architect Avanade April 2003  –  April 2005  (2 years 1 month) San Francisco Bay Area SAP R/3 Basis Consultant working on proposals for new work, helping to build the R/3 business practice, and working for the Department of Washington's SAP HRIS Implementation SAP / IT Enterprise Architect Avanade April 2003  –  April 2005  (2 years 1 month) San Francisco Bay Area SAP R/3 Basis Consultant working on proposals for new work, helping to build the R/3 business practice, and working for the Department of Washington's SAP HRIS Implementation Co-Founder, President & CTO EndUse, Inc January 2000  –  February 2003  (3 years 2 months) San Francisco, CA B2B high-volume auction platform that leveraged our patented self-discounting auction format Co-Founder, President & CTO EndUse, Inc January 2000  –  February 2003  (3 years 2 months) San Francisco, CA B2B high-volume auction platform that leveraged our patented self-discounting auction format Founder / CEO Corporate Consulting Solutions June 1995  –  January 2000  (4 years 8 months) San Francisco Bay Area Developed SAP R/3 Data Loading and Regression Testing software module called \"DataWizard for R/3\" and licensed to Fortune 500 companies and IT Consulting Partners. \n \nConsulting and Services for all things SAP R/3 and Web/Internet related Founder / CEO Corporate Consulting Solutions June 1995  –  January 2000  (4 years 8 months) San Francisco Bay Area Developed SAP R/3 Data Loading and Regression Testing software module called \"DataWizard for R/3\" and licensed to Fortune 500 companies and IT Consulting Partners. \n \nConsulting and Services for all things SAP R/3 and Web/Internet related SAP Basis Consultant Intel Corporation 1996  –  2000  (4 years) SAP Basis Consultant Intel Corporation 1996  –  2000  (4 years) SAP Basis Consultant Intel Corporation 1996  –  2000  (4 years) SAP Basis Consultant Intel Corporation 1996  –  2000  (4 years) Senior Consultant Accenture May 1993  –  May 1995  (2 years 1 month) San Francisco Bay Area Systems Integration Consulting Senior Consultant Accenture May 1993  –  May 1995  (2 years 1 month) San Francisco Bay Area Systems Integration Consulting Skills System Architecture Product Development Product Management Software Engineering PHP MySQL Apache CentOS Linux Facebook API REST Management Team Leadership Mentoring Skills  System Architecture Product Development Product Management Software Engineering PHP MySQL Apache CentOS Linux Facebook API REST Management Team Leadership Mentoring System Architecture Product Development Product Management Software Engineering PHP MySQL Apache CentOS Linux Facebook API REST Management Team Leadership Mentoring System Architecture Product Development Product Management Software Engineering PHP MySQL Apache CentOS Linux Facebook API REST Management Team Leadership Mentoring Education University of Pennsylvania - The Wharton School MBA,  Finance ,  Real Estate 2003  – 2005 Santa Clara University BSEE,  Electrical Engineering University of Pennsylvania - The Wharton School MBA,  Finance ,  Real Estate 2003  – 2005 University of Pennsylvania - The Wharton School MBA,  Finance ,  Real Estate 2003  – 2005 University of Pennsylvania - The Wharton School MBA,  Finance ,  Real Estate 2003  – 2005 Santa Clara University BSEE,  Electrical Engineering Santa Clara University BSEE,  Electrical Engineering Santa Clara University BSEE,  Electrical Engineering ", "Skills College Recruiting Technical Recruiting Applicant Tracking... Workforce Planning Talent Acquisition Recruiting Sourcing Human Resources Onboarding Internet Recruiting Temporary Placement Organizational... Employee Training PeopleSoft Screening Recruitment Advertising Employee Relations Taleo Talent Management Contract Recruitment Training Benefits Negotiation Employer Branding Resume Writing Executive Search HR Policies Succession Planning Management Screening Resumes HRIS Interviews Employee Engagement Deferred Compensation See 18+     See less Skills  College Recruiting Technical Recruiting Applicant Tracking... Workforce Planning Talent Acquisition Recruiting Sourcing Human Resources Onboarding Internet Recruiting Temporary Placement Organizational... Employee Training PeopleSoft Screening Recruitment Advertising Employee Relations Taleo Talent Management Contract Recruitment Training Benefits Negotiation Employer Branding Resume Writing Executive Search HR Policies Succession Planning Management Screening Resumes HRIS Interviews Employee Engagement Deferred Compensation See 18+     See less College Recruiting Technical Recruiting Applicant Tracking... Workforce Planning Talent Acquisition Recruiting Sourcing Human Resources Onboarding Internet Recruiting Temporary Placement Organizational... Employee Training PeopleSoft Screening Recruitment Advertising Employee Relations Taleo Talent Management Contract Recruitment Training Benefits Negotiation Employer Branding Resume Writing Executive Search HR Policies Succession Planning Management Screening Resumes HRIS Interviews Employee Engagement Deferred Compensation See 18+     See less College Recruiting Technical Recruiting Applicant Tracking... Workforce Planning Talent Acquisition Recruiting Sourcing Human Resources Onboarding Internet Recruiting Temporary Placement Organizational... Employee Training PeopleSoft Screening Recruitment Advertising Employee Relations Taleo Talent Management Contract Recruitment Training Benefits Negotiation Employer Branding Resume Writing Executive Search HR Policies Succession Planning Management Screening Resumes HRIS Interviews Employee Engagement Deferred Compensation See 18+     See less ", "Summary I am a motivated and enthusiastic Analogue / Mixed Signal / RF Custom IC Layout Design engineer with 13 + years experience with thorough understanding of Analogue/Mixed/RF Signal IC Layout design methodologies for deep sub-micron processes and Verification, having worked in aggressive schedules on IC Layout development. \n \nI provide IC Layout Design Services for Analog/Mixed Signal/RF layout on short term and long term projects both onsite and offsite anywhere within the European Union. \n \nI am a British Citizen and I DO NOT require a work permit to work anywhere in EU. \n \nLayout Expertise: \nFull Custom Layout and verification ranging from Full Chip Layout design to Very High Speed and Low Power Designs in Deep Sub Micron Processes. \nBlock level implementation and verification on SERDES Macros, RX, TX, PLLs, Charge pump, LDOs, VREG, DAB, DAB3, Dividers, PFD, synthesizer, Various types of I/O Pads, I/O Rings, Low Capacitive and High Current Input Termination Blocks, VCOs, Mixers, ADCs, DACs, Low Pass Filters, Comparators, Single and Double ended Amplifiers, Bias Blocks, Reference Blocks, Equalizers, Current Mirrors and Voltage Regulators. \n \nTool Expertise: \nFull Chip and Block Level, IP Layout - Cadence Virtuoso Layout, Cadence Virtuoso Layout XL. \nLVS (Layout Versus Schematic Verification) - K2ver, Calibre, Assura, Hercules, PVS.  \nDRC (Design Rule Check) - K2ver, Calibre, Assura, Hercules, PVS. \nParasitic Layout Extraction - Calibre, Assura, Hercules Star RC-XT \nTapeout QC checks - Compat Mega, DFM, Density, Antenna/NAC, Long Metal 1, TFC(Thin Film Check).  \nVersion Control Software for Cadence Database - Synchronicity, Clear case. \n \nTechnology Expertise: \nTI - 65nm, 0.15um \nTSMC - 28nm, 40nm, 55nm, 65nm, 90nm, 0.13um, 0.18um. \nINTEL - 0.13um \nSamsung - 28nm \nGlobal Foundries - 65nm, 40nm \nSSMC - 0.14um \n \nSpecialties:  \nLayout design using Cadence and Open access tools. \nRF/High speed analog layout design \nMixed signal layout design \nI/O layout design \nPower management Layout \nIP Layout Summary I am a motivated and enthusiastic Analogue / Mixed Signal / RF Custom IC Layout Design engineer with 13 + years experience with thorough understanding of Analogue/Mixed/RF Signal IC Layout design methodologies for deep sub-micron processes and Verification, having worked in aggressive schedules on IC Layout development. \n \nI provide IC Layout Design Services for Analog/Mixed Signal/RF layout on short term and long term projects both onsite and offsite anywhere within the European Union. \n \nI am a British Citizen and I DO NOT require a work permit to work anywhere in EU. \n \nLayout Expertise: \nFull Custom Layout and verification ranging from Full Chip Layout design to Very High Speed and Low Power Designs in Deep Sub Micron Processes. \nBlock level implementation and verification on SERDES Macros, RX, TX, PLLs, Charge pump, LDOs, VREG, DAB, DAB3, Dividers, PFD, synthesizer, Various types of I/O Pads, I/O Rings, Low Capacitive and High Current Input Termination Blocks, VCOs, Mixers, ADCs, DACs, Low Pass Filters, Comparators, Single and Double ended Amplifiers, Bias Blocks, Reference Blocks, Equalizers, Current Mirrors and Voltage Regulators. \n \nTool Expertise: \nFull Chip and Block Level, IP Layout - Cadence Virtuoso Layout, Cadence Virtuoso Layout XL. \nLVS (Layout Versus Schematic Verification) - K2ver, Calibre, Assura, Hercules, PVS.  \nDRC (Design Rule Check) - K2ver, Calibre, Assura, Hercules, PVS. \nParasitic Layout Extraction - Calibre, Assura, Hercules Star RC-XT \nTapeout QC checks - Compat Mega, DFM, Density, Antenna/NAC, Long Metal 1, TFC(Thin Film Check).  \nVersion Control Software for Cadence Database - Synchronicity, Clear case. \n \nTechnology Expertise: \nTI - 65nm, 0.15um \nTSMC - 28nm, 40nm, 55nm, 65nm, 90nm, 0.13um, 0.18um. \nINTEL - 0.13um \nSamsung - 28nm \nGlobal Foundries - 65nm, 40nm \nSSMC - 0.14um \n \nSpecialties:  \nLayout design using Cadence and Open access tools. \nRF/High speed analog layout design \nMixed signal layout design \nI/O layout design \nPower management Layout \nIP Layout I am a motivated and enthusiastic Analogue / Mixed Signal / RF Custom IC Layout Design engineer with 13 + years experience with thorough understanding of Analogue/Mixed/RF Signal IC Layout design methodologies for deep sub-micron processes and Verification, having worked in aggressive schedules on IC Layout development. \n \nI provide IC Layout Design Services for Analog/Mixed Signal/RF layout on short term and long term projects both onsite and offsite anywhere within the European Union. \n \nI am a British Citizen and I DO NOT require a work permit to work anywhere in EU. \n \nLayout Expertise: \nFull Custom Layout and verification ranging from Full Chip Layout design to Very High Speed and Low Power Designs in Deep Sub Micron Processes. \nBlock level implementation and verification on SERDES Macros, RX, TX, PLLs, Charge pump, LDOs, VREG, DAB, DAB3, Dividers, PFD, synthesizer, Various types of I/O Pads, I/O Rings, Low Capacitive and High Current Input Termination Blocks, VCOs, Mixers, ADCs, DACs, Low Pass Filters, Comparators, Single and Double ended Amplifiers, Bias Blocks, Reference Blocks, Equalizers, Current Mirrors and Voltage Regulators. \n \nTool Expertise: \nFull Chip and Block Level, IP Layout - Cadence Virtuoso Layout, Cadence Virtuoso Layout XL. \nLVS (Layout Versus Schematic Verification) - K2ver, Calibre, Assura, Hercules, PVS.  \nDRC (Design Rule Check) - K2ver, Calibre, Assura, Hercules, PVS. \nParasitic Layout Extraction - Calibre, Assura, Hercules Star RC-XT \nTapeout QC checks - Compat Mega, DFM, Density, Antenna/NAC, Long Metal 1, TFC(Thin Film Check).  \nVersion Control Software for Cadence Database - Synchronicity, Clear case. \n \nTechnology Expertise: \nTI - 65nm, 0.15um \nTSMC - 28nm, 40nm, 55nm, 65nm, 90nm, 0.13um, 0.18um. \nINTEL - 0.13um \nSamsung - 28nm \nGlobal Foundries - 65nm, 40nm \nSSMC - 0.14um \n \nSpecialties:  \nLayout design using Cadence and Open access tools. \nRF/High speed analog layout design \nMixed signal layout design \nI/O layout design \nPower management Layout \nIP Layout I am a motivated and enthusiastic Analogue / Mixed Signal / RF Custom IC Layout Design engineer with 13 + years experience with thorough understanding of Analogue/Mixed/RF Signal IC Layout design methodologies for deep sub-micron processes and Verification, having worked in aggressive schedules on IC Layout development. \n \nI provide IC Layout Design Services for Analog/Mixed Signal/RF layout on short term and long term projects both onsite and offsite anywhere within the European Union. \n \nI am a British Citizen and I DO NOT require a work permit to work anywhere in EU. \n \nLayout Expertise: \nFull Custom Layout and verification ranging from Full Chip Layout design to Very High Speed and Low Power Designs in Deep Sub Micron Processes. \nBlock level implementation and verification on SERDES Macros, RX, TX, PLLs, Charge pump, LDOs, VREG, DAB, DAB3, Dividers, PFD, synthesizer, Various types of I/O Pads, I/O Rings, Low Capacitive and High Current Input Termination Blocks, VCOs, Mixers, ADCs, DACs, Low Pass Filters, Comparators, Single and Double ended Amplifiers, Bias Blocks, Reference Blocks, Equalizers, Current Mirrors and Voltage Regulators. \n \nTool Expertise: \nFull Chip and Block Level, IP Layout - Cadence Virtuoso Layout, Cadence Virtuoso Layout XL. \nLVS (Layout Versus Schematic Verification) - K2ver, Calibre, Assura, Hercules, PVS.  \nDRC (Design Rule Check) - K2ver, Calibre, Assura, Hercules, PVS. \nParasitic Layout Extraction - Calibre, Assura, Hercules Star RC-XT \nTapeout QC checks - Compat Mega, DFM, Density, Antenna/NAC, Long Metal 1, TFC(Thin Film Check).  \nVersion Control Software for Cadence Database - Synchronicity, Clear case. \n \nTechnology Expertise: \nTI - 65nm, 0.15um \nTSMC - 28nm, 40nm, 55nm, 65nm, 90nm, 0.13um, 0.18um. \nINTEL - 0.13um \nSamsung - 28nm \nGlobal Foundries - 65nm, 40nm \nSSMC - 0.14um \n \nSpecialties:  \nLayout design using Cadence and Open access tools. \nRF/High speed analog layout design \nMixed signal layout design \nI/O layout design \nPower management Layout \nIP Layout Experience RF/Mixed Signal IC Layout Consultant Intel Corporation November 2014  – Present (10 months) Northampton, United Kingdom - Layout design of high speed RF blocks like ADCs and TX for a Flip chip in Deep Sub-micron Intel flavored TSMC 65nm Process.  \n- Layout design of DCDC block in PMU for a Flip chip in Deep Sub-micron Intel flavored TSMC 28nm Process. \n- Complete Verification (LVS/DRC) of design using Calibre verification tools. \n- Tapeout QC checks like Antenna, Density, ERC, ESDNET using Calibre tools. \n- Version control of Open access database using Clearcase. \n RF IC Layout Engineer Kandou Bus S.A. August 2014  –  October 2014  (3 months) Northampton, United Kingdom - Layout design of RF LCPLL working at 7GHz in a Serdes macro working at 28GBPS using Cadence Open access and Virtuoso XL in 28nm TSMC Technology Processes. \n- Complete verification (LVS/DRC/Antenna/ ERC) of blocks using PVS verification tools. \n- Version control of Open access database using IC Manage Design management system. Analog IC Layout Consultant NXP Semiconductors May 2014  –  July 2014  (3 months) Graz-Gratkorn - Layout design of various Analog and Mixed-Signal modules like ClassD Common Highside and Lowside, PA, TX in Automotive projects using Cadence Open access and Virtuoso XL in A-BCD9 FD-SOI 0.14um and CMOS14 0.14um SSMC Technology Processes. \n- Complete verification (LVS/DRC/Antenna/DRC_HV/ERC) of blocks using PVS verification tools. \n- Version control of Open access database using DesignSync Design management system. \n- Version control of Open access database using DesignSync Design management system. \n- Task management using Collabnet and Scrum softwares. RF IC Layout Consultant Samsung Electronics March 2014  –  April 2014  (2 months) Stockholm, Sweden - Layout design of various RF and Mixed-Signal Modules like prescaler, rfpll and various regulators, LDOs using Cadence Open access and Virtuoso XL in Deep Sub-micron Global Foundaries 65nm Process. \n- Complete Verification (LVS/DRC/Antenna/ERC) of block and Chip layouts using PVS verification tools. \n- Version control of Open access database using SOS Design management system. RF IC Layout Consultant Dialog Semiconductor September 2013  –  February 2014  (6 months) 's-Hertogenbosch, Netherlands - Layout design of various Analog Mixed-Signal Modules, RF pads and Test structures by using Cadence Open access and Virtuoso XL in Deep Sub-micron TSMC 55nm Process. \n- Providing support and co-ordination on Radio layout for the project between various sites. \n- Complete Verification (LVS/DRC/Antenna/ERC) of Layout using Calibre verification tools. \n- Perform Layout reviews on various modules and identifying potential problems. \n- Version control of Open access database using Synchronicity. RF/Mixed Signal IC Layout Consultant NXP Semiconductors July 2013  –  September 2013  (3 months) Hamburg Area, Germany - Layout design of various Modules and Analog core in a chip which is part of the Car Entertainment System by using Virtuoso XL and Cadence in Deep Sub-micron 65nm TSMC Process using NXP methodology. \n- Layout design and co-ordination for Top level chip layout and modules like LDOs, VREG, DABL and DAB3. \n- Complete Verification (LVS/DRC) of Layout using PVS verification tool. \n- Tapeout QC checks like Antenna and ERC. \n- Version control of Cadence database using Synchronicity. \n- DFM layout checks of modules and identifying potential problems. RF/Mixed Signal IC Layout Consultant Kisel Microelectronics AB March 2013  –  June 2013  (4 months) Stockholm, Sweden - Layout design of Wifi IP which include various blocks like Op-Amps, PLL, Bias blocks, LDOs, Charge pump, Dividers, PFD, synthesizer, TX etc by using Virtuoso XL and Cadence Open Access. \n- Layout design of various blocks of Wifi IP in Deep Sub-micron 65nm TSMC.  \n- Layout design of various blocks in TX of Wifi IP in Deep Sub-micron 40nm Global Foundries process.  \n- Complete Verification (LVS/DRC) of Layout using verification tools like Calibre, PVS and Assura. \n- Tapeout QC checks like Antenna and ERC. Analog-Mixed Signal IC Layout Consultant Samsung Electronics December 2012  –  March 2013  (4 months) Stockholm, Sweden - Layout design of power management part of the chip which include various blocks like Reference Bias, Pwm, Current Mirrors, Current Reference, Various types of LDOs etc by using Virtuoso XL and Cadence Open Access. \n- Layout design of power management blocks in Deep Sub-micron 28nm Samsung Process. \n- Layout design of LDOs in 65nm Global Foundry Process. \n- Complete Verification (LVS/DRC) of design using verification tools like PVS and Assura. \n- Tapeout QC checks like Antenna and ERC. RF/Mixed Signal IC Layout Design Consultant Intel Corporation April 2012  –  November 2012  (8 months) Munich Area, Germany - Layout design of analog I/O Pads which include various blocks like RX, TX, Voltage Reference, Current Mirrors, Current Reference, Reference pads for Wirebond chips working at high frequencies using Virtuoso, Virtuoso XL and Cadence Open Access. \n- Layout design of IPs (Low Power TX and High Speed TX) in Deep Sub-micron 28nm TSMC Process. \n- Worked on various types of I/O pads for Wirebond Chips. \n- Layout design of PLL working at frequency of 3.2GHz in 65nm TSMC Process for a Flip Chip Project. \n- Complete Verification (LVS/DRC) of design using verification tools like Calibre. \n- Tapeout QC checks like Antenna, Density, ERC, ESDNET. \n- Parasitic layout netlist extraction using Assura and Calibre. \n- Version control of Open access database using Synchronicity. RF/Mixed Signal IC Layout Design Engineer Texas Instruments Ltd October 2005  –  January 2012  (6 years 4 months) Northampton, United Kingdom - Layout design of analog Serializers and DeSerializers comprising complex Transmitters, PLLs and \nReceivers working at very high frequencies using Virtuoso, Virtuoso XL and Open Access. \n- Layout design of Low Capacitive and High Current Input termination blocks in Transmitters and Receivers and design of IPs in various technology processes from 90nm to 28nm from TI and TSMC foundries. \n- Responsible for driving layouts for major blocks and macros from floorplan to release for Tapeout. \n- Worked on macro designs in Flip chip and Wire bond configurations. \n- Complete Verification (LVS/DRC) of designs using tools like K2ver, Calibre, Assura, Hercules, PVS. \n- Tapeout QC checks like Antenna, Density, DFM and Compat Mega. \n- Implemented various methodologies in building re-usable IPs and macros for creating quick variants. \n- Good understanding of design issues related to the small geometries in DSM processes like 28nm. \n- Version control of Cadence and Open access database using Clearcase. RF/Analog - Mixed Signal IC Layout Engineer Intel Technology India Pvt Ltd May 2004  –  October 2005  (1 year 6 months) Bengaluru Area, India - Layout design of complex Analogue/Mixed signal chips working at very high frequency such as ADC, SSB and PLL, Voltage Regulators, Oscillator including floor planning, design and release of the Full Chip database for Tapeouts in Intel’s 0.13um Technology using Virtuoso and Virtuoso XL. \n- Responsible for driving full chip design from floorplan to release for Tapeout. \n- Verification (LVS/DRC) of the design blocks using tools such as Hercules and Assura. \n- Implementing Best Known Methods and DFM Techniques for better yield and design time reduction. \n- Tapeout QC checks such as NAC (Node Area Check)/Antenna, Long Metal1 (DFM), TFC (Thin Film \nCracking), Density and Grid Error Checks. \n- Parasitic layout netlist extraction using Assura (Cadence) and Star RC – XT (Hercules). \n- Version control of Cadence database using Synchronicity. \n- Trained the team members in DFM techniques and performed layout peer reviews. \n- Responsible for training a new member of the team on INTEL’s process technologies and tools. Analog - Mixed Signal IC Layout Engineer Sasken Communication Technologies Ltd November 2002  –  May 2004  (1 year 7 months) Bengaluru Area, India Worked at a client place by name ATI Technologies Inc (Now part of AMD), located in Toronto, CANADA \n \n- Layout design of complex Analogue/Mixed signal blocks such as PLL, VCO, Calibration Blocks, VI Converter, Bias Circuits, Current Mirrors, Reference blocks, Comparators, Amplifiers (Single ended and Double ended output), various kinds of I/Os and I/O Rings for the Video Graphics chips \n- Verification (DRC, LVS) of the design blocks using Calibre and Assura. \n- Tapeout QC checks such as Antenna, TFC (Thin Film Cracking), Density. \n- Completed 6 successful tapeouts on aggressive timelines in TSMC processes from 0.18um to 90nm. Mixed Signal IC Layout Engineer Advanced Micronic Devices Ltd November 2001  –  October 2002  (1 year) Bengaluru Area, India Worked at a client place by name Texas Instruments, located in Bangalore, INDIA. \n \n- Layout design of complex Analogue/Mixed signal blocks such as Reference System, Equalizer LPF(Low Pass Filter), and IV Converter, including various kinds of Comparators, Amplifiers (Single ended and Double ended output),Bias Circuits in 0.15um TI technology process. \n- Verification (DRC, LVS) of the design Blocks using K2Ver and Assura. \n- Tapeout QC checks like Antenna and CLEO (Checker for Latchup and ESD). \n- Parasitic layout netlist extraction using Assura. RF/Mixed Signal IC Layout Consultant Intel Corporation November 2014  – Present (10 months) Northampton, United Kingdom - Layout design of high speed RF blocks like ADCs and TX for a Flip chip in Deep Sub-micron Intel flavored TSMC 65nm Process.  \n- Layout design of DCDC block in PMU for a Flip chip in Deep Sub-micron Intel flavored TSMC 28nm Process. \n- Complete Verification (LVS/DRC) of design using Calibre verification tools. \n- Tapeout QC checks like Antenna, Density, ERC, ESDNET using Calibre tools. \n- Version control of Open access database using Clearcase. \n RF/Mixed Signal IC Layout Consultant Intel Corporation November 2014  – Present (10 months) Northampton, United Kingdom - Layout design of high speed RF blocks like ADCs and TX for a Flip chip in Deep Sub-micron Intel flavored TSMC 65nm Process.  \n- Layout design of DCDC block in PMU for a Flip chip in Deep Sub-micron Intel flavored TSMC 28nm Process. \n- Complete Verification (LVS/DRC) of design using Calibre verification tools. \n- Tapeout QC checks like Antenna, Density, ERC, ESDNET using Calibre tools. \n- Version control of Open access database using Clearcase. \n RF IC Layout Engineer Kandou Bus S.A. August 2014  –  October 2014  (3 months) Northampton, United Kingdom - Layout design of RF LCPLL working at 7GHz in a Serdes macro working at 28GBPS using Cadence Open access and Virtuoso XL in 28nm TSMC Technology Processes. \n- Complete verification (LVS/DRC/Antenna/ ERC) of blocks using PVS verification tools. \n- Version control of Open access database using IC Manage Design management system. RF IC Layout Engineer Kandou Bus S.A. August 2014  –  October 2014  (3 months) Northampton, United Kingdom - Layout design of RF LCPLL working at 7GHz in a Serdes macro working at 28GBPS using Cadence Open access and Virtuoso XL in 28nm TSMC Technology Processes. \n- Complete verification (LVS/DRC/Antenna/ ERC) of blocks using PVS verification tools. \n- Version control of Open access database using IC Manage Design management system. Analog IC Layout Consultant NXP Semiconductors May 2014  –  July 2014  (3 months) Graz-Gratkorn - Layout design of various Analog and Mixed-Signal modules like ClassD Common Highside and Lowside, PA, TX in Automotive projects using Cadence Open access and Virtuoso XL in A-BCD9 FD-SOI 0.14um and CMOS14 0.14um SSMC Technology Processes. \n- Complete verification (LVS/DRC/Antenna/DRC_HV/ERC) of blocks using PVS verification tools. \n- Version control of Open access database using DesignSync Design management system. \n- Version control of Open access database using DesignSync Design management system. \n- Task management using Collabnet and Scrum softwares. Analog IC Layout Consultant NXP Semiconductors May 2014  –  July 2014  (3 months) Graz-Gratkorn - Layout design of various Analog and Mixed-Signal modules like ClassD Common Highside and Lowside, PA, TX in Automotive projects using Cadence Open access and Virtuoso XL in A-BCD9 FD-SOI 0.14um and CMOS14 0.14um SSMC Technology Processes. \n- Complete verification (LVS/DRC/Antenna/DRC_HV/ERC) of blocks using PVS verification tools. \n- Version control of Open access database using DesignSync Design management system. \n- Version control of Open access database using DesignSync Design management system. \n- Task management using Collabnet and Scrum softwares. RF IC Layout Consultant Samsung Electronics March 2014  –  April 2014  (2 months) Stockholm, Sweden - Layout design of various RF and Mixed-Signal Modules like prescaler, rfpll and various regulators, LDOs using Cadence Open access and Virtuoso XL in Deep Sub-micron Global Foundaries 65nm Process. \n- Complete Verification (LVS/DRC/Antenna/ERC) of block and Chip layouts using PVS verification tools. \n- Version control of Open access database using SOS Design management system. RF IC Layout Consultant Samsung Electronics March 2014  –  April 2014  (2 months) Stockholm, Sweden - Layout design of various RF and Mixed-Signal Modules like prescaler, rfpll and various regulators, LDOs using Cadence Open access and Virtuoso XL in Deep Sub-micron Global Foundaries 65nm Process. \n- Complete Verification (LVS/DRC/Antenna/ERC) of block and Chip layouts using PVS verification tools. \n- Version control of Open access database using SOS Design management system. RF IC Layout Consultant Dialog Semiconductor September 2013  –  February 2014  (6 months) 's-Hertogenbosch, Netherlands - Layout design of various Analog Mixed-Signal Modules, RF pads and Test structures by using Cadence Open access and Virtuoso XL in Deep Sub-micron TSMC 55nm Process. \n- Providing support and co-ordination on Radio layout for the project between various sites. \n- Complete Verification (LVS/DRC/Antenna/ERC) of Layout using Calibre verification tools. \n- Perform Layout reviews on various modules and identifying potential problems. \n- Version control of Open access database using Synchronicity. RF IC Layout Consultant Dialog Semiconductor September 2013  –  February 2014  (6 months) 's-Hertogenbosch, Netherlands - Layout design of various Analog Mixed-Signal Modules, RF pads and Test structures by using Cadence Open access and Virtuoso XL in Deep Sub-micron TSMC 55nm Process. \n- Providing support and co-ordination on Radio layout for the project between various sites. \n- Complete Verification (LVS/DRC/Antenna/ERC) of Layout using Calibre verification tools. \n- Perform Layout reviews on various modules and identifying potential problems. \n- Version control of Open access database using Synchronicity. RF/Mixed Signal IC Layout Consultant NXP Semiconductors July 2013  –  September 2013  (3 months) Hamburg Area, Germany - Layout design of various Modules and Analog core in a chip which is part of the Car Entertainment System by using Virtuoso XL and Cadence in Deep Sub-micron 65nm TSMC Process using NXP methodology. \n- Layout design and co-ordination for Top level chip layout and modules like LDOs, VREG, DABL and DAB3. \n- Complete Verification (LVS/DRC) of Layout using PVS verification tool. \n- Tapeout QC checks like Antenna and ERC. \n- Version control of Cadence database using Synchronicity. \n- DFM layout checks of modules and identifying potential problems. RF/Mixed Signal IC Layout Consultant NXP Semiconductors July 2013  –  September 2013  (3 months) Hamburg Area, Germany - Layout design of various Modules and Analog core in a chip which is part of the Car Entertainment System by using Virtuoso XL and Cadence in Deep Sub-micron 65nm TSMC Process using NXP methodology. \n- Layout design and co-ordination for Top level chip layout and modules like LDOs, VREG, DABL and DAB3. \n- Complete Verification (LVS/DRC) of Layout using PVS verification tool. \n- Tapeout QC checks like Antenna and ERC. \n- Version control of Cadence database using Synchronicity. \n- DFM layout checks of modules and identifying potential problems. RF/Mixed Signal IC Layout Consultant Kisel Microelectronics AB March 2013  –  June 2013  (4 months) Stockholm, Sweden - Layout design of Wifi IP which include various blocks like Op-Amps, PLL, Bias blocks, LDOs, Charge pump, Dividers, PFD, synthesizer, TX etc by using Virtuoso XL and Cadence Open Access. \n- Layout design of various blocks of Wifi IP in Deep Sub-micron 65nm TSMC.  \n- Layout design of various blocks in TX of Wifi IP in Deep Sub-micron 40nm Global Foundries process.  \n- Complete Verification (LVS/DRC) of Layout using verification tools like Calibre, PVS and Assura. \n- Tapeout QC checks like Antenna and ERC. RF/Mixed Signal IC Layout Consultant Kisel Microelectronics AB March 2013  –  June 2013  (4 months) Stockholm, Sweden - Layout design of Wifi IP which include various blocks like Op-Amps, PLL, Bias blocks, LDOs, Charge pump, Dividers, PFD, synthesizer, TX etc by using Virtuoso XL and Cadence Open Access. \n- Layout design of various blocks of Wifi IP in Deep Sub-micron 65nm TSMC.  \n- Layout design of various blocks in TX of Wifi IP in Deep Sub-micron 40nm Global Foundries process.  \n- Complete Verification (LVS/DRC) of Layout using verification tools like Calibre, PVS and Assura. \n- Tapeout QC checks like Antenna and ERC. Analog-Mixed Signal IC Layout Consultant Samsung Electronics December 2012  –  March 2013  (4 months) Stockholm, Sweden - Layout design of power management part of the chip which include various blocks like Reference Bias, Pwm, Current Mirrors, Current Reference, Various types of LDOs etc by using Virtuoso XL and Cadence Open Access. \n- Layout design of power management blocks in Deep Sub-micron 28nm Samsung Process. \n- Layout design of LDOs in 65nm Global Foundry Process. \n- Complete Verification (LVS/DRC) of design using verification tools like PVS and Assura. \n- Tapeout QC checks like Antenna and ERC. Analog-Mixed Signal IC Layout Consultant Samsung Electronics December 2012  –  March 2013  (4 months) Stockholm, Sweden - Layout design of power management part of the chip which include various blocks like Reference Bias, Pwm, Current Mirrors, Current Reference, Various types of LDOs etc by using Virtuoso XL and Cadence Open Access. \n- Layout design of power management blocks in Deep Sub-micron 28nm Samsung Process. \n- Layout design of LDOs in 65nm Global Foundry Process. \n- Complete Verification (LVS/DRC) of design using verification tools like PVS and Assura. \n- Tapeout QC checks like Antenna and ERC. RF/Mixed Signal IC Layout Design Consultant Intel Corporation April 2012  –  November 2012  (8 months) Munich Area, Germany - Layout design of analog I/O Pads which include various blocks like RX, TX, Voltage Reference, Current Mirrors, Current Reference, Reference pads for Wirebond chips working at high frequencies using Virtuoso, Virtuoso XL and Cadence Open Access. \n- Layout design of IPs (Low Power TX and High Speed TX) in Deep Sub-micron 28nm TSMC Process. \n- Worked on various types of I/O pads for Wirebond Chips. \n- Layout design of PLL working at frequency of 3.2GHz in 65nm TSMC Process for a Flip Chip Project. \n- Complete Verification (LVS/DRC) of design using verification tools like Calibre. \n- Tapeout QC checks like Antenna, Density, ERC, ESDNET. \n- Parasitic layout netlist extraction using Assura and Calibre. \n- Version control of Open access database using Synchronicity. RF/Mixed Signal IC Layout Design Consultant Intel Corporation April 2012  –  November 2012  (8 months) Munich Area, Germany - Layout design of analog I/O Pads which include various blocks like RX, TX, Voltage Reference, Current Mirrors, Current Reference, Reference pads for Wirebond chips working at high frequencies using Virtuoso, Virtuoso XL and Cadence Open Access. \n- Layout design of IPs (Low Power TX and High Speed TX) in Deep Sub-micron 28nm TSMC Process. \n- Worked on various types of I/O pads for Wirebond Chips. \n- Layout design of PLL working at frequency of 3.2GHz in 65nm TSMC Process for a Flip Chip Project. \n- Complete Verification (LVS/DRC) of design using verification tools like Calibre. \n- Tapeout QC checks like Antenna, Density, ERC, ESDNET. \n- Parasitic layout netlist extraction using Assura and Calibre. \n- Version control of Open access database using Synchronicity. RF/Mixed Signal IC Layout Design Engineer Texas Instruments Ltd October 2005  –  January 2012  (6 years 4 months) Northampton, United Kingdom - Layout design of analog Serializers and DeSerializers comprising complex Transmitters, PLLs and \nReceivers working at very high frequencies using Virtuoso, Virtuoso XL and Open Access. \n- Layout design of Low Capacitive and High Current Input termination blocks in Transmitters and Receivers and design of IPs in various technology processes from 90nm to 28nm from TI and TSMC foundries. \n- Responsible for driving layouts for major blocks and macros from floorplan to release for Tapeout. \n- Worked on macro designs in Flip chip and Wire bond configurations. \n- Complete Verification (LVS/DRC) of designs using tools like K2ver, Calibre, Assura, Hercules, PVS. \n- Tapeout QC checks like Antenna, Density, DFM and Compat Mega. \n- Implemented various methodologies in building re-usable IPs and macros for creating quick variants. \n- Good understanding of design issues related to the small geometries in DSM processes like 28nm. \n- Version control of Cadence and Open access database using Clearcase. RF/Mixed Signal IC Layout Design Engineer Texas Instruments Ltd October 2005  –  January 2012  (6 years 4 months) Northampton, United Kingdom - Layout design of analog Serializers and DeSerializers comprising complex Transmitters, PLLs and \nReceivers working at very high frequencies using Virtuoso, Virtuoso XL and Open Access. \n- Layout design of Low Capacitive and High Current Input termination blocks in Transmitters and Receivers and design of IPs in various technology processes from 90nm to 28nm from TI and TSMC foundries. \n- Responsible for driving layouts for major blocks and macros from floorplan to release for Tapeout. \n- Worked on macro designs in Flip chip and Wire bond configurations. \n- Complete Verification (LVS/DRC) of designs using tools like K2ver, Calibre, Assura, Hercules, PVS. \n- Tapeout QC checks like Antenna, Density, DFM and Compat Mega. \n- Implemented various methodologies in building re-usable IPs and macros for creating quick variants. \n- Good understanding of design issues related to the small geometries in DSM processes like 28nm. \n- Version control of Cadence and Open access database using Clearcase. RF/Analog - Mixed Signal IC Layout Engineer Intel Technology India Pvt Ltd May 2004  –  October 2005  (1 year 6 months) Bengaluru Area, India - Layout design of complex Analogue/Mixed signal chips working at very high frequency such as ADC, SSB and PLL, Voltage Regulators, Oscillator including floor planning, design and release of the Full Chip database for Tapeouts in Intel’s 0.13um Technology using Virtuoso and Virtuoso XL. \n- Responsible for driving full chip design from floorplan to release for Tapeout. \n- Verification (LVS/DRC) of the design blocks using tools such as Hercules and Assura. \n- Implementing Best Known Methods and DFM Techniques for better yield and design time reduction. \n- Tapeout QC checks such as NAC (Node Area Check)/Antenna, Long Metal1 (DFM), TFC (Thin Film \nCracking), Density and Grid Error Checks. \n- Parasitic layout netlist extraction using Assura (Cadence) and Star RC – XT (Hercules). \n- Version control of Cadence database using Synchronicity. \n- Trained the team members in DFM techniques and performed layout peer reviews. \n- Responsible for training a new member of the team on INTEL’s process technologies and tools. RF/Analog - Mixed Signal IC Layout Engineer Intel Technology India Pvt Ltd May 2004  –  October 2005  (1 year 6 months) Bengaluru Area, India - Layout design of complex Analogue/Mixed signal chips working at very high frequency such as ADC, SSB and PLL, Voltage Regulators, Oscillator including floor planning, design and release of the Full Chip database for Tapeouts in Intel’s 0.13um Technology using Virtuoso and Virtuoso XL. \n- Responsible for driving full chip design from floorplan to release for Tapeout. \n- Verification (LVS/DRC) of the design blocks using tools such as Hercules and Assura. \n- Implementing Best Known Methods and DFM Techniques for better yield and design time reduction. \n- Tapeout QC checks such as NAC (Node Area Check)/Antenna, Long Metal1 (DFM), TFC (Thin Film \nCracking), Density and Grid Error Checks. \n- Parasitic layout netlist extraction using Assura (Cadence) and Star RC – XT (Hercules). \n- Version control of Cadence database using Synchronicity. \n- Trained the team members in DFM techniques and performed layout peer reviews. \n- Responsible for training a new member of the team on INTEL’s process technologies and tools. Analog - Mixed Signal IC Layout Engineer Sasken Communication Technologies Ltd November 2002  –  May 2004  (1 year 7 months) Bengaluru Area, India Worked at a client place by name ATI Technologies Inc (Now part of AMD), located in Toronto, CANADA \n \n- Layout design of complex Analogue/Mixed signal blocks such as PLL, VCO, Calibration Blocks, VI Converter, Bias Circuits, Current Mirrors, Reference blocks, Comparators, Amplifiers (Single ended and Double ended output), various kinds of I/Os and I/O Rings for the Video Graphics chips \n- Verification (DRC, LVS) of the design blocks using Calibre and Assura. \n- Tapeout QC checks such as Antenna, TFC (Thin Film Cracking), Density. \n- Completed 6 successful tapeouts on aggressive timelines in TSMC processes from 0.18um to 90nm. Analog - Mixed Signal IC Layout Engineer Sasken Communication Technologies Ltd November 2002  –  May 2004  (1 year 7 months) Bengaluru Area, India Worked at a client place by name ATI Technologies Inc (Now part of AMD), located in Toronto, CANADA \n \n- Layout design of complex Analogue/Mixed signal blocks such as PLL, VCO, Calibration Blocks, VI Converter, Bias Circuits, Current Mirrors, Reference blocks, Comparators, Amplifiers (Single ended and Double ended output), various kinds of I/Os and I/O Rings for the Video Graphics chips \n- Verification (DRC, LVS) of the design blocks using Calibre and Assura. \n- Tapeout QC checks such as Antenna, TFC (Thin Film Cracking), Density. \n- Completed 6 successful tapeouts on aggressive timelines in TSMC processes from 0.18um to 90nm. Mixed Signal IC Layout Engineer Advanced Micronic Devices Ltd November 2001  –  October 2002  (1 year) Bengaluru Area, India Worked at a client place by name Texas Instruments, located in Bangalore, INDIA. \n \n- Layout design of complex Analogue/Mixed signal blocks such as Reference System, Equalizer LPF(Low Pass Filter), and IV Converter, including various kinds of Comparators, Amplifiers (Single ended and Double ended output),Bias Circuits in 0.15um TI technology process. \n- Verification (DRC, LVS) of the design Blocks using K2Ver and Assura. \n- Tapeout QC checks like Antenna and CLEO (Checker for Latchup and ESD). \n- Parasitic layout netlist extraction using Assura. Mixed Signal IC Layout Engineer Advanced Micronic Devices Ltd November 2001  –  October 2002  (1 year) Bengaluru Area, India Worked at a client place by name Texas Instruments, located in Bangalore, INDIA. \n \n- Layout design of complex Analogue/Mixed signal blocks such as Reference System, Equalizer LPF(Low Pass Filter), and IV Converter, including various kinds of Comparators, Amplifiers (Single ended and Double ended output),Bias Circuits in 0.15um TI technology process. \n- Verification (DRC, LVS) of the design Blocks using K2Ver and Assura. \n- Tapeout QC checks like Antenna and CLEO (Checker for Latchup and ESD). \n- Parasitic layout netlist extraction using Assura. Skills Intel 0.13um Tapeout QC Checks -... TSMC - 28nm, 40nm,... TI 65nm, 0.15um LVS/DRC - Assura, PVS,... Layout Extraction -... Cadence Database... Cadence - Open Access,... RF/Analog/Mixed... Full Chip, RX, TX, PLL,... Current Mirrios, Bias... Cadence Virtuoso Cadence IC layout Virtuoso IC LVS DRC Physical Design CMOS Analog VCO Low-power Design Power Management PLL Mixed Signal IC Layout See 12+     See less Skills  Intel 0.13um Tapeout QC Checks -... TSMC - 28nm, 40nm,... TI 65nm, 0.15um LVS/DRC - Assura, PVS,... Layout Extraction -... Cadence Database... Cadence - Open Access,... RF/Analog/Mixed... Full Chip, RX, TX, PLL,... Current Mirrios, Bias... Cadence Virtuoso Cadence IC layout Virtuoso IC LVS DRC Physical Design CMOS Analog VCO Low-power Design Power Management PLL Mixed Signal IC Layout See 12+     See less Intel 0.13um Tapeout QC Checks -... TSMC - 28nm, 40nm,... TI 65nm, 0.15um LVS/DRC - Assura, PVS,... Layout Extraction -... Cadence Database... Cadence - Open Access,... RF/Analog/Mixed... Full Chip, RX, TX, PLL,... Current Mirrios, Bias... Cadence Virtuoso Cadence IC layout Virtuoso IC LVS DRC Physical Design CMOS Analog VCO Low-power Design Power Management PLL Mixed Signal IC Layout See 12+     See less Intel 0.13um Tapeout QC Checks -... TSMC - 28nm, 40nm,... TI 65nm, 0.15um LVS/DRC - Assura, PVS,... Layout Extraction -... Cadence Database... Cadence - Open Access,... RF/Analog/Mixed... Full Chip, RX, TX, PLL,... Current Mirrios, Bias... Cadence Virtuoso Cadence IC layout Virtuoso IC LVS DRC Physical Design CMOS Analog VCO Low-power Design Power Management PLL Mixed Signal IC Layout See 12+     See less ", "Summary Had technical responsibility for the design, SW & HW implementation and verification of new ASIC/FPGA/SOC products for Multimedia, Communication, 3D graphics and medical markets.  \n•\tI have proven hardware design, software programming and troubleshooting skills. \n•\tApplied advanced programming in C (Firmware,Windows,Unix,Linux), C++ & Windows MFC, DirectX, OpenGL, OpenCL, Assembly, Microcode, Verilog RTL, Perl, HTML, PHP and JavaScript and ARM9 Embedded programming. \n•\tProvided complete system hardware design and verification consisting of RTL logic design in Verilog/System Verilog, simulation with ModelSim/Questa (or NCVerilog) emulation in C/C+ and debugging with FPGA (Xilinx ISE). Familiar with UVM. \n \nSpecialties: \n•\tVerilog design, C++ emulation, FPGA debugging and verification (3 produced ASICs chips: Quad TV Decoder/Encoder and 2 different 3D graphics chips). \n•\tMany years of 2D and 3D graphics accelerators design experience, both conventional and chunking/tile based. Several patents related to high-speed hardware and 3D graphics. \n•\tDesigned and implemented HDTV, NTSC and PAL Television encoders and decoders in FPGAs. \n•\tI write excellent Design documentation and comprehensive test procedures. Summary Had technical responsibility for the design, SW & HW implementation and verification of new ASIC/FPGA/SOC products for Multimedia, Communication, 3D graphics and medical markets.  \n•\tI have proven hardware design, software programming and troubleshooting skills. \n•\tApplied advanced programming in C (Firmware,Windows,Unix,Linux), C++ & Windows MFC, DirectX, OpenGL, OpenCL, Assembly, Microcode, Verilog RTL, Perl, HTML, PHP and JavaScript and ARM9 Embedded programming. \n•\tProvided complete system hardware design and verification consisting of RTL logic design in Verilog/System Verilog, simulation with ModelSim/Questa (or NCVerilog) emulation in C/C+ and debugging with FPGA (Xilinx ISE). Familiar with UVM. \n \nSpecialties: \n•\tVerilog design, C++ emulation, FPGA debugging and verification (3 produced ASICs chips: Quad TV Decoder/Encoder and 2 different 3D graphics chips). \n•\tMany years of 2D and 3D graphics accelerators design experience, both conventional and chunking/tile based. Several patents related to high-speed hardware and 3D graphics. \n•\tDesigned and implemented HDTV, NTSC and PAL Television encoders and decoders in FPGAs. \n•\tI write excellent Design documentation and comprehensive test procedures. Had technical responsibility for the design, SW & HW implementation and verification of new ASIC/FPGA/SOC products for Multimedia, Communication, 3D graphics and medical markets.  \n•\tI have proven hardware design, software programming and troubleshooting skills. \n•\tApplied advanced programming in C (Firmware,Windows,Unix,Linux), C++ & Windows MFC, DirectX, OpenGL, OpenCL, Assembly, Microcode, Verilog RTL, Perl, HTML, PHP and JavaScript and ARM9 Embedded programming. \n•\tProvided complete system hardware design and verification consisting of RTL logic design in Verilog/System Verilog, simulation with ModelSim/Questa (or NCVerilog) emulation in C/C+ and debugging with FPGA (Xilinx ISE). Familiar with UVM. \n \nSpecialties: \n•\tVerilog design, C++ emulation, FPGA debugging and verification (3 produced ASICs chips: Quad TV Decoder/Encoder and 2 different 3D graphics chips). \n•\tMany years of 2D and 3D graphics accelerators design experience, both conventional and chunking/tile based. Several patents related to high-speed hardware and 3D graphics. \n•\tDesigned and implemented HDTV, NTSC and PAL Television encoders and decoders in FPGAs. \n•\tI write excellent Design documentation and comprehensive test procedures. Had technical responsibility for the design, SW & HW implementation and verification of new ASIC/FPGA/SOC products for Multimedia, Communication, 3D graphics and medical markets.  \n•\tI have proven hardware design, software programming and troubleshooting skills. \n•\tApplied advanced programming in C (Firmware,Windows,Unix,Linux), C++ & Windows MFC, DirectX, OpenGL, OpenCL, Assembly, Microcode, Verilog RTL, Perl, HTML, PHP and JavaScript and ARM9 Embedded programming. \n•\tProvided complete system hardware design and verification consisting of RTL logic design in Verilog/System Verilog, simulation with ModelSim/Questa (or NCVerilog) emulation in C/C+ and debugging with FPGA (Xilinx ISE). Familiar with UVM. \n \nSpecialties: \n•\tVerilog design, C++ emulation, FPGA debugging and verification (3 produced ASICs chips: Quad TV Decoder/Encoder and 2 different 3D graphics chips). \n•\tMany years of 2D and 3D graphics accelerators design experience, both conventional and chunking/tile based. Several patents related to high-speed hardware and 3D graphics. \n•\tDesigned and implemented HDTV, NTSC and PAL Television encoders and decoders in FPGAs. \n•\tI write excellent Design documentation and comprehensive test procedures. Experience Verification Consultant Intel Corporation November 2013  – Present (1 year 10 months) Santa Clara, CA •\tASIC Verification for multiprocessor chip. Implemented tests for I2c/SMBUS w Perl scripts interfacing with Verilog FSM (Fin St Mach) and Specman e BFM (Bus Funct Model). Achieved 100% coverage. Verification Consultant Intel Corporation November 2013  – Present (1 year 10 months) Consultant Rohner Engineering, San Jose, CA November 2012  –  October 2013  (1 year) San Jose •\tInvestigate applications for UVM, GPU programming in OpenCL, ARM, USB 3.0 and PCIe. Sr Systems Eng Quantum3D March 2012  –  August 2012  (6 months) San Jose Designed and tested DDR controller and PCIe Bus with Xilinx Virtex6 FPGA and ModelSim \nWorked on 3D Graphics, Multicore ARM processors, GPUs, ZyncQ and OpenCL. Consultant C8 Medisensors August 2011  –  February 2012  (7 months) San Jose, CA •\tC++ programming of ARM processor with IAR workbench. Wrote interpreter with MFC C++ to generate FPGA test vectors from script. \n•\tDesigned and verified image pipe between ARM 926 micro controller and CCD image capture, using Verilog and Spartan3 FPGA. Wrote Firmware Programs for ARM micro controller. \n•\tWrote full FPGA documentation and testing procedures for medical device. Sr Design Staff Engineer and Consultant MetaVideo July 2004  –  July 2011  (7 years 1 month) Los Gatos, CA •\tDeveloped IP for television and camera surveillance market. \n•\tDesigned and verified verilog modules for HDTV, NTSC and PAL using Xilinx Virtex FPGAs. \n•\tCreated Windows-MFC application in C++ for algorithm development and system verification. \n•\tC++ Simulation and System Veriolog implementation of encoders, decoders, up/down-scalers, deinterlacer, filters, on-screen-display and color space conversion for various digital video formats. \n•\tDesigned and verified interpreter Verilog modules for HDTV, NTSC and PAL using Xilinx FPGAs (Virtex and Spartan). Implemented encoders, decoders, up/down-scalers, deinterlacer,  \nTV Composite signal was converted to digital with fast ADC, processed digitally in FPGA, then converted back to analog in RGB or YCbCr format with DAC.filters, on-screen-display and color space conversion for various digital video formats. \n•\tCreated extensive HW multiplier library in Verilog, based on Booth algorithms & Wallace tree, used to implement sine tables and variable frequency scalers. \n•\tImplemented SDRAM and DDR memory controllers for TV line and frame buffering. Consultant Myers Internet Services February 2000  –  February 2004  (4 years 1 month) San jose,CA •\tDeveloped software package to automate website creation, resulting in thousands of commercial mortgage lending websites. Used Perl, PHP and JavaScript to handle order transactions and create a comprehensive step-by-step configuration wizard. \n•\tDesigned website mortgage calculators for payments, refinancing, loan qualification and rent vs. buy analysis. Senior 3D Architect SILICON MAGIC April 1998  –  January 2000  (1 year 10 months) Sunnyvale, CA Upgraded and tested 3D graphics core with tile architecture to meet DirectX8 specifications. \n•\tWrote and debugged C/C++, Perl, Verilog, NCVerilog and PLIs for 3D graphics ASIC. \n•\tCreated test environment for 3D core verification, consisting of C-simulator, Verilog simulator, PLIs, test benches, makefiles and Perl run scripts. Generated extensive sets of test vectors. \n•\tCreated 3D test-suite in C++ for DirectX8 and OpenGL, to test compliance with Direct3D. \n•\tUpdated 3D drivers. Senior 3D Architect OAK TECHNOLOGY January 1996  –  March 1998  (2 years 3 months) Sunnyvale, CA Architect of first PC 3D graphics ASIC with tile based architecture, subpixel anti-aliasing and Tri-linear Texture Mapping features, giving it the highest image quality in the PC 3D graphics industry (Warp5). \n•\tDesigned and simulated several computation-intensive areas of 3D core: hardware setup (geometric computations), image rendering, fog, texture access, and pixel operations (Z, ARGB, U and V). \n•\tCreated math library and specified computation accuracy requirements for C simulator. \n•\tDesigned and implemented innovative algorithms for fog. Sr. Staff Design Engineer KLA-Tencor 1996  –  1997  (1 year) System design and simulation of digital image renderer used for IC mask (reticule) image inspection.  \n•\tImproved several areas of rendering algorithms (subpixel antialiasing, corner cases and clipping).  \n•\tImplemented transaction accurate HW simulator in Linux C++, used to develop and test subsystems, algorithms and finally the full system, resulting in delivering the prototype ahead of schedule. \n•\tDesigned/simulated efficient state machines for critical modules of high-speed processing pipeline implemented with DSP, Xilinx FPGA and PLDs. \n•\tReprogrammed FPGAs for efficient clipping operation, resulting in savings of $40K per system. Verification Consultant Intel Corporation November 2013  – Present (1 year 10 months) Santa Clara, CA •\tASIC Verification for multiprocessor chip. Implemented tests for I2c/SMBUS w Perl scripts interfacing with Verilog FSM (Fin St Mach) and Specman e BFM (Bus Funct Model). Achieved 100% coverage. Verification Consultant Intel Corporation November 2013  – Present (1 year 10 months) Santa Clara, CA •\tASIC Verification for multiprocessor chip. Implemented tests for I2c/SMBUS w Perl scripts interfacing with Verilog FSM (Fin St Mach) and Specman e BFM (Bus Funct Model). Achieved 100% coverage. Verification Consultant Intel Corporation November 2013  – Present (1 year 10 months) Verification Consultant Intel Corporation November 2013  – Present (1 year 10 months) Consultant Rohner Engineering, San Jose, CA November 2012  –  October 2013  (1 year) San Jose •\tInvestigate applications for UVM, GPU programming in OpenCL, ARM, USB 3.0 and PCIe. Consultant Rohner Engineering, San Jose, CA November 2012  –  October 2013  (1 year) San Jose •\tInvestigate applications for UVM, GPU programming in OpenCL, ARM, USB 3.0 and PCIe. Sr Systems Eng Quantum3D March 2012  –  August 2012  (6 months) San Jose Designed and tested DDR controller and PCIe Bus with Xilinx Virtex6 FPGA and ModelSim \nWorked on 3D Graphics, Multicore ARM processors, GPUs, ZyncQ and OpenCL. Sr Systems Eng Quantum3D March 2012  –  August 2012  (6 months) San Jose Designed and tested DDR controller and PCIe Bus with Xilinx Virtex6 FPGA and ModelSim \nWorked on 3D Graphics, Multicore ARM processors, GPUs, ZyncQ and OpenCL. Consultant C8 Medisensors August 2011  –  February 2012  (7 months) San Jose, CA •\tC++ programming of ARM processor with IAR workbench. Wrote interpreter with MFC C++ to generate FPGA test vectors from script. \n•\tDesigned and verified image pipe between ARM 926 micro controller and CCD image capture, using Verilog and Spartan3 FPGA. Wrote Firmware Programs for ARM micro controller. \n•\tWrote full FPGA documentation and testing procedures for medical device. Consultant C8 Medisensors August 2011  –  February 2012  (7 months) San Jose, CA •\tC++ programming of ARM processor with IAR workbench. Wrote interpreter with MFC C++ to generate FPGA test vectors from script. \n•\tDesigned and verified image pipe between ARM 926 micro controller and CCD image capture, using Verilog and Spartan3 FPGA. Wrote Firmware Programs for ARM micro controller. \n•\tWrote full FPGA documentation and testing procedures for medical device. Sr Design Staff Engineer and Consultant MetaVideo July 2004  –  July 2011  (7 years 1 month) Los Gatos, CA •\tDeveloped IP for television and camera surveillance market. \n•\tDesigned and verified verilog modules for HDTV, NTSC and PAL using Xilinx Virtex FPGAs. \n•\tCreated Windows-MFC application in C++ for algorithm development and system verification. \n•\tC++ Simulation and System Veriolog implementation of encoders, decoders, up/down-scalers, deinterlacer, filters, on-screen-display and color space conversion for various digital video formats. \n•\tDesigned and verified interpreter Verilog modules for HDTV, NTSC and PAL using Xilinx FPGAs (Virtex and Spartan). Implemented encoders, decoders, up/down-scalers, deinterlacer,  \nTV Composite signal was converted to digital with fast ADC, processed digitally in FPGA, then converted back to analog in RGB or YCbCr format with DAC.filters, on-screen-display and color space conversion for various digital video formats. \n•\tCreated extensive HW multiplier library in Verilog, based on Booth algorithms & Wallace tree, used to implement sine tables and variable frequency scalers. \n•\tImplemented SDRAM and DDR memory controllers for TV line and frame buffering. Sr Design Staff Engineer and Consultant MetaVideo July 2004  –  July 2011  (7 years 1 month) Los Gatos, CA •\tDeveloped IP for television and camera surveillance market. \n•\tDesigned and verified verilog modules for HDTV, NTSC and PAL using Xilinx Virtex FPGAs. \n•\tCreated Windows-MFC application in C++ for algorithm development and system verification. \n•\tC++ Simulation and System Veriolog implementation of encoders, decoders, up/down-scalers, deinterlacer, filters, on-screen-display and color space conversion for various digital video formats. \n•\tDesigned and verified interpreter Verilog modules for HDTV, NTSC and PAL using Xilinx FPGAs (Virtex and Spartan). Implemented encoders, decoders, up/down-scalers, deinterlacer,  \nTV Composite signal was converted to digital with fast ADC, processed digitally in FPGA, then converted back to analog in RGB or YCbCr format with DAC.filters, on-screen-display and color space conversion for various digital video formats. \n•\tCreated extensive HW multiplier library in Verilog, based on Booth algorithms & Wallace tree, used to implement sine tables and variable frequency scalers. \n•\tImplemented SDRAM and DDR memory controllers for TV line and frame buffering. Consultant Myers Internet Services February 2000  –  February 2004  (4 years 1 month) San jose,CA •\tDeveloped software package to automate website creation, resulting in thousands of commercial mortgage lending websites. Used Perl, PHP and JavaScript to handle order transactions and create a comprehensive step-by-step configuration wizard. \n•\tDesigned website mortgage calculators for payments, refinancing, loan qualification and rent vs. buy analysis. Consultant Myers Internet Services February 2000  –  February 2004  (4 years 1 month) San jose,CA •\tDeveloped software package to automate website creation, resulting in thousands of commercial mortgage lending websites. Used Perl, PHP and JavaScript to handle order transactions and create a comprehensive step-by-step configuration wizard. \n•\tDesigned website mortgage calculators for payments, refinancing, loan qualification and rent vs. buy analysis. Senior 3D Architect SILICON MAGIC April 1998  –  January 2000  (1 year 10 months) Sunnyvale, CA Upgraded and tested 3D graphics core with tile architecture to meet DirectX8 specifications. \n•\tWrote and debugged C/C++, Perl, Verilog, NCVerilog and PLIs for 3D graphics ASIC. \n•\tCreated test environment for 3D core verification, consisting of C-simulator, Verilog simulator, PLIs, test benches, makefiles and Perl run scripts. Generated extensive sets of test vectors. \n•\tCreated 3D test-suite in C++ for DirectX8 and OpenGL, to test compliance with Direct3D. \n•\tUpdated 3D drivers. Senior 3D Architect SILICON MAGIC April 1998  –  January 2000  (1 year 10 months) Sunnyvale, CA Upgraded and tested 3D graphics core with tile architecture to meet DirectX8 specifications. \n•\tWrote and debugged C/C++, Perl, Verilog, NCVerilog and PLIs for 3D graphics ASIC. \n•\tCreated test environment for 3D core verification, consisting of C-simulator, Verilog simulator, PLIs, test benches, makefiles and Perl run scripts. Generated extensive sets of test vectors. \n•\tCreated 3D test-suite in C++ for DirectX8 and OpenGL, to test compliance with Direct3D. \n•\tUpdated 3D drivers. Senior 3D Architect OAK TECHNOLOGY January 1996  –  March 1998  (2 years 3 months) Sunnyvale, CA Architect of first PC 3D graphics ASIC with tile based architecture, subpixel anti-aliasing and Tri-linear Texture Mapping features, giving it the highest image quality in the PC 3D graphics industry (Warp5). \n•\tDesigned and simulated several computation-intensive areas of 3D core: hardware setup (geometric computations), image rendering, fog, texture access, and pixel operations (Z, ARGB, U and V). \n•\tCreated math library and specified computation accuracy requirements for C simulator. \n•\tDesigned and implemented innovative algorithms for fog. Senior 3D Architect OAK TECHNOLOGY January 1996  –  March 1998  (2 years 3 months) Sunnyvale, CA Architect of first PC 3D graphics ASIC with tile based architecture, subpixel anti-aliasing and Tri-linear Texture Mapping features, giving it the highest image quality in the PC 3D graphics industry (Warp5). \n•\tDesigned and simulated several computation-intensive areas of 3D core: hardware setup (geometric computations), image rendering, fog, texture access, and pixel operations (Z, ARGB, U and V). \n•\tCreated math library and specified computation accuracy requirements for C simulator. \n•\tDesigned and implemented innovative algorithms for fog. Sr. Staff Design Engineer KLA-Tencor 1996  –  1997  (1 year) System design and simulation of digital image renderer used for IC mask (reticule) image inspection.  \n•\tImproved several areas of rendering algorithms (subpixel antialiasing, corner cases and clipping).  \n•\tImplemented transaction accurate HW simulator in Linux C++, used to develop and test subsystems, algorithms and finally the full system, resulting in delivering the prototype ahead of schedule. \n•\tDesigned/simulated efficient state machines for critical modules of high-speed processing pipeline implemented with DSP, Xilinx FPGA and PLDs. \n•\tReprogrammed FPGAs for efficient clipping operation, resulting in savings of $40K per system. Sr. Staff Design Engineer KLA-Tencor 1996  –  1997  (1 year) System design and simulation of digital image renderer used for IC mask (reticule) image inspection.  \n•\tImproved several areas of rendering algorithms (subpixel antialiasing, corner cases and clipping).  \n•\tImplemented transaction accurate HW simulator in Linux C++, used to develop and test subsystems, algorithms and finally the full system, resulting in delivering the prototype ahead of schedule. \n•\tDesigned/simulated efficient state machines for critical modules of high-speed processing pipeline implemented with DSP, Xilinx FPGA and PLDs. \n•\tReprogrammed FPGAs for efficient clipping operation, resulting in savings of $40K per system. Languages English and French Native or bilingual proficiency German Professional working proficiency English and French Native or bilingual proficiency German Professional working proficiency English and French Native or bilingual proficiency German Professional working proficiency Native or bilingual proficiency Professional working proficiency Skills Verilog Embedded Systems C C++ Product Management USB FPGA Start-ups Fibre Channel Integrated Circuit... Simulations PCB design Embedded Software RTOS Device Drivers Debugging Engineering Management ARM 3D graphics Digital Signal... Semiconductors SoC Perl Algorithms IC Hardware Testing Linux ModelSim Microcontrollers Xilinx System Architecture Image Processing System Design ASIC Analog Hardware Architecture Software Engineering See 23+     See less Skills  Verilog Embedded Systems C C++ Product Management USB FPGA Start-ups Fibre Channel Integrated Circuit... Simulations PCB design Embedded Software RTOS Device Drivers Debugging Engineering Management ARM 3D graphics Digital Signal... Semiconductors SoC Perl Algorithms IC Hardware Testing Linux ModelSim Microcontrollers Xilinx System Architecture Image Processing System Design ASIC Analog Hardware Architecture Software Engineering See 23+     See less Verilog Embedded Systems C C++ Product Management USB FPGA Start-ups Fibre Channel Integrated Circuit... Simulations PCB design Embedded Software RTOS Device Drivers Debugging Engineering Management ARM 3D graphics Digital Signal... Semiconductors SoC Perl Algorithms IC Hardware Testing Linux ModelSim Microcontrollers Xilinx System Architecture Image Processing System Design ASIC Analog Hardware Architecture Software Engineering See 23+     See less Verilog Embedded Systems C C++ Product Management USB FPGA Start-ups Fibre Channel Integrated Circuit... Simulations PCB design Embedded Software RTOS Device Drivers Debugging Engineering Management ARM 3D graphics Digital Signal... Semiconductors SoC Perl Algorithms IC Hardware Testing Linux ModelSim Microcontrollers Xilinx System Architecture Image Processing System Design ASIC Analog Hardware Architecture Software Engineering See 23+     See less Education Santa Clara University MSEE,  computer hardware and software Swiss Institute of Technology, Zurich BSEE,  Electrical and Electronics Engineering Santa Clara University MSEE,  computer hardware and software Santa Clara University MSEE,  computer hardware and software Santa Clara University MSEE,  computer hardware and software Swiss Institute of Technology, Zurich BSEE,  Electrical and Electronics Engineering Swiss Institute of Technology, Zurich BSEE,  Electrical and Electronics Engineering Swiss Institute of Technology, Zurich BSEE,  Electrical and Electronics Engineering ", "Summary Program Management / Fist Product Quality Release Specialist. Tape-out/Tape-in: Microprocessors, Multimedia, Integrated Graphics, Mixed Signal, Wireline Network, DSP's, RCP's Switch Fabric, Wireless Communication, Image Processor and Consumer chips. High Performance and Low Power designs.Experienced in 14nm, 22nm, 32nm and 45nm process, with real-world hands-on experience. Architecture/Intergration of Physical Designs for Analog/Digital of DDR2, LVDS, SPI4, DAC/ADC, PCI and SerDes in Place/Route environment. Expertise, from resources to tools, to deliver first pass Silicon Success! \n \nSpecialties: Physical Design Flows, Floorplaning and Design Constraints. Ability to quickly ramp-up on new tools and flows. Use of Intel, ST-Micro, NetLogic/Broadcom and commercial flows. Asic, Mixed-signal, full custom Analog and Digital Layout, I/R, EM, Crosstalk, PI, SI, Physical Verification, Extraction, STA and Low Power Designs. EDA Software from: Synopsys, Cadence, AtopTech, Mentor Graphics. Including Aprisa, ICC, Encounter, Olympus, DCT, RTL Compiler, Calibre, IC Validator, Hercules, PT, PrimeRail, Apache, StarRC. IP Integration from external and internal Libraries. Summary Program Management / Fist Product Quality Release Specialist. Tape-out/Tape-in: Microprocessors, Multimedia, Integrated Graphics, Mixed Signal, Wireline Network, DSP's, RCP's Switch Fabric, Wireless Communication, Image Processor and Consumer chips. High Performance and Low Power designs.Experienced in 14nm, 22nm, 32nm and 45nm process, with real-world hands-on experience. Architecture/Intergration of Physical Designs for Analog/Digital of DDR2, LVDS, SPI4, DAC/ADC, PCI and SerDes in Place/Route environment. Expertise, from resources to tools, to deliver first pass Silicon Success! \n \nSpecialties: Physical Design Flows, Floorplaning and Design Constraints. Ability to quickly ramp-up on new tools and flows. Use of Intel, ST-Micro, NetLogic/Broadcom and commercial flows. Asic, Mixed-signal, full custom Analog and Digital Layout, I/R, EM, Crosstalk, PI, SI, Physical Verification, Extraction, STA and Low Power Designs. EDA Software from: Synopsys, Cadence, AtopTech, Mentor Graphics. Including Aprisa, ICC, Encounter, Olympus, DCT, RTL Compiler, Calibre, IC Validator, Hercules, PT, PrimeRail, Apache, StarRC. IP Integration from external and internal Libraries. Program Management / Fist Product Quality Release Specialist. Tape-out/Tape-in: Microprocessors, Multimedia, Integrated Graphics, Mixed Signal, Wireline Network, DSP's, RCP's Switch Fabric, Wireless Communication, Image Processor and Consumer chips. High Performance and Low Power designs.Experienced in 14nm, 22nm, 32nm and 45nm process, with real-world hands-on experience. Architecture/Intergration of Physical Designs for Analog/Digital of DDR2, LVDS, SPI4, DAC/ADC, PCI and SerDes in Place/Route environment. Expertise, from resources to tools, to deliver first pass Silicon Success! \n \nSpecialties: Physical Design Flows, Floorplaning and Design Constraints. Ability to quickly ramp-up on new tools and flows. Use of Intel, ST-Micro, NetLogic/Broadcom and commercial flows. Asic, Mixed-signal, full custom Analog and Digital Layout, I/R, EM, Crosstalk, PI, SI, Physical Verification, Extraction, STA and Low Power Designs. EDA Software from: Synopsys, Cadence, AtopTech, Mentor Graphics. Including Aprisa, ICC, Encounter, Olympus, DCT, RTL Compiler, Calibre, IC Validator, Hercules, PT, PrimeRail, Apache, StarRC. IP Integration from external and internal Libraries. Program Management / Fist Product Quality Release Specialist. Tape-out/Tape-in: Microprocessors, Multimedia, Integrated Graphics, Mixed Signal, Wireline Network, DSP's, RCP's Switch Fabric, Wireless Communication, Image Processor and Consumer chips. High Performance and Low Power designs.Experienced in 14nm, 22nm, 32nm and 45nm process, with real-world hands-on experience. Architecture/Intergration of Physical Designs for Analog/Digital of DDR2, LVDS, SPI4, DAC/ADC, PCI and SerDes in Place/Route environment. Expertise, from resources to tools, to deliver first pass Silicon Success! \n \nSpecialties: Physical Design Flows, Floorplaning and Design Constraints. Ability to quickly ramp-up on new tools and flows. Use of Intel, ST-Micro, NetLogic/Broadcom and commercial flows. Asic, Mixed-signal, full custom Analog and Digital Layout, I/R, EM, Crosstalk, PI, SI, Physical Verification, Extraction, STA and Low Power Designs. EDA Software from: Synopsys, Cadence, AtopTech, Mentor Graphics. Including Aprisa, ICC, Encounter, Olympus, DCT, RTL Compiler, Calibre, IC Validator, Hercules, PT, PrimeRail, Apache, StarRC. IP Integration from external and internal Libraries. Experience Sr Physical Design Engineer Consultant Intel Corporation August 2014  – Present (1 year 1 month) Hillsboro, Oregon Intel Custom Foundry (ICF) \nP&R and Verification for multiple partitions on 14-nm test chip Tape-in. COO Veritas Media Solutions, Corp February 2014  – Present (1 year 7 months) Kalispell, Montana To provide unparalleled quality in the media domain for our clients in \nvideo, audio and web based design and marketing for there online presence. Sr Physical Design Engineer Consultant Intel Corporation March 2014  –  August 2014  (6 months) Santa Clara, California Working on Knights Landing, Xeon Phi co-processor next generation of world’s fastest high performance computing (HPC) tapein 14nm process technology featuring second generation 3-D tri-gate transistors operates at a peak performance of 54.9 PFlops (54.9 quadrillion floating point operations per second) \nPerformed synthesis using TOPO DC, Place and Route using ICC, MCMM in Primetime, Extraction, all verification including Physical Verification, timing verification, formal verification. Sr Physical Design Engineer Consultant Intel Corporation April 2013  –  December 2013  (9 months) Hillsboro, Oregon Worked with ICC, PTSI and calibre in 14nm process on rosegate project. \n \nWorked on 22nm technology utilizing Cadence, CCOpt, RC, Encounter, Synopsys DC, ICC, PTSI and Calibre for Physical Verification. Sr Physical Design Engineer Consultant STMicroelectronics March 2012  –  February 2013  (1 year) Scottsdale, Arizona Tapeout of MCMM 32nm chip with 20 plus sub blocks, using Mentor Graphics olympus-soc P&R tool suite,PTSI for STA and Mentor Graphics calibre for physical verification. Worked on over half of design for floorplanning and multiple million instance sub blocks from floorplaning, timing convergence through verification. Sr Physical Design Engineer Consultant Intel Corporation January 2012  –  March 2012  (3 months) Folsom, California Worked on development and Verification of 22nm flows for MCMM using ICC and PTSI. Sr VLSI/Physical Design Engineer Consultant NetLogic Microsystems October 2011  –  January 2012  (4 months) San Jose, California P&R for a few modules for 1.3 GHz 28nm Multi-core  \nMicroprocessor Design Project. using Atoptech,  \nTimevision (SDC Verification), MCMM in Goldtime,  \nCalibre, Redhawk and Performance  \nTuning/Optimization using internal CAD tools. Sr Physical Design Engineer Consultant Intel Corporation June 2011  –  October 2011  (5 months) Austin, Texas P&R for 22nm 1.5 million instance count using Synopsys Tools,  \nincluding ICC (P&R),Sta-RCXT (extraction ),  \nPT (MCMM), and Hercules (Physical Verification). Sr VLSI/Physical Design Engineer Consultant NetLogic Microsystems February 2011  –  April 2011  (3 months) San Jose, California Worked on multiple blocks in the 1.3 GHz 45nm Multi-core  \nMicroprocessor Design Project. \nResponsibilities included : \n1. Physical Design using the Atoptech tool suite \n2. Multi Corner Multi Mode Timing closure using  \nGoldTime (Extreme-DA) and Synopsys (StarRC XT) \n3. Physical Verification using Mentor (Calibre) \n4. Power Analysis, EM and IR using Apache (Redhawk) \n5. Performance Tuning/Optimization using internal CAD tools \n6. Formal Verification using Cadence (Conformal) ASIC Developer Consultant Intel April 2010  –  February 2011  (11 months) Chandler, Arizona Developed physical design, optimization, verification and timing closure flows \nfor 32nm design projects for external customers: \nTools used: \n1. Synopsys (DC, ICC, Hercules, StarRC-XT, PrimeTime-SI)  \n2. Cadence (conformal)  \n3. Intel fabrication Methodology flow support and Development \n4. Support external Customer base for tape-in Physical Design Engineer Consultant ST Microelectronics 2009  –  2009  (less than a year) Longmont, Colorado Worked on 90nm \"hard disk controller\" design. \nResponsibilites included:  \nPlace and Route (ICC) Floorplaning, Pre-routes, Placement, Clocking, PostCTSOpt, Clock pre-routes, Routing, Density, and Physical Verification (Calibre) Staff Physical Design Engineer Zilog August 2007  –  December 2008  (1 year 5 months) San Jose, California Tapeout of Multiple 32-bit ARM core design's, setup flow for Astro and ICC for faster turnaround of netlist, IP prep and tapeout. Physical Design Engineer Consultant Intel Corporation March 2007  –  July 2007  (5 months) Santa Clara, California Digital Home Group Design, 90nm Place and Route (Astro) \nFloorplanning, Placement, CTS, Routing, STA (PT-SI) Physical Verification (Hercules) Lead Physical Design Engineer GiQuila Corporation June 2005  –  October 2005  (5 months) San Jose, California Setup Flow for TSMC 90 Nanometer 8 layer metal process \nusing Magma software for hierachical 3D low power graphics  \nchip. Principal Engineer Esilicon Corporation November 2004  –  June 2005  (8 months) Sunnyvale, California *Tapeout of a storage networking flip chip design with high  \nspeed interfaces (DDR2, SPI4, PCI) Embedded processors  \nwith approximately 2 million placeable components. \nHierarchical with 16 blocks in TSMC .13 micron \n8 metal layer process. Sr. Project Lead ReShape, Inc December 2001  –  November 2004  (3 years) Mountain View, California * Program Manager \n* Tapeout of multimedia processor in .13um design with  \n1.5 million components,6 million transistors and a \nDDR memory interface with a 220 MHz clk speed. \n* A wired communication mixed-signal Chip in TSMC .18um  \ntechnology.  \n* A Switch Fabric Flip-Chip with 1200 source-synchronous  \nsignal pins and 2600 power and ground pins in TSMC 7 \nlayer .18um process Clk speed of 250 MHz, 600K \ninstances and a die size of 14x14mm \n* Digital Video design with 270K components a 200MHz \nLVDS chip to chip interface with multiple hard macro’s, \nincluding a Mosys 1T memory, ARM core, ADC, DAC \nand 4 different I/O libraries with 7 power sources in \nTSMC .18um 6-layer process. \n* Initiate Astro purchase for timing closure, assist  \nwith CTS and flow integration. Sr. Member of Technical Staff Chameleon Systems June 1999  –  December 2001  (2 years 7 months) San Jose, California * Responsible for tapeout of Chameleon’s first \nReconfigurable Communication Processor in .25um \nusing Avanti's Apollo software with a die size of 20x17mm \nwith DMA, ARC, CPU, Memory Controller, PCI, PIO,  \nCustom fabric (Datapath) Including FloorPlanning Place & \nRoute Extraction and Physical verification (DRC, LVS & ANT) \n* Initiate same design in .18um 6 layers with on board memory and a clock speed of 150 MHz. \n* Initiate/purchase, setup StarRC_XT extraction and Saturn tool for IPO and repeater insertion.  \n* Purchase and Set-up of Cadence Virtuoso software. Sr. Corporate Application Engineer Duet Technologies 1998  –  June 1999  (1 year) San Jose, California Sr. Corporate Application Engineer \nPlan DAC Demo's \nManage benchmarks, generate Standard Cell  \nArchitecture’s, abstracts and timing models for \nStandard cells and other I/P including routing  \nand verification. \n* Run synthesis through P/R of designs, utilizing  \nDC, Apollo and Silicone Ensemble. \n* Assist with integration of Cascade Design Automation  \nthat Duet purchased out of Bellevue, Washington. \n* Assist customers with tapeouts using Duet’s I/P and third party EDA software. \n* Purchase and set-up of Avanti’s Place and Route software. Design Manager Aspec Technology 1995  –  1998  (3 years) Sunnyvale, California Manage a group of 3 designers \n*Setup Automation Flow to generate Models for P/R enviorment. \n* Design Service’s \n* Plan and Setup DAC Demo. \n* Generate library models for Silicon Ensemble and Apollo software. \n* Run Benchmarks for potential customers utilizing Aspec Libraries. \n* Support most Place and Route environments and methodologies. \n* Layout and verification of Single and Dual port memories \nusing Virtuoso, Dracula,Caliber and Aspec internal compiler. \n* Purchase and Set-up of Avanti’s P/R tools. Project Lead Chips and Technologies 1989  –  1995  (6 years) San Jose, California Many tapeouts and many party's { Ah, the good old days ;} Sr Physical Design Engineer Consultant Intel Corporation August 2014  – Present (1 year 1 month) Hillsboro, Oregon Intel Custom Foundry (ICF) \nP&R and Verification for multiple partitions on 14-nm test chip Tape-in. Sr Physical Design Engineer Consultant Intel Corporation August 2014  – Present (1 year 1 month) Hillsboro, Oregon Intel Custom Foundry (ICF) \nP&R and Verification for multiple partitions on 14-nm test chip Tape-in. COO Veritas Media Solutions, Corp February 2014  – Present (1 year 7 months) Kalispell, Montana To provide unparalleled quality in the media domain for our clients in \nvideo, audio and web based design and marketing for there online presence. COO Veritas Media Solutions, Corp February 2014  – Present (1 year 7 months) Kalispell, Montana To provide unparalleled quality in the media domain for our clients in \nvideo, audio and web based design and marketing for there online presence. Sr Physical Design Engineer Consultant Intel Corporation March 2014  –  August 2014  (6 months) Santa Clara, California Working on Knights Landing, Xeon Phi co-processor next generation of world’s fastest high performance computing (HPC) tapein 14nm process technology featuring second generation 3-D tri-gate transistors operates at a peak performance of 54.9 PFlops (54.9 quadrillion floating point operations per second) \nPerformed synthesis using TOPO DC, Place and Route using ICC, MCMM in Primetime, Extraction, all verification including Physical Verification, timing verification, formal verification. Sr Physical Design Engineer Consultant Intel Corporation March 2014  –  August 2014  (6 months) Santa Clara, California Working on Knights Landing, Xeon Phi co-processor next generation of world’s fastest high performance computing (HPC) tapein 14nm process technology featuring second generation 3-D tri-gate transistors operates at a peak performance of 54.9 PFlops (54.9 quadrillion floating point operations per second) \nPerformed synthesis using TOPO DC, Place and Route using ICC, MCMM in Primetime, Extraction, all verification including Physical Verification, timing verification, formal verification. Sr Physical Design Engineer Consultant Intel Corporation April 2013  –  December 2013  (9 months) Hillsboro, Oregon Worked with ICC, PTSI and calibre in 14nm process on rosegate project. \n \nWorked on 22nm technology utilizing Cadence, CCOpt, RC, Encounter, Synopsys DC, ICC, PTSI and Calibre for Physical Verification. Sr Physical Design Engineer Consultant Intel Corporation April 2013  –  December 2013  (9 months) Hillsboro, Oregon Worked with ICC, PTSI and calibre in 14nm process on rosegate project. \n \nWorked on 22nm technology utilizing Cadence, CCOpt, RC, Encounter, Synopsys DC, ICC, PTSI and Calibre for Physical Verification. Sr Physical Design Engineer Consultant STMicroelectronics March 2012  –  February 2013  (1 year) Scottsdale, Arizona Tapeout of MCMM 32nm chip with 20 plus sub blocks, using Mentor Graphics olympus-soc P&R tool suite,PTSI for STA and Mentor Graphics calibre for physical verification. Worked on over half of design for floorplanning and multiple million instance sub blocks from floorplaning, timing convergence through verification. Sr Physical Design Engineer Consultant STMicroelectronics March 2012  –  February 2013  (1 year) Scottsdale, Arizona Tapeout of MCMM 32nm chip with 20 plus sub blocks, using Mentor Graphics olympus-soc P&R tool suite,PTSI for STA and Mentor Graphics calibre for physical verification. Worked on over half of design for floorplanning and multiple million instance sub blocks from floorplaning, timing convergence through verification. Sr Physical Design Engineer Consultant Intel Corporation January 2012  –  March 2012  (3 months) Folsom, California Worked on development and Verification of 22nm flows for MCMM using ICC and PTSI. Sr Physical Design Engineer Consultant Intel Corporation January 2012  –  March 2012  (3 months) Folsom, California Worked on development and Verification of 22nm flows for MCMM using ICC and PTSI. Sr VLSI/Physical Design Engineer Consultant NetLogic Microsystems October 2011  –  January 2012  (4 months) San Jose, California P&R for a few modules for 1.3 GHz 28nm Multi-core  \nMicroprocessor Design Project. using Atoptech,  \nTimevision (SDC Verification), MCMM in Goldtime,  \nCalibre, Redhawk and Performance  \nTuning/Optimization using internal CAD tools. Sr VLSI/Physical Design Engineer Consultant NetLogic Microsystems October 2011  –  January 2012  (4 months) San Jose, California P&R for a few modules for 1.3 GHz 28nm Multi-core  \nMicroprocessor Design Project. using Atoptech,  \nTimevision (SDC Verification), MCMM in Goldtime,  \nCalibre, Redhawk and Performance  \nTuning/Optimization using internal CAD tools. Sr Physical Design Engineer Consultant Intel Corporation June 2011  –  October 2011  (5 months) Austin, Texas P&R for 22nm 1.5 million instance count using Synopsys Tools,  \nincluding ICC (P&R),Sta-RCXT (extraction ),  \nPT (MCMM), and Hercules (Physical Verification). Sr Physical Design Engineer Consultant Intel Corporation June 2011  –  October 2011  (5 months) Austin, Texas P&R for 22nm 1.5 million instance count using Synopsys Tools,  \nincluding ICC (P&R),Sta-RCXT (extraction ),  \nPT (MCMM), and Hercules (Physical Verification). Sr VLSI/Physical Design Engineer Consultant NetLogic Microsystems February 2011  –  April 2011  (3 months) San Jose, California Worked on multiple blocks in the 1.3 GHz 45nm Multi-core  \nMicroprocessor Design Project. \nResponsibilities included : \n1. Physical Design using the Atoptech tool suite \n2. Multi Corner Multi Mode Timing closure using  \nGoldTime (Extreme-DA) and Synopsys (StarRC XT) \n3. Physical Verification using Mentor (Calibre) \n4. Power Analysis, EM and IR using Apache (Redhawk) \n5. Performance Tuning/Optimization using internal CAD tools \n6. Formal Verification using Cadence (Conformal) Sr VLSI/Physical Design Engineer Consultant NetLogic Microsystems February 2011  –  April 2011  (3 months) San Jose, California Worked on multiple blocks in the 1.3 GHz 45nm Multi-core  \nMicroprocessor Design Project. \nResponsibilities included : \n1. Physical Design using the Atoptech tool suite \n2. Multi Corner Multi Mode Timing closure using  \nGoldTime (Extreme-DA) and Synopsys (StarRC XT) \n3. Physical Verification using Mentor (Calibre) \n4. Power Analysis, EM and IR using Apache (Redhawk) \n5. Performance Tuning/Optimization using internal CAD tools \n6. Formal Verification using Cadence (Conformal) ASIC Developer Consultant Intel April 2010  –  February 2011  (11 months) Chandler, Arizona Developed physical design, optimization, verification and timing closure flows \nfor 32nm design projects for external customers: \nTools used: \n1. Synopsys (DC, ICC, Hercules, StarRC-XT, PrimeTime-SI)  \n2. Cadence (conformal)  \n3. Intel fabrication Methodology flow support and Development \n4. Support external Customer base for tape-in ASIC Developer Consultant Intel April 2010  –  February 2011  (11 months) Chandler, Arizona Developed physical design, optimization, verification and timing closure flows \nfor 32nm design projects for external customers: \nTools used: \n1. Synopsys (DC, ICC, Hercules, StarRC-XT, PrimeTime-SI)  \n2. Cadence (conformal)  \n3. Intel fabrication Methodology flow support and Development \n4. Support external Customer base for tape-in Physical Design Engineer Consultant ST Microelectronics 2009  –  2009  (less than a year) Longmont, Colorado Worked on 90nm \"hard disk controller\" design. \nResponsibilites included:  \nPlace and Route (ICC) Floorplaning, Pre-routes, Placement, Clocking, PostCTSOpt, Clock pre-routes, Routing, Density, and Physical Verification (Calibre) Physical Design Engineer Consultant ST Microelectronics 2009  –  2009  (less than a year) Longmont, Colorado Worked on 90nm \"hard disk controller\" design. \nResponsibilites included:  \nPlace and Route (ICC) Floorplaning, Pre-routes, Placement, Clocking, PostCTSOpt, Clock pre-routes, Routing, Density, and Physical Verification (Calibre) Staff Physical Design Engineer Zilog August 2007  –  December 2008  (1 year 5 months) San Jose, California Tapeout of Multiple 32-bit ARM core design's, setup flow for Astro and ICC for faster turnaround of netlist, IP prep and tapeout. Staff Physical Design Engineer Zilog August 2007  –  December 2008  (1 year 5 months) San Jose, California Tapeout of Multiple 32-bit ARM core design's, setup flow for Astro and ICC for faster turnaround of netlist, IP prep and tapeout. Physical Design Engineer Consultant Intel Corporation March 2007  –  July 2007  (5 months) Santa Clara, California Digital Home Group Design, 90nm Place and Route (Astro) \nFloorplanning, Placement, CTS, Routing, STA (PT-SI) Physical Verification (Hercules) Physical Design Engineer Consultant Intel Corporation March 2007  –  July 2007  (5 months) Santa Clara, California Digital Home Group Design, 90nm Place and Route (Astro) \nFloorplanning, Placement, CTS, Routing, STA (PT-SI) Physical Verification (Hercules) Lead Physical Design Engineer GiQuila Corporation June 2005  –  October 2005  (5 months) San Jose, California Setup Flow for TSMC 90 Nanometer 8 layer metal process \nusing Magma software for hierachical 3D low power graphics  \nchip. Lead Physical Design Engineer GiQuila Corporation June 2005  –  October 2005  (5 months) San Jose, California Setup Flow for TSMC 90 Nanometer 8 layer metal process \nusing Magma software for hierachical 3D low power graphics  \nchip. Principal Engineer Esilicon Corporation November 2004  –  June 2005  (8 months) Sunnyvale, California *Tapeout of a storage networking flip chip design with high  \nspeed interfaces (DDR2, SPI4, PCI) Embedded processors  \nwith approximately 2 million placeable components. \nHierarchical with 16 blocks in TSMC .13 micron \n8 metal layer process. Principal Engineer Esilicon Corporation November 2004  –  June 2005  (8 months) Sunnyvale, California *Tapeout of a storage networking flip chip design with high  \nspeed interfaces (DDR2, SPI4, PCI) Embedded processors  \nwith approximately 2 million placeable components. \nHierarchical with 16 blocks in TSMC .13 micron \n8 metal layer process. Sr. Project Lead ReShape, Inc December 2001  –  November 2004  (3 years) Mountain View, California * Program Manager \n* Tapeout of multimedia processor in .13um design with  \n1.5 million components,6 million transistors and a \nDDR memory interface with a 220 MHz clk speed. \n* A wired communication mixed-signal Chip in TSMC .18um  \ntechnology.  \n* A Switch Fabric Flip-Chip with 1200 source-synchronous  \nsignal pins and 2600 power and ground pins in TSMC 7 \nlayer .18um process Clk speed of 250 MHz, 600K \ninstances and a die size of 14x14mm \n* Digital Video design with 270K components a 200MHz \nLVDS chip to chip interface with multiple hard macro’s, \nincluding a Mosys 1T memory, ARM core, ADC, DAC \nand 4 different I/O libraries with 7 power sources in \nTSMC .18um 6-layer process. \n* Initiate Astro purchase for timing closure, assist  \nwith CTS and flow integration. Sr. Project Lead ReShape, Inc December 2001  –  November 2004  (3 years) Mountain View, California * Program Manager \n* Tapeout of multimedia processor in .13um design with  \n1.5 million components,6 million transistors and a \nDDR memory interface with a 220 MHz clk speed. \n* A wired communication mixed-signal Chip in TSMC .18um  \ntechnology.  \n* A Switch Fabric Flip-Chip with 1200 source-synchronous  \nsignal pins and 2600 power and ground pins in TSMC 7 \nlayer .18um process Clk speed of 250 MHz, 600K \ninstances and a die size of 14x14mm \n* Digital Video design with 270K components a 200MHz \nLVDS chip to chip interface with multiple hard macro’s, \nincluding a Mosys 1T memory, ARM core, ADC, DAC \nand 4 different I/O libraries with 7 power sources in \nTSMC .18um 6-layer process. \n* Initiate Astro purchase for timing closure, assist  \nwith CTS and flow integration. Sr. Member of Technical Staff Chameleon Systems June 1999  –  December 2001  (2 years 7 months) San Jose, California * Responsible for tapeout of Chameleon’s first \nReconfigurable Communication Processor in .25um \nusing Avanti's Apollo software with a die size of 20x17mm \nwith DMA, ARC, CPU, Memory Controller, PCI, PIO,  \nCustom fabric (Datapath) Including FloorPlanning Place & \nRoute Extraction and Physical verification (DRC, LVS & ANT) \n* Initiate same design in .18um 6 layers with on board memory and a clock speed of 150 MHz. \n* Initiate/purchase, setup StarRC_XT extraction and Saturn tool for IPO and repeater insertion.  \n* Purchase and Set-up of Cadence Virtuoso software. Sr. Member of Technical Staff Chameleon Systems June 1999  –  December 2001  (2 years 7 months) San Jose, California * Responsible for tapeout of Chameleon’s first \nReconfigurable Communication Processor in .25um \nusing Avanti's Apollo software with a die size of 20x17mm \nwith DMA, ARC, CPU, Memory Controller, PCI, PIO,  \nCustom fabric (Datapath) Including FloorPlanning Place & \nRoute Extraction and Physical verification (DRC, LVS & ANT) \n* Initiate same design in .18um 6 layers with on board memory and a clock speed of 150 MHz. \n* Initiate/purchase, setup StarRC_XT extraction and Saturn tool for IPO and repeater insertion.  \n* Purchase and Set-up of Cadence Virtuoso software. Sr. Corporate Application Engineer Duet Technologies 1998  –  June 1999  (1 year) San Jose, California Sr. Corporate Application Engineer \nPlan DAC Demo's \nManage benchmarks, generate Standard Cell  \nArchitecture’s, abstracts and timing models for \nStandard cells and other I/P including routing  \nand verification. \n* Run synthesis through P/R of designs, utilizing  \nDC, Apollo and Silicone Ensemble. \n* Assist with integration of Cascade Design Automation  \nthat Duet purchased out of Bellevue, Washington. \n* Assist customers with tapeouts using Duet’s I/P and third party EDA software. \n* Purchase and set-up of Avanti’s Place and Route software. Sr. Corporate Application Engineer Duet Technologies 1998  –  June 1999  (1 year) San Jose, California Sr. Corporate Application Engineer \nPlan DAC Demo's \nManage benchmarks, generate Standard Cell  \nArchitecture’s, abstracts and timing models for \nStandard cells and other I/P including routing  \nand verification. \n* Run synthesis through P/R of designs, utilizing  \nDC, Apollo and Silicone Ensemble. \n* Assist with integration of Cascade Design Automation  \nthat Duet purchased out of Bellevue, Washington. \n* Assist customers with tapeouts using Duet’s I/P and third party EDA software. \n* Purchase and set-up of Avanti’s Place and Route software. Design Manager Aspec Technology 1995  –  1998  (3 years) Sunnyvale, California Manage a group of 3 designers \n*Setup Automation Flow to generate Models for P/R enviorment. \n* Design Service’s \n* Plan and Setup DAC Demo. \n* Generate library models for Silicon Ensemble and Apollo software. \n* Run Benchmarks for potential customers utilizing Aspec Libraries. \n* Support most Place and Route environments and methodologies. \n* Layout and verification of Single and Dual port memories \nusing Virtuoso, Dracula,Caliber and Aspec internal compiler. \n* Purchase and Set-up of Avanti’s P/R tools. Design Manager Aspec Technology 1995  –  1998  (3 years) Sunnyvale, California Manage a group of 3 designers \n*Setup Automation Flow to generate Models for P/R enviorment. \n* Design Service’s \n* Plan and Setup DAC Demo. \n* Generate library models for Silicon Ensemble and Apollo software. \n* Run Benchmarks for potential customers utilizing Aspec Libraries. \n* Support most Place and Route environments and methodologies. \n* Layout and verification of Single and Dual port memories \nusing Virtuoso, Dracula,Caliber and Aspec internal compiler. \n* Purchase and Set-up of Avanti’s P/R tools. Project Lead Chips and Technologies 1989  –  1995  (6 years) San Jose, California Many tapeouts and many party's { Ah, the good old days ;} Project Lead Chips and Technologies 1989  –  1995  (6 years) San Jose, California Many tapeouts and many party's { Ah, the good old days ;} Skills Static Timing Analysis Physical Design Flow Development Place & Route ASIC SoC DRC Timing Closure Physical Verification EDA Low-power Design LVS Floorplanning Logic Synthesis IC Mixed Signal Formal Verification VLSI Microprocessors Cadence Cadence Virtuoso Processors Power Analysis Synopsys tools Debugging Timing Hercules Circuit Design Virtuoso ARM Magma Digital Signal... SERDES Silicon TCL RTL design Compilers Tcl-Tk Functional Verification DFT Semiconductor Industry CMOS RTL Design See 28+     See less Skills  Static Timing Analysis Physical Design Flow Development Place & Route ASIC SoC DRC Timing Closure Physical Verification EDA Low-power Design LVS Floorplanning Logic Synthesis IC Mixed Signal Formal Verification VLSI Microprocessors Cadence Cadence Virtuoso Processors Power Analysis Synopsys tools Debugging Timing Hercules Circuit Design Virtuoso ARM Magma Digital Signal... SERDES Silicon TCL RTL design Compilers Tcl-Tk Functional Verification DFT Semiconductor Industry CMOS RTL Design See 28+     See less Static Timing Analysis Physical Design Flow Development Place & Route ASIC SoC DRC Timing Closure Physical Verification EDA Low-power Design LVS Floorplanning Logic Synthesis IC Mixed Signal Formal Verification VLSI Microprocessors Cadence Cadence Virtuoso Processors Power Analysis Synopsys tools Debugging Timing Hercules Circuit Design Virtuoso ARM Magma Digital Signal... SERDES Silicon TCL RTL design Compilers Tcl-Tk Functional Verification DFT Semiconductor Industry CMOS RTL Design See 28+     See less Static Timing Analysis Physical Design Flow Development Place & Route ASIC SoC DRC Timing Closure Physical Verification EDA Low-power Design LVS Floorplanning Logic Synthesis IC Mixed Signal Formal Verification VLSI Microprocessors Cadence Cadence Virtuoso Processors Power Analysis Synopsys tools Debugging Timing Hercules Circuit Design Virtuoso ARM Magma Digital Signal... SERDES Silicon TCL RTL design Compilers Tcl-Tk Functional Verification DFT Semiconductor Industry CMOS RTL Design See 28+     See less ", "Experience Senior System Consultant Intel Corporation July 2015  – Present (2 months) Tokyo, Japan PC & IoT Security, Remote Management, Application System Development, and so on. Security Consultant Intel Corporation January 2013  –  June 2015  (2 years 6 months) Tokyo, Japan Still working for Intel Anti-Theft Technology (AT) and Intel Identity Protection Technology (IPT) as well. :) Application engineer, Anti-Theft Technology Intel Corporation July 2009  –  December 2012  (3 years 6 months) Tokyo, Japan Technical Marketing Engineer Intel December 2004  –  June 2009  (4 years 7 months) Tokyo, Japan Technical Marketing Engineer for Digital Home Platform. (Viiv) \nTechnical Marketing Engineer for Digital Office Platform. (vPro) Technical Sales Manager LANDesk Software September 2003  –  December 2004  (1 year 4 months) Tokyo, Japan Techical Marketing Engineer Intel May 1996  –  September 2003  (7 years 5 months) Tokyo, Japan System Engineer for Network Devices & PC management software. \nTechnical Marketing Engineer for Server management, IPMI, EFI, and InfiniBand. \nTechnical Marketing Engineer for Integrated Graphics. System Engineer K.K. INTEC April 1987  –  May 1996  (9 years 2 months) Osaka, Japan Designed and developed so many Application Systems on Main Frame, Mini Computer (IBM S38 and AS/400), PC, etc. Senior System Consultant Intel Corporation July 2015  – Present (2 months) Tokyo, Japan PC & IoT Security, Remote Management, Application System Development, and so on. Senior System Consultant Intel Corporation July 2015  – Present (2 months) Tokyo, Japan PC & IoT Security, Remote Management, Application System Development, and so on. Security Consultant Intel Corporation January 2013  –  June 2015  (2 years 6 months) Tokyo, Japan Still working for Intel Anti-Theft Technology (AT) and Intel Identity Protection Technology (IPT) as well. :) Security Consultant Intel Corporation January 2013  –  June 2015  (2 years 6 months) Tokyo, Japan Still working for Intel Anti-Theft Technology (AT) and Intel Identity Protection Technology (IPT) as well. :) Application engineer, Anti-Theft Technology Intel Corporation July 2009  –  December 2012  (3 years 6 months) Tokyo, Japan Application engineer, Anti-Theft Technology Intel Corporation July 2009  –  December 2012  (3 years 6 months) Tokyo, Japan Technical Marketing Engineer Intel December 2004  –  June 2009  (4 years 7 months) Tokyo, Japan Technical Marketing Engineer for Digital Home Platform. (Viiv) \nTechnical Marketing Engineer for Digital Office Platform. (vPro) Technical Marketing Engineer Intel December 2004  –  June 2009  (4 years 7 months) Tokyo, Japan Technical Marketing Engineer for Digital Home Platform. (Viiv) \nTechnical Marketing Engineer for Digital Office Platform. (vPro) Technical Sales Manager LANDesk Software September 2003  –  December 2004  (1 year 4 months) Tokyo, Japan Technical Sales Manager LANDesk Software September 2003  –  December 2004  (1 year 4 months) Tokyo, Japan Techical Marketing Engineer Intel May 1996  –  September 2003  (7 years 5 months) Tokyo, Japan System Engineer for Network Devices & PC management software. \nTechnical Marketing Engineer for Server management, IPMI, EFI, and InfiniBand. \nTechnical Marketing Engineer for Integrated Graphics. Techical Marketing Engineer Intel May 1996  –  September 2003  (7 years 5 months) Tokyo, Japan System Engineer for Network Devices & PC management software. \nTechnical Marketing Engineer for Server management, IPMI, EFI, and InfiniBand. \nTechnical Marketing Engineer for Integrated Graphics. System Engineer K.K. INTEC April 1987  –  May 1996  (9 years 2 months) Osaka, Japan Designed and developed so many Application Systems on Main Frame, Mini Computer (IBM S38 and AS/400), PC, etc. System Engineer K.K. INTEC April 1987  –  May 1996  (9 years 2 months) Osaka, Japan Designed and developed so many Application Systems on Main Frame, Mini Computer (IBM S38 and AS/400), PC, etc. Languages English Japanese Native or bilingual proficiency English Japanese Native or bilingual proficiency English Japanese Native or bilingual proficiency Native or bilingual proficiency Skills Intel Semiconductors Mobile Devices Technical Marketing Go-to-market Strategy X86 Debugging System Architecture Device Drivers Computer Architecture Semiconductor Industry Security Skills  Intel Semiconductors Mobile Devices Technical Marketing Go-to-market Strategy X86 Debugging System Architecture Device Drivers Computer Architecture Semiconductor Industry Security Intel Semiconductors Mobile Devices Technical Marketing Go-to-market Strategy X86 Debugging System Architecture Device Drivers Computer Architecture Semiconductor Industry Security Intel Semiconductors Mobile Devices Technical Marketing Go-to-market Strategy X86 Debugging System Architecture Device Drivers Computer Architecture Semiconductor Industry Security Education Kansai University Bachelor of Laws (LL.B.),  Law 1983  – 1987 Activities and Societies:  Music Players Circle Kansai University Bachelor of Laws (LL.B.),  Law 1983  – 1987 Activities and Societies:  Music Players Circle Kansai University Bachelor of Laws (LL.B.),  Law 1983  – 1987 Activities and Societies:  Music Players Circle Kansai University Bachelor of Laws (LL.B.),  Law 1983  – 1987 Activities and Societies:  Music Players Circle ", "Summary I started my career as a trainee Design Engineer with Philips BL PMU in 2002. After a few years in the Shipping Industry, I joined THETA Microelectronics S.A., Athens, as Jr Layout Engineer. where I worked with highly experienced and professional RF Design and Layout Engineers. \n \nHaving become a Sr RF Layout Engineer with a big experience portfolio of RFIC projects, on May 2011 I moved to Consultancy for the Semiconductor Industry in Europe.  \nMy work in numerous projects together with experienced designers on VCOs, LNAs, LO chain, digital shifters, modeling, test benches for advanced RF modeling projects is a major plus on my experience and carrier.  \n \nWorking close with the designer, I learned to provide layout services together with a second \"proof\" approach for the circuits under design- something a Layouter must do under all circumstances, as this is the exact step that enhances the final performance of any IC project.  \n \nBrief Experience Overview \n \no Deep Submicron technology RF Layout \no Deep Submicron technology reliability test vehicle  \n \no RX,PLL chain for hearing aid application in 45nm CMOS \n \no Full IC layout of triband stand alone LNA in 250nm biCMOS.  \n \no Triband LNAs layout on 250nm biCMOS  \n \no Layout for full RFIC projects at 180nm BiCMOS (2.5 - 4GHz)and test RFIC at 90nm CMOS (60GHz). \n \no Port, design and characterization of baseband blocks such as Bandgap Reference Circuit, x^2 \no Power Signal Detector, DAC's and ADC's. \n \no HSpice simulation test benches based on extracted layout netlists for technology characterization. \n \no Technology migration for deep submicron projects  \n \no PCELL development based on SKILL programming \n \nSpecialties: \nRF Layout (from low frequencies up to 60GHz and above), specialized on  \n \n- VCO blocks,  \n- Mixer blocks, \n- LNA blocks \n- Hybrid 20GHz Interface \n \nTop Level Layout  \n- Transmitter 5GHz \n- Stand alone Tri Band LNA \n- Reliability Test Vehicle \n- RF Modeling structures Summary I started my career as a trainee Design Engineer with Philips BL PMU in 2002. After a few years in the Shipping Industry, I joined THETA Microelectronics S.A., Athens, as Jr Layout Engineer. where I worked with highly experienced and professional RF Design and Layout Engineers. \n \nHaving become a Sr RF Layout Engineer with a big experience portfolio of RFIC projects, on May 2011 I moved to Consultancy for the Semiconductor Industry in Europe.  \nMy work in numerous projects together with experienced designers on VCOs, LNAs, LO chain, digital shifters, modeling, test benches for advanced RF modeling projects is a major plus on my experience and carrier.  \n \nWorking close with the designer, I learned to provide layout services together with a second \"proof\" approach for the circuits under design- something a Layouter must do under all circumstances, as this is the exact step that enhances the final performance of any IC project.  \n \nBrief Experience Overview \n \no Deep Submicron technology RF Layout \no Deep Submicron technology reliability test vehicle  \n \no RX,PLL chain for hearing aid application in 45nm CMOS \n \no Full IC layout of triband stand alone LNA in 250nm biCMOS.  \n \no Triband LNAs layout on 250nm biCMOS  \n \no Layout for full RFIC projects at 180nm BiCMOS (2.5 - 4GHz)and test RFIC at 90nm CMOS (60GHz). \n \no Port, design and characterization of baseband blocks such as Bandgap Reference Circuit, x^2 \no Power Signal Detector, DAC's and ADC's. \n \no HSpice simulation test benches based on extracted layout netlists for technology characterization. \n \no Technology migration for deep submicron projects  \n \no PCELL development based on SKILL programming \n \nSpecialties: \nRF Layout (from low frequencies up to 60GHz and above), specialized on  \n \n- VCO blocks,  \n- Mixer blocks, \n- LNA blocks \n- Hybrid 20GHz Interface \n \nTop Level Layout  \n- Transmitter 5GHz \n- Stand alone Tri Band LNA \n- Reliability Test Vehicle \n- RF Modeling structures I started my career as a trainee Design Engineer with Philips BL PMU in 2002. After a few years in the Shipping Industry, I joined THETA Microelectronics S.A., Athens, as Jr Layout Engineer. where I worked with highly experienced and professional RF Design and Layout Engineers. \n \nHaving become a Sr RF Layout Engineer with a big experience portfolio of RFIC projects, on May 2011 I moved to Consultancy for the Semiconductor Industry in Europe.  \nMy work in numerous projects together with experienced designers on VCOs, LNAs, LO chain, digital shifters, modeling, test benches for advanced RF modeling projects is a major plus on my experience and carrier.  \n \nWorking close with the designer, I learned to provide layout services together with a second \"proof\" approach for the circuits under design- something a Layouter must do under all circumstances, as this is the exact step that enhances the final performance of any IC project.  \n \nBrief Experience Overview \n \no Deep Submicron technology RF Layout \no Deep Submicron technology reliability test vehicle  \n \no RX,PLL chain for hearing aid application in 45nm CMOS \n \no Full IC layout of triband stand alone LNA in 250nm biCMOS.  \n \no Triband LNAs layout on 250nm biCMOS  \n \no Layout for full RFIC projects at 180nm BiCMOS (2.5 - 4GHz)and test RFIC at 90nm CMOS (60GHz). \n \no Port, design and characterization of baseband blocks such as Bandgap Reference Circuit, x^2 \no Power Signal Detector, DAC's and ADC's. \n \no HSpice simulation test benches based on extracted layout netlists for technology characterization. \n \no Technology migration for deep submicron projects  \n \no PCELL development based on SKILL programming \n \nSpecialties: \nRF Layout (from low frequencies up to 60GHz and above), specialized on  \n \n- VCO blocks,  \n- Mixer blocks, \n- LNA blocks \n- Hybrid 20GHz Interface \n \nTop Level Layout  \n- Transmitter 5GHz \n- Stand alone Tri Band LNA \n- Reliability Test Vehicle \n- RF Modeling structures I started my career as a trainee Design Engineer with Philips BL PMU in 2002. After a few years in the Shipping Industry, I joined THETA Microelectronics S.A., Athens, as Jr Layout Engineer. where I worked with highly experienced and professional RF Design and Layout Engineers. \n \nHaving become a Sr RF Layout Engineer with a big experience portfolio of RFIC projects, on May 2011 I moved to Consultancy for the Semiconductor Industry in Europe.  \nMy work in numerous projects together with experienced designers on VCOs, LNAs, LO chain, digital shifters, modeling, test benches for advanced RF modeling projects is a major plus on my experience and carrier.  \n \nWorking close with the designer, I learned to provide layout services together with a second \"proof\" approach for the circuits under design- something a Layouter must do under all circumstances, as this is the exact step that enhances the final performance of any IC project.  \n \nBrief Experience Overview \n \no Deep Submicron technology RF Layout \no Deep Submicron technology reliability test vehicle  \n \no RX,PLL chain for hearing aid application in 45nm CMOS \n \no Full IC layout of triband stand alone LNA in 250nm biCMOS.  \n \no Triband LNAs layout on 250nm biCMOS  \n \no Layout for full RFIC projects at 180nm BiCMOS (2.5 - 4GHz)and test RFIC at 90nm CMOS (60GHz). \n \no Port, design and characterization of baseband blocks such as Bandgap Reference Circuit, x^2 \no Power Signal Detector, DAC's and ADC's. \n \no HSpice simulation test benches based on extracted layout netlists for technology characterization. \n \no Technology migration for deep submicron projects  \n \no PCELL development based on SKILL programming \n \nSpecialties: \nRF Layout (from low frequencies up to 60GHz and above), specialized on  \n \n- VCO blocks,  \n- Mixer blocks, \n- LNA blocks \n- Hybrid 20GHz Interface \n \nTop Level Layout  \n- Transmitter 5GHz \n- Stand alone Tri Band LNA \n- Reliability Test Vehicle \n- RF Modeling structures Experience Staff RFIC Layout Engineer Intel Corporation January 2014  – Present (1 year 8 months) Munich Area, Germany Intel Mobile Communications \n \nRF Layout for RFAD group- deep submicron technologies RFIC Layout Engineer, Consultant Intel Corporation April 2013  –  December 2013  (9 months) Munich Area, Germany Intel Mobile Communications, RF, Modeling and Characterization \n \nPCELL development with SKILL \nDeep submicron layout for reliability test structures \nTop level layout for RF Modeling structures IC Designer/Layout Engineer, Consultant Intel Corporation July 2012  –  March 2013  (9 months) Munich, Germany Intel Mobile Communications, Advanced Systems and Circuits \n \nTechnology migration layout/design for deep submicron projects, HSpice simulations RFIC Layout Engineer Consultant Intel Corporation November 2011  –  April 2012  (6 months) Munich Intel Mobile Communications, Physical Implemetation \n \nRF Layout Engineer embedded on the RX Layout Team of an R&D project in deep submicron technology RFIC Layout Engineer Consultant NXP Semiconductors May 2011  –  November 2011  (7 months) Nijmegen, The Netherlands Design Factory Nijmegen of NXP Semiconductor \n \nPhysical implementation and verification of RF blocks for various applications (Automotive, base-stations, hearing aid), in 250nm biCMOS, 140nm and 45 nm CMOS. Sr RF Layout Engineer THETA Microelectronic S.A. February 2007  –  May 2011  (4 years 4 months) Physical implementation of RF, IF and BB blocks for various technologies (180nm bicmos, 90nm cmos). Verification, extraction and characterization. \nTraining and supporting the team of Jr Layout Engineers \n \nCharacterization, porting, design and optimizing of BB blocks Project Manager Electonic Dept/ Sales Manager Digital Control Systems International Ltd February 2005  –  December 2006  (1 year 11 months) Greek office, Peraeus Sales Manager responsible for the representation of Samsung Heavy Industries/Marine Electronics in Greek Maritime Market.  \n \nInspector and Service Engineer of Samsung Electronic Marine Equipment. \n \nProject Manager of the newly founded Electronic Dept of the company. MSc Thesis project as a trainee Philips Semiconductors Business Line Power Managment November 2002  –  July 2003  (9 months) Nijmegen, The Netherlands Feasibility Study for the development of a Cyclic ADC in 0.25um technology. \n \n \nPatent  \nKaravidas et al. \nUS7830293 \nalso published as  \nWO2005122410 (A1) (EP1759461)  \nJP2008502264  \nCN1965485 \n \n\"Method of cyclically converting an analog signal to a multi-bit digital signal and converter for performing the method \" Staff RFIC Layout Engineer Intel Corporation January 2014  – Present (1 year 8 months) Munich Area, Germany Intel Mobile Communications \n \nRF Layout for RFAD group- deep submicron technologies Staff RFIC Layout Engineer Intel Corporation January 2014  – Present (1 year 8 months) Munich Area, Germany Intel Mobile Communications \n \nRF Layout for RFAD group- deep submicron technologies RFIC Layout Engineer, Consultant Intel Corporation April 2013  –  December 2013  (9 months) Munich Area, Germany Intel Mobile Communications, RF, Modeling and Characterization \n \nPCELL development with SKILL \nDeep submicron layout for reliability test structures \nTop level layout for RF Modeling structures RFIC Layout Engineer, Consultant Intel Corporation April 2013  –  December 2013  (9 months) Munich Area, Germany Intel Mobile Communications, RF, Modeling and Characterization \n \nPCELL development with SKILL \nDeep submicron layout for reliability test structures \nTop level layout for RF Modeling structures IC Designer/Layout Engineer, Consultant Intel Corporation July 2012  –  March 2013  (9 months) Munich, Germany Intel Mobile Communications, Advanced Systems and Circuits \n \nTechnology migration layout/design for deep submicron projects, HSpice simulations IC Designer/Layout Engineer, Consultant Intel Corporation July 2012  –  March 2013  (9 months) Munich, Germany Intel Mobile Communications, Advanced Systems and Circuits \n \nTechnology migration layout/design for deep submicron projects, HSpice simulations RFIC Layout Engineer Consultant Intel Corporation November 2011  –  April 2012  (6 months) Munich Intel Mobile Communications, Physical Implemetation \n \nRF Layout Engineer embedded on the RX Layout Team of an R&D project in deep submicron technology RFIC Layout Engineer Consultant Intel Corporation November 2011  –  April 2012  (6 months) Munich Intel Mobile Communications, Physical Implemetation \n \nRF Layout Engineer embedded on the RX Layout Team of an R&D project in deep submicron technology RFIC Layout Engineer Consultant NXP Semiconductors May 2011  –  November 2011  (7 months) Nijmegen, The Netherlands Design Factory Nijmegen of NXP Semiconductor \n \nPhysical implementation and verification of RF blocks for various applications (Automotive, base-stations, hearing aid), in 250nm biCMOS, 140nm and 45 nm CMOS. RFIC Layout Engineer Consultant NXP Semiconductors May 2011  –  November 2011  (7 months) Nijmegen, The Netherlands Design Factory Nijmegen of NXP Semiconductor \n \nPhysical implementation and verification of RF blocks for various applications (Automotive, base-stations, hearing aid), in 250nm biCMOS, 140nm and 45 nm CMOS. Sr RF Layout Engineer THETA Microelectronic S.A. February 2007  –  May 2011  (4 years 4 months) Physical implementation of RF, IF and BB blocks for various technologies (180nm bicmos, 90nm cmos). Verification, extraction and characterization. \nTraining and supporting the team of Jr Layout Engineers \n \nCharacterization, porting, design and optimizing of BB blocks Sr RF Layout Engineer THETA Microelectronic S.A. February 2007  –  May 2011  (4 years 4 months) Physical implementation of RF, IF and BB blocks for various technologies (180nm bicmos, 90nm cmos). Verification, extraction and characterization. \nTraining and supporting the team of Jr Layout Engineers \n \nCharacterization, porting, design and optimizing of BB blocks Project Manager Electonic Dept/ Sales Manager Digital Control Systems International Ltd February 2005  –  December 2006  (1 year 11 months) Greek office, Peraeus Sales Manager responsible for the representation of Samsung Heavy Industries/Marine Electronics in Greek Maritime Market.  \n \nInspector and Service Engineer of Samsung Electronic Marine Equipment. \n \nProject Manager of the newly founded Electronic Dept of the company. Project Manager Electonic Dept/ Sales Manager Digital Control Systems International Ltd February 2005  –  December 2006  (1 year 11 months) Greek office, Peraeus Sales Manager responsible for the representation of Samsung Heavy Industries/Marine Electronics in Greek Maritime Market.  \n \nInspector and Service Engineer of Samsung Electronic Marine Equipment. \n \nProject Manager of the newly founded Electronic Dept of the company. MSc Thesis project as a trainee Philips Semiconductors Business Line Power Managment November 2002  –  July 2003  (9 months) Nijmegen, The Netherlands Feasibility Study for the development of a Cyclic ADC in 0.25um technology. \n \n \nPatent  \nKaravidas et al. \nUS7830293 \nalso published as  \nWO2005122410 (A1) (EP1759461)  \nJP2008502264  \nCN1965485 \n \n\"Method of cyclically converting an analog signal to a multi-bit digital signal and converter for performing the method \" MSc Thesis project as a trainee Philips Semiconductors Business Line Power Managment November 2002  –  July 2003  (9 months) Nijmegen, The Netherlands Feasibility Study for the development of a Cyclic ADC in 0.25um technology. \n \n \nPatent  \nKaravidas et al. \nUS7830293 \nalso published as  \nWO2005122410 (A1) (EP1759461)  \nJP2008502264  \nCN1965485 \n \n\"Method of cyclically converting an analog signal to a multi-bit digital signal and converter for performing the method \" Skills VCO layout RX LPF layout LO path layout LNA layout Chip level layout Bias blocks design and... Semiconductors IC CMOS Electronics Semiconductor Industry Analog PLL RF BiCMOS VCO Cadence Virtuoso DAC Mixed Signal Cadence ASIC LVS DRC Physical Design LNA Integrated Circuit... Analog Circuit Design Circuit Design Spectre Simulations Embedded Systems Physics Physical Verification Power Management Microelectronics IC layout SoC Verilog Floorplanning TCL Silicon VLSI Low-power Design Characterization SPICE EDA DFT See 32+     See less Skills  VCO layout RX LPF layout LO path layout LNA layout Chip level layout Bias blocks design and... Semiconductors IC CMOS Electronics Semiconductor Industry Analog PLL RF BiCMOS VCO Cadence Virtuoso DAC Mixed Signal Cadence ASIC LVS DRC Physical Design LNA Integrated Circuit... Analog Circuit Design Circuit Design Spectre Simulations Embedded Systems Physics Physical Verification Power Management Microelectronics IC layout SoC Verilog Floorplanning TCL Silicon VLSI Low-power Design Characterization SPICE EDA DFT See 32+     See less VCO layout RX LPF layout LO path layout LNA layout Chip level layout Bias blocks design and... Semiconductors IC CMOS Electronics Semiconductor Industry Analog PLL RF BiCMOS VCO Cadence Virtuoso DAC Mixed Signal Cadence ASIC LVS DRC Physical Design LNA Integrated Circuit... Analog Circuit Design Circuit Design Spectre Simulations Embedded Systems Physics Physical Verification Power Management Microelectronics IC layout SoC Verilog Floorplanning TCL Silicon VLSI Low-power Design Characterization SPICE EDA DFT See 32+     See less VCO layout RX LPF layout LO path layout LNA layout Chip level layout Bias blocks design and... Semiconductors IC CMOS Electronics Semiconductor Industry Analog PLL RF BiCMOS VCO Cadence Virtuoso DAC Mixed Signal Cadence ASIC LVS DRC Physical Design LNA Integrated Circuit... Analog Circuit Design Circuit Design Spectre Simulations Embedded Systems Physics Physical Verification Power Management Microelectronics IC layout SoC Verilog Floorplanning TCL Silicon VLSI Low-power Design Characterization SPICE EDA DFT See 32+     See less Education Aristotle University of Thessaloniki Master in Science,  MSc Electronic Physics 2000  – 2004 Dissertation: \" A Switched Capacitor High-Speed Cyclic ADC at 0.25um technology with 8/10 bit Resolution\" Aristotle University of Thessaloniki BS in,  Physics 1992  – 2000 Bachelor degree in Physics in November 2000 1st High School of Zografou, Athens 1988  – 1991 Aristotle University of Thessaloniki Master in Science,  MSc Electronic Physics 2000  – 2004 Dissertation: \" A Switched Capacitor High-Speed Cyclic ADC at 0.25um technology with 8/10 bit Resolution\" Aristotle University of Thessaloniki Master in Science,  MSc Electronic Physics 2000  – 2004 Dissertation: \" A Switched Capacitor High-Speed Cyclic ADC at 0.25um technology with 8/10 bit Resolution\" Aristotle University of Thessaloniki Master in Science,  MSc Electronic Physics 2000  – 2004 Dissertation: \" A Switched Capacitor High-Speed Cyclic ADC at 0.25um technology with 8/10 bit Resolution\" Aristotle University of Thessaloniki BS in,  Physics 1992  – 2000 Bachelor degree in Physics in November 2000 Aristotle University of Thessaloniki BS in,  Physics 1992  – 2000 Bachelor degree in Physics in November 2000 Aristotle University of Thessaloniki BS in,  Physics 1992  – 2000 Bachelor degree in Physics in November 2000 1st High School of Zografou, Athens 1988  – 1991 1st High School of Zografou, Athens 1988  – 1991 1st High School of Zografou, Athens 1988  – 1991 Honors & Awards Additional Honors & Awards June 2003 - Philips, BL Power Managment Student Recognition Award for excellent performance in C050PMU 10-12bit Cyclic ADC Additional Honors & Awards June 2003 - Philips, BL Power Managment Student Recognition Award for excellent performance in C050PMU 10-12bit Cyclic ADC Additional Honors & Awards June 2003 - Philips, BL Power Managment Student Recognition Award for excellent performance in C050PMU 10-12bit Cyclic ADC Additional Honors & Awards June 2003 - Philips, BL Power Managment Student Recognition Award for excellent performance in C050PMU 10-12bit Cyclic ADC ", "Summary My passion and mastery of craft is as an expert level search consultant who builds startups and emerging growth technology ventures.  \n \nWe add value by focused search and hiring of key persons and teams who go on to create tens of millions of dollars in real business value through execution and the development of compelling products and services. \n \nMost of the last 20 years have been spent on the inside of fast moving technology ventures working with founders, board, executive teams and managers in the capacity of trusted consultant and adviser. \n \nSpecialties: IoT, Virtual Reality,Augmented Reality, AR/VR, OpenGL, CUDA, Multithreading, Parallel processing, Oculus, VR, Virtualization, Visualization, Vision Processing, Cloud gaming, Virtual Reality, Hadoop, Big Data, Machine Learning, Digital Marketing, Enterprise Software, Hardware, Consumer Electronics, Networking ,Security, Linux/Unix Kernel \nOur organizational expertise is in: \nEntire teams, *C -level Executives, Engineering, product development, Product management, Marketing, Sales Summary My passion and mastery of craft is as an expert level search consultant who builds startups and emerging growth technology ventures.  \n \nWe add value by focused search and hiring of key persons and teams who go on to create tens of millions of dollars in real business value through execution and the development of compelling products and services. \n \nMost of the last 20 years have been spent on the inside of fast moving technology ventures working with founders, board, executive teams and managers in the capacity of trusted consultant and adviser. \n \nSpecialties: IoT, Virtual Reality,Augmented Reality, AR/VR, OpenGL, CUDA, Multithreading, Parallel processing, Oculus, VR, Virtualization, Visualization, Vision Processing, Cloud gaming, Virtual Reality, Hadoop, Big Data, Machine Learning, Digital Marketing, Enterprise Software, Hardware, Consumer Electronics, Networking ,Security, Linux/Unix Kernel \nOur organizational expertise is in: \nEntire teams, *C -level Executives, Engineering, product development, Product management, Marketing, Sales My passion and mastery of craft is as an expert level search consultant who builds startups and emerging growth technology ventures.  \n \nWe add value by focused search and hiring of key persons and teams who go on to create tens of millions of dollars in real business value through execution and the development of compelling products and services. \n \nMost of the last 20 years have been spent on the inside of fast moving technology ventures working with founders, board, executive teams and managers in the capacity of trusted consultant and adviser. \n \nSpecialties: IoT, Virtual Reality,Augmented Reality, AR/VR, OpenGL, CUDA, Multithreading, Parallel processing, Oculus, VR, Virtualization, Visualization, Vision Processing, Cloud gaming, Virtual Reality, Hadoop, Big Data, Machine Learning, Digital Marketing, Enterprise Software, Hardware, Consumer Electronics, Networking ,Security, Linux/Unix Kernel \nOur organizational expertise is in: \nEntire teams, *C -level Executives, Engineering, product development, Product management, Marketing, Sales My passion and mastery of craft is as an expert level search consultant who builds startups and emerging growth technology ventures.  \n \nWe add value by focused search and hiring of key persons and teams who go on to create tens of millions of dollars in real business value through execution and the development of compelling products and services. \n \nMost of the last 20 years have been spent on the inside of fast moving technology ventures working with founders, board, executive teams and managers in the capacity of trusted consultant and adviser. \n \nSpecialties: IoT, Virtual Reality,Augmented Reality, AR/VR, OpenGL, CUDA, Multithreading, Parallel processing, Oculus, VR, Virtualization, Visualization, Vision Processing, Cloud gaming, Virtual Reality, Hadoop, Big Data, Machine Learning, Digital Marketing, Enterprise Software, Hardware, Consumer Electronics, Networking ,Security, Linux/Unix Kernel \nOur organizational expertise is in: \nEntire teams, *C -level Executives, Engineering, product development, Product management, Marketing, Sales Experience Senior Technical Recruiter/Executive Search Consultant Intel Corporation July 2015  – Present (2 months) Santa Clara Ca The Data Center Group (DCG) drives new products technologies from high-end co-processors for supercomputers to low-energy systems for enterprise and the cloud, as well as solutions for big data and intelligent devices. The group is a worldwide organization that develops the products and technologies that power nine of every 10 servers sold worldwide.  Sr Technical Recruiter/Executive Search Consultant - Cloud Computing Technology Intel Corporation July 2015  – Present (2 months) Santa Clara, CA Executive Search Consultant/Talent Acquisition Leader Matterport November 2014  – Present (10 months) Mountain View Ca Matterport is a 3D media startup shaking up the 3D world. Our team has developed an end-to-end 3D media platform that allows anyone to create, edit, and share 3D models of real-world spaces. \n \nOur products include: \n- The Matterport Pro 3D Camera for capturing real spaces in 3D \n- The Matterport Cloud for processing and hosting 3D models \n- Matterport Portal, our system for viewing, editing, and managing models; collaborating with colleagues; and sharing models with others \n- Matterport 3D Showcase, a browser-based 3D media player that runs on WebGL, which allows anyone to view 3D models in their browser with no additional software \n \nOur tools are already used by hundreds of professionals in a variety of verticals, including real estate, hospitality, and location scouting, as well as by hobbyists who just want to dive in to 3D. \n \nWe’re growing fast. If you’re passionate about solving cutting-edge problems in computer vision and hardware design and creating order-of-magnitude improvements in the ability to easily create and share 3D models of real world spaces, we want to talk to you. Executive Search Consultant - Founder/Managing Partner Greatpeople.com July 1997  – Present (18 years 2 months) Woodside, CA Great People's core expertise is hiring key engineers, product teams and executives for venture backed startups and emerging growth companies. Our focus is on building complete organizations and high velocity teams who deliver a successful outcome. Working in tandem with founders and executive management teams we function as an dedicated search and strategic recruiting partner. Director, Talent Acquisition/Executive Search OnLive (Acquired by Sony) September 2012  –  April 2015  (2 years 8 months) Palo Alto, CA In August 2012 Lauder Partners acquired the assets of OnLive, Inc. to form OL2. Equipped with a substantial patent portfolio covering streaming low latency-sensitive CPU/GPU intensive applications for enterprise, 3D simulation and cloud gaming. Successfully built and managed strategic sourcing and recruiting teams, hired core engineering, devops, infrastructure, product, and executive teams.  \nSet up complete recruiting infrastructure and achieved a 95% offer acceptance rate while maintaining exceptionally low cost per hire metrics.  Talent Acquisition/Executive Search Consultant Jaunt VR October 2013  –  October 2014  (1 year 1 month) Palo Alto Jaunt's technology combines computational photography, statistical algorithms, massively parallel processing, cutting-edge hardware and virtual reality.  \n \nHired by Redpoint Ventures entrepreneur in residence/founders to build and grow early stage core teams in companies first year. Successfully attracted and hired vp content sw/hw and infrastructure helping launch this dynamic new category venture from incubation stage though A & B funding rounds in one year. JauntVR has now reached orbit and is leading the charge, building the future of this emerging new technology platform called Cinematic VR. Talent Acquisition/Executive Search Consultant 24/7 Inc July 2012  –  October 2012  (4 months) Campbell, CA Privately held, profitable, under the radar technology startup http://247-inc.com/ offers Cloud based Predictive Experience (PX) Platform that manages more than 2.5 billion speech and online self-service interactions annually. Talent Acquisition/Executive Search Consultant Greatpeople.com | Client OnLive July 2011  –  May 2012  (11 months) Palo Alto, Ca Talent Acquitition/Executive Search Consultant Whitesky January 2011  –  September 2011  (9 months) San Mateo, CA Security Software, cloud, mobile markets. Talent Acquisition/Executive search consultant Infoblox January 2011  –  May 2011  (5 months) Santa Clara, Ca Sourced/Recruited Infoblox’s first Director Hardware Engineering, ATG Group - Principal Engineers and Sr server side sw engineers, Santa Clara/ Vancouver BC. Talent Acquisition/Executive Search Consultant Greatpeople.com | Client Adchemy Inc.(Acquired @WalmartLabs) November 2008  –  December 2010  (2 years 2 months) Digital Marketing Technology Company offering SaaS based Audience Data Cloud. Responsible for full life cycle recruiting and executive search across full company spectrum. Executive Search Consultant, Sr contract recruiter Greatpeople.com | Client Stealth September 2008  –  February 2009  (6 months) Can not say Executive Search Consultant, Diversity Recruiter, Strategic sourcing Intel Corporation September 2007  –  February 2009  (1 year 6 months) Hillsboro, Or Executive Search Group - Diversity Strategic Sourcing \nSenior member of a 2 person pilot diversity recruiting initiative chartered to increase Intel’s executive level diversity hiring for Digital Enterprise Group. Helped design and execute program, exceeded all milestones and program marked as outstanding success with Intel executive management.  \n \nExecutive Search for Principal Engineers, Fellows, Architects and VP's within Digital Enterprise Group. Specializing in the areas of Circuit Design, Validation, Component Design, Automation tools, 3D Graphics, Ingredient stack including CPU, Chipsets, Memory Solutions, Data Storage, Virtualization, Cloud Computing, Opensource, Linux Kernel. Executive search consultant, Sr contract recruiter, sourcer Greatpeople.com | Client HSBC Card Services(Acquired by CapitalOne) September 2006  –  February 2009  (2 years 6 months) Tigard, OR Senior executive member of elite US based strategic sourcing group specializing in identifying, engaging and hiring the top minds in the analytical finance universe for HSBC USA Card and Retail Services. Roles ranged from Sr Analyst to SVP/GM. Skill sets encompass all aspects of Data Driven Qualitative and Quantitative Marketing Analytics/ Strategies, Risk, Finance, Analytical Modeling, Search technologies, etc. Executive Search Consultant, Sr contract recruiter Platial October 2005  –  March 2006  (6 months) Executive Search, Sr contract recruiter, Sourcing Manager Greatpeople.com | Client Secret Seal(PSS Systems) (Acquired by IBM) September 2001  –  August 2002  (1 year) Palo Alto, Ca Hired by founder/CEO of this 4 person early stage startup. Hired first Architects, early engineering and executive teams.  \nAcquired by IBM in 2010. Executive Search Consultant, Sr contract recruiter Greatpeople.com | Client Kontiki (Acquired by RSA) November 2000  –  October 2001  (1 year) Mt View, Ca Was brought into this early stage 10 person start up in peer-assisted content delivery technology space. Hired initial core engineering and infrastructure teams. Company was acquired by VeriSign in 2006. Executive Search, Sourcing - Recruitment Consultant Greatpeople.com | Client Timetra (Acquired by Alcatel) December 2000  –  September 2001  (10 months) Brought in by CEO to hire Principal MPLS Engineers/Architects for this early stage leading IP/MPLS edge routing startup.  \nAcquired by Alcatel in 2003. Executive Search, Sr contract recruiter, Recruitment manager Greatpeople.com | Client Hotjobs.com (Acquired by Yahoo) 2000  –  2001  (1 year) Hired by company CTO/GM to rebuild key Executive/Engineering teams resulting from recent acquisition of a company called Resumix. Rebuilt executive teams, VP Engineering, VP Professional Services and key developers along with other infrastructure roles. \nHotJobs was acquired by Yahoo at the end of 2001. Executive Search Consultant, Sr contract recruiter, Manager Greatpeople.com | Client Network Alchemy (Acquired by Nokia) February 1999  –  January 2000  (1 year) Santa Cruz, Ca Hired by CEO of this young start up to build out sr engineering and executive teams.  \nNetwork Alchemy developed the industry's first PPTP/L2TP CryptoCluster IPSec and IKE VPN server solutions with Triple DES encryption. We were acquired by Nokia at just over 80 employees in February 2001. Executive Search Consultant, Sr contract recruiter, Manager Greatpeople.com | Client Netflix May 1998  –  August 1999  (1 year 4 months) Scotts Valley, Ca Hired by early investors of this brand new 10 person start up to manage and build technical/business, marketing and executive teams. Worked closely with CEO and founder to hire early engineering and critical Sr. Management teams. Executive Recruiting Consultant, Sr contract recruiter Greatpeople | Client Remedy Inc.(Acquired by BMC) July 1997  –  January 1998  (7 months) Hired to build out Global Customer services and support,Tier 1 through tier 3 doubling the organization 50-100 in 7 Months. Remedy AR System was a market leading client–server software application development environment. \nAcquired by BMC Executive Recruiting Consultant, Staffing Manager Starfish Software (Acquired by Motorola) September 1996  –  September 1997  (1 year 1 month) Scotts Valley, CA Executive Recruiting Consultant ShareData (Acquired by E*Trade) March 1997  –  August 1997  (6 months) Mountain View, CA Sr Technical Recruiting Consultant Openwave Systems April 1996  –  July 1997  (1 year 4 months) Redwood Shores, Ca Unwired Planet Inc. (Openwave)  \nRecruited by the CEO following the A round of funding to build out all core engineering , executive management and infrastructure teams. Responsible for hiring the first 80 employees in this early innovator of Wireless Application Protocol (WAP) for the mobile phone sector. \n Executive Search Consultant Palm (Acquired by HP) July 1996  –  November 1996  (5 months) Sunnyvale, CA Sr Technical Recruiter/Talent Ambassador Netscape Communications (Acquired by AOL) June 1995  –  June 1996  (1 year 1 month) Mountain View, CA Netscape Communications Corporation - Sr. Technical Recruiter/Talent Ambassador -6/95 to 6/96  \n Sr Technical Recruiter/Recruiting Lead/Manager Sun Microsystems (Acquired by Oracle) December 1993  –  June 1995  (1 year 7 months) Sun Microsystems - Sr. Technical Recruiter/Manager - 12/93 - 6/95  \nResponsible for hiring technology and product teams for project DOE, First Person (Became JavaSoft), and Sun Labs.  \n \n Sr Technical Recruiter Rational Software (Acquired by IBM) April 1993  –  December 1993  (9 months) Rational Software Inc. - Sr. Technical Recruiter - 4/93 to 12/93  \n Senior Technical Recruiter/Executive Search Consultant Intel Corporation July 2015  – Present (2 months) Santa Clara Ca The Data Center Group (DCG) drives new products technologies from high-end co-processors for supercomputers to low-energy systems for enterprise and the cloud, as well as solutions for big data and intelligent devices. The group is a worldwide organization that develops the products and technologies that power nine of every 10 servers sold worldwide.  Senior Technical Recruiter/Executive Search Consultant Intel Corporation July 2015  – Present (2 months) Santa Clara Ca The Data Center Group (DCG) drives new products technologies from high-end co-processors for supercomputers to low-energy systems for enterprise and the cloud, as well as solutions for big data and intelligent devices. The group is a worldwide organization that develops the products and technologies that power nine of every 10 servers sold worldwide.  Sr Technical Recruiter/Executive Search Consultant - Cloud Computing Technology Intel Corporation July 2015  – Present (2 months) Santa Clara, CA Sr Technical Recruiter/Executive Search Consultant - Cloud Computing Technology Intel Corporation July 2015  – Present (2 months) Santa Clara, CA Executive Search Consultant/Talent Acquisition Leader Matterport November 2014  – Present (10 months) Mountain View Ca Matterport is a 3D media startup shaking up the 3D world. Our team has developed an end-to-end 3D media platform that allows anyone to create, edit, and share 3D models of real-world spaces. \n \nOur products include: \n- The Matterport Pro 3D Camera for capturing real spaces in 3D \n- The Matterport Cloud for processing and hosting 3D models \n- Matterport Portal, our system for viewing, editing, and managing models; collaborating with colleagues; and sharing models with others \n- Matterport 3D Showcase, a browser-based 3D media player that runs on WebGL, which allows anyone to view 3D models in their browser with no additional software \n \nOur tools are already used by hundreds of professionals in a variety of verticals, including real estate, hospitality, and location scouting, as well as by hobbyists who just want to dive in to 3D. \n \nWe’re growing fast. If you’re passionate about solving cutting-edge problems in computer vision and hardware design and creating order-of-magnitude improvements in the ability to easily create and share 3D models of real world spaces, we want to talk to you. Executive Search Consultant/Talent Acquisition Leader Matterport November 2014  – Present (10 months) Mountain View Ca Matterport is a 3D media startup shaking up the 3D world. Our team has developed an end-to-end 3D media platform that allows anyone to create, edit, and share 3D models of real-world spaces. \n \nOur products include: \n- The Matterport Pro 3D Camera for capturing real spaces in 3D \n- The Matterport Cloud for processing and hosting 3D models \n- Matterport Portal, our system for viewing, editing, and managing models; collaborating with colleagues; and sharing models with others \n- Matterport 3D Showcase, a browser-based 3D media player that runs on WebGL, which allows anyone to view 3D models in their browser with no additional software \n \nOur tools are already used by hundreds of professionals in a variety of verticals, including real estate, hospitality, and location scouting, as well as by hobbyists who just want to dive in to 3D. \n \nWe’re growing fast. If you’re passionate about solving cutting-edge problems in computer vision and hardware design and creating order-of-magnitude improvements in the ability to easily create and share 3D models of real world spaces, we want to talk to you. Executive Search Consultant - Founder/Managing Partner Greatpeople.com July 1997  – Present (18 years 2 months) Woodside, CA Great People's core expertise is hiring key engineers, product teams and executives for venture backed startups and emerging growth companies. Our focus is on building complete organizations and high velocity teams who deliver a successful outcome. Working in tandem with founders and executive management teams we function as an dedicated search and strategic recruiting partner. Executive Search Consultant - Founder/Managing Partner Greatpeople.com July 1997  – Present (18 years 2 months) Woodside, CA Great People's core expertise is hiring key engineers, product teams and executives for venture backed startups and emerging growth companies. Our focus is on building complete organizations and high velocity teams who deliver a successful outcome. Working in tandem with founders and executive management teams we function as an dedicated search and strategic recruiting partner. Director, Talent Acquisition/Executive Search OnLive (Acquired by Sony) September 2012  –  April 2015  (2 years 8 months) Palo Alto, CA In August 2012 Lauder Partners acquired the assets of OnLive, Inc. to form OL2. Equipped with a substantial patent portfolio covering streaming low latency-sensitive CPU/GPU intensive applications for enterprise, 3D simulation and cloud gaming. Successfully built and managed strategic sourcing and recruiting teams, hired core engineering, devops, infrastructure, product, and executive teams.  \nSet up complete recruiting infrastructure and achieved a 95% offer acceptance rate while maintaining exceptionally low cost per hire metrics.  Director, Talent Acquisition/Executive Search OnLive (Acquired by Sony) September 2012  –  April 2015  (2 years 8 months) Palo Alto, CA In August 2012 Lauder Partners acquired the assets of OnLive, Inc. to form OL2. Equipped with a substantial patent portfolio covering streaming low latency-sensitive CPU/GPU intensive applications for enterprise, 3D simulation and cloud gaming. Successfully built and managed strategic sourcing and recruiting teams, hired core engineering, devops, infrastructure, product, and executive teams.  \nSet up complete recruiting infrastructure and achieved a 95% offer acceptance rate while maintaining exceptionally low cost per hire metrics.  Talent Acquisition/Executive Search Consultant Jaunt VR October 2013  –  October 2014  (1 year 1 month) Palo Alto Jaunt's technology combines computational photography, statistical algorithms, massively parallel processing, cutting-edge hardware and virtual reality.  \n \nHired by Redpoint Ventures entrepreneur in residence/founders to build and grow early stage core teams in companies first year. Successfully attracted and hired vp content sw/hw and infrastructure helping launch this dynamic new category venture from incubation stage though A & B funding rounds in one year. JauntVR has now reached orbit and is leading the charge, building the future of this emerging new technology platform called Cinematic VR. Talent Acquisition/Executive Search Consultant Jaunt VR October 2013  –  October 2014  (1 year 1 month) Palo Alto Jaunt's technology combines computational photography, statistical algorithms, massively parallel processing, cutting-edge hardware and virtual reality.  \n \nHired by Redpoint Ventures entrepreneur in residence/founders to build and grow early stage core teams in companies first year. Successfully attracted and hired vp content sw/hw and infrastructure helping launch this dynamic new category venture from incubation stage though A & B funding rounds in one year. JauntVR has now reached orbit and is leading the charge, building the future of this emerging new technology platform called Cinematic VR. Talent Acquisition/Executive Search Consultant 24/7 Inc July 2012  –  October 2012  (4 months) Campbell, CA Privately held, profitable, under the radar technology startup http://247-inc.com/ offers Cloud based Predictive Experience (PX) Platform that manages more than 2.5 billion speech and online self-service interactions annually. Talent Acquisition/Executive Search Consultant 24/7 Inc July 2012  –  October 2012  (4 months) Campbell, CA Privately held, profitable, under the radar technology startup http://247-inc.com/ offers Cloud based Predictive Experience (PX) Platform that manages more than 2.5 billion speech and online self-service interactions annually. Talent Acquisition/Executive Search Consultant Greatpeople.com | Client OnLive July 2011  –  May 2012  (11 months) Palo Alto, Ca Talent Acquisition/Executive Search Consultant Greatpeople.com | Client OnLive July 2011  –  May 2012  (11 months) Palo Alto, Ca Talent Acquitition/Executive Search Consultant Whitesky January 2011  –  September 2011  (9 months) San Mateo, CA Security Software, cloud, mobile markets. Talent Acquitition/Executive Search Consultant Whitesky January 2011  –  September 2011  (9 months) San Mateo, CA Security Software, cloud, mobile markets. Talent Acquisition/Executive search consultant Infoblox January 2011  –  May 2011  (5 months) Santa Clara, Ca Sourced/Recruited Infoblox’s first Director Hardware Engineering, ATG Group - Principal Engineers and Sr server side sw engineers, Santa Clara/ Vancouver BC. Talent Acquisition/Executive search consultant Infoblox January 2011  –  May 2011  (5 months) Santa Clara, Ca Sourced/Recruited Infoblox’s first Director Hardware Engineering, ATG Group - Principal Engineers and Sr server side sw engineers, Santa Clara/ Vancouver BC. Talent Acquisition/Executive Search Consultant Greatpeople.com | Client Adchemy Inc.(Acquired @WalmartLabs) November 2008  –  December 2010  (2 years 2 months) Digital Marketing Technology Company offering SaaS based Audience Data Cloud. Responsible for full life cycle recruiting and executive search across full company spectrum. Talent Acquisition/Executive Search Consultant Greatpeople.com | Client Adchemy Inc.(Acquired @WalmartLabs) November 2008  –  December 2010  (2 years 2 months) Digital Marketing Technology Company offering SaaS based Audience Data Cloud. Responsible for full life cycle recruiting and executive search across full company spectrum. Executive Search Consultant, Sr contract recruiter Greatpeople.com | Client Stealth September 2008  –  February 2009  (6 months) Can not say Executive Search Consultant, Sr contract recruiter Greatpeople.com | Client Stealth September 2008  –  February 2009  (6 months) Can not say Executive Search Consultant, Diversity Recruiter, Strategic sourcing Intel Corporation September 2007  –  February 2009  (1 year 6 months) Hillsboro, Or Executive Search Group - Diversity Strategic Sourcing \nSenior member of a 2 person pilot diversity recruiting initiative chartered to increase Intel’s executive level diversity hiring for Digital Enterprise Group. Helped design and execute program, exceeded all milestones and program marked as outstanding success with Intel executive management.  \n \nExecutive Search for Principal Engineers, Fellows, Architects and VP's within Digital Enterprise Group. Specializing in the areas of Circuit Design, Validation, Component Design, Automation tools, 3D Graphics, Ingredient stack including CPU, Chipsets, Memory Solutions, Data Storage, Virtualization, Cloud Computing, Opensource, Linux Kernel. Executive Search Consultant, Diversity Recruiter, Strategic sourcing Intel Corporation September 2007  –  February 2009  (1 year 6 months) Hillsboro, Or Executive Search Group - Diversity Strategic Sourcing \nSenior member of a 2 person pilot diversity recruiting initiative chartered to increase Intel’s executive level diversity hiring for Digital Enterprise Group. Helped design and execute program, exceeded all milestones and program marked as outstanding success with Intel executive management.  \n \nExecutive Search for Principal Engineers, Fellows, Architects and VP's within Digital Enterprise Group. Specializing in the areas of Circuit Design, Validation, Component Design, Automation tools, 3D Graphics, Ingredient stack including CPU, Chipsets, Memory Solutions, Data Storage, Virtualization, Cloud Computing, Opensource, Linux Kernel. Executive search consultant, Sr contract recruiter, sourcer Greatpeople.com | Client HSBC Card Services(Acquired by CapitalOne) September 2006  –  February 2009  (2 years 6 months) Tigard, OR Senior executive member of elite US based strategic sourcing group specializing in identifying, engaging and hiring the top minds in the analytical finance universe for HSBC USA Card and Retail Services. Roles ranged from Sr Analyst to SVP/GM. Skill sets encompass all aspects of Data Driven Qualitative and Quantitative Marketing Analytics/ Strategies, Risk, Finance, Analytical Modeling, Search technologies, etc. Executive search consultant, Sr contract recruiter, sourcer Greatpeople.com | Client HSBC Card Services(Acquired by CapitalOne) September 2006  –  February 2009  (2 years 6 months) Tigard, OR Senior executive member of elite US based strategic sourcing group specializing in identifying, engaging and hiring the top minds in the analytical finance universe for HSBC USA Card and Retail Services. Roles ranged from Sr Analyst to SVP/GM. Skill sets encompass all aspects of Data Driven Qualitative and Quantitative Marketing Analytics/ Strategies, Risk, Finance, Analytical Modeling, Search technologies, etc. Executive Search Consultant, Sr contract recruiter Platial October 2005  –  March 2006  (6 months) Executive Search Consultant, Sr contract recruiter Platial October 2005  –  March 2006  (6 months) Executive Search, Sr contract recruiter, Sourcing Manager Greatpeople.com | Client Secret Seal(PSS Systems) (Acquired by IBM) September 2001  –  August 2002  (1 year) Palo Alto, Ca Hired by founder/CEO of this 4 person early stage startup. Hired first Architects, early engineering and executive teams.  \nAcquired by IBM in 2010. Executive Search, Sr contract recruiter, Sourcing Manager Greatpeople.com | Client Secret Seal(PSS Systems) (Acquired by IBM) September 2001  –  August 2002  (1 year) Palo Alto, Ca Hired by founder/CEO of this 4 person early stage startup. Hired first Architects, early engineering and executive teams.  \nAcquired by IBM in 2010. Executive Search Consultant, Sr contract recruiter Greatpeople.com | Client Kontiki (Acquired by RSA) November 2000  –  October 2001  (1 year) Mt View, Ca Was brought into this early stage 10 person start up in peer-assisted content delivery technology space. Hired initial core engineering and infrastructure teams. Company was acquired by VeriSign in 2006. Executive Search Consultant, Sr contract recruiter Greatpeople.com | Client Kontiki (Acquired by RSA) November 2000  –  October 2001  (1 year) Mt View, Ca Was brought into this early stage 10 person start up in peer-assisted content delivery technology space. Hired initial core engineering and infrastructure teams. Company was acquired by VeriSign in 2006. Executive Search, Sourcing - Recruitment Consultant Greatpeople.com | Client Timetra (Acquired by Alcatel) December 2000  –  September 2001  (10 months) Brought in by CEO to hire Principal MPLS Engineers/Architects for this early stage leading IP/MPLS edge routing startup.  \nAcquired by Alcatel in 2003. Executive Search, Sourcing - Recruitment Consultant Greatpeople.com | Client Timetra (Acquired by Alcatel) December 2000  –  September 2001  (10 months) Brought in by CEO to hire Principal MPLS Engineers/Architects for this early stage leading IP/MPLS edge routing startup.  \nAcquired by Alcatel in 2003. Executive Search, Sr contract recruiter, Recruitment manager Greatpeople.com | Client Hotjobs.com (Acquired by Yahoo) 2000  –  2001  (1 year) Hired by company CTO/GM to rebuild key Executive/Engineering teams resulting from recent acquisition of a company called Resumix. Rebuilt executive teams, VP Engineering, VP Professional Services and key developers along with other infrastructure roles. \nHotJobs was acquired by Yahoo at the end of 2001. Executive Search, Sr contract recruiter, Recruitment manager Greatpeople.com | Client Hotjobs.com (Acquired by Yahoo) 2000  –  2001  (1 year) Hired by company CTO/GM to rebuild key Executive/Engineering teams resulting from recent acquisition of a company called Resumix. Rebuilt executive teams, VP Engineering, VP Professional Services and key developers along with other infrastructure roles. \nHotJobs was acquired by Yahoo at the end of 2001. Executive Search Consultant, Sr contract recruiter, Manager Greatpeople.com | Client Network Alchemy (Acquired by Nokia) February 1999  –  January 2000  (1 year) Santa Cruz, Ca Hired by CEO of this young start up to build out sr engineering and executive teams.  \nNetwork Alchemy developed the industry's first PPTP/L2TP CryptoCluster IPSec and IKE VPN server solutions with Triple DES encryption. We were acquired by Nokia at just over 80 employees in February 2001. Executive Search Consultant, Sr contract recruiter, Manager Greatpeople.com | Client Network Alchemy (Acquired by Nokia) February 1999  –  January 2000  (1 year) Santa Cruz, Ca Hired by CEO of this young start up to build out sr engineering and executive teams.  \nNetwork Alchemy developed the industry's first PPTP/L2TP CryptoCluster IPSec and IKE VPN server solutions with Triple DES encryption. We were acquired by Nokia at just over 80 employees in February 2001. Executive Search Consultant, Sr contract recruiter, Manager Greatpeople.com | Client Netflix May 1998  –  August 1999  (1 year 4 months) Scotts Valley, Ca Hired by early investors of this brand new 10 person start up to manage and build technical/business, marketing and executive teams. Worked closely with CEO and founder to hire early engineering and critical Sr. Management teams. Executive Search Consultant, Sr contract recruiter, Manager Greatpeople.com | Client Netflix May 1998  –  August 1999  (1 year 4 months) Scotts Valley, Ca Hired by early investors of this brand new 10 person start up to manage and build technical/business, marketing and executive teams. Worked closely with CEO and founder to hire early engineering and critical Sr. Management teams. Executive Recruiting Consultant, Sr contract recruiter Greatpeople | Client Remedy Inc.(Acquired by BMC) July 1997  –  January 1998  (7 months) Hired to build out Global Customer services and support,Tier 1 through tier 3 doubling the organization 50-100 in 7 Months. Remedy AR System was a market leading client–server software application development environment. \nAcquired by BMC Executive Recruiting Consultant, Sr contract recruiter Greatpeople | Client Remedy Inc.(Acquired by BMC) July 1997  –  January 1998  (7 months) Hired to build out Global Customer services and support,Tier 1 through tier 3 doubling the organization 50-100 in 7 Months. Remedy AR System was a market leading client–server software application development environment. \nAcquired by BMC Executive Recruiting Consultant, Staffing Manager Starfish Software (Acquired by Motorola) September 1996  –  September 1997  (1 year 1 month) Scotts Valley, CA Executive Recruiting Consultant, Staffing Manager Starfish Software (Acquired by Motorola) September 1996  –  September 1997  (1 year 1 month) Scotts Valley, CA Executive Recruiting Consultant ShareData (Acquired by E*Trade) March 1997  –  August 1997  (6 months) Mountain View, CA Executive Recruiting Consultant ShareData (Acquired by E*Trade) March 1997  –  August 1997  (6 months) Mountain View, CA Sr Technical Recruiting Consultant Openwave Systems April 1996  –  July 1997  (1 year 4 months) Redwood Shores, Ca Unwired Planet Inc. (Openwave)  \nRecruited by the CEO following the A round of funding to build out all core engineering , executive management and infrastructure teams. Responsible for hiring the first 80 employees in this early innovator of Wireless Application Protocol (WAP) for the mobile phone sector. \n Sr Technical Recruiting Consultant Openwave Systems April 1996  –  July 1997  (1 year 4 months) Redwood Shores, Ca Unwired Planet Inc. (Openwave)  \nRecruited by the CEO following the A round of funding to build out all core engineering , executive management and infrastructure teams. Responsible for hiring the first 80 employees in this early innovator of Wireless Application Protocol (WAP) for the mobile phone sector. \n Executive Search Consultant Palm (Acquired by HP) July 1996  –  November 1996  (5 months) Sunnyvale, CA Executive Search Consultant Palm (Acquired by HP) July 1996  –  November 1996  (5 months) Sunnyvale, CA Sr Technical Recruiter/Talent Ambassador Netscape Communications (Acquired by AOL) June 1995  –  June 1996  (1 year 1 month) Mountain View, CA Netscape Communications Corporation - Sr. Technical Recruiter/Talent Ambassador -6/95 to 6/96  \n Sr Technical Recruiter/Talent Ambassador Netscape Communications (Acquired by AOL) June 1995  –  June 1996  (1 year 1 month) Mountain View, CA Netscape Communications Corporation - Sr. Technical Recruiter/Talent Ambassador -6/95 to 6/96  \n Sr Technical Recruiter/Recruiting Lead/Manager Sun Microsystems (Acquired by Oracle) December 1993  –  June 1995  (1 year 7 months) Sun Microsystems - Sr. Technical Recruiter/Manager - 12/93 - 6/95  \nResponsible for hiring technology and product teams for project DOE, First Person (Became JavaSoft), and Sun Labs.  \n \n Sr Technical Recruiter/Recruiting Lead/Manager Sun Microsystems (Acquired by Oracle) December 1993  –  June 1995  (1 year 7 months) Sun Microsystems - Sr. Technical Recruiter/Manager - 12/93 - 6/95  \nResponsible for hiring technology and product teams for project DOE, First Person (Became JavaSoft), and Sun Labs.  \n \n Sr Technical Recruiter Rational Software (Acquired by IBM) April 1993  –  December 1993  (9 months) Rational Software Inc. - Sr. Technical Recruiter - 4/93 to 12/93  \n Sr Technical Recruiter Rational Software (Acquired by IBM) April 1993  –  December 1993  (9 months) Rational Software Inc. - Sr. Technical Recruiter - 4/93 to 12/93  \n Skills Start-ups Technical Recruiting Executive Search SaaS Sourcing Recruiting Enterprise Software Strategy Cloud Computing Management Talent Management Search Product Management Leadership Talent Acquisition Mobile Devices Professional Services Virtualization Contract Recruitment SDLC Product Development Lead Generation Marketing Mergers & Acquisitions Recruitment Technology Temporary Placement Executive Management Team Management Networking Internet Recruiting Vendor Management Benefits Negotiation Head Hunter Creative Sourcing Startup Consulting PaaS CRM Consulting Software Engineering Strategic Partnerships Software Development Big Data Business Development Applicant Tracking... Hiring Interviews Screening Resumes Analytics Entrepreneurship See 34+     See less Skills  Start-ups Technical Recruiting Executive Search SaaS Sourcing Recruiting Enterprise Software Strategy Cloud Computing Management Talent Management Search Product Management Leadership Talent Acquisition Mobile Devices Professional Services Virtualization Contract Recruitment SDLC Product Development Lead Generation Marketing Mergers & Acquisitions Recruitment Technology Temporary Placement Executive Management Team Management Networking Internet Recruiting Vendor Management Benefits Negotiation Head Hunter Creative Sourcing Startup Consulting PaaS CRM Consulting Software Engineering Strategic Partnerships Software Development Big Data Business Development Applicant Tracking... Hiring Interviews Screening Resumes Analytics Entrepreneurship See 34+     See less Start-ups Technical Recruiting Executive Search SaaS Sourcing Recruiting Enterprise Software Strategy Cloud Computing Management Talent Management Search Product Management Leadership Talent Acquisition Mobile Devices Professional Services Virtualization Contract Recruitment SDLC Product Development Lead Generation Marketing Mergers & Acquisitions Recruitment Technology Temporary Placement Executive Management Team Management Networking Internet Recruiting Vendor Management Benefits Negotiation Head Hunter Creative Sourcing Startup Consulting PaaS CRM Consulting Software Engineering Strategic Partnerships Software Development Big Data Business Development Applicant Tracking... Hiring Interviews Screening Resumes Analytics Entrepreneurship See 34+     See less Start-ups Technical Recruiting Executive Search SaaS Sourcing Recruiting Enterprise Software Strategy Cloud Computing Management Talent Management Search Product Management Leadership Talent Acquisition Mobile Devices Professional Services Virtualization Contract Recruitment SDLC Product Development Lead Generation Marketing Mergers & Acquisitions Recruitment Technology Temporary Placement Executive Management Team Management Networking Internet Recruiting Vendor Management Benefits Negotiation Head Hunter Creative Sourcing Startup Consulting PaaS CRM Consulting Software Engineering Strategic Partnerships Software Development Big Data Business Development Applicant Tracking... Hiring Interviews Screening Resumes Analytics Entrepreneurship See 34+     See less ", "Summary • Over 15 years experience in software training, system analysis and project management in the High Tech Industry. \n \n• Strong SAP implementation background with experience in R/3, CRM and APO configuration, user training, testing, migrations, and exploration.  \n \n• Extensive international travel and work experience. \n \nSpecialties: • SAP R/3: SD, MM, IM, and WM. SAP APO: Demand Planner. SAP CRM, SAP BW. Intuit - MRI Summary • Over 15 years experience in software training, system analysis and project management in the High Tech Industry. \n \n• Strong SAP implementation background with experience in R/3, CRM and APO configuration, user training, testing, migrations, and exploration.  \n \n• Extensive international travel and work experience. \n \nSpecialties: • SAP R/3: SD, MM, IM, and WM. SAP APO: Demand Planner. SAP CRM, SAP BW. Intuit - MRI • Over 15 years experience in software training, system analysis and project management in the High Tech Industry. \n \n• Strong SAP implementation background with experience in R/3, CRM and APO configuration, user training, testing, migrations, and exploration.  \n \n• Extensive international travel and work experience. \n \nSpecialties: • SAP R/3: SD, MM, IM, and WM. SAP APO: Demand Planner. SAP CRM, SAP BW. Intuit - MRI • Over 15 years experience in software training, system analysis and project management in the High Tech Industry. \n \n• Strong SAP implementation background with experience in R/3, CRM and APO configuration, user training, testing, migrations, and exploration.  \n \n• Extensive international travel and work experience. \n \nSpecialties: • SAP R/3: SD, MM, IM, and WM. SAP APO: Demand Planner. SAP CRM, SAP BW. Intuit - MRI Experience SAP SD Consultant ARYZTA LLC 2013  –  2013  (less than a year) SAP Security Consultant Intel Corporation July 2011  –  December 2012  (1 year 6 months) Sacramento, California Area SAP SD Consultant Vitesse Semiconductor February 2011  –  June 2011  (5 months) Greater Los Angeles Area SAP SD Consultant Intel Corporation November 2010  –  January 2011  (3 months) SAP Security Consultant Intel Corporation September 2010  –  November 2010  (3 months) SAP SD Consultant Intel Corporation November 2009  –  August 2010  (10 months) SAP Systems Analyst SNSC April 2009  –  November 2009  (8 months) SAP Consultant California Department of Water Resources February 2009  –  February 2009  (1 month) SAP SD Consultant Intel Corporation February 2008  –  January 2009  (1 year) ERP Manager SN Servicing Corporation August 2006  –  February 2008  (1 year 7 months) Technical Project Manager Intel Corporation 2003  –  2006  (3 years) SAP Systems Analyst Intel Corporation 2001  –  2003  (2 years) Software Trainer Intel Corporation April 1997  –  2001  (4 years) SAP SD Consultant ARYZTA LLC 2013  –  2013  (less than a year) SAP SD Consultant ARYZTA LLC 2013  –  2013  (less than a year) SAP Security Consultant Intel Corporation July 2011  –  December 2012  (1 year 6 months) Sacramento, California Area SAP Security Consultant Intel Corporation July 2011  –  December 2012  (1 year 6 months) Sacramento, California Area SAP SD Consultant Vitesse Semiconductor February 2011  –  June 2011  (5 months) Greater Los Angeles Area SAP SD Consultant Vitesse Semiconductor February 2011  –  June 2011  (5 months) Greater Los Angeles Area SAP SD Consultant Intel Corporation November 2010  –  January 2011  (3 months) SAP SD Consultant Intel Corporation November 2010  –  January 2011  (3 months) SAP Security Consultant Intel Corporation September 2010  –  November 2010  (3 months) SAP Security Consultant Intel Corporation September 2010  –  November 2010  (3 months) SAP SD Consultant Intel Corporation November 2009  –  August 2010  (10 months) SAP SD Consultant Intel Corporation November 2009  –  August 2010  (10 months) SAP Systems Analyst SNSC April 2009  –  November 2009  (8 months) SAP Systems Analyst SNSC April 2009  –  November 2009  (8 months) SAP Consultant California Department of Water Resources February 2009  –  February 2009  (1 month) SAP Consultant California Department of Water Resources February 2009  –  February 2009  (1 month) SAP SD Consultant Intel Corporation February 2008  –  January 2009  (1 year) SAP SD Consultant Intel Corporation February 2008  –  January 2009  (1 year) ERP Manager SN Servicing Corporation August 2006  –  February 2008  (1 year 7 months) ERP Manager SN Servicing Corporation August 2006  –  February 2008  (1 year 7 months) Technical Project Manager Intel Corporation 2003  –  2006  (3 years) Technical Project Manager Intel Corporation 2003  –  2006  (3 years) SAP Systems Analyst Intel Corporation 2001  –  2003  (2 years) SAP Systems Analyst Intel Corporation 2001  –  2003  (2 years) Software Trainer Intel Corporation April 1997  –  2001  (4 years) Software Trainer Intel Corporation April 1997  –  2001  (4 years) Skills Materials Management SAP R/3 SD IM MRI Integration SAP ERP ABAP SAP ERP PMP SAP Implementation SDLC Visio Business Analysis SAP BW Master Data Management SAP Netweaver Project Management SAP SD SAP CRM CRM Data Migration SAP APO Business Objects Testing SAP Configuration SAP Portal SAP SRM Business Process Business Intelligence Requirements Analysis Management SAP XI SAP HR SAP HANA Consulting See 22+     See less Skills  Materials Management SAP R/3 SD IM MRI Integration SAP ERP ABAP SAP ERP PMP SAP Implementation SDLC Visio Business Analysis SAP BW Master Data Management SAP Netweaver Project Management SAP SD SAP CRM CRM Data Migration SAP APO Business Objects Testing SAP Configuration SAP Portal SAP SRM Business Process Business Intelligence Requirements Analysis Management SAP XI SAP HR SAP HANA Consulting See 22+     See less Materials Management SAP R/3 SD IM MRI Integration SAP ERP ABAP SAP ERP PMP SAP Implementation SDLC Visio Business Analysis SAP BW Master Data Management SAP Netweaver Project Management SAP SD SAP CRM CRM Data Migration SAP APO Business Objects Testing SAP Configuration SAP Portal SAP SRM Business Process Business Intelligence Requirements Analysis Management SAP XI SAP HR SAP HANA Consulting See 22+     See less Materials Management SAP R/3 SD IM MRI Integration SAP ERP ABAP SAP ERP PMP SAP Implementation SDLC Visio Business Analysis SAP BW Master Data Management SAP Netweaver Project Management SAP SD SAP CRM CRM Data Migration SAP APO Business Objects Testing SAP Configuration SAP Portal SAP SRM Business Process Business Intelligence Requirements Analysis Management SAP XI SAP HR SAP HANA Consulting See 22+     See less Education Arizona State University MBA,  Supply Chain Management 2004  – 2006 California State University-Chico BA,  Humanities 1991  – 1995 Minor: English \nCertificate of Technical Writing Activities and Societies:  Theta Chi Arizona State University MBA,  Supply Chain Management 2004  – 2006 Arizona State University MBA,  Supply Chain Management 2004  – 2006 Arizona State University MBA,  Supply Chain Management 2004  – 2006 California State University-Chico BA,  Humanities 1991  – 1995 Minor: English \nCertificate of Technical Writing Activities and Societies:  Theta Chi California State University-Chico BA,  Humanities 1991  – 1995 Minor: English \nCertificate of Technical Writing Activities and Societies:  Theta Chi California State University-Chico BA,  Humanities 1991  – 1995 Minor: English \nCertificate of Technical Writing Activities and Societies:  Theta Chi ", "Summary Business Development Executive with over 20 years of Information Technology Project Services experience delivering custom solutions to State and Local Government Agencies. \n \nPresently delivering core training courses to new field staff and recently promoted leaders.  \n \nSpecialties: Information Technology Project Services, Business Development, State/Local Government, Procurement/Contract Negotiations, Resource Allocation Plans, Business Process Redesign and Organization Development. Summary Business Development Executive with over 20 years of Information Technology Project Services experience delivering custom solutions to State and Local Government Agencies. \n \nPresently delivering core training courses to new field staff and recently promoted leaders.  \n \nSpecialties: Information Technology Project Services, Business Development, State/Local Government, Procurement/Contract Negotiations, Resource Allocation Plans, Business Process Redesign and Organization Development. Business Development Executive with over 20 years of Information Technology Project Services experience delivering custom solutions to State and Local Government Agencies. \n \nPresently delivering core training courses to new field staff and recently promoted leaders.  \n \nSpecialties: Information Technology Project Services, Business Development, State/Local Government, Procurement/Contract Negotiations, Resource Allocation Plans, Business Process Redesign and Organization Development. Business Development Executive with over 20 years of Information Technology Project Services experience delivering custom solutions to State and Local Government Agencies. \n \nPresently delivering core training courses to new field staff and recently promoted leaders.  \n \nSpecialties: Information Technology Project Services, Business Development, State/Local Government, Procurement/Contract Negotiations, Resource Allocation Plans, Business Process Redesign and Organization Development. Experience Field Training Manager Robert Half March 2015  – Present (6 months) Sacramento, California Area As a Field Training Manager of the Enterprise Training and Staff Development team, I am responsible for the planning and execution of field training for California. I facilitate and manage/oversee training plans, manage the training progression for all staff before, during and after training sessions and work closely with senior leadership to provide feedback, leverage a Learning Management System to track and plan training activities and support the Enterprise Training and Staff Development Team to ensure that executed training programs stay in alignment with business objectives and reflects Robert Half’s long-term strategic goals for all lines of business within my geography. Director of Sales & Operations Stability Technology Partners November 2014  –  March 2015  (5 months) Folsom, CA Stability Technology Partners is full service enterprise IT staffing company providing contract, direct hire and recruitment process outsourcing (RPO). We provide our client’s with on demand services to scale up or down as their staffing needs change. Our RPO service delivers managed offshore sourcing and recruiting for our clients direct placement requirements at a fraction of the cost. \n \nWhen you need staffing support, you can depend on Stability Technology. We are much more than a staffing agency; we are a partner who takes a consultative approach, delivering innovative solutions to meet your individual business needs. \n \nIndustry Leading Process & Systems Innovation \nStability Technology saves our clients time and money with process & systems innovation including: \n• On-Demand candidate video & audio profiles for manager screening \n• Online candidate tracking & feedback \n• Online Time & Attendance - Approval/Reject and Reports \n• Fully integrated social networking platform (Linked in, Facebook, Twitter, etc…) \n• Rewards & Assignment Completion Bonus \n \nWhether you’re building a team, managing a project or reacting to a need, finding the right match is critical to success! President MetaVista Consulting Group January 2013  –  October 2014  (1 year 10 months) Sacramento, California Area MetaVista Consulting Group, headquartered in Sacramento, California, specializes in delivering high-quality, professional IT consulting services for both the public and private sector. \u2028\u2028Our 16+ years of experience consulting in State and local governments afford us a unique perspective on the culture, structure, and human resource challenges of government – allowing us to support the delivery of State and local government technology goals with IT and business expertise. This is illustrated by our proven track record of successfully managing large IT projects that are mission critical, technically complex, severely schedule constrained, and multi-vendor in nature for the State of California, several county agencies, and out-of-state government entities. \u2028\u2028Our technical professionals have excellent credentials and many years of proven expertise promoting project success in a range of specialized concentrations.  \n \nMetaVista is a Certified California Small and Micro Business with strong DVBE partnerships and IT-CMAS, Non-IT CMAS, IT MSA, and CalPERS Spring-Fed Pool contracts. \u2028\u2028MetaVista offers service expertise and strategic advice in the specialties listed below. \n \nSpecialties \nProject and Program Management, Scheduling and PMO, Technology/Management Consulting, IT Strategic Planning, Change Management, IT Implementation Services, Business Analysis, Data Architecture, Data Center Network & Infrastructure, Training, IT Security Consulting Account Executive TEKsystems, Inc November 2004  –  December 2012  (8 years 2 months) TEKsystems® is the nation’s leading technology staffing and services company. Combining a proven track record of superior performance, a quality-focused approach to service delivery, and the highest-caliber technical professionals in the market, TEKsystems helps our clients successfully plan, build, and run their critical technology initiatives. \n \nWith more than 25 years of experience, we annually deploy 70,000 technical professionals from 90 locations throughout North America, Europe, and Asia. Our capabilities include IT and communications staff augmentation and direct placement services; managed, project-based, and outsourced applications and infrastructure services; education services; and comprehensive workforce management solutions. Sr. Business Analyst - Vendor Relations Manager Intel June 2004  –  November 2004  (6 months) Sacramento, California Area Negotiated new contracts with Intel Global Staffing Partners. As the process owner and channel manager I was tasked to ensure candidate resumes and Intel job postings were accurately sent and received by our Global Staffing Partners serving the US, Asia, Europe and Middle East. \n \nI secured over 20 different staffing contracts with Intel's Staffing Service providers including; Monster, CareerBuilder and DICE. Sr. Business Analyst - Staffing Process SME Intel Corporation February 2002  –  June 2004  (2 years 5 months) Sacramento, California Area Member of Business Process Redesign team for Intel Global Staffing on the Aladdin Program. The program was a software upgrade from existing PeopleSoft HR System 7 to PeoplSoft v8.8. As a Staffing Process SME I was tasked to; develop and document the As-Is and To-Be processes for Global Staffing, delivered training on new staffing process to Staffing Consultants in China and US markets. Sr. Staffing Consultant Intel Corporation March 2001  –  February 2002  (1 year) Sacramento, California Area Member of Global Staffing Redeployment team leading 11 recruiters in 5 redeployment centers throughout the United States. The redeployment team assisted existing Intel employees impacted by redeployment with job search, resume creation and networking assistance internally and externally. Sr. Staffing Consultant Intel Corporation March 2000  –  March 2001  (1 year 1 month) Sacramento, California Area Tasked to execute full life-cycle recruiting of technology professionals within the communications semi-conductor industry. Candidates ranged from mid-level to executive level technology professionals. Full life-cycle recruiting included, networking to identify passive candidates, interview preparation and compensation negotiations. Field Training Manager Robert Half March 2015  – Present (6 months) Sacramento, California Area As a Field Training Manager of the Enterprise Training and Staff Development team, I am responsible for the planning and execution of field training for California. I facilitate and manage/oversee training plans, manage the training progression for all staff before, during and after training sessions and work closely with senior leadership to provide feedback, leverage a Learning Management System to track and plan training activities and support the Enterprise Training and Staff Development Team to ensure that executed training programs stay in alignment with business objectives and reflects Robert Half’s long-term strategic goals for all lines of business within my geography. Field Training Manager Robert Half March 2015  – Present (6 months) Sacramento, California Area As a Field Training Manager of the Enterprise Training and Staff Development team, I am responsible for the planning and execution of field training for California. I facilitate and manage/oversee training plans, manage the training progression for all staff before, during and after training sessions and work closely with senior leadership to provide feedback, leverage a Learning Management System to track and plan training activities and support the Enterprise Training and Staff Development Team to ensure that executed training programs stay in alignment with business objectives and reflects Robert Half’s long-term strategic goals for all lines of business within my geography. Director of Sales & Operations Stability Technology Partners November 2014  –  March 2015  (5 months) Folsom, CA Stability Technology Partners is full service enterprise IT staffing company providing contract, direct hire and recruitment process outsourcing (RPO). We provide our client’s with on demand services to scale up or down as their staffing needs change. Our RPO service delivers managed offshore sourcing and recruiting for our clients direct placement requirements at a fraction of the cost. \n \nWhen you need staffing support, you can depend on Stability Technology. We are much more than a staffing agency; we are a partner who takes a consultative approach, delivering innovative solutions to meet your individual business needs. \n \nIndustry Leading Process & Systems Innovation \nStability Technology saves our clients time and money with process & systems innovation including: \n• On-Demand candidate video & audio profiles for manager screening \n• Online candidate tracking & feedback \n• Online Time & Attendance - Approval/Reject and Reports \n• Fully integrated social networking platform (Linked in, Facebook, Twitter, etc…) \n• Rewards & Assignment Completion Bonus \n \nWhether you’re building a team, managing a project or reacting to a need, finding the right match is critical to success! Director of Sales & Operations Stability Technology Partners November 2014  –  March 2015  (5 months) Folsom, CA Stability Technology Partners is full service enterprise IT staffing company providing contract, direct hire and recruitment process outsourcing (RPO). We provide our client’s with on demand services to scale up or down as their staffing needs change. Our RPO service delivers managed offshore sourcing and recruiting for our clients direct placement requirements at a fraction of the cost. \n \nWhen you need staffing support, you can depend on Stability Technology. We are much more than a staffing agency; we are a partner who takes a consultative approach, delivering innovative solutions to meet your individual business needs. \n \nIndustry Leading Process & Systems Innovation \nStability Technology saves our clients time and money with process & systems innovation including: \n• On-Demand candidate video & audio profiles for manager screening \n• Online candidate tracking & feedback \n• Online Time & Attendance - Approval/Reject and Reports \n• Fully integrated social networking platform (Linked in, Facebook, Twitter, etc…) \n• Rewards & Assignment Completion Bonus \n \nWhether you’re building a team, managing a project or reacting to a need, finding the right match is critical to success! President MetaVista Consulting Group January 2013  –  October 2014  (1 year 10 months) Sacramento, California Area MetaVista Consulting Group, headquartered in Sacramento, California, specializes in delivering high-quality, professional IT consulting services for both the public and private sector. \u2028\u2028Our 16+ years of experience consulting in State and local governments afford us a unique perspective on the culture, structure, and human resource challenges of government – allowing us to support the delivery of State and local government technology goals with IT and business expertise. This is illustrated by our proven track record of successfully managing large IT projects that are mission critical, technically complex, severely schedule constrained, and multi-vendor in nature for the State of California, several county agencies, and out-of-state government entities. \u2028\u2028Our technical professionals have excellent credentials and many years of proven expertise promoting project success in a range of specialized concentrations.  \n \nMetaVista is a Certified California Small and Micro Business with strong DVBE partnerships and IT-CMAS, Non-IT CMAS, IT MSA, and CalPERS Spring-Fed Pool contracts. \u2028\u2028MetaVista offers service expertise and strategic advice in the specialties listed below. \n \nSpecialties \nProject and Program Management, Scheduling and PMO, Technology/Management Consulting, IT Strategic Planning, Change Management, IT Implementation Services, Business Analysis, Data Architecture, Data Center Network & Infrastructure, Training, IT Security Consulting President MetaVista Consulting Group January 2013  –  October 2014  (1 year 10 months) Sacramento, California Area MetaVista Consulting Group, headquartered in Sacramento, California, specializes in delivering high-quality, professional IT consulting services for both the public and private sector. \u2028\u2028Our 16+ years of experience consulting in State and local governments afford us a unique perspective on the culture, structure, and human resource challenges of government – allowing us to support the delivery of State and local government technology goals with IT and business expertise. This is illustrated by our proven track record of successfully managing large IT projects that are mission critical, technically complex, severely schedule constrained, and multi-vendor in nature for the State of California, several county agencies, and out-of-state government entities. \u2028\u2028Our technical professionals have excellent credentials and many years of proven expertise promoting project success in a range of specialized concentrations.  \n \nMetaVista is a Certified California Small and Micro Business with strong DVBE partnerships and IT-CMAS, Non-IT CMAS, IT MSA, and CalPERS Spring-Fed Pool contracts. \u2028\u2028MetaVista offers service expertise and strategic advice in the specialties listed below. \n \nSpecialties \nProject and Program Management, Scheduling and PMO, Technology/Management Consulting, IT Strategic Planning, Change Management, IT Implementation Services, Business Analysis, Data Architecture, Data Center Network & Infrastructure, Training, IT Security Consulting Account Executive TEKsystems, Inc November 2004  –  December 2012  (8 years 2 months) TEKsystems® is the nation’s leading technology staffing and services company. Combining a proven track record of superior performance, a quality-focused approach to service delivery, and the highest-caliber technical professionals in the market, TEKsystems helps our clients successfully plan, build, and run their critical technology initiatives. \n \nWith more than 25 years of experience, we annually deploy 70,000 technical professionals from 90 locations throughout North America, Europe, and Asia. Our capabilities include IT and communications staff augmentation and direct placement services; managed, project-based, and outsourced applications and infrastructure services; education services; and comprehensive workforce management solutions. Account Executive TEKsystems, Inc November 2004  –  December 2012  (8 years 2 months) TEKsystems® is the nation’s leading technology staffing and services company. Combining a proven track record of superior performance, a quality-focused approach to service delivery, and the highest-caliber technical professionals in the market, TEKsystems helps our clients successfully plan, build, and run their critical technology initiatives. \n \nWith more than 25 years of experience, we annually deploy 70,000 technical professionals from 90 locations throughout North America, Europe, and Asia. Our capabilities include IT and communications staff augmentation and direct placement services; managed, project-based, and outsourced applications and infrastructure services; education services; and comprehensive workforce management solutions. Sr. Business Analyst - Vendor Relations Manager Intel June 2004  –  November 2004  (6 months) Sacramento, California Area Negotiated new contracts with Intel Global Staffing Partners. As the process owner and channel manager I was tasked to ensure candidate resumes and Intel job postings were accurately sent and received by our Global Staffing Partners serving the US, Asia, Europe and Middle East. \n \nI secured over 20 different staffing contracts with Intel's Staffing Service providers including; Monster, CareerBuilder and DICE. Sr. Business Analyst - Vendor Relations Manager Intel June 2004  –  November 2004  (6 months) Sacramento, California Area Negotiated new contracts with Intel Global Staffing Partners. As the process owner and channel manager I was tasked to ensure candidate resumes and Intel job postings were accurately sent and received by our Global Staffing Partners serving the US, Asia, Europe and Middle East. \n \nI secured over 20 different staffing contracts with Intel's Staffing Service providers including; Monster, CareerBuilder and DICE. Sr. Business Analyst - Staffing Process SME Intel Corporation February 2002  –  June 2004  (2 years 5 months) Sacramento, California Area Member of Business Process Redesign team for Intel Global Staffing on the Aladdin Program. The program was a software upgrade from existing PeopleSoft HR System 7 to PeoplSoft v8.8. As a Staffing Process SME I was tasked to; develop and document the As-Is and To-Be processes for Global Staffing, delivered training on new staffing process to Staffing Consultants in China and US markets. Sr. Business Analyst - Staffing Process SME Intel Corporation February 2002  –  June 2004  (2 years 5 months) Sacramento, California Area Member of Business Process Redesign team for Intel Global Staffing on the Aladdin Program. The program was a software upgrade from existing PeopleSoft HR System 7 to PeoplSoft v8.8. As a Staffing Process SME I was tasked to; develop and document the As-Is and To-Be processes for Global Staffing, delivered training on new staffing process to Staffing Consultants in China and US markets. Sr. Staffing Consultant Intel Corporation March 2001  –  February 2002  (1 year) Sacramento, California Area Member of Global Staffing Redeployment team leading 11 recruiters in 5 redeployment centers throughout the United States. The redeployment team assisted existing Intel employees impacted by redeployment with job search, resume creation and networking assistance internally and externally. Sr. Staffing Consultant Intel Corporation March 2001  –  February 2002  (1 year) Sacramento, California Area Member of Global Staffing Redeployment team leading 11 recruiters in 5 redeployment centers throughout the United States. The redeployment team assisted existing Intel employees impacted by redeployment with job search, resume creation and networking assistance internally and externally. Sr. Staffing Consultant Intel Corporation March 2000  –  March 2001  (1 year 1 month) Sacramento, California Area Tasked to execute full life-cycle recruiting of technology professionals within the communications semi-conductor industry. Candidates ranged from mid-level to executive level technology professionals. Full life-cycle recruiting included, networking to identify passive candidates, interview preparation and compensation negotiations. Sr. Staffing Consultant Intel Corporation March 2000  –  March 2001  (1 year 1 month) Sacramento, California Area Tasked to execute full life-cycle recruiting of technology professionals within the communications semi-conductor industry. Candidates ranged from mid-level to executive level technology professionals. Full life-cycle recruiting included, networking to identify passive candidates, interview preparation and compensation negotiations. Skills Business Analysis Business Development Business Process Building Relationships Business Relationship... Business Requirements Cold Calling College Recruiting Consulting Contract Negotiation Documentation Government Procurement Human Resources Human Resource Planning Internet Recruiting Information Technology Organizational... Process Improvement Retention Management Retention Strategies Requirements Analysis Requirements Gathering Screening Resumes Software Documentation Solution Selling State & Local... System Deployment Technical Recruiting Workforce Planning Workforce Management Workforce Development Strategy Professional Services Benefits Negotiation SDLC Screening Leadership Change Management Project Management Data Center Outsourcing Training Staffing Services Temporary Placement Management Networking Team Building IT Service Management Team Leadership CRM See 35+     See less Skills  Business Analysis Business Development Business Process Building Relationships Business Relationship... Business Requirements Cold Calling College Recruiting Consulting Contract Negotiation Documentation Government Procurement Human Resources Human Resource Planning Internet Recruiting Information Technology Organizational... Process Improvement Retention Management Retention Strategies Requirements Analysis Requirements Gathering Screening Resumes Software Documentation Solution Selling State & Local... System Deployment Technical Recruiting Workforce Planning Workforce Management Workforce Development Strategy Professional Services Benefits Negotiation SDLC Screening Leadership Change Management Project Management Data Center Outsourcing Training Staffing Services Temporary Placement Management Networking Team Building IT Service Management Team Leadership CRM See 35+     See less Business Analysis Business Development Business Process Building Relationships Business Relationship... Business Requirements Cold Calling College Recruiting Consulting Contract Negotiation Documentation Government Procurement Human Resources Human Resource Planning Internet Recruiting Information Technology Organizational... Process Improvement Retention Management Retention Strategies Requirements Analysis Requirements Gathering Screening Resumes Software Documentation Solution Selling State & Local... System Deployment Technical Recruiting Workforce Planning Workforce Management Workforce Development Strategy Professional Services Benefits Negotiation SDLC Screening Leadership Change Management Project Management Data Center Outsourcing Training Staffing Services Temporary Placement Management Networking Team Building IT Service Management Team Leadership CRM See 35+     See less Business Analysis Business Development Business Process Building Relationships Business Relationship... Business Requirements Cold Calling College Recruiting Consulting Contract Negotiation Documentation Government Procurement Human Resources Human Resource Planning Internet Recruiting Information Technology Organizational... Process Improvement Retention Management Retention Strategies Requirements Analysis Requirements Gathering Screening Resumes Software Documentation Solution Selling State & Local... System Deployment Technical Recruiting Workforce Planning Workforce Management Workforce Development Strategy Professional Services Benefits Negotiation SDLC Screening Leadership Change Management Project Management Data Center Outsourcing Training Staffing Services Temporary Placement Management Networking Team Building IT Service Management Team Leadership CRM See 35+     See less Education California State University-Chico BA,  Political Science - Criminal Justice 1989  – 1993 Activities and Societies:  Phi Kappa Tau Fraternity California State University-Chico BA,  Political Science - Criminal Justice 1989  – 1993 Activities and Societies:  Phi Kappa Tau Fraternity California State University-Chico BA,  Political Science - Criminal Justice 1989  – 1993 Activities and Societies:  Phi Kappa Tau Fraternity California State University-Chico BA,  Political Science - Criminal Justice 1989  – 1993 Activities and Societies:  Phi Kappa Tau Fraternity "]}