{"position": "Construction Project Manager", "company": "Intel Corporation", "profiles": ["Experience IT MAC (Mergers Acquisition and Construction) Project Manager Intel Corporation July 2013  – Present (2 years 2 months) Hillsboro, OR Facilities Planner Intel December 1998  –  July 2013  (14 years 8 months) IT MAC (Mergers Acquisition and Construction) Project Manager Intel Corporation July 2013  – Present (2 years 2 months) Hillsboro, OR IT MAC (Mergers Acquisition and Construction) Project Manager Intel Corporation July 2013  – Present (2 years 2 months) Hillsboro, OR Facilities Planner Intel December 1998  –  July 2013  (14 years 8 months) Facilities Planner Intel December 1998  –  July 2013  (14 years 8 months) Skills Program Management Cross-functional Team... Budgets Process Improvement Project Planning Project Management Integration SharePoint Strategic Planning Vendor Management Procurement Contract Management Management MS Project Facilities Management Six Sigma Process Engineering Team Leadership Contract Negotiation Team Building Operations Management Continuous Improvement Leadership Process Scheduler Lean Manufacturing Manufacturing Quality Assurance Engineering Analysis Troubleshooting Change Management Project Coordination Engineering Management Materials Purchasing Supply Chain Management SAP Business Process... Visio PMP Microsoft Project See 26+     See less Skills  Program Management Cross-functional Team... Budgets Process Improvement Project Planning Project Management Integration SharePoint Strategic Planning Vendor Management Procurement Contract Management Management MS Project Facilities Management Six Sigma Process Engineering Team Leadership Contract Negotiation Team Building Operations Management Continuous Improvement Leadership Process Scheduler Lean Manufacturing Manufacturing Quality Assurance Engineering Analysis Troubleshooting Change Management Project Coordination Engineering Management Materials Purchasing Supply Chain Management SAP Business Process... Visio PMP Microsoft Project See 26+     See less Program Management Cross-functional Team... Budgets Process Improvement Project Planning Project Management Integration SharePoint Strategic Planning Vendor Management Procurement Contract Management Management MS Project Facilities Management Six Sigma Process Engineering Team Leadership Contract Negotiation Team Building Operations Management Continuous Improvement Leadership Process Scheduler Lean Manufacturing Manufacturing Quality Assurance Engineering Analysis Troubleshooting Change Management Project Coordination Engineering Management Materials Purchasing Supply Chain Management SAP Business Process... Visio PMP Microsoft Project See 26+     See less Program Management Cross-functional Team... Budgets Process Improvement Project Planning Project Management Integration SharePoint Strategic Planning Vendor Management Procurement Contract Management Management MS Project Facilities Management Six Sigma Process Engineering Team Leadership Contract Negotiation Team Building Operations Management Continuous Improvement Leadership Process Scheduler Lean Manufacturing Manufacturing Quality Assurance Engineering Analysis Troubleshooting Change Management Project Coordination Engineering Management Materials Purchasing Supply Chain Management SAP Business Process... Visio PMP Microsoft Project See 26+     See less Education University of Idaho Bachelor of Fine Arts (BFA),  Interior Design University of Idaho Bachelor of Fine Arts (BFA),  Interior Design University of Idaho Bachelor of Fine Arts (BFA),  Interior Design University of Idaho Bachelor of Fine Arts (BFA),  Interior Design ", "Languages Russian Native or bilingual proficiency English Native or bilingual proficiency Russian Native or bilingual proficiency English Native or bilingual proficiency Russian Native or bilingual proficiency English Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Government Relations Operations Management Organizational... Stakeholder Management Customer Relations People Management Intel Program Management Negotiation Strategic Planning Business Strategy Budgets Management Leadership Business Intelligence Cross-functional Team... Project Management Team Leadership IT Management Strategy Product Management Customer Service Software Project... Process Improvement Software Development Marketing Business Development Product Marketing Telecommunications Start-ups Team Management Integration Vendor Management Outsourcing Cloud Computing Competitive Analysis Business Analysis Business Process... Strategic Partnerships Change Management Business Process Go-to-market Strategy Analysis IT Operations Enterprise Software Mobile Devices SaaS CRM Business Alliances Pre-sales See 35+     See less Skills  Government Relations Operations Management Organizational... Stakeholder Management Customer Relations People Management Intel Program Management Negotiation Strategic Planning Business Strategy Budgets Management Leadership Business Intelligence Cross-functional Team... Project Management Team Leadership IT Management Strategy Product Management Customer Service Software Project... Process Improvement Software Development Marketing Business Development Product Marketing Telecommunications Start-ups Team Management Integration Vendor Management Outsourcing Cloud Computing Competitive Analysis Business Analysis Business Process... Strategic Partnerships Change Management Business Process Go-to-market Strategy Analysis IT Operations Enterprise Software Mobile Devices SaaS CRM Business Alliances Pre-sales See 35+     See less Government Relations Operations Management Organizational... Stakeholder Management Customer Relations People Management Intel Program Management Negotiation Strategic Planning Business Strategy Budgets Management Leadership Business Intelligence Cross-functional Team... Project Management Team Leadership IT Management Strategy Product Management Customer Service Software Project... Process Improvement Software Development Marketing Business Development Product Marketing Telecommunications Start-ups Team Management Integration Vendor Management Outsourcing Cloud Computing Competitive Analysis Business Analysis Business Process... Strategic Partnerships Change Management Business Process Go-to-market Strategy Analysis IT Operations Enterprise Software Mobile Devices SaaS CRM Business Alliances Pre-sales See 35+     See less Government Relations Operations Management Organizational... Stakeholder Management Customer Relations People Management Intel Program Management Negotiation Strategic Planning Business Strategy Budgets Management Leadership Business Intelligence Cross-functional Team... Project Management Team Leadership IT Management Strategy Product Management Customer Service Software Project... Process Improvement Software Development Marketing Business Development Product Marketing Telecommunications Start-ups Team Management Integration Vendor Management Outsourcing Cloud Computing Competitive Analysis Business Analysis Business Process... Strategic Partnerships Change Management Business Process Go-to-market Strategy Analysis IT Operations Enterprise Software Mobile Devices SaaS CRM Business Alliances Pre-sales See 35+     See less ", "Summary Throughout my career I have utilized my unique blend of technical and business acumen to consistently improve operating margin, increase customer satisfaction, and develop sustainable growth strategies. Worked with leaders in the high-tech and energy sectors, providing a wide spectrum of deliverables, and excelling in a fast-paced and extremely dynamic environment.  \n \nHave become a well rounded leader by augmenting my military background with higher education via Nuclear Engineering and an MBA from Arizona State University. My success is due, in part, to my excellent interpersonal communications skills. It has enabled me to harness the potential of all levels of employees and motivate them to achieve superior results. \n \nSpecialties: Global Market Intelligence, Business Development, Supply Chain Management, Risk Management, Organizational Development, Negotiation Tactics, Continuous Improvement, Operational Improvements, Process Redesign, Regulatory Compliance Summary Throughout my career I have utilized my unique blend of technical and business acumen to consistently improve operating margin, increase customer satisfaction, and develop sustainable growth strategies. Worked with leaders in the high-tech and energy sectors, providing a wide spectrum of deliverables, and excelling in a fast-paced and extremely dynamic environment.  \n \nHave become a well rounded leader by augmenting my military background with higher education via Nuclear Engineering and an MBA from Arizona State University. My success is due, in part, to my excellent interpersonal communications skills. It has enabled me to harness the potential of all levels of employees and motivate them to achieve superior results. \n \nSpecialties: Global Market Intelligence, Business Development, Supply Chain Management, Risk Management, Organizational Development, Negotiation Tactics, Continuous Improvement, Operational Improvements, Process Redesign, Regulatory Compliance Throughout my career I have utilized my unique blend of technical and business acumen to consistently improve operating margin, increase customer satisfaction, and develop sustainable growth strategies. Worked with leaders in the high-tech and energy sectors, providing a wide spectrum of deliverables, and excelling in a fast-paced and extremely dynamic environment.  \n \nHave become a well rounded leader by augmenting my military background with higher education via Nuclear Engineering and an MBA from Arizona State University. My success is due, in part, to my excellent interpersonal communications skills. It has enabled me to harness the potential of all levels of employees and motivate them to achieve superior results. \n \nSpecialties: Global Market Intelligence, Business Development, Supply Chain Management, Risk Management, Organizational Development, Negotiation Tactics, Continuous Improvement, Operational Improvements, Process Redesign, Regulatory Compliance Throughout my career I have utilized my unique blend of technical and business acumen to consistently improve operating margin, increase customer satisfaction, and develop sustainable growth strategies. Worked with leaders in the high-tech and energy sectors, providing a wide spectrum of deliverables, and excelling in a fast-paced and extremely dynamic environment.  \n \nHave become a well rounded leader by augmenting my military background with higher education via Nuclear Engineering and an MBA from Arizona State University. My success is due, in part, to my excellent interpersonal communications skills. It has enabled me to harness the potential of all levels of employees and motivate them to achieve superior results. \n \nSpecialties: Global Market Intelligence, Business Development, Supply Chain Management, Risk Management, Organizational Development, Negotiation Tactics, Continuous Improvement, Operational Improvements, Process Redesign, Regulatory Compliance Experience General Manager, North America CRU 2012  – Present (3 years) CRU is the leading, independent, global metals, mining and fertilizer analysis, consultancy and conference business. Employing staff in London, Beijing, Pittsburgh, Santiago, Mumbai, and Sydney, CRU is dedicated to providing high quality analysis and insight to its global customer base. Division Chairman - Board of Directors American Heart Association 2010  – Present (5 years) Chairperson of the Beaver and Butler County Board of Directors for the American Heart Association. Director of Global Supply Chain Strategy Westinghouse Electric Company 2008  –  2012  (4 years) Digital Health Operations Director Intel Corporation 2007  –  2008  (1 year) North American Region Strategic Sourcing Manager Intel Corporation 2004  –  2006  (2 years) Construction Project Manager Intel Corporation 2000  –  2003  (3 years) Control Systems Engineer Infineon Semiconductor (Siemens and Motorola Joint Venture) 1997  –  2000  (3 years) Control Systems Engineer Virginia Commonwealth University 1995  –  1997  (2 years) Control Systems Engineer Safetran Systems 1994  –  1995  (1 year) Nuclear Plant Operations US Navy 1989  –  1994  (5 years) General Manager, North America CRU 2012  – Present (3 years) CRU is the leading, independent, global metals, mining and fertilizer analysis, consultancy and conference business. Employing staff in London, Beijing, Pittsburgh, Santiago, Mumbai, and Sydney, CRU is dedicated to providing high quality analysis and insight to its global customer base. General Manager, North America CRU 2012  – Present (3 years) CRU is the leading, independent, global metals, mining and fertilizer analysis, consultancy and conference business. Employing staff in London, Beijing, Pittsburgh, Santiago, Mumbai, and Sydney, CRU is dedicated to providing high quality analysis and insight to its global customer base. Division Chairman - Board of Directors American Heart Association 2010  – Present (5 years) Chairperson of the Beaver and Butler County Board of Directors for the American Heart Association. Division Chairman - Board of Directors American Heart Association 2010  – Present (5 years) Chairperson of the Beaver and Butler County Board of Directors for the American Heart Association. Director of Global Supply Chain Strategy Westinghouse Electric Company 2008  –  2012  (4 years) Director of Global Supply Chain Strategy Westinghouse Electric Company 2008  –  2012  (4 years) Digital Health Operations Director Intel Corporation 2007  –  2008  (1 year) Digital Health Operations Director Intel Corporation 2007  –  2008  (1 year) North American Region Strategic Sourcing Manager Intel Corporation 2004  –  2006  (2 years) North American Region Strategic Sourcing Manager Intel Corporation 2004  –  2006  (2 years) Construction Project Manager Intel Corporation 2000  –  2003  (3 years) Construction Project Manager Intel Corporation 2000  –  2003  (3 years) Control Systems Engineer Infineon Semiconductor (Siemens and Motorola Joint Venture) 1997  –  2000  (3 years) Control Systems Engineer Infineon Semiconductor (Siemens and Motorola Joint Venture) 1997  –  2000  (3 years) Control Systems Engineer Virginia Commonwealth University 1995  –  1997  (2 years) Control Systems Engineer Virginia Commonwealth University 1995  –  1997  (2 years) Control Systems Engineer Safetran Systems 1994  –  1995  (1 year) Control Systems Engineer Safetran Systems 1994  –  1995  (1 year) Nuclear Plant Operations US Navy 1989  –  1994  (5 years) Nuclear Plant Operations US Navy 1989  –  1994  (5 years) Languages   Skills Supply Chain Management Negotiation Business Process... Organizational... Risk Management Market Intelligence Project Management Sustainability Business Development Strategy Six Sigma Team Leadership Process Engineering Strategic Sourcing Lean Manufacturing Engineering Strategic Planning Manufacturing Management Cross-functional Team... Procurement Supply Chain Competitive Analysis Forecasting Program Management Business Planning Leadership Analysis Process Improvement Product Management Change Management Business Strategy Energy Project Planning Contract Negotiation Operations Management Product Marketing Budgets Team Building Continuous Improvement Contract Management International Business Product Development Mergers & Acquisitions Start-ups New Business Development Logistics Policy Training Management Consulting See 35+     See less Skills  Supply Chain Management Negotiation Business Process... Organizational... Risk Management Market Intelligence Project Management Sustainability Business Development Strategy Six Sigma Team Leadership Process Engineering Strategic Sourcing Lean Manufacturing Engineering Strategic Planning Manufacturing Management Cross-functional Team... Procurement Supply Chain Competitive Analysis Forecasting Program Management Business Planning Leadership Analysis Process Improvement Product Management Change Management Business Strategy Energy Project Planning Contract Negotiation Operations Management Product Marketing Budgets Team Building Continuous Improvement Contract Management International Business Product Development Mergers & Acquisitions Start-ups New Business Development Logistics Policy Training Management Consulting See 35+     See less Supply Chain Management Negotiation Business Process... Organizational... Risk Management Market Intelligence Project Management Sustainability Business Development Strategy Six Sigma Team Leadership Process Engineering Strategic Sourcing Lean Manufacturing Engineering Strategic Planning Manufacturing Management Cross-functional Team... Procurement Supply Chain Competitive Analysis Forecasting Program Management Business Planning Leadership Analysis Process Improvement Product Management Change Management Business Strategy Energy Project Planning Contract Negotiation Operations Management Product Marketing Budgets Team Building Continuous Improvement Contract Management International Business Product Development Mergers & Acquisitions Start-ups New Business Development Logistics Policy Training Management Consulting See 35+     See less Supply Chain Management Negotiation Business Process... Organizational... Risk Management Market Intelligence Project Management Sustainability Business Development Strategy Six Sigma Team Leadership Process Engineering Strategic Sourcing Lean Manufacturing Engineering Strategic Planning Manufacturing Management Cross-functional Team... Procurement Supply Chain Competitive Analysis Forecasting Program Management Business Planning Leadership Analysis Process Improvement Product Management Change Management Business Strategy Energy Project Planning Contract Negotiation Operations Management Product Marketing Budgets Team Building Continuous Improvement Contract Management International Business Product Development Mergers & Acquisitions Start-ups New Business Development Logistics Policy Training Management Consulting See 35+     See less Education Arizona State University MBA,  Global Supply Chain Management MBA specialization in Global Supply Chain Management Thomas Edison State College BS,  Nuclear Engineering Arizona State University MBA,  Global Supply Chain Management MBA specialization in Global Supply Chain Management Arizona State University MBA,  Global Supply Chain Management MBA specialization in Global Supply Chain Management Arizona State University MBA,  Global Supply Chain Management MBA specialization in Global Supply Chain Management Thomas Edison State College BS,  Nuclear Engineering Thomas Edison State College BS,  Nuclear Engineering Thomas Edison State College BS,  Nuclear Engineering Honors & Awards ", "Summary Specialties:Clean roon environment projects. Data Center construction. Summary Specialties:Clean roon environment projects. Data Center construction. Specialties:Clean roon environment projects. Data Center construction. Specialties:Clean roon environment projects. Data Center construction. Experience Quality GL .intel Construction Project Manager Intel Corporation April 2007  – Present (8 years 5 months) Scope, budget and schedule management of diverse facilities construction projects civil, electrical, IT, etc). Stakeholder and contractor management. Quality GL .intel Quality GL .intel Construction Project Manager Intel Corporation April 2007  – Present (8 years 5 months) Scope, budget and schedule management of diverse facilities construction projects civil, electrical, IT, etc). Stakeholder and contractor management. Construction Project Manager Intel Corporation April 2007  – Present (8 years 5 months) Scope, budget and schedule management of diverse facilities construction projects civil, electrical, IT, etc). Stakeholder and contractor management. Education Project Management Institute PMP,  Project Management 2007  – 2008 Universidad Interamericana de Costa Rica LIC,  Civil engineering 2003  – 2007 Tecnológico de Costa Rica MBA,  Business administration 1997  – 2000 Universidad de Costa Rica BS,  Electrical engineering 1978  – 1985 Project Management Institute PMP,  Project Management 2007  – 2008 Project Management Institute PMP,  Project Management 2007  – 2008 Project Management Institute PMP,  Project Management 2007  – 2008 Universidad Interamericana de Costa Rica LIC,  Civil engineering 2003  – 2007 Universidad Interamericana de Costa Rica LIC,  Civil engineering 2003  – 2007 Universidad Interamericana de Costa Rica LIC,  Civil engineering 2003  – 2007 Tecnológico de Costa Rica MBA,  Business administration 1997  – 2000 Tecnológico de Costa Rica MBA,  Business administration 1997  – 2000 Tecnológico de Costa Rica MBA,  Business administration 1997  – 2000 Universidad de Costa Rica BS,  Electrical engineering 1978  – 1985 Universidad de Costa Rica BS,  Electrical engineering 1978  – 1985 Universidad de Costa Rica BS,  Electrical engineering 1978  – 1985 ", "Experience Construction Project Manager Intel Corporation July 2014  – Present (1 year 2 months) Owner West Coast Design and Graphics May 2009  – Present (6 years 4 months) Construction Project Manager Intel Corporation July 2014  – Present (1 year 2 months) Construction Project Manager Intel Corporation July 2014  – Present (1 year 2 months) Owner West Coast Design and Graphics May 2009  – Present (6 years 4 months) Owner West Coast Design and Graphics May 2009  – Present (6 years 4 months) Languages   Skills Revit InDesign Illustrator Photoshop AutoCAD iWork iLife Microsoft Office Sustainable Design Submittals Architecture Modeling Architecture SketchUp Adobe Creative Suite Architectural Design Space planning Rendering LEED Model Making Architectural Drawings Urban Design Green Building LEED AP Graphic Design AutoCAD Architecture Sustainability Residential Design Mixed-use Photography Urban Planning Concept Design Energy Efficiency 3D visualization Interior Architecture OS X Construction Drawings Social Networking Project Planning Design Research Digital Photography 3D Modeling See 26+     See less Skills  Revit InDesign Illustrator Photoshop AutoCAD iWork iLife Microsoft Office Sustainable Design Submittals Architecture Modeling Architecture SketchUp Adobe Creative Suite Architectural Design Space planning Rendering LEED Model Making Architectural Drawings Urban Design Green Building LEED AP Graphic Design AutoCAD Architecture Sustainability Residential Design Mixed-use Photography Urban Planning Concept Design Energy Efficiency 3D visualization Interior Architecture OS X Construction Drawings Social Networking Project Planning Design Research Digital Photography 3D Modeling See 26+     See less Revit InDesign Illustrator Photoshop AutoCAD iWork iLife Microsoft Office Sustainable Design Submittals Architecture Modeling Architecture SketchUp Adobe Creative Suite Architectural Design Space planning Rendering LEED Model Making Architectural Drawings Urban Design Green Building LEED AP Graphic Design AutoCAD Architecture Sustainability Residential Design Mixed-use Photography Urban Planning Concept Design Energy Efficiency 3D visualization Interior Architecture OS X Construction Drawings Social Networking Project Planning Design Research Digital Photography 3D Modeling See 26+     See less Revit InDesign Illustrator Photoshop AutoCAD iWork iLife Microsoft Office Sustainable Design Submittals Architecture Modeling Architecture SketchUp Adobe Creative Suite Architectural Design Space planning Rendering LEED Model Making Architectural Drawings Urban Design Green Building LEED AP Graphic Design AutoCAD Architecture Sustainability Residential Design Mixed-use Photography Urban Planning Concept Design Energy Efficiency 3D visualization Interior Architecture OS X Construction Drawings Social Networking Project Planning Design Research Digital Photography 3D Modeling See 26+     See less Education University of Oregon - Charles H. Lundquist College of Business Master of Business Administration (MBA) 2012  – 2014 University of Southern California Bachelors of Architecture 2005  – 2010 Tigard High School Certificate of Initial Mastery Diploma, Honor School Graduate, IB Certificate 2001  – 2005 University of Oregon - Charles H. Lundquist College of Business Master of Business Administration (MBA) 2012  – 2014 University of Oregon - Charles H. Lundquist College of Business Master of Business Administration (MBA) 2012  – 2014 University of Oregon - Charles H. Lundquist College of Business Master of Business Administration (MBA) 2012  – 2014 University of Southern California Bachelors of Architecture 2005  – 2010 University of Southern California Bachelors of Architecture 2005  – 2010 University of Southern California Bachelors of Architecture 2005  – 2010 Tigard High School Certificate of Initial Mastery Diploma, Honor School Graduate, IB Certificate 2001  – 2005 Tigard High School Certificate of Initial Mastery Diploma, Honor School Graduate, IB Certificate 2001  – 2005 Tigard High School Certificate of Initial Mastery Diploma, Honor School Graduate, IB Certificate 2001  – 2005 Honors & Awards ", "Skills Intel Semiconductors Design of Experiments Semiconductor Industry Cross-functional Team... Processors SoC IC Silicon Lean Manufacturing DMAIC ASIC Skills  Intel Semiconductors Design of Experiments Semiconductor Industry Cross-functional Team... Processors SoC IC Silicon Lean Manufacturing DMAIC ASIC Intel Semiconductors Design of Experiments Semiconductor Industry Cross-functional Team... Processors SoC IC Silicon Lean Manufacturing DMAIC ASIC Intel Semiconductors Design of Experiments Semiconductor Industry Cross-functional Team... Processors SoC IC Silicon Lean Manufacturing DMAIC ASIC ", "Experience Malaysia Construction Project Manager Intel Corporation Malaysia Construction Project Manager Intel Corporation Malaysia Construction Project Manager Intel Corporation Skills Engineering Contract Management SoC ASIC Project Planning Skills  Engineering Contract Management SoC ASIC Project Planning Engineering Contract Management SoC ASIC Project Planning Engineering Contract Management SoC ASIC Project Planning ", "Experience Construction Project Manager Intel Corporation October 2011  – Present (3 years 11 months) Leixlip co. Kildare Owner for Critical Success Indicators on safety, quality, schedule and cost during the execution of the tool install construction with in a functional area.Work with the design team, customers & multiple trade contractors to co-ordinate and oversee design process for the tool set, manage and set clear direction to stake holders with in the project team, partner with stake holders for overall program delivery & success. Work with in the integrated project delivery (IPD) structure to ensure all stake holders embrace the philosophy of lean construction and work this on a daily basis to excel at meeting key milestones with in the project \n Construction Project Manager Intel Corporation October 2011  – Present (3 years 11 months) Leixlip co. Kildare Owner for Critical Success Indicators on safety, quality, schedule and cost during the execution of the tool install construction with in a functional area.Work with the design team, customers & multiple trade contractors to co-ordinate and oversee design process for the tool set, manage and set clear direction to stake holders with in the project team, partner with stake holders for overall program delivery & success. Work with in the integrated project delivery (IPD) structure to ensure all stake holders embrace the philosophy of lean construction and work this on a daily basis to excel at meeting key milestones with in the project \n Construction Project Manager Intel Corporation October 2011  – Present (3 years 11 months) Leixlip co. Kildare Owner for Critical Success Indicators on safety, quality, schedule and cost during the execution of the tool install construction with in a functional area.Work with the design team, customers & multiple trade contractors to co-ordinate and oversee design process for the tool set, manage and set clear direction to stake holders with in the project team, partner with stake holders for overall program delivery & success. Work with in the integrated project delivery (IPD) structure to ensure all stake holders embrace the philosophy of lean construction and work this on a daily basis to excel at meeting key milestones with in the project \n Education Dublin Institute of Technology Mechanical Engineering - Apprenticeship 1989  – 1993 Collinstown Park Community College High School 1985  – 1989 Dublin Institute of Technology Mechanical Engineering - Apprenticeship 1989  – 1993 Dublin Institute of Technology Mechanical Engineering - Apprenticeship 1989  – 1993 Dublin Institute of Technology Mechanical Engineering - Apprenticeship 1989  – 1993 Collinstown Park Community College High School 1985  – 1989 Collinstown Park Community College High School 1985  – 1989 Collinstown Park Community College High School 1985  – 1989 ", "Summary Goal-oriented professional with over 20 years of project management experience in cutting-edge construction projects at some of the world’s largest semiconductor companies, such as Intel and Fujitsu. Proven ability to complete multiple complex projects simultaneously from design to fully operational status. Strong technical aptitude and ability to solve complex problems independently. Extensive experience with facilitating structured problem-solving, analyzing statistical reports and trends, and driving to Win/Win solutions. Results-oriented, a willing and quick learner, a team player, eager to stretch beyond core competencies. \n \n•\tConstruction Manager \n•\tEquipment Installation Project Manager\t \n•\tProcess Specific Specialty Systems Discipline Lead \n•\tFacilities and Sustaining Project Manager \n•\tLogistics Program Manager \n•\tFacilities Mechanical Engineer Summary Goal-oriented professional with over 20 years of project management experience in cutting-edge construction projects at some of the world’s largest semiconductor companies, such as Intel and Fujitsu. Proven ability to complete multiple complex projects simultaneously from design to fully operational status. Strong technical aptitude and ability to solve complex problems independently. Extensive experience with facilitating structured problem-solving, analyzing statistical reports and trends, and driving to Win/Win solutions. Results-oriented, a willing and quick learner, a team player, eager to stretch beyond core competencies. \n \n•\tConstruction Manager \n•\tEquipment Installation Project Manager\t \n•\tProcess Specific Specialty Systems Discipline Lead \n•\tFacilities and Sustaining Project Manager \n•\tLogistics Program Manager \n•\tFacilities Mechanical Engineer Goal-oriented professional with over 20 years of project management experience in cutting-edge construction projects at some of the world’s largest semiconductor companies, such as Intel and Fujitsu. Proven ability to complete multiple complex projects simultaneously from design to fully operational status. Strong technical aptitude and ability to solve complex problems independently. Extensive experience with facilitating structured problem-solving, analyzing statistical reports and trends, and driving to Win/Win solutions. Results-oriented, a willing and quick learner, a team player, eager to stretch beyond core competencies. \n \n•\tConstruction Manager \n•\tEquipment Installation Project Manager\t \n•\tProcess Specific Specialty Systems Discipline Lead \n•\tFacilities and Sustaining Project Manager \n•\tLogistics Program Manager \n•\tFacilities Mechanical Engineer Goal-oriented professional with over 20 years of project management experience in cutting-edge construction projects at some of the world’s largest semiconductor companies, such as Intel and Fujitsu. Proven ability to complete multiple complex projects simultaneously from design to fully operational status. Strong technical aptitude and ability to solve complex problems independently. Extensive experience with facilitating structured problem-solving, analyzing statistical reports and trends, and driving to Win/Win solutions. Results-oriented, a willing and quick learner, a team player, eager to stretch beyond core competencies. \n \n•\tConstruction Manager \n•\tEquipment Installation Project Manager\t \n•\tProcess Specific Specialty Systems Discipline Lead \n•\tFacilities and Sustaining Project Manager \n•\tLogistics Program Manager \n•\tFacilities Mechanical Engineer Experience Construction Project Manager Intel Corporation December 2008  – Present (6 years 9 months) Albuquerque, New Mexico Area Project Manager, Rio Rancho, NM 2012-Present \n \nAccomplished planning, directing, and coordinating activities pertaining to building and facilities construction projects. Development contracting strategy, project scope, schedules, approval requirements, project budgets, quality requirements and change control processes. Key interface between customers, A & E design team, equipment vendors, construction trades, and field construction coordinators. \n \nKEY ACCOMPLISHMENTS: \n•\tCompleted multiple pilot projects applying “Forward Progress and Bureaucracy removal” contracting strategy which resulted in 28%-35 % overall project cost reduction. \n•\tCompleted parking/close-out of Fab 42 (Temporary assignment at Ocotillo, AZ) project ahead of schedule enabling trades contractor to get a head-start on the new multi-billion-dollar project \n•\tLed F42 Restart Team and developed a robust plan to reduce the initial 18-month duration to 15 months without adding additional cost for project acceleration and over time Site Construction Manager Intel Corporation June 2006  –  June 2008  (2 years 1 month) Albuquerque, New Mexico Area Planned, directed, and coordinated activities pertaining to building and facilities construction projects. Delivered multiple construction projects using various project delivery methodologies and execution strategies at a competitive advantage. Defined and implemented cost-effective strategies for design scope, contracting strategy, and staffing work plan development \nKEY ACCOMPLISHMENTS: \n•\tDrove a 5% Indirect cost reduction year over year against forecast ($55M) and historical benchmarks \n•\tDeveloped tools which enabled the project team to accurately (within 3%) forecast construction resources headcount needs \n•\tDrove improvements to equipment crating process to enable shipment by rail, ocean, and long-term storage by improving crating protection to minimize micro-corrosion and structural instability, resulting in an additional 25% overall cost avoidance Tool Install Project Manager Intel Corporation December 2000  –  June 2006  (5 years 7 months) Albuquerque, New Mexico Area Managed factory capital equipment installation and de-installation for multiple High-Volume Manufacturing projects. Successfully delivered project teams objectives and goals on or ahead of schedule and under budget, with emphasis on safety and quality \nKEY ACCOMPLISHMENTS: \n•\tDeveloped and implemented tool-specific activity checklists to measure real-time field progress to proactively manage schedule predictability \n•\tDeveloped and utilized project specific playbooks to ensure optimum construction sequencing across multiple disciplines \n•\tDe-installed 1200-plus factory process tools with zero recordable, Best in Class performance against schedule, and 10% lower than the forecasted budget Project Manager Lockwood Greene Engineers June 1997  –  December 2000  (3 years 7 months) Albuquerque, New Mexico Area Completed multiple projects overseeing planning, construction, modification to facilities systems, buildings, and structures as required supporting business requirements Project Manager Hoffman Corp April 1994  –  May 1997  (3 years 2 months) Albuquerque, New Mexico Area, Ocotillo, Arizona, and Gresham, Oregon Managed all aspects of Basebuild (Fit up) and Factory tool installation (Hook-up) projects such as Process Specific Specialty Systems, Acid Waste Neutralization Systems, and Ultra-Pure Water system FACILITIES MECHANICAL ENGINEER Westinghouse Electric Company March 1990  –  April 1991  (1 year 2 months) Richland/Kennewick/Pasco, Washington Area Led design, reconfiguration, maintenance, and modifications of equipment, machinery, facilities systems, buildings, and structures as required Construction Project Manager Intel Corporation December 2008  – Present (6 years 9 months) Albuquerque, New Mexico Area Project Manager, Rio Rancho, NM 2012-Present \n \nAccomplished planning, directing, and coordinating activities pertaining to building and facilities construction projects. Development contracting strategy, project scope, schedules, approval requirements, project budgets, quality requirements and change control processes. Key interface between customers, A & E design team, equipment vendors, construction trades, and field construction coordinators. \n \nKEY ACCOMPLISHMENTS: \n•\tCompleted multiple pilot projects applying “Forward Progress and Bureaucracy removal” contracting strategy which resulted in 28%-35 % overall project cost reduction. \n•\tCompleted parking/close-out of Fab 42 (Temporary assignment at Ocotillo, AZ) project ahead of schedule enabling trades contractor to get a head-start on the new multi-billion-dollar project \n•\tLed F42 Restart Team and developed a robust plan to reduce the initial 18-month duration to 15 months without adding additional cost for project acceleration and over time Construction Project Manager Intel Corporation December 2008  – Present (6 years 9 months) Albuquerque, New Mexico Area Project Manager, Rio Rancho, NM 2012-Present \n \nAccomplished planning, directing, and coordinating activities pertaining to building and facilities construction projects. Development contracting strategy, project scope, schedules, approval requirements, project budgets, quality requirements and change control processes. Key interface between customers, A & E design team, equipment vendors, construction trades, and field construction coordinators. \n \nKEY ACCOMPLISHMENTS: \n•\tCompleted multiple pilot projects applying “Forward Progress and Bureaucracy removal” contracting strategy which resulted in 28%-35 % overall project cost reduction. \n•\tCompleted parking/close-out of Fab 42 (Temporary assignment at Ocotillo, AZ) project ahead of schedule enabling trades contractor to get a head-start on the new multi-billion-dollar project \n•\tLed F42 Restart Team and developed a robust plan to reduce the initial 18-month duration to 15 months without adding additional cost for project acceleration and over time Site Construction Manager Intel Corporation June 2006  –  June 2008  (2 years 1 month) Albuquerque, New Mexico Area Planned, directed, and coordinated activities pertaining to building and facilities construction projects. Delivered multiple construction projects using various project delivery methodologies and execution strategies at a competitive advantage. Defined and implemented cost-effective strategies for design scope, contracting strategy, and staffing work plan development \nKEY ACCOMPLISHMENTS: \n•\tDrove a 5% Indirect cost reduction year over year against forecast ($55M) and historical benchmarks \n•\tDeveloped tools which enabled the project team to accurately (within 3%) forecast construction resources headcount needs \n•\tDrove improvements to equipment crating process to enable shipment by rail, ocean, and long-term storage by improving crating protection to minimize micro-corrosion and structural instability, resulting in an additional 25% overall cost avoidance Site Construction Manager Intel Corporation June 2006  –  June 2008  (2 years 1 month) Albuquerque, New Mexico Area Planned, directed, and coordinated activities pertaining to building and facilities construction projects. Delivered multiple construction projects using various project delivery methodologies and execution strategies at a competitive advantage. Defined and implemented cost-effective strategies for design scope, contracting strategy, and staffing work plan development \nKEY ACCOMPLISHMENTS: \n•\tDrove a 5% Indirect cost reduction year over year against forecast ($55M) and historical benchmarks \n•\tDeveloped tools which enabled the project team to accurately (within 3%) forecast construction resources headcount needs \n•\tDrove improvements to equipment crating process to enable shipment by rail, ocean, and long-term storage by improving crating protection to minimize micro-corrosion and structural instability, resulting in an additional 25% overall cost avoidance Tool Install Project Manager Intel Corporation December 2000  –  June 2006  (5 years 7 months) Albuquerque, New Mexico Area Managed factory capital equipment installation and de-installation for multiple High-Volume Manufacturing projects. Successfully delivered project teams objectives and goals on or ahead of schedule and under budget, with emphasis on safety and quality \nKEY ACCOMPLISHMENTS: \n•\tDeveloped and implemented tool-specific activity checklists to measure real-time field progress to proactively manage schedule predictability \n•\tDeveloped and utilized project specific playbooks to ensure optimum construction sequencing across multiple disciplines \n•\tDe-installed 1200-plus factory process tools with zero recordable, Best in Class performance against schedule, and 10% lower than the forecasted budget Tool Install Project Manager Intel Corporation December 2000  –  June 2006  (5 years 7 months) Albuquerque, New Mexico Area Managed factory capital equipment installation and de-installation for multiple High-Volume Manufacturing projects. Successfully delivered project teams objectives and goals on or ahead of schedule and under budget, with emphasis on safety and quality \nKEY ACCOMPLISHMENTS: \n•\tDeveloped and implemented tool-specific activity checklists to measure real-time field progress to proactively manage schedule predictability \n•\tDeveloped and utilized project specific playbooks to ensure optimum construction sequencing across multiple disciplines \n•\tDe-installed 1200-plus factory process tools with zero recordable, Best in Class performance against schedule, and 10% lower than the forecasted budget Project Manager Lockwood Greene Engineers June 1997  –  December 2000  (3 years 7 months) Albuquerque, New Mexico Area Completed multiple projects overseeing planning, construction, modification to facilities systems, buildings, and structures as required supporting business requirements Project Manager Lockwood Greene Engineers June 1997  –  December 2000  (3 years 7 months) Albuquerque, New Mexico Area Completed multiple projects overseeing planning, construction, modification to facilities systems, buildings, and structures as required supporting business requirements Project Manager Hoffman Corp April 1994  –  May 1997  (3 years 2 months) Albuquerque, New Mexico Area, Ocotillo, Arizona, and Gresham, Oregon Managed all aspects of Basebuild (Fit up) and Factory tool installation (Hook-up) projects such as Process Specific Specialty Systems, Acid Waste Neutralization Systems, and Ultra-Pure Water system Project Manager Hoffman Corp April 1994  –  May 1997  (3 years 2 months) Albuquerque, New Mexico Area, Ocotillo, Arizona, and Gresham, Oregon Managed all aspects of Basebuild (Fit up) and Factory tool installation (Hook-up) projects such as Process Specific Specialty Systems, Acid Waste Neutralization Systems, and Ultra-Pure Water system FACILITIES MECHANICAL ENGINEER Westinghouse Electric Company March 1990  –  April 1991  (1 year 2 months) Richland/Kennewick/Pasco, Washington Area Led design, reconfiguration, maintenance, and modifications of equipment, machinery, facilities systems, buildings, and structures as required FACILITIES MECHANICAL ENGINEER Westinghouse Electric Company March 1990  –  April 1991  (1 year 2 months) Richland/Kennewick/Pasco, Washington Area Led design, reconfiguration, maintenance, and modifications of equipment, machinery, facilities systems, buildings, and structures as required Languages Persian Persian Persian Skills SoC Program Management Engineering Management Semiconductors ASIC Project Management Construction Management Semiconductor Industry Engineering Failure Analysis JMP Manufacturing MS Project IC Cross-functional Team... Product Management Process Engineering Microsoft Project Contract Management Process Scheduler Construction Project Planning See 7+     See less Skills  SoC Program Management Engineering Management Semiconductors ASIC Project Management Construction Management Semiconductor Industry Engineering Failure Analysis JMP Manufacturing MS Project IC Cross-functional Team... Product Management Process Engineering Microsoft Project Contract Management Process Scheduler Construction Project Planning See 7+     See less SoC Program Management Engineering Management Semiconductors ASIC Project Management Construction Management Semiconductor Industry Engineering Failure Analysis JMP Manufacturing MS Project IC Cross-functional Team... Product Management Process Engineering Microsoft Project Contract Management Process Scheduler Construction Project Planning See 7+     See less SoC Program Management Engineering Management Semiconductors ASIC Project Management Construction Management Semiconductor Industry Engineering Failure Analysis JMP Manufacturing MS Project IC Cross-functional Team... Product Management Process Engineering Microsoft Project Contract Management Process Scheduler Construction Project Planning See 7+     See less Education The University of New Mexico Master of Engineering (MEng),  Mechanical Engineering 1991  – 1994 The University of New Mexico Bachelor of Engineering (BEng),  Mechanical Engineering 1984  – 1989 The University of New Mexico Master of Engineering (MEng),  Mechanical Engineering 1991  – 1994 The University of New Mexico Master of Engineering (MEng),  Mechanical Engineering 1991  – 1994 The University of New Mexico Master of Engineering (MEng),  Mechanical Engineering 1991  – 1994 The University of New Mexico Bachelor of Engineering (BEng),  Mechanical Engineering 1984  – 1989 The University of New Mexico Bachelor of Engineering (BEng),  Mechanical Engineering 1984  – 1989 The University of New Mexico Bachelor of Engineering (BEng),  Mechanical Engineering 1984  – 1989 ", "Experience Construction Project Manager Intel Corporation Construction Project Manager Intel Corporation Construction Project Manager Intel Corporation ", "Experience Construction Project Manager Intel Corporation January 2013  – Present (2 years 8 months) Portland, Oregon Area Principal Project Engineer Westinghouse Electric Company December 2009  –  December 2012  (3 years 1 month) Project Controls Manager Bunting Graphics, Inc. November 2006  –  December 2009  (3 years 2 months) Owner Nonamaker Consulting November 1999  –  November 2006  (7 years 1 month) Project Controls Engineer Baugh Construction Oregon July 1995  –  November 1999  (4 years 5 months) Project Manager J.D. Eckman 1995  –  1995  (less than a year) Coop Student McDonough Bolyard Peck, Inc. 1990  –  1993  (3 years) Construction Project Manager Intel Corporation January 2013  – Present (2 years 8 months) Portland, Oregon Area Construction Project Manager Intel Corporation January 2013  – Present (2 years 8 months) Portland, Oregon Area Principal Project Engineer Westinghouse Electric Company December 2009  –  December 2012  (3 years 1 month) Principal Project Engineer Westinghouse Electric Company December 2009  –  December 2012  (3 years 1 month) Project Controls Manager Bunting Graphics, Inc. November 2006  –  December 2009  (3 years 2 months) Project Controls Manager Bunting Graphics, Inc. November 2006  –  December 2009  (3 years 2 months) Owner Nonamaker Consulting November 1999  –  November 2006  (7 years 1 month) Owner Nonamaker Consulting November 1999  –  November 2006  (7 years 1 month) Project Controls Engineer Baugh Construction Oregon July 1995  –  November 1999  (4 years 5 months) Project Controls Engineer Baugh Construction Oregon July 1995  –  November 1999  (4 years 5 months) Project Manager J.D. Eckman 1995  –  1995  (less than a year) Project Manager J.D. Eckman 1995  –  1995  (less than a year) Coop Student McDonough Bolyard Peck, Inc. 1990  –  1993  (3 years) Coop Student McDonough Bolyard Peck, Inc. 1990  –  1993  (3 years) Skills Construction Management Construction Project Control Primavera P6 Earned Value Management Engineering Proposal Writing Project Estimation Project Management MS Project CPM Scheduling Project Coordination Process Scheduler Project Engineering Project Planning Contract Management Procurement Engineering Management Commissioning Power Generation Cost Control Nuclear Microsoft Project See 8+     See less Skills  Construction Management Construction Project Control Primavera P6 Earned Value Management Engineering Proposal Writing Project Estimation Project Management MS Project CPM Scheduling Project Coordination Process Scheduler Project Engineering Project Planning Contract Management Procurement Engineering Management Commissioning Power Generation Cost Control Nuclear Microsoft Project See 8+     See less Construction Management Construction Project Control Primavera P6 Earned Value Management Engineering Proposal Writing Project Estimation Project Management MS Project CPM Scheduling Project Coordination Process Scheduler Project Engineering Project Planning Contract Management Procurement Engineering Management Commissioning Power Generation Cost Control Nuclear Microsoft Project See 8+     See less Construction Management Construction Project Control Primavera P6 Earned Value Management Engineering Proposal Writing Project Estimation Project Management MS Project CPM Scheduling Project Coordination Process Scheduler Project Engineering Project Planning Contract Management Procurement Engineering Management Commissioning Power Generation Cost Control Nuclear Microsoft Project See 8+     See less Education Virginia Polytechnic Institute and State University MSCE,  Civil Engineering Construction Engineering & Management 1993  – 1995 Virginia Polytechnic Institute and State University BSCE, Civil Engineering 1988  – 1993 Virginia Polytechnic Institute and State University MSCE,  Civil Engineering Construction Engineering & Management 1993  – 1995 Virginia Polytechnic Institute and State University MSCE,  Civil Engineering Construction Engineering & Management 1993  – 1995 Virginia Polytechnic Institute and State University MSCE,  Civil Engineering Construction Engineering & Management 1993  – 1995 Virginia Polytechnic Institute and State University BSCE, Civil Engineering 1988  – 1993 Virginia Polytechnic Institute and State University BSCE, Civil Engineering 1988  – 1993 Virginia Polytechnic Institute and State University BSCE, Civil Engineering 1988  – 1993 ", "Summary -\tAccomplished project management professional with a solid background in design, strategic-planning, procurement, logistics, project implementation team building and collaboration. \n-\tMotivated achiever and proven bottom-line contributor with solid record of cost reductions through process redesign, savvy contract negotiation, organizational reengineering, and value engineering utilizing Lean Process Improvements. \n-\tVisionary leader and highly capable change-agent that consistently refines and revitalizes strategies and procedures, introduces innovation, change management, and facilitates solutions-driven team collaboration. \n-\tEnthusiastic problem-solver with keen ability to rapidly assess diverse situational challenges, develop action plans, and lead team to meet or exceed targeted goals. \n-\tEffective communicator and relationship-builder with superior detail orientation that gathers and imparts information effectively across all management, department, and discipline levels and engenders collaborative spirit, consistently resulting in extraordinary outcomes. \n-\tExtensive knowledge of residential and commercial architecture and construction principles and methods, including aesthetic and functional factors, planning and design principles, best known practices, current trends, regulations, standards and laws; including building codes, building permit requirements; as well as safety, access, and environmental regulations. \n-\tSuperior management methods and practices for planning, budgeting, scheduling; monitoring performance and evaluating results.  \n \n \nSpecialties:  \nLeadership and Management \nIntegrated Project Delivery \nSustainable Development \nAsset Management \nFront End Planning \nTarget Value Design \nCleanroom Construction \nResidential Construction \nConcrete Construction \nChange Control \nLean Process Implementation \nSafety and Risk Mitigation and Management \nConflict Resolution \nLogistics \nContract Management \nTeam Building \nValue Engineering \nCustomer Service Summary -\tAccomplished project management professional with a solid background in design, strategic-planning, procurement, logistics, project implementation team building and collaboration. \n-\tMotivated achiever and proven bottom-line contributor with solid record of cost reductions through process redesign, savvy contract negotiation, organizational reengineering, and value engineering utilizing Lean Process Improvements. \n-\tVisionary leader and highly capable change-agent that consistently refines and revitalizes strategies and procedures, introduces innovation, change management, and facilitates solutions-driven team collaboration. \n-\tEnthusiastic problem-solver with keen ability to rapidly assess diverse situational challenges, develop action plans, and lead team to meet or exceed targeted goals. \n-\tEffective communicator and relationship-builder with superior detail orientation that gathers and imparts information effectively across all management, department, and discipline levels and engenders collaborative spirit, consistently resulting in extraordinary outcomes. \n-\tExtensive knowledge of residential and commercial architecture and construction principles and methods, including aesthetic and functional factors, planning and design principles, best known practices, current trends, regulations, standards and laws; including building codes, building permit requirements; as well as safety, access, and environmental regulations. \n-\tSuperior management methods and practices for planning, budgeting, scheduling; monitoring performance and evaluating results.  \n \n \nSpecialties:  \nLeadership and Management \nIntegrated Project Delivery \nSustainable Development \nAsset Management \nFront End Planning \nTarget Value Design \nCleanroom Construction \nResidential Construction \nConcrete Construction \nChange Control \nLean Process Implementation \nSafety and Risk Mitigation and Management \nConflict Resolution \nLogistics \nContract Management \nTeam Building \nValue Engineering \nCustomer Service -\tAccomplished project management professional with a solid background in design, strategic-planning, procurement, logistics, project implementation team building and collaboration. \n-\tMotivated achiever and proven bottom-line contributor with solid record of cost reductions through process redesign, savvy contract negotiation, organizational reengineering, and value engineering utilizing Lean Process Improvements. \n-\tVisionary leader and highly capable change-agent that consistently refines and revitalizes strategies and procedures, introduces innovation, change management, and facilitates solutions-driven team collaboration. \n-\tEnthusiastic problem-solver with keen ability to rapidly assess diverse situational challenges, develop action plans, and lead team to meet or exceed targeted goals. \n-\tEffective communicator and relationship-builder with superior detail orientation that gathers and imparts information effectively across all management, department, and discipline levels and engenders collaborative spirit, consistently resulting in extraordinary outcomes. \n-\tExtensive knowledge of residential and commercial architecture and construction principles and methods, including aesthetic and functional factors, planning and design principles, best known practices, current trends, regulations, standards and laws; including building codes, building permit requirements; as well as safety, access, and environmental regulations. \n-\tSuperior management methods and practices for planning, budgeting, scheduling; monitoring performance and evaluating results.  \n \n \nSpecialties:  \nLeadership and Management \nIntegrated Project Delivery \nSustainable Development \nAsset Management \nFront End Planning \nTarget Value Design \nCleanroom Construction \nResidential Construction \nConcrete Construction \nChange Control \nLean Process Implementation \nSafety and Risk Mitigation and Management \nConflict Resolution \nLogistics \nContract Management \nTeam Building \nValue Engineering \nCustomer Service -\tAccomplished project management professional with a solid background in design, strategic-planning, procurement, logistics, project implementation team building and collaboration. \n-\tMotivated achiever and proven bottom-line contributor with solid record of cost reductions through process redesign, savvy contract negotiation, organizational reengineering, and value engineering utilizing Lean Process Improvements. \n-\tVisionary leader and highly capable change-agent that consistently refines and revitalizes strategies and procedures, introduces innovation, change management, and facilitates solutions-driven team collaboration. \n-\tEnthusiastic problem-solver with keen ability to rapidly assess diverse situational challenges, develop action plans, and lead team to meet or exceed targeted goals. \n-\tEffective communicator and relationship-builder with superior detail orientation that gathers and imparts information effectively across all management, department, and discipline levels and engenders collaborative spirit, consistently resulting in extraordinary outcomes. \n-\tExtensive knowledge of residential and commercial architecture and construction principles and methods, including aesthetic and functional factors, planning and design principles, best known practices, current trends, regulations, standards and laws; including building codes, building permit requirements; as well as safety, access, and environmental regulations. \n-\tSuperior management methods and practices for planning, budgeting, scheduling; monitoring performance and evaluating results.  \n \n \nSpecialties:  \nLeadership and Management \nIntegrated Project Delivery \nSustainable Development \nAsset Management \nFront End Planning \nTarget Value Design \nCleanroom Construction \nResidential Construction \nConcrete Construction \nChange Control \nLean Process Implementation \nSafety and Risk Mitigation and Management \nConflict Resolution \nLogistics \nContract Management \nTeam Building \nValue Engineering \nCustomer Service Experience Construction Project Manager Intel Corporation May 2012  – Present (3 years 4 months) Chandler, Arizona Responsible for driving construction projects through their full life cycle - initiation, planning, execution and closeout, while managing safety, scope, schedule, and budget objectives. Responsibilities include planning, directing, and coordinating activities; project scope, schedules, approval requirements, project budgets, quality and change controls. Develops timeline of project approval requirements. Interacts with customer staff, coordinates resources and schedule. Manages design output, design budgets, and performance management of the architectural and engineering vendors. Assures accuracy of financial forecasts with tie-in to project schedules. Manages the indirect budget, forecasts trades resources, resolves resource conflicts, and coordinates trades mobilization. Engages in incident investigation, staff safety and IP training, and project assessment. Ensures the project is completed according to project plans and budget. Manages project team resourcing and training.  \n \nKey Accomplishments: \n-\tThe CH8 Team was the recipient of the TMG Excellence Award for delivering Intel’s first ever Substrate Facility while beating very challenging affordability and schedule targets. \n-\tImplementing Intel’s first Integrated Project Delivery Team in Chandler.  \n-\tEmploying Lean Principles - Partnering with the factory, Tiffany contributed to establishing one set of training classes for both factories saving approximately 5,170 valuable labor hours annually across the Chandler campus. Tiffany implemented the LEAN Team which provides collaboration with trade partners, designers, EHS, and PM’s and whose goal was to find and implement lean changes across the Chandler campus. In 2014, this team has generated a total of 237 ideas and implemented a total of 144 on the Chandler campus.  \n-\tTiffany took on the challenge of obtaining LEED Gold certification which was achieved for the CH8 Chandler Facility at no additional cost. The original goal was to achieve LEED Silver. Project Manager Platinum Homes, Inc. October 2007  –  May 2012  (4 years 8 months) Plan, organize & manage the overall design and construction process of luxury custom homes. Responsibilities include design & blue print review, project estimating, contract negotiations, material purchasing, project budget, building code compliance, and project development. \n \nAlso responsible for coordinating trades, developing partnerships, and building positive rapport with architects, engineers, local officials, vendors and clients all while maintaining costs per the budget. Versed in value engineering, document preparation and city submittals, building code and regulations, QAQC, and interior design/selection handling and detailing. Designer Tompkins Architecture January 2007  –  October 2007  (10 months) • Planned, analysis and design of custom residential and commercial properties. \n• Expertise included architectural area planning, drafting, and building technologies. \n• Collaborated with contractors to ensure adherence to specifications.  \n• Anticipated and managed inherent and unforeseen issues to reduce risks. \n• Developed presentations utilizing 3-dimensional CAD software. \n• Created perspectives and renderings of commercial and residential projects. \n• Coordinated mailings and managed documents for all project phases. Structural Design Intern and Drafter TOR Engineering July 2006  –  March 2007  (9 months) • Creation of Construction Documents for city submittals \n• Drafting of complex drawings and details \n• Assisted engineers and evaluated shop drawings \n• Evaluated existing documents and executed structural engineering computations. Networking Solutions Program Manager Gateway January 2004  –  March 2005  (1 year 3 months) Greater San Diego Area Responsible for leading training sessions and sales sessions to customers that had a desire for whole house networking solutions. Managed the customer database. Managed customer feedback and progression of new solutions to meet customer's needs. Construction Project Manager Intel Corporation May 2012  – Present (3 years 4 months) Chandler, Arizona Responsible for driving construction projects through their full life cycle - initiation, planning, execution and closeout, while managing safety, scope, schedule, and budget objectives. Responsibilities include planning, directing, and coordinating activities; project scope, schedules, approval requirements, project budgets, quality and change controls. Develops timeline of project approval requirements. Interacts with customer staff, coordinates resources and schedule. Manages design output, design budgets, and performance management of the architectural and engineering vendors. Assures accuracy of financial forecasts with tie-in to project schedules. Manages the indirect budget, forecasts trades resources, resolves resource conflicts, and coordinates trades mobilization. Engages in incident investigation, staff safety and IP training, and project assessment. Ensures the project is completed according to project plans and budget. Manages project team resourcing and training.  \n \nKey Accomplishments: \n-\tThe CH8 Team was the recipient of the TMG Excellence Award for delivering Intel’s first ever Substrate Facility while beating very challenging affordability and schedule targets. \n-\tImplementing Intel’s first Integrated Project Delivery Team in Chandler.  \n-\tEmploying Lean Principles - Partnering with the factory, Tiffany contributed to establishing one set of training classes for both factories saving approximately 5,170 valuable labor hours annually across the Chandler campus. Tiffany implemented the LEAN Team which provides collaboration with trade partners, designers, EHS, and PM’s and whose goal was to find and implement lean changes across the Chandler campus. In 2014, this team has generated a total of 237 ideas and implemented a total of 144 on the Chandler campus.  \n-\tTiffany took on the challenge of obtaining LEED Gold certification which was achieved for the CH8 Chandler Facility at no additional cost. The original goal was to achieve LEED Silver. Construction Project Manager Intel Corporation May 2012  – Present (3 years 4 months) Chandler, Arizona Responsible for driving construction projects through their full life cycle - initiation, planning, execution and closeout, while managing safety, scope, schedule, and budget objectives. Responsibilities include planning, directing, and coordinating activities; project scope, schedules, approval requirements, project budgets, quality and change controls. Develops timeline of project approval requirements. Interacts with customer staff, coordinates resources and schedule. Manages design output, design budgets, and performance management of the architectural and engineering vendors. Assures accuracy of financial forecasts with tie-in to project schedules. Manages the indirect budget, forecasts trades resources, resolves resource conflicts, and coordinates trades mobilization. Engages in incident investigation, staff safety and IP training, and project assessment. Ensures the project is completed according to project plans and budget. Manages project team resourcing and training.  \n \nKey Accomplishments: \n-\tThe CH8 Team was the recipient of the TMG Excellence Award for delivering Intel’s first ever Substrate Facility while beating very challenging affordability and schedule targets. \n-\tImplementing Intel’s first Integrated Project Delivery Team in Chandler.  \n-\tEmploying Lean Principles - Partnering with the factory, Tiffany contributed to establishing one set of training classes for both factories saving approximately 5,170 valuable labor hours annually across the Chandler campus. Tiffany implemented the LEAN Team which provides collaboration with trade partners, designers, EHS, and PM’s and whose goal was to find and implement lean changes across the Chandler campus. In 2014, this team has generated a total of 237 ideas and implemented a total of 144 on the Chandler campus.  \n-\tTiffany took on the challenge of obtaining LEED Gold certification which was achieved for the CH8 Chandler Facility at no additional cost. The original goal was to achieve LEED Silver. Project Manager Platinum Homes, Inc. October 2007  –  May 2012  (4 years 8 months) Plan, organize & manage the overall design and construction process of luxury custom homes. Responsibilities include design & blue print review, project estimating, contract negotiations, material purchasing, project budget, building code compliance, and project development. \n \nAlso responsible for coordinating trades, developing partnerships, and building positive rapport with architects, engineers, local officials, vendors and clients all while maintaining costs per the budget. Versed in value engineering, document preparation and city submittals, building code and regulations, QAQC, and interior design/selection handling and detailing. Project Manager Platinum Homes, Inc. October 2007  –  May 2012  (4 years 8 months) Plan, organize & manage the overall design and construction process of luxury custom homes. Responsibilities include design & blue print review, project estimating, contract negotiations, material purchasing, project budget, building code compliance, and project development. \n \nAlso responsible for coordinating trades, developing partnerships, and building positive rapport with architects, engineers, local officials, vendors and clients all while maintaining costs per the budget. Versed in value engineering, document preparation and city submittals, building code and regulations, QAQC, and interior design/selection handling and detailing. Designer Tompkins Architecture January 2007  –  October 2007  (10 months) • Planned, analysis and design of custom residential and commercial properties. \n• Expertise included architectural area planning, drafting, and building technologies. \n• Collaborated with contractors to ensure adherence to specifications.  \n• Anticipated and managed inherent and unforeseen issues to reduce risks. \n• Developed presentations utilizing 3-dimensional CAD software. \n• Created perspectives and renderings of commercial and residential projects. \n• Coordinated mailings and managed documents for all project phases. Designer Tompkins Architecture January 2007  –  October 2007  (10 months) • Planned, analysis and design of custom residential and commercial properties. \n• Expertise included architectural area planning, drafting, and building technologies. \n• Collaborated with contractors to ensure adherence to specifications.  \n• Anticipated and managed inherent and unforeseen issues to reduce risks. \n• Developed presentations utilizing 3-dimensional CAD software. \n• Created perspectives and renderings of commercial and residential projects. \n• Coordinated mailings and managed documents for all project phases. Structural Design Intern and Drafter TOR Engineering July 2006  –  March 2007  (9 months) • Creation of Construction Documents for city submittals \n• Drafting of complex drawings and details \n• Assisted engineers and evaluated shop drawings \n• Evaluated existing documents and executed structural engineering computations. Structural Design Intern and Drafter TOR Engineering July 2006  –  March 2007  (9 months) • Creation of Construction Documents for city submittals \n• Drafting of complex drawings and details \n• Assisted engineers and evaluated shop drawings \n• Evaluated existing documents and executed structural engineering computations. Networking Solutions Program Manager Gateway January 2004  –  March 2005  (1 year 3 months) Greater San Diego Area Responsible for leading training sessions and sales sessions to customers that had a desire for whole house networking solutions. Managed the customer database. Managed customer feedback and progression of new solutions to meet customer's needs. Networking Solutions Program Manager Gateway January 2004  –  March 2005  (1 year 3 months) Greater San Diego Area Responsible for leading training sessions and sales sessions to customers that had a desire for whole house networking solutions. Managed the customer database. Managed customer feedback and progression of new solutions to meet customer's needs. Languages   Skills Integrated Project... Last Planner Target Value Design Contract Negotiation Construction Project Planning Process Scheduler Value Engineering Team Building Contractors Budgets Construction Management Customer Service Purchasing Architecture Negotiation Project Management Renovation Sales Submittals Project Estimation Management Green Building Design Research CAD Architectural Drawings Contract Management Strategic Planning LEED AP Project Bidding Interior Design LEED Troubleshooting Social Media Marketing Construction Drawings Residential Homes Leadership MS Project Change Orders Rendering Scheduling Quality Management Operations Management PMP Design-Build Analysis Tenant Improvement Estimating Client Relationship... Budget Management See 35+     See less Skills  Integrated Project... Last Planner Target Value Design Contract Negotiation Construction Project Planning Process Scheduler Value Engineering Team Building Contractors Budgets Construction Management Customer Service Purchasing Architecture Negotiation Project Management Renovation Sales Submittals Project Estimation Management Green Building Design Research CAD Architectural Drawings Contract Management Strategic Planning LEED AP Project Bidding Interior Design LEED Troubleshooting Social Media Marketing Construction Drawings Residential Homes Leadership MS Project Change Orders Rendering Scheduling Quality Management Operations Management PMP Design-Build Analysis Tenant Improvement Estimating Client Relationship... Budget Management See 35+     See less Integrated Project... Last Planner Target Value Design Contract Negotiation Construction Project Planning Process Scheduler Value Engineering Team Building Contractors Budgets Construction Management Customer Service Purchasing Architecture Negotiation Project Management Renovation Sales Submittals Project Estimation Management Green Building Design Research CAD Architectural Drawings Contract Management Strategic Planning LEED AP Project Bidding Interior Design LEED Troubleshooting Social Media Marketing Construction Drawings Residential Homes Leadership MS Project Change Orders Rendering Scheduling Quality Management Operations Management PMP Design-Build Analysis Tenant Improvement Estimating Client Relationship... Budget Management See 35+     See less Integrated Project... Last Planner Target Value Design Contract Negotiation Construction Project Planning Process Scheduler Value Engineering Team Building Contractors Budgets Construction Management Customer Service Purchasing Architecture Negotiation Project Management Renovation Sales Submittals Project Estimation Management Green Building Design Research CAD Architectural Drawings Contract Management Strategic Planning LEED AP Project Bidding Interior Design LEED Troubleshooting Social Media Marketing Construction Drawings Residential Homes Leadership MS Project Change Orders Rendering Scheduling Quality Management Operations Management PMP Design-Build Analysis Tenant Improvement Estimating Client Relationship... Budget Management See 35+     See less Honors & Awards ", "Summary I'm a passionate problem solver with emphasis in software and technology. \n \nFrom an early age, I've been working on solving problems for others. I worked on bikes for the neighborhood kids to fix problems ranging from flat tires to gears. While working on my bachelor's degree at St Martin's, I noticed that they didn't have someone to maintain the computers in the computer lab. So I offered to be their computer lab support and in exchange they covered the cost of one of my classes each semester. They agreed and helped pay for my bachelor's degree. \n \nGoing through college, I am among a select few who can claim that I did it without grants, loans, or  \nhelp from my parents. I was with the US Army for 12 years and used my GI Bill to pay for my Bachelor's degree. While I worked for Intel, they covered the cost of my MBA. I worked and used the resources available to cover my college expenses. Hence, I graduated with both my Bachelors and my Masters degree completely debt free. \n \nWith Intel, this has transferred over and I've worked to solve the problems that both Intel has and their customers. I've worked as technical support for large customers and internally, helped to save Intel $10M by implementing a program in the factory to reuse items in the construction process. As a PMP-certified project manager with over 10 years of experience, I've worked on budgets to stay within the defined amounts while meeting the project schedule. \n \nI love being creative and coming up with alternative solutions to complex problems. So send me a message and we can talk about how I can help you. \n \nSpecialties: Problem solving, business development, software development lifecycle (waterfall), software project management, firmware, and project management. Summary I'm a passionate problem solver with emphasis in software and technology. \n \nFrom an early age, I've been working on solving problems for others. I worked on bikes for the neighborhood kids to fix problems ranging from flat tires to gears. While working on my bachelor's degree at St Martin's, I noticed that they didn't have someone to maintain the computers in the computer lab. So I offered to be their computer lab support and in exchange they covered the cost of one of my classes each semester. They agreed and helped pay for my bachelor's degree. \n \nGoing through college, I am among a select few who can claim that I did it without grants, loans, or  \nhelp from my parents. I was with the US Army for 12 years and used my GI Bill to pay for my Bachelor's degree. While I worked for Intel, they covered the cost of my MBA. I worked and used the resources available to cover my college expenses. Hence, I graduated with both my Bachelors and my Masters degree completely debt free. \n \nWith Intel, this has transferred over and I've worked to solve the problems that both Intel has and their customers. I've worked as technical support for large customers and internally, helped to save Intel $10M by implementing a program in the factory to reuse items in the construction process. As a PMP-certified project manager with over 10 years of experience, I've worked on budgets to stay within the defined amounts while meeting the project schedule. \n \nI love being creative and coming up with alternative solutions to complex problems. So send me a message and we can talk about how I can help you. \n \nSpecialties: Problem solving, business development, software development lifecycle (waterfall), software project management, firmware, and project management. I'm a passionate problem solver with emphasis in software and technology. \n \nFrom an early age, I've been working on solving problems for others. I worked on bikes for the neighborhood kids to fix problems ranging from flat tires to gears. While working on my bachelor's degree at St Martin's, I noticed that they didn't have someone to maintain the computers in the computer lab. So I offered to be their computer lab support and in exchange they covered the cost of one of my classes each semester. They agreed and helped pay for my bachelor's degree. \n \nGoing through college, I am among a select few who can claim that I did it without grants, loans, or  \nhelp from my parents. I was with the US Army for 12 years and used my GI Bill to pay for my Bachelor's degree. While I worked for Intel, they covered the cost of my MBA. I worked and used the resources available to cover my college expenses. Hence, I graduated with both my Bachelors and my Masters degree completely debt free. \n \nWith Intel, this has transferred over and I've worked to solve the problems that both Intel has and their customers. I've worked as technical support for large customers and internally, helped to save Intel $10M by implementing a program in the factory to reuse items in the construction process. As a PMP-certified project manager with over 10 years of experience, I've worked on budgets to stay within the defined amounts while meeting the project schedule. \n \nI love being creative and coming up with alternative solutions to complex problems. So send me a message and we can talk about how I can help you. \n \nSpecialties: Problem solving, business development, software development lifecycle (waterfall), software project management, firmware, and project management. I'm a passionate problem solver with emphasis in software and technology. \n \nFrom an early age, I've been working on solving problems for others. I worked on bikes for the neighborhood kids to fix problems ranging from flat tires to gears. While working on my bachelor's degree at St Martin's, I noticed that they didn't have someone to maintain the computers in the computer lab. So I offered to be their computer lab support and in exchange they covered the cost of one of my classes each semester. They agreed and helped pay for my bachelor's degree. \n \nGoing through college, I am among a select few who can claim that I did it without grants, loans, or  \nhelp from my parents. I was with the US Army for 12 years and used my GI Bill to pay for my Bachelor's degree. While I worked for Intel, they covered the cost of my MBA. I worked and used the resources available to cover my college expenses. Hence, I graduated with both my Bachelors and my Masters degree completely debt free. \n \nWith Intel, this has transferred over and I've worked to solve the problems that both Intel has and their customers. I've worked as technical support for large customers and internally, helped to save Intel $10M by implementing a program in the factory to reuse items in the construction process. As a PMP-certified project manager with over 10 years of experience, I've worked on budgets to stay within the defined amounts while meeting the project schedule. \n \nI love being creative and coming up with alternative solutions to complex problems. So send me a message and we can talk about how I can help you. \n \nSpecialties: Problem solving, business development, software development lifecycle (waterfall), software project management, firmware, and project management. Experience Finance Program Director American Express Global Business Travel October 2014  – Present (11 months) Phoenix, Arizona Area Finance Program Director American Express Global Business Travel October 2014  – Present (11 months) Phoenix, Arizona Area Finance Program Director American Express Global Business Travel October 2014  – Present (11 months) Phoenix, Arizona Area Languages Spanish Spanish Spanish Skills Embedded Systems Software Project... Intel Device Drivers Embedded Software SDLC Testing Firmware Program Management Process Improvement Product Management Product Development Debugging Semiconductors Software Engineering Semiconductor Industry Construction Management Manufacturing Computer Architecture Cross-functional Team... See 5+     See less Skills  Embedded Systems Software Project... Intel Device Drivers Embedded Software SDLC Testing Firmware Program Management Process Improvement Product Management Product Development Debugging Semiconductors Software Engineering Semiconductor Industry Construction Management Manufacturing Computer Architecture Cross-functional Team... See 5+     See less Embedded Systems Software Project... Intel Device Drivers Embedded Software SDLC Testing Firmware Program Management Process Improvement Product Management Product Development Debugging Semiconductors Software Engineering Semiconductor Industry Construction Management Manufacturing Computer Architecture Cross-functional Team... See 5+     See less Embedded Systems Software Project... Intel Device Drivers Embedded Software SDLC Testing Firmware Program Management Process Improvement Product Management Product Development Debugging Semiconductors Software Engineering Semiconductor Industry Construction Management Manufacturing Computer Architecture Cross-functional Team... See 5+     See less Education University of Phoenix M.B.A.,  Technology Management 2003  – 2005 Earned MBA in technology management Saint Martin's University B.S.,  Computer Science 1998  – 2000 Earned Bachelor of Science in Computer Science Ventura College Associates,  liberal arts 1989  – 1991 University of Phoenix M.B.A.,  Technology Management 2003  – 2005 Earned MBA in technology management University of Phoenix M.B.A.,  Technology Management 2003  – 2005 Earned MBA in technology management University of Phoenix M.B.A.,  Technology Management 2003  – 2005 Earned MBA in technology management Saint Martin's University B.S.,  Computer Science 1998  – 2000 Earned Bachelor of Science in Computer Science Saint Martin's University B.S.,  Computer Science 1998  – 2000 Earned Bachelor of Science in Computer Science Saint Martin's University B.S.,  Computer Science 1998  – 2000 Earned Bachelor of Science in Computer Science Ventura College Associates,  liberal arts 1989  – 1991 Ventura College Associates,  liberal arts 1989  – 1991 Ventura College Associates,  liberal arts 1989  – 1991 Honors & Awards Army Achievement Medal US Army December 1994 The Achievement Medal is awarded for outstanding achievement or meritorious service while working as an artillery cannoneer with 2/8 Field Artillery. Division Recognition Award Intel Corporation June 2010 The Division Recognition Award is awarded to people who have had a financial and/or process impact at the division level. This award was given for delivering a project with a 95% user satisfaction, 3 weeks ahead of schedule, and a headcount savings of 10 people. Army Achievement Medal US Army December 1994 The Achievement Medal is awarded for outstanding achievement or meritorious service while working as an artillery cannoneer with 2/8 Field Artillery. Army Achievement Medal US Army December 1994 The Achievement Medal is awarded for outstanding achievement or meritorious service while working as an artillery cannoneer with 2/8 Field Artillery. Army Achievement Medal US Army December 1994 The Achievement Medal is awarded for outstanding achievement or meritorious service while working as an artillery cannoneer with 2/8 Field Artillery. Division Recognition Award Intel Corporation June 2010 The Division Recognition Award is awarded to people who have had a financial and/or process impact at the division level. This award was given for delivering a project with a 95% user satisfaction, 3 weeks ahead of schedule, and a headcount savings of 10 people. Division Recognition Award Intel Corporation June 2010 The Division Recognition Award is awarded to people who have had a financial and/or process impact at the division level. This award was given for delivering a project with a 95% user satisfaction, 3 weeks ahead of schedule, and a headcount savings of 10 people. Division Recognition Award Intel Corporation June 2010 The Division Recognition Award is awarded to people who have had a financial and/or process impact at the division level. This award was given for delivering a project with a 95% user satisfaction, 3 weeks ahead of schedule, and a headcount savings of 10 people. ", "Experience Sr. Construction Project Manager Intel Corporation Sr. Construction Project Manager Intel Corporation Sr. Construction Project Manager Intel Corporation ", "Experience Construction Project Manager Intel Corporation June 2013  – Present (2 years 3 months) Phoenix, Arizona Area Engineering Estimator Foresight Technologies May 2012  –  May 2013  (1 year 1 month) Tempe, Arizona Sale Assistant Huu Thuan Company January 2005  –  August 2006  (1 year 8 months) District 3, Ho Chi Minh City, Viet Nam Construction Project Manager Intel Corporation June 2013  – Present (2 years 3 months) Phoenix, Arizona Area Construction Project Manager Intel Corporation June 2013  – Present (2 years 3 months) Phoenix, Arizona Area Engineering Estimator Foresight Technologies May 2012  –  May 2013  (1 year 1 month) Tempe, Arizona Engineering Estimator Foresight Technologies May 2012  –  May 2013  (1 year 1 month) Tempe, Arizona Sale Assistant Huu Thuan Company January 2005  –  August 2006  (1 year 8 months) District 3, Ho Chi Minh City, Viet Nam Sale Assistant Huu Thuan Company January 2005  –  August 2006  (1 year 8 months) District 3, Ho Chi Minh City, Viet Nam Languages   Skills Skills     Education Arizona State University Bachelor of Science (BS),  Mechanical Engineering Technologies in Aeronautical 2009  – 2014 Phoenix College Associate of Science (A.S.),  Engineering 2007  – 2009 Arizona State University Bachelor of Science (BS),  Mechanical Engineering Technologies in Aeronautical 2009  – 2014 Arizona State University Bachelor of Science (BS),  Mechanical Engineering Technologies in Aeronautical 2009  – 2014 Arizona State University Bachelor of Science (BS),  Mechanical Engineering Technologies in Aeronautical 2009  – 2014 Phoenix College Associate of Science (A.S.),  Engineering 2007  – 2009 Phoenix College Associate of Science (A.S.),  Engineering 2007  – 2009 Phoenix College Associate of Science (A.S.),  Engineering 2007  – 2009 Honors & Awards ", "Summary Specialties:Engineering Management, Systems and Industrial Engineering Summary Specialties:Engineering Management, Systems and Industrial Engineering Specialties:Engineering Management, Systems and Industrial Engineering Specialties:Engineering Management, Systems and Industrial Engineering Experience Construction Project Manager Intel Corporation Tool Install Engineer Kraemer Design Services February 2011  –  March 2013  (2 years 2 months) Chandler, Arizona System Engineer Intern Qwest Communications May 2009  –  August 2010  (1 year 4 months) Greater Denver Area • Utilized technical skills to design the ordering, provisioning, and billing system infrastructure for a 3-million dollar project \n• Worked directly with third-party vendors and led efforts with director, clients, and team members to obtain project feedback \n• Directed a 4.6 million dollar project, primarily defining Microsoft Migration for over 2.2 million customers and customer re-instates for a high priority program \n• Led large groups of IT, business, and third-party vendors to drive the project forward with tight timelines \n• Based on the Qwest System Development process, developed solutions to project concerns and documented them by through use cases, logical diagrams, vision documents, sequence diagrams and various other requirement means \n• Worked on Joint Implementation Agreements with third-party vendor \n Construction Project Manager Intel Corporation Construction Project Manager Intel Corporation Tool Install Engineer Kraemer Design Services February 2011  –  March 2013  (2 years 2 months) Chandler, Arizona Tool Install Engineer Kraemer Design Services February 2011  –  March 2013  (2 years 2 months) Chandler, Arizona System Engineer Intern Qwest Communications May 2009  –  August 2010  (1 year 4 months) Greater Denver Area • Utilized technical skills to design the ordering, provisioning, and billing system infrastructure for a 3-million dollar project \n• Worked directly with third-party vendors and led efforts with director, clients, and team members to obtain project feedback \n• Directed a 4.6 million dollar project, primarily defining Microsoft Migration for over 2.2 million customers and customer re-instates for a high priority program \n• Led large groups of IT, business, and third-party vendors to drive the project forward with tight timelines \n• Based on the Qwest System Development process, developed solutions to project concerns and documented them by through use cases, logical diagrams, vision documents, sequence diagrams and various other requirement means \n• Worked on Joint Implementation Agreements with third-party vendor \n System Engineer Intern Qwest Communications May 2009  –  August 2010  (1 year 4 months) Greater Denver Area • Utilized technical skills to design the ordering, provisioning, and billing system infrastructure for a 3-million dollar project \n• Worked directly with third-party vendors and led efforts with director, clients, and team members to obtain project feedback \n• Directed a 4.6 million dollar project, primarily defining Microsoft Migration for over 2.2 million customers and customer re-instates for a high priority program \n• Led large groups of IT, business, and third-party vendors to drive the project forward with tight timelines \n• Based on the Qwest System Development process, developed solutions to project concerns and documented them by through use cases, logical diagrams, vision documents, sequence diagrams and various other requirement means \n• Worked on Joint Implementation Agreements with third-party vendor \n Languages   Skills Construction Project Management Microsoft Office Engineering Microsoft Excel MS Project Visio PowerPoint Program Management Process Engineering Matlab AutoCAD Leadership Engineering Management Management Team Leadership Project Planning Integration Vendor Management Team Building Integrated Project... BIM Lean Six Sigma Java Microsoft Project See 10+     See less Skills  Construction Project Management Microsoft Office Engineering Microsoft Excel MS Project Visio PowerPoint Program Management Process Engineering Matlab AutoCAD Leadership Engineering Management Management Team Leadership Project Planning Integration Vendor Management Team Building Integrated Project... BIM Lean Six Sigma Java Microsoft Project See 10+     See less Construction Project Management Microsoft Office Engineering Microsoft Excel MS Project Visio PowerPoint Program Management Process Engineering Matlab AutoCAD Leadership Engineering Management Management Team Leadership Project Planning Integration Vendor Management Team Building Integrated Project... BIM Lean Six Sigma Java Microsoft Project See 10+     See less Construction Project Management Microsoft Office Engineering Microsoft Excel MS Project Visio PowerPoint Program Management Process Engineering Matlab AutoCAD Leadership Engineering Management Management Team Leadership Project Planning Integration Vendor Management Team Building Integrated Project... BIM Lean Six Sigma Java Microsoft Project See 10+     See less Education Clemson University Master of Engineering (MEng),  Industrial Engineering 2014  – 2017 University of Arizona Engineering Management,  Systems and Industrial Engineering 2007  – 2011 Activities and Societies:  American Society for Engineering Management ,  Kappa Alpha Theta Clemson University Master of Engineering (MEng),  Industrial Engineering 2014  – 2017 Clemson University Master of Engineering (MEng),  Industrial Engineering 2014  – 2017 Clemson University Master of Engineering (MEng),  Industrial Engineering 2014  – 2017 University of Arizona Engineering Management,  Systems and Industrial Engineering 2007  – 2011 Activities and Societies:  American Society for Engineering Management ,  Kappa Alpha Theta University of Arizona Engineering Management,  Systems and Industrial Engineering 2007  – 2011 Activities and Societies:  American Society for Engineering Management ,  Kappa Alpha Theta University of Arizona Engineering Management,  Systems and Industrial Engineering 2007  – 2011 Activities and Societies:  American Society for Engineering Management ,  Kappa Alpha Theta Honors & Awards ", "Skills Program Management People Manager Asbestos PMP Management Process Engineering Engineering Management Manufacturing Semiconductors Process Improvement Engineering Procurement Project Management Lean Manufacturing Electricians Electronics Wireless Vendor Management Contract Negotiation Construction Data Center Energy MS Project Leadership SPC Electrical Engineering Root Cause Analysis Budgets Logistics Process Simulation Integration Troubleshooting Quality Assurance Contract Management Six Sigma Inspection Operations Management Product Management Project Planning Quality Management Cross-functional Team... Facilities Management Supply Chain Management Team Leadership Continuous Improvement Testing Team Building Product Development Strategic Planning Materials See 35+     See less Skills  Program Management People Manager Asbestos PMP Management Process Engineering Engineering Management Manufacturing Semiconductors Process Improvement Engineering Procurement Project Management Lean Manufacturing Electricians Electronics Wireless Vendor Management Contract Negotiation Construction Data Center Energy MS Project Leadership SPC Electrical Engineering Root Cause Analysis Budgets Logistics Process Simulation Integration Troubleshooting Quality Assurance Contract Management Six Sigma Inspection Operations Management Product Management Project Planning Quality Management Cross-functional Team... Facilities Management Supply Chain Management Team Leadership Continuous Improvement Testing Team Building Product Development Strategic Planning Materials See 35+     See less Program Management People Manager Asbestos PMP Management Process Engineering Engineering Management Manufacturing Semiconductors Process Improvement Engineering Procurement Project Management Lean Manufacturing Electricians Electronics Wireless Vendor Management Contract Negotiation Construction Data Center Energy MS Project Leadership SPC Electrical Engineering Root Cause Analysis Budgets Logistics Process Simulation Integration Troubleshooting Quality Assurance Contract Management Six Sigma Inspection Operations Management Product Management Project Planning Quality Management Cross-functional Team... Facilities Management Supply Chain Management Team Leadership Continuous Improvement Testing Team Building Product Development Strategic Planning Materials See 35+     See less Program Management People Manager Asbestos PMP Management Process Engineering Engineering Management Manufacturing Semiconductors Process Improvement Engineering Procurement Project Management Lean Manufacturing Electricians Electronics Wireless Vendor Management Contract Negotiation Construction Data Center Energy MS Project Leadership SPC Electrical Engineering Root Cause Analysis Budgets Logistics Process Simulation Integration Troubleshooting Quality Assurance Contract Management Six Sigma Inspection Operations Management Product Management Project Planning Quality Management Cross-functional Team... Facilities Management Supply Chain Management Team Leadership Continuous Improvement Testing Team Building Product Development Strategic Planning Materials See 35+     See less ", "Summary A highly talented and result orientated project management executive with expertise in planning, directing and coordinating activities pertaining to building and facilities construction projects as well as the development of project scope, contracting strategy, schedules, resources, budgets, quality plans and change controls management taking into account project approval timeline requirements. Skilled strategist who transforms strategic plans into workable solutions. Ability to work under pressure and posses excellent communication skill. Summary A highly talented and result orientated project management executive with expertise in planning, directing and coordinating activities pertaining to building and facilities construction projects as well as the development of project scope, contracting strategy, schedules, resources, budgets, quality plans and change controls management taking into account project approval timeline requirements. Skilled strategist who transforms strategic plans into workable solutions. Ability to work under pressure and posses excellent communication skill. A highly talented and result orientated project management executive with expertise in planning, directing and coordinating activities pertaining to building and facilities construction projects as well as the development of project scope, contracting strategy, schedules, resources, budgets, quality plans and change controls management taking into account project approval timeline requirements. Skilled strategist who transforms strategic plans into workable solutions. Ability to work under pressure and posses excellent communication skill. A highly talented and result orientated project management executive with expertise in planning, directing and coordinating activities pertaining to building and facilities construction projects as well as the development of project scope, contracting strategy, schedules, resources, budgets, quality plans and change controls management taking into account project approval timeline requirements. Skilled strategist who transforms strategic plans into workable solutions. Ability to work under pressure and posses excellent communication skill. Experience Construction Project Manager Intel Corporation April 2010  – Present (5 years 5 months) Kedah, Malaysia Plan, organize and manage the overall Tool Install (TI) and Progressive Build (PB) projects for Intel Kulim Microprocessor Organization (KMO). Responsible for all project management deliverables including but not be limited to development of scope of work documents, project schedules, initiation and approval of change orders, cost evaluation and participating in development of contracting strategies to safeguard the interest of the company. \nManage facility upgrade projects related to Mechanical and Electrical system. Manage and coordinate A/E, General Contractor and Quality Assurance and/or Quality Control \npersonnel in support of project delivery and execution.Interface with primary project stakeholders including but not be limited to: manufacturing personnel, facility engineering and facility operations personnel and industrial engineers specializing in production space requirements' to ensure facility construction parameters and designs meet all requirements. Production Engineer Samsung Electronics June 2009  –  March 2010  (10 months) Negeri Sembilan, Malaysia Junior Engineer at Printed Circuit Board (PCB) Department and Section Head for PQE (Process Quality Engineering) team. Responsible to improve the process quality at PCB department and delivered various projects to reduce defects leak out to the field/market.In-charge for 2010 Production Strategy Plan Project and responsible for the CAPA Simulation, Layout Design, Line of Balancing (LOB) and On Time Production (OTP). Construction Project Manager Intel Corporation April 2010  – Present (5 years 5 months) Kedah, Malaysia Plan, organize and manage the overall Tool Install (TI) and Progressive Build (PB) projects for Intel Kulim Microprocessor Organization (KMO). Responsible for all project management deliverables including but not be limited to development of scope of work documents, project schedules, initiation and approval of change orders, cost evaluation and participating in development of contracting strategies to safeguard the interest of the company. \nManage facility upgrade projects related to Mechanical and Electrical system. Manage and coordinate A/E, General Contractor and Quality Assurance and/or Quality Control \npersonnel in support of project delivery and execution.Interface with primary project stakeholders including but not be limited to: manufacturing personnel, facility engineering and facility operations personnel and industrial engineers specializing in production space requirements' to ensure facility construction parameters and designs meet all requirements. Construction Project Manager Intel Corporation April 2010  – Present (5 years 5 months) Kedah, Malaysia Plan, organize and manage the overall Tool Install (TI) and Progressive Build (PB) projects for Intel Kulim Microprocessor Organization (KMO). Responsible for all project management deliverables including but not be limited to development of scope of work documents, project schedules, initiation and approval of change orders, cost evaluation and participating in development of contracting strategies to safeguard the interest of the company. \nManage facility upgrade projects related to Mechanical and Electrical system. Manage and coordinate A/E, General Contractor and Quality Assurance and/or Quality Control \npersonnel in support of project delivery and execution.Interface with primary project stakeholders including but not be limited to: manufacturing personnel, facility engineering and facility operations personnel and industrial engineers specializing in production space requirements' to ensure facility construction parameters and designs meet all requirements. Production Engineer Samsung Electronics June 2009  –  March 2010  (10 months) Negeri Sembilan, Malaysia Junior Engineer at Printed Circuit Board (PCB) Department and Section Head for PQE (Process Quality Engineering) team. Responsible to improve the process quality at PCB department and delivered various projects to reduce defects leak out to the field/market.In-charge for 2010 Production Strategy Plan Project and responsible for the CAPA Simulation, Layout Design, Line of Balancing (LOB) and On Time Production (OTP). Production Engineer Samsung Electronics June 2009  –  March 2010  (10 months) Negeri Sembilan, Malaysia Junior Engineer at Printed Circuit Board (PCB) Department and Section Head for PQE (Process Quality Engineering) team. Responsible to improve the process quality at PCB department and delivered various projects to reduce defects leak out to the field/market.In-charge for 2010 Production Strategy Plan Project and responsible for the CAPA Simulation, Layout Design, Line of Balancing (LOB) and On Time Production (OTP). Languages English Malay Tamil English Malay Tamil English Malay Tamil Skills Project... Project Risk Management PERT/CPM Technique Multi-Site,... Cross-Functional... Negotiation,... Quality Assurance and... Microsoft Project 2007 Microsoft Office... Quality Control MS Project Cross-functional Team... Skills  Project... Project Risk Management PERT/CPM Technique Multi-Site,... Cross-Functional... Negotiation,... Quality Assurance and... Microsoft Project 2007 Microsoft Office... Quality Control MS Project Cross-functional Team... Project... Project Risk Management PERT/CPM Technique Multi-Site,... Cross-Functional... Negotiation,... Quality Assurance and... Microsoft Project 2007 Microsoft Office... Quality Control MS Project Cross-functional Team... Project... Project Risk Management PERT/CPM Technique Multi-Site,... Cross-Functional... Negotiation,... Quality Assurance and... Microsoft Project 2007 Microsoft Office... Quality Control MS Project Cross-functional Team... Education Universiti Tenaga Nasional Bachelor of Mechanical Engineering (Hons.),  Mechanical Engineering , 3.16 2004  – 2009 Activities and Societies:  Go-Kart Club ,  UNITEN Indian Cultural Society ,  Christian Fellowship Club Universiti Tenaga Nasional Bachelor of Mechanical Engineering (Hons.),  Mechanical Engineering , 3.16 2004  – 2009 Activities and Societies:  Go-Kart Club ,  UNITEN Indian Cultural Society ,  Christian Fellowship Club Universiti Tenaga Nasional Bachelor of Mechanical Engineering (Hons.),  Mechanical Engineering , 3.16 2004  – 2009 Activities and Societies:  Go-Kart Club ,  UNITEN Indian Cultural Society ,  Christian Fellowship Club Universiti Tenaga Nasional Bachelor of Mechanical Engineering (Hons.),  Mechanical Engineering , 3.16 2004  – 2009 Activities and Societies:  Go-Kart Club ,  UNITEN Indian Cultural Society ,  Christian Fellowship Club Honors & Awards Q3’12 ATCE (Assembly Test Construction Enterprise) Award Intel Corporation July 2012 For successfully delivering TI activities which enabled output max on IvyBridge product ramp for Q1’12 and Q2’12. \n Q2’12 ATCE (Assembly Test Construction Enterprise) Award Intel Corporation April 2012 For completing GPEO Phase 1 project 1week ahead of schedule through challenging the boundary conditions and win-win partnership among project stakeholders. Q2’12 ATCE (Assembly Test Construction Enterprise) Award Intel Corporation April 2012 For achieving 50% cost savings (USD170k) for MY Metrology Lab Consolidation Project through negotiation and value engineering. Q2’11 ATCE (Assembly Test Construction Enterprise) Award Intel Corporation April 2011 Recognition award for successfully completing facility upgrade for 79 EBO ovens at KMO Factory and PGAT Factory. 2010 DRA (Division Recognition Award) Intel Corporation November 2010 For successfully completing Link CS Project to develop a global program for Corporate Service division. Q3’12 ATCE (Assembly Test Construction Enterprise) Award Intel Corporation July 2012 For successfully delivering TI activities which enabled output max on IvyBridge product ramp for Q1’12 and Q2’12. \n Q3’12 ATCE (Assembly Test Construction Enterprise) Award Intel Corporation July 2012 For successfully delivering TI activities which enabled output max on IvyBridge product ramp for Q1’12 and Q2’12. \n Q3’12 ATCE (Assembly Test Construction Enterprise) Award Intel Corporation July 2012 For successfully delivering TI activities which enabled output max on IvyBridge product ramp for Q1’12 and Q2’12. \n Q2’12 ATCE (Assembly Test Construction Enterprise) Award Intel Corporation April 2012 For completing GPEO Phase 1 project 1week ahead of schedule through challenging the boundary conditions and win-win partnership among project stakeholders. Q2’12 ATCE (Assembly Test Construction Enterprise) Award Intel Corporation April 2012 For completing GPEO Phase 1 project 1week ahead of schedule through challenging the boundary conditions and win-win partnership among project stakeholders. Q2’12 ATCE (Assembly Test Construction Enterprise) Award Intel Corporation April 2012 For completing GPEO Phase 1 project 1week ahead of schedule through challenging the boundary conditions and win-win partnership among project stakeholders. Q2’12 ATCE (Assembly Test Construction Enterprise) Award Intel Corporation April 2012 For achieving 50% cost savings (USD170k) for MY Metrology Lab Consolidation Project through negotiation and value engineering. Q2’12 ATCE (Assembly Test Construction Enterprise) Award Intel Corporation April 2012 For achieving 50% cost savings (USD170k) for MY Metrology Lab Consolidation Project through negotiation and value engineering. Q2’12 ATCE (Assembly Test Construction Enterprise) Award Intel Corporation April 2012 For achieving 50% cost savings (USD170k) for MY Metrology Lab Consolidation Project through negotiation and value engineering. Q2’11 ATCE (Assembly Test Construction Enterprise) Award Intel Corporation April 2011 Recognition award for successfully completing facility upgrade for 79 EBO ovens at KMO Factory and PGAT Factory. Q2’11 ATCE (Assembly Test Construction Enterprise) Award Intel Corporation April 2011 Recognition award for successfully completing facility upgrade for 79 EBO ovens at KMO Factory and PGAT Factory. Q2’11 ATCE (Assembly Test Construction Enterprise) Award Intel Corporation April 2011 Recognition award for successfully completing facility upgrade for 79 EBO ovens at KMO Factory and PGAT Factory. 2010 DRA (Division Recognition Award) Intel Corporation November 2010 For successfully completing Link CS Project to develop a global program for Corporate Service division. 2010 DRA (Division Recognition Award) Intel Corporation November 2010 For successfully completing Link CS Project to develop a global program for Corporate Service division. 2010 DRA (Division Recognition Award) Intel Corporation November 2010 For successfully completing Link CS Project to develop a global program for Corporate Service division. ", "Experience Construction Project Manager Intel Corporation February 2010  – Present (5 years 7 months) Technician Intel Corporation January 1997  –  January 2010  (13 years 1 month) Construction Project Manager Intel Corporation February 2010  – Present (5 years 7 months) Construction Project Manager Intel Corporation February 2010  – Present (5 years 7 months) Technician Intel Corporation January 1997  –  January 2010  (13 years 1 month) Technician Intel Corporation January 1997  –  January 2010  (13 years 1 month) Skills Construction Management Contract Management Engineering Project Planning Semiconductors Construction Manufacturing Program Management Project Management Skills  Construction Management Contract Management Engineering Project Planning Semiconductors Construction Manufacturing Program Management Project Management Construction Management Contract Management Engineering Project Planning Semiconductors Construction Manufacturing Program Management Project Management Construction Management Contract Management Engineering Project Planning Semiconductors Construction Manufacturing Program Management Project Management Education Mesa Community College Associate of Arts and Sciences (A.A.S.),  Electrical/Electronics Maintenance and Repair Technology 1994  – 1998 Mesa Community College Associate of Arts and Sciences (A.A.S.),  Electrical/Electronics Maintenance and Repair Technology 1994  – 1998 Mesa Community College Associate of Arts and Sciences (A.A.S.),  Electrical/Electronics Maintenance and Repair Technology 1994  – 1998 Mesa Community College Associate of Arts and Sciences (A.A.S.),  Electrical/Electronics Maintenance and Repair Technology 1994  – 1998 ", "Experience Construction project manager Intel Corporation Construction project manager Intel Corporation Construction project manager Intel Corporation ", "Summary Under Annette Tippeconnie’s leadership, Nike’s workplace is experiencing a global transformation. As GM of Workplace Design + Connectivity for Nike WHQ GEO, she leads in a critical role to create a workplace strategy that will unleash the creativity and potential of all employees by leveraging, building on and enhancing the company’s existing assets in physical space, services and connectivity solutions to create a work environments that will propel Nike to the forefront of new ways of working.  \n \nAnnette ensures that the Nike Workplace Design + Connectivity team leverages the systems, design thinking and key partnerships across the company to drive change, strengthen global operations and accelerate progress towards Nike’s strategic business objectives. She accomplishes this by driving geography level standards to ensure design excellence and delivery of innovative solutions to meet the company’s business and employee needs.  \n \nBy leading a large cross-functional team and through strategic engagement with senior Nike leaders, Annette is expertly managing the Workplace Design + Connectivity WHQ portfolio to influence the operational and strategic direction of Nike’s real estate holdings. Previously, Annette was the Director of Americas Real Estate Development where she was responsible for managing all of Nike’s non-retail real estate across all brands within the US, Canada, Mexico, South America, Brazil and Latin America.  \n \nPrior to joining Nike, Inc., Annette held senior Real Estate positions in other Fortune 100 companies such as Microsoft and Intel, where her expertise in people and business management, design and construction management and strategic leadership have afforded her the opportunity to make significant contributions while continuing to expand her portfolio of skills. Through these experiences, Annette has honed her client relationship management and executive engagement skills, analytical problem solving in global markets and change management. Summary Under Annette Tippeconnie’s leadership, Nike’s workplace is experiencing a global transformation. As GM of Workplace Design + Connectivity for Nike WHQ GEO, she leads in a critical role to create a workplace strategy that will unleash the creativity and potential of all employees by leveraging, building on and enhancing the company’s existing assets in physical space, services and connectivity solutions to create a work environments that will propel Nike to the forefront of new ways of working.  \n \nAnnette ensures that the Nike Workplace Design + Connectivity team leverages the systems, design thinking and key partnerships across the company to drive change, strengthen global operations and accelerate progress towards Nike’s strategic business objectives. She accomplishes this by driving geography level standards to ensure design excellence and delivery of innovative solutions to meet the company’s business and employee needs.  \n \nBy leading a large cross-functional team and through strategic engagement with senior Nike leaders, Annette is expertly managing the Workplace Design + Connectivity WHQ portfolio to influence the operational and strategic direction of Nike’s real estate holdings. Previously, Annette was the Director of Americas Real Estate Development where she was responsible for managing all of Nike’s non-retail real estate across all brands within the US, Canada, Mexico, South America, Brazil and Latin America.  \n \nPrior to joining Nike, Inc., Annette held senior Real Estate positions in other Fortune 100 companies such as Microsoft and Intel, where her expertise in people and business management, design and construction management and strategic leadership have afforded her the opportunity to make significant contributions while continuing to expand her portfolio of skills. Through these experiences, Annette has honed her client relationship management and executive engagement skills, analytical problem solving in global markets and change management. Under Annette Tippeconnie’s leadership, Nike’s workplace is experiencing a global transformation. As GM of Workplace Design + Connectivity for Nike WHQ GEO, she leads in a critical role to create a workplace strategy that will unleash the creativity and potential of all employees by leveraging, building on and enhancing the company’s existing assets in physical space, services and connectivity solutions to create a work environments that will propel Nike to the forefront of new ways of working.  \n \nAnnette ensures that the Nike Workplace Design + Connectivity team leverages the systems, design thinking and key partnerships across the company to drive change, strengthen global operations and accelerate progress towards Nike’s strategic business objectives. She accomplishes this by driving geography level standards to ensure design excellence and delivery of innovative solutions to meet the company’s business and employee needs.  \n \nBy leading a large cross-functional team and through strategic engagement with senior Nike leaders, Annette is expertly managing the Workplace Design + Connectivity WHQ portfolio to influence the operational and strategic direction of Nike’s real estate holdings. Previously, Annette was the Director of Americas Real Estate Development where she was responsible for managing all of Nike’s non-retail real estate across all brands within the US, Canada, Mexico, South America, Brazil and Latin America.  \n \nPrior to joining Nike, Inc., Annette held senior Real Estate positions in other Fortune 100 companies such as Microsoft and Intel, where her expertise in people and business management, design and construction management and strategic leadership have afforded her the opportunity to make significant contributions while continuing to expand her portfolio of skills. Through these experiences, Annette has honed her client relationship management and executive engagement skills, analytical problem solving in global markets and change management. Under Annette Tippeconnie’s leadership, Nike’s workplace is experiencing a global transformation. As GM of Workplace Design + Connectivity for Nike WHQ GEO, she leads in a critical role to create a workplace strategy that will unleash the creativity and potential of all employees by leveraging, building on and enhancing the company’s existing assets in physical space, services and connectivity solutions to create a work environments that will propel Nike to the forefront of new ways of working.  \n \nAnnette ensures that the Nike Workplace Design + Connectivity team leverages the systems, design thinking and key partnerships across the company to drive change, strengthen global operations and accelerate progress towards Nike’s strategic business objectives. She accomplishes this by driving geography level standards to ensure design excellence and delivery of innovative solutions to meet the company’s business and employee needs.  \n \nBy leading a large cross-functional team and through strategic engagement with senior Nike leaders, Annette is expertly managing the Workplace Design + Connectivity WHQ portfolio to influence the operational and strategic direction of Nike’s real estate holdings. Previously, Annette was the Director of Americas Real Estate Development where she was responsible for managing all of Nike’s non-retail real estate across all brands within the US, Canada, Mexico, South America, Brazil and Latin America.  \n \nPrior to joining Nike, Inc., Annette held senior Real Estate positions in other Fortune 100 companies such as Microsoft and Intel, where her expertise in people and business management, design and construction management and strategic leadership have afforded her the opportunity to make significant contributions while continuing to expand her portfolio of skills. Through these experiences, Annette has honed her client relationship management and executive engagement skills, analytical problem solving in global markets and change management. Experience General Manager Nike World Headquarters Workplace Design + Connectivity Nike April 2014  – Present (1 year 5 months) Beaverton OR Responsible for the Business Strategy Development and Delivery of Workplace Design + Connectivity Services for Nike World Headquarters across the Workplace Design, Real Estate & Construction, and Integrated Workplace Services Functions. Director of Americas Real Estate Nike April 2013  –  April 2014  (1 year 1 month) As the Director of Americas Real Estate Development, Annette leveraged her experience in managing large Real Estate portfolios to direct all of Nike Inc's non-retail real estate across all brands within the US, Canada, Mexico, South America, Brazil and Latin America. Senior Construction Manager Intel Corporation July 2012  –  April 2013  (10 months) Portland, Oregon Area Annette led the development and delivery of Intel’s latest Fab. Through her support of that program, she was able to deliver the Fab on time, on budget and to spec by leveraging her deep experience in design and construction management Area Portfolio Manager; EMEA Projects Lead Microsoft August 2008  –  June 2012  (3 years 11 months) Ireland As an APM in Microsoft’s EMEA region, Annette demonstrated her the depth of her expert client relationship management and adaptability. In this role she managed all Real Estate and Facilities Management Services in addition to providing governance and oversight to the Design & Construction business model for all Major Construction Projects for the EMEA Region. Integrated Workplace Services Director Microsoft June 2006  –  August 2008  (2 years 3 months) Annette started her tenure with Microsoft as a Facilities and Services Group Manager, where she was responsible for Facilities Management for Microsoft World Headquarters. Annette’s strong leadership and ability to drive for results, led to a promotion to Integrated Workplace Services Director within a year. In this role, Annette led the TI Construction, Move and the Furniture lines of business for Microsoft in a center function role where she developed a new business model and support processes to support these activities at a global level. Her analytical problem solving and strategic planning led to the development of a program whose foundational elements are still used by Microsoft today. Facilities & Services Group Manager Microsoft May 2005  –  June 2006  (1 year 2 months) Various Intel Corporation January 1994  –  May 2005  (11 years 5 months) Phoenix, Arizona Area Annette’s 11 year career at Intel gave her the opportunity to grow as a competent leader and prove her ability to coordinate and manage multiple large and small facilities and construction projects. During her tenure there, she managed facility and planning organizations, demonstrated her exceptional project management skills in managing major construction projects all over the globe. Annette experienced increasingly higher level of responsibilities as her career progressed at Intel and her last role was managing the procurement contracts for the America’s Region Construction Organization. Sr Construction Project Manager Intel Corporation 2002  –  2004  (2 years) Ireland Sr Construction Project Manager Intel Corporation 1999  –  2002  (3 years) Portland, Oregon Area Civil, Structural, Architectural Project Planner/Engineer Intel Corporation 1997  –  1999  (2 years) San Jose, California Sr Facilities Planner Intel Corporation 1994  –  1997  (3 years) Albuquerque, New Mexico Area General Manager Nike World Headquarters Workplace Design + Connectivity Nike April 2014  – Present (1 year 5 months) Beaverton OR Responsible for the Business Strategy Development and Delivery of Workplace Design + Connectivity Services for Nike World Headquarters across the Workplace Design, Real Estate & Construction, and Integrated Workplace Services Functions. General Manager Nike World Headquarters Workplace Design + Connectivity Nike April 2014  – Present (1 year 5 months) Beaverton OR Responsible for the Business Strategy Development and Delivery of Workplace Design + Connectivity Services for Nike World Headquarters across the Workplace Design, Real Estate & Construction, and Integrated Workplace Services Functions. Director of Americas Real Estate Nike April 2013  –  April 2014  (1 year 1 month) As the Director of Americas Real Estate Development, Annette leveraged her experience in managing large Real Estate portfolios to direct all of Nike Inc's non-retail real estate across all brands within the US, Canada, Mexico, South America, Brazil and Latin America. Director of Americas Real Estate Nike April 2013  –  April 2014  (1 year 1 month) As the Director of Americas Real Estate Development, Annette leveraged her experience in managing large Real Estate portfolios to direct all of Nike Inc's non-retail real estate across all brands within the US, Canada, Mexico, South America, Brazil and Latin America. Senior Construction Manager Intel Corporation July 2012  –  April 2013  (10 months) Portland, Oregon Area Annette led the development and delivery of Intel’s latest Fab. Through her support of that program, she was able to deliver the Fab on time, on budget and to spec by leveraging her deep experience in design and construction management Senior Construction Manager Intel Corporation July 2012  –  April 2013  (10 months) Portland, Oregon Area Annette led the development and delivery of Intel’s latest Fab. Through her support of that program, she was able to deliver the Fab on time, on budget and to spec by leveraging her deep experience in design and construction management Area Portfolio Manager; EMEA Projects Lead Microsoft August 2008  –  June 2012  (3 years 11 months) Ireland As an APM in Microsoft’s EMEA region, Annette demonstrated her the depth of her expert client relationship management and adaptability. In this role she managed all Real Estate and Facilities Management Services in addition to providing governance and oversight to the Design & Construction business model for all Major Construction Projects for the EMEA Region. Area Portfolio Manager; EMEA Projects Lead Microsoft August 2008  –  June 2012  (3 years 11 months) Ireland As an APM in Microsoft’s EMEA region, Annette demonstrated her the depth of her expert client relationship management and adaptability. In this role she managed all Real Estate and Facilities Management Services in addition to providing governance and oversight to the Design & Construction business model for all Major Construction Projects for the EMEA Region. Integrated Workplace Services Director Microsoft June 2006  –  August 2008  (2 years 3 months) Annette started her tenure with Microsoft as a Facilities and Services Group Manager, where she was responsible for Facilities Management for Microsoft World Headquarters. Annette’s strong leadership and ability to drive for results, led to a promotion to Integrated Workplace Services Director within a year. In this role, Annette led the TI Construction, Move and the Furniture lines of business for Microsoft in a center function role where she developed a new business model and support processes to support these activities at a global level. Her analytical problem solving and strategic planning led to the development of a program whose foundational elements are still used by Microsoft today. Integrated Workplace Services Director Microsoft June 2006  –  August 2008  (2 years 3 months) Annette started her tenure with Microsoft as a Facilities and Services Group Manager, where she was responsible for Facilities Management for Microsoft World Headquarters. Annette’s strong leadership and ability to drive for results, led to a promotion to Integrated Workplace Services Director within a year. In this role, Annette led the TI Construction, Move and the Furniture lines of business for Microsoft in a center function role where she developed a new business model and support processes to support these activities at a global level. Her analytical problem solving and strategic planning led to the development of a program whose foundational elements are still used by Microsoft today. Facilities & Services Group Manager Microsoft May 2005  –  June 2006  (1 year 2 months) Facilities & Services Group Manager Microsoft May 2005  –  June 2006  (1 year 2 months) Various Intel Corporation January 1994  –  May 2005  (11 years 5 months) Phoenix, Arizona Area Annette’s 11 year career at Intel gave her the opportunity to grow as a competent leader and prove her ability to coordinate and manage multiple large and small facilities and construction projects. During her tenure there, she managed facility and planning organizations, demonstrated her exceptional project management skills in managing major construction projects all over the globe. Annette experienced increasingly higher level of responsibilities as her career progressed at Intel and her last role was managing the procurement contracts for the America’s Region Construction Organization. Various Intel Corporation January 1994  –  May 2005  (11 years 5 months) Phoenix, Arizona Area Annette’s 11 year career at Intel gave her the opportunity to grow as a competent leader and prove her ability to coordinate and manage multiple large and small facilities and construction projects. During her tenure there, she managed facility and planning organizations, demonstrated her exceptional project management skills in managing major construction projects all over the globe. Annette experienced increasingly higher level of responsibilities as her career progressed at Intel and her last role was managing the procurement contracts for the America’s Region Construction Organization. Sr Construction Project Manager Intel Corporation 2002  –  2004  (2 years) Ireland Sr Construction Project Manager Intel Corporation 2002  –  2004  (2 years) Ireland Sr Construction Project Manager Intel Corporation 1999  –  2002  (3 years) Portland, Oregon Area Sr Construction Project Manager Intel Corporation 1999  –  2002  (3 years) Portland, Oregon Area Civil, Structural, Architectural Project Planner/Engineer Intel Corporation 1997  –  1999  (2 years) San Jose, California Civil, Structural, Architectural Project Planner/Engineer Intel Corporation 1997  –  1999  (2 years) San Jose, California Sr Facilities Planner Intel Corporation 1994  –  1997  (3 years) Albuquerque, New Mexico Area Sr Facilities Planner Intel Corporation 1994  –  1997  (3 years) Albuquerque, New Mexico Area Skills Program Management Product Management Procurement Contract Management Facilities Management Facilities Planning Interior Design Construction Management Financial Planning Financial Reporting Financial Management Project Planning International Project... Cross-functional Team... Managerial Finance Risk Management Operations Management Project Management Change Management Strategic Financial... Leadership Management Engineering Management MS Project Contract Negotiation Construction Project Coordination Budgets Vendor Management Strategy Business Strategy CRM See 17+     See less Skills  Program Management Product Management Procurement Contract Management Facilities Management Facilities Planning Interior Design Construction Management Financial Planning Financial Reporting Financial Management Project Planning International Project... Cross-functional Team... Managerial Finance Risk Management Operations Management Project Management Change Management Strategic Financial... Leadership Management Engineering Management MS Project Contract Negotiation Construction Project Coordination Budgets Vendor Management Strategy Business Strategy CRM See 17+     See less Program Management Product Management Procurement Contract Management Facilities Management Facilities Planning Interior Design Construction Management Financial Planning Financial Reporting Financial Management Project Planning International Project... Cross-functional Team... Managerial Finance Risk Management Operations Management Project Management Change Management Strategic Financial... Leadership Management Engineering Management MS Project Contract Negotiation Construction Project Coordination Budgets Vendor Management Strategy Business Strategy CRM See 17+     See less Program Management Product Management Procurement Contract Management Facilities Management Facilities Planning Interior Design Construction Management Financial Planning Financial Reporting Financial Management Project Planning International Project... Cross-functional Team... Managerial Finance Risk Management Operations Management Project Management Change Management Strategic Financial... Leadership Management Engineering Management MS Project Contract Negotiation Construction Project Coordination Budgets Vendor Management Strategy Business Strategy CRM See 17+     See less Education New Mexico State University Bachelor of Architecture (BArch),  Interior Design 1986  – 1991 New Mexico State University Bachelor of Architecture (BArch),  Interior Design 1986  – 1991 New Mexico State University Bachelor of Architecture (BArch),  Interior Design 1986  – 1991 New Mexico State University Bachelor of Architecture (BArch),  Interior Design 1986  – 1991 ", "Summary Development Professional with civil engineering background and extensive Project Management experience of working in Russia and CIS countries in area of real estate development & construction. Successfully completed projects for such western investors as real,-Hypermarket (METRO Group), Intel, British Council, Meinl European Land and GEFCO (Peugeot Citroen Group). MSc Degree in Development Administration&Planning from world famous Town Planning School (Bartlett School, University College London). The best of managerial and technical skills together with excellent training and experience in all aspects of real estate development for wide range of business development projects from preliminary to post-development stages. Summary Development Professional with civil engineering background and extensive Project Management experience of working in Russia and CIS countries in area of real estate development & construction. Successfully completed projects for such western investors as real,-Hypermarket (METRO Group), Intel, British Council, Meinl European Land and GEFCO (Peugeot Citroen Group). MSc Degree in Development Administration&Planning from world famous Town Planning School (Bartlett School, University College London). The best of managerial and technical skills together with excellent training and experience in all aspects of real estate development for wide range of business development projects from preliminary to post-development stages. Development Professional with civil engineering background and extensive Project Management experience of working in Russia and CIS countries in area of real estate development & construction. Successfully completed projects for such western investors as real,-Hypermarket (METRO Group), Intel, British Council, Meinl European Land and GEFCO (Peugeot Citroen Group). MSc Degree in Development Administration&Planning from world famous Town Planning School (Bartlett School, University College London). The best of managerial and technical skills together with excellent training and experience in all aspects of real estate development for wide range of business development projects from preliminary to post-development stages. Development Professional with civil engineering background and extensive Project Management experience of working in Russia and CIS countries in area of real estate development & construction. Successfully completed projects for such western investors as real,-Hypermarket (METRO Group), Intel, British Council, Meinl European Land and GEFCO (Peugeot Citroen Group). MSc Degree in Development Administration&Planning from world famous Town Planning School (Bartlett School, University College London). The best of managerial and technical skills together with excellent training and experience in all aspects of real estate development for wide range of business development projects from preliminary to post-development stages. Experience Construction Director Barwa BauInvest Fund June 2013  – Present (2 years 3 months) Moscow, Russian Federation • Organize tenders and lead on selection of General Designer, General Contractor and Technical Zakazchik \n• Lead on developing design and construction budget, schedule and Scope of Works \n• Support development team in their negotiations with tenants \n• Establish efficient ways of communication to anchor tenants (Lenta, Decathlon, Leroy Merlin, M.Video etc.) \n• Monitor checks and analyses of drawings, technical inquiries and other project technical documentation \n• Participate in working meetings with contractors on all stages of design and construction \n• Co-ordinate all communication works between Investor, General designer, General Contractor, Technical Supervision Team, Tenants, Consulting companies and future Shopping Centre Operation Team in their work to complete project. Head of Construction Castorama Russia November 2012  –  April 2013  (6 months) Moscow • Developed Corporate Guidelines on construction management processes \n• Lead on establishing cost baseline for new projects \n• Controlled the organization of tenders to select contractors for the store building and construction works \n• Managed a team of Construction Managers \n• Monitored executed negotiations with contractors on terms and conditions of the construction project \n• Monitored and controlled checks and analyses of drawings, technical inquiries and other project technical documentation \n• Controlled construction process and conformity of construction works to design choice. Controlled observation of work schedule \n• Participated in working meetings with contractors on all stages of building \n• Took part in building acceptance process. Prepared list of warranty issues, controlled over its proper fixing \n• Prepared project concepts and drawings for support of construction process of new stores and reconstruction of running stores \n• Visited stores after their completion, controlled conduct of operations in removal of constructional defects, operation of technical equipment. CEO at CJSC \"GRANAT INVEST\", Construction Management Expert GEFCO February 2010  –  August 2012  (2 years 7 months) Moscow, Russian Federation From Investor's side, managed to build new Logistic Automotive Compound of 15000 cars for GEFCO (PSA Group). \nIn order to achieve primary goal organized a team of professionals (Accounting, HR, M&E etc.), established efficient ways of communication to Headquarter, Business Units, Regional Administration and neighbourhood surrounding area. Technical Director, Head of Construction Department at Atrium European Real Estate (Russia) (formerly Meinl European Land) June 2007  –  October 2009  (2 years 5 months) • Provided Feasibility analyses on land plots and construction projects \n• Organised tenders and estimated construction budgets on construction for Director Board approval \n• Lead and motivated Project Management Team \n• Managed construction&design contracts including construction cost, schedule and scope of works \n• Developed contacts with regional authorities, local suppliers and contractors \n• Completed Projects: Castorama DIY store (12500m2, Togliatti), MediaMarkt (7000m2, Togliatti), OBI DIY store (12500m2, Volgograd), Shopping Centre \"Northern Mall\" (33000m2, St.Petersburg), Shopping Centre \"Park House\" (65000m2, Kazan). Project Manager ECE Russland January 2007  –  June 2007  (6 months) Managed projects from inception through designing and construction to commissioning and handover in different Russian big cities. Construction Project Manager Intel Corporation October 2005  –  January 2007  (1 year 4 months) Moscow • Managed construction projects in the Russia region and Gdansk (Poland). Role included, but was not limited to, managing project scope, schedule, and budget \n• Setted up and supported Project Management Procedures for Moscow, Novosibirsk and Gdansk construction projects in according to Corporate Construction Management Processes Manual. Managed Project team passed two Corporate Operational Assessments without critical findings \n• Led in Gap analysis on Nizhniy Novgorod and Sarov projects in Russia \n• As a Super-User of Primavera PrimeContract (web-based Document Management System) and Unifier (web-based Cost Control System) took part in developing Intel Corporate Project Management Standards on a global level \n• Completed Project: Intel's offices in Moscow (Krylatskoye, 10 000m2). Construction Project Manager real,- Hypermarket Russia (Metro Group) August 2004  –  October 2005  (1 year 3 months) Moscow, Russian Federation • Took part in tenders and subcontractors selection. All selected subcontractors were able successfully complete their works \n• Coordinated between subcontractors within construction of shopping centres \n• Controlled schedules and quality of subcontractors work \n• Supervised financial issues and controlled budget of the projects \n• Managed turnkey of first company’s Shopping Centre in Russia and Moscow to successful completion (65000sq.m Mall Gallery shopping centre in Brateevo, Moscow). Russia Premises Manager British Council April 2002  –  June 2004  (2 years 3 months) • Managed construction activities on sites by working closely with designers, contractors and suppliers  \n• Performed as a mediator between local authorities and British Council Headquarters ensure the project reaches a timely and profitable conclusion \n• Planned and programmed design and construction works \n• Took part in organising tenders. Obtained good knowledge of local construction markets. All construction projects were completed within designated budgets and schedules \n• Organised opening ceremonies joined by Her Majesty’s Ambassador in Russia Sir Roderic Lyne and representatives of United Kingdom, Russian Federal and Regional Authorities \n• Completed Projects: British Council Centres in Rostov-on-Don, Sochi, Novosibirsk and Krasnoyarsk. Senior Chief Engineer (GIP) Stroydesignconsulting Ltd. November 2001  –  April 2002  (6 months) • Managed a team of architects, engineers and technicians \n• Supervised and co-ordinated contractors and sub-contractors that were engaged in construction of bank offices, jeweller shops, shops and elite apartments \n• Completed Projects: shop “Photocenter.ru”, two “Moscomprivatbank” offices in Moscow, Jeweller shops, Elite apartments in Moscow and Sochi. Construction Director Barwa BauInvest Fund June 2013  – Present (2 years 3 months) Moscow, Russian Federation • Organize tenders and lead on selection of General Designer, General Contractor and Technical Zakazchik \n• Lead on developing design and construction budget, schedule and Scope of Works \n• Support development team in their negotiations with tenants \n• Establish efficient ways of communication to anchor tenants (Lenta, Decathlon, Leroy Merlin, M.Video etc.) \n• Monitor checks and analyses of drawings, technical inquiries and other project technical documentation \n• Participate in working meetings with contractors on all stages of design and construction \n• Co-ordinate all communication works between Investor, General designer, General Contractor, Technical Supervision Team, Tenants, Consulting companies and future Shopping Centre Operation Team in their work to complete project. Construction Director Barwa BauInvest Fund June 2013  – Present (2 years 3 months) Moscow, Russian Federation • Organize tenders and lead on selection of General Designer, General Contractor and Technical Zakazchik \n• Lead on developing design and construction budget, schedule and Scope of Works \n• Support development team in their negotiations with tenants \n• Establish efficient ways of communication to anchor tenants (Lenta, Decathlon, Leroy Merlin, M.Video etc.) \n• Monitor checks and analyses of drawings, technical inquiries and other project technical documentation \n• Participate in working meetings with contractors on all stages of design and construction \n• Co-ordinate all communication works between Investor, General designer, General Contractor, Technical Supervision Team, Tenants, Consulting companies and future Shopping Centre Operation Team in their work to complete project. Head of Construction Castorama Russia November 2012  –  April 2013  (6 months) Moscow • Developed Corporate Guidelines on construction management processes \n• Lead on establishing cost baseline for new projects \n• Controlled the organization of tenders to select contractors for the store building and construction works \n• Managed a team of Construction Managers \n• Monitored executed negotiations with contractors on terms and conditions of the construction project \n• Monitored and controlled checks and analyses of drawings, technical inquiries and other project technical documentation \n• Controlled construction process and conformity of construction works to design choice. Controlled observation of work schedule \n• Participated in working meetings with contractors on all stages of building \n• Took part in building acceptance process. Prepared list of warranty issues, controlled over its proper fixing \n• Prepared project concepts and drawings for support of construction process of new stores and reconstruction of running stores \n• Visited stores after their completion, controlled conduct of operations in removal of constructional defects, operation of technical equipment. Head of Construction Castorama Russia November 2012  –  April 2013  (6 months) Moscow • Developed Corporate Guidelines on construction management processes \n• Lead on establishing cost baseline for new projects \n• Controlled the organization of tenders to select contractors for the store building and construction works \n• Managed a team of Construction Managers \n• Monitored executed negotiations with contractors on terms and conditions of the construction project \n• Monitored and controlled checks and analyses of drawings, technical inquiries and other project technical documentation \n• Controlled construction process and conformity of construction works to design choice. Controlled observation of work schedule \n• Participated in working meetings with contractors on all stages of building \n• Took part in building acceptance process. Prepared list of warranty issues, controlled over its proper fixing \n• Prepared project concepts and drawings for support of construction process of new stores and reconstruction of running stores \n• Visited stores after their completion, controlled conduct of operations in removal of constructional defects, operation of technical equipment. CEO at CJSC \"GRANAT INVEST\", Construction Management Expert GEFCO February 2010  –  August 2012  (2 years 7 months) Moscow, Russian Federation From Investor's side, managed to build new Logistic Automotive Compound of 15000 cars for GEFCO (PSA Group). \nIn order to achieve primary goal organized a team of professionals (Accounting, HR, M&E etc.), established efficient ways of communication to Headquarter, Business Units, Regional Administration and neighbourhood surrounding area. CEO at CJSC \"GRANAT INVEST\", Construction Management Expert GEFCO February 2010  –  August 2012  (2 years 7 months) Moscow, Russian Federation From Investor's side, managed to build new Logistic Automotive Compound of 15000 cars for GEFCO (PSA Group). \nIn order to achieve primary goal organized a team of professionals (Accounting, HR, M&E etc.), established efficient ways of communication to Headquarter, Business Units, Regional Administration and neighbourhood surrounding area. Technical Director, Head of Construction Department at Atrium European Real Estate (Russia) (formerly Meinl European Land) June 2007  –  October 2009  (2 years 5 months) • Provided Feasibility analyses on land plots and construction projects \n• Organised tenders and estimated construction budgets on construction for Director Board approval \n• Lead and motivated Project Management Team \n• Managed construction&design contracts including construction cost, schedule and scope of works \n• Developed contacts with regional authorities, local suppliers and contractors \n• Completed Projects: Castorama DIY store (12500m2, Togliatti), MediaMarkt (7000m2, Togliatti), OBI DIY store (12500m2, Volgograd), Shopping Centre \"Northern Mall\" (33000m2, St.Petersburg), Shopping Centre \"Park House\" (65000m2, Kazan). Technical Director, Head of Construction Department at Atrium European Real Estate (Russia) (formerly Meinl European Land) June 2007  –  October 2009  (2 years 5 months) • Provided Feasibility analyses on land plots and construction projects \n• Organised tenders and estimated construction budgets on construction for Director Board approval \n• Lead and motivated Project Management Team \n• Managed construction&design contracts including construction cost, schedule and scope of works \n• Developed contacts with regional authorities, local suppliers and contractors \n• Completed Projects: Castorama DIY store (12500m2, Togliatti), MediaMarkt (7000m2, Togliatti), OBI DIY store (12500m2, Volgograd), Shopping Centre \"Northern Mall\" (33000m2, St.Petersburg), Shopping Centre \"Park House\" (65000m2, Kazan). Project Manager ECE Russland January 2007  –  June 2007  (6 months) Managed projects from inception through designing and construction to commissioning and handover in different Russian big cities. Project Manager ECE Russland January 2007  –  June 2007  (6 months) Managed projects from inception through designing and construction to commissioning and handover in different Russian big cities. Construction Project Manager Intel Corporation October 2005  –  January 2007  (1 year 4 months) Moscow • Managed construction projects in the Russia region and Gdansk (Poland). Role included, but was not limited to, managing project scope, schedule, and budget \n• Setted up and supported Project Management Procedures for Moscow, Novosibirsk and Gdansk construction projects in according to Corporate Construction Management Processes Manual. Managed Project team passed two Corporate Operational Assessments without critical findings \n• Led in Gap analysis on Nizhniy Novgorod and Sarov projects in Russia \n• As a Super-User of Primavera PrimeContract (web-based Document Management System) and Unifier (web-based Cost Control System) took part in developing Intel Corporate Project Management Standards on a global level \n• Completed Project: Intel's offices in Moscow (Krylatskoye, 10 000m2). Construction Project Manager Intel Corporation October 2005  –  January 2007  (1 year 4 months) Moscow • Managed construction projects in the Russia region and Gdansk (Poland). Role included, but was not limited to, managing project scope, schedule, and budget \n• Setted up and supported Project Management Procedures for Moscow, Novosibirsk and Gdansk construction projects in according to Corporate Construction Management Processes Manual. Managed Project team passed two Corporate Operational Assessments without critical findings \n• Led in Gap analysis on Nizhniy Novgorod and Sarov projects in Russia \n• As a Super-User of Primavera PrimeContract (web-based Document Management System) and Unifier (web-based Cost Control System) took part in developing Intel Corporate Project Management Standards on a global level \n• Completed Project: Intel's offices in Moscow (Krylatskoye, 10 000m2). Construction Project Manager real,- Hypermarket Russia (Metro Group) August 2004  –  October 2005  (1 year 3 months) Moscow, Russian Federation • Took part in tenders and subcontractors selection. All selected subcontractors were able successfully complete their works \n• Coordinated between subcontractors within construction of shopping centres \n• Controlled schedules and quality of subcontractors work \n• Supervised financial issues and controlled budget of the projects \n• Managed turnkey of first company’s Shopping Centre in Russia and Moscow to successful completion (65000sq.m Mall Gallery shopping centre in Brateevo, Moscow). Construction Project Manager real,- Hypermarket Russia (Metro Group) August 2004  –  October 2005  (1 year 3 months) Moscow, Russian Federation • Took part in tenders and subcontractors selection. All selected subcontractors were able successfully complete their works \n• Coordinated between subcontractors within construction of shopping centres \n• Controlled schedules and quality of subcontractors work \n• Supervised financial issues and controlled budget of the projects \n• Managed turnkey of first company’s Shopping Centre in Russia and Moscow to successful completion (65000sq.m Mall Gallery shopping centre in Brateevo, Moscow). Russia Premises Manager British Council April 2002  –  June 2004  (2 years 3 months) • Managed construction activities on sites by working closely with designers, contractors and suppliers  \n• Performed as a mediator between local authorities and British Council Headquarters ensure the project reaches a timely and profitable conclusion \n• Planned and programmed design and construction works \n• Took part in organising tenders. Obtained good knowledge of local construction markets. All construction projects were completed within designated budgets and schedules \n• Organised opening ceremonies joined by Her Majesty’s Ambassador in Russia Sir Roderic Lyne and representatives of United Kingdom, Russian Federal and Regional Authorities \n• Completed Projects: British Council Centres in Rostov-on-Don, Sochi, Novosibirsk and Krasnoyarsk. Russia Premises Manager British Council April 2002  –  June 2004  (2 years 3 months) • Managed construction activities on sites by working closely with designers, contractors and suppliers  \n• Performed as a mediator between local authorities and British Council Headquarters ensure the project reaches a timely and profitable conclusion \n• Planned and programmed design and construction works \n• Took part in organising tenders. Obtained good knowledge of local construction markets. All construction projects were completed within designated budgets and schedules \n• Organised opening ceremonies joined by Her Majesty’s Ambassador in Russia Sir Roderic Lyne and representatives of United Kingdom, Russian Federal and Regional Authorities \n• Completed Projects: British Council Centres in Rostov-on-Don, Sochi, Novosibirsk and Krasnoyarsk. Senior Chief Engineer (GIP) Stroydesignconsulting Ltd. November 2001  –  April 2002  (6 months) • Managed a team of architects, engineers and technicians \n• Supervised and co-ordinated contractors and sub-contractors that were engaged in construction of bank offices, jeweller shops, shops and elite apartments \n• Completed Projects: shop “Photocenter.ru”, two “Moscomprivatbank” offices in Moscow, Jeweller shops, Elite apartments in Moscow and Sochi. Senior Chief Engineer (GIP) Stroydesignconsulting Ltd. November 2001  –  April 2002  (6 months) • Managed a team of architects, engineers and technicians \n• Supervised and co-ordinated contractors and sub-contractors that were engaged in construction of bank offices, jeweller shops, shops and elite apartments \n• Completed Projects: shop “Photocenter.ru”, two “Moscomprivatbank” offices in Moscow, Jeweller shops, Elite apartments in Moscow and Sochi. Languages English Full professional proficiency French Elementary proficiency English Full professional proficiency French Elementary proficiency English Full professional proficiency French Elementary proficiency Full professional proficiency Elementary proficiency Skills Budgeting Team Building Project Planning Construction Supervision MS Project Excel AutoCAD Design Management ArchiCAD Feasibility Studies Construction Tenders Construction Management Real Estate Development Contract Management Microsoft Office English Change Management Cost Control Procurement Budgets Management Engineering Project Management Team Management Analysis Contract Negotiation Real Estate Logistics Leadership Negotiation Civil Engineering Retail Operations Management Training Business Strategy Business Planning Business Development Human Resources Contractors Primavera P6 Cost Management Facilities Management Project Coordination Subcontracting Commercial Management Management Consulting Purchasing Supply Chain Management Supply Chain See 35+     See less Skills  Budgeting Team Building Project Planning Construction Supervision MS Project Excel AutoCAD Design Management ArchiCAD Feasibility Studies Construction Tenders Construction Management Real Estate Development Contract Management Microsoft Office English Change Management Cost Control Procurement Budgets Management Engineering Project Management Team Management Analysis Contract Negotiation Real Estate Logistics Leadership Negotiation Civil Engineering Retail Operations Management Training Business Strategy Business Planning Business Development Human Resources Contractors Primavera P6 Cost Management Facilities Management Project Coordination Subcontracting Commercial Management Management Consulting Purchasing Supply Chain Management Supply Chain See 35+     See less Budgeting Team Building Project Planning Construction Supervision MS Project Excel AutoCAD Design Management ArchiCAD Feasibility Studies Construction Tenders Construction Management Real Estate Development Contract Management Microsoft Office English Change Management Cost Control Procurement Budgets Management Engineering Project Management Team Management Analysis Contract Negotiation Real Estate Logistics Leadership Negotiation Civil Engineering Retail Operations Management Training Business Strategy Business Planning Business Development Human Resources Contractors Primavera P6 Cost Management Facilities Management Project Coordination Subcontracting Commercial Management Management Consulting Purchasing Supply Chain Management Supply Chain See 35+     See less Budgeting Team Building Project Planning Construction Supervision MS Project Excel AutoCAD Design Management ArchiCAD Feasibility Studies Construction Tenders Construction Management Real Estate Development Contract Management Microsoft Office English Change Management Cost Control Procurement Budgets Management Engineering Project Management Team Management Analysis Contract Negotiation Real Estate Logistics Leadership Negotiation Civil Engineering Retail Operations Management Training Business Strategy Business Planning Business Development Human Resources Contractors Primavera P6 Cost Management Facilities Management Project Coordination Subcontracting Commercial Management Management Consulting Purchasing Supply Chain Management Supply Chain See 35+     See less Education London School of Economics and Political Science Housing Policy 1999  – 2000 Studied Housing Policy Activities and Societies:  Aikido Club University College London, U. of London Master of Science,  Town Planning, Development Administration and Planning 1998  – 1999 Master of Science Degree in Development Administration and Planning. Activities and Societies:  Aikido Club Rostov State Construction University Engineer's degree,  Civil Engineering 1978  – 1983 Degree in Industrial and Civil Engineering Activities and Societies:  University and Faculty Table Tennis team London School of Economics and Political Science Housing Policy 1999  – 2000 Studied Housing Policy Activities and Societies:  Aikido Club London School of Economics and Political Science Housing Policy 1999  – 2000 Studied Housing Policy Activities and Societies:  Aikido Club London School of Economics and Political Science Housing Policy 1999  – 2000 Studied Housing Policy Activities and Societies:  Aikido Club University College London, U. of London Master of Science,  Town Planning, Development Administration and Planning 1998  – 1999 Master of Science Degree in Development Administration and Planning. Activities and Societies:  Aikido Club University College London, U. of London Master of Science,  Town Planning, Development Administration and Planning 1998  – 1999 Master of Science Degree in Development Administration and Planning. Activities and Societies:  Aikido Club University College London, U. of London Master of Science,  Town Planning, Development Administration and Planning 1998  – 1999 Master of Science Degree in Development Administration and Planning. Activities and Societies:  Aikido Club Rostov State Construction University Engineer's degree,  Civil Engineering 1978  – 1983 Degree in Industrial and Civil Engineering Activities and Societies:  University and Faculty Table Tennis team Rostov State Construction University Engineer's degree,  Civil Engineering 1978  – 1983 Degree in Industrial and Civil Engineering Activities and Societies:  University and Faculty Table Tennis team Rostov State Construction University Engineer's degree,  Civil Engineering 1978  – 1983 Degree in Industrial and Civil Engineering Activities and Societies:  University and Faculty Table Tennis team Honors & Awards Additional Honors & Awards Received 2006 World Construction Achievement Award from Intel Corporate World Project Delivery Steering Committee with a note, “In recognition of outstanding performance in meeting project goals with a particular focus on controls while ramping a new team in a new geographic location”. Additional Honors & Awards Received 2006 World Construction Achievement Award from Intel Corporate World Project Delivery Steering Committee with a note, “In recognition of outstanding performance in meeting project goals with a particular focus on controls while ramping a new team in a new geographic location”. Additional Honors & Awards Received 2006 World Construction Achievement Award from Intel Corporate World Project Delivery Steering Committee with a note, “In recognition of outstanding performance in meeting project goals with a particular focus on controls while ramping a new team in a new geographic location”. Additional Honors & Awards Received 2006 World Construction Achievement Award from Intel Corporate World Project Delivery Steering Committee with a note, “In recognition of outstanding performance in meeting project goals with a particular focus on controls while ramping a new team in a new geographic location”. ", "Summary Graduate student at the University of Arizona studying Systems Engineering and Entrepreneurship. A driven individual, seeking challenges and opportunities to learn and grow from. Summary Graduate student at the University of Arizona studying Systems Engineering and Entrepreneurship. A driven individual, seeking challenges and opportunities to learn and grow from. Graduate student at the University of Arizona studying Systems Engineering and Entrepreneurship. A driven individual, seeking challenges and opportunities to learn and grow from. Graduate student at the University of Arizona studying Systems Engineering and Entrepreneurship. A driven individual, seeking challenges and opportunities to learn and grow from. Experience Construction Project Manager Intel Corporation June 2015  – Present (3 months) Ocotillo, Arizona - Application Owner handling daily tactical support and management to fulfill customers' business needs Graduate Technical Intern Intel Corporation May 2014  –  May 2015  (1 year 1 month) Team Leader - Senior Design Texas Instruments August 2013  –  May 2014  (10 months) University of Arizona - Texas Instruments Senior Design Team (2013-2014) \n- Was the Team Leader for Non-Intrusive Adaptable Smart Meter project \n- Designed and built a system that utilized high precision sensors to detect appliance power consumption \n- Created a non-intrusive load monitoring algorithm to disaggregate multiple power loads from a single measurement \n- Our team won “Best Analog Design” which was the highest award given Systems Engineer Intern Intel Corporation May 2013  –  August 2013  (4 months) - Help plan and facilitate requirement and architecture reviews \n- Requirement Analysis / Gathering for Rapid Storage Technology (RST) in Jama Contour \n Systems Engineer Intern Intel Corporation May 2012  –  August 2012  (4 months) - Write Use Cases and Requirements for Rapid Storage Technology (RST) in Enterprise Architect \n- Worked on modeling Rapid Storage Technology (RST) software using UML and Enterprise Architect (EA) \n- Worked in an Agile Environment with various Architects and Software Developers \n- Earned ICONIX (Software Engineering) Training Server Caffe Boa in Ahwatukee April 2008  –  August 2011  (3 years 5 months) Ahwatukee, AZ Construction Project Manager Intel Corporation June 2015  – Present (3 months) Ocotillo, Arizona - Application Owner handling daily tactical support and management to fulfill customers' business needs Construction Project Manager Intel Corporation June 2015  – Present (3 months) Ocotillo, Arizona - Application Owner handling daily tactical support and management to fulfill customers' business needs Graduate Technical Intern Intel Corporation May 2014  –  May 2015  (1 year 1 month) Graduate Technical Intern Intel Corporation May 2014  –  May 2015  (1 year 1 month) Team Leader - Senior Design Texas Instruments August 2013  –  May 2014  (10 months) University of Arizona - Texas Instruments Senior Design Team (2013-2014) \n- Was the Team Leader for Non-Intrusive Adaptable Smart Meter project \n- Designed and built a system that utilized high precision sensors to detect appliance power consumption \n- Created a non-intrusive load monitoring algorithm to disaggregate multiple power loads from a single measurement \n- Our team won “Best Analog Design” which was the highest award given Team Leader - Senior Design Texas Instruments August 2013  –  May 2014  (10 months) University of Arizona - Texas Instruments Senior Design Team (2013-2014) \n- Was the Team Leader for Non-Intrusive Adaptable Smart Meter project \n- Designed and built a system that utilized high precision sensors to detect appliance power consumption \n- Created a non-intrusive load monitoring algorithm to disaggregate multiple power loads from a single measurement \n- Our team won “Best Analog Design” which was the highest award given Systems Engineer Intern Intel Corporation May 2013  –  August 2013  (4 months) - Help plan and facilitate requirement and architecture reviews \n- Requirement Analysis / Gathering for Rapid Storage Technology (RST) in Jama Contour \n Systems Engineer Intern Intel Corporation May 2013  –  August 2013  (4 months) - Help plan and facilitate requirement and architecture reviews \n- Requirement Analysis / Gathering for Rapid Storage Technology (RST) in Jama Contour \n Systems Engineer Intern Intel Corporation May 2012  –  August 2012  (4 months) - Write Use Cases and Requirements for Rapid Storage Technology (RST) in Enterprise Architect \n- Worked on modeling Rapid Storage Technology (RST) software using UML and Enterprise Architect (EA) \n- Worked in an Agile Environment with various Architects and Software Developers \n- Earned ICONIX (Software Engineering) Training Systems Engineer Intern Intel Corporation May 2012  –  August 2012  (4 months) - Write Use Cases and Requirements for Rapid Storage Technology (RST) in Enterprise Architect \n- Worked on modeling Rapid Storage Technology (RST) software using UML and Enterprise Architect (EA) \n- Worked in an Agile Environment with various Architects and Software Developers \n- Earned ICONIX (Software Engineering) Training Server Caffe Boa in Ahwatukee April 2008  –  August 2011  (3 years 5 months) Ahwatukee, AZ Server Caffe Boa in Ahwatukee April 2008  –  August 2011  (3 years 5 months) Ahwatukee, AZ Languages Spanish Limited working proficiency Spanish Limited working proficiency Spanish Limited working proficiency Limited working proficiency Skills Microsoft Office UML Requirements Management ICONIX C Systems Engineering Recruiting Sparx Enterprise... Public Speaking Management Requirements Analysis Training Project Planning Team Leadership Data Analysis Program Management Leadership SharePoint See 3+     See less Skills  Microsoft Office UML Requirements Management ICONIX C Systems Engineering Recruiting Sparx Enterprise... Public Speaking Management Requirements Analysis Training Project Planning Team Leadership Data Analysis Program Management Leadership SharePoint See 3+     See less Microsoft Office UML Requirements Management ICONIX C Systems Engineering Recruiting Sparx Enterprise... Public Speaking Management Requirements Analysis Training Project Planning Team Leadership Data Analysis Program Management Leadership SharePoint See 3+     See less Microsoft Office UML Requirements Management ICONIX C Systems Engineering Recruiting Sparx Enterprise... Public Speaking Management Requirements Analysis Training Project Planning Team Leadership Data Analysis Program Management Leadership SharePoint See 3+     See less Education University of Arizona Master’s Degree,  Systems Engineering , 3.9 2013  – 2015 University of Arizona Entrepreneurship / Entrepreneurial Studies , 4.0 2014  – 2015 University of Arizona Bachelor of Science (B.S.) | Honors,  Systems Engineering , 3.71 2010  – 2014 Activities and Societies:  Bobcats Senior Honorary ,  Engineering Ambassadors ,  Chain Gang Junior Honorary ,  Sigma Chi Fraternity ,  Order of Omega ,  National Society of Collegiate Scholars Desert Vista High School High School Diploma , 3.98 2006  – 2010 Activities and Societies:  NHS ,  Football ,  Basketball ,  Track and Field University of Arizona Master’s Degree,  Systems Engineering , 3.9 2013  – 2015 University of Arizona Master’s Degree,  Systems Engineering , 3.9 2013  – 2015 University of Arizona Master’s Degree,  Systems Engineering , 3.9 2013  – 2015 University of Arizona Entrepreneurship / Entrepreneurial Studies , 4.0 2014  – 2015 University of Arizona Entrepreneurship / Entrepreneurial Studies , 4.0 2014  – 2015 University of Arizona Entrepreneurship / Entrepreneurial Studies , 4.0 2014  – 2015 University of Arizona Bachelor of Science (B.S.) | Honors,  Systems Engineering , 3.71 2010  – 2014 Activities and Societies:  Bobcats Senior Honorary ,  Engineering Ambassadors ,  Chain Gang Junior Honorary ,  Sigma Chi Fraternity ,  Order of Omega ,  National Society of Collegiate Scholars University of Arizona Bachelor of Science (B.S.) | Honors,  Systems Engineering , 3.71 2010  – 2014 Activities and Societies:  Bobcats Senior Honorary ,  Engineering Ambassadors ,  Chain Gang Junior Honorary ,  Sigma Chi Fraternity ,  Order of Omega ,  National Society of Collegiate Scholars University of Arizona Bachelor of Science (B.S.) | Honors,  Systems Engineering , 3.71 2010  – 2014 Activities and Societies:  Bobcats Senior Honorary ,  Engineering Ambassadors ,  Chain Gang Junior Honorary ,  Sigma Chi Fraternity ,  Order of Omega ,  National Society of Collegiate Scholars Desert Vista High School High School Diploma , 3.98 2006  – 2010 Activities and Societies:  NHS ,  Football ,  Basketball ,  Track and Field Desert Vista High School High School Diploma , 3.98 2006  – 2010 Activities and Societies:  NHS ,  Football ,  Basketball ,  Track and Field Desert Vista High School High School Diploma , 3.98 2006  – 2010 Activities and Societies:  NHS ,  Football ,  Basketball ,  Track and Field Honors & Awards Additional Honors & Awards Dean's List with Distinction - 4.0 (Spring 2013, Spring 2014) \nDean's List - 3.5 or above (Fall 2010 - Fall 2014) \nTexas Instruments - Best Analog Design (Spring 2014) \nOrder of Omega Membership (October 2012-Present) \nPi Beta Phi Hasher of the Year (2012) \nPacific Islander Scholarship (2010-2011) \nArizona Alumni Scholarship (2010-2011) \nArizona Wildcat Excellence Award (2010-2014) \nAcademic Athlete of the Year (2009) \nArizona State Champion - High Jump (2009) \nArizona 1st Team Track and Field Team (2009) \n Additional Honors & Awards Dean's List with Distinction - 4.0 (Spring 2013, Spring 2014) \nDean's List - 3.5 or above (Fall 2010 - Fall 2014) \nTexas Instruments - Best Analog Design (Spring 2014) \nOrder of Omega Membership (October 2012-Present) \nPi Beta Phi Hasher of the Year (2012) \nPacific Islander Scholarship (2010-2011) \nArizona Alumni Scholarship (2010-2011) \nArizona Wildcat Excellence Award (2010-2014) \nAcademic Athlete of the Year (2009) \nArizona State Champion - High Jump (2009) \nArizona 1st Team Track and Field Team (2009) \n Additional Honors & Awards Dean's List with Distinction - 4.0 (Spring 2013, Spring 2014) \nDean's List - 3.5 or above (Fall 2010 - Fall 2014) \nTexas Instruments - Best Analog Design (Spring 2014) \nOrder of Omega Membership (October 2012-Present) \nPi Beta Phi Hasher of the Year (2012) \nPacific Islander Scholarship (2010-2011) \nArizona Alumni Scholarship (2010-2011) \nArizona Wildcat Excellence Award (2010-2014) \nAcademic Athlete of the Year (2009) \nArizona State Champion - High Jump (2009) \nArizona 1st Team Track and Field Team (2009) \n Additional Honors & Awards Dean's List with Distinction - 4.0 (Spring 2013, Spring 2014) \nDean's List - 3.5 or above (Fall 2010 - Fall 2014) \nTexas Instruments - Best Analog Design (Spring 2014) \nOrder of Omega Membership (October 2012-Present) \nPi Beta Phi Hasher of the Year (2012) \nPacific Islander Scholarship (2010-2011) \nArizona Alumni Scholarship (2010-2011) \nArizona Wildcat Excellence Award (2010-2014) \nAcademic Athlete of the Year (2009) \nArizona State Champion - High Jump (2009) \nArizona 1st Team Track and Field Team (2009) \n "]}