{"position": "Controller", "company": "Intel Corporation", "profiles": ["Skills Budgets Finance SEC Filings Accounting Financial Analysis Corporate Finance Financial Reporting Internal Controls GAAP Skills  Budgets Finance SEC Filings Accounting Financial Analysis Corporate Finance Financial Reporting Internal Controls GAAP Budgets Finance SEC Filings Accounting Financial Analysis Corporate Finance Financial Reporting Internal Controls GAAP Budgets Finance SEC Filings Accounting Financial Analysis Corporate Finance Financial Reporting Internal Controls GAAP ", "Languages English English English Skills Financial Reporting Cross-functional Team... Business Analysis Strategy Competitive Analysis Mergers & Acquisitions Analysis Management Program Management Manufacturing Project Planning Forecasting Financial Analysis Business Strategy Leadership Skills  Financial Reporting Cross-functional Team... Business Analysis Strategy Competitive Analysis Mergers & Acquisitions Analysis Management Program Management Manufacturing Project Planning Forecasting Financial Analysis Business Strategy Leadership Financial Reporting Cross-functional Team... Business Analysis Strategy Competitive Analysis Mergers & Acquisitions Analysis Management Program Management Manufacturing Project Planning Forecasting Financial Analysis Business Strategy Leadership Financial Reporting Cross-functional Team... Business Analysis Strategy Competitive Analysis Mergers & Acquisitions Analysis Management Program Management Manufacturing Project Planning Forecasting Financial Analysis Business Strategy Leadership ", "Skills Finance Financial Modeling Organizational... Forecasting Financial Analysis Strategy Project Management Business Analysis Internal Controls Analysis Process Improvement Competitive Analysis Corporate Finance Risk Management Cross-functional Team... Budgets Sarbanes-Oxley Act Managerial Finance Strategic Financial... Project Planning Management Analytics See 7+     See less Skills  Finance Financial Modeling Organizational... Forecasting Financial Analysis Strategy Project Management Business Analysis Internal Controls Analysis Process Improvement Competitive Analysis Corporate Finance Risk Management Cross-functional Team... Budgets Sarbanes-Oxley Act Managerial Finance Strategic Financial... Project Planning Management Analytics See 7+     See less Finance Financial Modeling Organizational... Forecasting Financial Analysis Strategy Project Management Business Analysis Internal Controls Analysis Process Improvement Competitive Analysis Corporate Finance Risk Management Cross-functional Team... Budgets Sarbanes-Oxley Act Managerial Finance Strategic Financial... Project Planning Management Analytics See 7+     See less Finance Financial Modeling Organizational... Forecasting Financial Analysis Strategy Project Management Business Analysis Internal Controls Analysis Process Improvement Competitive Analysis Corporate Finance Risk Management Cross-functional Team... Budgets Sarbanes-Oxley Act Managerial Finance Strategic Financial... Project Planning Management Analytics See 7+     See less ", "Skills US GAAP Sarbanes-Oxley Act SEC filings Financial Reporting Internal Controls GAAP Management Managerial Finance Skills  US GAAP Sarbanes-Oxley Act SEC filings Financial Reporting Internal Controls GAAP Management Managerial Finance US GAAP Sarbanes-Oxley Act SEC filings Financial Reporting Internal Controls GAAP Management Managerial Finance US GAAP Sarbanes-Oxley Act SEC filings Financial Reporting Internal Controls GAAP Management Managerial Finance ", "Skills Accounting Management Financial Modeling Financial Analysis Auditing Cost Accounting Manufacturing Cross-functional Team... Forecasting Team Building Variance Analysis Process Improvement Sarbanes-Oxley Act Financial Reporting Finance Skills  Accounting Management Financial Modeling Financial Analysis Auditing Cost Accounting Manufacturing Cross-functional Team... Forecasting Team Building Variance Analysis Process Improvement Sarbanes-Oxley Act Financial Reporting Finance Accounting Management Financial Modeling Financial Analysis Auditing Cost Accounting Manufacturing Cross-functional Team... Forecasting Team Building Variance Analysis Process Improvement Sarbanes-Oxley Act Financial Reporting Finance Accounting Management Financial Modeling Financial Analysis Auditing Cost Accounting Manufacturing Cross-functional Team... Forecasting Team Building Variance Analysis Process Improvement Sarbanes-Oxley Act Financial Reporting Finance ", "Summary People who know me say I am an articulate, initiative-taking, big-picture technologist who can discuss strategic issues with all levels and all organizations in a company. \n \nSpecialties: Finance, business strategy, product management, software engineering and both software & hardware technology trends/directions Summary People who know me say I am an articulate, initiative-taking, big-picture technologist who can discuss strategic issues with all levels and all organizations in a company. \n \nSpecialties: Finance, business strategy, product management, software engineering and both software & hardware technology trends/directions People who know me say I am an articulate, initiative-taking, big-picture technologist who can discuss strategic issues with all levels and all organizations in a company. \n \nSpecialties: Finance, business strategy, product management, software engineering and both software & hardware technology trends/directions People who know me say I am an articulate, initiative-taking, big-picture technologist who can discuss strategic issues with all levels and all organizations in a company. \n \nSpecialties: Finance, business strategy, product management, software engineering and both software & hardware technology trends/directions Experience Atom x3 (SoFIA) Phone & Tablet Operations Controller Intel Corporation March 2015  – Present (6 months) Santa Clara, California Controller for Intel's growing phone and tablet business driven by SoFIA architecture products, responsible for driving PnL improvements, pricing discussions, product profitability discussions, etc. Owner MF Software - iPhone Software Development 2008  – Present (7 years) Owner, developer and marketer of a variety of largely finance-related iPhone applications on the iTunes App Store. See the company website at http://www.mfsoftwareonline.com and it's sister site http://www.financeappreviews.com where iOS finance apps are reviewed weekly. Strategist, Executive Office Intel Corporation January 2014  –  February 2015  (1 year 2 months) On assignment to develop aspects of Intel's corporate strategy on behalf of and in consultation with both the CEO & President of Intel. Work includes overall company strategy/financials, technology industry direction-casting, potential M&A opportunities, industry risks & outcomes, organic growth imperatives, and make vs buy analysis. PC Client SW Finance Controller Intel Corporation September 2012  –  December 2013  (1 year 4 months) san francisco bay area * Manage a finance team supporting business strategy, budget, FP&A, & M&A for PC Client software (Android and Chrome on PCs), Real Sense technology (3D camera, voice & gesture recognition), and Intel's Experiences initiative Software & Services Group (SSG) Central Finance Controller, & Ultrabook Software Controller Intel Corporation June 2011  –  August 2012  (1 year 3 months) Manage the Central Finance/Consol team for the Software & Services Group at Intel. Manage a team of 6 responsible for quarterly/annual close process, budget cycles (FP&A), 10K/Q updates for the Software & Services Reportable Segment, etc. \n \nAlso manage the Ultrabook Software SSG/PCCG (PC Client Group) finance team chartered with defining appropriate strategy/investments in software that will differentiate Ultrabooks. Software & Services Group (SSG) Finance Strategic Projects Analyst Intel Corporation January 2011  –  June 2011  (6 months) The third of three 8-month rotations as a part of the Accelerated Leadership Program (ALP) at Intel. The ALP is a rotational general management program for top MBA graduates geared towards leadership development, with three eight-month rotations over two years. \n \n* Guided MeeGo developer support and tools plan \n* Developed new SSG R&D portfolio metrics and affordability framework Embedded and Communications Group (ECG) Finance Specialist, IAG Software Strategist Intel Corporation May 2010  –  December 2010  (8 months) The second of three 8-month rotations as a part of the Accelerated Leadership Program (ALP) at Intel.  \n \n* Co-managed ECG Portfolio/2011 Budgeting process, including extensive modeling and risk analysis of ECG's overall R&D spend \n* Co-developed and modeled financial impact of new software strategy for IAG (group encompasses most of Intel's revenue), designed to make software development at Intel \"World Class.\" Won a Finance Achievement Award, Intel's highest Finance accolade, for the effort. Mobile Extreme Edition (XE) Platform Analyst Intel Corporation August 2009  –  April 2010  (9 months) The first of three 8-month rotations as a part of the Accelerated Leadership Program (ALP) at Intel. See http://www.intel.com/jobs/usa/students/programs/mba.htm for more details. \n \n* Led a team to develop and begin execution on a business plan to grow high-end mobile CPU sales 2X by mid-2011, with specific tactics around customer support, product features, and marketing. \n* Designed and launched a new marketing pilot campaign for mobile Extreme Edition CPUs, generating multi-X ROI in its first quarter after launch. \n* Created and executed on gamer survey. Analysis of results resulted in team adjustments to go-to-market messaging and mobile XE feature planning. \n* Mobile XE sales data analysis, including analysis of customer concentration, market sizing, Average Selling Price (ASP), and SKU gaps (indicating need for new SKU). MBA Student NYU Stern School of Business August 2007  –  May 2009  (1 year 10 months) Specializations in Corporate Finance and Marketing Investment Banking Summer Associate JPMorgan Chase 2008  –  2008  (less than a year) •\tConstructed LBO model, reviewed coverage ratios, prepared sensitivity analysis and built pitch book on electronic payment services firm. \n•\tManaged multi-week sell-side process for media firm, including organizing, formatting & updating confidential information memorandum and valuation model. \n•\tBuilt cost-of-debt analysis and debt repayment schedule for proposed telecom acquisition that included several traunches of debt across multiple countries with multiple tax rates. \n•\tExecuted responsibilities including client visits/calls, trading comparables analysis, company profiles and analyst management. Developer Relations Software Evangelist Apple, Inc. January 2004  –  July 2007  (3 years 7 months) Helped key ISV partners adopt Apple Mac OS X technologies, with a special focus on developer tools, 64-bit technologies, and Cocoa, Apple's RAD development framework. \n \nAs an evangelist, pitched Apple technologies globally to CTOs at other software development companies, as well as to developers at conferences/seminars, resulting in Apple Developer Tools adoption by virtually all significant software products on the platform. \n \nDirected Apple's initiative to convert ISV software to be Intel-compatible on the Macintosh, successfully coordinating the transition process of the top 100 products on the platform. \n \nAlso, led (as one of 5 track managers) Apple's annual week-long WorldWide Developer's Conference (WWDC), with attendance over 4,000. Coordinated dozens of sessions and speakers, and ensured unified messaging. Developer Technical Support Engineer Apple Inc. June 2000  –  December 2003  (3 years 7 months) Designed software solutions to hard coding problems that third-party developers could not solve on their own. In conjunction with this, analyzed ISV software product architectures and provided recommendations for redesign/rewriting to adopt new paradigms. \n \nThis support then produced learnings that were incorporated into documentation and coding examples to explain Macintosh programming techniques, as well as technical accuracy reviews of Macintosh programming book drafts from major publishers. Atom x3 (SoFIA) Phone & Tablet Operations Controller Intel Corporation March 2015  – Present (6 months) Santa Clara, California Controller for Intel's growing phone and tablet business driven by SoFIA architecture products, responsible for driving PnL improvements, pricing discussions, product profitability discussions, etc. Atom x3 (SoFIA) Phone & Tablet Operations Controller Intel Corporation March 2015  – Present (6 months) Santa Clara, California Controller for Intel's growing phone and tablet business driven by SoFIA architecture products, responsible for driving PnL improvements, pricing discussions, product profitability discussions, etc. Owner MF Software - iPhone Software Development 2008  – Present (7 years) Owner, developer and marketer of a variety of largely finance-related iPhone applications on the iTunes App Store. See the company website at http://www.mfsoftwareonline.com and it's sister site http://www.financeappreviews.com where iOS finance apps are reviewed weekly. Owner MF Software - iPhone Software Development 2008  – Present (7 years) Owner, developer and marketer of a variety of largely finance-related iPhone applications on the iTunes App Store. See the company website at http://www.mfsoftwareonline.com and it's sister site http://www.financeappreviews.com where iOS finance apps are reviewed weekly. Strategist, Executive Office Intel Corporation January 2014  –  February 2015  (1 year 2 months) On assignment to develop aspects of Intel's corporate strategy on behalf of and in consultation with both the CEO & President of Intel. Work includes overall company strategy/financials, technology industry direction-casting, potential M&A opportunities, industry risks & outcomes, organic growth imperatives, and make vs buy analysis. Strategist, Executive Office Intel Corporation January 2014  –  February 2015  (1 year 2 months) On assignment to develop aspects of Intel's corporate strategy on behalf of and in consultation with both the CEO & President of Intel. Work includes overall company strategy/financials, technology industry direction-casting, potential M&A opportunities, industry risks & outcomes, organic growth imperatives, and make vs buy analysis. PC Client SW Finance Controller Intel Corporation September 2012  –  December 2013  (1 year 4 months) san francisco bay area * Manage a finance team supporting business strategy, budget, FP&A, & M&A for PC Client software (Android and Chrome on PCs), Real Sense technology (3D camera, voice & gesture recognition), and Intel's Experiences initiative PC Client SW Finance Controller Intel Corporation September 2012  –  December 2013  (1 year 4 months) san francisco bay area * Manage a finance team supporting business strategy, budget, FP&A, & M&A for PC Client software (Android and Chrome on PCs), Real Sense technology (3D camera, voice & gesture recognition), and Intel's Experiences initiative Software & Services Group (SSG) Central Finance Controller, & Ultrabook Software Controller Intel Corporation June 2011  –  August 2012  (1 year 3 months) Manage the Central Finance/Consol team for the Software & Services Group at Intel. Manage a team of 6 responsible for quarterly/annual close process, budget cycles (FP&A), 10K/Q updates for the Software & Services Reportable Segment, etc. \n \nAlso manage the Ultrabook Software SSG/PCCG (PC Client Group) finance team chartered with defining appropriate strategy/investments in software that will differentiate Ultrabooks. Software & Services Group (SSG) Central Finance Controller, & Ultrabook Software Controller Intel Corporation June 2011  –  August 2012  (1 year 3 months) Manage the Central Finance/Consol team for the Software & Services Group at Intel. Manage a team of 6 responsible for quarterly/annual close process, budget cycles (FP&A), 10K/Q updates for the Software & Services Reportable Segment, etc. \n \nAlso manage the Ultrabook Software SSG/PCCG (PC Client Group) finance team chartered with defining appropriate strategy/investments in software that will differentiate Ultrabooks. Software & Services Group (SSG) Finance Strategic Projects Analyst Intel Corporation January 2011  –  June 2011  (6 months) The third of three 8-month rotations as a part of the Accelerated Leadership Program (ALP) at Intel. The ALP is a rotational general management program for top MBA graduates geared towards leadership development, with three eight-month rotations over two years. \n \n* Guided MeeGo developer support and tools plan \n* Developed new SSG R&D portfolio metrics and affordability framework Software & Services Group (SSG) Finance Strategic Projects Analyst Intel Corporation January 2011  –  June 2011  (6 months) The third of three 8-month rotations as a part of the Accelerated Leadership Program (ALP) at Intel. The ALP is a rotational general management program for top MBA graduates geared towards leadership development, with three eight-month rotations over two years. \n \n* Guided MeeGo developer support and tools plan \n* Developed new SSG R&D portfolio metrics and affordability framework Embedded and Communications Group (ECG) Finance Specialist, IAG Software Strategist Intel Corporation May 2010  –  December 2010  (8 months) The second of three 8-month rotations as a part of the Accelerated Leadership Program (ALP) at Intel.  \n \n* Co-managed ECG Portfolio/2011 Budgeting process, including extensive modeling and risk analysis of ECG's overall R&D spend \n* Co-developed and modeled financial impact of new software strategy for IAG (group encompasses most of Intel's revenue), designed to make software development at Intel \"World Class.\" Won a Finance Achievement Award, Intel's highest Finance accolade, for the effort. Embedded and Communications Group (ECG) Finance Specialist, IAG Software Strategist Intel Corporation May 2010  –  December 2010  (8 months) The second of three 8-month rotations as a part of the Accelerated Leadership Program (ALP) at Intel.  \n \n* Co-managed ECG Portfolio/2011 Budgeting process, including extensive modeling and risk analysis of ECG's overall R&D spend \n* Co-developed and modeled financial impact of new software strategy for IAG (group encompasses most of Intel's revenue), designed to make software development at Intel \"World Class.\" Won a Finance Achievement Award, Intel's highest Finance accolade, for the effort. Mobile Extreme Edition (XE) Platform Analyst Intel Corporation August 2009  –  April 2010  (9 months) The first of three 8-month rotations as a part of the Accelerated Leadership Program (ALP) at Intel. See http://www.intel.com/jobs/usa/students/programs/mba.htm for more details. \n \n* Led a team to develop and begin execution on a business plan to grow high-end mobile CPU sales 2X by mid-2011, with specific tactics around customer support, product features, and marketing. \n* Designed and launched a new marketing pilot campaign for mobile Extreme Edition CPUs, generating multi-X ROI in its first quarter after launch. \n* Created and executed on gamer survey. Analysis of results resulted in team adjustments to go-to-market messaging and mobile XE feature planning. \n* Mobile XE sales data analysis, including analysis of customer concentration, market sizing, Average Selling Price (ASP), and SKU gaps (indicating need for new SKU). Mobile Extreme Edition (XE) Platform Analyst Intel Corporation August 2009  –  April 2010  (9 months) The first of three 8-month rotations as a part of the Accelerated Leadership Program (ALP) at Intel. See http://www.intel.com/jobs/usa/students/programs/mba.htm for more details. \n \n* Led a team to develop and begin execution on a business plan to grow high-end mobile CPU sales 2X by mid-2011, with specific tactics around customer support, product features, and marketing. \n* Designed and launched a new marketing pilot campaign for mobile Extreme Edition CPUs, generating multi-X ROI in its first quarter after launch. \n* Created and executed on gamer survey. Analysis of results resulted in team adjustments to go-to-market messaging and mobile XE feature planning. \n* Mobile XE sales data analysis, including analysis of customer concentration, market sizing, Average Selling Price (ASP), and SKU gaps (indicating need for new SKU). MBA Student NYU Stern School of Business August 2007  –  May 2009  (1 year 10 months) Specializations in Corporate Finance and Marketing MBA Student NYU Stern School of Business August 2007  –  May 2009  (1 year 10 months) Specializations in Corporate Finance and Marketing Investment Banking Summer Associate JPMorgan Chase 2008  –  2008  (less than a year) •\tConstructed LBO model, reviewed coverage ratios, prepared sensitivity analysis and built pitch book on electronic payment services firm. \n•\tManaged multi-week sell-side process for media firm, including organizing, formatting & updating confidential information memorandum and valuation model. \n•\tBuilt cost-of-debt analysis and debt repayment schedule for proposed telecom acquisition that included several traunches of debt across multiple countries with multiple tax rates. \n•\tExecuted responsibilities including client visits/calls, trading comparables analysis, company profiles and analyst management. Investment Banking Summer Associate JPMorgan Chase 2008  –  2008  (less than a year) •\tConstructed LBO model, reviewed coverage ratios, prepared sensitivity analysis and built pitch book on electronic payment services firm. \n•\tManaged multi-week sell-side process for media firm, including organizing, formatting & updating confidential information memorandum and valuation model. \n•\tBuilt cost-of-debt analysis and debt repayment schedule for proposed telecom acquisition that included several traunches of debt across multiple countries with multiple tax rates. \n•\tExecuted responsibilities including client visits/calls, trading comparables analysis, company profiles and analyst management. Developer Relations Software Evangelist Apple, Inc. January 2004  –  July 2007  (3 years 7 months) Helped key ISV partners adopt Apple Mac OS X technologies, with a special focus on developer tools, 64-bit technologies, and Cocoa, Apple's RAD development framework. \n \nAs an evangelist, pitched Apple technologies globally to CTOs at other software development companies, as well as to developers at conferences/seminars, resulting in Apple Developer Tools adoption by virtually all significant software products on the platform. \n \nDirected Apple's initiative to convert ISV software to be Intel-compatible on the Macintosh, successfully coordinating the transition process of the top 100 products on the platform. \n \nAlso, led (as one of 5 track managers) Apple's annual week-long WorldWide Developer's Conference (WWDC), with attendance over 4,000. Coordinated dozens of sessions and speakers, and ensured unified messaging. Developer Relations Software Evangelist Apple, Inc. January 2004  –  July 2007  (3 years 7 months) Helped key ISV partners adopt Apple Mac OS X technologies, with a special focus on developer tools, 64-bit technologies, and Cocoa, Apple's RAD development framework. \n \nAs an evangelist, pitched Apple technologies globally to CTOs at other software development companies, as well as to developers at conferences/seminars, resulting in Apple Developer Tools adoption by virtually all significant software products on the platform. \n \nDirected Apple's initiative to convert ISV software to be Intel-compatible on the Macintosh, successfully coordinating the transition process of the top 100 products on the platform. \n \nAlso, led (as one of 5 track managers) Apple's annual week-long WorldWide Developer's Conference (WWDC), with attendance over 4,000. Coordinated dozens of sessions and speakers, and ensured unified messaging. Developer Technical Support Engineer Apple Inc. June 2000  –  December 2003  (3 years 7 months) Designed software solutions to hard coding problems that third-party developers could not solve on their own. In conjunction with this, analyzed ISV software product architectures and provided recommendations for redesign/rewriting to adopt new paradigms. \n \nThis support then produced learnings that were incorporated into documentation and coding examples to explain Macintosh programming techniques, as well as technical accuracy reviews of Macintosh programming book drafts from major publishers. Developer Technical Support Engineer Apple Inc. June 2000  –  December 2003  (3 years 7 months) Designed software solutions to hard coding problems that third-party developers could not solve on their own. In conjunction with this, analyzed ISV software product architectures and provided recommendations for redesign/rewriting to adopt new paradigms. \n \nThis support then produced learnings that were incorporated into documentation and coding examples to explain Macintosh programming techniques, as well as technical accuracy reviews of Macintosh programming book drafts from major publishers. Skills Iphone development Apple Macintosh Objective-C Finance Product Marketing iOS development Mobile Devices Product Management Mac iPhone Business Strategy Xcode Mobile Applications Cocoa Strategy Go-to-market Strategy Software Development OS X Competitive Analysis Programming iOS Software Engineering Management Marketing Analysis Cross-functional Team... Start-ups See 12+     See less Skills  Iphone development Apple Macintosh Objective-C Finance Product Marketing iOS development Mobile Devices Product Management Mac iPhone Business Strategy Xcode Mobile Applications Cocoa Strategy Go-to-market Strategy Software Development OS X Competitive Analysis Programming iOS Software Engineering Management Marketing Analysis Cross-functional Team... Start-ups See 12+     See less Iphone development Apple Macintosh Objective-C Finance Product Marketing iOS development Mobile Devices Product Management Mac iPhone Business Strategy Xcode Mobile Applications Cocoa Strategy Go-to-market Strategy Software Development OS X Competitive Analysis Programming iOS Software Engineering Management Marketing Analysis Cross-functional Team... Start-ups See 12+     See less Iphone development Apple Macintosh Objective-C Finance Product Marketing iOS development Mobile Devices Product Management Mac iPhone Business Strategy Xcode Mobile Applications Cocoa Strategy Go-to-market Strategy Software Development OS X Competitive Analysis Programming iOS Software Engineering Management Marketing Analysis Cross-functional Team... Start-ups See 12+     See less ", "Skills Financial Analysis Forecasting Process Improvement Internal Controls Business Process... Budgeting Business Analysis Internal Audit Budgets Strategic Financial... Competitive Analysis Cross-functional Team... Financial Modeling Finance Management Analysis Financial Reporting Program Management Managerial Finance Sarbanes-Oxley Act Mergers & Acquisitions See 6+     See less Skills  Financial Analysis Forecasting Process Improvement Internal Controls Business Process... Budgeting Business Analysis Internal Audit Budgets Strategic Financial... Competitive Analysis Cross-functional Team... Financial Modeling Finance Management Analysis Financial Reporting Program Management Managerial Finance Sarbanes-Oxley Act Mergers & Acquisitions See 6+     See less Financial Analysis Forecasting Process Improvement Internal Controls Business Process... Budgeting Business Analysis Internal Audit Budgets Strategic Financial... Competitive Analysis Cross-functional Team... Financial Modeling Finance Management Analysis Financial Reporting Program Management Managerial Finance Sarbanes-Oxley Act Mergers & Acquisitions See 6+     See less Financial Analysis Forecasting Process Improvement Internal Controls Business Process... Budgeting Business Analysis Internal Audit Budgets Strategic Financial... Competitive Analysis Cross-functional Team... Financial Modeling Finance Management Analysis Financial Reporting Program Management Managerial Finance Sarbanes-Oxley Act Mergers & Acquisitions See 6+     See less ", "Experience VP Finance ESCO Corporation May 2013  – Present (2 years 4 months) Portland, Oregon Area Software & Services Group - Deals and Subsidiaries Controller Intel Corporation January 2011  –  April 2013  (2 years 4 months) Hillsboro, Oregon Systems Mfg. & Materials Controller Intel Corporation August 2007  –  December 2010  (3 years 5 months) Hillsboro, Oregon Directed financial support for engineering and supply chain services in support of Intel's board level products spanning from procurement to warranty/returns. EMEA Operations Finance Controller Intel Corp (UK) Ltd. 2005  –  2007  (2 years) Swindon, United Kingdom Directed operational finance support for the Europe, Middle East, and Africa sales and marketing region for Intel. EMEA Revenue Finance Controller Intel Corp (UK) Ltd. 2004  –  2005  (1 year) Swindon, United Kingdom Directed financial support for revenue growth strategies and execution for Intel's Europe, Middle East, and Africa sales region. Wafer Fabrication Factory Controller Intel Corporation 2001  –  2004  (3 years) Aloha, Oregon Directed financial operations for 3 of Intel's wafer fabrication factories. Intel Capital Finance Manager Intel Corporation 1998  –  2001  (3 years) Hillsboro, Oregon Mergers and Acquisitions support, from strategy through due diligence. Home Networking Operation Financial Specialist Intel Corporation 1997  –  1998  (1 year) Aloha, Oregon Full P&L financial support for start up consumer focused PC networking business within Intel. System Mfg. Commodity Mgmt. Sr. Financial Analyst Intel Corporation 1995  –  1997  (2 years) Hillsboro, Oregon Supply chain optimization and inventory management for the PC motherboard products manufactured in Intel's factories. Senior Consultant Peterson Consulting Ltd. Partnership 1991  –  1992  (1 year) Seattle, Washington Developed financial analytics and presentation materials in support of commercial litigation and dispute resolution. Staff Consultant Peterson Consulting Ltd. Partnership 1989  –  1991  (2 years) VP Finance ESCO Corporation May 2013  – Present (2 years 4 months) Portland, Oregon Area VP Finance ESCO Corporation May 2013  – Present (2 years 4 months) Portland, Oregon Area Software & Services Group - Deals and Subsidiaries Controller Intel Corporation January 2011  –  April 2013  (2 years 4 months) Hillsboro, Oregon Software & Services Group - Deals and Subsidiaries Controller Intel Corporation January 2011  –  April 2013  (2 years 4 months) Hillsboro, Oregon Systems Mfg. & Materials Controller Intel Corporation August 2007  –  December 2010  (3 years 5 months) Hillsboro, Oregon Directed financial support for engineering and supply chain services in support of Intel's board level products spanning from procurement to warranty/returns. Systems Mfg. & Materials Controller Intel Corporation August 2007  –  December 2010  (3 years 5 months) Hillsboro, Oregon Directed financial support for engineering and supply chain services in support of Intel's board level products spanning from procurement to warranty/returns. EMEA Operations Finance Controller Intel Corp (UK) Ltd. 2005  –  2007  (2 years) Swindon, United Kingdom Directed operational finance support for the Europe, Middle East, and Africa sales and marketing region for Intel. EMEA Operations Finance Controller Intel Corp (UK) Ltd. 2005  –  2007  (2 years) Swindon, United Kingdom Directed operational finance support for the Europe, Middle East, and Africa sales and marketing region for Intel. EMEA Revenue Finance Controller Intel Corp (UK) Ltd. 2004  –  2005  (1 year) Swindon, United Kingdom Directed financial support for revenue growth strategies and execution for Intel's Europe, Middle East, and Africa sales region. EMEA Revenue Finance Controller Intel Corp (UK) Ltd. 2004  –  2005  (1 year) Swindon, United Kingdom Directed financial support for revenue growth strategies and execution for Intel's Europe, Middle East, and Africa sales region. Wafer Fabrication Factory Controller Intel Corporation 2001  –  2004  (3 years) Aloha, Oregon Directed financial operations for 3 of Intel's wafer fabrication factories. Wafer Fabrication Factory Controller Intel Corporation 2001  –  2004  (3 years) Aloha, Oregon Directed financial operations for 3 of Intel's wafer fabrication factories. Intel Capital Finance Manager Intel Corporation 1998  –  2001  (3 years) Hillsboro, Oregon Mergers and Acquisitions support, from strategy through due diligence. Intel Capital Finance Manager Intel Corporation 1998  –  2001  (3 years) Hillsboro, Oregon Mergers and Acquisitions support, from strategy through due diligence. Home Networking Operation Financial Specialist Intel Corporation 1997  –  1998  (1 year) Aloha, Oregon Full P&L financial support for start up consumer focused PC networking business within Intel. Home Networking Operation Financial Specialist Intel Corporation 1997  –  1998  (1 year) Aloha, Oregon Full P&L financial support for start up consumer focused PC networking business within Intel. System Mfg. Commodity Mgmt. Sr. Financial Analyst Intel Corporation 1995  –  1997  (2 years) Hillsboro, Oregon Supply chain optimization and inventory management for the PC motherboard products manufactured in Intel's factories. System Mfg. Commodity Mgmt. Sr. Financial Analyst Intel Corporation 1995  –  1997  (2 years) Hillsboro, Oregon Supply chain optimization and inventory management for the PC motherboard products manufactured in Intel's factories. Senior Consultant Peterson Consulting Ltd. Partnership 1991  –  1992  (1 year) Seattle, Washington Developed financial analytics and presentation materials in support of commercial litigation and dispute resolution. Senior Consultant Peterson Consulting Ltd. Partnership 1991  –  1992  (1 year) Seattle, Washington Developed financial analytics and presentation materials in support of commercial litigation and dispute resolution. Staff Consultant Peterson Consulting Ltd. Partnership 1989  –  1991  (2 years) Staff Consultant Peterson Consulting Ltd. Partnership 1989  –  1991  (2 years) Skills Financial Analysis Strategy Intel Start-ups Mergers Supply Chain Mergers & Acquisitions Cross-functional Team... Manufacturing Procurement Skills  Financial Analysis Strategy Intel Start-ups Mergers Supply Chain Mergers & Acquisitions Cross-functional Team... Manufacturing Procurement Financial Analysis Strategy Intel Start-ups Mergers Supply Chain Mergers & Acquisitions Cross-functional Team... Manufacturing Procurement Financial Analysis Strategy Intel Start-ups Mergers Supply Chain Mergers & Acquisitions Cross-functional Team... Manufacturing Procurement Education Indiana University - Kelley School of Business MBA,  Finance ,  Marketing 1993  – 1995 University of Washington, Michael G. Foster School of Business BA,  Business Administration - Finance 1985  – 1989 Activities and Societies:  Team Manager ,  Men's Basketball Team McKay Indiana University - Kelley School of Business MBA,  Finance ,  Marketing 1993  – 1995 Indiana University - Kelley School of Business MBA,  Finance ,  Marketing 1993  – 1995 Indiana University - Kelley School of Business MBA,  Finance ,  Marketing 1993  – 1995 University of Washington, Michael G. Foster School of Business BA,  Business Administration - Finance 1985  – 1989 Activities and Societies:  Team Manager ,  Men's Basketball Team University of Washington, Michael G. Foster School of Business BA,  Business Administration - Finance 1985  – 1989 Activities and Societies:  Team Manager ,  Men's Basketball Team University of Washington, Michael G. Foster School of Business BA,  Business Administration - Finance 1985  – 1989 Activities and Societies:  Team Manager ,  Men's Basketball Team McKay McKay McKay ", "Summary Senior Financial Planning and Analysis leader focused on influencing the business using financial analysis, market and operational insights. Expert in all aspects of accounting, auditing and financial management. Direct experience with semiconductors, SaaS, PaaS, manufacturing, offshore strategies & global marketing strategies. \n \nAs a Central Controller for a $17B division within Intel with $2B of direct annual spending, I work across business units and to provide finance support in aligning revenue forecasting and resource allocation in support of business strategies. In addition, I am responsible for the oversight and leadership of our financial processes and fiduciary disclosures for our growing Datacenter business. \n \nSpecialties: Financial Planning & Analysis (FP&A), Financial Controls, International Experience, Customer Negotiations, Systems and Process Design, Marketing Investment Strategies and Professional Development. Summary Senior Financial Planning and Analysis leader focused on influencing the business using financial analysis, market and operational insights. Expert in all aspects of accounting, auditing and financial management. Direct experience with semiconductors, SaaS, PaaS, manufacturing, offshore strategies & global marketing strategies. \n \nAs a Central Controller for a $17B division within Intel with $2B of direct annual spending, I work across business units and to provide finance support in aligning revenue forecasting and resource allocation in support of business strategies. In addition, I am responsible for the oversight and leadership of our financial processes and fiduciary disclosures for our growing Datacenter business. \n \nSpecialties: Financial Planning & Analysis (FP&A), Financial Controls, International Experience, Customer Negotiations, Systems and Process Design, Marketing Investment Strategies and Professional Development. Senior Financial Planning and Analysis leader focused on influencing the business using financial analysis, market and operational insights. Expert in all aspects of accounting, auditing and financial management. Direct experience with semiconductors, SaaS, PaaS, manufacturing, offshore strategies & global marketing strategies. \n \nAs a Central Controller for a $17B division within Intel with $2B of direct annual spending, I work across business units and to provide finance support in aligning revenue forecasting and resource allocation in support of business strategies. In addition, I am responsible for the oversight and leadership of our financial processes and fiduciary disclosures for our growing Datacenter business. \n \nSpecialties: Financial Planning & Analysis (FP&A), Financial Controls, International Experience, Customer Negotiations, Systems and Process Design, Marketing Investment Strategies and Professional Development. Senior Financial Planning and Analysis leader focused on influencing the business using financial analysis, market and operational insights. Expert in all aspects of accounting, auditing and financial management. Direct experience with semiconductors, SaaS, PaaS, manufacturing, offshore strategies & global marketing strategies. \n \nAs a Central Controller for a $17B division within Intel with $2B of direct annual spending, I work across business units and to provide finance support in aligning revenue forecasting and resource allocation in support of business strategies. In addition, I am responsible for the oversight and leadership of our financial processes and fiduciary disclosures for our growing Datacenter business. \n \nSpecialties: Financial Planning & Analysis (FP&A), Financial Controls, International Experience, Customer Negotiations, Systems and Process Design, Marketing Investment Strategies and Professional Development. Experience Datacenter Group Central Controller Intel Corporation January 2012  – Present (3 years 8 months) Hillsboro, Oregon Responsible for Financial Planning and Analysis of Intel's $17B Server CPU business and related products spanning the Enterprise, Cloud, High Performance Computing and Networking business segments. Directly overseeing a an annual spending budget of ~$2.5B and over 6,000 employees. Global Marketing Strategy Controller Intel Corporation June 2010  –  January 2012  (1 year 8 months) Portland, Oregon and Santa Clara, California Financial optimization of marketing campaigns and consumer retail channels. \n \nResponsible for optimizing Intel’s $2B marketing investments by utilizing advanced analytics and performance measurement tools in influence investment decisions. Participated and lead strategic teams focused on key business initiatives and drove optimal investments considering product positioning, competition and market dynamics. Marketing Risk & Compliance Controller Intel Corporation April 2006  –  August 2010  (4 years 5 months) Hillsboro, Oregon Responsible for the financial operations and controls for the $1B Intel Inside Co-Marketing Program with over 3K participating licensees worldwide through international coordination, management and development of 65 finance professionals. Sr Finance Manager - Partner Marketing Group Intel Corporation May 2005  –  April 2006  (1 year) Manage financial, business and management infrastructure of a global co-marketing program to ensure compliance with terms & conditions, meet customer service level agreements, detect fraud and optimize marketing investment.  \n \nDrove a worldwide investigation involving program abuse which resulted in $15M savings in the first year. Overall risk mitigation measured at $75M annually. Sr Finance Manager - Americas Distribution Intel Corporation April 2001  –  May 2005  (4 years 2 months) Responsible for the financial operations of sales and marketing incentive programs for the North American distribution channel. My responsibilities included the design, implementation and review of numerous demand generation programs and the maintenance / enhancement of existing e-business tools including EDI, RosettaNet and SAP. Sr Treasury Accounting Analyst Intel Corporation February 1999  –  March 2001  (2 years 2 months) Maintained the accounts, analysis and financial reporting of 30 stand-alone legal entities which were established to protect corporate assets, effective cash management and minimize tax liabilities. \n \nMaintained the accounting and reporting of a $15B+ investment portfolio which consisted of marketable debt and equity securities, private equity investments and interest and foreign exchange hedging while maintaining compliance with advanced issues including mark-to-market, equity accounting, comprehensive income and impairment review. \n \nManaged the accounting, analysis and reporting of corporate equity including stock option/stock purchase plans, stock buyback plans, warrants and EPS. External Reporting Manager Wilshire Real Estate Investment Trust January 1998  –  January 1999  (1 year 1 month) Reviewed monthly results to determine propriety, investigating and resolving discrepancies. \n \nPrepared SEC compliance reports for two public registrants which included multiple filings including Form 10-K, 10-Q and 8-K. \n \nPreparation of multiple analyses for executive management including line of business profitability and NPV. Sr Financial Analyst PG&E Gas Transmission Northwest 1996  –  1998  (2 years) Portland, Oregon Area External reporting, financial analysis, maintaining operating budgets & foreign subsidiary consolidation. \n \n•\tCreated new variance analysis tools and drove $8M cost savings. \n•\tDesigned relational databases for reporting, analysis and international subsidiary consolidation. \n•\tDrafted & filed SEC reports 10-K, 10-Q & 8-K. Supervising Senior Auditor Talbot, Korvola & Warwick June 1993  –  September 1996  (3 years 4 months) Portland, Oregon Area I earned my CPA certification while serving audit clients from a wide variety of industries including forest products, construction, manufacturing and local governments. Datacenter Group Central Controller Intel Corporation January 2012  – Present (3 years 8 months) Hillsboro, Oregon Responsible for Financial Planning and Analysis of Intel's $17B Server CPU business and related products spanning the Enterprise, Cloud, High Performance Computing and Networking business segments. Directly overseeing a an annual spending budget of ~$2.5B and over 6,000 employees. Datacenter Group Central Controller Intel Corporation January 2012  – Present (3 years 8 months) Hillsboro, Oregon Responsible for Financial Planning and Analysis of Intel's $17B Server CPU business and related products spanning the Enterprise, Cloud, High Performance Computing and Networking business segments. Directly overseeing a an annual spending budget of ~$2.5B and over 6,000 employees. Global Marketing Strategy Controller Intel Corporation June 2010  –  January 2012  (1 year 8 months) Portland, Oregon and Santa Clara, California Financial optimization of marketing campaigns and consumer retail channels. \n \nResponsible for optimizing Intel’s $2B marketing investments by utilizing advanced analytics and performance measurement tools in influence investment decisions. Participated and lead strategic teams focused on key business initiatives and drove optimal investments considering product positioning, competition and market dynamics. Global Marketing Strategy Controller Intel Corporation June 2010  –  January 2012  (1 year 8 months) Portland, Oregon and Santa Clara, California Financial optimization of marketing campaigns and consumer retail channels. \n \nResponsible for optimizing Intel’s $2B marketing investments by utilizing advanced analytics and performance measurement tools in influence investment decisions. Participated and lead strategic teams focused on key business initiatives and drove optimal investments considering product positioning, competition and market dynamics. Marketing Risk & Compliance Controller Intel Corporation April 2006  –  August 2010  (4 years 5 months) Hillsboro, Oregon Responsible for the financial operations and controls for the $1B Intel Inside Co-Marketing Program with over 3K participating licensees worldwide through international coordination, management and development of 65 finance professionals. Marketing Risk & Compliance Controller Intel Corporation April 2006  –  August 2010  (4 years 5 months) Hillsboro, Oregon Responsible for the financial operations and controls for the $1B Intel Inside Co-Marketing Program with over 3K participating licensees worldwide through international coordination, management and development of 65 finance professionals. Sr Finance Manager - Partner Marketing Group Intel Corporation May 2005  –  April 2006  (1 year) Manage financial, business and management infrastructure of a global co-marketing program to ensure compliance with terms & conditions, meet customer service level agreements, detect fraud and optimize marketing investment.  \n \nDrove a worldwide investigation involving program abuse which resulted in $15M savings in the first year. Overall risk mitigation measured at $75M annually. Sr Finance Manager - Partner Marketing Group Intel Corporation May 2005  –  April 2006  (1 year) Manage financial, business and management infrastructure of a global co-marketing program to ensure compliance with terms & conditions, meet customer service level agreements, detect fraud and optimize marketing investment.  \n \nDrove a worldwide investigation involving program abuse which resulted in $15M savings in the first year. Overall risk mitigation measured at $75M annually. Sr Finance Manager - Americas Distribution Intel Corporation April 2001  –  May 2005  (4 years 2 months) Responsible for the financial operations of sales and marketing incentive programs for the North American distribution channel. My responsibilities included the design, implementation and review of numerous demand generation programs and the maintenance / enhancement of existing e-business tools including EDI, RosettaNet and SAP. Sr Finance Manager - Americas Distribution Intel Corporation April 2001  –  May 2005  (4 years 2 months) Responsible for the financial operations of sales and marketing incentive programs for the North American distribution channel. My responsibilities included the design, implementation and review of numerous demand generation programs and the maintenance / enhancement of existing e-business tools including EDI, RosettaNet and SAP. Sr Treasury Accounting Analyst Intel Corporation February 1999  –  March 2001  (2 years 2 months) Maintained the accounts, analysis and financial reporting of 30 stand-alone legal entities which were established to protect corporate assets, effective cash management and minimize tax liabilities. \n \nMaintained the accounting and reporting of a $15B+ investment portfolio which consisted of marketable debt and equity securities, private equity investments and interest and foreign exchange hedging while maintaining compliance with advanced issues including mark-to-market, equity accounting, comprehensive income and impairment review. \n \nManaged the accounting, analysis and reporting of corporate equity including stock option/stock purchase plans, stock buyback plans, warrants and EPS. Sr Treasury Accounting Analyst Intel Corporation February 1999  –  March 2001  (2 years 2 months) Maintained the accounts, analysis and financial reporting of 30 stand-alone legal entities which were established to protect corporate assets, effective cash management and minimize tax liabilities. \n \nMaintained the accounting and reporting of a $15B+ investment portfolio which consisted of marketable debt and equity securities, private equity investments and interest and foreign exchange hedging while maintaining compliance with advanced issues including mark-to-market, equity accounting, comprehensive income and impairment review. \n \nManaged the accounting, analysis and reporting of corporate equity including stock option/stock purchase plans, stock buyback plans, warrants and EPS. External Reporting Manager Wilshire Real Estate Investment Trust January 1998  –  January 1999  (1 year 1 month) Reviewed monthly results to determine propriety, investigating and resolving discrepancies. \n \nPrepared SEC compliance reports for two public registrants which included multiple filings including Form 10-K, 10-Q and 8-K. \n \nPreparation of multiple analyses for executive management including line of business profitability and NPV. External Reporting Manager Wilshire Real Estate Investment Trust January 1998  –  January 1999  (1 year 1 month) Reviewed monthly results to determine propriety, investigating and resolving discrepancies. \n \nPrepared SEC compliance reports for two public registrants which included multiple filings including Form 10-K, 10-Q and 8-K. \n \nPreparation of multiple analyses for executive management including line of business profitability and NPV. Sr Financial Analyst PG&E Gas Transmission Northwest 1996  –  1998  (2 years) Portland, Oregon Area External reporting, financial analysis, maintaining operating budgets & foreign subsidiary consolidation. \n \n•\tCreated new variance analysis tools and drove $8M cost savings. \n•\tDesigned relational databases for reporting, analysis and international subsidiary consolidation. \n•\tDrafted & filed SEC reports 10-K, 10-Q & 8-K. Sr Financial Analyst PG&E Gas Transmission Northwest 1996  –  1998  (2 years) Portland, Oregon Area External reporting, financial analysis, maintaining operating budgets & foreign subsidiary consolidation. \n \n•\tCreated new variance analysis tools and drove $8M cost savings. \n•\tDesigned relational databases for reporting, analysis and international subsidiary consolidation. \n•\tDrafted & filed SEC reports 10-K, 10-Q & 8-K. Supervising Senior Auditor Talbot, Korvola & Warwick June 1993  –  September 1996  (3 years 4 months) Portland, Oregon Area I earned my CPA certification while serving audit clients from a wide variety of industries including forest products, construction, manufacturing and local governments. Supervising Senior Auditor Talbot, Korvola & Warwick June 1993  –  September 1996  (3 years 4 months) Portland, Oregon Area I earned my CPA certification while serving audit clients from a wide variety of industries including forest products, construction, manufacturing and local governments. Skills Customer Negotiations Financial Management Accounting Compliance Strategic Financial... Marketing Strategy Social Media Development Co-marketing Management and Coaching Organizational... Cloud Computing Servers Computer Hardware Agency Negotiations Corporate FP&A Managerial Finance Management Negotiation Finance Variance Analysis Internal Controls Analysis Social Media Financial Analysis Cross-functional Team... Financial Reporting Strategy Financial Modeling Leadership See 14+     See less Skills  Customer Negotiations Financial Management Accounting Compliance Strategic Financial... Marketing Strategy Social Media Development Co-marketing Management and Coaching Organizational... Cloud Computing Servers Computer Hardware Agency Negotiations Corporate FP&A Managerial Finance Management Negotiation Finance Variance Analysis Internal Controls Analysis Social Media Financial Analysis Cross-functional Team... Financial Reporting Strategy Financial Modeling Leadership See 14+     See less Customer Negotiations Financial Management Accounting Compliance Strategic Financial... Marketing Strategy Social Media Development Co-marketing Management and Coaching Organizational... Cloud Computing Servers Computer Hardware Agency Negotiations Corporate FP&A Managerial Finance Management Negotiation Finance Variance Analysis Internal Controls Analysis Social Media Financial Analysis Cross-functional Team... Financial Reporting Strategy Financial Modeling Leadership See 14+     See less Customer Negotiations Financial Management Accounting Compliance Strategic Financial... Marketing Strategy Social Media Development Co-marketing Management and Coaching Organizational... Cloud Computing Servers Computer Hardware Agency Negotiations Corporate FP&A Managerial Finance Management Negotiation Finance Variance Analysis Internal Controls Analysis Social Media Financial Analysis Cross-functional Team... Financial Reporting Strategy Financial Modeling Leadership See 14+     See less Education Portland State University - School of Business Bachelor or Science,  Accounting 1989  – 1993 Portland State University - School of Business Bachelor or Science,  Accounting 1989  – 1993 Portland State University - School of Business Bachelor or Science,  Accounting 1989  – 1993 Portland State University - School of Business Bachelor or Science,  Accounting 1989  – 1993 Honors & Awards ", "Experience Financial Controller Intel Corporation April 2015  – Present (5 months) Hillsboro, OR Responsible for all aspects of financial controlling for the HR and Finance & Accounting (F&A) groups. For HR, this includes finance support of all Compensation & Benefits, Talent Acquisition, Learning & Development, Acquisition Integration and HR services. For F&A, this includes operations finance, accounting, treasury, tax, audit and investor relations.  Financial Controller Intel Corporation August 2012  –  April 2015  (2 years 9 months) Hillsboro, OR Responsible for all aspects of financial controlling for the customer engineering group which supports all client customer design and support issues, including all products and channels worldwide (Phone, Phablet, Tablet, PC). Financial Controller Intel Corporation December 2010  –  August 2012  (1 year 9 months) Munich Area, Germany Responsible for financial integration of Infineon's Wireless Division (IMC) into Intel after completion of acquisition. Partnered with senior management team of IMC in establishing and executing Intel's financial planning processes (forecast and actuals). Trained global finance team in use of Intel finance systems and processes. Sr. Finance Manager Intel Corporation August 2009  –  December 2010  (1 year 5 months) Hillsboro, Oregon Financial Planning & Analysis manager for Intel's Data Center Group, responsible for all short term financial planning processes and reporting. Sr. Finance Analyst Intel Corporation June 2004  –  August 2009  (5 years 3 months) Hillsboro, Oregon Jan'07 - Aug'09: Support manufacturing capacity planning, partnering with product divisions to influence design decisions that impact manufacturing investment. \n \nJan'05 - Jan'07: Support product planning and competitive roadmap analysis for Intel's server microprocessor business. Partner with planning, marketing, and engineering to develop a financially optimal roadmap. \n \nJun'04 - Jan'05: Drive the development of IT Financial Management processes such as product costing, chargeback, performance measurement systems, balanced scorecards, and benchmarking. Sr. Finance Analyst Visteon Corporation January 2003  –  June 2004  (1 year 6 months) Greater Detroit Area Business Planner Visteon Corporation June 2001  –  January 2003  (1 year 8 months) Greater Detroit Area Electrical Engineer Ford Motor Company January 1999  –  June 2001  (2 years 6 months) Greater Detroit Area Financial Controller Intel Corporation April 2015  – Present (5 months) Hillsboro, OR Responsible for all aspects of financial controlling for the HR and Finance & Accounting (F&A) groups. For HR, this includes finance support of all Compensation & Benefits, Talent Acquisition, Learning & Development, Acquisition Integration and HR services. For F&A, this includes operations finance, accounting, treasury, tax, audit and investor relations.  Financial Controller Intel Corporation April 2015  – Present (5 months) Hillsboro, OR Responsible for all aspects of financial controlling for the HR and Finance & Accounting (F&A) groups. For HR, this includes finance support of all Compensation & Benefits, Talent Acquisition, Learning & Development, Acquisition Integration and HR services. For F&A, this includes operations finance, accounting, treasury, tax, audit and investor relations.  Financial Controller Intel Corporation August 2012  –  April 2015  (2 years 9 months) Hillsboro, OR Responsible for all aspects of financial controlling for the customer engineering group which supports all client customer design and support issues, including all products and channels worldwide (Phone, Phablet, Tablet, PC). Financial Controller Intel Corporation August 2012  –  April 2015  (2 years 9 months) Hillsboro, OR Responsible for all aspects of financial controlling for the customer engineering group which supports all client customer design and support issues, including all products and channels worldwide (Phone, Phablet, Tablet, PC). Financial Controller Intel Corporation December 2010  –  August 2012  (1 year 9 months) Munich Area, Germany Responsible for financial integration of Infineon's Wireless Division (IMC) into Intel after completion of acquisition. Partnered with senior management team of IMC in establishing and executing Intel's financial planning processes (forecast and actuals). Trained global finance team in use of Intel finance systems and processes. Financial Controller Intel Corporation December 2010  –  August 2012  (1 year 9 months) Munich Area, Germany Responsible for financial integration of Infineon's Wireless Division (IMC) into Intel after completion of acquisition. Partnered with senior management team of IMC in establishing and executing Intel's financial planning processes (forecast and actuals). Trained global finance team in use of Intel finance systems and processes. Sr. Finance Manager Intel Corporation August 2009  –  December 2010  (1 year 5 months) Hillsboro, Oregon Financial Planning & Analysis manager for Intel's Data Center Group, responsible for all short term financial planning processes and reporting. Sr. Finance Manager Intel Corporation August 2009  –  December 2010  (1 year 5 months) Hillsboro, Oregon Financial Planning & Analysis manager for Intel's Data Center Group, responsible for all short term financial planning processes and reporting. Sr. Finance Analyst Intel Corporation June 2004  –  August 2009  (5 years 3 months) Hillsboro, Oregon Jan'07 - Aug'09: Support manufacturing capacity planning, partnering with product divisions to influence design decisions that impact manufacturing investment. \n \nJan'05 - Jan'07: Support product planning and competitive roadmap analysis for Intel's server microprocessor business. Partner with planning, marketing, and engineering to develop a financially optimal roadmap. \n \nJun'04 - Jan'05: Drive the development of IT Financial Management processes such as product costing, chargeback, performance measurement systems, balanced scorecards, and benchmarking. Sr. Finance Analyst Intel Corporation June 2004  –  August 2009  (5 years 3 months) Hillsboro, Oregon Jan'07 - Aug'09: Support manufacturing capacity planning, partnering with product divisions to influence design decisions that impact manufacturing investment. \n \nJan'05 - Jan'07: Support product planning and competitive roadmap analysis for Intel's server microprocessor business. Partner with planning, marketing, and engineering to develop a financially optimal roadmap. \n \nJun'04 - Jan'05: Drive the development of IT Financial Management processes such as product costing, chargeback, performance measurement systems, balanced scorecards, and benchmarking. Sr. Finance Analyst Visteon Corporation January 2003  –  June 2004  (1 year 6 months) Greater Detroit Area Sr. Finance Analyst Visteon Corporation January 2003  –  June 2004  (1 year 6 months) Greater Detroit Area Business Planner Visteon Corporation June 2001  –  January 2003  (1 year 8 months) Greater Detroit Area Business Planner Visteon Corporation June 2001  –  January 2003  (1 year 8 months) Greater Detroit Area Electrical Engineer Ford Motor Company January 1999  –  June 2001  (2 years 6 months) Greater Detroit Area Electrical Engineer Ford Motor Company January 1999  –  June 2001  (2 years 6 months) Greater Detroit Area Languages English Native or bilingual proficiency German Professional working proficiency English Native or bilingual proficiency German Professional working proficiency English Native or bilingual proficiency German Professional working proficiency Native or bilingual proficiency Professional working proficiency Skills Financial Modeling Cross-functional Team... Analysis Financial Analysis Project Planning Forecasting Finance Strategic Planning Mergers & Acquisitions Strategy Financial Planning Skills  Financial Modeling Cross-functional Team... Analysis Financial Analysis Project Planning Forecasting Finance Strategic Planning Mergers & Acquisitions Strategy Financial Planning Financial Modeling Cross-functional Team... Analysis Financial Analysis Project Planning Forecasting Finance Strategic Planning Mergers & Acquisitions Strategy Financial Planning Financial Modeling Cross-functional Team... Analysis Financial Analysis Project Planning Forecasting Finance Strategic Planning Mergers & Acquisitions Strategy Financial Planning Education University of Michigan MBA,  Finance January 2001  – May 2004 Brigham Young University BSEE,  Electrical Engineering 1992  – 1998 Minor in Mathematics University of Michigan MBA,  Finance January 2001  – May 2004 University of Michigan MBA,  Finance January 2001  – May 2004 University of Michigan MBA,  Finance January 2001  – May 2004 Brigham Young University BSEE,  Electrical Engineering 1992  – 1998 Minor in Mathematics Brigham Young University BSEE,  Electrical Engineering 1992  – 1998 Minor in Mathematics Brigham Young University BSEE,  Electrical Engineering 1992  – 1998 Minor in Mathematics ", "Skills Financial Modeling Financial Analysis Manufacturing Sarbanes-Oxley Act Accounting Forecasting Cross-functional Team... Strategic Planning Corporate Finance Revenue Recognition Management Business Strategy Finance Managerial Finance Competitive Analysis Financial Reporting Cost Accounting Internal Controls Mergers & Acquisitions Team Leadership Financial Forecasting See 6+     See less Skills  Financial Modeling Financial Analysis Manufacturing Sarbanes-Oxley Act Accounting Forecasting Cross-functional Team... Strategic Planning Corporate Finance Revenue Recognition Management Business Strategy Finance Managerial Finance Competitive Analysis Financial Reporting Cost Accounting Internal Controls Mergers & Acquisitions Team Leadership Financial Forecasting See 6+     See less Financial Modeling Financial Analysis Manufacturing Sarbanes-Oxley Act Accounting Forecasting Cross-functional Team... Strategic Planning Corporate Finance Revenue Recognition Management Business Strategy Finance Managerial Finance Competitive Analysis Financial Reporting Cost Accounting Internal Controls Mergers & Acquisitions Team Leadership Financial Forecasting See 6+     See less Financial Modeling Financial Analysis Manufacturing Sarbanes-Oxley Act Accounting Forecasting Cross-functional Team... Strategic Planning Corporate Finance Revenue Recognition Management Business Strategy Finance Managerial Finance Competitive Analysis Financial Reporting Cost Accounting Internal Controls Mergers & Acquisitions Team Leadership Financial Forecasting See 6+     See less ", "Skills Corporate Finance Financial Modeling Strategy Forecasting Financial Analysis Management Cross-functional Team... Budgets Analysis Leadership Finance Program Management Project Planning Competitive Analysis Process Improvement Financial Forecasting Mergers & Acquisitions Managerial Finance Financial Reporting Cost Accounting Variance Analysis Strategic Financial... Capital Budgeting Internal Controls Pricing Acquisition Integration Financial Planning Business Strategy Strategic Planning See 14+     See less Skills  Corporate Finance Financial Modeling Strategy Forecasting Financial Analysis Management Cross-functional Team... Budgets Analysis Leadership Finance Program Management Project Planning Competitive Analysis Process Improvement Financial Forecasting Mergers & Acquisitions Managerial Finance Financial Reporting Cost Accounting Variance Analysis Strategic Financial... Capital Budgeting Internal Controls Pricing Acquisition Integration Financial Planning Business Strategy Strategic Planning See 14+     See less Corporate Finance Financial Modeling Strategy Forecasting Financial Analysis Management Cross-functional Team... Budgets Analysis Leadership Finance Program Management Project Planning Competitive Analysis Process Improvement Financial Forecasting Mergers & Acquisitions Managerial Finance Financial Reporting Cost Accounting Variance Analysis Strategic Financial... Capital Budgeting Internal Controls Pricing Acquisition Integration Financial Planning Business Strategy Strategic Planning See 14+     See less Corporate Finance Financial Modeling Strategy Forecasting Financial Analysis Management Cross-functional Team... Budgets Analysis Leadership Finance Program Management Project Planning Competitive Analysis Process Improvement Financial Forecasting Mergers & Acquisitions Managerial Finance Financial Reporting Cost Accounting Variance Analysis Strategic Financial... Capital Budgeting Internal Controls Pricing Acquisition Integration Financial Planning Business Strategy Strategic Planning See 14+     See less ", "Skills Corporate Finance Financial Modeling Financial Forecasting Forecasting Financial Analysis Cross-functional Team... Business Process... Managerial Finance Sarbanes-Oxley Act Strategy Management Analysis Variance Analysis Business Strategy Pricing Internal Controls Leadership Accounting See 3+     See less Skills  Corporate Finance Financial Modeling Financial Forecasting Forecasting Financial Analysis Cross-functional Team... Business Process... Managerial Finance Sarbanes-Oxley Act Strategy Management Analysis Variance Analysis Business Strategy Pricing Internal Controls Leadership Accounting See 3+     See less Corporate Finance Financial Modeling Financial Forecasting Forecasting Financial Analysis Cross-functional Team... Business Process... Managerial Finance Sarbanes-Oxley Act Strategy Management Analysis Variance Analysis Business Strategy Pricing Internal Controls Leadership Accounting See 3+     See less Corporate Finance Financial Modeling Financial Forecasting Forecasting Financial Analysis Cross-functional Team... Business Process... Managerial Finance Sarbanes-Oxley Act Strategy Management Analysis Variance Analysis Business Strategy Pricing Internal Controls Leadership Accounting See 3+     See less ", "Experience Intel Architecture Group Controller Intel Corporation 2011  – Present (4 years) Sales & Marketing Controller Intel Corporation 2008  –  2011  (3 years) Consumer Electronics Controller Intel Corporation 2003  –  2008  (5 years) Systems Manufacturing Manager Intel Corporation 1999  –  2002  (3 years) Intel Architecture Group Controller Intel Corporation 2011  – Present (4 years) Intel Architecture Group Controller Intel Corporation 2011  – Present (4 years) Sales & Marketing Controller Intel Corporation 2008  –  2011  (3 years) Sales & Marketing Controller Intel Corporation 2008  –  2011  (3 years) Consumer Electronics Controller Intel Corporation 2003  –  2008  (5 years) Consumer Electronics Controller Intel Corporation 2003  –  2008  (5 years) Systems Manufacturing Manager Intel Corporation 1999  –  2002  (3 years) Systems Manufacturing Manager Intel Corporation 1999  –  2002  (3 years) Skills Cost Accounting Cross-functional Team... Financial Modeling Forecasting Financial Analysis Competitive Analysis Sarbanes-Oxley Act Skills  Cost Accounting Cross-functional Team... Financial Modeling Forecasting Financial Analysis Competitive Analysis Sarbanes-Oxley Act Cost Accounting Cross-functional Team... Financial Modeling Forecasting Financial Analysis Competitive Analysis Sarbanes-Oxley Act Cost Accounting Cross-functional Team... Financial Modeling Forecasting Financial Analysis Competitive Analysis Sarbanes-Oxley Act Education Washington State Board of Accountancy Certified Public Accountant University of Portland MBA,  Finance ,  Economics ,  Accounting 1997  – 1999 University of Washington, Michael G. Foster School of Business BA,  Finance ,  Economics 1993  – 1995 Washington State Board of Accountancy Certified Public Accountant Washington State Board of Accountancy Certified Public Accountant Washington State Board of Accountancy Certified Public Accountant University of Portland MBA,  Finance ,  Economics ,  Accounting 1997  – 1999 University of Portland MBA,  Finance ,  Economics ,  Accounting 1997  – 1999 University of Portland MBA,  Finance ,  Economics ,  Accounting 1997  – 1999 University of Washington, Michael G. Foster School of Business BA,  Finance ,  Economics 1993  – 1995 University of Washington, Michael G. Foster School of Business BA,  Finance ,  Economics 1993  – 1995 University of Washington, Michael G. Foster School of Business BA,  Finance ,  Economics 1993  – 1995 ", "Skills Financial Analysis Process Improvement Forecasting Cross-functional Team... Competitive Analysis Semiconductors Sarbanes-Oxley Act Financial Modeling Cost Accounting Analysis Corporate Finance Manufacturing Strategy Budgets Business Strategy Mergers Managerial Finance Strategic Financial... Business Planning Strategic Planning Financial Reporting Finance Business Process... Variance Analysis Executive Management Project Planning Pricing SAP NPV Financial Forecasting Revenue Recognition US GAAP JMP Accounting Internal Controls Acquisition Integration Sarbanes-Oxley Semiconductor Industry Capital Budgeting Program Management Start-ups Due Diligence Financial Audits Income Statement Decision Support Business Valuation Transfer Pricing Return on Investment P&L Management Internal Audit See 35+     See less Skills  Financial Analysis Process Improvement Forecasting Cross-functional Team... Competitive Analysis Semiconductors Sarbanes-Oxley Act Financial Modeling Cost Accounting Analysis Corporate Finance Manufacturing Strategy Budgets Business Strategy Mergers Managerial Finance Strategic Financial... Business Planning Strategic Planning Financial Reporting Finance Business Process... Variance Analysis Executive Management Project Planning Pricing SAP NPV Financial Forecasting Revenue Recognition US GAAP JMP Accounting Internal Controls Acquisition Integration Sarbanes-Oxley Semiconductor Industry Capital Budgeting Program Management Start-ups Due Diligence Financial Audits Income Statement Decision Support Business Valuation Transfer Pricing Return on Investment P&L Management Internal Audit See 35+     See less Financial Analysis Process Improvement Forecasting Cross-functional Team... Competitive Analysis Semiconductors Sarbanes-Oxley Act Financial Modeling Cost Accounting Analysis Corporate Finance Manufacturing Strategy Budgets Business Strategy Mergers Managerial Finance Strategic Financial... Business Planning Strategic Planning Financial Reporting Finance Business Process... Variance Analysis Executive Management Project Planning Pricing SAP NPV Financial Forecasting Revenue Recognition US GAAP JMP Accounting Internal Controls Acquisition Integration Sarbanes-Oxley Semiconductor Industry Capital Budgeting Program Management Start-ups Due Diligence Financial Audits Income Statement Decision Support Business Valuation Transfer Pricing Return on Investment P&L Management Internal Audit See 35+     See less Financial Analysis Process Improvement Forecasting Cross-functional Team... Competitive Analysis Semiconductors Sarbanes-Oxley Act Financial Modeling Cost Accounting Analysis Corporate Finance Manufacturing Strategy Budgets Business Strategy Mergers Managerial Finance Strategic Financial... Business Planning Strategic Planning Financial Reporting Finance Business Process... Variance Analysis Executive Management Project Planning Pricing SAP NPV Financial Forecasting Revenue Recognition US GAAP JMP Accounting Internal Controls Acquisition Integration Sarbanes-Oxley Semiconductor Industry Capital Budgeting Program Management Start-ups Due Diligence Financial Audits Income Statement Decision Support Business Valuation Transfer Pricing Return on Investment P&L Management Internal Audit See 35+     See less ", "Experience Assembly/Test Manufacturing Central & Strategic Capacity Planning Controller Intel Corporation June 2012  – Present (3 years 3 months) Chandler, AZ Drive all FP&A business processes associated with worldwide assembly/test manufacturing (short term/long term) and strategic analysis related to site selection and space/equipment capacity planning. Assembly/Test Technology Development & Corporate Quality Network Controller Intel Corporation May 2009  –  June 2012  (3 years 2 months) Chandler, AZ Led a team focused on all financial support (FP&A, affordability, strategic analysis) for sort, die prep, assembly and test technology development (manufacturing and materials) and quality for all of Intel's product families.  Packaging/Assembly Affordability Controller Intel March 2007  –  May 2009  (2 years 3 months) Chandler, Arizona Led a team focused on Package/Assembly cost optimization and managed the overall Package/Assembly/Test affordability process for all of Intel's silicon-based product lines. Fab 12 Controller Intel Corporation May 2004  –  March 2007  (2 years 11 months) Chandler, Az Responsible for all financial support (business process, strategic, cost reduction) for a high volume, leading edge, logic wafer manufacturing facility. Fab/Sort Manufacturing Central Controller Intel Corporation October 2002  –  May 2004  (1 year 8 months) Chandler, Az Drove financial consolidation and analysis of world-wide wafer manufacturing factory network. Controller - Network Processing Business Unit Intel Corporation August 1999  –  October 2002  (3 years 3 months) Chandler, Az Drove all financial processes (short/long range product planning, budgeting, etc.) and analysis (ZBB, resource allocation, feature selection, pricing, project NPV, etc.) for a silicon-based business focused on network processing logic devices. Assembly/Test Manufacturing Central & Strategic Capacity Planning Controller Intel Corporation June 2012  – Present (3 years 3 months) Chandler, AZ Drive all FP&A business processes associated with worldwide assembly/test manufacturing (short term/long term) and strategic analysis related to site selection and space/equipment capacity planning. Assembly/Test Manufacturing Central & Strategic Capacity Planning Controller Intel Corporation June 2012  – Present (3 years 3 months) Chandler, AZ Drive all FP&A business processes associated with worldwide assembly/test manufacturing (short term/long term) and strategic analysis related to site selection and space/equipment capacity planning. Assembly/Test Technology Development & Corporate Quality Network Controller Intel Corporation May 2009  –  June 2012  (3 years 2 months) Chandler, AZ Led a team focused on all financial support (FP&A, affordability, strategic analysis) for sort, die prep, assembly and test technology development (manufacturing and materials) and quality for all of Intel's product families.  Assembly/Test Technology Development & Corporate Quality Network Controller Intel Corporation May 2009  –  June 2012  (3 years 2 months) Chandler, AZ Led a team focused on all financial support (FP&A, affordability, strategic analysis) for sort, die prep, assembly and test technology development (manufacturing and materials) and quality for all of Intel's product families.  Packaging/Assembly Affordability Controller Intel March 2007  –  May 2009  (2 years 3 months) Chandler, Arizona Led a team focused on Package/Assembly cost optimization and managed the overall Package/Assembly/Test affordability process for all of Intel's silicon-based product lines. Packaging/Assembly Affordability Controller Intel March 2007  –  May 2009  (2 years 3 months) Chandler, Arizona Led a team focused on Package/Assembly cost optimization and managed the overall Package/Assembly/Test affordability process for all of Intel's silicon-based product lines. Fab 12 Controller Intel Corporation May 2004  –  March 2007  (2 years 11 months) Chandler, Az Responsible for all financial support (business process, strategic, cost reduction) for a high volume, leading edge, logic wafer manufacturing facility. Fab 12 Controller Intel Corporation May 2004  –  March 2007  (2 years 11 months) Chandler, Az Responsible for all financial support (business process, strategic, cost reduction) for a high volume, leading edge, logic wafer manufacturing facility. Fab/Sort Manufacturing Central Controller Intel Corporation October 2002  –  May 2004  (1 year 8 months) Chandler, Az Drove financial consolidation and analysis of world-wide wafer manufacturing factory network. Fab/Sort Manufacturing Central Controller Intel Corporation October 2002  –  May 2004  (1 year 8 months) Chandler, Az Drove financial consolidation and analysis of world-wide wafer manufacturing factory network. Controller - Network Processing Business Unit Intel Corporation August 1999  –  October 2002  (3 years 3 months) Chandler, Az Drove all financial processes (short/long range product planning, budgeting, etc.) and analysis (ZBB, resource allocation, feature selection, pricing, project NPV, etc.) for a silicon-based business focused on network processing logic devices. Controller - Network Processing Business Unit Intel Corporation August 1999  –  October 2002  (3 years 3 months) Chandler, Az Drove all financial processes (short/long range product planning, budgeting, etc.) and analysis (ZBB, resource allocation, feature selection, pricing, project NPV, etc.) for a silicon-based business focused on network processing logic devices. Skills Process Improvement Cross-functional Team... Financial Forecasting Semiconductors Business Strategy Analysis Financial Modeling Sarbanes-Oxley Act Forecasting Financial Analysis Strategic Planning Competitive Analysis Program Management Strategy Semiconductor Industry Corporate Finance See 1+     See less Skills  Process Improvement Cross-functional Team... Financial Forecasting Semiconductors Business Strategy Analysis Financial Modeling Sarbanes-Oxley Act Forecasting Financial Analysis Strategic Planning Competitive Analysis Program Management Strategy Semiconductor Industry Corporate Finance See 1+     See less Process Improvement Cross-functional Team... Financial Forecasting Semiconductors Business Strategy Analysis Financial Modeling Sarbanes-Oxley Act Forecasting Financial Analysis Strategic Planning Competitive Analysis Program Management Strategy Semiconductor Industry Corporate Finance See 1+     See less Process Improvement Cross-functional Team... Financial Forecasting Semiconductors Business Strategy Analysis Financial Modeling Sarbanes-Oxley Act Forecasting Financial Analysis Strategic Planning Competitive Analysis Program Management Strategy Semiconductor Industry Corporate Finance See 1+     See less Education Arizona State University Master of Business Administration (M.B.A.),  International Business , 4.0 GPA 1993  – 1995 Completed MBA in 20 months going to night school while working full time. Arizona State University Bachelor's Degree,  Finance , 3.8 (Summa Cum Laude) 1985  – 1989 Arizona State University Master of Business Administration (M.B.A.),  International Business , 4.0 GPA 1993  – 1995 Completed MBA in 20 months going to night school while working full time. Arizona State University Master of Business Administration (M.B.A.),  International Business , 4.0 GPA 1993  – 1995 Completed MBA in 20 months going to night school while working full time. Arizona State University Master of Business Administration (M.B.A.),  International Business , 4.0 GPA 1993  – 1995 Completed MBA in 20 months going to night school while working full time. Arizona State University Bachelor's Degree,  Finance , 3.8 (Summa Cum Laude) 1985  – 1989 Arizona State University Bachelor's Degree,  Finance , 3.8 (Summa Cum Laude) 1985  – 1989 Arizona State University Bachelor's Degree,  Finance , 3.8 (Summa Cum Laude) 1985  – 1989 Honors & Awards Intel Achievement Award Intel Corporation February 2015 Earned Intel's highest recognition for contributions towards manufacturing assembly/test benchmarking analysis and application to driving operational change/improvement to a worldwide organization. CFO Excellence Award Intel Corporation October 2014 Recognized with Intel Finance's highest achievement award for contributions toward repurposing a manufacturing site for a new technology and supporting breakthrough results in government incentive negotiations. Finance Achievement Award Intel Corporation September 2011 Received highest Intel Finance recognition (at the time) for driving adoption of a breakthrough substrate packaging technology for server logic devices. Intel Achievement Award Intel Corporation February 2015 Earned Intel's highest recognition for contributions towards manufacturing assembly/test benchmarking analysis and application to driving operational change/improvement to a worldwide organization. Intel Achievement Award Intel Corporation February 2015 Earned Intel's highest recognition for contributions towards manufacturing assembly/test benchmarking analysis and application to driving operational change/improvement to a worldwide organization. Intel Achievement Award Intel Corporation February 2015 Earned Intel's highest recognition for contributions towards manufacturing assembly/test benchmarking analysis and application to driving operational change/improvement to a worldwide organization. CFO Excellence Award Intel Corporation October 2014 Recognized with Intel Finance's highest achievement award for contributions toward repurposing a manufacturing site for a new technology and supporting breakthrough results in government incentive negotiations. CFO Excellence Award Intel Corporation October 2014 Recognized with Intel Finance's highest achievement award for contributions toward repurposing a manufacturing site for a new technology and supporting breakthrough results in government incentive negotiations. CFO Excellence Award Intel Corporation October 2014 Recognized with Intel Finance's highest achievement award for contributions toward repurposing a manufacturing site for a new technology and supporting breakthrough results in government incentive negotiations. Finance Achievement Award Intel Corporation September 2011 Received highest Intel Finance recognition (at the time) for driving adoption of a breakthrough substrate packaging technology for server logic devices. Finance Achievement Award Intel Corporation September 2011 Received highest Intel Finance recognition (at the time) for driving adoption of a breakthrough substrate packaging technology for server logic devices. Finance Achievement Award Intel Corporation September 2011 Received highest Intel Finance recognition (at the time) for driving adoption of a breakthrough substrate packaging technology for server logic devices. ", "Summary 1996 - Current: Intel Corporation \n2013 - Current: Director of Finance, Malaysia \n2010 - 2013: Malaysia Operations Finance Controller \n2007 - 2010: Asia Finance Controller - Construction \n2003 - 2007: Malaysia Operations Finance Controller \n2001 - 2003: Asia Internal Audit Manager - Singapore \n2000 - 2001: Philippines Operations Finance Controller \n1996 - 2000: Mfg Capital Equipment Mgr & Product Financial Analyst - Arizona, USA \n1994 - 1996: American Airlines Network Engineering Financial Analyst - Texas, USA \n1993 - 1994: Internal Revenue Service Budget Analyst - Kentucky, USA Summary 1996 - Current: Intel Corporation \n2013 - Current: Director of Finance, Malaysia \n2010 - 2013: Malaysia Operations Finance Controller \n2007 - 2010: Asia Finance Controller - Construction \n2003 - 2007: Malaysia Operations Finance Controller \n2001 - 2003: Asia Internal Audit Manager - Singapore \n2000 - 2001: Philippines Operations Finance Controller \n1996 - 2000: Mfg Capital Equipment Mgr & Product Financial Analyst - Arizona, USA \n1994 - 1996: American Airlines Network Engineering Financial Analyst - Texas, USA \n1993 - 1994: Internal Revenue Service Budget Analyst - Kentucky, USA 1996 - Current: Intel Corporation \n2013 - Current: Director of Finance, Malaysia \n2010 - 2013: Malaysia Operations Finance Controller \n2007 - 2010: Asia Finance Controller - Construction \n2003 - 2007: Malaysia Operations Finance Controller \n2001 - 2003: Asia Internal Audit Manager - Singapore \n2000 - 2001: Philippines Operations Finance Controller \n1996 - 2000: Mfg Capital Equipment Mgr & Product Financial Analyst - Arizona, USA \n1994 - 1996: American Airlines Network Engineering Financial Analyst - Texas, USA \n1993 - 1994: Internal Revenue Service Budget Analyst - Kentucky, USA 1996 - Current: Intel Corporation \n2013 - Current: Director of Finance, Malaysia \n2010 - 2013: Malaysia Operations Finance Controller \n2007 - 2010: Asia Finance Controller - Construction \n2003 - 2007: Malaysia Operations Finance Controller \n2001 - 2003: Asia Internal Audit Manager - Singapore \n2000 - 2001: Philippines Operations Finance Controller \n1996 - 2000: Mfg Capital Equipment Mgr & Product Financial Analyst - Arizona, USA \n1994 - 1996: American Airlines Network Engineering Financial Analyst - Texas, USA \n1993 - 1994: Internal Revenue Service Budget Analyst - Kentucky, USA Experience Director of Finance Intel Corporation November 2013  – Present (1 year 10 months) Penang Malaysia Malaysia Operations Finance Controller Intel Corporation November 2010  –  November 2013  (3 years 1 month) Asia Finance Controller - Facility Construction Intel Corporation March 2007  –  November 2010  (3 years 9 months) Malaysia Malaysia Operations Finance Controller Intel Corporation June 2003  –  March 2007  (3 years 10 months) Asia Internal Audit Manager Intel Corporation March 2001  –  June 2003  (2 years 4 months) Singapore Based in Singapore Philippines Operations Finance Controller Intel Corporation 2000  –  2001  (1 year) Philippines Director of Finance Intel Corporation November 2013  – Present (1 year 10 months) Penang Malaysia Director of Finance Intel Corporation November 2013  – Present (1 year 10 months) Penang Malaysia Malaysia Operations Finance Controller Intel Corporation November 2010  –  November 2013  (3 years 1 month) Malaysia Operations Finance Controller Intel Corporation November 2010  –  November 2013  (3 years 1 month) Asia Finance Controller - Facility Construction Intel Corporation March 2007  –  November 2010  (3 years 9 months) Malaysia Asia Finance Controller - Facility Construction Intel Corporation March 2007  –  November 2010  (3 years 9 months) Malaysia Malaysia Operations Finance Controller Intel Corporation June 2003  –  March 2007  (3 years 10 months) Malaysia Operations Finance Controller Intel Corporation June 2003  –  March 2007  (3 years 10 months) Asia Internal Audit Manager Intel Corporation March 2001  –  June 2003  (2 years 4 months) Singapore Based in Singapore Asia Internal Audit Manager Intel Corporation March 2001  –  June 2003  (2 years 4 months) Singapore Based in Singapore Philippines Operations Finance Controller Intel Corporation 2000  –  2001  (1 year) Philippines Philippines Operations Finance Controller Intel Corporation 2000  –  2001  (1 year) Philippines Education Northern Kentucky University Bachelor of Science,  Finance & Economics 1990  – 1994 University of Cincinnati 1990  – 1991 King's College London, U. of London Study Abroad Certificate,  International Finance Northern Kentucky University Bachelor of Science,  Finance & Economics 1990  – 1994 Northern Kentucky University Bachelor of Science,  Finance & Economics 1990  – 1994 Northern Kentucky University Bachelor of Science,  Finance & Economics 1990  – 1994 University of Cincinnati 1990  – 1991 University of Cincinnati 1990  – 1991 University of Cincinnati 1990  – 1991 King's College London, U. of London Study Abroad Certificate,  International Finance King's College London, U. of London Study Abroad Certificate,  International Finance King's College London, U. of London Study Abroad Certificate,  International Finance ", "Summary I am a seasoned 20-year high tech industry finance professional with work experience spanning across multiple continents (Asia, North America, Central/South America) and functions (supply chain, factory operation, shared services center, sales and marketing, trade, tax, internal controls and corporate planning). \n \nI have a proven track record in developing global talent and building a strong and high-performing organization. I invest time to hire the right talents, integrate them into the organization and ensure they are being provided with challenging goals/projects to grow professionally. I have deep experience in developing an effective and collaborative organization to deliver optimal business results. I devote regular time with my staff to assess organization design to ensure right talent and resources are being deployed at the right place and right time. One of my first assessments in any new role is to evaluate opportunity to remove silo-mindset and create natural engagement touch-points for collaboration. I work on creating common, stretched goals that teams can partner to achieve and review team goals regularly to minimize conflicting goals. \n \nAs a leader, I believe in empowering the organization to achieve great things. I also believe that individual motivation is one key lever to propel organization to achieve the next level of performance. Allowing each employee the opportunity to master their work, creating shared vision and greater purpose in their work and empowerment will lead to a different level of organization performance. With empowerment, comes responsibility and accountability. I am firm in managing job performance to ensure performance tension. \n \nMy experience spent in three different continents provides me with unique perspective and ability to assess market trend. I constantly challenge my organization to explore ways to develop leading indicators for the business so that we can proactively manage the business better. Summary I am a seasoned 20-year high tech industry finance professional with work experience spanning across multiple continents (Asia, North America, Central/South America) and functions (supply chain, factory operation, shared services center, sales and marketing, trade, tax, internal controls and corporate planning). \n \nI have a proven track record in developing global talent and building a strong and high-performing organization. I invest time to hire the right talents, integrate them into the organization and ensure they are being provided with challenging goals/projects to grow professionally. I have deep experience in developing an effective and collaborative organization to deliver optimal business results. I devote regular time with my staff to assess organization design to ensure right talent and resources are being deployed at the right place and right time. One of my first assessments in any new role is to evaluate opportunity to remove silo-mindset and create natural engagement touch-points for collaboration. I work on creating common, stretched goals that teams can partner to achieve and review team goals regularly to minimize conflicting goals. \n \nAs a leader, I believe in empowering the organization to achieve great things. I also believe that individual motivation is one key lever to propel organization to achieve the next level of performance. Allowing each employee the opportunity to master their work, creating shared vision and greater purpose in their work and empowerment will lead to a different level of organization performance. With empowerment, comes responsibility and accountability. I am firm in managing job performance to ensure performance tension. \n \nMy experience spent in three different continents provides me with unique perspective and ability to assess market trend. I constantly challenge my organization to explore ways to develop leading indicators for the business so that we can proactively manage the business better. I am a seasoned 20-year high tech industry finance professional with work experience spanning across multiple continents (Asia, North America, Central/South America) and functions (supply chain, factory operation, shared services center, sales and marketing, trade, tax, internal controls and corporate planning). \n \nI have a proven track record in developing global talent and building a strong and high-performing organization. I invest time to hire the right talents, integrate them into the organization and ensure they are being provided with challenging goals/projects to grow professionally. I have deep experience in developing an effective and collaborative organization to deliver optimal business results. I devote regular time with my staff to assess organization design to ensure right talent and resources are being deployed at the right place and right time. One of my first assessments in any new role is to evaluate opportunity to remove silo-mindset and create natural engagement touch-points for collaboration. I work on creating common, stretched goals that teams can partner to achieve and review team goals regularly to minimize conflicting goals. \n \nAs a leader, I believe in empowering the organization to achieve great things. I also believe that individual motivation is one key lever to propel organization to achieve the next level of performance. Allowing each employee the opportunity to master their work, creating shared vision and greater purpose in their work and empowerment will lead to a different level of organization performance. With empowerment, comes responsibility and accountability. I am firm in managing job performance to ensure performance tension. \n \nMy experience spent in three different continents provides me with unique perspective and ability to assess market trend. I constantly challenge my organization to explore ways to develop leading indicators for the business so that we can proactively manage the business better. I am a seasoned 20-year high tech industry finance professional with work experience spanning across multiple continents (Asia, North America, Central/South America) and functions (supply chain, factory operation, shared services center, sales and marketing, trade, tax, internal controls and corporate planning). \n \nI have a proven track record in developing global talent and building a strong and high-performing organization. I invest time to hire the right talents, integrate them into the organization and ensure they are being provided with challenging goals/projects to grow professionally. I have deep experience in developing an effective and collaborative organization to deliver optimal business results. I devote regular time with my staff to assess organization design to ensure right talent and resources are being deployed at the right place and right time. One of my first assessments in any new role is to evaluate opportunity to remove silo-mindset and create natural engagement touch-points for collaboration. I work on creating common, stretched goals that teams can partner to achieve and review team goals regularly to minimize conflicting goals. \n \nAs a leader, I believe in empowering the organization to achieve great things. I also believe that individual motivation is one key lever to propel organization to achieve the next level of performance. Allowing each employee the opportunity to master their work, creating shared vision and greater purpose in their work and empowerment will lead to a different level of organization performance. With empowerment, comes responsibility and accountability. I am firm in managing job performance to ensure performance tension. \n \nMy experience spent in three different continents provides me with unique perspective and ability to assess market trend. I constantly challenge my organization to explore ways to develop leading indicators for the business so that we can proactively manage the business better. Experience Finance Director/Senior Controller - APAC & Japan Revenue and Strategy Intel Corporation March 2013  – Present (2 years 6 months) Hong Kong * Manages a team of 50 finance professionals spanning across 6 countries in Asia with responsibility to drive revenue growth for the company \n* Partners closely with Marketing team to ensure effective ATL/BTL programs are rolled out, analyze and drive effective retail strategy with right level of investment \n* Works closely with business partners to help influence ODM strategy, influences product roadmap to ensure right design landing zone, devise effective go to market (GTM) strategy \n* Responsible to drive new growth strategy for the company in new areas beyond the traditional line of business by leveraging marketing research, building new market model and deploying advanced modelling \n \n Finance Director - Site and Americas Shared Services Center Intel Corporation February 2010  –  March 2013  (3 years 2 months) San Jose, Costa Rica • Managed Costa Rica Finance organization with ~200 finance employees \n• Responsible for Finance Shared Service Center (FSSC) operations that cover AP/AR/LE/Accounting for the Americas (North America, Central and South America), Risks and Controls, Factory Cost and Capital, Global Tax and Trade. \n• Partnerd closely with General Manager to ensure site is operating to support company overall strategy Mobility Group (MG) Central Controller Intel Corporation February 2008  –  February 2010  (2 years 1 month) Santa Clara, California, USA • Managed a group of 7 finance employees and pivotal in helping the Mobility GM/EVP and MG Group Controller in managing MG’s business \n• Responsible for running all MG financial planning and analysis processes, including quarter-end close, 10Q/10K process, annual forecast, capital and long-term forecasts (PLBP/SLRP). \n• Other responsibilities included leading MG global site strategy, driving cross group engineering resources analysis Kulim Boards and Systems Controller Intel Corporation 2006  –  2008  (2 years) Asia Materials and Purchasing Controller Intel Corporation 2004  –  2006  (2 years) APAC Home and Small Business Planning and Reporting Manager Dell Asia Pacific Sdn 1998  –  2000  (2 years) Finance Director/Senior Controller - APAC & Japan Revenue and Strategy Intel Corporation March 2013  – Present (2 years 6 months) Hong Kong * Manages a team of 50 finance professionals spanning across 6 countries in Asia with responsibility to drive revenue growth for the company \n* Partners closely with Marketing team to ensure effective ATL/BTL programs are rolled out, analyze and drive effective retail strategy with right level of investment \n* Works closely with business partners to help influence ODM strategy, influences product roadmap to ensure right design landing zone, devise effective go to market (GTM) strategy \n* Responsible to drive new growth strategy for the company in new areas beyond the traditional line of business by leveraging marketing research, building new market model and deploying advanced modelling \n \n Finance Director/Senior Controller - APAC & Japan Revenue and Strategy Intel Corporation March 2013  – Present (2 years 6 months) Hong Kong * Manages a team of 50 finance professionals spanning across 6 countries in Asia with responsibility to drive revenue growth for the company \n* Partners closely with Marketing team to ensure effective ATL/BTL programs are rolled out, analyze and drive effective retail strategy with right level of investment \n* Works closely with business partners to help influence ODM strategy, influences product roadmap to ensure right design landing zone, devise effective go to market (GTM) strategy \n* Responsible to drive new growth strategy for the company in new areas beyond the traditional line of business by leveraging marketing research, building new market model and deploying advanced modelling \n \n Finance Director - Site and Americas Shared Services Center Intel Corporation February 2010  –  March 2013  (3 years 2 months) San Jose, Costa Rica • Managed Costa Rica Finance organization with ~200 finance employees \n• Responsible for Finance Shared Service Center (FSSC) operations that cover AP/AR/LE/Accounting for the Americas (North America, Central and South America), Risks and Controls, Factory Cost and Capital, Global Tax and Trade. \n• Partnerd closely with General Manager to ensure site is operating to support company overall strategy Finance Director - Site and Americas Shared Services Center Intel Corporation February 2010  –  March 2013  (3 years 2 months) San Jose, Costa Rica • Managed Costa Rica Finance organization with ~200 finance employees \n• Responsible for Finance Shared Service Center (FSSC) operations that cover AP/AR/LE/Accounting for the Americas (North America, Central and South America), Risks and Controls, Factory Cost and Capital, Global Tax and Trade. \n• Partnerd closely with General Manager to ensure site is operating to support company overall strategy Mobility Group (MG) Central Controller Intel Corporation February 2008  –  February 2010  (2 years 1 month) Santa Clara, California, USA • Managed a group of 7 finance employees and pivotal in helping the Mobility GM/EVP and MG Group Controller in managing MG’s business \n• Responsible for running all MG financial planning and analysis processes, including quarter-end close, 10Q/10K process, annual forecast, capital and long-term forecasts (PLBP/SLRP). \n• Other responsibilities included leading MG global site strategy, driving cross group engineering resources analysis Mobility Group (MG) Central Controller Intel Corporation February 2008  –  February 2010  (2 years 1 month) Santa Clara, California, USA • Managed a group of 7 finance employees and pivotal in helping the Mobility GM/EVP and MG Group Controller in managing MG’s business \n• Responsible for running all MG financial planning and analysis processes, including quarter-end close, 10Q/10K process, annual forecast, capital and long-term forecasts (PLBP/SLRP). \n• Other responsibilities included leading MG global site strategy, driving cross group engineering resources analysis Kulim Boards and Systems Controller Intel Corporation 2006  –  2008  (2 years) Kulim Boards and Systems Controller Intel Corporation 2006  –  2008  (2 years) Asia Materials and Purchasing Controller Intel Corporation 2004  –  2006  (2 years) Asia Materials and Purchasing Controller Intel Corporation 2004  –  2006  (2 years) APAC Home and Small Business Planning and Reporting Manager Dell Asia Pacific Sdn 1998  –  2000  (2 years) APAC Home and Small Business Planning and Reporting Manager Dell Asia Pacific Sdn 1998  –  2000  (2 years) Languages English Full professional proficiency Mandarin Native or bilingual proficiency Bahasa Native or bilingual proficiency English Full professional proficiency Mandarin Native or bilingual proficiency Bahasa Native or bilingual proficiency English Full professional proficiency Mandarin Native or bilingual proficiency Bahasa Native or bilingual proficiency Full professional proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Supply Chain Management Supply Chain Process Improvement Financial Analysis Project Management Program Management Forecasting Business Strategy Cross-functional Team... SAP Strategy Skills  Supply Chain Management Supply Chain Process Improvement Financial Analysis Project Management Program Management Forecasting Business Strategy Cross-functional Team... SAP Strategy Supply Chain Management Supply Chain Process Improvement Financial Analysis Project Management Program Management Forecasting Business Strategy Cross-functional Team... SAP Strategy Supply Chain Management Supply Chain Process Improvement Financial Analysis Project Management Program Management Forecasting Business Strategy Cross-functional Team... SAP Strategy ", "Skills Financial Analysis Marketing Corporate Finance Forecasting Start-ups Strategic Financial... Competitive Analysis Cross-functional Team... Skills  Financial Analysis Marketing Corporate Finance Forecasting Start-ups Strategic Financial... Competitive Analysis Cross-functional Team... Financial Analysis Marketing Corporate Finance Forecasting Start-ups Strategic Financial... Competitive Analysis Cross-functional Team... Financial Analysis Marketing Corporate Finance Forecasting Start-ups Strategic Financial... Competitive Analysis Cross-functional Team... ", "Experience Technology Deveolpment Sr Controller Intel Corporation October 2014  – Present (11 months) Full financial responsibility for finance team supporting extremely large R&D, Manufacturing, and Quallity assurance organization tasked with delivering the technology and manufacturing excellence to support global company revenues. Team covers strategy and all financial responsibilities including investment, cost, revenue, financial planning and reporting, and M&A. Seasoned manager of managers and manager of large organizations. Accomplished developer of leaders and a passionate leadership trainer. 20+ years of global travel and living abroad experience. Press certified spokesperson with global media and multiple government contracting experiences. Intelligent Systems Group Controller Intel Corporation 2011  – Present (4 years) Corporate Finance Director and Sr Business Group Controller. \nFull financial accountability for large business group encompassing 25+ embedded market segments, multi-billion dollar enterprise, covering all financial responsibilities, investment, cost, revenue, budgeting and planning, and M&A. Seasoned manager of managers and manager of large organizations. Accomplished developer of leaders and a passionate leadership trainer. 20+ years of global travel and living abroad experience. Press certified spokesperson with global media and government experience. Embedded Microprocessor Divisions Controller Intel August 2007  –  February 2011  (3 years 7 months) Manage a multi-level, full function Operations Finance Organization supporting multiple divisions from a P&L, Cost, Product Investment, and Strategic Support perspective. $2.5B+ P&L, high mix, low volume, extended life (7-10 years) business. Global Indirect Materials Controller Intel October 2004  –  July 2007  (2 years 10 months) Managed mulit-level global team supporting contract negotiations in $6B in Indirect Materials spending including Construction, IT, Transportation and Freight, Advertising and Marketing, Facility Services, Travel, and Employee Benefits. Contracts covered business in 56 countries. Technology Deveolpment Sr Controller Intel Corporation October 2014  – Present (11 months) Full financial responsibility for finance team supporting extremely large R&D, Manufacturing, and Quallity assurance organization tasked with delivering the technology and manufacturing excellence to support global company revenues. Team covers strategy and all financial responsibilities including investment, cost, revenue, financial planning and reporting, and M&A. Seasoned manager of managers and manager of large organizations. Accomplished developer of leaders and a passionate leadership trainer. 20+ years of global travel and living abroad experience. Press certified spokesperson with global media and multiple government contracting experiences. Technology Deveolpment Sr Controller Intel Corporation October 2014  – Present (11 months) Full financial responsibility for finance team supporting extremely large R&D, Manufacturing, and Quallity assurance organization tasked with delivering the technology and manufacturing excellence to support global company revenues. Team covers strategy and all financial responsibilities including investment, cost, revenue, financial planning and reporting, and M&A. Seasoned manager of managers and manager of large organizations. Accomplished developer of leaders and a passionate leadership trainer. 20+ years of global travel and living abroad experience. Press certified spokesperson with global media and multiple government contracting experiences. Intelligent Systems Group Controller Intel Corporation 2011  – Present (4 years) Corporate Finance Director and Sr Business Group Controller. \nFull financial accountability for large business group encompassing 25+ embedded market segments, multi-billion dollar enterprise, covering all financial responsibilities, investment, cost, revenue, budgeting and planning, and M&A. Seasoned manager of managers and manager of large organizations. Accomplished developer of leaders and a passionate leadership trainer. 20+ years of global travel and living abroad experience. Press certified spokesperson with global media and government experience. Intelligent Systems Group Controller Intel Corporation 2011  – Present (4 years) Corporate Finance Director and Sr Business Group Controller. \nFull financial accountability for large business group encompassing 25+ embedded market segments, multi-billion dollar enterprise, covering all financial responsibilities, investment, cost, revenue, budgeting and planning, and M&A. Seasoned manager of managers and manager of large organizations. Accomplished developer of leaders and a passionate leadership trainer. 20+ years of global travel and living abroad experience. Press certified spokesperson with global media and government experience. Embedded Microprocessor Divisions Controller Intel August 2007  –  February 2011  (3 years 7 months) Manage a multi-level, full function Operations Finance Organization supporting multiple divisions from a P&L, Cost, Product Investment, and Strategic Support perspective. $2.5B+ P&L, high mix, low volume, extended life (7-10 years) business. Embedded Microprocessor Divisions Controller Intel August 2007  –  February 2011  (3 years 7 months) Manage a multi-level, full function Operations Finance Organization supporting multiple divisions from a P&L, Cost, Product Investment, and Strategic Support perspective. $2.5B+ P&L, high mix, low volume, extended life (7-10 years) business. Global Indirect Materials Controller Intel October 2004  –  July 2007  (2 years 10 months) Managed mulit-level global team supporting contract negotiations in $6B in Indirect Materials spending including Construction, IT, Transportation and Freight, Advertising and Marketing, Facility Services, Travel, and Employee Benefits. Contracts covered business in 56 countries. Global Indirect Materials Controller Intel October 2004  –  July 2007  (2 years 10 months) Managed mulit-level global team supporting contract negotiations in $6B in Indirect Materials spending including Construction, IT, Transportation and Freight, Advertising and Marketing, Facility Services, Travel, and Employee Benefits. Contracts covered business in 56 countries. Skills Leadership Financial Analysis Finance Corporate Finance Budgets Mergers & Acquisitions Management Project Planning Contract Negotiation Cross-functional Team... Sarbanes-Oxley Act Enterprise Software Financial Modeling Mergers Strategy Forecasting Process Improvement Team Building See 3+     See less Skills  Leadership Financial Analysis Finance Corporate Finance Budgets Mergers & Acquisitions Management Project Planning Contract Negotiation Cross-functional Team... Sarbanes-Oxley Act Enterprise Software Financial Modeling Mergers Strategy Forecasting Process Improvement Team Building See 3+     See less Leadership Financial Analysis Finance Corporate Finance Budgets Mergers & Acquisitions Management Project Planning Contract Negotiation Cross-functional Team... Sarbanes-Oxley Act Enterprise Software Financial Modeling Mergers Strategy Forecasting Process Improvement Team Building See 3+     See less Leadership Financial Analysis Finance Corporate Finance Budgets Mergers & Acquisitions Management Project Planning Contract Negotiation Cross-functional Team... Sarbanes-Oxley Act Enterprise Software Financial Modeling Mergers Strategy Forecasting Process Improvement Team Building See 3+     See less Education Arizona State University Bachelor of Science (BS),  Honors Finance 1995  – 1998 Arizona State University Bachelor of Science (BS),  Honors Finance 1995  – 1998 Arizona State University Bachelor of Science (BS),  Honors Finance 1995  – 1998 Arizona State University Bachelor of Science (BS),  Honors Finance 1995  – 1998 ", "Experience Finance Director/Vietnam Controller, Intel Products Vietnam Co. Ltd Intel Corporation July 2012  – Present (3 years 2 months) Assumed all financial responsibilities for Intel’s operations in Vietnam, including the newest & largest manufacturing facility in Intel’s network. Led team of over 30 direct and matrixed professionals across Operations Finance, Accounting, Tax, Trade, Treasury, and Risk Management/Compliance. Intel’s Ho Chi Minh factory site is the fastest ramping site with a total presence of over 1,000 heads to date, and this role requires extensive interactions with Senior Vietnamese Government officials and other external parties. Finance Director/India Controller, Intel Tech India Pvt Ltd Intel Corporation October 2010  –  June 2012  (1 year 9 months) Bangalore, India Promoted to the most senior finance role in the South Asia region (India, Pakistan, Sri Lanka, & Bangladesh) leading a team of over 40 direct and matrixed professionals across Operations Finance, Sales & Marketing, Accounting, Tax, Trade, Treasury, Controls/Compliance, and Intel Capital (M&A). The Bangalore site is Intel’s largest non-manufacturing site outside of the US with a total presence of over 6,200 heads, and there are 14 Sales & Marketing offices located throughout this region. Low Power Embedded Products Controller Intel Corporation April 2010  –  September 2010  (6 months) Assumed profit & loss responsibilities for the LEPD & ECD divisions with a combined revenue of ~$1B including a diverse portfolio of products in segments such as Industrial, Energy, Print Imaging, Digital Signage, Retail, Medical, and others. Led Finance team of 11 managers & analysts to define product, customer, roadmap, and competitive strategies for optimal long term growth of these divisions.  \n•\tDeveloped In-Vehicle Infotainment (IVI) strategy which was ratified by CEO, CFO, and other Senior Managers \n•\tLed financial analyses of 4 Merger & Acquisition targets which ranged from small to large capitalization \n•\tCo-developed portfolio process for determining optimal product funding strategies Assembly Test Manufacturing Central Controller Intel Corporation May 2005  –  March 2010  (4 years 11 months) Promoted to lead a newly created group in Intel Finance with charter to identify and drive strategic cost reduction initiatives in Intel’s Assembly/Test (A/T) high volume manufacturing operations. ATM organization was one of the largest divisions at Intel with 16,000 employees in 17 factories located throughout Asia, Central America & the US. This role involved working directly with ATM VP/GM and his Staff to drive long term structural changes in the A/T operations and better align assembly & test costs with product affordability goals. In Nov 2007, my responsibilities were expanded to cover all expense/capital spending, headcount, cost, and controls management for this $1B+ organization including a staff of 20 analysts and managers located globally. Finance Director/Vietnam Controller, Intel Products Vietnam Co. Ltd Intel Corporation July 2012  – Present (3 years 2 months) Assumed all financial responsibilities for Intel’s operations in Vietnam, including the newest & largest manufacturing facility in Intel’s network. Led team of over 30 direct and matrixed professionals across Operations Finance, Accounting, Tax, Trade, Treasury, and Risk Management/Compliance. Intel’s Ho Chi Minh factory site is the fastest ramping site with a total presence of over 1,000 heads to date, and this role requires extensive interactions with Senior Vietnamese Government officials and other external parties. Finance Director/Vietnam Controller, Intel Products Vietnam Co. Ltd Intel Corporation July 2012  – Present (3 years 2 months) Assumed all financial responsibilities for Intel’s operations in Vietnam, including the newest & largest manufacturing facility in Intel’s network. Led team of over 30 direct and matrixed professionals across Operations Finance, Accounting, Tax, Trade, Treasury, and Risk Management/Compliance. Intel’s Ho Chi Minh factory site is the fastest ramping site with a total presence of over 1,000 heads to date, and this role requires extensive interactions with Senior Vietnamese Government officials and other external parties. Finance Director/India Controller, Intel Tech India Pvt Ltd Intel Corporation October 2010  –  June 2012  (1 year 9 months) Bangalore, India Promoted to the most senior finance role in the South Asia region (India, Pakistan, Sri Lanka, & Bangladesh) leading a team of over 40 direct and matrixed professionals across Operations Finance, Sales & Marketing, Accounting, Tax, Trade, Treasury, Controls/Compliance, and Intel Capital (M&A). The Bangalore site is Intel’s largest non-manufacturing site outside of the US with a total presence of over 6,200 heads, and there are 14 Sales & Marketing offices located throughout this region. Finance Director/India Controller, Intel Tech India Pvt Ltd Intel Corporation October 2010  –  June 2012  (1 year 9 months) Bangalore, India Promoted to the most senior finance role in the South Asia region (India, Pakistan, Sri Lanka, & Bangladesh) leading a team of over 40 direct and matrixed professionals across Operations Finance, Sales & Marketing, Accounting, Tax, Trade, Treasury, Controls/Compliance, and Intel Capital (M&A). The Bangalore site is Intel’s largest non-manufacturing site outside of the US with a total presence of over 6,200 heads, and there are 14 Sales & Marketing offices located throughout this region. Low Power Embedded Products Controller Intel Corporation April 2010  –  September 2010  (6 months) Assumed profit & loss responsibilities for the LEPD & ECD divisions with a combined revenue of ~$1B including a diverse portfolio of products in segments such as Industrial, Energy, Print Imaging, Digital Signage, Retail, Medical, and others. Led Finance team of 11 managers & analysts to define product, customer, roadmap, and competitive strategies for optimal long term growth of these divisions.  \n•\tDeveloped In-Vehicle Infotainment (IVI) strategy which was ratified by CEO, CFO, and other Senior Managers \n•\tLed financial analyses of 4 Merger & Acquisition targets which ranged from small to large capitalization \n•\tCo-developed portfolio process for determining optimal product funding strategies Low Power Embedded Products Controller Intel Corporation April 2010  –  September 2010  (6 months) Assumed profit & loss responsibilities for the LEPD & ECD divisions with a combined revenue of ~$1B including a diverse portfolio of products in segments such as Industrial, Energy, Print Imaging, Digital Signage, Retail, Medical, and others. Led Finance team of 11 managers & analysts to define product, customer, roadmap, and competitive strategies for optimal long term growth of these divisions.  \n•\tDeveloped In-Vehicle Infotainment (IVI) strategy which was ratified by CEO, CFO, and other Senior Managers \n•\tLed financial analyses of 4 Merger & Acquisition targets which ranged from small to large capitalization \n•\tCo-developed portfolio process for determining optimal product funding strategies Assembly Test Manufacturing Central Controller Intel Corporation May 2005  –  March 2010  (4 years 11 months) Promoted to lead a newly created group in Intel Finance with charter to identify and drive strategic cost reduction initiatives in Intel’s Assembly/Test (A/T) high volume manufacturing operations. ATM organization was one of the largest divisions at Intel with 16,000 employees in 17 factories located throughout Asia, Central America & the US. This role involved working directly with ATM VP/GM and his Staff to drive long term structural changes in the A/T operations and better align assembly & test costs with product affordability goals. In Nov 2007, my responsibilities were expanded to cover all expense/capital spending, headcount, cost, and controls management for this $1B+ organization including a staff of 20 analysts and managers located globally. Assembly Test Manufacturing Central Controller Intel Corporation May 2005  –  March 2010  (4 years 11 months) Promoted to lead a newly created group in Intel Finance with charter to identify and drive strategic cost reduction initiatives in Intel’s Assembly/Test (A/T) high volume manufacturing operations. ATM organization was one of the largest divisions at Intel with 16,000 employees in 17 factories located throughout Asia, Central America & the US. This role involved working directly with ATM VP/GM and his Staff to drive long term structural changes in the A/T operations and better align assembly & test costs with product affordability goals. In Nov 2007, my responsibilities were expanded to cover all expense/capital spending, headcount, cost, and controls management for this $1B+ organization including a staff of 20 analysts and managers located globally. Skills Strategy Mergers & Acquisitions Financial Analysis Manufacturing Management Operations Management Finance Team Leadership Internal Controls Accounting Income Statement Financial Modeling Forecasting Cross-functional Team... Sarbanes-Oxley Act Process Improvement P&L Management Executive Management See 3+     See less Skills  Strategy Mergers & Acquisitions Financial Analysis Manufacturing Management Operations Management Finance Team Leadership Internal Controls Accounting Income Statement Financial Modeling Forecasting Cross-functional Team... Sarbanes-Oxley Act Process Improvement P&L Management Executive Management See 3+     See less Strategy Mergers & Acquisitions Financial Analysis Manufacturing Management Operations Management Finance Team Leadership Internal Controls Accounting Income Statement Financial Modeling Forecasting Cross-functional Team... Sarbanes-Oxley Act Process Improvement P&L Management Executive Management See 3+     See less Strategy Mergers & Acquisitions Financial Analysis Manufacturing Management Operations Management Finance Team Leadership Internal Controls Accounting Income Statement Financial Modeling Forecasting Cross-functional Team... Sarbanes-Oxley Act Process Improvement P&L Management Executive Management See 3+     See less Education Indiana University Bloomington MBA,  Finance 1997  – 1999 Michigan State University MS,  Mechanical Engineering Assistantship & Scholoarship Recipient Michigan State University BS,  Mechanical Engineering Graduated with Honors Indiana University Bloomington MBA,  Finance 1997  – 1999 Indiana University Bloomington MBA,  Finance 1997  – 1999 Indiana University Bloomington MBA,  Finance 1997  – 1999 Michigan State University MS,  Mechanical Engineering Assistantship & Scholoarship Recipient Michigan State University MS,  Mechanical Engineering Assistantship & Scholoarship Recipient Michigan State University MS,  Mechanical Engineering Assistantship & Scholoarship Recipient Michigan State University BS,  Mechanical Engineering Graduated with Honors Michigan State University BS,  Mechanical Engineering Graduated with Honors Michigan State University BS,  Mechanical Engineering Graduated with Honors ", "Experience Next Generation FP&A PnL Re-Engineering Controller Intel Corporation March 2013  – Present (2 years 6 months) Portland, Oregon Area Manage multi-site (OR, CA,AZ) staff of 5 analysts responsible for requirements finalization, design support, re-engineering, migration and deployment for all consolidations groups, PnLs, and Revenue to Intel's Next Generation SAP based Finance system. Communications & Networking Group Controller Intel Corporation 2007  –  2013  (6 years) Portland, Oregon Area Managed multi-site (OR, CA, Israel) staff of 10 analysts providing full P&L (revenue/pricing, cost/inventory, spending/HC/capital) & Strategic Roadmap support for Intel's Communication & Networking Division. WW Partner Marketing Group Controller Intel Corporation 2002  –  2007  (5 years) Portland, Oregon Area Lead direct organization of 20 employees with a WW dotted line reporting structure for 60 additional Intel Inside Program financial controls & compliance personnel in the geographies. WW Channel & Communications Sales Force Controller Intel Corporation 2001  –  2002  (1 year) Portland, Oregon Area Managed multi-site (OR, CA, AZ, NJ) staff of 17 with dotted line reports in 5 GEOs responsible for forecasting revenue for 3 sales forces (Reseller Channel, Communication Sales, Internet Services) supporting 4 divisions. World-Wide Reseller Channel Finance Manager Intel Corporation 1999  –  2001  (2 years) Portland, Oregon Area Managed 6 direct reports & 4 dotted line GEO reports responsible for forecasting & reporting revenue for 3 divisions and providing budget & planning support New Business Group Finance Manager Intel Corporation 1997  –  1998  (1 year) Portland, Oregon Area Managed 3 direct reports responsible for divisional consolidations & reporting. Software Division & Advanced Technology Division Controller Apple 1994  –  1997  (3 years) San Francisco Bay Area Managed direct staff of 5 Sr. Financial Analysts & 2 dotted line reports responsible for providing strategic consultation & guidance to 2 Senior VPs. Developed business plans, budgets, quarterly forecasts and variance analysis for SW Business with ~$250M revenue, ~$230M annual spending and ~2000 employees. Apple Developer Group Sr. Financial Analyst Apple 1992  –  1993  (1 year) San Francisco Bay Area Supported Apple Developer Group VP with P&L responsibilities for $23M revenue, $40M OPEX & 250 employees. Developed business plans, budgets, quarterly forecasts and variance analysis. Supervised 3 accountants supporting developer product distribution channel (APDA). Software Division Sr. Business Forecast Analyst Apple 1991  –  1992  (1 year) San Francisco Bay Area Responsible for integrity, process & logistics of division budgeting, forecasting & reporting. Instituted project based business plan to facilitate budget allocation decisions. PC & Printer Manufacturing Sr. Financial Analyst Apple 1986  –  1991  (5 years) San Francisco Bay Area Develolped manufacturing cost projections for new products. Instituted ABC costing methods to allocate/charge overhead costs to products. Developed financial evaluation model utilizing financial analysis to evaluate third-party suppliers. Coordinated & consolidated monthly forecasts and annual budget for manufacturing operations. Contact Lens Solution Manufacturing: Sr. Cost Analyst Revlon 1985  –  1986  (1 year) San Francisco Bay Area Closed the books, developed forecasts and annual budget for mfg site, & prepared internal financial statements. Analyzed and determined standard costs for >1000 components and >100 finished goods; coordinated annual physical inventory. Wafer Fab/Assembly Mfg: Cost Acctg Supv/Sr. Cost Analyst Gould Electronics 1983  –  1985  (2 years) San Francisco Bay Area In charge of closing the books for the entire Santa Clara manufacturing site. Supervised 2 cost accountants responsible for raw material, WIP & finished goods. Analyzed and updated standard inventory costs bi-annually; coordinated annual physical inventory and weekly cycle counts. Internal Reporting: Staff Accountant Gould Electronics 1982  –  1983  (1 year) San Francisco Bay Area Consolidated & prepared internal Financial Statements for ~$100M Revenue Division (AMI). Translated, communicated and explained internal company financial data to new parent company (Gould). Next Generation FP&A PnL Re-Engineering Controller Intel Corporation March 2013  – Present (2 years 6 months) Portland, Oregon Area Manage multi-site (OR, CA,AZ) staff of 5 analysts responsible for requirements finalization, design support, re-engineering, migration and deployment for all consolidations groups, PnLs, and Revenue to Intel's Next Generation SAP based Finance system. Next Generation FP&A PnL Re-Engineering Controller Intel Corporation March 2013  – Present (2 years 6 months) Portland, Oregon Area Manage multi-site (OR, CA,AZ) staff of 5 analysts responsible for requirements finalization, design support, re-engineering, migration and deployment for all consolidations groups, PnLs, and Revenue to Intel's Next Generation SAP based Finance system. Communications & Networking Group Controller Intel Corporation 2007  –  2013  (6 years) Portland, Oregon Area Managed multi-site (OR, CA, Israel) staff of 10 analysts providing full P&L (revenue/pricing, cost/inventory, spending/HC/capital) & Strategic Roadmap support for Intel's Communication & Networking Division. Communications & Networking Group Controller Intel Corporation 2007  –  2013  (6 years) Portland, Oregon Area Managed multi-site (OR, CA, Israel) staff of 10 analysts providing full P&L (revenue/pricing, cost/inventory, spending/HC/capital) & Strategic Roadmap support for Intel's Communication & Networking Division. WW Partner Marketing Group Controller Intel Corporation 2002  –  2007  (5 years) Portland, Oregon Area Lead direct organization of 20 employees with a WW dotted line reporting structure for 60 additional Intel Inside Program financial controls & compliance personnel in the geographies. WW Partner Marketing Group Controller Intel Corporation 2002  –  2007  (5 years) Portland, Oregon Area Lead direct organization of 20 employees with a WW dotted line reporting structure for 60 additional Intel Inside Program financial controls & compliance personnel in the geographies. WW Channel & Communications Sales Force Controller Intel Corporation 2001  –  2002  (1 year) Portland, Oregon Area Managed multi-site (OR, CA, AZ, NJ) staff of 17 with dotted line reports in 5 GEOs responsible for forecasting revenue for 3 sales forces (Reseller Channel, Communication Sales, Internet Services) supporting 4 divisions. WW Channel & Communications Sales Force Controller Intel Corporation 2001  –  2002  (1 year) Portland, Oregon Area Managed multi-site (OR, CA, AZ, NJ) staff of 17 with dotted line reports in 5 GEOs responsible for forecasting revenue for 3 sales forces (Reseller Channel, Communication Sales, Internet Services) supporting 4 divisions. World-Wide Reseller Channel Finance Manager Intel Corporation 1999  –  2001  (2 years) Portland, Oregon Area Managed 6 direct reports & 4 dotted line GEO reports responsible for forecasting & reporting revenue for 3 divisions and providing budget & planning support World-Wide Reseller Channel Finance Manager Intel Corporation 1999  –  2001  (2 years) Portland, Oregon Area Managed 6 direct reports & 4 dotted line GEO reports responsible for forecasting & reporting revenue for 3 divisions and providing budget & planning support New Business Group Finance Manager Intel Corporation 1997  –  1998  (1 year) Portland, Oregon Area Managed 3 direct reports responsible for divisional consolidations & reporting. New Business Group Finance Manager Intel Corporation 1997  –  1998  (1 year) Portland, Oregon Area Managed 3 direct reports responsible for divisional consolidations & reporting. Software Division & Advanced Technology Division Controller Apple 1994  –  1997  (3 years) San Francisco Bay Area Managed direct staff of 5 Sr. Financial Analysts & 2 dotted line reports responsible for providing strategic consultation & guidance to 2 Senior VPs. Developed business plans, budgets, quarterly forecasts and variance analysis for SW Business with ~$250M revenue, ~$230M annual spending and ~2000 employees. Software Division & Advanced Technology Division Controller Apple 1994  –  1997  (3 years) San Francisco Bay Area Managed direct staff of 5 Sr. Financial Analysts & 2 dotted line reports responsible for providing strategic consultation & guidance to 2 Senior VPs. Developed business plans, budgets, quarterly forecasts and variance analysis for SW Business with ~$250M revenue, ~$230M annual spending and ~2000 employees. Apple Developer Group Sr. Financial Analyst Apple 1992  –  1993  (1 year) San Francisco Bay Area Supported Apple Developer Group VP with P&L responsibilities for $23M revenue, $40M OPEX & 250 employees. Developed business plans, budgets, quarterly forecasts and variance analysis. Supervised 3 accountants supporting developer product distribution channel (APDA). Apple Developer Group Sr. Financial Analyst Apple 1992  –  1993  (1 year) San Francisco Bay Area Supported Apple Developer Group VP with P&L responsibilities for $23M revenue, $40M OPEX & 250 employees. Developed business plans, budgets, quarterly forecasts and variance analysis. Supervised 3 accountants supporting developer product distribution channel (APDA). Software Division Sr. Business Forecast Analyst Apple 1991  –  1992  (1 year) San Francisco Bay Area Responsible for integrity, process & logistics of division budgeting, forecasting & reporting. Instituted project based business plan to facilitate budget allocation decisions. Software Division Sr. Business Forecast Analyst Apple 1991  –  1992  (1 year) San Francisco Bay Area Responsible for integrity, process & logistics of division budgeting, forecasting & reporting. Instituted project based business plan to facilitate budget allocation decisions. PC & Printer Manufacturing Sr. Financial Analyst Apple 1986  –  1991  (5 years) San Francisco Bay Area Develolped manufacturing cost projections for new products. Instituted ABC costing methods to allocate/charge overhead costs to products. Developed financial evaluation model utilizing financial analysis to evaluate third-party suppliers. Coordinated & consolidated monthly forecasts and annual budget for manufacturing operations. PC & Printer Manufacturing Sr. Financial Analyst Apple 1986  –  1991  (5 years) San Francisco Bay Area Develolped manufacturing cost projections for new products. Instituted ABC costing methods to allocate/charge overhead costs to products. Developed financial evaluation model utilizing financial analysis to evaluate third-party suppliers. Coordinated & consolidated monthly forecasts and annual budget for manufacturing operations. Contact Lens Solution Manufacturing: Sr. Cost Analyst Revlon 1985  –  1986  (1 year) San Francisco Bay Area Closed the books, developed forecasts and annual budget for mfg site, & prepared internal financial statements. Analyzed and determined standard costs for >1000 components and >100 finished goods; coordinated annual physical inventory. Contact Lens Solution Manufacturing: Sr. Cost Analyst Revlon 1985  –  1986  (1 year) San Francisco Bay Area Closed the books, developed forecasts and annual budget for mfg site, & prepared internal financial statements. Analyzed and determined standard costs for >1000 components and >100 finished goods; coordinated annual physical inventory. Wafer Fab/Assembly Mfg: Cost Acctg Supv/Sr. Cost Analyst Gould Electronics 1983  –  1985  (2 years) San Francisco Bay Area In charge of closing the books for the entire Santa Clara manufacturing site. Supervised 2 cost accountants responsible for raw material, WIP & finished goods. Analyzed and updated standard inventory costs bi-annually; coordinated annual physical inventory and weekly cycle counts. Wafer Fab/Assembly Mfg: Cost Acctg Supv/Sr. Cost Analyst Gould Electronics 1983  –  1985  (2 years) San Francisco Bay Area In charge of closing the books for the entire Santa Clara manufacturing site. Supervised 2 cost accountants responsible for raw material, WIP & finished goods. Analyzed and updated standard inventory costs bi-annually; coordinated annual physical inventory and weekly cycle counts. Internal Reporting: Staff Accountant Gould Electronics 1982  –  1983  (1 year) San Francisco Bay Area Consolidated & prepared internal Financial Statements for ~$100M Revenue Division (AMI). Translated, communicated and explained internal company financial data to new parent company (Gould). Internal Reporting: Staff Accountant Gould Electronics 1982  –  1983  (1 year) San Francisco Bay Area Consolidated & prepared internal Financial Statements for ~$100M Revenue Division (AMI). Translated, communicated and explained internal company financial data to new parent company (Gould). Skills Financial Modeling Sarbanes-Oxley Act Cross-functional Team... Forecasting Financial Analysis Financial Forecasting Finance Variance Analysis Cost Accounting Budgets Internal Audit Skills  Financial Modeling Sarbanes-Oxley Act Cross-functional Team... Forecasting Financial Analysis Financial Forecasting Finance Variance Analysis Cost Accounting Budgets Internal Audit Financial Modeling Sarbanes-Oxley Act Cross-functional Team... Forecasting Financial Analysis Financial Forecasting Finance Variance Analysis Cost Accounting Budgets Internal Audit Financial Modeling Sarbanes-Oxley Act Cross-functional Team... Forecasting Financial Analysis Financial Forecasting Finance Variance Analysis Cost Accounting Budgets Internal Audit Education Golden Gate University MBA,  Finance 1982  – 1984 Washington State University BA,  Business w/Specialization in Accounting 1978  – 1982 Golden Gate University MBA,  Finance 1982  – 1984 Golden Gate University MBA,  Finance 1982  – 1984 Golden Gate University MBA,  Finance 1982  – 1984 Washington State University BA,  Business w/Specialization in Accounting 1978  – 1982 Washington State University BA,  Business w/Specialization in Accounting 1978  – 1982 Washington State University BA,  Business w/Specialization in Accounting 1978  – 1982 ", "Summary Over 15 years of experience in financial and business management functions of various groups across Intel. Responsible for planning and managing group financials as well as providing analytical decision support for technology roadmap and strategic investment portfolios. Influenced several initiatives related to operational excellence and execution, competitive intelligence, globalization strategy, supply chain management, and market segmentation. Additionally, drove significant external focus about impact of Information Technology on various sectors by engaging with customers in several countries and developing patented models to measure financial and economic impact of IT. Recognized for strategic thinking, risk taking, and change management. \n \nPrior to Intel, 10 years of diversified project management and business development experience with petrochemical and engineering consulting firms. Responsibilities included developing feasibility studies, decision tree analyses, operational planning, and financial justification for multi-million dollar projects. Managed projects from conceptual phase through completion in accordance with engineering codes and regulations through management of personnel, vendors, and engineering contractors. \n \nSpecialties: \n- Investment Portfolio and P&L Management \n- Product Roadmap and Market Segmentation \n- Strategic Long Range Planning \n- Competitive Intelligence Tools \n- Globalization Strategy \n- M&A Integration, Due Diligence \n- General Management and Mentoring Summary Over 15 years of experience in financial and business management functions of various groups across Intel. Responsible for planning and managing group financials as well as providing analytical decision support for technology roadmap and strategic investment portfolios. Influenced several initiatives related to operational excellence and execution, competitive intelligence, globalization strategy, supply chain management, and market segmentation. Additionally, drove significant external focus about impact of Information Technology on various sectors by engaging with customers in several countries and developing patented models to measure financial and economic impact of IT. Recognized for strategic thinking, risk taking, and change management. \n \nPrior to Intel, 10 years of diversified project management and business development experience with petrochemical and engineering consulting firms. Responsibilities included developing feasibility studies, decision tree analyses, operational planning, and financial justification for multi-million dollar projects. Managed projects from conceptual phase through completion in accordance with engineering codes and regulations through management of personnel, vendors, and engineering contractors. \n \nSpecialties: \n- Investment Portfolio and P&L Management \n- Product Roadmap and Market Segmentation \n- Strategic Long Range Planning \n- Competitive Intelligence Tools \n- Globalization Strategy \n- M&A Integration, Due Diligence \n- General Management and Mentoring Over 15 years of experience in financial and business management functions of various groups across Intel. Responsible for planning and managing group financials as well as providing analytical decision support for technology roadmap and strategic investment portfolios. Influenced several initiatives related to operational excellence and execution, competitive intelligence, globalization strategy, supply chain management, and market segmentation. Additionally, drove significant external focus about impact of Information Technology on various sectors by engaging with customers in several countries and developing patented models to measure financial and economic impact of IT. Recognized for strategic thinking, risk taking, and change management. \n \nPrior to Intel, 10 years of diversified project management and business development experience with petrochemical and engineering consulting firms. Responsibilities included developing feasibility studies, decision tree analyses, operational planning, and financial justification for multi-million dollar projects. Managed projects from conceptual phase through completion in accordance with engineering codes and regulations through management of personnel, vendors, and engineering contractors. \n \nSpecialties: \n- Investment Portfolio and P&L Management \n- Product Roadmap and Market Segmentation \n- Strategic Long Range Planning \n- Competitive Intelligence Tools \n- Globalization Strategy \n- M&A Integration, Due Diligence \n- General Management and Mentoring Over 15 years of experience in financial and business management functions of various groups across Intel. Responsible for planning and managing group financials as well as providing analytical decision support for technology roadmap and strategic investment portfolios. Influenced several initiatives related to operational excellence and execution, competitive intelligence, globalization strategy, supply chain management, and market segmentation. Additionally, drove significant external focus about impact of Information Technology on various sectors by engaging with customers in several countries and developing patented models to measure financial and economic impact of IT. Recognized for strategic thinking, risk taking, and change management. \n \nPrior to Intel, 10 years of diversified project management and business development experience with petrochemical and engineering consulting firms. Responsibilities included developing feasibility studies, decision tree analyses, operational planning, and financial justification for multi-million dollar projects. Managed projects from conceptual phase through completion in accordance with engineering codes and regulations through management of personnel, vendors, and engineering contractors. \n \nSpecialties: \n- Investment Portfolio and P&L Management \n- Product Roadmap and Market Segmentation \n- Strategic Long Range Planning \n- Competitive Intelligence Tools \n- Globalization Strategy \n- M&A Integration, Due Diligence \n- General Management and Mentoring Experience Mobile Platform Operations Controller Intel Corporation August 2014  – Present (1 year 1 month) Santa Clara, CA Mobile Client Platform Group, Intel: \n• Responsible for managing finance organization in support of Intel's $19B notebook business with primary focus on product roadmap, skuing and pricing, and overall P&L management. Partnering with operations for long range planning, market segmentation strategy, and customer portfolio management. Additional focus on driving innovative categories such as 2 in 1s and Ultrabooks for the mobile PC market. Finance Controller Intel Corporation June 2012  –  July 2014  (2 years 2 months) India Intel India Development Center Controller \n• Responsible for building and managing finance organization to support Intel India R&D group with 2,500 employees, $220+M in spending across several business units. Established finance agenda and focus areas in support of Intel strategy in India, ensuring IP controls, and driving strategic options for R&D operation based on tax policies and market trends. Partnered with operations to develop framework and processes to monitor R&D competitive intelligence and ecosystem trends in the region. Drove outsourcing strategy and sweeping actions at corporate level for worldwide supplier consolidation, outcome based contractual agreements, and cost savings. Finance Controller Intel Corporation January 2010  –  May 2012  (2 years 5 months) Folsom, CA Client Chipset Group, Intel: \n• Responsible for managing finance organization and developing a results oriented culture to support the group with 1,200 employees, $230M in R&D delivering $6.5B in annual revenue. Primary focus areas include financial forecasting, planning, monthly and quarterly close, analyses, and reporting. \n• Influenced product competitiveness, R&D efficiency, IP planning, low power capabilities on Intel architecture, and software and services strategy. \n• Established new processes for milestone based funding to effectively manage incubation portfolio of long lead technologies and contractual negotiations for external IP providers. Finance Controller Intel May 2005  –  December 2009  (4 years 8 months) Folsom, CA Digital Health Group (DHeG), Intel: \n• Recruited and built finance organization to establish rapidly growing group’s financial planning and reporting processes, prepare annual operating and capital budgets, and to shape growth strategies for the group with senior VPs. \n• Analyzed worldwide Healthcare IT trends, barriers and opportunities for IT adoption, and impact of Intel products and solutions on various market segments. \n• Played a key role in facilitating corporate strategic discussions, reviews with Board of Directors, and analyzing long range plans leading to successful negotiations and joint venture with GE Healthcare. \n• Engaged with healthcare executives in the US, UK, China, India, and Singapore to develop a white paper and patented financial models on economic impact of Healthcare IT adoption. Strategic Finance Manager Intel 2003  –  April 2005  (2 years) Technology and Manufacturing Group, Intel: \n• Responsible for leading a team of analysts for budget planning, affordability analysis, influencing supplier negotiations, and driving optimal inventory levels of DRAM memory worldwide. Led a cross division finance team to analyze the memory industry trend and influence long term R&D and platform strategy thru supplier negotiations and agreements. Finance Manager Intel July 2002  –  November 2003  (1 year 5 months) Wireless Computing and Communications Group, Intel: \n• Managed a team of strategic analysts and partnered with engineering, marketing, and manufacturing teams to drive affordable product roadmap for application and communication processors delivering $250M in revenue with $200M in annual R&D. \n• Played critical role in business decisions related to feature portfolio, product cost targets, sku based pricing, long range forecasting, and capital affordability. Finance Specialist Intel February 2001  –  July 2002  (1 year 6 months) IT/eBusiness Group, Intel:  \n• Business partner with manufacturing planning and eBusiness applications development groups focused on delivering systems for end to end manufacturing planning and agile decision making. Led a cross functional finance team to influence long term technology and strategy roadmaps as well as off shore staffing and execution plans to ensure success. Mobile Platform Operations Controller Intel Corporation August 2014  – Present (1 year 1 month) Santa Clara, CA Mobile Client Platform Group, Intel: \n• Responsible for managing finance organization in support of Intel's $19B notebook business with primary focus on product roadmap, skuing and pricing, and overall P&L management. Partnering with operations for long range planning, market segmentation strategy, and customer portfolio management. Additional focus on driving innovative categories such as 2 in 1s and Ultrabooks for the mobile PC market. Mobile Platform Operations Controller Intel Corporation August 2014  – Present (1 year 1 month) Santa Clara, CA Mobile Client Platform Group, Intel: \n• Responsible for managing finance organization in support of Intel's $19B notebook business with primary focus on product roadmap, skuing and pricing, and overall P&L management. Partnering with operations for long range planning, market segmentation strategy, and customer portfolio management. Additional focus on driving innovative categories such as 2 in 1s and Ultrabooks for the mobile PC market. Finance Controller Intel Corporation June 2012  –  July 2014  (2 years 2 months) India Intel India Development Center Controller \n• Responsible for building and managing finance organization to support Intel India R&D group with 2,500 employees, $220+M in spending across several business units. Established finance agenda and focus areas in support of Intel strategy in India, ensuring IP controls, and driving strategic options for R&D operation based on tax policies and market trends. Partnered with operations to develop framework and processes to monitor R&D competitive intelligence and ecosystem trends in the region. Drove outsourcing strategy and sweeping actions at corporate level for worldwide supplier consolidation, outcome based contractual agreements, and cost savings. Finance Controller Intel Corporation June 2012  –  July 2014  (2 years 2 months) India Intel India Development Center Controller \n• Responsible for building and managing finance organization to support Intel India R&D group with 2,500 employees, $220+M in spending across several business units. Established finance agenda and focus areas in support of Intel strategy in India, ensuring IP controls, and driving strategic options for R&D operation based on tax policies and market trends. Partnered with operations to develop framework and processes to monitor R&D competitive intelligence and ecosystem trends in the region. Drove outsourcing strategy and sweeping actions at corporate level for worldwide supplier consolidation, outcome based contractual agreements, and cost savings. Finance Controller Intel Corporation January 2010  –  May 2012  (2 years 5 months) Folsom, CA Client Chipset Group, Intel: \n• Responsible for managing finance organization and developing a results oriented culture to support the group with 1,200 employees, $230M in R&D delivering $6.5B in annual revenue. Primary focus areas include financial forecasting, planning, monthly and quarterly close, analyses, and reporting. \n• Influenced product competitiveness, R&D efficiency, IP planning, low power capabilities on Intel architecture, and software and services strategy. \n• Established new processes for milestone based funding to effectively manage incubation portfolio of long lead technologies and contractual negotiations for external IP providers. Finance Controller Intel Corporation January 2010  –  May 2012  (2 years 5 months) Folsom, CA Client Chipset Group, Intel: \n• Responsible for managing finance organization and developing a results oriented culture to support the group with 1,200 employees, $230M in R&D delivering $6.5B in annual revenue. Primary focus areas include financial forecasting, planning, monthly and quarterly close, analyses, and reporting. \n• Influenced product competitiveness, R&D efficiency, IP planning, low power capabilities on Intel architecture, and software and services strategy. \n• Established new processes for milestone based funding to effectively manage incubation portfolio of long lead technologies and contractual negotiations for external IP providers. Finance Controller Intel May 2005  –  December 2009  (4 years 8 months) Folsom, CA Digital Health Group (DHeG), Intel: \n• Recruited and built finance organization to establish rapidly growing group’s financial planning and reporting processes, prepare annual operating and capital budgets, and to shape growth strategies for the group with senior VPs. \n• Analyzed worldwide Healthcare IT trends, barriers and opportunities for IT adoption, and impact of Intel products and solutions on various market segments. \n• Played a key role in facilitating corporate strategic discussions, reviews with Board of Directors, and analyzing long range plans leading to successful negotiations and joint venture with GE Healthcare. \n• Engaged with healthcare executives in the US, UK, China, India, and Singapore to develop a white paper and patented financial models on economic impact of Healthcare IT adoption. Finance Controller Intel May 2005  –  December 2009  (4 years 8 months) Folsom, CA Digital Health Group (DHeG), Intel: \n• Recruited and built finance organization to establish rapidly growing group’s financial planning and reporting processes, prepare annual operating and capital budgets, and to shape growth strategies for the group with senior VPs. \n• Analyzed worldwide Healthcare IT trends, barriers and opportunities for IT adoption, and impact of Intel products and solutions on various market segments. \n• Played a key role in facilitating corporate strategic discussions, reviews with Board of Directors, and analyzing long range plans leading to successful negotiations and joint venture with GE Healthcare. \n• Engaged with healthcare executives in the US, UK, China, India, and Singapore to develop a white paper and patented financial models on economic impact of Healthcare IT adoption. Strategic Finance Manager Intel 2003  –  April 2005  (2 years) Technology and Manufacturing Group, Intel: \n• Responsible for leading a team of analysts for budget planning, affordability analysis, influencing supplier negotiations, and driving optimal inventory levels of DRAM memory worldwide. Led a cross division finance team to analyze the memory industry trend and influence long term R&D and platform strategy thru supplier negotiations and agreements. Strategic Finance Manager Intel 2003  –  April 2005  (2 years) Technology and Manufacturing Group, Intel: \n• Responsible for leading a team of analysts for budget planning, affordability analysis, influencing supplier negotiations, and driving optimal inventory levels of DRAM memory worldwide. Led a cross division finance team to analyze the memory industry trend and influence long term R&D and platform strategy thru supplier negotiations and agreements. Finance Manager Intel July 2002  –  November 2003  (1 year 5 months) Wireless Computing and Communications Group, Intel: \n• Managed a team of strategic analysts and partnered with engineering, marketing, and manufacturing teams to drive affordable product roadmap for application and communication processors delivering $250M in revenue with $200M in annual R&D. \n• Played critical role in business decisions related to feature portfolio, product cost targets, sku based pricing, long range forecasting, and capital affordability. Finance Manager Intel July 2002  –  November 2003  (1 year 5 months) Wireless Computing and Communications Group, Intel: \n• Managed a team of strategic analysts and partnered with engineering, marketing, and manufacturing teams to drive affordable product roadmap for application and communication processors delivering $250M in revenue with $200M in annual R&D. \n• Played critical role in business decisions related to feature portfolio, product cost targets, sku based pricing, long range forecasting, and capital affordability. Finance Specialist Intel February 2001  –  July 2002  (1 year 6 months) IT/eBusiness Group, Intel:  \n• Business partner with manufacturing planning and eBusiness applications development groups focused on delivering systems for end to end manufacturing planning and agile decision making. Led a cross functional finance team to influence long term technology and strategy roadmaps as well as off shore staffing and execution plans to ensure success. Finance Specialist Intel February 2001  –  July 2002  (1 year 6 months) IT/eBusiness Group, Intel:  \n• Business partner with manufacturing planning and eBusiness applications development groups focused on delivering systems for end to end manufacturing planning and agile decision making. Led a cross functional finance team to influence long term technology and strategy roadmaps as well as off shore staffing and execution plans to ensure success. Skills Financial Modeling Cross-functional Team... Financial Analysis Forecasting Competitive Analysis Business Strategy Mergers Financial Forecasting Corporate Finance Process Improvement Managerial Finance Acquisition Integration Program Management Pricing Start-ups Strategic Planning Capital Budgeting Strategic Financial... Business Planning Business Analysis See 5+     See less Skills  Financial Modeling Cross-functional Team... Financial Analysis Forecasting Competitive Analysis Business Strategy Mergers Financial Forecasting Corporate Finance Process Improvement Managerial Finance Acquisition Integration Program Management Pricing Start-ups Strategic Planning Capital Budgeting Strategic Financial... Business Planning Business Analysis See 5+     See less Financial Modeling Cross-functional Team... Financial Analysis Forecasting Competitive Analysis Business Strategy Mergers Financial Forecasting Corporate Finance Process Improvement Managerial Finance Acquisition Integration Program Management Pricing Start-ups Strategic Planning Capital Budgeting Strategic Financial... Business Planning Business Analysis See 5+     See less Financial Modeling Cross-functional Team... Financial Analysis Forecasting Competitive Analysis Business Strategy Mergers Financial Forecasting Corporate Finance Process Improvement Managerial Finance Acquisition Integration Program Management Pricing Start-ups Strategic Planning Capital Budgeting Strategic Financial... Business Planning Business Analysis See 5+     See less Education Claremont Graduate University - Peter F. Drucker and Masatoshi Ito Graduate School of Management MBA,  Finance 1997  – 1999 New Jersey Institute of Technology MS,  Manufacturing Engineering 1989  – 1990 Maharaja Sayajirao University, India BS,  Mechanical Engineering 1983  – 1987 Claremont Graduate University - Peter F. Drucker and Masatoshi Ito Graduate School of Management MBA,  Finance 1997  – 1999 Claremont Graduate University - Peter F. Drucker and Masatoshi Ito Graduate School of Management MBA,  Finance 1997  – 1999 Claremont Graduate University - Peter F. Drucker and Masatoshi Ito Graduate School of Management MBA,  Finance 1997  – 1999 New Jersey Institute of Technology MS,  Manufacturing Engineering 1989  – 1990 New Jersey Institute of Technology MS,  Manufacturing Engineering 1989  – 1990 New Jersey Institute of Technology MS,  Manufacturing Engineering 1989  – 1990 Maharaja Sayajirao University, India BS,  Mechanical Engineering 1983  – 1987 Maharaja Sayajirao University, India BS,  Mechanical Engineering 1983  – 1987 Maharaja Sayajirao University, India BS,  Mechanical Engineering 1983  – 1987 ", "Experience Global Accounting and Financial Services Controller Intel Corporation August 2013  – Present (2 years 1 month) External Reporting and Treasury Accounting Controller Intel Corporation January 2010  –  July 2013  (3 years 7 months) Accounting Policy Controller Intel Corporation September 2000  –  December 2009  (9 years 4 months) Industry Fellow FASB July 2003  –  June 2005  (2 years) Sales Operations Manager Corillian March 2000  –  September 2000  (7 months) Audit Manager KPMG Peat Marwick March 1997  –  February 2000  (3 years) Assistant Controller Cascade Microtech March 1996  –  February 1997  (1 year) Audit Senior KPMG Peat Marwick September 1993  –  February 1996  (2 years 6 months) Global Accounting and Financial Services Controller Intel Corporation August 2013  – Present (2 years 1 month) Global Accounting and Financial Services Controller Intel Corporation August 2013  – Present (2 years 1 month) External Reporting and Treasury Accounting Controller Intel Corporation January 2010  –  July 2013  (3 years 7 months) External Reporting and Treasury Accounting Controller Intel Corporation January 2010  –  July 2013  (3 years 7 months) Accounting Policy Controller Intel Corporation September 2000  –  December 2009  (9 years 4 months) Accounting Policy Controller Intel Corporation September 2000  –  December 2009  (9 years 4 months) Industry Fellow FASB July 2003  –  June 2005  (2 years) Industry Fellow FASB July 2003  –  June 2005  (2 years) Sales Operations Manager Corillian March 2000  –  September 2000  (7 months) Sales Operations Manager Corillian March 2000  –  September 2000  (7 months) Audit Manager KPMG Peat Marwick March 1997  –  February 2000  (3 years) Audit Manager KPMG Peat Marwick March 1997  –  February 2000  (3 years) Assistant Controller Cascade Microtech March 1996  –  February 1997  (1 year) Assistant Controller Cascade Microtech March 1996  –  February 1997  (1 year) Audit Senior KPMG Peat Marwick September 1993  –  February 1996  (2 years 6 months) Audit Senior KPMG Peat Marwick September 1993  –  February 1996  (2 years 6 months) Skills SEC filings US GAAP Financial Reporting Revenue Recognition Internal Controls Financial Modeling Consolidation Cost Accounting Sarbanes-Oxley Act GAAP Accounting Auditing Sarbanes-Oxley Managerial Finance Skills  SEC filings US GAAP Financial Reporting Revenue Recognition Internal Controls Financial Modeling Consolidation Cost Accounting Sarbanes-Oxley Act GAAP Accounting Auditing Sarbanes-Oxley Managerial Finance SEC filings US GAAP Financial Reporting Revenue Recognition Internal Controls Financial Modeling Consolidation Cost Accounting Sarbanes-Oxley Act GAAP Accounting Auditing Sarbanes-Oxley Managerial Finance SEC filings US GAAP Financial Reporting Revenue Recognition Internal Controls Financial Modeling Consolidation Cost Accounting Sarbanes-Oxley Act GAAP Accounting Auditing Sarbanes-Oxley Managerial Finance Education Oregon State University BS,  Accounting 1991  – 1993 Activities and Societies:  Beta Alpha Psi Oregon State University BS,  Accounting 1991  – 1993 Activities and Societies:  Beta Alpha Psi Oregon State University BS,  Accounting 1991  – 1993 Activities and Societies:  Beta Alpha Psi Oregon State University BS,  Accounting 1991  – 1993 Activities and Societies:  Beta Alpha Psi "]}