{"position": "Corporate Marketing", "company": "Intel Corporation", "profiles": ["Summary Twenty-three years of experience successfully bringing high technology products to market. Proven ability to develop new markets, grow revenues, build market share and increase marketing ROI. A strong leader who combines outstanding marketing skills with strategic vision and a focus on meeting customer needs. Broad experience with all aspects of marketing, with a track record of success developing and implementing integrated marketing programs for brand awareness and lead generation. Extensive expertise managing web site development, internet marketing, and e-commerce programs. Adept at developing and managing diverse international marketing teams, and combining internal and external resources to deliver world class marketing results. Specialties:•\tStrategic marketing \n•\tIntegrated marketing campaigns \n•\tDirect mail & email marketing \n•\tInternet marketing & SEO \n•\tWeb sites & e-commerce \n•\tChannel marketing programs \n•\tProduct marketing management \n•\tBrand management \n•\tMarket research & analysis \n•\tMarket development \n•\tInternational marketing \n•\tPeople and budget management Summary Twenty-three years of experience successfully bringing high technology products to market. Proven ability to develop new markets, grow revenues, build market share and increase marketing ROI. A strong leader who combines outstanding marketing skills with strategic vision and a focus on meeting customer needs. Broad experience with all aspects of marketing, with a track record of success developing and implementing integrated marketing programs for brand awareness and lead generation. Extensive expertise managing web site development, internet marketing, and e-commerce programs. Adept at developing and managing diverse international marketing teams, and combining internal and external resources to deliver world class marketing results. Specialties:•\tStrategic marketing \n•\tIntegrated marketing campaigns \n•\tDirect mail & email marketing \n•\tInternet marketing & SEO \n•\tWeb sites & e-commerce \n•\tChannel marketing programs \n•\tProduct marketing management \n•\tBrand management \n•\tMarket research & analysis \n•\tMarket development \n•\tInternational marketing \n•\tPeople and budget management Twenty-three years of experience successfully bringing high technology products to market. Proven ability to develop new markets, grow revenues, build market share and increase marketing ROI. A strong leader who combines outstanding marketing skills with strategic vision and a focus on meeting customer needs. Broad experience with all aspects of marketing, with a track record of success developing and implementing integrated marketing programs for brand awareness and lead generation. Extensive expertise managing web site development, internet marketing, and e-commerce programs. Adept at developing and managing diverse international marketing teams, and combining internal and external resources to deliver world class marketing results. Specialties:•\tStrategic marketing \n•\tIntegrated marketing campaigns \n•\tDirect mail & email marketing \n•\tInternet marketing & SEO \n•\tWeb sites & e-commerce \n•\tChannel marketing programs \n•\tProduct marketing management \n•\tBrand management \n•\tMarket research & analysis \n•\tMarket development \n•\tInternational marketing \n•\tPeople and budget management Twenty-three years of experience successfully bringing high technology products to market. Proven ability to develop new markets, grow revenues, build market share and increase marketing ROI. A strong leader who combines outstanding marketing skills with strategic vision and a focus on meeting customer needs. Broad experience with all aspects of marketing, with a track record of success developing and implementing integrated marketing programs for brand awareness and lead generation. Extensive expertise managing web site development, internet marketing, and e-commerce programs. Adept at developing and managing diverse international marketing teams, and combining internal and external resources to deliver world class marketing results. Specialties:•\tStrategic marketing \n•\tIntegrated marketing campaigns \n•\tDirect mail & email marketing \n•\tInternet marketing & SEO \n•\tWeb sites & e-commerce \n•\tChannel marketing programs \n•\tProduct marketing management \n•\tBrand management \n•\tMarket research & analysis \n•\tMarket development \n•\tInternational marketing \n•\tPeople and budget management Experience Vice President of Global Marketing Netop Business Solutions A/S November 2010  – Present (4 years 10 months) Portland, Oregon Area Manage the worldwide marketing team for international software company specializing in remote control solutions for business and education. Responsible for global marketing campaigns, branding, product marketing, public relations, channel marketing programs, internet marketing and e-commerce. Director of Marketing Netop Business Solutions A/S July 2008  –  November 2010  (2 years 5 months) Direct the Portland-based marketing team for international software company specializing in remote control solutions for business and education. Responsible for global marketing campaigns, branding, product marketing, public relations, channel marketing programs, Web site development and internet marketing and e-commerce. Vice President Marketing GenevaLogic November 2005  –  July 2008  (2 years 9 months) Developed and managed the worldwide marketing team for GenevaLogic, an international educational software company specializing in classroom management software. Responsible for strategic marketing, product marketing, Internet marketing and for the development and execution of marketing plans to achieve worldwide revenue targets. Managed a marketing budget exceeding one million dollars, and a team of 8 people in 3 countries. Drove marketing programs that resulted in 70% growth in GenevaLogic product sales in the US over two years, enabling the company to take the lead in the US classroom management software market. Manager of E-Commerce Deployment Intel Corporation January 1997  –  January 2000  (3 years 1 month) Managed the worldwide marketing team that launched Intel's first e-commerce web site, achieving $1 billion in sales per month. Developed the web site specifications, worked closely with engineering to deliver key customer requirements, and managed the effort to market, deploy and train customers worldwide. This ground-breaking effort reached over 300 customers and channel partners in 46 countries within the first year and was the largest OEM e-commerce program in the world at the time. Subsequently played a key role in converting all of Intel's business to e-business, managing a staff of 9 direct reports in multiple locations who drove site use, expanded the customer base and launched additional e-commerce programs. Strategic Marketing Manager, Internet Products Division Intel Corporation January 1995  –  January 1996  (1 year 1 month) Managed alliance between Intel and MCI to develop and launch a turnkey internet web server product targeted at small businesses. Successfully led team from initial negotiations through joint product development and marketing, delivering the new product on schedule in a major launch event which achieved national media coverage. Strategic Marketing Manager, Personal Conferencing Division Intel Corporation January 1994  –  January 1995  (1 year 1 month) Developed alliances and innovative marketing programs with key international business and telecommunication partners, including SAP, Sprint, US West and Bell South, enabling Intel to tap additional distribution channels for their personal conferencing products and substantially increasing partnership sales. Market Development Manager, Corporate Marketing Intel Corporation January 1992  –  January 1994  (2 years 1 month) Managed the innovative Intel Inside® marketing program with major PC manufacturers, the first major ingredient branding program in the industry. Responsible for more than $25 million in cooperative marketing funds. Played a significant role in bringing Gateway Computer into the program, making them one of the leading advertisers of the Intel brand at that time. Contributed to the successful marketing launch of the Pentium® processor. Field Sales Engineer Intel Corporation January 1982  –  January 1992  (10 years 1 month) Rose from sales trainee to Senior Account Executive managing a $40 million account base over the course of ten years in field sales. Recognized as member of Intel's President's Club for consistently exceeding sales goals over a seven year period. Worked extensively with automotive accounts, including Ford Motor Company and was responsible for many embedded controller design wins. Created a distributor training program which became a model for Intel's national technical distributor program. Vice President of Global Marketing Netop Business Solutions A/S November 2010  – Present (4 years 10 months) Portland, Oregon Area Manage the worldwide marketing team for international software company specializing in remote control solutions for business and education. Responsible for global marketing campaigns, branding, product marketing, public relations, channel marketing programs, internet marketing and e-commerce. Vice President of Global Marketing Netop Business Solutions A/S November 2010  – Present (4 years 10 months) Portland, Oregon Area Manage the worldwide marketing team for international software company specializing in remote control solutions for business and education. Responsible for global marketing campaigns, branding, product marketing, public relations, channel marketing programs, internet marketing and e-commerce. Director of Marketing Netop Business Solutions A/S July 2008  –  November 2010  (2 years 5 months) Direct the Portland-based marketing team for international software company specializing in remote control solutions for business and education. Responsible for global marketing campaigns, branding, product marketing, public relations, channel marketing programs, Web site development and internet marketing and e-commerce. Director of Marketing Netop Business Solutions A/S July 2008  –  November 2010  (2 years 5 months) Direct the Portland-based marketing team for international software company specializing in remote control solutions for business and education. Responsible for global marketing campaigns, branding, product marketing, public relations, channel marketing programs, Web site development and internet marketing and e-commerce. Vice President Marketing GenevaLogic November 2005  –  July 2008  (2 years 9 months) Developed and managed the worldwide marketing team for GenevaLogic, an international educational software company specializing in classroom management software. Responsible for strategic marketing, product marketing, Internet marketing and for the development and execution of marketing plans to achieve worldwide revenue targets. Managed a marketing budget exceeding one million dollars, and a team of 8 people in 3 countries. Drove marketing programs that resulted in 70% growth in GenevaLogic product sales in the US over two years, enabling the company to take the lead in the US classroom management software market. Vice President Marketing GenevaLogic November 2005  –  July 2008  (2 years 9 months) Developed and managed the worldwide marketing team for GenevaLogic, an international educational software company specializing in classroom management software. Responsible for strategic marketing, product marketing, Internet marketing and for the development and execution of marketing plans to achieve worldwide revenue targets. Managed a marketing budget exceeding one million dollars, and a team of 8 people in 3 countries. Drove marketing programs that resulted in 70% growth in GenevaLogic product sales in the US over two years, enabling the company to take the lead in the US classroom management software market. Manager of E-Commerce Deployment Intel Corporation January 1997  –  January 2000  (3 years 1 month) Managed the worldwide marketing team that launched Intel's first e-commerce web site, achieving $1 billion in sales per month. Developed the web site specifications, worked closely with engineering to deliver key customer requirements, and managed the effort to market, deploy and train customers worldwide. This ground-breaking effort reached over 300 customers and channel partners in 46 countries within the first year and was the largest OEM e-commerce program in the world at the time. Subsequently played a key role in converting all of Intel's business to e-business, managing a staff of 9 direct reports in multiple locations who drove site use, expanded the customer base and launched additional e-commerce programs. Manager of E-Commerce Deployment Intel Corporation January 1997  –  January 2000  (3 years 1 month) Managed the worldwide marketing team that launched Intel's first e-commerce web site, achieving $1 billion in sales per month. Developed the web site specifications, worked closely with engineering to deliver key customer requirements, and managed the effort to market, deploy and train customers worldwide. This ground-breaking effort reached over 300 customers and channel partners in 46 countries within the first year and was the largest OEM e-commerce program in the world at the time. Subsequently played a key role in converting all of Intel's business to e-business, managing a staff of 9 direct reports in multiple locations who drove site use, expanded the customer base and launched additional e-commerce programs. Strategic Marketing Manager, Internet Products Division Intel Corporation January 1995  –  January 1996  (1 year 1 month) Managed alliance between Intel and MCI to develop and launch a turnkey internet web server product targeted at small businesses. Successfully led team from initial negotiations through joint product development and marketing, delivering the new product on schedule in a major launch event which achieved national media coverage. Strategic Marketing Manager, Internet Products Division Intel Corporation January 1995  –  January 1996  (1 year 1 month) Managed alliance between Intel and MCI to develop and launch a turnkey internet web server product targeted at small businesses. Successfully led team from initial negotiations through joint product development and marketing, delivering the new product on schedule in a major launch event which achieved national media coverage. Strategic Marketing Manager, Personal Conferencing Division Intel Corporation January 1994  –  January 1995  (1 year 1 month) Developed alliances and innovative marketing programs with key international business and telecommunication partners, including SAP, Sprint, US West and Bell South, enabling Intel to tap additional distribution channels for their personal conferencing products and substantially increasing partnership sales. Strategic Marketing Manager, Personal Conferencing Division Intel Corporation January 1994  –  January 1995  (1 year 1 month) Developed alliances and innovative marketing programs with key international business and telecommunication partners, including SAP, Sprint, US West and Bell South, enabling Intel to tap additional distribution channels for their personal conferencing products and substantially increasing partnership sales. Market Development Manager, Corporate Marketing Intel Corporation January 1992  –  January 1994  (2 years 1 month) Managed the innovative Intel Inside® marketing program with major PC manufacturers, the first major ingredient branding program in the industry. Responsible for more than $25 million in cooperative marketing funds. Played a significant role in bringing Gateway Computer into the program, making them one of the leading advertisers of the Intel brand at that time. Contributed to the successful marketing launch of the Pentium® processor. Market Development Manager, Corporate Marketing Intel Corporation January 1992  –  January 1994  (2 years 1 month) Managed the innovative Intel Inside® marketing program with major PC manufacturers, the first major ingredient branding program in the industry. Responsible for more than $25 million in cooperative marketing funds. Played a significant role in bringing Gateway Computer into the program, making them one of the leading advertisers of the Intel brand at that time. Contributed to the successful marketing launch of the Pentium® processor. Field Sales Engineer Intel Corporation January 1982  –  January 1992  (10 years 1 month) Rose from sales trainee to Senior Account Executive managing a $40 million account base over the course of ten years in field sales. Recognized as member of Intel's President's Club for consistently exceeding sales goals over a seven year period. Worked extensively with automotive accounts, including Ford Motor Company and was responsible for many embedded controller design wins. Created a distributor training program which became a model for Intel's national technical distributor program. Field Sales Engineer Intel Corporation January 1982  –  January 1992  (10 years 1 month) Rose from sales trainee to Senior Account Executive managing a $40 million account base over the course of ten years in field sales. Recognized as member of Intel's President's Club for consistently exceeding sales goals over a seven year period. Worked extensively with automotive accounts, including Ford Motor Company and was responsible for many embedded controller design wins. Created a distributor training program which became a model for Intel's national technical distributor program. Skills Marketing Management Marketing Strategy Channel International Marketing Integrated Marketing Market Development Brand Management Product Marketing Product Management SaaS Email Marketing Online Advertising Business Strategy New Business Development Salesforce.com Product Development Marketing Demand Generation Lead Generation Strategy Market Research Management Leadership Sales Advertising Channel Partners Strategic Partnerships Program Management See 13+     See less Skills  Marketing Management Marketing Strategy Channel International Marketing Integrated Marketing Market Development Brand Management Product Marketing Product Management SaaS Email Marketing Online Advertising Business Strategy New Business Development Salesforce.com Product Development Marketing Demand Generation Lead Generation Strategy Market Research Management Leadership Sales Advertising Channel Partners Strategic Partnerships Program Management See 13+     See less Marketing Management Marketing Strategy Channel International Marketing Integrated Marketing Market Development Brand Management Product Marketing Product Management SaaS Email Marketing Online Advertising Business Strategy New Business Development Salesforce.com Product Development Marketing Demand Generation Lead Generation Strategy Market Research Management Leadership Sales Advertising Channel Partners Strategic Partnerships Program Management See 13+     See less Marketing Management Marketing Strategy Channel International Marketing Integrated Marketing Market Development Brand Management Product Marketing Product Management SaaS Email Marketing Online Advertising Business Strategy New Business Development Salesforce.com Product Development Marketing Demand Generation Lead Generation Strategy Market Research Management Leadership Sales Advertising Channel Partners Strategic Partnerships Program Management See 13+     See less Education University of Michigan B.S,  Computer Engineering 1978  – 1987 University of Michigan M.B.A,  Marketing 1978  – 1987 University of Michigan B.S,  Computer Engineering 1978  – 1987 University of Michigan B.S,  Computer Engineering 1978  – 1987 University of Michigan B.S,  Computer Engineering 1978  – 1987 University of Michigan M.B.A,  Marketing 1978  – 1987 University of Michigan M.B.A,  Marketing 1978  – 1987 University of Michigan M.B.A,  Marketing 1978  – 1987 ", "Summary I have a 10-year long professional experience in the areas of Marketing, Operations and Sales. Whilst working with my current employer Wind River I have been promoted and also received performance grants for three consecutive years. Summary I have a 10-year long professional experience in the areas of Marketing, Operations and Sales. Whilst working with my current employer Wind River I have been promoted and also received performance grants for three consecutive years. I have a 10-year long professional experience in the areas of Marketing, Operations and Sales. Whilst working with my current employer Wind River I have been promoted and also received performance grants for three consecutive years. I have a 10-year long professional experience in the areas of Marketing, Operations and Sales. Whilst working with my current employer Wind River I have been promoted and also received performance grants for three consecutive years. Experience Inside Account Executive - Networking EMEA Wind River April 2015  – Present (5 months) Stockholm, Sweden Inside Account Executive - Global Accounts Wind River April 2014  –  March 2015  (1 year) Stockholm, Sweden -Supporting global customer accounts across EMEA in the areas of Networking and Industrial \n-Provision of strategic and analytical support, including business planning and sales strategy development. \n-Languages used on a daily basis: English, German, Swedish and French \n Inside Sales Representative Wind River February 2012  –  March 2014  (2 years 2 months) Munich Area, Germany -Management of minor customer accounts across the DACHS and Benelux area (vertical market focus: Medical- and Industrial) \n-Solutions selling for the embedded market  \n-Prospecting, Qualification, Proposal generation  \n-Individual Contributor with yearly quota Resource Manager, Services Team EMEA Wind River July 2007  –  January 2012  (4 years 7 months) Munich Area, Germany -Project staffing of all resource levels across EMEA with projects worth up to 2M EUR \n-Co-responsible for resourcing, training needs and skills progress \n-Developed resource tracking tool that was later deployed WW \n-Supporting function for hiring in EMEA, contributed to key hiring positions (Director and Sr. PM) \n-Main interface for external support agencies and pricing negotiation \n RCG - Intel Inside Program, Corporate Marketing Intel Corporation August 2005  –  September 2006  (1 year 2 months) Munich Area, Germany -Reinforcement of Intel compliant media with customers and their creative agencies across EMEA  \n-Integrated project management for minor accounts (budget planning, process analysis, forecasting, marketing event creation, etc) \n-Provision of holistic marketing campaigns in the fields of Retail-, Consumer-, and Small & Medium Business (SMB) Marketing \n-Course in Integrated Marketing Campaigns successfully finished Sales & Marketing assistant Direct Consumer and Retail Marketing K1X September 2004  –  August 2005  (1 year) Munich Area, Germany -Responsible for sales and marketing initiatives in Spain, France and Sweden in particular \n-Project lead of ISPO Brand New Award, globally the largest sports trade show \n-Implementation of comprehensive go-to market activities Stock Options Representative, Investment Division Citi September 2003  –  March 2004  (7 months) Barcelona Area, Spain -Lifting of options (Smith Barney) and trade of shares in WW stock exchanges (London, Paris, Frankfurt, Stockholm and NYC) \n-Co-responsible for delivery and share transfers for a global customer \n-Daily monitoring and booking of transfers coordinated with other financial institutions Summer Internship Inter-American Development Bank June 2000  –  August 2000  (3 months) Washington D.C. Metro Area -Pre-screened and selected relevant candidates for the HR Officers and the Board of Assessment \n-Contributed with the construction of a data-base for all candidates on PhD level for future process handling Inside Account Executive - Networking EMEA Wind River April 2015  – Present (5 months) Stockholm, Sweden Inside Account Executive - Networking EMEA Wind River April 2015  – Present (5 months) Stockholm, Sweden Inside Account Executive - Global Accounts Wind River April 2014  –  March 2015  (1 year) Stockholm, Sweden -Supporting global customer accounts across EMEA in the areas of Networking and Industrial \n-Provision of strategic and analytical support, including business planning and sales strategy development. \n-Languages used on a daily basis: English, German, Swedish and French \n Inside Account Executive - Global Accounts Wind River April 2014  –  March 2015  (1 year) Stockholm, Sweden -Supporting global customer accounts across EMEA in the areas of Networking and Industrial \n-Provision of strategic and analytical support, including business planning and sales strategy development. \n-Languages used on a daily basis: English, German, Swedish and French \n Inside Sales Representative Wind River February 2012  –  March 2014  (2 years 2 months) Munich Area, Germany -Management of minor customer accounts across the DACHS and Benelux area (vertical market focus: Medical- and Industrial) \n-Solutions selling for the embedded market  \n-Prospecting, Qualification, Proposal generation  \n-Individual Contributor with yearly quota Inside Sales Representative Wind River February 2012  –  March 2014  (2 years 2 months) Munich Area, Germany -Management of minor customer accounts across the DACHS and Benelux area (vertical market focus: Medical- and Industrial) \n-Solutions selling for the embedded market  \n-Prospecting, Qualification, Proposal generation  \n-Individual Contributor with yearly quota Resource Manager, Services Team EMEA Wind River July 2007  –  January 2012  (4 years 7 months) Munich Area, Germany -Project staffing of all resource levels across EMEA with projects worth up to 2M EUR \n-Co-responsible for resourcing, training needs and skills progress \n-Developed resource tracking tool that was later deployed WW \n-Supporting function for hiring in EMEA, contributed to key hiring positions (Director and Sr. PM) \n-Main interface for external support agencies and pricing negotiation \n Resource Manager, Services Team EMEA Wind River July 2007  –  January 2012  (4 years 7 months) Munich Area, Germany -Project staffing of all resource levels across EMEA with projects worth up to 2M EUR \n-Co-responsible for resourcing, training needs and skills progress \n-Developed resource tracking tool that was later deployed WW \n-Supporting function for hiring in EMEA, contributed to key hiring positions (Director and Sr. PM) \n-Main interface for external support agencies and pricing negotiation \n RCG - Intel Inside Program, Corporate Marketing Intel Corporation August 2005  –  September 2006  (1 year 2 months) Munich Area, Germany -Reinforcement of Intel compliant media with customers and their creative agencies across EMEA  \n-Integrated project management for minor accounts (budget planning, process analysis, forecasting, marketing event creation, etc) \n-Provision of holistic marketing campaigns in the fields of Retail-, Consumer-, and Small & Medium Business (SMB) Marketing \n-Course in Integrated Marketing Campaigns successfully finished RCG - Intel Inside Program, Corporate Marketing Intel Corporation August 2005  –  September 2006  (1 year 2 months) Munich Area, Germany -Reinforcement of Intel compliant media with customers and their creative agencies across EMEA  \n-Integrated project management for minor accounts (budget planning, process analysis, forecasting, marketing event creation, etc) \n-Provision of holistic marketing campaigns in the fields of Retail-, Consumer-, and Small & Medium Business (SMB) Marketing \n-Course in Integrated Marketing Campaigns successfully finished Sales & Marketing assistant Direct Consumer and Retail Marketing K1X September 2004  –  August 2005  (1 year) Munich Area, Germany -Responsible for sales and marketing initiatives in Spain, France and Sweden in particular \n-Project lead of ISPO Brand New Award, globally the largest sports trade show \n-Implementation of comprehensive go-to market activities Sales & Marketing assistant Direct Consumer and Retail Marketing K1X September 2004  –  August 2005  (1 year) Munich Area, Germany -Responsible for sales and marketing initiatives in Spain, France and Sweden in particular \n-Project lead of ISPO Brand New Award, globally the largest sports trade show \n-Implementation of comprehensive go-to market activities Stock Options Representative, Investment Division Citi September 2003  –  March 2004  (7 months) Barcelona Area, Spain -Lifting of options (Smith Barney) and trade of shares in WW stock exchanges (London, Paris, Frankfurt, Stockholm and NYC) \n-Co-responsible for delivery and share transfers for a global customer \n-Daily monitoring and booking of transfers coordinated with other financial institutions Stock Options Representative, Investment Division Citi September 2003  –  March 2004  (7 months) Barcelona Area, Spain -Lifting of options (Smith Barney) and trade of shares in WW stock exchanges (London, Paris, Frankfurt, Stockholm and NYC) \n-Co-responsible for delivery and share transfers for a global customer \n-Daily monitoring and booking of transfers coordinated with other financial institutions Summer Internship Inter-American Development Bank June 2000  –  August 2000  (3 months) Washington D.C. Metro Area -Pre-screened and selected relevant candidates for the HR Officers and the Board of Assessment \n-Contributed with the construction of a data-base for all candidates on PhD level for future process handling Summer Internship Inter-American Development Bank June 2000  –  August 2000  (3 months) Washington D.C. Metro Area -Pre-screened and selected relevant candidates for the HR Officers and the Board of Assessment \n-Contributed with the construction of a data-base for all candidates on PhD level for future process handling Languages Swedish Native or bilingual proficiency Spanish Native or bilingual proficiency English Full professional proficiency German Full professional proficiency French Professional working proficiency Swedish Native or bilingual proficiency Spanish Native or bilingual proficiency English Full professional proficiency German Full professional proficiency French Professional working proficiency Swedish Native or bilingual proficiency Spanish Native or bilingual proficiency English Full professional proficiency German Full professional proficiency French Professional working proficiency Native or bilingual proficiency Native or bilingual proficiency Full professional proficiency Full professional proficiency Professional working proficiency Skills Professional Services Solution Selling SaaS Enterprise Software Salesforce.com Lead Generation Software Industry Strategic Partnerships Go-to-market Strategy Direct Sales Management Sales Selling Skills  Professional Services Solution Selling SaaS Enterprise Software Salesforce.com Lead Generation Software Industry Strategic Partnerships Go-to-market Strategy Direct Sales Management Sales Selling Professional Services Solution Selling SaaS Enterprise Software Salesforce.com Lead Generation Software Industry Strategic Partnerships Go-to-market Strategy Direct Sales Management Sales Selling Professional Services Solution Selling SaaS Enterprise Software Salesforce.com Lead Generation Software Industry Strategic Partnerships Go-to-market Strategy Direct Sales Management Sales Selling Education University of Stockholm Political Science 2006  – 2007 The University of Manchester Economics 1998  – 2001 Université de la Sorbonne Cours de Civilisation Française 1998  – 1998 Brännkyrka Gymnasium University of Stockholm Political Science 2006  – 2007 University of Stockholm Political Science 2006  – 2007 University of Stockholm Political Science 2006  – 2007 The University of Manchester Economics 1998  – 2001 The University of Manchester Economics 1998  – 2001 The University of Manchester Economics 1998  – 2001 Université de la Sorbonne Cours de Civilisation Française 1998  – 1998 Université de la Sorbonne Cours de Civilisation Française 1998  – 1998 Université de la Sorbonne Cours de Civilisation Française 1998  – 1998 Brännkyrka Gymnasium Brännkyrka Gymnasium Brännkyrka Gymnasium ", "Summary I am a uniquely skilled and successful marketing and communications professional with over 28 years of strategic planning and program implementation experience. I also have a diverse and accomplished background in creative services management, and have worked with the high tech, education, software, aerospace, retail, financial and healthcare industries. Summary I am a uniquely skilled and successful marketing and communications professional with over 28 years of strategic planning and program implementation experience. I also have a diverse and accomplished background in creative services management, and have worked with the high tech, education, software, aerospace, retail, financial and healthcare industries. I am a uniquely skilled and successful marketing and communications professional with over 28 years of strategic planning and program implementation experience. I also have a diverse and accomplished background in creative services management, and have worked with the high tech, education, software, aerospace, retail, financial and healthcare industries. I am a uniquely skilled and successful marketing and communications professional with over 28 years of strategic planning and program implementation experience. I also have a diverse and accomplished background in creative services management, and have worked with the high tech, education, software, aerospace, retail, financial and healthcare industries. Experience Purchasing & Contracts Manager Wenatchee Valley College August 2013  – Present (2 years 1 month) Communications Specialist Central Washington University February 2012  –  August 2013  (1 year 7 months) Ellensburg, WA Effectively manage various modules within the CPORT CRM program for Central Washington University’s Enrollment Management Department. CPORT allows cross media communications specifically for prospecting, recruiting, retention, and outreach for new and continuing students. I work with the Connect, Events, Trips, Answer, and Chat modules within this program. Creative and useful communications are developed to provide targeted communications to students and other audiences in the university ecosystem, such as parents, teachers, high school and community college counselors, etc. By effectively providing targeted communications defined by demographics, campus, major, interests, among other data points, awareness, enrollment and retention have been proven to increase. Success is measured by the analysis of usage data, then interpreted and is used to evaluate communication effectiveness, as well as plan future communication plans and strategy. Account Executive Hanlon Brown Design January 2008  –  October 2010  (2 years 10 months) Responsible for sales, new business development and account management for HB Design, a graphic \ndesign firm located in Portland, Oregon. HB Design provides creative design solutions for print, web, and interactive communications. My primary responsibility included account management and new business development for Intel. I worked with a multitude of clients representing a variety of business groups within the Intel Corporation. My extensive background in many areas of the print, web and interactive design, coupled with seven years working at Intel, gave me the experience and knowledge to provide excellent account management to a very diverse clientele. Marketing Manager – Intel Worldwide Reseller Channel Operation Intel Corporation June 2005  –  July 2007  (2 years 2 months) Responsible for setting strategy and driving worldwide marketing campaigns to and through the Intel Reseller Channel. Aligned channel marketing and communication campaigns with corporate campaigns to deliver consistent, integrated communications to more than 200,000 Intel Channel Partners worldwide. Marketing Communications Manager - Intel Worldwide Corporate Marketing Intel Corporation May 2000  –  June 2005  (5 years 2 months) Marketing communications specialist providing support for numerous marketing and advertising teams throughout Intel. Developed strategic, effective communications plans to align with demand creation and go-to-market campaign strategy. Led communications strategy with numerous teams throughout Intel providing marketing for channel programs, campaigns and product launches directed to the Intel Reseller Channel as well as direct B2B and B2C audience. Managed multiple outside vendors including graphic design firms, advertising agencies, web designers, writers, photographers, translators, and printers. Management with regional marketing and sales teams worldwide to deliver successful internal and external communications, sales tools, for marketing and demand generation campaigns. Account Executive/Sales PrintGraphics May 1994  –  May 2000  (6 years 1 month) Responsible for sales, service and support for entire print production process: sales, quoting, client communications, project tracking, schedule, and budget management. My background in production and design enabled me to obtain and support multiple accounts with a very high retention rate. Clients included corporate marketing departments, graphic design firms, advertising agencies, and freelance designers. Graphic Designer/Production Manager Ryan Hutchins Arthur Southwick January 1991  –  May 1994  (3 years 5 months) Art direction, design and production management for full-service  \nbusiness-to-business agency with two junior designers reporting to me. Responsible for creative design and direction, production management, project tracking, quoting, print buying and vendor management. Agency client list included telco, healthcare, banking and education. Owner/Designer Image by Design December 1987  –  January 1991  (3 years 2 months) Successfully operated small and very productive graphic design firm. Areas of focus included brand design, retail and POP, trade show displays, catalogs, signage and package design. Responsible for account acquisition and management, managed staff designers, freelance artists and writers. Clients included high tech, aerospace, medical, dental, financial, hospitality and various non-profit organizations. Graphic Designer/Photographer Eldec Corporation September 1986  –  December 1987  (1 year 4 months) Responsible for design and production of collateral material, corporate advertising, quarterly and annual report design, and various internal and external communications. Graphic Designer/Photographer Ryan Hutchins Advertising March 1984  –  August 1986  (2 years 6 months) Graphic Designer & Photographer for a full-service advertising and public relations firm serving business-to-business clients in financial, industrial, high tech and health care industries. Purchasing & Contracts Manager Wenatchee Valley College August 2013  – Present (2 years 1 month) Purchasing & Contracts Manager Wenatchee Valley College August 2013  – Present (2 years 1 month) Communications Specialist Central Washington University February 2012  –  August 2013  (1 year 7 months) Ellensburg, WA Effectively manage various modules within the CPORT CRM program for Central Washington University’s Enrollment Management Department. CPORT allows cross media communications specifically for prospecting, recruiting, retention, and outreach for new and continuing students. I work with the Connect, Events, Trips, Answer, and Chat modules within this program. Creative and useful communications are developed to provide targeted communications to students and other audiences in the university ecosystem, such as parents, teachers, high school and community college counselors, etc. By effectively providing targeted communications defined by demographics, campus, major, interests, among other data points, awareness, enrollment and retention have been proven to increase. Success is measured by the analysis of usage data, then interpreted and is used to evaluate communication effectiveness, as well as plan future communication plans and strategy. Communications Specialist Central Washington University February 2012  –  August 2013  (1 year 7 months) Ellensburg, WA Effectively manage various modules within the CPORT CRM program for Central Washington University’s Enrollment Management Department. CPORT allows cross media communications specifically for prospecting, recruiting, retention, and outreach for new and continuing students. I work with the Connect, Events, Trips, Answer, and Chat modules within this program. Creative and useful communications are developed to provide targeted communications to students and other audiences in the university ecosystem, such as parents, teachers, high school and community college counselors, etc. By effectively providing targeted communications defined by demographics, campus, major, interests, among other data points, awareness, enrollment and retention have been proven to increase. Success is measured by the analysis of usage data, then interpreted and is used to evaluate communication effectiveness, as well as plan future communication plans and strategy. Account Executive Hanlon Brown Design January 2008  –  October 2010  (2 years 10 months) Responsible for sales, new business development and account management for HB Design, a graphic \ndesign firm located in Portland, Oregon. HB Design provides creative design solutions for print, web, and interactive communications. My primary responsibility included account management and new business development for Intel. I worked with a multitude of clients representing a variety of business groups within the Intel Corporation. My extensive background in many areas of the print, web and interactive design, coupled with seven years working at Intel, gave me the experience and knowledge to provide excellent account management to a very diverse clientele. Account Executive Hanlon Brown Design January 2008  –  October 2010  (2 years 10 months) Responsible for sales, new business development and account management for HB Design, a graphic \ndesign firm located in Portland, Oregon. HB Design provides creative design solutions for print, web, and interactive communications. My primary responsibility included account management and new business development for Intel. I worked with a multitude of clients representing a variety of business groups within the Intel Corporation. My extensive background in many areas of the print, web and interactive design, coupled with seven years working at Intel, gave me the experience and knowledge to provide excellent account management to a very diverse clientele. Marketing Manager – Intel Worldwide Reseller Channel Operation Intel Corporation June 2005  –  July 2007  (2 years 2 months) Responsible for setting strategy and driving worldwide marketing campaigns to and through the Intel Reseller Channel. Aligned channel marketing and communication campaigns with corporate campaigns to deliver consistent, integrated communications to more than 200,000 Intel Channel Partners worldwide. Marketing Manager – Intel Worldwide Reseller Channel Operation Intel Corporation June 2005  –  July 2007  (2 years 2 months) Responsible for setting strategy and driving worldwide marketing campaigns to and through the Intel Reseller Channel. Aligned channel marketing and communication campaigns with corporate campaigns to deliver consistent, integrated communications to more than 200,000 Intel Channel Partners worldwide. Marketing Communications Manager - Intel Worldwide Corporate Marketing Intel Corporation May 2000  –  June 2005  (5 years 2 months) Marketing communications specialist providing support for numerous marketing and advertising teams throughout Intel. Developed strategic, effective communications plans to align with demand creation and go-to-market campaign strategy. Led communications strategy with numerous teams throughout Intel providing marketing for channel programs, campaigns and product launches directed to the Intel Reseller Channel as well as direct B2B and B2C audience. Managed multiple outside vendors including graphic design firms, advertising agencies, web designers, writers, photographers, translators, and printers. Management with regional marketing and sales teams worldwide to deliver successful internal and external communications, sales tools, for marketing and demand generation campaigns. Marketing Communications Manager - Intel Worldwide Corporate Marketing Intel Corporation May 2000  –  June 2005  (5 years 2 months) Marketing communications specialist providing support for numerous marketing and advertising teams throughout Intel. Developed strategic, effective communications plans to align with demand creation and go-to-market campaign strategy. Led communications strategy with numerous teams throughout Intel providing marketing for channel programs, campaigns and product launches directed to the Intel Reseller Channel as well as direct B2B and B2C audience. Managed multiple outside vendors including graphic design firms, advertising agencies, web designers, writers, photographers, translators, and printers. Management with regional marketing and sales teams worldwide to deliver successful internal and external communications, sales tools, for marketing and demand generation campaigns. Account Executive/Sales PrintGraphics May 1994  –  May 2000  (6 years 1 month) Responsible for sales, service and support for entire print production process: sales, quoting, client communications, project tracking, schedule, and budget management. My background in production and design enabled me to obtain and support multiple accounts with a very high retention rate. Clients included corporate marketing departments, graphic design firms, advertising agencies, and freelance designers. Account Executive/Sales PrintGraphics May 1994  –  May 2000  (6 years 1 month) Responsible for sales, service and support for entire print production process: sales, quoting, client communications, project tracking, schedule, and budget management. My background in production and design enabled me to obtain and support multiple accounts with a very high retention rate. Clients included corporate marketing departments, graphic design firms, advertising agencies, and freelance designers. Graphic Designer/Production Manager Ryan Hutchins Arthur Southwick January 1991  –  May 1994  (3 years 5 months) Art direction, design and production management for full-service  \nbusiness-to-business agency with two junior designers reporting to me. Responsible for creative design and direction, production management, project tracking, quoting, print buying and vendor management. Agency client list included telco, healthcare, banking and education. Graphic Designer/Production Manager Ryan Hutchins Arthur Southwick January 1991  –  May 1994  (3 years 5 months) Art direction, design and production management for full-service  \nbusiness-to-business agency with two junior designers reporting to me. Responsible for creative design and direction, production management, project tracking, quoting, print buying and vendor management. Agency client list included telco, healthcare, banking and education. Owner/Designer Image by Design December 1987  –  January 1991  (3 years 2 months) Successfully operated small and very productive graphic design firm. Areas of focus included brand design, retail and POP, trade show displays, catalogs, signage and package design. Responsible for account acquisition and management, managed staff designers, freelance artists and writers. Clients included high tech, aerospace, medical, dental, financial, hospitality and various non-profit organizations. Owner/Designer Image by Design December 1987  –  January 1991  (3 years 2 months) Successfully operated small and very productive graphic design firm. Areas of focus included brand design, retail and POP, trade show displays, catalogs, signage and package design. Responsible for account acquisition and management, managed staff designers, freelance artists and writers. Clients included high tech, aerospace, medical, dental, financial, hospitality and various non-profit organizations. Graphic Designer/Photographer Eldec Corporation September 1986  –  December 1987  (1 year 4 months) Responsible for design and production of collateral material, corporate advertising, quarterly and annual report design, and various internal and external communications. Graphic Designer/Photographer Eldec Corporation September 1986  –  December 1987  (1 year 4 months) Responsible for design and production of collateral material, corporate advertising, quarterly and annual report design, and various internal and external communications. Graphic Designer/Photographer Ryan Hutchins Advertising March 1984  –  August 1986  (2 years 6 months) Graphic Designer & Photographer for a full-service advertising and public relations firm serving business-to-business clients in financial, industrial, high tech and health care industries. Graphic Designer/Photographer Ryan Hutchins Advertising March 1984  –  August 1986  (2 years 6 months) Graphic Designer & Photographer for a full-service advertising and public relations firm serving business-to-business clients in financial, industrial, high tech and health care industries. Skills Financial Markets Elder Marketing Devoted Marketing Strategy Management Strategic Communications Go-to-market Strategy Art Direction Demand Generation Creative Direction Channel Marketing Communications Integrated Marketing B2B Advertising Web Design Strategic Planning Graphic Design Marketing Strategy Sales Packaging Public Relations Copywriting Trade Shows Product Launch Online Marketing Brand Development Digital Marketing Email Marketing New Business Development Interaction Design Direct Marketing Social Media Marketing Corporate Communications Newsletters Online Advertising Account Management Adobe Creative Suite Branding  Digital Strategy Internal Communications See 27+     See less Skills  Financial Markets Elder Marketing Devoted Marketing Strategy Management Strategic Communications Go-to-market Strategy Art Direction Demand Generation Creative Direction Channel Marketing Communications Integrated Marketing B2B Advertising Web Design Strategic Planning Graphic Design Marketing Strategy Sales Packaging Public Relations Copywriting Trade Shows Product Launch Online Marketing Brand Development Digital Marketing Email Marketing New Business Development Interaction Design Direct Marketing Social Media Marketing Corporate Communications Newsletters Online Advertising Account Management Adobe Creative Suite Branding  Digital Strategy Internal Communications See 27+     See less Financial Markets Elder Marketing Devoted Marketing Strategy Management Strategic Communications Go-to-market Strategy Art Direction Demand Generation Creative Direction Channel Marketing Communications Integrated Marketing B2B Advertising Web Design Strategic Planning Graphic Design Marketing Strategy Sales Packaging Public Relations Copywriting Trade Shows Product Launch Online Marketing Brand Development Digital Marketing Email Marketing New Business Development Interaction Design Direct Marketing Social Media Marketing Corporate Communications Newsletters Online Advertising Account Management Adobe Creative Suite Branding  Digital Strategy Internal Communications See 27+     See less Financial Markets Elder Marketing Devoted Marketing Strategy Management Strategic Communications Go-to-market Strategy Art Direction Demand Generation Creative Direction Channel Marketing Communications Integrated Marketing B2B Advertising Web Design Strategic Planning Graphic Design Marketing Strategy Sales Packaging Public Relations Copywriting Trade Shows Product Launch Online Marketing Brand Development Digital Marketing Email Marketing New Business Development Interaction Design Direct Marketing Social Media Marketing Corporate Communications Newsletters Online Advertising Account Management Adobe Creative Suite Branding  Digital Strategy Internal Communications See 27+     See less Education Oregon State University Bachelor of Fine Arts,  Graphic Design & Advertising. Minor in Photography 1980  – 1984 Oregon State University Bachelor of Fine Arts,  Graphic Design & Advertising. Minor in Photography 1980  – 1984 Oregon State University Bachelor of Fine Arts,  Graphic Design & Advertising. Minor in Photography 1980  – 1984 Oregon State University Bachelor of Fine Arts,  Graphic Design & Advertising. Minor in Photography 1980  – 1984 ", "Summary Results-oriented Senior Executive Assistant with 10+ years supporting VP and C-Level Executives. High-level complex meeting management, multiple calendar coordination and event planning. Excellent organizational and time-management abilities, good business acumen, effective multi-tasking skills and keen attention to detail. \n \nCore Strengths: \nI work comfortably in a role that is incredibly fast paced and often ambiguous. A team player who builds solid partnerships through steady communication, approachability, adaptability and efficiency. I am able to prioritize and anticipate obstacles and can be depended on to deliver with high quality. \n \nMajor Contributions: \n●Successfully on-boarded two Executives new to Intel Corporation (Corporate Vice President of Digital Home- 2012) (Chief Marketing Office - 2014) Coordinated high-level meetings with senior level executives across the company. Built and maintained complex calendar, established cadence for All Hands and Staff meetings, managed new office set up and private conference rooms. This impact ensured a smooth transition into the organization and the company. \n \n●Collaborated with executives on new org set by establishing process and structure. This resulted in building healthy communications, best practices and transparency. \n \n●Planned and delivered multiple industry trade shows, advisory boards and product launch events. \n Summary Results-oriented Senior Executive Assistant with 10+ years supporting VP and C-Level Executives. High-level complex meeting management, multiple calendar coordination and event planning. Excellent organizational and time-management abilities, good business acumen, effective multi-tasking skills and keen attention to detail. \n \nCore Strengths: \nI work comfortably in a role that is incredibly fast paced and often ambiguous. A team player who builds solid partnerships through steady communication, approachability, adaptability and efficiency. I am able to prioritize and anticipate obstacles and can be depended on to deliver with high quality. \n \nMajor Contributions: \n●Successfully on-boarded two Executives new to Intel Corporation (Corporate Vice President of Digital Home- 2012) (Chief Marketing Office - 2014) Coordinated high-level meetings with senior level executives across the company. Built and maintained complex calendar, established cadence for All Hands and Staff meetings, managed new office set up and private conference rooms. This impact ensured a smooth transition into the organization and the company. \n \n●Collaborated with executives on new org set by establishing process and structure. This resulted in building healthy communications, best practices and transparency. \n \n●Planned and delivered multiple industry trade shows, advisory boards and product launch events. \n Results-oriented Senior Executive Assistant with 10+ years supporting VP and C-Level Executives. High-level complex meeting management, multiple calendar coordination and event planning. Excellent organizational and time-management abilities, good business acumen, effective multi-tasking skills and keen attention to detail. \n \nCore Strengths: \nI work comfortably in a role that is incredibly fast paced and often ambiguous. A team player who builds solid partnerships through steady communication, approachability, adaptability and efficiency. I am able to prioritize and anticipate obstacles and can be depended on to deliver with high quality. \n \nMajor Contributions: \n●Successfully on-boarded two Executives new to Intel Corporation (Corporate Vice President of Digital Home- 2012) (Chief Marketing Office - 2014) Coordinated high-level meetings with senior level executives across the company. Built and maintained complex calendar, established cadence for All Hands and Staff meetings, managed new office set up and private conference rooms. This impact ensured a smooth transition into the organization and the company. \n \n●Collaborated with executives on new org set by establishing process and structure. This resulted in building healthy communications, best practices and transparency. \n \n●Planned and delivered multiple industry trade shows, advisory boards and product launch events. \n Results-oriented Senior Executive Assistant with 10+ years supporting VP and C-Level Executives. High-level complex meeting management, multiple calendar coordination and event planning. Excellent organizational and time-management abilities, good business acumen, effective multi-tasking skills and keen attention to detail. \n \nCore Strengths: \nI work comfortably in a role that is incredibly fast paced and often ambiguous. A team player who builds solid partnerships through steady communication, approachability, adaptability and efficiency. I am able to prioritize and anticipate obstacles and can be depended on to deliver with high quality. \n \nMajor Contributions: \n●Successfully on-boarded two Executives new to Intel Corporation (Corporate Vice President of Digital Home- 2012) (Chief Marketing Office - 2014) Coordinated high-level meetings with senior level executives across the company. Built and maintained complex calendar, established cadence for All Hands and Staff meetings, managed new office set up and private conference rooms. This impact ensured a smooth transition into the organization and the company. \n \n●Collaborated with executives on new org set by establishing process and structure. This resulted in building healthy communications, best practices and transparency. \n \n●Planned and delivered multiple industry trade shows, advisory boards and product launch events. \n Experience Senior Executive Assistant GoDaddy June 2014  – Present (1 year 3 months) Sunnyvale, California Provide support to three Senior Vice Presidents by managing complex calendars and providing time management solutions. \n \n● Execute end-to-end global travel and meeting schedules for multiple internal and external site visits to strengthen partnerships. \n \n● Manage team building activities and quarterly Town hall meetings to continue good company morale and communications. \n \n● Partnered with SVP on restructuring a 100+ organization by building structure and clear communication processes. \n \n Senior Executive Assistant - Corporate Marketing Intel Corporation February 2012  –  June 2014  (2 years 5 months) Santa Clara, California Provide support to the VP of Retail and Senior Director, Corporate Initiatives. \n \n● Assisted in building Corporate Initiatives organization from ground up which established cadence and process that made a positive \nimpact. \n \n● Served as back up support to the Chief Marketing Officer, which created a seamless and consistent support model. \n \n● Purchase order specialist between agency and customer interface on agreements and procedures that streamlined contract and \npayment process. \n Senior Executive Assistant - Digital Home Group Intel Corporation December 2009  –  February 2012  (2 years 3 months) Santa Clara, California Provide support to the Chief of Staff, General Manager and Controller. Back up support to SVP of Digital Home. \n \n● Managed Google TV internal Roadshow product launch logistics across multiple sites. \n \n● Aided on-site at various trade shows handling executive level customer meetings, transportation schedules, and booth support.. Served as Point of contact for VIP celebrity guest by managing travel, meeting schedule and on-site support as needed. \n \n● Participated in the interview process for new Chief Of Staff to the SVP, Engineering Technical Assistant and Administrative support positions within the organization. \n Executive Assistant Intel Corporation May 2008  –  December 2009  (1 year 8 months) Santa Clara, CA Managed administrative support services for the VP, GM and a Technical Assistant of the Mobility Consumer PC Group. Also assisted the Director of Business Development, Planning and Operations for the Digital Home Group. \n \n● Set up, organized and managed calendars, meetings and events, travel and expense reports \n \n● Led team of five administrative staff to assist in driving operational business processes \n \n● Supported GM in startup of a new organization for a 7-month re-deployment assignment \n \n● Managed meeting coordination for Product Line Business Plan over eight week period \n \n Executive Assistant Intel Corporation November 2005  –  December 2007  (2 years 2 months) Folsom, Californa Provide support to the Senior Engineering Manager and five direct reports. \n \n Executive Assistant Apple September 2001  –  October 2002  (1 year 2 months) Cupertino, California Supported the Senior Director of Education Finance and six direct reports.  \n \n● Managed heavy calendar and coordinated internal and external meetings \n \n● Served as administrative resource for teams of 100+ within organizations \n \n● Managed scheduling logistics for team conferences/seminars with up to 100 participants \n \n \n Executive Assistant Scios December 1999  –  July 2001  (1 year 8 months) Sunnyvale, California Provided high level administrative support to the VP of Cardio Renal Research and five direct reports  Senior Administrative Assistant | Training Coordinator VeriFone February 1998  –  October 1999  (1 year 9 months) Santa Clara, CA Provided support to the CFO. Training Coordinator for global business information system roll out. Administrative Assistant Apple February 1992  –  February 1998  (6 years 1 month) Cupertino, CA Supported the Senior Director of Software Engineering and seven direct reports.  \n \n● Managed heavy calendar, team events, space planning, org charts, travel and expense reports. \n● Served as administrative resource for a team of 100+ within organization. \n● Trained and supervised administrative staff member. \n \n \n \n Senior Executive Assistant GoDaddy June 2014  – Present (1 year 3 months) Sunnyvale, California Provide support to three Senior Vice Presidents by managing complex calendars and providing time management solutions. \n \n● Execute end-to-end global travel and meeting schedules for multiple internal and external site visits to strengthen partnerships. \n \n● Manage team building activities and quarterly Town hall meetings to continue good company morale and communications. \n \n● Partnered with SVP on restructuring a 100+ organization by building structure and clear communication processes. \n \n Senior Executive Assistant GoDaddy June 2014  – Present (1 year 3 months) Sunnyvale, California Provide support to three Senior Vice Presidents by managing complex calendars and providing time management solutions. \n \n● Execute end-to-end global travel and meeting schedules for multiple internal and external site visits to strengthen partnerships. \n \n● Manage team building activities and quarterly Town hall meetings to continue good company morale and communications. \n \n● Partnered with SVP on restructuring a 100+ organization by building structure and clear communication processes. \n \n Senior Executive Assistant - Corporate Marketing Intel Corporation February 2012  –  June 2014  (2 years 5 months) Santa Clara, California Provide support to the VP of Retail and Senior Director, Corporate Initiatives. \n \n● Assisted in building Corporate Initiatives organization from ground up which established cadence and process that made a positive \nimpact. \n \n● Served as back up support to the Chief Marketing Officer, which created a seamless and consistent support model. \n \n● Purchase order specialist between agency and customer interface on agreements and procedures that streamlined contract and \npayment process. \n Senior Executive Assistant - Corporate Marketing Intel Corporation February 2012  –  June 2014  (2 years 5 months) Santa Clara, California Provide support to the VP of Retail and Senior Director, Corporate Initiatives. \n \n● Assisted in building Corporate Initiatives organization from ground up which established cadence and process that made a positive \nimpact. \n \n● Served as back up support to the Chief Marketing Officer, which created a seamless and consistent support model. \n \n● Purchase order specialist between agency and customer interface on agreements and procedures that streamlined contract and \npayment process. \n Senior Executive Assistant - Digital Home Group Intel Corporation December 2009  –  February 2012  (2 years 3 months) Santa Clara, California Provide support to the Chief of Staff, General Manager and Controller. Back up support to SVP of Digital Home. \n \n● Managed Google TV internal Roadshow product launch logistics across multiple sites. \n \n● Aided on-site at various trade shows handling executive level customer meetings, transportation schedules, and booth support.. Served as Point of contact for VIP celebrity guest by managing travel, meeting schedule and on-site support as needed. \n \n● Participated in the interview process for new Chief Of Staff to the SVP, Engineering Technical Assistant and Administrative support positions within the organization. \n Senior Executive Assistant - Digital Home Group Intel Corporation December 2009  –  February 2012  (2 years 3 months) Santa Clara, California Provide support to the Chief of Staff, General Manager and Controller. Back up support to SVP of Digital Home. \n \n● Managed Google TV internal Roadshow product launch logistics across multiple sites. \n \n● Aided on-site at various trade shows handling executive level customer meetings, transportation schedules, and booth support.. Served as Point of contact for VIP celebrity guest by managing travel, meeting schedule and on-site support as needed. \n \n● Participated in the interview process for new Chief Of Staff to the SVP, Engineering Technical Assistant and Administrative support positions within the organization. \n Executive Assistant Intel Corporation May 2008  –  December 2009  (1 year 8 months) Santa Clara, CA Managed administrative support services for the VP, GM and a Technical Assistant of the Mobility Consumer PC Group. Also assisted the Director of Business Development, Planning and Operations for the Digital Home Group. \n \n● Set up, organized and managed calendars, meetings and events, travel and expense reports \n \n● Led team of five administrative staff to assist in driving operational business processes \n \n● Supported GM in startup of a new organization for a 7-month re-deployment assignment \n \n● Managed meeting coordination for Product Line Business Plan over eight week period \n \n Executive Assistant Intel Corporation May 2008  –  December 2009  (1 year 8 months) Santa Clara, CA Managed administrative support services for the VP, GM and a Technical Assistant of the Mobility Consumer PC Group. Also assisted the Director of Business Development, Planning and Operations for the Digital Home Group. \n \n● Set up, organized and managed calendars, meetings and events, travel and expense reports \n \n● Led team of five administrative staff to assist in driving operational business processes \n \n● Supported GM in startup of a new organization for a 7-month re-deployment assignment \n \n● Managed meeting coordination for Product Line Business Plan over eight week period \n \n Executive Assistant Intel Corporation November 2005  –  December 2007  (2 years 2 months) Folsom, Californa Provide support to the Senior Engineering Manager and five direct reports. \n \n Executive Assistant Intel Corporation November 2005  –  December 2007  (2 years 2 months) Folsom, Californa Provide support to the Senior Engineering Manager and five direct reports. \n \n Executive Assistant Apple September 2001  –  October 2002  (1 year 2 months) Cupertino, California Supported the Senior Director of Education Finance and six direct reports.  \n \n● Managed heavy calendar and coordinated internal and external meetings \n \n● Served as administrative resource for teams of 100+ within organizations \n \n● Managed scheduling logistics for team conferences/seminars with up to 100 participants \n \n \n Executive Assistant Apple September 2001  –  October 2002  (1 year 2 months) Cupertino, California Supported the Senior Director of Education Finance and six direct reports.  \n \n● Managed heavy calendar and coordinated internal and external meetings \n \n● Served as administrative resource for teams of 100+ within organizations \n \n● Managed scheduling logistics for team conferences/seminars with up to 100 participants \n \n \n Executive Assistant Scios December 1999  –  July 2001  (1 year 8 months) Sunnyvale, California Provided high level administrative support to the VP of Cardio Renal Research and five direct reports  Executive Assistant Scios December 1999  –  July 2001  (1 year 8 months) Sunnyvale, California Provided high level administrative support to the VP of Cardio Renal Research and five direct reports  Senior Administrative Assistant | Training Coordinator VeriFone February 1998  –  October 1999  (1 year 9 months) Santa Clara, CA Provided support to the CFO. Training Coordinator for global business information system roll out. Senior Administrative Assistant | Training Coordinator VeriFone February 1998  –  October 1999  (1 year 9 months) Santa Clara, CA Provided support to the CFO. Training Coordinator for global business information system roll out. Administrative Assistant Apple February 1992  –  February 1998  (6 years 1 month) Cupertino, CA Supported the Senior Director of Software Engineering and seven direct reports.  \n \n● Managed heavy calendar, team events, space planning, org charts, travel and expense reports. \n● Served as administrative resource for a team of 100+ within organization. \n● Trained and supervised administrative staff member. \n \n \n \n Administrative Assistant Apple February 1992  –  February 1998  (6 years 1 month) Cupertino, CA Supported the Senior Director of Software Engineering and seven direct reports.  \n \n● Managed heavy calendar, team events, space planning, org charts, travel and expense reports. \n● Served as administrative resource for a team of 100+ within organization. \n● Trained and supervised administrative staff member. \n \n \n \n Skills Executive Support Calendars Event Planning Operational Planning Multi Tasking Contract Negotiation Project Coordination Outlook Administrative Support Word Conferences Excel Telephone Skills Microsoft Office Problem Solving SharePoint Time Management Work Under Minimal... Self-starter Peer Mentoring Dependable Team Player Relocation See 7+     See less Skills  Executive Support Calendars Event Planning Operational Planning Multi Tasking Contract Negotiation Project Coordination Outlook Administrative Support Word Conferences Excel Telephone Skills Microsoft Office Problem Solving SharePoint Time Management Work Under Minimal... Self-starter Peer Mentoring Dependable Team Player Relocation See 7+     See less Executive Support Calendars Event Planning Operational Planning Multi Tasking Contract Negotiation Project Coordination Outlook Administrative Support Word Conferences Excel Telephone Skills Microsoft Office Problem Solving SharePoint Time Management Work Under Minimal... Self-starter Peer Mentoring Dependable Team Player Relocation See 7+     See less Executive Support Calendars Event Planning Operational Planning Multi Tasking Contract Negotiation Project Coordination Outlook Administrative Support Word Conferences Excel Telephone Skills Microsoft Office Problem Solving SharePoint Time Management Work Under Minimal... Self-starter Peer Mentoring Dependable Team Player Relocation See 7+     See less ", "Experience Vice President, Corporate Communications Autodesk 2007  –  2012  (5 years) San Francisco, CA Director, Communications Gordon and Betty Moore Foundation 2006  –  2007  (1 year) San Francisco Bay Area Global Leader, Technology Practice Edelman 2005  –  2006  (1 year) San Francisco Bay Area Vice President, Corporate Communications Intel Corporation 2004  –  2005  (1 year) Santa Clara, CA Vice President, Corporate Marketing Intel Corporation 2000  –  2004  (4 years) Santa Clara, CA Vice President, Worldwide Press Relations Intel Corporation 1995  –  2000  (5 years) Santa Clara, CA Director, Worldwide Press Relations Intel Corporation 1992  –  1995  (3 years) Santa Clara, CA Manager, Corporate Press Relations Intel Corporation 1987  –  1992  (5 years) Santa Clara, CA Vice President, Corporate Communications Autodesk 2007  –  2012  (5 years) San Francisco, CA Vice President, Corporate Communications Autodesk 2007  –  2012  (5 years) San Francisco, CA Director, Communications Gordon and Betty Moore Foundation 2006  –  2007  (1 year) San Francisco Bay Area Director, Communications Gordon and Betty Moore Foundation 2006  –  2007  (1 year) San Francisco Bay Area Global Leader, Technology Practice Edelman 2005  –  2006  (1 year) San Francisco Bay Area Global Leader, Technology Practice Edelman 2005  –  2006  (1 year) San Francisco Bay Area Vice President, Corporate Communications Intel Corporation 2004  –  2005  (1 year) Santa Clara, CA Vice President, Corporate Communications Intel Corporation 2004  –  2005  (1 year) Santa Clara, CA Vice President, Corporate Marketing Intel Corporation 2000  –  2004  (4 years) Santa Clara, CA Vice President, Corporate Marketing Intel Corporation 2000  –  2004  (4 years) Santa Clara, CA Vice President, Worldwide Press Relations Intel Corporation 1995  –  2000  (5 years) Santa Clara, CA Vice President, Worldwide Press Relations Intel Corporation 1995  –  2000  (5 years) Santa Clara, CA Director, Worldwide Press Relations Intel Corporation 1992  –  1995  (3 years) Santa Clara, CA Director, Worldwide Press Relations Intel Corporation 1992  –  1995  (3 years) Santa Clara, CA Manager, Corporate Press Relations Intel Corporation 1987  –  1992  (5 years) Santa Clara, CA Manager, Corporate Press Relations Intel Corporation 1987  –  1992  (5 years) Santa Clara, CA Skills Corporate Communications Integrated Marketing Skills  Corporate Communications Integrated Marketing Corporate Communications Integrated Marketing Corporate Communications Integrated Marketing Education University of Santa Clara BA,  English University of Santa Clara BA,  English University of Santa Clara BA,  English University of Santa Clara BA,  English ", "Summary Specialties: Marketing (Branding, Advertising, PR), Business Operations, Creative Writing Summary Specialties: Marketing (Branding, Advertising, PR), Business Operations, Creative Writing Specialties: Marketing (Branding, Advertising, PR), Business Operations, Creative Writing Specialties: Marketing (Branding, Advertising, PR), Business Operations, Creative Writing Experience Corporate Marketing Intel Corporation June 2011  – Present (4 years 3 months) Marketing Messaging Strategist Writer None January 2008  –  June 2011  (3 years 6 months) Conducted research and worked on a novel. Corporate Marketing Intel Corporation September 1993  –  December 2007  (14 years 4 months) Business Operations, Press Relations  \nGroup Manager, Consumer PR & Corporate Events \nAdvertising Manager VP Account Supervisor Saatchi & Saatchi September 1985  –  September 1993  (8 years 1 month) Accounts: Hewlett-Packard Company & Blue Diamond Almonds Corporate Marketing Intel Corporation June 2011  – Present (4 years 3 months) Marketing Messaging Strategist Corporate Marketing Intel Corporation June 2011  – Present (4 years 3 months) Marketing Messaging Strategist Writer None January 2008  –  June 2011  (3 years 6 months) Conducted research and worked on a novel. Writer None January 2008  –  June 2011  (3 years 6 months) Conducted research and worked on a novel. Corporate Marketing Intel Corporation September 1993  –  December 2007  (14 years 4 months) Business Operations, Press Relations  \nGroup Manager, Consumer PR & Corporate Events \nAdvertising Manager Corporate Marketing Intel Corporation September 1993  –  December 2007  (14 years 4 months) Business Operations, Press Relations  \nGroup Manager, Consumer PR & Corporate Events \nAdvertising Manager VP Account Supervisor Saatchi & Saatchi September 1985  –  September 1993  (8 years 1 month) Accounts: Hewlett-Packard Company & Blue Diamond Almonds VP Account Supervisor Saatchi & Saatchi September 1985  –  September 1993  (8 years 1 month) Accounts: Hewlett-Packard Company & Blue Diamond Almonds Skills Public Relations Creative Writing Advertising Marketing Copy Editing Copywriting Editing Proofreading Press Releases Newsletters Skills  Public Relations Creative Writing Advertising Marketing Copy Editing Copywriting Editing Proofreading Press Releases Newsletters Public Relations Creative Writing Advertising Marketing Copy Editing Copywriting Editing Proofreading Press Releases Newsletters Public Relations Creative Writing Advertising Marketing Copy Editing Copywriting Editing Proofreading Press Releases Newsletters Education Montana State University-Bozeman Bachelor of Arts,  Speech Communication 1981  – 1985 Minor in Creative Writing Montana State University-Bozeman Bachelor of Arts,  Speech Communication 1981  – 1985 Minor in Creative Writing Montana State University-Bozeman Bachelor of Arts,  Speech Communication 1981  – 1985 Minor in Creative Writing Montana State University-Bozeman Bachelor of Arts,  Speech Communication 1981  – 1985 Minor in Creative Writing ", "Summary - 20+ years of producing world-class communications for startups to Fortune 100 high tech and consumer companies \n- Proven ability to build worldwide public relations strategies and communications programs to support corporate objectives  \n- Experience in leading large corporate organizations and agency account teams to produce high tech company and product launches, industry events, and communications programs which achieve outstanding results and promote corporate brands Summary - 20+ years of producing world-class communications for startups to Fortune 100 high tech and consumer companies \n- Proven ability to build worldwide public relations strategies and communications programs to support corporate objectives  \n- Experience in leading large corporate organizations and agency account teams to produce high tech company and product launches, industry events, and communications programs which achieve outstanding results and promote corporate brands - 20+ years of producing world-class communications for startups to Fortune 100 high tech and consumer companies \n- Proven ability to build worldwide public relations strategies and communications programs to support corporate objectives  \n- Experience in leading large corporate organizations and agency account teams to produce high tech company and product launches, industry events, and communications programs which achieve outstanding results and promote corporate brands - 20+ years of producing world-class communications for startups to Fortune 100 high tech and consumer companies \n- Proven ability to build worldwide public relations strategies and communications programs to support corporate objectives  \n- Experience in leading large corporate organizations and agency account teams to produce high tech company and product launches, industry events, and communications programs which achieve outstanding results and promote corporate brands Experience President Herrick Media 2010  – Present (5 years) Silicon Valley Directing strategic communications agency dedicated to delivering results for companies ranging in size from start-ups to Fortune 500 corporations, in strategic communications, thought leadership, media relations, social media marketing (blogs, videos, website content development, interactive marketing programs), analyst relations, customer communications, executive and internal communications. Senior Vice President McGrath/Power Public Relations 2006  –  2010  (4 years) Director, Corporate Marketing Intel Corporation 2003  –  2005  (2 years) Director, Worldwide Press Relations Intel Corporation 2000  –  2003  (3 years) Various PR Management Positions Intel Corporation 1987  –  2000  (13 years) President Herrick Media 2010  – Present (5 years) Silicon Valley Directing strategic communications agency dedicated to delivering results for companies ranging in size from start-ups to Fortune 500 corporations, in strategic communications, thought leadership, media relations, social media marketing (blogs, videos, website content development, interactive marketing programs), analyst relations, customer communications, executive and internal communications. President Herrick Media 2010  – Present (5 years) Silicon Valley Directing strategic communications agency dedicated to delivering results for companies ranging in size from start-ups to Fortune 500 corporations, in strategic communications, thought leadership, media relations, social media marketing (blogs, videos, website content development, interactive marketing programs), analyst relations, customer communications, executive and internal communications. Senior Vice President McGrath/Power Public Relations 2006  –  2010  (4 years) Senior Vice President McGrath/Power Public Relations 2006  –  2010  (4 years) Director, Corporate Marketing Intel Corporation 2003  –  2005  (2 years) Director, Corporate Marketing Intel Corporation 2003  –  2005  (2 years) Director, Worldwide Press Relations Intel Corporation 2000  –  2003  (3 years) Director, Worldwide Press Relations Intel Corporation 2000  –  2003  (3 years) Various PR Management Positions Intel Corporation 1987  –  2000  (13 years) Various PR Management Positions Intel Corporation 1987  –  2000  (13 years) Skills Media Relations Corporate Communications Analyst Relations Integrated Marketing Strategic Communications Internal Communications Public Relations Marketing Communications Speech Writing Blogging Corporate Branding Content Development Marketing Strategy Social Media Marketing Thought Leadership Start-ups Social Media Marketing Strategic Partnerships See 4+     See less Skills  Media Relations Corporate Communications Analyst Relations Integrated Marketing Strategic Communications Internal Communications Public Relations Marketing Communications Speech Writing Blogging Corporate Branding Content Development Marketing Strategy Social Media Marketing Thought Leadership Start-ups Social Media Marketing Strategic Partnerships See 4+     See less Media Relations Corporate Communications Analyst Relations Integrated Marketing Strategic Communications Internal Communications Public Relations Marketing Communications Speech Writing Blogging Corporate Branding Content Development Marketing Strategy Social Media Marketing Thought Leadership Start-ups Social Media Marketing Strategic Partnerships See 4+     See less Media Relations Corporate Communications Analyst Relations Integrated Marketing Strategic Communications Internal Communications Public Relations Marketing Communications Speech Writing Blogging Corporate Branding Content Development Marketing Strategy Social Media Marketing Thought Leadership Start-ups Social Media Marketing Strategic Partnerships See 4+     See less Education San Jose State University B.A. San Jose State University B.A. San Jose State University B.A. San Jose State University B.A. ", "Summary Objective: \nA leadership position guiding financial planning and analysis and decision making in a growing organization.  \n \nSummary of Skills: \nA proven leader in finance, marketing, and information technology who uses technical skills, creativity and business partnering to drive sound business decisions and to tackle complex issues. Led a large team to successfully drive significant financial business process change and implement new financial systems, including a new G/L resulting in a shorter close cycle worldwide for Intel. Over 18 years of FP&A experience in small, medium and large companies. Demonstrated risk taking and entrepreneurial skills by creating an award winning retail and manufacturing company. Specialties:Financial Planning & Analysis Leadership \nFinance System Program Management Summary Objective: \nA leadership position guiding financial planning and analysis and decision making in a growing organization.  \n \nSummary of Skills: \nA proven leader in finance, marketing, and information technology who uses technical skills, creativity and business partnering to drive sound business decisions and to tackle complex issues. Led a large team to successfully drive significant financial business process change and implement new financial systems, including a new G/L resulting in a shorter close cycle worldwide for Intel. Over 18 years of FP&A experience in small, medium and large companies. Demonstrated risk taking and entrepreneurial skills by creating an award winning retail and manufacturing company. Specialties:Financial Planning & Analysis Leadership \nFinance System Program Management Objective: \nA leadership position guiding financial planning and analysis and decision making in a growing organization.  \n \nSummary of Skills: \nA proven leader in finance, marketing, and information technology who uses technical skills, creativity and business partnering to drive sound business decisions and to tackle complex issues. Led a large team to successfully drive significant financial business process change and implement new financial systems, including a new G/L resulting in a shorter close cycle worldwide for Intel. Over 18 years of FP&A experience in small, medium and large companies. Demonstrated risk taking and entrepreneurial skills by creating an award winning retail and manufacturing company. Specialties:Financial Planning & Analysis Leadership \nFinance System Program Management Objective: \nA leadership position guiding financial planning and analysis and decision making in a growing organization.  \n \nSummary of Skills: \nA proven leader in finance, marketing, and information technology who uses technical skills, creativity and business partnering to drive sound business decisions and to tackle complex issues. Led a large team to successfully drive significant financial business process change and implement new financial systems, including a new G/L resulting in a shorter close cycle worldwide for Intel. Over 18 years of FP&A experience in small, medium and large companies. Demonstrated risk taking and entrepreneurial skills by creating an award winning retail and manufacturing company. Specialties:Financial Planning & Analysis Leadership \nFinance System Program Management Experience Sr. Controller, World Wide Revenue and SMG Risk Management Intel October 2014  – Present (11 months) San Francisco Bay Area President and CEO Mary Loomas Chocolates, Inc. DBA Saratoga Chocolates October 2005  – Present (9 years 11 months) Created award winning Chocolate confection company including business planning, build-out, recipe development, and all aspects of starting up a retail and manufacturing facility. Developed strong brand identity, website with shopping cart, and faithful customer following. Grew annual revenue each year by 30%. Opened second store location in San Francisco in 2009. Developed staff to run business independently and developed procedures and processes to ensure consistent business practices and customer service. Business has been featured in Fortune Small Business, Eucalyptus, Gentry, and Vine Times magazines. Sr. Controller Next Generation FP&A Intel May 2011  –  October 2014  (3 years 6 months) Director Finance E-Business Solutions Intel Corporation January 2003  –  February 2004  (1 year 2 months) Responsible for Finance Systems at Intel. This included delivering and maintaining all core finance systems and associated business processes including Close & Reporting; Forecasting; Cost & Inventory; and Tax, License, & Customs. Responsibilities include stakeholder management and alignment, program management, and business support. Awarded Finance Achievement Award, Intel, June 2003, Finance Advanced Leadership Development Program Sr. Controller, Finance – PARIS Intel Corporation January 2000  –  January 2003  (3 years 1 month) Led worldwide, cross functional team of 290 to re-engineer over 130 major finance and accounting business processes and implemented a full suite of new financial management tools including SAP General Ledger, a budgets and planning application, finance portal, enterprise data warehouse, reporting suite, journal entry tool, and maintenance & security applications. Implemented new chart of accounts, which required over 480 downstream applications at Intel to be updated. Led senior finance management through significant process standardization activities. Enabled quick turnaround to accommodate new requirements to meet Sarbanes-Oaxley act as well as established the foundation to meet a three day, corporation-wide close calendar. Controller, Corporate Marketing Intel Corporation February 1999  –  January 2000  (1 year) Managed team of 25 and responsible for financial support of Intel’s Corporate Marketing Group. This included budgets & planning, ROI analysis, controls management, and negotiation support of marketing contracts. Additional responsibilities included financial consolidations of worldwide Sales and Marketing budgets; allocations of expenses to divisions; employee bonus development, tracking and grading; and capital management. Accomplishments: Kicked off and led cross functional team to develop Intel’s marketing strategy for PC’s as a benefit and led cross-functional team to develop Intel’s marketing strategy in reaction to the ‘free’ PC market. Awarded Finance Achievement Award, Intel, SIPC Core Team, 1999 Cost & Inventory Manager Intel Corporation December 1996  –  February 1999  (2 years 3 months) Managed team of 15 financial analysts and programmers responsible for the business process and software application that is used to calculate product cost, gross and net inventory, and cost of sales information for 98% of Intel’s divisions. Responsibilities included ensuring a smooth month-end close process, high quality end-user support, and accurate data that meet internal and external reporting requirements. Additional responsibilities included providing leadership and expertise to Intel factories, divisions, and the tax and legal departments on issues regarding P&L management, cost accounting, cost management, and inventory controls. Accomplishments: Developed new methodologies for the financial treatment of excess capacity, factory shutdowns, and equipment write-offs to ensure consistent accounting of such events; developed improved cycle count procedures and high value inventory controls to address several audit findings as well as delivered training to all sites on the new procedures; implemented Intel’s cost system at several new sites (China, Costa Rica, Ireland, Kulim); and integrated newly acquired companies (DEC, C&T) on very tight schedules with no major problems. Finance Manager/Sr. Financial Analyst - Technology Development Intel Corporation September 1994  –  December 1996  (2 years 4 months) Facilities Construction Technology Finance Manager, June 1996 - December 1996 \nManaged a short-term project to provide benchmark studies on construction industry financial controls. This project was credited with significantly reducing Intel’s construction cost overruns. \nTechnology Manufacturing Engineering Finance Manager, July 1995 - August 1996  \nManaged a finance team responsible for supporting a 400 person engineering organization which developed, selected, and purchased factory equipment for Intel; operated Intel’s mask operation; and provided factory automation solutions. This position managed six analysts responsible for vendor investment and selection analyses, vendor compliance audits, automation decisions and factory optimization analyses. Additional responsibilities included conducting budgets and planning activities for the organization. Initiated seven vendor “Most Favored Customer pricing” contract audits working with external auditors and suppliers to negotiate acceptable audit procedures, schedules, and participation levels. Audits resulted in saving Intel $28M on vendor contracts. \nCorporate Quality Network Finance, September 1994 - July 1995 Division Controller/Business Manager BAE Systems June 1986  –  August 1994  (8 years 3 months) Business Manager/Division Controller, November 1993 - August 1994 \nResponsible for financial planning, reporting, and control for the Advanced Systems division including P&L analysis for new products and the overall division, revenue forecasting, orders, and expense and performance metrics. Actively participated in negotiations with customers and strategic alliances. Managed department of seven. Also led and coordinated strategic planning for this division to ensure that their Mission and Objectives were successful. Developed business plan for, and negotiated strategic sales agreement with, Standard Electric Lorenz, a German manufacturer, for exclusive sales rights to their fiber optic gyroscopes in the United States. \nManager, Proposal Operations and Advanced Systems Administration, February 1990 - November 1993 \nResponsible for managing the Advanced Systems division finance department as well as business development responsibility for directing all new business proposal operations. Led proposal teams of up to 35 people. Managed marketing administration functions including market research, trade shows, and advertising. Owned marketing and sales responsibilities for fiber optic gyroscope-based systems including identification of production applications and customers. Managed department of 4 financial and 2 marketing analysts. Awarded Company Employee of the Year, Lear Astronics Corp., 1990 \nOther positions included Sr. Financial Analyst, Financial Analyst: Engineering and Program Management: June 1986 - February 1990. Sr. Controller, World Wide Revenue and SMG Risk Management Intel October 2014  – Present (11 months) San Francisco Bay Area Sr. Controller, World Wide Revenue and SMG Risk Management Intel October 2014  – Present (11 months) San Francisco Bay Area President and CEO Mary Loomas Chocolates, Inc. DBA Saratoga Chocolates October 2005  – Present (9 years 11 months) Created award winning Chocolate confection company including business planning, build-out, recipe development, and all aspects of starting up a retail and manufacturing facility. Developed strong brand identity, website with shopping cart, and faithful customer following. Grew annual revenue each year by 30%. Opened second store location in San Francisco in 2009. Developed staff to run business independently and developed procedures and processes to ensure consistent business practices and customer service. Business has been featured in Fortune Small Business, Eucalyptus, Gentry, and Vine Times magazines. President and CEO Mary Loomas Chocolates, Inc. DBA Saratoga Chocolates October 2005  – Present (9 years 11 months) Created award winning Chocolate confection company including business planning, build-out, recipe development, and all aspects of starting up a retail and manufacturing facility. Developed strong brand identity, website with shopping cart, and faithful customer following. Grew annual revenue each year by 30%. Opened second store location in San Francisco in 2009. Developed staff to run business independently and developed procedures and processes to ensure consistent business practices and customer service. Business has been featured in Fortune Small Business, Eucalyptus, Gentry, and Vine Times magazines. Sr. Controller Next Generation FP&A Intel May 2011  –  October 2014  (3 years 6 months) Sr. Controller Next Generation FP&A Intel May 2011  –  October 2014  (3 years 6 months) Director Finance E-Business Solutions Intel Corporation January 2003  –  February 2004  (1 year 2 months) Responsible for Finance Systems at Intel. This included delivering and maintaining all core finance systems and associated business processes including Close & Reporting; Forecasting; Cost & Inventory; and Tax, License, & Customs. Responsibilities include stakeholder management and alignment, program management, and business support. Awarded Finance Achievement Award, Intel, June 2003, Finance Advanced Leadership Development Program Director Finance E-Business Solutions Intel Corporation January 2003  –  February 2004  (1 year 2 months) Responsible for Finance Systems at Intel. This included delivering and maintaining all core finance systems and associated business processes including Close & Reporting; Forecasting; Cost & Inventory; and Tax, License, & Customs. Responsibilities include stakeholder management and alignment, program management, and business support. Awarded Finance Achievement Award, Intel, June 2003, Finance Advanced Leadership Development Program Sr. Controller, Finance – PARIS Intel Corporation January 2000  –  January 2003  (3 years 1 month) Led worldwide, cross functional team of 290 to re-engineer over 130 major finance and accounting business processes and implemented a full suite of new financial management tools including SAP General Ledger, a budgets and planning application, finance portal, enterprise data warehouse, reporting suite, journal entry tool, and maintenance & security applications. Implemented new chart of accounts, which required over 480 downstream applications at Intel to be updated. Led senior finance management through significant process standardization activities. Enabled quick turnaround to accommodate new requirements to meet Sarbanes-Oaxley act as well as established the foundation to meet a three day, corporation-wide close calendar. Sr. Controller, Finance – PARIS Intel Corporation January 2000  –  January 2003  (3 years 1 month) Led worldwide, cross functional team of 290 to re-engineer over 130 major finance and accounting business processes and implemented a full suite of new financial management tools including SAP General Ledger, a budgets and planning application, finance portal, enterprise data warehouse, reporting suite, journal entry tool, and maintenance & security applications. Implemented new chart of accounts, which required over 480 downstream applications at Intel to be updated. Led senior finance management through significant process standardization activities. Enabled quick turnaround to accommodate new requirements to meet Sarbanes-Oaxley act as well as established the foundation to meet a three day, corporation-wide close calendar. Controller, Corporate Marketing Intel Corporation February 1999  –  January 2000  (1 year) Managed team of 25 and responsible for financial support of Intel’s Corporate Marketing Group. This included budgets & planning, ROI analysis, controls management, and negotiation support of marketing contracts. Additional responsibilities included financial consolidations of worldwide Sales and Marketing budgets; allocations of expenses to divisions; employee bonus development, tracking and grading; and capital management. Accomplishments: Kicked off and led cross functional team to develop Intel’s marketing strategy for PC’s as a benefit and led cross-functional team to develop Intel’s marketing strategy in reaction to the ‘free’ PC market. Awarded Finance Achievement Award, Intel, SIPC Core Team, 1999 Controller, Corporate Marketing Intel Corporation February 1999  –  January 2000  (1 year) Managed team of 25 and responsible for financial support of Intel’s Corporate Marketing Group. This included budgets & planning, ROI analysis, controls management, and negotiation support of marketing contracts. Additional responsibilities included financial consolidations of worldwide Sales and Marketing budgets; allocations of expenses to divisions; employee bonus development, tracking and grading; and capital management. Accomplishments: Kicked off and led cross functional team to develop Intel’s marketing strategy for PC’s as a benefit and led cross-functional team to develop Intel’s marketing strategy in reaction to the ‘free’ PC market. Awarded Finance Achievement Award, Intel, SIPC Core Team, 1999 Cost & Inventory Manager Intel Corporation December 1996  –  February 1999  (2 years 3 months) Managed team of 15 financial analysts and programmers responsible for the business process and software application that is used to calculate product cost, gross and net inventory, and cost of sales information for 98% of Intel’s divisions. Responsibilities included ensuring a smooth month-end close process, high quality end-user support, and accurate data that meet internal and external reporting requirements. Additional responsibilities included providing leadership and expertise to Intel factories, divisions, and the tax and legal departments on issues regarding P&L management, cost accounting, cost management, and inventory controls. Accomplishments: Developed new methodologies for the financial treatment of excess capacity, factory shutdowns, and equipment write-offs to ensure consistent accounting of such events; developed improved cycle count procedures and high value inventory controls to address several audit findings as well as delivered training to all sites on the new procedures; implemented Intel’s cost system at several new sites (China, Costa Rica, Ireland, Kulim); and integrated newly acquired companies (DEC, C&T) on very tight schedules with no major problems. Cost & Inventory Manager Intel Corporation December 1996  –  February 1999  (2 years 3 months) Managed team of 15 financial analysts and programmers responsible for the business process and software application that is used to calculate product cost, gross and net inventory, and cost of sales information for 98% of Intel’s divisions. Responsibilities included ensuring a smooth month-end close process, high quality end-user support, and accurate data that meet internal and external reporting requirements. Additional responsibilities included providing leadership and expertise to Intel factories, divisions, and the tax and legal departments on issues regarding P&L management, cost accounting, cost management, and inventory controls. Accomplishments: Developed new methodologies for the financial treatment of excess capacity, factory shutdowns, and equipment write-offs to ensure consistent accounting of such events; developed improved cycle count procedures and high value inventory controls to address several audit findings as well as delivered training to all sites on the new procedures; implemented Intel’s cost system at several new sites (China, Costa Rica, Ireland, Kulim); and integrated newly acquired companies (DEC, C&T) on very tight schedules with no major problems. Finance Manager/Sr. Financial Analyst - Technology Development Intel Corporation September 1994  –  December 1996  (2 years 4 months) Facilities Construction Technology Finance Manager, June 1996 - December 1996 \nManaged a short-term project to provide benchmark studies on construction industry financial controls. This project was credited with significantly reducing Intel’s construction cost overruns. \nTechnology Manufacturing Engineering Finance Manager, July 1995 - August 1996  \nManaged a finance team responsible for supporting a 400 person engineering organization which developed, selected, and purchased factory equipment for Intel; operated Intel’s mask operation; and provided factory automation solutions. This position managed six analysts responsible for vendor investment and selection analyses, vendor compliance audits, automation decisions and factory optimization analyses. Additional responsibilities included conducting budgets and planning activities for the organization. Initiated seven vendor “Most Favored Customer pricing” contract audits working with external auditors and suppliers to negotiate acceptable audit procedures, schedules, and participation levels. Audits resulted in saving Intel $28M on vendor contracts. \nCorporate Quality Network Finance, September 1994 - July 1995 Finance Manager/Sr. Financial Analyst - Technology Development Intel Corporation September 1994  –  December 1996  (2 years 4 months) Facilities Construction Technology Finance Manager, June 1996 - December 1996 \nManaged a short-term project to provide benchmark studies on construction industry financial controls. This project was credited with significantly reducing Intel’s construction cost overruns. \nTechnology Manufacturing Engineering Finance Manager, July 1995 - August 1996  \nManaged a finance team responsible for supporting a 400 person engineering organization which developed, selected, and purchased factory equipment for Intel; operated Intel’s mask operation; and provided factory automation solutions. This position managed six analysts responsible for vendor investment and selection analyses, vendor compliance audits, automation decisions and factory optimization analyses. Additional responsibilities included conducting budgets and planning activities for the organization. Initiated seven vendor “Most Favored Customer pricing” contract audits working with external auditors and suppliers to negotiate acceptable audit procedures, schedules, and participation levels. Audits resulted in saving Intel $28M on vendor contracts. \nCorporate Quality Network Finance, September 1994 - July 1995 Division Controller/Business Manager BAE Systems June 1986  –  August 1994  (8 years 3 months) Business Manager/Division Controller, November 1993 - August 1994 \nResponsible for financial planning, reporting, and control for the Advanced Systems division including P&L analysis for new products and the overall division, revenue forecasting, orders, and expense and performance metrics. Actively participated in negotiations with customers and strategic alliances. Managed department of seven. Also led and coordinated strategic planning for this division to ensure that their Mission and Objectives were successful. Developed business plan for, and negotiated strategic sales agreement with, Standard Electric Lorenz, a German manufacturer, for exclusive sales rights to their fiber optic gyroscopes in the United States. \nManager, Proposal Operations and Advanced Systems Administration, February 1990 - November 1993 \nResponsible for managing the Advanced Systems division finance department as well as business development responsibility for directing all new business proposal operations. Led proposal teams of up to 35 people. Managed marketing administration functions including market research, trade shows, and advertising. Owned marketing and sales responsibilities for fiber optic gyroscope-based systems including identification of production applications and customers. Managed department of 4 financial and 2 marketing analysts. Awarded Company Employee of the Year, Lear Astronics Corp., 1990 \nOther positions included Sr. Financial Analyst, Financial Analyst: Engineering and Program Management: June 1986 - February 1990. Division Controller/Business Manager BAE Systems June 1986  –  August 1994  (8 years 3 months) Business Manager/Division Controller, November 1993 - August 1994 \nResponsible for financial planning, reporting, and control for the Advanced Systems division including P&L analysis for new products and the overall division, revenue forecasting, orders, and expense and performance metrics. Actively participated in negotiations with customers and strategic alliances. Managed department of seven. Also led and coordinated strategic planning for this division to ensure that their Mission and Objectives were successful. Developed business plan for, and negotiated strategic sales agreement with, Standard Electric Lorenz, a German manufacturer, for exclusive sales rights to their fiber optic gyroscopes in the United States. \nManager, Proposal Operations and Advanced Systems Administration, February 1990 - November 1993 \nResponsible for managing the Advanced Systems division finance department as well as business development responsibility for directing all new business proposal operations. Led proposal teams of up to 35 people. Managed marketing administration functions including market research, trade shows, and advertising. Owned marketing and sales responsibilities for fiber optic gyroscope-based systems including identification of production applications and customers. Managed department of 4 financial and 2 marketing analysts. Awarded Company Employee of the Year, Lear Astronics Corp., 1990 \nOther positions included Sr. Financial Analyst, Financial Analyst: Engineering and Program Management: June 1986 - February 1990. Skills Financial Modeling Cost Accounting Cross-functional Team... Forecasting Financial Analysis Process Improvement Financial Forecasting Corporate Finance Skills  Financial Modeling Cost Accounting Cross-functional Team... Forecasting Financial Analysis Process Improvement Financial Forecasting Corporate Finance Financial Modeling Cost Accounting Cross-functional Team... Forecasting Financial Analysis Process Improvement Financial Forecasting Corporate Finance Financial Modeling Cost Accounting Cross-functional Team... Forecasting Financial Analysis Process Improvement Financial Forecasting Corporate Finance Education Loyola Marymount University, College of Business Administration MBA,  Finance 1989  – 1992 University of California, San Diego BA,  Economics/Management Science 1982  – 1986 Chaminde College Prep 1977  – 1982 Loyola Marymount University, College of Business Administration MBA,  Finance 1989  – 1992 Loyola Marymount University, College of Business Administration MBA,  Finance 1989  – 1992 Loyola Marymount University, College of Business Administration MBA,  Finance 1989  – 1992 University of California, San Diego BA,  Economics/Management Science 1982  – 1986 University of California, San Diego BA,  Economics/Management Science 1982  – 1986 University of California, San Diego BA,  Economics/Management Science 1982  – 1986 Chaminde College Prep 1977  – 1982 Chaminde College Prep 1977  – 1982 Chaminde College Prep 1977  – 1982 ", "Summary Managing digital marketing programs since 1999; strong track record of performance in Fortune 500 organizations; successful and experienced in developing and executing strategic plans, as well as building and optimizing digital marketing channels and initiatives to drive acquisition and increase retention. Specialties:acquisition marketing, lead generation, drive growth, direct response marketing, digital media, search marketing (SEO, PPC), affiliate marketing, partnership marketing, display advertising, Demand Side Platforms (DSPs), email marketing, Conversion Optimization Master Certification, website optimization, landing page optimization, behavioral targeting, web analytics, A/B testing, MVT testing, creative testing, customer experience enhancement, online merchandising, brand marketing, retention Summary Managing digital marketing programs since 1999; strong track record of performance in Fortune 500 organizations; successful and experienced in developing and executing strategic plans, as well as building and optimizing digital marketing channels and initiatives to drive acquisition and increase retention. Specialties:acquisition marketing, lead generation, drive growth, direct response marketing, digital media, search marketing (SEO, PPC), affiliate marketing, partnership marketing, display advertising, Demand Side Platforms (DSPs), email marketing, Conversion Optimization Master Certification, website optimization, landing page optimization, behavioral targeting, web analytics, A/B testing, MVT testing, creative testing, customer experience enhancement, online merchandising, brand marketing, retention Managing digital marketing programs since 1999; strong track record of performance in Fortune 500 organizations; successful and experienced in developing and executing strategic plans, as well as building and optimizing digital marketing channels and initiatives to drive acquisition and increase retention. Specialties:acquisition marketing, lead generation, drive growth, direct response marketing, digital media, search marketing (SEO, PPC), affiliate marketing, partnership marketing, display advertising, Demand Side Platforms (DSPs), email marketing, Conversion Optimization Master Certification, website optimization, landing page optimization, behavioral targeting, web analytics, A/B testing, MVT testing, creative testing, customer experience enhancement, online merchandising, brand marketing, retention Managing digital marketing programs since 1999; strong track record of performance in Fortune 500 organizations; successful and experienced in developing and executing strategic plans, as well as building and optimizing digital marketing channels and initiatives to drive acquisition and increase retention. Specialties:acquisition marketing, lead generation, drive growth, direct response marketing, digital media, search marketing (SEO, PPC), affiliate marketing, partnership marketing, display advertising, Demand Side Platforms (DSPs), email marketing, Conversion Optimization Master Certification, website optimization, landing page optimization, behavioral targeting, web analytics, A/B testing, MVT testing, creative testing, customer experience enhancement, online merchandising, brand marketing, retention Experience Vice President, Group Account Director iProspect June 2012  – Present (3 years 3 months) San Francisco Bay Area Manage and provide global digital marketing thought leadership and strategy to Fortune 500 clients with multi-million dollar advertising budgets. Senior Director, Digital Marketing Travelers January 2011  –  June 2012  (1 year 6 months) Hartford, Connecticut Area Led the digital marketing acquisition team to drive B2C leads and sales. Responsible for strategy and operations of multi-million dollar paid search, mobile and display advertising programs as well as landing page optimization. Led team of five marketers. Key accomplishments: grew YoY sales significantly at lower acquisition cost; implemented landing page optimization platform; launched first multivariate landing page test leading to a 36% lift in conversion rate; improved display ad performance via audience targeting (e.g. look-alike modeling, DSPs); oversaw Travelers.com web analytics (including implementation of Coremetrics tags, definition of KPIs, development of reporting/performance insights). \nPresented at SES Chicago 2011 on \"Organizational Buy-In Strategies to Testing\". Senior Marketing Manager/Digital Marketing Strategist, Corporate Marketing Intel Corporation October 2008  –  December 2010  (2 years 3 months) Santa Clara, CA Evangelized online testing, optimization, and web analytics across the org [change agent]; appointed as resident digital marketing expert and consultant on marketing campaigns to account/campaign managers within the Partner Marketing Group; led Intel’s multi-million dollar landing experience program on OEM websites to influence end consumers’ purchasing decision and drive upsell worldwide. Key accomplishments: overhauled the global direction and goals of the landing experience program with emphasis on data based decision-making, testing and optimization; introduced and launched predictive optimization technology on landing pages to increase processor conversion and upsell rate; introduced A/B landing page testing leading to a lift in response of over 90%. \nPresented: \"Intel’s CRO Strategy with Partners” at Conversion Camp 2010 in Frankfurt, Germany and “Intel Partner Marketing: Instilling a Testing Culture and CRO Case Study” (webinar) Senior Marketing Manager, Global Direct Marketing Yahoo! March 2007  –  September 2008  (1 year 7 months) Sunnyvale, CA Oversaw the paid search (PPC) program strategy for key Yahoo! businesses and managed the agency relationship. Served as the center of excellence for paid search and drove the standardization of planning, budgeting, and managing paid search programs across various organizations at Yahoo!. Key accomplishments: managed $14M budget at 90%+ ROI; led alignment of four organizations through introduction of monthly reforecast and annual budgeting process; drove agency’s continuous performance improvement; successfully transitioned program between search agencies; improved effectiveness of program through center of excellence guidance including search marketing best practices, policies, and rules of engagement . Director, Online Marketing WorldSpace Satellite Radio April 2005  –  March 2007  (2 years) Washington D.C. Metro Area Managed global online acquisition and retention marketing strategy for 5 geographies; built online marketing programs from ground zero - email marketing, PPC, SEO, affiliate marketing, display ads; directed website and creative optimization efforts (online store, shopping cart, landing pages, ad creative) for improved user experience and sales conversion rates; oversaw brand marketing initiatives (logo development, brand repositioning). Senior Marketing Manager, Online Marketing AOL 2003  –  2005  (2 years) Washington D.C. Metro Area Directed all online marketing efforts including email marketing, PPC, SEO, affiliate marketing, display ads, A/B testing, predictive modeling to drive subscriptions for premium services product lines. Managed multi-million dollar budget and exceeded sales forecast by 10%. Led successful optimization efforts of registration paths, landing pages, micro sites, and ad creatives leading to lift in response rates of over 125%. Marketing Manager, e-Commerce Time Life (former Time Warner company) 2000  –  2003  (3 years) Washington D.C. Metro Area Oversaw email marketing, partnership marketing and display ads; managed online merchandising for music products. Online Marketing Manager TheGlobalist.com 2000  –  2000  (less than a year) Washington D.C. Metro Area Managed lead generation (for subscription business) via direct mail, print ads, email marketing, display ads Vice President, Group Account Director iProspect June 2012  – Present (3 years 3 months) San Francisco Bay Area Manage and provide global digital marketing thought leadership and strategy to Fortune 500 clients with multi-million dollar advertising budgets. Vice President, Group Account Director iProspect June 2012  – Present (3 years 3 months) San Francisco Bay Area Manage and provide global digital marketing thought leadership and strategy to Fortune 500 clients with multi-million dollar advertising budgets. Senior Director, Digital Marketing Travelers January 2011  –  June 2012  (1 year 6 months) Hartford, Connecticut Area Led the digital marketing acquisition team to drive B2C leads and sales. Responsible for strategy and operations of multi-million dollar paid search, mobile and display advertising programs as well as landing page optimization. Led team of five marketers. Key accomplishments: grew YoY sales significantly at lower acquisition cost; implemented landing page optimization platform; launched first multivariate landing page test leading to a 36% lift in conversion rate; improved display ad performance via audience targeting (e.g. look-alike modeling, DSPs); oversaw Travelers.com web analytics (including implementation of Coremetrics tags, definition of KPIs, development of reporting/performance insights). \nPresented at SES Chicago 2011 on \"Organizational Buy-In Strategies to Testing\". Senior Director, Digital Marketing Travelers January 2011  –  June 2012  (1 year 6 months) Hartford, Connecticut Area Led the digital marketing acquisition team to drive B2C leads and sales. Responsible for strategy and operations of multi-million dollar paid search, mobile and display advertising programs as well as landing page optimization. Led team of five marketers. Key accomplishments: grew YoY sales significantly at lower acquisition cost; implemented landing page optimization platform; launched first multivariate landing page test leading to a 36% lift in conversion rate; improved display ad performance via audience targeting (e.g. look-alike modeling, DSPs); oversaw Travelers.com web analytics (including implementation of Coremetrics tags, definition of KPIs, development of reporting/performance insights). \nPresented at SES Chicago 2011 on \"Organizational Buy-In Strategies to Testing\". Senior Marketing Manager/Digital Marketing Strategist, Corporate Marketing Intel Corporation October 2008  –  December 2010  (2 years 3 months) Santa Clara, CA Evangelized online testing, optimization, and web analytics across the org [change agent]; appointed as resident digital marketing expert and consultant on marketing campaigns to account/campaign managers within the Partner Marketing Group; led Intel’s multi-million dollar landing experience program on OEM websites to influence end consumers’ purchasing decision and drive upsell worldwide. Key accomplishments: overhauled the global direction and goals of the landing experience program with emphasis on data based decision-making, testing and optimization; introduced and launched predictive optimization technology on landing pages to increase processor conversion and upsell rate; introduced A/B landing page testing leading to a lift in response of over 90%. \nPresented: \"Intel’s CRO Strategy with Partners” at Conversion Camp 2010 in Frankfurt, Germany and “Intel Partner Marketing: Instilling a Testing Culture and CRO Case Study” (webinar) Senior Marketing Manager/Digital Marketing Strategist, Corporate Marketing Intel Corporation October 2008  –  December 2010  (2 years 3 months) Santa Clara, CA Evangelized online testing, optimization, and web analytics across the org [change agent]; appointed as resident digital marketing expert and consultant on marketing campaigns to account/campaign managers within the Partner Marketing Group; led Intel’s multi-million dollar landing experience program on OEM websites to influence end consumers’ purchasing decision and drive upsell worldwide. Key accomplishments: overhauled the global direction and goals of the landing experience program with emphasis on data based decision-making, testing and optimization; introduced and launched predictive optimization technology on landing pages to increase processor conversion and upsell rate; introduced A/B landing page testing leading to a lift in response of over 90%. \nPresented: \"Intel’s CRO Strategy with Partners” at Conversion Camp 2010 in Frankfurt, Germany and “Intel Partner Marketing: Instilling a Testing Culture and CRO Case Study” (webinar) Senior Marketing Manager, Global Direct Marketing Yahoo! March 2007  –  September 2008  (1 year 7 months) Sunnyvale, CA Oversaw the paid search (PPC) program strategy for key Yahoo! businesses and managed the agency relationship. Served as the center of excellence for paid search and drove the standardization of planning, budgeting, and managing paid search programs across various organizations at Yahoo!. Key accomplishments: managed $14M budget at 90%+ ROI; led alignment of four organizations through introduction of monthly reforecast and annual budgeting process; drove agency’s continuous performance improvement; successfully transitioned program between search agencies; improved effectiveness of program through center of excellence guidance including search marketing best practices, policies, and rules of engagement . Senior Marketing Manager, Global Direct Marketing Yahoo! March 2007  –  September 2008  (1 year 7 months) Sunnyvale, CA Oversaw the paid search (PPC) program strategy for key Yahoo! businesses and managed the agency relationship. Served as the center of excellence for paid search and drove the standardization of planning, budgeting, and managing paid search programs across various organizations at Yahoo!. Key accomplishments: managed $14M budget at 90%+ ROI; led alignment of four organizations through introduction of monthly reforecast and annual budgeting process; drove agency’s continuous performance improvement; successfully transitioned program between search agencies; improved effectiveness of program through center of excellence guidance including search marketing best practices, policies, and rules of engagement . Director, Online Marketing WorldSpace Satellite Radio April 2005  –  March 2007  (2 years) Washington D.C. Metro Area Managed global online acquisition and retention marketing strategy for 5 geographies; built online marketing programs from ground zero - email marketing, PPC, SEO, affiliate marketing, display ads; directed website and creative optimization efforts (online store, shopping cart, landing pages, ad creative) for improved user experience and sales conversion rates; oversaw brand marketing initiatives (logo development, brand repositioning). Director, Online Marketing WorldSpace Satellite Radio April 2005  –  March 2007  (2 years) Washington D.C. Metro Area Managed global online acquisition and retention marketing strategy for 5 geographies; built online marketing programs from ground zero - email marketing, PPC, SEO, affiliate marketing, display ads; directed website and creative optimization efforts (online store, shopping cart, landing pages, ad creative) for improved user experience and sales conversion rates; oversaw brand marketing initiatives (logo development, brand repositioning). Senior Marketing Manager, Online Marketing AOL 2003  –  2005  (2 years) Washington D.C. Metro Area Directed all online marketing efforts including email marketing, PPC, SEO, affiliate marketing, display ads, A/B testing, predictive modeling to drive subscriptions for premium services product lines. Managed multi-million dollar budget and exceeded sales forecast by 10%. Led successful optimization efforts of registration paths, landing pages, micro sites, and ad creatives leading to lift in response rates of over 125%. Senior Marketing Manager, Online Marketing AOL 2003  –  2005  (2 years) Washington D.C. Metro Area Directed all online marketing efforts including email marketing, PPC, SEO, affiliate marketing, display ads, A/B testing, predictive modeling to drive subscriptions for premium services product lines. Managed multi-million dollar budget and exceeded sales forecast by 10%. Led successful optimization efforts of registration paths, landing pages, micro sites, and ad creatives leading to lift in response rates of over 125%. Marketing Manager, e-Commerce Time Life (former Time Warner company) 2000  –  2003  (3 years) Washington D.C. Metro Area Oversaw email marketing, partnership marketing and display ads; managed online merchandising for music products. Marketing Manager, e-Commerce Time Life (former Time Warner company) 2000  –  2003  (3 years) Washington D.C. Metro Area Oversaw email marketing, partnership marketing and display ads; managed online merchandising for music products. Online Marketing Manager TheGlobalist.com 2000  –  2000  (less than a year) Washington D.C. Metro Area Managed lead generation (for subscription business) via direct mail, print ads, email marketing, display ads Online Marketing Manager TheGlobalist.com 2000  –  2000  (less than a year) Washington D.C. Metro Area Managed lead generation (for subscription business) via direct mail, print ads, email marketing, display ads Languages English Native or bilingual proficiency German Native or bilingual proficiency Czech Elementary proficiency French Elementary proficiency English Native or bilingual proficiency German Native or bilingual proficiency Czech Elementary proficiency French Elementary proficiency English Native or bilingual proficiency German Native or bilingual proficiency Czech Elementary proficiency French Elementary proficiency Native or bilingual proficiency Native or bilingual proficiency Elementary proficiency Elementary proficiency Skills Digital Marketing Online Marketing Digital Strategy Multi-channel Marketing Direct Marketing Mobile Marketing Customer Acquisition Online Lead Generation Lead Generation PPC SEM SEO Display Advertising Email Marketing Affiliate Marketing Conversion Optimization Landing Page... A/B testing Multivariate Testing Behavioral Targeting Online Advertising Google Analytics Web Analytics Digital Marketing... Digital Media E-commerce Web Marketing Strategy See 13+     See less Skills  Digital Marketing Online Marketing Digital Strategy Multi-channel Marketing Direct Marketing Mobile Marketing Customer Acquisition Online Lead Generation Lead Generation PPC SEM SEO Display Advertising Email Marketing Affiliate Marketing Conversion Optimization Landing Page... A/B testing Multivariate Testing Behavioral Targeting Online Advertising Google Analytics Web Analytics Digital Marketing... Digital Media E-commerce Web Marketing Strategy See 13+     See less Digital Marketing Online Marketing Digital Strategy Multi-channel Marketing Direct Marketing Mobile Marketing Customer Acquisition Online Lead Generation Lead Generation PPC SEM SEO Display Advertising Email Marketing Affiliate Marketing Conversion Optimization Landing Page... A/B testing Multivariate Testing Behavioral Targeting Online Advertising Google Analytics Web Analytics Digital Marketing... Digital Media E-commerce Web Marketing Strategy See 13+     See less Digital Marketing Online Marketing Digital Strategy Multi-channel Marketing Direct Marketing Mobile Marketing Customer Acquisition Online Lead Generation Lead Generation PPC SEM SEO Display Advertising Email Marketing Affiliate Marketing Conversion Optimization Landing Page... A/B testing Multivariate Testing Behavioral Targeting Online Advertising Google Analytics Web Analytics Digital Marketing... Digital Media E-commerce Web Marketing Strategy See 13+     See less "]}