{"position": "Cost Engineer", "company": "Intel Corporation", "profiles": ["Summary Progressive construction professional, adept at forming and leading geographically dispersed teams in the cost management of major capital programs, with 30+ years experience in the commercial, industrial and semi-conductor sectors, spanning North and Central America, Europe, the Middle East, and Southeast Asia. Summary Progressive construction professional, adept at forming and leading geographically dispersed teams in the cost management of major capital programs, with 30+ years experience in the commercial, industrial and semi-conductor sectors, spanning North and Central America, Europe, the Middle East, and Southeast Asia. Progressive construction professional, adept at forming and leading geographically dispersed teams in the cost management of major capital programs, with 30+ years experience in the commercial, industrial and semi-conductor sectors, spanning North and Central America, Europe, the Middle East, and Southeast Asia. Progressive construction professional, adept at forming and leading geographically dispersed teams in the cost management of major capital programs, with 30+ years experience in the commercial, industrial and semi-conductor sectors, spanning North and Central America, Europe, the Middle East, and Southeast Asia. Experience Global Construction Controller Intel Corporation September 2010  – Present (5 years) Phoenix, Arizona and Portland, Oregon Senior Finance Controller responsible for the cost engineering, estimating and accounting functions of Intel's global construction program portfolio. Chief Cost Engineer Intel Corporation January 2008  –  August 2010  (2 years 8 months) Swindon, United Kingdom Technical direction and implementation of worldwide policies and procedures for Intel's construction cost engineering capability; including advising project teams on contracting strategies, estimating approaches, cost management systems and mitigation of claims. EMEA Project Controls Manager Intel Corporation June 2000  –  December 2007  (7 years 7 months) Swindon, United Kingdom Regional Project Controls Manager, responsible for the cost engineering, scheduling, estimating and accounting functions of Intel's construction projects in Europe, Middle East & Africa (EMEA). Senior Cost Engineer Intel Corporation June 1997  –  May 2000  (3 years) Fort Worth, Texas and Portland, Oregon Commercial management of Intel's semi-conductor fabrication facility construction (Fab 16) and conversion (D1B) projects. Global Construction Controller Intel Corporation September 2010  – Present (5 years) Phoenix, Arizona and Portland, Oregon Senior Finance Controller responsible for the cost engineering, estimating and accounting functions of Intel's global construction program portfolio. Global Construction Controller Intel Corporation September 2010  – Present (5 years) Phoenix, Arizona and Portland, Oregon Senior Finance Controller responsible for the cost engineering, estimating and accounting functions of Intel's global construction program portfolio. Chief Cost Engineer Intel Corporation January 2008  –  August 2010  (2 years 8 months) Swindon, United Kingdom Technical direction and implementation of worldwide policies and procedures for Intel's construction cost engineering capability; including advising project teams on contracting strategies, estimating approaches, cost management systems and mitigation of claims. Chief Cost Engineer Intel Corporation January 2008  –  August 2010  (2 years 8 months) Swindon, United Kingdom Technical direction and implementation of worldwide policies and procedures for Intel's construction cost engineering capability; including advising project teams on contracting strategies, estimating approaches, cost management systems and mitigation of claims. EMEA Project Controls Manager Intel Corporation June 2000  –  December 2007  (7 years 7 months) Swindon, United Kingdom Regional Project Controls Manager, responsible for the cost engineering, scheduling, estimating and accounting functions of Intel's construction projects in Europe, Middle East & Africa (EMEA). EMEA Project Controls Manager Intel Corporation June 2000  –  December 2007  (7 years 7 months) Swindon, United Kingdom Regional Project Controls Manager, responsible for the cost engineering, scheduling, estimating and accounting functions of Intel's construction projects in Europe, Middle East & Africa (EMEA). Senior Cost Engineer Intel Corporation June 1997  –  May 2000  (3 years) Fort Worth, Texas and Portland, Oregon Commercial management of Intel's semi-conductor fabrication facility construction (Fab 16) and conversion (D1B) projects. Senior Cost Engineer Intel Corporation June 1997  –  May 2000  (3 years) Fort Worth, Texas and Portland, Oregon Commercial management of Intel's semi-conductor fabrication facility construction (Fab 16) and conversion (D1B) projects. Skills Strategy Contract Negotiation Cross-functional Team... Cost Engineering Project Control Project Planning Procurement Construction Contract Management Engineering Cost Management Engineering Management Change Management Construction Management Cost Control Strategic Planning See 1+     See less Skills  Strategy Contract Negotiation Cross-functional Team... Cost Engineering Project Control Project Planning Procurement Construction Contract Management Engineering Cost Management Engineering Management Change Management Construction Management Cost Control Strategic Planning See 1+     See less Strategy Contract Negotiation Cross-functional Team... Cost Engineering Project Control Project Planning Procurement Construction Contract Management Engineering Cost Management Engineering Management Change Management Construction Management Cost Control Strategic Planning See 1+     See less Strategy Contract Negotiation Cross-functional Team... Cost Engineering Project Control Project Planning Procurement Construction Contract Management Engineering Cost Management Engineering Management Change Management Construction Management Cost Control Strategic Planning See 1+     See less Education The Royal Institution of Chartered Surveyors Chartered Quantity Surveyor (MRICS) 1987 The Royal Institution of Chartered Surveyors Chartered Quantity Surveyor (MRICS) 1987 The Royal Institution of Chartered Surveyors Chartered Quantity Surveyor (MRICS) 1987 The Royal Institution of Chartered Surveyors Chartered Quantity Surveyor (MRICS) 1987 ", "Experience Sourcing Manager for EMEA Data Center Construction Facebook April 2015  – Present (5 months) Worldwide Estimating for office buildings Intel Corporation December 2013  –  July 2014  (8 months) Worldwide Providing office and lab cost estimates and potential scope/cost saving concepts to Intel senior decision makers on non- manufacturing projects in China, Singapore, USA, and European locations. Intel Lead EMEA Regional Construction Estimating Intel Corporation February 2008  –  December 2013  (5 years 11 months) Ireland, Israel, Russia and Mainland Europe Intel staff member responsible for estimating and subsequent forecasting (prior to full buyout) of major manufacturing Fabs in Ireland and Israel; new office and major datacenter construction in Poland, Russia, Netherlands and Israel. EMEA Estimating Manager Intel Corporation February 2002  –  January 2008  (6 years) EMEA Multiple estimate support for Intels expansion in EMEA through SMG offices , Intel labs and existing location upgrades. Project support through early budgeting, bid analysis, selection, execution and final account closeout. Senior Cost Engineer Intel Corporation April 1999  –  January 2002  (2 years 10 months) Intel Massachusettes, USA Intel Lead Cost Engineer for the conversion of the newly purchased Digital Inc technology Fab to our Intel p858.p860 technology . Financial Analyst Intel Corporation October 1996  –  March 1999  (2 years 6 months) Ireland Finance Analyst for Corporate Services reporting on upgrade projects on the Ireland campus Senior Quantity Surveyor Worktap ltd April 1990  –  September 1994  (4 years 6 months) Thames House, and Bow Quarter Senior Quantity Surveyor responsible for the civils and builderswork contract, monthly interim valuations, negotiating variations, preparation and settlement of claim and final account. Intermediate Quantity Surveyor Leighton Contractors October 1988  –  September 1989  (1 year) Sydney Area, Australia Staff member on the Commonwealth Bank project at Martin Place. Interim valuations, and management of two daywork contractors and one schedule of rates contractor. Sourcing Manager for EMEA Data Center Construction Facebook April 2015  – Present (5 months) Sourcing Manager for EMEA Data Center Construction Facebook April 2015  – Present (5 months) Worldwide Estimating for office buildings Intel Corporation December 2013  –  July 2014  (8 months) Worldwide Providing office and lab cost estimates and potential scope/cost saving concepts to Intel senior decision makers on non- manufacturing projects in China, Singapore, USA, and European locations. Worldwide Estimating for office buildings Intel Corporation December 2013  –  July 2014  (8 months) Worldwide Providing office and lab cost estimates and potential scope/cost saving concepts to Intel senior decision makers on non- manufacturing projects in China, Singapore, USA, and European locations. Intel Lead EMEA Regional Construction Estimating Intel Corporation February 2008  –  December 2013  (5 years 11 months) Ireland, Israel, Russia and Mainland Europe Intel staff member responsible for estimating and subsequent forecasting (prior to full buyout) of major manufacturing Fabs in Ireland and Israel; new office and major datacenter construction in Poland, Russia, Netherlands and Israel. Intel Lead EMEA Regional Construction Estimating Intel Corporation February 2008  –  December 2013  (5 years 11 months) Ireland, Israel, Russia and Mainland Europe Intel staff member responsible for estimating and subsequent forecasting (prior to full buyout) of major manufacturing Fabs in Ireland and Israel; new office and major datacenter construction in Poland, Russia, Netherlands and Israel. EMEA Estimating Manager Intel Corporation February 2002  –  January 2008  (6 years) EMEA Multiple estimate support for Intels expansion in EMEA through SMG offices , Intel labs and existing location upgrades. Project support through early budgeting, bid analysis, selection, execution and final account closeout. EMEA Estimating Manager Intel Corporation February 2002  –  January 2008  (6 years) EMEA Multiple estimate support for Intels expansion in EMEA through SMG offices , Intel labs and existing location upgrades. Project support through early budgeting, bid analysis, selection, execution and final account closeout. Senior Cost Engineer Intel Corporation April 1999  –  January 2002  (2 years 10 months) Intel Massachusettes, USA Intel Lead Cost Engineer for the conversion of the newly purchased Digital Inc technology Fab to our Intel p858.p860 technology . Senior Cost Engineer Intel Corporation April 1999  –  January 2002  (2 years 10 months) Intel Massachusettes, USA Intel Lead Cost Engineer for the conversion of the newly purchased Digital Inc technology Fab to our Intel p858.p860 technology . Financial Analyst Intel Corporation October 1996  –  March 1999  (2 years 6 months) Ireland Finance Analyst for Corporate Services reporting on upgrade projects on the Ireland campus Financial Analyst Intel Corporation October 1996  –  March 1999  (2 years 6 months) Ireland Finance Analyst for Corporate Services reporting on upgrade projects on the Ireland campus Senior Quantity Surveyor Worktap ltd April 1990  –  September 1994  (4 years 6 months) Thames House, and Bow Quarter Senior Quantity Surveyor responsible for the civils and builderswork contract, monthly interim valuations, negotiating variations, preparation and settlement of claim and final account. Senior Quantity Surveyor Worktap ltd April 1990  –  September 1994  (4 years 6 months) Thames House, and Bow Quarter Senior Quantity Surveyor responsible for the civils and builderswork contract, monthly interim valuations, negotiating variations, preparation and settlement of claim and final account. Intermediate Quantity Surveyor Leighton Contractors October 1988  –  September 1989  (1 year) Sydney Area, Australia Staff member on the Commonwealth Bank project at Martin Place. Interim valuations, and management of two daywork contractors and one schedule of rates contractor. Intermediate Quantity Surveyor Leighton Contractors October 1988  –  September 1989  (1 year) Sydney Area, Australia Staff member on the Commonwealth Bank project at Martin Place. Interim valuations, and management of two daywork contractors and one schedule of rates contractor. Skills Budgets Finance Contract Management Contract Negotiation Project Planning Procurement Cost Management Construction Schedules Supply Chain Management Change Management Construction Management Program Management Project Management Cross-functional Team... Value Engineering Microsoft Project See 2+     See less Skills  Budgets Finance Contract Management Contract Negotiation Project Planning Procurement Cost Management Construction Schedules Supply Chain Management Change Management Construction Management Program Management Project Management Cross-functional Team... Value Engineering Microsoft Project See 2+     See less Budgets Finance Contract Management Contract Negotiation Project Planning Procurement Cost Management Construction Schedules Supply Chain Management Change Management Construction Management Program Management Project Management Cross-functional Team... Value Engineering Microsoft Project See 2+     See less Budgets Finance Contract Management Contract Negotiation Project Planning Procurement Cost Management Construction Schedules Supply Chain Management Change Management Construction Management Program Management Project Management Cross-functional Team... Value Engineering Microsoft Project See 2+     See less Education Trinity College, Dublin Dip Construction Law and Contract Administration,  EMEA Construction Law and Contract Administration 1998  – 1999 Trinity College, Dublin BSc Quantity Surveying,  Construction Economics 1985  – 1988 Dublin Institute of Technology Higher Dip Construction Technology,  Construction Management 1982  – 1985 Trinity College, Dublin Dip Construction Law and Contract Administration,  EMEA Construction Law and Contract Administration 1998  – 1999 Trinity College, Dublin Dip Construction Law and Contract Administration,  EMEA Construction Law and Contract Administration 1998  – 1999 Trinity College, Dublin Dip Construction Law and Contract Administration,  EMEA Construction Law and Contract Administration 1998  – 1999 Trinity College, Dublin BSc Quantity Surveying,  Construction Economics 1985  – 1988 Trinity College, Dublin BSc Quantity Surveying,  Construction Economics 1985  – 1988 Trinity College, Dublin BSc Quantity Surveying,  Construction Economics 1985  – 1988 Dublin Institute of Technology Higher Dip Construction Technology,  Construction Management 1982  – 1985 Dublin Institute of Technology Higher Dip Construction Technology,  Construction Management 1982  – 1985 Dublin Institute of Technology Higher Dip Construction Technology,  Construction Management 1982  – 1985 ", "Experience Facilities Administrative Specialist Southwest Human Development 2006  –  2012  (6 years) Phoenix, AZ Conducted 25-30 annual and semi-annual inventories to insure classrooms had all necessary equipment and supplies. Tracking of orders including purchase reqs, receipt of items purchased and processing of all paperwork to accounting for payment. Helped with coordination of site repairs and services to ensure smooth running of classroom sites. Maintained data to enable tracking of costs and creation of financial reports as needed by management. Sr Cost Accountant NEC Electronics August 1991  –  May 1999  (7 years 10 months) Santa Clara, CA Sr Cost Accountant-Closed monthly,quarterly and annual financial records for input to corporate headquarters. Implemented inventory cost controls, entering part standard cost, freight and duty rates into company database. Valued inventory to meet product margins and analyzed inventory for price trends as well as forecasting product costs and margins. Created supplementary financial reports and graphs for internal executive and corporate presentations. Senior Accountant-Analyst Westinghouse Electric Company April 1983  –  June 1991  (8 years 3 months) Sunnyvale, CA General accountant-closure of monthly financial records \nAnalyst for facilities dept-created, monitored, budgeted and adjusted financial reports Senior Accountant-Assistant Cost Engineer Intel Corporation September 1978  –  November 1982  (4 years 3 months) Santa Clara, CA Senior Accountant-Did financial reports for companies 17 foreign sales offices and handled inventory accounts, \nAssistant Cost Engineer- Set up and monitored all new construction and cost control systems. Facilities Administrative Specialist Southwest Human Development 2006  –  2012  (6 years) Phoenix, AZ Conducted 25-30 annual and semi-annual inventories to insure classrooms had all necessary equipment and supplies. Tracking of orders including purchase reqs, receipt of items purchased and processing of all paperwork to accounting for payment. Helped with coordination of site repairs and services to ensure smooth running of classroom sites. Maintained data to enable tracking of costs and creation of financial reports as needed by management. Facilities Administrative Specialist Southwest Human Development 2006  –  2012  (6 years) Phoenix, AZ Conducted 25-30 annual and semi-annual inventories to insure classrooms had all necessary equipment and supplies. Tracking of orders including purchase reqs, receipt of items purchased and processing of all paperwork to accounting for payment. Helped with coordination of site repairs and services to ensure smooth running of classroom sites. Maintained data to enable tracking of costs and creation of financial reports as needed by management. Sr Cost Accountant NEC Electronics August 1991  –  May 1999  (7 years 10 months) Santa Clara, CA Sr Cost Accountant-Closed monthly,quarterly and annual financial records for input to corporate headquarters. Implemented inventory cost controls, entering part standard cost, freight and duty rates into company database. Valued inventory to meet product margins and analyzed inventory for price trends as well as forecasting product costs and margins. Created supplementary financial reports and graphs for internal executive and corporate presentations. Sr Cost Accountant NEC Electronics August 1991  –  May 1999  (7 years 10 months) Santa Clara, CA Sr Cost Accountant-Closed monthly,quarterly and annual financial records for input to corporate headquarters. Implemented inventory cost controls, entering part standard cost, freight and duty rates into company database. Valued inventory to meet product margins and analyzed inventory for price trends as well as forecasting product costs and margins. Created supplementary financial reports and graphs for internal executive and corporate presentations. Senior Accountant-Analyst Westinghouse Electric Company April 1983  –  June 1991  (8 years 3 months) Sunnyvale, CA General accountant-closure of monthly financial records \nAnalyst for facilities dept-created, monitored, budgeted and adjusted financial reports Senior Accountant-Analyst Westinghouse Electric Company April 1983  –  June 1991  (8 years 3 months) Sunnyvale, CA General accountant-closure of monthly financial records \nAnalyst for facilities dept-created, monitored, budgeted and adjusted financial reports Senior Accountant-Assistant Cost Engineer Intel Corporation September 1978  –  November 1982  (4 years 3 months) Santa Clara, CA Senior Accountant-Did financial reports for companies 17 foreign sales offices and handled inventory accounts, \nAssistant Cost Engineer- Set up and monitored all new construction and cost control systems. Senior Accountant-Assistant Cost Engineer Intel Corporation September 1978  –  November 1982  (4 years 3 months) Santa Clara, CA Senior Accountant-Did financial reports for companies 17 foreign sales offices and handled inventory accounts, \nAssistant Cost Engineer- Set up and monitored all new construction and cost control systems. Skills Accounting Microsoft Word 10 Key Skills  Accounting Microsoft Word 10 Key Accounting Microsoft Word 10 Key Accounting Microsoft Word 10 Key Education San Diego State University-California State University Accounting 1976  – 1978 De Anza College Associate of Arts (A.A.),  Accounting 1974  – 1976 San Diego State University-California State University Accounting 1976  – 1978 San Diego State University-California State University Accounting 1976  – 1978 San Diego State University-California State University Accounting 1976  – 1978 De Anza College Associate of Arts (A.A.),  Accounting 1974  – 1976 De Anza College Associate of Arts (A.A.),  Accounting 1974  – 1976 De Anza College Associate of Arts (A.A.),  Accounting 1974  – 1976 ", "Experience F&I Manager AutoFair Volkswagen January 2015  – Present (8 months) Sr. Crane Specialist Imperial Crane Services, Inc. July 2011  –  January 2015  (3 years 7 months) Rental and Sales of Cranes for any project, world wide. Planner/Scheduler ConocoPhillips January 2011  –  July 2012  (1 year 7 months) Construction Planner/Scheduler for ConocoPhillips at the Borger, TX Refinery. Project Cost Engineer BP November 2010  –  February 2011  (4 months) Sr. Cost Enigneer and Planner/Scheduler Apex Systems March 2008  –  November 2010  (2 years 9 months) Sr. Cost Engineer / Acting Project Controls Manager DMJM Aviation 2007  –  2008  (1 year) Sr. Cost Engineer Intel Corporation 2005  –  2008  (3 years) Project Controller McLane Associates 2000  –  2005  (5 years) F&I Manager AutoFair Volkswagen January 2015  – Present (8 months) F&I Manager AutoFair Volkswagen January 2015  – Present (8 months) Sr. Crane Specialist Imperial Crane Services, Inc. July 2011  –  January 2015  (3 years 7 months) Rental and Sales of Cranes for any project, world wide. Sr. Crane Specialist Imperial Crane Services, Inc. July 2011  –  January 2015  (3 years 7 months) Rental and Sales of Cranes for any project, world wide. Planner/Scheduler ConocoPhillips January 2011  –  July 2012  (1 year 7 months) Construction Planner/Scheduler for ConocoPhillips at the Borger, TX Refinery. Planner/Scheduler ConocoPhillips January 2011  –  July 2012  (1 year 7 months) Construction Planner/Scheduler for ConocoPhillips at the Borger, TX Refinery. Project Cost Engineer BP November 2010  –  February 2011  (4 months) Project Cost Engineer BP November 2010  –  February 2011  (4 months) Sr. Cost Enigneer and Planner/Scheduler Apex Systems March 2008  –  November 2010  (2 years 9 months) Sr. Cost Enigneer and Planner/Scheduler Apex Systems March 2008  –  November 2010  (2 years 9 months) Sr. Cost Engineer / Acting Project Controls Manager DMJM Aviation 2007  –  2008  (1 year) Sr. Cost Engineer / Acting Project Controls Manager DMJM Aviation 2007  –  2008  (1 year) Sr. Cost Engineer Intel Corporation 2005  –  2008  (3 years) Sr. Cost Engineer Intel Corporation 2005  –  2008  (3 years) Project Controller McLane Associates 2000  –  2005  (5 years) Project Controller McLane Associates 2000  –  2005  (5 years) Skills Project Estimation Project Control Cost Control Cost Engineering CPM Scheduling Refinery Contract Management Cost Management Primavera P6 WBS Construction Construction Management Earned Value Management Cost Benefit Construction Safety Value Engineering Process Scheduler Subcontracting Petroleum Change Orders EPC Contractors Estimates Project Bidding MS Project P3 Procurement Inspection Petrochemical Pre-construction Project Planning Project Engineering Supervisory Skills Commissioning Pipelines Cost Planning Schedules See 22+     See less Skills  Project Estimation Project Control Cost Control Cost Engineering CPM Scheduling Refinery Contract Management Cost Management Primavera P6 WBS Construction Construction Management Earned Value Management Cost Benefit Construction Safety Value Engineering Process Scheduler Subcontracting Petroleum Change Orders EPC Contractors Estimates Project Bidding MS Project P3 Procurement Inspection Petrochemical Pre-construction Project Planning Project Engineering Supervisory Skills Commissioning Pipelines Cost Planning Schedules See 22+     See less Project Estimation Project Control Cost Control Cost Engineering CPM Scheduling Refinery Contract Management Cost Management Primavera P6 WBS Construction Construction Management Earned Value Management Cost Benefit Construction Safety Value Engineering Process Scheduler Subcontracting Petroleum Change Orders EPC Contractors Estimates Project Bidding MS Project P3 Procurement Inspection Petrochemical Pre-construction Project Planning Project Engineering Supervisory Skills Commissioning Pipelines Cost Planning Schedules See 22+     See less Project Estimation Project Control Cost Control Cost Engineering CPM Scheduling Refinery Contract Management Cost Management Primavera P6 WBS Construction Construction Management Earned Value Management Cost Benefit Construction Safety Value Engineering Process Scheduler Subcontracting Petroleum Change Orders EPC Contractors Estimates Project Bidding MS Project P3 Procurement Inspection Petrochemical Pre-construction Project Planning Project Engineering Supervisory Skills Commissioning Pipelines Cost Planning Schedules See 22+     See less Education Wentworth Institute of Technology Bachelors,  Construction Management 1996  – 2000 Wentworth Institute of Technology Bachelors,  Construction Management 1996  – 2000 Wentworth Institute of Technology Bachelors,  Construction Management 1996  – 2000 Wentworth Institute of Technology Bachelors,  Construction Management 1996  – 2000 ", "Experience Programme Management (Sub-Contracts Procurement) PMG / Regeneron March 2014  – Present (1 year 6 months) Cork Procurement (Contracts) Manager - Large Scale Bio-Pharmaceutical Project. \nPart of the Programme Management Team tasked with delivery of a large scale Bio-Pharmaceutical campus currently planned for Co. Limerick.  \nRole is management of the Contracts Procurement on this large scale Capital Investment Project. Project Director Poseidon Mgt. Services Ltd. November 1998  – Present (16 years 10 months) EMEA Company Founder Programme & Project Management Consultancy Senior Strategic Sourcing Manager - Capital Projects Novartis Ringaskiddy Ireland July 2013  –  February 2014  (8 months) Ringaskiddy Co. Cork Senior Sourcing Manager - Capital Projects  \nStrategic Sourcing Manager for large Scale Capital Investment Projects on the Ringaskiddy site. A series of new Cat 4 High Containment Projects were planned for the NRL site, which were progressing through final funding until all projects were cancelled in Q1 '14. Role involved the management of strategic sourcing and commercial elements of these projects. Project team stood down in Q1 2014. Programme Mgt & Planning Lead CAF-DCF / ViroPharma February 2012  –  July 2013  (1 year 6 months) Brussels, Belgium Cinryze LSM (Large Scale Manufacturing) Project.  \nManaging and co-ordinating the Master Execution Plan for the revalidation of the Large Scale Manufacturing Process in conjunction with CAF Production and Quality Depts. Complete revalidation of the Cinyrze small scale and large scale manaufacturing process was achieved in a live plant envirnoment with zero disruption to normal production. Project Completed Q3 '13. Lead Project Controls & Contract Management - WN201 IPV Vaccines Project GlaxoSmithKline Biologicals March 2011  –  February 2012  (1 year) Wavre, Belgium Part of the GSK BOD project delivery team for its new €320MM IPV Vaccines Plant planned for Wavre, Belgium. Role had responsibility for managing and developing the overall project capital budgets, final funding requisition, scope and change management control for both EPCM & Client execution teams. Assisting the Programme Planning group in developing the Master EPCM schedules and critical paths for the various phases of the overall IPV Programme of works through to PQ complete milestone of Q1 2015. Head of Project Services (International Division) - Programme / Project Management URS / Scott Wilson International December 2010  –  April 2011  (5 months) London, United Kingdom Developing the Project & Construction Management execution and controls systems, (Cost, Schedule, Risk & Programme Management) for the delivery of future international projects within the URS/Scott Wilson Energy/ Infrastructure and Process Group. Rolled out control systems for two Airport revamp project (Rome & St Petersburg) and preliminary systems for NuGen - Nuclear Power Project for proposed new development at Seascale, North of England Programme Manager Irish Multinational August 2010  –  December 2010  (5 months) Cork, Ireland Developing project execution strategy and life cycle planning for a significant Business Processing Outsourcing (BPO) and Business Intelligence (BI) project for a large Irish Multinational within the food and drink industry looking to streamline core internal support functions and provide better understanding of existing systems and processes. European Project Services Manager Merck Sharpe Dohme Ireland January 2008  –  May 2010  (2 years 5 months) Ballydine & Carlow Part of Global Engineering Services, the role had regional responsibility for all project services (Budget Creation, Capital Cost Control, Project Scheduling & Risk Management) across the European Merck sites for all new capital investment projects. As function leader across Europe, the role involved development of the project specific execution strategies, recruiting and setting up of project execution teams and providing leadership to the project teams in the delivery of the \"Project Least Cost Model\" and key project deliverables. Typically the role reported upwards to the Project Steering Committees and Regional Directors and included developing European wide standard projects control procedures for all future projects. \nProjects included a new $110MM R&D RC Facility for Ballydine Co. Tipperary, a new $290MM Vaccines Facility for Carlow Town, a Brownfield $35MM API expansion in La Vallee France and a $50MM Brownfield extension Commercial Manager Pfizer Cork Limited April 2006  –  June 2007  (1 year 3 months) Cork on the new €51MM Kilo Plant Project at Little Island, Dunkettle. Role involves integrating in to the Pfizer site Project Leadership team to provide direction and management of the Project Contracts, Procurement, Capital budgets, and Risk management for this new project. Creating and maintaining the Project Life Cycle reporting to Site Stake Holders and Project Steering Committee, Engineering, Finance and Global Engineering on all aspects of the commercial performance of the project. Project Management consultant Sisk & Son Ltd March 2005  –  March 2006  (1 year 1 month) Cork retained by Construction Managers John Sisk & Son on the Centocor Ireland Bio-Cork Project - $350M to assist in the delivery of the Project Planning and Pre-Construction Phase project deliverables of Construction Execution Plan, Construction Schedule and Total Installed Cost Estimate. System Owner for producing the Monthly and Bi-Monthly Management and Project Principals status reports for the Project Leadership Teams. Project Manager Centocor BV July 2004  –  February 2005  (8 months) Leiden, The Netherlands for two capacity improvement projects, Spider Project (New Fermentation Control System -$25M) and Cellbag Project (PreCulture Closed Inculcation System - $18M). Both projects were implemented as part of the Site Projects Portfolio. The responsibilities of the role were the management of both projects through the final stages of design, completion of engineering and approved validated systems, managing the Centocor Project team to achieving its goals and ensuring the project execution guidelines were implemented correctly and effectively. Role based in Leiden, The Netherlands. Engineering Manager ConocoPhillips Whitegate Refinery December 2002  –  December 2003  (1 year 1 month) Leiden, The Netherlands of new Hydrofiner Project - ULSD plant built in Whitegate, Co. Cork, and designed by Jacobs Engineering. The responsibilities of the role were the management of the detail design deliverables, project procurement, project cost and schedule. The position required the leadership of a relatively inexperienced client project team in achieving the aggressive project cost and schedule targets. Role based in Leiden, The Netherlands. Project Manager CoP Ireland Environmental June 2002  –  December 2002  (7 months) Whitegate, Co. Cork . This involved the planning and scoping of the environmental upgrade projects required on the site by the new site owners ConocoPhillips. Work was part of the retained environmental liability assessment agreed as part of the sale of the plant from the state owned INPC Project & Commercial Manager ConocoPhillips Ireland Ltd January 2002  –  June 2002  (6 months) Crawley, UK Project Manager on FED study for a new ULSD plant to be built in Ireland. Study undertaken by AMEC Capital Projects. As project manager I had full responsibility for direction and quality of the final study deliverables which included a project execution plan, P90 Schedule and +/- 15 % estimate. Role based in Crawley, UK. Project Controls & Sub-Contracts Manager Jacobs Engineering July 2001  –  December 2001  (6 months) Cork Project Services Manager Washington Group International, Ireland November 2000  –  June 2001  (8 months) Cork Project Controls Manager & Deputy Construction Team Leader GlaxoSmithkline (Cork) Ltd November 1998  –  October 2000  (2 years) Currabinny, Co. Cork on a large scale capital investment programme - IR£125MM Staff Project Manager Pfizer March 1998  –  November 1998  (9 months) Loughbeg, Co. Cork Senior Project Controls Manager Centocor Biologics BV December 1996  –  March 1998  (1 year 4 months) Leiden, The Netherlands DPS Engineering & Construction Ltd. Assigned to the following projects, Project Controls Engineer Klinge Pharma & Co. Ltd May 1991  –  September 1993  (2 years 5 months) Killorglin, Co. Kerry Project Cost Engineer Intel Corporation April 1990  –  June 1991  (1 year 3 months) Leixlip, Co. Kildare Programme Management (Sub-Contracts Procurement) PMG / Regeneron March 2014  – Present (1 year 6 months) Cork Procurement (Contracts) Manager - Large Scale Bio-Pharmaceutical Project. \nPart of the Programme Management Team tasked with delivery of a large scale Bio-Pharmaceutical campus currently planned for Co. Limerick.  \nRole is management of the Contracts Procurement on this large scale Capital Investment Project. Programme Management (Sub-Contracts Procurement) PMG / Regeneron March 2014  – Present (1 year 6 months) Cork Procurement (Contracts) Manager - Large Scale Bio-Pharmaceutical Project. \nPart of the Programme Management Team tasked with delivery of a large scale Bio-Pharmaceutical campus currently planned for Co. Limerick.  \nRole is management of the Contracts Procurement on this large scale Capital Investment Project. Project Director Poseidon Mgt. Services Ltd. November 1998  – Present (16 years 10 months) EMEA Company Founder Programme & Project Management Consultancy Project Director Poseidon Mgt. Services Ltd. November 1998  – Present (16 years 10 months) EMEA Company Founder Programme & Project Management Consultancy Senior Strategic Sourcing Manager - Capital Projects Novartis Ringaskiddy Ireland July 2013  –  February 2014  (8 months) Ringaskiddy Co. Cork Senior Sourcing Manager - Capital Projects  \nStrategic Sourcing Manager for large Scale Capital Investment Projects on the Ringaskiddy site. A series of new Cat 4 High Containment Projects were planned for the NRL site, which were progressing through final funding until all projects were cancelled in Q1 '14. Role involved the management of strategic sourcing and commercial elements of these projects. Project team stood down in Q1 2014. Senior Strategic Sourcing Manager - Capital Projects Novartis Ringaskiddy Ireland July 2013  –  February 2014  (8 months) Ringaskiddy Co. Cork Senior Sourcing Manager - Capital Projects  \nStrategic Sourcing Manager for large Scale Capital Investment Projects on the Ringaskiddy site. A series of new Cat 4 High Containment Projects were planned for the NRL site, which were progressing through final funding until all projects were cancelled in Q1 '14. Role involved the management of strategic sourcing and commercial elements of these projects. Project team stood down in Q1 2014. Programme Mgt & Planning Lead CAF-DCF / ViroPharma February 2012  –  July 2013  (1 year 6 months) Brussels, Belgium Cinryze LSM (Large Scale Manufacturing) Project.  \nManaging and co-ordinating the Master Execution Plan for the revalidation of the Large Scale Manufacturing Process in conjunction with CAF Production and Quality Depts. Complete revalidation of the Cinyrze small scale and large scale manaufacturing process was achieved in a live plant envirnoment with zero disruption to normal production. Project Completed Q3 '13. Programme Mgt & Planning Lead CAF-DCF / ViroPharma February 2012  –  July 2013  (1 year 6 months) Brussels, Belgium Cinryze LSM (Large Scale Manufacturing) Project.  \nManaging and co-ordinating the Master Execution Plan for the revalidation of the Large Scale Manufacturing Process in conjunction with CAF Production and Quality Depts. Complete revalidation of the Cinyrze small scale and large scale manaufacturing process was achieved in a live plant envirnoment with zero disruption to normal production. Project Completed Q3 '13. Lead Project Controls & Contract Management - WN201 IPV Vaccines Project GlaxoSmithKline Biologicals March 2011  –  February 2012  (1 year) Wavre, Belgium Part of the GSK BOD project delivery team for its new €320MM IPV Vaccines Plant planned for Wavre, Belgium. Role had responsibility for managing and developing the overall project capital budgets, final funding requisition, scope and change management control for both EPCM & Client execution teams. Assisting the Programme Planning group in developing the Master EPCM schedules and critical paths for the various phases of the overall IPV Programme of works through to PQ complete milestone of Q1 2015. Lead Project Controls & Contract Management - WN201 IPV Vaccines Project GlaxoSmithKline Biologicals March 2011  –  February 2012  (1 year) Wavre, Belgium Part of the GSK BOD project delivery team for its new €320MM IPV Vaccines Plant planned for Wavre, Belgium. Role had responsibility for managing and developing the overall project capital budgets, final funding requisition, scope and change management control for both EPCM & Client execution teams. Assisting the Programme Planning group in developing the Master EPCM schedules and critical paths for the various phases of the overall IPV Programme of works through to PQ complete milestone of Q1 2015. Head of Project Services (International Division) - Programme / Project Management URS / Scott Wilson International December 2010  –  April 2011  (5 months) London, United Kingdom Developing the Project & Construction Management execution and controls systems, (Cost, Schedule, Risk & Programme Management) for the delivery of future international projects within the URS/Scott Wilson Energy/ Infrastructure and Process Group. Rolled out control systems for two Airport revamp project (Rome & St Petersburg) and preliminary systems for NuGen - Nuclear Power Project for proposed new development at Seascale, North of England Head of Project Services (International Division) - Programme / Project Management URS / Scott Wilson International December 2010  –  April 2011  (5 months) London, United Kingdom Developing the Project & Construction Management execution and controls systems, (Cost, Schedule, Risk & Programme Management) for the delivery of future international projects within the URS/Scott Wilson Energy/ Infrastructure and Process Group. Rolled out control systems for two Airport revamp project (Rome & St Petersburg) and preliminary systems for NuGen - Nuclear Power Project for proposed new development at Seascale, North of England Programme Manager Irish Multinational August 2010  –  December 2010  (5 months) Cork, Ireland Developing project execution strategy and life cycle planning for a significant Business Processing Outsourcing (BPO) and Business Intelligence (BI) project for a large Irish Multinational within the food and drink industry looking to streamline core internal support functions and provide better understanding of existing systems and processes. Programme Manager Irish Multinational August 2010  –  December 2010  (5 months) Cork, Ireland Developing project execution strategy and life cycle planning for a significant Business Processing Outsourcing (BPO) and Business Intelligence (BI) project for a large Irish Multinational within the food and drink industry looking to streamline core internal support functions and provide better understanding of existing systems and processes. European Project Services Manager Merck Sharpe Dohme Ireland January 2008  –  May 2010  (2 years 5 months) Ballydine & Carlow Part of Global Engineering Services, the role had regional responsibility for all project services (Budget Creation, Capital Cost Control, Project Scheduling & Risk Management) across the European Merck sites for all new capital investment projects. As function leader across Europe, the role involved development of the project specific execution strategies, recruiting and setting up of project execution teams and providing leadership to the project teams in the delivery of the \"Project Least Cost Model\" and key project deliverables. Typically the role reported upwards to the Project Steering Committees and Regional Directors and included developing European wide standard projects control procedures for all future projects. \nProjects included a new $110MM R&D RC Facility for Ballydine Co. Tipperary, a new $290MM Vaccines Facility for Carlow Town, a Brownfield $35MM API expansion in La Vallee France and a $50MM Brownfield extension European Project Services Manager Merck Sharpe Dohme Ireland January 2008  –  May 2010  (2 years 5 months) Ballydine & Carlow Part of Global Engineering Services, the role had regional responsibility for all project services (Budget Creation, Capital Cost Control, Project Scheduling & Risk Management) across the European Merck sites for all new capital investment projects. As function leader across Europe, the role involved development of the project specific execution strategies, recruiting and setting up of project execution teams and providing leadership to the project teams in the delivery of the \"Project Least Cost Model\" and key project deliverables. Typically the role reported upwards to the Project Steering Committees and Regional Directors and included developing European wide standard projects control procedures for all future projects. \nProjects included a new $110MM R&D RC Facility for Ballydine Co. Tipperary, a new $290MM Vaccines Facility for Carlow Town, a Brownfield $35MM API expansion in La Vallee France and a $50MM Brownfield extension Commercial Manager Pfizer Cork Limited April 2006  –  June 2007  (1 year 3 months) Cork on the new €51MM Kilo Plant Project at Little Island, Dunkettle. Role involves integrating in to the Pfizer site Project Leadership team to provide direction and management of the Project Contracts, Procurement, Capital budgets, and Risk management for this new project. Creating and maintaining the Project Life Cycle reporting to Site Stake Holders and Project Steering Committee, Engineering, Finance and Global Engineering on all aspects of the commercial performance of the project. Commercial Manager Pfizer Cork Limited April 2006  –  June 2007  (1 year 3 months) Cork on the new €51MM Kilo Plant Project at Little Island, Dunkettle. Role involves integrating in to the Pfizer site Project Leadership team to provide direction and management of the Project Contracts, Procurement, Capital budgets, and Risk management for this new project. Creating and maintaining the Project Life Cycle reporting to Site Stake Holders and Project Steering Committee, Engineering, Finance and Global Engineering on all aspects of the commercial performance of the project. Project Management consultant Sisk & Son Ltd March 2005  –  March 2006  (1 year 1 month) Cork retained by Construction Managers John Sisk & Son on the Centocor Ireland Bio-Cork Project - $350M to assist in the delivery of the Project Planning and Pre-Construction Phase project deliverables of Construction Execution Plan, Construction Schedule and Total Installed Cost Estimate. System Owner for producing the Monthly and Bi-Monthly Management and Project Principals status reports for the Project Leadership Teams. Project Management consultant Sisk & Son Ltd March 2005  –  March 2006  (1 year 1 month) Cork retained by Construction Managers John Sisk & Son on the Centocor Ireland Bio-Cork Project - $350M to assist in the delivery of the Project Planning and Pre-Construction Phase project deliverables of Construction Execution Plan, Construction Schedule and Total Installed Cost Estimate. System Owner for producing the Monthly and Bi-Monthly Management and Project Principals status reports for the Project Leadership Teams. Project Manager Centocor BV July 2004  –  February 2005  (8 months) Leiden, The Netherlands for two capacity improvement projects, Spider Project (New Fermentation Control System -$25M) and Cellbag Project (PreCulture Closed Inculcation System - $18M). Both projects were implemented as part of the Site Projects Portfolio. The responsibilities of the role were the management of both projects through the final stages of design, completion of engineering and approved validated systems, managing the Centocor Project team to achieving its goals and ensuring the project execution guidelines were implemented correctly and effectively. Role based in Leiden, The Netherlands. Project Manager Centocor BV July 2004  –  February 2005  (8 months) Leiden, The Netherlands for two capacity improvement projects, Spider Project (New Fermentation Control System -$25M) and Cellbag Project (PreCulture Closed Inculcation System - $18M). Both projects were implemented as part of the Site Projects Portfolio. The responsibilities of the role were the management of both projects through the final stages of design, completion of engineering and approved validated systems, managing the Centocor Project team to achieving its goals and ensuring the project execution guidelines were implemented correctly and effectively. Role based in Leiden, The Netherlands. Engineering Manager ConocoPhillips Whitegate Refinery December 2002  –  December 2003  (1 year 1 month) Leiden, The Netherlands of new Hydrofiner Project - ULSD plant built in Whitegate, Co. Cork, and designed by Jacobs Engineering. The responsibilities of the role were the management of the detail design deliverables, project procurement, project cost and schedule. The position required the leadership of a relatively inexperienced client project team in achieving the aggressive project cost and schedule targets. Role based in Leiden, The Netherlands. Engineering Manager ConocoPhillips Whitegate Refinery December 2002  –  December 2003  (1 year 1 month) Leiden, The Netherlands of new Hydrofiner Project - ULSD plant built in Whitegate, Co. Cork, and designed by Jacobs Engineering. The responsibilities of the role were the management of the detail design deliverables, project procurement, project cost and schedule. The position required the leadership of a relatively inexperienced client project team in achieving the aggressive project cost and schedule targets. Role based in Leiden, The Netherlands. Project Manager CoP Ireland Environmental June 2002  –  December 2002  (7 months) Whitegate, Co. Cork . This involved the planning and scoping of the environmental upgrade projects required on the site by the new site owners ConocoPhillips. Work was part of the retained environmental liability assessment agreed as part of the sale of the plant from the state owned INPC Project Manager CoP Ireland Environmental June 2002  –  December 2002  (7 months) Whitegate, Co. Cork . This involved the planning and scoping of the environmental upgrade projects required on the site by the new site owners ConocoPhillips. Work was part of the retained environmental liability assessment agreed as part of the sale of the plant from the state owned INPC Project & Commercial Manager ConocoPhillips Ireland Ltd January 2002  –  June 2002  (6 months) Crawley, UK Project Manager on FED study for a new ULSD plant to be built in Ireland. Study undertaken by AMEC Capital Projects. As project manager I had full responsibility for direction and quality of the final study deliverables which included a project execution plan, P90 Schedule and +/- 15 % estimate. Role based in Crawley, UK. Project & Commercial Manager ConocoPhillips Ireland Ltd January 2002  –  June 2002  (6 months) Crawley, UK Project Manager on FED study for a new ULSD plant to be built in Ireland. Study undertaken by AMEC Capital Projects. As project manager I had full responsibility for direction and quality of the final study deliverables which included a project execution plan, P90 Schedule and +/- 15 % estimate. Role based in Crawley, UK. Project Controls & Sub-Contracts Manager Jacobs Engineering July 2001  –  December 2001  (6 months) Cork Project Controls & Sub-Contracts Manager Jacobs Engineering July 2001  –  December 2001  (6 months) Cork Project Services Manager Washington Group International, Ireland November 2000  –  June 2001  (8 months) Cork Project Services Manager Washington Group International, Ireland November 2000  –  June 2001  (8 months) Cork Project Controls Manager & Deputy Construction Team Leader GlaxoSmithkline (Cork) Ltd November 1998  –  October 2000  (2 years) Currabinny, Co. Cork on a large scale capital investment programme - IR£125MM Project Controls Manager & Deputy Construction Team Leader GlaxoSmithkline (Cork) Ltd November 1998  –  October 2000  (2 years) Currabinny, Co. Cork on a large scale capital investment programme - IR£125MM Staff Project Manager Pfizer March 1998  –  November 1998  (9 months) Loughbeg, Co. Cork Staff Project Manager Pfizer March 1998  –  November 1998  (9 months) Loughbeg, Co. Cork Senior Project Controls Manager Centocor Biologics BV December 1996  –  March 1998  (1 year 4 months) Leiden, The Netherlands DPS Engineering & Construction Ltd. Assigned to the following projects, Senior Project Controls Manager Centocor Biologics BV December 1996  –  March 1998  (1 year 4 months) Leiden, The Netherlands DPS Engineering & Construction Ltd. Assigned to the following projects, Project Controls Engineer Klinge Pharma & Co. Ltd May 1991  –  September 1993  (2 years 5 months) Killorglin, Co. Kerry Project Controls Engineer Klinge Pharma & Co. Ltd May 1991  –  September 1993  (2 years 5 months) Killorglin, Co. Kerry Project Cost Engineer Intel Corporation April 1990  –  June 1991  (1 year 3 months) Leixlip, Co. Kildare Project Cost Engineer Intel Corporation April 1990  –  June 1991  (1 year 3 months) Leixlip, Co. Kildare Skills Project Planning Cost Control Contract Management Cost Management Contract Negotiation Risk Analysis Primavera P6 Scheduling Capital Projects Procurement Value Engineering Program Management Process Scheduler Project Control Project Management Engineering MS Project Construction See 3+     See less Skills  Project Planning Cost Control Contract Management Cost Management Contract Negotiation Risk Analysis Primavera P6 Scheduling Capital Projects Procurement Value Engineering Program Management Process Scheduler Project Control Project Management Engineering MS Project Construction See 3+     See less Project Planning Cost Control Contract Management Cost Management Contract Negotiation Risk Analysis Primavera P6 Scheduling Capital Projects Procurement Value Engineering Program Management Process Scheduler Project Control Project Management Engineering MS Project Construction See 3+     See less Project Planning Cost Control Contract Management Cost Management Contract Negotiation Risk Analysis Primavera P6 Scheduling Capital Projects Procurement Value Engineering Program Management Process Scheduler Project Control Project Management Engineering MS Project Construction See 3+     See less Education Cork Institute of Technology Bachelor's degree,  Chemical Engineering 1985  – 1989 Cork Institute of Technology (CIT) Degree: B.Sc,  Chemical Engineering; 1985  – 1989 Cork Institute of Technology Bachelor's degree,  Chemical Engineering 1985  – 1989 Cork Institute of Technology Bachelor's degree,  Chemical Engineering 1985  – 1989 Cork Institute of Technology Bachelor's degree,  Chemical Engineering 1985  – 1989 Cork Institute of Technology (CIT) Degree: B.Sc,  Chemical Engineering; 1985  – 1989 Cork Institute of Technology (CIT) Degree: B.Sc,  Chemical Engineering; 1985  – 1989 Cork Institute of Technology (CIT) Degree: B.Sc,  Chemical Engineering; 1985  – 1989 ", "Experience Global Procurement Category Manager Adobe June 2014  – Present (1 year 3 months) lehi, utah Negotiate Adobe's product-supporting software contracts for Digital Media and Digital Marketing BUs. Manage supplier and product strategy within category. Sr Selections Analyst Intel Corporation December 2013  –  May 2014  (6 months) chandler, arizona Provide direct financial support for negotiation planning, affordability analysis, supplier ecosystem planning, and supply chain optimization for the test and die-prep capital groups on contracts valuing $1.4B. Sr Cost Engineer Intel Corporation May 2012  –  December 2013  (1 year 8 months) Chandler, AZ Provide direct financial support for contract strategy, affordability analysis, change management, risk and controls, and forecasting/results reporting for capital construction projects totaling $947M. Facilities Director Star Valley Medical Center December 2008  –  August 2010  (1 year 9 months) Responsible for strategic planning, execution, forecasting, and results of all real estate, construction, facilities maintenance, environmental services, and grounds maintenance for 3-campus medical center. Intern Various Companies January 2003  –  December 2007  (5 years) SABU (Residential Real Estate Investment) Land Acquisition/Project Management \n \nRed Companies (Retail Real Estate Development) ­ Land Acquisition/Project Management \n \nLiberty Homes (Production Home Construction) ­ Land Acquisition/Property Management \n \nAmsource Development (Retail Real Estate Development) ­ Project Management \n \nWright Homes (Custom Home Construction) ­ Project Management Global Procurement Category Manager Adobe June 2014  – Present (1 year 3 months) lehi, utah Negotiate Adobe's product-supporting software contracts for Digital Media and Digital Marketing BUs. Manage supplier and product strategy within category. Global Procurement Category Manager Adobe June 2014  – Present (1 year 3 months) lehi, utah Negotiate Adobe's product-supporting software contracts for Digital Media and Digital Marketing BUs. Manage supplier and product strategy within category. Sr Selections Analyst Intel Corporation December 2013  –  May 2014  (6 months) chandler, arizona Provide direct financial support for negotiation planning, affordability analysis, supplier ecosystem planning, and supply chain optimization for the test and die-prep capital groups on contracts valuing $1.4B. Sr Selections Analyst Intel Corporation December 2013  –  May 2014  (6 months) chandler, arizona Provide direct financial support for negotiation planning, affordability analysis, supplier ecosystem planning, and supply chain optimization for the test and die-prep capital groups on contracts valuing $1.4B. Sr Cost Engineer Intel Corporation May 2012  –  December 2013  (1 year 8 months) Chandler, AZ Provide direct financial support for contract strategy, affordability analysis, change management, risk and controls, and forecasting/results reporting for capital construction projects totaling $947M. Sr Cost Engineer Intel Corporation May 2012  –  December 2013  (1 year 8 months) Chandler, AZ Provide direct financial support for contract strategy, affordability analysis, change management, risk and controls, and forecasting/results reporting for capital construction projects totaling $947M. Facilities Director Star Valley Medical Center December 2008  –  August 2010  (1 year 9 months) Responsible for strategic planning, execution, forecasting, and results of all real estate, construction, facilities maintenance, environmental services, and grounds maintenance for 3-campus medical center. Facilities Director Star Valley Medical Center December 2008  –  August 2010  (1 year 9 months) Responsible for strategic planning, execution, forecasting, and results of all real estate, construction, facilities maintenance, environmental services, and grounds maintenance for 3-campus medical center. Intern Various Companies January 2003  –  December 2007  (5 years) SABU (Residential Real Estate Investment) Land Acquisition/Project Management \n \nRed Companies (Retail Real Estate Development) ­ Land Acquisition/Project Management \n \nLiberty Homes (Production Home Construction) ­ Land Acquisition/Property Management \n \nAmsource Development (Retail Real Estate Development) ­ Project Management \n \nWright Homes (Custom Home Construction) ­ Project Management Intern Various Companies January 2003  –  December 2007  (5 years) SABU (Residential Real Estate Investment) Land Acquisition/Project Management \n \nRed Companies (Retail Real Estate Development) ­ Land Acquisition/Project Management \n \nLiberty Homes (Production Home Construction) ­ Land Acquisition/Property Management \n \nAmsource Development (Retail Real Estate Development) ­ Project Management \n \nWright Homes (Custom Home Construction) ­ Project Management Languages Spanish Spanish Spanish Skills Spanish Real Estate Research Strategic Planning Valuation Finance Project Management Real Estate Development Budgets Construction Management Analysis Financial Analysis Financial Modeling Leadership Negotiation Cross-functional Team... Data Analysis Market Research Strategy See 5+     See less Skills  Spanish Real Estate Research Strategic Planning Valuation Finance Project Management Real Estate Development Budgets Construction Management Analysis Financial Analysis Financial Modeling Leadership Negotiation Cross-functional Team... Data Analysis Market Research Strategy See 5+     See less Spanish Real Estate Research Strategic Planning Valuation Finance Project Management Real Estate Development Budgets Construction Management Analysis Financial Analysis Financial Modeling Leadership Negotiation Cross-functional Team... Data Analysis Market Research Strategy See 5+     See less Spanish Real Estate Research Strategic Planning Valuation Finance Project Management Real Estate Development Budgets Construction Management Analysis Financial Analysis Financial Modeling Leadership Negotiation Cross-functional Team... Data Analysis Market Research Strategy See 5+     See less Education Brigham Young University ­ Marriott School of Management Masters,  Business Administration 2010  – 2012 ­ Real Estate/Entrepreneurship April 2012 \n \nPresident ­ The Real Estate Club, Marriott School \nUtah Real Estate Challenge Finalist (Winner to be announced Apr 28, 2011) \n710 GMAT (92 Brigham Young University ­ Ira A. Fulton College of Engineering & Technology B.S,  Construction Management 2003  – 2007 Brigham Young University ­ Marriott School of Management Masters,  Business Administration 2010  – 2012 ­ Real Estate/Entrepreneurship April 2012 \n \nPresident ­ The Real Estate Club, Marriott School \nUtah Real Estate Challenge Finalist (Winner to be announced Apr 28, 2011) \n710 GMAT (92 Brigham Young University ­ Marriott School of Management Masters,  Business Administration 2010  – 2012 ­ Real Estate/Entrepreneurship April 2012 \n \nPresident ­ The Real Estate Club, Marriott School \nUtah Real Estate Challenge Finalist (Winner to be announced Apr 28, 2011) \n710 GMAT (92 Brigham Young University ­ Marriott School of Management Masters,  Business Administration 2010  – 2012 ­ Real Estate/Entrepreneurship April 2012 \n \nPresident ­ The Real Estate Club, Marriott School \nUtah Real Estate Challenge Finalist (Winner to be announced Apr 28, 2011) \n710 GMAT (92 Brigham Young University ­ Ira A. Fulton College of Engineering & Technology B.S,  Construction Management 2003  – 2007 Brigham Young University ­ Ira A. Fulton College of Engineering & Technology B.S,  Construction Management 2003  – 2007 Brigham Young University ­ Ira A. Fulton College of Engineering & Technology B.S,  Construction Management 2003  – 2007 ", "Experience Capital Systems - DMT Manager Intel Corporation August 2013  – Present (2 years 1 month) Hillsboro, OR Senior Financial Analyst - TME Intel Corporation May 2011  –  July 2013  (2 years 3 months) Phoenix, Arizona Area Senior Financial Analyst - TME/EMM Intel Corporation February 2008  –  April 2011  (3 years 3 months) Senior Cost Engineer Intel Corporation January 2006  –  January 2008  (2 years 1 month) Internal Auditor Ford Motor Company January 2005  –  January 2006  (1 year 1 month) Senior Financial Analyst Eaton Corporation May 2003  –  December 2004  (1 year 8 months) Corporate Banking Internship Scotia Capital June 2002  –  September 2002  (4 months) Financial Analyst Intel Corporation 1999  –  2001  (2 years) Capital Systems - DMT Manager Intel Corporation August 2013  – Present (2 years 1 month) Hillsboro, OR Capital Systems - DMT Manager Intel Corporation August 2013  – Present (2 years 1 month) Hillsboro, OR Senior Financial Analyst - TME Intel Corporation May 2011  –  July 2013  (2 years 3 months) Phoenix, Arizona Area Senior Financial Analyst - TME Intel Corporation May 2011  –  July 2013  (2 years 3 months) Phoenix, Arizona Area Senior Financial Analyst - TME/EMM Intel Corporation February 2008  –  April 2011  (3 years 3 months) Senior Financial Analyst - TME/EMM Intel Corporation February 2008  –  April 2011  (3 years 3 months) Senior Cost Engineer Intel Corporation January 2006  –  January 2008  (2 years 1 month) Senior Cost Engineer Intel Corporation January 2006  –  January 2008  (2 years 1 month) Internal Auditor Ford Motor Company January 2005  –  January 2006  (1 year 1 month) Internal Auditor Ford Motor Company January 2005  –  January 2006  (1 year 1 month) Senior Financial Analyst Eaton Corporation May 2003  –  December 2004  (1 year 8 months) Senior Financial Analyst Eaton Corporation May 2003  –  December 2004  (1 year 8 months) Corporate Banking Internship Scotia Capital June 2002  –  September 2002  (4 months) Corporate Banking Internship Scotia Capital June 2002  –  September 2002  (4 months) Financial Analyst Intel Corporation 1999  –  2001  (2 years) Financial Analyst Intel Corporation 1999  –  2001  (2 years) Skills Variance Analysis Financial Reporting Internal Audit Auditing Finance Consolidation Financial Modeling Financial Analysis Sarbanes-Oxley Act Forecasting Corporate Finance Sarbanes-Oxley Financial Forecasting Managerial Finance Strategic Financial... Cost Accounting See 1+     See less Skills  Variance Analysis Financial Reporting Internal Audit Auditing Finance Consolidation Financial Modeling Financial Analysis Sarbanes-Oxley Act Forecasting Corporate Finance Sarbanes-Oxley Financial Forecasting Managerial Finance Strategic Financial... Cost Accounting See 1+     See less Variance Analysis Financial Reporting Internal Audit Auditing Finance Consolidation Financial Modeling Financial Analysis Sarbanes-Oxley Act Forecasting Corporate Finance Sarbanes-Oxley Financial Forecasting Managerial Finance Strategic Financial... Cost Accounting See 1+     See less Variance Analysis Financial Reporting Internal Audit Auditing Finance Consolidation Financial Modeling Financial Analysis Sarbanes-Oxley Act Forecasting Corporate Finance Sarbanes-Oxley Financial Forecasting Managerial Finance Strategic Financial... Cost Accounting See 1+     See less Education University of Illinois - Champaign/Urbana MBA August 2001  – May 2003 Illinois State University Bachelors August 1995  – May 1999 Du Quoin High School University of Illinois - Champaign/Urbana MBA August 2001  – May 2003 University of Illinois - Champaign/Urbana MBA August 2001  – May 2003 University of Illinois - Champaign/Urbana MBA August 2001  – May 2003 Illinois State University Bachelors August 1995  – May 1999 Illinois State University Bachelors August 1995  – May 1999 Illinois State University Bachelors August 1995  – May 1999 Du Quoin High School Du Quoin High School Du Quoin High School ", "Experience Manager Sandia National Laboratories August 2005  – Present (10 years 1 month) Albuquerque, New Mexico Area Manage teams of project controllers and financial analysts for multiple technical areas including: renewable energy, IT and remote sensing systems (satellites). Fianancial Analyst Sandia National Laboratories October 2004  –  August 2005  (11 months) Albuquerque, New Mexico Area Managed the finances and project controls work for 5 projects in the Missile Defense Program projects. Project Manager Sandia National Laboratories October 2002  –  October 2004  (2 years 1 month) Managed 30 projects in the Second Line of Defense Program. Financial Analyst SAIC 2000  –  2002  (2 years) Albuquerque, New Mexico Area Worked at Transcore which had been purchased by SAIC. Transcore was a Los Alamos Laboratories start-up company that designed and manufactured RFID devises for use in toll ways, tracking railroad cars and shipping containers. Managed the financial and project controls work for the R&D department. Cost Engineer Intel Corporation 1997  –  1999  (2 years) Managed the financial team on the building of Fab 11 and the re-tooling of Fab 9 in Albuquerque. Manager Sandia National Laboratories August 2005  – Present (10 years 1 month) Albuquerque, New Mexico Area Manage teams of project controllers and financial analysts for multiple technical areas including: renewable energy, IT and remote sensing systems (satellites). Manager Sandia National Laboratories August 2005  – Present (10 years 1 month) Albuquerque, New Mexico Area Manage teams of project controllers and financial analysts for multiple technical areas including: renewable energy, IT and remote sensing systems (satellites). Fianancial Analyst Sandia National Laboratories October 2004  –  August 2005  (11 months) Albuquerque, New Mexico Area Managed the finances and project controls work for 5 projects in the Missile Defense Program projects. Fianancial Analyst Sandia National Laboratories October 2004  –  August 2005  (11 months) Albuquerque, New Mexico Area Managed the finances and project controls work for 5 projects in the Missile Defense Program projects. Project Manager Sandia National Laboratories October 2002  –  October 2004  (2 years 1 month) Managed 30 projects in the Second Line of Defense Program. Project Manager Sandia National Laboratories October 2002  –  October 2004  (2 years 1 month) Managed 30 projects in the Second Line of Defense Program. Financial Analyst SAIC 2000  –  2002  (2 years) Albuquerque, New Mexico Area Worked at Transcore which had been purchased by SAIC. Transcore was a Los Alamos Laboratories start-up company that designed and manufactured RFID devises for use in toll ways, tracking railroad cars and shipping containers. Managed the financial and project controls work for the R&D department. Financial Analyst SAIC 2000  –  2002  (2 years) Albuquerque, New Mexico Area Worked at Transcore which had been purchased by SAIC. Transcore was a Los Alamos Laboratories start-up company that designed and manufactured RFID devises for use in toll ways, tracking railroad cars and shipping containers. Managed the financial and project controls work for the R&D department. Cost Engineer Intel Corporation 1997  –  1999  (2 years) Managed the financial team on the building of Fab 11 and the re-tooling of Fab 9 in Albuquerque. Cost Engineer Intel Corporation 1997  –  1999  (2 years) Managed the financial team on the building of Fab 11 and the re-tooling of Fab 9 in Albuquerque. Skills Program Management Process Improvement Strategic Planning Microsoft Excel Analysis Customer Service Engineering Team Building Team Leadership Systems Engineering Security Clearance Research Operations Management Government Budgets Requirements Analysis Testing Change Management Six Sigma Public Speaking DoD Military Strategy Data Analysis Security Business Strategy Engineering Management Software Development Defense Proposal Writing Business Process... Process Improvement... See 17+     See less Skills  Program Management Process Improvement Strategic Planning Microsoft Excel Analysis Customer Service Engineering Team Building Team Leadership Systems Engineering Security Clearance Research Operations Management Government Budgets Requirements Analysis Testing Change Management Six Sigma Public Speaking DoD Military Strategy Data Analysis Security Business Strategy Engineering Management Software Development Defense Proposal Writing Business Process... Process Improvement... See 17+     See less Program Management Process Improvement Strategic Planning Microsoft Excel Analysis Customer Service Engineering Team Building Team Leadership Systems Engineering Security Clearance Research Operations Management Government Budgets Requirements Analysis Testing Change Management Six Sigma Public Speaking DoD Military Strategy Data Analysis Security Business Strategy Engineering Management Software Development Defense Proposal Writing Business Process... Process Improvement... See 17+     See less Program Management Process Improvement Strategic Planning Microsoft Excel Analysis Customer Service Engineering Team Building Team Leadership Systems Engineering Security Clearance Research Operations Management Government Budgets Requirements Analysis Testing Change Management Six Sigma Public Speaking DoD Military Strategy Data Analysis Security Business Strategy Engineering Management Software Development Defense Proposal Writing Business Process... Process Improvement... See 17+     See less Education Arizona State University Business Administration and Management , General Santa Fe University of Art and Design Master of Business Administration (MBA),  Finance , General Arizona State University Business Administration and Management , General Arizona State University Business Administration and Management , General Arizona State University Business Administration and Management , General Santa Fe University of Art and Design Master of Business Administration (MBA),  Finance , General Santa Fe University of Art and Design Master of Business Administration (MBA),  Finance , General Santa Fe University of Art and Design Master of Business Administration (MBA),  Finance , General ", "Experience Executive Regional Vice President Arbonne International September 2009  – Present (6 years) Bend, Oregon I teach people how to throw away their ALARM CLOCKS and own their lives!!!!! :-) Arbonne International is a 34 year old California based company that has Swiss Formulated Botanically Based Health & Wellness Products that are used on a daily basis! Over 400+ Products that range from Anti-Aging Skincare to Detox, Aromatherapy, Personal Care, Color Cosmetics to Weight Management/Supplements. All Products are formulated WITHOUT Mineral Oil, Animal Products/By-Products, they ARE ph correct, dermatologist tested, hypo-allergenic and fragrance free! I teach individuals and groups about the importance of using non-toxic, green, vegan, petrochemical-free products daily to maintain optimal health and get results. I teach people to shop from home by internet at a discount and show them how they can earn a full-time income by teaching others to do the same. We have expanded to Canada, Australia and the United Kingdom! Who do YOU know?? Cost Engineer Intel Corporation February 2006  –  December 2009  (3 years 11 months) Managed six general purpose building projects totaling $25M. Management of such projects consists in providing cradle to grave financial support with all levels of management while working with Procurement, Project Management and Legal. Responsible for cost control and risk mitigation. \nPrepared and presented at the appropriate management forums for CPA’s (Capital Project Approval) including underlying assumptions and risks. Guided RFP/RFQ process, pre-construction, feasibility, conceptual estimating, contract administration and vendor report card. Subcontractor/Supplier bidding process, purchase order distribution, cost control and change order management, RFI generation and coordinated schedules. Negotiated complex vendor contracts and government contracts for new projects and reviewed for regulatory compliance. Created / maintained the cost reporting and tracking for the projects. Monthly and quarterly reporting. Drove monthly total project forecasting sessions with the operations counterparts. Forecasted monthly / quarterly / annual spending for the projects. Analyzed variances and reported at the appropriate budget and spends reviews. Provided depreciation forecasts and audited depreciation start dates periodically. Supported the conversion of the IWCS cost tracking system into VersaPro. Provided financial analysis support for the sustaining projects in OR, WA, CO and UT. Monitored and ensured compliance with procedures and guidelines in conjunction with SOX, GAAP, FAR and DFAR. Capital Budget and Planning Analyst Intel Corporation November 2003  –  February 2006  (2 years 4 months) Accountant managing Commits/Spends for Fab15. Guided RFP/RFQ process, pre-construction, feasibility, conceptual estimating, contract administration and vendor report card. Subcontractor/Supplier bidding process, purchase order distribution, cost control and change order management, RFI generation and coordinated schedules. Negotiated complex vendor contracts and government contracts for new projects and reviewed for regulatory compliance. Created and delivered capital training for the operations partners. Such training proved to be valuable to the organization in terms of increasing their ability to perform job functions independently. Capital training was also provided to peers worldwide. Assumed responsibility for operations & sustaining project settlement. Investigate variance which was very challenging due to the lack of backup and historical information to use for settlement. Settled 66 lines dating back to 2003 for a total of $2.5M. Achieved ZERO delinquencies in August 05, has maintained ZERO delinquency status throughout 2005. Responsible for forecasting, reporting, consolidation, allocations, preparation, analysis of spending/headcount information as well as financial cycles such as POR, PLAN and Close. Monitored and ensured compliance with procedures and guidelines in conjunction with SOX, GAAP, FAR and DFAR. Compliance Accountant Intel Corporation January 2001  –  November 2003  (2 years 11 months) Monitored and ensured compliance with procedures and guidelines in conjunction with SOX. \nAudited duplicate reports, tracking the data to provide accurate indicators for management and error resolution. \nEnsured closure on all errors. Payroll Administrator/ Payroll Benefits Administrator Intel Corporation June 1999  –  January 2001  (1 year 8 months) Traveled to Utah for approximately a month to train processors for a smooth transition into the Utah centralized payroll department. Also a key player in the successful transition of payroll processing from Santa Clara to Oregon.  \nPlayed a major role in the new hire project, electronic web timecard code project and electronic web timecard-training project. Worked within strict deadlines on a day-to-day basis, while performing detailed work requiring extensive accuracy.  \nCreated a presentation for the Fab New Hire Employees. This project assisted the new hires in better understanding the correct instructions on filling out their web timecard and a better understanding of Intel payroll operations. Executive Regional Vice President Arbonne International September 2009  – Present (6 years) Bend, Oregon I teach people how to throw away their ALARM CLOCKS and own their lives!!!!! :-) Arbonne International is a 34 year old California based company that has Swiss Formulated Botanically Based Health & Wellness Products that are used on a daily basis! Over 400+ Products that range from Anti-Aging Skincare to Detox, Aromatherapy, Personal Care, Color Cosmetics to Weight Management/Supplements. All Products are formulated WITHOUT Mineral Oil, Animal Products/By-Products, they ARE ph correct, dermatologist tested, hypo-allergenic and fragrance free! I teach individuals and groups about the importance of using non-toxic, green, vegan, petrochemical-free products daily to maintain optimal health and get results. I teach people to shop from home by internet at a discount and show them how they can earn a full-time income by teaching others to do the same. We have expanded to Canada, Australia and the United Kingdom! Who do YOU know?? Executive Regional Vice President Arbonne International September 2009  – Present (6 years) Bend, Oregon I teach people how to throw away their ALARM CLOCKS and own their lives!!!!! :-) Arbonne International is a 34 year old California based company that has Swiss Formulated Botanically Based Health & Wellness Products that are used on a daily basis! Over 400+ Products that range from Anti-Aging Skincare to Detox, Aromatherapy, Personal Care, Color Cosmetics to Weight Management/Supplements. All Products are formulated WITHOUT Mineral Oil, Animal Products/By-Products, they ARE ph correct, dermatologist tested, hypo-allergenic and fragrance free! I teach individuals and groups about the importance of using non-toxic, green, vegan, petrochemical-free products daily to maintain optimal health and get results. I teach people to shop from home by internet at a discount and show them how they can earn a full-time income by teaching others to do the same. We have expanded to Canada, Australia and the United Kingdom! Who do YOU know?? Cost Engineer Intel Corporation February 2006  –  December 2009  (3 years 11 months) Managed six general purpose building projects totaling $25M. Management of such projects consists in providing cradle to grave financial support with all levels of management while working with Procurement, Project Management and Legal. Responsible for cost control and risk mitigation. \nPrepared and presented at the appropriate management forums for CPA’s (Capital Project Approval) including underlying assumptions and risks. Guided RFP/RFQ process, pre-construction, feasibility, conceptual estimating, contract administration and vendor report card. Subcontractor/Supplier bidding process, purchase order distribution, cost control and change order management, RFI generation and coordinated schedules. Negotiated complex vendor contracts and government contracts for new projects and reviewed for regulatory compliance. Created / maintained the cost reporting and tracking for the projects. Monthly and quarterly reporting. Drove monthly total project forecasting sessions with the operations counterparts. Forecasted monthly / quarterly / annual spending for the projects. Analyzed variances and reported at the appropriate budget and spends reviews. Provided depreciation forecasts and audited depreciation start dates periodically. Supported the conversion of the IWCS cost tracking system into VersaPro. Provided financial analysis support for the sustaining projects in OR, WA, CO and UT. Monitored and ensured compliance with procedures and guidelines in conjunction with SOX, GAAP, FAR and DFAR. Cost Engineer Intel Corporation February 2006  –  December 2009  (3 years 11 months) Managed six general purpose building projects totaling $25M. Management of such projects consists in providing cradle to grave financial support with all levels of management while working with Procurement, Project Management and Legal. Responsible for cost control and risk mitigation. \nPrepared and presented at the appropriate management forums for CPA’s (Capital Project Approval) including underlying assumptions and risks. Guided RFP/RFQ process, pre-construction, feasibility, conceptual estimating, contract administration and vendor report card. Subcontractor/Supplier bidding process, purchase order distribution, cost control and change order management, RFI generation and coordinated schedules. Negotiated complex vendor contracts and government contracts for new projects and reviewed for regulatory compliance. Created / maintained the cost reporting and tracking for the projects. Monthly and quarterly reporting. Drove monthly total project forecasting sessions with the operations counterparts. Forecasted monthly / quarterly / annual spending for the projects. Analyzed variances and reported at the appropriate budget and spends reviews. Provided depreciation forecasts and audited depreciation start dates periodically. Supported the conversion of the IWCS cost tracking system into VersaPro. Provided financial analysis support for the sustaining projects in OR, WA, CO and UT. Monitored and ensured compliance with procedures and guidelines in conjunction with SOX, GAAP, FAR and DFAR. Capital Budget and Planning Analyst Intel Corporation November 2003  –  February 2006  (2 years 4 months) Accountant managing Commits/Spends for Fab15. Guided RFP/RFQ process, pre-construction, feasibility, conceptual estimating, contract administration and vendor report card. Subcontractor/Supplier bidding process, purchase order distribution, cost control and change order management, RFI generation and coordinated schedules. Negotiated complex vendor contracts and government contracts for new projects and reviewed for regulatory compliance. Created and delivered capital training for the operations partners. Such training proved to be valuable to the organization in terms of increasing their ability to perform job functions independently. Capital training was also provided to peers worldwide. Assumed responsibility for operations & sustaining project settlement. Investigate variance which was very challenging due to the lack of backup and historical information to use for settlement. Settled 66 lines dating back to 2003 for a total of $2.5M. Achieved ZERO delinquencies in August 05, has maintained ZERO delinquency status throughout 2005. Responsible for forecasting, reporting, consolidation, allocations, preparation, analysis of spending/headcount information as well as financial cycles such as POR, PLAN and Close. Monitored and ensured compliance with procedures and guidelines in conjunction with SOX, GAAP, FAR and DFAR. Capital Budget and Planning Analyst Intel Corporation November 2003  –  February 2006  (2 years 4 months) Accountant managing Commits/Spends for Fab15. Guided RFP/RFQ process, pre-construction, feasibility, conceptual estimating, contract administration and vendor report card. Subcontractor/Supplier bidding process, purchase order distribution, cost control and change order management, RFI generation and coordinated schedules. Negotiated complex vendor contracts and government contracts for new projects and reviewed for regulatory compliance. Created and delivered capital training for the operations partners. Such training proved to be valuable to the organization in terms of increasing their ability to perform job functions independently. Capital training was also provided to peers worldwide. Assumed responsibility for operations & sustaining project settlement. Investigate variance which was very challenging due to the lack of backup and historical information to use for settlement. Settled 66 lines dating back to 2003 for a total of $2.5M. Achieved ZERO delinquencies in August 05, has maintained ZERO delinquency status throughout 2005. Responsible for forecasting, reporting, consolidation, allocations, preparation, analysis of spending/headcount information as well as financial cycles such as POR, PLAN and Close. Monitored and ensured compliance with procedures and guidelines in conjunction with SOX, GAAP, FAR and DFAR. Compliance Accountant Intel Corporation January 2001  –  November 2003  (2 years 11 months) Monitored and ensured compliance with procedures and guidelines in conjunction with SOX. \nAudited duplicate reports, tracking the data to provide accurate indicators for management and error resolution. \nEnsured closure on all errors. Compliance Accountant Intel Corporation January 2001  –  November 2003  (2 years 11 months) Monitored and ensured compliance with procedures and guidelines in conjunction with SOX. \nAudited duplicate reports, tracking the data to provide accurate indicators for management and error resolution. \nEnsured closure on all errors. Payroll Administrator/ Payroll Benefits Administrator Intel Corporation June 1999  –  January 2001  (1 year 8 months) Traveled to Utah for approximately a month to train processors for a smooth transition into the Utah centralized payroll department. Also a key player in the successful transition of payroll processing from Santa Clara to Oregon.  \nPlayed a major role in the new hire project, electronic web timecard code project and electronic web timecard-training project. Worked within strict deadlines on a day-to-day basis, while performing detailed work requiring extensive accuracy.  \nCreated a presentation for the Fab New Hire Employees. This project assisted the new hires in better understanding the correct instructions on filling out their web timecard and a better understanding of Intel payroll operations. Payroll Administrator/ Payroll Benefits Administrator Intel Corporation June 1999  –  January 2001  (1 year 8 months) Traveled to Utah for approximately a month to train processors for a smooth transition into the Utah centralized payroll department. Also a key player in the successful transition of payroll processing from Santa Clara to Oregon.  \nPlayed a major role in the new hire project, electronic web timecard code project and electronic web timecard-training project. Worked within strict deadlines on a day-to-day basis, while performing detailed work requiring extensive accuracy.  \nCreated a presentation for the Fab New Hire Employees. This project assisted the new hires in better understanding the correct instructions on filling out their web timecard and a better understanding of Intel payroll operations. Skills Process Improvement Management Marketing Finance Forecasting Project Planning New Business Development Sales Team Building Training Analysis Contract Management Procurement Financial Analysis Budgets Skills  Process Improvement Management Marketing Finance Forecasting Project Planning New Business Development Sales Team Building Training Analysis Contract Management Procurement Financial Analysis Budgets Process Improvement Management Marketing Finance Forecasting Project Planning New Business Development Sales Team Building Training Analysis Contract Management Procurement Financial Analysis Budgets Process Improvement Management Marketing Finance Forecasting Project Planning New Business Development Sales Team Building Training Analysis Contract Management Procurement Financial Analysis Budgets Education Linfield College BA,  Business Management 2003  – 2008 Certificate in Human Resources. Emphasis in Accounting. Linfield College BA,  Business Management 2003  – 2008 Certificate in Human Resources. Emphasis in Accounting. Linfield College BA,  Business Management 2003  – 2008 Certificate in Human Resources. Emphasis in Accounting. Linfield College BA,  Business Management 2003  – 2008 Certificate in Human Resources. Emphasis in Accounting. ", "Experience Case Specialist Xcel Energy August 2013  – Present (2 years 1 month) amarillo, texas Finance Cost Engineer Intel Corporation June 2011  –  August 2013  (2 years 3 months) Oregon Process and Systems Analyst Intel March 2009  –  June 2011  (2 years 4 months) PSTOA Technical Administrator Intel April 2008  –  March 2009  (1 year) Associate Accountant Intel Corporation 2004  –  2008  (4 years) Case Specialist Xcel Energy August 2013  – Present (2 years 1 month) amarillo, texas Case Specialist Xcel Energy August 2013  – Present (2 years 1 month) amarillo, texas Finance Cost Engineer Intel Corporation June 2011  –  August 2013  (2 years 3 months) Oregon Finance Cost Engineer Intel Corporation June 2011  –  August 2013  (2 years 3 months) Oregon Process and Systems Analyst Intel March 2009  –  June 2011  (2 years 4 months) Process and Systems Analyst Intel March 2009  –  June 2011  (2 years 4 months) PSTOA Technical Administrator Intel April 2008  –  March 2009  (1 year) PSTOA Technical Administrator Intel April 2008  –  March 2009  (1 year) Associate Accountant Intel Corporation 2004  –  2008  (4 years) Associate Accountant Intel Corporation 2004  –  2008  (4 years) Skills Software Documentation Process Improvement Cross-functional Team... SAP Project Management Training Program Management Business Intelligence Forecasting Financial Analysis Business Process... MS Project Vendor Management Manufacturing Microsoft Excel Project Planning Management Financial Reporting Budgets Team Leadership Visio See 6+     See less Skills  Software Documentation Process Improvement Cross-functional Team... SAP Project Management Training Program Management Business Intelligence Forecasting Financial Analysis Business Process... MS Project Vendor Management Manufacturing Microsoft Excel Project Planning Management Financial Reporting Budgets Team Leadership Visio See 6+     See less Software Documentation Process Improvement Cross-functional Team... SAP Project Management Training Program Management Business Intelligence Forecasting Financial Analysis Business Process... MS Project Vendor Management Manufacturing Microsoft Excel Project Planning Management Financial Reporting Budgets Team Leadership Visio See 6+     See less Software Documentation Process Improvement Cross-functional Team... SAP Project Management Training Program Management Business Intelligence Forecasting Financial Analysis Business Process... MS Project Vendor Management Manufacturing Microsoft Excel Project Planning Management Financial Reporting Budgets Team Leadership Visio See 6+     See less Education Linfield College BA,  Accounting 2004  – 2008 Linfield College BA,  Accounting 2004  – 2008 Linfield College BA,  Accounting 2004  – 2008 Linfield College BA,  Accounting 2004  – 2008 ", "Summary Experience as worldwide facility manager, licensing team manager, risk manager and liability insurance owner, travel manager, client representative (construction), corporate finance (planning, forecasting, zero based budgeting, etc.),  \nInternational and Domestic experience. Lived in Asia for three years. \nMultiple mergers and acquisitions and associated due diligence activities. Summary Experience as worldwide facility manager, licensing team manager, risk manager and liability insurance owner, travel manager, client representative (construction), corporate finance (planning, forecasting, zero based budgeting, etc.),  \nInternational and Domestic experience. Lived in Asia for three years. \nMultiple mergers and acquisitions and associated due diligence activities. Experience as worldwide facility manager, licensing team manager, risk manager and liability insurance owner, travel manager, client representative (construction), corporate finance (planning, forecasting, zero based budgeting, etc.),  \nInternational and Domestic experience. Lived in Asia for three years. \nMultiple mergers and acquisitions and associated due diligence activities. Experience as worldwide facility manager, licensing team manager, risk manager and liability insurance owner, travel manager, client representative (construction), corporate finance (planning, forecasting, zero based budgeting, etc.),  \nInternational and Domestic experience. Lived in Asia for three years. \nMultiple mergers and acquisitions and associated due diligence activities. Experience Project Director Facility Development Group August 2015  – Present (1 month) Rocky Mountian Region - Based in Salt Lake City •\tProvide owner representation, project delivery, and corporate relocation services for clients in the Rocky Mountain region. \n•\tServices: pre-construction design, design, scope development, document review and revision, bids and contracts, construction management/oversight, client procurement, budget and schedule creating/tracking. Director of Operations LANDesk Software December 2007  –  April 2015  (7 years 5 months) Worldwide - Based in Salt Lake City •\tManaged seventeen world-wide facilities. Lease negotiations (new and extension), tenant improvements and build-outs, yearly budgeting, strategic long range capital and capacity planning, redundancy and backup for critical operations. \n•\tRisk management program and liability insurance. Property & general liability, auto, commercial umbrella, technology E&O, workers compensation, and foreign admitted. Reduce risk to company through aggressive yearly renewal process and biennial coverage assessment. $25K average savings each of the prior three years. \n•\tManaged company travel program and associated providers. Annual savings of $50K through maximization of airline points, use of lowest cost fares, on-line booking vs. agent assist model, and negotiated contracts with major providers. \n•\tManaged all donations and contributions made to external entities, main POC for trade groups (Utah Technology Council, SLC Chamber, Etc.), managed Virginia based Cloud Appliance manufacturer, Federal Express annual contract, managed licensing and entitlement team, etc Project Controls Manager Intel Corporation June 2004  –  December 2007  (3 years 7 months) Asia Region - Based in Penang, Malaysia •\tManaged all General Purpose Construction in Asia Region through local intact teams in Malaysia, India, China, Vietnam, and Philippines. Guided teams in exceeding budget, schedule, and safety targets through use of customized contracting strategies and project delivery models. \n•\tActive supplier management and development. General Contractors, Sub-Contractors, CMGC’s, Quantity Surveyors, AE (design) firms. \n•\t$10M cost savings plus $9M in deferred scope by utilizing design to cost targets for $130M assembly and test factory. Capital Team Director Intel Technology June 2004  –  June 2007  (3 years 1 month) Americas Region - Based in Salt Lake City •\tCapital Team Director for regional accounting teams supporting multi-billion construction enterprise in Oregon, California, Arizona, New Mexico, and Colorado. \n•\tReduced resources by 30% through process improvements while maintaining same level of service and compliance. \n•\tStreamlined on time payment process from greater than 90 days to less than 30 days. Resulted in 2% cost reduction in general conditions and overhead per project. Sr. Financial Analyst / Cost Engineer Intel Corporation June 1998  –  June 2000  (2 years 1 month) Northwest Operations - Based in Salt Lake City •\tFinance lead for three large scale construction projects.  \n•\tCombined budget of $200M, One million square feet class “A” office space. \n•\tSet new standard for office building construction. Fastest (first concrete to move in), Cost (lowest cost per square foot), and Safest (500,000 man hours without recordable accident). \n•\tMember of non-fab change control board. Responsible for all financial aspects and standard cost structure for $70M standard office building. Project Director Facility Development Group August 2015  – Present (1 month) Rocky Mountian Region - Based in Salt Lake City •\tProvide owner representation, project delivery, and corporate relocation services for clients in the Rocky Mountain region. \n•\tServices: pre-construction design, design, scope development, document review and revision, bids and contracts, construction management/oversight, client procurement, budget and schedule creating/tracking. Project Director Facility Development Group August 2015  – Present (1 month) Rocky Mountian Region - Based in Salt Lake City •\tProvide owner representation, project delivery, and corporate relocation services for clients in the Rocky Mountain region. \n•\tServices: pre-construction design, design, scope development, document review and revision, bids and contracts, construction management/oversight, client procurement, budget and schedule creating/tracking. Director of Operations LANDesk Software December 2007  –  April 2015  (7 years 5 months) Worldwide - Based in Salt Lake City •\tManaged seventeen world-wide facilities. Lease negotiations (new and extension), tenant improvements and build-outs, yearly budgeting, strategic long range capital and capacity planning, redundancy and backup for critical operations. \n•\tRisk management program and liability insurance. Property & general liability, auto, commercial umbrella, technology E&O, workers compensation, and foreign admitted. Reduce risk to company through aggressive yearly renewal process and biennial coverage assessment. $25K average savings each of the prior three years. \n•\tManaged company travel program and associated providers. Annual savings of $50K through maximization of airline points, use of lowest cost fares, on-line booking vs. agent assist model, and negotiated contracts with major providers. \n•\tManaged all donations and contributions made to external entities, main POC for trade groups (Utah Technology Council, SLC Chamber, Etc.), managed Virginia based Cloud Appliance manufacturer, Federal Express annual contract, managed licensing and entitlement team, etc Director of Operations LANDesk Software December 2007  –  April 2015  (7 years 5 months) Worldwide - Based in Salt Lake City •\tManaged seventeen world-wide facilities. Lease negotiations (new and extension), tenant improvements and build-outs, yearly budgeting, strategic long range capital and capacity planning, redundancy and backup for critical operations. \n•\tRisk management program and liability insurance. Property & general liability, auto, commercial umbrella, technology E&O, workers compensation, and foreign admitted. Reduce risk to company through aggressive yearly renewal process and biennial coverage assessment. $25K average savings each of the prior three years. \n•\tManaged company travel program and associated providers. Annual savings of $50K through maximization of airline points, use of lowest cost fares, on-line booking vs. agent assist model, and negotiated contracts with major providers. \n•\tManaged all donations and contributions made to external entities, main POC for trade groups (Utah Technology Council, SLC Chamber, Etc.), managed Virginia based Cloud Appliance manufacturer, Federal Express annual contract, managed licensing and entitlement team, etc Project Controls Manager Intel Corporation June 2004  –  December 2007  (3 years 7 months) Asia Region - Based in Penang, Malaysia •\tManaged all General Purpose Construction in Asia Region through local intact teams in Malaysia, India, China, Vietnam, and Philippines. Guided teams in exceeding budget, schedule, and safety targets through use of customized contracting strategies and project delivery models. \n•\tActive supplier management and development. General Contractors, Sub-Contractors, CMGC’s, Quantity Surveyors, AE (design) firms. \n•\t$10M cost savings plus $9M in deferred scope by utilizing design to cost targets for $130M assembly and test factory. Project Controls Manager Intel Corporation June 2004  –  December 2007  (3 years 7 months) Asia Region - Based in Penang, Malaysia •\tManaged all General Purpose Construction in Asia Region through local intact teams in Malaysia, India, China, Vietnam, and Philippines. Guided teams in exceeding budget, schedule, and safety targets through use of customized contracting strategies and project delivery models. \n•\tActive supplier management and development. General Contractors, Sub-Contractors, CMGC’s, Quantity Surveyors, AE (design) firms. \n•\t$10M cost savings plus $9M in deferred scope by utilizing design to cost targets for $130M assembly and test factory. Capital Team Director Intel Technology June 2004  –  June 2007  (3 years 1 month) Americas Region - Based in Salt Lake City •\tCapital Team Director for regional accounting teams supporting multi-billion construction enterprise in Oregon, California, Arizona, New Mexico, and Colorado. \n•\tReduced resources by 30% through process improvements while maintaining same level of service and compliance. \n•\tStreamlined on time payment process from greater than 90 days to less than 30 days. Resulted in 2% cost reduction in general conditions and overhead per project. Capital Team Director Intel Technology June 2004  –  June 2007  (3 years 1 month) Americas Region - Based in Salt Lake City •\tCapital Team Director for regional accounting teams supporting multi-billion construction enterprise in Oregon, California, Arizona, New Mexico, and Colorado. \n•\tReduced resources by 30% through process improvements while maintaining same level of service and compliance. \n•\tStreamlined on time payment process from greater than 90 days to less than 30 days. Resulted in 2% cost reduction in general conditions and overhead per project. Sr. Financial Analyst / Cost Engineer Intel Corporation June 1998  –  June 2000  (2 years 1 month) Northwest Operations - Based in Salt Lake City •\tFinance lead for three large scale construction projects.  \n•\tCombined budget of $200M, One million square feet class “A” office space. \n•\tSet new standard for office building construction. Fastest (first concrete to move in), Cost (lowest cost per square foot), and Safest (500,000 man hours without recordable accident). \n•\tMember of non-fab change control board. Responsible for all financial aspects and standard cost structure for $70M standard office building. Sr. Financial Analyst / Cost Engineer Intel Corporation June 1998  –  June 2000  (2 years 1 month) Northwest Operations - Based in Salt Lake City •\tFinance lead for three large scale construction projects.  \n•\tCombined budget of $200M, One million square feet class “A” office space. \n•\tSet new standard for office building construction. Fastest (first concrete to move in), Cost (lowest cost per square foot), and Safest (500,000 man hours without recordable accident). \n•\tMember of non-fab change control board. Responsible for all financial aspects and standard cost structure for $70M standard office building. Languages English American Sign Language English American Sign Language English American Sign Language Skills Creative Direction Leadership Program Management Enterprise Software Cloud Computing SaaS Performance Tuning Time Management Management Sales Cross-functional Team... Channel Team Leadership Salesforce.com Systems Management Oracle Team Building Process Improvement C Budgets Contract Negotiation Strategic Partnerships Employee Benefits Project Management Sales Enablement Product Management Training See 12+     See less Skills  Creative Direction Leadership Program Management Enterprise Software Cloud Computing SaaS Performance Tuning Time Management Management Sales Cross-functional Team... Channel Team Leadership Salesforce.com Systems Management Oracle Team Building Process Improvement C Budgets Contract Negotiation Strategic Partnerships Employee Benefits Project Management Sales Enablement Product Management Training See 12+     See less Creative Direction Leadership Program Management Enterprise Software Cloud Computing SaaS Performance Tuning Time Management Management Sales Cross-functional Team... Channel Team Leadership Salesforce.com Systems Management Oracle Team Building Process Improvement C Budgets Contract Negotiation Strategic Partnerships Employee Benefits Project Management Sales Enablement Product Management Training See 12+     See less Creative Direction Leadership Program Management Enterprise Software Cloud Computing SaaS Performance Tuning Time Management Management Sales Cross-functional Team... Channel Team Leadership Salesforce.com Systems Management Oracle Team Building Process Improvement C Budgets Contract Negotiation Strategic Partnerships Employee Benefits Project Management Sales Enablement Product Management Training See 12+     See less Education Brigham Young University Bachelor's degree,  Business Management and Finance , 3.8 1990  – 1994 Full time student majoring in Business Management with an emphasis in Finance. Also worked full time to support self and family. Brigham Young University Bachelor's degree,  Business Management and Finance , 3.8 1990  – 1994 Full time student majoring in Business Management with an emphasis in Finance. Also worked full time to support self and family. Brigham Young University Bachelor's degree,  Business Management and Finance , 3.8 1990  – 1994 Full time student majoring in Business Management with an emphasis in Finance. Also worked full time to support self and family. Brigham Young University Bachelor's degree,  Business Management and Finance , 3.8 1990  – 1994 Full time student majoring in Business Management with an emphasis in Finance. Also worked full time to support self and family. Honors & Awards ", "Experience Director of Real Estate/Facility Air Products November 2014  – Present (10 months) Director of Real Estate/Facilty_Asia Air Products and Chemicals(China) Investment Co., Ltd May 2012  – Present (3 years 4 months) Shanghai, China Covering all real estate activities for the company in Asia, such as site searching, land acquisition, lease negotiation and execution, M&A DD studies, office consolidatio, site disposition, and etc..  \nManaging office fit-out and supervising office facility operation. \n. Senior Real Estate Manager_Asia GE Healthcare January 2010  –  April 2012  (2 years 4 months) Covering real estate activities for GE Healthcare in Asia, including strategic planning, cost saving initiatives, business expansions, feasiblity studies, real estate portfolio management, land acquisition, site disposition, site searching, lease negotiation and execution and etc. Transaction Leader_Asia GE （China) Co., Ltd. March 2007  –  January 2010  (2 years 11 months) Shanghai City, China Lease negotiation and execution, real estate portfolio management, lease termination negotiation for the GE campus project in Shanghai. Senior Cost Engineer Intel Corporation February 2006  –  March 2007  (1 year 2 months) Responsible for project budgeting and cost management; and financial oversight that ensures compliance to Intel’s Finance guidelines. Business Analyst Canadian Tire November 2001  –  February 2006  (4 years 4 months) Toronto, Canada Area ·Worked closely with strategic marketing team, store planning team and real estate team to explore the business growth opportunities. \n·Scrutinized financial and market data, capital investments, and incorporate them into the business reports. \n·Used P&L/CBA (cost benefit analysis) financial models to analyze financial return on capital investments. Director of Real Estate/Facility Air Products November 2014  – Present (10 months) Director of Real Estate/Facility Air Products November 2014  – Present (10 months) Director of Real Estate/Facilty_Asia Air Products and Chemicals(China) Investment Co., Ltd May 2012  – Present (3 years 4 months) Shanghai, China Covering all real estate activities for the company in Asia, such as site searching, land acquisition, lease negotiation and execution, M&A DD studies, office consolidatio, site disposition, and etc..  \nManaging office fit-out and supervising office facility operation. \n. Director of Real Estate/Facilty_Asia Air Products and Chemicals(China) Investment Co., Ltd May 2012  – Present (3 years 4 months) Shanghai, China Covering all real estate activities for the company in Asia, such as site searching, land acquisition, lease negotiation and execution, M&A DD studies, office consolidatio, site disposition, and etc..  \nManaging office fit-out and supervising office facility operation. \n. Senior Real Estate Manager_Asia GE Healthcare January 2010  –  April 2012  (2 years 4 months) Covering real estate activities for GE Healthcare in Asia, including strategic planning, cost saving initiatives, business expansions, feasiblity studies, real estate portfolio management, land acquisition, site disposition, site searching, lease negotiation and execution and etc. Senior Real Estate Manager_Asia GE Healthcare January 2010  –  April 2012  (2 years 4 months) Covering real estate activities for GE Healthcare in Asia, including strategic planning, cost saving initiatives, business expansions, feasiblity studies, real estate portfolio management, land acquisition, site disposition, site searching, lease negotiation and execution and etc. Transaction Leader_Asia GE （China) Co., Ltd. March 2007  –  January 2010  (2 years 11 months) Shanghai City, China Lease negotiation and execution, real estate portfolio management, lease termination negotiation for the GE campus project in Shanghai. Transaction Leader_Asia GE （China) Co., Ltd. March 2007  –  January 2010  (2 years 11 months) Shanghai City, China Lease negotiation and execution, real estate portfolio management, lease termination negotiation for the GE campus project in Shanghai. Senior Cost Engineer Intel Corporation February 2006  –  March 2007  (1 year 2 months) Responsible for project budgeting and cost management; and financial oversight that ensures compliance to Intel’s Finance guidelines. Senior Cost Engineer Intel Corporation February 2006  –  March 2007  (1 year 2 months) Responsible for project budgeting and cost management; and financial oversight that ensures compliance to Intel’s Finance guidelines. Business Analyst Canadian Tire November 2001  –  February 2006  (4 years 4 months) Toronto, Canada Area ·Worked closely with strategic marketing team, store planning team and real estate team to explore the business growth opportunities. \n·Scrutinized financial and market data, capital investments, and incorporate them into the business reports. \n·Used P&L/CBA (cost benefit analysis) financial models to analyze financial return on capital investments. Business Analyst Canadian Tire November 2001  –  February 2006  (4 years 4 months) Toronto, Canada Area ·Worked closely with strategic marketing team, store planning team and real estate team to explore the business growth opportunities. \n·Scrutinized financial and market data, capital investments, and incorporate them into the business reports. \n·Used P&L/CBA (cost benefit analysis) financial models to analyze financial return on capital investments. Languages Chinese English Chinese English Chinese English Skills Real Estate Portfolio Management Leases Feasibility Studies Lease Administration Corporate Real Estate Financial Analysis Due Diligence Real Estate Development Contract Negotiation Market Analysis Negotiation Property Management Contract Management Asset Managment Real Estate Transactions Investments Valuation Construction Management Mergers Budgets Finance Mergers  See 8+     See less Skills  Real Estate Portfolio Management Leases Feasibility Studies Lease Administration Corporate Real Estate Financial Analysis Due Diligence Real Estate Development Contract Negotiation Market Analysis Negotiation Property Management Contract Management Asset Managment Real Estate Transactions Investments Valuation Construction Management Mergers Budgets Finance Mergers  See 8+     See less Real Estate Portfolio Management Leases Feasibility Studies Lease Administration Corporate Real Estate Financial Analysis Due Diligence Real Estate Development Contract Negotiation Market Analysis Negotiation Property Management Contract Management Asset Managment Real Estate Transactions Investments Valuation Construction Management Mergers Budgets Finance Mergers  See 8+     See less Real Estate Portfolio Management Leases Feasibility Studies Lease Administration Corporate Real Estate Financial Analysis Due Diligence Real Estate Development Contract Negotiation Market Analysis Negotiation Property Management Contract Management Asset Managment Real Estate Transactions Investments Valuation Construction Management Mergers Budgets Finance Mergers  See 8+     See less Education University of Denver Master's degree,  Real Estate and Construction Management 1995  – 1997 Brock University Bachelor,  Business Administration 1991  – 1995 University of Denver Master's degree,  Real Estate and Construction Management 1995  – 1997 University of Denver Master's degree,  Real Estate and Construction Management 1995  – 1997 University of Denver Master's degree,  Real Estate and Construction Management 1995  – 1997 Brock University Bachelor,  Business Administration 1991  – 1995 Brock University Bachelor,  Business Administration 1991  – 1995 Brock University Bachelor,  Business Administration 1991  – 1995 ", "Experience Sr. Cost Engineer Intel Corporation Cost Engineer Intel / Corporate Services 2000  – Present (15 years) Sr. Cost Engineer Intel Corporation Sr. Cost Engineer Intel Corporation Cost Engineer Intel / Corporate Services 2000  – Present (15 years) Cost Engineer Intel / Corporate Services 2000  – Present (15 years) Skills Project Control Project Management Risk Management Construction Primavera P6 Cost Control Engineering Management Contract Management Engineering Project Planning Earned Value Management Cost Engineering Construction Management Cost Management Manufacturing CPM Scheduling Program Management Project Estimation MS Project See 4+     See less Skills  Project Control Project Management Risk Management Construction Primavera P6 Cost Control Engineering Management Contract Management Engineering Project Planning Earned Value Management Cost Engineering Construction Management Cost Management Manufacturing CPM Scheduling Program Management Project Estimation MS Project See 4+     See less Project Control Project Management Risk Management Construction Primavera P6 Cost Control Engineering Management Contract Management Engineering Project Planning Earned Value Management Cost Engineering Construction Management Cost Management Manufacturing CPM Scheduling Program Management Project Estimation MS Project See 4+     See less Project Control Project Management Risk Management Construction Primavera P6 Cost Control Engineering Management Contract Management Engineering Project Planning Earned Value Management Cost Engineering Construction Management Cost Management Manufacturing CPM Scheduling Program Management Project Estimation MS Project See 4+     See less Education LSU Shreveport BS,  Economics ,  Accounting 1990  – 1993 LSU Shreveport BS,  Economics ,  Accounting 1990  – 1993 LSU Shreveport BS,  Economics ,  Accounting 1990  – 1993 LSU Shreveport BS,  Economics ,  Accounting 1990  – 1993 ", "Summary Over ten years experience in finance and engineering working as an integral part of cross functional project teams or as team lead in fast-paced rapidly changing environments. Expertise includes project planning from feasibility through construction and startup; financial analysis of new capital projects, systems and facilities upgrades, operational budget planning and forecasting. Specialties:•Financial analysis, feasibility studies, planning, forecasting, budgeting, cost modeling, and cost control. \n•Experienced in Microsoft Excel, Word, Power Point, Project, Access; also, Hyperion, Oracle, SAP. \n•Create design specification and layout for laboratory, manufacturing, and distribution facilities. Summary Over ten years experience in finance and engineering working as an integral part of cross functional project teams or as team lead in fast-paced rapidly changing environments. Expertise includes project planning from feasibility through construction and startup; financial analysis of new capital projects, systems and facilities upgrades, operational budget planning and forecasting. Specialties:•Financial analysis, feasibility studies, planning, forecasting, budgeting, cost modeling, and cost control. \n•Experienced in Microsoft Excel, Word, Power Point, Project, Access; also, Hyperion, Oracle, SAP. \n•Create design specification and layout for laboratory, manufacturing, and distribution facilities. Over ten years experience in finance and engineering working as an integral part of cross functional project teams or as team lead in fast-paced rapidly changing environments. Expertise includes project planning from feasibility through construction and startup; financial analysis of new capital projects, systems and facilities upgrades, operational budget planning and forecasting. Specialties:•Financial analysis, feasibility studies, planning, forecasting, budgeting, cost modeling, and cost control. \n•Experienced in Microsoft Excel, Word, Power Point, Project, Access; also, Hyperion, Oracle, SAP. \n•Create design specification and layout for laboratory, manufacturing, and distribution facilities. Over ten years experience in finance and engineering working as an integral part of cross functional project teams or as team lead in fast-paced rapidly changing environments. Expertise includes project planning from feasibility through construction and startup; financial analysis of new capital projects, systems and facilities upgrades, operational budget planning and forecasting. Specialties:•Financial analysis, feasibility studies, planning, forecasting, budgeting, cost modeling, and cost control. \n•Experienced in Microsoft Excel, Word, Power Point, Project, Access; also, Hyperion, Oracle, SAP. \n•Create design specification and layout for laboratory, manufacturing, and distribution facilities. Experience Sr. Financial Analyst General Motors - OnStar January 2007  –  November 2007  (11 months) See OnStar below. Sr Financial Analyst OnStar January 2007  –  November 2007  (11 months) Evaluate Engineering and Information Systems projects for business case rationale and financial justification using NPV and ROI metrics. Determine impact of individual projects to capital portfolio and operations budget. Prepare business cases, and present appropriation requests for funding approval. Partner with OnStar business units to coordinate technologies across Communications, and IT platforms. Sr. Cost Engineer Intel Corporation October 2005  –  December 2006  (1 year 3 months) Review scope and estimates for large scale construction projects. Present Capital Project Authorization to senior management for approval. Set up expenditure tracking systems, monitor project construction progress, and function as project controller. Review contractor and vendor proposals, approve purchase orders for construction, as well as change orders. Forecast cash flow over life of project, report monthly and quarterly on capital and expense spending. Monitor expenditures for capital / expense classification; ensure Sarbanes Oxley compliance. Member of Technical Staff - MTS Agere Systems September 1998  –  April 2003  (4 years 8 months) Plan and manage capital and operating budgets for Microelectronics Development. Function as liaison between CFO organization and R&D leadership team. \n•Create and maintain annual budget, review monthly financial reports and variance analysis. \n•Participate in make versus buy analysis, and benchmarking against industry best practices. \n•Negotiate, and manage, service contracts with vendors for tools and equipment used in microelectronics manufacturing. Finance Manager / Member of Technical Staff Lucent Techologies 1998  –  2003  (5 years) Plan and manage capital and operating budgets for Bell Labs Microelectronics Development. Function as liaison between CFO organization and Bell Labs R&D leadership team.  \n•Create and maintain annual budget, review monthly financial reports and variance analysis.  \n•Participate in make versus buy analysis, and benchmarking against industry best practices.  \n•Negotiate, and manage, service contracts with vendors for facilities and equipment used in manufacturing. Financial Analyst Walt Disney Co April 1997  –  September 1998  (1 year 6 months) Worked within Disney World Financial Reporting to coordinate and manage the efforts of accounting associates in the execution of contracts established with joint venture partners involved in alliances with Walt Disney World. \n•Led an initiative which successfully reduced accounts payable cycle time by two weeks Mechanical Systems Engineer, Group Leader: Health and Personal Care Div. Procter & Gamble June 1978  –  September 1989  (11 years 4 months) Led the development and implementation of new technologies for the manufacturing and distribution of health care and pharmaceutical products. Trained and worked on six sigma cross functional teams.  \n•Consolidated production facilities, which saved $1.5 million per year through labor and inventory reductions, saved $1.75 million through efficiency improvements. \n•Led and coordinated activities of multi-disciplinary teams including Marketing, Finance, Manufacturing and Distribution associated with special projects.  \n•Led the implementation of new packaging for a mature brand in order to increase market share by 10% and improve customer satisfaction. Energy Systems Engineer, Mechanical Engineer: Corporate Engineering Procter & Gamble June 1978  –  September 1989  (11 years 4 months) Mechanical Systems Engineer \nDesigned mechanical systems for development, manufacturing, distribution and office facilities; systems included HVAC, steam, hot and cold water supply, gas and chemical distribution as well as materials handling systems.  \n•Eliminated custom engineering and reduced construction schedule. Project completed at $2M under budget. \n \nEnergy Systems Engineer  \nLed engineering teams from feasibility through design, construction and startup of power generation and energy conservation projects. Create specifications for high-pressure steam boiler systems and turbine generator sets.  \n•Lead facilities engineer on design of cogeneration system for manufacturing facility, established performance criteria for vendors and contractors.  \n•Negotiated contracts for equipment design, assembly, and construction. Sr. Financial Analyst General Motors - OnStar January 2007  –  November 2007  (11 months) See OnStar below. Sr. Financial Analyst General Motors - OnStar January 2007  –  November 2007  (11 months) See OnStar below. Sr Financial Analyst OnStar January 2007  –  November 2007  (11 months) Evaluate Engineering and Information Systems projects for business case rationale and financial justification using NPV and ROI metrics. Determine impact of individual projects to capital portfolio and operations budget. Prepare business cases, and present appropriation requests for funding approval. Partner with OnStar business units to coordinate technologies across Communications, and IT platforms. Sr Financial Analyst OnStar January 2007  –  November 2007  (11 months) Evaluate Engineering and Information Systems projects for business case rationale and financial justification using NPV and ROI metrics. Determine impact of individual projects to capital portfolio and operations budget. Prepare business cases, and present appropriation requests for funding approval. Partner with OnStar business units to coordinate technologies across Communications, and IT platforms. Sr. Cost Engineer Intel Corporation October 2005  –  December 2006  (1 year 3 months) Review scope and estimates for large scale construction projects. Present Capital Project Authorization to senior management for approval. Set up expenditure tracking systems, monitor project construction progress, and function as project controller. Review contractor and vendor proposals, approve purchase orders for construction, as well as change orders. Forecast cash flow over life of project, report monthly and quarterly on capital and expense spending. Monitor expenditures for capital / expense classification; ensure Sarbanes Oxley compliance. Sr. Cost Engineer Intel Corporation October 2005  –  December 2006  (1 year 3 months) Review scope and estimates for large scale construction projects. Present Capital Project Authorization to senior management for approval. Set up expenditure tracking systems, monitor project construction progress, and function as project controller. Review contractor and vendor proposals, approve purchase orders for construction, as well as change orders. Forecast cash flow over life of project, report monthly and quarterly on capital and expense spending. Monitor expenditures for capital / expense classification; ensure Sarbanes Oxley compliance. Member of Technical Staff - MTS Agere Systems September 1998  –  April 2003  (4 years 8 months) Plan and manage capital and operating budgets for Microelectronics Development. Function as liaison between CFO organization and R&D leadership team. \n•Create and maintain annual budget, review monthly financial reports and variance analysis. \n•Participate in make versus buy analysis, and benchmarking against industry best practices. \n•Negotiate, and manage, service contracts with vendors for tools and equipment used in microelectronics manufacturing. Member of Technical Staff - MTS Agere Systems September 1998  –  April 2003  (4 years 8 months) Plan and manage capital and operating budgets for Microelectronics Development. Function as liaison between CFO organization and R&D leadership team. \n•Create and maintain annual budget, review monthly financial reports and variance analysis. \n•Participate in make versus buy analysis, and benchmarking against industry best practices. \n•Negotiate, and manage, service contracts with vendors for tools and equipment used in microelectronics manufacturing. Finance Manager / Member of Technical Staff Lucent Techologies 1998  –  2003  (5 years) Plan and manage capital and operating budgets for Bell Labs Microelectronics Development. Function as liaison between CFO organization and Bell Labs R&D leadership team.  \n•Create and maintain annual budget, review monthly financial reports and variance analysis.  \n•Participate in make versus buy analysis, and benchmarking against industry best practices.  \n•Negotiate, and manage, service contracts with vendors for facilities and equipment used in manufacturing. Finance Manager / Member of Technical Staff Lucent Techologies 1998  –  2003  (5 years) Plan and manage capital and operating budgets for Bell Labs Microelectronics Development. Function as liaison between CFO organization and Bell Labs R&D leadership team.  \n•Create and maintain annual budget, review monthly financial reports and variance analysis.  \n•Participate in make versus buy analysis, and benchmarking against industry best practices.  \n•Negotiate, and manage, service contracts with vendors for facilities and equipment used in manufacturing. Financial Analyst Walt Disney Co April 1997  –  September 1998  (1 year 6 months) Worked within Disney World Financial Reporting to coordinate and manage the efforts of accounting associates in the execution of contracts established with joint venture partners involved in alliances with Walt Disney World. \n•Led an initiative which successfully reduced accounts payable cycle time by two weeks Financial Analyst Walt Disney Co April 1997  –  September 1998  (1 year 6 months) Worked within Disney World Financial Reporting to coordinate and manage the efforts of accounting associates in the execution of contracts established with joint venture partners involved in alliances with Walt Disney World. \n•Led an initiative which successfully reduced accounts payable cycle time by two weeks Mechanical Systems Engineer, Group Leader: Health and Personal Care Div. Procter & Gamble June 1978  –  September 1989  (11 years 4 months) Led the development and implementation of new technologies for the manufacturing and distribution of health care and pharmaceutical products. Trained and worked on six sigma cross functional teams.  \n•Consolidated production facilities, which saved $1.5 million per year through labor and inventory reductions, saved $1.75 million through efficiency improvements. \n•Led and coordinated activities of multi-disciplinary teams including Marketing, Finance, Manufacturing and Distribution associated with special projects.  \n•Led the implementation of new packaging for a mature brand in order to increase market share by 10% and improve customer satisfaction. Mechanical Systems Engineer, Group Leader: Health and Personal Care Div. Procter & Gamble June 1978  –  September 1989  (11 years 4 months) Led the development and implementation of new technologies for the manufacturing and distribution of health care and pharmaceutical products. Trained and worked on six sigma cross functional teams.  \n•Consolidated production facilities, which saved $1.5 million per year through labor and inventory reductions, saved $1.75 million through efficiency improvements. \n•Led and coordinated activities of multi-disciplinary teams including Marketing, Finance, Manufacturing and Distribution associated with special projects.  \n•Led the implementation of new packaging for a mature brand in order to increase market share by 10% and improve customer satisfaction. Energy Systems Engineer, Mechanical Engineer: Corporate Engineering Procter & Gamble June 1978  –  September 1989  (11 years 4 months) Mechanical Systems Engineer \nDesigned mechanical systems for development, manufacturing, distribution and office facilities; systems included HVAC, steam, hot and cold water supply, gas and chemical distribution as well as materials handling systems.  \n•Eliminated custom engineering and reduced construction schedule. Project completed at $2M under budget. \n \nEnergy Systems Engineer  \nLed engineering teams from feasibility through design, construction and startup of power generation and energy conservation projects. Create specifications for high-pressure steam boiler systems and turbine generator sets.  \n•Lead facilities engineer on design of cogeneration system for manufacturing facility, established performance criteria for vendors and contractors.  \n•Negotiated contracts for equipment design, assembly, and construction. Energy Systems Engineer, Mechanical Engineer: Corporate Engineering Procter & Gamble June 1978  –  September 1989  (11 years 4 months) Mechanical Systems Engineer \nDesigned mechanical systems for development, manufacturing, distribution and office facilities; systems included HVAC, steam, hot and cold water supply, gas and chemical distribution as well as materials handling systems.  \n•Eliminated custom engineering and reduced construction schedule. Project completed at $2M under budget. \n \nEnergy Systems Engineer  \nLed engineering teams from feasibility through design, construction and startup of power generation and energy conservation projects. Create specifications for high-pressure steam boiler systems and turbine generator sets.  \n•Lead facilities engineer on design of cogeneration system for manufacturing facility, established performance criteria for vendors and contractors.  \n•Negotiated contracts for equipment design, assembly, and construction. Education Xavier University - Williams College of Business MBA,  Finance 1986  – 1988 City University of New York City College BS Cum Laude,  Mechanical Engineering 1973  – 1978 President - International Club Activities and Societies:  Tau Beta Pi - Engineering Honor Society\nPi Tau Sigma - Mechanical Engineering Honor Society Xavier University - Williams College of Business MBA,  Finance 1986  – 1988 Xavier University - Williams College of Business MBA,  Finance 1986  – 1988 Xavier University - Williams College of Business MBA,  Finance 1986  – 1988 City University of New York City College BS Cum Laude,  Mechanical Engineering 1973  – 1978 President - International Club Activities and Societies:  Tau Beta Pi - Engineering Honor Society\nPi Tau Sigma - Mechanical Engineering Honor Society City University of New York City College BS Cum Laude,  Mechanical Engineering 1973  – 1978 President - International Club Activities and Societies:  Tau Beta Pi - Engineering Honor Society\nPi Tau Sigma - Mechanical Engineering Honor Society City University of New York City College BS Cum Laude,  Mechanical Engineering 1973  – 1978 President - International Club Activities and Societies:  Tau Beta Pi - Engineering Honor Society\nPi Tau Sigma - Mechanical Engineering Honor Society Honors & Awards Additional Honors & Awards Tau Beta Pi - National Engineering Honor Society \nPi Tau Sigma - International Mechanical Engineering Honor Society Additional Honors & Awards Tau Beta Pi - National Engineering Honor Society \nPi Tau Sigma - International Mechanical Engineering Honor Society Additional Honors & Awards Tau Beta Pi - National Engineering Honor Society \nPi Tau Sigma - International Mechanical Engineering Honor Society Additional Honors & Awards Tau Beta Pi - National Engineering Honor Society \nPi Tau Sigma - International Mechanical Engineering Honor Society ", "Summary Specialties:AACEI International - Certified Cost Engineer Summary Specialties:AACEI International - Certified Cost Engineer Specialties:AACEI International - Certified Cost Engineer Specialties:AACEI International - Certified Cost Engineer Experience Cost Analyst The Shaw Group February 2008  – Present (7 years 7 months) Cost Analyst 4 - Lead Cost Analyst on the AP 1000 Nuclear Duke Project. Responsible for developing project labor hour and cost budgets, and supporting data; collecting, evaluating, and reporting actual labor hour and cost expenditures; conducting schedule and cost performance variance analyses, trending cost performance, and establishing forecasts of labor hours and costs to-complete and at-completion; and providing weekly and monthly cost performance and analysis data to Area Managers and to the Project Manager. Also responsible for ensuring that project cost performance and forecast data (including Sarbane-Oxley requirements) are provided to support corporate cost, financial, and management reports. Construction Auditor Carolina Healthcare System May 2005  –  February 2008  (2 years 10 months) Construction Auditor – on $500 million worth of hospital construction projects throughout Charlotte Metro area. Responsibilities included review of contractual language, change orders, invoices and claims investigation. Accomplishments included introduction of General Conditions Benchmarking Techniques for evaluation of contractor bidding, identification of excess contractor labor charges on approved change orders and bids totaling $1.0 million, creation of formal construction audit process and procedure manual. Established labor rate benchmarking on change order work resulting in significant cost savings to Healthcare System. Also identified vendor payment discounts not taken advantage by hospital construction group, and potential risks to hospital from potential contractor claims and missing lien waivers on paid invoices. Cost Engineer Intel Corporation October 1997  –  May 2005  (7 years 8 months) Project Controls Lead – on 300 mm Tool Install Project in Oregon. Responsibilities included development and approval of funding requests, review and approval of all project commits, approving subcontractors’ payments, preparing cost reports and financial presentations for upper level management. Accomplishments include introduction of Benchmarking Techniques in Contractor Bidding resulting in 15% decrease in tool install unit rates. Developed detailed IFC Reconciliation Report to give management real time information on status and trends regarding reconciliations. Teamed with Factory Finance on communicating expense impacts to overall project success. Working closely with Factory Finance in establishing project affordability targets. Helped rewrite Intel’s Construction Finance Standard Policies and Procedures. Covered both Oregon Tool Install project and Colorado projects. Senior Project Controls Engineer Ralph M. Parsons June 1991  –  October 1997  (6 years 5 months) Senior Projects Controls Engineer -Lead Cost Engineer on Petrochemical projects in California, Louisiana and Texas. Responsible for the establishment of design and construction budgets, approval of subcontractor payments, presentation of monthly cost reports to senior management. Analyzed Field Change Requests for accuracy of man-hour expenditures. Reviewed Subcontractors’ man-hour and overall cost forecasts. Prepared Change Order Request for submittal to client. Developed capital and expense cash flow analysis along with manpower curves and overall cost forecasts. Processed change orders, monitored purchase order commitments and expenditures. Responsible for the tracking of subcontractor man-hours and overall costs on a daily basis during major shutdowns. Prepared monthly Profit statement for Parsons Management. Served as office manager at Refinery Site: paid invoices, monitored expenditures, administered onsite drug testing program, negotiated with vendors. Took leading role in implementing Parson’s conversion to new cost accounting system on the Shell program. Construction Estimator Saudi Aramco April 1982  –  January 1986  (3 years 10 months) Construction Estimator for Arabian American Oil Company (ARAMCO) - Responsible for  \nAramco’s response to contractors’ claims for additional compensation on various land  \ndevelopment projects. Streamlined change order cost analysis process which improved change order pricing and generated significant cost savings to Aramco. Prepared detailed bid analysis on new construction projects, negotiated overall contract price and change orders with contractors. Monitored contractors’ progress on site grading, utility lines (sewer, water, electricity, telephone) installation and road construction. Approved contractors’ progress payments. Field Office Engineer Davy McKee Corporation July 1980  –  February 1982  (1 year 8 months) Field Office Engineer/Quality Control Inspector - Responsible for final inspections prior to  \nconcrete pours and field acceptance of concrete delivered to jobsite. Administered construction  \ncost reporting process Cost Analyst The Shaw Group February 2008  – Present (7 years 7 months) Cost Analyst 4 - Lead Cost Analyst on the AP 1000 Nuclear Duke Project. Responsible for developing project labor hour and cost budgets, and supporting data; collecting, evaluating, and reporting actual labor hour and cost expenditures; conducting schedule and cost performance variance analyses, trending cost performance, and establishing forecasts of labor hours and costs to-complete and at-completion; and providing weekly and monthly cost performance and analysis data to Area Managers and to the Project Manager. Also responsible for ensuring that project cost performance and forecast data (including Sarbane-Oxley requirements) are provided to support corporate cost, financial, and management reports. Cost Analyst The Shaw Group February 2008  – Present (7 years 7 months) Cost Analyst 4 - Lead Cost Analyst on the AP 1000 Nuclear Duke Project. Responsible for developing project labor hour and cost budgets, and supporting data; collecting, evaluating, and reporting actual labor hour and cost expenditures; conducting schedule and cost performance variance analyses, trending cost performance, and establishing forecasts of labor hours and costs to-complete and at-completion; and providing weekly and monthly cost performance and analysis data to Area Managers and to the Project Manager. Also responsible for ensuring that project cost performance and forecast data (including Sarbane-Oxley requirements) are provided to support corporate cost, financial, and management reports. Construction Auditor Carolina Healthcare System May 2005  –  February 2008  (2 years 10 months) Construction Auditor – on $500 million worth of hospital construction projects throughout Charlotte Metro area. Responsibilities included review of contractual language, change orders, invoices and claims investigation. Accomplishments included introduction of General Conditions Benchmarking Techniques for evaluation of contractor bidding, identification of excess contractor labor charges on approved change orders and bids totaling $1.0 million, creation of formal construction audit process and procedure manual. Established labor rate benchmarking on change order work resulting in significant cost savings to Healthcare System. Also identified vendor payment discounts not taken advantage by hospital construction group, and potential risks to hospital from potential contractor claims and missing lien waivers on paid invoices. Construction Auditor Carolina Healthcare System May 2005  –  February 2008  (2 years 10 months) Construction Auditor – on $500 million worth of hospital construction projects throughout Charlotte Metro area. Responsibilities included review of contractual language, change orders, invoices and claims investigation. Accomplishments included introduction of General Conditions Benchmarking Techniques for evaluation of contractor bidding, identification of excess contractor labor charges on approved change orders and bids totaling $1.0 million, creation of formal construction audit process and procedure manual. Established labor rate benchmarking on change order work resulting in significant cost savings to Healthcare System. Also identified vendor payment discounts not taken advantage by hospital construction group, and potential risks to hospital from potential contractor claims and missing lien waivers on paid invoices. Cost Engineer Intel Corporation October 1997  –  May 2005  (7 years 8 months) Project Controls Lead – on 300 mm Tool Install Project in Oregon. Responsibilities included development and approval of funding requests, review and approval of all project commits, approving subcontractors’ payments, preparing cost reports and financial presentations for upper level management. Accomplishments include introduction of Benchmarking Techniques in Contractor Bidding resulting in 15% decrease in tool install unit rates. Developed detailed IFC Reconciliation Report to give management real time information on status and trends regarding reconciliations. Teamed with Factory Finance on communicating expense impacts to overall project success. Working closely with Factory Finance in establishing project affordability targets. Helped rewrite Intel’s Construction Finance Standard Policies and Procedures. Covered both Oregon Tool Install project and Colorado projects. Cost Engineer Intel Corporation October 1997  –  May 2005  (7 years 8 months) Project Controls Lead – on 300 mm Tool Install Project in Oregon. Responsibilities included development and approval of funding requests, review and approval of all project commits, approving subcontractors’ payments, preparing cost reports and financial presentations for upper level management. Accomplishments include introduction of Benchmarking Techniques in Contractor Bidding resulting in 15% decrease in tool install unit rates. Developed detailed IFC Reconciliation Report to give management real time information on status and trends regarding reconciliations. Teamed with Factory Finance on communicating expense impacts to overall project success. Working closely with Factory Finance in establishing project affordability targets. Helped rewrite Intel’s Construction Finance Standard Policies and Procedures. Covered both Oregon Tool Install project and Colorado projects. Senior Project Controls Engineer Ralph M. Parsons June 1991  –  October 1997  (6 years 5 months) Senior Projects Controls Engineer -Lead Cost Engineer on Petrochemical projects in California, Louisiana and Texas. Responsible for the establishment of design and construction budgets, approval of subcontractor payments, presentation of monthly cost reports to senior management. Analyzed Field Change Requests for accuracy of man-hour expenditures. Reviewed Subcontractors’ man-hour and overall cost forecasts. Prepared Change Order Request for submittal to client. Developed capital and expense cash flow analysis along with manpower curves and overall cost forecasts. Processed change orders, monitored purchase order commitments and expenditures. Responsible for the tracking of subcontractor man-hours and overall costs on a daily basis during major shutdowns. Prepared monthly Profit statement for Parsons Management. Served as office manager at Refinery Site: paid invoices, monitored expenditures, administered onsite drug testing program, negotiated with vendors. Took leading role in implementing Parson’s conversion to new cost accounting system on the Shell program. Senior Project Controls Engineer Ralph M. Parsons June 1991  –  October 1997  (6 years 5 months) Senior Projects Controls Engineer -Lead Cost Engineer on Petrochemical projects in California, Louisiana and Texas. Responsible for the establishment of design and construction budgets, approval of subcontractor payments, presentation of monthly cost reports to senior management. Analyzed Field Change Requests for accuracy of man-hour expenditures. Reviewed Subcontractors’ man-hour and overall cost forecasts. Prepared Change Order Request for submittal to client. Developed capital and expense cash flow analysis along with manpower curves and overall cost forecasts. Processed change orders, monitored purchase order commitments and expenditures. Responsible for the tracking of subcontractor man-hours and overall costs on a daily basis during major shutdowns. Prepared monthly Profit statement for Parsons Management. Served as office manager at Refinery Site: paid invoices, monitored expenditures, administered onsite drug testing program, negotiated with vendors. Took leading role in implementing Parson’s conversion to new cost accounting system on the Shell program. Construction Estimator Saudi Aramco April 1982  –  January 1986  (3 years 10 months) Construction Estimator for Arabian American Oil Company (ARAMCO) - Responsible for  \nAramco’s response to contractors’ claims for additional compensation on various land  \ndevelopment projects. Streamlined change order cost analysis process which improved change order pricing and generated significant cost savings to Aramco. Prepared detailed bid analysis on new construction projects, negotiated overall contract price and change orders with contractors. Monitored contractors’ progress on site grading, utility lines (sewer, water, electricity, telephone) installation and road construction. Approved contractors’ progress payments. Construction Estimator Saudi Aramco April 1982  –  January 1986  (3 years 10 months) Construction Estimator for Arabian American Oil Company (ARAMCO) - Responsible for  \nAramco’s response to contractors’ claims for additional compensation on various land  \ndevelopment projects. Streamlined change order cost analysis process which improved change order pricing and generated significant cost savings to Aramco. Prepared detailed bid analysis on new construction projects, negotiated overall contract price and change orders with contractors. Monitored contractors’ progress on site grading, utility lines (sewer, water, electricity, telephone) installation and road construction. Approved contractors’ progress payments. Field Office Engineer Davy McKee Corporation July 1980  –  February 1982  (1 year 8 months) Field Office Engineer/Quality Control Inspector - Responsible for final inspections prior to  \nconcrete pours and field acceptance of concrete delivered to jobsite. Administered construction  \ncost reporting process Field Office Engineer Davy McKee Corporation July 1980  –  February 1982  (1 year 8 months) Field Office Engineer/Quality Control Inspector - Responsible for final inspections prior to  \nconcrete pours and field acceptance of concrete delivered to jobsite. Administered construction  \ncost reporting process Skills Cost Budgeting Forecasting Change Orders Nuclear Cost Engineering Cost Control Cost Estimating Earned Value Management Project Control Cost Management Construction Management WBS Contract Management Quantity Surveying Value Engineering EPC Planning Cost Analysis Oil Petrochemical Engineering Excel Change Management Feasibility Studies Construction See 11+     See less Skills  Cost Budgeting Forecasting Change Orders Nuclear Cost Engineering Cost Control Cost Estimating Earned Value Management Project Control Cost Management Construction Management WBS Contract Management Quantity Surveying Value Engineering EPC Planning Cost Analysis Oil Petrochemical Engineering Excel Change Management Feasibility Studies Construction See 11+     See less Cost Budgeting Forecasting Change Orders Nuclear Cost Engineering Cost Control Cost Estimating Earned Value Management Project Control Cost Management Construction Management WBS Contract Management Quantity Surveying Value Engineering EPC Planning Cost Analysis Oil Petrochemical Engineering Excel Change Management Feasibility Studies Construction See 11+     See less Cost Budgeting Forecasting Change Orders Nuclear Cost Engineering Cost Control Cost Estimating Earned Value Management Project Control Cost Management Construction Management WBS Contract Management Quantity Surveying Value Engineering EPC Planning Cost Analysis Oil Petrochemical Engineering Excel Change Management Feasibility Studies Construction See 11+     See less Education Penn State University MBA,  Finance 1989  – 1991 Stanford University MSCE,  Construction Management 1979  – 1980 University of California, Davis BSCE,  Civil Engineering 1974  – 1979 Penn State University MBA,  Finance 1989  – 1991 Penn State University MBA,  Finance 1989  – 1991 Penn State University MBA,  Finance 1989  – 1991 Stanford University MSCE,  Construction Management 1979  – 1980 Stanford University MSCE,  Construction Management 1979  – 1980 Stanford University MSCE,  Construction Management 1979  – 1980 University of California, Davis BSCE,  Civil Engineering 1974  – 1979 University of California, Davis BSCE,  Civil Engineering 1974  – 1979 University of California, Davis BSCE,  Civil Engineering 1974  – 1979 Honors & Awards Additional Honors & Awards AACEI Certified Cost Engineer Additional Honors & Awards AACEI Certified Cost Engineer Additional Honors & Awards AACEI Certified Cost Engineer Additional Honors & Awards AACEI Certified Cost Engineer ", "Summary 4 years financial experience. \nRich experience in data processing, estimation, benchmarking, and analysis methodologies. E.g. Sensitivity Analysis, Monte Carlo Simulation, etc. \nCross-regional projects management experience. Strong skills in quotation validation and supplier negotiation. \nStrong communication skills and excellent command of spoken/written English. Summary 4 years financial experience. \nRich experience in data processing, estimation, benchmarking, and analysis methodologies. E.g. Sensitivity Analysis, Monte Carlo Simulation, etc. \nCross-regional projects management experience. Strong skills in quotation validation and supplier negotiation. \nStrong communication skills and excellent command of spoken/written English. 4 years financial experience. \nRich experience in data processing, estimation, benchmarking, and analysis methodologies. E.g. Sensitivity Analysis, Monte Carlo Simulation, etc. \nCross-regional projects management experience. Strong skills in quotation validation and supplier negotiation. \nStrong communication skills and excellent command of spoken/written English. 4 years financial experience. \nRich experience in data processing, estimation, benchmarking, and analysis methodologies. E.g. Sensitivity Analysis, Monte Carlo Simulation, etc. \nCross-regional projects management experience. Strong skills in quotation validation and supplier negotiation. \nStrong communication skills and excellent command of spoken/written English. Experience Cost Engineer Intel Corporation April 2011  – Present (4 years 5 months) DL Cost Engineer Intel Corporation April 2011  – Present (4 years 5 months) DL Cost Engineer Intel Corporation April 2011  – Present (4 years 5 months) DL Languages English Full professional proficiency English Full professional proficiency English Full professional proficiency Full professional proficiency Skills Capital Budgeting Outlook Microsoft Excel PowerPoint Contract Negotiation Financial Forecasting Business English Financial Analysis Market Research SPSS Statistical Data... Cost Engineering System Administration SAP Skills  Capital Budgeting Outlook Microsoft Excel PowerPoint Contract Negotiation Financial Forecasting Business English Financial Analysis Market Research SPSS Statistical Data... Cost Engineering System Administration SAP Capital Budgeting Outlook Microsoft Excel PowerPoint Contract Negotiation Financial Forecasting Business English Financial Analysis Market Research SPSS Statistical Data... Cost Engineering System Administration SAP Capital Budgeting Outlook Microsoft Excel PowerPoint Contract Negotiation Financial Forecasting Business English Financial Analysis Market Research SPSS Statistical Data... Cost Engineering System Administration SAP Education Dongbei University of Finance and Economics Master of statistics Dongbei University of Finance and Economics Master of statistics Dongbei University of Finance and Economics Master of statistics Dongbei University of Finance and Economics Master of statistics "]}