{"position": "Customer Business Analyst", "company": "Intel Corporation", "profiles": ["Summary Published journalist with a joint Hons. Degree in English Language and Creative Writing and a SILIC award in Japanese. \n \nPresently working at Intel Corporation UK as a Customer Business Analyst, while also serving on the corporation's editorial board and editing the in-house magazine. Summary Published journalist with a joint Hons. Degree in English Language and Creative Writing and a SILIC award in Japanese. \n \nPresently working at Intel Corporation UK as a Customer Business Analyst, while also serving on the corporation's editorial board and editing the in-house magazine. Published journalist with a joint Hons. Degree in English Language and Creative Writing and a SILIC award in Japanese. \n \nPresently working at Intel Corporation UK as a Customer Business Analyst, while also serving on the corporation's editorial board and editing the in-house magazine. Published journalist with a joint Hons. Degree in English Language and Creative Writing and a SILIC award in Japanese. \n \nPresently working at Intel Corporation UK as a Customer Business Analyst, while also serving on the corporation's editorial board and editing the in-house magazine. Experience Customer Business Analyst Intel Corporation 2013  – Present (2 years) Manage the day to day analytics and forecasting for our largest Russian distributor. I also serve on the editorial board for marketing and edit the in-house magazine. Mentor Aimhigher 2010  –  2012  (2 years) Coached young people with behavioural difficulties to improve their school performance. Journalist Neo magazine 2010  –  2011  (1 year) Contributed Japanese Media Reviews for publication on a roughly bi-monthly basis. Customer Business Analyst Intel Corporation 2013  – Present (2 years) Manage the day to day analytics and forecasting for our largest Russian distributor. I also serve on the editorial board for marketing and edit the in-house magazine. Customer Business Analyst Intel Corporation 2013  – Present (2 years) Manage the day to day analytics and forecasting for our largest Russian distributor. I also serve on the editorial board for marketing and edit the in-house magazine. Mentor Aimhigher 2010  –  2012  (2 years) Coached young people with behavioural difficulties to improve their school performance. Mentor Aimhigher 2010  –  2012  (2 years) Coached young people with behavioural difficulties to improve their school performance. Journalist Neo magazine 2010  –  2011  (1 year) Contributed Japanese Media Reviews for publication on a roughly bi-monthly basis. Journalist Neo magazine 2010  –  2011  (1 year) Contributed Japanese Media Reviews for publication on a roughly bi-monthly basis. Languages Japanese Limited working proficiency English Native or bilingual proficiency Japanese Limited working proficiency English Native or bilingual proficiency Japanese Limited working proficiency English Native or bilingual proficiency Limited working proficiency Native or bilingual proficiency Skills Publications Japanese Marketing Articles Prose, Script and... Languages Childcare Writing Social Media Marketing Skills  Publications Japanese Marketing Articles Prose, Script and... Languages Childcare Writing Social Media Marketing Publications Japanese Marketing Articles Prose, Script and... Languages Childcare Writing Social Media Marketing Publications Japanese Marketing Articles Prose, Script and... Languages Childcare Writing Social Media Marketing Education University of Gloucestershire Bachelor of Humanities,  English Language and Creative Writing 2009  – 2012 Joint honours degree in Creative Writing and English Language, graded 2:1. New College, Swindon A and AS Levels,  English ,  Media , Drama,  General Studies 2007  – 2009 Three A-levels and one AS level graded B/C Ridgeway 12 GCSEs graded A-C plus ICT NVQ University of Gloucestershire Bachelor of Humanities,  English Language and Creative Writing 2009  – 2012 Joint honours degree in Creative Writing and English Language, graded 2:1. University of Gloucestershire Bachelor of Humanities,  English Language and Creative Writing 2009  – 2012 Joint honours degree in Creative Writing and English Language, graded 2:1. University of Gloucestershire Bachelor of Humanities,  English Language and Creative Writing 2009  – 2012 Joint honours degree in Creative Writing and English Language, graded 2:1. New College, Swindon A and AS Levels,  English ,  Media , Drama,  General Studies 2007  – 2009 Three A-levels and one AS level graded B/C New College, Swindon A and AS Levels,  English ,  Media , Drama,  General Studies 2007  – 2009 Three A-levels and one AS level graded B/C New College, Swindon A and AS Levels,  English ,  Media , Drama,  General Studies 2007  – 2009 Three A-levels and one AS level graded B/C Ridgeway 12 GCSEs graded A-C plus ICT NVQ Ridgeway 12 GCSEs graded A-C plus ICT NVQ Ridgeway 12 GCSEs graded A-C plus ICT NVQ ", "Experience Customer Business Analyst Intel Corporation July 2014  – Present (1 year 2 months) Swindon, United Kingdom Brand Advocate Intel Corporation August 2013  –  July 2014  (1 year) Customer Business Analyst Intel Corporation July 2012  –  August 2013  (1 year 2 months) Swindon, United Kingdom Responsibilities included; \n•\tBuilding and managing relationships with a number of both internal and external stakeholders based both in the UK and internationally \n•\tProduct and revenue based forecasting \n•\tMarket and Competitor Analysis \n•\tPresenting key customer information and updates to Intel management on a weekly basis \n•\tWorking in a team to provide key updates to global stakeholders \n•\tTeam logistics representative which involved managing a significant logistical change \n•\tEnsuring I was sufficiently trained in the latest Intel products Customer Business Analyst Intel Corporation July 2014  – Present (1 year 2 months) Swindon, United Kingdom Customer Business Analyst Intel Corporation July 2014  – Present (1 year 2 months) Swindon, United Kingdom Brand Advocate Intel Corporation August 2013  –  July 2014  (1 year) Brand Advocate Intel Corporation August 2013  –  July 2014  (1 year) Customer Business Analyst Intel Corporation July 2012  –  August 2013  (1 year 2 months) Swindon, United Kingdom Responsibilities included; \n•\tBuilding and managing relationships with a number of both internal and external stakeholders based both in the UK and internationally \n•\tProduct and revenue based forecasting \n•\tMarket and Competitor Analysis \n•\tPresenting key customer information and updates to Intel management on a weekly basis \n•\tWorking in a team to provide key updates to global stakeholders \n•\tTeam logistics representative which involved managing a significant logistical change \n•\tEnsuring I was sufficiently trained in the latest Intel products Customer Business Analyst Intel Corporation July 2012  –  August 2013  (1 year 2 months) Swindon, United Kingdom Responsibilities included; \n•\tBuilding and managing relationships with a number of both internal and external stakeholders based both in the UK and internationally \n•\tProduct and revenue based forecasting \n•\tMarket and Competitor Analysis \n•\tPresenting key customer information and updates to Intel management on a weekly basis \n•\tWorking in a team to provide key updates to global stakeholders \n•\tTeam logistics representative which involved managing a significant logistical change \n•\tEnsuring I was sufficiently trained in the latest Intel products Skills Account Management Competitive Analysis Product Marketing Data Analysis Cross-functional Team... Forecasting Supply Chain Management Market Analysis Skills  Account Management Competitive Analysis Product Marketing Data Analysis Cross-functional Team... Forecasting Supply Chain Management Market Analysis Account Management Competitive Analysis Product Marketing Data Analysis Cross-functional Team... Forecasting Supply Chain Management Market Analysis Account Management Competitive Analysis Product Marketing Data Analysis Cross-functional Team... Forecasting Supply Chain Management Market Analysis Education Bournemouth University Bachelor of Arts (BA),  Business Studies with Economics 2010  – 2014 Alton College 2008  – 2010 Bournemouth University Bachelor of Arts (BA),  Business Studies with Economics 2010  – 2014 Bournemouth University Bachelor of Arts (BA),  Business Studies with Economics 2010  – 2014 Bournemouth University Bachelor of Arts (BA),  Business Studies with Economics 2010  – 2014 Alton College 2008  – 2010 Alton College 2008  – 2010 Alton College 2008  – 2010 ", "Summary Enjoy's working in an project environment, implementing change into a business. With experience within the banking, semiconductor/technology/telco industries. \n \nCapable of working with and utilising individuals with various expertise to facilitate and produce work of a high level. Summary Enjoy's working in an project environment, implementing change into a business. With experience within the banking, semiconductor/technology/telco industries. \n \nCapable of working with and utilising individuals with various expertise to facilitate and produce work of a high level. Enjoy's working in an project environment, implementing change into a business. With experience within the banking, semiconductor/technology/telco industries. \n \nCapable of working with and utilising individuals with various expertise to facilitate and produce work of a high level. Enjoy's working in an project environment, implementing change into a business. With experience within the banking, semiconductor/technology/telco industries. \n \nCapable of working with and utilising individuals with various expertise to facilitate and produce work of a high level. Experience UK Project Manager Intel Corporation July 2015  – Present (2 months) London, United Kingdom Smart Cities, Innovation and Government MNC Customer Business Analyst Intel Corporation June 2014  –  July 2015  (1 year 2 months) Swindon, United Kingdom Managing customer relationships, forecasting, revenue and supply chain throughout EMEA for the worlds largest producer in Computing. Commissions Analyst Intel Corporation October 2014  –  March 2015  (6 months) Swindon, United Kingdom Managing commission payments for all commission based employees within Russia, Ukraine and META region. University Advocate Intel Corporation July 2013  –  June 2014  (1 year) leeds, united kingdom Advocating the benefits of Intel technology to University students and employees. Junior Business Analyst - (Lloyds Banking Group inc. TSB) Lloyds Banking Group October 2013  –  May 2014  (8 months) leeds, united kingdom Person to Person Mobile Payments - PayM EMEA Operations Service Provider Lead & CE Customer Business Analyst Intel Corporation January 2013  –  August 2013  (8 months) Swindon, United Kingdom During the second half of my placement at Intel I joined the Operations team within EMEA to provider a Service Provider Influence to the way we interact with our Smartphone, CE and TEM customers.  \n \nAs part of this role I trained to become a Customer Business Analyst for Consumer Electronics, working with various OEM's who produce Set-Top Boxes and Gateway products to our Service Provider customers. Global Telco Sales and Marketing Analyst Intel Corporation July 2012  –  August 2013  (1 year 2 months) Swindon, United Kingdom UK Co-ordinator of Orange Smartphone Trials \n \nFuture Channel Investment Programme Telco Lead \n \nWorldwide Service Provider Customer Excellence Programme Analyst \n \nWorldwide Service Provider Tools and Training Support \n \nIntel Sales and Marketing Conference Telco Summit Lead \n \nMobile World Congress Trip Owner Assistant \n \nAd Hoc Executive Reporting and Analysis Junior Business Analyst - (Cheltenham & Gloucester) Lloyds Banking Group January 2012  –  February 2012  (2 months) Gloucester, United Kingdom Mortgages Migration - Release F (Central Team, Readiness) \n \nShort term full time contract during University Study. \n \nProducing a Readiness Dashboard for mortgages migration, to ensure it is sensible to proceed with the migration on the run up to the event. Project Assistant/Junior BA - (Lloyds TSB) Lloyds Banking Group June 2010  –  January 2012  (1 year 8 months) London, United Kingdom Working on Release C* Central Team - HBoS Migration within a number of work streams. \n \n*Release C is the largest and most complex stage of Integration between Lloyds & HBoS and affects every colleague & every customer. Release C is about preparing for & transferring all HBoS current & savings accounts & Commercial & UK Private Banking accounts onto the single Lloyds Banking Group IT platform. \n \nReadiness - Preparation & reporting whether the business is ready for the integration. As well as creating CRF's (Critcial Readiness Factors) \n \nPGV (PreGo Validation)(FOV) - An intense validation period in which the basic bank functions are tested to prove how successful the migration has been. The MI Reporting that is produced is presented to the Integration Board which directly affects whether the organisation is to proceed with the integration. \n \nBCO (Business Checkout) – A period which ensures all areas of the bank have been tested, highlighting issues that need fixing to allow the bank to function. \n \nIBP (Interim Business Processing) - When the integration is taking place many of the bank systems are unavailable. This work stream organises the white bagging of processes to be processed once systems become back in use.  \n \nGold Command & Control - The work stream that manage every work stream & division involved in the integration. Producing Go's & Tell's to allow each of the stages on the integration to commence. \n \nSharePoint - Creation & Management of a SharePoint site used for the collation of testing results which would further then be used to create Executive Reports. \n \nExecutive Reporting - Production & creation of dashboards & reports which were delivered to the board on a regular basis. \n \nStakeholder Management - Developing relationships with stakeholders, involving numerous weekly meetings & one to one sessions. \n \nQuality Management - QA & checking documents to ensure a constant high level of reporting/documentation for Stakeholders & Executives. Software Tester Lloyds TSB June 2008  –  September 2008  (4 months) Bristol, United Kingdom Work Experience \n \nWorking on W2, which is a project creating software to off shore, recruitment admin work, which also included creating a training manual for the completed software. Work Experience NFU Mutual October 2006  –  October 2006  (1 month) Stratford Whistle stop tour of the company, being introduced to Project Management, Under Writing, Accounting and Risk. UK Project Manager Intel Corporation July 2015  – Present (2 months) London, United Kingdom Smart Cities, Innovation and Government UK Project Manager Intel Corporation July 2015  – Present (2 months) London, United Kingdom Smart Cities, Innovation and Government MNC Customer Business Analyst Intel Corporation June 2014  –  July 2015  (1 year 2 months) Swindon, United Kingdom Managing customer relationships, forecasting, revenue and supply chain throughout EMEA for the worlds largest producer in Computing. MNC Customer Business Analyst Intel Corporation June 2014  –  July 2015  (1 year 2 months) Swindon, United Kingdom Managing customer relationships, forecasting, revenue and supply chain throughout EMEA for the worlds largest producer in Computing. Commissions Analyst Intel Corporation October 2014  –  March 2015  (6 months) Swindon, United Kingdom Managing commission payments for all commission based employees within Russia, Ukraine and META region. Commissions Analyst Intel Corporation October 2014  –  March 2015  (6 months) Swindon, United Kingdom Managing commission payments for all commission based employees within Russia, Ukraine and META region. University Advocate Intel Corporation July 2013  –  June 2014  (1 year) leeds, united kingdom Advocating the benefits of Intel technology to University students and employees. University Advocate Intel Corporation July 2013  –  June 2014  (1 year) leeds, united kingdom Advocating the benefits of Intel technology to University students and employees. Junior Business Analyst - (Lloyds Banking Group inc. TSB) Lloyds Banking Group October 2013  –  May 2014  (8 months) leeds, united kingdom Person to Person Mobile Payments - PayM Junior Business Analyst - (Lloyds Banking Group inc. TSB) Lloyds Banking Group October 2013  –  May 2014  (8 months) leeds, united kingdom Person to Person Mobile Payments - PayM EMEA Operations Service Provider Lead & CE Customer Business Analyst Intel Corporation January 2013  –  August 2013  (8 months) Swindon, United Kingdom During the second half of my placement at Intel I joined the Operations team within EMEA to provider a Service Provider Influence to the way we interact with our Smartphone, CE and TEM customers.  \n \nAs part of this role I trained to become a Customer Business Analyst for Consumer Electronics, working with various OEM's who produce Set-Top Boxes and Gateway products to our Service Provider customers. EMEA Operations Service Provider Lead & CE Customer Business Analyst Intel Corporation January 2013  –  August 2013  (8 months) Swindon, United Kingdom During the second half of my placement at Intel I joined the Operations team within EMEA to provider a Service Provider Influence to the way we interact with our Smartphone, CE and TEM customers.  \n \nAs part of this role I trained to become a Customer Business Analyst for Consumer Electronics, working with various OEM's who produce Set-Top Boxes and Gateway products to our Service Provider customers. Global Telco Sales and Marketing Analyst Intel Corporation July 2012  –  August 2013  (1 year 2 months) Swindon, United Kingdom UK Co-ordinator of Orange Smartphone Trials \n \nFuture Channel Investment Programme Telco Lead \n \nWorldwide Service Provider Customer Excellence Programme Analyst \n \nWorldwide Service Provider Tools and Training Support \n \nIntel Sales and Marketing Conference Telco Summit Lead \n \nMobile World Congress Trip Owner Assistant \n \nAd Hoc Executive Reporting and Analysis Global Telco Sales and Marketing Analyst Intel Corporation July 2012  –  August 2013  (1 year 2 months) Swindon, United Kingdom UK Co-ordinator of Orange Smartphone Trials \n \nFuture Channel Investment Programme Telco Lead \n \nWorldwide Service Provider Customer Excellence Programme Analyst \n \nWorldwide Service Provider Tools and Training Support \n \nIntel Sales and Marketing Conference Telco Summit Lead \n \nMobile World Congress Trip Owner Assistant \n \nAd Hoc Executive Reporting and Analysis Junior Business Analyst - (Cheltenham & Gloucester) Lloyds Banking Group January 2012  –  February 2012  (2 months) Gloucester, United Kingdom Mortgages Migration - Release F (Central Team, Readiness) \n \nShort term full time contract during University Study. \n \nProducing a Readiness Dashboard for mortgages migration, to ensure it is sensible to proceed with the migration on the run up to the event. Junior Business Analyst - (Cheltenham & Gloucester) Lloyds Banking Group January 2012  –  February 2012  (2 months) Gloucester, United Kingdom Mortgages Migration - Release F (Central Team, Readiness) \n \nShort term full time contract during University Study. \n \nProducing a Readiness Dashboard for mortgages migration, to ensure it is sensible to proceed with the migration on the run up to the event. Project Assistant/Junior BA - (Lloyds TSB) Lloyds Banking Group June 2010  –  January 2012  (1 year 8 months) London, United Kingdom Working on Release C* Central Team - HBoS Migration within a number of work streams. \n \n*Release C is the largest and most complex stage of Integration between Lloyds & HBoS and affects every colleague & every customer. Release C is about preparing for & transferring all HBoS current & savings accounts & Commercial & UK Private Banking accounts onto the single Lloyds Banking Group IT platform. \n \nReadiness - Preparation & reporting whether the business is ready for the integration. As well as creating CRF's (Critcial Readiness Factors) \n \nPGV (PreGo Validation)(FOV) - An intense validation period in which the basic bank functions are tested to prove how successful the migration has been. The MI Reporting that is produced is presented to the Integration Board which directly affects whether the organisation is to proceed with the integration. \n \nBCO (Business Checkout) – A period which ensures all areas of the bank have been tested, highlighting issues that need fixing to allow the bank to function. \n \nIBP (Interim Business Processing) - When the integration is taking place many of the bank systems are unavailable. This work stream organises the white bagging of processes to be processed once systems become back in use.  \n \nGold Command & Control - The work stream that manage every work stream & division involved in the integration. Producing Go's & Tell's to allow each of the stages on the integration to commence. \n \nSharePoint - Creation & Management of a SharePoint site used for the collation of testing results which would further then be used to create Executive Reports. \n \nExecutive Reporting - Production & creation of dashboards & reports which were delivered to the board on a regular basis. \n \nStakeholder Management - Developing relationships with stakeholders, involving numerous weekly meetings & one to one sessions. \n \nQuality Management - QA & checking documents to ensure a constant high level of reporting/documentation for Stakeholders & Executives. Project Assistant/Junior BA - (Lloyds TSB) Lloyds Banking Group June 2010  –  January 2012  (1 year 8 months) London, United Kingdom Working on Release C* Central Team - HBoS Migration within a number of work streams. \n \n*Release C is the largest and most complex stage of Integration between Lloyds & HBoS and affects every colleague & every customer. Release C is about preparing for & transferring all HBoS current & savings accounts & Commercial & UK Private Banking accounts onto the single Lloyds Banking Group IT platform. \n \nReadiness - Preparation & reporting whether the business is ready for the integration. As well as creating CRF's (Critcial Readiness Factors) \n \nPGV (PreGo Validation)(FOV) - An intense validation period in which the basic bank functions are tested to prove how successful the migration has been. The MI Reporting that is produced is presented to the Integration Board which directly affects whether the organisation is to proceed with the integration. \n \nBCO (Business Checkout) – A period which ensures all areas of the bank have been tested, highlighting issues that need fixing to allow the bank to function. \n \nIBP (Interim Business Processing) - When the integration is taking place many of the bank systems are unavailable. This work stream organises the white bagging of processes to be processed once systems become back in use.  \n \nGold Command & Control - The work stream that manage every work stream & division involved in the integration. Producing Go's & Tell's to allow each of the stages on the integration to commence. \n \nSharePoint - Creation & Management of a SharePoint site used for the collation of testing results which would further then be used to create Executive Reports. \n \nExecutive Reporting - Production & creation of dashboards & reports which were delivered to the board on a regular basis. \n \nStakeholder Management - Developing relationships with stakeholders, involving numerous weekly meetings & one to one sessions. \n \nQuality Management - QA & checking documents to ensure a constant high level of reporting/documentation for Stakeholders & Executives. Software Tester Lloyds TSB June 2008  –  September 2008  (4 months) Bristol, United Kingdom Work Experience \n \nWorking on W2, which is a project creating software to off shore, recruitment admin work, which also included creating a training manual for the completed software. Software Tester Lloyds TSB June 2008  –  September 2008  (4 months) Bristol, United Kingdom Work Experience \n \nWorking on W2, which is a project creating software to off shore, recruitment admin work, which also included creating a training manual for the completed software. Work Experience NFU Mutual October 2006  –  October 2006  (1 month) Stratford Whistle stop tour of the company, being introduced to Project Management, Under Writing, Accounting and Risk. Work Experience NFU Mutual October 2006  –  October 2006  (1 month) Stratford Whistle stop tour of the company, being introduced to Project Management, Under Writing, Accounting and Risk. Languages English English English Skills Skills     Honors & Awards ", "Experience Customer Business Analyst Intel Corporation October 2012  – Present (2 years 11 months) Swindon, United Kingdom Currently working as a customer business analyst in the META (Middle East, Turkey and Africa) region. Main task is to ensure that customers (distributors) have everything they need to achieve or overachieve their Intel targets. I do this via the following: \n \n-\tsetting and communicating targets and pricing strategies \n-\tstrategic demand forecasting \n-\tinventory management \n-\tproviding roadmap and product training. \n-\tunderstanding the mechanics of programs provided by Intel (bonus etc) to drive disti behaviour and maximise benefit \n-\tcommunicating and co-operating with regional sales team to ensure business needs are fulfilled in each sub region \n-\tconducting analysis at a customer and regional level to ensure goals are achieved \n-\tunderstanding customer needs and Intel's operations and strategies to influence supply decisions \n-\tdealing with conflicting information and managing a high-pressured environment \n-\torder management (SAP expert) - managing the customer supply line to ensure customers have the right products at the right time (placing, tracking orders & resolving issues)  \n-\tescalating and crisply communicating customer issues with clear recommendations on actions needed \n-\tcommunicating and representing customer strategies internally to senior managers and Intel strategies to external stakeholders Marketing and Business Development Exectutive University of Ulster and F3 Engineering Ltd (Knowledge Transfer Partnership) August 2010  –  July 2012  (2 years) United Kingdom My responsibilities included: \n \n•\tPlanning, implementing and evaluating the strategic marketing plan for the whole company \n•\tManaging all areas of the marketing mix including development and implementation of successful marketing campaigns \n•\tLiaising and networking with a range of stakeholders including customers, colleagues, suppliers and partner organisations and developing sustainable relationships \n•\tMaintaining high levels of client satisfaction and servicing, including setting up a 24/7 call service and after sales protocols  \n•\tCreating and maintaining the client information database to ensure recording and communication with all contacts \n•\tEfficient management of the company’s sales and marketing activities including the preparation of monthly sales and marketing reports for directors \n•\tDeveloping sales by contacting potential new customers through the production and follow up of mailshots, advertising campaigns and cold calling \n•\tManaging the design/production of: \n-\tMarketing literature (price lists, brochures, leaflets, DVD’s etc.)  \n-\tOn-going initiatives including email campaigns and press releases \n-\tContractual agreements (hire, lease, distributor etc.)  \n•\tManaging the development and updating of the company’s website and other social media (Facebook, YouTube, Twitter, LinkedIn, Blogging etc.) to assist with overall promotion of the company  \n•\tScanning tender websites weekly for opportunities and assisting with the production of tender proposals on an on-going basis \n•\tContinuously conducting extensive national and international market and competitor research/analysis \n•\tIdentifying, preparing and submitting funding applications and claims \n•\tEnsuring successful registration of product trademark standards and international trading standards and regulations are considered  \n•\tIdentifying, organising and attending trade shows, events, exhibitions and seminars European Staffing Sourcing Specialist Intel Corporation June 2008  –  May 2009  (1 year) This was an internship that I needed to complete in the third year of my degree and enabled me to obtain a Diploma in Industrial Studies. My responsibilities here \nincluded: \n \nMeeting hiring goals/objectives - I helped the Greater European Region team meet hiring goals and objectives in a timely manner by sourcing (finding) suitable candidates for various positions through cost efficient and effective channels and then conducting pre selection checklists on these candidates. \n \nHere I also worked closely with the Hiring Managers to find out their needs and the Staffing Consultants to ensure candidates where being scheduled for interviews. \n \nEngaging with stakeholders on a regular basis - such as Hiring Managers, Colleges and candidates in Hiring Process for example \n \nConducting data analysis - I regularly analysed data surrounding various aspects such as departments hiring figures and through my analysis I provided \nrecommendations on irregularities and how any negative results could be improved. \n \nCompleting administration work – I had to carefully navigate around Intel’s systems to ensure that their systems of record where up to date Customer Business Analyst Intel Corporation October 2012  – Present (2 years 11 months) Swindon, United Kingdom Currently working as a customer business analyst in the META (Middle East, Turkey and Africa) region. Main task is to ensure that customers (distributors) have everything they need to achieve or overachieve their Intel targets. I do this via the following: \n \n-\tsetting and communicating targets and pricing strategies \n-\tstrategic demand forecasting \n-\tinventory management \n-\tproviding roadmap and product training. \n-\tunderstanding the mechanics of programs provided by Intel (bonus etc) to drive disti behaviour and maximise benefit \n-\tcommunicating and co-operating with regional sales team to ensure business needs are fulfilled in each sub region \n-\tconducting analysis at a customer and regional level to ensure goals are achieved \n-\tunderstanding customer needs and Intel's operations and strategies to influence supply decisions \n-\tdealing with conflicting information and managing a high-pressured environment \n-\torder management (SAP expert) - managing the customer supply line to ensure customers have the right products at the right time (placing, tracking orders & resolving issues)  \n-\tescalating and crisply communicating customer issues with clear recommendations on actions needed \n-\tcommunicating and representing customer strategies internally to senior managers and Intel strategies to external stakeholders Customer Business Analyst Intel Corporation October 2012  – Present (2 years 11 months) Swindon, United Kingdom Currently working as a customer business analyst in the META (Middle East, Turkey and Africa) region. Main task is to ensure that customers (distributors) have everything they need to achieve or overachieve their Intel targets. I do this via the following: \n \n-\tsetting and communicating targets and pricing strategies \n-\tstrategic demand forecasting \n-\tinventory management \n-\tproviding roadmap and product training. \n-\tunderstanding the mechanics of programs provided by Intel (bonus etc) to drive disti behaviour and maximise benefit \n-\tcommunicating and co-operating with regional sales team to ensure business needs are fulfilled in each sub region \n-\tconducting analysis at a customer and regional level to ensure goals are achieved \n-\tunderstanding customer needs and Intel's operations and strategies to influence supply decisions \n-\tdealing with conflicting information and managing a high-pressured environment \n-\torder management (SAP expert) - managing the customer supply line to ensure customers have the right products at the right time (placing, tracking orders & resolving issues)  \n-\tescalating and crisply communicating customer issues with clear recommendations on actions needed \n-\tcommunicating and representing customer strategies internally to senior managers and Intel strategies to external stakeholders Marketing and Business Development Exectutive University of Ulster and F3 Engineering Ltd (Knowledge Transfer Partnership) August 2010  –  July 2012  (2 years) United Kingdom My responsibilities included: \n \n•\tPlanning, implementing and evaluating the strategic marketing plan for the whole company \n•\tManaging all areas of the marketing mix including development and implementation of successful marketing campaigns \n•\tLiaising and networking with a range of stakeholders including customers, colleagues, suppliers and partner organisations and developing sustainable relationships \n•\tMaintaining high levels of client satisfaction and servicing, including setting up a 24/7 call service and after sales protocols  \n•\tCreating and maintaining the client information database to ensure recording and communication with all contacts \n•\tEfficient management of the company’s sales and marketing activities including the preparation of monthly sales and marketing reports for directors \n•\tDeveloping sales by contacting potential new customers through the production and follow up of mailshots, advertising campaigns and cold calling \n•\tManaging the design/production of: \n-\tMarketing literature (price lists, brochures, leaflets, DVD’s etc.)  \n-\tOn-going initiatives including email campaigns and press releases \n-\tContractual agreements (hire, lease, distributor etc.)  \n•\tManaging the development and updating of the company’s website and other social media (Facebook, YouTube, Twitter, LinkedIn, Blogging etc.) to assist with overall promotion of the company  \n•\tScanning tender websites weekly for opportunities and assisting with the production of tender proposals on an on-going basis \n•\tContinuously conducting extensive national and international market and competitor research/analysis \n•\tIdentifying, preparing and submitting funding applications and claims \n•\tEnsuring successful registration of product trademark standards and international trading standards and regulations are considered  \n•\tIdentifying, organising and attending trade shows, events, exhibitions and seminars Marketing and Business Development Exectutive University of Ulster and F3 Engineering Ltd (Knowledge Transfer Partnership) August 2010  –  July 2012  (2 years) United Kingdom My responsibilities included: \n \n•\tPlanning, implementing and evaluating the strategic marketing plan for the whole company \n•\tManaging all areas of the marketing mix including development and implementation of successful marketing campaigns \n•\tLiaising and networking with a range of stakeholders including customers, colleagues, suppliers and partner organisations and developing sustainable relationships \n•\tMaintaining high levels of client satisfaction and servicing, including setting up a 24/7 call service and after sales protocols  \n•\tCreating and maintaining the client information database to ensure recording and communication with all contacts \n•\tEfficient management of the company’s sales and marketing activities including the preparation of monthly sales and marketing reports for directors \n•\tDeveloping sales by contacting potential new customers through the production and follow up of mailshots, advertising campaigns and cold calling \n•\tManaging the design/production of: \n-\tMarketing literature (price lists, brochures, leaflets, DVD’s etc.)  \n-\tOn-going initiatives including email campaigns and press releases \n-\tContractual agreements (hire, lease, distributor etc.)  \n•\tManaging the development and updating of the company’s website and other social media (Facebook, YouTube, Twitter, LinkedIn, Blogging etc.) to assist with overall promotion of the company  \n•\tScanning tender websites weekly for opportunities and assisting with the production of tender proposals on an on-going basis \n•\tContinuously conducting extensive national and international market and competitor research/analysis \n•\tIdentifying, preparing and submitting funding applications and claims \n•\tEnsuring successful registration of product trademark standards and international trading standards and regulations are considered  \n•\tIdentifying, organising and attending trade shows, events, exhibitions and seminars European Staffing Sourcing Specialist Intel Corporation June 2008  –  May 2009  (1 year) This was an internship that I needed to complete in the third year of my degree and enabled me to obtain a Diploma in Industrial Studies. My responsibilities here \nincluded: \n \nMeeting hiring goals/objectives - I helped the Greater European Region team meet hiring goals and objectives in a timely manner by sourcing (finding) suitable candidates for various positions through cost efficient and effective channels and then conducting pre selection checklists on these candidates. \n \nHere I also worked closely with the Hiring Managers to find out their needs and the Staffing Consultants to ensure candidates where being scheduled for interviews. \n \nEngaging with stakeholders on a regular basis - such as Hiring Managers, Colleges and candidates in Hiring Process for example \n \nConducting data analysis - I regularly analysed data surrounding various aspects such as departments hiring figures and through my analysis I provided \nrecommendations on irregularities and how any negative results could be improved. \n \nCompleting administration work – I had to carefully navigate around Intel’s systems to ensure that their systems of record where up to date European Staffing Sourcing Specialist Intel Corporation June 2008  –  May 2009  (1 year) This was an internship that I needed to complete in the third year of my degree and enabled me to obtain a Diploma in Industrial Studies. My responsibilities here \nincluded: \n \nMeeting hiring goals/objectives - I helped the Greater European Region team meet hiring goals and objectives in a timely manner by sourcing (finding) suitable candidates for various positions through cost efficient and effective channels and then conducting pre selection checklists on these candidates. \n \nHere I also worked closely with the Hiring Managers to find out their needs and the Staffing Consultants to ensure candidates where being scheduled for interviews. \n \nEngaging with stakeholders on a regular basis - such as Hiring Managers, Colleges and candidates in Hiring Process for example \n \nConducting data analysis - I regularly analysed data surrounding various aspects such as departments hiring figures and through my analysis I provided \nrecommendations on irregularities and how any negative results could be improved. \n \nCompleting administration work – I had to carefully navigate around Intel’s systems to ensure that their systems of record where up to date Skills Business Strategy Email Marketing Management Recruiting Sales Analysis Customer Service Project Planning Sourcing Strategy Marketing Strategy Skills  Business Strategy Email Marketing Management Recruiting Sales Analysis Customer Service Project Planning Sourcing Strategy Marketing Strategy Business Strategy Email Marketing Management Recruiting Sales Analysis Customer Service Project Planning Sourcing Strategy Marketing Strategy Business Strategy Email Marketing Management Recruiting Sales Analysis Customer Service Project Planning Sourcing Strategy Marketing Strategy Education University of Ulster Postgraduate Diploma,  Business Development and Innovation , 68 2011  – 2012 University of Ulster Bachelor of Science (B.Sc.),  Human Resource Management and Marketing , 73 2006  – 2010 University of Ulster Postgraduate Diploma,  Business Development and Innovation , 68 2011  – 2012 University of Ulster Postgraduate Diploma,  Business Development and Innovation , 68 2011  – 2012 University of Ulster Postgraduate Diploma,  Business Development and Innovation , 68 2011  – 2012 University of Ulster Bachelor of Science (B.Sc.),  Human Resource Management and Marketing , 73 2006  – 2010 University of Ulster Bachelor of Science (B.Sc.),  Human Resource Management and Marketing , 73 2006  – 2010 University of Ulster Bachelor of Science (B.Sc.),  Human Resource Management and Marketing , 73 2006  – 2010 ", "Experience Global Rebates Analyst Intel Corporation February 2014  – Present (1 year 7 months) • Forecast rebates for HP’s global enterprise business representing $1 billion in annual impact. \n• Evaluate complex payment structures to ensure that they are aligned with legal contracts.  \n• Lead rebate analyst for the entire group. Responsible for analyzing and reporting weekly, quarterly and yearly global rebate trends to high level decision makers to evaluate net revenue.  \n Global Customer Business Analyst Intel Corporation February 2013  –  February 2014  (1 year 1 month) • Forecast HP’s worldwide desktop monthly forecast representing $2 Billion in annual revenue.  \n• Managed all supply chain issues resulting in the max revenue while minimizing costs globally.  \n• Trained over 150 people throughout various organizations to increase business intelligence and drive process improvement through Microsoft Excel. \n Geographic Business Analyst Intel Corporation January 2012  –  January 2013  (1 year 1 month) • Primary contact for SSD channel consumption, inventory, segment growth and region trends.  \n• Managed monthly demand, supply escalations, transitions and comms to upper management. \n• Created a newsletter that provides the org with key business metrics and corporate goals. Customer Business Analyst Intel Corporation March 2011  –  December 2011  (10 months) • Supported seven strategic accounts throughout North and Latin America with revenues above $150M. \n• Collaborated with the field, planning groups and other key stakeholders to provide accurate demand. \n• Developed multiple reports and excel models that helped save time across the channel and beyond. Global Stock Analyst (Intern) Intel Corporation May 2010  –  August 2010  (4 months) • Synchronized global stock rules and created a composite excel model outlining findings. \n• Analyzed trends within global stock retirement behavior and presented solutions to managers. \n• Collaborated with management to develop stock plans that support global retirement objectives. Financial Analyst (Intern) Microsoft Corporation May 2009  –  August 2009  (4 months) • Created complex excel models to track and project growth outlook throughout global subsidiaries. \n• Implemented & developed business insight, financial planning and created rev reports for major clients. \n• Generated weekly business updates for the dept outlining growth opportunities and risk areas. Underwriting Analyst (Intern) Chartis May 2008  –  August 2008  (4 months) • Monitored and analyzed central internal systems for accuracy, dependability and efficiency.  \n• Analyzed broker commission’s, summarized findings and suggested new approaches to grow rev. \n• Partnered with the claims group to direct and market a device that saved the department over $20M. Operations Analyst (Intern) US Department of Health and Human Services May 2007  –  August 2007  (4 months) • Audited and examined federal credit card holder activity for unauthorized transactions.  \n• Created detailed reports outlining findings, trends, risk areas and recommendations to directors.  \n• Studied employee food service needs and provided telecommunication oversight. Global Rebates Analyst Intel Corporation February 2014  – Present (1 year 7 months) • Forecast rebates for HP’s global enterprise business representing $1 billion in annual impact. \n• Evaluate complex payment structures to ensure that they are aligned with legal contracts.  \n• Lead rebate analyst for the entire group. Responsible for analyzing and reporting weekly, quarterly and yearly global rebate trends to high level decision makers to evaluate net revenue.  \n Global Rebates Analyst Intel Corporation February 2014  – Present (1 year 7 months) • Forecast rebates for HP’s global enterprise business representing $1 billion in annual impact. \n• Evaluate complex payment structures to ensure that they are aligned with legal contracts.  \n• Lead rebate analyst for the entire group. Responsible for analyzing and reporting weekly, quarterly and yearly global rebate trends to high level decision makers to evaluate net revenue.  \n Global Customer Business Analyst Intel Corporation February 2013  –  February 2014  (1 year 1 month) • Forecast HP’s worldwide desktop monthly forecast representing $2 Billion in annual revenue.  \n• Managed all supply chain issues resulting in the max revenue while minimizing costs globally.  \n• Trained over 150 people throughout various organizations to increase business intelligence and drive process improvement through Microsoft Excel. \n Global Customer Business Analyst Intel Corporation February 2013  –  February 2014  (1 year 1 month) • Forecast HP’s worldwide desktop monthly forecast representing $2 Billion in annual revenue.  \n• Managed all supply chain issues resulting in the max revenue while minimizing costs globally.  \n• Trained over 150 people throughout various organizations to increase business intelligence and drive process improvement through Microsoft Excel. \n Geographic Business Analyst Intel Corporation January 2012  –  January 2013  (1 year 1 month) • Primary contact for SSD channel consumption, inventory, segment growth and region trends.  \n• Managed monthly demand, supply escalations, transitions and comms to upper management. \n• Created a newsletter that provides the org with key business metrics and corporate goals. Geographic Business Analyst Intel Corporation January 2012  –  January 2013  (1 year 1 month) • Primary contact for SSD channel consumption, inventory, segment growth and region trends.  \n• Managed monthly demand, supply escalations, transitions and comms to upper management. \n• Created a newsletter that provides the org with key business metrics and corporate goals. Customer Business Analyst Intel Corporation March 2011  –  December 2011  (10 months) • Supported seven strategic accounts throughout North and Latin America with revenues above $150M. \n• Collaborated with the field, planning groups and other key stakeholders to provide accurate demand. \n• Developed multiple reports and excel models that helped save time across the channel and beyond. Customer Business Analyst Intel Corporation March 2011  –  December 2011  (10 months) • Supported seven strategic accounts throughout North and Latin America with revenues above $150M. \n• Collaborated with the field, planning groups and other key stakeholders to provide accurate demand. \n• Developed multiple reports and excel models that helped save time across the channel and beyond. Global Stock Analyst (Intern) Intel Corporation May 2010  –  August 2010  (4 months) • Synchronized global stock rules and created a composite excel model outlining findings. \n• Analyzed trends within global stock retirement behavior and presented solutions to managers. \n• Collaborated with management to develop stock plans that support global retirement objectives. Global Stock Analyst (Intern) Intel Corporation May 2010  –  August 2010  (4 months) • Synchronized global stock rules and created a composite excel model outlining findings. \n• Analyzed trends within global stock retirement behavior and presented solutions to managers. \n• Collaborated with management to develop stock plans that support global retirement objectives. Financial Analyst (Intern) Microsoft Corporation May 2009  –  August 2009  (4 months) • Created complex excel models to track and project growth outlook throughout global subsidiaries. \n• Implemented & developed business insight, financial planning and created rev reports for major clients. \n• Generated weekly business updates for the dept outlining growth opportunities and risk areas. Financial Analyst (Intern) Microsoft Corporation May 2009  –  August 2009  (4 months) • Created complex excel models to track and project growth outlook throughout global subsidiaries. \n• Implemented & developed business insight, financial planning and created rev reports for major clients. \n• Generated weekly business updates for the dept outlining growth opportunities and risk areas. Underwriting Analyst (Intern) Chartis May 2008  –  August 2008  (4 months) • Monitored and analyzed central internal systems for accuracy, dependability and efficiency.  \n• Analyzed broker commission’s, summarized findings and suggested new approaches to grow rev. \n• Partnered with the claims group to direct and market a device that saved the department over $20M. Underwriting Analyst (Intern) Chartis May 2008  –  August 2008  (4 months) • Monitored and analyzed central internal systems for accuracy, dependability and efficiency.  \n• Analyzed broker commission’s, summarized findings and suggested new approaches to grow rev. \n• Partnered with the claims group to direct and market a device that saved the department over $20M. Operations Analyst (Intern) US Department of Health and Human Services May 2007  –  August 2007  (4 months) • Audited and examined federal credit card holder activity for unauthorized transactions.  \n• Created detailed reports outlining findings, trends, risk areas and recommendations to directors.  \n• Studied employee food service needs and provided telecommunication oversight. Operations Analyst (Intern) US Department of Health and Human Services May 2007  –  August 2007  (4 months) • Audited and examined federal credit card holder activity for unauthorized transactions.  \n• Created detailed reports outlining findings, trends, risk areas and recommendations to directors.  \n• Studied employee food service needs and provided telecommunication oversight. Languages English Native or bilingual proficiency Spanish Native or bilingual proficiency Korean Elementary proficiency English Native or bilingual proficiency Spanish Native or bilingual proficiency Korean Elementary proficiency English Native or bilingual proficiency Spanish Native or bilingual proficiency Korean Elementary proficiency Native or bilingual proficiency Native or bilingual proficiency Elementary proficiency Skills Data Analysis Strategy Market Research Management Analysis Avanced Microsoft Excel Excel Macros Data Manipulation MS Excel Pivot Tables Excel Dashboards Project Planning Supply Chain Negotiation Team Leadership Microsoft Excel Skills  Data Analysis Strategy Market Research Management Analysis Avanced Microsoft Excel Excel Macros Data Manipulation MS Excel Pivot Tables Excel Dashboards Project Planning Supply Chain Negotiation Team Leadership Microsoft Excel Data Analysis Strategy Market Research Management Analysis Avanced Microsoft Excel Excel Macros Data Manipulation MS Excel Pivot Tables Excel Dashboards Project Planning Supply Chain Negotiation Team Leadership Microsoft Excel Data Analysis Strategy Market Research Management Analysis Avanced Microsoft Excel Excel Macros Data Manipulation MS Excel Pivot Tables Excel Dashboards Project Planning Supply Chain Negotiation Team Leadership Microsoft Excel Education Sacramento State University Master of Business Administration (MBA),  Finance 2013  – 2015 California State University San Marcos Bachelor of Science,  Finance 2005  – 2010 Soonchunhyang University Finance 2007  – 2008 • Awarded full study abroad tuition, paid travel expenses and weekly stipend for outstanding applicants in South Korea. Lockheed Martin Stars Institute Certificate Program in Leadership 2007  – 2007 • Connected with Senior Engineers to develop time management, interpersonal, negotiation and leadership skills in Washington, D.C. Sacramento State University Master of Business Administration (MBA),  Finance 2013  – 2015 Sacramento State University Master of Business Administration (MBA),  Finance 2013  – 2015 Sacramento State University Master of Business Administration (MBA),  Finance 2013  – 2015 California State University San Marcos Bachelor of Science,  Finance 2005  – 2010 California State University San Marcos Bachelor of Science,  Finance 2005  – 2010 California State University San Marcos Bachelor of Science,  Finance 2005  – 2010 Soonchunhyang University Finance 2007  – 2008 • Awarded full study abroad tuition, paid travel expenses and weekly stipend for outstanding applicants in South Korea. Soonchunhyang University Finance 2007  – 2008 • Awarded full study abroad tuition, paid travel expenses and weekly stipend for outstanding applicants in South Korea. Soonchunhyang University Finance 2007  – 2008 • Awarded full study abroad tuition, paid travel expenses and weekly stipend for outstanding applicants in South Korea. Lockheed Martin Stars Institute Certificate Program in Leadership 2007  – 2007 • Connected with Senior Engineers to develop time management, interpersonal, negotiation and leadership skills in Washington, D.C. Lockheed Martin Stars Institute Certificate Program in Leadership 2007  – 2007 • Connected with Senior Engineers to develop time management, interpersonal, negotiation and leadership skills in Washington, D.C. Lockheed Martin Stars Institute Certificate Program in Leadership 2007  – 2007 • Connected with Senior Engineers to develop time management, interpersonal, negotiation and leadership skills in Washington, D.C. ", "Experience Customer Business Analyst Intel Corporation December 2014  – Present (9 months) Swindon, United Kingdom Internal Sales Executive Microsoft September 2014  –  December 2014  (4 months) Reading, United Kingdom I work with enterprise accounts on their IT strategy and find a suitable solution to fit their business needs. I can give my customers access to a virtual team of subject matter experts to ensure they understand the opportunities available within solutions to enable them to develop their business and meet their IT strategy. My focus is on customer relationship and satisfaction to ensure that my customers have the best experience with Microsoft. Sales Analyst Intel Corporation July 2012  –  August 2013  (1 year 2 months) Swindon In this role I was focused on one of Intel's key customers and supported them in their projects such as their formula 1 co-sponsorship, where the objective was to increase ROI through seeking new opportunities with utilisation of the team’s factory. \nI also monitored the customer performance in a variety of environments and created a target tracking process, which compared their position to previous years and the market to allow the customer to assess their current positioning within markets. Client Director Tech Sales Recruitment Ltd July 2010  –  June 2012  (2 years) Executive search, selection and recruitment specialists in the IT and Telco industry, dedicated boutique working with established clients in fulfilling their leadership, senior sales and marketing personnel requirements, both now and in the future. Sales Advisor Orange 2009  –  2010  (1 year) Estate Agent Waterfords Estate Agents 2008  –  2009  (1 year) Customer Business Analyst Intel Corporation December 2014  – Present (9 months) Swindon, United Kingdom Customer Business Analyst Intel Corporation December 2014  – Present (9 months) Swindon, United Kingdom Internal Sales Executive Microsoft September 2014  –  December 2014  (4 months) Reading, United Kingdom I work with enterprise accounts on their IT strategy and find a suitable solution to fit their business needs. I can give my customers access to a virtual team of subject matter experts to ensure they understand the opportunities available within solutions to enable them to develop their business and meet their IT strategy. My focus is on customer relationship and satisfaction to ensure that my customers have the best experience with Microsoft. Internal Sales Executive Microsoft September 2014  –  December 2014  (4 months) Reading, United Kingdom I work with enterprise accounts on their IT strategy and find a suitable solution to fit their business needs. I can give my customers access to a virtual team of subject matter experts to ensure they understand the opportunities available within solutions to enable them to develop their business and meet their IT strategy. My focus is on customer relationship and satisfaction to ensure that my customers have the best experience with Microsoft. Sales Analyst Intel Corporation July 2012  –  August 2013  (1 year 2 months) Swindon In this role I was focused on one of Intel's key customers and supported them in their projects such as their formula 1 co-sponsorship, where the objective was to increase ROI through seeking new opportunities with utilisation of the team’s factory. \nI also monitored the customer performance in a variety of environments and created a target tracking process, which compared their position to previous years and the market to allow the customer to assess their current positioning within markets. Sales Analyst Intel Corporation July 2012  –  August 2013  (1 year 2 months) Swindon In this role I was focused on one of Intel's key customers and supported them in their projects such as their formula 1 co-sponsorship, where the objective was to increase ROI through seeking new opportunities with utilisation of the team’s factory. \nI also monitored the customer performance in a variety of environments and created a target tracking process, which compared their position to previous years and the market to allow the customer to assess their current positioning within markets. Client Director Tech Sales Recruitment Ltd July 2010  –  June 2012  (2 years) Executive search, selection and recruitment specialists in the IT and Telco industry, dedicated boutique working with established clients in fulfilling their leadership, senior sales and marketing personnel requirements, both now and in the future. Client Director Tech Sales Recruitment Ltd July 2010  –  June 2012  (2 years) Executive search, selection and recruitment specialists in the IT and Telco industry, dedicated boutique working with established clients in fulfilling their leadership, senior sales and marketing personnel requirements, both now and in the future. Sales Advisor Orange 2009  –  2010  (1 year) Sales Advisor Orange 2009  –  2010  (1 year) Estate Agent Waterfords Estate Agents 2008  –  2009  (1 year) Estate Agent Waterfords Estate Agents 2008  –  2009  (1 year) Skills Recruiting Executive Search Human Resources Leadership Direct Sales Sales Process Business Development Lead Generation Sales CRM Microsoft Excel Strategy Management Sales Operations Skills  Recruiting Executive Search Human Resources Leadership Direct Sales Sales Process Business Development Lead Generation Sales CRM Microsoft Excel Strategy Management Sales Operations Recruiting Executive Search Human Resources Leadership Direct Sales Sales Process Business Development Lead Generation Sales CRM Microsoft Excel Strategy Management Sales Operations Recruiting Executive Search Human Resources Leadership Direct Sales Sales Process Business Development Lead Generation Sales CRM Microsoft Excel Strategy Management Sales Operations Education Bournemouth University Bachelor's Degree,  International Business Management , 1st 2010  – 2014 Activities and Societies:  Student Development Award for involvement in volunteering with the students union. Lord Wandsworth College 2005  – 2008 Bournemouth University Bachelor's Degree,  International Business Management , 1st 2010  – 2014 Activities and Societies:  Student Development Award for involvement in volunteering with the students union. Bournemouth University Bachelor's Degree,  International Business Management , 1st 2010  – 2014 Activities and Societies:  Student Development Award for involvement in volunteering with the students union. Bournemouth University Bachelor's Degree,  International Business Management , 1st 2010  – 2014 Activities and Societies:  Student Development Award for involvement in volunteering with the students union. Lord Wandsworth College 2005  – 2008 Lord Wandsworth College 2005  – 2008 Lord Wandsworth College 2005  – 2008 ", "Experience Customer Business Analyst Intel Corporation November 2014  – Present (10 months) Swindon, United Kingdom Embedded Customer Business Analyst and Energy & Industrial lead Collections Specialist Intel Corporation August 2013  –  October 2014  (1 year 3 months) Swindon, United Kingdom Managing collections for Embedded customers Administrative Assistant HIGH FASHION UK LTD August 2012  –  September 2012  (2 months) Market Harborough Temporary admin assistant, customer service for Kingsland Equestrian UK & KEP Italia Financial Analyst Intel Corporation July 2011  –  August 2012  (1 year 2 months) Swindon, United Kingdom Internship in Revenue Finance IT Assistant Guttridge Ltd November 2009  –  September 2010  (11 months) Spalding, Lincolnshire Website design, IT assistance, admin & customer service Customer Business Analyst Intel Corporation November 2014  – Present (10 months) Swindon, United Kingdom Embedded Customer Business Analyst and Energy & Industrial lead Customer Business Analyst Intel Corporation November 2014  – Present (10 months) Swindon, United Kingdom Embedded Customer Business Analyst and Energy & Industrial lead Collections Specialist Intel Corporation August 2013  –  October 2014  (1 year 3 months) Swindon, United Kingdom Managing collections for Embedded customers Collections Specialist Intel Corporation August 2013  –  October 2014  (1 year 3 months) Swindon, United Kingdom Managing collections for Embedded customers Administrative Assistant HIGH FASHION UK LTD August 2012  –  September 2012  (2 months) Market Harborough Temporary admin assistant, customer service for Kingsland Equestrian UK & KEP Italia Administrative Assistant HIGH FASHION UK LTD August 2012  –  September 2012  (2 months) Market Harborough Temporary admin assistant, customer service for Kingsland Equestrian UK & KEP Italia Financial Analyst Intel Corporation July 2011  –  August 2012  (1 year 2 months) Swindon, United Kingdom Internship in Revenue Finance Financial Analyst Intel Corporation July 2011  –  August 2012  (1 year 2 months) Swindon, United Kingdom Internship in Revenue Finance IT Assistant Guttridge Ltd November 2009  –  September 2010  (11 months) Spalding, Lincolnshire Website design, IT assistance, admin & customer service IT Assistant Guttridge Ltd November 2009  –  September 2010  (11 months) Spalding, Lincolnshire Website design, IT assistance, admin & customer service Skills Microsoft Office Customer Service Excel Minitab Customer Relations Microsoft Excel Business Analysis Finance Data Analysis SAP Training Leadership Time Management Skills  Microsoft Office Customer Service Excel Minitab Customer Relations Microsoft Excel Business Analysis Finance Data Analysis SAP Training Leadership Time Management Microsoft Office Customer Service Excel Minitab Customer Relations Microsoft Excel Business Analysis Finance Data Analysis SAP Training Leadership Time Management Microsoft Office Customer Service Excel Minitab Customer Relations Microsoft Excel Business Analysis Finance Data Analysis SAP Training Leadership Time Management Education The Nottingham Trent University BA(Hons),  Management Studies , 2:1 2010  – 2013 Spalding Grammar School A Levels 2007  – 2009 Spalding High School 2002  – 2007 The Nottingham Trent University BA(Hons),  Management Studies , 2:1 2010  – 2013 The Nottingham Trent University BA(Hons),  Management Studies , 2:1 2010  – 2013 The Nottingham Trent University BA(Hons),  Management Studies , 2:1 2010  – 2013 Spalding Grammar School A Levels 2007  – 2009 Spalding Grammar School A Levels 2007  – 2009 Spalding Grammar School A Levels 2007  – 2009 Spalding High School 2002  – 2007 Spalding High School 2002  – 2007 Spalding High School 2002  – 2007 ", "Summary Business Analyst with experioence of delivering results with a focus on supply chain optimization. Top professional traits: Customer-focused, relationship-builder, analytical, decisive, technical, articulate, and personable. \n \nSpecialties: Multilingual (English, Punjabi, and Hindi), Proficient in Microsoft Office Suite, Typing 40 WPM, Customer Service, Good Public Speaker, Skilled Writer, and a Quick Learner Summary Business Analyst with experioence of delivering results with a focus on supply chain optimization. Top professional traits: Customer-focused, relationship-builder, analytical, decisive, technical, articulate, and personable. \n \nSpecialties: Multilingual (English, Punjabi, and Hindi), Proficient in Microsoft Office Suite, Typing 40 WPM, Customer Service, Good Public Speaker, Skilled Writer, and a Quick Learner Business Analyst with experioence of delivering results with a focus on supply chain optimization. Top professional traits: Customer-focused, relationship-builder, analytical, decisive, technical, articulate, and personable. \n \nSpecialties: Multilingual (English, Punjabi, and Hindi), Proficient in Microsoft Office Suite, Typing 40 WPM, Customer Service, Good Public Speaker, Skilled Writer, and a Quick Learner Business Analyst with experioence of delivering results with a focus on supply chain optimization. Top professional traits: Customer-focused, relationship-builder, analytical, decisive, technical, articulate, and personable. \n \nSpecialties: Multilingual (English, Punjabi, and Hindi), Proficient in Microsoft Office Suite, Typing 40 WPM, Customer Service, Good Public Speaker, Skilled Writer, and a Quick Learner Experience Customer Business Analyst Intel Corporation April 2012  – Present (3 years 5 months) Folsom, CA Under the America's Sales and Marketing Organization (ASMO) Operations as a Customer Business Analyst (CBA) acting as the communication conduit between the Customer, Sales and the Factory facing teams to optimize revenue and achieve mutual objectives. Responsible for forecasting demand, gathering and analyzing information to determine product allocation and managing the business to maximize revenue through supply commitments and supply chain program support. Manages the customer's demands and the company's supply. Co-Owner Dhillon's Folsom Road Shell January 2010  –  December 2013  (4 years) Created customer invoices \nReceived/stocked incoming merchandise \nOperated and kept a balanced cash register Transfer Agent Associate Franklin Templeton Investments May 2011  –  April 2012  (1 year) Provide assistance to customers with account maintenance and overall customer service to ensure the greatest satisfaction. Teller JP Morgan Chase September 2010  –  May 2011  (9 months) Worked as a Teller providing excellent customer service and help expand customer relations with the company. Also helped the branch keep an active inventory. Customer Service Specialist Best Buy October 2009  –  January 2010  (4 months) Utilized customer service skills to increase sales and customer satisfaction. Volunteer Viren R Patel DDS May 2009  –  August 2009  (4 months) Participated in basic procedures and assisted dentist in oral surgery. \nPrepared whitening trays for customers to take home. Research Student University of the Pacific January 2008  –  May 2009  (1 year 5 months) Investigated cells of b. Elegans plant from prepared root tips to create slide and analyze the chromosomal content of each cell. Volunteer Smiles Dental Studio May 2007  –  August 2007  (4 months) Oversaw the daily tasks of a private dental office, \nFamiliarized basic procedures such as a root canal, crowning, teeth cleaning, and implant surgery. Volunteer Center for Family & Cosmetic Dentistry May 2007  –  August 2007  (4 months) Shadowed three dentists and multiple hygienists in a fast paced work environment.  \nLearned how to provide ideal customer care in an office with high patient inflow.  \nViewed the business aspect of the office and observed what it takes to run an office. Home Tutor Club Z Tutoring November 2006  –  August 2007  (10 months) Visited secondary and high school student's homes ages 13-18 and tutored them with various subjects including from history, math, and biology. \nEducated younger students and reinforced good study habits. \nCollaborated with parents and provided weekly evaluations on student's improvements. Customer Service Specialist Best Buy May 2006  –  October 2006  (6 months) Utilized communication skills to increase sales and ensure customer satisfaction. Volunteer UC Davis Medical Center February 2005  –  May 2005  (4 months) Assisted nurses with various tasks including stocking rooms, preparing meals, and taking blood to/from bank. \nProvided companionship to patients and aided them in completing daily activities. Customer Business Analyst Intel Corporation April 2012  – Present (3 years 5 months) Folsom, CA Under the America's Sales and Marketing Organization (ASMO) Operations as a Customer Business Analyst (CBA) acting as the communication conduit between the Customer, Sales and the Factory facing teams to optimize revenue and achieve mutual objectives. Responsible for forecasting demand, gathering and analyzing information to determine product allocation and managing the business to maximize revenue through supply commitments and supply chain program support. Manages the customer's demands and the company's supply. Customer Business Analyst Intel Corporation April 2012  – Present (3 years 5 months) Folsom, CA Under the America's Sales and Marketing Organization (ASMO) Operations as a Customer Business Analyst (CBA) acting as the communication conduit between the Customer, Sales and the Factory facing teams to optimize revenue and achieve mutual objectives. Responsible for forecasting demand, gathering and analyzing information to determine product allocation and managing the business to maximize revenue through supply commitments and supply chain program support. Manages the customer's demands and the company's supply. Co-Owner Dhillon's Folsom Road Shell January 2010  –  December 2013  (4 years) Created customer invoices \nReceived/stocked incoming merchandise \nOperated and kept a balanced cash register Co-Owner Dhillon's Folsom Road Shell January 2010  –  December 2013  (4 years) Created customer invoices \nReceived/stocked incoming merchandise \nOperated and kept a balanced cash register Transfer Agent Associate Franklin Templeton Investments May 2011  –  April 2012  (1 year) Provide assistance to customers with account maintenance and overall customer service to ensure the greatest satisfaction. Transfer Agent Associate Franklin Templeton Investments May 2011  –  April 2012  (1 year) Provide assistance to customers with account maintenance and overall customer service to ensure the greatest satisfaction. Teller JP Morgan Chase September 2010  –  May 2011  (9 months) Worked as a Teller providing excellent customer service and help expand customer relations with the company. Also helped the branch keep an active inventory. Teller JP Morgan Chase September 2010  –  May 2011  (9 months) Worked as a Teller providing excellent customer service and help expand customer relations with the company. Also helped the branch keep an active inventory. Customer Service Specialist Best Buy October 2009  –  January 2010  (4 months) Utilized customer service skills to increase sales and customer satisfaction. Customer Service Specialist Best Buy October 2009  –  January 2010  (4 months) Utilized customer service skills to increase sales and customer satisfaction. Volunteer Viren R Patel DDS May 2009  –  August 2009  (4 months) Participated in basic procedures and assisted dentist in oral surgery. \nPrepared whitening trays for customers to take home. Volunteer Viren R Patel DDS May 2009  –  August 2009  (4 months) Participated in basic procedures and assisted dentist in oral surgery. \nPrepared whitening trays for customers to take home. Research Student University of the Pacific January 2008  –  May 2009  (1 year 5 months) Investigated cells of b. Elegans plant from prepared root tips to create slide and analyze the chromosomal content of each cell. Research Student University of the Pacific January 2008  –  May 2009  (1 year 5 months) Investigated cells of b. Elegans plant from prepared root tips to create slide and analyze the chromosomal content of each cell. Volunteer Smiles Dental Studio May 2007  –  August 2007  (4 months) Oversaw the daily tasks of a private dental office, \nFamiliarized basic procedures such as a root canal, crowning, teeth cleaning, and implant surgery. Volunteer Smiles Dental Studio May 2007  –  August 2007  (4 months) Oversaw the daily tasks of a private dental office, \nFamiliarized basic procedures such as a root canal, crowning, teeth cleaning, and implant surgery. Volunteer Center for Family & Cosmetic Dentistry May 2007  –  August 2007  (4 months) Shadowed three dentists and multiple hygienists in a fast paced work environment.  \nLearned how to provide ideal customer care in an office with high patient inflow.  \nViewed the business aspect of the office and observed what it takes to run an office. Volunteer Center for Family & Cosmetic Dentistry May 2007  –  August 2007  (4 months) Shadowed three dentists and multiple hygienists in a fast paced work environment.  \nLearned how to provide ideal customer care in an office with high patient inflow.  \nViewed the business aspect of the office and observed what it takes to run an office. Home Tutor Club Z Tutoring November 2006  –  August 2007  (10 months) Visited secondary and high school student's homes ages 13-18 and tutored them with various subjects including from history, math, and biology. \nEducated younger students and reinforced good study habits. \nCollaborated with parents and provided weekly evaluations on student's improvements. Home Tutor Club Z Tutoring November 2006  –  August 2007  (10 months) Visited secondary and high school student's homes ages 13-18 and tutored them with various subjects including from history, math, and biology. \nEducated younger students and reinforced good study habits. \nCollaborated with parents and provided weekly evaluations on student's improvements. Customer Service Specialist Best Buy May 2006  –  October 2006  (6 months) Utilized communication skills to increase sales and ensure customer satisfaction. Customer Service Specialist Best Buy May 2006  –  October 2006  (6 months) Utilized communication skills to increase sales and ensure customer satisfaction. Volunteer UC Davis Medical Center February 2005  –  May 2005  (4 months) Assisted nurses with various tasks including stocking rooms, preparing meals, and taking blood to/from bank. \nProvided companionship to patients and aided them in completing daily activities. Volunteer UC Davis Medical Center February 2005  –  May 2005  (4 months) Assisted nurses with various tasks including stocking rooms, preparing meals, and taking blood to/from bank. \nProvided companionship to patients and aided them in completing daily activities. Languages English Native or bilingual proficiency Punjabi Professional working proficiency English Native or bilingual proficiency Punjabi Professional working proficiency English Native or bilingual proficiency Punjabi Professional working proficiency Native or bilingual proficiency Professional working proficiency Skills Data Analysis Microsoft Office Public Speaking Punjabi Hindi Customer Service Microsoft Excel Process Improvement Analysis Customer Satisfaction Business Analysis Outlook Forecasting Account Management SAP SharePoint Leadership Management Microsoft Word PowerPoint Cross-functional Team... See 6+     See less Skills  Data Analysis Microsoft Office Public Speaking Punjabi Hindi Customer Service Microsoft Excel Process Improvement Analysis Customer Satisfaction Business Analysis Outlook Forecasting Account Management SAP SharePoint Leadership Management Microsoft Word PowerPoint Cross-functional Team... See 6+     See less Data Analysis Microsoft Office Public Speaking Punjabi Hindi Customer Service Microsoft Excel Process Improvement Analysis Customer Satisfaction Business Analysis Outlook Forecasting Account Management SAP SharePoint Leadership Management Microsoft Word PowerPoint Cross-functional Team... See 6+     See less Data Analysis Microsoft Office Public Speaking Punjabi Hindi Customer Service Microsoft Excel Process Improvement Analysis Customer Satisfaction Business Analysis Outlook Forecasting Account Management SAP SharePoint Leadership Management Microsoft Word PowerPoint Cross-functional Team... See 6+     See less Education University of California, Davis Master of Business Administration (MBA) 2012  – 2015 California State University-Sacramento Bachelors,  Business Administration: Finance 2009  – 2011 University of the Pacific Bachelors,  Biology 2005  – 2009 Activities and Societies:  Beta Beta Beta Chapter President ,  SASA member University of California, Davis Master of Business Administration (MBA) 2012  – 2015 University of California, Davis Master of Business Administration (MBA) 2012  – 2015 University of California, Davis Master of Business Administration (MBA) 2012  – 2015 California State University-Sacramento Bachelors,  Business Administration: Finance 2009  – 2011 California State University-Sacramento Bachelors,  Business Administration: Finance 2009  – 2011 California State University-Sacramento Bachelors,  Business Administration: Finance 2009  – 2011 University of the Pacific Bachelors,  Biology 2005  – 2009 Activities and Societies:  Beta Beta Beta Chapter President ,  SASA member University of the Pacific Bachelors,  Biology 2005  – 2009 Activities and Societies:  Beta Beta Beta Chapter President ,  SASA member University of the Pacific Bachelors,  Biology 2005  – 2009 Activities and Societies:  Beta Beta Beta Chapter President ,  SASA member ", "Experience Customer Business Analyst Intel Corporation September 2014  – Present (1 year) Swindon, United Kingdom Financial Analyst Intel Corporation July 2010  – Present (5 years 2 months) Talent Advisor Intel Corporation April 2012  –  December 2012  (9 months) Accounts Payable Mature Markets Team Lead Intel Corporation July 2008  –  June 2010  (2 years) Customer Support Team Lead Teleperformance November 2002  –  July 2008  (5 years 9 months) Swindon, United Kingdom Customer Business Analyst Intel Corporation September 2014  – Present (1 year) Swindon, United Kingdom Customer Business Analyst Intel Corporation September 2014  – Present (1 year) Swindon, United Kingdom Financial Analyst Intel Corporation July 2010  – Present (5 years 2 months) Financial Analyst Intel Corporation July 2010  – Present (5 years 2 months) Talent Advisor Intel Corporation April 2012  –  December 2012  (9 months) Talent Advisor Intel Corporation April 2012  –  December 2012  (9 months) Accounts Payable Mature Markets Team Lead Intel Corporation July 2008  –  June 2010  (2 years) Accounts Payable Mature Markets Team Lead Intel Corporation July 2008  –  June 2010  (2 years) Customer Support Team Lead Teleperformance November 2002  –  July 2008  (5 years 9 months) Swindon, United Kingdom Customer Support Team Lead Teleperformance November 2002  –  July 2008  (5 years 9 months) Swindon, United Kingdom Languages English French German English French German English French German Skills Process Improvement SAP Analysis Cross-functional Team... Business Analysis Data Analysis Project Management Program Management Management Team Leadership Business Intelligence Visio PeopleSoft Business Process... ERP Communication Customer Service See 2+     See less Skills  Process Improvement SAP Analysis Cross-functional Team... Business Analysis Data Analysis Project Management Program Management Management Team Leadership Business Intelligence Visio PeopleSoft Business Process... ERP Communication Customer Service See 2+     See less Process Improvement SAP Analysis Cross-functional Team... Business Analysis Data Analysis Project Management Program Management Management Team Leadership Business Intelligence Visio PeopleSoft Business Process... ERP Communication Customer Service See 2+     See less Process Improvement SAP Analysis Cross-functional Team... Business Analysis Data Analysis Project Management Program Management Management Team Leadership Business Intelligence Visio PeopleSoft Business Process... ERP Communication Customer Service See 2+     See less Education University of the West of England BA (Hons),  Modern Languages and European Studies 1998  – 2002 University of the West of England BA (Hons),  Modern Languages and European Studies 1998  – 2002 University of the West of England BA (Hons),  Modern Languages and European Studies 1998  – 2002 University of the West of England BA (Hons),  Modern Languages and European Studies 1998  – 2002 ", "Experience Supply Demand Analyst Intel Corporation September 2010  –  March 2015  (4 years 7 months) Customer Business Analyst Intel Corporation June 2008  –  September 2010  (2 years 4 months) Logistics Cost & Quality Analyst Intel International BV (The Netherlands) August 2007  –  June 2008  (11 months) I relocated to the Intel Amsterdam site for 11 months. Responsibilities included monitoring and reporting out on the local spends associated to the transportation of outbound freight. I was also responsible for identifying cost-savings, which required detailed analysis of supplier contracts and invoicing data.  \nThe quality analyst part of my role involved working closely with our transportation supplier on quality issues reported by our customers. This ultimately involved a strong understanding of the supply chain in order to implement effective process changes. Customer Business Analyst Intel Corporation February 2005  –  July 2007  (2 years 6 months) Customer Support Operations Analyst Intel Corporation July 2002  –  August 2003  (1 year 2 months) This was a 13 month placement a part of my BA Degree.This predominantly involved development, maintenance and presentation of the performance indicators for two internal management teams. Sales Person Southwestern Company June 2001  –  September 2001  (4 months) This was a 4 month summer placement. I was allocated a sales area within Lakewood, Colorado selling educational books door to door on 100% commission. This involved making sales presentations, closing sales as well as finance, inventory and distribution management. Supply Demand Analyst Intel Corporation September 2010  –  March 2015  (4 years 7 months) Supply Demand Analyst Intel Corporation September 2010  –  March 2015  (4 years 7 months) Customer Business Analyst Intel Corporation June 2008  –  September 2010  (2 years 4 months) Customer Business Analyst Intel Corporation June 2008  –  September 2010  (2 years 4 months) Logistics Cost & Quality Analyst Intel International BV (The Netherlands) August 2007  –  June 2008  (11 months) I relocated to the Intel Amsterdam site for 11 months. Responsibilities included monitoring and reporting out on the local spends associated to the transportation of outbound freight. I was also responsible for identifying cost-savings, which required detailed analysis of supplier contracts and invoicing data.  \nThe quality analyst part of my role involved working closely with our transportation supplier on quality issues reported by our customers. This ultimately involved a strong understanding of the supply chain in order to implement effective process changes. Logistics Cost & Quality Analyst Intel International BV (The Netherlands) August 2007  –  June 2008  (11 months) I relocated to the Intel Amsterdam site for 11 months. Responsibilities included monitoring and reporting out on the local spends associated to the transportation of outbound freight. I was also responsible for identifying cost-savings, which required detailed analysis of supplier contracts and invoicing data.  \nThe quality analyst part of my role involved working closely with our transportation supplier on quality issues reported by our customers. This ultimately involved a strong understanding of the supply chain in order to implement effective process changes. Customer Business Analyst Intel Corporation February 2005  –  July 2007  (2 years 6 months) Customer Business Analyst Intel Corporation February 2005  –  July 2007  (2 years 6 months) Customer Support Operations Analyst Intel Corporation July 2002  –  August 2003  (1 year 2 months) This was a 13 month placement a part of my BA Degree.This predominantly involved development, maintenance and presentation of the performance indicators for two internal management teams. Customer Support Operations Analyst Intel Corporation July 2002  –  August 2003  (1 year 2 months) This was a 13 month placement a part of my BA Degree.This predominantly involved development, maintenance and presentation of the performance indicators for two internal management teams. Sales Person Southwestern Company June 2001  –  September 2001  (4 months) This was a 4 month summer placement. I was allocated a sales area within Lakewood, Colorado selling educational books door to door on 100% commission. This involved making sales presentations, closing sales as well as finance, inventory and distribution management. Sales Person Southwestern Company June 2001  –  September 2001  (4 months) This was a 4 month summer placement. I was allocated a sales area within Lakewood, Colorado selling educational books door to door on 100% commission. This involved making sales presentations, closing sales as well as finance, inventory and distribution management. Languages English English English Skills Logistics Supply Chain Intel Analysis Skills  Logistics Supply Chain Intel Analysis Logistics Supply Chain Intel Analysis Logistics Supply Chain Intel Analysis Education University of the West of England BA (Hons) First Class,  Business Studies 2000  – 2004 This was a sandwich course involving a 13 month placement at Intel Corporation (UK) July 2002 - Aug 2003. Hereford Sixth Form College A Levels 1998  – 2000 Business Studies (grade A), Design (grade A) and Psychology (grade B). Kingstone High School GCSEs 1993  – 1998 10 GCSEs Grades A-C including English, Maths and Science. University of the West of England BA (Hons) First Class,  Business Studies 2000  – 2004 This was a sandwich course involving a 13 month placement at Intel Corporation (UK) July 2002 - Aug 2003. University of the West of England BA (Hons) First Class,  Business Studies 2000  – 2004 This was a sandwich course involving a 13 month placement at Intel Corporation (UK) July 2002 - Aug 2003. University of the West of England BA (Hons) First Class,  Business Studies 2000  – 2004 This was a sandwich course involving a 13 month placement at Intel Corporation (UK) July 2002 - Aug 2003. Hereford Sixth Form College A Levels 1998  – 2000 Business Studies (grade A), Design (grade A) and Psychology (grade B). Hereford Sixth Form College A Levels 1998  – 2000 Business Studies (grade A), Design (grade A) and Psychology (grade B). Hereford Sixth Form College A Levels 1998  – 2000 Business Studies (grade A), Design (grade A) and Psychology (grade B). Kingstone High School GCSEs 1993  – 1998 10 GCSEs Grades A-C including English, Maths and Science. Kingstone High School GCSEs 1993  – 1998 10 GCSEs Grades A-C including English, Maths and Science. Kingstone High School GCSEs 1993  – 1998 10 GCSEs Grades A-C including English, Maths and Science. ", "Experience Pre Check Engineer EMC April 2015  – Present (5 months) - Notify customer of ongoing issues and problem resolution status. \n \n- Applies advanced technical expertise using standard operating and diagnostic protocols to resolve standard to complex system level issues. \n \n- Identifies and interprets interoperability and support matrixes. Identifies and reviews, creates and delivers timely and highly focused training programs and/or serviceability enhancements within the Field and Technical Support Departments.  \n Customer Business Analyst Intel Corporation September 2011  –  February 2015  (3 years 6 months) Shenzhen, Guangdong, China -Overall account owner to customers in related to roadmap, demand, supply, backlog, shipment, inventory, daily customer issues such as logistic related stuffs. \n- Key contact to field, supply team, logistic, credit and finance team etc related to supply request and order fulfillment activities. \n- Revenue owner responsible to provide accurate revenue updates in revenue management tool and engage with field and customers for revenue synch up. \n- Drive tactical demand forecast accuracy in alignment with supply, gain visibility to customer data like production plan, inventory, consumption, sales out data and provide product mix or supply guidance through customer collaboration. \n- Utilize and support continuous improvements for system, business process, tool and reports. \n- Influence customers and internal stakeholders to align with SMG management directions. \n- Working with cross Geo, cross organization and other internal stakeholders to drive an effective supply chain model. CS ON Semiconductor December 2009  –  September 2011  (1 year 10 months) Shenzhen, Guangdong, China 1. Analyze customer's Forecast by weekly to optimize the stock structure. \n2. Monitor the product supply status and set up a plan for the product distribution in a period of its allocation. \n3. Sales order operation, coordinate with domestic and oversea customers and ensure the goods delivery and information obtain.  \n4. Provide report related to the order issue and result for customer’s requirement Pre Check Engineer EMC April 2015  – Present (5 months) - Notify customer of ongoing issues and problem resolution status. \n \n- Applies advanced technical expertise using standard operating and diagnostic protocols to resolve standard to complex system level issues. \n \n- Identifies and interprets interoperability and support matrixes. Identifies and reviews, creates and delivers timely and highly focused training programs and/or serviceability enhancements within the Field and Technical Support Departments.  \n Pre Check Engineer EMC April 2015  – Present (5 months) - Notify customer of ongoing issues and problem resolution status. \n \n- Applies advanced technical expertise using standard operating and diagnostic protocols to resolve standard to complex system level issues. \n \n- Identifies and interprets interoperability and support matrixes. Identifies and reviews, creates and delivers timely and highly focused training programs and/or serviceability enhancements within the Field and Technical Support Departments.  \n Customer Business Analyst Intel Corporation September 2011  –  February 2015  (3 years 6 months) Shenzhen, Guangdong, China -Overall account owner to customers in related to roadmap, demand, supply, backlog, shipment, inventory, daily customer issues such as logistic related stuffs. \n- Key contact to field, supply team, logistic, credit and finance team etc related to supply request and order fulfillment activities. \n- Revenue owner responsible to provide accurate revenue updates in revenue management tool and engage with field and customers for revenue synch up. \n- Drive tactical demand forecast accuracy in alignment with supply, gain visibility to customer data like production plan, inventory, consumption, sales out data and provide product mix or supply guidance through customer collaboration. \n- Utilize and support continuous improvements for system, business process, tool and reports. \n- Influence customers and internal stakeholders to align with SMG management directions. \n- Working with cross Geo, cross organization and other internal stakeholders to drive an effective supply chain model. Customer Business Analyst Intel Corporation September 2011  –  February 2015  (3 years 6 months) Shenzhen, Guangdong, China -Overall account owner to customers in related to roadmap, demand, supply, backlog, shipment, inventory, daily customer issues such as logistic related stuffs. \n- Key contact to field, supply team, logistic, credit and finance team etc related to supply request and order fulfillment activities. \n- Revenue owner responsible to provide accurate revenue updates in revenue management tool and engage with field and customers for revenue synch up. \n- Drive tactical demand forecast accuracy in alignment with supply, gain visibility to customer data like production plan, inventory, consumption, sales out data and provide product mix or supply guidance through customer collaboration. \n- Utilize and support continuous improvements for system, business process, tool and reports. \n- Influence customers and internal stakeholders to align with SMG management directions. \n- Working with cross Geo, cross organization and other internal stakeholders to drive an effective supply chain model. CS ON Semiconductor December 2009  –  September 2011  (1 year 10 months) Shenzhen, Guangdong, China 1. Analyze customer's Forecast by weekly to optimize the stock structure. \n2. Monitor the product supply status and set up a plan for the product distribution in a period of its allocation. \n3. Sales order operation, coordinate with domestic and oversea customers and ensure the goods delivery and information obtain.  \n4. Provide report related to the order issue and result for customer’s requirement CS ON Semiconductor December 2009  –  September 2011  (1 year 10 months) Shenzhen, Guangdong, China 1. Analyze customer's Forecast by weekly to optimize the stock structure. \n2. Monitor the product supply status and set up a plan for the product distribution in a period of its allocation. \n3. Sales order operation, coordinate with domestic and oversea customers and ensure the goods delivery and information obtain.  \n4. Provide report related to the order issue and result for customer’s requirement Education Yanbian University Bachelor's degree,  International Business/Trade/Commerce 2005  – 2009 Yanbian University Bachelor's degree,  International Business/Trade/Commerce 2005  – 2009 Yanbian University Bachelor's degree,  International Business/Trade/Commerce 2005  – 2009 Yanbian University Bachelor's degree,  International Business/Trade/Commerce 2005  – 2009 ", "Experience Customer Business Analyst Intel Corporation July 2014  – Present (1 year 2 months) Folsom, CA Business Operations Intern Intel Corporation May 2013  –  August 2013  (4 months) Folsom, CA Customer Business Analyst for Americas Sales & Marketing Organization (ASMO) Extern US Patent and Trademark Office October 2012  –  December 2012  (3 months) Alexandria, Virginia DC Operations Intern LoadSpring Solutions, Inc. June 2012  –  August 2012  (3 months) Intern Zapp-East June 2011  –  August 2011  (3 months) Assistant Coach ABCE Volleyball Clinics September 2006  –  August 2009  (3 years) Coached both inexperienced and experienced volleyball players between ages 9 and 14. \nManaged group clinics, private coaching, attendance, and organization of games. Customer Business Analyst Intel Corporation July 2014  – Present (1 year 2 months) Folsom, CA Customer Business Analyst Intel Corporation July 2014  – Present (1 year 2 months) Folsom, CA Business Operations Intern Intel Corporation May 2013  –  August 2013  (4 months) Folsom, CA Customer Business Analyst for Americas Sales & Marketing Organization (ASMO) Business Operations Intern Intel Corporation May 2013  –  August 2013  (4 months) Folsom, CA Customer Business Analyst for Americas Sales & Marketing Organization (ASMO) Extern US Patent and Trademark Office October 2012  –  December 2012  (3 months) Alexandria, Virginia Extern US Patent and Trademark Office October 2012  –  December 2012  (3 months) Alexandria, Virginia DC Operations Intern LoadSpring Solutions, Inc. June 2012  –  August 2012  (3 months) DC Operations Intern LoadSpring Solutions, Inc. June 2012  –  August 2012  (3 months) Intern Zapp-East June 2011  –  August 2011  (3 months) Intern Zapp-East June 2011  –  August 2011  (3 months) Assistant Coach ABCE Volleyball Clinics September 2006  –  August 2009  (3 years) Coached both inexperienced and experienced volleyball players between ages 9 and 14. \nManaged group clinics, private coaching, attendance, and organization of games. Assistant Coach ABCE Volleyball Clinics September 2006  –  August 2009  (3 years) Coached both inexperienced and experienced volleyball players between ages 9 and 14. \nManaged group clinics, private coaching, attendance, and organization of games. Languages English Native or bilingual proficiency Russian Native or bilingual proficiency Spanish Limited working proficiency English Native or bilingual proficiency Russian Native or bilingual proficiency Spanish Limited working proficiency English Native or bilingual proficiency Russian Native or bilingual proficiency Spanish Limited working proficiency Native or bilingual proficiency Native or bilingual proficiency Limited working proficiency Skills Leadership Microsoft Office PowerPoint Windows Microsoft Excel Program Management Customer Service SAP Demand Forecasting Process Improvement Logistics Data Analysis Entrepreneurship Order Management Project Management Procurement Training Social Networking Visio See 4+     See less Skills  Leadership Microsoft Office PowerPoint Windows Microsoft Excel Program Management Customer Service SAP Demand Forecasting Process Improvement Logistics Data Analysis Entrepreneurship Order Management Project Management Procurement Training Social Networking Visio See 4+     See less Leadership Microsoft Office PowerPoint Windows Microsoft Excel Program Management Customer Service SAP Demand Forecasting Process Improvement Logistics Data Analysis Entrepreneurship Order Management Project Management Procurement Training Social Networking Visio See 4+     See less Leadership Microsoft Office PowerPoint Windows Microsoft Excel Program Management Customer Service SAP Demand Forecasting Process Improvement Logistics Data Analysis Entrepreneurship Order Management Project Management Procurement Training Social Networking Visio See 4+     See less Education Worcester Polytechnic Institute BS,  Management Engineering 2010  – 2014 Concentration in Operations Activities and Societies:  Alpha Phi International Fraternity ,  Women's Club Rugby Acton Boxborough Regional High School Diploma 2006  – 2010 Activities and Societies:  Varsity Volleyball ,  AB Ambassadors ,  Track and Field Worcester Polytechnic Institute BS,  Management Engineering 2010  – 2014 Concentration in Operations Activities and Societies:  Alpha Phi International Fraternity ,  Women's Club Rugby Worcester Polytechnic Institute BS,  Management Engineering 2010  – 2014 Concentration in Operations Activities and Societies:  Alpha Phi International Fraternity ,  Women's Club Rugby Worcester Polytechnic Institute BS,  Management Engineering 2010  – 2014 Concentration in Operations Activities and Societies:  Alpha Phi International Fraternity ,  Women's Club Rugby Acton Boxborough Regional High School Diploma 2006  – 2010 Activities and Societies:  Varsity Volleyball ,  AB Ambassadors ,  Track and Field Acton Boxborough Regional High School Diploma 2006  – 2010 Activities and Societies:  Varsity Volleyball ,  AB Ambassadors ,  Track and Field Acton Boxborough Regional High School Diploma 2006  – 2010 Activities and Societies:  Varsity Volleyball ,  AB Ambassadors ,  Track and Field ", "Experience Customer Business Analyst Intel Corporation November 2008  – Present (6 years 10 months) Marketing Assistant Alcatel-Lucent September 2006  –  September 2007  (1 year 1 month) Marketing Assistant to the European Channel Marketing team, based in Paris. Marketing Assistant Alcatel-Lucent, Paris August 2002  –  September 2003  (1 year 2 months) Customer Business Analyst Intel Corporation November 2008  – Present (6 years 10 months) Customer Business Analyst Intel Corporation November 2008  – Present (6 years 10 months) Marketing Assistant Alcatel-Lucent September 2006  –  September 2007  (1 year 1 month) Marketing Assistant to the European Channel Marketing team, based in Paris. Marketing Assistant Alcatel-Lucent September 2006  –  September 2007  (1 year 1 month) Marketing Assistant to the European Channel Marketing team, based in Paris. Marketing Assistant Alcatel-Lucent, Paris August 2002  –  September 2003  (1 year 2 months) Marketing Assistant Alcatel-Lucent, Paris August 2002  –  September 2003  (1 year 2 months) Education Aston University BSc (Hons),  Business and French 2004  – 2008 Aston University BSc (Hons),  Business and French 2004  – 2008 Aston University BSc (Hons),  Business and French 2004  – 2008 Aston University BSc (Hons),  Business and French 2004  – 2008 ", "Summary Goal and task oriented Training Program and Business Analyst with extensive experience with Intel Corporation in Sales and Marketing and Business Operations. Strong skills in Operations, Supplier Management, Training, and Customer Service. Extensive experience in issue management, tool program development, and Implementation. Strengths include solid communication, problem-solving skills and adapting to change Summary Goal and task oriented Training Program and Business Analyst with extensive experience with Intel Corporation in Sales and Marketing and Business Operations. Strong skills in Operations, Supplier Management, Training, and Customer Service. Extensive experience in issue management, tool program development, and Implementation. Strengths include solid communication, problem-solving skills and adapting to change Goal and task oriented Training Program and Business Analyst with extensive experience with Intel Corporation in Sales and Marketing and Business Operations. Strong skills in Operations, Supplier Management, Training, and Customer Service. Extensive experience in issue management, tool program development, and Implementation. Strengths include solid communication, problem-solving skills and adapting to change Goal and task oriented Training Program and Business Analyst with extensive experience with Intel Corporation in Sales and Marketing and Business Operations. Strong skills in Operations, Supplier Management, Training, and Customer Service. Extensive experience in issue management, tool program development, and Implementation. Strengths include solid communication, problem-solving skills and adapting to change Experience Global Productivity Solutions Analyst Intel Corporation August 2006  – Present (9 years 1 month) Folsom, CA Customer Sales Analyst Intel Corporation March 2000  – Present (15 years 6 months) Customer Business Analyst Intel Corporation March 2000  –  April 2006  (6 years 2 months) Folsom, CA Material Purchase Manager Sterling Electronics July 1992  –  September 1999  (7 years 3 months) Purchase Material Manager Global Productivity Solutions Analyst Intel Corporation August 2006  – Present (9 years 1 month) Folsom, CA Global Productivity Solutions Analyst Intel Corporation August 2006  – Present (9 years 1 month) Folsom, CA Customer Sales Analyst Intel Corporation March 2000  – Present (15 years 6 months) Customer Sales Analyst Intel Corporation March 2000  – Present (15 years 6 months) Customer Business Analyst Intel Corporation March 2000  –  April 2006  (6 years 2 months) Folsom, CA Customer Business Analyst Intel Corporation March 2000  –  April 2006  (6 years 2 months) Folsom, CA Material Purchase Manager Sterling Electronics July 1992  –  September 1999  (7 years 3 months) Purchase Material Manager Material Purchase Manager Sterling Electronics July 1992  –  September 1999  (7 years 3 months) Purchase Material Manager Skills Project Management Program Management Vendor Management Team Building Microsoft Office Customer Service Marketing Business Process Coaching Direct Sales Semiconductors Go-to-market Strategy Salesforce.com Leadership Skills  Project Management Program Management Vendor Management Team Building Microsoft Office Customer Service Marketing Business Process Coaching Direct Sales Semiconductors Go-to-market Strategy Salesforce.com Leadership Project Management Program Management Vendor Management Team Building Microsoft Office Customer Service Marketing Business Process Coaching Direct Sales Semiconductors Go-to-market Strategy Salesforce.com Leadership Project Management Program Management Vendor Management Team Building Microsoft Office Customer Service Marketing Business Process Coaching Direct Sales Semiconductors Go-to-market Strategy Salesforce.com Leadership Education San Jose State University Bachelor of Arts (BA),  Business , Management, Marketing, and Related Support Services 1992  – 1999 Business Marketing West Valley College Associate of Arts (AA),  Business , Management, Marketing, and Related Support Services 1989  – 1992 Study Business Marketing San Jose State University Bachelor of Arts (BA),  Business , Management, Marketing, and Related Support Services 1992  – 1999 Business Marketing San Jose State University Bachelor of Arts (BA),  Business , Management, Marketing, and Related Support Services 1992  – 1999 Business Marketing San Jose State University Bachelor of Arts (BA),  Business , Management, Marketing, and Related Support Services 1992  – 1999 Business Marketing West Valley College Associate of Arts (AA),  Business , Management, Marketing, and Related Support Services 1989  – 1992 Study Business Marketing West Valley College Associate of Arts (AA),  Business , Management, Marketing, and Related Support Services 1989  – 1992 Study Business Marketing West Valley College Associate of Arts (AA),  Business , Management, Marketing, and Related Support Services 1989  – 1992 Study Business Marketing ", "Summary Intel EMEA Pricing Manager for Automotive and other Internet of Things customers. Over 6 years experience within Business Operations functions, mainly working with products and customers in the Internet of Things segment. Summary Intel EMEA Pricing Manager for Automotive and other Internet of Things customers. Over 6 years experience within Business Operations functions, mainly working with products and customers in the Internet of Things segment. Intel EMEA Pricing Manager for Automotive and other Internet of Things customers. Over 6 years experience within Business Operations functions, mainly working with products and customers in the Internet of Things segment. Intel EMEA Pricing Manager for Automotive and other Internet of Things customers. Over 6 years experience within Business Operations functions, mainly working with products and customers in the Internet of Things segment. Experience EMEA Pricing Manager Intel Corporation July 2013  – Present (2 years 2 months) Swindon, United Kingdom EMEA Pricing Manager for Automotive and other Internet of Things customers. Responsibilities include establishing geography specific pricing strategies for different industry segments whilst interacting with HQ product division functions and negotiating annual pricing contracts with customers. EMEA Geographic Business Manager Intel November 2010  –  June 2013  (2 years 8 months) EMEA Geographic Business Manager for Embedded Intel Architecture parts. Responsibilities included demand and revenue forecasting for EMEA Embedded IA business, managing supply allocations for the geography and coaching several interns. Customer Business Analyst Intel Corporation August 2009  –  November 2010  (1 year 4 months) Customer Business Analyst for EMEA channel distributors. Responsibilities included being the main Intel point of contact for the distributor from a supply chain perspective and forecasting revenue and demand for the distributor. Final Year Student Aston University August 2008  –  October 2009  (1 year 3 months) Student on BSc Management & Strategy Customer Business Analyst Intel Corporation July 2007  –  August 2008  (1 year 2 months) Customer Business Analyst for EMEA channel distributors. Responsibilities included being the main Intel point of contact for the distributor from a supply chain perspective and forecasting revenue and demand for the distributor. EMEA Pricing Manager Intel Corporation July 2013  – Present (2 years 2 months) Swindon, United Kingdom EMEA Pricing Manager for Automotive and other Internet of Things customers. Responsibilities include establishing geography specific pricing strategies for different industry segments whilst interacting with HQ product division functions and negotiating annual pricing contracts with customers. EMEA Pricing Manager Intel Corporation July 2013  – Present (2 years 2 months) Swindon, United Kingdom EMEA Pricing Manager for Automotive and other Internet of Things customers. Responsibilities include establishing geography specific pricing strategies for different industry segments whilst interacting with HQ product division functions and negotiating annual pricing contracts with customers. EMEA Geographic Business Manager Intel November 2010  –  June 2013  (2 years 8 months) EMEA Geographic Business Manager for Embedded Intel Architecture parts. Responsibilities included demand and revenue forecasting for EMEA Embedded IA business, managing supply allocations for the geography and coaching several interns. EMEA Geographic Business Manager Intel November 2010  –  June 2013  (2 years 8 months) EMEA Geographic Business Manager for Embedded Intel Architecture parts. Responsibilities included demand and revenue forecasting for EMEA Embedded IA business, managing supply allocations for the geography and coaching several interns. Customer Business Analyst Intel Corporation August 2009  –  November 2010  (1 year 4 months) Customer Business Analyst for EMEA channel distributors. Responsibilities included being the main Intel point of contact for the distributor from a supply chain perspective and forecasting revenue and demand for the distributor. Customer Business Analyst Intel Corporation August 2009  –  November 2010  (1 year 4 months) Customer Business Analyst for EMEA channel distributors. Responsibilities included being the main Intel point of contact for the distributor from a supply chain perspective and forecasting revenue and demand for the distributor. Final Year Student Aston University August 2008  –  October 2009  (1 year 3 months) Student on BSc Management & Strategy Final Year Student Aston University August 2008  –  October 2009  (1 year 3 months) Student on BSc Management & Strategy Customer Business Analyst Intel Corporation July 2007  –  August 2008  (1 year 2 months) Customer Business Analyst for EMEA channel distributors. Responsibilities included being the main Intel point of contact for the distributor from a supply chain perspective and forecasting revenue and demand for the distributor. Customer Business Analyst Intel Corporation July 2007  –  August 2008  (1 year 2 months) Customer Business Analyst for EMEA channel distributors. Responsibilities included being the main Intel point of contact for the distributor from a supply chain perspective and forecasting revenue and demand for the distributor. Skills Intel Semiconductors Product Marketing Supply Chain Management Data Analysis Forecasting Analysis Business Analysis Teamwork Competitive Analysis Customer Oriented Microsoft Excel Revenue Forecasting Strategy Embedded Systems Semiconductor Industry Business Strategy Pricing Market Analysis Business Development Management Cross-functional Team... Account Management SAP Market Research See 10+     See less Skills  Intel Semiconductors Product Marketing Supply Chain Management Data Analysis Forecasting Analysis Business Analysis Teamwork Competitive Analysis Customer Oriented Microsoft Excel Revenue Forecasting Strategy Embedded Systems Semiconductor Industry Business Strategy Pricing Market Analysis Business Development Management Cross-functional Team... Account Management SAP Market Research See 10+     See less Intel Semiconductors Product Marketing Supply Chain Management Data Analysis Forecasting Analysis Business Analysis Teamwork Competitive Analysis Customer Oriented Microsoft Excel Revenue Forecasting Strategy Embedded Systems Semiconductor Industry Business Strategy Pricing Market Analysis Business Development Management Cross-functional Team... Account Management SAP Market Research See 10+     See less Intel Semiconductors Product Marketing Supply Chain Management Data Analysis Forecasting Analysis Business Analysis Teamwork Competitive Analysis Customer Oriented Microsoft Excel Revenue Forecasting Strategy Embedded Systems Semiconductor Industry Business Strategy Pricing Market Analysis Business Development Management Cross-functional Team... Account Management SAP Market Research See 10+     See less Education Aston University Bachelor's Degree,  Management & Strategy , 2:1 2005  – 2009 Alcester Grammar School 2003  – 2005 A Level Studies Aston University Bachelor's Degree,  Management & Strategy , 2:1 2005  – 2009 Aston University Bachelor's Degree,  Management & Strategy , 2:1 2005  – 2009 Aston University Bachelor's Degree,  Management & Strategy , 2:1 2005  – 2009 Alcester Grammar School 2003  – 2005 A Level Studies Alcester Grammar School 2003  – 2005 A Level Studies Alcester Grammar School 2003  – 2005 A Level Studies ", "Experience Customer Business Analyst Intel Corporation January 2014  – Present (1 year 8 months) Folsom, CA Acts as a direct primary contact supporting channel customers Product Line Analyst Intel Corporation January 2012  –  January 2014  (2 years 1 month) Folsom, CA Works with stakeholders worldwide and observes market trends to analyze what products the assigned customer base will need, and consolidates these demand signals to help drive the right mix of supply; also handles supply optimization and constraint management when needed Customer Business Analyst Intel Corporation January 2011  –  January 2012  (1 year 1 month) Folsom, CA Acted as a direct primary contact supporting several major customers, and provided an accurate customer demand and revenue forecast to key stakeholders Management Trainee Consolidated Electrical Distributors April 2010  –  January 2011  (10 months) Yuba City, California Area Hired into highly competitive program that educates trainees on the many pieces of running a business, providing experience and insight in areas like inventory management, register processing, and profit & loss Intermediate Microeconomics T.A. California State University, Sacramento August 2008  –  December 2008  (5 months) Sacramento, California Area Provided advanced academic aid to individuals and groups of students, while developing and employing excellent communication skills in order to maximize effectiveness; also kept records of sessions held in order to report surfacing issues and areas of need to professor Customer Business Analyst Intel Corporation January 2014  – Present (1 year 8 months) Folsom, CA Acts as a direct primary contact supporting channel customers Customer Business Analyst Intel Corporation January 2014  – Present (1 year 8 months) Folsom, CA Acts as a direct primary contact supporting channel customers Product Line Analyst Intel Corporation January 2012  –  January 2014  (2 years 1 month) Folsom, CA Works with stakeholders worldwide and observes market trends to analyze what products the assigned customer base will need, and consolidates these demand signals to help drive the right mix of supply; also handles supply optimization and constraint management when needed Product Line Analyst Intel Corporation January 2012  –  January 2014  (2 years 1 month) Folsom, CA Works with stakeholders worldwide and observes market trends to analyze what products the assigned customer base will need, and consolidates these demand signals to help drive the right mix of supply; also handles supply optimization and constraint management when needed Customer Business Analyst Intel Corporation January 2011  –  January 2012  (1 year 1 month) Folsom, CA Acted as a direct primary contact supporting several major customers, and provided an accurate customer demand and revenue forecast to key stakeholders Customer Business Analyst Intel Corporation January 2011  –  January 2012  (1 year 1 month) Folsom, CA Acted as a direct primary contact supporting several major customers, and provided an accurate customer demand and revenue forecast to key stakeholders Management Trainee Consolidated Electrical Distributors April 2010  –  January 2011  (10 months) Yuba City, California Area Hired into highly competitive program that educates trainees on the many pieces of running a business, providing experience and insight in areas like inventory management, register processing, and profit & loss Management Trainee Consolidated Electrical Distributors April 2010  –  January 2011  (10 months) Yuba City, California Area Hired into highly competitive program that educates trainees on the many pieces of running a business, providing experience and insight in areas like inventory management, register processing, and profit & loss Intermediate Microeconomics T.A. California State University, Sacramento August 2008  –  December 2008  (5 months) Sacramento, California Area Provided advanced academic aid to individuals and groups of students, while developing and employing excellent communication skills in order to maximize effectiveness; also kept records of sessions held in order to report surfacing issues and areas of need to professor Intermediate Microeconomics T.A. California State University, Sacramento August 2008  –  December 2008  (5 months) Sacramento, California Area Provided advanced academic aid to individuals and groups of students, while developing and employing excellent communication skills in order to maximize effectiveness; also kept records of sessions held in order to report surfacing issues and areas of need to professor Skills Microsoft Excel PowerPoint Microsoft Word Public Speaking SAP Oral & Written... Teamwork Project Leadership Customer Service Leadership Forecasting Analysis Skills  Microsoft Excel PowerPoint Microsoft Word Public Speaking SAP Oral & Written... Teamwork Project Leadership Customer Service Leadership Forecasting Analysis Microsoft Excel PowerPoint Microsoft Word Public Speaking SAP Oral & Written... Teamwork Project Leadership Customer Service Leadership Forecasting Analysis Microsoft Excel PowerPoint Microsoft Word Public Speaking SAP Oral & Written... Teamwork Project Leadership Customer Service Leadership Forecasting Analysis Education Capella University Master's Degree,  Marriage and Family Therapy/Counseling 2014  – 2020 Ongoing education California State University-Sacramento Bachelor of Arts (B.A.),  Economics , 3.9 2008  – 2009 Activities and Societies:  Graduated Summa Cum Laude Sierra College Associate of Arts (A.A.),  Social Science , 3.9 2005  – 2007 Activities and Societies:  Graduated with honors Sierra College Associate of Arts (A.A.),  Liberal Arts , 3.9 2005  – 2007 Activities and Societies:  Graduated with honors Capella University Master's Degree,  Marriage and Family Therapy/Counseling 2014  – 2020 Ongoing education Capella University Master's Degree,  Marriage and Family Therapy/Counseling 2014  – 2020 Ongoing education Capella University Master's Degree,  Marriage and Family Therapy/Counseling 2014  – 2020 Ongoing education California State University-Sacramento Bachelor of Arts (B.A.),  Economics , 3.9 2008  – 2009 Activities and Societies:  Graduated Summa Cum Laude California State University-Sacramento Bachelor of Arts (B.A.),  Economics , 3.9 2008  – 2009 Activities and Societies:  Graduated Summa Cum Laude California State University-Sacramento Bachelor of Arts (B.A.),  Economics , 3.9 2008  – 2009 Activities and Societies:  Graduated Summa Cum Laude Sierra College Associate of Arts (A.A.),  Social Science , 3.9 2005  – 2007 Activities and Societies:  Graduated with honors Sierra College Associate of Arts (A.A.),  Social Science , 3.9 2005  – 2007 Activities and Societies:  Graduated with honors Sierra College Associate of Arts (A.A.),  Social Science , 3.9 2005  – 2007 Activities and Societies:  Graduated with honors Sierra College Associate of Arts (A.A.),  Liberal Arts , 3.9 2005  – 2007 Activities and Societies:  Graduated with honors Sierra College Associate of Arts (A.A.),  Liberal Arts , 3.9 2005  – 2007 Activities and Societies:  Graduated with honors Sierra College Associate of Arts (A.A.),  Liberal Arts , 3.9 2005  – 2007 Activities and Societies:  Graduated with honors ", "Experience Customer Business Analyst Intel Corporation December 2014  – Present (9 months) Swindon, United Kingdom Web Associate (Deputy Manager) hibu August 2014  –  November 2014  (4 months) Reading, United Kingdom Commercial Channel Management Executive GSK June 2012  –  July 2013  (1 year 2 months) London, United Kingdom Bar Staff White Lyon and Dragon (Guildford) October 2011  –  June 2012  (9 months) Customer Business Analyst Intel Corporation December 2014  – Present (9 months) Swindon, United Kingdom Customer Business Analyst Intel Corporation December 2014  – Present (9 months) Swindon, United Kingdom Web Associate (Deputy Manager) hibu August 2014  –  November 2014  (4 months) Reading, United Kingdom Web Associate (Deputy Manager) hibu August 2014  –  November 2014  (4 months) Reading, United Kingdom Commercial Channel Management Executive GSK June 2012  –  July 2013  (1 year 2 months) London, United Kingdom Commercial Channel Management Executive GSK June 2012  –  July 2013  (1 year 2 months) London, United Kingdom Bar Staff White Lyon and Dragon (Guildford) October 2011  –  June 2012  (9 months) Bar Staff White Lyon and Dragon (Guildford) October 2011  –  June 2012  (9 months) Languages   Skills Microsoft Office Research PowerPoint Microsoft Excel Microsoft Word Social Media Public Speaking Data Analysis Event Planning Event Management Management English Skills  Microsoft Office Research PowerPoint Microsoft Excel Microsoft Word Social Media Public Speaking Data Analysis Event Planning Event Management Management English Microsoft Office Research PowerPoint Microsoft Excel Microsoft Word Social Media Public Speaking Data Analysis Event Planning Event Management Management English Microsoft Office Research PowerPoint Microsoft Excel Microsoft Word Social Media Public Speaking Data Analysis Event Planning Event Management Management English Education University of Surrey Bachelor's Degree,  Business Management , First 2010  – 2014 Business Management BSc (Hons) Activities and Societies:  University of Surrey FC Vice Chairman\nCaptain of 2nd team 2011/2012 and 2013/2014 Denefield Comprehensive School A-Levels (A,B,C),  Business Studies , History,  Physical Education 2002  – 2010 Activities and Societies:  Denefield School Football Captain Years 2004-2010\nSenior Student 2009-2010 University of Surrey Bachelor's Degree,  Business Management , First 2010  – 2014 Business Management BSc (Hons) Activities and Societies:  University of Surrey FC Vice Chairman\nCaptain of 2nd team 2011/2012 and 2013/2014 University of Surrey Bachelor's Degree,  Business Management , First 2010  – 2014 Business Management BSc (Hons) Activities and Societies:  University of Surrey FC Vice Chairman\nCaptain of 2nd team 2011/2012 and 2013/2014 University of Surrey Bachelor's Degree,  Business Management , First 2010  – 2014 Business Management BSc (Hons) Activities and Societies:  University of Surrey FC Vice Chairman\nCaptain of 2nd team 2011/2012 and 2013/2014 Denefield Comprehensive School A-Levels (A,B,C),  Business Studies , History,  Physical Education 2002  – 2010 Activities and Societies:  Denefield School Football Captain Years 2004-2010\nSenior Student 2009-2010 Denefield Comprehensive School A-Levels (A,B,C),  Business Studies , History,  Physical Education 2002  – 2010 Activities and Societies:  Denefield School Football Captain Years 2004-2010\nSenior Student 2009-2010 Denefield Comprehensive School A-Levels (A,B,C),  Business Studies , History,  Physical Education 2002  – 2010 Activities and Societies:  Denefield School Football Captain Years 2004-2010\nSenior Student 2009-2010 Honors & Awards University of Surrey Football Club, Club Colours University of Surrey May 2014 University of Surrey Football Club, Club Colours University of Surrey May 2014 University of Surrey Football Club, Club Colours University of Surrey May 2014 University of Surrey Football Club, Club Colours University of Surrey May 2014 ", "Experience Customer Business Analyst Intel Corporation Customer Business Analyst Intel Corporation Customer Business Analyst Intel Corporation Skills Semiconductor Industry Semiconductors Intel Cross-functional Team... Process Improvement Product Marketing Supply Chain Management Go-to-market Strategy Skills  Semiconductor Industry Semiconductors Intel Cross-functional Team... Process Improvement Product Marketing Supply Chain Management Go-to-market Strategy Semiconductor Industry Semiconductors Intel Cross-functional Team... Process Improvement Product Marketing Supply Chain Management Go-to-market Strategy Semiconductor Industry Semiconductors Intel Cross-functional Team... Process Improvement Product Marketing Supply Chain Management Go-to-market Strategy ", "Summary Skills: \nProduct Marketing, Data Analytics, Demand Supply Planning & Forecasting, USMNC account Management, Financial Planning & Analysis, Revenue Forecast & Risk Analysis, Market Development, Project Management, People management, supply chain management, Vendor managed inventory, Supplier owned inventory. Summary Skills: \nProduct Marketing, Data Analytics, Demand Supply Planning & Forecasting, USMNC account Management, Financial Planning & Analysis, Revenue Forecast & Risk Analysis, Market Development, Project Management, People management, supply chain management, Vendor managed inventory, Supplier owned inventory. Skills: \nProduct Marketing, Data Analytics, Demand Supply Planning & Forecasting, USMNC account Management, Financial Planning & Analysis, Revenue Forecast & Risk Analysis, Market Development, Project Management, People management, supply chain management, Vendor managed inventory, Supplier owned inventory. Skills: \nProduct Marketing, Data Analytics, Demand Supply Planning & Forecasting, USMNC account Management, Financial Planning & Analysis, Revenue Forecast & Risk Analysis, Market Development, Project Management, People management, supply chain management, Vendor managed inventory, Supplier owned inventory. Experience Customer Business Manager Intel Corporation January 2013  – Present (2 years 8 months) + People management \n+ USMNC OEM account management \n+ Customer fulfillment \n+ Team leadership \n+ Sales and operations planning \n+ Product marketing \n+ Revenue management APJ Marketing Development Manager Intel Corporation April 2012  –  December 2012  (9 months) Team Lead - Customer Business Analyst Intel Corporation September 2010  –  December 2012  (2 years 4 months) Customer business Analyst Intel Corporation July 2004  –  September 2010  (6 years 3 months) Customer Business Manager Intel Corporation January 2013  – Present (2 years 8 months) + People management \n+ USMNC OEM account management \n+ Customer fulfillment \n+ Team leadership \n+ Sales and operations planning \n+ Product marketing \n+ Revenue management Customer Business Manager Intel Corporation January 2013  – Present (2 years 8 months) + People management \n+ USMNC OEM account management \n+ Customer fulfillment \n+ Team leadership \n+ Sales and operations planning \n+ Product marketing \n+ Revenue management APJ Marketing Development Manager Intel Corporation April 2012  –  December 2012  (9 months) APJ Marketing Development Manager Intel Corporation April 2012  –  December 2012  (9 months) Team Lead - Customer Business Analyst Intel Corporation September 2010  –  December 2012  (2 years 4 months) Team Lead - Customer Business Analyst Intel Corporation September 2010  –  December 2012  (2 years 4 months) Customer business Analyst Intel Corporation July 2004  –  September 2010  (6 years 3 months) Customer business Analyst Intel Corporation July 2004  –  September 2010  (6 years 3 months) Languages English Bahasa Indonesia Chinese English Bahasa Indonesia Chinese English Bahasa Indonesia Chinese Skills Supply Chain Management project management Demand Supply Planning Account Management Revenue Forecast & Risk... Market Development Data Analytics Project Management Cross-functional Team... Competitive Analysis Management Supply Chain Skills  Supply Chain Management project management Demand Supply Planning Account Management Revenue Forecast & Risk... Market Development Data Analytics Project Management Cross-functional Team... Competitive Analysis Management Supply Chain Supply Chain Management project management Demand Supply Planning Account Management Revenue Forecast & Risk... Market Development Data Analytics Project Management Cross-functional Team... Competitive Analysis Management Supply Chain Supply Chain Management project management Demand Supply Planning Account Management Revenue Forecast & Risk... Market Development Data Analytics Project Management Cross-functional Team... Competitive Analysis Management Supply Chain Education Deakin University Master of International Business - Melbourne, Australia,  International Business/Trade/Commerce 2000  – 2001 University of Tarumanagara-Jakarta Indonesia Bachelor of Business Management 1992  – 1996 Financial Management, Marketing, Human Resources Management, Management information system, Organizational Behaviour, Cost Accounting, Statistic, Macro/Micro Economic, Feasibility Study. Deakin University Master of International Business - Melbourne, Australia,  International Business/Trade/Commerce 2000  – 2001 Deakin University Master of International Business - Melbourne, Australia,  International Business/Trade/Commerce 2000  – 2001 Deakin University Master of International Business - Melbourne, Australia,  International Business/Trade/Commerce 2000  – 2001 University of Tarumanagara-Jakarta Indonesia Bachelor of Business Management 1992  – 1996 Financial Management, Marketing, Human Resources Management, Management information system, Organizational Behaviour, Cost Accounting, Statistic, Macro/Micro Economic, Feasibility Study. University of Tarumanagara-Jakarta Indonesia Bachelor of Business Management 1992  – 1996 Financial Management, Marketing, Human Resources Management, Management information system, Organizational Behaviour, Cost Accounting, Statistic, Macro/Micro Economic, Feasibility Study. University of Tarumanagara-Jakarta Indonesia Bachelor of Business Management 1992  – 1996 Financial Management, Marketing, Human Resources Management, Management information system, Organizational Behaviour, Cost Accounting, Statistic, Macro/Micro Economic, Feasibility Study. ", "Summary I am a graduate from Heriot Watt University, Edinburgh. I have lots of Field Marketing experience and have worked Field Marketing campaigns representing several Blue Chip organisations. I have account management experience and have lead, trained and supported staff to exceed KPI’s. In addition to this I have extensive merchandising experience. Summary I am a graduate from Heriot Watt University, Edinburgh. I have lots of Field Marketing experience and have worked Field Marketing campaigns representing several Blue Chip organisations. I have account management experience and have lead, trained and supported staff to exceed KPI’s. In addition to this I have extensive merchandising experience. I am a graduate from Heriot Watt University, Edinburgh. I have lots of Field Marketing experience and have worked Field Marketing campaigns representing several Blue Chip organisations. I have account management experience and have lead, trained and supported staff to exceed KPI’s. In addition to this I have extensive merchandising experience. I am a graduate from Heriot Watt University, Edinburgh. I have lots of Field Marketing experience and have worked Field Marketing campaigns representing several Blue Chip organisations. I have account management experience and have lead, trained and supported staff to exceed KPI’s. In addition to this I have extensive merchandising experience. Experience ESG Customer Business Analyst Intel Corporation January 2015  – Present (8 months) Swindon, United Kingdom Graduate Management Trainee Decco October 2013  –  December 2014  (1 year 3 months) Nationwide As a Graduate Management Trainee within the Decco group, I have been exposed to all areas of the business and have seen both sides of Decco - their Home and Garden Wholesale operations and their Construction/end user operation, which operates several builder's merchants and trade counters. \n \nI have undertaken projects within all areas of a Decco business and this has included being a Project Manager on a Retail project to refresh a large existing Retail showroom, as well as working on initiatives that utilise a particular Decco business' unique offering to grow awareness with both existing and potential customers and increase sales whilst maximising the catchment area of that particular Decco-owned business.  \n \nI am currently working on both re-branding the Construction half of Decco to improve our presence throughout the UK as well as proposing and implementing a new website to enable customers to transact with us with greater ease. \n \nAlongside these projects I have had several day-to-day responsibilities, including: \n \n-Sales \n \n-Marketing \n \n-Account Management \n \n-Inventory Control \n \n-Business Development \n \n-Merchandising and POS creation. Samsung Tablet/DI promoter Blue Square Marketing January 2013  –  October 2013  (10 months) Edinburgh, United Kingdom Responsible for promoting several products, from Tablets, to Digital Imaging, to Phones and computers, within different retail chains. \n \nResponsible for generating good relationships with store management and training staff so as to influence sales further. Sony Regional Brand Ambassador (Temp Ad-Hoc) infinite Field Marketing Solution March 2012  –  January 2013  (11 months) Promote and directly sell Sony VAIO products within Sony Shop-in-shop at Currys/PC World stores, ensuring the staff within the stores receive training on the full VAIO range. Brand Ambassador Channel Advantage November 2011  –  October 2012  (1 year) Edinburgh Worked on several fixed-term campaigns for Channel Advantage representing Intel and Lenovo. \n \nResponsible for representing the brands to customers and face-to-face selling, I was also responsible for training the staff of the stores I was working in. \n \nGood customer service was of great importance in these roles as I was the face of the brand to the end-user in store. I drove sales through both direct sales and supporting the staff in the stores. \n \nI was also tasked with ensuring that the brand POS was present, accurate and well represented. I completed daily reports on sales performance and competitor activity. Business Account Developer PC World Business September 2005  –  September 2009  (4 years 1 month) I started working at PC World for 16 Hours per week, advising customers and upselling to meet KPI’s. This also involved merchandising, including refitting stores. \n \nLater offered a full time position as Business Sales Advisor. This new role involved account management and sales in this role ranged from around £500 to in excess of £15,000. \n \nLater promoted to the position of Business Account Developer. This gave me experience in a leadership role as I was tasked with training and supporting staff, running the shop floor on a daily basis including during Peak season, as well as monitoring performance and developing staff to their potential. ESG Customer Business Analyst Intel Corporation January 2015  – Present (8 months) Swindon, United Kingdom ESG Customer Business Analyst Intel Corporation January 2015  – Present (8 months) Swindon, United Kingdom Graduate Management Trainee Decco October 2013  –  December 2014  (1 year 3 months) Nationwide As a Graduate Management Trainee within the Decco group, I have been exposed to all areas of the business and have seen both sides of Decco - their Home and Garden Wholesale operations and their Construction/end user operation, which operates several builder's merchants and trade counters. \n \nI have undertaken projects within all areas of a Decco business and this has included being a Project Manager on a Retail project to refresh a large existing Retail showroom, as well as working on initiatives that utilise a particular Decco business' unique offering to grow awareness with both existing and potential customers and increase sales whilst maximising the catchment area of that particular Decco-owned business.  \n \nI am currently working on both re-branding the Construction half of Decco to improve our presence throughout the UK as well as proposing and implementing a new website to enable customers to transact with us with greater ease. \n \nAlongside these projects I have had several day-to-day responsibilities, including: \n \n-Sales \n \n-Marketing \n \n-Account Management \n \n-Inventory Control \n \n-Business Development \n \n-Merchandising and POS creation. Graduate Management Trainee Decco October 2013  –  December 2014  (1 year 3 months) Nationwide As a Graduate Management Trainee within the Decco group, I have been exposed to all areas of the business and have seen both sides of Decco - their Home and Garden Wholesale operations and their Construction/end user operation, which operates several builder's merchants and trade counters. \n \nI have undertaken projects within all areas of a Decco business and this has included being a Project Manager on a Retail project to refresh a large existing Retail showroom, as well as working on initiatives that utilise a particular Decco business' unique offering to grow awareness with both existing and potential customers and increase sales whilst maximising the catchment area of that particular Decco-owned business.  \n \nI am currently working on both re-branding the Construction half of Decco to improve our presence throughout the UK as well as proposing and implementing a new website to enable customers to transact with us with greater ease. \n \nAlongside these projects I have had several day-to-day responsibilities, including: \n \n-Sales \n \n-Marketing \n \n-Account Management \n \n-Inventory Control \n \n-Business Development \n \n-Merchandising and POS creation. Samsung Tablet/DI promoter Blue Square Marketing January 2013  –  October 2013  (10 months) Edinburgh, United Kingdom Responsible for promoting several products, from Tablets, to Digital Imaging, to Phones and computers, within different retail chains. \n \nResponsible for generating good relationships with store management and training staff so as to influence sales further. Samsung Tablet/DI promoter Blue Square Marketing January 2013  –  October 2013  (10 months) Edinburgh, United Kingdom Responsible for promoting several products, from Tablets, to Digital Imaging, to Phones and computers, within different retail chains. \n \nResponsible for generating good relationships with store management and training staff so as to influence sales further. Sony Regional Brand Ambassador (Temp Ad-Hoc) infinite Field Marketing Solution March 2012  –  January 2013  (11 months) Promote and directly sell Sony VAIO products within Sony Shop-in-shop at Currys/PC World stores, ensuring the staff within the stores receive training on the full VAIO range. Sony Regional Brand Ambassador (Temp Ad-Hoc) infinite Field Marketing Solution March 2012  –  January 2013  (11 months) Promote and directly sell Sony VAIO products within Sony Shop-in-shop at Currys/PC World stores, ensuring the staff within the stores receive training on the full VAIO range. Brand Ambassador Channel Advantage November 2011  –  October 2012  (1 year) Edinburgh Worked on several fixed-term campaigns for Channel Advantage representing Intel and Lenovo. \n \nResponsible for representing the brands to customers and face-to-face selling, I was also responsible for training the staff of the stores I was working in. \n \nGood customer service was of great importance in these roles as I was the face of the brand to the end-user in store. I drove sales through both direct sales and supporting the staff in the stores. \n \nI was also tasked with ensuring that the brand POS was present, accurate and well represented. I completed daily reports on sales performance and competitor activity. Brand Ambassador Channel Advantage November 2011  –  October 2012  (1 year) Edinburgh Worked on several fixed-term campaigns for Channel Advantage representing Intel and Lenovo. \n \nResponsible for representing the brands to customers and face-to-face selling, I was also responsible for training the staff of the stores I was working in. \n \nGood customer service was of great importance in these roles as I was the face of the brand to the end-user in store. I drove sales through both direct sales and supporting the staff in the stores. \n \nI was also tasked with ensuring that the brand POS was present, accurate and well represented. I completed daily reports on sales performance and competitor activity. Business Account Developer PC World Business September 2005  –  September 2009  (4 years 1 month) I started working at PC World for 16 Hours per week, advising customers and upselling to meet KPI’s. This also involved merchandising, including refitting stores. \n \nLater offered a full time position as Business Sales Advisor. This new role involved account management and sales in this role ranged from around £500 to in excess of £15,000. \n \nLater promoted to the position of Business Account Developer. This gave me experience in a leadership role as I was tasked with training and supporting staff, running the shop floor on a daily basis including during Peak season, as well as monitoring performance and developing staff to their potential. Business Account Developer PC World Business September 2005  –  September 2009  (4 years 1 month) I started working at PC World for 16 Hours per week, advising customers and upselling to meet KPI’s. This also involved merchandising, including refitting stores. \n \nLater offered a full time position as Business Sales Advisor. This new role involved account management and sales in this role ranged from around £500 to in excess of £15,000. \n \nLater promoted to the position of Business Account Developer. This gave me experience in a leadership role as I was tasked with training and supporting staff, running the shop floor on a daily basis including during Peak season, as well as monitoring performance and developing staff to their potential. Skills Direct Marketing Field Marketing B2B Account Management Sales Customer Service Training Retail Merchandising Team Leadership Recruiting Brand Awareness Teamwork Microsoft Office Sales Process Marketing Strategy Social Media Marketing Marketing Product Marketing Leadership See 5+     See less Skills  Direct Marketing Field Marketing B2B Account Management Sales Customer Service Training Retail Merchandising Team Leadership Recruiting Brand Awareness Teamwork Microsoft Office Sales Process Marketing Strategy Social Media Marketing Marketing Product Marketing Leadership See 5+     See less Direct Marketing Field Marketing B2B Account Management Sales Customer Service Training Retail Merchandising Team Leadership Recruiting Brand Awareness Teamwork Microsoft Office Sales Process Marketing Strategy Social Media Marketing Marketing Product Marketing Leadership See 5+     See less Direct Marketing Field Marketing B2B Account Management Sales Customer Service Training Retail Merchandising Team Leadership Recruiting Brand Awareness Teamwork Microsoft Office Sales Process Marketing Strategy Social Media Marketing Marketing Product Marketing Leadership See 5+     See less Education Heriot-Watt University Bachelor of Science Honours (BSc) Hons.,  Information Systems (Management) 2009  – 2013 Activities and Societies:  President of Boxing Club Heriot-Watt University Bachelor of Science Honours (BSc) Hons.,  Information Systems (Management) 2009  – 2013 Activities and Societies:  President of Boxing Club Heriot-Watt University Bachelor of Science Honours (BSc) Hons.,  Information Systems (Management) 2009  – 2013 Activities and Societies:  President of Boxing Club Heriot-Watt University Bachelor of Science Honours (BSc) Hons.,  Information Systems (Management) 2009  – 2013 Activities and Societies:  President of Boxing Club Honors & Awards Gold Volunteer Award Heriot-Watt University Sports Union February 2013 I was awarded a gold volunteer award for services to the Heriot-Watt Sports Union through my coaching and volunteering during my time as President of the Heriot-Watt Boxing Club. Silver Volunteer Award Heriot-Watt University Sports Union February 2012 I was given a silver volunteer award by the University Sports Union for services to the Sports Union through my coaching at the Heriot-Watt University Boxing Club. Gold Volunteer Award Heriot-Watt University Sports Union February 2013 I was awarded a gold volunteer award for services to the Heriot-Watt Sports Union through my coaching and volunteering during my time as President of the Heriot-Watt Boxing Club. Gold Volunteer Award Heriot-Watt University Sports Union February 2013 I was awarded a gold volunteer award for services to the Heriot-Watt Sports Union through my coaching and volunteering during my time as President of the Heriot-Watt Boxing Club. Gold Volunteer Award Heriot-Watt University Sports Union February 2013 I was awarded a gold volunteer award for services to the Heriot-Watt Sports Union through my coaching and volunteering during my time as President of the Heriot-Watt Boxing Club. Silver Volunteer Award Heriot-Watt University Sports Union February 2012 I was given a silver volunteer award by the University Sports Union for services to the Sports Union through my coaching at the Heriot-Watt University Boxing Club. Silver Volunteer Award Heriot-Watt University Sports Union February 2012 I was given a silver volunteer award by the University Sports Union for services to the Sports Union through my coaching at the Heriot-Watt University Boxing Club. Silver Volunteer Award Heriot-Watt University Sports Union February 2012 I was given a silver volunteer award by the University Sports Union for services to the Sports Union through my coaching at the Heriot-Watt University Boxing Club. ", "Experience Samples Customer Business Analyst Intel Corporation February 2013  – Present (2 years 7 months) Folsom, CA Responsible for understanding the samples process, supporting the field and Level 2 customers with their requests, and ensuring the samples reach their destination in a timely manner \n \nProvided leadership and deepened samples relationship with field account managers by increasing communication through CESG Staff meetings, fostering personal 1:1 relationships with FAE’s, and providing consistent samples support, as recognized per ASMO Department Award \n \nCollaborated across groups outside her geo-centered role to ensure samples arrived in time for a critical government design win decision, as recognized per Q2 Atlas Award \n \nFacilitated the development of ‘Build-a-PC’ class by obtaining free hardware components internally, educating various audiences about how to ‘Build-a-PC’, and completed a semester long ‘Intro to Computer Science’ course that has contributed to her knowledge of hardware and more, as recognized per ASMO Department Award Oracle Customer Business Analyst Intel Corporation August 2014  –  October 2014  (3 months) Folsom, CA Supported SSD's and NIC's on the Oracle account during a 3 month sabbatical coverage while simultaneously managing her normal desk duties. \n \nResponsible for order management of large SSD product launch which required extensive communication with the NAND Solutions Group (NSG) in addition to strong customer collaboration. \n \nWorked through various logistics issues, pricing adjustments, and out of scope requests Oracle CPU CBA Intern Intel Corporation May 2012  –  August 2012  (4 months) Folsom, CA Handled all Oracle server business resulting in a net revenue of $24 million for the first 5 weeks of Q3  \n \nSuccessfully managed a sudden spike in customer orders by working with stakeholders and ensured a timely delivery as requested \n \nWorked through multiple order management issues including missing shipments and various CPU escalations, resulting in satisfaction for the customer Bookings Department Intern at Allure magazine Conde Nast September 2011  –  December 2011  (4 months) New York, NY Responsible for photo shoot preparation including model casting and location scouting \n \nOrganized and processed invoices for photo shoot expenses \n \nSupported temporary positions within the magazine Label Analysis Intern Warner Music Group September 2011  –  December 2011  (4 months) New York, NY Produced a TV Report Card by analyzing artist sales in relation to television performances \n \nAttended monthly sales meetings to discuss artist representation at Warner \n \nUtilized networking events to communicate effectively Samples Business Operations Intern Intel May 2011  –  August 2011  (4 months) Folsom, CA Managed Desktop, Server, and Mobile Adhoc requests for Tier 2 accounts \n \nCreated a Visio flowchart to offload the requests to a third party vendor resulting in a savings of 25 hours per week \n \nSupported customer inquiries by working with Division and their field contacts to manage supply issues \n \nForecasted demand and managed logistics problems with shipments \n \nProvided Pre-Production samples as a more visible alternative to Production samples Stockbroker Intern Scottrade January 2010  –  January 2011  (1 year 1 month) Modesto, California Area Assisted branch team in becoming the 2nd nationally ranked Scottrade office in creating relationships with customers by providing excellent customer service and informational resources to trade successfully \n \nCoordinated monthly branch seminars for the community concerning various financial topics \n \nDirected customers over the phone and in person with issues pertaining to the Scottrade website, financial transactions, and Scottrade policies \n \nLearned how to construct and manage a stock portfolio applicable to my financial goals Samples Customer Business Analyst Intel Corporation February 2013  – Present (2 years 7 months) Folsom, CA Responsible for understanding the samples process, supporting the field and Level 2 customers with their requests, and ensuring the samples reach their destination in a timely manner \n \nProvided leadership and deepened samples relationship with field account managers by increasing communication through CESG Staff meetings, fostering personal 1:1 relationships with FAE’s, and providing consistent samples support, as recognized per ASMO Department Award \n \nCollaborated across groups outside her geo-centered role to ensure samples arrived in time for a critical government design win decision, as recognized per Q2 Atlas Award \n \nFacilitated the development of ‘Build-a-PC’ class by obtaining free hardware components internally, educating various audiences about how to ‘Build-a-PC’, and completed a semester long ‘Intro to Computer Science’ course that has contributed to her knowledge of hardware and more, as recognized per ASMO Department Award Samples Customer Business Analyst Intel Corporation February 2013  – Present (2 years 7 months) Folsom, CA Responsible for understanding the samples process, supporting the field and Level 2 customers with their requests, and ensuring the samples reach their destination in a timely manner \n \nProvided leadership and deepened samples relationship with field account managers by increasing communication through CESG Staff meetings, fostering personal 1:1 relationships with FAE’s, and providing consistent samples support, as recognized per ASMO Department Award \n \nCollaborated across groups outside her geo-centered role to ensure samples arrived in time for a critical government design win decision, as recognized per Q2 Atlas Award \n \nFacilitated the development of ‘Build-a-PC’ class by obtaining free hardware components internally, educating various audiences about how to ‘Build-a-PC’, and completed a semester long ‘Intro to Computer Science’ course that has contributed to her knowledge of hardware and more, as recognized per ASMO Department Award Oracle Customer Business Analyst Intel Corporation August 2014  –  October 2014  (3 months) Folsom, CA Supported SSD's and NIC's on the Oracle account during a 3 month sabbatical coverage while simultaneously managing her normal desk duties. \n \nResponsible for order management of large SSD product launch which required extensive communication with the NAND Solutions Group (NSG) in addition to strong customer collaboration. \n \nWorked through various logistics issues, pricing adjustments, and out of scope requests Oracle Customer Business Analyst Intel Corporation August 2014  –  October 2014  (3 months) Folsom, CA Supported SSD's and NIC's on the Oracle account during a 3 month sabbatical coverage while simultaneously managing her normal desk duties. \n \nResponsible for order management of large SSD product launch which required extensive communication with the NAND Solutions Group (NSG) in addition to strong customer collaboration. \n \nWorked through various logistics issues, pricing adjustments, and out of scope requests Oracle CPU CBA Intern Intel Corporation May 2012  –  August 2012  (4 months) Folsom, CA Handled all Oracle server business resulting in a net revenue of $24 million for the first 5 weeks of Q3  \n \nSuccessfully managed a sudden spike in customer orders by working with stakeholders and ensured a timely delivery as requested \n \nWorked through multiple order management issues including missing shipments and various CPU escalations, resulting in satisfaction for the customer Oracle CPU CBA Intern Intel Corporation May 2012  –  August 2012  (4 months) Folsom, CA Handled all Oracle server business resulting in a net revenue of $24 million for the first 5 weeks of Q3  \n \nSuccessfully managed a sudden spike in customer orders by working with stakeholders and ensured a timely delivery as requested \n \nWorked through multiple order management issues including missing shipments and various CPU escalations, resulting in satisfaction for the customer Bookings Department Intern at Allure magazine Conde Nast September 2011  –  December 2011  (4 months) New York, NY Responsible for photo shoot preparation including model casting and location scouting \n \nOrganized and processed invoices for photo shoot expenses \n \nSupported temporary positions within the magazine Bookings Department Intern at Allure magazine Conde Nast September 2011  –  December 2011  (4 months) New York, NY Responsible for photo shoot preparation including model casting and location scouting \n \nOrganized and processed invoices for photo shoot expenses \n \nSupported temporary positions within the magazine Label Analysis Intern Warner Music Group September 2011  –  December 2011  (4 months) New York, NY Produced a TV Report Card by analyzing artist sales in relation to television performances \n \nAttended monthly sales meetings to discuss artist representation at Warner \n \nUtilized networking events to communicate effectively Label Analysis Intern Warner Music Group September 2011  –  December 2011  (4 months) New York, NY Produced a TV Report Card by analyzing artist sales in relation to television performances \n \nAttended monthly sales meetings to discuss artist representation at Warner \n \nUtilized networking events to communicate effectively Samples Business Operations Intern Intel May 2011  –  August 2011  (4 months) Folsom, CA Managed Desktop, Server, and Mobile Adhoc requests for Tier 2 accounts \n \nCreated a Visio flowchart to offload the requests to a third party vendor resulting in a savings of 25 hours per week \n \nSupported customer inquiries by working with Division and their field contacts to manage supply issues \n \nForecasted demand and managed logistics problems with shipments \n \nProvided Pre-Production samples as a more visible alternative to Production samples Samples Business Operations Intern Intel May 2011  –  August 2011  (4 months) Folsom, CA Managed Desktop, Server, and Mobile Adhoc requests for Tier 2 accounts \n \nCreated a Visio flowchart to offload the requests to a third party vendor resulting in a savings of 25 hours per week \n \nSupported customer inquiries by working with Division and their field contacts to manage supply issues \n \nForecasted demand and managed logistics problems with shipments \n \nProvided Pre-Production samples as a more visible alternative to Production samples Stockbroker Intern Scottrade January 2010  –  January 2011  (1 year 1 month) Modesto, California Area Assisted branch team in becoming the 2nd nationally ranked Scottrade office in creating relationships with customers by providing excellent customer service and informational resources to trade successfully \n \nCoordinated monthly branch seminars for the community concerning various financial topics \n \nDirected customers over the phone and in person with issues pertaining to the Scottrade website, financial transactions, and Scottrade policies \n \nLearned how to construct and manage a stock portfolio applicable to my financial goals Stockbroker Intern Scottrade January 2010  –  January 2011  (1 year 1 month) Modesto, California Area Assisted branch team in becoming the 2nd nationally ranked Scottrade office in creating relationships with customers by providing excellent customer service and informational resources to trade successfully \n \nCoordinated monthly branch seminars for the community concerning various financial topics \n \nDirected customers over the phone and in person with issues pertaining to the Scottrade website, financial transactions, and Scottrade policies \n \nLearned how to construct and manage a stock portfolio applicable to my financial goals Skills Analysis Sales Customer Service Management Microsoft Excel Financial Analysis Skills  Analysis Sales Customer Service Management Microsoft Excel Financial Analysis Analysis Sales Customer Service Management Microsoft Excel Financial Analysis Analysis Sales Customer Service Management Microsoft Excel Financial Analysis Education University of the Pacific - Eberhardt School of Business BS in Busines Administration,  Finance 2008  – 2012 Universidad Nacional de Costa Rica Spanish Language and Latin American Culture 2012  – 2012 University of the Pacific - Eberhardt School of Business BS in Busines Administration,  Finance 2008  – 2012 University of the Pacific - Eberhardt School of Business BS in Busines Administration,  Finance 2008  – 2012 University of the Pacific - Eberhardt School of Business BS in Busines Administration,  Finance 2008  – 2012 Universidad Nacional de Costa Rica Spanish Language and Latin American Culture 2012  – 2012 Universidad Nacional de Costa Rica Spanish Language and Latin American Culture 2012  – 2012 Universidad Nacional de Costa Rica Spanish Language and Latin American Culture 2012  – 2012 ", "Experience Customer Business Analyst Intel Corporation July 2014  – Present (1 year 2 months) Swindon, United Kingdom Pricing Analyst (Intern) Intel Corporation July 2012  –  August 2013  (1 year 2 months) Swindon, United Kingdom Office Assistant Butler McKenzie Ltd April 2011  –  September 2011  (6 months) Customer Business Analyst Intel Corporation July 2014  – Present (1 year 2 months) Swindon, United Kingdom Customer Business Analyst Intel Corporation July 2014  – Present (1 year 2 months) Swindon, United Kingdom Pricing Analyst (Intern) Intel Corporation July 2012  –  August 2013  (1 year 2 months) Swindon, United Kingdom Pricing Analyst (Intern) Intel Corporation July 2012  –  August 2013  (1 year 2 months) Swindon, United Kingdom Office Assistant Butler McKenzie Ltd April 2011  –  September 2011  (6 months) Office Assistant Butler McKenzie Ltd April 2011  –  September 2011  (6 months) Skills Skills     Education Bournemouth University Bachelor's degree,  Business Studies , 2:1 (Upper Second-Class Honours) 2010  – 2014 Business Studies with Project & Operations Management BA (Hons)  \n Bournemouth University Bachelor's degree,  Business Studies , 2:1 (Upper Second-Class Honours) 2010  – 2014 Business Studies with Project & Operations Management BA (Hons)  \n Bournemouth University Bachelor's degree,  Business Studies , 2:1 (Upper Second-Class Honours) 2010  – 2014 Business Studies with Project & Operations Management BA (Hons)  \n Bournemouth University Bachelor's degree,  Business Studies , 2:1 (Upper Second-Class Honours) 2010  – 2014 Business Studies with Project & Operations Management BA (Hons)  \n ", "Experience Business Analyst Intel Corporation January 2007  – Present (8 years 8 months) Swindon, United Kingdom Project management of Software updates and new releases for internal systems \n•\tSupporting both In-house development and off-the-shelf purchase. \n•\tIdentification of potential Business process Improvement \n \nManagement of deployment process, \n•\tDevelopment/Configuration support \n•\tTransition communication \n•\tTesting,  \n•\tTraining \n•\tPost deployment support of end users. \n \nExperience of Business Transformation for the following areas \n•\tSupply Chain management \n•\tIssue Management \n•\tCRM \n•\tLead Management Geographic Business Analyst Intel Corporation January 2005  –  January 2007  (2 years 1 month) UK Analysis and co-ordination of CPU supply line for EMEA customers. Customer Business Analyst Intel Corporation c/o Haden Building Management January 2002  –  December 2004  (3 years) Swindon, United Kingdom Management of customer special pricing requests \nWorking with Pricing team and customer contacts to agree pricing deals for Channel distribution customers Customer Business Analyst Intel Corporation c/o Wise employment January 2001  –  December 2001  (1 year) Swindon, United Kingdom Analysis and management of Customer Supply Line \nCo-ordination with WW team and EMEA GBAs Contracts Administration MVM Recruitment 2000  –  2001  (1 year) Bristol, United Kingdom Setting up Contracts for MVM sub-contractors and ensuring paperwork in place before start dates for each placement. \nWorking with legal representative to adapt to IR35 legislation changes Business Analyst Intel Corporation January 2007  – Present (8 years 8 months) Swindon, United Kingdom Project management of Software updates and new releases for internal systems \n•\tSupporting both In-house development and off-the-shelf purchase. \n•\tIdentification of potential Business process Improvement \n \nManagement of deployment process, \n•\tDevelopment/Configuration support \n•\tTransition communication \n•\tTesting,  \n•\tTraining \n•\tPost deployment support of end users. \n \nExperience of Business Transformation for the following areas \n•\tSupply Chain management \n•\tIssue Management \n•\tCRM \n•\tLead Management Business Analyst Intel Corporation January 2007  – Present (8 years 8 months) Swindon, United Kingdom Project management of Software updates and new releases for internal systems \n•\tSupporting both In-house development and off-the-shelf purchase. \n•\tIdentification of potential Business process Improvement \n \nManagement of deployment process, \n•\tDevelopment/Configuration support \n•\tTransition communication \n•\tTesting,  \n•\tTraining \n•\tPost deployment support of end users. \n \nExperience of Business Transformation for the following areas \n•\tSupply Chain management \n•\tIssue Management \n•\tCRM \n•\tLead Management Geographic Business Analyst Intel Corporation January 2005  –  January 2007  (2 years 1 month) UK Analysis and co-ordination of CPU supply line for EMEA customers. Geographic Business Analyst Intel Corporation January 2005  –  January 2007  (2 years 1 month) UK Analysis and co-ordination of CPU supply line for EMEA customers. Customer Business Analyst Intel Corporation c/o Haden Building Management January 2002  –  December 2004  (3 years) Swindon, United Kingdom Management of customer special pricing requests \nWorking with Pricing team and customer contacts to agree pricing deals for Channel distribution customers Customer Business Analyst Intel Corporation c/o Haden Building Management January 2002  –  December 2004  (3 years) Swindon, United Kingdom Management of customer special pricing requests \nWorking with Pricing team and customer contacts to agree pricing deals for Channel distribution customers Customer Business Analyst Intel Corporation c/o Wise employment January 2001  –  December 2001  (1 year) Swindon, United Kingdom Analysis and management of Customer Supply Line \nCo-ordination with WW team and EMEA GBAs Customer Business Analyst Intel Corporation c/o Wise employment January 2001  –  December 2001  (1 year) Swindon, United Kingdom Analysis and management of Customer Supply Line \nCo-ordination with WW team and EMEA GBAs Contracts Administration MVM Recruitment 2000  –  2001  (1 year) Bristol, United Kingdom Setting up Contracts for MVM sub-contractors and ensuring paperwork in place before start dates for each placement. \nWorking with legal representative to adapt to IR35 legislation changes Contracts Administration MVM Recruitment 2000  –  2001  (1 year) Bristol, United Kingdom Setting up Contracts for MVM sub-contractors and ensuring paperwork in place before start dates for each placement. \nWorking with legal representative to adapt to IR35 legislation changes Skills Project Management Analysis Testing Process Improvement Business Process Program Management Supply Chain Management Skills  Project Management Analysis Testing Process Improvement Business Process Program Management Supply Chain Management Project Management Analysis Testing Process Improvement Business Process Program Management Supply Chain Management Project Management Analysis Testing Process Improvement Business Process Program Management Supply Chain Management Education University of the West of England Business Studies 1995  – 1999 University of the West of England Business Studies 1995  – 1999 University of the West of England Business Studies 1995  – 1999 University of the West of England Business Studies 1995  – 1999 "]}