{"position": "Data Analyst", "company": "Intel Corporation", "profiles": ["Experience Data Analyst Intel Corporation April 2012  – Present (3 years 5 months) Folsom, CA Business Analyst Intel Corporation April 2011  –  April 2012  (1 year 1 month) Folsom, California Perform research and analysis of released and pre-release products to improve quality of product master data. Create and maintain product and platform taxonomies used to drive opportunity management and pre-sales issue management for Intel’s sales and support organizations. Created a more complete view of product life cycles by analyzing product data to create a subset of targeted products which tie pre-release codenames to launched products. Support efforts for master data migration from legacy applications to SAP CRM enabling reporting and financial inquiries of historical product records. Convert customer needs into technical requirements for development teams while advising business on scope and timing. Support Analyst Roebbelen Contracting, Inc. May 2007  –  February 2011  (3 years 10 months) El Dorado Hills, California Administered virtualized servers using VMware vSphere running Windows Server 2008/2003. Implemented and administered WSUS server providing streamlined Windows Updates to networked computers utilizing Active Directory group policies. Proficient in configuration of network protocols including TCP/IP, IPv4, IPv6, SNMP, SNTP, DNS, DHCP, IMAP, POP3. Provided technical support for 150+ users locally and remotely. Data Analyst Intel Corporation April 2012  – Present (3 years 5 months) Folsom, CA Data Analyst Intel Corporation April 2012  – Present (3 years 5 months) Folsom, CA Business Analyst Intel Corporation April 2011  –  April 2012  (1 year 1 month) Folsom, California Perform research and analysis of released and pre-release products to improve quality of product master data. Create and maintain product and platform taxonomies used to drive opportunity management and pre-sales issue management for Intel’s sales and support organizations. Created a more complete view of product life cycles by analyzing product data to create a subset of targeted products which tie pre-release codenames to launched products. Support efforts for master data migration from legacy applications to SAP CRM enabling reporting and financial inquiries of historical product records. Convert customer needs into technical requirements for development teams while advising business on scope and timing. Business Analyst Intel Corporation April 2011  –  April 2012  (1 year 1 month) Folsom, California Perform research and analysis of released and pre-release products to improve quality of product master data. Create and maintain product and platform taxonomies used to drive opportunity management and pre-sales issue management for Intel’s sales and support organizations. Created a more complete view of product life cycles by analyzing product data to create a subset of targeted products which tie pre-release codenames to launched products. Support efforts for master data migration from legacy applications to SAP CRM enabling reporting and financial inquiries of historical product records. Convert customer needs into technical requirements for development teams while advising business on scope and timing. Support Analyst Roebbelen Contracting, Inc. May 2007  –  February 2011  (3 years 10 months) El Dorado Hills, California Administered virtualized servers using VMware vSphere running Windows Server 2008/2003. Implemented and administered WSUS server providing streamlined Windows Updates to networked computers utilizing Active Directory group policies. Proficient in configuration of network protocols including TCP/IP, IPv4, IPv6, SNMP, SNTP, DNS, DHCP, IMAP, POP3. Provided technical support for 150+ users locally and remotely. Support Analyst Roebbelen Contracting, Inc. May 2007  –  February 2011  (3 years 10 months) El Dorado Hills, California Administered virtualized servers using VMware vSphere running Windows Server 2008/2003. Implemented and administered WSUS server providing streamlined Windows Updates to networked computers utilizing Active Directory group policies. Proficient in configuration of network protocols including TCP/IP, IPv4, IPv6, SNMP, SNTP, DNS, DHCP, IMAP, POP3. Provided technical support for 150+ users locally and remotely. Skills Data Analysis Data Modeling Business Process Design Requirements Gathering Advanced SQL Queries Problem Solving Project Planning DNS TCP/IP Windows Server Servers DHCP Project Management Team Building Strategic Planning Budgets Networking SharePoint MS Project See 4+     See less Skills  Data Analysis Data Modeling Business Process Design Requirements Gathering Advanced SQL Queries Problem Solving Project Planning DNS TCP/IP Windows Server Servers DHCP Project Management Team Building Strategic Planning Budgets Networking SharePoint MS Project See 4+     See less Data Analysis Data Modeling Business Process Design Requirements Gathering Advanced SQL Queries Problem Solving Project Planning DNS TCP/IP Windows Server Servers DHCP Project Management Team Building Strategic Planning Budgets Networking SharePoint MS Project See 4+     See less Data Analysis Data Modeling Business Process Design Requirements Gathering Advanced SQL Queries Problem Solving Project Planning DNS TCP/IP Windows Server Servers DHCP Project Management Team Building Strategic Planning Budgets Networking SharePoint MS Project See 4+     See less Education California State University-Sacramento Bachelor of Arts,  Economics 2001  – 2006 California State University-Sacramento Bachelor of Arts,  Economics 2001  – 2006 California State University-Sacramento Bachelor of Arts,  Economics 2001  – 2006 California State University-Sacramento Bachelor of Arts,  Economics 2001  – 2006 ", "Experience Product Data Analyst Intel Corporation February 2011  – Present (4 years 7 months) Product Data Analyst Intel Corporation February 2011  – Present (4 years 7 months) Product Data Analyst Intel Corporation February 2011  – Present (4 years 7 months) Skills Microsoft Office Microsoft Excel Microsoft Word PowerPoint English Research Outlook Teaching Public Speaking Strategic Planning Skills  Microsoft Office Microsoft Excel Microsoft Word PowerPoint English Research Outlook Teaching Public Speaking Strategic Planning Microsoft Office Microsoft Excel Microsoft Word PowerPoint English Research Outlook Teaching Public Speaking Strategic Planning Microsoft Office Microsoft Excel Microsoft Word PowerPoint English Research Outlook Teaching Public Speaking Strategic Planning Education UTM, Skudai Master of Management (Technology),  Management (Technology) 2006  – 2010 Universiti Teknologi Malaysia UTM, Skudai Master of Management (Technology),  Management (Technology) 2006  – 2010 UTM, Skudai Master of Management (Technology),  Management (Technology) 2006  – 2010 UTM, Skudai Master of Management (Technology),  Management (Technology) 2006  – 2010 Universiti Teknologi Malaysia Universiti Teknologi Malaysia Universiti Teknologi Malaysia ", "Experience Data Analyst Intel Corporation Data Analyst Intel Corporation Data Analyst Intel Corporation ", "Skills Enterprise Architecture Performance Tuning Perl Grid Computing Capacity Planning Shell Scripting Data Warehousing Solaris Unix Linux Unix Shell Scripting Distributed Systems Database Design Architecture Replication High Availability PL/SQL Software Development Data Modeling Databases SQL Tuning C Teradata ETL Integration C++ Informatica Java Oracle SQL Scripting Program Management SQL Server SQL Database Administration Red Hat Linux Weblogic XML TCP/IP Disaster Recovery Team Leadership Virtualization Windows AIX Business Intelligence Oracle RAC OLTP SQL*Plus RMAN Erwin Clustering See 35+     See less Skills  Enterprise Architecture Performance Tuning Perl Grid Computing Capacity Planning Shell Scripting Data Warehousing Solaris Unix Linux Unix Shell Scripting Distributed Systems Database Design Architecture Replication High Availability PL/SQL Software Development Data Modeling Databases SQL Tuning C Teradata ETL Integration C++ Informatica Java Oracle SQL Scripting Program Management SQL Server SQL Database Administration Red Hat Linux Weblogic XML TCP/IP Disaster Recovery Team Leadership Virtualization Windows AIX Business Intelligence Oracle RAC OLTP SQL*Plus RMAN Erwin Clustering See 35+     See less Enterprise Architecture Performance Tuning Perl Grid Computing Capacity Planning Shell Scripting Data Warehousing Solaris Unix Linux Unix Shell Scripting Distributed Systems Database Design Architecture Replication High Availability PL/SQL Software Development Data Modeling Databases SQL Tuning C Teradata ETL Integration C++ Informatica Java Oracle SQL Scripting Program Management SQL Server SQL Database Administration Red Hat Linux Weblogic XML TCP/IP Disaster Recovery Team Leadership Virtualization Windows AIX Business Intelligence Oracle RAC OLTP SQL*Plus RMAN Erwin Clustering See 35+     See less Enterprise Architecture Performance Tuning Perl Grid Computing Capacity Planning Shell Scripting Data Warehousing Solaris Unix Linux Unix Shell Scripting Distributed Systems Database Design Architecture Replication High Availability PL/SQL Software Development Data Modeling Databases SQL Tuning C Teradata ETL Integration C++ Informatica Java Oracle SQL Scripting Program Management SQL Server SQL Database Administration Red Hat Linux Weblogic XML TCP/IP Disaster Recovery Team Leadership Virtualization Windows AIX Business Intelligence Oracle RAC OLTP SQL*Plus RMAN Erwin Clustering See 35+     See less ", "Experience Data Analyst Intel Corporation April 2014  – Present (1 year 5 months) Analytics Strategic Finance Specialist Intel October 2011  –  April 2014  (2 years 7 months) Portland, Oregon Area Sr Strategic Financial Analyst Intel Corporation September 2008  –  October 2011  (3 years 2 months) Hillsboro, OR Sr Financial Analyst Intel Corporation April 2007  –  September 2008  (1 year 6 months) Swindon, United Kingdom Financial Analyst Intel Corporation April 2005  –  April 2007  (2 years 1 month) Hillsboro, OR System Analyst Intel Corporation April 2004  –  April 2005  (1 year 1 month) Hillsboro, OR Data Analyst Intel Corporation February 2003  –  April 2004  (1 year 3 months) Hillsboro, OR Business Analyst Intel Corporation April 2002  –  January 2003  (10 months) Information Services Analyst Intel Corporation October 2000  –  April 2002  (1 year 7 months) Data Analyst Intel Corporation April 2014  – Present (1 year 5 months) Analytics Data Analyst Intel Corporation April 2014  – Present (1 year 5 months) Analytics Strategic Finance Specialist Intel October 2011  –  April 2014  (2 years 7 months) Portland, Oregon Area Strategic Finance Specialist Intel October 2011  –  April 2014  (2 years 7 months) Portland, Oregon Area Sr Strategic Financial Analyst Intel Corporation September 2008  –  October 2011  (3 years 2 months) Hillsboro, OR Sr Strategic Financial Analyst Intel Corporation September 2008  –  October 2011  (3 years 2 months) Hillsboro, OR Sr Financial Analyst Intel Corporation April 2007  –  September 2008  (1 year 6 months) Swindon, United Kingdom Sr Financial Analyst Intel Corporation April 2007  –  September 2008  (1 year 6 months) Swindon, United Kingdom Financial Analyst Intel Corporation April 2005  –  April 2007  (2 years 1 month) Hillsboro, OR Financial Analyst Intel Corporation April 2005  –  April 2007  (2 years 1 month) Hillsboro, OR System Analyst Intel Corporation April 2004  –  April 2005  (1 year 1 month) Hillsboro, OR System Analyst Intel Corporation April 2004  –  April 2005  (1 year 1 month) Hillsboro, OR Data Analyst Intel Corporation February 2003  –  April 2004  (1 year 3 months) Hillsboro, OR Data Analyst Intel Corporation February 2003  –  April 2004  (1 year 3 months) Hillsboro, OR Business Analyst Intel Corporation April 2002  –  January 2003  (10 months) Business Analyst Intel Corporation April 2002  –  January 2003  (10 months) Information Services Analyst Intel Corporation October 2000  –  April 2002  (1 year 7 months) Information Services Analyst Intel Corporation October 2000  –  April 2002  (1 year 7 months) Languages French Limited working proficiency Mandarin Elementary proficiency French Limited working proficiency Mandarin Elementary proficiency French Limited working proficiency Mandarin Elementary proficiency Limited working proficiency Elementary proficiency Skills Finance Strategic Planning Budgets Competitive Analysis Intel Business Process... Program Management Process Improvement Forecasting Financial Modeling Finance Operations Budget Oversight Process Management Cross Functional Team... Persuasive Presentations Decision Analysis Financial Analysis See 2+     See less Skills  Finance Strategic Planning Budgets Competitive Analysis Intel Business Process... Program Management Process Improvement Forecasting Financial Modeling Finance Operations Budget Oversight Process Management Cross Functional Team... Persuasive Presentations Decision Analysis Financial Analysis See 2+     See less Finance Strategic Planning Budgets Competitive Analysis Intel Business Process... Program Management Process Improvement Forecasting Financial Modeling Finance Operations Budget Oversight Process Management Cross Functional Team... Persuasive Presentations Decision Analysis Financial Analysis See 2+     See less Finance Strategic Planning Budgets Competitive Analysis Intel Business Process... Program Management Process Improvement Forecasting Financial Modeling Finance Operations Budget Oversight Process Management Cross Functional Team... Persuasive Presentations Decision Analysis Financial Analysis See 2+     See less Education Brigham Young University Bachelor of Science (B.S.),  Linguistics 1996  – 1999 Nanjing University Chinese Language and Literature 1998  – 1998 Language Certification: Mandarin Brigham Young University Bachelor of Science (B.S.),  Linguistics 1996  – 1999 Brigham Young University Bachelor of Science (B.S.),  Linguistics 1996  – 1999 Brigham Young University Bachelor of Science (B.S.),  Linguistics 1996  – 1999 Nanjing University Chinese Language and Literature 1998  – 1998 Language Certification: Mandarin Nanjing University Chinese Language and Literature 1998  – 1998 Language Certification: Mandarin Nanjing University Chinese Language and Literature 1998  – 1998 Language Certification: Mandarin ", "Experience VF Data Analyst Intel Corporation July 1997  – Present (18 years 2 months) VF Data Analyst Intel Corporation July 1997  – Present (18 years 2 months) VF Data Analyst Intel Corporation July 1997  – Present (18 years 2 months) Skills Semiconductors Intel Processors Computer Architecture Skills  Semiconductors Intel Processors Computer Architecture Semiconductors Intel Processors Computer Architecture Semiconductors Intel Processors Computer Architecture Education UNM UNM UNM UNM ", "Summary Specialties: Software Engineering \nSoftware Verification and Validation \nSoftware Quality Assurance and Testing \nData Structures and Algorithms \nSQL \nSoftware Project Management \nMS -SQL reporting services \nBusiness and Data Analysis \nBusiness Process Re-engineering \nBusiness Intelligence \nAdvanced Excel \nEnterprise Data Warehouse \nProgramming in C/C++ \nScripting languages: Perl, Python \n Summary Specialties: Software Engineering \nSoftware Verification and Validation \nSoftware Quality Assurance and Testing \nData Structures and Algorithms \nSQL \nSoftware Project Management \nMS -SQL reporting services \nBusiness and Data Analysis \nBusiness Process Re-engineering \nBusiness Intelligence \nAdvanced Excel \nEnterprise Data Warehouse \nProgramming in C/C++ \nScripting languages: Perl, Python \n Specialties: Software Engineering \nSoftware Verification and Validation \nSoftware Quality Assurance and Testing \nData Structures and Algorithms \nSQL \nSoftware Project Management \nMS -SQL reporting services \nBusiness and Data Analysis \nBusiness Process Re-engineering \nBusiness Intelligence \nAdvanced Excel \nEnterprise Data Warehouse \nProgramming in C/C++ \nScripting languages: Perl, Python \n Specialties: Software Engineering \nSoftware Verification and Validation \nSoftware Quality Assurance and Testing \nData Structures and Algorithms \nSQL \nSoftware Project Management \nMS -SQL reporting services \nBusiness and Data Analysis \nBusiness Process Re-engineering \nBusiness Intelligence \nAdvanced Excel \nEnterprise Data Warehouse \nProgramming in C/C++ \nScripting languages: Perl, Python \n Experience Business Data Analyst Intel Corporation May 2015  – Present (4 months) Currently working as a Business Data Analyst with Business Intelligence and Channel Operations Management team within Sales and Marketing group to support North America channel operations. \n \nResponsibilities include working with the internal and external stakeholders to identify business problems and working with the IT team to make sure that system being implemented meets business needs. This includes re-engineering some of the business process to improve quality and effectiveness. This also helps stakeholders make better business decisions. \n \nResponsible for generating various weekly/monthly/quarterly reports for business stakeholders. \n \n Software Engineer Intel Corporation May 2013  –  May 2015  (2 years 1 month) Software Engineer with Intel Custom Foundry group responsible for test program/ test class development using C++ for Post Si. Validation. Software Engineer Intel Corporation January 2011  –  May 2013  (2 years 5 months) SW Engineer with the High Performance Computing team to validate upcoming Intel products using MIC (Many Integrated Core) architecture. \n \nValidated multiple components of the complex SW stack for multiple OS. Developed test plans and test cases (Basic Acceptance Tests, Functional Tests, stress/longevity tests, concurrent and cross component tests). Root caused and debugged failures in the Pre and Post silicon environment. Platform Application Engineer Intel Corporation June 2010  –  January 2011  (8 months) Development and testing of debug tools for computer systems based on Intel's processor architecture. \n \nProviding technical support to Intel customers regarding the usage of these tools. Lab Instructor CSU Sacramento September 2009  –  May 2010  (9 months) Lab Instructor for the Electrical Circuits class. Responsibilities include conducting lab sessions, supervising students and assisting them with their lab work including analysis of electrical circuits, schematic design, simulation and verification. \n \nDemonstrated usefulness of various laboratory tools including Digital Oscilloscope, Function Generator Software Engineer Evision Consulting Inc. July 2007  –  July 2009  (2 years 1 month) Worked as a consultant for different client organizations in various sectors including government, finance, insurance. \n \nParticipated in the complete software development life cycle including planning, requirement gathering, analysis, software design, development and testing of web-based software applications. \n \nWorked as a liaison between business users, customers and engineering team members to ensure that system being implemented meets business needs. Business Data Analyst Intel Corporation May 2015  – Present (4 months) Currently working as a Business Data Analyst with Business Intelligence and Channel Operations Management team within Sales and Marketing group to support North America channel operations. \n \nResponsibilities include working with the internal and external stakeholders to identify business problems and working with the IT team to make sure that system being implemented meets business needs. This includes re-engineering some of the business process to improve quality and effectiveness. This also helps stakeholders make better business decisions. \n \nResponsible for generating various weekly/monthly/quarterly reports for business stakeholders. \n \n Business Data Analyst Intel Corporation May 2015  – Present (4 months) Currently working as a Business Data Analyst with Business Intelligence and Channel Operations Management team within Sales and Marketing group to support North America channel operations. \n \nResponsibilities include working with the internal and external stakeholders to identify business problems and working with the IT team to make sure that system being implemented meets business needs. This includes re-engineering some of the business process to improve quality and effectiveness. This also helps stakeholders make better business decisions. \n \nResponsible for generating various weekly/monthly/quarterly reports for business stakeholders. \n \n Software Engineer Intel Corporation May 2013  –  May 2015  (2 years 1 month) Software Engineer with Intel Custom Foundry group responsible for test program/ test class development using C++ for Post Si. Validation. Software Engineer Intel Corporation May 2013  –  May 2015  (2 years 1 month) Software Engineer with Intel Custom Foundry group responsible for test program/ test class development using C++ for Post Si. Validation. Software Engineer Intel Corporation January 2011  –  May 2013  (2 years 5 months) SW Engineer with the High Performance Computing team to validate upcoming Intel products using MIC (Many Integrated Core) architecture. \n \nValidated multiple components of the complex SW stack for multiple OS. Developed test plans and test cases (Basic Acceptance Tests, Functional Tests, stress/longevity tests, concurrent and cross component tests). Root caused and debugged failures in the Pre and Post silicon environment. Software Engineer Intel Corporation January 2011  –  May 2013  (2 years 5 months) SW Engineer with the High Performance Computing team to validate upcoming Intel products using MIC (Many Integrated Core) architecture. \n \nValidated multiple components of the complex SW stack for multiple OS. Developed test plans and test cases (Basic Acceptance Tests, Functional Tests, stress/longevity tests, concurrent and cross component tests). Root caused and debugged failures in the Pre and Post silicon environment. Platform Application Engineer Intel Corporation June 2010  –  January 2011  (8 months) Development and testing of debug tools for computer systems based on Intel's processor architecture. \n \nProviding technical support to Intel customers regarding the usage of these tools. Platform Application Engineer Intel Corporation June 2010  –  January 2011  (8 months) Development and testing of debug tools for computer systems based on Intel's processor architecture. \n \nProviding technical support to Intel customers regarding the usage of these tools. Lab Instructor CSU Sacramento September 2009  –  May 2010  (9 months) Lab Instructor for the Electrical Circuits class. Responsibilities include conducting lab sessions, supervising students and assisting them with their lab work including analysis of electrical circuits, schematic design, simulation and verification. \n \nDemonstrated usefulness of various laboratory tools including Digital Oscilloscope, Function Generator Lab Instructor CSU Sacramento September 2009  –  May 2010  (9 months) Lab Instructor for the Electrical Circuits class. Responsibilities include conducting lab sessions, supervising students and assisting them with their lab work including analysis of electrical circuits, schematic design, simulation and verification. \n \nDemonstrated usefulness of various laboratory tools including Digital Oscilloscope, Function Generator Software Engineer Evision Consulting Inc. July 2007  –  July 2009  (2 years 1 month) Worked as a consultant for different client organizations in various sectors including government, finance, insurance. \n \nParticipated in the complete software development life cycle including planning, requirement gathering, analysis, software design, development and testing of web-based software applications. \n \nWorked as a liaison between business users, customers and engineering team members to ensure that system being implemented meets business needs. Software Engineer Evision Consulting Inc. July 2007  –  July 2009  (2 years 1 month) Worked as a consultant for different client organizations in various sectors including government, finance, insurance. \n \nParticipated in the complete software development life cycle including planning, requirement gathering, analysis, software design, development and testing of web-based software applications. \n \nWorked as a liaison between business users, customers and engineering team members to ensure that system being implemented meets business needs. Skills Debugging Testing Logic Design Python Business Analysis Business Intelligence Perl Automation Business Process... Data Analysis Software Project... Software Engineering C C++ SQL Microsoft Excel C/C++ STL Data Structures Algorithms Use Case Analysis See 4+     See less Skills  Debugging Testing Logic Design Python Business Analysis Business Intelligence Perl Automation Business Process... Data Analysis Software Project... Software Engineering C C++ SQL Microsoft Excel C/C++ STL Data Structures Algorithms Use Case Analysis See 4+     See less Debugging Testing Logic Design Python Business Analysis Business Intelligence Perl Automation Business Process... Data Analysis Software Project... Software Engineering C C++ SQL Microsoft Excel C/C++ STL Data Structures Algorithms Use Case Analysis See 4+     See less Debugging Testing Logic Design Python Business Analysis Business Intelligence Perl Automation Business Process... Data Analysis Software Project... Software Engineering C C++ SQL Microsoft Excel C/C++ STL Data Structures Algorithms Use Case Analysis See 4+     See less Education California State University-Sacramento Master's,  Computer Engineering 2009  – 2011 California State University-Sacramento Master's,  Electrical and Electronics Engineering 2004  – 2007 California State University-Sacramento Master's,  Computer Engineering 2009  – 2011 California State University-Sacramento Master's,  Computer Engineering 2009  – 2011 California State University-Sacramento Master's,  Computer Engineering 2009  – 2011 California State University-Sacramento Master's,  Electrical and Electronics Engineering 2004  – 2007 California State University-Sacramento Master's,  Electrical and Electronics Engineering 2004  – 2007 California State University-Sacramento Master's,  Electrical and Electronics Engineering 2004  – 2007 ", "Experience Data Analyst Intel Corporation February 2014  – Present (1 year 7 months) San Francisco Bay Area Co Chair : Next(gen) Professionals Network(Intel) Intel Corporation January 2013  – Present (2 years 8 months) San Francisco Bay Area Member - Toastmasters Insiders Toastmasters International December 2012  – Present (2 years 9 months) San Francisco Bay Area Software Engineer Intel Corporation July 2012  –  February 2014  (1 year 8 months) San Francisco Bay Area Graduate Technical Intern Intel Corporation January 2012  –  May 2012  (5 months) Hillsboro, OR Senator - Student Body University of Southern California August 2011  –  May 2012  (10 months) Greater Los Angeles Area Intern Ambassador Intel Corporation August 2011  –  May 2012  (10 months) Greater Los Angeles Area Graduate Technical Intern Intel Corporation May 2011  –  August 2011  (4 months) Chandler, AZ Student Assistant ITS University of Southern California January 2011  –  May 2011  (5 months) Software Intern Intel India Technology Pvt Ltd December 2009  –  May 2010  (6 months) Software Intern Intel India Technology Pvt Ltd May 2008  –  November 2008  (7 months) Data Analyst Intel Corporation February 2014  – Present (1 year 7 months) San Francisco Bay Area Data Analyst Intel Corporation February 2014  – Present (1 year 7 months) San Francisco Bay Area Co Chair : Next(gen) Professionals Network(Intel) Intel Corporation January 2013  – Present (2 years 8 months) San Francisco Bay Area Co Chair : Next(gen) Professionals Network(Intel) Intel Corporation January 2013  – Present (2 years 8 months) San Francisco Bay Area Member - Toastmasters Insiders Toastmasters International December 2012  – Present (2 years 9 months) San Francisco Bay Area Member - Toastmasters Insiders Toastmasters International December 2012  – Present (2 years 9 months) San Francisco Bay Area Software Engineer Intel Corporation July 2012  –  February 2014  (1 year 8 months) San Francisco Bay Area Software Engineer Intel Corporation July 2012  –  February 2014  (1 year 8 months) San Francisco Bay Area Graduate Technical Intern Intel Corporation January 2012  –  May 2012  (5 months) Hillsboro, OR Graduate Technical Intern Intel Corporation January 2012  –  May 2012  (5 months) Hillsboro, OR Senator - Student Body University of Southern California August 2011  –  May 2012  (10 months) Greater Los Angeles Area Senator - Student Body University of Southern California August 2011  –  May 2012  (10 months) Greater Los Angeles Area Intern Ambassador Intel Corporation August 2011  –  May 2012  (10 months) Greater Los Angeles Area Intern Ambassador Intel Corporation August 2011  –  May 2012  (10 months) Greater Los Angeles Area Graduate Technical Intern Intel Corporation May 2011  –  August 2011  (4 months) Chandler, AZ Graduate Technical Intern Intel Corporation May 2011  –  August 2011  (4 months) Chandler, AZ Student Assistant ITS University of Southern California January 2011  –  May 2011  (5 months) Student Assistant ITS University of Southern California January 2011  –  May 2011  (5 months) Software Intern Intel India Technology Pvt Ltd December 2009  –  May 2010  (6 months) Software Intern Intel India Technology Pvt Ltd December 2009  –  May 2010  (6 months) Software Intern Intel India Technology Pvt Ltd May 2008  –  November 2008  (7 months) Software Intern Intel India Technology Pvt Ltd May 2008  –  November 2008  (7 months) Skills C++ Perl C Algorithms Hadoop Python Recommender Systems Android Development Java Data Structures .NET CSS HTML C# 4.0 WPF Development iPhone Application... Organization Of Events Team Leadership Agile Methodologies Apache Pig Big Data Analytics Software Engineering See 7+     See less Skills  C++ Perl C Algorithms Hadoop Python Recommender Systems Android Development Java Data Structures .NET CSS HTML C# 4.0 WPF Development iPhone Application... Organization Of Events Team Leadership Agile Methodologies Apache Pig Big Data Analytics Software Engineering See 7+     See less C++ Perl C Algorithms Hadoop Python Recommender Systems Android Development Java Data Structures .NET CSS HTML C# 4.0 WPF Development iPhone Application... Organization Of Events Team Leadership Agile Methodologies Apache Pig Big Data Analytics Software Engineering See 7+     See less C++ Perl C Algorithms Hadoop Python Recommender Systems Android Development Java Data Structures .NET CSS HTML C# 4.0 WPF Development iPhone Application... Organization Of Events Team Leadership Agile Methodologies Apache Pig Big Data Analytics Software Engineering See 7+     See less Education University of Southern California MS,  Computer Science 2010  – 2012 PSG College of Technology Masters,  Software Engineering 2005  – 2010 Loyola school University of Southern California MS,  Computer Science 2010  – 2012 University of Southern California MS,  Computer Science 2010  – 2012 University of Southern California MS,  Computer Science 2010  – 2012 PSG College of Technology Masters,  Software Engineering 2005  – 2010 PSG College of Technology Masters,  Software Engineering 2005  – 2010 PSG College of Technology Masters,  Software Engineering 2005  – 2010 Loyola school Loyola school Loyola school ", "Skills Integration Cross-functional Team... Process Improvement SharePoint Troubleshooting Vendor Management Microsoft SQL Server Program Management IT Operations Perl ITIL Software Development Testing Security Project Management Help Desk Support TCP/IP Product Management See 3+     See less Skills  Integration Cross-functional Team... Process Improvement SharePoint Troubleshooting Vendor Management Microsoft SQL Server Program Management IT Operations Perl ITIL Software Development Testing Security Project Management Help Desk Support TCP/IP Product Management See 3+     See less Integration Cross-functional Team... Process Improvement SharePoint Troubleshooting Vendor Management Microsoft SQL Server Program Management IT Operations Perl ITIL Software Development Testing Security Project Management Help Desk Support TCP/IP Product Management See 3+     See less Integration Cross-functional Team... Process Improvement SharePoint Troubleshooting Vendor Management Microsoft SQL Server Program Management IT Operations Perl ITIL Software Development Testing Security Project Management Help Desk Support TCP/IP Product Management See 3+     See less ", "Skills Cross-functional Team... Program Management Project Management Process Improvement Telecommunications Vendor Management Data Analysis Business Analysis SDLC Testing Business Intelligence Business Process Requirements Analysis Product Management Software Project... Integration See 1+     See less Skills  Cross-functional Team... Program Management Project Management Process Improvement Telecommunications Vendor Management Data Analysis Business Analysis SDLC Testing Business Intelligence Business Process Requirements Analysis Product Management Software Project... Integration See 1+     See less Cross-functional Team... Program Management Project Management Process Improvement Telecommunications Vendor Management Data Analysis Business Analysis SDLC Testing Business Intelligence Business Process Requirements Analysis Product Management Software Project... Integration See 1+     See less Cross-functional Team... Program Management Project Management Process Improvement Telecommunications Vendor Management Data Analysis Business Analysis SDLC Testing Business Intelligence Business Process Requirements Analysis Product Management Software Project... Integration See 1+     See less ", "Experience Data Analyst Intel Corporation June 2013  – Present (2 years 3 months) Israel Data Analyst Intel Corporation June 2013  – Present (2 years 3 months) Israel Data Analyst Intel Corporation June 2013  – Present (2 years 3 months) Israel Languages English Full professional proficiency Hebrew Native or bilingual proficiency English Full professional proficiency Hebrew Native or bilingual proficiency English Full professional proficiency Hebrew Native or bilingual proficiency Full professional proficiency Native or bilingual proficiency Skills phpMyAdmin JavaScript SQL Java HTML PHP CSS OOP Microsoft Office Microsoft Word Axure Business Intelligence PowerPoint Project Management Yii Priority Management SolidWorks Microsoft Excel Windows Microsoft Project See 5+     See less Skills  phpMyAdmin JavaScript SQL Java HTML PHP CSS OOP Microsoft Office Microsoft Word Axure Business Intelligence PowerPoint Project Management Yii Priority Management SolidWorks Microsoft Excel Windows Microsoft Project See 5+     See less phpMyAdmin JavaScript SQL Java HTML PHP CSS OOP Microsoft Office Microsoft Word Axure Business Intelligence PowerPoint Project Management Yii Priority Management SolidWorks Microsoft Excel Windows Microsoft Project See 5+     See less phpMyAdmin JavaScript SQL Java HTML PHP CSS OOP Microsoft Office Microsoft Word Axure Business Intelligence PowerPoint Project Management Yii Priority Management SolidWorks Microsoft Excel Windows Microsoft Project See 5+     See less Education Jerusalem College of Engineering Bachelor's Degree,  Industrial Engineering and Management ,  Information Systems , 88 2010  – 2014 Hebrew University Secondary School 2004  – 2007 Jerusalem College of Engineering Bachelor's Degree,  Industrial Engineering and Management ,  Information Systems , 88 2010  – 2014 Jerusalem College of Engineering Bachelor's Degree,  Industrial Engineering and Management ,  Information Systems , 88 2010  – 2014 Jerusalem College of Engineering Bachelor's Degree,  Industrial Engineering and Management ,  Information Systems , 88 2010  – 2014 Hebrew University Secondary School 2004  – 2007 Hebrew University Secondary School 2004  – 2007 Hebrew University Secondary School 2004  – 2007 ", "Experience Senior Data Analyst Intel Corporation March 2015  – Present (6 months) - Partnering with key stakeholders to perform deep dive analysis within data to identify insights that can be used to drive action plans \n- Present findings to senior management including analysis education, findings and recommended actions \n- Help to evolve the Customer Advocacy Team vision helping to ensure we address the long-term needs of our external and internal customers and that we turn our strategy into action Finance Team Lead Intel April 2011  –  February 2015  (3 years 11 months) Portland, Oregon Area Lead of several analysts day to day work management, coaching and development. Managed Intel Services Division (ISD) PNL. Responsible for ISD Close reporting and financial controls for the entire ISD business. Senior Financial Analyst Intel Corporation June 2006  –  March 2011  (4 years 10 months) Portland, Oregon Area Senior Data Analyst Intel Corporation March 2015  – Present (6 months) - Partnering with key stakeholders to perform deep dive analysis within data to identify insights that can be used to drive action plans \n- Present findings to senior management including analysis education, findings and recommended actions \n- Help to evolve the Customer Advocacy Team vision helping to ensure we address the long-term needs of our external and internal customers and that we turn our strategy into action Senior Data Analyst Intel Corporation March 2015  – Present (6 months) - Partnering with key stakeholders to perform deep dive analysis within data to identify insights that can be used to drive action plans \n- Present findings to senior management including analysis education, findings and recommended actions \n- Help to evolve the Customer Advocacy Team vision helping to ensure we address the long-term needs of our external and internal customers and that we turn our strategy into action Finance Team Lead Intel April 2011  –  February 2015  (3 years 11 months) Portland, Oregon Area Lead of several analysts day to day work management, coaching and development. Managed Intel Services Division (ISD) PNL. Responsible for ISD Close reporting and financial controls for the entire ISD business. Finance Team Lead Intel April 2011  –  February 2015  (3 years 11 months) Portland, Oregon Area Lead of several analysts day to day work management, coaching and development. Managed Intel Services Division (ISD) PNL. Responsible for ISD Close reporting and financial controls for the entire ISD business. Senior Financial Analyst Intel Corporation June 2006  –  March 2011  (4 years 10 months) Portland, Oregon Area Senior Financial Analyst Intel Corporation June 2006  –  March 2011  (4 years 10 months) Portland, Oregon Area Languages English Spanish English Spanish English Spanish Skills Financial Modeling Financial Analysis Forecasting Corporate Finance Strategic Financial... Financial Forecasting Cross-functional Team... Finance Sarbanes-Oxley Act Financial Reporting Competitive Analysis Capital Budgeting Variance Analysis Process Improvement Cost Accounting Budgets Management Strategy Pricing Revenue Recognition See 5+     See less Skills  Financial Modeling Financial Analysis Forecasting Corporate Finance Strategic Financial... Financial Forecasting Cross-functional Team... Finance Sarbanes-Oxley Act Financial Reporting Competitive Analysis Capital Budgeting Variance Analysis Process Improvement Cost Accounting Budgets Management Strategy Pricing Revenue Recognition See 5+     See less Financial Modeling Financial Analysis Forecasting Corporate Finance Strategic Financial... Financial Forecasting Cross-functional Team... Finance Sarbanes-Oxley Act Financial Reporting Competitive Analysis Capital Budgeting Variance Analysis Process Improvement Cost Accounting Budgets Management Strategy Pricing Revenue Recognition See 5+     See less Financial Modeling Financial Analysis Forecasting Corporate Finance Strategic Financial... Financial Forecasting Cross-functional Team... Finance Sarbanes-Oxley Act Financial Reporting Competitive Analysis Capital Budgeting Variance Analysis Process Improvement Cost Accounting Budgets Management Strategy Pricing Revenue Recognition See 5+     See less Education Arizona State University, W. P. Carey School of Business Master of Business Administration (MBA),  International Business 2011  – 2012 Brigham Young University Bachelor of Science (BS),  Business Management ,  Finance 2000  – 2006 Arizona State University, W. P. Carey School of Business Master of Business Administration (MBA),  International Business 2011  – 2012 Arizona State University, W. P. Carey School of Business Master of Business Administration (MBA),  International Business 2011  – 2012 Arizona State University, W. P. Carey School of Business Master of Business Administration (MBA),  International Business 2011  – 2012 Brigham Young University Bachelor of Science (BS),  Business Management ,  Finance 2000  – 2006 Brigham Young University Bachelor of Science (BS),  Business Management ,  Finance 2000  – 2006 Brigham Young University Bachelor of Science (BS),  Business Management ,  Finance 2000  – 2006 ", "Languages English Native or bilingual proficiency Spanish Native or bilingual proficiency English Native or bilingual proficiency Spanish Native or bilingual proficiency English Native or bilingual proficiency Spanish Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Machine Learning Recommender Systems Data Mining Artificial Intelligence Software Engineering C++ Java Visual Basic Microsoft Certified... Linux Computer Science Algorithms Research Agile Methodologies Programming Skills  Machine Learning Recommender Systems Data Mining Artificial Intelligence Software Engineering C++ Java Visual Basic Microsoft Certified... Linux Computer Science Algorithms Research Agile Methodologies Programming Machine Learning Recommender Systems Data Mining Artificial Intelligence Software Engineering C++ Java Visual Basic Microsoft Certified... Linux Computer Science Algorithms Research Agile Methodologies Programming Machine Learning Recommender Systems Data Mining Artificial Intelligence Software Engineering C++ Java Visual Basic Microsoft Certified... Linux Computer Science Algorithms Research Agile Methodologies Programming Honors & Awards ", "Summary Agile, flexible, creative, a self-starter and quick study \n \nA creative problem solver known for producing innovative solutions to everyday problems. With the mind of an engineer and the heart of a scientist, an unusual degree in “Entrepreneurship” opens my eyes to the big picture while technical prowess and attention to detail ensure the utmost quality of work. Experienced business solutions developer and recent settler in the Portland area, eager to apply my knowledge and talent to any task, learn new skills, do great work for an interesting company, and work with excellent people along the way. \n \n \nAt home in a sea of data and comfortable in unpredictable and demanding settings \n \nInspired by great teams and excellence in leadership \n \nTechnical, decisive, and passionate about science and technology \n \nDedicated to my work and committed to excellence Summary Agile, flexible, creative, a self-starter and quick study \n \nA creative problem solver known for producing innovative solutions to everyday problems. With the mind of an engineer and the heart of a scientist, an unusual degree in “Entrepreneurship” opens my eyes to the big picture while technical prowess and attention to detail ensure the utmost quality of work. Experienced business solutions developer and recent settler in the Portland area, eager to apply my knowledge and talent to any task, learn new skills, do great work for an interesting company, and work with excellent people along the way. \n \n \nAt home in a sea of data and comfortable in unpredictable and demanding settings \n \nInspired by great teams and excellence in leadership \n \nTechnical, decisive, and passionate about science and technology \n \nDedicated to my work and committed to excellence Agile, flexible, creative, a self-starter and quick study \n \nA creative problem solver known for producing innovative solutions to everyday problems. With the mind of an engineer and the heart of a scientist, an unusual degree in “Entrepreneurship” opens my eyes to the big picture while technical prowess and attention to detail ensure the utmost quality of work. Experienced business solutions developer and recent settler in the Portland area, eager to apply my knowledge and talent to any task, learn new skills, do great work for an interesting company, and work with excellent people along the way. \n \n \nAt home in a sea of data and comfortable in unpredictable and demanding settings \n \nInspired by great teams and excellence in leadership \n \nTechnical, decisive, and passionate about science and technology \n \nDedicated to my work and committed to excellence Agile, flexible, creative, a self-starter and quick study \n \nA creative problem solver known for producing innovative solutions to everyday problems. With the mind of an engineer and the heart of a scientist, an unusual degree in “Entrepreneurship” opens my eyes to the big picture while technical prowess and attention to detail ensure the utmost quality of work. Experienced business solutions developer and recent settler in the Portland area, eager to apply my knowledge and talent to any task, learn new skills, do great work for an interesting company, and work with excellent people along the way. \n \n \nAt home in a sea of data and comfortable in unpredictable and demanding settings \n \nInspired by great teams and excellence in leadership \n \nTechnical, decisive, and passionate about science and technology \n \nDedicated to my work and committed to excellence Experience Data Analyst Intel Corporation July 2015  – Present (2 months) Hillsboro, OR Developing proof-of-concept analytics and data visualizations for the Asset 360 pilot program. The program is aimed at saving millions of dollars by creating a sort of library or pool of high-end equipment for use by the labs. Rather than each justified requisition leading to procurement, we're tracking usage statistics to allow idle equipment to be shared between different business groups. My role primarily involves digging into the usage and requisition data to how much could be saved by the program. Financial Analyst Nike January 2015  –  June 2015  (6 months) Beaverton, Oregon Provided analytical and database management support to a team of about 20 financial analysts within the Global Footwear Margin Planning group. Built high level reporting automations and helped streamline standardized reporting cycles. Created highly customized and dynamic ad hock reports for Sr. Financial Management. Production Analyst Stanley Hydraulic Tools November 2014  –  December 2014  (2 months) Portland, Oregon Area Hydraulic tools OEM: large scale tools for construction, demolition, and maintenance. \n \n6 week contract - Provided year-end analytical support to supply chain and production scheduling personnel. Created new reports and flow charts, Developed productivity and efficiency enhancements to MRP and Production Planning. Planner/Analyst Astronic EMS 2012  –  2014  (2 years) Aliso Viejo Contract electronics manufacturing, embedded computer systems for aerospace, medical, and military applications. \n \nWorked primarily in supply chain, financial analytics, and change management within interdisciplinary teams of amazing people. Business Analyst Center for Entrepreneurship Curricular Experience 2009  –  2011  (2 years) Fullerton, CA High-impact consulting teamwork for varied enterprises and municipal governments \n \nJuggled cross-functional teams on multiple projects simultaneously, engaged with client executives and stakeholders to ensure goals were clearly defined and met. Proprietor/Owner Pool Perfect 2008  –  2011  (3 years) Covina Entrepreneurial small business focused on pool maintenance, repair, and upgrade contracts \n \nBuilt a small business from the ground up with no outside financing. Developed strategic partnerships with related companies. Built a solid reputation for referral-based business growth. Data Analyst Intel Corporation July 2015  – Present (2 months) Hillsboro, OR Developing proof-of-concept analytics and data visualizations for the Asset 360 pilot program. The program is aimed at saving millions of dollars by creating a sort of library or pool of high-end equipment for use by the labs. Rather than each justified requisition leading to procurement, we're tracking usage statistics to allow idle equipment to be shared between different business groups. My role primarily involves digging into the usage and requisition data to how much could be saved by the program. Data Analyst Intel Corporation July 2015  – Present (2 months) Hillsboro, OR Developing proof-of-concept analytics and data visualizations for the Asset 360 pilot program. The program is aimed at saving millions of dollars by creating a sort of library or pool of high-end equipment for use by the labs. Rather than each justified requisition leading to procurement, we're tracking usage statistics to allow idle equipment to be shared between different business groups. My role primarily involves digging into the usage and requisition data to how much could be saved by the program. Financial Analyst Nike January 2015  –  June 2015  (6 months) Beaverton, Oregon Provided analytical and database management support to a team of about 20 financial analysts within the Global Footwear Margin Planning group. Built high level reporting automations and helped streamline standardized reporting cycles. Created highly customized and dynamic ad hock reports for Sr. Financial Management. Financial Analyst Nike January 2015  –  June 2015  (6 months) Beaverton, Oregon Provided analytical and database management support to a team of about 20 financial analysts within the Global Footwear Margin Planning group. Built high level reporting automations and helped streamline standardized reporting cycles. Created highly customized and dynamic ad hock reports for Sr. Financial Management. Production Analyst Stanley Hydraulic Tools November 2014  –  December 2014  (2 months) Portland, Oregon Area Hydraulic tools OEM: large scale tools for construction, demolition, and maintenance. \n \n6 week contract - Provided year-end analytical support to supply chain and production scheduling personnel. Created new reports and flow charts, Developed productivity and efficiency enhancements to MRP and Production Planning. Production Analyst Stanley Hydraulic Tools November 2014  –  December 2014  (2 months) Portland, Oregon Area Hydraulic tools OEM: large scale tools for construction, demolition, and maintenance. \n \n6 week contract - Provided year-end analytical support to supply chain and production scheduling personnel. Created new reports and flow charts, Developed productivity and efficiency enhancements to MRP and Production Planning. Planner/Analyst Astronic EMS 2012  –  2014  (2 years) Aliso Viejo Contract electronics manufacturing, embedded computer systems for aerospace, medical, and military applications. \n \nWorked primarily in supply chain, financial analytics, and change management within interdisciplinary teams of amazing people. Planner/Analyst Astronic EMS 2012  –  2014  (2 years) Aliso Viejo Contract electronics manufacturing, embedded computer systems for aerospace, medical, and military applications. \n \nWorked primarily in supply chain, financial analytics, and change management within interdisciplinary teams of amazing people. Business Analyst Center for Entrepreneurship Curricular Experience 2009  –  2011  (2 years) Fullerton, CA High-impact consulting teamwork for varied enterprises and municipal governments \n \nJuggled cross-functional teams on multiple projects simultaneously, engaged with client executives and stakeholders to ensure goals were clearly defined and met. Business Analyst Center for Entrepreneurship Curricular Experience 2009  –  2011  (2 years) Fullerton, CA High-impact consulting teamwork for varied enterprises and municipal governments \n \nJuggled cross-functional teams on multiple projects simultaneously, engaged with client executives and stakeholders to ensure goals were clearly defined and met. Proprietor/Owner Pool Perfect 2008  –  2011  (3 years) Covina Entrepreneurial small business focused on pool maintenance, repair, and upgrade contracts \n \nBuilt a small business from the ground up with no outside financing. Developed strategic partnerships with related companies. Built a solid reputation for referral-based business growth. Proprietor/Owner Pool Perfect 2008  –  2011  (3 years) Covina Entrepreneurial small business focused on pool maintenance, repair, and upgrade contracts \n \nBuilt a small business from the ground up with no outside financing. Developed strategic partnerships with related companies. Built a solid reputation for referral-based business growth. Skills Entrepreneurship Strategic Planning Business Strategy Leadership Management Consulting Start-ups Strategy Business Development Data Analysis Business Analysis Competitive Analysis Financial Analysis Small Business... C# VBA Microsoft Excel Microsoft Office Team Leadership New Business Development Management Visual Studio Visual C# Marketing Leadership Development Business Planning Product Development Consulting Analysis Research Small Business Teaching PowerPoint See 17+     See less Skills  Entrepreneurship Strategic Planning Business Strategy Leadership Management Consulting Start-ups Strategy Business Development Data Analysis Business Analysis Competitive Analysis Financial Analysis Small Business... C# VBA Microsoft Excel Microsoft Office Team Leadership New Business Development Management Visual Studio Visual C# Marketing Leadership Development Business Planning Product Development Consulting Analysis Research Small Business Teaching PowerPoint See 17+     See less Entrepreneurship Strategic Planning Business Strategy Leadership Management Consulting Start-ups Strategy Business Development Data Analysis Business Analysis Competitive Analysis Financial Analysis Small Business... C# VBA Microsoft Excel Microsoft Office Team Leadership New Business Development Management Visual Studio Visual C# Marketing Leadership Development Business Planning Product Development Consulting Analysis Research Small Business Teaching PowerPoint See 17+     See less Entrepreneurship Strategic Planning Business Strategy Leadership Management Consulting Start-ups Strategy Business Development Data Analysis Business Analysis Competitive Analysis Financial Analysis Small Business... C# VBA Microsoft Excel Microsoft Office Team Leadership New Business Development Management Visual Studio Visual C# Marketing Leadership Development Business Planning Product Development Consulting Analysis Research Small Business Teaching PowerPoint See 17+     See less Education California State University-Fullerton Bachelor of Business Administration (B.B.A.),  Entrepreneurship/Entrepreneurial Studies 2009  – 2012 Activities and Societies:  CSUF Center for Entrepreneurship California State University-Fullerton Bachelor's degree,  Business Administration and Management , General California State University-Fullerton Bachelor of Business Administration (B.B.A.),  Entrepreneurship/Entrepreneurial Studies 2009  – 2012 Activities and Societies:  CSUF Center for Entrepreneurship California State University-Fullerton Bachelor of Business Administration (B.B.A.),  Entrepreneurship/Entrepreneurial Studies 2009  – 2012 Activities and Societies:  CSUF Center for Entrepreneurship California State University-Fullerton Bachelor of Business Administration (B.B.A.),  Entrepreneurship/Entrepreneurial Studies 2009  – 2012 Activities and Societies:  CSUF Center for Entrepreneurship California State University-Fullerton Bachelor's degree,  Business Administration and Management , General California State University-Fullerton Bachelor's degree,  Business Administration and Management , General California State University-Fullerton Bachelor's degree,  Business Administration and Management , General ", "Experience FIS Data Analyst Intel Corporation January 2011  – Present (4 years 8 months) FIS Data Analyst Intel Corporation January 2011  – Present (4 years 8 months) FIS Data Analyst Intel Corporation January 2011  – Present (4 years 8 months) ", "Experience PMO Intel Corporation July 2013  – Present (2 years 2 months) Jerusalem Data Analyst Intel Corporation August 2010  – Present (5 years 1 month) I'm responsible on Technical Data Analysis \nData Mining, post mortem possesses, Projection picture  Student position in Intel at ProductivityApps group belongs to the Engineering Computing department Intel Corporation August 2010  –  July 2013  (3 years) Israel Student in the ISEC Productivity Application team, supporting LAD team in IDC, and responsible for NetBatch computing administration PMO Intel Corporation July 2013  – Present (2 years 2 months) Jerusalem PMO Intel Corporation July 2013  – Present (2 years 2 months) Jerusalem Data Analyst Intel Corporation August 2010  – Present (5 years 1 month) I'm responsible on Technical Data Analysis \nData Mining, post mortem possesses, Projection picture  Data Analyst Intel Corporation August 2010  – Present (5 years 1 month) I'm responsible on Technical Data Analysis \nData Mining, post mortem possesses, Projection picture  Student position in Intel at ProductivityApps group belongs to the Engineering Computing department Intel Corporation August 2010  –  July 2013  (3 years) Israel Student in the ISEC Productivity Application team, supporting LAD team in IDC, and responsible for NetBatch computing administration Student position in Intel at ProductivityApps group belongs to the Engineering Computing department Intel Corporation August 2010  –  July 2013  (3 years) Israel Student in the ISEC Productivity Application team, supporting LAD team in IDC, and responsible for NetBatch computing administration Languages Hebrew English Hebrew English Hebrew English Skills Semiconductors ASIC SoC C Matlab Algorithms Perl Script Unix Statistics Mathematics Simulations Machine Learning Data Mining Embedded Systems Programming R&D Perl Databases See 3+     See less Skills  Semiconductors ASIC SoC C Matlab Algorithms Perl Script Unix Statistics Mathematics Simulations Machine Learning Data Mining Embedded Systems Programming R&D Perl Databases See 3+     See less Semiconductors ASIC SoC C Matlab Algorithms Perl Script Unix Statistics Mathematics Simulations Machine Learning Data Mining Embedded Systems Programming R&D Perl Databases See 3+     See less Semiconductors ASIC SoC C Matlab Algorithms Perl Script Unix Statistics Mathematics Simulations Machine Learning Data Mining Embedded Systems Programming R&D Perl Databases See 3+     See less Education Technion - Israel Institute of Technology Engineer, Management and Industrial Engineering - IS Expert,  Machine Learning, Data Mining 2008  – 2013 Mentoring new students \nTutor for basic course - Algebra, C, Statisticsת Discrete Mathematics Activities and Societies:  Student tutor Technion - Israel Institute of Technology Engineer, Management and Industrial Engineering - IS Expert,  Machine Learning, Data Mining 2008  – 2013 Mentoring new students \nTutor for basic course - Algebra, C, Statisticsת Discrete Mathematics Activities and Societies:  Student tutor Technion - Israel Institute of Technology Engineer, Management and Industrial Engineering - IS Expert,  Machine Learning, Data Mining 2008  – 2013 Mentoring new students \nTutor for basic course - Algebra, C, Statisticsת Discrete Mathematics Activities and Societies:  Student tutor Technion - Israel Institute of Technology Engineer, Management and Industrial Engineering - IS Expert,  Machine Learning, Data Mining 2008  – 2013 Mentoring new students \nTutor for basic course - Algebra, C, Statisticsת Discrete Mathematics Activities and Societies:  Student tutor ", "Experience Data Analyst Intel Corporation May 2014  – Present (1 year 4 months) Hillsboro, OR •\tCreated a SQL server database hosting all pieces of data relating to the Professional Development Team. Wrote stored procedures to update database from upstream source, provided data quality checks on said data. \n•\tUsed SQL Server Analysis Services (SSAS) to create OLAP data cubes. Created PowerPivot reports in excel to implement dynamically updating reports which stay current to the database upon opening.  \n•\tWorked with teammates to design recommendation algorithms which return ideal classes based upon the population sample. Successfully implemented these algorithms into MSBI reports to deliver a new level of efficiency to training portfolio managers \n•\tPerformed correlation analysis of multiple variables to validate evaluaiton data and other sources. Variables include commissions, customer surveys employee performance and time on job. \n•\tTransitioned from designing and implementing analytics program to also include managing the project. Created and validated with manager a quarterly plan for the program. Online Sales Center Data Analyst Intel Corporation December 2013  –  May 2014  (6 months) Hillsboro, OR •\tReported quarterly results of online sales centers to executive management. \n•\tProvided strategic insight to program managers through analysis of sales data. Including but not limited to: promotion effectiveness, trend analysis and predictive analytics utilization rate. \n•\tManaged the pilot of a sales enablement tool to several sales teams. Quantitatively measured the success of the tool and made recommendation how to move forward with a large scale deployment Data Analyst Kelly Services May 2011  –  December 2013  (2 years 8 months) Hillsboro, OR •\tDesigned, validated, and delivered reporting dashboards that report information to stakeholders.  \n•\tCreated a tool which reduced processing time of a data entry procedure by half.  \n•\tAutomated several data processes through the use of stored SQL procedures, eliminating human touches. \n•\tManaged a team of contract and third party workers, including: directing flow of work to team based on ability of individual members, planning the movement of processes and responsibilities between teams, interviewing and making hiring decision for team members, and training employees. planning Waterford Wedgwood PLC 2008  –  2008  (less than a year) planning Waterford Wedgwood PLC 2008  –  2008  (less than a year) Data Analyst Intel Corporation May 2014  – Present (1 year 4 months) Hillsboro, OR •\tCreated a SQL server database hosting all pieces of data relating to the Professional Development Team. Wrote stored procedures to update database from upstream source, provided data quality checks on said data. \n•\tUsed SQL Server Analysis Services (SSAS) to create OLAP data cubes. Created PowerPivot reports in excel to implement dynamically updating reports which stay current to the database upon opening.  \n•\tWorked with teammates to design recommendation algorithms which return ideal classes based upon the population sample. Successfully implemented these algorithms into MSBI reports to deliver a new level of efficiency to training portfolio managers \n•\tPerformed correlation analysis of multiple variables to validate evaluaiton data and other sources. Variables include commissions, customer surveys employee performance and time on job. \n•\tTransitioned from designing and implementing analytics program to also include managing the project. Created and validated with manager a quarterly plan for the program. Data Analyst Intel Corporation May 2014  – Present (1 year 4 months) Hillsboro, OR •\tCreated a SQL server database hosting all pieces of data relating to the Professional Development Team. Wrote stored procedures to update database from upstream source, provided data quality checks on said data. \n•\tUsed SQL Server Analysis Services (SSAS) to create OLAP data cubes. Created PowerPivot reports in excel to implement dynamically updating reports which stay current to the database upon opening.  \n•\tWorked with teammates to design recommendation algorithms which return ideal classes based upon the population sample. Successfully implemented these algorithms into MSBI reports to deliver a new level of efficiency to training portfolio managers \n•\tPerformed correlation analysis of multiple variables to validate evaluaiton data and other sources. Variables include commissions, customer surveys employee performance and time on job. \n•\tTransitioned from designing and implementing analytics program to also include managing the project. Created and validated with manager a quarterly plan for the program. Online Sales Center Data Analyst Intel Corporation December 2013  –  May 2014  (6 months) Hillsboro, OR •\tReported quarterly results of online sales centers to executive management. \n•\tProvided strategic insight to program managers through analysis of sales data. Including but not limited to: promotion effectiveness, trend analysis and predictive analytics utilization rate. \n•\tManaged the pilot of a sales enablement tool to several sales teams. Quantitatively measured the success of the tool and made recommendation how to move forward with a large scale deployment Online Sales Center Data Analyst Intel Corporation December 2013  –  May 2014  (6 months) Hillsboro, OR •\tReported quarterly results of online sales centers to executive management. \n•\tProvided strategic insight to program managers through analysis of sales data. Including but not limited to: promotion effectiveness, trend analysis and predictive analytics utilization rate. \n•\tManaged the pilot of a sales enablement tool to several sales teams. Quantitatively measured the success of the tool and made recommendation how to move forward with a large scale deployment Data Analyst Kelly Services May 2011  –  December 2013  (2 years 8 months) Hillsboro, OR •\tDesigned, validated, and delivered reporting dashboards that report information to stakeholders.  \n•\tCreated a tool which reduced processing time of a data entry procedure by half.  \n•\tAutomated several data processes through the use of stored SQL procedures, eliminating human touches. \n•\tManaged a team of contract and third party workers, including: directing flow of work to team based on ability of individual members, planning the movement of processes and responsibilities between teams, interviewing and making hiring decision for team members, and training employees. Data Analyst Kelly Services May 2011  –  December 2013  (2 years 8 months) Hillsboro, OR •\tDesigned, validated, and delivered reporting dashboards that report information to stakeholders.  \n•\tCreated a tool which reduced processing time of a data entry procedure by half.  \n•\tAutomated several data processes through the use of stored SQL procedures, eliminating human touches. \n•\tManaged a team of contract and third party workers, including: directing flow of work to team based on ability of individual members, planning the movement of processes and responsibilities between teams, interviewing and making hiring decision for team members, and training employees. planning Waterford Wedgwood PLC 2008  –  2008  (less than a year) planning Waterford Wedgwood PLC 2008  –  2008  (less than a year) planning Waterford Wedgwood PLC 2008  –  2008  (less than a year) planning Waterford Wedgwood PLC 2008  –  2008  (less than a year) Skills Data Analysis Tableau Database Design Lean Manufacturing Industrial Engineering Supply Chain Supply Chain Management Process Engineering Value Stream Mapping Continuous Improvement Process Improvement Skills  Data Analysis Tableau Database Design Lean Manufacturing Industrial Engineering Supply Chain Supply Chain Management Process Engineering Value Stream Mapping Continuous Improvement Process Improvement Data Analysis Tableau Database Design Lean Manufacturing Industrial Engineering Supply Chain Supply Chain Management Process Engineering Value Stream Mapping Continuous Improvement Process Improvement Data Analysis Tableau Database Design Lean Manufacturing Industrial Engineering Supply Chain Supply Chain Management Process Engineering Value Stream Mapping Continuous Improvement Process Improvement Education Northeastern University BS,  Industrial Engineering 2004  – 2009 MVRHS Northeastern University BS,  Industrial Engineering 2004  – 2009 Northeastern University BS,  Industrial Engineering 2004  – 2009 Northeastern University BS,  Industrial Engineering 2004  – 2009 MVRHS MVRHS MVRHS ", "Experience data analyst Intel Corporation OPERATION & POLICY ANALYST 2/INFORMATION SYSTEM SPECIALIST PERS March 2007  –  August 2010  (3 years 6 months) Managed the delivery of support in the development of recovery plans, to include data gathering, visibility development, and monitoring plan status for anything that could impact cost, schedule, resources or delivery. Assisted in the identification and implementation of process improvements; analyzed current processes and utilizing various methodologies to maximize the efficiency of equipment and personnel, and support company improvement initiatives. \nPrepared, analyzed, and interpreted financial reports for Benefit Payment Department (BPD) managers.  \nEnsured appropriate applications infrastructure existed for all development and production work, and participated in the evaluation and selection of programming languages, tools, and methodologies. \nProactively monitored technical directions and strategies of existing database systems and tools.  \nResearched data within the old RIMS system and transferred data into the new system, jClarety.  \nReviewed corrections and enhancements to maintain compliance with federal and state regulations and laws. \nObtained data from the Retirement Information Management System (RIMS) database; produced user reports. \nMaintained the research database; updated and upgraded it as needed to ensure safe storage of data. \nActed as a member of the FileNet developer team; created user workflows; debugged code in Java language when errors occurred; maintained the FileNet environment to ensure all workflows were in correct locations. \nResearched the rules and policy on workflow with BOPA, PMO and business analysts. \nInterpreted and analyzed financial and demographic data to resolve data integrity conflicts between the legacy system (RIMS) and the new system. \nGathered data required to conduct analyses from several sources, compiled it together in prescribed format and entered the data; provided technical guidance and support for development activities. eWIN DATA ADMINISTRATOR Intel Corporation May 2005  –  May 2006  (1 year 1 month) Implemented guidance and support to the Intel world-wide sales force in the use of the eWIN web portal for the purpose of capturing and reporting sales data; coded and tested how data was to be stored, amount of space needed, and access methods. Performed data management, workflow process analysis, and training. \nManaged the planning, development and preparation of eWIN training for the sales force regarding its use as a communication sales tool; maintained and updated all system activities. \nSet-up and maintained the program to run daily reports and quarterly sales report for management. \nOversaw the consolidation and standardizing of all data submitted on the eWIN web portal; identified and resolved any issues that arose. \nDeveloped and conduct quality assurance calculations and reviews of computer program outputs to ensure computers were performing as programmed. \nProduced statistical information, performance metrics, and summary reports to communicate progress. \nMeasured and reported production volumes, timelines, and quality assurance achievements. \nRepresented production and tooling operations in the support of scheduling, reducing inventory, and meeting cost and scheduling commitments. \nMaintained the research database; updated and upgraded it as needed to ensure safe storage of data. \nGathered and compiled data required to conduct analysis from several sources; entered data into several data analysis software systems; prepared analysis reports and answered any queries, complaints or suggestions. \nDetermined methodologies and procedures for carrying out effective data analysis. \nCoordinated and facilitated training to staff members on the new systems implemented. DATA ANALYST Vanguard EMS, Inc July 2004  –  March 2005  (9 months) Assisted in the development of integrated tools, production master schedules, documents, and flow plans. Oversaw the implementation of improvements to processes through the analysis of current processes used to maximize the efficiency of equipment and personnel; supported company improvement initiatives. \nCreated and generated labor hour estimates for new or revised production and tooling work packages. \nAnalyzed and delivered critical data to upper management to make informed product launch decisions. \nConsolidated various types of data models from different customer sources in order to partner directly with customers in finalilzing the deployment model; providing actual cost report to upper management. \nReceived, verified, modified and stored incoming customer data; Bills of Material, CAD data, drawings and all other product-related information for new product introductions, engineering change orders and quote processes. \nDesigned and implemented data correction routines, data collection procedures, and various tools. \nDeveloped and performed root cause analyses that led to the prevention of inaccurate data or calculations. DATA ANALYST Benchmark August 2000  –  May 2003  (2 years 10 months) Executed the administration of the enterprise application Production Feedback System (PFS) to provide forecast production data; effectively increased the quality assurance of product line based on the report data extracted from the PFS. \nInitiated the debugging of any issues caused by the PFS while controlling the product line. \nProvided extensive customer service, administrative, and office management support.  \nInstalled new and upgraded existing PCs for staff. data analyst Intel Corporation data analyst Intel Corporation OPERATION & POLICY ANALYST 2/INFORMATION SYSTEM SPECIALIST PERS March 2007  –  August 2010  (3 years 6 months) Managed the delivery of support in the development of recovery plans, to include data gathering, visibility development, and monitoring plan status for anything that could impact cost, schedule, resources or delivery. Assisted in the identification and implementation of process improvements; analyzed current processes and utilizing various methodologies to maximize the efficiency of equipment and personnel, and support company improvement initiatives. \nPrepared, analyzed, and interpreted financial reports for Benefit Payment Department (BPD) managers.  \nEnsured appropriate applications infrastructure existed for all development and production work, and participated in the evaluation and selection of programming languages, tools, and methodologies. \nProactively monitored technical directions and strategies of existing database systems and tools.  \nResearched data within the old RIMS system and transferred data into the new system, jClarety.  \nReviewed corrections and enhancements to maintain compliance with federal and state regulations and laws. \nObtained data from the Retirement Information Management System (RIMS) database; produced user reports. \nMaintained the research database; updated and upgraded it as needed to ensure safe storage of data. \nActed as a member of the FileNet developer team; created user workflows; debugged code in Java language when errors occurred; maintained the FileNet environment to ensure all workflows were in correct locations. \nResearched the rules and policy on workflow with BOPA, PMO and business analysts. \nInterpreted and analyzed financial and demographic data to resolve data integrity conflicts between the legacy system (RIMS) and the new system. \nGathered data required to conduct analyses from several sources, compiled it together in prescribed format and entered the data; provided technical guidance and support for development activities. OPERATION & POLICY ANALYST 2/INFORMATION SYSTEM SPECIALIST PERS March 2007  –  August 2010  (3 years 6 months) Managed the delivery of support in the development of recovery plans, to include data gathering, visibility development, and monitoring plan status for anything that could impact cost, schedule, resources or delivery. Assisted in the identification and implementation of process improvements; analyzed current processes and utilizing various methodologies to maximize the efficiency of equipment and personnel, and support company improvement initiatives. \nPrepared, analyzed, and interpreted financial reports for Benefit Payment Department (BPD) managers.  \nEnsured appropriate applications infrastructure existed for all development and production work, and participated in the evaluation and selection of programming languages, tools, and methodologies. \nProactively monitored technical directions and strategies of existing database systems and tools.  \nResearched data within the old RIMS system and transferred data into the new system, jClarety.  \nReviewed corrections and enhancements to maintain compliance with federal and state regulations and laws. \nObtained data from the Retirement Information Management System (RIMS) database; produced user reports. \nMaintained the research database; updated and upgraded it as needed to ensure safe storage of data. \nActed as a member of the FileNet developer team; created user workflows; debugged code in Java language when errors occurred; maintained the FileNet environment to ensure all workflows were in correct locations. \nResearched the rules and policy on workflow with BOPA, PMO and business analysts. \nInterpreted and analyzed financial and demographic data to resolve data integrity conflicts between the legacy system (RIMS) and the new system. \nGathered data required to conduct analyses from several sources, compiled it together in prescribed format and entered the data; provided technical guidance and support for development activities. eWIN DATA ADMINISTRATOR Intel Corporation May 2005  –  May 2006  (1 year 1 month) Implemented guidance and support to the Intel world-wide sales force in the use of the eWIN web portal for the purpose of capturing and reporting sales data; coded and tested how data was to be stored, amount of space needed, and access methods. Performed data management, workflow process analysis, and training. \nManaged the planning, development and preparation of eWIN training for the sales force regarding its use as a communication sales tool; maintained and updated all system activities. \nSet-up and maintained the program to run daily reports and quarterly sales report for management. \nOversaw the consolidation and standardizing of all data submitted on the eWIN web portal; identified and resolved any issues that arose. \nDeveloped and conduct quality assurance calculations and reviews of computer program outputs to ensure computers were performing as programmed. \nProduced statistical information, performance metrics, and summary reports to communicate progress. \nMeasured and reported production volumes, timelines, and quality assurance achievements. \nRepresented production and tooling operations in the support of scheduling, reducing inventory, and meeting cost and scheduling commitments. \nMaintained the research database; updated and upgraded it as needed to ensure safe storage of data. \nGathered and compiled data required to conduct analysis from several sources; entered data into several data analysis software systems; prepared analysis reports and answered any queries, complaints or suggestions. \nDetermined methodologies and procedures for carrying out effective data analysis. \nCoordinated and facilitated training to staff members on the new systems implemented. eWIN DATA ADMINISTRATOR Intel Corporation May 2005  –  May 2006  (1 year 1 month) Implemented guidance and support to the Intel world-wide sales force in the use of the eWIN web portal for the purpose of capturing and reporting sales data; coded and tested how data was to be stored, amount of space needed, and access methods. Performed data management, workflow process analysis, and training. \nManaged the planning, development and preparation of eWIN training for the sales force regarding its use as a communication sales tool; maintained and updated all system activities. \nSet-up and maintained the program to run daily reports and quarterly sales report for management. \nOversaw the consolidation and standardizing of all data submitted on the eWIN web portal; identified and resolved any issues that arose. \nDeveloped and conduct quality assurance calculations and reviews of computer program outputs to ensure computers were performing as programmed. \nProduced statistical information, performance metrics, and summary reports to communicate progress. \nMeasured and reported production volumes, timelines, and quality assurance achievements. \nRepresented production and tooling operations in the support of scheduling, reducing inventory, and meeting cost and scheduling commitments. \nMaintained the research database; updated and upgraded it as needed to ensure safe storage of data. \nGathered and compiled data required to conduct analysis from several sources; entered data into several data analysis software systems; prepared analysis reports and answered any queries, complaints or suggestions. \nDetermined methodologies and procedures for carrying out effective data analysis. \nCoordinated and facilitated training to staff members on the new systems implemented. DATA ANALYST Vanguard EMS, Inc July 2004  –  March 2005  (9 months) Assisted in the development of integrated tools, production master schedules, documents, and flow plans. Oversaw the implementation of improvements to processes through the analysis of current processes used to maximize the efficiency of equipment and personnel; supported company improvement initiatives. \nCreated and generated labor hour estimates for new or revised production and tooling work packages. \nAnalyzed and delivered critical data to upper management to make informed product launch decisions. \nConsolidated various types of data models from different customer sources in order to partner directly with customers in finalilzing the deployment model; providing actual cost report to upper management. \nReceived, verified, modified and stored incoming customer data; Bills of Material, CAD data, drawings and all other product-related information for new product introductions, engineering change orders and quote processes. \nDesigned and implemented data correction routines, data collection procedures, and various tools. \nDeveloped and performed root cause analyses that led to the prevention of inaccurate data or calculations. DATA ANALYST Vanguard EMS, Inc July 2004  –  March 2005  (9 months) Assisted in the development of integrated tools, production master schedules, documents, and flow plans. Oversaw the implementation of improvements to processes through the analysis of current processes used to maximize the efficiency of equipment and personnel; supported company improvement initiatives. \nCreated and generated labor hour estimates for new or revised production and tooling work packages. \nAnalyzed and delivered critical data to upper management to make informed product launch decisions. \nConsolidated various types of data models from different customer sources in order to partner directly with customers in finalilzing the deployment model; providing actual cost report to upper management. \nReceived, verified, modified and stored incoming customer data; Bills of Material, CAD data, drawings and all other product-related information for new product introductions, engineering change orders and quote processes. \nDesigned and implemented data correction routines, data collection procedures, and various tools. \nDeveloped and performed root cause analyses that led to the prevention of inaccurate data or calculations. DATA ANALYST Benchmark August 2000  –  May 2003  (2 years 10 months) Executed the administration of the enterprise application Production Feedback System (PFS) to provide forecast production data; effectively increased the quality assurance of product line based on the report data extracted from the PFS. \nInitiated the debugging of any issues caused by the PFS while controlling the product line. \nProvided extensive customer service, administrative, and office management support.  \nInstalled new and upgraded existing PCs for staff. DATA ANALYST Benchmark August 2000  –  May 2003  (2 years 10 months) Executed the administration of the enterprise application Production Feedback System (PFS) to provide forecast production data; effectively increased the quality assurance of product line based on the report data extracted from the PFS. \nInitiated the debugging of any issues caused by the PFS while controlling the product line. \nProvided extensive customer service, administrative, and office management support.  \nInstalled new and upgraded existing PCs for staff. Education Portland State University BACHELOR OF ARTS; BACHELOR OF BUSINESS ADMINISTRATION,  INFORMATION SYSTEMS ANALYST; 2003 2003 Portland State University BACHELOR OF ARTS; BACHELOR OF BUSINESS ADMINISTRATION,  INFORMATION SYSTEMS ANALYST; 2003 2003 Portland State University BACHELOR OF ARTS; BACHELOR OF BUSINESS ADMINISTRATION,  INFORMATION SYSTEMS ANALYST; 2003 2003 Portland State University BACHELOR OF ARTS; BACHELOR OF BUSINESS ADMINISTRATION,  INFORMATION SYSTEMS ANALYST; 2003 2003 ", "Experience Data Analyst Intel Corporation May 2013  – Present (2 years 4 months) Technical Writer / Lean Sigma Champion PAS Technologies Inc. September 2007  –  January 2013  (5 years 5 months) Phoenix, Arizona Additional Titles: \n \nProcurement Supervisor Oracle Manufacturing Business Analyst Praxair January 1999  –  September 2007  (8 years 9 months) Indianapolis, Indiana Area Additional Job Titles: \n \nInformation Systems Specialist - Phoenix, AZ \nPayroll Specialist - Phoenix, AZ \nProcurement Supervisor - Phoenix, AZ \nAccounts Payable Supervisor - Phoenix, AZ \nLogistics Specialist - Chandler, AZ Data Analyst Intel Corporation May 2013  – Present (2 years 4 months) Data Analyst Intel Corporation May 2013  – Present (2 years 4 months) Technical Writer / Lean Sigma Champion PAS Technologies Inc. September 2007  –  January 2013  (5 years 5 months) Phoenix, Arizona Additional Titles: \n \nProcurement Supervisor Technical Writer / Lean Sigma Champion PAS Technologies Inc. September 2007  –  January 2013  (5 years 5 months) Phoenix, Arizona Additional Titles: \n \nProcurement Supervisor Oracle Manufacturing Business Analyst Praxair January 1999  –  September 2007  (8 years 9 months) Indianapolis, Indiana Area Additional Job Titles: \n \nInformation Systems Specialist - Phoenix, AZ \nPayroll Specialist - Phoenix, AZ \nProcurement Supervisor - Phoenix, AZ \nAccounts Payable Supervisor - Phoenix, AZ \nLogistics Specialist - Chandler, AZ Oracle Manufacturing Business Analyst Praxair January 1999  –  September 2007  (8 years 9 months) Indianapolis, Indiana Area Additional Job Titles: \n \nInformation Systems Specialist - Phoenix, AZ \nPayroll Specialist - Phoenix, AZ \nProcurement Supervisor - Phoenix, AZ \nAccounts Payable Supervisor - Phoenix, AZ \nLogistics Specialist - Chandler, AZ Languages English English English Skills Six Sigma Lean Manufacturing Continuous Improvement Accounts Payable Accounts Receivable Technical Writing Oracle SQL Oracle Applications Information Technology Accurate Data Entry Cross-functional Team... Group Training Logistic Support Microsoft Office Microsoft Excel Microsoft Word PowerPoint Access Visio SPC charts Process Control Quality Auditing World Class Customer... Process Improvement Documentations SQL Oracle ISO Root Cause Analysis Kaizen Aerospace SPC Manufacturing... Design of Experiments 5S FMEA See 21+     See less Skills  Six Sigma Lean Manufacturing Continuous Improvement Accounts Payable Accounts Receivable Technical Writing Oracle SQL Oracle Applications Information Technology Accurate Data Entry Cross-functional Team... Group Training Logistic Support Microsoft Office Microsoft Excel Microsoft Word PowerPoint Access Visio SPC charts Process Control Quality Auditing World Class Customer... Process Improvement Documentations SQL Oracle ISO Root Cause Analysis Kaizen Aerospace SPC Manufacturing... Design of Experiments 5S FMEA See 21+     See less Six Sigma Lean Manufacturing Continuous Improvement Accounts Payable Accounts Receivable Technical Writing Oracle SQL Oracle Applications Information Technology Accurate Data Entry Cross-functional Team... Group Training Logistic Support Microsoft Office Microsoft Excel Microsoft Word PowerPoint Access Visio SPC charts Process Control Quality Auditing World Class Customer... Process Improvement Documentations SQL Oracle ISO Root Cause Analysis Kaizen Aerospace SPC Manufacturing... Design of Experiments 5S FMEA See 21+     See less Six Sigma Lean Manufacturing Continuous Improvement Accounts Payable Accounts Receivable Technical Writing Oracle SQL Oracle Applications Information Technology Accurate Data Entry Cross-functional Team... Group Training Logistic Support Microsoft Office Microsoft Excel Microsoft Word PowerPoint Access Visio SPC charts Process Control Quality Auditing World Class Customer... Process Improvement Documentations SQL Oracle ISO Root Cause Analysis Kaizen Aerospace SPC Manufacturing... Design of Experiments 5S FMEA See 21+     See less Education New Mexico State University University of Phoenix New Mexico State University New Mexico State University New Mexico State University University of Phoenix University of Phoenix University of Phoenix ", "Experience Data Analyst Intel Corporation July 2015  – Present (2 months) Portland, Oregon Area Database Analyst Firstbase April 2013  –  August 2013  (5 months) Abbotsford, BC Intern Firstbase February 2013  –  February 2013  (1 month) Abbotsford, BC 2 Week Internship... enjoyed completing the various tasks assigned to me and working with such awesome people! Learned a lot. Data Analyst Intel Corporation July 2015  – Present (2 months) Portland, Oregon Area Data Analyst Intel Corporation July 2015  – Present (2 months) Portland, Oregon Area Database Analyst Firstbase April 2013  –  August 2013  (5 months) Abbotsford, BC Database Analyst Firstbase April 2013  –  August 2013  (5 months) Abbotsford, BC Intern Firstbase February 2013  –  February 2013  (1 month) Abbotsford, BC 2 Week Internship... enjoyed completing the various tasks assigned to me and working with such awesome people! Learned a lot. Intern Firstbase February 2013  –  February 2013  (1 month) Abbotsford, BC 2 Week Internship... enjoyed completing the various tasks assigned to me and working with such awesome people! Learned a lot. Languages English English English Skills Microsoft Excel Data Entry Accounting Applications Access Creative Writing Facebook Market Research Marketing Microsoft Word PowerPoint Facebook Marketing Social Networking Facebook Fan Page... Customer Service Strategic Planning Management Public Speaking Microsoft Office See 3+     See less Skills  Microsoft Excel Data Entry Accounting Applications Access Creative Writing Facebook Market Research Marketing Microsoft Word PowerPoint Facebook Marketing Social Networking Facebook Fan Page... Customer Service Strategic Planning Management Public Speaking Microsoft Office See 3+     See less Microsoft Excel Data Entry Accounting Applications Access Creative Writing Facebook Market Research Marketing Microsoft Word PowerPoint Facebook Marketing Social Networking Facebook Fan Page... Customer Service Strategic Planning Management Public Speaking Microsoft Office See 3+     See less Microsoft Excel Data Entry Accounting Applications Access Creative Writing Facebook Market Research Marketing Microsoft Word PowerPoint Facebook Marketing Social Networking Facebook Fan Page... Customer Service Strategic Planning Management Public Speaking Microsoft Office See 3+     See less Education Portland State University Bachelor of Science (B.S.),  Accounting 2014  – 2016 Transferred to PSU in the fall of 2014. Activities and Societies:  Distribution Director at Beta Alpha Psi ,  Vice President at Tau Sigma National Honor Society. University of the Fraser Valley Accounting and Business/Management 2012  – 2015 Transferred to PSU in Junior year University of Canberra Accounting and Business/Management Studied abroad for 6 months in Australia Portland State University Bachelor of Science (B.S.),  Accounting 2014  – 2016 Transferred to PSU in the fall of 2014. Activities and Societies:  Distribution Director at Beta Alpha Psi ,  Vice President at Tau Sigma National Honor Society. Portland State University Bachelor of Science (B.S.),  Accounting 2014  – 2016 Transferred to PSU in the fall of 2014. Activities and Societies:  Distribution Director at Beta Alpha Psi ,  Vice President at Tau Sigma National Honor Society. Portland State University Bachelor of Science (B.S.),  Accounting 2014  – 2016 Transferred to PSU in the fall of 2014. Activities and Societies:  Distribution Director at Beta Alpha Psi ,  Vice President at Tau Sigma National Honor Society. University of the Fraser Valley Accounting and Business/Management 2012  – 2015 Transferred to PSU in Junior year University of the Fraser Valley Accounting and Business/Management 2012  – 2015 Transferred to PSU in Junior year University of the Fraser Valley Accounting and Business/Management 2012  – 2015 Transferred to PSU in Junior year University of Canberra Accounting and Business/Management Studied abroad for 6 months in Australia University of Canberra Accounting and Business/Management Studied abroad for 6 months in Australia University of Canberra Accounting and Business/Management Studied abroad for 6 months in Australia Honors & Awards International Achievement Scholarship Portland State University 2014 Dean's List University of the Fraser Valley 2013 One World Scholarship University of the Fraser Valley 2013 Best Study Abroad Photo Submission University of Canberra CGA-BC Grade 12 Continuing Education Tuition Scholarship 2012 HUB International Barton Insurance Brokers Association Scholarship 2012 Health Sciences Association of BC Scholarship 2012 Chilliwack Progress \"Partners In Learning\" Community Scholarship 2012 BC Graduation Program Examinations Scholarship 2012 BC Passport to Education 2012 Chilliwack Minor Hockey Sportsmanship Award 2011 International Achievement Scholarship Portland State University 2014 International Achievement Scholarship Portland State University 2014 International Achievement Scholarship Portland State University 2014 Dean's List University of the Fraser Valley 2013 Dean's List University of the Fraser Valley 2013 Dean's List University of the Fraser Valley 2013 One World Scholarship University of the Fraser Valley 2013 One World Scholarship University of the Fraser Valley 2013 One World Scholarship University of the Fraser Valley 2013 Best Study Abroad Photo Submission University of Canberra Best Study Abroad Photo Submission University of Canberra Best Study Abroad Photo Submission University of Canberra CGA-BC Grade 12 Continuing Education Tuition Scholarship 2012 CGA-BC Grade 12 Continuing Education Tuition Scholarship 2012 CGA-BC Grade 12 Continuing Education Tuition Scholarship 2012 HUB International Barton Insurance Brokers Association Scholarship 2012 HUB International Barton Insurance Brokers Association Scholarship 2012 HUB International Barton Insurance Brokers Association Scholarship 2012 Health Sciences Association of BC Scholarship 2012 Health Sciences Association of BC Scholarship 2012 Health Sciences Association of BC Scholarship 2012 Chilliwack Progress \"Partners In Learning\" Community Scholarship 2012 Chilliwack Progress \"Partners In Learning\" Community Scholarship 2012 Chilliwack Progress \"Partners In Learning\" Community Scholarship 2012 BC Graduation Program Examinations Scholarship 2012 BC Graduation Program Examinations Scholarship 2012 BC Graduation Program Examinations Scholarship 2012 BC Passport to Education 2012 BC Passport to Education 2012 BC Passport to Education 2012 Chilliwack Minor Hockey Sportsmanship Award 2011 Chilliwack Minor Hockey Sportsmanship Award 2011 Chilliwack Minor Hockey Sportsmanship Award 2011 ", "Experience Data Analyst Intel Corporation June 2014  – Present (1 year 3 months) Costa Rica Responsible for data modeling for enterprise Databases, mostly on SQL Server and Teradata.  \n \nCurrently working on Hadoop/Cloudera in order to perform data mining/statistical analysis on datasets of several terabytes. It involves loading data into HDFS using Flume and several Oozie workflows that fire Hive scripts that process the data.  \n \nAlso responsible for strategic efforts such as organizing a Software/IT conference for Intel Costa Rica delivering R/statistics classes etc. Software Architect Intel Corporation February 2014  –  July 2014  (6 months) Costa Rica Works on key projects that allow developers at a deparment of Intel to move more quickly. Examples might include shared data services, Continuous integration support, UI or backend components, unit testing guidelines, etc. \n \nAlso, assists on designing the architecture of multiple tools by supporting ad-hoc requests for architectural guidance on SW projects developed on the .NET platform. Software engineer Intel Corporation January 2011  –  February 2014  (3 years 2 months) Costa Rica Develop web based application using technologies as .NET, C#, MS SQL Server, HTML5, jQuery and others Data Analyst Intel Corporation June 2014  – Present (1 year 3 months) Costa Rica Responsible for data modeling for enterprise Databases, mostly on SQL Server and Teradata.  \n \nCurrently working on Hadoop/Cloudera in order to perform data mining/statistical analysis on datasets of several terabytes. It involves loading data into HDFS using Flume and several Oozie workflows that fire Hive scripts that process the data.  \n \nAlso responsible for strategic efforts such as organizing a Software/IT conference for Intel Costa Rica delivering R/statistics classes etc. Data Analyst Intel Corporation June 2014  – Present (1 year 3 months) Costa Rica Responsible for data modeling for enterprise Databases, mostly on SQL Server and Teradata.  \n \nCurrently working on Hadoop/Cloudera in order to perform data mining/statistical analysis on datasets of several terabytes. It involves loading data into HDFS using Flume and several Oozie workflows that fire Hive scripts that process the data.  \n \nAlso responsible for strategic efforts such as organizing a Software/IT conference for Intel Costa Rica delivering R/statistics classes etc. Software Architect Intel Corporation February 2014  –  July 2014  (6 months) Costa Rica Works on key projects that allow developers at a deparment of Intel to move more quickly. Examples might include shared data services, Continuous integration support, UI or backend components, unit testing guidelines, etc. \n \nAlso, assists on designing the architecture of multiple tools by supporting ad-hoc requests for architectural guidance on SW projects developed on the .NET platform. Software Architect Intel Corporation February 2014  –  July 2014  (6 months) Costa Rica Works on key projects that allow developers at a deparment of Intel to move more quickly. Examples might include shared data services, Continuous integration support, UI or backend components, unit testing guidelines, etc. \n \nAlso, assists on designing the architecture of multiple tools by supporting ad-hoc requests for architectural guidance on SW projects developed on the .NET platform. Software engineer Intel Corporation January 2011  –  February 2014  (3 years 2 months) Costa Rica Develop web based application using technologies as .NET, C#, MS SQL Server, HTML5, jQuery and others Software engineer Intel Corporation January 2011  –  February 2014  (3 years 2 months) Costa Rica Develop web based application using technologies as .NET, C#, MS SQL Server, HTML5, jQuery and others Languages Spanish Native or bilingual proficiency English Native or bilingual proficiency Portuguese Professional working proficiency Spanish Native or bilingual proficiency English Native or bilingual proficiency Portuguese Professional working proficiency Spanish Native or bilingual proficiency English Native or bilingual proficiency Portuguese Professional working proficiency Native or bilingual proficiency Native or bilingual proficiency Professional working proficiency Skills C# Software Development Visual Studio Web Development Microsoft SQL Server OOP ASP.NET MVC HTML 5 .NET Algorithms Entity Framework Computer Science R Data Mining Hadoop Apache Spark Apache Pig Hive Flume Oozie See 5+     See less Skills  C# Software Development Visual Studio Web Development Microsoft SQL Server OOP ASP.NET MVC HTML 5 .NET Algorithms Entity Framework Computer Science R Data Mining Hadoop Apache Spark Apache Pig Hive Flume Oozie See 5+     See less C# Software Development Visual Studio Web Development Microsoft SQL Server OOP ASP.NET MVC HTML 5 .NET Algorithms Entity Framework Computer Science R Data Mining Hadoop Apache Spark Apache Pig Hive Flume Oozie See 5+     See less C# Software Development Visual Studio Web Development Microsoft SQL Server OOP ASP.NET MVC HTML 5 .NET Algorithms Entity Framework Computer Science R Data Mining Hadoop Apache Spark Apache Pig Hive Flume Oozie See 5+     See less Education Instituto Tecnológico de Costa Rica Master's Degree,  Computer Science , Summa cum laude 2011  – 2014 Dissertation on a new Sampling Algorithm, similar to traditional Stratified Sampling but with support for multi-dimensional strata. Instituto Tecnológico de Costa Rica Bachelor's degree,  Computer Science 2007  – 2011 Instituto Tecnológico de Costa Rica Master's Degree,  Computer Science , Summa cum laude 2011  – 2014 Dissertation on a new Sampling Algorithm, similar to traditional Stratified Sampling but with support for multi-dimensional strata. Instituto Tecnológico de Costa Rica Master's Degree,  Computer Science , Summa cum laude 2011  – 2014 Dissertation on a new Sampling Algorithm, similar to traditional Stratified Sampling but with support for multi-dimensional strata. Instituto Tecnológico de Costa Rica Master's Degree,  Computer Science , Summa cum laude 2011  – 2014 Dissertation on a new Sampling Algorithm, similar to traditional Stratified Sampling but with support for multi-dimensional strata. Instituto Tecnológico de Costa Rica Bachelor's degree,  Computer Science 2007  – 2011 Instituto Tecnológico de Costa Rica Bachelor's degree,  Computer Science 2007  – 2011 Instituto Tecnológico de Costa Rica Bachelor's degree,  Computer Science 2007  – 2011 "]}