{"position": "Design Automation Engineer", "company": "Intel Corporation", "profiles": ["Experience Staff Design Automation Engineer Intel Corporation December 2010  – Present (4 years 9 months) Principal PV Engineer Cadence Design Systems June 2008  –  December 2010  (2 years 7 months) Lead PV Engineer Cadence Design Systems October 2004  –  June 2008  (3 years 9 months) Sr PV Engineer Cadence Design Systems April 2003  –  October 2004  (1 year 7 months) PV Engineer Cadence Design Systems June 2001  –  March 2003  (1 year 10 months) Staff Design Automation Engineer Intel Corporation December 2010  – Present (4 years 9 months) Staff Design Automation Engineer Intel Corporation December 2010  – Present (4 years 9 months) Principal PV Engineer Cadence Design Systems June 2008  –  December 2010  (2 years 7 months) Principal PV Engineer Cadence Design Systems June 2008  –  December 2010  (2 years 7 months) Lead PV Engineer Cadence Design Systems October 2004  –  June 2008  (3 years 9 months) Lead PV Engineer Cadence Design Systems October 2004  –  June 2008  (3 years 9 months) Sr PV Engineer Cadence Design Systems April 2003  –  October 2004  (1 year 7 months) Sr PV Engineer Cadence Design Systems April 2003  –  October 2004  (1 year 7 months) PV Engineer Cadence Design Systems June 2001  –  March 2003  (1 year 10 months) PV Engineer Cadence Design Systems June 2001  –  March 2003  (1 year 10 months) Skills EDA ASIC SoC TCL Debugging Semiconductors Verilog Perl IC Software Engineering Skills  EDA ASIC SoC TCL Debugging Semiconductors Verilog Perl IC Software Engineering EDA ASIC SoC TCL Debugging Semiconductors Verilog Perl IC Software Engineering EDA ASIC SoC TCL Debugging Semiconductors Verilog Perl IC Software Engineering Education University of Southern California MS,  Electrical Engineering 1999  – 2001 University of Engineering and Technology, Lahore B.S,  Electrical Engineering 1992  – 1998 University of Southern California MS,  Electrical Engineering 1999  – 2001 University of Southern California MS,  Electrical Engineering 1999  – 2001 University of Southern California MS,  Electrical Engineering 1999  – 2001 University of Engineering and Technology, Lahore B.S,  Electrical Engineering 1992  – 1998 University of Engineering and Technology, Lahore B.S,  Electrical Engineering 1992  – 1998 University of Engineering and Technology, Lahore B.S,  Electrical Engineering 1992  – 1998 ", "Experience Post Si Debug Design Automation Engineer Intel Corporation October 2014  – Present (11 months) Israel Senior STD Cell Design Automation Engineer Intel Corporation April 2008  – Present (7 years 5 months) Israel STD cell Design Automation Engineer Intel Corporation April 2006  –  March 2008  (2 years) Layout Design Architect Intel Corporation April 2003  –  March 2006  (3 years) RLS Design Automation Engineer Intel Corporation December 1997  –  March 2003  (5 years 4 months) Physical Design Engineer Intel Corporation August 1993  –  November 1997  (4 years 4 months) Post Si Debug Design Automation Engineer Intel Corporation October 2014  – Present (11 months) Israel Post Si Debug Design Automation Engineer Intel Corporation October 2014  – Present (11 months) Israel Senior STD Cell Design Automation Engineer Intel Corporation April 2008  – Present (7 years 5 months) Israel Senior STD Cell Design Automation Engineer Intel Corporation April 2008  – Present (7 years 5 months) Israel STD cell Design Automation Engineer Intel Corporation April 2006  –  March 2008  (2 years) STD cell Design Automation Engineer Intel Corporation April 2006  –  March 2008  (2 years) Layout Design Architect Intel Corporation April 2003  –  March 2006  (3 years) Layout Design Architect Intel Corporation April 2003  –  March 2006  (3 years) RLS Design Automation Engineer Intel Corporation December 1997  –  March 2003  (5 years 4 months) RLS Design Automation Engineer Intel Corporation December 1997  –  March 2003  (5 years 4 months) Physical Design Engineer Intel Corporation August 1993  –  November 1997  (4 years 4 months) Physical Design Engineer Intel Corporation August 1993  –  November 1997  (4 years 4 months) Languages English Professional working proficiency Russian Native or bilingual proficiency Hebrew Native or bilingual proficiency Ukrainian Native or bilingual proficiency English Professional working proficiency Russian Native or bilingual proficiency Hebrew Native or bilingual proficiency Ukrainian Native or bilingual proficiency English Professional working proficiency Russian Native or bilingual proficiency Hebrew Native or bilingual proficiency Ukrainian Native or bilingual proficiency Professional working proficiency Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills EDA IC Physical Design Release Management Release Engineering Release Notes DFM LVS Static Timing Analysis TCL Perl SoC Semiconductors DRC ASIC Timing Closure Circuit Design Design for Manufacturing Processors VLSI See 5+     See less Skills  EDA IC Physical Design Release Management Release Engineering Release Notes DFM LVS Static Timing Analysis TCL Perl SoC Semiconductors DRC ASIC Timing Closure Circuit Design Design for Manufacturing Processors VLSI See 5+     See less EDA IC Physical Design Release Management Release Engineering Release Notes DFM LVS Static Timing Analysis TCL Perl SoC Semiconductors DRC ASIC Timing Closure Circuit Design Design for Manufacturing Processors VLSI See 5+     See less EDA IC Physical Design Release Management Release Engineering Release Notes DFM LVS Static Timing Analysis TCL Perl SoC Semiconductors DRC ASIC Timing Closure Circuit Design Design for Manufacturing Processors VLSI See 5+     See less Education Coventry University B.Eng (Hons),  Computer Hardware and Software Engineering 1999  – 2001 Technion - Israel Institute of Technology Physics 1995  – 1998 Ort Braude College Practical Engineer,  Electronics & Computer Science 1991  – 1993 Coventry University B.Eng (Hons),  Computer Hardware and Software Engineering 1999  – 2001 Coventry University B.Eng (Hons),  Computer Hardware and Software Engineering 1999  – 2001 Coventry University B.Eng (Hons),  Computer Hardware and Software Engineering 1999  – 2001 Technion - Israel Institute of Technology Physics 1995  – 1998 Technion - Israel Institute of Technology Physics 1995  – 1998 Technion - Israel Institute of Technology Physics 1995  – 1998 Ort Braude College Practical Engineer,  Electronics & Computer Science 1991  – 1993 Ort Braude College Practical Engineer,  Electronics & Computer Science 1991  – 1993 Ort Braude College Practical Engineer,  Electronics & Computer Science 1991  – 1993 Honors & Awards Additional Honors & Awards Intel Achievement Award, 1999-2000 Additional Honors & Awards Intel Achievement Award, 1999-2000 Additional Honors & Awards Intel Achievement Award, 1999-2000 Additional Honors & Awards Intel Achievement Award, 1999-2000 ", "Skills Lithography Physical Design Physical Verification Metrology EDA Semiconductor... Electron Microscopy DRC OPC Optical Proximity... Scientific Computing Semiconductors ASIC IC SoC Analog CMOS Simulations TCL Design of Experiments Yield Characterization Physics Product Engineering Semiconductor Industry See 10+     See less Skills  Lithography Physical Design Physical Verification Metrology EDA Semiconductor... Electron Microscopy DRC OPC Optical Proximity... Scientific Computing Semiconductors ASIC IC SoC Analog CMOS Simulations TCL Design of Experiments Yield Characterization Physics Product Engineering Semiconductor Industry See 10+     See less Lithography Physical Design Physical Verification Metrology EDA Semiconductor... Electron Microscopy DRC OPC Optical Proximity... Scientific Computing Semiconductors ASIC IC SoC Analog CMOS Simulations TCL Design of Experiments Yield Characterization Physics Product Engineering Semiconductor Industry See 10+     See less Lithography Physical Design Physical Verification Metrology EDA Semiconductor... Electron Microscopy DRC OPC Optical Proximity... Scientific Computing Semiconductors ASIC IC SoC Analog CMOS Simulations TCL Design of Experiments Yield Characterization Physics Product Engineering Semiconductor Industry See 10+     See less ", "Skills Digital Design VLSI C/C++ Bankend flows Timing... Primetime TCL Perl Computer Architecture Static Timing Analysis Circuit Design Verilog ASIC EDA Cadence Virtuoso SPICE Skills  Digital Design VLSI C/C++ Bankend flows Timing... Primetime TCL Perl Computer Architecture Static Timing Analysis Circuit Design Verilog ASIC EDA Cadence Virtuoso SPICE Digital Design VLSI C/C++ Bankend flows Timing... Primetime TCL Perl Computer Architecture Static Timing Analysis Circuit Design Verilog ASIC EDA Cadence Virtuoso SPICE Digital Design VLSI C/C++ Bankend flows Timing... Primetime TCL Perl Computer Architecture Static Timing Analysis Circuit Design Verilog ASIC EDA Cadence Virtuoso SPICE ", "Experience MIG Design Automation Engineer Intel Corporation July 2014  – Present (1 year 2 months) Penang •\tOwn the internal Design Migration tool which carries out schematic migration from one process to another. \n•\tTasks involves use of Unix environment and Cadence design tool. \n•\tFamiliarized with using Cadence Virtuoso IC5 & IC6 Design Environment. \n•\tAccountable for timely delivery for complete migrated schematic blocks.  \n•\tAble to work cohesively with members of the design team which was between our Malaysia site and Bangalore site and the US site.  \n•\tProvide global support for multiple IPs and various projects in migrating their design to the leading edge technology process. Graduate Trainee Design Automation Engineer Intel Corporation 2013  –  June 2014  (1 year) Penang, Malaysia * Developed an automated Layout Automations/Flow QA. \n* Developed several scripts for RV,LV and Layout Automations for the 14nm process \n* Familiarized with the Unix environment \n* Famliarized with the Cadence design tool. \n* Able to communicate efficiently and effectively with others \n* Able to work well in a team as well as an individual Test Development Intern Altera September 2011  –  December 2011  (4 months) Phase 4 Bayan Lepas MIG Design Automation Engineer Intel Corporation July 2014  – Present (1 year 2 months) Penang •\tOwn the internal Design Migration tool which carries out schematic migration from one process to another. \n•\tTasks involves use of Unix environment and Cadence design tool. \n•\tFamiliarized with using Cadence Virtuoso IC5 & IC6 Design Environment. \n•\tAccountable for timely delivery for complete migrated schematic blocks.  \n•\tAble to work cohesively with members of the design team which was between our Malaysia site and Bangalore site and the US site.  \n•\tProvide global support for multiple IPs and various projects in migrating their design to the leading edge technology process. MIG Design Automation Engineer Intel Corporation July 2014  – Present (1 year 2 months) Penang •\tOwn the internal Design Migration tool which carries out schematic migration from one process to another. \n•\tTasks involves use of Unix environment and Cadence design tool. \n•\tFamiliarized with using Cadence Virtuoso IC5 & IC6 Design Environment. \n•\tAccountable for timely delivery for complete migrated schematic blocks.  \n•\tAble to work cohesively with members of the design team which was between our Malaysia site and Bangalore site and the US site.  \n•\tProvide global support for multiple IPs and various projects in migrating their design to the leading edge technology process. Graduate Trainee Design Automation Engineer Intel Corporation 2013  –  June 2014  (1 year) Penang, Malaysia * Developed an automated Layout Automations/Flow QA. \n* Developed several scripts for RV,LV and Layout Automations for the 14nm process \n* Familiarized with the Unix environment \n* Famliarized with the Cadence design tool. \n* Able to communicate efficiently and effectively with others \n* Able to work well in a team as well as an individual Graduate Trainee Design Automation Engineer Intel Corporation 2013  –  June 2014  (1 year) Penang, Malaysia * Developed an automated Layout Automations/Flow QA. \n* Developed several scripts for RV,LV and Layout Automations for the 14nm process \n* Familiarized with the Unix environment \n* Famliarized with the Cadence design tool. \n* Able to communicate efficiently and effectively with others \n* Able to work well in a team as well as an individual Test Development Intern Altera September 2011  –  December 2011  (4 months) Phase 4 Bayan Lepas Test Development Intern Altera September 2011  –  December 2011  (4 months) Phase 4 Bayan Lepas Languages English Full professional proficiency Malay Full professional proficiency Chinese Elementary proficiency Korean Elementary proficiency English Full professional proficiency Malay Full professional proficiency Chinese Elementary proficiency Korean Elementary proficiency English Full professional proficiency Malay Full professional proficiency Chinese Elementary proficiency Korean Elementary proficiency Full professional proficiency Full professional proficiency Elementary proficiency Elementary proficiency Skills Perl Script Unix Shell Scripting Cadence Skill TCL Matlab Microsoft Office C++ Language Java Quartus AutoCAD Design Automation Microelectronics EDA Cadence Unix C++ Perl See 2+     See less Skills  Perl Script Unix Shell Scripting Cadence Skill TCL Matlab Microsoft Office C++ Language Java Quartus AutoCAD Design Automation Microelectronics EDA Cadence Unix C++ Perl See 2+     See less Perl Script Unix Shell Scripting Cadence Skill TCL Matlab Microsoft Office C++ Language Java Quartus AutoCAD Design Automation Microelectronics EDA Cadence Unix C++ Perl See 2+     See less Perl Script Unix Shell Scripting Cadence Skill TCL Matlab Microsoft Office C++ Language Java Quartus AutoCAD Design Automation Microelectronics EDA Cadence Unix C++ Perl See 2+     See less Education University of Bradford Bachelor of Engineering (Hons) in Electrical and Electronic Engineering,  E&E Engineering , 1st Class Honours 2011  – 2012 INTI International College Penang Diploma,  Microelectronics Engineering , Passed with Distinction 2008  – 2010 SMKBJ University of Bradford Bachelor of Engineering (Hons) in Electrical and Electronic Engineering,  E&E Engineering , 1st Class Honours 2011  – 2012 University of Bradford Bachelor of Engineering (Hons) in Electrical and Electronic Engineering,  E&E Engineering , 1st Class Honours 2011  – 2012 University of Bradford Bachelor of Engineering (Hons) in Electrical and Electronic Engineering,  E&E Engineering , 1st Class Honours 2011  – 2012 INTI International College Penang Diploma,  Microelectronics Engineering , Passed with Distinction 2008  – 2010 INTI International College Penang Diploma,  Microelectronics Engineering , Passed with Distinction 2008  – 2010 INTI International College Penang Diploma,  Microelectronics Engineering , Passed with Distinction 2008  – 2010 SMKBJ SMKBJ SMKBJ ", "Skills Processors Static Timing Analysis TCL Debugging Perl SoC VLSI C++ Object Oriented Design SQL Linux Computer Engineering Verilog Algorithms Computer Architecture SystemVerilog See 1+     See less Skills  Processors Static Timing Analysis TCL Debugging Perl SoC VLSI C++ Object Oriented Design SQL Linux Computer Engineering Verilog Algorithms Computer Architecture SystemVerilog See 1+     See less Processors Static Timing Analysis TCL Debugging Perl SoC VLSI C++ Object Oriented Design SQL Linux Computer Engineering Verilog Algorithms Computer Architecture SystemVerilog See 1+     See less Processors Static Timing Analysis TCL Debugging Perl SoC VLSI C++ Object Oriented Design SQL Linux Computer Engineering Verilog Algorithms Computer Architecture SystemVerilog See 1+     See less ", "Experience Design Automation Engineer Intel Corporation January 2012  –  July 2015  (3 years 7 months) Design automation engineer providing Unix environment and tool support for major CPU and SOC design teams of 800+ engineers.  \n \n• Designed and supported bug tracking database and schema used for 15+ projects. \n• Developed bug tracking change control flow. Created software tools to automate building agendas, updating records, generating reports, and and cloning bugs to other project affected. \n• Created software tools to generate bug tracking indicators. \n• Developed tool that integrates with the component design continuous integration system to update bug records that pass the automated build \n• Provided technical leadership working with a team of 5 to design new internal database capabilities; such as converging on a standard database schema for hardware and software design, record cloning capability to enable sharing and trace-ability. \n• supported component design Unix compute infrastructure; Provided NFS disk space, Unix interactive servers, general Unix support, Unix level tool failure debug. Design Automation Engineer Intel Corporation January 2009  –  2012  (3 years) Creating Unix software tools to support major CPU and SOC design teams of 800+ engineers.  \n \n \n•\tDeveloper and support for the primary test run regression tools used by the Major CPU and Phone&Tablet SOC Design products; Used to run +500,000 tests per week \n•\t•\tSupported internally developed regression test failure triage system used to collect and bucket test run regression tests; managed database schema. \n•\tCo-developed software that improved reliability and scalability of the component design continuous integration system; co-developed DB scheme for the migration to Mysql. \n•\tSupported Unix design environment, General Unix support, Unix level tool failure debug, Git support during the migration from Bitkeeper to Git. \n SR Unix System Administrator/programmer Intel Corporation 2001  –  2009  (8 years) \nUnix engineering and support across many disciplines of the Unix infrastructure. Provided training and mentoring to increase skill set of other administrators in the team.  \n \n \n• Managed and supported Unix OS image and Netbatch installation for SLES, Redhat, AIX and HPUX  \noperating systems for component design teams. \n• engaged with vendors to debug and resolve OS level problem.  \n• Large scale administration of 10K+ Unix servers, 2+ Petabytes storage; Site NIS infrastructure owner, Site Sendmail owner, NFS file server administrator, DNS administration, Unix workstation and batch computing administration. \n• Create automation software to manage changes across a 10K+ batch computing pool of systems. \n• Benchmarked of Unix compute platforms and NFS file server performance; Influenced the purchasing in vendor and platform select provide the best platform for component design work flows. \n• Researched SLES9 NFS bug causing BFS file server loading issues. Created software tools in C and perl to collected and analyze production workflow and then created software tools to perform NFS operations level bechmarking. SYSTEM ADMINISTRATOR Intel Corporation 1991  –  2000  (9 years) •\tDeveloped Windows NT automated OS installation system to support large scale deployment for Silicon design; supported CPU design teams effort to port tools flows from AIX. Technical Lead the Windows NT OS image development team. \n•\tManaged team of 4 people from 1999-2000 supporting 200 customers and 1000+ batch systems for the Design technology software team; Drove changes with the site IT Unix computing team that allowed the team to merge into the site Unix IT team while improving quality of service.  \n•\tIntegrated new Workstation platforms into CPU design environments; Created or co-created Aix, HPUX, SunOS, and NCR SYS5 OS installation and basic management flows used at CPU design sites worldwide.  \n•\tSupported Internal distributed batch system in the earlier years. Provided 24x7 coverage to perform gdb level debugging.  \n Design Automation Engineer Intel Corporation January 2012  –  July 2015  (3 years 7 months) Design automation engineer providing Unix environment and tool support for major CPU and SOC design teams of 800+ engineers.  \n \n• Designed and supported bug tracking database and schema used for 15+ projects. \n• Developed bug tracking change control flow. Created software tools to automate building agendas, updating records, generating reports, and and cloning bugs to other project affected. \n• Created software tools to generate bug tracking indicators. \n• Developed tool that integrates with the component design continuous integration system to update bug records that pass the automated build \n• Provided technical leadership working with a team of 5 to design new internal database capabilities; such as converging on a standard database schema for hardware and software design, record cloning capability to enable sharing and trace-ability. \n• supported component design Unix compute infrastructure; Provided NFS disk space, Unix interactive servers, general Unix support, Unix level tool failure debug. Design Automation Engineer Intel Corporation January 2012  –  July 2015  (3 years 7 months) Design automation engineer providing Unix environment and tool support for major CPU and SOC design teams of 800+ engineers.  \n \n• Designed and supported bug tracking database and schema used for 15+ projects. \n• Developed bug tracking change control flow. Created software tools to automate building agendas, updating records, generating reports, and and cloning bugs to other project affected. \n• Created software tools to generate bug tracking indicators. \n• Developed tool that integrates with the component design continuous integration system to update bug records that pass the automated build \n• Provided technical leadership working with a team of 5 to design new internal database capabilities; such as converging on a standard database schema for hardware and software design, record cloning capability to enable sharing and trace-ability. \n• supported component design Unix compute infrastructure; Provided NFS disk space, Unix interactive servers, general Unix support, Unix level tool failure debug. Design Automation Engineer Intel Corporation January 2009  –  2012  (3 years) Creating Unix software tools to support major CPU and SOC design teams of 800+ engineers.  \n \n \n•\tDeveloper and support for the primary test run regression tools used by the Major CPU and Phone&Tablet SOC Design products; Used to run +500,000 tests per week \n•\t•\tSupported internally developed regression test failure triage system used to collect and bucket test run regression tests; managed database schema. \n•\tCo-developed software that improved reliability and scalability of the component design continuous integration system; co-developed DB scheme for the migration to Mysql. \n•\tSupported Unix design environment, General Unix support, Unix level tool failure debug, Git support during the migration from Bitkeeper to Git. \n Design Automation Engineer Intel Corporation January 2009  –  2012  (3 years) Creating Unix software tools to support major CPU and SOC design teams of 800+ engineers.  \n \n \n•\tDeveloper and support for the primary test run regression tools used by the Major CPU and Phone&Tablet SOC Design products; Used to run +500,000 tests per week \n•\t•\tSupported internally developed regression test failure triage system used to collect and bucket test run regression tests; managed database schema. \n•\tCo-developed software that improved reliability and scalability of the component design continuous integration system; co-developed DB scheme for the migration to Mysql. \n•\tSupported Unix design environment, General Unix support, Unix level tool failure debug, Git support during the migration from Bitkeeper to Git. \n SR Unix System Administrator/programmer Intel Corporation 2001  –  2009  (8 years) \nUnix engineering and support across many disciplines of the Unix infrastructure. Provided training and mentoring to increase skill set of other administrators in the team.  \n \n \n• Managed and supported Unix OS image and Netbatch installation for SLES, Redhat, AIX and HPUX  \noperating systems for component design teams. \n• engaged with vendors to debug and resolve OS level problem.  \n• Large scale administration of 10K+ Unix servers, 2+ Petabytes storage; Site NIS infrastructure owner, Site Sendmail owner, NFS file server administrator, DNS administration, Unix workstation and batch computing administration. \n• Create automation software to manage changes across a 10K+ batch computing pool of systems. \n• Benchmarked of Unix compute platforms and NFS file server performance; Influenced the purchasing in vendor and platform select provide the best platform for component design work flows. \n• Researched SLES9 NFS bug causing BFS file server loading issues. Created software tools in C and perl to collected and analyze production workflow and then created software tools to perform NFS operations level bechmarking. SR Unix System Administrator/programmer Intel Corporation 2001  –  2009  (8 years) \nUnix engineering and support across many disciplines of the Unix infrastructure. Provided training and mentoring to increase skill set of other administrators in the team.  \n \n \n• Managed and supported Unix OS image and Netbatch installation for SLES, Redhat, AIX and HPUX  \noperating systems for component design teams. \n• engaged with vendors to debug and resolve OS level problem.  \n• Large scale administration of 10K+ Unix servers, 2+ Petabytes storage; Site NIS infrastructure owner, Site Sendmail owner, NFS file server administrator, DNS administration, Unix workstation and batch computing administration. \n• Create automation software to manage changes across a 10K+ batch computing pool of systems. \n• Benchmarked of Unix compute platforms and NFS file server performance; Influenced the purchasing in vendor and platform select provide the best platform for component design work flows. \n• Researched SLES9 NFS bug causing BFS file server loading issues. Created software tools in C and perl to collected and analyze production workflow and then created software tools to perform NFS operations level bechmarking. SYSTEM ADMINISTRATOR Intel Corporation 1991  –  2000  (9 years) •\tDeveloped Windows NT automated OS installation system to support large scale deployment for Silicon design; supported CPU design teams effort to port tools flows from AIX. Technical Lead the Windows NT OS image development team. \n•\tManaged team of 4 people from 1999-2000 supporting 200 customers and 1000+ batch systems for the Design technology software team; Drove changes with the site IT Unix computing team that allowed the team to merge into the site Unix IT team while improving quality of service.  \n•\tIntegrated new Workstation platforms into CPU design environments; Created or co-created Aix, HPUX, SunOS, and NCR SYS5 OS installation and basic management flows used at CPU design sites worldwide.  \n•\tSupported Internal distributed batch system in the earlier years. Provided 24x7 coverage to perform gdb level debugging.  \n SYSTEM ADMINISTRATOR Intel Corporation 1991  –  2000  (9 years) •\tDeveloped Windows NT automated OS installation system to support large scale deployment for Silicon design; supported CPU design teams effort to port tools flows from AIX. Technical Lead the Windows NT OS image development team. \n•\tManaged team of 4 people from 1999-2000 supporting 200 customers and 1000+ batch systems for the Design technology software team; Drove changes with the site IT Unix computing team that allowed the team to merge into the site Unix IT team while improving quality of service.  \n•\tIntegrated new Workstation platforms into CPU design environments; Created or co-created Aix, HPUX, SunOS, and NCR SYS5 OS installation and basic management flows used at CPU design sites worldwide.  \n•\tSupported Internal distributed batch system in the earlier years. Provided 24x7 coverage to perform gdb level debugging.  \n Skills Perl Unix systems administration Unix operating systems linux programming SQL databases troubleshooting storage team leadership RTL Design SOC git Skills  Perl Unix systems administration Unix operating systems linux programming SQL databases troubleshooting storage team leadership RTL Design SOC git Perl Unix systems administration Unix operating systems linux programming SQL databases troubleshooting storage team leadership RTL Design SOC git Perl Unix systems administration Unix operating systems linux programming SQL databases troubleshooting storage team leadership RTL Design SOC git Education Clark College Associate's degree,  Electronics Technology Clark College Associate's degree,  Telecommunications Clark College Associate's degree,  Electronics Technology Clark College Associate's degree,  Electronics Technology Clark College Associate's degree,  Electronics Technology Clark College Associate's degree,  Telecommunications Clark College Associate's degree,  Telecommunications Clark College Associate's degree,  Telecommunications ", "Skills Semiconductors Analog ASIC SoC Mixed Signal Wireless IC FPGA Debugging Integrated Circuit... RTL design Verilog Analog Circuit Design EDA Software Development RTL Design Embedded Systems See 2+     See less Skills  Semiconductors Analog ASIC SoC Mixed Signal Wireless IC FPGA Debugging Integrated Circuit... RTL design Verilog Analog Circuit Design EDA Software Development RTL Design Embedded Systems See 2+     See less Semiconductors Analog ASIC SoC Mixed Signal Wireless IC FPGA Debugging Integrated Circuit... RTL design Verilog Analog Circuit Design EDA Software Development RTL Design Embedded Systems See 2+     See less Semiconductors Analog ASIC SoC Mixed Signal Wireless IC FPGA Debugging Integrated Circuit... RTL design Verilog Analog Circuit Design EDA Software Development RTL Design Embedded Systems See 2+     See less ", "Summary I am a highly detail oriented professional with an engineering background blended with business, program management, and marketing skills. I have a lot of experience in customer account management, customer training/messaging, executive communications.  \n \nI am currently enrolled in the MBA program with a focus on marketing and strategy - at the Haas School of Business, University of California, Berkeley - and I am looking for exciting opportunities to apply my experience and skills to influence business and product decisions. Summary I am a highly detail oriented professional with an engineering background blended with business, program management, and marketing skills. I have a lot of experience in customer account management, customer training/messaging, executive communications.  \n \nI am currently enrolled in the MBA program with a focus on marketing and strategy - at the Haas School of Business, University of California, Berkeley - and I am looking for exciting opportunities to apply my experience and skills to influence business and product decisions. I am a highly detail oriented professional with an engineering background blended with business, program management, and marketing skills. I have a lot of experience in customer account management, customer training/messaging, executive communications.  \n \nI am currently enrolled in the MBA program with a focus on marketing and strategy - at the Haas School of Business, University of California, Berkeley - and I am looking for exciting opportunities to apply my experience and skills to influence business and product decisions. I am a highly detail oriented professional with an engineering background blended with business, program management, and marketing skills. I have a lot of experience in customer account management, customer training/messaging, executive communications.  \n \nI am currently enrolled in the MBA program with a focus on marketing and strategy - at the Haas School of Business, University of California, Berkeley - and I am looking for exciting opportunities to apply my experience and skills to influence business and product decisions. Experience Senior Technical Program Manager InvenSense, Inc. August 2015  – Present (1 month) San Jose, CA Marketing Manager Intel Corporation August 2012  –  August 2015  (3 years 1 month) Santa Clara, California •\tManaged engagements with key customers – combined revenues of $200M. Played a key role in ensuring customers held launch schedule.  \n•\tManaged customer differentiation program; created a framework to manage customer innovation with a process that streamlined requests to Intel’s engineering teams. This process minimizes risk to product launch and manages customer differentiation more efficiently.  \n•\tInitiated process improvements to track and manage customer differentiation requests on Intel Xeon platforms. Drove thought leadership on adoption of the new process across the organization. This minimized risk to product launch by improving transparency and communication.  \n•\tManaged validation customer program, tracked status of key data center customers, and provided management updates on program risks and resource requests.  \n•\tDrove resolution for several critical, showstopper issues by pulling in the right experts into task forces. Updated senior management on customer program status, highlighting risks, and outlining mitigation plan.  \n•\tActed as the SME (subject matter expert) – published design guidelines, architectural and firmware specifications.  \n•\tCustomer presentations – Trained customers on Intel products, presented roadmap updates, key messages, marketed technical solutions. Lead Design Automation Engineer Intel April 2010  –  August 2012  (2 years 5 months) Santa Clara, California •\tI initiated and drove process improvements for tool releases by developing a software solution to manage tool regressions. This new solution reduced tool bugs by 25%, and improved tool regression time by 50%.  \n•\tI researched, analyzed tools across several projects and identified areas for convergence, then led a team of engineers to develop a common Electrical Rule Check tool across client and server design organizations.  \n•\tI trained a team of 50 engineers and managers on design methodologies, and highlighted best known practices. This resulted in an 85% reduction in user error related support requests. With a more informed well trained design team the project was able to achieve 1.5x faster design convergence.  \n•\tI mentored and trained a summer intern to implement a tool for regression testing. Set goals and expectations. I monitored day-to-day activity, tracked progress and provided guidance. Senior Design Automation Engineer Intel Corporation April 2008  –  May 2010  (2 years 2 months) Santa Clara, California I managed 2 different Performance Verification tools on the Intel Xeon ® family of processors and the Mill Brook Memory Expansion Buffer.  \n \nI improved tool runtime over successive generations of Intel products, greatly reducing the time engineers had for the tool to complete. The tool was run several times as engineers iterated over their designs, so the runtime improvements I made greatly improved productivity.  \n \nI used empirical analysis to improve our simulation models. This resulted in tool simulation results that were closer to actual measurements from the manufactured CPU. This greatly reduced failure due to miscorrelation; avoiding the need for expensive CPU re-spin to fix these failures.  \n \nI provided technical training and support on a regular basis to a design team of approximately 250 engineers. Design Automation Engineer Intel Corporation May 2005  –  March 2008  (2 years 11 months) Santa Clara, California I developed design flow, and methodology for frequency performance verification on the Intel Xeon, and the Intel Core 2 Duo family of processors.  \n \nI worked on qualifying new tool releases, and launching these releases to the design team.  \n \nI provided technical tool support to the rest of the design team. Graduate Research Assistant Optoelectronics research lab June 2002  –  April 2005  (2 years 11 months) I worked for Dr. Kevin Lear in the Opto-electronics Laboratory at Colorado State University. My research was focused on designing, fabricating and testing a CMOS compatible photodiode. The end goal of this research was to develop a method to route clocks inside a silicon integrated circuit using optical interconnects, greatly reducing the transit time of these signals as compared to the traditional metal wire interconnects. As part of this research, I  \n•\tDeveloped and implemented process for Chemical Mechanical edge polishing (CMP) of CMOS ICs in order to couple light into Silicon Nitride waveguides. \n•\tDeveloped process flow for fabrication of a waveguide coupled poly-silicon photo-detector in a 0.35 um CMOS technology.  \n•\tDesigned and implemented the experimental setup for the DC and AC characterization of waveguide coupled poly-silicon and amorphous silicon photodiodes. \n•\tManaged inventory and semiconductor test and characterization equipment at the Colorado State University Semiconductor Processing Laboratory. Senior Technical Program Manager InvenSense, Inc. August 2015  – Present (1 month) San Jose, CA Senior Technical Program Manager InvenSense, Inc. August 2015  – Present (1 month) San Jose, CA Marketing Manager Intel Corporation August 2012  –  August 2015  (3 years 1 month) Santa Clara, California •\tManaged engagements with key customers – combined revenues of $200M. Played a key role in ensuring customers held launch schedule.  \n•\tManaged customer differentiation program; created a framework to manage customer innovation with a process that streamlined requests to Intel’s engineering teams. This process minimizes risk to product launch and manages customer differentiation more efficiently.  \n•\tInitiated process improvements to track and manage customer differentiation requests on Intel Xeon platforms. Drove thought leadership on adoption of the new process across the organization. This minimized risk to product launch by improving transparency and communication.  \n•\tManaged validation customer program, tracked status of key data center customers, and provided management updates on program risks and resource requests.  \n•\tDrove resolution for several critical, showstopper issues by pulling in the right experts into task forces. Updated senior management on customer program status, highlighting risks, and outlining mitigation plan.  \n•\tActed as the SME (subject matter expert) – published design guidelines, architectural and firmware specifications.  \n•\tCustomer presentations – Trained customers on Intel products, presented roadmap updates, key messages, marketed technical solutions. Marketing Manager Intel Corporation August 2012  –  August 2015  (3 years 1 month) Santa Clara, California •\tManaged engagements with key customers – combined revenues of $200M. Played a key role in ensuring customers held launch schedule.  \n•\tManaged customer differentiation program; created a framework to manage customer innovation with a process that streamlined requests to Intel’s engineering teams. This process minimizes risk to product launch and manages customer differentiation more efficiently.  \n•\tInitiated process improvements to track and manage customer differentiation requests on Intel Xeon platforms. Drove thought leadership on adoption of the new process across the organization. This minimized risk to product launch by improving transparency and communication.  \n•\tManaged validation customer program, tracked status of key data center customers, and provided management updates on program risks and resource requests.  \n•\tDrove resolution for several critical, showstopper issues by pulling in the right experts into task forces. Updated senior management on customer program status, highlighting risks, and outlining mitigation plan.  \n•\tActed as the SME (subject matter expert) – published design guidelines, architectural and firmware specifications.  \n•\tCustomer presentations – Trained customers on Intel products, presented roadmap updates, key messages, marketed technical solutions. Lead Design Automation Engineer Intel April 2010  –  August 2012  (2 years 5 months) Santa Clara, California •\tI initiated and drove process improvements for tool releases by developing a software solution to manage tool regressions. This new solution reduced tool bugs by 25%, and improved tool regression time by 50%.  \n•\tI researched, analyzed tools across several projects and identified areas for convergence, then led a team of engineers to develop a common Electrical Rule Check tool across client and server design organizations.  \n•\tI trained a team of 50 engineers and managers on design methodologies, and highlighted best known practices. This resulted in an 85% reduction in user error related support requests. With a more informed well trained design team the project was able to achieve 1.5x faster design convergence.  \n•\tI mentored and trained a summer intern to implement a tool for regression testing. Set goals and expectations. I monitored day-to-day activity, tracked progress and provided guidance. Lead Design Automation Engineer Intel April 2010  –  August 2012  (2 years 5 months) Santa Clara, California •\tI initiated and drove process improvements for tool releases by developing a software solution to manage tool regressions. This new solution reduced tool bugs by 25%, and improved tool regression time by 50%.  \n•\tI researched, analyzed tools across several projects and identified areas for convergence, then led a team of engineers to develop a common Electrical Rule Check tool across client and server design organizations.  \n•\tI trained a team of 50 engineers and managers on design methodologies, and highlighted best known practices. This resulted in an 85% reduction in user error related support requests. With a more informed well trained design team the project was able to achieve 1.5x faster design convergence.  \n•\tI mentored and trained a summer intern to implement a tool for regression testing. Set goals and expectations. I monitored day-to-day activity, tracked progress and provided guidance. Senior Design Automation Engineer Intel Corporation April 2008  –  May 2010  (2 years 2 months) Santa Clara, California I managed 2 different Performance Verification tools on the Intel Xeon ® family of processors and the Mill Brook Memory Expansion Buffer.  \n \nI improved tool runtime over successive generations of Intel products, greatly reducing the time engineers had for the tool to complete. The tool was run several times as engineers iterated over their designs, so the runtime improvements I made greatly improved productivity.  \n \nI used empirical analysis to improve our simulation models. This resulted in tool simulation results that were closer to actual measurements from the manufactured CPU. This greatly reduced failure due to miscorrelation; avoiding the need for expensive CPU re-spin to fix these failures.  \n \nI provided technical training and support on a regular basis to a design team of approximately 250 engineers. Senior Design Automation Engineer Intel Corporation April 2008  –  May 2010  (2 years 2 months) Santa Clara, California I managed 2 different Performance Verification tools on the Intel Xeon ® family of processors and the Mill Brook Memory Expansion Buffer.  \n \nI improved tool runtime over successive generations of Intel products, greatly reducing the time engineers had for the tool to complete. The tool was run several times as engineers iterated over their designs, so the runtime improvements I made greatly improved productivity.  \n \nI used empirical analysis to improve our simulation models. This resulted in tool simulation results that were closer to actual measurements from the manufactured CPU. This greatly reduced failure due to miscorrelation; avoiding the need for expensive CPU re-spin to fix these failures.  \n \nI provided technical training and support on a regular basis to a design team of approximately 250 engineers. Design Automation Engineer Intel Corporation May 2005  –  March 2008  (2 years 11 months) Santa Clara, California I developed design flow, and methodology for frequency performance verification on the Intel Xeon, and the Intel Core 2 Duo family of processors.  \n \nI worked on qualifying new tool releases, and launching these releases to the design team.  \n \nI provided technical tool support to the rest of the design team. Design Automation Engineer Intel Corporation May 2005  –  March 2008  (2 years 11 months) Santa Clara, California I developed design flow, and methodology for frequency performance verification on the Intel Xeon, and the Intel Core 2 Duo family of processors.  \n \nI worked on qualifying new tool releases, and launching these releases to the design team.  \n \nI provided technical tool support to the rest of the design team. Graduate Research Assistant Optoelectronics research lab June 2002  –  April 2005  (2 years 11 months) I worked for Dr. Kevin Lear in the Opto-electronics Laboratory at Colorado State University. My research was focused on designing, fabricating and testing a CMOS compatible photodiode. The end goal of this research was to develop a method to route clocks inside a silicon integrated circuit using optical interconnects, greatly reducing the transit time of these signals as compared to the traditional metal wire interconnects. As part of this research, I  \n•\tDeveloped and implemented process for Chemical Mechanical edge polishing (CMP) of CMOS ICs in order to couple light into Silicon Nitride waveguides. \n•\tDeveloped process flow for fabrication of a waveguide coupled poly-silicon photo-detector in a 0.35 um CMOS technology.  \n•\tDesigned and implemented the experimental setup for the DC and AC characterization of waveguide coupled poly-silicon and amorphous silicon photodiodes. \n•\tManaged inventory and semiconductor test and characterization equipment at the Colorado State University Semiconductor Processing Laboratory. Graduate Research Assistant Optoelectronics research lab June 2002  –  April 2005  (2 years 11 months) I worked for Dr. Kevin Lear in the Opto-electronics Laboratory at Colorado State University. My research was focused on designing, fabricating and testing a CMOS compatible photodiode. The end goal of this research was to develop a method to route clocks inside a silicon integrated circuit using optical interconnects, greatly reducing the transit time of these signals as compared to the traditional metal wire interconnects. As part of this research, I  \n•\tDeveloped and implemented process for Chemical Mechanical edge polishing (CMP) of CMOS ICs in order to couple light into Silicon Nitride waveguides. \n•\tDeveloped process flow for fabrication of a waveguide coupled poly-silicon photo-detector in a 0.35 um CMOS technology.  \n•\tDesigned and implemented the experimental setup for the DC and AC characterization of waveguide coupled poly-silicon and amorphous silicon photodiodes. \n•\tManaged inventory and semiconductor test and characterization equipment at the Colorado State University Semiconductor Processing Laboratory. Languages Urdu Native or bilingual proficiency Hindi Native or bilingual proficiency Tamil Limited working proficiency English Full professional proficiency Urdu Native or bilingual proficiency Hindi Native or bilingual proficiency Tamil Limited working proficiency English Full professional proficiency Urdu Native or bilingual proficiency Hindi Native or bilingual proficiency Tamil Limited working proficiency English Full professional proficiency Native or bilingual proficiency Native or bilingual proficiency Limited working proficiency Full professional proficiency Skills Customer Communication Long-term Customer... Executive-level... Technical Marketing Marketing Communications ASIC VLSI Static Timing Analysis TCL Semiconductors EDA Debugging CMOS RTL design Perl Microprocessors SoC Simulations Verilog SystemVerilog Processors Testing IC Silicon Logic Design Intel Stakeholder Analysis Cross-functional Team... Program Management Integration Linux Python See 17+     See less Skills  Customer Communication Long-term Customer... Executive-level... Technical Marketing Marketing Communications ASIC VLSI Static Timing Analysis TCL Semiconductors EDA Debugging CMOS RTL design Perl Microprocessors SoC Simulations Verilog SystemVerilog Processors Testing IC Silicon Logic Design Intel Stakeholder Analysis Cross-functional Team... Program Management Integration Linux Python See 17+     See less Customer Communication Long-term Customer... Executive-level... Technical Marketing Marketing Communications ASIC VLSI Static Timing Analysis TCL Semiconductors EDA Debugging CMOS RTL design Perl Microprocessors SoC Simulations Verilog SystemVerilog Processors Testing IC Silicon Logic Design Intel Stakeholder Analysis Cross-functional Team... Program Management Integration Linux Python See 17+     See less Customer Communication Long-term Customer... Executive-level... Technical Marketing Marketing Communications ASIC VLSI Static Timing Analysis TCL Semiconductors EDA Debugging CMOS RTL design Perl Microprocessors SoC Simulations Verilog SystemVerilog Processors Testing IC Silicon Logic Design Intel Stakeholder Analysis Cross-functional Team... Program Management Integration Linux Python See 17+     See less Education University of California, Berkeley, Haas School of Business Master of Business Administration (MBA),  Marketing and Strategy 2014  – 2017 Activities and Societies:  VP of Evening Weekend MBA Association Colorado State University MS,  Electrical and Computer Engineering St. Bede's AIHS School High School University of Madras Bachelor of Engineering,  Electrical and Electronics Engineering University of California, Berkeley, Haas School of Business Master of Business Administration (MBA),  Marketing and Strategy 2014  – 2017 Activities and Societies:  VP of Evening Weekend MBA Association University of California, Berkeley, Haas School of Business Master of Business Administration (MBA),  Marketing and Strategy 2014  – 2017 Activities and Societies:  VP of Evening Weekend MBA Association University of California, Berkeley, Haas School of Business Master of Business Administration (MBA),  Marketing and Strategy 2014  – 2017 Activities and Societies:  VP of Evening Weekend MBA Association Colorado State University MS,  Electrical and Computer Engineering Colorado State University MS,  Electrical and Computer Engineering Colorado State University MS,  Electrical and Computer Engineering St. Bede's AIHS School High School St. Bede's AIHS School High School St. Bede's AIHS School High School University of Madras Bachelor of Engineering,  Electrical and Electronics Engineering University of Madras Bachelor of Engineering,  Electrical and Electronics Engineering University of Madras Bachelor of Engineering,  Electrical and Electronics Engineering Honors & Awards ", "Summary Motivated engineer who likes to solve problems. For the last five years, solving design and tools/flows problems for semiconductor design.  \n \n Summary Motivated engineer who likes to solve problems. For the last five years, solving design and tools/flows problems for semiconductor design.  \n \n Motivated engineer who likes to solve problems. For the last five years, solving design and tools/flows problems for semiconductor design.  \n \n Motivated engineer who likes to solve problems. For the last five years, solving design and tools/flows problems for semiconductor design.  \n \n Experience Design Automation Engineer Intel Corporation March 2010  – Present (5 years 6 months) Hillsboro, OR Working on tools, flows, methods for semiconductor design construction flows using standard industry tools. Solving design problems and providing solutions for client and SoC platforms.  Intern Intel September 2008  –  May 2009  (9 months) Design Engineer Oneirix Labs September 2006  –  September 2007  (1 year 1 month) Design Engineer Conexant Systems 2005  –  2006  (1 year) Design Automation Engineer Intel Corporation March 2010  – Present (5 years 6 months) Hillsboro, OR Working on tools, flows, methods for semiconductor design construction flows using standard industry tools. Solving design problems and providing solutions for client and SoC platforms.  Design Automation Engineer Intel Corporation March 2010  – Present (5 years 6 months) Hillsboro, OR Working on tools, flows, methods for semiconductor design construction flows using standard industry tools. Solving design problems and providing solutions for client and SoC platforms.  Intern Intel September 2008  –  May 2009  (9 months) Intern Intel September 2008  –  May 2009  (9 months) Design Engineer Oneirix Labs September 2006  –  September 2007  (1 year 1 month) Design Engineer Oneirix Labs September 2006  –  September 2007  (1 year 1 month) Design Engineer Conexant Systems 2005  –  2006  (1 year) Design Engineer Conexant Systems 2005  –  2006  (1 year) Languages Hindi Tamil Marathi English Hindi Tamil Marathi English Hindi Tamil Marathi English Skills RTL design Static Timing Analysis ASIC Verilog VLSI SoC Cadence Virtuoso TCL VHDL Integrated Circuit... CMOS Digital Signal... Computer Architecture Semiconductors DFT Matlab C Embedded Systems Logic Synthesis Timing Closure Logic Design See 6+     See less Skills  RTL design Static Timing Analysis ASIC Verilog VLSI SoC Cadence Virtuoso TCL VHDL Integrated Circuit... CMOS Digital Signal... Computer Architecture Semiconductors DFT Matlab C Embedded Systems Logic Synthesis Timing Closure Logic Design See 6+     See less RTL design Static Timing Analysis ASIC Verilog VLSI SoC Cadence Virtuoso TCL VHDL Integrated Circuit... CMOS Digital Signal... Computer Architecture Semiconductors DFT Matlab C Embedded Systems Logic Synthesis Timing Closure Logic Design See 6+     See less RTL design Static Timing Analysis ASIC Verilog VLSI SoC Cadence Virtuoso TCL VHDL Integrated Circuit... CMOS Digital Signal... Computer Architecture Semiconductors DFT Matlab C Embedded Systems Logic Synthesis Timing Closure Logic Design See 6+     See less Education University of Minnesota-Twin Cities Master of Science,  Electrical Engineering 2007  – 2009 University of Pune Bachelor of Engineering (B.E.),  Electrical , Electronics and Communications Engineering 2001  – 2005 Activities and Societies:  IEEE University of Minnesota-Twin Cities Master of Science,  Electrical Engineering 2007  – 2009 University of Minnesota-Twin Cities Master of Science,  Electrical Engineering 2007  – 2009 University of Minnesota-Twin Cities Master of Science,  Electrical Engineering 2007  – 2009 University of Pune Bachelor of Engineering (B.E.),  Electrical , Electronics and Communications Engineering 2001  – 2005 Activities and Societies:  IEEE University of Pune Bachelor of Engineering (B.E.),  Electrical , Electronics and Communications Engineering 2001  – 2005 Activities and Societies:  IEEE University of Pune Bachelor of Engineering (B.E.),  Electrical , Electronics and Communications Engineering 2001  – 2005 Activities and Societies:  IEEE ", "Summary 14 years experiences in IC design automation. Developed/delivered/supported various custom design flows/solutions including RC extraction, analog-simulation, sram-compiler and high-voltage EOS/DRC. Individual contributor with in-depth technical knowledge as well as excellent in coordinating/prioritizing projects requirements with existing resources (was a technical leader/coach of 4 individuals from multiple organization across 3 different time zones). \n•\tIn depth knowledge in custom design LVS, Parasitic Extraction, Circuit Simulation/Characterization, SRAM design automation and High-Voltage compliance checking solution. \n•\tOwned and developed from scratch the full flow of High-Voltage solution to support 10nm, 14nm design activities (for all Intel products except 14nm wireless) including simulation, LVS, error checking and waiving condition/mechanism. (Involved tools: Calibre-PERC/LDL, ICV, ADE/intel-simulator) \n•\tDeveloped and supported transistor level parasitic extraction flow for Intel chip design team. (Hercules/ICV/Calibre-StarRCXT/QRC/Intel Internal Parasitic Extraction Solution) \n•\tDeveloped the 32nm/22nm memory compiler from scratch. \n•\tIn depth understanding in Cadence Front-end and Back-End tool (DFII, netlisters, simulation, virtuoso layout editor). \n•\tExcellent in programming and flow writing (PERL, SKILL, TCL, C-Shell, C++, QT) and tools integration. \n•\tIntel DTTC reviewer for year 2014 (abstract only) and 2015 \n Summary 14 years experiences in IC design automation. Developed/delivered/supported various custom design flows/solutions including RC extraction, analog-simulation, sram-compiler and high-voltage EOS/DRC. Individual contributor with in-depth technical knowledge as well as excellent in coordinating/prioritizing projects requirements with existing resources (was a technical leader/coach of 4 individuals from multiple organization across 3 different time zones). \n•\tIn depth knowledge in custom design LVS, Parasitic Extraction, Circuit Simulation/Characterization, SRAM design automation and High-Voltage compliance checking solution. \n•\tOwned and developed from scratch the full flow of High-Voltage solution to support 10nm, 14nm design activities (for all Intel products except 14nm wireless) including simulation, LVS, error checking and waiving condition/mechanism. (Involved tools: Calibre-PERC/LDL, ICV, ADE/intel-simulator) \n•\tDeveloped and supported transistor level parasitic extraction flow for Intel chip design team. (Hercules/ICV/Calibre-StarRCXT/QRC/Intel Internal Parasitic Extraction Solution) \n•\tDeveloped the 32nm/22nm memory compiler from scratch. \n•\tIn depth understanding in Cadence Front-end and Back-End tool (DFII, netlisters, simulation, virtuoso layout editor). \n•\tExcellent in programming and flow writing (PERL, SKILL, TCL, C-Shell, C++, QT) and tools integration. \n•\tIntel DTTC reviewer for year 2014 (abstract only) and 2015 \n 14 years experiences in IC design automation. Developed/delivered/supported various custom design flows/solutions including RC extraction, analog-simulation, sram-compiler and high-voltage EOS/DRC. Individual contributor with in-depth technical knowledge as well as excellent in coordinating/prioritizing projects requirements with existing resources (was a technical leader/coach of 4 individuals from multiple organization across 3 different time zones). \n•\tIn depth knowledge in custom design LVS, Parasitic Extraction, Circuit Simulation/Characterization, SRAM design automation and High-Voltage compliance checking solution. \n•\tOwned and developed from scratch the full flow of High-Voltage solution to support 10nm, 14nm design activities (for all Intel products except 14nm wireless) including simulation, LVS, error checking and waiving condition/mechanism. (Involved tools: Calibre-PERC/LDL, ICV, ADE/intel-simulator) \n•\tDeveloped and supported transistor level parasitic extraction flow for Intel chip design team. (Hercules/ICV/Calibre-StarRCXT/QRC/Intel Internal Parasitic Extraction Solution) \n•\tDeveloped the 32nm/22nm memory compiler from scratch. \n•\tIn depth understanding in Cadence Front-end and Back-End tool (DFII, netlisters, simulation, virtuoso layout editor). \n•\tExcellent in programming and flow writing (PERL, SKILL, TCL, C-Shell, C++, QT) and tools integration. \n•\tIntel DTTC reviewer for year 2014 (abstract only) and 2015 \n 14 years experiences in IC design automation. Developed/delivered/supported various custom design flows/solutions including RC extraction, analog-simulation, sram-compiler and high-voltage EOS/DRC. Individual contributor with in-depth technical knowledge as well as excellent in coordinating/prioritizing projects requirements with existing resources (was a technical leader/coach of 4 individuals from multiple organization across 3 different time zones). \n•\tIn depth knowledge in custom design LVS, Parasitic Extraction, Circuit Simulation/Characterization, SRAM design automation and High-Voltage compliance checking solution. \n•\tOwned and developed from scratch the full flow of High-Voltage solution to support 10nm, 14nm design activities (for all Intel products except 14nm wireless) including simulation, LVS, error checking and waiving condition/mechanism. (Involved tools: Calibre-PERC/LDL, ICV, ADE/intel-simulator) \n•\tDeveloped and supported transistor level parasitic extraction flow for Intel chip design team. (Hercules/ICV/Calibre-StarRCXT/QRC/Intel Internal Parasitic Extraction Solution) \n•\tDeveloped the 32nm/22nm memory compiler from scratch. \n•\tIn depth understanding in Cadence Front-end and Back-End tool (DFII, netlisters, simulation, virtuoso layout editor). \n•\tExcellent in programming and flow writing (PERL, SKILL, TCL, C-Shell, C++, QT) and tools integration. \n•\tIntel DTTC reviewer for year 2014 (abstract only) and 2015 \n Experience Application and Solution Consultant Intel Corporation July 2015  – Present (2 months) Sr Staff Corporate Design Solutions Engineer Intel Corporation November 2013  –  June 2015  (1 year 8 months) Penang, Malaysia High-Voltage solution owner/developer in CDS.  \n•\tTook over new charter in establishing new high-voltage solution framework and solution for Intel new processes partnered with Intel QRE and MIG team. Drove and Developed single push button solution and algorithm for HV compliance checking solution. Sr. Staff Corporate Design Solutions Engineer Intel Corporation October 2011  –  November 2013  (2 years 2 months) Penang, Malaysia Senior technical leader champions RC extraction solution from definition and methodology to development and deployment for DTS-CDS (Design Technology Services – Corporate Design Solutions) worldwide customers.  Sr. Staff Design Automation Engineer Intel Corporation October 2010  –  October 2011  (1 year 1 month) Penang, Malaysia Hard IP (HIP) Parasitic Extraction owner for all 14nm/22nm/32nm/45nm process nodes. Partnered with DTS to enabled 14nm parasitic extraction flow and deployed to HIP 14nm and 22nm process nodes. Staff Design Automation Engineer Intel Corporation May 2008  –  August 2010  (2 years 4 months) Penang, Malaysia Division Memory Compiler Owner. Developed from scratch the 32nm/22nm memory compiler and supported ASDG, DHG memory design activities. Helped in GPIO IO compiler initiative. Sr. Design Automation Engineer Intel Corporation May 2004  –  May 2008  (4 years 1 month) penang, malaysia Division transistor level Parasitic Extraction owner. Responsible for IO and EBB RC extraction and post-layout simulation flow for all chipset projects across different processes (0.13u, 90n, 65n) Design Automation Engineer Intel Corporation May 2003  –  May 2004  (1 year 1 month) penang, malaysia Flow developer for custom design entry. Responsible for new tools integration into home-developed cross site custom design flow as well as provided consultation to Project Design Automation Engineers. Developed/Suported tools covered ESD verification flow, Circuit Rule Checking. \n Project Design Automation Engineer Intel Corporation August 2001  –  May 2003  (1 year 10 months) Penang, Malaysia Developed and supported tools for full custom IO/EBB circuit design in layout, schematic entry, and physical verification. Evaluated and integrated new design tools into design automation flow. \n•\tSingle contact for all custom design flow issues for single project. \n•\tSupported and provided enhancements to home developed data-management system. \n Application and Solution Consultant Intel Corporation July 2015  – Present (2 months) Application and Solution Consultant Intel Corporation July 2015  – Present (2 months) Sr Staff Corporate Design Solutions Engineer Intel Corporation November 2013  –  June 2015  (1 year 8 months) Penang, Malaysia High-Voltage solution owner/developer in CDS.  \n•\tTook over new charter in establishing new high-voltage solution framework and solution for Intel new processes partnered with Intel QRE and MIG team. Drove and Developed single push button solution and algorithm for HV compliance checking solution. Sr Staff Corporate Design Solutions Engineer Intel Corporation November 2013  –  June 2015  (1 year 8 months) Penang, Malaysia High-Voltage solution owner/developer in CDS.  \n•\tTook over new charter in establishing new high-voltage solution framework and solution for Intel new processes partnered with Intel QRE and MIG team. Drove and Developed single push button solution and algorithm for HV compliance checking solution. Sr. Staff Corporate Design Solutions Engineer Intel Corporation October 2011  –  November 2013  (2 years 2 months) Penang, Malaysia Senior technical leader champions RC extraction solution from definition and methodology to development and deployment for DTS-CDS (Design Technology Services – Corporate Design Solutions) worldwide customers.  Sr. Staff Corporate Design Solutions Engineer Intel Corporation October 2011  –  November 2013  (2 years 2 months) Penang, Malaysia Senior technical leader champions RC extraction solution from definition and methodology to development and deployment for DTS-CDS (Design Technology Services – Corporate Design Solutions) worldwide customers.  Sr. Staff Design Automation Engineer Intel Corporation October 2010  –  October 2011  (1 year 1 month) Penang, Malaysia Hard IP (HIP) Parasitic Extraction owner for all 14nm/22nm/32nm/45nm process nodes. Partnered with DTS to enabled 14nm parasitic extraction flow and deployed to HIP 14nm and 22nm process nodes. Sr. Staff Design Automation Engineer Intel Corporation October 2010  –  October 2011  (1 year 1 month) Penang, Malaysia Hard IP (HIP) Parasitic Extraction owner for all 14nm/22nm/32nm/45nm process nodes. Partnered with DTS to enabled 14nm parasitic extraction flow and deployed to HIP 14nm and 22nm process nodes. Staff Design Automation Engineer Intel Corporation May 2008  –  August 2010  (2 years 4 months) Penang, Malaysia Division Memory Compiler Owner. Developed from scratch the 32nm/22nm memory compiler and supported ASDG, DHG memory design activities. Helped in GPIO IO compiler initiative. Staff Design Automation Engineer Intel Corporation May 2008  –  August 2010  (2 years 4 months) Penang, Malaysia Division Memory Compiler Owner. Developed from scratch the 32nm/22nm memory compiler and supported ASDG, DHG memory design activities. Helped in GPIO IO compiler initiative. Sr. Design Automation Engineer Intel Corporation May 2004  –  May 2008  (4 years 1 month) penang, malaysia Division transistor level Parasitic Extraction owner. Responsible for IO and EBB RC extraction and post-layout simulation flow for all chipset projects across different processes (0.13u, 90n, 65n) Sr. Design Automation Engineer Intel Corporation May 2004  –  May 2008  (4 years 1 month) penang, malaysia Division transistor level Parasitic Extraction owner. Responsible for IO and EBB RC extraction and post-layout simulation flow for all chipset projects across different processes (0.13u, 90n, 65n) Design Automation Engineer Intel Corporation May 2003  –  May 2004  (1 year 1 month) penang, malaysia Flow developer for custom design entry. Responsible for new tools integration into home-developed cross site custom design flow as well as provided consultation to Project Design Automation Engineers. Developed/Suported tools covered ESD verification flow, Circuit Rule Checking. \n Design Automation Engineer Intel Corporation May 2003  –  May 2004  (1 year 1 month) penang, malaysia Flow developer for custom design entry. Responsible for new tools integration into home-developed cross site custom design flow as well as provided consultation to Project Design Automation Engineers. Developed/Suported tools covered ESD verification flow, Circuit Rule Checking. \n Project Design Automation Engineer Intel Corporation August 2001  –  May 2003  (1 year 10 months) Penang, Malaysia Developed and supported tools for full custom IO/EBB circuit design in layout, schematic entry, and physical verification. Evaluated and integrated new design tools into design automation flow. \n•\tSingle contact for all custom design flow issues for single project. \n•\tSupported and provided enhancements to home developed data-management system. \n Project Design Automation Engineer Intel Corporation August 2001  –  May 2003  (1 year 10 months) Penang, Malaysia Developed and supported tools for full custom IO/EBB circuit design in layout, schematic entry, and physical verification. Evaluated and integrated new design tools into design automation flow. \n•\tSingle contact for all custom design flow issues for single project. \n•\tSupported and provided enhancements to home developed data-management system. \n Languages English Professional working proficiency Chinese Native or bilingual proficiency Malay Professional working proficiency Hokkien (Fujian) Native or bilingual proficiency English Professional working proficiency Chinese Native or bilingual proficiency Malay Professional working proficiency Hokkien (Fujian) Native or bilingual proficiency English Professional working proficiency Chinese Native or bilingual proficiency Malay Professional working proficiency Hokkien (Fujian) Native or bilingual proficiency Professional working proficiency Native or bilingual proficiency Professional working proficiency Native or bilingual proficiency Skills VLSI ASIC SoC Parasitic Extraction StarRC EDA TCL C++ Verilog Debugging PERL IC CMOS Semiconductors Hercules Calibre-LVS Unix Programming Layout QRC IC Validator Cadence Analog Artist Cadence Virtuoso Cadence schematic... Post-Layout Simulation... Memory Compiler SRAM design and... Cadence Skill QT Calibre-PERC C Integrated Circuit... See 17+     See less Skills  VLSI ASIC SoC Parasitic Extraction StarRC EDA TCL C++ Verilog Debugging PERL IC CMOS Semiconductors Hercules Calibre-LVS Unix Programming Layout QRC IC Validator Cadence Analog Artist Cadence Virtuoso Cadence schematic... Post-Layout Simulation... Memory Compiler SRAM design and... Cadence Skill QT Calibre-PERC C Integrated Circuit... See 17+     See less VLSI ASIC SoC Parasitic Extraction StarRC EDA TCL C++ Verilog Debugging PERL IC CMOS Semiconductors Hercules Calibre-LVS Unix Programming Layout QRC IC Validator Cadence Analog Artist Cadence Virtuoso Cadence schematic... Post-Layout Simulation... Memory Compiler SRAM design and... Cadence Skill QT Calibre-PERC C Integrated Circuit... See 17+     See less VLSI ASIC SoC Parasitic Extraction StarRC EDA TCL C++ Verilog Debugging PERL IC CMOS Semiconductors Hercules Calibre-LVS Unix Programming Layout QRC IC Validator Cadence Analog Artist Cadence Virtuoso Cadence schematic... Post-Layout Simulation... Memory Compiler SRAM design and... Cadence Skill QT Calibre-PERC C Integrated Circuit... See 17+     See less Education University Technology of Malaysia Bachelor of Computer Engineering,  Electrical and Computer Engineering 1997  – 2001 University Technology of Malaysia Bachelor of Computer Engineering,  Electrical and Computer Engineering 1997  – 2001 University Technology of Malaysia Bachelor of Computer Engineering,  Electrical and Computer Engineering 1997  – 2001 University Technology of Malaysia Bachelor of Computer Engineering,  Electrical and Computer Engineering 1997  – 2001 ", "Experience Senior Design Automation Engineer Intel Corporation October 2011  – Present (3 years 11 months) Hillsboro, Oregon Senior Design Automation Engineer Intel Corporation October 2011  – Present (3 years 11 months) Hillsboro, Oregon Senior Design Automation Engineer Intel Corporation October 2011  – Present (3 years 11 months) Hillsboro, Oregon Skills EDA Mixed Signal Debugging C Cadence ASIC LVS IC SoC Simulations Integrated Circuit... Physical Design CMOS Low-power Design Semiconductors DRC Physical Verification Automation Embedded Systems C++ Verilog Schematic Capture Signal Integrity Linux Engineering Programming Perl Analog Management ModelSim See 15+     See less Skills  EDA Mixed Signal Debugging C Cadence ASIC LVS IC SoC Simulations Integrated Circuit... Physical Design CMOS Low-power Design Semiconductors DRC Physical Verification Automation Embedded Systems C++ Verilog Schematic Capture Signal Integrity Linux Engineering Programming Perl Analog Management ModelSim See 15+     See less EDA Mixed Signal Debugging C Cadence ASIC LVS IC SoC Simulations Integrated Circuit... Physical Design CMOS Low-power Design Semiconductors DRC Physical Verification Automation Embedded Systems C++ Verilog Schematic Capture Signal Integrity Linux Engineering Programming Perl Analog Management ModelSim See 15+     See less EDA Mixed Signal Debugging C Cadence ASIC LVS IC SoC Simulations Integrated Circuit... Physical Design CMOS Low-power Design Semiconductors DRC Physical Verification Automation Embedded Systems C++ Verilog Schematic Capture Signal Integrity Linux Engineering Programming Perl Analog Management ModelSim See 15+     See less ", "Experience Design Automation Manager Intel Corporation October 2012  – Present (2 years 11 months) Senior Design Automation Engineer Intel Corporation April 2011  – Present (4 years 5 months) Santa Clara, CA Design Automation Manager Intel Corporation October 2012  – Present (2 years 11 months) Design Automation Manager Intel Corporation October 2012  – Present (2 years 11 months) Senior Design Automation Engineer Intel Corporation April 2011  – Present (4 years 5 months) Santa Clara, CA Senior Design Automation Engineer Intel Corporation April 2011  – Present (4 years 5 months) Santa Clara, CA Languages English Telugu Hindi English Telugu Hindi English Telugu Hindi Skills Verilog Physical Design TCL ASIC SoC Static Timing Analysis Debugging RTL design EDA Functional Verification Computer Architecture Formal Verification Gate Level Simulation SystemVerilog Perl JasperGold Conformal LEC/LP/ECO PowerPro Verdi SLEC See 5+     See less Skills  Verilog Physical Design TCL ASIC SoC Static Timing Analysis Debugging RTL design EDA Functional Verification Computer Architecture Formal Verification Gate Level Simulation SystemVerilog Perl JasperGold Conformal LEC/LP/ECO PowerPro Verdi SLEC See 5+     See less Verilog Physical Design TCL ASIC SoC Static Timing Analysis Debugging RTL design EDA Functional Verification Computer Architecture Formal Verification Gate Level Simulation SystemVerilog Perl JasperGold Conformal LEC/LP/ECO PowerPro Verdi SLEC See 5+     See less Verilog Physical Design TCL ASIC SoC Static Timing Analysis Debugging RTL design EDA Functional Verification Computer Architecture Formal Verification Gate Level Simulation SystemVerilog Perl JasperGold Conformal LEC/LP/ECO PowerPro Verdi SLEC See 5+     See less ", "Experience SOC Design Automation Engineer Intel Corporation January 2011  – Present (4 years 8 months) Penang, Malaysia - Responsible to provide technical leadership and expertise to create flows/scripts to analyze and test design methodologies.  \n \n- Designs, tests and deploys tools to utilize and achieve design goals by collaborating with design teams on methodology development. Works closely with vendors and design teams to be an advocate of applying design methodologies to help execute projects effectively and successfully with high quality.  \n \n- Well versed in EDA Software and IC Design tools such as Synopsys Design Compiler, Mentor Graphics Tessent MemoryBist, Mentor Graphics Tessent TestKompress, Atrenta Spyglass DFT and Cadence Allegro Package Designer. Sr. Software Engineer Intel Corporation July 2005  –  December 2010  (5 years 6 months) Penang, Malaysia - Supported the transportation and logistics group in developing and owning next generation business intelligence and analytical tools.  \n \n- Developed a web based application to link non-finished inbound and outbound shipments into real time tracking.  \n \n- Developed a utility to proactively monitor customer’s user experience of the Web Order Management tool. Wrote an abstract about the utility and was accepted in the Intel Software Professionals Conference (SWPC) 2010.  Design Automation Engineer Intel Corporation May 2001  –  June 2005  (4 years 2 months) Penang, Malaysia - Supported package layout designers in development of design tools to enable complex design rule checks and automation of complicated design task for new and existing technologies.  \n \n- Strong command of the SKILL programming language. Created design flows to enable users to easily interact with the PCB Editor database. Software Engineer Intel Corporation March 1997  –  April 2001  (4 years 2 months) Penang, Malaysia - Supported manufacturing department as Workstream Analyst.  \n \n- Well versed with the manufacturing and planning business processes.  \n \n- Experienced in Decision Support Systems and Reporting Tools such as SQL database and Crystal Reports.  SOC Design Automation Engineer Intel Corporation January 2011  – Present (4 years 8 months) Penang, Malaysia - Responsible to provide technical leadership and expertise to create flows/scripts to analyze and test design methodologies.  \n \n- Designs, tests and deploys tools to utilize and achieve design goals by collaborating with design teams on methodology development. Works closely with vendors and design teams to be an advocate of applying design methodologies to help execute projects effectively and successfully with high quality.  \n \n- Well versed in EDA Software and IC Design tools such as Synopsys Design Compiler, Mentor Graphics Tessent MemoryBist, Mentor Graphics Tessent TestKompress, Atrenta Spyglass DFT and Cadence Allegro Package Designer. SOC Design Automation Engineer Intel Corporation January 2011  – Present (4 years 8 months) Penang, Malaysia - Responsible to provide technical leadership and expertise to create flows/scripts to analyze and test design methodologies.  \n \n- Designs, tests and deploys tools to utilize and achieve design goals by collaborating with design teams on methodology development. Works closely with vendors and design teams to be an advocate of applying design methodologies to help execute projects effectively and successfully with high quality.  \n \n- Well versed in EDA Software and IC Design tools such as Synopsys Design Compiler, Mentor Graphics Tessent MemoryBist, Mentor Graphics Tessent TestKompress, Atrenta Spyglass DFT and Cadence Allegro Package Designer. Sr. Software Engineer Intel Corporation July 2005  –  December 2010  (5 years 6 months) Penang, Malaysia - Supported the transportation and logistics group in developing and owning next generation business intelligence and analytical tools.  \n \n- Developed a web based application to link non-finished inbound and outbound shipments into real time tracking.  \n \n- Developed a utility to proactively monitor customer’s user experience of the Web Order Management tool. Wrote an abstract about the utility and was accepted in the Intel Software Professionals Conference (SWPC) 2010.  Sr. Software Engineer Intel Corporation July 2005  –  December 2010  (5 years 6 months) Penang, Malaysia - Supported the transportation and logistics group in developing and owning next generation business intelligence and analytical tools.  \n \n- Developed a web based application to link non-finished inbound and outbound shipments into real time tracking.  \n \n- Developed a utility to proactively monitor customer’s user experience of the Web Order Management tool. Wrote an abstract about the utility and was accepted in the Intel Software Professionals Conference (SWPC) 2010.  Design Automation Engineer Intel Corporation May 2001  –  June 2005  (4 years 2 months) Penang, Malaysia - Supported package layout designers in development of design tools to enable complex design rule checks and automation of complicated design task for new and existing technologies.  \n \n- Strong command of the SKILL programming language. Created design flows to enable users to easily interact with the PCB Editor database. Design Automation Engineer Intel Corporation May 2001  –  June 2005  (4 years 2 months) Penang, Malaysia - Supported package layout designers in development of design tools to enable complex design rule checks and automation of complicated design task for new and existing technologies.  \n \n- Strong command of the SKILL programming language. Created design flows to enable users to easily interact with the PCB Editor database. Software Engineer Intel Corporation March 1997  –  April 2001  (4 years 2 months) Penang, Malaysia - Supported manufacturing department as Workstream Analyst.  \n \n- Well versed with the manufacturing and planning business processes.  \n \n- Experienced in Decision Support Systems and Reporting Tools such as SQL database and Crystal Reports.  Software Engineer Intel Corporation March 1997  –  April 2001  (4 years 2 months) Penang, Malaysia - Supported manufacturing department as Workstream Analyst.  \n \n- Well versed with the manufacturing and planning business processes.  \n \n- Experienced in Decision Support Systems and Reporting Tools such as SQL database and Crystal Reports.  Languages   Skills C C++ TCL Perl Linux Unix DFX Software Engineering Software Development Embedded Systems Debugging Testing SoC EDA Programming Skills  C C++ TCL Perl Linux Unix DFX Software Engineering Software Development Embedded Systems Debugging Testing SoC EDA Programming C C++ TCL Perl Linux Unix DFX Software Engineering Software Development Embedded Systems Debugging Testing SoC EDA Programming C C++ TCL Perl Linux Unix DFX Software Engineering Software Development Embedded Systems Debugging Testing SoC EDA Programming Education Swinburne University of Technology Bachelor’s Degree,  Computer Science , High Distinction 1994  – 1996 Swinburne University of Technology Bachelor’s Degree,  Computer Science , High Distinction 1994  – 1996 Swinburne University of Technology Bachelor’s Degree,  Computer Science , High Distinction 1994  – 1996 Swinburne University of Technology Bachelor’s Degree,  Computer Science , High Distinction 1994  – 1996 ", "Experience Design Automation Engineer Intel Corporation Design Automation Engineer Intel Corporation Design Automation Engineer Intel Corporation Education University of Maryland College Park 2001  – 2003 PS Senior Sec School University of Maryland College Park 2001  – 2003 University of Maryland College Park 2001  – 2003 University of Maryland College Park 2001  – 2003 PS Senior Sec School PS Senior Sec School PS Senior Sec School ", "Skills Ubuntu CentOS Linux Servers Red Hat Linux Windows 7 Storage Perl Unix Hardware TCP/IP Operating Systems Linux System... High Performance... System Architecture Skills  Ubuntu CentOS Linux Servers Red Hat Linux Windows 7 Storage Perl Unix Hardware TCP/IP Operating Systems Linux System... High Performance... System Architecture Ubuntu CentOS Linux Servers Red Hat Linux Windows 7 Storage Perl Unix Hardware TCP/IP Operating Systems Linux System... High Performance... System Architecture Ubuntu CentOS Linux Servers Red Hat Linux Windows 7 Storage Perl Unix Hardware TCP/IP Operating Systems Linux System... High Performance... System Architecture ", "Summary To leverage my skills & experience in Electronic CAD Design Flow development and EDA Software Development as part of a dynamic team to drive the design and implementation of next generation SoC designs. \n \nSkills & Specialties:  \n- Power Estimation & optimization (Synopsys Power Compiler)  \n- RTL Synthesis (Synopsys Design Compiler)  \n- RTL Design Analysis & Debug in Verdi (Synopsys) and Spyglass (Atrenta)  \n- Synopsys Liberty timing/power model generation  \n- EDA tool evaluation & SoC Design Flow development  \n- Scripting: Perl, Tcl, Python  \n- Software Development: C++, Java \n- Web Interface development using HTML and Javascript frameworks: (jQuery,Highcharts) \n- Web Interface QA automation (CasperJS, PhantomJS) \n- Server side: Node.js Summary To leverage my skills & experience in Electronic CAD Design Flow development and EDA Software Development as part of a dynamic team to drive the design and implementation of next generation SoC designs. \n \nSkills & Specialties:  \n- Power Estimation & optimization (Synopsys Power Compiler)  \n- RTL Synthesis (Synopsys Design Compiler)  \n- RTL Design Analysis & Debug in Verdi (Synopsys) and Spyglass (Atrenta)  \n- Synopsys Liberty timing/power model generation  \n- EDA tool evaluation & SoC Design Flow development  \n- Scripting: Perl, Tcl, Python  \n- Software Development: C++, Java \n- Web Interface development using HTML and Javascript frameworks: (jQuery,Highcharts) \n- Web Interface QA automation (CasperJS, PhantomJS) \n- Server side: Node.js To leverage my skills & experience in Electronic CAD Design Flow development and EDA Software Development as part of a dynamic team to drive the design and implementation of next generation SoC designs. \n \nSkills & Specialties:  \n- Power Estimation & optimization (Synopsys Power Compiler)  \n- RTL Synthesis (Synopsys Design Compiler)  \n- RTL Design Analysis & Debug in Verdi (Synopsys) and Spyglass (Atrenta)  \n- Synopsys Liberty timing/power model generation  \n- EDA tool evaluation & SoC Design Flow development  \n- Scripting: Perl, Tcl, Python  \n- Software Development: C++, Java \n- Web Interface development using HTML and Javascript frameworks: (jQuery,Highcharts) \n- Web Interface QA automation (CasperJS, PhantomJS) \n- Server side: Node.js To leverage my skills & experience in Electronic CAD Design Flow development and EDA Software Development as part of a dynamic team to drive the design and implementation of next generation SoC designs. \n \nSkills & Specialties:  \n- Power Estimation & optimization (Synopsys Power Compiler)  \n- RTL Synthesis (Synopsys Design Compiler)  \n- RTL Design Analysis & Debug in Verdi (Synopsys) and Spyglass (Atrenta)  \n- Synopsys Liberty timing/power model generation  \n- EDA tool evaluation & SoC Design Flow development  \n- Scripting: Perl, Tcl, Python  \n- Software Development: C++, Java \n- Web Interface development using HTML and Javascript frameworks: (jQuery,Highcharts) \n- Web Interface QA automation (CasperJS, PhantomJS) \n- Server side: Node.js Experience EDA Software Developer Dassault Systèmes November 2013  –  July 2015  (1 year 9 months) Chandler AZ Core Responsibilities: \n- Use C++ to design develop core features of Enovia Pinpoint Design collaboration solution \n- Develop C++ Unit Tests using Google Test API to test core features. \n- Architect & Develop automated web front end testing framework consistiung of an API and utilities to validate the Web UI of Pinpoint, used CasperJS, PhantomJS and NodeJS  \n- Develop Perl/Tcl plugins to augment Pinpoint functionality \n \nTools: \nLanguages: C++, Javascript, Perl, HTML,Tcl \nSource code management: SVN \nJavascript Frameworks:  \n- jQuery (DOM Manipulation http://www.jquery.com),  \n- Highcharts (Interactive Charting API: http://www.highcharts.com) \n- PhantomJS (Headless Webkit based scriptable: http://www.phantomjs.org)  \n- CasperJS (Navigation scripting & testing utility for PhantomJS: http://www.casperjs.org) \nPlatform: Linux \n- NodeJS (Javascript runtime)  Principal CAD Engineer Microchip Technology May 2012  –  November 2013  (1 year 7 months) Chandler Arizona USA Additional Responsibilities (2009-2013 in addition to Sr CAD Engineer responsibilities): \n================================================================ \n1. Principal Developer and Maintainer for in-house Custom Block Modelling toolsuite: Said toolsuite generates Liberty timing models of custom macros for use by implementation & analysis tools in the digital flowa (e.g DesignCompiler, PrimeTime, IC-Compiler, Spyglass). \n2. Enhanced toolsuite to generate Liberty models with Dynamic Power Consumption and Signal Integrity data: - Developed simulation and characterization methodology to measure & augment Liberty timing models with Dynamic Power & Signal Integrity data \n3. Designed Developed & Implemented a Perl/Tk GUI front-end for toolsuite for liberty collateral generation from macro data  \n4. Train Designers in the usage of above toolsuite to generate custom macro collateral \n Sr. CAD Engineer Microchip Technology Inc May 2007  –  May 2012  (5 years 1 month) Chandler AZ Responsibilities \n============ \n- Evaluate Research & Develop new CAD Flows for RTL Synthesis, Power Optimization, Formal Verification using Synopsys tools ( Design Compiler, Power Compiler Formality) \n- Deploy & support existing EDA tools & flows in the above areas to design groups. Optimize existing EDA flows with new tool capabilities as they are available. \n- Document and publish new EDA tool evaluation results, existing tool flows. \n- Design, implement, deploy & support internal Perl and Tcl/Tk based EDA software and utilities. \n- Interface with external EDA tool & flow vendors to identify and resolve tool and EDA flow issues and bring in new tool capabilities to accelerate designer productivity. \n- Qualify, Maintain installed versions, Deploy new versions, and actively support usage of Synopsys Verdi (Design Visualization and Debug tool) \n- Accelerate the adoption of advanced design methodologies in Microchip by qualifying the SystemVerilog support in Springsoft products.  \n- Interface with Springsoft application support team to report tool issues, new feature enhancement requests. Co-ordinate with Springsoft Application Engineering to organize internal training programs for Microchip design teams. CAD Engineer Microchip Technology Inc June 2004  –  May 2007  (3 years) Click to edit position description- Evaluate Research & Develop new CAD Flows for RTL Synthesis, Power Optimization, Formal Verification using Synopsys tools ( Design Compiler, Power Compiler Formality) \n- Deploy & support existing EDA tools & flows in the above areas to design groups. Optimize existing EDA flows with new tool capabilities as they are available. \n- Document and publish new EDA tool evaluation results, existing tool flows. \n- Design, implement, deploy & support internal Perl and Tcl/Tk based EDA software and utilities. \n- Interface with external EDA tool & flow vendors to identify and resolve tool and EDA flow issues and bring in new tool capabilities to accelerate designer productivity. \n- Qualify, Maintain installed versions, Deploy new versions, and actively support usage of Synopsys Verdi (Design Visualization and Debug tool) \n- Accelerate the adoption of advanced design methodologies in Microchip by qualifying the SystemVerilog support in Springsoft products.  \n- Interface with Springsoft application support team to report tool issues, new feature enhancement requests. Co-ordinate with Springsoft Application Engineering to organize internal training programs for Microchip design teams. Graduate Research Student Department of EECS, Syracuse University December 2002  –  May 2004  (1 year 6 months) Syracuse, New York Area Accomplishments: \nDesigned and developed of an internal High Level Synthesis Tool (HLS). Developed the overall HLS system architecture. Designed and implemented the front end VHDL lexical and parsing modules in C++ for HLS. Researched and developed Low Power VLSI design methodologies and algorithms targeted toward Low Power applications. Software Design Engineer Intern Microsoft Corp May 2001  –  August 2001  (4 months) Accomplishments: \nDeveloped an Automated Test Framework in JScript for testing the Application Restore tool designed for use with .NET applications. Designed and developed test cases to test both core functionality and UI functionality. Wrote core functionality test scripts to validate the tool in simulated real world scenarios. Wrote UI functionality test scripts that programmatically simulated user interaction (clicking buttons, selecting items within a list) with the tool UI. Extended the UI test scripts to verify the correct sequence of dialog boxes. Generalized the core and UI test scripts to be test case independent. Designed the overall framework to be modular and extensible. EDA Software Developer Dassault Systèmes November 2013  –  July 2015  (1 year 9 months) Chandler AZ Core Responsibilities: \n- Use C++ to design develop core features of Enovia Pinpoint Design collaboration solution \n- Develop C++ Unit Tests using Google Test API to test core features. \n- Architect & Develop automated web front end testing framework consistiung of an API and utilities to validate the Web UI of Pinpoint, used CasperJS, PhantomJS and NodeJS  \n- Develop Perl/Tcl plugins to augment Pinpoint functionality \n \nTools: \nLanguages: C++, Javascript, Perl, HTML,Tcl \nSource code management: SVN \nJavascript Frameworks:  \n- jQuery (DOM Manipulation http://www.jquery.com),  \n- Highcharts (Interactive Charting API: http://www.highcharts.com) \n- PhantomJS (Headless Webkit based scriptable: http://www.phantomjs.org)  \n- CasperJS (Navigation scripting & testing utility for PhantomJS: http://www.casperjs.org) \nPlatform: Linux \n- NodeJS (Javascript runtime)  EDA Software Developer Dassault Systèmes November 2013  –  July 2015  (1 year 9 months) Chandler AZ Core Responsibilities: \n- Use C++ to design develop core features of Enovia Pinpoint Design collaboration solution \n- Develop C++ Unit Tests using Google Test API to test core features. \n- Architect & Develop automated web front end testing framework consistiung of an API and utilities to validate the Web UI of Pinpoint, used CasperJS, PhantomJS and NodeJS  \n- Develop Perl/Tcl plugins to augment Pinpoint functionality \n \nTools: \nLanguages: C++, Javascript, Perl, HTML,Tcl \nSource code management: SVN \nJavascript Frameworks:  \n- jQuery (DOM Manipulation http://www.jquery.com),  \n- Highcharts (Interactive Charting API: http://www.highcharts.com) \n- PhantomJS (Headless Webkit based scriptable: http://www.phantomjs.org)  \n- CasperJS (Navigation scripting & testing utility for PhantomJS: http://www.casperjs.org) \nPlatform: Linux \n- NodeJS (Javascript runtime)  Principal CAD Engineer Microchip Technology May 2012  –  November 2013  (1 year 7 months) Chandler Arizona USA Additional Responsibilities (2009-2013 in addition to Sr CAD Engineer responsibilities): \n================================================================ \n1. Principal Developer and Maintainer for in-house Custom Block Modelling toolsuite: Said toolsuite generates Liberty timing models of custom macros for use by implementation & analysis tools in the digital flowa (e.g DesignCompiler, PrimeTime, IC-Compiler, Spyglass). \n2. Enhanced toolsuite to generate Liberty models with Dynamic Power Consumption and Signal Integrity data: - Developed simulation and characterization methodology to measure & augment Liberty timing models with Dynamic Power & Signal Integrity data \n3. Designed Developed & Implemented a Perl/Tk GUI front-end for toolsuite for liberty collateral generation from macro data  \n4. Train Designers in the usage of above toolsuite to generate custom macro collateral \n Principal CAD Engineer Microchip Technology May 2012  –  November 2013  (1 year 7 months) Chandler Arizona USA Additional Responsibilities (2009-2013 in addition to Sr CAD Engineer responsibilities): \n================================================================ \n1. Principal Developer and Maintainer for in-house Custom Block Modelling toolsuite: Said toolsuite generates Liberty timing models of custom macros for use by implementation & analysis tools in the digital flowa (e.g DesignCompiler, PrimeTime, IC-Compiler, Spyglass). \n2. Enhanced toolsuite to generate Liberty models with Dynamic Power Consumption and Signal Integrity data: - Developed simulation and characterization methodology to measure & augment Liberty timing models with Dynamic Power & Signal Integrity data \n3. Designed Developed & Implemented a Perl/Tk GUI front-end for toolsuite for liberty collateral generation from macro data  \n4. Train Designers in the usage of above toolsuite to generate custom macro collateral \n Sr. CAD Engineer Microchip Technology Inc May 2007  –  May 2012  (5 years 1 month) Chandler AZ Responsibilities \n============ \n- Evaluate Research & Develop new CAD Flows for RTL Synthesis, Power Optimization, Formal Verification using Synopsys tools ( Design Compiler, Power Compiler Formality) \n- Deploy & support existing EDA tools & flows in the above areas to design groups. Optimize existing EDA flows with new tool capabilities as they are available. \n- Document and publish new EDA tool evaluation results, existing tool flows. \n- Design, implement, deploy & support internal Perl and Tcl/Tk based EDA software and utilities. \n- Interface with external EDA tool & flow vendors to identify and resolve tool and EDA flow issues and bring in new tool capabilities to accelerate designer productivity. \n- Qualify, Maintain installed versions, Deploy new versions, and actively support usage of Synopsys Verdi (Design Visualization and Debug tool) \n- Accelerate the adoption of advanced design methodologies in Microchip by qualifying the SystemVerilog support in Springsoft products.  \n- Interface with Springsoft application support team to report tool issues, new feature enhancement requests. Co-ordinate with Springsoft Application Engineering to organize internal training programs for Microchip design teams. Sr. CAD Engineer Microchip Technology Inc May 2007  –  May 2012  (5 years 1 month) Chandler AZ Responsibilities \n============ \n- Evaluate Research & Develop new CAD Flows for RTL Synthesis, Power Optimization, Formal Verification using Synopsys tools ( Design Compiler, Power Compiler Formality) \n- Deploy & support existing EDA tools & flows in the above areas to design groups. Optimize existing EDA flows with new tool capabilities as they are available. \n- Document and publish new EDA tool evaluation results, existing tool flows. \n- Design, implement, deploy & support internal Perl and Tcl/Tk based EDA software and utilities. \n- Interface with external EDA tool & flow vendors to identify and resolve tool and EDA flow issues and bring in new tool capabilities to accelerate designer productivity. \n- Qualify, Maintain installed versions, Deploy new versions, and actively support usage of Synopsys Verdi (Design Visualization and Debug tool) \n- Accelerate the adoption of advanced design methodologies in Microchip by qualifying the SystemVerilog support in Springsoft products.  \n- Interface with Springsoft application support team to report tool issues, new feature enhancement requests. Co-ordinate with Springsoft Application Engineering to organize internal training programs for Microchip design teams. CAD Engineer Microchip Technology Inc June 2004  –  May 2007  (3 years) Click to edit position description- Evaluate Research & Develop new CAD Flows for RTL Synthesis, Power Optimization, Formal Verification using Synopsys tools ( Design Compiler, Power Compiler Formality) \n- Deploy & support existing EDA tools & flows in the above areas to design groups. Optimize existing EDA flows with new tool capabilities as they are available. \n- Document and publish new EDA tool evaluation results, existing tool flows. \n- Design, implement, deploy & support internal Perl and Tcl/Tk based EDA software and utilities. \n- Interface with external EDA tool & flow vendors to identify and resolve tool and EDA flow issues and bring in new tool capabilities to accelerate designer productivity. \n- Qualify, Maintain installed versions, Deploy new versions, and actively support usage of Synopsys Verdi (Design Visualization and Debug tool) \n- Accelerate the adoption of advanced design methodologies in Microchip by qualifying the SystemVerilog support in Springsoft products.  \n- Interface with Springsoft application support team to report tool issues, new feature enhancement requests. Co-ordinate with Springsoft Application Engineering to organize internal training programs for Microchip design teams. CAD Engineer Microchip Technology Inc June 2004  –  May 2007  (3 years) Click to edit position description- Evaluate Research & Develop new CAD Flows for RTL Synthesis, Power Optimization, Formal Verification using Synopsys tools ( Design Compiler, Power Compiler Formality) \n- Deploy & support existing EDA tools & flows in the above areas to design groups. Optimize existing EDA flows with new tool capabilities as they are available. \n- Document and publish new EDA tool evaluation results, existing tool flows. \n- Design, implement, deploy & support internal Perl and Tcl/Tk based EDA software and utilities. \n- Interface with external EDA tool & flow vendors to identify and resolve tool and EDA flow issues and bring in new tool capabilities to accelerate designer productivity. \n- Qualify, Maintain installed versions, Deploy new versions, and actively support usage of Synopsys Verdi (Design Visualization and Debug tool) \n- Accelerate the adoption of advanced design methodologies in Microchip by qualifying the SystemVerilog support in Springsoft products.  \n- Interface with Springsoft application support team to report tool issues, new feature enhancement requests. Co-ordinate with Springsoft Application Engineering to organize internal training programs for Microchip design teams. Graduate Research Student Department of EECS, Syracuse University December 2002  –  May 2004  (1 year 6 months) Syracuse, New York Area Accomplishments: \nDesigned and developed of an internal High Level Synthesis Tool (HLS). Developed the overall HLS system architecture. Designed and implemented the front end VHDL lexical and parsing modules in C++ for HLS. Researched and developed Low Power VLSI design methodologies and algorithms targeted toward Low Power applications. Graduate Research Student Department of EECS, Syracuse University December 2002  –  May 2004  (1 year 6 months) Syracuse, New York Area Accomplishments: \nDesigned and developed of an internal High Level Synthesis Tool (HLS). Developed the overall HLS system architecture. Designed and implemented the front end VHDL lexical and parsing modules in C++ for HLS. Researched and developed Low Power VLSI design methodologies and algorithms targeted toward Low Power applications. Software Design Engineer Intern Microsoft Corp May 2001  –  August 2001  (4 months) Accomplishments: \nDeveloped an Automated Test Framework in JScript for testing the Application Restore tool designed for use with .NET applications. Designed and developed test cases to test both core functionality and UI functionality. Wrote core functionality test scripts to validate the tool in simulated real world scenarios. Wrote UI functionality test scripts that programmatically simulated user interaction (clicking buttons, selecting items within a list) with the tool UI. Extended the UI test scripts to verify the correct sequence of dialog boxes. Generalized the core and UI test scripts to be test case independent. Designed the overall framework to be modular and extensible. Software Design Engineer Intern Microsoft Corp May 2001  –  August 2001  (4 months) Accomplishments: \nDeveloped an Automated Test Framework in JScript for testing the Application Restore tool designed for use with .NET applications. Designed and developed test cases to test both core functionality and UI functionality. Wrote core functionality test scripts to validate the tool in simulated real world scenarios. Wrote UI functionality test scripts that programmatically simulated user interaction (clicking buttons, selecting items within a list) with the tool UI. Extended the UI test scripts to verify the correct sequence of dialog boxes. Generalized the core and UI test scripts to be test case independent. Designed the overall framework to be modular and extensible. Languages English Full professional proficiency Hindi Full professional proficiency Kannada Native or bilingual proficiency English Full professional proficiency Hindi Full professional proficiency Kannada Native or bilingual proficiency English Full professional proficiency Hindi Full professional proficiency Kannada Native or bilingual proficiency Full professional proficiency Full professional proficiency Native or bilingual proficiency Skills Verilog EDA TCL SystemVerilog Scripting Perl VLSI Debugging Shell Scripting VHDL SoC Formal Verification C++ RTL design Static Timing Analysis Linux Primetime Low-power Design Logic Synthesis VCS C ModelSim Algorithms Programming Simulation Signal Integrity JavaScript Node.js Web Development Browsers Test Automation Web Testing See 17+     See less Skills  Verilog EDA TCL SystemVerilog Scripting Perl VLSI Debugging Shell Scripting VHDL SoC Formal Verification C++ RTL design Static Timing Analysis Linux Primetime Low-power Design Logic Synthesis VCS C ModelSim Algorithms Programming Simulation Signal Integrity JavaScript Node.js Web Development Browsers Test Automation Web Testing See 17+     See less Verilog EDA TCL SystemVerilog Scripting Perl VLSI Debugging Shell Scripting VHDL SoC Formal Verification C++ RTL design Static Timing Analysis Linux Primetime Low-power Design Logic Synthesis VCS C ModelSim Algorithms Programming Simulation Signal Integrity JavaScript Node.js Web Development Browsers Test Automation Web Testing See 17+     See less Verilog EDA TCL SystemVerilog Scripting Perl VLSI Debugging Shell Scripting VHDL SoC Formal Verification C++ RTL design Static Timing Analysis Linux Primetime Low-power Design Logic Synthesis VCS C ModelSim Algorithms Programming Simulation Signal Integrity JavaScript Node.js Web Development Browsers Test Automation Web Testing See 17+     See less Education Syracuse University MSCE,  Computer Engineering-VLSI/CAD 2002  – 2004 Design and development of High Level Synthesis System (HLS): This program converted a IEE1076.6 compliant VHDL behavioral description into VHDL RTL for input into synthesis tools.  \n \nOptimal CMOS layout generation: Designed and Implemented a Physical Synthesis Tool in C++ using STL that compiled Boolean expressions into an area optimized CMOS layout. The tool employed the Uehera Van Cleemput algorithm to generate area optimized layouts. Development effort involved extensive use of Software Design Patterns such as the Composite and the Visitor. \n \nModule placement using Simulated Annealing: Designed and implemented a Module placement tool in C++ (using STL). This tool read in an initial module placement description and optimized it for least wire-length using the Simulated Annealing Algorithm. The tool was generic enough to allow the annealing process to accept any other cost function to be used optimize the module placement. Activities and Societies:  Member Association of Computing Machinery The University of Texas at Austin BSEE,  Computer Engineering 1997  – 2001 Activities and Societies:  Member Associatin of Computing Machinery\nMember IEEE Computer Society Ideal Indian School 1992  – 1995 Sindhi High School 1986  – 1989 Syracuse University MSCE,  Computer Engineering-VLSI/CAD 2002  – 2004 Design and development of High Level Synthesis System (HLS): This program converted a IEE1076.6 compliant VHDL behavioral description into VHDL RTL for input into synthesis tools.  \n \nOptimal CMOS layout generation: Designed and Implemented a Physical Synthesis Tool in C++ using STL that compiled Boolean expressions into an area optimized CMOS layout. The tool employed the Uehera Van Cleemput algorithm to generate area optimized layouts. Development effort involved extensive use of Software Design Patterns such as the Composite and the Visitor. \n \nModule placement using Simulated Annealing: Designed and implemented a Module placement tool in C++ (using STL). This tool read in an initial module placement description and optimized it for least wire-length using the Simulated Annealing Algorithm. The tool was generic enough to allow the annealing process to accept any other cost function to be used optimize the module placement. Activities and Societies:  Member Association of Computing Machinery Syracuse University MSCE,  Computer Engineering-VLSI/CAD 2002  – 2004 Design and development of High Level Synthesis System (HLS): This program converted a IEE1076.6 compliant VHDL behavioral description into VHDL RTL for input into synthesis tools.  \n \nOptimal CMOS layout generation: Designed and Implemented a Physical Synthesis Tool in C++ using STL that compiled Boolean expressions into an area optimized CMOS layout. The tool employed the Uehera Van Cleemput algorithm to generate area optimized layouts. Development effort involved extensive use of Software Design Patterns such as the Composite and the Visitor. \n \nModule placement using Simulated Annealing: Designed and implemented a Module placement tool in C++ (using STL). This tool read in an initial module placement description and optimized it for least wire-length using the Simulated Annealing Algorithm. The tool was generic enough to allow the annealing process to accept any other cost function to be used optimize the module placement. Activities and Societies:  Member Association of Computing Machinery Syracuse University MSCE,  Computer Engineering-VLSI/CAD 2002  – 2004 Design and development of High Level Synthesis System (HLS): This program converted a IEE1076.6 compliant VHDL behavioral description into VHDL RTL for input into synthesis tools.  \n \nOptimal CMOS layout generation: Designed and Implemented a Physical Synthesis Tool in C++ using STL that compiled Boolean expressions into an area optimized CMOS layout. The tool employed the Uehera Van Cleemput algorithm to generate area optimized layouts. Development effort involved extensive use of Software Design Patterns such as the Composite and the Visitor. \n \nModule placement using Simulated Annealing: Designed and implemented a Module placement tool in C++ (using STL). This tool read in an initial module placement description and optimized it for least wire-length using the Simulated Annealing Algorithm. The tool was generic enough to allow the annealing process to accept any other cost function to be used optimize the module placement. Activities and Societies:  Member Association of Computing Machinery The University of Texas at Austin BSEE,  Computer Engineering 1997  – 2001 Activities and Societies:  Member Associatin of Computing Machinery\nMember IEEE Computer Society The University of Texas at Austin BSEE,  Computer Engineering 1997  – 2001 Activities and Societies:  Member Associatin of Computing Machinery\nMember IEEE Computer Society The University of Texas at Austin BSEE,  Computer Engineering 1997  – 2001 Activities and Societies:  Member Associatin of Computing Machinery\nMember IEEE Computer Society Ideal Indian School 1992  – 1995 Ideal Indian School 1992  – 1995 Ideal Indian School 1992  – 1995 Sindhi High School 1986  – 1989 Sindhi High School 1986  – 1989 Sindhi High School 1986  – 1989 ", "Summary Technical: \nWorking as Back-End Design Automation Engineer at Intel Corporation, CA. Master's in Computer Engineering (VLSI Design) from University of Cincinnati, OH \nSpecialties: Design Automation, Low Power VLSI, ASIC Design Flow, FinFET Circuit Design, Static Timing Analysis  \n \nManagement/Volunteering: \n5+ years of experience with IEEE Student Activities including 2 years in IEEE MGA Student Activities Committee (SAC). Currently serving as IEEE Young Professionals Representative to MGA SAC and Execom member in IEEE Region 6. Experience in IEEE Regional committees, Conference steering committees and IEEE Humanitarian Technology activities. Summary Technical: \nWorking as Back-End Design Automation Engineer at Intel Corporation, CA. Master's in Computer Engineering (VLSI Design) from University of Cincinnati, OH \nSpecialties: Design Automation, Low Power VLSI, ASIC Design Flow, FinFET Circuit Design, Static Timing Analysis  \n \nManagement/Volunteering: \n5+ years of experience with IEEE Student Activities including 2 years in IEEE MGA Student Activities Committee (SAC). Currently serving as IEEE Young Professionals Representative to MGA SAC and Execom member in IEEE Region 6. Experience in IEEE Regional committees, Conference steering committees and IEEE Humanitarian Technology activities. Technical: \nWorking as Back-End Design Automation Engineer at Intel Corporation, CA. Master's in Computer Engineering (VLSI Design) from University of Cincinnati, OH \nSpecialties: Design Automation, Low Power VLSI, ASIC Design Flow, FinFET Circuit Design, Static Timing Analysis  \n \nManagement/Volunteering: \n5+ years of experience with IEEE Student Activities including 2 years in IEEE MGA Student Activities Committee (SAC). Currently serving as IEEE Young Professionals Representative to MGA SAC and Execom member in IEEE Region 6. Experience in IEEE Regional committees, Conference steering committees and IEEE Humanitarian Technology activities. Technical: \nWorking as Back-End Design Automation Engineer at Intel Corporation, CA. Master's in Computer Engineering (VLSI Design) from University of Cincinnati, OH \nSpecialties: Design Automation, Low Power VLSI, ASIC Design Flow, FinFET Circuit Design, Static Timing Analysis  \n \nManagement/Volunteering: \n5+ years of experience with IEEE Student Activities including 2 years in IEEE MGA Student Activities Committee (SAC). Currently serving as IEEE Young Professionals Representative to MGA SAC and Execom member in IEEE Region 6. Experience in IEEE Regional committees, Conference steering committees and IEEE Humanitarian Technology activities. Experience Design Automation Engineer Intel Corporation August 2014  – Present (1 year 1 month) Folsom, California - In charge of the Optimization (Timing/Power) domain for Intel's next generation microprocessor and SoC based on advanced FinFET technology.  \n- Concentrates on Timing ECO fixes and power optimization. .  \n- Work with RLS, Datapath and Analog design teams to evaluate the tool flows (both Intel internal and Synopsys) and ensure to meet the project requirements. IEEE Young Professionals Representative (Global) IEEE Young Professionals January 2015  – Present (8 months) New Jersey, USA IEEE Young Professionals Representative to IEEE MGA Student Activities Committee. Liaison between IEEE MGA Young Professionals and IEEE MGA Student Activities Committee. Branch Chapter Representative IEEE MGA Student Activities Committee January 2013  –  December 2014  (2 years) New Jersey, USA Global Student Representative for IEEE Technical Branch Chapters in the IEEE MGA Student Activities Committee. Graduate Student, Digital Design Environments Lab (DDEL) University of Cincinnati August 2012  –  July 2014  (2 years) Cincinnati Area Thesis Title: MITH-Dyn: A Multi Vth Dynamic Logic Design Style Using Mixed Mode FinFETs \nAdviser: Dr. Ranga Vemuri Graduate Technical Intern Intel Corporation May 2013  –  November 2013  (7 months) Folsom, California Design Automation Intern at Performance Verification (timing sign-off) and Power Optimization Team. \nThe main focus is on backend tool automation support for next generation CPU projects. Job responsibilities include timing checks for circuit blocks, scripting in Perl/Tcl, regression runs to analyze timing changes, schematics, Low Power designs etc. Student Representative and Executive Committee Member IEEE Kerala Section January 2012  –  December 2012  (1 year) Coordinating the Student activities of 3500+ Student members of Kerala Design Automation Engineer Intel Corporation August 2014  – Present (1 year 1 month) Folsom, California - In charge of the Optimization (Timing/Power) domain for Intel's next generation microprocessor and SoC based on advanced FinFET technology.  \n- Concentrates on Timing ECO fixes and power optimization. .  \n- Work with RLS, Datapath and Analog design teams to evaluate the tool flows (both Intel internal and Synopsys) and ensure to meet the project requirements. Design Automation Engineer Intel Corporation August 2014  – Present (1 year 1 month) Folsom, California - In charge of the Optimization (Timing/Power) domain for Intel's next generation microprocessor and SoC based on advanced FinFET technology.  \n- Concentrates on Timing ECO fixes and power optimization. .  \n- Work with RLS, Datapath and Analog design teams to evaluate the tool flows (both Intel internal and Synopsys) and ensure to meet the project requirements. IEEE Young Professionals Representative (Global) IEEE Young Professionals January 2015  – Present (8 months) New Jersey, USA IEEE Young Professionals Representative to IEEE MGA Student Activities Committee. Liaison between IEEE MGA Young Professionals and IEEE MGA Student Activities Committee. IEEE Young Professionals Representative (Global) IEEE Young Professionals January 2015  – Present (8 months) New Jersey, USA IEEE Young Professionals Representative to IEEE MGA Student Activities Committee. Liaison between IEEE MGA Young Professionals and IEEE MGA Student Activities Committee. Branch Chapter Representative IEEE MGA Student Activities Committee January 2013  –  December 2014  (2 years) New Jersey, USA Global Student Representative for IEEE Technical Branch Chapters in the IEEE MGA Student Activities Committee. Branch Chapter Representative IEEE MGA Student Activities Committee January 2013  –  December 2014  (2 years) New Jersey, USA Global Student Representative for IEEE Technical Branch Chapters in the IEEE MGA Student Activities Committee. Graduate Student, Digital Design Environments Lab (DDEL) University of Cincinnati August 2012  –  July 2014  (2 years) Cincinnati Area Thesis Title: MITH-Dyn: A Multi Vth Dynamic Logic Design Style Using Mixed Mode FinFETs \nAdviser: Dr. Ranga Vemuri Graduate Student, Digital Design Environments Lab (DDEL) University of Cincinnati August 2012  –  July 2014  (2 years) Cincinnati Area Thesis Title: MITH-Dyn: A Multi Vth Dynamic Logic Design Style Using Mixed Mode FinFETs \nAdviser: Dr. Ranga Vemuri Graduate Technical Intern Intel Corporation May 2013  –  November 2013  (7 months) Folsom, California Design Automation Intern at Performance Verification (timing sign-off) and Power Optimization Team. \nThe main focus is on backend tool automation support for next generation CPU projects. Job responsibilities include timing checks for circuit blocks, scripting in Perl/Tcl, regression runs to analyze timing changes, schematics, Low Power designs etc. Graduate Technical Intern Intel Corporation May 2013  –  November 2013  (7 months) Folsom, California Design Automation Intern at Performance Verification (timing sign-off) and Power Optimization Team. \nThe main focus is on backend tool automation support for next generation CPU projects. Job responsibilities include timing checks for circuit blocks, scripting in Perl/Tcl, regression runs to analyze timing changes, schematics, Low Power designs etc. Student Representative and Executive Committee Member IEEE Kerala Section January 2012  –  December 2012  (1 year) Coordinating the Student activities of 3500+ Student members of Kerala Student Representative and Executive Committee Member IEEE Kerala Section January 2012  –  December 2012  (1 year) Coordinating the Student activities of 3500+ Student members of Kerala Languages   Skills VLSI Computer Architecture Embedded Systems Verilog C++ VHDL Microcontrollers Team Building Microprocessors Perl TCL Synopsys tools Shell Scripting HSpice Leadership Design Automation Static Timing Analysis Low Power VLSI RC Parasitic Extraction CMOS VLSI Design FinFET Design See 6+     See less Skills  VLSI Computer Architecture Embedded Systems Verilog C++ VHDL Microcontrollers Team Building Microprocessors Perl TCL Synopsys tools Shell Scripting HSpice Leadership Design Automation Static Timing Analysis Low Power VLSI RC Parasitic Extraction CMOS VLSI Design FinFET Design See 6+     See less VLSI Computer Architecture Embedded Systems Verilog C++ VHDL Microcontrollers Team Building Microprocessors Perl TCL Synopsys tools Shell Scripting HSpice Leadership Design Automation Static Timing Analysis Low Power VLSI RC Parasitic Extraction CMOS VLSI Design FinFET Design See 6+     See less VLSI Computer Architecture Embedded Systems Verilog C++ VHDL Microcontrollers Team Building Microprocessors Perl TCL Synopsys tools Shell Scripting HSpice Leadership Design Automation Static Timing Analysis Low Power VLSI RC Parasitic Extraction CMOS VLSI Design FinFET Design See 6+     See less Education University of Cincinnati Master's Degree,  Computer Engineering , 3.97/4.00 2012  – 2014 Amrita Vishwa Vidyapeetham Bachelor's Degree,  Electronics and Communication Engineering (ECE) 2008  – 2012 University of Cincinnati Master's Degree,  Computer Engineering , 3.97/4.00 2012  – 2014 University of Cincinnati Master's Degree,  Computer Engineering , 3.97/4.00 2012  – 2014 University of Cincinnati Master's Degree,  Computer Engineering , 3.97/4.00 2012  – 2014 Amrita Vishwa Vidyapeetham Bachelor's Degree,  Electronics and Communication Engineering (ECE) 2008  – 2012 Amrita Vishwa Vidyapeetham Bachelor's Degree,  Electronics and Communication Engineering (ECE) 2008  – 2012 Amrita Vishwa Vidyapeetham Bachelor's Degree,  Electronics and Communication Engineering (ECE) 2008  – 2012 Honors & Awards A. Richard Newton Young Research Fellowship 51st Design Automation Conference (DAC) 2014 April 2014 Fellowship to attend DAC  Richard E Merwin Student Scholarship IEEE Computer Society August 2012 Global scholarship from IEEE Computer Society HQ. For outstanding contributions to branch chapter activities and excellent academic performance University Graduate Scholarship University of Cincinnati August 2012 Award of Excellence Amrita Vishwa Vidyapeetham For excellent performance during the academic year 2011-12 Outstanding Student Volunteer Award IEEE Kerala Section January 2012 Awarded for Outstanding contribution to Student Activities of IEEE Kerala Section A. Richard Newton Young Research Fellowship 51st Design Automation Conference (DAC) 2014 April 2014 Fellowship to attend DAC  A. Richard Newton Young Research Fellowship 51st Design Automation Conference (DAC) 2014 April 2014 Fellowship to attend DAC  A. Richard Newton Young Research Fellowship 51st Design Automation Conference (DAC) 2014 April 2014 Fellowship to attend DAC  Richard E Merwin Student Scholarship IEEE Computer Society August 2012 Global scholarship from IEEE Computer Society HQ. For outstanding contributions to branch chapter activities and excellent academic performance Richard E Merwin Student Scholarship IEEE Computer Society August 2012 Global scholarship from IEEE Computer Society HQ. For outstanding contributions to branch chapter activities and excellent academic performance Richard E Merwin Student Scholarship IEEE Computer Society August 2012 Global scholarship from IEEE Computer Society HQ. For outstanding contributions to branch chapter activities and excellent academic performance University Graduate Scholarship University of Cincinnati August 2012 University Graduate Scholarship University of Cincinnati August 2012 University Graduate Scholarship University of Cincinnati August 2012 Award of Excellence Amrita Vishwa Vidyapeetham For excellent performance during the academic year 2011-12 Award of Excellence Amrita Vishwa Vidyapeetham For excellent performance during the academic year 2011-12 Award of Excellence Amrita Vishwa Vidyapeetham For excellent performance during the academic year 2011-12 Outstanding Student Volunteer Award IEEE Kerala Section January 2012 Awarded for Outstanding contribution to Student Activities of IEEE Kerala Section Outstanding Student Volunteer Award IEEE Kerala Section January 2012 Awarded for Outstanding contribution to Student Activities of IEEE Kerala Section Outstanding Student Volunteer Award IEEE Kerala Section January 2012 Awarded for Outstanding contribution to Student Activities of IEEE Kerala Section ", "Skills TCL EDA ASIC Semiconductors IC Physical Verification Parasitic Extraction Physical Design Tapeout ICV Hercules Calibre ICC DRC LVS Design for Manufacturing IC layout Linux Perl Cadence Virtuoso Microprocessors Floorplanning Place & Route Processors VLSI CMOS Mixed Signal Silicon Synopsys tools Virtuoso Perl Script Intel SoC Low-power Design Signal Integrity See 20+     See less Skills  TCL EDA ASIC Semiconductors IC Physical Verification Parasitic Extraction Physical Design Tapeout ICV Hercules Calibre ICC DRC LVS Design for Manufacturing IC layout Linux Perl Cadence Virtuoso Microprocessors Floorplanning Place & Route Processors VLSI CMOS Mixed Signal Silicon Synopsys tools Virtuoso Perl Script Intel SoC Low-power Design Signal Integrity See 20+     See less TCL EDA ASIC Semiconductors IC Physical Verification Parasitic Extraction Physical Design Tapeout ICV Hercules Calibre ICC DRC LVS Design for Manufacturing IC layout Linux Perl Cadence Virtuoso Microprocessors Floorplanning Place & Route Processors VLSI CMOS Mixed Signal Silicon Synopsys tools Virtuoso Perl Script Intel SoC Low-power Design Signal Integrity See 20+     See less TCL EDA ASIC Semiconductors IC Physical Verification Parasitic Extraction Physical Design Tapeout ICV Hercules Calibre ICC DRC LVS Design for Manufacturing IC layout Linux Perl Cadence Virtuoso Microprocessors Floorplanning Place & Route Processors VLSI CMOS Mixed Signal Silicon Synopsys tools Virtuoso Perl Script Intel SoC Low-power Design Signal Integrity See 20+     See less ", "Summary Experiences at high speed CPU semi-customized designs and SOC rtl2gds APR implementations with pv/pd convergence, physical CAD tool development work and design automation. \n \nComputer Languages:  \nPerl, TCL, C/C++ object oriented and template based programming, Milkyway-C API programming. \n \nCAD design methodologies and tools:  \nCAD algorithm, CAD data model and physical tool development, FCL and hierarchical floorplan, partition physical integration methodologies, Place & Route, IC Compiler, ICC DP, Milkyway, JupiterXT, Physical Design Planner, Magma P&R, mesh/fish-bone and balanced tree CTS, Primetime static timing analysis, Design Compiler logic synthesis, UPF multiple power domain design, power domain and ERC signoff, Spyglass-LP power verification, partition and FC FEV, SOC tape in flow with Calibre, GDS diff, IC Validator DRC/LVS/density checks, Redhawk static/dynamic IR drop and EM analysis, DFM integration. Summary Experiences at high speed CPU semi-customized designs and SOC rtl2gds APR implementations with pv/pd convergence, physical CAD tool development work and design automation. \n \nComputer Languages:  \nPerl, TCL, C/C++ object oriented and template based programming, Milkyway-C API programming. \n \nCAD design methodologies and tools:  \nCAD algorithm, CAD data model and physical tool development, FCL and hierarchical floorplan, partition physical integration methodologies, Place & Route, IC Compiler, ICC DP, Milkyway, JupiterXT, Physical Design Planner, Magma P&R, mesh/fish-bone and balanced tree CTS, Primetime static timing analysis, Design Compiler logic synthesis, UPF multiple power domain design, power domain and ERC signoff, Spyglass-LP power verification, partition and FC FEV, SOC tape in flow with Calibre, GDS diff, IC Validator DRC/LVS/density checks, Redhawk static/dynamic IR drop and EM analysis, DFM integration. Experiences at high speed CPU semi-customized designs and SOC rtl2gds APR implementations with pv/pd convergence, physical CAD tool development work and design automation. \n \nComputer Languages:  \nPerl, TCL, C/C++ object oriented and template based programming, Milkyway-C API programming. \n \nCAD design methodologies and tools:  \nCAD algorithm, CAD data model and physical tool development, FCL and hierarchical floorplan, partition physical integration methodologies, Place & Route, IC Compiler, ICC DP, Milkyway, JupiterXT, Physical Design Planner, Magma P&R, mesh/fish-bone and balanced tree CTS, Primetime static timing analysis, Design Compiler logic synthesis, UPF multiple power domain design, power domain and ERC signoff, Spyglass-LP power verification, partition and FC FEV, SOC tape in flow with Calibre, GDS diff, IC Validator DRC/LVS/density checks, Redhawk static/dynamic IR drop and EM analysis, DFM integration. Experiences at high speed CPU semi-customized designs and SOC rtl2gds APR implementations with pv/pd convergence, physical CAD tool development work and design automation. \n \nComputer Languages:  \nPerl, TCL, C/C++ object oriented and template based programming, Milkyway-C API programming. \n \nCAD design methodologies and tools:  \nCAD algorithm, CAD data model and physical tool development, FCL and hierarchical floorplan, partition physical integration methodologies, Place & Route, IC Compiler, ICC DP, Milkyway, JupiterXT, Physical Design Planner, Magma P&R, mesh/fish-bone and balanced tree CTS, Primetime static timing analysis, Design Compiler logic synthesis, UPF multiple power domain design, power domain and ERC signoff, Spyglass-LP power verification, partition and FC FEV, SOC tape in flow with Calibre, GDS diff, IC Validator DRC/LVS/density checks, Redhawk static/dynamic IR drop and EM analysis, DFM integration. Experience Senior SOC design engineer Intel Corporation October 2013  – Present (1 year 11 months) Austin, TX intel SOC project. Senior SOC physical design engineer. Austin, TX. (Oct. 2013 to current) Senior SOC design engineer intel March 2011  –  October 2013  (2 years 8 months) Austin, Texas Area SOC project. Senior SOC physical design engineer. Austin, TX. (2011 to Oct. 2013) Senior SOC design engineer Intel Corporation June 2009  –  March 2011  (1 year 10 months) Austin, Texas Area SOC project. Senior SOC physical design engineer. Austin, TX. (June 2009 to 2011) Senior Design Automation Engineer Intel Corporation April 2007  –  June 2009  (2 years 3 months) Austin, Texas Area cores server processor project. Senior design automation engineer. Austin, TX. (Apr. 2007 to June 2009.) Senior Design Automation Engineer Intel Corporation April 2004  –  March 2007  (3 years) Hillsboro, OR SOC project for mobile device. Senior design automation engineer. Hillsboro, OR. (2006 to 2007) Senior design automation engineer Intel Corporation July 2000  –  March 2004  (3 years 9 months) Hillsboro, OR cpu core high speed microprocessor projects. Senior design automation engineer. Hillsboro, OR. (2000 to 2004) Senior design automation engineer Intel Corporation June 1998  –  June 2000  (2 years 1 month) Hillsboro, OR SOC project: Senior design automation engineer. (1998 to 2000). Hillsboro, OR. CAD tool development engineer Intel Corporation October 1995  –  May 1998  (2 years 8 months) Hillsboro, OR Intel Design Technology Research and Development. Physical CAD tool development engineer. Hillsboro, OR. (1995 to 1998) Senior SOC design engineer Intel Corporation October 2013  – Present (1 year 11 months) Austin, TX intel SOC project. Senior SOC physical design engineer. Austin, TX. (Oct. 2013 to current) Senior SOC design engineer Intel Corporation October 2013  – Present (1 year 11 months) Austin, TX intel SOC project. Senior SOC physical design engineer. Austin, TX. (Oct. 2013 to current) Senior SOC design engineer intel March 2011  –  October 2013  (2 years 8 months) Austin, Texas Area SOC project. Senior SOC physical design engineer. Austin, TX. (2011 to Oct. 2013) Senior SOC design engineer intel March 2011  –  October 2013  (2 years 8 months) Austin, Texas Area SOC project. Senior SOC physical design engineer. Austin, TX. (2011 to Oct. 2013) Senior SOC design engineer Intel Corporation June 2009  –  March 2011  (1 year 10 months) Austin, Texas Area SOC project. Senior SOC physical design engineer. Austin, TX. (June 2009 to 2011) Senior SOC design engineer Intel Corporation June 2009  –  March 2011  (1 year 10 months) Austin, Texas Area SOC project. Senior SOC physical design engineer. Austin, TX. (June 2009 to 2011) Senior Design Automation Engineer Intel Corporation April 2007  –  June 2009  (2 years 3 months) Austin, Texas Area cores server processor project. Senior design automation engineer. Austin, TX. (Apr. 2007 to June 2009.) Senior Design Automation Engineer Intel Corporation April 2007  –  June 2009  (2 years 3 months) Austin, Texas Area cores server processor project. Senior design automation engineer. Austin, TX. (Apr. 2007 to June 2009.) Senior Design Automation Engineer Intel Corporation April 2004  –  March 2007  (3 years) Hillsboro, OR SOC project for mobile device. Senior design automation engineer. Hillsboro, OR. (2006 to 2007) Senior Design Automation Engineer Intel Corporation April 2004  –  March 2007  (3 years) Hillsboro, OR SOC project for mobile device. Senior design automation engineer. Hillsboro, OR. (2006 to 2007) Senior design automation engineer Intel Corporation July 2000  –  March 2004  (3 years 9 months) Hillsboro, OR cpu core high speed microprocessor projects. Senior design automation engineer. Hillsboro, OR. (2000 to 2004) Senior design automation engineer Intel Corporation July 2000  –  March 2004  (3 years 9 months) Hillsboro, OR cpu core high speed microprocessor projects. Senior design automation engineer. Hillsboro, OR. (2000 to 2004) Senior design automation engineer Intel Corporation June 1998  –  June 2000  (2 years 1 month) Hillsboro, OR SOC project: Senior design automation engineer. (1998 to 2000). Hillsboro, OR. Senior design automation engineer Intel Corporation June 1998  –  June 2000  (2 years 1 month) Hillsboro, OR SOC project: Senior design automation engineer. (1998 to 2000). Hillsboro, OR. CAD tool development engineer Intel Corporation October 1995  –  May 1998  (2 years 8 months) Hillsboro, OR Intel Design Technology Research and Development. Physical CAD tool development engineer. Hillsboro, OR. (1995 to 1998) CAD tool development engineer Intel Corporation October 1995  –  May 1998  (2 years 8 months) Hillsboro, OR Intel Design Technology Research and Development. Physical CAD tool development engineer. Hillsboro, OR. (1995 to 1998) Skills EDA Physical Design Static Timing Analysis SoC TCL Primetime Logic Synthesis Perl IC Processors Place & Route Microprocessors Timing Algorithms Intel VLSI ASIC RTL design Debugging Verilog Semiconductors See 6+     See less Skills  EDA Physical Design Static Timing Analysis SoC TCL Primetime Logic Synthesis Perl IC Processors Place & Route Microprocessors Timing Algorithms Intel VLSI ASIC RTL design Debugging Verilog Semiconductors See 6+     See less EDA Physical Design Static Timing Analysis SoC TCL Primetime Logic Synthesis Perl IC Processors Place & Route Microprocessors Timing Algorithms Intel VLSI ASIC RTL design Debugging Verilog Semiconductors See 6+     See less EDA Physical Design Static Timing Analysis SoC TCL Primetime Logic Synthesis Perl IC Processors Place & Route Microprocessors Timing Algorithms Intel VLSI ASIC RTL design Debugging Verilog Semiconductors See 6+     See less Education Portland State University Master of Science (MS),  Electrical and computer engineering Portland State University Master of Science (MS),  Electrical and computer engineering Portland State University Master of Science (MS),  Electrical and computer engineering Portland State University Master of Science (MS),  Electrical and computer engineering ", "Skills Physical Design Static Timing Analysis ASIC VLSI SoC EDA Primetime Microprocessors SystemVerilog CMOS RTL design TCL IC Semiconductors Silicon Skills  Physical Design Static Timing Analysis ASIC VLSI SoC EDA Primetime Microprocessors SystemVerilog CMOS RTL design TCL IC Semiconductors Silicon Physical Design Static Timing Analysis ASIC VLSI SoC EDA Primetime Microprocessors SystemVerilog CMOS RTL design TCL IC Semiconductors Silicon Physical Design Static Timing Analysis ASIC VLSI SoC EDA Primetime Microprocessors SystemVerilog CMOS RTL design TCL IC Semiconductors Silicon ", "Skills SKILL Perl Circuit Design TCL VLSI Scripting DAC Mixed Signal Circuit Simulators SPICE DRC Cadence Virtuoso EDA Debugging Static Timing Analysis CMOS IC Integrated Circuit... Analog Circuit Design Analog Simulations Low-power Design SoC Physical Verification RTL design LVS Signal Integrity ASIC Semiconductors Verilog Floorplanning SystemVerilog RTL Design See 18+     See less Skills  SKILL Perl Circuit Design TCL VLSI Scripting DAC Mixed Signal Circuit Simulators SPICE DRC Cadence Virtuoso EDA Debugging Static Timing Analysis CMOS IC Integrated Circuit... Analog Circuit Design Analog Simulations Low-power Design SoC Physical Verification RTL design LVS Signal Integrity ASIC Semiconductors Verilog Floorplanning SystemVerilog RTL Design See 18+     See less SKILL Perl Circuit Design TCL VLSI Scripting DAC Mixed Signal Circuit Simulators SPICE DRC Cadence Virtuoso EDA Debugging Static Timing Analysis CMOS IC Integrated Circuit... Analog Circuit Design Analog Simulations Low-power Design SoC Physical Verification RTL design LVS Signal Integrity ASIC Semiconductors Verilog Floorplanning SystemVerilog RTL Design See 18+     See less SKILL Perl Circuit Design TCL VLSI Scripting DAC Mixed Signal Circuit Simulators SPICE DRC Cadence Virtuoso EDA Debugging Static Timing Analysis CMOS IC Integrated Circuit... Analog Circuit Design Analog Simulations Low-power Design SoC Physical Verification RTL design LVS Signal Integrity ASIC Semiconductors Verilog Floorplanning SystemVerilog RTL Design See 18+     See less "]}