{"position": "Director of Operations", "company": "Intel Corporation", "profiles": ["Experience Partner Social Venture Partners Portland October 2004  – Present (10 years 11 months) Partner and Board member Social Venture Partners 2004  – Present (11 years) Director of Operations Intel Corporation April 1977  –  October 2004  (27 years 7 months) Partner Social Venture Partners Portland October 2004  – Present (10 years 11 months) Partner Social Venture Partners Portland October 2004  – Present (10 years 11 months) Partner and Board member Social Venture Partners 2004  – Present (11 years) Partner and Board member Social Venture Partners 2004  – Present (11 years) Director of Operations Intel Corporation April 1977  –  October 2004  (27 years 7 months) Director of Operations Intel Corporation April 1977  –  October 2004  (27 years 7 months) Education University of Southern California B.S. and M.S.,  Electrical Engineering 1966  – 1971 University of Southern California B.S. and M.S.,  Electrical Engineering 1966  – 1971 University of Southern California B.S. and M.S.,  Electrical Engineering 1966  – 1971 University of Southern California B.S. and M.S.,  Electrical Engineering 1966  – 1971 ", "Experience Director of Supply Chain Intel Corporation September 2014  – Present (1 year) Datacenter Engineering Group Director of Customer Programs Intel Corporation January 2011  –  September 2014  (3 years 9 months) Mobile and Communications Group Director of Operations Intel Corporation January 2008  –  January 2011  (3 years 1 month) Intel Channel Boards Division Technical Assistant Intel Corporation January 2005  –  January 2008  (3 years 1 month) Various Supply Chain Program Manager Intel Corporation September 2001  –  January 2005  (3 years 5 months) Customer Planning & Logistics Group Supply Demand Manager Intel Corporation September 1998  –  September 2001  (3 years 1 month) Communications Products Group Materials Program Manager Intel Corporation June 1997  –  September 1998  (1 year 4 months) Network Communications Group Master Scheduler Intel Corporation June 1996  –  June 1997  (1 year 1 month) Systems Manufacturing Buyer Intel Corporation March 1994  –  June 1996  (2 years 4 months) Systems Manufacturing Director of Supply Chain Intel Corporation September 2014  – Present (1 year) Datacenter Engineering Group Director of Supply Chain Intel Corporation September 2014  – Present (1 year) Datacenter Engineering Group Director of Customer Programs Intel Corporation January 2011  –  September 2014  (3 years 9 months) Mobile and Communications Group Director of Customer Programs Intel Corporation January 2011  –  September 2014  (3 years 9 months) Mobile and Communications Group Director of Operations Intel Corporation January 2008  –  January 2011  (3 years 1 month) Intel Channel Boards Division Director of Operations Intel Corporation January 2008  –  January 2011  (3 years 1 month) Intel Channel Boards Division Technical Assistant Intel Corporation January 2005  –  January 2008  (3 years 1 month) Various Technical Assistant Intel Corporation January 2005  –  January 2008  (3 years 1 month) Various Supply Chain Program Manager Intel Corporation September 2001  –  January 2005  (3 years 5 months) Customer Planning & Logistics Group Supply Chain Program Manager Intel Corporation September 2001  –  January 2005  (3 years 5 months) Customer Planning & Logistics Group Supply Demand Manager Intel Corporation September 1998  –  September 2001  (3 years 1 month) Communications Products Group Supply Demand Manager Intel Corporation September 1998  –  September 2001  (3 years 1 month) Communications Products Group Materials Program Manager Intel Corporation June 1997  –  September 1998  (1 year 4 months) Network Communications Group Materials Program Manager Intel Corporation June 1997  –  September 1998  (1 year 4 months) Network Communications Group Master Scheduler Intel Corporation June 1996  –  June 1997  (1 year 1 month) Systems Manufacturing Master Scheduler Intel Corporation June 1996  –  June 1997  (1 year 1 month) Systems Manufacturing Buyer Intel Corporation March 1994  –  June 1996  (2 years 4 months) Systems Manufacturing Buyer Intel Corporation March 1994  –  June 1996  (2 years 4 months) Systems Manufacturing Skills Supply Chain Cross-functional Team... Manufacturing Semiconductors Supply Chain Management Process Improvement Program Management Product Management Continuous Improvement Supply Management Process Engineering Operations Management Engineering Management Project Management MRP Product Development Vendor Management See 2+     See less Skills  Supply Chain Cross-functional Team... Manufacturing Semiconductors Supply Chain Management Process Improvement Program Management Product Management Continuous Improvement Supply Management Process Engineering Operations Management Engineering Management Project Management MRP Product Development Vendor Management See 2+     See less Supply Chain Cross-functional Team... Manufacturing Semiconductors Supply Chain Management Process Improvement Program Management Product Management Continuous Improvement Supply Management Process Engineering Operations Management Engineering Management Project Management MRP Product Development Vendor Management See 2+     See less Supply Chain Cross-functional Team... Manufacturing Semiconductors Supply Chain Management Process Improvement Program Management Product Management Continuous Improvement Supply Management Process Engineering Operations Management Engineering Management Project Management MRP Product Development Vendor Management See 2+     See less Education University of Oregon MBA 2002  – 2004 American Production & Inventory Control Society (APICS) CPIM 1994  – 1996 University of Limerick Graduate Diploma,  Advanced Manufacturing Technology 1993  – 1994 University of Limerick Bachelor of Technology,  Production Management 1988  – 1993 University of Oregon MBA 2002  – 2004 University of Oregon MBA 2002  – 2004 University of Oregon MBA 2002  – 2004 American Production & Inventory Control Society (APICS) CPIM 1994  – 1996 American Production & Inventory Control Society (APICS) CPIM 1994  – 1996 American Production & Inventory Control Society (APICS) CPIM 1994  – 1996 University of Limerick Graduate Diploma,  Advanced Manufacturing Technology 1993  – 1994 University of Limerick Graduate Diploma,  Advanced Manufacturing Technology 1993  – 1994 University of Limerick Graduate Diploma,  Advanced Manufacturing Technology 1993  – 1994 University of Limerick Bachelor of Technology,  Production Management 1988  – 1993 University of Limerick Bachelor of Technology,  Production Management 1988  – 1993 University of Limerick Bachelor of Technology,  Production Management 1988  – 1993 ", "Experience Director of Operations Intel Corporation Director of Operations Intel Corporation Director of Operations Intel Corporation Education Marylhurst University 1987  – 1989 Marylhurst University 1987  – 1989 Marylhurst University 1987  – 1989 Marylhurst University 1987  – 1989 ", "Experience Director -Operations Intel Corporation November 2005  – Present (9 years 10 months) Director -Operations Intel Corporation November 2005  – Present (9 years 10 months) Director -Operations Intel Corporation November 2005  – Present (9 years 10 months) Education California State University-Sacramento Master's degree,  Mechanical Engineering 1989  – 1991 California State University-Sacramento Master's degree,  Mechanical Engineering 1989  – 1991 California State University-Sacramento Master's degree,  Mechanical Engineering 1989  – 1991 California State University-Sacramento Master's degree,  Mechanical Engineering 1989  – 1991 ", "Summary Results-oriented, energetic, Engineering Manager with ten years of leading edge product development and manufacturing experience. Specialize in building strong & vital organization and delivering results under stressful environment. Ability to leverage matrixed resources and motivate staff in demoralized settings. PMP certified with proven track-record of on-time, under budget project/program delivery. Specialties:• Full Lifecycle Project Management \n• New Product Development \n• Process Engineering \n• Cost Control\t \n• Quality Assurance and Testing \n• Goal Setting & Accountability \n• Objective-Based Performance Management \n• Stakeholder Management Summary Results-oriented, energetic, Engineering Manager with ten years of leading edge product development and manufacturing experience. Specialize in building strong & vital organization and delivering results under stressful environment. Ability to leverage matrixed resources and motivate staff in demoralized settings. PMP certified with proven track-record of on-time, under budget project/program delivery. Specialties:• Full Lifecycle Project Management \n• New Product Development \n• Process Engineering \n• Cost Control\t \n• Quality Assurance and Testing \n• Goal Setting & Accountability \n• Objective-Based Performance Management \n• Stakeholder Management Results-oriented, energetic, Engineering Manager with ten years of leading edge product development and manufacturing experience. Specialize in building strong & vital organization and delivering results under stressful environment. Ability to leverage matrixed resources and motivate staff in demoralized settings. PMP certified with proven track-record of on-time, under budget project/program delivery. Specialties:• Full Lifecycle Project Management \n• New Product Development \n• Process Engineering \n• Cost Control\t \n• Quality Assurance and Testing \n• Goal Setting & Accountability \n• Objective-Based Performance Management \n• Stakeholder Management Results-oriented, energetic, Engineering Manager with ten years of leading edge product development and manufacturing experience. Specialize in building strong & vital organization and delivering results under stressful environment. Ability to leverage matrixed resources and motivate staff in demoralized settings. PMP certified with proven track-record of on-time, under budget project/program delivery. Specialties:• Full Lifecycle Project Management \n• New Product Development \n• Process Engineering \n• Cost Control\t \n• Quality Assurance and Testing \n• Goal Setting & Accountability \n• Objective-Based Performance Management \n• Stakeholder Management Experience Director of Operations Intel Corporation (Vietnam) July 2014  – Present (1 year 2 months) Director of Operations Intel Corporation (Chengdu) February 2010  –  June 2014  (4 years 5 months) Yield Manager Intel Corporation October 2008  –  February 2010  (1 year 5 months) Product Engineering Manager Intel Corporation August 2007  –  October 2008  (1 year 3 months) Cost Reduction Manager Intel Corporation April 2006  –  July 2007  (1 year 4 months) Process Engineering Group Leader Intel Corporation February 2005  –  July 2007  (2 years 6 months) Lithography New Product Introduction Manager Intel Corporation February 2005  –  July 2007  (2 years 6 months) ASML Platform Qualification Team Leader Intel Corporation December 2004  –  February 2005  (3 months) Flash Technology Defect Team Leader Intel Corporation August 2002  –  August 2003  (1 year 1 month) Director of Operations Intel Corporation (Vietnam) July 2014  – Present (1 year 2 months) Director of Operations Intel Corporation (Vietnam) July 2014  – Present (1 year 2 months) Director of Operations Intel Corporation (Chengdu) February 2010  –  June 2014  (4 years 5 months) Director of Operations Intel Corporation (Chengdu) February 2010  –  June 2014  (4 years 5 months) Yield Manager Intel Corporation October 2008  –  February 2010  (1 year 5 months) Yield Manager Intel Corporation October 2008  –  February 2010  (1 year 5 months) Product Engineering Manager Intel Corporation August 2007  –  October 2008  (1 year 3 months) Product Engineering Manager Intel Corporation August 2007  –  October 2008  (1 year 3 months) Cost Reduction Manager Intel Corporation April 2006  –  July 2007  (1 year 4 months) Cost Reduction Manager Intel Corporation April 2006  –  July 2007  (1 year 4 months) Process Engineering Group Leader Intel Corporation February 2005  –  July 2007  (2 years 6 months) Process Engineering Group Leader Intel Corporation February 2005  –  July 2007  (2 years 6 months) Lithography New Product Introduction Manager Intel Corporation February 2005  –  July 2007  (2 years 6 months) Lithography New Product Introduction Manager Intel Corporation February 2005  –  July 2007  (2 years 6 months) ASML Platform Qualification Team Leader Intel Corporation December 2004  –  February 2005  (3 months) ASML Platform Qualification Team Leader Intel Corporation December 2004  –  February 2005  (3 months) Flash Technology Defect Team Leader Intel Corporation August 2002  –  August 2003  (1 year 1 month) Flash Technology Defect Team Leader Intel Corporation August 2002  –  August 2003  (1 year 1 month) Skills Manufacturing... Lean Manufacturing Conflict Resolution Problem Solving Problem Sensitivity Stakeholder Management Skills  Manufacturing... Lean Manufacturing Conflict Resolution Problem Solving Problem Sensitivity Stakeholder Management Manufacturing... Lean Manufacturing Conflict Resolution Problem Solving Problem Sensitivity Stakeholder Management Manufacturing... Lean Manufacturing Conflict Resolution Problem Solving Problem Sensitivity Stakeholder Management Education University of California, Davis 1992  – 1996 Homestead High School University of California, Davis 1992  – 1996 University of California, Davis 1992  – 1996 University of California, Davis 1992  – 1996 Homestead High School Homestead High School Homestead High School Honors & Awards Additional Honors & Awards Honored Member of Strathmore's Who's Who 2007 Additional Honors & Awards Honored Member of Strathmore's Who's Who 2007 Additional Honors & Awards Honored Member of Strathmore's Who's Who 2007 Additional Honors & Awards Honored Member of Strathmore's Who's Who 2007 ", "Experience Director of Business Operations, Electrical Validation, System Validation Engineering Group Intel Corporation April 2014  – Present (1 year 5 months) Director of Operations & Technology Adoption, Data Center Platform Applications Enginnering Intel Corporation January 2010  –  March 2014  (4 years 3 months) Worldwide Group Customer Quality & Reliabilty for Digital Enterprise Group Intel Corporation August 1996  –  January 2011  (14 years 6 months) Director of Business Operations, Electrical Validation, System Validation Engineering Group Intel Corporation April 2014  – Present (1 year 5 months) Director of Business Operations, Electrical Validation, System Validation Engineering Group Intel Corporation April 2014  – Present (1 year 5 months) Director of Operations & Technology Adoption, Data Center Platform Applications Enginnering Intel Corporation January 2010  –  March 2014  (4 years 3 months) Director of Operations & Technology Adoption, Data Center Platform Applications Enginnering Intel Corporation January 2010  –  March 2014  (4 years 3 months) Worldwide Group Customer Quality & Reliabilty for Digital Enterprise Group Intel Corporation August 1996  –  January 2011  (14 years 6 months) Worldwide Group Customer Quality & Reliabilty for Digital Enterprise Group Intel Corporation August 1996  –  January 2011  (14 years 6 months) Education North Carolina State University 1987  – 1996 North Carolina State University 1987  – 1996 North Carolina State University 1987  – 1996 North Carolina State University 1987  – 1996 ", "Summary High-Tech Executive with extensive experience in Supply Chain Mangement, Business Operations, IT, HR, Manufacturing and Organizational Management. Direct experience in growing new organizations, managing a world wide team and driving process and tool improvements, specifically in the Supply Chain Arena. Experience with both process improvement and integrating process with Software tools such as SAP and I2. \n \nSpecialties: Supply Chain, SAP, RapidResponse (Kinaxis), Business Operations, Organizational Development, Organizational Growth (recuiting, staffing, development) Summary High-Tech Executive with extensive experience in Supply Chain Mangement, Business Operations, IT, HR, Manufacturing and Organizational Management. Direct experience in growing new organizations, managing a world wide team and driving process and tool improvements, specifically in the Supply Chain Arena. Experience with both process improvement and integrating process with Software tools such as SAP and I2. \n \nSpecialties: Supply Chain, SAP, RapidResponse (Kinaxis), Business Operations, Organizational Development, Organizational Growth (recuiting, staffing, development) High-Tech Executive with extensive experience in Supply Chain Mangement, Business Operations, IT, HR, Manufacturing and Organizational Management. Direct experience in growing new organizations, managing a world wide team and driving process and tool improvements, specifically in the Supply Chain Arena. Experience with both process improvement and integrating process with Software tools such as SAP and I2. \n \nSpecialties: Supply Chain, SAP, RapidResponse (Kinaxis), Business Operations, Organizational Development, Organizational Growth (recuiting, staffing, development) High-Tech Executive with extensive experience in Supply Chain Mangement, Business Operations, IT, HR, Manufacturing and Organizational Management. Direct experience in growing new organizations, managing a world wide team and driving process and tool improvements, specifically in the Supply Chain Arena. Experience with both process improvement and integrating process with Software tools such as SAP and I2. \n \nSpecialties: Supply Chain, SAP, RapidResponse (Kinaxis), Business Operations, Organizational Development, Organizational Growth (recuiting, staffing, development) Experience Supply Chain Executive / Change Agent On Hiatus March 2015  – Present (6 months) Beaverton, Oregon On Hiatus from Corporate America while pursuing my Integral Coaching Certificate from New Ventures West (San Francisco California). Time to invest in my own skill set to enable others to advance theirs. \n \nWilling to consider leadership or consulting opportunities that align with my skills and experience and where I can make a difference to the bottom line. Senior Director: Worldwide Operations Planning TriQuint Semiconductor September 2010  –  March 2015  (4 years 7 months) Hillsboro, Oregon Supply Chain Management from Customer Forecast through Order Fulfilment. Currently leading a direct team of ~ 50 employees worldwide. Focus areas include revenue and capital/cost management as well as driving corporate wide improvement process for customer delivery, S&OP, business analytics and engineering planning. Highly skilled with business analytic systems, including the implementation and usage of RapidResponse (Kinaxis). Expert public speaker on a variety of topics from business systems to management & leadership to employee coaching and development. Director of Operations Intel Corporation April 2006  –  May 2010  (4 years 2 months) Provide Business Operational support for a Graphics Device Development team, specifically in Strategic Organizational development and growth, program office management, Critical Success Indicators and supporting processes, day to day org management. Also support corporate wide team management for R&D Co-location efforts, reporting directly into the CEO. Also provided same level support for Intel's Wi-Max effort. Director of Human Resources Intel Corporation February 2007  –  May 2007  (4 months) Sabbatical Coverage for DEG organization, 12,000 employees, supporting all elements of HR.... peformance management, staffing, org development Director of Supply Chain Improvement Intel Corporation 2001  –  2006  (5 years) Provided managerial leadership and Chief Architect support for supply chain process and tools improvements for Supply/Demand elements of Intel's SC. Led business process design, and oversaw supporting IT technical tool development and deployments. Programs delivered over $1B in cost improvement or revenue uplift. Programs included demand forecasting tools (I2), factory scheduling optimizers (SAP APO), as well as customer global demand alignment. Director of Planning: Boards & Systems Intel June 1999  –  August 2001  (2 years 3 months) Supply /Demand and Capacity Management planning direction for Intel's Boards and Systems Group. WW Fab Planning Director Intel Corporation May 1997  –  June 1999  (2 years 2 months) Rio Rancho, New Mexico Management of all supply chain elements associated with Intel's world wide fab planning organization. Planning responsiblity for 15 fab manufacturing fabs, factory capacity analysis, supply demand analysis and process control. Factory Planning Manager Intel Corporation May 1983  –  June 1999  (16 years 2 months) Responsible for all factory planning elements for a variety of different fabs over the year span. Factory capacity, output commitents, wafer starts, excursion management. Specicalized in low cost, high volume manufacturing Planning Supervisor: Fab Operator Training Intel Corp 1981  –  1983  (2 years) Supervision for 15-25 Fab Trainers across 4 factory shifts Supply Chain Executive / Change Agent On Hiatus March 2015  – Present (6 months) Beaverton, Oregon On Hiatus from Corporate America while pursuing my Integral Coaching Certificate from New Ventures West (San Francisco California). Time to invest in my own skill set to enable others to advance theirs. \n \nWilling to consider leadership or consulting opportunities that align with my skills and experience and where I can make a difference to the bottom line. Supply Chain Executive / Change Agent On Hiatus March 2015  – Present (6 months) Beaverton, Oregon On Hiatus from Corporate America while pursuing my Integral Coaching Certificate from New Ventures West (San Francisco California). Time to invest in my own skill set to enable others to advance theirs. \n \nWilling to consider leadership or consulting opportunities that align with my skills and experience and where I can make a difference to the bottom line. Senior Director: Worldwide Operations Planning TriQuint Semiconductor September 2010  –  March 2015  (4 years 7 months) Hillsboro, Oregon Supply Chain Management from Customer Forecast through Order Fulfilment. Currently leading a direct team of ~ 50 employees worldwide. Focus areas include revenue and capital/cost management as well as driving corporate wide improvement process for customer delivery, S&OP, business analytics and engineering planning. Highly skilled with business analytic systems, including the implementation and usage of RapidResponse (Kinaxis). Expert public speaker on a variety of topics from business systems to management & leadership to employee coaching and development. Senior Director: Worldwide Operations Planning TriQuint Semiconductor September 2010  –  March 2015  (4 years 7 months) Hillsboro, Oregon Supply Chain Management from Customer Forecast through Order Fulfilment. Currently leading a direct team of ~ 50 employees worldwide. Focus areas include revenue and capital/cost management as well as driving corporate wide improvement process for customer delivery, S&OP, business analytics and engineering planning. Highly skilled with business analytic systems, including the implementation and usage of RapidResponse (Kinaxis). Expert public speaker on a variety of topics from business systems to management & leadership to employee coaching and development. Director of Operations Intel Corporation April 2006  –  May 2010  (4 years 2 months) Provide Business Operational support for a Graphics Device Development team, specifically in Strategic Organizational development and growth, program office management, Critical Success Indicators and supporting processes, day to day org management. Also support corporate wide team management for R&D Co-location efforts, reporting directly into the CEO. Also provided same level support for Intel's Wi-Max effort. Director of Operations Intel Corporation April 2006  –  May 2010  (4 years 2 months) Provide Business Operational support for a Graphics Device Development team, specifically in Strategic Organizational development and growth, program office management, Critical Success Indicators and supporting processes, day to day org management. Also support corporate wide team management for R&D Co-location efforts, reporting directly into the CEO. Also provided same level support for Intel's Wi-Max effort. Director of Human Resources Intel Corporation February 2007  –  May 2007  (4 months) Sabbatical Coverage for DEG organization, 12,000 employees, supporting all elements of HR.... peformance management, staffing, org development Director of Human Resources Intel Corporation February 2007  –  May 2007  (4 months) Sabbatical Coverage for DEG organization, 12,000 employees, supporting all elements of HR.... peformance management, staffing, org development Director of Supply Chain Improvement Intel Corporation 2001  –  2006  (5 years) Provided managerial leadership and Chief Architect support for supply chain process and tools improvements for Supply/Demand elements of Intel's SC. Led business process design, and oversaw supporting IT technical tool development and deployments. Programs delivered over $1B in cost improvement or revenue uplift. Programs included demand forecasting tools (I2), factory scheduling optimizers (SAP APO), as well as customer global demand alignment. Director of Supply Chain Improvement Intel Corporation 2001  –  2006  (5 years) Provided managerial leadership and Chief Architect support for supply chain process and tools improvements for Supply/Demand elements of Intel's SC. Led business process design, and oversaw supporting IT technical tool development and deployments. Programs delivered over $1B in cost improvement or revenue uplift. Programs included demand forecasting tools (I2), factory scheduling optimizers (SAP APO), as well as customer global demand alignment. Director of Planning: Boards & Systems Intel June 1999  –  August 2001  (2 years 3 months) Supply /Demand and Capacity Management planning direction for Intel's Boards and Systems Group. Director of Planning: Boards & Systems Intel June 1999  –  August 2001  (2 years 3 months) Supply /Demand and Capacity Management planning direction for Intel's Boards and Systems Group. WW Fab Planning Director Intel Corporation May 1997  –  June 1999  (2 years 2 months) Rio Rancho, New Mexico Management of all supply chain elements associated with Intel's world wide fab planning organization. Planning responsiblity for 15 fab manufacturing fabs, factory capacity analysis, supply demand analysis and process control. WW Fab Planning Director Intel Corporation May 1997  –  June 1999  (2 years 2 months) Rio Rancho, New Mexico Management of all supply chain elements associated with Intel's world wide fab planning organization. Planning responsiblity for 15 fab manufacturing fabs, factory capacity analysis, supply demand analysis and process control. Factory Planning Manager Intel Corporation May 1983  –  June 1999  (16 years 2 months) Responsible for all factory planning elements for a variety of different fabs over the year span. Factory capacity, output commitents, wafer starts, excursion management. Specicalized in low cost, high volume manufacturing Planning Factory Planning Manager Intel Corporation May 1983  –  June 1999  (16 years 2 months) Responsible for all factory planning elements for a variety of different fabs over the year span. Factory capacity, output commitents, wafer starts, excursion management. Specicalized in low cost, high volume manufacturing Planning Supervisor: Fab Operator Training Intel Corp 1981  –  1983  (2 years) Supervision for 15-25 Fab Trainers across 4 factory shifts Supervisor: Fab Operator Training Intel Corp 1981  –  1983  (2 years) Supervision for 15-25 Fab Trainers across 4 factory shifts Skills Supply Chain SAP I2 Business Operations Organizational... Supply Chain Management Process Improvement Strategy Team Building Program Management Cross-functional Team... Management Operations Management Project Planning Supply Management Strategic Planning Manufacturing Process Engineering Product Management Team Management Lean Manufacturing Leadership Analysis Training Enterprise Software Performance Management Recruiting Human Resources Six Sigma Semiconductors Semiconductor Industry SPC Continuous Improvement Manufacturing... Engineering Management See 20+     See less Skills  Supply Chain SAP I2 Business Operations Organizational... Supply Chain Management Process Improvement Strategy Team Building Program Management Cross-functional Team... Management Operations Management Project Planning Supply Management Strategic Planning Manufacturing Process Engineering Product Management Team Management Lean Manufacturing Leadership Analysis Training Enterprise Software Performance Management Recruiting Human Resources Six Sigma Semiconductors Semiconductor Industry SPC Continuous Improvement Manufacturing... Engineering Management See 20+     See less Supply Chain SAP I2 Business Operations Organizational... Supply Chain Management Process Improvement Strategy Team Building Program Management Cross-functional Team... Management Operations Management Project Planning Supply Management Strategic Planning Manufacturing Process Engineering Product Management Team Management Lean Manufacturing Leadership Analysis Training Enterprise Software Performance Management Recruiting Human Resources Six Sigma Semiconductors Semiconductor Industry SPC Continuous Improvement Manufacturing... Engineering Management See 20+     See less Supply Chain SAP I2 Business Operations Organizational... Supply Chain Management Process Improvement Strategy Team Building Program Management Cross-functional Team... Management Operations Management Project Planning Supply Management Strategic Planning Manufacturing Process Engineering Product Management Team Management Lean Manufacturing Leadership Analysis Training Enterprise Software Performance Management Recruiting Human Resources Six Sigma Semiconductors Semiconductor Industry SPC Continuous Improvement Manufacturing... Engineering Management See 20+     See less Education University of Portland BBA,  Marketing , Management 1978  – 1981 Completed 5 year dual major degree in 3 years University of Portland BBA,  Marketing , Management 1978  – 1981 Completed 5 year dual major degree in 3 years University of Portland BBA,  Marketing , Management 1978  – 1981 Completed 5 year dual major degree in 3 years University of Portland BBA,  Marketing , Management 1978  – 1981 Completed 5 year dual major degree in 3 years Honors & Awards C.P.I.M. American Production & Inventory Control Society July 1985 CPIM designation is a professional certification offered by APICS The Association for Operations Management. APICS CPIM designees learn essential terminology, concepts, and strategies related to demand management, procurement and supplier planning, material requirements planning, capacity requirements planning, sales and operations planning, master scheduling, performance measurements, supplier relationships, quality control, and continuous improvement. \n \nTo earn the APICS CPIM designation, operations management professionals must successfully complete five exams: Basics of Supply Chain Management, Master Planning of Resources, Detailed Scheduling and Planning, Execution and Control of Operations, Strategic Management of Resources \n C.P.I.M. American Production & Inventory Control Society July 1985 CPIM designation is a professional certification offered by APICS The Association for Operations Management. APICS CPIM designees learn essential terminology, concepts, and strategies related to demand management, procurement and supplier planning, material requirements planning, capacity requirements planning, sales and operations planning, master scheduling, performance measurements, supplier relationships, quality control, and continuous improvement. \n \nTo earn the APICS CPIM designation, operations management professionals must successfully complete five exams: Basics of Supply Chain Management, Master Planning of Resources, Detailed Scheduling and Planning, Execution and Control of Operations, Strategic Management of Resources \n C.P.I.M. American Production & Inventory Control Society July 1985 CPIM designation is a professional certification offered by APICS The Association for Operations Management. APICS CPIM designees learn essential terminology, concepts, and strategies related to demand management, procurement and supplier planning, material requirements planning, capacity requirements planning, sales and operations planning, master scheduling, performance measurements, supplier relationships, quality control, and continuous improvement. \n \nTo earn the APICS CPIM designation, operations management professionals must successfully complete five exams: Basics of Supply Chain Management, Master Planning of Resources, Detailed Scheduling and Planning, Execution and Control of Operations, Strategic Management of Resources \n C.P.I.M. American Production & Inventory Control Society July 1985 CPIM designation is a professional certification offered by APICS The Association for Operations Management. APICS CPIM designees learn essential terminology, concepts, and strategies related to demand management, procurement and supplier planning, material requirements planning, capacity requirements planning, sales and operations planning, master scheduling, performance measurements, supplier relationships, quality control, and continuous improvement. \n \nTo earn the APICS CPIM designation, operations management professionals must successfully complete five exams: Basics of Supply Chain Management, Master Planning of Resources, Detailed Scheduling and Planning, Execution and Control of Operations, Strategic Management of Resources \n ", "Summary Throughout my career I have sought out opportunities to lead change. I have a contagious energy that surfaces when I am resolving organizational bottlenecks or identifying breakthrough strategies. I have a broad range of experiences including roles in strategic planning, strategic marketing, business development and engineering management that give me the ability to attack problems holistically.  \n \nKey Areas of Expertise:  \n• Corporate venturing, entrepreneurship, new business development & management. \n• Holistic business strategies based on user experience, business models and technology. \n• Leading change by igniting the passion of others through a shared vision and goals. \n• Proven negotiator with experience in strategic partnerships and IP contract negotiations. \n• Exceptional management scores as reflected in two different feedback tools used at Intel. \n• Significant experience in new business startup, mentoring and change management \n• Demonstrated combination of interpersonal and analytical skills. \n• At ease in high stress, fast-paced environments with high degrees of ambiguity. \n• Equally adept in small, large or highly matrixed organizations. \n \nSpecialties: Strategic planning, corporate venturing, new business development, general management, leading change, negotiations, user experience design, organizational development, hardware and software engineering operations, semiconductor product engineering, SOCs Summary Throughout my career I have sought out opportunities to lead change. I have a contagious energy that surfaces when I am resolving organizational bottlenecks or identifying breakthrough strategies. I have a broad range of experiences including roles in strategic planning, strategic marketing, business development and engineering management that give me the ability to attack problems holistically.  \n \nKey Areas of Expertise:  \n• Corporate venturing, entrepreneurship, new business development & management. \n• Holistic business strategies based on user experience, business models and technology. \n• Leading change by igniting the passion of others through a shared vision and goals. \n• Proven negotiator with experience in strategic partnerships and IP contract negotiations. \n• Exceptional management scores as reflected in two different feedback tools used at Intel. \n• Significant experience in new business startup, mentoring and change management \n• Demonstrated combination of interpersonal and analytical skills. \n• At ease in high stress, fast-paced environments with high degrees of ambiguity. \n• Equally adept in small, large or highly matrixed organizations. \n \nSpecialties: Strategic planning, corporate venturing, new business development, general management, leading change, negotiations, user experience design, organizational development, hardware and software engineering operations, semiconductor product engineering, SOCs Throughout my career I have sought out opportunities to lead change. I have a contagious energy that surfaces when I am resolving organizational bottlenecks or identifying breakthrough strategies. I have a broad range of experiences including roles in strategic planning, strategic marketing, business development and engineering management that give me the ability to attack problems holistically.  \n \nKey Areas of Expertise:  \n• Corporate venturing, entrepreneurship, new business development & management. \n• Holistic business strategies based on user experience, business models and technology. \n• Leading change by igniting the passion of others through a shared vision and goals. \n• Proven negotiator with experience in strategic partnerships and IP contract negotiations. \n• Exceptional management scores as reflected in two different feedback tools used at Intel. \n• Significant experience in new business startup, mentoring and change management \n• Demonstrated combination of interpersonal and analytical skills. \n• At ease in high stress, fast-paced environments with high degrees of ambiguity. \n• Equally adept in small, large or highly matrixed organizations. \n \nSpecialties: Strategic planning, corporate venturing, new business development, general management, leading change, negotiations, user experience design, organizational development, hardware and software engineering operations, semiconductor product engineering, SOCs Throughout my career I have sought out opportunities to lead change. I have a contagious energy that surfaces when I am resolving organizational bottlenecks or identifying breakthrough strategies. I have a broad range of experiences including roles in strategic planning, strategic marketing, business development and engineering management that give me the ability to attack problems holistically.  \n \nKey Areas of Expertise:  \n• Corporate venturing, entrepreneurship, new business development & management. \n• Holistic business strategies based on user experience, business models and technology. \n• Leading change by igniting the passion of others through a shared vision and goals. \n• Proven negotiator with experience in strategic partnerships and IP contract negotiations. \n• Exceptional management scores as reflected in two different feedback tools used at Intel. \n• Significant experience in new business startup, mentoring and change management \n• Demonstrated combination of interpersonal and analytical skills. \n• At ease in high stress, fast-paced environments with high degrees of ambiguity. \n• Equally adept in small, large or highly matrixed organizations. \n \nSpecialties: Strategic planning, corporate venturing, new business development, general management, leading change, negotiations, user experience design, organizational development, hardware and software engineering operations, semiconductor product engineering, SOCs Experience Director of New Business Initiatives Business Development & Operations Intel Corporation June 2015  – Present (3 months) With a mission to create viable new business options that drive growth, return significant business value, Intel’s New Business Initiatives group (NBI) is dedicated to finding and developing ways Intel can participate in future growth opportunities through a combination of internal and external incubation.  Director of Service Operations Intel Corporation May 2014  – Present (1 year 4 months) Hillsboro, OR Director of Service Operations - Lovell Project - an innovative intrapreneurial startup that utilizes business model innovation to bring a superior user experience to consumers. Business resulted in a successful spin out. Director of Mobile User Experience Design & Strategy Intel Corporation January 2012  – Present (3 years 8 months) Portland, Oregon Area Responsible for driving corporate level wearables and Internet of Things strategy development. In addition, leading a cross-disciplined design team that includes Ethnographers, Interaction Designers, Visual Designers and Human Factors Engineers focused on bringing the next generation of smart phones, tablets, and wearables to life. Led the division through dramatic change shifting it from a technology centric product design approach to a more balanced user centric design approach dramatically improving the user experience of its products. Director, User Experience Strategic Planning Intel Corporation January 2011  –  January 2012  (1 year 1 month) Portland, Oregon Area Responsible for bringing the voice of the consumer into strategic planning by driving an innovative user experience based strategic planning process with a combination of ethnographic studies, usage roadmaps, use case development and showcase product development. Director of Operations Atom Client Division Intel Corporation November 2009  –  January 2011  (1 year 3 months) Portland, Oregon Area Recruited by the GM of the newly formed Atom Client Division to help develop the group’s strategy and ramped the organization. Responsible for organizational develop including decision making processes, critical hiring and key employee mentoring. Strategic Marketing New Business Initiatives Intel April 2006  –  November 2009  (3 years 8 months) Member of investment team performing the role of Strategic Business Development Manager for multiple startups within the NBI portfolio. The role involved industry and business strategy analysis, as well as team health and skill assessments. Investigation areas included video analytics, advanced graphics, wireless technology, digital signage, software as a service, high performance computing, electronic movie distribution, and device enabled services among others. Co-Founder/Engineering Manager ICO Intel March 2004  –  April 2006  (2 years 2 months) New Business Initiatives Founding Member of Intel Image Components Operations (ICO)\t \nJoined the team during the initial seed phase. Co-led team that developed an image sensor and image processing silicon based business from the ground up. Successfully brought the business through two rounds of funding. Design Automation Manager Intel January 1999  –  January 2004  (5 years 1 month) Led a 70 person team responsible for methodology and CAD tools used to develop the next generation 3.4GHz+ Pentium 4™ brand microprocessors. Senior Design Automation Engineer Intel 1996  –  1999  (3 years) Senior Design Automation Engineer Engineer IBM Microelectronics 1992  –  1996  (4 years) Director of New Business Initiatives Business Development & Operations Intel Corporation June 2015  – Present (3 months) With a mission to create viable new business options that drive growth, return significant business value, Intel’s New Business Initiatives group (NBI) is dedicated to finding and developing ways Intel can participate in future growth opportunities through a combination of internal and external incubation.  Director of New Business Initiatives Business Development & Operations Intel Corporation June 2015  – Present (3 months) With a mission to create viable new business options that drive growth, return significant business value, Intel’s New Business Initiatives group (NBI) is dedicated to finding and developing ways Intel can participate in future growth opportunities through a combination of internal and external incubation.  Director of Service Operations Intel Corporation May 2014  – Present (1 year 4 months) Hillsboro, OR Director of Service Operations - Lovell Project - an innovative intrapreneurial startup that utilizes business model innovation to bring a superior user experience to consumers. Business resulted in a successful spin out. Director of Service Operations Intel Corporation May 2014  – Present (1 year 4 months) Hillsboro, OR Director of Service Operations - Lovell Project - an innovative intrapreneurial startup that utilizes business model innovation to bring a superior user experience to consumers. Business resulted in a successful spin out. Director of Mobile User Experience Design & Strategy Intel Corporation January 2012  – Present (3 years 8 months) Portland, Oregon Area Responsible for driving corporate level wearables and Internet of Things strategy development. In addition, leading a cross-disciplined design team that includes Ethnographers, Interaction Designers, Visual Designers and Human Factors Engineers focused on bringing the next generation of smart phones, tablets, and wearables to life. Led the division through dramatic change shifting it from a technology centric product design approach to a more balanced user centric design approach dramatically improving the user experience of its products. Director of Mobile User Experience Design & Strategy Intel Corporation January 2012  – Present (3 years 8 months) Portland, Oregon Area Responsible for driving corporate level wearables and Internet of Things strategy development. In addition, leading a cross-disciplined design team that includes Ethnographers, Interaction Designers, Visual Designers and Human Factors Engineers focused on bringing the next generation of smart phones, tablets, and wearables to life. Led the division through dramatic change shifting it from a technology centric product design approach to a more balanced user centric design approach dramatically improving the user experience of its products. Director, User Experience Strategic Planning Intel Corporation January 2011  –  January 2012  (1 year 1 month) Portland, Oregon Area Responsible for bringing the voice of the consumer into strategic planning by driving an innovative user experience based strategic planning process with a combination of ethnographic studies, usage roadmaps, use case development and showcase product development. Director, User Experience Strategic Planning Intel Corporation January 2011  –  January 2012  (1 year 1 month) Portland, Oregon Area Responsible for bringing the voice of the consumer into strategic planning by driving an innovative user experience based strategic planning process with a combination of ethnographic studies, usage roadmaps, use case development and showcase product development. Director of Operations Atom Client Division Intel Corporation November 2009  –  January 2011  (1 year 3 months) Portland, Oregon Area Recruited by the GM of the newly formed Atom Client Division to help develop the group’s strategy and ramped the organization. Responsible for organizational develop including decision making processes, critical hiring and key employee mentoring. Director of Operations Atom Client Division Intel Corporation November 2009  –  January 2011  (1 year 3 months) Portland, Oregon Area Recruited by the GM of the newly formed Atom Client Division to help develop the group’s strategy and ramped the organization. Responsible for organizational develop including decision making processes, critical hiring and key employee mentoring. Strategic Marketing New Business Initiatives Intel April 2006  –  November 2009  (3 years 8 months) Member of investment team performing the role of Strategic Business Development Manager for multiple startups within the NBI portfolio. The role involved industry and business strategy analysis, as well as team health and skill assessments. Investigation areas included video analytics, advanced graphics, wireless technology, digital signage, software as a service, high performance computing, electronic movie distribution, and device enabled services among others. Strategic Marketing New Business Initiatives Intel April 2006  –  November 2009  (3 years 8 months) Member of investment team performing the role of Strategic Business Development Manager for multiple startups within the NBI portfolio. The role involved industry and business strategy analysis, as well as team health and skill assessments. Investigation areas included video analytics, advanced graphics, wireless technology, digital signage, software as a service, high performance computing, electronic movie distribution, and device enabled services among others. Co-Founder/Engineering Manager ICO Intel March 2004  –  April 2006  (2 years 2 months) New Business Initiatives Founding Member of Intel Image Components Operations (ICO)\t \nJoined the team during the initial seed phase. Co-led team that developed an image sensor and image processing silicon based business from the ground up. Successfully brought the business through two rounds of funding. Co-Founder/Engineering Manager ICO Intel March 2004  –  April 2006  (2 years 2 months) New Business Initiatives Founding Member of Intel Image Components Operations (ICO)\t \nJoined the team during the initial seed phase. Co-led team that developed an image sensor and image processing silicon based business from the ground up. Successfully brought the business through two rounds of funding. Design Automation Manager Intel January 1999  –  January 2004  (5 years 1 month) Led a 70 person team responsible for methodology and CAD tools used to develop the next generation 3.4GHz+ Pentium 4™ brand microprocessors. Design Automation Manager Intel January 1999  –  January 2004  (5 years 1 month) Led a 70 person team responsible for methodology and CAD tools used to develop the next generation 3.4GHz+ Pentium 4™ brand microprocessors. Senior Design Automation Engineer Intel 1996  –  1999  (3 years) Senior Design Automation Engineer Senior Design Automation Engineer Intel 1996  –  1999  (3 years) Senior Design Automation Engineer Engineer IBM Microelectronics 1992  –  1996  (4 years) Engineer IBM Microelectronics 1992  –  1996  (4 years) Skills Intel Business Strategy Product Development Strategic Planning Start-ups Semiconductors Program Management SoC Competitive Analysis Strategy Cross-functional Team... Business Development Marketing Strategy Strategic Partnerships Skills  Intel Business Strategy Product Development Strategic Planning Start-ups Semiconductors Program Management SoC Competitive Analysis Strategy Cross-functional Team... Business Development Marketing Strategy Strategic Partnerships Intel Business Strategy Product Development Strategic Planning Start-ups Semiconductors Program Management SoC Competitive Analysis Strategy Cross-functional Team... Business Development Marketing Strategy Strategic Partnerships Intel Business Strategy Product Development Strategic Planning Start-ups Semiconductors Program Management SoC Competitive Analysis Strategy Cross-functional Team... Business Development Marketing Strategy Strategic Partnerships Education Babson College - Franklin W. Olin Graduate School of Business MBA 2006  – 2008 Worcester Polytechnic Institute BS/MS,  Electrical Engineering 1985  – 1992 Babson College - Franklin W. Olin Graduate School of Business MBA 2006  – 2008 Babson College - Franklin W. Olin Graduate School of Business MBA 2006  – 2008 Babson College - Franklin W. Olin Graduate School of Business MBA 2006  – 2008 Worcester Polytechnic Institute BS/MS,  Electrical Engineering 1985  – 1992 Worcester Polytechnic Institute BS/MS,  Electrical Engineering 1985  – 1992 Worcester Polytechnic Institute BS/MS,  Electrical Engineering 1985  – 1992 ", "Skills Manufacturing Team Building Construction Program Management Product Development Engineering Machining Continuous Improvement Steel Budgets Cross-functional Team... Lean Manufacturing Contract Negotiation Six Sigma Process Engineering Strategic Planning Management Business Strategy Leadership New Business Development See 5+     See less Skills  Manufacturing Team Building Construction Program Management Product Development Engineering Machining Continuous Improvement Steel Budgets Cross-functional Team... Lean Manufacturing Contract Negotiation Six Sigma Process Engineering Strategic Planning Management Business Strategy Leadership New Business Development See 5+     See less Manufacturing Team Building Construction Program Management Product Development Engineering Machining Continuous Improvement Steel Budgets Cross-functional Team... Lean Manufacturing Contract Negotiation Six Sigma Process Engineering Strategic Planning Management Business Strategy Leadership New Business Development See 5+     See less Manufacturing Team Building Construction Program Management Product Development Engineering Machining Continuous Improvement Steel Budgets Cross-functional Team... Lean Manufacturing Contract Negotiation Six Sigma Process Engineering Strategic Planning Management Business Strategy Leadership New Business Development See 5+     See less ", "Experience Vice President and Director of Operations, Non Volatile Memory Solutions Group Intel Corporation April 2014  – Present (1 year 5 months) Business management and supply chain management for Intel SSD group. Director of Operations; NAND Products Group Intel November 2005  –  April 2014  (8 years 6 months) Business management and supply chain management for Intel’s NAND Group Director of Planning, NOR Flash Memory Group Intel Corporation June 2004  –  November 2005  (1 year 6 months) Management of supply planning and supply chain for the NOR Flash business group World Wide Customer Operations and Programs Director Intel Corporation March 2002  –  June 2004  (2 years 4 months) Worldwide solutions and business process for Intel customer account management for Intel’s Sales and Marketing Group Customer Operations Manager, America’s Sales and Marketing Group Intel Corporation June 1997  –  February 2002  (4 years 9 months) Demand, order management and fulfillment for all Intel America’s Customers Planning Manager, Memory Components Division Intel Corporation June 1993  –  June 1997  (4 years 1 month) Supply planning manager for NOR Flash Division Corporate Component Procurement IBM 1982  –  1993  (11 years) Procurement, inventory management, and supply chain management of IBM’s external semiconductor components needs for Corporate Component Procurement ( CCP) Division Vice President and Director of Operations, Non Volatile Memory Solutions Group Intel Corporation April 2014  – Present (1 year 5 months) Business management and supply chain management for Intel SSD group. Vice President and Director of Operations, Non Volatile Memory Solutions Group Intel Corporation April 2014  – Present (1 year 5 months) Business management and supply chain management for Intel SSD group. Director of Operations; NAND Products Group Intel November 2005  –  April 2014  (8 years 6 months) Business management and supply chain management for Intel’s NAND Group Director of Operations; NAND Products Group Intel November 2005  –  April 2014  (8 years 6 months) Business management and supply chain management for Intel’s NAND Group Director of Planning, NOR Flash Memory Group Intel Corporation June 2004  –  November 2005  (1 year 6 months) Management of supply planning and supply chain for the NOR Flash business group Director of Planning, NOR Flash Memory Group Intel Corporation June 2004  –  November 2005  (1 year 6 months) Management of supply planning and supply chain for the NOR Flash business group World Wide Customer Operations and Programs Director Intel Corporation March 2002  –  June 2004  (2 years 4 months) Worldwide solutions and business process for Intel customer account management for Intel’s Sales and Marketing Group World Wide Customer Operations and Programs Director Intel Corporation March 2002  –  June 2004  (2 years 4 months) Worldwide solutions and business process for Intel customer account management for Intel’s Sales and Marketing Group Customer Operations Manager, America’s Sales and Marketing Group Intel Corporation June 1997  –  February 2002  (4 years 9 months) Demand, order management and fulfillment for all Intel America’s Customers Customer Operations Manager, America’s Sales and Marketing Group Intel Corporation June 1997  –  February 2002  (4 years 9 months) Demand, order management and fulfillment for all Intel America’s Customers Planning Manager, Memory Components Division Intel Corporation June 1993  –  June 1997  (4 years 1 month) Supply planning manager for NOR Flash Division Planning Manager, Memory Components Division Intel Corporation June 1993  –  June 1997  (4 years 1 month) Supply planning manager for NOR Flash Division Corporate Component Procurement IBM 1982  –  1993  (11 years) Procurement, inventory management, and supply chain management of IBM’s external semiconductor components needs for Corporate Component Procurement ( CCP) Division Corporate Component Procurement IBM 1982  –  1993  (11 years) Procurement, inventory management, and supply chain management of IBM’s external semiconductor components needs for Corporate Component Procurement ( CCP) Division Education Penn State University BS,  Business Logistics 1978  – 1982 Penn State University BS,  Business Logistics 1978  – 1982 Penn State University BS,  Business Logistics 1978  – 1982 Penn State University BS,  Business Logistics 1978  – 1982 ", "Experience Russia CIS BDM Intel Corporation January 2013  – Present (2 years 8 months) Deputy Dean on Innovations, Associate Professor IT Faculty, Novosibirsk State University September 2000  – Present (15 years) Director of Operations Intel Corporation January 2007  –  December 2012  (6 years) Novosibirsk Region, Russian Federation Software Engineering Manager Intel Corporation August 2004  –  January 2007  (2 years 6 months) Senior Scientific Researcher, Head of IT lab Russia Academy of Sciences August 1982  –  July 2004  (22 years) PhD in 1991; more than 100 papers, 4 books: \nAvdeev A.V., Kremlev A.N., Konyuh G.V., Kutov V.P. Introduction to Numerical Methods and Their Applications in Computer Modeling. Novosibirsk State University, 1998, 65 p. \nAvdeev A.V., Lavrentiev M.M.-jr., Priimenko V.I. Inverse Problems and Some Applications. 1999 , NCC Publ., Novosibirsk, 342 p. (in English).  \nLavrentiev M.M., Avdeev A.V., Lavrentiev M.M.-jr., Priimenko V.I. Inverse Problems of Mathematical Physics. 2003, VSP Publ., The Netherlands, 272 p.  \nAvdeev A.V., Priimenko V.I., Vishnevsky M.P. Mathematical Problems of Electromagnetoelastic Interactions. 2004, NCC Publ., Novosibirsk, 92 p. (in English). Russia CIS BDM Intel Corporation January 2013  – Present (2 years 8 months) Russia CIS BDM Intel Corporation January 2013  – Present (2 years 8 months) Deputy Dean on Innovations, Associate Professor IT Faculty, Novosibirsk State University September 2000  – Present (15 years) Deputy Dean on Innovations, Associate Professor IT Faculty, Novosibirsk State University September 2000  – Present (15 years) Director of Operations Intel Corporation January 2007  –  December 2012  (6 years) Novosibirsk Region, Russian Federation Director of Operations Intel Corporation January 2007  –  December 2012  (6 years) Novosibirsk Region, Russian Federation Software Engineering Manager Intel Corporation August 2004  –  January 2007  (2 years 6 months) Software Engineering Manager Intel Corporation August 2004  –  January 2007  (2 years 6 months) Senior Scientific Researcher, Head of IT lab Russia Academy of Sciences August 1982  –  July 2004  (22 years) PhD in 1991; more than 100 papers, 4 books: \nAvdeev A.V., Kremlev A.N., Konyuh G.V., Kutov V.P. Introduction to Numerical Methods and Their Applications in Computer Modeling. Novosibirsk State University, 1998, 65 p. \nAvdeev A.V., Lavrentiev M.M.-jr., Priimenko V.I. Inverse Problems and Some Applications. 1999 , NCC Publ., Novosibirsk, 342 p. (in English).  \nLavrentiev M.M., Avdeev A.V., Lavrentiev M.M.-jr., Priimenko V.I. Inverse Problems of Mathematical Physics. 2003, VSP Publ., The Netherlands, 272 p.  \nAvdeev A.V., Priimenko V.I., Vishnevsky M.P. Mathematical Problems of Electromagnetoelastic Interactions. 2004, NCC Publ., Novosibirsk, 92 p. (in English). Senior Scientific Researcher, Head of IT lab Russia Academy of Sciences August 1982  –  July 2004  (22 years) PhD in 1991; more than 100 papers, 4 books: \nAvdeev A.V., Kremlev A.N., Konyuh G.V., Kutov V.P. Introduction to Numerical Methods and Their Applications in Computer Modeling. Novosibirsk State University, 1998, 65 p. \nAvdeev A.V., Lavrentiev M.M.-jr., Priimenko V.I. Inverse Problems and Some Applications. 1999 , NCC Publ., Novosibirsk, 342 p. (in English).  \nLavrentiev M.M., Avdeev A.V., Lavrentiev M.M.-jr., Priimenko V.I. Inverse Problems of Mathematical Physics. 2003, VSP Publ., The Netherlands, 272 p.  \nAvdeev A.V., Priimenko V.I., Vishnevsky M.P. Mathematical Problems of Electromagnetoelastic Interactions. 2004, NCC Publ., Novosibirsk, 92 p. (in English). Skills C++ Perl Software Development Distributed Systems Computer Science C Team Management Microsoft SQL Server Analysis Software Engineering Computer Architecture Java Linux Project Planning Strategy Algorithms Requirements Analysis Numerical Analysis Object Oriented Design Optimization Strategic Partnerships Business Development Operating Systems Simulations Architectures Leadership Program Management Operations Management Architecture Business Intelligence Git See 16+     See less Skills  C++ Perl Software Development Distributed Systems Computer Science C Team Management Microsoft SQL Server Analysis Software Engineering Computer Architecture Java Linux Project Planning Strategy Algorithms Requirements Analysis Numerical Analysis Object Oriented Design Optimization Strategic Partnerships Business Development Operating Systems Simulations Architectures Leadership Program Management Operations Management Architecture Business Intelligence Git See 16+     See less C++ Perl Software Development Distributed Systems Computer Science C Team Management Microsoft SQL Server Analysis Software Engineering Computer Architecture Java Linux Project Planning Strategy Algorithms Requirements Analysis Numerical Analysis Object Oriented Design Optimization Strategic Partnerships Business Development Operating Systems Simulations Architectures Leadership Program Management Operations Management Architecture Business Intelligence Git See 16+     See less C++ Perl Software Development Distributed Systems Computer Science C Team Management Microsoft SQL Server Analysis Software Engineering Computer Architecture Java Linux Project Planning Strategy Algorithms Requirements Analysis Numerical Analysis Object Oriented Design Optimization Strategic Partnerships Business Development Operating Systems Simulations Architectures Leadership Program Management Operations Management Architecture Business Intelligence Git See 16+     See less Education Novosibirsk State University (NSU) Doctor of Philosophy (Ph.D.),  Applied Mathematics ,  Computer Science 1986  – 1991 Activities and Societies:  SIAM ,  AMS Novosibirsk State University (NSU) Master's Degree,  Applied Mathematics 1977  – 1982 Novosibirsk State University (NSU) Doctor of Philosophy (Ph.D.),  Applied Mathematics ,  Computer Science 1986  – 1991 Activities and Societies:  SIAM ,  AMS Novosibirsk State University (NSU) Doctor of Philosophy (Ph.D.),  Applied Mathematics ,  Computer Science 1986  – 1991 Activities and Societies:  SIAM ,  AMS Novosibirsk State University (NSU) Doctor of Philosophy (Ph.D.),  Applied Mathematics ,  Computer Science 1986  – 1991 Activities and Societies:  SIAM ,  AMS Novosibirsk State University (NSU) Master's Degree,  Applied Mathematics 1977  – 1982 Novosibirsk State University (NSU) Master's Degree,  Applied Mathematics 1977  – 1982 Novosibirsk State University (NSU) Master's Degree,  Applied Mathematics 1977  – 1982 ", "Experience Security Vendor Program Manager Facebook November 2013  – Present (1 year 10 months) Menlo Park, CA Director, Fab Capital Equipment Supply Chain Intel Corporation March 2007  –  September 2013  (6 years 7 months) San Francisco Bay Area Manage supplier relationships and corporate purchasing agreements for Intel's wafer fabrication equipment suppliers. General Manager, Intel Mask Operations; Director, Operations Intel Corporation January 1998  –  March 2007  (9 years 3 months) San Francisco Bay Area Managed factory operations including overall budget & fiscal control and operations management. Scope included capital budget forecast, plan, business operations-output, quality, safety, business continuity. Operations Manager Intel Corporation, D2 1988  –  2000  (12 years) Security Vendor Program Manager Facebook November 2013  – Present (1 year 10 months) Menlo Park, CA Security Vendor Program Manager Facebook November 2013  – Present (1 year 10 months) Menlo Park, CA Director, Fab Capital Equipment Supply Chain Intel Corporation March 2007  –  September 2013  (6 years 7 months) San Francisco Bay Area Manage supplier relationships and corporate purchasing agreements for Intel's wafer fabrication equipment suppliers. Director, Fab Capital Equipment Supply Chain Intel Corporation March 2007  –  September 2013  (6 years 7 months) San Francisco Bay Area Manage supplier relationships and corporate purchasing agreements for Intel's wafer fabrication equipment suppliers. General Manager, Intel Mask Operations; Director, Operations Intel Corporation January 1998  –  March 2007  (9 years 3 months) San Francisco Bay Area Managed factory operations including overall budget & fiscal control and operations management. Scope included capital budget forecast, plan, business operations-output, quality, safety, business continuity. General Manager, Intel Mask Operations; Director, Operations Intel Corporation January 1998  –  March 2007  (9 years 3 months) San Francisco Bay Area Managed factory operations including overall budget & fiscal control and operations management. Scope included capital budget forecast, plan, business operations-output, quality, safety, business continuity. Operations Manager Intel Corporation, D2 1988  –  2000  (12 years) Operations Manager Intel Corporation, D2 1988  –  2000  (12 years) Languages Spanish Spanish Spanish Skills Semiconductors Intel SPC Manufacturing IC Engineering Management Metrology Product Engineering Business Strategy Operations Management Failure Analysis Supply Chain Management Continuous Improvement Thin Films Silicon CMOS Yield JMP Leadership Executive Management Process Engineering See 7+     See less Skills  Semiconductors Intel SPC Manufacturing IC Engineering Management Metrology Product Engineering Business Strategy Operations Management Failure Analysis Supply Chain Management Continuous Improvement Thin Films Silicon CMOS Yield JMP Leadership Executive Management Process Engineering See 7+     See less Semiconductors Intel SPC Manufacturing IC Engineering Management Metrology Product Engineering Business Strategy Operations Management Failure Analysis Supply Chain Management Continuous Improvement Thin Films Silicon CMOS Yield JMP Leadership Executive Management Process Engineering See 7+     See less Semiconductors Intel SPC Manufacturing IC Engineering Management Metrology Product Engineering Business Strategy Operations Management Failure Analysis Supply Chain Management Continuous Improvement Thin Films Silicon CMOS Yield JMP Leadership Executive Management Process Engineering See 7+     See less Education Stanford Graduate School of Business Executive Business Degree 2012  – 2012 Massachusetts Institute of Technology BS,  Chemical Engineering 1975  – 1979 Wellesley College 1975  – 1976 Stanford Graduate School of Business Executive Business Degree 2012  – 2012 Stanford Graduate School of Business Executive Business Degree 2012  – 2012 Stanford Graduate School of Business Executive Business Degree 2012  – 2012 Massachusetts Institute of Technology BS,  Chemical Engineering 1975  – 1979 Massachusetts Institute of Technology BS,  Chemical Engineering 1975  – 1979 Massachusetts Institute of Technology BS,  Chemical Engineering 1975  – 1979 Wellesley College 1975  – 1976 Wellesley College 1975  – 1976 Wellesley College 1975  – 1976 ", "Experience Director of Operations Intel Corporation November 2014  – Present (10 months) Allentown, Pennsylvania Area * Global Manufacturing Operations for NCSD \n* Comprehensive Supply Chain M&A Experience \n* Strategic consulting on manufacturing strategy \n* New Product Development for Product & Test Engineering  \n* Advising Customesr on Supply Chain NCD Operations GM Avago Technologies March 2014  –  November 2014  (9 months) Allentown, Pennsylvania Area * Manage Global Manufacturing/Operations for Networking Components Division \n* Responsibilities include Assembly, Foundry, Product, & Test Engineering, Supply Chain, & Quality \n* P&L ownership \n* Product Margin ownership \n* Vendor management/contract negotiations \n* Global manufacturing strategy Senior Manager, Global Supply Chain LSI, an Avago Technologies Company June 2012  –  February 2014  (1 year 9 months) Allentown, Pennsylvania Area * Global supply chain management \n* Inventory management \n* Customer service \n* Logistics and import/export laws \n* Turnaround specialist Senior Manager Global Manufacturing LSI Corporation October 2011  –  May 2012  (8 months) Allentown, Pennsylvania Area * Global OEM manufacturing strategy \n* Program Management \n* International experience \n* Business development Senior Test Manager LSI Corporation April 2007  –  October 2011  (4 years 7 months) Allentown, Pennsylvania Area * Managed a global team of engineers supporting hardware and software development through entire product development process from conceptual phase to market introduction and manufacturing. \n* Initiated new process for sampling new products reducing time to market \n* Developed and implemented manufacturing strategies for assimilation of acquired products from corporate acquisitions. \n* Analog mixed signal test engineering Test Manager Agere Systems October 2003  –  April 2007  (3 years 7 months) Allentown, Pennsylvania Area Managed a global test engineering development team Senior Test Engineer Agere Systems January 2002  –  September 2003  (1 year 9 months) Analog Mixed signal test engineer Test Engineer Lucent Technologies January 1998  –  January 2002  (4 years 1 month) Digital test engineer Product Engineer Lucent Technologies January 1997  –  January 1998  (1 year 1 month) Describe your position Electronics Technician Western Electric/AT&T January 1983  –  January 1997  (14 years 1 month) Describe your position Director of Operations Intel Corporation November 2014  – Present (10 months) Allentown, Pennsylvania Area * Global Manufacturing Operations for NCSD \n* Comprehensive Supply Chain M&A Experience \n* Strategic consulting on manufacturing strategy \n* New Product Development for Product & Test Engineering  \n* Advising Customesr on Supply Chain Director of Operations Intel Corporation November 2014  – Present (10 months) Allentown, Pennsylvania Area * Global Manufacturing Operations for NCSD \n* Comprehensive Supply Chain M&A Experience \n* Strategic consulting on manufacturing strategy \n* New Product Development for Product & Test Engineering  \n* Advising Customesr on Supply Chain NCD Operations GM Avago Technologies March 2014  –  November 2014  (9 months) Allentown, Pennsylvania Area * Manage Global Manufacturing/Operations for Networking Components Division \n* Responsibilities include Assembly, Foundry, Product, & Test Engineering, Supply Chain, & Quality \n* P&L ownership \n* Product Margin ownership \n* Vendor management/contract negotiations \n* Global manufacturing strategy NCD Operations GM Avago Technologies March 2014  –  November 2014  (9 months) Allentown, Pennsylvania Area * Manage Global Manufacturing/Operations for Networking Components Division \n* Responsibilities include Assembly, Foundry, Product, & Test Engineering, Supply Chain, & Quality \n* P&L ownership \n* Product Margin ownership \n* Vendor management/contract negotiations \n* Global manufacturing strategy Senior Manager, Global Supply Chain LSI, an Avago Technologies Company June 2012  –  February 2014  (1 year 9 months) Allentown, Pennsylvania Area * Global supply chain management \n* Inventory management \n* Customer service \n* Logistics and import/export laws \n* Turnaround specialist Senior Manager, Global Supply Chain LSI, an Avago Technologies Company June 2012  –  February 2014  (1 year 9 months) Allentown, Pennsylvania Area * Global supply chain management \n* Inventory management \n* Customer service \n* Logistics and import/export laws \n* Turnaround specialist Senior Manager Global Manufacturing LSI Corporation October 2011  –  May 2012  (8 months) Allentown, Pennsylvania Area * Global OEM manufacturing strategy \n* Program Management \n* International experience \n* Business development Senior Manager Global Manufacturing LSI Corporation October 2011  –  May 2012  (8 months) Allentown, Pennsylvania Area * Global OEM manufacturing strategy \n* Program Management \n* International experience \n* Business development Senior Test Manager LSI Corporation April 2007  –  October 2011  (4 years 7 months) Allentown, Pennsylvania Area * Managed a global team of engineers supporting hardware and software development through entire product development process from conceptual phase to market introduction and manufacturing. \n* Initiated new process for sampling new products reducing time to market \n* Developed and implemented manufacturing strategies for assimilation of acquired products from corporate acquisitions. \n* Analog mixed signal test engineering Senior Test Manager LSI Corporation April 2007  –  October 2011  (4 years 7 months) Allentown, Pennsylvania Area * Managed a global team of engineers supporting hardware and software development through entire product development process from conceptual phase to market introduction and manufacturing. \n* Initiated new process for sampling new products reducing time to market \n* Developed and implemented manufacturing strategies for assimilation of acquired products from corporate acquisitions. \n* Analog mixed signal test engineering Test Manager Agere Systems October 2003  –  April 2007  (3 years 7 months) Allentown, Pennsylvania Area Managed a global test engineering development team Test Manager Agere Systems October 2003  –  April 2007  (3 years 7 months) Allentown, Pennsylvania Area Managed a global test engineering development team Senior Test Engineer Agere Systems January 2002  –  September 2003  (1 year 9 months) Analog Mixed signal test engineer Senior Test Engineer Agere Systems January 2002  –  September 2003  (1 year 9 months) Analog Mixed signal test engineer Test Engineer Lucent Technologies January 1998  –  January 2002  (4 years 1 month) Digital test engineer Test Engineer Lucent Technologies January 1998  –  January 2002  (4 years 1 month) Digital test engineer Product Engineer Lucent Technologies January 1997  –  January 1998  (1 year 1 month) Describe your position Product Engineer Lucent Technologies January 1997  –  January 1998  (1 year 1 month) Describe your position Electronics Technician Western Electric/AT&T January 1983  –  January 1997  (14 years 1 month) Describe your position Electronics Technician Western Electric/AT&T January 1983  –  January 1997  (14 years 1 month) Describe your position Skills Global Supply Chain Global Operations Global Management International Logistics Turnaround Management Program Management Engineering Management Strategic Leadership Strategic Planning Corporate Partnership... Multi-Site Operations Tactical Planning Cross-functional Team... Vendor Management Vendor Contracts Customer Service Relationship Management Inventory Management Group Restructuring Project Management Product Development Product Management Testing Business Strategy Supply Chain Management Leadership Semiconductor Industry Supply Chain See 13+     See less Skills  Global Supply Chain Global Operations Global Management International Logistics Turnaround Management Program Management Engineering Management Strategic Leadership Strategic Planning Corporate Partnership... Multi-Site Operations Tactical Planning Cross-functional Team... Vendor Management Vendor Contracts Customer Service Relationship Management Inventory Management Group Restructuring Project Management Product Development Product Management Testing Business Strategy Supply Chain Management Leadership Semiconductor Industry Supply Chain See 13+     See less Global Supply Chain Global Operations Global Management International Logistics Turnaround Management Program Management Engineering Management Strategic Leadership Strategic Planning Corporate Partnership... Multi-Site Operations Tactical Planning Cross-functional Team... Vendor Management Vendor Contracts Customer Service Relationship Management Inventory Management Group Restructuring Project Management Product Development Product Management Testing Business Strategy Supply Chain Management Leadership Semiconductor Industry Supply Chain See 13+     See less Global Supply Chain Global Operations Global Management International Logistics Turnaround Management Program Management Engineering Management Strategic Leadership Strategic Planning Corporate Partnership... Multi-Site Operations Tactical Planning Cross-functional Team... Vendor Management Vendor Contracts Customer Service Relationship Management Inventory Management Group Restructuring Project Management Product Development Product Management Testing Business Strategy Supply Chain Management Leadership Semiconductor Industry Supply Chain See 13+     See less Education Saint Joseph's University - Erivan K. Haub School of Business Executive MBA 2013  – 2014 Moravian College Bachelor of Arts 2003  – 2007 Lincoln Technical Institute Associates 1981  – 1983 Saint Joseph's University - Erivan K. Haub School of Business Executive MBA 2013  – 2014 Saint Joseph's University - Erivan K. Haub School of Business Executive MBA 2013  – 2014 Saint Joseph's University - Erivan K. Haub School of Business Executive MBA 2013  – 2014 Moravian College Bachelor of Arts 2003  – 2007 Moravian College Bachelor of Arts 2003  – 2007 Moravian College Bachelor of Arts 2003  – 2007 Lincoln Technical Institute Associates 1981  – 1983 Lincoln Technical Institute Associates 1981  – 1983 Lincoln Technical Institute Associates 1981  – 1983 ", "Summary 20 years’ hands-on experience in engineering/manufacturing/supply chain/operations creating step-change improvements in performance across a variety of industries including consumer products, semiconductors, software and construction equipment. Deep knowledge and practice of process improvement methodologies including Lean and Six-Sigma. Accomplished leader and builder of strong teams with heavy focus on employee development.  Summary 20 years’ hands-on experience in engineering/manufacturing/supply chain/operations creating step-change improvements in performance across a variety of industries including consumer products, semiconductors, software and construction equipment. Deep knowledge and practice of process improvement methodologies including Lean and Six-Sigma. Accomplished leader and builder of strong teams with heavy focus on employee development.  20 years’ hands-on experience in engineering/manufacturing/supply chain/operations creating step-change improvements in performance across a variety of industries including consumer products, semiconductors, software and construction equipment. Deep knowledge and practice of process improvement methodologies including Lean and Six-Sigma. Accomplished leader and builder of strong teams with heavy focus on employee development.  20 years’ hands-on experience in engineering/manufacturing/supply chain/operations creating step-change improvements in performance across a variety of industries including consumer products, semiconductors, software and construction equipment. Deep knowledge and practice of process improvement methodologies including Lean and Six-Sigma. Accomplished leader and builder of strong teams with heavy focus on employee development.  Experience Chief of Staff and Technical Assistant to VP - Developer Relations Intel Corporation May 2013  – Present (2 years 4 months) Greater Seattle Area Director of Operations Intel Corporation June 2012  – Present (3 years 3 months) Head of Business Operations for the Developer Relations Division in Intel's Software and Services Group. Division spans 40+ countries and runs one of the world's largest software developer programs. Supply Chain Strategic Project Leader Intel Corporation November 2011  –  June 2012  (8 months) Portland, Oregon Area Led team that developed Intel’s strategy addressing customer supply chain issues created by Intel’s move to ultra-thin PC designs; presented proposal to Sales and Marketing SVP and PC Client SVP and received their approval for strategy.  \n \nDeveloped and recommended changes to Global Materials team organizational structure to improve delivery of ultra-thin PC supply chain. Presented recommendations to Global Sourcing VP and obtained approval. \n Product Marketing Manager Intel Corporation April 2011  –  October 2011  (7 months) Provide product marketing support for tablet and netbook products sold through channel customers, including LOEMs and ODMs. Market Analyst Intel Corporation August 2010  –  April 2011  (9 months) Santa Clara, CA Developed market intelligence and supply chain models to forecast end-user consumption of personal computers to feed into Intel demand forecasts. Supply Chain Program Manager - Client Computing Group Intel Corporation February 2009  –  August 2009  (7 months) Santa Clara, CA - Provided strategy recommendations for potential $50M savings project by completing comprehensive study of laptop OEM system configurations and modeling SKU proliferation effects from Intel technology proposals. \n- Developed model of OEM field service operations and utilized supply chain theory to quantify spare part inventory impacts from CPU packaging changes, delivering key input for two Intel Corporate Strategic Discussions. \n- Generated critical data by presenting analysis to four ODM customers at their respective Taiwanese headquarters. Engineering and Maintenance Manager Genie Industries June 2005  –  May 2008  (3 years) - Led, mentored, and developed 93-person team of engineering, maintenance, and tooling professionals. \n- Controlled $3M annual capital budget and oversaw completion of capital projects generating over $2.2M NPV. \n- Utilized lean manufacturing knowledge and project leadership skills to lead cross-functional team to on-time development of new final assembly line resulting in $24M increased annual revenue. \n- Completed multiple kaizen events to streamline Engineering Change process, reducing weekly engineering meeting hours from 60 to 10 and improving throughput by 100%. \n- Implemented preventative maintenance program for nine CNC machining centers that reduced downtime by 47%. \n- Reduced department turnover from 30% to 4% year-year by creating structured on-boarding program, utilizing team-building techniques, and establishing employee goals and regular reviews. Product Manager Imation November 2003  –  June 2005  (1 year 8 months) - Facilitated technical relationship with key OEM customer for product line that generated 25% of company revenue. \n- Implemented raw material change working with manufacturing and customer resulting in $500K annual savings. \n- Earned Six-Sigma Green Belt by interfacing with three manufacturing sites to implement SPC and improve seven major product characteristics to six-sigma capability, decreasing variation on four critical parameters by over 40%. Production Manager Imation 2001  –  2003  (2 years) - Managed 85-person production group to meet productivity, safety, quality, and environmental compliance targets. \n- Instituted comprehensive safety program that reduced annual OSHA recordable incident rate by 63%. Senior Process Engineer Imation 1996  –  2001  (5 years) - Led project team that implemented new manufacturing technology for largest volume product during key growth phase, delivering 8% yield improvement, 45% productivity improvement, and $40M increased revenue. Chief of Staff and Technical Assistant to VP - Developer Relations Intel Corporation May 2013  – Present (2 years 4 months) Greater Seattle Area Chief of Staff and Technical Assistant to VP - Developer Relations Intel Corporation May 2013  – Present (2 years 4 months) Greater Seattle Area Director of Operations Intel Corporation June 2012  – Present (3 years 3 months) Head of Business Operations for the Developer Relations Division in Intel's Software and Services Group. Division spans 40+ countries and runs one of the world's largest software developer programs. Director of Operations Intel Corporation June 2012  – Present (3 years 3 months) Head of Business Operations for the Developer Relations Division in Intel's Software and Services Group. Division spans 40+ countries and runs one of the world's largest software developer programs. Supply Chain Strategic Project Leader Intel Corporation November 2011  –  June 2012  (8 months) Portland, Oregon Area Led team that developed Intel’s strategy addressing customer supply chain issues created by Intel’s move to ultra-thin PC designs; presented proposal to Sales and Marketing SVP and PC Client SVP and received their approval for strategy.  \n \nDeveloped and recommended changes to Global Materials team organizational structure to improve delivery of ultra-thin PC supply chain. Presented recommendations to Global Sourcing VP and obtained approval. \n Supply Chain Strategic Project Leader Intel Corporation November 2011  –  June 2012  (8 months) Portland, Oregon Area Led team that developed Intel’s strategy addressing customer supply chain issues created by Intel’s move to ultra-thin PC designs; presented proposal to Sales and Marketing SVP and PC Client SVP and received their approval for strategy.  \n \nDeveloped and recommended changes to Global Materials team organizational structure to improve delivery of ultra-thin PC supply chain. Presented recommendations to Global Sourcing VP and obtained approval. \n Product Marketing Manager Intel Corporation April 2011  –  October 2011  (7 months) Provide product marketing support for tablet and netbook products sold through channel customers, including LOEMs and ODMs. Product Marketing Manager Intel Corporation April 2011  –  October 2011  (7 months) Provide product marketing support for tablet and netbook products sold through channel customers, including LOEMs and ODMs. Market Analyst Intel Corporation August 2010  –  April 2011  (9 months) Santa Clara, CA Developed market intelligence and supply chain models to forecast end-user consumption of personal computers to feed into Intel demand forecasts. Market Analyst Intel Corporation August 2010  –  April 2011  (9 months) Santa Clara, CA Developed market intelligence and supply chain models to forecast end-user consumption of personal computers to feed into Intel demand forecasts. Supply Chain Program Manager - Client Computing Group Intel Corporation February 2009  –  August 2009  (7 months) Santa Clara, CA - Provided strategy recommendations for potential $50M savings project by completing comprehensive study of laptop OEM system configurations and modeling SKU proliferation effects from Intel technology proposals. \n- Developed model of OEM field service operations and utilized supply chain theory to quantify spare part inventory impacts from CPU packaging changes, delivering key input for two Intel Corporate Strategic Discussions. \n- Generated critical data by presenting analysis to four ODM customers at their respective Taiwanese headquarters. Supply Chain Program Manager - Client Computing Group Intel Corporation February 2009  –  August 2009  (7 months) Santa Clara, CA - Provided strategy recommendations for potential $50M savings project by completing comprehensive study of laptop OEM system configurations and modeling SKU proliferation effects from Intel technology proposals. \n- Developed model of OEM field service operations and utilized supply chain theory to quantify spare part inventory impacts from CPU packaging changes, delivering key input for two Intel Corporate Strategic Discussions. \n- Generated critical data by presenting analysis to four ODM customers at their respective Taiwanese headquarters. Engineering and Maintenance Manager Genie Industries June 2005  –  May 2008  (3 years) - Led, mentored, and developed 93-person team of engineering, maintenance, and tooling professionals. \n- Controlled $3M annual capital budget and oversaw completion of capital projects generating over $2.2M NPV. \n- Utilized lean manufacturing knowledge and project leadership skills to lead cross-functional team to on-time development of new final assembly line resulting in $24M increased annual revenue. \n- Completed multiple kaizen events to streamline Engineering Change process, reducing weekly engineering meeting hours from 60 to 10 and improving throughput by 100%. \n- Implemented preventative maintenance program for nine CNC machining centers that reduced downtime by 47%. \n- Reduced department turnover from 30% to 4% year-year by creating structured on-boarding program, utilizing team-building techniques, and establishing employee goals and regular reviews. Engineering and Maintenance Manager Genie Industries June 2005  –  May 2008  (3 years) - Led, mentored, and developed 93-person team of engineering, maintenance, and tooling professionals. \n- Controlled $3M annual capital budget and oversaw completion of capital projects generating over $2.2M NPV. \n- Utilized lean manufacturing knowledge and project leadership skills to lead cross-functional team to on-time development of new final assembly line resulting in $24M increased annual revenue. \n- Completed multiple kaizen events to streamline Engineering Change process, reducing weekly engineering meeting hours from 60 to 10 and improving throughput by 100%. \n- Implemented preventative maintenance program for nine CNC machining centers that reduced downtime by 47%. \n- Reduced department turnover from 30% to 4% year-year by creating structured on-boarding program, utilizing team-building techniques, and establishing employee goals and regular reviews. Product Manager Imation November 2003  –  June 2005  (1 year 8 months) - Facilitated technical relationship with key OEM customer for product line that generated 25% of company revenue. \n- Implemented raw material change working with manufacturing and customer resulting in $500K annual savings. \n- Earned Six-Sigma Green Belt by interfacing with three manufacturing sites to implement SPC and improve seven major product characteristics to six-sigma capability, decreasing variation on four critical parameters by over 40%. Product Manager Imation November 2003  –  June 2005  (1 year 8 months) - Facilitated technical relationship with key OEM customer for product line that generated 25% of company revenue. \n- Implemented raw material change working with manufacturing and customer resulting in $500K annual savings. \n- Earned Six-Sigma Green Belt by interfacing with three manufacturing sites to implement SPC and improve seven major product characteristics to six-sigma capability, decreasing variation on four critical parameters by over 40%. Production Manager Imation 2001  –  2003  (2 years) - Managed 85-person production group to meet productivity, safety, quality, and environmental compliance targets. \n- Instituted comprehensive safety program that reduced annual OSHA recordable incident rate by 63%. Production Manager Imation 2001  –  2003  (2 years) - Managed 85-person production group to meet productivity, safety, quality, and environmental compliance targets. \n- Instituted comprehensive safety program that reduced annual OSHA recordable incident rate by 63%. Senior Process Engineer Imation 1996  –  2001  (5 years) - Led project team that implemented new manufacturing technology for largest volume product during key growth phase, delivering 8% yield improvement, 45% productivity improvement, and $40M increased revenue. Senior Process Engineer Imation 1996  –  2001  (5 years) - Led project team that implemented new manufacturing technology for largest volume product during key growth phase, delivering 8% yield improvement, 45% productivity improvement, and $40M increased revenue. Skills Supply Chain Management Continuous Improvement Operations Management Leadership Cross-functional Team... Lean Manufacturing Six Sigma Product Development Product Management Manufacturing Engineering Management Process Improvement Program Management Supply Chain Engineering SPC Product Marketing Management Process Engineering Manufacturing... Strategic Sourcing Kaizen Manufacturing Operations Operational Excellence Root Cause Analysis Manufacturing... FMEA 5S Value Stream Mapping Strategy DMAIC Analysis Team Building Design of Experiments Quality System Product Lifecycle... Semiconductors Design for Manufacturing Process Simulation R&D Failure Analysis Kanban Supply Management Industrial Engineering Quality Management See 30+     See less Skills  Supply Chain Management Continuous Improvement Operations Management Leadership Cross-functional Team... Lean Manufacturing Six Sigma Product Development Product Management Manufacturing Engineering Management Process Improvement Program Management Supply Chain Engineering SPC Product Marketing Management Process Engineering Manufacturing... Strategic Sourcing Kaizen Manufacturing Operations Operational Excellence Root Cause Analysis Manufacturing... FMEA 5S Value Stream Mapping Strategy DMAIC Analysis Team Building Design of Experiments Quality System Product Lifecycle... Semiconductors Design for Manufacturing Process Simulation R&D Failure Analysis Kanban Supply Management Industrial Engineering Quality Management See 30+     See less Supply Chain Management Continuous Improvement Operations Management Leadership Cross-functional Team... Lean Manufacturing Six Sigma Product Development Product Management Manufacturing Engineering Management Process Improvement Program Management Supply Chain Engineering SPC Product Marketing Management Process Engineering Manufacturing... Strategic Sourcing Kaizen Manufacturing Operations Operational Excellence Root Cause Analysis Manufacturing... FMEA 5S Value Stream Mapping Strategy DMAIC Analysis Team Building Design of Experiments Quality System Product Lifecycle... Semiconductors Design for Manufacturing Process Simulation R&D Failure Analysis Kanban Supply Management Industrial Engineering Quality Management See 30+     See less Supply Chain Management Continuous Improvement Operations Management Leadership Cross-functional Team... Lean Manufacturing Six Sigma Product Development Product Management Manufacturing Engineering Management Process Improvement Program Management Supply Chain Engineering SPC Product Marketing Management Process Engineering Manufacturing... Strategic Sourcing Kaizen Manufacturing Operations Operational Excellence Root Cause Analysis Manufacturing... FMEA 5S Value Stream Mapping Strategy DMAIC Analysis Team Building Design of Experiments Quality System Product Lifecycle... Semiconductors Design for Manufacturing Process Simulation R&D Failure Analysis Kanban Supply Management Industrial Engineering Quality Management See 30+     See less Education Massachusetts Institute of Technology MS,  Mechanical Engineering 2008  – 2010 Massachusetts Institute of Technology - Sloan School of Management MBA 2008  – 2010 1st Place Carnegie Mellon International Operations Case Competition 2008 \nTeaching Assistant for 15.280 - Communication for Managers Activities and Societies:  Operations Management Club ,  Sloan Toastmasters Club North Dakota State University BS,  Mechanical Engineering September 1991  – May 1996 Activities and Societies:  Toastmasters International ,  Society of Professional Engineers Massachusetts Institute of Technology MS,  Mechanical Engineering 2008  – 2010 Massachusetts Institute of Technology MS,  Mechanical Engineering 2008  – 2010 Massachusetts Institute of Technology MS,  Mechanical Engineering 2008  – 2010 Massachusetts Institute of Technology - Sloan School of Management MBA 2008  – 2010 1st Place Carnegie Mellon International Operations Case Competition 2008 \nTeaching Assistant for 15.280 - Communication for Managers Activities and Societies:  Operations Management Club ,  Sloan Toastmasters Club Massachusetts Institute of Technology - Sloan School of Management MBA 2008  – 2010 1st Place Carnegie Mellon International Operations Case Competition 2008 \nTeaching Assistant for 15.280 - Communication for Managers Activities and Societies:  Operations Management Club ,  Sloan Toastmasters Club Massachusetts Institute of Technology - Sloan School of Management MBA 2008  – 2010 1st Place Carnegie Mellon International Operations Case Competition 2008 \nTeaching Assistant for 15.280 - Communication for Managers Activities and Societies:  Operations Management Club ,  Sloan Toastmasters Club North Dakota State University BS,  Mechanical Engineering September 1991  – May 1996 Activities and Societies:  Toastmasters International ,  Society of Professional Engineers North Dakota State University BS,  Mechanical Engineering September 1991  – May 1996 Activities and Societies:  Toastmasters International ,  Society of Professional Engineers North Dakota State University BS,  Mechanical Engineering September 1991  – May 1996 Activities and Societies:  Toastmasters International ,  Society of Professional Engineers ", "Summary A rich career of engineering, operations management, business ownership and supply chain management. Summary A rich career of engineering, operations management, business ownership and supply chain management. A rich career of engineering, operations management, business ownership and supply chain management. A rich career of engineering, operations management, business ownership and supply chain management. Experience Program Manager Carestream Health September 2012  – Present (3 years) Medford, Oregon Area Program management for Carestream Advanced Materials, developing new touch screen technology.  \n \nPrevious roles: Lead ISO auditor. Commodity Manager, MRO. \nSupplier Performance Manager. Supply Chain Manager Suterra February 2009  –  May 2011  (2 years 4 months) Bend, Oregon Enhanced, improved and managed a responsive and cost effective global supply chain from end to end, including Logistics, Warehousing, contracted (3PL) Warehousing, Procurement, and Site Facilities - for small private organic pest control agriculture company. Owner, Manager Cartridge World December 2006  –  June 2009  (2 years 7 months) Tualatin, Oregon Ramped a startup franchise business to profitability in less than one year. Managed all aspects of the business, including staffing, accounting, purchasing, inventory, ink and laser manufacturing processes, direct sales, advertising, merchandising, community networking, and trade shows. Director of Operations Intel Corporation January 1990  –  July 2006  (16 years 7 months) Hillsboro, Oregon Director of Operations (1996-2006) – Leader of global retail microprocessor packaging operations, including internal 120 employee Hillsboro operation, and contracted manufacturers in The Netherlands, Malaysia and China. Scaled the operations up to process 25% of all Intel CPU’s, representing $6B in annual sales. Inspired, developed, and managed all functional aspects, including Production, Mfg. Engineering, Production Planning, Procurement, Maintenance, Project Management, Systems, Quality and matrixed support resources.  \n \nOperations Manager (1994-1996) – Enabled and qualified the outsourcing of all retail kitting operations to contractors located in Ireland, Puerto Rico, Malaysia, The Netherlands, and Northwest US. Assigned to managed the microprocessor kitting operations in Oregon and The Netherlands, along with the support team of procurement, planning and engineering professionals during high growth period. Later improved security control and saved $1M by returning the Oregon processor kitting operations back internally.  \n \nManufacturing Engineering Manager (1993-1994) – Optimized processes/capabilities for assembling consumer packaged products, software duplication, and other contractor packaged product assembly. Provided training and support during 4 month assignment in Dublin, Ireland. Developed DFM standards. \n \nPackaging Engineer (1990-1993) - Designed, tested, documented, qualified suppliers, and enabled manufacturing processes for a wide variety of high tech OEM and consumer packaged goods products. Assessed and qualified all material and print vendors in Oregon, Puerto Rico and Ireland. Led Intel compliance to international environmental legislation. Established the packaging materials commodity for global cost optimization. Manufacturing Manager Dataproducts October 1980  –  December 1989  (9 years 3 months) Woodland Hills, California Dataproducts was an OEM manufacturer of high speed printers, later acquired by Hitachi. Responsible for staff of engineers, new product introductions, engineering changes, process improvements, capital investments, maintenance, machine shop, and supplier quality/tooling. Initially hired as a Packaging Engineer designing product packaging and its integration in manufacturing processes. Program Manager Carestream Health September 2012  – Present (3 years) Medford, Oregon Area Program management for Carestream Advanced Materials, developing new touch screen technology.  \n \nPrevious roles: Lead ISO auditor. Commodity Manager, MRO. \nSupplier Performance Manager. Program Manager Carestream Health September 2012  – Present (3 years) Medford, Oregon Area Program management for Carestream Advanced Materials, developing new touch screen technology.  \n \nPrevious roles: Lead ISO auditor. Commodity Manager, MRO. \nSupplier Performance Manager. Supply Chain Manager Suterra February 2009  –  May 2011  (2 years 4 months) Bend, Oregon Enhanced, improved and managed a responsive and cost effective global supply chain from end to end, including Logistics, Warehousing, contracted (3PL) Warehousing, Procurement, and Site Facilities - for small private organic pest control agriculture company. Supply Chain Manager Suterra February 2009  –  May 2011  (2 years 4 months) Bend, Oregon Enhanced, improved and managed a responsive and cost effective global supply chain from end to end, including Logistics, Warehousing, contracted (3PL) Warehousing, Procurement, and Site Facilities - for small private organic pest control agriculture company. Owner, Manager Cartridge World December 2006  –  June 2009  (2 years 7 months) Tualatin, Oregon Ramped a startup franchise business to profitability in less than one year. Managed all aspects of the business, including staffing, accounting, purchasing, inventory, ink and laser manufacturing processes, direct sales, advertising, merchandising, community networking, and trade shows. Owner, Manager Cartridge World December 2006  –  June 2009  (2 years 7 months) Tualatin, Oregon Ramped a startup franchise business to profitability in less than one year. Managed all aspects of the business, including staffing, accounting, purchasing, inventory, ink and laser manufacturing processes, direct sales, advertising, merchandising, community networking, and trade shows. Director of Operations Intel Corporation January 1990  –  July 2006  (16 years 7 months) Hillsboro, Oregon Director of Operations (1996-2006) – Leader of global retail microprocessor packaging operations, including internal 120 employee Hillsboro operation, and contracted manufacturers in The Netherlands, Malaysia and China. Scaled the operations up to process 25% of all Intel CPU’s, representing $6B in annual sales. Inspired, developed, and managed all functional aspects, including Production, Mfg. Engineering, Production Planning, Procurement, Maintenance, Project Management, Systems, Quality and matrixed support resources.  \n \nOperations Manager (1994-1996) – Enabled and qualified the outsourcing of all retail kitting operations to contractors located in Ireland, Puerto Rico, Malaysia, The Netherlands, and Northwest US. Assigned to managed the microprocessor kitting operations in Oregon and The Netherlands, along with the support team of procurement, planning and engineering professionals during high growth period. Later improved security control and saved $1M by returning the Oregon processor kitting operations back internally.  \n \nManufacturing Engineering Manager (1993-1994) – Optimized processes/capabilities for assembling consumer packaged products, software duplication, and other contractor packaged product assembly. Provided training and support during 4 month assignment in Dublin, Ireland. Developed DFM standards. \n \nPackaging Engineer (1990-1993) - Designed, tested, documented, qualified suppliers, and enabled manufacturing processes for a wide variety of high tech OEM and consumer packaged goods products. Assessed and qualified all material and print vendors in Oregon, Puerto Rico and Ireland. Led Intel compliance to international environmental legislation. Established the packaging materials commodity for global cost optimization. Director of Operations Intel Corporation January 1990  –  July 2006  (16 years 7 months) Hillsboro, Oregon Director of Operations (1996-2006) – Leader of global retail microprocessor packaging operations, including internal 120 employee Hillsboro operation, and contracted manufacturers in The Netherlands, Malaysia and China. Scaled the operations up to process 25% of all Intel CPU’s, representing $6B in annual sales. Inspired, developed, and managed all functional aspects, including Production, Mfg. Engineering, Production Planning, Procurement, Maintenance, Project Management, Systems, Quality and matrixed support resources.  \n \nOperations Manager (1994-1996) – Enabled and qualified the outsourcing of all retail kitting operations to contractors located in Ireland, Puerto Rico, Malaysia, The Netherlands, and Northwest US. Assigned to managed the microprocessor kitting operations in Oregon and The Netherlands, along with the support team of procurement, planning and engineering professionals during high growth period. Later improved security control and saved $1M by returning the Oregon processor kitting operations back internally.  \n \nManufacturing Engineering Manager (1993-1994) – Optimized processes/capabilities for assembling consumer packaged products, software duplication, and other contractor packaged product assembly. Provided training and support during 4 month assignment in Dublin, Ireland. Developed DFM standards. \n \nPackaging Engineer (1990-1993) - Designed, tested, documented, qualified suppliers, and enabled manufacturing processes for a wide variety of high tech OEM and consumer packaged goods products. Assessed and qualified all material and print vendors in Oregon, Puerto Rico and Ireland. Led Intel compliance to international environmental legislation. Established the packaging materials commodity for global cost optimization. Manufacturing Manager Dataproducts October 1980  –  December 1989  (9 years 3 months) Woodland Hills, California Dataproducts was an OEM manufacturer of high speed printers, later acquired by Hitachi. Responsible for staff of engineers, new product introductions, engineering changes, process improvements, capital investments, maintenance, machine shop, and supplier quality/tooling. Initially hired as a Packaging Engineer designing product packaging and its integration in manufacturing processes. Manufacturing Manager Dataproducts October 1980  –  December 1989  (9 years 3 months) Woodland Hills, California Dataproducts was an OEM manufacturer of high speed printers, later acquired by Hitachi. Responsible for staff of engineers, new product introductions, engineering changes, process improvements, capital investments, maintenance, machine shop, and supplier quality/tooling. Initially hired as a Packaging Engineer designing product packaging and its integration in manufacturing processes. Skills Lean Manufacturing Warehousing 5S Continuous Improvement Logistics Supply Chain Engineering Inventory Management Start-ups Manufacturing Profitability Plant Retail Budgeting Operations Management Customer Service Production Product Development Contract Negotiation Strategic Planning MRP Supplier Management Packaging Team Building P&L Problem Solving Franchising Freight Negotiation Supply Chain Management Inventory Control Outsourcing Production Planning Purchasing Procurement Materials Manufacturing Management Logistics Management Materials Management 3PL Supply Chain... Supply Management ISO 13485 See 28+     See less Skills  Lean Manufacturing Warehousing 5S Continuous Improvement Logistics Supply Chain Engineering Inventory Management Start-ups Manufacturing Profitability Plant Retail Budgeting Operations Management Customer Service Production Product Development Contract Negotiation Strategic Planning MRP Supplier Management Packaging Team Building P&L Problem Solving Franchising Freight Negotiation Supply Chain Management Inventory Control Outsourcing Production Planning Purchasing Procurement Materials Manufacturing Management Logistics Management Materials Management 3PL Supply Chain... Supply Management ISO 13485 See 28+     See less Lean Manufacturing Warehousing 5S Continuous Improvement Logistics Supply Chain Engineering Inventory Management Start-ups Manufacturing Profitability Plant Retail Budgeting Operations Management Customer Service Production Product Development Contract Negotiation Strategic Planning MRP Supplier Management Packaging Team Building P&L Problem Solving Franchising Freight Negotiation Supply Chain Management Inventory Control Outsourcing Production Planning Purchasing Procurement Materials Manufacturing Management Logistics Management Materials Management 3PL Supply Chain... Supply Management ISO 13485 See 28+     See less Lean Manufacturing Warehousing 5S Continuous Improvement Logistics Supply Chain Engineering Inventory Management Start-ups Manufacturing Profitability Plant Retail Budgeting Operations Management Customer Service Production Product Development Contract Negotiation Strategic Planning MRP Supplier Management Packaging Team Building P&L Problem Solving Franchising Freight Negotiation Supply Chain Management Inventory Control Outsourcing Production Planning Purchasing Procurement Materials Manufacturing Management Logistics Management Materials Management 3PL Supply Chain... Supply Management ISO 13485 See 28+     See less Education Loyola Marymount University, College of Business Administration MBA,  International Business 1984  – 1989 Activities and Societies:  Intl. business study in South & Southeast Asia Michigan State University BS,  Packaging Engineering 1976  – 1980 Loyola Marymount University, College of Business Administration MBA,  International Business 1984  – 1989 Activities and Societies:  Intl. business study in South & Southeast Asia Loyola Marymount University, College of Business Administration MBA,  International Business 1984  – 1989 Activities and Societies:  Intl. business study in South & Southeast Asia Loyola Marymount University, College of Business Administration MBA,  International Business 1984  – 1989 Activities and Societies:  Intl. business study in South & Southeast Asia Michigan State University BS,  Packaging Engineering 1976  – 1980 Michigan State University BS,  Packaging Engineering 1976  – 1980 Michigan State University BS,  Packaging Engineering 1976  – 1980 ", "Summary Results driven, high energy operations, business development and marketing entrepreneur with over 30 years of international and domestic high-tech experience in both large corporations and small business. Key skills include multinational organizational optimization, strategic planning, excellent written and oral communications, and the ability to think outside the box. \n \nSpecialties: Business Operations, Strategic Alliances, Joint Ventures, Software Licenses, Channel Partners Summary Results driven, high energy operations, business development and marketing entrepreneur with over 30 years of international and domestic high-tech experience in both large corporations and small business. Key skills include multinational organizational optimization, strategic planning, excellent written and oral communications, and the ability to think outside the box. \n \nSpecialties: Business Operations, Strategic Alliances, Joint Ventures, Software Licenses, Channel Partners Results driven, high energy operations, business development and marketing entrepreneur with over 30 years of international and domestic high-tech experience in both large corporations and small business. Key skills include multinational organizational optimization, strategic planning, excellent written and oral communications, and the ability to think outside the box. \n \nSpecialties: Business Operations, Strategic Alliances, Joint Ventures, Software Licenses, Channel Partners Results driven, high energy operations, business development and marketing entrepreneur with over 30 years of international and domestic high-tech experience in both large corporations and small business. Key skills include multinational organizational optimization, strategic planning, excellent written and oral communications, and the ability to think outside the box. \n \nSpecialties: Business Operations, Strategic Alliances, Joint Ventures, Software Licenses, Channel Partners Experience Director of Operations Intel Corporation, Mobile & Communications Group July 2013  – Present (2 years 2 months) Hillsboro, OR / Santa Clara, CA MCG's products include chip sets, platform software and form factor reference devices for Tablets and Smartphones. Software Engineering Program Manager Intel Corporation, Mobile & Communications Group April 2009  –  June 2013  (4 years 3 months) Hillsboro, OR Smartphone platform software development Strategic Business Development Intel - New Business Initiatives August 2007  –  October 2009  (2 years 3 months) NBI is an Intel internal incubator for start-up business units. \n• Led sales & sales-ops for a fiber optic InfiniBand Cable start-up business (ICC) focused on the High Performance Computing market segment; successfully launched new product line, achieved design wins at multiple major OEMs, and exceeded sales targets. \n• Established new distribution channel; negotiated terms with multiple world-wide distributors.  \n• Created start-up business plans for presentation to internal and external (VC) funding sources. Strategic Planning & Operations Manager Intel - Software & Solutions Group 1997  –  August 2007  (10 years) • Directed annual 5 year software product line plans and annual business plans for Intel’s 3,000 people, six division software group; resulatant plans presented to Intel CEO.  \n• Designed and implemented SSG business decision-making process; redefined SSG’s Software Product Life Cycle. Chaired the weekly decision meetings for SSG Staff.  \n• Intel owner for a $250M joint marketing program with a key OEM customer: created joint business plans, set up world-wide joint sales training, planned/tracked budget and ran quarterly senior executive reviews. CEO / Founder Vancouver Mortgage Co 1992  –  1997  (5 years) Dir OEM Sales Europe Sequent Computer Systems 1990  –  1991  (1 year) Dir Business Development BiiN Partners - an Intel / Siemens JV 1984  –  1989  (5 years) President Micro Systems Design International, Inc. 1982  –  1984  (2 years) Director of Operations Intel Corporation, Mobile & Communications Group July 2013  – Present (2 years 2 months) Hillsboro, OR / Santa Clara, CA MCG's products include chip sets, platform software and form factor reference devices for Tablets and Smartphones. Director of Operations Intel Corporation, Mobile & Communications Group July 2013  – Present (2 years 2 months) Hillsboro, OR / Santa Clara, CA MCG's products include chip sets, platform software and form factor reference devices for Tablets and Smartphones. Software Engineering Program Manager Intel Corporation, Mobile & Communications Group April 2009  –  June 2013  (4 years 3 months) Hillsboro, OR Smartphone platform software development Software Engineering Program Manager Intel Corporation, Mobile & Communications Group April 2009  –  June 2013  (4 years 3 months) Hillsboro, OR Smartphone platform software development Strategic Business Development Intel - New Business Initiatives August 2007  –  October 2009  (2 years 3 months) NBI is an Intel internal incubator for start-up business units. \n• Led sales & sales-ops for a fiber optic InfiniBand Cable start-up business (ICC) focused on the High Performance Computing market segment; successfully launched new product line, achieved design wins at multiple major OEMs, and exceeded sales targets. \n• Established new distribution channel; negotiated terms with multiple world-wide distributors.  \n• Created start-up business plans for presentation to internal and external (VC) funding sources. Strategic Business Development Intel - New Business Initiatives August 2007  –  October 2009  (2 years 3 months) NBI is an Intel internal incubator for start-up business units. \n• Led sales & sales-ops for a fiber optic InfiniBand Cable start-up business (ICC) focused on the High Performance Computing market segment; successfully launched new product line, achieved design wins at multiple major OEMs, and exceeded sales targets. \n• Established new distribution channel; negotiated terms with multiple world-wide distributors.  \n• Created start-up business plans for presentation to internal and external (VC) funding sources. Strategic Planning & Operations Manager Intel - Software & Solutions Group 1997  –  August 2007  (10 years) • Directed annual 5 year software product line plans and annual business plans for Intel’s 3,000 people, six division software group; resulatant plans presented to Intel CEO.  \n• Designed and implemented SSG business decision-making process; redefined SSG’s Software Product Life Cycle. Chaired the weekly decision meetings for SSG Staff.  \n• Intel owner for a $250M joint marketing program with a key OEM customer: created joint business plans, set up world-wide joint sales training, planned/tracked budget and ran quarterly senior executive reviews. Strategic Planning & Operations Manager Intel - Software & Solutions Group 1997  –  August 2007  (10 years) • Directed annual 5 year software product line plans and annual business plans for Intel’s 3,000 people, six division software group; resulatant plans presented to Intel CEO.  \n• Designed and implemented SSG business decision-making process; redefined SSG’s Software Product Life Cycle. Chaired the weekly decision meetings for SSG Staff.  \n• Intel owner for a $250M joint marketing program with a key OEM customer: created joint business plans, set up world-wide joint sales training, planned/tracked budget and ran quarterly senior executive reviews. CEO / Founder Vancouver Mortgage Co 1992  –  1997  (5 years) CEO / Founder Vancouver Mortgage Co 1992  –  1997  (5 years) Dir OEM Sales Europe Sequent Computer Systems 1990  –  1991  (1 year) Dir OEM Sales Europe Sequent Computer Systems 1990  –  1991  (1 year) Dir Business Development BiiN Partners - an Intel / Siemens JV 1984  –  1989  (5 years) Dir Business Development BiiN Partners - an Intel / Siemens JV 1984  –  1989  (5 years) President Micro Systems Design International, Inc. 1982  –  1984  (2 years) President Micro Systems Design International, Inc. 1982  –  1984  (2 years) Languages German German German Skills Start-ups Business Development Entrepreneurship Product Development CRM Business Planning Strategic Planning Analytics Marketing Channel Partners Sales Negotiation Skills  Start-ups Business Development Entrepreneurship Product Development CRM Business Planning Strategic Planning Analytics Marketing Channel Partners Sales Negotiation Start-ups Business Development Entrepreneurship Product Development CRM Business Planning Strategic Planning Analytics Marketing Channel Partners Sales Negotiation Start-ups Business Development Entrepreneurship Product Development CRM Business Planning Strategic Planning Analytics Marketing Channel Partners Sales Negotiation Education University of Cincinnati BSAsE University of Cincinnati BSAsE University of Cincinnati BSAsE University of Cincinnati BSAsE Honors & Awards ", "Experience Director-Operations Intel Corporation Director-Operations Intel Corporation Director-Operations Intel Corporation Skills SPC Cross-functional Team... Manufacturing Supply Chain Management Lean Manufacturing Operations Management Process Engineering Six Sigma Program Management Process Improvement Product Management Supply Chain Skills  SPC Cross-functional Team... Manufacturing Supply Chain Management Lean Manufacturing Operations Management Process Engineering Six Sigma Program Management Process Improvement Product Management Supply Chain SPC Cross-functional Team... Manufacturing Supply Chain Management Lean Manufacturing Operations Management Process Engineering Six Sigma Program Management Process Improvement Product Management Supply Chain SPC Cross-functional Team... Manufacturing Supply Chain Management Lean Manufacturing Operations Management Process Engineering Six Sigma Program Management Process Improvement Product Management Supply Chain "]}