{"position": "Engineering Technician", "company": "Intel Corporation", "profiles": ["Experience Engineering Technician Intel Corporation Engineering Technician EMCO High Voltage Corporation February 2002  –  June 2005  (3 years 5 months) Engineering Technician Intel Corporation Engineering Technician Intel Corporation Engineering Technician EMCO High Voltage Corporation February 2002  –  June 2005  (3 years 5 months) Engineering Technician EMCO High Voltage Corporation February 2002  –  June 2005  (3 years 5 months) Languages Russian Russian Russian Skills Analog Embedded Systems Failure Analysis Semiconductors Debugging IC Semiconductor Industry Electronics Skills  Analog Embedded Systems Failure Analysis Semiconductors Debugging IC Semiconductor Industry Electronics Analog Embedded Systems Failure Analysis Semiconductors Debugging IC Semiconductor Industry Electronics Analog Embedded Systems Failure Analysis Semiconductors Debugging IC Semiconductor Industry Electronics ", "Summary Over seven years experience with Server HW Validation. \nFour years experience with corporate printer, network card testing. Attention to detail, reliable, documentation, training of new employees with lab infrastructure and methods. \n \nSpecialties: \nPlatform/QA/HW/System Validation, Operating systems(Windows, Linux, VMware), networking, Virtualization, device drivers, troubleshooting, software setup, CPU and system architecture. \n \nEnjoy learning new technology/skills, and always desire to daily be a valuable asset to company I work for. Summary Over seven years experience with Server HW Validation. \nFour years experience with corporate printer, network card testing. Attention to detail, reliable, documentation, training of new employees with lab infrastructure and methods. \n \nSpecialties: \nPlatform/QA/HW/System Validation, Operating systems(Windows, Linux, VMware), networking, Virtualization, device drivers, troubleshooting, software setup, CPU and system architecture. \n \nEnjoy learning new technology/skills, and always desire to daily be a valuable asset to company I work for. Over seven years experience with Server HW Validation. \nFour years experience with corporate printer, network card testing. Attention to detail, reliable, documentation, training of new employees with lab infrastructure and methods. \n \nSpecialties: \nPlatform/QA/HW/System Validation, Operating systems(Windows, Linux, VMware), networking, Virtualization, device drivers, troubleshooting, software setup, CPU and system architecture. \n \nEnjoy learning new technology/skills, and always desire to daily be a valuable asset to company I work for. Over seven years experience with Server HW Validation. \nFour years experience with corporate printer, network card testing. Attention to detail, reliable, documentation, training of new employees with lab infrastructure and methods. \n \nSpecialties: \nPlatform/QA/HW/System Validation, Operating systems(Windows, Linux, VMware), networking, Virtualization, device drivers, troubleshooting, software setup, CPU and system architecture. \n \nEnjoy learning new technology/skills, and always desire to daily be a valuable asset to company I work for. Skills Servers Validation Windows Server Linux Troubleshooting Debugging Training Unix VMware ESX VMware Infrastructure FW DHCP DNS Electronics Computer Hardware VMware VMware Server Intel Storage EMC compliance ClearQuest Networking Teamwork Processors Firmware Semiconductors Testing Emissions Testing Immunity Testing CISPR BSMI VCCI See 15+     See less Skills  Servers Validation Windows Server Linux Troubleshooting Debugging Training Unix VMware ESX VMware Infrastructure FW DHCP DNS Electronics Computer Hardware VMware VMware Server Intel Storage EMC compliance ClearQuest Networking Teamwork Processors Firmware Semiconductors Testing Emissions Testing Immunity Testing CISPR BSMI VCCI See 15+     See less Servers Validation Windows Server Linux Troubleshooting Debugging Training Unix VMware ESX VMware Infrastructure FW DHCP DNS Electronics Computer Hardware VMware VMware Server Intel Storage EMC compliance ClearQuest Networking Teamwork Processors Firmware Semiconductors Testing Emissions Testing Immunity Testing CISPR BSMI VCCI See 15+     See less Servers Validation Windows Server Linux Troubleshooting Debugging Training Unix VMware ESX VMware Infrastructure FW DHCP DNS Electronics Computer Hardware VMware VMware Server Intel Storage EMC compliance ClearQuest Networking Teamwork Processors Firmware Semiconductors Testing Emissions Testing Immunity Testing CISPR BSMI VCCI See 15+     See less ", "Experience Engineering Technician Intel Corporation November 1997  – Present (17 years 10 months) Electronics Technician UtilX Corporation 1996  –  1997  (1 year) Electronics Technician GEC Marconi Avionics 1995  –  1995  (less than a year) Aircraft Electrician The Boeing Company 1988  –  1990  (2 years) Electronics Technician Proctor & Associates 1988  –  1988  (less than a year) Navigational Aids Technician US Air Force 1984  –  1988  (4 years) Engineering Technician Intel Corporation November 1997  – Present (17 years 10 months) Engineering Technician Intel Corporation November 1997  – Present (17 years 10 months) Electronics Technician UtilX Corporation 1996  –  1997  (1 year) Electronics Technician UtilX Corporation 1996  –  1997  (1 year) Electronics Technician GEC Marconi Avionics 1995  –  1995  (less than a year) Electronics Technician GEC Marconi Avionics 1995  –  1995  (less than a year) Aircraft Electrician The Boeing Company 1988  –  1990  (2 years) Aircraft Electrician The Boeing Company 1988  –  1990  (2 years) Electronics Technician Proctor & Associates 1988  –  1988  (less than a year) Electronics Technician Proctor & Associates 1988  –  1988  (less than a year) Navigational Aids Technician US Air Force 1984  –  1988  (4 years) Navigational Aids Technician US Air Force 1984  –  1988  (4 years) Skills Debugging Analog Test Equipment Semiconductors IC Skills  Debugging Analog Test Equipment Semiconductors IC Debugging Analog Test Equipment Semiconductors IC Debugging Analog Test Equipment Semiconductors IC Education The Evergreen State College Bachelor of Science (B.S.) 2001 South Puget Sound Community College Associate of Arts (A.A.),  Natural science 1992  – 1994 South Puget Sound Community College Associate of Technical Arts,  Electronics Technology 1990  – 1992 Community College of the Air Force Electronics Technology , Navigational Aids 1984  – 1988 Columbia Basin College Auto Mechanics 1982  – 1983 Pasco High School 1979  – 1982 The Evergreen State College Bachelor of Science (B.S.) 2001 The Evergreen State College Bachelor of Science (B.S.) 2001 The Evergreen State College Bachelor of Science (B.S.) 2001 South Puget Sound Community College Associate of Arts (A.A.),  Natural science 1992  – 1994 South Puget Sound Community College Associate of Arts (A.A.),  Natural science 1992  – 1994 South Puget Sound Community College Associate of Arts (A.A.),  Natural science 1992  – 1994 South Puget Sound Community College Associate of Technical Arts,  Electronics Technology 1990  – 1992 South Puget Sound Community College Associate of Technical Arts,  Electronics Technology 1990  – 1992 South Puget Sound Community College Associate of Technical Arts,  Electronics Technology 1990  – 1992 Community College of the Air Force Electronics Technology , Navigational Aids 1984  – 1988 Community College of the Air Force Electronics Technology , Navigational Aids 1984  – 1988 Community College of the Air Force Electronics Technology , Navigational Aids 1984  – 1988 Columbia Basin College Auto Mechanics 1982  – 1983 Columbia Basin College Auto Mechanics 1982  – 1983 Columbia Basin College Auto Mechanics 1982  – 1983 Pasco High School 1979  – 1982 Pasco High School 1979  – 1982 Pasco High School 1979  – 1982 ", "Summary Highly proficient in troubleshooting equipment faults, installing, maintaining, and upgrading systems. \n \nDriven to be the best at what I do,always looking for opportunities to develop my skills through focus on learning, performance, and goal achievement.Excellent communication and leadership skills. Summary Highly proficient in troubleshooting equipment faults, installing, maintaining, and upgrading systems. \n \nDriven to be the best at what I do,always looking for opportunities to develop my skills through focus on learning, performance, and goal achievement.Excellent communication and leadership skills. Highly proficient in troubleshooting equipment faults, installing, maintaining, and upgrading systems. \n \nDriven to be the best at what I do,always looking for opportunities to develop my skills through focus on learning, performance, and goal achievement.Excellent communication and leadership skills. Highly proficient in troubleshooting equipment faults, installing, maintaining, and upgrading systems. \n \nDriven to be the best at what I do,always looking for opportunities to develop my skills through focus on learning, performance, and goal achievement.Excellent communication and leadership skills. Experience Engineering Technician Intel Corporation December 2013  – Present (1 year 9 months) israel Tool expert at implant area. \nEquipment corrective and preventive maintenance, troubleshooting of complex equipment issues. Engineering Technician Micron Technology August 2010  –  November 2013  (3 years 4 months) Clean room equipment maintenance \n \nImplant area Engineering Technician Numonyx April 2008  –  April 2010  (2 years 1 month) Clean room equipment maintenance \n \nImplant area Engineering Technician Intel Corporation September 2005  –  April 2008  (2 years 8 months) Clean room equipment maintenance \n \nWet etch area Engineering Technician Intel Corporation December 2013  – Present (1 year 9 months) israel Tool expert at implant area. \nEquipment corrective and preventive maintenance, troubleshooting of complex equipment issues. Engineering Technician Intel Corporation December 2013  – Present (1 year 9 months) israel Tool expert at implant area. \nEquipment corrective and preventive maintenance, troubleshooting of complex equipment issues. Engineering Technician Micron Technology August 2010  –  November 2013  (3 years 4 months) Clean room equipment maintenance \n \nImplant area Engineering Technician Micron Technology August 2010  –  November 2013  (3 years 4 months) Clean room equipment maintenance \n \nImplant area Engineering Technician Numonyx April 2008  –  April 2010  (2 years 1 month) Clean room equipment maintenance \n \nImplant area Engineering Technician Numonyx April 2008  –  April 2010  (2 years 1 month) Clean room equipment maintenance \n \nImplant area Engineering Technician Intel Corporation September 2005  –  April 2008  (2 years 8 months) Clean room equipment maintenance \n \nWet etch area Engineering Technician Intel Corporation September 2005  –  April 2008  (2 years 8 months) Clean room equipment maintenance \n \nWet etch area Languages Russian Native or bilingual proficiency English Full professional proficiency Hebrew Native or bilingual proficiency Russian Native or bilingual proficiency English Full professional proficiency Hebrew Native or bilingual proficiency Russian Native or bilingual proficiency English Full professional proficiency Hebrew Native or bilingual proficiency Native or bilingual proficiency Full professional proficiency Native or bilingual proficiency Skills Ion Implantation Wet Chemical Etching Equipment Maintenance Failure Analysis EEW4B Semiconductors Semiconductor Industry Metrology SPC Electronics Test Equipment Lean Manufacturing Lean Thinking Manufacturing Skills  Ion Implantation Wet Chemical Etching Equipment Maintenance Failure Analysis EEW4B Semiconductors Semiconductor Industry Metrology SPC Electronics Test Equipment Lean Manufacturing Lean Thinking Manufacturing Ion Implantation Wet Chemical Etching Equipment Maintenance Failure Analysis EEW4B Semiconductors Semiconductor Industry Metrology SPC Electronics Test Equipment Lean Manufacturing Lean Thinking Manufacturing Ion Implantation Wet Chemical Etching Equipment Maintenance Failure Analysis EEW4B Semiconductors Semiconductor Industry Metrology SPC Electronics Test Equipment Lean Manufacturing Lean Thinking Manufacturing Education SCE college Bachelor of Science (B.Sc.),  Electrical and Electronics Engineering 2012  – 2016 Beer sheva technological college practical engineer,  Electrical , Electronic and Communications Engineering Technology/Technician 2006  – 2009 SCE college Bachelor of Science (B.Sc.),  Electrical and Electronics Engineering 2012  – 2016 SCE college Bachelor of Science (B.Sc.),  Electrical and Electronics Engineering 2012  – 2016 SCE college Bachelor of Science (B.Sc.),  Electrical and Electronics Engineering 2012  – 2016 Beer sheva technological college practical engineer,  Electrical , Electronic and Communications Engineering Technology/Technician 2006  – 2009 Beer sheva technological college practical engineer,  Electrical , Electronic and Communications Engineering Technology/Technician 2006  – 2009 Beer sheva technological college practical engineer,  Electrical , Electronic and Communications Engineering Technology/Technician 2006  – 2009 ", "Experience Engineering Technician Intel Corporation February 2012  – Present (3 years 7 months) Manufacturing Specialist Intel Corporation August 2008  –  February 2011  (2 years 7 months) Hudson, MA Manufacturing Specialist(TEMP) Intel Corporation June 2006  –  June 2008  (2 years 1 month) Hudson, MA Engineering Technician Intel Corporation February 2012  – Present (3 years 7 months) Engineering Technician Intel Corporation February 2012  – Present (3 years 7 months) Manufacturing Specialist Intel Corporation August 2008  –  February 2011  (2 years 7 months) Hudson, MA Manufacturing Specialist Intel Corporation August 2008  –  February 2011  (2 years 7 months) Hudson, MA Manufacturing Specialist(TEMP) Intel Corporation June 2006  –  June 2008  (2 years 1 month) Hudson, MA Manufacturing Specialist(TEMP) Intel Corporation June 2006  –  June 2008  (2 years 1 month) Hudson, MA Languages Twi Native or bilingual proficiency English Native or bilingual proficiency Twi Native or bilingual proficiency English Native or bilingual proficiency Twi Native or bilingual proficiency English Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Electro-mechanical... Cross-functional Team... Testing Semiconductors Validation Product Development Engineering Troubleshooting Manufacturing Web Development Computer Repair Hardware Installation IT Hardware Support Maintenance & Repair Lean Manufacturing Team Leadership Strategic Planning Employee Training Electro-mechanical... Six Sigma SPC See 6+     See less Skills  Electro-mechanical... Cross-functional Team... Testing Semiconductors Validation Product Development Engineering Troubleshooting Manufacturing Web Development Computer Repair Hardware Installation IT Hardware Support Maintenance & Repair Lean Manufacturing Team Leadership Strategic Planning Employee Training Electro-mechanical... Six Sigma SPC See 6+     See less Electro-mechanical... Cross-functional Team... Testing Semiconductors Validation Product Development Engineering Troubleshooting Manufacturing Web Development Computer Repair Hardware Installation IT Hardware Support Maintenance & Repair Lean Manufacturing Team Leadership Strategic Planning Employee Training Electro-mechanical... Six Sigma SPC See 6+     See less Electro-mechanical... Cross-functional Team... Testing Semiconductors Validation Product Development Engineering Troubleshooting Manufacturing Web Development Computer Repair Hardware Installation IT Hardware Support Maintenance & Repair Lean Manufacturing Team Leadership Strategic Planning Employee Training Electro-mechanical... Six Sigma SPC See 6+     See less Education Quinsigamond Community College Associate of Arts and Sciences (AAS),  Electromechanical Engineering 2013  – 2015 State University of New York at Delhi Bachelor of Applied Science (B.A.Sc.),  Network and System Administration/Administrator 2004  – 2006 State University of New York at Delhi Associate of Arts and Sciences (A.A.S.),  Computer and Information Systems 2001  – 2004 Quinsigamond Community College Associate of Arts and Sciences (AAS),  Electromechanical Engineering 2013  – 2015 Quinsigamond Community College Associate of Arts and Sciences (AAS),  Electromechanical Engineering 2013  – 2015 Quinsigamond Community College Associate of Arts and Sciences (AAS),  Electromechanical Engineering 2013  – 2015 State University of New York at Delhi Bachelor of Applied Science (B.A.Sc.),  Network and System Administration/Administrator 2004  – 2006 State University of New York at Delhi Bachelor of Applied Science (B.A.Sc.),  Network and System Administration/Administrator 2004  – 2006 State University of New York at Delhi Bachelor of Applied Science (B.A.Sc.),  Network and System Administration/Administrator 2004  – 2006 State University of New York at Delhi Associate of Arts and Sciences (A.A.S.),  Computer and Information Systems 2001  – 2004 State University of New York at Delhi Associate of Arts and Sciences (A.A.S.),  Computer and Information Systems 2001  – 2004 State University of New York at Delhi Associate of Arts and Sciences (A.A.S.),  Computer and Information Systems 2001  – 2004 ", "Summary Engineering technician with 17 years of experience in semiconductor industry, responsible to execute specific lab experiments and validations of high end semiconductor products, also owner of equipment installation, maintenance and platform sustaining. Summary Engineering technician with 17 years of experience in semiconductor industry, responsible to execute specific lab experiments and validations of high end semiconductor products, also owner of equipment installation, maintenance and platform sustaining. Engineering technician with 17 years of experience in semiconductor industry, responsible to execute specific lab experiments and validations of high end semiconductor products, also owner of equipment installation, maintenance and platform sustaining. Engineering technician with 17 years of experience in semiconductor industry, responsible to execute specific lab experiments and validations of high end semiconductor products, also owner of equipment installation, maintenance and platform sustaining. Experience Engineering Technician Intel Corporation January 2015  – Present (8 months) Costa Rica Perform validation experiments on high end products of semiconductor industry.  \nInstallation of new equipment, documentation, training and platform improvement. \nMaintenance and advanced troubleshooting in lab equipment. Maintenance Technician Intel Corporation May 1998  –  December 2014  (16 years 8 months) Costa Rica Electronics Maintenance Technician with 16 years of experience in semiconductor industry as technical coordinator and senior instructor. Demonstrated leadership in structured problem solving, early analysis, advanced documentation, short and long term solution implementation and preventive maintenance. International skills in installation and validation of manufacturing equipment and systems. Excellent administrative skills, communication, teamwork, and results orientation. \nTechnical Trainer Level 2, 3 and Technical Team coordinator. Engineering Technician Intel Corporation January 2015  – Present (8 months) Costa Rica Perform validation experiments on high end products of semiconductor industry.  \nInstallation of new equipment, documentation, training and platform improvement. \nMaintenance and advanced troubleshooting in lab equipment. Engineering Technician Intel Corporation January 2015  – Present (8 months) Costa Rica Perform validation experiments on high end products of semiconductor industry.  \nInstallation of new equipment, documentation, training and platform improvement. \nMaintenance and advanced troubleshooting in lab equipment. Maintenance Technician Intel Corporation May 1998  –  December 2014  (16 years 8 months) Costa Rica Electronics Maintenance Technician with 16 years of experience in semiconductor industry as technical coordinator and senior instructor. Demonstrated leadership in structured problem solving, early analysis, advanced documentation, short and long term solution implementation and preventive maintenance. International skills in installation and validation of manufacturing equipment and systems. Excellent administrative skills, communication, teamwork, and results orientation. \nTechnical Trainer Level 2, 3 and Technical Team coordinator. Maintenance Technician Intel Corporation May 1998  –  December 2014  (16 years 8 months) Costa Rica Electronics Maintenance Technician with 16 years of experience in semiconductor industry as technical coordinator and senior instructor. Demonstrated leadership in structured problem solving, early analysis, advanced documentation, short and long term solution implementation and preventive maintenance. International skills in installation and validation of manufacturing equipment and systems. Excellent administrative skills, communication, teamwork, and results orientation. \nTechnical Trainer Level 2, 3 and Technical Team coordinator. Languages Spanish English Spanish English Spanish English Skills Test Equipment Equipment Maintenance Preventive Maintenance Electronics Metrology Intel Semiconductors Semiconductor Industry Failure Analysis Manufacturing Infrared Thermal Imaging Model Based... Testing Skills  Test Equipment Equipment Maintenance Preventive Maintenance Electronics Metrology Intel Semiconductors Semiconductor Industry Failure Analysis Manufacturing Infrared Thermal Imaging Model Based... Testing Test Equipment Equipment Maintenance Preventive Maintenance Electronics Metrology Intel Semiconductors Semiconductor Industry Failure Analysis Manufacturing Infrared Thermal Imaging Model Based... Testing Test Equipment Equipment Maintenance Preventive Maintenance Electronics Metrology Intel Semiconductors Semiconductor Industry Failure Analysis Manufacturing Infrared Thermal Imaging Model Based... Testing Education Colegio Tecnico Profesional Industrial San Sebastian Technician degree,  Industrial Electronics Technology/Technician 1995  – 1997 San Sebastian Professional & Technical College Technician Degree,  Industrial Electronics Technology/Technician 1995  – 1997 Colegio Tecnico Profesional Industrial San Sebastian Technician degree,  Industrial Electronics Technology/Technician 1995  – 1997 Colegio Tecnico Profesional Industrial San Sebastian Technician degree,  Industrial Electronics Technology/Technician 1995  – 1997 Colegio Tecnico Profesional Industrial San Sebastian Technician degree,  Industrial Electronics Technology/Technician 1995  – 1997 San Sebastian Professional & Technical College Technician Degree,  Industrial Electronics Technology/Technician 1995  – 1997 San Sebastian Professional & Technical College Technician Degree,  Industrial Electronics Technology/Technician 1995  – 1997 San Sebastian Professional & Technical College Technician Degree,  Industrial Electronics Technology/Technician 1995  – 1997 ", "Summary I have over 17 years in the semiconductor industry. I have experience in Fab construction, Fab facilities, equipment maintenance, equipment install, develop procedures for maintaining equipment, facilities repair and scheduling.  \n \nI have expertise in data analysis and design of experiments within a LEAN environment in high volume production.  \n \nI have over 35 years experience in automotive repair. \n \nI am experienced with multicultural interaction and the ability to adapt to the ongoing situations as they arise.  \n \nSpecialties:  \nCopper Plating \nDESMEAR operations \nDNS Aqua Spin SS3300 \nTEL - Cleantrack - ACT, Lithius, Lithius i, and BARC \nSVG Micrascan II, II+, and III \nRudolph Technologies AutoEL III and IV, FEIII, FEIV, and FEVII. \nFacilities maintenance, Ultra Pure water generation, tool installation, and preventative maintenance programs.. \n \n Summary I have over 17 years in the semiconductor industry. I have experience in Fab construction, Fab facilities, equipment maintenance, equipment install, develop procedures for maintaining equipment, facilities repair and scheduling.  \n \nI have expertise in data analysis and design of experiments within a LEAN environment in high volume production.  \n \nI have over 35 years experience in automotive repair. \n \nI am experienced with multicultural interaction and the ability to adapt to the ongoing situations as they arise.  \n \nSpecialties:  \nCopper Plating \nDESMEAR operations \nDNS Aqua Spin SS3300 \nTEL - Cleantrack - ACT, Lithius, Lithius i, and BARC \nSVG Micrascan II, II+, and III \nRudolph Technologies AutoEL III and IV, FEIII, FEIV, and FEVII. \nFacilities maintenance, Ultra Pure water generation, tool installation, and preventative maintenance programs.. \n \n I have over 17 years in the semiconductor industry. I have experience in Fab construction, Fab facilities, equipment maintenance, equipment install, develop procedures for maintaining equipment, facilities repair and scheduling.  \n \nI have expertise in data analysis and design of experiments within a LEAN environment in high volume production.  \n \nI have over 35 years experience in automotive repair. \n \nI am experienced with multicultural interaction and the ability to adapt to the ongoing situations as they arise.  \n \nSpecialties:  \nCopper Plating \nDESMEAR operations \nDNS Aqua Spin SS3300 \nTEL - Cleantrack - ACT, Lithius, Lithius i, and BARC \nSVG Micrascan II, II+, and III \nRudolph Technologies AutoEL III and IV, FEIII, FEIV, and FEVII. \nFacilities maintenance, Ultra Pure water generation, tool installation, and preventative maintenance programs.. \n \n I have over 17 years in the semiconductor industry. I have experience in Fab construction, Fab facilities, equipment maintenance, equipment install, develop procedures for maintaining equipment, facilities repair and scheduling.  \n \nI have expertise in data analysis and design of experiments within a LEAN environment in high volume production.  \n \nI have over 35 years experience in automotive repair. \n \nI am experienced with multicultural interaction and the ability to adapt to the ongoing situations as they arise.  \n \nSpecialties:  \nCopper Plating \nDESMEAR operations \nDNS Aqua Spin SS3300 \nTEL - Cleantrack - ACT, Lithius, Lithius i, and BARC \nSVG Micrascan II, II+, and III \nRudolph Technologies AutoEL III and IV, FEIII, FEIV, and FEVII. \nFacilities maintenance, Ultra Pure water generation, tool installation, and preventative maintenance programs.. \n \n Experience Engineering Technician Intel Corporation April 2014  – Present (1 year 5 months) Chandler, AZ Develop and work with Process Engineering on Copper Plating (Electric and Electroless Plating) and DESMEAR operations \nUtilize Lean Manufacturing principles to improve efficiency in PM timing and product through put. \nWork closely with Engineering with Design of Experiments and assist with analyzing data. \nMentor technicians on all shifts. \nWrite and update SPEC Procedures to ensure accuracy and clarity for technicians to follow. \n Maintenance Tech Intel Corporation March 2011  –  April 2014  (3 years 2 months) Rio Rancho, NM Maintanance and repair of precision DNS Aqua SS3300 wet etch equipment in a high volume manufacturing facility. \n \nReview of SPC data and other wafer mapping technologies to determine and resolve issues with equipment failures. \n \nPerform scheduled preventative maintenance to ensure tool accuracy and repeatability between other similar units. \n \nDesign of experiments to enhance LEAN practices and high success rate for PMs and tool availability. Field Service Engineer 2010\tTokyo Electron Ltd September 2010  –  August 2011  (1 year) Install modifications, field change notices, and upgrades to TEL Clean Track systems at Intel in Rio Rancho NM. Experience includes SLAM, ACT, BARC, and Lithius toolsets.  \nInstall upgrades, modifications, and Field Change Notices from the factory for Clean Track systems. \nDevelop Best Known Method (BKM) for modifications and upgrades that were previously written in Japanese. \nAssist with the installation of Clean Track units including; placement, leveling and assembly. \nEnsure toolsets conform to set standards set forth by the customer. \nTrain new hires on equipment modifications, upgrades, and field change notices. \n \nFacilities Engineering/Emergency Response 2005 - 2010 Microelectronics Technician/Emergency Response University of New Mexico June 2005  –  June 2010  (5 years 1 month) Albuquerque, New Mexico Area Maintained, repaired, and calibrated semiconductor and facility equipment in a clean room environment including; Acid Scrubbed and General Exhaust, Deionized Water, Acid Waste Neutralization, Chemical; Nikon Optistation, Process Gas Tanks and Trane Chiller. \nDeveloped and implemented written procedures for regular preventive maintenance on lab equipment.  \nDeveloped and implemented preventive maintenance procedures for emergency response equipment including self contained breathing apparatus (SCBA), safety showers, AED, fire extinguishers, CPR kits, and first aid kits. \nDeveloped, implemented, and analyzed SPC tracking charts for all lab equipment and facilities. \nInstalled semiconductor equipment, including metal evaporator, chemical wet bench, Verteq spin rinse driers, Rudolph Ellipsometer, Rudolph AutoEL, and Nikon wafer inspection station.  \nTrained and certified in OSHA 30, OSHA 40, HAZWOPER, First Aid and CPR/AED. \nTrained students and industry personnel on use of lab equipment. \nSaved the department over $12,000 by locating resources from different suppliers and eliminating the need for an outside vendor for preventative maintenance on facility equipment. Customer Service/Maintenance Engineer ASML September 2000  –  February 2005  (4 years 6 months) Rio Rancho, NM Repaired and maintained 40 Micrascan Lithography units, 10 Cymer Lasers, 10 Staubli Robots, and 40 Semifab environmental control units at Intel in Rio Rancho New Mexico. \n \nSaved ASML $.5 million in outstanding purchase orders by locating missing parts and purchase orders resulting in proper billing. \nFacilitated training of 12 team members on 2 shifts on ASML customer service database and six on lithography applications. Mentored group of six staff members on preventive maintenance and data calculations.  \nActively worked with application engineer to successfully reduce edge die loss by 10% through fine tuning machine from 25um to less than 10um. \nDiagnosed and corrected issues with computer code. Regularly interfaced with customers and maintenance technicians regarding complex problems, applications, and preventive maintenance issues. Senior Field Service Engineer Rudolph Technologies October 1998  –  September 2000  (2 years) Maintained and repaired 3 different Focus Ellipsometer platforms: FEIII, FEIV, and FEVII.  \nTraveled to several customer sites in US, Canada, and France to solve and repair complex issues on thin film metrology units. \nInstalled and aligned lasers, optics, and robotic systems. \nTroubleshot and repaired electronics to the component level in clean room environment. \nTrained customers on new software characteristics, recipe development, SPC implementation and tracking, and general maintenance of equipment. \nAnalyzed data for optimal characterization and uniformity between metrology systems to within 25 angstroms. Equipment Engineer NOVELLUS SYSTEMS INC January 1998  –  July 1998  (7 months) San Jose, CA Maintained and repaired for continuous improvement 3 separate tool sets - Altus, SPEED, and Sequel - for research and development group. \nMaintained and repaired Chemical Vapor Deposition (CVD) systems. \nIdentified and prevented leakage in high vacuum systems using helium checking equipment. \nConsulted with Research and Development on tests for developmental equipment. Engineering Technician Intel Corporation April 2014  – Present (1 year 5 months) Chandler, AZ Develop and work with Process Engineering on Copper Plating (Electric and Electroless Plating) and DESMEAR operations \nUtilize Lean Manufacturing principles to improve efficiency in PM timing and product through put. \nWork closely with Engineering with Design of Experiments and assist with analyzing data. \nMentor technicians on all shifts. \nWrite and update SPEC Procedures to ensure accuracy and clarity for technicians to follow. \n Engineering Technician Intel Corporation April 2014  – Present (1 year 5 months) Chandler, AZ Develop and work with Process Engineering on Copper Plating (Electric and Electroless Plating) and DESMEAR operations \nUtilize Lean Manufacturing principles to improve efficiency in PM timing and product through put. \nWork closely with Engineering with Design of Experiments and assist with analyzing data. \nMentor technicians on all shifts. \nWrite and update SPEC Procedures to ensure accuracy and clarity for technicians to follow. \n Maintenance Tech Intel Corporation March 2011  –  April 2014  (3 years 2 months) Rio Rancho, NM Maintanance and repair of precision DNS Aqua SS3300 wet etch equipment in a high volume manufacturing facility. \n \nReview of SPC data and other wafer mapping technologies to determine and resolve issues with equipment failures. \n \nPerform scheduled preventative maintenance to ensure tool accuracy and repeatability between other similar units. \n \nDesign of experiments to enhance LEAN practices and high success rate for PMs and tool availability. Maintenance Tech Intel Corporation March 2011  –  April 2014  (3 years 2 months) Rio Rancho, NM Maintanance and repair of precision DNS Aqua SS3300 wet etch equipment in a high volume manufacturing facility. \n \nReview of SPC data and other wafer mapping technologies to determine and resolve issues with equipment failures. \n \nPerform scheduled preventative maintenance to ensure tool accuracy and repeatability between other similar units. \n \nDesign of experiments to enhance LEAN practices and high success rate for PMs and tool availability. Field Service Engineer 2010\tTokyo Electron Ltd September 2010  –  August 2011  (1 year) Install modifications, field change notices, and upgrades to TEL Clean Track systems at Intel in Rio Rancho NM. Experience includes SLAM, ACT, BARC, and Lithius toolsets.  \nInstall upgrades, modifications, and Field Change Notices from the factory for Clean Track systems. \nDevelop Best Known Method (BKM) for modifications and upgrades that were previously written in Japanese. \nAssist with the installation of Clean Track units including; placement, leveling and assembly. \nEnsure toolsets conform to set standards set forth by the customer. \nTrain new hires on equipment modifications, upgrades, and field change notices. \n \nFacilities Engineering/Emergency Response 2005 - 2010 Field Service Engineer 2010\tTokyo Electron Ltd September 2010  –  August 2011  (1 year) Install modifications, field change notices, and upgrades to TEL Clean Track systems at Intel in Rio Rancho NM. Experience includes SLAM, ACT, BARC, and Lithius toolsets.  \nInstall upgrades, modifications, and Field Change Notices from the factory for Clean Track systems. \nDevelop Best Known Method (BKM) for modifications and upgrades that were previously written in Japanese. \nAssist with the installation of Clean Track units including; placement, leveling and assembly. \nEnsure toolsets conform to set standards set forth by the customer. \nTrain new hires on equipment modifications, upgrades, and field change notices. \n \nFacilities Engineering/Emergency Response 2005 - 2010 Microelectronics Technician/Emergency Response University of New Mexico June 2005  –  June 2010  (5 years 1 month) Albuquerque, New Mexico Area Maintained, repaired, and calibrated semiconductor and facility equipment in a clean room environment including; Acid Scrubbed and General Exhaust, Deionized Water, Acid Waste Neutralization, Chemical; Nikon Optistation, Process Gas Tanks and Trane Chiller. \nDeveloped and implemented written procedures for regular preventive maintenance on lab equipment.  \nDeveloped and implemented preventive maintenance procedures for emergency response equipment including self contained breathing apparatus (SCBA), safety showers, AED, fire extinguishers, CPR kits, and first aid kits. \nDeveloped, implemented, and analyzed SPC tracking charts for all lab equipment and facilities. \nInstalled semiconductor equipment, including metal evaporator, chemical wet bench, Verteq spin rinse driers, Rudolph Ellipsometer, Rudolph AutoEL, and Nikon wafer inspection station.  \nTrained and certified in OSHA 30, OSHA 40, HAZWOPER, First Aid and CPR/AED. \nTrained students and industry personnel on use of lab equipment. \nSaved the department over $12,000 by locating resources from different suppliers and eliminating the need for an outside vendor for preventative maintenance on facility equipment. Microelectronics Technician/Emergency Response University of New Mexico June 2005  –  June 2010  (5 years 1 month) Albuquerque, New Mexico Area Maintained, repaired, and calibrated semiconductor and facility equipment in a clean room environment including; Acid Scrubbed and General Exhaust, Deionized Water, Acid Waste Neutralization, Chemical; Nikon Optistation, Process Gas Tanks and Trane Chiller. \nDeveloped and implemented written procedures for regular preventive maintenance on lab equipment.  \nDeveloped and implemented preventive maintenance procedures for emergency response equipment including self contained breathing apparatus (SCBA), safety showers, AED, fire extinguishers, CPR kits, and first aid kits. \nDeveloped, implemented, and analyzed SPC tracking charts for all lab equipment and facilities. \nInstalled semiconductor equipment, including metal evaporator, chemical wet bench, Verteq spin rinse driers, Rudolph Ellipsometer, Rudolph AutoEL, and Nikon wafer inspection station.  \nTrained and certified in OSHA 30, OSHA 40, HAZWOPER, First Aid and CPR/AED. \nTrained students and industry personnel on use of lab equipment. \nSaved the department over $12,000 by locating resources from different suppliers and eliminating the need for an outside vendor for preventative maintenance on facility equipment. Customer Service/Maintenance Engineer ASML September 2000  –  February 2005  (4 years 6 months) Rio Rancho, NM Repaired and maintained 40 Micrascan Lithography units, 10 Cymer Lasers, 10 Staubli Robots, and 40 Semifab environmental control units at Intel in Rio Rancho New Mexico. \n \nSaved ASML $.5 million in outstanding purchase orders by locating missing parts and purchase orders resulting in proper billing. \nFacilitated training of 12 team members on 2 shifts on ASML customer service database and six on lithography applications. Mentored group of six staff members on preventive maintenance and data calculations.  \nActively worked with application engineer to successfully reduce edge die loss by 10% through fine tuning machine from 25um to less than 10um. \nDiagnosed and corrected issues with computer code. Regularly interfaced with customers and maintenance technicians regarding complex problems, applications, and preventive maintenance issues. Customer Service/Maintenance Engineer ASML September 2000  –  February 2005  (4 years 6 months) Rio Rancho, NM Repaired and maintained 40 Micrascan Lithography units, 10 Cymer Lasers, 10 Staubli Robots, and 40 Semifab environmental control units at Intel in Rio Rancho New Mexico. \n \nSaved ASML $.5 million in outstanding purchase orders by locating missing parts and purchase orders resulting in proper billing. \nFacilitated training of 12 team members on 2 shifts on ASML customer service database and six on lithography applications. Mentored group of six staff members on preventive maintenance and data calculations.  \nActively worked with application engineer to successfully reduce edge die loss by 10% through fine tuning machine from 25um to less than 10um. \nDiagnosed and corrected issues with computer code. Regularly interfaced with customers and maintenance technicians regarding complex problems, applications, and preventive maintenance issues. Senior Field Service Engineer Rudolph Technologies October 1998  –  September 2000  (2 years) Maintained and repaired 3 different Focus Ellipsometer platforms: FEIII, FEIV, and FEVII.  \nTraveled to several customer sites in US, Canada, and France to solve and repair complex issues on thin film metrology units. \nInstalled and aligned lasers, optics, and robotic systems. \nTroubleshot and repaired electronics to the component level in clean room environment. \nTrained customers on new software characteristics, recipe development, SPC implementation and tracking, and general maintenance of equipment. \nAnalyzed data for optimal characterization and uniformity between metrology systems to within 25 angstroms. Senior Field Service Engineer Rudolph Technologies October 1998  –  September 2000  (2 years) Maintained and repaired 3 different Focus Ellipsometer platforms: FEIII, FEIV, and FEVII.  \nTraveled to several customer sites in US, Canada, and France to solve and repair complex issues on thin film metrology units. \nInstalled and aligned lasers, optics, and robotic systems. \nTroubleshot and repaired electronics to the component level in clean room environment. \nTrained customers on new software characteristics, recipe development, SPC implementation and tracking, and general maintenance of equipment. \nAnalyzed data for optimal characterization and uniformity between metrology systems to within 25 angstroms. Equipment Engineer NOVELLUS SYSTEMS INC January 1998  –  July 1998  (7 months) San Jose, CA Maintained and repaired for continuous improvement 3 separate tool sets - Altus, SPEED, and Sequel - for research and development group. \nMaintained and repaired Chemical Vapor Deposition (CVD) systems. \nIdentified and prevented leakage in high vacuum systems using helium checking equipment. \nConsulted with Research and Development on tests for developmental equipment. Equipment Engineer NOVELLUS SYSTEMS INC January 1998  –  July 1998  (7 months) San Jose, CA Maintained and repaired for continuous improvement 3 separate tool sets - Altus, SPEED, and Sequel - for research and development group. \nMaintained and repaired Chemical Vapor Deposition (CVD) systems. \nIdentified and prevented leakage in high vacuum systems using helium checking equipment. \nConsulted with Research and Development on tests for developmental equipment. Skills Semiconductors Troubleshooting Metrology Electronics Manufacturing Semiconductor Industry SPC Design of Experiments Robotics Preventive Maintenance Research Program Management Lithography Facilities Management Continuous Improvement Project Planning Optics Customer Service Lean Manufacturing CVD Hardware Engineering Training Kepner-Tregoe Microsoft Office Cultural Anthropology Automotive Software Documentation JMP Maintenance & Repair Matlab Six Sigma Nanotechnology Failure Analysis Clean Rooms Electro-mechanical Process Improvement Field Service Characterization Model based problem... Scouting Numismatics Anthropology See 28+     See less Skills  Semiconductors Troubleshooting Metrology Electronics Manufacturing Semiconductor Industry SPC Design of Experiments Robotics Preventive Maintenance Research Program Management Lithography Facilities Management Continuous Improvement Project Planning Optics Customer Service Lean Manufacturing CVD Hardware Engineering Training Kepner-Tregoe Microsoft Office Cultural Anthropology Automotive Software Documentation JMP Maintenance & Repair Matlab Six Sigma Nanotechnology Failure Analysis Clean Rooms Electro-mechanical Process Improvement Field Service Characterization Model based problem... Scouting Numismatics Anthropology See 28+     See less Semiconductors Troubleshooting Metrology Electronics Manufacturing Semiconductor Industry SPC Design of Experiments Robotics Preventive Maintenance Research Program Management Lithography Facilities Management Continuous Improvement Project Planning Optics Customer Service Lean Manufacturing CVD Hardware Engineering Training Kepner-Tregoe Microsoft Office Cultural Anthropology Automotive Software Documentation JMP Maintenance & Repair Matlab Six Sigma Nanotechnology Failure Analysis Clean Rooms Electro-mechanical Process Improvement Field Service Characterization Model based problem... Scouting Numismatics Anthropology See 28+     See less Semiconductors Troubleshooting Metrology Electronics Manufacturing Semiconductor Industry SPC Design of Experiments Robotics Preventive Maintenance Research Program Management Lithography Facilities Management Continuous Improvement Project Planning Optics Customer Service Lean Manufacturing CVD Hardware Engineering Training Kepner-Tregoe Microsoft Office Cultural Anthropology Automotive Software Documentation JMP Maintenance & Repair Matlab Six Sigma Nanotechnology Failure Analysis Clean Rooms Electro-mechanical Process Improvement Field Service Characterization Model based problem... Scouting Numismatics Anthropology See 28+     See less Education Arizona State University Bachelor,  Science Electrical Engineering 1994  – 1997 Holmes County High School high school,  High School/Secondary Diplomas and Certificates 1983  – 1985 Central New Mexico Community College Associate's Degree,  Cultural Anthropology , 4.0 2005 Central New Mexico Community College Certificate,  Heating , Air Conditioning, Ventilation and Refrigeration Maintenance Technology/Technician , 4.0 2005 Arizona State University Bachelor,  Science Electrical Engineering 1994  – 1997 Arizona State University Bachelor,  Science Electrical Engineering 1994  – 1997 Arizona State University Bachelor,  Science Electrical Engineering 1994  – 1997 Holmes County High School high school,  High School/Secondary Diplomas and Certificates 1983  – 1985 Holmes County High School high school,  High School/Secondary Diplomas and Certificates 1983  – 1985 Holmes County High School high school,  High School/Secondary Diplomas and Certificates 1983  – 1985 Central New Mexico Community College Associate's Degree,  Cultural Anthropology , 4.0 2005 Central New Mexico Community College Associate's Degree,  Cultural Anthropology , 4.0 2005 Central New Mexico Community College Associate's Degree,  Cultural Anthropology , 4.0 2005 Central New Mexico Community College Certificate,  Heating , Air Conditioning, Ventilation and Refrigeration Maintenance Technology/Technician , 4.0 2005 Central New Mexico Community College Certificate,  Heating , Air Conditioning, Ventilation and Refrigeration Maintenance Technology/Technician , 4.0 2005 Central New Mexico Community College Certificate,  Heating , Air Conditioning, Ventilation and Refrigeration Maintenance Technology/Technician , 4.0 2005 ", "Experience Engineering Technician Intel Corporation January 2006  – Present (9 years 8 months) Equipment Maintenance Techician Maxim Integrated 1995  –  2001  (6 years) Fab Technician Intel Corporation 1994  –  1995  (1 year) Engineering Technician Intel Corporation January 2006  – Present (9 years 8 months) Engineering Technician Intel Corporation January 2006  – Present (9 years 8 months) Equipment Maintenance Techician Maxim Integrated 1995  –  2001  (6 years) Equipment Maintenance Techician Maxim Integrated 1995  –  2001  (6 years) Fab Technician Intel Corporation 1994  –  1995  (1 year) Fab Technician Intel Corporation 1994  –  1995  (1 year) Skills Semiconductors Debugging Engineering Electronics Semiconductor Industry CMOS JMP Simulations SPC IC Thin Films Design of Experiments Skills  Semiconductors Debugging Engineering Electronics Semiconductor Industry CMOS JMP Simulations SPC IC Thin Films Design of Experiments Semiconductors Debugging Engineering Electronics Semiconductor Industry CMOS JMP Simulations SPC IC Thin Films Design of Experiments Semiconductors Debugging Engineering Electronics Semiconductor Industry CMOS JMP Simulations SPC IC Thin Films Design of Experiments Education Shasta College AA Electronics Shasta College AA Electronics Shasta College AA Electronics Shasta College AA Electronics ", "Experience Engineering Technician Intel Corporation March 2000  – Present (15 years 6 months) DOE execution. Training. First line escalation to equipment issues. Task force participation. Model based problem solving. Ballistic Technician TRW January 1996  –  March 2000  (4 years 3 months) Conduct ballistics testing. Data management. Inventory control. Engineering Technician TRW January 1996  –  March 2000  (4 years 3 months) Prototype development. Design testing. Engineering Technician Intel Corporation March 2000  – Present (15 years 6 months) DOE execution. Training. First line escalation to equipment issues. Task force participation. Model based problem solving. Engineering Technician Intel Corporation March 2000  – Present (15 years 6 months) DOE execution. Training. First line escalation to equipment issues. Task force participation. Model based problem solving. Ballistic Technician TRW January 1996  –  March 2000  (4 years 3 months) Conduct ballistics testing. Data management. Inventory control. Ballistic Technician TRW January 1996  –  March 2000  (4 years 3 months) Conduct ballistics testing. Data management. Inventory control. Engineering Technician TRW January 1996  –  March 2000  (4 years 3 months) Prototype development. Design testing. Engineering Technician TRW January 1996  –  March 2000  (4 years 3 months) Prototype development. Design testing. Languages Spanish Spanish Spanish Skills IC Semiconductors Debugging Analog Semiconductor Industry ASIC SoC Mixed Signal Failure Analysis Embedded Systems Design of Experiments CMOS Electronics Silicon Circuit Design SPC Engineering Manufacturing JMP Lean Manufacturing Metrology See 6+     See less Skills  IC Semiconductors Debugging Analog Semiconductor Industry ASIC SoC Mixed Signal Failure Analysis Embedded Systems Design of Experiments CMOS Electronics Silicon Circuit Design SPC Engineering Manufacturing JMP Lean Manufacturing Metrology See 6+     See less IC Semiconductors Debugging Analog Semiconductor Industry ASIC SoC Mixed Signal Failure Analysis Embedded Systems Design of Experiments CMOS Electronics Silicon Circuit Design SPC Engineering Manufacturing JMP Lean Manufacturing Metrology See 6+     See less IC Semiconductors Debugging Analog Semiconductor Industry ASIC SoC Mixed Signal Failure Analysis Embedded Systems Design of Experiments CMOS Electronics Silicon Circuit Design SPC Engineering Manufacturing JMP Lean Manufacturing Metrology See 6+     See less Education Arizona State University Bachelor’s Degree,  Engineering , 3.91 GPA 2012  – 2015 Focus on Materials Science and Semiconductor Manufacturing, Suma Cum Laude, Deans List Arizona State University Bachelor’s Degree,  Engineering , 3.91 GPA 2012  – 2015 Focus on Materials Science and Semiconductor Manufacturing, Suma Cum Laude, Deans List Arizona State University Bachelor’s Degree,  Engineering , 3.91 GPA 2012  – 2015 Focus on Materials Science and Semiconductor Manufacturing, Suma Cum Laude, Deans List Arizona State University Bachelor’s Degree,  Engineering , 3.91 GPA 2012  – 2015 Focus on Materials Science and Semiconductor Manufacturing, Suma Cum Laude, Deans List ", "Experience Engineering Technician Intel Corporation January 2013  – Present (2 years 8 months) SPTD - Certified at the Backend Operations (Router, Laser Mark, Wet Blaster, Dicing, and Water Clean tools) \n- Peer trainer for these operations \n- L2 certified for the Router Daily/Weekly/Quarterly PMs, Dicing Weekly/Monthly PMs, and Laser Mark Weekly PMs \n- ET support for Laser Mark, Router, Dicing, and Water Clean tools. \n- Create RFCs, BKMs, and Specification updates for the tool in the Backend Operations. Package Designer Intel Corporation September 2004  –  January 2013  (8 years 5 months) ATTD/Design - Developed and maintained HDI/LDI design libraries as senior Librarian; \n- Processed package symbol in both Cadence APD and Mentor Expedition; \n- Completed flip chip substrate layout design in compliance with Intel guidelines; \n- Developed Best Known Methods (BKMs) across multi-disciplines on substrate layout; \n- Generated pertinent collateral document as well interfaced with internal customers and suppliers across multiple disciplines; \n- Designed both Product and Test Vehicles on future generations of Processor package and Chipsets. \n- Utilized many design tools (Cadence APD, Mentor, PLA, FIELD, Design Sync, Pad Designer, ADE/ASA) on package layout. Engineering Technician Intel Corporation November 1996  –  September 2004  (7 years 11 months) ATDQR - Provided analytical support for the Enabling platform area as lead technician in INT-1 and enabled platforms; \n- Performed Competitive Analysis on various packages from outside sources. \n- Performed both destructive and non-destructive failure analysis (x-ray analysis, visual inspection, electrically testing and verifying faults, micro-probing; \n- Performing x-sections, planar grind, lid shear, die shear, DNC milling, SEM, EDX/WDX; \n- Contributed to in the SECc Startup team and trained over 50 technicians from different shifts as well as from different countries; \n- Tool owner for the Calypso Abrasive Jet Cutter (included the tasks of preventative maintenance, fixture development, program development, operation, and training for the system), backup lab owner for the Metallography Lab;  \n- Operations in SMTP and familiar with surface mount technologies;  \n- Completed BKM’s and specs for the LGP (Land Grid Package) platform; \n- Level II vendor trained for Atmos Electrovert oven maintenance and Calypso Abrasive Jet Cutter system. \n- Key contributor for the manufacture and transfer into a high volume environment for the Surface Mount Technology (SMTP) area while supporting virtual factory policies; \n- Certified at Laser Mark, Fuji Chip Shoot / Fuji Pick & Place, Reflow, PSVI, Depanel, and ICT for the SMT line. Manufacturing Specialist Motorola Solutions November 1990  –  November 1996  (6 years 1 month) MOS5 - Performed operation and preventative maintenance on all machines in Gate/Poly cells of Diffusion; \n- Performed equipment set-ups, process monitoring, and troubleshooting as necessary; \n- Interfaced with various equipment technicians, engineers, suppliers, and improvement teams effectively to ensure world class equipment performance; \n- Performed engineering test and data collections on various projects in the wafer fabrication environment. \n- Certified to do maintenance tasks in the Diffusion area of the wafer fab; \n- Member of the MOS 5 Technical Training Program; \n- Passed the T-BATB (Technical Basic Aptitude Test Battery). Engineering Technician Intel Corporation January 2013  – Present (2 years 8 months) SPTD - Certified at the Backend Operations (Router, Laser Mark, Wet Blaster, Dicing, and Water Clean tools) \n- Peer trainer for these operations \n- L2 certified for the Router Daily/Weekly/Quarterly PMs, Dicing Weekly/Monthly PMs, and Laser Mark Weekly PMs \n- ET support for Laser Mark, Router, Dicing, and Water Clean tools. \n- Create RFCs, BKMs, and Specification updates for the tool in the Backend Operations. Engineering Technician Intel Corporation January 2013  – Present (2 years 8 months) SPTD - Certified at the Backend Operations (Router, Laser Mark, Wet Blaster, Dicing, and Water Clean tools) \n- Peer trainer for these operations \n- L2 certified for the Router Daily/Weekly/Quarterly PMs, Dicing Weekly/Monthly PMs, and Laser Mark Weekly PMs \n- ET support for Laser Mark, Router, Dicing, and Water Clean tools. \n- Create RFCs, BKMs, and Specification updates for the tool in the Backend Operations. Package Designer Intel Corporation September 2004  –  January 2013  (8 years 5 months) ATTD/Design - Developed and maintained HDI/LDI design libraries as senior Librarian; \n- Processed package symbol in both Cadence APD and Mentor Expedition; \n- Completed flip chip substrate layout design in compliance with Intel guidelines; \n- Developed Best Known Methods (BKMs) across multi-disciplines on substrate layout; \n- Generated pertinent collateral document as well interfaced with internal customers and suppliers across multiple disciplines; \n- Designed both Product and Test Vehicles on future generations of Processor package and Chipsets. \n- Utilized many design tools (Cadence APD, Mentor, PLA, FIELD, Design Sync, Pad Designer, ADE/ASA) on package layout. Package Designer Intel Corporation September 2004  –  January 2013  (8 years 5 months) ATTD/Design - Developed and maintained HDI/LDI design libraries as senior Librarian; \n- Processed package symbol in both Cadence APD and Mentor Expedition; \n- Completed flip chip substrate layout design in compliance with Intel guidelines; \n- Developed Best Known Methods (BKMs) across multi-disciplines on substrate layout; \n- Generated pertinent collateral document as well interfaced with internal customers and suppliers across multiple disciplines; \n- Designed both Product and Test Vehicles on future generations of Processor package and Chipsets. \n- Utilized many design tools (Cadence APD, Mentor, PLA, FIELD, Design Sync, Pad Designer, ADE/ASA) on package layout. Engineering Technician Intel Corporation November 1996  –  September 2004  (7 years 11 months) ATDQR - Provided analytical support for the Enabling platform area as lead technician in INT-1 and enabled platforms; \n- Performed Competitive Analysis on various packages from outside sources. \n- Performed both destructive and non-destructive failure analysis (x-ray analysis, visual inspection, electrically testing and verifying faults, micro-probing; \n- Performing x-sections, planar grind, lid shear, die shear, DNC milling, SEM, EDX/WDX; \n- Contributed to in the SECc Startup team and trained over 50 technicians from different shifts as well as from different countries; \n- Tool owner for the Calypso Abrasive Jet Cutter (included the tasks of preventative maintenance, fixture development, program development, operation, and training for the system), backup lab owner for the Metallography Lab;  \n- Operations in SMTP and familiar with surface mount technologies;  \n- Completed BKM’s and specs for the LGP (Land Grid Package) platform; \n- Level II vendor trained for Atmos Electrovert oven maintenance and Calypso Abrasive Jet Cutter system. \n- Key contributor for the manufacture and transfer into a high volume environment for the Surface Mount Technology (SMTP) area while supporting virtual factory policies; \n- Certified at Laser Mark, Fuji Chip Shoot / Fuji Pick & Place, Reflow, PSVI, Depanel, and ICT for the SMT line. Engineering Technician Intel Corporation November 1996  –  September 2004  (7 years 11 months) ATDQR - Provided analytical support for the Enabling platform area as lead technician in INT-1 and enabled platforms; \n- Performed Competitive Analysis on various packages from outside sources. \n- Performed both destructive and non-destructive failure analysis (x-ray analysis, visual inspection, electrically testing and verifying faults, micro-probing; \n- Performing x-sections, planar grind, lid shear, die shear, DNC milling, SEM, EDX/WDX; \n- Contributed to in the SECc Startup team and trained over 50 technicians from different shifts as well as from different countries; \n- Tool owner for the Calypso Abrasive Jet Cutter (included the tasks of preventative maintenance, fixture development, program development, operation, and training for the system), backup lab owner for the Metallography Lab;  \n- Operations in SMTP and familiar with surface mount technologies;  \n- Completed BKM’s and specs for the LGP (Land Grid Package) platform; \n- Level II vendor trained for Atmos Electrovert oven maintenance and Calypso Abrasive Jet Cutter system. \n- Key contributor for the manufacture and transfer into a high volume environment for the Surface Mount Technology (SMTP) area while supporting virtual factory policies; \n- Certified at Laser Mark, Fuji Chip Shoot / Fuji Pick & Place, Reflow, PSVI, Depanel, and ICT for the SMT line. Manufacturing Specialist Motorola Solutions November 1990  –  November 1996  (6 years 1 month) MOS5 - Performed operation and preventative maintenance on all machines in Gate/Poly cells of Diffusion; \n- Performed equipment set-ups, process monitoring, and troubleshooting as necessary; \n- Interfaced with various equipment technicians, engineers, suppliers, and improvement teams effectively to ensure world class equipment performance; \n- Performed engineering test and data collections on various projects in the wafer fabrication environment. \n- Certified to do maintenance tasks in the Diffusion area of the wafer fab; \n- Member of the MOS 5 Technical Training Program; \n- Passed the T-BATB (Technical Basic Aptitude Test Battery). Manufacturing Specialist Motorola Solutions November 1990  –  November 1996  (6 years 1 month) MOS5 - Performed operation and preventative maintenance on all machines in Gate/Poly cells of Diffusion; \n- Performed equipment set-ups, process monitoring, and troubleshooting as necessary; \n- Interfaced with various equipment technicians, engineers, suppliers, and improvement teams effectively to ensure world class equipment performance; \n- Performed engineering test and data collections on various projects in the wafer fabrication environment. \n- Certified to do maintenance tasks in the Diffusion area of the wafer fab; \n- Member of the MOS 5 Technical Training Program; \n- Passed the T-BATB (Technical Basic Aptitude Test Battery). Skills Semiconductors Failure Analysis SPC Semiconductor Industry Intel Mask Design Electronics Testing Design of Experiments Silicon Metrology JMP Analog IC Manufacturing Skills  Semiconductors Failure Analysis SPC Semiconductor Industry Intel Mask Design Electronics Testing Design of Experiments Silicon Metrology JMP Analog IC Manufacturing Semiconductors Failure Analysis SPC Semiconductor Industry Intel Mask Design Electronics Testing Design of Experiments Silicon Metrology JMP Analog IC Manufacturing Semiconductors Failure Analysis SPC Semiconductor Industry Intel Mask Design Electronics Testing Design of Experiments Silicon Metrology JMP Analog IC Manufacturing Education Mesa Community College Certificate,  Mask Design , 3.9 1999  – 2001 Mesa Community College Associate of Arts and Sciences (AAS),  Electromechanical Technology/Electromechanical Engineering Technology , 3.85 1995  – 1997 Northern State University Bachelor of Science (BS),  Industrial Technology/Technician , 3.00 1984  – 1989 Mesa Community College Certificate,  Mask Design , 3.9 1999  – 2001 Mesa Community College Certificate,  Mask Design , 3.9 1999  – 2001 Mesa Community College Certificate,  Mask Design , 3.9 1999  – 2001 Mesa Community College Associate of Arts and Sciences (AAS),  Electromechanical Technology/Electromechanical Engineering Technology , 3.85 1995  – 1997 Mesa Community College Associate of Arts and Sciences (AAS),  Electromechanical Technology/Electromechanical Engineering Technology , 3.85 1995  – 1997 Mesa Community College Associate of Arts and Sciences (AAS),  Electromechanical Technology/Electromechanical Engineering Technology , 3.85 1995  – 1997 Northern State University Bachelor of Science (BS),  Industrial Technology/Technician , 3.00 1984  – 1989 Northern State University Bachelor of Science (BS),  Industrial Technology/Technician , 3.00 1984  – 1989 Northern State University Bachelor of Science (BS),  Industrial Technology/Technician , 3.00 1984  – 1989 ", "Experience Engineering Technician Intel Corporation May 2013  – Present (2 years 4 months) Manufacturing Technician Intel Corporation July 2011  –  May 2013  (1 year 11 months) Hillsboro, Oregon Intel Fab Equipment Operator Kelly Services September 2009  –  June 2010  (10 months) I currently operate a variety of equipment used in the manufacturing of microelectronic devices. This includes periodically performing diagnostic tests and troubleshooting minor problems on top of the actual processing of chip-bearing wafers. Engineering Technician Intel Corporation May 2013  – Present (2 years 4 months) Engineering Technician Intel Corporation May 2013  – Present (2 years 4 months) Manufacturing Technician Intel Corporation July 2011  –  May 2013  (1 year 11 months) Hillsboro, Oregon Manufacturing Technician Intel Corporation July 2011  –  May 2013  (1 year 11 months) Hillsboro, Oregon Intel Fab Equipment Operator Kelly Services September 2009  –  June 2010  (10 months) I currently operate a variety of equipment used in the manufacturing of microelectronic devices. This includes periodically performing diagnostic tests and troubleshooting minor problems on top of the actual processing of chip-bearing wafers. Intel Fab Equipment Operator Kelly Services September 2009  –  June 2010  (10 months) I currently operate a variety of equipment used in the manufacturing of microelectronic devices. This includes periodically performing diagnostic tests and troubleshooting minor problems on top of the actual processing of chip-bearing wafers. Languages Spanish Spanish Spanish Skills Troubleshooting Skills  Troubleshooting Troubleshooting Troubleshooting Education Whitworth University BS, BA,  Chemistry ,  Spanish 2005  – 2009 Activities and Societies:  Track and Field ,  ASWC ,  Artists Guild Whitworth University BS, BA,  Chemistry ,  Spanish 2005  – 2009 Activities and Societies:  Track and Field ,  ASWC ,  Artists Guild Whitworth University BS, BA,  Chemistry ,  Spanish 2005  – 2009 Activities and Societies:  Track and Field ,  ASWC ,  Artists Guild Whitworth University BS, BA,  Chemistry ,  Spanish 2005  – 2009 Activities and Societies:  Track and Field ,  ASWC ,  Artists Guild ", "Languages Spanish English Spanish English Spanish English Skills Skills     Honors & Awards ", "Experience Engineering Technician Intel Corporation February 2014  – Present (1 year 7 months) Aloha, Oregon Its been a great experience so far. I could tell ya but then... All I can say is its pretty friggin awesome! MT Intel Corporation April 2011  –  January 2014  (2 years 10 months) Rio Rancho NM Enjoyed every minute of it. Time for a new adventure in Oregon. Maintenance Tech Commercial Kitchen Parts and Service April 2009  –  March 2011  (2 years) Technician Commercial Kitchen Parts and Service 2008  –  2011  (3 years) Technician Applied Materials April 2006  –  April 2009  (3 years 1 month) Engineering Technician Intel Corporation February 2014  – Present (1 year 7 months) Aloha, Oregon Its been a great experience so far. I could tell ya but then... All I can say is its pretty friggin awesome! Engineering Technician Intel Corporation February 2014  – Present (1 year 7 months) Aloha, Oregon Its been a great experience so far. I could tell ya but then... All I can say is its pretty friggin awesome! MT Intel Corporation April 2011  –  January 2014  (2 years 10 months) Rio Rancho NM Enjoyed every minute of it. Time for a new adventure in Oregon. MT Intel Corporation April 2011  –  January 2014  (2 years 10 months) Rio Rancho NM Enjoyed every minute of it. Time for a new adventure in Oregon. Maintenance Tech Commercial Kitchen Parts and Service April 2009  –  March 2011  (2 years) Maintenance Tech Commercial Kitchen Parts and Service April 2009  –  March 2011  (2 years) Technician Commercial Kitchen Parts and Service 2008  –  2011  (3 years) Technician Commercial Kitchen Parts and Service 2008  –  2011  (3 years) Technician Applied Materials April 2006  –  April 2009  (3 years 1 month) Technician Applied Materials April 2006  –  April 2009  (3 years 1 month) Skills Semiconductors CVD Semiconductor Industry Electronics Metrology Failure Analysis Electro-mechanical Test Equipment Design of Experiments Silicon Plasma Etch SPC Thin Films PVD Skills  Semiconductors CVD Semiconductor Industry Electronics Metrology Failure Analysis Electro-mechanical Test Equipment Design of Experiments Silicon Plasma Etch SPC Thin Films PVD Semiconductors CVD Semiconductor Industry Electronics Metrology Failure Analysis Electro-mechanical Test Equipment Design of Experiments Silicon Plasma Etch SPC Thin Films PVD Semiconductors CVD Semiconductor Industry Electronics Metrology Failure Analysis Electro-mechanical Test Equipment Design of Experiments Silicon Plasma Etch SPC Thin Films PVD Education DeVry University Phoenix Associates of Applied Science in Electronics,  Industrial Electronics Technology/Technician 1997  – 1999 DeVry University Phoenix Associates of Applied Science in Electronics,  Industrial Electronics Technology/Technician 1997  – 1999 DeVry University Phoenix Associates of Applied Science in Electronics,  Industrial Electronics Technology/Technician 1997  – 1999 DeVry University Phoenix Associates of Applied Science in Electronics,  Industrial Electronics Technology/Technician 1997  – 1999 ", "Summary To obtain a position that will utilize my extensive knowledge and skill in electronic design test and troubleshooting. A position that will allow me to use my abilities to perform and excel in a team atmosphere. Summary To obtain a position that will utilize my extensive knowledge and skill in electronic design test and troubleshooting. A position that will allow me to use my abilities to perform and excel in a team atmosphere. To obtain a position that will utilize my extensive knowledge and skill in electronic design test and troubleshooting. A position that will allow me to use my abilities to perform and excel in a team atmosphere. To obtain a position that will utilize my extensive knowledge and skill in electronic design test and troubleshooting. A position that will allow me to use my abilities to perform and excel in a team atmosphere. Experience Engineering Technician Intel Corporation October 2010  – Present (4 years 11 months) Hudson, Massachusetts Set up and test validation systems using both manual and automated testing procedures. Debug failures in hardware, software and networking issues. Set up loop connection between equipment test (Tektronix Scope, Power Supply, Data Acquisition/Switch Unit, and Pulse Function Arbitrary Generator) with platform (i.e.: Kahuna, Mayan City, Wisteria Island, Yakima City, Thunder Ridge, SCAD and others). Support FIVR (Fully Integrated Voltage Regulator) team to be done Topside Flex Assembly (construct Flex assemblies with high yield and efficiency). Installing, configuring, and troubleshooting Intel’s Medusa Chillers and/or Thermal controllers. Board rework and upgrade ECOs to latest revision. Validation Tech Intel Corporation August 2008  –  February 2010  (1 year 7 months) Set up and test validation systems using both manual and automated testing procedures. Debug failures in hardware, software and networking issues. Board rework and upgrade ECOs to latest revision. Setup and run base line testing for Windows and Linux. Analyze test results and communicate with Engineers to assist in problem resolution.\tSet up Remote Desktop Service and Network routine via KVM for Windows and Linux. System Administrator for users and groups account set up. Manufacturing Technician Intel Corporation December 2005  –  May 2006  (6 months) hudson, Massachusetts Operated process recipes, wafer sequence, demonstrate when tool out of control, and wafer troubleshooting. Engineering Technician Intel Corporation October 2010  – Present (4 years 11 months) Hudson, Massachusetts Set up and test validation systems using both manual and automated testing procedures. Debug failures in hardware, software and networking issues. Set up loop connection between equipment test (Tektronix Scope, Power Supply, Data Acquisition/Switch Unit, and Pulse Function Arbitrary Generator) with platform (i.e.: Kahuna, Mayan City, Wisteria Island, Yakima City, Thunder Ridge, SCAD and others). Support FIVR (Fully Integrated Voltage Regulator) team to be done Topside Flex Assembly (construct Flex assemblies with high yield and efficiency). Installing, configuring, and troubleshooting Intel’s Medusa Chillers and/or Thermal controllers. Board rework and upgrade ECOs to latest revision. Engineering Technician Intel Corporation October 2010  – Present (4 years 11 months) Hudson, Massachusetts Set up and test validation systems using both manual and automated testing procedures. Debug failures in hardware, software and networking issues. Set up loop connection between equipment test (Tektronix Scope, Power Supply, Data Acquisition/Switch Unit, and Pulse Function Arbitrary Generator) with platform (i.e.: Kahuna, Mayan City, Wisteria Island, Yakima City, Thunder Ridge, SCAD and others). Support FIVR (Fully Integrated Voltage Regulator) team to be done Topside Flex Assembly (construct Flex assemblies with high yield and efficiency). Installing, configuring, and troubleshooting Intel’s Medusa Chillers and/or Thermal controllers. Board rework and upgrade ECOs to latest revision. Validation Tech Intel Corporation August 2008  –  February 2010  (1 year 7 months) Set up and test validation systems using both manual and automated testing procedures. Debug failures in hardware, software and networking issues. Board rework and upgrade ECOs to latest revision. Setup and run base line testing for Windows and Linux. Analyze test results and communicate with Engineers to assist in problem resolution.\tSet up Remote Desktop Service and Network routine via KVM for Windows and Linux. System Administrator for users and groups account set up. Validation Tech Intel Corporation August 2008  –  February 2010  (1 year 7 months) Set up and test validation systems using both manual and automated testing procedures. Debug failures in hardware, software and networking issues. Board rework and upgrade ECOs to latest revision. Setup and run base line testing for Windows and Linux. Analyze test results and communicate with Engineers to assist in problem resolution.\tSet up Remote Desktop Service and Network routine via KVM for Windows and Linux. System Administrator for users and groups account set up. Manufacturing Technician Intel Corporation December 2005  –  May 2006  (6 months) hudson, Massachusetts Operated process recipes, wafer sequence, demonstrate when tool out of control, and wafer troubleshooting. Manufacturing Technician Intel Corporation December 2005  –  May 2006  (6 months) hudson, Massachusetts Operated process recipes, wafer sequence, demonstrate when tool out of control, and wafer troubleshooting. Languages Vietnamese English Vietnamese English Vietnamese English Skills System Testing Hardware Support Networking Electronics Medusa Testing Debugging Engineering Failure Analysis Linux Semiconductors Troubleshooting IC Hardware Test Automation Skills  System Testing Hardware Support Networking Electronics Medusa Testing Debugging Engineering Failure Analysis Linux Semiconductors Troubleshooting IC Hardware Test Automation System Testing Hardware Support Networking Electronics Medusa Testing Debugging Engineering Failure Analysis Linux Semiconductors Troubleshooting IC Hardware Test Automation System Testing Hardware Support Networking Electronics Medusa Testing Debugging Engineering Failure Analysis Linux Semiconductors Troubleshooting IC Hardware Test Automation Education Fitchburg State University Bachelor's degree,  Computer Science 2001  – 2003 Activities and Societies:  Vietnamese Community Organizing Cultural Quinsigamond Community College Associate's degree,  Electrical , Electronic and Communications Engineering Technology/Technician 1998  – 2001 Activities and Societies:  Vietnamese Community in Organizing Cultural Fitchburg State University Bachelor's degree,  Computer Science 2001  – 2003 Activities and Societies:  Vietnamese Community Organizing Cultural Fitchburg State University Bachelor's degree,  Computer Science 2001  – 2003 Activities and Societies:  Vietnamese Community Organizing Cultural Fitchburg State University Bachelor's degree,  Computer Science 2001  – 2003 Activities and Societies:  Vietnamese Community Organizing Cultural Quinsigamond Community College Associate's degree,  Electrical , Electronic and Communications Engineering Technology/Technician 1998  – 2001 Activities and Societies:  Vietnamese Community in Organizing Cultural Quinsigamond Community College Associate's degree,  Electrical , Electronic and Communications Engineering Technology/Technician 1998  – 2001 Activities and Societies:  Vietnamese Community in Organizing Cultural Quinsigamond Community College Associate's degree,  Electrical , Electronic and Communications Engineering Technology/Technician 1998  – 2001 Activities and Societies:  Vietnamese Community in Organizing Cultural ", "Experience Engineering Technician Intel Corporation January 2014  – Present (1 year 8 months) AFO - OTD Thinning Engineering Technician Intel Corporation June 2011  –  January 2014  (2 years 8 months) D1C - Backend Wet Etch Module Technician Intel Corporation January 2010  –  June 2011  (1 year 6 months) D1C - Frontend Wet Etch Self Sustaining Technician / Equipment Technician Intel Corporation March 2002  –  December 2009  (7 years 10 months) Fab 20 - C4 Litho/BLM Engineering Technician Intel Corporation October 2006  –  December 2006  (3 months) Fab 20 - C4 Engineering Technician Intel Corporation January 2014  – Present (1 year 8 months) AFO - OTD Thinning Engineering Technician Intel Corporation January 2014  – Present (1 year 8 months) AFO - OTD Thinning Engineering Technician Intel Corporation June 2011  –  January 2014  (2 years 8 months) D1C - Backend Wet Etch Engineering Technician Intel Corporation June 2011  –  January 2014  (2 years 8 months) D1C - Backend Wet Etch Module Technician Intel Corporation January 2010  –  June 2011  (1 year 6 months) D1C - Frontend Wet Etch Module Technician Intel Corporation January 2010  –  June 2011  (1 year 6 months) D1C - Frontend Wet Etch Self Sustaining Technician / Equipment Technician Intel Corporation March 2002  –  December 2009  (7 years 10 months) Fab 20 - C4 Litho/BLM Self Sustaining Technician / Equipment Technician Intel Corporation March 2002  –  December 2009  (7 years 10 months) Fab 20 - C4 Litho/BLM Engineering Technician Intel Corporation October 2006  –  December 2006  (3 months) Fab 20 - C4 Engineering Technician Intel Corporation October 2006  –  December 2006  (3 months) Fab 20 - C4 Skills Debugging Intel Silicon Metrology Semiconductors Semiconductor Industry Processors Engineering Failure Analysis Analog Electronics IC Microprocessors Oscilloscope Skills  Debugging Intel Silicon Metrology Semiconductors Semiconductor Industry Processors Engineering Failure Analysis Analog Electronics IC Microprocessors Oscilloscope Debugging Intel Silicon Metrology Semiconductors Semiconductor Industry Processors Engineering Failure Analysis Analog Electronics IC Microprocessors Oscilloscope Debugging Intel Silicon Metrology Semiconductors Semiconductor Industry Processors Engineering Failure Analysis Analog Electronics IC Microprocessors Oscilloscope Education University of Devry Associates of Applied Science in Computer and Electronic Technology,  Computer and Electronics , 3.84 2000  – 2002 University of Devry Associates of Applied Science in Computer and Electronic Technology,  Computer and Electronics , 3.84 2000  – 2002 University of Devry Associates of Applied Science in Computer and Electronic Technology,  Computer and Electronics , 3.84 2000  – 2002 University of Devry Associates of Applied Science in Computer and Electronic Technology,  Computer and Electronics , 3.84 2000  – 2002 ", "Experience Engineering Technician Intel Corporation July 2012  – Present (3 years 2 months) Santa clara, US -System Debug, Repair, and Validation, testing and collecting test data \n-Build up the Lab Hosts with Window, Android, and Ubuntu OS \n-Ability to solder and perform rework on surface mount components, including experience with Fine Tech and BGA rework \n-Ability to read and understand schematics, board files, and rework documents \n-Lab in charged for safety and equipments upgrade/repair \n-Experienced with the Thermo Fish Chillers and Intel Medusa Controllers \n-Experienced lab equipments such as Tek Scope and Logic Analyers, Agilent Scopes, handheld meters \n-worke closely with hardware and software engineers to identify board/system failures \n-create system bring up procedures Engineering Technician Intel Corporation February 2007  –  July 2012  (5 years 6 months) Santa Clara, US -System Repair, Debug, and software/ Firmware upgrade \n-Built and Config IT systems on Window, Android, and Ubuntu Operation Systems \n-Board components/wire reworks \n-Experienced motherboard schematics and board files \n-Experienced rework software tools such as DediProg, Cadence Allegro \n-Shipping and Receiving \n-Customer demo and training on new products Engineering Technician Intel Corporation July 2012  – Present (3 years 2 months) Santa clara, US -System Debug, Repair, and Validation, testing and collecting test data \n-Build up the Lab Hosts with Window, Android, and Ubuntu OS \n-Ability to solder and perform rework on surface mount components, including experience with Fine Tech and BGA rework \n-Ability to read and understand schematics, board files, and rework documents \n-Lab in charged for safety and equipments upgrade/repair \n-Experienced with the Thermo Fish Chillers and Intel Medusa Controllers \n-Experienced lab equipments such as Tek Scope and Logic Analyers, Agilent Scopes, handheld meters \n-worke closely with hardware and software engineers to identify board/system failures \n-create system bring up procedures Engineering Technician Intel Corporation July 2012  – Present (3 years 2 months) Santa clara, US -System Debug, Repair, and Validation, testing and collecting test data \n-Build up the Lab Hosts with Window, Android, and Ubuntu OS \n-Ability to solder and perform rework on surface mount components, including experience with Fine Tech and BGA rework \n-Ability to read and understand schematics, board files, and rework documents \n-Lab in charged for safety and equipments upgrade/repair \n-Experienced with the Thermo Fish Chillers and Intel Medusa Controllers \n-Experienced lab equipments such as Tek Scope and Logic Analyers, Agilent Scopes, handheld meters \n-worke closely with hardware and software engineers to identify board/system failures \n-create system bring up procedures Engineering Technician Intel Corporation February 2007  –  July 2012  (5 years 6 months) Santa Clara, US -System Repair, Debug, and software/ Firmware upgrade \n-Built and Config IT systems on Window, Android, and Ubuntu Operation Systems \n-Board components/wire reworks \n-Experienced motherboard schematics and board files \n-Experienced rework software tools such as DediProg, Cadence Allegro \n-Shipping and Receiving \n-Customer demo and training on new products Engineering Technician Intel Corporation February 2007  –  July 2012  (5 years 6 months) Santa Clara, US -System Repair, Debug, and software/ Firmware upgrade \n-Built and Config IT systems on Window, Android, and Ubuntu Operation Systems \n-Board components/wire reworks \n-Experienced motherboard schematics and board files \n-Experienced rework software tools such as DediProg, Cadence Allegro \n-Shipping and Receiving \n-Customer demo and training on new products Education San Joaquin Delta College Associate’s Degree,  Electrical/Electronics Maintenance and Repair Technology 2009  – 2011 California State University, Fresno Bachelor's Degree,  Electrical and Electronics Engineering •\tMinored in Mathematic \n San Joaquin Delta College Associate’s Degree,  Electrical/Electronics Maintenance and Repair Technology 2009  – 2011 San Joaquin Delta College Associate’s Degree,  Electrical/Electronics Maintenance and Repair Technology 2009  – 2011 San Joaquin Delta College Associate’s Degree,  Electrical/Electronics Maintenance and Repair Technology 2009  – 2011 California State University, Fresno Bachelor's Degree,  Electrical and Electronics Engineering •\tMinored in Mathematic \n California State University, Fresno Bachelor's Degree,  Electrical and Electronics Engineering •\tMinored in Mathematic \n California State University, Fresno Bachelor's Degree,  Electrical and Electronics Engineering •\tMinored in Mathematic \n ", "Experience Engineering Technician Intel Corporation January 2015  – Present (8 months) Portland, Oregon Area Responsible for functions in support of computing hardware for design engineering in Intel design datacenters. Executes and coordinates multi-team install process for computing hardware. Tests and troubleshoots computer hardware/software issues. Executes break-fix and process within specified service level agreements. Installs operating systems and troubleshoots basic install issues. May perform operational test and fault isolation on systems and equipment. Works with asset management and ticketing systems. Executes regular equipment audits. Interfaces with and manages working relationships with hardware vendor technicians. Server Hardware Tech CompuCom March 2007  –  December 2014  (7 years 10 months) Portland, Oregon Area Receive and land new servers. Configure infrastructure and load Linux operating systems. Troubleshoot and maintain data centers with more than 15,500 servers. Arrange for vendor service when available. Perform hardware repairs. Track assets. Advanced System Support Technician tw telecom July 2001  –  November 2001  (5 months) Portland, Oregon Area Received new IT hardware. Tracked hardware in database. Prepared systems for users. Provided second tier support to users. Advanced System Support Technician GST Telecom June 1999  –  July 2001  (2 years 2 months) Portland, Oregon Area Received new IT hardware. Tracked hardware in database. Prepared systems for users. Provided second tier support to users. Computer Service Technician Computer Service Group March 1996  –  March 1999  (3 years 1 month) Hardware and software installations, troubleshooting, and service on-site Computer Service Technician Tandy Corporation November 1995  –  March 1996  (5 months) Hardware and software troubleshooting for all computer systems and accessories sold at Tandy stores. Hardware and software upgrades and installations. Engineering Technician Intel Corporation January 2015  – Present (8 months) Portland, Oregon Area Responsible for functions in support of computing hardware for design engineering in Intel design datacenters. Executes and coordinates multi-team install process for computing hardware. Tests and troubleshoots computer hardware/software issues. Executes break-fix and process within specified service level agreements. Installs operating systems and troubleshoots basic install issues. May perform operational test and fault isolation on systems and equipment. Works with asset management and ticketing systems. Executes regular equipment audits. Interfaces with and manages working relationships with hardware vendor technicians. Engineering Technician Intel Corporation January 2015  – Present (8 months) Portland, Oregon Area Responsible for functions in support of computing hardware for design engineering in Intel design datacenters. Executes and coordinates multi-team install process for computing hardware. Tests and troubleshoots computer hardware/software issues. Executes break-fix and process within specified service level agreements. Installs operating systems and troubleshoots basic install issues. May perform operational test and fault isolation on systems and equipment. Works with asset management and ticketing systems. Executes regular equipment audits. Interfaces with and manages working relationships with hardware vendor technicians. Server Hardware Tech CompuCom March 2007  –  December 2014  (7 years 10 months) Portland, Oregon Area Receive and land new servers. Configure infrastructure and load Linux operating systems. Troubleshoot and maintain data centers with more than 15,500 servers. Arrange for vendor service when available. Perform hardware repairs. Track assets. Server Hardware Tech CompuCom March 2007  –  December 2014  (7 years 10 months) Portland, Oregon Area Receive and land new servers. Configure infrastructure and load Linux operating systems. Troubleshoot and maintain data centers with more than 15,500 servers. Arrange for vendor service when available. Perform hardware repairs. Track assets. Advanced System Support Technician tw telecom July 2001  –  November 2001  (5 months) Portland, Oregon Area Received new IT hardware. Tracked hardware in database. Prepared systems for users. Provided second tier support to users. Advanced System Support Technician tw telecom July 2001  –  November 2001  (5 months) Portland, Oregon Area Received new IT hardware. Tracked hardware in database. Prepared systems for users. Provided second tier support to users. Advanced System Support Technician GST Telecom June 1999  –  July 2001  (2 years 2 months) Portland, Oregon Area Received new IT hardware. Tracked hardware in database. Prepared systems for users. Provided second tier support to users. Advanced System Support Technician GST Telecom June 1999  –  July 2001  (2 years 2 months) Portland, Oregon Area Received new IT hardware. Tracked hardware in database. Prepared systems for users. Provided second tier support to users. Computer Service Technician Computer Service Group March 1996  –  March 1999  (3 years 1 month) Hardware and software installations, troubleshooting, and service on-site Computer Service Technician Computer Service Group March 1996  –  March 1999  (3 years 1 month) Hardware and software installations, troubleshooting, and service on-site Computer Service Technician Tandy Corporation November 1995  –  March 1996  (5 months) Hardware and software troubleshooting for all computer systems and accessories sold at Tandy stores. Hardware and software upgrades and installations. Computer Service Technician Tandy Corporation November 1995  –  March 1996  (5 months) Hardware and software troubleshooting for all computer systems and accessories sold at Tandy stores. Hardware and software upgrades and installations. Skills Active Directory Troubleshooting ITIL Windows Server Windows 7 Technical Support Servers Windows XP IT Service Management Computer Hardware Software Installation Hardware Databases Software Data Center Linux Infrastructure See 2+     See less Skills  Active Directory Troubleshooting ITIL Windows Server Windows 7 Technical Support Servers Windows XP IT Service Management Computer Hardware Software Installation Hardware Databases Software Data Center Linux Infrastructure See 2+     See less Active Directory Troubleshooting ITIL Windows Server Windows 7 Technical Support Servers Windows XP IT Service Management Computer Hardware Software Installation Hardware Databases Software Data Center Linux Infrastructure See 2+     See less Active Directory Troubleshooting ITIL Windows Server Windows 7 Technical Support Servers Windows XP IT Service Management Computer Hardware Software Installation Hardware Databases Software Data Center Linux Infrastructure See 2+     See less Education Portland State University Bachelor of Science (BS),  Psychology 1991  – 1995 Mt. Hood Community College Associate of Science (AS),  Computer Science 1985  – 1989 Portland State University Bachelor of Science (BS),  Psychology 1991  – 1995 Portland State University Bachelor of Science (BS),  Psychology 1991  – 1995 Portland State University Bachelor of Science (BS),  Psychology 1991  – 1995 Mt. Hood Community College Associate of Science (AS),  Computer Science 1985  – 1989 Mt. Hood Community College Associate of Science (AS),  Computer Science 1985  – 1989 Mt. Hood Community College Associate of Science (AS),  Computer Science 1985  – 1989 ", "Summary Organized, high energy, and goal-oriented professional who brings experience and maturity, along with excellent communication and interpersonal skills. Additionally, with over 18+ years of semiconductor manufacturing experience, I have 24+ years of electronic troubleshooting and maintenance experience. Currently highly experienced and trained in the semiconductor industry as a Engineering Technician. Work well with constant change and deadlines. Successful in developing people, and capable of gaining cooperation of others and motivate them to maximum performance Summary Organized, high energy, and goal-oriented professional who brings experience and maturity, along with excellent communication and interpersonal skills. Additionally, with over 18+ years of semiconductor manufacturing experience, I have 24+ years of electronic troubleshooting and maintenance experience. Currently highly experienced and trained in the semiconductor industry as a Engineering Technician. Work well with constant change and deadlines. Successful in developing people, and capable of gaining cooperation of others and motivate them to maximum performance Organized, high energy, and goal-oriented professional who brings experience and maturity, along with excellent communication and interpersonal skills. Additionally, with over 18+ years of semiconductor manufacturing experience, I have 24+ years of electronic troubleshooting and maintenance experience. Currently highly experienced and trained in the semiconductor industry as a Engineering Technician. Work well with constant change and deadlines. Successful in developing people, and capable of gaining cooperation of others and motivate them to maximum performance Organized, high energy, and goal-oriented professional who brings experience and maturity, along with excellent communication and interpersonal skills. Additionally, with over 18+ years of semiconductor manufacturing experience, I have 24+ years of electronic troubleshooting and maintenance experience. Currently highly experienced and trained in the semiconductor industry as a Engineering Technician. Work well with constant change and deadlines. Successful in developing people, and capable of gaining cooperation of others and motivate them to maximum performance Experience Engineering Technician Intel Corporation October 2013  – Present (1 year 11 months) Hillsboro, Oregon • Thin films Atomic Layer Deposition (ALD) process and maintenance experience. \n• Equipment coordinator, responsible for setting up the shift priorities, and all maintenance activities Senior Manufacturing Technician Intel Corporation August 2005  –  September 2013  (8 years 2 months) Fab 11X Rio Rancho, NM •\t8+ years of thin films Physical Vapor Deposition (PVD) process and maintenance experience. \n•\tEquipment coordinator, responsible for setting up the shift priorities, and all maintenance activities in CSB/CTI team.  \n•\tLead technician for on shift corrective maintenance activities on the Endura platform. \n•\tAssisting Engineering personnel in the continuous improvement and development of the manufacturing process, including engineering experiments.  \n•\tProactive member of quality, safety and maintenance teams. \n \nMaintenance Experience \n \n•\tSignificant responsibilities included: sustaining, upgrading and troubleshooting any major equipment issues. \n•\tExperience with electrical schematics, precision instruments, Robotics, Pneumatics, Lasers, High Voltage and High Vacuum systems. \n•\tMake visual and mechanical evaluations of equipment and process faults.  \n•\tResponsible for all breakdowns, annual, semi-annual, quarterly and preventive maintenance on the Endura 5500. \n•\tResponsible for responding and correcting all tool aborts / excursions. \n•\tMeticulous around wearing all Personal Protective Equipment (PPE) as required for high voltage, toxic or flammable gases and chemicals.  \n \nInterpersonal Skills \n \n•\tHighly trusted by management and engineering for decision making on a nightly basis. \n•\tLeading ATAC’s and conducting shift pass down meetings. \n•\tArea point of contact for all vendors and shift manager while cover the shift group leader. \n•\tAbility to work under time constants and motivate team in accomplishing shift goals. \n•\tTraining coordinator, responsible for keeping track of all training gaps within the shift. Manufacturing Technician Agere Systems (formally Lucent Technologies) October 1996  –  August 2005  (8 years 11 months) Orlando, Florida Area •\t8+ years of thin films Physical Vapor Deposition (PVD) process experience \n•\t8+ years of High Vacuum equipment diagnosis and maintenance experience. \n•\tTrained personnel to operate and process check a variety of PVD and diagnostic equipment.  \nMaintenance Experience  \n•\tResponsible for all breakdowns, annual, semi-annual, quarterly and preventive maintenance on the Novellus / Varian M2I (PVD) system and ChemWest parts cleaning facilities. \nProcess Experience \n•\tSignificant responsibilities included setting up, proving-in, and sustaining processes. Running and evaluating qualification tests, diagnosing the causes of process problems and taking corrective action according to the statistical process control (SPC) charts. Field Service Technician Pomeroy October 1995  –  October 1996  (1 year 1 month) Jacksonville, Florida •\tExperience with installing & troubleshooting local area networks (LAN) hardware & software. \n•\tOn-site customer support & diagnosis of computer and printer systems. \n•\tCoordinated computer support on behalf of my customer accounts. Satellite Uplink Engineer American Simulcasting Corp. April 1995  –  October 1996  (1 year 7 months) Jacksonville, Florida •\tFamiliar with operation of commercial digital and analog encryption and compressing equipment. \n•\tProficient with troubleshooting and maintenance of high-powered amplifiers. \n•\tWorking knowledge of spectrum analyzers & oscilloscopes. Communications Technician US Army August 1988  –  January 1992  (3 years 6 months) Sullivan Barracks and Coleman Barracks in Mannheim, Germany •\tPromoted 3 times, and individually recognized 6 times for outstanding performance on the job by the United States Army. \n•\tSupervised personnel in the installation and maintenance of communication systems. \n•\tTrained personnel to operate satellite, radio and telecommunications systems. \n•\tCoordinated the operation and maintenance of high frequency radio station in the Military Affiliate Radio System (MARS). Engineering Technician Intel Corporation October 2013  – Present (1 year 11 months) Hillsboro, Oregon • Thin films Atomic Layer Deposition (ALD) process and maintenance experience. \n• Equipment coordinator, responsible for setting up the shift priorities, and all maintenance activities Engineering Technician Intel Corporation October 2013  – Present (1 year 11 months) Hillsboro, Oregon • Thin films Atomic Layer Deposition (ALD) process and maintenance experience. \n• Equipment coordinator, responsible for setting up the shift priorities, and all maintenance activities Senior Manufacturing Technician Intel Corporation August 2005  –  September 2013  (8 years 2 months) Fab 11X Rio Rancho, NM •\t8+ years of thin films Physical Vapor Deposition (PVD) process and maintenance experience. \n•\tEquipment coordinator, responsible for setting up the shift priorities, and all maintenance activities in CSB/CTI team.  \n•\tLead technician for on shift corrective maintenance activities on the Endura platform. \n•\tAssisting Engineering personnel in the continuous improvement and development of the manufacturing process, including engineering experiments.  \n•\tProactive member of quality, safety and maintenance teams. \n \nMaintenance Experience \n \n•\tSignificant responsibilities included: sustaining, upgrading and troubleshooting any major equipment issues. \n•\tExperience with electrical schematics, precision instruments, Robotics, Pneumatics, Lasers, High Voltage and High Vacuum systems. \n•\tMake visual and mechanical evaluations of equipment and process faults.  \n•\tResponsible for all breakdowns, annual, semi-annual, quarterly and preventive maintenance on the Endura 5500. \n•\tResponsible for responding and correcting all tool aborts / excursions. \n•\tMeticulous around wearing all Personal Protective Equipment (PPE) as required for high voltage, toxic or flammable gases and chemicals.  \n \nInterpersonal Skills \n \n•\tHighly trusted by management and engineering for decision making on a nightly basis. \n•\tLeading ATAC’s and conducting shift pass down meetings. \n•\tArea point of contact for all vendors and shift manager while cover the shift group leader. \n•\tAbility to work under time constants and motivate team in accomplishing shift goals. \n•\tTraining coordinator, responsible for keeping track of all training gaps within the shift. Senior Manufacturing Technician Intel Corporation August 2005  –  September 2013  (8 years 2 months) Fab 11X Rio Rancho, NM •\t8+ years of thin films Physical Vapor Deposition (PVD) process and maintenance experience. \n•\tEquipment coordinator, responsible for setting up the shift priorities, and all maintenance activities in CSB/CTI team.  \n•\tLead technician for on shift corrective maintenance activities on the Endura platform. \n•\tAssisting Engineering personnel in the continuous improvement and development of the manufacturing process, including engineering experiments.  \n•\tProactive member of quality, safety and maintenance teams. \n \nMaintenance Experience \n \n•\tSignificant responsibilities included: sustaining, upgrading and troubleshooting any major equipment issues. \n•\tExperience with electrical schematics, precision instruments, Robotics, Pneumatics, Lasers, High Voltage and High Vacuum systems. \n•\tMake visual and mechanical evaluations of equipment and process faults.  \n•\tResponsible for all breakdowns, annual, semi-annual, quarterly and preventive maintenance on the Endura 5500. \n•\tResponsible for responding and correcting all tool aborts / excursions. \n•\tMeticulous around wearing all Personal Protective Equipment (PPE) as required for high voltage, toxic or flammable gases and chemicals.  \n \nInterpersonal Skills \n \n•\tHighly trusted by management and engineering for decision making on a nightly basis. \n•\tLeading ATAC’s and conducting shift pass down meetings. \n•\tArea point of contact for all vendors and shift manager while cover the shift group leader. \n•\tAbility to work under time constants and motivate team in accomplishing shift goals. \n•\tTraining coordinator, responsible for keeping track of all training gaps within the shift. Manufacturing Technician Agere Systems (formally Lucent Technologies) October 1996  –  August 2005  (8 years 11 months) Orlando, Florida Area •\t8+ years of thin films Physical Vapor Deposition (PVD) process experience \n•\t8+ years of High Vacuum equipment diagnosis and maintenance experience. \n•\tTrained personnel to operate and process check a variety of PVD and diagnostic equipment.  \nMaintenance Experience  \n•\tResponsible for all breakdowns, annual, semi-annual, quarterly and preventive maintenance on the Novellus / Varian M2I (PVD) system and ChemWest parts cleaning facilities. \nProcess Experience \n•\tSignificant responsibilities included setting up, proving-in, and sustaining processes. Running and evaluating qualification tests, diagnosing the causes of process problems and taking corrective action according to the statistical process control (SPC) charts. Manufacturing Technician Agere Systems (formally Lucent Technologies) October 1996  –  August 2005  (8 years 11 months) Orlando, Florida Area •\t8+ years of thin films Physical Vapor Deposition (PVD) process experience \n•\t8+ years of High Vacuum equipment diagnosis and maintenance experience. \n•\tTrained personnel to operate and process check a variety of PVD and diagnostic equipment.  \nMaintenance Experience  \n•\tResponsible for all breakdowns, annual, semi-annual, quarterly and preventive maintenance on the Novellus / Varian M2I (PVD) system and ChemWest parts cleaning facilities. \nProcess Experience \n•\tSignificant responsibilities included setting up, proving-in, and sustaining processes. Running and evaluating qualification tests, diagnosing the causes of process problems and taking corrective action according to the statistical process control (SPC) charts. Field Service Technician Pomeroy October 1995  –  October 1996  (1 year 1 month) Jacksonville, Florida •\tExperience with installing & troubleshooting local area networks (LAN) hardware & software. \n•\tOn-site customer support & diagnosis of computer and printer systems. \n•\tCoordinated computer support on behalf of my customer accounts. Field Service Technician Pomeroy October 1995  –  October 1996  (1 year 1 month) Jacksonville, Florida •\tExperience with installing & troubleshooting local area networks (LAN) hardware & software. \n•\tOn-site customer support & diagnosis of computer and printer systems. \n•\tCoordinated computer support on behalf of my customer accounts. Satellite Uplink Engineer American Simulcasting Corp. April 1995  –  October 1996  (1 year 7 months) Jacksonville, Florida •\tFamiliar with operation of commercial digital and analog encryption and compressing equipment. \n•\tProficient with troubleshooting and maintenance of high-powered amplifiers. \n•\tWorking knowledge of spectrum analyzers & oscilloscopes. Satellite Uplink Engineer American Simulcasting Corp. April 1995  –  October 1996  (1 year 7 months) Jacksonville, Florida •\tFamiliar with operation of commercial digital and analog encryption and compressing equipment. \n•\tProficient with troubleshooting and maintenance of high-powered amplifiers. \n•\tWorking knowledge of spectrum analyzers & oscilloscopes. Communications Technician US Army August 1988  –  January 1992  (3 years 6 months) Sullivan Barracks and Coleman Barracks in Mannheim, Germany •\tPromoted 3 times, and individually recognized 6 times for outstanding performance on the job by the United States Army. \n•\tSupervised personnel in the installation and maintenance of communication systems. \n•\tTrained personnel to operate satellite, radio and telecommunications systems. \n•\tCoordinated the operation and maintenance of high frequency radio station in the Military Affiliate Radio System (MARS). Communications Technician US Army August 1988  –  January 1992  (3 years 6 months) Sullivan Barracks and Coleman Barracks in Mannheim, Germany •\tPromoted 3 times, and individually recognized 6 times for outstanding performance on the job by the United States Army. \n•\tSupervised personnel in the installation and maintenance of communication systems. \n•\tTrained personnel to operate satellite, radio and telecommunications systems. \n•\tCoordinated the operation and maintenance of high frequency radio station in the Military Affiliate Radio System (MARS). Skills SPC Test Equipment Manufacturing Intel Semiconductors Failure Analysis Metrology Design of Experiments Equipment Maintenance Semiconductor... High Vacuum Clean Rooms Preventive Maintenance Equipment Installation Electronics Pneumatics Multimeter Lean Manufacturing Thin Films Manufacturing Operations Robotics Continuous Improvement Troubleshooting Semiconductor Industry Oscilloscope Engineering Soldering JMP Calibration Testing IC RF Silicon PVD Cross-functional Team... Field Service Six Sigma Process Improvement Root Cause Analysis See 24+     See less Skills  SPC Test Equipment Manufacturing Intel Semiconductors Failure Analysis Metrology Design of Experiments Equipment Maintenance Semiconductor... High Vacuum Clean Rooms Preventive Maintenance Equipment Installation Electronics Pneumatics Multimeter Lean Manufacturing Thin Films Manufacturing Operations Robotics Continuous Improvement Troubleshooting Semiconductor Industry Oscilloscope Engineering Soldering JMP Calibration Testing IC RF Silicon PVD Cross-functional Team... Field Service Six Sigma Process Improvement Root Cause Analysis See 24+     See less SPC Test Equipment Manufacturing Intel Semiconductors Failure Analysis Metrology Design of Experiments Equipment Maintenance Semiconductor... High Vacuum Clean Rooms Preventive Maintenance Equipment Installation Electronics Pneumatics Multimeter Lean Manufacturing Thin Films Manufacturing Operations Robotics Continuous Improvement Troubleshooting Semiconductor Industry Oscilloscope Engineering Soldering JMP Calibration Testing IC RF Silicon PVD Cross-functional Team... Field Service Six Sigma Process Improvement Root Cause Analysis See 24+     See less SPC Test Equipment Manufacturing Intel Semiconductors Failure Analysis Metrology Design of Experiments Equipment Maintenance Semiconductor... High Vacuum Clean Rooms Preventive Maintenance Equipment Installation Electronics Pneumatics Multimeter Lean Manufacturing Thin Films Manufacturing Operations Robotics Continuous Improvement Troubleshooting Semiconductor Industry Oscilloscope Engineering Soldering JMP Calibration Testing IC RF Silicon PVD Cross-functional Team... Field Service Six Sigma Process Improvement Root Cause Analysis See 24+     See less Education ITT Technical Institute-Jacksonville, Florida Associate of Arts and Sciences (AAS),  Electrical and Electronics Engineering 1994  – 1996 Sandalwood High School High School 1985  – 1988 ITT Technical Institute-Jacksonville, Florida Associate of Arts and Sciences (AAS),  Electrical and Electronics Engineering 1994  – 1996 ITT Technical Institute-Jacksonville, Florida Associate of Arts and Sciences (AAS),  Electrical and Electronics Engineering 1994  – 1996 ITT Technical Institute-Jacksonville, Florida Associate of Arts and Sciences (AAS),  Electrical and Electronics Engineering 1994  – 1996 Sandalwood High School High School 1985  – 1988 Sandalwood High School High School 1985  – 1988 Sandalwood High School High School 1985  – 1988 ", "Experience Engineering Technician Intel Corporation 1997  – Present (18 years) Portland, Oregon Area Operate and maintain equipment used in the semiconductor industry Electronic Technician US Navy Reserve 1996  –  2004  (8 years) Electronic Technician Atlantis Submarines 1996  –  1997  (1 year) Honolulu, Hi ElectronicTechnician Reactor Operator, Submarines US Navy 1980  –  1996  (16 years) Electronic Technician Maintanence School Instructor US Navy 1992  –  1994  (2 years) Ford Island, HI Advanced electronic troubleshooting and repair instructor. Engineering Technician San Pedro and Peninsula Hospital 1978  –  1980  (2 years) San Pedro, California Aircraft Mechanic Hardy Air 1976  –  1978  (2 years) Engineering Technician Intel Corporation 1997  – Present (18 years) Portland, Oregon Area Operate and maintain equipment used in the semiconductor industry Engineering Technician Intel Corporation 1997  – Present (18 years) Portland, Oregon Area Operate and maintain equipment used in the semiconductor industry Electronic Technician US Navy Reserve 1996  –  2004  (8 years) Electronic Technician US Navy Reserve 1996  –  2004  (8 years) Electronic Technician Atlantis Submarines 1996  –  1997  (1 year) Honolulu, Hi Electronic Technician Atlantis Submarines 1996  –  1997  (1 year) Honolulu, Hi ElectronicTechnician Reactor Operator, Submarines US Navy 1980  –  1996  (16 years) ElectronicTechnician Reactor Operator, Submarines US Navy 1980  –  1996  (16 years) Electronic Technician Maintanence School Instructor US Navy 1992  –  1994  (2 years) Ford Island, HI Advanced electronic troubleshooting and repair instructor. Electronic Technician Maintanence School Instructor US Navy 1992  –  1994  (2 years) Ford Island, HI Advanced electronic troubleshooting and repair instructor. Engineering Technician San Pedro and Peninsula Hospital 1978  –  1980  (2 years) San Pedro, California Engineering Technician San Pedro and Peninsula Hospital 1978  –  1980  (2 years) San Pedro, California Aircraft Mechanic Hardy Air 1976  –  1978  (2 years) Aircraft Mechanic Hardy Air 1976  –  1978  (2 years) Skills Semiconductors Intel Electronics Thin Films Manufacturing Skills  Semiconductors Intel Electronics Thin Films Manufacturing Semiconductors Intel Electronics Thin Films Manufacturing Semiconductors Intel Electronics Thin Films Manufacturing Education Alabama Avaition and Technical College Airframe and Powerplant License,  Aircraft Maintance 1974  – 1976 Alabama Avaition and Technical College Airframe and Powerplant License,  Aircraft Maintance 1974  – 1976 Alabama Avaition and Technical College Airframe and Powerplant License,  Aircraft Maintance 1974  – 1976 Alabama Avaition and Technical College Airframe and Powerplant License,  Aircraft Maintance 1974  – 1976 ", "Experience Engineering Technician Intel Corporation August 2014  – Present (1 year 1 month) Aloha Oregon Manufacturing Technician Intel Corporation September 2011  –  August 2014  (3 years) Aloha, Oregon Product Test Technician I Fluke Corporation May 2008  –  September 2011  (3 years 5 months) Everett, Washington Engineering Technician Intel Corporation August 2014  – Present (1 year 1 month) Aloha Oregon Engineering Technician Intel Corporation August 2014  – Present (1 year 1 month) Aloha Oregon Manufacturing Technician Intel Corporation September 2011  –  August 2014  (3 years) Aloha, Oregon Manufacturing Technician Intel Corporation September 2011  –  August 2014  (3 years) Aloha, Oregon Product Test Technician I Fluke Corporation May 2008  –  September 2011  (3 years 5 months) Everett, Washington Product Test Technician I Fluke Corporation May 2008  –  September 2011  (3 years 5 months) Everett, Washington Skills Electronics Semiconductors Test Equipment Metrology Failure Analysis Manufacturing Analog PCB Design Electrical Engineering SPC Testing Engineering Engineering Management Microsoft Office Troubleshooting Skills  Electronics Semiconductors Test Equipment Metrology Failure Analysis Manufacturing Analog PCB Design Electrical Engineering SPC Testing Engineering Engineering Management Microsoft Office Troubleshooting Electronics Semiconductors Test Equipment Metrology Failure Analysis Manufacturing Analog PCB Design Electrical Engineering SPC Testing Engineering Engineering Management Microsoft Office Troubleshooting Electronics Semiconductors Test Equipment Metrology Failure Analysis Manufacturing Analog PCB Design Electrical Engineering SPC Testing Engineering Engineering Management Microsoft Office Troubleshooting Education Itt-Tech AA of Science,  Electrical Engineering 2009  – 2011 Itt-Tech AA of Science,  Electrical Engineering 2009  – 2011 Itt-Tech AA of Science,  Electrical Engineering 2009  – 2011 Itt-Tech AA of Science,  Electrical Engineering 2009  – 2011 ", "Experience Engineering Technician Intel Corporation February 2013  – Present (2 years 7 months) Portland, Oregon US Thin Films Maintenance Technician Intel Corporation June 2004  –  February 2013  (8 years 9 months) Motor Mechanics Toyota Dealerships 1999  –  2003  (4 years) Engineering Technician Intel Corporation February 2013  – Present (2 years 7 months) Portland, Oregon US Thin Films Engineering Technician Intel Corporation February 2013  – Present (2 years 7 months) Portland, Oregon US Thin Films Maintenance Technician Intel Corporation June 2004  –  February 2013  (8 years 9 months) Maintenance Technician Intel Corporation June 2004  –  February 2013  (8 years 9 months) Motor Mechanics Toyota Dealerships 1999  –  2003  (4 years) Motor Mechanics Toyota Dealerships 1999  –  2003  (4 years) Skills Semiconductors Robotics Manufacturing SPC Thin Films Electronics Test Equipment Equipment Maintenance Lean Manufacturing Troubleshooting Metrology Automation Continuous Improvement Engineering Product Development Plasma Etch Etching Electro-mechanical Semiconductor Industry Intel Preventive Maintenance Pneumatics See 7+     See less Skills  Semiconductors Robotics Manufacturing SPC Thin Films Electronics Test Equipment Equipment Maintenance Lean Manufacturing Troubleshooting Metrology Automation Continuous Improvement Engineering Product Development Plasma Etch Etching Electro-mechanical Semiconductor Industry Intel Preventive Maintenance Pneumatics See 7+     See less Semiconductors Robotics Manufacturing SPC Thin Films Electronics Test Equipment Equipment Maintenance Lean Manufacturing Troubleshooting Metrology Automation Continuous Improvement Engineering Product Development Plasma Etch Etching Electro-mechanical Semiconductor Industry Intel Preventive Maintenance Pneumatics See 7+     See less Semiconductors Robotics Manufacturing SPC Thin Films Electronics Test Equipment Equipment Maintenance Lean Manufacturing Troubleshooting Metrology Automation Continuous Improvement Engineering Product Development Plasma Etch Etching Electro-mechanical Semiconductor Industry Intel Preventive Maintenance Pneumatics See 7+     See less Education Waterford Institute of Technology Advanced Certificate in Mechanics 1999  – 2002 Waterford Institute of Technology Advanced Certificate in Mechanics 1999  – 2002 Waterford Institute of Technology Advanced Certificate in Mechanics 1999  – 2002 Waterford Institute of Technology Advanced Certificate in Mechanics 1999  – 2002 ", "Experience Engineering Technician Intel Corporation June 2014  – Present (1 year 3 months) Sort development Developed operating procedures, jigs/fixtures, tracking systems, training packages, PM procedures, and contributed to process development and operations of a greenfield factory startup. Manufacturing Technician Intel Corporation May 2004  –  June 2014  (10 years 2 months) D1D PTD Metals Operation, maintenance, and development on Endura platform metal deposition tools. Engineering Technician Intel Corporation June 2014  – Present (1 year 3 months) Sort development Developed operating procedures, jigs/fixtures, tracking systems, training packages, PM procedures, and contributed to process development and operations of a greenfield factory startup. Engineering Technician Intel Corporation June 2014  – Present (1 year 3 months) Sort development Developed operating procedures, jigs/fixtures, tracking systems, training packages, PM procedures, and contributed to process development and operations of a greenfield factory startup. Manufacturing Technician Intel Corporation May 2004  –  June 2014  (10 years 2 months) D1D PTD Metals Operation, maintenance, and development on Endura platform metal deposition tools. Manufacturing Technician Intel Corporation May 2004  –  June 2014  (10 years 2 months) D1D PTD Metals Operation, maintenance, and development on Endura platform metal deposition tools. Skills Manufacturing Engineering Semiconductors Semiconductor Industry Electronics SPC Failure Analysis IC Lean Manufacturing Design of Experiments Metrology Skills  Manufacturing Engineering Semiconductors Semiconductor Industry Electronics SPC Failure Analysis IC Lean Manufacturing Design of Experiments Metrology Manufacturing Engineering Semiconductors Semiconductor Industry Electronics SPC Failure Analysis IC Lean Manufacturing Design of Experiments Metrology Manufacturing Engineering Semiconductors Semiconductor Industry Electronics SPC Failure Analysis IC Lean Manufacturing Design of Experiments Metrology Education Oregon Institute of Technology Bachelor of Science (BS),  Electrical and Electronics Engineering 2012  – 2015 Chemeketa Community College Associate of Arts and Sciences (AAS),  Electrical and Electronics Engineering 2000  – 2003 Activities and Societies:  Final project: Wireless greenhouse utilizing PLC programmed with ladder logic and wireless communications provided by first gen xbee. Gui interface programmed in visual basic. Oregon Institute of Technology Bachelor of Science (BS),  Electrical and Electronics Engineering 2012  – 2015 Oregon Institute of Technology Bachelor of Science (BS),  Electrical and Electronics Engineering 2012  – 2015 Oregon Institute of Technology Bachelor of Science (BS),  Electrical and Electronics Engineering 2012  – 2015 Chemeketa Community College Associate of Arts and Sciences (AAS),  Electrical and Electronics Engineering 2000  – 2003 Activities and Societies:  Final project: Wireless greenhouse utilizing PLC programmed with ladder logic and wireless communications provided by first gen xbee. Gui interface programmed in visual basic. Chemeketa Community College Associate of Arts and Sciences (AAS),  Electrical and Electronics Engineering 2000  – 2003 Activities and Societies:  Final project: Wireless greenhouse utilizing PLC programmed with ladder logic and wireless communications provided by first gen xbee. Gui interface programmed in visual basic. Chemeketa Community College Associate of Arts and Sciences (AAS),  Electrical and Electronics Engineering 2000  – 2003 Activities and Societies:  Final project: Wireless greenhouse utilizing PLC programmed with ladder logic and wireless communications provided by first gen xbee. Gui interface programmed in visual basic. ", "Experience Engineering Technician Intel Corporation December 2008  – Present (6 years 9 months) Hillsboro, OR -\tE-test tool expert and escalation point for Advantest V93k, TEL P12XL and Agilent 4080 & 4072.  \n-\tCreate, maintain and updates training documentation, specifications, preventative maintenance steps, responses for failures and general usage guidelines for tool sets.  \n-\tTroubleshooting and root-cause failures seen in testing related to wafers, toolsets, probe cards and test packages. \n-\tStatistical analysis of data using statistical analyzing software to establish positive correlations between problems and implementing and monitoring changes to positively impact area.  \n- Basic shell script creation to automate tasks. Manufacturing Technician Intel Corporation August 2005  –  December 2008  (3 years 5 months) Hillsboro, OR -\tProcess product, detect and resolve routine equipment or processing errors and ensure product quality. \n-\tCollected and preformed simple analysis, applied approved troubleshooting. \n-\tEstablished daily priorities and organized resources to provide timely, effective solutions to problems. Engineering Technician Intel Corporation December 2008  – Present (6 years 9 months) Hillsboro, OR -\tE-test tool expert and escalation point for Advantest V93k, TEL P12XL and Agilent 4080 & 4072.  \n-\tCreate, maintain and updates training documentation, specifications, preventative maintenance steps, responses for failures and general usage guidelines for tool sets.  \n-\tTroubleshooting and root-cause failures seen in testing related to wafers, toolsets, probe cards and test packages. \n-\tStatistical analysis of data using statistical analyzing software to establish positive correlations between problems and implementing and monitoring changes to positively impact area.  \n- Basic shell script creation to automate tasks. Engineering Technician Intel Corporation December 2008  – Present (6 years 9 months) Hillsboro, OR -\tE-test tool expert and escalation point for Advantest V93k, TEL P12XL and Agilent 4080 & 4072.  \n-\tCreate, maintain and updates training documentation, specifications, preventative maintenance steps, responses for failures and general usage guidelines for tool sets.  \n-\tTroubleshooting and root-cause failures seen in testing related to wafers, toolsets, probe cards and test packages. \n-\tStatistical analysis of data using statistical analyzing software to establish positive correlations between problems and implementing and monitoring changes to positively impact area.  \n- Basic shell script creation to automate tasks. Manufacturing Technician Intel Corporation August 2005  –  December 2008  (3 years 5 months) Hillsboro, OR -\tProcess product, detect and resolve routine equipment or processing errors and ensure product quality. \n-\tCollected and preformed simple analysis, applied approved troubleshooting. \n-\tEstablished daily priorities and organized resources to provide timely, effective solutions to problems. Manufacturing Technician Intel Corporation August 2005  –  December 2008  (3 years 5 months) Hillsboro, OR -\tProcess product, detect and resolve routine equipment or processing errors and ensure product quality. \n-\tCollected and preformed simple analysis, applied approved troubleshooting. \n-\tEstablished daily priorities and organized resources to provide timely, effective solutions to problems. Skills Intel Semiconductors Semiconductor Industry Testing Troubleshooting SPC Microsoft Office Microsoft Excel Leadership Manufacturing Budgets Skills  Intel Semiconductors Semiconductor Industry Testing Troubleshooting SPC Microsoft Office Microsoft Excel Leadership Manufacturing Budgets Intel Semiconductors Semiconductor Industry Testing Troubleshooting SPC Microsoft Office Microsoft Excel Leadership Manufacturing Budgets Intel Semiconductors Semiconductor Industry Testing Troubleshooting SPC Microsoft Office Microsoft Excel Leadership Manufacturing Budgets Education Portland State University Bachelor of Science (B.S.),  Political Science 2010  – 2012 Portland Community College Associate of Applied Science,  Microelectronics Technology 2004  – 2007 Portland State University Bachelor of Science (B.S.),  Political Science 2010  – 2012 Portland State University Bachelor of Science (B.S.),  Political Science 2010  – 2012 Portland State University Bachelor of Science (B.S.),  Political Science 2010  – 2012 Portland Community College Associate of Applied Science,  Microelectronics Technology 2004  – 2007 Portland Community College Associate of Applied Science,  Microelectronics Technology 2004  – 2007 Portland Community College Associate of Applied Science,  Microelectronics Technology 2004  – 2007 ", "Experience Engineering Technician Intel Corporation July 2011  – Present (4 years 2 months) Chandler, AZ Responsibilities include characterization of both Substrates and assembled packages, using a wide array of mechanical, metallurgical, and microscopy methods. Because of the range of methods utilized, requires effective interface & partnering skills with lab/tool owners and the network of technicians in the Chandler ATTD site. Precision metallurgical / microscopic sample preparation, high magnification microscopy (optical and electron), basic material knowledge and basic statistical analysis are the technical tools used on a day-to-day basis in this position. This position requires frequent face-to-face and written communication with the engineering staff. Manufacturing Technician Equipment Intel Corporation September 2005  –  July 2011  (5 years 11 months) Chandler, AZ Experienced in the repair and maintenance of complex equipment in a manufacturing environment. Perform electrical or mechanical troubleshooting to determine problems in non-functioning electromechanical equipment used in the manufacturing process. Perform set-up, calibration, and preventative maintenance on production equipment. Experienced in equipment installations, upgrades and qualifications. Effectively communicate both verbal and in written reports. Strong customer relation skills, problem solving skills and organization / multitasking skills. Experienced in cleanroom protocol, chemical handling and lock out tag out procedures. Cleanroom Maintenance Technician W. L. Gore & Associates May 2003  –  March 2005  (1 year 11 months) Flagstaff, Arizona Effectively provided electrical and mechanical service in the repair, maintenance, installation and enhancement of machinery and equipment. Work within a cleanroom environment. Work with production, skilled trades and technical associates to provide ongoing support. Perform maintenance and calibration procedures. Manufacturing Technician Equipment Intel Corporation September 1995  –  May 2003  (7 years 9 months) Chandler, Arizona Experienced in the repair and maintenance of complex equipment in a manufacturing environment. Perform electrical or mechanical troubleshooting to determine problems in non-functioning electromechanical equipment used in the manufacturing process. Perform set-up, calibration, and preventative maintenance on production equipment. Experienced in equipment installations, upgrades and qualifications. Effectively communicate both verbal and in written reports. Strong customer relation skills, problem solving skills and organization / multitasking skills. Experienced in cleanroom protocol, chemical handling and lock out tag out procedures. Field Service Technician Cybex Technologies Corporation February 1994  –  September 1995  (1 year 8 months) Chandler, Arizona Accurately diagnosed, repaired and performed maintenance on a Seal Automation Line in a semiconductor factory. My primary customer was Intel Corporation in Chandler. Experienced in use, calibration and repair of state of the art robotics and vision equipment. Assisted on installations and system upgrades. Acquired 24 hour on call experience. Traveled national and international for business needs. Engineering Technician Intel Corporation July 2011  – Present (4 years 2 months) Chandler, AZ Responsibilities include characterization of both Substrates and assembled packages, using a wide array of mechanical, metallurgical, and microscopy methods. Because of the range of methods utilized, requires effective interface & partnering skills with lab/tool owners and the network of technicians in the Chandler ATTD site. Precision metallurgical / microscopic sample preparation, high magnification microscopy (optical and electron), basic material knowledge and basic statistical analysis are the technical tools used on a day-to-day basis in this position. This position requires frequent face-to-face and written communication with the engineering staff. Engineering Technician Intel Corporation July 2011  – Present (4 years 2 months) Chandler, AZ Responsibilities include characterization of both Substrates and assembled packages, using a wide array of mechanical, metallurgical, and microscopy methods. Because of the range of methods utilized, requires effective interface & partnering skills with lab/tool owners and the network of technicians in the Chandler ATTD site. Precision metallurgical / microscopic sample preparation, high magnification microscopy (optical and electron), basic material knowledge and basic statistical analysis are the technical tools used on a day-to-day basis in this position. This position requires frequent face-to-face and written communication with the engineering staff. Manufacturing Technician Equipment Intel Corporation September 2005  –  July 2011  (5 years 11 months) Chandler, AZ Experienced in the repair and maintenance of complex equipment in a manufacturing environment. Perform electrical or mechanical troubleshooting to determine problems in non-functioning electromechanical equipment used in the manufacturing process. Perform set-up, calibration, and preventative maintenance on production equipment. Experienced in equipment installations, upgrades and qualifications. Effectively communicate both verbal and in written reports. Strong customer relation skills, problem solving skills and organization / multitasking skills. Experienced in cleanroom protocol, chemical handling and lock out tag out procedures. Manufacturing Technician Equipment Intel Corporation September 2005  –  July 2011  (5 years 11 months) Chandler, AZ Experienced in the repair and maintenance of complex equipment in a manufacturing environment. Perform electrical or mechanical troubleshooting to determine problems in non-functioning electromechanical equipment used in the manufacturing process. Perform set-up, calibration, and preventative maintenance on production equipment. Experienced in equipment installations, upgrades and qualifications. Effectively communicate both verbal and in written reports. Strong customer relation skills, problem solving skills and organization / multitasking skills. Experienced in cleanroom protocol, chemical handling and lock out tag out procedures. Cleanroom Maintenance Technician W. L. Gore & Associates May 2003  –  March 2005  (1 year 11 months) Flagstaff, Arizona Effectively provided electrical and mechanical service in the repair, maintenance, installation and enhancement of machinery and equipment. Work within a cleanroom environment. Work with production, skilled trades and technical associates to provide ongoing support. Perform maintenance and calibration procedures. Cleanroom Maintenance Technician W. L. Gore & Associates May 2003  –  March 2005  (1 year 11 months) Flagstaff, Arizona Effectively provided electrical and mechanical service in the repair, maintenance, installation and enhancement of machinery and equipment. Work within a cleanroom environment. Work with production, skilled trades and technical associates to provide ongoing support. Perform maintenance and calibration procedures. Manufacturing Technician Equipment Intel Corporation September 1995  –  May 2003  (7 years 9 months) Chandler, Arizona Experienced in the repair and maintenance of complex equipment in a manufacturing environment. Perform electrical or mechanical troubleshooting to determine problems in non-functioning electromechanical equipment used in the manufacturing process. Perform set-up, calibration, and preventative maintenance on production equipment. Experienced in equipment installations, upgrades and qualifications. Effectively communicate both verbal and in written reports. Strong customer relation skills, problem solving skills and organization / multitasking skills. Experienced in cleanroom protocol, chemical handling and lock out tag out procedures. Manufacturing Technician Equipment Intel Corporation September 1995  –  May 2003  (7 years 9 months) Chandler, Arizona Experienced in the repair and maintenance of complex equipment in a manufacturing environment. Perform electrical or mechanical troubleshooting to determine problems in non-functioning electromechanical equipment used in the manufacturing process. Perform set-up, calibration, and preventative maintenance on production equipment. Experienced in equipment installations, upgrades and qualifications. Effectively communicate both verbal and in written reports. Strong customer relation skills, problem solving skills and organization / multitasking skills. Experienced in cleanroom protocol, chemical handling and lock out tag out procedures. Field Service Technician Cybex Technologies Corporation February 1994  –  September 1995  (1 year 8 months) Chandler, Arizona Accurately diagnosed, repaired and performed maintenance on a Seal Automation Line in a semiconductor factory. My primary customer was Intel Corporation in Chandler. Experienced in use, calibration and repair of state of the art robotics and vision equipment. Assisted on installations and system upgrades. Acquired 24 hour on call experience. Traveled national and international for business needs. Field Service Technician Cybex Technologies Corporation February 1994  –  September 1995  (1 year 8 months) Chandler, Arizona Accurately diagnosed, repaired and performed maintenance on a Seal Automation Line in a semiconductor factory. My primary customer was Intel Corporation in Chandler. Experienced in use, calibration and repair of state of the art robotics and vision equipment. Assisted on installations and system upgrades. Acquired 24 hour on call experience. Traveled national and international for business needs. Skills Microsoft Word Microsoft Office Microsoft Excel Engineering Automation Manufacturing Preventive Maintenance Electricians Calibration Factory Semiconductors Robotics Electronics Maintenance & Repair Testing Skills  Microsoft Word Microsoft Office Microsoft Excel Engineering Automation Manufacturing Preventive Maintenance Electricians Calibration Factory Semiconductors Robotics Electronics Maintenance & Repair Testing Microsoft Word Microsoft Office Microsoft Excel Engineering Automation Manufacturing Preventive Maintenance Electricians Calibration Factory Semiconductors Robotics Electronics Maintenance & Repair Testing Microsoft Word Microsoft Office Microsoft Excel Engineering Automation Manufacturing Preventive Maintenance Electricians Calibration Factory Semiconductors Robotics Electronics Maintenance & Repair Testing Education DeVry University Bachelor of Science (BS),  Technical Management , 3.6 GPA, Cum Laude 2010  – 2012 DeVry Institute of Technology Phoenix, AZ Associate of Science (AS),  Electronics , 3.5 GPA 1992  – 1994 DeVry University Bachelor of Science (BS),  Technical Management , 3.6 GPA, Cum Laude 2010  – 2012 DeVry University Bachelor of Science (BS),  Technical Management , 3.6 GPA, Cum Laude 2010  – 2012 DeVry University Bachelor of Science (BS),  Technical Management , 3.6 GPA, Cum Laude 2010  – 2012 DeVry Institute of Technology Phoenix, AZ Associate of Science (AS),  Electronics , 3.5 GPA 1992  – 1994 DeVry Institute of Technology Phoenix, AZ Associate of Science (AS),  Electronics , 3.5 GPA 1992  – 1994 DeVry Institute of Technology Phoenix, AZ Associate of Science (AS),  Electronics , 3.5 GPA 1992  – 1994 "]}