{"position": "Engineering", "company": "Intel Corporation", "profiles": ["Languages English Native or bilingual proficiency Polish Native or bilingual proficiency English Native or bilingual proficiency Polish Native or bilingual proficiency English Native or bilingual proficiency Polish Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills C++ Perl Python Linux Debugging Simulation Software Engineering Subversion C Engineering Software Development Windows Programming Validation Testing Eclipse OOP Algorithms SQL Valgrind Project Management Team Management Team-oriented Dependable Team Player XML Processors Simulations See 12+     See less Skills  C++ Perl Python Linux Debugging Simulation Software Engineering Subversion C Engineering Software Development Windows Programming Validation Testing Eclipse OOP Algorithms SQL Valgrind Project Management Team Management Team-oriented Dependable Team Player XML Processors Simulations See 12+     See less C++ Perl Python Linux Debugging Simulation Software Engineering Subversion C Engineering Software Development Windows Programming Validation Testing Eclipse OOP Algorithms SQL Valgrind Project Management Team Management Team-oriented Dependable Team Player XML Processors Simulations See 12+     See less C++ Perl Python Linux Debugging Simulation Software Engineering Subversion C Engineering Software Development Windows Programming Validation Testing Eclipse OOP Algorithms SQL Valgrind Project Management Team Management Team-oriented Dependable Team Player XML Processors Simulations See 12+     See less ", "Experience Equipment/Process Engineering Intel Corporation May 2004  – Present (11 years 4 months) Hillboro Oregon Fab equipment/process engineer responsible for maintaining over 90 vertical diffusion furnaces and assist on process related excursions on a day to day basis. Consulting Field Service Engineer ASML 2000  –  2004  (4 years) Hillsboro Oregon Consulting field service engineer responsible for training corporate representatives from various companies around the world, technical support, Field Service and tool install and re commissioning in North America and Europe. Consulting Engineer SVG 1994  –  2000  (6 years) Hillboro Oregon Senior Field service engineer responsible for installing, troubleshooting and process engineering SVG VTR, HTR and AVP product lines throughout North America and Europe Equipment/Process Engineering Intel Corporation May 2004  – Present (11 years 4 months) Hillboro Oregon Fab equipment/process engineer responsible for maintaining over 90 vertical diffusion furnaces and assist on process related excursions on a day to day basis. Equipment/Process Engineering Intel Corporation May 2004  – Present (11 years 4 months) Hillboro Oregon Fab equipment/process engineer responsible for maintaining over 90 vertical diffusion furnaces and assist on process related excursions on a day to day basis. Consulting Field Service Engineer ASML 2000  –  2004  (4 years) Hillsboro Oregon Consulting field service engineer responsible for training corporate representatives from various companies around the world, technical support, Field Service and tool install and re commissioning in North America and Europe. Consulting Field Service Engineer ASML 2000  –  2004  (4 years) Hillsboro Oregon Consulting field service engineer responsible for training corporate representatives from various companies around the world, technical support, Field Service and tool install and re commissioning in North America and Europe. Consulting Engineer SVG 1994  –  2000  (6 years) Hillboro Oregon Senior Field service engineer responsible for installing, troubleshooting and process engineering SVG VTR, HTR and AVP product lines throughout North America and Europe Consulting Engineer SVG 1994  –  2000  (6 years) Hillboro Oregon Senior Field service engineer responsible for installing, troubleshooting and process engineering SVG VTR, HTR and AVP product lines throughout North America and Europe Skills IC Semiconductor Industry SPC Design of Experiments Semiconductors CVD Process Integration Silicon Manufacturing Electronics Metrology Failure Analysis Thin Films Lean Manufacturing Characterization Robotics CMOS Engineering Management Engineering Testing See 5+     See less Skills  IC Semiconductor Industry SPC Design of Experiments Semiconductors CVD Process Integration Silicon Manufacturing Electronics Metrology Failure Analysis Thin Films Lean Manufacturing Characterization Robotics CMOS Engineering Management Engineering Testing See 5+     See less IC Semiconductor Industry SPC Design of Experiments Semiconductors CVD Process Integration Silicon Manufacturing Electronics Metrology Failure Analysis Thin Films Lean Manufacturing Characterization Robotics CMOS Engineering Management Engineering Testing See 5+     See less IC Semiconductor Industry SPC Design of Experiments Semiconductors CVD Process Integration Silicon Manufacturing Electronics Metrology Failure Analysis Thin Films Lean Manufacturing Characterization Robotics CMOS Engineering Management Engineering Testing See 5+     See less Education Portland Community College Electrical and Electronics Engineering 1985  – 1990 Cleveland Institute of Electronics Electrical , Electronic and Communications Engineering Technology/Technician 1981  – 1985 Portland Community College Electrical and Electronics Engineering 1985  – 1990 Portland Community College Electrical and Electronics Engineering 1985  – 1990 Portland Community College Electrical and Electronics Engineering 1985  – 1990 Cleveland Institute of Electronics Electrical , Electronic and Communications Engineering Technology/Technician 1981  – 1985 Cleveland Institute of Electronics Electrical , Electronic and Communications Engineering Technology/Technician 1981  – 1985 Cleveland Institute of Electronics Electrical , Electronic and Communications Engineering Technology/Technician 1981  – 1985 ", "Languages English Full professional proficiency Hebrew Native or bilingual proficiency English Full professional proficiency Hebrew Native or bilingual proficiency English Full professional proficiency Hebrew Native or bilingual proficiency Full professional proficiency Native or bilingual proficiency Skills Process Integration Silicon CVD Flash Memory JMP Materials Science Sputtering Nanotechnology Dry Etch Data Mining MOCVD AutoCAD Sputter Deposition R&D Product Development Automation Six Sigma Training Delivery SPC Engineering See 5+     See less Skills  Process Integration Silicon CVD Flash Memory JMP Materials Science Sputtering Nanotechnology Dry Etch Data Mining MOCVD AutoCAD Sputter Deposition R&D Product Development Automation Six Sigma Training Delivery SPC Engineering See 5+     See less Process Integration Silicon CVD Flash Memory JMP Materials Science Sputtering Nanotechnology Dry Etch Data Mining MOCVD AutoCAD Sputter Deposition R&D Product Development Automation Six Sigma Training Delivery SPC Engineering See 5+     See less Process Integration Silicon CVD Flash Memory JMP Materials Science Sputtering Nanotechnology Dry Etch Data Mining MOCVD AutoCAD Sputter Deposition R&D Product Development Automation Six Sigma Training Delivery SPC Engineering See 5+     See less ", "Summary I am currently seeking connections for a career in electrical engineering. Career interests include digital/analog hardware design/validation. Summary I am currently seeking connections for a career in electrical engineering. Career interests include digital/analog hardware design/validation. I am currently seeking connections for a career in electrical engineering. Career interests include digital/analog hardware design/validation. I am currently seeking connections for a career in electrical engineering. Career interests include digital/analog hardware design/validation. Experience Intern, Electrical Engineering Intel Corporation June 2015  – Present (3 months) Chandler, Arizona Intern, Intel Enterprise Power Solutions Intel Corporation May 2014  –  August 2014  (4 months) Chandler, Arizona Lab Assistant, Electrical Engineering Northern Arizona University August 2013  –  December 2013  (5 months) Flagstaff, Arizona Attended weekly labs and taught students circuit design, IC layout, and frequency/transient/DC simulation using Mentor Graphics EDA tools. Responsible for grading lab assignments outside of allocated lab time. Intern, Intel Enterprise Power Solutions Intel Corporation May 2013  –  August 2013  (4 months) Dupont, Washington Responsible for Design of Experiments focused on lossless measurement of processor transient load current. Key item of interest was to detect and measure peak repetitive transients and determine the frequency spectrum of transient load current. Board parasitics were calibrated using purpose built test tools, and measurements in time and frequency domains. Lecture Aide, Electrical Engineering Northern Arizona University August 2012  –  December 2012  (5 months) Flagstaff, Arizona Helped students in learning material presented in the introductory circuits course at Northern Arizona University through tutoring hours in the engineering building. Required to follow class material including lectures, exams, and homework. Intern, Electrical Engineering SPAWAR June 2012  –  August 2012  (3 months) San Diego, California Office of Naval Research - Naval Research Enterprise Internship Program \n \nWorked with the navigation branch dealing with signal processing and the implementation of various sensors into navigation systems. Spent time programming/running simulations in Matlab and analyzing different approaches to implementing Kalman filters. Intern, Electrical Engineering Intel Corporation June 2015  – Present (3 months) Chandler, Arizona Intern, Electrical Engineering Intel Corporation June 2015  – Present (3 months) Chandler, Arizona Intern, Intel Enterprise Power Solutions Intel Corporation May 2014  –  August 2014  (4 months) Chandler, Arizona Intern, Intel Enterprise Power Solutions Intel Corporation May 2014  –  August 2014  (4 months) Chandler, Arizona Lab Assistant, Electrical Engineering Northern Arizona University August 2013  –  December 2013  (5 months) Flagstaff, Arizona Attended weekly labs and taught students circuit design, IC layout, and frequency/transient/DC simulation using Mentor Graphics EDA tools. Responsible for grading lab assignments outside of allocated lab time. Lab Assistant, Electrical Engineering Northern Arizona University August 2013  –  December 2013  (5 months) Flagstaff, Arizona Attended weekly labs and taught students circuit design, IC layout, and frequency/transient/DC simulation using Mentor Graphics EDA tools. Responsible for grading lab assignments outside of allocated lab time. Intern, Intel Enterprise Power Solutions Intel Corporation May 2013  –  August 2013  (4 months) Dupont, Washington Responsible for Design of Experiments focused on lossless measurement of processor transient load current. Key item of interest was to detect and measure peak repetitive transients and determine the frequency spectrum of transient load current. Board parasitics were calibrated using purpose built test tools, and measurements in time and frequency domains. Intern, Intel Enterprise Power Solutions Intel Corporation May 2013  –  August 2013  (4 months) Dupont, Washington Responsible for Design of Experiments focused on lossless measurement of processor transient load current. Key item of interest was to detect and measure peak repetitive transients and determine the frequency spectrum of transient load current. Board parasitics were calibrated using purpose built test tools, and measurements in time and frequency domains. Lecture Aide, Electrical Engineering Northern Arizona University August 2012  –  December 2012  (5 months) Flagstaff, Arizona Helped students in learning material presented in the introductory circuits course at Northern Arizona University through tutoring hours in the engineering building. Required to follow class material including lectures, exams, and homework. Lecture Aide, Electrical Engineering Northern Arizona University August 2012  –  December 2012  (5 months) Flagstaff, Arizona Helped students in learning material presented in the introductory circuits course at Northern Arizona University through tutoring hours in the engineering building. Required to follow class material including lectures, exams, and homework. Intern, Electrical Engineering SPAWAR June 2012  –  August 2012  (3 months) San Diego, California Office of Naval Research - Naval Research Enterprise Internship Program \n \nWorked with the navigation branch dealing with signal processing and the implementation of various sensors into navigation systems. Spent time programming/running simulations in Matlab and analyzing different approaches to implementing Kalman filters. Intern, Electrical Engineering SPAWAR June 2012  –  August 2012  (3 months) San Diego, California Office of Naval Research - Naval Research Enterprise Internship Program \n \nWorked with the navigation branch dealing with signal processing and the implementation of various sensors into navigation systems. Spent time programming/running simulations in Matlab and analyzing different approaches to implementing Kalman filters. Languages   Skills Matlab Signal Processing Circuit Analysis C C++ CMOS Computer Architecture Mentor Graphics FPGA VHDL Simulations PowerPoint Labview Engineering JavaScript Skills  Matlab Signal Processing Circuit Analysis C C++ CMOS Computer Architecture Mentor Graphics FPGA VHDL Simulations PowerPoint Labview Engineering JavaScript Matlab Signal Processing Circuit Analysis C C++ CMOS Computer Architecture Mentor Graphics FPGA VHDL Simulations PowerPoint Labview Engineering JavaScript Matlab Signal Processing Circuit Analysis C C++ CMOS Computer Architecture Mentor Graphics FPGA VHDL Simulations PowerPoint Labview Engineering JavaScript Education University of California, San Diego Doctor of Philosophy (Ph.D.),  Electrical Engineering 2014  – 2019 Electronic Circuits and Systems Northern Arizona University Bachelor of Science (BS),  Electrical Engineering 2010  – 2014 San Marcos High School 2006  – 2010 University of California, San Diego Doctor of Philosophy (Ph.D.),  Electrical Engineering 2014  – 2019 Electronic Circuits and Systems University of California, San Diego Doctor of Philosophy (Ph.D.),  Electrical Engineering 2014  – 2019 Electronic Circuits and Systems University of California, San Diego Doctor of Philosophy (Ph.D.),  Electrical Engineering 2014  – 2019 Electronic Circuits and Systems Northern Arizona University Bachelor of Science (BS),  Electrical Engineering 2010  – 2014 Northern Arizona University Bachelor of Science (BS),  Electrical Engineering 2010  – 2014 Northern Arizona University Bachelor of Science (BS),  Electrical Engineering 2010  – 2014 San Marcos High School 2006  – 2010 San Marcos High School 2006  – 2010 San Marcos High School 2006  – 2010 Honors & Awards ", "Summary IT Operations management \nIT Engineering management \nArchitecture development \nManaged and led senior technical contributors in IT infrastructure and N-Tier applications development. Specialties:Security, IT Architecture, IT Operations, IT Engineering, Web Presence, IT Infrastructure Summary IT Operations management \nIT Engineering management \nArchitecture development \nManaged and led senior technical contributors in IT infrastructure and N-Tier applications development. Specialties:Security, IT Architecture, IT Operations, IT Engineering, Web Presence, IT Infrastructure IT Operations management \nIT Engineering management \nArchitecture development \nManaged and led senior technical contributors in IT infrastructure and N-Tier applications development. Specialties:Security, IT Architecture, IT Operations, IT Engineering, Web Presence, IT Infrastructure IT Operations management \nIT Engineering management \nArchitecture development \nManaged and led senior technical contributors in IT infrastructure and N-Tier applications development. Specialties:Security, IT Architecture, IT Operations, IT Engineering, Web Presence, IT Infrastructure Experience Director of Cloud Services Engineering Intel Corporation May 2014  – Present (1 year 4 months) Hillsboro, Oregon Director and second level manager of 60+ engineering organization responsible for devops engineering and architecture planning of private & hybrid cloud deployed globally for Intel Corp. includes Infrastructure Service (IaaS), Platform as a Service (PaaS), Database as a Service (DBaaS) systems globally deployed for Intel Corp. Director and Chief IT Architect Intel Corp. May 2004  –  May 2014  (10 years 1 month) Director and Second level architecture manager of approximately 60 person organization providing IT architecture leadership and planning to Intel corporation. IT Engineering Manager Intel Corporation March 1994  –  June 2002  (8 years 4 months) Held several IT engineering related engineering positions, including development of Intel's external web presence and e-business, and engineering director of Intel Online Systems, a venture business launced by Intel to establish Internet hosting services. Engineering Manager Tektronix, Inc January 1983  –  March 1994  (11 years 3 months) Director of Cloud Services Engineering Intel Corporation May 2014  – Present (1 year 4 months) Hillsboro, Oregon Director and second level manager of 60+ engineering organization responsible for devops engineering and architecture planning of private & hybrid cloud deployed globally for Intel Corp. includes Infrastructure Service (IaaS), Platform as a Service (PaaS), Database as a Service (DBaaS) systems globally deployed for Intel Corp. Director of Cloud Services Engineering Intel Corporation May 2014  – Present (1 year 4 months) Hillsboro, Oregon Director and second level manager of 60+ engineering organization responsible for devops engineering and architecture planning of private & hybrid cloud deployed globally for Intel Corp. includes Infrastructure Service (IaaS), Platform as a Service (PaaS), Database as a Service (DBaaS) systems globally deployed for Intel Corp. Director and Chief IT Architect Intel Corp. May 2004  –  May 2014  (10 years 1 month) Director and Second level architecture manager of approximately 60 person organization providing IT architecture leadership and planning to Intel corporation. Director and Chief IT Architect Intel Corp. May 2004  –  May 2014  (10 years 1 month) Director and Second level architecture manager of approximately 60 person organization providing IT architecture leadership and planning to Intel corporation. IT Engineering Manager Intel Corporation March 1994  –  June 2002  (8 years 4 months) Held several IT engineering related engineering positions, including development of Intel's external web presence and e-business, and engineering director of Intel Online Systems, a venture business launced by Intel to establish Internet hosting services. IT Engineering Manager Intel Corporation March 1994  –  June 2002  (8 years 4 months) Held several IT engineering related engineering positions, including development of Intel's external web presence and e-business, and engineering director of Intel Online Systems, a venture business launced by Intel to establish Internet hosting services. Engineering Manager Tektronix, Inc January 1983  –  March 1994  (11 years 3 months) Engineering Manager Tektronix, Inc January 1983  –  March 1994  (11 years 3 months) Education University of Nebraska-Lincoln BSEE,  Engineering 1978  – 1982 University of Nebraska-Lincoln BSEE,  Engineering 1978  – 1982 University of Nebraska-Lincoln BSEE,  Engineering 1978  – 1982 University of Nebraska-Lincoln BSEE,  Engineering 1978  – 1982 ", "Experience VP Engineering Intel Corporation VP Software Engineering Intel Corporation March 2011  – Present (4 years 6 months) San Francisco Bay Area Director of Engineering Technicolor July 2008  –  February 2011  (2 years 8 months) Indianapolis, Indiana Area Director of Engineering Comcast January 1999  –  June 2008  (9 years 6 months) VP Engineering Intel Corporation VP Engineering Intel Corporation VP Software Engineering Intel Corporation March 2011  – Present (4 years 6 months) San Francisco Bay Area VP Software Engineering Intel Corporation March 2011  – Present (4 years 6 months) San Francisco Bay Area Director of Engineering Technicolor July 2008  –  February 2011  (2 years 8 months) Indianapolis, Indiana Area Director of Engineering Technicolor July 2008  –  February 2011  (2 years 8 months) Indianapolis, Indiana Area Director of Engineering Comcast January 1999  –  June 2008  (9 years 6 months) Director of Engineering Comcast January 1999  –  June 2008  (9 years 6 months) Skills Software Engineering Engineering Software Development Embedded Systems Perl Linux Testing Product Management Wireless Cross-functional Team... Skills  Software Engineering Engineering Software Development Embedded Systems Perl Linux Testing Product Management Wireless Cross-functional Team... Software Engineering Engineering Software Development Embedded Systems Perl Linux Testing Product Management Wireless Cross-functional Team... Software Engineering Engineering Software Development Embedded Systems Perl Linux Testing Product Management Wireless Cross-functional Team... Education Michigan State University Bachelor of Science (B.S.),  Electrical and Electronics Engineering , A+ Michigan State University Bachelor of Science (B.S.),  Electrical and Electronics Engineering , A+ Michigan State University Bachelor of Science (B.S.),  Electrical and Electronics Engineering , A+ Michigan State University Bachelor of Science (B.S.),  Electrical and Electronics Engineering , A+ ", "Summary 20+ years experience in the semiconductor industry. Proven track record of building and leading high performance teams.Well versed in the entire development cycle of VLSI products. Demonstrated abilities in driving global teams on delivering complex ASIC products. \n \nPresently with Intel Corporation, Bangalore. \n \nPreviously led SOC program for Cypress involving short range wireless and programmable SOC. Previously managed the implementation team responsible for integration and physical design / timing closure of various chips. \n \nIn the past held various management and engineering roles in the VLSI industry - responsible for several tape outs of chips in varied fields such as digital video, mpeg, communication.  \n \nUnderstands the full IC design cycle in detail - starting from product architecture definition, through the various phases like RTL coding, synthesis, physical design, timing closure. Also has good understanding of how software and systems come together with silicon to make up the complete solution. \n \nSpecialties: \nFull IC design cycle - Architecture, RTL, synthesis, Physical Design, Timing closure, Power analysis, DFT \nExperience in building and managing large teams;  \nGood cross functional understanding across silicon, software, systems, product and test engineering disciplines Summary 20+ years experience in the semiconductor industry. Proven track record of building and leading high performance teams.Well versed in the entire development cycle of VLSI products. Demonstrated abilities in driving global teams on delivering complex ASIC products. \n \nPresently with Intel Corporation, Bangalore. \n \nPreviously led SOC program for Cypress involving short range wireless and programmable SOC. Previously managed the implementation team responsible for integration and physical design / timing closure of various chips. \n \nIn the past held various management and engineering roles in the VLSI industry - responsible for several tape outs of chips in varied fields such as digital video, mpeg, communication.  \n \nUnderstands the full IC design cycle in detail - starting from product architecture definition, through the various phases like RTL coding, synthesis, physical design, timing closure. Also has good understanding of how software and systems come together with silicon to make up the complete solution. \n \nSpecialties: \nFull IC design cycle - Architecture, RTL, synthesis, Physical Design, Timing closure, Power analysis, DFT \nExperience in building and managing large teams;  \nGood cross functional understanding across silicon, software, systems, product and test engineering disciplines 20+ years experience in the semiconductor industry. Proven track record of building and leading high performance teams.Well versed in the entire development cycle of VLSI products. Demonstrated abilities in driving global teams on delivering complex ASIC products. \n \nPresently with Intel Corporation, Bangalore. \n \nPreviously led SOC program for Cypress involving short range wireless and programmable SOC. Previously managed the implementation team responsible for integration and physical design / timing closure of various chips. \n \nIn the past held various management and engineering roles in the VLSI industry - responsible for several tape outs of chips in varied fields such as digital video, mpeg, communication.  \n \nUnderstands the full IC design cycle in detail - starting from product architecture definition, through the various phases like RTL coding, synthesis, physical design, timing closure. Also has good understanding of how software and systems come together with silicon to make up the complete solution. \n \nSpecialties: \nFull IC design cycle - Architecture, RTL, synthesis, Physical Design, Timing closure, Power analysis, DFT \nExperience in building and managing large teams;  \nGood cross functional understanding across silicon, software, systems, product and test engineering disciplines 20+ years experience in the semiconductor industry. Proven track record of building and leading high performance teams.Well versed in the entire development cycle of VLSI products. Demonstrated abilities in driving global teams on delivering complex ASIC products. \n \nPresently with Intel Corporation, Bangalore. \n \nPreviously led SOC program for Cypress involving short range wireless and programmable SOC. Previously managed the implementation team responsible for integration and physical design / timing closure of various chips. \n \nIn the past held various management and engineering roles in the VLSI industry - responsible for several tape outs of chips in varied fields such as digital video, mpeg, communication.  \n \nUnderstands the full IC design cycle in detail - starting from product architecture definition, through the various phases like RTL coding, synthesis, physical design, timing closure. Also has good understanding of how software and systems come together with silicon to make up the complete solution. \n \nSpecialties: \nFull IC design cycle - Architecture, RTL, synthesis, Physical Design, Timing closure, Power analysis, DFT \nExperience in building and managing large teams;  \nGood cross functional understanding across silicon, software, systems, product and test engineering disciplines Experience Director of Engineering Intel Corporation January 2015  – Present (8 months) Bengaluru Area, India Wearable and IoT Devices Design Engineering Director Cypress Semiconductors July 2008  –  January 2015  (6 years 7 months) VLSI Design, Programmable SOCs, ASIC development, project / program management Development Manager NXP December 2007  –  June 2008  (7 months) SOC Design group Director Conexant Systems February 2006  –  December 2007  (1 year 11 months) Manager Infineon Technologies 2004  –  2006  (2 years) Design Manager Texas Instruments 2003  –  2004  (1 year) Design Manager LSI Logic 2000  –  2003  (3 years) Design Engineer Thomson Consumer Electronics 1995  –  2000  (5 years) Director of Engineering Intel Corporation January 2015  – Present (8 months) Bengaluru Area, India Wearable and IoT Devices Director of Engineering Intel Corporation January 2015  – Present (8 months) Bengaluru Area, India Wearable and IoT Devices Design Engineering Director Cypress Semiconductors July 2008  –  January 2015  (6 years 7 months) VLSI Design, Programmable SOCs, ASIC development, project / program management Design Engineering Director Cypress Semiconductors July 2008  –  January 2015  (6 years 7 months) VLSI Design, Programmable SOCs, ASIC development, project / program management Development Manager NXP December 2007  –  June 2008  (7 months) SOC Design group Development Manager NXP December 2007  –  June 2008  (7 months) SOC Design group Director Conexant Systems February 2006  –  December 2007  (1 year 11 months) Director Conexant Systems February 2006  –  December 2007  (1 year 11 months) Manager Infineon Technologies 2004  –  2006  (2 years) Manager Infineon Technologies 2004  –  2006  (2 years) Design Manager Texas Instruments 2003  –  2004  (1 year) Design Manager Texas Instruments 2003  –  2004  (1 year) Design Manager LSI Logic 2000  –  2003  (3 years) Design Manager LSI Logic 2000  –  2003  (3 years) Design Engineer Thomson Consumer Electronics 1995  –  2000  (5 years) Design Engineer Thomson Consumer Electronics 1995  –  2000  (5 years) Skills SoC Electrical Engineering RTL design Semiconductors VLSI ASIC IC Design IC Physical Design Integrated Circuit... RTL coding Logic Synthesis Static Timing Analysis EDA Mixed Signal Timing Closure DFT Power Analysis Silicon Wireless Semiconductor Industry Verilog RTL Design See 8+     See less Skills  SoC Electrical Engineering RTL design Semiconductors VLSI ASIC IC Design IC Physical Design Integrated Circuit... RTL coding Logic Synthesis Static Timing Analysis EDA Mixed Signal Timing Closure DFT Power Analysis Silicon Wireless Semiconductor Industry Verilog RTL Design See 8+     See less SoC Electrical Engineering RTL design Semiconductors VLSI ASIC IC Design IC Physical Design Integrated Circuit... RTL coding Logic Synthesis Static Timing Analysis EDA Mixed Signal Timing Closure DFT Power Analysis Silicon Wireless Semiconductor Industry Verilog RTL Design See 8+     See less SoC Electrical Engineering RTL design Semiconductors VLSI ASIC IC Design IC Physical Design Integrated Circuit... RTL coding Logic Synthesis Static Timing Analysis EDA Mixed Signal Timing Closure DFT Power Analysis Silicon Wireless Semiconductor Industry Verilog RTL Design See 8+     See less Education Temple University M.S,  Electrical Engineering 1992  – 1995 Bharathiar University B.E,  Electrical and Electronics Engineering 1985  – 1989 Activities and Societies:  Kumaraguru College of Technology ,  Coimbatore Temple University M.S,  Electrical Engineering 1992  – 1995 Temple University M.S,  Electrical Engineering 1992  – 1995 Temple University M.S,  Electrical Engineering 1992  – 1995 Bharathiar University B.E,  Electrical and Electronics Engineering 1985  – 1989 Activities and Societies:  Kumaraguru College of Technology ,  Coimbatore Bharathiar University B.E,  Electrical and Electronics Engineering 1985  – 1989 Activities and Societies:  Kumaraguru College of Technology ,  Coimbatore Bharathiar University B.E,  Electrical and Electronics Engineering 1985  – 1989 Activities and Societies:  Kumaraguru College of Technology ,  Coimbatore ", "Experience Administrative Support TCG Software Engineering-Intel Corporation Intel Corporation January 2011  – Present (4 years 8 months) Administrative Support TCG Software Engineering-Intel Corporation Intel Corporation January 2011  – Present (4 years 8 months) Administrative Support TCG Software Engineering-Intel Corporation Intel Corporation January 2011  – Present (4 years 8 months) Skills Microsoft Excel Microsoft Word Training Microsoft Office Process Improvement Lean Manufacturing Manufacturing Management Team Leadership Leadership Customer Service Skills  Microsoft Excel Microsoft Word Training Microsoft Office Process Improvement Lean Manufacturing Manufacturing Management Team Leadership Leadership Customer Service Microsoft Excel Microsoft Word Training Microsoft Office Process Improvement Lean Manufacturing Manufacturing Management Team Leadership Leadership Customer Service Microsoft Excel Microsoft Word Training Microsoft Office Process Improvement Lean Manufacturing Manufacturing Management Team Leadership Leadership Customer Service ", "Summary Storage Engineering Director with nearly twenty years experience delivering a broad range of enterprise-class storage products including OS storage stacks, SAN Systems, HBAs, RAID Subsystems and embedded Disk Firmware. Strength in building and leading strong engineering teams in the US and offshore that use disciplined development processes to predictably deliver new storage technology with enterprise-class quality. Specialties:Storage Technology, Engineering process, offshore engineering, RAID, Data Services, SAN technology. Summary Storage Engineering Director with nearly twenty years experience delivering a broad range of enterprise-class storage products including OS storage stacks, SAN Systems, HBAs, RAID Subsystems and embedded Disk Firmware. Strength in building and leading strong engineering teams in the US and offshore that use disciplined development processes to predictably deliver new storage technology with enterprise-class quality. Specialties:Storage Technology, Engineering process, offshore engineering, RAID, Data Services, SAN technology. Storage Engineering Director with nearly twenty years experience delivering a broad range of enterprise-class storage products including OS storage stacks, SAN Systems, HBAs, RAID Subsystems and embedded Disk Firmware. Strength in building and leading strong engineering teams in the US and offshore that use disciplined development processes to predictably deliver new storage technology with enterprise-class quality. Specialties:Storage Technology, Engineering process, offshore engineering, RAID, Data Services, SAN technology. Storage Engineering Director with nearly twenty years experience delivering a broad range of enterprise-class storage products including OS storage stacks, SAN Systems, HBAs, RAID Subsystems and embedded Disk Firmware. Strength in building and leading strong engineering teams in the US and offshore that use disciplined development processes to predictably deliver new storage technology with enterprise-class quality. Specialties:Storage Technology, Engineering process, offshore engineering, RAID, Data Services, SAN technology. Experience Director, Storage SW Engineering Intel Corporation June 2010  – Present (5 years 3 months) Leading a Storage SW team based in Longmont, Colorado. Director, Advanced Development LSI Logic 2006  –  2007  (1 year) Managed a portfolio of Innovation Projects to support the long-term business goals of the Engenio Storage Group. Delivered technology for several valuable product enhancements, including the core technology later released as NetApp Dynamic Disk Pools. Director, Engineering Sun Microsystems December 1998  –  October 2006  (7 years 11 months) (2006) \nLed the vendor engineering team for Sun's OEM'd Volume and Mid-range arrays. Responsible for product quality, technical features, system integration, technical marketing, and vendor engineering relationship. \n \n(1998-2005) \nLed the team responsible for the Solaris storage network stack as well as storage drivers for non-Sun operating systems (Windows, Linux, AIX, etc.). Responsible for creating the strategy, alignment with executive staff and peer directors, staffing and managing the team in the US and offshore, instituting quality engineering processes, managing the budget, understanding customer needs and defining product requirements, technical marketing and pre and post-sales support, and interoperability with partner products. Manager, SW Development Adaptec April 1994  –  August 1998  (4 years 5 months) Staffed and led the team that delivered Adaptec's first two generations of external RAID controllers. Delivered the first generation in twelve months by using modern SW development processes and creating a modular architecture that enabled leveraging existing components and rapid development on prototype HW. Then delivered the second generation with industry-leading features and performance in another twelve months. \n \nProduced working drivers and firmware Adaptec's Serial Storage Architecture (SSA) HBA.  \n \nDeveloped a modular, resusable architecture for embedded disk firmware that enabled disk vendors to rapidly build controllers for new hard disk drives. Principal SW Engineer Digital Equipment Corp (DEC) July 1987  –  March 1993  (5 years 9 months) Developed one of the first RAID controllers for networked storage environments. Created and first implemented key portions of the firmware architecture that was later used in the EVA family. \n \nLead firmware engineer for DEC's first IDE disk drive. Used modern software engineering practices and detailed understanding of disk hardware design to deliver industry-leading performance in less than nine months. Director, Storage SW Engineering Intel Corporation June 2010  – Present (5 years 3 months) Leading a Storage SW team based in Longmont, Colorado. Director, Storage SW Engineering Intel Corporation June 2010  – Present (5 years 3 months) Leading a Storage SW team based in Longmont, Colorado. Director, Advanced Development LSI Logic 2006  –  2007  (1 year) Managed a portfolio of Innovation Projects to support the long-term business goals of the Engenio Storage Group. Delivered technology for several valuable product enhancements, including the core technology later released as NetApp Dynamic Disk Pools. Director, Advanced Development LSI Logic 2006  –  2007  (1 year) Managed a portfolio of Innovation Projects to support the long-term business goals of the Engenio Storage Group. Delivered technology for several valuable product enhancements, including the core technology later released as NetApp Dynamic Disk Pools. Director, Engineering Sun Microsystems December 1998  –  October 2006  (7 years 11 months) (2006) \nLed the vendor engineering team for Sun's OEM'd Volume and Mid-range arrays. Responsible for product quality, technical features, system integration, technical marketing, and vendor engineering relationship. \n \n(1998-2005) \nLed the team responsible for the Solaris storage network stack as well as storage drivers for non-Sun operating systems (Windows, Linux, AIX, etc.). Responsible for creating the strategy, alignment with executive staff and peer directors, staffing and managing the team in the US and offshore, instituting quality engineering processes, managing the budget, understanding customer needs and defining product requirements, technical marketing and pre and post-sales support, and interoperability with partner products. Director, Engineering Sun Microsystems December 1998  –  October 2006  (7 years 11 months) (2006) \nLed the vendor engineering team for Sun's OEM'd Volume and Mid-range arrays. Responsible for product quality, technical features, system integration, technical marketing, and vendor engineering relationship. \n \n(1998-2005) \nLed the team responsible for the Solaris storage network stack as well as storage drivers for non-Sun operating systems (Windows, Linux, AIX, etc.). Responsible for creating the strategy, alignment with executive staff and peer directors, staffing and managing the team in the US and offshore, instituting quality engineering processes, managing the budget, understanding customer needs and defining product requirements, technical marketing and pre and post-sales support, and interoperability with partner products. Manager, SW Development Adaptec April 1994  –  August 1998  (4 years 5 months) Staffed and led the team that delivered Adaptec's first two generations of external RAID controllers. Delivered the first generation in twelve months by using modern SW development processes and creating a modular architecture that enabled leveraging existing components and rapid development on prototype HW. Then delivered the second generation with industry-leading features and performance in another twelve months. \n \nProduced working drivers and firmware Adaptec's Serial Storage Architecture (SSA) HBA.  \n \nDeveloped a modular, resusable architecture for embedded disk firmware that enabled disk vendors to rapidly build controllers for new hard disk drives. Manager, SW Development Adaptec April 1994  –  August 1998  (4 years 5 months) Staffed and led the team that delivered Adaptec's first two generations of external RAID controllers. Delivered the first generation in twelve months by using modern SW development processes and creating a modular architecture that enabled leveraging existing components and rapid development on prototype HW. Then delivered the second generation with industry-leading features and performance in another twelve months. \n \nProduced working drivers and firmware Adaptec's Serial Storage Architecture (SSA) HBA.  \n \nDeveloped a modular, resusable architecture for embedded disk firmware that enabled disk vendors to rapidly build controllers for new hard disk drives. Principal SW Engineer Digital Equipment Corp (DEC) July 1987  –  March 1993  (5 years 9 months) Developed one of the first RAID controllers for networked storage environments. Created and first implemented key portions of the firmware architecture that was later used in the EVA family. \n \nLead firmware engineer for DEC's first IDE disk drive. Used modern software engineering practices and detailed understanding of disk hardware design to deliver industry-leading performance in less than nine months. Principal SW Engineer Digital Equipment Corp (DEC) July 1987  –  March 1993  (5 years 9 months) Developed one of the first RAID controllers for networked storage environments. Created and first implemented key portions of the firmware architecture that was later used in the EVA family. \n \nLead firmware engineer for DEC's first IDE disk drive. Used modern software engineering practices and detailed understanding of disk hardware design to deliver industry-leading performance in less than nine months. Skills Storage Device Drivers RAID Storage Area Networks File Systems Engineering Fibre Channel SCSI Linux Program Management Software Engineering Firmware Storage Architecture Cloud Computing Embedded Systems Operating Systems Product Management SAN Solaris NAS Distributed Systems NetApp Architecture Perl Unix See 10+     See less Skills  Storage Device Drivers RAID Storage Area Networks File Systems Engineering Fibre Channel SCSI Linux Program Management Software Engineering Firmware Storage Architecture Cloud Computing Embedded Systems Operating Systems Product Management SAN Solaris NAS Distributed Systems NetApp Architecture Perl Unix See 10+     See less Storage Device Drivers RAID Storage Area Networks File Systems Engineering Fibre Channel SCSI Linux Program Management Software Engineering Firmware Storage Architecture Cloud Computing Embedded Systems Operating Systems Product Management SAN Solaris NAS Distributed Systems NetApp Architecture Perl Unix See 10+     See less Storage Device Drivers RAID Storage Area Networks File Systems Engineering Fibre Channel SCSI Linux Program Management Software Engineering Firmware Storage Architecture Cloud Computing Embedded Systems Operating Systems Product Management SAN Solaris NAS Distributed Systems NetApp Architecture Perl Unix See 10+     See less Education University of Colorado Colorado Springs MS,  Computer Science 1985  – 1987 Thesis on Operating Systems and Distributed Computing Michigan State University BS,  Electrical Engineering 1979  – 1983 University of Colorado Colorado Springs MS,  Computer Science 1985  – 1987 Thesis on Operating Systems and Distributed Computing University of Colorado Colorado Springs MS,  Computer Science 1985  – 1987 Thesis on Operating Systems and Distributed Computing University of Colorado Colorado Springs MS,  Computer Science 1985  – 1987 Thesis on Operating Systems and Distributed Computing Michigan State University BS,  Electrical Engineering 1979  – 1983 Michigan State University BS,  Electrical Engineering 1979  – 1983 Michigan State University BS,  Electrical Engineering 1979  – 1983 Honors & Awards Additional Honors & Awards Inventor or co-inventor on over six patents relating to HBA, RAID hardware, and disk drive design. \n \nCompleted numerous business and management classes covering topics including Organization Design, Finance, Marketing, Sigma processes, and Leadership. Additional Honors & Awards Inventor or co-inventor on over six patents relating to HBA, RAID hardware, and disk drive design. \n \nCompleted numerous business and management classes covering topics including Organization Design, Finance, Marketing, Sigma processes, and Leadership. Additional Honors & Awards Inventor or co-inventor on over six patents relating to HBA, RAID hardware, and disk drive design. \n \nCompleted numerous business and management classes covering topics including Organization Design, Finance, Marketing, Sigma processes, and Leadership. Additional Honors & Awards Inventor or co-inventor on over six patents relating to HBA, RAID hardware, and disk drive design. \n \nCompleted numerous business and management classes covering topics including Organization Design, Finance, Marketing, Sigma processes, and Leadership. ", "Experience Engineering TD Manager Intel Corporation August 2013  – Present (2 years 1 month) Process Engineering - Intel Corporation Intel Corporation September 1996  – Present (19 years) Field Service Engineer Lam Research October 1993  –  August 1996  (2 years 11 months) Engineering TD Manager Intel Corporation August 2013  – Present (2 years 1 month) Engineering TD Manager Intel Corporation August 2013  – Present (2 years 1 month) Process Engineering - Intel Corporation Intel Corporation September 1996  – Present (19 years) Process Engineering - Intel Corporation Intel Corporation September 1996  – Present (19 years) Field Service Engineer Lam Research October 1993  –  August 1996  (2 years 11 months) Field Service Engineer Lam Research October 1993  –  August 1996  (2 years 11 months) Skills SoC Semiconductors Lean Manufacturing SPC JMP Design of Experiments Failure Analysis Process Engineering Skills  SoC Semiconductors Lean Manufacturing SPC JMP Design of Experiments Failure Analysis Process Engineering SoC Semiconductors Lean Manufacturing SPC JMP Design of Experiments Failure Analysis Process Engineering SoC Semiconductors Lean Manufacturing SPC JMP Design of Experiments Failure Analysis Process Engineering Education DeVry University 1991  – 1993 DeVry University 1991  – 1993 DeVry University 1991  – 1993 DeVry University 1991  – 1993 ", "Experience Director of Engineering Intel Corporation April 2014  – Present (1 year 5 months) Phoenix, Arizona Area Director of Software Development Intel Corporation October 2011  – Present (3 years 11 months) Chandler, AZ GoogleTV Engineering and Customer Program Manager Intel Corporation September 2009  –  October 2011  (2 years 2 months) Phoenix, Arizona Area, Tokyo Japan, Mountain View CA CE4100 (Sodaville) Program Manager Intel Corporation January 2008  –  June 2009  (1 year 6 months) Phoenix, Arizona Area Senior Product Manager Intel Corporation June 2004  –  January 2008  (3 years 8 months) Phoenix, Arizona Area Silicon Research Manager Intel Corporation January 2003  –  June 2004  (1 year 6 months) Washington State Software Engineering Manager Intel Corporation January 2001  –  January 2003  (2 years 1 month) Washington State Senior Software Architect Intel Corporation January 1999  –  January 2001  (2 years 1 month) Washington State Software Engineer Intel Corporation January 1996  –  January 1999  (3 years 1 month) Washington State Director of Engineering Intel Corporation April 2014  – Present (1 year 5 months) Phoenix, Arizona Area Director of Engineering Intel Corporation April 2014  – Present (1 year 5 months) Phoenix, Arizona Area Director of Software Development Intel Corporation October 2011  – Present (3 years 11 months) Chandler, AZ Director of Software Development Intel Corporation October 2011  – Present (3 years 11 months) Chandler, AZ GoogleTV Engineering and Customer Program Manager Intel Corporation September 2009  –  October 2011  (2 years 2 months) Phoenix, Arizona Area, Tokyo Japan, Mountain View CA GoogleTV Engineering and Customer Program Manager Intel Corporation September 2009  –  October 2011  (2 years 2 months) Phoenix, Arizona Area, Tokyo Japan, Mountain View CA CE4100 (Sodaville) Program Manager Intel Corporation January 2008  –  June 2009  (1 year 6 months) Phoenix, Arizona Area CE4100 (Sodaville) Program Manager Intel Corporation January 2008  –  June 2009  (1 year 6 months) Phoenix, Arizona Area Senior Product Manager Intel Corporation June 2004  –  January 2008  (3 years 8 months) Phoenix, Arizona Area Senior Product Manager Intel Corporation June 2004  –  January 2008  (3 years 8 months) Phoenix, Arizona Area Silicon Research Manager Intel Corporation January 2003  –  June 2004  (1 year 6 months) Washington State Silicon Research Manager Intel Corporation January 2003  –  June 2004  (1 year 6 months) Washington State Software Engineering Manager Intel Corporation January 2001  –  January 2003  (2 years 1 month) Washington State Software Engineering Manager Intel Corporation January 2001  –  January 2003  (2 years 1 month) Washington State Senior Software Architect Intel Corporation January 1999  –  January 2001  (2 years 1 month) Washington State Senior Software Architect Intel Corporation January 1999  –  January 2001  (2 years 1 month) Washington State Software Engineer Intel Corporation January 1996  –  January 1999  (3 years 1 month) Washington State Software Engineer Intel Corporation January 1996  –  January 1999  (3 years 1 month) Washington State Languages Spanish Limited working proficiency Japanese Elementary proficiency Spanish Limited working proficiency Japanese Elementary proficiency Spanish Limited working proficiency Japanese Elementary proficiency Limited working proficiency Elementary proficiency Skills Device Drivers Embedded Software Debugging Embedded Systems X86 Program Management Line Management Product Strategy OEM Customer Engagement Multinational C C++ Television video quality IO Wireless Networking PC Agile & Waterfall... Software Engineering Software Project... Linux Windows Operating Systems Intel Android Product Management Hardware Semiconductors Mobile Devices Processors Software Development Agile Methodologies Firmware Computer Architecture Video Digital Signal... Wireless Software Design ASIC System Architecture Microprocessors Hardware Architecture Unix Technical Leadership Cross-functional Team... SoC Object Oriented Design RTOS Scrum See 35+     See less Skills  Device Drivers Embedded Software Debugging Embedded Systems X86 Program Management Line Management Product Strategy OEM Customer Engagement Multinational C C++ Television video quality IO Wireless Networking PC Agile & Waterfall... Software Engineering Software Project... Linux Windows Operating Systems Intel Android Product Management Hardware Semiconductors Mobile Devices Processors Software Development Agile Methodologies Firmware Computer Architecture Video Digital Signal... Wireless Software Design ASIC System Architecture Microprocessors Hardware Architecture Unix Technical Leadership Cross-functional Team... SoC Object Oriented Design RTOS Scrum See 35+     See less Device Drivers Embedded Software Debugging Embedded Systems X86 Program Management Line Management Product Strategy OEM Customer Engagement Multinational C C++ Television video quality IO Wireless Networking PC Agile & Waterfall... Software Engineering Software Project... Linux Windows Operating Systems Intel Android Product Management Hardware Semiconductors Mobile Devices Processors Software Development Agile Methodologies Firmware Computer Architecture Video Digital Signal... Wireless Software Design ASIC System Architecture Microprocessors Hardware Architecture Unix Technical Leadership Cross-functional Team... SoC Object Oriented Design RTOS Scrum See 35+     See less Device Drivers Embedded Software Debugging Embedded Systems X86 Program Management Line Management Product Strategy OEM Customer Engagement Multinational C C++ Television video quality IO Wireless Networking PC Agile & Waterfall... Software Engineering Software Project... Linux Windows Operating Systems Intel Android Product Management Hardware Semiconductors Mobile Devices Processors Software Development Agile Methodologies Firmware Computer Architecture Video Digital Signal... Wireless Software Design ASIC System Architecture Microprocessors Hardware Architecture Unix Technical Leadership Cross-functional Team... SoC Object Oriented Design RTOS Scrum See 35+     See less Education Arizona State University - W. P. Carey School of Business MBA 2005  – 2007 University of Washington MS 1997  – 1999 Purdue University BS 1990  – 1995 Arizona State University - W. P. Carey School of Business MBA 2005  – 2007 Arizona State University - W. P. Carey School of Business MBA 2005  – 2007 Arizona State University - W. P. Carey School of Business MBA 2005  – 2007 University of Washington MS 1997  – 1999 University of Washington MS 1997  – 1999 University of Washington MS 1997  – 1999 Purdue University BS 1990  – 1995 Purdue University BS 1990  – 1995 Purdue University BS 1990  – 1995 Honors & Awards Additional Honors & Awards Intel Achievement Award, Group Recognition Awards, Division Recognition Awards, multiple patent submissions, 1 patent award. Additional Honors & Awards Intel Achievement Award, Group Recognition Awards, Division Recognition Awards, multiple patent submissions, 1 patent award. Additional Honors & Awards Intel Achievement Award, Group Recognition Awards, Division Recognition Awards, multiple patent submissions, 1 patent award. Additional Honors & Awards Intel Achievement Award, Group Recognition Awards, Division Recognition Awards, multiple patent submissions, 1 patent award. ", "Experience Director of Engineering Intel Corporation April 2013  – Present (2 years 5 months) Santa Clara Senior Engineering Manager - Product development Motorola Mobility September 2006  –  March 2013  (6 years 7 months) Libertyville, Illinois Led product development team in the design and execution of mobile and converged computing devices Broker Owner - COO Exit Realty January 2005  –  August 2006  (1 year 8 months) Delray Beach, Florida COO Exit Realty Destination \nBuilt and led 8 offices throughout Palm Beach County, Florida Mechanical Engineering Site Manager - Product Development Motorola January 1990  –  December 2004  (15 years) Boynton Beach, Florida Mechanical Engineering Site Manager responsible for telecommunication devices development for the global market Director of Engineering Intel Corporation April 2013  – Present (2 years 5 months) Santa Clara Director of Engineering Intel Corporation April 2013  – Present (2 years 5 months) Santa Clara Senior Engineering Manager - Product development Motorola Mobility September 2006  –  March 2013  (6 years 7 months) Libertyville, Illinois Led product development team in the design and execution of mobile and converged computing devices Senior Engineering Manager - Product development Motorola Mobility September 2006  –  March 2013  (6 years 7 months) Libertyville, Illinois Led product development team in the design and execution of mobile and converged computing devices Broker Owner - COO Exit Realty January 2005  –  August 2006  (1 year 8 months) Delray Beach, Florida COO Exit Realty Destination \nBuilt and led 8 offices throughout Palm Beach County, Florida Broker Owner - COO Exit Realty January 2005  –  August 2006  (1 year 8 months) Delray Beach, Florida COO Exit Realty Destination \nBuilt and led 8 offices throughout Palm Beach County, Florida Mechanical Engineering Site Manager - Product Development Motorola January 1990  –  December 2004  (15 years) Boynton Beach, Florida Mechanical Engineering Site Manager responsible for telecommunication devices development for the global market Mechanical Engineering Site Manager - Product Development Motorola January 1990  –  December 2004  (15 years) Boynton Beach, Florida Mechanical Engineering Site Manager responsible for telecommunication devices development for the global market Languages English Native or bilingual proficiency French Native or bilingual proficiency Arabic Native or bilingual proficiency English Native or bilingual proficiency French Native or bilingual proficiency Arabic Native or bilingual proficiency English Native or bilingual proficiency French Native or bilingual proficiency Arabic Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Product Development Wireless Engineering Management Mobile Devices Telecommunications Cross-functional Team... Product Management Six Sigma Engineering Product Lifecycle... Embedded Systems Integration Mobile Communications Testing Medical Devices Design for Manufacturing RF Semiconductors Consumer Electronics Electronics LTE Embedded Software Cellular Communications R&D System Architecture WiFi CDMA Systems Engineering Design of Experiments Mobile Technology PCB design FMEA GSM Product Planning Product Design Bluetooth Injection Molding Mechanical Engineering SPC PCB Design See 25+     See less Skills  Product Development Wireless Engineering Management Mobile Devices Telecommunications Cross-functional Team... Product Management Six Sigma Engineering Product Lifecycle... Embedded Systems Integration Mobile Communications Testing Medical Devices Design for Manufacturing RF Semiconductors Consumer Electronics Electronics LTE Embedded Software Cellular Communications R&D System Architecture WiFi CDMA Systems Engineering Design of Experiments Mobile Technology PCB design FMEA GSM Product Planning Product Design Bluetooth Injection Molding Mechanical Engineering SPC PCB Design See 25+     See less Product Development Wireless Engineering Management Mobile Devices Telecommunications Cross-functional Team... Product Management Six Sigma Engineering Product Lifecycle... Embedded Systems Integration Mobile Communications Testing Medical Devices Design for Manufacturing RF Semiconductors Consumer Electronics Electronics LTE Embedded Software Cellular Communications R&D System Architecture WiFi CDMA Systems Engineering Design of Experiments Mobile Technology PCB design FMEA GSM Product Planning Product Design Bluetooth Injection Molding Mechanical Engineering SPC PCB Design See 25+     See less Product Development Wireless Engineering Management Mobile Devices Telecommunications Cross-functional Team... Product Management Six Sigma Engineering Product Lifecycle... Embedded Systems Integration Mobile Communications Testing Medical Devices Design for Manufacturing RF Semiconductors Consumer Electronics Electronics LTE Embedded Software Cellular Communications R&D System Architecture WiFi CDMA Systems Engineering Design of Experiments Mobile Technology PCB design FMEA GSM Product Planning Product Design Bluetooth Injection Molding Mechanical Engineering SPC PCB Design See 25+     See less Education University of Miami MBA,  International Business 1998  – 2000 Georgia Institute of Technology BS,  Mechanical Engineering 1986  – 1989 Motorola University Over 1000 Hours Training,  Org Leadership , Management, Cross Functional Technical Education 1990  – 2012 Six Sigma Quality, Prod management, Prod Development, Manufacturing, Prod Execution, Project Management, Select Cross functional Engineering Topics University of Miami MBA,  International Business 1998  – 2000 University of Miami MBA,  International Business 1998  – 2000 University of Miami MBA,  International Business 1998  – 2000 Georgia Institute of Technology BS,  Mechanical Engineering 1986  – 1989 Georgia Institute of Technology BS,  Mechanical Engineering 1986  – 1989 Georgia Institute of Technology BS,  Mechanical Engineering 1986  – 1989 Motorola University Over 1000 Hours Training,  Org Leadership , Management, Cross Functional Technical Education 1990  – 2012 Six Sigma Quality, Prod management, Prod Development, Manufacturing, Prod Execution, Project Management, Select Cross functional Engineering Topics Motorola University Over 1000 Hours Training,  Org Leadership , Management, Cross Functional Technical Education 1990  – 2012 Six Sigma Quality, Prod management, Prod Development, Manufacturing, Prod Execution, Project Management, Select Cross functional Engineering Topics Motorola University Over 1000 Hours Training,  Org Leadership , Management, Cross Functional Technical Education 1990  – 2012 Six Sigma Quality, Prod management, Prod Development, Manufacturing, Prod Execution, Project Management, Select Cross functional Engineering Topics ", "Summary FORTUNE 100-500 companies to STARTUP, 7 INDUSTRIES, 4 COUNTRIES and 18+ years later - My passion to continuously learn and reinvent myself is still the same as when I started my career. I have thrived in BUILDING TEAMS and creating efficiencies in many different SOFTWARE, HARDWARE and SYSTEMS R&D and OPERATIONS environment. I sleep with my smart phone beside me since I am used to work with multiple different geographies and cultures. My intuition have matured over time to anticipate critical problem areas which can only come through real life experience in EDUCATION, MOBILE, AUTOMOTIVE, CONSUMER ELECTRONICS, COMPONENTS, SEMICONDUCTORS, and CAPITAL EQUIPMENT Industries; I have understood that my B.S. in Electronics Engineering and an MBA dwarfs the real life diverse experience at INTEL, KNO (startup acquired by INTEL), NVIDIA, LAM RESEARCH,PHILIPS (Semiconductors, Consumer Electronics,Components)& FORD MOTOR COMPANY. In today's world, I believe that a person exhibits the same characteristics in both professional and social life. My enthusiasm and energy extend into the social/cultural life in Silicon Valley. The Banerjee Family is known to be involved in campaigns to bring funds to local schools, being on advertisements, volunteering in non-profits and building communities for social causes. With a supporting family comprising of wife (Malini/Teacher), daughter (Anoushka/Elementary schooler) and a son (Shubham/Teen entrepreneur) - the excitement never ceases 24/7 and thats how I like it. Summary FORTUNE 100-500 companies to STARTUP, 7 INDUSTRIES, 4 COUNTRIES and 18+ years later - My passion to continuously learn and reinvent myself is still the same as when I started my career. I have thrived in BUILDING TEAMS and creating efficiencies in many different SOFTWARE, HARDWARE and SYSTEMS R&D and OPERATIONS environment. I sleep with my smart phone beside me since I am used to work with multiple different geographies and cultures. My intuition have matured over time to anticipate critical problem areas which can only come through real life experience in EDUCATION, MOBILE, AUTOMOTIVE, CONSUMER ELECTRONICS, COMPONENTS, SEMICONDUCTORS, and CAPITAL EQUIPMENT Industries; I have understood that my B.S. in Electronics Engineering and an MBA dwarfs the real life diverse experience at INTEL, KNO (startup acquired by INTEL), NVIDIA, LAM RESEARCH,PHILIPS (Semiconductors, Consumer Electronics,Components)& FORD MOTOR COMPANY. In today's world, I believe that a person exhibits the same characteristics in both professional and social life. My enthusiasm and energy extend into the social/cultural life in Silicon Valley. The Banerjee Family is known to be involved in campaigns to bring funds to local schools, being on advertisements, volunteering in non-profits and building communities for social causes. With a supporting family comprising of wife (Malini/Teacher), daughter (Anoushka/Elementary schooler) and a son (Shubham/Teen entrepreneur) - the excitement never ceases 24/7 and thats how I like it. FORTUNE 100-500 companies to STARTUP, 7 INDUSTRIES, 4 COUNTRIES and 18+ years later - My passion to continuously learn and reinvent myself is still the same as when I started my career. I have thrived in BUILDING TEAMS and creating efficiencies in many different SOFTWARE, HARDWARE and SYSTEMS R&D and OPERATIONS environment. I sleep with my smart phone beside me since I am used to work with multiple different geographies and cultures. My intuition have matured over time to anticipate critical problem areas which can only come through real life experience in EDUCATION, MOBILE, AUTOMOTIVE, CONSUMER ELECTRONICS, COMPONENTS, SEMICONDUCTORS, and CAPITAL EQUIPMENT Industries; I have understood that my B.S. in Electronics Engineering and an MBA dwarfs the real life diverse experience at INTEL, KNO (startup acquired by INTEL), NVIDIA, LAM RESEARCH,PHILIPS (Semiconductors, Consumer Electronics,Components)& FORD MOTOR COMPANY. In today's world, I believe that a person exhibits the same characteristics in both professional and social life. My enthusiasm and energy extend into the social/cultural life in Silicon Valley. The Banerjee Family is known to be involved in campaigns to bring funds to local schools, being on advertisements, volunteering in non-profits and building communities for social causes. With a supporting family comprising of wife (Malini/Teacher), daughter (Anoushka/Elementary schooler) and a son (Shubham/Teen entrepreneur) - the excitement never ceases 24/7 and thats how I like it. FORTUNE 100-500 companies to STARTUP, 7 INDUSTRIES, 4 COUNTRIES and 18+ years later - My passion to continuously learn and reinvent myself is still the same as when I started my career. I have thrived in BUILDING TEAMS and creating efficiencies in many different SOFTWARE, HARDWARE and SYSTEMS R&D and OPERATIONS environment. I sleep with my smart phone beside me since I am used to work with multiple different geographies and cultures. My intuition have matured over time to anticipate critical problem areas which can only come through real life experience in EDUCATION, MOBILE, AUTOMOTIVE, CONSUMER ELECTRONICS, COMPONENTS, SEMICONDUCTORS, and CAPITAL EQUIPMENT Industries; I have understood that my B.S. in Electronics Engineering and an MBA dwarfs the real life diverse experience at INTEL, KNO (startup acquired by INTEL), NVIDIA, LAM RESEARCH,PHILIPS (Semiconductors, Consumer Electronics,Components)& FORD MOTOR COMPANY. In today's world, I believe that a person exhibits the same characteristics in both professional and social life. My enthusiasm and energy extend into the social/cultural life in Silicon Valley. The Banerjee Family is known to be involved in campaigns to bring funds to local schools, being on advertisements, volunteering in non-profits and building communities for social causes. With a supporting family comprising of wife (Malini/Teacher), daughter (Anoushka/Elementary schooler) and a son (Shubham/Teen entrepreneur) - the excitement never ceases 24/7 and thats how I like it. Experience Head of Integration & Validation - Development and Engineering Intel Corporation April 2015  – Present (5 months) Santa Clara Member Board of Directors & Mentor/Coach Braigo Labs Inc. October 2014  – Present (11 months) Palo Alto Director of Integration & Validation - Intel Education Intel Corporation November 2013  –  March 2015  (1 year 5 months) Santa Clara Director of Software Operations Kno, Inc. (Acquired by Intel) September 2012  –  November 2013  (1 year 3 months) Santa Clara Sr. Software Engineering Manager - Android Platform System Software NVIDIA August 2011  –  September 2012  (1 year 2 months) Santa Clara Senior Manager - Technical Program Management for Mobile Software NVIDIA August 2010  –  August 2011  (1 year 1 month) Santa Clara Senior Manager - Technical Program Management for GPU Software NVIDIA September 2007  –  August 2010  (3 years) Senior Manager - Corporate Quality Systems LAM Research Corporation July 2006  –  September 2007  (1 year 3 months) Manager - Project & Quality Office for North America Philips Semiconductors January 2006  –  July 2006  (7 months) Quality Engineering Manager Philips Semiconductors - USA November 2004  –  December 2005  (1 year 2 months) Quality Manager Philips Semiconductors - Netherlands March 2003  –  November 2004  (1 year 9 months) Quality Consultant - Digital Networks NV Philips Industrial Activities - Belgium October 2000  –  March 2003  (2 years 6 months) Software Engineer/Work Group Leader(SPI) NV Philips Industrial Activities - Belgium October 1999  –  October 2000  (1 year 1 month) Software Design Engineer Ford Motor Company November 1998  –  October 1999  (1 year) Head of Integration & Validation - Development and Engineering Intel Corporation April 2015  – Present (5 months) Santa Clara Head of Integration & Validation - Development and Engineering Intel Corporation April 2015  – Present (5 months) Santa Clara Member Board of Directors & Mentor/Coach Braigo Labs Inc. October 2014  – Present (11 months) Palo Alto Member Board of Directors & Mentor/Coach Braigo Labs Inc. October 2014  – Present (11 months) Palo Alto Director of Integration & Validation - Intel Education Intel Corporation November 2013  –  March 2015  (1 year 5 months) Santa Clara Director of Integration & Validation - Intel Education Intel Corporation November 2013  –  March 2015  (1 year 5 months) Santa Clara Director of Software Operations Kno, Inc. (Acquired by Intel) September 2012  –  November 2013  (1 year 3 months) Santa Clara Director of Software Operations Kno, Inc. (Acquired by Intel) September 2012  –  November 2013  (1 year 3 months) Santa Clara Sr. Software Engineering Manager - Android Platform System Software NVIDIA August 2011  –  September 2012  (1 year 2 months) Santa Clara Sr. Software Engineering Manager - Android Platform System Software NVIDIA August 2011  –  September 2012  (1 year 2 months) Santa Clara Senior Manager - Technical Program Management for Mobile Software NVIDIA August 2010  –  August 2011  (1 year 1 month) Santa Clara Senior Manager - Technical Program Management for Mobile Software NVIDIA August 2010  –  August 2011  (1 year 1 month) Santa Clara Senior Manager - Technical Program Management for GPU Software NVIDIA September 2007  –  August 2010  (3 years) Senior Manager - Technical Program Management for GPU Software NVIDIA September 2007  –  August 2010  (3 years) Senior Manager - Corporate Quality Systems LAM Research Corporation July 2006  –  September 2007  (1 year 3 months) Senior Manager - Corporate Quality Systems LAM Research Corporation July 2006  –  September 2007  (1 year 3 months) Manager - Project & Quality Office for North America Philips Semiconductors January 2006  –  July 2006  (7 months) Manager - Project & Quality Office for North America Philips Semiconductors January 2006  –  July 2006  (7 months) Quality Engineering Manager Philips Semiconductors - USA November 2004  –  December 2005  (1 year 2 months) Quality Engineering Manager Philips Semiconductors - USA November 2004  –  December 2005  (1 year 2 months) Quality Manager Philips Semiconductors - Netherlands March 2003  –  November 2004  (1 year 9 months) Quality Manager Philips Semiconductors - Netherlands March 2003  –  November 2004  (1 year 9 months) Quality Consultant - Digital Networks NV Philips Industrial Activities - Belgium October 2000  –  March 2003  (2 years 6 months) Quality Consultant - Digital Networks NV Philips Industrial Activities - Belgium October 2000  –  March 2003  (2 years 6 months) Software Engineer/Work Group Leader(SPI) NV Philips Industrial Activities - Belgium October 1999  –  October 2000  (1 year 1 month) Software Engineer/Work Group Leader(SPI) NV Philips Industrial Activities - Belgium October 1999  –  October 2000  (1 year 1 month) Software Design Engineer Ford Motor Company November 1998  –  October 1999  (1 year) Software Design Engineer Ford Motor Company November 1998  –  October 1999  (1 year) Languages   Skills Product Management Program Management Cross-functional Team... Embedded Systems Product Development Software Engineering Software Development Software Project... Agile Methodologies Project Management Change Management Engineering Management Quality Assurance System Architecture Product Lifecycle... Integration Mobile Applications Leadership Management Device Drivers Community Building Community Organizing Community Outreach Non-profit Volunteer Business Process Strategy Linux Software Design Business Process... Android Embedded Software Testing Software Quality... Test Automation Debugging Software Documentation Firmware See 22+     See less Skills  Product Management Program Management Cross-functional Team... Embedded Systems Product Development Software Engineering Software Development Software Project... Agile Methodologies Project Management Change Management Engineering Management Quality Assurance System Architecture Product Lifecycle... Integration Mobile Applications Leadership Management Device Drivers Community Building Community Organizing Community Outreach Non-profit Volunteer Business Process Strategy Linux Software Design Business Process... Android Embedded Software Testing Software Quality... Test Automation Debugging Software Documentation Firmware See 22+     See less Product Management Program Management Cross-functional Team... Embedded Systems Product Development Software Engineering Software Development Software Project... Agile Methodologies Project Management Change Management Engineering Management Quality Assurance System Architecture Product Lifecycle... Integration Mobile Applications Leadership Management Device Drivers Community Building Community Organizing Community Outreach Non-profit Volunteer Business Process Strategy Linux Software Design Business Process... Android Embedded Software Testing Software Quality... Test Automation Debugging Software Documentation Firmware See 22+     See less Product Management Program Management Cross-functional Team... Embedded Systems Product Development Software Engineering Software Development Software Project... Agile Methodologies Project Management Change Management Engineering Management Quality Assurance System Architecture Product Lifecycle... Integration Mobile Applications Leadership Management Device Drivers Community Building Community Organizing Community Outreach Non-profit Volunteer Business Process Strategy Linux Software Design Business Process... Android Embedded Software Testing Software Quality... Test Automation Debugging Software Documentation Firmware See 22+     See less Honors & Awards ", "Summary Product development executive with 18+ years of global experience contributing to Cellular Mobile Devices and Platform Development with a track record of building teams that produces superior results. Shipped many Mobile devices with volume >1M+. Ability to think outside of the box in leveraging 3rd party technologies, partnerships to deliver solutions reliably on schedule. Expertise in implementing successful business development and operation initiatives that drive revenue growth, decrease costs and align technology with business goals. \n \nExperience developing and shipping high volume product based of Linux, Android and Windows Platform. Track record of successful product delivery both as an individual contributor and as a leader.  \n \nTrack record of being a change leader who can reach-out to both external and internal stakeholders / partners so as to commercialize the early stage technologies into product.  \n \nProduct management & leadership - proven track record in defining projects and delivering quality products on time. \n \nKellogg School of Management MBA in General Management with collateral studies in Finance, Strategy & Marketing. Summary Product development executive with 18+ years of global experience contributing to Cellular Mobile Devices and Platform Development with a track record of building teams that produces superior results. Shipped many Mobile devices with volume >1M+. Ability to think outside of the box in leveraging 3rd party technologies, partnerships to deliver solutions reliably on schedule. Expertise in implementing successful business development and operation initiatives that drive revenue growth, decrease costs and align technology with business goals. \n \nExperience developing and shipping high volume product based of Linux, Android and Windows Platform. Track record of successful product delivery both as an individual contributor and as a leader.  \n \nTrack record of being a change leader who can reach-out to both external and internal stakeholders / partners so as to commercialize the early stage technologies into product.  \n \nProduct management & leadership - proven track record in defining projects and delivering quality products on time. \n \nKellogg School of Management MBA in General Management with collateral studies in Finance, Strategy & Marketing. Product development executive with 18+ years of global experience contributing to Cellular Mobile Devices and Platform Development with a track record of building teams that produces superior results. Shipped many Mobile devices with volume >1M+. Ability to think outside of the box in leveraging 3rd party technologies, partnerships to deliver solutions reliably on schedule. Expertise in implementing successful business development and operation initiatives that drive revenue growth, decrease costs and align technology with business goals. \n \nExperience developing and shipping high volume product based of Linux, Android and Windows Platform. Track record of successful product delivery both as an individual contributor and as a leader.  \n \nTrack record of being a change leader who can reach-out to both external and internal stakeholders / partners so as to commercialize the early stage technologies into product.  \n \nProduct management & leadership - proven track record in defining projects and delivering quality products on time. \n \nKellogg School of Management MBA in General Management with collateral studies in Finance, Strategy & Marketing. Product development executive with 18+ years of global experience contributing to Cellular Mobile Devices and Platform Development with a track record of building teams that produces superior results. Shipped many Mobile devices with volume >1M+. Ability to think outside of the box in leveraging 3rd party technologies, partnerships to deliver solutions reliably on schedule. Expertise in implementing successful business development and operation initiatives that drive revenue growth, decrease costs and align technology with business goals. \n \nExperience developing and shipping high volume product based of Linux, Android and Windows Platform. Track record of successful product delivery both as an individual contributor and as a leader.  \n \nTrack record of being a change leader who can reach-out to both external and internal stakeholders / partners so as to commercialize the early stage technologies into product.  \n \nProduct management & leadership - proven track record in defining projects and delivering quality products on time. \n \nKellogg School of Management MBA in General Management with collateral studies in Finance, Strategy & Marketing. Experience Senior Director of Engineering, Intel Corporation Intel Corporation August 2011  – Present (4 years 1 month) Santa Clara,California Current - Leading a Organization to deliver IA based Chrome and Android Systems for Intel.  \nGoal - Introduce multiple compelling IA designs in 2014 on next generation IA SoC's. \n \nPast - Led a team of 150+ to deliver the Leadership Tablet: Baytrail got us leadership versus competition. The CPU & GFx performance increased by ~4x in the same overall system power & battery life. Several vectors of software engineering framework that helped execute 1 quarter pull-in from original POR to achieve Holiday Refresh’13 and three digit design wins. \nhttp://news.cnet.com/8301-1001_3-57572038-92/intels-best-shot-at-tablets-hasnt-arrived-yet/ \n \nShift Left on Software Engineering – Poster child for SW shift left. In Baytrail 85% code was complete before SOC PO and 100% feature complete by Alpha by leveraging RVP/AOB platform. This was enabled by fantastic collaboration across groups using multiple solutions : X0 platform, Emulation, CR4/Simics. This gave us the ability to support Windows, Android, and Chrome with the same platform. \nStrict focus & attention to schedule, dependencies and risk management in every domain. Every group knew what they had to do to hit this aggressive schedule. Systematically changed our traditional approaches in key areas to improve TTM. Director Product Engineering (Software) Foxconn International Holdings Limited June 2008  –  August 2011  (3 years 3 months) LAST PRODUCT: Wickedly cool Android tablet based of the Qualcomm Snapdragon chipset for a CDMA carrier in partnership with Google. Successfuly completed most of the IOT, CDMA test labs (CDG1/CDG2/SLATE/STIC etc) certifications. \n \nPart of the original team member facilitating FIH’s product development center in South Florida. Played a key role in creation of the Engineering Startup team for FIH in South Florida. \n \nLed strategic business partnership with Google, leading to FIH's Open Handset Alliance membership. \n \nBusiness development with Fortune 500 companies such as Intel, Sprint, ST Ericsson, Motorola, Broadcom, Windriver and Google. Distinguished Member Of Technical Staff Motorola Mobile Devices November 1999  –  May 2008  (8 years 7 months) Responsible for on-time product development, technical strategies, and new growth opportunities. Functions included strategy and innovation, R&D and IP development, ecosystem and partnerships, customer and industry thought leadership. \n \nArchitected the \"first color” product for Motorola in 2002. Key individual contributor responsible for hands on development of many modules and shipped to Sprint Nextel in 2002. \n \n\"First\" to ship the ATI Graphic chipset based product in Motorola in the year 2004. Oversaw integration of AHI Graphic API’s into the Graphic Framework & Multimedia Engine for Image Signal Processing. \n \nLed User Interface Taskforce across the Motorola Organization in 2007. Resulted in creation of declarative user interface framework and Intelligent Multimodal User Interaction shipping in 10M+ units. \n \nImplementation of various Mobile Web Technologies leveraging Google Data API's, Webkit, Web Services, JavaScript / HTML / CSS (\"AJAX\") experience. \n \nLed partnership with Openwave and Adobe. Oversaw and architected Integration of MIDAS shipping in 5M+ units. Integrated Adobe Flashlite shipping in 2M+ units.  \n \nLed integration of \"first\" Flashlite engine into OpenMAX IL framework for Windows Mobile Platform including support for VP6, Sorenson and H 264 Codec's. \n \nAt Motorola advocated moving to Android platform in 2008 and led many prototype efforts on the same in partnership with Google. \"First\" Android demo in MWC 2008. \n \nManaged and lead a team of direct and indirect report located in China, India and Japan on implementation of various ground breaking technology initiatives. \n \nAwards: \n\"Year 2002 Engineering Excellence Award\" \n\"VP for a Day Award\" for the year 2006. \n\"Innovator of the Month\" - April 2004 \nMultiple Design Excellence Award - 2002 through 2006 \nRecommended for Nomination for Science and Advisory Board Association at Motorola in 2007 \n \n2003 – 2007 Motorola Performance Evaluations: Consistently rated in top 10-20% Senior Consultant Lucas Automotive Electronics Limited, UK April 1998  –  October 1999  (1 year 7 months) Senior Director of Engineering, Intel Corporation Intel Corporation August 2011  – Present (4 years 1 month) Santa Clara,California Current - Leading a Organization to deliver IA based Chrome and Android Systems for Intel.  \nGoal - Introduce multiple compelling IA designs in 2014 on next generation IA SoC's. \n \nPast - Led a team of 150+ to deliver the Leadership Tablet: Baytrail got us leadership versus competition. The CPU & GFx performance increased by ~4x in the same overall system power & battery life. Several vectors of software engineering framework that helped execute 1 quarter pull-in from original POR to achieve Holiday Refresh’13 and three digit design wins. \nhttp://news.cnet.com/8301-1001_3-57572038-92/intels-best-shot-at-tablets-hasnt-arrived-yet/ \n \nShift Left on Software Engineering – Poster child for SW shift left. In Baytrail 85% code was complete before SOC PO and 100% feature complete by Alpha by leveraging RVP/AOB platform. This was enabled by fantastic collaboration across groups using multiple solutions : X0 platform, Emulation, CR4/Simics. This gave us the ability to support Windows, Android, and Chrome with the same platform. \nStrict focus & attention to schedule, dependencies and risk management in every domain. Every group knew what they had to do to hit this aggressive schedule. Systematically changed our traditional approaches in key areas to improve TTM. Senior Director of Engineering, Intel Corporation Intel Corporation August 2011  – Present (4 years 1 month) Santa Clara,California Current - Leading a Organization to deliver IA based Chrome and Android Systems for Intel.  \nGoal - Introduce multiple compelling IA designs in 2014 on next generation IA SoC's. \n \nPast - Led a team of 150+ to deliver the Leadership Tablet: Baytrail got us leadership versus competition. The CPU & GFx performance increased by ~4x in the same overall system power & battery life. Several vectors of software engineering framework that helped execute 1 quarter pull-in from original POR to achieve Holiday Refresh’13 and three digit design wins. \nhttp://news.cnet.com/8301-1001_3-57572038-92/intels-best-shot-at-tablets-hasnt-arrived-yet/ \n \nShift Left on Software Engineering – Poster child for SW shift left. In Baytrail 85% code was complete before SOC PO and 100% feature complete by Alpha by leveraging RVP/AOB platform. This was enabled by fantastic collaboration across groups using multiple solutions : X0 platform, Emulation, CR4/Simics. This gave us the ability to support Windows, Android, and Chrome with the same platform. \nStrict focus & attention to schedule, dependencies and risk management in every domain. Every group knew what they had to do to hit this aggressive schedule. Systematically changed our traditional approaches in key areas to improve TTM. Director Product Engineering (Software) Foxconn International Holdings Limited June 2008  –  August 2011  (3 years 3 months) LAST PRODUCT: Wickedly cool Android tablet based of the Qualcomm Snapdragon chipset for a CDMA carrier in partnership with Google. Successfuly completed most of the IOT, CDMA test labs (CDG1/CDG2/SLATE/STIC etc) certifications. \n \nPart of the original team member facilitating FIH’s product development center in South Florida. Played a key role in creation of the Engineering Startup team for FIH in South Florida. \n \nLed strategic business partnership with Google, leading to FIH's Open Handset Alliance membership. \n \nBusiness development with Fortune 500 companies such as Intel, Sprint, ST Ericsson, Motorola, Broadcom, Windriver and Google. Director Product Engineering (Software) Foxconn International Holdings Limited June 2008  –  August 2011  (3 years 3 months) LAST PRODUCT: Wickedly cool Android tablet based of the Qualcomm Snapdragon chipset for a CDMA carrier in partnership with Google. Successfuly completed most of the IOT, CDMA test labs (CDG1/CDG2/SLATE/STIC etc) certifications. \n \nPart of the original team member facilitating FIH’s product development center in South Florida. Played a key role in creation of the Engineering Startup team for FIH in South Florida. \n \nLed strategic business partnership with Google, leading to FIH's Open Handset Alliance membership. \n \nBusiness development with Fortune 500 companies such as Intel, Sprint, ST Ericsson, Motorola, Broadcom, Windriver and Google. Distinguished Member Of Technical Staff Motorola Mobile Devices November 1999  –  May 2008  (8 years 7 months) Responsible for on-time product development, technical strategies, and new growth opportunities. Functions included strategy and innovation, R&D and IP development, ecosystem and partnerships, customer and industry thought leadership. \n \nArchitected the \"first color” product for Motorola in 2002. Key individual contributor responsible for hands on development of many modules and shipped to Sprint Nextel in 2002. \n \n\"First\" to ship the ATI Graphic chipset based product in Motorola in the year 2004. Oversaw integration of AHI Graphic API’s into the Graphic Framework & Multimedia Engine for Image Signal Processing. \n \nLed User Interface Taskforce across the Motorola Organization in 2007. Resulted in creation of declarative user interface framework and Intelligent Multimodal User Interaction shipping in 10M+ units. \n \nImplementation of various Mobile Web Technologies leveraging Google Data API's, Webkit, Web Services, JavaScript / HTML / CSS (\"AJAX\") experience. \n \nLed partnership with Openwave and Adobe. Oversaw and architected Integration of MIDAS shipping in 5M+ units. Integrated Adobe Flashlite shipping in 2M+ units.  \n \nLed integration of \"first\" Flashlite engine into OpenMAX IL framework for Windows Mobile Platform including support for VP6, Sorenson and H 264 Codec's. \n \nAt Motorola advocated moving to Android platform in 2008 and led many prototype efforts on the same in partnership with Google. \"First\" Android demo in MWC 2008. \n \nManaged and lead a team of direct and indirect report located in China, India and Japan on implementation of various ground breaking technology initiatives. \n \nAwards: \n\"Year 2002 Engineering Excellence Award\" \n\"VP for a Day Award\" for the year 2006. \n\"Innovator of the Month\" - April 2004 \nMultiple Design Excellence Award - 2002 through 2006 \nRecommended for Nomination for Science and Advisory Board Association at Motorola in 2007 \n \n2003 – 2007 Motorola Performance Evaluations: Consistently rated in top 10-20% Distinguished Member Of Technical Staff Motorola Mobile Devices November 1999  –  May 2008  (8 years 7 months) Responsible for on-time product development, technical strategies, and new growth opportunities. Functions included strategy and innovation, R&D and IP development, ecosystem and partnerships, customer and industry thought leadership. \n \nArchitected the \"first color” product for Motorola in 2002. Key individual contributor responsible for hands on development of many modules and shipped to Sprint Nextel in 2002. \n \n\"First\" to ship the ATI Graphic chipset based product in Motorola in the year 2004. Oversaw integration of AHI Graphic API’s into the Graphic Framework & Multimedia Engine for Image Signal Processing. \n \nLed User Interface Taskforce across the Motorola Organization in 2007. Resulted in creation of declarative user interface framework and Intelligent Multimodal User Interaction shipping in 10M+ units. \n \nImplementation of various Mobile Web Technologies leveraging Google Data API's, Webkit, Web Services, JavaScript / HTML / CSS (\"AJAX\") experience. \n \nLed partnership with Openwave and Adobe. Oversaw and architected Integration of MIDAS shipping in 5M+ units. Integrated Adobe Flashlite shipping in 2M+ units.  \n \nLed integration of \"first\" Flashlite engine into OpenMAX IL framework for Windows Mobile Platform including support for VP6, Sorenson and H 264 Codec's. \n \nAt Motorola advocated moving to Android platform in 2008 and led many prototype efforts on the same in partnership with Google. \"First\" Android demo in MWC 2008. \n \nManaged and lead a team of direct and indirect report located in China, India and Japan on implementation of various ground breaking technology initiatives. \n \nAwards: \n\"Year 2002 Engineering Excellence Award\" \n\"VP for a Day Award\" for the year 2006. \n\"Innovator of the Month\" - April 2004 \nMultiple Design Excellence Award - 2002 through 2006 \nRecommended for Nomination for Science and Advisory Board Association at Motorola in 2007 \n \n2003 – 2007 Motorola Performance Evaluations: Consistently rated in top 10-20% Senior Consultant Lucas Automotive Electronics Limited, UK April 1998  –  October 1999  (1 year 7 months) Senior Consultant Lucas Automotive Electronics Limited, UK April 1998  –  October 1999  (1 year 7 months) Skills Android Linux RTOS Windows Mobile Qt Multimedia Technology Integration WebKit OpenMax OpenGL ES GTK Mobile Devices Software Engineering Product Management Mobile Technology Embedded Software Embedded Systems Integration Strategic Partnerships System Architecture Wireless Testing Agile Project Management Team Management Software Development See 10+     See less Skills  Android Linux RTOS Windows Mobile Qt Multimedia Technology Integration WebKit OpenMax OpenGL ES GTK Mobile Devices Software Engineering Product Management Mobile Technology Embedded Software Embedded Systems Integration Strategic Partnerships System Architecture Wireless Testing Agile Project Management Team Management Software Development See 10+     See less Android Linux RTOS Windows Mobile Qt Multimedia Technology Integration WebKit OpenMax OpenGL ES GTK Mobile Devices Software Engineering Product Management Mobile Technology Embedded Software Embedded Systems Integration Strategic Partnerships System Architecture Wireless Testing Agile Project Management Team Management Software Development See 10+     See less Android Linux RTOS Windows Mobile Qt Multimedia Technology Integration WebKit OpenMax OpenGL ES GTK Mobile Devices Software Engineering Product Management Mobile Technology Embedded Software Embedded Systems Integration Strategic Partnerships System Architecture Wireless Testing Agile Project Management Team Management Software Development See 10+     See less Education Northwestern University - Kellogg School of Management MBA,  General Management , Strategy, Finance 2009  – 2010 Bangalore University Bachelor of Engineering,  Electronics and Instrumentation Engineering Florida Atlantic University MS,  Computer Science Northwestern University - Kellogg School of Management MBA,  General Management , Strategy, Finance 2009  – 2010 Northwestern University - Kellogg School of Management MBA,  General Management , Strategy, Finance 2009  – 2010 Northwestern University - Kellogg School of Management MBA,  General Management , Strategy, Finance 2009  – 2010 Bangalore University Bachelor of Engineering,  Electronics and Instrumentation Engineering Bangalore University Bachelor of Engineering,  Electronics and Instrumentation Engineering Bangalore University Bachelor of Engineering,  Electronics and Instrumentation Engineering Florida Atlantic University MS,  Computer Science Florida Atlantic University MS,  Computer Science Florida Atlantic University MS,  Computer Science Honors & Awards Intel Achievement Award for developing the Valleyview SoC and Bay Trail platforms in record time Intel Corporation Intel Software Quality Award for Product delivery framework to accelerate software TTM for highly integrated SoCs Intel Corporation Additional Honors & Awards Patent Awarded - \nUS7616131 B2 - Method and apparatus for allowing runtime creation of a user experience for a wireless device. \nUS7500198 B2 - Method and apparatus for modifying skin and theme screens on a communication product. \nUS7269642 B2 - Customizing strings displayed upon a mobile device without altering core software of the device \nSYSTEM AND METHOD FOR INTERACTION OF A MOBILE STATION WITH AN INTERACTIVE VOICE RESPONSE SYSTEM \nIn addition, multiple patents being reviewed at USPTO. Intel Achievement Award for developing the Valleyview SoC and Bay Trail platforms in record time Intel Corporation Intel Achievement Award for developing the Valleyview SoC and Bay Trail platforms in record time Intel Corporation Intel Achievement Award for developing the Valleyview SoC and Bay Trail platforms in record time Intel Corporation Intel Software Quality Award for Product delivery framework to accelerate software TTM for highly integrated SoCs Intel Corporation Intel Software Quality Award for Product delivery framework to accelerate software TTM for highly integrated SoCs Intel Corporation Intel Software Quality Award for Product delivery framework to accelerate software TTM for highly integrated SoCs Intel Corporation Additional Honors & Awards Patent Awarded - \nUS7616131 B2 - Method and apparatus for allowing runtime creation of a user experience for a wireless device. \nUS7500198 B2 - Method and apparatus for modifying skin and theme screens on a communication product. \nUS7269642 B2 - Customizing strings displayed upon a mobile device without altering core software of the device \nSYSTEM AND METHOD FOR INTERACTION OF A MOBILE STATION WITH AN INTERACTIVE VOICE RESPONSE SYSTEM \nIn addition, multiple patents being reviewed at USPTO. Additional Honors & Awards Patent Awarded - \nUS7616131 B2 - Method and apparatus for allowing runtime creation of a user experience for a wireless device. \nUS7500198 B2 - Method and apparatus for modifying skin and theme screens on a communication product. \nUS7269642 B2 - Customizing strings displayed upon a mobile device without altering core software of the device \nSYSTEM AND METHOD FOR INTERACTION OF A MOBILE STATION WITH AN INTERACTIVE VOICE RESPONSE SYSTEM \nIn addition, multiple patents being reviewed at USPTO. Additional Honors & Awards Patent Awarded - \nUS7616131 B2 - Method and apparatus for allowing runtime creation of a user experience for a wireless device. \nUS7500198 B2 - Method and apparatus for modifying skin and theme screens on a communication product. \nUS7269642 B2 - Customizing strings displayed upon a mobile device without altering core software of the device \nSYSTEM AND METHOD FOR INTERACTION OF A MOBILE STATION WITH AN INTERACTIVE VOICE RESPONSE SYSTEM \nIn addition, multiple patents being reviewed at USPTO. ", "Summary Experienced SoC/ASIC Design verification professional \n-\t18+ years of verification experience ranging over IP blocks to multi-million gate designs.\t \n-\tVerification lead for many tapeouts, lead local US team and multi sites. \n-\tDesign, development and implementation of verification architecture and environment setup. \n-\tSystem, SoC/ASIC and block level functional verification development \n-\tAbility to understand functionality from a system/architecture level and develop test plan  \n-\tDevelopment of automated self-checking environment and created compliance test suite. \n-\tExperienced in low power verification for Mobile Soc \n-\tExcellent understanding of key industry standard protocols  \n-\tDeveloped custom bus functional Models and protocol monitors \n-\tAnalysis of functional test and code coverage \n-\tDeveloped HW/SW Co-simulation environments \n-\tDevelopment of IP cores such as USB Host controller and PCI Bridge \n \nSkills \n-\tLanguages: Verilog, Vera, Vhdl, C, C++, Perl, System Verilog \n-\tVerification Methodology: Vera, VMM, Specman, OVM, UVM \n-\tFPGA: Synplicity/Xilinx \n-\tSimulation: VCS, NC Sim, Modelsim \n-\tCo-simulations: Seamless, Palladium \n-\tProtocols: USB, SATA, PCI, DDR3,wUSB/UWB, Ethernet, Networking Protocols, Fiber Channel, AHB, AXI, APB Summary Experienced SoC/ASIC Design verification professional \n-\t18+ years of verification experience ranging over IP blocks to multi-million gate designs.\t \n-\tVerification lead for many tapeouts, lead local US team and multi sites. \n-\tDesign, development and implementation of verification architecture and environment setup. \n-\tSystem, SoC/ASIC and block level functional verification development \n-\tAbility to understand functionality from a system/architecture level and develop test plan  \n-\tDevelopment of automated self-checking environment and created compliance test suite. \n-\tExperienced in low power verification for Mobile Soc \n-\tExcellent understanding of key industry standard protocols  \n-\tDeveloped custom bus functional Models and protocol monitors \n-\tAnalysis of functional test and code coverage \n-\tDeveloped HW/SW Co-simulation environments \n-\tDevelopment of IP cores such as USB Host controller and PCI Bridge \n \nSkills \n-\tLanguages: Verilog, Vera, Vhdl, C, C++, Perl, System Verilog \n-\tVerification Methodology: Vera, VMM, Specman, OVM, UVM \n-\tFPGA: Synplicity/Xilinx \n-\tSimulation: VCS, NC Sim, Modelsim \n-\tCo-simulations: Seamless, Palladium \n-\tProtocols: USB, SATA, PCI, DDR3,wUSB/UWB, Ethernet, Networking Protocols, Fiber Channel, AHB, AXI, APB Experienced SoC/ASIC Design verification professional \n-\t18+ years of verification experience ranging over IP blocks to multi-million gate designs.\t \n-\tVerification lead for many tapeouts, lead local US team and multi sites. \n-\tDesign, development and implementation of verification architecture and environment setup. \n-\tSystem, SoC/ASIC and block level functional verification development \n-\tAbility to understand functionality from a system/architecture level and develop test plan  \n-\tDevelopment of automated self-checking environment and created compliance test suite. \n-\tExperienced in low power verification for Mobile Soc \n-\tExcellent understanding of key industry standard protocols  \n-\tDeveloped custom bus functional Models and protocol monitors \n-\tAnalysis of functional test and code coverage \n-\tDeveloped HW/SW Co-simulation environments \n-\tDevelopment of IP cores such as USB Host controller and PCI Bridge \n \nSkills \n-\tLanguages: Verilog, Vera, Vhdl, C, C++, Perl, System Verilog \n-\tVerification Methodology: Vera, VMM, Specman, OVM, UVM \n-\tFPGA: Synplicity/Xilinx \n-\tSimulation: VCS, NC Sim, Modelsim \n-\tCo-simulations: Seamless, Palladium \n-\tProtocols: USB, SATA, PCI, DDR3,wUSB/UWB, Ethernet, Networking Protocols, Fiber Channel, AHB, AXI, APB Experienced SoC/ASIC Design verification professional \n-\t18+ years of verification experience ranging over IP blocks to multi-million gate designs.\t \n-\tVerification lead for many tapeouts, lead local US team and multi sites. \n-\tDesign, development and implementation of verification architecture and environment setup. \n-\tSystem, SoC/ASIC and block level functional verification development \n-\tAbility to understand functionality from a system/architecture level and develop test plan  \n-\tDevelopment of automated self-checking environment and created compliance test suite. \n-\tExperienced in low power verification for Mobile Soc \n-\tExcellent understanding of key industry standard protocols  \n-\tDeveloped custom bus functional Models and protocol monitors \n-\tAnalysis of functional test and code coverage \n-\tDeveloped HW/SW Co-simulation environments \n-\tDevelopment of IP cores such as USB Host controller and PCI Bridge \n \nSkills \n-\tLanguages: Verilog, Vera, Vhdl, C, C++, Perl, System Verilog \n-\tVerification Methodology: Vera, VMM, Specman, OVM, UVM \n-\tFPGA: Synplicity/Xilinx \n-\tSimulation: VCS, NC Sim, Modelsim \n-\tCo-simulations: Seamless, Palladium \n-\tProtocols: USB, SATA, PCI, DDR3,wUSB/UWB, Ethernet, Networking Protocols, Fiber Channel, AHB, AXI, APB Experience Hardware Engineering @ Intel Intel Corporation November 2014  – Present (10 months) San Francisco Bay Area Techincal Leader Cisco Systems October 2012  –  October 2014  (2 years 1 month) San Francisco Bay Area Principal Engineer -Logic Verification Rambus November 2011  –  October 2012  (1 year) Sunnyvale, CA, USA Senior Design Verification Engineer Apple November 2008  –  October 2011  (3 years) Cupertino, CA Staff Engineer Qualcomm October 2007  –  November 2008  (1 year 2 months) Santa Clara, CA Senior Verification Engineer Texas Instruments June 2005  –  October 2007  (2 years 5 months) Sunnyvale, CA Senior Member Techinal Staff CMOS CHIPS/PERFECTUS February 2001  –  June 2005  (4 years 5 months) Santa Clara, CA, USA Software Engineer L&T Information Technology Ltd November 1999  –  February 2001  (1 year 4 months) Mysuru Area, India ASIC Engineer Qualcore Logic pvt Ltd April 1998  –  October 1999  (1 year 7 months) Hyderabad Area, India Hardware Engineering @ Intel Intel Corporation November 2014  – Present (10 months) San Francisco Bay Area Hardware Engineering @ Intel Intel Corporation November 2014  – Present (10 months) San Francisco Bay Area Techincal Leader Cisco Systems October 2012  –  October 2014  (2 years 1 month) San Francisco Bay Area Techincal Leader Cisco Systems October 2012  –  October 2014  (2 years 1 month) San Francisco Bay Area Principal Engineer -Logic Verification Rambus November 2011  –  October 2012  (1 year) Sunnyvale, CA, USA Principal Engineer -Logic Verification Rambus November 2011  –  October 2012  (1 year) Sunnyvale, CA, USA Senior Design Verification Engineer Apple November 2008  –  October 2011  (3 years) Cupertino, CA Senior Design Verification Engineer Apple November 2008  –  October 2011  (3 years) Cupertino, CA Staff Engineer Qualcomm October 2007  –  November 2008  (1 year 2 months) Santa Clara, CA Staff Engineer Qualcomm October 2007  –  November 2008  (1 year 2 months) Santa Clara, CA Senior Verification Engineer Texas Instruments June 2005  –  October 2007  (2 years 5 months) Sunnyvale, CA Senior Verification Engineer Texas Instruments June 2005  –  October 2007  (2 years 5 months) Sunnyvale, CA Senior Member Techinal Staff CMOS CHIPS/PERFECTUS February 2001  –  June 2005  (4 years 5 months) Santa Clara, CA, USA Senior Member Techinal Staff CMOS CHIPS/PERFECTUS February 2001  –  June 2005  (4 years 5 months) Santa Clara, CA, USA Software Engineer L&T Information Technology Ltd November 1999  –  February 2001  (1 year 4 months) Mysuru Area, India Software Engineer L&T Information Technology Ltd November 1999  –  February 2001  (1 year 4 months) Mysuru Area, India ASIC Engineer Qualcore Logic pvt Ltd April 1998  –  October 1999  (1 year 7 months) Hyderabad Area, India ASIC Engineer Qualcore Logic pvt Ltd April 1998  –  October 1999  (1 year 7 months) Hyderabad Area, India Skills SoC Verilog RTL design ASIC USB IP SystemVerilog ModelSim Functional Verification VCS VLSI AHB Hardware Design ARM Simulation VMM C Specman C++ Shell Scripting NC-Verilog Semiconductors Ethernet NCSim Linux Scripting Digital Design Debugging Hardware Architecture Integrated Circuit... Logic Synthesis EDA Open Verification... UVM PCIe FPGA TCL Static Timing Analysis Formal Verification Processors Logic Design RTL Design Simulations AMBA AHB See 29+     See less Skills  SoC Verilog RTL design ASIC USB IP SystemVerilog ModelSim Functional Verification VCS VLSI AHB Hardware Design ARM Simulation VMM C Specman C++ Shell Scripting NC-Verilog Semiconductors Ethernet NCSim Linux Scripting Digital Design Debugging Hardware Architecture Integrated Circuit... Logic Synthesis EDA Open Verification... UVM PCIe FPGA TCL Static Timing Analysis Formal Verification Processors Logic Design RTL Design Simulations AMBA AHB See 29+     See less SoC Verilog RTL design ASIC USB IP SystemVerilog ModelSim Functional Verification VCS VLSI AHB Hardware Design ARM Simulation VMM C Specman C++ Shell Scripting NC-Verilog Semiconductors Ethernet NCSim Linux Scripting Digital Design Debugging Hardware Architecture Integrated Circuit... Logic Synthesis EDA Open Verification... UVM PCIe FPGA TCL Static Timing Analysis Formal Verification Processors Logic Design RTL Design Simulations AMBA AHB See 29+     See less SoC Verilog RTL design ASIC USB IP SystemVerilog ModelSim Functional Verification VCS VLSI AHB Hardware Design ARM Simulation VMM C Specman C++ Shell Scripting NC-Verilog Semiconductors Ethernet NCSim Linux Scripting Digital Design Debugging Hardware Architecture Integrated Circuit... Logic Synthesis EDA Open Verification... UVM PCIe FPGA TCL Static Timing Analysis Formal Verification Processors Logic Design RTL Design Simulations AMBA AHB See 29+     See less Education Osmania University BSEE 1994  – 1997 Osmania University BSEE 1994  – 1997 Osmania University BSEE 1994  – 1997 Osmania University BSEE 1994  – 1997 ", "Summary Phone and tablet software enabling programs for mobile Android and Windows software \nTeam Management: direct and matrix-managed teams, coaching \nAdvanced product line development in multiple fields: \n* Smartphone product design \n* Semiconductor R&D and new product introduction \n* Embdeeded software development tools, debuggers, developer kits \n* Aerospace embedded systems design, integration and flight test \nExternal vendor partnerships \nNew business initiatives. Merger and Acquisitions \nInternational customers \nExperienced corporate trainer, public speaker \nDoD Secret clearance & COMSEC (inactive) \n \nSpecialties: Managing complex projects across a world-wide team \nTeam management -- goal setting and coaching \nThird party vendor management \nMerger and Acquisition experience, including on-site relocation \nExcellent public speaking skills \nRegistered Professional Engineer Summary Phone and tablet software enabling programs for mobile Android and Windows software \nTeam Management: direct and matrix-managed teams, coaching \nAdvanced product line development in multiple fields: \n* Smartphone product design \n* Semiconductor R&D and new product introduction \n* Embdeeded software development tools, debuggers, developer kits \n* Aerospace embedded systems design, integration and flight test \nExternal vendor partnerships \nNew business initiatives. Merger and Acquisitions \nInternational customers \nExperienced corporate trainer, public speaker \nDoD Secret clearance & COMSEC (inactive) \n \nSpecialties: Managing complex projects across a world-wide team \nTeam management -- goal setting and coaching \nThird party vendor management \nMerger and Acquisition experience, including on-site relocation \nExcellent public speaking skills \nRegistered Professional Engineer Phone and tablet software enabling programs for mobile Android and Windows software \nTeam Management: direct and matrix-managed teams, coaching \nAdvanced product line development in multiple fields: \n* Smartphone product design \n* Semiconductor R&D and new product introduction \n* Embdeeded software development tools, debuggers, developer kits \n* Aerospace embedded systems design, integration and flight test \nExternal vendor partnerships \nNew business initiatives. Merger and Acquisitions \nInternational customers \nExperienced corporate trainer, public speaker \nDoD Secret clearance & COMSEC (inactive) \n \nSpecialties: Managing complex projects across a world-wide team \nTeam management -- goal setting and coaching \nThird party vendor management \nMerger and Acquisition experience, including on-site relocation \nExcellent public speaking skills \nRegistered Professional Engineer Phone and tablet software enabling programs for mobile Android and Windows software \nTeam Management: direct and matrix-managed teams, coaching \nAdvanced product line development in multiple fields: \n* Smartphone product design \n* Semiconductor R&D and new product introduction \n* Embdeeded software development tools, debuggers, developer kits \n* Aerospace embedded systems design, integration and flight test \nExternal vendor partnerships \nNew business initiatives. Merger and Acquisitions \nInternational customers \nExperienced corporate trainer, public speaker \nDoD Secret clearance & COMSEC (inactive) \n \nSpecialties: Managing complex projects across a world-wide team \nTeam management -- goal setting and coaching \nThird party vendor management \nMerger and Acquisition experience, including on-site relocation \nExcellent public speaking skills \nRegistered Professional Engineer Experience Director, Personal Form Factor Engineering Intel Corporation September 2011  – Present (4 years) Chandler, AZ Managing a team of Application Engineers and specialists who work as trusted technical advisors with software vendors and OEMs in the tablet and smartphone industries. We employ d.thinking techniques to identify and deliver leading edge user-experience proof-of-concepts and prototype applications, and we analyze and optimize Android and Windows software with our customers. Engineering Manager Intel Corporation August 2008  –  September 2011  (3 years 2 months) Wireless Communications Product Line Manager Marvell November 2006  –  December 2007  (1 year 2 months) Program Manager, New Business, Operations Intel Corporation August 1991  –  November 2006  (15 years 4 months) Chandler, AZ Systems Engineering Manager McDonnell Douglas Corporation January 1979  –  August 1991  (12 years 8 months) Director, Personal Form Factor Engineering Intel Corporation September 2011  – Present (4 years) Chandler, AZ Managing a team of Application Engineers and specialists who work as trusted technical advisors with software vendors and OEMs in the tablet and smartphone industries. We employ d.thinking techniques to identify and deliver leading edge user-experience proof-of-concepts and prototype applications, and we analyze and optimize Android and Windows software with our customers. Director, Personal Form Factor Engineering Intel Corporation September 2011  – Present (4 years) Chandler, AZ Managing a team of Application Engineers and specialists who work as trusted technical advisors with software vendors and OEMs in the tablet and smartphone industries. We employ d.thinking techniques to identify and deliver leading edge user-experience proof-of-concepts and prototype applications, and we analyze and optimize Android and Windows software with our customers. Engineering Manager Intel Corporation August 2008  –  September 2011  (3 years 2 months) Engineering Manager Intel Corporation August 2008  –  September 2011  (3 years 2 months) Wireless Communications Product Line Manager Marvell November 2006  –  December 2007  (1 year 2 months) Wireless Communications Product Line Manager Marvell November 2006  –  December 2007  (1 year 2 months) Program Manager, New Business, Operations Intel Corporation August 1991  –  November 2006  (15 years 4 months) Chandler, AZ Program Manager, New Business, Operations Intel Corporation August 1991  –  November 2006  (15 years 4 months) Chandler, AZ Systems Engineering Manager McDonnell Douglas Corporation January 1979  –  August 1991  (12 years 8 months) Systems Engineering Manager McDonnell Douglas Corporation January 1979  –  August 1991  (12 years 8 months) Skills Embedded Systems Semiconductors Wireless Product Development Team Management Integration Program Management Public Speaking Hardware Architecture Electronics Mergers & Acquisitions Systems Engineering Management IC Processors Leadership Project Management Firmware SoC R&D Debugging Engineering Mergers Mixed Signal See 9+     See less Skills  Embedded Systems Semiconductors Wireless Product Development Team Management Integration Program Management Public Speaking Hardware Architecture Electronics Mergers & Acquisitions Systems Engineering Management IC Processors Leadership Project Management Firmware SoC R&D Debugging Engineering Mergers Mixed Signal See 9+     See less Embedded Systems Semiconductors Wireless Product Development Team Management Integration Program Management Public Speaking Hardware Architecture Electronics Mergers & Acquisitions Systems Engineering Management IC Processors Leadership Project Management Firmware SoC R&D Debugging Engineering Mergers Mixed Signal See 9+     See less Embedded Systems Semiconductors Wireless Product Development Team Management Integration Program Management Public Speaking Hardware Architecture Electronics Mergers & Acquisitions Systems Engineering Management IC Processors Leadership Project Management Firmware SoC R&D Debugging Engineering Mergers Mixed Signal See 9+     See less Education Washington University in St. Louis MSEE,  Computer Architecture ,  Artificial Intelligence 1998  – 1999 Masters in Electrical Engineering, Graduate Certificate in Artificial Intelligence Activities and Societies:  Artificial Intelligence cohort University of Michigan BSEE,  Digital design , microprocessors, real-time programming 1974  – 1978 Washington University in St. Louis MSEE,  Computer Architecture ,  Artificial Intelligence 1998  – 1999 Masters in Electrical Engineering, Graduate Certificate in Artificial Intelligence Activities and Societies:  Artificial Intelligence cohort Washington University in St. Louis MSEE,  Computer Architecture ,  Artificial Intelligence 1998  – 1999 Masters in Electrical Engineering, Graduate Certificate in Artificial Intelligence Activities and Societies:  Artificial Intelligence cohort Washington University in St. Louis MSEE,  Computer Architecture ,  Artificial Intelligence 1998  – 1999 Masters in Electrical Engineering, Graduate Certificate in Artificial Intelligence Activities and Societies:  Artificial Intelligence cohort University of Michigan BSEE,  Digital design , microprocessors, real-time programming 1974  – 1978 University of Michigan BSEE,  Digital design , microprocessors, real-time programming 1974  – 1978 University of Michigan BSEE,  Digital design , microprocessors, real-time programming 1974  – 1978 ", "Experience Director, Product & Test Engineering Intel Corporation September 2011  – Present (4 years) Calabasas, CA Director, Product and Test Fulcrum Microsystems June 2001  –  September 2011  (10 years 4 months) Director Product, Test Engineering Vitesse Semiconductor March 1990  –  May 2001  (11 years 3 months) Director, Product & Test Engineering Intel Corporation September 2011  – Present (4 years) Calabasas, CA Director, Product & Test Engineering Intel Corporation September 2011  – Present (4 years) Calabasas, CA Director, Product and Test Fulcrum Microsystems June 2001  –  September 2011  (10 years 4 months) Director, Product and Test Fulcrum Microsystems June 2001  –  September 2011  (10 years 4 months) Director Product, Test Engineering Vitesse Semiconductor March 1990  –  May 2001  (11 years 3 months) Director Product, Test Engineering Vitesse Semiconductor March 1990  –  May 2001  (11 years 3 months) Skills Semiconductors IC Testing Electrical Engineering Engineering Test Engineering Design for Manufacturing ASIC SoC Silicon Mixed Signal Product Management Product Marketing Analog Embedded Systems Cross-functional Team... Verilog Hardware Architecture Signal Integrity Semiconductor Industry Physics See 6+     See less Skills  Semiconductors IC Testing Electrical Engineering Engineering Test Engineering Design for Manufacturing ASIC SoC Silicon Mixed Signal Product Management Product Marketing Analog Embedded Systems Cross-functional Team... Verilog Hardware Architecture Signal Integrity Semiconductor Industry Physics See 6+     See less Semiconductors IC Testing Electrical Engineering Engineering Test Engineering Design for Manufacturing ASIC SoC Silicon Mixed Signal Product Management Product Marketing Analog Embedded Systems Cross-functional Team... Verilog Hardware Architecture Signal Integrity Semiconductor Industry Physics See 6+     See less Semiconductors IC Testing Electrical Engineering Engineering Test Engineering Design for Manufacturing ASIC SoC Silicon Mixed Signal Product Management Product Marketing Analog Embedded Systems Cross-functional Team... Verilog Hardware Architecture Signal Integrity Semiconductor Industry Physics See 6+     See less Education UCLA Anderson School of Management MBA 1993  – 1995 University of California, Los Angeles BS 1978  – 1982 UCLA Anderson School of Management MBA 1993  – 1995 UCLA Anderson School of Management MBA 1993  – 1995 UCLA Anderson School of Management MBA 1993  – 1995 University of California, Los Angeles BS 1978  – 1982 University of California, Los Angeles BS 1978  – 1982 University of California, Los Angeles BS 1978  – 1982 ", "Experience Director of Channel Products Engineering Intel Corporation October 1998  – Present (16 years 11 months) Sr Thermal/Mechanical Eng Intel Corporation October 1992  –  October 1998  (6 years 1 month) Folsom, CA Assembly Engineering Mgr Unisys Corporation October 1987  –  October 1992  (5 years 1 month) Rancho Bernardo, CA Director of Channel Products Engineering Intel Corporation October 1998  – Present (16 years 11 months) Director of Channel Products Engineering Intel Corporation October 1998  – Present (16 years 11 months) Sr Thermal/Mechanical Eng Intel Corporation October 1992  –  October 1998  (6 years 1 month) Folsom, CA Sr Thermal/Mechanical Eng Intel Corporation October 1992  –  October 1998  (6 years 1 month) Folsom, CA Assembly Engineering Mgr Unisys Corporation October 1987  –  October 1992  (5 years 1 month) Rancho Bernardo, CA Assembly Engineering Mgr Unisys Corporation October 1987  –  October 1992  (5 years 1 month) Rancho Bernardo, CA Skills Cross-functional Team... Strategic Influence Program Management Intel Engineering Thermal Engineering Semiconductors Engineering Management Product Engineering Manufacturing Process Engineering R&D Design for Manufacturing Product Lifecycle... Product Management Skills  Cross-functional Team... Strategic Influence Program Management Intel Engineering Thermal Engineering Semiconductors Engineering Management Product Engineering Manufacturing Process Engineering R&D Design for Manufacturing Product Lifecycle... Product Management Cross-functional Team... Strategic Influence Program Management Intel Engineering Thermal Engineering Semiconductors Engineering Management Product Engineering Manufacturing Process Engineering R&D Design for Manufacturing Product Lifecycle... Product Management Cross-functional Team... Strategic Influence Program Management Intel Engineering Thermal Engineering Semiconductors Engineering Management Product Engineering Manufacturing Process Engineering R&D Design for Manufacturing Product Lifecycle... Product Management Education Case Western Reserve University BS,  Material Science , 3.6 1979  – 1983 Case Western Reserve University BS,  Material Science , 3.6 1979  – 1983 Case Western Reserve University BS,  Material Science , 3.6 1979  – 1983 Case Western Reserve University BS,  Material Science , 3.6 1979  – 1983 Honors & Awards ", "Summary A global leader with a well rounded experience spanning key aspects of building & leading multinational organizations. \n \nResults oriented professional with multi domain expertise spanning engineering, operations, corporate affairs, strategy, business development as well as cross geography program & people management. \n \nSetup and lead various small and large organizations in various parts of the world in areas of Mobile software, Internet of Things (IoT), embedded software, strategic planning & corporate affairs. \n \nSuccessfully led various challenging business critical programs and organizational transformation efforts. Summary A global leader with a well rounded experience spanning key aspects of building & leading multinational organizations. \n \nResults oriented professional with multi domain expertise spanning engineering, operations, corporate affairs, strategy, business development as well as cross geography program & people management. \n \nSetup and lead various small and large organizations in various parts of the world in areas of Mobile software, Internet of Things (IoT), embedded software, strategic planning & corporate affairs. \n \nSuccessfully led various challenging business critical programs and organizational transformation efforts. A global leader with a well rounded experience spanning key aspects of building & leading multinational organizations. \n \nResults oriented professional with multi domain expertise spanning engineering, operations, corporate affairs, strategy, business development as well as cross geography program & people management. \n \nSetup and lead various small and large organizations in various parts of the world in areas of Mobile software, Internet of Things (IoT), embedded software, strategic planning & corporate affairs. \n \nSuccessfully led various challenging business critical programs and organizational transformation efforts. A global leader with a well rounded experience spanning key aspects of building & leading multinational organizations. \n \nResults oriented professional with multi domain expertise spanning engineering, operations, corporate affairs, strategy, business development as well as cross geography program & people management. \n \nSetup and lead various small and large organizations in various parts of the world in areas of Mobile software, Internet of Things (IoT), embedded software, strategic planning & corporate affairs. \n \nSuccessfully led various challenging business critical programs and organizational transformation efforts. Experience Sr. Director, Mobile Software Engineering Intel Corporation December 2012  – Present (2 years 9 months) Bangalore, India Lead a global AGILE team that is driving the creation of core Android and Windows SW products for future generation phones, tablets & Internet of Things (IoT) products. Global SW leader for the latest generation of Intel's Windows tablet program.  \n \n Director, SoC Software Strategic Planning Intel Corporation January 2011  –  December 2012  (2 years) Santa Clara, USA Drove the long term software strategy for core software for Intel Atom SoCs as well as the organizational transformation to infuse software thinking in a predominantly hardware organization. Also lead the HW/SW co-design efforts to help reduce time to market for products.  Director, Corporate Affairs Intel Technolgy India April 2007  –  February 2011  (3 years 11 months) Bangalore, India As Director of Corporate Affairs, Rahul was responsible for Intel’s government engagements, education, environmental and rural inclusion programs including media engagements, industry body relations as well as corporate social responsibility programs for South Asia including India, Pakistan, Bangladesh and Sri Lanka. \n \nUnder his leadership, Intel reached an enviable milestone of training more than a 1 million of India’s 6 million or so teachers in 21st century teaching skills using Information and Communication technology. India Business Operations Manager Intel November 2005  –  June 2008  (2 years 8 months) Rahul was in charge of India Operations, with responsibility for ensuring that various aspects of running operations including people systems, process, risks & controls and infrastructure systems operated smoothly enabling various business units to function in an operationally excellent manner in India. In that role he led Intel India towards focused operational excellence.  \n \nRahul took on this role at times of significant upheaval in the India design center and lead various efforts to rebuild a sustainable organization that successfully managed through the challenges. Business Development Manager - APAC Intel January 2002  –  October 2005  (3 years 10 months) Managed the business development for support & service for the Communications Infrastructure Group of Intel in Asia Pacific and Japan. Developed Intel's SW services revenue business in APAC. Technical Architect Intel August 2001  –  December 2002  (1 year 5 months) Drove customer solutions based on Intel communication SW stacks, Network Processors etc. Engineering Manager Nortel Networks 1997  –  2001  (4 years) New Delhi, India Lead the router products development team in India. Was part of the core team that started the design center and also lead the transformation through the economy down turn which finally resulted in closure of the design center. Sr. Engineer HCL Technologies 1994  –  1997  (3 years) Chennai, India Remote access servers & Unix internals Sr. Director, Mobile Software Engineering Intel Corporation December 2012  – Present (2 years 9 months) Bangalore, India Lead a global AGILE team that is driving the creation of core Android and Windows SW products for future generation phones, tablets & Internet of Things (IoT) products. Global SW leader for the latest generation of Intel's Windows tablet program.  \n \n Sr. Director, Mobile Software Engineering Intel Corporation December 2012  – Present (2 years 9 months) Bangalore, India Lead a global AGILE team that is driving the creation of core Android and Windows SW products for future generation phones, tablets & Internet of Things (IoT) products. Global SW leader for the latest generation of Intel's Windows tablet program.  \n \n Director, SoC Software Strategic Planning Intel Corporation January 2011  –  December 2012  (2 years) Santa Clara, USA Drove the long term software strategy for core software for Intel Atom SoCs as well as the organizational transformation to infuse software thinking in a predominantly hardware organization. Also lead the HW/SW co-design efforts to help reduce time to market for products.  Director, SoC Software Strategic Planning Intel Corporation January 2011  –  December 2012  (2 years) Santa Clara, USA Drove the long term software strategy for core software for Intel Atom SoCs as well as the organizational transformation to infuse software thinking in a predominantly hardware organization. Also lead the HW/SW co-design efforts to help reduce time to market for products.  Director, Corporate Affairs Intel Technolgy India April 2007  –  February 2011  (3 years 11 months) Bangalore, India As Director of Corporate Affairs, Rahul was responsible for Intel’s government engagements, education, environmental and rural inclusion programs including media engagements, industry body relations as well as corporate social responsibility programs for South Asia including India, Pakistan, Bangladesh and Sri Lanka. \n \nUnder his leadership, Intel reached an enviable milestone of training more than a 1 million of India’s 6 million or so teachers in 21st century teaching skills using Information and Communication technology. Director, Corporate Affairs Intel Technolgy India April 2007  –  February 2011  (3 years 11 months) Bangalore, India As Director of Corporate Affairs, Rahul was responsible for Intel’s government engagements, education, environmental and rural inclusion programs including media engagements, industry body relations as well as corporate social responsibility programs for South Asia including India, Pakistan, Bangladesh and Sri Lanka. \n \nUnder his leadership, Intel reached an enviable milestone of training more than a 1 million of India’s 6 million or so teachers in 21st century teaching skills using Information and Communication technology. India Business Operations Manager Intel November 2005  –  June 2008  (2 years 8 months) Rahul was in charge of India Operations, with responsibility for ensuring that various aspects of running operations including people systems, process, risks & controls and infrastructure systems operated smoothly enabling various business units to function in an operationally excellent manner in India. In that role he led Intel India towards focused operational excellence.  \n \nRahul took on this role at times of significant upheaval in the India design center and lead various efforts to rebuild a sustainable organization that successfully managed through the challenges. India Business Operations Manager Intel November 2005  –  June 2008  (2 years 8 months) Rahul was in charge of India Operations, with responsibility for ensuring that various aspects of running operations including people systems, process, risks & controls and infrastructure systems operated smoothly enabling various business units to function in an operationally excellent manner in India. In that role he led Intel India towards focused operational excellence.  \n \nRahul took on this role at times of significant upheaval in the India design center and lead various efforts to rebuild a sustainable organization that successfully managed through the challenges. Business Development Manager - APAC Intel January 2002  –  October 2005  (3 years 10 months) Managed the business development for support & service for the Communications Infrastructure Group of Intel in Asia Pacific and Japan. Developed Intel's SW services revenue business in APAC. Business Development Manager - APAC Intel January 2002  –  October 2005  (3 years 10 months) Managed the business development for support & service for the Communications Infrastructure Group of Intel in Asia Pacific and Japan. Developed Intel's SW services revenue business in APAC. Technical Architect Intel August 2001  –  December 2002  (1 year 5 months) Drove customer solutions based on Intel communication SW stacks, Network Processors etc. Technical Architect Intel August 2001  –  December 2002  (1 year 5 months) Drove customer solutions based on Intel communication SW stacks, Network Processors etc. Engineering Manager Nortel Networks 1997  –  2001  (4 years) New Delhi, India Lead the router products development team in India. Was part of the core team that started the design center and also lead the transformation through the economy down turn which finally resulted in closure of the design center. Engineering Manager Nortel Networks 1997  –  2001  (4 years) New Delhi, India Lead the router products development team in India. Was part of the core team that started the design center and also lead the transformation through the economy down turn which finally resulted in closure of the design center. Sr. Engineer HCL Technologies 1994  –  1997  (3 years) Chennai, India Remote access servers & Unix internals Sr. Engineer HCL Technologies 1994  –  1997  (3 years) Chennai, India Remote access servers & Unix internals Languages English Hindi Punjabi English Hindi Punjabi English Hindi Punjabi Skills Product Management Program Management Cross-functional Team... Intel Product Development Semiconductors Product Marketing Business Development Business Strategy Project Management Go-to-market Strategy Engineering Management Strategic Planning Consumer Electronics Entrepreneurship Product Launch Wireless Leadership Software Project... Operations Management Product Lifecycle... IC Strategy SoC Marketing Strategy Technical Marketing Start-ups Strategic Partnerships ASIC Manufacturing Management Process Improvement Telecommunications Market Analysis Business Planning International Business Training Team Management Mobile Devices Project Planning Competitive Analysis Processors Business Alliances Supply Chain Management Embedded Systems Semiconductor Industry Key Account Management New Business Development See 33+     See less Skills  Product Management Program Management Cross-functional Team... Intel Product Development Semiconductors Product Marketing Business Development Business Strategy Project Management Go-to-market Strategy Engineering Management Strategic Planning Consumer Electronics Entrepreneurship Product Launch Wireless Leadership Software Project... Operations Management Product Lifecycle... IC Strategy SoC Marketing Strategy Technical Marketing Start-ups Strategic Partnerships ASIC Manufacturing Management Process Improvement Telecommunications Market Analysis Business Planning International Business Training Team Management Mobile Devices Project Planning Competitive Analysis Processors Business Alliances Supply Chain Management Embedded Systems Semiconductor Industry Key Account Management New Business Development See 33+     See less Product Management Program Management Cross-functional Team... Intel Product Development Semiconductors Product Marketing Business Development Business Strategy Project Management Go-to-market Strategy Engineering Management Strategic Planning Consumer Electronics Entrepreneurship Product Launch Wireless Leadership Software Project... Operations Management Product Lifecycle... IC Strategy SoC Marketing Strategy Technical Marketing Start-ups Strategic Partnerships ASIC Manufacturing Management Process Improvement Telecommunications Market Analysis Business Planning International Business Training Team Management Mobile Devices Project Planning Competitive Analysis Processors Business Alliances Supply Chain Management Embedded Systems Semiconductor Industry Key Account Management New Business Development See 33+     See less Product Management Program Management Cross-functional Team... Intel Product Development Semiconductors Product Marketing Business Development Business Strategy Project Management Go-to-market Strategy Engineering Management Strategic Planning Consumer Electronics Entrepreneurship Product Launch Wireless Leadership Software Project... Operations Management Product Lifecycle... IC Strategy SoC Marketing Strategy Technical Marketing Start-ups Strategic Partnerships ASIC Manufacturing Management Process Improvement Telecommunications Market Analysis Business Planning International Business Training Team Management Mobile Devices Project Planning Competitive Analysis Processors Business Alliances Supply Chain Management Embedded Systems Semiconductor Industry Key Account Management New Business Development See 33+     See less ", "Experience Director, Platform Application Engineering at Intel Corporation Intel Corporation June 2012  – Present (3 years 3 months) Israel Engineering Manager Intel 2007  –  June 2012  (5 years) 1 Gbs ethernet products Engineer Manager.  \nResponsible of the devlopement (from the marketing definition to Mass production). Actualy responsible of 2 new components devlopement in parallel. Design manager Intel January 2004  –  January 2007  (3 years 1 month) Manages a team of HW designer. Work in verilog/VHDL for SoC chip. Design(ASIC) Engineer Intel January 1999  –  January 2004  (5 years 1 month) Design several blocks in Verilog/VHDL. Was responsible of some features from the architecture level to the synthesis and emulation. HW designer Telrad January 1997  –  January 1998  (1 year 1 month) Full ASIC design with TI library and FPGA emulation Director, Platform Application Engineering at Intel Corporation Intel Corporation June 2012  – Present (3 years 3 months) Israel Director, Platform Application Engineering at Intel Corporation Intel Corporation June 2012  – Present (3 years 3 months) Israel Engineering Manager Intel 2007  –  June 2012  (5 years) 1 Gbs ethernet products Engineer Manager.  \nResponsible of the devlopement (from the marketing definition to Mass production). Actualy responsible of 2 new components devlopement in parallel. Engineering Manager Intel 2007  –  June 2012  (5 years) 1 Gbs ethernet products Engineer Manager.  \nResponsible of the devlopement (from the marketing definition to Mass production). Actualy responsible of 2 new components devlopement in parallel. Design manager Intel January 2004  –  January 2007  (3 years 1 month) Manages a team of HW designer. Work in verilog/VHDL for SoC chip. Design manager Intel January 2004  –  January 2007  (3 years 1 month) Manages a team of HW designer. Work in verilog/VHDL for SoC chip. Design(ASIC) Engineer Intel January 1999  –  January 2004  (5 years 1 month) Design several blocks in Verilog/VHDL. Was responsible of some features from the architecture level to the synthesis and emulation. Design(ASIC) Engineer Intel January 1999  –  January 2004  (5 years 1 month) Design several blocks in Verilog/VHDL. Was responsible of some features from the architecture level to the synthesis and emulation. HW designer Telrad January 1997  –  January 1998  (1 year 1 month) Full ASIC design with TI library and FPGA emulation HW designer Telrad January 1997  –  January 1998  (1 year 1 month) Full ASIC design with TI library and FPGA emulation Skills VLSI ASIC SoC FPGA Skills  VLSI ASIC SoC FPGA VLSI ASIC SoC FPGA VLSI ASIC SoC FPGA Education École Supérieure d'Électricité 1996  – 1997 Jerusalem college of technology Bsc 1992  – 1996 yavne 1988  – 1992 École Supérieure d'Électricité 1996  – 1997 École Supérieure d'Électricité 1996  – 1997 École Supérieure d'Électricité 1996  – 1997 Jerusalem college of technology Bsc 1992  – 1996 Jerusalem college of technology Bsc 1992  – 1996 Jerusalem college of technology Bsc 1992  – 1996 yavne 1988  – 1992 yavne 1988  – 1992 yavne 1988  – 1992 ", "Summary A passionate, results-oriented technology and engineering leader with a unique combination of strategic vision and strong tactical delivery expertise. Author and presenter on parallel computing hardware and software. Industry expertise in high performance computing (HPC), scientific visualization, parallel computing, graphics and video device drivers, agile product development life cycle, and VoIP telecommunications. \n \nSpecialties: HPC systems, Supercomputing, Visualization, Video, Telecommunications, Agile Development Processes, PC, Embedded Solutions; Summary A passionate, results-oriented technology and engineering leader with a unique combination of strategic vision and strong tactical delivery expertise. Author and presenter on parallel computing hardware and software. Industry expertise in high performance computing (HPC), scientific visualization, parallel computing, graphics and video device drivers, agile product development life cycle, and VoIP telecommunications. \n \nSpecialties: HPC systems, Supercomputing, Visualization, Video, Telecommunications, Agile Development Processes, PC, Embedded Solutions; A passionate, results-oriented technology and engineering leader with a unique combination of strategic vision and strong tactical delivery expertise. Author and presenter on parallel computing hardware and software. Industry expertise in high performance computing (HPC), scientific visualization, parallel computing, graphics and video device drivers, agile product development life cycle, and VoIP telecommunications. \n \nSpecialties: HPC systems, Supercomputing, Visualization, Video, Telecommunications, Agile Development Processes, PC, Embedded Solutions; A passionate, results-oriented technology and engineering leader with a unique combination of strategic vision and strong tactical delivery expertise. Author and presenter on parallel computing hardware and software. Industry expertise in high performance computing (HPC), scientific visualization, parallel computing, graphics and video device drivers, agile product development life cycle, and VoIP telecommunications. \n \nSpecialties: HPC systems, Supercomputing, Visualization, Video, Telecommunications, Agile Development Processes, PC, Embedded Solutions; Experience Engineering Manager & PE, Visualization Engineering Intel Corporation October 2013  – Present (1 year 11 months) Greater Philadelphia Area Principal Engineer Intel Corporation March 2013  – Present (2 years 6 months) Sr. Product Application Engineer - Intel (r) MIC Architecture Intel April 2011  –  March 2013  (2 years) Intel (r) MIC SW Engineering Mgr - Visual & Parallel Computing Group Intel January 2010  –  April 2011  (1 year 4 months) Strategic Planning - Many core computing Intel August 2008  –  January 2010  (1 year 6 months) Independent Technology Consultant Self-Employed January 2008  –  August 2008  (8 months) VP, Research and Development Clique Communications 2004  –  2008  (4 years) LegatoVideo, Director, Engineering Innovativ 2003  –  2004  (1 year) Director, Systems Development PVI 1996  –  2002  (6 years) Software / Device Driver Manager Tseng Labs 1993  –  1996  (3 years) Software Manager Intel Corporation 1991  –  1993  (2 years) Technology and Software Development Consultant Various 1981  –  1992  (11 years) Engineering Manager & PE, Visualization Engineering Intel Corporation October 2013  – Present (1 year 11 months) Greater Philadelphia Area Engineering Manager & PE, Visualization Engineering Intel Corporation October 2013  – Present (1 year 11 months) Greater Philadelphia Area Principal Engineer Intel Corporation March 2013  – Present (2 years 6 months) Principal Engineer Intel Corporation March 2013  – Present (2 years 6 months) Sr. Product Application Engineer - Intel (r) MIC Architecture Intel April 2011  –  March 2013  (2 years) Sr. Product Application Engineer - Intel (r) MIC Architecture Intel April 2011  –  March 2013  (2 years) Intel (r) MIC SW Engineering Mgr - Visual & Parallel Computing Group Intel January 2010  –  April 2011  (1 year 4 months) Intel (r) MIC SW Engineering Mgr - Visual & Parallel Computing Group Intel January 2010  –  April 2011  (1 year 4 months) Strategic Planning - Many core computing Intel August 2008  –  January 2010  (1 year 6 months) Strategic Planning - Many core computing Intel August 2008  –  January 2010  (1 year 6 months) Independent Technology Consultant Self-Employed January 2008  –  August 2008  (8 months) Independent Technology Consultant Self-Employed January 2008  –  August 2008  (8 months) VP, Research and Development Clique Communications 2004  –  2008  (4 years) VP, Research and Development Clique Communications 2004  –  2008  (4 years) LegatoVideo, Director, Engineering Innovativ 2003  –  2004  (1 year) LegatoVideo, Director, Engineering Innovativ 2003  –  2004  (1 year) Director, Systems Development PVI 1996  –  2002  (6 years) Director, Systems Development PVI 1996  –  2002  (6 years) Software / Device Driver Manager Tseng Labs 1993  –  1996  (3 years) Software / Device Driver Manager Tseng Labs 1993  –  1996  (3 years) Software Manager Intel Corporation 1991  –  1993  (2 years) Software Manager Intel Corporation 1991  –  1993  (2 years) Technology and Software Development Consultant Various 1981  –  1992  (11 years) Technology and Software Development Consultant Various 1981  –  1992  (11 years) Languages English English English Skills Telecommunications Agile Embedded Solutions Engineering Management Product Development Linux Software Development Product Management Program Management C System Architecture Embedded Systems Product Marketing Testing Architecture Software Project... Start-ups Strategic Planning Cross-functional Team... Programming Software Engineering Quality Assurance Product Strategy Windows Marketing Strategy Software Design Video Engineering Management Agile Methodologies Embedded Software FPGA Device Drivers Firmware High Performance... Intel SoC Debugging Processors Semiconductors ASIC Electronics Computer Architecture Hardware Microprocessors Digital Signal... Microarchitecture Hardware Architecture Parallel Computing Parallel Programming See 35+     See less Skills  Telecommunications Agile Embedded Solutions Engineering Management Product Development Linux Software Development Product Management Program Management C System Architecture Embedded Systems Product Marketing Testing Architecture Software Project... Start-ups Strategic Planning Cross-functional Team... Programming Software Engineering Quality Assurance Product Strategy Windows Marketing Strategy Software Design Video Engineering Management Agile Methodologies Embedded Software FPGA Device Drivers Firmware High Performance... Intel SoC Debugging Processors Semiconductors ASIC Electronics Computer Architecture Hardware Microprocessors Digital Signal... Microarchitecture Hardware Architecture Parallel Computing Parallel Programming See 35+     See less Telecommunications Agile Embedded Solutions Engineering Management Product Development Linux Software Development Product Management Program Management C System Architecture Embedded Systems Product Marketing Testing Architecture Software Project... Start-ups Strategic Planning Cross-functional Team... Programming Software Engineering Quality Assurance Product Strategy Windows Marketing Strategy Software Design Video Engineering Management Agile Methodologies Embedded Software FPGA Device Drivers Firmware High Performance... Intel SoC Debugging Processors Semiconductors ASIC Electronics Computer Architecture Hardware Microprocessors Digital Signal... Microarchitecture Hardware Architecture Parallel Computing Parallel Programming See 35+     See less Telecommunications Agile Embedded Solutions Engineering Management Product Development Linux Software Development Product Management Program Management C System Architecture Embedded Systems Product Marketing Testing Architecture Software Project... Start-ups Strategic Planning Cross-functional Team... Programming Software Engineering Quality Assurance Product Strategy Windows Marketing Strategy Software Design Video Engineering Management Agile Methodologies Embedded Software FPGA Device Drivers Firmware High Performance... Intel SoC Debugging Processors Semiconductors ASIC Electronics Computer Architecture Hardware Microprocessors Digital Signal... Microarchitecture Hardware Architecture Parallel Computing Parallel Programming See 35+     See less Honors & Awards Intel Achievement Award Intel Corporation March 2013 Top Intel company honor/award - Group award for delivering Intel’s first ever 22nm Many Core Product, the Intel(r) Xeon Phi(tm) Coprocessor. Intel Achievement Award Intel Corporation March 2013 Top Intel company honor/award - Group award for delivering Intel’s first ever 22nm Many Core Product, the Intel(r) Xeon Phi(tm) Coprocessor. Intel Achievement Award Intel Corporation March 2013 Top Intel company honor/award - Group award for delivering Intel’s first ever 22nm Many Core Product, the Intel(r) Xeon Phi(tm) Coprocessor. Intel Achievement Award Intel Corporation March 2013 Top Intel company honor/award - Group award for delivering Intel’s first ever 22nm Many Core Product, the Intel(r) Xeon Phi(tm) Coprocessor. ", "Experience Engineering Department Manager Intel Corporation April 1997  – Present (18 years 5 months) Manage Electrical Engineering Department for Mobile Platform Group \n \nIncludes Board/System Design & Validation, high speed interconnect simulation and analysis, power delivery, and power integrity package/PCB analysis Electrical Engineer Naval Underwater Warfare Engineering Station 1987  –  1997  (10 years) Student University of North Dakota 1983  –  1987  (4 years) Engineering Department Manager Intel Corporation April 1997  – Present (18 years 5 months) Manage Electrical Engineering Department for Mobile Platform Group \n \nIncludes Board/System Design & Validation, high speed interconnect simulation and analysis, power delivery, and power integrity package/PCB analysis Engineering Department Manager Intel Corporation April 1997  – Present (18 years 5 months) Manage Electrical Engineering Department for Mobile Platform Group \n \nIncludes Board/System Design & Validation, high speed interconnect simulation and analysis, power delivery, and power integrity package/PCB analysis Electrical Engineer Naval Underwater Warfare Engineering Station 1987  –  1997  (10 years) Electrical Engineer Naval Underwater Warfare Engineering Station 1987  –  1997  (10 years) Student University of North Dakota 1983  –  1987  (4 years) Student University of North Dakota 1983  –  1987  (4 years) Skills Electrical Engineering Intel Semiconductors Engineering Simulations Computer Architecture IC Hardware Architecture Program Management Analysis Cross-functional Team... Mobile Devices Management ASIC Product Development Processors Engineering Management SoC Embedded Systems Debugging Product Management See 6+     See less Skills  Electrical Engineering Intel Semiconductors Engineering Simulations Computer Architecture IC Hardware Architecture Program Management Analysis Cross-functional Team... Mobile Devices Management ASIC Product Development Processors Engineering Management SoC Embedded Systems Debugging Product Management See 6+     See less Electrical Engineering Intel Semiconductors Engineering Simulations Computer Architecture IC Hardware Architecture Program Management Analysis Cross-functional Team... Mobile Devices Management ASIC Product Development Processors Engineering Management SoC Embedded Systems Debugging Product Management See 6+     See less Electrical Engineering Intel Semiconductors Engineering Simulations Computer Architecture IC Hardware Architecture Program Management Analysis Cross-functional Team... Mobile Devices Management ASIC Product Development Processors Engineering Management SoC Embedded Systems Debugging Product Management See 6+     See less Education The University of North Dakota 1983  – 1987 The University of North Dakota 1983  – 1987 The University of North Dakota 1983  – 1987 The University of North Dakota 1983  – 1987 ", "Languages English Hindi Tamil Telugu Kanada English Hindi Tamil Telugu Kanada English Hindi Tamil Telugu Kanada Skills Cross-functional Team... Engineering Management SoC Electronics Packaging Engineering ASIC Processors Packaging Engineering IC Product Development Data Center Semiconductors Automotive Microprocessors Automotive Engineering Technical Leadership Mechanical Engineering Design of Experiments Failure Analysis VLSI EDA Simulations Program Management Product Management AutoCAD Allegro Coaching & Mentoring Youth Mentoring Silicon See 14+     See less Skills  Cross-functional Team... Engineering Management SoC Electronics Packaging Engineering ASIC Processors Packaging Engineering IC Product Development Data Center Semiconductors Automotive Microprocessors Automotive Engineering Technical Leadership Mechanical Engineering Design of Experiments Failure Analysis VLSI EDA Simulations Program Management Product Management AutoCAD Allegro Coaching & Mentoring Youth Mentoring Silicon See 14+     See less Cross-functional Team... Engineering Management SoC Electronics Packaging Engineering ASIC Processors Packaging Engineering IC Product Development Data Center Semiconductors Automotive Microprocessors Automotive Engineering Technical Leadership Mechanical Engineering Design of Experiments Failure Analysis VLSI EDA Simulations Program Management Product Management AutoCAD Allegro Coaching & Mentoring Youth Mentoring Silicon See 14+     See less Cross-functional Team... Engineering Management SoC Electronics Packaging Engineering ASIC Processors Packaging Engineering IC Product Development Data Center Semiconductors Automotive Microprocessors Automotive Engineering Technical Leadership Mechanical Engineering Design of Experiments Failure Analysis VLSI EDA Simulations Program Management Product Management AutoCAD Allegro Coaching & Mentoring Youth Mentoring Silicon See 14+     See less "]}