{"position": "Equipment Specialist", "company": "Intel Corporation", "profiles": ["Experience Lithography Equipment Specialist Intel Corporation May 1998  – Present (17 years 4 months) Consultant Equipment Technician Digital Equipment Corporation November 1988  –  May 1998  (9 years 7 months) Lithography Equipment Specialist Intel Corporation May 1998  – Present (17 years 4 months) Lithography Equipment Specialist Intel Corporation May 1998  – Present (17 years 4 months) Consultant Equipment Technician Digital Equipment Corporation November 1988  –  May 1998  (9 years 7 months) Consultant Equipment Technician Digital Equipment Corporation November 1988  –  May 1998  (9 years 7 months) Skills Design of Experiments Silicon SPC Metrology Semiconductor Industry Electronics Failure Analysis Semiconductors CVD Plasma Etch Troubleshooting JMP Intel Manufacturing Photolithography Six Sigma IC Lithography Electro-mechanical Electro-mechanical... Lean Manufacturing 5S Equipment Repair Thin Films See 9+     See less Skills  Design of Experiments Silicon SPC Metrology Semiconductor Industry Electronics Failure Analysis Semiconductors CVD Plasma Etch Troubleshooting JMP Intel Manufacturing Photolithography Six Sigma IC Lithography Electro-mechanical Electro-mechanical... Lean Manufacturing 5S Equipment Repair Thin Films See 9+     See less Design of Experiments Silicon SPC Metrology Semiconductor Industry Electronics Failure Analysis Semiconductors CVD Plasma Etch Troubleshooting JMP Intel Manufacturing Photolithography Six Sigma IC Lithography Electro-mechanical Electro-mechanical... Lean Manufacturing 5S Equipment Repair Thin Films See 9+     See less Design of Experiments Silicon SPC Metrology Semiconductor Industry Electronics Failure Analysis Semiconductors CVD Plasma Etch Troubleshooting JMP Intel Manufacturing Photolithography Six Sigma IC Lithography Electro-mechanical Electro-mechanical... Lean Manufacturing 5S Equipment Repair Thin Films See 9+     See less Education Sylvania Tech Computer Electronics 1986  – 1987 Central Connecticut State University 1984  – 1985 Leominster High School Sylvania Tech Computer Electronics 1986  – 1987 Sylvania Tech Computer Electronics 1986  – 1987 Sylvania Tech Computer Electronics 1986  – 1987 Central Connecticut State University 1984  – 1985 Central Connecticut State University 1984  – 1985 Central Connecticut State University 1984  – 1985 Leominster High School Leominster High School Leominster High School ", "Experience Equipment specialist Intel Corporation October 1991  – Present (23 years 11 months) Equipment specialist Intel Corporation October 1991  – Present (23 years 11 months) Equipment specialist Intel Corporation October 1991  – Present (23 years 11 months) Skills Microsoft Excel Microsoft Office Microsoft Word English Windows Research Outlook Teaching Public Speaking Strategic Planning Editing Team Building Project Management Skills  Microsoft Excel Microsoft Office Microsoft Word English Windows Research Outlook Teaching Public Speaking Strategic Planning Editing Team Building Project Management Microsoft Excel Microsoft Office Microsoft Word English Windows Research Outlook Teaching Public Speaking Strategic Planning Editing Team Building Project Management Microsoft Excel Microsoft Office Microsoft Word English Windows Research Outlook Teaching Public Speaking Strategic Planning Editing Team Building Project Management Education DeVry University-Illinois Bachelor of Science (BS),  Electrical and Electronics Engineering 1977  – 1980 DeVry University-Illinois Bachelor of Science (BS),  Electrical and Electronics Engineering 1977  – 1980 DeVry University-Illinois Bachelor of Science (BS),  Electrical and Electronics Engineering 1977  – 1980 DeVry University-Illinois Bachelor of Science (BS),  Electrical and Electronics Engineering 1977  – 1980 ", "Summary Highly qualified equipment specialist offering over 15 years of manufacturing and electro-mechanical experience in the high-tech silicon manufacturing industries. Customer, results, and team oriented. Implement continuous improvement, Lean, and cost saving projects, have full certification in multiple modules, and train several team members to achieve the same level. Summary Highly qualified equipment specialist offering over 15 years of manufacturing and electro-mechanical experience in the high-tech silicon manufacturing industries. Customer, results, and team oriented. Implement continuous improvement, Lean, and cost saving projects, have full certification in multiple modules, and train several team members to achieve the same level. Highly qualified equipment specialist offering over 15 years of manufacturing and electro-mechanical experience in the high-tech silicon manufacturing industries. Customer, results, and team oriented. Implement continuous improvement, Lean, and cost saving projects, have full certification in multiple modules, and train several team members to achieve the same level. Highly qualified equipment specialist offering over 15 years of manufacturing and electro-mechanical experience in the high-tech silicon manufacturing industries. Customer, results, and team oriented. Implement continuous improvement, Lean, and cost saving projects, have full certification in multiple modules, and train several team members to achieve the same level. Experience Equipment Specialist Intel Corporation December 2006  – Present (8 years 9 months) Hudson Ma •Attain maintenance certifications on various equipment in a high-tech clean room environment \n \n•Maintain, repair and trouble shoot equipment in the plasma etch module \n \n•Respond to issues requiring troubleshooting to resolve equipment or process related problems \n \n•Train team members to attain higher levels of certification \n \n•Equipment coordinator responsible for leading the team to ensure tool related issues are addressed and shift goals are achieved \n \n•Training coordinator responsible for ensuring necessary cross-training for the entire team \n \n•Participant of many safety and ergonomics upgrades on multiple pieces of equipment. Worked with EH&S to document issues and identify solutions to resolve them \n \n•Complete engineering requests to modify process recipes and tool parameters \n \n•Participate in many teams to solve complicated problems using methodical problem solving techniques  \n \n•Continuous improvement: Create new maintenance procedures, update maintenance check sheets, and modify specifications to improve equipment repairs for better equipment availability \n \n•Lean: Participate in teams to steam line maintenance procedures for faster preventive maintenance to optimize equipment availability while not compromising quality. Consolidate equipment hand tools and test equipment needed for preventive maintenance to ensure location is easily found in a general area.  \n.  \n•Cost Saving: Test, repair, and harvest equipment parts to help make our cost budget. Work with engineering to second source equipment parts to reduce spares costs \n \n•3 month engineering rotation Manufacturing Technician Intel Corporation April 2000  –  December 2006  (6 years 9 months) Hudson Ma •Attained operation, equipment and process certifications on various equipment in a high-tech clean room environment \n \n•Operated and maintained equipment in the plasma etch module \n \n•Operated multiple metrology/inspection equipment for the plasma etch module \n \n•Performed process related decisions for the plasma etch module \n \n•Acted as the training coordinator to ensure necessary cross training for the entire team Engineering Technician Nucon - Millstone Power Plant May 1997  –  July 1997  (3 months) Waterford Ct •Internship program as part of the Northeast Utilities Scholarship Equipment Specialist Intel Corporation December 2006  – Present (8 years 9 months) Hudson Ma •Attain maintenance certifications on various equipment in a high-tech clean room environment \n \n•Maintain, repair and trouble shoot equipment in the plasma etch module \n \n•Respond to issues requiring troubleshooting to resolve equipment or process related problems \n \n•Train team members to attain higher levels of certification \n \n•Equipment coordinator responsible for leading the team to ensure tool related issues are addressed and shift goals are achieved \n \n•Training coordinator responsible for ensuring necessary cross-training for the entire team \n \n•Participant of many safety and ergonomics upgrades on multiple pieces of equipment. Worked with EH&S to document issues and identify solutions to resolve them \n \n•Complete engineering requests to modify process recipes and tool parameters \n \n•Participate in many teams to solve complicated problems using methodical problem solving techniques  \n \n•Continuous improvement: Create new maintenance procedures, update maintenance check sheets, and modify specifications to improve equipment repairs for better equipment availability \n \n•Lean: Participate in teams to steam line maintenance procedures for faster preventive maintenance to optimize equipment availability while not compromising quality. Consolidate equipment hand tools and test equipment needed for preventive maintenance to ensure location is easily found in a general area.  \n.  \n•Cost Saving: Test, repair, and harvest equipment parts to help make our cost budget. Work with engineering to second source equipment parts to reduce spares costs \n \n•3 month engineering rotation Equipment Specialist Intel Corporation December 2006  – Present (8 years 9 months) Hudson Ma •Attain maintenance certifications on various equipment in a high-tech clean room environment \n \n•Maintain, repair and trouble shoot equipment in the plasma etch module \n \n•Respond to issues requiring troubleshooting to resolve equipment or process related problems \n \n•Train team members to attain higher levels of certification \n \n•Equipment coordinator responsible for leading the team to ensure tool related issues are addressed and shift goals are achieved \n \n•Training coordinator responsible for ensuring necessary cross-training for the entire team \n \n•Participant of many safety and ergonomics upgrades on multiple pieces of equipment. Worked with EH&S to document issues and identify solutions to resolve them \n \n•Complete engineering requests to modify process recipes and tool parameters \n \n•Participate in many teams to solve complicated problems using methodical problem solving techniques  \n \n•Continuous improvement: Create new maintenance procedures, update maintenance check sheets, and modify specifications to improve equipment repairs for better equipment availability \n \n•Lean: Participate in teams to steam line maintenance procedures for faster preventive maintenance to optimize equipment availability while not compromising quality. Consolidate equipment hand tools and test equipment needed for preventive maintenance to ensure location is easily found in a general area.  \n.  \n•Cost Saving: Test, repair, and harvest equipment parts to help make our cost budget. Work with engineering to second source equipment parts to reduce spares costs \n \n•3 month engineering rotation Manufacturing Technician Intel Corporation April 2000  –  December 2006  (6 years 9 months) Hudson Ma •Attained operation, equipment and process certifications on various equipment in a high-tech clean room environment \n \n•Operated and maintained equipment in the plasma etch module \n \n•Operated multiple metrology/inspection equipment for the plasma etch module \n \n•Performed process related decisions for the plasma etch module \n \n•Acted as the training coordinator to ensure necessary cross training for the entire team Manufacturing Technician Intel Corporation April 2000  –  December 2006  (6 years 9 months) Hudson Ma •Attained operation, equipment and process certifications on various equipment in a high-tech clean room environment \n \n•Operated and maintained equipment in the plasma etch module \n \n•Operated multiple metrology/inspection equipment for the plasma etch module \n \n•Performed process related decisions for the plasma etch module \n \n•Acted as the training coordinator to ensure necessary cross training for the entire team Engineering Technician Nucon - Millstone Power Plant May 1997  –  July 1997  (3 months) Waterford Ct •Internship program as part of the Northeast Utilities Scholarship Engineering Technician Nucon - Millstone Power Plant May 1997  –  July 1997  (3 months) Waterford Ct •Internship program as part of the Northeast Utilities Scholarship Skills Equipment Maintenance Manufacturing Preventive Maintenance Data Analysis Microsoft Office Lean Manufacturing Cost Control Safety SPC charts Plasma Etch Metrology Failure Analysis Test Equipment Electronics Process Improvement Semiconductors Semiconductor Industry MEMS Root Cause Analysis Troubleshooting SPC Intel Silicon See 8+     See less Skills  Equipment Maintenance Manufacturing Preventive Maintenance Data Analysis Microsoft Office Lean Manufacturing Cost Control Safety SPC charts Plasma Etch Metrology Failure Analysis Test Equipment Electronics Process Improvement Semiconductors Semiconductor Industry MEMS Root Cause Analysis Troubleshooting SPC Intel Silicon See 8+     See less Equipment Maintenance Manufacturing Preventive Maintenance Data Analysis Microsoft Office Lean Manufacturing Cost Control Safety SPC charts Plasma Etch Metrology Failure Analysis Test Equipment Electronics Process Improvement Semiconductors Semiconductor Industry MEMS Root Cause Analysis Troubleshooting SPC Intel Silicon See 8+     See less Equipment Maintenance Manufacturing Preventive Maintenance Data Analysis Microsoft Office Lean Manufacturing Cost Control Safety SPC charts Plasma Etch Metrology Failure Analysis Test Equipment Electronics Process Improvement Semiconductors Semiconductor Industry MEMS Root Cause Analysis Troubleshooting SPC Intel Silicon See 8+     See less Education New England Institute of Technology Bachelor's degree,  Electrical and Electronics Engineering 1998  – 2000 Three Rivers Community College Associate's degree,  Electrical Engineering Technologies/Technicians 1996  – 1998 Activities and Societies:  Northeast Utilities Scholarship and Basketball Harvard H Ellis Regional Vocational Technical Sch High School,  Electrical 1992  – 1996 Basketball New England Institute of Technology Bachelor's degree,  Electrical and Electronics Engineering 1998  – 2000 New England Institute of Technology Bachelor's degree,  Electrical and Electronics Engineering 1998  – 2000 New England Institute of Technology Bachelor's degree,  Electrical and Electronics Engineering 1998  – 2000 Three Rivers Community College Associate's degree,  Electrical Engineering Technologies/Technicians 1996  – 1998 Activities and Societies:  Northeast Utilities Scholarship and Basketball Three Rivers Community College Associate's degree,  Electrical Engineering Technologies/Technicians 1996  – 1998 Activities and Societies:  Northeast Utilities Scholarship and Basketball Three Rivers Community College Associate's degree,  Electrical Engineering Technologies/Technicians 1996  – 1998 Activities and Societies:  Northeast Utilities Scholarship and Basketball Harvard H Ellis Regional Vocational Technical Sch High School,  Electrical 1992  – 1996 Basketball Harvard H Ellis Regional Vocational Technical Sch High School,  Electrical 1992  – 1996 Basketball Harvard H Ellis Regional Vocational Technical Sch High School,  Electrical 1992  – 1996 Basketball ", "Experience tech. intel Equipment Specialist Intel Corporation August 1982  – Present (33 years 1 month) Litho-Technitian, Maintain litho Equipment, statistical control through SPC++ Daily, Weekly, Montly, Quarterly and anual PM, Specialize in Nikon S204,208, 307 as well as Cymer Lasers, and soon Imersion tools. tech. intel tech. intel Equipment Specialist Intel Corporation August 1982  – Present (33 years 1 month) Litho-Technitian, Maintain litho Equipment, statistical control through SPC++ Daily, Weekly, Montly, Quarterly and anual PM, Specialize in Nikon S204,208, 307 as well as Cymer Lasers, and soon Imersion tools. Equipment Specialist Intel Corporation August 1982  – Present (33 years 1 month) Litho-Technitian, Maintain litho Equipment, statistical control through SPC++ Daily, Weekly, Montly, Quarterly and anual PM, Specialize in Nikon S204,208, 307 as well as Cymer Lasers, and soon Imersion tools. ", "Experience Equipment Specialist Intel Corporation July 2012  – Present (3 years 2 months) Vietnam Responsibilities: \n• Responsible for all machines/ equipment of Chip Attach Module, Cleaning module of the factory including: installation, machine data analysis, troubleshooting issue, preventive maintenance, corrective maintenance. \n• Had knowledge about L3 maintenance Flip-chip Placer (Grohmann FM200), L3 maintenance BTU Oven Paragon 150 , High Precision Printer Machine (DEK), Simplimatic, Vision Inspection Machine (MVP) , Precision Dispensing Equipment (Nordson Asymtek),.. Manufacturing Technician Intel Corporation February 2011  –  July 2012  (1 year 6 months) Vietnam operation machine and troubleshooting issue. Equipment Specialist Intel Corporation July 2012  – Present (3 years 2 months) Vietnam Responsibilities: \n• Responsible for all machines/ equipment of Chip Attach Module, Cleaning module of the factory including: installation, machine data analysis, troubleshooting issue, preventive maintenance, corrective maintenance. \n• Had knowledge about L3 maintenance Flip-chip Placer (Grohmann FM200), L3 maintenance BTU Oven Paragon 150 , High Precision Printer Machine (DEK), Simplimatic, Vision Inspection Machine (MVP) , Precision Dispensing Equipment (Nordson Asymtek),.. Equipment Specialist Intel Corporation July 2012  – Present (3 years 2 months) Vietnam Responsibilities: \n• Responsible for all machines/ equipment of Chip Attach Module, Cleaning module of the factory including: installation, machine data analysis, troubleshooting issue, preventive maintenance, corrective maintenance. \n• Had knowledge about L3 maintenance Flip-chip Placer (Grohmann FM200), L3 maintenance BTU Oven Paragon 150 , High Precision Printer Machine (DEK), Simplimatic, Vision Inspection Machine (MVP) , Precision Dispensing Equipment (Nordson Asymtek),.. Manufacturing Technician Intel Corporation February 2011  –  July 2012  (1 year 6 months) Vietnam operation machine and troubleshooting issue. Manufacturing Technician Intel Corporation February 2011  –  July 2012  (1 year 6 months) Vietnam operation machine and troubleshooting issue. Skills SoC ASIC Debugging VLSI Intel Embedded Systems Processors Computer Architecture Mixed Signal Analog Static Timing Analysis Device Drivers Skills  SoC ASIC Debugging VLSI Intel Embedded Systems Processors Computer Architecture Mixed Signal Analog Static Timing Analysis Device Drivers SoC ASIC Debugging VLSI Intel Embedded Systems Processors Computer Architecture Mixed Signal Analog Static Timing Analysis Device Drivers SoC ASIC Debugging VLSI Intel Embedded Systems Processors Computer Architecture Mixed Signal Analog Static Timing Analysis Device Drivers Education Industrial University of Ho Chi Minh City College 2007  – 2010 Industrial University of Ho Chi Minh City College 2007  – 2010 Industrial University of Ho Chi Minh City College 2007  – 2010 Industrial University of Ho Chi Minh City College 2007  – 2010 ", "Experience Equipment specialist Intel Corporation June 2010  – Present (5 years 3 months) Viet Nam I troubleshoot equipment when issue happen, engineering department TT Electronics October 2008  –  June 2010  (1 year 9 months) Technical Supervisor Sony Viet Nam August 2000  –  September 2008  (8 years 2 months) Vietnam Line leader Equipment specialist Intel Corporation June 2010  – Present (5 years 3 months) Viet Nam I troubleshoot equipment when issue happen, Equipment specialist Intel Corporation June 2010  – Present (5 years 3 months) Viet Nam I troubleshoot equipment when issue happen, engineering department TT Electronics October 2008  –  June 2010  (1 year 9 months) Technical engineering department TT Electronics October 2008  –  June 2010  (1 year 9 months) Technical Supervisor Sony Viet Nam August 2000  –  September 2008  (8 years 2 months) Vietnam Line leader Supervisor Sony Viet Nam August 2000  –  September 2008  (8 years 2 months) Vietnam Line leader Languages English English English Skills Microsoft Office Microsoft Excel Microsoft Word Customer Service PowerPoint English Windows Outlook Photoshop Teaching HTML I has L2 DEK galaxy, L3... Skills  Microsoft Office Microsoft Excel Microsoft Word Customer Service PowerPoint English Windows Outlook Photoshop Teaching HTML I has L2 DEK galaxy, L3... Microsoft Office Microsoft Excel Microsoft Word Customer Service PowerPoint English Windows Outlook Photoshop Teaching HTML I has L2 DEK galaxy, L3... Microsoft Office Microsoft Excel Microsoft Word Customer Service PowerPoint English Windows Outlook Photoshop Teaching HTML I has L2 DEK galaxy, L3... Education Bach Khoa science computer 2005  – 2006 Tran Khai Nguyen Bach Khoa science computer 2005  – 2006 Bach Khoa science computer 2005  – 2006 Bach Khoa science computer 2005  – 2006 Tran Khai Nguyen Tran Khai Nguyen Tran Khai Nguyen ", "Experience Equipment Specialist Intel Corporation May 2005  – Present (10 years 4 months) Customer engineer Applied Materials August 1995  –  February 2004  (8 years 7 months) Equipment Specialist Intel Corporation May 2005  – Present (10 years 4 months) Equipment Specialist Intel Corporation May 2005  – Present (10 years 4 months) Customer engineer Applied Materials August 1995  –  February 2004  (8 years 7 months) Customer engineer Applied Materials August 1995  –  February 2004  (8 years 7 months) Skills Semiconductors Semiconductor Industry Metrology CVD Test Equipment Silicon Failure Analysis Electronics IC Intel SPC Thin Films Manufacturing JMP Skills  Semiconductors Semiconductor Industry Metrology CVD Test Equipment Silicon Failure Analysis Electronics IC Intel SPC Thin Films Manufacturing JMP Semiconductors Semiconductor Industry Metrology CVD Test Equipment Silicon Failure Analysis Electronics IC Intel SPC Thin Films Manufacturing JMP Semiconductors Semiconductor Industry Metrology CVD Test Equipment Silicon Failure Analysis Electronics IC Intel SPC Thin Films Manufacturing JMP Education New England Institute of Technology Bachelor of Science (BS),  Electronics Engineering Technology , 3.61 GPA 1991  – 1995 Attleboro High School Machine Shop 1985  – 1988 New England Institute of Technology Bachelor of Science (BS),  Electronics Engineering Technology , 3.61 GPA 1991  – 1995 New England Institute of Technology Bachelor of Science (BS),  Electronics Engineering Technology , 3.61 GPA 1991  – 1995 New England Institute of Technology Bachelor of Science (BS),  Electronics Engineering Technology , 3.61 GPA 1991  – 1995 Attleboro High School Machine Shop 1985  – 1988 Attleboro High School Machine Shop 1985  – 1988 Attleboro High School Machine Shop 1985  – 1988 ", "Experience Equipment Specialist Intel Corporation January 2006  – Present (9 years 8 months) Manufacturing Tech Intel January 2010  –  April 2010  (4 months) Military United States Air Force January 1983  –  October 2005  (22 years 10 months) Equipment Specialist Intel Corporation January 2006  – Present (9 years 8 months) Equipment Specialist Intel Corporation January 2006  – Present (9 years 8 months) Manufacturing Tech Intel January 2010  –  April 2010  (4 months) Manufacturing Tech Intel January 2010  –  April 2010  (4 months) Military United States Air Force January 1983  –  October 2005  (22 years 10 months) Military United States Air Force January 1983  –  October 2005  (22 years 10 months) Skills Semiconductors Intel SPC Semiconductor Industry Failure Analysis Metrology JMP Design of Experiments Silicon Electronics Soldering Lean Manufacturing Skills  Semiconductors Intel SPC Semiconductor Industry Failure Analysis Metrology JMP Design of Experiments Silicon Electronics Soldering Lean Manufacturing Semiconductors Intel SPC Semiconductor Industry Failure Analysis Metrology JMP Design of Experiments Silicon Electronics Soldering Lean Manufacturing Semiconductors Intel SPC Semiconductor Industry Failure Analysis Metrology JMP Design of Experiments Silicon Electronics Soldering Lean Manufacturing Education Oklahoma City University Bachelor of Science (BS),  Professional , Technical, Business, and Scientific Writing 2003  – 2005 CCAF AAPS,  Avionics Maintenance Technology/Technician 1983  – 1998 Oklahoma City University Bachelor of Science (BS),  Professional , Technical, Business, and Scientific Writing 2003  – 2005 Oklahoma City University Bachelor of Science (BS),  Professional , Technical, Business, and Scientific Writing 2003  – 2005 Oklahoma City University Bachelor of Science (BS),  Professional , Technical, Business, and Scientific Writing 2003  – 2005 CCAF AAPS,  Avionics Maintenance Technology/Technician 1983  – 1998 CCAF AAPS,  Avionics Maintenance Technology/Technician 1983  – 1998 CCAF AAPS,  Avionics Maintenance Technology/Technician 1983  – 1998 ", "Experience Senior ES (Equipment Specialist) Intel Corporation July 2011  – Present (4 years 2 months) Ho Chi Minh city •\tTroubles shoot the machine’s issues, ensure the machine run smoothly without safety and quality issues to provide good quality products. \n \n•\tAttended PM (preventive maintenance) activities to prevent the all potential risks, detect and replace any parts were failed to make sure tool run smoothly. \n \n•\tLeading team to meet department’s targets and achieved with several wins for team in the competition from the department, especially was recognized rock star due to got the champion 5S for leading team keep cleaning for manufactory . \n \n•\tDiscussed with Engineer team to investigate and analyze to find out the root cause when facing the issue then resolve them and write summary report for the issue. Propose corrective and preventive action, key learning for team can learn and work better. \n \n•\tSupported for training new and old members successful and they can work on their expectations. Besides that, working as a buddy to share the experiences for colleges.  \n \n•\tWorked with technical team to install new machine when have new product. Have some ideas to improve for module like Learning card or Kaizen, submit many safety and quality early reports to prevent safety and quality issues which may happen for products. \n \n•\tGot a business trip to go Malaysia for learning new product. Learnt new technologies, process and new experiences at Malay site then come back Vietnam site, apply them for sustaining at the module and being a part of successfully to ramp up for new product.  \n ES (Equipment Specialist) Intel Corporation July 2011  – Present (4 years 2 months) Operate and trouble shoot the Machine. Fixing the almost hard down issues related to tool at Module. Main person to leading team ensure tool run smoothly without quality and safety issue. Senior ES (Equipment Specialist) Intel Corporation July 2011  – Present (4 years 2 months) Ho Chi Minh city •\tTroubles shoot the machine’s issues, ensure the machine run smoothly without safety and quality issues to provide good quality products. \n \n•\tAttended PM (preventive maintenance) activities to prevent the all potential risks, detect and replace any parts were failed to make sure tool run smoothly. \n \n•\tLeading team to meet department’s targets and achieved with several wins for team in the competition from the department, especially was recognized rock star due to got the champion 5S for leading team keep cleaning for manufactory . \n \n•\tDiscussed with Engineer team to investigate and analyze to find out the root cause when facing the issue then resolve them and write summary report for the issue. Propose corrective and preventive action, key learning for team can learn and work better. \n \n•\tSupported for training new and old members successful and they can work on their expectations. Besides that, working as a buddy to share the experiences for colleges.  \n \n•\tWorked with technical team to install new machine when have new product. Have some ideas to improve for module like Learning card or Kaizen, submit many safety and quality early reports to prevent safety and quality issues which may happen for products. \n \n•\tGot a business trip to go Malaysia for learning new product. Learnt new technologies, process and new experiences at Malay site then come back Vietnam site, apply them for sustaining at the module and being a part of successfully to ramp up for new product.  \n Senior ES (Equipment Specialist) Intel Corporation July 2011  – Present (4 years 2 months) Ho Chi Minh city •\tTroubles shoot the machine’s issues, ensure the machine run smoothly without safety and quality issues to provide good quality products. \n \n•\tAttended PM (preventive maintenance) activities to prevent the all potential risks, detect and replace any parts were failed to make sure tool run smoothly. \n \n•\tLeading team to meet department’s targets and achieved with several wins for team in the competition from the department, especially was recognized rock star due to got the champion 5S for leading team keep cleaning for manufactory . \n \n•\tDiscussed with Engineer team to investigate and analyze to find out the root cause when facing the issue then resolve them and write summary report for the issue. Propose corrective and preventive action, key learning for team can learn and work better. \n \n•\tSupported for training new and old members successful and they can work on their expectations. Besides that, working as a buddy to share the experiences for colleges.  \n \n•\tWorked with technical team to install new machine when have new product. Have some ideas to improve for module like Learning card or Kaizen, submit many safety and quality early reports to prevent safety and quality issues which may happen for products. \n \n•\tGot a business trip to go Malaysia for learning new product. Learnt new technologies, process and new experiences at Malay site then come back Vietnam site, apply them for sustaining at the module and being a part of successfully to ramp up for new product.  \n ES (Equipment Specialist) Intel Corporation July 2011  – Present (4 years 2 months) Operate and trouble shoot the Machine. Fixing the almost hard down issues related to tool at Module. Main person to leading team ensure tool run smoothly without quality and safety issue. ES (Equipment Specialist) Intel Corporation July 2011  – Present (4 years 2 months) Operate and trouble shoot the Machine. Fixing the almost hard down issues related to tool at Module. Main person to leading team ensure tool run smoothly without quality and safety issue. Education Industrial University of HCMC Automatic Electronic 2008  – 2011 Industrial University of HCMC Automatic Electronic 2008  – 2011 Industrial University of HCMC Automatic Electronic 2008  – 2011 Industrial University of HCMC Automatic Electronic 2008  – 2011 ", "Experience Equipment Specialist Intel Corporation Equipment Specialist Intel Corporation Equipment Specialist Intel Corporation ", "Experience Equipment Specialist Intel Corporation May 1998  – Present (17 years 4 months) Maintain - Repair - Calibrate - Hitachi Dry Etchers - Novellus Sabre Platers - Novellus Polishers Semiconductor Equipment Technician Digital Equipment Corporation December 1984  –  April 1998  (13 years 5 months) Equipment Specialist Intel Corporation May 1998  – Present (17 years 4 months) Maintain - Repair - Calibrate - Hitachi Dry Etchers - Novellus Sabre Platers - Novellus Polishers Equipment Specialist Intel Corporation May 1998  – Present (17 years 4 months) Maintain - Repair - Calibrate - Hitachi Dry Etchers - Novellus Sabre Platers - Novellus Polishers Semiconductor Equipment Technician Digital Equipment Corporation December 1984  –  April 1998  (13 years 5 months) Semiconductor Equipment Technician Digital Equipment Corporation December 1984  –  April 1998  (13 years 5 months) Skills Semiconductors Semiconductor Industry Metrology CVD Test Equipment Silicon Failure Analysis Electronics IC Intel SPC Thin Films Design of Experiments JMP Analog Electroplating Plasma Etch Lean Manufacturing Continuous Improvement Cross-functional Team... Troubleshooting Process Improvement Manufacturing Root Cause Analysis See 9+     See less Skills  Semiconductors Semiconductor Industry Metrology CVD Test Equipment Silicon Failure Analysis Electronics IC Intel SPC Thin Films Design of Experiments JMP Analog Electroplating Plasma Etch Lean Manufacturing Continuous Improvement Cross-functional Team... Troubleshooting Process Improvement Manufacturing Root Cause Analysis See 9+     See less Semiconductors Semiconductor Industry Metrology CVD Test Equipment Silicon Failure Analysis Electronics IC Intel SPC Thin Films Design of Experiments JMP Analog Electroplating Plasma Etch Lean Manufacturing Continuous Improvement Cross-functional Team... Troubleshooting Process Improvement Manufacturing Root Cause Analysis See 9+     See less Semiconductors Semiconductor Industry Metrology CVD Test Equipment Silicon Failure Analysis Electronics IC Intel SPC Thin Films Design of Experiments JMP Analog Electroplating Plasma Etch Lean Manufacturing Continuous Improvement Cross-functional Team... Troubleshooting Process Improvement Manufacturing Root Cause Analysis See 9+     See less Education Sylvania Tech Electronics 1981  – 1982 Military 1978  – 1981 Activities and Societies:  Radar Repair Technician - 2nd Echelon Maintenance Sylvania Tech Electronics 1981  – 1982 Sylvania Tech Electronics 1981  – 1982 Sylvania Tech Electronics 1981  – 1982 Military 1978  – 1981 Activities and Societies:  Radar Repair Technician - 2nd Echelon Maintenance Military 1978  – 1981 Activities and Societies:  Radar Repair Technician - 2nd Echelon Maintenance Military 1978  – 1981 Activities and Societies:  Radar Repair Technician - 2nd Echelon Maintenance ", "Experience Equipment Specialist Intel Corporation June 2000  – Present (15 years 3 months) Equipment Specialist Intel Corporation June 2000  – Present (15 years 3 months) Equipment Specialist Intel Corporation June 2000  – Present (15 years 3 months) Education New England Institute of Technology Associate's degree,  Electronics 1998  – 2000 Apponequet high school 1994  – 1998 New England Institute of Technology Associate's degree,  Electronics 1998  – 2000 New England Institute of Technology Associate's degree,  Electronics 1998  – 2000 New England Institute of Technology Associate's degree,  Electronics 1998  – 2000 Apponequet high school 1994  – 1998 Apponequet high school 1994  – 1998 Apponequet high school 1994  – 1998 ", "Summary I am a solutions-focused and motivated problem solver with over 17 years of High precision maintenance in the semi-conductor and Electronics manufacturing industries. Able to troubleshoot, analyze data and make decisions based on a broad technical background and knowledge base. Exceptional safety, computer and electromechanical skills Summary I am a solutions-focused and motivated problem solver with over 17 years of High precision maintenance in the semi-conductor and Electronics manufacturing industries. Able to troubleshoot, analyze data and make decisions based on a broad technical background and knowledge base. Exceptional safety, computer and electromechanical skills I am a solutions-focused and motivated problem solver with over 17 years of High precision maintenance in the semi-conductor and Electronics manufacturing industries. Able to troubleshoot, analyze data and make decisions based on a broad technical background and knowledge base. Exceptional safety, computer and electromechanical skills I am a solutions-focused and motivated problem solver with over 17 years of High precision maintenance in the semi-conductor and Electronics manufacturing industries. Able to troubleshoot, analyze data and make decisions based on a broad technical background and knowledge base. Exceptional safety, computer and electromechanical skills Experience Equipment Specialist Intel Corporation April 2002  – Present (13 years 5 months) Hudson, MA •\tSenior equipment specialist and equipment coordinator \n•\tRoutinely Performs preventive maintenance procedures on complicated semiconductor manufacturing equipment  \n•\tTroubleshoots any problems on equipment toolsets (electrical, mechanical, pneumatic and process). All issues are documented and preventive procedures are created to ensure repeat issues do no arise.  \n•\tWrites procedures and specs for tool maintenance utilizing technical writing experience \n•\tLead facilitator for the 168 hour, High Precision Maintenance Team. Creates meeting schedules and ensures Safety, and quality are priorities while continuously improving tool health, and availability.  \n•\tSenior process tech in the RTA area. Identified training gaps for new technicians. I created a process tech boot camp training package. Certified multiple process techs. \n•\tProvided Engineering coverage while there was an engineering transition. Assisted in training the oncoming RTA engineer on RTA operations and equipment.  \n•\tLead area trainer for process and equipment certifications in the RTA area. \n•\tTrained on multiple toolsets including Vertical Diffusion Furnaces and Ion Implanters \n•\tHas been recognized multiple times by the factory for a high level of Safety and quality awareness. Received factory recognition for hard work related to an excursion. Found process related issues that were from to a recent change and escalated to the integration department. This lead to resolving the excursion. Electromechanical Maintenance Technician NTS - National Technical Systems September 2001  –  February 2002  (6 months) Boxboro, MA •\tRan and repaired temperature and humidity environmental testing chambers for HALT (Highly accelerated Life testing) and HASS (Highly Accelerated Stress Screen) testing. \n•\tWorked directly with the customer to Design, create, and program ESS tools (Environmental Stress Screen) to the customer's specifications for testing product reliability. \n•\tObtained military clearance for military classified testing. Engineering Test Technician Solectron June 1998  –  May 2001  (3 years) Westborough, MA •\tRan, calibrated, and serviced GenRad testing machines for the ICT (In Circuit Test) area \n•\tMet in house with customers to create testing methods for the PCBs (printed circuit Boards) that were being manufactured in house under contract. \n•\tTraveled to customer's sites and worked with the engineers to create Specifications that would be used when testing the PCBs inline at the facility. \n•\tWorked on a HALT (Highly accelerated Life Test) system to guarantee product reliability. \n•\tObtained PCB surface mount, pin through hole, and BGA (Ball Grid Array) solder rework certifications. Equipment Specialist Intel Corporation April 2002  – Present (13 years 5 months) Hudson, MA •\tSenior equipment specialist and equipment coordinator \n•\tRoutinely Performs preventive maintenance procedures on complicated semiconductor manufacturing equipment  \n•\tTroubleshoots any problems on equipment toolsets (electrical, mechanical, pneumatic and process). All issues are documented and preventive procedures are created to ensure repeat issues do no arise.  \n•\tWrites procedures and specs for tool maintenance utilizing technical writing experience \n•\tLead facilitator for the 168 hour, High Precision Maintenance Team. Creates meeting schedules and ensures Safety, and quality are priorities while continuously improving tool health, and availability.  \n•\tSenior process tech in the RTA area. Identified training gaps for new technicians. I created a process tech boot camp training package. Certified multiple process techs. \n•\tProvided Engineering coverage while there was an engineering transition. Assisted in training the oncoming RTA engineer on RTA operations and equipment.  \n•\tLead area trainer for process and equipment certifications in the RTA area. \n•\tTrained on multiple toolsets including Vertical Diffusion Furnaces and Ion Implanters \n•\tHas been recognized multiple times by the factory for a high level of Safety and quality awareness. Received factory recognition for hard work related to an excursion. Found process related issues that were from to a recent change and escalated to the integration department. This lead to resolving the excursion. Equipment Specialist Intel Corporation April 2002  – Present (13 years 5 months) Hudson, MA •\tSenior equipment specialist and equipment coordinator \n•\tRoutinely Performs preventive maintenance procedures on complicated semiconductor manufacturing equipment  \n•\tTroubleshoots any problems on equipment toolsets (electrical, mechanical, pneumatic and process). All issues are documented and preventive procedures are created to ensure repeat issues do no arise.  \n•\tWrites procedures and specs for tool maintenance utilizing technical writing experience \n•\tLead facilitator for the 168 hour, High Precision Maintenance Team. Creates meeting schedules and ensures Safety, and quality are priorities while continuously improving tool health, and availability.  \n•\tSenior process tech in the RTA area. Identified training gaps for new technicians. I created a process tech boot camp training package. Certified multiple process techs. \n•\tProvided Engineering coverage while there was an engineering transition. Assisted in training the oncoming RTA engineer on RTA operations and equipment.  \n•\tLead area trainer for process and equipment certifications in the RTA area. \n•\tTrained on multiple toolsets including Vertical Diffusion Furnaces and Ion Implanters \n•\tHas been recognized multiple times by the factory for a high level of Safety and quality awareness. Received factory recognition for hard work related to an excursion. Found process related issues that were from to a recent change and escalated to the integration department. This lead to resolving the excursion. Electromechanical Maintenance Technician NTS - National Technical Systems September 2001  –  February 2002  (6 months) Boxboro, MA •\tRan and repaired temperature and humidity environmental testing chambers for HALT (Highly accelerated Life testing) and HASS (Highly Accelerated Stress Screen) testing. \n•\tWorked directly with the customer to Design, create, and program ESS tools (Environmental Stress Screen) to the customer's specifications for testing product reliability. \n•\tObtained military clearance for military classified testing. Electromechanical Maintenance Technician NTS - National Technical Systems September 2001  –  February 2002  (6 months) Boxboro, MA •\tRan and repaired temperature and humidity environmental testing chambers for HALT (Highly accelerated Life testing) and HASS (Highly Accelerated Stress Screen) testing. \n•\tWorked directly with the customer to Design, create, and program ESS tools (Environmental Stress Screen) to the customer's specifications for testing product reliability. \n•\tObtained military clearance for military classified testing. Engineering Test Technician Solectron June 1998  –  May 2001  (3 years) Westborough, MA •\tRan, calibrated, and serviced GenRad testing machines for the ICT (In Circuit Test) area \n•\tMet in house with customers to create testing methods for the PCBs (printed circuit Boards) that were being manufactured in house under contract. \n•\tTraveled to customer's sites and worked with the engineers to create Specifications that would be used when testing the PCBs inline at the facility. \n•\tWorked on a HALT (Highly accelerated Life Test) system to guarantee product reliability. \n•\tObtained PCB surface mount, pin through hole, and BGA (Ball Grid Array) solder rework certifications. Engineering Test Technician Solectron June 1998  –  May 2001  (3 years) Westborough, MA •\tRan, calibrated, and serviced GenRad testing machines for the ICT (In Circuit Test) area \n•\tMet in house with customers to create testing methods for the PCBs (printed circuit Boards) that were being manufactured in house under contract. \n•\tTraveled to customer's sites and worked with the engineers to create Specifications that would be used when testing the PCBs inline at the facility. \n•\tWorked on a HALT (Highly accelerated Life Test) system to guarantee product reliability. \n•\tObtained PCB surface mount, pin through hole, and BGA (Ball Grid Array) solder rework certifications. Languages English English English Skills Semiconductors Metrology CVD IC Silicon Analog Etching Failure Analysis Intel JMP PVD Photolithography Plasma Etch SPC Semiconductor Industry Test Equipment Thin Films Troubleshooting Design of Experiments Product Engineering UHV Clean Rooms Electro-mechanical Vacuum Yield RF Reliability Optics Electronics Equipment Maintenance Field Service Calibration Equipment Repair Ion Implantation Oscilloscope PECVD Robotics Sensors Photovoltaics See 24+     See less Skills  Semiconductors Metrology CVD IC Silicon Analog Etching Failure Analysis Intel JMP PVD Photolithography Plasma Etch SPC Semiconductor Industry Test Equipment Thin Films Troubleshooting Design of Experiments Product Engineering UHV Clean Rooms Electro-mechanical Vacuum Yield RF Reliability Optics Electronics Equipment Maintenance Field Service Calibration Equipment Repair Ion Implantation Oscilloscope PECVD Robotics Sensors Photovoltaics See 24+     See less Semiconductors Metrology CVD IC Silicon Analog Etching Failure Analysis Intel JMP PVD Photolithography Plasma Etch SPC Semiconductor Industry Test Equipment Thin Films Troubleshooting Design of Experiments Product Engineering UHV Clean Rooms Electro-mechanical Vacuum Yield RF Reliability Optics Electronics Equipment Maintenance Field Service Calibration Equipment Repair Ion Implantation Oscilloscope PECVD Robotics Sensors Photovoltaics See 24+     See less Semiconductors Metrology CVD IC Silicon Analog Etching Failure Analysis Intel JMP PVD Photolithography Plasma Etch SPC Semiconductor Industry Test Equipment Thin Films Troubleshooting Design of Experiments Product Engineering UHV Clean Rooms Electro-mechanical Vacuum Yield RF Reliability Optics Electronics Equipment Maintenance Field Service Calibration Equipment Repair Ion Implantation Oscilloscope PECVD Robotics Sensors Photovoltaics See 24+     See less Education Worcester Techinical Institute Electro-mechanical technologies with Semiconductor manufacturing,  Electrical/Electronics Maintenance and Repair Technology 1995  – 1997 Worcester Technical Institute Electro Mechanical,  Semiconductor Manufacturing Technology 1995  – 1997 Worcester Techinical Institute Electro-mechanical technologies with Semiconductor manufacturing,  Electrical/Electronics Maintenance and Repair Technology 1995  – 1997 Worcester Techinical Institute Electro-mechanical technologies with Semiconductor manufacturing,  Electrical/Electronics Maintenance and Repair Technology 1995  – 1997 Worcester Techinical Institute Electro-mechanical technologies with Semiconductor manufacturing,  Electrical/Electronics Maintenance and Repair Technology 1995  – 1997 Worcester Technical Institute Electro Mechanical,  Semiconductor Manufacturing Technology 1995  – 1997 Worcester Technical Institute Electro Mechanical,  Semiconductor Manufacturing Technology 1995  – 1997 Worcester Technical Institute Electro Mechanical,  Semiconductor Manufacturing Technology 1995  – 1997 ", "Experience MT Intel ASP Equipment Specialist Intel Corporation 2008  – Present (7 years) INTEL FAB28 \nTEL TELIUS & TACTRAS Platform Plasma Etchers 300MM  \nAdvance Skills L3 Equipment Specialist Equipment Specialist Intel Corporation 2006  –  2008  (2 years) Albuquerque, NM USA INTEL FAB11x \nTEL TELIUS Plasma Etchers 300MM  \nDRM SCCM L3 Equipment specialist Equipment Specialist Intel Corporation 2002  –  2006  (4 years) INTEL FAB18  \nTEL UNITY Plasma Etchers 200MM  \nL4 Equipment Specialist MT Intel MT Intel ASP Equipment Specialist Intel Corporation 2008  – Present (7 years) INTEL FAB28 \nTEL TELIUS & TACTRAS Platform Plasma Etchers 300MM  \nAdvance Skills L3 Equipment Specialist ASP Equipment Specialist Intel Corporation 2008  – Present (7 years) INTEL FAB28 \nTEL TELIUS & TACTRAS Platform Plasma Etchers 300MM  \nAdvance Skills L3 Equipment Specialist Equipment Specialist Intel Corporation 2006  –  2008  (2 years) Albuquerque, NM USA INTEL FAB11x \nTEL TELIUS Plasma Etchers 300MM  \nDRM SCCM L3 Equipment specialist Equipment Specialist Intel Corporation 2006  –  2008  (2 years) Albuquerque, NM USA INTEL FAB11x \nTEL TELIUS Plasma Etchers 300MM  \nDRM SCCM L3 Equipment specialist Equipment Specialist Intel Corporation 2002  –  2006  (4 years) INTEL FAB18  \nTEL UNITY Plasma Etchers 200MM  \nL4 Equipment Specialist Equipment Specialist Intel Corporation 2002  –  2006  (4 years) INTEL FAB18  \nTEL UNITY Plasma Etchers 200MM  \nL4 Equipment Specialist Languages English Hebrew Russian English Hebrew Russian English Hebrew Russian Skills Semiconductors Semiconductor Industry SPC Failure Analysis Intel JMP Design of Experiments Silicon Testing Dry Etch Telius Tactras Unity Skills  Semiconductors Semiconductor Industry SPC Failure Analysis Intel JMP Design of Experiments Silicon Testing Dry Etch Telius Tactras Unity Semiconductors Semiconductor Industry SPC Failure Analysis Intel JMP Design of Experiments Silicon Testing Dry Etch Telius Tactras Unity Semiconductors Semiconductor Industry SPC Failure Analysis Intel JMP Design of Experiments Silicon Testing Dry Etch Telius Tactras Unity Education Ashqelon Academic College PE in Software Engineering Ashqelon Academic College PE in Software Engineering Ashqelon Academic College PE in Software Engineering Ashqelon Academic College PE in Software Engineering ", "Summary After many years in the equipment maintenance function both on Satellite Earth Stations and Cleanroom Semiconductor Manufacturing I have developed the following proficiencies;  \n•\tExperienced Equipment Maintenance and Repair Technician. Performing troubleshooting, repair and preventive maintenance independently, with a high degree of quality and reliability, maintaining optimum performance greater than tool MOR. \n•\tExperienced in using Lean manufacturing to reduce costs and streamline production processes.  \n•\tInterfacing with various levels of management in manufacturing, engineering and support organizations and providing coaching and mentoring to Manufacturing technicians  \n•\tAdvanced problem solving and troubleshooting. Working with engineering and other cross functional groups to resolve maintenance issues, improve equipment reliability and minimize equipment unscheduled downtime, and running process experiments. \n•\tDevelop Standard Operating Procedures (SOP). Responsible to document, improve and standardize PMs and Specs to ISO standards.  \n•\tTeam player in high-producing teams while improving efficiency, work ethic and morale. \n•\tAdhering and role modeling all safety and cleanroom procedures and policies.  \n•\tLockout/Tagout and COHE knowledge. \n•\tRoot Cause Failure Analysis. \n•\tProficient in Microsoft Office and Microsoft Project. \n•\tStatistical Process Controls (SPC). \n•\tAbility to read and understand blueprints and schematic diagrams. \n•\tExtensive knowledge of high vacuum systems (Cryo and turbo pumps), electronics, robotics, stepper motors, fluid controls, gas delivery systems, power and temperature controls. Summary After many years in the equipment maintenance function both on Satellite Earth Stations and Cleanroom Semiconductor Manufacturing I have developed the following proficiencies;  \n•\tExperienced Equipment Maintenance and Repair Technician. Performing troubleshooting, repair and preventive maintenance independently, with a high degree of quality and reliability, maintaining optimum performance greater than tool MOR. \n•\tExperienced in using Lean manufacturing to reduce costs and streamline production processes.  \n•\tInterfacing with various levels of management in manufacturing, engineering and support organizations and providing coaching and mentoring to Manufacturing technicians  \n•\tAdvanced problem solving and troubleshooting. Working with engineering and other cross functional groups to resolve maintenance issues, improve equipment reliability and minimize equipment unscheduled downtime, and running process experiments. \n•\tDevelop Standard Operating Procedures (SOP). Responsible to document, improve and standardize PMs and Specs to ISO standards.  \n•\tTeam player in high-producing teams while improving efficiency, work ethic and morale. \n•\tAdhering and role modeling all safety and cleanroom procedures and policies.  \n•\tLockout/Tagout and COHE knowledge. \n•\tRoot Cause Failure Analysis. \n•\tProficient in Microsoft Office and Microsoft Project. \n•\tStatistical Process Controls (SPC). \n•\tAbility to read and understand blueprints and schematic diagrams. \n•\tExtensive knowledge of high vacuum systems (Cryo and turbo pumps), electronics, robotics, stepper motors, fluid controls, gas delivery systems, power and temperature controls. After many years in the equipment maintenance function both on Satellite Earth Stations and Cleanroom Semiconductor Manufacturing I have developed the following proficiencies;  \n•\tExperienced Equipment Maintenance and Repair Technician. Performing troubleshooting, repair and preventive maintenance independently, with a high degree of quality and reliability, maintaining optimum performance greater than tool MOR. \n•\tExperienced in using Lean manufacturing to reduce costs and streamline production processes.  \n•\tInterfacing with various levels of management in manufacturing, engineering and support organizations and providing coaching and mentoring to Manufacturing technicians  \n•\tAdvanced problem solving and troubleshooting. Working with engineering and other cross functional groups to resolve maintenance issues, improve equipment reliability and minimize equipment unscheduled downtime, and running process experiments. \n•\tDevelop Standard Operating Procedures (SOP). Responsible to document, improve and standardize PMs and Specs to ISO standards.  \n•\tTeam player in high-producing teams while improving efficiency, work ethic and morale. \n•\tAdhering and role modeling all safety and cleanroom procedures and policies.  \n•\tLockout/Tagout and COHE knowledge. \n•\tRoot Cause Failure Analysis. \n•\tProficient in Microsoft Office and Microsoft Project. \n•\tStatistical Process Controls (SPC). \n•\tAbility to read and understand blueprints and schematic diagrams. \n•\tExtensive knowledge of high vacuum systems (Cryo and turbo pumps), electronics, robotics, stepper motors, fluid controls, gas delivery systems, power and temperature controls. After many years in the equipment maintenance function both on Satellite Earth Stations and Cleanroom Semiconductor Manufacturing I have developed the following proficiencies;  \n•\tExperienced Equipment Maintenance and Repair Technician. Performing troubleshooting, repair and preventive maintenance independently, with a high degree of quality and reliability, maintaining optimum performance greater than tool MOR. \n•\tExperienced in using Lean manufacturing to reduce costs and streamline production processes.  \n•\tInterfacing with various levels of management in manufacturing, engineering and support organizations and providing coaching and mentoring to Manufacturing technicians  \n•\tAdvanced problem solving and troubleshooting. Working with engineering and other cross functional groups to resolve maintenance issues, improve equipment reliability and minimize equipment unscheduled downtime, and running process experiments. \n•\tDevelop Standard Operating Procedures (SOP). Responsible to document, improve and standardize PMs and Specs to ISO standards.  \n•\tTeam player in high-producing teams while improving efficiency, work ethic and morale. \n•\tAdhering and role modeling all safety and cleanroom procedures and policies.  \n•\tLockout/Tagout and COHE knowledge. \n•\tRoot Cause Failure Analysis. \n•\tProficient in Microsoft Office and Microsoft Project. \n•\tStatistical Process Controls (SPC). \n•\tAbility to read and understand blueprints and schematic diagrams. \n•\tExtensive knowledge of high vacuum systems (Cryo and turbo pumps), electronics, robotics, stepper motors, fluid controls, gas delivery systems, power and temperature controls. Experience Equipment Specialist Intel Corporation 1998  – Present (17 years) Hudson, MA Equipment specialist, responsible for repair and Preventative Maintenance of Novellus Sequel/Altus Plasma Deposition toolsets. Also trained in Applied Materials FABS-202 Planarization toolsets. Sr. Equipment Tech Digital Equipment Corp. 1995  –  1998  (3 years) Hudson, MA Maintenance technician, responsible for repair and Preventative Maintenance of MRC Mark4 Plasma Depsition toos and Novellus Speed/Altus Plasma Deposition toolsets. Satellite Equipment tech Raytheon Technical Services Company 1986  –  1995  (9 years) Operated and maintained Satellite earth stations under Air Force contracts Equipment Specialist Intel Corporation 1998  – Present (17 years) Hudson, MA Equipment specialist, responsible for repair and Preventative Maintenance of Novellus Sequel/Altus Plasma Deposition toolsets. Also trained in Applied Materials FABS-202 Planarization toolsets. Equipment Specialist Intel Corporation 1998  – Present (17 years) Hudson, MA Equipment specialist, responsible for repair and Preventative Maintenance of Novellus Sequel/Altus Plasma Deposition toolsets. Also trained in Applied Materials FABS-202 Planarization toolsets. Sr. Equipment Tech Digital Equipment Corp. 1995  –  1998  (3 years) Hudson, MA Maintenance technician, responsible for repair and Preventative Maintenance of MRC Mark4 Plasma Depsition toos and Novellus Speed/Altus Plasma Deposition toolsets. Sr. Equipment Tech Digital Equipment Corp. 1995  –  1998  (3 years) Hudson, MA Maintenance technician, responsible for repair and Preventative Maintenance of MRC Mark4 Plasma Depsition toos and Novellus Speed/Altus Plasma Deposition toolsets. Satellite Equipment tech Raytheon Technical Services Company 1986  –  1995  (9 years) Operated and maintained Satellite earth stations under Air Force contracts Satellite Equipment tech Raytheon Technical Services Company 1986  –  1995  (9 years) Operated and maintained Satellite earth stations under Air Force contracts Skills Semiconductors Metrology Failure Analysis SPC Manufacturing Satellite Semiconductor Industry CVD Test Equipment Silicon Electronics IC Intel Thin Films Design of Experiments JMP Analog Plasma Etch Troubleshooting Robotics Lean Manufacturing Air Force See 7+     See less Skills  Semiconductors Metrology Failure Analysis SPC Manufacturing Satellite Semiconductor Industry CVD Test Equipment Silicon Electronics IC Intel Thin Films Design of Experiments JMP Analog Plasma Etch Troubleshooting Robotics Lean Manufacturing Air Force See 7+     See less Semiconductors Metrology Failure Analysis SPC Manufacturing Satellite Semiconductor Industry CVD Test Equipment Silicon Electronics IC Intel Thin Films Design of Experiments JMP Analog Plasma Etch Troubleshooting Robotics Lean Manufacturing Air Force See 7+     See less Semiconductors Metrology Failure Analysis SPC Manufacturing Satellite Semiconductor Industry CVD Test Equipment Silicon Electronics IC Intel Thin Films Design of Experiments JMP Analog Plasma Etch Troubleshooting Robotics Lean Manufacturing Air Force See 7+     See less Education Bluffton High School Bluffton High School Bluffton High School Bluffton High School ", "Experience Equipment Specialist Intel Corporation April 2000  – Present (15 years 5 months) Specializing in repair and preventative maintenance for TEL Unity II Plasma Etcher,LRC Plasma Etcher, Hitachi M712 Advanced Plasma Etcher, and Hitachi M511 Advanced Plasma Etcher, Peer Trainer, Classroom Instructor, Training Co-ordinator. Technician Maidenform June 1996  –  March 2000  (3 years 10 months) Electronic circuit assembly and testing, Electronic circuit prototyping, Design and prototype construction of electro mechanical quality control equipment. Electronic equipment repair, Mechanical repair, Inventory management, Machine assembly and modification, Pnumatic control, Equipment Specialist Intel Corporation April 2000  – Present (15 years 5 months) Specializing in repair and preventative maintenance for TEL Unity II Plasma Etcher,LRC Plasma Etcher, Hitachi M712 Advanced Plasma Etcher, and Hitachi M511 Advanced Plasma Etcher, Peer Trainer, Classroom Instructor, Training Co-ordinator. Equipment Specialist Intel Corporation April 2000  – Present (15 years 5 months) Specializing in repair and preventative maintenance for TEL Unity II Plasma Etcher,LRC Plasma Etcher, Hitachi M712 Advanced Plasma Etcher, and Hitachi M511 Advanced Plasma Etcher, Peer Trainer, Classroom Instructor, Training Co-ordinator. Technician Maidenform June 1996  –  March 2000  (3 years 10 months) Electronic circuit assembly and testing, Electronic circuit prototyping, Design and prototype construction of electro mechanical quality control equipment. Electronic equipment repair, Mechanical repair, Inventory management, Machine assembly and modification, Pnumatic control, Technician Maidenform June 1996  –  March 2000  (3 years 10 months) Electronic circuit assembly and testing, Electronic circuit prototyping, Design and prototype construction of electro mechanical quality control equipment. Electronic equipment repair, Mechanical repair, Inventory management, Machine assembly and modification, Pnumatic control, Skills Safety Equipment Maintenance Semiconductors Semiconductor Industry Plasma Etch Troubleshooting Procedure Development Test Equipment Lean Manufacturing Metrology Silicon Failure Analysis Electronics Employee Training Classroom Delivery Electro-mechanical Mechanical Aptitude IC Intel Microsoft Office Training Co-ordination SPC Design of Experiments Manufacturing Pneumatics PLC Ladder Logic Boolean Logic RF Soldering CNC programing Circuit Analysis Refurbishing Testing Etching JMP See 20+     See less Skills  Safety Equipment Maintenance Semiconductors Semiconductor Industry Plasma Etch Troubleshooting Procedure Development Test Equipment Lean Manufacturing Metrology Silicon Failure Analysis Electronics Employee Training Classroom Delivery Electro-mechanical Mechanical Aptitude IC Intel Microsoft Office Training Co-ordination SPC Design of Experiments Manufacturing Pneumatics PLC Ladder Logic Boolean Logic RF Soldering CNC programing Circuit Analysis Refurbishing Testing Etching JMP See 20+     See less Safety Equipment Maintenance Semiconductors Semiconductor Industry Plasma Etch Troubleshooting Procedure Development Test Equipment Lean Manufacturing Metrology Silicon Failure Analysis Electronics Employee Training Classroom Delivery Electro-mechanical Mechanical Aptitude IC Intel Microsoft Office Training Co-ordination SPC Design of Experiments Manufacturing Pneumatics PLC Ladder Logic Boolean Logic RF Soldering CNC programing Circuit Analysis Refurbishing Testing Etching JMP See 20+     See less Safety Equipment Maintenance Semiconductors Semiconductor Industry Plasma Etch Troubleshooting Procedure Development Test Equipment Lean Manufacturing Metrology Silicon Failure Analysis Electronics Employee Training Classroom Delivery Electro-mechanical Mechanical Aptitude IC Intel Microsoft Office Training Co-ordination SPC Design of Experiments Manufacturing Pneumatics PLC Ladder Logic Boolean Logic RF Soldering CNC programing Circuit Analysis Refurbishing Testing Etching JMP See 20+     See less Education Mercer County Community College Associate of Science (AS),  Manufacturing Engineering New Jersey Institute of Technology 1988  – 1990 Mercer County Community College Associate of Science (AS),  Manufacturing Engineering Mercer County Community College Associate of Science (AS),  Manufacturing Engineering Mercer County Community College Associate of Science (AS),  Manufacturing Engineering New Jersey Institute of Technology 1988  – 1990 New Jersey Institute of Technology 1988  – 1990 New Jersey Institute of Technology 1988  – 1990 ", "Experience Equipment Specialist Intel Corporation June 2010  – Present (5 years 3 months) QA Technician SV TCL May 2008  –  June 2010  (2 years 2 months) Equipment Specialist Intel Corporation June 2010  – Present (5 years 3 months) Equipment Specialist Intel Corporation June 2010  – Present (5 years 3 months) QA Technician SV TCL May 2008  –  June 2010  (2 years 2 months) QA Technician SV TCL May 2008  –  June 2010  (2 years 2 months) Skills Microsoft Excel Microsoft Word PowerPoint English Windows Outlook Skills  Microsoft Excel Microsoft Word PowerPoint English Windows Outlook Microsoft Excel Microsoft Word PowerPoint English Windows Outlook Microsoft Excel Microsoft Word PowerPoint English Windows Outlook Education Ton Duc Thang University Bachelor's Degree 2008  – 2010 Ton Duc Thang University Bachelor's Degree 2008  – 2010 Ton Duc Thang University Bachelor's Degree 2008  – 2010 Ton Duc Thang University Bachelor's Degree 2008  – 2010 ", "Experience Equipment Specialist Intel Corporation May 1998  – Present (17 years 4 months) Greater Boston Area Equipment Specialist for Intel Corporation FAB 17 Equipment Technician Digital Equipment Corporation October 1995  –  May 1998  (2 years 8 months) Hudson, MA Digital Equipment Corp (DEC) Fab 6 Equipment Technician Equipment Specialist Intel Corporation May 1998  – Present (17 years 4 months) Greater Boston Area Equipment Specialist for Intel Corporation FAB 17 Equipment Specialist Intel Corporation May 1998  – Present (17 years 4 months) Greater Boston Area Equipment Specialist for Intel Corporation FAB 17 Equipment Technician Digital Equipment Corporation October 1995  –  May 1998  (2 years 8 months) Hudson, MA Digital Equipment Corp (DEC) Fab 6 Equipment Technician Equipment Technician Digital Equipment Corporation October 1995  –  May 1998  (2 years 8 months) Hudson, MA Digital Equipment Corp (DEC) Fab 6 Equipment Technician Languages English Native or bilingual proficiency English Native or bilingual proficiency English Native or bilingual proficiency Native or bilingual proficiency Skills Semiconductors Semiconductor Industry Metrology CVD Test Equipment Silicon Failure Analysis Electronics IC Intel SPC Thin Films Design of Experiments JMP Analog Skills  Semiconductors Semiconductor Industry Metrology CVD Test Equipment Silicon Failure Analysis Electronics IC Intel SPC Thin Films Design of Experiments JMP Analog Semiconductors Semiconductor Industry Metrology CVD Test Equipment Silicon Failure Analysis Electronics IC Intel SPC Thin Films Design of Experiments JMP Analog Semiconductors Semiconductor Industry Metrology CVD Test Equipment Silicon Failure Analysis Electronics IC Intel SPC Thin Films Design of Experiments JMP Analog Education Fitchburg State University Bachelor's Degree,  BS Electrical Engineering Technology; AS Manufacturing Engineering Technology ,  CS Programming 1987  – 1992 St Bernards Central Catholic High School High School,  Physics I , II Calculus, Programming in Basic, Religion, English, Civics, History, Latin I, II Typing 1983  – 1985 Fitchburg State University Bachelor's Degree,  BS Electrical Engineering Technology; AS Manufacturing Engineering Technology ,  CS Programming 1987  – 1992 Fitchburg State University Bachelor's Degree,  BS Electrical Engineering Technology; AS Manufacturing Engineering Technology ,  CS Programming 1987  – 1992 Fitchburg State University Bachelor's Degree,  BS Electrical Engineering Technology; AS Manufacturing Engineering Technology ,  CS Programming 1987  – 1992 St Bernards Central Catholic High School High School,  Physics I , II Calculus, Programming in Basic, Religion, English, Civics, History, Latin I, II Typing 1983  – 1985 St Bernards Central Catholic High School High School,  Physics I , II Calculus, Programming in Basic, Religion, English, Civics, History, Latin I, II Typing 1983  – 1985 St Bernards Central Catholic High School High School,  Physics I , II Calculus, Programming in Basic, Religion, English, Civics, History, Latin I, II Typing 1983  – 1985 ", "Experience Equipment Specialist Intel Corporation May 1998  – Present (17 years 4 months) Equipment Specialist Intel Corporation May 1998  – Present (17 years 4 months) Equipment Specialist Intel Corporation May 1998  – Present (17 years 4 months) Skills Metrology Semiconductor Industry Semiconductors Pneumatics Design of Experiments PVD SPC Preventive Maintenance Silicon JMP Reliability Characterization Failure Analysis Etching Thin Films Test Equipment Root Cause Analysis Lean Manufacturing Lithography CVD IC Plasma Etch Electronics Manufacturing See 9+     See less Skills  Metrology Semiconductor Industry Semiconductors Pneumatics Design of Experiments PVD SPC Preventive Maintenance Silicon JMP Reliability Characterization Failure Analysis Etching Thin Films Test Equipment Root Cause Analysis Lean Manufacturing Lithography CVD IC Plasma Etch Electronics Manufacturing See 9+     See less Metrology Semiconductor Industry Semiconductors Pneumatics Design of Experiments PVD SPC Preventive Maintenance Silicon JMP Reliability Characterization Failure Analysis Etching Thin Films Test Equipment Root Cause Analysis Lean Manufacturing Lithography CVD IC Plasma Etch Electronics Manufacturing See 9+     See less Metrology Semiconductor Industry Semiconductors Pneumatics Design of Experiments PVD SPC Preventive Maintenance Silicon JMP Reliability Characterization Failure Analysis Etching Thin Films Test Equipment Root Cause Analysis Lean Manufacturing Lithography CVD IC Plasma Etch Electronics Manufacturing See 9+     See less Education Shawsheen Valley Regional Vocational Technical School 1978  – 1982 Shawsheen Valley Regional Vocational Technical School 1978  – 1982 Shawsheen Valley Regional Vocational Technical School 1978  – 1982 Shawsheen Valley Regional Vocational Technical School 1978  – 1982 ", "Summary Solutions-focused, well organized, self-starting, highly motivated, creative problem solver with 13 years of high-volume manufacturing in the semi-conductor industry. Able to troubleshoot, analyze information and make decisions based on a broad technical background and knowledge base. Exceptional computer and electromechanical skills. A team-oriented leader that accomplishes work with uncompromising integrity and professionalism. Strives for and achieves the highest standards of excellence while ensuring a safe and injury-free workplace. \n \n Summary Solutions-focused, well organized, self-starting, highly motivated, creative problem solver with 13 years of high-volume manufacturing in the semi-conductor industry. Able to troubleshoot, analyze information and make decisions based on a broad technical background and knowledge base. Exceptional computer and electromechanical skills. A team-oriented leader that accomplishes work with uncompromising integrity and professionalism. Strives for and achieves the highest standards of excellence while ensuring a safe and injury-free workplace. \n \n Solutions-focused, well organized, self-starting, highly motivated, creative problem solver with 13 years of high-volume manufacturing in the semi-conductor industry. Able to troubleshoot, analyze information and make decisions based on a broad technical background and knowledge base. Exceptional computer and electromechanical skills. A team-oriented leader that accomplishes work with uncompromising integrity and professionalism. Strives for and achieves the highest standards of excellence while ensuring a safe and injury-free workplace. \n \n Solutions-focused, well organized, self-starting, highly motivated, creative problem solver with 13 years of high-volume manufacturing in the semi-conductor industry. Able to troubleshoot, analyze information and make decisions based on a broad technical background and knowledge base. Exceptional computer and electromechanical skills. A team-oriented leader that accomplishes work with uncompromising integrity and professionalism. Strives for and achieves the highest standards of excellence while ensuring a safe and injury-free workplace. \n \n Experience Lead Equipment Specialist Intel Corporation 2005  – Present (10 years) Hudson, MA Perform complex electrical/mechanical troubleshooting and preventative maintenance duties on semiconductor fabrication equipment in a clean room environment.  \n \n- Using Lean principles, re-engineered part which reduced time to repair by 80% with no loss of quality \n- Analyzed Energy Control Procedure as part of a Kaizen team. Completely revamped and standardized the safety specification eliminating the risk of serious injury. Subsequently took on role of inspector to ensure the procedures were followed.  \n- Designed and implemented a new Custodial LOTO tag program to eliminate tool damage. The program was adopted factory wide. \n- As Manufacturing Team Leader, coordinated equipment and personnel utilization to optimize work flow to meet factory target goals. \n- Trained colleagues on advanced processes to enable them to take on broader responsibilities. \n Residential Alarm Installer ADT 2000  –  2005  (5 years) Norwood, MA Alarm Installation Technician – ADT, Norwood, Massachusetts \nPerformed installation of new equipment for residential, small business or commercial customers. Tasks also included troubleshooting, repair and upgrading of existing systems, alleviate and advise customer concerns regarding their security system.  \n \n- Designed and installed security systems in accordance with NEC (National Electric Code) using hard-wired and wireless components. \n- Designed and installed fire alarms in accordance with NFPA 72 (National Fire Alarm Code). \n- Read blueprints, building and electrical plans in order to complete equipment repairs. \n- Followed safety practices to safeguard against injury and damage to property. Manager LKQ RT16 Used Auto parts 1988  –  2000  (12 years) Oversaw all facets of operations to reclaim reusable auto parts, safe disposal of hazardous materials and maintain inventory for resale. Managed personnel, vendors and procedures to ensure compliance with regulations and maximizing revenue. Lead Equipment Specialist Intel Corporation 2005  – Present (10 years) Hudson, MA Perform complex electrical/mechanical troubleshooting and preventative maintenance duties on semiconductor fabrication equipment in a clean room environment.  \n \n- Using Lean principles, re-engineered part which reduced time to repair by 80% with no loss of quality \n- Analyzed Energy Control Procedure as part of a Kaizen team. Completely revamped and standardized the safety specification eliminating the risk of serious injury. Subsequently took on role of inspector to ensure the procedures were followed.  \n- Designed and implemented a new Custodial LOTO tag program to eliminate tool damage. The program was adopted factory wide. \n- As Manufacturing Team Leader, coordinated equipment and personnel utilization to optimize work flow to meet factory target goals. \n- Trained colleagues on advanced processes to enable them to take on broader responsibilities. \n Lead Equipment Specialist Intel Corporation 2005  – Present (10 years) Hudson, MA Perform complex electrical/mechanical troubleshooting and preventative maintenance duties on semiconductor fabrication equipment in a clean room environment.  \n \n- Using Lean principles, re-engineered part which reduced time to repair by 80% with no loss of quality \n- Analyzed Energy Control Procedure as part of a Kaizen team. Completely revamped and standardized the safety specification eliminating the risk of serious injury. Subsequently took on role of inspector to ensure the procedures were followed.  \n- Designed and implemented a new Custodial LOTO tag program to eliminate tool damage. The program was adopted factory wide. \n- As Manufacturing Team Leader, coordinated equipment and personnel utilization to optimize work flow to meet factory target goals. \n- Trained colleagues on advanced processes to enable them to take on broader responsibilities. \n Residential Alarm Installer ADT 2000  –  2005  (5 years) Norwood, MA Alarm Installation Technician – ADT, Norwood, Massachusetts \nPerformed installation of new equipment for residential, small business or commercial customers. Tasks also included troubleshooting, repair and upgrading of existing systems, alleviate and advise customer concerns regarding their security system.  \n \n- Designed and installed security systems in accordance with NEC (National Electric Code) using hard-wired and wireless components. \n- Designed and installed fire alarms in accordance with NFPA 72 (National Fire Alarm Code). \n- Read blueprints, building and electrical plans in order to complete equipment repairs. \n- Followed safety practices to safeguard against injury and damage to property. Residential Alarm Installer ADT 2000  –  2005  (5 years) Norwood, MA Alarm Installation Technician – ADT, Norwood, Massachusetts \nPerformed installation of new equipment for residential, small business or commercial customers. Tasks also included troubleshooting, repair and upgrading of existing systems, alleviate and advise customer concerns regarding their security system.  \n \n- Designed and installed security systems in accordance with NEC (National Electric Code) using hard-wired and wireless components. \n- Designed and installed fire alarms in accordance with NFPA 72 (National Fire Alarm Code). \n- Read blueprints, building and electrical plans in order to complete equipment repairs. \n- Followed safety practices to safeguard against injury and damage to property. Manager LKQ RT16 Used Auto parts 1988  –  2000  (12 years) Oversaw all facets of operations to reclaim reusable auto parts, safe disposal of hazardous materials and maintain inventory for resale. Managed personnel, vendors and procedures to ensure compliance with regulations and maximizing revenue. Manager LKQ RT16 Used Auto parts 1988  –  2000  (12 years) Oversaw all facets of operations to reclaim reusable auto parts, safe disposal of hazardous materials and maintain inventory for resale. Managed personnel, vendors and procedures to ensure compliance with regulations and maximizing revenue. Skills Lean Manufacturing Continuous Improvement Troubleshooting Training Electronics Process Improvement SPC Manufacturing Lock Out Tag Out Hazardous Materials Test Equipment Semiconductor Industry Management Customer Service Metrology Failure Analysis Operations Management Six Sigma Team Building Clean Rooms Technical Writing Semiconductors Cross-functional Team... See 8+     See less Skills  Lean Manufacturing Continuous Improvement Troubleshooting Training Electronics Process Improvement SPC Manufacturing Lock Out Tag Out Hazardous Materials Test Equipment Semiconductor Industry Management Customer Service Metrology Failure Analysis Operations Management Six Sigma Team Building Clean Rooms Technical Writing Semiconductors Cross-functional Team... See 8+     See less Lean Manufacturing Continuous Improvement Troubleshooting Training Electronics Process Improvement SPC Manufacturing Lock Out Tag Out Hazardous Materials Test Equipment Semiconductor Industry Management Customer Service Metrology Failure Analysis Operations Management Six Sigma Team Building Clean Rooms Technical Writing Semiconductors Cross-functional Team... See 8+     See less Lean Manufacturing Continuous Improvement Troubleshooting Training Electronics Process Improvement SPC Manufacturing Lock Out Tag Out Hazardous Materials Test Equipment Semiconductor Industry Management Customer Service Metrology Failure Analysis Operations Management Six Sigma Team Building Clean Rooms Technical Writing Semiconductors Cross-functional Team... See 8+     See less Education ITT technical institute Associate's degree,  Electronic Technologies ITT technical institute Associate's degree,  Electronic Technologies ITT technical institute Associate's degree,  Electronic Technologies ITT technical institute Associate's degree,  Electronic Technologies ", "Experience Equipment Specialist Intel Corporation August 2000  – Present (15 years 1 month) Equipment Specialist Intel Corporation August 2000  – Present (15 years 1 month) Equipment Specialist Intel Corporation August 2000  – Present (15 years 1 month) Skills Semiconductors Semiconductor Industry Metrology Test Equipment Failure Analysis Electronics IC Intel SPC Skills  Semiconductors Semiconductor Industry Metrology Test Equipment Failure Analysis Electronics IC Intel SPC Semiconductors Semiconductor Industry Metrology Test Equipment Failure Analysis Electronics IC Intel SPC Semiconductors Semiconductor Industry Metrology Test Equipment Failure Analysis Electronics IC Intel SPC Education New England Institute of Technology Associate of Science (A.S.),  Electrical and Electronics Engineering 1998  – 2000 New England Institute of Technology Associate of Science (A.S.),  Electrical and Electronics Engineering 1998  – 2000 New England Institute of Technology Associate of Science (A.S.),  Electrical and Electronics Engineering 1998  – 2000 New England Institute of Technology Associate of Science (A.S.),  Electrical and Electronics Engineering 1998  – 2000 ", "Experience Equipment Specialist Intel Corporation Equipment Specialist Intel Corporation Equipment Specialist Intel Corporation ", "Summary email: nashurov@yahoo.com \nphone#: 972-547484150  \n \nI have managed Technicians team in very dynamic stress full environment by giving priorities to quality, safety and customer satisfaction  \n \nI have 15 years experience in troubleshooting, upgrades and repair electronic equipment, supplies, high vacuum, pneumatic and mechanical systems. Failure analysis, process and tool improvement, projects management, technical reports and preparing equipment modifications, identify safety requirements and write required procedures \n Summary email: nashurov@yahoo.com \nphone#: 972-547484150  \n \nI have managed Technicians team in very dynamic stress full environment by giving priorities to quality, safety and customer satisfaction  \n \nI have 15 years experience in troubleshooting, upgrades and repair electronic equipment, supplies, high vacuum, pneumatic and mechanical systems. Failure analysis, process and tool improvement, projects management, technical reports and preparing equipment modifications, identify safety requirements and write required procedures \n email: nashurov@yahoo.com \nphone#: 972-547484150  \n \nI have managed Technicians team in very dynamic stress full environment by giving priorities to quality, safety and customer satisfaction  \n \nI have 15 years experience in troubleshooting, upgrades and repair electronic equipment, supplies, high vacuum, pneumatic and mechanical systems. Failure analysis, process and tool improvement, projects management, technical reports and preparing equipment modifications, identify safety requirements and write required procedures \n email: nashurov@yahoo.com \nphone#: 972-547484150  \n \nI have managed Technicians team in very dynamic stress full environment by giving priorities to quality, safety and customer satisfaction  \n \nI have 15 years experience in troubleshooting, upgrades and repair electronic equipment, supplies, high vacuum, pneumatic and mechanical systems. Failure analysis, process and tool improvement, projects management, technical reports and preparing equipment modifications, identify safety requirements and write required procedures \n Experience Sort Fab28 Intel Corporation April 2011  –  January 2015  (3 years 10 months) Israel Intel, Fab28 Sort April 2011- December 2014 \nADVANTEST (testers)/ TEL (probers) Equipment specialist. \nDaily responsibility included preventative maintenance, troubleshooting, upgrades and repair electronic equipment.  \nArea Coordinator of the Sort Shift2 \nDaily responsibility included coordination of all activities in Sort area between Eng, MFS and shift MSs, providing priorities of tasks performance in case of lack of hand counts.  \nNew tools install at Sort project (EPCOT) member, used to work as Point of Contact and managed contractor's activities Implant(Semiconductors) Equipment Specialist Intel Corporation October 2000  –  January 2011  (10 years 4 months) Israel Intel, Fab18 Implant June 2002- April 2011 \nJob description: \nImplanter’s functional area specialist. Technicians Manager  \nDaily responsibility included preventative maintenance, troubleshooting, upgrades and repair electronic equipment, supplies, high vacuum, pneumatic and mechanical systems. Failure analysis, process and tool improvement, projects management, technical reports and preparing equipment modifications, identify safety requirements and write required procedures.  \nNew process transfer and adjustment. Worked at Fab11 Albuquerque, NM USA for half year as part of On The Job training on new toolsets. Participate at Global Factory technician’s team. Have a high level equipment certification on Varian E500, E1000 and Kestrel750 tools. Tool Expert of Varian E1000 toolset \n Implant(Semiconductors) Equipment Specialist Intel Corporation April 2005  –  October 2005  (7 months) Albuquerque, New Mexico Area On the Job training Assigment on Fab11 (intel). Was sent for training and on new tool sets for high level knowledge New process transfer and adjustment. Participate at Global Factory technician’s team.  Security Gimmick Security services company September 1998  –  October 2000  (2 years 2 months) Sort Fab28 Intel Corporation April 2011  –  January 2015  (3 years 10 months) Israel Intel, Fab28 Sort April 2011- December 2014 \nADVANTEST (testers)/ TEL (probers) Equipment specialist. \nDaily responsibility included preventative maintenance, troubleshooting, upgrades and repair electronic equipment.  \nArea Coordinator of the Sort Shift2 \nDaily responsibility included coordination of all activities in Sort area between Eng, MFS and shift MSs, providing priorities of tasks performance in case of lack of hand counts.  \nNew tools install at Sort project (EPCOT) member, used to work as Point of Contact and managed contractor's activities Sort Fab28 Intel Corporation April 2011  –  January 2015  (3 years 10 months) Israel Intel, Fab28 Sort April 2011- December 2014 \nADVANTEST (testers)/ TEL (probers) Equipment specialist. \nDaily responsibility included preventative maintenance, troubleshooting, upgrades and repair electronic equipment.  \nArea Coordinator of the Sort Shift2 \nDaily responsibility included coordination of all activities in Sort area between Eng, MFS and shift MSs, providing priorities of tasks performance in case of lack of hand counts.  \nNew tools install at Sort project (EPCOT) member, used to work as Point of Contact and managed contractor's activities Implant(Semiconductors) Equipment Specialist Intel Corporation October 2000  –  January 2011  (10 years 4 months) Israel Intel, Fab18 Implant June 2002- April 2011 \nJob description: \nImplanter’s functional area specialist. Technicians Manager  \nDaily responsibility included preventative maintenance, troubleshooting, upgrades and repair electronic equipment, supplies, high vacuum, pneumatic and mechanical systems. Failure analysis, process and tool improvement, projects management, technical reports and preparing equipment modifications, identify safety requirements and write required procedures.  \nNew process transfer and adjustment. Worked at Fab11 Albuquerque, NM USA for half year as part of On The Job training on new toolsets. Participate at Global Factory technician’s team. Have a high level equipment certification on Varian E500, E1000 and Kestrel750 tools. Tool Expert of Varian E1000 toolset \n Implant(Semiconductors) Equipment Specialist Intel Corporation October 2000  –  January 2011  (10 years 4 months) Israel Intel, Fab18 Implant June 2002- April 2011 \nJob description: \nImplanter’s functional area specialist. Technicians Manager  \nDaily responsibility included preventative maintenance, troubleshooting, upgrades and repair electronic equipment, supplies, high vacuum, pneumatic and mechanical systems. Failure analysis, process and tool improvement, projects management, technical reports and preparing equipment modifications, identify safety requirements and write required procedures.  \nNew process transfer and adjustment. Worked at Fab11 Albuquerque, NM USA for half year as part of On The Job training on new toolsets. Participate at Global Factory technician’s team. Have a high level equipment certification on Varian E500, E1000 and Kestrel750 tools. Tool Expert of Varian E1000 toolset \n Implant(Semiconductors) Equipment Specialist Intel Corporation April 2005  –  October 2005  (7 months) Albuquerque, New Mexico Area On the Job training Assigment on Fab11 (intel). Was sent for training and on new tool sets for high level knowledge New process transfer and adjustment. Participate at Global Factory technician’s team.  Implant(Semiconductors) Equipment Specialist Intel Corporation April 2005  –  October 2005  (7 months) Albuquerque, New Mexico Area On the Job training Assigment on Fab11 (intel). Was sent for training and on new tool sets for high level knowledge New process transfer and adjustment. Participate at Global Factory technician’s team.  Security Gimmick Security services company September 1998  –  October 2000  (2 years 2 months) Security Gimmick Security services company September 1998  –  October 2000  (2 years 2 months) Languages Hebrew Russian English Hebrew Russian English Hebrew Russian English Skills Electronics Manufacturing Semiconductors Testing Troubleshooting Engineering Management Wireless Equipment Installation New Technology... SPC Lean Manufacturing Mechatronics Vacuum Chambers Electrical... Skills  Electronics Manufacturing Semiconductors Testing Troubleshooting Engineering Management Wireless Equipment Installation New Technology... SPC Lean Manufacturing Mechatronics Vacuum Chambers Electrical... Electronics Manufacturing Semiconductors Testing Troubleshooting Engineering Management Wireless Equipment Installation New Technology... SPC Lean Manufacturing Mechatronics Vacuum Chambers Electrical... Electronics Manufacturing Semiconductors Testing Troubleshooting Engineering Management Wireless Equipment Installation New Technology... SPC Lean Manufacturing Mechatronics Vacuum Chambers Electrical... Education Sapir College Bachelor's degree,  Engineering/Industrial Management 2012  – 2013 Haven't comleted yet  Sapir College, School of Practical Engineers ( Electrical & Electronic Engineering) Practical Engineer,  Electrical , Electronic and Communications Engineering Technology/Technician 1998  – 2000 Sapir College Bachelor's degree,  Engineering/Industrial Management 2012  – 2013 Haven't comleted yet  Sapir College Bachelor's degree,  Engineering/Industrial Management 2012  – 2013 Haven't comleted yet  Sapir College Bachelor's degree,  Engineering/Industrial Management 2012  – 2013 Haven't comleted yet  Sapir College, School of Practical Engineers ( Electrical & Electronic Engineering) Practical Engineer,  Electrical , Electronic and Communications Engineering Technology/Technician 1998  – 2000 Sapir College, School of Practical Engineers ( Electrical & Electronic Engineering) Practical Engineer,  Electrical , Electronic and Communications Engineering Technology/Technician 1998  – 2000 Sapir College, School of Practical Engineers ( Electrical & Electronic Engineering) Practical Engineer,  Electrical , Electronic and Communications Engineering Technology/Technician 1998  – 2000 ", "Experience Equipment Specialist Intel Corporation April 2001  – Present (14 years 5 months) Equipment Specialist Intel Corporation April 2001  – Present (14 years 5 months) Equipment Specialist Intel Corporation April 2001  – Present (14 years 5 months) ", "Experience Equipment Specialist Intel Corporation October 2005  – Present (9 years 11 months) Equipment Specialist Intel Corporation October 2005  – Present (9 years 11 months) Equipment Specialist Intel Corporation October 2005  – Present (9 years 11 months) Skills Semiconductors CVD Semiconductor Industry Failure Analysis Skills  Semiconductors CVD Semiconductor Industry Failure Analysis Semiconductors CVD Semiconductor Industry Failure Analysis Semiconductors CVD Semiconductor Industry Failure Analysis "]}