{"position": "Facilities Operations Manager", "company": "Intel Corporation", "profiles": ["Experience Americas EHS Regional Manager Intel Corporation July 2015  – Present (2 months) Portland, Oregon Area Americas EHS Regional Manager Intel Corporation July 2015  – Present (2 months) Portland, Oregon Area Americas EHS Regional Manager Intel Corporation July 2015  – Present (2 months) Portland, Oregon Area Skills EHS Safety Management... Occupational Health Industrial Hygiene Ergonomics Risk Assessment Program Management Skills  EHS Safety Management... Occupational Health Industrial Hygiene Ergonomics Risk Assessment Program Management EHS Safety Management... Occupational Health Industrial Hygiene Ergonomics Risk Assessment Program Management EHS Safety Management... Occupational Health Industrial Hygiene Ergonomics Risk Assessment Program Management ", "Summary I bring 26 years of strategic and facility operational management achievements in providing leadership and proven results in the various positions in Facility Operations Management, Real Estate; and Business Operations responsibilities spreading from the USA to Latin America, and Canada. I have managed facility operations, real estate and lease negotiation/administration at various capacities across the America’s for office buildings; complex critical semiconductor manufacturing facilities, data centers, repair shops, warehouses and distributions centers. Under my direction and leadership I developed and improved every organization while delivering precise results. Most recent noteworthy accomplishments at VeriFone; has been designing, constructing and consolidating the Companies SJC Headquarters and establishing global Workplace Guidelines. At IBS I partner with CEO & Sr. VP’s to develop and establish the company’s vision, mission, strategic objectives, product roadmap, and implementation of various business processes & employee development. At Intel I grew the largest Intel Corporate Air Shuttle and managed some of the most complex facilities operations. Key strengths are leadership, innovation, embrace change, think out of the box, program and project management, contract and logistics management and possess the ability to balance the tradeoffs between operation risk and investment while seeking highest quality and best value. Each successive position brought new challenges and increased levels of responsibilities and diversified my skills.  Summary I bring 26 years of strategic and facility operational management achievements in providing leadership and proven results in the various positions in Facility Operations Management, Real Estate; and Business Operations responsibilities spreading from the USA to Latin America, and Canada. I have managed facility operations, real estate and lease negotiation/administration at various capacities across the America’s for office buildings; complex critical semiconductor manufacturing facilities, data centers, repair shops, warehouses and distributions centers. Under my direction and leadership I developed and improved every organization while delivering precise results. Most recent noteworthy accomplishments at VeriFone; has been designing, constructing and consolidating the Companies SJC Headquarters and establishing global Workplace Guidelines. At IBS I partner with CEO & Sr. VP’s to develop and establish the company’s vision, mission, strategic objectives, product roadmap, and implementation of various business processes & employee development. At Intel I grew the largest Intel Corporate Air Shuttle and managed some of the most complex facilities operations. Key strengths are leadership, innovation, embrace change, think out of the box, program and project management, contract and logistics management and possess the ability to balance the tradeoffs between operation risk and investment while seeking highest quality and best value. Each successive position brought new challenges and increased levels of responsibilities and diversified my skills.  I bring 26 years of strategic and facility operational management achievements in providing leadership and proven results in the various positions in Facility Operations Management, Real Estate; and Business Operations responsibilities spreading from the USA to Latin America, and Canada. I have managed facility operations, real estate and lease negotiation/administration at various capacities across the America’s for office buildings; complex critical semiconductor manufacturing facilities, data centers, repair shops, warehouses and distributions centers. Under my direction and leadership I developed and improved every organization while delivering precise results. Most recent noteworthy accomplishments at VeriFone; has been designing, constructing and consolidating the Companies SJC Headquarters and establishing global Workplace Guidelines. At IBS I partner with CEO & Sr. VP’s to develop and establish the company’s vision, mission, strategic objectives, product roadmap, and implementation of various business processes & employee development. At Intel I grew the largest Intel Corporate Air Shuttle and managed some of the most complex facilities operations. Key strengths are leadership, innovation, embrace change, think out of the box, program and project management, contract and logistics management and possess the ability to balance the tradeoffs between operation risk and investment while seeking highest quality and best value. Each successive position brought new challenges and increased levels of responsibilities and diversified my skills.  I bring 26 years of strategic and facility operational management achievements in providing leadership and proven results in the various positions in Facility Operations Management, Real Estate; and Business Operations responsibilities spreading from the USA to Latin America, and Canada. I have managed facility operations, real estate and lease negotiation/administration at various capacities across the America’s for office buildings; complex critical semiconductor manufacturing facilities, data centers, repair shops, warehouses and distributions centers. Under my direction and leadership I developed and improved every organization while delivering precise results. Most recent noteworthy accomplishments at VeriFone; has been designing, constructing and consolidating the Companies SJC Headquarters and establishing global Workplace Guidelines. At IBS I partner with CEO & Sr. VP’s to develop and establish the company’s vision, mission, strategic objectives, product roadmap, and implementation of various business processes & employee development. At Intel I grew the largest Intel Corporate Air Shuttle and managed some of the most complex facilities operations. Key strengths are leadership, innovation, embrace change, think out of the box, program and project management, contract and logistics management and possess the ability to balance the tradeoffs between operation risk and investment while seeking highest quality and best value. Each successive position brought new challenges and increased levels of responsibilities and diversified my skills.  Experience Position – Sr. Facilities Director for North & South AMR Verifone March 2014  – Present (1 year 6 months) Rocklin, California Responsible for managing the day to day and strategic real estate facilities portfolio for the America’s which includes 48 facilities and services in Canada, USA, and Latin America. It covers 1,968 employees and 712,000 square feet of leased facilities. Management of the Real Estate Portfolio which included lease negotiations, financial analysis, administration, programming, project management, execution, getting the facilities ready for occupancy. Also in charge of relocating the employees, operations and properly surrendering the old facility in order to provide the office environment required for each unique situation. Other responsibilities include managing employees, budget, decision making, establishing processes, and providing leadership and guidance to the executive management team on strategic management of our real estate portfolio. Partnership and collaboration with all facility suppliers while driving customer value. Key deliverables have been the design and development of the SJC Company Headquarters for 80k square feet for about 400 +employees and delivering Global Corporate Workplace Guidelines which included establishing standards for furniture, architectural finishes; Audio Video; Security Systems. Complete Real Estate Portfolio management for the America’s including negotiations in Spanish. Senior Director of Operations Integrated Building Solutions March 2013  –  February 2014  (1 year) Provided leadership and oversight of the Company Operations. Partnered with CEO and Sr. VP to establish the company’s vision, mission and strategic objectives, policies and practices. Kept organization on track to reach their KPI’s through planning, directing and coordinating activities regarding everything from policies to people. Led the development of the product roadmap, planning, execution, and streamlining the operations, which also included an initiative toward operational excellence (Services). Drove efficiency improvements on the operational systems, processes and policies in support of the organizations mission specifically development better management reporting, information flow management, business processes and organizational planning. Increased the effectiveness and efficiency of company (engineering, software developer, project management and services) through improvements to each function as well as coordination and communication between support, business functions and customers. Developed a lean and efficient org structure and human serviced activities. Direct supervision and management of daily operations and ~20 employees. Aviation Director Intel Corporation June 2009  –  November 2012  (3 years 6 months) Folsom CA 95630 Responsible for daily management and strategic direction for the aviation program. The program enabled business by linking five sites (AZ, FM, SC, OR and WA) with safe, secure, reliable and cost-effective services. . Inclusive of flight operations, maintenance, airport facilities, ground transportation and customer service. Transitioned the program to be the largest, most efficient and cost effective corporate air shuttle service in the US. It offered 142 flights a week with 6 Embraer ERJ’s and a Beechcraft 1900 airplanes. Delivered best aircraft uptime 99.3%; 215,237 productivity hours saved; load factor 89%; obtained 94.1% on-time arrival; customer satisfaction survey rating program the best service 98.4%. Managed Intel employees and ~110 contractors while managing a budget of ~$48 Million. Partnered with purchasing/Legal and negotiated with Embraer to acquire 6 new 145 XR’s (50 seat planes) to be delivered in 2012/2013. Arizona and Latin America Operations Site Manager Intel Corporation January 2008  –  June 2009  (1 year 6 months) Arizona USA; LAR (Brazil, Buenos Aires, Cordova, Guadalajara, Mex City & others Responsible for all strategic and day to day facility services for Arizona and Latin America (Buenos Aires, Cordova, Guadalajara, Mexico City, Brazil and other small sales offices) these included servicing ~8000 employees; ~ 2.7M square feet of space. Services included all facilities operations (engineering, electrical, mechanical, controls, fire & security systems, space planning, food services, landscaping and janitorial) projects, and environmental health and safety compliance. This included an operational budget of $52M dollars and direct management of 28 Intel employees and 210 contractors. California Facilities Operations Manager Intel Corporation April 2002  –  January 2008  (5 years 10 months) Santa Clara and Folsom California Responsible for managing a safe and cost effective operation inclusive of all services (food services, landscaping, janitorial and engineering). Maintaining all utilities including power, high purity water, chemicals, gas & environment controls and security systems. Included critical operations for manufacturing and high performance data centers. Worked closely with the local agencies (Fire Department, OSHA and others) in order to meet safety, environmental and code compliance. Property management of over 100 acres and servicing ~14,000+ employees in Folsom and Santa Clara. Directly managed 7 supervisors and ~98 employees with an operational budget of ~$56M. Regional Strategic Business Manager Intel Corporation January 2001  –  April 2002  (1 year 4 months) Albuquerque, New Mexico and Santa Clara California Responsible for all strategic and tactical business programs, training, leadership development (pipeline & succession, technical development), standardization, benchmarking, organizational health survey and safety self-assessment programs. Drove Internal/external benchmarking, budget development, ISO quality system compliance and document management systems. Partnered and collaborated with 11 senior managers to achieve operational excellence for an organization of 155 employees. Directly managed 6 employees and annual budget of ~$5.6M dollars. Information Systemss e-Business Manager Intel Corporation March 1999  –  January 2001  (1 year 11 months) Albuquerque, New Mexico Responsible for leading the team in the development and execution of the first on-line Storefront tool and Directory of Services application. The tool allowed over 100,000 employees to request services through an on line tool. Influenced the successful deployment of a global application to ensure all corporate and facility services were successfully delivered. Drove global marketing and communication plans as well as the training materials. Directly managed 9 employees and a budget of $4.9M dollars FAB7/9 Facilities Operations Manager Intel Corporation April 1995  –  March 1999  (4 years) Albuquerque, New Mexico facility services and utility systems (chemical and gas pad, electrical, process-cooling water, process vacuum, HVAC, controls, calibrations, exhaust systems, house vacuum, custodial and food services. Led and embraced regionalization by consolidating the action line, maintenance and safety standards. Directly managed 7 supervisors and over 148 technicians and a budget of ~$72M dollars.  \n \nNote: Other positions held from January 1989 to April 1995 were Property Manager, Project Management and Planning. Position – Sr. Facilities Director for North & South AMR Verifone March 2014  – Present (1 year 6 months) Rocklin, California Responsible for managing the day to day and strategic real estate facilities portfolio for the America’s which includes 48 facilities and services in Canada, USA, and Latin America. It covers 1,968 employees and 712,000 square feet of leased facilities. Management of the Real Estate Portfolio which included lease negotiations, financial analysis, administration, programming, project management, execution, getting the facilities ready for occupancy. Also in charge of relocating the employees, operations and properly surrendering the old facility in order to provide the office environment required for each unique situation. Other responsibilities include managing employees, budget, decision making, establishing processes, and providing leadership and guidance to the executive management team on strategic management of our real estate portfolio. Partnership and collaboration with all facility suppliers while driving customer value. Key deliverables have been the design and development of the SJC Company Headquarters for 80k square feet for about 400 +employees and delivering Global Corporate Workplace Guidelines which included establishing standards for furniture, architectural finishes; Audio Video; Security Systems. Complete Real Estate Portfolio management for the America’s including negotiations in Spanish. Position – Sr. Facilities Director for North & South AMR Verifone March 2014  – Present (1 year 6 months) Rocklin, California Responsible for managing the day to day and strategic real estate facilities portfolio for the America’s which includes 48 facilities and services in Canada, USA, and Latin America. It covers 1,968 employees and 712,000 square feet of leased facilities. Management of the Real Estate Portfolio which included lease negotiations, financial analysis, administration, programming, project management, execution, getting the facilities ready for occupancy. Also in charge of relocating the employees, operations and properly surrendering the old facility in order to provide the office environment required for each unique situation. Other responsibilities include managing employees, budget, decision making, establishing processes, and providing leadership and guidance to the executive management team on strategic management of our real estate portfolio. Partnership and collaboration with all facility suppliers while driving customer value. Key deliverables have been the design and development of the SJC Company Headquarters for 80k square feet for about 400 +employees and delivering Global Corporate Workplace Guidelines which included establishing standards for furniture, architectural finishes; Audio Video; Security Systems. Complete Real Estate Portfolio management for the America’s including negotiations in Spanish. Senior Director of Operations Integrated Building Solutions March 2013  –  February 2014  (1 year) Provided leadership and oversight of the Company Operations. Partnered with CEO and Sr. VP to establish the company’s vision, mission and strategic objectives, policies and practices. Kept organization on track to reach their KPI’s through planning, directing and coordinating activities regarding everything from policies to people. Led the development of the product roadmap, planning, execution, and streamlining the operations, which also included an initiative toward operational excellence (Services). Drove efficiency improvements on the operational systems, processes and policies in support of the organizations mission specifically development better management reporting, information flow management, business processes and organizational planning. Increased the effectiveness and efficiency of company (engineering, software developer, project management and services) through improvements to each function as well as coordination and communication between support, business functions and customers. Developed a lean and efficient org structure and human serviced activities. Direct supervision and management of daily operations and ~20 employees. Senior Director of Operations Integrated Building Solutions March 2013  –  February 2014  (1 year) Provided leadership and oversight of the Company Operations. Partnered with CEO and Sr. VP to establish the company’s vision, mission and strategic objectives, policies and practices. Kept organization on track to reach their KPI’s through planning, directing and coordinating activities regarding everything from policies to people. Led the development of the product roadmap, planning, execution, and streamlining the operations, which also included an initiative toward operational excellence (Services). Drove efficiency improvements on the operational systems, processes and policies in support of the organizations mission specifically development better management reporting, information flow management, business processes and organizational planning. Increased the effectiveness and efficiency of company (engineering, software developer, project management and services) through improvements to each function as well as coordination and communication between support, business functions and customers. Developed a lean and efficient org structure and human serviced activities. Direct supervision and management of daily operations and ~20 employees. Aviation Director Intel Corporation June 2009  –  November 2012  (3 years 6 months) Folsom CA 95630 Responsible for daily management and strategic direction for the aviation program. The program enabled business by linking five sites (AZ, FM, SC, OR and WA) with safe, secure, reliable and cost-effective services. . Inclusive of flight operations, maintenance, airport facilities, ground transportation and customer service. Transitioned the program to be the largest, most efficient and cost effective corporate air shuttle service in the US. It offered 142 flights a week with 6 Embraer ERJ’s and a Beechcraft 1900 airplanes. Delivered best aircraft uptime 99.3%; 215,237 productivity hours saved; load factor 89%; obtained 94.1% on-time arrival; customer satisfaction survey rating program the best service 98.4%. Managed Intel employees and ~110 contractors while managing a budget of ~$48 Million. Partnered with purchasing/Legal and negotiated with Embraer to acquire 6 new 145 XR’s (50 seat planes) to be delivered in 2012/2013. Aviation Director Intel Corporation June 2009  –  November 2012  (3 years 6 months) Folsom CA 95630 Responsible for daily management and strategic direction for the aviation program. The program enabled business by linking five sites (AZ, FM, SC, OR and WA) with safe, secure, reliable and cost-effective services. . Inclusive of flight operations, maintenance, airport facilities, ground transportation and customer service. Transitioned the program to be the largest, most efficient and cost effective corporate air shuttle service in the US. It offered 142 flights a week with 6 Embraer ERJ’s and a Beechcraft 1900 airplanes. Delivered best aircraft uptime 99.3%; 215,237 productivity hours saved; load factor 89%; obtained 94.1% on-time arrival; customer satisfaction survey rating program the best service 98.4%. Managed Intel employees and ~110 contractors while managing a budget of ~$48 Million. Partnered with purchasing/Legal and negotiated with Embraer to acquire 6 new 145 XR’s (50 seat planes) to be delivered in 2012/2013. Arizona and Latin America Operations Site Manager Intel Corporation January 2008  –  June 2009  (1 year 6 months) Arizona USA; LAR (Brazil, Buenos Aires, Cordova, Guadalajara, Mex City & others Responsible for all strategic and day to day facility services for Arizona and Latin America (Buenos Aires, Cordova, Guadalajara, Mexico City, Brazil and other small sales offices) these included servicing ~8000 employees; ~ 2.7M square feet of space. Services included all facilities operations (engineering, electrical, mechanical, controls, fire & security systems, space planning, food services, landscaping and janitorial) projects, and environmental health and safety compliance. This included an operational budget of $52M dollars and direct management of 28 Intel employees and 210 contractors. Arizona and Latin America Operations Site Manager Intel Corporation January 2008  –  June 2009  (1 year 6 months) Arizona USA; LAR (Brazil, Buenos Aires, Cordova, Guadalajara, Mex City & others Responsible for all strategic and day to day facility services for Arizona and Latin America (Buenos Aires, Cordova, Guadalajara, Mexico City, Brazil and other small sales offices) these included servicing ~8000 employees; ~ 2.7M square feet of space. Services included all facilities operations (engineering, electrical, mechanical, controls, fire & security systems, space planning, food services, landscaping and janitorial) projects, and environmental health and safety compliance. This included an operational budget of $52M dollars and direct management of 28 Intel employees and 210 contractors. California Facilities Operations Manager Intel Corporation April 2002  –  January 2008  (5 years 10 months) Santa Clara and Folsom California Responsible for managing a safe and cost effective operation inclusive of all services (food services, landscaping, janitorial and engineering). Maintaining all utilities including power, high purity water, chemicals, gas & environment controls and security systems. Included critical operations for manufacturing and high performance data centers. Worked closely with the local agencies (Fire Department, OSHA and others) in order to meet safety, environmental and code compliance. Property management of over 100 acres and servicing ~14,000+ employees in Folsom and Santa Clara. Directly managed 7 supervisors and ~98 employees with an operational budget of ~$56M. California Facilities Operations Manager Intel Corporation April 2002  –  January 2008  (5 years 10 months) Santa Clara and Folsom California Responsible for managing a safe and cost effective operation inclusive of all services (food services, landscaping, janitorial and engineering). Maintaining all utilities including power, high purity water, chemicals, gas & environment controls and security systems. Included critical operations for manufacturing and high performance data centers. Worked closely with the local agencies (Fire Department, OSHA and others) in order to meet safety, environmental and code compliance. Property management of over 100 acres and servicing ~14,000+ employees in Folsom and Santa Clara. Directly managed 7 supervisors and ~98 employees with an operational budget of ~$56M. Regional Strategic Business Manager Intel Corporation January 2001  –  April 2002  (1 year 4 months) Albuquerque, New Mexico and Santa Clara California Responsible for all strategic and tactical business programs, training, leadership development (pipeline & succession, technical development), standardization, benchmarking, organizational health survey and safety self-assessment programs. Drove Internal/external benchmarking, budget development, ISO quality system compliance and document management systems. Partnered and collaborated with 11 senior managers to achieve operational excellence for an organization of 155 employees. Directly managed 6 employees and annual budget of ~$5.6M dollars. Regional Strategic Business Manager Intel Corporation January 2001  –  April 2002  (1 year 4 months) Albuquerque, New Mexico and Santa Clara California Responsible for all strategic and tactical business programs, training, leadership development (pipeline & succession, technical development), standardization, benchmarking, organizational health survey and safety self-assessment programs. Drove Internal/external benchmarking, budget development, ISO quality system compliance and document management systems. Partnered and collaborated with 11 senior managers to achieve operational excellence for an organization of 155 employees. Directly managed 6 employees and annual budget of ~$5.6M dollars. Information Systemss e-Business Manager Intel Corporation March 1999  –  January 2001  (1 year 11 months) Albuquerque, New Mexico Responsible for leading the team in the development and execution of the first on-line Storefront tool and Directory of Services application. The tool allowed over 100,000 employees to request services through an on line tool. Influenced the successful deployment of a global application to ensure all corporate and facility services were successfully delivered. Drove global marketing and communication plans as well as the training materials. Directly managed 9 employees and a budget of $4.9M dollars Information Systemss e-Business Manager Intel Corporation March 1999  –  January 2001  (1 year 11 months) Albuquerque, New Mexico Responsible for leading the team in the development and execution of the first on-line Storefront tool and Directory of Services application. The tool allowed over 100,000 employees to request services through an on line tool. Influenced the successful deployment of a global application to ensure all corporate and facility services were successfully delivered. Drove global marketing and communication plans as well as the training materials. Directly managed 9 employees and a budget of $4.9M dollars FAB7/9 Facilities Operations Manager Intel Corporation April 1995  –  March 1999  (4 years) Albuquerque, New Mexico facility services and utility systems (chemical and gas pad, electrical, process-cooling water, process vacuum, HVAC, controls, calibrations, exhaust systems, house vacuum, custodial and food services. Led and embraced regionalization by consolidating the action line, maintenance and safety standards. Directly managed 7 supervisors and over 148 technicians and a budget of ~$72M dollars.  \n \nNote: Other positions held from January 1989 to April 1995 were Property Manager, Project Management and Planning. FAB7/9 Facilities Operations Manager Intel Corporation April 1995  –  March 1999  (4 years) Albuquerque, New Mexico facility services and utility systems (chemical and gas pad, electrical, process-cooling water, process vacuum, HVAC, controls, calibrations, exhaust systems, house vacuum, custodial and food services. Led and embraced regionalization by consolidating the action line, maintenance and safety standards. Directly managed 7 supervisors and over 148 technicians and a budget of ~$72M dollars.  \n \nNote: Other positions held from January 1989 to April 1995 were Property Manager, Project Management and Planning. Skills Semiconductors Program Management Manufacturing SPC Intel Cross-functional Team... Engineering Management Semiconductor Industry Design of Experiments Lean Manufacturing Process Engineering IC Engineering Leadership Process Improvement Management Project Management See 2+     See less Skills  Semiconductors Program Management Manufacturing SPC Intel Cross-functional Team... Engineering Management Semiconductor Industry Design of Experiments Lean Manufacturing Process Engineering IC Engineering Leadership Process Improvement Management Project Management See 2+     See less Semiconductors Program Management Manufacturing SPC Intel Cross-functional Team... Engineering Management Semiconductor Industry Design of Experiments Lean Manufacturing Process Engineering IC Engineering Leadership Process Improvement Management Project Management See 2+     See less Semiconductors Program Management Manufacturing SPC Intel Cross-functional Team... Engineering Management Semiconductor Industry Design of Experiments Lean Manufacturing Process Engineering IC Engineering Leadership Process Improvement Management Project Management See 2+     See less Education Fresno State University Fresno State University Fresno State University Fresno State University ", "Summary M.S. in Management, B.S. in Physics, Project Management experience in Construction, Factory Start Up and Commissioning and Business Process Improvement Implementation. High Volume Clean Room Manufacturing and Data Center Critical Utility Support System Management Experience. Experienced at leading diverse multinational and multi-site teams. Experience and education in TPM, TQM, Lean Manufacturing, 5S, Continuous Improvement, and reengineering principles and practices. \nGreater than 20 years experience managing and supervising managers, engineers and technicians. Concurrently managed 5 locations with diverse groups and workforce of >100.  \nNew site startup and site acquisition integration experience. Summary M.S. in Management, B.S. in Physics, Project Management experience in Construction, Factory Start Up and Commissioning and Business Process Improvement Implementation. High Volume Clean Room Manufacturing and Data Center Critical Utility Support System Management Experience. Experienced at leading diverse multinational and multi-site teams. Experience and education in TPM, TQM, Lean Manufacturing, 5S, Continuous Improvement, and reengineering principles and practices. \nGreater than 20 years experience managing and supervising managers, engineers and technicians. Concurrently managed 5 locations with diverse groups and workforce of >100.  \nNew site startup and site acquisition integration experience. M.S. in Management, B.S. in Physics, Project Management experience in Construction, Factory Start Up and Commissioning and Business Process Improvement Implementation. High Volume Clean Room Manufacturing and Data Center Critical Utility Support System Management Experience. Experienced at leading diverse multinational and multi-site teams. Experience and education in TPM, TQM, Lean Manufacturing, 5S, Continuous Improvement, and reengineering principles and practices. \nGreater than 20 years experience managing and supervising managers, engineers and technicians. Concurrently managed 5 locations with diverse groups and workforce of >100.  \nNew site startup and site acquisition integration experience. M.S. in Management, B.S. in Physics, Project Management experience in Construction, Factory Start Up and Commissioning and Business Process Improvement Implementation. High Volume Clean Room Manufacturing and Data Center Critical Utility Support System Management Experience. Experienced at leading diverse multinational and multi-site teams. Experience and education in TPM, TQM, Lean Manufacturing, 5S, Continuous Improvement, and reengineering principles and practices. \nGreater than 20 years experience managing and supervising managers, engineers and technicians. Concurrently managed 5 locations with diverse groups and workforce of >100.  \nNew site startup and site acquisition integration experience. Experience Corporate Facilities Engineering and Projects Manager Cree January 2014  – Present (1 year 8 months) Raleigh-Durham, North Carolina Area Manage Corporate Facilities Engineering, Projects, and Space Planning departments: Established Project Management and Design Standards and Specifications for R&D, Production, and Office Facilities in North Carolina, Wisconsin, and China. \n \nLead Design and Construction of new semiconductor production facility in Durham. \n \nImplemented sustaining engineering mindset within organization to implement Facilities and Infrastructure Key Performance and Capacity indicators. \n \nImplemented Corporate Space Planning system and established new employee work environment standards to increase collaboration, innovation, and productivity while increasing employee workplace satisfaction. \n Head of Facilities GLOBALFOUNDRIES February 2011  –  January 2014  (3 years) Malta, NY Manage Campus wide Facilities organization in support of Site and Semiconductor Manufacturing operations: Tool Install, Mechanical, Electrical, High Purity Chemicals, Bulk & Specialty Gases, Ultrapure Water and Industrial Waste, Capital Improvement Projects, Building Services, Cafeteria, Landscape. \nLead new site start-up activities, established Site Facilities operating principles and practices. Leader of cross company Facilities Capital Efficiency Team. Senior Manager, Facilities Samsung Austin Semiconductor November 2005  –  February 2011  (5 years 4 months) Austin, Texas Area  Managed the Site Facilities Operations, Maintenance, Engineering, EHS and Landscape departments. \nLead multinational Construction Design Review and Start-up and Commissioning for $3.5 Billion, New 300 mm Nanotechnology Manufacturing site and the renovation/conversion of existing 200 mm to 300 mm manufacturing site. \nDeveloped and implemented staffing, budget and strategic operational plans for new factory’s utility and environmental compliance support systems. \nImplemented System Improvement Team organizational structure to ensure standardization of operations, develop best known methods, and implement system quality and performance metrics and foster innovation. \n Facilities Manager BAE Systems January 2003  –  November 2005  (2 years 11 months) Austin, Texas Area  Managed Site Operations, Maintenance, and Janitorial, Cafeteria, Landscape and Projects departments for locations in Austin, TX and Mojave, CA.  \n \nResponsible for critical utility system design, upkeep and expansion for data center, electronic production facility, and engineering development laboratories. \n \nNegotiated Service Level Agreements (SLAs) and contract terms with internal and external customers. \n \nImplemented business process improvement and continuous improvement methodologies which reduced cost by 10% in first year. \n Site Facilities Operations Manager Intel Corporation May 1994  –  January 2003  (8 years 9 months)  Lead green-field start-up of 1.3 million square foot manufacturing campus. \n \nManaged for five locations, responsible for the 7x24 sustaining operations of semiconductor manufacturing, data center operations, engineering design centers, and office complexes. \n \nProgram lead for corporate wide Total Productive Maintenance (TPM) initiative. Initiative resulted in 20% efficiency increase in facilities operations and subsequent 34% decrease in operating expenses. \n \nChaired Corporate Technical Services Quality System Development activities and drove implementation of Self Assessment program and TQM principles.  \n \nChairperson Corporation’s Ultra Pure Water joint engineering team responsible for organizational effectiveness.  \n \n*Received Divisional Recognition Award for developing Technical Training process. \n*Technical Paper published and accepted to IMEC2000. Corporate Facilities Engineering and Projects Manager Cree January 2014  – Present (1 year 8 months) Raleigh-Durham, North Carolina Area Manage Corporate Facilities Engineering, Projects, and Space Planning departments: Established Project Management and Design Standards and Specifications for R&D, Production, and Office Facilities in North Carolina, Wisconsin, and China. \n \nLead Design and Construction of new semiconductor production facility in Durham. \n \nImplemented sustaining engineering mindset within organization to implement Facilities and Infrastructure Key Performance and Capacity indicators. \n \nImplemented Corporate Space Planning system and established new employee work environment standards to increase collaboration, innovation, and productivity while increasing employee workplace satisfaction. \n Corporate Facilities Engineering and Projects Manager Cree January 2014  – Present (1 year 8 months) Raleigh-Durham, North Carolina Area Manage Corporate Facilities Engineering, Projects, and Space Planning departments: Established Project Management and Design Standards and Specifications for R&D, Production, and Office Facilities in North Carolina, Wisconsin, and China. \n \nLead Design and Construction of new semiconductor production facility in Durham. \n \nImplemented sustaining engineering mindset within organization to implement Facilities and Infrastructure Key Performance and Capacity indicators. \n \nImplemented Corporate Space Planning system and established new employee work environment standards to increase collaboration, innovation, and productivity while increasing employee workplace satisfaction. \n Head of Facilities GLOBALFOUNDRIES February 2011  –  January 2014  (3 years) Malta, NY Manage Campus wide Facilities organization in support of Site and Semiconductor Manufacturing operations: Tool Install, Mechanical, Electrical, High Purity Chemicals, Bulk & Specialty Gases, Ultrapure Water and Industrial Waste, Capital Improvement Projects, Building Services, Cafeteria, Landscape. \nLead new site start-up activities, established Site Facilities operating principles and practices. Leader of cross company Facilities Capital Efficiency Team. Head of Facilities GLOBALFOUNDRIES February 2011  –  January 2014  (3 years) Malta, NY Manage Campus wide Facilities organization in support of Site and Semiconductor Manufacturing operations: Tool Install, Mechanical, Electrical, High Purity Chemicals, Bulk & Specialty Gases, Ultrapure Water and Industrial Waste, Capital Improvement Projects, Building Services, Cafeteria, Landscape. \nLead new site start-up activities, established Site Facilities operating principles and practices. Leader of cross company Facilities Capital Efficiency Team. Senior Manager, Facilities Samsung Austin Semiconductor November 2005  –  February 2011  (5 years 4 months) Austin, Texas Area  Managed the Site Facilities Operations, Maintenance, Engineering, EHS and Landscape departments. \nLead multinational Construction Design Review and Start-up and Commissioning for $3.5 Billion, New 300 mm Nanotechnology Manufacturing site and the renovation/conversion of existing 200 mm to 300 mm manufacturing site. \nDeveloped and implemented staffing, budget and strategic operational plans for new factory’s utility and environmental compliance support systems. \nImplemented System Improvement Team organizational structure to ensure standardization of operations, develop best known methods, and implement system quality and performance metrics and foster innovation. \n Senior Manager, Facilities Samsung Austin Semiconductor November 2005  –  February 2011  (5 years 4 months) Austin, Texas Area  Managed the Site Facilities Operations, Maintenance, Engineering, EHS and Landscape departments. \nLead multinational Construction Design Review and Start-up and Commissioning for $3.5 Billion, New 300 mm Nanotechnology Manufacturing site and the renovation/conversion of existing 200 mm to 300 mm manufacturing site. \nDeveloped and implemented staffing, budget and strategic operational plans for new factory’s utility and environmental compliance support systems. \nImplemented System Improvement Team organizational structure to ensure standardization of operations, develop best known methods, and implement system quality and performance metrics and foster innovation. \n Facilities Manager BAE Systems January 2003  –  November 2005  (2 years 11 months) Austin, Texas Area  Managed Site Operations, Maintenance, and Janitorial, Cafeteria, Landscape and Projects departments for locations in Austin, TX and Mojave, CA.  \n \nResponsible for critical utility system design, upkeep and expansion for data center, electronic production facility, and engineering development laboratories. \n \nNegotiated Service Level Agreements (SLAs) and contract terms with internal and external customers. \n \nImplemented business process improvement and continuous improvement methodologies which reduced cost by 10% in first year. \n Facilities Manager BAE Systems January 2003  –  November 2005  (2 years 11 months) Austin, Texas Area  Managed Site Operations, Maintenance, and Janitorial, Cafeteria, Landscape and Projects departments for locations in Austin, TX and Mojave, CA.  \n \nResponsible for critical utility system design, upkeep and expansion for data center, electronic production facility, and engineering development laboratories. \n \nNegotiated Service Level Agreements (SLAs) and contract terms with internal and external customers. \n \nImplemented business process improvement and continuous improvement methodologies which reduced cost by 10% in first year. \n Site Facilities Operations Manager Intel Corporation May 1994  –  January 2003  (8 years 9 months)  Lead green-field start-up of 1.3 million square foot manufacturing campus. \n \nManaged for five locations, responsible for the 7x24 sustaining operations of semiconductor manufacturing, data center operations, engineering design centers, and office complexes. \n \nProgram lead for corporate wide Total Productive Maintenance (TPM) initiative. Initiative resulted in 20% efficiency increase in facilities operations and subsequent 34% decrease in operating expenses. \n \nChaired Corporate Technical Services Quality System Development activities and drove implementation of Self Assessment program and TQM principles.  \n \nChairperson Corporation’s Ultra Pure Water joint engineering team responsible for organizational effectiveness.  \n \n*Received Divisional Recognition Award for developing Technical Training process. \n*Technical Paper published and accepted to IMEC2000. Site Facilities Operations Manager Intel Corporation May 1994  –  January 2003  (8 years 9 months)  Lead green-field start-up of 1.3 million square foot manufacturing campus. \n \nManaged for five locations, responsible for the 7x24 sustaining operations of semiconductor manufacturing, data center operations, engineering design centers, and office complexes. \n \nProgram lead for corporate wide Total Productive Maintenance (TPM) initiative. Initiative resulted in 20% efficiency increase in facilities operations and subsequent 34% decrease in operating expenses. \n \nChaired Corporate Technical Services Quality System Development activities and drove implementation of Self Assessment program and TQM principles.  \n \nChairperson Corporation’s Ultra Pure Water joint engineering team responsible for organizational effectiveness.  \n \n*Received Divisional Recognition Award for developing Technical Training process. \n*Technical Paper published and accepted to IMEC2000. Skills Continuous Improvement Lean Manufacturing Manufacturing Start-ups Facilities Management Project Management Strategic Planning Engineering Business Process... Semiconductors Skills  Continuous Improvement Lean Manufacturing Manufacturing Start-ups Facilities Management Project Management Strategic Planning Engineering Business Process... Semiconductors Continuous Improvement Lean Manufacturing Manufacturing Start-ups Facilities Management Project Management Strategic Planning Engineering Business Process... Semiconductors Continuous Improvement Lean Manufacturing Manufacturing Start-ups Facilities Management Project Management Strategic Planning Engineering Business Process... Semiconductors Education Worcester Polytechnic Institute Master's of Science,  Management 1999  – 2005 The University of Texas at Dallas Bachelor of Applied Science (B.A.Sc.),  Physics 1988  – 1993 Worcester Polytechnic Institute Master's of Science,  Management 1999  – 2005 Worcester Polytechnic Institute Master's of Science,  Management 1999  – 2005 Worcester Polytechnic Institute Master's of Science,  Management 1999  – 2005 The University of Texas at Dallas Bachelor of Applied Science (B.A.Sc.),  Physics 1988  – 1993 The University of Texas at Dallas Bachelor of Applied Science (B.A.Sc.),  Physics 1988  – 1993 The University of Texas at Dallas Bachelor of Applied Science (B.A.Sc.),  Physics 1988  – 1993 ", "Experience Facilities Operations Manager Intel Corporation Facilities Operations Manager Intel Corporation Facilities Operations Manager Intel Corporation Education Universidad Fidélitas 1996  – 2003 Universidad Fidélitas 1996  – 2003 Universidad Fidélitas 1996  – 2003 Universidad Fidélitas 1996  – 2003 ", "Summary Senior facilities management professional responsible for technical operations of over 16 M square feet of a commercial lab portfolio across core life science markets in the US and UK. \n \nSpecialties: Sustainability, Energy and Asset Management, Manufacturing and Commercial Real Estate Operations. Summary Senior facilities management professional responsible for technical operations of over 16 M square feet of a commercial lab portfolio across core life science markets in the US and UK. \n \nSpecialties: Sustainability, Energy and Asset Management, Manufacturing and Commercial Real Estate Operations. Senior facilities management professional responsible for technical operations of over 16 M square feet of a commercial lab portfolio across core life science markets in the US and UK. \n \nSpecialties: Sustainability, Energy and Asset Management, Manufacturing and Commercial Real Estate Operations. Senior facilities management professional responsible for technical operations of over 16 M square feet of a commercial lab portfolio across core life science markets in the US and UK. \n \nSpecialties: Sustainability, Energy and Asset Management, Manufacturing and Commercial Real Estate Operations. Experience Vice President, Facilities BioMed Realty Trust January 2015  – Present (8 months) Senior Director, East Coast Operations BioMed Realty Trust January 2011  –  December 2014  (4 years) Cambridge, Ma Regional Director, East Coast Facilities BioMed Realty Trust April 2010  –  August 2011  (1 year 5 months) Facilities director responsible for facilities management of biotech properties within the east coast region. Director of Site Operations NPS LLC June 2004  –  April 2010  (5 years 11 months) Senior Facilities manangement professional responsible for complex facility services, operations and energy management / procurement across 2.8 M sft sports / entertainment and mixed use retail / commercial real estate portfolio. Member Westford Energy Committee 2009  –  2010  (1 year) Site Facilities Operations Manager Intel Corporation February 1996  –  June 2004  (8 years 5 months) Site facilities operations manager responsible for safe, reliable facility services and systems servicing a 1.5 M sft micro- electronics factory. Project Manager Building Technology Engineers 1993  –  1996  (3 years) Marine Engineer Penn Attransco 1990  –  1993  (3 years) Vice President, Facilities BioMed Realty Trust January 2015  – Present (8 months) Vice President, Facilities BioMed Realty Trust January 2015  – Present (8 months) Senior Director, East Coast Operations BioMed Realty Trust January 2011  –  December 2014  (4 years) Cambridge, Ma Senior Director, East Coast Operations BioMed Realty Trust January 2011  –  December 2014  (4 years) Cambridge, Ma Regional Director, East Coast Facilities BioMed Realty Trust April 2010  –  August 2011  (1 year 5 months) Facilities director responsible for facilities management of biotech properties within the east coast region. Regional Director, East Coast Facilities BioMed Realty Trust April 2010  –  August 2011  (1 year 5 months) Facilities director responsible for facilities management of biotech properties within the east coast region. Director of Site Operations NPS LLC June 2004  –  April 2010  (5 years 11 months) Senior Facilities manangement professional responsible for complex facility services, operations and energy management / procurement across 2.8 M sft sports / entertainment and mixed use retail / commercial real estate portfolio. Director of Site Operations NPS LLC June 2004  –  April 2010  (5 years 11 months) Senior Facilities manangement professional responsible for complex facility services, operations and energy management / procurement across 2.8 M sft sports / entertainment and mixed use retail / commercial real estate portfolio. Member Westford Energy Committee 2009  –  2010  (1 year) Member Westford Energy Committee 2009  –  2010  (1 year) Site Facilities Operations Manager Intel Corporation February 1996  –  June 2004  (8 years 5 months) Site facilities operations manager responsible for safe, reliable facility services and systems servicing a 1.5 M sft micro- electronics factory. Site Facilities Operations Manager Intel Corporation February 1996  –  June 2004  (8 years 5 months) Site facilities operations manager responsible for safe, reliable facility services and systems servicing a 1.5 M sft micro- electronics factory. Project Manager Building Technology Engineers 1993  –  1996  (3 years) Project Manager Building Technology Engineers 1993  –  1996  (3 years) Marine Engineer Penn Attransco 1990  –  1993  (3 years) Marine Engineer Penn Attransco 1990  –  1993  (3 years) Education Massachusetts Maritime Academy BS,  Marine Engineering 1981  – 1985 Massachusetts Maritime Academy BS,  Marine Engineering 1981  – 1985 Massachusetts Maritime Academy BS,  Marine Engineering 1981  – 1985 Massachusetts Maritime Academy BS,  Marine Engineering 1981  – 1985 ", "Summary I am a highly motivated facilities manager with a friendly, straightforward style, excellent communication skills, and more than 15 years of experience in facilities planning and site services management. I am especially adept at providing high-quality customer service on complex projects while keeping all parties informed. \n \nSkill Set \n- Strong analytic/strategic thinking \n- Results-oriented project management \n- Excellent organizational skills \n- Meet and manage budgets and deadlines \n- Excellent time management skills \n- Adapt to changing deadlines/priorities \n- Manage multiple projects at a time \n- Assess/facilitate more efficient processes \n- Bring order to chaos \n- Strong customer service skills \n- Manage and coach vendors \n- Manage hot projects with a cool head Summary I am a highly motivated facilities manager with a friendly, straightforward style, excellent communication skills, and more than 15 years of experience in facilities planning and site services management. I am especially adept at providing high-quality customer service on complex projects while keeping all parties informed. \n \nSkill Set \n- Strong analytic/strategic thinking \n- Results-oriented project management \n- Excellent organizational skills \n- Meet and manage budgets and deadlines \n- Excellent time management skills \n- Adapt to changing deadlines/priorities \n- Manage multiple projects at a time \n- Assess/facilitate more efficient processes \n- Bring order to chaos \n- Strong customer service skills \n- Manage and coach vendors \n- Manage hot projects with a cool head I am a highly motivated facilities manager with a friendly, straightforward style, excellent communication skills, and more than 15 years of experience in facilities planning and site services management. I am especially adept at providing high-quality customer service on complex projects while keeping all parties informed. \n \nSkill Set \n- Strong analytic/strategic thinking \n- Results-oriented project management \n- Excellent organizational skills \n- Meet and manage budgets and deadlines \n- Excellent time management skills \n- Adapt to changing deadlines/priorities \n- Manage multiple projects at a time \n- Assess/facilitate more efficient processes \n- Bring order to chaos \n- Strong customer service skills \n- Manage and coach vendors \n- Manage hot projects with a cool head I am a highly motivated facilities manager with a friendly, straightforward style, excellent communication skills, and more than 15 years of experience in facilities planning and site services management. I am especially adept at providing high-quality customer service on complex projects while keeping all parties informed. \n \nSkill Set \n- Strong analytic/strategic thinking \n- Results-oriented project management \n- Excellent organizational skills \n- Meet and manage budgets and deadlines \n- Excellent time management skills \n- Adapt to changing deadlines/priorities \n- Manage multiple projects at a time \n- Assess/facilitate more efficient processes \n- Bring order to chaos \n- Strong customer service skills \n- Manage and coach vendors \n- Manage hot projects with a cool head Experience Facilities Operations/Project Managment VeriFone August 2014  – Present (1 year 1 month) San JoseCA Project Manager Intel Corporation June 2000  – Present (15 years 3 months) Various SF Bay Area sites, San Diego, Irvine, and Calabasas - Manage new site development projects, starting from real estate searches to managing design firms to designing scope of work for the general contractor through fit up and move-in. \n- Develop scope of work for lab expansions, new office fit up and design, IT infrastructure upgrades, and facility upgrades.  \n- Manage budgets and project schedules.  \n- Manage suppliers and projects to completion. Mergers & Acquisitions Intel Corporation June 2000  – Present (15 years 3 months) Louisville KY, King of Prussia PA, and various California sites - Lead team in facility integration efforts for over 80 acquisitions projects. \n- Identified space, infrastructure and process improvements.  \n- Managed integration of existing service contractors with acquisitions. \n- Developed a matrix to identify potential new space for acquisitions Facility Decommissioning Intel Corporation June 2000  – Present (15 years 3 months) Lenexa KS, Pittsburgh PA, Hudson MA, and various California sites - Managed decommissioning of facilities and Intel assets. \n- Developed project plans to meet lease exit restoration obligations Facilities / Operations Manager Intel Corporation June 2000  – Present (15 years 3 months) Various SF Bay Area and Souther California sites Responsibilities \n- Supervise contracted facility suppliers for day-to-day operations and preventative maintenance programs such as HVAC, Boilers, Chillers, Data Center UPS systems, Electrical, Plumbing, Custodial, and Landscaping.  \n- Assess current condition of electrical, AC, plumbing, and other essential equipment and create a schedule for evaluation and preventative maintenance of the facilities equipment. \n- Work with teams to understand and meet their business needs from labs to cafeterias to office space. \n- Develop maintenance budgets for outside facilities suppliers. \n- Develop a system for cleaning, repairing, and maintaining facilities. \n- Initiate and enact a campaign for safety measures within the facilities. Prepare safety records and reports required by regulatory agencies. Tactical Space Planner Intel Corporation June 1997  –  June 2000  (3 years 1 month) Santa Clara, Fremont, Newark, San Francisco, Calabasas, Irvine, and San Diego - Identified problems, trends, and future space needs and make recommendations. \n- Provided tactical and strategic space planning for large and small facilities.  \n- Forecasted, allocate, and manage space planning for labs, factory, and general office environments. \n- Managed suppliers who provide Adds, Moves and Changes Service Contract Support Specialist Intel Corporation June 1995  –  June 1997  (2 years 1 month) Santa Clara - Managed cost-saving and improvement programs for food services, landscaping, pest control, parking lot, and elevator maintenance contracts. \n- Managed supplier goals and budget Facilities Equipment Buyer/Expeditor Intel Corporation June 1990  –  June 1995  (5 years 1 month) Santa Clara - Procured facility maintenance equipment and spare parts. \n- Managed blanket PO’s and contracts for the Building Services Project Maintenance teams. \n- Ensured necessary equipment, spare parts and contracts were in place to minimize equipment downtimes Facilities Operations/Project Managment VeriFone August 2014  – Present (1 year 1 month) San JoseCA Facilities Operations/Project Managment VeriFone August 2014  – Present (1 year 1 month) San JoseCA Project Manager Intel Corporation June 2000  – Present (15 years 3 months) Various SF Bay Area sites, San Diego, Irvine, and Calabasas - Manage new site development projects, starting from real estate searches to managing design firms to designing scope of work for the general contractor through fit up and move-in. \n- Develop scope of work for lab expansions, new office fit up and design, IT infrastructure upgrades, and facility upgrades.  \n- Manage budgets and project schedules.  \n- Manage suppliers and projects to completion. Project Manager Intel Corporation June 2000  – Present (15 years 3 months) Various SF Bay Area sites, San Diego, Irvine, and Calabasas - Manage new site development projects, starting from real estate searches to managing design firms to designing scope of work for the general contractor through fit up and move-in. \n- Develop scope of work for lab expansions, new office fit up and design, IT infrastructure upgrades, and facility upgrades.  \n- Manage budgets and project schedules.  \n- Manage suppliers and projects to completion. Mergers & Acquisitions Intel Corporation June 2000  – Present (15 years 3 months) Louisville KY, King of Prussia PA, and various California sites - Lead team in facility integration efforts for over 80 acquisitions projects. \n- Identified space, infrastructure and process improvements.  \n- Managed integration of existing service contractors with acquisitions. \n- Developed a matrix to identify potential new space for acquisitions Mergers & Acquisitions Intel Corporation June 2000  – Present (15 years 3 months) Louisville KY, King of Prussia PA, and various California sites - Lead team in facility integration efforts for over 80 acquisitions projects. \n- Identified space, infrastructure and process improvements.  \n- Managed integration of existing service contractors with acquisitions. \n- Developed a matrix to identify potential new space for acquisitions Facility Decommissioning Intel Corporation June 2000  – Present (15 years 3 months) Lenexa KS, Pittsburgh PA, Hudson MA, and various California sites - Managed decommissioning of facilities and Intel assets. \n- Developed project plans to meet lease exit restoration obligations Facility Decommissioning Intel Corporation June 2000  – Present (15 years 3 months) Lenexa KS, Pittsburgh PA, Hudson MA, and various California sites - Managed decommissioning of facilities and Intel assets. \n- Developed project plans to meet lease exit restoration obligations Facilities / Operations Manager Intel Corporation June 2000  – Present (15 years 3 months) Various SF Bay Area and Souther California sites Responsibilities \n- Supervise contracted facility suppliers for day-to-day operations and preventative maintenance programs such as HVAC, Boilers, Chillers, Data Center UPS systems, Electrical, Plumbing, Custodial, and Landscaping.  \n- Assess current condition of electrical, AC, plumbing, and other essential equipment and create a schedule for evaluation and preventative maintenance of the facilities equipment. \n- Work with teams to understand and meet their business needs from labs to cafeterias to office space. \n- Develop maintenance budgets for outside facilities suppliers. \n- Develop a system for cleaning, repairing, and maintaining facilities. \n- Initiate and enact a campaign for safety measures within the facilities. Prepare safety records and reports required by regulatory agencies. Facilities / Operations Manager Intel Corporation June 2000  – Present (15 years 3 months) Various SF Bay Area and Souther California sites Responsibilities \n- Supervise contracted facility suppliers for day-to-day operations and preventative maintenance programs such as HVAC, Boilers, Chillers, Data Center UPS systems, Electrical, Plumbing, Custodial, and Landscaping.  \n- Assess current condition of electrical, AC, plumbing, and other essential equipment and create a schedule for evaluation and preventative maintenance of the facilities equipment. \n- Work with teams to understand and meet their business needs from labs to cafeterias to office space. \n- Develop maintenance budgets for outside facilities suppliers. \n- Develop a system for cleaning, repairing, and maintaining facilities. \n- Initiate and enact a campaign for safety measures within the facilities. Prepare safety records and reports required by regulatory agencies. Tactical Space Planner Intel Corporation June 1997  –  June 2000  (3 years 1 month) Santa Clara, Fremont, Newark, San Francisco, Calabasas, Irvine, and San Diego - Identified problems, trends, and future space needs and make recommendations. \n- Provided tactical and strategic space planning for large and small facilities.  \n- Forecasted, allocate, and manage space planning for labs, factory, and general office environments. \n- Managed suppliers who provide Adds, Moves and Changes Tactical Space Planner Intel Corporation June 1997  –  June 2000  (3 years 1 month) Santa Clara, Fremont, Newark, San Francisco, Calabasas, Irvine, and San Diego - Identified problems, trends, and future space needs and make recommendations. \n- Provided tactical and strategic space planning for large and small facilities.  \n- Forecasted, allocate, and manage space planning for labs, factory, and general office environments. \n- Managed suppliers who provide Adds, Moves and Changes Service Contract Support Specialist Intel Corporation June 1995  –  June 1997  (2 years 1 month) Santa Clara - Managed cost-saving and improvement programs for food services, landscaping, pest control, parking lot, and elevator maintenance contracts. \n- Managed supplier goals and budget Service Contract Support Specialist Intel Corporation June 1995  –  June 1997  (2 years 1 month) Santa Clara - Managed cost-saving and improvement programs for food services, landscaping, pest control, parking lot, and elevator maintenance contracts. \n- Managed supplier goals and budget Facilities Equipment Buyer/Expeditor Intel Corporation June 1990  –  June 1995  (5 years 1 month) Santa Clara - Procured facility maintenance equipment and spare parts. \n- Managed blanket PO’s and contracts for the Building Services Project Maintenance teams. \n- Ensured necessary equipment, spare parts and contracts were in place to minimize equipment downtimes Facilities Equipment Buyer/Expeditor Intel Corporation June 1990  –  June 1995  (5 years 1 month) Santa Clara - Procured facility maintenance equipment and spare parts. \n- Managed blanket PO’s and contracts for the Building Services Project Maintenance teams. \n- Ensured necessary equipment, spare parts and contracts were in place to minimize equipment downtimes Languages Spanish Spanish Spanish Skills Facilities Management Facilities Operations Project Management Mergers & Acquisitions Decommissioning Compression Tactical Planning Service Contract Purchase Management Skills  Facilities Management Facilities Operations Project Management Mergers & Acquisitions Decommissioning Compression Tactical Planning Service Contract Purchase Management Facilities Management Facilities Operations Project Management Mergers & Acquisitions Decommissioning Compression Tactical Planning Service Contract Purchase Management Facilities Management Facilities Operations Project Management Mergers & Acquisitions Decommissioning Compression Tactical Planning Service Contract Purchase Management ", "Summary I have over 18 years experience in managing and leading technical teams of engineers and technicians in safely operating, maintaining and improving the complex facility infrastructure required to provide reliable service to a high volume semiconductor facility. \n \nMy professional passion includes instructing classes on developing people managers, Lean Experience, and safety.  Summary I have over 18 years experience in managing and leading technical teams of engineers and technicians in safely operating, maintaining and improving the complex facility infrastructure required to provide reliable service to a high volume semiconductor facility. \n \nMy professional passion includes instructing classes on developing people managers, Lean Experience, and safety.  I have over 18 years experience in managing and leading technical teams of engineers and technicians in safely operating, maintaining and improving the complex facility infrastructure required to provide reliable service to a high volume semiconductor facility. \n \nMy professional passion includes instructing classes on developing people managers, Lean Experience, and safety.  I have over 18 years experience in managing and leading technical teams of engineers and technicians in safely operating, maintaining and improving the complex facility infrastructure required to provide reliable service to a high volume semiconductor facility. \n \nMy professional passion includes instructing classes on developing people managers, Lean Experience, and safety.  Languages   Skills Skills     Education University of Pittsburgh Master’s Degree 1982 Clarkson University Bachelor’s Degree 1977 University of Pittsburgh Master’s Degree 1982 University of Pittsburgh Master’s Degree 1982 University of Pittsburgh Master’s Degree 1982 Clarkson University Bachelor’s Degree 1977 Clarkson University Bachelor’s Degree 1977 Clarkson University Bachelor’s Degree 1977 ", "Experience Facilities Operations Manager Intel Corporation January 2012  – Present (3 years 8 months) Chandler, AZ Responsible for the daily activities of 20 direct reports across (3) disciplines  \nShift 4 Corporate Service Single Point of Contact for all issues concerning CS operations, issues and inquiries  \nManage resources by identifying tasks, assigning specific resources, communicating expectations, assessing risk and identifying issues/concerns Coordinate resources with other functions, set priorities and direct activities to support manufacturing operations.  \nEncourage and reinforce appropriate group values, attitudes and behaviors to ensure a cohesive team  \nProvide guidance to employees regarding performance, productivity and career development \nPromote a culture of operational excellence (safety, quality, and output systems, daily ops, reports, PM scheduling) and driving problems to root cause \nPartner with other group leaders to operate as one team to ensure consistency in results across all of their functional area Equipment Maintenance Technician Intel Corporation June 2005  –  January 2012  (6 years 8 months) Chandler, AZ Troubleshoot, repair, and complete all unscheduled and preventive maintenance on semi-conductor manufacturing support equipment \nProvide maintenance on abatement systems (chemical decomposition and oxygenation), vacuum pumps, chillers and gas handling systems \nInstall equipment upgrades and modifications \nDevelop procedures to enhance equipment reliability and product yield \nRecord daily maintenance activities, on-going issues, and recommendations in database \nCommunicate important issues or points to oncoming shifts \nAdhere to all safety procedures for managing hazardous waste material Equipment Maintenance Technician Heraeus Inc March 2003  –  June 2005  (2 years 4 months) Chandler, AZ Troubleshoot production, facilities, and material handling equipment issues to root cause via electronic theory, test equipment, and hand tools  \nAssist Engineering with design, fabrication, and modification of process equipment \nPerform preventive and corrective maintenance on various automated systems including, but not limited to shakers, ovens, presses, and vacuum systems \nWorked directly with Engineering personnel on detailed experimental testing \nDevelop procedures to enhance equipment reliability and product yield \nAccurately record product repair data Facilities Operations Manager Intel Corporation January 2012  – Present (3 years 8 months) Chandler, AZ Responsible for the daily activities of 20 direct reports across (3) disciplines  \nShift 4 Corporate Service Single Point of Contact for all issues concerning CS operations, issues and inquiries  \nManage resources by identifying tasks, assigning specific resources, communicating expectations, assessing risk and identifying issues/concerns Coordinate resources with other functions, set priorities and direct activities to support manufacturing operations.  \nEncourage and reinforce appropriate group values, attitudes and behaviors to ensure a cohesive team  \nProvide guidance to employees regarding performance, productivity and career development \nPromote a culture of operational excellence (safety, quality, and output systems, daily ops, reports, PM scheduling) and driving problems to root cause \nPartner with other group leaders to operate as one team to ensure consistency in results across all of their functional area Facilities Operations Manager Intel Corporation January 2012  – Present (3 years 8 months) Chandler, AZ Responsible for the daily activities of 20 direct reports across (3) disciplines  \nShift 4 Corporate Service Single Point of Contact for all issues concerning CS operations, issues and inquiries  \nManage resources by identifying tasks, assigning specific resources, communicating expectations, assessing risk and identifying issues/concerns Coordinate resources with other functions, set priorities and direct activities to support manufacturing operations.  \nEncourage and reinforce appropriate group values, attitudes and behaviors to ensure a cohesive team  \nProvide guidance to employees regarding performance, productivity and career development \nPromote a culture of operational excellence (safety, quality, and output systems, daily ops, reports, PM scheduling) and driving problems to root cause \nPartner with other group leaders to operate as one team to ensure consistency in results across all of their functional area Equipment Maintenance Technician Intel Corporation June 2005  –  January 2012  (6 years 8 months) Chandler, AZ Troubleshoot, repair, and complete all unscheduled and preventive maintenance on semi-conductor manufacturing support equipment \nProvide maintenance on abatement systems (chemical decomposition and oxygenation), vacuum pumps, chillers and gas handling systems \nInstall equipment upgrades and modifications \nDevelop procedures to enhance equipment reliability and product yield \nRecord daily maintenance activities, on-going issues, and recommendations in database \nCommunicate important issues or points to oncoming shifts \nAdhere to all safety procedures for managing hazardous waste material Equipment Maintenance Technician Intel Corporation June 2005  –  January 2012  (6 years 8 months) Chandler, AZ Troubleshoot, repair, and complete all unscheduled and preventive maintenance on semi-conductor manufacturing support equipment \nProvide maintenance on abatement systems (chemical decomposition and oxygenation), vacuum pumps, chillers and gas handling systems \nInstall equipment upgrades and modifications \nDevelop procedures to enhance equipment reliability and product yield \nRecord daily maintenance activities, on-going issues, and recommendations in database \nCommunicate important issues or points to oncoming shifts \nAdhere to all safety procedures for managing hazardous waste material Equipment Maintenance Technician Heraeus Inc March 2003  –  June 2005  (2 years 4 months) Chandler, AZ Troubleshoot production, facilities, and material handling equipment issues to root cause via electronic theory, test equipment, and hand tools  \nAssist Engineering with design, fabrication, and modification of process equipment \nPerform preventive and corrective maintenance on various automated systems including, but not limited to shakers, ovens, presses, and vacuum systems \nWorked directly with Engineering personnel on detailed experimental testing \nDevelop procedures to enhance equipment reliability and product yield \nAccurately record product repair data Equipment Maintenance Technician Heraeus Inc March 2003  –  June 2005  (2 years 4 months) Chandler, AZ Troubleshoot production, facilities, and material handling equipment issues to root cause via electronic theory, test equipment, and hand tools  \nAssist Engineering with design, fabrication, and modification of process equipment \nPerform preventive and corrective maintenance on various automated systems including, but not limited to shakers, ovens, presses, and vacuum systems \nWorked directly with Engineering personnel on detailed experimental testing \nDevelop procedures to enhance equipment reliability and product yield \nAccurately record product repair data Skills Management Equipment Maintenance Engineering Troubleshooting Manufacturing Automation Skills  Management Equipment Maintenance Engineering Troubleshooting Manufacturing Automation Management Equipment Maintenance Engineering Troubleshooting Manufacturing Automation Management Equipment Maintenance Engineering Troubleshooting Manufacturing Automation Education University of Phoenix Master of Business Administration (MBA),  Business Administration and Management , General 2007  – 2008 University of Phoenix Bachelor of Science (BS),  Business Administration and Management , General 2005  – 2007 University of Phoenix Master of Business Administration (MBA),  Business Administration and Management , General 2007  – 2008 University of Phoenix Master of Business Administration (MBA),  Business Administration and Management , General 2007  – 2008 University of Phoenix Master of Business Administration (MBA),  Business Administration and Management , General 2007  – 2008 University of Phoenix Bachelor of Science (BS),  Business Administration and Management , General 2005  – 2007 University of Phoenix Bachelor of Science (BS),  Business Administration and Management , General 2005  – 2007 University of Phoenix Bachelor of Science (BS),  Business Administration and Management , General 2005  – 2007 ", "Summary REAL ESTATE & WORKPLACE - PROJECT MANAGEMENT - IFM - OPERATIONS - AUTOMATION \n \n•\tPassionate about bringing out the best in people \n \n•\tSuccessful experience delivering results in a fast-paced 24/7 environment at Intel \n \n•\tLeads and coaches teams, helping people achieve their personal and business goals \n \n•\tCommunicates upwards and collaborates with stakeholders to anticipate and prevent issues \n \nSpecialties: \n• Project Management\t• Continuous Improvement • Manufacturing \n• Operations Management • Team Leadership • Budgetary Compliance \n• Real Estate and Workplace • Quality Systems • Risk Analysis \n• Building Relationships • Customer Advocate • Communication Summary REAL ESTATE & WORKPLACE - PROJECT MANAGEMENT - IFM - OPERATIONS - AUTOMATION \n \n•\tPassionate about bringing out the best in people \n \n•\tSuccessful experience delivering results in a fast-paced 24/7 environment at Intel \n \n•\tLeads and coaches teams, helping people achieve their personal and business goals \n \n•\tCommunicates upwards and collaborates with stakeholders to anticipate and prevent issues \n \nSpecialties: \n• Project Management\t• Continuous Improvement • Manufacturing \n• Operations Management • Team Leadership • Budgetary Compliance \n• Real Estate and Workplace • Quality Systems • Risk Analysis \n• Building Relationships • Customer Advocate • Communication REAL ESTATE & WORKPLACE - PROJECT MANAGEMENT - IFM - OPERATIONS - AUTOMATION \n \n•\tPassionate about bringing out the best in people \n \n•\tSuccessful experience delivering results in a fast-paced 24/7 environment at Intel \n \n•\tLeads and coaches teams, helping people achieve their personal and business goals \n \n•\tCommunicates upwards and collaborates with stakeholders to anticipate and prevent issues \n \nSpecialties: \n• Project Management\t• Continuous Improvement • Manufacturing \n• Operations Management • Team Leadership • Budgetary Compliance \n• Real Estate and Workplace • Quality Systems • Risk Analysis \n• Building Relationships • Customer Advocate • Communication REAL ESTATE & WORKPLACE - PROJECT MANAGEMENT - IFM - OPERATIONS - AUTOMATION \n \n•\tPassionate about bringing out the best in people \n \n•\tSuccessful experience delivering results in a fast-paced 24/7 environment at Intel \n \n•\tLeads and coaches teams, helping people achieve their personal and business goals \n \n•\tCommunicates upwards and collaborates with stakeholders to anticipate and prevent issues \n \nSpecialties: \n• Project Management\t• Continuous Improvement • Manufacturing \n• Operations Management • Team Leadership • Budgetary Compliance \n• Real Estate and Workplace • Quality Systems • Risk Analysis \n• Building Relationships • Customer Advocate • Communication Experience FACILITIES AND CORPORATE SERVICES PROJECT MANAGER INTEL CORPORATION 2013  –  2014  (1 year) Santa Clara, California FACILITIES BUSINESS OPERATIONS MANAGER INTEL CORPORATION 2010  –  2013  (3 years) Santa Clara, California MANUFACTURING FACILITIES OPERATIONS MANAGER INTEL CORPORATION 2006  –  2009  (3 years) Santa Clara, California MANUFACTURING AUTOMATION OPERATIONS MANAGER INTEL CORPORATION 1999  –  2006  (7 years) Santa Clara, California FACILITIES AND CORPORATE SERVICES PROJECT MANAGER INTEL CORPORATION 2013  –  2014  (1 year) Santa Clara, California FACILITIES AND CORPORATE SERVICES PROJECT MANAGER INTEL CORPORATION 2013  –  2014  (1 year) Santa Clara, California FACILITIES BUSINESS OPERATIONS MANAGER INTEL CORPORATION 2010  –  2013  (3 years) Santa Clara, California FACILITIES BUSINESS OPERATIONS MANAGER INTEL CORPORATION 2010  –  2013  (3 years) Santa Clara, California MANUFACTURING FACILITIES OPERATIONS MANAGER INTEL CORPORATION 2006  –  2009  (3 years) Santa Clara, California MANUFACTURING FACILITIES OPERATIONS MANAGER INTEL CORPORATION 2006  –  2009  (3 years) Santa Clara, California MANUFACTURING AUTOMATION OPERATIONS MANAGER INTEL CORPORATION 1999  –  2006  (7 years) Santa Clara, California MANUFACTURING AUTOMATION OPERATIONS MANAGER INTEL CORPORATION 1999  –  2006  (7 years) Santa Clara, California Languages   Skills Project Management Program Management Leadership Cross-functional Team... Building Relationships Continuous Improvement Engineering Process Improvement Semiconductors Intel Automation SPC Semiconductor Industry JMP Manufacturing Engineering Management Design of Experiments Failure Analysis Integration Collaborative Problem... Quality System Cross Functional Team... Management Strategy Project Planning Budgets Analysis Mission Critical... See 13+     See less Skills  Project Management Program Management Leadership Cross-functional Team... Building Relationships Continuous Improvement Engineering Process Improvement Semiconductors Intel Automation SPC Semiconductor Industry JMP Manufacturing Engineering Management Design of Experiments Failure Analysis Integration Collaborative Problem... Quality System Cross Functional Team... Management Strategy Project Planning Budgets Analysis Mission Critical... See 13+     See less Project Management Program Management Leadership Cross-functional Team... Building Relationships Continuous Improvement Engineering Process Improvement Semiconductors Intel Automation SPC Semiconductor Industry JMP Manufacturing Engineering Management Design of Experiments Failure Analysis Integration Collaborative Problem... Quality System Cross Functional Team... Management Strategy Project Planning Budgets Analysis Mission Critical... See 13+     See less Project Management Program Management Leadership Cross-functional Team... Building Relationships Continuous Improvement Engineering Process Improvement Semiconductors Intel Automation SPC Semiconductor Industry JMP Manufacturing Engineering Management Design of Experiments Failure Analysis Integration Collaborative Problem... Quality System Cross Functional Team... Management Strategy Project Planning Budgets Analysis Mission Critical... See 13+     See less Honors & Awards ", "Experience Facilities Operations Manager Intel Corporation June 2010  – Present (5 years 3 months) Albuquerque, New Mexico Area Manage various Facilities Operations teams: Electrical/Instrumentation & Controls/Life Safety Systems, Cleanroom/Mechanical, Ultra Pure Water/Industrial Waste, Sub Fab Vacuum & Abatement, Bulk and Specialty Gases/Bulk Chemical Delivery systems; supporting facilities operations, maintenance, projects, commissioning, start-up, and process transfer.  \nGroup Leader with Area Manager experience for Facilities teams consisting of operations/maintenance technicians, engineering staff, and operations supervision.  \nEnsure safe and reliable operation for Lean Manufacturing, TPM, autonomous maintenance improvements, problem resolution, capital project support, cost/energy reduction and optimization. \nConduct resource and performance management (focal process) for teams. Facilities Mechanical Engineer Intel Corporation July 2004  –  June 2010  (6 years) Albuquerque, New Mexico Area Provided engineering support to ensure safe and reliable operations for various systems and applications including process cooling water, process & house vacuum systems, compressed dry air, chilled water, condenser water, cleanroom HVAC, process exhaust, fire protection, and heating (steam and heat recovery) systems. Design Engineer Brown and Caldwell August 2003  –  June 2004  (11 months) El Paso, Texas Area Generated cost evaluation reports to determine if construction cost estimated by the clients were in line with industry benchmarks. Analyzed contractor’s construction submittals to determine whether they conformed to project specifications. Performed duty as inspector for construction sites including reverse osmosis filtered wells, water lines and sewer lines to ensure construction activities complied with plans and specifications. Performed surveying activities by making field measurements to determine site elevations. Created basic design layouts for city water lines. Engineering Co-Op Ethicon, Inc. May 2002  –  January 2003  (9 months) Albuquerque, New Mexico Area Performed startup, commission, and integration activities for new ink jet and conveying equipment in custom packaging. Participated in >15 packaging validations and tests. Assisted with troubleshooting of packaging equipment. Obtained, general knowledge of cGMP/ISO regulations, validation principles and guidelines working in a medical device/manufacturing environment. Facilities Operations Manager Intel Corporation June 2010  – Present (5 years 3 months) Albuquerque, New Mexico Area Manage various Facilities Operations teams: Electrical/Instrumentation & Controls/Life Safety Systems, Cleanroom/Mechanical, Ultra Pure Water/Industrial Waste, Sub Fab Vacuum & Abatement, Bulk and Specialty Gases/Bulk Chemical Delivery systems; supporting facilities operations, maintenance, projects, commissioning, start-up, and process transfer.  \nGroup Leader with Area Manager experience for Facilities teams consisting of operations/maintenance technicians, engineering staff, and operations supervision.  \nEnsure safe and reliable operation for Lean Manufacturing, TPM, autonomous maintenance improvements, problem resolution, capital project support, cost/energy reduction and optimization. \nConduct resource and performance management (focal process) for teams. Facilities Operations Manager Intel Corporation June 2010  – Present (5 years 3 months) Albuquerque, New Mexico Area Manage various Facilities Operations teams: Electrical/Instrumentation & Controls/Life Safety Systems, Cleanroom/Mechanical, Ultra Pure Water/Industrial Waste, Sub Fab Vacuum & Abatement, Bulk and Specialty Gases/Bulk Chemical Delivery systems; supporting facilities operations, maintenance, projects, commissioning, start-up, and process transfer.  \nGroup Leader with Area Manager experience for Facilities teams consisting of operations/maintenance technicians, engineering staff, and operations supervision.  \nEnsure safe and reliable operation for Lean Manufacturing, TPM, autonomous maintenance improvements, problem resolution, capital project support, cost/energy reduction and optimization. \nConduct resource and performance management (focal process) for teams. Facilities Mechanical Engineer Intel Corporation July 2004  –  June 2010  (6 years) Albuquerque, New Mexico Area Provided engineering support to ensure safe and reliable operations for various systems and applications including process cooling water, process & house vacuum systems, compressed dry air, chilled water, condenser water, cleanroom HVAC, process exhaust, fire protection, and heating (steam and heat recovery) systems. Facilities Mechanical Engineer Intel Corporation July 2004  –  June 2010  (6 years) Albuquerque, New Mexico Area Provided engineering support to ensure safe and reliable operations for various systems and applications including process cooling water, process & house vacuum systems, compressed dry air, chilled water, condenser water, cleanroom HVAC, process exhaust, fire protection, and heating (steam and heat recovery) systems. Design Engineer Brown and Caldwell August 2003  –  June 2004  (11 months) El Paso, Texas Area Generated cost evaluation reports to determine if construction cost estimated by the clients were in line with industry benchmarks. Analyzed contractor’s construction submittals to determine whether they conformed to project specifications. Performed duty as inspector for construction sites including reverse osmosis filtered wells, water lines and sewer lines to ensure construction activities complied with plans and specifications. Performed surveying activities by making field measurements to determine site elevations. Created basic design layouts for city water lines. Design Engineer Brown and Caldwell August 2003  –  June 2004  (11 months) El Paso, Texas Area Generated cost evaluation reports to determine if construction cost estimated by the clients were in line with industry benchmarks. Analyzed contractor’s construction submittals to determine whether they conformed to project specifications. Performed duty as inspector for construction sites including reverse osmosis filtered wells, water lines and sewer lines to ensure construction activities complied with plans and specifications. Performed surveying activities by making field measurements to determine site elevations. Created basic design layouts for city water lines. Engineering Co-Op Ethicon, Inc. May 2002  –  January 2003  (9 months) Albuquerque, New Mexico Area Performed startup, commission, and integration activities for new ink jet and conveying equipment in custom packaging. Participated in >15 packaging validations and tests. Assisted with troubleshooting of packaging equipment. Obtained, general knowledge of cGMP/ISO regulations, validation principles and guidelines working in a medical device/manufacturing environment. Engineering Co-Op Ethicon, Inc. May 2002  –  January 2003  (9 months) Albuquerque, New Mexico Area Performed startup, commission, and integration activities for new ink jet and conveying equipment in custom packaging. Participated in >15 packaging validations and tests. Assisted with troubleshooting of packaging equipment. Obtained, general knowledge of cGMP/ISO regulations, validation principles and guidelines working in a medical device/manufacturing environment. Skills Semiconductors Design of Experiments SPC Engineering Semiconductor Industry Root Cause Analysis Lean Manufacturing Process Improvement Program Management Cross-functional Team... Operations Management Strategic Planning Manufacturing Project Management Six Sigma Continuous Improvement Management Intel See 3+     See less Skills  Semiconductors Design of Experiments SPC Engineering Semiconductor Industry Root Cause Analysis Lean Manufacturing Process Improvement Program Management Cross-functional Team... Operations Management Strategic Planning Manufacturing Project Management Six Sigma Continuous Improvement Management Intel See 3+     See less Semiconductors Design of Experiments SPC Engineering Semiconductor Industry Root Cause Analysis Lean Manufacturing Process Improvement Program Management Cross-functional Team... Operations Management Strategic Planning Manufacturing Project Management Six Sigma Continuous Improvement Management Intel See 3+     See less Semiconductors Design of Experiments SPC Engineering Semiconductor Industry Root Cause Analysis Lean Manufacturing Process Improvement Program Management Cross-functional Team... Operations Management Strategic Planning Manufacturing Project Management Six Sigma Continuous Improvement Management Intel See 3+     See less Education New Mexico State University Bachelor's degree,  Mechanical Engineering 1998  – 2003 New Mexico State University Bachelor's degree,  Mechanical Engineering 1998  – 2003 New Mexico State University Bachelor's degree,  Mechanical Engineering 1998  – 2003 New Mexico State University Bachelor's degree,  Mechanical Engineering 1998  – 2003 "]}