{"position": "Facilities Technician", "company": "Intel Corporation", "profiles": ["Summary I am a 10 year Veteran of the US Navy. I was a Nuclear Machinist Mate, First Class (E-6), and the Work Center Supervisor for Main Propulsion Plant #2 on the USS Nimitz (CVN-68). I ended my tour as a Nuclear Mechanical Operations Instructor at Nuclear Power Training Unit in Ballston Spa, NY. I graduated with honors at Embry-Riddle Aeronautical University in 2013 with a BS in Aeronautical Science and a minor in Aviation Safety.  \n \nI have my commercial pilots license with Instrument, Multi-Engine, and Single-Engine ratings. I have over 250 hours of total flight time acquired in the Cessna C-152, Cessna C-172S, Piper PA-44, and Diamond DA-42NG. I also have experience in customer service, maintenance program management, quality assurance, human resources, business management, welding, and project management.  \n \nIn my free time I enjoy training for marathons, hiking with my golden retriever, working on my cars, and exploring new foods to enjoy. I am also currently receiving training for a Certified Flight Instructor Rating, at Hillsboro Aviation, and hope to receive my MEI, CFI, and CFII. Summary I am a 10 year Veteran of the US Navy. I was a Nuclear Machinist Mate, First Class (E-6), and the Work Center Supervisor for Main Propulsion Plant #2 on the USS Nimitz (CVN-68). I ended my tour as a Nuclear Mechanical Operations Instructor at Nuclear Power Training Unit in Ballston Spa, NY. I graduated with honors at Embry-Riddle Aeronautical University in 2013 with a BS in Aeronautical Science and a minor in Aviation Safety.  \n \nI have my commercial pilots license with Instrument, Multi-Engine, and Single-Engine ratings. I have over 250 hours of total flight time acquired in the Cessna C-152, Cessna C-172S, Piper PA-44, and Diamond DA-42NG. I also have experience in customer service, maintenance program management, quality assurance, human resources, business management, welding, and project management.  \n \nIn my free time I enjoy training for marathons, hiking with my golden retriever, working on my cars, and exploring new foods to enjoy. I am also currently receiving training for a Certified Flight Instructor Rating, at Hillsboro Aviation, and hope to receive my MEI, CFI, and CFII. I am a 10 year Veteran of the US Navy. I was a Nuclear Machinist Mate, First Class (E-6), and the Work Center Supervisor for Main Propulsion Plant #2 on the USS Nimitz (CVN-68). I ended my tour as a Nuclear Mechanical Operations Instructor at Nuclear Power Training Unit in Ballston Spa, NY. I graduated with honors at Embry-Riddle Aeronautical University in 2013 with a BS in Aeronautical Science and a minor in Aviation Safety.  \n \nI have my commercial pilots license with Instrument, Multi-Engine, and Single-Engine ratings. I have over 250 hours of total flight time acquired in the Cessna C-152, Cessna C-172S, Piper PA-44, and Diamond DA-42NG. I also have experience in customer service, maintenance program management, quality assurance, human resources, business management, welding, and project management.  \n \nIn my free time I enjoy training for marathons, hiking with my golden retriever, working on my cars, and exploring new foods to enjoy. I am also currently receiving training for a Certified Flight Instructor Rating, at Hillsboro Aviation, and hope to receive my MEI, CFI, and CFII. I am a 10 year Veteran of the US Navy. I was a Nuclear Machinist Mate, First Class (E-6), and the Work Center Supervisor for Main Propulsion Plant #2 on the USS Nimitz (CVN-68). I ended my tour as a Nuclear Mechanical Operations Instructor at Nuclear Power Training Unit in Ballston Spa, NY. I graduated with honors at Embry-Riddle Aeronautical University in 2013 with a BS in Aeronautical Science and a minor in Aviation Safety.  \n \nI have my commercial pilots license with Instrument, Multi-Engine, and Single-Engine ratings. I have over 250 hours of total flight time acquired in the Cessna C-152, Cessna C-172S, Piper PA-44, and Diamond DA-42NG. I also have experience in customer service, maintenance program management, quality assurance, human resources, business management, welding, and project management.  \n \nIn my free time I enjoy training for marathons, hiking with my golden retriever, working on my cars, and exploring new foods to enjoy. I am also currently receiving training for a Certified Flight Instructor Rating, at Hillsboro Aviation, and hope to receive my MEI, CFI, and CFII. Experience Mechanical Facilities Technician Intel Corporation July 2014  – Present (1 year 2 months) Hillsboro, OR MEI Flight Student Hillsboro Aviation, Inc. January 2014  – Present (1 year 8 months) Portland, Oregon Area Maintenance Mechanic ESCO Corporation May 2013  –  August 2013  (4 months) Portland, Oregon Area Nuclear Mechanical Operations Instructor Nuclear Power Training Unit (NPTU Ballston Spa) July 2007  –  October 2010  (3 years 4 months) Ballston Spa, NY Work Center Supervisor USS Nimitz November 2002  –  May 2007  (4 years 7 months) San Diego, Ca Mechanical Facilities Technician Intel Corporation July 2014  – Present (1 year 2 months) Hillsboro, OR Mechanical Facilities Technician Intel Corporation July 2014  – Present (1 year 2 months) Hillsboro, OR MEI Flight Student Hillsboro Aviation, Inc. January 2014  – Present (1 year 8 months) Portland, Oregon Area MEI Flight Student Hillsboro Aviation, Inc. January 2014  – Present (1 year 8 months) Portland, Oregon Area Maintenance Mechanic ESCO Corporation May 2013  –  August 2013  (4 months) Portland, Oregon Area Maintenance Mechanic ESCO Corporation May 2013  –  August 2013  (4 months) Portland, Oregon Area Nuclear Mechanical Operations Instructor Nuclear Power Training Unit (NPTU Ballston Spa) July 2007  –  October 2010  (3 years 4 months) Ballston Spa, NY Nuclear Mechanical Operations Instructor Nuclear Power Training Unit (NPTU Ballston Spa) July 2007  –  October 2010  (3 years 4 months) Ballston Spa, NY Work Center Supervisor USS Nimitz November 2002  –  May 2007  (4 years 7 months) San Diego, Ca Work Center Supervisor USS Nimitz November 2002  –  May 2007  (4 years 7 months) San Diego, Ca Skills Aviation Aviation Safety Flight Training Crew Resource Management Nuclear Power Plants Plant Maintenance Military Maintenance Management Planned Preventative... Quality Assurance Heat Transfer Heat Exchangers Aircraft Maintenance CFI Flight Safety Skills  Aviation Aviation Safety Flight Training Crew Resource Management Nuclear Power Plants Plant Maintenance Military Maintenance Management Planned Preventative... Quality Assurance Heat Transfer Heat Exchangers Aircraft Maintenance CFI Flight Safety Aviation Aviation Safety Flight Training Crew Resource Management Nuclear Power Plants Plant Maintenance Military Maintenance Management Planned Preventative... Quality Assurance Heat Transfer Heat Exchangers Aircraft Maintenance CFI Flight Safety Aviation Aviation Safety Flight Training Crew Resource Management Nuclear Power Plants Plant Maintenance Military Maintenance Management Planned Preventative... Quality Assurance Heat Transfer Heat Exchangers Aircraft Maintenance CFI Flight Safety Education Embry Riddle Aeronautical University-Prescott Bachelor of Science (B.S.),  Aeronautical Science with Aviation Safety Minor , 3.54 2010  – 2013 Naval Nuclear Power Training Command Nuclear/Nuclear Power Technology/Technician 2001  – 2002 Embry Riddle Aeronautical University-Prescott Bachelor of Science (B.S.),  Aeronautical Science with Aviation Safety Minor , 3.54 2010  – 2013 Embry Riddle Aeronautical University-Prescott Bachelor of Science (B.S.),  Aeronautical Science with Aviation Safety Minor , 3.54 2010  – 2013 Embry Riddle Aeronautical University-Prescott Bachelor of Science (B.S.),  Aeronautical Science with Aviation Safety Minor , 3.54 2010  – 2013 Naval Nuclear Power Training Command Nuclear/Nuclear Power Technology/Technician 2001  – 2002 Naval Nuclear Power Training Command Nuclear/Nuclear Power Technology/Technician 2001  – 2002 Naval Nuclear Power Training Command Nuclear/Nuclear Power Technology/Technician 2001  – 2002 ", "Experience Critical Environment Technician Total Site Solutions August 2014  – Present (1 year 1 month) Phoenix, Arizona Area Maintenance of EBay Data Center Semiconductor Facilities Technician Intel Corporation September 1992  –  June 2014  (21 years 10 months) Chandler, AZ ● HVAC / Facilities Management ● Internal & External Communication ● Cross-Functional Collaboration \n● Quality Assurance & Control ● Hands-On Troubleshooting ● Policy & Procedure Compliance \n● Project / Program Management ● Issue Identification & Resolution ● Safety/COHE Auditor Facilities Technician Intel Corporation 1992  –  2014  (22 years) Critical Environment Technician Total Site Solutions August 2014  – Present (1 year 1 month) Phoenix, Arizona Area Maintenance of EBay Data Center Critical Environment Technician Total Site Solutions August 2014  – Present (1 year 1 month) Phoenix, Arizona Area Maintenance of EBay Data Center Semiconductor Facilities Technician Intel Corporation September 1992  –  June 2014  (21 years 10 months) Chandler, AZ ● HVAC / Facilities Management ● Internal & External Communication ● Cross-Functional Collaboration \n● Quality Assurance & Control ● Hands-On Troubleshooting ● Policy & Procedure Compliance \n● Project / Program Management ● Issue Identification & Resolution ● Safety/COHE Auditor Semiconductor Facilities Technician Intel Corporation September 1992  –  June 2014  (21 years 10 months) Chandler, AZ ● HVAC / Facilities Management ● Internal & External Communication ● Cross-Functional Collaboration \n● Quality Assurance & Control ● Hands-On Troubleshooting ● Policy & Procedure Compliance \n● Project / Program Management ● Issue Identification & Resolution ● Safety/COHE Auditor Facilities Technician Intel Corporation 1992  –  2014  (22 years) Facilities Technician Intel Corporation 1992  –  2014  (22 years) Skills Semiconductor... HVAC Controls QA/QC Technician Industrial Maintenance... Industrial Safety... Semiconductor... Semiconductor... Skills  Semiconductor... HVAC Controls QA/QC Technician Industrial Maintenance... Industrial Safety... Semiconductor... Semiconductor... Semiconductor... HVAC Controls QA/QC Technician Industrial Maintenance... Industrial Safety... Semiconductor... Semiconductor... Semiconductor... HVAC Controls QA/QC Technician Industrial Maintenance... Industrial Safety... Semiconductor... Semiconductor... Education Indiana Vocational Tech College Associate's degree,  Industrial Maintenance Technology , Graduated first in class with a 3.8 gpa 1984  – 1986 Millwright Apprenticeship School Journeyman Millwright-,  Attended night classes for 4 years while working as a Millwright Apprentice Indiana Vocational Tech College Associate's degree,  Industrial Maintenance Technology , Graduated first in class with a 3.8 gpa 1984  – 1986 Indiana Vocational Tech College Associate's degree,  Industrial Maintenance Technology , Graduated first in class with a 3.8 gpa 1984  – 1986 Indiana Vocational Tech College Associate's degree,  Industrial Maintenance Technology , Graduated first in class with a 3.8 gpa 1984  – 1986 Millwright Apprenticeship School Journeyman Millwright-,  Attended night classes for 4 years while working as a Millwright Apprentice Millwright Apprenticeship School Journeyman Millwright-,  Attended night classes for 4 years while working as a Millwright Apprentice Millwright Apprenticeship School Journeyman Millwright-,  Attended night classes for 4 years while working as a Millwright Apprentice ", "Summary Working most recently in Industrial facilities operations, I have been an Ultra Pure Water Tech at Intel and worked as a commercial building maintenance tech with Jones Lange Lasalle. \n \nAlso I love to build and always build things to stand the test of time. My expertise are in irrigation, low voltage lighting, and landscape construction. I incorporate some of all the trades in what I do and enjoy the diversity of my work.  \n \nI do well with project management and administration work and have enjoyed customer service and retail positions as well. \n \nSpecialties:  \nIndustrial water \nIndustrial Maintenance \nTechnician \nirrigation  \noutdoor lighting \nlandscape construction \nstone/boulder walls \nwater features \nadministration \nproject management \ncustomer service \ninventory ordering Summary Working most recently in Industrial facilities operations, I have been an Ultra Pure Water Tech at Intel and worked as a commercial building maintenance tech with Jones Lange Lasalle. \n \nAlso I love to build and always build things to stand the test of time. My expertise are in irrigation, low voltage lighting, and landscape construction. I incorporate some of all the trades in what I do and enjoy the diversity of my work.  \n \nI do well with project management and administration work and have enjoyed customer service and retail positions as well. \n \nSpecialties:  \nIndustrial water \nIndustrial Maintenance \nTechnician \nirrigation  \noutdoor lighting \nlandscape construction \nstone/boulder walls \nwater features \nadministration \nproject management \ncustomer service \ninventory ordering Working most recently in Industrial facilities operations, I have been an Ultra Pure Water Tech at Intel and worked as a commercial building maintenance tech with Jones Lange Lasalle. \n \nAlso I love to build and always build things to stand the test of time. My expertise are in irrigation, low voltage lighting, and landscape construction. I incorporate some of all the trades in what I do and enjoy the diversity of my work.  \n \nI do well with project management and administration work and have enjoyed customer service and retail positions as well. \n \nSpecialties:  \nIndustrial water \nIndustrial Maintenance \nTechnician \nirrigation  \noutdoor lighting \nlandscape construction \nstone/boulder walls \nwater features \nadministration \nproject management \ncustomer service \ninventory ordering Working most recently in Industrial facilities operations, I have been an Ultra Pure Water Tech at Intel and worked as a commercial building maintenance tech with Jones Lange Lasalle. \n \nAlso I love to build and always build things to stand the test of time. My expertise are in irrigation, low voltage lighting, and landscape construction. I incorporate some of all the trades in what I do and enjoy the diversity of my work.  \n \nI do well with project management and administration work and have enjoyed customer service and retail positions as well. \n \nSpecialties:  \nIndustrial water \nIndustrial Maintenance \nTechnician \nirrigation  \noutdoor lighting \nlandscape construction \nstone/boulder walls \nwater features \nadministration \nproject management \ncustomer service \ninventory ordering Experience SR. Facilities Technician Alta Devices May 2015  – Present (4 months) Facilities Technician Intel Corporation February 2012  –  April 2015  (3 years 3 months) Ultra Pure Water tech, Critical spare parts inventory management, Preventive maintenance, Industrial water, pumps, reverse osmosis, de-ionized water ultra filters, hazardous waste handeling, chemestry lab work, bacteria sampling, records keeping, Functional Analysis Testing, SCADA - Supervisory Control And Data Acquisition, PCSA (Process Control Systems Analysis), analyzer maintenance and repair Electrician Jones Lang LaSalle April 2011  –  February 2012  (11 months) Facilities maintenance at Intel - Ocotillo Campus Job site foreman Wessler Design Associates November 2006  –  March 2011  (4 years 5 months) Irrigation contractor, low voltage lighting specialist, and job site foreman for install of everything you can imagine that is not a house such as; gardens, landscapes, driveways, sun rooms, barns, fences, koi ponds, waterfalls, parks, roads, utilities, patios, plus complete property maintenance. Lead two crews on installation and maintenance jobs mostly on large estates and high-end residential projects ranging from $15,000 to $1.5 million. Daily reports on job sites, hours, materials, help needed, etc.  Project Manager Sacred Gardens Landscaping July 2002  –  April 2006  (3 years 10 months) employee management, business accounting and administration, irrigation design & construction, low-voltage lighting design and installation, landscape design & construction, vendor relations, customer service, client relations, heavy equipment operations, architect coordination, survey work, C.A.D., quickbooks, Filemaker Pro, bidding jobs, start to finish job planning and implementation, all aspects of construction contracting, event planning, marketing, public relations, human resources field electrician Sun Amp Electrical Contractor October 2000  –  July 2002  (1 year 10 months) commercial electrical construction, solar panel installation, wind generator installation, grid tie inverter installation, battery bank installation, inverter maintenance & power tracking, shipping and receiving, inventory management, team coordination, heavy equipment operator, vendor coordination, security systems oversight, property management Membeship Services Director Gentle Strenght Natural Foods Cooperative November 1998  –  May 2000  (1 year 7 months) Staff coordination, Scheduling, property management, Data Base management, P.O.S. systems management, reporting to GM and board of directors, education program administration, magazine and newsletter production and publication, mass mailing coordination, volunteer coordination, meeting facilitator, event planning and implementation, merchandising, marketing, vendor relations, desk top publishing, business planning, inventory control, budget planning/management Assembly line coordinator Varian Electronics November 1997  –  June 1999  (1 year 8 months) team coordination, soldering, problem diagnosis & solutions, manual assembly Vending Assistant Manager Yosemite Consession Services May 1995  –  October 1997  (2 years 6 months) coordinate vending routes, repair/maintain vending machines, schedule employees, order inventory, collect and deposit money ($5k-$15k daily), prepare reports for management Clerk Smith's Food & Drug July 1991  –  May 1995  (3 years 11 months) Customer Service, POS systems, merchandising, cleaning, scheduling, systems maintenance, opening/closing duties, cashiering, vender relations. SR. Facilities Technician Alta Devices May 2015  – Present (4 months) SR. Facilities Technician Alta Devices May 2015  – Present (4 months) Facilities Technician Intel Corporation February 2012  –  April 2015  (3 years 3 months) Ultra Pure Water tech, Critical spare parts inventory management, Preventive maintenance, Industrial water, pumps, reverse osmosis, de-ionized water ultra filters, hazardous waste handeling, chemestry lab work, bacteria sampling, records keeping, Functional Analysis Testing, SCADA - Supervisory Control And Data Acquisition, PCSA (Process Control Systems Analysis), analyzer maintenance and repair Facilities Technician Intel Corporation February 2012  –  April 2015  (3 years 3 months) Ultra Pure Water tech, Critical spare parts inventory management, Preventive maintenance, Industrial water, pumps, reverse osmosis, de-ionized water ultra filters, hazardous waste handeling, chemestry lab work, bacteria sampling, records keeping, Functional Analysis Testing, SCADA - Supervisory Control And Data Acquisition, PCSA (Process Control Systems Analysis), analyzer maintenance and repair Electrician Jones Lang LaSalle April 2011  –  February 2012  (11 months) Facilities maintenance at Intel - Ocotillo Campus Electrician Jones Lang LaSalle April 2011  –  February 2012  (11 months) Facilities maintenance at Intel - Ocotillo Campus Job site foreman Wessler Design Associates November 2006  –  March 2011  (4 years 5 months) Irrigation contractor, low voltage lighting specialist, and job site foreman for install of everything you can imagine that is not a house such as; gardens, landscapes, driveways, sun rooms, barns, fences, koi ponds, waterfalls, parks, roads, utilities, patios, plus complete property maintenance. Lead two crews on installation and maintenance jobs mostly on large estates and high-end residential projects ranging from $15,000 to $1.5 million. Daily reports on job sites, hours, materials, help needed, etc.  Job site foreman Wessler Design Associates November 2006  –  March 2011  (4 years 5 months) Irrigation contractor, low voltage lighting specialist, and job site foreman for install of everything you can imagine that is not a house such as; gardens, landscapes, driveways, sun rooms, barns, fences, koi ponds, waterfalls, parks, roads, utilities, patios, plus complete property maintenance. Lead two crews on installation and maintenance jobs mostly on large estates and high-end residential projects ranging from $15,000 to $1.5 million. Daily reports on job sites, hours, materials, help needed, etc.  Project Manager Sacred Gardens Landscaping July 2002  –  April 2006  (3 years 10 months) employee management, business accounting and administration, irrigation design & construction, low-voltage lighting design and installation, landscape design & construction, vendor relations, customer service, client relations, heavy equipment operations, architect coordination, survey work, C.A.D., quickbooks, Filemaker Pro, bidding jobs, start to finish job planning and implementation, all aspects of construction contracting, event planning, marketing, public relations, human resources Project Manager Sacred Gardens Landscaping July 2002  –  April 2006  (3 years 10 months) employee management, business accounting and administration, irrigation design & construction, low-voltage lighting design and installation, landscape design & construction, vendor relations, customer service, client relations, heavy equipment operations, architect coordination, survey work, C.A.D., quickbooks, Filemaker Pro, bidding jobs, start to finish job planning and implementation, all aspects of construction contracting, event planning, marketing, public relations, human resources field electrician Sun Amp Electrical Contractor October 2000  –  July 2002  (1 year 10 months) commercial electrical construction, solar panel installation, wind generator installation, grid tie inverter installation, battery bank installation, inverter maintenance & power tracking, shipping and receiving, inventory management, team coordination, heavy equipment operator, vendor coordination, security systems oversight, property management field electrician Sun Amp Electrical Contractor October 2000  –  July 2002  (1 year 10 months) commercial electrical construction, solar panel installation, wind generator installation, grid tie inverter installation, battery bank installation, inverter maintenance & power tracking, shipping and receiving, inventory management, team coordination, heavy equipment operator, vendor coordination, security systems oversight, property management Membeship Services Director Gentle Strenght Natural Foods Cooperative November 1998  –  May 2000  (1 year 7 months) Staff coordination, Scheduling, property management, Data Base management, P.O.S. systems management, reporting to GM and board of directors, education program administration, magazine and newsletter production and publication, mass mailing coordination, volunteer coordination, meeting facilitator, event planning and implementation, merchandising, marketing, vendor relations, desk top publishing, business planning, inventory control, budget planning/management Membeship Services Director Gentle Strenght Natural Foods Cooperative November 1998  –  May 2000  (1 year 7 months) Staff coordination, Scheduling, property management, Data Base management, P.O.S. systems management, reporting to GM and board of directors, education program administration, magazine and newsletter production and publication, mass mailing coordination, volunteer coordination, meeting facilitator, event planning and implementation, merchandising, marketing, vendor relations, desk top publishing, business planning, inventory control, budget planning/management Assembly line coordinator Varian Electronics November 1997  –  June 1999  (1 year 8 months) team coordination, soldering, problem diagnosis & solutions, manual assembly Assembly line coordinator Varian Electronics November 1997  –  June 1999  (1 year 8 months) team coordination, soldering, problem diagnosis & solutions, manual assembly Vending Assistant Manager Yosemite Consession Services May 1995  –  October 1997  (2 years 6 months) coordinate vending routes, repair/maintain vending machines, schedule employees, order inventory, collect and deposit money ($5k-$15k daily), prepare reports for management Vending Assistant Manager Yosemite Consession Services May 1995  –  October 1997  (2 years 6 months) coordinate vending routes, repair/maintain vending machines, schedule employees, order inventory, collect and deposit money ($5k-$15k daily), prepare reports for management Clerk Smith's Food & Drug July 1991  –  May 1995  (3 years 11 months) Customer Service, POS systems, merchandising, cleaning, scheduling, systems maintenance, opening/closing duties, cashiering, vender relations. Clerk Smith's Food & Drug July 1991  –  May 1995  (3 years 11 months) Customer Service, POS systems, merchandising, cleaning, scheduling, systems maintenance, opening/closing duties, cashiering, vender relations. Languages English English English Skills Customer Service Project Management Retail Public Speaking Construction Management Coaching Facilities Operations Electricians Landscape Design Building Maintenance Contractors Event Planning Plumbing Writing Landscaping Maintenance & Repair Renovation Manufacturing Editing Preventive Maintenance Contract Management Marketing Team Building Facilities Management See 9+     See less Skills  Customer Service Project Management Retail Public Speaking Construction Management Coaching Facilities Operations Electricians Landscape Design Building Maintenance Contractors Event Planning Plumbing Writing Landscaping Maintenance & Repair Renovation Manufacturing Editing Preventive Maintenance Contract Management Marketing Team Building Facilities Management See 9+     See less Customer Service Project Management Retail Public Speaking Construction Management Coaching Facilities Operations Electricians Landscape Design Building Maintenance Contractors Event Planning Plumbing Writing Landscaping Maintenance & Repair Renovation Manufacturing Editing Preventive Maintenance Contract Management Marketing Team Building Facilities Management See 9+     See less Customer Service Project Management Retail Public Speaking Construction Management Coaching Facilities Operations Electricians Landscape Design Building Maintenance Contractors Event Planning Plumbing Writing Landscaping Maintenance & Repair Renovation Manufacturing Editing Preventive Maintenance Contract Management Marketing Team Building Facilities Management See 9+     See less Education Arizona State University none,  Physics ,  Math ,  English , psychology,  Chinese ,  Tai Chi 1997  – 1999 Activities and Societies:  School News Paper Distribution ,  Tai Chi Mesa Community College none,  English ,  Math ,  Photography ,  Philosophy ,  History 1993  – 1995 software used: Adobe Photshop, Filemaker Pro, Pagemaker, Quark Activities and Societies:  Archery ,  Mt. Biking ,  Fencing ,  Tai Chi ,  Writing ,  School News Paper Arizona State University none,  Physics ,  Math ,  English , psychology,  Chinese ,  Tai Chi 1997  – 1999 Activities and Societies:  School News Paper Distribution ,  Tai Chi Arizona State University none,  Physics ,  Math ,  English , psychology,  Chinese ,  Tai Chi 1997  – 1999 Activities and Societies:  School News Paper Distribution ,  Tai Chi Arizona State University none,  Physics ,  Math ,  English , psychology,  Chinese ,  Tai Chi 1997  – 1999 Activities and Societies:  School News Paper Distribution ,  Tai Chi Mesa Community College none,  English ,  Math ,  Photography ,  Philosophy ,  History 1993  – 1995 software used: Adobe Photshop, Filemaker Pro, Pagemaker, Quark Activities and Societies:  Archery ,  Mt. Biking ,  Fencing ,  Tai Chi ,  Writing ,  School News Paper Mesa Community College none,  English ,  Math ,  Photography ,  Philosophy ,  History 1993  – 1995 software used: Adobe Photshop, Filemaker Pro, Pagemaker, Quark Activities and Societies:  Archery ,  Mt. Biking ,  Fencing ,  Tai Chi ,  Writing ,  School News Paper Mesa Community College none,  English ,  Math ,  Photography ,  Philosophy ,  History 1993  – 1995 software used: Adobe Photshop, Filemaker Pro, Pagemaker, Quark Activities and Societies:  Archery ,  Mt. Biking ,  Fencing ,  Tai Chi ,  Writing ,  School News Paper Honors & Awards MVP Alwun House Foundation April 2015 Award given at annual volunteer appreciation dinner - I committed more than 20 hours per month for more than two years to maintain the facilities and help with events - I also took on an entire fundraising event as project manager that had over 80 attendees and raised $2000  MVP Alwun House Foundation April 2015 Award given at annual volunteer appreciation dinner - I committed more than 20 hours per month for more than two years to maintain the facilities and help with events - I also took on an entire fundraising event as project manager that had over 80 attendees and raised $2000  MVP Alwun House Foundation April 2015 Award given at annual volunteer appreciation dinner - I committed more than 20 hours per month for more than two years to maintain the facilities and help with events - I also took on an entire fundraising event as project manager that had over 80 attendees and raised $2000  MVP Alwun House Foundation April 2015 Award given at annual volunteer appreciation dinner - I committed more than 20 hours per month for more than two years to maintain the facilities and help with events - I also took on an entire fundraising event as project manager that had over 80 attendees and raised $2000  ", "Experience Ultra Pure Water Facilities Technician Intel Corporation Ultra Pure Water Facilities Technician Intel Corporation Ultra Pure Water Facilities Technician Intel Corporation ", "Experience Facilities Technician Intel Corporation August 1997  – Present (18 years 1 month) facilities technician intel 1997  –  2009  (12 years) Facilities Technician Intel Corporation August 1997  – Present (18 years 1 month) Facilities Technician Intel Corporation August 1997  – Present (18 years 1 month) facilities technician intel 1997  –  2009  (12 years) facilities technician intel 1997  –  2009  (12 years) Education National American University B S,  Applied Management 2003  – 2005 Central New Mexico Community College A A S,  Mechanical Technologies 1994  – 1997 National American University B S,  Applied Management 2003  – 2005 National American University B S,  Applied Management 2003  – 2005 National American University B S,  Applied Management 2003  – 2005 Central New Mexico Community College A A S,  Mechanical Technologies 1994  – 1997 Central New Mexico Community College A A S,  Mechanical Technologies 1994  – 1997 Central New Mexico Community College A A S,  Mechanical Technologies 1994  – 1997 ", "Experience Facilities Engineer FUJIFILM Dimatix, Inc. May 2014  – Present (1 year 4 months) santa clara, california Facilities Manager Intermolecular inc. October 2006  –  May 2014  (7 years 8 months) Facilities Technician Intel Corporation July 1984  –  October 2006  (22 years 4 months) Facilities Engineer FUJIFILM Dimatix, Inc. May 2014  – Present (1 year 4 months) santa clara, california Facilities Engineer FUJIFILM Dimatix, Inc. May 2014  – Present (1 year 4 months) santa clara, california Facilities Manager Intermolecular inc. October 2006  –  May 2014  (7 years 8 months) Facilities Manager Intermolecular inc. October 2006  –  May 2014  (7 years 8 months) Facilities Technician Intel Corporation July 1984  –  October 2006  (22 years 4 months) Facilities Technician Intel Corporation July 1984  –  October 2006  (22 years 4 months) Skills Semiconductors Semiconductor Industry Metrology Design of Experiments Failure Analysis Thin Films CVD Silicon SPC PVD Characterization Cross-functional Team... Engineering Management MEMS Skills  Semiconductors Semiconductor Industry Metrology Design of Experiments Failure Analysis Thin Films CVD Silicon SPC PVD Characterization Cross-functional Team... Engineering Management MEMS Semiconductors Semiconductor Industry Metrology Design of Experiments Failure Analysis Thin Films CVD Silicon SPC PVD Characterization Cross-functional Team... Engineering Management MEMS Semiconductors Semiconductor Industry Metrology Design of Experiments Failure Analysis Thin Films CVD Silicon SPC PVD Characterization Cross-functional Team... Engineering Management MEMS ", "Experience Facilities Technician Intel Corporation Facilities Technician Intel Corporation Facilities Technician Intel Corporation ", "Experience Building Manager Aramark Ireland 2014  – Present (1 year) Barrow Street ,Dublin 4 Building Manager Aramark Ireland 2014  – Present (1 year) Barrow Street ,Dublin 4 Building Manager Aramark Ireland 2014  – Present (1 year) Barrow Street ,Dublin 4 Skills Facilities Management Property Management Safety Management... Building Management Building Maintenance Budgets Contract Management Preventive Maintenance Facilities Operations Maintenance Management Procurement Building Services Operations Management HVAC Energy Management Contract Negotiation Management See 2+     See less Skills  Facilities Management Property Management Safety Management... Building Management Building Maintenance Budgets Contract Management Preventive Maintenance Facilities Operations Maintenance Management Procurement Building Services Operations Management HVAC Energy Management Contract Negotiation Management See 2+     See less Facilities Management Property Management Safety Management... Building Management Building Maintenance Budgets Contract Management Preventive Maintenance Facilities Operations Maintenance Management Procurement Building Services Operations Management HVAC Energy Management Contract Negotiation Management See 2+     See less Facilities Management Property Management Safety Management... Building Management Building Maintenance Budgets Contract Management Preventive Maintenance Facilities Operations Maintenance Management Procurement Building Services Operations Management HVAC Energy Management Contract Negotiation Management See 2+     See less ", "Experience EHS Hazmat/Environmental Technician Intel September 2010  – Present (5 years) Facilities Technician Intel Corporation 2005  –  2010  (5 years) Facilities Technician WaferTech 1997  –  2002  (5 years) EHS Hazmat/Environmental Technician Intel September 2010  – Present (5 years) EHS Hazmat/Environmental Technician Intel September 2010  – Present (5 years) Facilities Technician Intel Corporation 2005  –  2010  (5 years) Facilities Technician Intel Corporation 2005  –  2010  (5 years) Facilities Technician WaferTech 1997  –  2002  (5 years) Facilities Technician WaferTech 1997  –  2002  (5 years) Skills Manufacturing JMP EHS Semiconductors Facilities Management Root Cause Analysis Ergonomics Industrial Hygiene Continuous Improvement Risk Assessment Engineering Management Cross-functional Team... Preventive Maintenance Lean Manufacturing Hazardous Waste... SPC Team Building See 2+     See less Skills  Manufacturing JMP EHS Semiconductors Facilities Management Root Cause Analysis Ergonomics Industrial Hygiene Continuous Improvement Risk Assessment Engineering Management Cross-functional Team... Preventive Maintenance Lean Manufacturing Hazardous Waste... SPC Team Building See 2+     See less Manufacturing JMP EHS Semiconductors Facilities Management Root Cause Analysis Ergonomics Industrial Hygiene Continuous Improvement Risk Assessment Engineering Management Cross-functional Team... Preventive Maintenance Lean Manufacturing Hazardous Waste... SPC Team Building See 2+     See less Manufacturing JMP EHS Semiconductors Facilities Management Root Cause Analysis Ergonomics Industrial Hygiene Continuous Improvement Risk Assessment Engineering Management Cross-functional Team... Preventive Maintenance Lean Manufacturing Hazardous Waste... SPC Team Building See 2+     See less Education PCC/OSU Bachelor of Science,  Environmental Science 2012  – 2015 PCC/OSU Bachelor of Science,  Environmental Science 2012  – 2015 PCC/OSU Bachelor of Science,  Environmental Science 2012  – 2015 PCC/OSU Bachelor of Science,  Environmental Science 2012  – 2015 ", "Experience Facilities Technician Intel Corporation Facilities Technician Intel Corporation Facilities Technician Intel Corporation ", "Experience Facilities technician Intel Corporation June 1995  – Present (20 years 3 months) Engineering Technician Medtronic February 1986  –  February 1995  (9 years 1 month) Formulation, tapecasting, co-fire, testing, failure analysis, manufacturing, design of multilayer cramics. Electroplating Operator CoorsTek July 1980  –  August 1983  (3 years 2 months) Ni / Au plating of ceramic multilayer chip packages. Facilities technician Intel Corporation June 1995  – Present (20 years 3 months) Facilities technician Intel Corporation June 1995  – Present (20 years 3 months) Engineering Technician Medtronic February 1986  –  February 1995  (9 years 1 month) Formulation, tapecasting, co-fire, testing, failure analysis, manufacturing, design of multilayer cramics. Engineering Technician Medtronic February 1986  –  February 1995  (9 years 1 month) Formulation, tapecasting, co-fire, testing, failure analysis, manufacturing, design of multilayer cramics. Electroplating Operator CoorsTek July 1980  –  August 1983  (3 years 2 months) Ni / Au plating of ceramic multilayer chip packages. Electroplating Operator CoorsTek July 1980  –  August 1983  (3 years 2 months) Ni / Au plating of ceramic multilayer chip packages. Skills Preventive Maintenance Troubleshooting Abatement Vacuum Pumps Facilities Operations Testing Continuous Improvement Process Improvement Lean Operations SPC Skills  Preventive Maintenance Troubleshooting Abatement Vacuum Pumps Facilities Operations Testing Continuous Improvement Process Improvement Lean Operations SPC Preventive Maintenance Troubleshooting Abatement Vacuum Pumps Facilities Operations Testing Continuous Improvement Process Improvement Lean Operations SPC Preventive Maintenance Troubleshooting Abatement Vacuum Pumps Facilities Operations Testing Continuous Improvement Process Improvement Lean Operations SPC ", "Experience LSS Facilities Technician Intel Corporation March 2011  – Present (4 years 6 months) Life Safety Technician Nulli-fire Ltd 2006  –  2009  (3 years) Electrician Mercury Engineering 2000  –  2006  (6 years) LSS Facilities Technician Intel Corporation March 2011  – Present (4 years 6 months) LSS Facilities Technician Intel Corporation March 2011  – Present (4 years 6 months) Life Safety Technician Nulli-fire Ltd 2006  –  2009  (3 years) Life Safety Technician Nulli-fire Ltd 2006  –  2009  (3 years) Electrician Mercury Engineering 2000  –  2006  (6 years) Electrician Mercury Engineering 2000  –  2006  (6 years) Skills Facilities Management Contract Management Engineering Project Management Customer Service Building Services Construction Construction Management Commissioning Procurement Operations Management Project Estimation Contractors Electricians MS Project Maintenance Management See 1+     See less Skills  Facilities Management Contract Management Engineering Project Management Customer Service Building Services Construction Construction Management Commissioning Procurement Operations Management Project Estimation Contractors Electricians MS Project Maintenance Management See 1+     See less Facilities Management Contract Management Engineering Project Management Customer Service Building Services Construction Construction Management Commissioning Procurement Operations Management Project Estimation Contractors Electricians MS Project Maintenance Management See 1+     See less Facilities Management Contract Management Engineering Project Management Customer Service Building Services Construction Construction Management Commissioning Procurement Operations Management Project Estimation Contractors Electricians MS Project Maintenance Management See 1+     See less ", "Experience Planning Engineer Pfizer Pharmaceuticals November 2003  – Present (11 years 10 months) Engineering Planning Maintenance Technician Wyeth Biopharma November 2003  –  October 2009  (6 years) Facilities Technician Intel Corporation July 2001  –  October 2003  (2 years 4 months) Maintenance Fitter Reheis Ltd June 2000  –  June 2001  (1 year 1 month) Maintenance Fitter Newport Pharmacueticals June 1996  –  April 2000  (3 years 11 months) Planning Engineer Pfizer Pharmaceuticals November 2003  – Present (11 years 10 months) Engineering Planning Planning Engineer Pfizer Pharmaceuticals November 2003  – Present (11 years 10 months) Engineering Planning Maintenance Technician Wyeth Biopharma November 2003  –  October 2009  (6 years) Maintenance Technician Wyeth Biopharma November 2003  –  October 2009  (6 years) Facilities Technician Intel Corporation July 2001  –  October 2003  (2 years 4 months) Facilities Technician Intel Corporation July 2001  –  October 2003  (2 years 4 months) Maintenance Fitter Reheis Ltd June 2000  –  June 2001  (1 year 1 month) Maintenance Fitter Reheis Ltd June 2000  –  June 2001  (1 year 1 month) Maintenance Fitter Newport Pharmacueticals June 1996  –  April 2000  (3 years 11 months) Maintenance Fitter Newport Pharmacueticals June 1996  –  April 2000  (3 years 11 months) Skills Project Planning GMP Project Management Pharmaceutical Industry Facilities Management Validation Calibration Continuous Improvement Engineering Commissioning Change Control Quality System FDA CAPA SOP Lean Manufacturing Manufacturing See 2+     See less Skills  Project Planning GMP Project Management Pharmaceutical Industry Facilities Management Validation Calibration Continuous Improvement Engineering Commissioning Change Control Quality System FDA CAPA SOP Lean Manufacturing Manufacturing See 2+     See less Project Planning GMP Project Management Pharmaceutical Industry Facilities Management Validation Calibration Continuous Improvement Engineering Commissioning Change Control Quality System FDA CAPA SOP Lean Manufacturing Manufacturing See 2+     See less Project Planning GMP Project Management Pharmaceutical Industry Facilities Management Validation Calibration Continuous Improvement Engineering Commissioning Change Control Quality System FDA CAPA SOP Lean Manufacturing Manufacturing See 2+     See less Education Dublin Institute of Technology City of Guids,  Maintenance of Automated Factory Systems 1999  – 2000 Engineering City of Guilds Dublin Institute of Technology City and Guilds Level 2,  Engineering Maintenance 1999  – 2000 Dublin Institute of Technology City of Guids,  Maintenance of Automated Factory Systems 1999  – 2000 Engineering City of Guilds Dublin Institute of Technology City of Guids,  Maintenance of Automated Factory Systems 1999  – 2000 Engineering City of Guilds Dublin Institute of Technology City of Guids,  Maintenance of Automated Factory Systems 1999  – 2000 Engineering City of Guilds Dublin Institute of Technology City and Guilds Level 2,  Engineering Maintenance 1999  – 2000 Dublin Institute of Technology City and Guilds Level 2,  Engineering Maintenance 1999  – 2000 Dublin Institute of Technology City and Guilds Level 2,  Engineering Maintenance 1999  – 2000 ", "Experience Facilities Technician Intel Corporation Facilities Technician Intel Corporation Facilities Technician Intel Corporation Education Dundalk Institute of Technology Construction Engineering Technology/Technician Institute of Technology Blanchardstown Mechatronics , Robotics, and Automation Engineering Dundalk Institute of Technology Construction Engineering Technology/Technician Dundalk Institute of Technology Construction Engineering Technology/Technician Dundalk Institute of Technology Construction Engineering Technology/Technician Institute of Technology Blanchardstown Mechatronics , Robotics, and Automation Engineering Institute of Technology Blanchardstown Mechatronics , Robotics, and Automation Engineering Institute of Technology Blanchardstown Mechatronics , Robotics, and Automation Engineering ", "Summary An experienced professional with in excess of 20 years in Facilies Management in a range of business areas, including Semi Conductor industry, Data Centre, Construction and Retail. A qualified electrician, also holds a Business Studies Degree and a Diploma in Personnel Management and Industrial Relations. Summary An experienced professional with in excess of 20 years in Facilies Management in a range of business areas, including Semi Conductor industry, Data Centre, Construction and Retail. A qualified electrician, also holds a Business Studies Degree and a Diploma in Personnel Management and Industrial Relations. An experienced professional with in excess of 20 years in Facilies Management in a range of business areas, including Semi Conductor industry, Data Centre, Construction and Retail. A qualified electrician, also holds a Business Studies Degree and a Diploma in Personnel Management and Industrial Relations. An experienced professional with in excess of 20 years in Facilies Management in a range of business areas, including Semi Conductor industry, Data Centre, Construction and Retail. A qualified electrician, also holds a Business Studies Degree and a Diploma in Personnel Management and Industrial Relations. Experience EMEA Facilities Operations Manager Guidewire Software May 2015  – Present (4 months) Facilities Management Consultant undisclosed August 2014  –  May 2015  (10 months) Undisclosed Seeking employment in Facilities Management Seeking employment April 2014  –  August 2014  (5 months) Unemployed Facilities Manager Ikea ireland March 2013  –  February 2014  (1 year) dublin Commmissioning Supervisor Mercury Engineering August 2011  –  September 2012  (1 year 2 months) Facilities Manager HOCHTIEF Facility Management Ireland Ltd April 2008  –  November 2010  (2 years 8 months) Dublin Day to day management of all Data Centre Facilities activities including planning and delivery of site maintenance programme. \nManagement of external maintenance installation including performance review based on quality of work and reaction to breakdowns. \nManagement of site and external resources to ensure site is adequately covered for all activities. \nProject management on new site installations  \nManagement of the Facilities budget. \nReporting out to Senior Site Management on status of site activities. \nDevelopment and implementation of efficiency initiatives including, Green initiatives \nEnsure compliance with relevant certification programmes. \nDevelop the team skill base to meet current and future needs Training and Development Consultant Self Employed January 2007  –  April 2008  (1 year 4 months) Leixlip Carried out skills analysis to identify training requirements for companies \nIdentifying Training needs for employees \nDevelopment and delivery of training material \nCoordination of external training resources People Systems Specialist Intel Corporation October 2005  –  November 2006  (1 year 2 months) Development and implementation of the Training Curriculum for all Facilities Personnel including Legislative, Health & Safety, and Technical Training for personnel at all levels in the organisation. \nCoordinator of site and global training teams to develop, implement and track training in line with Quality Systems targets. \nSite Manager of Global Workforce Planning programme in support of continuous improvement. Commissioning Supervisor Intel Corporation August 2004  –  October 2005  (1 year 3 months) Leixlip Supervising a cross functional team of technicians to carry out acceptance testing for the High Purity and Wastewater Facilities equipment \nDevelopment of operational procedures and training programmes.  \nManagement of the Sustaining Department budget for the project Contract Manager Intel Corporation October 2003  –  August 2004  (11 months) Leixlip Intel Contractor Manager for the company that operates the chemical and gas supply to the site.  \nPerformance review based on agreed Key Performance Indicators \nReview of Contractor Budget \nIdentification of Savings Opportunities and efficiencies. \nEnsuring compliance with ISO 9002 and ISO 140001 Facilities Supervisor Intel Corporation April 1994  –  October 2003  (9 years 7 months) Leixlip Supervision of all aspects of the Water and Industrial Wastewater Facilities supporting the Ireland campus.  \nThe development of a training programme for the department personnel. \nManagement of the Quality Programme to ensure continued certification under ISO9001:2000 and 14001. Senior Facilities Technician Intel Corporation 1991  –  1994  (3 years) Leixlip Maintenenace Electrician General Electric Superabrasives 1982  –  1991  (9 years) Dublin EMEA Facilities Operations Manager Guidewire Software May 2015  – Present (4 months) EMEA Facilities Operations Manager Guidewire Software May 2015  – Present (4 months) Facilities Management Consultant undisclosed August 2014  –  May 2015  (10 months) Undisclosed Facilities Management Consultant undisclosed August 2014  –  May 2015  (10 months) Undisclosed Seeking employment in Facilities Management Seeking employment April 2014  –  August 2014  (5 months) Unemployed Seeking employment in Facilities Management Seeking employment April 2014  –  August 2014  (5 months) Unemployed Facilities Manager Ikea ireland March 2013  –  February 2014  (1 year) dublin Facilities Manager Ikea ireland March 2013  –  February 2014  (1 year) dublin Commmissioning Supervisor Mercury Engineering August 2011  –  September 2012  (1 year 2 months) Commmissioning Supervisor Mercury Engineering August 2011  –  September 2012  (1 year 2 months) Facilities Manager HOCHTIEF Facility Management Ireland Ltd April 2008  –  November 2010  (2 years 8 months) Dublin Day to day management of all Data Centre Facilities activities including planning and delivery of site maintenance programme. \nManagement of external maintenance installation including performance review based on quality of work and reaction to breakdowns. \nManagement of site and external resources to ensure site is adequately covered for all activities. \nProject management on new site installations  \nManagement of the Facilities budget. \nReporting out to Senior Site Management on status of site activities. \nDevelopment and implementation of efficiency initiatives including, Green initiatives \nEnsure compliance with relevant certification programmes. \nDevelop the team skill base to meet current and future needs Facilities Manager HOCHTIEF Facility Management Ireland Ltd April 2008  –  November 2010  (2 years 8 months) Dublin Day to day management of all Data Centre Facilities activities including planning and delivery of site maintenance programme. \nManagement of external maintenance installation including performance review based on quality of work and reaction to breakdowns. \nManagement of site and external resources to ensure site is adequately covered for all activities. \nProject management on new site installations  \nManagement of the Facilities budget. \nReporting out to Senior Site Management on status of site activities. \nDevelopment and implementation of efficiency initiatives including, Green initiatives \nEnsure compliance with relevant certification programmes. \nDevelop the team skill base to meet current and future needs Training and Development Consultant Self Employed January 2007  –  April 2008  (1 year 4 months) Leixlip Carried out skills analysis to identify training requirements for companies \nIdentifying Training needs for employees \nDevelopment and delivery of training material \nCoordination of external training resources Training and Development Consultant Self Employed January 2007  –  April 2008  (1 year 4 months) Leixlip Carried out skills analysis to identify training requirements for companies \nIdentifying Training needs for employees \nDevelopment and delivery of training material \nCoordination of external training resources People Systems Specialist Intel Corporation October 2005  –  November 2006  (1 year 2 months) Development and implementation of the Training Curriculum for all Facilities Personnel including Legislative, Health & Safety, and Technical Training for personnel at all levels in the organisation. \nCoordinator of site and global training teams to develop, implement and track training in line with Quality Systems targets. \nSite Manager of Global Workforce Planning programme in support of continuous improvement. People Systems Specialist Intel Corporation October 2005  –  November 2006  (1 year 2 months) Development and implementation of the Training Curriculum for all Facilities Personnel including Legislative, Health & Safety, and Technical Training for personnel at all levels in the organisation. \nCoordinator of site and global training teams to develop, implement and track training in line with Quality Systems targets. \nSite Manager of Global Workforce Planning programme in support of continuous improvement. Commissioning Supervisor Intel Corporation August 2004  –  October 2005  (1 year 3 months) Leixlip Supervising a cross functional team of technicians to carry out acceptance testing for the High Purity and Wastewater Facilities equipment \nDevelopment of operational procedures and training programmes.  \nManagement of the Sustaining Department budget for the project Commissioning Supervisor Intel Corporation August 2004  –  October 2005  (1 year 3 months) Leixlip Supervising a cross functional team of technicians to carry out acceptance testing for the High Purity and Wastewater Facilities equipment \nDevelopment of operational procedures and training programmes.  \nManagement of the Sustaining Department budget for the project Contract Manager Intel Corporation October 2003  –  August 2004  (11 months) Leixlip Intel Contractor Manager for the company that operates the chemical and gas supply to the site.  \nPerformance review based on agreed Key Performance Indicators \nReview of Contractor Budget \nIdentification of Savings Opportunities and efficiencies. \nEnsuring compliance with ISO 9002 and ISO 140001 Contract Manager Intel Corporation October 2003  –  August 2004  (11 months) Leixlip Intel Contractor Manager for the company that operates the chemical and gas supply to the site.  \nPerformance review based on agreed Key Performance Indicators \nReview of Contractor Budget \nIdentification of Savings Opportunities and efficiencies. \nEnsuring compliance with ISO 9002 and ISO 140001 Facilities Supervisor Intel Corporation April 1994  –  October 2003  (9 years 7 months) Leixlip Supervision of all aspects of the Water and Industrial Wastewater Facilities supporting the Ireland campus.  \nThe development of a training programme for the department personnel. \nManagement of the Quality Programme to ensure continued certification under ISO9001:2000 and 14001. Facilities Supervisor Intel Corporation April 1994  –  October 2003  (9 years 7 months) Leixlip Supervision of all aspects of the Water and Industrial Wastewater Facilities supporting the Ireland campus.  \nThe development of a training programme for the department personnel. \nManagement of the Quality Programme to ensure continued certification under ISO9001:2000 and 14001. Senior Facilities Technician Intel Corporation 1991  –  1994  (3 years) Leixlip Senior Facilities Technician Intel Corporation 1991  –  1994  (3 years) Leixlip Maintenenace Electrician General Electric Superabrasives 1982  –  1991  (9 years) Dublin Maintenenace Electrician General Electric Superabrasives 1982  –  1991  (9 years) Dublin Skills Facilities Management Project Management Project Planning Contract Management Continuous Improvement Building Services Engineering Procurement Commissioning Management HVAC Training Maintenance Management Energy Management Budgets Program Management Building Management... Electricians Operations Management Building Maintenance HVAC Controls Facilities Operations Contract Negotiation Energy Efficiency Cross-functional Team... MS Project Preventive Maintenance Construction Safety ISO 14001 Construction Data Center Commercial Management Project Engineering Quality System Team Building Lean Manufacturing Process Improvement Construction Management Project Coordination Change Management Contractors Safety Management... Purchasing Cost Control Risk Assessment Negotiation Supervisory Skills Human Resources Waste Management Water Treatment See 35+     See less Skills  Facilities Management Project Management Project Planning Contract Management Continuous Improvement Building Services Engineering Procurement Commissioning Management HVAC Training Maintenance Management Energy Management Budgets Program Management Building Management... Electricians Operations Management Building Maintenance HVAC Controls Facilities Operations Contract Negotiation Energy Efficiency Cross-functional Team... MS Project Preventive Maintenance Construction Safety ISO 14001 Construction Data Center Commercial Management Project Engineering Quality System Team Building Lean Manufacturing Process Improvement Construction Management Project Coordination Change Management Contractors Safety Management... Purchasing Cost Control Risk Assessment Negotiation Supervisory Skills Human Resources Waste Management Water Treatment See 35+     See less Facilities Management Project Management Project Planning Contract Management Continuous Improvement Building Services Engineering Procurement Commissioning Management HVAC Training Maintenance Management Energy Management Budgets Program Management Building Management... Electricians Operations Management Building Maintenance HVAC Controls Facilities Operations Contract Negotiation Energy Efficiency Cross-functional Team... MS Project Preventive Maintenance Construction Safety ISO 14001 Construction Data Center Commercial Management Project Engineering Quality System Team Building Lean Manufacturing Process Improvement Construction Management Project Coordination Change Management Contractors Safety Management... Purchasing Cost Control Risk Assessment Negotiation Supervisory Skills Human Resources Waste Management Water Treatment See 35+     See less Facilities Management Project Management Project Planning Contract Management Continuous Improvement Building Services Engineering Procurement Commissioning Management HVAC Training Maintenance Management Energy Management Budgets Program Management Building Management... Electricians Operations Management Building Maintenance HVAC Controls Facilities Operations Contract Negotiation Energy Efficiency Cross-functional Team... MS Project Preventive Maintenance Construction Safety ISO 14001 Construction Data Center Commercial Management Project Engineering Quality System Team Building Lean Manufacturing Process Improvement Construction Management Project Coordination Change Management Contractors Safety Management... Purchasing Cost Control Risk Assessment Negotiation Supervisory Skills Human Resources Waste Management Water Treatment See 35+     See less Education ITT Dublin Business Studies,  People Management 2004  – 2006 NCIR Diploma,  Personnel Management and Industrial Relations 1997  – 1999 ITT Dublin Business Studies,  People Management 2004  – 2006 ITT Dublin Business Studies,  People Management 2004  – 2006 ITT Dublin Business Studies,  People Management 2004  – 2006 NCIR Diploma,  Personnel Management and Industrial Relations 1997  – 1999 NCIR Diploma,  Personnel Management and Industrial Relations 1997  – 1999 NCIR Diploma,  Personnel Management and Industrial Relations 1997  – 1999 ", "Experience Facilities Technician Intel Corporation June 2011  – Present (4 years 3 months) Portland, Oregon Area Manufacturing technicians and specialists are at the heart of Intel's mission to build the world's best processors. They work at our high-tech fabrication facilities worldwide, using the most advanced manufacturing processes and tools. If you enjoy working with the latest technology in a rewarding, fast-paced environment, a career in manufacturing at Intel may be for you. Our facilities technicians do everything—from managing mechanical systems and electrical distribution to monitoring water purity and waste management—to keep Intel's manufacturing facilities operating to our high standards. Electronic Assembler Carlisle Interconnect Technologies December 2010  –  February 2011  (3 months) Tukwila, WA Insurance Agent Brown & Brown June 2007  –  January 2009  (1 year 8 months) Brokers and agents are the retail side of insurance. Some insurers underwrite insurance only through brokers, who obtain raw data from layman customers and fill in the complex forms which insurers need in order to thoroughly assess the risk they are being asked to underwrite. Some jurisdictions have special rules about how policies must be printed, assembled, and delivered to insureds, and brokers are responsible for such compliance issues. \nMost importantly, insurance brokers assist prospective insureds with developing risk management strategies appropriate to their risk profiles. They work with insureds to find out what kinds of risks they regularly encounter, and educate insureds about what policies are available for each type of risk. Often, an insured may buy a regular policy plus endorsements or additional policies to fill in exclusions in the regular policy. Sales Rep Internet Advancement January 2001  –  January 2004  (3 years 1 month) Facilities Technician Intel Corporation June 2011  – Present (4 years 3 months) Portland, Oregon Area Manufacturing technicians and specialists are at the heart of Intel's mission to build the world's best processors. They work at our high-tech fabrication facilities worldwide, using the most advanced manufacturing processes and tools. If you enjoy working with the latest technology in a rewarding, fast-paced environment, a career in manufacturing at Intel may be for you. Our facilities technicians do everything—from managing mechanical systems and electrical distribution to monitoring water purity and waste management—to keep Intel's manufacturing facilities operating to our high standards. Facilities Technician Intel Corporation June 2011  – Present (4 years 3 months) Portland, Oregon Area Manufacturing technicians and specialists are at the heart of Intel's mission to build the world's best processors. They work at our high-tech fabrication facilities worldwide, using the most advanced manufacturing processes and tools. If you enjoy working with the latest technology in a rewarding, fast-paced environment, a career in manufacturing at Intel may be for you. Our facilities technicians do everything—from managing mechanical systems and electrical distribution to monitoring water purity and waste management—to keep Intel's manufacturing facilities operating to our high standards. Electronic Assembler Carlisle Interconnect Technologies December 2010  –  February 2011  (3 months) Tukwila, WA Electronic Assembler Carlisle Interconnect Technologies December 2010  –  February 2011  (3 months) Tukwila, WA Insurance Agent Brown & Brown June 2007  –  January 2009  (1 year 8 months) Brokers and agents are the retail side of insurance. Some insurers underwrite insurance only through brokers, who obtain raw data from layman customers and fill in the complex forms which insurers need in order to thoroughly assess the risk they are being asked to underwrite. Some jurisdictions have special rules about how policies must be printed, assembled, and delivered to insureds, and brokers are responsible for such compliance issues. \nMost importantly, insurance brokers assist prospective insureds with developing risk management strategies appropriate to their risk profiles. They work with insureds to find out what kinds of risks they regularly encounter, and educate insureds about what policies are available for each type of risk. Often, an insured may buy a regular policy plus endorsements or additional policies to fill in exclusions in the regular policy. Insurance Agent Brown & Brown June 2007  –  January 2009  (1 year 8 months) Brokers and agents are the retail side of insurance. Some insurers underwrite insurance only through brokers, who obtain raw data from layman customers and fill in the complex forms which insurers need in order to thoroughly assess the risk they are being asked to underwrite. Some jurisdictions have special rules about how policies must be printed, assembled, and delivered to insureds, and brokers are responsible for such compliance issues. \nMost importantly, insurance brokers assist prospective insureds with developing risk management strategies appropriate to their risk profiles. They work with insureds to find out what kinds of risks they regularly encounter, and educate insureds about what policies are available for each type of risk. Often, an insured may buy a regular policy plus endorsements or additional policies to fill in exclusions in the regular policy. Sales Rep Internet Advancement January 2001  –  January 2004  (3 years 1 month) Sales Rep Internet Advancement January 2001  –  January 2004  (3 years 1 month) Skills Team Building Communicating Risk Taker Team Leadership Project Management Account Management Microsoft Word HTML Insurance Recruiting @Risk Microsoft Excel Time Management PowerPoint Sales Outlook Customer Service New Business Development Windows Sales Management Access Leadership Microsoft Office Photoshop See 9+     See less Skills  Team Building Communicating Risk Taker Team Leadership Project Management Account Management Microsoft Word HTML Insurance Recruiting @Risk Microsoft Excel Time Management PowerPoint Sales Outlook Customer Service New Business Development Windows Sales Management Access Leadership Microsoft Office Photoshop See 9+     See less Team Building Communicating Risk Taker Team Leadership Project Management Account Management Microsoft Word HTML Insurance Recruiting @Risk Microsoft Excel Time Management PowerPoint Sales Outlook Customer Service New Business Development Windows Sales Management Access Leadership Microsoft Office Photoshop See 9+     See less Team Building Communicating Risk Taker Team Leadership Project Management Account Management Microsoft Word HTML Insurance Recruiting @Risk Microsoft Excel Time Management PowerPoint Sales Outlook Customer Service New Business Development Windows Sales Management Access Leadership Microsoft Office Photoshop See 9+     See less Education 2009-2011 ITT Technical Institute of Seattle AAS in Computer & Electronic Engineering,  Computer and Electronic Engineering Technology 2009  – 2011 495 hours of training in analog/digital circuit design and troubleshoot. 2009-2011 ITT Technical Institute of Seattle AAS in Computer & Electronic Engineering,  Computer and Electronic Engineering Technology 2009  – 2011 495 hours of training in analog/digital circuit design and troubleshoot. 2009-2011 ITT Technical Institute of Seattle AAS in Computer & Electronic Engineering,  Computer and Electronic Engineering Technology 2009  – 2011 495 hours of training in analog/digital circuit design and troubleshoot. 2009-2011 ITT Technical Institute of Seattle AAS in Computer & Electronic Engineering,  Computer and Electronic Engineering Technology 2009  – 2011 495 hours of training in analog/digital circuit design and troubleshoot. ", "Experience UPW Facilities Technician Intel Corporation September 1997  – Present (18 years) Facilities Technician Tektronix September 1976  –  September 1997  (21 years 1 month) Beaverton UPW Facilities Technician Intel Corporation September 1997  – Present (18 years) UPW Facilities Technician Intel Corporation September 1997  – Present (18 years) Facilities Technician Tektronix September 1976  –  September 1997  (21 years 1 month) Beaverton Facilities Technician Tektronix September 1976  –  September 1997  (21 years 1 month) Beaverton Skills SPC Electronics Troubleshooting IC Manufacturing Semiconductors Engineering Lean Manufacturing Testing SoC Design of Experiments Semiconductor Industry Wireless Cross-functional Team... ASIC Process Improvement See 1+     See less Skills  SPC Electronics Troubleshooting IC Manufacturing Semiconductors Engineering Lean Manufacturing Testing SoC Design of Experiments Semiconductor Industry Wireless Cross-functional Team... ASIC Process Improvement See 1+     See less SPC Electronics Troubleshooting IC Manufacturing Semiconductors Engineering Lean Manufacturing Testing SoC Design of Experiments Semiconductor Industry Wireless Cross-functional Team... ASIC Process Improvement See 1+     See less SPC Electronics Troubleshooting IC Manufacturing Semiconductors Engineering Lean Manufacturing Testing SoC Design of Experiments Semiconductor Industry Wireless Cross-functional Team... ASIC Process Improvement See 1+     See less ", "Experience Facilities Technician Intel Corporation June 1995  – Present (20 years 3 months) Chandler, AZ Engineering Technician Medtronic / Micro-Rel January 1985  –  February 1995  (10 years 2 months) Tempe, AZ Assisted engineering / manufacturing in design and development of ceramic multilayer chip carriers. Facilities Technician Intel Corporation June 1995  – Present (20 years 3 months) Chandler, AZ Facilities Technician Intel Corporation June 1995  – Present (20 years 3 months) Chandler, AZ Engineering Technician Medtronic / Micro-Rel January 1985  –  February 1995  (10 years 2 months) Tempe, AZ Assisted engineering / manufacturing in design and development of ceramic multilayer chip carriers. Engineering Technician Medtronic / Micro-Rel January 1985  –  February 1995  (10 years 2 months) Tempe, AZ Assisted engineering / manufacturing in design and development of ceramic multilayer chip carriers. Education Glendale Community College 1999  – 2001 Glendale Community College 1999  – 2001 Glendale Community College 1999  – 2001 Glendale Community College 1999  – 2001 ", "Experience Facilities Technician Intel Corporation June 2003  – Present (12 years 3 months) Facilities Technician Intel Corporation June 2003  – Present (12 years 3 months) Facilities Technician Intel Corporation June 2003  – Present (12 years 3 months) Skills Failure Analysis SPC Semiconductors Skills  Failure Analysis SPC Semiconductors Failure Analysis SPC Semiconductors Failure Analysis SPC Semiconductors Education Dublin Institute of Technology Dublin Institute of Technology Dublin Institute of Technology Dublin Institute of Technology ", "Experience Senior Estimator Bixby Electric, Inc. July 2015  – Present (2 months) Albuquerque, New Mexico Area Electrical Facilities Technician Intel Corporation January 2015  –  July 2015  (7 months) Rio Rancho, NM Senior Electrical Estimator JFK Electrical Contracting Enterprises, INC January 2014  –  January 2015  (1 year 1 month) Tempe, AZ Senior Estimator CSI Electrical Contractors Inc. May 2011  –  January 2014  (2 years 9 months) Santa fe Springs, CA Project Types: \nCommercial, Industrial, Large Solar Array and Landfill Gas to Energy. \n15KV to 120V Power Systems. AC and DC. \nElectrical Values: 500k to 10mil. \n \nTypical Projects estimated: \nKaiser MOB \nBaxter  \nSCE Solar  \nUSC & UCLA \nLAUSD \nNaval Base-Coronado, CA \n \nAwarded: USC Cinematic Arts Phase 3-Los Angeles, CA  \nDexus 10 megawatt SCE Solar-Perris, CA \nOlinda Brea-Landfill Gas to Energy. \n(largest project of its kind, in the United States-  \n32mega watts). Acting Project Manager as well  \nas the Estimator. Estimator/Project Manager Rosendin Electric April 2006  –  February 2009  (2 years 11 months) Albuquerque, New Mexico Area Estimator/Project Manager on the following Design Build \nProjects:  \nERICH -Fully Automated Stucco Plant (power and process controls) located in Albuquerque, NM. \nSTROBEL-BNSF Ethanol Storage Facility (power and process controls) located in Ft. Worth, TX. \n \nProject Manager of the following jobs: \nData Center Upgrade-Richardson, TX \nSante Fe Opera Restaurant-Sante Fe, NM \n \nMultiple projects above involved extensive traveling to Dallas/ Ft.Worth, TX; Omaha, Nebraska and San Jose, CA. Project Manager/Estimator Sasco November 1996  –  June 2001  (4 years 8 months) Newport Beach, CA On site PM/Estimator for Conexant (Fab Cleanrooms, Subfab, and Sustaining). \nOn site PM/Estimator for International Rectifier (Fab Cleanrooms and Subfab). Owner/Operator Qualified Energy Systems -Electric Contractor January 1991  –  March 1995  (4 years 3 months) Albuquerque, New Mexico \nCustom Homes and Commercial electrical installations. Estimator/Project Manager for DKD Electric. Intel Corporation November 1990  –  June 1993  (2 years 8 months) Rio Rancho, NM On site PM/Estimator and Foreman for DKD Electric. \nIntel-Rio Ranch, NM \nClean room and power support facilities: \nFab and Subfabs 9, 10, 11  \nCentral Utility Building (CUB). \nForeman on RR5 (5 story Administration Bldg.). Senior Estimator Bixby Electric, Inc. July 2015  – Present (2 months) Albuquerque, New Mexico Area Senior Estimator Bixby Electric, Inc. July 2015  – Present (2 months) Albuquerque, New Mexico Area Electrical Facilities Technician Intel Corporation January 2015  –  July 2015  (7 months) Rio Rancho, NM Electrical Facilities Technician Intel Corporation January 2015  –  July 2015  (7 months) Rio Rancho, NM Senior Electrical Estimator JFK Electrical Contracting Enterprises, INC January 2014  –  January 2015  (1 year 1 month) Tempe, AZ Senior Electrical Estimator JFK Electrical Contracting Enterprises, INC January 2014  –  January 2015  (1 year 1 month) Tempe, AZ Senior Estimator CSI Electrical Contractors Inc. May 2011  –  January 2014  (2 years 9 months) Santa fe Springs, CA Project Types: \nCommercial, Industrial, Large Solar Array and Landfill Gas to Energy. \n15KV to 120V Power Systems. AC and DC. \nElectrical Values: 500k to 10mil. \n \nTypical Projects estimated: \nKaiser MOB \nBaxter  \nSCE Solar  \nUSC & UCLA \nLAUSD \nNaval Base-Coronado, CA \n \nAwarded: USC Cinematic Arts Phase 3-Los Angeles, CA  \nDexus 10 megawatt SCE Solar-Perris, CA \nOlinda Brea-Landfill Gas to Energy. \n(largest project of its kind, in the United States-  \n32mega watts). Acting Project Manager as well  \nas the Estimator. Senior Estimator CSI Electrical Contractors Inc. May 2011  –  January 2014  (2 years 9 months) Santa fe Springs, CA Project Types: \nCommercial, Industrial, Large Solar Array and Landfill Gas to Energy. \n15KV to 120V Power Systems. AC and DC. \nElectrical Values: 500k to 10mil. \n \nTypical Projects estimated: \nKaiser MOB \nBaxter  \nSCE Solar  \nUSC & UCLA \nLAUSD \nNaval Base-Coronado, CA \n \nAwarded: USC Cinematic Arts Phase 3-Los Angeles, CA  \nDexus 10 megawatt SCE Solar-Perris, CA \nOlinda Brea-Landfill Gas to Energy. \n(largest project of its kind, in the United States-  \n32mega watts). Acting Project Manager as well  \nas the Estimator. Estimator/Project Manager Rosendin Electric April 2006  –  February 2009  (2 years 11 months) Albuquerque, New Mexico Area Estimator/Project Manager on the following Design Build \nProjects:  \nERICH -Fully Automated Stucco Plant (power and process controls) located in Albuquerque, NM. \nSTROBEL-BNSF Ethanol Storage Facility (power and process controls) located in Ft. Worth, TX. \n \nProject Manager of the following jobs: \nData Center Upgrade-Richardson, TX \nSante Fe Opera Restaurant-Sante Fe, NM \n \nMultiple projects above involved extensive traveling to Dallas/ Ft.Worth, TX; Omaha, Nebraska and San Jose, CA. Estimator/Project Manager Rosendin Electric April 2006  –  February 2009  (2 years 11 months) Albuquerque, New Mexico Area Estimator/Project Manager on the following Design Build \nProjects:  \nERICH -Fully Automated Stucco Plant (power and process controls) located in Albuquerque, NM. \nSTROBEL-BNSF Ethanol Storage Facility (power and process controls) located in Ft. Worth, TX. \n \nProject Manager of the following jobs: \nData Center Upgrade-Richardson, TX \nSante Fe Opera Restaurant-Sante Fe, NM \n \nMultiple projects above involved extensive traveling to Dallas/ Ft.Worth, TX; Omaha, Nebraska and San Jose, CA. Project Manager/Estimator Sasco November 1996  –  June 2001  (4 years 8 months) Newport Beach, CA On site PM/Estimator for Conexant (Fab Cleanrooms, Subfab, and Sustaining). \nOn site PM/Estimator for International Rectifier (Fab Cleanrooms and Subfab). Project Manager/Estimator Sasco November 1996  –  June 2001  (4 years 8 months) Newport Beach, CA On site PM/Estimator for Conexant (Fab Cleanrooms, Subfab, and Sustaining). \nOn site PM/Estimator for International Rectifier (Fab Cleanrooms and Subfab). Owner/Operator Qualified Energy Systems -Electric Contractor January 1991  –  March 1995  (4 years 3 months) Albuquerque, New Mexico \nCustom Homes and Commercial electrical installations. Owner/Operator Qualified Energy Systems -Electric Contractor January 1991  –  March 1995  (4 years 3 months) Albuquerque, New Mexico \nCustom Homes and Commercial electrical installations. Estimator/Project Manager for DKD Electric. Intel Corporation November 1990  –  June 1993  (2 years 8 months) Rio Rancho, NM On site PM/Estimator and Foreman for DKD Electric. \nIntel-Rio Ranch, NM \nClean room and power support facilities: \nFab and Subfabs 9, 10, 11  \nCentral Utility Building (CUB). \nForeman on RR5 (5 story Administration Bldg.). Estimator/Project Manager for DKD Electric. Intel Corporation November 1990  –  June 1993  (2 years 8 months) Rio Rancho, NM On site PM/Estimator and Foreman for DKD Electric. \nIntel-Rio Ranch, NM \nClean room and power support facilities: \nFab and Subfabs 9, 10, 11  \nCentral Utility Building (CUB). \nForeman on RR5 (5 story Administration Bldg.). Skills Electrical Estimating Project Management Electrical Contractors... Pre-construction Estimates Electrical Contracting Design-Build Subcontracting Construction Management Construction Electricians Navisworks Electricity Power Distribution Project Estimation Change Orders Low Voltage Solar Energy CPM Scheduling Project Bidding Contractors Value Engineering Energy Constructability RFI Blueprint Reading MEP LEED Primavera P6 Green Building See 15+     See less Skills  Electrical Estimating Project Management Electrical Contractors... Pre-construction Estimates Electrical Contracting Design-Build Subcontracting Construction Management Construction Electricians Navisworks Electricity Power Distribution Project Estimation Change Orders Low Voltage Solar Energy CPM Scheduling Project Bidding Contractors Value Engineering Energy Constructability RFI Blueprint Reading MEP LEED Primavera P6 Green Building See 15+     See less Electrical Estimating Project Management Electrical Contractors... Pre-construction Estimates Electrical Contracting Design-Build Subcontracting Construction Management Construction Electricians Navisworks Electricity Power Distribution Project Estimation Change Orders Low Voltage Solar Energy CPM Scheduling Project Bidding Contractors Value Engineering Energy Constructability RFI Blueprint Reading MEP LEED Primavera P6 Green Building See 15+     See less Electrical Estimating Project Management Electrical Contractors... Pre-construction Estimates Electrical Contracting Design-Build Subcontracting Construction Management Construction Electricians Navisworks Electricity Power Distribution Project Estimation Change Orders Low Voltage Solar Energy CPM Scheduling Project Bidding Contractors Value Engineering Energy Constructability RFI Blueprint Reading MEP LEED Primavera P6 Green Building See 15+     See less Education IBEW Joint Apprenticeship Program Journeman Wireman,  Electrical 1981  – 1984 University of Arizona-College of Architecture Architecture 1979  – 1980 IBEW Joint Apprenticeship Program Journeman Wireman,  Electrical 1981  – 1984 IBEW Joint Apprenticeship Program Journeman Wireman,  Electrical 1981  – 1984 IBEW Joint Apprenticeship Program Journeman Wireman,  Electrical 1981  – 1984 University of Arizona-College of Architecture Architecture 1979  – 1980 University of Arizona-College of Architecture Architecture 1979  – 1980 University of Arizona-College of Architecture Architecture 1979  – 1980 Honors & Awards Additional Honors & Awards Glass Art Magazine-May/June 2006 Additional Honors & Awards Glass Art Magazine-May/June 2006 Additional Honors & Awards Glass Art Magazine-May/June 2006 Additional Honors & Awards Glass Art Magazine-May/June 2006 ", "Summary Data-driven process engineer with over 14 years of experience and a focus on operations leadership, projects, system development and customer satisfaction. Experienced as a facilities manager of engineers and technicians where I set direction and use indicators to focus on reliable operations while reducing cost and lowering work load. Successfully use the philosophies of Lean and Maintenance Science to create an efficient work environment. Drive problem solving and root cause analysis using techniques such as Model Based Problem Solving among others. As an engineer I successfully implemented complex systems from initial research and development to sustaining operations with emphasis on reliability, safety, budget and schedule. Extensive experience in: \n \n• Industrial Wastewater Treatment and Recycling \n• Ultra-Pure and Industrial Water Treatment \n• Operations Management \n• Structured Problem Solving \n• Statistical Process Control and Instrumentation \n• LEAN Continuous Improvement \n• Experiment Design, Regulatory Compliance, RCRA \n• Team and Project Leadership/Management \n• System Design and Construction Documents \n• System Operations and Training Summary Data-driven process engineer with over 14 years of experience and a focus on operations leadership, projects, system development and customer satisfaction. Experienced as a facilities manager of engineers and technicians where I set direction and use indicators to focus on reliable operations while reducing cost and lowering work load. Successfully use the philosophies of Lean and Maintenance Science to create an efficient work environment. Drive problem solving and root cause analysis using techniques such as Model Based Problem Solving among others. As an engineer I successfully implemented complex systems from initial research and development to sustaining operations with emphasis on reliability, safety, budget and schedule. Extensive experience in: \n \n• Industrial Wastewater Treatment and Recycling \n• Ultra-Pure and Industrial Water Treatment \n• Operations Management \n• Structured Problem Solving \n• Statistical Process Control and Instrumentation \n• LEAN Continuous Improvement \n• Experiment Design, Regulatory Compliance, RCRA \n• Team and Project Leadership/Management \n• System Design and Construction Documents \n• System Operations and Training Data-driven process engineer with over 14 years of experience and a focus on operations leadership, projects, system development and customer satisfaction. Experienced as a facilities manager of engineers and technicians where I set direction and use indicators to focus on reliable operations while reducing cost and lowering work load. Successfully use the philosophies of Lean and Maintenance Science to create an efficient work environment. Drive problem solving and root cause analysis using techniques such as Model Based Problem Solving among others. As an engineer I successfully implemented complex systems from initial research and development to sustaining operations with emphasis on reliability, safety, budget and schedule. Extensive experience in: \n \n• Industrial Wastewater Treatment and Recycling \n• Ultra-Pure and Industrial Water Treatment \n• Operations Management \n• Structured Problem Solving \n• Statistical Process Control and Instrumentation \n• LEAN Continuous Improvement \n• Experiment Design, Regulatory Compliance, RCRA \n• Team and Project Leadership/Management \n• System Design and Construction Documents \n• System Operations and Training Data-driven process engineer with over 14 years of experience and a focus on operations leadership, projects, system development and customer satisfaction. Experienced as a facilities manager of engineers and technicians where I set direction and use indicators to focus on reliable operations while reducing cost and lowering work load. Successfully use the philosophies of Lean and Maintenance Science to create an efficient work environment. Drive problem solving and root cause analysis using techniques such as Model Based Problem Solving among others. As an engineer I successfully implemented complex systems from initial research and development to sustaining operations with emphasis on reliability, safety, budget and schedule. Extensive experience in: \n \n• Industrial Wastewater Treatment and Recycling \n• Ultra-Pure and Industrial Water Treatment \n• Operations Management \n• Structured Problem Solving \n• Statistical Process Control and Instrumentation \n• LEAN Continuous Improvement \n• Experiment Design, Regulatory Compliance, RCRA \n• Team and Project Leadership/Management \n• System Design and Construction Documents \n• System Operations and Training Experience Facilities Chemical Engineer Intel Sr. Facilities Engineer Intel Corporation March 2013  – Present (2 years 6 months) Hillsboro, Oregon Develop, design and operate UPW treatment and environmental system. Lead engineer on construction projects and problem solving. Group Lead/Operations Manager Intel Corporation January 2010  –  March 2013  (3 years 3 months) Hillsboro, Oregon Managed a team of UPW and Industrial Waste Engineers and Technicians responsible for operations and maintenance to include budget accuracy, safety programs, goal setting, work prioritization, indicator development, headcount modeling and hiring. Lead work load reduction effort using Lean and maintenance science principals to reduce work load. Improved systems reliability year over year by focusing on root cause analysis of quality events and maintained programs to assure RCRA and environmental compliance. Facilities Chemical Engineer Intel Corporation June 2001  –  January 2010  (8 years 8 months) Hillsboro, Oregon Provided ownership of UPW and industrial waste treatment systems such as Hydrofluoric acid, Acid waste, solvents, copper, etc. Worked with factory customers to develop new waste treatment systems as factory chemistries changed. Lead work groups and construction projects. Experience with RCRA, ISO, PHA and FMEAs. Facilities Technician Intel Corporation May 2000  –  June 2001  (1 year 2 months) Hillsboro, Oregon Operated and maintained ultra-pure water and environmental systems. Facilities Chemical Engineer Intel Facilities Chemical Engineer Intel Sr. Facilities Engineer Intel Corporation March 2013  – Present (2 years 6 months) Hillsboro, Oregon Develop, design and operate UPW treatment and environmental system. Lead engineer on construction projects and problem solving. Sr. Facilities Engineer Intel Corporation March 2013  – Present (2 years 6 months) Hillsboro, Oregon Develop, design and operate UPW treatment and environmental system. Lead engineer on construction projects and problem solving. Group Lead/Operations Manager Intel Corporation January 2010  –  March 2013  (3 years 3 months) Hillsboro, Oregon Managed a team of UPW and Industrial Waste Engineers and Technicians responsible for operations and maintenance to include budget accuracy, safety programs, goal setting, work prioritization, indicator development, headcount modeling and hiring. Lead work load reduction effort using Lean and maintenance science principals to reduce work load. Improved systems reliability year over year by focusing on root cause analysis of quality events and maintained programs to assure RCRA and environmental compliance. Group Lead/Operations Manager Intel Corporation January 2010  –  March 2013  (3 years 3 months) Hillsboro, Oregon Managed a team of UPW and Industrial Waste Engineers and Technicians responsible for operations and maintenance to include budget accuracy, safety programs, goal setting, work prioritization, indicator development, headcount modeling and hiring. Lead work load reduction effort using Lean and maintenance science principals to reduce work load. Improved systems reliability year over year by focusing on root cause analysis of quality events and maintained programs to assure RCRA and environmental compliance. Facilities Chemical Engineer Intel Corporation June 2001  –  January 2010  (8 years 8 months) Hillsboro, Oregon Provided ownership of UPW and industrial waste treatment systems such as Hydrofluoric acid, Acid waste, solvents, copper, etc. Worked with factory customers to develop new waste treatment systems as factory chemistries changed. Lead work groups and construction projects. Experience with RCRA, ISO, PHA and FMEAs. Facilities Chemical Engineer Intel Corporation June 2001  –  January 2010  (8 years 8 months) Hillsboro, Oregon Provided ownership of UPW and industrial waste treatment systems such as Hydrofluoric acid, Acid waste, solvents, copper, etc. Worked with factory customers to develop new waste treatment systems as factory chemistries changed. Lead work groups and construction projects. Experience with RCRA, ISO, PHA and FMEAs. Facilities Technician Intel Corporation May 2000  –  June 2001  (1 year 2 months) Hillsboro, Oregon Operated and maintained ultra-pure water and environmental systems. Facilities Technician Intel Corporation May 2000  –  June 2001  (1 year 2 months) Hillsboro, Oregon Operated and maintained ultra-pure water and environmental systems. Skills Semiconductors Skills  Semiconductors Semiconductors Semiconductors Education Oregon State University 1992  – 1996 Oregon State University 1992  – 1996 Oregon State University 1992  – 1996 Oregon State University 1992  – 1996 ", "Summary I am currently searching for a position to install, troubleshoot and repair equipment. My recent position was to install, troubleshoot and setup online network configurations for oil and gas companies. At Intel I performed routine maintenance on semiconductor etch equipment where I performed pm’s, installation and troubleshooting which included vacuum systems, robot arms, gas systems and chemical decomposition units and pumps. I have 15 years of experience in maintenance and installation of semiconductor and oil drilling equipment. I also have 1 year experience in Pump Applications where I performed the Bill of Materials for customer pumps. I am self starter and do all my work with little or no supervision. I am willing to relocate, travel, work overtime, and take responsibilities to work \"on call\". Summary I am currently searching for a position to install, troubleshoot and repair equipment. My recent position was to install, troubleshoot and setup online network configurations for oil and gas companies. At Intel I performed routine maintenance on semiconductor etch equipment where I performed pm’s, installation and troubleshooting which included vacuum systems, robot arms, gas systems and chemical decomposition units and pumps. I have 15 years of experience in maintenance and installation of semiconductor and oil drilling equipment. I also have 1 year experience in Pump Applications where I performed the Bill of Materials for customer pumps. I am self starter and do all my work with little or no supervision. I am willing to relocate, travel, work overtime, and take responsibilities to work \"on call\". I am currently searching for a position to install, troubleshoot and repair equipment. My recent position was to install, troubleshoot and setup online network configurations for oil and gas companies. At Intel I performed routine maintenance on semiconductor etch equipment where I performed pm’s, installation and troubleshooting which included vacuum systems, robot arms, gas systems and chemical decomposition units and pumps. I have 15 years of experience in maintenance and installation of semiconductor and oil drilling equipment. I also have 1 year experience in Pump Applications where I performed the Bill of Materials for customer pumps. I am self starter and do all my work with little or no supervision. I am willing to relocate, travel, work overtime, and take responsibilities to work \"on call\". I am currently searching for a position to install, troubleshoot and repair equipment. My recent position was to install, troubleshoot and setup online network configurations for oil and gas companies. At Intel I performed routine maintenance on semiconductor etch equipment where I performed pm’s, installation and troubleshooting which included vacuum systems, robot arms, gas systems and chemical decomposition units and pumps. I have 15 years of experience in maintenance and installation of semiconductor and oil drilling equipment. I also have 1 year experience in Pump Applications where I performed the Bill of Materials for customer pumps. I am self starter and do all my work with little or no supervision. I am willing to relocate, travel, work overtime, and take responsibilities to work \"on call\". Experience Lead Field Installation Specialist MicroBlend, Inc. October 2013  – Present (1 year 11 months) Gilbert Arizona Installing paint component and equipment. Troubleshooting and calibrating equipment startups.  \n100% field work. Traveling to South America. Operations Specialist Kinder Morgan December 2012  –  October 2013  (11 months) Denver City Texas Responsible for the operations and maintenance of compressors, engines, generators, \npumps, motor cooling equipment, turbines, pump stations, valves, seals and leaks. Perform spark plug surveys on engines to find any abnormal conditions on engines, and perform engine balances with Windrock Diagnostic system equipment. Oversee construction and maintenance activities performed by third parties. Complete all applicable documentation and recordkeeping. Field Service Technician Wellkeeper, Inc. September 2009  –  December 2012  (3 years 4 months) Tatum, NM • Install, troubleshoot and repair electronic remote monitoring instrumentation, solar panels, flow meters, Rosemont pressure and level sensors for oil and gas production and saltwater disposal wells to allow owners and operators to be able to see online results. \n• Service, troubleshoot and flash telemetry equipment using JTAG, FET-Pro430, RF programmers, RS232-485 modbus client configurations and PLC connectivity Applications Engineer Master Pumps & Power April 2008  –  April 2009  (1 year 1 month) Hobbs NM •\tPerform Engineering applications for pump sizing \n•\tResearch vendors for lowest pump pricing to beat competitor’s quotes \n•\tInput all required parts and fittings for pump applications including skid, motor mount and couplings \n•\tField jobs to meet and help the salesmen with pump quotation matrix \n•\tAssist with inside sales and mechanics either inside or outside the store \n•\tSizing and troubleshooting on centrifugal, gear, vertical, and multistage pumps Field Service Technician Pason Systems June 2007  –  April 2008  (11 months) Tatum NM • Install and maintain the Pason Electronic Drilling Records, Pit Volume, Totalizer and Total Gas System, as well as other Pason products and services.  \n• Train customers in the use of the equipment.  \n• Electronic hydraulic LAN system for gauge sensors to connect with multiple location for weight on bit or mud pressures on drilling rigs. \n• Ensure that Pason equipment and all its components function to the satisfaction of the customer  \n• Manage and track equipment inventory, in the field truck, warehouse or on assigned rigs  \n• Maintenance of records in the Operations Database as related to equipment and customers \n• Track expense accounts \n• Business development for potential customers and the sale of additional products and services to customers  \n• Provide feedback for the improvement of equipment, documentation, procedure and policy  \n• Track all rig movement and activity in assigned area  \nMaintain constant communication with Regional Managers, fellow Field Service /Sales Technicians and customers \n• Constant and continual improvement of product knowledge and knowledge of the petroleum industry in general  \n• Perform all duties in the safest possible manner Facilities Technician Intel Corporation January 2001  –  December 2006  (6 years) Chandler AZ • Provide service to all internal customers in the Fab \n• Maintain maintenance records on the Intel equipment work stream data base \n• Perform preventative maintenance and troubleshooting on Edwards high vacuum pumps, abatement systems, chemical decomposition oxidation units, and chiller systems \n• Assist in chemical response handling to hazardous waste including but not limited to Germanium, NF3, HCl, HF, Arsenic, CL2, H2SO4. \n• Respond to emergency situations in certain areas to facilitate situations, which could be life threatening and factory downtime, using SCBA while performing the emergency situation \n• Provide Seed technician training to new and incoming employees on safety and \non new process on operations, and troubleshooting.  \nSeek ways to continuously improve the safety, process, and maintenance of high vacuum/turbo machinery in semiconductor etch tools, specs and statistical analysis \n• Troubleshooting defect systems using the following: Leak testing equipment, Defect Inspection Station, Opti-probe, Ultra-point Review Stations \n• Working with other teams to solve and in identify factory down issues Installation and Qualification Technician Intel Corporation February 1996  –  January 2001  (5 years) Albuquerque, New Mexico Area • Assist the Project Manager with the execution of his responsibilities to support technical assistant to semiconductor equipment installations of Hitachi M308 etchers and Gasonics etchers, including but not limited to planning, scheduling and controlling safety behavior to the projects  \n• Regarding projects I had daily communications with contractors, inspecting their work, testing results and taking corrective action when needed. \n• Responsible to communicate with contractors to ensure the safety, quality, and accuracy of the equipment layouts and installations \n• Develop control of design packages that may need change orders \n• Reviewing electrical, mechanical and architectural schematics \n• Field coordination of construction including electrical and gas systems safety tests and sign offs. \n• Interfacing with virtual factories to perform upgrades on installations and modifications \n• Preparing corrections to direct the contractors when discrepancies were \n• discovered in the blue prints \n• Troubleshooting and repairing new install issues, and to provide direction to the contractors \n• Make sure that contractors adhere to completion of micro-schedules \n• Responsible for supporting wafer processing, maintenance repair and process issues Lead Field Installation Specialist MicroBlend, Inc. October 2013  – Present (1 year 11 months) Gilbert Arizona Installing paint component and equipment. Troubleshooting and calibrating equipment startups.  \n100% field work. Traveling to South America. Lead Field Installation Specialist MicroBlend, Inc. October 2013  – Present (1 year 11 months) Gilbert Arizona Installing paint component and equipment. Troubleshooting and calibrating equipment startups.  \n100% field work. Traveling to South America. Operations Specialist Kinder Morgan December 2012  –  October 2013  (11 months) Denver City Texas Responsible for the operations and maintenance of compressors, engines, generators, \npumps, motor cooling equipment, turbines, pump stations, valves, seals and leaks. Perform spark plug surveys on engines to find any abnormal conditions on engines, and perform engine balances with Windrock Diagnostic system equipment. Oversee construction and maintenance activities performed by third parties. Complete all applicable documentation and recordkeeping. Operations Specialist Kinder Morgan December 2012  –  October 2013  (11 months) Denver City Texas Responsible for the operations and maintenance of compressors, engines, generators, \npumps, motor cooling equipment, turbines, pump stations, valves, seals and leaks. Perform spark plug surveys on engines to find any abnormal conditions on engines, and perform engine balances with Windrock Diagnostic system equipment. Oversee construction and maintenance activities performed by third parties. Complete all applicable documentation and recordkeeping. Field Service Technician Wellkeeper, Inc. September 2009  –  December 2012  (3 years 4 months) Tatum, NM • Install, troubleshoot and repair electronic remote monitoring instrumentation, solar panels, flow meters, Rosemont pressure and level sensors for oil and gas production and saltwater disposal wells to allow owners and operators to be able to see online results. \n• Service, troubleshoot and flash telemetry equipment using JTAG, FET-Pro430, RF programmers, RS232-485 modbus client configurations and PLC connectivity Field Service Technician Wellkeeper, Inc. September 2009  –  December 2012  (3 years 4 months) Tatum, NM • Install, troubleshoot and repair electronic remote monitoring instrumentation, solar panels, flow meters, Rosemont pressure and level sensors for oil and gas production and saltwater disposal wells to allow owners and operators to be able to see online results. \n• Service, troubleshoot and flash telemetry equipment using JTAG, FET-Pro430, RF programmers, RS232-485 modbus client configurations and PLC connectivity Applications Engineer Master Pumps & Power April 2008  –  April 2009  (1 year 1 month) Hobbs NM •\tPerform Engineering applications for pump sizing \n•\tResearch vendors for lowest pump pricing to beat competitor’s quotes \n•\tInput all required parts and fittings for pump applications including skid, motor mount and couplings \n•\tField jobs to meet and help the salesmen with pump quotation matrix \n•\tAssist with inside sales and mechanics either inside or outside the store \n•\tSizing and troubleshooting on centrifugal, gear, vertical, and multistage pumps Applications Engineer Master Pumps & Power April 2008  –  April 2009  (1 year 1 month) Hobbs NM •\tPerform Engineering applications for pump sizing \n•\tResearch vendors for lowest pump pricing to beat competitor’s quotes \n•\tInput all required parts and fittings for pump applications including skid, motor mount and couplings \n•\tField jobs to meet and help the salesmen with pump quotation matrix \n•\tAssist with inside sales and mechanics either inside or outside the store \n•\tSizing and troubleshooting on centrifugal, gear, vertical, and multistage pumps Field Service Technician Pason Systems June 2007  –  April 2008  (11 months) Tatum NM • Install and maintain the Pason Electronic Drilling Records, Pit Volume, Totalizer and Total Gas System, as well as other Pason products and services.  \n• Train customers in the use of the equipment.  \n• Electronic hydraulic LAN system for gauge sensors to connect with multiple location for weight on bit or mud pressures on drilling rigs. \n• Ensure that Pason equipment and all its components function to the satisfaction of the customer  \n• Manage and track equipment inventory, in the field truck, warehouse or on assigned rigs  \n• Maintenance of records in the Operations Database as related to equipment and customers \n• Track expense accounts \n• Business development for potential customers and the sale of additional products and services to customers  \n• Provide feedback for the improvement of equipment, documentation, procedure and policy  \n• Track all rig movement and activity in assigned area  \nMaintain constant communication with Regional Managers, fellow Field Service /Sales Technicians and customers \n• Constant and continual improvement of product knowledge and knowledge of the petroleum industry in general  \n• Perform all duties in the safest possible manner Field Service Technician Pason Systems June 2007  –  April 2008  (11 months) Tatum NM • Install and maintain the Pason Electronic Drilling Records, Pit Volume, Totalizer and Total Gas System, as well as other Pason products and services.  \n• Train customers in the use of the equipment.  \n• Electronic hydraulic LAN system for gauge sensors to connect with multiple location for weight on bit or mud pressures on drilling rigs. \n• Ensure that Pason equipment and all its components function to the satisfaction of the customer  \n• Manage and track equipment inventory, in the field truck, warehouse or on assigned rigs  \n• Maintenance of records in the Operations Database as related to equipment and customers \n• Track expense accounts \n• Business development for potential customers and the sale of additional products and services to customers  \n• Provide feedback for the improvement of equipment, documentation, procedure and policy  \n• Track all rig movement and activity in assigned area  \nMaintain constant communication with Regional Managers, fellow Field Service /Sales Technicians and customers \n• Constant and continual improvement of product knowledge and knowledge of the petroleum industry in general  \n• Perform all duties in the safest possible manner Facilities Technician Intel Corporation January 2001  –  December 2006  (6 years) Chandler AZ • Provide service to all internal customers in the Fab \n• Maintain maintenance records on the Intel equipment work stream data base \n• Perform preventative maintenance and troubleshooting on Edwards high vacuum pumps, abatement systems, chemical decomposition oxidation units, and chiller systems \n• Assist in chemical response handling to hazardous waste including but not limited to Germanium, NF3, HCl, HF, Arsenic, CL2, H2SO4. \n• Respond to emergency situations in certain areas to facilitate situations, which could be life threatening and factory downtime, using SCBA while performing the emergency situation \n• Provide Seed technician training to new and incoming employees on safety and \non new process on operations, and troubleshooting.  \nSeek ways to continuously improve the safety, process, and maintenance of high vacuum/turbo machinery in semiconductor etch tools, specs and statistical analysis \n• Troubleshooting defect systems using the following: Leak testing equipment, Defect Inspection Station, Opti-probe, Ultra-point Review Stations \n• Working with other teams to solve and in identify factory down issues Facilities Technician Intel Corporation January 2001  –  December 2006  (6 years) Chandler AZ • Provide service to all internal customers in the Fab \n• Maintain maintenance records on the Intel equipment work stream data base \n• Perform preventative maintenance and troubleshooting on Edwards high vacuum pumps, abatement systems, chemical decomposition oxidation units, and chiller systems \n• Assist in chemical response handling to hazardous waste including but not limited to Germanium, NF3, HCl, HF, Arsenic, CL2, H2SO4. \n• Respond to emergency situations in certain areas to facilitate situations, which could be life threatening and factory downtime, using SCBA while performing the emergency situation \n• Provide Seed technician training to new and incoming employees on safety and \non new process on operations, and troubleshooting.  \nSeek ways to continuously improve the safety, process, and maintenance of high vacuum/turbo machinery in semiconductor etch tools, specs and statistical analysis \n• Troubleshooting defect systems using the following: Leak testing equipment, Defect Inspection Station, Opti-probe, Ultra-point Review Stations \n• Working with other teams to solve and in identify factory down issues Installation and Qualification Technician Intel Corporation February 1996  –  January 2001  (5 years) Albuquerque, New Mexico Area • Assist the Project Manager with the execution of his responsibilities to support technical assistant to semiconductor equipment installations of Hitachi M308 etchers and Gasonics etchers, including but not limited to planning, scheduling and controlling safety behavior to the projects  \n• Regarding projects I had daily communications with contractors, inspecting their work, testing results and taking corrective action when needed. \n• Responsible to communicate with contractors to ensure the safety, quality, and accuracy of the equipment layouts and installations \n• Develop control of design packages that may need change orders \n• Reviewing electrical, mechanical and architectural schematics \n• Field coordination of construction including electrical and gas systems safety tests and sign offs. \n• Interfacing with virtual factories to perform upgrades on installations and modifications \n• Preparing corrections to direct the contractors when discrepancies were \n• discovered in the blue prints \n• Troubleshooting and repairing new install issues, and to provide direction to the contractors \n• Make sure that contractors adhere to completion of micro-schedules \n• Responsible for supporting wafer processing, maintenance repair and process issues Installation and Qualification Technician Intel Corporation February 1996  –  January 2001  (5 years) Albuquerque, New Mexico Area • Assist the Project Manager with the execution of his responsibilities to support technical assistant to semiconductor equipment installations of Hitachi M308 etchers and Gasonics etchers, including but not limited to planning, scheduling and controlling safety behavior to the projects  \n• Regarding projects I had daily communications with contractors, inspecting their work, testing results and taking corrective action when needed. \n• Responsible to communicate with contractors to ensure the safety, quality, and accuracy of the equipment layouts and installations \n• Develop control of design packages that may need change orders \n• Reviewing electrical, mechanical and architectural schematics \n• Field coordination of construction including electrical and gas systems safety tests and sign offs. \n• Interfacing with virtual factories to perform upgrades on installations and modifications \n• Preparing corrections to direct the contractors when discrepancies were \n• discovered in the blue prints \n• Troubleshooting and repairing new install issues, and to provide direction to the contractors \n• Make sure that contractors adhere to completion of micro-schedules \n• Responsible for supporting wafer processing, maintenance repair and process issues Languages Spanish Spanish Spanish Skills Engineering PLC Oil Field Service Troubleshooting Electronics Computer Hardware Documentation Testing Preventive Maintenance Windows Operating Systems Problem Solving Electrical Manufacturing Microsoft Office Software Installation Customer Service VoIP Supervisory Skills Telecommunications Customer Relations Printers Instrumentation Word Hydraulics PowerPoint Outlook Excel Hardware Electricians Factory Pumps See 18+     See less Skills  Engineering PLC Oil Field Service Troubleshooting Electronics Computer Hardware Documentation Testing Preventive Maintenance Windows Operating Systems Problem Solving Electrical Manufacturing Microsoft Office Software Installation Customer Service VoIP Supervisory Skills Telecommunications Customer Relations Printers Instrumentation Word Hydraulics PowerPoint Outlook Excel Hardware Electricians Factory Pumps See 18+     See less Engineering PLC Oil Field Service Troubleshooting Electronics Computer Hardware Documentation Testing Preventive Maintenance Windows Operating Systems Problem Solving Electrical Manufacturing Microsoft Office Software Installation Customer Service VoIP Supervisory Skills Telecommunications Customer Relations Printers Instrumentation Word Hydraulics PowerPoint Outlook Excel Hardware Electricians Factory Pumps See 18+     See less Engineering PLC Oil Field Service Troubleshooting Electronics Computer Hardware Documentation Testing Preventive Maintenance Windows Operating Systems Problem Solving Electrical Manufacturing Microsoft Office Software Installation Customer Service VoIP Supervisory Skills Telecommunications Customer Relations Printers Instrumentation Word Hydraulics PowerPoint Outlook Excel Hardware Electricians Factory Pumps See 18+     See less Education New Mexico State University BS,  Engineering Technology 1989  – 1994 Studied Mechanical Engineering Technology Activities and Societies:  Society of Hispanic Professional Engineers New Mexico State University BS,  Engineering Technology 1989  – 1994 Studied Mechanical Engineering Technology Activities and Societies:  Society of Hispanic Professional Engineers New Mexico State University BS,  Engineering Technology 1989  – 1994 Studied Mechanical Engineering Technology Activities and Societies:  Society of Hispanic Professional Engineers New Mexico State University BS,  Engineering Technology 1989  – 1994 Studied Mechanical Engineering Technology Activities and Societies:  Society of Hispanic Professional Engineers ", "Experience Facilities Operations Manager / Project Manager FLUOR April 2013  – Present (2 years 5 months) Boulder - Colorado IBM Boulder location covers 2.5 million square feet of buildings with five large data centers, five chiller plants, and 50 plus MW emergency standby generators, multiple call centers. \n \nPerformed administrative activities associated with the effective management of operation,  \nCurrently supporting FLUOR data center technical team (DCTT). \n \nManaged “Critical Systems Team” performed five year MV electrical system preventive maintenance for critical data center.  \n \n \nComplies with all FLUOR Corporation safety requirements and programs and covered site Duty Managers role on rotation basis. Facility Manager Jones Lang LaSalle February 2011  –  April 2013  (2 years 3 months) 161 Inverness dr West Manage multiple sites with 1,400 client’s employees, Data Center 15,000 sq ft (24x7), Call Center (20x7). Managing five direct reports with 2.5 million dollar operating budget. Facilities Specialist Directv April 2006  –  February 2011  (4 years 11 months) 161 inverness dr west Oversee and administer daily operation of the Data Center (15,000 sq ft) & 250,000 sq ft office building. FACILITIES TECHNICIAN Intel Corporation November 2004  –  April 2006  (1 year 6 months) Colorado Springs, Colorado Area Operational and Maintenance functions on critical chip manufacturing facilities on mechanical systems including air handlers, boilers, chillers, cooling towers, Scrubbers, exhaust systems and water treatment. Automated Controls Facilities Operations Manager / Project Manager FLUOR April 2013  – Present (2 years 5 months) Boulder - Colorado IBM Boulder location covers 2.5 million square feet of buildings with five large data centers, five chiller plants, and 50 plus MW emergency standby generators, multiple call centers. \n \nPerformed administrative activities associated with the effective management of operation,  \nCurrently supporting FLUOR data center technical team (DCTT). \n \nManaged “Critical Systems Team” performed five year MV electrical system preventive maintenance for critical data center.  \n \n \nComplies with all FLUOR Corporation safety requirements and programs and covered site Duty Managers role on rotation basis. Facilities Operations Manager / Project Manager FLUOR April 2013  – Present (2 years 5 months) Boulder - Colorado IBM Boulder location covers 2.5 million square feet of buildings with five large data centers, five chiller plants, and 50 plus MW emergency standby generators, multiple call centers. \n \nPerformed administrative activities associated with the effective management of operation,  \nCurrently supporting FLUOR data center technical team (DCTT). \n \nManaged “Critical Systems Team” performed five year MV electrical system preventive maintenance for critical data center.  \n \n \nComplies with all FLUOR Corporation safety requirements and programs and covered site Duty Managers role on rotation basis. Facility Manager Jones Lang LaSalle February 2011  –  April 2013  (2 years 3 months) 161 Inverness dr West Manage multiple sites with 1,400 client’s employees, Data Center 15,000 sq ft (24x7), Call Center (20x7). Managing five direct reports with 2.5 million dollar operating budget. Facility Manager Jones Lang LaSalle February 2011  –  April 2013  (2 years 3 months) 161 Inverness dr West Manage multiple sites with 1,400 client’s employees, Data Center 15,000 sq ft (24x7), Call Center (20x7). Managing five direct reports with 2.5 million dollar operating budget. Facilities Specialist Directv April 2006  –  February 2011  (4 years 11 months) 161 inverness dr west Oversee and administer daily operation of the Data Center (15,000 sq ft) & 250,000 sq ft office building. Facilities Specialist Directv April 2006  –  February 2011  (4 years 11 months) 161 inverness dr west Oversee and administer daily operation of the Data Center (15,000 sq ft) & 250,000 sq ft office building. FACILITIES TECHNICIAN Intel Corporation November 2004  –  April 2006  (1 year 6 months) Colorado Springs, Colorado Area Operational and Maintenance functions on critical chip manufacturing facilities on mechanical systems including air handlers, boilers, chillers, cooling towers, Scrubbers, exhaust systems and water treatment. Automated Controls FACILITIES TECHNICIAN Intel Corporation November 2004  –  April 2006  (1 year 6 months) Colorado Springs, Colorado Area Operational and Maintenance functions on critical chip manufacturing facilities on mechanical systems including air handlers, boilers, chillers, cooling towers, Scrubbers, exhaust systems and water treatment. Automated Controls Skills Maintenance & Repair Management Facilities Operations Facilities Management Data Center Program Management HVAC Contract Negotiation Project Management Process Improvement Customer Service Team Building Skills  Maintenance & Repair Management Facilities Operations Facilities Management Data Center Program Management HVAC Contract Negotiation Project Management Process Improvement Customer Service Team Building Maintenance & Repair Management Facilities Operations Facilities Management Data Center Program Management HVAC Contract Negotiation Project Management Process Improvement Customer Service Team Building Maintenance & Repair Management Facilities Operations Facilities Management Data Center Program Management HVAC Contract Negotiation Project Management Process Improvement Customer Service Team Building "]}