{"position": "Field Sales Engineer", "company": "Intel Corporation", "profiles": ["Languages English Professional working proficiency Espagnol Professional working proficiency English Professional working proficiency Espagnol Professional working proficiency English Professional working proficiency Espagnol Professional working proficiency Professional working proficiency Professional working proficiency Skills Product Marketing Intel Mobile Devices Product Management Consumer Electronics Cross-functional Team... Semiconductors Processors Competitive Analysis Strategic Partnerships Embedded Systems Semiconductor Industry SoC Android Business Development Marketing Strategy Mobile Applications IC Management of... Strategy Go-to-market Strategy Account Management Product Launch Marketing B2B Management Entrepreneurship Multi-channel Marketing Business Alliances Integration Responsable produit Partenariats... Stratégie de... See 18+     See less Skills  Product Marketing Intel Mobile Devices Product Management Consumer Electronics Cross-functional Team... Semiconductors Processors Competitive Analysis Strategic Partnerships Embedded Systems Semiconductor Industry SoC Android Business Development Marketing Strategy Mobile Applications IC Management of... Strategy Go-to-market Strategy Account Management Product Launch Marketing B2B Management Entrepreneurship Multi-channel Marketing Business Alliances Integration Responsable produit Partenariats... Stratégie de... See 18+     See less Product Marketing Intel Mobile Devices Product Management Consumer Electronics Cross-functional Team... Semiconductors Processors Competitive Analysis Strategic Partnerships Embedded Systems Semiconductor Industry SoC Android Business Development Marketing Strategy Mobile Applications IC Management of... Strategy Go-to-market Strategy Account Management Product Launch Marketing B2B Management Entrepreneurship Multi-channel Marketing Business Alliances Integration Responsable produit Partenariats... Stratégie de... See 18+     See less Product Marketing Intel Mobile Devices Product Management Consumer Electronics Cross-functional Team... Semiconductors Processors Competitive Analysis Strategic Partnerships Embedded Systems Semiconductor Industry SoC Android Business Development Marketing Strategy Mobile Applications IC Management of... Strategy Go-to-market Strategy Account Management Product Launch Marketing B2B Management Entrepreneurship Multi-channel Marketing Business Alliances Integration Responsable produit Partenariats... Stratégie de... See 18+     See less ", "Summary Successful semi-conductor electronics sales professional with career-to-date billings of $1.5B+.  \n \nExpertise in territory management with direct sales model, rep sales model and channel management. Thrives in producing results in a design win culture. Naturally adept at creating, negotiating and managing the value chain for both sides of a large relationships including complex multi-national, multi-product line OEM engagements. Known for putting together $100M+ deals.  \n \nHighly trained, versatile leader and team builder. Enthusiastic. Willing to accept a challenge. Competitive. High management focus. Communicates with credibility and confidence. Comfortable with C-Level contacts. Excellent decision-maker in high pressure, complex environment.  \n \n \nFUNCTIONAL EXPERTISE \n•\tDesign wins that go to MP with a profit!  \n•\tTerritory Management, Team Building \n•\tRep and Distributor Management \n•\tPC, Server, Networking, Consumer, Industrial and Medical market segments \n•\tExperienced with IBM, Cisco, HP, Sun, Ericsson, Alcatel-Lucent, AT&T, Motorola, Bayer, Honeywell, GE, Schneider, Hughes, and more. \n \nPRODUCT LINE EXPERTISE \n•\tMemory Devices and Subsystems \n•\tMicroprocessors and Operating Systems \n•\tMicrocontrollers 8/16/32 bit \n•\tASIC all design models down to 28nm \n•\tASSPs for DTV and cell phone \n•\tMobile Solutions including LTE/4G \n•\tDevelopment Systems and Tools \n•\tSingle Board Computers and Software \n•\tPower MOSFET Devices \n \nGEOGRAPHIC FOCUS \nHave managed Northeast U.S., East Coast U.S., Eastern Canada, and North Central U.S.  \nWorked with and have traveled to Mexico, Germany, France, U.K., Japan, Hong Kong, Singapore, and Taiwan. Summary Successful semi-conductor electronics sales professional with career-to-date billings of $1.5B+.  \n \nExpertise in territory management with direct sales model, rep sales model and channel management. Thrives in producing results in a design win culture. Naturally adept at creating, negotiating and managing the value chain for both sides of a large relationships including complex multi-national, multi-product line OEM engagements. Known for putting together $100M+ deals.  \n \nHighly trained, versatile leader and team builder. Enthusiastic. Willing to accept a challenge. Competitive. High management focus. Communicates with credibility and confidence. Comfortable with C-Level contacts. Excellent decision-maker in high pressure, complex environment.  \n \n \nFUNCTIONAL EXPERTISE \n•\tDesign wins that go to MP with a profit!  \n•\tTerritory Management, Team Building \n•\tRep and Distributor Management \n•\tPC, Server, Networking, Consumer, Industrial and Medical market segments \n•\tExperienced with IBM, Cisco, HP, Sun, Ericsson, Alcatel-Lucent, AT&T, Motorola, Bayer, Honeywell, GE, Schneider, Hughes, and more. \n \nPRODUCT LINE EXPERTISE \n•\tMemory Devices and Subsystems \n•\tMicroprocessors and Operating Systems \n•\tMicrocontrollers 8/16/32 bit \n•\tASIC all design models down to 28nm \n•\tASSPs for DTV and cell phone \n•\tMobile Solutions including LTE/4G \n•\tDevelopment Systems and Tools \n•\tSingle Board Computers and Software \n•\tPower MOSFET Devices \n \nGEOGRAPHIC FOCUS \nHave managed Northeast U.S., East Coast U.S., Eastern Canada, and North Central U.S.  \nWorked with and have traveled to Mexico, Germany, France, U.K., Japan, Hong Kong, Singapore, and Taiwan. Successful semi-conductor electronics sales professional with career-to-date billings of $1.5B+.  \n \nExpertise in territory management with direct sales model, rep sales model and channel management. Thrives in producing results in a design win culture. Naturally adept at creating, negotiating and managing the value chain for both sides of a large relationships including complex multi-national, multi-product line OEM engagements. Known for putting together $100M+ deals.  \n \nHighly trained, versatile leader and team builder. Enthusiastic. Willing to accept a challenge. Competitive. High management focus. Communicates with credibility and confidence. Comfortable with C-Level contacts. Excellent decision-maker in high pressure, complex environment.  \n \n \nFUNCTIONAL EXPERTISE \n•\tDesign wins that go to MP with a profit!  \n•\tTerritory Management, Team Building \n•\tRep and Distributor Management \n•\tPC, Server, Networking, Consumer, Industrial and Medical market segments \n•\tExperienced with IBM, Cisco, HP, Sun, Ericsson, Alcatel-Lucent, AT&T, Motorola, Bayer, Honeywell, GE, Schneider, Hughes, and more. \n \nPRODUCT LINE EXPERTISE \n•\tMemory Devices and Subsystems \n•\tMicroprocessors and Operating Systems \n•\tMicrocontrollers 8/16/32 bit \n•\tASIC all design models down to 28nm \n•\tASSPs for DTV and cell phone \n•\tMobile Solutions including LTE/4G \n•\tDevelopment Systems and Tools \n•\tSingle Board Computers and Software \n•\tPower MOSFET Devices \n \nGEOGRAPHIC FOCUS \nHave managed Northeast U.S., East Coast U.S., Eastern Canada, and North Central U.S.  \nWorked with and have traveled to Mexico, Germany, France, U.K., Japan, Hong Kong, Singapore, and Taiwan. Successful semi-conductor electronics sales professional with career-to-date billings of $1.5B+.  \n \nExpertise in territory management with direct sales model, rep sales model and channel management. Thrives in producing results in a design win culture. Naturally adept at creating, negotiating and managing the value chain for both sides of a large relationships including complex multi-national, multi-product line OEM engagements. Known for putting together $100M+ deals.  \n \nHighly trained, versatile leader and team builder. Enthusiastic. Willing to accept a challenge. Competitive. High management focus. Communicates with credibility and confidence. Comfortable with C-Level contacts. Excellent decision-maker in high pressure, complex environment.  \n \n \nFUNCTIONAL EXPERTISE \n•\tDesign wins that go to MP with a profit!  \n•\tTerritory Management, Team Building \n•\tRep and Distributor Management \n•\tPC, Server, Networking, Consumer, Industrial and Medical market segments \n•\tExperienced with IBM, Cisco, HP, Sun, Ericsson, Alcatel-Lucent, AT&T, Motorola, Bayer, Honeywell, GE, Schneider, Hughes, and more. \n \nPRODUCT LINE EXPERTISE \n•\tMemory Devices and Subsystems \n•\tMicroprocessors and Operating Systems \n•\tMicrocontrollers 8/16/32 bit \n•\tASIC all design models down to 28nm \n•\tASSPs for DTV and cell phone \n•\tMobile Solutions including LTE/4G \n•\tDevelopment Systems and Tools \n•\tSingle Board Computers and Software \n•\tPower MOSFET Devices \n \nGEOGRAPHIC FOCUS \nHave managed Northeast U.S., East Coast U.S., Eastern Canada, and North Central U.S.  \nWorked with and have traveled to Mexico, Germany, France, U.K., Japan, Hong Kong, Singapore, and Taiwan. Experience Director OEM Sales Renesas Electronics America 2008  –  2013  (5 years) Managed territory from Virginia to Eastern Canada. Resources under management included 2 FSEs, 2 AEs, 6 independent rep firms with a total of 35 sales people and a network of distributors. Regional Sales Manager NEC Electronics America, Inc. 2003  –  2008  (5 years) Managed Northeast territory working through 5 independent rep firms with a total of 30 sales people and a network of distributors. Direct reports include 2 application engineers. Eastern Region Director of Sales NEC Electronics America, Inc. 2001  –  2003  (2 years) Responsible for eastern U.S., Puerto Rico and eastern Canada. Managed 3 district managers, 4 application engineers and 2 customer service administrators. Major Accounts Manager NEC Electronics America, Inc. 1996  –  2000  (4 years) Oversaw select group of high dollar volume, strategic design-ins. Product emphasis: ASIC, Memory, Microprocessors. Market emphasis: PC Graphics, Cable TV STB. District Sales Manager NEC Electronics America, Inc. 1992  –  1996  (4 years) Managed 6 Rep firms, 28 sales representatives, 4 FAEs and multiple distributors in the Northeast and Canada. Senior Corporate Account Manager- IBM NEC Electronics America, Inc. 1985  –  1992  (7 years) Fishkill, NY WW account responsibility. Managed 8 direct reports, 4 reps and coordinated Europe and Asia Field Sales Engineer Intel Corporation 1980  –  1985  (5 years) Field Sales Engineer Intel Corporation 1980  –  1985  (5 years) Director OEM Sales Renesas Electronics America 2008  –  2013  (5 years) Managed territory from Virginia to Eastern Canada. Resources under management included 2 FSEs, 2 AEs, 6 independent rep firms with a total of 35 sales people and a network of distributors. Director OEM Sales Renesas Electronics America 2008  –  2013  (5 years) Managed territory from Virginia to Eastern Canada. Resources under management included 2 FSEs, 2 AEs, 6 independent rep firms with a total of 35 sales people and a network of distributors. Regional Sales Manager NEC Electronics America, Inc. 2003  –  2008  (5 years) Managed Northeast territory working through 5 independent rep firms with a total of 30 sales people and a network of distributors. Direct reports include 2 application engineers. Regional Sales Manager NEC Electronics America, Inc. 2003  –  2008  (5 years) Managed Northeast territory working through 5 independent rep firms with a total of 30 sales people and a network of distributors. Direct reports include 2 application engineers. Eastern Region Director of Sales NEC Electronics America, Inc. 2001  –  2003  (2 years) Responsible for eastern U.S., Puerto Rico and eastern Canada. Managed 3 district managers, 4 application engineers and 2 customer service administrators. Eastern Region Director of Sales NEC Electronics America, Inc. 2001  –  2003  (2 years) Responsible for eastern U.S., Puerto Rico and eastern Canada. Managed 3 district managers, 4 application engineers and 2 customer service administrators. Major Accounts Manager NEC Electronics America, Inc. 1996  –  2000  (4 years) Oversaw select group of high dollar volume, strategic design-ins. Product emphasis: ASIC, Memory, Microprocessors. Market emphasis: PC Graphics, Cable TV STB. Major Accounts Manager NEC Electronics America, Inc. 1996  –  2000  (4 years) Oversaw select group of high dollar volume, strategic design-ins. Product emphasis: ASIC, Memory, Microprocessors. Market emphasis: PC Graphics, Cable TV STB. District Sales Manager NEC Electronics America, Inc. 1992  –  1996  (4 years) Managed 6 Rep firms, 28 sales representatives, 4 FAEs and multiple distributors in the Northeast and Canada. District Sales Manager NEC Electronics America, Inc. 1992  –  1996  (4 years) Managed 6 Rep firms, 28 sales representatives, 4 FAEs and multiple distributors in the Northeast and Canada. Senior Corporate Account Manager- IBM NEC Electronics America, Inc. 1985  –  1992  (7 years) Fishkill, NY WW account responsibility. Managed 8 direct reports, 4 reps and coordinated Europe and Asia Senior Corporate Account Manager- IBM NEC Electronics America, Inc. 1985  –  1992  (7 years) Fishkill, NY WW account responsibility. Managed 8 direct reports, 4 reps and coordinated Europe and Asia Field Sales Engineer Intel Corporation 1980  –  1985  (5 years) Field Sales Engineer Intel Corporation 1980  –  1985  (5 years) Field Sales Engineer Intel Corporation 1980  –  1985  (5 years) Field Sales Engineer Intel Corporation 1980  –  1985  (5 years) Skills Semiconductors Selling Contract Negotiation Sales Management Account Management Semiconductor Industry Product Management Product Marketing Sales Operations ASIC Key Account Management IC Negotiation Strategy Cross-functional Team... EDA SoC Analog Wireless Solution Selling Forecasting Electronics Sales Business Development Program Management Strategic Partnerships Mixed Signal Go-to-market Strategy Consumer Electronics Competitive Analysis Technical Marketing Processors Product Development International Sales RF Embedded Systems Power Management Digital Signal... ARM Hardware Architecture FPGA Embedded Software Microcontrollers Microprocessors Mobile Devices Product Launch Start-ups Mobile Communications Pricing See 34+     See less Skills  Semiconductors Selling Contract Negotiation Sales Management Account Management Semiconductor Industry Product Management Product Marketing Sales Operations ASIC Key Account Management IC Negotiation Strategy Cross-functional Team... EDA SoC Analog Wireless Solution Selling Forecasting Electronics Sales Business Development Program Management Strategic Partnerships Mixed Signal Go-to-market Strategy Consumer Electronics Competitive Analysis Technical Marketing Processors Product Development International Sales RF Embedded Systems Power Management Digital Signal... ARM Hardware Architecture FPGA Embedded Software Microcontrollers Microprocessors Mobile Devices Product Launch Start-ups Mobile Communications Pricing See 34+     See less Semiconductors Selling Contract Negotiation Sales Management Account Management Semiconductor Industry Product Management Product Marketing Sales Operations ASIC Key Account Management IC Negotiation Strategy Cross-functional Team... EDA SoC Analog Wireless Solution Selling Forecasting Electronics Sales Business Development Program Management Strategic Partnerships Mixed Signal Go-to-market Strategy Consumer Electronics Competitive Analysis Technical Marketing Processors Product Development International Sales RF Embedded Systems Power Management Digital Signal... ARM Hardware Architecture FPGA Embedded Software Microcontrollers Microprocessors Mobile Devices Product Launch Start-ups Mobile Communications Pricing See 34+     See less Semiconductors Selling Contract Negotiation Sales Management Account Management Semiconductor Industry Product Management Product Marketing Sales Operations ASIC Key Account Management IC Negotiation Strategy Cross-functional Team... EDA SoC Analog Wireless Solution Selling Forecasting Electronics Sales Business Development Program Management Strategic Partnerships Mixed Signal Go-to-market Strategy Consumer Electronics Competitive Analysis Technical Marketing Processors Product Development International Sales RF Embedded Systems Power Management Digital Signal... ARM Hardware Architecture FPGA Embedded Software Microcontrollers Microprocessors Mobile Devices Product Launch Start-ups Mobile Communications Pricing See 34+     See less Education Worcester Polytechnic Institute Bachelor of Science (BS),  Engineering/Industrial Management , High Honors Worcester Polytechnic Institute Bachelor of Science (BS),  Engineering/Industrial Management , High Honors Worcester Polytechnic Institute Bachelor of Science (BS),  Engineering/Industrial Management , High Honors Worcester Polytechnic Institute Bachelor of Science (BS),  Engineering/Industrial Management , High Honors ", "Skills Cloud Computing Storage High Performance... Business Development Enterprise Software Virtualization Cluster VMware Storage Solutions Storage Area Networks Solution Selling SAN Testing NAS Data Center Product Marketing Go-to-market Strategy Channel Partners Sales Enablement Storage Virtualization Partner Management Business Alliances Enterprise Storage VDI SaaS Professional Services Product Management Management Salesforce.com Pre-sales Servers Consulting Strategic Partnerships Cross-functional Team... Integration Program Management Linux Direct Sales Strategy See 24+     See less Skills  Cloud Computing Storage High Performance... Business Development Enterprise Software Virtualization Cluster VMware Storage Solutions Storage Area Networks Solution Selling SAN Testing NAS Data Center Product Marketing Go-to-market Strategy Channel Partners Sales Enablement Storage Virtualization Partner Management Business Alliances Enterprise Storage VDI SaaS Professional Services Product Management Management Salesforce.com Pre-sales Servers Consulting Strategic Partnerships Cross-functional Team... Integration Program Management Linux Direct Sales Strategy See 24+     See less Cloud Computing Storage High Performance... Business Development Enterprise Software Virtualization Cluster VMware Storage Solutions Storage Area Networks Solution Selling SAN Testing NAS Data Center Product Marketing Go-to-market Strategy Channel Partners Sales Enablement Storage Virtualization Partner Management Business Alliances Enterprise Storage VDI SaaS Professional Services Product Management Management Salesforce.com Pre-sales Servers Consulting Strategic Partnerships Cross-functional Team... Integration Program Management Linux Direct Sales Strategy See 24+     See less Cloud Computing Storage High Performance... Business Development Enterprise Software Virtualization Cluster VMware Storage Solutions Storage Area Networks Solution Selling SAN Testing NAS Data Center Product Marketing Go-to-market Strategy Channel Partners Sales Enablement Storage Virtualization Partner Management Business Alliances Enterprise Storage VDI SaaS Professional Services Product Management Management Salesforce.com Pre-sales Servers Consulting Strategic Partnerships Cross-functional Team... Integration Program Management Linux Direct Sales Strategy See 24+     See less ", "Summary John Kalvin is a marketing and sales leader with 17 years of experience delivering exceptional results at one of the world’s most successful and admired companies. John has expertise in the areas of Consumer Marketing, Shopper Marketing, Sales Management, Strategy Development and Channel Management. \n \nJohn has a passion for business, marketing and technology innovation and a track record of successful influence at the CEO level. In his most recent high profile program, John brought these passions together to develop The Intel Experience at Best Buy (http://www.bestbuy.com/theintelexperience). The ‘first of its kind’ program brings the excitement and impact of experiential marketing into the store! It not only delivers high impact brand impressions at the point of purchase, it is on the leading edge of the retail store transformation. \n \nIn his current position, John is responsible for all aspects of Shopper Marketing across North America, spanning all major technology retailers, including Best Buy, Amazon.com, Staples, Costco, Walmart and many others. The portfolio of Shopper Marketing at Intel ranges from TV and digital marketing to create awareness and demand to online and in store tools to influence shoppers. In this role, John has transformed the role of North America Shopper Marketing at Intel to deliver exceptional business results. \n \nJohn’s greatest strength lies in his management and leadership approach. With over a decade of management experience, John has deep expertise in building and developing high output teams. He attracts top talent, continually raises the bar on performance expectations, executes with uncompromising ethics, builds collaborative relationships across organizations, communicates with clarity and consistently delivers results beyond expectations.  \n Summary John Kalvin is a marketing and sales leader with 17 years of experience delivering exceptional results at one of the world’s most successful and admired companies. John has expertise in the areas of Consumer Marketing, Shopper Marketing, Sales Management, Strategy Development and Channel Management. \n \nJohn has a passion for business, marketing and technology innovation and a track record of successful influence at the CEO level. In his most recent high profile program, John brought these passions together to develop The Intel Experience at Best Buy (http://www.bestbuy.com/theintelexperience). The ‘first of its kind’ program brings the excitement and impact of experiential marketing into the store! It not only delivers high impact brand impressions at the point of purchase, it is on the leading edge of the retail store transformation. \n \nIn his current position, John is responsible for all aspects of Shopper Marketing across North America, spanning all major technology retailers, including Best Buy, Amazon.com, Staples, Costco, Walmart and many others. The portfolio of Shopper Marketing at Intel ranges from TV and digital marketing to create awareness and demand to online and in store tools to influence shoppers. In this role, John has transformed the role of North America Shopper Marketing at Intel to deliver exceptional business results. \n \nJohn’s greatest strength lies in his management and leadership approach. With over a decade of management experience, John has deep expertise in building and developing high output teams. He attracts top talent, continually raises the bar on performance expectations, executes with uncompromising ethics, builds collaborative relationships across organizations, communicates with clarity and consistently delivers results beyond expectations.  \n John Kalvin is a marketing and sales leader with 17 years of experience delivering exceptional results at one of the world’s most successful and admired companies. John has expertise in the areas of Consumer Marketing, Shopper Marketing, Sales Management, Strategy Development and Channel Management. \n \nJohn has a passion for business, marketing and technology innovation and a track record of successful influence at the CEO level. In his most recent high profile program, John brought these passions together to develop The Intel Experience at Best Buy (http://www.bestbuy.com/theintelexperience). The ‘first of its kind’ program brings the excitement and impact of experiential marketing into the store! It not only delivers high impact brand impressions at the point of purchase, it is on the leading edge of the retail store transformation. \n \nIn his current position, John is responsible for all aspects of Shopper Marketing across North America, spanning all major technology retailers, including Best Buy, Amazon.com, Staples, Costco, Walmart and many others. The portfolio of Shopper Marketing at Intel ranges from TV and digital marketing to create awareness and demand to online and in store tools to influence shoppers. In this role, John has transformed the role of North America Shopper Marketing at Intel to deliver exceptional business results. \n \nJohn’s greatest strength lies in his management and leadership approach. With over a decade of management experience, John has deep expertise in building and developing high output teams. He attracts top talent, continually raises the bar on performance expectations, executes with uncompromising ethics, builds collaborative relationships across organizations, communicates with clarity and consistently delivers results beyond expectations.  \n John Kalvin is a marketing and sales leader with 17 years of experience delivering exceptional results at one of the world’s most successful and admired companies. John has expertise in the areas of Consumer Marketing, Shopper Marketing, Sales Management, Strategy Development and Channel Management. \n \nJohn has a passion for business, marketing and technology innovation and a track record of successful influence at the CEO level. In his most recent high profile program, John brought these passions together to develop The Intel Experience at Best Buy (http://www.bestbuy.com/theintelexperience). The ‘first of its kind’ program brings the excitement and impact of experiential marketing into the store! It not only delivers high impact brand impressions at the point of purchase, it is on the leading edge of the retail store transformation. \n \nIn his current position, John is responsible for all aspects of Shopper Marketing across North America, spanning all major technology retailers, including Best Buy, Amazon.com, Staples, Costco, Walmart and many others. The portfolio of Shopper Marketing at Intel ranges from TV and digital marketing to create awareness and demand to online and in store tools to influence shoppers. In this role, John has transformed the role of North America Shopper Marketing at Intel to deliver exceptional business results. \n \nJohn’s greatest strength lies in his management and leadership approach. With over a decade of management experience, John has deep expertise in building and developing high output teams. He attracts top talent, continually raises the bar on performance expectations, executes with uncompromising ethics, builds collaborative relationships across organizations, communicates with clarity and consistently delivers results beyond expectations.  \n Experience Director North America Shopper Marketing Intel Corporation May 2013  – Present (2 years 4 months) Schaumburg, IL Responsible for all aspects of Shopper Marketing across North America, spanning all major technology retailers, including Best Buy, Amazon.com, Staples, Costco, Walmart and many others. The portfolio of Shopper Marketing at Intel ranges from TV and digital marketing to create awareness and demand to online and in store tools to influence shoppers.  Director Sales & Marketing Rotation Program Intel Corporation May 2012  –  October 2014  (2 years 6 months) Schaumburg, IL Developing the future sales & marketing talent for Intel America's, Inc. District Sales Manager Intel Corporation January 2010  –  April 2013  (3 years 4 months) Schaumburg, il Sales Manager for the North Central US responsible for managing a team of sales, marketing and technical resources to achieve revenue and design win objectives with embedded and computing OEM accounts. Acting District Sales Manager, Enterprise Solution Sales Intel Corporation June 2011  –  August 2011  (3 months) Schaumburg, IL Acting District Sales Manager for Intel's Enterprise Solution Sales Team responsible for Intel sales into Government, Education and Medical Accounts in the Midwest US. District Sales Manager Intel Corporation September 2005  –  December 2009  (4 years 4 months) Schaumburg, IL Sales Manager for the North Central US and Eastern Canada responsible for managing a team of sales, marketing and technical resources to achieve revenue and design win objectives with computing OEM accounts. Acting Director, North America Channel Marketing and Distribution Intel Corporation July 2009  –  August 2009  (2 months) Hillsboro, OR Temporary coverage assignment responsible for leading a large organization consisting of sales, marketing and operations resources to grow Intel's channel business throughout North America. Field Sales Engineer Intel Corporation March 2003  –  September 2005  (2 years 7 months) Houston, TX Managed Intel's busines with Hewlett Packards Industry Standard Server Business Unit. Field Sales Engineer Intel Corporation August 1999  –  March 2003  (3 years 8 months) Denver, CO Managed Intel's business with Hewlett Packard's High-End Server and Workstation Business Units. Technical Sales Engineer Intel Corporation July 1998  –  August 1999  (1 year 2 months) California Completed three rotation assignments in consumer, mobile and flash product marketing. Director North America Shopper Marketing Intel Corporation May 2013  – Present (2 years 4 months) Schaumburg, IL Responsible for all aspects of Shopper Marketing across North America, spanning all major technology retailers, including Best Buy, Amazon.com, Staples, Costco, Walmart and many others. The portfolio of Shopper Marketing at Intel ranges from TV and digital marketing to create awareness and demand to online and in store tools to influence shoppers.  Director North America Shopper Marketing Intel Corporation May 2013  – Present (2 years 4 months) Schaumburg, IL Responsible for all aspects of Shopper Marketing across North America, spanning all major technology retailers, including Best Buy, Amazon.com, Staples, Costco, Walmart and many others. The portfolio of Shopper Marketing at Intel ranges from TV and digital marketing to create awareness and demand to online and in store tools to influence shoppers.  Director Sales & Marketing Rotation Program Intel Corporation May 2012  –  October 2014  (2 years 6 months) Schaumburg, IL Developing the future sales & marketing talent for Intel America's, Inc. Director Sales & Marketing Rotation Program Intel Corporation May 2012  –  October 2014  (2 years 6 months) Schaumburg, IL Developing the future sales & marketing talent for Intel America's, Inc. District Sales Manager Intel Corporation January 2010  –  April 2013  (3 years 4 months) Schaumburg, il Sales Manager for the North Central US responsible for managing a team of sales, marketing and technical resources to achieve revenue and design win objectives with embedded and computing OEM accounts. District Sales Manager Intel Corporation January 2010  –  April 2013  (3 years 4 months) Schaumburg, il Sales Manager for the North Central US responsible for managing a team of sales, marketing and technical resources to achieve revenue and design win objectives with embedded and computing OEM accounts. Acting District Sales Manager, Enterprise Solution Sales Intel Corporation June 2011  –  August 2011  (3 months) Schaumburg, IL Acting District Sales Manager for Intel's Enterprise Solution Sales Team responsible for Intel sales into Government, Education and Medical Accounts in the Midwest US. Acting District Sales Manager, Enterprise Solution Sales Intel Corporation June 2011  –  August 2011  (3 months) Schaumburg, IL Acting District Sales Manager for Intel's Enterprise Solution Sales Team responsible for Intel sales into Government, Education and Medical Accounts in the Midwest US. District Sales Manager Intel Corporation September 2005  –  December 2009  (4 years 4 months) Schaumburg, IL Sales Manager for the North Central US and Eastern Canada responsible for managing a team of sales, marketing and technical resources to achieve revenue and design win objectives with computing OEM accounts. District Sales Manager Intel Corporation September 2005  –  December 2009  (4 years 4 months) Schaumburg, IL Sales Manager for the North Central US and Eastern Canada responsible for managing a team of sales, marketing and technical resources to achieve revenue and design win objectives with computing OEM accounts. Acting Director, North America Channel Marketing and Distribution Intel Corporation July 2009  –  August 2009  (2 months) Hillsboro, OR Temporary coverage assignment responsible for leading a large organization consisting of sales, marketing and operations resources to grow Intel's channel business throughout North America. Acting Director, North America Channel Marketing and Distribution Intel Corporation July 2009  –  August 2009  (2 months) Hillsboro, OR Temporary coverage assignment responsible for leading a large organization consisting of sales, marketing and operations resources to grow Intel's channel business throughout North America. Field Sales Engineer Intel Corporation March 2003  –  September 2005  (2 years 7 months) Houston, TX Managed Intel's busines with Hewlett Packards Industry Standard Server Business Unit. Field Sales Engineer Intel Corporation March 2003  –  September 2005  (2 years 7 months) Houston, TX Managed Intel's busines with Hewlett Packards Industry Standard Server Business Unit. Field Sales Engineer Intel Corporation August 1999  –  March 2003  (3 years 8 months) Denver, CO Managed Intel's business with Hewlett Packard's High-End Server and Workstation Business Units. Field Sales Engineer Intel Corporation August 1999  –  March 2003  (3 years 8 months) Denver, CO Managed Intel's business with Hewlett Packard's High-End Server and Workstation Business Units. Technical Sales Engineer Intel Corporation July 1998  –  August 1999  (1 year 2 months) California Completed three rotation assignments in consumer, mobile and flash product marketing. Technical Sales Engineer Intel Corporation July 1998  –  August 1999  (1 year 2 months) California Completed three rotation assignments in consumer, mobile and flash product marketing. Skills Channel Sales Operations Multi-channel Marketing Territory Management Semiconductors Business Strategy Intel Product Management Product Marketing Strategic Partnerships Go-to-market Strategy Key Account Management Embedded Systems Sales Management Leadership Management Sales Force Development Sales Cross-functional Team... Channel Partners Competitive Analysis See 6+     See less Skills  Channel Sales Operations Multi-channel Marketing Territory Management Semiconductors Business Strategy Intel Product Management Product Marketing Strategic Partnerships Go-to-market Strategy Key Account Management Embedded Systems Sales Management Leadership Management Sales Force Development Sales Cross-functional Team... Channel Partners Competitive Analysis See 6+     See less Channel Sales Operations Multi-channel Marketing Territory Management Semiconductors Business Strategy Intel Product Management Product Marketing Strategic Partnerships Go-to-market Strategy Key Account Management Embedded Systems Sales Management Leadership Management Sales Force Development Sales Cross-functional Team... Channel Partners Competitive Analysis See 6+     See less Channel Sales Operations Multi-channel Marketing Territory Management Semiconductors Business Strategy Intel Product Management Product Marketing Strategic Partnerships Go-to-market Strategy Key Account Management Embedded Systems Sales Management Leadership Management Sales Force Development Sales Cross-functional Team... Channel Partners Competitive Analysis See 6+     See less Education University of Colorado Denver MBA,  Business 2000  – 2002 University of Illinois at Urbana-Champaign BS,  Electrical Engineering 1996  – 1998 University of Colorado Denver MBA,  Business 2000  – 2002 University of Colorado Denver MBA,  Business 2000  – 2002 University of Colorado Denver MBA,  Business 2000  – 2002 University of Illinois at Urbana-Champaign BS,  Electrical Engineering 1996  – 1998 University of Illinois at Urbana-Champaign BS,  Electrical Engineering 1996  – 1998 University of Illinois at Urbana-Champaign BS,  Electrical Engineering 1996  – 1998 ", "Skills Intel Semiconductors Technical Marketing ASIC IC Semiconductor Industry Hardware Architecture Oracle Enterprise... SoC Strategic Partnerships Processors Embedded Systems Product Management Electronics Go-to-market Strategy Analog System Architecture EDA Storage Cross-functional Team... Wireless Product Marketing FPGA See 8+     See less Skills  Intel Semiconductors Technical Marketing ASIC IC Semiconductor Industry Hardware Architecture Oracle Enterprise... SoC Strategic Partnerships Processors Embedded Systems Product Management Electronics Go-to-market Strategy Analog System Architecture EDA Storage Cross-functional Team... Wireless Product Marketing FPGA See 8+     See less Intel Semiconductors Technical Marketing ASIC IC Semiconductor Industry Hardware Architecture Oracle Enterprise... SoC Strategic Partnerships Processors Embedded Systems Product Management Electronics Go-to-market Strategy Analog System Architecture EDA Storage Cross-functional Team... Wireless Product Marketing FPGA See 8+     See less Intel Semiconductors Technical Marketing ASIC IC Semiconductor Industry Hardware Architecture Oracle Enterprise... SoC Strategic Partnerships Processors Embedded Systems Product Management Electronics Go-to-market Strategy Analog System Architecture EDA Storage Cross-functional Team... Wireless Product Marketing FPGA See 8+     See less ", "Summary • Building teams which consistently exceed goals and deliver high growth even in challenging markets. \n \n• Business unit management responsibility for revenue, P&L, staffing and organizational development in startup and established companies. Summary • Building teams which consistently exceed goals and deliver high growth even in challenging markets. \n \n• Business unit management responsibility for revenue, P&L, staffing and organizational development in startup and established companies. • Building teams which consistently exceed goals and deliver high growth even in challenging markets. \n \n• Business unit management responsibility for revenue, P&L, staffing and organizational development in startup and established companies. • Building teams which consistently exceed goals and deliver high growth even in challenging markets. \n \n• Business unit management responsibility for revenue, P&L, staffing and organizational development in startup and established companies. Experience Founder RePower Partners 2008  – Present (7 years) Vice President, Sales & Marketing Avidyne Corporation July 1997  –  September 2007  (10 years 3 months) Vice President, Sales Torrent Systems 1997  –  1997  (less than a year) Vice President, Internet Solutions Object Design, Inc. 1996  –  1997  (1 year) Vice President, Europe Object Design, Inc. 1994  –  1996  (2 years) Director, International Operations Object Design, Inc. April 1992  –  December 1993  (1 year 9 months) Director, Eastern Region Object Design, Inc. July 1990  –  March 1992  (1 year 9 months) Eastern Region Manager EDA Systems April 1989  –  June 1990  (1 year 3 months) Major Accounts District Manager Intel Corporation 1979  –  1989  (10 years) Senior Field Sales Engineer Intel Corporation August 1984  –  March 1986  (1 year 8 months) Field Sales Engineer Intel Corporation January 1981  –  August 1984  (3 years 8 months) Technical Sales Engineer Intel Corporation July 1979  –  December 1980  (1 year 6 months) Founder RePower Partners 2008  – Present (7 years) Founder RePower Partners 2008  – Present (7 years) Vice President, Sales & Marketing Avidyne Corporation July 1997  –  September 2007  (10 years 3 months) Vice President, Sales & Marketing Avidyne Corporation July 1997  –  September 2007  (10 years 3 months) Vice President, Sales Torrent Systems 1997  –  1997  (less than a year) Vice President, Sales Torrent Systems 1997  –  1997  (less than a year) Vice President, Internet Solutions Object Design, Inc. 1996  –  1997  (1 year) Vice President, Internet Solutions Object Design, Inc. 1996  –  1997  (1 year) Vice President, Europe Object Design, Inc. 1994  –  1996  (2 years) Vice President, Europe Object Design, Inc. 1994  –  1996  (2 years) Director, International Operations Object Design, Inc. April 1992  –  December 1993  (1 year 9 months) Director, International Operations Object Design, Inc. April 1992  –  December 1993  (1 year 9 months) Director, Eastern Region Object Design, Inc. July 1990  –  March 1992  (1 year 9 months) Director, Eastern Region Object Design, Inc. July 1990  –  March 1992  (1 year 9 months) Eastern Region Manager EDA Systems April 1989  –  June 1990  (1 year 3 months) Eastern Region Manager EDA Systems April 1989  –  June 1990  (1 year 3 months) Major Accounts District Manager Intel Corporation 1979  –  1989  (10 years) Major Accounts District Manager Intel Corporation 1979  –  1989  (10 years) Senior Field Sales Engineer Intel Corporation August 1984  –  March 1986  (1 year 8 months) Senior Field Sales Engineer Intel Corporation August 1984  –  March 1986  (1 year 8 months) Field Sales Engineer Intel Corporation January 1981  –  August 1984  (3 years 8 months) Field Sales Engineer Intel Corporation January 1981  –  August 1984  (3 years 8 months) Technical Sales Engineer Intel Corporation July 1979  –  December 1980  (1 year 6 months) Technical Sales Engineer Intel Corporation July 1979  –  December 1980  (1 year 6 months) Skills Start-ups Entrepreneurship Solar Energy Renewable Energy Energy Efficiency Business Development Strategic Partnerships Product Marketing Strategy Business Strategy Venture Capital Strategic Planning Go-to-market Strategy Contract Negotiation Mergers & Acquisitions Aerospace Sales Management Marketing Cross-functional Team... Team Building Cleantech Corporate Development Electronics Climate Change... Climate Action Planning Climate Change Sustainability Sustainable Energy Energy Electric Vehicles See 15+     See less Skills  Start-ups Entrepreneurship Solar Energy Renewable Energy Energy Efficiency Business Development Strategic Partnerships Product Marketing Strategy Business Strategy Venture Capital Strategic Planning Go-to-market Strategy Contract Negotiation Mergers & Acquisitions Aerospace Sales Management Marketing Cross-functional Team... Team Building Cleantech Corporate Development Electronics Climate Change... Climate Action Planning Climate Change Sustainability Sustainable Energy Energy Electric Vehicles See 15+     See less Start-ups Entrepreneurship Solar Energy Renewable Energy Energy Efficiency Business Development Strategic Partnerships Product Marketing Strategy Business Strategy Venture Capital Strategic Planning Go-to-market Strategy Contract Negotiation Mergers & Acquisitions Aerospace Sales Management Marketing Cross-functional Team... Team Building Cleantech Corporate Development Electronics Climate Change... Climate Action Planning Climate Change Sustainability Sustainable Energy Energy Electric Vehicles See 15+     See less Start-ups Entrepreneurship Solar Energy Renewable Energy Energy Efficiency Business Development Strategic Partnerships Product Marketing Strategy Business Strategy Venture Capital Strategic Planning Go-to-market Strategy Contract Negotiation Mergers & Acquisitions Aerospace Sales Management Marketing Cross-functional Team... Team Building Cleantech Corporate Development Electronics Climate Change... Climate Action Planning Climate Change Sustainability Sustainable Energy Energy Electric Vehicles See 15+     See less Education Cornell University BSEE September 1975  – May 1979 Wilton High School 1971  – 1975 Cornell University BSEE September 1975  – May 1979 Cornell University BSEE September 1975  – May 1979 Cornell University BSEE September 1975  – May 1979 Wilton High School 1971  – 1975 Wilton High School 1971  – 1975 Wilton High School 1971  – 1975 ", "Skills Strategic Partnerships Embedded Systems Management Mobile Devices Storage Business Strategy Product Management HP Cross-functional Team... Product Marketing Team Leadership SoC Semiconductors Wireless Go-to-market Strategy Servers Strategic Planning Cloud Computing ASIC Product Development Program Management Business Alliances Analog New Business Development Marketing IC Semiconductor Industry Key Account Management Intel Strategy CRM Competitive Analysis Business Development Start-ups Account Management Telecommunications Marketing Strategy Data Center Processors WiFi Channel Partners SaaS See 27+     See less Skills  Strategic Partnerships Embedded Systems Management Mobile Devices Storage Business Strategy Product Management HP Cross-functional Team... Product Marketing Team Leadership SoC Semiconductors Wireless Go-to-market Strategy Servers Strategic Planning Cloud Computing ASIC Product Development Program Management Business Alliances Analog New Business Development Marketing IC Semiconductor Industry Key Account Management Intel Strategy CRM Competitive Analysis Business Development Start-ups Account Management Telecommunications Marketing Strategy Data Center Processors WiFi Channel Partners SaaS See 27+     See less Strategic Partnerships Embedded Systems Management Mobile Devices Storage Business Strategy Product Management HP Cross-functional Team... Product Marketing Team Leadership SoC Semiconductors Wireless Go-to-market Strategy Servers Strategic Planning Cloud Computing ASIC Product Development Program Management Business Alliances Analog New Business Development Marketing IC Semiconductor Industry Key Account Management Intel Strategy CRM Competitive Analysis Business Development Start-ups Account Management Telecommunications Marketing Strategy Data Center Processors WiFi Channel Partners SaaS See 27+     See less Strategic Partnerships Embedded Systems Management Mobile Devices Storage Business Strategy Product Management HP Cross-functional Team... Product Marketing Team Leadership SoC Semiconductors Wireless Go-to-market Strategy Servers Strategic Planning Cloud Computing ASIC Product Development Program Management Business Alliances Analog New Business Development Marketing IC Semiconductor Industry Key Account Management Intel Strategy CRM Competitive Analysis Business Development Start-ups Account Management Telecommunications Marketing Strategy Data Center Processors WiFi Channel Partners SaaS See 27+     See less ", "Experience Director, Technical Computing Ecosystem Enabling Intel Corporation August 2013  – Present (2 years 1 month) Portland, Oregon Area Director, Data Center Marketing Operations Intel Corporation January 2010  –  August 2013  (3 years 8 months) Portland, Oregon Area Performance and Competitive Marketing Manager, Data Center Group Intel Corp, Server Platform Group January 2006  –  January 2010  (4 years 1 month) Competitive Marketing Manager Intel Corporation January 2005  –  December 2005  (1 year) Portland, Oregon Area Product Marketing Engineer, Competitive Marketing, Server Product Division Intel Corporation January 2004  –  December 2004  (1 year) Portland, Oregon Area Technical Sales Manager Intel Corporation July 2002  –  December 2003  (1 year 6 months) Portland, Oregon Area Datacenter Product Line Manager Intel Corporation July 2001  –  July 2002  (1 year 1 month) Portland, Oregon Area InfiniBand Product Marketing Engineer Intel Corporation January 2000  –  July 2001  (1 year 7 months) Portland, Oregon Area InfiniBand Field Sales Engineer Intel Corporation May 1995  –  December 1999  (4 years 8 months) Portland, Oregon Area Field Sales Engineer Intel Corporation January 1992  –  May 1995  (3 years 5 months) Orange County, California Area Technical Sales Engineer Intel Corporation June 1990  –  December 1991  (1 year 7 months) Portland, Oregon Area Director, Technical Computing Ecosystem Enabling Intel Corporation August 2013  – Present (2 years 1 month) Portland, Oregon Area Director, Technical Computing Ecosystem Enabling Intel Corporation August 2013  – Present (2 years 1 month) Portland, Oregon Area Director, Data Center Marketing Operations Intel Corporation January 2010  –  August 2013  (3 years 8 months) Portland, Oregon Area Director, Data Center Marketing Operations Intel Corporation January 2010  –  August 2013  (3 years 8 months) Portland, Oregon Area Performance and Competitive Marketing Manager, Data Center Group Intel Corp, Server Platform Group January 2006  –  January 2010  (4 years 1 month) Performance and Competitive Marketing Manager, Data Center Group Intel Corp, Server Platform Group January 2006  –  January 2010  (4 years 1 month) Competitive Marketing Manager Intel Corporation January 2005  –  December 2005  (1 year) Portland, Oregon Area Competitive Marketing Manager Intel Corporation January 2005  –  December 2005  (1 year) Portland, Oregon Area Product Marketing Engineer, Competitive Marketing, Server Product Division Intel Corporation January 2004  –  December 2004  (1 year) Portland, Oregon Area Product Marketing Engineer, Competitive Marketing, Server Product Division Intel Corporation January 2004  –  December 2004  (1 year) Portland, Oregon Area Technical Sales Manager Intel Corporation July 2002  –  December 2003  (1 year 6 months) Portland, Oregon Area Datacenter Technical Sales Manager Intel Corporation July 2002  –  December 2003  (1 year 6 months) Portland, Oregon Area Datacenter Product Line Manager Intel Corporation July 2001  –  July 2002  (1 year 1 month) Portland, Oregon Area InfiniBand Product Line Manager Intel Corporation July 2001  –  July 2002  (1 year 1 month) Portland, Oregon Area InfiniBand Product Marketing Engineer Intel Corporation January 2000  –  July 2001  (1 year 7 months) Portland, Oregon Area InfiniBand Product Marketing Engineer Intel Corporation January 2000  –  July 2001  (1 year 7 months) Portland, Oregon Area InfiniBand Field Sales Engineer Intel Corporation May 1995  –  December 1999  (4 years 8 months) Portland, Oregon Area Field Sales Engineer Intel Corporation May 1995  –  December 1999  (4 years 8 months) Portland, Oregon Area Field Sales Engineer Intel Corporation January 1992  –  May 1995  (3 years 5 months) Orange County, California Area Field Sales Engineer Intel Corporation January 1992  –  May 1995  (3 years 5 months) Orange County, California Area Technical Sales Engineer Intel Corporation June 1990  –  December 1991  (1 year 7 months) Portland, Oregon Area Technical Sales Engineer Intel Corporation June 1990  –  December 1991  (1 year 7 months) Portland, Oregon Area Education University of Delaware BEE,  Engineering 1986  – 1990 University of Delaware BEE,  Engineering 1986  – 1990 University of Delaware BEE,  Engineering 1986  – 1990 University of Delaware BEE,  Engineering 1986  – 1990 ", "Summary Accomplished, highly motivated, professional Sales Engineer consistently recognized for achievement, performance and strong results. Innovative and successful in working throughout a region to identify new customers, develop strong relationships and yield productive, growing business. Proven leader among peers that capably puts together flexible teams to identify all available opportunities within customer and close design wins. Summary Accomplished, highly motivated, professional Sales Engineer consistently recognized for achievement, performance and strong results. Innovative and successful in working throughout a region to identify new customers, develop strong relationships and yield productive, growing business. Proven leader among peers that capably puts together flexible teams to identify all available opportunities within customer and close design wins. Accomplished, highly motivated, professional Sales Engineer consistently recognized for achievement, performance and strong results. Innovative and successful in working throughout a region to identify new customers, develop strong relationships and yield productive, growing business. Proven leader among peers that capably puts together flexible teams to identify all available opportunities within customer and close design wins. Accomplished, highly motivated, professional Sales Engineer consistently recognized for achievement, performance and strong results. Innovative and successful in working throughout a region to identify new customers, develop strong relationships and yield productive, growing business. Proven leader among peers that capably puts together flexible teams to identify all available opportunities within customer and close design wins. Experience Field Sales Engineer Intel Corporation April 2014  – Present (1 year 5 months) Florida To Be Updated: Embedded Processor Sales Engineer Technical Sales Representative/Account Manager TI September 1992  –  April 2014  (21 years 8 months) Maitland, FL 1992 - Hired to TI as a Field Programmable Gate Array Product Sales Engineer responsible for winning FPGA designs throughout Florida  \n1994 - Transitioned to major accounts responsible for Motorola Paging/Land Mobile Radio and other accounts in Florida. \n1996 - Digital Signal Processor Product Sales Engineer for Florida - Also developed 1-day workshops and taught course throughout the Southeast. \n2002 - Technical Sales Engineer/Rep Manager responsible for more than multiple accounts and professional representation firm. Developed strategies and grew accounts consistently. \n2007 - Distribution Business Manager for Florida. Responsible for growing a strong relationship withDistribution throughout Florida along with strategies to grow business. \n2011 - After National Semiconductor acquisition, transitioned to major accounts responsible for Military accounts in north Florida. Electrical Engineer Martin Marietta June 1988  –  September 1992  (4 years 4 months) Orlando, Florida Digital Design engineer at Martin Marietta (Now Lockheed Martin) in Orlando. Field Sales Engineer Intel Corporation April 2014  – Present (1 year 5 months) Florida To Be Updated: Embedded Processor Sales Engineer Field Sales Engineer Intel Corporation April 2014  – Present (1 year 5 months) Florida To Be Updated: Embedded Processor Sales Engineer Technical Sales Representative/Account Manager TI September 1992  –  April 2014  (21 years 8 months) Maitland, FL 1992 - Hired to TI as a Field Programmable Gate Array Product Sales Engineer responsible for winning FPGA designs throughout Florida  \n1994 - Transitioned to major accounts responsible for Motorola Paging/Land Mobile Radio and other accounts in Florida. \n1996 - Digital Signal Processor Product Sales Engineer for Florida - Also developed 1-day workshops and taught course throughout the Southeast. \n2002 - Technical Sales Engineer/Rep Manager responsible for more than multiple accounts and professional representation firm. Developed strategies and grew accounts consistently. \n2007 - Distribution Business Manager for Florida. Responsible for growing a strong relationship withDistribution throughout Florida along with strategies to grow business. \n2011 - After National Semiconductor acquisition, transitioned to major accounts responsible for Military accounts in north Florida. Technical Sales Representative/Account Manager TI September 1992  –  April 2014  (21 years 8 months) Maitland, FL 1992 - Hired to TI as a Field Programmable Gate Array Product Sales Engineer responsible for winning FPGA designs throughout Florida  \n1994 - Transitioned to major accounts responsible for Motorola Paging/Land Mobile Radio and other accounts in Florida. \n1996 - Digital Signal Processor Product Sales Engineer for Florida - Also developed 1-day workshops and taught course throughout the Southeast. \n2002 - Technical Sales Engineer/Rep Manager responsible for more than multiple accounts and professional representation firm. Developed strategies and grew accounts consistently. \n2007 - Distribution Business Manager for Florida. Responsible for growing a strong relationship withDistribution throughout Florida along with strategies to grow business. \n2011 - After National Semiconductor acquisition, transitioned to major accounts responsible for Military accounts in north Florida. Electrical Engineer Martin Marietta June 1988  –  September 1992  (4 years 4 months) Orlando, Florida Digital Design engineer at Martin Marietta (Now Lockheed Martin) in Orlando. Electrical Engineer Martin Marietta June 1988  –  September 1992  (4 years 4 months) Orlando, Florida Digital Design engineer at Martin Marietta (Now Lockheed Martin) in Orlando. Skills Semiconductors Technical Product Sales Systems Engineering Marketing Strategy Account Management Sales Analog Management Product Marketing Electronics Cross-functional Team... Digital Signal... Product Development Semiconductor Industry IC Embedded Systems See 1+     See less Skills  Semiconductors Technical Product Sales Systems Engineering Marketing Strategy Account Management Sales Analog Management Product Marketing Electronics Cross-functional Team... Digital Signal... Product Development Semiconductor Industry IC Embedded Systems See 1+     See less Semiconductors Technical Product Sales Systems Engineering Marketing Strategy Account Management Sales Analog Management Product Marketing Electronics Cross-functional Team... Digital Signal... Product Development Semiconductor Industry IC Embedded Systems See 1+     See less Semiconductors Technical Product Sales Systems Engineering Marketing Strategy Account Management Sales Analog Management Product Marketing Electronics Cross-functional Team... Digital Signal... Product Development Semiconductor Industry IC Embedded Systems See 1+     See less Education University of Central Florida BS,  Engineering 1985  – 1988 University of Central Florida BS,  Engineering 1985  – 1988 University of Central Florida BS,  Engineering 1985  – 1988 University of Central Florida BS,  Engineering 1985  – 1988 Honors & Awards Additional Honors & Awards TI High 5 Circle and TI Pro-Team award winner. Additional Honors & Awards TI High 5 Circle and TI Pro-Team award winner. Additional Honors & Awards TI High 5 Circle and TI Pro-Team award winner. Additional Honors & Awards TI High 5 Circle and TI Pro-Team award winner. ", "Skills Product Management Semiconductors Intel Embedded Systems Product Marketing Technical Marketing Semiconductor Industry Strategic Partnerships Go-to-market Strategy Business Alliances Program Management Channel Enterprise Software Solution Selling Cross-functional Team... Processors Strategy Competitive Analysis Business Development See 4+     See less Skills  Product Management Semiconductors Intel Embedded Systems Product Marketing Technical Marketing Semiconductor Industry Strategic Partnerships Go-to-market Strategy Business Alliances Program Management Channel Enterprise Software Solution Selling Cross-functional Team... Processors Strategy Competitive Analysis Business Development See 4+     See less Product Management Semiconductors Intel Embedded Systems Product Marketing Technical Marketing Semiconductor Industry Strategic Partnerships Go-to-market Strategy Business Alliances Program Management Channel Enterprise Software Solution Selling Cross-functional Team... Processors Strategy Competitive Analysis Business Development See 4+     See less Product Management Semiconductors Intel Embedded Systems Product Marketing Technical Marketing Semiconductor Industry Strategic Partnerships Go-to-market Strategy Business Alliances Program Management Channel Enterprise Software Solution Selling Cross-functional Team... Processors Strategy Competitive Analysis Business Development See 4+     See less ", "", "Summary - Summary - - - Experience Channel Field Sales Engineer Intel Corporation November 2013  – Present (1 year 10 months) Istanbul, Turkey Digitization Specialist Schneider Electric July 2013  –  October 2013  (4 months) Istanbul, Turkey Business Development Intern Intel Corporation June 2012  –  June 2013  (1 year 1 month) Istanbul, Turkey -Being a member of the team that developed Intel Turkey strategy \n-Conducting market analysis and strategic problem solving \n-Managing budgetary issues of the department \n-Trying to seek and find out new business opportunities for the department Founder Marketkeyfi.com May 2010  –  March 2012  (1 year 11 months) •\tStarted-up the online order receiving platform for grocery stores and supermarkets by starting business relations with supermarkets and planning the marketing activities to promote the webpage \n•\tClosed an investment worth from one of the largest software companies of Turkey. \n•\tManaged team of 3 employees during the execution phase of start-up Intern Printoteks San. Ve Tic. Ltd. Sti. May 2008  –  December 2011  (3 years 8 months) •\tTook responsibilities in both production and finance department of a boutique chemical company which is operating at textile and construction chemicals industry \n•\tPlanned and scheduled production schedule for 1 year \n•\tPrepared sales reports and customer profit and risk analysis for 2 years \n•\tConducted market research to find potential customers for the company and analyzed the developments of large players and presented them to management team. Channel Field Sales Engineer Intel Corporation November 2013  – Present (1 year 10 months) Istanbul, Turkey Channel Field Sales Engineer Intel Corporation November 2013  – Present (1 year 10 months) Istanbul, Turkey Digitization Specialist Schneider Electric July 2013  –  October 2013  (4 months) Istanbul, Turkey Digitization Specialist Schneider Electric July 2013  –  October 2013  (4 months) Istanbul, Turkey Business Development Intern Intel Corporation June 2012  –  June 2013  (1 year 1 month) Istanbul, Turkey -Being a member of the team that developed Intel Turkey strategy \n-Conducting market analysis and strategic problem solving \n-Managing budgetary issues of the department \n-Trying to seek and find out new business opportunities for the department Business Development Intern Intel Corporation June 2012  –  June 2013  (1 year 1 month) Istanbul, Turkey -Being a member of the team that developed Intel Turkey strategy \n-Conducting market analysis and strategic problem solving \n-Managing budgetary issues of the department \n-Trying to seek and find out new business opportunities for the department Founder Marketkeyfi.com May 2010  –  March 2012  (1 year 11 months) •\tStarted-up the online order receiving platform for grocery stores and supermarkets by starting business relations with supermarkets and planning the marketing activities to promote the webpage \n•\tClosed an investment worth from one of the largest software companies of Turkey. \n•\tManaged team of 3 employees during the execution phase of start-up Founder Marketkeyfi.com May 2010  –  March 2012  (1 year 11 months) •\tStarted-up the online order receiving platform for grocery stores and supermarkets by starting business relations with supermarkets and planning the marketing activities to promote the webpage \n•\tClosed an investment worth from one of the largest software companies of Turkey. \n•\tManaged team of 3 employees during the execution phase of start-up Intern Printoteks San. Ve Tic. Ltd. Sti. May 2008  –  December 2011  (3 years 8 months) •\tTook responsibilities in both production and finance department of a boutique chemical company which is operating at textile and construction chemicals industry \n•\tPlanned and scheduled production schedule for 1 year \n•\tPrepared sales reports and customer profit and risk analysis for 2 years \n•\tConducted market research to find potential customers for the company and analyzed the developments of large players and presented them to management team. Intern Printoteks San. Ve Tic. Ltd. Sti. May 2008  –  December 2011  (3 years 8 months) •\tTook responsibilities in both production and finance department of a boutique chemical company which is operating at textile and construction chemicals industry \n•\tPlanned and scheduled production schedule for 1 year \n•\tPrepared sales reports and customer profit and risk analysis for 2 years \n•\tConducted market research to find potential customers for the company and analyzed the developments of large players and presented them to management team. Languages English Turkish English Turkish English Turkish Skills Entrepreneurship Market Research Online Marketing Social Media Competitive Analysis Product Management Product Marketing Business Strategy Market Analysis Marketing Research Marketing Management Business Development Marketing Strategy Strategy Product Development Business Planning Marketing Management See 3+     See less Skills  Entrepreneurship Market Research Online Marketing Social Media Competitive Analysis Product Management Product Marketing Business Strategy Market Analysis Marketing Research Marketing Management Business Development Marketing Strategy Strategy Product Development Business Planning Marketing Management See 3+     See less Entrepreneurship Market Research Online Marketing Social Media Competitive Analysis Product Management Product Marketing Business Strategy Market Analysis Marketing Research Marketing Management Business Development Marketing Strategy Strategy Product Development Business Planning Marketing Management See 3+     See less Entrepreneurship Market Research Online Marketing Social Media Competitive Analysis Product Management Product Marketing Business Strategy Market Analysis Marketing Research Marketing Management Business Development Marketing Strategy Strategy Product Development Business Planning Marketing Management See 3+     See less Education Bogazici University MBA,  Business Administration and Management , General 2011  – 2013 Bogazici University Undergraduate,  Chemical Engineering 2006  – 2011 Kadikoy Anadolu Lisesi Bogazici University MBA,  Business Administration and Management , General 2011  – 2013 Bogazici University MBA,  Business Administration and Management , General 2011  – 2013 Bogazici University MBA,  Business Administration and Management , General 2011  – 2013 Bogazici University Undergraduate,  Chemical Engineering 2006  – 2011 Bogazici University Undergraduate,  Chemical Engineering 2006  – 2011 Bogazici University Undergraduate,  Chemical Engineering 2006  – 2011 Kadikoy Anadolu Lisesi Kadikoy Anadolu Lisesi Kadikoy Anadolu Lisesi Honors & Awards Success scholarship Bogazici University September 2006 Honours Degree University June 2011 Success scholarship Bogazici University September 2006 Success scholarship Bogazici University September 2006 Success scholarship Bogazici University September 2006 Honours Degree University June 2011 Honours Degree University June 2011 Honours Degree University June 2011 ", "Experience Field Sales Engineer Intel Corporation May 2014  – Present (1 year 4 months) Dallas/Fort Worth Area Account Manager BP Sales August 2011  –  May 2014  (2 years 10 months) Richardson, TX New Business Development Triune Systems April 2011  –  August 2011  (5 months) Senior Technical Marketing Engineer Renesas Electronics America, Inc. April 2010  –  March 2011  (1 year) Senior Technical Marketing Engineer NEC Electronics September 2003  –  April 2010  (6 years 8 months) Field Sales Engineer Intel Corporation May 2014  – Present (1 year 4 months) Dallas/Fort Worth Area Field Sales Engineer Intel Corporation May 2014  – Present (1 year 4 months) Dallas/Fort Worth Area Account Manager BP Sales August 2011  –  May 2014  (2 years 10 months) Richardson, TX Account Manager BP Sales August 2011  –  May 2014  (2 years 10 months) Richardson, TX New Business Development Triune Systems April 2011  –  August 2011  (5 months) New Business Development Triune Systems April 2011  –  August 2011  (5 months) Senior Technical Marketing Engineer Renesas Electronics America, Inc. April 2010  –  March 2011  (1 year) Senior Technical Marketing Engineer Renesas Electronics America, Inc. April 2010  –  March 2011  (1 year) Senior Technical Marketing Engineer NEC Electronics September 2003  –  April 2010  (6 years 8 months) Senior Technical Marketing Engineer NEC Electronics September 2003  –  April 2010  (6 years 8 months) Skills Microcontrollers Semiconductor Industry Semiconductors Technical Marketing IC Embedded Software Key Account Management Electronics EDA Sales Strategic Partnerships Account Management Analog Product Marketing Business Development ASIC Mixed Signal Contract Negotiation Sales Engineering Marketing FPGA Marketing Strategy See 7+     See less Skills  Microcontrollers Semiconductor Industry Semiconductors Technical Marketing IC Embedded Software Key Account Management Electronics EDA Sales Strategic Partnerships Account Management Analog Product Marketing Business Development ASIC Mixed Signal Contract Negotiation Sales Engineering Marketing FPGA Marketing Strategy See 7+     See less Microcontrollers Semiconductor Industry Semiconductors Technical Marketing IC Embedded Software Key Account Management Electronics EDA Sales Strategic Partnerships Account Management Analog Product Marketing Business Development ASIC Mixed Signal Contract Negotiation Sales Engineering Marketing FPGA Marketing Strategy See 7+     See less Microcontrollers Semiconductor Industry Semiconductors Technical Marketing IC Embedded Software Key Account Management Electronics EDA Sales Strategic Partnerships Account Management Analog Product Marketing Business Development ASIC Mixed Signal Contract Negotiation Sales Engineering Marketing FPGA Marketing Strategy See 7+     See less Education The University of Texas at Dallas Bachelor of Science (BS),  Electrical Engineering 1999  – 2003 The University of Texas at Dallas Bachelor of Science (BS),  Electrical Engineering 1999  – 2003 The University of Texas at Dallas Bachelor of Science (BS),  Electrical Engineering 1999  – 2003 The University of Texas at Dallas Bachelor of Science (BS),  Electrical Engineering 1999  – 2003 ", "Experience Field Sales Engineer Intel Corporation December 2014  – Present (9 months) Account Manager Avago Technologies May 2014  –  December 2014  (8 months) Account Manager LSI Corporation 2006  –  2014  (8 years) Technical Sales Engineer Freescale Semiconductor 2002  –  2006  (4 years) Field Application Engineer Transwitch 2000  –  2002  (2 years) Field Application Engineer / Account Manager Infineon Technologies 1997  –  2000  (3 years) Field Sales Engineer Intel Corporation December 2014  – Present (9 months) Field Sales Engineer Intel Corporation December 2014  – Present (9 months) Account Manager Avago Technologies May 2014  –  December 2014  (8 months) Account Manager Avago Technologies May 2014  –  December 2014  (8 months) Account Manager LSI Corporation 2006  –  2014  (8 years) Account Manager LSI Corporation 2006  –  2014  (8 years) Technical Sales Engineer Freescale Semiconductor 2002  –  2006  (4 years) Technical Sales Engineer Freescale Semiconductor 2002  –  2006  (4 years) Field Application Engineer Transwitch 2000  –  2002  (2 years) Field Application Engineer Transwitch 2000  –  2002  (2 years) Field Application Engineer / Account Manager Infineon Technologies 1997  –  2000  (3 years) Field Application Engineer / Account Manager Infineon Technologies 1997  –  2000  (3 years) Skills Telecommunications Wireless Solution Selling IP Product Management Skills  Telecommunications Wireless Solution Selling IP Product Management Telecommunications Wireless Solution Selling IP Product Management Telecommunications Wireless Solution Selling IP Product Management Education Chalmers University of Technology Master of Science,  Electrical Engineering 1991  – 1997 University of Gothenburg Business/Managerial Economics Chalmers University of Technology Master of Science,  Electrical Engineering 1991  – 1997 Chalmers University of Technology Master of Science,  Electrical Engineering 1991  – 1997 Chalmers University of Technology Master of Science,  Electrical Engineering 1991  – 1997 University of Gothenburg Business/Managerial Economics University of Gothenburg Business/Managerial Economics University of Gothenburg Business/Managerial Economics ", "Skills Vendor Management Semiconductors Intel Embedded Systems Cross-functional Team... Product Management Product Marketing Debugging Cloud Computing Competitive Analysis Product Launch SaaS Project Management Go-to-market Strategy Enterprise Software Program Management Software Development Storage Technical Marketing Business Analysis Product Development New Business Development Wireless Integration Processors See 10+     See less Skills  Vendor Management Semiconductors Intel Embedded Systems Cross-functional Team... Product Management Product Marketing Debugging Cloud Computing Competitive Analysis Product Launch SaaS Project Management Go-to-market Strategy Enterprise Software Program Management Software Development Storage Technical Marketing Business Analysis Product Development New Business Development Wireless Integration Processors See 10+     See less Vendor Management Semiconductors Intel Embedded Systems Cross-functional Team... Product Management Product Marketing Debugging Cloud Computing Competitive Analysis Product Launch SaaS Project Management Go-to-market Strategy Enterprise Software Program Management Software Development Storage Technical Marketing Business Analysis Product Development New Business Development Wireless Integration Processors See 10+     See less Vendor Management Semiconductors Intel Embedded Systems Cross-functional Team... Product Management Product Marketing Debugging Cloud Computing Competitive Analysis Product Launch SaaS Project Management Go-to-market Strategy Enterprise Software Program Management Software Development Storage Technical Marketing Business Analysis Product Development New Business Development Wireless Integration Processors See 10+     See less ", "Experience Senior Field Sales Engineer Intel Corporation May 2014  – Present (1 year 4 months) Northeast Major tier 1 and start-up sales account responsibility for driving Intel hardware and software products into the Northeast territory. Sr. Sales Engineer Impact Technical Sales 2000  –  April 2014  (14 years) Burington MA Manufacturer's sales representative with exclusive sales responsibility in New England representing Intel, IBM, Motorola-OEM, Radisys, Optrex, and others. Account manager for multi-national accounts and large OEMs such as Cisco and Motorola. Responsible for the identification of opportunities, sales strategy, and design win efforts. Selling high end electronic systems, operating system software, enterprise servers, motherboards, CPUs, ASICs, foundry, and displays. Duties include presenting to customers as well as back selling into principals. Won rep of the year for various lines. Director of Sales and Marketing White Electonic Designs 1994  –  2000  (6 years) Responsible for marketing and sales efforts for ruggedized computer systems and display division. Lead a small startup group from < $1M in revenue to > $15M in revenue in 3 years. Developed standard product strategies. Interviewed and hired sales force. Performed major account sales and product management. Electrical Engineer Raytheon 1988  –  1993  (5 years) Worked at various locations in various engineering capacities including ferro-electric memory development, semiconductor and system test. Senior Field Sales Engineer Intel Corporation May 2014  – Present (1 year 4 months) Northeast Major tier 1 and start-up sales account responsibility for driving Intel hardware and software products into the Northeast territory. Senior Field Sales Engineer Intel Corporation May 2014  – Present (1 year 4 months) Northeast Major tier 1 and start-up sales account responsibility for driving Intel hardware and software products into the Northeast territory. Sr. Sales Engineer Impact Technical Sales 2000  –  April 2014  (14 years) Burington MA Manufacturer's sales representative with exclusive sales responsibility in New England representing Intel, IBM, Motorola-OEM, Radisys, Optrex, and others. Account manager for multi-national accounts and large OEMs such as Cisco and Motorola. Responsible for the identification of opportunities, sales strategy, and design win efforts. Selling high end electronic systems, operating system software, enterprise servers, motherboards, CPUs, ASICs, foundry, and displays. Duties include presenting to customers as well as back selling into principals. Won rep of the year for various lines. Sr. Sales Engineer Impact Technical Sales 2000  –  April 2014  (14 years) Burington MA Manufacturer's sales representative with exclusive sales responsibility in New England representing Intel, IBM, Motorola-OEM, Radisys, Optrex, and others. Account manager for multi-national accounts and large OEMs such as Cisco and Motorola. Responsible for the identification of opportunities, sales strategy, and design win efforts. Selling high end electronic systems, operating system software, enterprise servers, motherboards, CPUs, ASICs, foundry, and displays. Duties include presenting to customers as well as back selling into principals. Won rep of the year for various lines. Director of Sales and Marketing White Electonic Designs 1994  –  2000  (6 years) Responsible for marketing and sales efforts for ruggedized computer systems and display division. Lead a small startup group from < $1M in revenue to > $15M in revenue in 3 years. Developed standard product strategies. Interviewed and hired sales force. Performed major account sales and product management. Director of Sales and Marketing White Electonic Designs 1994  –  2000  (6 years) Responsible for marketing and sales efforts for ruggedized computer systems and display division. Lead a small startup group from < $1M in revenue to > $15M in revenue in 3 years. Developed standard product strategies. Interviewed and hired sales force. Performed major account sales and product management. Electrical Engineer Raytheon 1988  –  1993  (5 years) Worked at various locations in various engineering capacities including ferro-electric memory development, semiconductor and system test. Electrical Engineer Raytheon 1988  –  1993  (5 years) Worked at various locations in various engineering capacities including ferro-electric memory development, semiconductor and system test. Skills Sales Marketing Strategy Servers Operating Systems Solution Selling Product Management Oracle Enterprise... Product Marketing Ethernet Semiconductors Hardware Resellers Electronics Wireless Telecommunications Skills  Sales Marketing Strategy Servers Operating Systems Solution Selling Product Management Oracle Enterprise... Product Marketing Ethernet Semiconductors Hardware Resellers Electronics Wireless Telecommunications Sales Marketing Strategy Servers Operating Systems Solution Selling Product Management Oracle Enterprise... Product Marketing Ethernet Semiconductors Hardware Resellers Electronics Wireless Telecommunications Sales Marketing Strategy Servers Operating Systems Solution Selling Product Management Oracle Enterprise... Product Marketing Ethernet Semiconductors Hardware Resellers Electronics Wireless Telecommunications Education Northeastern University BS,  Electrical Engineering 1982  – 1987 Harvard University Extension School Northeastern University BS,  Electrical Engineering 1982  – 1987 Harvard University Extension School Northeastern University BS,  Electrical Engineering 1982  – 1987 Harvard University Extension School Northeastern University BS,  Electrical Engineering 1982  – 1987 Harvard University Extension School ", "Experience Field Sales Engineer Intel Corporation July 2014  – Present (1 year 2 months) Shenzhen, Guangdong, China Dedicate wireless business of Communication Infrastructure Divison in PRC Region. Regional Sales Manager Mindspeed Technologies January 2013  –  July 2014  (1 year 7 months) Shenzhen, Guangdong, China District Sales Manager Mindspeed Technologies January 2012  –  January 2013  (1 year 1 month) Shenzhen, Guangdong, China Account Executive Mindspeed Technologies March 2011  –  December 2011  (10 months) Shenzhen, Guangdong, China Sales Engineer Mindspeed Technologies April 2009  –  March 2011  (2 years) Shenzhen, Guangdong, China Staff Field Application Engineer Mindspeed Technologies April 2005  –  March 2009  (4 years) Shenzhen, Guangdong, China Long time work with tie-1 telecommunication vendor such as Huawei, to prompt and support DSP and Processor solutions. R&D Engineer Shenzhen Greennet Technologies July 2002  –  March 2005  (2 years 9 months) Shenzhen, Guangdong, China Software Development for Lanswitch, Router, VoIP Gateway etc telecommunication equipment, well understanding for network architecture and protocols. Field Sales Engineer Intel Corporation July 2014  – Present (1 year 2 months) Shenzhen, Guangdong, China Dedicate wireless business of Communication Infrastructure Divison in PRC Region. Field Sales Engineer Intel Corporation July 2014  – Present (1 year 2 months) Shenzhen, Guangdong, China Dedicate wireless business of Communication Infrastructure Divison in PRC Region. Regional Sales Manager Mindspeed Technologies January 2013  –  July 2014  (1 year 7 months) Shenzhen, Guangdong, China Regional Sales Manager Mindspeed Technologies January 2013  –  July 2014  (1 year 7 months) Shenzhen, Guangdong, China District Sales Manager Mindspeed Technologies January 2012  –  January 2013  (1 year 1 month) Shenzhen, Guangdong, China District Sales Manager Mindspeed Technologies January 2012  –  January 2013  (1 year 1 month) Shenzhen, Guangdong, China Account Executive Mindspeed Technologies March 2011  –  December 2011  (10 months) Shenzhen, Guangdong, China Account Executive Mindspeed Technologies March 2011  –  December 2011  (10 months) Shenzhen, Guangdong, China Sales Engineer Mindspeed Technologies April 2009  –  March 2011  (2 years) Shenzhen, Guangdong, China Sales Engineer Mindspeed Technologies April 2009  –  March 2011  (2 years) Shenzhen, Guangdong, China Staff Field Application Engineer Mindspeed Technologies April 2005  –  March 2009  (4 years) Shenzhen, Guangdong, China Long time work with tie-1 telecommunication vendor such as Huawei, to prompt and support DSP and Processor solutions. Staff Field Application Engineer Mindspeed Technologies April 2005  –  March 2009  (4 years) Shenzhen, Guangdong, China Long time work with tie-1 telecommunication vendor such as Huawei, to prompt and support DSP and Processor solutions. R&D Engineer Shenzhen Greennet Technologies July 2002  –  March 2005  (2 years 9 months) Shenzhen, Guangdong, China Software Development for Lanswitch, Router, VoIP Gateway etc telecommunication equipment, well understanding for network architecture and protocols. R&D Engineer Shenzhen Greennet Technologies July 2002  –  March 2005  (2 years 9 months) Shenzhen, Guangdong, China Software Development for Lanswitch, Router, VoIP Gateway etc telecommunication equipment, well understanding for network architecture and protocols. Skills Semiconductors ARM SoC IC ASIC Mixed Signal VoIP Routing Analog Embedded Software Telecommunications Wireless Digital Signal... Microprocessors Embedded Systems Processors Semiconductor Industry RF FPGA See 4+     See less Skills  Semiconductors ARM SoC IC ASIC Mixed Signal VoIP Routing Analog Embedded Software Telecommunications Wireless Digital Signal... Microprocessors Embedded Systems Processors Semiconductor Industry RF FPGA See 4+     See less Semiconductors ARM SoC IC ASIC Mixed Signal VoIP Routing Analog Embedded Software Telecommunications Wireless Digital Signal... Microprocessors Embedded Systems Processors Semiconductor Industry RF FPGA See 4+     See less Semiconductors ARM SoC IC ASIC Mixed Signal VoIP Routing Analog Embedded Software Telecommunications Wireless Digital Signal... Microprocessors Embedded Systems Processors Semiconductor Industry RF FPGA See 4+     See less Education Guilin University of Electronic Technology bachelor,  Communication Engineering 1998  – 2002 Guilin University of Electronic Technology bachelor,  Communication Engineering 1998  – 2002 Guilin University of Electronic Technology bachelor,  Communication Engineering 1998  – 2002 Guilin University of Electronic Technology bachelor,  Communication Engineering 1998  – 2002 ", "Experience Field Sales Engineer Intel Corporation June 1991  – Present (24 years 3 months) Started career w/ Intel in 1988 during college. Worked as a test technician for about 2yrs until graduation. Graduated in 1990 and moved into the Sales & Marketing Organization based in Arizona. For about 1yr, worked as Mkting Dev Eng as part of a 3 1/2 yr extensive sales training for new college graduates. In the summer of 1991 transferred to Southern California to begin sales career. Initial focus was on ROW accounts and learning the PC and embedded product roadmaps. Worked with Distibution extensively in early sales career. Over time worked way to an assigned embedded account list and ultimately major accounts. Embedded accounts included many of the defense contractors, Xircom and Xerox, acting as worldwide Account Manager. In 1998 began focusing on PC OEMs, namely Packard Bell NEC. In 1999 transfered to Boise, ID to become Acct Mgr for MPC Computers, formerly called Micron Electronics, and do special assignments like support growing HPC (high performance computing) accts. Marketing Development Engineer Intel Corporation May 1990  –  June 1991  (1 year 2 months) Worked in the Military and Special Products Group and was responsible for developing marketing collateral, support for Sales and managing the pricing floors for all products Test Technician Intel Corporation May 1988  –  May 1990  (2 years 1 month) While working way through college, started career at Intel in 1988 by working as a test technician. Responsibilites included testing of small engineering component lots on misc test handlers, characterizing failing parts and providing summary reports to engineers. Job was very hands-on and required being certified on many pieces of test hardware and safety procedures. Field Sales Engineer Intel Corporation June 1991  – Present (24 years 3 months) Started career w/ Intel in 1988 during college. Worked as a test technician for about 2yrs until graduation. Graduated in 1990 and moved into the Sales & Marketing Organization based in Arizona. For about 1yr, worked as Mkting Dev Eng as part of a 3 1/2 yr extensive sales training for new college graduates. In the summer of 1991 transferred to Southern California to begin sales career. Initial focus was on ROW accounts and learning the PC and embedded product roadmaps. Worked with Distibution extensively in early sales career. Over time worked way to an assigned embedded account list and ultimately major accounts. Embedded accounts included many of the defense contractors, Xircom and Xerox, acting as worldwide Account Manager. In 1998 began focusing on PC OEMs, namely Packard Bell NEC. In 1999 transfered to Boise, ID to become Acct Mgr for MPC Computers, formerly called Micron Electronics, and do special assignments like support growing HPC (high performance computing) accts. Field Sales Engineer Intel Corporation June 1991  – Present (24 years 3 months) Started career w/ Intel in 1988 during college. Worked as a test technician for about 2yrs until graduation. Graduated in 1990 and moved into the Sales & Marketing Organization based in Arizona. For about 1yr, worked as Mkting Dev Eng as part of a 3 1/2 yr extensive sales training for new college graduates. In the summer of 1991 transferred to Southern California to begin sales career. Initial focus was on ROW accounts and learning the PC and embedded product roadmaps. Worked with Distibution extensively in early sales career. Over time worked way to an assigned embedded account list and ultimately major accounts. Embedded accounts included many of the defense contractors, Xircom and Xerox, acting as worldwide Account Manager. In 1998 began focusing on PC OEMs, namely Packard Bell NEC. In 1999 transfered to Boise, ID to become Acct Mgr for MPC Computers, formerly called Micron Electronics, and do special assignments like support growing HPC (high performance computing) accts. Marketing Development Engineer Intel Corporation May 1990  –  June 1991  (1 year 2 months) Worked in the Military and Special Products Group and was responsible for developing marketing collateral, support for Sales and managing the pricing floors for all products Marketing Development Engineer Intel Corporation May 1990  –  June 1991  (1 year 2 months) Worked in the Military and Special Products Group and was responsible for developing marketing collateral, support for Sales and managing the pricing floors for all products Test Technician Intel Corporation May 1988  –  May 1990  (2 years 1 month) While working way through college, started career at Intel in 1988 by working as a test technician. Responsibilites included testing of small engineering component lots on misc test handlers, characterizing failing parts and providing summary reports to engineers. Job was very hands-on and required being certified on many pieces of test hardware and safety procedures. Test Technician Intel Corporation May 1988  –  May 1990  (2 years 1 month) While working way through college, started career at Intel in 1988 by working as a test technician. Responsibilites included testing of small engineering component lots on misc test handlers, characterizing failing parts and providing summary reports to engineers. Job was very hands-on and required being certified on many pieces of test hardware and safety procedures. Education Arizona State University BSEE,  Electrical Engineering 1984  – 1990 Obtained Electrical Engineering degree from Arizona State University w/ focus in microelectronics. Put self through college. Arizona State University BSEE,  Electrical Engineering 1984  – 1990 Obtained Electrical Engineering degree from Arizona State University w/ focus in microelectronics. Put self through college. Arizona State University BSEE,  Electrical Engineering 1984  – 1990 Obtained Electrical Engineering degree from Arizona State University w/ focus in microelectronics. Put self through college. Arizona State University BSEE,  Electrical Engineering 1984  – 1990 Obtained Electrical Engineering degree from Arizona State University w/ focus in microelectronics. Put self through college. ", "Experience CEE Channel Field Sales Engineer Intel Corporation June 2009  – Present (6 years 3 months) CEE Distribution Sales Analyst Intel Corporation January 2008  –  June 2009  (1 year 6 months) Distribution Business Manager South Central and eastern europe Intel Corporation July 2007  –  November 2007  (5 months) Customer Business analyst CEE distribution Intel Corporation July 2005  –  June 2007  (2 years) night auditor Viking River Cruises March 2001  –  November 2003  (2 years 9 months) CEE Channel Field Sales Engineer Intel Corporation June 2009  – Present (6 years 3 months) CEE Channel Field Sales Engineer Intel Corporation June 2009  – Present (6 years 3 months) CEE Distribution Sales Analyst Intel Corporation January 2008  –  June 2009  (1 year 6 months) CEE Distribution Sales Analyst Intel Corporation January 2008  –  June 2009  (1 year 6 months) Distribution Business Manager South Central and eastern europe Intel Corporation July 2007  –  November 2007  (5 months) Distribution Business Manager South Central and eastern europe Intel Corporation July 2007  –  November 2007  (5 months) Customer Business analyst CEE distribution Intel Corporation July 2005  –  June 2007  (2 years) Customer Business analyst CEE distribution Intel Corporation July 2005  –  June 2007  (2 years) night auditor Viking River Cruises March 2001  –  November 2003  (2 years 9 months) night auditor Viking River Cruises March 2001  –  November 2003  (2 years 9 months) Skills Channel Eastern Europe Competitive Analysis Pricing CEE Product Management Hardware Product Marketing Channel Partners Multi-channel Marketing Business Development Key Account Management B2B International Sales Sales Management Cross-functional Team... Strategic Partnerships Go-to-market Strategy Solution Selling Sales Market Analysis Intel See 7+     See less Skills  Channel Eastern Europe Competitive Analysis Pricing CEE Product Management Hardware Product Marketing Channel Partners Multi-channel Marketing Business Development Key Account Management B2B International Sales Sales Management Cross-functional Team... Strategic Partnerships Go-to-market Strategy Solution Selling Sales Market Analysis Intel See 7+     See less Channel Eastern Europe Competitive Analysis Pricing CEE Product Management Hardware Product Marketing Channel Partners Multi-channel Marketing Business Development Key Account Management B2B International Sales Sales Management Cross-functional Team... Strategic Partnerships Go-to-market Strategy Solution Selling Sales Market Analysis Intel See 7+     See less Channel Eastern Europe Competitive Analysis Pricing CEE Product Management Hardware Product Marketing Channel Partners Multi-channel Marketing Business Development Key Account Management B2B International Sales Sales Management Cross-functional Team... Strategic Partnerships Go-to-market Strategy Solution Selling Sales Market Analysis Intel See 7+     See less Education The Open University MBA,  Strategy 2000  – 2004 The Open University MBA,  Strategy 2000  – 2004 The Open University MBA,  Strategy 2000  – 2004 The Open University MBA,  Strategy 2000  – 2004 ", "Experience Channel Field Sales Engineer Intel Corporation Channel Field Sales Engineer Intel Corporation Channel Field Sales Engineer Intel Corporation Education Ghandi Desai Ghandi Desai Ghandi Desai Ghandi Desai ", "Experience Field Sales Engineer Intel Corporation June 2013  – Present (2 years 3 months) Orange County, California Area Mobile CS Operations Manager Intel Corporation July 2010  –  March 2014  (3 years 9 months) Chipset Demand Lead Intel Corporation February 2009  –  June 2010  (1 year 5 months) WW Srv Demand Intel June 2006  –  February 2009  (2 years 9 months) Lead Financial Analyst LANL March 2002  –  June 2004  (2 years 4 months) Field Sales Engineer Intel Corporation June 2013  – Present (2 years 3 months) Orange County, California Area Field Sales Engineer Intel Corporation June 2013  – Present (2 years 3 months) Orange County, California Area Mobile CS Operations Manager Intel Corporation July 2010  –  March 2014  (3 years 9 months) Mobile CS Operations Manager Intel Corporation July 2010  –  March 2014  (3 years 9 months) Chipset Demand Lead Intel Corporation February 2009  –  June 2010  (1 year 5 months) Chipset Demand Lead Intel Corporation February 2009  –  June 2010  (1 year 5 months) WW Srv Demand Intel June 2006  –  February 2009  (2 years 9 months) WW Srv Demand Intel June 2006  –  February 2009  (2 years 9 months) Lead Financial Analyst LANL March 2002  –  June 2004  (2 years 4 months) Lead Financial Analyst LANL March 2002  –  June 2004  (2 years 4 months) Skills Cross-functional Team... Go-to-market Strategy Intel Mobile Devices Processors Product Management Product Marketing Program Management Semiconductor Industry Semiconductors Skills  Cross-functional Team... Go-to-market Strategy Intel Mobile Devices Processors Product Management Product Marketing Program Management Semiconductor Industry Semiconductors Cross-functional Team... Go-to-market Strategy Intel Mobile Devices Processors Product Management Product Marketing Program Management Semiconductor Industry Semiconductors Cross-functional Team... Go-to-market Strategy Intel Mobile Devices Processors Product Management Product Marketing Program Management Semiconductor Industry Semiconductors Education Santa Fe University of Art and Design MBA,  MIS 2001  – 2003 New Mexico Highlands University Bachelor of Arts (BA),  Business Administration and Management , General 1998  – 2000 Santa Fe University of Art and Design MBA,  MIS 2001  – 2003 Santa Fe University of Art and Design MBA,  MIS 2001  – 2003 Santa Fe University of Art and Design MBA,  MIS 2001  – 2003 New Mexico Highlands University Bachelor of Arts (BA),  Business Administration and Management , General 1998  – 2000 New Mexico Highlands University Bachelor of Arts (BA),  Business Administration and Management , General 1998  – 2000 New Mexico Highlands University Bachelor of Arts (BA),  Business Administration and Management , General 1998  – 2000 "]}