{"position": "Financial Analyst", "company": "Intel Corporation", "profiles": ["Summary A dedicated analyst with an edge on technology companies. Summary A dedicated analyst with an edge on technology companies. A dedicated analyst with an edge on technology companies. A dedicated analyst with an edge on technology companies. Experience Financial Analyst Intel Corporation August 2013  – Present (2 years 1 month) Portland, Oregon Area My responsibilities at intel include Capital and factory capacity analysis, Budgetary plans and tracking, Project valuation and prioritization, Cost reduction and expense controls, Financial statement analysis, Systems implementation, Pricing analysis and reporting, Management reporting. Financial Analyst Lionmark Capital January 2012  –  July 2013  (1 year 7 months) Greater Omaha Area My responsibilities at Lionmark Capital include Analyzing financial information to produce forecasts of businesses, industry, and economic conditions for use in making investment decisions, Assembling spreadsheets and draw charts and graphs used to illustrate technical reports, using computer, Evaluating and comparing the relative quality of various securities in a given industry, Interpret data affecting investment programs, such as price, yield, stability, future trends in investment risks, and economic influences, Monitoring fundamental economic, industrial, and corporate developments through the analysis of information obtained from financial publications and services, investment banking firms, government agencies, trade publications, company sources, and personal interviews. Financial Analyst Starise Capital Management January 2011  –  November 2011  (11 months) Greater Omaha Area Analyzing small and mid cap companies with a special focus on the technology industry. Finance Intern J.P. Morgan May 2010  –  December 2010  (8 months) Greater New York City Area Financial Analyst Intel Corporation August 2013  – Present (2 years 1 month) Portland, Oregon Area My responsibilities at intel include Capital and factory capacity analysis, Budgetary plans and tracking, Project valuation and prioritization, Cost reduction and expense controls, Financial statement analysis, Systems implementation, Pricing analysis and reporting, Management reporting. Financial Analyst Intel Corporation August 2013  – Present (2 years 1 month) Portland, Oregon Area My responsibilities at intel include Capital and factory capacity analysis, Budgetary plans and tracking, Project valuation and prioritization, Cost reduction and expense controls, Financial statement analysis, Systems implementation, Pricing analysis and reporting, Management reporting. Financial Analyst Lionmark Capital January 2012  –  July 2013  (1 year 7 months) Greater Omaha Area My responsibilities at Lionmark Capital include Analyzing financial information to produce forecasts of businesses, industry, and economic conditions for use in making investment decisions, Assembling spreadsheets and draw charts and graphs used to illustrate technical reports, using computer, Evaluating and comparing the relative quality of various securities in a given industry, Interpret data affecting investment programs, such as price, yield, stability, future trends in investment risks, and economic influences, Monitoring fundamental economic, industrial, and corporate developments through the analysis of information obtained from financial publications and services, investment banking firms, government agencies, trade publications, company sources, and personal interviews. Financial Analyst Lionmark Capital January 2012  –  July 2013  (1 year 7 months) Greater Omaha Area My responsibilities at Lionmark Capital include Analyzing financial information to produce forecasts of businesses, industry, and economic conditions for use in making investment decisions, Assembling spreadsheets and draw charts and graphs used to illustrate technical reports, using computer, Evaluating and comparing the relative quality of various securities in a given industry, Interpret data affecting investment programs, such as price, yield, stability, future trends in investment risks, and economic influences, Monitoring fundamental economic, industrial, and corporate developments through the analysis of information obtained from financial publications and services, investment banking firms, government agencies, trade publications, company sources, and personal interviews. Financial Analyst Starise Capital Management January 2011  –  November 2011  (11 months) Greater Omaha Area Analyzing small and mid cap companies with a special focus on the technology industry. Financial Analyst Starise Capital Management January 2011  –  November 2011  (11 months) Greater Omaha Area Analyzing small and mid cap companies with a special focus on the technology industry. Finance Intern J.P. Morgan May 2010  –  December 2010  (8 months) Greater New York City Area Finance Intern J.P. Morgan May 2010  –  December 2010  (8 months) Greater New York City Area Languages Chinese French Japanese English Chinese French Japanese English Chinese French Japanese English Skills Investment Analysis Financial Analysis Stock picking Market Analysis Stock Trading Bilingual-Chinese Skills  Investment Analysis Financial Analysis Stock picking Market Analysis Stock Trading Bilingual-Chinese Investment Analysis Financial Analysis Stock picking Market Analysis Stock Trading Bilingual-Chinese Investment Analysis Financial Analysis Stock picking Market Analysis Stock Trading Bilingual-Chinese Education The George Washington University - School of Business Bachelor of Science (BS),  Finance 2007  – 2011 The George Washington University - School of Business Bachelor of Science (BS),  Finance 2007  – 2011 The George Washington University - School of Business Bachelor of Science (BS),  Finance 2007  – 2011 The George Washington University - School of Business Bachelor of Science (BS),  Finance 2007  – 2011 ", "Summary Recent graduate from Michigan State University's Broad College of Business working in the Sacramento area. Seeking insight and experience in the financial services industry through networking and full-time opportunities. \n \nResume available upon request. Summary Recent graduate from Michigan State University's Broad College of Business working in the Sacramento area. Seeking insight and experience in the financial services industry through networking and full-time opportunities. \n \nResume available upon request. Recent graduate from Michigan State University's Broad College of Business working in the Sacramento area. Seeking insight and experience in the financial services industry through networking and full-time opportunities. \n \nResume available upon request. Recent graduate from Michigan State University's Broad College of Business working in the Sacramento area. Seeking insight and experience in the financial services industry through networking and full-time opportunities. \n \nResume available upon request. Experience Financial Analyst Intel Corporation July 2014  – Present (1 year 2 months) Folsom, CA Forecast, manage, and report a $150+ million expense and capital asset portfolio for the Solid State Drives Division \n \nDesigned a resource indicators database that is used to drive strategic roadmap decisions by the General Manager  \n \nTrained business partners and implemented multiple new processes that are now the systems of record across the division \n \nRe-designed the PnL reporting process, which greatly improved efficiency and received a Division Recognition Award for the work Financial Advisor Assistant Raymond James Financial Inc. October 2012  –  May 2014  (1 year 8 months) East Lansing, MI Evaluated assets on over 1,000 customer portfolios through frequent contact with multiple investment agencies \n \nManaged asset portfolios to insure client goals are represented through allocation of assets Finance BA Intern Intel Corporation May 2013  –  August 2013  (4 months) Folsom, CA Designed a data extensive spreadsheet to optimize financial analysis for Graphics Finance management to use daily \n \nInitiated numerous meetings to persuade business partners to incorporate recommendations regarding Graphics performance and cost within their teams, resulting in more accurate competitive analysis \n \nDefined and analyzed 10 methods of measuring 3 key ROI metrics, resulting in a standardized benchmarking process \n \nPresented benchmarking framework recommendations to 15 Finance Controllers to sell them on the importance of competitive analysis, resulting in immediate implementation within the Graphics Finance Team Accounting Assistant Intern MSU Migrant Student Services September 2011  –  December 2012  (1 year 4 months) Proposed a team project to develop a coding process to organize account activity, resulting in precise budget maintenance \n \nProcessed transactions and reimbursements to assure timely payments to both vendors and staff \n \nReconciled numerous accounts resulting in improved recordkeeping for auditing purposes \n \nBalanced the Petty Cash account to insure no overspending and proper bookkeeping Cash Management Intern DTE Energy June 2012  –  August 2012  (3 months) Generated and managed an outstanding purchase order report spanning across over 9,000 employees in order to lower my team’s average outstanding orders \n \nUsed the Prodagio Accounts Payable software to analyze and post invoices, nearly doubling performance statistics for both teams in the department \n \nCommunicated with employees and vendors on a daily basis to train and instill the Accounts Payable process of receipting and invoicing, resulting in fewer internal errors \n \nResearched open receipts and provided documentation to process invoices in a timely manner, reducing the amount of outstanding receipts Financial Analyst Intel Corporation July 2014  – Present (1 year 2 months) Folsom, CA Forecast, manage, and report a $150+ million expense and capital asset portfolio for the Solid State Drives Division \n \nDesigned a resource indicators database that is used to drive strategic roadmap decisions by the General Manager  \n \nTrained business partners and implemented multiple new processes that are now the systems of record across the division \n \nRe-designed the PnL reporting process, which greatly improved efficiency and received a Division Recognition Award for the work Financial Analyst Intel Corporation July 2014  – Present (1 year 2 months) Folsom, CA Forecast, manage, and report a $150+ million expense and capital asset portfolio for the Solid State Drives Division \n \nDesigned a resource indicators database that is used to drive strategic roadmap decisions by the General Manager  \n \nTrained business partners and implemented multiple new processes that are now the systems of record across the division \n \nRe-designed the PnL reporting process, which greatly improved efficiency and received a Division Recognition Award for the work Financial Advisor Assistant Raymond James Financial Inc. October 2012  –  May 2014  (1 year 8 months) East Lansing, MI Evaluated assets on over 1,000 customer portfolios through frequent contact with multiple investment agencies \n \nManaged asset portfolios to insure client goals are represented through allocation of assets Financial Advisor Assistant Raymond James Financial Inc. October 2012  –  May 2014  (1 year 8 months) East Lansing, MI Evaluated assets on over 1,000 customer portfolios through frequent contact with multiple investment agencies \n \nManaged asset portfolios to insure client goals are represented through allocation of assets Finance BA Intern Intel Corporation May 2013  –  August 2013  (4 months) Folsom, CA Designed a data extensive spreadsheet to optimize financial analysis for Graphics Finance management to use daily \n \nInitiated numerous meetings to persuade business partners to incorporate recommendations regarding Graphics performance and cost within their teams, resulting in more accurate competitive analysis \n \nDefined and analyzed 10 methods of measuring 3 key ROI metrics, resulting in a standardized benchmarking process \n \nPresented benchmarking framework recommendations to 15 Finance Controllers to sell them on the importance of competitive analysis, resulting in immediate implementation within the Graphics Finance Team Finance BA Intern Intel Corporation May 2013  –  August 2013  (4 months) Folsom, CA Designed a data extensive spreadsheet to optimize financial analysis for Graphics Finance management to use daily \n \nInitiated numerous meetings to persuade business partners to incorporate recommendations regarding Graphics performance and cost within their teams, resulting in more accurate competitive analysis \n \nDefined and analyzed 10 methods of measuring 3 key ROI metrics, resulting in a standardized benchmarking process \n \nPresented benchmarking framework recommendations to 15 Finance Controllers to sell them on the importance of competitive analysis, resulting in immediate implementation within the Graphics Finance Team Accounting Assistant Intern MSU Migrant Student Services September 2011  –  December 2012  (1 year 4 months) Proposed a team project to develop a coding process to organize account activity, resulting in precise budget maintenance \n \nProcessed transactions and reimbursements to assure timely payments to both vendors and staff \n \nReconciled numerous accounts resulting in improved recordkeeping for auditing purposes \n \nBalanced the Petty Cash account to insure no overspending and proper bookkeeping Accounting Assistant Intern MSU Migrant Student Services September 2011  –  December 2012  (1 year 4 months) Proposed a team project to develop a coding process to organize account activity, resulting in precise budget maintenance \n \nProcessed transactions and reimbursements to assure timely payments to both vendors and staff \n \nReconciled numerous accounts resulting in improved recordkeeping for auditing purposes \n \nBalanced the Petty Cash account to insure no overspending and proper bookkeeping Cash Management Intern DTE Energy June 2012  –  August 2012  (3 months) Generated and managed an outstanding purchase order report spanning across over 9,000 employees in order to lower my team’s average outstanding orders \n \nUsed the Prodagio Accounts Payable software to analyze and post invoices, nearly doubling performance statistics for both teams in the department \n \nCommunicated with employees and vendors on a daily basis to train and instill the Accounts Payable process of receipting and invoicing, resulting in fewer internal errors \n \nResearched open receipts and provided documentation to process invoices in a timely manner, reducing the amount of outstanding receipts Cash Management Intern DTE Energy June 2012  –  August 2012  (3 months) Generated and managed an outstanding purchase order report spanning across over 9,000 employees in order to lower my team’s average outstanding orders \n \nUsed the Prodagio Accounts Payable software to analyze and post invoices, nearly doubling performance statistics for both teams in the department \n \nCommunicated with employees and vendors on a daily basis to train and instill the Accounts Payable process of receipting and invoicing, resulting in fewer internal errors \n \nResearched open receipts and provided documentation to process invoices in a timely manner, reducing the amount of outstanding receipts Languages Albanian Albanian Albanian Skills Financial Modeling Investments Analysis Budgets Time Management Accounts Payable Management Customer Service Skills  Financial Modeling Investments Analysis Budgets Time Management Accounts Payable Management Customer Service Financial Modeling Investments Analysis Budgets Time Management Accounts Payable Management Customer Service Financial Modeling Investments Analysis Budgets Time Management Accounts Payable Management Customer Service Education Michigan State University Bachelor of Arts (B.A.),  Finance 2010  – 2014 Activities and Societies:  Financial Markets Institute ,  Student Investment Association ,  Delta Sigma Pi ,  Finance Association Michigan State University Bachelor of Arts (B.A.),  Finance 2010  – 2014 Activities and Societies:  Financial Markets Institute ,  Student Investment Association ,  Delta Sigma Pi ,  Finance Association Michigan State University Bachelor of Arts (B.A.),  Finance 2010  – 2014 Activities and Societies:  Financial Markets Institute ,  Student Investment Association ,  Delta Sigma Pi ,  Finance Association Michigan State University Bachelor of Arts (B.A.),  Finance 2010  – 2014 Activities and Societies:  Financial Markets Institute ,  Student Investment Association ,  Delta Sigma Pi ,  Finance Association Honors & Awards Additional Honors & Awards Dean's List- 2010-2014 Additional Honors & Awards Dean's List- 2010-2014 Additional Honors & Awards Dean's List- 2010-2014 Additional Honors & Awards Dean's List- 2010-2014 ", "Summary I am an aspiring financial professional with strong analytical,problem solving and interpersonal skills. \n \nMy education and subsequent experience as an engineer has sharpened my analytical and problem solving skills. My experience of working with multi-cultural teams, across continents has helped me improve my interpersonal skills.  \n \nAs a first step in developing a solid understanding of the financial aspects of business and helping myself in the new career, I have successfully completed the Level I of the Chartered Financial Analyst program. Specialties:Strong quantitative, financial analysis, problem solving skills communication and programming skills. Summary I am an aspiring financial professional with strong analytical,problem solving and interpersonal skills. \n \nMy education and subsequent experience as an engineer has sharpened my analytical and problem solving skills. My experience of working with multi-cultural teams, across continents has helped me improve my interpersonal skills.  \n \nAs a first step in developing a solid understanding of the financial aspects of business and helping myself in the new career, I have successfully completed the Level I of the Chartered Financial Analyst program. Specialties:Strong quantitative, financial analysis, problem solving skills communication and programming skills. I am an aspiring financial professional with strong analytical,problem solving and interpersonal skills. \n \nMy education and subsequent experience as an engineer has sharpened my analytical and problem solving skills. My experience of working with multi-cultural teams, across continents has helped me improve my interpersonal skills.  \n \nAs a first step in developing a solid understanding of the financial aspects of business and helping myself in the new career, I have successfully completed the Level I of the Chartered Financial Analyst program. Specialties:Strong quantitative, financial analysis, problem solving skills communication and programming skills. I am an aspiring financial professional with strong analytical,problem solving and interpersonal skills. \n \nMy education and subsequent experience as an engineer has sharpened my analytical and problem solving skills. My experience of working with multi-cultural teams, across continents has helped me improve my interpersonal skills.  \n \nAs a first step in developing a solid understanding of the financial aspects of business and helping myself in the new career, I have successfully completed the Level I of the Chartered Financial Analyst program. Specialties:Strong quantitative, financial analysis, problem solving skills communication and programming skills. Experience Financial Analyst Intel Corporation July 2013  – Present (2 years 2 months) San Francisco Bay Area Full Time MBA Candidate, Class of 2013 USC Marshall School of Business July 2011  –  May 2013  (1 year 11 months) Greater Los Angeles Area Developing a clear understanding of the fundamentals of business, with a focus on the financial aspects.  \nTo work towards being a more influential leader and create a lifelong network of relationships. Finance Intern Intel Corporation May 2012  –  August 2012  (4 months) At Intel I partnered with core business teams to design a system to manage excess inventory within Intel’s $32B CPU business, with over $3B in inventory.I also performed financial analysis to guide the decision process in the future based on historical patterns. Senior Software Engineer Robert Bosch Engineering and Business Solutions Ltd. July 2006  –  September 2010  (4 years 3 months) Bengaluru Area, India Utilized strong analytical skills to design and implement critical modules for diagnostic products in the automotive aftermarket sector. Promoted 2 times in 3 years at the second largest software development center for Bosch, with revenue of $4B. Financial Analyst Intel Corporation July 2013  – Present (2 years 2 months) San Francisco Bay Area Financial Analyst Intel Corporation July 2013  – Present (2 years 2 months) San Francisco Bay Area Full Time MBA Candidate, Class of 2013 USC Marshall School of Business July 2011  –  May 2013  (1 year 11 months) Greater Los Angeles Area Developing a clear understanding of the fundamentals of business, with a focus on the financial aspects.  \nTo work towards being a more influential leader and create a lifelong network of relationships. Full Time MBA Candidate, Class of 2013 USC Marshall School of Business July 2011  –  May 2013  (1 year 11 months) Greater Los Angeles Area Developing a clear understanding of the fundamentals of business, with a focus on the financial aspects.  \nTo work towards being a more influential leader and create a lifelong network of relationships. Finance Intern Intel Corporation May 2012  –  August 2012  (4 months) At Intel I partnered with core business teams to design a system to manage excess inventory within Intel’s $32B CPU business, with over $3B in inventory.I also performed financial analysis to guide the decision process in the future based on historical patterns. Finance Intern Intel Corporation May 2012  –  August 2012  (4 months) At Intel I partnered with core business teams to design a system to manage excess inventory within Intel’s $32B CPU business, with over $3B in inventory.I also performed financial analysis to guide the decision process in the future based on historical patterns. Senior Software Engineer Robert Bosch Engineering and Business Solutions Ltd. July 2006  –  September 2010  (4 years 3 months) Bengaluru Area, India Utilized strong analytical skills to design and implement critical modules for diagnostic products in the automotive aftermarket sector. Promoted 2 times in 3 years at the second largest software development center for Bosch, with revenue of $4B. Senior Software Engineer Robert Bosch Engineering and Business Solutions Ltd. July 2006  –  September 2010  (4 years 3 months) Bengaluru Area, India Utilized strong analytical skills to design and implement critical modules for diagnostic products in the automotive aftermarket sector. Promoted 2 times in 3 years at the second largest software development center for Bosch, with revenue of $4B. Languages German Hindi Malayalam Tamil German Hindi Malayalam Tamil German Hindi Malayalam Tamil Skills Software Development Corporate Finance Financial Modeling Financial Analysis and... Financial Statement... Analytical Skills Data Analysis Java SQL C++ Chartered Financial... Management Skills  Software Development Corporate Finance Financial Modeling Financial Analysis and... Financial Statement... Analytical Skills Data Analysis Java SQL C++ Chartered Financial... Management Software Development Corporate Finance Financial Modeling Financial Analysis and... Financial Statement... Analytical Skills Data Analysis Java SQL C++ Chartered Financial... Management Software Development Corporate Finance Financial Modeling Financial Analysis and... Financial Statement... Analytical Skills Data Analysis Java SQL C++ Chartered Financial... Management Education University of Southern California - Marshall School of Business Master,  Business Administration 2011  – 2013 University of Kerala, SCT College of Engineering Bachelor of Technology,  Computer Science Engineering 2002  – 2006 University of Southern California - Marshall School of Business Master,  Business Administration 2011  – 2013 University of Southern California - Marshall School of Business Master,  Business Administration 2011  – 2013 University of Southern California - Marshall School of Business Master,  Business Administration 2011  – 2013 University of Kerala, SCT College of Engineering Bachelor of Technology,  Computer Science Engineering 2002  – 2006 University of Kerala, SCT College of Engineering Bachelor of Technology,  Computer Science Engineering 2002  – 2006 University of Kerala, SCT College of Engineering Bachelor of Technology,  Computer Science Engineering 2002  – 2006 ", "Experience Financial Analyst Intel Corporation May 2014  – Present (1 year 4 months) I'm responsible for leading finance processes and analysis in Intel Wireless Connectivity Solutions Group .I'm working on Investment models , analysis and driving cross-group cost reduction & process improvements activities with annual budget of more than $300M. \nWireless Connectivity Solutions Group (Intel's Wireless Engineering Group), responsible for the development of Intel Connectivity solutions for Intel Platforms (like WiFi, Bluetooth, GNSS, WiGig and other wireless connectivity products). More than 1,300 employees worldwide and is managing an annual budget of More than $300M. Analyst Intel Capital June 2012  –  May 2014  (2 years) Intel Capital is Intel's venture-capital arm, supports the company's strategic goals and drives growth.  \n \nJob requirements: Deal with structure modeling, help build valuation models for both public and private companies, exit scenarios analysis, target companies analysis: business plans, financial statements, market sizing, competition and product differentiation and deal flow support; Scouting and screening of new investment opportunities. System Designer Puzzle Projects February 2011  –  July 2012  (1 year 6 months) I write position papers, join large and complex projects and recommend possible ways to progress the project. Naval Officer Israeli Navy September 2003  –  January 2010  (6 years 5 months) I was Executive Officer (XO) at a navy warship. Financial Analyst Intel Corporation May 2014  – Present (1 year 4 months) I'm responsible for leading finance processes and analysis in Intel Wireless Connectivity Solutions Group .I'm working on Investment models , analysis and driving cross-group cost reduction & process improvements activities with annual budget of more than $300M. \nWireless Connectivity Solutions Group (Intel's Wireless Engineering Group), responsible for the development of Intel Connectivity solutions for Intel Platforms (like WiFi, Bluetooth, GNSS, WiGig and other wireless connectivity products). More than 1,300 employees worldwide and is managing an annual budget of More than $300M. Financial Analyst Intel Corporation May 2014  – Present (1 year 4 months) I'm responsible for leading finance processes and analysis in Intel Wireless Connectivity Solutions Group .I'm working on Investment models , analysis and driving cross-group cost reduction & process improvements activities with annual budget of more than $300M. \nWireless Connectivity Solutions Group (Intel's Wireless Engineering Group), responsible for the development of Intel Connectivity solutions for Intel Platforms (like WiFi, Bluetooth, GNSS, WiGig and other wireless connectivity products). More than 1,300 employees worldwide and is managing an annual budget of More than $300M. Analyst Intel Capital June 2012  –  May 2014  (2 years) Intel Capital is Intel's venture-capital arm, supports the company's strategic goals and drives growth.  \n \nJob requirements: Deal with structure modeling, help build valuation models for both public and private companies, exit scenarios analysis, target companies analysis: business plans, financial statements, market sizing, competition and product differentiation and deal flow support; Scouting and screening of new investment opportunities. Analyst Intel Capital June 2012  –  May 2014  (2 years) Intel Capital is Intel's venture-capital arm, supports the company's strategic goals and drives growth.  \n \nJob requirements: Deal with structure modeling, help build valuation models for both public and private companies, exit scenarios analysis, target companies analysis: business plans, financial statements, market sizing, competition and product differentiation and deal flow support; Scouting and screening of new investment opportunities. System Designer Puzzle Projects February 2011  –  July 2012  (1 year 6 months) I write position papers, join large and complex projects and recommend possible ways to progress the project. System Designer Puzzle Projects February 2011  –  July 2012  (1 year 6 months) I write position papers, join large and complex projects and recommend possible ways to progress the project. Naval Officer Israeli Navy September 2003  –  January 2010  (6 years 5 months) I was Executive Officer (XO) at a navy warship. Naval Officer Israeli Navy September 2003  –  January 2010  (6 years 5 months) I was Executive Officer (XO) at a navy warship. Languages Hebrew English Hebrew English Hebrew English Skills R Microsoft Excel VBA SAS Data Analysis Statistics Economics Financial Analysis PowerPoint Market Analysis Venture Capital Entrepreneurship Start-ups Valuation Analysis Financial Modeling Strategy Management Business Strategy See 4+     See less Skills  R Microsoft Excel VBA SAS Data Analysis Statistics Economics Financial Analysis PowerPoint Market Analysis Venture Capital Entrepreneurship Start-ups Valuation Analysis Financial Modeling Strategy Management Business Strategy See 4+     See less R Microsoft Excel VBA SAS Data Analysis Statistics Economics Financial Analysis PowerPoint Market Analysis Venture Capital Entrepreneurship Start-ups Valuation Analysis Financial Modeling Strategy Management Business Strategy See 4+     See less R Microsoft Excel VBA SAS Data Analysis Statistics Economics Financial Analysis PowerPoint Market Analysis Venture Capital Entrepreneurship Start-ups Valuation Analysis Financial Modeling Strategy Management Business Strategy See 4+     See less Education Tel Aviv University Master of Business Administration (MBA),  Technology Management ,  Entrepreneurship and Innovation 2013  – 2015 Tel Aviv University Bachelor of Science (BSc),  Double major in Statistics ,  Operations Research and Economics 2010  – 2013 Tel Aviv University Master of Business Administration (MBA),  Technology Management ,  Entrepreneurship and Innovation 2013  – 2015 Tel Aviv University Master of Business Administration (MBA),  Technology Management ,  Entrepreneurship and Innovation 2013  – 2015 Tel Aviv University Master of Business Administration (MBA),  Technology Management ,  Entrepreneurship and Innovation 2013  – 2015 Tel Aviv University Bachelor of Science (BSc),  Double major in Statistics ,  Operations Research and Economics 2010  – 2013 Tel Aviv University Bachelor of Science (BSc),  Double major in Statistics ,  Operations Research and Economics 2010  – 2013 Tel Aviv University Bachelor of Science (BSc),  Double major in Statistics ,  Operations Research and Economics 2010  – 2013 ", "Languages English Full professional proficiency Hebrew Native or bilingual proficiency English Full professional proficiency Hebrew Native or bilingual proficiency English Full professional proficiency Hebrew Native or bilingual proficiency Full professional proficiency Native or bilingual proficiency Skills PowerPivot Microsoft Excel Portfolio Management Financial Analysis Data Analysis CRM Integration SQL Corporate FP&A Tableau Stock Market Technical Analysis Planning Budgeting &... VBA Business Intelligence SharePoint MDX SAP Business Analysis See 3+     See less Skills  PowerPivot Microsoft Excel Portfolio Management Financial Analysis Data Analysis CRM Integration SQL Corporate FP&A Tableau Stock Market Technical Analysis Planning Budgeting &... VBA Business Intelligence SharePoint MDX SAP Business Analysis See 3+     See less PowerPivot Microsoft Excel Portfolio Management Financial Analysis Data Analysis CRM Integration SQL Corporate FP&A Tableau Stock Market Technical Analysis Planning Budgeting &... VBA Business Intelligence SharePoint MDX SAP Business Analysis See 3+     See less PowerPivot Microsoft Excel Portfolio Management Financial Analysis Data Analysis CRM Integration SQL Corporate FP&A Tableau Stock Market Technical Analysis Planning Budgeting &... VBA Business Intelligence SharePoint MDX SAP Business Analysis See 3+     See less Education The Open University of Israel Bachelor of Arts (B.A.) 2011  – 2014 The Johns Hopkins University 2015 The Open University of Israel Bachelor of Arts (B.A.) 2011  – 2014 The Open University of Israel Bachelor of Arts (B.A.) 2011  – 2014 The Open University of Israel Bachelor of Arts (B.A.) 2011  – 2014 The Johns Hopkins University 2015 The Johns Hopkins University 2015 The Johns Hopkins University 2015 Honors & Awards Department Award- Q4 '13 Time saving award PEG Finance December 2013 Close workflow automation via SQL & PowerPivot Department Award- Q3'14 Cash saving award PEG Finance September 2014 Saving $ 1M in various activities Department Award- Q4 '13 Time saving award PEG Finance December 2013 Close workflow automation via SQL & PowerPivot Department Award- Q4 '13 Time saving award PEG Finance December 2013 Close workflow automation via SQL & PowerPivot Department Award- Q4 '13 Time saving award PEG Finance December 2013 Close workflow automation via SQL & PowerPivot Department Award- Q3'14 Cash saving award PEG Finance September 2014 Saving $ 1M in various activities Department Award- Q3'14 Cash saving award PEG Finance September 2014 Saving $ 1M in various activities Department Award- Q3'14 Cash saving award PEG Finance September 2014 Saving $ 1M in various activities ", "Summary Highly self-motivated, energetic, and balanced analytical and creative thinker with hands-on experience in analysis, accounting, control, and business operations. Exceptional follow through, problem solving, and time management. \n \n* Recognized as a goal-oriented team leader who works well in fast-paced dynamic environments; productive, thorough, consistent, and effective.  \n \n* Brings a natural enthusiasm for overcoming challenges and committed to pursuing continuous improvements; strives to maximize results through creative strategies. \n \n* Participates in development of tactical and strategic decisions to drive goals; uses key indicators and measures to optimize decision-making. \n \n* Well developed interpersonal, training, coaching, and presentation abilities; identifies and utilizes motivational triggers to increase comprehension and achieve desired outcomes. \n \nSpecialties: Financial Analysis - Financial Modeling - Forecasting - Financial Reporting - Budgeting - General Ledger - Reconciliations - Consolidations - Adjustments - Invoicing/Client Billing - Expense Tracking - AP/AR - Month-End Close - Ad-hoc Reports Summary Highly self-motivated, energetic, and balanced analytical and creative thinker with hands-on experience in analysis, accounting, control, and business operations. Exceptional follow through, problem solving, and time management. \n \n* Recognized as a goal-oriented team leader who works well in fast-paced dynamic environments; productive, thorough, consistent, and effective.  \n \n* Brings a natural enthusiasm for overcoming challenges and committed to pursuing continuous improvements; strives to maximize results through creative strategies. \n \n* Participates in development of tactical and strategic decisions to drive goals; uses key indicators and measures to optimize decision-making. \n \n* Well developed interpersonal, training, coaching, and presentation abilities; identifies and utilizes motivational triggers to increase comprehension and achieve desired outcomes. \n \nSpecialties: Financial Analysis - Financial Modeling - Forecasting - Financial Reporting - Budgeting - General Ledger - Reconciliations - Consolidations - Adjustments - Invoicing/Client Billing - Expense Tracking - AP/AR - Month-End Close - Ad-hoc Reports Highly self-motivated, energetic, and balanced analytical and creative thinker with hands-on experience in analysis, accounting, control, and business operations. Exceptional follow through, problem solving, and time management. \n \n* Recognized as a goal-oriented team leader who works well in fast-paced dynamic environments; productive, thorough, consistent, and effective.  \n \n* Brings a natural enthusiasm for overcoming challenges and committed to pursuing continuous improvements; strives to maximize results through creative strategies. \n \n* Participates in development of tactical and strategic decisions to drive goals; uses key indicators and measures to optimize decision-making. \n \n* Well developed interpersonal, training, coaching, and presentation abilities; identifies and utilizes motivational triggers to increase comprehension and achieve desired outcomes. \n \nSpecialties: Financial Analysis - Financial Modeling - Forecasting - Financial Reporting - Budgeting - General Ledger - Reconciliations - Consolidations - Adjustments - Invoicing/Client Billing - Expense Tracking - AP/AR - Month-End Close - Ad-hoc Reports Highly self-motivated, energetic, and balanced analytical and creative thinker with hands-on experience in analysis, accounting, control, and business operations. Exceptional follow through, problem solving, and time management. \n \n* Recognized as a goal-oriented team leader who works well in fast-paced dynamic environments; productive, thorough, consistent, and effective.  \n \n* Brings a natural enthusiasm for overcoming challenges and committed to pursuing continuous improvements; strives to maximize results through creative strategies. \n \n* Participates in development of tactical and strategic decisions to drive goals; uses key indicators and measures to optimize decision-making. \n \n* Well developed interpersonal, training, coaching, and presentation abilities; identifies and utilizes motivational triggers to increase comprehension and achieve desired outcomes. \n \nSpecialties: Financial Analysis - Financial Modeling - Forecasting - Financial Reporting - Budgeting - General Ledger - Reconciliations - Consolidations - Adjustments - Invoicing/Client Billing - Expense Tracking - AP/AR - Month-End Close - Ad-hoc Reports Experience Financial Analyst Intel Corporation June 2013  – Present (2 years 3 months) Hillsboro, Oregon Worldwide Sales and Operations Consolidator on the SMG Central Team Graduate Student Business Ambassador California State University, Sacramento February 2012  –  May 2013  (1 year 4 months) College of Business Waiter Fat's Asia Bistro March 2012  –  March 2013  (1 year 1 month) Folsom Research Analyst Springer Financial Advisors May 2012  –  September 2012  (5 months) Training Coordinator/Shift Manager TEXAS ROADHOUSE, INC. 2009  –  March 2012  (3 years) Manages daily operations focused on proactive customer service, team leadership, scheduling, revenue tracking, and overall service levels. Selected to implement training initiatives and ensures quality service and consistent procedure execution for staff of up to 30. Assistant Manager (Financial Support) SLEEP TRAIN MATTRESS CENTERS 2007  –  2009  (2 years) Supervise team of 5; interviewing, training, coaching, and evaluations. Manage operations with fiscal oversight of bookkeeping and transaction management. Process individual sales and finance transactions. Provide a high level of customer service and promote sales through persuasion and education. Ranked as top producer, grossing $600K with a 51% profit margin within 18 months. Trainer/Customer Service TEXAS ROADHOUSE, INC. 2006  –  2007  (1 year) Conducted new hire orientations and formal training in a customer-focused environment. Ensured customer satisfaction and consistent presentation. Processed payments. Transaction Coordinator/Analyst PMZ, INC. 2004  –  2006  (2 years) Manage high volume transactions while remaining responsive to customer requests throughout the sales process. Provide transactional financial analysis support including cash flow analysis, documentation, and verification of funds. Generate sales memos, collect and deposit commission checks, manage advertising and marketing expenses, and reconcile closing statements. Prepare comparative market analyses for clients. Support team members with continuous follow-up. Financial Operations/Training Instructor AMERICAN DRAGON SELF DEFENSE 1998  –  2003  (5 years) Hands-on training and co-management of an interactive martial arts team. Process payroll, post expenses and cash disbursements to general ledger. Perform budget allocations, cut vendor checks. Identify and evaluate opportunities to increase revenue. Research, prepare, and present financial strategy to decision makers. Plan and execute promotions. Initiate monthly client billing, A/P, and A/R. Manage multiple bank accounts, initiate transfers and journal entries, reconcile bank/investment accounts and expense sheets, and prepare financial statements. Financial Analyst Intel Corporation June 2013  – Present (2 years 3 months) Hillsboro, Oregon Worldwide Sales and Operations Consolidator on the SMG Central Team Financial Analyst Intel Corporation June 2013  – Present (2 years 3 months) Hillsboro, Oregon Worldwide Sales and Operations Consolidator on the SMG Central Team Graduate Student Business Ambassador California State University, Sacramento February 2012  –  May 2013  (1 year 4 months) College of Business Graduate Student Business Ambassador California State University, Sacramento February 2012  –  May 2013  (1 year 4 months) College of Business Waiter Fat's Asia Bistro March 2012  –  March 2013  (1 year 1 month) Folsom Waiter Fat's Asia Bistro March 2012  –  March 2013  (1 year 1 month) Folsom Research Analyst Springer Financial Advisors May 2012  –  September 2012  (5 months) Research Analyst Springer Financial Advisors May 2012  –  September 2012  (5 months) Training Coordinator/Shift Manager TEXAS ROADHOUSE, INC. 2009  –  March 2012  (3 years) Manages daily operations focused on proactive customer service, team leadership, scheduling, revenue tracking, and overall service levels. Selected to implement training initiatives and ensures quality service and consistent procedure execution for staff of up to 30. Training Coordinator/Shift Manager TEXAS ROADHOUSE, INC. 2009  –  March 2012  (3 years) Manages daily operations focused on proactive customer service, team leadership, scheduling, revenue tracking, and overall service levels. Selected to implement training initiatives and ensures quality service and consistent procedure execution for staff of up to 30. Assistant Manager (Financial Support) SLEEP TRAIN MATTRESS CENTERS 2007  –  2009  (2 years) Supervise team of 5; interviewing, training, coaching, and evaluations. Manage operations with fiscal oversight of bookkeeping and transaction management. Process individual sales and finance transactions. Provide a high level of customer service and promote sales through persuasion and education. Ranked as top producer, grossing $600K with a 51% profit margin within 18 months. Assistant Manager (Financial Support) SLEEP TRAIN MATTRESS CENTERS 2007  –  2009  (2 years) Supervise team of 5; interviewing, training, coaching, and evaluations. Manage operations with fiscal oversight of bookkeeping and transaction management. Process individual sales and finance transactions. Provide a high level of customer service and promote sales through persuasion and education. Ranked as top producer, grossing $600K with a 51% profit margin within 18 months. Trainer/Customer Service TEXAS ROADHOUSE, INC. 2006  –  2007  (1 year) Conducted new hire orientations and formal training in a customer-focused environment. Ensured customer satisfaction and consistent presentation. Processed payments. Trainer/Customer Service TEXAS ROADHOUSE, INC. 2006  –  2007  (1 year) Conducted new hire orientations and formal training in a customer-focused environment. Ensured customer satisfaction and consistent presentation. Processed payments. Transaction Coordinator/Analyst PMZ, INC. 2004  –  2006  (2 years) Manage high volume transactions while remaining responsive to customer requests throughout the sales process. Provide transactional financial analysis support including cash flow analysis, documentation, and verification of funds. Generate sales memos, collect and deposit commission checks, manage advertising and marketing expenses, and reconcile closing statements. Prepare comparative market analyses for clients. Support team members with continuous follow-up. Transaction Coordinator/Analyst PMZ, INC. 2004  –  2006  (2 years) Manage high volume transactions while remaining responsive to customer requests throughout the sales process. Provide transactional financial analysis support including cash flow analysis, documentation, and verification of funds. Generate sales memos, collect and deposit commission checks, manage advertising and marketing expenses, and reconcile closing statements. Prepare comparative market analyses for clients. Support team members with continuous follow-up. Financial Operations/Training Instructor AMERICAN DRAGON SELF DEFENSE 1998  –  2003  (5 years) Hands-on training and co-management of an interactive martial arts team. Process payroll, post expenses and cash disbursements to general ledger. Perform budget allocations, cut vendor checks. Identify and evaluate opportunities to increase revenue. Research, prepare, and present financial strategy to decision makers. Plan and execute promotions. Initiate monthly client billing, A/P, and A/R. Manage multiple bank accounts, initiate transfers and journal entries, reconcile bank/investment accounts and expense sheets, and prepare financial statements. Financial Operations/Training Instructor AMERICAN DRAGON SELF DEFENSE 1998  –  2003  (5 years) Hands-on training and co-management of an interactive martial arts team. Process payroll, post expenses and cash disbursements to general ledger. Perform budget allocations, cut vendor checks. Identify and evaluate opportunities to increase revenue. Research, prepare, and present financial strategy to decision makers. Plan and execute promotions. Initiate monthly client billing, A/P, and A/R. Manage multiple bank accounts, initiate transfers and journal entries, reconcile bank/investment accounts and expense sheets, and prepare financial statements. Skills Management Analysis Forecasting Training Leadership Financial Analysis Team Leadership Finance Time Management Customer Satisfaction Research Business Strategy Financial Reporting Customer Service Financial Modeling Sales Coaching Microsoft Excel Process Improvement Outlook Account Reconciliation PowerPoint Leadership Development Strategic Planning Financial Statements Microsoft Word Budgets Social Media Team Building Microsoft Office Software Documentation Investments Public Speaking Data Analysis General Ledger See 20+     See less Skills  Management Analysis Forecasting Training Leadership Financial Analysis Team Leadership Finance Time Management Customer Satisfaction Research Business Strategy Financial Reporting Customer Service Financial Modeling Sales Coaching Microsoft Excel Process Improvement Outlook Account Reconciliation PowerPoint Leadership Development Strategic Planning Financial Statements Microsoft Word Budgets Social Media Team Building Microsoft Office Software Documentation Investments Public Speaking Data Analysis General Ledger See 20+     See less Management Analysis Forecasting Training Leadership Financial Analysis Team Leadership Finance Time Management Customer Satisfaction Research Business Strategy Financial Reporting Customer Service Financial Modeling Sales Coaching Microsoft Excel Process Improvement Outlook Account Reconciliation PowerPoint Leadership Development Strategic Planning Financial Statements Microsoft Word Budgets Social Media Team Building Microsoft Office Software Documentation Investments Public Speaking Data Analysis General Ledger See 20+     See less Management Analysis Forecasting Training Leadership Financial Analysis Team Leadership Finance Time Management Customer Satisfaction Research Business Strategy Financial Reporting Customer Service Financial Modeling Sales Coaching Microsoft Excel Process Improvement Outlook Account Reconciliation PowerPoint Leadership Development Strategic Planning Financial Statements Microsoft Word Budgets Social Media Team Building Microsoft Office Software Documentation Investments Public Speaking Data Analysis General Ledger See 20+     See less Education CSU Sacramento MBA,  Finance 2011  – 2013 Activities and Societies:  MBA Networking Association ,  Student Investment Fund ,  International Collegiate Business Strategy Competition Team ,  Phi Delta Theta ,  Round Table Society ,  Graduate Business Student Ambasssador CSU Stanislaus Bachelor of Science,  Business Administration 2002  – 2008 Activities and Societies:  Student Leadership Program ,  Phi Delta Theta CSU Sacramento MBA,  Finance 2011  – 2013 Activities and Societies:  MBA Networking Association ,  Student Investment Fund ,  International Collegiate Business Strategy Competition Team ,  Phi Delta Theta ,  Round Table Society ,  Graduate Business Student Ambasssador CSU Sacramento MBA,  Finance 2011  – 2013 Activities and Societies:  MBA Networking Association ,  Student Investment Fund ,  International Collegiate Business Strategy Competition Team ,  Phi Delta Theta ,  Round Table Society ,  Graduate Business Student Ambasssador CSU Sacramento MBA,  Finance 2011  – 2013 Activities and Societies:  MBA Networking Association ,  Student Investment Fund ,  International Collegiate Business Strategy Competition Team ,  Phi Delta Theta ,  Round Table Society ,  Graduate Business Student Ambasssador CSU Stanislaus Bachelor of Science,  Business Administration 2002  – 2008 Activities and Societies:  Student Leadership Program ,  Phi Delta Theta CSU Stanislaus Bachelor of Science,  Business Administration 2002  – 2008 Activities and Societies:  Student Leadership Program ,  Phi Delta Theta CSU Stanislaus Bachelor of Science,  Business Administration 2002  – 2008 Activities and Societies:  Student Leadership Program ,  Phi Delta Theta ", "Summary Result-oriented, self-motivated finance & accounting profession with 3 years of combined experiences in auditing, financial analysis, and consulting. Specialties:Commercial company audit, internal control testing, business valuation, financial model building, data collection and analysis, strong Excel knowledge, critical thinking and problem solving, project management and leadership, communication and presentations. Summary Result-oriented, self-motivated finance & accounting profession with 3 years of combined experiences in auditing, financial analysis, and consulting. Specialties:Commercial company audit, internal control testing, business valuation, financial model building, data collection and analysis, strong Excel knowledge, critical thinking and problem solving, project management and leadership, communication and presentations. Result-oriented, self-motivated finance & accounting profession with 3 years of combined experiences in auditing, financial analysis, and consulting. Specialties:Commercial company audit, internal control testing, business valuation, financial model building, data collection and analysis, strong Excel knowledge, critical thinking and problem solving, project management and leadership, communication and presentations. Result-oriented, self-motivated finance & accounting profession with 3 years of combined experiences in auditing, financial analysis, and consulting. Specialties:Commercial company audit, internal control testing, business valuation, financial model building, data collection and analysis, strong Excel knowledge, critical thinking and problem solving, project management and leadership, communication and presentations. Experience Financial Analyst Intel Corporation February 2013  – Present (2 years 7 months) Chengdu, Sichuan, China Financial Analyst Qualcomm November 2012  –  February 2013  (4 months) Beijing, China Developed fiscal year 2013 January Outlook by consolidating China All headcount and expenses actual and foretasted data \nPrepared variance analysis by comparing January Outlook to 2013 Year Budget. \nSupport accounting team on AP closing of December 2012, January and February 2013. Audit Staff Crowe Horwath LLP September 2011  –  June 2012  (10 months) Sherman Oaks, CA •Contributed in interim and final year audit projects, by collecting, reconciling, and analyzing data for Cash, Prepaid, AP, Fixed Assets and AR (Revenue), for multiple commercial clients, including a SEC corporation, in high-tech, manufacturing, agricultural, and entertainment industries. \n•Effectively performed internal control testing for multiple clients and SOX testing for a SEC corporation by interviewing key personnel and consolidating data for reporting. \n•Independently completed several inventory observation projects as well as a fixed asset observation for a merger and acquisition project. Financial Analyst Intern Intel Corporation June 2010  –  August 2010  (3 months) Beijing, China •Successfully influenced the marketing team on a B2C marketing project by developing a Return on Investment (ROI) model to analyze the cost-effectiveness of the up-to-date spending, created a future spending proposal, and recommended a revenue growth target and strategy. \n•Increased a B2B marketing project process efficiency by analyzing the original process flow, drafted the process chart, and recommended plans to cut down repetitive steps and connect critical points in the process. \n•Delivered a presentation to senior management team on the analytics and outcomes of above two projects. MBA Candidate Consulting Project Mercy Corps August 2009  –  May 2010  (10 months) Portland, Oregon Area •Developed and recommended implementable financial models for a non-profit real estate projects by researching industry data and conducting interviews with local non-profit agencies.  \n•Created and implemented a program, which allows low-income renters to generate long-term wealth, by interviewing with local communities and non-profit agencies for information and support. Intern Community Valley Bank July 2008  –  July 2008  (1 month) Accountant Intern/Part-time WU LIAN FANG YUAN CPA CO., LTD May 2006  –  November 2007  (1 year 7 months) Chongqing, China •Contributed to an auditing project by completing AP, Cash, Prepaid, and Fixed Assets audits. \n•Performed inventory observations; handled Bank and AR confirmation letters. Financial Analyst Intel Corporation February 2013  – Present (2 years 7 months) Chengdu, Sichuan, China Financial Analyst Intel Corporation February 2013  – Present (2 years 7 months) Chengdu, Sichuan, China Financial Analyst Qualcomm November 2012  –  February 2013  (4 months) Beijing, China Developed fiscal year 2013 January Outlook by consolidating China All headcount and expenses actual and foretasted data \nPrepared variance analysis by comparing January Outlook to 2013 Year Budget. \nSupport accounting team on AP closing of December 2012, January and February 2013. Financial Analyst Qualcomm November 2012  –  February 2013  (4 months) Beijing, China Developed fiscal year 2013 January Outlook by consolidating China All headcount and expenses actual and foretasted data \nPrepared variance analysis by comparing January Outlook to 2013 Year Budget. \nSupport accounting team on AP closing of December 2012, January and February 2013. Audit Staff Crowe Horwath LLP September 2011  –  June 2012  (10 months) Sherman Oaks, CA •Contributed in interim and final year audit projects, by collecting, reconciling, and analyzing data for Cash, Prepaid, AP, Fixed Assets and AR (Revenue), for multiple commercial clients, including a SEC corporation, in high-tech, manufacturing, agricultural, and entertainment industries. \n•Effectively performed internal control testing for multiple clients and SOX testing for a SEC corporation by interviewing key personnel and consolidating data for reporting. \n•Independently completed several inventory observation projects as well as a fixed asset observation for a merger and acquisition project. Audit Staff Crowe Horwath LLP September 2011  –  June 2012  (10 months) Sherman Oaks, CA •Contributed in interim and final year audit projects, by collecting, reconciling, and analyzing data for Cash, Prepaid, AP, Fixed Assets and AR (Revenue), for multiple commercial clients, including a SEC corporation, in high-tech, manufacturing, agricultural, and entertainment industries. \n•Effectively performed internal control testing for multiple clients and SOX testing for a SEC corporation by interviewing key personnel and consolidating data for reporting. \n•Independently completed several inventory observation projects as well as a fixed asset observation for a merger and acquisition project. Financial Analyst Intern Intel Corporation June 2010  –  August 2010  (3 months) Beijing, China •Successfully influenced the marketing team on a B2C marketing project by developing a Return on Investment (ROI) model to analyze the cost-effectiveness of the up-to-date spending, created a future spending proposal, and recommended a revenue growth target and strategy. \n•Increased a B2B marketing project process efficiency by analyzing the original process flow, drafted the process chart, and recommended plans to cut down repetitive steps and connect critical points in the process. \n•Delivered a presentation to senior management team on the analytics and outcomes of above two projects. Financial Analyst Intern Intel Corporation June 2010  –  August 2010  (3 months) Beijing, China •Successfully influenced the marketing team on a B2C marketing project by developing a Return on Investment (ROI) model to analyze the cost-effectiveness of the up-to-date spending, created a future spending proposal, and recommended a revenue growth target and strategy. \n•Increased a B2B marketing project process efficiency by analyzing the original process flow, drafted the process chart, and recommended plans to cut down repetitive steps and connect critical points in the process. \n•Delivered a presentation to senior management team on the analytics and outcomes of above two projects. MBA Candidate Consulting Project Mercy Corps August 2009  –  May 2010  (10 months) Portland, Oregon Area •Developed and recommended implementable financial models for a non-profit real estate projects by researching industry data and conducting interviews with local non-profit agencies.  \n•Created and implemented a program, which allows low-income renters to generate long-term wealth, by interviewing with local communities and non-profit agencies for information and support. MBA Candidate Consulting Project Mercy Corps August 2009  –  May 2010  (10 months) Portland, Oregon Area •Developed and recommended implementable financial models for a non-profit real estate projects by researching industry data and conducting interviews with local non-profit agencies.  \n•Created and implemented a program, which allows low-income renters to generate long-term wealth, by interviewing with local communities and non-profit agencies for information and support. Intern Community Valley Bank July 2008  –  July 2008  (1 month) Intern Community Valley Bank July 2008  –  July 2008  (1 month) Accountant Intern/Part-time WU LIAN FANG YUAN CPA CO., LTD May 2006  –  November 2007  (1 year 7 months) Chongqing, China •Contributed to an auditing project by completing AP, Cash, Prepaid, and Fixed Assets audits. \n•Performed inventory observations; handled Bank and AR confirmation letters. Accountant Intern/Part-time WU LIAN FANG YUAN CPA CO., LTD May 2006  –  November 2007  (1 year 7 months) Chongqing, China •Contributed to an auditing project by completing AP, Cash, Prepaid, and Fixed Assets audits. \n•Performed inventory observations; handled Bank and AR confirmation letters. Skills Business Valuation Financial Modeling Financial Analysis Auditing Internal Controls Consolidation Initiation Teamwork Valuation Forecasting Financial Reporting Strategy Budgets Corporate Finance Finance Financial Accounting See 1+     See less Skills  Business Valuation Financial Modeling Financial Analysis Auditing Internal Controls Consolidation Initiation Teamwork Valuation Forecasting Financial Reporting Strategy Budgets Corporate Finance Finance Financial Accounting See 1+     See less Business Valuation Financial Modeling Financial Analysis Auditing Internal Controls Consolidation Initiation Teamwork Valuation Forecasting Financial Reporting Strategy Budgets Corporate Finance Finance Financial Accounting See 1+     See less Business Valuation Financial Modeling Financial Analysis Auditing Internal Controls Consolidation Initiation Teamwork Valuation Forecasting Financial Reporting Strategy Budgets Corporate Finance Finance Financial Accounting See 1+     See less Education Willamette University - Atkinson Graduate School of Management MBA,  Accounting and Finance 2009  – 2011 Recipient of Willamette MBA Scholar, merit-based scholarship. Activities and Societies:  Selected to participate in exchange program with Copenhagen Business School for fall semester 2010. The Chinese University of Hong Kong Bachelor,  Economics 2005  – 2009 Activities and Societies:  MUA soccer team;\nExchange program to University of Victoria at B.C. ,  Canada Willamette University - Atkinson Graduate School of Management MBA,  Accounting and Finance 2009  – 2011 Recipient of Willamette MBA Scholar, merit-based scholarship. Activities and Societies:  Selected to participate in exchange program with Copenhagen Business School for fall semester 2010. Willamette University - Atkinson Graduate School of Management MBA,  Accounting and Finance 2009  – 2011 Recipient of Willamette MBA Scholar, merit-based scholarship. Activities and Societies:  Selected to participate in exchange program with Copenhagen Business School for fall semester 2010. Willamette University - Atkinson Graduate School of Management MBA,  Accounting and Finance 2009  – 2011 Recipient of Willamette MBA Scholar, merit-based scholarship. Activities and Societies:  Selected to participate in exchange program with Copenhagen Business School for fall semester 2010. The Chinese University of Hong Kong Bachelor,  Economics 2005  – 2009 Activities and Societies:  MUA soccer team;\nExchange program to University of Victoria at B.C. ,  Canada The Chinese University of Hong Kong Bachelor,  Economics 2005  – 2009 Activities and Societies:  MUA soccer team;\nExchange program to University of Victoria at B.C. ,  Canada The Chinese University of Hong Kong Bachelor,  Economics 2005  – 2009 Activities and Societies:  MUA soccer team;\nExchange program to University of Victoria at B.C. ,  Canada ", "Experience Senior Financial Planning Analyst, Intel Mobile Communications Group Intel Corporation January 2012  – Present (3 years 8 months) Munich Area, Germany ● Manages both Close and Forecasting for her main business groups, working to understand business needs while helping understand key production changes and potential impacts \n● Acts as a key business partner for her Operations partners, providing clear communication channels between Finance and Operations, providing all business support needs such as financial analysis for headcount decisions around site strategy and contingent workers, platform projects and spending needs, and managing both headcount and budget transfers \n● Ad-hoc projects and support: including managing the reorganization of the IMC acquisition into overall Intel; founding and acting coordinator of the New Employee Group at the Munich campus, helping integrate new employees and interns into Intel and Munich; organized a Purchase Order and Headcount cleanup project Financial Analyst, Embedded Computing Group Intel Corporation April 2010  –  January 2012  (1 year 10 months) Chandler, AZ ● Supervised the budgets for key business groups for both Close and Forecasting cycles for all spending and headcount data, ensuring data integrity and explaining all variances \n● Systems expert for all budgeting and reporting systems for ECG, including Visual Planning Optimization, Resource Management Tool, Microstrategy, and Glide  \n● Ad-hoc projects and support: including modeling the Research and Development portion of ECG’s Managerial PnL; analyzing deltas between systems using a detailed audit program Financial Analyst, Technology Manufacturing Group Intel Corporation August 2007  –  April 2010  (2 years 9 months) Chandler, AZ ● Managed all consolidations activity for both the Close and Forecasting cycles for TMG, analyzing the data to ensure its accuracy and reliability  \n● Responsible for all of TMG’s headcount (approximately 37,000 heads) and discretionary spending; the 2009 discretionary analysis work helped enable TMG to achieve a 1.25 Employee Bonus \n● Owned the B&P for the TMG Admin department and coordinates and drives budget accountability across both the ops and finance components of the budget Financial Intern Marathon Oil Company May 2006  –  August 2006  (4 months) Houston, Texas Area -Managed the Cash and Banking Polling desk for duration of summer \n- Assisted the Cash and Banking Domestic Desk with bank reconciliations  \n- Analyzed and prepared summary report on potential investment Prospectus Senior Financial Planning Analyst, Intel Mobile Communications Group Intel Corporation January 2012  – Present (3 years 8 months) Munich Area, Germany ● Manages both Close and Forecasting for her main business groups, working to understand business needs while helping understand key production changes and potential impacts \n● Acts as a key business partner for her Operations partners, providing clear communication channels between Finance and Operations, providing all business support needs such as financial analysis for headcount decisions around site strategy and contingent workers, platform projects and spending needs, and managing both headcount and budget transfers \n● Ad-hoc projects and support: including managing the reorganization of the IMC acquisition into overall Intel; founding and acting coordinator of the New Employee Group at the Munich campus, helping integrate new employees and interns into Intel and Munich; organized a Purchase Order and Headcount cleanup project Senior Financial Planning Analyst, Intel Mobile Communications Group Intel Corporation January 2012  – Present (3 years 8 months) Munich Area, Germany ● Manages both Close and Forecasting for her main business groups, working to understand business needs while helping understand key production changes and potential impacts \n● Acts as a key business partner for her Operations partners, providing clear communication channels between Finance and Operations, providing all business support needs such as financial analysis for headcount decisions around site strategy and contingent workers, platform projects and spending needs, and managing both headcount and budget transfers \n● Ad-hoc projects and support: including managing the reorganization of the IMC acquisition into overall Intel; founding and acting coordinator of the New Employee Group at the Munich campus, helping integrate new employees and interns into Intel and Munich; organized a Purchase Order and Headcount cleanup project Financial Analyst, Embedded Computing Group Intel Corporation April 2010  –  January 2012  (1 year 10 months) Chandler, AZ ● Supervised the budgets for key business groups for both Close and Forecasting cycles for all spending and headcount data, ensuring data integrity and explaining all variances \n● Systems expert for all budgeting and reporting systems for ECG, including Visual Planning Optimization, Resource Management Tool, Microstrategy, and Glide  \n● Ad-hoc projects and support: including modeling the Research and Development portion of ECG’s Managerial PnL; analyzing deltas between systems using a detailed audit program Financial Analyst, Embedded Computing Group Intel Corporation April 2010  –  January 2012  (1 year 10 months) Chandler, AZ ● Supervised the budgets for key business groups for both Close and Forecasting cycles for all spending and headcount data, ensuring data integrity and explaining all variances \n● Systems expert for all budgeting and reporting systems for ECG, including Visual Planning Optimization, Resource Management Tool, Microstrategy, and Glide  \n● Ad-hoc projects and support: including modeling the Research and Development portion of ECG’s Managerial PnL; analyzing deltas between systems using a detailed audit program Financial Analyst, Technology Manufacturing Group Intel Corporation August 2007  –  April 2010  (2 years 9 months) Chandler, AZ ● Managed all consolidations activity for both the Close and Forecasting cycles for TMG, analyzing the data to ensure its accuracy and reliability  \n● Responsible for all of TMG’s headcount (approximately 37,000 heads) and discretionary spending; the 2009 discretionary analysis work helped enable TMG to achieve a 1.25 Employee Bonus \n● Owned the B&P for the TMG Admin department and coordinates and drives budget accountability across both the ops and finance components of the budget Financial Analyst, Technology Manufacturing Group Intel Corporation August 2007  –  April 2010  (2 years 9 months) Chandler, AZ ● Managed all consolidations activity for both the Close and Forecasting cycles for TMG, analyzing the data to ensure its accuracy and reliability  \n● Responsible for all of TMG’s headcount (approximately 37,000 heads) and discretionary spending; the 2009 discretionary analysis work helped enable TMG to achieve a 1.25 Employee Bonus \n● Owned the B&P for the TMG Admin department and coordinates and drives budget accountability across both the ops and finance components of the budget Financial Intern Marathon Oil Company May 2006  –  August 2006  (4 months) Houston, Texas Area -Managed the Cash and Banking Polling desk for duration of summer \n- Assisted the Cash and Banking Domestic Desk with bank reconciliations  \n- Analyzed and prepared summary report on potential investment Prospectus Financial Intern Marathon Oil Company May 2006  –  August 2006  (4 months) Houston, Texas Area -Managed the Cash and Banking Polling desk for duration of summer \n- Assisted the Cash and Banking Domestic Desk with bank reconciliations  \n- Analyzed and prepared summary report on potential investment Prospectus Languages German Elementary proficiency German Elementary proficiency German Elementary proficiency Elementary proficiency Skills Skills     Education The University of Texas at Austin - The Red McCombs School of Business Finance 2003  – 2007 Minored in Management Information Systems \nGraduated with University Honors Activities and Societies:  Beta Gamma Sigma ,  Forever Texas (Founding Member) The University of Texas at Austin - The Red McCombs School of Business Finance 2003  – 2007 Minored in Management Information Systems \nGraduated with University Honors Activities and Societies:  Beta Gamma Sigma ,  Forever Texas (Founding Member) The University of Texas at Austin - The Red McCombs School of Business Finance 2003  – 2007 Minored in Management Information Systems \nGraduated with University Honors Activities and Societies:  Beta Gamma Sigma ,  Forever Texas (Founding Member) The University of Texas at Austin - The Red McCombs School of Business Finance 2003  – 2007 Minored in Management Information Systems \nGraduated with University Honors Activities and Societies:  Beta Gamma Sigma ,  Forever Texas (Founding Member) Honors & Awards Additional Honors & Awards Divisional Recognition Award in IMC for her contributions to the MCG Reorg (2012) \nDivisional Recognition Award from the ECG-PED General Manager for supporting convergence to Plan 2012 (2011) \nTMG Central Finance Divisional Recognition Award for Close (2007) \nDistinguished Scholar at The University of Texas at Austin (2003-2007) \n-Earned a 4.0 6 of my 8 semesters (Earned University Honors the other two semesters) \nNational Merit Commended Scholar (2003) \nGirl Scout Gold Award (2002) Additional Honors & Awards Divisional Recognition Award in IMC for her contributions to the MCG Reorg (2012) \nDivisional Recognition Award from the ECG-PED General Manager for supporting convergence to Plan 2012 (2011) \nTMG Central Finance Divisional Recognition Award for Close (2007) \nDistinguished Scholar at The University of Texas at Austin (2003-2007) \n-Earned a 4.0 6 of my 8 semesters (Earned University Honors the other two semesters) \nNational Merit Commended Scholar (2003) \nGirl Scout Gold Award (2002) Additional Honors & Awards Divisional Recognition Award in IMC for her contributions to the MCG Reorg (2012) \nDivisional Recognition Award from the ECG-PED General Manager for supporting convergence to Plan 2012 (2011) \nTMG Central Finance Divisional Recognition Award for Close (2007) \nDistinguished Scholar at The University of Texas at Austin (2003-2007) \n-Earned a 4.0 6 of my 8 semesters (Earned University Honors the other two semesters) \nNational Merit Commended Scholar (2003) \nGirl Scout Gold Award (2002) Additional Honors & Awards Divisional Recognition Award in IMC for her contributions to the MCG Reorg (2012) \nDivisional Recognition Award from the ECG-PED General Manager for supporting convergence to Plan 2012 (2011) \nTMG Central Finance Divisional Recognition Award for Close (2007) \nDistinguished Scholar at The University of Texas at Austin (2003-2007) \n-Earned a 4.0 6 of my 8 semesters (Earned University Honors the other two semesters) \nNational Merit Commended Scholar (2003) \nGirl Scout Gold Award (2002) ", "Experience Financial Analyst Intel Corporation July 2014  – Present (1 year 2 months) Santa Clara, CA Financial Analyst Intern Intel Corporation May 2013  –  August 2013  (4 months) Folsom, CA Senior Associate PwC July 2011  –  May 2012  (11 months) Greater Los Angeles Area Associate PwC September 2009  –  June 2011  (1 year 10 months) Financial Analyst Intel Corporation July 2014  – Present (1 year 2 months) Santa Clara, CA Financial Analyst Intel Corporation July 2014  – Present (1 year 2 months) Santa Clara, CA Financial Analyst Intern Intel Corporation May 2013  –  August 2013  (4 months) Folsom, CA Financial Analyst Intern Intel Corporation May 2013  –  August 2013  (4 months) Folsom, CA Senior Associate PwC July 2011  –  May 2012  (11 months) Greater Los Angeles Area Senior Associate PwC July 2011  –  May 2012  (11 months) Greater Los Angeles Area Associate PwC September 2009  –  June 2011  (1 year 10 months) Associate PwC September 2009  –  June 2011  (1 year 10 months) Skills Skills     Education Georgetown University - The McDonough School of Business Master of Business Administration (MBA) 2012  – 2014 Loyola Marymount University BS,  Accounting 2005  – 2009 Georgetown University - The McDonough School of Business Master of Business Administration (MBA) 2012  – 2014 Georgetown University - The McDonough School of Business Master of Business Administration (MBA) 2012  – 2014 Georgetown University - The McDonough School of Business Master of Business Administration (MBA) 2012  – 2014 Loyola Marymount University BS,  Accounting 2005  – 2009 Loyola Marymount University BS,  Accounting 2005  – 2009 Loyola Marymount University BS,  Accounting 2005  – 2009 Honors & Awards Georgetown McDonough Scholar 2014 Additional Honors & Awards LMU Accounting Program Scholar, 2009 Georgetown McDonough Scholar 2014 Georgetown McDonough Scholar 2014 Georgetown McDonough Scholar 2014 Additional Honors & Awards LMU Accounting Program Scholar, 2009 Additional Honors & Awards LMU Accounting Program Scholar, 2009 Additional Honors & Awards LMU Accounting Program Scholar, 2009 ", "Experience Financial Analyst Intel Corporation January 2015  – Present (8 months) Munich Area, Germany Intern - Financial Analyst Intel Corporation July 2014  –  December 2014  (6 months) Munich Area, Germany Assistant Accountant Oceanus Marine 2011  –  2012  (1 year) Athens, Greece Financial Analyst Intel Corporation January 2015  – Present (8 months) Munich Area, Germany Financial Analyst Intel Corporation January 2015  – Present (8 months) Munich Area, Germany Intern - Financial Analyst Intel Corporation July 2014  –  December 2014  (6 months) Munich Area, Germany Intern - Financial Analyst Intel Corporation July 2014  –  December 2014  (6 months) Munich Area, Germany Assistant Accountant Oceanus Marine 2011  –  2012  (1 year) Athens, Greece Assistant Accountant Oceanus Marine 2011  –  2012  (1 year) Athens, Greece Languages Greek Native or bilingual proficiency English Native or bilingual proficiency German Full professional proficiency Greek Native or bilingual proficiency English Native or bilingual proficiency German Full professional proficiency Greek Native or bilingual proficiency English Native or bilingual proficiency German Full professional proficiency Native or bilingual proficiency Native or bilingual proficiency Full professional proficiency Skills Advanced Macroeconomics Advanced Microeconomics Econometrics Financial Econometrics International Economics Stata Microsoft Office Finance Accounting Banking Statistics GMAT ECDL Certification Economics Financial Analysis Microsoft Excel Financial Reporting Financial Accounting PowerPoint SAP Financial Planning Auditing Corporate Finance Analysis Teamwork Financial Modeling Data Analysis Risk Management See 13+     See less Skills  Advanced Macroeconomics Advanced Microeconomics Econometrics Financial Econometrics International Economics Stata Microsoft Office Finance Accounting Banking Statistics GMAT ECDL Certification Economics Financial Analysis Microsoft Excel Financial Reporting Financial Accounting PowerPoint SAP Financial Planning Auditing Corporate Finance Analysis Teamwork Financial Modeling Data Analysis Risk Management See 13+     See less Advanced Macroeconomics Advanced Microeconomics Econometrics Financial Econometrics International Economics Stata Microsoft Office Finance Accounting Banking Statistics GMAT ECDL Certification Economics Financial Analysis Microsoft Excel Financial Reporting Financial Accounting PowerPoint SAP Financial Planning Auditing Corporate Finance Analysis Teamwork Financial Modeling Data Analysis Risk Management See 13+     See less Advanced Macroeconomics Advanced Microeconomics Econometrics Financial Econometrics International Economics Stata Microsoft Office Finance Accounting Banking Statistics GMAT ECDL Certification Economics Financial Analysis Microsoft Excel Financial Reporting Financial Accounting PowerPoint SAP Financial Planning Auditing Corporate Finance Analysis Teamwork Financial Modeling Data Analysis Risk Management See 13+     See less Education Maastricht University Master of Science (MSc),  Economics 2013  – 2014 University of Piraeus Bachelor's degree,  Financial Management and Banking 2007  – 2013 Maastricht University Master of Science (MSc),  Economics 2013  – 2014 Maastricht University Master of Science (MSc),  Economics 2013  – 2014 Maastricht University Master of Science (MSc),  Economics 2013  – 2014 University of Piraeus Bachelor's degree,  Financial Management and Banking 2007  – 2013 University of Piraeus Bachelor's degree,  Financial Management and Banking 2007  – 2013 University of Piraeus Bachelor's degree,  Financial Management and Banking 2007  – 2013 Honors & Awards ", "Summary • MBA (Accounting and Finance) with strong interest in the technology sector \n• Experience collaborating with cross-functional and multicultural teams  \n• Knowledgeable with Customer Relationship Management systems and recording detailed client interactions \n• Experience with problem solving, data analysis/management, and client advocacy Summary • MBA (Accounting and Finance) with strong interest in the technology sector \n• Experience collaborating with cross-functional and multicultural teams  \n• Knowledgeable with Customer Relationship Management systems and recording detailed client interactions \n• Experience with problem solving, data analysis/management, and client advocacy • MBA (Accounting and Finance) with strong interest in the technology sector \n• Experience collaborating with cross-functional and multicultural teams  \n• Knowledgeable with Customer Relationship Management systems and recording detailed client interactions \n• Experience with problem solving, data analysis/management, and client advocacy • MBA (Accounting and Finance) with strong interest in the technology sector \n• Experience collaborating with cross-functional and multicultural teams  \n• Knowledgeable with Customer Relationship Management systems and recording detailed client interactions \n• Experience with problem solving, data analysis/management, and client advocacy Experience Financial Analyst Intel Corporation October 2014  – Present (11 months) Hillsboro, OR FP&A Analyst-Sales and Marketing Group-Sales Enablement and Operations Accountant Intel Corporation August 2013  – Present (2 years 1 month) Aloha, Oregon BPM Tenet Lead – Close & Reporting \n• Analyze, prepare, and present change management, excursion, and balanced scorecard data to controllers and senior staff in various forums \n• Manage and support/train users to use BPM systems \n• Test SOX controls \n• Audit account reconciliations Corporate Finance/Accounting Intern Intel Corporation May 2012  –  August 2012  (4 months) Hillsboro, OR •Improved process for expensing Stock Based Compensation to comply with local statutory for various legal entities \n•Reviewed legal entity financial statements to report any fluxes to management and educate about any business impact \n•Reduced impact of approving access to Close and Reporting applications by 12% and educated team about the program Branch Intern Scottrade April 2010  –  February 2012  (1 year 11 months) Salem, OR •Serviced and maintained client accounts of up to $3 million \n•Collaborated with coworkers on daily reports as well as improving customer interactions as evidenced by an increase in customer satisfaction scores \n•Maintained data integrity by securing sensitive account/trade information \n•Enriched customer's financial trading education through organizing and administrating bi-monthly branch seminars \n•Increased awareness and availability of Scottrade Bank by finding potential customers through a CRM system and promoting the added benefits Clerical Assistant Willamette University-School of Education January 2009  –  July 2010  (1 year 7 months) Salem, OR •Analyzed and assessed quantitative and qualitative survey data to create graphs for the dean and accreditation committee using Excel \n•Enhanced academic research by compiling demographic databases for 300+ Oregon schools and researching literacy development in early readers  \n•Communicated with professors on a weekly basis on projects including copying, filing, processing confidential paperwork Academic Tutor Willamette Academy September 2009  –  December 2009  (4 months) Challenged and inspired youth to think critically and aspire to advance to higher education \nFostered a productive learning environment for the after school program \nTutored underprivileged youth in a variety of disciplines (primarily Math and English) (Mini) Golf Pro Kings Beach Miniature Golf May 2009  –  August 2009  (4 months) Provided friendly customer service while running the business without a supervisor-including opening \nTrusted with counter/register sales with a daily income of approximately $500-$2000 \nMaintained a clean course that ran smoothly by continuously repairing machines, touching up paint, gardening, etc. Personal Assistant Mofo Mountain Productions January 2008  –  August 2009  (1 year 8 months) Truckee, CA •Collected and organized statement information for the past 3 years for reimbursement and auditing purposes \n•Accomplished transcribing and copyrighting a voice coaching program in 2 months \n•Launched the voice coaching program onto the Internet for 24/7 accessible streaming \n•Upgraded and compiled 3 different databases of networking information for 200+ contacts into Filemaker Pro Mail Clerk Willamette University-Mail Center September 2008  –  December 2008  (4 months) Scanned and labeled approximately 60 packages per 1/2 hour \nSorted and distributed approximately 300 pieces of mail/packages per hour Receptionist Assistant Sitkoff/O'Neil Accountancy Corporation January 2007  –  April 2008  (1 year 4 months) Truckee, CA •Monitored customer service over the phone and in office \n•Trusted with confidential and time sensitive documents \n•Collected and distributed tax returns during peak tax season \n•Processed incoming and outgoing mail as well as deliveries for 13 accountants File Clerk North Tahoe Orthopedic November 2007  –  March 2008  (5 months) Trusted with confidential patient information including surgery information and appointment dictation \nMaintained a filing system for all charts before and after appointments as well as creating new ones \nDepended upon to create a customer friendly atmosphere in the office and on the phone while making reminder phone calls Financial Analyst Intel Corporation October 2014  – Present (11 months) Hillsboro, OR FP&A Analyst-Sales and Marketing Group-Sales Enablement and Operations Financial Analyst Intel Corporation October 2014  – Present (11 months) Hillsboro, OR FP&A Analyst-Sales and Marketing Group-Sales Enablement and Operations Accountant Intel Corporation August 2013  – Present (2 years 1 month) Aloha, Oregon BPM Tenet Lead – Close & Reporting \n• Analyze, prepare, and present change management, excursion, and balanced scorecard data to controllers and senior staff in various forums \n• Manage and support/train users to use BPM systems \n• Test SOX controls \n• Audit account reconciliations Accountant Intel Corporation August 2013  – Present (2 years 1 month) Aloha, Oregon BPM Tenet Lead – Close & Reporting \n• Analyze, prepare, and present change management, excursion, and balanced scorecard data to controllers and senior staff in various forums \n• Manage and support/train users to use BPM systems \n• Test SOX controls \n• Audit account reconciliations Corporate Finance/Accounting Intern Intel Corporation May 2012  –  August 2012  (4 months) Hillsboro, OR •Improved process for expensing Stock Based Compensation to comply with local statutory for various legal entities \n•Reviewed legal entity financial statements to report any fluxes to management and educate about any business impact \n•Reduced impact of approving access to Close and Reporting applications by 12% and educated team about the program Corporate Finance/Accounting Intern Intel Corporation May 2012  –  August 2012  (4 months) Hillsboro, OR •Improved process for expensing Stock Based Compensation to comply with local statutory for various legal entities \n•Reviewed legal entity financial statements to report any fluxes to management and educate about any business impact \n•Reduced impact of approving access to Close and Reporting applications by 12% and educated team about the program Branch Intern Scottrade April 2010  –  February 2012  (1 year 11 months) Salem, OR •Serviced and maintained client accounts of up to $3 million \n•Collaborated with coworkers on daily reports as well as improving customer interactions as evidenced by an increase in customer satisfaction scores \n•Maintained data integrity by securing sensitive account/trade information \n•Enriched customer's financial trading education through organizing and administrating bi-monthly branch seminars \n•Increased awareness and availability of Scottrade Bank by finding potential customers through a CRM system and promoting the added benefits Branch Intern Scottrade April 2010  –  February 2012  (1 year 11 months) Salem, OR •Serviced and maintained client accounts of up to $3 million \n•Collaborated with coworkers on daily reports as well as improving customer interactions as evidenced by an increase in customer satisfaction scores \n•Maintained data integrity by securing sensitive account/trade information \n•Enriched customer's financial trading education through organizing and administrating bi-monthly branch seminars \n•Increased awareness and availability of Scottrade Bank by finding potential customers through a CRM system and promoting the added benefits Clerical Assistant Willamette University-School of Education January 2009  –  July 2010  (1 year 7 months) Salem, OR •Analyzed and assessed quantitative and qualitative survey data to create graphs for the dean and accreditation committee using Excel \n•Enhanced academic research by compiling demographic databases for 300+ Oregon schools and researching literacy development in early readers  \n•Communicated with professors on a weekly basis on projects including copying, filing, processing confidential paperwork Clerical Assistant Willamette University-School of Education January 2009  –  July 2010  (1 year 7 months) Salem, OR •Analyzed and assessed quantitative and qualitative survey data to create graphs for the dean and accreditation committee using Excel \n•Enhanced academic research by compiling demographic databases for 300+ Oregon schools and researching literacy development in early readers  \n•Communicated with professors on a weekly basis on projects including copying, filing, processing confidential paperwork Academic Tutor Willamette Academy September 2009  –  December 2009  (4 months) Challenged and inspired youth to think critically and aspire to advance to higher education \nFostered a productive learning environment for the after school program \nTutored underprivileged youth in a variety of disciplines (primarily Math and English) Academic Tutor Willamette Academy September 2009  –  December 2009  (4 months) Challenged and inspired youth to think critically and aspire to advance to higher education \nFostered a productive learning environment for the after school program \nTutored underprivileged youth in a variety of disciplines (primarily Math and English) (Mini) Golf Pro Kings Beach Miniature Golf May 2009  –  August 2009  (4 months) Provided friendly customer service while running the business without a supervisor-including opening \nTrusted with counter/register sales with a daily income of approximately $500-$2000 \nMaintained a clean course that ran smoothly by continuously repairing machines, touching up paint, gardening, etc. (Mini) Golf Pro Kings Beach Miniature Golf May 2009  –  August 2009  (4 months) Provided friendly customer service while running the business without a supervisor-including opening \nTrusted with counter/register sales with a daily income of approximately $500-$2000 \nMaintained a clean course that ran smoothly by continuously repairing machines, touching up paint, gardening, etc. Personal Assistant Mofo Mountain Productions January 2008  –  August 2009  (1 year 8 months) Truckee, CA •Collected and organized statement information for the past 3 years for reimbursement and auditing purposes \n•Accomplished transcribing and copyrighting a voice coaching program in 2 months \n•Launched the voice coaching program onto the Internet for 24/7 accessible streaming \n•Upgraded and compiled 3 different databases of networking information for 200+ contacts into Filemaker Pro Personal Assistant Mofo Mountain Productions January 2008  –  August 2009  (1 year 8 months) Truckee, CA •Collected and organized statement information for the past 3 years for reimbursement and auditing purposes \n•Accomplished transcribing and copyrighting a voice coaching program in 2 months \n•Launched the voice coaching program onto the Internet for 24/7 accessible streaming \n•Upgraded and compiled 3 different databases of networking information for 200+ contacts into Filemaker Pro Mail Clerk Willamette University-Mail Center September 2008  –  December 2008  (4 months) Scanned and labeled approximately 60 packages per 1/2 hour \nSorted and distributed approximately 300 pieces of mail/packages per hour Mail Clerk Willamette University-Mail Center September 2008  –  December 2008  (4 months) Scanned and labeled approximately 60 packages per 1/2 hour \nSorted and distributed approximately 300 pieces of mail/packages per hour Receptionist Assistant Sitkoff/O'Neil Accountancy Corporation January 2007  –  April 2008  (1 year 4 months) Truckee, CA •Monitored customer service over the phone and in office \n•Trusted with confidential and time sensitive documents \n•Collected and distributed tax returns during peak tax season \n•Processed incoming and outgoing mail as well as deliveries for 13 accountants Receptionist Assistant Sitkoff/O'Neil Accountancy Corporation January 2007  –  April 2008  (1 year 4 months) Truckee, CA •Monitored customer service over the phone and in office \n•Trusted with confidential and time sensitive documents \n•Collected and distributed tax returns during peak tax season \n•Processed incoming and outgoing mail as well as deliveries for 13 accountants File Clerk North Tahoe Orthopedic November 2007  –  March 2008  (5 months) Trusted with confidential patient information including surgery information and appointment dictation \nMaintained a filing system for all charts before and after appointments as well as creating new ones \nDepended upon to create a customer friendly atmosphere in the office and on the phone while making reminder phone calls File Clerk North Tahoe Orthopedic November 2007  –  March 2008  (5 months) Trusted with confidential patient information including surgery information and appointment dictation \nMaintained a filing system for all charts before and after appointments as well as creating new ones \nDepended upon to create a customer friendly atmosphere in the office and on the phone while making reminder phone calls Skills Data Analysis Client Advocacy Problem Solving Collaborative Detailed Analysis Integrity Analysis PowerPoint Microsoft Excel Research Collaboration Customer Service Time Management Sales Accounting Teamwork Cross-functional Team... See 2+     See less Skills  Data Analysis Client Advocacy Problem Solving Collaborative Detailed Analysis Integrity Analysis PowerPoint Microsoft Excel Research Collaboration Customer Service Time Management Sales Accounting Teamwork Cross-functional Team... See 2+     See less Data Analysis Client Advocacy Problem Solving Collaborative Detailed Analysis Integrity Analysis PowerPoint Microsoft Excel Research Collaboration Customer Service Time Management Sales Accounting Teamwork Cross-functional Team... See 2+     See less Data Analysis Client Advocacy Problem Solving Collaborative Detailed Analysis Integrity Analysis PowerPoint Microsoft Excel Research Collaboration Customer Service Time Management Sales Accounting Teamwork Cross-functional Team... See 2+     See less Education Willamette University - Atkinson Graduate School of Management MBA,  Finance/Accounting 2011  – 2013 Conducted a transactions audit program for the Oregon Department of Revenue  \n•Consulting project with cross-functional team for the Secretary of State’s office to maintain production of the Oregon Blue Book by increasing exposure, and increasing revenue with new promotional products Activities and Societies:  Atkinson Accounting Association ,  Atkinson Finance Association Willamette University BA,  Economics ,  Sociology 2008  – 2012 •Senior Thesis: Voucher Systems and their Effects on the Education System Activities and Societies:  Delta Gamma (VP Finance) ,  Women's Club Soccer Team ,  Intramural Sports (Soccer ,  Basketball) ,  Community Service (various organizations) Louisiana State University Certificate in Accounting,  Accounting 2014 Willamette University - Atkinson Graduate School of Management MBA,  Finance/Accounting 2011  – 2013 Conducted a transactions audit program for the Oregon Department of Revenue  \n•Consulting project with cross-functional team for the Secretary of State’s office to maintain production of the Oregon Blue Book by increasing exposure, and increasing revenue with new promotional products Activities and Societies:  Atkinson Accounting Association ,  Atkinson Finance Association Willamette University - Atkinson Graduate School of Management MBA,  Finance/Accounting 2011  – 2013 Conducted a transactions audit program for the Oregon Department of Revenue  \n•Consulting project with cross-functional team for the Secretary of State’s office to maintain production of the Oregon Blue Book by increasing exposure, and increasing revenue with new promotional products Activities and Societies:  Atkinson Accounting Association ,  Atkinson Finance Association Willamette University - Atkinson Graduate School of Management MBA,  Finance/Accounting 2011  – 2013 Conducted a transactions audit program for the Oregon Department of Revenue  \n•Consulting project with cross-functional team for the Secretary of State’s office to maintain production of the Oregon Blue Book by increasing exposure, and increasing revenue with new promotional products Activities and Societies:  Atkinson Accounting Association ,  Atkinson Finance Association Willamette University BA,  Economics ,  Sociology 2008  – 2012 •Senior Thesis: Voucher Systems and their Effects on the Education System Activities and Societies:  Delta Gamma (VP Finance) ,  Women's Club Soccer Team ,  Intramural Sports (Soccer ,  Basketball) ,  Community Service (various organizations) Willamette University BA,  Economics ,  Sociology 2008  – 2012 •Senior Thesis: Voucher Systems and their Effects on the Education System Activities and Societies:  Delta Gamma (VP Finance) ,  Women's Club Soccer Team ,  Intramural Sports (Soccer ,  Basketball) ,  Community Service (various organizations) Willamette University BA,  Economics ,  Sociology 2008  – 2012 •Senior Thesis: Voucher Systems and their Effects on the Education System Activities and Societies:  Delta Gamma (VP Finance) ,  Women's Club Soccer Team ,  Intramural Sports (Soccer ,  Basketball) ,  Community Service (various organizations) Louisiana State University Certificate in Accounting,  Accounting 2014 Louisiana State University Certificate in Accounting,  Accounting 2014 Louisiana State University Certificate in Accounting,  Accounting 2014 ", "Experience Financial Analyst Intel Corporation July 2015  – Present (2 months) Santa Clara, California Brand Ambassador Amazon September 2013  –  March 2015  (1 year 7 months) Davis, California Pricing Analyst Intern Intel Corporation June 2014  –  September 2014  (4 months) Folsom, California Consultant Marrone Bio Innovations May 2014  –  September 2014  (5 months) Davis, California Research Assistant UC Davis October 2013  –  June 2014  (9 months) Davis, California Marketing Assistant UC Davis Dining Services February 2013  –  May 2014  (1 year 4 months) Davis, California Financial Training Intern Morgan Stanley January 2014  –  March 2014  (3 months) Sacramento, California Business Analyst Intern Blackhawk Network June 2013  –  September 2013  (4 months) Pleasanton, California Recycling Intern City Hall of Union City June 2012  –  September 2012  (4 months) Union City, California Accounting Assistant Law Offices of Marilyn Thomassen & Associates, PC June 2010  –  September 2011  (1 year 4 months) Financial Analyst Intel Corporation July 2015  – Present (2 months) Santa Clara, California Financial Analyst Intel Corporation July 2015  – Present (2 months) Santa Clara, California Brand Ambassador Amazon September 2013  –  March 2015  (1 year 7 months) Davis, California Brand Ambassador Amazon September 2013  –  March 2015  (1 year 7 months) Davis, California Pricing Analyst Intern Intel Corporation June 2014  –  September 2014  (4 months) Folsom, California Pricing Analyst Intern Intel Corporation June 2014  –  September 2014  (4 months) Folsom, California Consultant Marrone Bio Innovations May 2014  –  September 2014  (5 months) Davis, California Consultant Marrone Bio Innovations May 2014  –  September 2014  (5 months) Davis, California Research Assistant UC Davis October 2013  –  June 2014  (9 months) Davis, California Research Assistant UC Davis October 2013  –  June 2014  (9 months) Davis, California Marketing Assistant UC Davis Dining Services February 2013  –  May 2014  (1 year 4 months) Davis, California Marketing Assistant UC Davis Dining Services February 2013  –  May 2014  (1 year 4 months) Davis, California Financial Training Intern Morgan Stanley January 2014  –  March 2014  (3 months) Sacramento, California Financial Training Intern Morgan Stanley January 2014  –  March 2014  (3 months) Sacramento, California Business Analyst Intern Blackhawk Network June 2013  –  September 2013  (4 months) Pleasanton, California Business Analyst Intern Blackhawk Network June 2013  –  September 2013  (4 months) Pleasanton, California Recycling Intern City Hall of Union City June 2012  –  September 2012  (4 months) Union City, California Recycling Intern City Hall of Union City June 2012  –  September 2012  (4 months) Union City, California Accounting Assistant Law Offices of Marilyn Thomassen & Associates, PC June 2010  –  September 2011  (1 year 4 months) Accounting Assistant Law Offices of Marilyn Thomassen & Associates, PC June 2010  –  September 2011  (1 year 4 months) Languages   Skills Microsoft Excel Microsoft Word Microsoft Powerpoint Microsoft Access Social Media Adobe Dreamweaver Adobe Photoshop Adobe Flash Public Speaking Exceptionally well... Multi-tasking... Learning Quickly Office Equipment Photoshop PowerPoint Event Planning Social Networking Customer Service Research Marketing Editing Microsoft Office Analysis Data Analysis Access See 10+     See less Skills  Microsoft Excel Microsoft Word Microsoft Powerpoint Microsoft Access Social Media Adobe Dreamweaver Adobe Photoshop Adobe Flash Public Speaking Exceptionally well... Multi-tasking... Learning Quickly Office Equipment Photoshop PowerPoint Event Planning Social Networking Customer Service Research Marketing Editing Microsoft Office Analysis Data Analysis Access See 10+     See less Microsoft Excel Microsoft Word Microsoft Powerpoint Microsoft Access Social Media Adobe Dreamweaver Adobe Photoshop Adobe Flash Public Speaking Exceptionally well... Multi-tasking... Learning Quickly Office Equipment Photoshop PowerPoint Event Planning Social Networking Customer Service Research Marketing Editing Microsoft Office Analysis Data Analysis Access See 10+     See less Microsoft Excel Microsoft Word Microsoft Powerpoint Microsoft Access Social Media Adobe Dreamweaver Adobe Photoshop Adobe Flash Public Speaking Exceptionally well... Multi-tasking... Learning Quickly Office Equipment Photoshop PowerPoint Event Planning Social Networking Customer Service Research Marketing Editing Microsoft Office Analysis Data Analysis Access See 10+     See less ", "Experience Financial Analyst Intel Corporation March 2012  – Present (3 years 6 months) Chandler, AZ Operations Finance Intern Intel Corporation May 2011  –  August 2011  (4 months) Phoenix, Arizona Area Violinist Independent Musician January 1996  –  December 2009  (14 years) Financial Analyst Intel Corporation March 2012  – Present (3 years 6 months) Chandler, AZ Financial Analyst Intel Corporation March 2012  – Present (3 years 6 months) Chandler, AZ Operations Finance Intern Intel Corporation May 2011  –  August 2011  (4 months) Phoenix, Arizona Area Operations Finance Intern Intel Corporation May 2011  –  August 2011  (4 months) Phoenix, Arizona Area Violinist Independent Musician January 1996  –  December 2009  (14 years) Violinist Independent Musician January 1996  –  December 2009  (14 years) Education Thunderbird School of Global Management MBA,  Global Management ,  Finance 2010  – 2011 Activities and Societies:  President of National Association of Women MBA's. Thunderbird Finance Association ,  Spring Term Thunderbird Student Government Representative Manhattan School of Music Masters of Music,  Violin Performance 1996  – 1998 Manhattan School of Music Bachelors of Music,  Violin Performance 1994  – 1996 Thunderbird School of Global Management MBA,  Global Management ,  Finance 2010  – 2011 Activities and Societies:  President of National Association of Women MBA's. Thunderbird Finance Association ,  Spring Term Thunderbird Student Government Representative Thunderbird School of Global Management MBA,  Global Management ,  Finance 2010  – 2011 Activities and Societies:  President of National Association of Women MBA's. Thunderbird Finance Association ,  Spring Term Thunderbird Student Government Representative Thunderbird School of Global Management MBA,  Global Management ,  Finance 2010  – 2011 Activities and Societies:  President of National Association of Women MBA's. Thunderbird Finance Association ,  Spring Term Thunderbird Student Government Representative Manhattan School of Music Masters of Music,  Violin Performance 1996  – 1998 Manhattan School of Music Masters of Music,  Violin Performance 1996  – 1998 Manhattan School of Music Masters of Music,  Violin Performance 1996  – 1998 Manhattan School of Music Bachelors of Music,  Violin Performance 1994  – 1996 Manhattan School of Music Bachelors of Music,  Violin Performance 1994  – 1996 Manhattan School of Music Bachelors of Music,  Violin Performance 1994  – 1996 ", "Experience Financial Analyst Intel Corporation July 2012  – Present (3 years 2 months) Hillsboro, OR Finance Intern Intel Corporation May 2011  –  August 2011  (4 months) Hillsboro, OR Finance Intern \nNTG (Netbook / Tablet Group) Case Manager The Short Sales Group, LLC October 2008  –  August 2010  (1 year 11 months) Financial Advisor Drummond Capital June 2007  –  September 2008  (1 year 4 months) Summer Intern Hantz Group May 2006  –  September 2006  (5 months) Financial Analyst Intel Corporation July 2012  – Present (3 years 2 months) Hillsboro, OR Financial Analyst Intel Corporation July 2012  – Present (3 years 2 months) Hillsboro, OR Finance Intern Intel Corporation May 2011  –  August 2011  (4 months) Hillsboro, OR Finance Intern \nNTG (Netbook / Tablet Group) Finance Intern Intel Corporation May 2011  –  August 2011  (4 months) Hillsboro, OR Finance Intern \nNTG (Netbook / Tablet Group) Case Manager The Short Sales Group, LLC October 2008  –  August 2010  (1 year 11 months) Case Manager The Short Sales Group, LLC October 2008  –  August 2010  (1 year 11 months) Financial Advisor Drummond Capital June 2007  –  September 2008  (1 year 4 months) Financial Advisor Drummond Capital June 2007  –  September 2008  (1 year 4 months) Summer Intern Hantz Group May 2006  –  September 2006  (5 months) Summer Intern Hantz Group May 2006  –  September 2006  (5 months) Skills Financial Analysis Skills  Financial Analysis Financial Analysis Financial Analysis Education Michigan State University - The Eli Broad College of Business MBA,  Finance 2010  – 2012 Northwood University Bachelors of Business Administration,  Triple Major: Banking & Finance / Economics / Management 2003  – 2007 Activities and Societies:  Alpha Kappa Psi - Professional Business Fraternity Michigan State University - The Eli Broad College of Business MBA,  Finance 2010  – 2012 Michigan State University - The Eli Broad College of Business MBA,  Finance 2010  – 2012 Michigan State University - The Eli Broad College of Business MBA,  Finance 2010  – 2012 Northwood University Bachelors of Business Administration,  Triple Major: Banking & Finance / Economics / Management 2003  – 2007 Activities and Societies:  Alpha Kappa Psi - Professional Business Fraternity Northwood University Bachelors of Business Administration,  Triple Major: Banking & Finance / Economics / Management 2003  – 2007 Activities and Societies:  Alpha Kappa Psi - Professional Business Fraternity Northwood University Bachelors of Business Administration,  Triple Major: Banking & Finance / Economics / Management 2003  – 2007 Activities and Societies:  Alpha Kappa Psi - Professional Business Fraternity ", "Summary Multi-faceted, efficient & reliable business professional with proven leadership skills gained from managing cross-functional project teams. Established reputation for taking initiative and skilled at meeting challenges and deadlines while paying close attention to detail to produce quality results. Innovative thinker with a passion and dedication to the field of Finance. Summary Multi-faceted, efficient & reliable business professional with proven leadership skills gained from managing cross-functional project teams. Established reputation for taking initiative and skilled at meeting challenges and deadlines while paying close attention to detail to produce quality results. Innovative thinker with a passion and dedication to the field of Finance. Multi-faceted, efficient & reliable business professional with proven leadership skills gained from managing cross-functional project teams. Established reputation for taking initiative and skilled at meeting challenges and deadlines while paying close attention to detail to produce quality results. Innovative thinker with a passion and dedication to the field of Finance. Multi-faceted, efficient & reliable business professional with proven leadership skills gained from managing cross-functional project teams. Established reputation for taking initiative and skilled at meeting challenges and deadlines while paying close attention to detail to produce quality results. Innovative thinker with a passion and dedication to the field of Finance. Experience Financial Analyst Intel Corporation December 2014  – Present (9 months) Hillsboro, OR Client Computing Group Central P&L Analyst supporting Communications and Devices  Financial Analyst Intel Corporation June 2013  –  December 2014  (1 year 7 months) Hillsboro, OR FP&A Analyst supporting PC Client Group - Global Ecosystem Development & Mobile Platforms \nCapital Analyst supporting PC Client Group Internship Mercy Corps Northwest Micro Finance Division July 2012  –  December 2012  (6 months) Portland, Oregon Area Business Loan Analyst - Responsible for the organization and efficient operation of loan pipeline consisting of small business capital requests. \n \n Financial Analyst Intel Corporation December 2014  – Present (9 months) Hillsboro, OR Client Computing Group Central P&L Analyst supporting Communications and Devices  Financial Analyst Intel Corporation December 2014  – Present (9 months) Hillsboro, OR Client Computing Group Central P&L Analyst supporting Communications and Devices  Financial Analyst Intel Corporation June 2013  –  December 2014  (1 year 7 months) Hillsboro, OR FP&A Analyst supporting PC Client Group - Global Ecosystem Development & Mobile Platforms \nCapital Analyst supporting PC Client Group Financial Analyst Intel Corporation June 2013  –  December 2014  (1 year 7 months) Hillsboro, OR FP&A Analyst supporting PC Client Group - Global Ecosystem Development & Mobile Platforms \nCapital Analyst supporting PC Client Group Internship Mercy Corps Northwest Micro Finance Division July 2012  –  December 2012  (6 months) Portland, Oregon Area Business Loan Analyst - Responsible for the organization and efficient operation of loan pipeline consisting of small business capital requests. \n \n Internship Mercy Corps Northwest Micro Finance Division July 2012  –  December 2012  (6 months) Portland, Oregon Area Business Loan Analyst - Responsible for the organization and efficient operation of loan pipeline consisting of small business capital requests. \n \n Skills Microsoft Office Microsoft Excel PowerPoint Microsoft Word Customer Service Teamwork Financial Analysis Research Public Speaking Skills  Microsoft Office Microsoft Excel PowerPoint Microsoft Word Customer Service Teamwork Financial Analysis Research Public Speaking Microsoft Office Microsoft Excel PowerPoint Microsoft Word Customer Service Teamwork Financial Analysis Research Public Speaking Microsoft Office Microsoft Excel PowerPoint Microsoft Word Customer Service Teamwork Financial Analysis Research Public Speaking Education Portland State University Bachelor of Science in Business Administration,  Finance 2009  – 2013 President – Financial Management Association - Portland State Chapter \nCum Laude Latin Honors designation \nFMA International National Honors Society designation \n \nExtensive project work utilizing business theory in both individual and team environments: \n \nMultiple case evaluations using value of money concepts to understand the net present value of financial decisions and implementation of tools needed to make effective long term financial decisions for budgeting capital, investing, and borrowing. \n \nIndividual study and analysis of the characteristics of financial instruments and markets with emphasis on techniques of investment analysis and portfolio management. The study and understanding of diversification and asset allocation to improve risk and average return on portfolio. The study of valuation models as they relate to equity and fixed income securities. Portland State University Bachelor of Science in Business Administration,  Finance 2009  – 2013 President – Financial Management Association - Portland State Chapter \nCum Laude Latin Honors designation \nFMA International National Honors Society designation \n \nExtensive project work utilizing business theory in both individual and team environments: \n \nMultiple case evaluations using value of money concepts to understand the net present value of financial decisions and implementation of tools needed to make effective long term financial decisions for budgeting capital, investing, and borrowing. \n \nIndividual study and analysis of the characteristics of financial instruments and markets with emphasis on techniques of investment analysis and portfolio management. The study and understanding of diversification and asset allocation to improve risk and average return on portfolio. The study of valuation models as they relate to equity and fixed income securities. Portland State University Bachelor of Science in Business Administration,  Finance 2009  – 2013 President – Financial Management Association - Portland State Chapter \nCum Laude Latin Honors designation \nFMA International National Honors Society designation \n \nExtensive project work utilizing business theory in both individual and team environments: \n \nMultiple case evaluations using value of money concepts to understand the net present value of financial decisions and implementation of tools needed to make effective long term financial decisions for budgeting capital, investing, and borrowing. \n \nIndividual study and analysis of the characteristics of financial instruments and markets with emphasis on techniques of investment analysis and portfolio management. The study and understanding of diversification and asset allocation to improve risk and average return on portfolio. The study of valuation models as they relate to equity and fixed income securities. Portland State University Bachelor of Science in Business Administration,  Finance 2009  – 2013 President – Financial Management Association - Portland State Chapter \nCum Laude Latin Honors designation \nFMA International National Honors Society designation \n \nExtensive project work utilizing business theory in both individual and team environments: \n \nMultiple case evaluations using value of money concepts to understand the net present value of financial decisions and implementation of tools needed to make effective long term financial decisions for budgeting capital, investing, and borrowing. \n \nIndividual study and analysis of the characteristics of financial instruments and markets with emphasis on techniques of investment analysis and portfolio management. The study and understanding of diversification and asset allocation to improve risk and average return on portfolio. The study of valuation models as they relate to equity and fixed income securities. ", "Experience Financial Analyst Intel Corporation October 2014  – Present (11 months) Tokyo, Japan Financial Analyst Intern Intel Corporation June 2014  –  August 2014  (3 months) Tokyo, Japan Sales & Marketing Intern Bosch May 2013  –  May 2014  (1 year 1 month) yokohama, kanagawa, japan Financial Analyst Intel Corporation October 2014  – Present (11 months) Tokyo, Japan Financial Analyst Intel Corporation October 2014  – Present (11 months) Tokyo, Japan Financial Analyst Intern Intel Corporation June 2014  –  August 2014  (3 months) Tokyo, Japan Financial Analyst Intern Intel Corporation June 2014  –  August 2014  (3 months) Tokyo, Japan Sales & Marketing Intern Bosch May 2013  –  May 2014  (1 year 1 month) yokohama, kanagawa, japan Sales & Marketing Intern Bosch May 2013  –  May 2014  (1 year 1 month) yokohama, kanagawa, japan Languages English Native or bilingual proficiency Japanese Professional working proficiency English Native or bilingual proficiency Japanese Professional working proficiency English Native or bilingual proficiency Japanese Professional working proficiency Native or bilingual proficiency Professional working proficiency Skills Microsoft Office Microsoft Excel Microsoft Word PowerPoint Customer Service Teamwork Public Speaking Marketing English Market Research Marketing Strategy Leadership Skills  Microsoft Office Microsoft Excel Microsoft Word PowerPoint Customer Service Teamwork Public Speaking Marketing English Market Research Marketing Strategy Leadership Microsoft Office Microsoft Excel Microsoft Word PowerPoint Customer Service Teamwork Public Speaking Marketing English Market Research Marketing Strategy Leadership Microsoft Office Microsoft Excel Microsoft Word PowerPoint Customer Service Teamwork Public Speaking Marketing English Market Research Marketing Strategy Leadership Education Temple University Bachelor of Science (B.S.),  International Business 2012  – 2014 De Anza College Transfer To Temple University, Japan Campus,  Business Administration and Management , General 2009  – 2012 Henry M. Gunn High High School Diploma 2005  – 2009 Activities and Societies:  Gunn Badminton Team Temple University Bachelor of Science (B.S.),  International Business 2012  – 2014 Temple University Bachelor of Science (B.S.),  International Business 2012  – 2014 Temple University Bachelor of Science (B.S.),  International Business 2012  – 2014 De Anza College Transfer To Temple University, Japan Campus,  Business Administration and Management , General 2009  – 2012 De Anza College Transfer To Temple University, Japan Campus,  Business Administration and Management , General 2009  – 2012 De Anza College Transfer To Temple University, Japan Campus,  Business Administration and Management , General 2009  – 2012 Henry M. Gunn High High School Diploma 2005  – 2009 Activities and Societies:  Gunn Badminton Team Henry M. Gunn High High School Diploma 2005  – 2009 Activities and Societies:  Gunn Badminton Team Henry M. Gunn High High School Diploma 2005  – 2009 Activities and Societies:  Gunn Badminton Team Honors & Awards 2013 Ted Mills Memorial Cup Temple University, Japan Campus April 2013 1st Place in Venture Business Pitch Competition \nWon the 2013 Ted Mills Memorial Cup Dean's List Temple University, Japan Campus TUJ Scholarship Recipient Temple University, Japan Campus 2013 Ted Mills Memorial Cup Temple University, Japan Campus April 2013 1st Place in Venture Business Pitch Competition \nWon the 2013 Ted Mills Memorial Cup 2013 Ted Mills Memorial Cup Temple University, Japan Campus April 2013 1st Place in Venture Business Pitch Competition \nWon the 2013 Ted Mills Memorial Cup 2013 Ted Mills Memorial Cup Temple University, Japan Campus April 2013 1st Place in Venture Business Pitch Competition \nWon the 2013 Ted Mills Memorial Cup Dean's List Temple University, Japan Campus Dean's List Temple University, Japan Campus Dean's List Temple University, Japan Campus TUJ Scholarship Recipient Temple University, Japan Campus TUJ Scholarship Recipient Temple University, Japan Campus TUJ Scholarship Recipient Temple University, Japan Campus ", "Summary I have just completed my undergraduate degree from the Eller College of Management at The University of Arizona. I am now working at Intel in Oregon. Summary I have just completed my undergraduate degree from the Eller College of Management at The University of Arizona. I am now working at Intel in Oregon. I have just completed my undergraduate degree from the Eller College of Management at The University of Arizona. I am now working at Intel in Oregon. I have just completed my undergraduate degree from the Eller College of Management at The University of Arizona. I am now working at Intel in Oregon. Experience Financial Analyst Intel Corporation September 2014  – Present (1 year) Hillsboro, Oregon I am working with the transactions for Corporate Services. Finance Intern Intel Corporation May 2013  –  August 2013  (4 months) Hillsboro, Oregon Worked with IT's investment efficiency metric. Appropriations Director University of Arizona Student Government August 2012  –  May 2013  (10 months) Allocated money to clubs from a set budget. ASUA Appropriations Director U of A Student Government August 2012  –  May 2013  (10 months) Experience with allocating money to various organizations \nGained familiarity with handling finances on a large scale Team Lead Golden Spoon Frozen Yogurt August 2008  –  July 2010  (2 years) Learned communication skills by working with customers and fellow employees Financial Analyst Intel Corporation September 2014  – Present (1 year) Hillsboro, Oregon I am working with the transactions for Corporate Services. Financial Analyst Intel Corporation September 2014  – Present (1 year) Hillsboro, Oregon I am working with the transactions for Corporate Services. Finance Intern Intel Corporation May 2013  –  August 2013  (4 months) Hillsboro, Oregon Worked with IT's investment efficiency metric. Finance Intern Intel Corporation May 2013  –  August 2013  (4 months) Hillsboro, Oregon Worked with IT's investment efficiency metric. Appropriations Director University of Arizona Student Government August 2012  –  May 2013  (10 months) Allocated money to clubs from a set budget. Appropriations Director University of Arizona Student Government August 2012  –  May 2013  (10 months) Allocated money to clubs from a set budget. ASUA Appropriations Director U of A Student Government August 2012  –  May 2013  (10 months) Experience with allocating money to various organizations \nGained familiarity with handling finances on a large scale ASUA Appropriations Director U of A Student Government August 2012  –  May 2013  (10 months) Experience with allocating money to various organizations \nGained familiarity with handling finances on a large scale Team Lead Golden Spoon Frozen Yogurt August 2008  –  July 2010  (2 years) Learned communication skills by working with customers and fellow employees Team Lead Golden Spoon Frozen Yogurt August 2008  –  July 2010  (2 years) Learned communication skills by working with customers and fellow employees Skills Social Media Social Media Marketing PowerPoint Microsoft Excel Microsoft Office Customer Service Microsoft Word Teamwork Public Speaking Time Management Social Networking Facebook Leadership Team Leadership Data Analysis Budgets Marketing See 2+     See less Skills  Social Media Social Media Marketing PowerPoint Microsoft Excel Microsoft Office Customer Service Microsoft Word Teamwork Public Speaking Time Management Social Networking Facebook Leadership Team Leadership Data Analysis Budgets Marketing See 2+     See less Social Media Social Media Marketing PowerPoint Microsoft Excel Microsoft Office Customer Service Microsoft Word Teamwork Public Speaking Time Management Social Networking Facebook Leadership Team Leadership Data Analysis Budgets Marketing See 2+     See less Social Media Social Media Marketing PowerPoint Microsoft Excel Microsoft Office Customer Service Microsoft Word Teamwork Public Speaking Time Management Social Networking Facebook Leadership Team Leadership Data Analysis Budgets Marketing See 2+     See less Education The University of Arizona, The University of Arizona Tucson AZ 85721 Bachelor's degree,  Business; Finance 2010  – 2014 I studied Finance at the Eller College of Management. Activities and Societies:  Chi Omega Fraternity ,  ASUA University of Arizona Finance , General 2010  – 2014 Along with studying for my financial degree I was part of Chi Omega Sorority for the four years I attended school and was active in out student government. Activities and Societies:  Chi Omega ,  ASUA The University of Arizona, The University of Arizona Tucson AZ 85721 Bachelor's degree,  Business; Finance 2010  – 2014 I studied Finance at the Eller College of Management. Activities and Societies:  Chi Omega Fraternity ,  ASUA The University of Arizona, The University of Arizona Tucson AZ 85721 Bachelor's degree,  Business; Finance 2010  – 2014 I studied Finance at the Eller College of Management. Activities and Societies:  Chi Omega Fraternity ,  ASUA The University of Arizona, The University of Arizona Tucson AZ 85721 Bachelor's degree,  Business; Finance 2010  – 2014 I studied Finance at the Eller College of Management. Activities and Societies:  Chi Omega Fraternity ,  ASUA University of Arizona Finance , General 2010  – 2014 Along with studying for my financial degree I was part of Chi Omega Sorority for the four years I attended school and was active in out student government. Activities and Societies:  Chi Omega ,  ASUA University of Arizona Finance , General 2010  – 2014 Along with studying for my financial degree I was part of Chi Omega Sorority for the four years I attended school and was active in out student government. Activities and Societies:  Chi Omega ,  ASUA University of Arizona Finance , General 2010  – 2014 Along with studying for my financial degree I was part of Chi Omega Sorority for the four years I attended school and was active in out student government. Activities and Societies:  Chi Omega ,  ASUA ", "Summary operations finance, ROI, NPV, capital, cost/inventory, finance systems, forecasting, statistical analysis, Monte Carlo. Specialties:semiconductor economics (both logic and memory), financial statement analysis, financial modeling, data manipulation, product cost, inventory issues, and excel VBA programming Summary operations finance, ROI, NPV, capital, cost/inventory, finance systems, forecasting, statistical analysis, Monte Carlo. Specialties:semiconductor economics (both logic and memory), financial statement analysis, financial modeling, data manipulation, product cost, inventory issues, and excel VBA programming operations finance, ROI, NPV, capital, cost/inventory, finance systems, forecasting, statistical analysis, Monte Carlo. Specialties:semiconductor economics (both logic and memory), financial statement analysis, financial modeling, data manipulation, product cost, inventory issues, and excel VBA programming operations finance, ROI, NPV, capital, cost/inventory, finance systems, forecasting, statistical analysis, Monte Carlo. Specialties:semiconductor economics (both logic and memory), financial statement analysis, financial modeling, data manipulation, product cost, inventory issues, and excel VBA programming Experience Financial Analyst Intel Corporation February 2013  – Present (2 years 7 months) Phoenix, Arizona Area Financial Analyst Intel Corporation September 2010  –  February 2013  (2 years 6 months) Competitive Intelligence Financial Analyst Intel Corporation June 2008  –  September 2010  (2 years 4 months) Sr. Financial Analyst Intel Corporation December 2004  –  June 2008  (3 years 7 months) Cost/Inventory Analyst Intel Corporation April 2003  –  December 2004  (1 year 9 months) Cost Analyst Intel Corporation June 2001  –  April 2003  (1 year 11 months) Financial Analyst Intel Corporation February 2013  – Present (2 years 7 months) Phoenix, Arizona Area Financial Analyst Intel Corporation February 2013  – Present (2 years 7 months) Phoenix, Arizona Area Financial Analyst Intel Corporation September 2010  –  February 2013  (2 years 6 months) Financial Analyst Intel Corporation September 2010  –  February 2013  (2 years 6 months) Competitive Intelligence Financial Analyst Intel Corporation June 2008  –  September 2010  (2 years 4 months) Competitive Intelligence Financial Analyst Intel Corporation June 2008  –  September 2010  (2 years 4 months) Sr. Financial Analyst Intel Corporation December 2004  –  June 2008  (3 years 7 months) Sr. Financial Analyst Intel Corporation December 2004  –  June 2008  (3 years 7 months) Cost/Inventory Analyst Intel Corporation April 2003  –  December 2004  (1 year 9 months) Cost/Inventory Analyst Intel Corporation April 2003  –  December 2004  (1 year 9 months) Cost Analyst Intel Corporation June 2001  –  April 2003  (1 year 11 months) Cost Analyst Intel Corporation June 2001  –  April 2003  (1 year 11 months) Languages French French French Skills Financial Modeling Data Manipulation Cost VBA Semiconductors Financial Analysis Excel Corporate Finance DCF Flash Memory Competitive Intelligence Statistical Modeling Business Strategy Team Leadership Microsoft Excel Cross-functional Team... Analysis Competitive Analysis Pricing Market Analysis Finance Financial Forecasting Forecasting Economics Strategy Data Analysis Strategic Financial... Mergers & Acquisitions Valuation Variance Analysis Management Managerial Finance See 17+     See less Skills  Financial Modeling Data Manipulation Cost VBA Semiconductors Financial Analysis Excel Corporate Finance DCF Flash Memory Competitive Intelligence Statistical Modeling Business Strategy Team Leadership Microsoft Excel Cross-functional Team... Analysis Competitive Analysis Pricing Market Analysis Finance Financial Forecasting Forecasting Economics Strategy Data Analysis Strategic Financial... Mergers & Acquisitions Valuation Variance Analysis Management Managerial Finance See 17+     See less Financial Modeling Data Manipulation Cost VBA Semiconductors Financial Analysis Excel Corporate Finance DCF Flash Memory Competitive Intelligence Statistical Modeling Business Strategy Team Leadership Microsoft Excel Cross-functional Team... Analysis Competitive Analysis Pricing Market Analysis Finance Financial Forecasting Forecasting Economics Strategy Data Analysis Strategic Financial... Mergers & Acquisitions Valuation Variance Analysis Management Managerial Finance See 17+     See less Financial Modeling Data Manipulation Cost VBA Semiconductors Financial Analysis Excel Corporate Finance DCF Flash Memory Competitive Intelligence Statistical Modeling Business Strategy Team Leadership Microsoft Excel Cross-functional Team... Analysis Competitive Analysis Pricing Market Analysis Finance Financial Forecasting Forecasting Economics Strategy Data Analysis Strategic Financial... Mergers & Acquisitions Valuation Variance Analysis Management Managerial Finance See 17+     See less Education Columbia University - Fu Foundation School of Engineering and Applied Science MS 2008  – 2011 Brigham Young University Masters & Bachelors 1994  – 2001 Columbia University - Fu Foundation School of Engineering and Applied Science MS 2008  – 2011 Columbia University - Fu Foundation School of Engineering and Applied Science MS 2008  – 2011 Columbia University - Fu Foundation School of Engineering and Applied Science MS 2008  – 2011 Brigham Young University Masters & Bachelors 1994  – 2001 Brigham Young University Masters & Bachelors 1994  – 2001 Brigham Young University Masters & Bachelors 1994  – 2001 Honors & Awards ", "Experience Financial Analyst Intel Corporation July 2014  – Present (1 year 2 months) San Francisco Bay Area As a financial analyst in the Mobile & Communications Group at Intel, I am responsible for creating and maintaining the FP&A processes used for consolidating financial data in the forecasting and close cycles. These processes enable detailed analyses of historical and current close data, which are used to understand market trends and assist high-level forecasting. On an individual level, this position inspires me to constantly work on developing new ways in which both granular and high-level financial analysis can influence business decisions. Student UC Berkeley August 2010  –  May 2014  (3 years 10 months) San Francisco Bay Area B.A. Economics, May 2014 Finance Intern Intel Corporation May 2013  –  August 2013  (4 months) san francisco bay area •\tDeveloped FP&A and breakeven analysis procedures to assess business opportunities \n•\tCreated market model to recommend strategy for Intel in the tablet market \n•\tPresented comprehensive strategy recommendation to 20+ senior finance leaders \n•\tReceived full-time job offer based on successful internship performance Compliance/Risk Management Summer Intern Visa June 2012  –  August 2012  (3 months) Foster City, CA •Manage projects reported to the Visa, Inc. Board of Directors \n•Communicate interdepartmentally to guarantee project accuracy and efficiency \n•Organize and execute anti-bribery compliance training for international Visa affiliates \n•Streamline data mining methods to flag important client risks Wealth Management Intern Bank of America Merrill Lynch October 2010  –  May 2011  (8 months) San Francisco Bay Area •\tResearched and analyzed client portfolio opportunities \n•\tConsolidated client portfolio material into easily understandable spreadsheets \n•\tCreated and critiqued presentations for potential clients and professional organizations Financial Analyst Intel Corporation July 2014  – Present (1 year 2 months) San Francisco Bay Area As a financial analyst in the Mobile & Communications Group at Intel, I am responsible for creating and maintaining the FP&A processes used for consolidating financial data in the forecasting and close cycles. These processes enable detailed analyses of historical and current close data, which are used to understand market trends and assist high-level forecasting. On an individual level, this position inspires me to constantly work on developing new ways in which both granular and high-level financial analysis can influence business decisions. Financial Analyst Intel Corporation July 2014  – Present (1 year 2 months) San Francisco Bay Area As a financial analyst in the Mobile & Communications Group at Intel, I am responsible for creating and maintaining the FP&A processes used for consolidating financial data in the forecasting and close cycles. These processes enable detailed analyses of historical and current close data, which are used to understand market trends and assist high-level forecasting. On an individual level, this position inspires me to constantly work on developing new ways in which both granular and high-level financial analysis can influence business decisions. Student UC Berkeley August 2010  –  May 2014  (3 years 10 months) San Francisco Bay Area B.A. Economics, May 2014 Student UC Berkeley August 2010  –  May 2014  (3 years 10 months) San Francisco Bay Area B.A. Economics, May 2014 Finance Intern Intel Corporation May 2013  –  August 2013  (4 months) san francisco bay area •\tDeveloped FP&A and breakeven analysis procedures to assess business opportunities \n•\tCreated market model to recommend strategy for Intel in the tablet market \n•\tPresented comprehensive strategy recommendation to 20+ senior finance leaders \n•\tReceived full-time job offer based on successful internship performance Finance Intern Intel Corporation May 2013  –  August 2013  (4 months) san francisco bay area •\tDeveloped FP&A and breakeven analysis procedures to assess business opportunities \n•\tCreated market model to recommend strategy for Intel in the tablet market \n•\tPresented comprehensive strategy recommendation to 20+ senior finance leaders \n•\tReceived full-time job offer based on successful internship performance Compliance/Risk Management Summer Intern Visa June 2012  –  August 2012  (3 months) Foster City, CA •Manage projects reported to the Visa, Inc. Board of Directors \n•Communicate interdepartmentally to guarantee project accuracy and efficiency \n•Organize and execute anti-bribery compliance training for international Visa affiliates \n•Streamline data mining methods to flag important client risks Compliance/Risk Management Summer Intern Visa June 2012  –  August 2012  (3 months) Foster City, CA •Manage projects reported to the Visa, Inc. Board of Directors \n•Communicate interdepartmentally to guarantee project accuracy and efficiency \n•Organize and execute anti-bribery compliance training for international Visa affiliates \n•Streamline data mining methods to flag important client risks Wealth Management Intern Bank of America Merrill Lynch October 2010  –  May 2011  (8 months) San Francisco Bay Area •\tResearched and analyzed client portfolio opportunities \n•\tConsolidated client portfolio material into easily understandable spreadsheets \n•\tCreated and critiqued presentations for potential clients and professional organizations Wealth Management Intern Bank of America Merrill Lynch October 2010  –  May 2011  (8 months) San Francisco Bay Area •\tResearched and analyzed client portfolio opportunities \n•\tConsolidated client portfolio material into easily understandable spreadsheets \n•\tCreated and critiqued presentations for potential clients and professional organizations Skills Project Management Microsoft Excel Finance Data Analysis PowerPoint Microsoft Office Research Financial Modeling Microsoft Word Public Speaking Event Planning Financial Analysis Analysis Market Research Economics Statistics Corporate FP&A Break-even Analysis Market Modeling Tablets Client Relations Skills Technical Presentations See 7+     See less Skills  Project Management Microsoft Excel Finance Data Analysis PowerPoint Microsoft Office Research Financial Modeling Microsoft Word Public Speaking Event Planning Financial Analysis Analysis Market Research Economics Statistics Corporate FP&A Break-even Analysis Market Modeling Tablets Client Relations Skills Technical Presentations See 7+     See less Project Management Microsoft Excel Finance Data Analysis PowerPoint Microsoft Office Research Financial Modeling Microsoft Word Public Speaking Event Planning Financial Analysis Analysis Market Research Economics Statistics Corporate FP&A Break-even Analysis Market Modeling Tablets Client Relations Skills Technical Presentations See 7+     See less Project Management Microsoft Excel Finance Data Analysis PowerPoint Microsoft Office Research Financial Modeling Microsoft Word Public Speaking Event Planning Financial Analysis Analysis Market Research Economics Statistics Corporate FP&A Break-even Analysis Market Modeling Tablets Client Relations Skills Technical Presentations See 7+     See less Education University of California, Berkeley B.A.,  Economics 2010  – 2014 Activities and Societies:  Delta Kappa Epsilon Fraternity\nCal Racquetball Team\nFreshman Sophomore Business Club\nLeadership Award Scholar Association (Alumni Scholars)\nRotaract Service Club University of California, Berkeley B.A.,  Economics 2010  – 2014 Activities and Societies:  Delta Kappa Epsilon Fraternity\nCal Racquetball Team\nFreshman Sophomore Business Club\nLeadership Award Scholar Association (Alumni Scholars)\nRotaract Service Club University of California, Berkeley B.A.,  Economics 2010  – 2014 Activities and Societies:  Delta Kappa Epsilon Fraternity\nCal Racquetball Team\nFreshman Sophomore Business Club\nLeadership Award Scholar Association (Alumni Scholars)\nRotaract Service Club University of California, Berkeley B.A.,  Economics 2010  – 2014 Activities and Societies:  Delta Kappa Epsilon Fraternity\nCal Racquetball Team\nFreshman Sophomore Business Club\nLeadership Award Scholar Association (Alumni Scholars)\nRotaract Service Club ", "Summary . Summary . . . Experience Financial Analyst Intel Corporation May 2012  – Present (3 years 4 months) Hillsboro, OR Finance Intern Intel Corporation May 2011  –  August 2011  (4 months) Hillsboro, OR Process Engineer RMT INTERNATIONAL September 2008  –  August 2010  (2 years) - As part of a team, completed basic engineering design of a full scale $300 million polysilicon manufacturing plant to be built in Malaysia \n- Communicated and interacted with international clients to ensure satisfaction with past projects \n- Travelled to China to oversee construction and start-up of a polysilicon manufacturing plant \n- Travelled to China to run training classes for inexperienced international workers on the operation of a polysilicon manufacturing plant \n- Fixed design problems and answered clarifications about previous design projects to ensure optimal performance Chemistry Intern FEI Company June 2008  –  August 2008  (3 months) - Developed and conducted an experiment aimed at reducing operating cost of equipment \n- Responsible for using scanning electron microscopes (SEM) to analyze all samples of my work group \n- Modeled nano-scale samples on computers for use in future experiments Chemical Engineering Intern CH2M HILL June 2007  –  August 2007  (3 months) - Learned and utilized Pipe-Flo program to design chemical systems and select appropriate pumps for projects \n- Member of a team that designed a solar fab \n- Responsible for determining chemical use and room occupancy codes for entire project Research Assistant LEGACY HEALTH SYSTEM June 2006  –  August 2006  (3 months) - Performed and analyzed experiments using Real-Time Polymerase Chain Reaction equipment \n- Studied miRNA level changes that led to increased protection following an ischemic event \n- Delivered an oral presentation summarizing the findings of my analysis to the entire research group Financial Analyst Intel Corporation May 2012  – Present (3 years 4 months) Hillsboro, OR Financial Analyst Intel Corporation May 2012  – Present (3 years 4 months) Hillsboro, OR Finance Intern Intel Corporation May 2011  –  August 2011  (4 months) Hillsboro, OR Finance Intern Intel Corporation May 2011  –  August 2011  (4 months) Hillsboro, OR Process Engineer RMT INTERNATIONAL September 2008  –  August 2010  (2 years) - As part of a team, completed basic engineering design of a full scale $300 million polysilicon manufacturing plant to be built in Malaysia \n- Communicated and interacted with international clients to ensure satisfaction with past projects \n- Travelled to China to oversee construction and start-up of a polysilicon manufacturing plant \n- Travelled to China to run training classes for inexperienced international workers on the operation of a polysilicon manufacturing plant \n- Fixed design problems and answered clarifications about previous design projects to ensure optimal performance Process Engineer RMT INTERNATIONAL September 2008  –  August 2010  (2 years) - As part of a team, completed basic engineering design of a full scale $300 million polysilicon manufacturing plant to be built in Malaysia \n- Communicated and interacted with international clients to ensure satisfaction with past projects \n- Travelled to China to oversee construction and start-up of a polysilicon manufacturing plant \n- Travelled to China to run training classes for inexperienced international workers on the operation of a polysilicon manufacturing plant \n- Fixed design problems and answered clarifications about previous design projects to ensure optimal performance Chemistry Intern FEI Company June 2008  –  August 2008  (3 months) - Developed and conducted an experiment aimed at reducing operating cost of equipment \n- Responsible for using scanning electron microscopes (SEM) to analyze all samples of my work group \n- Modeled nano-scale samples on computers for use in future experiments Chemistry Intern FEI Company June 2008  –  August 2008  (3 months) - Developed and conducted an experiment aimed at reducing operating cost of equipment \n- Responsible for using scanning electron microscopes (SEM) to analyze all samples of my work group \n- Modeled nano-scale samples on computers for use in future experiments Chemical Engineering Intern CH2M HILL June 2007  –  August 2007  (3 months) - Learned and utilized Pipe-Flo program to design chemical systems and select appropriate pumps for projects \n- Member of a team that designed a solar fab \n- Responsible for determining chemical use and room occupancy codes for entire project Chemical Engineering Intern CH2M HILL June 2007  –  August 2007  (3 months) - Learned and utilized Pipe-Flo program to design chemical systems and select appropriate pumps for projects \n- Member of a team that designed a solar fab \n- Responsible for determining chemical use and room occupancy codes for entire project Research Assistant LEGACY HEALTH SYSTEM June 2006  –  August 2006  (3 months) - Performed and analyzed experiments using Real-Time Polymerase Chain Reaction equipment \n- Studied miRNA level changes that led to increased protection following an ischemic event \n- Delivered an oral presentation summarizing the findings of my analysis to the entire research group Research Assistant LEGACY HEALTH SYSTEM June 2006  –  August 2006  (3 months) - Performed and analyzed experiments using Real-Time Polymerase Chain Reaction equipment \n- Studied miRNA level changes that led to increased protection following an ischemic event \n- Delivered an oral presentation summarizing the findings of my analysis to the entire research group Skills Microsoft Office Data Analysis Financial Analysis Financial Modeling DMAIC Project Management Skills  Microsoft Office Data Analysis Financial Analysis Financial Modeling DMAIC Project Management Microsoft Office Data Analysis Financial Analysis Financial Modeling DMAIC Project Management Microsoft Office Data Analysis Financial Analysis Financial Modeling DMAIC Project Management Education Willamette University MBA Master,  Business Administration; Finance 2010  – 2012 Activities and Societies:  Atkinson Finance Association ,  National Association for Women MBAs Washington University in St. Louis Bachelor of Science Degree,  Chemical Engineering 2004  – 2008 Activities and Societies:  Varsity softball ,  Society of Women Engineers ,  American Institute of Chemical Engineers Willamette University MBA Master,  Business Administration; Finance 2010  – 2012 Activities and Societies:  Atkinson Finance Association ,  National Association for Women MBAs Willamette University MBA Master,  Business Administration; Finance 2010  – 2012 Activities and Societies:  Atkinson Finance Association ,  National Association for Women MBAs Willamette University MBA Master,  Business Administration; Finance 2010  – 2012 Activities and Societies:  Atkinson Finance Association ,  National Association for Women MBAs Washington University in St. Louis Bachelor of Science Degree,  Chemical Engineering 2004  – 2008 Activities and Societies:  Varsity softball ,  Society of Women Engineers ,  American Institute of Chemical Engineers Washington University in St. Louis Bachelor of Science Degree,  Chemical Engineering 2004  – 2008 Activities and Societies:  Varsity softball ,  Society of Women Engineers ,  American Institute of Chemical Engineers Washington University in St. Louis Bachelor of Science Degree,  Chemical Engineering 2004  – 2008 Activities and Societies:  Varsity softball ,  Society of Women Engineers ,  American Institute of Chemical Engineers Honors & Awards Additional Honors & Awards - Second team All-American 2005 softball \n- AIChE Donald F. Othmer Sophomore Academic Excellence Award \n- Antoinette Frances Dames Award for academic excellence \n- Klemm Outstanding Junior Award \n- SS &amp; IMF Marsden Prize – Energy, Environmental and Chemical Engineering Additional Honors & Awards - Second team All-American 2005 softball \n- AIChE Donald F. Othmer Sophomore Academic Excellence Award \n- Antoinette Frances Dames Award for academic excellence \n- Klemm Outstanding Junior Award \n- SS &amp; IMF Marsden Prize – Energy, Environmental and Chemical Engineering Additional Honors & Awards - Second team All-American 2005 softball \n- AIChE Donald F. Othmer Sophomore Academic Excellence Award \n- Antoinette Frances Dames Award for academic excellence \n- Klemm Outstanding Junior Award \n- SS &amp; IMF Marsden Prize – Energy, Environmental and Chemical Engineering Additional Honors & Awards - Second team All-American 2005 softball \n- AIChE Donald F. Othmer Sophomore Academic Excellence Award \n- Antoinette Frances Dames Award for academic excellence \n- Klemm Outstanding Junior Award \n- SS &amp; IMF Marsden Prize – Energy, Environmental and Chemical Engineering ", "Summary Before I fell in love with Economics at UCSB, I planned to major in the Fine Arts. I was drawn to the studio for the same reasons that I'm drawn to certain career opportunities today: the ability to take responsibility of my assignments, immerse myself in the details, give and receive meaningful feedback, and think creatively as an individual and as part of a team. \n \nMy career interests center around Finance and Tech. Given my most recent work experiences, my interests include institutional portfolio management, corporate development and strategy, revenue and financial forecasting, cost-benefit analysis, corporate brand and partner marketing, and wearables/IoT. An MBA is one of my career goals.  \n \nStrengths Finder 2.0: Futuristic, Focus, Achiever, Deliberative, Relator. 60% Execution and 40% Strategy. Summary Before I fell in love with Economics at UCSB, I planned to major in the Fine Arts. I was drawn to the studio for the same reasons that I'm drawn to certain career opportunities today: the ability to take responsibility of my assignments, immerse myself in the details, give and receive meaningful feedback, and think creatively as an individual and as part of a team. \n \nMy career interests center around Finance and Tech. Given my most recent work experiences, my interests include institutional portfolio management, corporate development and strategy, revenue and financial forecasting, cost-benefit analysis, corporate brand and partner marketing, and wearables/IoT. An MBA is one of my career goals.  \n \nStrengths Finder 2.0: Futuristic, Focus, Achiever, Deliberative, Relator. 60% Execution and 40% Strategy. Before I fell in love with Economics at UCSB, I planned to major in the Fine Arts. I was drawn to the studio for the same reasons that I'm drawn to certain career opportunities today: the ability to take responsibility of my assignments, immerse myself in the details, give and receive meaningful feedback, and think creatively as an individual and as part of a team. \n \nMy career interests center around Finance and Tech. Given my most recent work experiences, my interests include institutional portfolio management, corporate development and strategy, revenue and financial forecasting, cost-benefit analysis, corporate brand and partner marketing, and wearables/IoT. An MBA is one of my career goals.  \n \nStrengths Finder 2.0: Futuristic, Focus, Achiever, Deliberative, Relator. 60% Execution and 40% Strategy. Before I fell in love with Economics at UCSB, I planned to major in the Fine Arts. I was drawn to the studio for the same reasons that I'm drawn to certain career opportunities today: the ability to take responsibility of my assignments, immerse myself in the details, give and receive meaningful feedback, and think creatively as an individual and as part of a team. \n \nMy career interests center around Finance and Tech. Given my most recent work experiences, my interests include institutional portfolio management, corporate development and strategy, revenue and financial forecasting, cost-benefit analysis, corporate brand and partner marketing, and wearables/IoT. An MBA is one of my career goals.  \n \nStrengths Finder 2.0: Futuristic, Focus, Achiever, Deliberative, Relator. 60% Execution and 40% Strategy. Experience Financial Analyst Intel Corporation January 2015  – Present (8 months) Global Marketing Group/Partner Brand Marketing Research Analyst UCSB Economic Forecast Project September 2013  –  May 2014  (9 months) Santa Barbara, California Area The UCSB Economic Forecast Project collects and analyzes relevant business data for the Santa Barbara area. Supporting the chair of the Economics department, undergraduate research analysts help produce an annual publication that covers local finance, labor trends, and real estate. Group and Individual Economics Campus Tutor UCSB Campus Learning Assistance Services (CLAS) June 2011  –  March 2014  (2 years 10 months) Santa Barbara, California Area CLAS is an on campus resource for students who desire additional academic assistance. I taught 2-4 sessions per week per quarter in which I presented topics to groups of 20-45 students, in addition to private one-on-one tutoring. My sessions supplemented specific courses at UCSB like Econ 10A (Intermediate Micro-Economic Theory). Summer Analyst - Business Finance Intel Corporation June 2013  –  September 2013  (4 months) Portland, Oregon Area At Intel, my summer deliverable was to calculate the ROI of 2012-2013 direct sales campaigns and use this data to make investment suggestions for the coming year. My recommendations were taken into Plan 2014. Commercial Real Estate Appraisal Intern Pacific Commercial Group December 2012  –  February 2013  (3 months) Newport Beach, California Pacific Commercial Group is a leading commercial real estate appraisal firm in Southern California. I constructed discounted cash flows, assessed comparable property sales, and analyzed the feasibility of development projects. I also produced tailored write-ups on the Economic status of the Los Angeles area for individual appraisal reports. Product Management and Editorial Intern FindTheBest June 2012  –  August 2012  (3 months) Summerland, California FindTheBest.com is a search engine comparison website backed by Kleiner Perkins. As a product management intern at FTB, I designed and updated comparisons within the Lifestyle and Finance verticals. I also helped manage the site’s editorial content, which included rewriting buyer guides for Search Engine Optimization purposes. Both responsibilities required thorough market research performed at a fast pace. Event Coordinator Intern Gorilla Marketing Promotional Products July 2011  –  September 2011  (3 months) Riverside, CA Gorilla Marketing is a screen-printing business that works primarily with the UCLA Athletic and Alumni departments. Responsibilities of my internship included communicating with multiple vendors, reaching out to new potential clients, and coordinating other employees within the Gorilla Marketing office. Data Analyst Intern and Volunteer Direct Relief International February 2011  –  June 2011  (5 months) Goleta, California Direct Relief International is a nonprofit medical assistance and disaster relief agency. My macro-economics professor recruited me to a team of interns. Our responsibility was to organize an extensive collection of world health statistics. My specific assignment was to convert datasets into usable formats for an interactive map and provide an analysis of the results. Concept, Founder, and Webmaster KnowTheCurve July 2009  –  September 2010  (1 year 3 months) Corona del Mar, California KnowTheCurve's mission is to spread awareness among families with school-age children (as the early detection of scoliosis can prevent future physical handicap). I’ve interviewed an assortment of former scoliosis patients, from the comedian Andrew Pelosi, the fiction writer Victoria Redel, and the nationally ranked Squash player Elizabeth Golden. Their interviews are posted on KnowTheCurve.com among other resources. Financial Analyst Intel Corporation January 2015  – Present (8 months) Global Marketing Group/Partner Brand Marketing Financial Analyst Intel Corporation January 2015  – Present (8 months) Global Marketing Group/Partner Brand Marketing Research Analyst UCSB Economic Forecast Project September 2013  –  May 2014  (9 months) Santa Barbara, California Area The UCSB Economic Forecast Project collects and analyzes relevant business data for the Santa Barbara area. Supporting the chair of the Economics department, undergraduate research analysts help produce an annual publication that covers local finance, labor trends, and real estate. Research Analyst UCSB Economic Forecast Project September 2013  –  May 2014  (9 months) Santa Barbara, California Area The UCSB Economic Forecast Project collects and analyzes relevant business data for the Santa Barbara area. Supporting the chair of the Economics department, undergraduate research analysts help produce an annual publication that covers local finance, labor trends, and real estate. Group and Individual Economics Campus Tutor UCSB Campus Learning Assistance Services (CLAS) June 2011  –  March 2014  (2 years 10 months) Santa Barbara, California Area CLAS is an on campus resource for students who desire additional academic assistance. I taught 2-4 sessions per week per quarter in which I presented topics to groups of 20-45 students, in addition to private one-on-one tutoring. My sessions supplemented specific courses at UCSB like Econ 10A (Intermediate Micro-Economic Theory). Group and Individual Economics Campus Tutor UCSB Campus Learning Assistance Services (CLAS) June 2011  –  March 2014  (2 years 10 months) Santa Barbara, California Area CLAS is an on campus resource for students who desire additional academic assistance. I taught 2-4 sessions per week per quarter in which I presented topics to groups of 20-45 students, in addition to private one-on-one tutoring. My sessions supplemented specific courses at UCSB like Econ 10A (Intermediate Micro-Economic Theory). Summer Analyst - Business Finance Intel Corporation June 2013  –  September 2013  (4 months) Portland, Oregon Area At Intel, my summer deliverable was to calculate the ROI of 2012-2013 direct sales campaigns and use this data to make investment suggestions for the coming year. My recommendations were taken into Plan 2014. Summer Analyst - Business Finance Intel Corporation June 2013  –  September 2013  (4 months) Portland, Oregon Area At Intel, my summer deliverable was to calculate the ROI of 2012-2013 direct sales campaigns and use this data to make investment suggestions for the coming year. My recommendations were taken into Plan 2014. Commercial Real Estate Appraisal Intern Pacific Commercial Group December 2012  –  February 2013  (3 months) Newport Beach, California Pacific Commercial Group is a leading commercial real estate appraisal firm in Southern California. I constructed discounted cash flows, assessed comparable property sales, and analyzed the feasibility of development projects. I also produced tailored write-ups on the Economic status of the Los Angeles area for individual appraisal reports. Commercial Real Estate Appraisal Intern Pacific Commercial Group December 2012  –  February 2013  (3 months) Newport Beach, California Pacific Commercial Group is a leading commercial real estate appraisal firm in Southern California. I constructed discounted cash flows, assessed comparable property sales, and analyzed the feasibility of development projects. I also produced tailored write-ups on the Economic status of the Los Angeles area for individual appraisal reports. Product Management and Editorial Intern FindTheBest June 2012  –  August 2012  (3 months) Summerland, California FindTheBest.com is a search engine comparison website backed by Kleiner Perkins. As a product management intern at FTB, I designed and updated comparisons within the Lifestyle and Finance verticals. I also helped manage the site’s editorial content, which included rewriting buyer guides for Search Engine Optimization purposes. Both responsibilities required thorough market research performed at a fast pace. Product Management and Editorial Intern FindTheBest June 2012  –  August 2012  (3 months) Summerland, California FindTheBest.com is a search engine comparison website backed by Kleiner Perkins. As a product management intern at FTB, I designed and updated comparisons within the Lifestyle and Finance verticals. I also helped manage the site’s editorial content, which included rewriting buyer guides for Search Engine Optimization purposes. Both responsibilities required thorough market research performed at a fast pace. Event Coordinator Intern Gorilla Marketing Promotional Products July 2011  –  September 2011  (3 months) Riverside, CA Gorilla Marketing is a screen-printing business that works primarily with the UCLA Athletic and Alumni departments. Responsibilities of my internship included communicating with multiple vendors, reaching out to new potential clients, and coordinating other employees within the Gorilla Marketing office. Event Coordinator Intern Gorilla Marketing Promotional Products July 2011  –  September 2011  (3 months) Riverside, CA Gorilla Marketing is a screen-printing business that works primarily with the UCLA Athletic and Alumni departments. Responsibilities of my internship included communicating with multiple vendors, reaching out to new potential clients, and coordinating other employees within the Gorilla Marketing office. Data Analyst Intern and Volunteer Direct Relief International February 2011  –  June 2011  (5 months) Goleta, California Direct Relief International is a nonprofit medical assistance and disaster relief agency. My macro-economics professor recruited me to a team of interns. Our responsibility was to organize an extensive collection of world health statistics. My specific assignment was to convert datasets into usable formats for an interactive map and provide an analysis of the results. Data Analyst Intern and Volunteer Direct Relief International February 2011  –  June 2011  (5 months) Goleta, California Direct Relief International is a nonprofit medical assistance and disaster relief agency. My macro-economics professor recruited me to a team of interns. Our responsibility was to organize an extensive collection of world health statistics. My specific assignment was to convert datasets into usable formats for an interactive map and provide an analysis of the results. Concept, Founder, and Webmaster KnowTheCurve July 2009  –  September 2010  (1 year 3 months) Corona del Mar, California KnowTheCurve's mission is to spread awareness among families with school-age children (as the early detection of scoliosis can prevent future physical handicap). I’ve interviewed an assortment of former scoliosis patients, from the comedian Andrew Pelosi, the fiction writer Victoria Redel, and the nationally ranked Squash player Elizabeth Golden. Their interviews are posted on KnowTheCurve.com among other resources. Concept, Founder, and Webmaster KnowTheCurve July 2009  –  September 2010  (1 year 3 months) Corona del Mar, California KnowTheCurve's mission is to spread awareness among families with school-age children (as the early detection of scoliosis can prevent future physical handicap). I’ve interviewed an assortment of former scoliosis patients, from the comedian Andrew Pelosi, the fiction writer Victoria Redel, and the nationally ranked Squash player Elizabeth Golden. Their interviews are posted on KnowTheCurve.com among other resources. Skills Google Adwords SEO Social Networking Content Development Editing Entrepreneurship Mac OS X Technical Writing Public Speaking Academic Tutoring Skills  Google Adwords SEO Social Networking Content Development Editing Entrepreneurship Mac OS X Technical Writing Public Speaking Academic Tutoring Google Adwords SEO Social Networking Content Development Editing Entrepreneurship Mac OS X Technical Writing Public Speaking Academic Tutoring Google Adwords SEO Social Networking Content Development Editing Entrepreneurship Mac OS X Technical Writing Public Speaking Academic Tutoring Education University of California, Santa Barbara Bachelor of Arts (BA),  Economics 2010  – 2014 Università Commerciale 'Luigi Bocconi' / Bocconi University Exchange Student,  Finance and Economics 2013  – 2013 Sage Hill School High School 2006  – 2010 University of California, Santa Barbara Bachelor of Arts (BA),  Economics 2010  – 2014 University of California, Santa Barbara Bachelor of Arts (BA),  Economics 2010  – 2014 University of California, Santa Barbara Bachelor of Arts (BA),  Economics 2010  – 2014 Università Commerciale 'Luigi Bocconi' / Bocconi University Exchange Student,  Finance and Economics 2013  – 2013 Università Commerciale 'Luigi Bocconi' / Bocconi University Exchange Student,  Finance and Economics 2013  – 2013 Università Commerciale 'Luigi Bocconi' / Bocconi University Exchange Student,  Finance and Economics 2013  – 2013 Sage Hill School High School 2006  – 2010 Sage Hill School High School 2006  – 2010 Sage Hill School High School 2006  – 2010 Honors & Awards UCSB Fellows Program UCSB Department of Economics and Accounting January 2013 Sean P. Weld Merit Scholarship for Entrepreneurship UCSB Department of Economics and Accounting May 2012 Selected for the Final Four Round of Candidates Phillip A. Babcock Lecture Series Selection Committee UCSB Economics Department September 2013 Ongoing lecture series to commemorate the loss of UCSB's Professor Babcock. Asked to join the committee, as an undergraduate student contributor, to help choose our inaugural speaker. Phillip A. Babcock Inaugural Lecture: Master of Ceremonies January 2014 Introduced guest lecturer, MacArthur Fellow and TED speaker Colin Camerer. Transitioned lecture between Q&A session and reception. Student Speaker, Annual UCSB Trustee Summit February 2014 Career Connection Panel  UCSB Commencement Student Speaker June 2014 UCSB Fellows Program UCSB Department of Economics and Accounting January 2013 UCSB Fellows Program UCSB Department of Economics and Accounting January 2013 UCSB Fellows Program UCSB Department of Economics and Accounting January 2013 Sean P. Weld Merit Scholarship for Entrepreneurship UCSB Department of Economics and Accounting May 2012 Selected for the Final Four Round of Candidates Sean P. Weld Merit Scholarship for Entrepreneurship UCSB Department of Economics and Accounting May 2012 Selected for the Final Four Round of Candidates Sean P. Weld Merit Scholarship for Entrepreneurship UCSB Department of Economics and Accounting May 2012 Selected for the Final Four Round of Candidates Phillip A. Babcock Lecture Series Selection Committee UCSB Economics Department September 2013 Ongoing lecture series to commemorate the loss of UCSB's Professor Babcock. Asked to join the committee, as an undergraduate student contributor, to help choose our inaugural speaker. Phillip A. Babcock Lecture Series Selection Committee UCSB Economics Department September 2013 Ongoing lecture series to commemorate the loss of UCSB's Professor Babcock. Asked to join the committee, as an undergraduate student contributor, to help choose our inaugural speaker. Phillip A. Babcock Lecture Series Selection Committee UCSB Economics Department September 2013 Ongoing lecture series to commemorate the loss of UCSB's Professor Babcock. Asked to join the committee, as an undergraduate student contributor, to help choose our inaugural speaker. Phillip A. Babcock Inaugural Lecture: Master of Ceremonies January 2014 Introduced guest lecturer, MacArthur Fellow and TED speaker Colin Camerer. Transitioned lecture between Q&A session and reception. Phillip A. Babcock Inaugural Lecture: Master of Ceremonies January 2014 Introduced guest lecturer, MacArthur Fellow and TED speaker Colin Camerer. Transitioned lecture between Q&A session and reception. Phillip A. Babcock Inaugural Lecture: Master of Ceremonies January 2014 Introduced guest lecturer, MacArthur Fellow and TED speaker Colin Camerer. Transitioned lecture between Q&A session and reception. Student Speaker, Annual UCSB Trustee Summit February 2014 Career Connection Panel  Student Speaker, Annual UCSB Trustee Summit February 2014 Career Connection Panel  Student Speaker, Annual UCSB Trustee Summit February 2014 Career Connection Panel  UCSB Commencement Student Speaker June 2014 UCSB Commencement Student Speaker June 2014 UCSB Commencement Student Speaker June 2014 ", "Experience Financial Analyst Intel Corporation March 2011  – Present (4 years 6 months) Sr. Financial Budget Analyst Aon Corporation, a provider of risk management services, insurance brokerage, and consulting 2007  –  2010  (3 years) Sr. General Accountant Aon Corporation 2003  –  2007  (4 years) Staff Accountant Aon Corporation 2002  –  2003  (1 year) Financial Analyst Intel Corporation March 2011  – Present (4 years 6 months) Financial Analyst Intel Corporation March 2011  – Present (4 years 6 months) Sr. Financial Budget Analyst Aon Corporation, a provider of risk management services, insurance brokerage, and consulting 2007  –  2010  (3 years) Sr. Financial Budget Analyst Aon Corporation, a provider of risk management services, insurance brokerage, and consulting 2007  –  2010  (3 years) Sr. General Accountant Aon Corporation 2003  –  2007  (4 years) Sr. General Accountant Aon Corporation 2003  –  2007  (4 years) Staff Accountant Aon Corporation 2002  –  2003  (1 year) Staff Accountant Aon Corporation 2002  –  2003  (1 year) Education San Jose State University B.S.,  Accounting 1998  – 2001 San Jose State University B.S.,  Accounting 1998  – 2001 San Jose State University B.S.,  Accounting 1998  – 2001 San Jose State University B.S.,  Accounting 1998  – 2001 ", "Experience Financial Analyst Intel Corporation February 2006  – Present (9 years 7 months) Financial Analyst Freescale Semiconductor September 2005  –  February 2006  (6 months) Application Consultant Reuters StockVal January 2005  –  September 2005  (9 months) Financial Analyst Intel Corporation February 2006  – Present (9 years 7 months) Financial Analyst Intel Corporation February 2006  – Present (9 years 7 months) Financial Analyst Freescale Semiconductor September 2005  –  February 2006  (6 months) Financial Analyst Freescale Semiconductor September 2005  –  February 2006  (6 months) Application Consultant Reuters StockVal January 2005  –  September 2005  (9 months) Application Consultant Reuters StockVal January 2005  –  September 2005  (9 months) Education University of Arizona, Eller College of Management MBA 2008  – 2009 Arizona State University - W. P. Carey School of Business Bachelors,  Finance 2000  – 2004 University of Arizona, Eller College of Management MBA 2008  – 2009 University of Arizona, Eller College of Management MBA 2008  – 2009 University of Arizona, Eller College of Management MBA 2008  – 2009 Arizona State University - W. P. Carey School of Business Bachelors,  Finance 2000  – 2004 Arizona State University - W. P. Carey School of Business Bachelors,  Finance 2000  – 2004 Arizona State University - W. P. Carey School of Business Bachelors,  Finance 2000  – 2004 ", "Experience Financial Analyst Intel Corporation July 2014  – Present (1 year 2 months) Phoenix, Arizona Area Financial Planning and Analysis (FP&A) \n- Drive monthly close process, including partnering with key finance and operations personnel to identify variances and drive decisions across the internal organization. \n \n- Partner with the business to provide strategic recommendations on management of forecast and spending.  \n \n- Leverage strong Excel skills to improve processes and create efficiencies in weekly and monthly reporting of actuals, headcount, and close data. MBA Candidate | Class of 2014 Brigham Young University August 2012  –  April 2014  (1 year 9 months) Provo, Utah Area - Member of BYU's Silver Fund team (2014) - Assisted in managing $2M in assets \n- Member of Leadership Council (2014) MBA Finance Intern Intel Corporation May 2013  –  August 2013  (4 months) Chandler, Arizona Developed recommendations for a Make vs Buy analysis on two IP blocks, which would result in a savings of $4.3M Business Development Director Bradford Consulting Engineers, Inc, April 2009  –  July 2012  (3 years 4 months) Portland, Oregon Area Financial Analyst Intel Corporation July 2014  – Present (1 year 2 months) Phoenix, Arizona Area Financial Planning and Analysis (FP&A) \n- Drive monthly close process, including partnering with key finance and operations personnel to identify variances and drive decisions across the internal organization. \n \n- Partner with the business to provide strategic recommendations on management of forecast and spending.  \n \n- Leverage strong Excel skills to improve processes and create efficiencies in weekly and monthly reporting of actuals, headcount, and close data. Financial Analyst Intel Corporation July 2014  – Present (1 year 2 months) Phoenix, Arizona Area Financial Planning and Analysis (FP&A) \n- Drive monthly close process, including partnering with key finance and operations personnel to identify variances and drive decisions across the internal organization. \n \n- Partner with the business to provide strategic recommendations on management of forecast and spending.  \n \n- Leverage strong Excel skills to improve processes and create efficiencies in weekly and monthly reporting of actuals, headcount, and close data. MBA Candidate | Class of 2014 Brigham Young University August 2012  –  April 2014  (1 year 9 months) Provo, Utah Area - Member of BYU's Silver Fund team (2014) - Assisted in managing $2M in assets \n- Member of Leadership Council (2014) MBA Candidate | Class of 2014 Brigham Young University August 2012  –  April 2014  (1 year 9 months) Provo, Utah Area - Member of BYU's Silver Fund team (2014) - Assisted in managing $2M in assets \n- Member of Leadership Council (2014) MBA Finance Intern Intel Corporation May 2013  –  August 2013  (4 months) Chandler, Arizona Developed recommendations for a Make vs Buy analysis on two IP blocks, which would result in a savings of $4.3M MBA Finance Intern Intel Corporation May 2013  –  August 2013  (4 months) Chandler, Arizona Developed recommendations for a Make vs Buy analysis on two IP blocks, which would result in a savings of $4.3M Business Development Director Bradford Consulting Engineers, Inc, April 2009  –  July 2012  (3 years 4 months) Portland, Oregon Area Business Development Director Bradford Consulting Engineers, Inc, April 2009  –  July 2012  (3 years 4 months) Portland, Oregon Area Skills Proposal Writing Marketing Strategy Strategic Planning Marketing Communications Project Management Marketing Strategy Market Research Forecasting CRM Finance Business Development Cross-functional Team... Analysis Business Strategy Leadership Data Analysis Financial Analysis Financial Modeling Microsoft Excel Public Speaking Microsoft Office See 7+     See less Skills  Proposal Writing Marketing Strategy Strategic Planning Marketing Communications Project Management Marketing Strategy Market Research Forecasting CRM Finance Business Development Cross-functional Team... Analysis Business Strategy Leadership Data Analysis Financial Analysis Financial Modeling Microsoft Excel Public Speaking Microsoft Office See 7+     See less Proposal Writing Marketing Strategy Strategic Planning Marketing Communications Project Management Marketing Strategy Market Research Forecasting CRM Finance Business Development Cross-functional Team... Analysis Business Strategy Leadership Data Analysis Financial Analysis Financial Modeling Microsoft Excel Public Speaking Microsoft Office See 7+     See less Proposal Writing Marketing Strategy Strategic Planning Marketing Communications Project Management Marketing Strategy Market Research Forecasting CRM Finance Business Development Cross-functional Team... Analysis Business Strategy Leadership Data Analysis Financial Analysis Financial Modeling Microsoft Excel Public Speaking Microsoft Office See 7+     See less Education Brigham Young University Master of Business Administration (M.B.A.),  Finance 2012  – 2014 - 2014 Venture Capital Investment Competition (VCIC) - Central Region - 1st place \n- 2014 Venture Capital Investment Competition (VCIC) - International - Entrepreneur's Choice \n- 2013 Asia Study Abroad Brigham Young University - Idaho B.S.,  Business - Finance 2005  – 2009 Brigham Young University Master of Business Administration (M.B.A.),  Finance 2012  – 2014 - 2014 Venture Capital Investment Competition (VCIC) - Central Region - 1st place \n- 2014 Venture Capital Investment Competition (VCIC) - International - Entrepreneur's Choice \n- 2013 Asia Study Abroad Brigham Young University Master of Business Administration (M.B.A.),  Finance 2012  – 2014 - 2014 Venture Capital Investment Competition (VCIC) - Central Region - 1st place \n- 2014 Venture Capital Investment Competition (VCIC) - International - Entrepreneur's Choice \n- 2013 Asia Study Abroad Brigham Young University Master of Business Administration (M.B.A.),  Finance 2012  – 2014 - 2014 Venture Capital Investment Competition (VCIC) - Central Region - 1st place \n- 2014 Venture Capital Investment Competition (VCIC) - International - Entrepreneur's Choice \n- 2013 Asia Study Abroad Brigham Young University - Idaho B.S.,  Business - Finance 2005  – 2009 Brigham Young University - Idaho B.S.,  Business - Finance 2005  – 2009 Brigham Young University - Idaho B.S.,  Business - Finance 2005  – 2009 ", "Experience Financial Analyst Intel Corporation March 2009  – Present (6 years 6 months) MBA Finance Intern Intel Corporation June 2008  –  September 2008  (4 months) Financial Analyst Intern Granite Construction March 2007  –  June 2008  (1 year 4 months) Field Industrial Engineer YRC Worldwide, Inc. September 2003  –  September 2006  (3 years 1 month) Sales Planning Intern Memorex April 2002  –  August 2002  (5 months) Financial Analyst Intel Corporation March 2009  – Present (6 years 6 months) Financial Analyst Intel Corporation March 2009  – Present (6 years 6 months) MBA Finance Intern Intel Corporation June 2008  –  September 2008  (4 months) MBA Finance Intern Intel Corporation June 2008  –  September 2008  (4 months) Financial Analyst Intern Granite Construction March 2007  –  June 2008  (1 year 4 months) Financial Analyst Intern Granite Construction March 2007  –  June 2008  (1 year 4 months) Field Industrial Engineer YRC Worldwide, Inc. September 2003  –  September 2006  (3 years 1 month) Field Industrial Engineer YRC Worldwide, Inc. September 2003  –  September 2006  (3 years 1 month) Sales Planning Intern Memorex April 2002  –  August 2002  (5 months) Sales Planning Intern Memorex April 2002  –  August 2002  (5 months) Skills Competitive Analysis Cross-functional Team... Finance Financial Analysis Financial Modeling Financial Reporting Forecasting Process Improvement Project Management Sarbanes-Oxley Act Data Analysis Corporate Finance SAP Analysis Financial Forecasting Management Program Management See 2+     See less Skills  Competitive Analysis Cross-functional Team... Finance Financial Analysis Financial Modeling Financial Reporting Forecasting Process Improvement Project Management Sarbanes-Oxley Act Data Analysis Corporate Finance SAP Analysis Financial Forecasting Management Program Management See 2+     See less Competitive Analysis Cross-functional Team... Finance Financial Analysis Financial Modeling Financial Reporting Forecasting Process Improvement Project Management Sarbanes-Oxley Act Data Analysis Corporate Finance SAP Analysis Financial Forecasting Management Program Management See 2+     See less Competitive Analysis Cross-functional Team... Finance Financial Analysis Financial Modeling Financial Reporting Forecasting Process Improvement Project Management Sarbanes-Oxley Act Data Analysis Corporate Finance SAP Analysis Financial Forecasting Management Program Management See 2+     See less Education University of California, Davis - Graduate School of Management MBA,  Business 2006  – 2009 University of Southern California B.S.,  Industrial and Systems Engineering 1998  – 2002 University of California, Davis - Graduate School of Management MBA,  Business 2006  – 2009 University of California, Davis - Graduate School of Management MBA,  Business 2006  – 2009 University of California, Davis - Graduate School of Management MBA,  Business 2006  – 2009 University of Southern California B.S.,  Industrial and Systems Engineering 1998  – 2002 University of Southern California B.S.,  Industrial and Systems Engineering 1998  – 2002 University of Southern California B.S.,  Industrial and Systems Engineering 1998  – 2002 "]}