{"position": "Front Line Manager", "company": "Intel Corporation", "profiles": ["Summary I’ve been working in the Semi-conductor industry at Intel for over 18 yrs. While working in a High Volume Manufacturing environment, improving efficiency of operations, team building, lean manufacturing, job relations, reliability, and managing the development and growth of both employees and process for Intel’s Pentium, Centrino and i3-i7 platforms. I have held positions as an Operation Technician, Equipment Technician, Engineering Technician, Operation Manager, Equipment Maintenance Manager and currently a Front Line Manager. Summary I’ve been working in the Semi-conductor industry at Intel for over 18 yrs. While working in a High Volume Manufacturing environment, improving efficiency of operations, team building, lean manufacturing, job relations, reliability, and managing the development and growth of both employees and process for Intel’s Pentium, Centrino and i3-i7 platforms. I have held positions as an Operation Technician, Equipment Technician, Engineering Technician, Operation Manager, Equipment Maintenance Manager and currently a Front Line Manager. I’ve been working in the Semi-conductor industry at Intel for over 18 yrs. While working in a High Volume Manufacturing environment, improving efficiency of operations, team building, lean manufacturing, job relations, reliability, and managing the development and growth of both employees and process for Intel’s Pentium, Centrino and i3-i7 platforms. I have held positions as an Operation Technician, Equipment Technician, Engineering Technician, Operation Manager, Equipment Maintenance Manager and currently a Front Line Manager. I’ve been working in the Semi-conductor industry at Intel for over 18 yrs. While working in a High Volume Manufacturing environment, improving efficiency of operations, team building, lean manufacturing, job relations, reliability, and managing the development and growth of both employees and process for Intel’s Pentium, Centrino and i3-i7 platforms. I have held positions as an Operation Technician, Equipment Technician, Engineering Technician, Operation Manager, Equipment Maintenance Manager and currently a Front Line Manager. Experience Front Line Manager Intel Corporation August 2013  – Present (2 years 1 month) Hudson Ma Responsible for managing the day to day operations in the Diffusion area of Fab 17. This including both line operations and equipment repair for the Semi-Conductor process. Responsibilities include all aspects of multiple factory functional area performance, Safety, Quality and Output; performance management and development. Currently I am managing between 10-14 manufacturing and equipment specialist. Working to maintain a strong focus on Lean Manufacturing, Waste Elimination and wafer through put time. Equipment Manager Intel April 2007  –  August 2013  (6 years 5 months) Hudson Ma Equipment Engineering Technician Intel Corporation August 2000  –  April 2007  (6 years 9 months) Hudson Ma Manufacturing Technician Intel Corporation January 1996  –  August 2000  (4 years 8 months) Rio Rancho NM Air Trafic Control Assistant Division Officer US Navy September 1975  –  September 1995  (20 years 1 month) Front Line Manager Intel Corporation August 2013  – Present (2 years 1 month) Hudson Ma Responsible for managing the day to day operations in the Diffusion area of Fab 17. This including both line operations and equipment repair for the Semi-Conductor process. Responsibilities include all aspects of multiple factory functional area performance, Safety, Quality and Output; performance management and development. Currently I am managing between 10-14 manufacturing and equipment specialist. Working to maintain a strong focus on Lean Manufacturing, Waste Elimination and wafer through put time. Front Line Manager Intel Corporation August 2013  – Present (2 years 1 month) Hudson Ma Responsible for managing the day to day operations in the Diffusion area of Fab 17. This including both line operations and equipment repair for the Semi-Conductor process. Responsibilities include all aspects of multiple factory functional area performance, Safety, Quality and Output; performance management and development. Currently I am managing between 10-14 manufacturing and equipment specialist. Working to maintain a strong focus on Lean Manufacturing, Waste Elimination and wafer through put time. Equipment Manager Intel April 2007  –  August 2013  (6 years 5 months) Hudson Ma Equipment Manager Intel April 2007  –  August 2013  (6 years 5 months) Hudson Ma Equipment Engineering Technician Intel Corporation August 2000  –  April 2007  (6 years 9 months) Hudson Ma Equipment Engineering Technician Intel Corporation August 2000  –  April 2007  (6 years 9 months) Hudson Ma Manufacturing Technician Intel Corporation January 1996  –  August 2000  (4 years 8 months) Rio Rancho NM Manufacturing Technician Intel Corporation January 1996  –  August 2000  (4 years 8 months) Rio Rancho NM Air Trafic Control Assistant Division Officer US Navy September 1975  –  September 1995  (20 years 1 month) Air Trafic Control Assistant Division Officer US Navy September 1975  –  September 1995  (20 years 1 month) Skills VLSI Semiconductors SoC Debugging Computer Architecture IC Firmware Verilog ASIC Product Marketing Product Management Device Drivers Semiconductor Industry Failure Analysis Go-to-market Strategy Embedded Software Embedded Systems Cross-functional Team... Continuous Improvement Engineering Management Lean Manufacturing Manufacturing SPC Six Sigma See 9+     See less Skills  VLSI Semiconductors SoC Debugging Computer Architecture IC Firmware Verilog ASIC Product Marketing Product Management Device Drivers Semiconductor Industry Failure Analysis Go-to-market Strategy Embedded Software Embedded Systems Cross-functional Team... Continuous Improvement Engineering Management Lean Manufacturing Manufacturing SPC Six Sigma See 9+     See less VLSI Semiconductors SoC Debugging Computer Architecture IC Firmware Verilog ASIC Product Marketing Product Management Device Drivers Semiconductor Industry Failure Analysis Go-to-market Strategy Embedded Software Embedded Systems Cross-functional Team... Continuous Improvement Engineering Management Lean Manufacturing Manufacturing SPC Six Sigma See 9+     See less VLSI Semiconductors SoC Debugging Computer Architecture IC Firmware Verilog ASIC Product Marketing Product Management Device Drivers Semiconductor Industry Failure Analysis Go-to-market Strategy Embedded Software Embedded Systems Cross-functional Team... Continuous Improvement Engineering Management Lean Manufacturing Manufacturing SPC Six Sigma See 9+     See less ", "Experience FOL-Front Line Manager Intel Labs Front Line Manager Intel Corporation FOL-Front Line Manager Intel Labs FOL-Front Line Manager Intel Labs Front Line Manager Intel Corporation Front Line Manager Intel Corporation Languages English Bahasa Malaysia English Bahasa Malaysia English Bahasa Malaysia Skills Microsoft Office Microsoft Excel C++ Program Management Matlab Strategic Planning Customer Service C Public Speaking Leadership Skills  Microsoft Office Microsoft Excel C++ Program Management Matlab Strategic Planning Customer Service C Public Speaking Leadership Microsoft Office Microsoft Excel C++ Program Management Matlab Strategic Planning Customer Service C Public Speaking Leadership Microsoft Office Microsoft Excel C++ Program Management Matlab Strategic Planning Customer Service C Public Speaking Leadership ", "Experience Front Line Manager Intel Corporation May 1995  – Present (20 years 4 months) PGAT Front Line Manager Intel Corporation May 1995  – Present (20 years 4 months) PGAT Front Line Manager Intel Corporation May 1995  – Present (20 years 4 months) PGAT Skills Semiconductors Manufacturing Cross-functional Team... Design of Experiments Lean Manufacturing Engineering Management Continuous Improvement Process Engineering Program Management Product Management Supply Chain Management Root Cause Analysis Process Improvement Product Development Skills  Semiconductors Manufacturing Cross-functional Team... Design of Experiments Lean Manufacturing Engineering Management Continuous Improvement Process Engineering Program Management Product Management Supply Chain Management Root Cause Analysis Process Improvement Product Development Semiconductors Manufacturing Cross-functional Team... Design of Experiments Lean Manufacturing Engineering Management Continuous Improvement Process Engineering Program Management Product Management Supply Chain Management Root Cause Analysis Process Improvement Product Development Semiconductors Manufacturing Cross-functional Team... Design of Experiments Lean Manufacturing Engineering Management Continuous Improvement Process Engineering Program Management Product Management Supply Chain Management Root Cause Analysis Process Improvement Product Development ", "Summary I am an energetic leader who is very passionate to continue challenge my career growth in different areas of industry through enhancing my leadership skills. My motivation at work is to collaborate with individuals from different expertise and background to deliver extraordinary results and changes within an organization. I have very strong interest in IT service desk and supply chain area in which I continue to inject more ideas into process and operation improvement throughout all my job roles. I have vast experience of working with people from US, Costa Rica, Singapore, China, Vietnam, Amsterdam, Ireland, Swindon, Israel, India and Philippines.  \nCertified in CIAC Call Center Management Apprentice and MBA graduate in Supply Chain Management. Summary I am an energetic leader who is very passionate to continue challenge my career growth in different areas of industry through enhancing my leadership skills. My motivation at work is to collaborate with individuals from different expertise and background to deliver extraordinary results and changes within an organization. I have very strong interest in IT service desk and supply chain area in which I continue to inject more ideas into process and operation improvement throughout all my job roles. I have vast experience of working with people from US, Costa Rica, Singapore, China, Vietnam, Amsterdam, Ireland, Swindon, Israel, India and Philippines.  \nCertified in CIAC Call Center Management Apprentice and MBA graduate in Supply Chain Management. I am an energetic leader who is very passionate to continue challenge my career growth in different areas of industry through enhancing my leadership skills. My motivation at work is to collaborate with individuals from different expertise and background to deliver extraordinary results and changes within an organization. I have very strong interest in IT service desk and supply chain area in which I continue to inject more ideas into process and operation improvement throughout all my job roles. I have vast experience of working with people from US, Costa Rica, Singapore, China, Vietnam, Amsterdam, Ireland, Swindon, Israel, India and Philippines.  \nCertified in CIAC Call Center Management Apprentice and MBA graduate in Supply Chain Management. I am an energetic leader who is very passionate to continue challenge my career growth in different areas of industry through enhancing my leadership skills. My motivation at work is to collaborate with individuals from different expertise and background to deliver extraordinary results and changes within an organization. I have very strong interest in IT service desk and supply chain area in which I continue to inject more ideas into process and operation improvement throughout all my job roles. I have vast experience of working with people from US, Costa Rica, Singapore, China, Vietnam, Amsterdam, Ireland, Swindon, Israel, India and Philippines.  \nCertified in CIAC Call Center Management Apprentice and MBA graduate in Supply Chain Management. Experience IT Service Desk Front Line Manager Intel Corporation May 2013  – Present (2 years 4 months) Penang, Malaysia - Responsible for Source, Purchasing & Supplier team operation & customer escalations \n- Manage team KPI indicator  \n- Involved in resource management and employee development \n- Decision maker for new business landings \n- Partner with stakeholders in operation improvement or collaboration projects \n- Involved as a core team member for Intel Malaysia shared service community Systems Capability Analyst (Global Logistics) Intel Corporation May 2010  –  April 2013  (3 years) Penang, Malaysia - Greater Asia Region Lead for successful deployment of SAP Order Execution system re-platform for all the Logistics warehouses in Asia site, managed a few sub-leads in planning, testing, transition change management and stabilization activities \n- Managed a virtual team to drive proof of concepts for logistics control points area  \n- Coordinate business requirement gathering and deployment activities with business  \nstakeholders and IT for Global Logistics projects (PRC Shipment & Payment Tracking, Shanghai  \nX-dock, Shipment Visibility Pre-alert) \n- Perform proof of concept work for new system capabilities in warehouses environment GAR System Application Manager Intel Corporation October 2009  –  May 2010  (8 months) Penang, Malaysia - Manage a team of 4 system analysts from Penang & China to work on Maintenance Of  \nBusiness related tasks and Logistics system projects \n- Work closely with stakeholders from IT and Logistics to partner on system deployment  \nroadmap, implementation of new system capabilities and systems downtime mitigation plan \n- Involved in global re-org transition activities; sunset the resources and responsibilities; divert  \nresources to other critical operation group \n- Manage the performance review process and development path for direct reports \n- Responsible for headcount turnover activities; hired 1 HC for Shanghai site Supply Chain Service Desk Support Specialist Intel Corporation January 2006  –  September 2009  (3 years 9 months) Penang, Malaysia - Provide technical & business solution support on SAP and non-SAP application to global  \nusers on Distribution and Planning area. \n- Assigned as New Business Engager in 2009 for Deliver & Customer applications \n- Assigned as a team lead from June 2006 - Sept 2008 to manage team operation \n- Lead the Costa Rica transition program for ASD Plan & Deliver team in 2007. \n- Involved as sub-committee in Intel Malaysia 35th anniversary event in 2007. \n- Organized ACS dept teambuilding in Q3 2006. \n- Project manager for SCSD multimedia solution project. (Achieved IT DRA recognition) \n- Coordinated training & development program for ACS employees in 2007. \n- Assist manager in interview for CW employees hiring. \n- Represent Manager for face-to-face meeting with stakeholders and involved in new  \nbusiness project meetings \n- Lead IT Malaysia GPTW team and organized below events \ni) IT Malaysia Sports Carnival \nii) PC Pal program closure \niii) IT Malaysia Annual Dinner Call Center Supervisor (Based in Intel) Intradeco Sdn Bhd January 2005  –  December 2005  (1 year) Penang, Malaysia - Manage 2 call center teams in Intel (E-business & Engineering  \nComputing) comprises of 15 people including day and night shift operation. \n- Responsible in hiring new staff according to Intel's requirement \n- Represent the Company to deliver company's direction and information to the staff and to  \nIntel \n- Manage staff benefits and coordinate the working schedules and trainings. \n- Coordinate with Intel sponsors regarding head counts and staff performance to ensure total  \ncustomer satisfaction. \n- Monitor the work quality and staff performance indicators. \n- Coaching staff and maintain the team work among the staff. \n- Organize teambuilding activities and staff recognitions Call Center Team Lead Intradeco Sdn Bhd August 2003  –  December 2004  (1 year 5 months) Penang, Malaysia - Assigned as a team leader in Intel Call Center \n- Support English and Chinese speaking customers from all Intel sites, providing office  \nsolutions support to them such as MS Office products, VPN, wireless etc \n- Involved in a project supporting video conferencing device \n- Guide new hires and giving personal training/coaching to them \n- Plan coverage arrangement together with supervisor IT Service Desk Front Line Manager Intel Corporation May 2013  – Present (2 years 4 months) Penang, Malaysia - Responsible for Source, Purchasing & Supplier team operation & customer escalations \n- Manage team KPI indicator  \n- Involved in resource management and employee development \n- Decision maker for new business landings \n- Partner with stakeholders in operation improvement or collaboration projects \n- Involved as a core team member for Intel Malaysia shared service community IT Service Desk Front Line Manager Intel Corporation May 2013  – Present (2 years 4 months) Penang, Malaysia - Responsible for Source, Purchasing & Supplier team operation & customer escalations \n- Manage team KPI indicator  \n- Involved in resource management and employee development \n- Decision maker for new business landings \n- Partner with stakeholders in operation improvement or collaboration projects \n- Involved as a core team member for Intel Malaysia shared service community Systems Capability Analyst (Global Logistics) Intel Corporation May 2010  –  April 2013  (3 years) Penang, Malaysia - Greater Asia Region Lead for successful deployment of SAP Order Execution system re-platform for all the Logistics warehouses in Asia site, managed a few sub-leads in planning, testing, transition change management and stabilization activities \n- Managed a virtual team to drive proof of concepts for logistics control points area  \n- Coordinate business requirement gathering and deployment activities with business  \nstakeholders and IT for Global Logistics projects (PRC Shipment & Payment Tracking, Shanghai  \nX-dock, Shipment Visibility Pre-alert) \n- Perform proof of concept work for new system capabilities in warehouses environment Systems Capability Analyst (Global Logistics) Intel Corporation May 2010  –  April 2013  (3 years) Penang, Malaysia - Greater Asia Region Lead for successful deployment of SAP Order Execution system re-platform for all the Logistics warehouses in Asia site, managed a few sub-leads in planning, testing, transition change management and stabilization activities \n- Managed a virtual team to drive proof of concepts for logistics control points area  \n- Coordinate business requirement gathering and deployment activities with business  \nstakeholders and IT for Global Logistics projects (PRC Shipment & Payment Tracking, Shanghai  \nX-dock, Shipment Visibility Pre-alert) \n- Perform proof of concept work for new system capabilities in warehouses environment GAR System Application Manager Intel Corporation October 2009  –  May 2010  (8 months) Penang, Malaysia - Manage a team of 4 system analysts from Penang & China to work on Maintenance Of  \nBusiness related tasks and Logistics system projects \n- Work closely with stakeholders from IT and Logistics to partner on system deployment  \nroadmap, implementation of new system capabilities and systems downtime mitigation plan \n- Involved in global re-org transition activities; sunset the resources and responsibilities; divert  \nresources to other critical operation group \n- Manage the performance review process and development path for direct reports \n- Responsible for headcount turnover activities; hired 1 HC for Shanghai site GAR System Application Manager Intel Corporation October 2009  –  May 2010  (8 months) Penang, Malaysia - Manage a team of 4 system analysts from Penang & China to work on Maintenance Of  \nBusiness related tasks and Logistics system projects \n- Work closely with stakeholders from IT and Logistics to partner on system deployment  \nroadmap, implementation of new system capabilities and systems downtime mitigation plan \n- Involved in global re-org transition activities; sunset the resources and responsibilities; divert  \nresources to other critical operation group \n- Manage the performance review process and development path for direct reports \n- Responsible for headcount turnover activities; hired 1 HC for Shanghai site Supply Chain Service Desk Support Specialist Intel Corporation January 2006  –  September 2009  (3 years 9 months) Penang, Malaysia - Provide technical & business solution support on SAP and non-SAP application to global  \nusers on Distribution and Planning area. \n- Assigned as New Business Engager in 2009 for Deliver & Customer applications \n- Assigned as a team lead from June 2006 - Sept 2008 to manage team operation \n- Lead the Costa Rica transition program for ASD Plan & Deliver team in 2007. \n- Involved as sub-committee in Intel Malaysia 35th anniversary event in 2007. \n- Organized ACS dept teambuilding in Q3 2006. \n- Project manager for SCSD multimedia solution project. (Achieved IT DRA recognition) \n- Coordinated training & development program for ACS employees in 2007. \n- Assist manager in interview for CW employees hiring. \n- Represent Manager for face-to-face meeting with stakeholders and involved in new  \nbusiness project meetings \n- Lead IT Malaysia GPTW team and organized below events \ni) IT Malaysia Sports Carnival \nii) PC Pal program closure \niii) IT Malaysia Annual Dinner Supply Chain Service Desk Support Specialist Intel Corporation January 2006  –  September 2009  (3 years 9 months) Penang, Malaysia - Provide technical & business solution support on SAP and non-SAP application to global  \nusers on Distribution and Planning area. \n- Assigned as New Business Engager in 2009 for Deliver & Customer applications \n- Assigned as a team lead from June 2006 - Sept 2008 to manage team operation \n- Lead the Costa Rica transition program for ASD Plan & Deliver team in 2007. \n- Involved as sub-committee in Intel Malaysia 35th anniversary event in 2007. \n- Organized ACS dept teambuilding in Q3 2006. \n- Project manager for SCSD multimedia solution project. (Achieved IT DRA recognition) \n- Coordinated training & development program for ACS employees in 2007. \n- Assist manager in interview for CW employees hiring. \n- Represent Manager for face-to-face meeting with stakeholders and involved in new  \nbusiness project meetings \n- Lead IT Malaysia GPTW team and organized below events \ni) IT Malaysia Sports Carnival \nii) PC Pal program closure \niii) IT Malaysia Annual Dinner Call Center Supervisor (Based in Intel) Intradeco Sdn Bhd January 2005  –  December 2005  (1 year) Penang, Malaysia - Manage 2 call center teams in Intel (E-business & Engineering  \nComputing) comprises of 15 people including day and night shift operation. \n- Responsible in hiring new staff according to Intel's requirement \n- Represent the Company to deliver company's direction and information to the staff and to  \nIntel \n- Manage staff benefits and coordinate the working schedules and trainings. \n- Coordinate with Intel sponsors regarding head counts and staff performance to ensure total  \ncustomer satisfaction. \n- Monitor the work quality and staff performance indicators. \n- Coaching staff and maintain the team work among the staff. \n- Organize teambuilding activities and staff recognitions Call Center Supervisor (Based in Intel) Intradeco Sdn Bhd January 2005  –  December 2005  (1 year) Penang, Malaysia - Manage 2 call center teams in Intel (E-business & Engineering  \nComputing) comprises of 15 people including day and night shift operation. \n- Responsible in hiring new staff according to Intel's requirement \n- Represent the Company to deliver company's direction and information to the staff and to  \nIntel \n- Manage staff benefits and coordinate the working schedules and trainings. \n- Coordinate with Intel sponsors regarding head counts and staff performance to ensure total  \ncustomer satisfaction. \n- Monitor the work quality and staff performance indicators. \n- Coaching staff and maintain the team work among the staff. \n- Organize teambuilding activities and staff recognitions Call Center Team Lead Intradeco Sdn Bhd August 2003  –  December 2004  (1 year 5 months) Penang, Malaysia - Assigned as a team leader in Intel Call Center \n- Support English and Chinese speaking customers from all Intel sites, providing office  \nsolutions support to them such as MS Office products, VPN, wireless etc \n- Involved in a project supporting video conferencing device \n- Guide new hires and giving personal training/coaching to them \n- Plan coverage arrangement together with supervisor Call Center Team Lead Intradeco Sdn Bhd August 2003  –  December 2004  (1 year 5 months) Penang, Malaysia - Assigned as a team leader in Intel Call Center \n- Support English and Chinese speaking customers from all Intel sites, providing office  \nsolutions support to them such as MS Office products, VPN, wireless etc \n- Involved in a project supporting video conferencing device \n- Guide new hires and giving personal training/coaching to them \n- Plan coverage arrangement together with supervisor Languages Chinese Professional working proficiency English Full professional proficiency Cantonese Native or bilingual proficiency Japanese Elementary proficiency Chinese Professional working proficiency English Full professional proficiency Cantonese Native or bilingual proficiency Japanese Elementary proficiency Chinese Professional working proficiency English Full professional proficiency Cantonese Native or bilingual proficiency Japanese Elementary proficiency Professional working proficiency Full professional proficiency Native or bilingual proficiency Elementary proficiency Skills Program Management Call Center... Problem Management Incident Management Call Center Development ITIL Cross-functional Team... Logistics Business Process... Vendor Management Leadership Team Management Call Centers Training Management People Management Six Sigma Process Improvement Change Management Supply Chain Management Team Leadership Troubleshooting See 7+     See less Skills  Program Management Call Center... Problem Management Incident Management Call Center Development ITIL Cross-functional Team... Logistics Business Process... Vendor Management Leadership Team Management Call Centers Training Management People Management Six Sigma Process Improvement Change Management Supply Chain Management Team Leadership Troubleshooting See 7+     See less Program Management Call Center... Problem Management Incident Management Call Center Development ITIL Cross-functional Team... Logistics Business Process... Vendor Management Leadership Team Management Call Centers Training Management People Management Six Sigma Process Improvement Change Management Supply Chain Management Team Leadership Troubleshooting See 7+     See less Program Management Call Center... Problem Management Incident Management Call Center Development ITIL Cross-functional Team... Logistics Business Process... Vendor Management Leadership Team Management Call Centers Training Management People Management Six Sigma Process Improvement Change Management Supply Chain Management Team Leadership Troubleshooting See 7+     See less Education Universiti Utara Malaysia Master of Business Administration (MBA),  Logistics , Materials, and Supply Chain Management 2009  – 2011 Activities and Societies:  AIESEC Universiti Utara Malaysia Bachelor's degree,  Information Technology 2000  – 2003 Activities and Societies:  President of AIESEC in UUM ,  President of St. John ACS Kampar ACS Kampar Universiti Utara Malaysia Master of Business Administration (MBA),  Logistics , Materials, and Supply Chain Management 2009  – 2011 Activities and Societies:  AIESEC Universiti Utara Malaysia Master of Business Administration (MBA),  Logistics , Materials, and Supply Chain Management 2009  – 2011 Activities and Societies:  AIESEC Universiti Utara Malaysia Master of Business Administration (MBA),  Logistics , Materials, and Supply Chain Management 2009  – 2011 Activities and Societies:  AIESEC Universiti Utara Malaysia Bachelor's degree,  Information Technology 2000  – 2003 Activities and Societies:  President of AIESEC in UUM ,  President of St. John Universiti Utara Malaysia Bachelor's degree,  Information Technology 2000  – 2003 Activities and Societies:  President of AIESEC in UUM ,  President of St. John Universiti Utara Malaysia Bachelor's degree,  Information Technology 2000  – 2003 Activities and Societies:  President of AIESEC in UUM ,  President of St. John ACS Kampar ACS Kampar ACS Kampar ACS Kampar ACS Kampar ACS Kampar "]}