{"position": "Graduate Research Intern", "company": "Intel Corporation", "profiles": ["Summary Resourceful and dynamic engineering professional with over 25 years of progressive and diverse experiences in leading the research, development, and deployment of disruptive techniques and technologies for high performance computing systems (signal and image processing) targeting advanced platforms for the C4ISR community. In depth working experience with remote sensing intelligence systems such as SIGINT, RADAR, MASINT, and Multi/HyperSpectral Imaging platforms. Worked closely with various DoD agencies or their prime contractors developing requirements, specifying computing architectures and assisting in the system integration of ground, air, or overhead support systems. Very strong personal and communications skills dealing directly with internal and external customers to interactively identify and develop advanced (current and outyear) solutions. Professionally published and presented in multiple national and international venues. Success driven individual confirmed by strong high and low level design experiences. Proven program and personnel leadership credentials successfully supervising large programs and resources. Specialties:High performance computing architectures for embedded, real-time systems; Digital Signal and Image Processing; partitioning and load balancing of applications to target platforms; multi-asset architectures (MAA): multicore, multiprocessor, multi-system Summary Resourceful and dynamic engineering professional with over 25 years of progressive and diverse experiences in leading the research, development, and deployment of disruptive techniques and technologies for high performance computing systems (signal and image processing) targeting advanced platforms for the C4ISR community. In depth working experience with remote sensing intelligence systems such as SIGINT, RADAR, MASINT, and Multi/HyperSpectral Imaging platforms. Worked closely with various DoD agencies or their prime contractors developing requirements, specifying computing architectures and assisting in the system integration of ground, air, or overhead support systems. Very strong personal and communications skills dealing directly with internal and external customers to interactively identify and develop advanced (current and outyear) solutions. Professionally published and presented in multiple national and international venues. Success driven individual confirmed by strong high and low level design experiences. Proven program and personnel leadership credentials successfully supervising large programs and resources. Specialties:High performance computing architectures for embedded, real-time systems; Digital Signal and Image Processing; partitioning and load balancing of applications to target platforms; multi-asset architectures (MAA): multicore, multiprocessor, multi-system Resourceful and dynamic engineering professional with over 25 years of progressive and diverse experiences in leading the research, development, and deployment of disruptive techniques and technologies for high performance computing systems (signal and image processing) targeting advanced platforms for the C4ISR community. In depth working experience with remote sensing intelligence systems such as SIGINT, RADAR, MASINT, and Multi/HyperSpectral Imaging platforms. Worked closely with various DoD agencies or their prime contractors developing requirements, specifying computing architectures and assisting in the system integration of ground, air, or overhead support systems. Very strong personal and communications skills dealing directly with internal and external customers to interactively identify and develop advanced (current and outyear) solutions. Professionally published and presented in multiple national and international venues. Success driven individual confirmed by strong high and low level design experiences. Proven program and personnel leadership credentials successfully supervising large programs and resources. Specialties:High performance computing architectures for embedded, real-time systems; Digital Signal and Image Processing; partitioning and load balancing of applications to target platforms; multi-asset architectures (MAA): multicore, multiprocessor, multi-system Resourceful and dynamic engineering professional with over 25 years of progressive and diverse experiences in leading the research, development, and deployment of disruptive techniques and technologies for high performance computing systems (signal and image processing) targeting advanced platforms for the C4ISR community. In depth working experience with remote sensing intelligence systems such as SIGINT, RADAR, MASINT, and Multi/HyperSpectral Imaging platforms. Worked closely with various DoD agencies or their prime contractors developing requirements, specifying computing architectures and assisting in the system integration of ground, air, or overhead support systems. Very strong personal and communications skills dealing directly with internal and external customers to interactively identify and develop advanced (current and outyear) solutions. Professionally published and presented in multiple national and international venues. Success driven individual confirmed by strong high and low level design experiences. Proven program and personnel leadership credentials successfully supervising large programs and resources. Specialties:High performance computing architectures for embedded, real-time systems; Digital Signal and Image Processing; partitioning and load balancing of applications to target platforms; multi-asset architectures (MAA): multicore, multiprocessor, multi-system Experience Ph.D. candidate in Computer Engineering The University of Texas System January 2009  – Present (6 years 8 months) Greater St. Louis Area Working full-time performing research in the high performance embedded computing community to complete a Ph.D. in Computer Engineering. Research looking into real-time dynamic scheduling frameworks for hybrid multi-asset (multicore, multiprocessor, multi-computing, GPU, GPGPU, etc.) systems. Also looking at increasing resiliency of systems with features of scheduling paradigms. Graduate Research Intern Intel Corporation February 2014  –  August 2014  (7 months) Hillsboro, Oregon Worked on cutting-edge high-performance computing research touching on parallel programming, scientific computing, parallel computing architecture and real-time scheduling. The program's goals were to increase the performance per watt, scalability, and resiliency of large-scale HPC systems for the next generation exascale systems. Experience directly applicable to on-going dissertation research. Director of Engineering CET, LLC September 2010  –  May 2011  (9 months) Managed the hardware, software, optical, mechanical and lab support units. Developed job requisitions for human resources. Evaluated and invited selected candidates in for interviews. Generated new hire orientation agenda. Traveled to customer locations for program review meetings. Lead senior staffer responsible for the development of the CY2011 technical business development plans for the Sensors and Laser Division. Led proposal generation for multiple contract RFPs. Worked closely with Media Department for updated marketing literature and advertising. Adjunct Instructor ITT Tech 2010  –  2010  (less than a year) Systems Application Engineer III Mercury Computer systems, Inc. December 1999  –  September 2008  (8 years 10 months) Representative technical issues included high and low level applications development, use of various internal and external software products and tools, and the optimal insertion and implementation of Mercury products.  \n•\tResearched, developed and executed demonstrations highlighting hardware or software products as well as disruptive algorithms. Products included the IBM Cell BE, PA-Semi processor, and multi-processor architectures. C4ISR applications include compression techniques, ATR algorithms, parallel georegistration techniques, SAR image formation, and multiple hypothesis tracking algorithm. \n•\tDeveloped and presented sophisticated technical product reviews focused on customer’s needs. \n•\tWorked closely with customer to develop efficient yet effective high performance system solutions. \n•\tResearched issues and provided technical expertise to customers’ as necessary. \n•\tPublish technical papers at leading digital signal processing conferences, seminars and workshops. \n•\tProvide feedback to product management for the development of new products. Director of Engineering Darwell Technologies, Inc. August 1997  –  December 1999  (2 years 5 months) Managed hardware, software, mechanical, manufacturing and installation departments. Performed Business Development and Sales/Marketing duties. Designed and productized a computerized alarm notification system including dialing and recorded speech features. Maintained and enhanced the SitePRO remote facility monitoring software in Visual Basic and C. Developed control firmware for the remote monitoring sensors. Designed and productized a voltage sensing - battery charger resold by Lucent Technologies for field located telephone switch stations. Installed and maintained corporate telephone and computer systems. Configured and maintained the Microsoft Windows Server. Senior Systems Engineer/(Acting) Manager Raytheon April 1994  –  April 1997  (3 years 1 month) Systems Engineering Management for the Cobra Ball Data Analysis Lab. Clearance held: TS-SCI. Systems Engineering Task Leader for the contract providing a wide spectrum of data/signal analysis and engineering support to the DoD customer and Intel community. Managed contract resources including budgets, labor, and equipment.  \nConceived, developed and presented new engineering concepts to the customer. Performed and/or monitored detailed digital signal processing tasks in support of contractual deliverables including systems/algorithms for signal detection, classification and recognition; data fusion; synthesis; and simulations. Briefed upper management and customers as required. Senior Systems Engineer/Sr. Hardware Design Engineer E-Systems May 1989  –  April 1994  (5 years) IRAD Task Leader (FY96) supervised and participated in the development of a signal detection paradigm based on measurement and heuristic evaluation of signal metrics. Researched and identified the set of high priority signals-of-interest (SOI). Determined the set of parameters most significant in signal identity. Supervised successful development and demonstration using real world collected signals of PV-WAVE algorithms implementing the detection function. Briefed IRAD Management as required.  \nIRAD Task Leader (FY95) evaluated performance of an in-house signal recognition system consisting of embedded Mercury DSP boards. Determined system's capabilities for performing desired signal detection functions. Upgraded the OS of the VMEbus Sparc2 controller. Updated the software development tools and runtime kernels for the multiple Quad-i860 Mercury DSP boards. Installed X11R5 and Motif GUI libraries. Identified and implemented functional software enhancements in C and MATLAB. Successfully demonstrated upgraded system functionality. Recommended additional system upgrades. \nSenior Engineer in Hardware Development \nInvestigated, developed and proposed a hardware and software upgrade solution for a commercial off-the-shelf wideband communication analyzer and modulation classifier.  \nLead IRAD Systems Engineer of program chartered for the development of advanced software tools for parallel program development. Briefed management and potential customers. Technical liaison to the UTA parallel processing group (sub-contractor to E-Systems).  \nResearch Engineer on an IRAD study of direct sequence and frequency hopping spread spectrum demodulation techniques. Concentrated on the design and specification of non-coherent bit synchronization and conditioning of target communication signals. \nLead Engineer for the development, design and implementation of a multi-signal modulation synthesizer for testing demodulation systems. Designed, developed, fabricated, and tested DSP boards. Member of the Technical Staff MITRE 1988  –  1989  (1 year) Worked in the VLSI/VHSIC Technical Center Senior Engineer Emerson Electric January 1984  –  March 1988  (4 years 3 months) Primarily worked on IR&D program:advanced computing architectures for military applications. Ph.D. candidate in Computer Engineering The University of Texas System January 2009  – Present (6 years 8 months) Greater St. Louis Area Working full-time performing research in the high performance embedded computing community to complete a Ph.D. in Computer Engineering. Research looking into real-time dynamic scheduling frameworks for hybrid multi-asset (multicore, multiprocessor, multi-computing, GPU, GPGPU, etc.) systems. Also looking at increasing resiliency of systems with features of scheduling paradigms. Ph.D. candidate in Computer Engineering The University of Texas System January 2009  – Present (6 years 8 months) Greater St. Louis Area Working full-time performing research in the high performance embedded computing community to complete a Ph.D. in Computer Engineering. Research looking into real-time dynamic scheduling frameworks for hybrid multi-asset (multicore, multiprocessor, multi-computing, GPU, GPGPU, etc.) systems. Also looking at increasing resiliency of systems with features of scheduling paradigms. Graduate Research Intern Intel Corporation February 2014  –  August 2014  (7 months) Hillsboro, Oregon Worked on cutting-edge high-performance computing research touching on parallel programming, scientific computing, parallel computing architecture and real-time scheduling. The program's goals were to increase the performance per watt, scalability, and resiliency of large-scale HPC systems for the next generation exascale systems. Experience directly applicable to on-going dissertation research. Graduate Research Intern Intel Corporation February 2014  –  August 2014  (7 months) Hillsboro, Oregon Worked on cutting-edge high-performance computing research touching on parallel programming, scientific computing, parallel computing architecture and real-time scheduling. The program's goals were to increase the performance per watt, scalability, and resiliency of large-scale HPC systems for the next generation exascale systems. Experience directly applicable to on-going dissertation research. Director of Engineering CET, LLC September 2010  –  May 2011  (9 months) Managed the hardware, software, optical, mechanical and lab support units. Developed job requisitions for human resources. Evaluated and invited selected candidates in for interviews. Generated new hire orientation agenda. Traveled to customer locations for program review meetings. Lead senior staffer responsible for the development of the CY2011 technical business development plans for the Sensors and Laser Division. Led proposal generation for multiple contract RFPs. Worked closely with Media Department for updated marketing literature and advertising. Director of Engineering CET, LLC September 2010  –  May 2011  (9 months) Managed the hardware, software, optical, mechanical and lab support units. Developed job requisitions for human resources. Evaluated and invited selected candidates in for interviews. Generated new hire orientation agenda. Traveled to customer locations for program review meetings. Lead senior staffer responsible for the development of the CY2011 technical business development plans for the Sensors and Laser Division. Led proposal generation for multiple contract RFPs. Worked closely with Media Department for updated marketing literature and advertising. Adjunct Instructor ITT Tech 2010  –  2010  (less than a year) Adjunct Instructor ITT Tech 2010  –  2010  (less than a year) Systems Application Engineer III Mercury Computer systems, Inc. December 1999  –  September 2008  (8 years 10 months) Representative technical issues included high and low level applications development, use of various internal and external software products and tools, and the optimal insertion and implementation of Mercury products.  \n•\tResearched, developed and executed demonstrations highlighting hardware or software products as well as disruptive algorithms. Products included the IBM Cell BE, PA-Semi processor, and multi-processor architectures. C4ISR applications include compression techniques, ATR algorithms, parallel georegistration techniques, SAR image formation, and multiple hypothesis tracking algorithm. \n•\tDeveloped and presented sophisticated technical product reviews focused on customer’s needs. \n•\tWorked closely with customer to develop efficient yet effective high performance system solutions. \n•\tResearched issues and provided technical expertise to customers’ as necessary. \n•\tPublish technical papers at leading digital signal processing conferences, seminars and workshops. \n•\tProvide feedback to product management for the development of new products. Systems Application Engineer III Mercury Computer systems, Inc. December 1999  –  September 2008  (8 years 10 months) Representative technical issues included high and low level applications development, use of various internal and external software products and tools, and the optimal insertion and implementation of Mercury products.  \n•\tResearched, developed and executed demonstrations highlighting hardware or software products as well as disruptive algorithms. Products included the IBM Cell BE, PA-Semi processor, and multi-processor architectures. C4ISR applications include compression techniques, ATR algorithms, parallel georegistration techniques, SAR image formation, and multiple hypothesis tracking algorithm. \n•\tDeveloped and presented sophisticated technical product reviews focused on customer’s needs. \n•\tWorked closely with customer to develop efficient yet effective high performance system solutions. \n•\tResearched issues and provided technical expertise to customers’ as necessary. \n•\tPublish technical papers at leading digital signal processing conferences, seminars and workshops. \n•\tProvide feedback to product management for the development of new products. Director of Engineering Darwell Technologies, Inc. August 1997  –  December 1999  (2 years 5 months) Managed hardware, software, mechanical, manufacturing and installation departments. Performed Business Development and Sales/Marketing duties. Designed and productized a computerized alarm notification system including dialing and recorded speech features. Maintained and enhanced the SitePRO remote facility monitoring software in Visual Basic and C. Developed control firmware for the remote monitoring sensors. Designed and productized a voltage sensing - battery charger resold by Lucent Technologies for field located telephone switch stations. Installed and maintained corporate telephone and computer systems. Configured and maintained the Microsoft Windows Server. Director of Engineering Darwell Technologies, Inc. August 1997  –  December 1999  (2 years 5 months) Managed hardware, software, mechanical, manufacturing and installation departments. Performed Business Development and Sales/Marketing duties. Designed and productized a computerized alarm notification system including dialing and recorded speech features. Maintained and enhanced the SitePRO remote facility monitoring software in Visual Basic and C. Developed control firmware for the remote monitoring sensors. Designed and productized a voltage sensing - battery charger resold by Lucent Technologies for field located telephone switch stations. Installed and maintained corporate telephone and computer systems. Configured and maintained the Microsoft Windows Server. Senior Systems Engineer/(Acting) Manager Raytheon April 1994  –  April 1997  (3 years 1 month) Systems Engineering Management for the Cobra Ball Data Analysis Lab. Clearance held: TS-SCI. Systems Engineering Task Leader for the contract providing a wide spectrum of data/signal analysis and engineering support to the DoD customer and Intel community. Managed contract resources including budgets, labor, and equipment.  \nConceived, developed and presented new engineering concepts to the customer. Performed and/or monitored detailed digital signal processing tasks in support of contractual deliverables including systems/algorithms for signal detection, classification and recognition; data fusion; synthesis; and simulations. Briefed upper management and customers as required. Senior Systems Engineer/(Acting) Manager Raytheon April 1994  –  April 1997  (3 years 1 month) Systems Engineering Management for the Cobra Ball Data Analysis Lab. Clearance held: TS-SCI. Systems Engineering Task Leader for the contract providing a wide spectrum of data/signal analysis and engineering support to the DoD customer and Intel community. Managed contract resources including budgets, labor, and equipment.  \nConceived, developed and presented new engineering concepts to the customer. Performed and/or monitored detailed digital signal processing tasks in support of contractual deliverables including systems/algorithms for signal detection, classification and recognition; data fusion; synthesis; and simulations. Briefed upper management and customers as required. Senior Systems Engineer/Sr. Hardware Design Engineer E-Systems May 1989  –  April 1994  (5 years) IRAD Task Leader (FY96) supervised and participated in the development of a signal detection paradigm based on measurement and heuristic evaluation of signal metrics. Researched and identified the set of high priority signals-of-interest (SOI). Determined the set of parameters most significant in signal identity. Supervised successful development and demonstration using real world collected signals of PV-WAVE algorithms implementing the detection function. Briefed IRAD Management as required.  \nIRAD Task Leader (FY95) evaluated performance of an in-house signal recognition system consisting of embedded Mercury DSP boards. Determined system's capabilities for performing desired signal detection functions. Upgraded the OS of the VMEbus Sparc2 controller. Updated the software development tools and runtime kernels for the multiple Quad-i860 Mercury DSP boards. Installed X11R5 and Motif GUI libraries. Identified and implemented functional software enhancements in C and MATLAB. Successfully demonstrated upgraded system functionality. Recommended additional system upgrades. \nSenior Engineer in Hardware Development \nInvestigated, developed and proposed a hardware and software upgrade solution for a commercial off-the-shelf wideband communication analyzer and modulation classifier.  \nLead IRAD Systems Engineer of program chartered for the development of advanced software tools for parallel program development. Briefed management and potential customers. Technical liaison to the UTA parallel processing group (sub-contractor to E-Systems).  \nResearch Engineer on an IRAD study of direct sequence and frequency hopping spread spectrum demodulation techniques. Concentrated on the design and specification of non-coherent bit synchronization and conditioning of target communication signals. \nLead Engineer for the development, design and implementation of a multi-signal modulation synthesizer for testing demodulation systems. Designed, developed, fabricated, and tested DSP boards. Senior Systems Engineer/Sr. Hardware Design Engineer E-Systems May 1989  –  April 1994  (5 years) IRAD Task Leader (FY96) supervised and participated in the development of a signal detection paradigm based on measurement and heuristic evaluation of signal metrics. Researched and identified the set of high priority signals-of-interest (SOI). Determined the set of parameters most significant in signal identity. Supervised successful development and demonstration using real world collected signals of PV-WAVE algorithms implementing the detection function. Briefed IRAD Management as required.  \nIRAD Task Leader (FY95) evaluated performance of an in-house signal recognition system consisting of embedded Mercury DSP boards. Determined system's capabilities for performing desired signal detection functions. Upgraded the OS of the VMEbus Sparc2 controller. Updated the software development tools and runtime kernels for the multiple Quad-i860 Mercury DSP boards. Installed X11R5 and Motif GUI libraries. Identified and implemented functional software enhancements in C and MATLAB. Successfully demonstrated upgraded system functionality. Recommended additional system upgrades. \nSenior Engineer in Hardware Development \nInvestigated, developed and proposed a hardware and software upgrade solution for a commercial off-the-shelf wideband communication analyzer and modulation classifier.  \nLead IRAD Systems Engineer of program chartered for the development of advanced software tools for parallel program development. Briefed management and potential customers. Technical liaison to the UTA parallel processing group (sub-contractor to E-Systems).  \nResearch Engineer on an IRAD study of direct sequence and frequency hopping spread spectrum demodulation techniques. Concentrated on the design and specification of non-coherent bit synchronization and conditioning of target communication signals. \nLead Engineer for the development, design and implementation of a multi-signal modulation synthesizer for testing demodulation systems. Designed, developed, fabricated, and tested DSP boards. Member of the Technical Staff MITRE 1988  –  1989  (1 year) Worked in the VLSI/VHSIC Technical Center Member of the Technical Staff MITRE 1988  –  1989  (1 year) Worked in the VLSI/VHSIC Technical Center Senior Engineer Emerson Electric January 1984  –  March 1988  (4 years 3 months) Primarily worked on IR&D program:advanced computing architectures for military applications. Senior Engineer Emerson Electric January 1984  –  March 1988  (4 years 3 months) Primarily worked on IR&D program:advanced computing architectures for military applications. Skills Embedded Systems Signal Processing High Performance... C Matlab Linux Labview Electrical Engineering Algorithms Software Engineering Java Digital Signal... Distributed Systems Unix Software Development Realtime Programming Program Management Project Engineering Hyperspectral Imaging IBM Cell BE Processor Computer Architecture Simulations/Benchmarking Strategic Planning Multithreaded... Task Scheduling Load Balancing Visual Basic Business Development Microsoft Office IRAD/CRAD Multicore Fault Tolerance Visio Visual Studio Academia C/C++/C# MPI SISAL Functional... Dataflow Computing Hardware Development VxWorks RTOS Systems Engineering Active DoD Secret... Supercomputing Parallel Programming Oral & Written... C  Embedded Software FPGA See 35+     See less Skills  Embedded Systems Signal Processing High Performance... C Matlab Linux Labview Electrical Engineering Algorithms Software Engineering Java Digital Signal... Distributed Systems Unix Software Development Realtime Programming Program Management Project Engineering Hyperspectral Imaging IBM Cell BE Processor Computer Architecture Simulations/Benchmarking Strategic Planning Multithreaded... Task Scheduling Load Balancing Visual Basic Business Development Microsoft Office IRAD/CRAD Multicore Fault Tolerance Visio Visual Studio Academia C/C++/C# MPI SISAL Functional... Dataflow Computing Hardware Development VxWorks RTOS Systems Engineering Active DoD Secret... Supercomputing Parallel Programming Oral & Written... C  Embedded Software FPGA See 35+     See less Embedded Systems Signal Processing High Performance... C Matlab Linux Labview Electrical Engineering Algorithms Software Engineering Java Digital Signal... Distributed Systems Unix Software Development Realtime Programming Program Management Project Engineering Hyperspectral Imaging IBM Cell BE Processor Computer Architecture Simulations/Benchmarking Strategic Planning Multithreaded... Task Scheduling Load Balancing Visual Basic Business Development Microsoft Office IRAD/CRAD Multicore Fault Tolerance Visio Visual Studio Academia C/C++/C# MPI SISAL Functional... Dataflow Computing Hardware Development VxWorks RTOS Systems Engineering Active DoD Secret... Supercomputing Parallel Programming Oral & Written... C  Embedded Software FPGA See 35+     See less Embedded Systems Signal Processing High Performance... C Matlab Linux Labview Electrical Engineering Algorithms Software Engineering Java Digital Signal... Distributed Systems Unix Software Development Realtime Programming Program Management Project Engineering Hyperspectral Imaging IBM Cell BE Processor Computer Architecture Simulations/Benchmarking Strategic Planning Multithreaded... Task Scheduling Load Balancing Visual Basic Business Development Microsoft Office IRAD/CRAD Multicore Fault Tolerance Visio Visual Studio Academia C/C++/C# MPI SISAL Functional... Dataflow Computing Hardware Development VxWorks RTOS Systems Engineering Active DoD Secret... Supercomputing Parallel Programming Oral & Written... C  Embedded Software FPGA See 35+     See less Education The University of Texas at Dallas Doctor of Philosophy (Ph.D.) - in progress,  Computer Engineering 2009  – 2013 Activities and Societies:  founding member of student branch of the IEEE Computer Society University of Missouri-Rolla MSEE,  Computer Hardware Engineering 1984  – 1987 University of Missouri-Columbia BSEE,  Digital Computer Design 1979  – 1983 Activities and Societies:  Missouri Tigers Football 1979-80 (injury); Engineer's Club; VP Engineer's Club 1982-83; Eta Kappa Nu (HKN) ,  IEEE Student Member University of Missouri-Columbia BSCoE,  Computer Engineering 1979  – 1983 Activities and Societies:  1979-1981 Missouri Football Tigers (MIZZOU) ,  1982-1983 Vice-President Engineer's Club ,  Eta-Kappa-Nu ,  IEEE Student Member Pattonville High School Diploma 1975  – 1979 Southern Methodist University The University of Texas at Dallas Doctor of Philosophy (Ph.D.) - in progress,  Computer Engineering 2009  – 2013 Activities and Societies:  founding member of student branch of the IEEE Computer Society The University of Texas at Dallas Doctor of Philosophy (Ph.D.) - in progress,  Computer Engineering 2009  – 2013 Activities and Societies:  founding member of student branch of the IEEE Computer Society The University of Texas at Dallas Doctor of Philosophy (Ph.D.) - in progress,  Computer Engineering 2009  – 2013 Activities and Societies:  founding member of student branch of the IEEE Computer Society University of Missouri-Rolla MSEE,  Computer Hardware Engineering 1984  – 1987 University of Missouri-Rolla MSEE,  Computer Hardware Engineering 1984  – 1987 University of Missouri-Rolla MSEE,  Computer Hardware Engineering 1984  – 1987 University of Missouri-Columbia BSEE,  Digital Computer Design 1979  – 1983 Activities and Societies:  Missouri Tigers Football 1979-80 (injury); Engineer's Club; VP Engineer's Club 1982-83; Eta Kappa Nu (HKN) ,  IEEE Student Member University of Missouri-Columbia BSEE,  Digital Computer Design 1979  – 1983 Activities and Societies:  Missouri Tigers Football 1979-80 (injury); Engineer's Club; VP Engineer's Club 1982-83; Eta Kappa Nu (HKN) ,  IEEE Student Member University of Missouri-Columbia BSEE,  Digital Computer Design 1979  – 1983 Activities and Societies:  Missouri Tigers Football 1979-80 (injury); Engineer's Club; VP Engineer's Club 1982-83; Eta Kappa Nu (HKN) ,  IEEE Student Member University of Missouri-Columbia BSCoE,  Computer Engineering 1979  – 1983 Activities and Societies:  1979-1981 Missouri Football Tigers (MIZZOU) ,  1982-1983 Vice-President Engineer's Club ,  Eta-Kappa-Nu ,  IEEE Student Member University of Missouri-Columbia BSCoE,  Computer Engineering 1979  – 1983 Activities and Societies:  1979-1981 Missouri Football Tigers (MIZZOU) ,  1982-1983 Vice-President Engineer's Club ,  Eta-Kappa-Nu ,  IEEE Student Member University of Missouri-Columbia BSCoE,  Computer Engineering 1979  – 1983 Activities and Societies:  1979-1981 Missouri Football Tigers (MIZZOU) ,  1982-1983 Vice-President Engineer's Club ,  Eta-Kappa-Nu ,  IEEE Student Member Pattonville High School Diploma 1975  – 1979 Pattonville High School Diploma 1975  – 1979 Pattonville High School Diploma 1975  – 1979 Southern Methodist University Southern Methodist University Southern Methodist University ", "Experience Binary Translation Software Engineer Intel Corporation April 2015  – Present (5 months) Santa Clara CA I currently work on binary translation processor technology. Graduate Research Intern Intel Corporation July 2014  –  January 2015  (7 months) Santa Clara I work with the Binary Translation team investigating security applications of binary translation. My work explorers using binary translation as a solution for jump-oriented programming (JOP) malware attacks. As part of this work I reverse engineered multiple windows applications to learn their code behavior. I modified the binary translation software to identify valid targets of indirect jump instructions in the binary using both static binary information as well as dynamic information gathered at run-time. Research Assistant University of Minnesota January 2009  –  June 2014  (5 years 6 months) My research deals with various aspects of the memory characteristics of multi-threaded applications. In particular, I am interested in the performance and correctness issues of multi-threaded applications running on multi-core processors. As part of my research I explored the correctness issues during cross-ISA emulation of multi-threaded applications on multi-core processors. I worked on designing sharing-aware cache replacement policies for multi-threaded programs. I also worked on characterizing the performance of emerging multi-threaded workloads, and the effect of compiler optimizations on such programs. I have had a chance to work with a wide range of tools and simulators as part of my research. Graduate Research Intern Intel Corporation May 2012  –  December 2012  (8 months) Bangalore My internship work involved optimizing the memory performance of multi-threaded workloads on Intel's server processors. I extended the existing cache dead block predictor algorithm to handle simultaneous multi-threading. I explored the design of a sharing-aware last-level cache dead block predictor scheme for server workloads. As part of this work I conducted a detailed characterization study of the applications and proposed a novel dead block predictor scheme to improve their performance. I had a chance to work with Intel's in-house architecture simulator. The work resulted in a patent. Binary Translation Software Engineer Intel Corporation April 2015  – Present (5 months) Santa Clara CA I currently work on binary translation processor technology. Binary Translation Software Engineer Intel Corporation April 2015  – Present (5 months) Santa Clara CA I currently work on binary translation processor technology. Graduate Research Intern Intel Corporation July 2014  –  January 2015  (7 months) Santa Clara I work with the Binary Translation team investigating security applications of binary translation. My work explorers using binary translation as a solution for jump-oriented programming (JOP) malware attacks. As part of this work I reverse engineered multiple windows applications to learn their code behavior. I modified the binary translation software to identify valid targets of indirect jump instructions in the binary using both static binary information as well as dynamic information gathered at run-time. Graduate Research Intern Intel Corporation July 2014  –  January 2015  (7 months) Santa Clara I work with the Binary Translation team investigating security applications of binary translation. My work explorers using binary translation as a solution for jump-oriented programming (JOP) malware attacks. As part of this work I reverse engineered multiple windows applications to learn their code behavior. I modified the binary translation software to identify valid targets of indirect jump instructions in the binary using both static binary information as well as dynamic information gathered at run-time. Research Assistant University of Minnesota January 2009  –  June 2014  (5 years 6 months) My research deals with various aspects of the memory characteristics of multi-threaded applications. In particular, I am interested in the performance and correctness issues of multi-threaded applications running on multi-core processors. As part of my research I explored the correctness issues during cross-ISA emulation of multi-threaded applications on multi-core processors. I worked on designing sharing-aware cache replacement policies for multi-threaded programs. I also worked on characterizing the performance of emerging multi-threaded workloads, and the effect of compiler optimizations on such programs. I have had a chance to work with a wide range of tools and simulators as part of my research. Research Assistant University of Minnesota January 2009  –  June 2014  (5 years 6 months) My research deals with various aspects of the memory characteristics of multi-threaded applications. In particular, I am interested in the performance and correctness issues of multi-threaded applications running on multi-core processors. As part of my research I explored the correctness issues during cross-ISA emulation of multi-threaded applications on multi-core processors. I worked on designing sharing-aware cache replacement policies for multi-threaded programs. I also worked on characterizing the performance of emerging multi-threaded workloads, and the effect of compiler optimizations on such programs. I have had a chance to work with a wide range of tools and simulators as part of my research. Graduate Research Intern Intel Corporation May 2012  –  December 2012  (8 months) Bangalore My internship work involved optimizing the memory performance of multi-threaded workloads on Intel's server processors. I extended the existing cache dead block predictor algorithm to handle simultaneous multi-threading. I explored the design of a sharing-aware last-level cache dead block predictor scheme for server workloads. As part of this work I conducted a detailed characterization study of the applications and proposed a novel dead block predictor scheme to improve their performance. I had a chance to work with Intel's in-house architecture simulator. The work resulted in a patent. Graduate Research Intern Intel Corporation May 2012  –  December 2012  (8 months) Bangalore My internship work involved optimizing the memory performance of multi-threaded workloads on Intel's server processors. I extended the existing cache dead block predictor algorithm to handle simultaneous multi-threading. I explored the design of a sharing-aware last-level cache dead block predictor scheme for server workloads. As part of this work I conducted a detailed characterization study of the applications and proposed a novel dead block predictor scheme to improve their performance. I had a chance to work with Intel's in-house architecture simulator. The work resulted in a patent. Languages Tamil Hindi Kannada Tamil Hindi Kannada Tamil Hindi Kannada Skills Computer Architecture Cache Coherency Parallel Computing Microarchitecture C C++ Vim Parallel Programming Linux Python Algorithms Simics CUDA Algorithm Design LaTeX Shell Scripting Multithreading Fortran Simulations High Performance... MPI Mathematica See 7+     See less Skills  Computer Architecture Cache Coherency Parallel Computing Microarchitecture C C++ Vim Parallel Programming Linux Python Algorithms Simics CUDA Algorithm Design LaTeX Shell Scripting Multithreading Fortran Simulations High Performance... MPI Mathematica See 7+     See less Computer Architecture Cache Coherency Parallel Computing Microarchitecture C C++ Vim Parallel Programming Linux Python Algorithms Simics CUDA Algorithm Design LaTeX Shell Scripting Multithreading Fortran Simulations High Performance... MPI Mathematica See 7+     See less Computer Architecture Cache Coherency Parallel Computing Microarchitecture C C++ Vim Parallel Programming Linux Python Algorithms Simics CUDA Algorithm Design LaTeX Shell Scripting Multithreading Fortran Simulations High Performance... MPI Mathematica See 7+     See less Education University of Minnesota-Twin Cities PhD,  Computer Science 2010  – 2015 University of Minnesota-Twin Cities M.S,  Computer Science 2008  – 2015 National Institute of Technology Tiruchirappalli B.Tech,  Computer Science 2004  – 2008 University of Minnesota-Twin Cities PhD,  Computer Science 2010  – 2015 University of Minnesota-Twin Cities PhD,  Computer Science 2010  – 2015 University of Minnesota-Twin Cities PhD,  Computer Science 2010  – 2015 University of Minnesota-Twin Cities M.S,  Computer Science 2008  – 2015 University of Minnesota-Twin Cities M.S,  Computer Science 2008  – 2015 University of Minnesota-Twin Cities M.S,  Computer Science 2008  – 2015 National Institute of Technology Tiruchirappalli B.Tech,  Computer Science 2004  – 2008 National Institute of Technology Tiruchirappalli B.Tech,  Computer Science 2004  – 2008 National Institute of Technology Tiruchirappalli B.Tech,  Computer Science 2004  – 2008 ", "Summary I am a fourth year PhD student at the Electrical and Computer Engineering Department of Georgia Institute of Technology, emphasizing on the area of VLSI. \n \n \nMy research focus lie in the development of error-resilient methodologies for reliability in control system. In the past I have worked on design of fault-tolerant analog circuits and error checking of linear control systems. Summary I am a fourth year PhD student at the Electrical and Computer Engineering Department of Georgia Institute of Technology, emphasizing on the area of VLSI. \n \n \nMy research focus lie in the development of error-resilient methodologies for reliability in control system. In the past I have worked on design of fault-tolerant analog circuits and error checking of linear control systems. I am a fourth year PhD student at the Electrical and Computer Engineering Department of Georgia Institute of Technology, emphasizing on the area of VLSI. \n \n \nMy research focus lie in the development of error-resilient methodologies for reliability in control system. In the past I have worked on design of fault-tolerant analog circuits and error checking of linear control systems. I am a fourth year PhD student at the Electrical and Computer Engineering Department of Georgia Institute of Technology, emphasizing on the area of VLSI. \n \n \nMy research focus lie in the development of error-resilient methodologies for reliability in control system. In the past I have worked on design of fault-tolerant analog circuits and error checking of linear control systems. Experience Graduate Research Assistant Georgia Institute of Technology August 2012  – Present (3 years 1 month) Ph.D. candidate in Testing and Reliability Engineering Lab, ECE Department, Georgia Tech \nGPA: 4.0/4.0 Graduate Research Intern Intel Corporation May 2015  –  August 2015  (4 months) Santa Clara, California Strategic CAD Labs (SCL) - Investigated the problem of automated generation of test stimuli for analog circuits used in high-speed I/O systems. Graduate Research Intern Intel Corporation May 2014  –  August 2014  (4 months) Santa Clara, California Strategic CAD Labs (SCL) - Investigated the problem of automated generation of test stimuli for analog circuits used in high-speed I/O systems. Consultant PwC August 2011  –  April 2012  (9 months) SAP Consultant Summer Intern Indian Statistical Instiute, Kolkata May 2010  –  August 2010  (4 months) Kolkata I worked on BMF (Best Member Fit) algorithm for determining the best rotation matrix for two proteins to have the best fit by minimizing the least square distance. This work was on the field of bio-informatics. Graduate Research Assistant Georgia Institute of Technology August 2012  – Present (3 years 1 month) Ph.D. candidate in Testing and Reliability Engineering Lab, ECE Department, Georgia Tech \nGPA: 4.0/4.0 Graduate Research Assistant Georgia Institute of Technology August 2012  – Present (3 years 1 month) Ph.D. candidate in Testing and Reliability Engineering Lab, ECE Department, Georgia Tech \nGPA: 4.0/4.0 Graduate Research Intern Intel Corporation May 2015  –  August 2015  (4 months) Santa Clara, California Strategic CAD Labs (SCL) - Investigated the problem of automated generation of test stimuli for analog circuits used in high-speed I/O systems. Graduate Research Intern Intel Corporation May 2015  –  August 2015  (4 months) Santa Clara, California Strategic CAD Labs (SCL) - Investigated the problem of automated generation of test stimuli for analog circuits used in high-speed I/O systems. Graduate Research Intern Intel Corporation May 2014  –  August 2014  (4 months) Santa Clara, California Strategic CAD Labs (SCL) - Investigated the problem of automated generation of test stimuli for analog circuits used in high-speed I/O systems. Graduate Research Intern Intel Corporation May 2014  –  August 2014  (4 months) Santa Clara, California Strategic CAD Labs (SCL) - Investigated the problem of automated generation of test stimuli for analog circuits used in high-speed I/O systems. Consultant PwC August 2011  –  April 2012  (9 months) SAP Consultant Consultant PwC August 2011  –  April 2012  (9 months) SAP Consultant Summer Intern Indian Statistical Instiute, Kolkata May 2010  –  August 2010  (4 months) Kolkata I worked on BMF (Best Member Fit) algorithm for determining the best rotation matrix for two proteins to have the best fit by minimizing the least square distance. This work was on the field of bio-informatics. Summer Intern Indian Statistical Instiute, Kolkata May 2010  –  August 2010  (4 months) Kolkata I worked on BMF (Best Member Fit) algorithm for determining the best rotation matrix for two proteins to have the best fit by minimizing the least square distance. This work was on the field of bio-informatics. Languages English Full professional proficiency Bengali Native or bilingual proficiency Hindi Professional working proficiency English Full professional proficiency Bengali Native or bilingual proficiency Hindi Professional working proficiency English Full professional proficiency Bengali Native or bilingual proficiency Hindi Professional working proficiency Full professional proficiency Native or bilingual proficiency Professional working proficiency Skills Matlab Signal Processing Cadence Virtuoso LaTeX C Circuit Design VLSI Analog SKILL (Oceanscript) Python Agilent ADS Unix Shell Scripting Machine Learning Image Processing Optimization Algorithms C++ Shell Scripting Simulations See 4+     See less Skills  Matlab Signal Processing Cadence Virtuoso LaTeX C Circuit Design VLSI Analog SKILL (Oceanscript) Python Agilent ADS Unix Shell Scripting Machine Learning Image Processing Optimization Algorithms C++ Shell Scripting Simulations See 4+     See less Matlab Signal Processing Cadence Virtuoso LaTeX C Circuit Design VLSI Analog SKILL (Oceanscript) Python Agilent ADS Unix Shell Scripting Machine Learning Image Processing Optimization Algorithms C++ Shell Scripting Simulations See 4+     See less Matlab Signal Processing Cadence Virtuoso LaTeX C Circuit Design VLSI Analog SKILL (Oceanscript) Python Agilent ADS Unix Shell Scripting Machine Learning Image Processing Optimization Algorithms C++ Shell Scripting Simulations See 4+     See less Education Georgia Institute of Technology Ph.D,  Electrical and Computer Engineering , 4.0/4.0 2012  – 2016 Graduate Research Assistant, Testing and Reliability Engineering Lab, \nSchool of Electrical and Computer Engineering Georgia Institute of Technology Master's Degree,  Electrical and Computer Engineering , 4.0/4.0 2012  – 2014 Primary Technical Area of Interest: VLSI and Digital Design Jadavpur University Bachelor of Engineering (B.E.),  Electrical Engineering , 8.82/10.0 2007  – 2011 Class Rank 3/106 Kanailal Vidyamandir 2005  – 2007 Aurobindo Vidyamandir 1995  – 2005 Georgia Institute of Technology Ph.D,  Electrical and Computer Engineering , 4.0/4.0 2012  – 2016 Graduate Research Assistant, Testing and Reliability Engineering Lab, \nSchool of Electrical and Computer Engineering Georgia Institute of Technology Ph.D,  Electrical and Computer Engineering , 4.0/4.0 2012  – 2016 Graduate Research Assistant, Testing and Reliability Engineering Lab, \nSchool of Electrical and Computer Engineering Georgia Institute of Technology Ph.D,  Electrical and Computer Engineering , 4.0/4.0 2012  – 2016 Graduate Research Assistant, Testing and Reliability Engineering Lab, \nSchool of Electrical and Computer Engineering Georgia Institute of Technology Master's Degree,  Electrical and Computer Engineering , 4.0/4.0 2012  – 2014 Primary Technical Area of Interest: VLSI and Digital Design Georgia Institute of Technology Master's Degree,  Electrical and Computer Engineering , 4.0/4.0 2012  – 2014 Primary Technical Area of Interest: VLSI and Digital Design Georgia Institute of Technology Master's Degree,  Electrical and Computer Engineering , 4.0/4.0 2012  – 2014 Primary Technical Area of Interest: VLSI and Digital Design Jadavpur University Bachelor of Engineering (B.E.),  Electrical Engineering , 8.82/10.0 2007  – 2011 Class Rank 3/106 Jadavpur University Bachelor of Engineering (B.E.),  Electrical Engineering , 8.82/10.0 2007  – 2011 Class Rank 3/106 Jadavpur University Bachelor of Engineering (B.E.),  Electrical Engineering , 8.82/10.0 2007  – 2011 Class Rank 3/106 Kanailal Vidyamandir 2005  – 2007 Kanailal Vidyamandir 2005  – 2007 Kanailal Vidyamandir 2005  – 2007 Aurobindo Vidyamandir 1995  – 2005 Aurobindo Vidyamandir 1995  – 2005 Aurobindo Vidyamandir 1995  – 2005 ", "Summary Specialties : Image/Video Processing algorithms and Compression, Objective Video Quality, Low Power Algorithms and Architectures for Image/Video Coding, Complexity reduction techniques \n \nImage/Video Coding Standards : JPEG, MPEG-2, MPEG-4, H.264 AVC/SVC \n \nLanguages – C, C++ \nPackages – MatLAB, VTune, ffmpeg, Visual Studio Summary Specialties : Image/Video Processing algorithms and Compression, Objective Video Quality, Low Power Algorithms and Architectures for Image/Video Coding, Complexity reduction techniques \n \nImage/Video Coding Standards : JPEG, MPEG-2, MPEG-4, H.264 AVC/SVC \n \nLanguages – C, C++ \nPackages – MatLAB, VTune, ffmpeg, Visual Studio Specialties : Image/Video Processing algorithms and Compression, Objective Video Quality, Low Power Algorithms and Architectures for Image/Video Coding, Complexity reduction techniques \n \nImage/Video Coding Standards : JPEG, MPEG-2, MPEG-4, H.264 AVC/SVC \n \nLanguages – C, C++ \nPackages – MatLAB, VTune, ffmpeg, Visual Studio Specialties : Image/Video Processing algorithms and Compression, Objective Video Quality, Low Power Algorithms and Architectures for Image/Video Coding, Complexity reduction techniques \n \nImage/Video Coding Standards : JPEG, MPEG-2, MPEG-4, H.264 AVC/SVC \n \nLanguages – C, C++ \nPackages – MatLAB, VTune, ffmpeg, Visual Studio Experience Graphics Hardware Engineer Intel Corporation September 2010  – Present (5 years) Research Assistant Multimedia Networking Group - Arizona State University May 2009  –  September 2010  (1 year 5 months) Tempe, Arizona Analyzed, studied and evaluated video quality metrics for subjective and objective video services.  \n1 Related publication in IEEE Transactions in Broadcasting. (available upon request) Research Assistant Low Power Systems Group - Arizona State University August 2008  –  September 2010  (2 years 2 months) Tempe, Arizona Designed a parallel and scalable deblocking filter implementation for H.264 AVC/SVC. Mapped the system level design to an efficient low power custom architecture. 1 Related publication in IEEE SiPS 2010 (available upon request) \n \nDeveloped customized low power designs to map H.264 algorithms to wide-SIMD architectures (collaborated research with University of Michigan Ann Arbor). 1 Related publication in IEEE SAMOS 2009 (available upon request) \n \nDeveloped techniques for compression/complexity reduction in H.264 SVC/AVC. Worked on post-processing algorithms to reduce blocking artifacts in Image and Video sequences. Developed low power hardware efficient implementations for DCT. 1 Related publication in IEEE MWSCAS 2009 (available upon request) \n \nAnalyzed algorithms like de-blurring, de-noising, histogram, edge detection, and segmentation for applications in next generation mobile devices. Also studied implementing these algorithms on GPGPUs for faster/parallel processing. Chair IEEE Student Branch - ASU December 2009  –  August 2010  (9 months) Tempe, Arizona Graduate Research Intern Intel Corporation August 2009  –  August 2010  (1 year 1 month) Chandler, Arizona Developed algorithms for Video Analytics on software co-processors (driven by IA), directed at potential video surveillance applications. These algorithms were thoroughly analyzed and compared for speed and performance on single/multiple co-processors driven by atom (low power), client and server (high performance) platforms. Activities Chair IEEE Student Branch - ASU August 2009  –  December 2009  (5 months) Tempe, Arizona Summer Intern Philips Research Labs June 2009  –  August 2009  (3 months) New York Studied medical imaging and successfully developed a 3D volume rendering algorithm to give a 3D view to individually captured MRI and CT imaging data sets using Visualization Toolkit (VTK). This was in close collaboration with doctors and research students at Stanford University aimed at curing atrial fibrillation. Summer Fellowship Indian Institute of Technology, Madras May 2007  –  July 2007  (3 months) Tamil Nadu, India Developed algorithms for hardware/power reduced state space structures in digital filters. Studied noise gain expressions for low noise digital filters. 1 Related publication in IEEE MWSCAS 2009 (available upon request) Research Fellowship Nanyang Technological University May 2006  –  July 2006  (3 months) Singapore Developed algorithms for low-complexity implementations of digital filters. Also developed algorithms to implement low-complexity DCT for multimedia devices. 2 Related publications - IEEE ISCAS 2007, and IEEE ICSPCS 2007 (available upon request) Graphics Hardware Engineer Intel Corporation September 2010  – Present (5 years) Graphics Hardware Engineer Intel Corporation September 2010  – Present (5 years) Research Assistant Multimedia Networking Group - Arizona State University May 2009  –  September 2010  (1 year 5 months) Tempe, Arizona Analyzed, studied and evaluated video quality metrics for subjective and objective video services.  \n1 Related publication in IEEE Transactions in Broadcasting. (available upon request) Research Assistant Multimedia Networking Group - Arizona State University May 2009  –  September 2010  (1 year 5 months) Tempe, Arizona Analyzed, studied and evaluated video quality metrics for subjective and objective video services.  \n1 Related publication in IEEE Transactions in Broadcasting. (available upon request) Research Assistant Low Power Systems Group - Arizona State University August 2008  –  September 2010  (2 years 2 months) Tempe, Arizona Designed a parallel and scalable deblocking filter implementation for H.264 AVC/SVC. Mapped the system level design to an efficient low power custom architecture. 1 Related publication in IEEE SiPS 2010 (available upon request) \n \nDeveloped customized low power designs to map H.264 algorithms to wide-SIMD architectures (collaborated research with University of Michigan Ann Arbor). 1 Related publication in IEEE SAMOS 2009 (available upon request) \n \nDeveloped techniques for compression/complexity reduction in H.264 SVC/AVC. Worked on post-processing algorithms to reduce blocking artifacts in Image and Video sequences. Developed low power hardware efficient implementations for DCT. 1 Related publication in IEEE MWSCAS 2009 (available upon request) \n \nAnalyzed algorithms like de-blurring, de-noising, histogram, edge detection, and segmentation for applications in next generation mobile devices. Also studied implementing these algorithms on GPGPUs for faster/parallel processing. Research Assistant Low Power Systems Group - Arizona State University August 2008  –  September 2010  (2 years 2 months) Tempe, Arizona Designed a parallel and scalable deblocking filter implementation for H.264 AVC/SVC. Mapped the system level design to an efficient low power custom architecture. 1 Related publication in IEEE SiPS 2010 (available upon request) \n \nDeveloped customized low power designs to map H.264 algorithms to wide-SIMD architectures (collaborated research with University of Michigan Ann Arbor). 1 Related publication in IEEE SAMOS 2009 (available upon request) \n \nDeveloped techniques for compression/complexity reduction in H.264 SVC/AVC. Worked on post-processing algorithms to reduce blocking artifacts in Image and Video sequences. Developed low power hardware efficient implementations for DCT. 1 Related publication in IEEE MWSCAS 2009 (available upon request) \n \nAnalyzed algorithms like de-blurring, de-noising, histogram, edge detection, and segmentation for applications in next generation mobile devices. Also studied implementing these algorithms on GPGPUs for faster/parallel processing. Chair IEEE Student Branch - ASU December 2009  –  August 2010  (9 months) Tempe, Arizona Chair IEEE Student Branch - ASU December 2009  –  August 2010  (9 months) Tempe, Arizona Graduate Research Intern Intel Corporation August 2009  –  August 2010  (1 year 1 month) Chandler, Arizona Developed algorithms for Video Analytics on software co-processors (driven by IA), directed at potential video surveillance applications. These algorithms were thoroughly analyzed and compared for speed and performance on single/multiple co-processors driven by atom (low power), client and server (high performance) platforms. Graduate Research Intern Intel Corporation August 2009  –  August 2010  (1 year 1 month) Chandler, Arizona Developed algorithms for Video Analytics on software co-processors (driven by IA), directed at potential video surveillance applications. These algorithms were thoroughly analyzed and compared for speed and performance on single/multiple co-processors driven by atom (low power), client and server (high performance) platforms. Activities Chair IEEE Student Branch - ASU August 2009  –  December 2009  (5 months) Tempe, Arizona Activities Chair IEEE Student Branch - ASU August 2009  –  December 2009  (5 months) Tempe, Arizona Summer Intern Philips Research Labs June 2009  –  August 2009  (3 months) New York Studied medical imaging and successfully developed a 3D volume rendering algorithm to give a 3D view to individually captured MRI and CT imaging data sets using Visualization Toolkit (VTK). This was in close collaboration with doctors and research students at Stanford University aimed at curing atrial fibrillation. Summer Intern Philips Research Labs June 2009  –  August 2009  (3 months) New York Studied medical imaging and successfully developed a 3D volume rendering algorithm to give a 3D view to individually captured MRI and CT imaging data sets using Visualization Toolkit (VTK). This was in close collaboration with doctors and research students at Stanford University aimed at curing atrial fibrillation. Summer Fellowship Indian Institute of Technology, Madras May 2007  –  July 2007  (3 months) Tamil Nadu, India Developed algorithms for hardware/power reduced state space structures in digital filters. Studied noise gain expressions for low noise digital filters. 1 Related publication in IEEE MWSCAS 2009 (available upon request) Summer Fellowship Indian Institute of Technology, Madras May 2007  –  July 2007  (3 months) Tamil Nadu, India Developed algorithms for hardware/power reduced state space structures in digital filters. Studied noise gain expressions for low noise digital filters. 1 Related publication in IEEE MWSCAS 2009 (available upon request) Research Fellowship Nanyang Technological University May 2006  –  July 2006  (3 months) Singapore Developed algorithms for low-complexity implementations of digital filters. Also developed algorithms to implement low-complexity DCT for multimedia devices. 2 Related publications - IEEE ISCAS 2007, and IEEE ICSPCS 2007 (available upon request) Research Fellowship Nanyang Technological University May 2006  –  July 2006  (3 months) Singapore Developed algorithms for low-complexity implementations of digital filters. Also developed algorithms to implement low-complexity DCT for multimedia devices. 2 Related publications - IEEE ISCAS 2007, and IEEE ICSPCS 2007 (available upon request) Skills Digital Signal... C Algorithms Signal Processing Matlab C++ Simulations Testing System Architecture Visual Studio H.264 Image Processing Low-power Design Skills  Digital Signal... C Algorithms Signal Processing Matlab C++ Simulations Testing System Architecture Visual Studio H.264 Image Processing Low-power Design Digital Signal... C Algorithms Signal Processing Matlab C++ Simulations Testing System Architecture Visual Studio H.264 Image Processing Low-power Design Digital Signal... C Algorithms Signal Processing Matlab C++ Simulations Testing System Architecture Visual Studio H.264 Image Processing Low-power Design Education Arizona State University Master of Science (M.S),  Electrical Engineering 2008  – 2010 National Institute of Technology Tiruchirappalli Bachelor of Technology (B.Tech),  Electronics and Instrumentation Engineering 2004  – 2008 Arizona State University Master of Science (M.S),  Electrical Engineering 2008  – 2010 Arizona State University Master of Science (M.S),  Electrical Engineering 2008  – 2010 Arizona State University Master of Science (M.S),  Electrical Engineering 2008  – 2010 National Institute of Technology Tiruchirappalli Bachelor of Technology (B.Tech),  Electronics and Instrumentation Engineering 2004  – 2008 National Institute of Technology Tiruchirappalli Bachelor of Technology (B.Tech),  Electronics and Instrumentation Engineering 2004  – 2008 National Institute of Technology Tiruchirappalli Bachelor of Technology (B.Tech),  Electronics and Instrumentation Engineering 2004  – 2008 Honors & Awards Additional Honors & Awards Invited reviewer for select Signal Processing Conferences/Journals, 2008 \n \nNanyang Technological University Ministry of Defense Fellowship, 2008 \n \nInvited Lecture Presentations at major IEEE conferences. 2007-2009 \n \nDept. of Science and Technology, Govt. of India - Research Sponsorship, 2007 Additional Honors & Awards Invited reviewer for select Signal Processing Conferences/Journals, 2008 \n \nNanyang Technological University Ministry of Defense Fellowship, 2008 \n \nInvited Lecture Presentations at major IEEE conferences. 2007-2009 \n \nDept. of Science and Technology, Govt. of India - Research Sponsorship, 2007 Additional Honors & Awards Invited reviewer for select Signal Processing Conferences/Journals, 2008 \n \nNanyang Technological University Ministry of Defense Fellowship, 2008 \n \nInvited Lecture Presentations at major IEEE conferences. 2007-2009 \n \nDept. of Science and Technology, Govt. of India - Research Sponsorship, 2007 Additional Honors & Awards Invited reviewer for select Signal Processing Conferences/Journals, 2008 \n \nNanyang Technological University Ministry of Defense Fellowship, 2008 \n \nInvited Lecture Presentations at major IEEE conferences. 2007-2009 \n \nDept. of Science and Technology, Govt. of India - Research Sponsorship, 2007 ", "Languages English Native or bilingual proficiency Hindi Native or bilingual proficiency Punjabi Native or bilingual proficiency English Native or bilingual proficiency Hindi Native or bilingual proficiency Punjabi Native or bilingual proficiency English Native or bilingual proficiency Hindi Native or bilingual proficiency Punjabi Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Strategic Planning High Performance... Parallel Computing Acceleration Algorithms Computer Architecture Metrics C C++ GPGPU VLSI EDA FPGA Diversity Champion Youth Mentoring Community Outreach Logic Synthesis DFT Programming Processors Optimization Machine Learning Perl Strategy Product Management See 10+     See less Skills  Strategic Planning High Performance... Parallel Computing Acceleration Algorithms Computer Architecture Metrics C C++ GPGPU VLSI EDA FPGA Diversity Champion Youth Mentoring Community Outreach Logic Synthesis DFT Programming Processors Optimization Machine Learning Perl Strategy Product Management See 10+     See less Strategic Planning High Performance... Parallel Computing Acceleration Algorithms Computer Architecture Metrics C C++ GPGPU VLSI EDA FPGA Diversity Champion Youth Mentoring Community Outreach Logic Synthesis DFT Programming Processors Optimization Machine Learning Perl Strategy Product Management See 10+     See less Strategic Planning High Performance... Parallel Computing Acceleration Algorithms Computer Architecture Metrics C C++ GPGPU VLSI EDA FPGA Diversity Champion Youth Mentoring Community Outreach Logic Synthesis DFT Programming Processors Optimization Machine Learning Perl Strategy Product Management See 10+     See less Honors & Awards Intel Division Recognition Award 2012 SCL Research Award 2012 NVIDIA Fellow 2008 Additional Honors & Awards • Publication featured in ‘ACM Top 10 Downloaded Papers 2009’ for 400+ downloads.  \n• Nominated for Best Paper in ACM TODAES 2009-2010. \n• Awarded Best Student Paper at ITSW 2009. \n• Awarded Graduate Scholarship by Electrical Engineering Dept., Texas A&M University 2004-09. \n• Awarded Top 1% rank in the Ramanujan Society of Born Mathematicians, Math Talent Examination. Intel Division Recognition Award 2012 Intel Division Recognition Award 2012 Intel Division Recognition Award 2012 SCL Research Award 2012 SCL Research Award 2012 SCL Research Award 2012 NVIDIA Fellow 2008 NVIDIA Fellow 2008 NVIDIA Fellow 2008 Additional Honors & Awards • Publication featured in ‘ACM Top 10 Downloaded Papers 2009’ for 400+ downloads.  \n• Nominated for Best Paper in ACM TODAES 2009-2010. \n• Awarded Best Student Paper at ITSW 2009. \n• Awarded Graduate Scholarship by Electrical Engineering Dept., Texas A&M University 2004-09. \n• Awarded Top 1% rank in the Ramanujan Society of Born Mathematicians, Math Talent Examination. Additional Honors & Awards • Publication featured in ‘ACM Top 10 Downloaded Papers 2009’ for 400+ downloads.  \n• Nominated for Best Paper in ACM TODAES 2009-2010. \n• Awarded Best Student Paper at ITSW 2009. \n• Awarded Graduate Scholarship by Electrical Engineering Dept., Texas A&M University 2004-09. \n• Awarded Top 1% rank in the Ramanujan Society of Born Mathematicians, Math Talent Examination. Additional Honors & Awards • Publication featured in ‘ACM Top 10 Downloaded Papers 2009’ for 400+ downloads.  \n• Nominated for Best Paper in ACM TODAES 2009-2010. \n• Awarded Best Student Paper at ITSW 2009. \n• Awarded Graduate Scholarship by Electrical Engineering Dept., Texas A&M University 2004-09. \n• Awarded Top 1% rank in the Ramanujan Society of Born Mathematicians, Math Talent Examination. ", "Summary •\t10+ years of hardware development experience in pre-silicon modeling/analysis/verification, system architecture, algorithm design, and post-silicon validation/debug on System-on-Chip (SoC) platforms. \n•\tStrong background of cache/memory controller design, algorithm, microprocessor architecture, on-chip bus protocols (AMBA, ACE, etc), Networks-on-Chip architectures, and user-centric design methodology. \n•\tMultidisciplinary in image processing, multimedia applications (JPEG/JPEG2000, MPEG4 video codecs), machine learning algorithms, and process debugging/improvement skills (six sigma green belt certificated). \n \n \n Summary •\t10+ years of hardware development experience in pre-silicon modeling/analysis/verification, system architecture, algorithm design, and post-silicon validation/debug on System-on-Chip (SoC) platforms. \n•\tStrong background of cache/memory controller design, algorithm, microprocessor architecture, on-chip bus protocols (AMBA, ACE, etc), Networks-on-Chip architectures, and user-centric design methodology. \n•\tMultidisciplinary in image processing, multimedia applications (JPEG/JPEG2000, MPEG4 video codecs), machine learning algorithms, and process debugging/improvement skills (six sigma green belt certificated). \n \n \n •\t10+ years of hardware development experience in pre-silicon modeling/analysis/verification, system architecture, algorithm design, and post-silicon validation/debug on System-on-Chip (SoC) platforms. \n•\tStrong background of cache/memory controller design, algorithm, microprocessor architecture, on-chip bus protocols (AMBA, ACE, etc), Networks-on-Chip architectures, and user-centric design methodology. \n•\tMultidisciplinary in image processing, multimedia applications (JPEG/JPEG2000, MPEG4 video codecs), machine learning algorithms, and process debugging/improvement skills (six sigma green belt certificated). \n \n \n •\t10+ years of hardware development experience in pre-silicon modeling/analysis/verification, system architecture, algorithm design, and post-silicon validation/debug on System-on-Chip (SoC) platforms. \n•\tStrong background of cache/memory controller design, algorithm, microprocessor architecture, on-chip bus protocols (AMBA, ACE, etc), Networks-on-Chip architectures, and user-centric design methodology. \n•\tMultidisciplinary in image processing, multimedia applications (JPEG/JPEG2000, MPEG4 video codecs), machine learning algorithms, and process debugging/improvement skills (six sigma green belt certificated). \n \n \n Experience Staff Design Engineer Qualcomm August 2011  – Present (4 years 1 month) Greater San Diego Area •\tProposed hierarchical architecture with local router control; collected feedback about performance, physical design issues for next generation memory controller design. \n•\tDeveloped with deployment of PCDDR3/LPDDR3 setting and driver sequences for three post-silicon chips from scratch to production software; collaborated in product bringup and lab trouble-shooting. \n•\tPre-silicon RTL performance analysis, modeling validation and key performance indicator analysis on next generation memory controller IPs supporting LPDDR4. \n Real Time Embedded System Engineer GE Global Research Center May 2010  –  August 2011  (1 year 4 months) Niskayuna, NY •\tCreated communication protocol between ground and airborne systems and developed algorithms for fuel savings and navigation performance improvements for next generation aviation system. \n•\tLed a development team of three to model human walking behavior for pedestrian inertial navigation system and to develop algorithm for real-time human position tracking with a distance/accuracy of less than 1%. \n•\tDeveloped calibration algorithm on FPGA for computed tomography diagnostic imaging systems. Graduate Research Assistant Carnegie Mellon University July 2005  –  May 2010  (4 years 11 months) Pittsburgh, PA •\tProposed run-time optimization techniques for resource assignment on many-core systems. \nWe investigated critical metrics (e.g. network contention, system fragmentation) with the goal of maximizing the system performance and minimizing the energy consumption. The proposed algorithms are designed for architectures with irregular topologies or high-dimensional platforms and can support the fault-tolerant mechanisms while considering faulty cores and system reliability. \n•\tDeveloped a unified user-centric SoC design framework for both off-line design space exploration and on-line optimization techniques. \nThis framework targeted heterogeneous multi-processor SoCs supporting for one specific application or a diverse mix of large and small applications. We included explicitly the information about the user experience into the design process with the goal of minimizing the workload variation, before exploring flexible and extensible run-time resource management techniques that allow systems to adapt to run-time stimuli specific to different user needs. \n Graduate Research Intern Intel Corporation September 2008  –  December 2008  (4 months) Portland, Oregon Area •\tDeveloped system interconnect optimization algorithm trading off performance and physical metrics. \n•\tImplemented and validated the system interconnect with packet-based transaction using System C and proofed the good agreement between the analytical and simulation results. \n Graduate Research Assistant National Chiao Tung University July 2002  –  June 2004  (2 years) Hsinchu County/City, Taiwan •\tProposed algorithms for SoC interconnect verification patterns. \n•\tDeveloped algorithms to compute maximal sets of symmetric circuits inputs. \n Undergraduate Intern Sunplus December 2001  –  June 2002  (7 months) Taiwan •\tWrote programs for robots’ vision, hearing, and orientation control. \n•\tAssembled and debug for robots’ hardware. \n Undergraduate Research Assistant National Chiao Tung University July 2000  –  June 2002  (2 years) Hsinchu County/City, Taiwan •\tProposed an algorithm for symmetric DWT for JPEG. \n•\tImplemented the encoder/decoder of JPEG and JPEG2000 on Pocket PC using Microsoft Foundation Class Library. \n Staff Design Engineer Qualcomm August 2011  – Present (4 years 1 month) Greater San Diego Area •\tProposed hierarchical architecture with local router control; collected feedback about performance, physical design issues for next generation memory controller design. \n•\tDeveloped with deployment of PCDDR3/LPDDR3 setting and driver sequences for three post-silicon chips from scratch to production software; collaborated in product bringup and lab trouble-shooting. \n•\tPre-silicon RTL performance analysis, modeling validation and key performance indicator analysis on next generation memory controller IPs supporting LPDDR4. \n Staff Design Engineer Qualcomm August 2011  – Present (4 years 1 month) Greater San Diego Area •\tProposed hierarchical architecture with local router control; collected feedback about performance, physical design issues for next generation memory controller design. \n•\tDeveloped with deployment of PCDDR3/LPDDR3 setting and driver sequences for three post-silicon chips from scratch to production software; collaborated in product bringup and lab trouble-shooting. \n•\tPre-silicon RTL performance analysis, modeling validation and key performance indicator analysis on next generation memory controller IPs supporting LPDDR4. \n Real Time Embedded System Engineer GE Global Research Center May 2010  –  August 2011  (1 year 4 months) Niskayuna, NY •\tCreated communication protocol between ground and airborne systems and developed algorithms for fuel savings and navigation performance improvements for next generation aviation system. \n•\tLed a development team of three to model human walking behavior for pedestrian inertial navigation system and to develop algorithm for real-time human position tracking with a distance/accuracy of less than 1%. \n•\tDeveloped calibration algorithm on FPGA for computed tomography diagnostic imaging systems. Real Time Embedded System Engineer GE Global Research Center May 2010  –  August 2011  (1 year 4 months) Niskayuna, NY •\tCreated communication protocol between ground and airborne systems and developed algorithms for fuel savings and navigation performance improvements for next generation aviation system. \n•\tLed a development team of three to model human walking behavior for pedestrian inertial navigation system and to develop algorithm for real-time human position tracking with a distance/accuracy of less than 1%. \n•\tDeveloped calibration algorithm on FPGA for computed tomography diagnostic imaging systems. Graduate Research Assistant Carnegie Mellon University July 2005  –  May 2010  (4 years 11 months) Pittsburgh, PA •\tProposed run-time optimization techniques for resource assignment on many-core systems. \nWe investigated critical metrics (e.g. network contention, system fragmentation) with the goal of maximizing the system performance and minimizing the energy consumption. The proposed algorithms are designed for architectures with irregular topologies or high-dimensional platforms and can support the fault-tolerant mechanisms while considering faulty cores and system reliability. \n•\tDeveloped a unified user-centric SoC design framework for both off-line design space exploration and on-line optimization techniques. \nThis framework targeted heterogeneous multi-processor SoCs supporting for one specific application or a diverse mix of large and small applications. We included explicitly the information about the user experience into the design process with the goal of minimizing the workload variation, before exploring flexible and extensible run-time resource management techniques that allow systems to adapt to run-time stimuli specific to different user needs. \n Graduate Research Assistant Carnegie Mellon University July 2005  –  May 2010  (4 years 11 months) Pittsburgh, PA •\tProposed run-time optimization techniques for resource assignment on many-core systems. \nWe investigated critical metrics (e.g. network contention, system fragmentation) with the goal of maximizing the system performance and minimizing the energy consumption. The proposed algorithms are designed for architectures with irregular topologies or high-dimensional platforms and can support the fault-tolerant mechanisms while considering faulty cores and system reliability. \n•\tDeveloped a unified user-centric SoC design framework for both off-line design space exploration and on-line optimization techniques. \nThis framework targeted heterogeneous multi-processor SoCs supporting for one specific application or a diverse mix of large and small applications. We included explicitly the information about the user experience into the design process with the goal of minimizing the workload variation, before exploring flexible and extensible run-time resource management techniques that allow systems to adapt to run-time stimuli specific to different user needs. \n Graduate Research Intern Intel Corporation September 2008  –  December 2008  (4 months) Portland, Oregon Area •\tDeveloped system interconnect optimization algorithm trading off performance and physical metrics. \n•\tImplemented and validated the system interconnect with packet-based transaction using System C and proofed the good agreement between the analytical and simulation results. \n Graduate Research Intern Intel Corporation September 2008  –  December 2008  (4 months) Portland, Oregon Area •\tDeveloped system interconnect optimization algorithm trading off performance and physical metrics. \n•\tImplemented and validated the system interconnect with packet-based transaction using System C and proofed the good agreement between the analytical and simulation results. \n Graduate Research Assistant National Chiao Tung University July 2002  –  June 2004  (2 years) Hsinchu County/City, Taiwan •\tProposed algorithms for SoC interconnect verification patterns. \n•\tDeveloped algorithms to compute maximal sets of symmetric circuits inputs. \n Graduate Research Assistant National Chiao Tung University July 2002  –  June 2004  (2 years) Hsinchu County/City, Taiwan •\tProposed algorithms for SoC interconnect verification patterns. \n•\tDeveloped algorithms to compute maximal sets of symmetric circuits inputs. \n Undergraduate Intern Sunplus December 2001  –  June 2002  (7 months) Taiwan •\tWrote programs for robots’ vision, hearing, and orientation control. \n•\tAssembled and debug for robots’ hardware. \n Undergraduate Intern Sunplus December 2001  –  June 2002  (7 months) Taiwan •\tWrote programs for robots’ vision, hearing, and orientation control. \n•\tAssembled and debug for robots’ hardware. \n Undergraduate Research Assistant National Chiao Tung University July 2000  –  June 2002  (2 years) Hsinchu County/City, Taiwan •\tProposed an algorithm for symmetric DWT for JPEG. \n•\tImplemented the encoder/decoder of JPEG and JPEG2000 on Pocket PC using Microsoft Foundation Class Library. \n Undergraduate Research Assistant National Chiao Tung University July 2000  –  June 2002  (2 years) Hsinchu County/City, Taiwan •\tProposed an algorithm for symmetric DWT for JPEG. \n•\tImplemented the encoder/decoder of JPEG and JPEG2000 on Pocket PC using Microsoft Foundation Class Library. \n Languages Chinese Native or bilingual proficiency English Full professional proficiency Chinese Native or bilingual proficiency English Full professional proficiency Chinese Native or bilingual proficiency English Full professional proficiency Native or bilingual proficiency Full professional proficiency Skills Embedded Systems Matlab Verilog Signal Processing SoC FPGA Semiconductors Integrated Circuit... Python C++ C Algorithms Skills  Embedded Systems Matlab Verilog Signal Processing SoC FPGA Semiconductors Integrated Circuit... Python C++ C Algorithms Embedded Systems Matlab Verilog Signal Processing SoC FPGA Semiconductors Integrated Circuit... Python C++ C Algorithms Embedded Systems Matlab Verilog Signal Processing SoC FPGA Semiconductors Integrated Circuit... Python C++ C Algorithms Education Carnegie Mellon University Doctor of Philosophy (PhD),  Electrical and Computer Engineering 2005  – 2010 Network-on-Chip communication architecture, user-centric methodology, fault-tolerance design \n \nDissertation: Designing Embedded Multiprocessor Networks-on-Chip with Users in Mind  National Chiao Tung University Master of Science (M.S.),  Electronics Engineering 2002  – 2004 SoC verification \n \nThesis: On Automatic Pattern Generation for Interconnect Verification Based on Graph Automorphism  National Chiao Tung University Bachelor of Science (B.S.),  Electrical and Control Engineering 1998  – 2002 Project: JPEG/JPEG 2000 implementation on PocketPC using Microsoft Foundation Classes on Windows CE  Carnegie Mellon University Doctor of Philosophy (PhD),  Electrical and Computer Engineering 2005  – 2010 Network-on-Chip communication architecture, user-centric methodology, fault-tolerance design \n \nDissertation: Designing Embedded Multiprocessor Networks-on-Chip with Users in Mind  Carnegie Mellon University Doctor of Philosophy (PhD),  Electrical and Computer Engineering 2005  – 2010 Network-on-Chip communication architecture, user-centric methodology, fault-tolerance design \n \nDissertation: Designing Embedded Multiprocessor Networks-on-Chip with Users in Mind  Carnegie Mellon University Doctor of Philosophy (PhD),  Electrical and Computer Engineering 2005  – 2010 Network-on-Chip communication architecture, user-centric methodology, fault-tolerance design \n \nDissertation: Designing Embedded Multiprocessor Networks-on-Chip with Users in Mind  National Chiao Tung University Master of Science (M.S.),  Electronics Engineering 2002  – 2004 SoC verification \n \nThesis: On Automatic Pattern Generation for Interconnect Verification Based on Graph Automorphism  National Chiao Tung University Master of Science (M.S.),  Electronics Engineering 2002  – 2004 SoC verification \n \nThesis: On Automatic Pattern Generation for Interconnect Verification Based on Graph Automorphism  National Chiao Tung University Master of Science (M.S.),  Electronics Engineering 2002  – 2004 SoC verification \n \nThesis: On Automatic Pattern Generation for Interconnect Verification Based on Graph Automorphism  National Chiao Tung University Bachelor of Science (B.S.),  Electrical and Control Engineering 1998  – 2002 Project: JPEG/JPEG 2000 implementation on PocketPC using Microsoft Foundation Classes on Windows CE  National Chiao Tung University Bachelor of Science (B.S.),  Electrical and Control Engineering 1998  – 2002 Project: JPEG/JPEG 2000 implementation on PocketPC using Microsoft Foundation Classes on Windows CE  National Chiao Tung University Bachelor of Science (B.S.),  Electrical and Control Engineering 1998  – 2002 Project: JPEG/JPEG 2000 implementation on PocketPC using Microsoft Foundation Classes on Windows CE  Honors & Awards ACM Student Research Competition at 47th Design Automation Conference (DAC) Pre-Finalists 2010 46th Design Automation Conference (DAC) Mentor Award 2009 45th Design Automation Conference (DAC) Mentor Award 2008 44th Design Automation Conference (DAC) Young Student Award 2007 Research Fellowship 2005-2010 Highest grade for thesis 2004 Undergraduate student outstanding contribution Award 2002 Captain of the school badminton team winning consecutive awards for leadership 2010-2011 ACM Student Research Competition at 47th Design Automation Conference (DAC) Pre-Finalists 2010 ACM Student Research Competition at 47th Design Automation Conference (DAC) Pre-Finalists 2010 ACM Student Research Competition at 47th Design Automation Conference (DAC) Pre-Finalists 2010 46th Design Automation Conference (DAC) Mentor Award 2009 46th Design Automation Conference (DAC) Mentor Award 2009 46th Design Automation Conference (DAC) Mentor Award 2009 45th Design Automation Conference (DAC) Mentor Award 2008 45th Design Automation Conference (DAC) Mentor Award 2008 45th Design Automation Conference (DAC) Mentor Award 2008 44th Design Automation Conference (DAC) Young Student Award 2007 44th Design Automation Conference (DAC) Young Student Award 2007 44th Design Automation Conference (DAC) Young Student Award 2007 Research Fellowship 2005-2010 Research Fellowship 2005-2010 Research Fellowship 2005-2010 Highest grade for thesis 2004 Highest grade for thesis 2004 Highest grade for thesis 2004 Undergraduate student outstanding contribution Award 2002 Undergraduate student outstanding contribution Award 2002 Undergraduate student outstanding contribution Award 2002 Captain of the school badminton team winning consecutive awards for leadership 2010-2011 Captain of the school badminton team winning consecutive awards for leadership 2010-2011 Captain of the school badminton team winning consecutive awards for leadership 2010-2011 ", "Summary My work involves addressing fundamental problems in networking and information processing in sensor and multimedia networking. My work has been applied to various application domains including mobile health, urban sensing, coastal monitoring, smart buildings, and intelligent transportation. Summary My work involves addressing fundamental problems in networking and information processing in sensor and multimedia networking. My work has been applied to various application domains including mobile health, urban sensing, coastal monitoring, smart buildings, and intelligent transportation. My work involves addressing fundamental problems in networking and information processing in sensor and multimedia networking. My work has been applied to various application domains including mobile health, urban sensing, coastal monitoring, smart buildings, and intelligent transportation. My work involves addressing fundamental problems in networking and information processing in sensor and multimedia networking. My work has been applied to various application domains including mobile health, urban sensing, coastal monitoring, smart buildings, and intelligent transportation. Experience Backend Developer Spokeo March 2015  – Present (6 months) Pasadena, CA Assistant Professor Washington State University Vancouver August 2011  – Present (4 years 1 month) Vancouver, WA I lead NetLab, the Network Research Group at Washington State University Vancouver (http://netlab.encs.vancouver.wsu.edu/?page_id=22).  \n \n- Research: Pervasive sensing, video sensing, wireless networking, sensor networks, and compressive sensing \n+ Characterizing and developing network protocols for low-power wireless networks \n+ Leveraging platform-integrated sensors for human centric sensing \n+ Long-term large-scale human vision health monitoring \n- Teaching: Introduction to computer networks, Programming language design, Wireless sensor networks (graduate level) Graduate Research Intern Intel Corporation August 2010  –  July 2011  (1 year) Hillsboro, Oregon Design and develop sensing systems for smart building applications Research Assistant Portland State University September 2005  –  June 2011  (5 years 10 months) Portland, Oregon Area Research in information processing and large-scale tasking in wireless sensor networks \n \n- DHV open source protocol, now part of TinyOS official distribution \nhttp://tinyos.net and https://github.com/tinyos/tinyosmain/ \ntree/master/tos/lib/net/dhv Software Engineer Global CyberSoft JSC January 2005  –  September 2005  (9 months) Vietnam Develop cart picking systems for large-scale warehouses in Japan Research Assistant NICTA December 2003  –  September 2004  (10 months) Sydney Area, Australia Design an implement a RF-based robot localization system using Robust Extended Kalman Filter Backend Developer Spokeo March 2015  – Present (6 months) Pasadena, CA Backend Developer Spokeo March 2015  – Present (6 months) Pasadena, CA Assistant Professor Washington State University Vancouver August 2011  – Present (4 years 1 month) Vancouver, WA I lead NetLab, the Network Research Group at Washington State University Vancouver (http://netlab.encs.vancouver.wsu.edu/?page_id=22).  \n \n- Research: Pervasive sensing, video sensing, wireless networking, sensor networks, and compressive sensing \n+ Characterizing and developing network protocols for low-power wireless networks \n+ Leveraging platform-integrated sensors for human centric sensing \n+ Long-term large-scale human vision health monitoring \n- Teaching: Introduction to computer networks, Programming language design, Wireless sensor networks (graduate level) Assistant Professor Washington State University Vancouver August 2011  – Present (4 years 1 month) Vancouver, WA I lead NetLab, the Network Research Group at Washington State University Vancouver (http://netlab.encs.vancouver.wsu.edu/?page_id=22).  \n \n- Research: Pervasive sensing, video sensing, wireless networking, sensor networks, and compressive sensing \n+ Characterizing and developing network protocols for low-power wireless networks \n+ Leveraging platform-integrated sensors for human centric sensing \n+ Long-term large-scale human vision health monitoring \n- Teaching: Introduction to computer networks, Programming language design, Wireless sensor networks (graduate level) Graduate Research Intern Intel Corporation August 2010  –  July 2011  (1 year) Hillsboro, Oregon Design and develop sensing systems for smart building applications Graduate Research Intern Intel Corporation August 2010  –  July 2011  (1 year) Hillsboro, Oregon Design and develop sensing systems for smart building applications Research Assistant Portland State University September 2005  –  June 2011  (5 years 10 months) Portland, Oregon Area Research in information processing and large-scale tasking in wireless sensor networks \n \n- DHV open source protocol, now part of TinyOS official distribution \nhttp://tinyos.net and https://github.com/tinyos/tinyosmain/ \ntree/master/tos/lib/net/dhv Research Assistant Portland State University September 2005  –  June 2011  (5 years 10 months) Portland, Oregon Area Research in information processing and large-scale tasking in wireless sensor networks \n \n- DHV open source protocol, now part of TinyOS official distribution \nhttp://tinyos.net and https://github.com/tinyos/tinyosmain/ \ntree/master/tos/lib/net/dhv Software Engineer Global CyberSoft JSC January 2005  –  September 2005  (9 months) Vietnam Develop cart picking systems for large-scale warehouses in Japan Software Engineer Global CyberSoft JSC January 2005  –  September 2005  (9 months) Vietnam Develop cart picking systems for large-scale warehouses in Japan Research Assistant NICTA December 2003  –  September 2004  (10 months) Sydney Area, Australia Design an implement a RF-based robot localization system using Robust Extended Kalman Filter Research Assistant NICTA December 2003  –  September 2004  (10 months) Sydney Area, Australia Design an implement a RF-based robot localization system using Robust Extended Kalman Filter Languages Vietnamese Vietnamese Vietnamese Skills Computer Science Matlab C++ C LaTeX Programming Algorithms Java Python Wireless Sensor Networks Embedded Systems Software Engineering Linux Research Machine Learning Skills  Computer Science Matlab C++ C LaTeX Programming Algorithms Java Python Wireless Sensor Networks Embedded Systems Software Engineering Linux Research Machine Learning Computer Science Matlab C++ C LaTeX Programming Algorithms Java Python Wireless Sensor Networks Embedded Systems Software Engineering Linux Research Machine Learning Computer Science Matlab C++ C LaTeX Programming Algorithms Java Python Wireless Sensor Networks Embedded Systems Software Engineering Linux Research Machine Learning Education Portland State University Ph.D,  Computer Science 2005  – 2011 Research in several topics including low-power networking, multimedia networking, and information processing and large-scale tasking in wireless sensor networks University of Technology, Sydney BE,  Software Engineering 2001  – 2004 Designed and implemented a light weight remote method invocation library (lrmi) for embedded sensor platforms Portland State University Ph.D,  Computer Science 2005  – 2011 Research in several topics including low-power networking, multimedia networking, and information processing and large-scale tasking in wireless sensor networks Portland State University Ph.D,  Computer Science 2005  – 2011 Research in several topics including low-power networking, multimedia networking, and information processing and large-scale tasking in wireless sensor networks Portland State University Ph.D,  Computer Science 2005  – 2011 Research in several topics including low-power networking, multimedia networking, and information processing and large-scale tasking in wireless sensor networks University of Technology, Sydney BE,  Software Engineering 2001  – 2004 Designed and implemented a light weight remote method invocation library (lrmi) for embedded sensor platforms University of Technology, Sydney BE,  Software Engineering 2001  – 2004 Designed and implemented a light weight remote method invocation library (lrmi) for embedded sensor platforms University of Technology, Sydney BE,  Software Engineering 2001  – 2004 Designed and implemented a light weight remote method invocation library (lrmi) for embedded sensor platforms Honors & Awards Excellence Award Portland State University June 2011 Awarded to only one outgoing PhD student university-wide per academic year Commendation Award Maseeh College of Engineering and Computer Science, Portland State University May 2011 Awarded to only one outgoing PhD student college-wide Taste of Summer Research Scholarship University of New South Wales November 2003 Excellence Award Portland State University June 2011 Awarded to only one outgoing PhD student university-wide per academic year Excellence Award Portland State University June 2011 Awarded to only one outgoing PhD student university-wide per academic year Excellence Award Portland State University June 2011 Awarded to only one outgoing PhD student university-wide per academic year Commendation Award Maseeh College of Engineering and Computer Science, Portland State University May 2011 Awarded to only one outgoing PhD student college-wide Commendation Award Maseeh College of Engineering and Computer Science, Portland State University May 2011 Awarded to only one outgoing PhD student college-wide Commendation Award Maseeh College of Engineering and Computer Science, Portland State University May 2011 Awarded to only one outgoing PhD student college-wide Taste of Summer Research Scholarship University of New South Wales November 2003 Taste of Summer Research Scholarship University of New South Wales November 2003 Taste of Summer Research Scholarship University of New South Wales November 2003 ", "Experience Co-founder Diagram, Inc. June 2014  – Present (1 year 3 months) San Francisco, CA Co-founder Diagram, Inc. June 2014  – Present (1 year 3 months) San Francisco, CA Co-founder Diagram, Inc. June 2014  – Present (1 year 3 months) San Francisco, CA Skills Machine Learning Ruby Data Mining Computer Science Algorithms Artificial Intelligence Distributed Systems Hadoop Pattern Recognition Ruby on Rails Natural Language... Software Engineering Python MapReduce Computer Vision Skills  Machine Learning Ruby Data Mining Computer Science Algorithms Artificial Intelligence Distributed Systems Hadoop Pattern Recognition Ruby on Rails Natural Language... Software Engineering Python MapReduce Computer Vision Machine Learning Ruby Data Mining Computer Science Algorithms Artificial Intelligence Distributed Systems Hadoop Pattern Recognition Ruby on Rails Natural Language... Software Engineering Python MapReduce Computer Vision Machine Learning Ruby Data Mining Computer Science Algorithms Artificial Intelligence Distributed Systems Hadoop Pattern Recognition Ruby on Rails Natural Language... Software Engineering Python MapReduce Computer Vision Education Carnegie Mellon University Robotics 2005  – 2009 Georgia Tech Bachelor's degree,  Computer Science 1999  – 2003 Carnegie Mellon University Robotics 2005  – 2009 Carnegie Mellon University Robotics 2005  – 2009 Carnegie Mellon University Robotics 2005  – 2009 Georgia Tech Bachelor's degree,  Computer Science 1999  – 2003 Georgia Tech Bachelor's degree,  Computer Science 1999  – 2003 Georgia Tech Bachelor's degree,  Computer Science 1999  – 2003 ", "Summary Language design and analysis for bayesian inference, security and privacy. A little bit of abstract interpretation and non-determinancy due to concurrency amuses me from time to time. Summary Language design and analysis for bayesian inference, security and privacy. A little bit of abstract interpretation and non-determinancy due to concurrency amuses me from time to time. Language design and analysis for bayesian inference, security and privacy. A little bit of abstract interpretation and non-determinancy due to concurrency amuses me from time to time. Language design and analysis for bayesian inference, security and privacy. A little bit of abstract interpretation and non-determinancy due to concurrency amuses me from time to time. Experience Doctoral Student Harvard University 2014  – Present (1 year) Cambridge, Massachusetts Doctoral Student Harvard University 2014  – Present (1 year) Cambridge, Massachusetts Doctoral Student Harvard University 2014  – Present (1 year) Cambridge, Massachusetts Skills Skills     Education Harvard University Doctor of Philosophy (Ph.D.) 2014 Rice University 2013  – 2014 Andhra University B.Tech 2002  – 2006 Harvard University Doctor of Philosophy (Ph.D.) 2014 Harvard University Doctor of Philosophy (Ph.D.) 2014 Harvard University Doctor of Philosophy (Ph.D.) 2014 Rice University 2013  – 2014 Rice University 2013  – 2014 Rice University 2013  – 2014 Andhra University B.Tech 2002  – 2006 Andhra University B.Tech 2002  – 2006 Andhra University B.Tech 2002  – 2006 ", "Experience Staff Engineer Qualcomm Co-Founder and Chief Architect Coreopsys Inc January 2007  –  August 2008  (1 year 8 months) Graduate Research Intern Intel Corporation May 2006  –  August 2006  (4 months) Graduate Research Intern Intel Corporation May 2005  –  August 2005  (4 months) Senior Systems Engineer Proceler Inc. May 2000  –  December 2002  (2 years 8 months) Staff Engineer Qualcomm Staff Engineer Qualcomm Co-Founder and Chief Architect Coreopsys Inc January 2007  –  August 2008  (1 year 8 months) Co-Founder and Chief Architect Coreopsys Inc January 2007  –  August 2008  (1 year 8 months) Graduate Research Intern Intel Corporation May 2006  –  August 2006  (4 months) Graduate Research Intern Intel Corporation May 2006  –  August 2006  (4 months) Graduate Research Intern Intel Corporation May 2005  –  August 2005  (4 months) Graduate Research Intern Intel Corporation May 2005  –  August 2005  (4 months) Senior Systems Engineer Proceler Inc. May 2000  –  December 2002  (2 years 8 months) Senior Systems Engineer Proceler Inc. May 2000  –  December 2002  (2 years 8 months) Education Georgia Institute of Technology PhD,  ECE 2003  – 2011 Georgia Institute of Technology MS,  ECE 2002  – 2002 Georgia Institute of Technology 1999  – 2000 Indian Institute of Technology, Kanpur B. Tech,  Electrical Engineering 1995  – 1999 Georgia Institute of Technology PhD,  ECE 2003  – 2011 Georgia Institute of Technology PhD,  ECE 2003  – 2011 Georgia Institute of Technology PhD,  ECE 2003  – 2011 Georgia Institute of Technology MS,  ECE 2002  – 2002 Georgia Institute of Technology MS,  ECE 2002  – 2002 Georgia Institute of Technology MS,  ECE 2002  – 2002 Georgia Institute of Technology 1999  – 2000 Georgia Institute of Technology 1999  – 2000 Georgia Institute of Technology 1999  – 2000 Indian Institute of Technology, Kanpur B. Tech,  Electrical Engineering 1995  – 1999 Indian Institute of Technology, Kanpur B. Tech,  Electrical Engineering 1995  – 1999 Indian Institute of Technology, Kanpur B. Tech,  Electrical Engineering 1995  – 1999 ", "Summary Specialties: Electromagnetic Compatibility, Switching Power Supplies, Electrostatic Discharge Summary Specialties: Electromagnetic Compatibility, Switching Power Supplies, Electrostatic Discharge Specialties: Electromagnetic Compatibility, Switching Power Supplies, Electrostatic Discharge Specialties: Electromagnetic Compatibility, Switching Power Supplies, Electrostatic Discharge Experience Graduate Research Assistant Missouri S&T January 2012  – Present (3 years 8 months) Rolla, Missouri -Analysis of ESD-induced soft failures on mobile devices \n-Radiated emissions investigations \n-Conducted emissions investigations \n-High frequency transformer modeling Graduate Research Intern Intel Corporation January 2015  –  June 2015  (6 months) Graduate Student Researcher Intel Corporation January 2014  –  June 2014  (6 months) Munich Area, Germany System-level ESD topics such as soft failure analysis and ESD current propagation modeling. Graduate Student Researcher Intel Corporation September 2012  –  April 2013  (8 months) Munich Area, Germany Focused research topics in electrostatic discharge. Undergraduate Research Assistant Missouri S&T June 2010  –  December 2011  (1 year 7 months) Rolla, Missouri Designed a full featured 3 phase motor controller for use in an electric vehicle simulator. Quality Control and Test Engineer Process Solutions June 2008  –  August 2008  (3 months) Arlington, Washington Performed quality control tests on manufactured industrial control panels and solutions. Graduate Research Assistant Missouri S&T January 2012  – Present (3 years 8 months) Rolla, Missouri -Analysis of ESD-induced soft failures on mobile devices \n-Radiated emissions investigations \n-Conducted emissions investigations \n-High frequency transformer modeling Graduate Research Assistant Missouri S&T January 2012  – Present (3 years 8 months) Rolla, Missouri -Analysis of ESD-induced soft failures on mobile devices \n-Radiated emissions investigations \n-Conducted emissions investigations \n-High frequency transformer modeling Graduate Research Intern Intel Corporation January 2015  –  June 2015  (6 months) Graduate Research Intern Intel Corporation January 2015  –  June 2015  (6 months) Graduate Student Researcher Intel Corporation January 2014  –  June 2014  (6 months) Munich Area, Germany System-level ESD topics such as soft failure analysis and ESD current propagation modeling. Graduate Student Researcher Intel Corporation January 2014  –  June 2014  (6 months) Munich Area, Germany System-level ESD topics such as soft failure analysis and ESD current propagation modeling. Graduate Student Researcher Intel Corporation September 2012  –  April 2013  (8 months) Munich Area, Germany Focused research topics in electrostatic discharge. Graduate Student Researcher Intel Corporation September 2012  –  April 2013  (8 months) Munich Area, Germany Focused research topics in electrostatic discharge. Undergraduate Research Assistant Missouri S&T June 2010  –  December 2011  (1 year 7 months) Rolla, Missouri Designed a full featured 3 phase motor controller for use in an electric vehicle simulator. Undergraduate Research Assistant Missouri S&T June 2010  –  December 2011  (1 year 7 months) Rolla, Missouri Designed a full featured 3 phase motor controller for use in an electric vehicle simulator. Quality Control and Test Engineer Process Solutions June 2008  –  August 2008  (3 months) Arlington, Washington Performed quality control tests on manufactured industrial control panels and solutions. Quality Control and Test Engineer Process Solutions June 2008  –  August 2008  (3 months) Arlington, Washington Performed quality control tests on manufactured industrial control panels and solutions. Skills Electromagnetics Network Analyzer Pspice Spectrum Analyzer Matlab Simulations SPICE Simulink Oscilloscope Scripting Circuit Design Testing Agilent ADS PCB Design Skills  Electromagnetics Network Analyzer Pspice Spectrum Analyzer Matlab Simulations SPICE Simulink Oscilloscope Scripting Circuit Design Testing Agilent ADS PCB Design Electromagnetics Network Analyzer Pspice Spectrum Analyzer Matlab Simulations SPICE Simulink Oscilloscope Scripting Circuit Design Testing Agilent ADS PCB Design Electromagnetics Network Analyzer Pspice Spectrum Analyzer Matlab Simulations SPICE Simulink Oscilloscope Scripting Circuit Design Testing Agilent ADS PCB Design Education Missouri University of Science and Technology Doctor of Philosophy (PhD),  Electrical Engineering 2012  – 2016 Activities and Societies:  IEEE Student Branch Treasurer Missouri University of Science and Technology B.S,  Electrical Engineering 2007  – 2012 Activities and Societies:  IEEE Student Branch Treasurer Missouri University of Science and Technology B.S,  Computer Engineering 2007  – 2011 Activities and Societies:  IEEE Student Branch Treasurer Missouri University of Science and Technology Doctor of Philosophy (PhD),  Electrical Engineering 2012  – 2016 Activities and Societies:  IEEE Student Branch Treasurer Missouri University of Science and Technology Doctor of Philosophy (PhD),  Electrical Engineering 2012  – 2016 Activities and Societies:  IEEE Student Branch Treasurer Missouri University of Science and Technology Doctor of Philosophy (PhD),  Electrical Engineering 2012  – 2016 Activities and Societies:  IEEE Student Branch Treasurer Missouri University of Science and Technology B.S,  Electrical Engineering 2007  – 2012 Activities and Societies:  IEEE Student Branch Treasurer Missouri University of Science and Technology B.S,  Electrical Engineering 2007  – 2012 Activities and Societies:  IEEE Student Branch Treasurer Missouri University of Science and Technology B.S,  Electrical Engineering 2007  – 2012 Activities and Societies:  IEEE Student Branch Treasurer Missouri University of Science and Technology B.S,  Computer Engineering 2007  – 2011 Activities and Societies:  IEEE Student Branch Treasurer Missouri University of Science and Technology B.S,  Computer Engineering 2007  – 2011 Activities and Societies:  IEEE Student Branch Treasurer Missouri University of Science and Technology B.S,  Computer Engineering 2007  – 2011 Activities and Societies:  IEEE Student Branch Treasurer ", "Experience Technical Program Manager-NPI SK hynix memory solutions inc. July 2014  – Present (1 year 2 months) San Jose Managing cross functional teams to deliver embedded software for enterprise storage solutions. \nLeading organizational change management. \nInvolved in product planning and procuring product requirements. \nManage project priorities, schedule and dependencies. \nArchitect and design embedded software solutions for SSD controllers. Processor Power Firmware Architect Intel Corporation August 2009  –  June 2014  (4 years 11 months) Santa Clara Collaborate with all aspects of system design, from design and validation to product marketing and planning, to deliver exceptional energy efficiency for Intel’s Xeon products HPC processor firmware engineer Intel Corporation May 2007  –  July 2009  (2 years 3 months) Austin, Texas Area Led design of power algorithms for high performance computing processor product. Research Engineer Intel Corporation August 2005  –  July 2007  (2 years) Hillsboro Oregon Prototyped and developed aggressive algorithms to improve battery life in laptops by 25%. Integrated it into industry standard ACPI definitions. \nPatented concepts to improve user experience for laptops and tablets by providing instant wake from off state that became underlying technology for Rapid Start, a key feature in Ultra-books. Graduate Research Intern Intel Corporation June 2004  –  December 2004  (7 months) Hillsboro Oregon Designed software GPS module and tested and optimized code for performance. Graduate Teaching Assistant University of Texas at Arlington August 2003  –  May 2004  (10 months) Arlington Texas Technical Program Manager-NPI SK hynix memory solutions inc. July 2014  – Present (1 year 2 months) San Jose Managing cross functional teams to deliver embedded software for enterprise storage solutions. \nLeading organizational change management. \nInvolved in product planning and procuring product requirements. \nManage project priorities, schedule and dependencies. \nArchitect and design embedded software solutions for SSD controllers. Technical Program Manager-NPI SK hynix memory solutions inc. July 2014  – Present (1 year 2 months) San Jose Managing cross functional teams to deliver embedded software for enterprise storage solutions. \nLeading organizational change management. \nInvolved in product planning and procuring product requirements. \nManage project priorities, schedule and dependencies. \nArchitect and design embedded software solutions for SSD controllers. Processor Power Firmware Architect Intel Corporation August 2009  –  June 2014  (4 years 11 months) Santa Clara Collaborate with all aspects of system design, from design and validation to product marketing and planning, to deliver exceptional energy efficiency for Intel’s Xeon products Processor Power Firmware Architect Intel Corporation August 2009  –  June 2014  (4 years 11 months) Santa Clara Collaborate with all aspects of system design, from design and validation to product marketing and planning, to deliver exceptional energy efficiency for Intel’s Xeon products HPC processor firmware engineer Intel Corporation May 2007  –  July 2009  (2 years 3 months) Austin, Texas Area Led design of power algorithms for high performance computing processor product. HPC processor firmware engineer Intel Corporation May 2007  –  July 2009  (2 years 3 months) Austin, Texas Area Led design of power algorithms for high performance computing processor product. Research Engineer Intel Corporation August 2005  –  July 2007  (2 years) Hillsboro Oregon Prototyped and developed aggressive algorithms to improve battery life in laptops by 25%. Integrated it into industry standard ACPI definitions. \nPatented concepts to improve user experience for laptops and tablets by providing instant wake from off state that became underlying technology for Rapid Start, a key feature in Ultra-books. Research Engineer Intel Corporation August 2005  –  July 2007  (2 years) Hillsboro Oregon Prototyped and developed aggressive algorithms to improve battery life in laptops by 25%. Integrated it into industry standard ACPI definitions. \nPatented concepts to improve user experience for laptops and tablets by providing instant wake from off state that became underlying technology for Rapid Start, a key feature in Ultra-books. Graduate Research Intern Intel Corporation June 2004  –  December 2004  (7 months) Hillsboro Oregon Designed software GPS module and tested and optimized code for performance. Graduate Research Intern Intel Corporation June 2004  –  December 2004  (7 months) Hillsboro Oregon Designed software GPS module and tested and optimized code for performance. Graduate Teaching Assistant University of Texas at Arlington August 2003  –  May 2004  (10 months) Arlington Texas Graduate Teaching Assistant University of Texas at Arlington August 2003  –  May 2004  (10 months) Arlington Texas Languages Hindi Hindi Hindi Skills Product Planning Embedded Systems Agile Methodologies Lean Management Scalability System Architecture Processor Architecture Power Management C Post Silicon Debug Assembly Language Cross-functional Team... Skills  Product Planning Embedded Systems Agile Methodologies Lean Management Scalability System Architecture Processor Architecture Power Management C Post Silicon Debug Assembly Language Cross-functional Team... Product Planning Embedded Systems Agile Methodologies Lean Management Scalability System Architecture Processor Architecture Power Management C Post Silicon Debug Assembly Language Cross-functional Team... Product Planning Embedded Systems Agile Methodologies Lean Management Scalability System Architecture Processor Architecture Power Management C Post Silicon Debug Assembly Language Cross-functional Team... Education University of California, Berkeley, Haas School of Business Master of Business Administration (MBA) 2014  – 2017 The University of Texas at Arlington Master of Science (M.S.),  Electrical Engineering 2002  – 2005 National Public School Stanford University Strategic Decision Making Certification University of California, Berkeley, Haas School of Business Master of Business Administration (MBA) 2014  – 2017 University of California, Berkeley, Haas School of Business Master of Business Administration (MBA) 2014  – 2017 University of California, Berkeley, Haas School of Business Master of Business Administration (MBA) 2014  – 2017 The University of Texas at Arlington Master of Science (M.S.),  Electrical Engineering 2002  – 2005 The University of Texas at Arlington Master of Science (M.S.),  Electrical Engineering 2002  – 2005 The University of Texas at Arlington Master of Science (M.S.),  Electrical Engineering 2002  – 2005 National Public School National Public School National Public School Stanford University Strategic Decision Making Certification Stanford University Strategic Decision Making Certification Stanford University Strategic Decision Making Certification ", "Experience Software Engineer at Windows Phone Microsoft June 2012  – Present (3 years 3 months) Redmond, WA Working on Cortana (http://www.windowsphone.com/en-us/how-to/wp8/cortana/meet-cortana) Graduate Research Intern Intel Corporation February 2009  –  July 2009  (6 months) Hillsboro, OR Introduced a novel priority-aware architecture to address the problem of unpredictable performance in CMP platforms, due to contention for shared resources. The proposed architecture utilizes a PID control loop, which dynamically manages the occupancy of applications in the shared cache to achieve predictable performance. Graduate Research Intern Intel Corporation June 2008  –  August 2008  (3 months) Hillsboro, OR Proposed and explored various QoS-aware scheduling algorithms that reduce shared cache contention and evaluated their impact on future Intel products. Developed a multithreaded simulation infrastructure, CMPSched$im, which integrates a real Linux Scheduler into a CMP simulator. Cache Coherence Protocol Engineer Sonics Inc. June 2007  –  August 2007  (3 months) Mountain View, CA Worked on an inter-company project, collaborating with Toshiba and MIPS, to define the coherence extensions for Open Core Protocol (OCP), the universal on-chip core socket standard for diverse SoC architectures. Software Engineer at Windows Phone Microsoft June 2012  – Present (3 years 3 months) Redmond, WA Working on Cortana (http://www.windowsphone.com/en-us/how-to/wp8/cortana/meet-cortana) Software Engineer at Windows Phone Microsoft June 2012  – Present (3 years 3 months) Redmond, WA Working on Cortana (http://www.windowsphone.com/en-us/how-to/wp8/cortana/meet-cortana) Graduate Research Intern Intel Corporation February 2009  –  July 2009  (6 months) Hillsboro, OR Introduced a novel priority-aware architecture to address the problem of unpredictable performance in CMP platforms, due to contention for shared resources. The proposed architecture utilizes a PID control loop, which dynamically manages the occupancy of applications in the shared cache to achieve predictable performance. Graduate Research Intern Intel Corporation February 2009  –  July 2009  (6 months) Hillsboro, OR Introduced a novel priority-aware architecture to address the problem of unpredictable performance in CMP platforms, due to contention for shared resources. The proposed architecture utilizes a PID control loop, which dynamically manages the occupancy of applications in the shared cache to achieve predictable performance. Graduate Research Intern Intel Corporation June 2008  –  August 2008  (3 months) Hillsboro, OR Proposed and explored various QoS-aware scheduling algorithms that reduce shared cache contention and evaluated their impact on future Intel products. Developed a multithreaded simulation infrastructure, CMPSched$im, which integrates a real Linux Scheduler into a CMP simulator. Graduate Research Intern Intel Corporation June 2008  –  August 2008  (3 months) Hillsboro, OR Proposed and explored various QoS-aware scheduling algorithms that reduce shared cache contention and evaluated their impact on future Intel products. Developed a multithreaded simulation infrastructure, CMPSched$im, which integrates a real Linux Scheduler into a CMP simulator. Cache Coherence Protocol Engineer Sonics Inc. June 2007  –  August 2007  (3 months) Mountain View, CA Worked on an inter-company project, collaborating with Toshiba and MIPS, to define the coherence extensions for Open Core Protocol (OCP), the universal on-chip core socket standard for diverse SoC architectures. Cache Coherence Protocol Engineer Sonics Inc. June 2007  –  August 2007  (3 months) Mountain View, CA Worked on an inter-company project, collaborating with Toshiba and MIPS, to define the coherence extensions for Open Core Protocol (OCP), the universal on-chip core socket standard for diverse SoC architectures. Skills SoC C++ Multithreading Debugging Embedded Systems Simulations Signal Processing VLSI Computer Architecture Algorithms Machine Learning C Linux High Performance... Software Engineering Perl Parallel Computing Matlab FPGA Architecture Verilog Parallel Programming Distributed Systems LaTeX Computer Science Java Python See 12+     See less Skills  SoC C++ Multithreading Debugging Embedded Systems Simulations Signal Processing VLSI Computer Architecture Algorithms Machine Learning C Linux High Performance... Software Engineering Perl Parallel Computing Matlab FPGA Architecture Verilog Parallel Programming Distributed Systems LaTeX Computer Science Java Python See 12+     See less SoC C++ Multithreading Debugging Embedded Systems Simulations Signal Processing VLSI Computer Architecture Algorithms Machine Learning C Linux High Performance... Software Engineering Perl Parallel Computing Matlab FPGA Architecture Verilog Parallel Programming Distributed Systems LaTeX Computer Science Java Python See 12+     See less SoC C++ Multithreading Debugging Embedded Systems Simulations Signal Processing VLSI Computer Architecture Algorithms Machine Learning C Linux High Performance... Software Engineering Perl Parallel Computing Matlab FPGA Architecture Verilog Parallel Programming Distributed Systems LaTeX Computer Science Java Python See 12+     See less Education Massachusetts Institute of Technology Research Scholar,  Computer Science and Artificial Intelligence Lab 2009  – 2012 Princeton University Doctor of Philosophy (Ph.D.),  Computer Engineering 2006  – 2012 Princeton University Master's degree,  Electrical Engineering 2006  – 2008 Massachusetts Institute of Technology Research Scholar,  Computer Science and Artificial Intelligence Lab 2009  – 2012 Massachusetts Institute of Technology Research Scholar,  Computer Science and Artificial Intelligence Lab 2009  – 2012 Massachusetts Institute of Technology Research Scholar,  Computer Science and Artificial Intelligence Lab 2009  – 2012 Princeton University Doctor of Philosophy (Ph.D.),  Computer Engineering 2006  – 2012 Princeton University Doctor of Philosophy (Ph.D.),  Computer Engineering 2006  – 2012 Princeton University Doctor of Philosophy (Ph.D.),  Computer Engineering 2006  – 2012 Princeton University Master's degree,  Electrical Engineering 2006  – 2008 Princeton University Master's degree,  Electrical Engineering 2006  – 2008 Princeton University Master's degree,  Electrical Engineering 2006  – 2008 ", "Experience Mobile Malware and Privacy Researcher McAfee July 2014  – Present (1 year 2 months) Santa Clara, California Involved in the analysis of malware and privacy threats and exploits on the mobile platform. \nDynamic and Static Analysis using various tools. \nCreating and Improving the working processes and methodologies for detection and analysis. \nResearch and develop threat models for next generation mobile phones and landscape. Graduate Research Intern Intel Corporation June 2012  –  December 2012  (7 months) Hillsboro, Oregon Worked with the Software and Services Group, Business Client Security Team. \nMajor Responsibilities:  \nSoftware development on Secure Intel Architecture Technologies. \nProof of Concept research and development of architecture and supporting technologies. \nCreation of Enabling Guide to provide better understanding and showcase architectural agility for ISVs using Intel Secure Architecture. Graduate Research Intern Intel Corporation May 2011  –  December 2011  (8 months) Hudson, massachusetts Worked with the Intel Secure Algorithms Acceleration Group.  \nMajor Responsibilities: \nIncluded development, analysis of the performance of various security/cryptography algorithms for Intel Processors for Windows and Unix Platforms. Most of the development was done in C/C++ and ASM. Also implemented various proof of concept algorithms to set performance benchmark for different Intel Processors. Also, designed and implemented an application using PinTool which verified and optimized the 'save and restore' feature of registers of the Intel Processor Family, by instrumenting the functions of cryptography algorithms.  \nMinor Responsibilities: \nIncluded development of automation tools for testing and data collection of performance parameters. Development was in Perl. Teaching Assistant University at Buffalo September 2009  –  June 2011  (1 year 10 months) Duties include shared administrative responsibilities with faculty \ninstructor, fielding of all student inquiries, and grades Research Assistant University at Buffalo September 2007  –  August 2009  (2 years) University at Buffalo Designed and implemented a 17 node WSN composed of XSM in the University of Buffalo to monitor \nparking lots. \nDeveloped Automation for programming, testing and Data Collection. Senior Software Engineer Infosys 2004  –  2006  (2 years) Responsibilities included Requirement Analysis, Defect Planning, Testing and Software Development. Mobile Malware and Privacy Researcher McAfee July 2014  – Present (1 year 2 months) Santa Clara, California Involved in the analysis of malware and privacy threats and exploits on the mobile platform. \nDynamic and Static Analysis using various tools. \nCreating and Improving the working processes and methodologies for detection and analysis. \nResearch and develop threat models for next generation mobile phones and landscape. Mobile Malware and Privacy Researcher McAfee July 2014  – Present (1 year 2 months) Santa Clara, California Involved in the analysis of malware and privacy threats and exploits on the mobile platform. \nDynamic and Static Analysis using various tools. \nCreating and Improving the working processes and methodologies for detection and analysis. \nResearch and develop threat models for next generation mobile phones and landscape. Graduate Research Intern Intel Corporation June 2012  –  December 2012  (7 months) Hillsboro, Oregon Worked with the Software and Services Group, Business Client Security Team. \nMajor Responsibilities:  \nSoftware development on Secure Intel Architecture Technologies. \nProof of Concept research and development of architecture and supporting technologies. \nCreation of Enabling Guide to provide better understanding and showcase architectural agility for ISVs using Intel Secure Architecture. Graduate Research Intern Intel Corporation June 2012  –  December 2012  (7 months) Hillsboro, Oregon Worked with the Software and Services Group, Business Client Security Team. \nMajor Responsibilities:  \nSoftware development on Secure Intel Architecture Technologies. \nProof of Concept research and development of architecture and supporting technologies. \nCreation of Enabling Guide to provide better understanding and showcase architectural agility for ISVs using Intel Secure Architecture. Graduate Research Intern Intel Corporation May 2011  –  December 2011  (8 months) Hudson, massachusetts Worked with the Intel Secure Algorithms Acceleration Group.  \nMajor Responsibilities: \nIncluded development, analysis of the performance of various security/cryptography algorithms for Intel Processors for Windows and Unix Platforms. Most of the development was done in C/C++ and ASM. Also implemented various proof of concept algorithms to set performance benchmark for different Intel Processors. Also, designed and implemented an application using PinTool which verified and optimized the 'save and restore' feature of registers of the Intel Processor Family, by instrumenting the functions of cryptography algorithms.  \nMinor Responsibilities: \nIncluded development of automation tools for testing and data collection of performance parameters. Development was in Perl. Graduate Research Intern Intel Corporation May 2011  –  December 2011  (8 months) Hudson, massachusetts Worked with the Intel Secure Algorithms Acceleration Group.  \nMajor Responsibilities: \nIncluded development, analysis of the performance of various security/cryptography algorithms for Intel Processors for Windows and Unix Platforms. Most of the development was done in C/C++ and ASM. Also implemented various proof of concept algorithms to set performance benchmark for different Intel Processors. Also, designed and implemented an application using PinTool which verified and optimized the 'save and restore' feature of registers of the Intel Processor Family, by instrumenting the functions of cryptography algorithms.  \nMinor Responsibilities: \nIncluded development of automation tools for testing and data collection of performance parameters. Development was in Perl. Teaching Assistant University at Buffalo September 2009  –  June 2011  (1 year 10 months) Duties include shared administrative responsibilities with faculty \ninstructor, fielding of all student inquiries, and grades Teaching Assistant University at Buffalo September 2009  –  June 2011  (1 year 10 months) Duties include shared administrative responsibilities with faculty \ninstructor, fielding of all student inquiries, and grades Research Assistant University at Buffalo September 2007  –  August 2009  (2 years) University at Buffalo Designed and implemented a 17 node WSN composed of XSM in the University of Buffalo to monitor \nparking lots. \nDeveloped Automation for programming, testing and Data Collection. Research Assistant University at Buffalo September 2007  –  August 2009  (2 years) University at Buffalo Designed and implemented a 17 node WSN composed of XSM in the University of Buffalo to monitor \nparking lots. \nDeveloped Automation for programming, testing and Data Collection. Senior Software Engineer Infosys 2004  –  2006  (2 years) Responsibilities included Requirement Analysis, Defect Planning, Testing and Software Development. Senior Software Engineer Infosys 2004  –  2006  (2 years) Responsibilities included Requirement Analysis, Defect Planning, Testing and Software Development. Languages English English English Skills Algorithms C/C++ STL Perl Unix Computer Security Software Engineering Wireless Sensor Networks Matlab Distributed Systems Data Structures Network Security Simulations TCL LaTeX Computer Science Software Development Programming Security Python C C++ Linux Shell Scripting See 8+     See less Skills  Algorithms C/C++ STL Perl Unix Computer Security Software Engineering Wireless Sensor Networks Matlab Distributed Systems Data Structures Network Security Simulations TCL LaTeX Computer Science Software Development Programming Security Python C C++ Linux Shell Scripting See 8+     See less Algorithms C/C++ STL Perl Unix Computer Security Software Engineering Wireless Sensor Networks Matlab Distributed Systems Data Structures Network Security Simulations TCL LaTeX Computer Science Software Development Programming Security Python C C++ Linux Shell Scripting See 8+     See less Algorithms C/C++ STL Perl Unix Computer Security Software Engineering Wireless Sensor Networks Matlab Distributed Systems Data Structures Network Security Simulations TCL LaTeX Computer Science Software Development Programming Security Python C C++ Linux Shell Scripting See 8+     See less Education State University of New York at Buffalo PhD,  Wireless and Network Security 2008  – 2013 My Dissertation Topic is “A Threat Assessment Framework for Securing Emerging Networks and Applications against Smart Attacks”. In this work, I investigate various techniques of analyzing threats that could affect emerging networks and discusses some techniques of reducing or mitigating the threats. University at Buffalo Masters,  Electrical and Electroncics 2007  – 2008 Visvesvaraya Technological University Bachelor of Science,  Electrical and Electronics 2000  – 2004 State University of New York at Buffalo PhD,  Wireless and Network Security 2008  – 2013 My Dissertation Topic is “A Threat Assessment Framework for Securing Emerging Networks and Applications against Smart Attacks”. In this work, I investigate various techniques of analyzing threats that could affect emerging networks and discusses some techniques of reducing or mitigating the threats. State University of New York at Buffalo PhD,  Wireless and Network Security 2008  – 2013 My Dissertation Topic is “A Threat Assessment Framework for Securing Emerging Networks and Applications against Smart Attacks”. In this work, I investigate various techniques of analyzing threats that could affect emerging networks and discusses some techniques of reducing or mitigating the threats. State University of New York at Buffalo PhD,  Wireless and Network Security 2008  – 2013 My Dissertation Topic is “A Threat Assessment Framework for Securing Emerging Networks and Applications against Smart Attacks”. In this work, I investigate various techniques of analyzing threats that could affect emerging networks and discusses some techniques of reducing or mitigating the threats. University at Buffalo Masters,  Electrical and Electroncics 2007  – 2008 University at Buffalo Masters,  Electrical and Electroncics 2007  – 2008 University at Buffalo Masters,  Electrical and Electroncics 2007  – 2008 Visvesvaraya Technological University Bachelor of Science,  Electrical and Electronics 2000  – 2004 Visvesvaraya Technological University Bachelor of Science,  Electrical and Electronics 2000  – 2004 Visvesvaraya Technological University Bachelor of Science,  Electrical and Electronics 2000  – 2004 ", "Summary Over 6 years of experience in Software Development \nSpecialties: Software Engineering, Algorithms \nSkills: Java, SQL  Summary Over 6 years of experience in Software Development \nSpecialties: Software Engineering, Algorithms \nSkills: Java, SQL  Over 6 years of experience in Software Development \nSpecialties: Software Engineering, Algorithms \nSkills: Java, SQL  Over 6 years of experience in Software Development \nSpecialties: Software Engineering, Algorithms \nSkills: Java, SQL  Experience Principal Applications Engineer Oracle November 2014  – Present (10 months) New Feature Development in Customer Data Hub and Data Quality Areas of Fusion Enterprise Applications. Project Lead Oracle November 2011  –  October 2014  (3 years) San Francisco Bay Area New Feature Development in Customer Data Hub and Data Quality Areas of Fusion Enterprise Applications. Senior Applications Engineer Oracle Corporation August 2008  –  November 2011  (3 years 4 months) New Feature Development in Partner Relationship Management module in Fusion Applications. Graduate Research Intern Intel Corporation June 2006  –  August 2006  (3 months) Designed and developed an activity and excitement-level monitoring system for post-operative care patients and pregnant women. Implemented device drivers to interface accelerometer and skin conductivity sensors with the Intel Sensor Mote 2. Developed a user interface module that communicates via radio with the monitoring system attached to the patient. \n \nSuggested use-case scenarios for wireless sensor network applications in the health care industry Graduate Research Intern Intel Corporation June 2004  –  August 2004  (3 months) Worked on RFID tag data formatting standards. Studied and Analyzed RFID applications for logistics. Worked on the 1st generation of Intel Sensor motes for an optical transceiver unit. Principal Applications Engineer Oracle November 2014  – Present (10 months) New Feature Development in Customer Data Hub and Data Quality Areas of Fusion Enterprise Applications. Principal Applications Engineer Oracle November 2014  – Present (10 months) New Feature Development in Customer Data Hub and Data Quality Areas of Fusion Enterprise Applications. Project Lead Oracle November 2011  –  October 2014  (3 years) San Francisco Bay Area New Feature Development in Customer Data Hub and Data Quality Areas of Fusion Enterprise Applications. Project Lead Oracle November 2011  –  October 2014  (3 years) San Francisco Bay Area New Feature Development in Customer Data Hub and Data Quality Areas of Fusion Enterprise Applications. Senior Applications Engineer Oracle Corporation August 2008  –  November 2011  (3 years 4 months) New Feature Development in Partner Relationship Management module in Fusion Applications. Senior Applications Engineer Oracle Corporation August 2008  –  November 2011  (3 years 4 months) New Feature Development in Partner Relationship Management module in Fusion Applications. Graduate Research Intern Intel Corporation June 2006  –  August 2006  (3 months) Designed and developed an activity and excitement-level monitoring system for post-operative care patients and pregnant women. Implemented device drivers to interface accelerometer and skin conductivity sensors with the Intel Sensor Mote 2. Developed a user interface module that communicates via radio with the monitoring system attached to the patient. \n \nSuggested use-case scenarios for wireless sensor network applications in the health care industry Graduate Research Intern Intel Corporation June 2006  –  August 2006  (3 months) Designed and developed an activity and excitement-level monitoring system for post-operative care patients and pregnant women. Implemented device drivers to interface accelerometer and skin conductivity sensors with the Intel Sensor Mote 2. Developed a user interface module that communicates via radio with the monitoring system attached to the patient. \n \nSuggested use-case scenarios for wireless sensor network applications in the health care industry Graduate Research Intern Intel Corporation June 2004  –  August 2004  (3 months) Worked on RFID tag data formatting standards. Studied and Analyzed RFID applications for logistics. Worked on the 1st generation of Intel Sensor motes for an optical transceiver unit. Graduate Research Intern Intel Corporation June 2004  –  August 2004  (3 months) Worked on RFID tag data formatting standards. Studied and Analyzed RFID applications for logistics. Worked on the 1st generation of Intel Sensor motes for an optical transceiver unit. Skills Wireless Algorithms Leadership Device Drivers Sensors SOA Software Project... Agile Methodologies Solution Architecture Java Enterprise Edition Enterprise Software Oracle Software Development Enterprise Architecture Cloud Computing Java PL/SQL Web Services Requirements Analysis SDLC ESS Linux XML C Business Intelligence SaaS Unix Distributed Systems SQL CRM See 15+     See less Skills  Wireless Algorithms Leadership Device Drivers Sensors SOA Software Project... Agile Methodologies Solution Architecture Java Enterprise Edition Enterprise Software Oracle Software Development Enterprise Architecture Cloud Computing Java PL/SQL Web Services Requirements Analysis SDLC ESS Linux XML C Business Intelligence SaaS Unix Distributed Systems SQL CRM See 15+     See less Wireless Algorithms Leadership Device Drivers Sensors SOA Software Project... Agile Methodologies Solution Architecture Java Enterprise Edition Enterprise Software Oracle Software Development Enterprise Architecture Cloud Computing Java PL/SQL Web Services Requirements Analysis SDLC ESS Linux XML C Business Intelligence SaaS Unix Distributed Systems SQL CRM See 15+     See less Wireless Algorithms Leadership Device Drivers Sensors SOA Software Project... Agile Methodologies Solution Architecture Java Enterprise Edition Enterprise Software Oracle Software Development Enterprise Architecture Cloud Computing Java PL/SQL Web Services Requirements Analysis SDLC ESS Linux XML C Business Intelligence SaaS Unix Distributed Systems SQL CRM See 15+     See less Education Massachusetts Institute of Technology PhD,  Information Technology 2004  – 2008 Investigated the performance of existing routing metrics for directional antenna-based heterogeneous wireless ad hoc and sensor networks. Developed novel routing metrics and cross-layer (MAC and routing layers) solutions to improve the overall network performance.  \n \nTaught, graded, and designed homework questions for graduate courses in algorithms and basics of information technology. Activities and Societies:  IEEE ,  MIT Badminton Club Massachusetts Institute of Technology MS,  Civil Engineering 2001  – 2004 Designed and fabricated a custom wireless sensor unit for a tunnel monitoring application. Built and tested the circuit, programmed the microcontroller to interface with sensor module and communication module. Unit was successfully installed and tested in the London Underground tunnel system for real- time monitoring of displacements caused by adjacent construction activity. Indian Institute of Technology, Bombay B.Tech,  Civil Engineering 1997  – 2001 Massachusetts Institute of Technology PhD,  Information Technology 2004  – 2008 Investigated the performance of existing routing metrics for directional antenna-based heterogeneous wireless ad hoc and sensor networks. Developed novel routing metrics and cross-layer (MAC and routing layers) solutions to improve the overall network performance.  \n \nTaught, graded, and designed homework questions for graduate courses in algorithms and basics of information technology. Activities and Societies:  IEEE ,  MIT Badminton Club Massachusetts Institute of Technology PhD,  Information Technology 2004  – 2008 Investigated the performance of existing routing metrics for directional antenna-based heterogeneous wireless ad hoc and sensor networks. Developed novel routing metrics and cross-layer (MAC and routing layers) solutions to improve the overall network performance.  \n \nTaught, graded, and designed homework questions for graduate courses in algorithms and basics of information technology. Activities and Societies:  IEEE ,  MIT Badminton Club Massachusetts Institute of Technology PhD,  Information Technology 2004  – 2008 Investigated the performance of existing routing metrics for directional antenna-based heterogeneous wireless ad hoc and sensor networks. Developed novel routing metrics and cross-layer (MAC and routing layers) solutions to improve the overall network performance.  \n \nTaught, graded, and designed homework questions for graduate courses in algorithms and basics of information technology. Activities and Societies:  IEEE ,  MIT Badminton Club Massachusetts Institute of Technology MS,  Civil Engineering 2001  – 2004 Designed and fabricated a custom wireless sensor unit for a tunnel monitoring application. Built and tested the circuit, programmed the microcontroller to interface with sensor module and communication module. Unit was successfully installed and tested in the London Underground tunnel system for real- time monitoring of displacements caused by adjacent construction activity. Massachusetts Institute of Technology MS,  Civil Engineering 2001  – 2004 Designed and fabricated a custom wireless sensor unit for a tunnel monitoring application. Built and tested the circuit, programmed the microcontroller to interface with sensor module and communication module. Unit was successfully installed and tested in the London Underground tunnel system for real- time monitoring of displacements caused by adjacent construction activity. Massachusetts Institute of Technology MS,  Civil Engineering 2001  – 2004 Designed and fabricated a custom wireless sensor unit for a tunnel monitoring application. Built and tested the circuit, programmed the microcontroller to interface with sensor module and communication module. Unit was successfully installed and tested in the London Underground tunnel system for real- time monitoring of displacements caused by adjacent construction activity. Indian Institute of Technology, Bombay B.Tech,  Civil Engineering 1997  – 2001 Indian Institute of Technology, Bombay B.Tech,  Civil Engineering 1997  – 2001 Indian Institute of Technology, Bombay B.Tech,  Civil Engineering 1997  – 2001 Honors & Awards Additional Honors & Awards Robert Thurber Fellowship (2004-2005) at MIT Additional Honors & Awards Robert Thurber Fellowship (2004-2005) at MIT Additional Honors & Awards Robert Thurber Fellowship (2004-2005) at MIT Additional Honors & Awards Robert Thurber Fellowship (2004-2005) at MIT ", "Summary My passion is optimizing marketplaces for business success with data science through: \n \n• Driving business innovation across multiple market/product stages to balance supply and demand with different algorithms and approaches \n \n• Accelerating sales, marketing, and business operations with tools for lead generation, establishments of thought leadership, and deal size estimation \n \n• Delivering data-driven products using the simplest approach first, then iterate where necessary \n \n• Instilling rigor and efficiency in experimentation by creating state-of-art (multi-layered) A/B test infrastructure with statistical confidence metrics \n \n \nHired and managed 20+ PT/FT employees, contractors and interns over three years while leading a core team of four data scientists at a job search engine with 34M monthly unique visitors, serving over 200,000 employers in 24 countries.  \n \nEstablished thought leadership identities for organizations by speaking at industry and data science events on accomplishments in machine learning techniques, natural language processing, information extraction, information retrieval, personalization, statistical modeling, and predictive modeling Summary My passion is optimizing marketplaces for business success with data science through: \n \n• Driving business innovation across multiple market/product stages to balance supply and demand with different algorithms and approaches \n \n• Accelerating sales, marketing, and business operations with tools for lead generation, establishments of thought leadership, and deal size estimation \n \n• Delivering data-driven products using the simplest approach first, then iterate where necessary \n \n• Instilling rigor and efficiency in experimentation by creating state-of-art (multi-layered) A/B test infrastructure with statistical confidence metrics \n \n \nHired and managed 20+ PT/FT employees, contractors and interns over three years while leading a core team of four data scientists at a job search engine with 34M monthly unique visitors, serving over 200,000 employers in 24 countries.  \n \nEstablished thought leadership identities for organizations by speaking at industry and data science events on accomplishments in machine learning techniques, natural language processing, information extraction, information retrieval, personalization, statistical modeling, and predictive modeling My passion is optimizing marketplaces for business success with data science through: \n \n• Driving business innovation across multiple market/product stages to balance supply and demand with different algorithms and approaches \n \n• Accelerating sales, marketing, and business operations with tools for lead generation, establishments of thought leadership, and deal size estimation \n \n• Delivering data-driven products using the simplest approach first, then iterate where necessary \n \n• Instilling rigor and efficiency in experimentation by creating state-of-art (multi-layered) A/B test infrastructure with statistical confidence metrics \n \n \nHired and managed 20+ PT/FT employees, contractors and interns over three years while leading a core team of four data scientists at a job search engine with 34M monthly unique visitors, serving over 200,000 employers in 24 countries.  \n \nEstablished thought leadership identities for organizations by speaking at industry and data science events on accomplishments in machine learning techniques, natural language processing, information extraction, information retrieval, personalization, statistical modeling, and predictive modeling My passion is optimizing marketplaces for business success with data science through: \n \n• Driving business innovation across multiple market/product stages to balance supply and demand with different algorithms and approaches \n \n• Accelerating sales, marketing, and business operations with tools for lead generation, establishments of thought leadership, and deal size estimation \n \n• Delivering data-driven products using the simplest approach first, then iterate where necessary \n \n• Instilling rigor and efficiency in experimentation by creating state-of-art (multi-layered) A/B test infrastructure with statistical confidence metrics \n \n \nHired and managed 20+ PT/FT employees, contractors and interns over three years while leading a core team of four data scientists at a job search engine with 34M monthly unique visitors, serving over 200,000 employers in 24 countries.  \n \nEstablished thought leadership identities for organizations by speaking at industry and data science events on accomplishments in machine learning techniques, natural language processing, information extraction, information retrieval, personalization, statistical modeling, and predictive modeling Experience Chief Data Scientist Yirendai May 2015  – Present (4 months) Yirendai, a CreditEase company, is the largest online P2P marketplace in China focusing on consumer finance needs. Adjunct Professor Carnegie Mellon University 2010  – Present (5 years) Silicon Valley Contributing to building the #1 computer science graduate program (as ranked by US News) by proposing, designing, coordinating and executing on a vision of establishing a Center of Excellence for parallel computing \n \nEstablished and co-directs 1) the CUDA Research Center for applying parallel computing technologies to a variety of life-changing application areas using machine learning; 2) the CUDA Teaching Center, designed, developed, and taught one of the most popular graduate-level courses in the ECE Department \n \nEstablished and organized a monthly meetup on HPC and GPU Supercomputing in Silicon Valley for 42 month with more than 900 members, many of whom are pioneering parallel computing practitioners in Silicon Valley Chief Data Scientist Yirendai May 2015  – Present (4 months) Yirendai, a CreditEase company, is the largest online P2P marketplace in China focusing on consumer finance needs. Chief Data Scientist Yirendai May 2015  – Present (4 months) Yirendai, a CreditEase company, is the largest online P2P marketplace in China focusing on consumer finance needs. Adjunct Professor Carnegie Mellon University 2010  – Present (5 years) Silicon Valley Contributing to building the #1 computer science graduate program (as ranked by US News) by proposing, designing, coordinating and executing on a vision of establishing a Center of Excellence for parallel computing \n \nEstablished and co-directs 1) the CUDA Research Center for applying parallel computing technologies to a variety of life-changing application areas using machine learning; 2) the CUDA Teaching Center, designed, developed, and taught one of the most popular graduate-level courses in the ECE Department \n \nEstablished and organized a monthly meetup on HPC and GPU Supercomputing in Silicon Valley for 42 month with more than 900 members, many of whom are pioneering parallel computing practitioners in Silicon Valley Adjunct Professor Carnegie Mellon University 2010  – Present (5 years) Silicon Valley Contributing to building the #1 computer science graduate program (as ranked by US News) by proposing, designing, coordinating and executing on a vision of establishing a Center of Excellence for parallel computing \n \nEstablished and co-directs 1) the CUDA Research Center for applying parallel computing technologies to a variety of life-changing application areas using machine learning; 2) the CUDA Teaching Center, designed, developed, and taught one of the most popular graduate-level courses in the ECE Department \n \nEstablished and organized a monthly meetup on HPC and GPU Supercomputing in Silicon Valley for 42 month with more than 900 members, many of whom are pioneering parallel computing practitioners in Silicon Valley Skills Algorithms Machine Learning High Performance... Parallel Computing CUDA Hadoop Optimization Python Distributed Systems Entrepreneurship Business Insights GPU Analytics Big Data New Venture Development Key Performance... Statistical Modeling R&D Planning R&D Operations Natural Language... Building Data Science... SQL See 7+     See less Skills  Algorithms Machine Learning High Performance... Parallel Computing CUDA Hadoop Optimization Python Distributed Systems Entrepreneurship Business Insights GPU Analytics Big Data New Venture Development Key Performance... Statistical Modeling R&D Planning R&D Operations Natural Language... Building Data Science... SQL See 7+     See less Algorithms Machine Learning High Performance... Parallel Computing CUDA Hadoop Optimization Python Distributed Systems Entrepreneurship Business Insights GPU Analytics Big Data New Venture Development Key Performance... Statistical Modeling R&D Planning R&D Operations Natural Language... Building Data Science... SQL See 7+     See less Algorithms Machine Learning High Performance... Parallel Computing CUDA Hadoop Optimization Python Distributed Systems Entrepreneurship Business Insights GPU Analytics Big Data New Venture Development Key Performance... Statistical Modeling R&D Planning R&D Operations Natural Language... Building Data Science... SQL See 7+     See less Education University of California, Berkeley Ph.D. 2004  – 2010 Stanford University NDO 2002  – 2002 Carnegie Mellon University M.S. and B.S. 1997  – 2001 University of California, Berkeley Ph.D. 2004  – 2010 University of California, Berkeley Ph.D. 2004  – 2010 University of California, Berkeley Ph.D. 2004  – 2010 Stanford University NDO 2002  – 2002 Stanford University NDO 2002  – 2002 Stanford University NDO 2002  – 2002 Carnegie Mellon University M.S. and B.S. 1997  – 2001 Carnegie Mellon University M.S. and B.S. 1997  – 2001 Carnegie Mellon University M.S. and B.S. 1997  – 2001 Honors & Awards ", "Experience Platform Performance Architect Intel Corporation February 2015  – Present (7 months) Portland, Oregon Area Graduate Research Assistant Duke University September 2010  –  December 2014  (4 years 4 months) Graduate Technical Intern Intel Corporation June 2014  –  November 2014  (6 months) Portland, Oregon Area Graduate Research Intern Intel Corporation June 2013  –  December 2013  (7 months) Bengaluru Area, India Graduate Technical Intern Intel Corporation June 2012  –  August 2012  (3 months) Santa Clara, California Graduate Technical Intern Intel Corporation June 2011  –  November 2011  (6 months) Santa Clara, California I was responsible for fault coverage analysis on a number of circuit blocks, identifying and root-causing coverage holes, implementing DFT changes and measuring and reporting coverage improvement and documenting the changes for design implementation. Software Design Engineer Microsoft June 2008  –  July 2010  (2 years 2 months) I was a part of team in Microsoft India Development Center responsible for end to end design and development of enterprise solution product Microsoft Biztalk Server. BizTalk Server enables developers in creating solutions for integrating heterogeneous systems across and inside organizations. With a nice UI experience developers can write business logic graphically without having to bother himself about what is happening in the background. I own design and implementation of BizTalk setup which includes installing and some intial configuration steps. I was also responsible for ensuring a hassle free upgrade of BizTalk across its multiple releases. I was involved in shipping Microsoft BizTalk Adapter Pack v2.0 and Microsoft BizTalk Server 2006 R2 SP1 and worked towards a release of Microsoft BizTalk Server 2010. Software Engineer (Intern) Ittiam Systems May 2006  –  June 2006  (2 months) Platform Performance Architect Intel Corporation February 2015  – Present (7 months) Portland, Oregon Area Platform Performance Architect Intel Corporation February 2015  – Present (7 months) Portland, Oregon Area Graduate Research Assistant Duke University September 2010  –  December 2014  (4 years 4 months) Graduate Research Assistant Duke University September 2010  –  December 2014  (4 years 4 months) Graduate Technical Intern Intel Corporation June 2014  –  November 2014  (6 months) Portland, Oregon Area Graduate Technical Intern Intel Corporation June 2014  –  November 2014  (6 months) Portland, Oregon Area Graduate Research Intern Intel Corporation June 2013  –  December 2013  (7 months) Bengaluru Area, India Graduate Research Intern Intel Corporation June 2013  –  December 2013  (7 months) Bengaluru Area, India Graduate Technical Intern Intel Corporation June 2012  –  August 2012  (3 months) Santa Clara, California Graduate Technical Intern Intel Corporation June 2012  –  August 2012  (3 months) Santa Clara, California Graduate Technical Intern Intel Corporation June 2011  –  November 2011  (6 months) Santa Clara, California I was responsible for fault coverage analysis on a number of circuit blocks, identifying and root-causing coverage holes, implementing DFT changes and measuring and reporting coverage improvement and documenting the changes for design implementation. Graduate Technical Intern Intel Corporation June 2011  –  November 2011  (6 months) Santa Clara, California I was responsible for fault coverage analysis on a number of circuit blocks, identifying and root-causing coverage holes, implementing DFT changes and measuring and reporting coverage improvement and documenting the changes for design implementation. Software Design Engineer Microsoft June 2008  –  July 2010  (2 years 2 months) I was a part of team in Microsoft India Development Center responsible for end to end design and development of enterprise solution product Microsoft Biztalk Server. BizTalk Server enables developers in creating solutions for integrating heterogeneous systems across and inside organizations. With a nice UI experience developers can write business logic graphically without having to bother himself about what is happening in the background. I own design and implementation of BizTalk setup which includes installing and some intial configuration steps. I was also responsible for ensuring a hassle free upgrade of BizTalk across its multiple releases. I was involved in shipping Microsoft BizTalk Adapter Pack v2.0 and Microsoft BizTalk Server 2006 R2 SP1 and worked towards a release of Microsoft BizTalk Server 2010. Software Design Engineer Microsoft June 2008  –  July 2010  (2 years 2 months) I was a part of team in Microsoft India Development Center responsible for end to end design and development of enterprise solution product Microsoft Biztalk Server. BizTalk Server enables developers in creating solutions for integrating heterogeneous systems across and inside organizations. With a nice UI experience developers can write business logic graphically without having to bother himself about what is happening in the background. I own design and implementation of BizTalk setup which includes installing and some intial configuration steps. I was also responsible for ensuring a hassle free upgrade of BizTalk across its multiple releases. I was involved in shipping Microsoft BizTalk Adapter Pack v2.0 and Microsoft BizTalk Server 2006 R2 SP1 and worked towards a release of Microsoft BizTalk Server 2010. Software Engineer (Intern) Ittiam Systems May 2006  –  June 2006  (2 months) Software Engineer (Intern) Ittiam Systems May 2006  –  June 2006  (2 months) Skills Programming Problem Solving Critical Thinking Skills  Programming Problem Solving Critical Thinking Programming Problem Solving Critical Thinking Programming Problem Solving Critical Thinking Education Duke University PhD,  Electrical and Computer Engineering 2010  – 2014 Indian Institute of Technology, Kharagpur B.Tech & M.Tech,  Computer Science ,  Computer Engineering 2003  – 2008 Activities and Societies:  Hindi Technology Dramatics Society (HTDS)\nDramatics Team ,  Choreography Team Duke University PhD,  Electrical and Computer Engineering 2010  – 2014 Duke University PhD,  Electrical and Computer Engineering 2010  – 2014 Duke University PhD,  Electrical and Computer Engineering 2010  – 2014 Indian Institute of Technology, Kharagpur B.Tech & M.Tech,  Computer Science ,  Computer Engineering 2003  – 2008 Activities and Societies:  Hindi Technology Dramatics Society (HTDS)\nDramatics Team ,  Choreography Team Indian Institute of Technology, Kharagpur B.Tech & M.Tech,  Computer Science ,  Computer Engineering 2003  – 2008 Activities and Societies:  Hindi Technology Dramatics Society (HTDS)\nDramatics Team ,  Choreography Team Indian Institute of Technology, Kharagpur B.Tech & M.Tech,  Computer Science ,  Computer Engineering 2003  – 2008 Activities and Societies:  Hindi Technology Dramatics Society (HTDS)\nDramatics Team ,  Choreography Team ", "Summary I am passionate about all aspects of information security, but have a particular interest in large-scale and distributed systems. My interests include secure and fault-tolerant protocols,  \noverlay networks, peer-to-peer systems, adaptive systems, mesh networks, virtual coordinate systems, graph-based analytics, and large-scale data analysis. I am currently with Intel, looking to bring innovative solutions to the Internet of Things domain. Summary I am passionate about all aspects of information security, but have a particular interest in large-scale and distributed systems. My interests include secure and fault-tolerant protocols,  \noverlay networks, peer-to-peer systems, adaptive systems, mesh networks, virtual coordinate systems, graph-based analytics, and large-scale data analysis. I am currently with Intel, looking to bring innovative solutions to the Internet of Things domain. I am passionate about all aspects of information security, but have a particular interest in large-scale and distributed systems. My interests include secure and fault-tolerant protocols,  \noverlay networks, peer-to-peer systems, adaptive systems, mesh networks, virtual coordinate systems, graph-based analytics, and large-scale data analysis. I am currently with Intel, looking to bring innovative solutions to the Internet of Things domain. I am passionate about all aspects of information security, but have a particular interest in large-scale and distributed systems. My interests include secure and fault-tolerant protocols,  \noverlay networks, peer-to-peer systems, adaptive systems, mesh networks, virtual coordinate systems, graph-based analytics, and large-scale data analysis. I am currently with Intel, looking to bring innovative solutions to the Internet of Things domain. Experience Senior Researcher And Architect Intel Corporation August 2015  – Present (1 month) Santa Clara, California System and security research driving innovative Internet of Things (IoT) solutions Principal Member of Technical Staff Sandia National Laboratories January 2012  –  August 2015  (3 years 8 months) Albuquerque, New Mexico Area I am a member of the Cyber Security R&D group. My research interests include cloud computing, fault-tolerant protocols, insider-resilient overlay networks, peer-to-peer systems, adaptive systems, machine learning, and adversarial games with an overarching goal of creating practical solutions for today's information security needs. Senior Member of Technical Staff Sandia National Laboratories August 2010  –  January 2012  (1 year 6 months) Albuquerque, New Mexico Area Cyber Security R&D Graduate Research Assistant Purdue University August 2004  –  July 2010  (6 years) Lafayette, Indiana Area Thesis title: A Platform for Creating Efficient, Robust, and Resilient Peer-to-Peer Systems\" Graduate Research Intern Intel Corporation June 2008  –  September 2009  (1 year 4 months) San Francisco Bay Area Research Intern on the Distributed Detection and Inference (DDI) Project. DDI is a collaborative worm detection system involving local and global detectors on end-hosts. Local detectors issue and disseminate local infection reports indicating whether the end-host is infected. Global detectors collect local infection reports and issue system-wide alarms when the infection evidence has sufficiently been corroborated. Tool Developer Baker Hill Corporation May 2004  –  August 2004  (4 months) Indianapolis, Indiana Area Research and development of next generation banking data conversion tool using the Visual Studio .Net that is currently used by all support staff and customers needing data migration from old databases to SQL2000. Developer Motorola May 2003  –  August 2003  (4 months) Greater Chicago Area Research and development of end-user applications to seamlessly fuse data from multiple security sensors (video, motion, vibration) into three applications: an easy to use standalone application, a web interface, and a mobile interface to be used by security personnel to monitor remote radio towers. Remote data transfer and sensor manipulation tools were implemented to support the end-user application. Software Development Engineer in Test Microsoft May 2002  –  August 2002  (4 months) Greater Seattle Area Development of a testing framework and automated tests for a new Visual Studio .Net add-in designed to allow the use of .Net code logic behind office documents. Research and creation of initial test plan and test case outlines used by the development group. Software Development Engineer in Test Microsoft May 2001  –  August 2001  (4 months) Greater Seattle Area Development of regression tests for Office Developer, development of test cases and automated tests for Visual Studio .Net, and product research into possible desired extensions facilitating ease of use in Visual Studio .Net. Senior Researcher And Architect Intel Corporation August 2015  – Present (1 month) Santa Clara, California System and security research driving innovative Internet of Things (IoT) solutions Senior Researcher And Architect Intel Corporation August 2015  – Present (1 month) Santa Clara, California System and security research driving innovative Internet of Things (IoT) solutions Principal Member of Technical Staff Sandia National Laboratories January 2012  –  August 2015  (3 years 8 months) Albuquerque, New Mexico Area I am a member of the Cyber Security R&D group. My research interests include cloud computing, fault-tolerant protocols, insider-resilient overlay networks, peer-to-peer systems, adaptive systems, machine learning, and adversarial games with an overarching goal of creating practical solutions for today's information security needs. Principal Member of Technical Staff Sandia National Laboratories January 2012  –  August 2015  (3 years 8 months) Albuquerque, New Mexico Area I am a member of the Cyber Security R&D group. My research interests include cloud computing, fault-tolerant protocols, insider-resilient overlay networks, peer-to-peer systems, adaptive systems, machine learning, and adversarial games with an overarching goal of creating practical solutions for today's information security needs. Senior Member of Technical Staff Sandia National Laboratories August 2010  –  January 2012  (1 year 6 months) Albuquerque, New Mexico Area Cyber Security R&D Senior Member of Technical Staff Sandia National Laboratories August 2010  –  January 2012  (1 year 6 months) Albuquerque, New Mexico Area Cyber Security R&D Graduate Research Assistant Purdue University August 2004  –  July 2010  (6 years) Lafayette, Indiana Area Thesis title: A Platform for Creating Efficient, Robust, and Resilient Peer-to-Peer Systems\" Graduate Research Assistant Purdue University August 2004  –  July 2010  (6 years) Lafayette, Indiana Area Thesis title: A Platform for Creating Efficient, Robust, and Resilient Peer-to-Peer Systems\" Graduate Research Intern Intel Corporation June 2008  –  September 2009  (1 year 4 months) San Francisco Bay Area Research Intern on the Distributed Detection and Inference (DDI) Project. DDI is a collaborative worm detection system involving local and global detectors on end-hosts. Local detectors issue and disseminate local infection reports indicating whether the end-host is infected. Global detectors collect local infection reports and issue system-wide alarms when the infection evidence has sufficiently been corroborated. Graduate Research Intern Intel Corporation June 2008  –  September 2009  (1 year 4 months) San Francisco Bay Area Research Intern on the Distributed Detection and Inference (DDI) Project. DDI is a collaborative worm detection system involving local and global detectors on end-hosts. Local detectors issue and disseminate local infection reports indicating whether the end-host is infected. Global detectors collect local infection reports and issue system-wide alarms when the infection evidence has sufficiently been corroborated. Tool Developer Baker Hill Corporation May 2004  –  August 2004  (4 months) Indianapolis, Indiana Area Research and development of next generation banking data conversion tool using the Visual Studio .Net that is currently used by all support staff and customers needing data migration from old databases to SQL2000. Tool Developer Baker Hill Corporation May 2004  –  August 2004  (4 months) Indianapolis, Indiana Area Research and development of next generation banking data conversion tool using the Visual Studio .Net that is currently used by all support staff and customers needing data migration from old databases to SQL2000. Developer Motorola May 2003  –  August 2003  (4 months) Greater Chicago Area Research and development of end-user applications to seamlessly fuse data from multiple security sensors (video, motion, vibration) into three applications: an easy to use standalone application, a web interface, and a mobile interface to be used by security personnel to monitor remote radio towers. Remote data transfer and sensor manipulation tools were implemented to support the end-user application. Developer Motorola May 2003  –  August 2003  (4 months) Greater Chicago Area Research and development of end-user applications to seamlessly fuse data from multiple security sensors (video, motion, vibration) into three applications: an easy to use standalone application, a web interface, and a mobile interface to be used by security personnel to monitor remote radio towers. Remote data transfer and sensor manipulation tools were implemented to support the end-user application. Software Development Engineer in Test Microsoft May 2002  –  August 2002  (4 months) Greater Seattle Area Development of a testing framework and automated tests for a new Visual Studio .Net add-in designed to allow the use of .Net code logic behind office documents. Research and creation of initial test plan and test case outlines used by the development group. Software Development Engineer in Test Microsoft May 2002  –  August 2002  (4 months) Greater Seattle Area Development of a testing framework and automated tests for a new Visual Studio .Net add-in designed to allow the use of .Net code logic behind office documents. Research and creation of initial test plan and test case outlines used by the development group. Software Development Engineer in Test Microsoft May 2001  –  August 2001  (4 months) Greater Seattle Area Development of regression tests for Office Developer, development of test cases and automated tests for Visual Studio .Net, and product research into possible desired extensions facilitating ease of use in Visual Studio .Net. Software Development Engineer in Test Microsoft May 2001  –  August 2001  (4 months) Greater Seattle Area Development of regression tests for Office Developer, development of test cases and automated tests for Visual Studio .Net, and product research into possible desired extensions facilitating ease of use in Visual Studio .Net. Skills Distributed Systems Cloud Computing LaTeX Security .NET Information Security Object Oriented Design Testing Software Development System Architecture Databases Simulations XML Data Mining HTML Machine Learning Test Automation Java Operating Systems C++ Software Design Unix Software Engineering Visual Studio Programming Computer Science Algorithms C Parallel Programming Computer Security Python Linux Perl Systems Engineering See 19+     See less Skills  Distributed Systems Cloud Computing LaTeX Security .NET Information Security Object Oriented Design Testing Software Development System Architecture Databases Simulations XML Data Mining HTML Machine Learning Test Automation Java Operating Systems C++ Software Design Unix Software Engineering Visual Studio Programming Computer Science Algorithms C Parallel Programming Computer Security Python Linux Perl Systems Engineering See 19+     See less Distributed Systems Cloud Computing LaTeX Security .NET Information Security Object Oriented Design Testing Software Development System Architecture Databases Simulations XML Data Mining HTML Machine Learning Test Automation Java Operating Systems C++ Software Design Unix Software Engineering Visual Studio Programming Computer Science Algorithms C Parallel Programming Computer Security Python Linux Perl Systems Engineering See 19+     See less Distributed Systems Cloud Computing LaTeX Security .NET Information Security Object Oriented Design Testing Software Development System Architecture Databases Simulations XML Data Mining HTML Machine Learning Test Automation Java Operating Systems C++ Software Design Unix Software Engineering Visual Studio Programming Computer Science Algorithms C Parallel Programming Computer Security Python Linux Perl Systems Engineering See 19+     See less Education Purdue University PhD,  Computer Science 2004  – 2010 Activities and Societies:  Purdue Latin and Ballroom Dance Team ,  Association for Computing Machinery (ACM) ,  Institute of Electrical and Electronics Engineers (IEEE) ,  Upsilon Pi Epsilon ,  Phi Beta Kappa ,  Alpha Lambda Delta Purdue University PhD,  Computer Science 2004  – 2010 Activities and Societies:  Purdue Latin and Ballroom Dance Team ,  Association for Computing Machinery (ACM) ,  Institute of Electrical and Electronics Engineers (IEEE) ,  Upsilon Pi Epsilon ,  Phi Beta Kappa ,  Alpha Lambda Delta Purdue University PhD,  Computer Science 2004  – 2010 Activities and Societies:  Purdue Latin and Ballroom Dance Team ,  Association for Computing Machinery (ACM) ,  Institute of Electrical and Electronics Engineers (IEEE) ,  Upsilon Pi Epsilon ,  Phi Beta Kappa ,  Alpha Lambda Delta Purdue University PhD,  Computer Science 2004  – 2010 Activities and Societies:  Purdue Latin and Ballroom Dance Team ,  Association for Computing Machinery (ACM) ,  Institute of Electrical and Electronics Engineers (IEEE) ,  Upsilon Pi Epsilon ,  Phi Beta Kappa ,  Alpha Lambda Delta ", "Skills Computer Architecture Parallel Programming Algorithms Computer Science High Performance... Scientific Computing LaTeX Perl Distributed Systems Parallel Computing C++ Computational Physics MPI OpenMP Fortran Skills  Computer Architecture Parallel Programming Algorithms Computer Science High Performance... Scientific Computing LaTeX Perl Distributed Systems Parallel Computing C++ Computational Physics MPI OpenMP Fortran Computer Architecture Parallel Programming Algorithms Computer Science High Performance... Scientific Computing LaTeX Perl Distributed Systems Parallel Computing C++ Computational Physics MPI OpenMP Fortran Computer Architecture Parallel Programming Algorithms Computer Science High Performance... Scientific Computing LaTeX Perl Distributed Systems Parallel Computing C++ Computational Physics MPI OpenMP Fortran ", "Summary Systems Engineer on communicaitons PHY achitecture and algorithm development for WiFi, WiMAX, Mobile TV; Expert on RF interference mitigation.  \n \nSpecialties: Wireless communications architecture, communication theory and signal processing. In-depth knowledge and experience with MIMO technologies, OFDM, OFDMA, channel coding, modulation. Familiar with various communication standards such as WLAN (802.11a/g/n), 3GPP (WCDMA/HSDPA), LTE, Mobile TV standards (DAB/T-DMB, DVB-T/H, and ATSC-MH), Bluetooth, WiMAX (802.16d/e). Expertise in computer simulation and modeling. Knowledge of media access control (MAC) protocols and RF systems. Familar with RF charactersitics analysis and calibration. Experienced in measuring and analyzing data, and lab debugging. Experienced in reducing platform RF noise. Experienced in wireless multimedia user experience KPI benchmarking. Summary Systems Engineer on communicaitons PHY achitecture and algorithm development for WiFi, WiMAX, Mobile TV; Expert on RF interference mitigation.  \n \nSpecialties: Wireless communications architecture, communication theory and signal processing. In-depth knowledge and experience with MIMO technologies, OFDM, OFDMA, channel coding, modulation. Familiar with various communication standards such as WLAN (802.11a/g/n), 3GPP (WCDMA/HSDPA), LTE, Mobile TV standards (DAB/T-DMB, DVB-T/H, and ATSC-MH), Bluetooth, WiMAX (802.16d/e). Expertise in computer simulation and modeling. Knowledge of media access control (MAC) protocols and RF systems. Familar with RF charactersitics analysis and calibration. Experienced in measuring and analyzing data, and lab debugging. Experienced in reducing platform RF noise. Experienced in wireless multimedia user experience KPI benchmarking. Systems Engineer on communicaitons PHY achitecture and algorithm development for WiFi, WiMAX, Mobile TV; Expert on RF interference mitigation.  \n \nSpecialties: Wireless communications architecture, communication theory and signal processing. In-depth knowledge and experience with MIMO technologies, OFDM, OFDMA, channel coding, modulation. Familiar with various communication standards such as WLAN (802.11a/g/n), 3GPP (WCDMA/HSDPA), LTE, Mobile TV standards (DAB/T-DMB, DVB-T/H, and ATSC-MH), Bluetooth, WiMAX (802.16d/e). Expertise in computer simulation and modeling. Knowledge of media access control (MAC) protocols and RF systems. Familar with RF charactersitics analysis and calibration. Experienced in measuring and analyzing data, and lab debugging. Experienced in reducing platform RF noise. Experienced in wireless multimedia user experience KPI benchmarking. Systems Engineer on communicaitons PHY achitecture and algorithm development for WiFi, WiMAX, Mobile TV; Expert on RF interference mitigation.  \n \nSpecialties: Wireless communications architecture, communication theory and signal processing. In-depth knowledge and experience with MIMO technologies, OFDM, OFDMA, channel coding, modulation. Familiar with various communication standards such as WLAN (802.11a/g/n), 3GPP (WCDMA/HSDPA), LTE, Mobile TV standards (DAB/T-DMB, DVB-T/H, and ATSC-MH), Bluetooth, WiMAX (802.16d/e). Expertise in computer simulation and modeling. Knowledge of media access control (MAC) protocols and RF systems. Familar with RF charactersitics analysis and calibration. Experienced in measuring and analyzing data, and lab debugging. Experienced in reducing platform RF noise. Experienced in wireless multimedia user experience KPI benchmarking. Experience Staff Systems Engineer Intel Corporation September 2004  – Present (11 years) Wireless (WiFi, Wireless Display, 3G, WiMAX, Mobile TV etc) for mobile laptop \nFocus on wireless communication architecture, PHY algorithm development, system performance evaluation/analysis/optimization/enhancement, new feature design/enabling, platform RF noise mitigation, enhancing multi-radio coexistence  \n \n1. WiFi(802.11 a/g/n): PHY algorithm development/simulation, firmware/driver implementation, verification/validation of implementation in the lab, modem diagnostics, system performance evaluation/analysis/optimization, WiFi/BT co-exstence, RF interference mitigation , laptop integration.  \n2. 3G: PHY layer simulation, RF interference mitigation, 3G/WiFi co-existence  \n3. WiMax(802.16 d/e): PHY layer simulation, RF interference mitigation, WiFi/WiMAX co-existence \n4. Mobile TV (DVB T/H, DAB/T-DMB and ATSC/ATSC-MH): PHY architecutre and algorithm development/simulation, performance evaluation/analysis, RF interference mitigation, laptop integration \n5. Wireless Display: system performance evaluation/analysis/optimization, new feature design/enabling, issue root-causing, benchmarking KPI for user experience enhancement Graduate Research Intern Intel Corporation April 2003  –  September 2003  (6 months) research work on high-throughput wireless LAN application (IEEE 802.11n) Staff Systems Engineer Intel Corporation September 2004  – Present (11 years) Wireless (WiFi, Wireless Display, 3G, WiMAX, Mobile TV etc) for mobile laptop \nFocus on wireless communication architecture, PHY algorithm development, system performance evaluation/analysis/optimization/enhancement, new feature design/enabling, platform RF noise mitigation, enhancing multi-radio coexistence  \n \n1. WiFi(802.11 a/g/n): PHY algorithm development/simulation, firmware/driver implementation, verification/validation of implementation in the lab, modem diagnostics, system performance evaluation/analysis/optimization, WiFi/BT co-exstence, RF interference mitigation , laptop integration.  \n2. 3G: PHY layer simulation, RF interference mitigation, 3G/WiFi co-existence  \n3. WiMax(802.16 d/e): PHY layer simulation, RF interference mitigation, WiFi/WiMAX co-existence \n4. Mobile TV (DVB T/H, DAB/T-DMB and ATSC/ATSC-MH): PHY architecutre and algorithm development/simulation, performance evaluation/analysis, RF interference mitigation, laptop integration \n5. Wireless Display: system performance evaluation/analysis/optimization, new feature design/enabling, issue root-causing, benchmarking KPI for user experience enhancement Staff Systems Engineer Intel Corporation September 2004  – Present (11 years) Wireless (WiFi, Wireless Display, 3G, WiMAX, Mobile TV etc) for mobile laptop \nFocus on wireless communication architecture, PHY algorithm development, system performance evaluation/analysis/optimization/enhancement, new feature design/enabling, platform RF noise mitigation, enhancing multi-radio coexistence  \n \n1. WiFi(802.11 a/g/n): PHY algorithm development/simulation, firmware/driver implementation, verification/validation of implementation in the lab, modem diagnostics, system performance evaluation/analysis/optimization, WiFi/BT co-exstence, RF interference mitigation , laptop integration.  \n2. 3G: PHY layer simulation, RF interference mitigation, 3G/WiFi co-existence  \n3. WiMax(802.16 d/e): PHY layer simulation, RF interference mitigation, WiFi/WiMAX co-existence \n4. Mobile TV (DVB T/H, DAB/T-DMB and ATSC/ATSC-MH): PHY architecutre and algorithm development/simulation, performance evaluation/analysis, RF interference mitigation, laptop integration \n5. Wireless Display: system performance evaluation/analysis/optimization, new feature design/enabling, issue root-causing, benchmarking KPI for user experience enhancement Graduate Research Intern Intel Corporation April 2003  –  September 2003  (6 months) research work on high-throughput wireless LAN application (IEEE 802.11n) Graduate Research Intern Intel Corporation April 2003  –  September 2003  (6 months) research work on high-throughput wireless LAN application (IEEE 802.11n) Languages Chinese Chinese Chinese Skills Digital Signal... OFDM MIMO WiMAX RF WiFi PHY Wireless 3GPP IEEE 802.11 Digital Signal... WLAN Baseband Mobile Devices Signal Processing SoC Device Drivers Firmware Debugging Bluetooth Algorithms See 6+     See less Skills  Digital Signal... OFDM MIMO WiMAX RF WiFi PHY Wireless 3GPP IEEE 802.11 Digital Signal... WLAN Baseband Mobile Devices Signal Processing SoC Device Drivers Firmware Debugging Bluetooth Algorithms See 6+     See less Digital Signal... OFDM MIMO WiMAX RF WiFi PHY Wireless 3GPP IEEE 802.11 Digital Signal... WLAN Baseband Mobile Devices Signal Processing SoC Device Drivers Firmware Debugging Bluetooth Algorithms See 6+     See less Digital Signal... OFDM MIMO WiMAX RF WiFi PHY Wireless 3GPP IEEE 802.11 Digital Signal... WLAN Baseband Mobile Devices Signal Processing SoC Device Drivers Firmware Debugging Bluetooth Algorithms See 6+     See less Education University of Washington PhD,  Electrical Engineering 2001  – 2004 MIMO OFDM code design University of Washington PhD,  Electrical Engineering 2001  – 2004 MIMO OFDM code design University of Washington PhD,  Electrical Engineering 2001  – 2004 MIMO OFDM code design University of Washington PhD,  Electrical Engineering 2001  – 2004 MIMO OFDM code design ", "Summary I am a PhD student at Georgia Tech, working primarily on large-scale simultaneous localization and mapping (SLAM) algorithms. Summary I am a PhD student at Georgia Tech, working primarily on large-scale simultaneous localization and mapping (SLAM) algorithms. I am a PhD student at Georgia Tech, working primarily on large-scale simultaneous localization and mapping (SLAM) algorithms. I am a PhD student at Georgia Tech, working primarily on large-scale simultaneous localization and mapping (SLAM) algorithms. Experience Graduate Research Intern Intel Corporation May 2011  –  August 2011  (4 months) Santa Clara 3D reconstruction using a moving Kinect camera. Graduate Research Intern Intel Corporation May 2011  –  August 2011  (4 months) Santa Clara 3D reconstruction using a moving Kinect camera. Graduate Research Intern Intel Corporation May 2011  –  August 2011  (4 months) Santa Clara 3D reconstruction using a moving Kinect camera. Skills Matlab C++ Computer Vision Robotics Structure from Motion Algorithms Research Stereo Vision Skills  Matlab C++ Computer Vision Robotics Structure from Motion Algorithms Research Stereo Vision Matlab C++ Computer Vision Robotics Structure from Motion Algorithms Research Stereo Vision Matlab C++ Computer Vision Robotics Structure from Motion Algorithms Research Stereo Vision Education Georgia Institute of Technology Doctor of Philosophy (Ph.D.),  Computer Engineering 2006  – 2015 University of Tennessee-Knoxville Master of Science (MS),  Computer Engineering 2004  – 2006 University of Tennessee-Knoxville Bachelor of Science (BS),  Computer Engineering 2000  – 2004 Georgia Institute of Technology Doctor of Philosophy (Ph.D.),  Computer Engineering 2006  – 2015 Georgia Institute of Technology Doctor of Philosophy (Ph.D.),  Computer Engineering 2006  – 2015 Georgia Institute of Technology Doctor of Philosophy (Ph.D.),  Computer Engineering 2006  – 2015 University of Tennessee-Knoxville Master of Science (MS),  Computer Engineering 2004  – 2006 University of Tennessee-Knoxville Master of Science (MS),  Computer Engineering 2004  – 2006 University of Tennessee-Knoxville Master of Science (MS),  Computer Engineering 2004  – 2006 University of Tennessee-Knoxville Bachelor of Science (BS),  Computer Engineering 2000  – 2004 University of Tennessee-Knoxville Bachelor of Science (BS),  Computer Engineering 2000  – 2004 University of Tennessee-Knoxville Bachelor of Science (BS),  Computer Engineering 2000  – 2004 ", "Summary I am a results-oriented Operations Research professional with over 8 years of experience in applying optimization techniques in designing supply chain, logistics and transportation solutions for global organizations. I thrive in coming up with practical solutions for complex business problems. \n \n \nSpecialities: Supply Chain Optimization, Transportation Planning, Inventory Management, and Logistics Supply Chain Network Design \nCombinatorial Optimization, Mathematical Programming, Data Analysis \nAMPL, CPLEX, C++, MS Access, MS Excel, VBA Programming \nProject Management Summary I am a results-oriented Operations Research professional with over 8 years of experience in applying optimization techniques in designing supply chain, logistics and transportation solutions for global organizations. I thrive in coming up with practical solutions for complex business problems. \n \n \nSpecialities: Supply Chain Optimization, Transportation Planning, Inventory Management, and Logistics Supply Chain Network Design \nCombinatorial Optimization, Mathematical Programming, Data Analysis \nAMPL, CPLEX, C++, MS Access, MS Excel, VBA Programming \nProject Management I am a results-oriented Operations Research professional with over 8 years of experience in applying optimization techniques in designing supply chain, logistics and transportation solutions for global organizations. I thrive in coming up with practical solutions for complex business problems. \n \n \nSpecialities: Supply Chain Optimization, Transportation Planning, Inventory Management, and Logistics Supply Chain Network Design \nCombinatorial Optimization, Mathematical Programming, Data Analysis \nAMPL, CPLEX, C++, MS Access, MS Excel, VBA Programming \nProject Management I am a results-oriented Operations Research professional with over 8 years of experience in applying optimization techniques in designing supply chain, logistics and transportation solutions for global organizations. I thrive in coming up with practical solutions for complex business problems. \n \n \nSpecialities: Supply Chain Optimization, Transportation Planning, Inventory Management, and Logistics Supply Chain Network Design \nCombinatorial Optimization, Mathematical Programming, Data Analysis \nAMPL, CPLEX, C++, MS Access, MS Excel, VBA Programming \nProject Management Experience Sr Manager Operations Research Rock-Tenn Company June 2014  – Present (1 year 3 months) Greater Atlanta Area Lead Logistics Engineer Schneider National Inc July 2007  –  June 2014  (7 years) As part of external consulting group - \n•\tCompleted several global and regional strategic supply chain network studies to determine locations of warehouses, ports and mode of transportation \n•\tDeveloped an optimization model to identify optimal bin sizes to calculate inventory footprint for a global manufacturing customer \n•\tConducted tactical transportation planning studies to identify cross docking/pooling opportunities \n•\tIdentified transportation savings by freight consolidation (simple, multi-stop or pooling) and mode selection \n \nAs part of internal consulting group - \n•\tDesigned and developed optimization features in operational dispatch system \n•\tImplemented an ad hoc tool to transfer rate and routing data structures from legacy system to new ERP system \n•\tRecommended schedule to convert customers’ accounts from legacy system to new system using mathematical programming model \n•\tModel development using Java and CPLEX concert technology to determine availability of capacity during order acceptance process Operations Research Analyst Decisive Analytics Corporation May 2006  –  July 2007  (1 year 3 months) As an Operations Research Analyst, responsibilities included research, development and testing in the field of combinatorial auctions. Two main areas of research were: winner determination problem (WDP) and pricing problem. Performed fine-tuning to WDP models to improve the solution time. Different models of pricing were proposed, implemented and analyzed to recommend FCC, pricing strategies to be used in the future combinatorial auctions. The main tools used were CPLEX, Concert technology, C++, Java, Sybase SQL server, and Eclipse. Research Assistant University of Arizona August 2001  –  May 2006  (4 years 10 months) Worked on a project titled “The Optimal Design of Survivable Multicommodity Flow Networks with General Failure Scenarios” funded by Defense Advanced Research Projects Agency (DARPA).The research for this project falls into three primary categories: applied research, collaborative investigations, and theoretical research. The applied research was the primary focus of this project, and deals with problems of designing multi-commodity flow networks that remain operational under basic equipment failure scenarios. The numerous applications for this algorithm could be found in communication network design, project management and logistics management. Graduate Research Intern Intel Corporation May 2005  –  August 2005  (4 months) Presented a stochastic programming approach for risk management at three different levels: Product Design, Manufacturing Process Design, and Manufacturing Execution. A mixed integer programming formulation was presented and modified to integrate the stochasticity of the tasks and associated risks in a project. This was a decision tool regarding the risk mitigation allocation for a task looking at the upstream, downstream and the overall supply chain management system. This tool was developed using ILOG CPLEX Concert Technology, C++ with the user interface designed using C# programming. Sr Manager Operations Research Rock-Tenn Company June 2014  – Present (1 year 3 months) Greater Atlanta Area Sr Manager Operations Research Rock-Tenn Company June 2014  – Present (1 year 3 months) Greater Atlanta Area Lead Logistics Engineer Schneider National Inc July 2007  –  June 2014  (7 years) As part of external consulting group - \n•\tCompleted several global and regional strategic supply chain network studies to determine locations of warehouses, ports and mode of transportation \n•\tDeveloped an optimization model to identify optimal bin sizes to calculate inventory footprint for a global manufacturing customer \n•\tConducted tactical transportation planning studies to identify cross docking/pooling opportunities \n•\tIdentified transportation savings by freight consolidation (simple, multi-stop or pooling) and mode selection \n \nAs part of internal consulting group - \n•\tDesigned and developed optimization features in operational dispatch system \n•\tImplemented an ad hoc tool to transfer rate and routing data structures from legacy system to new ERP system \n•\tRecommended schedule to convert customers’ accounts from legacy system to new system using mathematical programming model \n•\tModel development using Java and CPLEX concert technology to determine availability of capacity during order acceptance process Lead Logistics Engineer Schneider National Inc July 2007  –  June 2014  (7 years) As part of external consulting group - \n•\tCompleted several global and regional strategic supply chain network studies to determine locations of warehouses, ports and mode of transportation \n•\tDeveloped an optimization model to identify optimal bin sizes to calculate inventory footprint for a global manufacturing customer \n•\tConducted tactical transportation planning studies to identify cross docking/pooling opportunities \n•\tIdentified transportation savings by freight consolidation (simple, multi-stop or pooling) and mode selection \n \nAs part of internal consulting group - \n•\tDesigned and developed optimization features in operational dispatch system \n•\tImplemented an ad hoc tool to transfer rate and routing data structures from legacy system to new ERP system \n•\tRecommended schedule to convert customers’ accounts from legacy system to new system using mathematical programming model \n•\tModel development using Java and CPLEX concert technology to determine availability of capacity during order acceptance process Operations Research Analyst Decisive Analytics Corporation May 2006  –  July 2007  (1 year 3 months) As an Operations Research Analyst, responsibilities included research, development and testing in the field of combinatorial auctions. Two main areas of research were: winner determination problem (WDP) and pricing problem. Performed fine-tuning to WDP models to improve the solution time. Different models of pricing were proposed, implemented and analyzed to recommend FCC, pricing strategies to be used in the future combinatorial auctions. The main tools used were CPLEX, Concert technology, C++, Java, Sybase SQL server, and Eclipse. Operations Research Analyst Decisive Analytics Corporation May 2006  –  July 2007  (1 year 3 months) As an Operations Research Analyst, responsibilities included research, development and testing in the field of combinatorial auctions. Two main areas of research were: winner determination problem (WDP) and pricing problem. Performed fine-tuning to WDP models to improve the solution time. Different models of pricing were proposed, implemented and analyzed to recommend FCC, pricing strategies to be used in the future combinatorial auctions. The main tools used were CPLEX, Concert technology, C++, Java, Sybase SQL server, and Eclipse. Research Assistant University of Arizona August 2001  –  May 2006  (4 years 10 months) Worked on a project titled “The Optimal Design of Survivable Multicommodity Flow Networks with General Failure Scenarios” funded by Defense Advanced Research Projects Agency (DARPA).The research for this project falls into three primary categories: applied research, collaborative investigations, and theoretical research. The applied research was the primary focus of this project, and deals with problems of designing multi-commodity flow networks that remain operational under basic equipment failure scenarios. The numerous applications for this algorithm could be found in communication network design, project management and logistics management. Research Assistant University of Arizona August 2001  –  May 2006  (4 years 10 months) Worked on a project titled “The Optimal Design of Survivable Multicommodity Flow Networks with General Failure Scenarios” funded by Defense Advanced Research Projects Agency (DARPA).The research for this project falls into three primary categories: applied research, collaborative investigations, and theoretical research. The applied research was the primary focus of this project, and deals with problems of designing multi-commodity flow networks that remain operational under basic equipment failure scenarios. The numerous applications for this algorithm could be found in communication network design, project management and logistics management. Graduate Research Intern Intel Corporation May 2005  –  August 2005  (4 months) Presented a stochastic programming approach for risk management at three different levels: Product Design, Manufacturing Process Design, and Manufacturing Execution. A mixed integer programming formulation was presented and modified to integrate the stochasticity of the tasks and associated risks in a project. This was a decision tool regarding the risk mitigation allocation for a task looking at the upstream, downstream and the overall supply chain management system. This tool was developed using ILOG CPLEX Concert Technology, C++ with the user interface designed using C# programming. Graduate Research Intern Intel Corporation May 2005  –  August 2005  (4 months) Presented a stochastic programming approach for risk management at three different levels: Product Design, Manufacturing Process Design, and Manufacturing Execution. A mixed integer programming formulation was presented and modified to integrate the stochasticity of the tasks and associated risks in a project. This was a decision tool regarding the risk mitigation allocation for a task looking at the upstream, downstream and the overall supply chain management system. This tool was developed using ILOG CPLEX Concert Technology, C++ with the user interface designed using C# programming. Languages English Hindi English Hindi English Hindi Skills Operations Research C++ Java Matlab CPLEX Mathematical Modeling Linear Programming Python Mathematical Programming Combinatorial... Data Analysis Supply Chain... Transportation Planning Strategic Consulting C JavaScript HTML JSP Simulations Data Mining SQL Testing Integration Supply Chain Management Process Improvement See 10+     See less Skills  Operations Research C++ Java Matlab CPLEX Mathematical Modeling Linear Programming Python Mathematical Programming Combinatorial... Data Analysis Supply Chain... Transportation Planning Strategic Consulting C JavaScript HTML JSP Simulations Data Mining SQL Testing Integration Supply Chain Management Process Improvement See 10+     See less Operations Research C++ Java Matlab CPLEX Mathematical Modeling Linear Programming Python Mathematical Programming Combinatorial... Data Analysis Supply Chain... Transportation Planning Strategic Consulting C JavaScript HTML JSP Simulations Data Mining SQL Testing Integration Supply Chain Management Process Improvement See 10+     See less Operations Research C++ Java Matlab CPLEX Mathematical Modeling Linear Programming Python Mathematical Programming Combinatorial... Data Analysis Supply Chain... Transportation Planning Strategic Consulting C JavaScript HTML JSP Simulations Data Mining SQL Testing Integration Supply Chain Management Process Improvement See 10+     See less Education University of Arizona Masters,  Industrial Engineering (Operations Research) 2001  – 2003 Thesis Title: \"The Optimal Design of Survivable Multicommodity Flow Networks with General Failure Scenarios\". National Institute of Technology Jalandhar BTech,  Textile Technology 1996  – 2000 University of Arizona Masters,  Industrial Engineering (Operations Research) 2001  – 2003 Thesis Title: \"The Optimal Design of Survivable Multicommodity Flow Networks with General Failure Scenarios\". University of Arizona Masters,  Industrial Engineering (Operations Research) 2001  – 2003 Thesis Title: \"The Optimal Design of Survivable Multicommodity Flow Networks with General Failure Scenarios\". University of Arizona Masters,  Industrial Engineering (Operations Research) 2001  – 2003 Thesis Title: \"The Optimal Design of Survivable Multicommodity Flow Networks with General Failure Scenarios\". National Institute of Technology Jalandhar BTech,  Textile Technology 1996  – 2000 National Institute of Technology Jalandhar BTech,  Textile Technology 1996  – 2000 National Institute of Technology Jalandhar BTech,  Textile Technology 1996  – 2000 ", "Experience Sr Software Engineer NVIDIA January 2009  – Present (6 years 8 months) Graduate Research Intern Intel Corporation, Chandler PHX January 2007  –  January 2008  (1 year 1 month) Worked in the Embedded Communications and Processor Division - Architect/Performance team. Development of Ethernet drivers on Linux Infosys Engineer Avid Technology February 2004  –  July 2006  (2 years 6 months) worked as a Infosys Programmar analyst , Technical Lead for Airspeed broadcast server. Programmar Analyst Infosys Technologies Ltd April 2003  –  July 2006  (3 years 4 months) Product Design Development and Services for Media products Software Engineer California Digital (India) May 2001  –  April 2003  (2 years) Sr Software Engineer NVIDIA January 2009  – Present (6 years 8 months) Sr Software Engineer NVIDIA January 2009  – Present (6 years 8 months) Graduate Research Intern Intel Corporation, Chandler PHX January 2007  –  January 2008  (1 year 1 month) Worked in the Embedded Communications and Processor Division - Architect/Performance team. Development of Ethernet drivers on Linux Graduate Research Intern Intel Corporation, Chandler PHX January 2007  –  January 2008  (1 year 1 month) Worked in the Embedded Communications and Processor Division - Architect/Performance team. Development of Ethernet drivers on Linux Infosys Engineer Avid Technology February 2004  –  July 2006  (2 years 6 months) worked as a Infosys Programmar analyst , Technical Lead for Airspeed broadcast server. Infosys Engineer Avid Technology February 2004  –  July 2006  (2 years 6 months) worked as a Infosys Programmar analyst , Technical Lead for Airspeed broadcast server. Programmar Analyst Infosys Technologies Ltd April 2003  –  July 2006  (3 years 4 months) Product Design Development and Services for Media products Programmar Analyst Infosys Technologies Ltd April 2003  –  July 2006  (3 years 4 months) Product Design Development and Services for Media products Software Engineer California Digital (India) May 2001  –  April 2003  (2 years) Software Engineer California Digital (India) May 2001  –  April 2003  (2 years) Skills Architecture Proof of Concept Embedded Systems Perl Debugging C++ C Computer Architecture Device Drivers Algorithms Software Development Linux Unix Python Embedded Software Agile Methodologies TCL Linux Kernel High Performance... Distributed Systems See 5+     See less Skills  Architecture Proof of Concept Embedded Systems Perl Debugging C++ C Computer Architecture Device Drivers Algorithms Software Development Linux Unix Python Embedded Software Agile Methodologies TCL Linux Kernel High Performance... Distributed Systems See 5+     See less Architecture Proof of Concept Embedded Systems Perl Debugging C++ C Computer Architecture Device Drivers Algorithms Software Development Linux Unix Python Embedded Software Agile Methodologies TCL Linux Kernel High Performance... Distributed Systems See 5+     See less Architecture Proof of Concept Embedded Systems Perl Debugging C++ C Computer Architecture Device Drivers Algorithms Software Development Linux Unix Python Embedded Software Agile Methodologies TCL Linux Kernel High Performance... Distributed Systems See 5+     See less Education Arizona State University MS,  Computer Science 2006  – 2008 Dharmsinh Desai Institute of Technology BE,  Computer Engineering 1997  – 2001 Navrachna Arizona State University MS,  Computer Science 2006  – 2008 Arizona State University MS,  Computer Science 2006  – 2008 Arizona State University MS,  Computer Science 2006  – 2008 Dharmsinh Desai Institute of Technology BE,  Computer Engineering 1997  – 2001 Dharmsinh Desai Institute of Technology BE,  Computer Engineering 1997  – 2001 Dharmsinh Desai Institute of Technology BE,  Computer Engineering 1997  – 2001 Navrachna Navrachna Navrachna Honors & Awards "]}