{"position": "Group Leader", "company": "Intel Corporation", "profiles": ["Skills Process Integration Metrology IC JMP Thin Films Failure Analysis Semiconductors Engineering Management Leadership SPC Creative Solutions Design of Experiments FMEA CMOS CVD Lithography Characterization Silicon Yield Training Electronics Etching Semiconductor Industry Photolithography Plasma Etch Intel PECVD MEMS Product Engineering Semiconductor Process Materials Science Sputtering Nanotechnology Microelectronics See 19+     See less Skills  Process Integration Metrology IC JMP Thin Films Failure Analysis Semiconductors Engineering Management Leadership SPC Creative Solutions Design of Experiments FMEA CMOS CVD Lithography Characterization Silicon Yield Training Electronics Etching Semiconductor Industry Photolithography Plasma Etch Intel PECVD MEMS Product Engineering Semiconductor Process Materials Science Sputtering Nanotechnology Microelectronics See 19+     See less Process Integration Metrology IC JMP Thin Films Failure Analysis Semiconductors Engineering Management Leadership SPC Creative Solutions Design of Experiments FMEA CMOS CVD Lithography Characterization Silicon Yield Training Electronics Etching Semiconductor Industry Photolithography Plasma Etch Intel PECVD MEMS Product Engineering Semiconductor Process Materials Science Sputtering Nanotechnology Microelectronics See 19+     See less Process Integration Metrology IC JMP Thin Films Failure Analysis Semiconductors Engineering Management Leadership SPC Creative Solutions Design of Experiments FMEA CMOS CVD Lithography Characterization Silicon Yield Training Electronics Etching Semiconductor Industry Photolithography Plasma Etch Intel PECVD MEMS Product Engineering Semiconductor Process Materials Science Sputtering Nanotechnology Microelectronics See 19+     See less ", "Experience Dielectrics Engineering Group Leader Intel Corporation January 2010  – Present (5 years 8 months) CVD Tungsten Engineer Intel Corporation January 2008  –  January 2010  (2 years 1 month) Israel Industrial Engineering Group Leader Intel Corporation January 2003  –  January 2008  (5 years 1 month) Israel Lithography Manufacturing Group Leader Intel Corporation January 2001  –  January 2003  (2 years 1 month) Israel Thin Film Manufacturing Group Leader Intel Corporation January 1998  –  January 2001  (3 years 1 month) Israel Dielectrics Engineering Group Leader Intel Corporation January 2010  – Present (5 years 8 months) Dielectrics Engineering Group Leader Intel Corporation January 2010  – Present (5 years 8 months) CVD Tungsten Engineer Intel Corporation January 2008  –  January 2010  (2 years 1 month) Israel CVD Tungsten Engineer Intel Corporation January 2008  –  January 2010  (2 years 1 month) Israel Industrial Engineering Group Leader Intel Corporation January 2003  –  January 2008  (5 years 1 month) Israel Industrial Engineering Group Leader Intel Corporation January 2003  –  January 2008  (5 years 1 month) Israel Lithography Manufacturing Group Leader Intel Corporation January 2001  –  January 2003  (2 years 1 month) Israel Lithography Manufacturing Group Leader Intel Corporation January 2001  –  January 2003  (2 years 1 month) Israel Thin Film Manufacturing Group Leader Intel Corporation January 1998  –  January 2001  (3 years 1 month) Israel Thin Film Manufacturing Group Leader Intel Corporation January 1998  –  January 2001  (3 years 1 month) Israel Skills Manufacturing SPC Semiconductor Industry Semiconductors Process Engineering Engineering Engineering Management Design of Experiments Cross-functional Team... Leadership Program Management CVD Lean Manufacturing IC Skills  Manufacturing SPC Semiconductor Industry Semiconductors Process Engineering Engineering Engineering Management Design of Experiments Cross-functional Team... Leadership Program Management CVD Lean Manufacturing IC Manufacturing SPC Semiconductor Industry Semiconductors Process Engineering Engineering Engineering Management Design of Experiments Cross-functional Team... Leadership Program Management CVD Lean Manufacturing IC Manufacturing SPC Semiconductor Industry Semiconductors Process Engineering Engineering Engineering Management Design of Experiments Cross-functional Team... Leadership Program Management CVD Lean Manufacturing IC Education sharon sharon sharon sharon ", "Experience Volunteer Windsor Garden Club April 2011  – Present (4 years 5 months) Windsor, CA Volunteer Computer History Museum 2001  – Present (14 years) Babbage Difference Engine Operator/Maintenance \nCollections Volunteer Collections Volunteer Palo Alto City Library June 2006  –  June 2011  (5 years 1 month) Angel Elf The Family Giving Tree 1995  –  2010  (15 years) - Create the warehouse layout and maps needed to position the individual row signs to enable volunteers to sort and organize the gifts for the Holiday drive.  \n- Organize the quality checking operation for the Back to School drive Tapeout Applications and Integration Engineering Group Leader Intel Corporation 2002  –  2008  (6 years) Technology Integration Engineering Group Leader Intel Corporation 1992  –  2004  (12 years) Central Frames Generation Services Manager Intel Corporation 1989  –  1992  (3 years) Lithography Engineering Group Leader Intel Corporation 1986  –  1989  (3 years) Lithography Engineer (Technology Development) Intel Corporation 1985  –  1986  (1 year) Stepper Area Functional Manager Intel Corporation 1984  –  1985  (1 year) Lithography Engineer (Technology Development) Intel Corporation 1981  –  1984  (3 years) Fab Process Engineer Intel Corporation 1976  –  1981  (5 years) Research Assistant Catalytica Energy Systems 1975  –  1976  (1 year) Volunteer Windsor Garden Club April 2011  – Present (4 years 5 months) Windsor, CA Volunteer Windsor Garden Club April 2011  – Present (4 years 5 months) Windsor, CA Volunteer Computer History Museum 2001  – Present (14 years) Babbage Difference Engine Operator/Maintenance \nCollections Volunteer Volunteer Computer History Museum 2001  – Present (14 years) Babbage Difference Engine Operator/Maintenance \nCollections Volunteer Collections Volunteer Palo Alto City Library June 2006  –  June 2011  (5 years 1 month) Collections Volunteer Palo Alto City Library June 2006  –  June 2011  (5 years 1 month) Angel Elf The Family Giving Tree 1995  –  2010  (15 years) - Create the warehouse layout and maps needed to position the individual row signs to enable volunteers to sort and organize the gifts for the Holiday drive.  \n- Organize the quality checking operation for the Back to School drive Angel Elf The Family Giving Tree 1995  –  2010  (15 years) - Create the warehouse layout and maps needed to position the individual row signs to enable volunteers to sort and organize the gifts for the Holiday drive.  \n- Organize the quality checking operation for the Back to School drive Tapeout Applications and Integration Engineering Group Leader Intel Corporation 2002  –  2008  (6 years) Tapeout Applications and Integration Engineering Group Leader Intel Corporation 2002  –  2008  (6 years) Technology Integration Engineering Group Leader Intel Corporation 1992  –  2004  (12 years) Technology Integration Engineering Group Leader Intel Corporation 1992  –  2004  (12 years) Central Frames Generation Services Manager Intel Corporation 1989  –  1992  (3 years) Central Frames Generation Services Manager Intel Corporation 1989  –  1992  (3 years) Lithography Engineering Group Leader Intel Corporation 1986  –  1989  (3 years) Lithography Engineering Group Leader Intel Corporation 1986  –  1989  (3 years) Lithography Engineer (Technology Development) Intel Corporation 1985  –  1986  (1 year) Lithography Engineer (Technology Development) Intel Corporation 1985  –  1986  (1 year) Stepper Area Functional Manager Intel Corporation 1984  –  1985  (1 year) Stepper Area Functional Manager Intel Corporation 1984  –  1985  (1 year) Lithography Engineer (Technology Development) Intel Corporation 1981  –  1984  (3 years) Lithography Engineer (Technology Development) Intel Corporation 1981  –  1984  (3 years) Fab Process Engineer Intel Corporation 1976  –  1981  (5 years) Fab Process Engineer Intel Corporation 1976  –  1981  (5 years) Research Assistant Catalytica Energy Systems 1975  –  1976  (1 year) Research Assistant Catalytica Energy Systems 1975  –  1976  (1 year) Skills Program Management Semiconductors Integration Start-ups Cross-functional Team... Product Management Leadership Project Management Management Nonprofits Skills  Program Management Semiconductors Integration Start-ups Cross-functional Team... Product Management Leadership Project Management Management Nonprofits Program Management Semiconductors Integration Start-ups Cross-functional Team... Product Management Leadership Project Management Management Nonprofits Program Management Semiconductors Integration Start-ups Cross-functional Team... Product Management Leadership Project Management Management Nonprofits Education Stanford University B. S.,  Chemical Engineering Stanford University B. S.,  Chemical Engineering Stanford University B. S.,  Chemical Engineering Stanford University B. S.,  Chemical Engineering ", "Skills RTL design Logic Design EDA ASIC Processors Verilog SoC Semiconductors SystemVerilog VLSI Static Timing Analysis Functional Verification Simulations RTL Design Formal Verification Intel Computer Architecture See 2+     See less Skills  RTL design Logic Design EDA ASIC Processors Verilog SoC Semiconductors SystemVerilog VLSI Static Timing Analysis Functional Verification Simulations RTL Design Formal Verification Intel Computer Architecture See 2+     See less RTL design Logic Design EDA ASIC Processors Verilog SoC Semiconductors SystemVerilog VLSI Static Timing Analysis Functional Verification Simulations RTL Design Formal Verification Intel Computer Architecture See 2+     See less RTL design Logic Design EDA ASIC Processors Verilog SoC Semiconductors SystemVerilog VLSI Static Timing Analysis Functional Verification Simulations RTL Design Formal Verification Intel Computer Architecture See 2+     See less ", "Summary Leading team of equipment/process engineers focusing on improving manufacturing process, sustaining excellence and advanced troubleshooting. Experience in problem solving, excursion prevention, projects management, high volume manufacturing and lean methodology. Summary Leading team of equipment/process engineers focusing on improving manufacturing process, sustaining excellence and advanced troubleshooting. Experience in problem solving, excursion prevention, projects management, high volume manufacturing and lean methodology. Leading team of equipment/process engineers focusing on improving manufacturing process, sustaining excellence and advanced troubleshooting. Experience in problem solving, excursion prevention, projects management, high volume manufacturing and lean methodology. Leading team of equipment/process engineers focusing on improving manufacturing process, sustaining excellence and advanced troubleshooting. Experience in problem solving, excursion prevention, projects management, high volume manufacturing and lean methodology. Experience Engineering Group Leader Intel Corporation January 2011  – Present (4 years 8 months) Manufacturing Group Leader Intel Corporation January 2007  –  December 2010  (4 years) RF/Microwave R&D Eng Vectria Ltd. August 2003  –  December 2006  (3 years 5 months) RF/Microwave R&D Eng Alvarion Technologies January 2001  –  July 2003  (2 years 7 months) RF/Microwave R&D Eng ELTA October 1998  –  December 2000  (2 years 3 months) Engineering Group Leader Intel Corporation January 2011  – Present (4 years 8 months) Engineering Group Leader Intel Corporation January 2011  – Present (4 years 8 months) Manufacturing Group Leader Intel Corporation January 2007  –  December 2010  (4 years) Manufacturing Group Leader Intel Corporation January 2007  –  December 2010  (4 years) RF/Microwave R&D Eng Vectria Ltd. August 2003  –  December 2006  (3 years 5 months) RF/Microwave R&D Eng Vectria Ltd. August 2003  –  December 2006  (3 years 5 months) RF/Microwave R&D Eng Alvarion Technologies January 2001  –  July 2003  (2 years 7 months) RF/Microwave R&D Eng Alvarion Technologies January 2001  –  July 2003  (2 years 7 months) RF/Microwave R&D Eng ELTA October 1998  –  December 2000  (2 years 3 months) RF/Microwave R&D Eng ELTA October 1998  –  December 2000  (2 years 3 months) Skills Manufacturing Semiconductors Semiconductor Industry SPC R&D Design of Experiments Engineering Management Engineering Failure Analysis Process Engineering Electronics Skills  Manufacturing Semiconductors Semiconductor Industry SPC R&D Design of Experiments Engineering Management Engineering Failure Analysis Process Engineering Electronics Manufacturing Semiconductors Semiconductor Industry SPC R&D Design of Experiments Engineering Management Engineering Failure Analysis Process Engineering Electronics Manufacturing Semiconductors Semiconductor Industry SPC R&D Design of Experiments Engineering Management Engineering Failure Analysis Process Engineering Electronics Education Ben-Gurion University of the Negev Master of Business Administration (M.B.A.) 2000  – 2003 Ben-Gurion University of the Negev Bachelor's Degree,  Electrical and Electronics Engineering 1995  – 1999 Ben-Gurion University of the Negev Master of Business Administration (M.B.A.) 2000  – 2003 Ben-Gurion University of the Negev Master of Business Administration (M.B.A.) 2000  – 2003 Ben-Gurion University of the Negev Master of Business Administration (M.B.A.) 2000  – 2003 Ben-Gurion University of the Negev Bachelor's Degree,  Electrical and Electronics Engineering 1995  – 1999 Ben-Gurion University of the Negev Bachelor's Degree,  Electrical and Electronics Engineering 1995  – 1999 Ben-Gurion University of the Negev Bachelor's Degree,  Electrical and Electronics Engineering 1995  – 1999 ", "Experience Shift Group Leader Intel Corporation January 2014  – Present (1 year 8 months) Responsible for management of manufacturing operators and technicians and the manufacturing process like manager and engineer supporting all manufacturing business around Assembly area. shift Group Leader Intel Corporation 1998  –  2014  (16 years) Shift Group Leader Intel Corporation 1998  –  2014  (16 years) Shift Group Leader Intel Corporation January 2014  – Present (1 year 8 months) Responsible for management of manufacturing operators and technicians and the manufacturing process like manager and engineer supporting all manufacturing business around Assembly area. Shift Group Leader Intel Corporation January 2014  – Present (1 year 8 months) Responsible for management of manufacturing operators and technicians and the manufacturing process like manager and engineer supporting all manufacturing business around Assembly area. shift Group Leader Intel Corporation 1998  –  2014  (16 years) shift Group Leader Intel Corporation 1998  –  2014  (16 years) Shift Group Leader Intel Corporation 1998  –  2014  (16 years) Shift Group Leader Intel Corporation 1998  –  2014  (16 years) Skills Management Teamwork Data Analysis Result Oriented Objective-C Skills  Management Teamwork Data Analysis Result Oriented Objective-C Management Teamwork Data Analysis Result Oriented Objective-C Management Teamwork Data Analysis Result Oriented Objective-C Education Universidad Hispanoamericana (CR) Bachelor's degree,  Industrial Engineering 2010  – 2015 Don Bosco Technical Institute Technician,  Electromechanic technician 1994  – 1997 Universidad Hispanoamericana (CR) Bachelor's degree,  Industrial Engineering 2010  – 2015 Universidad Hispanoamericana (CR) Bachelor's degree,  Industrial Engineering 2010  – 2015 Universidad Hispanoamericana (CR) Bachelor's degree,  Industrial Engineering 2010  – 2015 Don Bosco Technical Institute Technician,  Electromechanic technician 1994  – 1997 Don Bosco Technical Institute Technician,  Electromechanic technician 1994  – 1997 Don Bosco Technical Institute Technician,  Electromechanic technician 1994  – 1997 ", "Summary CSP (concentrated solar power) - parabolic trough was designed and built by me. Can be seen in films depicting the three experiments how steam pressure built up to 10 bar and the temperature rises to the boiling point. The next step is connecting electric motor to follow the sun's path and then convert the steam power to electrical power. Summary CSP (concentrated solar power) - parabolic trough was designed and built by me. Can be seen in films depicting the three experiments how steam pressure built up to 10 bar and the temperature rises to the boiling point. The next step is connecting electric motor to follow the sun's path and then convert the steam power to electrical power. CSP (concentrated solar power) - parabolic trough was designed and built by me. Can be seen in films depicting the three experiments how steam pressure built up to 10 bar and the temperature rises to the boiling point. The next step is connecting electric motor to follow the sun's path and then convert the steam power to electrical power. CSP (concentrated solar power) - parabolic trough was designed and built by me. Can be seen in films depicting the three experiments how steam pressure built up to 10 bar and the temperature rises to the boiling point. The next step is connecting electric motor to follow the sun's path and then convert the steam power to electrical power. Experience Engineering Group Leader Intel Corporation April 2014  – Present (1 year 5 months) Qiryat Gat (Lachish) Leadership and management group of equipment and process engineers for thin film, diffusion, dry etch, and wet etch tools. The team are responsible for all equipment and process aspects: safety, quality, availability, run rate, cost, sustaining and operational excellence. \nExperience in manufacturing fields: quality control; TRIZ and model based problem solving; excursion prevention, organizational development, projects management and execution, and operations excellence in a high volume manufacturing. Dry Etch Engineer Intel Corporation April 2013  –  May 2014  (1 year 2 months) Qiryat Gat (Lachish) Equipment and Process Engineer (tool owner), responsible for module sustain at HVM and continues improvement in term of safety, quality, availability, and cost saving projects. Accountable for the appropriate training, mentoring and coaching of Manufacturing Technicians. Manufacturing Group Leader Intel Corporation January 2011  –  April 2013  (2 years 4 months) Qiryat Gat (Lachish) Manufacturing Group Leader that responsible for people management, technical & professional authority, leader and owner of the area with respect to Safety, Quality, Cost, Maintenance and Operation. Technical Leader in Operational Squadron, O-level [Major] Israeli Air Force August 2008  –  August 2011  (3 years 1 month) Nevatim Air Base Technical maintenance responsibilities of unique airborne weapons systems. leader and owner of the technical team with respect to safety, availability and usability of operational weapons. O-level is the day-to-day work that an operating unit performs in support of its own operations. The mission of the O-level activity is to maintain its aircraft and equipment in a full mission capable status while improving the local maintenance process. Maintenance at this level includes line operations (inspections, servicing, handling, and so forth). O-level maintenance also includes repairs and minor adjustments that do not require shop facilities as well as the removal and installation of components. Head of Maintenance Section in the F-15 Branch [Major] Israeli Air Force June 2006  –  August 2008  (2 years 3 months) Headquarters Responsible for aircraft maintenance policy, knowledge contracts, maintenance contracts, literature and budgetary control of the f-15 Branch. A Maintenance Officer, O-level [Captain] Israeli Air Force August 1999  –  August 2002  (3 years 1 month) Hazerim Air Base Providing maintenance squadron flight. Treatment and maintenance of aircraft operational arena. Commander of mechanical team in the mechanics department and responsible on the soldier proficiency. Officer in Aircraft Shop, D-Level [Lieutenant] Israeli Air Force August 1996  –  August 1999  (3 years 1 month) The Air Maintenance Unit Technicians team management, who provide maintenance services consist. Depot Maintenance (D-Level) supports O- and I-levels by providing maintenance that is beyond their capability. Depot maintenance is work that must be done in an industrial-type facility. Standard depot-level maintenance (SDLM) includes overhaul, repair, and modification of aircraft, components, and equipment. F-15 Eagle Keeper, D-Level [Staff Sergeant] Israeli Air Force July 1992  –  August 1996  (4 years 2 months) The Air Maintenance Unit Renovation the mechanical system of F-15 aircraft (fuel system, air conditioning, landing gear, canopy, etc.) Engineering Group Leader Intel Corporation April 2014  – Present (1 year 5 months) Qiryat Gat (Lachish) Leadership and management group of equipment and process engineers for thin film, diffusion, dry etch, and wet etch tools. The team are responsible for all equipment and process aspects: safety, quality, availability, run rate, cost, sustaining and operational excellence. \nExperience in manufacturing fields: quality control; TRIZ and model based problem solving; excursion prevention, organizational development, projects management and execution, and operations excellence in a high volume manufacturing. Engineering Group Leader Intel Corporation April 2014  – Present (1 year 5 months) Qiryat Gat (Lachish) Leadership and management group of equipment and process engineers for thin film, diffusion, dry etch, and wet etch tools. The team are responsible for all equipment and process aspects: safety, quality, availability, run rate, cost, sustaining and operational excellence. \nExperience in manufacturing fields: quality control; TRIZ and model based problem solving; excursion prevention, organizational development, projects management and execution, and operations excellence in a high volume manufacturing. Dry Etch Engineer Intel Corporation April 2013  –  May 2014  (1 year 2 months) Qiryat Gat (Lachish) Equipment and Process Engineer (tool owner), responsible for module sustain at HVM and continues improvement in term of safety, quality, availability, and cost saving projects. Accountable for the appropriate training, mentoring and coaching of Manufacturing Technicians. Dry Etch Engineer Intel Corporation April 2013  –  May 2014  (1 year 2 months) Qiryat Gat (Lachish) Equipment and Process Engineer (tool owner), responsible for module sustain at HVM and continues improvement in term of safety, quality, availability, and cost saving projects. Accountable for the appropriate training, mentoring and coaching of Manufacturing Technicians. Manufacturing Group Leader Intel Corporation January 2011  –  April 2013  (2 years 4 months) Qiryat Gat (Lachish) Manufacturing Group Leader that responsible for people management, technical & professional authority, leader and owner of the area with respect to Safety, Quality, Cost, Maintenance and Operation. Manufacturing Group Leader Intel Corporation January 2011  –  April 2013  (2 years 4 months) Qiryat Gat (Lachish) Manufacturing Group Leader that responsible for people management, technical & professional authority, leader and owner of the area with respect to Safety, Quality, Cost, Maintenance and Operation. Technical Leader in Operational Squadron, O-level [Major] Israeli Air Force August 2008  –  August 2011  (3 years 1 month) Nevatim Air Base Technical maintenance responsibilities of unique airborne weapons systems. leader and owner of the technical team with respect to safety, availability and usability of operational weapons. O-level is the day-to-day work that an operating unit performs in support of its own operations. The mission of the O-level activity is to maintain its aircraft and equipment in a full mission capable status while improving the local maintenance process. Maintenance at this level includes line operations (inspections, servicing, handling, and so forth). O-level maintenance also includes repairs and minor adjustments that do not require shop facilities as well as the removal and installation of components. Technical Leader in Operational Squadron, O-level [Major] Israeli Air Force August 2008  –  August 2011  (3 years 1 month) Nevatim Air Base Technical maintenance responsibilities of unique airborne weapons systems. leader and owner of the technical team with respect to safety, availability and usability of operational weapons. O-level is the day-to-day work that an operating unit performs in support of its own operations. The mission of the O-level activity is to maintain its aircraft and equipment in a full mission capable status while improving the local maintenance process. Maintenance at this level includes line operations (inspections, servicing, handling, and so forth). O-level maintenance also includes repairs and minor adjustments that do not require shop facilities as well as the removal and installation of components. Head of Maintenance Section in the F-15 Branch [Major] Israeli Air Force June 2006  –  August 2008  (2 years 3 months) Headquarters Responsible for aircraft maintenance policy, knowledge contracts, maintenance contracts, literature and budgetary control of the f-15 Branch. Head of Maintenance Section in the F-15 Branch [Major] Israeli Air Force June 2006  –  August 2008  (2 years 3 months) Headquarters Responsible for aircraft maintenance policy, knowledge contracts, maintenance contracts, literature and budgetary control of the f-15 Branch. A Maintenance Officer, O-level [Captain] Israeli Air Force August 1999  –  August 2002  (3 years 1 month) Hazerim Air Base Providing maintenance squadron flight. Treatment and maintenance of aircraft operational arena. Commander of mechanical team in the mechanics department and responsible on the soldier proficiency. A Maintenance Officer, O-level [Captain] Israeli Air Force August 1999  –  August 2002  (3 years 1 month) Hazerim Air Base Providing maintenance squadron flight. Treatment and maintenance of aircraft operational arena. Commander of mechanical team in the mechanics department and responsible on the soldier proficiency. Officer in Aircraft Shop, D-Level [Lieutenant] Israeli Air Force August 1996  –  August 1999  (3 years 1 month) The Air Maintenance Unit Technicians team management, who provide maintenance services consist. Depot Maintenance (D-Level) supports O- and I-levels by providing maintenance that is beyond their capability. Depot maintenance is work that must be done in an industrial-type facility. Standard depot-level maintenance (SDLM) includes overhaul, repair, and modification of aircraft, components, and equipment. Officer in Aircraft Shop, D-Level [Lieutenant] Israeli Air Force August 1996  –  August 1999  (3 years 1 month) The Air Maintenance Unit Technicians team management, who provide maintenance services consist. Depot Maintenance (D-Level) supports O- and I-levels by providing maintenance that is beyond their capability. Depot maintenance is work that must be done in an industrial-type facility. Standard depot-level maintenance (SDLM) includes overhaul, repair, and modification of aircraft, components, and equipment. F-15 Eagle Keeper, D-Level [Staff Sergeant] Israeli Air Force July 1992  –  August 1996  (4 years 2 months) The Air Maintenance Unit Renovation the mechanical system of F-15 aircraft (fuel system, air conditioning, landing gear, canopy, etc.) F-15 Eagle Keeper, D-Level [Staff Sergeant] Israeli Air Force July 1992  –  August 1996  (4 years 2 months) The Air Maintenance Unit Renovation the mechanical system of F-15 aircraft (fuel system, air conditioning, landing gear, canopy, etc.) Languages English English English Skills Manufacturing Semiconductors Engineering Management Design of Experiments Engineering Lean Manufacturing Aircraft Semiconductor Industry Cross-functional Team... Simulations Continuous Improvement Matlab Failure Analysis Solidworks Design for Manufacturing Process Engineering Testing Leadership Root Cause Analysis Intel Industrial Engineering Mechanical Engineering Finite Element Analysis Management JMP Pro Engineer Data Scientist See 12+     See less Skills  Manufacturing Semiconductors Engineering Management Design of Experiments Engineering Lean Manufacturing Aircraft Semiconductor Industry Cross-functional Team... Simulations Continuous Improvement Matlab Failure Analysis Solidworks Design for Manufacturing Process Engineering Testing Leadership Root Cause Analysis Intel Industrial Engineering Mechanical Engineering Finite Element Analysis Management JMP Pro Engineer Data Scientist See 12+     See less Manufacturing Semiconductors Engineering Management Design of Experiments Engineering Lean Manufacturing Aircraft Semiconductor Industry Cross-functional Team... Simulations Continuous Improvement Matlab Failure Analysis Solidworks Design for Manufacturing Process Engineering Testing Leadership Root Cause Analysis Intel Industrial Engineering Mechanical Engineering Finite Element Analysis Management JMP Pro Engineer Data Scientist See 12+     See less Manufacturing Semiconductors Engineering Management Design of Experiments Engineering Lean Manufacturing Aircraft Semiconductor Industry Cross-functional Team... Simulations Continuous Improvement Matlab Failure Analysis Solidworks Design for Manufacturing Process Engineering Testing Leadership Root Cause Analysis Intel Industrial Engineering Mechanical Engineering Finite Element Analysis Management JMP Pro Engineer Data Scientist See 12+     See less Education Ben-Gurion University of the Negev Master of Science (M.Sc.),  Mechanical Engineering 2008  – 2010 Ben-Gurion University of the Negev Bachelor of Science (B.Sc.),  Mechanical Engineering 2002  – 2006 Ben-Gurion University of the Negev Master of Science (M.Sc.),  Mechanical Engineering 2008  – 2010 Ben-Gurion University of the Negev Master of Science (M.Sc.),  Mechanical Engineering 2008  – 2010 Ben-Gurion University of the Negev Master of Science (M.Sc.),  Mechanical Engineering 2008  – 2010 Ben-Gurion University of the Negev Bachelor of Science (B.Sc.),  Mechanical Engineering 2002  – 2006 Ben-Gurion University of the Negev Bachelor of Science (B.Sc.),  Mechanical Engineering 2002  – 2006 Ben-Gurion University of the Negev Bachelor of Science (B.Sc.),  Mechanical Engineering 2002  – 2006 ", "Experience Corporate Services Electrical Group Leader Intel Corporation October 2014  – Present (11 months) Aloha, Oregon Manager of the Aloha Corporate Services Electrical, I&C, and Life Safety groups across all shifts for the Intel Aloha Campus. Business Owner Destination Your World February 2009  – Present (6 years 7 months) Travel agency and consulting business focusing on leisure travel. Manufacturing Group Leader Intel Corporation June 1994  –  October 2014  (20 years 5 months) Hillsboro Oregon Manager for a 300MM industry leading computer chip manufacturing fab (factory). Managed 6 operations managers and second level manager for approx 145 employees. Responsible for safety, quality, and output for the factory on a compressed work week shift. Co-Founder RnD Rum Reviews June 2006  –  August 2012  (6 years 3 months) Industry leading rum review website Officer, First Lieutenant US Army June 1990  –  May 1994  (4 years) Corporate Services Electrical Group Leader Intel Corporation October 2014  – Present (11 months) Aloha, Oregon Manager of the Aloha Corporate Services Electrical, I&C, and Life Safety groups across all shifts for the Intel Aloha Campus. Corporate Services Electrical Group Leader Intel Corporation October 2014  – Present (11 months) Aloha, Oregon Manager of the Aloha Corporate Services Electrical, I&C, and Life Safety groups across all shifts for the Intel Aloha Campus. Business Owner Destination Your World February 2009  – Present (6 years 7 months) Travel agency and consulting business focusing on leisure travel. Business Owner Destination Your World February 2009  – Present (6 years 7 months) Travel agency and consulting business focusing on leisure travel. Manufacturing Group Leader Intel Corporation June 1994  –  October 2014  (20 years 5 months) Hillsboro Oregon Manager for a 300MM industry leading computer chip manufacturing fab (factory). Managed 6 operations managers and second level manager for approx 145 employees. Responsible for safety, quality, and output for the factory on a compressed work week shift. Manufacturing Group Leader Intel Corporation June 1994  –  October 2014  (20 years 5 months) Hillsboro Oregon Manager for a 300MM industry leading computer chip manufacturing fab (factory). Managed 6 operations managers and second level manager for approx 145 employees. Responsible for safety, quality, and output for the factory on a compressed work week shift. Co-Founder RnD Rum Reviews June 2006  –  August 2012  (6 years 3 months) Industry leading rum review website Co-Founder RnD Rum Reviews June 2006  –  August 2012  (6 years 3 months) Industry leading rum review website Officer, First Lieutenant US Army June 1990  –  May 1994  (4 years) Officer, First Lieutenant US Army June 1990  –  May 1994  (4 years) Skills Manufacturing SPC Management Semiconductors Leadership Cross-functional Team... Lean Manufacturing Continuous Improvement Engineering Management Process Engineering Operations Management Program Management Process Improvement Skills  Manufacturing SPC Management Semiconductors Leadership Cross-functional Team... Lean Manufacturing Continuous Improvement Engineering Management Process Engineering Operations Management Program Management Process Improvement Manufacturing SPC Management Semiconductors Leadership Cross-functional Team... Lean Manufacturing Continuous Improvement Engineering Management Process Engineering Operations Management Program Management Process Improvement Manufacturing SPC Management Semiconductors Leadership Cross-functional Team... Lean Manufacturing Continuous Improvement Engineering Management Process Engineering Operations Management Program Management Process Improvement Education Oregon Institute of Technology B.S.,  Electronics Engineering Technology 1986  – 1991 Activities and Societies:  ROTC Oregon Institute of Technology B.S.,  Electronics Engineering Technology 1986  – 1991 Activities and Societies:  ROTC Oregon Institute of Technology B.S.,  Electronics Engineering Technology 1986  – 1991 Activities and Societies:  ROTC Oregon Institute of Technology B.S.,  Electronics Engineering Technology 1986  – 1991 Activities and Societies:  ROTC ", "Summary Twelve years of experience as people manager, with teams ranging from six to 40+ people. Management positions in Training Department (Training Supervisor) and Manufacturing (Technical & Operational Shift Group Leader). Manufacturing and production professional skilled in leading high-producing teams and using lean manufacturing to reduce costs and increase process efficiency. Results-driven, skilled Manufacturing Manager focused on achieving success and increased productivity through improvements in operations, quality, safety and administration. Summary Twelve years of experience as people manager, with teams ranging from six to 40+ people. Management positions in Training Department (Training Supervisor) and Manufacturing (Technical & Operational Shift Group Leader). Manufacturing and production professional skilled in leading high-producing teams and using lean manufacturing to reduce costs and increase process efficiency. Results-driven, skilled Manufacturing Manager focused on achieving success and increased productivity through improvements in operations, quality, safety and administration. Twelve years of experience as people manager, with teams ranging from six to 40+ people. Management positions in Training Department (Training Supervisor) and Manufacturing (Technical & Operational Shift Group Leader). Manufacturing and production professional skilled in leading high-producing teams and using lean manufacturing to reduce costs and increase process efficiency. Results-driven, skilled Manufacturing Manager focused on achieving success and increased productivity through improvements in operations, quality, safety and administration. Twelve years of experience as people manager, with teams ranging from six to 40+ people. Management positions in Training Department (Training Supervisor) and Manufacturing (Technical & Operational Shift Group Leader). Manufacturing and production professional skilled in leading high-producing teams and using lean manufacturing to reduce costs and increase process efficiency. Results-driven, skilled Manufacturing Manager focused on achieving success and increased productivity through improvements in operations, quality, safety and administration. Experience Costa Rica Validation Center Group Leader Intel Corporation October 2014  – Present (11 months) Costa Rica Costa Rica Validation Center Group Leader Intel Corporation October 2014  – Present (11 months) Module Shift Group Leader Intel Corporation January 2014  –  October 2014  (10 months) Costa Rica Technnical Training Supervisor Intel Corporation February 2012  –  December 2013  (1 year 11 months) Costa Rica High Precision Maintenance System Engineer Intel Corporation March 2010  –  January 2012  (1 year 11 months) Costa Rica High Precision Maintenance Technical Supervisor Intel Corporation February 2009  –  March 2010  (1 year 2 months) Costa Rica Manufacturing Technical & Production Supervisor Intel Corporation May 2002  –  February 2009  (6 years 10 months) Costa Rica Manufacturing Technician Equipment Intel Corporation January 1998  –  January 2002  (4 years 1 month) Costa Rica Senior Electronic Technician Espion Electronica January 1995  –  December 1997  (3 years) Costa Rica Costa Rica Validation Center Group Leader Intel Corporation October 2014  – Present (11 months) Costa Rica Costa Rica Validation Center Group Leader Intel Corporation October 2014  – Present (11 months) Costa Rica Costa Rica Validation Center Group Leader Intel Corporation October 2014  – Present (11 months) Costa Rica Validation Center Group Leader Intel Corporation October 2014  – Present (11 months) Module Shift Group Leader Intel Corporation January 2014  –  October 2014  (10 months) Costa Rica Module Shift Group Leader Intel Corporation January 2014  –  October 2014  (10 months) Costa Rica Technnical Training Supervisor Intel Corporation February 2012  –  December 2013  (1 year 11 months) Costa Rica Technnical Training Supervisor Intel Corporation February 2012  –  December 2013  (1 year 11 months) Costa Rica High Precision Maintenance System Engineer Intel Corporation March 2010  –  January 2012  (1 year 11 months) Costa Rica High Precision Maintenance System Engineer Intel Corporation March 2010  –  January 2012  (1 year 11 months) Costa Rica High Precision Maintenance Technical Supervisor Intel Corporation February 2009  –  March 2010  (1 year 2 months) Costa Rica High Precision Maintenance Technical Supervisor Intel Corporation February 2009  –  March 2010  (1 year 2 months) Costa Rica Manufacturing Technical & Production Supervisor Intel Corporation May 2002  –  February 2009  (6 years 10 months) Costa Rica Manufacturing Technical & Production Supervisor Intel Corporation May 2002  –  February 2009  (6 years 10 months) Costa Rica Manufacturing Technician Equipment Intel Corporation January 1998  –  January 2002  (4 years 1 month) Costa Rica Manufacturing Technician Equipment Intel Corporation January 1998  –  January 2002  (4 years 1 month) Costa Rica Senior Electronic Technician Espion Electronica January 1995  –  December 1997  (3 years) Costa Rica Senior Electronic Technician Espion Electronica January 1995  –  December 1997  (3 years) Costa Rica Languages English Limited working proficiency Spanish Full professional proficiency English Limited working proficiency Spanish Full professional proficiency English Limited working proficiency Spanish Full professional proficiency Limited working proficiency Full professional proficiency Skills Intel ASIC IC Semiconductor Industry Semiconductors SoC VLSI Electronics Manufacturing Failure Analysis SPC Process Improvement Design of Experiments Lean Manufacturing JMP Lean manufacturing See 1+     See less Skills  Intel ASIC IC Semiconductor Industry Semiconductors SoC VLSI Electronics Manufacturing Failure Analysis SPC Process Improvement Design of Experiments Lean Manufacturing JMP Lean manufacturing See 1+     See less Intel ASIC IC Semiconductor Industry Semiconductors SoC VLSI Electronics Manufacturing Failure Analysis SPC Process Improvement Design of Experiments Lean Manufacturing JMP Lean manufacturing See 1+     See less Intel ASIC IC Semiconductor Industry Semiconductors SoC VLSI Electronics Manufacturing Failure Analysis SPC Process Improvement Design of Experiments Lean Manufacturing JMP Lean manufacturing See 1+     See less Education Instituto de Estudios Empresariales Managerial Competencies Improvement,  Business Administration and Management , General 2013  – 2014 Instituto Nacional De Aprendizaje (INA) Analysis & repair of pneumatic systems,  Pneumatic Diploma , Diploma 1996  – 1997 Instituto Interamericano de Tecnologia Electronic Diploma,  Industrial Electronics Technology/Technician , Diploma 1993  – 1995 Colegio Tecnico Profesional San Sebastian High School,  Electrical , Electronic and Communications Engineering Technology/Technician , Techncian 1984  – 1986 Instituto de Estudios Empresariales Managerial Competencies Improvement,  Business Administration and Management , General 2013  – 2014 Instituto de Estudios Empresariales Managerial Competencies Improvement,  Business Administration and Management , General 2013  – 2014 Instituto de Estudios Empresariales Managerial Competencies Improvement,  Business Administration and Management , General 2013  – 2014 Instituto Nacional De Aprendizaje (INA) Analysis & repair of pneumatic systems,  Pneumatic Diploma , Diploma 1996  – 1997 Instituto Nacional De Aprendizaje (INA) Analysis & repair of pneumatic systems,  Pneumatic Diploma , Diploma 1996  – 1997 Instituto Nacional De Aprendizaje (INA) Analysis & repair of pneumatic systems,  Pneumatic Diploma , Diploma 1996  – 1997 Instituto Interamericano de Tecnologia Electronic Diploma,  Industrial Electronics Technology/Technician , Diploma 1993  – 1995 Instituto Interamericano de Tecnologia Electronic Diploma,  Industrial Electronics Technology/Technician , Diploma 1993  – 1995 Instituto Interamericano de Tecnologia Electronic Diploma,  Industrial Electronics Technology/Technician , Diploma 1993  – 1995 Colegio Tecnico Profesional San Sebastian High School,  Electrical , Electronic and Communications Engineering Technology/Technician , Techncian 1984  – 1986 Colegio Tecnico Profesional San Sebastian High School,  Electrical , Electronic and Communications Engineering Technology/Technician , Techncian 1984  – 1986 Colegio Tecnico Profesional San Sebastian High School,  Electrical , Electronic and Communications Engineering Technology/Technician , Techncian 1984  – 1986 ", "Summary Manage technicals Eng human resource in develop and manufacture factories ,Develop and manage projects. Manage product from develop to produce for electrical , mechanical and optical system.  \nhuge experience with secrity system and Semi-conductors factories (HW/process). Summary Manage technicals Eng human resource in develop and manufacture factories ,Develop and manage projects. Manage product from develop to produce for electrical , mechanical and optical system.  \nhuge experience with secrity system and Semi-conductors factories (HW/process). Manage technicals Eng human resource in develop and manufacture factories ,Develop and manage projects. Manage product from develop to produce for electrical , mechanical and optical system.  \nhuge experience with secrity system and Semi-conductors factories (HW/process). Manage technicals Eng human resource in develop and manufacture factories ,Develop and manage projects. Manage product from develop to produce for electrical , mechanical and optical system.  \nhuge experience with secrity system and Semi-conductors factories (HW/process). Experience Defect Metro Eng group leader Intel Corporation May 2011  –  December 2014  (3 years 8 months) Responsible for 300mm/22nm defect metrology tools technology, manage group of 12 engineers and responsible for more than 36 tools in clean room environment. Provide reliable and optimally sampled defect data to the factory customers enabling proactive opportunities to deliver world class yield. \nAnalyzes Based analytical tools (Dark/Bright field) on pattern/unpattern wafer. \nHeavy experience on hardware trouble shooting and task force management with vendor supplier (KLA Tencor, Applied Material, Hitachi, Agilent…) and virtual factory in the US and Europe and development factory (PTD, AMAT, 450mm process...) Defect Metro manufacture group leader Intel Corporation March 2009  –  March 2011  (2 years 1 month) Defect Metro / Thin film MF group leader Intel Corporation March 2007  –  January 2008  (11 months) Phoenix, Arizona Area Intelligence factory manager Israel Defense Forces March 2002  –  December 2006  (4 years 10 months) Defect Metro Eng group leader Intel Corporation May 2011  –  December 2014  (3 years 8 months) Responsible for 300mm/22nm defect metrology tools technology, manage group of 12 engineers and responsible for more than 36 tools in clean room environment. Provide reliable and optimally sampled defect data to the factory customers enabling proactive opportunities to deliver world class yield. \nAnalyzes Based analytical tools (Dark/Bright field) on pattern/unpattern wafer. \nHeavy experience on hardware trouble shooting and task force management with vendor supplier (KLA Tencor, Applied Material, Hitachi, Agilent…) and virtual factory in the US and Europe and development factory (PTD, AMAT, 450mm process...) Defect Metro Eng group leader Intel Corporation May 2011  –  December 2014  (3 years 8 months) Responsible for 300mm/22nm defect metrology tools technology, manage group of 12 engineers and responsible for more than 36 tools in clean room environment. Provide reliable and optimally sampled defect data to the factory customers enabling proactive opportunities to deliver world class yield. \nAnalyzes Based analytical tools (Dark/Bright field) on pattern/unpattern wafer. \nHeavy experience on hardware trouble shooting and task force management with vendor supplier (KLA Tencor, Applied Material, Hitachi, Agilent…) and virtual factory in the US and Europe and development factory (PTD, AMAT, 450mm process...) Defect Metro manufacture group leader Intel Corporation March 2009  –  March 2011  (2 years 1 month) Defect Metro manufacture group leader Intel Corporation March 2009  –  March 2011  (2 years 1 month) Defect Metro / Thin film MF group leader Intel Corporation March 2007  –  January 2008  (11 months) Phoenix, Arizona Area Defect Metro / Thin film MF group leader Intel Corporation March 2007  –  January 2008  (11 months) Phoenix, Arizona Area Intelligence factory manager Israel Defense Forces March 2002  –  December 2006  (4 years 10 months) Intelligence factory manager Israel Defense Forces March 2002  –  December 2006  (4 years 10 months) Languages English English English Skills Microsoft Office Microsoft Excel Microsoft Word Customer Service PowerPoint English Windows Outlook Teaching Photoshop Public Speaking HTML Strategic Planning Budgets Negotiation Skills  Microsoft Office Microsoft Excel Microsoft Word Customer Service PowerPoint English Windows Outlook Teaching Photoshop Public Speaking HTML Strategic Planning Budgets Negotiation Microsoft Office Microsoft Excel Microsoft Word Customer Service PowerPoint English Windows Outlook Teaching Photoshop Public Speaking HTML Strategic Planning Budgets Negotiation Microsoft Office Microsoft Excel Microsoft Word Customer Service PowerPoint English Windows Outlook Teaching Photoshop Public Speaking HTML Strategic Planning Budgets Negotiation Education University of Derby Master of Business Administration (MBA) 1997  – 2000 Ben-Gurion University of the Negev Laser and Optical Engineering 1990  – 1994 University of Derby Master of Business Administration (MBA) 1997  – 2000 University of Derby Master of Business Administration (MBA) 1997  – 2000 University of Derby Master of Business Administration (MBA) 1997  – 2000 Ben-Gurion University of the Negev Laser and Optical Engineering 1990  – 1994 Ben-Gurion University of the Negev Laser and Optical Engineering 1990  – 1994 Ben-Gurion University of the Negev Laser and Optical Engineering 1990  – 1994 ", "Summary Manage and lead a group in a challenging environment to excel in their business. This while maintaining an inspiring and vivid professional and social atmosphere. Summary Manage and lead a group in a challenging environment to excel in their business. This while maintaining an inspiring and vivid professional and social atmosphere. Manage and lead a group in a challenging environment to excel in their business. This while maintaining an inspiring and vivid professional and social atmosphere. Manage and lead a group in a challenging environment to excel in their business. This while maintaining an inspiring and vivid professional and social atmosphere. Experience Implant Engineering group leader Intel Corporation December 2014  – Present (9 months) EPI/IMP Group leader Intel Corporation August 2013  –  December 2014  (1 year 5 months) Kiryat gat Coach, manage and lead employees towards stable and successful performance. Create a cohesive team that support, help and teach each over as “way of life”, as well as, enjoy the ride. Module Team leader Intel Corporation January 2011  –  August 2013  (2 years 8 months) Kiryat Gat, Israel In charge of a module (12 tools) in Fab 28 (Israel). \nThe module is part of the latest technology by Intel for the last year. \nMy roles included accountability for productivity, tools health, preventive maintenance, procedures, virtual fabs representative, module line health, cost and module strategic planning. In addition, leading 40 technician, and 5 engineers in very challenging and competitive environment. Research Associate Brookhaven National Laboratory November 2007  –  November 2010  (3 years 1 month) Upton, New York, USA Research of thin films of high temperature superconductors; Specializing in characterization of electronic transportation in SC. My role included design and build multiple channel Hall probe at He4 temperature, and in He3 cryostat, magnetic probes and high magnetic field measurements. R&D Eng. SCD May 2000  –  July 2002  (2 years 3 months) Characterize and develop new IR multi-pixel sensors for thermal imaging cameras. Implant Engineering group leader Intel Corporation December 2014  – Present (9 months) Implant Engineering group leader Intel Corporation December 2014  – Present (9 months) EPI/IMP Group leader Intel Corporation August 2013  –  December 2014  (1 year 5 months) Kiryat gat Coach, manage and lead employees towards stable and successful performance. Create a cohesive team that support, help and teach each over as “way of life”, as well as, enjoy the ride. EPI/IMP Group leader Intel Corporation August 2013  –  December 2014  (1 year 5 months) Kiryat gat Coach, manage and lead employees towards stable and successful performance. Create a cohesive team that support, help and teach each over as “way of life”, as well as, enjoy the ride. Module Team leader Intel Corporation January 2011  –  August 2013  (2 years 8 months) Kiryat Gat, Israel In charge of a module (12 tools) in Fab 28 (Israel). \nThe module is part of the latest technology by Intel for the last year. \nMy roles included accountability for productivity, tools health, preventive maintenance, procedures, virtual fabs representative, module line health, cost and module strategic planning. In addition, leading 40 technician, and 5 engineers in very challenging and competitive environment. Module Team leader Intel Corporation January 2011  –  August 2013  (2 years 8 months) Kiryat Gat, Israel In charge of a module (12 tools) in Fab 28 (Israel). \nThe module is part of the latest technology by Intel for the last year. \nMy roles included accountability for productivity, tools health, preventive maintenance, procedures, virtual fabs representative, module line health, cost and module strategic planning. In addition, leading 40 technician, and 5 engineers in very challenging and competitive environment. Research Associate Brookhaven National Laboratory November 2007  –  November 2010  (3 years 1 month) Upton, New York, USA Research of thin films of high temperature superconductors; Specializing in characterization of electronic transportation in SC. My role included design and build multiple channel Hall probe at He4 temperature, and in He3 cryostat, magnetic probes and high magnetic field measurements. Research Associate Brookhaven National Laboratory November 2007  –  November 2010  (3 years 1 month) Upton, New York, USA Research of thin films of high temperature superconductors; Specializing in characterization of electronic transportation in SC. My role included design and build multiple channel Hall probe at He4 temperature, and in He3 cryostat, magnetic probes and high magnetic field measurements. R&D Eng. SCD May 2000  –  July 2002  (2 years 3 months) Characterize and develop new IR multi-pixel sensors for thermal imaging cameras. R&D Eng. SCD May 2000  –  July 2002  (2 years 3 months) Characterize and develop new IR multi-pixel sensors for thermal imaging cameras. Languages English Full professional proficiency English Full professional proficiency English Full professional proficiency Full professional proficiency Skills Physics Nanotechnology Characterization Thin Films R&D Simulations Experimentation Semiconductors Labview Signal Processing Solid State Physics Spectroscopy Optics Image Processing Algorithms Matlab Materials Science Electro-optics Sensors Sputtering PVD X-ray Diffraction... AFM Intel device physics Technical leadership Ion Implant SPC Silicon Photonics Nanofabrication Ion Implantation LabVIEW Technical Staff... See 19+     See less Skills  Physics Nanotechnology Characterization Thin Films R&D Simulations Experimentation Semiconductors Labview Signal Processing Solid State Physics Spectroscopy Optics Image Processing Algorithms Matlab Materials Science Electro-optics Sensors Sputtering PVD X-ray Diffraction... AFM Intel device physics Technical leadership Ion Implant SPC Silicon Photonics Nanofabrication Ion Implantation LabVIEW Technical Staff... See 19+     See less Physics Nanotechnology Characterization Thin Films R&D Simulations Experimentation Semiconductors Labview Signal Processing Solid State Physics Spectroscopy Optics Image Processing Algorithms Matlab Materials Science Electro-optics Sensors Sputtering PVD X-ray Diffraction... AFM Intel device physics Technical leadership Ion Implant SPC Silicon Photonics Nanofabrication Ion Implantation LabVIEW Technical Staff... See 19+     See less Physics Nanotechnology Characterization Thin Films R&D Simulations Experimentation Semiconductors Labview Signal Processing Solid State Physics Spectroscopy Optics Image Processing Algorithms Matlab Materials Science Electro-optics Sensors Sputtering PVD X-ray Diffraction... AFM Intel device physics Technical leadership Ion Implant SPC Silicon Photonics Nanofabrication Ion Implantation LabVIEW Technical Staff... See 19+     See less Education Technion - Israel Institute of Technology PhD,  physics 2002  – 2007 Technion - Israel Institute of Technology PhD,  physics 2002  – 2007 Technion - Israel Institute of Technology PhD,  physics 2002  – 2007 Technion - Israel Institute of Technology PhD,  physics 2002  – 2007 ", "Experience Engineering TD Manager (Group Leader) Intel Corporation August 2012  – Present (3 years 1 month) Hillsboro, OR Dry Etch \nLogic Technology Development (LTD) Staff TD Process Engineer Intel Corporation January 2011  – Present (4 years 8 months) Hillsboro, OR, USA Dry etch \nLogic Technology Development Technical Group Leader Intel Corporation October 2011  –  August 2012  (11 months) Hillsboro, OR, USA Dry etch \nLogic Technology Development (LTD) Senior Technology Development Process Engineer Intel Corporation August 2007  –  December 2010  (3 years 5 months) Hillsboro, OR, USA Dry etch \nLogic Technology Development (LTD) \n \nKey job duties include: designing, running, and evaluating complex research and engineering experiments in the area of dry plasma etching for semiconductor fabrication. Performing a variety of complex operations and non-routine technical duties required to process product, detect and resolve non-routine equipment or process errors, and ensure product quality. Assuming responsibility and exercises initiative to accomplish objectives. Troubleshooting and solving process, equipment, and interface problems. Operating with considerable freedom on short and long range projects requiring judgment. Proficiency using SPC, PCSA, DOE, JMP. Hands on experiment using metrology tools to measure CDs (CDSEM), Particle Performance (UDI and UDK), and Optical visual inspection (MIK) Research Assistant (ECE Department) Old Dominion University January 2000  –  August 2007  (7 years 8 months) Norfolk, Virginia Area Studied the dynamics of deposition and growth of thin films (Si(100) homoepitaxy, indium on Si(100) and self-assembly of germanium quantum dots on Si(100)) by PLD. I’ve also designed and fabricated optical detectors, based on germanium quantum dots. I have designed and built two UHV PLD systems, one of them is attached to an Omicron UHV STM/AFM. I have a very good experience in operating, maintaining and dealing with ultrahigh vacuum systems, lasers (femtosecond, picosecond, and nanosecond), RHEED, SEM STM, and AFM Teaching Assistant (ECE Department) Old Dominion University January 2000  –  December 2000  (1 year) Norfolk, Virginia Area Taught Introduction to Engineering to freshmen students. Based on my performance I have been awarded the “teaching assistant of the year” from the ECE department Assistant Instructor (Physics Department) Cairo University 1997  –  1999  (2 years) Giza, Egypt Taught several undergraduate courses including solid-state senior laboratory, nuclear physics senior laboratory, freshman physics laboratory, statistical mechanics problems session, nuclear physics problem session, and thermodynamics problem session Engineering TD Manager (Group Leader) Intel Corporation August 2012  – Present (3 years 1 month) Hillsboro, OR Dry Etch \nLogic Technology Development (LTD) Engineering TD Manager (Group Leader) Intel Corporation August 2012  – Present (3 years 1 month) Hillsboro, OR Dry Etch \nLogic Technology Development (LTD) Staff TD Process Engineer Intel Corporation January 2011  – Present (4 years 8 months) Hillsboro, OR, USA Dry etch \nLogic Technology Development Staff TD Process Engineer Intel Corporation January 2011  – Present (4 years 8 months) Hillsboro, OR, USA Dry etch \nLogic Technology Development Technical Group Leader Intel Corporation October 2011  –  August 2012  (11 months) Hillsboro, OR, USA Dry etch \nLogic Technology Development (LTD) Technical Group Leader Intel Corporation October 2011  –  August 2012  (11 months) Hillsboro, OR, USA Dry etch \nLogic Technology Development (LTD) Senior Technology Development Process Engineer Intel Corporation August 2007  –  December 2010  (3 years 5 months) Hillsboro, OR, USA Dry etch \nLogic Technology Development (LTD) \n \nKey job duties include: designing, running, and evaluating complex research and engineering experiments in the area of dry plasma etching for semiconductor fabrication. Performing a variety of complex operations and non-routine technical duties required to process product, detect and resolve non-routine equipment or process errors, and ensure product quality. Assuming responsibility and exercises initiative to accomplish objectives. Troubleshooting and solving process, equipment, and interface problems. Operating with considerable freedom on short and long range projects requiring judgment. Proficiency using SPC, PCSA, DOE, JMP. Hands on experiment using metrology tools to measure CDs (CDSEM), Particle Performance (UDI and UDK), and Optical visual inspection (MIK) Senior Technology Development Process Engineer Intel Corporation August 2007  –  December 2010  (3 years 5 months) Hillsboro, OR, USA Dry etch \nLogic Technology Development (LTD) \n \nKey job duties include: designing, running, and evaluating complex research and engineering experiments in the area of dry plasma etching for semiconductor fabrication. Performing a variety of complex operations and non-routine technical duties required to process product, detect and resolve non-routine equipment or process errors, and ensure product quality. Assuming responsibility and exercises initiative to accomplish objectives. Troubleshooting and solving process, equipment, and interface problems. Operating with considerable freedom on short and long range projects requiring judgment. Proficiency using SPC, PCSA, DOE, JMP. Hands on experiment using metrology tools to measure CDs (CDSEM), Particle Performance (UDI and UDK), and Optical visual inspection (MIK) Research Assistant (ECE Department) Old Dominion University January 2000  –  August 2007  (7 years 8 months) Norfolk, Virginia Area Studied the dynamics of deposition and growth of thin films (Si(100) homoepitaxy, indium on Si(100) and self-assembly of germanium quantum dots on Si(100)) by PLD. I’ve also designed and fabricated optical detectors, based on germanium quantum dots. I have designed and built two UHV PLD systems, one of them is attached to an Omicron UHV STM/AFM. I have a very good experience in operating, maintaining and dealing with ultrahigh vacuum systems, lasers (femtosecond, picosecond, and nanosecond), RHEED, SEM STM, and AFM Research Assistant (ECE Department) Old Dominion University January 2000  –  August 2007  (7 years 8 months) Norfolk, Virginia Area Studied the dynamics of deposition and growth of thin films (Si(100) homoepitaxy, indium on Si(100) and self-assembly of germanium quantum dots on Si(100)) by PLD. I’ve also designed and fabricated optical detectors, based on germanium quantum dots. I have designed and built two UHV PLD systems, one of them is attached to an Omicron UHV STM/AFM. I have a very good experience in operating, maintaining and dealing with ultrahigh vacuum systems, lasers (femtosecond, picosecond, and nanosecond), RHEED, SEM STM, and AFM Teaching Assistant (ECE Department) Old Dominion University January 2000  –  December 2000  (1 year) Norfolk, Virginia Area Taught Introduction to Engineering to freshmen students. Based on my performance I have been awarded the “teaching assistant of the year” from the ECE department Teaching Assistant (ECE Department) Old Dominion University January 2000  –  December 2000  (1 year) Norfolk, Virginia Area Taught Introduction to Engineering to freshmen students. Based on my performance I have been awarded the “teaching assistant of the year” from the ECE department Assistant Instructor (Physics Department) Cairo University 1997  –  1999  (2 years) Giza, Egypt Taught several undergraduate courses including solid-state senior laboratory, nuclear physics senior laboratory, freshman physics laboratory, statistical mechanics problems session, nuclear physics problem session, and thermodynamics problem session Assistant Instructor (Physics Department) Cairo University 1997  –  1999  (2 years) Giza, Egypt Taught several undergraduate courses including solid-state senior laboratory, nuclear physics senior laboratory, freshman physics laboratory, statistical mechanics problems session, nuclear physics problem session, and thermodynamics problem session Languages Arabic English German Arabic English German Arabic English German Skills Semiconductor... Semiconductors Plasma Etch Plasma Physics surface science Quantum Dots PVD Thin Films pulsed laser deposition thermal evaporation Silicon super heating surface characterization RHEED AFM STM SEM Vacuum Systems Vacuum Technology High Vacuum Lasers JMP Matlab SigmaPlot Six Sigma Origin Mathematica Metrology Characterization Vacuum Sensors UHV Surface Chemistry Heating Laser Pulsed Laser Deposition Optics Design of Experiments Physics SPC See 25+     See less Skills  Semiconductor... Semiconductors Plasma Etch Plasma Physics surface science Quantum Dots PVD Thin Films pulsed laser deposition thermal evaporation Silicon super heating surface characterization RHEED AFM STM SEM Vacuum Systems Vacuum Technology High Vacuum Lasers JMP Matlab SigmaPlot Six Sigma Origin Mathematica Metrology Characterization Vacuum Sensors UHV Surface Chemistry Heating Laser Pulsed Laser Deposition Optics Design of Experiments Physics SPC See 25+     See less Semiconductor... Semiconductors Plasma Etch Plasma Physics surface science Quantum Dots PVD Thin Films pulsed laser deposition thermal evaporation Silicon super heating surface characterization RHEED AFM STM SEM Vacuum Systems Vacuum Technology High Vacuum Lasers JMP Matlab SigmaPlot Six Sigma Origin Mathematica Metrology Characterization Vacuum Sensors UHV Surface Chemistry Heating Laser Pulsed Laser Deposition Optics Design of Experiments Physics SPC See 25+     See less Semiconductor... Semiconductors Plasma Etch Plasma Physics surface science Quantum Dots PVD Thin Films pulsed laser deposition thermal evaporation Silicon super heating surface characterization RHEED AFM STM SEM Vacuum Systems Vacuum Technology High Vacuum Lasers JMP Matlab SigmaPlot Six Sigma Origin Mathematica Metrology Characterization Vacuum Sensors UHV Surface Chemistry Heating Laser Pulsed Laser Deposition Optics Design of Experiments Physics SPC See 25+     See less Education Old Dominion University PhD,  Electrical Engineering (Nanotechnology and Surface Science) 2002  – 2007 Activities and Societies:  Growth dynamics of self-assembled Ge QD on Si by pulsed laser deposition (PLD) via RHEED ,  AFM and UHV STM. Control and morphology study of Ge QD by RHEED and AFM. Real-time growth dynamics of Si homoepitaxy by femtosecond PLD by RHEED. Growth dynamics and characterization of the heteroepitaxial growth of In on Si by fs PLD. Properties of In nanoparticles on graphite. Melting and solidification of In nanoparticles. Fabrication & characterization of mid-IR photo-detector based on Ge QD. Old Dominion University MSc,  Electrical Engineering (Nanotechnology and Surface Science) 2000  – 2002 Activities and Societies:  Study of Si homoepitaxy by pulsed laser deposition using RHEED and AFM Cairo University BSc,  Physics 1993  – 1997 Old Dominion University PhD,  Electrical Engineering (Nanotechnology and Surface Science) 2002  – 2007 Activities and Societies:  Growth dynamics of self-assembled Ge QD on Si by pulsed laser deposition (PLD) via RHEED ,  AFM and UHV STM. Control and morphology study of Ge QD by RHEED and AFM. Real-time growth dynamics of Si homoepitaxy by femtosecond PLD by RHEED. Growth dynamics and characterization of the heteroepitaxial growth of In on Si by fs PLD. Properties of In nanoparticles on graphite. Melting and solidification of In nanoparticles. Fabrication & characterization of mid-IR photo-detector based on Ge QD. Old Dominion University PhD,  Electrical Engineering (Nanotechnology and Surface Science) 2002  – 2007 Activities and Societies:  Growth dynamics of self-assembled Ge QD on Si by pulsed laser deposition (PLD) via RHEED ,  AFM and UHV STM. Control and morphology study of Ge QD by RHEED and AFM. Real-time growth dynamics of Si homoepitaxy by femtosecond PLD by RHEED. Growth dynamics and characterization of the heteroepitaxial growth of In on Si by fs PLD. Properties of In nanoparticles on graphite. Melting and solidification of In nanoparticles. Fabrication & characterization of mid-IR photo-detector based on Ge QD. Old Dominion University PhD,  Electrical Engineering (Nanotechnology and Surface Science) 2002  – 2007 Activities and Societies:  Growth dynamics of self-assembled Ge QD on Si by pulsed laser deposition (PLD) via RHEED ,  AFM and UHV STM. Control and morphology study of Ge QD by RHEED and AFM. Real-time growth dynamics of Si homoepitaxy by femtosecond PLD by RHEED. Growth dynamics and characterization of the heteroepitaxial growth of In on Si by fs PLD. Properties of In nanoparticles on graphite. Melting and solidification of In nanoparticles. Fabrication & characterization of mid-IR photo-detector based on Ge QD. Old Dominion University MSc,  Electrical Engineering (Nanotechnology and Surface Science) 2000  – 2002 Activities and Societies:  Study of Si homoepitaxy by pulsed laser deposition using RHEED and AFM Old Dominion University MSc,  Electrical Engineering (Nanotechnology and Surface Science) 2000  – 2002 Activities and Societies:  Study of Si homoepitaxy by pulsed laser deposition using RHEED and AFM Old Dominion University MSc,  Electrical Engineering (Nanotechnology and Surface Science) 2000  – 2002 Activities and Societies:  Study of Si homoepitaxy by pulsed laser deposition using RHEED and AFM Cairo University BSc,  Physics 1993  – 1997 Cairo University BSc,  Physics 1993  – 1997 Cairo University BSc,  Physics 1993  – 1997 Honors & Awards Logic Technology Development divisional award Intel Corporation December 2012 Logic Technology Development divisional award Intel Corporation August 2012 D1D Ramp divisional award Intel Corporation August 2010 Logic Technology Development divisional award Intel Corporation August 2008 D1D Ramp divisional award Intel Corporation November 2008 Outstanding Ph.D. Research ECE Dept., Old Dominion University June 2006 Teaching Assistant of the year ECE Dept., Old Dominion University May 2000 Supplemental Dissertation Stipend Award Old Dominion University January 2005 The Meredith Construction Company Scholarship Old Dominion University January 2004 Dominion Scholarship Old Dominion University January 2000 Highest score in Ph.D. diagnostics 97/100 ECE Dept., Old Dominion University August 2003 Logic Technology Development divisional award Intel Corporation December 2012 Logic Technology Development divisional award Intel Corporation December 2012 Logic Technology Development divisional award Intel Corporation December 2012 Logic Technology Development divisional award Intel Corporation August 2012 Logic Technology Development divisional award Intel Corporation August 2012 Logic Technology Development divisional award Intel Corporation August 2012 D1D Ramp divisional award Intel Corporation August 2010 D1D Ramp divisional award Intel Corporation August 2010 D1D Ramp divisional award Intel Corporation August 2010 Logic Technology Development divisional award Intel Corporation August 2008 Logic Technology Development divisional award Intel Corporation August 2008 Logic Technology Development divisional award Intel Corporation August 2008 D1D Ramp divisional award Intel Corporation November 2008 D1D Ramp divisional award Intel Corporation November 2008 D1D Ramp divisional award Intel Corporation November 2008 Outstanding Ph.D. Research ECE Dept., Old Dominion University June 2006 Outstanding Ph.D. Research ECE Dept., Old Dominion University June 2006 Outstanding Ph.D. Research ECE Dept., Old Dominion University June 2006 Teaching Assistant of the year ECE Dept., Old Dominion University May 2000 Teaching Assistant of the year ECE Dept., Old Dominion University May 2000 Teaching Assistant of the year ECE Dept., Old Dominion University May 2000 Supplemental Dissertation Stipend Award Old Dominion University January 2005 Supplemental Dissertation Stipend Award Old Dominion University January 2005 Supplemental Dissertation Stipend Award Old Dominion University January 2005 The Meredith Construction Company Scholarship Old Dominion University January 2004 The Meredith Construction Company Scholarship Old Dominion University January 2004 The Meredith Construction Company Scholarship Old Dominion University January 2004 Dominion Scholarship Old Dominion University January 2000 Dominion Scholarship Old Dominion University January 2000 Dominion Scholarship Old Dominion University January 2000 Highest score in Ph.D. diagnostics 97/100 ECE Dept., Old Dominion University August 2003 Highest score in Ph.D. diagnostics 97/100 ECE Dept., Old Dominion University August 2003 Highest score in Ph.D. diagnostics 97/100 ECE Dept., Old Dominion University August 2003 ", "Summary Semiconductor Manufacturing Professional with extensive process engineering experience working for a Fortune 100 company. Organized, methodical, and results-driven with expertise working in a high volume manufacturing environment focused on quality and output. Proven abilities in semiconductor process tool sustaining operations and maintenance. Key skills include: \n \n• Quality Control Management \n• Lean Manufacturing \n• Statistical Process Control & Data Analysis \n• Analytical Laboratory Techniques \n• Advanced Problem Solving \n• Failure Analysis Methods \n \n Summary Semiconductor Manufacturing Professional with extensive process engineering experience working for a Fortune 100 company. Organized, methodical, and results-driven with expertise working in a high volume manufacturing environment focused on quality and output. Proven abilities in semiconductor process tool sustaining operations and maintenance. Key skills include: \n \n• Quality Control Management \n• Lean Manufacturing \n• Statistical Process Control & Data Analysis \n• Analytical Laboratory Techniques \n• Advanced Problem Solving \n• Failure Analysis Methods \n \n Semiconductor Manufacturing Professional with extensive process engineering experience working for a Fortune 100 company. Organized, methodical, and results-driven with expertise working in a high volume manufacturing environment focused on quality and output. Proven abilities in semiconductor process tool sustaining operations and maintenance. Key skills include: \n \n• Quality Control Management \n• Lean Manufacturing \n• Statistical Process Control & Data Analysis \n• Analytical Laboratory Techniques \n• Advanced Problem Solving \n• Failure Analysis Methods \n \n Semiconductor Manufacturing Professional with extensive process engineering experience working for a Fortune 100 company. Organized, methodical, and results-driven with expertise working in a high volume manufacturing environment focused on quality and output. Proven abilities in semiconductor process tool sustaining operations and maintenance. Key skills include: \n \n• Quality Control Management \n• Lean Manufacturing \n• Statistical Process Control & Data Analysis \n• Analytical Laboratory Techniques \n• Advanced Problem Solving \n• Failure Analysis Methods \n \n Experience None In transition December 2014  – Present (9 months) Yield Group Leader Intel Corporation December 2009  –  November 2014  (5 years) Managed engineering team focused on maintaining and improving production wafer defect performance. Processing Engineering Group Leader Intel Corporation January 2000  –  December 2009  (10 years) Phoenix, Arizona Area Process and Equipment Engineer Intel Corporation May 1990  –  January 2000  (9 years 9 months) Phoenix, Arizona Area Owned all aspects of operation, maintenance and continuous improvement for thin film deposition process tools. Failure Analysis Engineer Harris Semiconductor May 1989  –  July 1989  (3 months) Melbourne, Florida Area Developed wet etch for delineating Al- Si Grain Boundaries Failure Analysis Engineer Harris Semiconductor May 1988  –  July 1988  (3 months) Melbourne, Florida Area Provided engineering assistance in the development of semiconductor processing failure analysis methods. Nuclear Power Technician US Navy June 1976  –  August 1982  (6 years 3 months) Norfolk, Virginia Area Mechanical technician including engineering laboratory and mechanical maintenance duties. \nMaintained radiological controls and secondary/primary coolant chemistry on nuclear submarine. \nPerformed routine mechanical preventative maintenance and repair on nuclear power plant systems. None In transition December 2014  – Present (9 months) None In transition December 2014  – Present (9 months) Yield Group Leader Intel Corporation December 2009  –  November 2014  (5 years) Managed engineering team focused on maintaining and improving production wafer defect performance. Yield Group Leader Intel Corporation December 2009  –  November 2014  (5 years) Managed engineering team focused on maintaining and improving production wafer defect performance. Processing Engineering Group Leader Intel Corporation January 2000  –  December 2009  (10 years) Phoenix, Arizona Area Processing Engineering Group Leader Intel Corporation January 2000  –  December 2009  (10 years) Phoenix, Arizona Area Process and Equipment Engineer Intel Corporation May 1990  –  January 2000  (9 years 9 months) Phoenix, Arizona Area Owned all aspects of operation, maintenance and continuous improvement for thin film deposition process tools. Process and Equipment Engineer Intel Corporation May 1990  –  January 2000  (9 years 9 months) Phoenix, Arizona Area Owned all aspects of operation, maintenance and continuous improvement for thin film deposition process tools. Failure Analysis Engineer Harris Semiconductor May 1989  –  July 1989  (3 months) Melbourne, Florida Area Developed wet etch for delineating Al- Si Grain Boundaries Failure Analysis Engineer Harris Semiconductor May 1989  –  July 1989  (3 months) Melbourne, Florida Area Developed wet etch for delineating Al- Si Grain Boundaries Failure Analysis Engineer Harris Semiconductor May 1988  –  July 1988  (3 months) Melbourne, Florida Area Provided engineering assistance in the development of semiconductor processing failure analysis methods. Failure Analysis Engineer Harris Semiconductor May 1988  –  July 1988  (3 months) Melbourne, Florida Area Provided engineering assistance in the development of semiconductor processing failure analysis methods. Nuclear Power Technician US Navy June 1976  –  August 1982  (6 years 3 months) Norfolk, Virginia Area Mechanical technician including engineering laboratory and mechanical maintenance duties. \nMaintained radiological controls and secondary/primary coolant chemistry on nuclear submarine. \nPerformed routine mechanical preventative maintenance and repair on nuclear power plant systems. Nuclear Power Technician US Navy June 1976  –  August 1982  (6 years 3 months) Norfolk, Virginia Area Mechanical technician including engineering laboratory and mechanical maintenance duties. \nMaintained radiological controls and secondary/primary coolant chemistry on nuclear submarine. \nPerformed routine mechanical preventative maintenance and repair on nuclear power plant systems. Skills Leadership Electronics Program Management Cross-functional Team... Engineering Management Troubleshooting Management Manufacturing Team Leadership Semiconductors Failure Analysis Engineering Preventive Maintenance Factory SPC Lean Manufacturing Process Engineering See 2+     See less Skills  Leadership Electronics Program Management Cross-functional Team... Engineering Management Troubleshooting Management Manufacturing Team Leadership Semiconductors Failure Analysis Engineering Preventive Maintenance Factory SPC Lean Manufacturing Process Engineering See 2+     See less Leadership Electronics Program Management Cross-functional Team... Engineering Management Troubleshooting Management Manufacturing Team Leadership Semiconductors Failure Analysis Engineering Preventive Maintenance Factory SPC Lean Manufacturing Process Engineering See 2+     See less Leadership Electronics Program Management Cross-functional Team... Engineering Management Troubleshooting Management Manufacturing Team Leadership Semiconductors Failure Analysis Engineering Preventive Maintenance Factory SPC Lean Manufacturing Process Engineering See 2+     See less Education University of Florida Master of Engineering (M.Eng.),  Electrical and Electronics Engineering , 3.4/4.0 1987  – 1990 Thesis: Temperature dependent physical parameters for improved bipolar transistor simulation Activities and Societies:  Member of NSPE ,  IEEE ,  American Vacuum Society and Electrochemical Society ,  Semiconductor Research Corporation University of Florida Bachelor of Arts (BA),  Materials Engineering , 3.7/4.0 1985  – 1987 Okaloosa Walton Junior College Associate of Arts (A.A.),  Engineering , 3.9/4.0 1982  – 1985 Activities and Societies:  Tennis Team University of Florida Master of Engineering (M.Eng.),  Electrical and Electronics Engineering , 3.4/4.0 1987  – 1990 Thesis: Temperature dependent physical parameters for improved bipolar transistor simulation Activities and Societies:  Member of NSPE ,  IEEE ,  American Vacuum Society and Electrochemical Society ,  Semiconductor Research Corporation University of Florida Master of Engineering (M.Eng.),  Electrical and Electronics Engineering , 3.4/4.0 1987  – 1990 Thesis: Temperature dependent physical parameters for improved bipolar transistor simulation Activities and Societies:  Member of NSPE ,  IEEE ,  American Vacuum Society and Electrochemical Society ,  Semiconductor Research Corporation University of Florida Master of Engineering (M.Eng.),  Electrical and Electronics Engineering , 3.4/4.0 1987  – 1990 Thesis: Temperature dependent physical parameters for improved bipolar transistor simulation Activities and Societies:  Member of NSPE ,  IEEE ,  American Vacuum Society and Electrochemical Society ,  Semiconductor Research Corporation University of Florida Bachelor of Arts (BA),  Materials Engineering , 3.7/4.0 1985  – 1987 University of Florida Bachelor of Arts (BA),  Materials Engineering , 3.7/4.0 1985  – 1987 University of Florida Bachelor of Arts (BA),  Materials Engineering , 3.7/4.0 1985  – 1987 Okaloosa Walton Junior College Associate of Arts (A.A.),  Engineering , 3.9/4.0 1982  – 1985 Activities and Societies:  Tennis Team Okaloosa Walton Junior College Associate of Arts (A.A.),  Engineering , 3.9/4.0 1982  – 1985 Activities and Societies:  Tennis Team Okaloosa Walton Junior College Associate of Arts (A.A.),  Engineering , 3.9/4.0 1982  – 1985 Activities and Societies:  Tennis Team ", "Experience F28 Lithography Scanners engineers Group Leader Intel Corporation March 2011  – Present (4 years 6 months) PTD/F28 Intel Corporation, Hilssboro, OR, USA / Kiryat Gat , Israel F28 P1270 Nikon Scanners Engineers, process engineers group leader. Manage between 7-16 engineers. P1270 22nm start up, ramping, maintain and sustain the Nikon fleet and the process under these tools. Process qualification, Process characterization, tool proactive maintenance, tool error response and tool problem fixing. The work include technology coaching, managing and prioritizing the multiple tasks, people allocation and set clear objectives and expectations. \nBeing technology leader in the lithography, problem solving and yield performance. FAB28 Lithography Scanners' Engineers Group Leader Intel Corporation May 2010  –  April 2011  (1 year) F28, Intel Corporation, Kiryat Gat, Israel FAB28 P1266 Nikon Scanners Engineers group leader. \nManage 10 Engineers.Nikon Scanners fleet ownership. 24 scanners on both FE and BE layers. Maintain scanners availability, stability and capacity through continues health check, problem real time fixing, proactive maintenance, error reduction and any other tool related issue or item.  \nPeople management and day to day coaching. P1266 technology CON layer owner seed process engineer, POLY process engineer Intel Corporation March 2007  –  May 2010  (3 years 3 months) PTD/F28, Intel Corporation, Hillsboro, OR, USA/ Kiryat Gat, Israel Overseas CON layer owner in Portland, Oregon. CON module process, issues and technology transfer. Sustain and maintain CON layers as seed engineer. \nP1266 technology start up, CON layer owner/P1266 technology PLY layer owner. Work included scanners layer qualification, run and characterize start up material, reticle qualification, run ramp material through NPI(new products introduction), process characterization, defect maintenance for CON layer, CD and REG performance maintain and sustain. \nDefect maintenance for PLY layer, resist qualification, Etch Bias monitoring and integrative line monitor and alert for process variation. P805 Planar STI layer owner process engineer Intel Corporation January 2006  –  March 2007  (1 year 3 months) F18, Intel Corporation, Kiryat Gat, Israel STI (silicon trench isolation) planar module owner. STI was the most sensitive layer in the P805 process and yield modulator. Work had included tight maintenance, excursion prevention, thickness control, improvements like automated control system set up, defects reduction and Virtual Factory parameters matching.  P805 flash technology development seed and process engineer Intel Corporation November 2003  –  January 2006  (2 years 3 months) D2/F18 Intel corporation, Santa Clara, CA, USA/ Kiryat Gat, Israel Seed layer owner for Metal 1 ultra critical layer in the 193 nm photolithography area.  \nHad been relocated to Intel development factory site, D2, at Santa Clara, CA for P805 flash technology. Took part of the development of Metal 1 layer including debugging Optical model, process window characterization and improvement, masks qualification and process delivery package.  \nRamped up P805 flash process at F18 including qualification of Metal 1, SMS and Contact layers on 3 different 193 nm laser lithography tools. Sustained and stabilize those layers to prepare high volume manufacturing Critical Layer process engineer in the 248nm Laser area Intel Corporation September 2002  –  November 2003  (1 year 3 months) F18 Intel Corporation Layer owner process engineer of the Contact and the Metal 1 critical layers in the Laser sensitive area. Sustain and maintain these two layers with most care to prevent excursions and stand the factory yields targets. Work includes improvement of the existing tools, critical dimensions tight control, electrical dimensions and sort functionality data review, end of line material disposition and supporting to manufacturing for in line process issues.  Critical Dimension Scanning Electron Microscope equipment/process engineer Intel Corporation July 2001  –  September 2002  (1 year 3 months) F18 Intel corporation CDSEM tool owner. Owner of 11 tool set microscopes. Responsible for Tool-to-tool variation matching, sustaining, tool maintenance and recipe creation. F28 Lithography Scanners engineers Group Leader Intel Corporation March 2011  – Present (4 years 6 months) PTD/F28 Intel Corporation, Hilssboro, OR, USA / Kiryat Gat , Israel F28 P1270 Nikon Scanners Engineers, process engineers group leader. Manage between 7-16 engineers. P1270 22nm start up, ramping, maintain and sustain the Nikon fleet and the process under these tools. Process qualification, Process characterization, tool proactive maintenance, tool error response and tool problem fixing. The work include technology coaching, managing and prioritizing the multiple tasks, people allocation and set clear objectives and expectations. \nBeing technology leader in the lithography, problem solving and yield performance. F28 Lithography Scanners engineers Group Leader Intel Corporation March 2011  – Present (4 years 6 months) PTD/F28 Intel Corporation, Hilssboro, OR, USA / Kiryat Gat , Israel F28 P1270 Nikon Scanners Engineers, process engineers group leader. Manage between 7-16 engineers. P1270 22nm start up, ramping, maintain and sustain the Nikon fleet and the process under these tools. Process qualification, Process characterization, tool proactive maintenance, tool error response and tool problem fixing. The work include technology coaching, managing and prioritizing the multiple tasks, people allocation and set clear objectives and expectations. \nBeing technology leader in the lithography, problem solving and yield performance. FAB28 Lithography Scanners' Engineers Group Leader Intel Corporation May 2010  –  April 2011  (1 year) F28, Intel Corporation, Kiryat Gat, Israel FAB28 P1266 Nikon Scanners Engineers group leader. \nManage 10 Engineers.Nikon Scanners fleet ownership. 24 scanners on both FE and BE layers. Maintain scanners availability, stability and capacity through continues health check, problem real time fixing, proactive maintenance, error reduction and any other tool related issue or item.  \nPeople management and day to day coaching. FAB28 Lithography Scanners' Engineers Group Leader Intel Corporation May 2010  –  April 2011  (1 year) F28, Intel Corporation, Kiryat Gat, Israel FAB28 P1266 Nikon Scanners Engineers group leader. \nManage 10 Engineers.Nikon Scanners fleet ownership. 24 scanners on both FE and BE layers. Maintain scanners availability, stability and capacity through continues health check, problem real time fixing, proactive maintenance, error reduction and any other tool related issue or item.  \nPeople management and day to day coaching. P1266 technology CON layer owner seed process engineer, POLY process engineer Intel Corporation March 2007  –  May 2010  (3 years 3 months) PTD/F28, Intel Corporation, Hillsboro, OR, USA/ Kiryat Gat, Israel Overseas CON layer owner in Portland, Oregon. CON module process, issues and technology transfer. Sustain and maintain CON layers as seed engineer. \nP1266 technology start up, CON layer owner/P1266 technology PLY layer owner. Work included scanners layer qualification, run and characterize start up material, reticle qualification, run ramp material through NPI(new products introduction), process characterization, defect maintenance for CON layer, CD and REG performance maintain and sustain. \nDefect maintenance for PLY layer, resist qualification, Etch Bias monitoring and integrative line monitor and alert for process variation. P1266 technology CON layer owner seed process engineer, POLY process engineer Intel Corporation March 2007  –  May 2010  (3 years 3 months) PTD/F28, Intel Corporation, Hillsboro, OR, USA/ Kiryat Gat, Israel Overseas CON layer owner in Portland, Oregon. CON module process, issues and technology transfer. Sustain and maintain CON layers as seed engineer. \nP1266 technology start up, CON layer owner/P1266 technology PLY layer owner. Work included scanners layer qualification, run and characterize start up material, reticle qualification, run ramp material through NPI(new products introduction), process characterization, defect maintenance for CON layer, CD and REG performance maintain and sustain. \nDefect maintenance for PLY layer, resist qualification, Etch Bias monitoring and integrative line monitor and alert for process variation. P805 Planar STI layer owner process engineer Intel Corporation January 2006  –  March 2007  (1 year 3 months) F18, Intel Corporation, Kiryat Gat, Israel STI (silicon trench isolation) planar module owner. STI was the most sensitive layer in the P805 process and yield modulator. Work had included tight maintenance, excursion prevention, thickness control, improvements like automated control system set up, defects reduction and Virtual Factory parameters matching.  P805 Planar STI layer owner process engineer Intel Corporation January 2006  –  March 2007  (1 year 3 months) F18, Intel Corporation, Kiryat Gat, Israel STI (silicon trench isolation) planar module owner. STI was the most sensitive layer in the P805 process and yield modulator. Work had included tight maintenance, excursion prevention, thickness control, improvements like automated control system set up, defects reduction and Virtual Factory parameters matching.  P805 flash technology development seed and process engineer Intel Corporation November 2003  –  January 2006  (2 years 3 months) D2/F18 Intel corporation, Santa Clara, CA, USA/ Kiryat Gat, Israel Seed layer owner for Metal 1 ultra critical layer in the 193 nm photolithography area.  \nHad been relocated to Intel development factory site, D2, at Santa Clara, CA for P805 flash technology. Took part of the development of Metal 1 layer including debugging Optical model, process window characterization and improvement, masks qualification and process delivery package.  \nRamped up P805 flash process at F18 including qualification of Metal 1, SMS and Contact layers on 3 different 193 nm laser lithography tools. Sustained and stabilize those layers to prepare high volume manufacturing P805 flash technology development seed and process engineer Intel Corporation November 2003  –  January 2006  (2 years 3 months) D2/F18 Intel corporation, Santa Clara, CA, USA/ Kiryat Gat, Israel Seed layer owner for Metal 1 ultra critical layer in the 193 nm photolithography area.  \nHad been relocated to Intel development factory site, D2, at Santa Clara, CA for P805 flash technology. Took part of the development of Metal 1 layer including debugging Optical model, process window characterization and improvement, masks qualification and process delivery package.  \nRamped up P805 flash process at F18 including qualification of Metal 1, SMS and Contact layers on 3 different 193 nm laser lithography tools. Sustained and stabilize those layers to prepare high volume manufacturing Critical Layer process engineer in the 248nm Laser area Intel Corporation September 2002  –  November 2003  (1 year 3 months) F18 Intel Corporation Layer owner process engineer of the Contact and the Metal 1 critical layers in the Laser sensitive area. Sustain and maintain these two layers with most care to prevent excursions and stand the factory yields targets. Work includes improvement of the existing tools, critical dimensions tight control, electrical dimensions and sort functionality data review, end of line material disposition and supporting to manufacturing for in line process issues.  Critical Layer process engineer in the 248nm Laser area Intel Corporation September 2002  –  November 2003  (1 year 3 months) F18 Intel Corporation Layer owner process engineer of the Contact and the Metal 1 critical layers in the Laser sensitive area. Sustain and maintain these two layers with most care to prevent excursions and stand the factory yields targets. Work includes improvement of the existing tools, critical dimensions tight control, electrical dimensions and sort functionality data review, end of line material disposition and supporting to manufacturing for in line process issues.  Critical Dimension Scanning Electron Microscope equipment/process engineer Intel Corporation July 2001  –  September 2002  (1 year 3 months) F18 Intel corporation CDSEM tool owner. Owner of 11 tool set microscopes. Responsible for Tool-to-tool variation matching, sustaining, tool maintenance and recipe creation. Critical Dimension Scanning Electron Microscope equipment/process engineer Intel Corporation July 2001  –  September 2002  (1 year 3 months) F18 Intel corporation CDSEM tool owner. Owner of 11 tool set microscopes. Responsible for Tool-to-tool variation matching, sustaining, tool maintenance and recipe creation. Education Ben-Gurion University of the Negev Master of Science (MSc),  Electro optics engineering 2001  – 2008 Ben-Gurion University of the Negev Bachelor of Science (BSc),  Chemical Engineering 1998  – 2001 Ben-Gurion University of the Negev Master of Science (MSc),  Electro optics engineering 2001  – 2008 Ben-Gurion University of the Negev Master of Science (MSc),  Electro optics engineering 2001  – 2008 Ben-Gurion University of the Negev Master of Science (MSc),  Electro optics engineering 2001  – 2008 Ben-Gurion University of the Negev Bachelor of Science (BSc),  Chemical Engineering 1998  – 2001 Ben-Gurion University of the Negev Bachelor of Science (BSc),  Chemical Engineering 1998  – 2001 Ben-Gurion University of the Negev Bachelor of Science (BSc),  Chemical Engineering 1998  – 2001 ", "Skills TEL Etch Group Leader Plasma Etch Etching JMP Semiconductors Design of Experiments CVD Thin Films SPC Semiconductor Industry Metrology Photolithography Process Integration Intel Process Engineering Powder X-ray Diffraction See 1+     See less Skills  TEL Etch Group Leader Plasma Etch Etching JMP Semiconductors Design of Experiments CVD Thin Films SPC Semiconductor Industry Metrology Photolithography Process Integration Intel Process Engineering Powder X-ray Diffraction See 1+     See less TEL Etch Group Leader Plasma Etch Etching JMP Semiconductors Design of Experiments CVD Thin Films SPC Semiconductor Industry Metrology Photolithography Process Integration Intel Process Engineering Powder X-ray Diffraction See 1+     See less TEL Etch Group Leader Plasma Etch Etching JMP Semiconductors Design of Experiments CVD Thin Films SPC Semiconductor Industry Metrology Photolithography Process Integration Intel Process Engineering Powder X-ray Diffraction See 1+     See less ", "Experience Shift Group Leader Intel Corporation April 2014  – Present (1 year 5 months) shift group leader Intel Corporation 2010  –  2015  (5 years) Manufacturing Technical Supervisor Intel Corporation January 2010  –  April 2014  (4 years 4 months) Shift Group Leader Intel Corporation April 2014  – Present (1 year 5 months) Shift Group Leader Intel Corporation April 2014  – Present (1 year 5 months) shift group leader Intel Corporation 2010  –  2015  (5 years) shift group leader Intel Corporation 2010  –  2015  (5 years) Manufacturing Technical Supervisor Intel Corporation January 2010  –  April 2014  (4 years 4 months) Manufacturing Technical Supervisor Intel Corporation January 2010  –  April 2014  (4 years 4 months) Skills people management Communication Skills Operations Management Semiconductors Skills  people management Communication Skills Operations Management Semiconductors people management Communication Skills Operations Management Semiconductors people management Communication Skills Operations Management Semiconductors Education Dalian University of Technology Master's degree,  Communication engineering 2007  – 2010 Dalian University of Technology Master's degree,  Communication engineering 2007  – 2010 Dalian University of Technology Master's degree,  Communication engineering 2007  – 2010 Dalian University of Technology Master's degree,  Communication engineering 2007  – 2010 ", "Skills Nuclear Military Security Clearance Engineering Management Navy Performance Management Information Assurance Weapons DoD Systems Engineering Manufacturing Leadership Command Military Experience Organizational... Reactor Top Secret Nuclear Engineering Maintenance Management Maintenance  Readiness Training Continuous Improvement Semiconductors Supervisory Skills Process Improvement Operations Management Electronics Operational Planning Program Management Lean Manufacturing Test Equipment Electronic Warfare Cross-functional Team... Preventive Maintenance Emergency Management See 21+     See less Skills  Nuclear Military Security Clearance Engineering Management Navy Performance Management Information Assurance Weapons DoD Systems Engineering Manufacturing Leadership Command Military Experience Organizational... Reactor Top Secret Nuclear Engineering Maintenance Management Maintenance  Readiness Training Continuous Improvement Semiconductors Supervisory Skills Process Improvement Operations Management Electronics Operational Planning Program Management Lean Manufacturing Test Equipment Electronic Warfare Cross-functional Team... Preventive Maintenance Emergency Management See 21+     See less Nuclear Military Security Clearance Engineering Management Navy Performance Management Information Assurance Weapons DoD Systems Engineering Manufacturing Leadership Command Military Experience Organizational... Reactor Top Secret Nuclear Engineering Maintenance Management Maintenance  Readiness Training Continuous Improvement Semiconductors Supervisory Skills Process Improvement Operations Management Electronics Operational Planning Program Management Lean Manufacturing Test Equipment Electronic Warfare Cross-functional Team... Preventive Maintenance Emergency Management See 21+     See less Nuclear Military Security Clearance Engineering Management Navy Performance Management Information Assurance Weapons DoD Systems Engineering Manufacturing Leadership Command Military Experience Organizational... Reactor Top Secret Nuclear Engineering Maintenance Management Maintenance  Readiness Training Continuous Improvement Semiconductors Supervisory Skills Process Improvement Operations Management Electronics Operational Planning Program Management Lean Manufacturing Test Equipment Electronic Warfare Cross-functional Team... Preventive Maintenance Emergency Management See 21+     See less ", "Summary I currently work at Intel Corporation as an Engineering Manager in the Yield department for high volume semiconductor manufacturing. I lead a team of data analysis and data visualization engineers working to maintain and improve yield, cost, and velocity. I also lead cross-functional teams to solve complex technical problems to deliver results for the business. We use complex data analysis, statistics, and LEAN manufacturing principles to drive continuous improvement.  \n \nI received my PhD in Chemical Engineering in 2008 from The Ohio State University. My graduate research involved the study of structure/property relations and optimization of semiconducting polymers for detection of ionizing radiation. \n \nMy strengths are in leadership, communication, mediation, collaboration, and problem solving, as demonstrated in work history. My leadership skills are shown in my steady, even-keeled nature, which allows me to effectively manage high pressure situations with large groups in cross-functional areas and get the best results.  \n \nSpecialties: People and project management, technical problem solving, multidisciplinary project development and integrated problem solving, semiconductor processing and fabrication, polymer microfabrication and processing, conjugated polymers and small molecules, nanoparticles, radiation detection, materials structure/property relations Summary I currently work at Intel Corporation as an Engineering Manager in the Yield department for high volume semiconductor manufacturing. I lead a team of data analysis and data visualization engineers working to maintain and improve yield, cost, and velocity. I also lead cross-functional teams to solve complex technical problems to deliver results for the business. We use complex data analysis, statistics, and LEAN manufacturing principles to drive continuous improvement.  \n \nI received my PhD in Chemical Engineering in 2008 from The Ohio State University. My graduate research involved the study of structure/property relations and optimization of semiconducting polymers for detection of ionizing radiation. \n \nMy strengths are in leadership, communication, mediation, collaboration, and problem solving, as demonstrated in work history. My leadership skills are shown in my steady, even-keeled nature, which allows me to effectively manage high pressure situations with large groups in cross-functional areas and get the best results.  \n \nSpecialties: People and project management, technical problem solving, multidisciplinary project development and integrated problem solving, semiconductor processing and fabrication, polymer microfabrication and processing, conjugated polymers and small molecules, nanoparticles, radiation detection, materials structure/property relations I currently work at Intel Corporation as an Engineering Manager in the Yield department for high volume semiconductor manufacturing. I lead a team of data analysis and data visualization engineers working to maintain and improve yield, cost, and velocity. I also lead cross-functional teams to solve complex technical problems to deliver results for the business. We use complex data analysis, statistics, and LEAN manufacturing principles to drive continuous improvement.  \n \nI received my PhD in Chemical Engineering in 2008 from The Ohio State University. My graduate research involved the study of structure/property relations and optimization of semiconducting polymers for detection of ionizing radiation. \n \nMy strengths are in leadership, communication, mediation, collaboration, and problem solving, as demonstrated in work history. My leadership skills are shown in my steady, even-keeled nature, which allows me to effectively manage high pressure situations with large groups in cross-functional areas and get the best results.  \n \nSpecialties: People and project management, technical problem solving, multidisciplinary project development and integrated problem solving, semiconductor processing and fabrication, polymer microfabrication and processing, conjugated polymers and small molecules, nanoparticles, radiation detection, materials structure/property relations I currently work at Intel Corporation as an Engineering Manager in the Yield department for high volume semiconductor manufacturing. I lead a team of data analysis and data visualization engineers working to maintain and improve yield, cost, and velocity. I also lead cross-functional teams to solve complex technical problems to deliver results for the business. We use complex data analysis, statistics, and LEAN manufacturing principles to drive continuous improvement.  \n \nI received my PhD in Chemical Engineering in 2008 from The Ohio State University. My graduate research involved the study of structure/property relations and optimization of semiconducting polymers for detection of ionizing radiation. \n \nMy strengths are in leadership, communication, mediation, collaboration, and problem solving, as demonstrated in work history. My leadership skills are shown in my steady, even-keeled nature, which allows me to effectively manage high pressure situations with large groups in cross-functional areas and get the best results.  \n \nSpecialties: People and project management, technical problem solving, multidisciplinary project development and integrated problem solving, semiconductor processing and fabrication, polymer microfabrication and processing, conjugated polymers and small molecules, nanoparticles, radiation detection, materials structure/property relations Experience Yield Analysis Group Leader Intel Corporation March 2015  – Present (6 months) Albuquerque, New Mexico Area Defect Reduction Group Leader Intel Corporation November 2013  –  March 2015  (1 year 5 months) Albuquerque, New Mexico Area Yield Engineer Intel April 2011  –  November 2013  (2 years 8 months) Albuquerque, New Mexico Area Process Development Engineer Intel Corporation October 2008  –  May 2011  (2 years 8 months) Portland, Oregon Area Graduate Dissertation Research Sandia National Laboratories February 2005  –  October 2008  (3 years 9 months) Summer intern Sandia National Laboratory May 2002  –  September 2002  (5 months) Summer intern Cornell University May 2001  –  August 2001  (4 months) Research Assistant University of Rhode Island October 2000  –  May 2001  (8 months) Summer intern Los Alamos Laboratory May 1999  –  August 1999  (4 months) Yield Analysis Group Leader Intel Corporation March 2015  – Present (6 months) Albuquerque, New Mexico Area Yield Analysis Group Leader Intel Corporation March 2015  – Present (6 months) Albuquerque, New Mexico Area Defect Reduction Group Leader Intel Corporation November 2013  –  March 2015  (1 year 5 months) Albuquerque, New Mexico Area Defect Reduction Group Leader Intel Corporation November 2013  –  March 2015  (1 year 5 months) Albuquerque, New Mexico Area Yield Engineer Intel April 2011  –  November 2013  (2 years 8 months) Albuquerque, New Mexico Area Yield Engineer Intel April 2011  –  November 2013  (2 years 8 months) Albuquerque, New Mexico Area Process Development Engineer Intel Corporation October 2008  –  May 2011  (2 years 8 months) Portland, Oregon Area Process Development Engineer Intel Corporation October 2008  –  May 2011  (2 years 8 months) Portland, Oregon Area Graduate Dissertation Research Sandia National Laboratories February 2005  –  October 2008  (3 years 9 months) Graduate Dissertation Research Sandia National Laboratories February 2005  –  October 2008  (3 years 9 months) Summer intern Sandia National Laboratory May 2002  –  September 2002  (5 months) Summer intern Sandia National Laboratory May 2002  –  September 2002  (5 months) Summer intern Cornell University May 2001  –  August 2001  (4 months) Summer intern Cornell University May 2001  –  August 2001  (4 months) Research Assistant University of Rhode Island October 2000  –  May 2001  (8 months) Research Assistant University of Rhode Island October 2000  –  May 2001  (8 months) Summer intern Los Alamos Laboratory May 1999  –  August 1999  (4 months) Summer intern Los Alamos Laboratory May 1999  –  August 1999  (4 months) Skills Management Team Leadership Design of Experiments Semiconductors Staff Development Collaborative Problem... Model Based Problem... Cross-functional... Data Analysis Project Management Characterization Chemical Engineering Chemistry JMP Manufacturing Polymers SQL JSL Vibration Testing Lean Manufacturing AFM Photolithography Cross-functional Team... See 8+     See less Skills  Management Team Leadership Design of Experiments Semiconductors Staff Development Collaborative Problem... Model Based Problem... Cross-functional... Data Analysis Project Management Characterization Chemical Engineering Chemistry JMP Manufacturing Polymers SQL JSL Vibration Testing Lean Manufacturing AFM Photolithography Cross-functional Team... See 8+     See less Management Team Leadership Design of Experiments Semiconductors Staff Development Collaborative Problem... Model Based Problem... Cross-functional... Data Analysis Project Management Characterization Chemical Engineering Chemistry JMP Manufacturing Polymers SQL JSL Vibration Testing Lean Manufacturing AFM Photolithography Cross-functional Team... See 8+     See less Management Team Leadership Design of Experiments Semiconductors Staff Development Collaborative Problem... Model Based Problem... Cross-functional... Data Analysis Project Management Characterization Chemical Engineering Chemistry JMP Manufacturing Polymers SQL JSL Vibration Testing Lean Manufacturing AFM Photolithography Cross-functional Team... See 8+     See less Education The Ohio State University PhD 2002  – 2008 The University of New Mexico BS 1998  – 2002 University of Rhode Island exchange 2000  – 2001 LAHS 1994  – 1998 The Ohio State University PhD 2002  – 2008 The Ohio State University PhD 2002  – 2008 The Ohio State University PhD 2002  – 2008 The University of New Mexico BS 1998  – 2002 The University of New Mexico BS 1998  – 2002 The University of New Mexico BS 1998  – 2002 University of Rhode Island exchange 2000  – 2001 University of Rhode Island exchange 2000  – 2001 University of Rhode Island exchange 2000  – 2001 LAHS 1994  – 1998 LAHS 1994  – 1998 LAHS 1994  – 1998 "]}