{"position": "Hardware Applications Engineer", "company": "Intel Corporation", "profiles": ["Experience GPU ASIC Design Engineer Nvidia Corporation February 2009  – Present (6 years 7 months) San Francisco Bay Area GPU ASIC Design Engineer Nvidia Corporation February 2009  – Present (6 years 7 months) San Francisco Bay Area GPU ASIC Design Engineer Nvidia Corporation February 2009  – Present (6 years 7 months) San Francisco Bay Area Skills Verilog Computer Architecture VLSI RTL design ASIC Functional Verification Hardware Digital Electronics Debugging Skills  Verilog Computer Architecture VLSI RTL design ASIC Functional Verification Hardware Digital Electronics Debugging Verilog Computer Architecture VLSI RTL design ASIC Functional Verification Hardware Digital Electronics Debugging Verilog Computer Architecture VLSI RTL design ASIC Functional Verification Hardware Digital Electronics Debugging Education North Carolina State University MS 2007  – 2008 North Carolina State University MS 2007  – 2008 North Carolina State University MS 2007  – 2008 North Carolina State University MS 2007  – 2008 ", "Summary I am currently emerging myself back into the technology sector after being absent for so many years. In addition to writing technical articles, I am taking courses, training and working on personal projects that will enhance my knowledge and skills. My objective is to work for a company as either a Validation Engineer, Design Engineer, FPGA Engineer, SoC Engineer, RTOS Engineer and become an expert in any of those fields. I am a self motivated and driven individual, hungry to learn new things. Summary I am currently emerging myself back into the technology sector after being absent for so many years. In addition to writing technical articles, I am taking courses, training and working on personal projects that will enhance my knowledge and skills. My objective is to work for a company as either a Validation Engineer, Design Engineer, FPGA Engineer, SoC Engineer, RTOS Engineer and become an expert in any of those fields. I am a self motivated and driven individual, hungry to learn new things. I am currently emerging myself back into the technology sector after being absent for so many years. In addition to writing technical articles, I am taking courses, training and working on personal projects that will enhance my knowledge and skills. My objective is to work for a company as either a Validation Engineer, Design Engineer, FPGA Engineer, SoC Engineer, RTOS Engineer and become an expert in any of those fields. I am a self motivated and driven individual, hungry to learn new things. I am currently emerging myself back into the technology sector after being absent for so many years. In addition to writing technical articles, I am taking courses, training and working on personal projects that will enhance my knowledge and skills. My objective is to work for a company as either a Validation Engineer, Design Engineer, FPGA Engineer, SoC Engineer, RTOS Engineer and become an expert in any of those fields. I am a self motivated and driven individual, hungry to learn new things. Experience FPGA and Hardware Engineer, Consultant DigitalSolutionsLab.com April 2015  – Present (5 months) My responsibilities include technical writing based on technology and on going hands-on projects. The technical articles are meant to be used as guides and how-tos for recent college graduates and out of work electrical/computer engineers, and gives them the tools and knowledge to either continue and/or renew their engineering training. Currently the website contains links to tools (the majority of them are free with the exception of hardware boards) needed to continue this training as well how to install and use them. All of the software tools are based on Linux (Red Hat) Operating Systems with emphasis on Open Source software. Article's topics include Altera Software (Quartus, Modelsim, QSys, etc), FPGA technology, Intel Architecture, Verilog and System Verilog, Embedded Systems, Board Design, Linux and the Yocto Project (Linux for Embedded devices). Articles based on SoC will be part of future writings and will be available as my expertise grows in that area. Owner - Fine Portrait Studio Fine Portrait Studio January 2003  –  December 2014  (12 years) Elk Grove, CA As an entrepreneur, I ran a successful portrait studio in Elk Grove California. As a photographer, it enabled me to travel the state of California meeting people from all walks of life and backgrounds. This is a position/job where communication and customer service met on a daily basis. My images enabled me to win several awards locally at the Professional Photographers of the Sacramento Valley, including Portrait Photographer of the Year 2010. Because I have always believed that education is essential for success, I studied to become a Certified Professional Photographer (CPP) and became one from 2008 to 2014. Software used to run the studio included, Adobe Photoshop and Lightroom, Apple OS X, Microsoft Windows, Microsoft Word and Excel. I also ran and setup my own website using HTML, Dreamweaver and Wordpress. The look of the website changed through the years as technology improved and it was easier to setup the Websites. If you would like to see some of the work, please visit http://FinePortraitStudio.com Hardware Applications Engineer Intel Corporation 2000  –  2003  (3 years) Supported I/O Controller Hub Family of products by providing Intel architecture platforms in desktop, mobile, and server environment with technical expertise. Assisted in creating technical solutions to complex chip set problems as brought by I/O Controller Hub customers. Meetings were setup with various engineers in which problem solving, decision making and excellent communications skills were used to communicate customer issues and solve them in a timely manner. Excellent written skills were needed in order to publish various internal and external documents to help ensure product technical information was clear and accurate. Organizational skills were needed in order to prioritize workload to be able to complete tasks in a timely manner. Excellent knowledge of Intel hardware and Intel architecture demonstrated by the creation and presentation and training of I/O Controller Hub Architectural geared towards technically instructing platform engineers on Southbridge product and technology changes. \nTop Key Accomplishments \nHub Interface Technology: Published Intel’s first Hub Interface 1.5 Specification. Worked with Design Engineering and Intel’s Strategic and Planning to ensure accurate content including new timing diagrams. During the Hub Interface technology involvement drove resolution to numerous AC timing issues.  \nE7500, E7501, 830M & 845M Platform Support: Key Enterprise contributions included SMBus technology, Hub Interface, E7500 Design Guide content creation and overall Platform Design Guide reviews, CMOS compatibility issue solutions. Key contribution for 830M and 845M included platform support, engineer training sessions, mobile design guide reviews, CMOS compatibility issue solutions and revenue mobile engineering support. FPGA and Hardware Engineer, Consultant DigitalSolutionsLab.com April 2015  – Present (5 months) My responsibilities include technical writing based on technology and on going hands-on projects. The technical articles are meant to be used as guides and how-tos for recent college graduates and out of work electrical/computer engineers, and gives them the tools and knowledge to either continue and/or renew their engineering training. Currently the website contains links to tools (the majority of them are free with the exception of hardware boards) needed to continue this training as well how to install and use them. All of the software tools are based on Linux (Red Hat) Operating Systems with emphasis on Open Source software. Article's topics include Altera Software (Quartus, Modelsim, QSys, etc), FPGA technology, Intel Architecture, Verilog and System Verilog, Embedded Systems, Board Design, Linux and the Yocto Project (Linux for Embedded devices). Articles based on SoC will be part of future writings and will be available as my expertise grows in that area. FPGA and Hardware Engineer, Consultant DigitalSolutionsLab.com April 2015  – Present (5 months) My responsibilities include technical writing based on technology and on going hands-on projects. The technical articles are meant to be used as guides and how-tos for recent college graduates and out of work electrical/computer engineers, and gives them the tools and knowledge to either continue and/or renew their engineering training. Currently the website contains links to tools (the majority of them are free with the exception of hardware boards) needed to continue this training as well how to install and use them. All of the software tools are based on Linux (Red Hat) Operating Systems with emphasis on Open Source software. Article's topics include Altera Software (Quartus, Modelsim, QSys, etc), FPGA technology, Intel Architecture, Verilog and System Verilog, Embedded Systems, Board Design, Linux and the Yocto Project (Linux for Embedded devices). Articles based on SoC will be part of future writings and will be available as my expertise grows in that area. Owner - Fine Portrait Studio Fine Portrait Studio January 2003  –  December 2014  (12 years) Elk Grove, CA As an entrepreneur, I ran a successful portrait studio in Elk Grove California. As a photographer, it enabled me to travel the state of California meeting people from all walks of life and backgrounds. This is a position/job where communication and customer service met on a daily basis. My images enabled me to win several awards locally at the Professional Photographers of the Sacramento Valley, including Portrait Photographer of the Year 2010. Because I have always believed that education is essential for success, I studied to become a Certified Professional Photographer (CPP) and became one from 2008 to 2014. Software used to run the studio included, Adobe Photoshop and Lightroom, Apple OS X, Microsoft Windows, Microsoft Word and Excel. I also ran and setup my own website using HTML, Dreamweaver and Wordpress. The look of the website changed through the years as technology improved and it was easier to setup the Websites. If you would like to see some of the work, please visit http://FinePortraitStudio.com Owner - Fine Portrait Studio Fine Portrait Studio January 2003  –  December 2014  (12 years) Elk Grove, CA As an entrepreneur, I ran a successful portrait studio in Elk Grove California. As a photographer, it enabled me to travel the state of California meeting people from all walks of life and backgrounds. This is a position/job where communication and customer service met on a daily basis. My images enabled me to win several awards locally at the Professional Photographers of the Sacramento Valley, including Portrait Photographer of the Year 2010. Because I have always believed that education is essential for success, I studied to become a Certified Professional Photographer (CPP) and became one from 2008 to 2014. Software used to run the studio included, Adobe Photoshop and Lightroom, Apple OS X, Microsoft Windows, Microsoft Word and Excel. I also ran and setup my own website using HTML, Dreamweaver and Wordpress. The look of the website changed through the years as technology improved and it was easier to setup the Websites. If you would like to see some of the work, please visit http://FinePortraitStudio.com Hardware Applications Engineer Intel Corporation 2000  –  2003  (3 years) Supported I/O Controller Hub Family of products by providing Intel architecture platforms in desktop, mobile, and server environment with technical expertise. Assisted in creating technical solutions to complex chip set problems as brought by I/O Controller Hub customers. Meetings were setup with various engineers in which problem solving, decision making and excellent communications skills were used to communicate customer issues and solve them in a timely manner. Excellent written skills were needed in order to publish various internal and external documents to help ensure product technical information was clear and accurate. Organizational skills were needed in order to prioritize workload to be able to complete tasks in a timely manner. Excellent knowledge of Intel hardware and Intel architecture demonstrated by the creation and presentation and training of I/O Controller Hub Architectural geared towards technically instructing platform engineers on Southbridge product and technology changes. \nTop Key Accomplishments \nHub Interface Technology: Published Intel’s first Hub Interface 1.5 Specification. Worked with Design Engineering and Intel’s Strategic and Planning to ensure accurate content including new timing diagrams. During the Hub Interface technology involvement drove resolution to numerous AC timing issues.  \nE7500, E7501, 830M & 845M Platform Support: Key Enterprise contributions included SMBus technology, Hub Interface, E7500 Design Guide content creation and overall Platform Design Guide reviews, CMOS compatibility issue solutions. Key contribution for 830M and 845M included platform support, engineer training sessions, mobile design guide reviews, CMOS compatibility issue solutions and revenue mobile engineering support. Hardware Applications Engineer Intel Corporation 2000  –  2003  (3 years) Supported I/O Controller Hub Family of products by providing Intel architecture platforms in desktop, mobile, and server environment with technical expertise. Assisted in creating technical solutions to complex chip set problems as brought by I/O Controller Hub customers. Meetings were setup with various engineers in which problem solving, decision making and excellent communications skills were used to communicate customer issues and solve them in a timely manner. Excellent written skills were needed in order to publish various internal and external documents to help ensure product technical information was clear and accurate. Organizational skills were needed in order to prioritize workload to be able to complete tasks in a timely manner. Excellent knowledge of Intel hardware and Intel architecture demonstrated by the creation and presentation and training of I/O Controller Hub Architectural geared towards technically instructing platform engineers on Southbridge product and technology changes. \nTop Key Accomplishments \nHub Interface Technology: Published Intel’s first Hub Interface 1.5 Specification. Worked with Design Engineering and Intel’s Strategic and Planning to ensure accurate content including new timing diagrams. During the Hub Interface technology involvement drove resolution to numerous AC timing issues.  \nE7500, E7501, 830M & 845M Platform Support: Key Enterprise contributions included SMBus technology, Hub Interface, E7500 Design Guide content creation and overall Platform Design Guide reviews, CMOS compatibility issue solutions. Key contribution for 830M and 845M included platform support, engineer training sessions, mobile design guide reviews, CMOS compatibility issue solutions and revenue mobile engineering support. Languages English Full professional proficiency Spanish Full professional proficiency English Full professional proficiency Spanish Full professional proficiency English Full professional proficiency Spanish Full professional proficiency Full professional proficiency Full professional proficiency Skills Computer Architecture Embedded Systems Verilog VHDL C Microprocessors SystemVerilog Oracle Enterprise Linux Red Hat Linux Embedded C ARM Linux Altera Quartus Skills  Computer Architecture Embedded Systems Verilog VHDL C Microprocessors SystemVerilog Oracle Enterprise Linux Red Hat Linux Embedded C ARM Linux Altera Quartus Computer Architecture Embedded Systems Verilog VHDL C Microprocessors SystemVerilog Oracle Enterprise Linux Red Hat Linux Embedded C ARM Linux Altera Quartus Computer Architecture Embedded Systems Verilog VHDL C Microprocessors SystemVerilog Oracle Enterprise Linux Red Hat Linux Embedded C ARM Linux Altera Quartus Education California State University-Sacramento Master's degree,  Computer Engineering , GPA: 3.6 2008  – 2010 Graduated with a 3.6 Grade Point Average (GPA) despite my busy schedule. It was a difficult task, but I gave it my best and I believe I accomplished my goals with a high degree of achievement. Activities and Societies:  Tau Beta Pi ,  The Engineering Honor Society\nMESA ,  Math Engineering Science Achievement Program\nMEP ,  Minority Engineering Program California State University-Sacramento Bachelor’s Degree,  Computer Engineering , GPA: 3.25 1997  – 2000 Graduated with a 3.25 Grade Point Average (GPA). I made it my goal to take additional courses to specialize in Digital Design and Verilog. In addition, I volunteered as a Digital Design tutor for MESA/MEP (Math, Engineering, Science Achievement Program/Minority Engineering Program) students taking \"Introduction to Logic Design\" and \"Advance Logic Design\". Because I was a 4.0 student on both of those classes, it gave me the ability to not only be a tutor, but also a mentor for upcoming students. In my Junior year, I was invited to the Engineering Honor Society (Tau Beta Pi) where I offered my services whenever there was a need. Activities and Societies:  Tau Beta Pi ,  The Engineering Honor Society California State University-Sacramento Master's degree,  Computer Engineering , GPA: 3.6 2008  – 2010 Graduated with a 3.6 Grade Point Average (GPA) despite my busy schedule. It was a difficult task, but I gave it my best and I believe I accomplished my goals with a high degree of achievement. Activities and Societies:  Tau Beta Pi ,  The Engineering Honor Society\nMESA ,  Math Engineering Science Achievement Program\nMEP ,  Minority Engineering Program California State University-Sacramento Master's degree,  Computer Engineering , GPA: 3.6 2008  – 2010 Graduated with a 3.6 Grade Point Average (GPA) despite my busy schedule. It was a difficult task, but I gave it my best and I believe I accomplished my goals with a high degree of achievement. Activities and Societies:  Tau Beta Pi ,  The Engineering Honor Society\nMESA ,  Math Engineering Science Achievement Program\nMEP ,  Minority Engineering Program California State University-Sacramento Master's degree,  Computer Engineering , GPA: 3.6 2008  – 2010 Graduated with a 3.6 Grade Point Average (GPA) despite my busy schedule. It was a difficult task, but I gave it my best and I believe I accomplished my goals with a high degree of achievement. Activities and Societies:  Tau Beta Pi ,  The Engineering Honor Society\nMESA ,  Math Engineering Science Achievement Program\nMEP ,  Minority Engineering Program California State University-Sacramento Bachelor’s Degree,  Computer Engineering , GPA: 3.25 1997  – 2000 Graduated with a 3.25 Grade Point Average (GPA). I made it my goal to take additional courses to specialize in Digital Design and Verilog. In addition, I volunteered as a Digital Design tutor for MESA/MEP (Math, Engineering, Science Achievement Program/Minority Engineering Program) students taking \"Introduction to Logic Design\" and \"Advance Logic Design\". Because I was a 4.0 student on both of those classes, it gave me the ability to not only be a tutor, but also a mentor for upcoming students. In my Junior year, I was invited to the Engineering Honor Society (Tau Beta Pi) where I offered my services whenever there was a need. Activities and Societies:  Tau Beta Pi ,  The Engineering Honor Society California State University-Sacramento Bachelor’s Degree,  Computer Engineering , GPA: 3.25 1997  – 2000 Graduated with a 3.25 Grade Point Average (GPA). I made it my goal to take additional courses to specialize in Digital Design and Verilog. In addition, I volunteered as a Digital Design tutor for MESA/MEP (Math, Engineering, Science Achievement Program/Minority Engineering Program) students taking \"Introduction to Logic Design\" and \"Advance Logic Design\". Because I was a 4.0 student on both of those classes, it gave me the ability to not only be a tutor, but also a mentor for upcoming students. In my Junior year, I was invited to the Engineering Honor Society (Tau Beta Pi) where I offered my services whenever there was a need. Activities and Societies:  Tau Beta Pi ,  The Engineering Honor Society California State University-Sacramento Bachelor’s Degree,  Computer Engineering , GPA: 3.25 1997  – 2000 Graduated with a 3.25 Grade Point Average (GPA). I made it my goal to take additional courses to specialize in Digital Design and Verilog. In addition, I volunteered as a Digital Design tutor for MESA/MEP (Math, Engineering, Science Achievement Program/Minority Engineering Program) students taking \"Introduction to Logic Design\" and \"Advance Logic Design\". Because I was a 4.0 student on both of those classes, it gave me the ability to not only be a tutor, but also a mentor for upcoming students. In my Junior year, I was invited to the Engineering Honor Society (Tau Beta Pi) where I offered my services whenever there was a need. Activities and Societies:  Tau Beta Pi ,  The Engineering Honor Society ", "Experience Field Applications Engineer Intel Americas, Inc September 2013  – Present (2 years) Houston Area, Texas PCH Hardware Execution Team Manager Intel Corporation August 2010  – Present (5 years 1 month) Folsom, California Network and Systems Engineer Western Title & Escrow September 2006  –  October 2010  (4 years 2 months) Manage and maintain Enterprise Wired and Wireless network, IP and PBX phone systems. Manage server farms/clusters, Active Directory and other Windows and Linux servers.  \n \nHost. manage and develop company Intranet/Internet using PHP, Perl, Javascript and ASP.Net. \n \nMaintain and manage firewalls, VPN conentrators, Intrusion Protection Systems and all that jazz. Hardware Applications Engineer Intel Corporation June 1999  –  February 2006  (6 years 9 months) Developed technical documents such as Engineering Design Specifications, Design Guides and Datasheets supporting Intel's I/O Controller Hub. \nWorked directly with Multi-National customers such as Dell, IBM/Lenovo and HP on schematic reviews, motherboard layout design and debug and test using industry and proprietary Intel tools such as the In-Target Probe (ITP). \nWorked with the different disciplines of engineering (design/simulation/thermals) to resolve issues and remove roadblocks for time to market launches. \nRepresented Intel at I/O Compliance\\Interoperability Workshops for USB and PCI Express. Field Applications Engineer Intel Americas, Inc September 2013  – Present (2 years) Houston Area, Texas Field Applications Engineer Intel Americas, Inc September 2013  – Present (2 years) Houston Area, Texas PCH Hardware Execution Team Manager Intel Corporation August 2010  – Present (5 years 1 month) Folsom, California PCH Hardware Execution Team Manager Intel Corporation August 2010  – Present (5 years 1 month) Folsom, California Network and Systems Engineer Western Title & Escrow September 2006  –  October 2010  (4 years 2 months) Manage and maintain Enterprise Wired and Wireless network, IP and PBX phone systems. Manage server farms/clusters, Active Directory and other Windows and Linux servers.  \n \nHost. manage and develop company Intranet/Internet using PHP, Perl, Javascript and ASP.Net. \n \nMaintain and manage firewalls, VPN conentrators, Intrusion Protection Systems and all that jazz. Network and Systems Engineer Western Title & Escrow September 2006  –  October 2010  (4 years 2 months) Manage and maintain Enterprise Wired and Wireless network, IP and PBX phone systems. Manage server farms/clusters, Active Directory and other Windows and Linux servers.  \n \nHost. manage and develop company Intranet/Internet using PHP, Perl, Javascript and ASP.Net. \n \nMaintain and manage firewalls, VPN conentrators, Intrusion Protection Systems and all that jazz. Hardware Applications Engineer Intel Corporation June 1999  –  February 2006  (6 years 9 months) Developed technical documents such as Engineering Design Specifications, Design Guides and Datasheets supporting Intel's I/O Controller Hub. \nWorked directly with Multi-National customers such as Dell, IBM/Lenovo and HP on schematic reviews, motherboard layout design and debug and test using industry and proprietary Intel tools such as the In-Target Probe (ITP). \nWorked with the different disciplines of engineering (design/simulation/thermals) to resolve issues and remove roadblocks for time to market launches. \nRepresented Intel at I/O Compliance\\Interoperability Workshops for USB and PCI Express. Hardware Applications Engineer Intel Corporation June 1999  –  February 2006  (6 years 9 months) Developed technical documents such as Engineering Design Specifications, Design Guides and Datasheets supporting Intel's I/O Controller Hub. \nWorked directly with Multi-National customers such as Dell, IBM/Lenovo and HP on schematic reviews, motherboard layout design and debug and test using industry and proprietary Intel tools such as the In-Target Probe (ITP). \nWorked with the different disciplines of engineering (design/simulation/thermals) to resolve issues and remove roadblocks for time to market launches. \nRepresented Intel at I/O Compliance\\Interoperability Workshops for USB and PCI Express. Skills Hardware Unix Skills  Hardware Unix Hardware Unix Hardware Unix Education California State University-Sacramento BS Electrical Engineering,  Physics ,  Computer Science ,  Electronics 1995  – 2000 California State University-Sacramento BS Electrical Engineering,  Physics ,  Computer Science ,  Electronics 1995  – 2000 California State University-Sacramento BS Electrical Engineering,  Physics ,  Computer Science ,  Electronics 1995  – 2000 California State University-Sacramento BS Electrical Engineering,  Physics ,  Computer Science ,  Electronics 1995  – 2000 ", "Experience Hardware Applications Engineer Intel Corporation September 2010  – Present (5 years) Specialist/Senior Hardware Engineer ASUS December 2004  –  August 2010  (5 years 9 months) Hardware Applications Engineer Intel Corporation September 2010  – Present (5 years) Hardware Applications Engineer Intel Corporation September 2010  – Present (5 years) Specialist/Senior Hardware Engineer ASUS December 2004  –  August 2010  (5 years 9 months) Specialist/Senior Hardware Engineer ASUS December 2004  –  August 2010  (5 years 9 months) Skills Power Electronics Electrical Engineering Microsoft Office Skills  Power Electronics Electrical Engineering Microsoft Office Power Electronics Electrical Engineering Microsoft Office Power Electronics Electrical Engineering Microsoft Office Education National Cheng Kung University Master's degree,  Electrical and Electronics Engineering National Cheng Kung University Master's degree,  Electrical and Electronics Engineering National Cheng Kung University Master's degree,  Electrical and Electronics Engineering National Cheng Kung University Master's degree,  Electrical and Electronics Engineering ", "Experience Technical Marketing Engineer Intel Corporation January 2015  – Present (8 months) San Francisco Bay Area As a Technical Marketing Engineer I am responsible for:  \n-Advocating for customers' needs in internal meetings  \n-Managing customer and partner technical communications, training, and component and system-level issue triage  \n-Working with internal engineering and validation groups, as well as external groups, where applicable, to establish common expectations  \n-Create high-quality,scalable collateral that supports design-in and integration of Intel silicon, components, and/or software  \n- To drive products to launch and ramp in customer systems by supporting customer's design-in efforts, schematic and board reviews, delivery of technical collateral and post-silicon customers qualification cycle. Hardware Applications Engineer Intel Corporation August 2011  –  December 2014  (3 years 5 months) United States Working as a Lead Silicon Applications Engineer in providing hardware support on 1Gb/10Gb Ethernet implementation in SoCs and building platforms for Data Center applications that includes uServer, Comms and Storage products.  \n \nProviding hands-on hardware board bring-up, issue debug support on customer reference boards along with creating and delivering collateral material (schematics, datasheets, checklists, reference guides, App notes) for the 1Gb/2.5Gb/10Gb Ethernet Network controllers. \n \n Successfully enabling and providing full support to Data center customers to launch their platforms and deliver robust solutions with minimal board spins and resource engagement. \n \n Working hands-on in resolving hardware customer issues on their products covering: server, micro-server, cloud, comms, storage, embedded market. Have provided and continuing the support on testing and validation support on IEEE 802.3 standard, SFF 8431, Manageability spec: DMTF NCSI spec, I2C Bus specification, SMBUS, Cisco Serial-GMII spec (SGMII). \n \n Worked on High Speed SerDes: \n- 10Gbps high-speed SerDes operation \n- PMD/PMA/PCS operation and architecture \n- 10GBASE-KR, SFI, XFI link protocols \n- Hands on Ethernet MAC, PHY and SerDes experience on discrete Intel Ethernet products and SoCs \n- Board bring-up, Board design and layout for high speed SerDes \n- High-speed signal integrity experience Graduate Technical Intern Intel Corporation May 2010  –  May 2011  (1 year 1 month) United States Projects involved \n Developed LabVIEW drivers for the NG100 device, which include integration and execution of the program for Alien Cross-talk noise rejection test required for 10GBASE-T testing \n Responsible for working with Tektronix and Agilent equipments to resolve correlation issues in 10Gb IEEE test results \n Performed Validation of Direct Attach cable assembly specification analysis from 8port S-parameters and documentation of the ongoing correlation study of SFP+ simulations with lab measurements Technical Marketing Engineer Intel Corporation January 2015  – Present (8 months) San Francisco Bay Area As a Technical Marketing Engineer I am responsible for:  \n-Advocating for customers' needs in internal meetings  \n-Managing customer and partner technical communications, training, and component and system-level issue triage  \n-Working with internal engineering and validation groups, as well as external groups, where applicable, to establish common expectations  \n-Create high-quality,scalable collateral that supports design-in and integration of Intel silicon, components, and/or software  \n- To drive products to launch and ramp in customer systems by supporting customer's design-in efforts, schematic and board reviews, delivery of technical collateral and post-silicon customers qualification cycle. Technical Marketing Engineer Intel Corporation January 2015  – Present (8 months) San Francisco Bay Area As a Technical Marketing Engineer I am responsible for:  \n-Advocating for customers' needs in internal meetings  \n-Managing customer and partner technical communications, training, and component and system-level issue triage  \n-Working with internal engineering and validation groups, as well as external groups, where applicable, to establish common expectations  \n-Create high-quality,scalable collateral that supports design-in and integration of Intel silicon, components, and/or software  \n- To drive products to launch and ramp in customer systems by supporting customer's design-in efforts, schematic and board reviews, delivery of technical collateral and post-silicon customers qualification cycle. Hardware Applications Engineer Intel Corporation August 2011  –  December 2014  (3 years 5 months) United States Working as a Lead Silicon Applications Engineer in providing hardware support on 1Gb/10Gb Ethernet implementation in SoCs and building platforms for Data Center applications that includes uServer, Comms and Storage products.  \n \nProviding hands-on hardware board bring-up, issue debug support on customer reference boards along with creating and delivering collateral material (schematics, datasheets, checklists, reference guides, App notes) for the 1Gb/2.5Gb/10Gb Ethernet Network controllers. \n \n Successfully enabling and providing full support to Data center customers to launch their platforms and deliver robust solutions with minimal board spins and resource engagement. \n \n Working hands-on in resolving hardware customer issues on their products covering: server, micro-server, cloud, comms, storage, embedded market. Have provided and continuing the support on testing and validation support on IEEE 802.3 standard, SFF 8431, Manageability spec: DMTF NCSI spec, I2C Bus specification, SMBUS, Cisco Serial-GMII spec (SGMII). \n \n Worked on High Speed SerDes: \n- 10Gbps high-speed SerDes operation \n- PMD/PMA/PCS operation and architecture \n- 10GBASE-KR, SFI, XFI link protocols \n- Hands on Ethernet MAC, PHY and SerDes experience on discrete Intel Ethernet products and SoCs \n- Board bring-up, Board design and layout for high speed SerDes \n- High-speed signal integrity experience Hardware Applications Engineer Intel Corporation August 2011  –  December 2014  (3 years 5 months) United States Working as a Lead Silicon Applications Engineer in providing hardware support on 1Gb/10Gb Ethernet implementation in SoCs and building platforms for Data Center applications that includes uServer, Comms and Storage products.  \n \nProviding hands-on hardware board bring-up, issue debug support on customer reference boards along with creating and delivering collateral material (schematics, datasheets, checklists, reference guides, App notes) for the 1Gb/2.5Gb/10Gb Ethernet Network controllers. \n \n Successfully enabling and providing full support to Data center customers to launch their platforms and deliver robust solutions with minimal board spins and resource engagement. \n \n Working hands-on in resolving hardware customer issues on their products covering: server, micro-server, cloud, comms, storage, embedded market. Have provided and continuing the support on testing and validation support on IEEE 802.3 standard, SFF 8431, Manageability spec: DMTF NCSI spec, I2C Bus specification, SMBUS, Cisco Serial-GMII spec (SGMII). \n \n Worked on High Speed SerDes: \n- 10Gbps high-speed SerDes operation \n- PMD/PMA/PCS operation and architecture \n- 10GBASE-KR, SFI, XFI link protocols \n- Hands on Ethernet MAC, PHY and SerDes experience on discrete Intel Ethernet products and SoCs \n- Board bring-up, Board design and layout for high speed SerDes \n- High-speed signal integrity experience Graduate Technical Intern Intel Corporation May 2010  –  May 2011  (1 year 1 month) United States Projects involved \n Developed LabVIEW drivers for the NG100 device, which include integration and execution of the program for Alien Cross-talk noise rejection test required for 10GBASE-T testing \n Responsible for working with Tektronix and Agilent equipments to resolve correlation issues in 10Gb IEEE test results \n Performed Validation of Direct Attach cable assembly specification analysis from 8port S-parameters and documentation of the ongoing correlation study of SFP+ simulations with lab measurements Graduate Technical Intern Intel Corporation May 2010  –  May 2011  (1 year 1 month) United States Projects involved \n Developed LabVIEW drivers for the NG100 device, which include integration and execution of the program for Alien Cross-talk noise rejection test required for 10GBASE-T testing \n Responsible for working with Tektronix and Agilent equipments to resolve correlation issues in 10Gb IEEE test results \n Performed Validation of Direct Attach cable assembly specification analysis from 8port S-parameters and documentation of the ongoing correlation study of SFP+ simulations with lab measurements Languages English Full professional proficiency Marathi Native or bilingual proficiency Hindi Native or bilingual proficiency English Full professional proficiency Marathi Native or bilingual proficiency Hindi Native or bilingual proficiency English Full professional proficiency Marathi Native or bilingual proficiency Hindi Native or bilingual proficiency Full professional proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Debugging Cadence Virtuoso Semiconductors Embedded Systems SoC Pspice Matlab Perl Embedded Software Cadence Technical Presentations Design Review 10G Ethernet NI LabVIEW IEEE 802.3 Technical Documentation ASIC See 2+     See less Skills  Debugging Cadence Virtuoso Semiconductors Embedded Systems SoC Pspice Matlab Perl Embedded Software Cadence Technical Presentations Design Review 10G Ethernet NI LabVIEW IEEE 802.3 Technical Documentation ASIC See 2+     See less Debugging Cadence Virtuoso Semiconductors Embedded Systems SoC Pspice Matlab Perl Embedded Software Cadence Technical Presentations Design Review 10G Ethernet NI LabVIEW IEEE 802.3 Technical Documentation ASIC See 2+     See less Debugging Cadence Virtuoso Semiconductors Embedded Systems SoC Pspice Matlab Perl Embedded Software Cadence Technical Presentations Design Review 10G Ethernet NI LabVIEW IEEE 802.3 Technical Documentation ASIC See 2+     See less Education Texas Tech University Master of Science (MS),  Electrical Engineering , 4.0/4.0 2009  – 2011 Recipient of Electrical Engineering Department Scholarship from Texas Tech University \n \nAcademic Projects \n Mixed signal testing of ADC  \nThe project involved testing of ADC TLC0820AC for the given specifications. The test is performed on VLCT and LabVIEW with thorough data analysis \n Design and Layout of Operational Amplifier  \nUsed CADENCE as a design tool for design and layout of Op-Amp for the given specification of gain, total current consumption and phase margin within a desired temperature range \n Design and simulation of bi-directional BUCK-BOOST converter  \nDesigned a bi-directional BUCK-BOOST for given specifications in PSPICE and obtained the simulation results of voltage, current and power \n Testing of SN74HC153 IC \nPerformed testing of Multiplexer IC against the specifications using VLCT and verified with bench test results Rajiv Gandhi Prodyogiki Vishwavidyalaya Bachelor of Engineering (BE),  Electrical , Electronics and Communications Engineering , 3.7/4.0 2005  – 2009 Academic Project(s) \n Fingerprint Detector and Matcher  \nUsed the concept of Image sensing technique for finger print detection using MATLAB. The project has enhanced use in the field of Security Systems and Detection techniques St Raphael's High Secondary School Texas Tech University Master of Science (MS),  Electrical Engineering , 4.0/4.0 2009  – 2011 Recipient of Electrical Engineering Department Scholarship from Texas Tech University \n \nAcademic Projects \n Mixed signal testing of ADC  \nThe project involved testing of ADC TLC0820AC for the given specifications. The test is performed on VLCT and LabVIEW with thorough data analysis \n Design and Layout of Operational Amplifier  \nUsed CADENCE as a design tool for design and layout of Op-Amp for the given specification of gain, total current consumption and phase margin within a desired temperature range \n Design and simulation of bi-directional BUCK-BOOST converter  \nDesigned a bi-directional BUCK-BOOST for given specifications in PSPICE and obtained the simulation results of voltage, current and power \n Testing of SN74HC153 IC \nPerformed testing of Multiplexer IC against the specifications using VLCT and verified with bench test results Texas Tech University Master of Science (MS),  Electrical Engineering , 4.0/4.0 2009  – 2011 Recipient of Electrical Engineering Department Scholarship from Texas Tech University \n \nAcademic Projects \n Mixed signal testing of ADC  \nThe project involved testing of ADC TLC0820AC for the given specifications. The test is performed on VLCT and LabVIEW with thorough data analysis \n Design and Layout of Operational Amplifier  \nUsed CADENCE as a design tool for design and layout of Op-Amp for the given specification of gain, total current consumption and phase margin within a desired temperature range \n Design and simulation of bi-directional BUCK-BOOST converter  \nDesigned a bi-directional BUCK-BOOST for given specifications in PSPICE and obtained the simulation results of voltage, current and power \n Testing of SN74HC153 IC \nPerformed testing of Multiplexer IC against the specifications using VLCT and verified with bench test results Texas Tech University Master of Science (MS),  Electrical Engineering , 4.0/4.0 2009  – 2011 Recipient of Electrical Engineering Department Scholarship from Texas Tech University \n \nAcademic Projects \n Mixed signal testing of ADC  \nThe project involved testing of ADC TLC0820AC for the given specifications. The test is performed on VLCT and LabVIEW with thorough data analysis \n Design and Layout of Operational Amplifier  \nUsed CADENCE as a design tool for design and layout of Op-Amp for the given specification of gain, total current consumption and phase margin within a desired temperature range \n Design and simulation of bi-directional BUCK-BOOST converter  \nDesigned a bi-directional BUCK-BOOST for given specifications in PSPICE and obtained the simulation results of voltage, current and power \n Testing of SN74HC153 IC \nPerformed testing of Multiplexer IC against the specifications using VLCT and verified with bench test results Rajiv Gandhi Prodyogiki Vishwavidyalaya Bachelor of Engineering (BE),  Electrical , Electronics and Communications Engineering , 3.7/4.0 2005  – 2009 Academic Project(s) \n Fingerprint Detector and Matcher  \nUsed the concept of Image sensing technique for finger print detection using MATLAB. The project has enhanced use in the field of Security Systems and Detection techniques Rajiv Gandhi Prodyogiki Vishwavidyalaya Bachelor of Engineering (BE),  Electrical , Electronics and Communications Engineering , 3.7/4.0 2005  – 2009 Academic Project(s) \n Fingerprint Detector and Matcher  \nUsed the concept of Image sensing technique for finger print detection using MATLAB. The project has enhanced use in the field of Security Systems and Detection techniques Rajiv Gandhi Prodyogiki Vishwavidyalaya Bachelor of Engineering (BE),  Electrical , Electronics and Communications Engineering , 3.7/4.0 2005  – 2009 Academic Project(s) \n Fingerprint Detector and Matcher  \nUsed the concept of Image sensing technique for finger print detection using MATLAB. The project has enhanced use in the field of Security Systems and Detection techniques St Raphael's High Secondary School St Raphael's High Secondary School St Raphael's High Secondary School Honors & Awards Recipient of Electrical Engineering Department Scholarship from Texas Tech University Electrical Engineering Department August 2009 In addition to the scholarship, received a 50% Tuition waiver Awarded with the “Certificate of Merit” for Classical Singing at National level exam in India Have been a trained Hindustani Classical singer for about 15 yrs Direct Attach Cable Assembly Specification Analysis from 8 Port S-parameters Department of Electrical Engineering July 2011 Master of Science Thesis Topic Recipient of Electrical Engineering Department Scholarship from Texas Tech University Electrical Engineering Department August 2009 In addition to the scholarship, received a 50% Tuition waiver Recipient of Electrical Engineering Department Scholarship from Texas Tech University Electrical Engineering Department August 2009 In addition to the scholarship, received a 50% Tuition waiver Recipient of Electrical Engineering Department Scholarship from Texas Tech University Electrical Engineering Department August 2009 In addition to the scholarship, received a 50% Tuition waiver Awarded with the “Certificate of Merit” for Classical Singing at National level exam in India Have been a trained Hindustani Classical singer for about 15 yrs Awarded with the “Certificate of Merit” for Classical Singing at National level exam in India Have been a trained Hindustani Classical singer for about 15 yrs Awarded with the “Certificate of Merit” for Classical Singing at National level exam in India Have been a trained Hindustani Classical singer for about 15 yrs Direct Attach Cable Assembly Specification Analysis from 8 Port S-parameters Department of Electrical Engineering July 2011 Master of Science Thesis Topic Direct Attach Cable Assembly Specification Analysis from 8 Port S-parameters Department of Electrical Engineering July 2011 Master of Science Thesis Topic Direct Attach Cable Assembly Specification Analysis from 8 Port S-parameters Department of Electrical Engineering July 2011 Master of Science Thesis Topic ", "Summary Sr. Electrical Engineer with extensive experience in high-speed wide-band digital design, analysis, and test. Employed ten years in hardware design specializing in both FPGA and board-level design; five years in software design; and five years in management. Experienced in all phases of program/product life cycle from planning to production to post-delivery support. Certified Information Systems Security Professional (CISSP) trained in mil-specs, cryptography, security, and high reliability. Proven track record in leading design teams. Summary Sr. Electrical Engineer with extensive experience in high-speed wide-band digital design, analysis, and test. Employed ten years in hardware design specializing in both FPGA and board-level design; five years in software design; and five years in management. Experienced in all phases of program/product life cycle from planning to production to post-delivery support. Certified Information Systems Security Professional (CISSP) trained in mil-specs, cryptography, security, and high reliability. Proven track record in leading design teams. Sr. Electrical Engineer with extensive experience in high-speed wide-band digital design, analysis, and test. Employed ten years in hardware design specializing in both FPGA and board-level design; five years in software design; and five years in management. Experienced in all phases of program/product life cycle from planning to production to post-delivery support. Certified Information Systems Security Professional (CISSP) trained in mil-specs, cryptography, security, and high reliability. Proven track record in leading design teams. Sr. Electrical Engineer with extensive experience in high-speed wide-band digital design, analysis, and test. Employed ten years in hardware design specializing in both FPGA and board-level design; five years in software design; and five years in management. Experienced in all phases of program/product life cycle from planning to production to post-delivery support. Certified Information Systems Security Professional (CISSP) trained in mil-specs, cryptography, security, and high reliability. Proven track record in leading design teams. Experience Hardware Applications Engineer Intel Corporation 2012  –  2014  (2 years) Chandler, Arizona Provided technical support and board-level debug for users of Intel’s latest SoCs embedded in set-top boxes and cable gateway devices. Developed JTAG debugger tools for fusing SoCs, burning NAND/NOR flash, and in-circuit debugging. Released collateral documentation such as platform design guides, SoC datasheets, and errata. Hardware/Software Engineer General Dynamics C4 Systems 2012  –  2012  (less than a year) Scottsdale, AZ Maintained the Board Bring Up (BBU) code on the modem card during integration and test. Provided incremental releases as system functionality increased and features were added. Real-time embedded programming in Assembly and C++ using Marvell IDE for an XScale SoC processor PXA320 ARMv5 with DDR ram & FLASH interface. Software Engineer General Dynamics C4 Systems 2010  –  2011  (1 year) Scottsdale, AZ Responsible for converting over 8,000 VAX-based test scripts to run on the PC along with updating documentation. Conducted formal testing (FQT, DVT, SVT, Timing) on a KOV-20 avionics module to verify proper test coverage. Also responsible for migrating the KOV-20 source code (ADA) and development environment (compiler, linker, postlinker) to the PC, and rebuilding executables to verify binary equivalency. Extensive use of Perl 5.10 to integrate test scripts. Systems Engineer General Dynamics C4 Systems 2009  –  2009  (less than a year) Scottsdale, AZ Responsible for managing requirements, which involved capturing customer requirements in ReqPro for traceability, deriving child requirements, allocating functional groups and verification methods, and verifying all requirements were met. Authored the Test & Evaluation Program Plan, and the Systems Engineering Master Plan. Proposal Manager / Project Lead General Dynamics C4 Systems 2008  –  2009  (1 year) Scottsdale, Arizona Successfully proposed and negotiated a 33 million dollar contract for COMSEC decryption equipment. Responsible for providing current, complete, and accurate estimates along with cost and pricing data. Went on to lead the program through startup & planning phase (Integrated Baseline Review). Engineering Task Lead & Asst. Project Lead General Dynamics C4 Systems 2001  –  2008  (7 years) Scottsdale, Arizona Lead the development of high-speed wide-band cryptographic COMSEC equipment. Served as Cost Account Manager (CAM), managing cost, schedule and technical performance of six control accounts. Responsible for engineering and manufacturing activities. Interacted with customer through weekly status, monthly technical interchange meetings (TIMs), and phase-end reviews. One of the major design accomplishments was meeting an aggressive Return Loss specification. Hardware Design Engineer Motorola Government Electronics Group 1995  –  2001  (6 years) Scottsdale, Arizona Hardware design engineer for U.S. military high-speed encryptor/decryptor. Responsible for board-level design, FPGA logic, worst-case tolerance analysis, security analysis, cryptographic verification, and integration and test. Developed module-level test procedures for manufacturing. Worked with NSA on security certification. Developed an instructional course (manuals & training) for Air Force maintenance personnel. Electrical Engineer Orbital Sciences Corporation 1992  –  1995  (3 years) Successfully launched two classified suborbital sounding rockets from Cape Canaveral, FL Hardware Applications Engineer Intel Corporation 2012  –  2014  (2 years) Chandler, Arizona Provided technical support and board-level debug for users of Intel’s latest SoCs embedded in set-top boxes and cable gateway devices. Developed JTAG debugger tools for fusing SoCs, burning NAND/NOR flash, and in-circuit debugging. Released collateral documentation such as platform design guides, SoC datasheets, and errata. Hardware Applications Engineer Intel Corporation 2012  –  2014  (2 years) Chandler, Arizona Provided technical support and board-level debug for users of Intel’s latest SoCs embedded in set-top boxes and cable gateway devices. Developed JTAG debugger tools for fusing SoCs, burning NAND/NOR flash, and in-circuit debugging. Released collateral documentation such as platform design guides, SoC datasheets, and errata. Hardware/Software Engineer General Dynamics C4 Systems 2012  –  2012  (less than a year) Scottsdale, AZ Maintained the Board Bring Up (BBU) code on the modem card during integration and test. Provided incremental releases as system functionality increased and features were added. Real-time embedded programming in Assembly and C++ using Marvell IDE for an XScale SoC processor PXA320 ARMv5 with DDR ram & FLASH interface. Hardware/Software Engineer General Dynamics C4 Systems 2012  –  2012  (less than a year) Scottsdale, AZ Maintained the Board Bring Up (BBU) code on the modem card during integration and test. Provided incremental releases as system functionality increased and features were added. Real-time embedded programming in Assembly and C++ using Marvell IDE for an XScale SoC processor PXA320 ARMv5 with DDR ram & FLASH interface. Software Engineer General Dynamics C4 Systems 2010  –  2011  (1 year) Scottsdale, AZ Responsible for converting over 8,000 VAX-based test scripts to run on the PC along with updating documentation. Conducted formal testing (FQT, DVT, SVT, Timing) on a KOV-20 avionics module to verify proper test coverage. Also responsible for migrating the KOV-20 source code (ADA) and development environment (compiler, linker, postlinker) to the PC, and rebuilding executables to verify binary equivalency. Extensive use of Perl 5.10 to integrate test scripts. Software Engineer General Dynamics C4 Systems 2010  –  2011  (1 year) Scottsdale, AZ Responsible for converting over 8,000 VAX-based test scripts to run on the PC along with updating documentation. Conducted formal testing (FQT, DVT, SVT, Timing) on a KOV-20 avionics module to verify proper test coverage. Also responsible for migrating the KOV-20 source code (ADA) and development environment (compiler, linker, postlinker) to the PC, and rebuilding executables to verify binary equivalency. Extensive use of Perl 5.10 to integrate test scripts. Systems Engineer General Dynamics C4 Systems 2009  –  2009  (less than a year) Scottsdale, AZ Responsible for managing requirements, which involved capturing customer requirements in ReqPro for traceability, deriving child requirements, allocating functional groups and verification methods, and verifying all requirements were met. Authored the Test & Evaluation Program Plan, and the Systems Engineering Master Plan. Systems Engineer General Dynamics C4 Systems 2009  –  2009  (less than a year) Scottsdale, AZ Responsible for managing requirements, which involved capturing customer requirements in ReqPro for traceability, deriving child requirements, allocating functional groups and verification methods, and verifying all requirements were met. Authored the Test & Evaluation Program Plan, and the Systems Engineering Master Plan. Proposal Manager / Project Lead General Dynamics C4 Systems 2008  –  2009  (1 year) Scottsdale, Arizona Successfully proposed and negotiated a 33 million dollar contract for COMSEC decryption equipment. Responsible for providing current, complete, and accurate estimates along with cost and pricing data. Went on to lead the program through startup & planning phase (Integrated Baseline Review). Proposal Manager / Project Lead General Dynamics C4 Systems 2008  –  2009  (1 year) Scottsdale, Arizona Successfully proposed and negotiated a 33 million dollar contract for COMSEC decryption equipment. Responsible for providing current, complete, and accurate estimates along with cost and pricing data. Went on to lead the program through startup & planning phase (Integrated Baseline Review). Engineering Task Lead & Asst. Project Lead General Dynamics C4 Systems 2001  –  2008  (7 years) Scottsdale, Arizona Lead the development of high-speed wide-band cryptographic COMSEC equipment. Served as Cost Account Manager (CAM), managing cost, schedule and technical performance of six control accounts. Responsible for engineering and manufacturing activities. Interacted with customer through weekly status, monthly technical interchange meetings (TIMs), and phase-end reviews. One of the major design accomplishments was meeting an aggressive Return Loss specification. Engineering Task Lead & Asst. Project Lead General Dynamics C4 Systems 2001  –  2008  (7 years) Scottsdale, Arizona Lead the development of high-speed wide-band cryptographic COMSEC equipment. Served as Cost Account Manager (CAM), managing cost, schedule and technical performance of six control accounts. Responsible for engineering and manufacturing activities. Interacted with customer through weekly status, monthly technical interchange meetings (TIMs), and phase-end reviews. One of the major design accomplishments was meeting an aggressive Return Loss specification. Hardware Design Engineer Motorola Government Electronics Group 1995  –  2001  (6 years) Scottsdale, Arizona Hardware design engineer for U.S. military high-speed encryptor/decryptor. Responsible for board-level design, FPGA logic, worst-case tolerance analysis, security analysis, cryptographic verification, and integration and test. Developed module-level test procedures for manufacturing. Worked with NSA on security certification. Developed an instructional course (manuals & training) for Air Force maintenance personnel. Hardware Design Engineer Motorola Government Electronics Group 1995  –  2001  (6 years) Scottsdale, Arizona Hardware design engineer for U.S. military high-speed encryptor/decryptor. Responsible for board-level design, FPGA logic, worst-case tolerance analysis, security analysis, cryptographic verification, and integration and test. Developed module-level test procedures for manufacturing. Worked with NSA on security certification. Developed an instructional course (manuals & training) for Air Force maintenance personnel. Electrical Engineer Orbital Sciences Corporation 1992  –  1995  (3 years) Successfully launched two classified suborbital sounding rockets from Cape Canaveral, FL Electrical Engineer Orbital Sciences Corporation 1992  –  1995  (3 years) Successfully launched two classified suborbital sounding rockets from Cape Canaveral, FL Languages   Skills Embedded Systems Testing Perl FPGA Integration Systems Engineering Hardware Architecture Software Design C++ Hardware SoC SDLC Software Documentation Embedded Software Requirements Management Skills  Embedded Systems Testing Perl FPGA Integration Systems Engineering Hardware Architecture Software Design C++ Hardware SoC SDLC Software Documentation Embedded Software Requirements Management Embedded Systems Testing Perl FPGA Integration Systems Engineering Hardware Architecture Software Design C++ Hardware SoC SDLC Software Documentation Embedded Software Requirements Management Embedded Systems Testing Perl FPGA Integration Systems Engineering Hardware Architecture Software Design C++ Hardware SoC SDLC Software Documentation Embedded Software Requirements Management Education University of Idaho Bachelor of Science (BS),  Electrical Engineering University of Idaho Bachelor of Science (BS),  Electrical Engineering University of Idaho Bachelor of Science (BS),  Electrical Engineering University of Idaho Bachelor of Science (BS),  Electrical Engineering Honors & Awards ", "Experience Platform Applications Engineering Manager Intel Corporation January 2008  – Present (7 years 8 months) Folsom, CA Hardware Engineer Intel Corporation January 1999  –  January 2008  (9 years 1 month) Folsom CA Graphics Hardware Applications Engineer Intel Corporation January 1998  –  January 1999  (1 year 1 month) Folsom, CA Test Software Engineer Packard Bell NEC August 1996  –  January 1998  (1 year 6 months) Platform Applications Engineering Manager Intel Corporation January 2008  – Present (7 years 8 months) Folsom, CA Platform Applications Engineering Manager Intel Corporation January 2008  – Present (7 years 8 months) Folsom, CA Hardware Engineer Intel Corporation January 1999  –  January 2008  (9 years 1 month) Folsom CA Hardware Engineer Intel Corporation January 1999  –  January 2008  (9 years 1 month) Folsom CA Graphics Hardware Applications Engineer Intel Corporation January 1998  –  January 1999  (1 year 1 month) Folsom, CA Graphics Hardware Applications Engineer Intel Corporation January 1998  –  January 1999  (1 year 1 month) Folsom, CA Test Software Engineer Packard Bell NEC August 1996  –  January 1998  (1 year 6 months) Test Software Engineer Packard Bell NEC August 1996  –  January 1998  (1 year 6 months) "]}