{"position": "Human Resources", "company": "Intel Corporation", "profiles": ["Experience Human Resources Intel Corporation March 1984  – Present (31 years 6 months) Human Resources Intel Corporation March 1984  – Present (31 years 6 months) Human Resources Intel Corporation March 1984  – Present (31 years 6 months) Skills Program Management Leadership Skills  Program Management Leadership Program Management Leadership Program Management Leadership ", "Experience Human Resources Intel Corporation Human Resources Intel Corporation Human Resources Intel Corporation ", "Summary Talented, results-producing Human Resources Professional with over 20 years of accomplishments in planning and leading comprehensive Human Resources strategies in support of business goals and objectives. Strong generalist skills in all functional areas of Human Resources, with expertise in leading HR programs in support of mergers and acquisitions, divestitures, integration of subsidiaries and movement of businesses into other areas of the company. Can create and implement unique HR practices for adjacent and start up businesses within a large company.  \n \nDemonstrated experience leading cross-functional and global teams to drive projects. Able to work with technical teams on implementing strong program management competencies such as setting clear goals and rallying teams to those goals, removing collaboration barriers and implementing workforce planning strategies. Lead teams through organizational re-design to assessing existing talent to developing new competencies and skills.  \n \nStrong consulting and influencing skills; ability to think strategically. Utilizes networks and strong business acumen to quickly build trust with clients for effective partnership. Flexible in style and approach to work varying discipline and with varying levels of personality styles. Thrives in ambiguity and has the ability to turn chaos into manageability.  \n \nIs a trusted consultant and team-player by using HR analytics and data to support opinions and recommendations. Summary Talented, results-producing Human Resources Professional with over 20 years of accomplishments in planning and leading comprehensive Human Resources strategies in support of business goals and objectives. Strong generalist skills in all functional areas of Human Resources, with expertise in leading HR programs in support of mergers and acquisitions, divestitures, integration of subsidiaries and movement of businesses into other areas of the company. Can create and implement unique HR practices for adjacent and start up businesses within a large company.  \n \nDemonstrated experience leading cross-functional and global teams to drive projects. Able to work with technical teams on implementing strong program management competencies such as setting clear goals and rallying teams to those goals, removing collaboration barriers and implementing workforce planning strategies. Lead teams through organizational re-design to assessing existing talent to developing new competencies and skills.  \n \nStrong consulting and influencing skills; ability to think strategically. Utilizes networks and strong business acumen to quickly build trust with clients for effective partnership. Flexible in style and approach to work varying discipline and with varying levels of personality styles. Thrives in ambiguity and has the ability to turn chaos into manageability.  \n \nIs a trusted consultant and team-player by using HR analytics and data to support opinions and recommendations. Talented, results-producing Human Resources Professional with over 20 years of accomplishments in planning and leading comprehensive Human Resources strategies in support of business goals and objectives. Strong generalist skills in all functional areas of Human Resources, with expertise in leading HR programs in support of mergers and acquisitions, divestitures, integration of subsidiaries and movement of businesses into other areas of the company. Can create and implement unique HR practices for adjacent and start up businesses within a large company.  \n \nDemonstrated experience leading cross-functional and global teams to drive projects. Able to work with technical teams on implementing strong program management competencies such as setting clear goals and rallying teams to those goals, removing collaboration barriers and implementing workforce planning strategies. Lead teams through organizational re-design to assessing existing talent to developing new competencies and skills.  \n \nStrong consulting and influencing skills; ability to think strategically. Utilizes networks and strong business acumen to quickly build trust with clients for effective partnership. Flexible in style and approach to work varying discipline and with varying levels of personality styles. Thrives in ambiguity and has the ability to turn chaos into manageability.  \n \nIs a trusted consultant and team-player by using HR analytics and data to support opinions and recommendations. Talented, results-producing Human Resources Professional with over 20 years of accomplishments in planning and leading comprehensive Human Resources strategies in support of business goals and objectives. Strong generalist skills in all functional areas of Human Resources, with expertise in leading HR programs in support of mergers and acquisitions, divestitures, integration of subsidiaries and movement of businesses into other areas of the company. Can create and implement unique HR practices for adjacent and start up businesses within a large company.  \n \nDemonstrated experience leading cross-functional and global teams to drive projects. Able to work with technical teams on implementing strong program management competencies such as setting clear goals and rallying teams to those goals, removing collaboration barriers and implementing workforce planning strategies. Lead teams through organizational re-design to assessing existing talent to developing new competencies and skills.  \n \nStrong consulting and influencing skills; ability to think strategically. Utilizes networks and strong business acumen to quickly build trust with clients for effective partnership. Flexible in style and approach to work varying discipline and with varying levels of personality styles. Thrives in ambiguity and has the ability to turn chaos into manageability.  \n \nIs a trusted consultant and team-player by using HR analytics and data to support opinions and recommendations. Experience Human Resources Business Transformation Consultant Intel Corporation January 2000  – Present (15 years 8 months) Folsom, California Deliver innovative, strategy aligned solutions that produce measurable business results and shape Intel for the future.  \n \nWork across multiple business groups within Intel on projects such as: Workforce Planning Strategies, Integration of Acquisitions, Corporate Culture Change initiatives, Change and Transition Management and Leadership Coaching.  \n \nResponsible for partnering with the customer to strategically integrate effective HR processes, programs and practices into their daily operations. Conduct needs assessments or audits and make recommendations or proposals, coordinate the creation and implementation of an action or corrective plan, and when required, organize and coordinate cross-functional Human Resource teams to assist with developing and implementing performance improvement corrective plans, programs or processes. Manager Human Resources Intel Corporation January 2000  – Present (15 years 8 months) Director, Human Resources Intel Corporation January 2013  –  March 2014  (1 year 3 months) Santa Clara, California Led Human Resources for a software services business that was formed from external Media talent and grew to over 400 employees within 2 years. Set up unique HR systems for external hiring of key industry talent, onboarding, culture creation of start-up like communications and employee engagement within a large company. Utilized prior divestiture experience and playbook for successful divestiture of the business to another company; ensuring retention strategies were in place through coaching leadership how to lead through ambiguity. Led HR team to support the business through the change, including complex compensation re-design into new company. Human Resources Manager (Divestitures, Starting up new companies) Intel Corporation August 2006  –  December 2012  (6 years 5 months) Folsom, California Managed and led all Human Resource activity for merger of a new company, Care Innovations (a joint venture between Intel and GE Home Health). Researched and implemented Professional Employer Organization (PEO) to contract all HR services for company. Designed and communicated new Compensation and Benefit plans as well as set up company policies. Worked with executive leaders on Change and Transition Management, culture alignment with the two companies and organizational design and selection of employees for the new company.  \n \nHRM for Flash Memory Group (7500 worldwide employees). Coach business with organizational design and structure, business acquisitions, and integration programs. Lead workforce planning systems, performance management processes & employee relations through data analysis and recommendations. Manage HR specialist team. Led employee due diligence in divestiture of business with ST Microelectronics to form a new World Wide Flash Memory company.  \n \nRemained at Intel to be the HR Manager for the Non-volatile memory solution business and partnered closely with the VP and Controller, focusing on hiring and acquiring key talent, leadership development and enlisting employee ideas on how to improve efficiency and time to market for business profitability. Senior Human Resources Business Partner Intel Corporation 2000  –  2006  (6 years) Folsom, California Designed and implemented HR services for businesses in the areas of compensation and performance management systems, succession planning and workforce development strategies. Experience solving employee relation issues from workers compensation to harassment cases. Created diversity hiring and retention strategies, including training and education for employees on the business case for diversity. Manager Human Resources Level One Communications 1995  –  2000  (5 years) Sacramento, California Area Responsible for development and implementation of corporate human resources workplace strategies and programs for World-Wide Sales and Marketing, Information Technology, Finance & Administration. Partner with senior management to develop programs that attract, retain and motivate employees. Facilitate organizational change and integration of new companies.  \n \nCoordinate campus recruiting and Internship program; Recruit candidates for Engineering, Sales & Marketing, IT, Product Test, Quality & Reliability, administrative and technical positions. Responsible for coordinating company advertising program, career fairs and other recruiting events.  \n \nResearch, recommend and manage competitive benefits programs for an organization of 700 employees, including stock incentive programs. Implement Wellness Programs to include a Health & Safety Fair. Responsible for Workers’ Compensation, Safety and LOA training and administration. \n \nParticipated in the development of a competitive Compensation Program; Facilitate performance appraisal programs twice a year; Participate in Salary Surveys.  \n \nEmployee Relation Counselor, including interpreting company policies to management and employees. \n \nProgram Managed employee merger and integration activities when Intel Corporation purchased company in late 1999. Regional Human Resources Manager Budget Rent a Car May 1993  –  May 1995  (2 years 1 month) Albuquerque, New Mexico Area Responsibilities included company recruitment and benefit orientation; representing company in Unemployment Hearings, Arbitration & Mediation; acting as the Employee Relation Counselor, provide assistance to managers dealing with employee disciplinary action; Conduct Exit Interviews; Implement Safety Program; Monitored Workers’ Compensation, ADA and AAP policies and plans. Human Resources Business Transformation Consultant Intel Corporation January 2000  – Present (15 years 8 months) Folsom, California Deliver innovative, strategy aligned solutions that produce measurable business results and shape Intel for the future.  \n \nWork across multiple business groups within Intel on projects such as: Workforce Planning Strategies, Integration of Acquisitions, Corporate Culture Change initiatives, Change and Transition Management and Leadership Coaching.  \n \nResponsible for partnering with the customer to strategically integrate effective HR processes, programs and practices into their daily operations. Conduct needs assessments or audits and make recommendations or proposals, coordinate the creation and implementation of an action or corrective plan, and when required, organize and coordinate cross-functional Human Resource teams to assist with developing and implementing performance improvement corrective plans, programs or processes. Human Resources Business Transformation Consultant Intel Corporation January 2000  – Present (15 years 8 months) Folsom, California Deliver innovative, strategy aligned solutions that produce measurable business results and shape Intel for the future.  \n \nWork across multiple business groups within Intel on projects such as: Workforce Planning Strategies, Integration of Acquisitions, Corporate Culture Change initiatives, Change and Transition Management and Leadership Coaching.  \n \nResponsible for partnering with the customer to strategically integrate effective HR processes, programs and practices into their daily operations. Conduct needs assessments or audits and make recommendations or proposals, coordinate the creation and implementation of an action or corrective plan, and when required, organize and coordinate cross-functional Human Resource teams to assist with developing and implementing performance improvement corrective plans, programs or processes. Manager Human Resources Intel Corporation January 2000  – Present (15 years 8 months) Manager Human Resources Intel Corporation January 2000  – Present (15 years 8 months) Director, Human Resources Intel Corporation January 2013  –  March 2014  (1 year 3 months) Santa Clara, California Led Human Resources for a software services business that was formed from external Media talent and grew to over 400 employees within 2 years. Set up unique HR systems for external hiring of key industry talent, onboarding, culture creation of start-up like communications and employee engagement within a large company. Utilized prior divestiture experience and playbook for successful divestiture of the business to another company; ensuring retention strategies were in place through coaching leadership how to lead through ambiguity. Led HR team to support the business through the change, including complex compensation re-design into new company. Director, Human Resources Intel Corporation January 2013  –  March 2014  (1 year 3 months) Santa Clara, California Led Human Resources for a software services business that was formed from external Media talent and grew to over 400 employees within 2 years. Set up unique HR systems for external hiring of key industry talent, onboarding, culture creation of start-up like communications and employee engagement within a large company. Utilized prior divestiture experience and playbook for successful divestiture of the business to another company; ensuring retention strategies were in place through coaching leadership how to lead through ambiguity. Led HR team to support the business through the change, including complex compensation re-design into new company. Human Resources Manager (Divestitures, Starting up new companies) Intel Corporation August 2006  –  December 2012  (6 years 5 months) Folsom, California Managed and led all Human Resource activity for merger of a new company, Care Innovations (a joint venture between Intel and GE Home Health). Researched and implemented Professional Employer Organization (PEO) to contract all HR services for company. Designed and communicated new Compensation and Benefit plans as well as set up company policies. Worked with executive leaders on Change and Transition Management, culture alignment with the two companies and organizational design and selection of employees for the new company.  \n \nHRM for Flash Memory Group (7500 worldwide employees). Coach business with organizational design and structure, business acquisitions, and integration programs. Lead workforce planning systems, performance management processes & employee relations through data analysis and recommendations. Manage HR specialist team. Led employee due diligence in divestiture of business with ST Microelectronics to form a new World Wide Flash Memory company.  \n \nRemained at Intel to be the HR Manager for the Non-volatile memory solution business and partnered closely with the VP and Controller, focusing on hiring and acquiring key talent, leadership development and enlisting employee ideas on how to improve efficiency and time to market for business profitability. Human Resources Manager (Divestitures, Starting up new companies) Intel Corporation August 2006  –  December 2012  (6 years 5 months) Folsom, California Managed and led all Human Resource activity for merger of a new company, Care Innovations (a joint venture between Intel and GE Home Health). Researched and implemented Professional Employer Organization (PEO) to contract all HR services for company. Designed and communicated new Compensation and Benefit plans as well as set up company policies. Worked with executive leaders on Change and Transition Management, culture alignment with the two companies and organizational design and selection of employees for the new company.  \n \nHRM for Flash Memory Group (7500 worldwide employees). Coach business with organizational design and structure, business acquisitions, and integration programs. Lead workforce planning systems, performance management processes & employee relations through data analysis and recommendations. Manage HR specialist team. Led employee due diligence in divestiture of business with ST Microelectronics to form a new World Wide Flash Memory company.  \n \nRemained at Intel to be the HR Manager for the Non-volatile memory solution business and partnered closely with the VP and Controller, focusing on hiring and acquiring key talent, leadership development and enlisting employee ideas on how to improve efficiency and time to market for business profitability. Senior Human Resources Business Partner Intel Corporation 2000  –  2006  (6 years) Folsom, California Designed and implemented HR services for businesses in the areas of compensation and performance management systems, succession planning and workforce development strategies. Experience solving employee relation issues from workers compensation to harassment cases. Created diversity hiring and retention strategies, including training and education for employees on the business case for diversity. Senior Human Resources Business Partner Intel Corporation 2000  –  2006  (6 years) Folsom, California Designed and implemented HR services for businesses in the areas of compensation and performance management systems, succession planning and workforce development strategies. Experience solving employee relation issues from workers compensation to harassment cases. Created diversity hiring and retention strategies, including training and education for employees on the business case for diversity. Manager Human Resources Level One Communications 1995  –  2000  (5 years) Sacramento, California Area Responsible for development and implementation of corporate human resources workplace strategies and programs for World-Wide Sales and Marketing, Information Technology, Finance & Administration. Partner with senior management to develop programs that attract, retain and motivate employees. Facilitate organizational change and integration of new companies.  \n \nCoordinate campus recruiting and Internship program; Recruit candidates for Engineering, Sales & Marketing, IT, Product Test, Quality & Reliability, administrative and technical positions. Responsible for coordinating company advertising program, career fairs and other recruiting events.  \n \nResearch, recommend and manage competitive benefits programs for an organization of 700 employees, including stock incentive programs. Implement Wellness Programs to include a Health & Safety Fair. Responsible for Workers’ Compensation, Safety and LOA training and administration. \n \nParticipated in the development of a competitive Compensation Program; Facilitate performance appraisal programs twice a year; Participate in Salary Surveys.  \n \nEmployee Relation Counselor, including interpreting company policies to management and employees. \n \nProgram Managed employee merger and integration activities when Intel Corporation purchased company in late 1999. Manager Human Resources Level One Communications 1995  –  2000  (5 years) Sacramento, California Area Responsible for development and implementation of corporate human resources workplace strategies and programs for World-Wide Sales and Marketing, Information Technology, Finance & Administration. Partner with senior management to develop programs that attract, retain and motivate employees. Facilitate organizational change and integration of new companies.  \n \nCoordinate campus recruiting and Internship program; Recruit candidates for Engineering, Sales & Marketing, IT, Product Test, Quality & Reliability, administrative and technical positions. Responsible for coordinating company advertising program, career fairs and other recruiting events.  \n \nResearch, recommend and manage competitive benefits programs for an organization of 700 employees, including stock incentive programs. Implement Wellness Programs to include a Health & Safety Fair. Responsible for Workers’ Compensation, Safety and LOA training and administration. \n \nParticipated in the development of a competitive Compensation Program; Facilitate performance appraisal programs twice a year; Participate in Salary Surveys.  \n \nEmployee Relation Counselor, including interpreting company policies to management and employees. \n \nProgram Managed employee merger and integration activities when Intel Corporation purchased company in late 1999. Regional Human Resources Manager Budget Rent a Car May 1993  –  May 1995  (2 years 1 month) Albuquerque, New Mexico Area Responsibilities included company recruitment and benefit orientation; representing company in Unemployment Hearings, Arbitration & Mediation; acting as the Employee Relation Counselor, provide assistance to managers dealing with employee disciplinary action; Conduct Exit Interviews; Implement Safety Program; Monitored Workers’ Compensation, ADA and AAP policies and plans. Regional Human Resources Manager Budget Rent a Car May 1993  –  May 1995  (2 years 1 month) Albuquerque, New Mexico Area Responsibilities included company recruitment and benefit orientation; representing company in Unemployment Hearings, Arbitration & Mediation; acting as the Employee Relation Counselor, provide assistance to managers dealing with employee disciplinary action; Conduct Exit Interviews; Implement Safety Program; Monitored Workers’ Compensation, ADA and AAP policies and plans. Skills Workforce Planning Organizational... Deferred Compensation Talent Management Succession Planning Employee Engagement HRIS Employee Relations Performance Management Human Resources Mergers & Acquisitions Talent Acquisition HR Consulting Onboarding Employment Law New Hire Orientations Organizational Design Career Development Employee Benefits College Recruiting HR Policies Training Personnel Management Organizational... Benefits Administration Applicant Tracking... Compensation & Benefit Taleo Technical Recruiting Interviews Temporary Placement Management Development HR Transformation Recruiting Labor Relations Screening Leadership Development Internet Recruiting Employer Branding Management Program Management Cross-functional Team... Leadership Process Improvement See 29+     See less Skills  Workforce Planning Organizational... Deferred Compensation Talent Management Succession Planning Employee Engagement HRIS Employee Relations Performance Management Human Resources Mergers & Acquisitions Talent Acquisition HR Consulting Onboarding Employment Law New Hire Orientations Organizational Design Career Development Employee Benefits College Recruiting HR Policies Training Personnel Management Organizational... Benefits Administration Applicant Tracking... Compensation & Benefit Taleo Technical Recruiting Interviews Temporary Placement Management Development HR Transformation Recruiting Labor Relations Screening Leadership Development Internet Recruiting Employer Branding Management Program Management Cross-functional Team... Leadership Process Improvement See 29+     See less Workforce Planning Organizational... Deferred Compensation Talent Management Succession Planning Employee Engagement HRIS Employee Relations Performance Management Human Resources Mergers & Acquisitions Talent Acquisition HR Consulting Onboarding Employment Law New Hire Orientations Organizational Design Career Development Employee Benefits College Recruiting HR Policies Training Personnel Management Organizational... Benefits Administration Applicant Tracking... Compensation & Benefit Taleo Technical Recruiting Interviews Temporary Placement Management Development HR Transformation Recruiting Labor Relations Screening Leadership Development Internet Recruiting Employer Branding Management Program Management Cross-functional Team... Leadership Process Improvement See 29+     See less Workforce Planning Organizational... Deferred Compensation Talent Management Succession Planning Employee Engagement HRIS Employee Relations Performance Management Human Resources Mergers & Acquisitions Talent Acquisition HR Consulting Onboarding Employment Law New Hire Orientations Organizational Design Career Development Employee Benefits College Recruiting HR Policies Training Personnel Management Organizational... Benefits Administration Applicant Tracking... Compensation & Benefit Taleo Technical Recruiting Interviews Temporary Placement Management Development HR Transformation Recruiting Labor Relations Screening Leadership Development Internet Recruiting Employer Branding Management Program Management Cross-functional Team... Leadership Process Improvement See 29+     See less Education The University of New Mexico - Robert O. Anderson School of Management Bachelors,  Human Resources Management 1989  – 1993 Activities and Societies:  Kappa Kappa Gamma The University of New Mexico - Robert O. Anderson School of Management Bachelors,  Human Resources Management 1989  – 1993 Activities and Societies:  Kappa Kappa Gamma The University of New Mexico - Robert O. Anderson School of Management Bachelors,  Human Resources Management 1989  – 1993 Activities and Societies:  Kappa Kappa Gamma The University of New Mexico - Robert O. Anderson School of Management Bachelors,  Human Resources Management 1989  – 1993 Activities and Societies:  Kappa Kappa Gamma ", "Skills Talent Management Skills  Talent Management Talent Management Talent Management ", "Experience Human Resources Intel Corporation January 2010  – Present (5 years 8 months) Human Resources Intel Corporation January 2010  – Present (5 years 8 months) Human Resources Intel Corporation January 2010  – Present (5 years 8 months) ", "Experience Well-being consultant - Human resources Intel Corporation January 2014  – Present (1 year 8 months) Jerusalem •\tBuilding strategy and communication plan \n•\tBudget and yearly plan management \n•\tSetting indicators for success and schedules \n•\tUnderstanding needs and requirements for next steps enhancements \n• Qualitative/quantitative analysis \n•\tSupporting on-going benefit programs (as business credit card program, banks benefits) \n•\tUnderstanding the organization's, managers' and customers' needs and applying the solution \n•\tRespond to managers' and employees' requests and queries \n•\tManaging Intel Israel's events' productions (as family events) and creative concept \n•\tSupport and advice to departments' events \n•\tCoordinating within the organization different departments (security, safety, purchasing, etc.)  \nworking with variety of suppliers and authorities Groups coordinator - Israel Summer programs Hadassah / Young Judaea Israel October 2011  –  October 2013  (2 years 1 month) Israel Recruitment Coordinator Hadassah / Young Judaea Israel October 2011  –  October 2013  (2 years 1 month) Jerusalem Well-being consultant - Human resources Intel Corporation January 2014  – Present (1 year 8 months) Jerusalem •\tBuilding strategy and communication plan \n•\tBudget and yearly plan management \n•\tSetting indicators for success and schedules \n•\tUnderstanding needs and requirements for next steps enhancements \n• Qualitative/quantitative analysis \n•\tSupporting on-going benefit programs (as business credit card program, banks benefits) \n•\tUnderstanding the organization's, managers' and customers' needs and applying the solution \n•\tRespond to managers' and employees' requests and queries \n•\tManaging Intel Israel's events' productions (as family events) and creative concept \n•\tSupport and advice to departments' events \n•\tCoordinating within the organization different departments (security, safety, purchasing, etc.)  \nworking with variety of suppliers and authorities Well-being consultant - Human resources Intel Corporation January 2014  – Present (1 year 8 months) Jerusalem •\tBuilding strategy and communication plan \n•\tBudget and yearly plan management \n•\tSetting indicators for success and schedules \n•\tUnderstanding needs and requirements for next steps enhancements \n• Qualitative/quantitative analysis \n•\tSupporting on-going benefit programs (as business credit card program, banks benefits) \n•\tUnderstanding the organization's, managers' and customers' needs and applying the solution \n•\tRespond to managers' and employees' requests and queries \n•\tManaging Intel Israel's events' productions (as family events) and creative concept \n•\tSupport and advice to departments' events \n•\tCoordinating within the organization different departments (security, safety, purchasing, etc.)  \nworking with variety of suppliers and authorities Groups coordinator - Israel Summer programs Hadassah / Young Judaea Israel October 2011  –  October 2013  (2 years 1 month) Israel Groups coordinator - Israel Summer programs Hadassah / Young Judaea Israel October 2011  –  October 2013  (2 years 1 month) Israel Recruitment Coordinator Hadassah / Young Judaea Israel October 2011  –  October 2013  (2 years 1 month) Jerusalem Recruitment Coordinator Hadassah / Young Judaea Israel October 2011  –  October 2013  (2 years 1 month) Jerusalem Languages English Professional working proficiency Hebrew Native or bilingual proficiency English Professional working proficiency Hebrew Native or bilingual proficiency English Professional working proficiency Hebrew Native or bilingual proficiency Professional working proficiency Native or bilingual proficiency Skills Management Human Resources Recruiting Consulting Budgets Employee Benefits Customer Service Skills  Management Human Resources Recruiting Consulting Budgets Employee Benefits Customer Service Management Human Resources Recruiting Consulting Budgets Employee Benefits Customer Service Management Human Resources Recruiting Consulting Budgets Employee Benefits Customer Service Education The Hebrew University Bachelor's Degree,  Business Administration and Management , General 2011  – 2014 Bachelor's Degree in Business Administration & Bachelor's Degree in Education. Activities and Societies:  Establishing running group for students- 'Someone to run with' and fund raising by running 10 km in Jerusalem marathon for 'Aviv for Holocaust Survivors' ( non-profit organization). The Open University Master of Business Administration (M.B.A.) 2014 The Hebrew University Bachelor's Degree,  Business Administration and Management , General 2011  – 2014 Bachelor's Degree in Business Administration & Bachelor's Degree in Education. Activities and Societies:  Establishing running group for students- 'Someone to run with' and fund raising by running 10 km in Jerusalem marathon for 'Aviv for Holocaust Survivors' ( non-profit organization). The Hebrew University Bachelor's Degree,  Business Administration and Management , General 2011  – 2014 Bachelor's Degree in Business Administration & Bachelor's Degree in Education. Activities and Societies:  Establishing running group for students- 'Someone to run with' and fund raising by running 10 km in Jerusalem marathon for 'Aviv for Holocaust Survivors' ( non-profit organization). The Hebrew University Bachelor's Degree,  Business Administration and Management , General 2011  – 2014 Bachelor's Degree in Business Administration & Bachelor's Degree in Education. Activities and Societies:  Establishing running group for students- 'Someone to run with' and fund raising by running 10 km in Jerusalem marathon for 'Aviv for Holocaust Survivors' ( non-profit organization). The Open University Master of Business Administration (M.B.A.) 2014 The Open University Master of Business Administration (M.B.A.) 2014 The Open University Master of Business Administration (M.B.A.) 2014 ", "Skills Product Marketing Product Management Cross-functional Team... Program Management Strategic Partnerships Business Development Multi-channel Marketing Semiconductors Go-to-market Strategy Mobile Devices Product Development Competitive Analysis Project Management Marketing Strategy Technical Marketing Management Marketing Leadership Product Launch Intel Marketing Management Strategy Start-ups See 8+     See less Skills  Product Marketing Product Management Cross-functional Team... Program Management Strategic Partnerships Business Development Multi-channel Marketing Semiconductors Go-to-market Strategy Mobile Devices Product Development Competitive Analysis Project Management Marketing Strategy Technical Marketing Management Marketing Leadership Product Launch Intel Marketing Management Strategy Start-ups See 8+     See less Product Marketing Product Management Cross-functional Team... Program Management Strategic Partnerships Business Development Multi-channel Marketing Semiconductors Go-to-market Strategy Mobile Devices Product Development Competitive Analysis Project Management Marketing Strategy Technical Marketing Management Marketing Leadership Product Launch Intel Marketing Management Strategy Start-ups See 8+     See less Product Marketing Product Management Cross-functional Team... Program Management Strategic Partnerships Business Development Multi-channel Marketing Semiconductors Go-to-market Strategy Mobile Devices Product Development Competitive Analysis Project Management Marketing Strategy Technical Marketing Management Marketing Leadership Product Launch Intel Marketing Management Strategy Start-ups See 8+     See less ", "Summary An Intel Corporation leader with 20+ years of service, I love building things. Teams. Factories. Organizations. People. I believe in continual improvement, not only of ourselves, but of the people around us, the work that we do and the environment in which we do it. I've lived and worked in 3 countries and explored countless others and believe in the fundamental goodness of people and our ability as a human race to overcome any obstacle or challenge. Summary An Intel Corporation leader with 20+ years of service, I love building things. Teams. Factories. Organizations. People. I believe in continual improvement, not only of ourselves, but of the people around us, the work that we do and the environment in which we do it. I've lived and worked in 3 countries and explored countless others and believe in the fundamental goodness of people and our ability as a human race to overcome any obstacle or challenge. An Intel Corporation leader with 20+ years of service, I love building things. Teams. Factories. Organizations. People. I believe in continual improvement, not only of ourselves, but of the people around us, the work that we do and the environment in which we do it. I've lived and worked in 3 countries and explored countless others and believe in the fundamental goodness of people and our ability as a human race to overcome any obstacle or challenge. An Intel Corporation leader with 20+ years of service, I love building things. Teams. Factories. Organizations. People. I believe in continual improvement, not only of ourselves, but of the people around us, the work that we do and the environment in which we do it. I've lived and worked in 3 countries and explored countless others and believe in the fundamental goodness of people and our ability as a human race to overcome any obstacle or challenge. Experience Human Resource Manager Intel Corporation March 2012  – Present (3 years 6 months) Hillsboro, OR Back to headquarters! I now manage an HR Business Partner team based in Oregon. We focus on Organizational Assessment, Complex Change and Transition Management, Leader Development and Leadership Pipeline Development and Strategic Workforce Planning. We work closely with other Business HR teams focusing on Internal Consulting and Employee Engagement, and often work on teams with Intel's Talent Organization, Compensation and Development Organization, and the Executive Development Team. Director, Vietnam Human Resources, Intel Corporation April 2009  –  March 2012  (3 years) Ho Chi Minh City, Vietnam Reporting to Regional Managing Director of Human Resources, Responsible for all aspects of Human Resources for Intel's operations in Vietnam including a greenfield factory startup of the company's largest assembly and test facility on the planet. Director, Chengdu, PRC Human Resources Intel Corporation October 2007  –  March 2009  (1 year 6 months) Chengdu, Sichuan, China Reporting to PRC Human Resources Director, responsible for all aspects of Human Resources at Intel's Chengdu site including the startup of a second factory at the site and doubling the site headcount in 15 months. Also led Sichuan Earthquake Recovery following the 8.0 magnitude earthquake that occured ~50 miles from Intel and received Intel's highest level of internal recognition for the work. Human Resources Manager, Research and Development Intel Corporation January 2004  –  October 2007  (3 years 10 months) Reporting to the Manufacturing and Technology Development HR Manager, responsible for all aspects of Human Resource Management for an Arizona, Malaysia and China based R&D group. Senior Recruiter Intel Corporation 2000  –  2004  (4 years) Chandler, AZ Campus Recruiting Manager/ Business Recruiting Consultant- search, screening & selection of top University talent at Tier 1 and Tier 2 MBA schools throughout the US, as well as search, screening & selection of top PhD talent from leading research universities. Operations Manager Intel Corporation 1999  –  2000  (1 year) Chandler, AZ I supervised teams of 15-30 Manufacturing and Test Technicians in a 24*7 wafer fabrication environment including Test, Surface Mount and Lithography. I was responsible for all aspects of safety, quality and operations excellence for my team and functional area Shift Coordinator/Shift Manager Intel Corporation 1994  –  1998  (4 years) Chandler, AZ I was responsible for managing teams of 20-60 Manufacturing Technicians in a 24x7 Electronics Assembly and Test Factory Environment including the Safety, Quality and Operational Excellence of my team and functional area. Manufacturing Technician Intel Corporation 1992  –  1994  (2 years) Chandler, AZ Responsible for the safe, high-quality assembly of Intel Products on the factory floor. Human Resource Manager Intel Corporation March 2012  – Present (3 years 6 months) Hillsboro, OR Back to headquarters! I now manage an HR Business Partner team based in Oregon. We focus on Organizational Assessment, Complex Change and Transition Management, Leader Development and Leadership Pipeline Development and Strategic Workforce Planning. We work closely with other Business HR teams focusing on Internal Consulting and Employee Engagement, and often work on teams with Intel's Talent Organization, Compensation and Development Organization, and the Executive Development Team. Human Resource Manager Intel Corporation March 2012  – Present (3 years 6 months) Hillsboro, OR Back to headquarters! I now manage an HR Business Partner team based in Oregon. We focus on Organizational Assessment, Complex Change and Transition Management, Leader Development and Leadership Pipeline Development and Strategic Workforce Planning. We work closely with other Business HR teams focusing on Internal Consulting and Employee Engagement, and often work on teams with Intel's Talent Organization, Compensation and Development Organization, and the Executive Development Team. Director, Vietnam Human Resources, Intel Corporation April 2009  –  March 2012  (3 years) Ho Chi Minh City, Vietnam Reporting to Regional Managing Director of Human Resources, Responsible for all aspects of Human Resources for Intel's operations in Vietnam including a greenfield factory startup of the company's largest assembly and test facility on the planet. Director, Vietnam Human Resources, Intel Corporation April 2009  –  March 2012  (3 years) Ho Chi Minh City, Vietnam Reporting to Regional Managing Director of Human Resources, Responsible for all aspects of Human Resources for Intel's operations in Vietnam including a greenfield factory startup of the company's largest assembly and test facility on the planet. Director, Chengdu, PRC Human Resources Intel Corporation October 2007  –  March 2009  (1 year 6 months) Chengdu, Sichuan, China Reporting to PRC Human Resources Director, responsible for all aspects of Human Resources at Intel's Chengdu site including the startup of a second factory at the site and doubling the site headcount in 15 months. Also led Sichuan Earthquake Recovery following the 8.0 magnitude earthquake that occured ~50 miles from Intel and received Intel's highest level of internal recognition for the work. Director, Chengdu, PRC Human Resources Intel Corporation October 2007  –  March 2009  (1 year 6 months) Chengdu, Sichuan, China Reporting to PRC Human Resources Director, responsible for all aspects of Human Resources at Intel's Chengdu site including the startup of a second factory at the site and doubling the site headcount in 15 months. Also led Sichuan Earthquake Recovery following the 8.0 magnitude earthquake that occured ~50 miles from Intel and received Intel's highest level of internal recognition for the work. Human Resources Manager, Research and Development Intel Corporation January 2004  –  October 2007  (3 years 10 months) Reporting to the Manufacturing and Technology Development HR Manager, responsible for all aspects of Human Resource Management for an Arizona, Malaysia and China based R&D group. Human Resources Manager, Research and Development Intel Corporation January 2004  –  October 2007  (3 years 10 months) Reporting to the Manufacturing and Technology Development HR Manager, responsible for all aspects of Human Resource Management for an Arizona, Malaysia and China based R&D group. Senior Recruiter Intel Corporation 2000  –  2004  (4 years) Chandler, AZ Campus Recruiting Manager/ Business Recruiting Consultant- search, screening & selection of top University talent at Tier 1 and Tier 2 MBA schools throughout the US, as well as search, screening & selection of top PhD talent from leading research universities. Senior Recruiter Intel Corporation 2000  –  2004  (4 years) Chandler, AZ Campus Recruiting Manager/ Business Recruiting Consultant- search, screening & selection of top University talent at Tier 1 and Tier 2 MBA schools throughout the US, as well as search, screening & selection of top PhD talent from leading research universities. Operations Manager Intel Corporation 1999  –  2000  (1 year) Chandler, AZ I supervised teams of 15-30 Manufacturing and Test Technicians in a 24*7 wafer fabrication environment including Test, Surface Mount and Lithography. I was responsible for all aspects of safety, quality and operations excellence for my team and functional area Operations Manager Intel Corporation 1999  –  2000  (1 year) Chandler, AZ I supervised teams of 15-30 Manufacturing and Test Technicians in a 24*7 wafer fabrication environment including Test, Surface Mount and Lithography. I was responsible for all aspects of safety, quality and operations excellence for my team and functional area Shift Coordinator/Shift Manager Intel Corporation 1994  –  1998  (4 years) Chandler, AZ I was responsible for managing teams of 20-60 Manufacturing Technicians in a 24x7 Electronics Assembly and Test Factory Environment including the Safety, Quality and Operational Excellence of my team and functional area. Shift Coordinator/Shift Manager Intel Corporation 1994  –  1998  (4 years) Chandler, AZ I was responsible for managing teams of 20-60 Manufacturing Technicians in a 24x7 Electronics Assembly and Test Factory Environment including the Safety, Quality and Operational Excellence of my team and functional area. Manufacturing Technician Intel Corporation 1992  –  1994  (2 years) Chandler, AZ Responsible for the safe, high-quality assembly of Intel Products on the factory floor. Manufacturing Technician Intel Corporation 1992  –  1994  (2 years) Chandler, AZ Responsible for the safe, high-quality assembly of Intel Products on the factory floor. Languages Spanish Limited working proficiency Chinese Elementary proficiency Spanish Limited working proficiency Chinese Elementary proficiency Spanish Limited working proficiency Chinese Elementary proficiency Limited working proficiency Elementary proficiency Skills Workforce Planning Talent Management Employee Relations Performance Management Intel Employee Engagement Change Management Coaching Manufacturing Employee Recognition Employment Law Deferred Compensation HR Consulting Management Consulting Cultural Diversity HRIS Labor Relations College Recruiting Onboarding Talent Acquisition Partnering Public Speaking Writing Terminations Investigation Performance Appraisal Safety Management Corporate Culture Diversity Strategy Leadership Business Strategy Global Management Organizational... Organizational... Leadership Development Compensation & Benefit Workforce Development Management Workforce Management Operations Management Employee Management Employment Contracts Global Operations Global Mobility Greater China China Manufacturing Human Resources Employee Benefits Training Facilitation Hiring See 35+     See less Skills  Workforce Planning Talent Management Employee Relations Performance Management Intel Employee Engagement Change Management Coaching Manufacturing Employee Recognition Employment Law Deferred Compensation HR Consulting Management Consulting Cultural Diversity HRIS Labor Relations College Recruiting Onboarding Talent Acquisition Partnering Public Speaking Writing Terminations Investigation Performance Appraisal Safety Management Corporate Culture Diversity Strategy Leadership Business Strategy Global Management Organizational... Organizational... Leadership Development Compensation & Benefit Workforce Development Management Workforce Management Operations Management Employee Management Employment Contracts Global Operations Global Mobility Greater China China Manufacturing Human Resources Employee Benefits Training Facilitation Hiring See 35+     See less Workforce Planning Talent Management Employee Relations Performance Management Intel Employee Engagement Change Management Coaching Manufacturing Employee Recognition Employment Law Deferred Compensation HR Consulting Management Consulting Cultural Diversity HRIS Labor Relations College Recruiting Onboarding Talent Acquisition Partnering Public Speaking Writing Terminations Investigation Performance Appraisal Safety Management Corporate Culture Diversity Strategy Leadership Business Strategy Global Management Organizational... Organizational... Leadership Development Compensation & Benefit Workforce Development Management Workforce Management Operations Management Employee Management Employment Contracts Global Operations Global Mobility Greater China China Manufacturing Human Resources Employee Benefits Training Facilitation Hiring See 35+     See less Workforce Planning Talent Management Employee Relations Performance Management Intel Employee Engagement Change Management Coaching Manufacturing Employee Recognition Employment Law Deferred Compensation HR Consulting Management Consulting Cultural Diversity HRIS Labor Relations College Recruiting Onboarding Talent Acquisition Partnering Public Speaking Writing Terminations Investigation Performance Appraisal Safety Management Corporate Culture Diversity Strategy Leadership Business Strategy Global Management Organizational... Organizational... Leadership Development Compensation & Benefit Workforce Development Management Workforce Management Operations Management Employee Management Employment Contracts Global Operations Global Mobility Greater China China Manufacturing Human Resources Employee Benefits Training Facilitation Hiring See 35+     See less Education University of Phoenix Master of Organizational Management,  HR , Management, Business 1998  – 1999 Organizational Managent. A blend of Organizational Development/HR and traditional MBA University of Phoenix Master of Organizational Management,  HR , Management, Business 1998  – 1999 Organizational Managent. A blend of Organizational Development/HR and traditional MBA University of Phoenix Master of Organizational Management,  HR , Management, Business 1998  – 1999 Organizational Managent. A blend of Organizational Development/HR and traditional MBA University of Phoenix Master of Organizational Management,  HR , Management, Business 1998  – 1999 Organizational Managent. A blend of Organizational Development/HR and traditional MBA ", "Languages German German German Skills Cross-functional Team... Loyalty Marketing Channel Vendor Relationships Acquisition Integration Event Management Program Management Human Resources Business Operations Strategic Partnerships Competitive Analysis Product Management Product Marketing Strategy Organizational... Leadership Integration Marketing Communications CRM Training Project Management Channel Partners Marketing Multi-channel Marketing Go-to-market Strategy Strategic Planning New Business Development Data Center Intel Leadership Development Sales Business Alliances Mergers & Acquisitions Mobile Devices Business Development SaaS Enterprise Software Product Launch Partner Management Demand Generation Cloud Computing Management See 27+     See less Skills  Cross-functional Team... Loyalty Marketing Channel Vendor Relationships Acquisition Integration Event Management Program Management Human Resources Business Operations Strategic Partnerships Competitive Analysis Product Management Product Marketing Strategy Organizational... Leadership Integration Marketing Communications CRM Training Project Management Channel Partners Marketing Multi-channel Marketing Go-to-market Strategy Strategic Planning New Business Development Data Center Intel Leadership Development Sales Business Alliances Mergers & Acquisitions Mobile Devices Business Development SaaS Enterprise Software Product Launch Partner Management Demand Generation Cloud Computing Management See 27+     See less Cross-functional Team... Loyalty Marketing Channel Vendor Relationships Acquisition Integration Event Management Program Management Human Resources Business Operations Strategic Partnerships Competitive Analysis Product Management Product Marketing Strategy Organizational... Leadership Integration Marketing Communications CRM Training Project Management Channel Partners Marketing Multi-channel Marketing Go-to-market Strategy Strategic Planning New Business Development Data Center Intel Leadership Development Sales Business Alliances Mergers & Acquisitions Mobile Devices Business Development SaaS Enterprise Software Product Launch Partner Management Demand Generation Cloud Computing Management See 27+     See less Cross-functional Team... Loyalty Marketing Channel Vendor Relationships Acquisition Integration Event Management Program Management Human Resources Business Operations Strategic Partnerships Competitive Analysis Product Management Product Marketing Strategy Organizational... Leadership Integration Marketing Communications CRM Training Project Management Channel Partners Marketing Multi-channel Marketing Go-to-market Strategy Strategic Planning New Business Development Data Center Intel Leadership Development Sales Business Alliances Mergers & Acquisitions Mobile Devices Business Development SaaS Enterprise Software Product Launch Partner Management Demand Generation Cloud Computing Management See 27+     See less ", "Experience Human Resources Intel Corporation Human Resources Intel Corporation Human Resources Intel Corporation ", "Summary - About three years rich experience in Human Resource. ----Management covering:  \n-Organizational Development initiatives, Succession planning, -Capacity building \n-Talent Management: Acquisition, Development & Retention \n-Performance Management System \n-Implemented Employee Engagement initiatives \n-Established HR function and processes, Continuous -improvement \n-Instrumental in implementation of Corporate Objectives during Change Management initiatives, strategic separation, mergers & acquisitions. \n-Worked in CMM, ISO, BS-7799 (ISO-27001) environment. \n-Experience in International & Offshore recruitments at all levels of IT & Functional professionals Specialties:IT tools usage - PeopleSoft, SAP, Oracle Applications, IBM Lotus Notes, MS Office (Word, Excel and PowerPoint, Outlook), Documentum . \nProgramming language - .NET,C#,SQL,XML,Java,C \nElementary knowledge of French and German Summary - About three years rich experience in Human Resource. ----Management covering:  \n-Organizational Development initiatives, Succession planning, -Capacity building \n-Talent Management: Acquisition, Development & Retention \n-Performance Management System \n-Implemented Employee Engagement initiatives \n-Established HR function and processes, Continuous -improvement \n-Instrumental in implementation of Corporate Objectives during Change Management initiatives, strategic separation, mergers & acquisitions. \n-Worked in CMM, ISO, BS-7799 (ISO-27001) environment. \n-Experience in International & Offshore recruitments at all levels of IT & Functional professionals Specialties:IT tools usage - PeopleSoft, SAP, Oracle Applications, IBM Lotus Notes, MS Office (Word, Excel and PowerPoint, Outlook), Documentum . \nProgramming language - .NET,C#,SQL,XML,Java,C \nElementary knowledge of French and German - About three years rich experience in Human Resource. ----Management covering:  \n-Organizational Development initiatives, Succession planning, -Capacity building \n-Talent Management: Acquisition, Development & Retention \n-Performance Management System \n-Implemented Employee Engagement initiatives \n-Established HR function and processes, Continuous -improvement \n-Instrumental in implementation of Corporate Objectives during Change Management initiatives, strategic separation, mergers & acquisitions. \n-Worked in CMM, ISO, BS-7799 (ISO-27001) environment. \n-Experience in International & Offshore recruitments at all levels of IT & Functional professionals Specialties:IT tools usage - PeopleSoft, SAP, Oracle Applications, IBM Lotus Notes, MS Office (Word, Excel and PowerPoint, Outlook), Documentum . \nProgramming language - .NET,C#,SQL,XML,Java,C \nElementary knowledge of French and German - About three years rich experience in Human Resource. ----Management covering:  \n-Organizational Development initiatives, Succession planning, -Capacity building \n-Talent Management: Acquisition, Development & Retention \n-Performance Management System \n-Implemented Employee Engagement initiatives \n-Established HR function and processes, Continuous -improvement \n-Instrumental in implementation of Corporate Objectives during Change Management initiatives, strategic separation, mergers & acquisitions. \n-Worked in CMM, ISO, BS-7799 (ISO-27001) environment. \n-Experience in International & Offshore recruitments at all levels of IT & Functional professionals Specialties:IT tools usage - PeopleSoft, SAP, Oracle Applications, IBM Lotus Notes, MS Office (Word, Excel and PowerPoint, Outlook), Documentum . \nProgramming language - .NET,C#,SQL,XML,Java,C \nElementary knowledge of French and German Experience Associate Director Human Resources Intel Corporation April 2011  – Present (4 years 5 months) Santa clara,CA Human Resource Manager Microsoft Inc (Live) July 2009  –  March 2011  (1 year 9 months) Greater Seattle Area Associate HR Hewlett-Packard August 2008  –  May 2009  (10 months) california Area Associate Director Human Resources Intel Corporation April 2011  – Present (4 years 5 months) Santa clara,CA Associate Director Human Resources Intel Corporation April 2011  – Present (4 years 5 months) Santa clara,CA Human Resource Manager Microsoft Inc (Live) July 2009  –  March 2011  (1 year 9 months) Greater Seattle Area Human Resource Manager Microsoft Inc (Live) July 2009  –  March 2011  (1 year 9 months) Greater Seattle Area Associate HR Hewlett-Packard August 2008  –  May 2009  (10 months) california Area Associate HR Hewlett-Packard August 2008  –  May 2009  (10 months) california Area Education Columbia Business School MBA,  Human Resource and Management 2006  – 2008 California Institute of Technology BS,  information Technology Ryan international school gurgaon (India) Columbia Business School MBA,  Human Resource and Management 2006  – 2008 Columbia Business School MBA,  Human Resource and Management 2006  – 2008 Columbia Business School MBA,  Human Resource and Management 2006  – 2008 California Institute of Technology BS,  information Technology California Institute of Technology BS,  information Technology California Institute of Technology BS,  information Technology Ryan international school gurgaon (India) Ryan international school gurgaon (India) Ryan international school gurgaon (India) ", "Experience Bachelor Student Intel Corporation October 2014  – Present (11 months) Costa Rica Human Resources Intel Corporation October 2011  – Present (3 years 11 months) Costa Rica Bachelor Student Intel Corporation October 2014  – Present (11 months) Costa Rica Bachelor Student Intel Corporation October 2014  – Present (11 months) Costa Rica Human Resources Intel Corporation October 2011  – Present (3 years 11 months) Costa Rica Human Resources Intel Corporation October 2011  – Present (3 years 11 months) Costa Rica Skills Microsoft Office Microsoft Excel Microsoft Word Research PowerPoint Databases Outlook Skills  Microsoft Office Microsoft Excel Microsoft Word Research PowerPoint Databases Outlook Microsoft Office Microsoft Excel Microsoft Word Research PowerPoint Databases Outlook Microsoft Office Microsoft Excel Microsoft Word Research PowerPoint Databases Outlook Education Universidad 'Santa Lucía' Bachelor’s Degree,  Business Administration and Management , General 2011  – 2015 Universidad 'Santa Lucía' Bachelor’s Degree,  Business Administration and Management , General 2011  – 2015 Universidad 'Santa Lucía' Bachelor’s Degree,  Business Administration and Management , General 2011  – 2015 Universidad 'Santa Lucía' Bachelor’s Degree,  Business Administration and Management , General 2011  – 2015 ", "Skills Organizational... Human Resources Talent Acquisition Workforce Planning Talent Management Employee Relations Succession Planning Performance Management Employee Engagement Organizational Design Organizational... Recruiting Change Management Employer Branding Skills  Organizational... Human Resources Talent Acquisition Workforce Planning Talent Management Employee Relations Succession Planning Performance Management Employee Engagement Organizational Design Organizational... Recruiting Change Management Employer Branding Organizational... Human Resources Talent Acquisition Workforce Planning Talent Management Employee Relations Succession Planning Performance Management Employee Engagement Organizational Design Organizational... Recruiting Change Management Employer Branding Organizational... Human Resources Talent Acquisition Workforce Planning Talent Management Employee Relations Succession Planning Performance Management Employee Engagement Organizational Design Organizational... Recruiting Change Management Employer Branding ", "Experience Human Resources Intel Corporation Human Resources Intel Corporation Human Resources Intel Corporation ", "Skills Employee Relations Labor Relations Performance Management Succession Planning Sourcing Talent Acquisition Transition Management Talent Management Hiring Human Resources Leadership Business Development Coaching Conflict Resolution Employee Training HR Policies Employment Law Interviews Leadership Development Onboarding Payroll Policy Change Management College Recruiting Management Project Management Project Planning Program Management Recruiting Retail Team Management See 16+     See less Skills  Employee Relations Labor Relations Performance Management Succession Planning Sourcing Talent Acquisition Transition Management Talent Management Hiring Human Resources Leadership Business Development Coaching Conflict Resolution Employee Training HR Policies Employment Law Interviews Leadership Development Onboarding Payroll Policy Change Management College Recruiting Management Project Management Project Planning Program Management Recruiting Retail Team Management See 16+     See less Employee Relations Labor Relations Performance Management Succession Planning Sourcing Talent Acquisition Transition Management Talent Management Hiring Human Resources Leadership Business Development Coaching Conflict Resolution Employee Training HR Policies Employment Law Interviews Leadership Development Onboarding Payroll Policy Change Management College Recruiting Management Project Management Project Planning Program Management Recruiting Retail Team Management See 16+     See less Employee Relations Labor Relations Performance Management Succession Planning Sourcing Talent Acquisition Transition Management Talent Management Hiring Human Resources Leadership Business Development Coaching Conflict Resolution Employee Training HR Policies Employment Law Interviews Leadership Development Onboarding Payroll Policy Change Management College Recruiting Management Project Management Project Planning Program Management Recruiting Retail Team Management See 16+     See less Honors & Awards ", "Experience Human Resources Intel Corporation Human Resources Intel Corporation Human Resources Intel Corporation Skills Microsoft Office Microsoft Excel Research Leadership Recruiting Management Training Human Resources Skills  Microsoft Office Microsoft Excel Research Leadership Recruiting Management Training Human Resources Microsoft Office Microsoft Excel Research Leadership Recruiting Management Training Human Resources Microsoft Office Microsoft Excel Research Leadership Recruiting Management Training Human Resources ", "Languages English Native or bilingual proficiency German Limited working proficiency Dutch Elementary proficiency English Native or bilingual proficiency German Limited working proficiency Dutch Elementary proficiency English Native or bilingual proficiency German Limited working proficiency Dutch Elementary proficiency Native or bilingual proficiency Limited working proficiency Elementary proficiency Skills Microsoft Office Problem Solving Project Management Leadership Development Training Public Speaking HTML PowerPoint Skills  Microsoft Office Problem Solving Project Management Leadership Development Training Public Speaking HTML PowerPoint Microsoft Office Problem Solving Project Management Leadership Development Training Public Speaking HTML PowerPoint Microsoft Office Problem Solving Project Management Leadership Development Training Public Speaking HTML PowerPoint ", "Experience Human Resources Intel Corporation Human Resources Intel Corporation Human Resources Intel Corporation ", "Experience human resources Intel Corporation human resources Intel Corporation human resources Intel Corporation ", "Experience Human Resources Intel Corporation November 2008  – Present (6 years 10 months) Account executive Universal Studios January 2004  –  October 2008  (4 years 10 months) Human Resources Intel Corporation November 2008  – Present (6 years 10 months) Human Resources Intel Corporation November 2008  – Present (6 years 10 months) Account executive Universal Studios January 2004  –  October 2008  (4 years 10 months) Account executive Universal Studios January 2004  –  October 2008  (4 years 10 months) Education University of California, Berkeley Master of Business Administration (M.B.A.),  Human Resources Management and Services 1999  – 2003 University of Southern California Bachelor's Degree,  Human Resources 1989  – 1993 University of California, Berkeley Master of Business Administration (M.B.A.),  Human Resources Management and Services 1999  – 2003 University of California, Berkeley Master of Business Administration (M.B.A.),  Human Resources Management and Services 1999  – 2003 University of California, Berkeley Master of Business Administration (M.B.A.),  Human Resources Management and Services 1999  – 2003 University of Southern California Bachelor's Degree,  Human Resources 1989  – 1993 University of Southern California Bachelor's Degree,  Human Resources 1989  – 1993 University of Southern California Bachelor's Degree,  Human Resources 1989  – 1993 "]}