{"position": "Human Resources Manager", "company": "Intel Corporation", "profiles": ["Skills Talent Management Cross-functional Team... Human Resources Finance Process Improvement College Recruiting Intel Onboarding Program Management Supply Chain Forecasting Recruiting Employee Learning &... Goal Oriented Management Consulting Employee On-Boarding Strategy Analysis Start-ups Leadership Career Development Performance Coaching Analytical Problem... Critical Thinking Action Oriented Results Orientation Result Oriented Competency Based... Communications... Diversity & Inclusion Stock Market Real Estate Investor Coaching Employee Recognition Strategic Planning See 21+     See less Skills  Talent Management Cross-functional Team... Human Resources Finance Process Improvement College Recruiting Intel Onboarding Program Management Supply Chain Forecasting Recruiting Employee Learning &... Goal Oriented Management Consulting Employee On-Boarding Strategy Analysis Start-ups Leadership Career Development Performance Coaching Analytical Problem... Critical Thinking Action Oriented Results Orientation Result Oriented Competency Based... Communications... Diversity & Inclusion Stock Market Real Estate Investor Coaching Employee Recognition Strategic Planning See 21+     See less Talent Management Cross-functional Team... Human Resources Finance Process Improvement College Recruiting Intel Onboarding Program Management Supply Chain Forecasting Recruiting Employee Learning &... Goal Oriented Management Consulting Employee On-Boarding Strategy Analysis Start-ups Leadership Career Development Performance Coaching Analytical Problem... Critical Thinking Action Oriented Results Orientation Result Oriented Competency Based... Communications... Diversity & Inclusion Stock Market Real Estate Investor Coaching Employee Recognition Strategic Planning See 21+     See less Talent Management Cross-functional Team... Human Resources Finance Process Improvement College Recruiting Intel Onboarding Program Management Supply Chain Forecasting Recruiting Employee Learning &... Goal Oriented Management Consulting Employee On-Boarding Strategy Analysis Start-ups Leadership Career Development Performance Coaching Analytical Problem... Critical Thinking Action Oriented Results Orientation Result Oriented Competency Based... Communications... Diversity & Inclusion Stock Market Real Estate Investor Coaching Employee Recognition Strategic Planning See 21+     See less ", "Skills Human Resources Workforce Planning Talent Management Succession Planning Performance Management Employee Relations Employee Engagement Organizational... Onboarding Talent Acquisition Skills  Human Resources Workforce Planning Talent Management Succession Planning Performance Management Employee Relations Employee Engagement Organizational... Onboarding Talent Acquisition Human Resources Workforce Planning Talent Management Succession Planning Performance Management Employee Relations Employee Engagement Organizational... Onboarding Talent Acquisition Human Resources Workforce Planning Talent Management Succession Planning Performance Management Employee Relations Employee Engagement Organizational... Onboarding Talent Acquisition ", "Experience Human Resources Manager Intel Corporation Human Resources Manager Intel Corporation Human Resources Manager Intel Corporation ", "Experience Human Resources Manager Intel Corporation Human Resources Manager Intel Corporation Human Resources Manager Intel Corporation Skills Workforce Planning Succession Planning Talent Management Organizational... HR Policies Culture Change Employee Engagement HR Consulting Performance Management Deferred Compensation Personnel Management HR Transformation Management Development Career Development Organizational Design Skills  Workforce Planning Succession Planning Talent Management Organizational... HR Policies Culture Change Employee Engagement HR Consulting Performance Management Deferred Compensation Personnel Management HR Transformation Management Development Career Development Organizational Design Workforce Planning Succession Planning Talent Management Organizational... HR Policies Culture Change Employee Engagement HR Consulting Performance Management Deferred Compensation Personnel Management HR Transformation Management Development Career Development Organizational Design Workforce Planning Succession Planning Talent Management Organizational... HR Policies Culture Change Employee Engagement HR Consulting Performance Management Deferred Compensation Personnel Management HR Transformation Management Development Career Development Organizational Design ", "Experience Greater European Region - HR Business Engagement Manager Intel Corporation July 2013  – Present (2 years 2 months) Swindon, United Kingdom Executive level strategic business engagement manager directly embedded in the EMEA business leadership team. Ownership for HR service contracting with the regional executive leaders, leader development and application of HR resources to enable organization performance across the customer base. Drive organization transformation through concise design and deployment of HR interventions focused on critical talent enablers. Organization Consultant - Human Resources Intel Corporation April 2012  –  June 2013  (1 year 3 months) Swindon, United Kingdom Global role involving the analysis of company strategic initiatives, design and deployment of talent interventions through multiple HR solutions and resources to drive company-level transformation initiatives. Human Resources Manager Intel Corporation January 2010  –  April 2012  (2 years 4 months) United Kingdom Supply Chain Contracts, Divestitures, New Business negotiations Intel Corporation January 2008  –  January 2010  (2 years 1 month) Greater European Region - HR Business Engagement Manager Intel Corporation July 2013  – Present (2 years 2 months) Swindon, United Kingdom Executive level strategic business engagement manager directly embedded in the EMEA business leadership team. Ownership for HR service contracting with the regional executive leaders, leader development and application of HR resources to enable organization performance across the customer base. Drive organization transformation through concise design and deployment of HR interventions focused on critical talent enablers. Greater European Region - HR Business Engagement Manager Intel Corporation July 2013  – Present (2 years 2 months) Swindon, United Kingdom Executive level strategic business engagement manager directly embedded in the EMEA business leadership team. Ownership for HR service contracting with the regional executive leaders, leader development and application of HR resources to enable organization performance across the customer base. Drive organization transformation through concise design and deployment of HR interventions focused on critical talent enablers. Organization Consultant - Human Resources Intel Corporation April 2012  –  June 2013  (1 year 3 months) Swindon, United Kingdom Global role involving the analysis of company strategic initiatives, design and deployment of talent interventions through multiple HR solutions and resources to drive company-level transformation initiatives. Organization Consultant - Human Resources Intel Corporation April 2012  –  June 2013  (1 year 3 months) Swindon, United Kingdom Global role involving the analysis of company strategic initiatives, design and deployment of talent interventions through multiple HR solutions and resources to drive company-level transformation initiatives. Human Resources Manager Intel Corporation January 2010  –  April 2012  (2 years 4 months) United Kingdom Human Resources Manager Intel Corporation January 2010  –  April 2012  (2 years 4 months) United Kingdom Supply Chain Contracts, Divestitures, New Business negotiations Intel Corporation January 2008  –  January 2010  (2 years 1 month) Supply Chain Contracts, Divestitures, New Business negotiations Intel Corporation January 2008  –  January 2010  (2 years 1 month) Languages Spanish Spanish Spanish Skills Negotiation Human Resources Supply Chain Cross-functional Team... Management Program Management Product Management Business Strategy Semiconductors Performance Management Change Management Product Marketing Strategic Partnerships Skills  Negotiation Human Resources Supply Chain Cross-functional Team... Management Program Management Product Management Business Strategy Semiconductors Performance Management Change Management Product Marketing Strategic Partnerships Negotiation Human Resources Supply Chain Cross-functional Team... Management Program Management Product Management Business Strategy Semiconductors Performance Management Change Management Product Marketing Strategic Partnerships Negotiation Human Resources Supply Chain Cross-functional Team... Management Program Management Product Management Business Strategy Semiconductors Performance Management Change Management Product Marketing Strategic Partnerships Education The Open University MBA,  Business Stuidies 2008  – 2012 University of the West of England Computing for Real Time Systems,  Information Technology , Bsc Hons 1992  – 1996 The Open University MBA,  Business Stuidies 2008  – 2012 The Open University MBA,  Business Stuidies 2008  – 2012 The Open University MBA,  Business Stuidies 2008  – 2012 University of the West of England Computing for Real Time Systems,  Information Technology , Bsc Hons 1992  – 1996 University of the West of England Computing for Real Time Systems,  Information Technology , Bsc Hons 1992  – 1996 University of the West of England Computing for Real Time Systems,  Information Technology , Bsc Hons 1992  – 1996 ", "Experience Independent Writing and Editing Professional Self Employed March 2007  – Present (8 years 6 months) Human Resources Manager Intel Corporation August 2000  –  July 2006  (6 years) Human Resources Director Dolch Computers, Inc. March 1994  –  April 2000  (6 years 2 months) Independent Writing and Editing Professional Self Employed March 2007  – Present (8 years 6 months) Independent Writing and Editing Professional Self Employed March 2007  – Present (8 years 6 months) Human Resources Manager Intel Corporation August 2000  –  July 2006  (6 years) Human Resources Manager Intel Corporation August 2000  –  July 2006  (6 years) Human Resources Director Dolch Computers, Inc. March 1994  –  April 2000  (6 years 2 months) Human Resources Director Dolch Computers, Inc. March 1994  –  April 2000  (6 years 2 months) Skills Editing Public Speaking Proofreading Microsoft Office Event Planning Community Outreach Customer Service Administrative... Social Media Teaching Social Networking Fundraising Research Higher Education Volunteer Management Microsoft Word Nonprofits Outlook Marketing See 4+     See less Skills  Editing Public Speaking Proofreading Microsoft Office Event Planning Community Outreach Customer Service Administrative... Social Media Teaching Social Networking Fundraising Research Higher Education Volunteer Management Microsoft Word Nonprofits Outlook Marketing See 4+     See less Editing Public Speaking Proofreading Microsoft Office Event Planning Community Outreach Customer Service Administrative... Social Media Teaching Social Networking Fundraising Research Higher Education Volunteer Management Microsoft Word Nonprofits Outlook Marketing See 4+     See less Editing Public Speaking Proofreading Microsoft Office Event Planning Community Outreach Customer Service Administrative... Social Media Teaching Social Networking Fundraising Research Higher Education Volunteer Management Microsoft Word Nonprofits Outlook Marketing See 4+     See less Education Fresno Pacific University Bachelor of Arts,  English Communications San Jose State University Fresno Pacific University Bachelor of Arts,  English Communications Fresno Pacific University Bachelor of Arts,  English Communications Fresno Pacific University Bachelor of Arts,  English Communications San Jose State University San Jose State University San Jose State University ", "Skills Fitness Pilates Conditioning Strength Fitness Training Strength Training Group Exercise Personal Training Organizational... Lifestyle Nutritional Counseling Wellness Coaching Therapeutic Massage Yoga Skills  Fitness Pilates Conditioning Strength Fitness Training Strength Training Group Exercise Personal Training Organizational... Lifestyle Nutritional Counseling Wellness Coaching Therapeutic Massage Yoga Fitness Pilates Conditioning Strength Fitness Training Strength Training Group Exercise Personal Training Organizational... Lifestyle Nutritional Counseling Wellness Coaching Therapeutic Massage Yoga Fitness Pilates Conditioning Strength Fitness Training Strength Training Group Exercise Personal Training Organizational... Lifestyle Nutritional Counseling Wellness Coaching Therapeutic Massage Yoga ", "Summary A focused and highly driven Human Resources professional with more than 15 years of experience managing people, demonstrating leadership, developing organizations, and program management. I am consistently recognized for her leadership, vibrant interactive and personal style, her ability to effectively communicate, deliver rational solutions with velocity, and for her comprehensive business acumen.  Summary A focused and highly driven Human Resources professional with more than 15 years of experience managing people, demonstrating leadership, developing organizations, and program management. I am consistently recognized for her leadership, vibrant interactive and personal style, her ability to effectively communicate, deliver rational solutions with velocity, and for her comprehensive business acumen.  A focused and highly driven Human Resources professional with more than 15 years of experience managing people, demonstrating leadership, developing organizations, and program management. I am consistently recognized for her leadership, vibrant interactive and personal style, her ability to effectively communicate, deliver rational solutions with velocity, and for her comprehensive business acumen.  A focused and highly driven Human Resources professional with more than 15 years of experience managing people, demonstrating leadership, developing organizations, and program management. I am consistently recognized for her leadership, vibrant interactive and personal style, her ability to effectively communicate, deliver rational solutions with velocity, and for her comprehensive business acumen.  Experience Human Resources Manager Intel Corporation Global Retirement Program Office Manger Intel June 2000  – Present (15 years 3 months) Folsom Human Resources Manager Intel Corporation June 2000  – Present (15 years 3 months) Human Resources Manager Intel Corporation Human Resources Manager Intel Corporation Global Retirement Program Office Manger Intel June 2000  – Present (15 years 3 months) Folsom Global Retirement Program Office Manger Intel June 2000  – Present (15 years 3 months) Folsom Human Resources Manager Intel Corporation June 2000  – Present (15 years 3 months) Human Resources Manager Intel Corporation June 2000  – Present (15 years 3 months) Languages English English English Skills Project Management Talent Management Human Resources Program Management Vendor Management Organizational... Performance Management Employee Relations Management Process Improvement Cross-functional Team... Requirements Analysis HRIS Skills  Project Management Talent Management Human Resources Program Management Vendor Management Organizational... Performance Management Employee Relations Management Process Improvement Cross-functional Team... Requirements Analysis HRIS Project Management Talent Management Human Resources Program Management Vendor Management Organizational... Performance Management Employee Relations Management Process Improvement Cross-functional Team... Requirements Analysis HRIS Project Management Talent Management Human Resources Program Management Vendor Management Organizational... Performance Management Employee Relations Management Process Improvement Cross-functional Team... Requirements Analysis HRIS Education University of San Francisco Master's degree,  Organizational Development 2003  – 2005 National University Bachelor of Business Administration (BBA),  Human Resource Management 1998  – 2000 University of San Francisco Master's degree,  Organizational Development 2003  – 2005 University of San Francisco Master's degree,  Organizational Development 2003  – 2005 University of San Francisco Master's degree,  Organizational Development 2003  – 2005 National University Bachelor of Business Administration (BBA),  Human Resource Management 1998  – 2000 National University Bachelor of Business Administration (BBA),  Human Resource Management 1998  – 2000 National University Bachelor of Business Administration (BBA),  Human Resource Management 1998  – 2000 ", "Experience US Payroll Manager Intel Corporation July 2013  – Present (2 years 2 months) Costa Rica US Payroll Manager \nResponsible for US payroll processes for 50k employees. Managing an organization accountable for the payments, tracking and delivery of employee’s wages, deductions & legal requirements. Also, handling payments for relocation and foreign assignments worldwide. Manufacturing Supervisor Intel Corporation February 2011  –  June 2013  (2 years 5 months) Costa Rica Dec 2013 to June 2013  \nMFG Integration Senior Analyst \nResponsible for the setup of factory production strategy including analysis of: demand, materials, supply chain, modules maintenance and new products introduction. Analysis based on data trend and factory physics’ theory. Daily tracking of production progress and adjustments needed based on priorities & product indicators.  \n \nJune 2012 to Nov 2012  \nMFG Epoxy module Supervisor \nSupervisor of the Epoxy module under the assembly operation at the production floor. Responsible for the operation output, area health indicators and assembly integration. Scope includes daily tracking of output, ensuring safety and quality area indicators & managing a 15 people organization.  \n \nFeb 2011 to May 2012  \nManufacturing Systems Group Leader: \nUnder Manufacturing organization responsible for the group that controls direct & indirect materials, high value inventory, contingent workforce & several projects for the continuous improvement of MFG production operation Human Resources Manager Intel Corporation April 2009  –  May 2010  (1 year 2 months) Costa Rica May 2009 to March 2010 \nHuman Resources Transaction Center Manager: \nHR Service Center supplier manager responsible of tracking and ensuring high quality services from an outsourcing company. Scope includes contract management; indicators tracking, supplier scorecards and resolution of defect/complains among internal and external customers. Cost & Financial Engineering Analyst Intel Corporation September 2008  –  March 2009  (7 months) San Jose California Sept 2008 to March 2009 Intel Corporation \nIntel Headquarters Santa Clara, California \nCost & Financial Engineering Analyst:  \nInternational assignment at Intel’s D2 manufacturing plant (headquarters Silicon Valley), supporting finance construction needed activities for factory closure. \n \n2008 to Sept 2008 Intel Corporation \nComponentes Intel de Costa Rica, Belén, Heredia  \nCost & Financial Engineering Analyst:  \nResponsible of controls management for Latin American construction expansions, retrofits and new construction projects. Manage funds requests, analysis of investment, cost management, program budgeting, spends, liabilities and depreciation forecasts. Internal Controls Analyst Intel Corporation June 2004  –  September 2008  (4 years 4 months) Costa Rica 2007\tIntel Corporation\t \nComponentes Intel de Costa Rica, Belén, Heredia  \nHigh Value Inventory Finance Analyst:  \nManage risk assessments and high value inventory internal controls programs. Ensure periodic cycle counts observations and monthly documentation revision. Responsible for High Value Inventory Internal and External yearly audits.  \n \nJan 2005 - to Jan 2007\tIntel Corporation\t \nComponentes Intel de Costa Rica, Belén, Heredia  \nDirects and Indirect Materials Finance Analyst: \nManage Direct & Indirect materials Inventory. Ensure accurate reporting of plant production, non consumption, as well as consignment and Intel owned inventory balances. Responsible for reporting consolidations which guarantee General Ledger and Materials SAP system reconciliation.  \n \nJuly 2004 - to Dec 2004\tIntel Corporation\t \nComponentes Intel de Costa Rica, Belén, Heredia  \nCycle Count Finance Analyst Internship: \nInventory controls improvement and procedures/guidelines evaluation. Inventory controls audits, cycle count controls standardization across Intel virtual factories, communication and trainings campaigns development for manufacturing & engineering population and cost benefit development. Career Assistant Instituto Tecnologico de Costa Rica January 2003  –  June 2004  (1 year 6 months) Costa Rica 2003\tInstituto Tecnológico de Costa Rica (ITCR)  \nBusiness Administration career director assistant: \nSupport and assist Finance I, Finance II & Accountability II courses; Performed exams, homework and projects revisions. US Payroll Manager Intel Corporation July 2013  – Present (2 years 2 months) Costa Rica US Payroll Manager \nResponsible for US payroll processes for 50k employees. Managing an organization accountable for the payments, tracking and delivery of employee’s wages, deductions & legal requirements. Also, handling payments for relocation and foreign assignments worldwide. US Payroll Manager Intel Corporation July 2013  – Present (2 years 2 months) Costa Rica US Payroll Manager \nResponsible for US payroll processes for 50k employees. Managing an organization accountable for the payments, tracking and delivery of employee’s wages, deductions & legal requirements. Also, handling payments for relocation and foreign assignments worldwide. Manufacturing Supervisor Intel Corporation February 2011  –  June 2013  (2 years 5 months) Costa Rica Dec 2013 to June 2013  \nMFG Integration Senior Analyst \nResponsible for the setup of factory production strategy including analysis of: demand, materials, supply chain, modules maintenance and new products introduction. Analysis based on data trend and factory physics’ theory. Daily tracking of production progress and adjustments needed based on priorities & product indicators.  \n \nJune 2012 to Nov 2012  \nMFG Epoxy module Supervisor \nSupervisor of the Epoxy module under the assembly operation at the production floor. Responsible for the operation output, area health indicators and assembly integration. Scope includes daily tracking of output, ensuring safety and quality area indicators & managing a 15 people organization.  \n \nFeb 2011 to May 2012  \nManufacturing Systems Group Leader: \nUnder Manufacturing organization responsible for the group that controls direct & indirect materials, high value inventory, contingent workforce & several projects for the continuous improvement of MFG production operation Manufacturing Supervisor Intel Corporation February 2011  –  June 2013  (2 years 5 months) Costa Rica Dec 2013 to June 2013  \nMFG Integration Senior Analyst \nResponsible for the setup of factory production strategy including analysis of: demand, materials, supply chain, modules maintenance and new products introduction. Analysis based on data trend and factory physics’ theory. Daily tracking of production progress and adjustments needed based on priorities & product indicators.  \n \nJune 2012 to Nov 2012  \nMFG Epoxy module Supervisor \nSupervisor of the Epoxy module under the assembly operation at the production floor. Responsible for the operation output, area health indicators and assembly integration. Scope includes daily tracking of output, ensuring safety and quality area indicators & managing a 15 people organization.  \n \nFeb 2011 to May 2012  \nManufacturing Systems Group Leader: \nUnder Manufacturing organization responsible for the group that controls direct & indirect materials, high value inventory, contingent workforce & several projects for the continuous improvement of MFG production operation Human Resources Manager Intel Corporation April 2009  –  May 2010  (1 year 2 months) Costa Rica May 2009 to March 2010 \nHuman Resources Transaction Center Manager: \nHR Service Center supplier manager responsible of tracking and ensuring high quality services from an outsourcing company. Scope includes contract management; indicators tracking, supplier scorecards and resolution of defect/complains among internal and external customers. Human Resources Manager Intel Corporation April 2009  –  May 2010  (1 year 2 months) Costa Rica May 2009 to March 2010 \nHuman Resources Transaction Center Manager: \nHR Service Center supplier manager responsible of tracking and ensuring high quality services from an outsourcing company. Scope includes contract management; indicators tracking, supplier scorecards and resolution of defect/complains among internal and external customers. Cost & Financial Engineering Analyst Intel Corporation September 2008  –  March 2009  (7 months) San Jose California Sept 2008 to March 2009 Intel Corporation \nIntel Headquarters Santa Clara, California \nCost & Financial Engineering Analyst:  \nInternational assignment at Intel’s D2 manufacturing plant (headquarters Silicon Valley), supporting finance construction needed activities for factory closure. \n \n2008 to Sept 2008 Intel Corporation \nComponentes Intel de Costa Rica, Belén, Heredia  \nCost & Financial Engineering Analyst:  \nResponsible of controls management for Latin American construction expansions, retrofits and new construction projects. Manage funds requests, analysis of investment, cost management, program budgeting, spends, liabilities and depreciation forecasts. Cost & Financial Engineering Analyst Intel Corporation September 2008  –  March 2009  (7 months) San Jose California Sept 2008 to March 2009 Intel Corporation \nIntel Headquarters Santa Clara, California \nCost & Financial Engineering Analyst:  \nInternational assignment at Intel’s D2 manufacturing plant (headquarters Silicon Valley), supporting finance construction needed activities for factory closure. \n \n2008 to Sept 2008 Intel Corporation \nComponentes Intel de Costa Rica, Belén, Heredia  \nCost & Financial Engineering Analyst:  \nResponsible of controls management for Latin American construction expansions, retrofits and new construction projects. Manage funds requests, analysis of investment, cost management, program budgeting, spends, liabilities and depreciation forecasts. Internal Controls Analyst Intel Corporation June 2004  –  September 2008  (4 years 4 months) Costa Rica 2007\tIntel Corporation\t \nComponentes Intel de Costa Rica, Belén, Heredia  \nHigh Value Inventory Finance Analyst:  \nManage risk assessments and high value inventory internal controls programs. Ensure periodic cycle counts observations and monthly documentation revision. Responsible for High Value Inventory Internal and External yearly audits.  \n \nJan 2005 - to Jan 2007\tIntel Corporation\t \nComponentes Intel de Costa Rica, Belén, Heredia  \nDirects and Indirect Materials Finance Analyst: \nManage Direct & Indirect materials Inventory. Ensure accurate reporting of plant production, non consumption, as well as consignment and Intel owned inventory balances. Responsible for reporting consolidations which guarantee General Ledger and Materials SAP system reconciliation.  \n \nJuly 2004 - to Dec 2004\tIntel Corporation\t \nComponentes Intel de Costa Rica, Belén, Heredia  \nCycle Count Finance Analyst Internship: \nInventory controls improvement and procedures/guidelines evaluation. Inventory controls audits, cycle count controls standardization across Intel virtual factories, communication and trainings campaigns development for manufacturing & engineering population and cost benefit development. Internal Controls Analyst Intel Corporation June 2004  –  September 2008  (4 years 4 months) Costa Rica 2007\tIntel Corporation\t \nComponentes Intel de Costa Rica, Belén, Heredia  \nHigh Value Inventory Finance Analyst:  \nManage risk assessments and high value inventory internal controls programs. Ensure periodic cycle counts observations and monthly documentation revision. Responsible for High Value Inventory Internal and External yearly audits.  \n \nJan 2005 - to Jan 2007\tIntel Corporation\t \nComponentes Intel de Costa Rica, Belén, Heredia  \nDirects and Indirect Materials Finance Analyst: \nManage Direct & Indirect materials Inventory. Ensure accurate reporting of plant production, non consumption, as well as consignment and Intel owned inventory balances. Responsible for reporting consolidations which guarantee General Ledger and Materials SAP system reconciliation.  \n \nJuly 2004 - to Dec 2004\tIntel Corporation\t \nComponentes Intel de Costa Rica, Belén, Heredia  \nCycle Count Finance Analyst Internship: \nInventory controls improvement and procedures/guidelines evaluation. Inventory controls audits, cycle count controls standardization across Intel virtual factories, communication and trainings campaigns development for manufacturing & engineering population and cost benefit development. Career Assistant Instituto Tecnologico de Costa Rica January 2003  –  June 2004  (1 year 6 months) Costa Rica 2003\tInstituto Tecnológico de Costa Rica (ITCR)  \nBusiness Administration career director assistant: \nSupport and assist Finance I, Finance II & Accountability II courses; Performed exams, homework and projects revisions. Career Assistant Instituto Tecnologico de Costa Rica January 2003  –  June 2004  (1 year 6 months) Costa Rica 2003\tInstituto Tecnológico de Costa Rica (ITCR)  \nBusiness Administration career director assistant: \nSupport and assist Finance I, Finance II & Accountability II courses; Performed exams, homework and projects revisions. Skills Project management Presentation skills Leadership capabilities Strong managerial skills Team work oriented Process Improvement Financial Modeling Program Management Cross-functional Team... Semiconductors Project Management Manufacturing Change Management Skills  Project management Presentation skills Leadership capabilities Strong managerial skills Team work oriented Process Improvement Financial Modeling Program Management Cross-functional Team... Semiconductors Project Management Manufacturing Change Management Project management Presentation skills Leadership capabilities Strong managerial skills Team work oriented Process Improvement Financial Modeling Program Management Cross-functional Team... Semiconductors Project Management Manufacturing Change Management Project management Presentation skills Leadership capabilities Strong managerial skills Team work oriented Process Improvement Financial Modeling Program Management Cross-functional Team... Semiconductors Project Management Manufacturing Change Management Education Instituto de Estudios Empresariales Management Skills Enhancement Program,  Managerial Soft skills 2011  – 2012 2012 Instituto de Estudios Empresariales – Universidad de IPADE México  \nCampus Sabanilla Montes de Oca \nManagement Skills Enhancement Program Tecnológico de Costa Rica Business Administration 2001  – 2004 Instituto de Estudios Empresariales Management Skills Enhancement Program,  Managerial Soft skills 2011  – 2012 2012 Instituto de Estudios Empresariales – Universidad de IPADE México  \nCampus Sabanilla Montes de Oca \nManagement Skills Enhancement Program Instituto de Estudios Empresariales Management Skills Enhancement Program,  Managerial Soft skills 2011  – 2012 2012 Instituto de Estudios Empresariales – Universidad de IPADE México  \nCampus Sabanilla Montes de Oca \nManagement Skills Enhancement Program Instituto de Estudios Empresariales Management Skills Enhancement Program,  Managerial Soft skills 2011  – 2012 2012 Instituto de Estudios Empresariales – Universidad de IPADE México  \nCampus Sabanilla Montes de Oca \nManagement Skills Enhancement Program Tecnológico de Costa Rica Business Administration 2001  – 2004 Tecnológico de Costa Rica Business Administration 2001  – 2004 Tecnológico de Costa Rica Business Administration 2001  – 2004 ", "Skills Workforce Planning Succession Planning Talent Management Employee Engagement Organizational... Deferred Compensation Employee Relations Onboarding Organizational... Human Resources Performance Management Labor Relations Organizational Design Personnel Management HRIS College Recruiting Employer Branding Talent Acquisition Executive Pay HR Policies See 5+     See less Skills  Workforce Planning Succession Planning Talent Management Employee Engagement Organizational... Deferred Compensation Employee Relations Onboarding Organizational... Human Resources Performance Management Labor Relations Organizational Design Personnel Management HRIS College Recruiting Employer Branding Talent Acquisition Executive Pay HR Policies See 5+     See less Workforce Planning Succession Planning Talent Management Employee Engagement Organizational... Deferred Compensation Employee Relations Onboarding Organizational... Human Resources Performance Management Labor Relations Organizational Design Personnel Management HRIS College Recruiting Employer Branding Talent Acquisition Executive Pay HR Policies See 5+     See less Workforce Planning Succession Planning Talent Management Employee Engagement Organizational... Deferred Compensation Employee Relations Onboarding Organizational... Human Resources Performance Management Labor Relations Organizational Design Personnel Management HRIS College Recruiting Employer Branding Talent Acquisition Executive Pay HR Policies See 5+     See less ", "Skills Workforce Planning Talent Management Human Resources Succession Planning Onboarding Deferred Compensation Talent Acquisition Employee Engagement Performance Management Employee Relations HRIS Organizational Design College Recruiting Personnel Management Organizational... Organizational... See 1+     See less Skills  Workforce Planning Talent Management Human Resources Succession Planning Onboarding Deferred Compensation Talent Acquisition Employee Engagement Performance Management Employee Relations HRIS Organizational Design College Recruiting Personnel Management Organizational... Organizational... See 1+     See less Workforce Planning Talent Management Human Resources Succession Planning Onboarding Deferred Compensation Talent Acquisition Employee Engagement Performance Management Employee Relations HRIS Organizational Design College Recruiting Personnel Management Organizational... Organizational... See 1+     See less Workforce Planning Talent Management Human Resources Succession Planning Onboarding Deferred Compensation Talent Acquisition Employee Engagement Performance Management Employee Relations HRIS Organizational Design College Recruiting Personnel Management Organizational... Organizational... See 1+     See less ", "Summary >>Highly skilled and proven HR executive with hands on experience in key human resources functions supporting all business units in multiple countries. Strategic consultant skilled in building customer driven and business aligned HR organizations. Effective collaborator, communicator, change agent, and business partner. Ability to develop, implement, and direct innovative strategies that provide total HR solutions by using my extensive management, technical, and leadership experience. Summary >>Highly skilled and proven HR executive with hands on experience in key human resources functions supporting all business units in multiple countries. Strategic consultant skilled in building customer driven and business aligned HR organizations. Effective collaborator, communicator, change agent, and business partner. Ability to develop, implement, and direct innovative strategies that provide total HR solutions by using my extensive management, technical, and leadership experience. >>Highly skilled and proven HR executive with hands on experience in key human resources functions supporting all business units in multiple countries. Strategic consultant skilled in building customer driven and business aligned HR organizations. Effective collaborator, communicator, change agent, and business partner. Ability to develop, implement, and direct innovative strategies that provide total HR solutions by using my extensive management, technical, and leadership experience. >>Highly skilled and proven HR executive with hands on experience in key human resources functions supporting all business units in multiple countries. Strategic consultant skilled in building customer driven and business aligned HR organizations. Effective collaborator, communicator, change agent, and business partner. Ability to develop, implement, and direct innovative strategies that provide total HR solutions by using my extensive management, technical, and leadership experience. Experience Human Resources Manager Intel Corporation February 2009  – Present (6 years 7 months) Greater New York City Area >>Intel Corporation, founded on July 18, 1968, is a portmanteau of Integrated Electronics (the fact that \"intel\" is the term for intelligence information also made the name appropriate).Intel also makes motherboard chipsets, network interface controllers and integrated circuits, flash memory, graphic chips, embedded processors and other devices related to communications and computing. Founded by semiconductor pioneers Robert Noyce and Gordon Moore and widely associated with the executive leadership and vision of Andrew Grove, Intel combines advanced chip design capability with a leading-edge manufacturing capability. Though Intel was originally known primarily to engineers and technologists, its \"Intel Inside\" advertising campaign of the 1990s made it a household name, along with its Pentium processors. Freelance recruiter Facebook July 2006  –  December 2008  (2 years 6 months) Greater New York City Area * Develop, implement, and enforce policies and procedures and advise on areas of employee discipline \n* Identify the individual training needs of various employees and create training and development plans  \n* Advise on specific areas of both state and government laws, such as Title VII, FMLA and ADA polices. Human Resources Manager Intel Corporation February 2009  – Present (6 years 7 months) Greater New York City Area >>Intel Corporation, founded on July 18, 1968, is a portmanteau of Integrated Electronics (the fact that \"intel\" is the term for intelligence information also made the name appropriate).Intel also makes motherboard chipsets, network interface controllers and integrated circuits, flash memory, graphic chips, embedded processors and other devices related to communications and computing. Founded by semiconductor pioneers Robert Noyce and Gordon Moore and widely associated with the executive leadership and vision of Andrew Grove, Intel combines advanced chip design capability with a leading-edge manufacturing capability. Though Intel was originally known primarily to engineers and technologists, its \"Intel Inside\" advertising campaign of the 1990s made it a household name, along with its Pentium processors. Human Resources Manager Intel Corporation February 2009  – Present (6 years 7 months) Greater New York City Area >>Intel Corporation, founded on July 18, 1968, is a portmanteau of Integrated Electronics (the fact that \"intel\" is the term for intelligence information also made the name appropriate).Intel also makes motherboard chipsets, network interface controllers and integrated circuits, flash memory, graphic chips, embedded processors and other devices related to communications and computing. Founded by semiconductor pioneers Robert Noyce and Gordon Moore and widely associated with the executive leadership and vision of Andrew Grove, Intel combines advanced chip design capability with a leading-edge manufacturing capability. Though Intel was originally known primarily to engineers and technologists, its \"Intel Inside\" advertising campaign of the 1990s made it a household name, along with its Pentium processors. Freelance recruiter Facebook July 2006  –  December 2008  (2 years 6 months) Greater New York City Area * Develop, implement, and enforce policies and procedures and advise on areas of employee discipline \n* Identify the individual training needs of various employees and create training and development plans  \n* Advise on specific areas of both state and government laws, such as Title VII, FMLA and ADA polices. Freelance recruiter Facebook July 2006  –  December 2008  (2 years 6 months) Greater New York City Area * Develop, implement, and enforce policies and procedures and advise on areas of employee discipline \n* Identify the individual training needs of various employees and create training and development plans  \n* Advise on specific areas of both state and government laws, such as Title VII, FMLA and ADA polices. Languages English Native or bilingual proficiency Greek Filipino French German Urdu Hindi Bangla English Native or bilingual proficiency Greek Filipino French German Urdu Hindi Bangla English Native or bilingual proficiency Greek Filipino French German Urdu Hindi Bangla Native or bilingual proficiency Skills HTML 5 HR Consulting HR Policies HR Project Management Web Development Web Design Wellness Microsoft Excel XHTML Customer Service Team Leadership Leadership Leadership Development Graphic Design Video Editing Social Media Mac Windows Server HR Software Hospitality Management See 5+     See less Skills  HTML 5 HR Consulting HR Policies HR Project Management Web Development Web Design Wellness Microsoft Excel XHTML Customer Service Team Leadership Leadership Leadership Development Graphic Design Video Editing Social Media Mac Windows Server HR Software Hospitality Management See 5+     See less HTML 5 HR Consulting HR Policies HR Project Management Web Development Web Design Wellness Microsoft Excel XHTML Customer Service Team Leadership Leadership Leadership Development Graphic Design Video Editing Social Media Mac Windows Server HR Software Hospitality Management See 5+     See less HTML 5 HR Consulting HR Policies HR Project Management Web Development Web Design Wellness Microsoft Excel XHTML Customer Service Team Leadership Leadership Leadership Development Graphic Design Video Editing Social Media Mac Windows Server HR Software Hospitality Management See 5+     See less Education New York University Master's Degree 2007  – 2009 >>The university logo, the upheld torch, is derived from the Statue of Liberty, signifying NYU's service to the city of New York. The torch is depicted on both the NYU seal and the more abstract NYU logo, designed in 1965 by renowned graphic designer Tom Geismar of the branding and design firm Chermayeff & Geismar. There are at least two versions of the possible origin of the university color, violet. Some believe that it may have been chosen because violets are said to have grown abundantly in Washington Square and around the buttresses of the Old University Building. Others argue that the color may have been adopted because the violet was the flower associated with Athens, the center of learning in ancient Greece. New York University Engineer's Degree 2002  – 2006 >>In the late 1960s and early 1970s, financial crisis gripped the New York City government and the troubles spread to the city's institutions, including NYU. Feeling the pressures of imminent bankruptcy, NYU President James McNaughton Hester negotiated the sale of the University Heights campus to the City University of New York, which occurred in 1973. After the sale of the Bronx campus, University College merged with Washington Square College. In the 1980s, under the leadership of President John Brademas, NYU launched a billion-dollar campaign that was spent almost entirely on updating facilities. The campaign was set to complete in 15 years, but ended up being completed in 10. In 2003 President John Sexton launched a $2.5 billion campaign for funds to be spent especially on faculty and financial aid resources. New York University Master's Degree 2007  – 2009 >>The university logo, the upheld torch, is derived from the Statue of Liberty, signifying NYU's service to the city of New York. The torch is depicted on both the NYU seal and the more abstract NYU logo, designed in 1965 by renowned graphic designer Tom Geismar of the branding and design firm Chermayeff & Geismar. There are at least two versions of the possible origin of the university color, violet. Some believe that it may have been chosen because violets are said to have grown abundantly in Washington Square and around the buttresses of the Old University Building. Others argue that the color may have been adopted because the violet was the flower associated with Athens, the center of learning in ancient Greece. New York University Master's Degree 2007  – 2009 >>The university logo, the upheld torch, is derived from the Statue of Liberty, signifying NYU's service to the city of New York. The torch is depicted on both the NYU seal and the more abstract NYU logo, designed in 1965 by renowned graphic designer Tom Geismar of the branding and design firm Chermayeff & Geismar. There are at least two versions of the possible origin of the university color, violet. Some believe that it may have been chosen because violets are said to have grown abundantly in Washington Square and around the buttresses of the Old University Building. Others argue that the color may have been adopted because the violet was the flower associated with Athens, the center of learning in ancient Greece. New York University Master's Degree 2007  – 2009 >>The university logo, the upheld torch, is derived from the Statue of Liberty, signifying NYU's service to the city of New York. The torch is depicted on both the NYU seal and the more abstract NYU logo, designed in 1965 by renowned graphic designer Tom Geismar of the branding and design firm Chermayeff & Geismar. There are at least two versions of the possible origin of the university color, violet. Some believe that it may have been chosen because violets are said to have grown abundantly in Washington Square and around the buttresses of the Old University Building. Others argue that the color may have been adopted because the violet was the flower associated with Athens, the center of learning in ancient Greece. New York University Engineer's Degree 2002  – 2006 >>In the late 1960s and early 1970s, financial crisis gripped the New York City government and the troubles spread to the city's institutions, including NYU. Feeling the pressures of imminent bankruptcy, NYU President James McNaughton Hester negotiated the sale of the University Heights campus to the City University of New York, which occurred in 1973. After the sale of the Bronx campus, University College merged with Washington Square College. In the 1980s, under the leadership of President John Brademas, NYU launched a billion-dollar campaign that was spent almost entirely on updating facilities. The campaign was set to complete in 15 years, but ended up being completed in 10. In 2003 President John Sexton launched a $2.5 billion campaign for funds to be spent especially on faculty and financial aid resources. New York University Engineer's Degree 2002  – 2006 >>In the late 1960s and early 1970s, financial crisis gripped the New York City government and the troubles spread to the city's institutions, including NYU. Feeling the pressures of imminent bankruptcy, NYU President James McNaughton Hester negotiated the sale of the University Heights campus to the City University of New York, which occurred in 1973. After the sale of the Bronx campus, University College merged with Washington Square College. In the 1980s, under the leadership of President John Brademas, NYU launched a billion-dollar campaign that was spent almost entirely on updating facilities. The campaign was set to complete in 15 years, but ended up being completed in 10. In 2003 President John Sexton launched a $2.5 billion campaign for funds to be spent especially on faculty and financial aid resources. New York University Engineer's Degree 2002  – 2006 >>In the late 1960s and early 1970s, financial crisis gripped the New York City government and the troubles spread to the city's institutions, including NYU. Feeling the pressures of imminent bankruptcy, NYU President James McNaughton Hester negotiated the sale of the University Heights campus to the City University of New York, which occurred in 1973. After the sale of the Bronx campus, University College merged with Washington Square College. In the 1980s, under the leadership of President John Brademas, NYU launched a billion-dollar campaign that was spent almost entirely on updating facilities. The campaign was set to complete in 15 years, but ended up being completed in 10. In 2003 President John Sexton launched a $2.5 billion campaign for funds to be spent especially on faculty and financial aid resources. ", "Experience Human Resources Amazon Web Services August 2014  – Present (1 year 1 month) Dublin Human Resources Amazon Web Services August 2014  – Present (1 year 1 month) Dublin Human Resources Amazon Web Services August 2014  – Present (1 year 1 month) Dublin Skills Employee Engagement Talent Management Succession Planning Performance Management Executive Coaching Management Development Employee Relations Employment Law Coaching People Management Operations Management Manufacturing Management Compensation & Benefit Conflict Management Skills  Employee Engagement Talent Management Succession Planning Performance Management Executive Coaching Management Development Employee Relations Employment Law Coaching People Management Operations Management Manufacturing Management Compensation & Benefit Conflict Management Employee Engagement Talent Management Succession Planning Performance Management Executive Coaching Management Development Employee Relations Employment Law Coaching People Management Operations Management Manufacturing Management Compensation & Benefit Conflict Management Employee Engagement Talent Management Succession Planning Performance Management Executive Coaching Management Development Employee Relations Employment Law Coaching People Management Operations Management Manufacturing Management Compensation & Benefit Conflict Management ", "Summary Expertise in enhancing employee engagement and productivity throughout the talent management life-cycle. I facilitate what all organizations strive for….improved alignment of people resources with organizational objectives and strategies.  \n \nWith keen focus on change management, lead the teams who create, leverage and deliver the following talent management programs: Talent Acquisition, Succession Planning, Talent Development, Performance Management, and Talent Exits/Off-boarding.  \n \n• Additional experience in Organizational Improvement and Design, Mergers and Acquisitions/Integration, Executive Coaching, Budgeting, and Supplier Management. \n \n• Excel in a complex, highly-matrixed, and globally diverse environment utilizing a consultative and collaborative approach.  \n \n• Industries include medical device, technology, manufacturing and professional services.  \n \n• Global experience including an expatriate assignment in China. Currently working a bi-coastal schedule alternating between Boston and Northern California.  \n \n• Doctorate and MBA degrees that thread together execution, strategy, and theory.  \n Summary Expertise in enhancing employee engagement and productivity throughout the talent management life-cycle. I facilitate what all organizations strive for….improved alignment of people resources with organizational objectives and strategies.  \n \nWith keen focus on change management, lead the teams who create, leverage and deliver the following talent management programs: Talent Acquisition, Succession Planning, Talent Development, Performance Management, and Talent Exits/Off-boarding.  \n \n• Additional experience in Organizational Improvement and Design, Mergers and Acquisitions/Integration, Executive Coaching, Budgeting, and Supplier Management. \n \n• Excel in a complex, highly-matrixed, and globally diverse environment utilizing a consultative and collaborative approach.  \n \n• Industries include medical device, technology, manufacturing and professional services.  \n \n• Global experience including an expatriate assignment in China. Currently working a bi-coastal schedule alternating between Boston and Northern California.  \n \n• Doctorate and MBA degrees that thread together execution, strategy, and theory.  \n Expertise in enhancing employee engagement and productivity throughout the talent management life-cycle. I facilitate what all organizations strive for….improved alignment of people resources with organizational objectives and strategies.  \n \nWith keen focus on change management, lead the teams who create, leverage and deliver the following talent management programs: Talent Acquisition, Succession Planning, Talent Development, Performance Management, and Talent Exits/Off-boarding.  \n \n• Additional experience in Organizational Improvement and Design, Mergers and Acquisitions/Integration, Executive Coaching, Budgeting, and Supplier Management. \n \n• Excel in a complex, highly-matrixed, and globally diverse environment utilizing a consultative and collaborative approach.  \n \n• Industries include medical device, technology, manufacturing and professional services.  \n \n• Global experience including an expatriate assignment in China. Currently working a bi-coastal schedule alternating between Boston and Northern California.  \n \n• Doctorate and MBA degrees that thread together execution, strategy, and theory.  \n Expertise in enhancing employee engagement and productivity throughout the talent management life-cycle. I facilitate what all organizations strive for….improved alignment of people resources with organizational objectives and strategies.  \n \nWith keen focus on change management, lead the teams who create, leverage and deliver the following talent management programs: Talent Acquisition, Succession Planning, Talent Development, Performance Management, and Talent Exits/Off-boarding.  \n \n• Additional experience in Organizational Improvement and Design, Mergers and Acquisitions/Integration, Executive Coaching, Budgeting, and Supplier Management. \n \n• Excel in a complex, highly-matrixed, and globally diverse environment utilizing a consultative and collaborative approach.  \n \n• Industries include medical device, technology, manufacturing and professional services.  \n \n• Global experience including an expatriate assignment in China. Currently working a bi-coastal schedule alternating between Boston and Northern California.  \n \n• Doctorate and MBA degrees that thread together execution, strategy, and theory.  \n Experience Senior Director, Global Talent Management Haemonetics, The Blood Management Company August 2010  – Present (5 years 1 month) Boston & Northern California Global leadership role accountable for the assessment, development, and implementation of talent management initiatives across this company with +/- $935M annual revenues. Reporting to the EVP, Global HR, responsible for the comprehensive framework that encompasses the employee life-cycle including talent acquisition, talent development, performance management, succession planning, and talent departure. These areas are fundamental to building the organizational capability to meet current and future business objectives. Collaborate with global business and HR leaders in advancement of talent programs. The talent management life cycle focuses on enhancing the experience for candidates, employees, managers and leaders of the company --- when the combination of the right talent, technology, and processes results in a positive experience, this directly translates into a productive, effective, and engaged workforce. Promoted to position in September 2013.  \n \nUp to August 2013, served as top HR leader for Software Solutions business unit, reporting to the division President. Annual software division revenues of +/- $70M driven by 350 employees and contractors across North America, France and Hungary, majority of which worked virtually. HR focus on employee integration (post-acquisition), total rewards/compensation, executive coaching, performance management, employee relations, talent acquisition, and organizational development. Projects included leadership of global offer/transfer notifications to 1400+ employees as part of an acquisition.  Principal Consultant & Founder The Grace Group 2008  –  August 2010  (2 years) Northern California Provided Human Resources Consulting Services for small to mid-size organizations. Specialized in compliance, coaching, employee relations, performance management, compensation, redesign of HR departments, and recurring HR services for clients without an HR team. Additional consulting work performed for Wilcox Miller & Nelson as an executive search consultant from October 2009 - July 2010.  Human Resources Vice President MGO 2006  –  2008  (2 years) California Upon transition from consultant to employee, assumed HR department accountability for this state-wide, professional services/public accounting firm with annual revenues of $22M+, 5 sites, and 225 employees. Hired and developed 4 HR employees. Major areas of responsibility included recruiting, total rewards/compensation, new hire integration, benefits, retirement, performance management, leadership coaching, and career paths. Promoted during tenure. Human Resources Manager Intel Corporation 2000  –  2005  (5 years) United States, Canada, China, Germany, Israel HR leader for mobile phone chip design team with annual revenues of $400M+ with 1200 employees in North America, China, and Israel. Hired to lead all HR aspects for an international acquisition. HR business partner to the GM/VPs of the division. Led a staff of 10 HR professionals, worldwide. Expatriate assignment in China 2004/2005. Promoted during tenure. Human Resources Director Packard Bell NEC 1996  –  2000  (4 years) Sacramento, California Area HR leader of large, diverse manufacturing workforce with over $5 billion in revenue and 3500 employees, at peak production. Drove organizational development initiatives including leadership assessment, team restructuring, compensation, performance management, compliance, diversity programs and workforce planning. Plant closure, acquisition and due diligence experience. Promoted twice during tenure. Human Resources & Administrative Regional Manager Dames & Moore 1993  –  1996  (3 years) California Accountability for human resources and office operations for 10 regional locations employing technical engineers and scientists. Promoted from site to regional responsibilities during tenure for this international environmental engineering company. Senior Director, Global Talent Management Haemonetics, The Blood Management Company August 2010  – Present (5 years 1 month) Boston & Northern California Global leadership role accountable for the assessment, development, and implementation of talent management initiatives across this company with +/- $935M annual revenues. Reporting to the EVP, Global HR, responsible for the comprehensive framework that encompasses the employee life-cycle including talent acquisition, talent development, performance management, succession planning, and talent departure. These areas are fundamental to building the organizational capability to meet current and future business objectives. Collaborate with global business and HR leaders in advancement of talent programs. The talent management life cycle focuses on enhancing the experience for candidates, employees, managers and leaders of the company --- when the combination of the right talent, technology, and processes results in a positive experience, this directly translates into a productive, effective, and engaged workforce. Promoted to position in September 2013.  \n \nUp to August 2013, served as top HR leader for Software Solutions business unit, reporting to the division President. Annual software division revenues of +/- $70M driven by 350 employees and contractors across North America, France and Hungary, majority of which worked virtually. HR focus on employee integration (post-acquisition), total rewards/compensation, executive coaching, performance management, employee relations, talent acquisition, and organizational development. Projects included leadership of global offer/transfer notifications to 1400+ employees as part of an acquisition.  Senior Director, Global Talent Management Haemonetics, The Blood Management Company August 2010  – Present (5 years 1 month) Boston & Northern California Global leadership role accountable for the assessment, development, and implementation of talent management initiatives across this company with +/- $935M annual revenues. Reporting to the EVP, Global HR, responsible for the comprehensive framework that encompasses the employee life-cycle including talent acquisition, talent development, performance management, succession planning, and talent departure. These areas are fundamental to building the organizational capability to meet current and future business objectives. Collaborate with global business and HR leaders in advancement of talent programs. The talent management life cycle focuses on enhancing the experience for candidates, employees, managers and leaders of the company --- when the combination of the right talent, technology, and processes results in a positive experience, this directly translates into a productive, effective, and engaged workforce. Promoted to position in September 2013.  \n \nUp to August 2013, served as top HR leader for Software Solutions business unit, reporting to the division President. Annual software division revenues of +/- $70M driven by 350 employees and contractors across North America, France and Hungary, majority of which worked virtually. HR focus on employee integration (post-acquisition), total rewards/compensation, executive coaching, performance management, employee relations, talent acquisition, and organizational development. Projects included leadership of global offer/transfer notifications to 1400+ employees as part of an acquisition.  Principal Consultant & Founder The Grace Group 2008  –  August 2010  (2 years) Northern California Provided Human Resources Consulting Services for small to mid-size organizations. Specialized in compliance, coaching, employee relations, performance management, compensation, redesign of HR departments, and recurring HR services for clients without an HR team. Additional consulting work performed for Wilcox Miller & Nelson as an executive search consultant from October 2009 - July 2010.  Principal Consultant & Founder The Grace Group 2008  –  August 2010  (2 years) Northern California Provided Human Resources Consulting Services for small to mid-size organizations. Specialized in compliance, coaching, employee relations, performance management, compensation, redesign of HR departments, and recurring HR services for clients without an HR team. Additional consulting work performed for Wilcox Miller & Nelson as an executive search consultant from October 2009 - July 2010.  Human Resources Vice President MGO 2006  –  2008  (2 years) California Upon transition from consultant to employee, assumed HR department accountability for this state-wide, professional services/public accounting firm with annual revenues of $22M+, 5 sites, and 225 employees. Hired and developed 4 HR employees. Major areas of responsibility included recruiting, total rewards/compensation, new hire integration, benefits, retirement, performance management, leadership coaching, and career paths. Promoted during tenure. Human Resources Vice President MGO 2006  –  2008  (2 years) California Upon transition from consultant to employee, assumed HR department accountability for this state-wide, professional services/public accounting firm with annual revenues of $22M+, 5 sites, and 225 employees. Hired and developed 4 HR employees. Major areas of responsibility included recruiting, total rewards/compensation, new hire integration, benefits, retirement, performance management, leadership coaching, and career paths. Promoted during tenure. Human Resources Manager Intel Corporation 2000  –  2005  (5 years) United States, Canada, China, Germany, Israel HR leader for mobile phone chip design team with annual revenues of $400M+ with 1200 employees in North America, China, and Israel. Hired to lead all HR aspects for an international acquisition. HR business partner to the GM/VPs of the division. Led a staff of 10 HR professionals, worldwide. Expatriate assignment in China 2004/2005. Promoted during tenure. Human Resources Manager Intel Corporation 2000  –  2005  (5 years) United States, Canada, China, Germany, Israel HR leader for mobile phone chip design team with annual revenues of $400M+ with 1200 employees in North America, China, and Israel. Hired to lead all HR aspects for an international acquisition. HR business partner to the GM/VPs of the division. Led a staff of 10 HR professionals, worldwide. Expatriate assignment in China 2004/2005. Promoted during tenure. Human Resources Director Packard Bell NEC 1996  –  2000  (4 years) Sacramento, California Area HR leader of large, diverse manufacturing workforce with over $5 billion in revenue and 3500 employees, at peak production. Drove organizational development initiatives including leadership assessment, team restructuring, compensation, performance management, compliance, diversity programs and workforce planning. Plant closure, acquisition and due diligence experience. Promoted twice during tenure. Human Resources Director Packard Bell NEC 1996  –  2000  (4 years) Sacramento, California Area HR leader of large, diverse manufacturing workforce with over $5 billion in revenue and 3500 employees, at peak production. Drove organizational development initiatives including leadership assessment, team restructuring, compensation, performance management, compliance, diversity programs and workforce planning. Plant closure, acquisition and due diligence experience. Promoted twice during tenure. Human Resources & Administrative Regional Manager Dames & Moore 1993  –  1996  (3 years) California Accountability for human resources and office operations for 10 regional locations employing technical engineers and scientists. Promoted from site to regional responsibilities during tenure for this international environmental engineering company. Human Resources & Administrative Regional Manager Dames & Moore 1993  –  1996  (3 years) California Accountability for human resources and office operations for 10 regional locations employing technical engineers and scientists. Promoted from site to regional responsibilities during tenure for this international environmental engineering company. Skills Human Resources Organizational... Leadership Personnel Management HR Consulting Acquisition Integration Training Executive Coaching Business Acumen Deferred Compensation Employee Engagement Team Leadership Temporary Placement Career Development Leadership Development Executive Coaching &... Humor Accountability Problem Solving Situational Approach:... HR Operations Publicly-Held & Private... Accountable Ability to Travel/Work:... Talent Management Workforce Planning Succession Planning Performance Management Talent Acquisition Organizational... See 15+     See less Skills  Human Resources Organizational... Leadership Personnel Management HR Consulting Acquisition Integration Training Executive Coaching Business Acumen Deferred Compensation Employee Engagement Team Leadership Temporary Placement Career Development Leadership Development Executive Coaching &... Humor Accountability Problem Solving Situational Approach:... HR Operations Publicly-Held & Private... Accountable Ability to Travel/Work:... Talent Management Workforce Planning Succession Planning Performance Management Talent Acquisition Organizational... See 15+     See less Human Resources Organizational... Leadership Personnel Management HR Consulting Acquisition Integration Training Executive Coaching Business Acumen Deferred Compensation Employee Engagement Team Leadership Temporary Placement Career Development Leadership Development Executive Coaching &... Humor Accountability Problem Solving Situational Approach:... HR Operations Publicly-Held & Private... Accountable Ability to Travel/Work:... Talent Management Workforce Planning Succession Planning Performance Management Talent Acquisition Organizational... See 15+     See less Human Resources Organizational... Leadership Personnel Management HR Consulting Acquisition Integration Training Executive Coaching Business Acumen Deferred Compensation Employee Engagement Team Leadership Temporary Placement Career Development Leadership Development Executive Coaching &... Humor Accountability Problem Solving Situational Approach:... HR Operations Publicly-Held & Private... Accountable Ability to Travel/Work:... Talent Management Workforce Planning Succession Planning Performance Management Talent Acquisition Organizational... See 15+     See less Education University of Southern California Doctorate,  Human Resources; Organizational Behavior; Administrative Theory; Diversity Doctor of Public Administration (DPA). Actively completed studies, qualification exams, and dissertation while HR career continued to prosper. California State University-Sacramento MBA,  Business Returned to school for MBA to build upon BS degree in Business (dual concentrations in Human Resources and Management). Excelled in the graduate program while working full-time. University of Southern California Doctorate,  Human Resources; Organizational Behavior; Administrative Theory; Diversity Doctor of Public Administration (DPA). Actively completed studies, qualification exams, and dissertation while HR career continued to prosper. University of Southern California Doctorate,  Human Resources; Organizational Behavior; Administrative Theory; Diversity Doctor of Public Administration (DPA). Actively completed studies, qualification exams, and dissertation while HR career continued to prosper. University of Southern California Doctorate,  Human Resources; Organizational Behavior; Administrative Theory; Diversity Doctor of Public Administration (DPA). Actively completed studies, qualification exams, and dissertation while HR career continued to prosper. California State University-Sacramento MBA,  Business Returned to school for MBA to build upon BS degree in Business (dual concentrations in Human Resources and Management). Excelled in the graduate program while working full-time. California State University-Sacramento MBA,  Business Returned to school for MBA to build upon BS degree in Business (dual concentrations in Human Resources and Management). Excelled in the graduate program while working full-time. California State University-Sacramento MBA,  Business Returned to school for MBA to build upon BS degree in Business (dual concentrations in Human Resources and Management). Excelled in the graduate program while working full-time. ", "Summary An accomplished Human Resource leader with a proven track record in developing and implementing people strategies.  \n•Rapidly develop trusted adviser status with senior executives from all disciplines.  \n•Effectively influence the adoption of systems and processes that result in improved performance.  \n•Disciplined in assessing performance barriers for high potential candidates, recommending and leading the implementation of solutions that stick.  \n•Energetic leader of leaders with a passion for developing others to capitalize on their strengths in order to achieve higher levels of success. Summary An accomplished Human Resource leader with a proven track record in developing and implementing people strategies.  \n•Rapidly develop trusted adviser status with senior executives from all disciplines.  \n•Effectively influence the adoption of systems and processes that result in improved performance.  \n•Disciplined in assessing performance barriers for high potential candidates, recommending and leading the implementation of solutions that stick.  \n•Energetic leader of leaders with a passion for developing others to capitalize on their strengths in order to achieve higher levels of success. An accomplished Human Resource leader with a proven track record in developing and implementing people strategies.  \n•Rapidly develop trusted adviser status with senior executives from all disciplines.  \n•Effectively influence the adoption of systems and processes that result in improved performance.  \n•Disciplined in assessing performance barriers for high potential candidates, recommending and leading the implementation of solutions that stick.  \n•Energetic leader of leaders with a passion for developing others to capitalize on their strengths in order to achieve higher levels of success. An accomplished Human Resource leader with a proven track record in developing and implementing people strategies.  \n•Rapidly develop trusted adviser status with senior executives from all disciplines.  \n•Effectively influence the adoption of systems and processes that result in improved performance.  \n•Disciplined in assessing performance barriers for high potential candidates, recommending and leading the implementation of solutions that stick.  \n•Energetic leader of leaders with a passion for developing others to capitalize on their strengths in order to achieve higher levels of success. Experience President Ballinger Coaching and Consulting January 2007  – Present (8 years 8 months) Provide Executive coaching and Organizational Development services to both large and midsize growth companies worldwide.  \n•Influenced the adoption of an annual strategic planning process for a family owned construction business. Instituted real time financial reporting systems and the implementation of an organizational accountability structure. Profitability increased from flat to 5% over a 3 year period. \n•Successfully coached a senior level executive in a fortune 100 business through two promotions on the path to ultimately become President. \n•90% of clients have either been promoted or successfully transitioned to the next desired position. Director of HR/OD Izzy+ December 2014  – Present (9 months) Spring Lake, Michigan Enjoying the transition from big company HR to small company do whatever needs to be done! Core deliverables include talent acquisition, talent development, organizational development, change management, setting compensation strategy, employee relations, benefits inquires, HR and safety compliance.  Sr. Director, Talent Development Meijer June 2011  –  October 2014  (3 years 5 months) Greater Grand Rapids, Michigan Area Directed all aspects of talent development including onboarding, performance review, talent review, succession planning and development planning for high potential leaders. Also directed companywide job specific training and organizational development. \n•Led the selection process and implementation of the Cornerstone OnDemand Talent Management System. Managed stakeholders in the alignment of processes for Goals, Performance, Succession, Learning and Compensation modules.  \no Achieved >80% adoption in the first year of implementation.  \no In year three of implementation, dashboards and reports are enabling HR Generalist to influence leaders to assume more responsibility for the development and retention of key talent. \n•In partnership with the Executive Vice President of Retail Operations, designed and facilitated leadership round tables with women store directors across all regions. Succession planning 9 box results showed a visible increase in diverse high potential candidates at all leadership levels.  \n•In 2013, led the design, development and deployment of a comprehensive leadership development curriculum. The 2014 climate survey indicates an increase of 2% in the perception of development opportunities for leaders. Talent Acquisition and Organizational Development Manager Intel 1999  –  2006  (7 years) Software & Services Group, Chandler, Arizona In 1999 this global organization that spanned three countries and seven domestic sites was chartered with enabling software developers to create and test their offerings on Intel platforms. It grew from 500 employees to 2000 in two years. A down cycle occurred and the organization subsequently shrank to 1500. Led a team of 25.  \n•Using behavioral interviewing, led the team that successfully hired, on boarded and integrated 1500 specialized employees over a two year period. \n•Created a hybrid e-learning boot camp for deal makers that simulated required standards and procedures. As a direct result $1.5 million in previously negotiated funds were recaptured. \n•Architected the plan for a 500 person reduction in force resulting in a 67% fewer action claims compared to previous initiatives. Learning and Organizational Effectiveness Manager Intel Corporation 1994  –  1999  (5 years) Product Development Group, Chandler, AZ The 5000 person global microprocessor product development group was responsible for the delivery of the Pentium and Itanium processor product families. The organization took on the challenge of reducing time to market by 50%. \n•Designed the change and transition plan for the decentralization of design automation resulting in improved time to market and serving as a catalyst for future product development structures. \n•Designed, developed and conducted live and virtual training for all engineers for process standardization using best practices reducing time to market by one quarter. \n•Using on-line performance support systems and a simulation, created a boot camp for new college graduates decreasing time to productivity from 3 years to 1.5. Director of Education, Intel University Intel Corporation 1987  –  1994  (7 years) Chandler, AZ Led the restructuring of Intel University a 100 person global organization responsible for the development, delivery and administration of thousands of skill based, soft skill and leadership courses. External program responsibility included workforce development and K-12 partnerships. \n•Outsourced services saving $1M annually, reduced course offerings by 30%, redesigned job roles reducing staff by 25%, improved customer feedback scores by 35%. \n•Four community colleges successfully implemented two technician level curricula resulting in highly skilled workers filling the semiconductor industry pipeline. \n•With the Robert Noyce Foundation supported the implementation of two $10M National Science Foundation awards for K-12 math and science curriculum programs for the states of New Mexico and Massachusetts. Human Resources Manager Intel Corporation 1981  –  1987  (6 years) Chandler, Arizona Led the HR Generalist team supporting a three shift wafer fabrication operation.  \n•Established a third shift operation by successfully supporting staffing and onboarding of over 200 new hourly operators and technicians. \n•Through intense communication and education initiatives, participated in the successful avoidance of a union organizing threat targeting professional engineers. \n•Reduced overtime expenses 20% by converting from a three, eight hour shift operation to a four twelve hour shift operation. President Ballinger Coaching and Consulting January 2007  – Present (8 years 8 months) Provide Executive coaching and Organizational Development services to both large and midsize growth companies worldwide.  \n•Influenced the adoption of an annual strategic planning process for a family owned construction business. Instituted real time financial reporting systems and the implementation of an organizational accountability structure. Profitability increased from flat to 5% over a 3 year period. \n•Successfully coached a senior level executive in a fortune 100 business through two promotions on the path to ultimately become President. \n•90% of clients have either been promoted or successfully transitioned to the next desired position. President Ballinger Coaching and Consulting January 2007  – Present (8 years 8 months) Provide Executive coaching and Organizational Development services to both large and midsize growth companies worldwide.  \n•Influenced the adoption of an annual strategic planning process for a family owned construction business. Instituted real time financial reporting systems and the implementation of an organizational accountability structure. Profitability increased from flat to 5% over a 3 year period. \n•Successfully coached a senior level executive in a fortune 100 business through two promotions on the path to ultimately become President. \n•90% of clients have either been promoted or successfully transitioned to the next desired position. Director of HR/OD Izzy+ December 2014  – Present (9 months) Spring Lake, Michigan Enjoying the transition from big company HR to small company do whatever needs to be done! Core deliverables include talent acquisition, talent development, organizational development, change management, setting compensation strategy, employee relations, benefits inquires, HR and safety compliance.  Director of HR/OD Izzy+ December 2014  – Present (9 months) Spring Lake, Michigan Enjoying the transition from big company HR to small company do whatever needs to be done! Core deliverables include talent acquisition, talent development, organizational development, change management, setting compensation strategy, employee relations, benefits inquires, HR and safety compliance.  Sr. Director, Talent Development Meijer June 2011  –  October 2014  (3 years 5 months) Greater Grand Rapids, Michigan Area Directed all aspects of talent development including onboarding, performance review, talent review, succession planning and development planning for high potential leaders. Also directed companywide job specific training and organizational development. \n•Led the selection process and implementation of the Cornerstone OnDemand Talent Management System. Managed stakeholders in the alignment of processes for Goals, Performance, Succession, Learning and Compensation modules.  \no Achieved >80% adoption in the first year of implementation.  \no In year three of implementation, dashboards and reports are enabling HR Generalist to influence leaders to assume more responsibility for the development and retention of key talent. \n•In partnership with the Executive Vice President of Retail Operations, designed and facilitated leadership round tables with women store directors across all regions. Succession planning 9 box results showed a visible increase in diverse high potential candidates at all leadership levels.  \n•In 2013, led the design, development and deployment of a comprehensive leadership development curriculum. The 2014 climate survey indicates an increase of 2% in the perception of development opportunities for leaders. Sr. Director, Talent Development Meijer June 2011  –  October 2014  (3 years 5 months) Greater Grand Rapids, Michigan Area Directed all aspects of talent development including onboarding, performance review, talent review, succession planning and development planning for high potential leaders. Also directed companywide job specific training and organizational development. \n•Led the selection process and implementation of the Cornerstone OnDemand Talent Management System. Managed stakeholders in the alignment of processes for Goals, Performance, Succession, Learning and Compensation modules.  \no Achieved >80% adoption in the first year of implementation.  \no In year three of implementation, dashboards and reports are enabling HR Generalist to influence leaders to assume more responsibility for the development and retention of key talent. \n•In partnership with the Executive Vice President of Retail Operations, designed and facilitated leadership round tables with women store directors across all regions. Succession planning 9 box results showed a visible increase in diverse high potential candidates at all leadership levels.  \n•In 2013, led the design, development and deployment of a comprehensive leadership development curriculum. The 2014 climate survey indicates an increase of 2% in the perception of development opportunities for leaders. Talent Acquisition and Organizational Development Manager Intel 1999  –  2006  (7 years) Software & Services Group, Chandler, Arizona In 1999 this global organization that spanned three countries and seven domestic sites was chartered with enabling software developers to create and test their offerings on Intel platforms. It grew from 500 employees to 2000 in two years. A down cycle occurred and the organization subsequently shrank to 1500. Led a team of 25.  \n•Using behavioral interviewing, led the team that successfully hired, on boarded and integrated 1500 specialized employees over a two year period. \n•Created a hybrid e-learning boot camp for deal makers that simulated required standards and procedures. As a direct result $1.5 million in previously negotiated funds were recaptured. \n•Architected the plan for a 500 person reduction in force resulting in a 67% fewer action claims compared to previous initiatives. Talent Acquisition and Organizational Development Manager Intel 1999  –  2006  (7 years) Software & Services Group, Chandler, Arizona In 1999 this global organization that spanned three countries and seven domestic sites was chartered with enabling software developers to create and test their offerings on Intel platforms. It grew from 500 employees to 2000 in two years. A down cycle occurred and the organization subsequently shrank to 1500. Led a team of 25.  \n•Using behavioral interviewing, led the team that successfully hired, on boarded and integrated 1500 specialized employees over a two year period. \n•Created a hybrid e-learning boot camp for deal makers that simulated required standards and procedures. As a direct result $1.5 million in previously negotiated funds were recaptured. \n•Architected the plan for a 500 person reduction in force resulting in a 67% fewer action claims compared to previous initiatives. Learning and Organizational Effectiveness Manager Intel Corporation 1994  –  1999  (5 years) Product Development Group, Chandler, AZ The 5000 person global microprocessor product development group was responsible for the delivery of the Pentium and Itanium processor product families. The organization took on the challenge of reducing time to market by 50%. \n•Designed the change and transition plan for the decentralization of design automation resulting in improved time to market and serving as a catalyst for future product development structures. \n•Designed, developed and conducted live and virtual training for all engineers for process standardization using best practices reducing time to market by one quarter. \n•Using on-line performance support systems and a simulation, created a boot camp for new college graduates decreasing time to productivity from 3 years to 1.5. Learning and Organizational Effectiveness Manager Intel Corporation 1994  –  1999  (5 years) Product Development Group, Chandler, AZ The 5000 person global microprocessor product development group was responsible for the delivery of the Pentium and Itanium processor product families. The organization took on the challenge of reducing time to market by 50%. \n•Designed the change and transition plan for the decentralization of design automation resulting in improved time to market and serving as a catalyst for future product development structures. \n•Designed, developed and conducted live and virtual training for all engineers for process standardization using best practices reducing time to market by one quarter. \n•Using on-line performance support systems and a simulation, created a boot camp for new college graduates decreasing time to productivity from 3 years to 1.5. Director of Education, Intel University Intel Corporation 1987  –  1994  (7 years) Chandler, AZ Led the restructuring of Intel University a 100 person global organization responsible for the development, delivery and administration of thousands of skill based, soft skill and leadership courses. External program responsibility included workforce development and K-12 partnerships. \n•Outsourced services saving $1M annually, reduced course offerings by 30%, redesigned job roles reducing staff by 25%, improved customer feedback scores by 35%. \n•Four community colleges successfully implemented two technician level curricula resulting in highly skilled workers filling the semiconductor industry pipeline. \n•With the Robert Noyce Foundation supported the implementation of two $10M National Science Foundation awards for K-12 math and science curriculum programs for the states of New Mexico and Massachusetts. Director of Education, Intel University Intel Corporation 1987  –  1994  (7 years) Chandler, AZ Led the restructuring of Intel University a 100 person global organization responsible for the development, delivery and administration of thousands of skill based, soft skill and leadership courses. External program responsibility included workforce development and K-12 partnerships. \n•Outsourced services saving $1M annually, reduced course offerings by 30%, redesigned job roles reducing staff by 25%, improved customer feedback scores by 35%. \n•Four community colleges successfully implemented two technician level curricula resulting in highly skilled workers filling the semiconductor industry pipeline. \n•With the Robert Noyce Foundation supported the implementation of two $10M National Science Foundation awards for K-12 math and science curriculum programs for the states of New Mexico and Massachusetts. Human Resources Manager Intel Corporation 1981  –  1987  (6 years) Chandler, Arizona Led the HR Generalist team supporting a three shift wafer fabrication operation.  \n•Established a third shift operation by successfully supporting staffing and onboarding of over 200 new hourly operators and technicians. \n•Through intense communication and education initiatives, participated in the successful avoidance of a union organizing threat targeting professional engineers. \n•Reduced overtime expenses 20% by converting from a three, eight hour shift operation to a four twelve hour shift operation. Human Resources Manager Intel Corporation 1981  –  1987  (6 years) Chandler, Arizona Led the HR Generalist team supporting a three shift wafer fabrication operation.  \n•Established a third shift operation by successfully supporting staffing and onboarding of over 200 new hourly operators and technicians. \n•Through intense communication and education initiatives, participated in the successful avoidance of a union organizing threat targeting professional engineers. \n•Reduced overtime expenses 20% by converting from a three, eight hour shift operation to a four twelve hour shift operation. Languages   Skills Organizational... Leadership Development Executive Coaching Leadership Training Strategic Planning Organizational... Program Management Coaching Management Human Resources Management Consulting Cross-functional Team... Talent Management Training Delivery Performance Management Management Development Organizational Design Change Management Succession Planning Team Building Employee Relations Consulting Interviews Project Planning Staff Development Strategy Employee Training Executive Development Onboarding Coaching Staff Great Motivator Recruiting Business Process... Instructional Design Project Management Talent Acquisition Employee Engagement Mentoring Process Improvement Executive Managment See 26+     See less Skills  Organizational... Leadership Development Executive Coaching Leadership Training Strategic Planning Organizational... Program Management Coaching Management Human Resources Management Consulting Cross-functional Team... Talent Management Training Delivery Performance Management Management Development Organizational Design Change Management Succession Planning Team Building Employee Relations Consulting Interviews Project Planning Staff Development Strategy Employee Training Executive Development Onboarding Coaching Staff Great Motivator Recruiting Business Process... Instructional Design Project Management Talent Acquisition Employee Engagement Mentoring Process Improvement Executive Managment See 26+     See less Organizational... Leadership Development Executive Coaching Leadership Training Strategic Planning Organizational... Program Management Coaching Management Human Resources Management Consulting Cross-functional Team... Talent Management Training Delivery Performance Management Management Development Organizational Design Change Management Succession Planning Team Building Employee Relations Consulting Interviews Project Planning Staff Development Strategy Employee Training Executive Development Onboarding Coaching Staff Great Motivator Recruiting Business Process... Instructional Design Project Management Talent Acquisition Employee Engagement Mentoring Process Improvement Executive Managment See 26+     See less Organizational... Leadership Development Executive Coaching Leadership Training Strategic Planning Organizational... Program Management Coaching Management Human Resources Management Consulting Cross-functional Team... Talent Management Training Delivery Performance Management Management Development Organizational Design Change Management Succession Planning Team Building Employee Relations Consulting Interviews Project Planning Staff Development Strategy Employee Training Executive Development Onboarding Coaching Staff Great Motivator Recruiting Business Process... Instructional Design Project Management Talent Acquisition Employee Engagement Mentoring Process Improvement Executive Managment See 26+     See less Education Ferris State University BS Bus Ed,  Business , English, Education 1974  – 1979 Croswell Lexington High School High School,  Business 1971  – 1974 Activities and Societies:  Future Teachers of America ,  Band ,  Cheerleader Ferris State University BS Bus Ed,  Business , English, Education 1974  – 1979 Ferris State University BS Bus Ed,  Business , English, Education 1974  – 1979 Ferris State University BS Bus Ed,  Business , English, Education 1974  – 1979 Croswell Lexington High School High School,  Business 1971  – 1974 Activities and Societies:  Future Teachers of America ,  Band ,  Cheerleader Croswell Lexington High School High School,  Business 1971  – 1974 Activities and Societies:  Future Teachers of America ,  Band ,  Cheerleader Croswell Lexington High School High School,  Business 1971  – 1974 Activities and Societies:  Future Teachers of America ,  Band ,  Cheerleader Honors & Awards ", "Experience Human Resources Mergers and Acquisitions Manager Intel Corporation January 2010  – Present (5 years 8 months) Twenty years of HR experience, over 15 of which have been at Intel. Took role in January of 2010 managing Intel's HR Mergers and Acquisitions organization. In this capacity manages due diligence review in order to gain or offer additional information and identify any significant legal or compliance issues, organizing, presenting and reviewing competitive compensation, benefit and equity benefit strategies for newly acquired employees and subsidiaries, facilitating HR team transition services in support of deal closings, coordinating with buyers in support of a successful business transition, advising the acquiring Intel business units and Intel Capital.  \n \nUntil 2010, all roles since late 1996 have been in Business Group HR. Business Group HR Manager for Intel's Software and Service Group from 2007-2009 and was the Busines Group HR Manager for Intel's IT organization for several years before that. Has also done BGHR work in Intel's Fabs manufacturing environment in the late 90's.  \n \nHas a Master’s degree in Industrial-Labor Relations from the University of Wisconsin-Madison and a Bachelor of Arts degree in Psychology from the University of Nevada. Started with Intel in Santa Clara but moved to Folsom (suburb of Sacramento) in late 1998, where he now lives. In his free time he enjoys music (listening, going to concerts, playing his guitar); traveling; reading; and sports --at varying engagement levels (participating, attending live and couch potato-ing)! Business Group Human Resources Manager Intel Corporation June 1995  –  December 2009  (14 years 7 months) Almost than 20 years of HR experience, over 15 of which have been at Intel. Until 2010, all roles since late 1996 have been in Business Group HR. Business Group HR Manager for Intel's Software and Service Group from 2007-2009 and was the Busines Group HR Manager for Intel's IT organization for several years before that. Has also done BGHR work in Intel's Fabs manufacturing environment in the late 90's.  \n \nHas a Master’s degree in Industrial-Labor Relations from the University of Wisconsin-Madison and a Bachelor of Arts degree in Psychology from the University of Nevada. Started with Intel in Santa Clara but moved to Folsom (suburb of Sacramento) in late 1998, where he now lives. In his free time he enjoys music (listening, going to concerts, playing his guitar); traveling; reading; and sports --at varying engagement levels (participating, attending live and couch potato-ing)! Human Resources Mergers and Acquisitions Manager Intel Corporation January 2010  – Present (5 years 8 months) Twenty years of HR experience, over 15 of which have been at Intel. Took role in January of 2010 managing Intel's HR Mergers and Acquisitions organization. In this capacity manages due diligence review in order to gain or offer additional information and identify any significant legal or compliance issues, organizing, presenting and reviewing competitive compensation, benefit and equity benefit strategies for newly acquired employees and subsidiaries, facilitating HR team transition services in support of deal closings, coordinating with buyers in support of a successful business transition, advising the acquiring Intel business units and Intel Capital.  \n \nUntil 2010, all roles since late 1996 have been in Business Group HR. Business Group HR Manager for Intel's Software and Service Group from 2007-2009 and was the Busines Group HR Manager for Intel's IT organization for several years before that. Has also done BGHR work in Intel's Fabs manufacturing environment in the late 90's.  \n \nHas a Master’s degree in Industrial-Labor Relations from the University of Wisconsin-Madison and a Bachelor of Arts degree in Psychology from the University of Nevada. Started with Intel in Santa Clara but moved to Folsom (suburb of Sacramento) in late 1998, where he now lives. In his free time he enjoys music (listening, going to concerts, playing his guitar); traveling; reading; and sports --at varying engagement levels (participating, attending live and couch potato-ing)! Human Resources Mergers and Acquisitions Manager Intel Corporation January 2010  – Present (5 years 8 months) Twenty years of HR experience, over 15 of which have been at Intel. Took role in January of 2010 managing Intel's HR Mergers and Acquisitions organization. In this capacity manages due diligence review in order to gain or offer additional information and identify any significant legal or compliance issues, organizing, presenting and reviewing competitive compensation, benefit and equity benefit strategies for newly acquired employees and subsidiaries, facilitating HR team transition services in support of deal closings, coordinating with buyers in support of a successful business transition, advising the acquiring Intel business units and Intel Capital.  \n \nUntil 2010, all roles since late 1996 have been in Business Group HR. Business Group HR Manager for Intel's Software and Service Group from 2007-2009 and was the Busines Group HR Manager for Intel's IT organization for several years before that. Has also done BGHR work in Intel's Fabs manufacturing environment in the late 90's.  \n \nHas a Master’s degree in Industrial-Labor Relations from the University of Wisconsin-Madison and a Bachelor of Arts degree in Psychology from the University of Nevada. Started with Intel in Santa Clara but moved to Folsom (suburb of Sacramento) in late 1998, where he now lives. In his free time he enjoys music (listening, going to concerts, playing his guitar); traveling; reading; and sports --at varying engagement levels (participating, attending live and couch potato-ing)! Business Group Human Resources Manager Intel Corporation June 1995  –  December 2009  (14 years 7 months) Almost than 20 years of HR experience, over 15 of which have been at Intel. Until 2010, all roles since late 1996 have been in Business Group HR. Business Group HR Manager for Intel's Software and Service Group from 2007-2009 and was the Busines Group HR Manager for Intel's IT organization for several years before that. Has also done BGHR work in Intel's Fabs manufacturing environment in the late 90's.  \n \nHas a Master’s degree in Industrial-Labor Relations from the University of Wisconsin-Madison and a Bachelor of Arts degree in Psychology from the University of Nevada. Started with Intel in Santa Clara but moved to Folsom (suburb of Sacramento) in late 1998, where he now lives. In his free time he enjoys music (listening, going to concerts, playing his guitar); traveling; reading; and sports --at varying engagement levels (participating, attending live and couch potato-ing)! Business Group Human Resources Manager Intel Corporation June 1995  –  December 2009  (14 years 7 months) Almost than 20 years of HR experience, over 15 of which have been at Intel. Until 2010, all roles since late 1996 have been in Business Group HR. Business Group HR Manager for Intel's Software and Service Group from 2007-2009 and was the Busines Group HR Manager for Intel's IT organization for several years before that. Has also done BGHR work in Intel's Fabs manufacturing environment in the late 90's.  \n \nHas a Master’s degree in Industrial-Labor Relations from the University of Wisconsin-Madison and a Bachelor of Arts degree in Psychology from the University of Nevada. Started with Intel in Santa Clara but moved to Folsom (suburb of Sacramento) in late 1998, where he now lives. In his free time he enjoys music (listening, going to concerts, playing his guitar); traveling; reading; and sports --at varying engagement levels (participating, attending live and couch potato-ing)! Skills Mergers Management Human Resources Intel Process Improvement Program Management Business Development Project Management Mergers & Acquisitions Organizational... Deferred Compensation Employee Benefits Manufacturing Strategy Talent Acquisition Performance Management Employee Engagement Workforce Planning Talent Management Succession Planning Organizational Design Employee Relations See 7+     See less Skills  Mergers Management Human Resources Intel Process Improvement Program Management Business Development Project Management Mergers & Acquisitions Organizational... Deferred Compensation Employee Benefits Manufacturing Strategy Talent Acquisition Performance Management Employee Engagement Workforce Planning Talent Management Succession Planning Organizational Design Employee Relations See 7+     See less Mergers Management Human Resources Intel Process Improvement Program Management Business Development Project Management Mergers & Acquisitions Organizational... Deferred Compensation Employee Benefits Manufacturing Strategy Talent Acquisition Performance Management Employee Engagement Workforce Planning Talent Management Succession Planning Organizational Design Employee Relations See 7+     See less Mergers Management Human Resources Intel Process Improvement Program Management Business Development Project Management Mergers & Acquisitions Organizational... Deferred Compensation Employee Benefits Manufacturing Strategy Talent Acquisition Performance Management Employee Engagement Workforce Planning Talent Management Succession Planning Organizational Design Employee Relations See 7+     See less Education University of Wisconsin-Madison 1990  – 1992 University of Wisconsin-Madison 1990  – 1992 University of Wisconsin-Madison 1990  – 1992 University of Wisconsin-Madison 1990  – 1992 "]}