{"position": "I T Manager", "company": "Intel Corporation", "profiles": ["Experience I.T Manager Intel Corporation November 1995  – Present (19 years 10 months) Intern CBRE Philippines October 2013  –  March 2014  (6 months) I.T Manager Intel Corporation November 1995  – Present (19 years 10 months) I.T Manager Intel Corporation November 1995  – Present (19 years 10 months) Intern CBRE Philippines October 2013  –  March 2014  (6 months) Intern CBRE Philippines October 2013  –  March 2014  (6 months) Education TUP-T 2011  – 2014 TUP-T 2011  – 2014 TUP-T 2011  – 2014 TUP-T 2011  – 2014 ", "Experience Business Improvement Consultant National Australia Bank February 2014  – Present (1 year 7 months) Melbourne Area, Australia Service Management Consultant National Australia Bank June 2012  –  January 2014  (1 year 8 months) Melbourne Area, Australia I.T. Manager Intel Corporation April 2003  –  January 2012  (8 years 10 months) SAP Sales & Distribution And Warehouse Management Project manager Intel Corporation October 2005  –  May 2006  (8 months) SAP Backend Product Definition and Tracking Project Manager Cum System Analyst AMD February 2002  –  October 2002  (9 months) Shopfloor Control Project Manager cum System Analyst AMD January 2001  –  February 2002  (1 year 2 months) MES Application Support AMD January 1995  –  February 2002  (7 years 2 months) Business Improvement Consultant National Australia Bank February 2014  – Present (1 year 7 months) Melbourne Area, Australia Business Improvement Consultant National Australia Bank February 2014  – Present (1 year 7 months) Melbourne Area, Australia Service Management Consultant National Australia Bank June 2012  –  January 2014  (1 year 8 months) Melbourne Area, Australia Service Management Consultant National Australia Bank June 2012  –  January 2014  (1 year 8 months) Melbourne Area, Australia I.T. Manager Intel Corporation April 2003  –  January 2012  (8 years 10 months) I.T. Manager Intel Corporation April 2003  –  January 2012  (8 years 10 months) SAP Sales & Distribution And Warehouse Management Project manager Intel Corporation October 2005  –  May 2006  (8 months) SAP Sales & Distribution And Warehouse Management Project manager Intel Corporation October 2005  –  May 2006  (8 months) SAP Backend Product Definition and Tracking Project Manager Cum System Analyst AMD February 2002  –  October 2002  (9 months) SAP Backend Product Definition and Tracking Project Manager Cum System Analyst AMD February 2002  –  October 2002  (9 months) Shopfloor Control Project Manager cum System Analyst AMD January 2001  –  February 2002  (1 year 2 months) Shopfloor Control Project Manager cum System Analyst AMD January 2001  –  February 2002  (1 year 2 months) MES Application Support AMD January 1995  –  February 2002  (7 years 2 months) MES Application Support AMD January 1995  –  February 2002  (7 years 2 months) Languages English Bahasa Malaysia Mandarin, Cantonese, Hokkien, Hakka English Bahasa Malaysia Mandarin, Cantonese, Hokkien, Hakka English Bahasa Malaysia Mandarin, Cantonese, Hokkien, Hakka Skills SAP ERP Business Analysis Business Process... Leadership Business Process Program Management Warehouse Management Supply Chain Enterprise Software Vendor Management Resource Management Outstanding... Stakeholder Management Integration SD People Development IT Management Mentoring and coaching Process Improvement Business and technical... Consulting Project Delivery See 8+     See less Skills  SAP ERP Business Analysis Business Process... Leadership Business Process Program Management Warehouse Management Supply Chain Enterprise Software Vendor Management Resource Management Outstanding... Stakeholder Management Integration SD People Development IT Management Mentoring and coaching Process Improvement Business and technical... Consulting Project Delivery See 8+     See less SAP ERP Business Analysis Business Process... Leadership Business Process Program Management Warehouse Management Supply Chain Enterprise Software Vendor Management Resource Management Outstanding... Stakeholder Management Integration SD People Development IT Management Mentoring and coaching Process Improvement Business and technical... Consulting Project Delivery See 8+     See less SAP ERP Business Analysis Business Process... Leadership Business Process Program Management Warehouse Management Supply Chain Enterprise Software Vendor Management Resource Management Outstanding... Stakeholder Management Integration SD People Development IT Management Mentoring and coaching Process Improvement Business and technical... Consulting Project Delivery See 8+     See less Education San Jose State University B. Sc.,  Major in Computer Science and Minor in Mathematics 1993  – 1995 De Anza College Diploma,  Computer Studies 1991  – 1993 San Jose State University B. Sc.,  Major in Computer Science and Minor in Mathematics 1993  – 1995 San Jose State University B. Sc.,  Major in Computer Science and Minor in Mathematics 1993  – 1995 San Jose State University B. Sc.,  Major in Computer Science and Minor in Mathematics 1993  – 1995 De Anza College Diploma,  Computer Studies 1991  – 1993 De Anza College Diploma,  Computer Studies 1991  – 1993 De Anza College Diploma,  Computer Studies 1991  – 1993 ", "Skills Software Development Intel Semiconductors Linux SQL System Architecture Integration Skills  Software Development Intel Semiconductors Linux SQL System Architecture Integration Software Development Intel Semiconductors Linux SQL System Architecture Integration Software Development Intel Semiconductors Linux SQL System Architecture Integration "]}