{"position": "Industrial Hygienist", "company": "Intel Corporation", "profiles": ["Summary Accomplished certified industrial hygienist with experience in advancing safety cultures from an industrial hygiene perspective in the semiconductor industry. Investigates adequacy of ventilation and conducts exposure assessments of potential chemical, physical and biological hazards and recommends measures to ensure maximum employee protection. Innovative leader with ability to establish trusted relationships through outstanding customer service and strong technical expertise.  \nProficient in driving value-added solutions that are practical to implement for the end user. Possesses robust communication skills used to facilitate the value of industrial hygiene to customer in order to improve worker safety. Summary Accomplished certified industrial hygienist with experience in advancing safety cultures from an industrial hygiene perspective in the semiconductor industry. Investigates adequacy of ventilation and conducts exposure assessments of potential chemical, physical and biological hazards and recommends measures to ensure maximum employee protection. Innovative leader with ability to establish trusted relationships through outstanding customer service and strong technical expertise.  \nProficient in driving value-added solutions that are practical to implement for the end user. Possesses robust communication skills used to facilitate the value of industrial hygiene to customer in order to improve worker safety. Accomplished certified industrial hygienist with experience in advancing safety cultures from an industrial hygiene perspective in the semiconductor industry. Investigates adequacy of ventilation and conducts exposure assessments of potential chemical, physical and biological hazards and recommends measures to ensure maximum employee protection. Innovative leader with ability to establish trusted relationships through outstanding customer service and strong technical expertise.  \nProficient in driving value-added solutions that are practical to implement for the end user. Possesses robust communication skills used to facilitate the value of industrial hygiene to customer in order to improve worker safety. Accomplished certified industrial hygienist with experience in advancing safety cultures from an industrial hygiene perspective in the semiconductor industry. Investigates adequacy of ventilation and conducts exposure assessments of potential chemical, physical and biological hazards and recommends measures to ensure maximum employee protection. Innovative leader with ability to establish trusted relationships through outstanding customer service and strong technical expertise.  \nProficient in driving value-added solutions that are practical to implement for the end user. Possesses robust communication skills used to facilitate the value of industrial hygiene to customer in order to improve worker safety. Experience Industrial Hygienist Intel Corporation March 2009  – Present (6 years 6 months) - Responsible for the maintenance and administration of OSHA regulatory programs such as Respiratory Protection, Hearing Conservation, Arsenic, Lead, Asbestos, Hazcom, PPE as well as non-regulatory programs such as Inert Gas, and Chemical Approval \n- Conduct exposure and control assessments for chemical and physical hazards. Some examples include PPE assessments, indoor air quality surveys, site-wide sound level surveys and illumination surveys.  \n- When appropriate, conduct real-time and integrated sampling for chemical and physical hazards. Examples include arsenic/lead wipe sampling and air sampling for various chemical hazards and noise dosimetry. Hazardous Waste Disposition Intel Corporation October 2004  –  March 2009  (4 years 6 months) Rio Rancho, NM - Responsible for regulatory determinations and classifications of New Mexico chemical wastes; packaged, stored all hazardous and non-hazardous waste materials in accordance with EPA and DOT standards. \n- Prepared manifest/bill of lading and shipped hazardous and non-hazardous waste in accordance with EPA and DOT regulations. \n- Supervised various hazardous waste treatment systems, performed associated EPA inspections, supervised bulk chemical offload/shipment processes, obtained chemical samples and troubleshoot alarms. \n- Previously certified as DOT and RCRA Hazardous Waste shipper in accordance with EPA standards. Fab Equipment Technician Intel Corporation March 2000  –  October 2004  (4 years 8 months) Rio Rancho, NM - Certified Gasonics Asher maintenance technician responsible for weekly, monthly and annual preventative maintenance.  \n- Conducted troubleshooting activities for electro-mechanical errors and associated major/minor repairs in a cleanroom environment. \n- Completed accurate documentation of all maintenance and repair. Industrial Hygienist Intel Corporation March 2009  – Present (6 years 6 months) - Responsible for the maintenance and administration of OSHA regulatory programs such as Respiratory Protection, Hearing Conservation, Arsenic, Lead, Asbestos, Hazcom, PPE as well as non-regulatory programs such as Inert Gas, and Chemical Approval \n- Conduct exposure and control assessments for chemical and physical hazards. Some examples include PPE assessments, indoor air quality surveys, site-wide sound level surveys and illumination surveys.  \n- When appropriate, conduct real-time and integrated sampling for chemical and physical hazards. Examples include arsenic/lead wipe sampling and air sampling for various chemical hazards and noise dosimetry. Industrial Hygienist Intel Corporation March 2009  – Present (6 years 6 months) - Responsible for the maintenance and administration of OSHA regulatory programs such as Respiratory Protection, Hearing Conservation, Arsenic, Lead, Asbestos, Hazcom, PPE as well as non-regulatory programs such as Inert Gas, and Chemical Approval \n- Conduct exposure and control assessments for chemical and physical hazards. Some examples include PPE assessments, indoor air quality surveys, site-wide sound level surveys and illumination surveys.  \n- When appropriate, conduct real-time and integrated sampling for chemical and physical hazards. Examples include arsenic/lead wipe sampling and air sampling for various chemical hazards and noise dosimetry. Hazardous Waste Disposition Intel Corporation October 2004  –  March 2009  (4 years 6 months) Rio Rancho, NM - Responsible for regulatory determinations and classifications of New Mexico chemical wastes; packaged, stored all hazardous and non-hazardous waste materials in accordance with EPA and DOT standards. \n- Prepared manifest/bill of lading and shipped hazardous and non-hazardous waste in accordance with EPA and DOT regulations. \n- Supervised various hazardous waste treatment systems, performed associated EPA inspections, supervised bulk chemical offload/shipment processes, obtained chemical samples and troubleshoot alarms. \n- Previously certified as DOT and RCRA Hazardous Waste shipper in accordance with EPA standards. Hazardous Waste Disposition Intel Corporation October 2004  –  March 2009  (4 years 6 months) Rio Rancho, NM - Responsible for regulatory determinations and classifications of New Mexico chemical wastes; packaged, stored all hazardous and non-hazardous waste materials in accordance with EPA and DOT standards. \n- Prepared manifest/bill of lading and shipped hazardous and non-hazardous waste in accordance with EPA and DOT regulations. \n- Supervised various hazardous waste treatment systems, performed associated EPA inspections, supervised bulk chemical offload/shipment processes, obtained chemical samples and troubleshoot alarms. \n- Previously certified as DOT and RCRA Hazardous Waste shipper in accordance with EPA standards. Fab Equipment Technician Intel Corporation March 2000  –  October 2004  (4 years 8 months) Rio Rancho, NM - Certified Gasonics Asher maintenance technician responsible for weekly, monthly and annual preventative maintenance.  \n- Conducted troubleshooting activities for electro-mechanical errors and associated major/minor repairs in a cleanroom environment. \n- Completed accurate documentation of all maintenance and repair. Fab Equipment Technician Intel Corporation March 2000  –  October 2004  (4 years 8 months) Rio Rancho, NM - Certified Gasonics Asher maintenance technician responsible for weekly, monthly and annual preventative maintenance.  \n- Conducted troubleshooting activities for electro-mechanical errors and associated major/minor repairs in a cleanroom environment. \n- Completed accurate documentation of all maintenance and repair. Skills Industrial Hygiene EHS Industrial Safety Ergonomics Exposure Assessment Chemical Safety Occupational Health Environmental Compliance Hazard Recognition Hazardous Waste... Hearing Conservation Risk Assessment Asbestos Hazardous Materials Waste Management RCRA Hazard Communication Respiratory Protection PPE ISO 14001 Respiratory Products Safety Management... See 7+     See less Skills  Industrial Hygiene EHS Industrial Safety Ergonomics Exposure Assessment Chemical Safety Occupational Health Environmental Compliance Hazard Recognition Hazardous Waste... Hearing Conservation Risk Assessment Asbestos Hazardous Materials Waste Management RCRA Hazard Communication Respiratory Protection PPE ISO 14001 Respiratory Products Safety Management... See 7+     See less Industrial Hygiene EHS Industrial Safety Ergonomics Exposure Assessment Chemical Safety Occupational Health Environmental Compliance Hazard Recognition Hazardous Waste... Hearing Conservation Risk Assessment Asbestos Hazardous Materials Waste Management RCRA Hazard Communication Respiratory Protection PPE ISO 14001 Respiratory Products Safety Management... See 7+     See less Industrial Hygiene EHS Industrial Safety Ergonomics Exposure Assessment Chemical Safety Occupational Health Environmental Compliance Hazard Recognition Hazardous Waste... Hearing Conservation Risk Assessment Asbestos Hazardous Materials Waste Management RCRA Hazard Communication Respiratory Protection PPE ISO 14001 Respiratory Products Safety Management... See 7+     See less Education Montana Tech of the University of Montana MS,  Industrial Hygiene The College of Santa Fe BS,  Environmental Science Montana Tech of the University of Montana MS,  Industrial Hygiene Montana Tech of the University of Montana MS,  Industrial Hygiene Montana Tech of the University of Montana MS,  Industrial Hygiene The College of Santa Fe BS,  Environmental Science The College of Santa Fe BS,  Environmental Science The College of Santa Fe BS,  Environmental Science Honors & Awards Presidential Academic Achievement Award College of Santa Fe Magna Cum Laude College of Santa Fe Presidential Academic Achievement Award College of Santa Fe Presidential Academic Achievement Award College of Santa Fe Presidential Academic Achievement Award College of Santa Fe Magna Cum Laude College of Santa Fe Magna Cum Laude College of Santa Fe Magna Cum Laude College of Santa Fe ", "Summary I am a dedicated professional with over 14 years of experience in industrial hygiene and safety. I have extensive experience in managing and leading teams, performing exposure assessment, mentoring subordinate personnel, in developing innovative solutions to improve personnel health and improve safety in operations, and in performing training in many IH and safety topics. I have an excellent track record of establishing and maintaining effective relationships with colleagues. My goal is to help protect the health of our Sailors so that they come back to their families at the end of each work day as healthy as they were when they left home that morning. Summary I am a dedicated professional with over 14 years of experience in industrial hygiene and safety. I have extensive experience in managing and leading teams, performing exposure assessment, mentoring subordinate personnel, in developing innovative solutions to improve personnel health and improve safety in operations, and in performing training in many IH and safety topics. I have an excellent track record of establishing and maintaining effective relationships with colleagues. My goal is to help protect the health of our Sailors so that they come back to their families at the end of each work day as healthy as they were when they left home that morning. I am a dedicated professional with over 14 years of experience in industrial hygiene and safety. I have extensive experience in managing and leading teams, performing exposure assessment, mentoring subordinate personnel, in developing innovative solutions to improve personnel health and improve safety in operations, and in performing training in many IH and safety topics. I have an excellent track record of establishing and maintaining effective relationships with colleagues. My goal is to help protect the health of our Sailors so that they come back to their families at the end of each work day as healthy as they were when they left home that morning. I am a dedicated professional with over 14 years of experience in industrial hygiene and safety. I have extensive experience in managing and leading teams, performing exposure assessment, mentoring subordinate personnel, in developing innovative solutions to improve personnel health and improve safety in operations, and in performing training in many IH and safety topics. I have an excellent track record of establishing and maintaining effective relationships with colleagues. My goal is to help protect the health of our Sailors so that they come back to their families at the end of each work day as healthy as they were when they left home that morning. Experience Graduate Student Uniformed Services University for the Health Sciences (USUHS) July 2014  – Present (1 year 2 months) Bethesda, Maryland I have recently begun working on a Ph.D. in Environmental Health Sciences. My projected graduation date is July 2017. Occupational Health Liaison / Industrial Hygiene Officer Naval Safety Center December 2011  – Present (3 years 9 months) Washington, DC Perform as Chair of two diverse working groups comprised of 30 senior military and civilian personnel addressing deficiencies in the Navy medical surveillance and Personal Protective Equipment (PPE) programs. Duties include preparation of meeting agendas, meeting minutes, and tasking of working group members with actions necessary to manage each issue to completion.  \n \nDeveloped a reporting tool and methodology used by all Navy commands for the first assessment of Navy-wide medical surveillance program performance and compliance ever conducted. Provided coordination, oversight, and analysis of the assessment results, identified program and process deficiencies, and developed improvement strategies. \n \nDeveloped a chemical protective glove selection matrix to assist shipboard personnel identify and select appropriate protection for maintenance activities. \n \nDeveloped comprehensive training pertaining to chemical protective gloves and chemical protective eyewear for both end users and maintenance policy developers. Force Industrial Hygiene Officer Commander, Naval Air Forces Pacific September 2009  –  November 2011  (2 years 3 months) Commander, Naval Air Forces Pacific Provided guidance, mentorship, and oversight to six shipboard Industrial Hygiene Officers stationed aboard Pacific aircraft carriers. \n \nChaired a Fall Protection working group to develop cost-effective recommendations to help address fall hazards in Navy aviation. \n \nDeveloped a training package for Navy Motorcycle Safety Representatives (MSR) that was adopted for Navy-wide use and used to train over 6,000 MSRs.  \n \nProvided oversight on motorcycle safety program improvements for a population of over 3,000 motorcycle riders. The improvements led to a 50% reduction in motorcycle mishaps over a period of 2 years. Industrial Hygiene Officer Navy Environmental and Preventive Medicine Unit FIVE (NEPMU5) January 2007  –  August 2009  (2 years 8 months) San Diego, CA Performed as Assistant Officer-in-Charge and Chemical Component Manager of a Forward Deployed Preventive Medicine Unit (FDPMU) team comprised of 12 Navy medicine professionals during a 7- month deployment to Kuwait. The FDPMU provided preventive medicine support to U.S. forces located in Kuwait and Iraq and included equipment enabling sampling and analysis of Toxic Industrial Chemicals (TIC) and Toxic Industrial Materials (TIM), biological hazards, and assessment of water supplies. Developed air sampling strategies to assess and document exposure of U.S.Forces to hazardous air pollutants.  \n \nMentored departmental junior enlisted personnel resulting in two being selected for Junior Sailor of the Quarter. \n \nImplemented a comprehensive self-assessment program designed to identify shipboard occupational safety and health program deficiencies and to help shipboard safety officers develop corrective actions. \n \nHeaded a team of 3 Navy medical department professionals researching new ambient dust monitoring methods for deployed personnel.  \n \nDrafted and implemented a Personnel Qualification Standard to train 20 enlisted Preventive Medicine Technicians industrial hygiene exposure assessment and survey processes to improve the department's ability to provide robust support to the Fleet. Industrial Hygiene Officer USS Nimitz (CVN 68) 2005  –  2007  (2 years) Performed as the ship's Assistant Safety Officer and Environmental Protection Coordinator and Safety Department Division Officer managing and mentoring 12 junior and senior enlisted personnel.  \n \nProvided industrial hygiene exptertise to the ship's leadership for over 5,000 embarked ship and Air Wing personnel. Developed new resources and tools to improve the health of the crew pierside and underway periods, including a 6- month deployment to the Arabian Gulf.  \n \nPerformed daily oversight safety walk-throughs and administrative management of the ship's Occupational Safety and Health (OSH) programs. \n \nPerformed asbestos identification through Polarized Light Microscopy and heavy metal paint analysis using X-ray Fluorescence equipment. \n \nDirected the OSH program preparation efforts for 4 major shipwide inspections involving safety and health. \n \nCoordinated with civilian support and Federal safety and health personnel to enforce safety regulation and reduce sailor and government civilian occupational injuries/illnesses during a 6-month shipyard period. Industrial Hygiene Officer Navy Environmental and Preventive Medicine Unit SIX (NEPMU6) December 2001  –  December 2004  (3 years 1 month) Pearl Harbor, HI Conducted industrial hygiene surveys onboard surface ships, submarines, and shore facilities. Surveys included walk-throughs of work spaces, air sampling of chemical and industrial processes, noise monitoring, and recommendation of engineering and administrative control strategies. \n \nPerformed as Chemical Component Manager and Assistant Officer-in-Charge of a Forward Deployed Preventive Medicine Unit (FDPMU) team. The FDPMU was comprised of 12 Navy Medicine professionals and was designed to provide preventive medicine support to U.S. forces in any theatre of operations. The team infrastructure included equipment capable of providing sampling and analysis of Toxic Industrial Chemicals (TIC) and Toxic Industrial Materials (TIM), biological hazards,Performed as Assistant Officer-in-Charge of a team comprised of 12 Navy Medicine professionals. \n \nWorked closely with local, state, and Federal emergency response units to provide collection, laboratory analysis, and risk communication of suspected chemical and biological weapons in the aftermath of Sept 11, 2001. Industrial Hygienist Intel Corporation May 2000  –  September 2001  (1 year 5 months) Teamed with industrial hygienists from Intel locations worldwide to develop Intel’s industrial hygiene policies and to develop strategies for efficient completion of comprehensive exposure assessment plans. \n \nPerformed baseline assessments of worker exposures to chemical and ionizing/non-ionizing radiation to evaluate and document new chip manufacturing technology equipment. \n \nPerformed training in the areas of chemical awareness, hearing conservation, respiratory protection, personal protective equipment, risk communication, and other health and safety topics to affected employees and their supervisors. EHS Specialist EORM, Inc. June 1999  –  May 2000  (1 year) Performed comprehensive baseline exposure assessment of worker exposures and performed Environmental, Health, and Safety training for workers in various semiconductor manufacturing facilities in the Silicon Valley area. Graduate Student Uniformed Services University for the Health Sciences (USUHS) July 2014  – Present (1 year 2 months) Bethesda, Maryland I have recently begun working on a Ph.D. in Environmental Health Sciences. My projected graduation date is July 2017. Graduate Student Uniformed Services University for the Health Sciences (USUHS) July 2014  – Present (1 year 2 months) Bethesda, Maryland I have recently begun working on a Ph.D. in Environmental Health Sciences. My projected graduation date is July 2017. Occupational Health Liaison / Industrial Hygiene Officer Naval Safety Center December 2011  – Present (3 years 9 months) Washington, DC Perform as Chair of two diverse working groups comprised of 30 senior military and civilian personnel addressing deficiencies in the Navy medical surveillance and Personal Protective Equipment (PPE) programs. Duties include preparation of meeting agendas, meeting minutes, and tasking of working group members with actions necessary to manage each issue to completion.  \n \nDeveloped a reporting tool and methodology used by all Navy commands for the first assessment of Navy-wide medical surveillance program performance and compliance ever conducted. Provided coordination, oversight, and analysis of the assessment results, identified program and process deficiencies, and developed improvement strategies. \n \nDeveloped a chemical protective glove selection matrix to assist shipboard personnel identify and select appropriate protection for maintenance activities. \n \nDeveloped comprehensive training pertaining to chemical protective gloves and chemical protective eyewear for both end users and maintenance policy developers. Occupational Health Liaison / Industrial Hygiene Officer Naval Safety Center December 2011  – Present (3 years 9 months) Washington, DC Perform as Chair of two diverse working groups comprised of 30 senior military and civilian personnel addressing deficiencies in the Navy medical surveillance and Personal Protective Equipment (PPE) programs. Duties include preparation of meeting agendas, meeting minutes, and tasking of working group members with actions necessary to manage each issue to completion.  \n \nDeveloped a reporting tool and methodology used by all Navy commands for the first assessment of Navy-wide medical surveillance program performance and compliance ever conducted. Provided coordination, oversight, and analysis of the assessment results, identified program and process deficiencies, and developed improvement strategies. \n \nDeveloped a chemical protective glove selection matrix to assist shipboard personnel identify and select appropriate protection for maintenance activities. \n \nDeveloped comprehensive training pertaining to chemical protective gloves and chemical protective eyewear for both end users and maintenance policy developers. Force Industrial Hygiene Officer Commander, Naval Air Forces Pacific September 2009  –  November 2011  (2 years 3 months) Commander, Naval Air Forces Pacific Provided guidance, mentorship, and oversight to six shipboard Industrial Hygiene Officers stationed aboard Pacific aircraft carriers. \n \nChaired a Fall Protection working group to develop cost-effective recommendations to help address fall hazards in Navy aviation. \n \nDeveloped a training package for Navy Motorcycle Safety Representatives (MSR) that was adopted for Navy-wide use and used to train over 6,000 MSRs.  \n \nProvided oversight on motorcycle safety program improvements for a population of over 3,000 motorcycle riders. The improvements led to a 50% reduction in motorcycle mishaps over a period of 2 years. Force Industrial Hygiene Officer Commander, Naval Air Forces Pacific September 2009  –  November 2011  (2 years 3 months) Commander, Naval Air Forces Pacific Provided guidance, mentorship, and oversight to six shipboard Industrial Hygiene Officers stationed aboard Pacific aircraft carriers. \n \nChaired a Fall Protection working group to develop cost-effective recommendations to help address fall hazards in Navy aviation. \n \nDeveloped a training package for Navy Motorcycle Safety Representatives (MSR) that was adopted for Navy-wide use and used to train over 6,000 MSRs.  \n \nProvided oversight on motorcycle safety program improvements for a population of over 3,000 motorcycle riders. The improvements led to a 50% reduction in motorcycle mishaps over a period of 2 years. Industrial Hygiene Officer Navy Environmental and Preventive Medicine Unit FIVE (NEPMU5) January 2007  –  August 2009  (2 years 8 months) San Diego, CA Performed as Assistant Officer-in-Charge and Chemical Component Manager of a Forward Deployed Preventive Medicine Unit (FDPMU) team comprised of 12 Navy medicine professionals during a 7- month deployment to Kuwait. The FDPMU provided preventive medicine support to U.S. forces located in Kuwait and Iraq and included equipment enabling sampling and analysis of Toxic Industrial Chemicals (TIC) and Toxic Industrial Materials (TIM), biological hazards, and assessment of water supplies. Developed air sampling strategies to assess and document exposure of U.S.Forces to hazardous air pollutants.  \n \nMentored departmental junior enlisted personnel resulting in two being selected for Junior Sailor of the Quarter. \n \nImplemented a comprehensive self-assessment program designed to identify shipboard occupational safety and health program deficiencies and to help shipboard safety officers develop corrective actions. \n \nHeaded a team of 3 Navy medical department professionals researching new ambient dust monitoring methods for deployed personnel.  \n \nDrafted and implemented a Personnel Qualification Standard to train 20 enlisted Preventive Medicine Technicians industrial hygiene exposure assessment and survey processes to improve the department's ability to provide robust support to the Fleet. Industrial Hygiene Officer Navy Environmental and Preventive Medicine Unit FIVE (NEPMU5) January 2007  –  August 2009  (2 years 8 months) San Diego, CA Performed as Assistant Officer-in-Charge and Chemical Component Manager of a Forward Deployed Preventive Medicine Unit (FDPMU) team comprised of 12 Navy medicine professionals during a 7- month deployment to Kuwait. The FDPMU provided preventive medicine support to U.S. forces located in Kuwait and Iraq and included equipment enabling sampling and analysis of Toxic Industrial Chemicals (TIC) and Toxic Industrial Materials (TIM), biological hazards, and assessment of water supplies. Developed air sampling strategies to assess and document exposure of U.S.Forces to hazardous air pollutants.  \n \nMentored departmental junior enlisted personnel resulting in two being selected for Junior Sailor of the Quarter. \n \nImplemented a comprehensive self-assessment program designed to identify shipboard occupational safety and health program deficiencies and to help shipboard safety officers develop corrective actions. \n \nHeaded a team of 3 Navy medical department professionals researching new ambient dust monitoring methods for deployed personnel.  \n \nDrafted and implemented a Personnel Qualification Standard to train 20 enlisted Preventive Medicine Technicians industrial hygiene exposure assessment and survey processes to improve the department's ability to provide robust support to the Fleet. Industrial Hygiene Officer USS Nimitz (CVN 68) 2005  –  2007  (2 years) Performed as the ship's Assistant Safety Officer and Environmental Protection Coordinator and Safety Department Division Officer managing and mentoring 12 junior and senior enlisted personnel.  \n \nProvided industrial hygiene exptertise to the ship's leadership for over 5,000 embarked ship and Air Wing personnel. Developed new resources and tools to improve the health of the crew pierside and underway periods, including a 6- month deployment to the Arabian Gulf.  \n \nPerformed daily oversight safety walk-throughs and administrative management of the ship's Occupational Safety and Health (OSH) programs. \n \nPerformed asbestos identification through Polarized Light Microscopy and heavy metal paint analysis using X-ray Fluorescence equipment. \n \nDirected the OSH program preparation efforts for 4 major shipwide inspections involving safety and health. \n \nCoordinated with civilian support and Federal safety and health personnel to enforce safety regulation and reduce sailor and government civilian occupational injuries/illnesses during a 6-month shipyard period. Industrial Hygiene Officer USS Nimitz (CVN 68) 2005  –  2007  (2 years) Performed as the ship's Assistant Safety Officer and Environmental Protection Coordinator and Safety Department Division Officer managing and mentoring 12 junior and senior enlisted personnel.  \n \nProvided industrial hygiene exptertise to the ship's leadership for over 5,000 embarked ship and Air Wing personnel. Developed new resources and tools to improve the health of the crew pierside and underway periods, including a 6- month deployment to the Arabian Gulf.  \n \nPerformed daily oversight safety walk-throughs and administrative management of the ship's Occupational Safety and Health (OSH) programs. \n \nPerformed asbestos identification through Polarized Light Microscopy and heavy metal paint analysis using X-ray Fluorescence equipment. \n \nDirected the OSH program preparation efforts for 4 major shipwide inspections involving safety and health. \n \nCoordinated with civilian support and Federal safety and health personnel to enforce safety regulation and reduce sailor and government civilian occupational injuries/illnesses during a 6-month shipyard period. Industrial Hygiene Officer Navy Environmental and Preventive Medicine Unit SIX (NEPMU6) December 2001  –  December 2004  (3 years 1 month) Pearl Harbor, HI Conducted industrial hygiene surveys onboard surface ships, submarines, and shore facilities. Surveys included walk-throughs of work spaces, air sampling of chemical and industrial processes, noise monitoring, and recommendation of engineering and administrative control strategies. \n \nPerformed as Chemical Component Manager and Assistant Officer-in-Charge of a Forward Deployed Preventive Medicine Unit (FDPMU) team. The FDPMU was comprised of 12 Navy Medicine professionals and was designed to provide preventive medicine support to U.S. forces in any theatre of operations. The team infrastructure included equipment capable of providing sampling and analysis of Toxic Industrial Chemicals (TIC) and Toxic Industrial Materials (TIM), biological hazards,Performed as Assistant Officer-in-Charge of a team comprised of 12 Navy Medicine professionals. \n \nWorked closely with local, state, and Federal emergency response units to provide collection, laboratory analysis, and risk communication of suspected chemical and biological weapons in the aftermath of Sept 11, 2001. Industrial Hygiene Officer Navy Environmental and Preventive Medicine Unit SIX (NEPMU6) December 2001  –  December 2004  (3 years 1 month) Pearl Harbor, HI Conducted industrial hygiene surveys onboard surface ships, submarines, and shore facilities. Surveys included walk-throughs of work spaces, air sampling of chemical and industrial processes, noise monitoring, and recommendation of engineering and administrative control strategies. \n \nPerformed as Chemical Component Manager and Assistant Officer-in-Charge of a Forward Deployed Preventive Medicine Unit (FDPMU) team. The FDPMU was comprised of 12 Navy Medicine professionals and was designed to provide preventive medicine support to U.S. forces in any theatre of operations. The team infrastructure included equipment capable of providing sampling and analysis of Toxic Industrial Chemicals (TIC) and Toxic Industrial Materials (TIM), biological hazards,Performed as Assistant Officer-in-Charge of a team comprised of 12 Navy Medicine professionals. \n \nWorked closely with local, state, and Federal emergency response units to provide collection, laboratory analysis, and risk communication of suspected chemical and biological weapons in the aftermath of Sept 11, 2001. Industrial Hygienist Intel Corporation May 2000  –  September 2001  (1 year 5 months) Teamed with industrial hygienists from Intel locations worldwide to develop Intel’s industrial hygiene policies and to develop strategies for efficient completion of comprehensive exposure assessment plans. \n \nPerformed baseline assessments of worker exposures to chemical and ionizing/non-ionizing radiation to evaluate and document new chip manufacturing technology equipment. \n \nPerformed training in the areas of chemical awareness, hearing conservation, respiratory protection, personal protective equipment, risk communication, and other health and safety topics to affected employees and their supervisors. Industrial Hygienist Intel Corporation May 2000  –  September 2001  (1 year 5 months) Teamed with industrial hygienists from Intel locations worldwide to develop Intel’s industrial hygiene policies and to develop strategies for efficient completion of comprehensive exposure assessment plans. \n \nPerformed baseline assessments of worker exposures to chemical and ionizing/non-ionizing radiation to evaluate and document new chip manufacturing technology equipment. \n \nPerformed training in the areas of chemical awareness, hearing conservation, respiratory protection, personal protective equipment, risk communication, and other health and safety topics to affected employees and their supervisors. EHS Specialist EORM, Inc. June 1999  –  May 2000  (1 year) Performed comprehensive baseline exposure assessment of worker exposures and performed Environmental, Health, and Safety training for workers in various semiconductor manufacturing facilities in the Silicon Valley area. EHS Specialist EORM, Inc. June 1999  –  May 2000  (1 year) Performed comprehensive baseline exposure assessment of worker exposures and performed Environmental, Health, and Safety training for workers in various semiconductor manufacturing facilities in the Silicon Valley area. Skills Industrial Hygiene Risk Assessment Program Management Industrial Safety Training Team Building Hazardous Materials Navy Safety Management... Command Hazard Recognition Asbestos Hazard Analysis Military Experience Environmental Health Risk Management Inspection See 2+     See less Skills  Industrial Hygiene Risk Assessment Program Management Industrial Safety Training Team Building Hazardous Materials Navy Safety Management... Command Hazard Recognition Asbestos Hazard Analysis Military Experience Environmental Health Risk Management Inspection See 2+     See less Industrial Hygiene Risk Assessment Program Management Industrial Safety Training Team Building Hazardous Materials Navy Safety Management... Command Hazard Recognition Asbestos Hazard Analysis Military Experience Environmental Health Risk Management Inspection See 2+     See less Industrial Hygiene Risk Assessment Program Management Industrial Safety Training Team Building Hazardous Materials Navy Safety Management... Command Hazard Recognition Asbestos Hazard Analysis Military Experience Environmental Health Risk Management Inspection See 2+     See less Education University of California, Los Angeles Master of Science,  Environmental Health Sciences 1997  – 1999 University of Arizona BS,  Environmental Science 1992  – 1997 University of California, Los Angeles Master of Science,  Environmental Health Sciences 1997  – 1999 University of California, Los Angeles Master of Science,  Environmental Health Sciences 1997  – 1999 University of California, Los Angeles Master of Science,  Environmental Health Sciences 1997  – 1999 University of Arizona BS,  Environmental Science 1992  – 1997 University of Arizona BS,  Environmental Science 1992  – 1997 University of Arizona BS,  Environmental Science 1992  – 1997 ", "Experience Technology Development Environmental Engineer/Industrial Hygienist Intel Corporation July 2008  – Present (7 years 2 months) Hillsboro, Oregon •\tProvide air, water and waste modeling (quantitative analysis) of new manufacturing technologies being developed within Intel's Technology Development Fabrication facility in Oregon, to determine levels of chemical emissions that would result from manufacturing processes after transfer to manufacturing sites in the US, Europe and Israel, with intent to determine impact to existing facilities and permits, as well as determine need for any new environmental management/utility systems and/or permitting changes \n•\tProvide environmental and safety review of designs for new building and environmental management/utility systems to ensure building code and environmental regulatory compliance upon installation and transfer to other manufacturing sites \n•\tProvide quantitative and qualitative assessments of new chemical uses to determine exposure potential and need for additional engineering, administrative and/or PPE controls \n•\tProvide environmental and industrial hygiene assistance to R&D labs onsite to allow for small-scale manufacturing, transport and use of proprietary chemicals Environmental Engineer/Industrial Hygienist Intel Corporation March 2006  –  July 2008  (2 years 5 months) Colorado Springs, Colorado Area •\tTeam lead for environmental programs for a facility that was an EPA Performance Track Member, as well as a member of the Environmental Leadership Program in the State of Colorado \n•\tAir Program Owner for a synthetic minor source facility in Colorado Springs, and a minor source in Fort Collins Colorado. Hazardous Waste Program for 4 (1 LQG, 3 CESQGs) Intel CO campuses. Water program owner for an industrial user who made use of >400,000 gallons/day. Implemented a zero-exposure stormwater program. Received many recognitions for efforts to drive program excellence, and received zero NOVs and deficiencies from State inspections \n•\tIndustrial Hygiene Program Owner. Performed many exposure assessments and ensured appropriate documentation was provided to internal customers and placed within the Site's compliance files. Provided for quarterly internal audits of program health (16 programs) and ensured appropriate program coverage among many owners of different program elements and stakeholders. Ensured 100% compliance with State-specific ionizing radiation requirements. Enjoyed zero IH-related recordables during course of my team leadership A/T EHS Technology-Transfer Coordinator Intel Corporation July 2005  –  March 2006  (9 months) Chandler, Arizona •\tDeveloped the role for the EHS Technology Transfer Program Manager in Arizona, which was the technology-development site for manufacturing processes transferred to Central America and Asia. Ensured the effective representation of the EHS Focus Area within the development process and owned completion of EHS-related deliverables for developing CPU (microprocessor) platforms \n•\tDeveloped and maintained a communication system with all receiving sites in Central America and Asia by running EHS-coordination meetings and associated efforts, and providing representation in Construction, Equipment, and other regional coordination meetings \n•\tProvided approval and appropriate communication of all changes routed through the spec and white-paper systems for all CPU (microprocessor) platforms Regional Industrial Hygienist Intel Corporation May 2004  –  July 2005  (1 year 3 months) Cavite, Philippines; Shanghai, China; Penang, Malaysia •\tCompleted an expat assignment which entailed 3 separate 4-month assignments within the Philippines, China and Malaysia manufacturing sites (1 year total) \n•\tConducted Corporate audits of IH Program implementation within the region and assisted in the closure of all audit gaps/findings \n•\tDeveloped and implemented a training program for EHS Professionals that are responsible for implementation of Intel Industrial Hygiene programs, which included the development and administration of a professional capabilities self-assessment (intended to gauge and promote individual professional growth), 22 training packages, and a formal mentorship program. In addition, over 70 group trainings were conducted in support of this program  \n•\tDrafted and implemented formal BKMs for the Intel Chemical Approval, Hazard Communication and Ventilation Programs, which enabled the more efficient identification of program requirements and how to comply within the A/T business unit \n•\tDeveloped and implemented a regional coverage model for the support of Industrial Hygiene Programs within Intel’s Asia region Environmental Engineer/Industrial Hygienist Intel Corporation September 2000  –  May 2004  (3 years 9 months) Chandler, Arizona •\tDesigned and implemented the Exposure Assessment Program across all Assembly Test (APAC) sites – Received Divisional Recognition Award for effort \n•\tDeveloped Technology Transfer program for Environmental and IH disciplines including methodologies and tools ensuring effective Exposure Assessments, Chemical Approval, and Tool Assessments, and passdown to APAC receiving sites \n•\tOwned the Exposure Assessment, Radiation Safety (certified RSO), Ventilation Design, Respiratory Protection, Chemical Use Approval, and Indoor Air Quality for a manufacturing site with 12,000 employees (Intel’s Arizona site) \n•\tDrove development of several web-based training packages including Emergency Response, Lead Safety, Radiation Safety, and HazCom Workplace-Specific Hazard Training \n•\tOwned the Hazardous Waste and Air Emission Programs for 3 (1 LQG, 2SQGs) Intel AZ campuses. Ensured compliance through continual self and cross-site audits. Received 0 NOVs through 2 State agency inspections. \n•\tImplemented Bio-threat Program involving a Security and EHS partnership at the Arizona site \n•\tServed as the EHS single point of contact for site’s 3 Emergency Response Teams Industrial Hygiene Intern Eli Lilly and Company May 2000  –  September 2000  (5 months) Indianapolis, Indiana Area •\tImplemented a qualitative hazard assessment program in accordance with OSHA’s Laboratory Safety standard \n•\tPerformed a placebo-based exposure assessment program for toxicologists working with powdered recombinant hormone formulations \n•\tScrubbed and updated existing industrial hygiene policies Plumbers Apprentice Metropolitan Mechanical Contractors June 1998  –  May 2000  (2 years) Greater Minneapolis-St. Paul Area •\tDuring school breaks, I assisted with the installation of water and waste plumbing systems at the Minnesota Wild Arena as a plumbers apprentice within union Local 32 (St. Paul, MN). Technology Development Environmental Engineer/Industrial Hygienist Intel Corporation July 2008  – Present (7 years 2 months) Hillsboro, Oregon •\tProvide air, water and waste modeling (quantitative analysis) of new manufacturing technologies being developed within Intel's Technology Development Fabrication facility in Oregon, to determine levels of chemical emissions that would result from manufacturing processes after transfer to manufacturing sites in the US, Europe and Israel, with intent to determine impact to existing facilities and permits, as well as determine need for any new environmental management/utility systems and/or permitting changes \n•\tProvide environmental and safety review of designs for new building and environmental management/utility systems to ensure building code and environmental regulatory compliance upon installation and transfer to other manufacturing sites \n•\tProvide quantitative and qualitative assessments of new chemical uses to determine exposure potential and need for additional engineering, administrative and/or PPE controls \n•\tProvide environmental and industrial hygiene assistance to R&D labs onsite to allow for small-scale manufacturing, transport and use of proprietary chemicals Technology Development Environmental Engineer/Industrial Hygienist Intel Corporation July 2008  – Present (7 years 2 months) Hillsboro, Oregon •\tProvide air, water and waste modeling (quantitative analysis) of new manufacturing technologies being developed within Intel's Technology Development Fabrication facility in Oregon, to determine levels of chemical emissions that would result from manufacturing processes after transfer to manufacturing sites in the US, Europe and Israel, with intent to determine impact to existing facilities and permits, as well as determine need for any new environmental management/utility systems and/or permitting changes \n•\tProvide environmental and safety review of designs for new building and environmental management/utility systems to ensure building code and environmental regulatory compliance upon installation and transfer to other manufacturing sites \n•\tProvide quantitative and qualitative assessments of new chemical uses to determine exposure potential and need for additional engineering, administrative and/or PPE controls \n•\tProvide environmental and industrial hygiene assistance to R&D labs onsite to allow for small-scale manufacturing, transport and use of proprietary chemicals Environmental Engineer/Industrial Hygienist Intel Corporation March 2006  –  July 2008  (2 years 5 months) Colorado Springs, Colorado Area •\tTeam lead for environmental programs for a facility that was an EPA Performance Track Member, as well as a member of the Environmental Leadership Program in the State of Colorado \n•\tAir Program Owner for a synthetic minor source facility in Colorado Springs, and a minor source in Fort Collins Colorado. Hazardous Waste Program for 4 (1 LQG, 3 CESQGs) Intel CO campuses. Water program owner for an industrial user who made use of >400,000 gallons/day. Implemented a zero-exposure stormwater program. Received many recognitions for efforts to drive program excellence, and received zero NOVs and deficiencies from State inspections \n•\tIndustrial Hygiene Program Owner. Performed many exposure assessments and ensured appropriate documentation was provided to internal customers and placed within the Site's compliance files. Provided for quarterly internal audits of program health (16 programs) and ensured appropriate program coverage among many owners of different program elements and stakeholders. Ensured 100% compliance with State-specific ionizing radiation requirements. Enjoyed zero IH-related recordables during course of my team leadership Environmental Engineer/Industrial Hygienist Intel Corporation March 2006  –  July 2008  (2 years 5 months) Colorado Springs, Colorado Area •\tTeam lead for environmental programs for a facility that was an EPA Performance Track Member, as well as a member of the Environmental Leadership Program in the State of Colorado \n•\tAir Program Owner for a synthetic minor source facility in Colorado Springs, and a minor source in Fort Collins Colorado. Hazardous Waste Program for 4 (1 LQG, 3 CESQGs) Intel CO campuses. Water program owner for an industrial user who made use of >400,000 gallons/day. Implemented a zero-exposure stormwater program. Received many recognitions for efforts to drive program excellence, and received zero NOVs and deficiencies from State inspections \n•\tIndustrial Hygiene Program Owner. Performed many exposure assessments and ensured appropriate documentation was provided to internal customers and placed within the Site's compliance files. Provided for quarterly internal audits of program health (16 programs) and ensured appropriate program coverage among many owners of different program elements and stakeholders. Ensured 100% compliance with State-specific ionizing radiation requirements. Enjoyed zero IH-related recordables during course of my team leadership A/T EHS Technology-Transfer Coordinator Intel Corporation July 2005  –  March 2006  (9 months) Chandler, Arizona •\tDeveloped the role for the EHS Technology Transfer Program Manager in Arizona, which was the technology-development site for manufacturing processes transferred to Central America and Asia. Ensured the effective representation of the EHS Focus Area within the development process and owned completion of EHS-related deliverables for developing CPU (microprocessor) platforms \n•\tDeveloped and maintained a communication system with all receiving sites in Central America and Asia by running EHS-coordination meetings and associated efforts, and providing representation in Construction, Equipment, and other regional coordination meetings \n•\tProvided approval and appropriate communication of all changes routed through the spec and white-paper systems for all CPU (microprocessor) platforms A/T EHS Technology-Transfer Coordinator Intel Corporation July 2005  –  March 2006  (9 months) Chandler, Arizona •\tDeveloped the role for the EHS Technology Transfer Program Manager in Arizona, which was the technology-development site for manufacturing processes transferred to Central America and Asia. Ensured the effective representation of the EHS Focus Area within the development process and owned completion of EHS-related deliverables for developing CPU (microprocessor) platforms \n•\tDeveloped and maintained a communication system with all receiving sites in Central America and Asia by running EHS-coordination meetings and associated efforts, and providing representation in Construction, Equipment, and other regional coordination meetings \n•\tProvided approval and appropriate communication of all changes routed through the spec and white-paper systems for all CPU (microprocessor) platforms Regional Industrial Hygienist Intel Corporation May 2004  –  July 2005  (1 year 3 months) Cavite, Philippines; Shanghai, China; Penang, Malaysia •\tCompleted an expat assignment which entailed 3 separate 4-month assignments within the Philippines, China and Malaysia manufacturing sites (1 year total) \n•\tConducted Corporate audits of IH Program implementation within the region and assisted in the closure of all audit gaps/findings \n•\tDeveloped and implemented a training program for EHS Professionals that are responsible for implementation of Intel Industrial Hygiene programs, which included the development and administration of a professional capabilities self-assessment (intended to gauge and promote individual professional growth), 22 training packages, and a formal mentorship program. In addition, over 70 group trainings were conducted in support of this program  \n•\tDrafted and implemented formal BKMs for the Intel Chemical Approval, Hazard Communication and Ventilation Programs, which enabled the more efficient identification of program requirements and how to comply within the A/T business unit \n•\tDeveloped and implemented a regional coverage model for the support of Industrial Hygiene Programs within Intel’s Asia region Regional Industrial Hygienist Intel Corporation May 2004  –  July 2005  (1 year 3 months) Cavite, Philippines; Shanghai, China; Penang, Malaysia •\tCompleted an expat assignment which entailed 3 separate 4-month assignments within the Philippines, China and Malaysia manufacturing sites (1 year total) \n•\tConducted Corporate audits of IH Program implementation within the region and assisted in the closure of all audit gaps/findings \n•\tDeveloped and implemented a training program for EHS Professionals that are responsible for implementation of Intel Industrial Hygiene programs, which included the development and administration of a professional capabilities self-assessment (intended to gauge and promote individual professional growth), 22 training packages, and a formal mentorship program. In addition, over 70 group trainings were conducted in support of this program  \n•\tDrafted and implemented formal BKMs for the Intel Chemical Approval, Hazard Communication and Ventilation Programs, which enabled the more efficient identification of program requirements and how to comply within the A/T business unit \n•\tDeveloped and implemented a regional coverage model for the support of Industrial Hygiene Programs within Intel’s Asia region Environmental Engineer/Industrial Hygienist Intel Corporation September 2000  –  May 2004  (3 years 9 months) Chandler, Arizona •\tDesigned and implemented the Exposure Assessment Program across all Assembly Test (APAC) sites – Received Divisional Recognition Award for effort \n•\tDeveloped Technology Transfer program for Environmental and IH disciplines including methodologies and tools ensuring effective Exposure Assessments, Chemical Approval, and Tool Assessments, and passdown to APAC receiving sites \n•\tOwned the Exposure Assessment, Radiation Safety (certified RSO), Ventilation Design, Respiratory Protection, Chemical Use Approval, and Indoor Air Quality for a manufacturing site with 12,000 employees (Intel’s Arizona site) \n•\tDrove development of several web-based training packages including Emergency Response, Lead Safety, Radiation Safety, and HazCom Workplace-Specific Hazard Training \n•\tOwned the Hazardous Waste and Air Emission Programs for 3 (1 LQG, 2SQGs) Intel AZ campuses. Ensured compliance through continual self and cross-site audits. Received 0 NOVs through 2 State agency inspections. \n•\tImplemented Bio-threat Program involving a Security and EHS partnership at the Arizona site \n•\tServed as the EHS single point of contact for site’s 3 Emergency Response Teams Environmental Engineer/Industrial Hygienist Intel Corporation September 2000  –  May 2004  (3 years 9 months) Chandler, Arizona •\tDesigned and implemented the Exposure Assessment Program across all Assembly Test (APAC) sites – Received Divisional Recognition Award for effort \n•\tDeveloped Technology Transfer program for Environmental and IH disciplines including methodologies and tools ensuring effective Exposure Assessments, Chemical Approval, and Tool Assessments, and passdown to APAC receiving sites \n•\tOwned the Exposure Assessment, Radiation Safety (certified RSO), Ventilation Design, Respiratory Protection, Chemical Use Approval, and Indoor Air Quality for a manufacturing site with 12,000 employees (Intel’s Arizona site) \n•\tDrove development of several web-based training packages including Emergency Response, Lead Safety, Radiation Safety, and HazCom Workplace-Specific Hazard Training \n•\tOwned the Hazardous Waste and Air Emission Programs for 3 (1 LQG, 2SQGs) Intel AZ campuses. Ensured compliance through continual self and cross-site audits. Received 0 NOVs through 2 State agency inspections. \n•\tImplemented Bio-threat Program involving a Security and EHS partnership at the Arizona site \n•\tServed as the EHS single point of contact for site’s 3 Emergency Response Teams Industrial Hygiene Intern Eli Lilly and Company May 2000  –  September 2000  (5 months) Indianapolis, Indiana Area •\tImplemented a qualitative hazard assessment program in accordance with OSHA’s Laboratory Safety standard \n•\tPerformed a placebo-based exposure assessment program for toxicologists working with powdered recombinant hormone formulations \n•\tScrubbed and updated existing industrial hygiene policies Industrial Hygiene Intern Eli Lilly and Company May 2000  –  September 2000  (5 months) Indianapolis, Indiana Area •\tImplemented a qualitative hazard assessment program in accordance with OSHA’s Laboratory Safety standard \n•\tPerformed a placebo-based exposure assessment program for toxicologists working with powdered recombinant hormone formulations \n•\tScrubbed and updated existing industrial hygiene policies Plumbers Apprentice Metropolitan Mechanical Contractors June 1998  –  May 2000  (2 years) Greater Minneapolis-St. Paul Area •\tDuring school breaks, I assisted with the installation of water and waste plumbing systems at the Minnesota Wild Arena as a plumbers apprentice within union Local 32 (St. Paul, MN). Plumbers Apprentice Metropolitan Mechanical Contractors June 1998  –  May 2000  (2 years) Greater Minneapolis-St. Paul Area •\tDuring school breaks, I assisted with the installation of water and waste plumbing systems at the Minnesota Wild Arena as a plumbers apprentice within union Local 32 (St. Paul, MN). Skills Industrial Hygiene EHS Hazardous Waste... Environmental Compliance Program Management Environmental Awareness Manufacturing Engineering Testing Water Software Documentation R&D Chemistry Team Leadership Environmental Impact... Auditing Risk Assessment Root Cause Analysis Cross-functional Team... See 4+     See less Skills  Industrial Hygiene EHS Hazardous Waste... Environmental Compliance Program Management Environmental Awareness Manufacturing Engineering Testing Water Software Documentation R&D Chemistry Team Leadership Environmental Impact... Auditing Risk Assessment Root Cause Analysis Cross-functional Team... See 4+     See less Industrial Hygiene EHS Hazardous Waste... Environmental Compliance Program Management Environmental Awareness Manufacturing Engineering Testing Water Software Documentation R&D Chemistry Team Leadership Environmental Impact... Auditing Risk Assessment Root Cause Analysis Cross-functional Team... See 4+     See less Industrial Hygiene EHS Hazardous Waste... Environmental Compliance Program Management Environmental Awareness Manufacturing Engineering Testing Water Software Documentation R&D Chemistry Team Leadership Environmental Impact... Auditing Risk Assessment Root Cause Analysis Cross-functional Team... See 4+     See less Education University of Minnesota-Duluth Master of Industrial Safety,  Occupational Health and Industrial Hygiene , 3.77 1998  – 2000 University of Minnesota-Duluth Master of Science (MS),  Cellular and Physiological Biology , 3.67 1996  – 1998 Honors and Scholarships: \n- 3 published papers within peer-reviewed journals \n- Two Graduate Research Fellowships \n- Graduate Research Assistantship University of Minnesota-Duluth Bachelor of Science (BS),  Biology ,  Chemistry , 3.37 1992  – 1996 Honors and Scholarships: \n- Two-time UROP Scholarship Award Winner \n- Nationally Certified Chemistry Tutor \n- Dean’s List Activities and Societies:  Rugby Football Club University of Minnesota-Duluth Master of Industrial Safety,  Occupational Health and Industrial Hygiene , 3.77 1998  – 2000 University of Minnesota-Duluth Master of Industrial Safety,  Occupational Health and Industrial Hygiene , 3.77 1998  – 2000 University of Minnesota-Duluth Master of Industrial Safety,  Occupational Health and Industrial Hygiene , 3.77 1998  – 2000 University of Minnesota-Duluth Master of Science (MS),  Cellular and Physiological Biology , 3.67 1996  – 1998 Honors and Scholarships: \n- 3 published papers within peer-reviewed journals \n- Two Graduate Research Fellowships \n- Graduate Research Assistantship University of Minnesota-Duluth Master of Science (MS),  Cellular and Physiological Biology , 3.67 1996  – 1998 Honors and Scholarships: \n- 3 published papers within peer-reviewed journals \n- Two Graduate Research Fellowships \n- Graduate Research Assistantship University of Minnesota-Duluth Master of Science (MS),  Cellular and Physiological Biology , 3.67 1996  – 1998 Honors and Scholarships: \n- 3 published papers within peer-reviewed journals \n- Two Graduate Research Fellowships \n- Graduate Research Assistantship University of Minnesota-Duluth Bachelor of Science (BS),  Biology ,  Chemistry , 3.37 1992  – 1996 Honors and Scholarships: \n- Two-time UROP Scholarship Award Winner \n- Nationally Certified Chemistry Tutor \n- Dean’s List Activities and Societies:  Rugby Football Club University of Minnesota-Duluth Bachelor of Science (BS),  Biology ,  Chemistry , 3.37 1992  – 1996 Honors and Scholarships: \n- Two-time UROP Scholarship Award Winner \n- Nationally Certified Chemistry Tutor \n- Dean’s List Activities and Societies:  Rugby Football Club University of Minnesota-Duluth Bachelor of Science (BS),  Biology ,  Chemistry , 3.37 1992  – 1996 Honors and Scholarships: \n- Two-time UROP Scholarship Award Winner \n- Nationally Certified Chemistry Tutor \n- Dean’s List Activities and Societies:  Rugby Football Club ", "Experience Industrial Hygienist Intel Corporation August 2011  –  July 2013  (2 years) Phoenix, Arizona Area Industrial Hygiene Intern Tesoro June 2010  –  August 2011  (1 year 3 months) Long Beach, CA Neuroendocrine Clinical Trials David Geffen School of Medicine, UCLA October 2008  –  April 2010  (1 year 7 months) Greater Los Angeles Area fMRI Neuroimaging Researcher UCLA June 2005  –  June 2008  (3 years 1 month) Industrial Hygienist Intel Corporation August 2011  –  July 2013  (2 years) Phoenix, Arizona Area Industrial Hygienist Intel Corporation August 2011  –  July 2013  (2 years) Phoenix, Arizona Area Industrial Hygiene Intern Tesoro June 2010  –  August 2011  (1 year 3 months) Long Beach, CA Industrial Hygiene Intern Tesoro June 2010  –  August 2011  (1 year 3 months) Long Beach, CA Neuroendocrine Clinical Trials David Geffen School of Medicine, UCLA October 2008  –  April 2010  (1 year 7 months) Greater Los Angeles Area Neuroendocrine Clinical Trials David Geffen School of Medicine, UCLA October 2008  –  April 2010  (1 year 7 months) Greater Los Angeles Area fMRI Neuroimaging Researcher UCLA June 2005  –  June 2008  (3 years 1 month) fMRI Neuroimaging Researcher UCLA June 2005  –  June 2008  (3 years 1 month) Languages Farsi Farsi Farsi Skills Industrial Hygiene Occupational Health Exposure Assessment Industrial Safety Ergonomics Hazardous Waste... EHS Chemical Safety Environmental Compliance Public Health Asbestos Risk Assessment Hearing Conservation HAZCOM Respirator Fit Testing Statistics Hazardous Substances Arsenic Ventilation Job Hazard Analysis respiratory protection Hydrotherapy Hazard Recognition See 8+     See less Skills  Industrial Hygiene Occupational Health Exposure Assessment Industrial Safety Ergonomics Hazardous Waste... EHS Chemical Safety Environmental Compliance Public Health Asbestos Risk Assessment Hearing Conservation HAZCOM Respirator Fit Testing Statistics Hazardous Substances Arsenic Ventilation Job Hazard Analysis respiratory protection Hydrotherapy Hazard Recognition See 8+     See less Industrial Hygiene Occupational Health Exposure Assessment Industrial Safety Ergonomics Hazardous Waste... EHS Chemical Safety Environmental Compliance Public Health Asbestos Risk Assessment Hearing Conservation HAZCOM Respirator Fit Testing Statistics Hazardous Substances Arsenic Ventilation Job Hazard Analysis respiratory protection Hydrotherapy Hazard Recognition See 8+     See less Industrial Hygiene Occupational Health Exposure Assessment Industrial Safety Ergonomics Hazardous Waste... EHS Chemical Safety Environmental Compliance Public Health Asbestos Risk Assessment Hearing Conservation HAZCOM Respirator Fit Testing Statistics Hazardous Substances Arsenic Ventilation Job Hazard Analysis respiratory protection Hydrotherapy Hazard Recognition See 8+     See less Education National College of Natural Medicine Doctor of Naturopathic Medicine 2013  – 2017 University of California, Los Angeles - School of Public Health MPH,  Environmental Health Science ,  Industrial Hygiene & minor in Hazardous Substances 2009  – 2011 Activities and Societies:  Industrial Hygiene Program--NIOSH ERC Grant. University of California, Los Angeles B.S.,  Neuroscience 2004  – 2008 Activities and Societies:  Neuroscience Undergraduate Society National College of Natural Medicine Doctor of Naturopathic Medicine 2013  – 2017 National College of Natural Medicine Doctor of Naturopathic Medicine 2013  – 2017 National College of Natural Medicine Doctor of Naturopathic Medicine 2013  – 2017 University of California, Los Angeles - School of Public Health MPH,  Environmental Health Science ,  Industrial Hygiene & minor in Hazardous Substances 2009  – 2011 Activities and Societies:  Industrial Hygiene Program--NIOSH ERC Grant. University of California, Los Angeles - School of Public Health MPH,  Environmental Health Science ,  Industrial Hygiene & minor in Hazardous Substances 2009  – 2011 Activities and Societies:  Industrial Hygiene Program--NIOSH ERC Grant. University of California, Los Angeles - School of Public Health MPH,  Environmental Health Science ,  Industrial Hygiene & minor in Hazardous Substances 2009  – 2011 Activities and Societies:  Industrial Hygiene Program--NIOSH ERC Grant. University of California, Los Angeles B.S.,  Neuroscience 2004  – 2008 Activities and Societies:  Neuroscience Undergraduate Society University of California, Los Angeles B.S.,  Neuroscience 2004  – 2008 Activities and Societies:  Neuroscience Undergraduate Society University of California, Los Angeles B.S.,  Neuroscience 2004  – 2008 Activities and Societies:  Neuroscience Undergraduate Society Honors & Awards ", "Experience Senior Lecturer of Public Health Utah State University August 2002  – Present (13 years 1 month) Industrial Hygienist Intel Corporation 1996  –  2002  (6 years) Senior Lecturer of Public Health Utah State University August 2002  – Present (13 years 1 month) Senior Lecturer of Public Health Utah State University August 2002  – Present (13 years 1 month) Industrial Hygienist Intel Corporation 1996  –  2002  (6 years) Industrial Hygienist Intel Corporation 1996  –  2002  (6 years) Skills Industrial Hygiene Occupational Health Risk Management Environmental Science Ergonomics Hazardous Materials Environmental Awareness Environmental Consulting Environmental Health Laboratory Sampling Radiation Safety First Aid HAZWOPER Safety Management... Public Health EHS Environmental Compliance Emergency Management Hazard Analysis Risk Assessment Environmental... Industrial Safety Root Cause Analysis Exposure Assessment Microsoft Office Auditing Hazardous Waste... Sustainability Supervisory Skills See 15+     See less Skills  Industrial Hygiene Occupational Health Risk Management Environmental Science Ergonomics Hazardous Materials Environmental Awareness Environmental Consulting Environmental Health Laboratory Sampling Radiation Safety First Aid HAZWOPER Safety Management... Public Health EHS Environmental Compliance Emergency Management Hazard Analysis Risk Assessment Environmental... Industrial Safety Root Cause Analysis Exposure Assessment Microsoft Office Auditing Hazardous Waste... Sustainability Supervisory Skills See 15+     See less Industrial Hygiene Occupational Health Risk Management Environmental Science Ergonomics Hazardous Materials Environmental Awareness Environmental Consulting Environmental Health Laboratory Sampling Radiation Safety First Aid HAZWOPER Safety Management... Public Health EHS Environmental Compliance Emergency Management Hazard Analysis Risk Assessment Environmental... Industrial Safety Root Cause Analysis Exposure Assessment Microsoft Office Auditing Hazardous Waste... Sustainability Supervisory Skills See 15+     See less Industrial Hygiene Occupational Health Risk Management Environmental Science Ergonomics Hazardous Materials Environmental Awareness Environmental Consulting Environmental Health Laboratory Sampling Radiation Safety First Aid HAZWOPER Safety Management... Public Health EHS Environmental Compliance Emergency Management Hazard Analysis Risk Assessment Environmental... Industrial Safety Root Cause Analysis Exposure Assessment Microsoft Office Auditing Hazardous Waste... Sustainability Supervisory Skills See 15+     See less Education University of Utah MPH,  Industrial Hygiene 1994  – 1996 Utah State University BS,  Industrial Hygiene 1990  – 1993 University of Utah MPH,  Industrial Hygiene 1994  – 1996 University of Utah MPH,  Industrial Hygiene 1994  – 1996 University of Utah MPH,  Industrial Hygiene 1994  – 1996 Utah State University BS,  Industrial Hygiene 1990  – 1993 Utah State University BS,  Industrial Hygiene 1990  – 1993 Utah State University BS,  Industrial Hygiene 1990  – 1993 ", "Summary Manage EHS and ISO 14001 compliance efforts at Oracle \n \nIndustrial hygiene and safety consulting: Hazcon and Succeed \n \nEnvironmental, health, safety, and security specialist at a marine terminal: J.R. Simplot Company \n \nIndustrial hygiene and safety support of semiconductor fabs and support areas: Intel Corporation Specialties:Certified Industrial Hygienist; \nCertified Safety Professional; \nAssociate in Risk Management Summary Manage EHS and ISO 14001 compliance efforts at Oracle \n \nIndustrial hygiene and safety consulting: Hazcon and Succeed \n \nEnvironmental, health, safety, and security specialist at a marine terminal: J.R. Simplot Company \n \nIndustrial hygiene and safety support of semiconductor fabs and support areas: Intel Corporation Specialties:Certified Industrial Hygienist; \nCertified Safety Professional; \nAssociate in Risk Management Manage EHS and ISO 14001 compliance efforts at Oracle \n \nIndustrial hygiene and safety consulting: Hazcon and Succeed \n \nEnvironmental, health, safety, and security specialist at a marine terminal: J.R. Simplot Company \n \nIndustrial hygiene and safety support of semiconductor fabs and support areas: Intel Corporation Specialties:Certified Industrial Hygienist; \nCertified Safety Professional; \nAssociate in Risk Management Manage EHS and ISO 14001 compliance efforts at Oracle \n \nIndustrial hygiene and safety consulting: Hazcon and Succeed \n \nEnvironmental, health, safety, and security specialist at a marine terminal: J.R. Simplot Company \n \nIndustrial hygiene and safety support of semiconductor fabs and support areas: Intel Corporation Specialties:Certified Industrial Hygienist; \nCertified Safety Professional; \nAssociate in Risk Management Experience EHS Consultant Antea USA November 2008  – Present (6 years 10 months) Senior Professional at Antea USA. Outsource EHS manager at Oracle manufacturing facility in Hillsboro, OR. Ensure compliance with EHS policies and regulations. Manage site environmental management system to maintain ISO 14001 certification. Drive improvement in safety performance of the organization. Lead and track waste reduction efforts in manufacturing and other operations. Cross-site EHS auditing. Industrial Hygienist Succeed Safety and Health Services November 2007  –  November 2008  (1 year 1 month) Industrial hygiene and safety consulting at a variety of industrial facilities, for large and small industrial employers and insurance companies. Hazwoper trainer. EHSS Specialist J.R. Simplot Co. 2004  –  2007  (3 years) Fertilizer import terminal; a process safety management (PSM) facility. Ensured compliance with relevant EHS and security regulations. Training. Owned Emergency Response plan. Primary contact for regulatory agencies. EHS Coordinator/Industrial Hygienist Intel Corporation June 1995  –  June 2003  (8 years 1 month) Hillsboro, OR Exposure Assessment Team: Chaired cross-site team for a year to develop and implement exposure assessment program across all Intel chip factories -- estimated 5000 hr/yr saved as a result of program implementation. Led cross-site task force to investigate and resolve process-related odor concerns to alleviate anxiety in factory population.  \nIH Joint Engineering Team: Chaired a group that developed and implemented cross-site programs, including PPE, Respiratory Protection, Hazcom, Ventilation, and Hearing Conservation. Reduced redundant work and time to action on shared issues worldwide. \nRespiratory Protection: Led team that made major upgrades to Respirator Program. Drove continuous improvement of program after the upgrade. Greatly improved OSHA compliance, equipment performance, and employee usability. \nProgram Management: Implemented and maintained Respirator, Hazcom, Chemical Approval, Hearing Conservation, Arsenic, Asbestos, and Lab Safety programs.  \nDeveloped safety training curricula for factory population, identified gaps, and ensured implementation of needed changes. \nPerformed IH surveys and hazard evaluations in semiconductor factories, labs and office environments. Partnered with campus customers to resolve IH-related issues. EHS Consultant Antea USA November 2008  – Present (6 years 10 months) Senior Professional at Antea USA. Outsource EHS manager at Oracle manufacturing facility in Hillsboro, OR. Ensure compliance with EHS policies and regulations. Manage site environmental management system to maintain ISO 14001 certification. Drive improvement in safety performance of the organization. Lead and track waste reduction efforts in manufacturing and other operations. Cross-site EHS auditing. EHS Consultant Antea USA November 2008  – Present (6 years 10 months) Senior Professional at Antea USA. Outsource EHS manager at Oracle manufacturing facility in Hillsboro, OR. Ensure compliance with EHS policies and regulations. Manage site environmental management system to maintain ISO 14001 certification. Drive improvement in safety performance of the organization. Lead and track waste reduction efforts in manufacturing and other operations. Cross-site EHS auditing. Industrial Hygienist Succeed Safety and Health Services November 2007  –  November 2008  (1 year 1 month) Industrial hygiene and safety consulting at a variety of industrial facilities, for large and small industrial employers and insurance companies. Hazwoper trainer. Industrial Hygienist Succeed Safety and Health Services November 2007  –  November 2008  (1 year 1 month) Industrial hygiene and safety consulting at a variety of industrial facilities, for large and small industrial employers and insurance companies. Hazwoper trainer. EHSS Specialist J.R. Simplot Co. 2004  –  2007  (3 years) Fertilizer import terminal; a process safety management (PSM) facility. Ensured compliance with relevant EHS and security regulations. Training. Owned Emergency Response plan. Primary contact for regulatory agencies. EHSS Specialist J.R. Simplot Co. 2004  –  2007  (3 years) Fertilizer import terminal; a process safety management (PSM) facility. Ensured compliance with relevant EHS and security regulations. Training. Owned Emergency Response plan. Primary contact for regulatory agencies. EHS Coordinator/Industrial Hygienist Intel Corporation June 1995  –  June 2003  (8 years 1 month) Hillsboro, OR Exposure Assessment Team: Chaired cross-site team for a year to develop and implement exposure assessment program across all Intel chip factories -- estimated 5000 hr/yr saved as a result of program implementation. Led cross-site task force to investigate and resolve process-related odor concerns to alleviate anxiety in factory population.  \nIH Joint Engineering Team: Chaired a group that developed and implemented cross-site programs, including PPE, Respiratory Protection, Hazcom, Ventilation, and Hearing Conservation. Reduced redundant work and time to action on shared issues worldwide. \nRespiratory Protection: Led team that made major upgrades to Respirator Program. Drove continuous improvement of program after the upgrade. Greatly improved OSHA compliance, equipment performance, and employee usability. \nProgram Management: Implemented and maintained Respirator, Hazcom, Chemical Approval, Hearing Conservation, Arsenic, Asbestos, and Lab Safety programs.  \nDeveloped safety training curricula for factory population, identified gaps, and ensured implementation of needed changes. \nPerformed IH surveys and hazard evaluations in semiconductor factories, labs and office environments. Partnered with campus customers to resolve IH-related issues. EHS Coordinator/Industrial Hygienist Intel Corporation June 1995  –  June 2003  (8 years 1 month) Hillsboro, OR Exposure Assessment Team: Chaired cross-site team for a year to develop and implement exposure assessment program across all Intel chip factories -- estimated 5000 hr/yr saved as a result of program implementation. Led cross-site task force to investigate and resolve process-related odor concerns to alleviate anxiety in factory population.  \nIH Joint Engineering Team: Chaired a group that developed and implemented cross-site programs, including PPE, Respiratory Protection, Hazcom, Ventilation, and Hearing Conservation. Reduced redundant work and time to action on shared issues worldwide. \nRespiratory Protection: Led team that made major upgrades to Respirator Program. Drove continuous improvement of program after the upgrade. Greatly improved OSHA compliance, equipment performance, and employee usability. \nProgram Management: Implemented and maintained Respirator, Hazcom, Chemical Approval, Hearing Conservation, Arsenic, Asbestos, and Lab Safety programs.  \nDeveloped safety training curricula for factory population, identified gaps, and ensured implementation of needed changes. \nPerformed IH surveys and hazard evaluations in semiconductor factories, labs and office environments. Partnered with campus customers to resolve IH-related issues. Skills EHS Industrial Hygiene Emergency Management Environmental Management Safety Management ISO 14001 HAZWOPER Environmental Health Ergonomics Safety Management... Environmental... Occupational Health Industrial Safety Safety Training Hazardous Waste... Sampling Environmental Compliance Environmental Auditing Asbestos Indoor Air Quality Remediation Hazardous Materials Behavior Based Safety See 8+     See less Skills  EHS Industrial Hygiene Emergency Management Environmental Management Safety Management ISO 14001 HAZWOPER Environmental Health Ergonomics Safety Management... Environmental... Occupational Health Industrial Safety Safety Training Hazardous Waste... Sampling Environmental Compliance Environmental Auditing Asbestos Indoor Air Quality Remediation Hazardous Materials Behavior Based Safety See 8+     See less EHS Industrial Hygiene Emergency Management Environmental Management Safety Management ISO 14001 HAZWOPER Environmental Health Ergonomics Safety Management... Environmental... Occupational Health Industrial Safety Safety Training Hazardous Waste... Sampling Environmental Compliance Environmental Auditing Asbestos Indoor Air Quality Remediation Hazardous Materials Behavior Based Safety See 8+     See less EHS Industrial Hygiene Emergency Management Environmental Management Safety Management ISO 14001 HAZWOPER Environmental Health Ergonomics Safety Management... Environmental... Occupational Health Industrial Safety Safety Training Hazardous Waste... Sampling Environmental Compliance Environmental Auditing Asbestos Indoor Air Quality Remediation Hazardous Materials Behavior Based Safety See 8+     See less Education University of Washington MS,  Environmental Health Oregon State University BS,  Biology University of Washington MS,  Environmental Health University of Washington MS,  Environmental Health University of Washington MS,  Environmental Health Oregon State University BS,  Biology Oregon State University BS,  Biology Oregon State University BS,  Biology ", "Experience Environmental Improvement Board, Vice Chairman State of New Mexico February 2011  – Present (4 years 7 months) Santa Fe, New Mexico Environmental Health and Safety Audit Program Manager Intel March 1988  – Present (27 years 6 months) Certified Industrial Hygienist Intel Corporation March 1988  – Present (27 years 6 months) Environmental Improvement Board, Vice Chairman State of New Mexico February 2011  – Present (4 years 7 months) Santa Fe, New Mexico Environmental Improvement Board, Vice Chairman State of New Mexico February 2011  – Present (4 years 7 months) Santa Fe, New Mexico Environmental Health and Safety Audit Program Manager Intel March 1988  – Present (27 years 6 months) Environmental Health and Safety Audit Program Manager Intel March 1988  – Present (27 years 6 months) Certified Industrial Hygienist Intel Corporation March 1988  – Present (27 years 6 months) Certified Industrial Hygienist Intel Corporation March 1988  – Present (27 years 6 months) Skills Industrial Hygiene Environmental Health Risk Assessment Sustainability Environmental Awareness Environmental Compliance EHS Industrial Safety Occupational Health Accident Investigation Risk Management Hazardous Waste... Process Improvement Cross-functional Team... ISO 14001 Workplace Safety Hazard Analysis Hazard Recognition Ergonomics Program Management Hearing Conservation Emergency Management Construction Safety Management... Asbestos Policy Root Cause Analysis Environmental... Compliance Oversight Hazardous Materials Semiconductors Environmental Consulting HAZWOPER Auditing OHSAS18001 See 20+     See less Skills  Industrial Hygiene Environmental Health Risk Assessment Sustainability Environmental Awareness Environmental Compliance EHS Industrial Safety Occupational Health Accident Investigation Risk Management Hazardous Waste... Process Improvement Cross-functional Team... ISO 14001 Workplace Safety Hazard Analysis Hazard Recognition Ergonomics Program Management Hearing Conservation Emergency Management Construction Safety Management... Asbestos Policy Root Cause Analysis Environmental... Compliance Oversight Hazardous Materials Semiconductors Environmental Consulting HAZWOPER Auditing OHSAS18001 See 20+     See less Industrial Hygiene Environmental Health Risk Assessment Sustainability Environmental Awareness Environmental Compliance EHS Industrial Safety Occupational Health Accident Investigation Risk Management Hazardous Waste... Process Improvement Cross-functional Team... ISO 14001 Workplace Safety Hazard Analysis Hazard Recognition Ergonomics Program Management Hearing Conservation Emergency Management Construction Safety Management... Asbestos Policy Root Cause Analysis Environmental... Compliance Oversight Hazardous Materials Semiconductors Environmental Consulting HAZWOPER Auditing OHSAS18001 See 20+     See less Industrial Hygiene Environmental Health Risk Assessment Sustainability Environmental Awareness Environmental Compliance EHS Industrial Safety Occupational Health Accident Investigation Risk Management Hazardous Waste... Process Improvement Cross-functional Team... ISO 14001 Workplace Safety Hazard Analysis Hazard Recognition Ergonomics Program Management Hearing Conservation Emergency Management Construction Safety Management... Asbestos Policy Root Cause Analysis Environmental... Compliance Oversight Hazardous Materials Semiconductors Environmental Consulting HAZWOPER Auditing OHSAS18001 See 20+     See less Education Colorado State University M.S.,  Industrial Hygiene 1985  – 1988 Colorado State University B.S.,  Environmental Health 1977  – 1981 Colorado State University M.S.,  Industrial Hygiene 1985  – 1988 Colorado State University M.S.,  Industrial Hygiene 1985  – 1988 Colorado State University M.S.,  Industrial Hygiene 1985  – 1988 Colorado State University B.S.,  Environmental Health 1977  – 1981 Colorado State University B.S.,  Environmental Health 1977  – 1981 Colorado State University B.S.,  Environmental Health 1977  – 1981 ", "Experience Safety Engineer, Industrial Hygienist Intel Corporation August 2012  – Present (3 years 1 month) Hillsboro, OR Haz-Mat Supervisor/Asbestos worker Belfor Environmental November 2007  –  June 2010  (2 years 8 months) Safety Engineer, Industrial Hygienist Intel Corporation August 2012  – Present (3 years 1 month) Hillsboro, OR Safety Engineer, Industrial Hygienist Intel Corporation August 2012  – Present (3 years 1 month) Hillsboro, OR Haz-Mat Supervisor/Asbestos worker Belfor Environmental November 2007  –  June 2010  (2 years 8 months) Haz-Mat Supervisor/Asbestos worker Belfor Environmental November 2007  –  June 2010  (2 years 8 months) Skills EHS Industrial Hygiene Hazardous Waste... Skills  EHS Industrial Hygiene Hazardous Waste... EHS Industrial Hygiene Hazardous Waste... EHS Industrial Hygiene Hazardous Waste... Education University of Washington School of Public Health Masters of Science,  Occupational Exposure Science 2010  – 2012 University of Washington Bachelor's of Science,  Environmental Biology 2003  – 2007 University of Washington School of Public Health Masters of Science,  Occupational Exposure Science 2010  – 2012 University of Washington School of Public Health Masters of Science,  Occupational Exposure Science 2010  – 2012 University of Washington School of Public Health Masters of Science,  Occupational Exposure Science 2010  – 2012 University of Washington Bachelor's of Science,  Environmental Biology 2003  – 2007 University of Washington Bachelor's of Science,  Environmental Biology 2003  – 2007 University of Washington Bachelor's of Science,  Environmental Biology 2003  – 2007 ", "Experience Environmental, Health & Safety Manager-Modesto Operations E. & J. Gallo Winery May 2015  – Present (4 months) Modesto, CA Environmental, Health & Safety Manager-Modesto Operations E. & J. Gallo Winery May 2015  – Present (4 months) Modesto, CA Environmental, Health & Safety Manager-Modesto Operations E. & J. Gallo Winery May 2015  – Present (4 months) Modesto, CA Languages English English English Skills Skills     ", "Experience Safety Engineer and Industrial Hygienist Intel Corporation August 2012  – Present (3 years 1 month) Hillsboro, OR • Provide guidance, interpretation, training and risk communication on EHS/IH Programs or related issues in accordance with General Industry (OSHA 1910) and corporate standards \n \n• Specialized EHS Program Focus: Hoist, Crane and Sling; Powered Industrial Trucks; Personal Protective Equipment; Exposure Assessment: Ensure compliance across manufacturing campuses of Oregon Site through auditing, record keeping, and vendor collaboration \n \n• Conduct both qualitative and quantitative industrial hygiene sampling using applicable NIOSH and OSHA methods accompanied by documentation and interpretation of results to sampled population \n \n• Assist with corporate standard and training development/implementation \n• Administrator for company behavioral based safety program \n• Incident investigation support: provides guidance on process and technical expertise \n \n• Management Safety Leadership Chair: Coordinate and lead meetings with Regional and Site Management on EHS communications and concerns: Address help needed from management for current audit findings, incidents, or any other EHS related concerns \n \n• Safety Committee Representative: Provide technical support to technician lead safety committee \n• Provide support on non-standardized work by assessing tasks and communicating EHS related standards  \n Assistant Medical Center Safety Officer - GA University of Illinois at Chicago August 2010  –  May 2012  (1 year 10 months) Greater Chicago Area • Performed weekly building safety inspections \n• Performed laboratory hood inspections \n• Logistic Section Chief for UIC Hospital Decontamination Team \n• Conducted respiratory protection fit testing and orientation safety training for hospital employees Emergency Response Team Member University of Illinois at Chicago August 2010  –  May 2012  (1 year 10 months) Greater Chicago Area • Logistics Section Chief for UIC Emergency Response Equipment  \n• 2012 NATO Summit Chicago – May 19-21, 2012 \no Assisted the Command Staff Safety Officer in preparation of FEMA camp  \no Assisted with the management of 1,400 1st responders and 50 canine units on campus \no Attended all preparatory class work for event \n• Conducted Industrial hygiene monitoring for nitrogen release incident \n• Assistant drill coordinator for UIC Emergency Response Team \n• Participated in ERT team simulations Research Assistant Ohio University August 2009  –  June 2010  (11 months) Athens, Ohio • Prepared laboratory equipment for Industrial Hygiene and Environmental Sciences Health sampling class \n• Prepared mailing list for re-accreditation of Environmental Health Program  \n• Conducted public health risk assessment of CA-MRSA in residential dormitories Compliance Intern Daniels Sharpsmart, Inc June 2009  –  August 2009  (3 months) Greater Chicago Area • Edited/Proofread safety and health standard operating procedures\t \n• Created company standard operation procedures as needed \n• Started the process of creating position specific roles and responsibility (HR) manuals \n• Created sharps container disinfectant facility auditing forms Safety Engineer and Industrial Hygienist Intel Corporation August 2012  – Present (3 years 1 month) Hillsboro, OR • Provide guidance, interpretation, training and risk communication on EHS/IH Programs or related issues in accordance with General Industry (OSHA 1910) and corporate standards \n \n• Specialized EHS Program Focus: Hoist, Crane and Sling; Powered Industrial Trucks; Personal Protective Equipment; Exposure Assessment: Ensure compliance across manufacturing campuses of Oregon Site through auditing, record keeping, and vendor collaboration \n \n• Conduct both qualitative and quantitative industrial hygiene sampling using applicable NIOSH and OSHA methods accompanied by documentation and interpretation of results to sampled population \n \n• Assist with corporate standard and training development/implementation \n• Administrator for company behavioral based safety program \n• Incident investigation support: provides guidance on process and technical expertise \n \n• Management Safety Leadership Chair: Coordinate and lead meetings with Regional and Site Management on EHS communications and concerns: Address help needed from management for current audit findings, incidents, or any other EHS related concerns \n \n• Safety Committee Representative: Provide technical support to technician lead safety committee \n• Provide support on non-standardized work by assessing tasks and communicating EHS related standards  \n Safety Engineer and Industrial Hygienist Intel Corporation August 2012  – Present (3 years 1 month) Hillsboro, OR • Provide guidance, interpretation, training and risk communication on EHS/IH Programs or related issues in accordance with General Industry (OSHA 1910) and corporate standards \n \n• Specialized EHS Program Focus: Hoist, Crane and Sling; Powered Industrial Trucks; Personal Protective Equipment; Exposure Assessment: Ensure compliance across manufacturing campuses of Oregon Site through auditing, record keeping, and vendor collaboration \n \n• Conduct both qualitative and quantitative industrial hygiene sampling using applicable NIOSH and OSHA methods accompanied by documentation and interpretation of results to sampled population \n \n• Assist with corporate standard and training development/implementation \n• Administrator for company behavioral based safety program \n• Incident investigation support: provides guidance on process and technical expertise \n \n• Management Safety Leadership Chair: Coordinate and lead meetings with Regional and Site Management on EHS communications and concerns: Address help needed from management for current audit findings, incidents, or any other EHS related concerns \n \n• Safety Committee Representative: Provide technical support to technician lead safety committee \n• Provide support on non-standardized work by assessing tasks and communicating EHS related standards  \n Assistant Medical Center Safety Officer - GA University of Illinois at Chicago August 2010  –  May 2012  (1 year 10 months) Greater Chicago Area • Performed weekly building safety inspections \n• Performed laboratory hood inspections \n• Logistic Section Chief for UIC Hospital Decontamination Team \n• Conducted respiratory protection fit testing and orientation safety training for hospital employees Assistant Medical Center Safety Officer - GA University of Illinois at Chicago August 2010  –  May 2012  (1 year 10 months) Greater Chicago Area • Performed weekly building safety inspections \n• Performed laboratory hood inspections \n• Logistic Section Chief for UIC Hospital Decontamination Team \n• Conducted respiratory protection fit testing and orientation safety training for hospital employees Emergency Response Team Member University of Illinois at Chicago August 2010  –  May 2012  (1 year 10 months) Greater Chicago Area • Logistics Section Chief for UIC Emergency Response Equipment  \n• 2012 NATO Summit Chicago – May 19-21, 2012 \no Assisted the Command Staff Safety Officer in preparation of FEMA camp  \no Assisted with the management of 1,400 1st responders and 50 canine units on campus \no Attended all preparatory class work for event \n• Conducted Industrial hygiene monitoring for nitrogen release incident \n• Assistant drill coordinator for UIC Emergency Response Team \n• Participated in ERT team simulations Emergency Response Team Member University of Illinois at Chicago August 2010  –  May 2012  (1 year 10 months) Greater Chicago Area • Logistics Section Chief for UIC Emergency Response Equipment  \n• 2012 NATO Summit Chicago – May 19-21, 2012 \no Assisted the Command Staff Safety Officer in preparation of FEMA camp  \no Assisted with the management of 1,400 1st responders and 50 canine units on campus \no Attended all preparatory class work for event \n• Conducted Industrial hygiene monitoring for nitrogen release incident \n• Assistant drill coordinator for UIC Emergency Response Team \n• Participated in ERT team simulations Research Assistant Ohio University August 2009  –  June 2010  (11 months) Athens, Ohio • Prepared laboratory equipment for Industrial Hygiene and Environmental Sciences Health sampling class \n• Prepared mailing list for re-accreditation of Environmental Health Program  \n• Conducted public health risk assessment of CA-MRSA in residential dormitories Research Assistant Ohio University August 2009  –  June 2010  (11 months) Athens, Ohio • Prepared laboratory equipment for Industrial Hygiene and Environmental Sciences Health sampling class \n• Prepared mailing list for re-accreditation of Environmental Health Program  \n• Conducted public health risk assessment of CA-MRSA in residential dormitories Compliance Intern Daniels Sharpsmart, Inc June 2009  –  August 2009  (3 months) Greater Chicago Area • Edited/Proofread safety and health standard operating procedures\t \n• Created company standard operation procedures as needed \n• Started the process of creating position specific roles and responsibility (HR) manuals \n• Created sharps container disinfectant facility auditing forms Compliance Intern Daniels Sharpsmart, Inc June 2009  –  August 2009  (3 months) Greater Chicago Area • Edited/Proofread safety and health standard operating procedures\t \n• Created company standard operation procedures as needed \n• Started the process of creating position specific roles and responsibility (HR) manuals \n• Created sharps container disinfectant facility auditing forms Skills HAZWOPER Industrial Hygiene Occupational Health Inspection Sampling Environmental Health Ergonomics Emergency Management Risk Assessment Hazard Recognition Safety Management... Industrial Safety Hazardous Waste... Environmental Compliance EPA Environmental Awareness EHS See 2+     See less Skills  HAZWOPER Industrial Hygiene Occupational Health Inspection Sampling Environmental Health Ergonomics Emergency Management Risk Assessment Hazard Recognition Safety Management... Industrial Safety Hazardous Waste... Environmental Compliance EPA Environmental Awareness EHS See 2+     See less HAZWOPER Industrial Hygiene Occupational Health Inspection Sampling Environmental Health Ergonomics Emergency Management Risk Assessment Hazard Recognition Safety Management... Industrial Safety Hazardous Waste... Environmental Compliance EPA Environmental Awareness EHS See 2+     See less HAZWOPER Industrial Hygiene Occupational Health Inspection Sampling Environmental Health Ergonomics Emergency Management Risk Assessment Hazard Recognition Safety Management... Industrial Safety Hazardous Waste... Environmental Compliance EPA Environmental Awareness EHS See 2+     See less Education University of Illinois at Chicago M.S.,  Occupational Safety 2010  – 2013 Activities and Societies:  ASSE ,  AIHA (secretary) Ohio University B.S.,  Industrial Hygiene ,  Environmental Health 2006  – 2010 Activities and Societies:  ASSE (Treasurer) ,  AIHA ,  Residential Assistant (Winter and Spring 2008). University of Illinois at Chicago M.S.,  Occupational Safety 2010  – 2013 Activities and Societies:  ASSE ,  AIHA (secretary) University of Illinois at Chicago M.S.,  Occupational Safety 2010  – 2013 Activities and Societies:  ASSE ,  AIHA (secretary) University of Illinois at Chicago M.S.,  Occupational Safety 2010  – 2013 Activities and Societies:  ASSE ,  AIHA (secretary) Ohio University B.S.,  Industrial Hygiene ,  Environmental Health 2006  – 2010 Activities and Societies:  ASSE (Treasurer) ,  AIHA ,  Residential Assistant (Winter and Spring 2008). Ohio University B.S.,  Industrial Hygiene ,  Environmental Health 2006  – 2010 Activities and Societies:  ASSE (Treasurer) ,  AIHA ,  Residential Assistant (Winter and Spring 2008). Ohio University B.S.,  Industrial Hygiene ,  Environmental Health 2006  – 2010 Activities and Societies:  ASSE (Treasurer) ,  AIHA ,  Residential Assistant (Winter and Spring 2008). Honors & Awards NIOSH Occupational Safety Traineeship NIOSH August 2010 http://niosh-erc.org/  NIOSH Occupational Safety Traineeship NIOSH August 2010 http://niosh-erc.org/  NIOSH Occupational Safety Traineeship NIOSH August 2010 http://niosh-erc.org/  NIOSH Occupational Safety Traineeship NIOSH August 2010 http://niosh-erc.org/  ", "Experience Env Engineer Intel September 2000  – Present (15 years) Intel Ireland Current Role \nIntel Project Env Engineer \nEnv Engineer SPOC for Design \n \nPrevious roles in Intel include  \nResponsible for compliance with the IPPC Licence, (Air, Waste, Water, Noise) \nImplementation of an environmental managment system that was accrediated to ISO 14001. \nCompletion of IPPC applications \nCoMAH/Serveso experience \nManagement of compliance with the Dangerous Goods Safety Advisor (DGSA) requirements for the Campus. Environmental Consultant Indaver June 2000  –  September 2000  (4 months) Dun Laoighre EIS work Industrial Hygienist Intel Corporation February 1999  –  October 1999  (9 months) Leixlip Intern Env Engineer Intel September 2000  – Present (15 years) Intel Ireland Current Role \nIntel Project Env Engineer \nEnv Engineer SPOC for Design \n \nPrevious roles in Intel include  \nResponsible for compliance with the IPPC Licence, (Air, Waste, Water, Noise) \nImplementation of an environmental managment system that was accrediated to ISO 14001. \nCompletion of IPPC applications \nCoMAH/Serveso experience \nManagement of compliance with the Dangerous Goods Safety Advisor (DGSA) requirements for the Campus. Env Engineer Intel September 2000  – Present (15 years) Intel Ireland Current Role \nIntel Project Env Engineer \nEnv Engineer SPOC for Design \n \nPrevious roles in Intel include  \nResponsible for compliance with the IPPC Licence, (Air, Waste, Water, Noise) \nImplementation of an environmental managment system that was accrediated to ISO 14001. \nCompletion of IPPC applications \nCoMAH/Serveso experience \nManagement of compliance with the Dangerous Goods Safety Advisor (DGSA) requirements for the Campus. Environmental Consultant Indaver June 2000  –  September 2000  (4 months) Dun Laoighre EIS work Environmental Consultant Indaver June 2000  –  September 2000  (4 months) Dun Laoighre EIS work Industrial Hygienist Intel Corporation February 1999  –  October 1999  (9 months) Leixlip Intern Industrial Hygienist Intel Corporation February 1999  –  October 1999  (9 months) Leixlip Intern Skills EHS EHS Program Development EHS Management Systems EHS Audits Industrial Hygiene Environmental Noise Hazardous Waste... Hazardous Materials... Hazard Identification Indoor Air Quality Air Pollution Chemical Processing ISO 14001 Environmental Awareness Occupational Health Environmental... Ergonomics Water Environmental Compliance Safety Management... Environmental Auditing Waste Engineering Process Engineering Water Treatment Risk Assessment See 11+     See less Skills  EHS EHS Program Development EHS Management Systems EHS Audits Industrial Hygiene Environmental Noise Hazardous Waste... Hazardous Materials... Hazard Identification Indoor Air Quality Air Pollution Chemical Processing ISO 14001 Environmental Awareness Occupational Health Environmental... Ergonomics Water Environmental Compliance Safety Management... Environmental Auditing Waste Engineering Process Engineering Water Treatment Risk Assessment See 11+     See less EHS EHS Program Development EHS Management Systems EHS Audits Industrial Hygiene Environmental Noise Hazardous Waste... Hazardous Materials... Hazard Identification Indoor Air Quality Air Pollution Chemical Processing ISO 14001 Environmental Awareness Occupational Health Environmental... Ergonomics Water Environmental Compliance Safety Management... Environmental Auditing Waste Engineering Process Engineering Water Treatment Risk Assessment See 11+     See less EHS EHS Program Development EHS Management Systems EHS Audits Industrial Hygiene Environmental Noise Hazardous Waste... Hazardous Materials... Hazard Identification Indoor Air Quality Air Pollution Chemical Processing ISO 14001 Environmental Awareness Occupational Health Environmental... Ergonomics Water Environmental Compliance Safety Management... Environmental Auditing Waste Engineering Process Engineering Water Treatment Risk Assessment See 11+     See less Education University College Dublin Professional Cert in Radiation Safety 2013  – 2013 Trinity College, Dublin PG,  Environmental Engineering Technology/Environmental Technology 2004  – 2005 American Industrial Hygiene Association PG,  Elemental Industrial Hygiene 2002  – 2004 University College Dublin Certificate in Health and Safety,  Occupational Safety and Health Technology/Technician , Hons 2000  – 2001 University of Limerick BS,  Environmental Science 1996  – 2000 University College Dublin Professional Cert in Radiation Safety 2013  – 2013 University College Dublin Professional Cert in Radiation Safety 2013  – 2013 University College Dublin Professional Cert in Radiation Safety 2013  – 2013 Trinity College, Dublin PG,  Environmental Engineering Technology/Environmental Technology 2004  – 2005 Trinity College, Dublin PG,  Environmental Engineering Technology/Environmental Technology 2004  – 2005 Trinity College, Dublin PG,  Environmental Engineering Technology/Environmental Technology 2004  – 2005 American Industrial Hygiene Association PG,  Elemental Industrial Hygiene 2002  – 2004 American Industrial Hygiene Association PG,  Elemental Industrial Hygiene 2002  – 2004 American Industrial Hygiene Association PG,  Elemental Industrial Hygiene 2002  – 2004 University College Dublin Certificate in Health and Safety,  Occupational Safety and Health Technology/Technician , Hons 2000  – 2001 University College Dublin Certificate in Health and Safety,  Occupational Safety and Health Technology/Technician , Hons 2000  – 2001 University College Dublin Certificate in Health and Safety,  Occupational Safety and Health Technology/Technician , Hons 2000  – 2001 University of Limerick BS,  Environmental Science 1996  – 2000 University of Limerick BS,  Environmental Science 1996  – 2000 University of Limerick BS,  Environmental Science 1996  – 2000 ", "Summary •\tCIH/CSP/CHMM with extensive EHS experience in the manufacturing sector \n•\tExposure assessment expertise for a wide range of occupational, environmental, and indoor air quality stressors including chemicals, noise, and radiation Summary •\tCIH/CSP/CHMM with extensive EHS experience in the manufacturing sector \n•\tExposure assessment expertise for a wide range of occupational, environmental, and indoor air quality stressors including chemicals, noise, and radiation •\tCIH/CSP/CHMM with extensive EHS experience in the manufacturing sector \n•\tExposure assessment expertise for a wide range of occupational, environmental, and indoor air quality stressors including chemicals, noise, and radiation •\tCIH/CSP/CHMM with extensive EHS experience in the manufacturing sector \n•\tExposure assessment expertise for a wide range of occupational, environmental, and indoor air quality stressors including chemicals, noise, and radiation Experience EHS Manager - Corp Real Estate & Facilities Leidos 2013  – Present (2 years) San Diego, CA Western Region EHS Engineer SAIC 2009  –  2013  (4 years) Corporate Industrial Hygienist Intel Corporation 1995  –  2009  (14 years) Corporate EHS - Global IH program development & implementation, EHS auditing, Strategic planning & leadership activities \nRegional & site EHS program ownership at Fab manufacturing sites in CA, AZ, NM Industrial Hygienist Occidental Chemical 1992  –  1995  (3 years) Corporate & Site support in TX & WA EHS Manager - Corp Real Estate & Facilities Leidos 2013  – Present (2 years) San Diego, CA EHS Manager - Corp Real Estate & Facilities Leidos 2013  – Present (2 years) San Diego, CA Western Region EHS Engineer SAIC 2009  –  2013  (4 years) Western Region EHS Engineer SAIC 2009  –  2013  (4 years) Corporate Industrial Hygienist Intel Corporation 1995  –  2009  (14 years) Corporate EHS - Global IH program development & implementation, EHS auditing, Strategic planning & leadership activities \nRegional & site EHS program ownership at Fab manufacturing sites in CA, AZ, NM Corporate Industrial Hygienist Intel Corporation 1995  –  2009  (14 years) Corporate EHS - Global IH program development & implementation, EHS auditing, Strategic planning & leadership activities \nRegional & site EHS program ownership at Fab manufacturing sites in CA, AZ, NM Industrial Hygienist Occidental Chemical 1992  –  1995  (3 years) Corporate & Site support in TX & WA Industrial Hygienist Occidental Chemical 1992  –  1995  (3 years) Corporate & Site support in TX & WA Education University of North Carolina at Chapel Hill MSPH,  Industrial Hygiene University of Washington BS,  Environmental Health University of North Carolina at Chapel Hill MSPH,  Industrial Hygiene University of North Carolina at Chapel Hill MSPH,  Industrial Hygiene University of North Carolina at Chapel Hill MSPH,  Industrial Hygiene University of Washington BS,  Environmental Health University of Washington BS,  Environmental Health University of Washington BS,  Environmental Health ", "Experience Corporate Industrial Hygienist Intel Corporation August 2015  – Present (1 month) Sr. Industrial Hygienist Intel 1995  –  August 2015  (20 years) Providing Industrial Hygiene services to large semiconductor facility including three chip fabrication plants, facility operations and laboratories. Chair AIHA Non Ionizing Radiation Committee AIHA June 2012  –  June 2013  (1 year 1 month) Industrial Hygiene Intern BP Amoco May 1994  –  August 1994  (4 months) Conducted Industrial Hygiene noise and chemical exposure surveys in several refinery units. Performed chemical exposure assessment of water treatment plant employees, allowing reduction in respiratory protection requirements in several areas. Environmental Scientist Robert J. Meyers & Associates 1992  –  1993  (1 year) Conducted environmental reviews & mapping for plant and vessel oil spill control plans. Planned and participated in emergency response drills for major oil & gas clients. Program manager for several plant oil spill control plan updates. Corporate Industrial Hygienist Intel Corporation August 2015  – Present (1 month) Corporate Industrial Hygienist Intel Corporation August 2015  – Present (1 month) Sr. Industrial Hygienist Intel 1995  –  August 2015  (20 years) Providing Industrial Hygiene services to large semiconductor facility including three chip fabrication plants, facility operations and laboratories. Sr. Industrial Hygienist Intel 1995  –  August 2015  (20 years) Providing Industrial Hygiene services to large semiconductor facility including three chip fabrication plants, facility operations and laboratories. Chair AIHA Non Ionizing Radiation Committee AIHA June 2012  –  June 2013  (1 year 1 month) Chair AIHA Non Ionizing Radiation Committee AIHA June 2012  –  June 2013  (1 year 1 month) Industrial Hygiene Intern BP Amoco May 1994  –  August 1994  (4 months) Conducted Industrial Hygiene noise and chemical exposure surveys in several refinery units. Performed chemical exposure assessment of water treatment plant employees, allowing reduction in respiratory protection requirements in several areas. Industrial Hygiene Intern BP Amoco May 1994  –  August 1994  (4 months) Conducted Industrial Hygiene noise and chemical exposure surveys in several refinery units. Performed chemical exposure assessment of water treatment plant employees, allowing reduction in respiratory protection requirements in several areas. Environmental Scientist Robert J. Meyers & Associates 1992  –  1993  (1 year) Conducted environmental reviews & mapping for plant and vessel oil spill control plans. Planned and participated in emergency response drills for major oil & gas clients. Program manager for several plant oil spill control plan updates. Environmental Scientist Robert J. Meyers & Associates 1992  –  1993  (1 year) Conducted environmental reviews & mapping for plant and vessel oil spill control plans. Planned and participated in emergency response drills for major oil & gas clients. Program manager for several plant oil spill control plan updates. Languages English Native or bilingual proficiency Hebrew Native or bilingual proficiency English Native or bilingual proficiency Hebrew Native or bilingual proficiency English Native or bilingual proficiency Hebrew Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Industrial Hygiene Exposure Assessment Non Ionizing Radiation EHS Asbestos Environmental Health CIH MSDS Hazard Recognition Mold Respiratory Protection Respiratory Products Risk Assessment Radiation Air Sampling Process Safety Intel Occupational Health Environmental Awareness Program Management See 5+     See less Skills  Industrial Hygiene Exposure Assessment Non Ionizing Radiation EHS Asbestos Environmental Health CIH MSDS Hazard Recognition Mold Respiratory Protection Respiratory Products Risk Assessment Radiation Air Sampling Process Safety Intel Occupational Health Environmental Awareness Program Management See 5+     See less Industrial Hygiene Exposure Assessment Non Ionizing Radiation EHS Asbestos Environmental Health CIH MSDS Hazard Recognition Mold Respiratory Protection Respiratory Products Risk Assessment Radiation Air Sampling Process Safety Intel Occupational Health Environmental Awareness Program Management See 5+     See less Industrial Hygiene Exposure Assessment Non Ionizing Radiation EHS Asbestos Environmental Health CIH MSDS Hazard Recognition Mold Respiratory Protection Respiratory Products Risk Assessment Radiation Air Sampling Process Safety Intel Occupational Health Environmental Awareness Program Management See 5+     See less Education The University of Texas Health Science Center at Houston M.S.,  Industrial Hygiene 1993  – 1995 NIOSH fellowship recipient \nRAC/ABET accredited program University of Houston BS,  Biology 1988  – 1992 Haim Greenburg High School 1981  – 1985 The University of Texas Health Science Center at Houston M.S.,  Industrial Hygiene 1993  – 1995 NIOSH fellowship recipient \nRAC/ABET accredited program The University of Texas Health Science Center at Houston M.S.,  Industrial Hygiene 1993  – 1995 NIOSH fellowship recipient \nRAC/ABET accredited program The University of Texas Health Science Center at Houston M.S.,  Industrial Hygiene 1993  – 1995 NIOSH fellowship recipient \nRAC/ABET accredited program University of Houston BS,  Biology 1988  – 1992 University of Houston BS,  Biology 1988  – 1992 University of Houston BS,  Biology 1988  – 1992 Haim Greenburg High School 1981  – 1985 Haim Greenburg High School 1981  – 1985 Haim Greenburg High School 1981  – 1985 Honors & Awards Additional Honors & Awards Attended AIHA Future Leaders Institute http://www.aiha.org/Content/AboutAIHA/FLI.htm Additional Honors & Awards Attended AIHA Future Leaders Institute http://www.aiha.org/Content/AboutAIHA/FLI.htm Additional Honors & Awards Attended AIHA Future Leaders Institute http://www.aiha.org/Content/AboutAIHA/FLI.htm Additional Honors & Awards Attended AIHA Future Leaders Institute http://www.aiha.org/Content/AboutAIHA/FLI.htm ", "Summary Expert in global EHS training operations, broad global, regional and site experience in leading programs/projects and driving changes through cultural and infrastructure differences. Vast experience in assimilation of safety culture based programs including the driver for continuous improvement of EHS communication methodologies. Sr. Industrial Hygienist. MSc in Environmental Sciences.  Summary Expert in global EHS training operations, broad global, regional and site experience in leading programs/projects and driving changes through cultural and infrastructure differences. Vast experience in assimilation of safety culture based programs including the driver for continuous improvement of EHS communication methodologies. Sr. Industrial Hygienist. MSc in Environmental Sciences.  Expert in global EHS training operations, broad global, regional and site experience in leading programs/projects and driving changes through cultural and infrastructure differences. Vast experience in assimilation of safety culture based programs including the driver for continuous improvement of EHS communication methodologies. Sr. Industrial Hygienist. MSc in Environmental Sciences.  Expert in global EHS training operations, broad global, regional and site experience in leading programs/projects and driving changes through cultural and infrastructure differences. Vast experience in assimilation of safety culture based programs including the driver for continuous improvement of EHS communication methodologies. Sr. Industrial Hygienist. MSc in Environmental Sciences.  Experience Global EHS Learning & Development Program Manager Intel February 2008  – Present (7 years 7 months) Intel Corporation Leading the Global EHS Learning & Development Training program throughout multiple business units (Technical & Non Technical), major sites (5 US, 5 European & 3 Asian), 3 regions, multiple languages and cultures impacting over 200,000 students per year, managing over 150 global courses some in 11 languages.  \nKey focuses include but are not limited to: \n* Ensuring Global training needs remain current and in compliance with regulatory and Intel business needs – ensuring global regulations meet site local regulations – no risk to Intel \n* Driving for a constant improved learning experience and customer feedback by researching and introducing new training directions such as blended learning, improved interactive WBTs, job aids, videos etc.. \n* Leading Global processes & changes - example: reducing 30% EHS training hours to increase efficiency, save costs, while maintaining quality (96,000 hours ; $6.27M saved), creation of a new EHS development portal for raising proficiency and basic global requirements from the EHS professionals. \n Risk Communication & EHS training Intel September 2006  –  February 2008  (1 year 6 months) Drove a change in the communication strategy of EHS concerns by the implementation of risk communication principles which resulted in the reduction of fear and an increase engagement of concerned employees in risk assessments. Change allowed managers to understand details of employee concerns, raised trust and reduced the outrage. Industrial Hygienist Intel Corporation January 1996  –  September 2006  (10 years 9 months) Israel Sr. Industrial Hygienist at Intel Green Field in Israel (1996) supporting other Israeli & European sites, mentoring new Industrial Hygienists and a key member of Corporate EHS activities and projects. Established the Industrial Hygiene Discipline at Intel Kiryat Gat (F18-Green Field at the time) through the implementation of new standards to ensure alignment with local regulations and Intel Corporate EHS policies. Supported the ramp up and sustaining stages of a developing Fab including resolving Engineering challenges, participation in site wide projects, leading teams, and dealing with communication challenges \n\t Global EHS Learning & Development Program Manager Intel February 2008  – Present (7 years 7 months) Intel Corporation Leading the Global EHS Learning & Development Training program throughout multiple business units (Technical & Non Technical), major sites (5 US, 5 European & 3 Asian), 3 regions, multiple languages and cultures impacting over 200,000 students per year, managing over 150 global courses some in 11 languages.  \nKey focuses include but are not limited to: \n* Ensuring Global training needs remain current and in compliance with regulatory and Intel business needs – ensuring global regulations meet site local regulations – no risk to Intel \n* Driving for a constant improved learning experience and customer feedback by researching and introducing new training directions such as blended learning, improved interactive WBTs, job aids, videos etc.. \n* Leading Global processes & changes - example: reducing 30% EHS training hours to increase efficiency, save costs, while maintaining quality (96,000 hours ; $6.27M saved), creation of a new EHS development portal for raising proficiency and basic global requirements from the EHS professionals. \n Global EHS Learning & Development Program Manager Intel February 2008  – Present (7 years 7 months) Intel Corporation Leading the Global EHS Learning & Development Training program throughout multiple business units (Technical & Non Technical), major sites (5 US, 5 European & 3 Asian), 3 regions, multiple languages and cultures impacting over 200,000 students per year, managing over 150 global courses some in 11 languages.  \nKey focuses include but are not limited to: \n* Ensuring Global training needs remain current and in compliance with regulatory and Intel business needs – ensuring global regulations meet site local regulations – no risk to Intel \n* Driving for a constant improved learning experience and customer feedback by researching and introducing new training directions such as blended learning, improved interactive WBTs, job aids, videos etc.. \n* Leading Global processes & changes - example: reducing 30% EHS training hours to increase efficiency, save costs, while maintaining quality (96,000 hours ; $6.27M saved), creation of a new EHS development portal for raising proficiency and basic global requirements from the EHS professionals. \n Risk Communication & EHS training Intel September 2006  –  February 2008  (1 year 6 months) Drove a change in the communication strategy of EHS concerns by the implementation of risk communication principles which resulted in the reduction of fear and an increase engagement of concerned employees in risk assessments. Change allowed managers to understand details of employee concerns, raised trust and reduced the outrage. Risk Communication & EHS training Intel September 2006  –  February 2008  (1 year 6 months) Drove a change in the communication strategy of EHS concerns by the implementation of risk communication principles which resulted in the reduction of fear and an increase engagement of concerned employees in risk assessments. Change allowed managers to understand details of employee concerns, raised trust and reduced the outrage. Industrial Hygienist Intel Corporation January 1996  –  September 2006  (10 years 9 months) Israel Sr. Industrial Hygienist at Intel Green Field in Israel (1996) supporting other Israeli & European sites, mentoring new Industrial Hygienists and a key member of Corporate EHS activities and projects. Established the Industrial Hygiene Discipline at Intel Kiryat Gat (F18-Green Field at the time) through the implementation of new standards to ensure alignment with local regulations and Intel Corporate EHS policies. Supported the ramp up and sustaining stages of a developing Fab including resolving Engineering challenges, participation in site wide projects, leading teams, and dealing with communication challenges \n\t Industrial Hygienist Intel Corporation January 1996  –  September 2006  (10 years 9 months) Israel Sr. Industrial Hygienist at Intel Green Field in Israel (1996) supporting other Israeli & European sites, mentoring new Industrial Hygienists and a key member of Corporate EHS activities and projects. Established the Industrial Hygiene Discipline at Intel Kiryat Gat (F18-Green Field at the time) through the implementation of new standards to ensure alignment with local regulations and Intel Corporate EHS policies. Supported the ramp up and sustaining stages of a developing Fab including resolving Engineering challenges, participation in site wide projects, leading teams, and dealing with communication challenges \n\t Languages English Native or bilingual proficiency Hebrew Native or bilingual proficiency English Native or bilingual proficiency Hebrew Native or bilingual proficiency English Native or bilingual proficiency Hebrew Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Safety Management... Industrial Hygiene EHS Program Management Occupational Health Instructional Design Risk Assessment Training Delivery Learning Management Training Ergonomics Risk Management Instructor-led Training Process Improvement Cross-functional Team... Skills  Safety Management... Industrial Hygiene EHS Program Management Occupational Health Instructional Design Risk Assessment Training Delivery Learning Management Training Ergonomics Risk Management Instructor-led Training Process Improvement Cross-functional Team... Safety Management... Industrial Hygiene EHS Program Management Occupational Health Instructional Design Risk Assessment Training Delivery Learning Management Training Ergonomics Risk Management Instructor-led Training Process Improvement Cross-functional Team... Safety Management... Industrial Hygiene EHS Program Management Occupational Health Instructional Design Risk Assessment Training Delivery Learning Management Training Ergonomics Risk Management Instructor-led Training Process Improvement Cross-functional Team... Education The Hebrew University MSc,  Environmental Sciences 1992  – 1994 The Hebrew University Bachelor's Degree,  Faculty of Agriculture , Food & Environment 1988  – 1991 University of Haifa Diploma,  Tourism and Travel Services Management The Hebrew University MSc,  Environmental Sciences 1992  – 1994 The Hebrew University MSc,  Environmental Sciences 1992  – 1994 The Hebrew University MSc,  Environmental Sciences 1992  – 1994 The Hebrew University Bachelor's Degree,  Faculty of Agriculture , Food & Environment 1988  – 1991 The Hebrew University Bachelor's Degree,  Faculty of Agriculture , Food & Environment 1988  – 1991 The Hebrew University Bachelor's Degree,  Faculty of Agriculture , Food & Environment 1988  – 1991 University of Haifa Diploma,  Tourism and Travel Services Management University of Haifa Diploma,  Tourism and Travel Services Management University of Haifa Diploma,  Tourism and Travel Services Management ", "Experience Industrial Hygiene Officer US Navy Industrial Hygienist Intel Corporation June 1997  –  September 2001  (4 years 4 months) Industrial Hygiene Officer US Navy Industrial Hygiene Officer US Navy Industrial Hygienist Intel Corporation June 1997  –  September 2001  (4 years 4 months) Industrial Hygienist Intel Corporation June 1997  –  September 2001  (4 years 4 months) Education University of California, Los Angeles 1997  – 1999 University of Arizona BS,  Environmental Science 1993  – 1997 University of California, Los Angeles 1997  – 1999 University of California, Los Angeles 1997  – 1999 University of California, Los Angeles 1997  – 1999 University of Arizona BS,  Environmental Science 1993  – 1997 University of Arizona BS,  Environmental Science 1993  – 1997 University of Arizona BS,  Environmental Science 1993  – 1997 ", "Experience Global Account Manager Intel Corporation 2015  – Present (less than a year) Hillsboro, OR Project Manager, Human Resources Enterprise Services Intel Corporation 2013  –  2015  (2 years) Hillsboro, OR Engineering Manager, D1X Mechanical Operations Intel Corporation 2012  –  2013  (1 year) Hillsboro, OR Fab Sort Mfg & Tech Dev (FSMTD) Services Manager Intel Corporation 2011  –  2012  (1 year) Portland, Oregon Area Environmental, Health and Safety Manager Intel Corporation 2006  –  2011  (5 years) Technology Transfer Program Manager Intel Corporation 2005  –  2006  (1 year) Safety Engineer & Industrial Hygienist Intel Corporation 1996  –  2005  (9 years) National Industrial Hygiene Fellow United States Department of Energy 1994  –  1996  (2 years) Global Account Manager Intel Corporation 2015  – Present (less than a year) Hillsboro, OR Global Account Manager Intel Corporation 2015  – Present (less than a year) Hillsboro, OR Project Manager, Human Resources Enterprise Services Intel Corporation 2013  –  2015  (2 years) Hillsboro, OR Project Manager, Human Resources Enterprise Services Intel Corporation 2013  –  2015  (2 years) Hillsboro, OR Engineering Manager, D1X Mechanical Operations Intel Corporation 2012  –  2013  (1 year) Hillsboro, OR Engineering Manager, D1X Mechanical Operations Intel Corporation 2012  –  2013  (1 year) Hillsboro, OR Fab Sort Mfg & Tech Dev (FSMTD) Services Manager Intel Corporation 2011  –  2012  (1 year) Portland, Oregon Area Fab Sort Mfg & Tech Dev (FSMTD) Services Manager Intel Corporation 2011  –  2012  (1 year) Portland, Oregon Area Environmental, Health and Safety Manager Intel Corporation 2006  –  2011  (5 years) Environmental, Health and Safety Manager Intel Corporation 2006  –  2011  (5 years) Technology Transfer Program Manager Intel Corporation 2005  –  2006  (1 year) Technology Transfer Program Manager Intel Corporation 2005  –  2006  (1 year) Safety Engineer & Industrial Hygienist Intel Corporation 1996  –  2005  (9 years) Safety Engineer & Industrial Hygienist Intel Corporation 1996  –  2005  (9 years) National Industrial Hygiene Fellow United States Department of Energy 1994  –  1996  (2 years) National Industrial Hygiene Fellow United States Department of Energy 1994  –  1996  (2 years) Languages   Skills EHS Industrial Hygiene Program Management Environmental Risk Assessment Safety Management Engineering Management Project Management Customer Service Mechanical Engineering Facilities Engineering Facilities Management Facilities Operations Semiconductors Cross-functional Team... Safety Management... ISO 14001 Environmental Awareness Ergonomics Hazardous Waste... Contract Management Manufacturing Emergency Management Sustainability Continuous Improvement Environmental Compliance SPC Root Cause Analysis Engineering Project Planning Industrial Safety Process Engineering Six Sigma Intel Occupational Health Lean Manufacturing Semiconductor Industry Training Inspection Process Simulation Testing Design of Experiments Strategy Management Industrial Engineering Start-ups Leadership Quality Management Failure Analysis Team Leadership See 35+     See less Skills  EHS Industrial Hygiene Program Management Environmental Risk Assessment Safety Management Engineering Management Project Management Customer Service Mechanical Engineering Facilities Engineering Facilities Management Facilities Operations Semiconductors Cross-functional Team... Safety Management... ISO 14001 Environmental Awareness Ergonomics Hazardous Waste... Contract Management Manufacturing Emergency Management Sustainability Continuous Improvement Environmental Compliance SPC Root Cause Analysis Engineering Project Planning Industrial Safety Process Engineering Six Sigma Intel Occupational Health Lean Manufacturing Semiconductor Industry Training Inspection Process Simulation Testing Design of Experiments Strategy Management Industrial Engineering Start-ups Leadership Quality Management Failure Analysis Team Leadership See 35+     See less EHS Industrial Hygiene Program Management Environmental Risk Assessment Safety Management Engineering Management Project Management Customer Service Mechanical Engineering Facilities Engineering Facilities Management Facilities Operations Semiconductors Cross-functional Team... Safety Management... ISO 14001 Environmental Awareness Ergonomics Hazardous Waste... Contract Management Manufacturing Emergency Management Sustainability Continuous Improvement Environmental Compliance SPC Root Cause Analysis Engineering Project Planning Industrial Safety Process Engineering Six Sigma Intel Occupational Health Lean Manufacturing Semiconductor Industry Training Inspection Process Simulation Testing Design of Experiments Strategy Management Industrial Engineering Start-ups Leadership Quality Management Failure Analysis Team Leadership See 35+     See less EHS Industrial Hygiene Program Management Environmental Risk Assessment Safety Management Engineering Management Project Management Customer Service Mechanical Engineering Facilities Engineering Facilities Management Facilities Operations Semiconductors Cross-functional Team... Safety Management... ISO 14001 Environmental Awareness Ergonomics Hazardous Waste... Contract Management Manufacturing Emergency Management Sustainability Continuous Improvement Environmental Compliance SPC Root Cause Analysis Engineering Project Planning Industrial Safety Process Engineering Six Sigma Intel Occupational Health Lean Manufacturing Semiconductor Industry Training Inspection Process Simulation Testing Design of Experiments Strategy Management Industrial Engineering Start-ups Leadership Quality Management Failure Analysis Team Leadership See 35+     See less Education The University of Texas at Austin MSE University of California, Berkeley MPH University of Southern California BS Harvard School of Public Health The University of Texas at Austin MSE The University of Texas at Austin MSE The University of Texas at Austin MSE University of California, Berkeley MPH University of California, Berkeley MPH University of California, Berkeley MPH University of Southern California BS University of Southern California BS University of Southern California BS Harvard School of Public Health Harvard School of Public Health Harvard School of Public Health Honors & Awards ", "Summary Provide continuous improvement to an organization's Environmental, Health, & Safety performance to decrease injury & property loss, increase morale, increase productivity, and decrease costs. Specialties:Industrial Hygiene, Safety, Ergonomics, Environmental, DOT, ISO Summary Provide continuous improvement to an organization's Environmental, Health, & Safety performance to decrease injury & property loss, increase morale, increase productivity, and decrease costs. Specialties:Industrial Hygiene, Safety, Ergonomics, Environmental, DOT, ISO Provide continuous improvement to an organization's Environmental, Health, & Safety performance to decrease injury & property loss, increase morale, increase productivity, and decrease costs. Specialties:Industrial Hygiene, Safety, Ergonomics, Environmental, DOT, ISO Provide continuous improvement to an organization's Environmental, Health, & Safety performance to decrease injury & property loss, increase morale, increase productivity, and decrease costs. Specialties:Industrial Hygiene, Safety, Ergonomics, Environmental, DOT, ISO Experience Managing Principal GreenLeaf Americas,llc January 2009  – Present (6 years 8 months) Greenleaf Americas provides comprehensive services in industrial hygiene, safety, and environmental related areas to clients in the western US. (Offices in Utah, Colorado, New Mexico, Texas, California, and Washington) Professor of Industrial Hygiene & Public Health Utah State University September 2013  – Present (2 years) Logan, UT Instruct, advise, & mentor students of Utah State University's three Public Health bachelor's degrees: \n-Industrial Hygiene  \n-Environmental Health \n-Public Health Education Safety, Health, & Security Manager Fairchild Semiconductor December 2011  –  September 2013  (1 year 10 months) Greater Salt Lake City Area Manage team of professionals with oversight of company Safety/Industrial Hygiene, Emergency Response, Workers' Compensation, and Security programs. Environmental Engineer, Industrial Hygienist, Ergonomist IM Flash Technologies October 2006  –  December 2011  (5 years 3 months) Lehi, UT IM Flash Technologies is a joint venture between Intel & Micron for the purposes of manufacturing flash memory semiconductors. Environmental Manager Intel Corporation 2004  –  2006  (2 years) Colorado Springs, Colorado Area Environmental Manager for Intel Colorado Springs facility, including managing the successful application for EPA Performance Track & ISO 14001 Industrial Hygienist Intel Corporation 2000  –  2004  (4 years) Industrial Hygienist and Safety Engineer for Intel's Rio Rancho, New Mexico facility of over 3,000 employees. Including managing sucessful OSHA VPP application process Risk Manager Utah Local Governments Trust July 1998  –  July 2000  (2 years 1 month) North Salt Lake Risk Manager / Loss Control for insurance carrier providing property, liability, workers' comp, auto, errors and omissions Managing Principal GreenLeaf Americas,llc January 2009  – Present (6 years 8 months) Greenleaf Americas provides comprehensive services in industrial hygiene, safety, and environmental related areas to clients in the western US. (Offices in Utah, Colorado, New Mexico, Texas, California, and Washington) Managing Principal GreenLeaf Americas,llc January 2009  – Present (6 years 8 months) Greenleaf Americas provides comprehensive services in industrial hygiene, safety, and environmental related areas to clients in the western US. (Offices in Utah, Colorado, New Mexico, Texas, California, and Washington) Professor of Industrial Hygiene & Public Health Utah State University September 2013  – Present (2 years) Logan, UT Instruct, advise, & mentor students of Utah State University's three Public Health bachelor's degrees: \n-Industrial Hygiene  \n-Environmental Health \n-Public Health Education Professor of Industrial Hygiene & Public Health Utah State University September 2013  – Present (2 years) Logan, UT Instruct, advise, & mentor students of Utah State University's three Public Health bachelor's degrees: \n-Industrial Hygiene  \n-Environmental Health \n-Public Health Education Safety, Health, & Security Manager Fairchild Semiconductor December 2011  –  September 2013  (1 year 10 months) Greater Salt Lake City Area Manage team of professionals with oversight of company Safety/Industrial Hygiene, Emergency Response, Workers' Compensation, and Security programs. Safety, Health, & Security Manager Fairchild Semiconductor December 2011  –  September 2013  (1 year 10 months) Greater Salt Lake City Area Manage team of professionals with oversight of company Safety/Industrial Hygiene, Emergency Response, Workers' Compensation, and Security programs. Environmental Engineer, Industrial Hygienist, Ergonomist IM Flash Technologies October 2006  –  December 2011  (5 years 3 months) Lehi, UT IM Flash Technologies is a joint venture between Intel & Micron for the purposes of manufacturing flash memory semiconductors. Environmental Engineer, Industrial Hygienist, Ergonomist IM Flash Technologies October 2006  –  December 2011  (5 years 3 months) Lehi, UT IM Flash Technologies is a joint venture between Intel & Micron for the purposes of manufacturing flash memory semiconductors. Environmental Manager Intel Corporation 2004  –  2006  (2 years) Colorado Springs, Colorado Area Environmental Manager for Intel Colorado Springs facility, including managing the successful application for EPA Performance Track & ISO 14001 Environmental Manager Intel Corporation 2004  –  2006  (2 years) Colorado Springs, Colorado Area Environmental Manager for Intel Colorado Springs facility, including managing the successful application for EPA Performance Track & ISO 14001 Industrial Hygienist Intel Corporation 2000  –  2004  (4 years) Industrial Hygienist and Safety Engineer for Intel's Rio Rancho, New Mexico facility of over 3,000 employees. Including managing sucessful OSHA VPP application process Industrial Hygienist Intel Corporation 2000  –  2004  (4 years) Industrial Hygienist and Safety Engineer for Intel's Rio Rancho, New Mexico facility of over 3,000 employees. Including managing sucessful OSHA VPP application process Risk Manager Utah Local Governments Trust July 1998  –  July 2000  (2 years 1 month) North Salt Lake Risk Manager / Loss Control for insurance carrier providing property, liability, workers' comp, auto, errors and omissions Risk Manager Utah Local Governments Trust July 1998  –  July 2000  (2 years 1 month) North Salt Lake Risk Manager / Loss Control for insurance carrier providing property, liability, workers' comp, auto, errors and omissions Languages Trukese Trukese Trukese Skills Industrial Hygiene EHS Ergonomics Environmental Awareness ISO 14001 Hazardous Waste... Industrial Safety Hazardous Materials ISO Continuous Improvement Safety Management... EPA Environmental Compliance HAZWOPER Semiconductors Process Safety Risk Assessment Root Cause Analysis Environmental... Occupational Health Homeland Security Radiation Safety DOT regulations DOT Compliance Air Permitting Industrial Wastewater See 11+     See less Skills  Industrial Hygiene EHS Ergonomics Environmental Awareness ISO 14001 Hazardous Waste... Industrial Safety Hazardous Materials ISO Continuous Improvement Safety Management... EPA Environmental Compliance HAZWOPER Semiconductors Process Safety Risk Assessment Root Cause Analysis Environmental... Occupational Health Homeland Security Radiation Safety DOT regulations DOT Compliance Air Permitting Industrial Wastewater See 11+     See less Industrial Hygiene EHS Ergonomics Environmental Awareness ISO 14001 Hazardous Waste... Industrial Safety Hazardous Materials ISO Continuous Improvement Safety Management... EPA Environmental Compliance HAZWOPER Semiconductors Process Safety Risk Assessment Root Cause Analysis Environmental... Occupational Health Homeland Security Radiation Safety DOT regulations DOT Compliance Air Permitting Industrial Wastewater See 11+     See less Industrial Hygiene EHS Ergonomics Environmental Awareness ISO 14001 Hazardous Waste... Industrial Safety Hazardous Materials ISO Continuous Improvement Safety Management... EPA Environmental Compliance HAZWOPER Semiconductors Process Safety Risk Assessment Root Cause Analysis Environmental... Occupational Health Homeland Security Radiation Safety DOT regulations DOT Compliance Air Permitting Industrial Wastewater See 11+     See less Education University of Utah MSPH,  Public Health ,  Industrial Hygiene/Ergonomics 1998  – 2000 Utah State University BS,  Public Health ,  Industrial Hygiene 1994  – 1998 University of Utah MSPH,  Public Health ,  Industrial Hygiene/Ergonomics 1998  – 2000 University of Utah MSPH,  Public Health ,  Industrial Hygiene/Ergonomics 1998  – 2000 University of Utah MSPH,  Public Health ,  Industrial Hygiene/Ergonomics 1998  – 2000 Utah State University BS,  Public Health ,  Industrial Hygiene 1994  – 1998 Utah State University BS,  Public Health ,  Industrial Hygiene 1994  – 1998 Utah State University BS,  Public Health ,  Industrial Hygiene 1994  – 1998 ", "Summary Over ten years of experience in environmental management. safety and industrial hygiene with proven abilities in compliance and performance improvements. Since earning my CIH, I have spent the last several years improving my skills with continuing education and work experiences. Specialties:industrial hygiene, ISO14001, environmental compliance, risk management, health and safety compliance Summary Over ten years of experience in environmental management. safety and industrial hygiene with proven abilities in compliance and performance improvements. Since earning my CIH, I have spent the last several years improving my skills with continuing education and work experiences. Specialties:industrial hygiene, ISO14001, environmental compliance, risk management, health and safety compliance Over ten years of experience in environmental management. safety and industrial hygiene with proven abilities in compliance and performance improvements. Since earning my CIH, I have spent the last several years improving my skills with continuing education and work experiences. Specialties:industrial hygiene, ISO14001, environmental compliance, risk management, health and safety compliance Over ten years of experience in environmental management. safety and industrial hygiene with proven abilities in compliance and performance improvements. Since earning my CIH, I have spent the last several years improving my skills with continuing education and work experiences. Specialties:industrial hygiene, ISO14001, environmental compliance, risk management, health and safety compliance Experience Sr. Regional Industrial Hygienist Intel Corporation October 2014  – Present (11 months) Hillsboro Industrial Hygienist G2 Consultants, Inc. November 2012  –  September 2014  (1 year 11 months) Environmental, Health and Safety Coordinator Sapa Profiles, Inc. January 2012  –  November 2012  (11 months) Portland, Oregon Area Industrial Hygienist Independant Consultant January 2006  –  January 2012  (6 years 1 month) •\tConducted Indoor Air Quality sampling and wrote reports for numerous sites for large organization. This contract has been ongoing and been well received by client. First sampling at Ohio location went so well it was expanded to include 5 other facilities across the country. Consultant Crown Solutions, Inc. 2002  –  2004  (2 years) Environmental Consultant for Tier 1 Automotive parts manufacturers \n•\tConducted several industrial hygiene sampling strategies in large manufacturing plants including Chrome, Oil Mist and Particulate. Quality of work led to three other sampling projects. \n•\tCollaborated with engineers on program development for global facilities. Helped identify potential liabilities and hurdles including permit applications, regulations, abatement requirements and potential health and safety concerns. Ensured the company did not miss critical production deadlines or need to implement expensive abatement technology. \n•\tAssisted in obtaining two new contracts and $50,000 in new business. \n•\tResponsible or maintaining ISO 14001 Environmental Management System and environmental compliance in large manufacturing facility. No major non-conformances were found in three separate internal and third party audits. Environmental Analyst Western Star Trucks - a division of Freightliner 1997  –  2001  (4 years) Environmental Management and Occupational Health Advisor \n•\tManaged issues surrounding industrial hygiene including sampling and reporting, MSDS maintenance, facility chemical approvals and personal protective equipment program. Conducted over 30 industrial hygiene studies and introduced respiratory protection program to protect employees. Resulted in improved compliance and excellent relationship with local authorities. \n•\tSupervised facility environmental issues including hazardous waste disposal, environmental permits, on-going site remediation, $400,000 budget and all environmental reporting. Reduced waste disposal cost by 1/3. Introduced several recycling partnerships with local groups to reuse waste products and assist local companies. \n•\tInitiated environmental management systems in facility and introduced environmental reports for management. Participated in corporate environmental compliance audits. Effectively communicated environmental impact on production to the management team. \n•\tDesigned Emergency Preparedness plan for entire facility. Organized full facility practice evacuation with management and local authority participation. \n•\tInitiated Business continuity plan development. Chaired steering committee with management to assess risk and prescribe preventative measures, minimizing or avoiding risk. \n•\tAdvised Legal council on all company environmental issues including new land purchase, merger due diligence documentation and two remediation projects. Sr. Regional Industrial Hygienist Intel Corporation October 2014  – Present (11 months) Hillsboro Sr. Regional Industrial Hygienist Intel Corporation October 2014  – Present (11 months) Hillsboro Industrial Hygienist G2 Consultants, Inc. November 2012  –  September 2014  (1 year 11 months) Industrial Hygienist G2 Consultants, Inc. November 2012  –  September 2014  (1 year 11 months) Environmental, Health and Safety Coordinator Sapa Profiles, Inc. January 2012  –  November 2012  (11 months) Portland, Oregon Area Environmental, Health and Safety Coordinator Sapa Profiles, Inc. January 2012  –  November 2012  (11 months) Portland, Oregon Area Industrial Hygienist Independant Consultant January 2006  –  January 2012  (6 years 1 month) •\tConducted Indoor Air Quality sampling and wrote reports for numerous sites for large organization. This contract has been ongoing and been well received by client. First sampling at Ohio location went so well it was expanded to include 5 other facilities across the country. Industrial Hygienist Independant Consultant January 2006  –  January 2012  (6 years 1 month) •\tConducted Indoor Air Quality sampling and wrote reports for numerous sites for large organization. This contract has been ongoing and been well received by client. First sampling at Ohio location went so well it was expanded to include 5 other facilities across the country. Consultant Crown Solutions, Inc. 2002  –  2004  (2 years) Environmental Consultant for Tier 1 Automotive parts manufacturers \n•\tConducted several industrial hygiene sampling strategies in large manufacturing plants including Chrome, Oil Mist and Particulate. Quality of work led to three other sampling projects. \n•\tCollaborated with engineers on program development for global facilities. Helped identify potential liabilities and hurdles including permit applications, regulations, abatement requirements and potential health and safety concerns. Ensured the company did not miss critical production deadlines or need to implement expensive abatement technology. \n•\tAssisted in obtaining two new contracts and $50,000 in new business. \n•\tResponsible or maintaining ISO 14001 Environmental Management System and environmental compliance in large manufacturing facility. No major non-conformances were found in three separate internal and third party audits. Consultant Crown Solutions, Inc. 2002  –  2004  (2 years) Environmental Consultant for Tier 1 Automotive parts manufacturers \n•\tConducted several industrial hygiene sampling strategies in large manufacturing plants including Chrome, Oil Mist and Particulate. Quality of work led to three other sampling projects. \n•\tCollaborated with engineers on program development for global facilities. Helped identify potential liabilities and hurdles including permit applications, regulations, abatement requirements and potential health and safety concerns. Ensured the company did not miss critical production deadlines or need to implement expensive abatement technology. \n•\tAssisted in obtaining two new contracts and $50,000 in new business. \n•\tResponsible or maintaining ISO 14001 Environmental Management System and environmental compliance in large manufacturing facility. No major non-conformances were found in three separate internal and third party audits. Environmental Analyst Western Star Trucks - a division of Freightliner 1997  –  2001  (4 years) Environmental Management and Occupational Health Advisor \n•\tManaged issues surrounding industrial hygiene including sampling and reporting, MSDS maintenance, facility chemical approvals and personal protective equipment program. Conducted over 30 industrial hygiene studies and introduced respiratory protection program to protect employees. Resulted in improved compliance and excellent relationship with local authorities. \n•\tSupervised facility environmental issues including hazardous waste disposal, environmental permits, on-going site remediation, $400,000 budget and all environmental reporting. Reduced waste disposal cost by 1/3. Introduced several recycling partnerships with local groups to reuse waste products and assist local companies. \n•\tInitiated environmental management systems in facility and introduced environmental reports for management. Participated in corporate environmental compliance audits. Effectively communicated environmental impact on production to the management team. \n•\tDesigned Emergency Preparedness plan for entire facility. Organized full facility practice evacuation with management and local authority participation. \n•\tInitiated Business continuity plan development. Chaired steering committee with management to assess risk and prescribe preventative measures, minimizing or avoiding risk. \n•\tAdvised Legal council on all company environmental issues including new land purchase, merger due diligence documentation and two remediation projects. Environmental Analyst Western Star Trucks - a division of Freightliner 1997  –  2001  (4 years) Environmental Management and Occupational Health Advisor \n•\tManaged issues surrounding industrial hygiene including sampling and reporting, MSDS maintenance, facility chemical approvals and personal protective equipment program. Conducted over 30 industrial hygiene studies and introduced respiratory protection program to protect employees. Resulted in improved compliance and excellent relationship with local authorities. \n•\tSupervised facility environmental issues including hazardous waste disposal, environmental permits, on-going site remediation, $400,000 budget and all environmental reporting. Reduced waste disposal cost by 1/3. Introduced several recycling partnerships with local groups to reuse waste products and assist local companies. \n•\tInitiated environmental management systems in facility and introduced environmental reports for management. Participated in corporate environmental compliance audits. Effectively communicated environmental impact on production to the management team. \n•\tDesigned Emergency Preparedness plan for entire facility. Organized full facility practice evacuation with management and local authority participation. \n•\tInitiated Business continuity plan development. Chaired steering committee with management to assess risk and prescribe preventative measures, minimizing or avoiding risk. \n•\tAdvised Legal council on all company environmental issues including new land purchase, merger due diligence documentation and two remediation projects. Skills Industrial Hygiene Environmental Management Hazardous Waste... Environmental EHS Indoor Air Quality Environmental Auditing Risk Management Environmental Impact... Environmental Awareness Emergency Management Environmental Compliance Waste Management ISO 14001 Air Quality Waste Environmental Science Environmental... Occupational Health Sampling Remediation Environmental Issues Environmental Consulting Recycling Ergonomics Environmental... Phase I Hazard Recognition Safety Management... Environmental Health Asbestos Hazard Analysis Environmental Monitoring Hazardous Materials Exposure Assessment Industrial Safety Groundwater Remediation Environmental Permitting See 23+     See less Skills  Industrial Hygiene Environmental Management Hazardous Waste... Environmental EHS Indoor Air Quality Environmental Auditing Risk Management Environmental Impact... Environmental Awareness Emergency Management Environmental Compliance Waste Management ISO 14001 Air Quality Waste Environmental Science Environmental... Occupational Health Sampling Remediation Environmental Issues Environmental Consulting Recycling Ergonomics Environmental... Phase I Hazard Recognition Safety Management... Environmental Health Asbestos Hazard Analysis Environmental Monitoring Hazardous Materials Exposure Assessment Industrial Safety Groundwater Remediation Environmental Permitting See 23+     See less Industrial Hygiene Environmental Management Hazardous Waste... Environmental EHS Indoor Air Quality Environmental Auditing Risk Management Environmental Impact... Environmental Awareness Emergency Management Environmental Compliance Waste Management ISO 14001 Air Quality Waste Environmental Science Environmental... Occupational Health Sampling Remediation Environmental Issues Environmental Consulting Recycling Ergonomics Environmental... Phase I Hazard Recognition Safety Management... Environmental Health Asbestos Hazard Analysis Environmental Monitoring Hazardous Materials Exposure Assessment Industrial Safety Groundwater Remediation Environmental Permitting See 23+     See less Industrial Hygiene Environmental Management Hazardous Waste... Environmental EHS Indoor Air Quality Environmental Auditing Risk Management Environmental Impact... Environmental Awareness Emergency Management Environmental Compliance Waste Management ISO 14001 Air Quality Waste Environmental Science Environmental... Occupational Health Sampling Remediation Environmental Issues Environmental Consulting Recycling Ergonomics Environmental... Phase I Hazard Recognition Safety Management... Environmental Health Asbestos Hazard Analysis Environmental Monitoring Hazardous Materials Exposure Assessment Industrial Safety Groundwater Remediation Environmental Permitting See 23+     See less Education The University of British Columbia BSc,  Environmental Chemistry 1991  – 1996 American Board of Industrial Hygiene CIH,  Certified Industrial Hygienist 2004 The University of British Columbia BSc,  Environmental Chemistry 1991  – 1996 The University of British Columbia BSc,  Environmental Chemistry 1991  – 1996 The University of British Columbia BSc,  Environmental Chemistry 1991  – 1996 American Board of Industrial Hygiene CIH,  Certified Industrial Hygienist 2004 American Board of Industrial Hygiene CIH,  Certified Industrial Hygienist 2004 American Board of Industrial Hygiene CIH,  Certified Industrial Hygienist 2004 ", "Summary Certified Safety Professional with over nine years of combined work experience and technical training in the chemical, petroleum, pharmaceutical, and semiconductor manufacturing industries. \n \nCore Competencies: Compliance Assurance, Risk Assessment, Industrial Hygiene, Safety Program Management, OHSAS 18001, ISO 14001, ISO 9001, Chemical Management, Lean Methodologies, Auditing, Job Safety Analysis, Employee Training, Ergonomics, Emergency Response, Task Team Leadership, Product Design, Project Management, Customer Service, Retail Safety, Research and Development Summary Certified Safety Professional with over nine years of combined work experience and technical training in the chemical, petroleum, pharmaceutical, and semiconductor manufacturing industries. \n \nCore Competencies: Compliance Assurance, Risk Assessment, Industrial Hygiene, Safety Program Management, OHSAS 18001, ISO 14001, ISO 9001, Chemical Management, Lean Methodologies, Auditing, Job Safety Analysis, Employee Training, Ergonomics, Emergency Response, Task Team Leadership, Product Design, Project Management, Customer Service, Retail Safety, Research and Development Certified Safety Professional with over nine years of combined work experience and technical training in the chemical, petroleum, pharmaceutical, and semiconductor manufacturing industries. \n \nCore Competencies: Compliance Assurance, Risk Assessment, Industrial Hygiene, Safety Program Management, OHSAS 18001, ISO 14001, ISO 9001, Chemical Management, Lean Methodologies, Auditing, Job Safety Analysis, Employee Training, Ergonomics, Emergency Response, Task Team Leadership, Product Design, Project Management, Customer Service, Retail Safety, Research and Development Certified Safety Professional with over nine years of combined work experience and technical training in the chemical, petroleum, pharmaceutical, and semiconductor manufacturing industries. \n \nCore Competencies: Compliance Assurance, Risk Assessment, Industrial Hygiene, Safety Program Management, OHSAS 18001, ISO 14001, ISO 9001, Chemical Management, Lean Methodologies, Auditing, Job Safety Analysis, Employee Training, Ergonomics, Emergency Response, Task Team Leadership, Product Design, Project Management, Customer Service, Retail Safety, Research and Development Experience SH&E Specialist Cabot Microelectronics May 2014  – Present (1 year 4 months) Chicago, Illinois Supported manufacturing sites, providing Safety, Environmental, and Industrial Hygiene technical expertise. Worked with global, corporate, and site business groups and employees to achieve regulatory compliance. \n \n• Global Industrial Hygiene Leader \n• Managed 25 Safety, Health, and Industrial Hygiene programs in accordance with federal and state regulations \n• Maintained OHSAS 18001 and ISO 14001 certifications \n• Partnered with management to validate regulatory compliance through site audits \n• Created streamlined process for chemical approval and SDS management \n• Developed ergonomic camera inspection technology for product quality inspections \n• Implemented nitrile glove recycling program to reduce landfill waste by 2600+ lbs. \n• Active member of site Emergency Response Team \n• Mentored college internship students \n• SafeStart Trainer Safety Engineer/Industrial Hygienist Intel Corporation September 2010  –  May 2014  (3 years 9 months) Hillsboro, Oregon Supported Oregon based manufacturing and R&D sites, providing Safety and Industrial Hygiene technical expertise. Worked with multiple business groups, contractors, and site employees to achieve regulatory compliance and enhance safety culture. \n \nKey Performance Results: Efforts aligned with company and site safety goals \n•\tManaged site Industrial Hygiene and Safety programs in accordance with federal and state regulations \n•\tValidated OSHA compliance through audits, tool sign-off, noise dosimetry, chemical exposure assessments, and PPE evaluations \n•\tRecognized for participation on global safety teams and involvement with global corporate EHS programs \n•\tPartnered with product teams on development of new technologies to ensure regulatory compliance in design and testing \n•\tAdministered office ergonomic evaluations and coaching for site employees \n•\tReviewed capital projects to confirm regulatory compliance (tool install, ventilation systems) \n•\tRevised incident prevention program and implemented new, streamlined process \n•\tDeveloped streamlined process for contractor chemical approval requests \n•\tInstructed emergency response training sessions for site ERT members \n•\tCompleted development opportunity in Usability Testing and User Experience Occupational Safety and Health Consultant Allstates Technical Services May 2010  –  August 2010  (4 months) Responsible for Industrial Hygiene, PSM, and Safety for the Aramids Business Unit at the DuPont ChambersWorks facility located in Deepwater, New Jersey.  \n \nTemporary position through Allstates Technical Services working for DuPont. Health and Safety Specialist Sunoco January 2007  –  April 2010  (3 years 4 months) Greater Philadelphia Area Supported Sunoco’s Chemicals, Refining, and Marketing business units, providing Industrial Hygiene, Health and Safety technical expertise and obtaining hands-on experience. Worked within three unique business units while managing multiple technical projects. \n \nKey Performance Results: Efforts aligned with company’s proactive approach to safety excellence  \n•\tPerformed corporate facility audits as safety auditor \n•\tManaged facility Industrial Hygiene programs and conducted exposure assessments \n•\tDeveloped and implemented 5S lean manufacturing program into retail locations \n•\tConducted annual regulatory training for employees at multiple facilities \n•\tProvided Safety/IH support for multiple facility wide maintenance projects \n•\tCertified as an instructor in defensive driving techniques \n•\tMentored and managed college intern students \n•\tDeveloped safety training tools (job aids) for retail employees \n•\tOrganized weekly meetings with retail operations managers to align sales goals with safety expectations \n•\tLed task teams to identify and standardize PPE for retail stores \n•\tDeveloped training in emergency response and incident investigation for gasoline transport drivers \n•\tPerformed job safety analyses at high volume, full-service gas stations on major NJ roadways \n•\tMaintained electronic chemical inventory for retail marketing division Industrial Hygiene Intern GlaxoSmithKline May 2006  –  August 2006  (4 months) Greater Philadelphia Area Provided Industrial Hygiene support to R&D pharmaceutical facilities.  \n \nKey Performance Results: Efforts resulted in alignment of safety expectations with sales goals \n•\tConducted ventilation surveys on laboratory hoods and ventilation enclosures \n•\tPartnered with R&D scientists to create ventilation solutions for experiments \n•\tPerformed calibration and maintenance of industrial hygiene equipment \n•\tTrained R&D scientists on formaldehyde safety practices and procedures SH&E Specialist Cabot Microelectronics May 2014  – Present (1 year 4 months) Chicago, Illinois Supported manufacturing sites, providing Safety, Environmental, and Industrial Hygiene technical expertise. Worked with global, corporate, and site business groups and employees to achieve regulatory compliance. \n \n• Global Industrial Hygiene Leader \n• Managed 25 Safety, Health, and Industrial Hygiene programs in accordance with federal and state regulations \n• Maintained OHSAS 18001 and ISO 14001 certifications \n• Partnered with management to validate regulatory compliance through site audits \n• Created streamlined process for chemical approval and SDS management \n• Developed ergonomic camera inspection technology for product quality inspections \n• Implemented nitrile glove recycling program to reduce landfill waste by 2600+ lbs. \n• Active member of site Emergency Response Team \n• Mentored college internship students \n• SafeStart Trainer SH&E Specialist Cabot Microelectronics May 2014  – Present (1 year 4 months) Chicago, Illinois Supported manufacturing sites, providing Safety, Environmental, and Industrial Hygiene technical expertise. Worked with global, corporate, and site business groups and employees to achieve regulatory compliance. \n \n• Global Industrial Hygiene Leader \n• Managed 25 Safety, Health, and Industrial Hygiene programs in accordance with federal and state regulations \n• Maintained OHSAS 18001 and ISO 14001 certifications \n• Partnered with management to validate regulatory compliance through site audits \n• Created streamlined process for chemical approval and SDS management \n• Developed ergonomic camera inspection technology for product quality inspections \n• Implemented nitrile glove recycling program to reduce landfill waste by 2600+ lbs. \n• Active member of site Emergency Response Team \n• Mentored college internship students \n• SafeStart Trainer Safety Engineer/Industrial Hygienist Intel Corporation September 2010  –  May 2014  (3 years 9 months) Hillsboro, Oregon Supported Oregon based manufacturing and R&D sites, providing Safety and Industrial Hygiene technical expertise. Worked with multiple business groups, contractors, and site employees to achieve regulatory compliance and enhance safety culture. \n \nKey Performance Results: Efforts aligned with company and site safety goals \n•\tManaged site Industrial Hygiene and Safety programs in accordance with federal and state regulations \n•\tValidated OSHA compliance through audits, tool sign-off, noise dosimetry, chemical exposure assessments, and PPE evaluations \n•\tRecognized for participation on global safety teams and involvement with global corporate EHS programs \n•\tPartnered with product teams on development of new technologies to ensure regulatory compliance in design and testing \n•\tAdministered office ergonomic evaluations and coaching for site employees \n•\tReviewed capital projects to confirm regulatory compliance (tool install, ventilation systems) \n•\tRevised incident prevention program and implemented new, streamlined process \n•\tDeveloped streamlined process for contractor chemical approval requests \n•\tInstructed emergency response training sessions for site ERT members \n•\tCompleted development opportunity in Usability Testing and User Experience Safety Engineer/Industrial Hygienist Intel Corporation September 2010  –  May 2014  (3 years 9 months) Hillsboro, Oregon Supported Oregon based manufacturing and R&D sites, providing Safety and Industrial Hygiene technical expertise. Worked with multiple business groups, contractors, and site employees to achieve regulatory compliance and enhance safety culture. \n \nKey Performance Results: Efforts aligned with company and site safety goals \n•\tManaged site Industrial Hygiene and Safety programs in accordance with federal and state regulations \n•\tValidated OSHA compliance through audits, tool sign-off, noise dosimetry, chemical exposure assessments, and PPE evaluations \n•\tRecognized for participation on global safety teams and involvement with global corporate EHS programs \n•\tPartnered with product teams on development of new technologies to ensure regulatory compliance in design and testing \n•\tAdministered office ergonomic evaluations and coaching for site employees \n•\tReviewed capital projects to confirm regulatory compliance (tool install, ventilation systems) \n•\tRevised incident prevention program and implemented new, streamlined process \n•\tDeveloped streamlined process for contractor chemical approval requests \n•\tInstructed emergency response training sessions for site ERT members \n•\tCompleted development opportunity in Usability Testing and User Experience Occupational Safety and Health Consultant Allstates Technical Services May 2010  –  August 2010  (4 months) Responsible for Industrial Hygiene, PSM, and Safety for the Aramids Business Unit at the DuPont ChambersWorks facility located in Deepwater, New Jersey.  \n \nTemporary position through Allstates Technical Services working for DuPont. Occupational Safety and Health Consultant Allstates Technical Services May 2010  –  August 2010  (4 months) Responsible for Industrial Hygiene, PSM, and Safety for the Aramids Business Unit at the DuPont ChambersWorks facility located in Deepwater, New Jersey.  \n \nTemporary position through Allstates Technical Services working for DuPont. Health and Safety Specialist Sunoco January 2007  –  April 2010  (3 years 4 months) Greater Philadelphia Area Supported Sunoco’s Chemicals, Refining, and Marketing business units, providing Industrial Hygiene, Health and Safety technical expertise and obtaining hands-on experience. Worked within three unique business units while managing multiple technical projects. \n \nKey Performance Results: Efforts aligned with company’s proactive approach to safety excellence  \n•\tPerformed corporate facility audits as safety auditor \n•\tManaged facility Industrial Hygiene programs and conducted exposure assessments \n•\tDeveloped and implemented 5S lean manufacturing program into retail locations \n•\tConducted annual regulatory training for employees at multiple facilities \n•\tProvided Safety/IH support for multiple facility wide maintenance projects \n•\tCertified as an instructor in defensive driving techniques \n•\tMentored and managed college intern students \n•\tDeveloped safety training tools (job aids) for retail employees \n•\tOrganized weekly meetings with retail operations managers to align sales goals with safety expectations \n•\tLed task teams to identify and standardize PPE for retail stores \n•\tDeveloped training in emergency response and incident investigation for gasoline transport drivers \n•\tPerformed job safety analyses at high volume, full-service gas stations on major NJ roadways \n•\tMaintained electronic chemical inventory for retail marketing division Health and Safety Specialist Sunoco January 2007  –  April 2010  (3 years 4 months) Greater Philadelphia Area Supported Sunoco’s Chemicals, Refining, and Marketing business units, providing Industrial Hygiene, Health and Safety technical expertise and obtaining hands-on experience. Worked within three unique business units while managing multiple technical projects. \n \nKey Performance Results: Efforts aligned with company’s proactive approach to safety excellence  \n•\tPerformed corporate facility audits as safety auditor \n•\tManaged facility Industrial Hygiene programs and conducted exposure assessments \n•\tDeveloped and implemented 5S lean manufacturing program into retail locations \n•\tConducted annual regulatory training for employees at multiple facilities \n•\tProvided Safety/IH support for multiple facility wide maintenance projects \n•\tCertified as an instructor in defensive driving techniques \n•\tMentored and managed college intern students \n•\tDeveloped safety training tools (job aids) for retail employees \n•\tOrganized weekly meetings with retail operations managers to align sales goals with safety expectations \n•\tLed task teams to identify and standardize PPE for retail stores \n•\tDeveloped training in emergency response and incident investigation for gasoline transport drivers \n•\tPerformed job safety analyses at high volume, full-service gas stations on major NJ roadways \n•\tMaintained electronic chemical inventory for retail marketing division Industrial Hygiene Intern GlaxoSmithKline May 2006  –  August 2006  (4 months) Greater Philadelphia Area Provided Industrial Hygiene support to R&D pharmaceutical facilities.  \n \nKey Performance Results: Efforts resulted in alignment of safety expectations with sales goals \n•\tConducted ventilation surveys on laboratory hoods and ventilation enclosures \n•\tPartnered with R&D scientists to create ventilation solutions for experiments \n•\tPerformed calibration and maintenance of industrial hygiene equipment \n•\tTrained R&D scientists on formaldehyde safety practices and procedures Industrial Hygiene Intern GlaxoSmithKline May 2006  –  August 2006  (4 months) Greater Philadelphia Area Provided Industrial Hygiene support to R&D pharmaceutical facilities.  \n \nKey Performance Results: Efforts resulted in alignment of safety expectations with sales goals \n•\tConducted ventilation surveys on laboratory hoods and ventilation enclosures \n•\tPartnered with R&D scientists to create ventilation solutions for experiments \n•\tPerformed calibration and maintenance of industrial hygiene equipment \n•\tTrained R&D scientists on formaldehyde safety practices and procedures Languages English English English Skills EHS Industrial Hygiene Occupational Health Ergonomics Construction Safety Safety Management... Environmental Compliance Environmental... Root Cause Analysis Risk Assessment ISO 14001 Program Management Emergency Management Sustainability Petroleum 5S Project Management Respirator Fit Testing Process Safety Auditing Facilities Management Safety Safety Management Defensive Driving Chemicals MSDS Technical Training Security LOTO Electrical Safety Chemical Safety Semiconductor Industry Soldering Laboratory Safety Product Design Noise Technology Innovation OHSAS 18001 Lab Safety Environmental Awareness Manufacturing Industrial Safety Inspection Training Management R&D Continuous Improvement Lean Manufacturing Hazardous Waste... See 35+     See less Skills  EHS Industrial Hygiene Occupational Health Ergonomics Construction Safety Safety Management... Environmental Compliance Environmental... Root Cause Analysis Risk Assessment ISO 14001 Program Management Emergency Management Sustainability Petroleum 5S Project Management Respirator Fit Testing Process Safety Auditing Facilities Management Safety Safety Management Defensive Driving Chemicals MSDS Technical Training Security LOTO Electrical Safety Chemical Safety Semiconductor Industry Soldering Laboratory Safety Product Design Noise Technology Innovation OHSAS 18001 Lab Safety Environmental Awareness Manufacturing Industrial Safety Inspection Training Management R&D Continuous Improvement Lean Manufacturing Hazardous Waste... See 35+     See less EHS Industrial Hygiene Occupational Health Ergonomics Construction Safety Safety Management... Environmental Compliance Environmental... Root Cause Analysis Risk Assessment ISO 14001 Program Management Emergency Management Sustainability Petroleum 5S Project Management Respirator Fit Testing Process Safety Auditing Facilities Management Safety Safety Management Defensive Driving Chemicals MSDS Technical Training Security LOTO Electrical Safety Chemical Safety Semiconductor Industry Soldering Laboratory Safety Product Design Noise Technology Innovation OHSAS 18001 Lab Safety Environmental Awareness Manufacturing Industrial Safety Inspection Training Management R&D Continuous Improvement Lean Manufacturing Hazardous Waste... See 35+     See less EHS Industrial Hygiene Occupational Health Ergonomics Construction Safety Safety Management... Environmental Compliance Environmental... Root Cause Analysis Risk Assessment ISO 14001 Program Management Emergency Management Sustainability Petroleum 5S Project Management Respirator Fit Testing Process Safety Auditing Facilities Management Safety Safety Management Defensive Driving Chemicals MSDS Technical Training Security LOTO Electrical Safety Chemical Safety Semiconductor Industry Soldering Laboratory Safety Product Design Noise Technology Innovation OHSAS 18001 Lab Safety Environmental Awareness Manufacturing Industrial Safety Inspection Training Management R&D Continuous Improvement Lean Manufacturing Hazardous Waste... See 35+     See less Education Rochester Institute of Technology Master's Degree,  EHS Managment 2007  – 2010 Co-Author, An Analysis of Reported Sustainability Related Efforts in the Petroleum Refining Industry \n \nGraduated in 2010 Millersville University of Pennsylvania B.S.,  Occupational Safety and Environmental Health 2003  – 2007 Millersville University Dean’s List Activities and Societies:  ASSE Student Chapter ,  Bowling Club ,  Competitive Collegiate Bowling Team Rochester Institute of Technology Master's Degree,  EHS Managment 2007  – 2010 Co-Author, An Analysis of Reported Sustainability Related Efforts in the Petroleum Refining Industry \n \nGraduated in 2010 Rochester Institute of Technology Master's Degree,  EHS Managment 2007  – 2010 Co-Author, An Analysis of Reported Sustainability Related Efforts in the Petroleum Refining Industry \n \nGraduated in 2010 Rochester Institute of Technology Master's Degree,  EHS Managment 2007  – 2010 Co-Author, An Analysis of Reported Sustainability Related Efforts in the Petroleum Refining Industry \n \nGraduated in 2010 Millersville University of Pennsylvania B.S.,  Occupational Safety and Environmental Health 2003  – 2007 Millersville University Dean’s List Activities and Societies:  ASSE Student Chapter ,  Bowling Club ,  Competitive Collegiate Bowling Team Millersville University of Pennsylvania B.S.,  Occupational Safety and Environmental Health 2003  – 2007 Millersville University Dean’s List Activities and Societies:  ASSE Student Chapter ,  Bowling Club ,  Competitive Collegiate Bowling Team Millersville University of Pennsylvania B.S.,  Occupational Safety and Environmental Health 2003  – 2007 Millersville University Dean’s List Activities and Societies:  ASSE Student Chapter ,  Bowling Club ,  Competitive Collegiate Bowling Team Honors & Awards ", "Summary Over twenty years award-winning experience with Fortune 100 Intel in a variety of highly visible Project/Program Management roles. Demonstrated expertise in tackling crucial business problems with insightful problem-solving, strong decision-making, and visionary perspective. Sought-after change agent and consensus-builder with deep-seated commitment to service and diplomacy. Excellent communicator, translating complicated issues into manageable situations for strong and sustaining results. Valued as:  \n \nDriver of innovation—Member of the EHS Reengineering team that produced; scope, systems, and resource innovations to improve EHS performance. Earned 13 Performance and Leadership Awards in 22 years, recognizing the top 5% of performers company-wide, including a CS Excellence Award for EHS Reengineering. \n \nLeader of complex, far-reaching projects— Led information management systems deployment across three diverse regions, spanning thousands of transaction points and thousands of end users. Produced double-digit efficiency and effectiveness gains. \n \nConsensus builder and collaborative team leader—Consistently builds global cross-functional, cross-cultural relationships and employs an inclusive leadership style to ensure the success of critical initiatives. \n \nChampion of cost-effective, efficiency-generating systems—Led the development of a $500K automation project that generated $3.5M in business value. Summary Over twenty years award-winning experience with Fortune 100 Intel in a variety of highly visible Project/Program Management roles. Demonstrated expertise in tackling crucial business problems with insightful problem-solving, strong decision-making, and visionary perspective. Sought-after change agent and consensus-builder with deep-seated commitment to service and diplomacy. Excellent communicator, translating complicated issues into manageable situations for strong and sustaining results. Valued as:  \n \nDriver of innovation—Member of the EHS Reengineering team that produced; scope, systems, and resource innovations to improve EHS performance. Earned 13 Performance and Leadership Awards in 22 years, recognizing the top 5% of performers company-wide, including a CS Excellence Award for EHS Reengineering. \n \nLeader of complex, far-reaching projects— Led information management systems deployment across three diverse regions, spanning thousands of transaction points and thousands of end users. Produced double-digit efficiency and effectiveness gains. \n \nConsensus builder and collaborative team leader—Consistently builds global cross-functional, cross-cultural relationships and employs an inclusive leadership style to ensure the success of critical initiatives. \n \nChampion of cost-effective, efficiency-generating systems—Led the development of a $500K automation project that generated $3.5M in business value. Over twenty years award-winning experience with Fortune 100 Intel in a variety of highly visible Project/Program Management roles. Demonstrated expertise in tackling crucial business problems with insightful problem-solving, strong decision-making, and visionary perspective. Sought-after change agent and consensus-builder with deep-seated commitment to service and diplomacy. Excellent communicator, translating complicated issues into manageable situations for strong and sustaining results. Valued as:  \n \nDriver of innovation—Member of the EHS Reengineering team that produced; scope, systems, and resource innovations to improve EHS performance. Earned 13 Performance and Leadership Awards in 22 years, recognizing the top 5% of performers company-wide, including a CS Excellence Award for EHS Reengineering. \n \nLeader of complex, far-reaching projects— Led information management systems deployment across three diverse regions, spanning thousands of transaction points and thousands of end users. Produced double-digit efficiency and effectiveness gains. \n \nConsensus builder and collaborative team leader—Consistently builds global cross-functional, cross-cultural relationships and employs an inclusive leadership style to ensure the success of critical initiatives. \n \nChampion of cost-effective, efficiency-generating systems—Led the development of a $500K automation project that generated $3.5M in business value. Over twenty years award-winning experience with Fortune 100 Intel in a variety of highly visible Project/Program Management roles. Demonstrated expertise in tackling crucial business problems with insightful problem-solving, strong decision-making, and visionary perspective. Sought-after change agent and consensus-builder with deep-seated commitment to service and diplomacy. Excellent communicator, translating complicated issues into manageable situations for strong and sustaining results. Valued as:  \n \nDriver of innovation—Member of the EHS Reengineering team that produced; scope, systems, and resource innovations to improve EHS performance. Earned 13 Performance and Leadership Awards in 22 years, recognizing the top 5% of performers company-wide, including a CS Excellence Award for EHS Reengineering. \n \nLeader of complex, far-reaching projects— Led information management systems deployment across three diverse regions, spanning thousands of transaction points and thousands of end users. Produced double-digit efficiency and effectiveness gains. \n \nConsensus builder and collaborative team leader—Consistently builds global cross-functional, cross-cultural relationships and employs an inclusive leadership style to ensure the success of critical initiatives. \n \nChampion of cost-effective, efficiency-generating systems—Led the development of a $500K automation project that generated $3.5M in business value. Experience Senior Program Manager - EHS Re-Engineering Team Intel Corporation November 2011  – Present (3 years 10 months) Selected by EHS management to reengineer the EHS organization.  \n \nConducted an extensive review of the EHS services provided  \nConducted an extensive review of resource modeling options  \nLed the selection efforts for new enterprise, companywide software platform  \n \nResults: \nIntel is implementing a new single standard software platform to manage EHS business \nIntel is implementing a new resource model and standard services scope to improve EHS performance worldwide Senior Program Manager - Corporate Industrial Hygiene Intel Corporation April 2009  –  November 2011  (2 years 8 months) Selected by EHS management to bring discipline and focus to Intel’s global Industrial Hygiene programs. Create crisp, lean, effective, compliance programs. Execute global site audits to evaluate local program implementation efforts. Manage data management systems to support business and compliance objectives. \n \nCoordinated Intel response actions to the Japan earthquake, and radiation response \nCoordinated discovery and deposition response to workers compensation challenges \nFocused on building the companywide infrastructure to execute Industrial Hygiene initiatives. \n \nResults: \nIntel’s response to the Japan radiation health concerns viewed as a highlight by senior management (TMG Excellence Award) \nIntel’s response to workers compensation challenges viewed as a highlight by senior management Senior Program Manager - EHS Software & Systems Intel Corporation September 2006  –  April 2009  (2 years 8 months) Led a global cross functional effort to increase efficiency and effectiveness of overall software and systems. Application count reduced by 50%, trouble calls reduced by 33% over baseline, website and documenation content made more efficient by achieving a 50% reduction in page and document count. Senior Program Manager - Chemical Management Intel Corporation March 2004  –  September 2006  (2 years 7 months) Led a global cross-functional team in redesigning a complex division-wide system impacting purchasing, manufacturing, and health and safety. Dramatically improved customer service and enhanced risk management. Senior Program Manager - Business Continuity Intel Corporation January 2002  –  March 2004  (2 years 3 months) Enlisted to create and launch Intel EHS’ business continuity & threat preparedness strategy. Built function from the ground up, designing and executing processes that aligned 400 people and 20 global sites. Senior Corporate Industrial Hygienist Intel Corporation January 2000  –  January 2002  (2 years 1 month) Led multiple initiatives that improved organizational efficiency and effectiveness. Developed a positive culture of recognition and staff development. Senior Site Safety & Industrial Hygiene Engineer Intel Corporation December 1991  –  January 2000  (8 years 2 months) Progressed through a series of challenging roles, culminating as Senior Industrial Hygienist. New site start-up, program development, facility retrofit. Program Administrator The Boeing Company June 1991  –  November 1991  (6 months) Research & Teaching Assistant University of Washington August 1989  –  June 1991  (1 year 11 months) Assistant Chemist Dames & Moore March 1989  –  May 1990  (1 year 3 months) Senior Program Manager - EHS Re-Engineering Team Intel Corporation November 2011  – Present (3 years 10 months) Selected by EHS management to reengineer the EHS organization.  \n \nConducted an extensive review of the EHS services provided  \nConducted an extensive review of resource modeling options  \nLed the selection efforts for new enterprise, companywide software platform  \n \nResults: \nIntel is implementing a new single standard software platform to manage EHS business \nIntel is implementing a new resource model and standard services scope to improve EHS performance worldwide Senior Program Manager - EHS Re-Engineering Team Intel Corporation November 2011  – Present (3 years 10 months) Selected by EHS management to reengineer the EHS organization.  \n \nConducted an extensive review of the EHS services provided  \nConducted an extensive review of resource modeling options  \nLed the selection efforts for new enterprise, companywide software platform  \n \nResults: \nIntel is implementing a new single standard software platform to manage EHS business \nIntel is implementing a new resource model and standard services scope to improve EHS performance worldwide Senior Program Manager - Corporate Industrial Hygiene Intel Corporation April 2009  –  November 2011  (2 years 8 months) Selected by EHS management to bring discipline and focus to Intel’s global Industrial Hygiene programs. Create crisp, lean, effective, compliance programs. Execute global site audits to evaluate local program implementation efforts. Manage data management systems to support business and compliance objectives. \n \nCoordinated Intel response actions to the Japan earthquake, and radiation response \nCoordinated discovery and deposition response to workers compensation challenges \nFocused on building the companywide infrastructure to execute Industrial Hygiene initiatives. \n \nResults: \nIntel’s response to the Japan radiation health concerns viewed as a highlight by senior management (TMG Excellence Award) \nIntel’s response to workers compensation challenges viewed as a highlight by senior management Senior Program Manager - Corporate Industrial Hygiene Intel Corporation April 2009  –  November 2011  (2 years 8 months) Selected by EHS management to bring discipline and focus to Intel’s global Industrial Hygiene programs. Create crisp, lean, effective, compliance programs. Execute global site audits to evaluate local program implementation efforts. Manage data management systems to support business and compliance objectives. \n \nCoordinated Intel response actions to the Japan earthquake, and radiation response \nCoordinated discovery and deposition response to workers compensation challenges \nFocused on building the companywide infrastructure to execute Industrial Hygiene initiatives. \n \nResults: \nIntel’s response to the Japan radiation health concerns viewed as a highlight by senior management (TMG Excellence Award) \nIntel’s response to workers compensation challenges viewed as a highlight by senior management Senior Program Manager - EHS Software & Systems Intel Corporation September 2006  –  April 2009  (2 years 8 months) Led a global cross functional effort to increase efficiency and effectiveness of overall software and systems. Application count reduced by 50%, trouble calls reduced by 33% over baseline, website and documenation content made more efficient by achieving a 50% reduction in page and document count. Senior Program Manager - EHS Software & Systems Intel Corporation September 2006  –  April 2009  (2 years 8 months) Led a global cross functional effort to increase efficiency and effectiveness of overall software and systems. Application count reduced by 50%, trouble calls reduced by 33% over baseline, website and documenation content made more efficient by achieving a 50% reduction in page and document count. Senior Program Manager - Chemical Management Intel Corporation March 2004  –  September 2006  (2 years 7 months) Led a global cross-functional team in redesigning a complex division-wide system impacting purchasing, manufacturing, and health and safety. Dramatically improved customer service and enhanced risk management. Senior Program Manager - Chemical Management Intel Corporation March 2004  –  September 2006  (2 years 7 months) Led a global cross-functional team in redesigning a complex division-wide system impacting purchasing, manufacturing, and health and safety. Dramatically improved customer service and enhanced risk management. Senior Program Manager - Business Continuity Intel Corporation January 2002  –  March 2004  (2 years 3 months) Enlisted to create and launch Intel EHS’ business continuity & threat preparedness strategy. Built function from the ground up, designing and executing processes that aligned 400 people and 20 global sites. Senior Program Manager - Business Continuity Intel Corporation January 2002  –  March 2004  (2 years 3 months) Enlisted to create and launch Intel EHS’ business continuity & threat preparedness strategy. Built function from the ground up, designing and executing processes that aligned 400 people and 20 global sites. Senior Corporate Industrial Hygienist Intel Corporation January 2000  –  January 2002  (2 years 1 month) Led multiple initiatives that improved organizational efficiency and effectiveness. Developed a positive culture of recognition and staff development. Senior Corporate Industrial Hygienist Intel Corporation January 2000  –  January 2002  (2 years 1 month) Led multiple initiatives that improved organizational efficiency and effectiveness. Developed a positive culture of recognition and staff development. Senior Site Safety & Industrial Hygiene Engineer Intel Corporation December 1991  –  January 2000  (8 years 2 months) Progressed through a series of challenging roles, culminating as Senior Industrial Hygienist. New site start-up, program development, facility retrofit. Senior Site Safety & Industrial Hygiene Engineer Intel Corporation December 1991  –  January 2000  (8 years 2 months) Progressed through a series of challenging roles, culminating as Senior Industrial Hygienist. New site start-up, program development, facility retrofit. Program Administrator The Boeing Company June 1991  –  November 1991  (6 months) Program Administrator The Boeing Company June 1991  –  November 1991  (6 months) Research & Teaching Assistant University of Washington August 1989  –  June 1991  (1 year 11 months) Research & Teaching Assistant University of Washington August 1989  –  June 1991  (1 year 11 months) Assistant Chemist Dames & Moore March 1989  –  May 1990  (1 year 3 months) Assistant Chemist Dames & Moore March 1989  –  May 1990  (1 year 3 months) Skills Global Leadership Cross-functional Team... Semiconductors EHS Program Management Industrial Hygiene Leadership Strategy Project Management Sustainability Organizational... Risk Management Training Risk Assessment Root Cause Analysis Enterprise Software Manufacturing Security Start-ups Continuous Improvement Six Sigma Process Improvement Process Engineering Design of Experiments Engineering Management Management See 11+     See less Skills  Global Leadership Cross-functional Team... Semiconductors EHS Program Management Industrial Hygiene Leadership Strategy Project Management Sustainability Organizational... Risk Management Training Risk Assessment Root Cause Analysis Enterprise Software Manufacturing Security Start-ups Continuous Improvement Six Sigma Process Improvement Process Engineering Design of Experiments Engineering Management Management See 11+     See less Global Leadership Cross-functional Team... Semiconductors EHS Program Management Industrial Hygiene Leadership Strategy Project Management Sustainability Organizational... Risk Management Training Risk Assessment Root Cause Analysis Enterprise Software Manufacturing Security Start-ups Continuous Improvement Six Sigma Process Improvement Process Engineering Design of Experiments Engineering Management Management See 11+     See less Global Leadership Cross-functional Team... Semiconductors EHS Program Management Industrial Hygiene Leadership Strategy Project Management Sustainability Organizational... Risk Management Training Risk Assessment Root Cause Analysis Enterprise Software Manufacturing Security Start-ups Continuous Improvement Six Sigma Process Improvement Process Engineering Design of Experiments Engineering Management Management See 11+     See less Education University of Washington - Michael G. Foster Graduate School of Business Master of Business Administration,  Executive MBA 2006  – 2008 University of Washington - Graduate School of Public Health and Community Medicine Master of Science,  Environmental Health - Industrial Hygiene 1989  – 1991 University of Washington - College of Arts and Sciences Bachelor of Science,  Chemistry 1985  – 1989 University of Washington - Michael G. Foster Graduate School of Business Master of Business Administration,  Executive MBA 2006  – 2008 University of Washington - Michael G. Foster Graduate School of Business Master of Business Administration,  Executive MBA 2006  – 2008 University of Washington - Michael G. Foster Graduate School of Business Master of Business Administration,  Executive MBA 2006  – 2008 University of Washington - Graduate School of Public Health and Community Medicine Master of Science,  Environmental Health - Industrial Hygiene 1989  – 1991 University of Washington - Graduate School of Public Health and Community Medicine Master of Science,  Environmental Health - Industrial Hygiene 1989  – 1991 University of Washington - Graduate School of Public Health and Community Medicine Master of Science,  Environmental Health - Industrial Hygiene 1989  – 1991 University of Washington - College of Arts and Sciences Bachelor of Science,  Chemistry 1985  – 1989 University of Washington - College of Arts and Sciences Bachelor of Science,  Chemistry 1985  – 1989 University of Washington - College of Arts and Sciences Bachelor of Science,  Chemistry 1985  – 1989 Honors & Awards Additional Honors & Awards •\tAIHA Future Leaders Institute Participant (chosen from 100+ applicants) \n•\tNIOSH National Occupational Research Agenda participant  \n•\tInstrumental in passing professional title protection bill through the Oregon House and Senate Additional Honors & Awards •\tAIHA Future Leaders Institute Participant (chosen from 100+ applicants) \n•\tNIOSH National Occupational Research Agenda participant  \n•\tInstrumental in passing professional title protection bill through the Oregon House and Senate Additional Honors & Awards •\tAIHA Future Leaders Institute Participant (chosen from 100+ applicants) \n•\tNIOSH National Occupational Research Agenda participant  \n•\tInstrumental in passing professional title protection bill through the Oregon House and Senate Additional Honors & Awards •\tAIHA Future Leaders Institute Participant (chosen from 100+ applicants) \n•\tNIOSH National Occupational Research Agenda participant  \n•\tInstrumental in passing professional title protection bill through the Oregon House and Senate ", "Experience Industrial Hygienist & EHS Coordinator Intel July 2006  – Present (9 years 2 months) Portland, Oregon Area Research Assistant Univeristy of Minnesota 2005  –  2006  (1 year) Developed a security risk assessment of vulnerability of the Minnesota milk supply system from farm to table \n \nCreated a process flow chart of the milk supply system outlining time durations, vulnerability risk points and areas for security improvement \n \nDeveloped criteria for evaluating dairy worker exposure to intentional contaminants that may be in the milk supply Industrial Hygiene Intern National Institute of Occupational Safety and Health May 2005  –  September 2005  (5 months) Lead four health hazard evaluation investigations and provided engineering and management recommendations to resolve employee health issues in multiple industries \n \nCo-authored research study on lead dust exposure from wood floor refinishing \n \nLed investigation of volatile organic compounds use in multiple nail salons across the country and provided recommendations for store owners and building managers to enhance occupant comfort and reduce employee exposure \n \nCollected field samples for lead dust, mold and flour dust during four site investigations Energy Analyst Intern Hennepin County January 2005  –  April 2005  (4 months) Researched and presented effective methods for local schools and county offices to reduce emission of greenhouse gases \n \nInvestigated and recommended funding opportunities for supporting county environmental initiatives \n \nDeveloped framework for county energy web-site Environmental Engineering Intern Land O'Lakes May 2002  –  September 2004  (2 years 5 months) Calculated air emissions for over 30 food processing plants throughout the country and evaluated air emission permit requirements \n \nDeveloped strategy to evaluate diacetyl chemical exposure risk  \n \nCreated and maintained Storm Water Pollution Prevention Plans for over 40 fertilizer and food processing plants throughout the country Industrial Hygienist & EHS Coordinator Intel July 2006  – Present (9 years 2 months) Portland, Oregon Area Industrial Hygienist & EHS Coordinator Intel July 2006  – Present (9 years 2 months) Portland, Oregon Area Research Assistant Univeristy of Minnesota 2005  –  2006  (1 year) Developed a security risk assessment of vulnerability of the Minnesota milk supply system from farm to table \n \nCreated a process flow chart of the milk supply system outlining time durations, vulnerability risk points and areas for security improvement \n \nDeveloped criteria for evaluating dairy worker exposure to intentional contaminants that may be in the milk supply Research Assistant Univeristy of Minnesota 2005  –  2006  (1 year) Developed a security risk assessment of vulnerability of the Minnesota milk supply system from farm to table \n \nCreated a process flow chart of the milk supply system outlining time durations, vulnerability risk points and areas for security improvement \n \nDeveloped criteria for evaluating dairy worker exposure to intentional contaminants that may be in the milk supply Industrial Hygiene Intern National Institute of Occupational Safety and Health May 2005  –  September 2005  (5 months) Lead four health hazard evaluation investigations and provided engineering and management recommendations to resolve employee health issues in multiple industries \n \nCo-authored research study on lead dust exposure from wood floor refinishing \n \nLed investigation of volatile organic compounds use in multiple nail salons across the country and provided recommendations for store owners and building managers to enhance occupant comfort and reduce employee exposure \n \nCollected field samples for lead dust, mold and flour dust during four site investigations Industrial Hygiene Intern National Institute of Occupational Safety and Health May 2005  –  September 2005  (5 months) Lead four health hazard evaluation investigations and provided engineering and management recommendations to resolve employee health issues in multiple industries \n \nCo-authored research study on lead dust exposure from wood floor refinishing \n \nLed investigation of volatile organic compounds use in multiple nail salons across the country and provided recommendations for store owners and building managers to enhance occupant comfort and reduce employee exposure \n \nCollected field samples for lead dust, mold and flour dust during four site investigations Energy Analyst Intern Hennepin County January 2005  –  April 2005  (4 months) Researched and presented effective methods for local schools and county offices to reduce emission of greenhouse gases \n \nInvestigated and recommended funding opportunities for supporting county environmental initiatives \n \nDeveloped framework for county energy web-site Energy Analyst Intern Hennepin County January 2005  –  April 2005  (4 months) Researched and presented effective methods for local schools and county offices to reduce emission of greenhouse gases \n \nInvestigated and recommended funding opportunities for supporting county environmental initiatives \n \nDeveloped framework for county energy web-site Environmental Engineering Intern Land O'Lakes May 2002  –  September 2004  (2 years 5 months) Calculated air emissions for over 30 food processing plants throughout the country and evaluated air emission permit requirements \n \nDeveloped strategy to evaluate diacetyl chemical exposure risk  \n \nCreated and maintained Storm Water Pollution Prevention Plans for over 40 fertilizer and food processing plants throughout the country Environmental Engineering Intern Land O'Lakes May 2002  –  September 2004  (2 years 5 months) Calculated air emissions for over 30 food processing plants throughout the country and evaluated air emission permit requirements \n \nDeveloped strategy to evaluate diacetyl chemical exposure risk  \n \nCreated and maintained Storm Water Pollution Prevention Plans for over 40 fertilizer and food processing plants throughout the country Skills EHS Environmental Awareness Industrial Hygiene Risk Assessment Ergonomics Safety Safety Management... Asbestos Lead Management Emergency Management Exposure Assessment Continuous Improvement Environmental Compliance Industrial Safety Occupational Health Program Management See 1+     See less Skills  EHS Environmental Awareness Industrial Hygiene Risk Assessment Ergonomics Safety Safety Management... Asbestos Lead Management Emergency Management Exposure Assessment Continuous Improvement Environmental Compliance Industrial Safety Occupational Health Program Management See 1+     See less EHS Environmental Awareness Industrial Hygiene Risk Assessment Ergonomics Safety Safety Management... Asbestos Lead Management Emergency Management Exposure Assessment Continuous Improvement Environmental Compliance Industrial Safety Occupational Health Program Management See 1+     See less EHS Environmental Awareness Industrial Hygiene Risk Assessment Ergonomics Safety Safety Management... Asbestos Lead Management Emergency Management Exposure Assessment Continuous Improvement Environmental Compliance Industrial Safety Occupational Health Program Management See 1+     See less Education University of Minnesota-Twin Cities M.S.,  Public Health - Industrial Hygiene 2004  – 2006 Activities and Societies:  Treasurer ,  School of Public Health Student Senate University of Minnesota-Twin Cities B.S,  Enviornmental Engineering 2000  – 2004 Activities and Societies:  President ,  College of Engineering Student Board ,  Treasurer American Society of Agricultural Engineers University of Minnesota-Twin Cities M.S.,  Public Health - Industrial Hygiene 2004  – 2006 Activities and Societies:  Treasurer ,  School of Public Health Student Senate University of Minnesota-Twin Cities M.S.,  Public Health - Industrial Hygiene 2004  – 2006 Activities and Societies:  Treasurer ,  School of Public Health Student Senate University of Minnesota-Twin Cities M.S.,  Public Health - Industrial Hygiene 2004  – 2006 Activities and Societies:  Treasurer ,  School of Public Health Student Senate University of Minnesota-Twin Cities B.S,  Enviornmental Engineering 2000  – 2004 Activities and Societies:  President ,  College of Engineering Student Board ,  Treasurer American Society of Agricultural Engineers University of Minnesota-Twin Cities B.S,  Enviornmental Engineering 2000  – 2004 Activities and Societies:  President ,  College of Engineering Student Board ,  Treasurer American Society of Agricultural Engineers University of Minnesota-Twin Cities B.S,  Enviornmental Engineering 2000  – 2004 Activities and Societies:  President ,  College of Engineering Student Board ,  Treasurer American Society of Agricultural Engineers ", "Summary Mike Kemp is a Senior Safety Engineer and Industrial Hygienist at Intel Corporation. From 1994 to present, he has been responsible for a broad range of EHS related initiatives from basic program & training development to complex changes such as modifying the safety cultures of entire manufacturing facilities, both at sites in the US as well as international assembly operations. \n \nIn addition, he has also been active in driving Intel to the next level of safety excellence by influencing changes to what and how indicators are used in performance tracking. \n \nHe currently serves as a delegate to the New Mexico Chapter of American Society of Safety Engineers (past president) and holds a Certified Safety Professional (CSP) title. Specialties:Stakeholder engagement, fatality prevention program compliance, behavioral safety initiatives, design reviews (blueprint knowledge), coaching/mentoring ehs staff (including international teams), construction safety (industry), OSHA VPP implementation and sustainability, accident/injury investigations, and applying critical thinking to complex problem solving that provides appropriate protection for employees while not driving the company into bankruptcy! Summary Mike Kemp is a Senior Safety Engineer and Industrial Hygienist at Intel Corporation. From 1994 to present, he has been responsible for a broad range of EHS related initiatives from basic program & training development to complex changes such as modifying the safety cultures of entire manufacturing facilities, both at sites in the US as well as international assembly operations. \n \nIn addition, he has also been active in driving Intel to the next level of safety excellence by influencing changes to what and how indicators are used in performance tracking. \n \nHe currently serves as a delegate to the New Mexico Chapter of American Society of Safety Engineers (past president) and holds a Certified Safety Professional (CSP) title. Specialties:Stakeholder engagement, fatality prevention program compliance, behavioral safety initiatives, design reviews (blueprint knowledge), coaching/mentoring ehs staff (including international teams), construction safety (industry), OSHA VPP implementation and sustainability, accident/injury investigations, and applying critical thinking to complex problem solving that provides appropriate protection for employees while not driving the company into bankruptcy! Mike Kemp is a Senior Safety Engineer and Industrial Hygienist at Intel Corporation. From 1994 to present, he has been responsible for a broad range of EHS related initiatives from basic program & training development to complex changes such as modifying the safety cultures of entire manufacturing facilities, both at sites in the US as well as international assembly operations. \n \nIn addition, he has also been active in driving Intel to the next level of safety excellence by influencing changes to what and how indicators are used in performance tracking. \n \nHe currently serves as a delegate to the New Mexico Chapter of American Society of Safety Engineers (past president) and holds a Certified Safety Professional (CSP) title. Specialties:Stakeholder engagement, fatality prevention program compliance, behavioral safety initiatives, design reviews (blueprint knowledge), coaching/mentoring ehs staff (including international teams), construction safety (industry), OSHA VPP implementation and sustainability, accident/injury investigations, and applying critical thinking to complex problem solving that provides appropriate protection for employees while not driving the company into bankruptcy! Mike Kemp is a Senior Safety Engineer and Industrial Hygienist at Intel Corporation. From 1994 to present, he has been responsible for a broad range of EHS related initiatives from basic program & training development to complex changes such as modifying the safety cultures of entire manufacturing facilities, both at sites in the US as well as international assembly operations. \n \nIn addition, he has also been active in driving Intel to the next level of safety excellence by influencing changes to what and how indicators are used in performance tracking. \n \nHe currently serves as a delegate to the New Mexico Chapter of American Society of Safety Engineers (past president) and holds a Certified Safety Professional (CSP) title. Specialties:Stakeholder engagement, fatality prevention program compliance, behavioral safety initiatives, design reviews (blueprint knowledge), coaching/mentoring ehs staff (including international teams), construction safety (industry), OSHA VPP implementation and sustainability, accident/injury investigations, and applying critical thinking to complex problem solving that provides appropriate protection for employees while not driving the company into bankruptcy! Experience Senior Safety Engineer & Industrial Hygienist Intel Corp July 1994  – Present (21 years 2 months) Junior Umpire NMOA 2007  –  2009  (2 years) This isn't really a job position so much as a volunteer effort to help out the community. I have a passion for all things baseball! At the beginning of the 2007 season I noticed an article in the local newspaper that the NM athletic organization was going to have to cancel some High School baseball leagues due there not being enough umpires. I had been looking at increasing volunteer time away from work and found this the perfect opportunity. \n \nI have taken a little break as my wife and I just had a beautiful baby daughter. But I look forward to getting back into it this coming summer league. Safety Engineer E-Systems, Inc. June 1993  –  December 1993  (7 months) Internship with a defense contractor to help manage safety and health programs for the sustaining parts of the facility. Senior Safety Engineer & Industrial Hygienist Intel Corp July 1994  – Present (21 years 2 months) Senior Safety Engineer & Industrial Hygienist Intel Corp July 1994  – Present (21 years 2 months) Junior Umpire NMOA 2007  –  2009  (2 years) This isn't really a job position so much as a volunteer effort to help out the community. I have a passion for all things baseball! At the beginning of the 2007 season I noticed an article in the local newspaper that the NM athletic organization was going to have to cancel some High School baseball leagues due there not being enough umpires. I had been looking at increasing volunteer time away from work and found this the perfect opportunity. \n \nI have taken a little break as my wife and I just had a beautiful baby daughter. But I look forward to getting back into it this coming summer league. Junior Umpire NMOA 2007  –  2009  (2 years) This isn't really a job position so much as a volunteer effort to help out the community. I have a passion for all things baseball! At the beginning of the 2007 season I noticed an article in the local newspaper that the NM athletic organization was going to have to cancel some High School baseball leagues due there not being enough umpires. I had been looking at increasing volunteer time away from work and found this the perfect opportunity. \n \nI have taken a little break as my wife and I just had a beautiful baby daughter. But I look forward to getting back into it this coming summer league. Safety Engineer E-Systems, Inc. June 1993  –  December 1993  (7 months) Internship with a defense contractor to help manage safety and health programs for the sustaining parts of the facility. Safety Engineer E-Systems, Inc. June 1993  –  December 1993  (7 months) Internship with a defense contractor to help manage safety and health programs for the sustaining parts of the facility. Skills Safety Management... Hazardous Waste... Ergonomics Industrial Safety Leadership EHS Continuous Improvement Industrial Hygiene Construction Safety Management Training Process Engineering Factory Behavior Based Safety Occupational Health Program Management Environmental Compliance Facilities Management Engineering Management Risk Assessment Manufacturing Workplace Safety Environmental Awareness Employee Training Accident Investigation Cross-functional Team... Root Cause Analysis Semiconductors Process Improvement Environmental... ISO ISO 14001 Safety Engineering Energy Inspection Engineering See 21+     See less Skills  Safety Management... Hazardous Waste... Ergonomics Industrial Safety Leadership EHS Continuous Improvement Industrial Hygiene Construction Safety Management Training Process Engineering Factory Behavior Based Safety Occupational Health Program Management Environmental Compliance Facilities Management Engineering Management Risk Assessment Manufacturing Workplace Safety Environmental Awareness Employee Training Accident Investigation Cross-functional Team... Root Cause Analysis Semiconductors Process Improvement Environmental... ISO ISO 14001 Safety Engineering Energy Inspection Engineering See 21+     See less Safety Management... Hazardous Waste... Ergonomics Industrial Safety Leadership EHS Continuous Improvement Industrial Hygiene Construction Safety Management Training Process Engineering Factory Behavior Based Safety Occupational Health Program Management Environmental Compliance Facilities Management Engineering Management Risk Assessment Manufacturing Workplace Safety Environmental Awareness Employee Training Accident Investigation Cross-functional Team... Root Cause Analysis Semiconductors Process Improvement Environmental... ISO ISO 14001 Safety Engineering Energy Inspection Engineering See 21+     See less Safety Management... Hazardous Waste... Ergonomics Industrial Safety Leadership EHS Continuous Improvement Industrial Hygiene Construction Safety Management Training Process Engineering Factory Behavior Based Safety Occupational Health Program Management Environmental Compliance Facilities Management Engineering Management Risk Assessment Manufacturing Workplace Safety Environmental Awareness Employee Training Accident Investigation Cross-functional Team... Root Cause Analysis Semiconductors Process Improvement Environmental... ISO ISO 14001 Safety Engineering Energy Inspection Engineering See 21+     See less Education Murray State University Area in Occupational Safety & Health,  Engineering 1989  – 1994 Activities and Societies:  Member of Pi Kappa Alpha fraternity ,  Student ASSE chapter member and volunteer ,  Resident Assistant Program Murray State University Area in Occupational Safety & Health,  Engineering 1989  – 1994 Activities and Societies:  Member of Pi Kappa Alpha fraternity ,  Student ASSE chapter member and volunteer ,  Resident Assistant Program Murray State University Area in Occupational Safety & Health,  Engineering 1989  – 1994 Activities and Societies:  Member of Pi Kappa Alpha fraternity ,  Student ASSE chapter member and volunteer ,  Resident Assistant Program Murray State University Area in Occupational Safety & Health,  Engineering 1989  – 1994 Activities and Societies:  Member of Pi Kappa Alpha fraternity ,  Student ASSE chapter member and volunteer ,  Resident Assistant Program "]}