{"position": "Industrial Engineer", "company": "Intel Corporation", "profiles": ["Summary Organized and responsible with strong communication skills. Demonstrated history of leading project teams and using structured problem solving to identify and resolve issues. Proven ability to implement lean techniques to eliminate waste and streamline processes.  \n \nSpecialties: Project management, facility layouts and design, capacity planning, process tool installation, cycle time analysis, lean manufacturing, and structured problem solving. Summary Organized and responsible with strong communication skills. Demonstrated history of leading project teams and using structured problem solving to identify and resolve issues. Proven ability to implement lean techniques to eliminate waste and streamline processes.  \n \nSpecialties: Project management, facility layouts and design, capacity planning, process tool installation, cycle time analysis, lean manufacturing, and structured problem solving. Organized and responsible with strong communication skills. Demonstrated history of leading project teams and using structured problem solving to identify and resolve issues. Proven ability to implement lean techniques to eliminate waste and streamline processes.  \n \nSpecialties: Project management, facility layouts and design, capacity planning, process tool installation, cycle time analysis, lean manufacturing, and structured problem solving. Organized and responsible with strong communication skills. Demonstrated history of leading project teams and using structured problem solving to identify and resolve issues. Proven ability to implement lean techniques to eliminate waste and streamline processes.  \n \nSpecialties: Project management, facility layouts and design, capacity planning, process tool installation, cycle time analysis, lean manufacturing, and structured problem solving. Experience Industrial Engineering Group Leader Intel Corporation April 2015  – Present (5 months) Layout team group leader supporting domestic and international manufacturing sites.  Senior Industrial Engineer Intel Corporation April 2007  –  April 2015  (8 years 1 month) Team lead for layout, systems, and jig and fixture teams. Worked with technology development on planning and design of new process tools and facilities. Developed and implemented business process improvements for capital system group.  Industrial Engineer Intel Corporation April 2003  –  April 2007  (4 years 1 month) Developed layouts for 200mm to 300mm clean room facility conversion. Oversaw CAD designer resourcing and layout publication schedules for layout team. Provided architectural design and construction support.  Industrial Engineer Intel Corporation August 1999  –  April 2003  (3 years 9 months) Capacity and layout IE for 200mm fab. Validated tool capacity metrics by conducting run rate, availability, and utilization studies. Developed tool installation schedules and layout plans to meet long term road maps. Manufacturing Engineer VXI Electronics April 1998  –  August 1999  (1 year 5 months) Manufacturing engineer for power supply assembly line. Developed and standardized production flows. Designed workstations, fixtures, and implemented improvements on manufacturing lines. Industrial Engineer Intern Planar Systems April 1997  –  September 1997  (6 months) Identified issues and implemented process flow improvements. Conducted time studies. Implemented project to improve product flow by rearranging clean room tool layout.  Industrial Engineering Group Leader Intel Corporation April 2015  – Present (5 months) Layout team group leader supporting domestic and international manufacturing sites.  Industrial Engineering Group Leader Intel Corporation April 2015  – Present (5 months) Layout team group leader supporting domestic and international manufacturing sites.  Senior Industrial Engineer Intel Corporation April 2007  –  April 2015  (8 years 1 month) Team lead for layout, systems, and jig and fixture teams. Worked with technology development on planning and design of new process tools and facilities. Developed and implemented business process improvements for capital system group.  Senior Industrial Engineer Intel Corporation April 2007  –  April 2015  (8 years 1 month) Team lead for layout, systems, and jig and fixture teams. Worked with technology development on planning and design of new process tools and facilities. Developed and implemented business process improvements for capital system group.  Industrial Engineer Intel Corporation April 2003  –  April 2007  (4 years 1 month) Developed layouts for 200mm to 300mm clean room facility conversion. Oversaw CAD designer resourcing and layout publication schedules for layout team. Provided architectural design and construction support.  Industrial Engineer Intel Corporation April 2003  –  April 2007  (4 years 1 month) Developed layouts for 200mm to 300mm clean room facility conversion. Oversaw CAD designer resourcing and layout publication schedules for layout team. Provided architectural design and construction support.  Industrial Engineer Intel Corporation August 1999  –  April 2003  (3 years 9 months) Capacity and layout IE for 200mm fab. Validated tool capacity metrics by conducting run rate, availability, and utilization studies. Developed tool installation schedules and layout plans to meet long term road maps. Industrial Engineer Intel Corporation August 1999  –  April 2003  (3 years 9 months) Capacity and layout IE for 200mm fab. Validated tool capacity metrics by conducting run rate, availability, and utilization studies. Developed tool installation schedules and layout plans to meet long term road maps. Manufacturing Engineer VXI Electronics April 1998  –  August 1999  (1 year 5 months) Manufacturing engineer for power supply assembly line. Developed and standardized production flows. Designed workstations, fixtures, and implemented improvements on manufacturing lines. Manufacturing Engineer VXI Electronics April 1998  –  August 1999  (1 year 5 months) Manufacturing engineer for power supply assembly line. Developed and standardized production flows. Designed workstations, fixtures, and implemented improvements on manufacturing lines. Industrial Engineer Intern Planar Systems April 1997  –  September 1997  (6 months) Identified issues and implemented process flow improvements. Conducted time studies. Implemented project to improve product flow by rearranging clean room tool layout.  Industrial Engineer Intern Planar Systems April 1997  –  September 1997  (6 months) Identified issues and implemented process flow improvements. Conducted time studies. Implemented project to improve product flow by rearranging clean room tool layout.  Skills Manufacturing Manufacturing... SPC Design of Experiments Semiconductors Lean Manufacturing Engineering Management Project Management AutoCAD Plant Layout Business Workflows Capacity Planning Architectural Design Project Planning Team Leadership Continuous Improvement Six Sigma Program Management Facility Layout Fixture Design See 5+     See less Skills  Manufacturing Manufacturing... SPC Design of Experiments Semiconductors Lean Manufacturing Engineering Management Project Management AutoCAD Plant Layout Business Workflows Capacity Planning Architectural Design Project Planning Team Leadership Continuous Improvement Six Sigma Program Management Facility Layout Fixture Design See 5+     See less Manufacturing Manufacturing... SPC Design of Experiments Semiconductors Lean Manufacturing Engineering Management Project Management AutoCAD Plant Layout Business Workflows Capacity Planning Architectural Design Project Planning Team Leadership Continuous Improvement Six Sigma Program Management Facility Layout Fixture Design See 5+     See less Manufacturing Manufacturing... SPC Design of Experiments Semiconductors Lean Manufacturing Engineering Management Project Management AutoCAD Plant Layout Business Workflows Capacity Planning Architectural Design Project Planning Team Leadership Continuous Improvement Six Sigma Program Management Facility Layout Fixture Design See 5+     See less Education Oregon State University Bachelor of Science (B.S.),  Industrial and Manufacturing Engineering , 3.57 GPA 1994  – 1999 Oregon State University Bachelor of Science (B.S.),  Industrial and Manufacturing Engineering , 3.57 GPA 1994  – 1999 Oregon State University Bachelor of Science (B.S.),  Industrial and Manufacturing Engineering , 3.57 GPA 1994  – 1999 Oregon State University Bachelor of Science (B.S.),  Industrial and Manufacturing Engineering , 3.57 GPA 1994  – 1999 ", "Summary Industrial Engineering professional, proactive and innovative, results oriented with more than 16 years of experience on the supply chain field at a multinational corporation, dedicated to the development and manufacture of high technology products. Proven experience as project and supplier manager, equipment, facilities and infrastructure maintenance programs development and also a solution provider and consultant for complex technical problems. \n \nTop strengths: Structured, Organized, Responsible, Meticulous and Collaborative. \n \nTop 5 core competencies: Technical consultant, Management, Program Development, Equipment - Experiment Design and Networking. Summary Industrial Engineering professional, proactive and innovative, results oriented with more than 16 years of experience on the supply chain field at a multinational corporation, dedicated to the development and manufacture of high technology products. Proven experience as project and supplier manager, equipment, facilities and infrastructure maintenance programs development and also a solution provider and consultant for complex technical problems. \n \nTop strengths: Structured, Organized, Responsible, Meticulous and Collaborative. \n \nTop 5 core competencies: Technical consultant, Management, Program Development, Equipment - Experiment Design and Networking. Industrial Engineering professional, proactive and innovative, results oriented with more than 16 years of experience on the supply chain field at a multinational corporation, dedicated to the development and manufacture of high technology products. Proven experience as project and supplier manager, equipment, facilities and infrastructure maintenance programs development and also a solution provider and consultant for complex technical problems. \n \nTop strengths: Structured, Organized, Responsible, Meticulous and Collaborative. \n \nTop 5 core competencies: Technical consultant, Management, Program Development, Equipment - Experiment Design and Networking. Industrial Engineering professional, proactive and innovative, results oriented with more than 16 years of experience on the supply chain field at a multinational corporation, dedicated to the development and manufacture of high technology products. Proven experience as project and supplier manager, equipment, facilities and infrastructure maintenance programs development and also a solution provider and consultant for complex technical problems. \n \nTop strengths: Structured, Organized, Responsible, Meticulous and Collaborative. \n \nTop 5 core competencies: Technical consultant, Management, Program Development, Equipment - Experiment Design and Networking. Experience CR Logistics Senior Industrial Engineer Intel Corporation April 2008  – Present (7 years 5 months) Componentes Intel de Costa Rica Responsible to programing, budgeting, manage and execution of all the Industrial Engineering Group activities related to: Supplier Management, Preventive and Corrective Maintenance Programs, Infrastructure and Equipment Projects Implementations to support Costa Rica Assembly and Test Manufacturing NPIs (new product introductions) based on PMP/ PMI standards.  \nBe the Global Coordinator of the CPLG Equipment and Facilities Industrial Engineering Group.  \nAct as the America's Region Capital Coordinator to support CPLG OPS Capital Bi-Yearly Cycles. CR Logistics Junior Industrial Engineer Intel Corporation April 2005  –  April 2008  (3 years 1 month) Componentes Intel de Costa Rica In charge to facilitate all equipment and facilities related activities to support CR Integrated Warehouse daily operations, including but not limited to Industrial Engineering Group yearly activities programing, funds allocation and spending control, Equipment Facilities and Process Improvement, Project and Supplier Management. \nLinkage between CR Logistics Operations and CR ATM and other support organizations (Corporate Services, Finance, Site Security, IT, Shared Services, etc.) .  \nRepresent Costa Rica at the Engineering JET (join engineering team) CR Logistics Industrial Engineering Technician Intel Corporation April 2004  –  April 2005  (1 year 1 month) Componentes Intel de Costa Rica Coordinate design and implement re-layout changes facing new product introductions within CR Distribution Center. \nSearch and provide solutions to the upcoming issues that can be present within the CR Warehouse operations. \nIn charge of negotiations with suppliers, quotation revisions and purchase order’s management. \nResponsible of the Preventive Maintenance Program for the CR Distribution Center. Safety Coordinator – Industrial Engineering Support Intel Corporation April 2002  –  April 2004  (2 years 1 month) Componentes Intel de Costa Rica Coordinate and facilitate all Corporate Safety Programs assigned to the Costa Rica Logistics Organization. \nProvide coaching to CR Logistics employees and contractors regarding Intel’s virtual factory safety guidelines and procedures. \nIn charge of the Powered Industrial Truck’s Certification Program at Costa Rica site.  \nProvide support to the Industrial Engineering Group on project implementations. \nRepresent CR DNS Safety department within the Virtual Factory forums. Logistics IT Super User Trainer Intel Corporation April 2000  –  March 2001  (1 year) Componentes Intel de Costa Rica Develop the CR Logistics Material Specialist Certification Procedures. \nDeliver training packages for the CR Distribution Center population including SAP, ISET, Tahoe, BLS, and Workstream systems. \nCreate standard operational procedures to the Costa Rica Distribution Center operations  \nRepresentative of CR Logistics at World Wide SAP Communications Group, CR Logistics BLS Implementation Team. CR Logistics Training Content Expert Intel Corporation April 1999  –  April 2000  (1 year 1 month) Costa Rica - Establish Costa Rica Logistics population training requirements by functional area and specific job function according to corporate and local guidelines. \n- Track the completion of the training requirements within the pre-established time frame (140 heads including contractors). \n- Develop training materials to support CR Logistics organization training needs. CR Logistics Senior Industrial Engineer Intel Corporation April 2008  – Present (7 years 5 months) Componentes Intel de Costa Rica Responsible to programing, budgeting, manage and execution of all the Industrial Engineering Group activities related to: Supplier Management, Preventive and Corrective Maintenance Programs, Infrastructure and Equipment Projects Implementations to support Costa Rica Assembly and Test Manufacturing NPIs (new product introductions) based on PMP/ PMI standards.  \nBe the Global Coordinator of the CPLG Equipment and Facilities Industrial Engineering Group.  \nAct as the America's Region Capital Coordinator to support CPLG OPS Capital Bi-Yearly Cycles. CR Logistics Senior Industrial Engineer Intel Corporation April 2008  – Present (7 years 5 months) Componentes Intel de Costa Rica Responsible to programing, budgeting, manage and execution of all the Industrial Engineering Group activities related to: Supplier Management, Preventive and Corrective Maintenance Programs, Infrastructure and Equipment Projects Implementations to support Costa Rica Assembly and Test Manufacturing NPIs (new product introductions) based on PMP/ PMI standards.  \nBe the Global Coordinator of the CPLG Equipment and Facilities Industrial Engineering Group.  \nAct as the America's Region Capital Coordinator to support CPLG OPS Capital Bi-Yearly Cycles. CR Logistics Junior Industrial Engineer Intel Corporation April 2005  –  April 2008  (3 years 1 month) Componentes Intel de Costa Rica In charge to facilitate all equipment and facilities related activities to support CR Integrated Warehouse daily operations, including but not limited to Industrial Engineering Group yearly activities programing, funds allocation and spending control, Equipment Facilities and Process Improvement, Project and Supplier Management. \nLinkage between CR Logistics Operations and CR ATM and other support organizations (Corporate Services, Finance, Site Security, IT, Shared Services, etc.) .  \nRepresent Costa Rica at the Engineering JET (join engineering team) CR Logistics Junior Industrial Engineer Intel Corporation April 2005  –  April 2008  (3 years 1 month) Componentes Intel de Costa Rica In charge to facilitate all equipment and facilities related activities to support CR Integrated Warehouse daily operations, including but not limited to Industrial Engineering Group yearly activities programing, funds allocation and spending control, Equipment Facilities and Process Improvement, Project and Supplier Management. \nLinkage between CR Logistics Operations and CR ATM and other support organizations (Corporate Services, Finance, Site Security, IT, Shared Services, etc.) .  \nRepresent Costa Rica at the Engineering JET (join engineering team) CR Logistics Industrial Engineering Technician Intel Corporation April 2004  –  April 2005  (1 year 1 month) Componentes Intel de Costa Rica Coordinate design and implement re-layout changes facing new product introductions within CR Distribution Center. \nSearch and provide solutions to the upcoming issues that can be present within the CR Warehouse operations. \nIn charge of negotiations with suppliers, quotation revisions and purchase order’s management. \nResponsible of the Preventive Maintenance Program for the CR Distribution Center. CR Logistics Industrial Engineering Technician Intel Corporation April 2004  –  April 2005  (1 year 1 month) Componentes Intel de Costa Rica Coordinate design and implement re-layout changes facing new product introductions within CR Distribution Center. \nSearch and provide solutions to the upcoming issues that can be present within the CR Warehouse operations. \nIn charge of negotiations with suppliers, quotation revisions and purchase order’s management. \nResponsible of the Preventive Maintenance Program for the CR Distribution Center. Safety Coordinator – Industrial Engineering Support Intel Corporation April 2002  –  April 2004  (2 years 1 month) Componentes Intel de Costa Rica Coordinate and facilitate all Corporate Safety Programs assigned to the Costa Rica Logistics Organization. \nProvide coaching to CR Logistics employees and contractors regarding Intel’s virtual factory safety guidelines and procedures. \nIn charge of the Powered Industrial Truck’s Certification Program at Costa Rica site.  \nProvide support to the Industrial Engineering Group on project implementations. \nRepresent CR DNS Safety department within the Virtual Factory forums. Safety Coordinator – Industrial Engineering Support Intel Corporation April 2002  –  April 2004  (2 years 1 month) Componentes Intel de Costa Rica Coordinate and facilitate all Corporate Safety Programs assigned to the Costa Rica Logistics Organization. \nProvide coaching to CR Logistics employees and contractors regarding Intel’s virtual factory safety guidelines and procedures. \nIn charge of the Powered Industrial Truck’s Certification Program at Costa Rica site.  \nProvide support to the Industrial Engineering Group on project implementations. \nRepresent CR DNS Safety department within the Virtual Factory forums. Logistics IT Super User Trainer Intel Corporation April 2000  –  March 2001  (1 year) Componentes Intel de Costa Rica Develop the CR Logistics Material Specialist Certification Procedures. \nDeliver training packages for the CR Distribution Center population including SAP, ISET, Tahoe, BLS, and Workstream systems. \nCreate standard operational procedures to the Costa Rica Distribution Center operations  \nRepresentative of CR Logistics at World Wide SAP Communications Group, CR Logistics BLS Implementation Team. Logistics IT Super User Trainer Intel Corporation April 2000  –  March 2001  (1 year) Componentes Intel de Costa Rica Develop the CR Logistics Material Specialist Certification Procedures. \nDeliver training packages for the CR Distribution Center population including SAP, ISET, Tahoe, BLS, and Workstream systems. \nCreate standard operational procedures to the Costa Rica Distribution Center operations  \nRepresentative of CR Logistics at World Wide SAP Communications Group, CR Logistics BLS Implementation Team. CR Logistics Training Content Expert Intel Corporation April 1999  –  April 2000  (1 year 1 month) Costa Rica - Establish Costa Rica Logistics population training requirements by functional area and specific job function according to corporate and local guidelines. \n- Track the completion of the training requirements within the pre-established time frame (140 heads including contractors). \n- Develop training materials to support CR Logistics organization training needs. CR Logistics Training Content Expert Intel Corporation April 1999  –  April 2000  (1 year 1 month) Costa Rica - Establish Costa Rica Logistics population training requirements by functional area and specific job function according to corporate and local guidelines. \n- Track the completion of the training requirements within the pre-established time frame (140 heads including contractors). \n- Develop training materials to support CR Logistics organization training needs. Languages English Native or bilingual proficiency English Native or bilingual proficiency English Native or bilingual proficiency Native or bilingual proficiency Skills Intel Project Planning Capital Equipment IC Process Improvement Strategic Planning Supply Chain Operations Management Cross-functional Team... Semiconductors Manufacturing Team Leadership Continuous Improvement Semiconductor Industry Lean Manufacturing Design of Experiments Supply Chain... Electronics Supply Chain Management Six Sigma Program Management Metrology Failure Analysis CMOS SPC See 10+     See less Skills  Intel Project Planning Capital Equipment IC Process Improvement Strategic Planning Supply Chain Operations Management Cross-functional Team... Semiconductors Manufacturing Team Leadership Continuous Improvement Semiconductor Industry Lean Manufacturing Design of Experiments Supply Chain... Electronics Supply Chain Management Six Sigma Program Management Metrology Failure Analysis CMOS SPC See 10+     See less Intel Project Planning Capital Equipment IC Process Improvement Strategic Planning Supply Chain Operations Management Cross-functional Team... Semiconductors Manufacturing Team Leadership Continuous Improvement Semiconductor Industry Lean Manufacturing Design of Experiments Supply Chain... Electronics Supply Chain Management Six Sigma Program Management Metrology Failure Analysis CMOS SPC See 10+     See less Intel Project Planning Capital Equipment IC Process Improvement Strategic Planning Supply Chain Operations Management Cross-functional Team... Semiconductors Manufacturing Team Leadership Continuous Improvement Semiconductor Industry Lean Manufacturing Design of Experiments Supply Chain... Electronics Supply Chain Management Six Sigma Program Management Metrology Failure Analysis CMOS SPC See 10+     See less Education Universidad Hispanoamericana (CR) Credits towards Industrial Engineer Bachelor Degree (pending courses 10).,  Induatrial Engineering 2008  – 2016 Universidad Interamericana de Costa Rica Credits towards Industrial Engineer Bachelor Degree (moved to Universidad Hispanoamericana).,  Industrial Engineering 2005  – 2009 ICS Canadian Institute Mechanical Design Diploma,  Mechanical Drafting and Mechanical Drafting CAD/CADD 1991  – 1992 Sheridan College Auto CAD Diploma for Architectural Design,  Architectural Drafting and Architectural CAD/CADD 1991  – 1992 Universidad Hispanoamericana (CR) Industrial Engineering Universidad Hispanoamericana (CR) Credits towards Industrial Engineer Bachelor Degree (pending courses 10).,  Induatrial Engineering 2008  – 2016 Universidad Hispanoamericana (CR) Credits towards Industrial Engineer Bachelor Degree (pending courses 10).,  Induatrial Engineering 2008  – 2016 Universidad Hispanoamericana (CR) Credits towards Industrial Engineer Bachelor Degree (pending courses 10).,  Induatrial Engineering 2008  – 2016 Universidad Interamericana de Costa Rica Credits towards Industrial Engineer Bachelor Degree (moved to Universidad Hispanoamericana).,  Industrial Engineering 2005  – 2009 Universidad Interamericana de Costa Rica Credits towards Industrial Engineer Bachelor Degree (moved to Universidad Hispanoamericana).,  Industrial Engineering 2005  – 2009 Universidad Interamericana de Costa Rica Credits towards Industrial Engineer Bachelor Degree (moved to Universidad Hispanoamericana).,  Industrial Engineering 2005  – 2009 ICS Canadian Institute Mechanical Design Diploma,  Mechanical Drafting and Mechanical Drafting CAD/CADD 1991  – 1992 ICS Canadian Institute Mechanical Design Diploma,  Mechanical Drafting and Mechanical Drafting CAD/CADD 1991  – 1992 ICS Canadian Institute Mechanical Design Diploma,  Mechanical Drafting and Mechanical Drafting CAD/CADD 1991  – 1992 Sheridan College Auto CAD Diploma for Architectural Design,  Architectural Drafting and Architectural CAD/CADD 1991  – 1992 Sheridan College Auto CAD Diploma for Architectural Design,  Architectural Drafting and Architectural CAD/CADD 1991  – 1992 Sheridan College Auto CAD Diploma for Architectural Design,  Architectural Drafting and Architectural CAD/CADD 1991  – 1992 Universidad Hispanoamericana (CR) Industrial Engineering Universidad Hispanoamericana (CR) Industrial Engineering Universidad Hispanoamericana (CR) Industrial Engineering Honors & Awards Costa Rica Assembly and Test Capital Transition Phase 1 - Team Award Jorge Sanchez Alvarado - AT Logistics Integration Lead In appreciation to enable Intel to prepare, pack and send over 62 critical tools (more than 80 tons) in record time to Asia ATM factories. Your innovation, risk taking , \"Can Do\" attitude and overall commitment to excellence, reflect the best of Intel Culture. Costa Rica Logistics Special Recognition Jorge Sanchez Alvarado April 2012 For the successful closure of the Costa Rica Warehouse Racking Seismic Reinforcement Project. Project was completed with no safety incidents, zero customer impact, under budget and within the pre-established timeline. The project was also executed with very high quality standards providing and additional storage capacity to the RAW Materials Group.  Costa Rica Logistics Special Recognition Jorge Sanchez Alvarado August 2012 In recognition for your discipline and diligence in managing Logistics budget during Q1/Q2. You managed to run the Industrial Engineering Group services under strict expenditure procedures and controls. On top of that you were able to produce cost savings/ avoidances up to $56K during the same period. Customer Planning Logistics Group Bronze Award - Risk Taking Role Model Jorge Sanchez and Mauro Segura September 2013 Eduardo clearly reflects this value, in the way he manages his responsibilities and executes the projects assigned to him. He manages his suppliers to meet Intel's high standard of Code of Conduct, ensuring all policies are followed accordingly, not hiding issues but actually making them visible in order for them to be fix. He made accountable his peers and other areas in the organization to follow the rules and plans accordingly to support their needs, from projects, funding and timelines. Intel Safety Role Model Award - Planning and Logistics Group Maria Alexandra Feoli Pacheco January 2006 For continuously showing Intel safety values and leadership. Americas Logistics Organization Team Award Bill Croutch and Arnoldo Madrigal October 1999 For your outstanding dedication, support and execution creating the series of learning guides for all Powered Industrial Trucks (forklifts).  CR EHS Management Review Commitee Recognition Mauricio Guerrero and Kathryn Dornfeld February 2003 For your outstanding contribution and safety results orientation developing an emergency program for to the Ulloa Technical School at Barreal - Heredia. Your initiative and effort demonstrated a high commitment with yourself, Intel employees and the people of the community. CR Distribution Network Services Safety Special Award Maria Alexandra Feoli - Adolfo Quesada Beer October 2004 For your great safety support demonstrated over the years and your risk taking spirit that allowed you to take over all safety duties during several months, while the safety manager positions was in transition. ISNG Outstanding Team Award Brian Banser and Pat Narvaez - ISNG-NSD Safety/ Ergo Task Force Team January 2006 Team pulled together experts from multiple sites to quickly solve Safety/Ergo issues that surfaced after the NSD implementation. NSD implemented on work week 30 at 6 sites world-wide: Shanghai, Malaysia, Cavite, Amsterdam, Costa Rica and Arizona. \nThank you for demonstrating discipline, results orientation and risk taking Intel values. Intel Costa Rica Special Recognition Site Manager and Corporate Affairs Manager December 2007 This team showed that with a lot of passion, proper planning and a clear vision even the wildest dream can become a reality. We planted 10,000 trees in celebration of the 10th anniversary of Intel Costa Rica. Intel Site Award Pat Raburn - Intel Costa Rica Site Manager February 2001 For the outstanding support received from you in preparation for the Corporate Quality Assurance audit which allowed the factory to successfully achieve the Maturity Level I. \nYour sense of innovation, outstanding effort and leadership has generated a great impact trough the Intel Costa Rica organization. \nYour ideas, team participation and involvement have helped Intel Costa Rica to improve its processes and added value. Costa Rica Assembly and Test Capital Transition Phase 1 - Team Award Jorge Sanchez Alvarado - AT Logistics Integration Lead In appreciation to enable Intel to prepare, pack and send over 62 critical tools (more than 80 tons) in record time to Asia ATM factories. Your innovation, risk taking , \"Can Do\" attitude and overall commitment to excellence, reflect the best of Intel Culture. Costa Rica Assembly and Test Capital Transition Phase 1 - Team Award Jorge Sanchez Alvarado - AT Logistics Integration Lead In appreciation to enable Intel to prepare, pack and send over 62 critical tools (more than 80 tons) in record time to Asia ATM factories. Your innovation, risk taking , \"Can Do\" attitude and overall commitment to excellence, reflect the best of Intel Culture. Costa Rica Assembly and Test Capital Transition Phase 1 - Team Award Jorge Sanchez Alvarado - AT Logistics Integration Lead In appreciation to enable Intel to prepare, pack and send over 62 critical tools (more than 80 tons) in record time to Asia ATM factories. Your innovation, risk taking , \"Can Do\" attitude and overall commitment to excellence, reflect the best of Intel Culture. Costa Rica Logistics Special Recognition Jorge Sanchez Alvarado April 2012 For the successful closure of the Costa Rica Warehouse Racking Seismic Reinforcement Project. Project was completed with no safety incidents, zero customer impact, under budget and within the pre-established timeline. The project was also executed with very high quality standards providing and additional storage capacity to the RAW Materials Group.  Costa Rica Logistics Special Recognition Jorge Sanchez Alvarado April 2012 For the successful closure of the Costa Rica Warehouse Racking Seismic Reinforcement Project. Project was completed with no safety incidents, zero customer impact, under budget and within the pre-established timeline. The project was also executed with very high quality standards providing and additional storage capacity to the RAW Materials Group.  Costa Rica Logistics Special Recognition Jorge Sanchez Alvarado April 2012 For the successful closure of the Costa Rica Warehouse Racking Seismic Reinforcement Project. Project was completed with no safety incidents, zero customer impact, under budget and within the pre-established timeline. The project was also executed with very high quality standards providing and additional storage capacity to the RAW Materials Group.  Costa Rica Logistics Special Recognition Jorge Sanchez Alvarado August 2012 In recognition for your discipline and diligence in managing Logistics budget during Q1/Q2. You managed to run the Industrial Engineering Group services under strict expenditure procedures and controls. On top of that you were able to produce cost savings/ avoidances up to $56K during the same period. Costa Rica Logistics Special Recognition Jorge Sanchez Alvarado August 2012 In recognition for your discipline and diligence in managing Logistics budget during Q1/Q2. You managed to run the Industrial Engineering Group services under strict expenditure procedures and controls. On top of that you were able to produce cost savings/ avoidances up to $56K during the same period. Costa Rica Logistics Special Recognition Jorge Sanchez Alvarado August 2012 In recognition for your discipline and diligence in managing Logistics budget during Q1/Q2. You managed to run the Industrial Engineering Group services under strict expenditure procedures and controls. On top of that you were able to produce cost savings/ avoidances up to $56K during the same period. Customer Planning Logistics Group Bronze Award - Risk Taking Role Model Jorge Sanchez and Mauro Segura September 2013 Eduardo clearly reflects this value, in the way he manages his responsibilities and executes the projects assigned to him. He manages his suppliers to meet Intel's high standard of Code of Conduct, ensuring all policies are followed accordingly, not hiding issues but actually making them visible in order for them to be fix. He made accountable his peers and other areas in the organization to follow the rules and plans accordingly to support their needs, from projects, funding and timelines. Customer Planning Logistics Group Bronze Award - Risk Taking Role Model Jorge Sanchez and Mauro Segura September 2013 Eduardo clearly reflects this value, in the way he manages his responsibilities and executes the projects assigned to him. He manages his suppliers to meet Intel's high standard of Code of Conduct, ensuring all policies are followed accordingly, not hiding issues but actually making them visible in order for them to be fix. He made accountable his peers and other areas in the organization to follow the rules and plans accordingly to support their needs, from projects, funding and timelines. Customer Planning Logistics Group Bronze Award - Risk Taking Role Model Jorge Sanchez and Mauro Segura September 2013 Eduardo clearly reflects this value, in the way he manages his responsibilities and executes the projects assigned to him. He manages his suppliers to meet Intel's high standard of Code of Conduct, ensuring all policies are followed accordingly, not hiding issues but actually making them visible in order for them to be fix. He made accountable his peers and other areas in the organization to follow the rules and plans accordingly to support their needs, from projects, funding and timelines. Intel Safety Role Model Award - Planning and Logistics Group Maria Alexandra Feoli Pacheco January 2006 For continuously showing Intel safety values and leadership. Intel Safety Role Model Award - Planning and Logistics Group Maria Alexandra Feoli Pacheco January 2006 For continuously showing Intel safety values and leadership. Intel Safety Role Model Award - Planning and Logistics Group Maria Alexandra Feoli Pacheco January 2006 For continuously showing Intel safety values and leadership. Americas Logistics Organization Team Award Bill Croutch and Arnoldo Madrigal October 1999 For your outstanding dedication, support and execution creating the series of learning guides for all Powered Industrial Trucks (forklifts).  Americas Logistics Organization Team Award Bill Croutch and Arnoldo Madrigal October 1999 For your outstanding dedication, support and execution creating the series of learning guides for all Powered Industrial Trucks (forklifts).  Americas Logistics Organization Team Award Bill Croutch and Arnoldo Madrigal October 1999 For your outstanding dedication, support and execution creating the series of learning guides for all Powered Industrial Trucks (forklifts).  CR EHS Management Review Commitee Recognition Mauricio Guerrero and Kathryn Dornfeld February 2003 For your outstanding contribution and safety results orientation developing an emergency program for to the Ulloa Technical School at Barreal - Heredia. Your initiative and effort demonstrated a high commitment with yourself, Intel employees and the people of the community. CR EHS Management Review Commitee Recognition Mauricio Guerrero and Kathryn Dornfeld February 2003 For your outstanding contribution and safety results orientation developing an emergency program for to the Ulloa Technical School at Barreal - Heredia. Your initiative and effort demonstrated a high commitment with yourself, Intel employees and the people of the community. CR EHS Management Review Commitee Recognition Mauricio Guerrero and Kathryn Dornfeld February 2003 For your outstanding contribution and safety results orientation developing an emergency program for to the Ulloa Technical School at Barreal - Heredia. Your initiative and effort demonstrated a high commitment with yourself, Intel employees and the people of the community. CR Distribution Network Services Safety Special Award Maria Alexandra Feoli - Adolfo Quesada Beer October 2004 For your great safety support demonstrated over the years and your risk taking spirit that allowed you to take over all safety duties during several months, while the safety manager positions was in transition. CR Distribution Network Services Safety Special Award Maria Alexandra Feoli - Adolfo Quesada Beer October 2004 For your great safety support demonstrated over the years and your risk taking spirit that allowed you to take over all safety duties during several months, while the safety manager positions was in transition. CR Distribution Network Services Safety Special Award Maria Alexandra Feoli - Adolfo Quesada Beer October 2004 For your great safety support demonstrated over the years and your risk taking spirit that allowed you to take over all safety duties during several months, while the safety manager positions was in transition. ISNG Outstanding Team Award Brian Banser and Pat Narvaez - ISNG-NSD Safety/ Ergo Task Force Team January 2006 Team pulled together experts from multiple sites to quickly solve Safety/Ergo issues that surfaced after the NSD implementation. NSD implemented on work week 30 at 6 sites world-wide: Shanghai, Malaysia, Cavite, Amsterdam, Costa Rica and Arizona. \nThank you for demonstrating discipline, results orientation and risk taking Intel values. ISNG Outstanding Team Award Brian Banser and Pat Narvaez - ISNG-NSD Safety/ Ergo Task Force Team January 2006 Team pulled together experts from multiple sites to quickly solve Safety/Ergo issues that surfaced after the NSD implementation. NSD implemented on work week 30 at 6 sites world-wide: Shanghai, Malaysia, Cavite, Amsterdam, Costa Rica and Arizona. \nThank you for demonstrating discipline, results orientation and risk taking Intel values. ISNG Outstanding Team Award Brian Banser and Pat Narvaez - ISNG-NSD Safety/ Ergo Task Force Team January 2006 Team pulled together experts from multiple sites to quickly solve Safety/Ergo issues that surfaced after the NSD implementation. NSD implemented on work week 30 at 6 sites world-wide: Shanghai, Malaysia, Cavite, Amsterdam, Costa Rica and Arizona. \nThank you for demonstrating discipline, results orientation and risk taking Intel values. Intel Costa Rica Special Recognition Site Manager and Corporate Affairs Manager December 2007 This team showed that with a lot of passion, proper planning and a clear vision even the wildest dream can become a reality. We planted 10,000 trees in celebration of the 10th anniversary of Intel Costa Rica. Intel Costa Rica Special Recognition Site Manager and Corporate Affairs Manager December 2007 This team showed that with a lot of passion, proper planning and a clear vision even the wildest dream can become a reality. We planted 10,000 trees in celebration of the 10th anniversary of Intel Costa Rica. Intel Costa Rica Special Recognition Site Manager and Corporate Affairs Manager December 2007 This team showed that with a lot of passion, proper planning and a clear vision even the wildest dream can become a reality. We planted 10,000 trees in celebration of the 10th anniversary of Intel Costa Rica. Intel Site Award Pat Raburn - Intel Costa Rica Site Manager February 2001 For the outstanding support received from you in preparation for the Corporate Quality Assurance audit which allowed the factory to successfully achieve the Maturity Level I. \nYour sense of innovation, outstanding effort and leadership has generated a great impact trough the Intel Costa Rica organization. \nYour ideas, team participation and involvement have helped Intel Costa Rica to improve its processes and added value. Intel Site Award Pat Raburn - Intel Costa Rica Site Manager February 2001 For the outstanding support received from you in preparation for the Corporate Quality Assurance audit which allowed the factory to successfully achieve the Maturity Level I. \nYour sense of innovation, outstanding effort and leadership has generated a great impact trough the Intel Costa Rica organization. \nYour ideas, team participation and involvement have helped Intel Costa Rica to improve its processes and added value. Intel Site Award Pat Raburn - Intel Costa Rica Site Manager February 2001 For the outstanding support received from you in preparation for the Corporate Quality Assurance audit which allowed the factory to successfully achieve the Maturity Level I. \nYour sense of innovation, outstanding effort and leadership has generated a great impact trough the Intel Costa Rica organization. \nYour ideas, team participation and involvement have helped Intel Costa Rica to improve its processes and added value. ", "Experience Managing Director Fairtex October 2010  – Present (4 years 11 months) Corporate Headquarters, Bangplee, Thailand In charge of transforming this start-up and privately-held Thai company into a global brand with a team of 4 unit directors, 250 plus staff and distribution networks with operations in the US and Thailand.  \n \n• Succeeded in expanding a distribution network from 2 country into over 60 countries on 6 continents. \n \n• Delivered average revenue growth of 48% YOY and profits at a steady average of 37% return-on-sales. \n \n• Guided licensing, trademark and patent acquisition; awarded 7 patents in Europe, Thailand and USA. \n \n• Increas P&L performance through joint-venture programs designed to grow and expand product and service offerings in greater China & Southeast Asia markets. \n \n• Effectively managed the monthly integrated business planning meeting between the departments to align company objectives, reconciling supply, demands and new product plans; net result in 20% forecast error reduction, 16% inventory reduction, 18% better order fulfillment & 18% shorter cash-to-cash cycle times. \n \n• Negotiated and executed complex contracts & supplier agreements; attained over 22% annual savings Director of Global Supply Chain Management Fairtex March 2005  –  October 2010  (5 years 8 months) Corporate Headquarters, Bangplee, Thailand Sales and Marketing Manager Fairtex August 2002  –  February 2005  (2 years 7 months) Corporate Headquarters, Bangplee, Thailand Manufacturing Operations Manager Fairtex October 1999  –  August 2002  (2 years 11 months) Corporate Headquarters, Bangplee, Thailand Supply Chain Logistics Manager Hewlett-Packard September 1998  –  October 1999  (1 year 2 months) Office Product Division, San Diego, CA Manufacturing Engineer Hewlett-Packard August 1997  –  September 1998  (1 year 2 months) All-in-One Printer Division, San Diego, CA Senior Industrial Engineer Intel Corporation June 1995  –  July 1997  (2 years 2 months) Corporate Logistics, Chandler, AZ Industrial Engineer Intel Corporation May 1994  –  June 1995  (1 year 2 months) Chandler, AZ Managing Director Fairtex October 2010  – Present (4 years 11 months) Corporate Headquarters, Bangplee, Thailand In charge of transforming this start-up and privately-held Thai company into a global brand with a team of 4 unit directors, 250 plus staff and distribution networks with operations in the US and Thailand.  \n \n• Succeeded in expanding a distribution network from 2 country into over 60 countries on 6 continents. \n \n• Delivered average revenue growth of 48% YOY and profits at a steady average of 37% return-on-sales. \n \n• Guided licensing, trademark and patent acquisition; awarded 7 patents in Europe, Thailand and USA. \n \n• Increas P&L performance through joint-venture programs designed to grow and expand product and service offerings in greater China & Southeast Asia markets. \n \n• Effectively managed the monthly integrated business planning meeting between the departments to align company objectives, reconciling supply, demands and new product plans; net result in 20% forecast error reduction, 16% inventory reduction, 18% better order fulfillment & 18% shorter cash-to-cash cycle times. \n \n• Negotiated and executed complex contracts & supplier agreements; attained over 22% annual savings Managing Director Fairtex October 2010  – Present (4 years 11 months) Corporate Headquarters, Bangplee, Thailand In charge of transforming this start-up and privately-held Thai company into a global brand with a team of 4 unit directors, 250 plus staff and distribution networks with operations in the US and Thailand.  \n \n• Succeeded in expanding a distribution network from 2 country into over 60 countries on 6 continents. \n \n• Delivered average revenue growth of 48% YOY and profits at a steady average of 37% return-on-sales. \n \n• Guided licensing, trademark and patent acquisition; awarded 7 patents in Europe, Thailand and USA. \n \n• Increas P&L performance through joint-venture programs designed to grow and expand product and service offerings in greater China & Southeast Asia markets. \n \n• Effectively managed the monthly integrated business planning meeting between the departments to align company objectives, reconciling supply, demands and new product plans; net result in 20% forecast error reduction, 16% inventory reduction, 18% better order fulfillment & 18% shorter cash-to-cash cycle times. \n \n• Negotiated and executed complex contracts & supplier agreements; attained over 22% annual savings Director of Global Supply Chain Management Fairtex March 2005  –  October 2010  (5 years 8 months) Corporate Headquarters, Bangplee, Thailand Director of Global Supply Chain Management Fairtex March 2005  –  October 2010  (5 years 8 months) Corporate Headquarters, Bangplee, Thailand Sales and Marketing Manager Fairtex August 2002  –  February 2005  (2 years 7 months) Corporate Headquarters, Bangplee, Thailand Sales and Marketing Manager Fairtex August 2002  –  February 2005  (2 years 7 months) Corporate Headquarters, Bangplee, Thailand Manufacturing Operations Manager Fairtex October 1999  –  August 2002  (2 years 11 months) Corporate Headquarters, Bangplee, Thailand Manufacturing Operations Manager Fairtex October 1999  –  August 2002  (2 years 11 months) Corporate Headquarters, Bangplee, Thailand Supply Chain Logistics Manager Hewlett-Packard September 1998  –  October 1999  (1 year 2 months) Office Product Division, San Diego, CA Supply Chain Logistics Manager Hewlett-Packard September 1998  –  October 1999  (1 year 2 months) Office Product Division, San Diego, CA Manufacturing Engineer Hewlett-Packard August 1997  –  September 1998  (1 year 2 months) All-in-One Printer Division, San Diego, CA Manufacturing Engineer Hewlett-Packard August 1997  –  September 1998  (1 year 2 months) All-in-One Printer Division, San Diego, CA Senior Industrial Engineer Intel Corporation June 1995  –  July 1997  (2 years 2 months) Corporate Logistics, Chandler, AZ Senior Industrial Engineer Intel Corporation June 1995  –  July 1997  (2 years 2 months) Corporate Logistics, Chandler, AZ Industrial Engineer Intel Corporation May 1994  –  June 1995  (1 year 2 months) Chandler, AZ Industrial Engineer Intel Corporation May 1994  –  June 1995  (1 year 2 months) Chandler, AZ Languages Thai Professional working proficiency Thai Professional working proficiency Thai Professional working proficiency Professional working proficiency Skills Product Development Management Leadership Entrepreneurship Start-ups Cross-functional Team... Supply Chain Management Corporate Branding Lean Manufacturing Brand Implementation Distribution Logistics Brand Development... Industrial Engineering Public Speaking Process Engineering Brand Architecture Start-up Ventures Corporate Vision &... Mechanical Engineering Profit Optimization Social Media Marketing International Business Multilingual Market Penetration... Global Distribution &... Sponsorship Video Production Television Social Networking Fitness Training Sports Sports Marketing Fitness Athletics Event Management Coaching Manufacturing Operations Turnaround Strategy Strategic Planning Quality Assurance International Marketing Supply Chain Distribution Strategies Engineering Sale & Operations... Integrated Business... Distribution Management New Business Development Marketing Sales See 35+     See less Skills  Product Development Management Leadership Entrepreneurship Start-ups Cross-functional Team... Supply Chain Management Corporate Branding Lean Manufacturing Brand Implementation Distribution Logistics Brand Development... Industrial Engineering Public Speaking Process Engineering Brand Architecture Start-up Ventures Corporate Vision &... Mechanical Engineering Profit Optimization Social Media Marketing International Business Multilingual Market Penetration... Global Distribution &... Sponsorship Video Production Television Social Networking Fitness Training Sports Sports Marketing Fitness Athletics Event Management Coaching Manufacturing Operations Turnaround Strategy Strategic Planning Quality Assurance International Marketing Supply Chain Distribution Strategies Engineering Sale & Operations... Integrated Business... Distribution Management New Business Development Marketing Sales See 35+     See less Product Development Management Leadership Entrepreneurship Start-ups Cross-functional Team... Supply Chain Management Corporate Branding Lean Manufacturing Brand Implementation Distribution Logistics Brand Development... Industrial Engineering Public Speaking Process Engineering Brand Architecture Start-up Ventures Corporate Vision &... Mechanical Engineering Profit Optimization Social Media Marketing International Business Multilingual Market Penetration... Global Distribution &... Sponsorship Video Production Television Social Networking Fitness Training Sports Sports Marketing Fitness Athletics Event Management Coaching Manufacturing Operations Turnaround Strategy Strategic Planning Quality Assurance International Marketing Supply Chain Distribution Strategies Engineering Sale & Operations... Integrated Business... Distribution Management New Business Development Marketing Sales See 35+     See less Product Development Management Leadership Entrepreneurship Start-ups Cross-functional Team... Supply Chain Management Corporate Branding Lean Manufacturing Brand Implementation Distribution Logistics Brand Development... Industrial Engineering Public Speaking Process Engineering Brand Architecture Start-up Ventures Corporate Vision &... Mechanical Engineering Profit Optimization Social Media Marketing International Business Multilingual Market Penetration... Global Distribution &... Sponsorship Video Production Television Social Networking Fitness Training Sports Sports Marketing Fitness Athletics Event Management Coaching Manufacturing Operations Turnaround Strategy Strategic Planning Quality Assurance International Marketing Supply Chain Distribution Strategies Engineering Sale & Operations... Integrated Business... Distribution Management New Business Development Marketing Sales See 35+     See less Education APICS Supply Chain Management Arizona State University, W. P. Carey School of Business First Year Master of Business Administration (MBA) Student William Mitchell College of Law First Year Law Student Nankai University Exchange Student,  Studied Mandarin Chinese , Chinese History & Culture,  and Technology Transfer University of Minnesota-Twin Cities Bachelor of Science (BS),  Mechanical Engineering and Industrial Engineering 1989  – 1994 APICS Supply Chain Management APICS Supply Chain Management APICS Supply Chain Management Arizona State University, W. P. Carey School of Business First Year Master of Business Administration (MBA) Student Arizona State University, W. P. Carey School of Business First Year Master of Business Administration (MBA) Student Arizona State University, W. P. Carey School of Business First Year Master of Business Administration (MBA) Student William Mitchell College of Law First Year Law Student William Mitchell College of Law First Year Law Student William Mitchell College of Law First Year Law Student Nankai University Exchange Student,  Studied Mandarin Chinese , Chinese History & Culture,  and Technology Transfer Nankai University Exchange Student,  Studied Mandarin Chinese , Chinese History & Culture,  and Technology Transfer Nankai University Exchange Student,  Studied Mandarin Chinese , Chinese History & Culture,  and Technology Transfer University of Minnesota-Twin Cities Bachelor of Science (BS),  Mechanical Engineering and Industrial Engineering 1989  – 1994 University of Minnesota-Twin Cities Bachelor of Science (BS),  Mechanical Engineering and Industrial Engineering 1989  – 1994 University of Minnesota-Twin Cities Bachelor of Science (BS),  Mechanical Engineering and Industrial Engineering 1989  – 1994 ", "Skills SPC Design of Experiments Semiconductors Lean Manufacturing Six Sigma Industrial Engineering JMP Manufacturing... Engineering Management Engineering Manufacturing Continuous Improvement Skills  SPC Design of Experiments Semiconductors Lean Manufacturing Six Sigma Industrial Engineering JMP Manufacturing... Engineering Management Engineering Manufacturing Continuous Improvement SPC Design of Experiments Semiconductors Lean Manufacturing Six Sigma Industrial Engineering JMP Manufacturing... Engineering Management Engineering Manufacturing Continuous Improvement SPC Design of Experiments Semiconductors Lean Manufacturing Six Sigma Industrial Engineering JMP Manufacturing... Engineering Management Engineering Manufacturing Continuous Improvement ", "Languages English Native or bilingual proficiency Portuguese Limited working proficiency Spanish Limited working proficiency English Native or bilingual proficiency Portuguese Limited working proficiency Spanish Limited working proficiency English Native or bilingual proficiency Portuguese Limited working proficiency Spanish Limited working proficiency Native or bilingual proficiency Limited working proficiency Limited working proficiency Skills JMP SPC Engineering Semiconductors Design of Experiments Industrial Engineering Lean Manufacturing Simulations Six Sigma Manufacturing Failure Analysis Process Engineering Product Engineering Semiconductor Industry Root Cause Analysis DMAIC Continuous Improvement Manufacturing... Cycle Time Reduction FMEA Control Plans CVD Intel 5S Engineering Management Automotive Process Integration Testing Supply Chain Management Silicon R&D Kaizen Clutter Control Thin Films IC Plasma Etch See 21+     See less Skills  JMP SPC Engineering Semiconductors Design of Experiments Industrial Engineering Lean Manufacturing Simulations Six Sigma Manufacturing Failure Analysis Process Engineering Product Engineering Semiconductor Industry Root Cause Analysis DMAIC Continuous Improvement Manufacturing... Cycle Time Reduction FMEA Control Plans CVD Intel 5S Engineering Management Automotive Process Integration Testing Supply Chain Management Silicon R&D Kaizen Clutter Control Thin Films IC Plasma Etch See 21+     See less JMP SPC Engineering Semiconductors Design of Experiments Industrial Engineering Lean Manufacturing Simulations Six Sigma Manufacturing Failure Analysis Process Engineering Product Engineering Semiconductor Industry Root Cause Analysis DMAIC Continuous Improvement Manufacturing... Cycle Time Reduction FMEA Control Plans CVD Intel 5S Engineering Management Automotive Process Integration Testing Supply Chain Management Silicon R&D Kaizen Clutter Control Thin Films IC Plasma Etch See 21+     See less JMP SPC Engineering Semiconductors Design of Experiments Industrial Engineering Lean Manufacturing Simulations Six Sigma Manufacturing Failure Analysis Process Engineering Product Engineering Semiconductor Industry Root Cause Analysis DMAIC Continuous Improvement Manufacturing... Cycle Time Reduction FMEA Control Plans CVD Intel 5S Engineering Management Automotive Process Integration Testing Supply Chain Management Silicon R&D Kaizen Clutter Control Thin Films IC Plasma Etch See 21+     See less ", "Experience Industrial Engineer Intel Corporation 2011  – Present (4 years) 2014-present: F15 Capital Equipment Reuse Coordinator and C4 Strategic Capacity IE. Responsible for supporting the organizations mission to improve capital and reuse strategies to maximize reuse and support cost avoidance; streamline capital equipment transfer process and drive affordability improvements; analyze long range planning assumptions and set equipped capacity for C4 functional area to ensure the right equipment and quantities are in place to support multiple technology ramps; provide what-if analysis in support of those decisions, and maintain systems of record metrics. \n \n2011-2013: F17 Functional area IE responsible for Etch, C4 and Sort functional areas, with IQIE experience in capacity analysis, capital asset transfer & management and associated layout work. Process/Equipment Engineer Intel Corporation September 2000  –  2011  (11 years) Equipment owner responsible for fleet health, spare parts management, training 24x7 team of technicians to maintain equipment and debug faults. Led continuous improvement projects through Kaizen and boot camps to successfully eliminate FSE support through Lean & autonomous manufacturing, then standardizing improvements through maintenance specifications, RFC's and BKM's. Setup in house board repair facility, test equipment and harvest activities to support OEM end-of-life for ATE equipment. Industrial Engineer Intel Corporation 2011  – Present (4 years) 2014-present: F15 Capital Equipment Reuse Coordinator and C4 Strategic Capacity IE. Responsible for supporting the organizations mission to improve capital and reuse strategies to maximize reuse and support cost avoidance; streamline capital equipment transfer process and drive affordability improvements; analyze long range planning assumptions and set equipped capacity for C4 functional area to ensure the right equipment and quantities are in place to support multiple technology ramps; provide what-if analysis in support of those decisions, and maintain systems of record metrics. \n \n2011-2013: F17 Functional area IE responsible for Etch, C4 and Sort functional areas, with IQIE experience in capacity analysis, capital asset transfer & management and associated layout work. Industrial Engineer Intel Corporation 2011  – Present (4 years) 2014-present: F15 Capital Equipment Reuse Coordinator and C4 Strategic Capacity IE. Responsible for supporting the organizations mission to improve capital and reuse strategies to maximize reuse and support cost avoidance; streamline capital equipment transfer process and drive affordability improvements; analyze long range planning assumptions and set equipped capacity for C4 functional area to ensure the right equipment and quantities are in place to support multiple technology ramps; provide what-if analysis in support of those decisions, and maintain systems of record metrics. \n \n2011-2013: F17 Functional area IE responsible for Etch, C4 and Sort functional areas, with IQIE experience in capacity analysis, capital asset transfer & management and associated layout work. Process/Equipment Engineer Intel Corporation September 2000  –  2011  (11 years) Equipment owner responsible for fleet health, spare parts management, training 24x7 team of technicians to maintain equipment and debug faults. Led continuous improvement projects through Kaizen and boot camps to successfully eliminate FSE support through Lean & autonomous manufacturing, then standardizing improvements through maintenance specifications, RFC's and BKM's. Setup in house board repair facility, test equipment and harvest activities to support OEM end-of-life for ATE equipment. Process/Equipment Engineer Intel Corporation September 2000  –  2011  (11 years) Equipment owner responsible for fleet health, spare parts management, training 24x7 team of technicians to maintain equipment and debug faults. Led continuous improvement projects through Kaizen and boot camps to successfully eliminate FSE support through Lean & autonomous manufacturing, then standardizing improvements through maintenance specifications, RFC's and BKM's. Setup in house board repair facility, test equipment and harvest activities to support OEM end-of-life for ATE equipment. Skills Lean Manufacturing Semiconductors SPC Industrial Engineering Manufacturing Failure Analysis Process Improvement Engineering Management Kaizen Electronics Continuous Improvement Semiconductor Industry Process Engineering Design of Experiments Six Sigma Cross-functional Team... JMP See 2+     See less Skills  Lean Manufacturing Semiconductors SPC Industrial Engineering Manufacturing Failure Analysis Process Improvement Engineering Management Kaizen Electronics Continuous Improvement Semiconductor Industry Process Engineering Design of Experiments Six Sigma Cross-functional Team... JMP See 2+     See less Lean Manufacturing Semiconductors SPC Industrial Engineering Manufacturing Failure Analysis Process Improvement Engineering Management Kaizen Electronics Continuous Improvement Semiconductor Industry Process Engineering Design of Experiments Six Sigma Cross-functional Team... JMP See 2+     See less Lean Manufacturing Semiconductors SPC Industrial Engineering Manufacturing Failure Analysis Process Improvement Engineering Management Kaizen Electronics Continuous Improvement Semiconductor Industry Process Engineering Design of Experiments Six Sigma Cross-functional Team... JMP See 2+     See less Education Northeastern University BS,  Mechanical Engineering 2001 Northeastern University BS,  Mechanical Engineering 2001 Northeastern University BS,  Mechanical Engineering 2001 Northeastern University BS,  Mechanical Engineering 2001 ", "Summary Senior executive with a 21 year impeccable record of leading global organizations and programs at Intel spanning sales & marketing, supply chain, enterprise software, manufacturing and operations. Executive level experience working across US, Latin America and Asia on strategy, sales/marketing, business development, difficult negotiations, forecasting, and program management. Senior level experience managing technical and business organizations in the US, Latin America and Asia while motivating and inspiring people, articulating a vision, and influencing decision making. \n \nExperience in emerging markets strategy, go-to-market and marketing programs, leading sales targets/managing to exceptional sales results, and relationship management with customers. \n \nExperience influencing and negotiating at C-level executive business and technology sessions at the consumer electronics providers in China, Taiwan and Latin America.  \n \nExperience at collaboratively working across teams and geographies/cultures; creatively maintaining schedules and plans, and ability to apply structure and discipline into a fast-paced environment.  \n \nFluent in: English and Spanish. Working knowledge: Italian. Learning: Portuguese. Summary Senior executive with a 21 year impeccable record of leading global organizations and programs at Intel spanning sales & marketing, supply chain, enterprise software, manufacturing and operations. Executive level experience working across US, Latin America and Asia on strategy, sales/marketing, business development, difficult negotiations, forecasting, and program management. Senior level experience managing technical and business organizations in the US, Latin America and Asia while motivating and inspiring people, articulating a vision, and influencing decision making. \n \nExperience in emerging markets strategy, go-to-market and marketing programs, leading sales targets/managing to exceptional sales results, and relationship management with customers. \n \nExperience influencing and negotiating at C-level executive business and technology sessions at the consumer electronics providers in China, Taiwan and Latin America.  \n \nExperience at collaboratively working across teams and geographies/cultures; creatively maintaining schedules and plans, and ability to apply structure and discipline into a fast-paced environment.  \n \nFluent in: English and Spanish. Working knowledge: Italian. Learning: Portuguese. Senior executive with a 21 year impeccable record of leading global organizations and programs at Intel spanning sales & marketing, supply chain, enterprise software, manufacturing and operations. Executive level experience working across US, Latin America and Asia on strategy, sales/marketing, business development, difficult negotiations, forecasting, and program management. Senior level experience managing technical and business organizations in the US, Latin America and Asia while motivating and inspiring people, articulating a vision, and influencing decision making. \n \nExperience in emerging markets strategy, go-to-market and marketing programs, leading sales targets/managing to exceptional sales results, and relationship management with customers. \n \nExperience influencing and negotiating at C-level executive business and technology sessions at the consumer electronics providers in China, Taiwan and Latin America.  \n \nExperience at collaboratively working across teams and geographies/cultures; creatively maintaining schedules and plans, and ability to apply structure and discipline into a fast-paced environment.  \n \nFluent in: English and Spanish. Working knowledge: Italian. Learning: Portuguese. Senior executive with a 21 year impeccable record of leading global organizations and programs at Intel spanning sales & marketing, supply chain, enterprise software, manufacturing and operations. Executive level experience working across US, Latin America and Asia on strategy, sales/marketing, business development, difficult negotiations, forecasting, and program management. Senior level experience managing technical and business organizations in the US, Latin America and Asia while motivating and inspiring people, articulating a vision, and influencing decision making. \n \nExperience in emerging markets strategy, go-to-market and marketing programs, leading sales targets/managing to exceptional sales results, and relationship management with customers. \n \nExperience influencing and negotiating at C-level executive business and technology sessions at the consumer electronics providers in China, Taiwan and Latin America.  \n \nExperience at collaboratively working across teams and geographies/cultures; creatively maintaining schedules and plans, and ability to apply structure and discipline into a fast-paced environment.  \n \nFluent in: English and Spanish. Working knowledge: Italian. Learning: Portuguese. Experience Director, Product Intel Corporation February 2015  – Present (7 months) Latin America Regional Sales/Business Development Manager Intel Corporation January 2012  –  February 2015  (3 years 2 months) Latin America Business Development Manager Intel Corporation January 2010  –  January 2012  (2 years 1 month) Senior Manager, Software and Decision Science Engineering Intel Corporation January 2004  –  December 2009  (6 years) Supply Chain and IT Manager Intel Corporation 2000  –  2004  (4 years) Senior Industrial Engineer Intel Corporation 1995  –  2000  (5 years) Industrial Engineer Intel Corporation 1992  –  1995  (3 years) Director, Product Intel Corporation February 2015  – Present (7 months) Latin America Director, Product Intel Corporation February 2015  – Present (7 months) Latin America Regional Sales/Business Development Manager Intel Corporation January 2012  –  February 2015  (3 years 2 months) Latin America Regional Sales/Business Development Manager Intel Corporation January 2012  –  February 2015  (3 years 2 months) Latin America Business Development Manager Intel Corporation January 2010  –  January 2012  (2 years 1 month) Business Development Manager Intel Corporation January 2010  –  January 2012  (2 years 1 month) Senior Manager, Software and Decision Science Engineering Intel Corporation January 2004  –  December 2009  (6 years) Senior Manager, Software and Decision Science Engineering Intel Corporation January 2004  –  December 2009  (6 years) Supply Chain and IT Manager Intel Corporation 2000  –  2004  (4 years) Supply Chain and IT Manager Intel Corporation 2000  –  2004  (4 years) Senior Industrial Engineer Intel Corporation 1995  –  2000  (5 years) Senior Industrial Engineer Intel Corporation 1995  –  2000  (5 years) Industrial Engineer Intel Corporation 1992  –  1995  (3 years) Industrial Engineer Intel Corporation 1992  –  1995  (3 years) Skills Organizational... Lean Manufacturing Business Analysis Strategy Strategic Planning Change Management Product Marketing Management Competitive Analysis Program Management Enterprise Software Supply Chain Management Semiconductor Industry Supply Chain Vendor Management Training New Business Development Business Development Business Intelligence Pricing Account Management Forecasting Cross-functional Team... Demand Generation Product Launch Project Management SaaS Start-ups Business Strategy Team Building Product Management Sales Management Product Lifecycle... Process Improvement Negotiation Business Process... Business Alliances Solution Selling Sales Operations Management Supply Management Continuous Improvement Process Engineering Strategic Partnerships Technical Leadership Telecommunications Channel Partners Finance Manufacturing Executive Management See 35+     See less Skills  Organizational... Lean Manufacturing Business Analysis Strategy Strategic Planning Change Management Product Marketing Management Competitive Analysis Program Management Enterprise Software Supply Chain Management Semiconductor Industry Supply Chain Vendor Management Training New Business Development Business Development Business Intelligence Pricing Account Management Forecasting Cross-functional Team... Demand Generation Product Launch Project Management SaaS Start-ups Business Strategy Team Building Product Management Sales Management Product Lifecycle... Process Improvement Negotiation Business Process... Business Alliances Solution Selling Sales Operations Management Supply Management Continuous Improvement Process Engineering Strategic Partnerships Technical Leadership Telecommunications Channel Partners Finance Manufacturing Executive Management See 35+     See less Organizational... Lean Manufacturing Business Analysis Strategy Strategic Planning Change Management Product Marketing Management Competitive Analysis Program Management Enterprise Software Supply Chain Management Semiconductor Industry Supply Chain Vendor Management Training New Business Development Business Development Business Intelligence Pricing Account Management Forecasting Cross-functional Team... Demand Generation Product Launch Project Management SaaS Start-ups Business Strategy Team Building Product Management Sales Management Product Lifecycle... Process Improvement Negotiation Business Process... Business Alliances Solution Selling Sales Operations Management Supply Management Continuous Improvement Process Engineering Strategic Partnerships Technical Leadership Telecommunications Channel Partners Finance Manufacturing Executive Management See 35+     See less Organizational... Lean Manufacturing Business Analysis Strategy Strategic Planning Change Management Product Marketing Management Competitive Analysis Program Management Enterprise Software Supply Chain Management Semiconductor Industry Supply Chain Vendor Management Training New Business Development Business Development Business Intelligence Pricing Account Management Forecasting Cross-functional Team... Demand Generation Product Launch Project Management SaaS Start-ups Business Strategy Team Building Product Management Sales Management Product Lifecycle... Process Improvement Negotiation Business Process... Business Alliances Solution Selling Sales Operations Management Supply Management Continuous Improvement Process Engineering Strategic Partnerships Technical Leadership Telecommunications Channel Partners Finance Manufacturing Executive Management See 35+     See less Education Georgia Institute of Technology M.S.I.E. 2007  – 2008 Arizona State University - W. P. Carey School of Business MBA 1998  – 2000 Arizona State University M.S.I.E. 1988  – 1993 Georgia Institute of Technology M.S.I.E. 2007  – 2008 Georgia Institute of Technology M.S.I.E. 2007  – 2008 Georgia Institute of Technology M.S.I.E. 2007  – 2008 Arizona State University - W. P. Carey School of Business MBA 1998  – 2000 Arizona State University - W. P. Carey School of Business MBA 1998  – 2000 Arizona State University - W. P. Carey School of Business MBA 1998  – 2000 Arizona State University M.S.I.E. 1988  – 1993 Arizona State University M.S.I.E. 1988  – 1993 Arizona State University M.S.I.E. 1988  – 1993 Honors & Awards ", "Skills Cross-functional Team... Six Sigma Lean Manufacturing Semiconductors Process Engineering Design of Experiments Root Cause Analysis SPC Continuous Improvement Engineering Management Manufacturing Industrial Engineering Process Improvement Program Management Skills  Cross-functional Team... Six Sigma Lean Manufacturing Semiconductors Process Engineering Design of Experiments Root Cause Analysis SPC Continuous Improvement Engineering Management Manufacturing Industrial Engineering Process Improvement Program Management Cross-functional Team... Six Sigma Lean Manufacturing Semiconductors Process Engineering Design of Experiments Root Cause Analysis SPC Continuous Improvement Engineering Management Manufacturing Industrial Engineering Process Improvement Program Management Cross-functional Team... Six Sigma Lean Manufacturing Semiconductors Process Engineering Design of Experiments Root Cause Analysis SPC Continuous Improvement Engineering Management Manufacturing Industrial Engineering Process Improvement Program Management ", "Experience IT Supply Network – Strategic Product Line Manager Intel Corporation 2010  –  March 2014  (4 years) Hillsboro, OR * IT product line manager developing and deploying IT strategic capability roadmaps for the subcontract manufacturing business units \n* IT Supply Network Capability point of contact for the Intel-wide Supply Chain Strategic Roadmap Team focusing on Intel's 1 to 3+ year strategic supply chain roadmap.  \n* IT@Intel domain owner for Supply Network Capability responsible for managing all external communications from Intel IT Supply Chain group. This includes reviewing and approving all papers and presentation, developing additional collateral to be used by the Intel marketing teams with customers, and managing/training subject matter experts. IT Supply Network – Distribution Services Product Manager Intel 2006  –  2010  (4 years) Hillsboro, OR Product Manager responsible for development and implementation of a strategic subcontracting and outsourcing supply chain roadmap. These responsibilities include stakeholder management, partnering with stakeholders to identify strategic requirements, identifying industry solutions / opportunities, and creating a strategic roadmap based upon those components. The responsibilities also include managing the end-to-end PLC (Product Life Cycle) for the IT solutions: POC (Proof of Concept), funding and project creation, delivering the capabilities, establishing the sustaining support, and indicator tracking. \n•\tStandardization of Subcontracting/Outsourcing capabilities across Intel IT. Identified the opportunity and actively worked to map and network with organizations (including Materials, CPLG, GPS, Box CPU, and NAND), documented tools/applications used, and alignment of Subcontracting business processes to the ECF (Enterprise Capability Framework). This effort has provided a foundation for both replatform and post-replatform, to continue driving a simplified and aligned enterprise IT environment. \n•\tChaired ASUG (America’s SAP Users Group) Subcontracting Influence Council since 2008 covering the SAP ECC Subcontracting business processes and integration with SAP SNC (Supply Network Collaboration) capability. This included presenting at the annual ASUG conference. \n•\tInstructor for internal Intel APICS CSCP certification exam preparation classes. \n•\tLeader of IT SNC ECF Work group driving organization wide usage recommendations for IT frameworks and management processes. These recommendations include consistent usage of ECF framework and service catalogue, a clear ownership model, and increased partnership with business stakeholders. IT Supply Network – Distribution Services Business Analyst Intel Corporation 2006  –  2007  (1 year) Hillsboro, OR Transitioned into Business Analyst position responsible for As-is and To-be business process modeling, requirements development, business process re-engineering, data quality, and training. Provide project management for software development rooted in strong stakeholder management and application of the Capability Maturity Model Integration (CMMI) methodology.  \n \n•\tProvided tool sustaining support for applications in areas including delivery performance and inventory safety stock planning (Applications: DPMT, Mfg Flex).  \n•\tTechnical lead / representative for Outsource Manufacturing businesses on project team developing corporate delivery performance tracking application. Responsibilities include stakeholder management, facilitating business process consistency across project team, and requirements definition. Industrial Engineering Manager Intel 2001  –  2006  (5 years) Hillsboro, OR Promoted to newly created position responsible for performance management and development of direct report employees. Managed IE deliverables in capacity, layout, and systems in the D1C C4/Diffusion/Implant/Planar functional areas. Increased scope of responsibility by adding ownership of the Thin Films/Metrology functional areas in January 2004. \n•\tManaged team of direct report and seed IEs ranging in size from 4 to 8 individuals. Responsibilities include on time completion of all IE deliverables, setting strategic direction, driving continuous improvement, stakeholder management, and performance management. \n•\tLeader of D1C IE department initiatives as part of the department management team, including sustaining and improving overall department Performance Plan process / success indicators and sustaining training processes. \n•\tLed multiple IE teams in support of D1C factory and Virtual Factory (VF) initiatives, including tool allocation and forecasting through SAP and cross-site processing logistics. \n•\tDrove module level improvements through completion of IE deliverables such as speed models, maintenance scripts, capacity improvement roadmaps, and data systems validation. \n•\tCoached team members in support of operational improvements, including preventative maintenance forecasting tools, up-time / effective utilization indicators, and application of lean manufacturing methodologies. \n•\tResponsible for strategic layout coordination developing long term layout strategies for D1C factory and a space model to support multiple LRP what-if scenarios (Nov 2003 – June 2004). Fab 20 Senior Industrial Engineer Intel Corporation 2000  –  2001  (1 year) Hillsboro, OR Owned and drove completion of deliverables in the Planar and C4 functional areas for the P860 HVM ramp in Fab 20. Scope of responsibility included both capacity and layout deliverables and support of P860 process transfer to the VF. \n•\tProvided expertise and layout solutions for D2, Fab 17, and Fab 22 layout development activities. \n•\tDrove operational improvements in tungsten module throughout the VF, by observing multiple factories, identifying areas of inefficiency, and implementing solutions to decrease maintenance times and improve tactical floor operations. \n•\tManaged development of the P860 test wafer database, driving increased awareness of TW usage, capacity impacts, and cost reduction through TW reduction roadmaps. \n•\tCoordinated development of the D1C capacity planning models. Engaged with 12XX VF development team and then drove customization of the VF model to support D1C specific needs and requirements. Fab 20 Industrial Engineer Intel Corporation 1998  –  2000  (2 years) Hillsboro, OR Responsible for capacity and layout deliverables for the Planar and C4 functional areas. Expanded my semiconductor knowledge and IE skills supporting the P858 HVM ramp. Advanced my capacity modeling skills through application in the P858 tungsten and oxide polish modules, as well as my layout skills in delivering the P858 ramp layout and tool installation support. Fab 5 Industrial Engineer Intel Corporation 1997  –  1998  (1 year) Aloha, Oregon Joined Intel Corporation as a recent college graduate in Fab 5 (manufacturing facility name) Industrial Engineering. Focused on operational improvements for Lithography, Planar, and Thin Films functional areas through observational studies and partnering with technician and process engineers. Facilitated Lithography run rate improvement team driving engineering projects to increase overall factory output 7%. IT Supply Network – Strategic Product Line Manager Intel Corporation 2010  –  March 2014  (4 years) Hillsboro, OR * IT product line manager developing and deploying IT strategic capability roadmaps for the subcontract manufacturing business units \n* IT Supply Network Capability point of contact for the Intel-wide Supply Chain Strategic Roadmap Team focusing on Intel's 1 to 3+ year strategic supply chain roadmap.  \n* IT@Intel domain owner for Supply Network Capability responsible for managing all external communications from Intel IT Supply Chain group. This includes reviewing and approving all papers and presentation, developing additional collateral to be used by the Intel marketing teams with customers, and managing/training subject matter experts. IT Supply Network – Strategic Product Line Manager Intel Corporation 2010  –  March 2014  (4 years) Hillsboro, OR * IT product line manager developing and deploying IT strategic capability roadmaps for the subcontract manufacturing business units \n* IT Supply Network Capability point of contact for the Intel-wide Supply Chain Strategic Roadmap Team focusing on Intel's 1 to 3+ year strategic supply chain roadmap.  \n* IT@Intel domain owner for Supply Network Capability responsible for managing all external communications from Intel IT Supply Chain group. This includes reviewing and approving all papers and presentation, developing additional collateral to be used by the Intel marketing teams with customers, and managing/training subject matter experts. IT Supply Network – Distribution Services Product Manager Intel 2006  –  2010  (4 years) Hillsboro, OR Product Manager responsible for development and implementation of a strategic subcontracting and outsourcing supply chain roadmap. These responsibilities include stakeholder management, partnering with stakeholders to identify strategic requirements, identifying industry solutions / opportunities, and creating a strategic roadmap based upon those components. The responsibilities also include managing the end-to-end PLC (Product Life Cycle) for the IT solutions: POC (Proof of Concept), funding and project creation, delivering the capabilities, establishing the sustaining support, and indicator tracking. \n•\tStandardization of Subcontracting/Outsourcing capabilities across Intel IT. Identified the opportunity and actively worked to map and network with organizations (including Materials, CPLG, GPS, Box CPU, and NAND), documented tools/applications used, and alignment of Subcontracting business processes to the ECF (Enterprise Capability Framework). This effort has provided a foundation for both replatform and post-replatform, to continue driving a simplified and aligned enterprise IT environment. \n•\tChaired ASUG (America’s SAP Users Group) Subcontracting Influence Council since 2008 covering the SAP ECC Subcontracting business processes and integration with SAP SNC (Supply Network Collaboration) capability. This included presenting at the annual ASUG conference. \n•\tInstructor for internal Intel APICS CSCP certification exam preparation classes. \n•\tLeader of IT SNC ECF Work group driving organization wide usage recommendations for IT frameworks and management processes. These recommendations include consistent usage of ECF framework and service catalogue, a clear ownership model, and increased partnership with business stakeholders. IT Supply Network – Distribution Services Product Manager Intel 2006  –  2010  (4 years) Hillsboro, OR Product Manager responsible for development and implementation of a strategic subcontracting and outsourcing supply chain roadmap. These responsibilities include stakeholder management, partnering with stakeholders to identify strategic requirements, identifying industry solutions / opportunities, and creating a strategic roadmap based upon those components. The responsibilities also include managing the end-to-end PLC (Product Life Cycle) for the IT solutions: POC (Proof of Concept), funding and project creation, delivering the capabilities, establishing the sustaining support, and indicator tracking. \n•\tStandardization of Subcontracting/Outsourcing capabilities across Intel IT. Identified the opportunity and actively worked to map and network with organizations (including Materials, CPLG, GPS, Box CPU, and NAND), documented tools/applications used, and alignment of Subcontracting business processes to the ECF (Enterprise Capability Framework). This effort has provided a foundation for both replatform and post-replatform, to continue driving a simplified and aligned enterprise IT environment. \n•\tChaired ASUG (America’s SAP Users Group) Subcontracting Influence Council since 2008 covering the SAP ECC Subcontracting business processes and integration with SAP SNC (Supply Network Collaboration) capability. This included presenting at the annual ASUG conference. \n•\tInstructor for internal Intel APICS CSCP certification exam preparation classes. \n•\tLeader of IT SNC ECF Work group driving organization wide usage recommendations for IT frameworks and management processes. These recommendations include consistent usage of ECF framework and service catalogue, a clear ownership model, and increased partnership with business stakeholders. IT Supply Network – Distribution Services Business Analyst Intel Corporation 2006  –  2007  (1 year) Hillsboro, OR Transitioned into Business Analyst position responsible for As-is and To-be business process modeling, requirements development, business process re-engineering, data quality, and training. Provide project management for software development rooted in strong stakeholder management and application of the Capability Maturity Model Integration (CMMI) methodology.  \n \n•\tProvided tool sustaining support for applications in areas including delivery performance and inventory safety stock planning (Applications: DPMT, Mfg Flex).  \n•\tTechnical lead / representative for Outsource Manufacturing businesses on project team developing corporate delivery performance tracking application. Responsibilities include stakeholder management, facilitating business process consistency across project team, and requirements definition. IT Supply Network – Distribution Services Business Analyst Intel Corporation 2006  –  2007  (1 year) Hillsboro, OR Transitioned into Business Analyst position responsible for As-is and To-be business process modeling, requirements development, business process re-engineering, data quality, and training. Provide project management for software development rooted in strong stakeholder management and application of the Capability Maturity Model Integration (CMMI) methodology.  \n \n•\tProvided tool sustaining support for applications in areas including delivery performance and inventory safety stock planning (Applications: DPMT, Mfg Flex).  \n•\tTechnical lead / representative for Outsource Manufacturing businesses on project team developing corporate delivery performance tracking application. Responsibilities include stakeholder management, facilitating business process consistency across project team, and requirements definition. Industrial Engineering Manager Intel 2001  –  2006  (5 years) Hillsboro, OR Promoted to newly created position responsible for performance management and development of direct report employees. Managed IE deliverables in capacity, layout, and systems in the D1C C4/Diffusion/Implant/Planar functional areas. Increased scope of responsibility by adding ownership of the Thin Films/Metrology functional areas in January 2004. \n•\tManaged team of direct report and seed IEs ranging in size from 4 to 8 individuals. Responsibilities include on time completion of all IE deliverables, setting strategic direction, driving continuous improvement, stakeholder management, and performance management. \n•\tLeader of D1C IE department initiatives as part of the department management team, including sustaining and improving overall department Performance Plan process / success indicators and sustaining training processes. \n•\tLed multiple IE teams in support of D1C factory and Virtual Factory (VF) initiatives, including tool allocation and forecasting through SAP and cross-site processing logistics. \n•\tDrove module level improvements through completion of IE deliverables such as speed models, maintenance scripts, capacity improvement roadmaps, and data systems validation. \n•\tCoached team members in support of operational improvements, including preventative maintenance forecasting tools, up-time / effective utilization indicators, and application of lean manufacturing methodologies. \n•\tResponsible for strategic layout coordination developing long term layout strategies for D1C factory and a space model to support multiple LRP what-if scenarios (Nov 2003 – June 2004). Industrial Engineering Manager Intel 2001  –  2006  (5 years) Hillsboro, OR Promoted to newly created position responsible for performance management and development of direct report employees. Managed IE deliverables in capacity, layout, and systems in the D1C C4/Diffusion/Implant/Planar functional areas. Increased scope of responsibility by adding ownership of the Thin Films/Metrology functional areas in January 2004. \n•\tManaged team of direct report and seed IEs ranging in size from 4 to 8 individuals. Responsibilities include on time completion of all IE deliverables, setting strategic direction, driving continuous improvement, stakeholder management, and performance management. \n•\tLeader of D1C IE department initiatives as part of the department management team, including sustaining and improving overall department Performance Plan process / success indicators and sustaining training processes. \n•\tLed multiple IE teams in support of D1C factory and Virtual Factory (VF) initiatives, including tool allocation and forecasting through SAP and cross-site processing logistics. \n•\tDrove module level improvements through completion of IE deliverables such as speed models, maintenance scripts, capacity improvement roadmaps, and data systems validation. \n•\tCoached team members in support of operational improvements, including preventative maintenance forecasting tools, up-time / effective utilization indicators, and application of lean manufacturing methodologies. \n•\tResponsible for strategic layout coordination developing long term layout strategies for D1C factory and a space model to support multiple LRP what-if scenarios (Nov 2003 – June 2004). Fab 20 Senior Industrial Engineer Intel Corporation 2000  –  2001  (1 year) Hillsboro, OR Owned and drove completion of deliverables in the Planar and C4 functional areas for the P860 HVM ramp in Fab 20. Scope of responsibility included both capacity and layout deliverables and support of P860 process transfer to the VF. \n•\tProvided expertise and layout solutions for D2, Fab 17, and Fab 22 layout development activities. \n•\tDrove operational improvements in tungsten module throughout the VF, by observing multiple factories, identifying areas of inefficiency, and implementing solutions to decrease maintenance times and improve tactical floor operations. \n•\tManaged development of the P860 test wafer database, driving increased awareness of TW usage, capacity impacts, and cost reduction through TW reduction roadmaps. \n•\tCoordinated development of the D1C capacity planning models. Engaged with 12XX VF development team and then drove customization of the VF model to support D1C specific needs and requirements. Fab 20 Senior Industrial Engineer Intel Corporation 2000  –  2001  (1 year) Hillsboro, OR Owned and drove completion of deliverables in the Planar and C4 functional areas for the P860 HVM ramp in Fab 20. Scope of responsibility included both capacity and layout deliverables and support of P860 process transfer to the VF. \n•\tProvided expertise and layout solutions for D2, Fab 17, and Fab 22 layout development activities. \n•\tDrove operational improvements in tungsten module throughout the VF, by observing multiple factories, identifying areas of inefficiency, and implementing solutions to decrease maintenance times and improve tactical floor operations. \n•\tManaged development of the P860 test wafer database, driving increased awareness of TW usage, capacity impacts, and cost reduction through TW reduction roadmaps. \n•\tCoordinated development of the D1C capacity planning models. Engaged with 12XX VF development team and then drove customization of the VF model to support D1C specific needs and requirements. Fab 20 Industrial Engineer Intel Corporation 1998  –  2000  (2 years) Hillsboro, OR Responsible for capacity and layout deliverables for the Planar and C4 functional areas. Expanded my semiconductor knowledge and IE skills supporting the P858 HVM ramp. Advanced my capacity modeling skills through application in the P858 tungsten and oxide polish modules, as well as my layout skills in delivering the P858 ramp layout and tool installation support. Fab 20 Industrial Engineer Intel Corporation 1998  –  2000  (2 years) Hillsboro, OR Responsible for capacity and layout deliverables for the Planar and C4 functional areas. Expanded my semiconductor knowledge and IE skills supporting the P858 HVM ramp. Advanced my capacity modeling skills through application in the P858 tungsten and oxide polish modules, as well as my layout skills in delivering the P858 ramp layout and tool installation support. Fab 5 Industrial Engineer Intel Corporation 1997  –  1998  (1 year) Aloha, Oregon Joined Intel Corporation as a recent college graduate in Fab 5 (manufacturing facility name) Industrial Engineering. Focused on operational improvements for Lithography, Planar, and Thin Films functional areas through observational studies and partnering with technician and process engineers. Facilitated Lithography run rate improvement team driving engineering projects to increase overall factory output 7%. Fab 5 Industrial Engineer Intel Corporation 1997  –  1998  (1 year) Aloha, Oregon Joined Intel Corporation as a recent college graduate in Fab 5 (manufacturing facility name) Industrial Engineering. Focused on operational improvements for Lithography, Planar, and Thin Films functional areas through observational studies and partnering with technician and process engineers. Facilitated Lithography run rate improvement team driving engineering projects to increase overall factory output 7%. Skills Supply Chain Business Process... Business Process Process Improvement Semiconductors Supply Chain Management SAP Manufacturing Strategy Cross-functional Team... Process Engineering Lean Manufacturing Integration Skills  Supply Chain Business Process... Business Process Process Improvement Semiconductors Supply Chain Management SAP Manufacturing Strategy Cross-functional Team... Process Engineering Lean Manufacturing Integration Supply Chain Business Process... Business Process Process Improvement Semiconductors Supply Chain Management SAP Manufacturing Strategy Cross-functional Team... Process Engineering Lean Manufacturing Integration Supply Chain Business Process... Business Process Process Improvement Semiconductors Supply Chain Management SAP Manufacturing Strategy Cross-functional Team... Process Engineering Lean Manufacturing Integration Education Portland State University MS,  Systems Science 1999  – 2003 Graduate certificate: Computer Simulation and Modeling Iowa State University BS,  Industrial Engineering 1992  – 1997 Portland State University MS,  Systems Science 1999  – 2003 Graduate certificate: Computer Simulation and Modeling Portland State University MS,  Systems Science 1999  – 2003 Graduate certificate: Computer Simulation and Modeling Portland State University MS,  Systems Science 1999  – 2003 Graduate certificate: Computer Simulation and Modeling Iowa State University BS,  Industrial Engineering 1992  – 1997 Iowa State University BS,  Industrial Engineering 1992  – 1997 Iowa State University BS,  Industrial Engineering 1992  – 1997 ", "Experience Capacity Industrial Engineer Intel Corporation April 2013  – Present (2 years 5 months) Intel Products Vietnam - Defined solutions to maximize factory capacity with minimal cost and resource constraints to meet customer’s requirement. \n \n- Experienced on working with multiple stakeholders to define capacity plan for both middle term horizon and execution horizon with challenges when Intel Vietnam factory ramp up from chip-set products to CPU products. \n \n- Worked with global capacity industrial engineers to standardize process of tactical capacity planning and apply this new process for whole Intel factories by July 2013. \n \n- Cooperated with Vietnam site capacity industrial engineers and global technical system team to develop and deploy new capacity analysis system on June 2014 to reduce capacity response time. PRODUCTIVITY INDUSTRIAL ENGINEER Intel Corporation March 2010  –  March 2013  (3 years 1 month) Intel Products Vietnam - Validated the equipment performance; drove solutions to close gaps between goal and actual; and identify opportunities to increase productivity of equipment and people. \n \n- Was one of the first productivity industrial engineers in Vietnam adapted time study methodology to monitor tool performance and contribute for success of Intel Vietnam factory site certification. \n \n- Drove more than 10 big improvement projects in multiple operations to enhance different indicators impact to tool performance such as preventive maintenance schedule, lot set up duration, product health indicator… The most impact project helped Intel save 10 tools across Intel worldwide factories. \n \n- Established Learning Card process to encourage small and rapid improvements. This project attracted 400 submitted Learning Card and standardized 61.4% these ideas. \n \n- Led first Man Machine Ratio Kaizen Event in Intel Vietnam on test module. This project improved 8% labor through Lean Concepts by eliminate non value added activities for technicians. Capacity Industrial Engineer Intel Corporation April 2013  – Present (2 years 5 months) Intel Products Vietnam - Defined solutions to maximize factory capacity with minimal cost and resource constraints to meet customer’s requirement. \n \n- Experienced on working with multiple stakeholders to define capacity plan for both middle term horizon and execution horizon with challenges when Intel Vietnam factory ramp up from chip-set products to CPU products. \n \n- Worked with global capacity industrial engineers to standardize process of tactical capacity planning and apply this new process for whole Intel factories by July 2013. \n \n- Cooperated with Vietnam site capacity industrial engineers and global technical system team to develop and deploy new capacity analysis system on June 2014 to reduce capacity response time. Capacity Industrial Engineer Intel Corporation April 2013  – Present (2 years 5 months) Intel Products Vietnam - Defined solutions to maximize factory capacity with minimal cost and resource constraints to meet customer’s requirement. \n \n- Experienced on working with multiple stakeholders to define capacity plan for both middle term horizon and execution horizon with challenges when Intel Vietnam factory ramp up from chip-set products to CPU products. \n \n- Worked with global capacity industrial engineers to standardize process of tactical capacity planning and apply this new process for whole Intel factories by July 2013. \n \n- Cooperated with Vietnam site capacity industrial engineers and global technical system team to develop and deploy new capacity analysis system on June 2014 to reduce capacity response time. PRODUCTIVITY INDUSTRIAL ENGINEER Intel Corporation March 2010  –  March 2013  (3 years 1 month) Intel Products Vietnam - Validated the equipment performance; drove solutions to close gaps between goal and actual; and identify opportunities to increase productivity of equipment and people. \n \n- Was one of the first productivity industrial engineers in Vietnam adapted time study methodology to monitor tool performance and contribute for success of Intel Vietnam factory site certification. \n \n- Drove more than 10 big improvement projects in multiple operations to enhance different indicators impact to tool performance such as preventive maintenance schedule, lot set up duration, product health indicator… The most impact project helped Intel save 10 tools across Intel worldwide factories. \n \n- Established Learning Card process to encourage small and rapid improvements. This project attracted 400 submitted Learning Card and standardized 61.4% these ideas. \n \n- Led first Man Machine Ratio Kaizen Event in Intel Vietnam on test module. This project improved 8% labor through Lean Concepts by eliminate non value added activities for technicians. PRODUCTIVITY INDUSTRIAL ENGINEER Intel Corporation March 2010  –  March 2013  (3 years 1 month) Intel Products Vietnam - Validated the equipment performance; drove solutions to close gaps between goal and actual; and identify opportunities to increase productivity of equipment and people. \n \n- Was one of the first productivity industrial engineers in Vietnam adapted time study methodology to monitor tool performance and contribute for success of Intel Vietnam factory site certification. \n \n- Drove more than 10 big improvement projects in multiple operations to enhance different indicators impact to tool performance such as preventive maintenance schedule, lot set up duration, product health indicator… The most impact project helped Intel save 10 tools across Intel worldwide factories. \n \n- Established Learning Card process to encourage small and rapid improvements. This project attracted 400 submitted Learning Card and standardized 61.4% these ideas. \n \n- Led first Man Machine Ratio Kaizen Event in Intel Vietnam on test module. This project improved 8% labor through Lean Concepts by eliminate non value added activities for technicians. Languages Chinese Chinese Chinese Skills Manufacturing Semiconductors Engineering Lean Manufacturing Cross-functional Team... Six Sigma Process Improvement Product Development Industrial Engineering Tactical Planning Statistical Data... Teamwork Communication Presentations Skills  Manufacturing Semiconductors Engineering Lean Manufacturing Cross-functional Team... Six Sigma Process Improvement Product Development Industrial Engineering Tactical Planning Statistical Data... Teamwork Communication Presentations Manufacturing Semiconductors Engineering Lean Manufacturing Cross-functional Team... Six Sigma Process Improvement Product Development Industrial Engineering Tactical Planning Statistical Data... Teamwork Communication Presentations Manufacturing Semiconductors Engineering Lean Manufacturing Cross-functional Team... Six Sigma Process Improvement Product Development Industrial Engineering Tactical Planning Statistical Data... Teamwork Communication Presentations Education HO CHI MINH CITY UNIVERSITY OF TECHNOLOGY Bachelor's Degree,  INDUSTRIAL SYSTEM ENGINEER 2005  – 2010 - Archived GPA: 8.44/10  \n- Received Silver Medal Award for Honor Graduation Student LE HONG PHONG HIGH SCHOOL FOR THE GIFTED High School 2002  – 2005 - Continuously get 12 years Excellent Student Reward \n- Archived Second Prize of Ho Chi Minh City Grade 9 Gifted Student on Mathematic subject in 2002 HO CHI MINH CITY UNIVERSITY OF TECHNOLOGY Bachelor's Degree,  INDUSTRIAL SYSTEM ENGINEER 2005  – 2010 - Archived GPA: 8.44/10  \n- Received Silver Medal Award for Honor Graduation Student HO CHI MINH CITY UNIVERSITY OF TECHNOLOGY Bachelor's Degree,  INDUSTRIAL SYSTEM ENGINEER 2005  – 2010 - Archived GPA: 8.44/10  \n- Received Silver Medal Award for Honor Graduation Student HO CHI MINH CITY UNIVERSITY OF TECHNOLOGY Bachelor's Degree,  INDUSTRIAL SYSTEM ENGINEER 2005  – 2010 - Archived GPA: 8.44/10  \n- Received Silver Medal Award for Honor Graduation Student LE HONG PHONG HIGH SCHOOL FOR THE GIFTED High School 2002  – 2005 - Continuously get 12 years Excellent Student Reward \n- Archived Second Prize of Ho Chi Minh City Grade 9 Gifted Student on Mathematic subject in 2002 LE HONG PHONG HIGH SCHOOL FOR THE GIFTED High School 2002  – 2005 - Continuously get 12 years Excellent Student Reward \n- Archived Second Prize of Ho Chi Minh City Grade 9 Gifted Student on Mathematic subject in 2002 LE HONG PHONG HIGH SCHOOL FOR THE GIFTED High School 2002  – 2005 - Continuously get 12 years Excellent Student Reward \n- Archived Second Prize of Ho Chi Minh City Grade 9 Gifted Student on Mathematic subject in 2002 ", "Experience Layout Industrial Engineer Intel Corporation July 2011  –  October 2014  (3 years 4 months) Chandler, AZ Developed creative solutions to optimize factory space and maximize wafer production. Industrial Engineer Intern American Express May 2010  –  August 2010  (4 months) Layout Industrial Engineer Intel Corporation July 2011  –  October 2014  (3 years 4 months) Chandler, AZ Developed creative solutions to optimize factory space and maximize wafer production. Layout Industrial Engineer Intel Corporation July 2011  –  October 2014  (3 years 4 months) Chandler, AZ Developed creative solutions to optimize factory space and maximize wafer production. Industrial Engineer Intern American Express May 2010  –  August 2010  (4 months) Industrial Engineer Intern American Express May 2010  –  August 2010  (4 months) Languages English Native or bilingual proficiency Spanish Native or bilingual proficiency English Native or bilingual proficiency Spanish Native or bilingual proficiency English Native or bilingual proficiency Spanish Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Minitab VB.NET MS Project Visio Process Improvement Process Design Green Belt Skills  Minitab VB.NET MS Project Visio Process Improvement Process Design Green Belt Minitab VB.NET MS Project Visio Process Improvement Process Design Green Belt Minitab VB.NET MS Project Visio Process Improvement Process Design Green Belt Education Arizona State University Industrial Engineering 2006  – 2011 Activities and Societies:  SHPE de ASU Arizona State University Industrial Engineering 2006  – 2011 Activities and Societies:  SHPE de ASU Arizona State University Industrial Engineering 2006  – 2011 Activities and Societies:  SHPE de ASU Arizona State University Industrial Engineering 2006  – 2011 Activities and Societies:  SHPE de ASU ", "Skills Cross-functional Team... Industrial Engineering Six Sigma Lean Manufacturing Manufacturing Kaizen Project Management Process Engineering Engineering Management Operational Excellence Engineering Design of Experiments Quality Management SPC Management Quality System Supply Chain Leadership Analysis Program Management Manufacturing... R&D Process Improvement Systems Engineering Continuous Improvement See 10+     See less Skills  Cross-functional Team... Industrial Engineering Six Sigma Lean Manufacturing Manufacturing Kaizen Project Management Process Engineering Engineering Management Operational Excellence Engineering Design of Experiments Quality Management SPC Management Quality System Supply Chain Leadership Analysis Program Management Manufacturing... R&D Process Improvement Systems Engineering Continuous Improvement See 10+     See less Cross-functional Team... Industrial Engineering Six Sigma Lean Manufacturing Manufacturing Kaizen Project Management Process Engineering Engineering Management Operational Excellence Engineering Design of Experiments Quality Management SPC Management Quality System Supply Chain Leadership Analysis Program Management Manufacturing... R&D Process Improvement Systems Engineering Continuous Improvement See 10+     See less Cross-functional Team... Industrial Engineering Six Sigma Lean Manufacturing Manufacturing Kaizen Project Management Process Engineering Engineering Management Operational Excellence Engineering Design of Experiments Quality Management SPC Management Quality System Supply Chain Leadership Analysis Program Management Manufacturing... R&D Process Improvement Systems Engineering Continuous Improvement See 10+     See less ", "Skills Simulations Design of Experiments Project Management Cross-functional Team... Value Stream Mapping Manufacturing Program Management Testing Lean Manufacturing Forecasting SPC Industrial Engineering Supply Chain Management Six Sigma ERP Semiconductors Reliability VBA Engineering Management Process Engineering Operations Management JMP Supply Chain Product Management Process Improvement Intel Continuous Improvement See 12+     See less Skills  Simulations Design of Experiments Project Management Cross-functional Team... Value Stream Mapping Manufacturing Program Management Testing Lean Manufacturing Forecasting SPC Industrial Engineering Supply Chain Management Six Sigma ERP Semiconductors Reliability VBA Engineering Management Process Engineering Operations Management JMP Supply Chain Product Management Process Improvement Intel Continuous Improvement See 12+     See less Simulations Design of Experiments Project Management Cross-functional Team... Value Stream Mapping Manufacturing Program Management Testing Lean Manufacturing Forecasting SPC Industrial Engineering Supply Chain Management Six Sigma ERP Semiconductors Reliability VBA Engineering Management Process Engineering Operations Management JMP Supply Chain Product Management Process Improvement Intel Continuous Improvement See 12+     See less Simulations Design of Experiments Project Management Cross-functional Team... Value Stream Mapping Manufacturing Program Management Testing Lean Manufacturing Forecasting SPC Industrial Engineering Supply Chain Management Six Sigma ERP Semiconductors Reliability VBA Engineering Management Process Engineering Operations Management JMP Supply Chain Product Management Process Improvement Intel Continuous Improvement See 12+     See less ", "Experience Senior Industrial Engineer Intel Corporation July 2013  – Present (2 years 2 months) Albuquerque, New Mexico Area Responsible for the allocation of capital equipment across Intel's manufacturing facilities to enable reduction of capital spending while supporting fast-paced ramp of latest technologies. Define standards to evaluate Reuse paths and timelines. Provide project management, stakeholder alignment and problem solving. Senior Industrial Engineer Intel Corporation July 2013  – Present (2 years 2 months) Albuquerque, New Mexico Area Responsible for the allocation of capital equipment across Intel's manufacturing facilities to enable reduction of capital spending while supporting fast-paced ramp of latest technologies. Define standards to evaluate Reuse paths and timelines. Provide project management, stakeholder alignment and problem solving. Senior Industrial Engineer Intel Corporation July 2013  – Present (2 years 2 months) Albuquerque, New Mexico Area Responsible for the allocation of capital equipment across Intel's manufacturing facilities to enable reduction of capital spending while supporting fast-paced ramp of latest technologies. Define standards to evaluate Reuse paths and timelines. Provide project management, stakeholder alignment and problem solving. Skills Manufacturing JMP Lean Manufacturing Leadership Semiconductors Cross-functional Team... Industrial Engineering Continuous Improvement Manufacturing... Engineering Management Process Improvement Project Management Engineering Business Process Skills  Manufacturing JMP Lean Manufacturing Leadership Semiconductors Cross-functional Team... Industrial Engineering Continuous Improvement Manufacturing... Engineering Management Process Improvement Project Management Engineering Business Process Manufacturing JMP Lean Manufacturing Leadership Semiconductors Cross-functional Team... Industrial Engineering Continuous Improvement Manufacturing... Engineering Management Process Improvement Project Management Engineering Business Process Manufacturing JMP Lean Manufacturing Leadership Semiconductors Cross-functional Team... Industrial Engineering Continuous Improvement Manufacturing... Engineering Management Process Improvement Project Management Engineering Business Process ", "Experience Line Implementation Project Manager Silverbrook Research November 2010  –  May 2012  (1 year 7 months) North Ryde Industrial Engineer Silverbrook Research November 2008  –  October 2010  (2 years) Strategic Capacity Analyst / Program Manager Intel Corporation August 2005  –  October 2006  (1 year 3 months) Asia Logistics Industrial Engineer Intel Corporation 2004  –  2005  (1 year) Asembly/Test Industrial Engineering Section Head Intel Corporation April 2001  –  May 2004  (3 years 2 months) MANUFACTURING INDUSTRIAL ENGINEER Intel Corporation August 1995  –  April 2001  (5 years 9 months) Philippines Line Implementation Project Manager Silverbrook Research November 2010  –  May 2012  (1 year 7 months) North Ryde Line Implementation Project Manager Silverbrook Research November 2010  –  May 2012  (1 year 7 months) North Ryde Industrial Engineer Silverbrook Research November 2008  –  October 2010  (2 years) Industrial Engineer Silverbrook Research November 2008  –  October 2010  (2 years) Strategic Capacity Analyst / Program Manager Intel Corporation August 2005  –  October 2006  (1 year 3 months) Strategic Capacity Analyst / Program Manager Intel Corporation August 2005  –  October 2006  (1 year 3 months) Asia Logistics Industrial Engineer Intel Corporation 2004  –  2005  (1 year) Asia Logistics Industrial Engineer Intel Corporation 2004  –  2005  (1 year) Asembly/Test Industrial Engineering Section Head Intel Corporation April 2001  –  May 2004  (3 years 2 months) Asembly/Test Industrial Engineering Section Head Intel Corporation April 2001  –  May 2004  (3 years 2 months) MANUFACTURING INDUSTRIAL ENGINEER Intel Corporation August 1995  –  April 2001  (5 years 9 months) Philippines MANUFACTURING INDUSTRIAL ENGINEER Intel Corporation August 1995  –  April 2001  (5 years 9 months) Philippines Languages Filipino English Filipino English Filipino English Skills Lean Manufacturing Manufacturing Continuous Improvement Semiconductors Engineering Management Product Engineering Industrial Engineering Productivity Project Management Managing Start-ups Facility Master Planning Plant Layout Methods Engineering Supply Chain Management Demand Planning Logistics Strategic Planning S&OP implementation Design for Manufacturing Six Sigma R&D See 6+     See less Skills  Lean Manufacturing Manufacturing Continuous Improvement Semiconductors Engineering Management Product Engineering Industrial Engineering Productivity Project Management Managing Start-ups Facility Master Planning Plant Layout Methods Engineering Supply Chain Management Demand Planning Logistics Strategic Planning S&OP implementation Design for Manufacturing Six Sigma R&D See 6+     See less Lean Manufacturing Manufacturing Continuous Improvement Semiconductors Engineering Management Product Engineering Industrial Engineering Productivity Project Management Managing Start-ups Facility Master Planning Plant Layout Methods Engineering Supply Chain Management Demand Planning Logistics Strategic Planning S&OP implementation Design for Manufacturing Six Sigma R&D See 6+     See less Lean Manufacturing Manufacturing Continuous Improvement Semiconductors Engineering Management Product Engineering Industrial Engineering Productivity Project Management Managing Start-ups Facility Master Planning Plant Layout Methods Engineering Supply Chain Management Demand Planning Logistics Strategic Planning S&OP implementation Design for Manufacturing Six Sigma R&D See 6+     See less Education De La Salle University MBA 1998  – 2004 De La Salle University BS 1991  – 1995 De La Salle University MBA 1998  – 2004 De La Salle University MBA 1998  – 2004 De La Salle University MBA 1998  – 2004 De La Salle University BS 1991  – 1995 De La Salle University BS 1991  – 1995 De La Salle University BS 1991  – 1995 ", "Summary Highly qualified Industrial Engineer offering more than 11 years of manufacturing experience with high-volume, technology development, and heavy industrial industries. Customer, results, and team oriented. Implemented lean and continuous improvement. Developed project proposals, drove implementations on time and executed to scope. \n \nSpecialties: Strengths in: Lean, Project Management, Facility Layout Design, Fluency in Mandarin Chinese (written/verbal), Problem Identification/Resolution, Factory Capacity Planning (Strategic/Tactical), Data/System Expert, Tool Construction Coordination, VBA/SQL Summary Highly qualified Industrial Engineer offering more than 11 years of manufacturing experience with high-volume, technology development, and heavy industrial industries. Customer, results, and team oriented. Implemented lean and continuous improvement. Developed project proposals, drove implementations on time and executed to scope. \n \nSpecialties: Strengths in: Lean, Project Management, Facility Layout Design, Fluency in Mandarin Chinese (written/verbal), Problem Identification/Resolution, Factory Capacity Planning (Strategic/Tactical), Data/System Expert, Tool Construction Coordination, VBA/SQL Highly qualified Industrial Engineer offering more than 11 years of manufacturing experience with high-volume, technology development, and heavy industrial industries. Customer, results, and team oriented. Implemented lean and continuous improvement. Developed project proposals, drove implementations on time and executed to scope. \n \nSpecialties: Strengths in: Lean, Project Management, Facility Layout Design, Fluency in Mandarin Chinese (written/verbal), Problem Identification/Resolution, Factory Capacity Planning (Strategic/Tactical), Data/System Expert, Tool Construction Coordination, VBA/SQL Highly qualified Industrial Engineer offering more than 11 years of manufacturing experience with high-volume, technology development, and heavy industrial industries. Customer, results, and team oriented. Implemented lean and continuous improvement. Developed project proposals, drove implementations on time and executed to scope. \n \nSpecialties: Strengths in: Lean, Project Management, Facility Layout Design, Fluency in Mandarin Chinese (written/verbal), Problem Identification/Resolution, Factory Capacity Planning (Strategic/Tactical), Data/System Expert, Tool Construction Coordination, VBA/SQL Experience Layout Coordinator and Industrial Engineer Intel Corporation July 2009  – Present (6 years 2 months) PTD (Portland Technology Development) Layout Coordinator and Industrial Engineer Intel Corporation July 2009  – Present (6 years 2 months) PTD (Portland Technology Development) Layout Coordinator and Industrial Engineer Intel Corporation July 2009  – Present (6 years 2 months) PTD (Portland Technology Development) Languages Chinese Chinese Chinese Skills Lean Manufacturing Project Management Facilities Management Continuous Improvement Kaizen Value Stream Mapping SPC Process Engineering Design of Experiments Manufacturing Six Sigma 5S Root Cause Analysis Process Improvement Cross-functional Team... Industrial Engineering Supply Chain Management Quality Management Operations Management FMEA Electronics Engineering Management Manufacturing... Semiconductors Design for Manufacturing DMAIC JMP Process Simulation Failure Analysis Manufacturing... Engineering Semiconductor Industry See 17+     See less Skills  Lean Manufacturing Project Management Facilities Management Continuous Improvement Kaizen Value Stream Mapping SPC Process Engineering Design of Experiments Manufacturing Six Sigma 5S Root Cause Analysis Process Improvement Cross-functional Team... Industrial Engineering Supply Chain Management Quality Management Operations Management FMEA Electronics Engineering Management Manufacturing... Semiconductors Design for Manufacturing DMAIC JMP Process Simulation Failure Analysis Manufacturing... Engineering Semiconductor Industry See 17+     See less Lean Manufacturing Project Management Facilities Management Continuous Improvement Kaizen Value Stream Mapping SPC Process Engineering Design of Experiments Manufacturing Six Sigma 5S Root Cause Analysis Process Improvement Cross-functional Team... Industrial Engineering Supply Chain Management Quality Management Operations Management FMEA Electronics Engineering Management Manufacturing... Semiconductors Design for Manufacturing DMAIC JMP Process Simulation Failure Analysis Manufacturing... Engineering Semiconductor Industry See 17+     See less Lean Manufacturing Project Management Facilities Management Continuous Improvement Kaizen Value Stream Mapping SPC Process Engineering Design of Experiments Manufacturing Six Sigma 5S Root Cause Analysis Process Improvement Cross-functional Team... Industrial Engineering Supply Chain Management Quality Management Operations Management FMEA Electronics Engineering Management Manufacturing... Semiconductors Design for Manufacturing DMAIC JMP Process Simulation Failure Analysis Manufacturing... Engineering Semiconductor Industry See 17+     See less Education Oregon State University Bachelor 1999  – 2005 Oregon State University Bachelor 1999  – 2004 Oregon State University Bachelor 1999  – 2005 Oregon State University Bachelor 1999  – 2005 Oregon State University Bachelor 1999  – 2005 Oregon State University Bachelor 1999  – 2004 Oregon State University Bachelor 1999  – 2004 Oregon State University Bachelor 1999  – 2004 ", "Experience Strategy Capacity Industrial Engineer at Intel Corporation Intel Corporation January 2014  – Present (1 year 8 months) Incorporate planning scenario into strategic capital plans. Plan and control long range capacity towards transition of new technology, Analyze and optimize tools capital spending and authorization for high management decision regarding strategic plan. Senior capacity analyst Industrial engineer Intel Corporation August 2010  –  January 2014  (3 years 6 months) Responsible for capacity BIG data analysis, model production capacity and optimization. Driving continuous operational excellence, team work and great attention to detail, innovative as part of a global environment. Social and technological Teens Guide Appleseeds Academy February 2009  –  July 2010  (1 year 6 months) beer sheva Providing opportunity for teens aged 14-18 from disadvantaged communities through an empowerment track that combines technological studies with personal and community development. Strategy Capacity Industrial Engineer at Intel Corporation Intel Corporation January 2014  – Present (1 year 8 months) Incorporate planning scenario into strategic capital plans. Plan and control long range capacity towards transition of new technology, Analyze and optimize tools capital spending and authorization for high management decision regarding strategic plan. Strategy Capacity Industrial Engineer at Intel Corporation Intel Corporation January 2014  – Present (1 year 8 months) Incorporate planning scenario into strategic capital plans. Plan and control long range capacity towards transition of new technology, Analyze and optimize tools capital spending and authorization for high management decision regarding strategic plan. Senior capacity analyst Industrial engineer Intel Corporation August 2010  –  January 2014  (3 years 6 months) Responsible for capacity BIG data analysis, model production capacity and optimization. Driving continuous operational excellence, team work and great attention to detail, innovative as part of a global environment. Senior capacity analyst Industrial engineer Intel Corporation August 2010  –  January 2014  (3 years 6 months) Responsible for capacity BIG data analysis, model production capacity and optimization. Driving continuous operational excellence, team work and great attention to detail, innovative as part of a global environment. Social and technological Teens Guide Appleseeds Academy February 2009  –  July 2010  (1 year 6 months) beer sheva Providing opportunity for teens aged 14-18 from disadvantaged communities through an empowerment track that combines technological studies with personal and community development. Social and technological Teens Guide Appleseeds Academy February 2009  –  July 2010  (1 year 6 months) beer sheva Providing opportunity for teens aged 14-18 from disadvantaged communities through an empowerment track that combines technological studies with personal and community development. Languages English Full professional proficiency Spanish Professional working proficiency Hebrew Native or bilingual proficiency English Full professional proficiency Spanish Professional working proficiency Hebrew Native or bilingual proficiency English Full professional proficiency Spanish Professional working proficiency Hebrew Native or bilingual proficiency Full professional proficiency Professional working proficiency Native or bilingual proficiency Skills Business Intelligence SQL Capacity Management Industrial Engineering Semiconductor Industry SSRS Microsoft Excel Manufacturing Cross-functional Team... Engineering Skills  Business Intelligence SQL Capacity Management Industrial Engineering Semiconductor Industry SSRS Microsoft Excel Manufacturing Cross-functional Team... Engineering Business Intelligence SQL Capacity Management Industrial Engineering Semiconductor Industry SSRS Microsoft Excel Manufacturing Cross-functional Team... Engineering Business Intelligence SQL Capacity Management Industrial Engineering Semiconductor Industry SSRS Microsoft Excel Manufacturing Cross-functional Team... Engineering Education Ben-Gurion University of the Negev Master's Degree,  Industrial Engineering 2014  – 2015 specializing in data science and business analytic Ben-Gurion University of the Negev Engineer's Degree,  Industrial Engineering 2006  – 2010 Ben-Gurion University of the Negev Master's Degree,  Industrial Engineering 2014  – 2015 specializing in data science and business analytic Ben-Gurion University of the Negev Master's Degree,  Industrial Engineering 2014  – 2015 specializing in data science and business analytic Ben-Gurion University of the Negev Master's Degree,  Industrial Engineering 2014  – 2015 specializing in data science and business analytic Ben-Gurion University of the Negev Engineer's Degree,  Industrial Engineering 2006  – 2010 Ben-Gurion University of the Negev Engineer's Degree,  Industrial Engineering 2006  – 2010 Ben-Gurion University of the Negev Engineer's Degree,  Industrial Engineering 2006  – 2010 ", "Summary Results oriented Program Manager and Team Leader with extensive experience with Fortune 100 company in Supply Chain Management, Supplier Development and New Product Factory Start-ups. Strong skills in project management, risk assessment and process improvement. Deep experience in factory ramps, supplier health assessments and leading supplier improvement projects. Summary Results oriented Program Manager and Team Leader with extensive experience with Fortune 100 company in Supply Chain Management, Supplier Development and New Product Factory Start-ups. Strong skills in project management, risk assessment and process improvement. Deep experience in factory ramps, supplier health assessments and leading supplier improvement projects. Results oriented Program Manager and Team Leader with extensive experience with Fortune 100 company in Supply Chain Management, Supplier Development and New Product Factory Start-ups. Strong skills in project management, risk assessment and process improvement. Deep experience in factory ramps, supplier health assessments and leading supplier improvement projects. Results oriented Program Manager and Team Leader with extensive experience with Fortune 100 company in Supply Chain Management, Supplier Development and New Product Factory Start-ups. Strong skills in project management, risk assessment and process improvement. Deep experience in factory ramps, supplier health assessments and leading supplier improvement projects. Experience Sr Industrial Engineer M+W Group May 2015  – Present (4 months) Supply Chain Integrator/Site Capital Project Manager Intel Corporation 2012  –  January 2015  (3 years) Chandler, AZ Managed Costa Rica and Penang factory capital equipment supply chain execution including supplier delivery, quality, service and spares. Developed and drove execution of equipment ramp risk assessment and program completion in support of new product startups. Ramp Manager and Supplier Quality Lead Assessor Intel Corporation 2009  –  2012  (3 years) Chandler, AZ Managed equipment supplier ramp readiness for new packaging platform development for Asia factories (Vietnam, Penang, Kulim, Chengdu) for four generations of products (1268-1271 processes). Certified Lead quality assessor for Assembly Test suppliers. Operations and Service Program Manager Intel Corporation 2004  –  2009  (5 years) Chandler, AZ Managed department Operations related programs and Supplier Service improvements. Engineering Area Manager and Equipment Development Platform Manager Intel Corporation 1996  –  2004  (8 years) Chandler, AZ Area manager responsible for commercial and technical management of the Mechanical Assembly/Finish Area including supervision of six equipment development engineers and one commodity manager. Platform managers own coordination of equipment selections, process development modifications, supplier ramp readiness and forecast, order & delivery issue resolutions for Die Prep, Assembly, Test and Finish. Fab 12 Lithography Industrial Engineer Intel Corporation 1995  –  1996  (1 year) Chandler, AZ Provided equipment layouts, subfab layouts, facilities documentation, workstation design, capital funding proposal development, capacity analysis with recommendations and labor modeling for Lithography scanner links and metrology equipment. A4T11 CH10 Assembly Manager Intel Corporation 1994  –  1995  (1 year) Chandler, AZ Managed all aspects of assembly production for military products and engineering builds including sustaining engineering, assembly process improvements, and new product manufacturing engineering. \nSupervised nine assembly technicians and one equipment technician. A4T11 Factory Project Manager/Safety Coordinator Intel Corporation 1991  –  1994  (3 years) Chandler, AZ Responsible for implementing and managing new safety system established to increase the rate of continuous safety improvement in A4T11 factory. Managed Emergency Response Team (ERT) and ergonomic improvement teams including support of cross site improvement teams. Managed manufacturing shutdown activities and facilities project coordination for equipment installations. A4T11 Factory Industrial Engineer Intel Corporation 1990  –  1991  (1 year) Chandler, AZ Responsible for industrial engineering project management on the relocation of the factory from SP1 (CH10) facility to CH4 building.This included project justification, capacity planning, space planning/allocation, layout development, equipment installation management and move-in/startup coordination. 300 major tools move into a 220,000 square foot facility. Received factory recognition award for excellence of end results. A4T11 Factory Industrial Engineer Intel Corporation 1988  –  1990  (2 years) Chandler, AZ Responsible for plant layout, equipment installation, facilities coordination, holiday shutdown management, gown room implementation, cleanliness improvement projects, workstation and methods process improvements. Senior Facilities Planner/Supervisor Intel Corporation 1985  –  1988  (3 years) Chandler, AZ Responsible for facilities planning for Fab 6 including new clean room schematic design, new gown room, wafer fab process equipment installations, block layouts, space allocation, occupancy record maintenance, and administration of weekly projects status meetings. \nSupervision of four facilities planners, supporting six buildings encompassing 850,000 square feet of space. Senior Facilities Planner New Construction Intel Corporation 1984  –  1985  (1 year) Chandler, AZ Responsible for facilities planning for CH3 and CH4 facilities including project architectural programming, schematic design, design development, and construction management. Staff Industrial Engineer/Facilities Planner Storage Technology Corporation 1979  –  1984  (5 years) Louisville, CO Responsible for corporate facilities planning on new construction projects for seven new buildings totaling 1,275,000 square feet. Prepared occupancy audits/reports, developed space standards and productivity measures, conducted vendor evaluations, capacity studies and coordinated & scheduled corporate moves.  \nManagement of divisional facilities planning activities for offices and lab for 200 people. This included project initiation, scheduling, coordination, and management of facilities projects and installations. Sr Industrial Engineer M+W Group May 2015  – Present (4 months) Sr Industrial Engineer M+W Group May 2015  – Present (4 months) Supply Chain Integrator/Site Capital Project Manager Intel Corporation 2012  –  January 2015  (3 years) Chandler, AZ Managed Costa Rica and Penang factory capital equipment supply chain execution including supplier delivery, quality, service and spares. Developed and drove execution of equipment ramp risk assessment and program completion in support of new product startups. Supply Chain Integrator/Site Capital Project Manager Intel Corporation 2012  –  January 2015  (3 years) Chandler, AZ Managed Costa Rica and Penang factory capital equipment supply chain execution including supplier delivery, quality, service and spares. Developed and drove execution of equipment ramp risk assessment and program completion in support of new product startups. Ramp Manager and Supplier Quality Lead Assessor Intel Corporation 2009  –  2012  (3 years) Chandler, AZ Managed equipment supplier ramp readiness for new packaging platform development for Asia factories (Vietnam, Penang, Kulim, Chengdu) for four generations of products (1268-1271 processes). Certified Lead quality assessor for Assembly Test suppliers. Ramp Manager and Supplier Quality Lead Assessor Intel Corporation 2009  –  2012  (3 years) Chandler, AZ Managed equipment supplier ramp readiness for new packaging platform development for Asia factories (Vietnam, Penang, Kulim, Chengdu) for four generations of products (1268-1271 processes). Certified Lead quality assessor for Assembly Test suppliers. Operations and Service Program Manager Intel Corporation 2004  –  2009  (5 years) Chandler, AZ Managed department Operations related programs and Supplier Service improvements. Operations and Service Program Manager Intel Corporation 2004  –  2009  (5 years) Chandler, AZ Managed department Operations related programs and Supplier Service improvements. Engineering Area Manager and Equipment Development Platform Manager Intel Corporation 1996  –  2004  (8 years) Chandler, AZ Area manager responsible for commercial and technical management of the Mechanical Assembly/Finish Area including supervision of six equipment development engineers and one commodity manager. Platform managers own coordination of equipment selections, process development modifications, supplier ramp readiness and forecast, order & delivery issue resolutions for Die Prep, Assembly, Test and Finish. Engineering Area Manager and Equipment Development Platform Manager Intel Corporation 1996  –  2004  (8 years) Chandler, AZ Area manager responsible for commercial and technical management of the Mechanical Assembly/Finish Area including supervision of six equipment development engineers and one commodity manager. Platform managers own coordination of equipment selections, process development modifications, supplier ramp readiness and forecast, order & delivery issue resolutions for Die Prep, Assembly, Test and Finish. Fab 12 Lithography Industrial Engineer Intel Corporation 1995  –  1996  (1 year) Chandler, AZ Provided equipment layouts, subfab layouts, facilities documentation, workstation design, capital funding proposal development, capacity analysis with recommendations and labor modeling for Lithography scanner links and metrology equipment. Fab 12 Lithography Industrial Engineer Intel Corporation 1995  –  1996  (1 year) Chandler, AZ Provided equipment layouts, subfab layouts, facilities documentation, workstation design, capital funding proposal development, capacity analysis with recommendations and labor modeling for Lithography scanner links and metrology equipment. A4T11 CH10 Assembly Manager Intel Corporation 1994  –  1995  (1 year) Chandler, AZ Managed all aspects of assembly production for military products and engineering builds including sustaining engineering, assembly process improvements, and new product manufacturing engineering. \nSupervised nine assembly technicians and one equipment technician. A4T11 CH10 Assembly Manager Intel Corporation 1994  –  1995  (1 year) Chandler, AZ Managed all aspects of assembly production for military products and engineering builds including sustaining engineering, assembly process improvements, and new product manufacturing engineering. \nSupervised nine assembly technicians and one equipment technician. A4T11 Factory Project Manager/Safety Coordinator Intel Corporation 1991  –  1994  (3 years) Chandler, AZ Responsible for implementing and managing new safety system established to increase the rate of continuous safety improvement in A4T11 factory. Managed Emergency Response Team (ERT) and ergonomic improvement teams including support of cross site improvement teams. Managed manufacturing shutdown activities and facilities project coordination for equipment installations. A4T11 Factory Project Manager/Safety Coordinator Intel Corporation 1991  –  1994  (3 years) Chandler, AZ Responsible for implementing and managing new safety system established to increase the rate of continuous safety improvement in A4T11 factory. Managed Emergency Response Team (ERT) and ergonomic improvement teams including support of cross site improvement teams. Managed manufacturing shutdown activities and facilities project coordination for equipment installations. A4T11 Factory Industrial Engineer Intel Corporation 1990  –  1991  (1 year) Chandler, AZ Responsible for industrial engineering project management on the relocation of the factory from SP1 (CH10) facility to CH4 building.This included project justification, capacity planning, space planning/allocation, layout development, equipment installation management and move-in/startup coordination. 300 major tools move into a 220,000 square foot facility. Received factory recognition award for excellence of end results. A4T11 Factory Industrial Engineer Intel Corporation 1990  –  1991  (1 year) Chandler, AZ Responsible for industrial engineering project management on the relocation of the factory from SP1 (CH10) facility to CH4 building.This included project justification, capacity planning, space planning/allocation, layout development, equipment installation management and move-in/startup coordination. 300 major tools move into a 220,000 square foot facility. Received factory recognition award for excellence of end results. A4T11 Factory Industrial Engineer Intel Corporation 1988  –  1990  (2 years) Chandler, AZ Responsible for plant layout, equipment installation, facilities coordination, holiday shutdown management, gown room implementation, cleanliness improvement projects, workstation and methods process improvements. A4T11 Factory Industrial Engineer Intel Corporation 1988  –  1990  (2 years) Chandler, AZ Responsible for plant layout, equipment installation, facilities coordination, holiday shutdown management, gown room implementation, cleanliness improvement projects, workstation and methods process improvements. Senior Facilities Planner/Supervisor Intel Corporation 1985  –  1988  (3 years) Chandler, AZ Responsible for facilities planning for Fab 6 including new clean room schematic design, new gown room, wafer fab process equipment installations, block layouts, space allocation, occupancy record maintenance, and administration of weekly projects status meetings. \nSupervision of four facilities planners, supporting six buildings encompassing 850,000 square feet of space. Senior Facilities Planner/Supervisor Intel Corporation 1985  –  1988  (3 years) Chandler, AZ Responsible for facilities planning for Fab 6 including new clean room schematic design, new gown room, wafer fab process equipment installations, block layouts, space allocation, occupancy record maintenance, and administration of weekly projects status meetings. \nSupervision of four facilities planners, supporting six buildings encompassing 850,000 square feet of space. Senior Facilities Planner New Construction Intel Corporation 1984  –  1985  (1 year) Chandler, AZ Responsible for facilities planning for CH3 and CH4 facilities including project architectural programming, schematic design, design development, and construction management. Senior Facilities Planner New Construction Intel Corporation 1984  –  1985  (1 year) Chandler, AZ Responsible for facilities planning for CH3 and CH4 facilities including project architectural programming, schematic design, design development, and construction management. Staff Industrial Engineer/Facilities Planner Storage Technology Corporation 1979  –  1984  (5 years) Louisville, CO Responsible for corporate facilities planning on new construction projects for seven new buildings totaling 1,275,000 square feet. Prepared occupancy audits/reports, developed space standards and productivity measures, conducted vendor evaluations, capacity studies and coordinated & scheduled corporate moves.  \nManagement of divisional facilities planning activities for offices and lab for 200 people. This included project initiation, scheduling, coordination, and management of facilities projects and installations. Staff Industrial Engineer/Facilities Planner Storage Technology Corporation 1979  –  1984  (5 years) Louisville, CO Responsible for corporate facilities planning on new construction projects for seven new buildings totaling 1,275,000 square feet. Prepared occupancy audits/reports, developed space standards and productivity measures, conducted vendor evaluations, capacity studies and coordinated & scheduled corporate moves.  \nManagement of divisional facilities planning activities for offices and lab for 200 people. This included project initiation, scheduling, coordination, and management of facilities projects and installations. Skills Semiconductors Manufacturing Product Development Cross-functional Team... Lean Manufacturing SPC Failure Analysis Six Sigma Design of Experiments Engineering Management Program Management Semiconductor Industry FMEA Continuous Improvement Process Engineering Skills  Semiconductors Manufacturing Product Development Cross-functional Team... Lean Manufacturing SPC Failure Analysis Six Sigma Design of Experiments Engineering Management Program Management Semiconductor Industry FMEA Continuous Improvement Process Engineering Semiconductors Manufacturing Product Development Cross-functional Team... Lean Manufacturing SPC Failure Analysis Six Sigma Design of Experiments Engineering Management Program Management Semiconductor Industry FMEA Continuous Improvement Process Engineering Semiconductors Manufacturing Product Development Cross-functional Team... Lean Manufacturing SPC Failure Analysis Six Sigma Design of Experiments Engineering Management Program Management Semiconductor Industry FMEA Continuous Improvement Process Engineering Education Arizona State University BS,  Engineering - Technical Management University of Phoenix MBA,  Masters of Business Administration Arizona State University BS,  Engineering - Technical Management Arizona State University BS,  Engineering - Technical Management Arizona State University BS,  Engineering - Technical Management University of Phoenix MBA,  Masters of Business Administration University of Phoenix MBA,  Masters of Business Administration University of Phoenix MBA,  Masters of Business Administration ", "Experience Industrial Engineer Intel Corporation March 2008  – Present (7 years 6 months) Chandler, AZ Operations Support Engineer Evoqua Water Technologies January 2002  –  February 2008  (6 years 2 months) Rockford, Illinois Area Formerly Siemens Water Technologies, USFilter Industrial Engineer Intel Corporation August 1997  –  August 2001  (4 years 1 month) Chandler, AZ Industrial Engineer Walt Disney World August 1996  –  July 1997  (1 year) Lake Buena Vista, FL Internship Industrial Engineer Intel Corporation March 2008  – Present (7 years 6 months) Chandler, AZ Industrial Engineer Intel Corporation March 2008  – Present (7 years 6 months) Chandler, AZ Operations Support Engineer Evoqua Water Technologies January 2002  –  February 2008  (6 years 2 months) Rockford, Illinois Area Formerly Siemens Water Technologies, USFilter Operations Support Engineer Evoqua Water Technologies January 2002  –  February 2008  (6 years 2 months) Rockford, Illinois Area Formerly Siemens Water Technologies, USFilter Industrial Engineer Intel Corporation August 1997  –  August 2001  (4 years 1 month) Chandler, AZ Industrial Engineer Intel Corporation August 1997  –  August 2001  (4 years 1 month) Chandler, AZ Industrial Engineer Walt Disney World August 1996  –  July 1997  (1 year) Lake Buena Vista, FL Internship Industrial Engineer Walt Disney World August 1996  –  July 1997  (1 year) Lake Buena Vista, FL Internship Skills Semiconductors Semiconductor Industry Design of Experiments SPC Lean Manufacturing Manufacturing Intel Industrial Engineering Engineering Continuous Improvement Skills  Semiconductors Semiconductor Industry Design of Experiments SPC Lean Manufacturing Manufacturing Intel Industrial Engineering Engineering Continuous Improvement Semiconductors Semiconductor Industry Design of Experiments SPC Lean Manufacturing Manufacturing Intel Industrial Engineering Engineering Continuous Improvement Semiconductors Semiconductor Industry Design of Experiments SPC Lean Manufacturing Manufacturing Intel Industrial Engineering Engineering Continuous Improvement Education University of Florida Bachelor's of Science,  Industrial and Systems Engineering 1992  – 1996 Operations Research, Total Quality Management, Facility Planning and Material Handling, Production and Inventory Control, Statistics, Work Design and Human Factors, Simulation, Engineering Economy Activities and Societies:  Phi Gamma Delta Fraternity\nAlpha Pi Mu (Industrial & Systems Engineering honor society) The Peddie School High School University of Florida Bachelor's of Science,  Industrial and Systems Engineering 1992  – 1996 Operations Research, Total Quality Management, Facility Planning and Material Handling, Production and Inventory Control, Statistics, Work Design and Human Factors, Simulation, Engineering Economy Activities and Societies:  Phi Gamma Delta Fraternity\nAlpha Pi Mu (Industrial & Systems Engineering honor society) University of Florida Bachelor's of Science,  Industrial and Systems Engineering 1992  – 1996 Operations Research, Total Quality Management, Facility Planning and Material Handling, Production and Inventory Control, Statistics, Work Design and Human Factors, Simulation, Engineering Economy Activities and Societies:  Phi Gamma Delta Fraternity\nAlpha Pi Mu (Industrial & Systems Engineering honor society) University of Florida Bachelor's of Science,  Industrial and Systems Engineering 1992  – 1996 Operations Research, Total Quality Management, Facility Planning and Material Handling, Production and Inventory Control, Statistics, Work Design and Human Factors, Simulation, Engineering Economy Activities and Societies:  Phi Gamma Delta Fraternity\nAlpha Pi Mu (Industrial & Systems Engineering honor society) The Peddie School High School The Peddie School High School The Peddie School High School ", "Experience Industrial Engineer Intel Corporation October 2011  – Present (3 years 11 months) Phoenix, Arizona Area Work on new equipment development for new technology. She is the key contributor of parameters that can help identify cost improvements or close the cost gap on current targets. She also managed supplier capital forecast to ensure supplier capability are in place and can react to factory needs Industrial Engineer Group Leader Intel Corporation June 2010  –  October 2011  (1 year 5 months) Ho Chi Minh City, Vietnam Focused on strategic and tactical capacity planning as well as forecast for buy new and reuse capital tools and tool delivery. Coached her team on documenting business processes, continuous improvement for their own work. Industrial Engineer Intel Corporation July 2007  –  June 2010  (3 years) Ho Chi Minh City, Vietnam Worked on capacity planning for both strategic and tactical horizon for the start-up production line. Analyzed the implication of mini-factory layout concept and proposed the capital-neutralized roadmap for Vietnam Production lines.  \nWorked with different departments (Manufacturing, Planning, Materials) to finalize the business process for capacity response in tactical horizon Assistant Planning Manager adidas group April 2007  –  June 2007  (3 months) Ho Chi Minh City, Vietnam Ensure customer demands are met in the planning process and monitor the progress to make sure team gets directions. Coordinate with Production Department to make sure factory output meet customers’ orders like special/expedite requests or next-season shoe samples to Sales offices in the US Industrial Engineer Intel Corporation October 2011  – Present (3 years 11 months) Phoenix, Arizona Area Work on new equipment development for new technology. She is the key contributor of parameters that can help identify cost improvements or close the cost gap on current targets. She also managed supplier capital forecast to ensure supplier capability are in place and can react to factory needs Industrial Engineer Intel Corporation October 2011  – Present (3 years 11 months) Phoenix, Arizona Area Work on new equipment development for new technology. She is the key contributor of parameters that can help identify cost improvements or close the cost gap on current targets. She also managed supplier capital forecast to ensure supplier capability are in place and can react to factory needs Industrial Engineer Group Leader Intel Corporation June 2010  –  October 2011  (1 year 5 months) Ho Chi Minh City, Vietnam Focused on strategic and tactical capacity planning as well as forecast for buy new and reuse capital tools and tool delivery. Coached her team on documenting business processes, continuous improvement for their own work. Industrial Engineer Group Leader Intel Corporation June 2010  –  October 2011  (1 year 5 months) Ho Chi Minh City, Vietnam Focused on strategic and tactical capacity planning as well as forecast for buy new and reuse capital tools and tool delivery. Coached her team on documenting business processes, continuous improvement for their own work. Industrial Engineer Intel Corporation July 2007  –  June 2010  (3 years) Ho Chi Minh City, Vietnam Worked on capacity planning for both strategic and tactical horizon for the start-up production line. Analyzed the implication of mini-factory layout concept and proposed the capital-neutralized roadmap for Vietnam Production lines.  \nWorked with different departments (Manufacturing, Planning, Materials) to finalize the business process for capacity response in tactical horizon Industrial Engineer Intel Corporation July 2007  –  June 2010  (3 years) Ho Chi Minh City, Vietnam Worked on capacity planning for both strategic and tactical horizon for the start-up production line. Analyzed the implication of mini-factory layout concept and proposed the capital-neutralized roadmap for Vietnam Production lines.  \nWorked with different departments (Manufacturing, Planning, Materials) to finalize the business process for capacity response in tactical horizon Assistant Planning Manager adidas group April 2007  –  June 2007  (3 months) Ho Chi Minh City, Vietnam Ensure customer demands are met in the planning process and monitor the progress to make sure team gets directions. Coordinate with Production Department to make sure factory output meet customers’ orders like special/expedite requests or next-season shoe samples to Sales offices in the US Assistant Planning Manager adidas group April 2007  –  June 2007  (3 months) Ho Chi Minh City, Vietnam Ensure customer demands are met in the planning process and monitor the progress to make sure team gets directions. Coordinate with Production Department to make sure factory output meet customers’ orders like special/expedite requests or next-season shoe samples to Sales offices in the US Skills Design of Experiments JMP Lean Manufacturing Manufacturing Engineering Management Skills  Design of Experiments JMP Lean Manufacturing Manufacturing Engineering Management Design of Experiments JMP Lean Manufacturing Manufacturing Engineering Management Design of Experiments JMP Lean Manufacturing Manufacturing Engineering Management Education University of Michigan College of Engineering Master's degree,  Industrial Engineering 2004  – 2006 Ho Chi Minh CIty University of Techonology Bachelor's degree,  Chemical Engineering 1998  – 2003 University of Michigan College of Engineering Master's degree,  Industrial Engineering 2004  – 2006 University of Michigan College of Engineering Master's degree,  Industrial Engineering 2004  – 2006 University of Michigan College of Engineering Master's degree,  Industrial Engineering 2004  – 2006 Ho Chi Minh CIty University of Techonology Bachelor's degree,  Chemical Engineering 1998  – 2003 Ho Chi Minh CIty University of Techonology Bachelor's degree,  Chemical Engineering 1998  – 2003 Ho Chi Minh CIty University of Techonology Bachelor's degree,  Chemical Engineering 1998  – 2003 ", "Languages Spanish, German Spanish, German Spanish, German Skills Environmental Awareness Data Analysis Semiconductors Program Management Project Management Microsoft Office ArcGIS Water Construction AutoCAD Technical Writing Engineering Consulting Engineers Engineering Simulations Design of Experiments Wastewater Treatment... Algorithms Statistics Product Management Hydrology Remediation Industrial Sales Water Resources Sales Watershed Nutrient... See 11+     See less Skills  Environmental Awareness Data Analysis Semiconductors Program Management Project Management Microsoft Office ArcGIS Water Construction AutoCAD Technical Writing Engineering Consulting Engineers Engineering Simulations Design of Experiments Wastewater Treatment... Algorithms Statistics Product Management Hydrology Remediation Industrial Sales Water Resources Sales Watershed Nutrient... See 11+     See less Environmental Awareness Data Analysis Semiconductors Program Management Project Management Microsoft Office ArcGIS Water Construction AutoCAD Technical Writing Engineering Consulting Engineers Engineering Simulations Design of Experiments Wastewater Treatment... Algorithms Statistics Product Management Hydrology Remediation Industrial Sales Water Resources Sales Watershed Nutrient... See 11+     See less Environmental Awareness Data Analysis Semiconductors Program Management Project Management Microsoft Office ArcGIS Water Construction AutoCAD Technical Writing Engineering Consulting Engineers Engineering Simulations Design of Experiments Wastewater Treatment... Algorithms Statistics Product Management Hydrology Remediation Industrial Sales Water Resources Sales Watershed Nutrient... See 11+     See less "]}