{"position": "Investment Analyst", "company": "Intel Corporation", "profiles": ["Summary Third year student at the University of Exeter, currently on an industrial placement at Intel Corporation, averaging a 2:1. Summary Third year student at the University of Exeter, currently on an industrial placement at Intel Corporation, averaging a 2:1. Third year student at the University of Exeter, currently on an industrial placement at Intel Corporation, averaging a 2:1. Third year student at the University of Exeter, currently on an industrial placement at Intel Corporation, averaging a 2:1. Experience Channel Investment Analyst Intel Corporation July 2015  – Present (2 months) Swindon, United Kingdom Waitress Exclusive Hotels and Venues May 2013  –  April 2015  (2 years) The Manor House Hotel, Castle Combe Part- time work in University breaks: Serving food and drinks, bar work, cleaning, setting up rooms for events. Public Relations The Big Bang South West January 2014  –  April 2014  (4 months) I partook in a work experience with this social enterprise, this involved doing PR work and attending events talking to attendees about their thoughts on the day, I then wrote articles on this. I also helped organise the events and regularly worked in the office writing various reports on the current news involving the Big Bang events. Crew Member McDonald's Europe Ltd. May 2012  –  November 2012  (7 months) Chippenham, Wiltshire Till work - taking orders and putting them together, cleaning Channel Investment Analyst Intel Corporation July 2015  – Present (2 months) Swindon, United Kingdom Channel Investment Analyst Intel Corporation July 2015  – Present (2 months) Swindon, United Kingdom Waitress Exclusive Hotels and Venues May 2013  –  April 2015  (2 years) The Manor House Hotel, Castle Combe Part- time work in University breaks: Serving food and drinks, bar work, cleaning, setting up rooms for events. Waitress Exclusive Hotels and Venues May 2013  –  April 2015  (2 years) The Manor House Hotel, Castle Combe Part- time work in University breaks: Serving food and drinks, bar work, cleaning, setting up rooms for events. Public Relations The Big Bang South West January 2014  –  April 2014  (4 months) I partook in a work experience with this social enterprise, this involved doing PR work and attending events talking to attendees about their thoughts on the day, I then wrote articles on this. I also helped organise the events and regularly worked in the office writing various reports on the current news involving the Big Bang events. Public Relations The Big Bang South West January 2014  –  April 2014  (4 months) I partook in a work experience with this social enterprise, this involved doing PR work and attending events talking to attendees about their thoughts on the day, I then wrote articles on this. I also helped organise the events and regularly worked in the office writing various reports on the current news involving the Big Bang events. Crew Member McDonald's Europe Ltd. May 2012  –  November 2012  (7 months) Chippenham, Wiltshire Till work - taking orders and putting them together, cleaning Crew Member McDonald's Europe Ltd. May 2012  –  November 2012  (7 months) Chippenham, Wiltshire Till work - taking orders and putting them together, cleaning Languages English Native or bilingual proficiency English Native or bilingual proficiency English Native or bilingual proficiency Native or bilingual proficiency Skills Team Leadership Leadership Editing Social Networking Facebook Photography Marketing Public Relations Customer Service Microsoft Excel Microsoft Office Microsoft Word PowerPoint Event Management Management Communication Strategic Planning Project Management See 3+     See less Skills  Team Leadership Leadership Editing Social Networking Facebook Photography Marketing Public Relations Customer Service Microsoft Excel Microsoft Office Microsoft Word PowerPoint Event Management Management Communication Strategic Planning Project Management See 3+     See less Team Leadership Leadership Editing Social Networking Facebook Photography Marketing Public Relations Customer Service Microsoft Excel Microsoft Office Microsoft Word PowerPoint Event Management Management Communication Strategic Planning Project Management See 3+     See less Team Leadership Leadership Editing Social Networking Facebook Photography Marketing Public Relations Customer Service Microsoft Excel Microsoft Office Microsoft Word PowerPoint Event Management Management Communication Strategic Planning Project Management See 3+     See less Education University of Exeter BA Business and Management With Industrial Experience,  Business , Management, Marketing, and Related Support Services 2013  – 2017 Modules: \nOperations Management \nOrganisational Behaviour \nManagerial Accounting \nInternational Tourism Management \nConsumer Behaviour \nHuman Resource Management \nMarketing & Society \nLeadership Challenges and Practices Sheldon School 2011  – 2013 A Levels \n \nPsychology - A \nHistory - A* \nBusiness Studies - A* University of Exeter BA Business and Management With Industrial Experience,  Business , Management, Marketing, and Related Support Services 2013  – 2017 Modules: \nOperations Management \nOrganisational Behaviour \nManagerial Accounting \nInternational Tourism Management \nConsumer Behaviour \nHuman Resource Management \nMarketing & Society \nLeadership Challenges and Practices University of Exeter BA Business and Management With Industrial Experience,  Business , Management, Marketing, and Related Support Services 2013  – 2017 Modules: \nOperations Management \nOrganisational Behaviour \nManagerial Accounting \nInternational Tourism Management \nConsumer Behaviour \nHuman Resource Management \nMarketing & Society \nLeadership Challenges and Practices University of Exeter BA Business and Management With Industrial Experience,  Business , Management, Marketing, and Related Support Services 2013  – 2017 Modules: \nOperations Management \nOrganisational Behaviour \nManagerial Accounting \nInternational Tourism Management \nConsumer Behaviour \nHuman Resource Management \nMarketing & Society \nLeadership Challenges and Practices Sheldon School 2011  – 2013 A Levels \n \nPsychology - A \nHistory - A* \nBusiness Studies - A* Sheldon School 2011  – 2013 A Levels \n \nPsychology - A \nHistory - A* \nBusiness Studies - A* Sheldon School 2011  – 2013 A Levels \n \nPsychology - A \nHistory - A* \nBusiness Studies - A* Honors & Awards ", "Summary Experience includes complex investments, financing and risk management strategies of a large multinational corporation, Balance Sheet and Cash Flow hedging, debt issuance, fair valuation, accounting control structure organization and auditing, SEC / GAAP guidance interpretation and financial statement reporting, cash flow forecasting of a $20 billion organizational unit, accounting and operational policy setting and compliance, project and people management, and training professionals on highly complex topics. Summary Experience includes complex investments, financing and risk management strategies of a large multinational corporation, Balance Sheet and Cash Flow hedging, debt issuance, fair valuation, accounting control structure organization and auditing, SEC / GAAP guidance interpretation and financial statement reporting, cash flow forecasting of a $20 billion organizational unit, accounting and operational policy setting and compliance, project and people management, and training professionals on highly complex topics. Experience includes complex investments, financing and risk management strategies of a large multinational corporation, Balance Sheet and Cash Flow hedging, debt issuance, fair valuation, accounting control structure organization and auditing, SEC / GAAP guidance interpretation and financial statement reporting, cash flow forecasting of a $20 billion organizational unit, accounting and operational policy setting and compliance, project and people management, and training professionals on highly complex topics. Experience includes complex investments, financing and risk management strategies of a large multinational corporation, Balance Sheet and Cash Flow hedging, debt issuance, fair valuation, accounting control structure organization and auditing, SEC / GAAP guidance interpretation and financial statement reporting, cash flow forecasting of a $20 billion organizational unit, accounting and operational policy setting and compliance, project and people management, and training professionals on highly complex topics. Experience Treasury Accounting Manager Intel Corporation August 2011  – Present (4 years 1 month) Internal Auditor Intel Corporation May 2008  –  August 2011  (3 years 4 months) Sr. Foreign Exchange, Hedging & Derivative Analyst Intel Corporation January 2007  –  April 2008  (1 year 4 months) Sr. Investment Analyst Intel Corporation February 2005  –  December 2006  (1 year 11 months) Financial Statement Analyst Intel Corporation April 2003  –  January 2005  (1 year 10 months) Financial Statement Assurance Intern KPMG June 2001  –  September 2001  (4 months) Treasury Accounting Manager Intel Corporation August 2011  – Present (4 years 1 month) Treasury Accounting Manager Intel Corporation August 2011  – Present (4 years 1 month) Internal Auditor Intel Corporation May 2008  –  August 2011  (3 years 4 months) Internal Auditor Intel Corporation May 2008  –  August 2011  (3 years 4 months) Sr. Foreign Exchange, Hedging & Derivative Analyst Intel Corporation January 2007  –  April 2008  (1 year 4 months) Sr. Foreign Exchange, Hedging & Derivative Analyst Intel Corporation January 2007  –  April 2008  (1 year 4 months) Sr. Investment Analyst Intel Corporation February 2005  –  December 2006  (1 year 11 months) Sr. Investment Analyst Intel Corporation February 2005  –  December 2006  (1 year 11 months) Financial Statement Analyst Intel Corporation April 2003  –  January 2005  (1 year 10 months) Financial Statement Analyst Intel Corporation April 2003  –  January 2005  (1 year 10 months) Financial Statement Assurance Intern KPMG June 2001  –  September 2001  (4 months) Financial Statement Assurance Intern KPMG June 2001  –  September 2001  (4 months) Languages Hungarian Hungarian Hungarian Skills Accounting Auditing Finance Internal Audit Risk Management Cash Flow GAAP Management Investments Financial Statements Training Financial Analysis Financial Reporting Skills  Accounting Auditing Finance Internal Audit Risk Management Cash Flow GAAP Management Investments Financial Statements Training Financial Analysis Financial Reporting Accounting Auditing Finance Internal Audit Risk Management Cash Flow GAAP Management Investments Financial Statements Training Financial Analysis Financial Reporting Accounting Auditing Finance Internal Audit Risk Management Cash Flow GAAP Management Investments Financial Statements Training Financial Analysis Financial Reporting Education University of Portland MBA,  Finance 2008  – 2010 Portland State University - School of Business B.S.,  Accounting 2000  – 2003 Activities and Societies:  Beta Alpha Psi Portland State University - School of Business B.S.,  Finance 2000  – 2003 University of Portland MBA,  Finance 2008  – 2010 University of Portland MBA,  Finance 2008  – 2010 University of Portland MBA,  Finance 2008  – 2010 Portland State University - School of Business B.S.,  Accounting 2000  – 2003 Activities and Societies:  Beta Alpha Psi Portland State University - School of Business B.S.,  Accounting 2000  – 2003 Activities and Societies:  Beta Alpha Psi Portland State University - School of Business B.S.,  Accounting 2000  – 2003 Activities and Societies:  Beta Alpha Psi Portland State University - School of Business B.S.,  Finance 2000  – 2003 Portland State University - School of Business B.S.,  Finance 2000  – 2003 Portland State University - School of Business B.S.,  Finance 2000  – 2003 Honors & Awards Additional Honors & Awards Financial Executives International Medallion Award Recipient Additional Honors & Awards Financial Executives International Medallion Award Recipient Additional Honors & Awards Financial Executives International Medallion Award Recipient Additional Honors & Awards Financial Executives International Medallion Award Recipient ", "Skills Supply Chain Finance Financial Modeling Financial Analysis Forecasting Cross-functional Team... Competitive Analysis Skills  Supply Chain Finance Financial Modeling Financial Analysis Forecasting Cross-functional Team... Competitive Analysis Supply Chain Finance Financial Modeling Financial Analysis Forecasting Cross-functional Team... Competitive Analysis Supply Chain Finance Financial Modeling Financial Analysis Forecasting Cross-functional Team... Competitive Analysis ", "Summary I am a finance professional with 4+ years of experience in finance and accounting fields. I have education background in finance, accounting, and computer science. I am an expert in financial analysis, investment valuation, as well as budgeting and planning. My key skill sets include statistical analysis, problem solving, process improvement, business partnership, as well as strategic thinking. Summary I am a finance professional with 4+ years of experience in finance and accounting fields. I have education background in finance, accounting, and computer science. I am an expert in financial analysis, investment valuation, as well as budgeting and planning. My key skill sets include statistical analysis, problem solving, process improvement, business partnership, as well as strategic thinking. I am a finance professional with 4+ years of experience in finance and accounting fields. I have education background in finance, accounting, and computer science. I am an expert in financial analysis, investment valuation, as well as budgeting and planning. My key skill sets include statistical analysis, problem solving, process improvement, business partnership, as well as strategic thinking. I am a finance professional with 4+ years of experience in finance and accounting fields. I have education background in finance, accounting, and computer science. I am an expert in financial analysis, investment valuation, as well as budgeting and planning. My key skill sets include statistical analysis, problem solving, process improvement, business partnership, as well as strategic thinking. Experience Sr. Financial Analyst Oracle November 2014  – Present (10 months) San Francisco Bay Area Sr. Lead Financial Analyst- Cloud Computing Intel Corporation February 2014  –  October 2014  (9 months) ○Led two financial analysts to prepare close summary package and present results to finance V.P. \n \n○ Managed budgets for 10+ divisions with $250M+ annual spending. Analyzed patterns and offered guidance to division VPs for spending management. Provided VPs with cost saving recommendations \n \n○ Partnered with division VPs to formulate spending and headcount needs for future periods. Assisted in prioritizing projects and allocated resources based on prioritization Treasury Intel Capital (Strategic Investment) Analyst Intel Corporation August 2012  –  February 2014  (1 year 7 months) o Assessed fair valuation for private investments and worked with investment managers to resolve valuation differences. This requires an in-depth understanding of investment valuation and allocation methodologies\t \n \no Evaluated Marked-to-Market gain and losses for investments and derivatives (50+ companies with $100M+/quarter) and reviewed classification for appropriateness  \n \no Performed monthly reconciliations for all strategic investment related accounts ($5B+) and worked with business partners to address material differences.  \n \no Assisted management in decision making by using statistical and scenario analysis in various projects Risks and Controls Analyst Intel September 2010  –  August 2012  (2 years) o Managed financial information system and partnered with IT and global site representatives to address questions and issues. Created knowledge base to serve as user job aid and reduced questions and issues by 60%-70%, driving time savings for both business partners and management \n \no Delivered periodic process reviews to senior management and stakeholders. Aligned people on system performance and environmental changes, and proposed meaningful recommendations to drive system efficiency and enhancement \n \no Recognized patterns when reviewing access for cross application conflicts. Created mapping based on patterns and automated reviewing processes, resulting in 100+ hour annual savings \n \no Audited reconciliations on a monthly basis and facilitated SOX reliance on reconciliations. Provided meaningful recommendation to improve efficiency and effectives of reconciliations Sr. Financial Analyst Oracle November 2014  – Present (10 months) San Francisco Bay Area Sr. Financial Analyst Oracle November 2014  – Present (10 months) San Francisco Bay Area Sr. Lead Financial Analyst- Cloud Computing Intel Corporation February 2014  –  October 2014  (9 months) ○Led two financial analysts to prepare close summary package and present results to finance V.P. \n \n○ Managed budgets for 10+ divisions with $250M+ annual spending. Analyzed patterns and offered guidance to division VPs for spending management. Provided VPs with cost saving recommendations \n \n○ Partnered with division VPs to formulate spending and headcount needs for future periods. Assisted in prioritizing projects and allocated resources based on prioritization Sr. Lead Financial Analyst- Cloud Computing Intel Corporation February 2014  –  October 2014  (9 months) ○Led two financial analysts to prepare close summary package and present results to finance V.P. \n \n○ Managed budgets for 10+ divisions with $250M+ annual spending. Analyzed patterns and offered guidance to division VPs for spending management. Provided VPs with cost saving recommendations \n \n○ Partnered with division VPs to formulate spending and headcount needs for future periods. Assisted in prioritizing projects and allocated resources based on prioritization Treasury Intel Capital (Strategic Investment) Analyst Intel Corporation August 2012  –  February 2014  (1 year 7 months) o Assessed fair valuation for private investments and worked with investment managers to resolve valuation differences. This requires an in-depth understanding of investment valuation and allocation methodologies\t \n \no Evaluated Marked-to-Market gain and losses for investments and derivatives (50+ companies with $100M+/quarter) and reviewed classification for appropriateness  \n \no Performed monthly reconciliations for all strategic investment related accounts ($5B+) and worked with business partners to address material differences.  \n \no Assisted management in decision making by using statistical and scenario analysis in various projects Treasury Intel Capital (Strategic Investment) Analyst Intel Corporation August 2012  –  February 2014  (1 year 7 months) o Assessed fair valuation for private investments and worked with investment managers to resolve valuation differences. This requires an in-depth understanding of investment valuation and allocation methodologies\t \n \no Evaluated Marked-to-Market gain and losses for investments and derivatives (50+ companies with $100M+/quarter) and reviewed classification for appropriateness  \n \no Performed monthly reconciliations for all strategic investment related accounts ($5B+) and worked with business partners to address material differences.  \n \no Assisted management in decision making by using statistical and scenario analysis in various projects Risks and Controls Analyst Intel September 2010  –  August 2012  (2 years) o Managed financial information system and partnered with IT and global site representatives to address questions and issues. Created knowledge base to serve as user job aid and reduced questions and issues by 60%-70%, driving time savings for both business partners and management \n \no Delivered periodic process reviews to senior management and stakeholders. Aligned people on system performance and environmental changes, and proposed meaningful recommendations to drive system efficiency and enhancement \n \no Recognized patterns when reviewing access for cross application conflicts. Created mapping based on patterns and automated reviewing processes, resulting in 100+ hour annual savings \n \no Audited reconciliations on a monthly basis and facilitated SOX reliance on reconciliations. Provided meaningful recommendation to improve efficiency and effectives of reconciliations Risks and Controls Analyst Intel September 2010  –  August 2012  (2 years) o Managed financial information system and partnered with IT and global site representatives to address questions and issues. Created knowledge base to serve as user job aid and reduced questions and issues by 60%-70%, driving time savings for both business partners and management \n \no Delivered periodic process reviews to senior management and stakeholders. Aligned people on system performance and environmental changes, and proposed meaningful recommendations to drive system efficiency and enhancement \n \no Recognized patterns when reviewing access for cross application conflicts. Created mapping based on patterns and automated reviewing processes, resulting in 100+ hour annual savings \n \no Audited reconciliations on a monthly basis and facilitated SOX reliance on reconciliations. Provided meaningful recommendation to improve efficiency and effectives of reconciliations Languages Chinese Chinese Chinese Skills Sarbanes-Oxley Act Financial Analysis Financial Modeling Accounting Valuation Internal Controls Corporate Finance Access Financial Reporting Auditing Microsoft Excel PowerPoint Process Improvement Finance US GAAP VBA Excel Pivot Variance Analysis Account Reconciliation NPV IRR Inventory Valuation Investments C++ Macro Analysis Strategic Planning Hedging Photoshop Illustrator Flash Authorware Python Java See 19+     See less Skills  Sarbanes-Oxley Act Financial Analysis Financial Modeling Accounting Valuation Internal Controls Corporate Finance Access Financial Reporting Auditing Microsoft Excel PowerPoint Process Improvement Finance US GAAP VBA Excel Pivot Variance Analysis Account Reconciliation NPV IRR Inventory Valuation Investments C++ Macro Analysis Strategic Planning Hedging Photoshop Illustrator Flash Authorware Python Java See 19+     See less Sarbanes-Oxley Act Financial Analysis Financial Modeling Accounting Valuation Internal Controls Corporate Finance Access Financial Reporting Auditing Microsoft Excel PowerPoint Process Improvement Finance US GAAP VBA Excel Pivot Variance Analysis Account Reconciliation NPV IRR Inventory Valuation Investments C++ Macro Analysis Strategic Planning Hedging Photoshop Illustrator Flash Authorware Python Java See 19+     See less Sarbanes-Oxley Act Financial Analysis Financial Modeling Accounting Valuation Internal Controls Corporate Finance Access Financial Reporting Auditing Microsoft Excel PowerPoint Process Improvement Finance US GAAP VBA Excel Pivot Variance Analysis Account Reconciliation NPV IRR Inventory Valuation Investments C++ Macro Analysis Strategic Planning Hedging Photoshop Illustrator Flash Authorware Python Java See 19+     See less Education The Johns Hopkins University Master's Degree,  Computer Science 2014  – 2016 CFA Level 3 Candidate 2015 The University of Texas at Austin MPA (Master of Professsional Accounting),  Accounting 2009  – 2010 State University of New York at Binghamton Bachelor of Science (B.S.),  Accounting , summa cum laude 2008  – 2009 Teaching Assistant \n \n•\tManaged class information and activities through a technical format City University of New York-Queens College 2007  – 2008 Accounting Tutor \n \n•\tHelped 50+ students comprehend complex accounting concepts and models The Johns Hopkins University Master's Degree,  Computer Science 2014  – 2016 The Johns Hopkins University Master's Degree,  Computer Science 2014  – 2016 The Johns Hopkins University Master's Degree,  Computer Science 2014  – 2016 CFA Level 3 Candidate 2015 CFA Level 3 Candidate 2015 CFA Level 3 Candidate 2015 The University of Texas at Austin MPA (Master of Professsional Accounting),  Accounting 2009  – 2010 The University of Texas at Austin MPA (Master of Professsional Accounting),  Accounting 2009  – 2010 The University of Texas at Austin MPA (Master of Professsional Accounting),  Accounting 2009  – 2010 State University of New York at Binghamton Bachelor of Science (B.S.),  Accounting , summa cum laude 2008  – 2009 Teaching Assistant \n \n•\tManaged class information and activities through a technical format State University of New York at Binghamton Bachelor of Science (B.S.),  Accounting , summa cum laude 2008  – 2009 Teaching Assistant \n \n•\tManaged class information and activities through a technical format State University of New York at Binghamton Bachelor of Science (B.S.),  Accounting , summa cum laude 2008  – 2009 Teaching Assistant \n \n•\tManaged class information and activities through a technical format City University of New York-Queens College 2007  – 2008 Accounting Tutor \n \n•\tHelped 50+ students comprehend complex accounting concepts and models City University of New York-Queens College 2007  – 2008 Accounting Tutor \n \n•\tHelped 50+ students comprehend complex accounting concepts and models City University of New York-Queens College 2007  – 2008 Accounting Tutor \n \n•\tHelped 50+ students comprehend complex accounting concepts and models "]}