{"position": "IP Logic Design Engineer", "company": "Intel Corporation", "profiles": ["Experience System Level Emulation Soft Machines May 2013  – Present (2 years 4 months) SoC and IP Logic Design Engineer Intel Corporation October 2010  –  May 2013  (2 years 8 months) Folsom, CA Design low power solutions for the hardware security engine in Intel’s Chipsets (vPro) and SoCs \nDevelop Architecture Specifications, Testplans and collaborate with the Validation and Architecture Collateral teams to align design milestones and deliver quality products. \nImplement front-end design features in System Verilog and execute formal verification. System Level Emulation Engineer Intel Corporation July 2006  –  September 2010  (4 years 3 months) Folsom, CA Build emulation models of Intel's integrated 3D graphics and core processors. \nDocument, design and validate Bus Functional Modules (BFM) and that interface with test cards on emulation platforms. \nDebugged system issues and ensured customers were able to get maximum usage from the systems for design debug and software development. System Level Emulation Soft Machines May 2013  – Present (2 years 4 months) System Level Emulation Soft Machines May 2013  – Present (2 years 4 months) SoC and IP Logic Design Engineer Intel Corporation October 2010  –  May 2013  (2 years 8 months) Folsom, CA Design low power solutions for the hardware security engine in Intel’s Chipsets (vPro) and SoCs \nDevelop Architecture Specifications, Testplans and collaborate with the Validation and Architecture Collateral teams to align design milestones and deliver quality products. \nImplement front-end design features in System Verilog and execute formal verification. SoC and IP Logic Design Engineer Intel Corporation October 2010  –  May 2013  (2 years 8 months) Folsom, CA Design low power solutions for the hardware security engine in Intel’s Chipsets (vPro) and SoCs \nDevelop Architecture Specifications, Testplans and collaborate with the Validation and Architecture Collateral teams to align design milestones and deliver quality products. \nImplement front-end design features in System Verilog and execute formal verification. System Level Emulation Engineer Intel Corporation July 2006  –  September 2010  (4 years 3 months) Folsom, CA Build emulation models of Intel's integrated 3D graphics and core processors. \nDocument, design and validate Bus Functional Modules (BFM) and that interface with test cards on emulation platforms. \nDebugged system issues and ensured customers were able to get maximum usage from the systems for design debug and software development. System Level Emulation Engineer Intel Corporation July 2006  –  September 2010  (4 years 3 months) Folsom, CA Build emulation models of Intel's integrated 3D graphics and core processors. \nDocument, design and validate Bus Functional Modules (BFM) and that interface with test cards on emulation platforms. \nDebugged system issues and ensured customers were able to get maximum usage from the systems for design debug and software development. Skills RTL design Computer Architecture VLSI I2C Customer Oriented Result Oriented Organizational... SoC People Skills SystemVerilog Emulation Low-power Design RTL Design Verilog Debugging Skills  RTL design Computer Architecture VLSI I2C Customer Oriented Result Oriented Organizational... SoC People Skills SystemVerilog Emulation Low-power Design RTL Design Verilog Debugging RTL design Computer Architecture VLSI I2C Customer Oriented Result Oriented Organizational... SoC People Skills SystemVerilog Emulation Low-power Design RTL Design Verilog Debugging RTL design Computer Architecture VLSI I2C Customer Oriented Result Oriented Organizational... SoC People Skills SystemVerilog Emulation Low-power Design RTL Design Verilog Debugging Education University of Southern California Master's of Science,  VLSI & Computer Architecture 2004  – 2006 Activities and Societies:  Resident Adviser (RA) for Graduate Housing ,  Advocacy Board Representative for Graduate and Family Housing ,  USC Marathon Team- Ran the LA Marathon in 2005 & 2006 Rizvi College Of Engineering University of Southern California Master's of Science,  VLSI & Computer Architecture 2004  – 2006 Activities and Societies:  Resident Adviser (RA) for Graduate Housing ,  Advocacy Board Representative for Graduate and Family Housing ,  USC Marathon Team- Ran the LA Marathon in 2005 & 2006 University of Southern California Master's of Science,  VLSI & Computer Architecture 2004  – 2006 Activities and Societies:  Resident Adviser (RA) for Graduate Housing ,  Advocacy Board Representative for Graduate and Family Housing ,  USC Marathon Team- Ran the LA Marathon in 2005 & 2006 University of Southern California Master's of Science,  VLSI & Computer Architecture 2004  – 2006 Activities and Societies:  Resident Adviser (RA) for Graduate Housing ,  Advocacy Board Representative for Graduate and Family Housing ,  USC Marathon Team- Ran the LA Marathon in 2005 & 2006 Rizvi College Of Engineering Rizvi College Of Engineering Rizvi College Of Engineering Honors & Awards Additional Honors & Awards Won the logo design that now represents the Intel Chipset and SoC IP Department. (2011) Additional Honors & Awards Won the logo design that now represents the Intel Chipset and SoC IP Department. (2011) Additional Honors & Awards Won the logo design that now represents the Intel Chipset and SoC IP Department. (2011) Additional Honors & Awards Won the logo design that now represents the Intel Chipset and SoC IP Department. (2011) ", "Experience IP Logic Design Engineer Intel Corporation December 2012  – Present (2 years 9 months) IP Logic Design Engineer Intel Corporation December 2012  – Present (2 years 9 months) IP Logic Design Engineer Intel Corporation December 2012  – Present (2 years 9 months) Education Technion - Israel Institute of Technology Technion - Israel Institute of Technology Technion - Israel Institute of Technology Technion - Israel Institute of Technology ", "Experience IP Logic Design Engineer Intel Corporation 2011  – Present (4 years) IP Logic Design Engineer Intel Corporation 2011  – Present (4 years) IP Logic Design Engineer Intel Corporation 2011  – Present (4 years) Education National Institute of Technology Kurukshetra Master of Technology (MTech) National Institute of Technology Kurukshetra Master of Technology (MTech) National Institute of Technology Kurukshetra Master of Technology (MTech) National Institute of Technology Kurukshetra Master of Technology (MTech) ", "Experience IP Logic Design Engineer Intel Corporation July 2008  – Present (7 years 2 months) Austin, Texas Working on the microarchitecture design of Atom-based mobile CPU for tablets and smartphones. Knowledgeable in the memory-subsystem architecture for X-86 based CPUs. Highly proficient in low-power RTL design and taking the design through the entire product-cycle to meet aggressive timing and power targets in cutting edge process technologies. Well-experienced in cross-clock domain crossings and interaction between CPU and SOC. Senior Design Engineer Advanced Micro Devices October 2003  –  April 2008  (4 years 7 months) Austin, Texas Worked on the physical design and implementation of Northbridge for multiple high-speed Quad-Core server chips on 65nm and 45nm process technologies. Highly proficient in full-custom design. Responsibilities include drawing schematics based on the RTL, custom place and route and delivering the final product optimized for aggressive PV targets. Experienced in both control and data path design for the Northbridge blocks interacting with the Cores. Owned the formal verification and gate simulation of the hyper-transport section of the Northbridge. Involved in debugging X-propogation issues at the full-chip. Hardware Design Engineer IBM Global Services July 1999  –  June 2001  (2 years) Bangalore, India Experienced in physical design of ASICs and delivering the final product starting from synthesized netlist. Proficient in IO Design, floorplanning, clock design, place, route and static timing analysis. \nInteracted extensively with customers to meet demanding product schedules and constraints. \nSuccesfully delivered three ASICs used in various applications namely servers, video graphics and networking based on different process technologies. IP Logic Design Engineer Intel Corporation July 2008  – Present (7 years 2 months) Austin, Texas Working on the microarchitecture design of Atom-based mobile CPU for tablets and smartphones. Knowledgeable in the memory-subsystem architecture for X-86 based CPUs. Highly proficient in low-power RTL design and taking the design through the entire product-cycle to meet aggressive timing and power targets in cutting edge process technologies. Well-experienced in cross-clock domain crossings and interaction between CPU and SOC. IP Logic Design Engineer Intel Corporation July 2008  – Present (7 years 2 months) Austin, Texas Working on the microarchitecture design of Atom-based mobile CPU for tablets and smartphones. Knowledgeable in the memory-subsystem architecture for X-86 based CPUs. Highly proficient in low-power RTL design and taking the design through the entire product-cycle to meet aggressive timing and power targets in cutting edge process technologies. Well-experienced in cross-clock domain crossings and interaction between CPU and SOC. Senior Design Engineer Advanced Micro Devices October 2003  –  April 2008  (4 years 7 months) Austin, Texas Worked on the physical design and implementation of Northbridge for multiple high-speed Quad-Core server chips on 65nm and 45nm process technologies. Highly proficient in full-custom design. Responsibilities include drawing schematics based on the RTL, custom place and route and delivering the final product optimized for aggressive PV targets. Experienced in both control and data path design for the Northbridge blocks interacting with the Cores. Owned the formal verification and gate simulation of the hyper-transport section of the Northbridge. Involved in debugging X-propogation issues at the full-chip. Senior Design Engineer Advanced Micro Devices October 2003  –  April 2008  (4 years 7 months) Austin, Texas Worked on the physical design and implementation of Northbridge for multiple high-speed Quad-Core server chips on 65nm and 45nm process technologies. Highly proficient in full-custom design. Responsibilities include drawing schematics based on the RTL, custom place and route and delivering the final product optimized for aggressive PV targets. Experienced in both control and data path design for the Northbridge blocks interacting with the Cores. Owned the formal verification and gate simulation of the hyper-transport section of the Northbridge. Involved in debugging X-propogation issues at the full-chip. Hardware Design Engineer IBM Global Services July 1999  –  June 2001  (2 years) Bangalore, India Experienced in physical design of ASICs and delivering the final product starting from synthesized netlist. Proficient in IO Design, floorplanning, clock design, place, route and static timing analysis. \nInteracted extensively with customers to meet demanding product schedules and constraints. \nSuccesfully delivered three ASICs used in various applications namely servers, video graphics and networking based on different process technologies. Hardware Design Engineer IBM Global Services July 1999  –  June 2001  (2 years) Bangalore, India Experienced in physical design of ASICs and delivering the final product starting from synthesized netlist. Proficient in IO Design, floorplanning, clock design, place, route and static timing analysis. \nInteracted extensively with customers to meet demanding product schedules and constraints. \nSuccesfully delivered three ASICs used in various applications namely servers, video graphics and networking based on different process technologies. Languages Tamil Hindi Tamil Hindi Tamil Hindi Skills Static Timing Analysis Physical Design Logic Design RTL design Timing Closure VLSI Microarchitecture ASIC RTL coding Processors SystemVerilog Low-power Design Synopsys tools Perl Microprocessors Verilog See 1+     See less Skills  Static Timing Analysis Physical Design Logic Design RTL design Timing Closure VLSI Microarchitecture ASIC RTL coding Processors SystemVerilog Low-power Design Synopsys tools Perl Microprocessors Verilog See 1+     See less Static Timing Analysis Physical Design Logic Design RTL design Timing Closure VLSI Microarchitecture ASIC RTL coding Processors SystemVerilog Low-power Design Synopsys tools Perl Microprocessors Verilog See 1+     See less Static Timing Analysis Physical Design Logic Design RTL design Timing Closure VLSI Microarchitecture ASIC RTL coding Processors SystemVerilog Low-power Design Synopsys tools Perl Microprocessors Verilog See 1+     See less Education University of Massachusetts, Amherst M.S,  Electrical and Computer Engineering 2001  – 2003 University of Madras Bachelor of Engineering (B.E.),  Electrical , Electronics and Communications Engineering 1995  – 1999 University of Massachusetts, Amherst M.S,  Electrical and Computer Engineering 2001  – 2003 University of Massachusetts, Amherst M.S,  Electrical and Computer Engineering 2001  – 2003 University of Massachusetts, Amherst M.S,  Electrical and Computer Engineering 2001  – 2003 University of Madras Bachelor of Engineering (B.E.),  Electrical , Electronics and Communications Engineering 1995  – 1999 University of Madras Bachelor of Engineering (B.E.),  Electrical , Electronics and Communications Engineering 1995  – 1999 University of Madras Bachelor of Engineering (B.E.),  Electrical , Electronics and Communications Engineering 1995  – 1999 ", "Experience IP Logic Design Engineer Intel Corporation November 2014  – Present (10 months) Bangalore Software Intern PACE Wisdom Solutions March 2014  – Present (1 year 6 months) Bengaluru Area, India Graduate Research Teaching Assistant Texas A&M University System February 2013  –  November 2013  (10 months) Kingsville, TX •\tHelped Undergraduate and Graduate students during their coursework of VLSI Design and Random Prototyping with ASIC Design. \n•\tTaught students layout bring up and netlist generation and simulation using HSPICE and LTSPICE. \n•\tWas involved in assisting undergraduate student’s projects and fabrication using MOSIS. Design Engineer HCL Technologies July 2011  –  August 2012  (1 year 2 months) Bangalore Design and Validation on Xilinx's and Altera's FPGA boards IP Logic Design Engineer Intel Corporation November 2014  – Present (10 months) Bangalore IP Logic Design Engineer Intel Corporation November 2014  – Present (10 months) Bangalore Software Intern PACE Wisdom Solutions March 2014  – Present (1 year 6 months) Bengaluru Area, India Software Intern PACE Wisdom Solutions March 2014  – Present (1 year 6 months) Bengaluru Area, India Graduate Research Teaching Assistant Texas A&M University System February 2013  –  November 2013  (10 months) Kingsville, TX •\tHelped Undergraduate and Graduate students during their coursework of VLSI Design and Random Prototyping with ASIC Design. \n•\tTaught students layout bring up and netlist generation and simulation using HSPICE and LTSPICE. \n•\tWas involved in assisting undergraduate student’s projects and fabrication using MOSIS. Graduate Research Teaching Assistant Texas A&M University System February 2013  –  November 2013  (10 months) Kingsville, TX •\tHelped Undergraduate and Graduate students during their coursework of VLSI Design and Random Prototyping with ASIC Design. \n•\tTaught students layout bring up and netlist generation and simulation using HSPICE and LTSPICE. \n•\tWas involved in assisting undergraduate student’s projects and fabrication using MOSIS. Design Engineer HCL Technologies July 2011  –  August 2012  (1 year 2 months) Bangalore Design and Validation on Xilinx's and Altera's FPGA boards Design Engineer HCL Technologies July 2011  –  August 2012  (1 year 2 months) Bangalore Design and Validation on Xilinx's and Altera's FPGA boards Languages Kannada Native or bilingual proficiency Hindi Professional working proficiency English Full professional proficiency Kannada Native or bilingual proficiency Hindi Professional working proficiency English Full professional proficiency Kannada Native or bilingual proficiency Hindi Professional working proficiency English Full professional proficiency Native or bilingual proficiency Professional working proficiency Full professional proficiency Skills Verilog VLSI C FPGA VHDL ASIC ModelSim SPICE Static Timing Analysis Assembly Language Matlab Xilinx ISE Altera Quartus Digital Signal... Digital Image Processing Perl FPGA prototyping LTSpice RTL design Mixed-Signal IC Design Analog Circuit Design Carbon Nanotubes C++ CMOS DFT Semiconductor... Semiconductor Process... Nanomaterials R&D experience RF circuits Functional Verification Simulations SystemVerilog RTL Verification System verilog CDC Spyglass Xilinx Embedded Systems Logic Design Microcontrollers RTL Design See 27+     See less Skills  Verilog VLSI C FPGA VHDL ASIC ModelSim SPICE Static Timing Analysis Assembly Language Matlab Xilinx ISE Altera Quartus Digital Signal... Digital Image Processing Perl FPGA prototyping LTSpice RTL design Mixed-Signal IC Design Analog Circuit Design Carbon Nanotubes C++ CMOS DFT Semiconductor... Semiconductor Process... Nanomaterials R&D experience RF circuits Functional Verification Simulations SystemVerilog RTL Verification System verilog CDC Spyglass Xilinx Embedded Systems Logic Design Microcontrollers RTL Design See 27+     See less Verilog VLSI C FPGA VHDL ASIC ModelSim SPICE Static Timing Analysis Assembly Language Matlab Xilinx ISE Altera Quartus Digital Signal... Digital Image Processing Perl FPGA prototyping LTSpice RTL design Mixed-Signal IC Design Analog Circuit Design Carbon Nanotubes C++ CMOS DFT Semiconductor... Semiconductor Process... Nanomaterials R&D experience RF circuits Functional Verification Simulations SystemVerilog RTL Verification System verilog CDC Spyglass Xilinx Embedded Systems Logic Design Microcontrollers RTL Design See 27+     See less Verilog VLSI C FPGA VHDL ASIC ModelSim SPICE Static Timing Analysis Assembly Language Matlab Xilinx ISE Altera Quartus Digital Signal... Digital Image Processing Perl FPGA prototyping LTSpice RTL design Mixed-Signal IC Design Analog Circuit Design Carbon Nanotubes C++ CMOS DFT Semiconductor... Semiconductor Process... Nanomaterials R&D experience RF circuits Functional Verification Simulations SystemVerilog RTL Verification System verilog CDC Spyglass Xilinx Embedded Systems Logic Design Microcontrollers RTL Design See 27+     See less Education Texas A&M University-Kingsville Master of Science (M.S.),  Electrical Engineering , 4.0/4 2012  – 2013 Specialisation in VLSI design Activities and Societies:  Robotics Workshop PESIT Bachelor of Engineering (B.E.),  Electronics and Communications Engineering 2007  – 2011 Bachelor of Engineering in Electronics and Communication Engineering Activities and Societies:  Oraganising committee for Inter collegiate fest seshadripuram composite PU college 2005  – 2007 Texas A&M University-Kingsville Master of Science (M.S.),  Electrical Engineering , 4.0/4 2012  – 2013 Specialisation in VLSI design Activities and Societies:  Robotics Workshop Texas A&M University-Kingsville Master of Science (M.S.),  Electrical Engineering , 4.0/4 2012  – 2013 Specialisation in VLSI design Activities and Societies:  Robotics Workshop Texas A&M University-Kingsville Master of Science (M.S.),  Electrical Engineering , 4.0/4 2012  – 2013 Specialisation in VLSI design Activities and Societies:  Robotics Workshop PESIT Bachelor of Engineering (B.E.),  Electronics and Communications Engineering 2007  – 2011 Bachelor of Engineering in Electronics and Communication Engineering Activities and Societies:  Oraganising committee for Inter collegiate fest PESIT Bachelor of Engineering (B.E.),  Electronics and Communications Engineering 2007  – 2011 Bachelor of Engineering in Electronics and Communication Engineering Activities and Societies:  Oraganising committee for Inter collegiate fest PESIT Bachelor of Engineering (B.E.),  Electronics and Communications Engineering 2007  – 2011 Bachelor of Engineering in Electronics and Communication Engineering Activities and Societies:  Oraganising committee for Inter collegiate fest seshadripuram composite PU college 2005  – 2007 seshadripuram composite PU college 2005  – 2007 seshadripuram composite PU college 2005  – 2007 ", "Experience IP Logic Design Engineer Intel Corporation IP Logic Design Engineer Intel Corporation IP Logic Design Engineer Intel Corporation Skills Semiconductors Skills  Semiconductors Semiconductors Semiconductors ", "Experience Software Engineer IBM January 2014  – Present (1 year 8 months) Damansara Uptown L3 Support Engineer for Tivoli Softwares - Tivoli Business Service Manager & Netcool OMNIbus WebGUI. IP Logic Design Engineer Intel Corporation September 2011  –  January 2014  (2 years 5 months) Bayan Lepas Validation Engineer for chipset Soft IP SATA front-end design Software Engineer IBM January 2014  – Present (1 year 8 months) Damansara Uptown L3 Support Engineer for Tivoli Softwares - Tivoli Business Service Manager & Netcool OMNIbus WebGUI. Software Engineer IBM January 2014  – Present (1 year 8 months) Damansara Uptown L3 Support Engineer for Tivoli Softwares - Tivoli Business Service Manager & Netcool OMNIbus WebGUI. IP Logic Design Engineer Intel Corporation September 2011  –  January 2014  (2 years 5 months) Bayan Lepas Validation Engineer for chipset Soft IP SATA front-end design IP Logic Design Engineer Intel Corporation September 2011  –  January 2014  (2 years 5 months) Bayan Lepas Validation Engineer for chipset Soft IP SATA front-end design Skills Verilog Open Verification... RTL verification Object Oriented Design Java Perl Script Skills  Verilog Open Verification... RTL verification Object Oriented Design Java Perl Script Verilog Open Verification... RTL verification Object Oriented Design Java Perl Script Verilog Open Verification... RTL verification Object Oriented Design Java Perl Script Education The University of Birmingham Master of Engineering (MEng),  Electronic and Computer Engineering 2008  – 2011 The University of Birmingham Master of Engineering (MEng),  Electronic and Computer Engineering 2008  – 2011 The University of Birmingham Master of Engineering (MEng),  Electronic and Computer Engineering 2008  – 2011 The University of Birmingham Master of Engineering (MEng),  Electronic and Computer Engineering 2008  – 2011 ", "Summary Highly proficient Digital, Mixed-signal IC/ASIC Design engineer, with 8+ years of industry experience. Experienced in all aspects of digital IC design (RTL coding, Verification, Synthesis, APR, STA, ATPG, GLS, chip integration), mixed-mode simulation and board level functional debug & characterization of low-power mixed-signal microcontroller & mixed-signal custom IC. \n \nACCOMPLISMENT: \nCollaboration with Customer/System/Analog for design specification; RTL coding (Verilog); Chip integration and verification (Verilog, SystemVerilog OVM); Full chip synthesis and formal verification (DC, Formality, Conformal); \nAutomatic place & route with CTS (Encounter); Gate level simulation; Static Timing Analysis (PrimeTime); ECO iterations (PrimeTime, Encounter); ATPG pattern generation (TetraMax, FastScan); Mixed-mode simulation (AMS, ADMS); Functional debug at board level; Parasitic Extraction & LVS (Assura), FPGA prototyping, etc. Specialties:Verilog, Verilog-A, SystemVerilog, SystemVerilog OVM, VHDL, Spice, Design Compiler, RTL Compiler, DFT Compiler, SureCOV, FastSCAN, TetraMAX, Primetime, CeltIC NDC, Formality, Pearl, Conformal, ModelSIM, PowerTHEATER, Analog Artist, Spectre, Virtuoso, Debussy, PSL, SureLINT, Cadence Incisive, SoC Encounter, Mentor-ADMS, Cadencce-AMS, Xilinx ISE, Altera Quartus, Java (Sun Certified Java Programmer & Web Componet Developer), C, C++, PERL, TCL, MATLAB, FORTRAN, UNIX, LINUX, DOS, SunSOLARIS. Summary Highly proficient Digital, Mixed-signal IC/ASIC Design engineer, with 8+ years of industry experience. Experienced in all aspects of digital IC design (RTL coding, Verification, Synthesis, APR, STA, ATPG, GLS, chip integration), mixed-mode simulation and board level functional debug & characterization of low-power mixed-signal microcontroller & mixed-signal custom IC. \n \nACCOMPLISMENT: \nCollaboration with Customer/System/Analog for design specification; RTL coding (Verilog); Chip integration and verification (Verilog, SystemVerilog OVM); Full chip synthesis and formal verification (DC, Formality, Conformal); \nAutomatic place & route with CTS (Encounter); Gate level simulation; Static Timing Analysis (PrimeTime); ECO iterations (PrimeTime, Encounter); ATPG pattern generation (TetraMax, FastScan); Mixed-mode simulation (AMS, ADMS); Functional debug at board level; Parasitic Extraction & LVS (Assura), FPGA prototyping, etc. Specialties:Verilog, Verilog-A, SystemVerilog, SystemVerilog OVM, VHDL, Spice, Design Compiler, RTL Compiler, DFT Compiler, SureCOV, FastSCAN, TetraMAX, Primetime, CeltIC NDC, Formality, Pearl, Conformal, ModelSIM, PowerTHEATER, Analog Artist, Spectre, Virtuoso, Debussy, PSL, SureLINT, Cadence Incisive, SoC Encounter, Mentor-ADMS, Cadencce-AMS, Xilinx ISE, Altera Quartus, Java (Sun Certified Java Programmer & Web Componet Developer), C, C++, PERL, TCL, MATLAB, FORTRAN, UNIX, LINUX, DOS, SunSOLARIS. Highly proficient Digital, Mixed-signal IC/ASIC Design engineer, with 8+ years of industry experience. Experienced in all aspects of digital IC design (RTL coding, Verification, Synthesis, APR, STA, ATPG, GLS, chip integration), mixed-mode simulation and board level functional debug & characterization of low-power mixed-signal microcontroller & mixed-signal custom IC. \n \nACCOMPLISMENT: \nCollaboration with Customer/System/Analog for design specification; RTL coding (Verilog); Chip integration and verification (Verilog, SystemVerilog OVM); Full chip synthesis and formal verification (DC, Formality, Conformal); \nAutomatic place & route with CTS (Encounter); Gate level simulation; Static Timing Analysis (PrimeTime); ECO iterations (PrimeTime, Encounter); ATPG pattern generation (TetraMax, FastScan); Mixed-mode simulation (AMS, ADMS); Functional debug at board level; Parasitic Extraction & LVS (Assura), FPGA prototyping, etc. Specialties:Verilog, Verilog-A, SystemVerilog, SystemVerilog OVM, VHDL, Spice, Design Compiler, RTL Compiler, DFT Compiler, SureCOV, FastSCAN, TetraMAX, Primetime, CeltIC NDC, Formality, Pearl, Conformal, ModelSIM, PowerTHEATER, Analog Artist, Spectre, Virtuoso, Debussy, PSL, SureLINT, Cadence Incisive, SoC Encounter, Mentor-ADMS, Cadencce-AMS, Xilinx ISE, Altera Quartus, Java (Sun Certified Java Programmer & Web Componet Developer), C, C++, PERL, TCL, MATLAB, FORTRAN, UNIX, LINUX, DOS, SunSOLARIS. Highly proficient Digital, Mixed-signal IC/ASIC Design engineer, with 8+ years of industry experience. Experienced in all aspects of digital IC design (RTL coding, Verification, Synthesis, APR, STA, ATPG, GLS, chip integration), mixed-mode simulation and board level functional debug & characterization of low-power mixed-signal microcontroller & mixed-signal custom IC. \n \nACCOMPLISMENT: \nCollaboration with Customer/System/Analog for design specification; RTL coding (Verilog); Chip integration and verification (Verilog, SystemVerilog OVM); Full chip synthesis and formal verification (DC, Formality, Conformal); \nAutomatic place & route with CTS (Encounter); Gate level simulation; Static Timing Analysis (PrimeTime); ECO iterations (PrimeTime, Encounter); ATPG pattern generation (TetraMax, FastScan); Mixed-mode simulation (AMS, ADMS); Functional debug at board level; Parasitic Extraction & LVS (Assura), FPGA prototyping, etc. Specialties:Verilog, Verilog-A, SystemVerilog, SystemVerilog OVM, VHDL, Spice, Design Compiler, RTL Compiler, DFT Compiler, SureCOV, FastSCAN, TetraMAX, Primetime, CeltIC NDC, Formality, Pearl, Conformal, ModelSIM, PowerTHEATER, Analog Artist, Spectre, Virtuoso, Debussy, PSL, SureLINT, Cadence Incisive, SoC Encounter, Mentor-ADMS, Cadencce-AMS, Xilinx ISE, Altera Quartus, Java (Sun Certified Java Programmer & Web Componet Developer), C, C++, PERL, TCL, MATLAB, FORTRAN, UNIX, LINUX, DOS, SunSOLARIS. Experience Graphics Hardware Engineer Intel Corporation November 2013  – Present (1 year 10 months) Folsom, CA IP Logic Design Engineer Intel Corporation September 2010  –  November 2013  (3 years 3 months) Folsom, CA Sr Design Engineer Microchip Technology June 2010  –  September 2010  (4 months) Chandler, AZ ASIC Design & Verification Syndiant, Inc December 2009  –  June 2010  (7 months) FPGA Engineer Intel Corporation July 2009  –  December 2009  (6 months) Hillsboro, OR Senior IC design engineer Texas Instruments July 2006  –  April 2009  (2 years 10 months) Senior Digital Design Engineer (Digital Design Lead) for mixed-signal custom IC. IC design engineer Maxim Integrated Products June 2001  –  July 2006  (5 years 2 months) Microcontroller (Mixed-signal) Design Graphics Hardware Engineer Intel Corporation November 2013  – Present (1 year 10 months) Folsom, CA Graphics Hardware Engineer Intel Corporation November 2013  – Present (1 year 10 months) Folsom, CA IP Logic Design Engineer Intel Corporation September 2010  –  November 2013  (3 years 3 months) Folsom, CA IP Logic Design Engineer Intel Corporation September 2010  –  November 2013  (3 years 3 months) Folsom, CA Sr Design Engineer Microchip Technology June 2010  –  September 2010  (4 months) Chandler, AZ Sr Design Engineer Microchip Technology June 2010  –  September 2010  (4 months) Chandler, AZ ASIC Design & Verification Syndiant, Inc December 2009  –  June 2010  (7 months) ASIC Design & Verification Syndiant, Inc December 2009  –  June 2010  (7 months) FPGA Engineer Intel Corporation July 2009  –  December 2009  (6 months) Hillsboro, OR FPGA Engineer Intel Corporation July 2009  –  December 2009  (6 months) Hillsboro, OR Senior IC design engineer Texas Instruments July 2006  –  April 2009  (2 years 10 months) Senior Digital Design Engineer (Digital Design Lead) for mixed-signal custom IC. Senior IC design engineer Texas Instruments July 2006  –  April 2009  (2 years 10 months) Senior Digital Design Engineer (Digital Design Lead) for mixed-signal custom IC. IC design engineer Maxim Integrated Products June 2001  –  July 2006  (5 years 2 months) Microcontroller (Mixed-signal) Design IC design engineer Maxim Integrated Products June 2001  –  July 2006  (5 years 2 months) Microcontroller (Mixed-signal) Design Skills Integrated Circuit... ModelSim SoC ASIC SPICE Verilog VHDL TCL Spectre Low-power Design Logic Synthesis Static Timing Analysis SystemVerilog Primetime RTL coding Cadence Altera Quartus Timing Closure ATPG CMOS Power Management Analog Verilog-A Debugging Virtuoso Xilinx ISE IC Analog Circuit Design Mixed Signal Cadence Virtuoso LVS Formal Verification Place & Route Perl FPGA prototyping Semiconductors Circuit Design FPGA Simulations Microcontrollers DFT Physical Design Logic Design VLSI Digital IC Design Open Verification... Parasitic Extraction RTL design Compilers EDA See 35+     See less Skills  Integrated Circuit... ModelSim SoC ASIC SPICE Verilog VHDL TCL Spectre Low-power Design Logic Synthesis Static Timing Analysis SystemVerilog Primetime RTL coding Cadence Altera Quartus Timing Closure ATPG CMOS Power Management Analog Verilog-A Debugging Virtuoso Xilinx ISE IC Analog Circuit Design Mixed Signal Cadence Virtuoso LVS Formal Verification Place & Route Perl FPGA prototyping Semiconductors Circuit Design FPGA Simulations Microcontrollers DFT Physical Design Logic Design VLSI Digital IC Design Open Verification... Parasitic Extraction RTL design Compilers EDA See 35+     See less Integrated Circuit... ModelSim SoC ASIC SPICE Verilog VHDL TCL Spectre Low-power Design Logic Synthesis Static Timing Analysis SystemVerilog Primetime RTL coding Cadence Altera Quartus Timing Closure ATPG CMOS Power Management Analog Verilog-A Debugging Virtuoso Xilinx ISE IC Analog Circuit Design Mixed Signal Cadence Virtuoso LVS Formal Verification Place & Route Perl FPGA prototyping Semiconductors Circuit Design FPGA Simulations Microcontrollers DFT Physical Design Logic Design VLSI Digital IC Design Open Verification... Parasitic Extraction RTL design Compilers EDA See 35+     See less Integrated Circuit... ModelSim SoC ASIC SPICE Verilog VHDL TCL Spectre Low-power Design Logic Synthesis Static Timing Analysis SystemVerilog Primetime RTL coding Cadence Altera Quartus Timing Closure ATPG CMOS Power Management Analog Verilog-A Debugging Virtuoso Xilinx ISE IC Analog Circuit Design Mixed Signal Cadence Virtuoso LVS Formal Verification Place & Route Perl FPGA prototyping Semiconductors Circuit Design FPGA Simulations Microcontrollers DFT Physical Design Logic Design VLSI Digital IC Design Open Verification... Parasitic Extraction RTL design Compilers EDA See 35+     See less Education Texas A&M University Masters in Electrical Engineering,  Electrical Engineering 1999  – 2001 College Station Bangladesh University of Engineering and Technology Bachelor in Science,  Electrical Engineering 1994  – 1999 Texas A&M University Masters in Electrical Engineering,  Electrical Engineering 1999  – 2001 College Station Texas A&M University Masters in Electrical Engineering,  Electrical Engineering 1999  – 2001 College Station Texas A&M University Masters in Electrical Engineering,  Electrical Engineering 1999  – 2001 College Station Bangladesh University of Engineering and Technology Bachelor in Science,  Electrical Engineering 1994  – 1999 Bangladesh University of Engineering and Technology Bachelor in Science,  Electrical Engineering 1994  – 1999 Bangladesh University of Engineering and Technology Bachelor in Science,  Electrical Engineering 1994  – 1999 ", "Experience IP Logic Design Engineer Intel Corporation July 2014  – Present (1 year 2 months) Bengaluru Area, India Currently working with Next Generation IO team in RTL front end design . We work on multi-Gbps serial IOs.  Intern Intel Corporation May 2013  –  June 2014  (1 year 2 months) Bengaluru Area, India IP Logic Design Engineer Intel Corporation July 2014  – Present (1 year 2 months) Bengaluru Area, India Currently working with Next Generation IO team in RTL front end design . We work on multi-Gbps serial IOs.  IP Logic Design Engineer Intel Corporation July 2014  – Present (1 year 2 months) Bengaluru Area, India Currently working with Next Generation IO team in RTL front end design . We work on multi-Gbps serial IOs.  Intern Intel Corporation May 2013  –  June 2014  (1 year 2 months) Bengaluru Area, India Intern Intel Corporation May 2013  –  June 2014  (1 year 2 months) Bengaluru Area, India Skills Logic Design VLSI Verilog Tanner EDA Synopsys tools Xilinx ISE High Speed Serial IO Skills  Logic Design VLSI Verilog Tanner EDA Synopsys tools Xilinx ISE High Speed Serial IO Logic Design VLSI Verilog Tanner EDA Synopsys tools Xilinx ISE High Speed Serial IO Logic Design VLSI Verilog Tanner EDA Synopsys tools Xilinx ISE High Speed Serial IO Education National Institute of Technology Warangal Master of Technology (M.Tech.),  VLSI 2012  – 2014 JECRC, Jaipur Bachelor of Technology (B.Tech.),  Electronics and Communications Engineering 2006  – 2010 National Institute of Technology Warangal Master of Technology (M.Tech.),  VLSI 2012  – 2014 National Institute of Technology Warangal Master of Technology (M.Tech.),  VLSI 2012  – 2014 National Institute of Technology Warangal Master of Technology (M.Tech.),  VLSI 2012  – 2014 JECRC, Jaipur Bachelor of Technology (B.Tech.),  Electronics and Communications Engineering 2006  – 2010 JECRC, Jaipur Bachelor of Technology (B.Tech.),  Electronics and Communications Engineering 2006  – 2010 JECRC, Jaipur Bachelor of Technology (B.Tech.),  Electronics and Communications Engineering 2006  – 2010 ", "Skills ASIC SoC Verilog Debugging SystemVerilog Primetime RTL design Skills  ASIC SoC Verilog Debugging SystemVerilog Primetime RTL design ASIC SoC Verilog Debugging SystemVerilog Primetime RTL design ASIC SoC Verilog Debugging SystemVerilog Primetime RTL design ", "Languages Arabic French Arabic French Arabic French Skills Debugging NC-Verilog VCS JTAG Perl Boundary Scan Awk Integrated Circuit... Scripting ASIC NCSim Verilog Electronics Tetramax RTL design Static Timing Analysis DFT EDA ATPG SystemVerilog SoC Cadence Virtuoso VLSI Mixed Signal Functional Verification Semiconductors Analog Timing Closure Formal Verification Circuit Design Primetime Logic Synthesis Logic Design ModelSim LVS DRC Hardware Architecture IC TCL Physical Verification Signal Integrity Microprocessors Processors VHDL RTL coding Cadence Synopsys tools Low-power Design Physical Design CMOS See 35+     See less Skills  Debugging NC-Verilog VCS JTAG Perl Boundary Scan Awk Integrated Circuit... Scripting ASIC NCSim Verilog Electronics Tetramax RTL design Static Timing Analysis DFT EDA ATPG SystemVerilog SoC Cadence Virtuoso VLSI Mixed Signal Functional Verification Semiconductors Analog Timing Closure Formal Verification Circuit Design Primetime Logic Synthesis Logic Design ModelSim LVS DRC Hardware Architecture IC TCL Physical Verification Signal Integrity Microprocessors Processors VHDL RTL coding Cadence Synopsys tools Low-power Design Physical Design CMOS See 35+     See less Debugging NC-Verilog VCS JTAG Perl Boundary Scan Awk Integrated Circuit... Scripting ASIC NCSim Verilog Electronics Tetramax RTL design Static Timing Analysis DFT EDA ATPG SystemVerilog SoC Cadence Virtuoso VLSI Mixed Signal Functional Verification Semiconductors Analog Timing Closure Formal Verification Circuit Design Primetime Logic Synthesis Logic Design ModelSim LVS DRC Hardware Architecture IC TCL Physical Verification Signal Integrity Microprocessors Processors VHDL RTL coding Cadence Synopsys tools Low-power Design Physical Design CMOS See 35+     See less Debugging NC-Verilog VCS JTAG Perl Boundary Scan Awk Integrated Circuit... Scripting ASIC NCSim Verilog Electronics Tetramax RTL design Static Timing Analysis DFT EDA ATPG SystemVerilog SoC Cadence Virtuoso VLSI Mixed Signal Functional Verification Semiconductors Analog Timing Closure Formal Verification Circuit Design Primetime Logic Synthesis Logic Design ModelSim LVS DRC Hardware Architecture IC TCL Physical Verification Signal Integrity Microprocessors Processors VHDL RTL coding Cadence Synopsys tools Low-power Design Physical Design CMOS See 35+     See less ", "Experience IP Logic Design Engineer Intel Corporation December 2011  – Present (3 years 9 months) Chandler, AZ Product Platform Valivation Develoment Intern Intel Corporation May 2011  –  August 2011  (4 months) Chandler, AZ •\tPorted 2D and 3D objective graphics suite to Berryville manual and automated PPV. \n•\tSupported the development of a test for the LVDS interface beyond subjective playback. \n•\tSupported the development of a test HDMI transmit and receive to incorporate in the PPV suite. \n•\tSupported the development of PPV concurrency testing to stress a unit with parallel test instead of sequential via bash scripting. \n•\tSupported porting tests from SV/Media SV to both manual and automated PPV via bash scripting Product Platform Validation Undergrad Intern Intel July 2010  –  January 2011  (7 months) Chandler, Arizona •\tCreated fuse programs and tested new Digital Home Group products at a platform level for Product Platform Validation. \n•\tHandled retrieving signed CEFDK for new trusted boot products to test at a PPV level. \n•\tSupported PPV qualification for the C4200 chipset and helped debug failures. \n•\tCreated a box stress environment for CE4200 and aged it ten years for product qualifications. \n•\tSet up a system ESD environment, and executed a system level ESD tests for CE4200 qualification. IP Logic Design Engineer Intel Corporation December 2011  – Present (3 years 9 months) Chandler, AZ IP Logic Design Engineer Intel Corporation December 2011  – Present (3 years 9 months) Chandler, AZ Product Platform Valivation Develoment Intern Intel Corporation May 2011  –  August 2011  (4 months) Chandler, AZ •\tPorted 2D and 3D objective graphics suite to Berryville manual and automated PPV. \n•\tSupported the development of a test for the LVDS interface beyond subjective playback. \n•\tSupported the development of a test HDMI transmit and receive to incorporate in the PPV suite. \n•\tSupported the development of PPV concurrency testing to stress a unit with parallel test instead of sequential via bash scripting. \n•\tSupported porting tests from SV/Media SV to both manual and automated PPV via bash scripting Product Platform Valivation Develoment Intern Intel Corporation May 2011  –  August 2011  (4 months) Chandler, AZ •\tPorted 2D and 3D objective graphics suite to Berryville manual and automated PPV. \n•\tSupported the development of a test for the LVDS interface beyond subjective playback. \n•\tSupported the development of a test HDMI transmit and receive to incorporate in the PPV suite. \n•\tSupported the development of PPV concurrency testing to stress a unit with parallel test instead of sequential via bash scripting. \n•\tSupported porting tests from SV/Media SV to both manual and automated PPV via bash scripting Product Platform Validation Undergrad Intern Intel July 2010  –  January 2011  (7 months) Chandler, Arizona •\tCreated fuse programs and tested new Digital Home Group products at a platform level for Product Platform Validation. \n•\tHandled retrieving signed CEFDK for new trusted boot products to test at a PPV level. \n•\tSupported PPV qualification for the C4200 chipset and helped debug failures. \n•\tCreated a box stress environment for CE4200 and aged it ten years for product qualifications. \n•\tSet up a system ESD environment, and executed a system level ESD tests for CE4200 qualification. Product Platform Validation Undergrad Intern Intel July 2010  –  January 2011  (7 months) Chandler, Arizona •\tCreated fuse programs and tested new Digital Home Group products at a platform level for Product Platform Validation. \n•\tHandled retrieving signed CEFDK for new trusted boot products to test at a PPV level. \n•\tSupported PPV qualification for the C4200 chipset and helped debug failures. \n•\tCreated a box stress environment for CE4200 and aged it ten years for product qualifications. \n•\tSet up a system ESD environment, and executed a system level ESD tests for CE4200 qualification. Languages Spanish Spanish Spanish Skills Verilog ModelSim VLSI Cadence Xilinx RTL design SPICE Pspice SystemVerilog FPGA Oscilloscope Computer Architecture Cadence Virtuoso Xilinx ISE Circuit Design Simulations See 1+     See less Skills  Verilog ModelSim VLSI Cadence Xilinx RTL design SPICE Pspice SystemVerilog FPGA Oscilloscope Computer Architecture Cadence Virtuoso Xilinx ISE Circuit Design Simulations See 1+     See less Verilog ModelSim VLSI Cadence Xilinx RTL design SPICE Pspice SystemVerilog FPGA Oscilloscope Computer Architecture Cadence Virtuoso Xilinx ISE Circuit Design Simulations See 1+     See less Verilog ModelSim VLSI Cadence Xilinx RTL design SPICE Pspice SystemVerilog FPGA Oscilloscope Computer Architecture Cadence Virtuoso Xilinx ISE Circuit Design Simulations See 1+     See less Education The University of Texas at San Antonio BSEE,  Electrical Engineering 2007  – 2011 Mayde Creek High School Mayde Creek High School The University of Texas at San Antonio BSEE,  Electrical Engineering 2007  – 2011 The University of Texas at San Antonio BSEE,  Electrical Engineering 2007  – 2011 The University of Texas at San Antonio BSEE,  Electrical Engineering 2007  – 2011 Mayde Creek High School Mayde Creek High School Mayde Creek High School Mayde Creek High School Mayde Creek High School Mayde Creek High School ", "Summary As a front-end verification engineer for high-speed serial IO (HSSIO) for more than 3 years. Besides, involved in legacy regression debug, I'm experienced in testpan creation, testplan execution by using OVM methodology, random-driven constraint stimulus, SVA, CBV, and flow automation. Summary As a front-end verification engineer for high-speed serial IO (HSSIO) for more than 3 years. Besides, involved in legacy regression debug, I'm experienced in testpan creation, testplan execution by using OVM methodology, random-driven constraint stimulus, SVA, CBV, and flow automation. As a front-end verification engineer for high-speed serial IO (HSSIO) for more than 3 years. Besides, involved in legacy regression debug, I'm experienced in testpan creation, testplan execution by using OVM methodology, random-driven constraint stimulus, SVA, CBV, and flow automation. As a front-end verification engineer for high-speed serial IO (HSSIO) for more than 3 years. Besides, involved in legacy regression debug, I'm experienced in testpan creation, testplan execution by using OVM methodology, random-driven constraint stimulus, SVA, CBV, and flow automation. Experience IP Logic Design Engineer Intel Microelectronics (M) Sdn Bhd June 2011  – Present (4 years 3 months) Penang Testplan Creation and Execution \n•\tInvolved in many CSPEC testplan creation and execution work \n•\tMostly using OVM methodology, and random-driven constraint stimulus \n•\tGood in SystemVerilog, SVA, CBA, etc \n \nFlow Development and Execution \n•\tDefined and developed automation to increase team efficiency \n•\tFor example, register validation, regression environment, auto sync-up between model, etc. \n•\tRegister validation is awarded with department award \n \nConfigurable IP \n•\tPart of the team to develop configurable IP \n•\tDevelop configurable GUI from scratch Intern Intel Corporation May 2010  –  July 2010  (3 months) IP Logic Design Engineer Intel Microelectronics (M) Sdn Bhd June 2011  – Present (4 years 3 months) Penang Testplan Creation and Execution \n•\tInvolved in many CSPEC testplan creation and execution work \n•\tMostly using OVM methodology, and random-driven constraint stimulus \n•\tGood in SystemVerilog, SVA, CBA, etc \n \nFlow Development and Execution \n•\tDefined and developed automation to increase team efficiency \n•\tFor example, register validation, regression environment, auto sync-up between model, etc. \n•\tRegister validation is awarded with department award \n \nConfigurable IP \n•\tPart of the team to develop configurable IP \n•\tDevelop configurable GUI from scratch IP Logic Design Engineer Intel Microelectronics (M) Sdn Bhd June 2011  – Present (4 years 3 months) Penang Testplan Creation and Execution \n•\tInvolved in many CSPEC testplan creation and execution work \n•\tMostly using OVM methodology, and random-driven constraint stimulus \n•\tGood in SystemVerilog, SVA, CBA, etc \n \nFlow Development and Execution \n•\tDefined and developed automation to increase team efficiency \n•\tFor example, register validation, regression environment, auto sync-up between model, etc. \n•\tRegister validation is awarded with department award \n \nConfigurable IP \n•\tPart of the team to develop configurable IP \n•\tDevelop configurable GUI from scratch Intern Intel Corporation May 2010  –  July 2010  (3 months) Intern Intel Corporation May 2010  –  July 2010  (3 months) Languages English Professional working proficiency Chinese Professional working proficiency Malay Professional working proficiency English Professional working proficiency Chinese Professional working proficiency Malay Professional working proficiency English Professional working proficiency Chinese Professional working proficiency Malay Professional working proficiency Professional working proficiency Professional working proficiency Professional working proficiency Skills SystemVerilog Perl Script Basics of Unix Verilog Unix Shell Scripting Synopsys tools Code Coverage Assertion Based... Semiconductors Perl FPGA VLSI Unix ASIC C Microsoft Office Embedded Systems Logic Design VHDL C++ Electronics Debugging See 7+     See less Skills  SystemVerilog Perl Script Basics of Unix Verilog Unix Shell Scripting Synopsys tools Code Coverage Assertion Based... Semiconductors Perl FPGA VLSI Unix ASIC C Microsoft Office Embedded Systems Logic Design VHDL C++ Electronics Debugging See 7+     See less SystemVerilog Perl Script Basics of Unix Verilog Unix Shell Scripting Synopsys tools Code Coverage Assertion Based... Semiconductors Perl FPGA VLSI Unix ASIC C Microsoft Office Embedded Systems Logic Design VHDL C++ Electronics Debugging See 7+     See less SystemVerilog Perl Script Basics of Unix Verilog Unix Shell Scripting Synopsys tools Code Coverage Assertion Based... Semiconductors Perl FPGA VLSI Unix ASIC C Microsoft Office Embedded Systems Logic Design VHDL C++ Electronics Debugging See 7+     See less Education Universiti Sains Malaysia Bachelor of Electronic Engineer,  VLSI , Networking, Analog IC Design , 3.67/4.00 2007  – 2011 Universiti Sains Malaysia Bachelor of Electronic Engineer,  VLSI , Networking, Analog IC Design , 3.67/4.00 2007  – 2011 Universiti Sains Malaysia Bachelor of Electronic Engineer,  VLSI , Networking, Analog IC Design , 3.67/4.00 2007  – 2011 Universiti Sains Malaysia Bachelor of Electronic Engineer,  VLSI , Networking, Analog IC Design , 3.67/4.00 2007  – 2011 Honors & Awards ", "Experience IP logic design engineer Intel Corporation July 2012  – Present (3 years 2 months) worked on logic design and architecture, fsm, serial interface i2c,parallel intrerfaces ,tap ,Low power design architecture ,Power gating ,UPF , spyglass_lp tool ,integration, implementation of ECO's, lintra tool, cdc tool, \nFEV tool conformal, fish tail tool to check for timing constraints. \n Intern STMicroelectronics January 2012  –  June 2012  (6 months) Equivalence checking between HDL and CDL views of embedded SRAMs. IP logic design engineer Intel Corporation July 2012  – Present (3 years 2 months) worked on logic design and architecture, fsm, serial interface i2c,parallel intrerfaces ,tap ,Low power design architecture ,Power gating ,UPF , spyglass_lp tool ,integration, implementation of ECO's, lintra tool, cdc tool, \nFEV tool conformal, fish tail tool to check for timing constraints. \n IP logic design engineer Intel Corporation July 2012  – Present (3 years 2 months) worked on logic design and architecture, fsm, serial interface i2c,parallel intrerfaces ,tap ,Low power design architecture ,Power gating ,UPF , spyglass_lp tool ,integration, implementation of ECO's, lintra tool, cdc tool, \nFEV tool conformal, fish tail tool to check for timing constraints. \n Intern STMicroelectronics January 2012  –  June 2012  (6 months) Equivalence checking between HDL and CDL views of embedded SRAMs. Intern STMicroelectronics January 2012  –  June 2012  (6 months) Equivalence checking between HDL and CDL views of embedded SRAMs. Skills Microsoft Word Microsoft Office Microsoft Excel Customer Service PowerPoint English Research Windows Outlook Teaching Public Speaking Skills  Microsoft Word Microsoft Office Microsoft Excel Customer Service PowerPoint English Research Windows Outlook Teaching Public Speaking Microsoft Word Microsoft Office Microsoft Excel Customer Service PowerPoint English Research Windows Outlook Teaching Public Speaking Microsoft Word Microsoft Office Microsoft Excel Customer Service PowerPoint English Research Windows Outlook Teaching Public Speaking Education BITS Pilani Master's degree,  Microelectronics 2010  – 2012 U.P.T.U. Lucknow Bachelor's degree,  Electrical and Electronics Engineering 2005  – 2009 BITS Pilani Master's degree,  Microelectronics 2010  – 2012 BITS Pilani Master's degree,  Microelectronics 2010  – 2012 BITS Pilani Master's degree,  Microelectronics 2010  – 2012 U.P.T.U. Lucknow Bachelor's degree,  Electrical and Electronics Engineering 2005  – 2009 U.P.T.U. Lucknow Bachelor's degree,  Electrical and Electronics Engineering 2005  – 2009 U.P.T.U. Lucknow Bachelor's degree,  Electrical and Electronics Engineering 2005  – 2009 ", "Skills ASIC VMM Functional Verification Verilog Specman NCSim SystemVerilog Open Verification... Timing Closure RTL design Static Timing Analysis EDA TCL SoC Perl UVM RTL Java Visual Basic SQL OVM SystemC VLSI Formal Verification RTL Design Simulations PCIe See 12+     See less Skills  ASIC VMM Functional Verification Verilog Specman NCSim SystemVerilog Open Verification... Timing Closure RTL design Static Timing Analysis EDA TCL SoC Perl UVM RTL Java Visual Basic SQL OVM SystemC VLSI Formal Verification RTL Design Simulations PCIe See 12+     See less ASIC VMM Functional Verification Verilog Specman NCSim SystemVerilog Open Verification... Timing Closure RTL design Static Timing Analysis EDA TCL SoC Perl UVM RTL Java Visual Basic SQL OVM SystemC VLSI Formal Verification RTL Design Simulations PCIe See 12+     See less ASIC VMM Functional Verification Verilog Specman NCSim SystemVerilog Open Verification... Timing Closure RTL design Static Timing Analysis EDA TCL SoC Perl UVM RTL Java Visual Basic SQL OVM SystemC VLSI Formal Verification RTL Design Simulations PCIe See 12+     See less ", "Summary Khai Lik completed his Bachelor Degree in Monash University (Malaysia and Australia) with first class honours in year 2009. The Final Year Project that he has undergone was related to the telecommunication/networking algorithm. \n \nHe worked in Intel Microelectronics starting from Jan 2010 till present as IP Logic Design Engineer. He completed the intensive training on integrated circuit flow and process upon joining the team. \n \nIn the mean time of working in Intel, he pursued his Master Degree in University Science Malaysia on Research Mode. The research topic was around the design and implementation of hardware accelerator. He graduated the Master Degree in 2011. \n \nJob routine of Khai Lik are mainly on the Pre-Silicon design and validation task force on the Chipset's IP of Intel Product. \n \nHe is a passionate engineer, who is always accept and seek for greater challenge and focus on self development! Summary Khai Lik completed his Bachelor Degree in Monash University (Malaysia and Australia) with first class honours in year 2009. The Final Year Project that he has undergone was related to the telecommunication/networking algorithm. \n \nHe worked in Intel Microelectronics starting from Jan 2010 till present as IP Logic Design Engineer. He completed the intensive training on integrated circuit flow and process upon joining the team. \n \nIn the mean time of working in Intel, he pursued his Master Degree in University Science Malaysia on Research Mode. The research topic was around the design and implementation of hardware accelerator. He graduated the Master Degree in 2011. \n \nJob routine of Khai Lik are mainly on the Pre-Silicon design and validation task force on the Chipset's IP of Intel Product. \n \nHe is a passionate engineer, who is always accept and seek for greater challenge and focus on self development! Khai Lik completed his Bachelor Degree in Monash University (Malaysia and Australia) with first class honours in year 2009. The Final Year Project that he has undergone was related to the telecommunication/networking algorithm. \n \nHe worked in Intel Microelectronics starting from Jan 2010 till present as IP Logic Design Engineer. He completed the intensive training on integrated circuit flow and process upon joining the team. \n \nIn the mean time of working in Intel, he pursued his Master Degree in University Science Malaysia on Research Mode. The research topic was around the design and implementation of hardware accelerator. He graduated the Master Degree in 2011. \n \nJob routine of Khai Lik are mainly on the Pre-Silicon design and validation task force on the Chipset's IP of Intel Product. \n \nHe is a passionate engineer, who is always accept and seek for greater challenge and focus on self development! Khai Lik completed his Bachelor Degree in Monash University (Malaysia and Australia) with first class honours in year 2009. The Final Year Project that he has undergone was related to the telecommunication/networking algorithm. \n \nHe worked in Intel Microelectronics starting from Jan 2010 till present as IP Logic Design Engineer. He completed the intensive training on integrated circuit flow and process upon joining the team. \n \nIn the mean time of working in Intel, he pursued his Master Degree in University Science Malaysia on Research Mode. The research topic was around the design and implementation of hardware accelerator. He graduated the Master Degree in 2011. \n \nJob routine of Khai Lik are mainly on the Pre-Silicon design and validation task force on the Chipset's IP of Intel Product. \n \nHe is a passionate engineer, who is always accept and seek for greater challenge and focus on self development! Experience IP Logic Design Engineer Intel Corporation January 2010  – Present (5 years 8 months) Penang, Malaysia Implementation of Register Transfer Logic (RTL) in Hardware Description Language (Verilog and System Verilog). \nArchitecture Specification writing and Testplan writing are part of the execution. \nValidation execution is based on Open Verification Methodology (OVM) which includes test writing, coverage and assertion check coding. The validation and debug environment is on VCS Simulator. NCADD eGT Trainee Intel Corporation January 2010  –  June 2011  (1 year 6 months) Penang, Malaysia This is an advanced computer system/VLSI training for fresh graduate. It is an collaboration between Intel Penang and Northern Corridor Implementation Authority (NCIA). \nThe training started off with scripts writing by introducing Perl, Shell, Tcl and mySQL programming language.  \nFollowing by the Advanced Computer Architecture course, which included the design of MIPS processor using Altera Quartus FPGA software.  \nIn addition to the design and implementation, the synthesis, formal verification and static timing analysis of the design are also coming into the picture of training and not to mention on those pre-silicon backend work such as Place and Route (PnR), schematic and layout drawing, and library design.  \nPost-Silicon training was on DFx and DFM core theory. Technical Intern Intel Corporation November 2007  –  February 2008  (4 months) Penang, Malaysia The internship has been dealing with Model Building and Environment setup for Intel Chipset project. \nIn addition to that, assertion check coding using Specman Elite tool was also part of the execution activities. IP Logic Design Engineer Intel Corporation January 2010  – Present (5 years 8 months) Penang, Malaysia Implementation of Register Transfer Logic (RTL) in Hardware Description Language (Verilog and System Verilog). \nArchitecture Specification writing and Testplan writing are part of the execution. \nValidation execution is based on Open Verification Methodology (OVM) which includes test writing, coverage and assertion check coding. The validation and debug environment is on VCS Simulator. IP Logic Design Engineer Intel Corporation January 2010  – Present (5 years 8 months) Penang, Malaysia Implementation of Register Transfer Logic (RTL) in Hardware Description Language (Verilog and System Verilog). \nArchitecture Specification writing and Testplan writing are part of the execution. \nValidation execution is based on Open Verification Methodology (OVM) which includes test writing, coverage and assertion check coding. The validation and debug environment is on VCS Simulator. NCADD eGT Trainee Intel Corporation January 2010  –  June 2011  (1 year 6 months) Penang, Malaysia This is an advanced computer system/VLSI training for fresh graduate. It is an collaboration between Intel Penang and Northern Corridor Implementation Authority (NCIA). \nThe training started off with scripts writing by introducing Perl, Shell, Tcl and mySQL programming language.  \nFollowing by the Advanced Computer Architecture course, which included the design of MIPS processor using Altera Quartus FPGA software.  \nIn addition to the design and implementation, the synthesis, formal verification and static timing analysis of the design are also coming into the picture of training and not to mention on those pre-silicon backend work such as Place and Route (PnR), schematic and layout drawing, and library design.  \nPost-Silicon training was on DFx and DFM core theory. NCADD eGT Trainee Intel Corporation January 2010  –  June 2011  (1 year 6 months) Penang, Malaysia This is an advanced computer system/VLSI training for fresh graduate. It is an collaboration between Intel Penang and Northern Corridor Implementation Authority (NCIA). \nThe training started off with scripts writing by introducing Perl, Shell, Tcl and mySQL programming language.  \nFollowing by the Advanced Computer Architecture course, which included the design of MIPS processor using Altera Quartus FPGA software.  \nIn addition to the design and implementation, the synthesis, formal verification and static timing analysis of the design are also coming into the picture of training and not to mention on those pre-silicon backend work such as Place and Route (PnR), schematic and layout drawing, and library design.  \nPost-Silicon training was on DFx and DFM core theory. Technical Intern Intel Corporation November 2007  –  February 2008  (4 months) Penang, Malaysia The internship has been dealing with Model Building and Environment setup for Intel Chipset project. \nIn addition to that, assertion check coding using Specman Elite tool was also part of the execution activities. Technical Intern Intel Corporation November 2007  –  February 2008  (4 months) Penang, Malaysia The internship has been dealing with Model Building and Environment setup for Intel Chipset project. \nIn addition to that, assertion check coding using Specman Elite tool was also part of the execution activities. Languages English Mandarin Malay Chinese Dialects English Mandarin Malay Chinese Dialects English Mandarin Malay Chinese Dialects Skills Hardware Description... C Programming Visual Basic Open Verification... Integrated Circuit... Performance Verification Static Timing Analysis Skills  Hardware Description... C Programming Visual Basic Open Verification... Integrated Circuit... Performance Verification Static Timing Analysis Hardware Description... C Programming Visual Basic Open Verification... Integrated Circuit... Performance Verification Static Timing Analysis Hardware Description... C Programming Visual Basic Open Verification... Integrated Circuit... Performance Verification Static Timing Analysis Education University Science Malaysia Master of Science,  Research 2010  – 2011 Monash University Bachelor of Engineering (B.Eng.),  Electrical and Computer System Engineering 2006  – 2009 University Science Malaysia Master of Science,  Research 2010  – 2011 University Science Malaysia Master of Science,  Research 2010  – 2011 University Science Malaysia Master of Science,  Research 2010  – 2011 Monash University Bachelor of Engineering (B.Eng.),  Electrical and Computer System Engineering 2006  – 2009 Monash University Bachelor of Engineering (B.Eng.),  Electrical and Computer System Engineering 2006  – 2009 Monash University Bachelor of Engineering (B.Eng.),  Electrical and Computer System Engineering 2006  – 2009 Honors & Awards Member of Golden Key International Honour Society Golden Key International Honour Society 2007 Member of Golden Key International Honour Society Golden Key International Honour Society 2007 Member of Golden Key International Honour Society Golden Key International Honour Society 2007 Member of Golden Key International Honour Society Golden Key International Honour Society 2007 ", "Experience IP Logic Design Engineer Intel Corporation February 2015  – Present (7 months) bangalore Technical Lead Samsung Electronics November 2013  –  February 2015  (1 year 4 months) Bengaluru Area, India RTL Design, DSC Encoder, OCP, AXI. Member (Research Staff) Central Research Laboratory - BEL September 2008  –  November 2013  (5 years 3 months) Bengaluru Area, India RTL Design, Synthesis, FPGA, STA, SDH, Ethernet IP Logic Design Engineer Intel Corporation February 2015  – Present (7 months) bangalore IP Logic Design Engineer Intel Corporation February 2015  – Present (7 months) bangalore Technical Lead Samsung Electronics November 2013  –  February 2015  (1 year 4 months) Bengaluru Area, India RTL Design, DSC Encoder, OCP, AXI. Technical Lead Samsung Electronics November 2013  –  February 2015  (1 year 4 months) Bengaluru Area, India RTL Design, DSC Encoder, OCP, AXI. Member (Research Staff) Central Research Laboratory - BEL September 2008  –  November 2013  (5 years 3 months) Bengaluru Area, India RTL Design, Synthesis, FPGA, STA, SDH, Ethernet Member (Research Staff) Central Research Laboratory - BEL September 2008  –  November 2013  (5 years 3 months) Bengaluru Area, India RTL Design, Synthesis, FPGA, STA, SDH, Ethernet Languages English Full professional proficiency Hindi Limited working proficiency Telugu Native or bilingual proficiency Kannada Limited working proficiency English Full professional proficiency Hindi Limited working proficiency Telugu Native or bilingual proficiency Kannada Limited working proficiency English Full professional proficiency Hindi Limited working proficiency Telugu Native or bilingual proficiency Kannada Limited working proficiency Full professional proficiency Limited working proficiency Native or bilingual proficiency Limited working proficiency Skills C C++ Microsoft Office Java Microsoft Excel Linux Embedded Systems PowerPoint FPGA Simulations Skills  C C++ Microsoft Office Java Microsoft Excel Linux Embedded Systems PowerPoint FPGA Simulations C C++ Microsoft Office Java Microsoft Excel Linux Embedded Systems PowerPoint FPGA Simulations C C++ Microsoft Office Java Microsoft Excel Linux Embedded Systems PowerPoint FPGA Simulations Education National Institute of Technology Tiruchirappalli Master of Technology (M.Tech.),  VLSI Systems 2006  – 2008 VLSI Systems Activities and Societies:  Placement Representative National Institute of Technology Tiruchirappalli Master of Technology (M.Tech.),  VLSI Systems 2006  – 2008 VLSI Systems Activities and Societies:  Placement Representative National Institute of Technology Tiruchirappalli Master of Technology (M.Tech.),  VLSI Systems 2006  – 2008 VLSI Systems Activities and Societies:  Placement Representative National Institute of Technology Tiruchirappalli Master of Technology (M.Tech.),  VLSI Systems 2006  – 2008 VLSI Systems Activities and Societies:  Placement Representative ", "Experience IP Logic Design Engineer Intel Corporation November 2012  – Present (2 years 10 months) Component Design Engineer Intel Corporation February 2006  –  November 2012  (6 years 10 months) IP Logic Design Engineer Intel Corporation November 2012  – Present (2 years 10 months) IP Logic Design Engineer Intel Corporation November 2012  – Present (2 years 10 months) Component Design Engineer Intel Corporation February 2006  –  November 2012  (6 years 10 months) Component Design Engineer Intel Corporation February 2006  –  November 2012  (6 years 10 months) Skills ASIC RTL SoC Verilog Static Timing Analysis GPU Validation Formal Verification Perl SystemVerilog Skills  ASIC RTL SoC Verilog Static Timing Analysis GPU Validation Formal Verification Perl SystemVerilog ASIC RTL SoC Verilog Static Timing Analysis GPU Validation Formal Verification Perl SystemVerilog ASIC RTL SoC Verilog Static Timing Analysis GPU Validation Formal Verification Perl SystemVerilog Education UW-Madison MS 2003  – 2005 University of Mumbai UW-Madison MS 2003  – 2005 UW-Madison MS 2003  – 2005 UW-Madison MS 2003  – 2005 University of Mumbai University of Mumbai University of Mumbai ", "Experience Sr. IP Logic Design Engineer Intel Corporation September 2014  – Present (1 year) IP Logic Design Engineer Intel Corporation April 2013  –  August 2014  (1 year 5 months) Component Design Engineer Intel September 2001  –  April 2013  (11 years 8 months) Design Engineer DCM Technologies July 1998  –  September 2001  (3 years 3 months) Sr. IP Logic Design Engineer Intel Corporation September 2014  – Present (1 year) Sr. IP Logic Design Engineer Intel Corporation September 2014  – Present (1 year) IP Logic Design Engineer Intel Corporation April 2013  –  August 2014  (1 year 5 months) IP Logic Design Engineer Intel Corporation April 2013  –  August 2014  (1 year 5 months) Component Design Engineer Intel September 2001  –  April 2013  (11 years 8 months) Component Design Engineer Intel September 2001  –  April 2013  (11 years 8 months) Design Engineer DCM Technologies July 1998  –  September 2001  (3 years 3 months) Design Engineer DCM Technologies July 1998  –  September 2001  (3 years 3 months) Skills VLSI Static Timing Analysis SoC ASIC RTL design RTL Design Functional Verification Verilog Skills  VLSI Static Timing Analysis SoC ASIC RTL design RTL Design Functional Verification Verilog VLSI Static Timing Analysis SoC ASIC RTL design RTL Design Functional Verification Verilog VLSI Static Timing Analysis SoC ASIC RTL design RTL Design Functional Verification Verilog Education College of Engineering Pune Bachelor of Engineering (B.E.),  Electrical , Electronics and Communications Engineering 1994  – 1998 College of Engineering Pune Bachelor of Engineering (B.E.),  Electrical , Electronics and Communications Engineering 1994  – 1998 College of Engineering Pune Bachelor of Engineering (B.E.),  Electrical , Electronics and Communications Engineering 1994  – 1998 College of Engineering Pune Bachelor of Engineering (B.E.),  Electrical , Electronics and Communications Engineering 1994  – 1998 ", "Experience IP logic design engineer Intel Corporation July 2011  – Present (4 years 2 months) IP logic design engineer Intel Corporation July 2011  – Present (4 years 2 months) IP logic design engineer Intel Corporation July 2011  – Present (4 years 2 months) Skills Electronics Embedded Systems Semiconductors C ASIC Engineering Debugging SystemVerilog Electrical Engineering Skills  Electronics Embedded Systems Semiconductors C ASIC Engineering Debugging SystemVerilog Electrical Engineering Electronics Embedded Systems Semiconductors C ASIC Engineering Debugging SystemVerilog Electrical Engineering Electronics Embedded Systems Semiconductors C ASIC Engineering Debugging SystemVerilog Electrical Engineering Education Universiti Tun Hussien Onn Malaysia Bachelor's Degree,  Electrical Engineering , CGPA 3.57 2003  – 2008 Activities and Societies:  active member of Taekwondo Club\nactive member of robotics club Universiti Tun Hussien Onn Malaysia Bachelor's Degree,  Electrical Engineering , CGPA 3.57 2003  – 2008 Activities and Societies:  active member of Taekwondo Club\nactive member of robotics club Universiti Tun Hussien Onn Malaysia Bachelor's Degree,  Electrical Engineering , CGPA 3.57 2003  – 2008 Activities and Societies:  active member of Taekwondo Club\nactive member of robotics club Universiti Tun Hussien Onn Malaysia Bachelor's Degree,  Electrical Engineering , CGPA 3.57 2003  – 2008 Activities and Societies:  active member of Taekwondo Club\nactive member of robotics club ", "Experience IP Logic Design Engineer Intel Corporation July 2013  – Present (2 years 2 months) San Francisco Bay Area Intel Corporation \nLogic IP Design Engineer March 2015-Present \n•\tEmployed Fulltime as a Logic IP Design engineer in the DFX team IDGz Hard IP TMO. \n•\tCurrent responsibilities comprise of: \no\tFinished ramp up on DFX SCAN and started working on Fault grading.  \no\tAs an owner of the fault grade flow, work with numerous teams (currently on DDRIO) for integrating the design with the needs of the flow. \no\tInvolvement in editing scripts, integrating design, taking a judgment call on the signals to be tested for DUT. \no\tAim of the flow is to improve results of dfx scan and provide a better dfx coverage in all Hard IPs \no\tWorked with the Timing Analysis team using PrimeTime for IOs with a focus on reduction of number of PVT corners used for pre-silicon timing analysis. \no\tThe key skills and tools involved lved were PrimeTime, perl, tcl (basic), cshell (basic). Using all mentioned skills I was responsible for analyzing the various PVT corners and reduce the redundancy in pre-silicon timing. The role involved managing data up to more than 10GB for each run. \nComponent Design Engineer July 2013-March 2015 \no\tLed and managed the power delivery collaterals at lane level (datalane/commonlane). These include cap extraction and measuring avg. current with the aim of leakage reduction. \no\tMixed Signal Validation (MSV) was a key aspect of the job. Owned the MSV flow on internal tests for the IOs (like USB3/PCIe2/SATA3) for SoCs. \no\tMaintain the power rollup documentation using MS Excel for all SOC based projects. This included a close monitoring of the power specs. \no\tWork on schematic building: Built and created schematic in 14nm cadence environment to assist design team \no\tThe knowledge I gained in ADEXL during schematic building, was useful for EV and IDV simulations. These IDV sims were used to characterize cells for operating conditions. \n Graduate Technical Intern Intel Corporation May 2012  –  April 2013  (1 year) San Francisco Bay Area •\tGraduate Technical Intern at Intel Corporation May 2012-Present \nWorking as an Intern with the IDGz Hard-IP group to perform competitive analysis and benchmarking summaries on Intel vs Best in class industry products.  \no\tPreparation of competitive summaries by scaling area sizes to current technologies for apples to apples comparison. This includes silicon die area measurements using AutoCad and thereby conducting competitive comparisons of silicon area. \no\tCreation/maintenance of a competitive analysis database that focuses on analysis of leading market vendors as well as all internal Intel products. This helped in organization and handling of all HIP data allowing the creation of benchmarking summaries with ease. \no\tEmphasis is laid on IO’s like Display, USB, GPIOs and LPDDR. \nFor an average of two days per week, I supported the High-Speed Serial IO team on post silicon validation of the SATA2 interface on Valleyview X0 and A0.  \no\tModification of scripts for jitter tolerance test automation, executed these scripts on Valleyview X0, and set up benches for Valleyview A0. IP Logic Design Engineer Intel Corporation July 2013  – Present (2 years 2 months) San Francisco Bay Area Intel Corporation \nLogic IP Design Engineer March 2015-Present \n•\tEmployed Fulltime as a Logic IP Design engineer in the DFX team IDGz Hard IP TMO. \n•\tCurrent responsibilities comprise of: \no\tFinished ramp up on DFX SCAN and started working on Fault grading.  \no\tAs an owner of the fault grade flow, work with numerous teams (currently on DDRIO) for integrating the design with the needs of the flow. \no\tInvolvement in editing scripts, integrating design, taking a judgment call on the signals to be tested for DUT. \no\tAim of the flow is to improve results of dfx scan and provide a better dfx coverage in all Hard IPs \no\tWorked with the Timing Analysis team using PrimeTime for IOs with a focus on reduction of number of PVT corners used for pre-silicon timing analysis. \no\tThe key skills and tools involved lved were PrimeTime, perl, tcl (basic), cshell (basic). Using all mentioned skills I was responsible for analyzing the various PVT corners and reduce the redundancy in pre-silicon timing. The role involved managing data up to more than 10GB for each run. \nComponent Design Engineer July 2013-March 2015 \no\tLed and managed the power delivery collaterals at lane level (datalane/commonlane). These include cap extraction and measuring avg. current with the aim of leakage reduction. \no\tMixed Signal Validation (MSV) was a key aspect of the job. Owned the MSV flow on internal tests for the IOs (like USB3/PCIe2/SATA3) for SoCs. \no\tMaintain the power rollup documentation using MS Excel for all SOC based projects. This included a close monitoring of the power specs. \no\tWork on schematic building: Built and created schematic in 14nm cadence environment to assist design team \no\tThe knowledge I gained in ADEXL during schematic building, was useful for EV and IDV simulations. These IDV sims were used to characterize cells for operating conditions. \n IP Logic Design Engineer Intel Corporation July 2013  – Present (2 years 2 months) San Francisco Bay Area Intel Corporation \nLogic IP Design Engineer March 2015-Present \n•\tEmployed Fulltime as a Logic IP Design engineer in the DFX team IDGz Hard IP TMO. \n•\tCurrent responsibilities comprise of: \no\tFinished ramp up on DFX SCAN and started working on Fault grading.  \no\tAs an owner of the fault grade flow, work with numerous teams (currently on DDRIO) for integrating the design with the needs of the flow. \no\tInvolvement in editing scripts, integrating design, taking a judgment call on the signals to be tested for DUT. \no\tAim of the flow is to improve results of dfx scan and provide a better dfx coverage in all Hard IPs \no\tWorked with the Timing Analysis team using PrimeTime for IOs with a focus on reduction of number of PVT corners used for pre-silicon timing analysis. \no\tThe key skills and tools involved lved were PrimeTime, perl, tcl (basic), cshell (basic). Using all mentioned skills I was responsible for analyzing the various PVT corners and reduce the redundancy in pre-silicon timing. The role involved managing data up to more than 10GB for each run. \nComponent Design Engineer July 2013-March 2015 \no\tLed and managed the power delivery collaterals at lane level (datalane/commonlane). These include cap extraction and measuring avg. current with the aim of leakage reduction. \no\tMixed Signal Validation (MSV) was a key aspect of the job. Owned the MSV flow on internal tests for the IOs (like USB3/PCIe2/SATA3) for SoCs. \no\tMaintain the power rollup documentation using MS Excel for all SOC based projects. This included a close monitoring of the power specs. \no\tWork on schematic building: Built and created schematic in 14nm cadence environment to assist design team \no\tThe knowledge I gained in ADEXL during schematic building, was useful for EV and IDV simulations. These IDV sims were used to characterize cells for operating conditions. \n Graduate Technical Intern Intel Corporation May 2012  –  April 2013  (1 year) San Francisco Bay Area •\tGraduate Technical Intern at Intel Corporation May 2012-Present \nWorking as an Intern with the IDGz Hard-IP group to perform competitive analysis and benchmarking summaries on Intel vs Best in class industry products.  \no\tPreparation of competitive summaries by scaling area sizes to current technologies for apples to apples comparison. This includes silicon die area measurements using AutoCad and thereby conducting competitive comparisons of silicon area. \no\tCreation/maintenance of a competitive analysis database that focuses on analysis of leading market vendors as well as all internal Intel products. This helped in organization and handling of all HIP data allowing the creation of benchmarking summaries with ease. \no\tEmphasis is laid on IO’s like Display, USB, GPIOs and LPDDR. \nFor an average of two days per week, I supported the High-Speed Serial IO team on post silicon validation of the SATA2 interface on Valleyview X0 and A0.  \no\tModification of scripts for jitter tolerance test automation, executed these scripts on Valleyview X0, and set up benches for Valleyview A0. Graduate Technical Intern Intel Corporation May 2012  –  April 2013  (1 year) San Francisco Bay Area •\tGraduate Technical Intern at Intel Corporation May 2012-Present \nWorking as an Intern with the IDGz Hard-IP group to perform competitive analysis and benchmarking summaries on Intel vs Best in class industry products.  \no\tPreparation of competitive summaries by scaling area sizes to current technologies for apples to apples comparison. This includes silicon die area measurements using AutoCad and thereby conducting competitive comparisons of silicon area. \no\tCreation/maintenance of a competitive analysis database that focuses on analysis of leading market vendors as well as all internal Intel products. This helped in organization and handling of all HIP data allowing the creation of benchmarking summaries with ease. \no\tEmphasis is laid on IO’s like Display, USB, GPIOs and LPDDR. \nFor an average of two days per week, I supported the High-Speed Serial IO team on post silicon validation of the SATA2 interface on Valleyview X0 and A0.  \no\tModification of scripts for jitter tolerance test automation, executed these scripts on Valleyview X0, and set up benches for Valleyview A0. Languages English Native or bilingual proficiency Hindi Native or bilingual proficiency English Native or bilingual proficiency Hindi Native or bilingual proficiency English Native or bilingual proficiency Hindi Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Semiconductors Verilog Competitive Analysis VLSI Analysis Manufacturing Perl TCL Synopsys Primetime Microsoft Excel simplescala Visio AutoCAD Analog Circuit Design DFX Fault Finding See 1+     See less Skills  Semiconductors Verilog Competitive Analysis VLSI Analysis Manufacturing Perl TCL Synopsys Primetime Microsoft Excel simplescala Visio AutoCAD Analog Circuit Design DFX Fault Finding See 1+     See less Semiconductors Verilog Competitive Analysis VLSI Analysis Manufacturing Perl TCL Synopsys Primetime Microsoft Excel simplescala Visio AutoCAD Analog Circuit Design DFX Fault Finding See 1+     See less Semiconductors Verilog Competitive Analysis VLSI Analysis Manufacturing Perl TCL Synopsys Primetime Microsoft Excel simplescala Visio AutoCAD Analog Circuit Design DFX Fault Finding See 1+     See less Education Arizona State University Master of Engineering (M.Eng.),  Electrical and Electronics Engineering 2011  – 2013 Amity University Bachelor's degree,  Electrical , Electronics and Communications Engineering 2007  – 2011 Arizona State University Master of Engineering (M.Eng.),  Electrical and Electronics Engineering 2011  – 2013 Arizona State University Master of Engineering (M.Eng.),  Electrical and Electronics Engineering 2011  – 2013 Arizona State University Master of Engineering (M.Eng.),  Electrical and Electronics Engineering 2011  – 2013 Amity University Bachelor's degree,  Electrical , Electronics and Communications Engineering 2007  – 2011 Amity University Bachelor's degree,  Electrical , Electronics and Communications Engineering 2007  – 2011 Amity University Bachelor's degree,  Electrical , Electronics and Communications Engineering 2007  – 2011 ", "Summary Electrical engineer with great passion for VLSI design , Computer architecture and experience in verification methodolgy and FPGA with excellent organizational skills Summary Electrical engineer with great passion for VLSI design , Computer architecture and experience in verification methodolgy and FPGA with excellent organizational skills Electrical engineer with great passion for VLSI design , Computer architecture and experience in verification methodolgy and FPGA with excellent organizational skills Electrical engineer with great passion for VLSI design , Computer architecture and experience in verification methodolgy and FPGA with excellent organizational skills Experience IP Logic Design Engineer Intel Corporation February 2015  – Present (7 months) Massachusetts Working on the logic design of an IP in a server product Graduate Technical Intern Intel Corporation June 2013  –  December 2013  (7 months) Santa Clara •\tStudied SoC Design Hierarchy and Verification flow.\t \n•\tModified and implemented various SoC Design scripts which builds wrappers, simulated\tand verified.\t \n•\tChanged the OVM sequences to have the test cases passed with FPGA specific HDL files. \n•\tDeveloped the test cases for testing in Virtex 7 board through PCIE  \n•\tSynthesized the design and ported the bit file to the board . \n•\tInteracted with the IP block through the request and response transactions through primary and sideband fabric to have the test case passed (debugging through Chipscope). IP Logic Design Engineer Intel Corporation February 2015  – Present (7 months) Massachusetts Working on the logic design of an IP in a server product IP Logic Design Engineer Intel Corporation February 2015  – Present (7 months) Massachusetts Working on the logic design of an IP in a server product Graduate Technical Intern Intel Corporation June 2013  –  December 2013  (7 months) Santa Clara •\tStudied SoC Design Hierarchy and Verification flow.\t \n•\tModified and implemented various SoC Design scripts which builds wrappers, simulated\tand verified.\t \n•\tChanged the OVM sequences to have the test cases passed with FPGA specific HDL files. \n•\tDeveloped the test cases for testing in Virtex 7 board through PCIE  \n•\tSynthesized the design and ported the bit file to the board . \n•\tInteracted with the IP block through the request and response transactions through primary and sideband fabric to have the test case passed (debugging through Chipscope). Graduate Technical Intern Intel Corporation June 2013  –  December 2013  (7 months) Santa Clara •\tStudied SoC Design Hierarchy and Verification flow.\t \n•\tModified and implemented various SoC Design scripts which builds wrappers, simulated\tand verified.\t \n•\tChanged the OVM sequences to have the test cases passed with FPGA specific HDL files. \n•\tDeveloped the test cases for testing in Virtex 7 board through PCIE  \n•\tSynthesized the design and ported the bit file to the board . \n•\tInteracted with the IP block through the request and response transactions through primary and sideband fabric to have the test case passed (debugging through Chipscope). Languages English Tamil Native or bilingual proficiency English Tamil Native or bilingual proficiency English Tamil Native or bilingual proficiency Native or bilingual proficiency Skills Cadence Virtuoso VLSI Computer Architecture Verilog VHDL Xilinx ISE Altera Quartus SPICE C++ Language C Matlab Labview CAD Lex Yacc Keil System Verilog SystemVerilog FPGA SoC Debugging Digital Electronics Logic Synthesis Xilinx C++ Testing Perl PCIe ModelSim ASIC See 15+     See less Skills  Cadence Virtuoso VLSI Computer Architecture Verilog VHDL Xilinx ISE Altera Quartus SPICE C++ Language C Matlab Labview CAD Lex Yacc Keil System Verilog SystemVerilog FPGA SoC Debugging Digital Electronics Logic Synthesis Xilinx C++ Testing Perl PCIe ModelSim ASIC See 15+     See less Cadence Virtuoso VLSI Computer Architecture Verilog VHDL Xilinx ISE Altera Quartus SPICE C++ Language C Matlab Labview CAD Lex Yacc Keil System Verilog SystemVerilog FPGA SoC Debugging Digital Electronics Logic Synthesis Xilinx C++ Testing Perl PCIe ModelSim ASIC See 15+     See less Cadence Virtuoso VLSI Computer Architecture Verilog VHDL Xilinx ISE Altera Quartus SPICE C++ Language C Matlab Labview CAD Lex Yacc Keil System Verilog SystemVerilog FPGA SoC Debugging Digital Electronics Logic Synthesis Xilinx C++ Testing Perl PCIe ModelSim ASIC See 15+     See less Education University of Massachusetts, Amherst Master of Science (M.S.),  VLSI, CAD and Embedded Systems 2012  – 2014 Madras Institute of Technology,Anna University Bachelor of Engineering (B.E.),  Electronnics and Communication Engineering , 8.88/10 2008  – 2012 University of Massachusetts, Amherst Master of Science (M.S.),  VLSI, CAD and Embedded Systems 2012  – 2014 University of Massachusetts, Amherst Master of Science (M.S.),  VLSI, CAD and Embedded Systems 2012  – 2014 University of Massachusetts, Amherst Master of Science (M.S.),  VLSI, CAD and Embedded Systems 2012  – 2014 Madras Institute of Technology,Anna University Bachelor of Engineering (B.E.),  Electronnics and Communication Engineering , 8.88/10 2008  – 2012 Madras Institute of Technology,Anna University Bachelor of Engineering (B.E.),  Electronnics and Communication Engineering , 8.88/10 2008  – 2012 Madras Institute of Technology,Anna University Bachelor of Engineering (B.E.),  Electronnics and Communication Engineering , 8.88/10 2008  – 2012 ", "Experience IP Logic Design Engineer Intel Corporation June 2008  – Present (7 years 3 months) Austin, Texas Area Undergrad Intern Technical Intel Corporation May 2007  –  January 2008  (9 months) Austin, Texas Area Undergrad Intern Technical Intel Corporation May 2006  –  August 2006  (4 months) Greater Boston Area Undergrad Intern Technical Intel Corporation August 2005  –  January 2006  (6 months) Greater Boston Area Undergrad Intern Technical Intel Corporation January 2005  –  April 2005  (4 months) Greater Boston Area IP Logic Design Engineer Intel Corporation June 2008  – Present (7 years 3 months) Austin, Texas Area IP Logic Design Engineer Intel Corporation June 2008  – Present (7 years 3 months) Austin, Texas Area Undergrad Intern Technical Intel Corporation May 2007  –  January 2008  (9 months) Austin, Texas Area Undergrad Intern Technical Intel Corporation May 2007  –  January 2008  (9 months) Austin, Texas Area Undergrad Intern Technical Intel Corporation May 2006  –  August 2006  (4 months) Greater Boston Area Undergrad Intern Technical Intel Corporation May 2006  –  August 2006  (4 months) Greater Boston Area Undergrad Intern Technical Intel Corporation August 2005  –  January 2006  (6 months) Greater Boston Area Undergrad Intern Technical Intel Corporation August 2005  –  January 2006  (6 months) Greater Boston Area Undergrad Intern Technical Intel Corporation January 2005  –  April 2005  (4 months) Greater Boston Area Undergrad Intern Technical Intel Corporation January 2005  –  April 2005  (4 months) Greater Boston Area Education University of Toledo University of Toledo University of Toledo University of Toledo "]}