{"position": "IT Engineer", "company": "Intel Corporation", "profiles": ["Summary I am always energetic and I go at all of my projects with a full steam and give it all I have until the my projects are finished with satisfactory results. To summarize, I never give up until everything I've set out to do have been accomplished. Summary I am always energetic and I go at all of my projects with a full steam and give it all I have until the my projects are finished with satisfactory results. To summarize, I never give up until everything I've set out to do have been accomplished. I am always energetic and I go at all of my projects with a full steam and give it all I have until the my projects are finished with satisfactory results. To summarize, I never give up until everything I've set out to do have been accomplished. I am always energetic and I go at all of my projects with a full steam and give it all I have until the my projects are finished with satisfactory results. To summarize, I never give up until everything I've set out to do have been accomplished. Experience Sr. IT Engineer Intel Corporation April 2007  – Present (8 years 5 months) Santa Clara, California My duties were to support all internal users with all aspects of IT functions and that includes hardware, software, and network. I've built and maintain all print servers on our campus. I also support phone and voice communications for all of our internal users as well. IT Engineer Network Associates Inc (McAfee) 2007  – Present (8 years) Full IT support of all areas such as hardware, software, network, and telecommunications. Network Administrator ComUnity Lending April 1999  –  March 2007  (8 years) Network Administrator ComUnity Lending 1999  –  2007  (8 years) Sr. IT Engineer Intel Corporation April 2007  – Present (8 years 5 months) Santa Clara, California My duties were to support all internal users with all aspects of IT functions and that includes hardware, software, and network. I've built and maintain all print servers on our campus. I also support phone and voice communications for all of our internal users as well. Sr. IT Engineer Intel Corporation April 2007  – Present (8 years 5 months) Santa Clara, California My duties were to support all internal users with all aspects of IT functions and that includes hardware, software, and network. I've built and maintain all print servers on our campus. I also support phone and voice communications for all of our internal users as well. IT Engineer Network Associates Inc (McAfee) 2007  – Present (8 years) Full IT support of all areas such as hardware, software, network, and telecommunications. IT Engineer Network Associates Inc (McAfee) 2007  – Present (8 years) Full IT support of all areas such as hardware, software, network, and telecommunications. Network Administrator ComUnity Lending April 1999  –  March 2007  (8 years) Network Administrator ComUnity Lending April 1999  –  March 2007  (8 years) Network Administrator ComUnity Lending 1999  –  2007  (8 years) Network Administrator ComUnity Lending 1999  –  2007  (8 years) Languages English Vietnamese English Vietnamese English Vietnamese Skills Servers DNS McAfee Network Security Firewalls IPS Linux Microsoft SQL Server IDS Windows SharePoint Active Directory VPN Security VMware ESX Cloud Computing ITIL v3 Foundations... Information Security Computer Security Virtualization VMware TCP/IP Antivirus IT Operations Microsoft Exchange CISSP Cisco Technologies Data Center Disaster Recovery Network Architecture System Administration Information Security... Switches Unix Windows Server Windows 7 Encryption Wireless Networking Red Hat Linux Penetration Testing Internet Security IIS Blackberry Enterprise... System Deployment SAN LAN-WAN High Availability Endpoint Security Application Security PKI See 35+     See less Skills  Servers DNS McAfee Network Security Firewalls IPS Linux Microsoft SQL Server IDS Windows SharePoint Active Directory VPN Security VMware ESX Cloud Computing ITIL v3 Foundations... Information Security Computer Security Virtualization VMware TCP/IP Antivirus IT Operations Microsoft Exchange CISSP Cisco Technologies Data Center Disaster Recovery Network Architecture System Administration Information Security... Switches Unix Windows Server Windows 7 Encryption Wireless Networking Red Hat Linux Penetration Testing Internet Security IIS Blackberry Enterprise... System Deployment SAN LAN-WAN High Availability Endpoint Security Application Security PKI See 35+     See less Servers DNS McAfee Network Security Firewalls IPS Linux Microsoft SQL Server IDS Windows SharePoint Active Directory VPN Security VMware ESX Cloud Computing ITIL v3 Foundations... Information Security Computer Security Virtualization VMware TCP/IP Antivirus IT Operations Microsoft Exchange CISSP Cisco Technologies Data Center Disaster Recovery Network Architecture System Administration Information Security... Switches Unix Windows Server Windows 7 Encryption Wireless Networking Red Hat Linux Penetration Testing Internet Security IIS Blackberry Enterprise... System Deployment SAN LAN-WAN High Availability Endpoint Security Application Security PKI See 35+     See less Servers DNS McAfee Network Security Firewalls IPS Linux Microsoft SQL Server IDS Windows SharePoint Active Directory VPN Security VMware ESX Cloud Computing ITIL v3 Foundations... Information Security Computer Security Virtualization VMware TCP/IP Antivirus IT Operations Microsoft Exchange CISSP Cisco Technologies Data Center Disaster Recovery Network Architecture System Administration Information Security... Switches Unix Windows Server Windows 7 Encryption Wireless Networking Red Hat Linux Penetration Testing Internet Security IIS Blackberry Enterprise... System Deployment SAN LAN-WAN High Availability Endpoint Security Application Security PKI See 35+     See less Education DeVry University Bachelor of Science (B.S.),  Network Communications/Technical Management 2006  – 2011 Attended all classes with daily full participation and contribute to my professors regarding the topics at hand. DeVry University Bachelor of Science (B.S.),  Technical Management 2006 DeVry University Bachelor of Science (B.S.) - Network Communications/Technical Management DeVry University Bachelor of Science (B.S.),  Network Communications/Technical Management 2006  – 2011 Attended all classes with daily full participation and contribute to my professors regarding the topics at hand. DeVry University Bachelor of Science (B.S.),  Network Communications/Technical Management 2006  – 2011 Attended all classes with daily full participation and contribute to my professors regarding the topics at hand. DeVry University Bachelor of Science (B.S.),  Network Communications/Technical Management 2006  – 2011 Attended all classes with daily full participation and contribute to my professors regarding the topics at hand. DeVry University Bachelor of Science (B.S.),  Technical Management 2006 DeVry University Bachelor of Science (B.S.),  Technical Management 2006 DeVry University Bachelor of Science (B.S.),  Technical Management 2006 DeVry University Bachelor of Science (B.S.) - Network Communications/Technical Management DeVry University Bachelor of Science (B.S.) - Network Communications/Technical Management DeVry University Bachelor of Science (B.S.) - Network Communications/Technical Management ", "Summary Experienced SW Eng. Went through many projects in different disciplines including pre silicon, post silicon, and IT. Summary Experienced SW Eng. Went through many projects in different disciplines including pre silicon, post silicon, and IT. Experienced SW Eng. Went through many projects in different disciplines including pre silicon, post silicon, and IT. Experienced SW Eng. Went through many projects in different disciplines including pre silicon, post silicon, and IT. Experience ATPG Design Automation Intel Corporation 2012  – Present (3 years) Haifa Development and Maintenance of automated tools for scan insertion, scan verification and patterns generation. Post Silicon Validation - System Eng. Intel Corporation 2007  –  2011  (4 years) Test program development \nIntegration Post silicon validation - team leader Intel Corporation 2005  –  2007  (2 years) IT Engineer Intel Corporation 1998  –  2004  (6 years) ATPG Design Automation Intel Corporation 2012  – Present (3 years) Haifa Development and Maintenance of automated tools for scan insertion, scan verification and patterns generation. ATPG Design Automation Intel Corporation 2012  – Present (3 years) Haifa Development and Maintenance of automated tools for scan insertion, scan verification and patterns generation. Post Silicon Validation - System Eng. Intel Corporation 2007  –  2011  (4 years) Test program development \nIntegration Post Silicon Validation - System Eng. Intel Corporation 2007  –  2011  (4 years) Test program development \nIntegration Post silicon validation - team leader Intel Corporation 2005  –  2007  (2 years) Post silicon validation - team leader Intel Corporation 2005  –  2007  (2 years) IT Engineer Intel Corporation 1998  –  2004  (6 years) IT Engineer Intel Corporation 1998  –  2004  (6 years) Languages   Skills Intel Debugging Perl VLSI TCL VBScript C# ATPG SQL IT Solutions Skills  Intel Debugging Perl VLSI TCL VBScript C# ATPG SQL IT Solutions Intel Debugging Perl VLSI TCL VBScript C# ATPG SQL IT Solutions Intel Debugging Perl VLSI TCL VBScript C# ATPG SQL IT Solutions ", "Experience it engineer Intel Corporation it engineer Intel Corporation it engineer Intel Corporation ", "Experience C++ developer Noveo Group June 2013  – Present (2 years 3 months) IT engineer Intel Corporation September 2010  –  May 2012  (1 year 9 months) IT engineer Intel Corporation March 2007  –  December 2007  (10 months) C++ developer Noveo Group June 2013  – Present (2 years 3 months) C++ developer Noveo Group June 2013  – Present (2 years 3 months) IT engineer Intel Corporation September 2010  –  May 2012  (1 year 9 months) IT engineer Intel Corporation September 2010  –  May 2012  (1 year 9 months) IT engineer Intel Corporation March 2007  –  December 2007  (10 months) IT engineer Intel Corporation March 2007  –  December 2007  (10 months) Skills C++ PHP Java HTML JavaScript Boost C++ OpenMP Linux System... MySQL PostgreSQL Parallel Programming CSS Shell Scripting LaTeX Skills  C++ PHP Java HTML JavaScript Boost C++ OpenMP Linux System... MySQL PostgreSQL Parallel Programming CSS Shell Scripting LaTeX C++ PHP Java HTML JavaScript Boost C++ OpenMP Linux System... MySQL PostgreSQL Parallel Programming CSS Shell Scripting LaTeX C++ PHP Java HTML JavaScript Boost C++ OpenMP Linux System... MySQL PostgreSQL Parallel Programming CSS Shell Scripting LaTeX Education Novosibirsk State University (NSU) Bachelor's degree,  Applied Mathematics 2008  – 2013 Novosibirsk State University (NSU) Bachelor's degree,  Applied Mathematics 2008  – 2013 Novosibirsk State University (NSU) Bachelor's degree,  Applied Mathematics 2008  – 2013 Novosibirsk State University (NSU) Bachelor's degree,  Applied Mathematics 2008  – 2013 ", "Summary An IT Specialist who loves to improve QVEC (Quality, Velocity, Efficiency, & Cost). It's all about optimization. Summary An IT Specialist who loves to improve QVEC (Quality, Velocity, Efficiency, & Cost). It's all about optimization. An IT Specialist who loves to improve QVEC (Quality, Velocity, Efficiency, & Cost). It's all about optimization. An IT Specialist who loves to improve QVEC (Quality, Velocity, Efficiency, & Cost). It's all about optimization. Experience Senior IT Systems Engineer Intel Corporation July 1995  – Present (20 years 2 months) Folsom Currently leading Intel IT's Security Compliance and Configuration Engineering group. \n* Manage over 220,000 internal computers through a modern compliance and software delivery solution. \n* Engineer, test, and manage upgrades to the system \n* Develop custom solutions to augment existing capabilities. Senior IT Systems Engineer Intel Corporation July 1995  – Present (20 years 2 months) Folsom Currently leading Intel IT's Security Compliance and Configuration Engineering group. \n* Manage over 220,000 internal computers through a modern compliance and software delivery solution. \n* Engineer, test, and manage upgrades to the system \n* Develop custom solutions to augment existing capabilities. Senior IT Systems Engineer Intel Corporation July 1995  – Present (20 years 2 months) Folsom Currently leading Intel IT's Security Compliance and Configuration Engineering group. \n* Manage over 220,000 internal computers through a modern compliance and software delivery solution. \n* Engineer, test, and manage upgrades to the system \n* Develop custom solutions to augment existing capabilities. Skills Operating Systems Requirements Gathering Cross-functional Team... Microsoft SQL Server Technical Writing Windows Quality Assurance Cloud Computing Intel Hardware Linux System Administration Distributed Systems VBScript Windows Batch T-SQL Stored Procedures Management See 2+     See less Skills  Operating Systems Requirements Gathering Cross-functional Team... Microsoft SQL Server Technical Writing Windows Quality Assurance Cloud Computing Intel Hardware Linux System Administration Distributed Systems VBScript Windows Batch T-SQL Stored Procedures Management See 2+     See less Operating Systems Requirements Gathering Cross-functional Team... Microsoft SQL Server Technical Writing Windows Quality Assurance Cloud Computing Intel Hardware Linux System Administration Distributed Systems VBScript Windows Batch T-SQL Stored Procedures Management See 2+     See less Operating Systems Requirements Gathering Cross-functional Team... Microsoft SQL Server Technical Writing Windows Quality Assurance Cloud Computing Intel Hardware Linux System Administration Distributed Systems VBScript Windows Batch T-SQL Stored Procedures Management See 2+     See less Education University of California, Davis - Graduate School of Management MBA,  Business 1998  – 2001 Completed my MBA degree through the Working Professionals program while working full time at Intel. University of California, Davis BS,  Civil Engineering 1990  – 1995 Activities and Societies:  Alpha Phi Omega University of California, Davis - Graduate School of Management MBA,  Business 1998  – 2001 Completed my MBA degree through the Working Professionals program while working full time at Intel. University of California, Davis - Graduate School of Management MBA,  Business 1998  – 2001 Completed my MBA degree through the Working Professionals program while working full time at Intel. University of California, Davis - Graduate School of Management MBA,  Business 1998  – 2001 Completed my MBA degree through the Working Professionals program while working full time at Intel. University of California, Davis BS,  Civil Engineering 1990  – 1995 Activities and Societies:  Alpha Phi Omega University of California, Davis BS,  Civil Engineering 1990  – 1995 Activities and Societies:  Alpha Phi Omega University of California, Davis BS,  Civil Engineering 1990  – 1995 Activities and Societies:  Alpha Phi Omega ", "Experience it engineer Intel Corporation it engineer Intel Corporation it engineer Intel Corporation ", "Experience IT Engineer Intel Corporation May 2014  – Present (1 year 4 months) IT Engineer Intel Corporation May 2014  – Present (1 year 4 months) IT Engineer Intel Corporation May 2014  – Present (1 year 4 months) Languages   Skills C# C C++ Java Microsoft Office SQL Python OOP Visual Studio Photoshop CCNA Eclipse Programming Software Development Skills  C# C C++ Java Microsoft Office SQL Python OOP Visual Studio Photoshop CCNA Eclipse Programming Software Development C# C C++ Java Microsoft Office SQL Python OOP Visual Studio Photoshop CCNA Eclipse Programming Software Development C# C C++ Java Microsoft Office SQL Python OOP Visual Studio Photoshop CCNA Eclipse Programming Software Development Education Ben-Gurion University of the Negev Information Systems Engineering 2012  – 2016 Ben-Gurion University of the Negev Information Systems Engineering 2012  – 2016 Ben-Gurion University of the Negev Information Systems Engineering 2012  – 2016 Ben-Gurion University of the Negev Information Systems Engineering 2012  – 2016 ", "Summary Energetic IT leader with a record of achievement in delivering smooth operations, productivity, and cost savings through excellence in management of high-profile IT infrastructure. Extensive expertise in Microsoft and VMware technologies Summary Energetic IT leader with a record of achievement in delivering smooth operations, productivity, and cost savings through excellence in management of high-profile IT infrastructure. Extensive expertise in Microsoft and VMware technologies Energetic IT leader with a record of achievement in delivering smooth operations, productivity, and cost savings through excellence in management of high-profile IT infrastructure. Extensive expertise in Microsoft and VMware technologies Energetic IT leader with a record of achievement in delivering smooth operations, productivity, and cost savings through excellence in management of high-profile IT infrastructure. Extensive expertise in Microsoft and VMware technologies Experience Sr. IT Engineer Intel Corporation November 2010  – Present (4 years 10 months) Dallas/Fort Worth Area Played a leading role in a 24/7 IT operations team monitoring the enterprise (servers, network, and applications). Supported Windows/Linux Servers (virtual machine/physical) across 8 datacenters worldwide and 50+ remote offices. Configured backups for servers, and troubleshot backup failures. Provided training, authored documentation/run books for the Global Operations Center (GOC) team, and liaised between the GOC and the infrastructure services team. Leveraged Remedy ticketing for working incidents, requests, tasks, and work orders. Monitored with HP tools, and responded to alerts. \n \nHighlights \n•\tServed instrumentally in building the 24/7 team from the ground up to monitor and support infrastructure; developed documentation on how to remediate situations. \n•\tImproved client satisfaction by advancing performance and service. \no\tCut monitoring alerts noise/false alarms by 90% and improved productivity by gathering information from clients and adjusting monitoring thresholds based on client perceptions. \no\tAchieved all targets for acknowledging/closing out incidents/work orders and resolving backup failures for servers, including SOX-classified servers; attained 99.9% uptime on servers and applications and 99% successful backups. \no\tBoosted efficiency of the self-service portal by collaborating with the IT Service Management Team to facilitate building forms. \n Enterprise Client Services Manager McAfee (Aquired by Intel) July 2010  –  December 2010  (6 months) Plano, TX Led a global team of technical experts. Orchestrated mobile device management and global client systems patch management, desktop client management, and client security management (firewall, anti-virus, intrusion prevention, group policy, end point encryption). \n \nHighlights \n•\tSuccessfully launched the mobile email solution McAfee EMM to internal McAfee globally. \n•\tIncreased efficiency and cut troubleshooting time with a process progressively deploying new product releases on small internal groups until released throughout the organization. \n•\tAchieved 99% security compliance with current end-point virus definition (DAT files) and Windows security updates. \n IT Operations Tier 2 Site Supervisor McAfee December 2001  –  July 2010  (8 years 8 months) Dallas/Fort Worth Area Led a team of four engineers in supporting1000+ users at the Plano facility, headquarters to Legal, Human Resources, Finance, Sales, IT, Engineering, and Technical Support. Oversaw a team delivering second-level desktop support on escalated issues/requests. Provided 24/7 direct support to McAfee Vice Presidents with laptops/smartphones. Supported print devices and servers. Traveled internationally to provide IT and AV support for meetings and conferences. Collaborated with a team upgrading Windows for 5000+ end users, and relocated the McAfee office and datacenter from Dallas to Plano. \n \nHighlights \n•\tReduced the number of incidents and improved response time by applying the problem management process and training the team on frequent issues. \n•\tCreated a successful premium support team for company VIPs, setting up a hotline number with a process to accelerate response time. \n•\tSaved on costs by migrating printers from HP to Xerox and users from RSA VPN hard tokens to RSA VPN soft tokens. \n•\tPlayed a critical role in integrating acquired companies into the McAfee infrastructure as part of the Mergers and Acquisitions (M&A) team. \n IT System Administrator DNA Sciences, Inc. April 2000  –  October 2001  (1 year 7 months) San Francisco Bay Area -Responsible for all Windows servers and services running (Active Directory, DNS, DHCP, Exchange, and File servers).  \n-Perform backups and restores utilizing Veritas Backup Exec.  \n-Delivered desktop support for the office, which accounted for about 100 users.  \n-Created and maintained computer images for rapid deployment on PC’s. I documented hardware/software standards for the company \n \naccomplished major projects successfully:  \n-Upgraded entire office from Windows NT 4.0 workstation to Windows 2000 Professional -Relocated our office and data center from the Mountain View, CA to Fremont, CA location -Migrated acquired company into DNA Sciences network environment -Decommissioned Novell network, and migrated to a Microsoft network infrastructure. IT Operations Tier 2 Desktop Support McAfee March 1997  –  April 2000  (3 years 2 months) San Francisco Bay Area -I worked with a team that provided 2nd level desktop support for the McAfee office in Santa Clara, CA. Santa Clara office was McAfee headquarters, and occupied more than 1000 employees.  \n-Worked a variety of desktop issues/requests for end users in the building, and remotely. Supported all print devices, and print servers. Utilized helpdesk ticketing system to track incidents and work orders. Sr. IT Engineer Intel Corporation November 2010  – Present (4 years 10 months) Dallas/Fort Worth Area Played a leading role in a 24/7 IT operations team monitoring the enterprise (servers, network, and applications). Supported Windows/Linux Servers (virtual machine/physical) across 8 datacenters worldwide and 50+ remote offices. Configured backups for servers, and troubleshot backup failures. Provided training, authored documentation/run books for the Global Operations Center (GOC) team, and liaised between the GOC and the infrastructure services team. Leveraged Remedy ticketing for working incidents, requests, tasks, and work orders. Monitored with HP tools, and responded to alerts. \n \nHighlights \n•\tServed instrumentally in building the 24/7 team from the ground up to monitor and support infrastructure; developed documentation on how to remediate situations. \n•\tImproved client satisfaction by advancing performance and service. \no\tCut monitoring alerts noise/false alarms by 90% and improved productivity by gathering information from clients and adjusting monitoring thresholds based on client perceptions. \no\tAchieved all targets for acknowledging/closing out incidents/work orders and resolving backup failures for servers, including SOX-classified servers; attained 99.9% uptime on servers and applications and 99% successful backups. \no\tBoosted efficiency of the self-service portal by collaborating with the IT Service Management Team to facilitate building forms. \n Sr. IT Engineer Intel Corporation November 2010  – Present (4 years 10 months) Dallas/Fort Worth Area Played a leading role in a 24/7 IT operations team monitoring the enterprise (servers, network, and applications). Supported Windows/Linux Servers (virtual machine/physical) across 8 datacenters worldwide and 50+ remote offices. Configured backups for servers, and troubleshot backup failures. Provided training, authored documentation/run books for the Global Operations Center (GOC) team, and liaised between the GOC and the infrastructure services team. Leveraged Remedy ticketing for working incidents, requests, tasks, and work orders. Monitored with HP tools, and responded to alerts. \n \nHighlights \n•\tServed instrumentally in building the 24/7 team from the ground up to monitor and support infrastructure; developed documentation on how to remediate situations. \n•\tImproved client satisfaction by advancing performance and service. \no\tCut monitoring alerts noise/false alarms by 90% and improved productivity by gathering information from clients and adjusting monitoring thresholds based on client perceptions. \no\tAchieved all targets for acknowledging/closing out incidents/work orders and resolving backup failures for servers, including SOX-classified servers; attained 99.9% uptime on servers and applications and 99% successful backups. \no\tBoosted efficiency of the self-service portal by collaborating with the IT Service Management Team to facilitate building forms. \n Enterprise Client Services Manager McAfee (Aquired by Intel) July 2010  –  December 2010  (6 months) Plano, TX Led a global team of technical experts. Orchestrated mobile device management and global client systems patch management, desktop client management, and client security management (firewall, anti-virus, intrusion prevention, group policy, end point encryption). \n \nHighlights \n•\tSuccessfully launched the mobile email solution McAfee EMM to internal McAfee globally. \n•\tIncreased efficiency and cut troubleshooting time with a process progressively deploying new product releases on small internal groups until released throughout the organization. \n•\tAchieved 99% security compliance with current end-point virus definition (DAT files) and Windows security updates. \n Enterprise Client Services Manager McAfee (Aquired by Intel) July 2010  –  December 2010  (6 months) Plano, TX Led a global team of technical experts. Orchestrated mobile device management and global client systems patch management, desktop client management, and client security management (firewall, anti-virus, intrusion prevention, group policy, end point encryption). \n \nHighlights \n•\tSuccessfully launched the mobile email solution McAfee EMM to internal McAfee globally. \n•\tIncreased efficiency and cut troubleshooting time with a process progressively deploying new product releases on small internal groups until released throughout the organization. \n•\tAchieved 99% security compliance with current end-point virus definition (DAT files) and Windows security updates. \n IT Operations Tier 2 Site Supervisor McAfee December 2001  –  July 2010  (8 years 8 months) Dallas/Fort Worth Area Led a team of four engineers in supporting1000+ users at the Plano facility, headquarters to Legal, Human Resources, Finance, Sales, IT, Engineering, and Technical Support. Oversaw a team delivering second-level desktop support on escalated issues/requests. Provided 24/7 direct support to McAfee Vice Presidents with laptops/smartphones. Supported print devices and servers. Traveled internationally to provide IT and AV support for meetings and conferences. Collaborated with a team upgrading Windows for 5000+ end users, and relocated the McAfee office and datacenter from Dallas to Plano. \n \nHighlights \n•\tReduced the number of incidents and improved response time by applying the problem management process and training the team on frequent issues. \n•\tCreated a successful premium support team for company VIPs, setting up a hotline number with a process to accelerate response time. \n•\tSaved on costs by migrating printers from HP to Xerox and users from RSA VPN hard tokens to RSA VPN soft tokens. \n•\tPlayed a critical role in integrating acquired companies into the McAfee infrastructure as part of the Mergers and Acquisitions (M&A) team. \n IT Operations Tier 2 Site Supervisor McAfee December 2001  –  July 2010  (8 years 8 months) Dallas/Fort Worth Area Led a team of four engineers in supporting1000+ users at the Plano facility, headquarters to Legal, Human Resources, Finance, Sales, IT, Engineering, and Technical Support. Oversaw a team delivering second-level desktop support on escalated issues/requests. Provided 24/7 direct support to McAfee Vice Presidents with laptops/smartphones. Supported print devices and servers. Traveled internationally to provide IT and AV support for meetings and conferences. Collaborated with a team upgrading Windows for 5000+ end users, and relocated the McAfee office and datacenter from Dallas to Plano. \n \nHighlights \n•\tReduced the number of incidents and improved response time by applying the problem management process and training the team on frequent issues. \n•\tCreated a successful premium support team for company VIPs, setting up a hotline number with a process to accelerate response time. \n•\tSaved on costs by migrating printers from HP to Xerox and users from RSA VPN hard tokens to RSA VPN soft tokens. \n•\tPlayed a critical role in integrating acquired companies into the McAfee infrastructure as part of the Mergers and Acquisitions (M&A) team. \n IT System Administrator DNA Sciences, Inc. April 2000  –  October 2001  (1 year 7 months) San Francisco Bay Area -Responsible for all Windows servers and services running (Active Directory, DNS, DHCP, Exchange, and File servers).  \n-Perform backups and restores utilizing Veritas Backup Exec.  \n-Delivered desktop support for the office, which accounted for about 100 users.  \n-Created and maintained computer images for rapid deployment on PC’s. I documented hardware/software standards for the company \n \naccomplished major projects successfully:  \n-Upgraded entire office from Windows NT 4.0 workstation to Windows 2000 Professional -Relocated our office and data center from the Mountain View, CA to Fremont, CA location -Migrated acquired company into DNA Sciences network environment -Decommissioned Novell network, and migrated to a Microsoft network infrastructure. IT System Administrator DNA Sciences, Inc. April 2000  –  October 2001  (1 year 7 months) San Francisco Bay Area -Responsible for all Windows servers and services running (Active Directory, DNS, DHCP, Exchange, and File servers).  \n-Perform backups and restores utilizing Veritas Backup Exec.  \n-Delivered desktop support for the office, which accounted for about 100 users.  \n-Created and maintained computer images for rapid deployment on PC’s. I documented hardware/software standards for the company \n \naccomplished major projects successfully:  \n-Upgraded entire office from Windows NT 4.0 workstation to Windows 2000 Professional -Relocated our office and data center from the Mountain View, CA to Fremont, CA location -Migrated acquired company into DNA Sciences network environment -Decommissioned Novell network, and migrated to a Microsoft network infrastructure. IT Operations Tier 2 Desktop Support McAfee March 1997  –  April 2000  (3 years 2 months) San Francisco Bay Area -I worked with a team that provided 2nd level desktop support for the McAfee office in Santa Clara, CA. Santa Clara office was McAfee headquarters, and occupied more than 1000 employees.  \n-Worked a variety of desktop issues/requests for end users in the building, and remotely. Supported all print devices, and print servers. Utilized helpdesk ticketing system to track incidents and work orders. IT Operations Tier 2 Desktop Support McAfee March 1997  –  April 2000  (3 years 2 months) San Francisco Bay Area -I worked with a team that provided 2nd level desktop support for the McAfee office in Santa Clara, CA. Santa Clara office was McAfee headquarters, and occupied more than 1000 employees.  \n-Worked a variety of desktop issues/requests for end users in the building, and remotely. Supported all print devices, and print servers. Utilized helpdesk ticketing system to track incidents and work orders. Languages Portuguese Portuguese Portuguese Skills McAfee Active Directory Windows Server VMware Server Administration DHCP Servers Operations Management VPN ITIL v3 Foundations... VMware ESX Red Hat Linux Dell Computers BMC Remedy MCITP VMware Workstation Microsoft Office Blackberry SiteScope Windows 7 Group Policy DNS Server DFS SharePoint RSA Ace Server RSA SecurID RSA Security Customer Service Executive Support IT Operations Antivirus Blackberry Enterprise... Windows Vista Windows 2000 iPhone Support iPad Adobe Creative Suite Solarwinds Zabbix Adobe Connect McAfee Antivirus Mac OS X IBM PC HP Business... Polycom Avaya Site... MeetingPlace Supervisory Experience Information Technology Cloud Computing See 35+     See less Skills  McAfee Active Directory Windows Server VMware Server Administration DHCP Servers Operations Management VPN ITIL v3 Foundations... VMware ESX Red Hat Linux Dell Computers BMC Remedy MCITP VMware Workstation Microsoft Office Blackberry SiteScope Windows 7 Group Policy DNS Server DFS SharePoint RSA Ace Server RSA SecurID RSA Security Customer Service Executive Support IT Operations Antivirus Blackberry Enterprise... Windows Vista Windows 2000 iPhone Support iPad Adobe Creative Suite Solarwinds Zabbix Adobe Connect McAfee Antivirus Mac OS X IBM PC HP Business... Polycom Avaya Site... MeetingPlace Supervisory Experience Information Technology Cloud Computing See 35+     See less McAfee Active Directory Windows Server VMware Server Administration DHCP Servers Operations Management VPN ITIL v3 Foundations... VMware ESX Red Hat Linux Dell Computers BMC Remedy MCITP VMware Workstation Microsoft Office Blackberry SiteScope Windows 7 Group Policy DNS Server DFS SharePoint RSA Ace Server RSA SecurID RSA Security Customer Service Executive Support IT Operations Antivirus Blackberry Enterprise... Windows Vista Windows 2000 iPhone Support iPad Adobe Creative Suite Solarwinds Zabbix Adobe Connect McAfee Antivirus Mac OS X IBM PC HP Business... Polycom Avaya Site... MeetingPlace Supervisory Experience Information Technology Cloud Computing See 35+     See less McAfee Active Directory Windows Server VMware Server Administration DHCP Servers Operations Management VPN ITIL v3 Foundations... VMware ESX Red Hat Linux Dell Computers BMC Remedy MCITP VMware Workstation Microsoft Office Blackberry SiteScope Windows 7 Group Policy DNS Server DFS SharePoint RSA Ace Server RSA SecurID RSA Security Customer Service Executive Support IT Operations Antivirus Blackberry Enterprise... Windows Vista Windows 2000 iPhone Support iPad Adobe Creative Suite Solarwinds Zabbix Adobe Connect McAfee Antivirus Mac OS X IBM PC HP Business... Polycom Avaya Site... MeetingPlace Supervisory Experience Information Technology Cloud Computing See 35+     See less Education San Jose City College 1995  – 1996 Mission College 1993  – 1995 San Jose City College 1995  – 1996 San Jose City College 1995  – 1996 San Jose City College 1995  – 1996 Mission College 1993  – 1995 Mission College 1993  – 1995 Mission College 1993  – 1995 ", "Experience IT engineer Intel Corporation IT engineer Intel Corporation IT engineer Intel Corporation ", "Experience IT-Engineer Intel Corporation Pakistan IT-Engineer Intel Corporation Pakistan IT-Engineer Intel Corporation Pakistan ", "Skills Enterprise Software Architecture Business Intelligence Security Strategy Intel Business Process Software Development Integration Semiconductors Agile Methodologies Embedded Systems Linux Cloud Computing Program Management Skills  Enterprise Software Architecture Business Intelligence Security Strategy Intel Business Process Software Development Integration Semiconductors Agile Methodologies Embedded Systems Linux Cloud Computing Program Management Enterprise Software Architecture Business Intelligence Security Strategy Intel Business Process Software Development Integration Semiconductors Agile Methodologies Embedded Systems Linux Cloud Computing Program Management Enterprise Software Architecture Business Intelligence Security Strategy Intel Business Process Software Development Integration Semiconductors Agile Methodologies Embedded Systems Linux Cloud Computing Program Management ", "Skills Program Management Project Management Microsoft Office Leadership Security Project Planning Change Management IT Operations IT Management Cross-functional Team... System Deployment Technical Writing Team Leadership Vendor Management TCP/IP Disaster Recovery Microsoft Excel Operating Systems Volunteer Management Servers Troubleshooting See 6+     See less Skills  Program Management Project Management Microsoft Office Leadership Security Project Planning Change Management IT Operations IT Management Cross-functional Team... System Deployment Technical Writing Team Leadership Vendor Management TCP/IP Disaster Recovery Microsoft Excel Operating Systems Volunteer Management Servers Troubleshooting See 6+     See less Program Management Project Management Microsoft Office Leadership Security Project Planning Change Management IT Operations IT Management Cross-functional Team... System Deployment Technical Writing Team Leadership Vendor Management TCP/IP Disaster Recovery Microsoft Excel Operating Systems Volunteer Management Servers Troubleshooting See 6+     See less Program Management Project Management Microsoft Office Leadership Security Project Planning Change Management IT Operations IT Management Cross-functional Team... System Deployment Technical Writing Team Leadership Vendor Management TCP/IP Disaster Recovery Microsoft Excel Operating Systems Volunteer Management Servers Troubleshooting See 6+     See less ", "Experience Sr. Cloud Engineer Fujitsu July 2013  – Present (2 years 2 months) Sunnyvale, CA Principal Technical Support Engineer Oracle December 2012  –  July 2013  (8 months) Santa Clara, CA Sr. Virtual Engineer Fujitsu January 2011  –  December 2012  (2 years) Sr. Systems Engineer NASA Ames Research Center February 2010  –  January 2011  (1 year) Sr. IT Engineer Intel Corporation November 2009  –  February 2010  (4 months) Sr. IT Engineer Shop.com February 2008  –  March 2009  (1 year 2 months) Sr. Network Engineer SN Servicing Corp. February 2004  –  February 2008  (4 years 1 month) Sr. Integration Engineer Intel Corporation June 1997  –  May 2003  (6 years) Network Manager Dade-Behring June 1996  –  June 1997  (1 year 1 month) Software Quality Assurance Supervisor Baxter Healthcare April 1991  –  June 1996  (5 years 3 months) Software Engineer Aerojet 1985  –  1990  (5 years) Sr. Cloud Engineer Fujitsu July 2013  – Present (2 years 2 months) Sunnyvale, CA Sr. Cloud Engineer Fujitsu July 2013  – Present (2 years 2 months) Sunnyvale, CA Principal Technical Support Engineer Oracle December 2012  –  July 2013  (8 months) Santa Clara, CA Principal Technical Support Engineer Oracle December 2012  –  July 2013  (8 months) Santa Clara, CA Sr. Virtual Engineer Fujitsu January 2011  –  December 2012  (2 years) Sr. Virtual Engineer Fujitsu January 2011  –  December 2012  (2 years) Sr. Systems Engineer NASA Ames Research Center February 2010  –  January 2011  (1 year) Sr. Systems Engineer NASA Ames Research Center February 2010  –  January 2011  (1 year) Sr. IT Engineer Intel Corporation November 2009  –  February 2010  (4 months) Sr. IT Engineer Intel Corporation November 2009  –  February 2010  (4 months) Sr. IT Engineer Shop.com February 2008  –  March 2009  (1 year 2 months) Sr. IT Engineer Shop.com February 2008  –  March 2009  (1 year 2 months) Sr. Network Engineer SN Servicing Corp. February 2004  –  February 2008  (4 years 1 month) Sr. Network Engineer SN Servicing Corp. February 2004  –  February 2008  (4 years 1 month) Sr. Integration Engineer Intel Corporation June 1997  –  May 2003  (6 years) Sr. Integration Engineer Intel Corporation June 1997  –  May 2003  (6 years) Network Manager Dade-Behring June 1996  –  June 1997  (1 year 1 month) Network Manager Dade-Behring June 1996  –  June 1997  (1 year 1 month) Software Quality Assurance Supervisor Baxter Healthcare April 1991  –  June 1996  (5 years 3 months) Software Quality Assurance Supervisor Baxter Healthcare April 1991  –  June 1996  (5 years 3 months) Software Engineer Aerojet 1985  –  1990  (5 years) Software Engineer Aerojet 1985  –  1990  (5 years) Skills VMware Storage Cloud Computing SAN VMware ESX vSphere Servers Windows Disaster Recovery Architecture Data Center Virtualization Linux Hyper-V Software Installation Microsoft SQL Server Hardware Microsoft Exchange Firewalls Software Development HP Testing SharePoint Software Documentation Storage Area Networks Architectures SQL See 12+     See less Skills  VMware Storage Cloud Computing SAN VMware ESX vSphere Servers Windows Disaster Recovery Architecture Data Center Virtualization Linux Hyper-V Software Installation Microsoft SQL Server Hardware Microsoft Exchange Firewalls Software Development HP Testing SharePoint Software Documentation Storage Area Networks Architectures SQL See 12+     See less VMware Storage Cloud Computing SAN VMware ESX vSphere Servers Windows Disaster Recovery Architecture Data Center Virtualization Linux Hyper-V Software Installation Microsoft SQL Server Hardware Microsoft Exchange Firewalls Software Development HP Testing SharePoint Software Documentation Storage Area Networks Architectures SQL See 12+     See less VMware Storage Cloud Computing SAN VMware ESX vSphere Servers Windows Disaster Recovery Architecture Data Center Virtualization Linux Hyper-V Software Installation Microsoft SQL Server Hardware Microsoft Exchange Firewalls Software Development HP Testing SharePoint Software Documentation Storage Area Networks Architectures SQL See 12+     See less Education California State University-Sacramento BS 1981  – 1985 California State University-Sacramento BS 1981  – 1985 California State University-Sacramento BS 1981  – 1985 California State University-Sacramento BS 1981  – 1985 ", "Experience Associate Database Administrator Aetna June 2013  – Present (2 years 3 months) Scottsdale, AZ Information Technology and Operations business process improvement. Treasurer ANLC PTO May 2013  – Present (2 years 4 months) Scottsdale, AZ Director, Manufacturing Comtech Telecommunications Corp August 2008  –  November 2012  (4 years 4 months) Tempe, AZ Director of Operations Radyne Corporation June 2001  –  August 2008  (7 years 3 months) Automation Support Center Shift 4 Supervisor / IT Engineer Intel Corporation April 1998  –  June 2001  (3 years 3 months) Chandler, AZ Manufacturing Supervisor Intel Corporation February 1997  –  April 1998  (1 year 3 months) Chandler, AZ Customer Quality Engineer Intel Corporation April 1995  –  February 1997  (1 year 11 months) Chandler, AZ Quality and Reliability Engineering Tech / Engineering Intern Intel Corporation June 1991  –  April 1995  (3 years 11 months) Rio Rancho, NM Associate Database Administrator Aetna June 2013  – Present (2 years 3 months) Scottsdale, AZ Information Technology and Operations business process improvement. Associate Database Administrator Aetna June 2013  – Present (2 years 3 months) Scottsdale, AZ Information Technology and Operations business process improvement. Treasurer ANLC PTO May 2013  – Present (2 years 4 months) Scottsdale, AZ Treasurer ANLC PTO May 2013  – Present (2 years 4 months) Scottsdale, AZ Director, Manufacturing Comtech Telecommunications Corp August 2008  –  November 2012  (4 years 4 months) Tempe, AZ Director, Manufacturing Comtech Telecommunications Corp August 2008  –  November 2012  (4 years 4 months) Tempe, AZ Director of Operations Radyne Corporation June 2001  –  August 2008  (7 years 3 months) Director of Operations Radyne Corporation June 2001  –  August 2008  (7 years 3 months) Automation Support Center Shift 4 Supervisor / IT Engineer Intel Corporation April 1998  –  June 2001  (3 years 3 months) Chandler, AZ Automation Support Center Shift 4 Supervisor / IT Engineer Intel Corporation April 1998  –  June 2001  (3 years 3 months) Chandler, AZ Manufacturing Supervisor Intel Corporation February 1997  –  April 1998  (1 year 3 months) Chandler, AZ Manufacturing Supervisor Intel Corporation February 1997  –  April 1998  (1 year 3 months) Chandler, AZ Customer Quality Engineer Intel Corporation April 1995  –  February 1997  (1 year 11 months) Chandler, AZ Customer Quality Engineer Intel Corporation April 1995  –  February 1997  (1 year 11 months) Chandler, AZ Quality and Reliability Engineering Tech / Engineering Intern Intel Corporation June 1991  –  April 1995  (3 years 11 months) Rio Rancho, NM Quality and Reliability Engineering Tech / Engineering Intern Intel Corporation June 1991  –  April 1995  (3 years 11 months) Rio Rancho, NM Skills Lean Manufacturing Electronics Project Management Customer Retention Root Cause Analysis Quality Management Operations Management Sales Management New Business Development Kaizen Contract Negotiation MRP Process Improvement Embedded Systems Manufacturing Leadership Six Sigma Supply Chain Management Account Management Semiconductors Strategic Planning Aerospace Executive Management Business Process... Change Management ISO Operational Excellence Product Management Strategic Leadership Manufacturing... Program Management Team Building Theory of Constraints Integration Training Cross-functional Team... Supply Chain Semiconductor Industry Management Business Strategy Kanban SPC Process Engineering Manufacturing... Engineering Team Leadership Engineering Management DMAIC Continuous Improvement Value Stream Mapping See 35+     See less Skills  Lean Manufacturing Electronics Project Management Customer Retention Root Cause Analysis Quality Management Operations Management Sales Management New Business Development Kaizen Contract Negotiation MRP Process Improvement Embedded Systems Manufacturing Leadership Six Sigma Supply Chain Management Account Management Semiconductors Strategic Planning Aerospace Executive Management Business Process... Change Management ISO Operational Excellence Product Management Strategic Leadership Manufacturing... Program Management Team Building Theory of Constraints Integration Training Cross-functional Team... Supply Chain Semiconductor Industry Management Business Strategy Kanban SPC Process Engineering Manufacturing... Engineering Team Leadership Engineering Management DMAIC Continuous Improvement Value Stream Mapping See 35+     See less Lean Manufacturing Electronics Project Management Customer Retention Root Cause Analysis Quality Management Operations Management Sales Management New Business Development Kaizen Contract Negotiation MRP Process Improvement Embedded Systems Manufacturing Leadership Six Sigma Supply Chain Management Account Management Semiconductors Strategic Planning Aerospace Executive Management Business Process... Change Management ISO Operational Excellence Product Management Strategic Leadership Manufacturing... Program Management Team Building Theory of Constraints Integration Training Cross-functional Team... Supply Chain Semiconductor Industry Management Business Strategy Kanban SPC Process Engineering Manufacturing... Engineering Team Leadership Engineering Management DMAIC Continuous Improvement Value Stream Mapping See 35+     See less Lean Manufacturing Electronics Project Management Customer Retention Root Cause Analysis Quality Management Operations Management Sales Management New Business Development Kaizen Contract Negotiation MRP Process Improvement Embedded Systems Manufacturing Leadership Six Sigma Supply Chain Management Account Management Semiconductors Strategic Planning Aerospace Executive Management Business Process... Change Management ISO Operational Excellence Product Management Strategic Leadership Manufacturing... Program Management Team Building Theory of Constraints Integration Training Cross-functional Team... Supply Chain Semiconductor Industry Management Business Strategy Kanban SPC Process Engineering Manufacturing... Engineering Team Leadership Engineering Management DMAIC Continuous Improvement Value Stream Mapping See 35+     See less Education Arizona State University, W. P. Carey School of Business Master of Science,  Information Management 2013  – 2014 Information Technology Management The University of New Mexico Bachelor of Science (B.S.),  Electrical Engineering 1992  – 1998 Activities and Societies:  IEEE Arizona State University, W. P. Carey School of Business Master of Science,  Information Management 2013  – 2014 Information Technology Management Arizona State University, W. P. Carey School of Business Master of Science,  Information Management 2013  – 2014 Information Technology Management Arizona State University, W. P. Carey School of Business Master of Science,  Information Management 2013  – 2014 Information Technology Management The University of New Mexico Bachelor of Science (B.S.),  Electrical Engineering 1992  – 1998 Activities and Societies:  IEEE The University of New Mexico Bachelor of Science (B.S.),  Electrical Engineering 1992  – 1998 Activities and Societies:  IEEE The University of New Mexico Bachelor of Science (B.S.),  Electrical Engineering 1992  – 1998 Activities and Societies:  IEEE ", "Skills Enterprise Software Cloud Computing Pre-sales Sales Enablement SaaS Certified Scrum Master... ITIL Certified Business Alliances Enterprise Architecture Product Marketing Managed Services Professional Services Solution Architecture Virtualization Go-to-market Strategy Solution Selling Channel Partners Demand Generation Data Center Storage HP Sales Partner Management CRM IT Service Management Salesforce.com Security Strategic Partnerships Product Management See 14+     See less Skills  Enterprise Software Cloud Computing Pre-sales Sales Enablement SaaS Certified Scrum Master... ITIL Certified Business Alliances Enterprise Architecture Product Marketing Managed Services Professional Services Solution Architecture Virtualization Go-to-market Strategy Solution Selling Channel Partners Demand Generation Data Center Storage HP Sales Partner Management CRM IT Service Management Salesforce.com Security Strategic Partnerships Product Management See 14+     See less Enterprise Software Cloud Computing Pre-sales Sales Enablement SaaS Certified Scrum Master... ITIL Certified Business Alliances Enterprise Architecture Product Marketing Managed Services Professional Services Solution Architecture Virtualization Go-to-market Strategy Solution Selling Channel Partners Demand Generation Data Center Storage HP Sales Partner Management CRM IT Service Management Salesforce.com Security Strategic Partnerships Product Management See 14+     See less Enterprise Software Cloud Computing Pre-sales Sales Enablement SaaS Certified Scrum Master... ITIL Certified Business Alliances Enterprise Architecture Product Marketing Managed Services Professional Services Solution Architecture Virtualization Go-to-market Strategy Solution Selling Channel Partners Demand Generation Data Center Storage HP Sales Partner Management CRM IT Service Management Salesforce.com Security Strategic Partnerships Product Management See 14+     See less ", "Languages French French French Skills TCP/IP WiFi WAN VoIP Network Administration Switches System Architecture Wireless Routing Network Architecture Ethernet WLAN Network Engineering CCNP Wireless Networking Integration Security IT Management Mobile Devices Cloud Computing Data Center Virtualization See 7+     See less Skills  TCP/IP WiFi WAN VoIP Network Administration Switches System Architecture Wireless Routing Network Architecture Ethernet WLAN Network Engineering CCNP Wireless Networking Integration Security IT Management Mobile Devices Cloud Computing Data Center Virtualization See 7+     See less TCP/IP WiFi WAN VoIP Network Administration Switches System Architecture Wireless Routing Network Architecture Ethernet WLAN Network Engineering CCNP Wireless Networking Integration Security IT Management Mobile Devices Cloud Computing Data Center Virtualization See 7+     See less TCP/IP WiFi WAN VoIP Network Administration Switches System Architecture Wireless Routing Network Architecture Ethernet WLAN Network Engineering CCNP Wireless Networking Integration Security IT Management Mobile Devices Cloud Computing Data Center Virtualization See 7+     See less ", "Experience IT engineer Intel Corporation IT engineer Intel Corporation IT engineer Intel Corporation ", "Summary Accomplished professional with demonstrated success in building and supporting mission critical IT systems. Extensive knowledge of hosted server solutions, system and database design and management, network design, distribution and delivery solutions within intranet and internet environments. Resourceful in bridging cultural differences and interacting with people on all levels. Summary Accomplished professional with demonstrated success in building and supporting mission critical IT systems. Extensive knowledge of hosted server solutions, system and database design and management, network design, distribution and delivery solutions within intranet and internet environments. Resourceful in bridging cultural differences and interacting with people on all levels. Accomplished professional with demonstrated success in building and supporting mission critical IT systems. Extensive knowledge of hosted server solutions, system and database design and management, network design, distribution and delivery solutions within intranet and internet environments. Resourceful in bridging cultural differences and interacting with people on all levels. Accomplished professional with demonstrated success in building and supporting mission critical IT systems. Extensive knowledge of hosted server solutions, system and database design and management, network design, distribution and delivery solutions within intranet and internet environments. Resourceful in bridging cultural differences and interacting with people on all levels. Experience Sr. Database Administrator Eid Passport September 2013  – Present (2 years) Hillsboro, OR Sr. Database Administrator Eid Passport September 2013  – Present (2 years) Hillsboro, OR Sr. Database Administrator Eid Passport September 2013  – Present (2 years) Hillsboro, OR Skills Debugging Microsoft SQL Server SQL Tuning Windows Server EMC Storage Backup Solutions Database Design Database Administration Relational Databases Managing Database SAN Information Technology Information Systems Performance Tuning Databases System Deployment Servers See 2+     See less Skills  Debugging Microsoft SQL Server SQL Tuning Windows Server EMC Storage Backup Solutions Database Design Database Administration Relational Databases Managing Database SAN Information Technology Information Systems Performance Tuning Databases System Deployment Servers See 2+     See less Debugging Microsoft SQL Server SQL Tuning Windows Server EMC Storage Backup Solutions Database Design Database Administration Relational Databases Managing Database SAN Information Technology Information Systems Performance Tuning Databases System Deployment Servers See 2+     See less Debugging Microsoft SQL Server SQL Tuning Windows Server EMC Storage Backup Solutions Database Design Database Administration Relational Databases Managing Database SAN Information Technology Information Systems Performance Tuning Databases System Deployment Servers See 2+     See less Education University of Phoenix Bachelor of Science (B.S.) 2001  – 2004 University of Phoenix Bachelor of Science (B.S.) 2001  – 2004 University of Phoenix Bachelor of Science (B.S.) 2001  – 2004 University of Phoenix Bachelor of Science (B.S.) 2001  – 2004 ", "Summary Empathy and careful observing to perceive requirements and pain points of all stakeholders; \nIdeation, alternative thinking and solution finder from extensive knowledge and deep perception in technology and engineering; \nGlobal vision from 15 years of experience covers end to end in ICT areas. \nOutstanding resource discovery and practical ability to turn ideas to products; \nIn-depth comprehension and application of project management and process control; \nExcellent coordination ability for multi-national, cross-sites, inter-culture environments. \n Summary Empathy and careful observing to perceive requirements and pain points of all stakeholders; \nIdeation, alternative thinking and solution finder from extensive knowledge and deep perception in technology and engineering; \nGlobal vision from 15 years of experience covers end to end in ICT areas. \nOutstanding resource discovery and practical ability to turn ideas to products; \nIn-depth comprehension and application of project management and process control; \nExcellent coordination ability for multi-national, cross-sites, inter-culture environments. \n Empathy and careful observing to perceive requirements and pain points of all stakeholders; \nIdeation, alternative thinking and solution finder from extensive knowledge and deep perception in technology and engineering; \nGlobal vision from 15 years of experience covers end to end in ICT areas. \nOutstanding resource discovery and practical ability to turn ideas to products; \nIn-depth comprehension and application of project management and process control; \nExcellent coordination ability for multi-national, cross-sites, inter-culture environments. \n Empathy and careful observing to perceive requirements and pain points of all stakeholders; \nIdeation, alternative thinking and solution finder from extensive knowledge and deep perception in technology and engineering; \nGlobal vision from 15 years of experience covers end to end in ICT areas. \nOutstanding resource discovery and practical ability to turn ideas to products; \nIn-depth comprehension and application of project management and process control; \nExcellent coordination ability for multi-national, cross-sites, inter-culture environments. \n Experience RU China R&D Infrastructure Efficiency Manager Alcatel-Lucent April 2011  – Present (4 years 5 months) Shanghai, China \tIdeation, design, develop project as tech PoC to introduce new technologies such as virtualisation/cloud, Mobility, data mine/big data, IOT, SNS and etc. for corporate projects; design with new tech and implemented successfully projects like: R&D software mirror site, R&D software store, instant VM (Virtual Machine) deployment, ITIL standard R&D infrastructure management based on mobile equipment and etc.. \nLead Tools Committee: the “R&D IT” teams distributed in departments to managing regional R&D infrastructures: software, servers, storages and etc., well support 8 sites, ~6000 R&D engineers;  \nAs member of global Tools Council, research technical trends and design corporation R&D software infrastructure strategy and technology framework; \nAs the leader of technical experts consults for hundreds of hard tech issues reported in committee, improve team knowledge by internal collaboration, bridge industrial to bring edge-tech inside: well build and maintain strategic cooperation with IBM/Rational, Intel/Wind River, NI to introduce technologies like: DevOps, SDN, NFV and etc.; \nAs member of global FOSSEC (Free and Open Source Software Executive Committee) and global FOSS trainer, promote and improve FOSS management strategy in different functions and trained ~15% of global FOSS Evaluators to build FOSS evaluation system; \n System Test Tools Prime for 4G Mobile Communication (LTE) product Alcatel-Lucent December 2008  –  April 2011  (2 years 5 months) Shanghai, China \tAs the leader for test methodology and tools for 4G LTE product, in charge of boost the test efficiency with innovative methods, equipments and tools. Responsibilities include: discover potential requirements, define strategy/plan, seek/evaluate/integrate 3rd party products, ideation/define tools solutions, and lead the design/development/deployment/support. \nSuccessfully design and develop over ten new software tools, introduce over three new test equipments, supported over three projects on lab test and field trial. And creatively introducing UCD (User-Centered Design), IA, virtualisation, visualisation and other new technologies in to development and test. \n System Integration Manager for 3G Mobile Communication (WiMAX) product Alcatel-Lucent December 2005  –  December 2008  (3 years 1 month) Shanghai, China Managed all WiMAX product integration / test: from the very beginning HW/SW/Facility requirement/budgeting/planning/purchasing/deploy/maintenance to team build-up and coaching; Also coordinated the project process with development & integration team in China & France; and led the support for trial among six sites distributed world wide and customer support for world wide customers; Effectively build Shanghai test team and lab from scratch and led the team successfully finishing over tens of main release for two products. Advisory Engineer Alcatel-Lucent November 2004  –  December 2005  (1 year 2 months) Shanghai, China \tAs the technical architecture in telecom protocol development team of 3G WiMAX product, led all the research and design, focusing on IP mobility and VOIP, successfully finished Mobile IP, SIP features design. Senior Engineer Alcatel-Lucent September 2003  –  November 2004  (1 year 3 months) Shanghai, China As the main technical leader in 3G WCDMA mobile product, finished all the operation and management part development with good code quality. Research & Develop Engineer Shanghai Bell Co. Ltd. July 1999  –  September 2001  (2 years 3 months) Joined or led several features development for 2G GSM & CDMA Mobile products development, innovatively provide solutions to satisfy user requirement. Joined the two onsite deployment engineering of products. IT Engineer Intel Corporation November 1998  –  May 1999  (7 months) Shanghai, China \tIn charge of software package validation, localisation, and deployment in world wide IT standard migration project “EasySuit”. Achieve 98% successful migration, praised by Asia region IT management as listed no. 1. RU China R&D Infrastructure Efficiency Manager Alcatel-Lucent April 2011  – Present (4 years 5 months) Shanghai, China \tIdeation, design, develop project as tech PoC to introduce new technologies such as virtualisation/cloud, Mobility, data mine/big data, IOT, SNS and etc. for corporate projects; design with new tech and implemented successfully projects like: R&D software mirror site, R&D software store, instant VM (Virtual Machine) deployment, ITIL standard R&D infrastructure management based on mobile equipment and etc.. \nLead Tools Committee: the “R&D IT” teams distributed in departments to managing regional R&D infrastructures: software, servers, storages and etc., well support 8 sites, ~6000 R&D engineers;  \nAs member of global Tools Council, research technical trends and design corporation R&D software infrastructure strategy and technology framework; \nAs the leader of technical experts consults for hundreds of hard tech issues reported in committee, improve team knowledge by internal collaboration, bridge industrial to bring edge-tech inside: well build and maintain strategic cooperation with IBM/Rational, Intel/Wind River, NI to introduce technologies like: DevOps, SDN, NFV and etc.; \nAs member of global FOSSEC (Free and Open Source Software Executive Committee) and global FOSS trainer, promote and improve FOSS management strategy in different functions and trained ~15% of global FOSS Evaluators to build FOSS evaluation system; \n RU China R&D Infrastructure Efficiency Manager Alcatel-Lucent April 2011  – Present (4 years 5 months) Shanghai, China \tIdeation, design, develop project as tech PoC to introduce new technologies such as virtualisation/cloud, Mobility, data mine/big data, IOT, SNS and etc. for corporate projects; design with new tech and implemented successfully projects like: R&D software mirror site, R&D software store, instant VM (Virtual Machine) deployment, ITIL standard R&D infrastructure management based on mobile equipment and etc.. \nLead Tools Committee: the “R&D IT” teams distributed in departments to managing regional R&D infrastructures: software, servers, storages and etc., well support 8 sites, ~6000 R&D engineers;  \nAs member of global Tools Council, research technical trends and design corporation R&D software infrastructure strategy and technology framework; \nAs the leader of technical experts consults for hundreds of hard tech issues reported in committee, improve team knowledge by internal collaboration, bridge industrial to bring edge-tech inside: well build and maintain strategic cooperation with IBM/Rational, Intel/Wind River, NI to introduce technologies like: DevOps, SDN, NFV and etc.; \nAs member of global FOSSEC (Free and Open Source Software Executive Committee) and global FOSS trainer, promote and improve FOSS management strategy in different functions and trained ~15% of global FOSS Evaluators to build FOSS evaluation system; \n System Test Tools Prime for 4G Mobile Communication (LTE) product Alcatel-Lucent December 2008  –  April 2011  (2 years 5 months) Shanghai, China \tAs the leader for test methodology and tools for 4G LTE product, in charge of boost the test efficiency with innovative methods, equipments and tools. Responsibilities include: discover potential requirements, define strategy/plan, seek/evaluate/integrate 3rd party products, ideation/define tools solutions, and lead the design/development/deployment/support. \nSuccessfully design and develop over ten new software tools, introduce over three new test equipments, supported over three projects on lab test and field trial. And creatively introducing UCD (User-Centered Design), IA, virtualisation, visualisation and other new technologies in to development and test. \n System Test Tools Prime for 4G Mobile Communication (LTE) product Alcatel-Lucent December 2008  –  April 2011  (2 years 5 months) Shanghai, China \tAs the leader for test methodology and tools for 4G LTE product, in charge of boost the test efficiency with innovative methods, equipments and tools. Responsibilities include: discover potential requirements, define strategy/plan, seek/evaluate/integrate 3rd party products, ideation/define tools solutions, and lead the design/development/deployment/support. \nSuccessfully design and develop over ten new software tools, introduce over three new test equipments, supported over three projects on lab test and field trial. And creatively introducing UCD (User-Centered Design), IA, virtualisation, visualisation and other new technologies in to development and test. \n System Integration Manager for 3G Mobile Communication (WiMAX) product Alcatel-Lucent December 2005  –  December 2008  (3 years 1 month) Shanghai, China Managed all WiMAX product integration / test: from the very beginning HW/SW/Facility requirement/budgeting/planning/purchasing/deploy/maintenance to team build-up and coaching; Also coordinated the project process with development & integration team in China & France; and led the support for trial among six sites distributed world wide and customer support for world wide customers; Effectively build Shanghai test team and lab from scratch and led the team successfully finishing over tens of main release for two products. System Integration Manager for 3G Mobile Communication (WiMAX) product Alcatel-Lucent December 2005  –  December 2008  (3 years 1 month) Shanghai, China Managed all WiMAX product integration / test: from the very beginning HW/SW/Facility requirement/budgeting/planning/purchasing/deploy/maintenance to team build-up and coaching; Also coordinated the project process with development & integration team in China & France; and led the support for trial among six sites distributed world wide and customer support for world wide customers; Effectively build Shanghai test team and lab from scratch and led the team successfully finishing over tens of main release for two products. Advisory Engineer Alcatel-Lucent November 2004  –  December 2005  (1 year 2 months) Shanghai, China \tAs the technical architecture in telecom protocol development team of 3G WiMAX product, led all the research and design, focusing on IP mobility and VOIP, successfully finished Mobile IP, SIP features design. Advisory Engineer Alcatel-Lucent November 2004  –  December 2005  (1 year 2 months) Shanghai, China \tAs the technical architecture in telecom protocol development team of 3G WiMAX product, led all the research and design, focusing on IP mobility and VOIP, successfully finished Mobile IP, SIP features design. Senior Engineer Alcatel-Lucent September 2003  –  November 2004  (1 year 3 months) Shanghai, China As the main technical leader in 3G WCDMA mobile product, finished all the operation and management part development with good code quality. Senior Engineer Alcatel-Lucent September 2003  –  November 2004  (1 year 3 months) Shanghai, China As the main technical leader in 3G WCDMA mobile product, finished all the operation and management part development with good code quality. Research & Develop Engineer Shanghai Bell Co. Ltd. July 1999  –  September 2001  (2 years 3 months) Joined or led several features development for 2G GSM & CDMA Mobile products development, innovatively provide solutions to satisfy user requirement. Joined the two onsite deployment engineering of products. Research & Develop Engineer Shanghai Bell Co. Ltd. July 1999  –  September 2001  (2 years 3 months) Joined or led several features development for 2G GSM & CDMA Mobile products development, innovatively provide solutions to satisfy user requirement. Joined the two onsite deployment engineering of products. IT Engineer Intel Corporation November 1998  –  May 1999  (7 months) Shanghai, China \tIn charge of software package validation, localisation, and deployment in world wide IT standard migration project “EasySuit”. Achieve 98% successful migration, praised by Asia region IT management as listed no. 1. IT Engineer Intel Corporation November 1998  –  May 1999  (7 months) Shanghai, China \tIn charge of software package validation, localisation, and deployment in world wide IT standard migration project “EasySuit”. Achieve 98% successful migration, praised by Asia region IT management as listed no. 1. Languages English Full professional proficiency Chinese Native or bilingual proficiency English Full professional proficiency Chinese Native or bilingual proficiency English Full professional proficiency Chinese Native or bilingual proficiency Full professional proficiency Native or bilingual proficiency Skills Testing Integration Mobile Communications R&D Product Management Innovation Design Telecommunications Skills  Testing Integration Mobile Communications R&D Product Management Innovation Design Telecommunications Testing Integration Mobile Communications R&D Product Management Innovation Design Telecommunications Testing Integration Mobile Communications R&D Product Management Innovation Design Telecommunications Education University of Surrey Master’s Degree,  Communication Networks and Software 2001  – 2002 \tDesigned a brand new multimedia multicast model via satellite in EU project SATIN (SATellite-UMTS IP based Network), innovatively created “zoom query” and “terrestrial loopback” technique. East China Normal University Bachelor’s Degree,  Computer Science 1995  – 1999 Research on IA(Information Architecture)/Cognitive in WWW and Fuzzy Logic Database with multiple research papers on new techniques published on national/international conference; \n \nThesis research on Steganography (invisible encryption), designed new method for invisible writing in Microsoft Word format; Activities and Societies:  Voting Member of ACM ,  Vice Chairman for ACM East China Normal University Student Chapter University of Surrey Master’s Degree,  Communication Networks and Software 2001  – 2002 \tDesigned a brand new multimedia multicast model via satellite in EU project SATIN (SATellite-UMTS IP based Network), innovatively created “zoom query” and “terrestrial loopback” technique. University of Surrey Master’s Degree,  Communication Networks and Software 2001  – 2002 \tDesigned a brand new multimedia multicast model via satellite in EU project SATIN (SATellite-UMTS IP based Network), innovatively created “zoom query” and “terrestrial loopback” technique. University of Surrey Master’s Degree,  Communication Networks and Software 2001  – 2002 \tDesigned a brand new multimedia multicast model via satellite in EU project SATIN (SATellite-UMTS IP based Network), innovatively created “zoom query” and “terrestrial loopback” technique. East China Normal University Bachelor’s Degree,  Computer Science 1995  – 1999 Research on IA(Information Architecture)/Cognitive in WWW and Fuzzy Logic Database with multiple research papers on new techniques published on national/international conference; \n \nThesis research on Steganography (invisible encryption), designed new method for invisible writing in Microsoft Word format; Activities and Societies:  Voting Member of ACM ,  Vice Chairman for ACM East China Normal University Student Chapter East China Normal University Bachelor’s Degree,  Computer Science 1995  – 1999 Research on IA(Information Architecture)/Cognitive in WWW and Fuzzy Logic Database with multiple research papers on new techniques published on national/international conference; \n \nThesis research on Steganography (invisible encryption), designed new method for invisible writing in Microsoft Word format; Activities and Societies:  Voting Member of ACM ,  Vice Chairman for ACM East China Normal University Student Chapter East China Normal University Bachelor’s Degree,  Computer Science 1995  – 1999 Research on IA(Information Architecture)/Cognitive in WWW and Fuzzy Logic Database with multiple research papers on new techniques published on national/international conference; \n \nThesis research on Steganography (invisible encryption), designed new method for invisible writing in Microsoft Word format; Activities and Societies:  Voting Member of ACM ,  Vice Chairman for ACM East China Normal University Student Chapter "]}