{"position": "IT Manager", "company": "Intel Corporation", "profiles": ["Skills Cross-functional Team... Process Improvement Program Management PMP ITIL Business Analysis Business Process... Strategic Communications Outsourcing Cloud Computing IT Operations Strategy Management Team Leadership Software Project... Product Management Software Development Vendor Management Data Center Agile Methodologies Project Management See 6+     See less Skills  Cross-functional Team... Process Improvement Program Management PMP ITIL Business Analysis Business Process... Strategic Communications Outsourcing Cloud Computing IT Operations Strategy Management Team Leadership Software Project... Product Management Software Development Vendor Management Data Center Agile Methodologies Project Management See 6+     See less Cross-functional Team... Process Improvement Program Management PMP ITIL Business Analysis Business Process... Strategic Communications Outsourcing Cloud Computing IT Operations Strategy Management Team Leadership Software Project... Product Management Software Development Vendor Management Data Center Agile Methodologies Project Management See 6+     See less Cross-functional Team... Process Improvement Program Management PMP ITIL Business Analysis Business Process... Strategic Communications Outsourcing Cloud Computing IT Operations Strategy Management Team Leadership Software Project... Product Management Software Development Vendor Management Data Center Agile Methodologies Project Management See 6+     See less ", "Experience IT Manager Intel Corporation IT Manager Intel Corporation IT Manager Intel Corporation ", "Experience IT Manager Intel Corporation April 2012  – Present (3 years 5 months) Sacramento, California Area Member, Board of Directors Child Abuse Prevention Center January 2010  – Present (5 years 8 months) Member at Large of the Board of Directors of CAP Center. Serving on the Community Connections and State Policy committees Product Line Manager Intel Corp November 2006  –  April 2012  (5 years 6 months) • Responsible for delivering end-to-end capabilities, working closely with engineering, operations, information security and architecture \n• Lead high visibility, cross-business group projects, providing regular updates to senior management and obtaining buy-in for tough decisions. Work closely with key customer reps to ensure the products IT is delivering fit the customers’ needs and timelines Co-chair, Women in Philanthropy; Leadership Council member United Way California Capital Region January 2003  –  October 2010  (7 years 10 months) Responsible for increasing membership, raising funds and organizing special events. Project/Program Manager Intel November 1999  –  October 2006  (7 years) Managed high-visibility programs and projects in the mobile network access solutions group in IT. Senior Analyst Center for Healthcare Information June 1996  –  October 1999  (3 years 5 months) As a Sales and Marketing Analyst, responsible for all direct marketing programs of the company and data analysis projects, increased job efficiency by computerizing processes of duplicate record removal and sales method code tracking. As a Data Analyst, responsible for updating the company’s Oracle-based database from external sources, increased process efficiency by redesigning a computer program that compared existing data to external data. Supervised a team of 4 analysts. IT Manager Intel Corporation April 2012  – Present (3 years 5 months) Sacramento, California Area IT Manager Intel Corporation April 2012  – Present (3 years 5 months) Sacramento, California Area Member, Board of Directors Child Abuse Prevention Center January 2010  – Present (5 years 8 months) Member at Large of the Board of Directors of CAP Center. Serving on the Community Connections and State Policy committees Member, Board of Directors Child Abuse Prevention Center January 2010  – Present (5 years 8 months) Member at Large of the Board of Directors of CAP Center. Serving on the Community Connections and State Policy committees Product Line Manager Intel Corp November 2006  –  April 2012  (5 years 6 months) • Responsible for delivering end-to-end capabilities, working closely with engineering, operations, information security and architecture \n• Lead high visibility, cross-business group projects, providing regular updates to senior management and obtaining buy-in for tough decisions. Work closely with key customer reps to ensure the products IT is delivering fit the customers’ needs and timelines Product Line Manager Intel Corp November 2006  –  April 2012  (5 years 6 months) • Responsible for delivering end-to-end capabilities, working closely with engineering, operations, information security and architecture \n• Lead high visibility, cross-business group projects, providing regular updates to senior management and obtaining buy-in for tough decisions. Work closely with key customer reps to ensure the products IT is delivering fit the customers’ needs and timelines Co-chair, Women in Philanthropy; Leadership Council member United Way California Capital Region January 2003  –  October 2010  (7 years 10 months) Responsible for increasing membership, raising funds and organizing special events. Co-chair, Women in Philanthropy; Leadership Council member United Way California Capital Region January 2003  –  October 2010  (7 years 10 months) Responsible for increasing membership, raising funds and organizing special events. Project/Program Manager Intel November 1999  –  October 2006  (7 years) Managed high-visibility programs and projects in the mobile network access solutions group in IT. Project/Program Manager Intel November 1999  –  October 2006  (7 years) Managed high-visibility programs and projects in the mobile network access solutions group in IT. Senior Analyst Center for Healthcare Information June 1996  –  October 1999  (3 years 5 months) As a Sales and Marketing Analyst, responsible for all direct marketing programs of the company and data analysis projects, increased job efficiency by computerizing processes of duplicate record removal and sales method code tracking. As a Data Analyst, responsible for updating the company’s Oracle-based database from external sources, increased process efficiency by redesigning a computer program that compared existing data to external data. Supervised a team of 4 analysts. Senior Analyst Center for Healthcare Information June 1996  –  October 1999  (3 years 5 months) As a Sales and Marketing Analyst, responsible for all direct marketing programs of the company and data analysis projects, increased job efficiency by computerizing processes of duplicate record removal and sales method code tracking. As a Data Analyst, responsible for updating the company’s Oracle-based database from external sources, increased process efficiency by redesigning a computer program that compared existing data to external data. Supervised a team of 4 analysts. Languages English Native or bilingual proficiency Hebrew Native or bilingual proficiency French Elementary proficiency English Native or bilingual proficiency Hebrew Native or bilingual proficiency French Elementary proficiency English Native or bilingual proficiency Hebrew Native or bilingual proficiency French Elementary proficiency Native or bilingual proficiency Native or bilingual proficiency Elementary proficiency Skills Intercultural... Mentoring Security Strategic Planning Non-profits Microsoft Office Browsers Presentations Process Improvement Mobile Devices Project Management Nonprofits Program Management Databases Business Analysis Negotiation Management Team Building Cross-functional Team... Integration IT Management Leadership Product Management Event Management Change Management Sales Training Strategy Analysis Vendor Management Team Leadership Project Planning Organizational... Customer Service Leadership Development Coaching See 21+     See less Skills  Intercultural... Mentoring Security Strategic Planning Non-profits Microsoft Office Browsers Presentations Process Improvement Mobile Devices Project Management Nonprofits Program Management Databases Business Analysis Negotiation Management Team Building Cross-functional Team... Integration IT Management Leadership Product Management Event Management Change Management Sales Training Strategy Analysis Vendor Management Team Leadership Project Planning Organizational... Customer Service Leadership Development Coaching See 21+     See less Intercultural... Mentoring Security Strategic Planning Non-profits Microsoft Office Browsers Presentations Process Improvement Mobile Devices Project Management Nonprofits Program Management Databases Business Analysis Negotiation Management Team Building Cross-functional Team... Integration IT Management Leadership Product Management Event Management Change Management Sales Training Strategy Analysis Vendor Management Team Leadership Project Planning Organizational... Customer Service Leadership Development Coaching See 21+     See less Intercultural... Mentoring Security Strategic Planning Non-profits Microsoft Office Browsers Presentations Process Improvement Mobile Devices Project Management Nonprofits Program Management Databases Business Analysis Negotiation Management Team Building Cross-functional Team... Integration IT Management Leadership Product Management Event Management Change Management Sales Training Strategy Analysis Vendor Management Team Leadership Project Planning Organizational... Customer Service Leadership Development Coaching See 21+     See less Education California State University-Sacramento MBA,  Executive MBA 2011  – 2012 recipient of the Outstanding Executive MBA Student Award University of California, Irvine B.A.,  Social Science & Statistics 1993  – 1997 Summa Cum Laude Activities and Societies:  Phi Beta Kappa Mamram Computer Programming 1984  – 1985 California State University-Sacramento MBA,  Executive MBA 2011  – 2012 recipient of the Outstanding Executive MBA Student Award California State University-Sacramento MBA,  Executive MBA 2011  – 2012 recipient of the Outstanding Executive MBA Student Award California State University-Sacramento MBA,  Executive MBA 2011  – 2012 recipient of the Outstanding Executive MBA Student Award University of California, Irvine B.A.,  Social Science & Statistics 1993  – 1997 Summa Cum Laude Activities and Societies:  Phi Beta Kappa University of California, Irvine B.A.,  Social Science & Statistics 1993  – 1997 Summa Cum Laude Activities and Societies:  Phi Beta Kappa University of California, Irvine B.A.,  Social Science & Statistics 1993  – 1997 Summa Cum Laude Activities and Societies:  Phi Beta Kappa Mamram Computer Programming 1984  – 1985 Mamram Computer Programming 1984  – 1985 Mamram Computer Programming 1984  – 1985 ", "Languages Spanish Professional working proficiency English Native or bilingual proficiency Spanish Professional working proficiency English Native or bilingual proficiency Spanish Professional working proficiency English Native or bilingual proficiency Professional working proficiency Native or bilingual proficiency Skills SQL Server SSRS Excel Requirements Analysis MS Project SharePoint Business Analysis SQL Project Server Program Management Process Improvement Analysis Business Intelligence Project Planning Problem Solving Visio Linux Unix Microsoft SQL Server Programming Project Management Integration PMP Databases Operating Systems Servers Oracle See 12+     See less Skills  SQL Server SSRS Excel Requirements Analysis MS Project SharePoint Business Analysis SQL Project Server Program Management Process Improvement Analysis Business Intelligence Project Planning Problem Solving Visio Linux Unix Microsoft SQL Server Programming Project Management Integration PMP Databases Operating Systems Servers Oracle See 12+     See less SQL Server SSRS Excel Requirements Analysis MS Project SharePoint Business Analysis SQL Project Server Program Management Process Improvement Analysis Business Intelligence Project Planning Problem Solving Visio Linux Unix Microsoft SQL Server Programming Project Management Integration PMP Databases Operating Systems Servers Oracle See 12+     See less SQL Server SSRS Excel Requirements Analysis MS Project SharePoint Business Analysis SQL Project Server Program Management Process Improvement Analysis Business Intelligence Project Planning Problem Solving Visio Linux Unix Microsoft SQL Server Programming Project Management Integration PMP Databases Operating Systems Servers Oracle See 12+     See less ", "Skills Software Project... Program Management Leadership IT Service Management ITIL PMP Product Management Project Management Data Center Training Cross-functional Team... Management Software Engineering Vendor Management Integration Six Sigma Process Improvement SDLC Requirements Analysis Strategy See 5+     See less Skills  Software Project... Program Management Leadership IT Service Management ITIL PMP Product Management Project Management Data Center Training Cross-functional Team... Management Software Engineering Vendor Management Integration Six Sigma Process Improvement SDLC Requirements Analysis Strategy See 5+     See less Software Project... Program Management Leadership IT Service Management ITIL PMP Product Management Project Management Data Center Training Cross-functional Team... Management Software Engineering Vendor Management Integration Six Sigma Process Improvement SDLC Requirements Analysis Strategy See 5+     See less Software Project... Program Management Leadership IT Service Management ITIL PMP Product Management Project Management Data Center Training Cross-functional Team... Management Software Engineering Vendor Management Integration Six Sigma Process Improvement SDLC Requirements Analysis Strategy See 5+     See less ", "Experience EMEA IT Manager Intel Corporation March 2014  – Present (1 year 6 months) Swindon, United Kingdom Manager of cross functional IT organisation across EMEA. Focus on people development, cross functional leadership and collibration Global Web production manager Intel Corporation January 2012  – Present (3 years 8 months) Swindon, United Kingdom Lead a global team to provide content delivery solutions for Intel.com UK IT Manager Intel Corporation July 2011  –  March 2014  (2 years 9 months) Swindon, United Kingdom Manager of cross functional IT organisation in UK and Western Europe. Focus on people development, cross functional leadership and collibration EMEA Commissions Manager Intel Corporation December 2009  –  January 2012  (2 years 2 months) Swindon UK Manager of EMEA Commissions. Leading operations, incentivies and alignment with company goals. EMEA IT Application Support Manager Intel Corporation January 2009  –  December 2009  (1 year) Swindon, United Kingdom Managing team of support analysts to provide incident and problem management for applications within the EMEA region Business Analyst Intel Corporation December 2007  –  January 2009  (1 year 2 months) Swindon, United Kingdom Leading enterprise business solutions for sales and marketing EMEA IT Application support manager Intel Corporation July 2004  –  November 2007  (3 years 5 months) Swindon, United Kingdom Managing team of support analysts to provide incident and problem management for key business applications IT Engineering Project Manager Intel Corporation January 2002  –  July 2004  (2 years 7 months) Swindon, United Kingdom Project manager for IT engeering hosting solutions Project Manager Intel Corporation May 2000  –  January 2002  (1 year 9 months) Swindon, United Kingdom Project manager for Finance business applications Project Manager Unigate August 1996  –  May 2000  (3 years 10 months) EMEA IT Manager Intel Corporation March 2014  – Present (1 year 6 months) Swindon, United Kingdom Manager of cross functional IT organisation across EMEA. Focus on people development, cross functional leadership and collibration EMEA IT Manager Intel Corporation March 2014  – Present (1 year 6 months) Swindon, United Kingdom Manager of cross functional IT organisation across EMEA. Focus on people development, cross functional leadership and collibration Global Web production manager Intel Corporation January 2012  – Present (3 years 8 months) Swindon, United Kingdom Lead a global team to provide content delivery solutions for Intel.com Global Web production manager Intel Corporation January 2012  – Present (3 years 8 months) Swindon, United Kingdom Lead a global team to provide content delivery solutions for Intel.com UK IT Manager Intel Corporation July 2011  –  March 2014  (2 years 9 months) Swindon, United Kingdom Manager of cross functional IT organisation in UK and Western Europe. Focus on people development, cross functional leadership and collibration UK IT Manager Intel Corporation July 2011  –  March 2014  (2 years 9 months) Swindon, United Kingdom Manager of cross functional IT organisation in UK and Western Europe. Focus on people development, cross functional leadership and collibration EMEA Commissions Manager Intel Corporation December 2009  –  January 2012  (2 years 2 months) Swindon UK Manager of EMEA Commissions. Leading operations, incentivies and alignment with company goals. EMEA Commissions Manager Intel Corporation December 2009  –  January 2012  (2 years 2 months) Swindon UK Manager of EMEA Commissions. Leading operations, incentivies and alignment with company goals. EMEA IT Application Support Manager Intel Corporation January 2009  –  December 2009  (1 year) Swindon, United Kingdom Managing team of support analysts to provide incident and problem management for applications within the EMEA region EMEA IT Application Support Manager Intel Corporation January 2009  –  December 2009  (1 year) Swindon, United Kingdom Managing team of support analysts to provide incident and problem management for applications within the EMEA region Business Analyst Intel Corporation December 2007  –  January 2009  (1 year 2 months) Swindon, United Kingdom Leading enterprise business solutions for sales and marketing Business Analyst Intel Corporation December 2007  –  January 2009  (1 year 2 months) Swindon, United Kingdom Leading enterprise business solutions for sales and marketing EMEA IT Application support manager Intel Corporation July 2004  –  November 2007  (3 years 5 months) Swindon, United Kingdom Managing team of support analysts to provide incident and problem management for key business applications EMEA IT Application support manager Intel Corporation July 2004  –  November 2007  (3 years 5 months) Swindon, United Kingdom Managing team of support analysts to provide incident and problem management for key business applications IT Engineering Project Manager Intel Corporation January 2002  –  July 2004  (2 years 7 months) Swindon, United Kingdom Project manager for IT engeering hosting solutions IT Engineering Project Manager Intel Corporation January 2002  –  July 2004  (2 years 7 months) Swindon, United Kingdom Project manager for IT engeering hosting solutions Project Manager Intel Corporation May 2000  –  January 2002  (1 year 9 months) Swindon, United Kingdom Project manager for Finance business applications Project Manager Intel Corporation May 2000  –  January 2002  (1 year 9 months) Swindon, United Kingdom Project manager for Finance business applications Project Manager Unigate August 1996  –  May 2000  (3 years 10 months) Project Manager Unigate August 1996  –  May 2000  (3 years 10 months) Skills Program Management ITIL IT Service Management Virtual Teams Partner Management Disaster Recovery Agile Methodologies Team Management Enterprise Software Software Project... Team Leadership Agile Project Management Cross-functional Team... Vendor Management IT Management Software Development Business Analysis Management Product Management See 4+     See less Skills  Program Management ITIL IT Service Management Virtual Teams Partner Management Disaster Recovery Agile Methodologies Team Management Enterprise Software Software Project... Team Leadership Agile Project Management Cross-functional Team... Vendor Management IT Management Software Development Business Analysis Management Product Management See 4+     See less Program Management ITIL IT Service Management Virtual Teams Partner Management Disaster Recovery Agile Methodologies Team Management Enterprise Software Software Project... Team Leadership Agile Project Management Cross-functional Team... Vendor Management IT Management Software Development Business Analysis Management Product Management See 4+     See less Program Management ITIL IT Service Management Virtual Teams Partner Management Disaster Recovery Agile Methodologies Team Management Enterprise Software Software Project... Team Leadership Agile Project Management Cross-functional Team... Vendor Management IT Management Software Development Business Analysis Management Product Management See 4+     See less Education De Montfort University Bachelor of Science (BSc),  Computer Science , 1st Class 1992  – 1996 De Montfort University Bachelor of Science (BSc),  Computer Science , 1st Class 1992  – 1996 De Montfort University Bachelor of Science (BSc),  Computer Science , 1st Class 1992  – 1996 De Montfort University Bachelor of Science (BSc),  Computer Science , 1st Class 1992  – 1996 ", "Experience IT manager Intel Corporation France IT manager Intel Corporation France IT manager Intel Corporation France ", "Skills Outsourcing Project Management CRM Operations Management Integration ITIL IT Operations IT Service Management Leadership IT Management Intel Enterprise Software Cross-functional Team... Program Management Software Development Software Project... Product Management See 2+     See less Skills  Outsourcing Project Management CRM Operations Management Integration ITIL IT Operations IT Service Management Leadership IT Management Intel Enterprise Software Cross-functional Team... Program Management Software Development Software Project... Product Management See 2+     See less Outsourcing Project Management CRM Operations Management Integration ITIL IT Operations IT Service Management Leadership IT Management Intel Enterprise Software Cross-functional Team... Program Management Software Development Software Project... Product Management See 2+     See less Outsourcing Project Management CRM Operations Management Integration ITIL IT Operations IT Service Management Leadership IT Management Intel Enterprise Software Cross-functional Team... Program Management Software Development Software Project... Product Management See 2+     See less ", "Experience IT Manager Intel Corporation September 2008  – Present (7 years) IT Manager X10 Wireless Technology July 2007  –  May 2008  (11 months) IT Infrastructure Architect Mentor Graphics, Inc. October 2003  –  June 2007  (3 years 9 months) Director of IT Riverstone Networks June 2000  –  December 2000  (7 months) IT Manager Cisco Systems July 1996  –  May 2000  (3 years 11 months) Software Engineer Stratacom November 1994  –  July 1996  (1 year 9 months) Software Engineer Kubota Graphics, Inc. June 1992  –  November 1994  (2 years 6 months) Systems Administrator/Software Engineer Olivetti ATC April 1989  –  June 1992  (3 years 3 months) Software Engineer/Systems Administrator Scientific Computer Systems March 1985  –  March 1989  (4 years 1 month) IT Manager Intel Corporation September 2008  – Present (7 years) IT Manager Intel Corporation September 2008  – Present (7 years) IT Manager X10 Wireless Technology July 2007  –  May 2008  (11 months) IT Manager X10 Wireless Technology July 2007  –  May 2008  (11 months) IT Infrastructure Architect Mentor Graphics, Inc. October 2003  –  June 2007  (3 years 9 months) IT Infrastructure Architect Mentor Graphics, Inc. October 2003  –  June 2007  (3 years 9 months) Director of IT Riverstone Networks June 2000  –  December 2000  (7 months) Director of IT Riverstone Networks June 2000  –  December 2000  (7 months) IT Manager Cisco Systems July 1996  –  May 2000  (3 years 11 months) IT Manager Cisco Systems July 1996  –  May 2000  (3 years 11 months) Software Engineer Stratacom November 1994  –  July 1996  (1 year 9 months) Software Engineer Stratacom November 1994  –  July 1996  (1 year 9 months) Software Engineer Kubota Graphics, Inc. June 1992  –  November 1994  (2 years 6 months) Software Engineer Kubota Graphics, Inc. June 1992  –  November 1994  (2 years 6 months) Systems Administrator/Software Engineer Olivetti ATC April 1989  –  June 1992  (3 years 3 months) Systems Administrator/Software Engineer Olivetti ATC April 1989  –  June 1992  (3 years 3 months) Software Engineer/Systems Administrator Scientific Computer Systems March 1985  –  March 1989  (4 years 1 month) Software Engineer/Systems Administrator Scientific Computer Systems March 1985  –  March 1989  (4 years 1 month) Skills IT Management IT Strategy Team Leadership Team Building Leadership Solution Architecture Program Management Agile Methodologies Software Project... Software Development Perl Linux Rational Team Concert Kanban Unix Storage Cloud Computing System Architecture Solaris Virtualization TCP/IP Enterprise Architecture Data Center Cisco Technologies Operating Systems Shell Scripting Integration System Administration Unix Shell Scripting Software Engineering Network Security MySQL Security Storage Area Networks ITIL Databases Microsoft SQL Server Infrastructure High Availability IT Service Management Business Intelligence C++ C Cross-functional Team... Enterprise Software See 30+     See less Skills  IT Management IT Strategy Team Leadership Team Building Leadership Solution Architecture Program Management Agile Methodologies Software Project... Software Development Perl Linux Rational Team Concert Kanban Unix Storage Cloud Computing System Architecture Solaris Virtualization TCP/IP Enterprise Architecture Data Center Cisco Technologies Operating Systems Shell Scripting Integration System Administration Unix Shell Scripting Software Engineering Network Security MySQL Security Storage Area Networks ITIL Databases Microsoft SQL Server Infrastructure High Availability IT Service Management Business Intelligence C++ C Cross-functional Team... Enterprise Software See 30+     See less IT Management IT Strategy Team Leadership Team Building Leadership Solution Architecture Program Management Agile Methodologies Software Project... Software Development Perl Linux Rational Team Concert Kanban Unix Storage Cloud Computing System Architecture Solaris Virtualization TCP/IP Enterprise Architecture Data Center Cisco Technologies Operating Systems Shell Scripting Integration System Administration Unix Shell Scripting Software Engineering Network Security MySQL Security Storage Area Networks ITIL Databases Microsoft SQL Server Infrastructure High Availability IT Service Management Business Intelligence C++ C Cross-functional Team... Enterprise Software See 30+     See less IT Management IT Strategy Team Leadership Team Building Leadership Solution Architecture Program Management Agile Methodologies Software Project... Software Development Perl Linux Rational Team Concert Kanban Unix Storage Cloud Computing System Architecture Solaris Virtualization TCP/IP Enterprise Architecture Data Center Cisco Technologies Operating Systems Shell Scripting Integration System Administration Unix Shell Scripting Software Engineering Network Security MySQL Security Storage Area Networks ITIL Databases Microsoft SQL Server Infrastructure High Availability IT Service Management Business Intelligence C++ C Cross-functional Team... Enterprise Software See 30+     See less Education Point Loma Nazarene University Computer Science 1982  – 1986 Point Loma Nazarene University Computer Science 1982  – 1986 Point Loma Nazarene University Computer Science 1982  – 1986 Point Loma Nazarene University Computer Science 1982  – 1986 ", "Summary Versatile IT professional whose career has alternated between senior analyst, people management and project management roles. Successful implementer of HR data integration, ERP upgrades & software development projects following SDLC processes. Experienced HRIS enterprise manager, who fosters a positive team spirit and helps enable staff to increase their breadth and their contributions.  \n \n• Growth and Fortune 100 companies \n• Formed HRIS organization at a global start-up  \n• IT Project Manager experienced in waterfall and Agile methodologies for software development \n• HR ERP Systems Integrator: between PeopleSoft and external HR systems & outsourcers, & between PeopleSoft and SAP.  \n• Experienced in HRIS / HR IT Operations Management, service delivery & process improvement. \n \nSpecialties:  \n• PeopleSoft HCM upgrade & enterprise software development \n• Positive Motivator, Coach & Mentor of multicultural teams \n• Vendor evaluation & selection processes ( e.g. RFQs )  \n• Data integration with cloud solutions \n• Requirements Gathering \n• Tracking issues to resolution \n• Effective Communication & Stakeholder mgmt \n• SDLC Processes  \n• Vendor Management  \n• HR Data Privacy protection, inc HIPAA \n• Contingent worker standards & practices \n• HR operations knowledge \n• Testing / Test Plans / Test Scripts Summary Versatile IT professional whose career has alternated between senior analyst, people management and project management roles. Successful implementer of HR data integration, ERP upgrades & software development projects following SDLC processes. Experienced HRIS enterprise manager, who fosters a positive team spirit and helps enable staff to increase their breadth and their contributions.  \n \n• Growth and Fortune 100 companies \n• Formed HRIS organization at a global start-up  \n• IT Project Manager experienced in waterfall and Agile methodologies for software development \n• HR ERP Systems Integrator: between PeopleSoft and external HR systems & outsourcers, & between PeopleSoft and SAP.  \n• Experienced in HRIS / HR IT Operations Management, service delivery & process improvement. \n \nSpecialties:  \n• PeopleSoft HCM upgrade & enterprise software development \n• Positive Motivator, Coach & Mentor of multicultural teams \n• Vendor evaluation & selection processes ( e.g. RFQs )  \n• Data integration with cloud solutions \n• Requirements Gathering \n• Tracking issues to resolution \n• Effective Communication & Stakeholder mgmt \n• SDLC Processes  \n• Vendor Management  \n• HR Data Privacy protection, inc HIPAA \n• Contingent worker standards & practices \n• HR operations knowledge \n• Testing / Test Plans / Test Scripts Versatile IT professional whose career has alternated between senior analyst, people management and project management roles. Successful implementer of HR data integration, ERP upgrades & software development projects following SDLC processes. Experienced HRIS enterprise manager, who fosters a positive team spirit and helps enable staff to increase their breadth and their contributions.  \n \n• Growth and Fortune 100 companies \n• Formed HRIS organization at a global start-up  \n• IT Project Manager experienced in waterfall and Agile methodologies for software development \n• HR ERP Systems Integrator: between PeopleSoft and external HR systems & outsourcers, & between PeopleSoft and SAP.  \n• Experienced in HRIS / HR IT Operations Management, service delivery & process improvement. \n \nSpecialties:  \n• PeopleSoft HCM upgrade & enterprise software development \n• Positive Motivator, Coach & Mentor of multicultural teams \n• Vendor evaluation & selection processes ( e.g. RFQs )  \n• Data integration with cloud solutions \n• Requirements Gathering \n• Tracking issues to resolution \n• Effective Communication & Stakeholder mgmt \n• SDLC Processes  \n• Vendor Management  \n• HR Data Privacy protection, inc HIPAA \n• Contingent worker standards & practices \n• HR operations knowledge \n• Testing / Test Plans / Test Scripts Versatile IT professional whose career has alternated between senior analyst, people management and project management roles. Successful implementer of HR data integration, ERP upgrades & software development projects following SDLC processes. Experienced HRIS enterprise manager, who fosters a positive team spirit and helps enable staff to increase their breadth and their contributions.  \n \n• Growth and Fortune 100 companies \n• Formed HRIS organization at a global start-up  \n• IT Project Manager experienced in waterfall and Agile methodologies for software development \n• HR ERP Systems Integrator: between PeopleSoft and external HR systems & outsourcers, & between PeopleSoft and SAP.  \n• Experienced in HRIS / HR IT Operations Management, service delivery & process improvement. \n \nSpecialties:  \n• PeopleSoft HCM upgrade & enterprise software development \n• Positive Motivator, Coach & Mentor of multicultural teams \n• Vendor evaluation & selection processes ( e.g. RFQs )  \n• Data integration with cloud solutions \n• Requirements Gathering \n• Tracking issues to resolution \n• Effective Communication & Stakeholder mgmt \n• SDLC Processes  \n• Vendor Management  \n• HR Data Privacy protection, inc HIPAA \n• Contingent worker standards & practices \n• HR operations knowledge \n• Testing / Test Plans / Test Scripts Experience IT Manager Intel Corporation October 2012  – Present (2 years 11 months) Folsom, CA Manages a team of systems analysts and quality analysts focused on the delivery of identity management solutions for the enterprise. Agile software development advocate. Sr. Systems Analyst Intel Corporation March 2012  –  October 2012  (8 months) Folsom, CA Systems analyst to implement enterprise Identity and Access Management solution. HRIS Manager Micron Technology May 2010  –  September 2011  (1 year 5 months) Folsom, California Micron Technology acquired Numonyx (prior company) in 2010. While continuing user support of the existing PeopleSoft HR system, acted as HR data integration lead & content expert for phased data transition from PeopleSoft to SAP ERPs for employee data across 11 countries. Identified cross-functional (Finance, Purchasing, HR) dependencies and worked action plans. Managed HRIS support team and liaised with IT contract programmers. Additional project work included leading an internal HR systems alignment project, and facilitating data integration with supplier for corporate employee survey. HRIS Manager Numonyx April 2008  –  May 2010  (2 years 2 months) Folsom, California At a multinational start-up company, implemented the HR global system (PeopleSoft) in partnership with IT. Collaborated with the HR team on requirements, vendor selection, and provided direction to IT integrators to establish new payroll & benefits services globally. Established HRIS operations & standards for the new company. Hired and managed a high-quality virtual team based in the US & Singapore, dedicated to global ERP support and meeting new business requirements for automation. Stabilized HR enterprise environment by removing modifications; trained global HR users, established a global user forum to foster consistent business processes and data quality. Drove implementation of manager and employee self-service tools globally. Project manager of contingent worker data integration project. Business owner for ERP -> Active Directory integration. IT Technical Lead / Senior Analyst Intel Corporation 2007  –  2008  (1 year) Folsom, California As part of IT HRIS, liaised between IT Program Office and HR on formation of Numonyx. Managed HRIS global team to ensure the right technical solutions were implemented for Intel worker data transfer and preservations of parent company network access between Intel and Numonyx. Partnered with IT Applications support to establish, configure, and test PeopleSoft HR ERP for Numonyx. Learned the HR ERP (as it was customized by the parent company) and trained global HR users. HRIS Manager Intel Corporation 2005  –  2007  (2 years) Folsom, California Managed team of 11 systems analysts and developers responsible for Intel's HR system-of-record (PeopleSoft) automation and production support. Handled all aspects of vendor management/sponsorship of 18 contract developers located in either India or the U.S. Set quarterly objectives aligned to IT's strategic objectives & HR portfolio objectives. Kept team focused and motivated to implement critical HR programs. Drove cross-training for better general work coverage. Evaluated outsourcing opportunities. Project Manager / Sr. Systems Analyst Intel Corporation 2003  –  2005  (2 years) Folsom, California Technical lead for the largest (also foundational) track/subteam of the complex PeopleSoft upgrade project (HCM 7.x to 8.8) which involved many sub-projects. Effectively partnered with business leads and programmers to identify software changes required & write functional specs. Led meetings to monitor progress against schedule, performed root cause analysis and tracked issues. Trained on new global payroll module, and consequently identified & highlighted technical incompatibilities to the PMO, which averted thousands of dollars in cost. Recognized (twice) as a key contributor to project success. \n \nLed project to implement Kintana IT governance software for the department. Collaborated with tech lead on prototype, engaged with Finance on ROI, and conducted walkthroughs with stakeholders.  \n \nLed Employee Cash Bonus Program implementation - held firmly to scope, oversaw development, kept delivery on time. HR Application Support Manager / IT Manager Intel Corporation 2000  –  2003  (3 years) Folsom, California Managed HR Applications Support Team of developers and analysts. Ensured on-time execution of annual HR projects such as bonuses, stock program, & performance management. Initiated OnCall Rotation for 24x7 support of PeopleSoft. Adhered to ITIL incident management practices. Also covered as the HRIS Software Quality Assurance Manager while the incumbent was on sabbatical, enforcing QA processes as head of the Technical Design Review Board & ensuring project commitments were met without impacting production system integrity. Key player in Corporate IT Analyst Academy, creating & delivering training in support of a system analyst career path. Information Services Analyst Intel Corporation 1998  –  2000  (2 years) Folsom, California Led HRIS project to implement new company/legal entity across major HR applications: managed stakeholders, assembled team, oversaw software development, developed & drove project plan to meet schedule.  \nFacilitated regional HR system user group meetings in Ireland, Malaysia & U.S. As part of the PeopleSoft upgrade (version 5.1 to 7) project, owned report testing strategy, test plan, test scripts & led global testing. Conducted Year 2000 testing of PeopleSoft. Systems Analyst/System Support Specialist Intel Corporation 1995  –  1998  (3 years) Folsom, California Learned complex Relocation/Mobility business processes and became their HRIS liaison for application development and support. Led Relocation “Get Well” directive on the IT side. Key player in deployment of PeopleSoft 5.x (including user training) in Munich, Malaysia, Singapore & the Philippines. Programmer Analyst Intel Corporation 1992  –  1995  (3 years) Folsom, California Database administrator for BASISPlus and TECHLIBPlus (Library enterprise application). Sponsored by Intel Philippines Library to implement TECHLIBPlus for their location. \nDirector, IDEA (BASISPlus & TECHLIBPlus user group) - coordinated annual user conference in St. Louis, MO. IT Manager Intel Corporation October 2012  – Present (2 years 11 months) Folsom, CA Manages a team of systems analysts and quality analysts focused on the delivery of identity management solutions for the enterprise. Agile software development advocate. IT Manager Intel Corporation October 2012  – Present (2 years 11 months) Folsom, CA Manages a team of systems analysts and quality analysts focused on the delivery of identity management solutions for the enterprise. Agile software development advocate. Sr. Systems Analyst Intel Corporation March 2012  –  October 2012  (8 months) Folsom, CA Systems analyst to implement enterprise Identity and Access Management solution. Sr. Systems Analyst Intel Corporation March 2012  –  October 2012  (8 months) Folsom, CA Systems analyst to implement enterprise Identity and Access Management solution. HRIS Manager Micron Technology May 2010  –  September 2011  (1 year 5 months) Folsom, California Micron Technology acquired Numonyx (prior company) in 2010. While continuing user support of the existing PeopleSoft HR system, acted as HR data integration lead & content expert for phased data transition from PeopleSoft to SAP ERPs for employee data across 11 countries. Identified cross-functional (Finance, Purchasing, HR) dependencies and worked action plans. Managed HRIS support team and liaised with IT contract programmers. Additional project work included leading an internal HR systems alignment project, and facilitating data integration with supplier for corporate employee survey. HRIS Manager Micron Technology May 2010  –  September 2011  (1 year 5 months) Folsom, California Micron Technology acquired Numonyx (prior company) in 2010. While continuing user support of the existing PeopleSoft HR system, acted as HR data integration lead & content expert for phased data transition from PeopleSoft to SAP ERPs for employee data across 11 countries. Identified cross-functional (Finance, Purchasing, HR) dependencies and worked action plans. Managed HRIS support team and liaised with IT contract programmers. Additional project work included leading an internal HR systems alignment project, and facilitating data integration with supplier for corporate employee survey. HRIS Manager Numonyx April 2008  –  May 2010  (2 years 2 months) Folsom, California At a multinational start-up company, implemented the HR global system (PeopleSoft) in partnership with IT. Collaborated with the HR team on requirements, vendor selection, and provided direction to IT integrators to establish new payroll & benefits services globally. Established HRIS operations & standards for the new company. Hired and managed a high-quality virtual team based in the US & Singapore, dedicated to global ERP support and meeting new business requirements for automation. Stabilized HR enterprise environment by removing modifications; trained global HR users, established a global user forum to foster consistent business processes and data quality. Drove implementation of manager and employee self-service tools globally. Project manager of contingent worker data integration project. Business owner for ERP -> Active Directory integration. HRIS Manager Numonyx April 2008  –  May 2010  (2 years 2 months) Folsom, California At a multinational start-up company, implemented the HR global system (PeopleSoft) in partnership with IT. Collaborated with the HR team on requirements, vendor selection, and provided direction to IT integrators to establish new payroll & benefits services globally. Established HRIS operations & standards for the new company. Hired and managed a high-quality virtual team based in the US & Singapore, dedicated to global ERP support and meeting new business requirements for automation. Stabilized HR enterprise environment by removing modifications; trained global HR users, established a global user forum to foster consistent business processes and data quality. Drove implementation of manager and employee self-service tools globally. Project manager of contingent worker data integration project. Business owner for ERP -> Active Directory integration. IT Technical Lead / Senior Analyst Intel Corporation 2007  –  2008  (1 year) Folsom, California As part of IT HRIS, liaised between IT Program Office and HR on formation of Numonyx. Managed HRIS global team to ensure the right technical solutions were implemented for Intel worker data transfer and preservations of parent company network access between Intel and Numonyx. Partnered with IT Applications support to establish, configure, and test PeopleSoft HR ERP for Numonyx. Learned the HR ERP (as it was customized by the parent company) and trained global HR users. IT Technical Lead / Senior Analyst Intel Corporation 2007  –  2008  (1 year) Folsom, California As part of IT HRIS, liaised between IT Program Office and HR on formation of Numonyx. Managed HRIS global team to ensure the right technical solutions were implemented for Intel worker data transfer and preservations of parent company network access between Intel and Numonyx. Partnered with IT Applications support to establish, configure, and test PeopleSoft HR ERP for Numonyx. Learned the HR ERP (as it was customized by the parent company) and trained global HR users. HRIS Manager Intel Corporation 2005  –  2007  (2 years) Folsom, California Managed team of 11 systems analysts and developers responsible for Intel's HR system-of-record (PeopleSoft) automation and production support. Handled all aspects of vendor management/sponsorship of 18 contract developers located in either India or the U.S. Set quarterly objectives aligned to IT's strategic objectives & HR portfolio objectives. Kept team focused and motivated to implement critical HR programs. Drove cross-training for better general work coverage. Evaluated outsourcing opportunities. HRIS Manager Intel Corporation 2005  –  2007  (2 years) Folsom, California Managed team of 11 systems analysts and developers responsible for Intel's HR system-of-record (PeopleSoft) automation and production support. Handled all aspects of vendor management/sponsorship of 18 contract developers located in either India or the U.S. Set quarterly objectives aligned to IT's strategic objectives & HR portfolio objectives. Kept team focused and motivated to implement critical HR programs. Drove cross-training for better general work coverage. Evaluated outsourcing opportunities. Project Manager / Sr. Systems Analyst Intel Corporation 2003  –  2005  (2 years) Folsom, California Technical lead for the largest (also foundational) track/subteam of the complex PeopleSoft upgrade project (HCM 7.x to 8.8) which involved many sub-projects. Effectively partnered with business leads and programmers to identify software changes required & write functional specs. Led meetings to monitor progress against schedule, performed root cause analysis and tracked issues. Trained on new global payroll module, and consequently identified & highlighted technical incompatibilities to the PMO, which averted thousands of dollars in cost. Recognized (twice) as a key contributor to project success. \n \nLed project to implement Kintana IT governance software for the department. Collaborated with tech lead on prototype, engaged with Finance on ROI, and conducted walkthroughs with stakeholders.  \n \nLed Employee Cash Bonus Program implementation - held firmly to scope, oversaw development, kept delivery on time. Project Manager / Sr. Systems Analyst Intel Corporation 2003  –  2005  (2 years) Folsom, California Technical lead for the largest (also foundational) track/subteam of the complex PeopleSoft upgrade project (HCM 7.x to 8.8) which involved many sub-projects. Effectively partnered with business leads and programmers to identify software changes required & write functional specs. Led meetings to monitor progress against schedule, performed root cause analysis and tracked issues. Trained on new global payroll module, and consequently identified & highlighted technical incompatibilities to the PMO, which averted thousands of dollars in cost. Recognized (twice) as a key contributor to project success. \n \nLed project to implement Kintana IT governance software for the department. Collaborated with tech lead on prototype, engaged with Finance on ROI, and conducted walkthroughs with stakeholders.  \n \nLed Employee Cash Bonus Program implementation - held firmly to scope, oversaw development, kept delivery on time. HR Application Support Manager / IT Manager Intel Corporation 2000  –  2003  (3 years) Folsom, California Managed HR Applications Support Team of developers and analysts. Ensured on-time execution of annual HR projects such as bonuses, stock program, & performance management. Initiated OnCall Rotation for 24x7 support of PeopleSoft. Adhered to ITIL incident management practices. Also covered as the HRIS Software Quality Assurance Manager while the incumbent was on sabbatical, enforcing QA processes as head of the Technical Design Review Board & ensuring project commitments were met without impacting production system integrity. Key player in Corporate IT Analyst Academy, creating & delivering training in support of a system analyst career path. HR Application Support Manager / IT Manager Intel Corporation 2000  –  2003  (3 years) Folsom, California Managed HR Applications Support Team of developers and analysts. Ensured on-time execution of annual HR projects such as bonuses, stock program, & performance management. Initiated OnCall Rotation for 24x7 support of PeopleSoft. Adhered to ITIL incident management practices. Also covered as the HRIS Software Quality Assurance Manager while the incumbent was on sabbatical, enforcing QA processes as head of the Technical Design Review Board & ensuring project commitments were met without impacting production system integrity. Key player in Corporate IT Analyst Academy, creating & delivering training in support of a system analyst career path. Information Services Analyst Intel Corporation 1998  –  2000  (2 years) Folsom, California Led HRIS project to implement new company/legal entity across major HR applications: managed stakeholders, assembled team, oversaw software development, developed & drove project plan to meet schedule.  \nFacilitated regional HR system user group meetings in Ireland, Malaysia & U.S. As part of the PeopleSoft upgrade (version 5.1 to 7) project, owned report testing strategy, test plan, test scripts & led global testing. Conducted Year 2000 testing of PeopleSoft. Information Services Analyst Intel Corporation 1998  –  2000  (2 years) Folsom, California Led HRIS project to implement new company/legal entity across major HR applications: managed stakeholders, assembled team, oversaw software development, developed & drove project plan to meet schedule.  \nFacilitated regional HR system user group meetings in Ireland, Malaysia & U.S. As part of the PeopleSoft upgrade (version 5.1 to 7) project, owned report testing strategy, test plan, test scripts & led global testing. Conducted Year 2000 testing of PeopleSoft. Systems Analyst/System Support Specialist Intel Corporation 1995  –  1998  (3 years) Folsom, California Learned complex Relocation/Mobility business processes and became their HRIS liaison for application development and support. Led Relocation “Get Well” directive on the IT side. Key player in deployment of PeopleSoft 5.x (including user training) in Munich, Malaysia, Singapore & the Philippines. Systems Analyst/System Support Specialist Intel Corporation 1995  –  1998  (3 years) Folsom, California Learned complex Relocation/Mobility business processes and became their HRIS liaison for application development and support. Led Relocation “Get Well” directive on the IT side. Key player in deployment of PeopleSoft 5.x (including user training) in Munich, Malaysia, Singapore & the Philippines. Programmer Analyst Intel Corporation 1992  –  1995  (3 years) Folsom, California Database administrator for BASISPlus and TECHLIBPlus (Library enterprise application). Sponsored by Intel Philippines Library to implement TECHLIBPlus for their location. \nDirector, IDEA (BASISPlus & TECHLIBPlus user group) - coordinated annual user conference in St. Louis, MO. Programmer Analyst Intel Corporation 1992  –  1995  (3 years) Folsom, California Database administrator for BASISPlus and TECHLIBPlus (Library enterprise application). Sponsored by Intel Philippines Library to implement TECHLIBPlus for their location. \nDirector, IDEA (BASISPlus & TECHLIBPlus user group) - coordinated annual user conference in St. Louis, MO. Languages English Native or bilingual proficiency French Professional working proficiency English Native or bilingual proficiency French Professional working proficiency English Native or bilingual proficiency French Professional working proficiency Native or bilingual proficiency Professional working proficiency Skills Project Management... PeopleSoft HCM 7.0,... SAP ECC6 SQL SharePoint Excel PowerPoint MS Project Word Documentum PeopleSoft Process Development Integration HRIS PMP Visio Vendor Management Remedy Oracle Identity Manager Microsoft Word Agile & Waterfall... Employee Benefits Change Management Requirements Gathering Process Improvement Human Resources Analysis Cross-functional Team... ERP SAP See 15+     See less Skills  Project Management... PeopleSoft HCM 7.0,... SAP ECC6 SQL SharePoint Excel PowerPoint MS Project Word Documentum PeopleSoft Process Development Integration HRIS PMP Visio Vendor Management Remedy Oracle Identity Manager Microsoft Word Agile & Waterfall... Employee Benefits Change Management Requirements Gathering Process Improvement Human Resources Analysis Cross-functional Team... ERP SAP See 15+     See less Project Management... PeopleSoft HCM 7.0,... SAP ECC6 SQL SharePoint Excel PowerPoint MS Project Word Documentum PeopleSoft Process Development Integration HRIS PMP Visio Vendor Management Remedy Oracle Identity Manager Microsoft Word Agile & Waterfall... Employee Benefits Change Management Requirements Gathering Process Improvement Human Resources Analysis Cross-functional Team... ERP SAP See 15+     See less Project Management... PeopleSoft HCM 7.0,... SAP ECC6 SQL SharePoint Excel PowerPoint MS Project Word Documentum PeopleSoft Process Development Integration HRIS PMP Visio Vendor Management Remedy Oracle Identity Manager Microsoft Word Agile & Waterfall... Employee Benefits Change Management Requirements Gathering Process Improvement Human Resources Analysis Cross-functional Team... ERP SAP See 15+     See less Education California State University BA,  French Spent senior year in Aix-en-Provence, France California State University-Sacramento MS MIS, MBA,  Management Information Systems Degree is Master of Science, Business Administration (Management Information Systems). Includes full MBA curricula as well as MIS. California State University BA,  French Spent senior year in Aix-en-Provence, France California State University BA,  French Spent senior year in Aix-en-Provence, France California State University BA,  French Spent senior year in Aix-en-Provence, France California State University-Sacramento MS MIS, MBA,  Management Information Systems Degree is Master of Science, Business Administration (Management Information Systems). Includes full MBA curricula as well as MIS. California State University-Sacramento MS MIS, MBA,  Management Information Systems Degree is Master of Science, Business Administration (Management Information Systems). Includes full MBA curricula as well as MIS. California State University-Sacramento MS MIS, MBA,  Management Information Systems Degree is Master of Science, Business Administration (Management Information Systems). Includes full MBA curricula as well as MIS. ", "Summary A self-directed, dependable, and customer focused IT professional with over 15 years experience, including nearly 10 years as a enterprise application consultant in a variety of industries. Has extensive skill and experience working with development teams and business partners to develop technical solutions that enable business strategy. Major strengths include team leadership, system architecture, enterprise application integration, product support, and application development and maintenance. \n Summary A self-directed, dependable, and customer focused IT professional with over 15 years experience, including nearly 10 years as a enterprise application consultant in a variety of industries. Has extensive skill and experience working with development teams and business partners to develop technical solutions that enable business strategy. Major strengths include team leadership, system architecture, enterprise application integration, product support, and application development and maintenance. \n A self-directed, dependable, and customer focused IT professional with over 15 years experience, including nearly 10 years as a enterprise application consultant in a variety of industries. Has extensive skill and experience working with development teams and business partners to develop technical solutions that enable business strategy. Major strengths include team leadership, system architecture, enterprise application integration, product support, and application development and maintenance. \n A self-directed, dependable, and customer focused IT professional with over 15 years experience, including nearly 10 years as a enterprise application consultant in a variety of industries. Has extensive skill and experience working with development teams and business partners to develop technical solutions that enable business strategy. Major strengths include team leadership, system architecture, enterprise application integration, product support, and application development and maintenance. \n Experience IT Manager Intel Corporation July 2010  – Present (5 years 2 months) Manage a team of PeopleSoft developers and analysts Systems Analyst Intel Corporation May 2007  –  July 2010  (3 years 3 months) System Engineer Intel Corporation July 2006  –  May 2007  (11 months) Provided second-level server support for five PeopleSoft applications. Analyzed and resolved infrastructure / system issues; partnered with IT support groups; developed and maintained automated scripts to monitor and manage infrastructure; tuned application and web servers to most efficiently use server hardware. <b>bold</b> Solution Architect Intel Corporation May 2005  –  July 2006  (1 year 3 months) Responsible for the execution of the architecture process to maximize the value of business strategies. Developed architecture solutions to business problems by applying common methodologies and frameworks. Established, evangelized, and institutionalized enterprise architecture by driving execution of the architecture process, conformance to its principles, and adoptions of technology roadmaps.  \n \n• Developed three year technical roadmap and future state architecture for platform and reporting product lines. Aligned roadmaps to product line objectives and goals, providing the HR CAM a map to achieve a world class HR system. Drove broad education across HR technical and business community, educating the virtual organization on IT and product line specific roadmaps. \n• Drove architecture for an emerging market payroll and a health benefit outsourcing project. Supported selection of health benefit outsource provider by reviewing and grading RFP for technical compliance with Intel outsourcing strategy. \n• Delivered architecture direction for the Get Healthy program, helping the IT engineering organization meet their SLAs, support planned business events, and scale for future company growth. \n• Collaborated with team to develop strategies to identify the root cause of issues affecting the productions HR systems through the analysis of benchmarking data, and monitoring tools such as WebTrends and FogLight. Results were the development of strategies and tools to accurately predict the affect of changes to the system \n PeopleSoft Consultant Ideatec, Inc. May 2000  –  December 2005  (5 years 8 months) Incorporated to provide expert PeopleSoft Enterprise solutions to companies looking to implement, upgrade, customize or optimize their PeopleSoft implementation. Administrative responsibilities included attracting clients, negotiating terms and rates, and managing accounts. Demonstrated strong commitment to my clients’ success and the ability to deliver high quality solutions on time and within budget, resulting in long-term contracts and repeat engagements. \n \n• Directed technical teams through the planning, fit analysis, configuration, testing, and rollout of three Human Resource and Finance upgrade projects. \n• Implemented human capital management system, streamlining HR systems, business processes, and technologies to reduce operational costs. Deployed employee self-service to facilitate increased efficiences, reduced costs, and a paperless work environment. \n• Initiated and drove data integrity project resulting in reduction of data related support tickets and increased confidence in data. \n• Optimized payroll and benefit batch programs through SQL and program logic redesign, reducing run times up to 90%. \n• Developed applications to automate the loading of vendor vouchers into GL system, transmission of benefit enrollment files to carriers, and the loading of hired applicants from third-party recruiting company.  \n PeopleSoft Consultant Foundation Technology Services September 1996  –  May 2000  (3 years 9 months) Provided consulting services enabling clients to maximize their enterprise application investments. Responsibilities included managing large upgrade projects, custom system design and development, and stakeholder management.  \n \n• Led technical teams through four Human Resource system upgrade projects, ensuring clients continued vendor support and the availability of new features. \n• Implemented Led technical team lead for 2000 Open Enrollment, including the development of automated on-going carrier files using SQR. \n• Designed program to collect payroll data Technical member of payroll implementation team. Implementation involved heavy customizations utilizing SQR and PeopleCode to create a central payment repository for employee pay submissions. Project impacted 68k employees. \n• Designed data migration strategy to rollout enterprise HR system to additional companies, enabling the EOL of redundant legacy application. \n• Established coding and development standards, increasing software quality. \n• Developed standard libraries for developers to perform functions such as email notification, ftp transfers, and PGP Encryption. \n PeopleSoft Developer / Analyst County of Fresno May 1995  –  September 1996  (1 year 5 months) Responsible for the technical analysis, design, development, testing, implementation and post implementation support of change requests to the PeopleSoft HR system. Reviewed technical documentation of other developers to validate the design and ensure consistent data models. Worked with all levels of HR staff to gather requirements and validate solutions. IT Manager Intel Corporation July 2010  – Present (5 years 2 months) Manage a team of PeopleSoft developers and analysts IT Manager Intel Corporation July 2010  – Present (5 years 2 months) Manage a team of PeopleSoft developers and analysts Systems Analyst Intel Corporation May 2007  –  July 2010  (3 years 3 months) Systems Analyst Intel Corporation May 2007  –  July 2010  (3 years 3 months) System Engineer Intel Corporation July 2006  –  May 2007  (11 months) Provided second-level server support for five PeopleSoft applications. Analyzed and resolved infrastructure / system issues; partnered with IT support groups; developed and maintained automated scripts to monitor and manage infrastructure; tuned application and web servers to most efficiently use server hardware. <b>bold</b> System Engineer Intel Corporation July 2006  –  May 2007  (11 months) Provided second-level server support for five PeopleSoft applications. Analyzed and resolved infrastructure / system issues; partnered with IT support groups; developed and maintained automated scripts to monitor and manage infrastructure; tuned application and web servers to most efficiently use server hardware. <b>bold</b> Solution Architect Intel Corporation May 2005  –  July 2006  (1 year 3 months) Responsible for the execution of the architecture process to maximize the value of business strategies. Developed architecture solutions to business problems by applying common methodologies and frameworks. Established, evangelized, and institutionalized enterprise architecture by driving execution of the architecture process, conformance to its principles, and adoptions of technology roadmaps.  \n \n• Developed three year technical roadmap and future state architecture for platform and reporting product lines. Aligned roadmaps to product line objectives and goals, providing the HR CAM a map to achieve a world class HR system. Drove broad education across HR technical and business community, educating the virtual organization on IT and product line specific roadmaps. \n• Drove architecture for an emerging market payroll and a health benefit outsourcing project. Supported selection of health benefit outsource provider by reviewing and grading RFP for technical compliance with Intel outsourcing strategy. \n• Delivered architecture direction for the Get Healthy program, helping the IT engineering organization meet their SLAs, support planned business events, and scale for future company growth. \n• Collaborated with team to develop strategies to identify the root cause of issues affecting the productions HR systems through the analysis of benchmarking data, and monitoring tools such as WebTrends and FogLight. Results were the development of strategies and tools to accurately predict the affect of changes to the system \n Solution Architect Intel Corporation May 2005  –  July 2006  (1 year 3 months) Responsible for the execution of the architecture process to maximize the value of business strategies. Developed architecture solutions to business problems by applying common methodologies and frameworks. Established, evangelized, and institutionalized enterprise architecture by driving execution of the architecture process, conformance to its principles, and adoptions of technology roadmaps.  \n \n• Developed three year technical roadmap and future state architecture for platform and reporting product lines. Aligned roadmaps to product line objectives and goals, providing the HR CAM a map to achieve a world class HR system. Drove broad education across HR technical and business community, educating the virtual organization on IT and product line specific roadmaps. \n• Drove architecture for an emerging market payroll and a health benefit outsourcing project. Supported selection of health benefit outsource provider by reviewing and grading RFP for technical compliance with Intel outsourcing strategy. \n• Delivered architecture direction for the Get Healthy program, helping the IT engineering organization meet their SLAs, support planned business events, and scale for future company growth. \n• Collaborated with team to develop strategies to identify the root cause of issues affecting the productions HR systems through the analysis of benchmarking data, and monitoring tools such as WebTrends and FogLight. Results were the development of strategies and tools to accurately predict the affect of changes to the system \n PeopleSoft Consultant Ideatec, Inc. May 2000  –  December 2005  (5 years 8 months) Incorporated to provide expert PeopleSoft Enterprise solutions to companies looking to implement, upgrade, customize or optimize their PeopleSoft implementation. Administrative responsibilities included attracting clients, negotiating terms and rates, and managing accounts. Demonstrated strong commitment to my clients’ success and the ability to deliver high quality solutions on time and within budget, resulting in long-term contracts and repeat engagements. \n \n• Directed technical teams through the planning, fit analysis, configuration, testing, and rollout of three Human Resource and Finance upgrade projects. \n• Implemented human capital management system, streamlining HR systems, business processes, and technologies to reduce operational costs. Deployed employee self-service to facilitate increased efficiences, reduced costs, and a paperless work environment. \n• Initiated and drove data integrity project resulting in reduction of data related support tickets and increased confidence in data. \n• Optimized payroll and benefit batch programs through SQL and program logic redesign, reducing run times up to 90%. \n• Developed applications to automate the loading of vendor vouchers into GL system, transmission of benefit enrollment files to carriers, and the loading of hired applicants from third-party recruiting company.  \n PeopleSoft Consultant Ideatec, Inc. May 2000  –  December 2005  (5 years 8 months) Incorporated to provide expert PeopleSoft Enterprise solutions to companies looking to implement, upgrade, customize or optimize their PeopleSoft implementation. Administrative responsibilities included attracting clients, negotiating terms and rates, and managing accounts. Demonstrated strong commitment to my clients’ success and the ability to deliver high quality solutions on time and within budget, resulting in long-term contracts and repeat engagements. \n \n• Directed technical teams through the planning, fit analysis, configuration, testing, and rollout of three Human Resource and Finance upgrade projects. \n• Implemented human capital management system, streamlining HR systems, business processes, and technologies to reduce operational costs. Deployed employee self-service to facilitate increased efficiences, reduced costs, and a paperless work environment. \n• Initiated and drove data integrity project resulting in reduction of data related support tickets and increased confidence in data. \n• Optimized payroll and benefit batch programs through SQL and program logic redesign, reducing run times up to 90%. \n• Developed applications to automate the loading of vendor vouchers into GL system, transmission of benefit enrollment files to carriers, and the loading of hired applicants from third-party recruiting company.  \n PeopleSoft Consultant Foundation Technology Services September 1996  –  May 2000  (3 years 9 months) Provided consulting services enabling clients to maximize their enterprise application investments. Responsibilities included managing large upgrade projects, custom system design and development, and stakeholder management.  \n \n• Led technical teams through four Human Resource system upgrade projects, ensuring clients continued vendor support and the availability of new features. \n• Implemented Led technical team lead for 2000 Open Enrollment, including the development of automated on-going carrier files using SQR. \n• Designed program to collect payroll data Technical member of payroll implementation team. Implementation involved heavy customizations utilizing SQR and PeopleCode to create a central payment repository for employee pay submissions. Project impacted 68k employees. \n• Designed data migration strategy to rollout enterprise HR system to additional companies, enabling the EOL of redundant legacy application. \n• Established coding and development standards, increasing software quality. \n• Developed standard libraries for developers to perform functions such as email notification, ftp transfers, and PGP Encryption. \n PeopleSoft Consultant Foundation Technology Services September 1996  –  May 2000  (3 years 9 months) Provided consulting services enabling clients to maximize their enterprise application investments. Responsibilities included managing large upgrade projects, custom system design and development, and stakeholder management.  \n \n• Led technical teams through four Human Resource system upgrade projects, ensuring clients continued vendor support and the availability of new features. \n• Implemented Led technical team lead for 2000 Open Enrollment, including the development of automated on-going carrier files using SQR. \n• Designed program to collect payroll data Technical member of payroll implementation team. Implementation involved heavy customizations utilizing SQR and PeopleCode to create a central payment repository for employee pay submissions. Project impacted 68k employees. \n• Designed data migration strategy to rollout enterprise HR system to additional companies, enabling the EOL of redundant legacy application. \n• Established coding and development standards, increasing software quality. \n• Developed standard libraries for developers to perform functions such as email notification, ftp transfers, and PGP Encryption. \n PeopleSoft Developer / Analyst County of Fresno May 1995  –  September 1996  (1 year 5 months) Responsible for the technical analysis, design, development, testing, implementation and post implementation support of change requests to the PeopleSoft HR system. Reviewed technical documentation of other developers to validate the design and ensure consistent data models. Worked with all levels of HR staff to gather requirements and validate solutions. PeopleSoft Developer / Analyst County of Fresno May 1995  –  September 1996  (1 year 5 months) Responsible for the technical analysis, design, development, testing, implementation and post implementation support of change requests to the PeopleSoft HR system. Reviewed technical documentation of other developers to validate the design and ensure consistent data models. Worked with all levels of HR staff to gather requirements and validate solutions. Skills Management Systems Analysis Solution Architecture PeopleSoft HCM PeopleTools PeopleSoft Skills  Management Systems Analysis Solution Architecture PeopleSoft HCM PeopleTools PeopleSoft Management Systems Analysis Solution Architecture PeopleSoft HCM PeopleTools PeopleSoft Management Systems Analysis Solution Architecture PeopleSoft HCM PeopleTools PeopleSoft Education California State University, Fresno BS,  Business Administration - Information Systems 1992  – 1994 Activities and Societies:  Delta Sigma Pi California State University, Fresno BS,  Business Administration - Information Systems 1992  – 1994 Activities and Societies:  Delta Sigma Pi California State University, Fresno BS,  Business Administration - Information Systems 1992  – 1994 Activities and Societies:  Delta Sigma Pi California State University, Fresno BS,  Business Administration - Information Systems 1992  – 1994 Activities and Societies:  Delta Sigma Pi ", "Experience Sr IT Manager Intel Corporation January 2014  – Present (1 year 8 months) San Francisco Bay Area Service owner Sr IT Manager Intel Corporation January 2014  – Present (1 year 8 months) San Francisco Bay Area Service owner Sr IT Manager Intel Corporation January 2014  – Present (1 year 8 months) San Francisco Bay Area Service owner Skills Organizational... Strategic Leadership Program Management Enterprise Architecture Cross-functional Team... Business Intelligence Business Analysis Software Development Enterprise Software Project Management ERP Databases Semiconductors Agile Methodologies Product Management PMP Data Warehousing Data Analytics Data Visualization Distributed Team... Strategy Techinical Technical Leadership Software Project... Management Vendor Management See 11+     See less Skills  Organizational... Strategic Leadership Program Management Enterprise Architecture Cross-functional Team... Business Intelligence Business Analysis Software Development Enterprise Software Project Management ERP Databases Semiconductors Agile Methodologies Product Management PMP Data Warehousing Data Analytics Data Visualization Distributed Team... Strategy Techinical Technical Leadership Software Project... Management Vendor Management See 11+     See less Organizational... Strategic Leadership Program Management Enterprise Architecture Cross-functional Team... Business Intelligence Business Analysis Software Development Enterprise Software Project Management ERP Databases Semiconductors Agile Methodologies Product Management PMP Data Warehousing Data Analytics Data Visualization Distributed Team... Strategy Techinical Technical Leadership Software Project... Management Vendor Management See 11+     See less Organizational... Strategic Leadership Program Management Enterprise Architecture Cross-functional Team... Business Intelligence Business Analysis Software Development Enterprise Software Project Management ERP Databases Semiconductors Agile Methodologies Product Management PMP Data Warehousing Data Analytics Data Visualization Distributed Team... Strategy Techinical Technical Leadership Software Project... Management Vendor Management See 11+     See less ", "Experience IT Manager Intel Corporation IT Manager Intel Corporation IT Manager Intel Corporation Skills System Architecture IT Management TCP/IP Skills  System Architecture IT Management TCP/IP System Architecture IT Management TCP/IP System Architecture IT Management TCP/IP Education 1987  – 1991 Penang Free School 1985  – 1986 1987  – 1991 1987  – 1991 1987  – 1991 Penang Free School 1985  – 1986 Penang Free School 1985  – 1986 Penang Free School 1985  – 1986 ", "Experience Global Director of Mfg Service Desks Intel Corp.(Costa Rica) 2010  – Present (5 years) IT Manager Intel Corporation 1997  – Present (18 years) IT Support and Sustaining Manager Lantech Costa Rica 1988  –  1997  (9 years) Global Director of Mfg Service Desks Intel Corp.(Costa Rica) 2010  – Present (5 years) Global Director of Mfg Service Desks Intel Corp.(Costa Rica) 2010  – Present (5 years) IT Manager Intel Corporation 1997  – Present (18 years) IT Manager Intel Corporation 1997  – Present (18 years) IT Support and Sustaining Manager Lantech Costa Rica 1988  –  1997  (9 years) IT Support and Sustaining Manager Lantech Costa Rica 1988  –  1997  (9 years) Skills Cisco Technologies Cross-functional Team... Customer Engagement IT Management Wireless Integration Management PMP Troubleshooting IT Service Management Leadership Product Management Project Management Software Project... Software Development Strategic Planning Team Leadership See 2+     See less Skills  Cisco Technologies Cross-functional Team... Customer Engagement IT Management Wireless Integration Management PMP Troubleshooting IT Service Management Leadership Product Management Project Management Software Project... Software Development Strategic Planning Team Leadership See 2+     See less Cisco Technologies Cross-functional Team... Customer Engagement IT Management Wireless Integration Management PMP Troubleshooting IT Service Management Leadership Product Management Project Management Software Project... Software Development Strategic Planning Team Leadership See 2+     See less Cisco Technologies Cross-functional Team... Customer Engagement IT Management Wireless Integration Management PMP Troubleshooting IT Service Management Leadership Product Management Project Management Software Project... Software Development Strategic Planning Team Leadership See 2+     See less Education Linfield College Computer Science and Business Administration 1986  – 1988 University of Costa Rica 1982  – 1986 Linfield College Computer Science and Business Administration 1986  – 1988 Linfield College Computer Science and Business Administration 1986  – 1988 Linfield College Computer Science and Business Administration 1986  – 1988 University of Costa Rica 1982  – 1986 University of Costa Rica 1982  – 1986 University of Costa Rica 1982  – 1986 ", "Languages English English English Skills Agile Project Management Program Management IT Strategy Enterprise Software Vendor Management Cloud Computing Project Portfolio... Business Process... Product Management Agile Methodologies Cross-functional Team... Business Intelligence Enterprise Architecture IT Management Analytics Requirements Analysis Infrastructure Six Sigma Marketing Strategy Network Engineering Active Directory Windows Server Virtualization Strategic Leadership Technical Leadership Security Business Process... Management ITIL Strategy Integration Leadership SaaS Product Development Software Development Software Project... See 21+     See less Skills  Agile Project Management Program Management IT Strategy Enterprise Software Vendor Management Cloud Computing Project Portfolio... Business Process... Product Management Agile Methodologies Cross-functional Team... Business Intelligence Enterprise Architecture IT Management Analytics Requirements Analysis Infrastructure Six Sigma Marketing Strategy Network Engineering Active Directory Windows Server Virtualization Strategic Leadership Technical Leadership Security Business Process... Management ITIL Strategy Integration Leadership SaaS Product Development Software Development Software Project... See 21+     See less Agile Project Management Program Management IT Strategy Enterprise Software Vendor Management Cloud Computing Project Portfolio... Business Process... Product Management Agile Methodologies Cross-functional Team... Business Intelligence Enterprise Architecture IT Management Analytics Requirements Analysis Infrastructure Six Sigma Marketing Strategy Network Engineering Active Directory Windows Server Virtualization Strategic Leadership Technical Leadership Security Business Process... Management ITIL Strategy Integration Leadership SaaS Product Development Software Development Software Project... See 21+     See less Agile Project Management Program Management IT Strategy Enterprise Software Vendor Management Cloud Computing Project Portfolio... Business Process... Product Management Agile Methodologies Cross-functional Team... Business Intelligence Enterprise Architecture IT Management Analytics Requirements Analysis Infrastructure Six Sigma Marketing Strategy Network Engineering Active Directory Windows Server Virtualization Strategic Leadership Technical Leadership Security Business Process... Management ITIL Strategy Integration Leadership SaaS Product Development Software Development Software Project... See 21+     See less Honors & Awards ", "Skills Perl Linux Intel System Architecture Bash Debugging Shell Scripting Software Development System Administration Hardware Operating Systems TCP/IP Virtualization Unix Software Engineering Skills  Perl Linux Intel System Architecture Bash Debugging Shell Scripting Software Development System Administration Hardware Operating Systems TCP/IP Virtualization Unix Software Engineering Perl Linux Intel System Architecture Bash Debugging Shell Scripting Software Development System Administration Hardware Operating Systems TCP/IP Virtualization Unix Software Engineering Perl Linux Intel System Architecture Bash Debugging Shell Scripting Software Development System Administration Hardware Operating Systems TCP/IP Virtualization Unix Software Engineering ", "Languages English Native or bilingual proficiency Spanish Limited working proficiency English Native or bilingual proficiency Spanish Limited working proficiency English Native or bilingual proficiency Spanish Limited working proficiency Native or bilingual proficiency Limited working proficiency Skills Software Development Program Management SDLC Agile Methodologies Cross-functional Team... Software Engineering Leadership Development IT Service Management Certified Information... Project Management Testing Linux Business Process Management Enterprise Software Microsoft SQL Server Requirements Analysis Technical Leadership Risk Management Operational Planning Information Technology Strategic Partnerships See 7+     See less Skills  Software Development Program Management SDLC Agile Methodologies Cross-functional Team... Software Engineering Leadership Development IT Service Management Certified Information... Project Management Testing Linux Business Process Management Enterprise Software Microsoft SQL Server Requirements Analysis Technical Leadership Risk Management Operational Planning Information Technology Strategic Partnerships See 7+     See less Software Development Program Management SDLC Agile Methodologies Cross-functional Team... Software Engineering Leadership Development IT Service Management Certified Information... Project Management Testing Linux Business Process Management Enterprise Software Microsoft SQL Server Requirements Analysis Technical Leadership Risk Management Operational Planning Information Technology Strategic Partnerships See 7+     See less Software Development Program Management SDLC Agile Methodologies Cross-functional Team... Software Engineering Leadership Development IT Service Management Certified Information... Project Management Testing Linux Business Process Management Enterprise Software Microsoft SQL Server Requirements Analysis Technical Leadership Risk Management Operational Planning Information Technology Strategic Partnerships See 7+     See less ", "Summary Have had a role of a \"People Manager\" and \"Technical Lead\" for over 15 years now. Also have a strong backgound in IT and have been a developer and a DBA in the past. \n \nWould like to continue to manage people and have some technical role to go along with it (Preferably managing the same team that I'm leading on a project). Specialties:People Management, Project Management / Leading technical teams. Database and SQL backgound. Summary Have had a role of a \"People Manager\" and \"Technical Lead\" for over 15 years now. Also have a strong backgound in IT and have been a developer and a DBA in the past. \n \nWould like to continue to manage people and have some technical role to go along with it (Preferably managing the same team that I'm leading on a project). Specialties:People Management, Project Management / Leading technical teams. Database and SQL backgound. Have had a role of a \"People Manager\" and \"Technical Lead\" for over 15 years now. Also have a strong backgound in IT and have been a developer and a DBA in the past. \n \nWould like to continue to manage people and have some technical role to go along with it (Preferably managing the same team that I'm leading on a project). Specialties:People Management, Project Management / Leading technical teams. Database and SQL backgound. Have had a role of a \"People Manager\" and \"Technical Lead\" for over 15 years now. Also have a strong backgound in IT and have been a developer and a DBA in the past. \n \nWould like to continue to manage people and have some technical role to go along with it (Preferably managing the same team that I'm leading on a project). Specialties:People Management, Project Management / Leading technical teams. Database and SQL backgound. Experience IT Manager Intel Corporation July 1995  – Present (20 years 2 months) Started as a Sr. programmer / Analyst and worked on the Data Warehouse application (Primarily the homegrown ET&L tool). Owned the design, development and maintenance of all the backend SQL code. \n \nManaged the development team that owned the above mentioned ET&L tool. The team included C++, SQL and Powerbuilder developers. \n \nManaged various other teams within the Enterprise Data Warehouse (e.g. production support, Reporting and DBA teams). \n \nSince 2007, have been managing the Analyst team working on Finance applications. Have also been working as a PM in different areas from time to time (e.g. Defined the strategy, developed the process, and setup the infrastructure to do comparative test of a major Cost application. Defined the strategy and developed, as well as tested the Disaster Recovery solution for a mission critical application). Systems Analyst Ranbaxy 1994  –  1995  (1 year) Was a systems analyst and worked in the export division creating and maintaining the export applications and solutions. Primarily worked on designing and developing systems and applications on Sybase database. Sr. Programmer Apollo Tyres 1991  –  1994  (3 years) Mainly developed and maintained the company's Stock registration and transfer systems. Sr. Programmer Analyst Patni Computer Systems March 1989  –  April 1991  (2 years 2 months) The company was a major Share registrar and transfer agent for various publicly listed companies. Was responsible to develop, maintain and execute applications (from end to end) that dealt with both, the new public stock issues or regular stock transfers. Sr. Programmer PHS Consultants October 1986  –  March 1989  (2 years 6 months) This was a small privately held firm employing around 30 people. Started with a company as a junior programmer but rose to the position of their IT head managing 3 other developers and 10 Operators / data entry folks. Handled a variety of projects / applications including financials and account receivables for a number of publicly traded and/or private companies. IT Manager Intel Corporation July 1995  – Present (20 years 2 months) Started as a Sr. programmer / Analyst and worked on the Data Warehouse application (Primarily the homegrown ET&L tool). Owned the design, development and maintenance of all the backend SQL code. \n \nManaged the development team that owned the above mentioned ET&L tool. The team included C++, SQL and Powerbuilder developers. \n \nManaged various other teams within the Enterprise Data Warehouse (e.g. production support, Reporting and DBA teams). \n \nSince 2007, have been managing the Analyst team working on Finance applications. Have also been working as a PM in different areas from time to time (e.g. Defined the strategy, developed the process, and setup the infrastructure to do comparative test of a major Cost application. Defined the strategy and developed, as well as tested the Disaster Recovery solution for a mission critical application). IT Manager Intel Corporation July 1995  – Present (20 years 2 months) Started as a Sr. programmer / Analyst and worked on the Data Warehouse application (Primarily the homegrown ET&L tool). Owned the design, development and maintenance of all the backend SQL code. \n \nManaged the development team that owned the above mentioned ET&L tool. The team included C++, SQL and Powerbuilder developers. \n \nManaged various other teams within the Enterprise Data Warehouse (e.g. production support, Reporting and DBA teams). \n \nSince 2007, have been managing the Analyst team working on Finance applications. Have also been working as a PM in different areas from time to time (e.g. Defined the strategy, developed the process, and setup the infrastructure to do comparative test of a major Cost application. Defined the strategy and developed, as well as tested the Disaster Recovery solution for a mission critical application). Systems Analyst Ranbaxy 1994  –  1995  (1 year) Was a systems analyst and worked in the export division creating and maintaining the export applications and solutions. Primarily worked on designing and developing systems and applications on Sybase database. Systems Analyst Ranbaxy 1994  –  1995  (1 year) Was a systems analyst and worked in the export division creating and maintaining the export applications and solutions. Primarily worked on designing and developing systems and applications on Sybase database. Sr. Programmer Apollo Tyres 1991  –  1994  (3 years) Mainly developed and maintained the company's Stock registration and transfer systems. Sr. Programmer Apollo Tyres 1991  –  1994  (3 years) Mainly developed and maintained the company's Stock registration and transfer systems. Sr. Programmer Analyst Patni Computer Systems March 1989  –  April 1991  (2 years 2 months) The company was a major Share registrar and transfer agent for various publicly listed companies. Was responsible to develop, maintain and execute applications (from end to end) that dealt with both, the new public stock issues or regular stock transfers. Sr. Programmer Analyst Patni Computer Systems March 1989  –  April 1991  (2 years 2 months) The company was a major Share registrar and transfer agent for various publicly listed companies. Was responsible to develop, maintain and execute applications (from end to end) that dealt with both, the new public stock issues or regular stock transfers. Sr. Programmer PHS Consultants October 1986  –  March 1989  (2 years 6 months) This was a small privately held firm employing around 30 people. Started with a company as a junior programmer but rose to the position of their IT head managing 3 other developers and 10 Operators / data entry folks. Handled a variety of projects / applications including financials and account receivables for a number of publicly traded and/or private companies. Sr. Programmer PHS Consultants October 1986  –  March 1989  (2 years 6 months) This was a small privately held firm employing around 30 people. Started with a company as a junior programmer but rose to the position of their IT head managing 3 other developers and 10 Operators / data entry folks. Handled a variety of projects / applications including financials and account receivables for a number of publicly traded and/or private companies. Languages Hindi Hindi Hindi Skills Management Database Administration Project Management Disaster Recovery SQL Programming Product Management Data Warehousing Databases Security Program Management Software Development Business Analysis Strategy Business Intelligence Database Design IT Management Integration Software Project... Enterprise Architecture Requirements Analysis See 6+     See less Skills  Management Database Administration Project Management Disaster Recovery SQL Programming Product Management Data Warehousing Databases Security Program Management Software Development Business Analysis Strategy Business Intelligence Database Design IT Management Integration Software Project... Enterprise Architecture Requirements Analysis See 6+     See less Management Database Administration Project Management Disaster Recovery SQL Programming Product Management Data Warehousing Databases Security Program Management Software Development Business Analysis Strategy Business Intelligence Database Design IT Management Integration Software Project... Enterprise Architecture Requirements Analysis See 6+     See less Management Database Administration Project Management Disaster Recovery SQL Programming Product Management Data Warehousing Databases Security Program Management Software Development Business Analysis Strategy Business Intelligence Database Design IT Management Integration Software Project... Enterprise Architecture Requirements Analysis See 6+     See less Education A.I.I.M.A MBA (PGDM),  Information Technology 1993  – 1997 Delhi University Bachelor of Commerce,  Business 1984  – 1987 A.I.I.M.A MBA (PGDM),  Information Technology 1993  – 1997 A.I.I.M.A MBA (PGDM),  Information Technology 1993  – 1997 A.I.I.M.A MBA (PGDM),  Information Technology 1993  – 1997 Delhi University Bachelor of Commerce,  Business 1984  – 1987 Delhi University Bachelor of Commerce,  Business 1984  – 1987 Delhi University Bachelor of Commerce,  Business 1984  – 1987 ", "Experience it manager Intel Corporation it manager Intel Corporation March 2011  –  June 2013  (2 years 4 months) it manager Intel Corporation it manager Intel Corporation it manager Intel Corporation March 2011  –  June 2013  (2 years 4 months) it manager Intel Corporation March 2011  –  June 2013  (2 years 4 months) Education Indian Institute of Technology, Kanpur Bachelor of Science (BSc),  Information Technology 2011  – 2014 National Institute of Information Technology Bachelor of Science (BSc),  Information Technology 2011  – 2014 Indian Institute of Technology, Kanpur Bachelor of Science (BSc),  Information Technology 2011  – 2014 Indian Institute of Technology, Kanpur Bachelor of Science (BSc),  Information Technology 2011  – 2014 Indian Institute of Technology, Kanpur Bachelor of Science (BSc),  Information Technology 2011  – 2014 National Institute of Information Technology Bachelor of Science (BSc),  Information Technology 2011  – 2014 National Institute of Information Technology Bachelor of Science (BSc),  Information Technology 2011  – 2014 National Institute of Information Technology Bachelor of Science (BSc),  Information Technology 2011  – 2014 ", "Languages English English English Skills Enterprise Software Enterprise Architecture Leadership Architectures Web Development Human Resources Engineering Semiconductors Cross-functional Team... Engineering Management Embedded Systems Project Portfolio... Software Development Software Engineering System Architecture Program Management Product Management Agile Methodologies Perl Integration See 5+     See less Skills  Enterprise Software Enterprise Architecture Leadership Architectures Web Development Human Resources Engineering Semiconductors Cross-functional Team... Engineering Management Embedded Systems Project Portfolio... Software Development Software Engineering System Architecture Program Management Product Management Agile Methodologies Perl Integration See 5+     See less Enterprise Software Enterprise Architecture Leadership Architectures Web Development Human Resources Engineering Semiconductors Cross-functional Team... Engineering Management Embedded Systems Project Portfolio... Software Development Software Engineering System Architecture Program Management Product Management Agile Methodologies Perl Integration See 5+     See less Enterprise Software Enterprise Architecture Leadership Architectures Web Development Human Resources Engineering Semiconductors Cross-functional Team... Engineering Management Embedded Systems Project Portfolio... Software Development Software Engineering System Architecture Program Management Product Management Agile Methodologies Perl Integration See 5+     See less ", "Skills Master Data Management ETL Business Intelligence Data Warehousing Microsoft SQL Server Data Modeling Enterprise Architecture SAP BI Databases ERP Agile Methodologies Software Project... Strategy Solution Architecture Enterprise Software Data Integration Data Warehouse... SDLC Data Quality Integration SQL Program Management SSIS Software Development IT Management Requirements Analysis Business Objects Database Design Management Architecture SSRS SAP ERP IT Strategy SAP BW See 19+     See less Skills  Master Data Management ETL Business Intelligence Data Warehousing Microsoft SQL Server Data Modeling Enterprise Architecture SAP BI Databases ERP Agile Methodologies Software Project... Strategy Solution Architecture Enterprise Software Data Integration Data Warehouse... SDLC Data Quality Integration SQL Program Management SSIS Software Development IT Management Requirements Analysis Business Objects Database Design Management Architecture SSRS SAP ERP IT Strategy SAP BW See 19+     See less Master Data Management ETL Business Intelligence Data Warehousing Microsoft SQL Server Data Modeling Enterprise Architecture SAP BI Databases ERP Agile Methodologies Software Project... Strategy Solution Architecture Enterprise Software Data Integration Data Warehouse... SDLC Data Quality Integration SQL Program Management SSIS Software Development IT Management Requirements Analysis Business Objects Database Design Management Architecture SSRS SAP ERP IT Strategy SAP BW See 19+     See less Master Data Management ETL Business Intelligence Data Warehousing Microsoft SQL Server Data Modeling Enterprise Architecture SAP BI Databases ERP Agile Methodologies Software Project... Strategy Solution Architecture Enterprise Software Data Integration Data Warehouse... SDLC Data Quality Integration SQL Program Management SSIS Software Development IT Management Requirements Analysis Business Objects Database Design Management Architecture SSRS SAP ERP IT Strategy SAP BW See 19+     See less ", "Experience IT Manager Intel Corporation IT Manager Intel Corporation IT Manager Intel Corporation Education Tecnológico de Costa Rica 1983  – 1989 Tecnológico de Costa Rica 1983  – 1989 Tecnológico de Costa Rica 1983  – 1989 Tecnológico de Costa Rica 1983  – 1989 "]}