{"position": "IT Project Manager", "company": "Intel Corporation", "profiles": ["Skills Program Management Software Project... Project Management Process Improvement Intel SDLC Requirements Analysis Business Analysis Vendor Management Change Management Visio Data Analysis MS Project Project Planning Management Strategic Planning Cross Functional... Cross Functional... Six Sigma Team Building Business Intelligence Business Process See 7+     See less Skills  Program Management Software Project... Project Management Process Improvement Intel SDLC Requirements Analysis Business Analysis Vendor Management Change Management Visio Data Analysis MS Project Project Planning Management Strategic Planning Cross Functional... Cross Functional... Six Sigma Team Building Business Intelligence Business Process See 7+     See less Program Management Software Project... Project Management Process Improvement Intel SDLC Requirements Analysis Business Analysis Vendor Management Change Management Visio Data Analysis MS Project Project Planning Management Strategic Planning Cross Functional... Cross Functional... Six Sigma Team Building Business Intelligence Business Process See 7+     See less Program Management Software Project... Project Management Process Improvement Intel SDLC Requirements Analysis Business Analysis Vendor Management Change Management Visio Data Analysis MS Project Project Planning Management Strategic Planning Cross Functional... Cross Functional... Six Sigma Team Building Business Intelligence Business Process See 7+     See less ", "Summary Experienced IT management professional with extensive experience implementing, enhancing, and maintaining enterprise business applications for multi-national companies. Highly focused individual who works well in fast paced, dynamic environments. Strong interpersonal and communication skills. Summary Experienced IT management professional with extensive experience implementing, enhancing, and maintaining enterprise business applications for multi-national companies. Highly focused individual who works well in fast paced, dynamic environments. Strong interpersonal and communication skills. Experienced IT management professional with extensive experience implementing, enhancing, and maintaining enterprise business applications for multi-national companies. Highly focused individual who works well in fast paced, dynamic environments. Strong interpersonal and communication skills. Experienced IT management professional with extensive experience implementing, enhancing, and maintaining enterprise business applications for multi-national companies. Highly focused individual who works well in fast paced, dynamic environments. Strong interpersonal and communication skills. Experience HR Business Applications Manager Mentor Graphics April 2011  – Present (4 years 5 months) Wilsonville, OR HR technical business application and HR solution project manager. Lead a senior team of Mentor employees and consultants to enable the Human Resources processes and systems. SAP Rollout Manager - Manufacturing Implementation Vestas Wind Systems August 2010  –  February 2011  (7 months) Portland, Oregon Area Rollout Manager for Vestas SAP Manufacturing implementation. Created rollout plan, strategy, schedule, and budget. Primary liaison between the program team and the impacted factories. Regional Manager SAP Competence Center Vestas Wind Systems July 2008  –  July 2010  (2 years 1 month) Portland, Oregon Area Manager of America’s regional SAP Competence Center. Oversee staff of 28 SAP analysts, consultants, developers, and trainers. Responsible for staffing the competence center from ground up. Responsibilities included; recruiting, budgeting, resource planning, staff development, communication with Sr executives. SAP Project Manager Vestas Wind Systems March 2007  –  June 2008  (1 year 4 months) Portland, Oregon Area Project manager responsible for deployment of Vestas global SAP template to North American business organization. Technical solution scope included SD, CRM, PS, MM, WM, PM, MI, FICO, and HR modules. Senior IT Project Manager Intel January 2006  –  October 2006  (10 months) Portland, Oregon Area Project manager responsible for deployment of a Master Production Scheduling Application for Intel’s chipset products. Senior IT Project Manager Intel Corporation May 2003  –  December 2005  (2 years 8 months) Portland, Oregon Area Project deployment manager the SAP Multi-factory Optimization project based on SAP APO module - to optimize Intel's Flash Memory products planning processes and technology. IT Project Manager Intel Corporation February 2002  –  May 2003  (1 year 4 months) Portland, Oregon Area IT M&A Integration manager responsible for converting 3+ acquired companies’ data into Intel’s SAP and peripheral systems and deploying the Intel processes to the end users. IT Project Manager Intel Corporation July 2000  –  January 2002  (1 year 7 months) Portland, Oregon Area Project manager responsible for the full project lifecycle to enable and deploy SAP service and Software order management functionality to 3 acquired companies and 2 new internal businesses. IT Manager Intel Corporation January 2000  –  June 2000  (6 months) Portland, Oregon Area Responsible for management of 5 SAP analysts and support staff who were responsible for developing and maintaining the SAP FICO modules (General Ledger, Controlling modules). IT Project Lead & Analyst Intel Corporation December 1998  –  December 1999  (1 year 1 month) Portland, Oregon Area Joint role of SAP project business lead and system analyst. Successfully managed the design, development and deployment of SAP solution to manage the Intel's capital project spend tracking and fixed asset accounting utilizing the PS module. SAP System Analyst Intel Corporation November 1995  –  November 1998  (3 years 1 month) Portland, Oregon Area SAP system analyst for supply chain management system implementation. Responsibilities included: requirements analysis, To-Be business process design, SAP configuration, testing, data conversion, and implementation support. Primary focus was product costing, inventory management, and interplant transfers, but received SAP module training and experience in areas of FICO, IM, WM, SOP, MS, and SD. Finance Manager Intel Corporation September 1994  –  November 1995  (1 year 3 months) Portland, Oregon Area Finance manager responsible for budgets, planning, and capital for the Oregon division Intel’s Architecture Lab. Revenue Analyst Intel Corporation July 1993  –  August 1994  (1 year 2 months) Portland, Oregon Area Revenue analyst responsible for reseller distribution revenue reserves, worldwide consolidation and analysis of net billings and channel analyses for revenue improvement programs. Budget Analyst Intel Corporation September 1991  –  June 1993  (1 year 10 months) San Francisco Bay Area B&P/capital analyst and consolidator. Owned financial planning & budgeting processes. Marketing Specialist IBM August 1989  –  August 1991  (2 years 1 month) San Francisco Bay Area Commodity Broker Assistant Merrill Lynch November 1988  –  July 1989  (9 months) San Francisco Bay Area HR Business Applications Manager Mentor Graphics April 2011  – Present (4 years 5 months) Wilsonville, OR HR technical business application and HR solution project manager. Lead a senior team of Mentor employees and consultants to enable the Human Resources processes and systems. HR Business Applications Manager Mentor Graphics April 2011  – Present (4 years 5 months) Wilsonville, OR HR technical business application and HR solution project manager. Lead a senior team of Mentor employees and consultants to enable the Human Resources processes and systems. SAP Rollout Manager - Manufacturing Implementation Vestas Wind Systems August 2010  –  February 2011  (7 months) Portland, Oregon Area Rollout Manager for Vestas SAP Manufacturing implementation. Created rollout plan, strategy, schedule, and budget. Primary liaison between the program team and the impacted factories. SAP Rollout Manager - Manufacturing Implementation Vestas Wind Systems August 2010  –  February 2011  (7 months) Portland, Oregon Area Rollout Manager for Vestas SAP Manufacturing implementation. Created rollout plan, strategy, schedule, and budget. Primary liaison between the program team and the impacted factories. Regional Manager SAP Competence Center Vestas Wind Systems July 2008  –  July 2010  (2 years 1 month) Portland, Oregon Area Manager of America’s regional SAP Competence Center. Oversee staff of 28 SAP analysts, consultants, developers, and trainers. Responsible for staffing the competence center from ground up. Responsibilities included; recruiting, budgeting, resource planning, staff development, communication with Sr executives. Regional Manager SAP Competence Center Vestas Wind Systems July 2008  –  July 2010  (2 years 1 month) Portland, Oregon Area Manager of America’s regional SAP Competence Center. Oversee staff of 28 SAP analysts, consultants, developers, and trainers. Responsible for staffing the competence center from ground up. Responsibilities included; recruiting, budgeting, resource planning, staff development, communication with Sr executives. SAP Project Manager Vestas Wind Systems March 2007  –  June 2008  (1 year 4 months) Portland, Oregon Area Project manager responsible for deployment of Vestas global SAP template to North American business organization. Technical solution scope included SD, CRM, PS, MM, WM, PM, MI, FICO, and HR modules. SAP Project Manager Vestas Wind Systems March 2007  –  June 2008  (1 year 4 months) Portland, Oregon Area Project manager responsible for deployment of Vestas global SAP template to North American business organization. Technical solution scope included SD, CRM, PS, MM, WM, PM, MI, FICO, and HR modules. Senior IT Project Manager Intel January 2006  –  October 2006  (10 months) Portland, Oregon Area Project manager responsible for deployment of a Master Production Scheduling Application for Intel’s chipset products. Senior IT Project Manager Intel January 2006  –  October 2006  (10 months) Portland, Oregon Area Project manager responsible for deployment of a Master Production Scheduling Application for Intel’s chipset products. Senior IT Project Manager Intel Corporation May 2003  –  December 2005  (2 years 8 months) Portland, Oregon Area Project deployment manager the SAP Multi-factory Optimization project based on SAP APO module - to optimize Intel's Flash Memory products planning processes and technology. Senior IT Project Manager Intel Corporation May 2003  –  December 2005  (2 years 8 months) Portland, Oregon Area Project deployment manager the SAP Multi-factory Optimization project based on SAP APO module - to optimize Intel's Flash Memory products planning processes and technology. IT Project Manager Intel Corporation February 2002  –  May 2003  (1 year 4 months) Portland, Oregon Area IT M&A Integration manager responsible for converting 3+ acquired companies’ data into Intel’s SAP and peripheral systems and deploying the Intel processes to the end users. IT Project Manager Intel Corporation February 2002  –  May 2003  (1 year 4 months) Portland, Oregon Area IT M&A Integration manager responsible for converting 3+ acquired companies’ data into Intel’s SAP and peripheral systems and deploying the Intel processes to the end users. IT Project Manager Intel Corporation July 2000  –  January 2002  (1 year 7 months) Portland, Oregon Area Project manager responsible for the full project lifecycle to enable and deploy SAP service and Software order management functionality to 3 acquired companies and 2 new internal businesses. IT Project Manager Intel Corporation July 2000  –  January 2002  (1 year 7 months) Portland, Oregon Area Project manager responsible for the full project lifecycle to enable and deploy SAP service and Software order management functionality to 3 acquired companies and 2 new internal businesses. IT Manager Intel Corporation January 2000  –  June 2000  (6 months) Portland, Oregon Area Responsible for management of 5 SAP analysts and support staff who were responsible for developing and maintaining the SAP FICO modules (General Ledger, Controlling modules). IT Manager Intel Corporation January 2000  –  June 2000  (6 months) Portland, Oregon Area Responsible for management of 5 SAP analysts and support staff who were responsible for developing and maintaining the SAP FICO modules (General Ledger, Controlling modules). IT Project Lead & Analyst Intel Corporation December 1998  –  December 1999  (1 year 1 month) Portland, Oregon Area Joint role of SAP project business lead and system analyst. Successfully managed the design, development and deployment of SAP solution to manage the Intel's capital project spend tracking and fixed asset accounting utilizing the PS module. IT Project Lead & Analyst Intel Corporation December 1998  –  December 1999  (1 year 1 month) Portland, Oregon Area Joint role of SAP project business lead and system analyst. Successfully managed the design, development and deployment of SAP solution to manage the Intel's capital project spend tracking and fixed asset accounting utilizing the PS module. SAP System Analyst Intel Corporation November 1995  –  November 1998  (3 years 1 month) Portland, Oregon Area SAP system analyst for supply chain management system implementation. Responsibilities included: requirements analysis, To-Be business process design, SAP configuration, testing, data conversion, and implementation support. Primary focus was product costing, inventory management, and interplant transfers, but received SAP module training and experience in areas of FICO, IM, WM, SOP, MS, and SD. SAP System Analyst Intel Corporation November 1995  –  November 1998  (3 years 1 month) Portland, Oregon Area SAP system analyst for supply chain management system implementation. Responsibilities included: requirements analysis, To-Be business process design, SAP configuration, testing, data conversion, and implementation support. Primary focus was product costing, inventory management, and interplant transfers, but received SAP module training and experience in areas of FICO, IM, WM, SOP, MS, and SD. Finance Manager Intel Corporation September 1994  –  November 1995  (1 year 3 months) Portland, Oregon Area Finance manager responsible for budgets, planning, and capital for the Oregon division Intel’s Architecture Lab. Finance Manager Intel Corporation September 1994  –  November 1995  (1 year 3 months) Portland, Oregon Area Finance manager responsible for budgets, planning, and capital for the Oregon division Intel’s Architecture Lab. Revenue Analyst Intel Corporation July 1993  –  August 1994  (1 year 2 months) Portland, Oregon Area Revenue analyst responsible for reseller distribution revenue reserves, worldwide consolidation and analysis of net billings and channel analyses for revenue improvement programs. Revenue Analyst Intel Corporation July 1993  –  August 1994  (1 year 2 months) Portland, Oregon Area Revenue analyst responsible for reseller distribution revenue reserves, worldwide consolidation and analysis of net billings and channel analyses for revenue improvement programs. Budget Analyst Intel Corporation September 1991  –  June 1993  (1 year 10 months) San Francisco Bay Area B&P/capital analyst and consolidator. Owned financial planning & budgeting processes. Budget Analyst Intel Corporation September 1991  –  June 1993  (1 year 10 months) San Francisco Bay Area B&P/capital analyst and consolidator. Owned financial planning & budgeting processes. Marketing Specialist IBM August 1989  –  August 1991  (2 years 1 month) San Francisco Bay Area Marketing Specialist IBM August 1989  –  August 1991  (2 years 1 month) San Francisco Bay Area Commodity Broker Assistant Merrill Lynch November 1988  –  July 1989  (9 months) San Francisco Bay Area Commodity Broker Assistant Merrill Lynch November 1988  –  July 1989  (9 months) San Francisco Bay Area Skills SAP SAP R/3 ERP Program Management Project Management Business Process... Supply Chain Management Materials Management Software Project... Requirements Analysis Team Leadership IT Strategy SAP HR MS Project IT Management MRP Budgets SAP ERP Business Process Strategy Management Business Analysis Human Resources Cross-functional Team... Process Improvement Business Intelligence Change Management SAP Implementation Integration Vendor Management Outsourcing See 16+     See less Skills  SAP SAP R/3 ERP Program Management Project Management Business Process... Supply Chain Management Materials Management Software Project... Requirements Analysis Team Leadership IT Strategy SAP HR MS Project IT Management MRP Budgets SAP ERP Business Process Strategy Management Business Analysis Human Resources Cross-functional Team... Process Improvement Business Intelligence Change Management SAP Implementation Integration Vendor Management Outsourcing See 16+     See less SAP SAP R/3 ERP Program Management Project Management Business Process... Supply Chain Management Materials Management Software Project... Requirements Analysis Team Leadership IT Strategy SAP HR MS Project IT Management MRP Budgets SAP ERP Business Process Strategy Management Business Analysis Human Resources Cross-functional Team... Process Improvement Business Intelligence Change Management SAP Implementation Integration Vendor Management Outsourcing See 16+     See less SAP SAP R/3 ERP Program Management Project Management Business Process... Supply Chain Management Materials Management Software Project... Requirements Analysis Team Leadership IT Strategy SAP HR MS Project IT Management MRP Budgets SAP ERP Business Process Strategy Management Business Analysis Human Resources Cross-functional Team... Process Improvement Business Intelligence Change Management SAP Implementation Integration Vendor Management Outsourcing See 16+     See less Education Santa Clara University MBA,  Finance 1988  – 1991 MBA in Finance Activities and Societies:  Securities portfolio research assistant ,  Commodities Hedging Strategy research assitant Montana State University-Bozeman BS,  Ag Business/Ag Education 1982  – 1987 Activities and Societies:  Pi Kappa Alpha Santa Clara University MBA,  Finance 1988  – 1991 MBA in Finance Activities and Societies:  Securities portfolio research assistant ,  Commodities Hedging Strategy research assitant Santa Clara University MBA,  Finance 1988  – 1991 MBA in Finance Activities and Societies:  Securities portfolio research assistant ,  Commodities Hedging Strategy research assitant Santa Clara University MBA,  Finance 1988  – 1991 MBA in Finance Activities and Societies:  Securities portfolio research assistant ,  Commodities Hedging Strategy research assitant Montana State University-Bozeman BS,  Ag Business/Ag Education 1982  – 1987 Activities and Societies:  Pi Kappa Alpha Montana State University-Bozeman BS,  Ag Business/Ag Education 1982  – 1987 Activities and Societies:  Pi Kappa Alpha Montana State University-Bozeman BS,  Ag Business/Ag Education 1982  – 1987 Activities and Societies:  Pi Kappa Alpha ", "Experience IT Project Manager Intel Corporation November 2011  – Present (3 years 10 months) Project Manager Infineon Technologies December 2002  –  November 2011  (9 years) Information Systems Manager IBM September 2001  –  December 2002  (1 year 4 months) IT Project Manager Intel Corporation November 2011  – Present (3 years 10 months) IT Project Manager Intel Corporation November 2011  – Present (3 years 10 months) Project Manager Infineon Technologies December 2002  –  November 2011  (9 years) Project Manager Infineon Technologies December 2002  –  November 2011  (9 years) Information Systems Manager IBM September 2001  –  December 2002  (1 year 4 months) Information Systems Manager IBM September 2001  –  December 2002  (1 year 4 months) Skills Software Development Software Project... Unix Debugging Agile Methodologies Integration C Software Design PMP Testing Project Management Semiconductors Quality Assurance Requirements Analysis Agile Project Management Scrum Product Management Cross-functional Team... MS Project Program Management See 5+     See less Skills  Software Development Software Project... Unix Debugging Agile Methodologies Integration C Software Design PMP Testing Project Management Semiconductors Quality Assurance Requirements Analysis Agile Project Management Scrum Product Management Cross-functional Team... MS Project Program Management See 5+     See less Software Development Software Project... Unix Debugging Agile Methodologies Integration C Software Design PMP Testing Project Management Semiconductors Quality Assurance Requirements Analysis Agile Project Management Scrum Product Management Cross-functional Team... MS Project Program Management See 5+     See less Software Development Software Project... Unix Debugging Agile Methodologies Integration C Software Design PMP Testing Project Management Semiconductors Quality Assurance Requirements Analysis Agile Project Management Scrum Product Management Cross-functional Team... MS Project Program Management See 5+     See less Education Purdue University Bachelor of Applied Science (B.A.Sc.),  Computer Science Purdue University Associate of Arts (A.A.),  Psychology Purdue University Bachelor of Applied Science (B.A.Sc.),  Computer Science Purdue University Bachelor of Applied Science (B.A.Sc.),  Computer Science Purdue University Bachelor of Applied Science (B.A.Sc.),  Computer Science Purdue University Associate of Arts (A.A.),  Psychology Purdue University Associate of Arts (A.A.),  Psychology Purdue University Associate of Arts (A.A.),  Psychology ", "Summary Senior technical leader with 13 years of experience in a variety of Sales and Marketing IT roles with a stellar track record of delivering IT solutions and strategy,  \n•\tFocus on SaaS, Analytics, and Enterprise Integrations.  \n•\tProven ability to leverage business acumen, soft-skills, and strong technical skils to bring together a broad set of stakeholders to align on a mutual goal. \n•\tInnate ability to accept unfamiliar challenges, ramp up quickly, and become the domain expert and ‘go-to’ resource for customers. \n•\tExtensive experience in developing long-term road maps aligned to IT strategies and business needs. \n•\tRoutinely seen as trusted adviser by executive level business partners \n \nI can help with: \nMarketing Automation, eCommerce, Analytics, Application Design and Architecture, Management, Project Management, Program Management, Management, Sales and Marketing IT, Systems, Engineering, SaaS, PaaS, IaaS, Engineering Management, business applications Summary Senior technical leader with 13 years of experience in a variety of Sales and Marketing IT roles with a stellar track record of delivering IT solutions and strategy,  \n•\tFocus on SaaS, Analytics, and Enterprise Integrations.  \n•\tProven ability to leverage business acumen, soft-skills, and strong technical skils to bring together a broad set of stakeholders to align on a mutual goal. \n•\tInnate ability to accept unfamiliar challenges, ramp up quickly, and become the domain expert and ‘go-to’ resource for customers. \n•\tExtensive experience in developing long-term road maps aligned to IT strategies and business needs. \n•\tRoutinely seen as trusted adviser by executive level business partners \n \nI can help with: \nMarketing Automation, eCommerce, Analytics, Application Design and Architecture, Management, Project Management, Program Management, Management, Sales and Marketing IT, Systems, Engineering, SaaS, PaaS, IaaS, Engineering Management, business applications Senior technical leader with 13 years of experience in a variety of Sales and Marketing IT roles with a stellar track record of delivering IT solutions and strategy,  \n•\tFocus on SaaS, Analytics, and Enterprise Integrations.  \n•\tProven ability to leverage business acumen, soft-skills, and strong technical skils to bring together a broad set of stakeholders to align on a mutual goal. \n•\tInnate ability to accept unfamiliar challenges, ramp up quickly, and become the domain expert and ‘go-to’ resource for customers. \n•\tExtensive experience in developing long-term road maps aligned to IT strategies and business needs. \n•\tRoutinely seen as trusted adviser by executive level business partners \n \nI can help with: \nMarketing Automation, eCommerce, Analytics, Application Design and Architecture, Management, Project Management, Program Management, Management, Sales and Marketing IT, Systems, Engineering, SaaS, PaaS, IaaS, Engineering Management, business applications Senior technical leader with 13 years of experience in a variety of Sales and Marketing IT roles with a stellar track record of delivering IT solutions and strategy,  \n•\tFocus on SaaS, Analytics, and Enterprise Integrations.  \n•\tProven ability to leverage business acumen, soft-skills, and strong technical skils to bring together a broad set of stakeholders to align on a mutual goal. \n•\tInnate ability to accept unfamiliar challenges, ramp up quickly, and become the domain expert and ‘go-to’ resource for customers. \n•\tExtensive experience in developing long-term road maps aligned to IT strategies and business needs. \n•\tRoutinely seen as trusted adviser by executive level business partners \n \nI can help with: \nMarketing Automation, eCommerce, Analytics, Application Design and Architecture, Management, Project Management, Program Management, Management, Sales and Marketing IT, Systems, Engineering, SaaS, PaaS, IaaS, Engineering Management, business applications Experience Sales and Marketing IT Manager Intel Corporation April 2010  – Present (5 years 5 months) Portland, Oregon Area IT Project Manager Intel Corporation May 2005  –  October 2010  (5 years 6 months) IT Program Manager Intel Corporation May 2003  –  March 2005  (1 year 11 months) Web Applications Developer Intel April 2000  –  May 2003  (3 years 2 months) Sales and Marketing IT Manager Intel Corporation April 2010  – Present (5 years 5 months) Portland, Oregon Area Sales and Marketing IT Manager Intel Corporation April 2010  – Present (5 years 5 months) Portland, Oregon Area IT Project Manager Intel Corporation May 2005  –  October 2010  (5 years 6 months) IT Project Manager Intel Corporation May 2005  –  October 2010  (5 years 6 months) IT Program Manager Intel Corporation May 2003  –  March 2005  (1 year 11 months) IT Program Manager Intel Corporation May 2003  –  March 2005  (1 year 11 months) Web Applications Developer Intel April 2000  –  May 2003  (3 years 2 months) Web Applications Developer Intel April 2000  –  May 2003  (3 years 2 months) Languages Hindi Native or bilingual proficiency English Native or bilingual proficiency Kannada Native or bilingual proficiency Konkani Professional working proficiency Hindi Native or bilingual proficiency English Native or bilingual proficiency Kannada Native or bilingual proficiency Konkani Professional working proficiency Hindi Native or bilingual proficiency English Native or bilingual proficiency Kannada Native or bilingual proficiency Konkani Professional working proficiency Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Professional working proficiency Skills E-commerce Web Applications N-tier Software Project... Software Development Agile Methodologies SDLC Program Management Technical Leadership Solution Architecture Software Design Product Management Agile Project Management Scrum Testing Web Analytics Databases Vendor Management Integration Software Quality... Requirements Analysis SQL Project Management Strategy Analytics Digital Marketing Management Enterprise Software Cross-functional Team... SaaS Leadership See 16+     See less Skills  E-commerce Web Applications N-tier Software Project... Software Development Agile Methodologies SDLC Program Management Technical Leadership Solution Architecture Software Design Product Management Agile Project Management Scrum Testing Web Analytics Databases Vendor Management Integration Software Quality... Requirements Analysis SQL Project Management Strategy Analytics Digital Marketing Management Enterprise Software Cross-functional Team... SaaS Leadership See 16+     See less E-commerce Web Applications N-tier Software Project... Software Development Agile Methodologies SDLC Program Management Technical Leadership Solution Architecture Software Design Product Management Agile Project Management Scrum Testing Web Analytics Databases Vendor Management Integration Software Quality... Requirements Analysis SQL Project Management Strategy Analytics Digital Marketing Management Enterprise Software Cross-functional Team... SaaS Leadership See 16+     See less E-commerce Web Applications N-tier Software Project... Software Development Agile Methodologies SDLC Program Management Technical Leadership Solution Architecture Software Design Product Management Agile Project Management Scrum Testing Web Analytics Databases Vendor Management Integration Software Quality... Requirements Analysis SQL Project Management Strategy Analytics Digital Marketing Management Enterprise Software Cross-functional Team... SaaS Leadership See 16+     See less Education Oregon State University Masters 1997  – 1999 University of Mumbai Bachelors 1991  – 1995 Oregon State University Masters 1997  – 1999 Oregon State University Masters 1997  – 1999 Oregon State University Masters 1997  – 1999 University of Mumbai Bachelors 1991  – 1995 University of Mumbai Bachelors 1991  – 1995 University of Mumbai Bachelors 1991  – 1995 ", "Summary Award winning Program and IT Manager specializing in infrastructure (physical – Windows on x86, and virtual – VMWare), distributed systems (Open Stack, Redhat), IT engineering (manageability, security) and service / help desk capabilities. It is a constant emphasis to solve business problems by working across organizations to drive efficient technical solutions and help the work force be as productive as possible. Experience in large to very large global organizations enabling people to do their best using 30 years of infrastructure and systems management, cross org business and financial acumen, and organizing work through proper business process and project management.  \n \nWhile the label portraits the WHAT, it does not represent the WHY. Confucius said, “Choose a job you love, and you will never have to work a day in your life”. The WHY is the basic need to be a part of an exceptional organization; and the rich ability to make it even healthier.  \n \nKey Skills and Knowledge \n•\tAward-Winning Results and Business Value Delivery \n•\tManagement: infrastructure and security engineering and development \n•\tStrong Business Acumen: synthesize business strategies and align to technical activities \n•\tFinancial Management strategic planning and alignment to budgetary constraints (MBA) \n•\tTechnical Marketing: collateral development and presentation focusing on business value \n•\tTeam Leadership: cross functional, multi geographic team development \n•\tTechnical Platforms: OpenStack cloud, traditional datacenters, and business platforms \n•\tProject: Agile and Project Management methodologies (PMP and Scrum Master Certified) \n•\tProcess improvement: ITIL processes in alignment to IT standard practices \n•\tMicrosoft Office proficiency (Outlook, Excel, Visio, Word, Powerpoint) \n•\tCommunity Service: passionate civic nature validated through community volunteerism \nEducation \n•\tMBA – Arizona State University \n•\tBS in Mgmt. – Baker University \n•\tPMP and Scrum Master Certified \n•\tITIL V2 Foundations Certified Summary Award winning Program and IT Manager specializing in infrastructure (physical – Windows on x86, and virtual – VMWare), distributed systems (Open Stack, Redhat), IT engineering (manageability, security) and service / help desk capabilities. It is a constant emphasis to solve business problems by working across organizations to drive efficient technical solutions and help the work force be as productive as possible. Experience in large to very large global organizations enabling people to do their best using 30 years of infrastructure and systems management, cross org business and financial acumen, and organizing work through proper business process and project management.  \n \nWhile the label portraits the WHAT, it does not represent the WHY. Confucius said, “Choose a job you love, and you will never have to work a day in your life”. The WHY is the basic need to be a part of an exceptional organization; and the rich ability to make it even healthier.  \n \nKey Skills and Knowledge \n•\tAward-Winning Results and Business Value Delivery \n•\tManagement: infrastructure and security engineering and development \n•\tStrong Business Acumen: synthesize business strategies and align to technical activities \n•\tFinancial Management strategic planning and alignment to budgetary constraints (MBA) \n•\tTechnical Marketing: collateral development and presentation focusing on business value \n•\tTeam Leadership: cross functional, multi geographic team development \n•\tTechnical Platforms: OpenStack cloud, traditional datacenters, and business platforms \n•\tProject: Agile and Project Management methodologies (PMP and Scrum Master Certified) \n•\tProcess improvement: ITIL processes in alignment to IT standard practices \n•\tMicrosoft Office proficiency (Outlook, Excel, Visio, Word, Powerpoint) \n•\tCommunity Service: passionate civic nature validated through community volunteerism \nEducation \n•\tMBA – Arizona State University \n•\tBS in Mgmt. – Baker University \n•\tPMP and Scrum Master Certified \n•\tITIL V2 Foundations Certified Award winning Program and IT Manager specializing in infrastructure (physical – Windows on x86, and virtual – VMWare), distributed systems (Open Stack, Redhat), IT engineering (manageability, security) and service / help desk capabilities. It is a constant emphasis to solve business problems by working across organizations to drive efficient technical solutions and help the work force be as productive as possible. Experience in large to very large global organizations enabling people to do their best using 30 years of infrastructure and systems management, cross org business and financial acumen, and organizing work through proper business process and project management.  \n \nWhile the label portraits the WHAT, it does not represent the WHY. Confucius said, “Choose a job you love, and you will never have to work a day in your life”. The WHY is the basic need to be a part of an exceptional organization; and the rich ability to make it even healthier.  \n \nKey Skills and Knowledge \n•\tAward-Winning Results and Business Value Delivery \n•\tManagement: infrastructure and security engineering and development \n•\tStrong Business Acumen: synthesize business strategies and align to technical activities \n•\tFinancial Management strategic planning and alignment to budgetary constraints (MBA) \n•\tTechnical Marketing: collateral development and presentation focusing on business value \n•\tTeam Leadership: cross functional, multi geographic team development \n•\tTechnical Platforms: OpenStack cloud, traditional datacenters, and business platforms \n•\tProject: Agile and Project Management methodologies (PMP and Scrum Master Certified) \n•\tProcess improvement: ITIL processes in alignment to IT standard practices \n•\tMicrosoft Office proficiency (Outlook, Excel, Visio, Word, Powerpoint) \n•\tCommunity Service: passionate civic nature validated through community volunteerism \nEducation \n•\tMBA – Arizona State University \n•\tBS in Mgmt. – Baker University \n•\tPMP and Scrum Master Certified \n•\tITIL V2 Foundations Certified Award winning Program and IT Manager specializing in infrastructure (physical – Windows on x86, and virtual – VMWare), distributed systems (Open Stack, Redhat), IT engineering (manageability, security) and service / help desk capabilities. It is a constant emphasis to solve business problems by working across organizations to drive efficient technical solutions and help the work force be as productive as possible. Experience in large to very large global organizations enabling people to do their best using 30 years of infrastructure and systems management, cross org business and financial acumen, and organizing work through proper business process and project management.  \n \nWhile the label portraits the WHAT, it does not represent the WHY. Confucius said, “Choose a job you love, and you will never have to work a day in your life”. The WHY is the basic need to be a part of an exceptional organization; and the rich ability to make it even healthier.  \n \nKey Skills and Knowledge \n•\tAward-Winning Results and Business Value Delivery \n•\tManagement: infrastructure and security engineering and development \n•\tStrong Business Acumen: synthesize business strategies and align to technical activities \n•\tFinancial Management strategic planning and alignment to budgetary constraints (MBA) \n•\tTechnical Marketing: collateral development and presentation focusing on business value \n•\tTeam Leadership: cross functional, multi geographic team development \n•\tTechnical Platforms: OpenStack cloud, traditional datacenters, and business platforms \n•\tProject: Agile and Project Management methodologies (PMP and Scrum Master Certified) \n•\tProcess improvement: ITIL processes in alignment to IT standard practices \n•\tMicrosoft Office proficiency (Outlook, Excel, Visio, Word, Powerpoint) \n•\tCommunity Service: passionate civic nature validated through community volunteerism \nEducation \n•\tMBA – Arizona State University \n•\tBS in Mgmt. – Baker University \n•\tPMP and Scrum Master Certified \n•\tITIL V2 Foundations Certified Experience IT Operations Manager SGS Automotive July 2015  – Present (2 months) Rancho Cordova, CA SGS is the world's leading inspection, verification, testing and certification company \n \nResponsible for shepherding a team of network, systems and database administrators in the pursuit of keeping our sanity while making sure the train stays tuned and on the tracks. To use and continually build a toolbox which helps ensure our success.  \n \nResponsible for building strong relationships with our customers, understanding their ongoing needs and help infuse those needs into products and service by proactively reducing the risk of excursions and identifying opportunities to increase efficiencies and costs in the system. Team Member Folsom Fire Dept Community Emergency Response Team May 2011  – Present (4 years 4 months) Folsom, CA The mission for the Folsom C.E.R.T volunteer program is to respond when disaster strikes overwhelming local Fire and Police resources such as Floods, Earthquakes, Wild Fires, Multi Casualty Incidents and Homeland Security Response involving acts of Terrorism. Business Analyst / Project Manager American Pacific Mortgage August 2014  –  January 2015  (6 months) 3000 Lava Ridge Court Roseville CA Part of Project Management is to take determined, meaningful steps in accomplishing the goals of the organization. The best use a methodical approach to run the organization and APM took the extraordinary steps to become more disciplined in their approach to meeting the goals of the organization.I was lucky enough to have been a part of it. They pride themselves on ever increasing the efficiency of the organizations and IT played a big role in the endeavor. As new and updated applications were evolving I drove implementation through the industry standard project methodology including requirements gathering, scheduling and implementing to the strategy. In one instance, a department within the company needed to eliminate errors and increase productivity in an area they were performing manual data manipulation. I gathered data and process requirements and drove the effort between the application vendor, internal stakeholders and IT resources to automate the process of manually moving data from one application to another, saving nearly 4 hours of labor per day and eliminating data entry errors. IT Program Manager Intel Corporation March 2012  –  June 2014  (2 years 4 months) Folsom CA While there are a tremendous amount of “I”s in the following paragraphs, rest assured there were many mentors which helped guide me along the way. In turn, I tried to impart a little humor as well as the organizational skills I learnt onto the teams I managed. These teams were the true reason for my success; I was but the conductor.  \n \n- My key responsibilities were for team management and life cycle of projects and capabilities in alignment with strategic solutions. While I have experience in Open Source OS such as Unix and Linux, I needed to form a technical view of Intel’s Cloud Computing Platform, Open Stack, and in turn an easy to digest visual aid for the project team to understand how their piece fits into the bigger puzzle.  \n- I also added to my Project Management toolbox by taking Agile and tool training and becoming certified as a Scrum Master for the Manageability and Monitoring Tools team. I collaborated with others to develop a Configuration Management architectural strategy in alignment with Intel’s Open Source Cloud and Service Management conducting an industry scan, cost of change analysis and prioritized requirements across domains. I also completed a security review for the tools within the scope of the team and found the tools like Nagios, Ceilometer, Heat and Puppet were themselves secured by SSL however the communications between the tools were not. Even code storage on GitHub was analyzed. This led to an even larger analysis within the entire program that found similar gaps. \n- I increased the levels of Quality in the support for Java product management at a time where there were multiple Security Excursions and disjointed efforts in the programing community. I took the role and represented the team by managing the deliverables within the Excursions and general testing roadmap of the Java family of products. I also chartered a dialogue with software developers for the promotion of Java application programming standards. IT Program Manager / Operations Manager Intel Corporation March 2010  –  March 2012  (2 years 1 month) Folsom, CA - I completed a 3-year tour as a key player in the development Intel's Active Management Technology, winning multiple awards. I prep'ed for migrating to the next generation of Infrastructure while transitioning the Program. I also developed the Services Catalog and worked to define Manageability related objects within the Infrastructure Support Framework.  \n- I also was the Security Enterprise Rights Management project manager preparing for the implementation of externally facing ERM capabilities in accordance with Intel PLC. \n- I transitioned to Operations Manager, where the key was to interact with partner IT teams to track issues and drive efficient handoffs of tasks between the groups. I managed the agenda and collateral associated with status update meetings. In doing so, I had the opportunity to increase my expertise in the enterprise. \n- Additionally, I coordinated a variety of reports and processes to streamline the operations of the organization. I also developed tools using Excel and SQL for spending tracking, managed department level goals and progress tracking, and initiated a resource tracking plan. This included a plan to clean up our escalation queue data (Service Now migration) and implemented monthly reviews of performance to Service Level Agreements (SLA). \n- I completed a 6-month rotation as a First Line Manager in Security Engineering and completed all 2012 Finance Plan. I was instrumental in implementing a major tool license agreement that had languished for 1+ years; completed general team management though MBO, performance management and development. \n- I initiated a rotation as Operations Manager for a 270-person software team. I oversaw headcount allocations, financial and performance to Plan of Record (POR). I volunteering and implementing a Leadership Development program, scheduled 360 reviews for 50 managers and hosted brown bags on analyzing and acting on the feedback. IT Program Manager Intel Corporation March 2008  –  March 2010  (2 years 1 month) Folsom, CA - While I continued my Program Management work to improve and implement iAMT, I also became the Program Manager responsible for the life cycle management of Provisioning and Compliance product capabilities and responsibilities included development of roadmap and execution of tactical and strategic solutions for business partner engagements. This included migrating physical Windows servers to the VMWare virtual environment through data created for physical servers, its role, prioritization tracking for waivers to the policy. \n- I Also accepted a sabbatical coverage within Intel IT Operations. This included all aspects of ownership of the Configuration Management Database (CMDB), aligning objectives and roadmaps and managing monthly releases. \n- I also assumed the role of managing the internal Service Management team and drove cross-organization discussions with engineering and the architecture group to develop appropriate Security and Manageability Services to ensure proper alignment with the Infrastructure Services Framework. I drove the completion of tasks with the Service Management group for the Manageability and Security Services through the completion of the Service Definition and Taxonomy for the IT Services Catalog. It included the planning and completion of Incident, Problem and Major Incident within the tool associated with the effort. \n- I also wanted to role model my continual improvement proficiency by passing the Project Management Institute's Project Management Professional (PMP) certification and demonstrating adherence to industry standard management of projects by effectively running multiple projects at one time, completing them within the allotted throughput time and without budget excursions. These projects included the influence and management of resources across matrixed organizations where a continuous process was in place to communication to functional managers. IT Program Manager Intel Corporation March 2005  –  March 2008  (3 years 1 month) Folsom, CA - A key risk associated with Systems Management tools is they sit above the Operating System (OS). With my background in Manageability, I had participated in discussions with the hardware developers to create a Manageability Engine on a chip. This would be a key ingredient in the client platform and I became the Project Manager to implement this new capability internally within Intel called Intel Active Management Technology (iAMT). Sitting at the hardware level below the OS would allow the management of the device even if the OS were in a failed state and lowering the cost of support when failure occurred. \n- Since the technology did not exist, we had to use experimental equipment to complete even basic testing. What began as a simple POC became a Program where I managed teams through the analysis of the ecosystem and requirements gathering process and implementation of the Windows infrastructure. I developed a cross team effort to overcome key security issues and worked with Finance to develop a reusable model for estimating Net Present Value (NPV). These efforts culminated in the Intel IT Excellence Award, for the exemplary work across organizations and geographic regions. \n- I played a key role in developing better alignment of IT and Intel product designs during planning sessions. I also facilitated product change requests as well as worked directly with AMT chip designers. My team won numerous awards in recognizing their work for showing agility such as a project to put several hundred AMT enabled systems in Training Rooms. In helping raise the awareness of AMT within Intel, I presented to numerous groups and published articles on AMT providing in-depth expertise to external customers. This included collateral and Pod Casts and resulted in the Sales and Marketing identifying $1.2M in direct sales through my influence. This led to an Intel IT Achievement Award (IT’s highest honor). Global IT Project Manager Intel Corporation March 2003  –  March 2005  (2 years 1 month) Folsom, CA - While I have always had an inner desire for continuous learning, Intel the term “Raising the Bar” was embedded in their DNA. I had shown increased understanding of a large global organization and emerging technologies so I was put to the test as I began taking on Programs and Projects of increased scope and complexity that spanned both geographic and organizational exposure. Information Technology Infrastructure Library (ITIL) was making its way to the US from Europe and as an agent of change, I was instrumental in organizing materials and began educating the division on ITIL Foundations. To enhance the effectiveness of my influence through presentations I became an Intel Presentations Instructor. Because of my duties on the Asset Management team, I also began working to integrate Service Management methodologies into our group and drove the completion of a Data Dictionary for use within the Configuration Management Database (CMDB). I also participated in the selection process and testing of the Service Management tools, settling on the product Service Now. This continued growth was also instrumental in joining the IT@Intel, a group dedicated to helping other companies understand the complexities of the compute environments and I traveled and presented to the first of many organizations on ITIL and Asset and Configuration Management. This period was also when I would increase my influence by providing coverage as a First Line Manager. As such, I managed finances and developed technical resources to hit the bull’s eye on current assignments as well as to look up and determine where they want to go in their careers. System Engineer Intel Corporation July 2000  –  March 2003  (2 years 9 months) Folsom, CA - Intel was a company with over 100,000 compute devices at the time and it was imperative to have accurate data regarding those devices. Adding to the complexity is existing in over 120 countries. As such, a system was needed that could gather data regarding the as is state and have the ability to adjust the state to a known gold state. I owned the Microsoft Systems Management Server (SMS) infrastructure including roadmap and development. I managed the project and redesigned the environment to gain efficiencies in data collection by shrinking the site complexity and develop small site architecture to include costs of slow links into consideration. This also included integration into Microsoft’s Active Directory where I developed scripts to minimize the overhead of the SMS agents on the client systems. A system for Disaster Recovery and Business Continuity was developed and put to the test when both the NIMDA and Code Red viruses emerged into the environment. Custom patches to eradicate the viruses were designed and the system was used to implement corrective scripts into the environment. Because of the nature of that data, I become the technical adviser to the Asset Management team and one of the first data driven efforts to map compute lifecycle began. Systems Monitoring was also maturing during this time and I worked with the Service Desk to understand Events and pare down the Alerts to actionable tasks. Key to the efforts was the ability to reach across geographic distance through trips to Asia to educate the local support base as well as gain cooperative support for the activities. This also included reaching across technical boundaries by bringing the right resources together and work to accomplish the goals of the projects. Operations Management / Manageability Specialist Aventis May 1995  –  July 2000  (5 years 3 months) Kansas City, Missouri Area Large organizations must rely on automation and management tools for watching and correcting issues in the environment. Aventis was no different. I played two roles in the years I was there; Network / Data Center Operations Management and Systems Engineer for manageability products. When I was hired, the then Network Operations Center (NOC) Service Desk was an 8x5 operation. For properly supporting the plant activities, we needed to broaden our support so I moved it to a 24x7x365 operation. To gain further efficiencies we then merged the NOC with Data Center Operations where I managed 15 operators. Our scope included transactions and database management on an IBM Mainframe along with both IT infrastructure (Windows and Novell networks), storage and backup, Cisco network devices as well as very high-end printers for FDA documentation. The 15 operators consisted of both internal as well as contract labor and my role was to ensure proper resourcing, hiring (and firing) and Single Point of Contact for escalations.  \n \nI also took over the Systems Engineering role for the Microsoft Systems Management Server (SMS) where I managed a major upgrade that would allow us to develop patches for Y2K compliance. While Aventis was a multi-site environment, each site was autonomous. In supporting the new SMS infrastructure, I found it difficult to reference the other engineers as their SMS sites were configured differently. I subsequently started a program to migrate all systems to a managed configuration, allowing us to back up each other. As part of another merger, I designed and installed an SMS environment in the new headquarters with the ability to manage all sites from a single point. Engineering US Connect 1992  –  1995  (3 years) It is the goal of any organization to provide their service or product in the most efficient manner. Many Small to Medium Businesses are not of size to afford dedicated resources to handle some of the aspects of the running the organization. This is where companies such as US Connect come into play. They (US Connect) provided IT Training and Services to such organizations. To be the most successful, one must learn to understand not only the technical issues, but also how they influence the business. While I understood Client / Server and Windows x86 platforms, I had begun to use increasing communications skills to find the right people who can clearly explain the business challenge and influence the decision makers to get to the gist of the business challenge, and in turn help the technical resources with tactical task completion. IT Operations Manager SGS Automotive July 2015  – Present (2 months) Rancho Cordova, CA SGS is the world's leading inspection, verification, testing and certification company \n \nResponsible for shepherding a team of network, systems and database administrators in the pursuit of keeping our sanity while making sure the train stays tuned and on the tracks. To use and continually build a toolbox which helps ensure our success.  \n \nResponsible for building strong relationships with our customers, understanding their ongoing needs and help infuse those needs into products and service by proactively reducing the risk of excursions and identifying opportunities to increase efficiencies and costs in the system. IT Operations Manager SGS Automotive July 2015  – Present (2 months) Rancho Cordova, CA SGS is the world's leading inspection, verification, testing and certification company \n \nResponsible for shepherding a team of network, systems and database administrators in the pursuit of keeping our sanity while making sure the train stays tuned and on the tracks. To use and continually build a toolbox which helps ensure our success.  \n \nResponsible for building strong relationships with our customers, understanding their ongoing needs and help infuse those needs into products and service by proactively reducing the risk of excursions and identifying opportunities to increase efficiencies and costs in the system. Team Member Folsom Fire Dept Community Emergency Response Team May 2011  – Present (4 years 4 months) Folsom, CA The mission for the Folsom C.E.R.T volunteer program is to respond when disaster strikes overwhelming local Fire and Police resources such as Floods, Earthquakes, Wild Fires, Multi Casualty Incidents and Homeland Security Response involving acts of Terrorism. Team Member Folsom Fire Dept Community Emergency Response Team May 2011  – Present (4 years 4 months) Folsom, CA The mission for the Folsom C.E.R.T volunteer program is to respond when disaster strikes overwhelming local Fire and Police resources such as Floods, Earthquakes, Wild Fires, Multi Casualty Incidents and Homeland Security Response involving acts of Terrorism. Business Analyst / Project Manager American Pacific Mortgage August 2014  –  January 2015  (6 months) 3000 Lava Ridge Court Roseville CA Part of Project Management is to take determined, meaningful steps in accomplishing the goals of the organization. The best use a methodical approach to run the organization and APM took the extraordinary steps to become more disciplined in their approach to meeting the goals of the organization.I was lucky enough to have been a part of it. They pride themselves on ever increasing the efficiency of the organizations and IT played a big role in the endeavor. As new and updated applications were evolving I drove implementation through the industry standard project methodology including requirements gathering, scheduling and implementing to the strategy. In one instance, a department within the company needed to eliminate errors and increase productivity in an area they were performing manual data manipulation. I gathered data and process requirements and drove the effort between the application vendor, internal stakeholders and IT resources to automate the process of manually moving data from one application to another, saving nearly 4 hours of labor per day and eliminating data entry errors. Business Analyst / Project Manager American Pacific Mortgage August 2014  –  January 2015  (6 months) 3000 Lava Ridge Court Roseville CA Part of Project Management is to take determined, meaningful steps in accomplishing the goals of the organization. The best use a methodical approach to run the organization and APM took the extraordinary steps to become more disciplined in their approach to meeting the goals of the organization.I was lucky enough to have been a part of it. They pride themselves on ever increasing the efficiency of the organizations and IT played a big role in the endeavor. As new and updated applications were evolving I drove implementation through the industry standard project methodology including requirements gathering, scheduling and implementing to the strategy. In one instance, a department within the company needed to eliminate errors and increase productivity in an area they were performing manual data manipulation. I gathered data and process requirements and drove the effort between the application vendor, internal stakeholders and IT resources to automate the process of manually moving data from one application to another, saving nearly 4 hours of labor per day and eliminating data entry errors. IT Program Manager Intel Corporation March 2012  –  June 2014  (2 years 4 months) Folsom CA While there are a tremendous amount of “I”s in the following paragraphs, rest assured there were many mentors which helped guide me along the way. In turn, I tried to impart a little humor as well as the organizational skills I learnt onto the teams I managed. These teams were the true reason for my success; I was but the conductor.  \n \n- My key responsibilities were for team management and life cycle of projects and capabilities in alignment with strategic solutions. While I have experience in Open Source OS such as Unix and Linux, I needed to form a technical view of Intel’s Cloud Computing Platform, Open Stack, and in turn an easy to digest visual aid for the project team to understand how their piece fits into the bigger puzzle.  \n- I also added to my Project Management toolbox by taking Agile and tool training and becoming certified as a Scrum Master for the Manageability and Monitoring Tools team. I collaborated with others to develop a Configuration Management architectural strategy in alignment with Intel’s Open Source Cloud and Service Management conducting an industry scan, cost of change analysis and prioritized requirements across domains. I also completed a security review for the tools within the scope of the team and found the tools like Nagios, Ceilometer, Heat and Puppet were themselves secured by SSL however the communications between the tools were not. Even code storage on GitHub was analyzed. This led to an even larger analysis within the entire program that found similar gaps. \n- I increased the levels of Quality in the support for Java product management at a time where there were multiple Security Excursions and disjointed efforts in the programing community. I took the role and represented the team by managing the deliverables within the Excursions and general testing roadmap of the Java family of products. I also chartered a dialogue with software developers for the promotion of Java application programming standards. IT Program Manager Intel Corporation March 2012  –  June 2014  (2 years 4 months) Folsom CA While there are a tremendous amount of “I”s in the following paragraphs, rest assured there were many mentors which helped guide me along the way. In turn, I tried to impart a little humor as well as the organizational skills I learnt onto the teams I managed. These teams were the true reason for my success; I was but the conductor.  \n \n- My key responsibilities were for team management and life cycle of projects and capabilities in alignment with strategic solutions. While I have experience in Open Source OS such as Unix and Linux, I needed to form a technical view of Intel’s Cloud Computing Platform, Open Stack, and in turn an easy to digest visual aid for the project team to understand how their piece fits into the bigger puzzle.  \n- I also added to my Project Management toolbox by taking Agile and tool training and becoming certified as a Scrum Master for the Manageability and Monitoring Tools team. I collaborated with others to develop a Configuration Management architectural strategy in alignment with Intel’s Open Source Cloud and Service Management conducting an industry scan, cost of change analysis and prioritized requirements across domains. I also completed a security review for the tools within the scope of the team and found the tools like Nagios, Ceilometer, Heat and Puppet were themselves secured by SSL however the communications between the tools were not. Even code storage on GitHub was analyzed. This led to an even larger analysis within the entire program that found similar gaps. \n- I increased the levels of Quality in the support for Java product management at a time where there were multiple Security Excursions and disjointed efforts in the programing community. I took the role and represented the team by managing the deliverables within the Excursions and general testing roadmap of the Java family of products. I also chartered a dialogue with software developers for the promotion of Java application programming standards. IT Program Manager / Operations Manager Intel Corporation March 2010  –  March 2012  (2 years 1 month) Folsom, CA - I completed a 3-year tour as a key player in the development Intel's Active Management Technology, winning multiple awards. I prep'ed for migrating to the next generation of Infrastructure while transitioning the Program. I also developed the Services Catalog and worked to define Manageability related objects within the Infrastructure Support Framework.  \n- I also was the Security Enterprise Rights Management project manager preparing for the implementation of externally facing ERM capabilities in accordance with Intel PLC. \n- I transitioned to Operations Manager, where the key was to interact with partner IT teams to track issues and drive efficient handoffs of tasks between the groups. I managed the agenda and collateral associated with status update meetings. In doing so, I had the opportunity to increase my expertise in the enterprise. \n- Additionally, I coordinated a variety of reports and processes to streamline the operations of the organization. I also developed tools using Excel and SQL for spending tracking, managed department level goals and progress tracking, and initiated a resource tracking plan. This included a plan to clean up our escalation queue data (Service Now migration) and implemented monthly reviews of performance to Service Level Agreements (SLA). \n- I completed a 6-month rotation as a First Line Manager in Security Engineering and completed all 2012 Finance Plan. I was instrumental in implementing a major tool license agreement that had languished for 1+ years; completed general team management though MBO, performance management and development. \n- I initiated a rotation as Operations Manager for a 270-person software team. I oversaw headcount allocations, financial and performance to Plan of Record (POR). I volunteering and implementing a Leadership Development program, scheduled 360 reviews for 50 managers and hosted brown bags on analyzing and acting on the feedback. IT Program Manager / Operations Manager Intel Corporation March 2010  –  March 2012  (2 years 1 month) Folsom, CA - I completed a 3-year tour as a key player in the development Intel's Active Management Technology, winning multiple awards. I prep'ed for migrating to the next generation of Infrastructure while transitioning the Program. I also developed the Services Catalog and worked to define Manageability related objects within the Infrastructure Support Framework.  \n- I also was the Security Enterprise Rights Management project manager preparing for the implementation of externally facing ERM capabilities in accordance with Intel PLC. \n- I transitioned to Operations Manager, where the key was to interact with partner IT teams to track issues and drive efficient handoffs of tasks between the groups. I managed the agenda and collateral associated with status update meetings. In doing so, I had the opportunity to increase my expertise in the enterprise. \n- Additionally, I coordinated a variety of reports and processes to streamline the operations of the organization. I also developed tools using Excel and SQL for spending tracking, managed department level goals and progress tracking, and initiated a resource tracking plan. This included a plan to clean up our escalation queue data (Service Now migration) and implemented monthly reviews of performance to Service Level Agreements (SLA). \n- I completed a 6-month rotation as a First Line Manager in Security Engineering and completed all 2012 Finance Plan. I was instrumental in implementing a major tool license agreement that had languished for 1+ years; completed general team management though MBO, performance management and development. \n- I initiated a rotation as Operations Manager for a 270-person software team. I oversaw headcount allocations, financial and performance to Plan of Record (POR). I volunteering and implementing a Leadership Development program, scheduled 360 reviews for 50 managers and hosted brown bags on analyzing and acting on the feedback. IT Program Manager Intel Corporation March 2008  –  March 2010  (2 years 1 month) Folsom, CA - While I continued my Program Management work to improve and implement iAMT, I also became the Program Manager responsible for the life cycle management of Provisioning and Compliance product capabilities and responsibilities included development of roadmap and execution of tactical and strategic solutions for business partner engagements. This included migrating physical Windows servers to the VMWare virtual environment through data created for physical servers, its role, prioritization tracking for waivers to the policy. \n- I Also accepted a sabbatical coverage within Intel IT Operations. This included all aspects of ownership of the Configuration Management Database (CMDB), aligning objectives and roadmaps and managing monthly releases. \n- I also assumed the role of managing the internal Service Management team and drove cross-organization discussions with engineering and the architecture group to develop appropriate Security and Manageability Services to ensure proper alignment with the Infrastructure Services Framework. I drove the completion of tasks with the Service Management group for the Manageability and Security Services through the completion of the Service Definition and Taxonomy for the IT Services Catalog. It included the planning and completion of Incident, Problem and Major Incident within the tool associated with the effort. \n- I also wanted to role model my continual improvement proficiency by passing the Project Management Institute's Project Management Professional (PMP) certification and demonstrating adherence to industry standard management of projects by effectively running multiple projects at one time, completing them within the allotted throughput time and without budget excursions. These projects included the influence and management of resources across matrixed organizations where a continuous process was in place to communication to functional managers. IT Program Manager Intel Corporation March 2008  –  March 2010  (2 years 1 month) Folsom, CA - While I continued my Program Management work to improve and implement iAMT, I also became the Program Manager responsible for the life cycle management of Provisioning and Compliance product capabilities and responsibilities included development of roadmap and execution of tactical and strategic solutions for business partner engagements. This included migrating physical Windows servers to the VMWare virtual environment through data created for physical servers, its role, prioritization tracking for waivers to the policy. \n- I Also accepted a sabbatical coverage within Intel IT Operations. This included all aspects of ownership of the Configuration Management Database (CMDB), aligning objectives and roadmaps and managing monthly releases. \n- I also assumed the role of managing the internal Service Management team and drove cross-organization discussions with engineering and the architecture group to develop appropriate Security and Manageability Services to ensure proper alignment with the Infrastructure Services Framework. I drove the completion of tasks with the Service Management group for the Manageability and Security Services through the completion of the Service Definition and Taxonomy for the IT Services Catalog. It included the planning and completion of Incident, Problem and Major Incident within the tool associated with the effort. \n- I also wanted to role model my continual improvement proficiency by passing the Project Management Institute's Project Management Professional (PMP) certification and demonstrating adherence to industry standard management of projects by effectively running multiple projects at one time, completing them within the allotted throughput time and without budget excursions. These projects included the influence and management of resources across matrixed organizations where a continuous process was in place to communication to functional managers. IT Program Manager Intel Corporation March 2005  –  March 2008  (3 years 1 month) Folsom, CA - A key risk associated with Systems Management tools is they sit above the Operating System (OS). With my background in Manageability, I had participated in discussions with the hardware developers to create a Manageability Engine on a chip. This would be a key ingredient in the client platform and I became the Project Manager to implement this new capability internally within Intel called Intel Active Management Technology (iAMT). Sitting at the hardware level below the OS would allow the management of the device even if the OS were in a failed state and lowering the cost of support when failure occurred. \n- Since the technology did not exist, we had to use experimental equipment to complete even basic testing. What began as a simple POC became a Program where I managed teams through the analysis of the ecosystem and requirements gathering process and implementation of the Windows infrastructure. I developed a cross team effort to overcome key security issues and worked with Finance to develop a reusable model for estimating Net Present Value (NPV). These efforts culminated in the Intel IT Excellence Award, for the exemplary work across organizations and geographic regions. \n- I played a key role in developing better alignment of IT and Intel product designs during planning sessions. I also facilitated product change requests as well as worked directly with AMT chip designers. My team won numerous awards in recognizing their work for showing agility such as a project to put several hundred AMT enabled systems in Training Rooms. In helping raise the awareness of AMT within Intel, I presented to numerous groups and published articles on AMT providing in-depth expertise to external customers. This included collateral and Pod Casts and resulted in the Sales and Marketing identifying $1.2M in direct sales through my influence. This led to an Intel IT Achievement Award (IT’s highest honor). IT Program Manager Intel Corporation March 2005  –  March 2008  (3 years 1 month) Folsom, CA - A key risk associated with Systems Management tools is they sit above the Operating System (OS). With my background in Manageability, I had participated in discussions with the hardware developers to create a Manageability Engine on a chip. This would be a key ingredient in the client platform and I became the Project Manager to implement this new capability internally within Intel called Intel Active Management Technology (iAMT). Sitting at the hardware level below the OS would allow the management of the device even if the OS were in a failed state and lowering the cost of support when failure occurred. \n- Since the technology did not exist, we had to use experimental equipment to complete even basic testing. What began as a simple POC became a Program where I managed teams through the analysis of the ecosystem and requirements gathering process and implementation of the Windows infrastructure. I developed a cross team effort to overcome key security issues and worked with Finance to develop a reusable model for estimating Net Present Value (NPV). These efforts culminated in the Intel IT Excellence Award, for the exemplary work across organizations and geographic regions. \n- I played a key role in developing better alignment of IT and Intel product designs during planning sessions. I also facilitated product change requests as well as worked directly with AMT chip designers. My team won numerous awards in recognizing their work for showing agility such as a project to put several hundred AMT enabled systems in Training Rooms. In helping raise the awareness of AMT within Intel, I presented to numerous groups and published articles on AMT providing in-depth expertise to external customers. This included collateral and Pod Casts and resulted in the Sales and Marketing identifying $1.2M in direct sales through my influence. This led to an Intel IT Achievement Award (IT’s highest honor). Global IT Project Manager Intel Corporation March 2003  –  March 2005  (2 years 1 month) Folsom, CA - While I have always had an inner desire for continuous learning, Intel the term “Raising the Bar” was embedded in their DNA. I had shown increased understanding of a large global organization and emerging technologies so I was put to the test as I began taking on Programs and Projects of increased scope and complexity that spanned both geographic and organizational exposure. Information Technology Infrastructure Library (ITIL) was making its way to the US from Europe and as an agent of change, I was instrumental in organizing materials and began educating the division on ITIL Foundations. To enhance the effectiveness of my influence through presentations I became an Intel Presentations Instructor. Because of my duties on the Asset Management team, I also began working to integrate Service Management methodologies into our group and drove the completion of a Data Dictionary for use within the Configuration Management Database (CMDB). I also participated in the selection process and testing of the Service Management tools, settling on the product Service Now. This continued growth was also instrumental in joining the IT@Intel, a group dedicated to helping other companies understand the complexities of the compute environments and I traveled and presented to the first of many organizations on ITIL and Asset and Configuration Management. This period was also when I would increase my influence by providing coverage as a First Line Manager. As such, I managed finances and developed technical resources to hit the bull’s eye on current assignments as well as to look up and determine where they want to go in their careers. Global IT Project Manager Intel Corporation March 2003  –  March 2005  (2 years 1 month) Folsom, CA - While I have always had an inner desire for continuous learning, Intel the term “Raising the Bar” was embedded in their DNA. I had shown increased understanding of a large global organization and emerging technologies so I was put to the test as I began taking on Programs and Projects of increased scope and complexity that spanned both geographic and organizational exposure. Information Technology Infrastructure Library (ITIL) was making its way to the US from Europe and as an agent of change, I was instrumental in organizing materials and began educating the division on ITIL Foundations. To enhance the effectiveness of my influence through presentations I became an Intel Presentations Instructor. Because of my duties on the Asset Management team, I also began working to integrate Service Management methodologies into our group and drove the completion of a Data Dictionary for use within the Configuration Management Database (CMDB). I also participated in the selection process and testing of the Service Management tools, settling on the product Service Now. This continued growth was also instrumental in joining the IT@Intel, a group dedicated to helping other companies understand the complexities of the compute environments and I traveled and presented to the first of many organizations on ITIL and Asset and Configuration Management. This period was also when I would increase my influence by providing coverage as a First Line Manager. As such, I managed finances and developed technical resources to hit the bull’s eye on current assignments as well as to look up and determine where they want to go in their careers. System Engineer Intel Corporation July 2000  –  March 2003  (2 years 9 months) Folsom, CA - Intel was a company with over 100,000 compute devices at the time and it was imperative to have accurate data regarding those devices. Adding to the complexity is existing in over 120 countries. As such, a system was needed that could gather data regarding the as is state and have the ability to adjust the state to a known gold state. I owned the Microsoft Systems Management Server (SMS) infrastructure including roadmap and development. I managed the project and redesigned the environment to gain efficiencies in data collection by shrinking the site complexity and develop small site architecture to include costs of slow links into consideration. This also included integration into Microsoft’s Active Directory where I developed scripts to minimize the overhead of the SMS agents on the client systems. A system for Disaster Recovery and Business Continuity was developed and put to the test when both the NIMDA and Code Red viruses emerged into the environment. Custom patches to eradicate the viruses were designed and the system was used to implement corrective scripts into the environment. Because of the nature of that data, I become the technical adviser to the Asset Management team and one of the first data driven efforts to map compute lifecycle began. Systems Monitoring was also maturing during this time and I worked with the Service Desk to understand Events and pare down the Alerts to actionable tasks. Key to the efforts was the ability to reach across geographic distance through trips to Asia to educate the local support base as well as gain cooperative support for the activities. This also included reaching across technical boundaries by bringing the right resources together and work to accomplish the goals of the projects. System Engineer Intel Corporation July 2000  –  March 2003  (2 years 9 months) Folsom, CA - Intel was a company with over 100,000 compute devices at the time and it was imperative to have accurate data regarding those devices. Adding to the complexity is existing in over 120 countries. As such, a system was needed that could gather data regarding the as is state and have the ability to adjust the state to a known gold state. I owned the Microsoft Systems Management Server (SMS) infrastructure including roadmap and development. I managed the project and redesigned the environment to gain efficiencies in data collection by shrinking the site complexity and develop small site architecture to include costs of slow links into consideration. This also included integration into Microsoft’s Active Directory where I developed scripts to minimize the overhead of the SMS agents on the client systems. A system for Disaster Recovery and Business Continuity was developed and put to the test when both the NIMDA and Code Red viruses emerged into the environment. Custom patches to eradicate the viruses were designed and the system was used to implement corrective scripts into the environment. Because of the nature of that data, I become the technical adviser to the Asset Management team and one of the first data driven efforts to map compute lifecycle began. Systems Monitoring was also maturing during this time and I worked with the Service Desk to understand Events and pare down the Alerts to actionable tasks. Key to the efforts was the ability to reach across geographic distance through trips to Asia to educate the local support base as well as gain cooperative support for the activities. This also included reaching across technical boundaries by bringing the right resources together and work to accomplish the goals of the projects. Operations Management / Manageability Specialist Aventis May 1995  –  July 2000  (5 years 3 months) Kansas City, Missouri Area Large organizations must rely on automation and management tools for watching and correcting issues in the environment. Aventis was no different. I played two roles in the years I was there; Network / Data Center Operations Management and Systems Engineer for manageability products. When I was hired, the then Network Operations Center (NOC) Service Desk was an 8x5 operation. For properly supporting the plant activities, we needed to broaden our support so I moved it to a 24x7x365 operation. To gain further efficiencies we then merged the NOC with Data Center Operations where I managed 15 operators. Our scope included transactions and database management on an IBM Mainframe along with both IT infrastructure (Windows and Novell networks), storage and backup, Cisco network devices as well as very high-end printers for FDA documentation. The 15 operators consisted of both internal as well as contract labor and my role was to ensure proper resourcing, hiring (and firing) and Single Point of Contact for escalations.  \n \nI also took over the Systems Engineering role for the Microsoft Systems Management Server (SMS) where I managed a major upgrade that would allow us to develop patches for Y2K compliance. While Aventis was a multi-site environment, each site was autonomous. In supporting the new SMS infrastructure, I found it difficult to reference the other engineers as their SMS sites were configured differently. I subsequently started a program to migrate all systems to a managed configuration, allowing us to back up each other. As part of another merger, I designed and installed an SMS environment in the new headquarters with the ability to manage all sites from a single point. Operations Management / Manageability Specialist Aventis May 1995  –  July 2000  (5 years 3 months) Kansas City, Missouri Area Large organizations must rely on automation and management tools for watching and correcting issues in the environment. Aventis was no different. I played two roles in the years I was there; Network / Data Center Operations Management and Systems Engineer for manageability products. When I was hired, the then Network Operations Center (NOC) Service Desk was an 8x5 operation. For properly supporting the plant activities, we needed to broaden our support so I moved it to a 24x7x365 operation. To gain further efficiencies we then merged the NOC with Data Center Operations where I managed 15 operators. Our scope included transactions and database management on an IBM Mainframe along with both IT infrastructure (Windows and Novell networks), storage and backup, Cisco network devices as well as very high-end printers for FDA documentation. The 15 operators consisted of both internal as well as contract labor and my role was to ensure proper resourcing, hiring (and firing) and Single Point of Contact for escalations.  \n \nI also took over the Systems Engineering role for the Microsoft Systems Management Server (SMS) where I managed a major upgrade that would allow us to develop patches for Y2K compliance. While Aventis was a multi-site environment, each site was autonomous. In supporting the new SMS infrastructure, I found it difficult to reference the other engineers as their SMS sites were configured differently. I subsequently started a program to migrate all systems to a managed configuration, allowing us to back up each other. As part of another merger, I designed and installed an SMS environment in the new headquarters with the ability to manage all sites from a single point. Engineering US Connect 1992  –  1995  (3 years) It is the goal of any organization to provide their service or product in the most efficient manner. Many Small to Medium Businesses are not of size to afford dedicated resources to handle some of the aspects of the running the organization. This is where companies such as US Connect come into play. They (US Connect) provided IT Training and Services to such organizations. To be the most successful, one must learn to understand not only the technical issues, but also how they influence the business. While I understood Client / Server and Windows x86 platforms, I had begun to use increasing communications skills to find the right people who can clearly explain the business challenge and influence the decision makers to get to the gist of the business challenge, and in turn help the technical resources with tactical task completion. Engineering US Connect 1992  –  1995  (3 years) It is the goal of any organization to provide their service or product in the most efficient manner. Many Small to Medium Businesses are not of size to afford dedicated resources to handle some of the aspects of the running the organization. This is where companies such as US Connect come into play. They (US Connect) provided IT Training and Services to such organizations. To be the most successful, one must learn to understand not only the technical issues, but also how they influence the business. While I understood Client / Server and Windows x86 platforms, I had begun to use increasing communications skills to find the right people who can clearly explain the business challenge and influence the decision makers to get to the gist of the business challenge, and in turn help the technical resources with tactical task completion. Languages   Skills Business Process... Financial Analysis Business Analysis Manageability Program Management Project Planning Leadership PMP Cross-functional Team... Intel Scrum Cloud Computing IT Management Product Management Virtualization Operations Management IT Strategy Analysis Integration ITIL Vendor Management Agile Project Management Certified Project... Software Project... OpenStack Certified Scrum Master Open Source Development Project Management Process Improvement Management Enterprise Software Strategy Business Intelligence Data Center See 19+     See less Skills  Business Process... Financial Analysis Business Analysis Manageability Program Management Project Planning Leadership PMP Cross-functional Team... Intel Scrum Cloud Computing IT Management Product Management Virtualization Operations Management IT Strategy Analysis Integration ITIL Vendor Management Agile Project Management Certified Project... Software Project... OpenStack Certified Scrum Master Open Source Development Project Management Process Improvement Management Enterprise Software Strategy Business Intelligence Data Center See 19+     See less Business Process... Financial Analysis Business Analysis Manageability Program Management Project Planning Leadership PMP Cross-functional Team... Intel Scrum Cloud Computing IT Management Product Management Virtualization Operations Management IT Strategy Analysis Integration ITIL Vendor Management Agile Project Management Certified Project... Software Project... OpenStack Certified Scrum Master Open Source Development Project Management Process Improvement Management Enterprise Software Strategy Business Intelligence Data Center See 19+     See less Business Process... Financial Analysis Business Analysis Manageability Program Management Project Planning Leadership PMP Cross-functional Team... Intel Scrum Cloud Computing IT Management Product Management Virtualization Operations Management IT Strategy Analysis Integration ITIL Vendor Management Agile Project Management Certified Project... Software Project... OpenStack Certified Scrum Master Open Source Development Project Management Process Improvement Management Enterprise Software Strategy Business Intelligence Data Center See 19+     See less Education Arizona State University - W. P. Carey School of Business MBA,  Strategic Decision Making 2005  – 2007 Emphasis in Strategic Decision making where the entire coursework was designed to prepare us to make decisions in the business world, and back them up with sound judgement. It brought together tech, finance, marketing and most importantly, how to work with others to solve business problems. Baker University Bachelor's Degree,  Business Administration , Management and Operations 1998  – 2000 Established a great business foundation working in a cohort environment where as a team we would take on simulated business situations based on the coursework and provide adequate solutions. Arizona State University - W. P. Carey School of Business MBA,  Strategic Decision Making 2005  – 2007 Emphasis in Strategic Decision making where the entire coursework was designed to prepare us to make decisions in the business world, and back them up with sound judgement. It brought together tech, finance, marketing and most importantly, how to work with others to solve business problems. Arizona State University - W. P. Carey School of Business MBA,  Strategic Decision Making 2005  – 2007 Emphasis in Strategic Decision making where the entire coursework was designed to prepare us to make decisions in the business world, and back them up with sound judgement. It brought together tech, finance, marketing and most importantly, how to work with others to solve business problems. Arizona State University - W. P. Carey School of Business MBA,  Strategic Decision Making 2005  – 2007 Emphasis in Strategic Decision making where the entire coursework was designed to prepare us to make decisions in the business world, and back them up with sound judgement. It brought together tech, finance, marketing and most importantly, how to work with others to solve business problems. Baker University Bachelor's Degree,  Business Administration , Management and Operations 1998  – 2000 Established a great business foundation working in a cohort environment where as a team we would take on simulated business situations based on the coursework and provide adequate solutions. Baker University Bachelor's Degree,  Business Administration , Management and Operations 1998  – 2000 Established a great business foundation working in a cohort environment where as a team we would take on simulated business situations based on the coursework and provide adequate solutions. Baker University Bachelor's Degree,  Business Administration , Management and Operations 1998  – 2000 Established a great business foundation working in a cohort environment where as a team we would take on simulated business situations based on the coursework and provide adequate solutions. Honors & Awards ", "Experience IT Project Manager Intel Corporation 2010  – Present (5 years) Sr. Systems Analyst Intel Corporation 2000  –  2010  (10 years) Project Coordinator Intel Corporation 1997  –  2000  (3 years) IT Project Manager Intel Corporation 2010  – Present (5 years) IT Project Manager Intel Corporation 2010  – Present (5 years) Sr. Systems Analyst Intel Corporation 2000  –  2010  (10 years) Sr. Systems Analyst Intel Corporation 2000  –  2010  (10 years) Project Coordinator Intel Corporation 1997  –  2000  (3 years) Project Coordinator Intel Corporation 1997  –  2000  (3 years) Skills Process Improvement Business Analysis Software Project... Requirements Analysis Cross-functional Team... Integration Business Intelligence ERP PMP Business Process Program Management Software Development PMO SDLC Project Management Skills  Process Improvement Business Analysis Software Project... Requirements Analysis Cross-functional Team... Integration Business Intelligence ERP PMP Business Process Program Management Software Development PMO SDLC Project Management Process Improvement Business Analysis Software Project... Requirements Analysis Cross-functional Team... Integration Business Intelligence ERP PMP Business Process Program Management Software Development PMO SDLC Project Management Process Improvement Business Analysis Software Project... Requirements Analysis Cross-functional Team... Integration Business Intelligence ERP PMP Business Process Program Management Software Development PMO SDLC Project Management Education University of Maryland - Robert H. Smith School of Business MBA 1994  – 1997 Dickinson College B.A.,  Economics 1986  – 1990 University of Maryland - Robert H. Smith School of Business MBA 1994  – 1997 University of Maryland - Robert H. Smith School of Business MBA 1994  – 1997 University of Maryland - Robert H. Smith School of Business MBA 1994  – 1997 Dickinson College B.A.,  Economics 1986  – 1990 Dickinson College B.A.,  Economics 1986  – 1990 Dickinson College B.A.,  Economics 1986  – 1990 ", "Summary Project manager specializing in managing global teams and deployment of new products and tools. Specialties:Project Management \nCustomer Relationships  \nTechnical Support and Technical Support Management \nInfluencing Change in Organizations \nPeople Management \nGlobal Virtual Teams \nService Engineering Summary Project manager specializing in managing global teams and deployment of new products and tools. Specialties:Project Management \nCustomer Relationships  \nTechnical Support and Technical Support Management \nInfluencing Change in Organizations \nPeople Management \nGlobal Virtual Teams \nService Engineering Project manager specializing in managing global teams and deployment of new products and tools. Specialties:Project Management \nCustomer Relationships  \nTechnical Support and Technical Support Management \nInfluencing Change in Organizations \nPeople Management \nGlobal Virtual Teams \nService Engineering Project manager specializing in managing global teams and deployment of new products and tools. Specialties:Project Management \nCustomer Relationships  \nTechnical Support and Technical Support Management \nInfluencing Change in Organizations \nPeople Management \nGlobal Virtual Teams \nService Engineering Experience Senior IT Project Manager Intel Corporation November 2011  – Present (3 years 10 months) Software development release project manager for major and minor releases to support new capabilities to Intel's public web presence, intel.com. Manage dependencies and partnerships between three core project teams, agencies, other internal development teams, and path to production. IT Program Manager Intel Corporation January 2006  –  November 2011  (5 years 11 months) Managed IT global programs for design engineering environment..  \n \nProvide leadership on project schedules and teams responsible for requirements definition, data definition, project value decisions, training, communications, stakeholder management and deployment. Manage virtual project teams comprised of individuals from various Intel sites around the world. Projects included development of customer engagement program, implementing improvements in efficiencies of validation labs, and capital planning process improvements. \n \nMember of the divisional Program Management Office overseeing proper project management practices. \n \nCredentials in Project Management Professional and Service Level Management Practiioner to provide leadership in projects in the design of services that customer value and increase productivity. Technical Support Manager Intel Corporation December 1999  –  January 2006  (6 years 2 months) Managed technical support team for Engineering Computing in the Northwest. Responsible for a staff of nine permanent employees and six student interns providing Unix and Windows support for a customer base of over 2000 local and remote users. This included people management but also partnership with technology teams and representatives from design projects. Led a global team responsible for UNIX account processes and entitlement. Provided leadership for the merge of three support organizations over four campuses and three sites into a single operation. Member of a global team of Engineering Computing customer support managers chartered with globalizing processes and exchanging BKMs Systems Programmer Intel Corporation March 1995  –  December 1999  (4 years 10 months) Member of a Systems Administration team supporting a large group of chipset engineers and layout designers. Responsible for supporting AIX workstations, Auspex file servers, and Sun Sparc compute servers. Teamed with the CAD Tool Administrators to keep Flexlm licenses operational and updated. Engineered backup environment utilizing the PDC Budtool application. Conducted third party software installation and support for such packages as Synchronize, a calendaring tool. Administered front level support and configuration for complex applications such as Netbatch. Focal point for all user account activity and security. Software Engineer Oregon Graduate Institute January 1993  –  March 1995  (2 years 3 months) Employed as a Software Systems Engineer supporting a variety of platforms: Sun, HP, Sequent, NeXT, Dec, X terminals, Macintosh, and a Sparcenter 2000 File/Compute server. Involved with all aspects of systems administration and network support: network connections, software ports, building software obtained from the internet, equipment moves, maintaining system databases (passwd, group, DNS), third party software installation, backups and restores, and hardware installation/repair. . Systems Analyst Mentor Graphics January 1989  –  January 1993  (4 years 1 month) Network and System Administrator for a sizeable site Macintosh network. Created and implemented new network standards. Established a communications network between Macintoshes and engineering workstations. Project leader for the transition of the Macintosh environment from the Beaverton to Wilsonville sites. \n \nPromoted to System Administrator to support Sun and HP-UX workstation networks. Responsible for OS maintenance, working with the NIS database, NFS automounter maps, and user account integrity. Administered a HP-UX project to standardize OS installation on new machines Presale Support Analyst Unisys Corporation January 1980  –  July 1988  (8 years 7 months) Provided post-sales support on UNIX, Office Automation, MS-DOS, and Data Entry products. Participated in demonstrations of products to potential customers, performed benchmarks, and wrote proposals as part of presales technical support staff. Operated a product demonstration center in the local sales office. Elected Systems Analyst of the Year in 1984 Senior IT Project Manager Intel Corporation November 2011  – Present (3 years 10 months) Software development release project manager for major and minor releases to support new capabilities to Intel's public web presence, intel.com. Manage dependencies and partnerships between three core project teams, agencies, other internal development teams, and path to production. Senior IT Project Manager Intel Corporation November 2011  – Present (3 years 10 months) Software development release project manager for major and minor releases to support new capabilities to Intel's public web presence, intel.com. Manage dependencies and partnerships between three core project teams, agencies, other internal development teams, and path to production. IT Program Manager Intel Corporation January 2006  –  November 2011  (5 years 11 months) Managed IT global programs for design engineering environment..  \n \nProvide leadership on project schedules and teams responsible for requirements definition, data definition, project value decisions, training, communications, stakeholder management and deployment. Manage virtual project teams comprised of individuals from various Intel sites around the world. Projects included development of customer engagement program, implementing improvements in efficiencies of validation labs, and capital planning process improvements. \n \nMember of the divisional Program Management Office overseeing proper project management practices. \n \nCredentials in Project Management Professional and Service Level Management Practiioner to provide leadership in projects in the design of services that customer value and increase productivity. IT Program Manager Intel Corporation January 2006  –  November 2011  (5 years 11 months) Managed IT global programs for design engineering environment..  \n \nProvide leadership on project schedules and teams responsible for requirements definition, data definition, project value decisions, training, communications, stakeholder management and deployment. Manage virtual project teams comprised of individuals from various Intel sites around the world. Projects included development of customer engagement program, implementing improvements in efficiencies of validation labs, and capital planning process improvements. \n \nMember of the divisional Program Management Office overseeing proper project management practices. \n \nCredentials in Project Management Professional and Service Level Management Practiioner to provide leadership in projects in the design of services that customer value and increase productivity. Technical Support Manager Intel Corporation December 1999  –  January 2006  (6 years 2 months) Managed technical support team for Engineering Computing in the Northwest. Responsible for a staff of nine permanent employees and six student interns providing Unix and Windows support for a customer base of over 2000 local and remote users. This included people management but also partnership with technology teams and representatives from design projects. Led a global team responsible for UNIX account processes and entitlement. Provided leadership for the merge of three support organizations over four campuses and three sites into a single operation. Member of a global team of Engineering Computing customer support managers chartered with globalizing processes and exchanging BKMs Technical Support Manager Intel Corporation December 1999  –  January 2006  (6 years 2 months) Managed technical support team for Engineering Computing in the Northwest. Responsible for a staff of nine permanent employees and six student interns providing Unix and Windows support for a customer base of over 2000 local and remote users. This included people management but also partnership with technology teams and representatives from design projects. Led a global team responsible for UNIX account processes and entitlement. Provided leadership for the merge of three support organizations over four campuses and three sites into a single operation. Member of a global team of Engineering Computing customer support managers chartered with globalizing processes and exchanging BKMs Systems Programmer Intel Corporation March 1995  –  December 1999  (4 years 10 months) Member of a Systems Administration team supporting a large group of chipset engineers and layout designers. Responsible for supporting AIX workstations, Auspex file servers, and Sun Sparc compute servers. Teamed with the CAD Tool Administrators to keep Flexlm licenses operational and updated. Engineered backup environment utilizing the PDC Budtool application. Conducted third party software installation and support for such packages as Synchronize, a calendaring tool. Administered front level support and configuration for complex applications such as Netbatch. Focal point for all user account activity and security. Systems Programmer Intel Corporation March 1995  –  December 1999  (4 years 10 months) Member of a Systems Administration team supporting a large group of chipset engineers and layout designers. Responsible for supporting AIX workstations, Auspex file servers, and Sun Sparc compute servers. Teamed with the CAD Tool Administrators to keep Flexlm licenses operational and updated. Engineered backup environment utilizing the PDC Budtool application. Conducted third party software installation and support for such packages as Synchronize, a calendaring tool. Administered front level support and configuration for complex applications such as Netbatch. Focal point for all user account activity and security. Software Engineer Oregon Graduate Institute January 1993  –  March 1995  (2 years 3 months) Employed as a Software Systems Engineer supporting a variety of platforms: Sun, HP, Sequent, NeXT, Dec, X terminals, Macintosh, and a Sparcenter 2000 File/Compute server. Involved with all aspects of systems administration and network support: network connections, software ports, building software obtained from the internet, equipment moves, maintaining system databases (passwd, group, DNS), third party software installation, backups and restores, and hardware installation/repair. . Software Engineer Oregon Graduate Institute January 1993  –  March 1995  (2 years 3 months) Employed as a Software Systems Engineer supporting a variety of platforms: Sun, HP, Sequent, NeXT, Dec, X terminals, Macintosh, and a Sparcenter 2000 File/Compute server. Involved with all aspects of systems administration and network support: network connections, software ports, building software obtained from the internet, equipment moves, maintaining system databases (passwd, group, DNS), third party software installation, backups and restores, and hardware installation/repair. . Systems Analyst Mentor Graphics January 1989  –  January 1993  (4 years 1 month) Network and System Administrator for a sizeable site Macintosh network. Created and implemented new network standards. Established a communications network between Macintoshes and engineering workstations. Project leader for the transition of the Macintosh environment from the Beaverton to Wilsonville sites. \n \nPromoted to System Administrator to support Sun and HP-UX workstation networks. Responsible for OS maintenance, working with the NIS database, NFS automounter maps, and user account integrity. Administered a HP-UX project to standardize OS installation on new machines Systems Analyst Mentor Graphics January 1989  –  January 1993  (4 years 1 month) Network and System Administrator for a sizeable site Macintosh network. Created and implemented new network standards. Established a communications network between Macintoshes and engineering workstations. Project leader for the transition of the Macintosh environment from the Beaverton to Wilsonville sites. \n \nPromoted to System Administrator to support Sun and HP-UX workstation networks. Responsible for OS maintenance, working with the NIS database, NFS automounter maps, and user account integrity. Administered a HP-UX project to standardize OS installation on new machines Presale Support Analyst Unisys Corporation January 1980  –  July 1988  (8 years 7 months) Provided post-sales support on UNIX, Office Automation, MS-DOS, and Data Entry products. Participated in demonstrations of products to potential customers, performed benchmarks, and wrote proposals as part of presales technical support staff. Operated a product demonstration center in the local sales office. Elected Systems Analyst of the Year in 1984 Presale Support Analyst Unisys Corporation January 1980  –  July 1988  (8 years 7 months) Provided post-sales support on UNIX, Office Automation, MS-DOS, and Data Entry products. Participated in demonstrations of products to potential customers, performed benchmarks, and wrote proposals as part of presales technical support staff. Operated a product demonstration center in the local sales office. Elected Systems Analyst of the Year in 1984 Skills Virtual Teams Project Management Process Improvement Management CRM PMP Databases Unix Requirements Analysis System Administration Software Development Security Networking Operating Systems Servers Skills  Virtual Teams Project Management Process Improvement Management CRM PMP Databases Unix Requirements Analysis System Administration Software Development Security Networking Operating Systems Servers Virtual Teams Project Management Process Improvement Management CRM PMP Databases Unix Requirements Analysis System Administration Software Development Security Networking Operating Systems Servers Virtual Teams Project Management Process Improvement Management CRM PMP Databases Unix Requirements Analysis System Administration Software Development Security Networking Operating Systems Servers Education Oregon Health and Science University Masters,  Mangement in Science and Technology 2005  – 2007 Activities and Societies:  Graduated with 4.0 GPA\nTeam Leader on Capstone and Technology Marketing projects University of Phoenix Bachelors,  Business Management 2001  – 2003 Graduated with Honors Portland Community College AAS,  Computer Programming 1979  – 1983 Honors Graduate Oregon Health and Science University Masters,  Mangement in Science and Technology 2005  – 2007 Activities and Societies:  Graduated with 4.0 GPA\nTeam Leader on Capstone and Technology Marketing projects Oregon Health and Science University Masters,  Mangement in Science and Technology 2005  – 2007 Activities and Societies:  Graduated with 4.0 GPA\nTeam Leader on Capstone and Technology Marketing projects Oregon Health and Science University Masters,  Mangement in Science and Technology 2005  – 2007 Activities and Societies:  Graduated with 4.0 GPA\nTeam Leader on Capstone and Technology Marketing projects University of Phoenix Bachelors,  Business Management 2001  – 2003 Graduated with Honors University of Phoenix Bachelors,  Business Management 2001  – 2003 Graduated with Honors University of Phoenix Bachelors,  Business Management 2001  – 2003 Graduated with Honors Portland Community College AAS,  Computer Programming 1979  – 1983 Honors Graduate Portland Community College AAS,  Computer Programming 1979  – 1983 Honors Graduate Portland Community College AAS,  Computer Programming 1979  – 1983 Honors Graduate Honors & Awards Additional Honors & Awards IT Division Recognition Award, Intel Corp. - 2007 \nService Excellence Award, Mentor Graphics 1990 \nService Excellence Award, Mentor Graphics 1989 \nSystems Analyst of the Year, NW Region, Unisys, 1984 Additional Honors & Awards IT Division Recognition Award, Intel Corp. - 2007 \nService Excellence Award, Mentor Graphics 1990 \nService Excellence Award, Mentor Graphics 1989 \nSystems Analyst of the Year, NW Region, Unisys, 1984 Additional Honors & Awards IT Division Recognition Award, Intel Corp. - 2007 \nService Excellence Award, Mentor Graphics 1990 \nService Excellence Award, Mentor Graphics 1989 \nSystems Analyst of the Year, NW Region, Unisys, 1984 Additional Honors & Awards IT Division Recognition Award, Intel Corp. - 2007 \nService Excellence Award, Mentor Graphics 1990 \nService Excellence Award, Mentor Graphics 1989 \nSystems Analyst of the Year, NW Region, Unisys, 1984 ", "Skills Management IT Management Service Delivery SDLC Problem Solving People Management Project Management Coaching Leadership Integration Enterprise Software Business Analysis Software Project... Vendor Management Cross-functional Team... ITIL Program Management Requirements Analysis See 3+     See less Skills  Management IT Management Service Delivery SDLC Problem Solving People Management Project Management Coaching Leadership Integration Enterprise Software Business Analysis Software Project... Vendor Management Cross-functional Team... ITIL Program Management Requirements Analysis See 3+     See less Management IT Management Service Delivery SDLC Problem Solving People Management Project Management Coaching Leadership Integration Enterprise Software Business Analysis Software Project... Vendor Management Cross-functional Team... ITIL Program Management Requirements Analysis See 3+     See less Management IT Management Service Delivery SDLC Problem Solving People Management Project Management Coaching Leadership Integration Enterprise Software Business Analysis Software Project... Vendor Management Cross-functional Team... ITIL Program Management Requirements Analysis See 3+     See less ", "Skills Program Management Cross-functional Team... Vendor Management Project Management Internal Communications Strategic Communications Lean Six Sigma Green... Business Process... Six Sigma Business Development Management Product Marketing Marketing Integration Strategy Process Improvement Business Analysis Leadership Business Intelligence Cloud Computing Change Management Business Process... PMP Software Project... See 9+     See less Skills  Program Management Cross-functional Team... Vendor Management Project Management Internal Communications Strategic Communications Lean Six Sigma Green... Business Process... Six Sigma Business Development Management Product Marketing Marketing Integration Strategy Process Improvement Business Analysis Leadership Business Intelligence Cloud Computing Change Management Business Process... PMP Software Project... See 9+     See less Program Management Cross-functional Team... Vendor Management Project Management Internal Communications Strategic Communications Lean Six Sigma Green... Business Process... Six Sigma Business Development Management Product Marketing Marketing Integration Strategy Process Improvement Business Analysis Leadership Business Intelligence Cloud Computing Change Management Business Process... PMP Software Project... See 9+     See less Program Management Cross-functional Team... Vendor Management Project Management Internal Communications Strategic Communications Lean Six Sigma Green... Business Process... Six Sigma Business Development Management Product Marketing Marketing Integration Strategy Process Improvement Business Analysis Leadership Business Intelligence Cloud Computing Change Management Business Process... PMP Software Project... See 9+     See less ", "Summary Experienced Data Centre Engineer with extensive experience of global capacity planning and project team management. \n \n•Data Centre Capacity Planner with strong organisational and technical skills. \n•Thorough knowledge of data centre design and technologies \n•Experienced Project Manager with a proven ability to deliver to time and budget. \n•Disciplined, self driven individual who also works well in a team environment. \n•Innovative problem solver. \n•Good presentation skills. \n•Used to working in a multicultural global environment. Summary Experienced Data Centre Engineer with extensive experience of global capacity planning and project team management. \n \n•Data Centre Capacity Planner with strong organisational and technical skills. \n•Thorough knowledge of data centre design and technologies \n•Experienced Project Manager with a proven ability to deliver to time and budget. \n•Disciplined, self driven individual who also works well in a team environment. \n•Innovative problem solver. \n•Good presentation skills. \n•Used to working in a multicultural global environment. Experienced Data Centre Engineer with extensive experience of global capacity planning and project team management. \n \n•Data Centre Capacity Planner with strong organisational and technical skills. \n•Thorough knowledge of data centre design and technologies \n•Experienced Project Manager with a proven ability to deliver to time and budget. \n•Disciplined, self driven individual who also works well in a team environment. \n•Innovative problem solver. \n•Good presentation skills. \n•Used to working in a multicultural global environment. Experienced Data Centre Engineer with extensive experience of global capacity planning and project team management. \n \n•Data Centre Capacity Planner with strong organisational and technical skills. \n•Thorough knowledge of data centre design and technologies \n•Experienced Project Manager with a proven ability to deliver to time and budget. \n•Disciplined, self driven individual who also works well in a team environment. \n•Innovative problem solver. \n•Good presentation skills. \n•Used to working in a multicultural global environment. Experience Data Centre Capacity Planner Intel Corporation October 2007  –  January 2013  (5 years 4 months) UK Responsible for the forward planning of data center space, power and cooling. Analysing the impact of customer device forecasts on data centre infrastructure. Identifying shortfalls in capacity and creating contingency plans to mitigate those shortfalls and ensuring capacity is always available. \n \n•Senior point of contact for data centre planning responsibilities globally. Supporting sixty eight data centres globally with a total footprint of 430,000 sq ft. \n•Analysing customer’s growth and translating it to future data dentre Capacity requirements. \n•Maintained a data base on data centre infrastructure and capacity usage for sixty eight data centres globally. Responsible for reporting capacity usage and trending. \n•Responsible for developing growth plans down to cabinet, power distribution and network connectivity level. \n•Responsible for strategy development. Developed strategies to support growth in a cost effective and energy efficient manner. \n•Maintained DC operability during a period of considerable growth with no data centre capacity constraints. \n•Developed a Capacity Planning Methodology for Supply/Demand forecasting to support the delivery of data centre capacity, deployed by Intel as a Global tool in support of data centre Capacity Planners. \n•Presented projects and business justification to senior level for support and funding. \n•Created innovative solutions for Cooling and Power constraints at existing data centres. \n•Supporting data centre construction projects as an expert advisor in the development of scope and design. \n•Successfully delivered additional data centre capacity globally and maintained continuity of service. \n•Worked as part of a global team to deploy DCiM across six data centres.  \n•Data centre Subject Matter Expert. (SME) Sharing data centre best practice in design and energy efficiency with internal and external customers at CIO and data centre Summits in Europe and the Middle East. Recognised for being an IT@Intel top ten SME. IT Project Manager Intel Corporation October 2000  –  October 2007  (7 years 1 month) UK •Responsible for the delivery of IT infrastructure in building refits and Greenfield construction. IT Infrastructure included: Data centres, Communications rooms, structured cabling, Conference rooms. Telephony, LAN, WAN and IT Infrastructure servers. \n•Prepared Scope, schedule and budget for the construction projects. \n•Presented projects to VP level for funding. \n•Project manager responsible for leading Global teams through full project lifecycle. \n•Responsible for delivering the project to Scope, Schedule and Budget. \n•Successfully delivered many multi-million dollar projects. Last project, managing the team to move Intel’s Warehouse in Amsterdam whilst maintaining operability in both locations. Data Centre Capacity Planner Intel Corporation October 2007  –  January 2013  (5 years 4 months) UK Responsible for the forward planning of data center space, power and cooling. Analysing the impact of customer device forecasts on data centre infrastructure. Identifying shortfalls in capacity and creating contingency plans to mitigate those shortfalls and ensuring capacity is always available. \n \n•Senior point of contact for data centre planning responsibilities globally. Supporting sixty eight data centres globally with a total footprint of 430,000 sq ft. \n•Analysing customer’s growth and translating it to future data dentre Capacity requirements. \n•Maintained a data base on data centre infrastructure and capacity usage for sixty eight data centres globally. Responsible for reporting capacity usage and trending. \n•Responsible for developing growth plans down to cabinet, power distribution and network connectivity level. \n•Responsible for strategy development. Developed strategies to support growth in a cost effective and energy efficient manner. \n•Maintained DC operability during a period of considerable growth with no data centre capacity constraints. \n•Developed a Capacity Planning Methodology for Supply/Demand forecasting to support the delivery of data centre capacity, deployed by Intel as a Global tool in support of data centre Capacity Planners. \n•Presented projects and business justification to senior level for support and funding. \n•Created innovative solutions for Cooling and Power constraints at existing data centres. \n•Supporting data centre construction projects as an expert advisor in the development of scope and design. \n•Successfully delivered additional data centre capacity globally and maintained continuity of service. \n•Worked as part of a global team to deploy DCiM across six data centres.  \n•Data centre Subject Matter Expert. (SME) Sharing data centre best practice in design and energy efficiency with internal and external customers at CIO and data centre Summits in Europe and the Middle East. Recognised for being an IT@Intel top ten SME. Data Centre Capacity Planner Intel Corporation October 2007  –  January 2013  (5 years 4 months) UK Responsible for the forward planning of data center space, power and cooling. Analysing the impact of customer device forecasts on data centre infrastructure. Identifying shortfalls in capacity and creating contingency plans to mitigate those shortfalls and ensuring capacity is always available. \n \n•Senior point of contact for data centre planning responsibilities globally. Supporting sixty eight data centres globally with a total footprint of 430,000 sq ft. \n•Analysing customer’s growth and translating it to future data dentre Capacity requirements. \n•Maintained a data base on data centre infrastructure and capacity usage for sixty eight data centres globally. Responsible for reporting capacity usage and trending. \n•Responsible for developing growth plans down to cabinet, power distribution and network connectivity level. \n•Responsible for strategy development. Developed strategies to support growth in a cost effective and energy efficient manner. \n•Maintained DC operability during a period of considerable growth with no data centre capacity constraints. \n•Developed a Capacity Planning Methodology for Supply/Demand forecasting to support the delivery of data centre capacity, deployed by Intel as a Global tool in support of data centre Capacity Planners. \n•Presented projects and business justification to senior level for support and funding. \n•Created innovative solutions for Cooling and Power constraints at existing data centres. \n•Supporting data centre construction projects as an expert advisor in the development of scope and design. \n•Successfully delivered additional data centre capacity globally and maintained continuity of service. \n•Worked as part of a global team to deploy DCiM across six data centres.  \n•Data centre Subject Matter Expert. (SME) Sharing data centre best practice in design and energy efficiency with internal and external customers at CIO and data centre Summits in Europe and the Middle East. Recognised for being an IT@Intel top ten SME. IT Project Manager Intel Corporation October 2000  –  October 2007  (7 years 1 month) UK •Responsible for the delivery of IT infrastructure in building refits and Greenfield construction. IT Infrastructure included: Data centres, Communications rooms, structured cabling, Conference rooms. Telephony, LAN, WAN and IT Infrastructure servers. \n•Prepared Scope, schedule and budget for the construction projects. \n•Presented projects to VP level for funding. \n•Project manager responsible for leading Global teams through full project lifecycle. \n•Responsible for delivering the project to Scope, Schedule and Budget. \n•Successfully delivered many multi-million dollar projects. Last project, managing the team to move Intel’s Warehouse in Amsterdam whilst maintaining operability in both locations. IT Project Manager Intel Corporation October 2000  –  October 2007  (7 years 1 month) UK •Responsible for the delivery of IT infrastructure in building refits and Greenfield construction. IT Infrastructure included: Data centres, Communications rooms, structured cabling, Conference rooms. Telephony, LAN, WAN and IT Infrastructure servers. \n•Prepared Scope, schedule and budget for the construction projects. \n•Presented projects to VP level for funding. \n•Project manager responsible for leading Global teams through full project lifecycle. \n•Responsible for delivering the project to Scope, Schedule and Budget. \n•Successfully delivered many multi-million dollar projects. Last project, managing the team to move Intel’s Warehouse in Amsterdam whilst maintaining operability in both locations. Skills ITIL Data Center Project Management Intel Integration Vendor Management Program Management SDLC Cross-functional Team... Process Improvement Product Management Project Planning Infrastructure Servers MS Project Semiconductors IT Operations PMP Cloud Computing IT Management IT Service Management Leadership Disaster Recovery Security IT Strategy Requirements Analysis Project Portfolio... Information Technology Enterprise Software See 14+     See less Skills  ITIL Data Center Project Management Intel Integration Vendor Management Program Management SDLC Cross-functional Team... Process Improvement Product Management Project Planning Infrastructure Servers MS Project Semiconductors IT Operations PMP Cloud Computing IT Management IT Service Management Leadership Disaster Recovery Security IT Strategy Requirements Analysis Project Portfolio... Information Technology Enterprise Software See 14+     See less ITIL Data Center Project Management Intel Integration Vendor Management Program Management SDLC Cross-functional Team... Process Improvement Product Management Project Planning Infrastructure Servers MS Project Semiconductors IT Operations PMP Cloud Computing IT Management IT Service Management Leadership Disaster Recovery Security IT Strategy Requirements Analysis Project Portfolio... Information Technology Enterprise Software See 14+     See less ITIL Data Center Project Management Intel Integration Vendor Management Program Management SDLC Cross-functional Team... Process Improvement Product Management Project Planning Infrastructure Servers MS Project Semiconductors IT Operations PMP Cloud Computing IT Management IT Service Management Leadership Disaster Recovery Security IT Strategy Requirements Analysis Project Portfolio... Information Technology Enterprise Software See 14+     See less ", "Languages Spanish Spanish Spanish Skills Intel Debugging Processors Hardware Semiconductors Information Technology Embedded Systems Perl System Architecture Testing Software Development TCP/IP Integration Operating Systems Unix Program Management Network Security Cross-functional Team... See 3+     See less Skills  Intel Debugging Processors Hardware Semiconductors Information Technology Embedded Systems Perl System Architecture Testing Software Development TCP/IP Integration Operating Systems Unix Program Management Network Security Cross-functional Team... See 3+     See less Intel Debugging Processors Hardware Semiconductors Information Technology Embedded Systems Perl System Architecture Testing Software Development TCP/IP Integration Operating Systems Unix Program Management Network Security Cross-functional Team... See 3+     See less Intel Debugging Processors Hardware Semiconductors Information Technology Embedded Systems Perl System Architecture Testing Software Development TCP/IP Integration Operating Systems Unix Program Management Network Security Cross-functional Team... See 3+     See less ", "Skills Data Center Disaster Recovery IT Operations Program Management Business Continuity Telecommunications Security Leadership Networking Infrastructure IT Management Information Technology Management Project Planning Cloud Computing Intel Vendor Management PMP ITIL Integration Project Management Storage Software Project... Servers SDLC See 10+     See less Skills  Data Center Disaster Recovery IT Operations Program Management Business Continuity Telecommunications Security Leadership Networking Infrastructure IT Management Information Technology Management Project Planning Cloud Computing Intel Vendor Management PMP ITIL Integration Project Management Storage Software Project... Servers SDLC See 10+     See less Data Center Disaster Recovery IT Operations Program Management Business Continuity Telecommunications Security Leadership Networking Infrastructure IT Management Information Technology Management Project Planning Cloud Computing Intel Vendor Management PMP ITIL Integration Project Management Storage Software Project... Servers SDLC See 10+     See less Data Center Disaster Recovery IT Operations Program Management Business Continuity Telecommunications Security Leadership Networking Infrastructure IT Management Information Technology Management Project Planning Cloud Computing Intel Vendor Management PMP ITIL Integration Project Management Storage Software Project... Servers SDLC See 10+     See less Honors & Awards ", "Skills Software Project... Program Management Process Improvement Cross-functional Team... PMP Project Management Business Process SAP Business Analysis Business Process... Requirements Analysis Vendor Management Skills  Software Project... Program Management Process Improvement Cross-functional Team... PMP Project Management Business Process SAP Business Analysis Business Process... Requirements Analysis Vendor Management Software Project... Program Management Process Improvement Cross-functional Team... PMP Project Management Business Process SAP Business Analysis Business Process... Requirements Analysis Vendor Management Software Project... Program Management Process Improvement Cross-functional Team... PMP Project Management Business Process SAP Business Analysis Business Process... Requirements Analysis Vendor Management ", "Summary My career has allowed me to do many great things, from developing business processes to implementing CRM applications. The one thing that it all had in common, was the ability to help people use technology to enhance their day to day activities. Helping people makes my job fun and exciting. I enjoy the challenge of getting to know someone and how they perform their job and then strategizing to see what solutions that we can develop together.  \n \nIn addition to my career, being able to build successful relationships is a skill that I have been able to use throughout my life. During my graduate studies, a component of each course was building teams and working together on class projects. At the time, I thought it was a hassle but I soon learned that working with different people from a variety of backgrounds and making connections enhances your own learning experience. \n \nMy development over the years in my career and education has really provided me the tools and awareness to do great things but most important, the ability to do even greater things… Summary My career has allowed me to do many great things, from developing business processes to implementing CRM applications. The one thing that it all had in common, was the ability to help people use technology to enhance their day to day activities. Helping people makes my job fun and exciting. I enjoy the challenge of getting to know someone and how they perform their job and then strategizing to see what solutions that we can develop together.  \n \nIn addition to my career, being able to build successful relationships is a skill that I have been able to use throughout my life. During my graduate studies, a component of each course was building teams and working together on class projects. At the time, I thought it was a hassle but I soon learned that working with different people from a variety of backgrounds and making connections enhances your own learning experience. \n \nMy development over the years in my career and education has really provided me the tools and awareness to do great things but most important, the ability to do even greater things… My career has allowed me to do many great things, from developing business processes to implementing CRM applications. The one thing that it all had in common, was the ability to help people use technology to enhance their day to day activities. Helping people makes my job fun and exciting. I enjoy the challenge of getting to know someone and how they perform their job and then strategizing to see what solutions that we can develop together.  \n \nIn addition to my career, being able to build successful relationships is a skill that I have been able to use throughout my life. During my graduate studies, a component of each course was building teams and working together on class projects. At the time, I thought it was a hassle but I soon learned that working with different people from a variety of backgrounds and making connections enhances your own learning experience. \n \nMy development over the years in my career and education has really provided me the tools and awareness to do great things but most important, the ability to do even greater things… My career has allowed me to do many great things, from developing business processes to implementing CRM applications. The one thing that it all had in common, was the ability to help people use technology to enhance their day to day activities. Helping people makes my job fun and exciting. I enjoy the challenge of getting to know someone and how they perform their job and then strategizing to see what solutions that we can develop together.  \n \nIn addition to my career, being able to build successful relationships is a skill that I have been able to use throughout my life. During my graduate studies, a component of each course was building teams and working together on class projects. At the time, I thought it was a hassle but I soon learned that working with different people from a variety of backgrounds and making connections enhances your own learning experience. \n \nMy development over the years in my career and education has really provided me the tools and awareness to do great things but most important, the ability to do even greater things… Experience Sr. Project Manager (Contractor) GameStop October 2014  – Present (11 months) Grapevine, TX • Lead and manage project development from beginning to end by defining project scope, goals and deliverables that support desired business outcomes in collaboration with management and stakeholders. \n• Effectively communicate project expectations to team members and stakeholders in a timely and clear fashion. \n• Consistently demonstrates a commitment to policies and procedures of the organization, including but not limited to, attendance, confidentiality, conflict of interest, and ethical responsibilities \n• Possess good analytical, problem solving and decision making skills \n• Manage cross-functional projects that require engagement of multiple technology, delivery teams and business verticals \n• Ability to resolve conflicting situations by effectively negotiating each viewpoint \n• Ability to work under demanding time constraints and production goals CRM IT Project Manager Intel Corporation / Intel Security Group June 2011  –  October 2014  (3 years 5 months) Plano, TX • Project Manager for CRM Migration and architecture build for a newly created Datacenter  \n• Led a team of IT professionals to redesign the Quoting method in Siebel CRM. \n• Built cross-functional teams both onsite and offshore to create and develop according to Business requirements \n• Managed relationships and communication with key stakeholders and other members of the Executive team \n• Directed multiple projects through the SDLC including tasks and resources against project schedules and a total of $25 million budget M&A IT Project Manager (Consultant) VMware December 2010  –  June 2011  (7 months) Palo Alto, CA • Provided costs and time estimates for project deliverables  \n• Drove multiple M&A projects from initiation through delivery ensuring completion of the project on schedule and within budget constraints both on Pre-Acquisition and Post-Acquisition stages \n• Monitored project activities ensuring the currency, quality, and integrity of the information, and providing consistency in content and “look and feel” across the enterprise M&A IT Project Manager (Consultant) Life Technologies April 2010  –  December 2010  (9 months) Carlsbad, CA • Worked with internal/external clients to gather business requirements and coordinate project plans \n• Coordinated large data load activities of accounts, contacts, and products into multiple enterprise systems \n• Created new process to capture historical sales transactions for the purpose of sales forecasting Business Systems Analyst Quest Software, Inc July 2006  –  November 2009  (3 years 5 months) Aliso Viejo, CA • Worked in a team environment developing and creating business solutions for use within Siebel CRM application and for approximately 1000 users  \n• Led joint application design sessions to gather and document business requirements for multiple support and enhancement projects for CRM application \n• Used Siebel eSales functionality to implement a sales channel with 50% growth in sales annually and a potential to create $20 million in sales revenue \n• Created business processes in the Siebel SFA application and in the Sales division that reduced the cost of placing orders by 45% Sr. Project Manager (Contractor) GameStop October 2014  – Present (11 months) Grapevine, TX • Lead and manage project development from beginning to end by defining project scope, goals and deliverables that support desired business outcomes in collaboration with management and stakeholders. \n• Effectively communicate project expectations to team members and stakeholders in a timely and clear fashion. \n• Consistently demonstrates a commitment to policies and procedures of the organization, including but not limited to, attendance, confidentiality, conflict of interest, and ethical responsibilities \n• Possess good analytical, problem solving and decision making skills \n• Manage cross-functional projects that require engagement of multiple technology, delivery teams and business verticals \n• Ability to resolve conflicting situations by effectively negotiating each viewpoint \n• Ability to work under demanding time constraints and production goals Sr. Project Manager (Contractor) GameStop October 2014  – Present (11 months) Grapevine, TX • Lead and manage project development from beginning to end by defining project scope, goals and deliverables that support desired business outcomes in collaboration with management and stakeholders. \n• Effectively communicate project expectations to team members and stakeholders in a timely and clear fashion. \n• Consistently demonstrates a commitment to policies and procedures of the organization, including but not limited to, attendance, confidentiality, conflict of interest, and ethical responsibilities \n• Possess good analytical, problem solving and decision making skills \n• Manage cross-functional projects that require engagement of multiple technology, delivery teams and business verticals \n• Ability to resolve conflicting situations by effectively negotiating each viewpoint \n• Ability to work under demanding time constraints and production goals CRM IT Project Manager Intel Corporation / Intel Security Group June 2011  –  October 2014  (3 years 5 months) Plano, TX • Project Manager for CRM Migration and architecture build for a newly created Datacenter  \n• Led a team of IT professionals to redesign the Quoting method in Siebel CRM. \n• Built cross-functional teams both onsite and offshore to create and develop according to Business requirements \n• Managed relationships and communication with key stakeholders and other members of the Executive team \n• Directed multiple projects through the SDLC including tasks and resources against project schedules and a total of $25 million budget CRM IT Project Manager Intel Corporation / Intel Security Group June 2011  –  October 2014  (3 years 5 months) Plano, TX • Project Manager for CRM Migration and architecture build for a newly created Datacenter  \n• Led a team of IT professionals to redesign the Quoting method in Siebel CRM. \n• Built cross-functional teams both onsite and offshore to create and develop according to Business requirements \n• Managed relationships and communication with key stakeholders and other members of the Executive team \n• Directed multiple projects through the SDLC including tasks and resources against project schedules and a total of $25 million budget M&A IT Project Manager (Consultant) VMware December 2010  –  June 2011  (7 months) Palo Alto, CA • Provided costs and time estimates for project deliverables  \n• Drove multiple M&A projects from initiation through delivery ensuring completion of the project on schedule and within budget constraints both on Pre-Acquisition and Post-Acquisition stages \n• Monitored project activities ensuring the currency, quality, and integrity of the information, and providing consistency in content and “look and feel” across the enterprise M&A IT Project Manager (Consultant) VMware December 2010  –  June 2011  (7 months) Palo Alto, CA • Provided costs and time estimates for project deliverables  \n• Drove multiple M&A projects from initiation through delivery ensuring completion of the project on schedule and within budget constraints both on Pre-Acquisition and Post-Acquisition stages \n• Monitored project activities ensuring the currency, quality, and integrity of the information, and providing consistency in content and “look and feel” across the enterprise M&A IT Project Manager (Consultant) Life Technologies April 2010  –  December 2010  (9 months) Carlsbad, CA • Worked with internal/external clients to gather business requirements and coordinate project plans \n• Coordinated large data load activities of accounts, contacts, and products into multiple enterprise systems \n• Created new process to capture historical sales transactions for the purpose of sales forecasting M&A IT Project Manager (Consultant) Life Technologies April 2010  –  December 2010  (9 months) Carlsbad, CA • Worked with internal/external clients to gather business requirements and coordinate project plans \n• Coordinated large data load activities of accounts, contacts, and products into multiple enterprise systems \n• Created new process to capture historical sales transactions for the purpose of sales forecasting Business Systems Analyst Quest Software, Inc July 2006  –  November 2009  (3 years 5 months) Aliso Viejo, CA • Worked in a team environment developing and creating business solutions for use within Siebel CRM application and for approximately 1000 users  \n• Led joint application design sessions to gather and document business requirements for multiple support and enhancement projects for CRM application \n• Used Siebel eSales functionality to implement a sales channel with 50% growth in sales annually and a potential to create $20 million in sales revenue \n• Created business processes in the Siebel SFA application and in the Sales division that reduced the cost of placing orders by 45% Business Systems Analyst Quest Software, Inc July 2006  –  November 2009  (3 years 5 months) Aliso Viejo, CA • Worked in a team environment developing and creating business solutions for use within Siebel CRM application and for approximately 1000 users  \n• Led joint application design sessions to gather and document business requirements for multiple support and enhancement projects for CRM application \n• Used Siebel eSales functionality to implement a sales channel with 50% growth in sales annually and a potential to create $20 million in sales revenue \n• Created business processes in the Siebel SFA application and in the Sales division that reduced the cost of placing orders by 45% Skills SDLC Process Improvement Cross-functional Team... Project Management Program Management Visio Leadership Business Analysis Business Intelligence Requirements Analysis Vendor Management Integration Strategic Planning SQL Team Leadership Enterprise Software CRM Management Business Process IT Strategy Software Project... ERP MS Project Cloud Computing Requirements Gathering Strategy Team Building SaaS Databases Project Planning Training Data Center Business Development Software Documentation See 19+     See less Skills  SDLC Process Improvement Cross-functional Team... Project Management Program Management Visio Leadership Business Analysis Business Intelligence Requirements Analysis Vendor Management Integration Strategic Planning SQL Team Leadership Enterprise Software CRM Management Business Process IT Strategy Software Project... ERP MS Project Cloud Computing Requirements Gathering Strategy Team Building SaaS Databases Project Planning Training Data Center Business Development Software Documentation See 19+     See less SDLC Process Improvement Cross-functional Team... Project Management Program Management Visio Leadership Business Analysis Business Intelligence Requirements Analysis Vendor Management Integration Strategic Planning SQL Team Leadership Enterprise Software CRM Management Business Process IT Strategy Software Project... ERP MS Project Cloud Computing Requirements Gathering Strategy Team Building SaaS Databases Project Planning Training Data Center Business Development Software Documentation See 19+     See less SDLC Process Improvement Cross-functional Team... Project Management Program Management Visio Leadership Business Analysis Business Intelligence Requirements Analysis Vendor Management Integration Strategic Planning SQL Team Leadership Enterprise Software CRM Management Business Process IT Strategy Software Project... ERP MS Project Cloud Computing Requirements Gathering Strategy Team Building SaaS Databases Project Planning Training Data Center Business Development Software Documentation See 19+     See less Education Pepperdine University, The George L. Graziadio School of Business and Management Digital Innovation and Information Systems,  Information Technology 2014  – 2015 The MBA Plus program allows me the opportunity to further my education and enhance my work experience to expand my career. Activities and Societies:  Digital Innovation and Information System Club tours Silicon Valley. \"TechMix 2015\" took FEMBA and FTMBA students working on the DIIS Emphasis on a tour to visit Google ,  Apple ,  Salesforce ,  and Twitter. The club was led by Dr. Chun and Dr. Mooney. Pepperdine University, The George L. Graziadio School of Business and Management MBA,  Leadership / Management & Dispute Resolution 2007  – 2009 Attending Graduate school provided me with the opportunity to grow within myself and venture out and try different career paths with confidence... Activities and Societies:  Many Team and Group Projects... Hawaii Pacific University Bachelors,  Marketing 1998  – 2000 Attending HPU broadened my international business knowledge by allowing me to learn from the many different cultures that attended HPU... I remember an Econ with 30 students, and the Professor started talking about Taxes, only 5 students really understand US taxes. So the remaining couple of sessions, the 6 of us learned about taxes in 25 different cultures. That is knowledge that can not be obtained in the book but by attending classes with diversity... Kadena High School Pepperdine University, The George L. Graziadio School of Business and Management Digital Innovation and Information Systems,  Information Technology 2014  – 2015 The MBA Plus program allows me the opportunity to further my education and enhance my work experience to expand my career. Activities and Societies:  Digital Innovation and Information System Club tours Silicon Valley. \"TechMix 2015\" took FEMBA and FTMBA students working on the DIIS Emphasis on a tour to visit Google ,  Apple ,  Salesforce ,  and Twitter. The club was led by Dr. Chun and Dr. Mooney. Pepperdine University, The George L. Graziadio School of Business and Management Digital Innovation and Information Systems,  Information Technology 2014  – 2015 The MBA Plus program allows me the opportunity to further my education and enhance my work experience to expand my career. Activities and Societies:  Digital Innovation and Information System Club tours Silicon Valley. \"TechMix 2015\" took FEMBA and FTMBA students working on the DIIS Emphasis on a tour to visit Google ,  Apple ,  Salesforce ,  and Twitter. The club was led by Dr. Chun and Dr. Mooney. Pepperdine University, The George L. Graziadio School of Business and Management Digital Innovation and Information Systems,  Information Technology 2014  – 2015 The MBA Plus program allows me the opportunity to further my education and enhance my work experience to expand my career. Activities and Societies:  Digital Innovation and Information System Club tours Silicon Valley. \"TechMix 2015\" took FEMBA and FTMBA students working on the DIIS Emphasis on a tour to visit Google ,  Apple ,  Salesforce ,  and Twitter. The club was led by Dr. Chun and Dr. Mooney. Pepperdine University, The George L. Graziadio School of Business and Management MBA,  Leadership / Management & Dispute Resolution 2007  – 2009 Attending Graduate school provided me with the opportunity to grow within myself and venture out and try different career paths with confidence... Activities and Societies:  Many Team and Group Projects... Pepperdine University, The George L. Graziadio School of Business and Management MBA,  Leadership / Management & Dispute Resolution 2007  – 2009 Attending Graduate school provided me with the opportunity to grow within myself and venture out and try different career paths with confidence... Activities and Societies:  Many Team and Group Projects... Pepperdine University, The George L. Graziadio School of Business and Management MBA,  Leadership / Management & Dispute Resolution 2007  – 2009 Attending Graduate school provided me with the opportunity to grow within myself and venture out and try different career paths with confidence... Activities and Societies:  Many Team and Group Projects... Hawaii Pacific University Bachelors,  Marketing 1998  – 2000 Attending HPU broadened my international business knowledge by allowing me to learn from the many different cultures that attended HPU... I remember an Econ with 30 students, and the Professor started talking about Taxes, only 5 students really understand US taxes. So the remaining couple of sessions, the 6 of us learned about taxes in 25 different cultures. That is knowledge that can not be obtained in the book but by attending classes with diversity... Hawaii Pacific University Bachelors,  Marketing 1998  – 2000 Attending HPU broadened my international business knowledge by allowing me to learn from the many different cultures that attended HPU... I remember an Econ with 30 students, and the Professor started talking about Taxes, only 5 students really understand US taxes. So the remaining couple of sessions, the 6 of us learned about taxes in 25 different cultures. That is knowledge that can not be obtained in the book but by attending classes with diversity... Hawaii Pacific University Bachelors,  Marketing 1998  – 2000 Attending HPU broadened my international business knowledge by allowing me to learn from the many different cultures that attended HPU... I remember an Econ with 30 students, and the Professor started talking about Taxes, only 5 students really understand US taxes. So the remaining couple of sessions, the 6 of us learned about taxes in 25 different cultures. That is knowledge that can not be obtained in the book but by attending classes with diversity... Kadena High School Kadena High School Kadena High School Honors & Awards 2012 IT Project and Project Manager of the Year Finalist McAfee March 2013 2013 Project of the Year Nominee McAfee March 2014 Manage the Datacenter Migration Project of the CRM Application that was delivered without any disruptions to the end user community.  2012 IT Project and Project Manager of the Year Finalist McAfee March 2013 2012 IT Project and Project Manager of the Year Finalist McAfee March 2013 2012 IT Project and Project Manager of the Year Finalist McAfee March 2013 2013 Project of the Year Nominee McAfee March 2014 Manage the Datacenter Migration Project of the CRM Application that was delivered without any disruptions to the end user community.  2013 Project of the Year Nominee McAfee March 2014 Manage the Datacenter Migration Project of the CRM Application that was delivered without any disruptions to the end user community.  2013 Project of the Year Nominee McAfee March 2014 Manage the Datacenter Migration Project of the CRM Application that was delivered without any disruptions to the end user community.  ", "Summary CAREER PROFILE \n•\tLeadership/Managerial – Consistently selected to assume leadership roles corporate-wide in global sites. Proactively approach technical and business challenges, applying analytical problem-solving skills, persistence, teamwork, and operation excellence to achieve above and beyond expectation results.  \n•\tBusiness acumen/technical development – Adept & agile in developing and executing strategies that increase business value; identify and capitalize on growth opportunities through business/technical analysis, product expertise and sound business instincts. \n \nCORE COMPETENCIES\t \n•\tProject Management: Expert at software planning, development, implementation & deployment, process improvement, cost saving, team development, quality improvement, value engineering \n•\tSoftware Development & Engineering: Hands-on expert in SDLC process, IP & Cloud Computing, Unix & MS technology (C/C++/.NET/Perl/PS/SQL/DOS/Windows/DB), Software Design & Architecture, QA Process, Deployment & Release Management, Change Management System, Agile/Water-Fall/Iterative Methodology \n•\tCommunication & Influencing: Ability to present to non-technical audiences with influencing skills. Achieved Competent Communicator Level at Toastmaster International. Strong passion & caring for people, empathetic listening skills, and motivation ability through leveraging with people Summary CAREER PROFILE \n•\tLeadership/Managerial – Consistently selected to assume leadership roles corporate-wide in global sites. Proactively approach technical and business challenges, applying analytical problem-solving skills, persistence, teamwork, and operation excellence to achieve above and beyond expectation results.  \n•\tBusiness acumen/technical development – Adept & agile in developing and executing strategies that increase business value; identify and capitalize on growth opportunities through business/technical analysis, product expertise and sound business instincts. \n \nCORE COMPETENCIES\t \n•\tProject Management: Expert at software planning, development, implementation & deployment, process improvement, cost saving, team development, quality improvement, value engineering \n•\tSoftware Development & Engineering: Hands-on expert in SDLC process, IP & Cloud Computing, Unix & MS technology (C/C++/.NET/Perl/PS/SQL/DOS/Windows/DB), Software Design & Architecture, QA Process, Deployment & Release Management, Change Management System, Agile/Water-Fall/Iterative Methodology \n•\tCommunication & Influencing: Ability to present to non-technical audiences with influencing skills. Achieved Competent Communicator Level at Toastmaster International. Strong passion & caring for people, empathetic listening skills, and motivation ability through leveraging with people CAREER PROFILE \n•\tLeadership/Managerial – Consistently selected to assume leadership roles corporate-wide in global sites. Proactively approach technical and business challenges, applying analytical problem-solving skills, persistence, teamwork, and operation excellence to achieve above and beyond expectation results.  \n•\tBusiness acumen/technical development – Adept & agile in developing and executing strategies that increase business value; identify and capitalize on growth opportunities through business/technical analysis, product expertise and sound business instincts. \n \nCORE COMPETENCIES\t \n•\tProject Management: Expert at software planning, development, implementation & deployment, process improvement, cost saving, team development, quality improvement, value engineering \n•\tSoftware Development & Engineering: Hands-on expert in SDLC process, IP & Cloud Computing, Unix & MS technology (C/C++/.NET/Perl/PS/SQL/DOS/Windows/DB), Software Design & Architecture, QA Process, Deployment & Release Management, Change Management System, Agile/Water-Fall/Iterative Methodology \n•\tCommunication & Influencing: Ability to present to non-technical audiences with influencing skills. Achieved Competent Communicator Level at Toastmaster International. Strong passion & caring for people, empathetic listening skills, and motivation ability through leveraging with people CAREER PROFILE \n•\tLeadership/Managerial – Consistently selected to assume leadership roles corporate-wide in global sites. Proactively approach technical and business challenges, applying analytical problem-solving skills, persistence, teamwork, and operation excellence to achieve above and beyond expectation results.  \n•\tBusiness acumen/technical development – Adept & agile in developing and executing strategies that increase business value; identify and capitalize on growth opportunities through business/technical analysis, product expertise and sound business instincts. \n \nCORE COMPETENCIES\t \n•\tProject Management: Expert at software planning, development, implementation & deployment, process improvement, cost saving, team development, quality improvement, value engineering \n•\tSoftware Development & Engineering: Hands-on expert in SDLC process, IP & Cloud Computing, Unix & MS technology (C/C++/.NET/Perl/PS/SQL/DOS/Windows/DB), Software Design & Architecture, QA Process, Deployment & Release Management, Change Management System, Agile/Water-Fall/Iterative Methodology \n•\tCommunication & Influencing: Ability to present to non-technical audiences with influencing skills. Achieved Competent Communicator Level at Toastmaster International. Strong passion & caring for people, empathetic listening skills, and motivation ability through leveraging with people Experience IT Project Manager Intel Corporation April 2013  –  December 2013  (9 months) Chandler, AZ (Retired on 1/1/2014) \n•\tManaged & deployed IT “Registered Content Service” information protection software development project, replacing previous Anacappa application (which protects Intel Top Secret & Restricted data) to improve user experience, drive velocity to simplify registration/distribution processes for business units, improve employee productivity and drive policy change with governance teams \n•\tManage IT’s strategic, “horizontal” enterprise database and file/folder encryption project to allow for faster time to market delivery & securing IP data, better security through centralized governance & enforcement, and cost benefit over silo solution. Follow IT project life cycle from project initiation to deployment with stakeholders coming from cross functional organizations \n•\tManaged IT “Enterprise Right Management” software development project to protect draft and unregistered classified document at Intel with granular access right control IT Transfer Manager & Automation Engineer Intel Corporation September 2008  –  March 2013  (4 years 7 months) Dalian, Liaoning, China •\tBuilt $3B green-field wafer fab in Dalian, China by transferring the major sort/test applications and creating the training package for local employees to take over ownership after the transfer. Received two awards \n•\tManaged the on-call reduction strategic project, which improved the department’s productivity & work-life balance by reducing significant on-call support hours by 20% \n•\tSupported the process control system in wafer fab 24 by 7 to improve factory productivity, overall product quality, cost reduction with better equipment utilization, uptime and overall throughput IT Project Manager Intel Corporation August 2004  –  September 2008  (4 years 2 months) Chandler, AZ •\tManaged software project (PEGASUS) to improve data quality & reduce the complexity of metric model, as well as elimination of manual data entry (40-hour/week time saving per engineer) \n•\tUtilized automation and lean methodologies to analyze and benchmark data to optimize ATM capacity and to drive gap resolution for capacity issues, saving Intel $1B across the virtual factory. Received ATM Achievement Award. \n•\tImproved & streamlined the technology transfer process from the Technology Development Group to HVM sites across the globe (China, Malaysia, Costa Rica, Philippines), which improved Intel product’s time to market delivery. DFF transfer project ROI estimated $135M saving in 4 years. Received ATM Achievement Award Program Manager Intel Corporation October 1996  –  August 2004  (7 years 11 months) Chandler, AZ •\tManaged the cross-site 12” wafer strategic program to develop and deploy software applications to global high volume manufacturing sites, which increased output by 225%. Received two recognition awards (TMG Excellence & ATD DRA) for the program \n•\tLed a group of software engineers in developing a station controller product to enable Pentium 4 CPU production in HVM. Received one award \n•\tManaged the automation module program in Germany and created statement of work (including p-spec for SECS/GEM) for three equipment suppliers to enable Intel’s state-of-the-art thermo-compression-bonding (TCB) technology Software Manager/Software Engineer Intel Corporation May 1992  –  October 1996  (4 years 6 months) Chandler, AZ •\tLed a software engineering team (12 members) to develop a robust Window-NT based station controller by converting from OS/2, Unix & DOS architecture for FAB6, which improved the factory line yield from 90% to 95% (wafer loss reduction by 15/week) \n•\tApplied “agile” methodology to develop a robust station controller equipment application which reduced manufacturing technician manual data entry, improved equipment utilization, eliminated factory crisis risk, and improved equipment downtime IT Project Manager Intel Corporation April 2013  –  December 2013  (9 months) Chandler, AZ (Retired on 1/1/2014) \n•\tManaged & deployed IT “Registered Content Service” information protection software development project, replacing previous Anacappa application (which protects Intel Top Secret & Restricted data) to improve user experience, drive velocity to simplify registration/distribution processes for business units, improve employee productivity and drive policy change with governance teams \n•\tManage IT’s strategic, “horizontal” enterprise database and file/folder encryption project to allow for faster time to market delivery & securing IP data, better security through centralized governance & enforcement, and cost benefit over silo solution. Follow IT project life cycle from project initiation to deployment with stakeholders coming from cross functional organizations \n•\tManaged IT “Enterprise Right Management” software development project to protect draft and unregistered classified document at Intel with granular access right control IT Project Manager Intel Corporation April 2013  –  December 2013  (9 months) Chandler, AZ (Retired on 1/1/2014) \n•\tManaged & deployed IT “Registered Content Service” information protection software development project, replacing previous Anacappa application (which protects Intel Top Secret & Restricted data) to improve user experience, drive velocity to simplify registration/distribution processes for business units, improve employee productivity and drive policy change with governance teams \n•\tManage IT’s strategic, “horizontal” enterprise database and file/folder encryption project to allow for faster time to market delivery & securing IP data, better security through centralized governance & enforcement, and cost benefit over silo solution. Follow IT project life cycle from project initiation to deployment with stakeholders coming from cross functional organizations \n•\tManaged IT “Enterprise Right Management” software development project to protect draft and unregistered classified document at Intel with granular access right control IT Transfer Manager & Automation Engineer Intel Corporation September 2008  –  March 2013  (4 years 7 months) Dalian, Liaoning, China •\tBuilt $3B green-field wafer fab in Dalian, China by transferring the major sort/test applications and creating the training package for local employees to take over ownership after the transfer. Received two awards \n•\tManaged the on-call reduction strategic project, which improved the department’s productivity & work-life balance by reducing significant on-call support hours by 20% \n•\tSupported the process control system in wafer fab 24 by 7 to improve factory productivity, overall product quality, cost reduction with better equipment utilization, uptime and overall throughput IT Transfer Manager & Automation Engineer Intel Corporation September 2008  –  March 2013  (4 years 7 months) Dalian, Liaoning, China •\tBuilt $3B green-field wafer fab in Dalian, China by transferring the major sort/test applications and creating the training package for local employees to take over ownership after the transfer. Received two awards \n•\tManaged the on-call reduction strategic project, which improved the department’s productivity & work-life balance by reducing significant on-call support hours by 20% \n•\tSupported the process control system in wafer fab 24 by 7 to improve factory productivity, overall product quality, cost reduction with better equipment utilization, uptime and overall throughput IT Project Manager Intel Corporation August 2004  –  September 2008  (4 years 2 months) Chandler, AZ •\tManaged software project (PEGASUS) to improve data quality & reduce the complexity of metric model, as well as elimination of manual data entry (40-hour/week time saving per engineer) \n•\tUtilized automation and lean methodologies to analyze and benchmark data to optimize ATM capacity and to drive gap resolution for capacity issues, saving Intel $1B across the virtual factory. Received ATM Achievement Award. \n•\tImproved & streamlined the technology transfer process from the Technology Development Group to HVM sites across the globe (China, Malaysia, Costa Rica, Philippines), which improved Intel product’s time to market delivery. DFF transfer project ROI estimated $135M saving in 4 years. Received ATM Achievement Award IT Project Manager Intel Corporation August 2004  –  September 2008  (4 years 2 months) Chandler, AZ •\tManaged software project (PEGASUS) to improve data quality & reduce the complexity of metric model, as well as elimination of manual data entry (40-hour/week time saving per engineer) \n•\tUtilized automation and lean methodologies to analyze and benchmark data to optimize ATM capacity and to drive gap resolution for capacity issues, saving Intel $1B across the virtual factory. Received ATM Achievement Award. \n•\tImproved & streamlined the technology transfer process from the Technology Development Group to HVM sites across the globe (China, Malaysia, Costa Rica, Philippines), which improved Intel product’s time to market delivery. DFF transfer project ROI estimated $135M saving in 4 years. Received ATM Achievement Award Program Manager Intel Corporation October 1996  –  August 2004  (7 years 11 months) Chandler, AZ •\tManaged the cross-site 12” wafer strategic program to develop and deploy software applications to global high volume manufacturing sites, which increased output by 225%. Received two recognition awards (TMG Excellence & ATD DRA) for the program \n•\tLed a group of software engineers in developing a station controller product to enable Pentium 4 CPU production in HVM. Received one award \n•\tManaged the automation module program in Germany and created statement of work (including p-spec for SECS/GEM) for three equipment suppliers to enable Intel’s state-of-the-art thermo-compression-bonding (TCB) technology Program Manager Intel Corporation October 1996  –  August 2004  (7 years 11 months) Chandler, AZ •\tManaged the cross-site 12” wafer strategic program to develop and deploy software applications to global high volume manufacturing sites, which increased output by 225%. Received two recognition awards (TMG Excellence & ATD DRA) for the program \n•\tLed a group of software engineers in developing a station controller product to enable Pentium 4 CPU production in HVM. Received one award \n•\tManaged the automation module program in Germany and created statement of work (including p-spec for SECS/GEM) for three equipment suppliers to enable Intel’s state-of-the-art thermo-compression-bonding (TCB) technology Software Manager/Software Engineer Intel Corporation May 1992  –  October 1996  (4 years 6 months) Chandler, AZ •\tLed a software engineering team (12 members) to develop a robust Window-NT based station controller by converting from OS/2, Unix & DOS architecture for FAB6, which improved the factory line yield from 90% to 95% (wafer loss reduction by 15/week) \n•\tApplied “agile” methodology to develop a robust station controller equipment application which reduced manufacturing technician manual data entry, improved equipment utilization, eliminated factory crisis risk, and improved equipment downtime Software Manager/Software Engineer Intel Corporation May 1992  –  October 1996  (4 years 6 months) Chandler, AZ •\tLed a software engineering team (12 members) to develop a robust Window-NT based station controller by converting from OS/2, Unix & DOS architecture for FAB6, which improved the factory line yield from 90% to 95% (wafer loss reduction by 15/week) \n•\tApplied “agile” methodology to develop a robust station controller equipment application which reduced manufacturing technician manual data entry, improved equipment utilization, eliminated factory crisis risk, and improved equipment downtime Languages Chinese Chinese Chinese Skills Design of Experiments Semiconductors Failure Analysis Intel SPC Program Management Manufacturing Engineering Management Semiconductor Industry IC Analog CMOS ASIC Product Engineering Electronics Silicon Debugging JMP Metrology Software Project... Process Control System... Plant Startup Sort... Powershell C/C++ programming Assemby Test... Factory Automation... Assembly Test Equipment... Test Equipment Embedded... Product Health... Data Integrity Data Quality Software Quality Control System Engineering Statistical Process... Perl Script DOS Unix Services Station Controller... Employee Training Managerial Skills visual Embedded Software FMEA Reliability Process Simulation Embedded Systems Agile Methodologies Process Engineering Business Process Testing See 35+     See less Skills  Design of Experiments Semiconductors Failure Analysis Intel SPC Program Management Manufacturing Engineering Management Semiconductor Industry IC Analog CMOS ASIC Product Engineering Electronics Silicon Debugging JMP Metrology Software Project... Process Control System... Plant Startup Sort... Powershell C/C++ programming Assemby Test... Factory Automation... Assembly Test Equipment... Test Equipment Embedded... Product Health... Data Integrity Data Quality Software Quality Control System Engineering Statistical Process... Perl Script DOS Unix Services Station Controller... Employee Training Managerial Skills visual Embedded Software FMEA Reliability Process Simulation Embedded Systems Agile Methodologies Process Engineering Business Process Testing See 35+     See less Design of Experiments Semiconductors Failure Analysis Intel SPC Program Management Manufacturing Engineering Management Semiconductor Industry IC Analog CMOS ASIC Product Engineering Electronics Silicon Debugging JMP Metrology Software Project... Process Control System... Plant Startup Sort... Powershell C/C++ programming Assemby Test... Factory Automation... Assembly Test Equipment... Test Equipment Embedded... Product Health... Data Integrity Data Quality Software Quality Control System Engineering Statistical Process... Perl Script DOS Unix Services Station Controller... Employee Training Managerial Skills visual Embedded Software FMEA Reliability Process Simulation Embedded Systems Agile Methodologies Process Engineering Business Process Testing See 35+     See less Design of Experiments Semiconductors Failure Analysis Intel SPC Program Management Manufacturing Engineering Management Semiconductor Industry IC Analog CMOS ASIC Product Engineering Electronics Silicon Debugging JMP Metrology Software Project... Process Control System... Plant Startup Sort... Powershell C/C++ programming Assemby Test... Factory Automation... Assembly Test Equipment... Test Equipment Embedded... Product Health... Data Integrity Data Quality Software Quality Control System Engineering Statistical Process... Perl Script DOS Unix Services Station Controller... Employee Training Managerial Skills visual Embedded Software FMEA Reliability Process Simulation Embedded Systems Agile Methodologies Process Engineering Business Process Testing See 35+     See less Education University of Michigan Master of Science,  Computer Science , 3.7 University of Michigan Master of Science,  Mechanical Engineering , 3.8 Activities and Societies:  Tau Beta Pi National Tsing Hua University Bachelor Of Science,  Power Mechanical Engineering , 3.6 University of Michigan Master of Science,  Computer Science , 3.7 University of Michigan Master of Science,  Computer Science , 3.7 University of Michigan Master of Science,  Computer Science , 3.7 University of Michigan Master of Science,  Mechanical Engineering , 3.8 Activities and Societies:  Tau Beta Pi University of Michigan Master of Science,  Mechanical Engineering , 3.8 Activities and Societies:  Tau Beta Pi University of Michigan Master of Science,  Mechanical Engineering , 3.8 Activities and Societies:  Tau Beta Pi National Tsing Hua University Bachelor Of Science,  Power Mechanical Engineering , 3.6 National Tsing Hua University Bachelor Of Science,  Power Mechanical Engineering , 3.6 National Tsing Hua University Bachelor Of Science,  Power Mechanical Engineering , 3.6 ", "Summary A results-oriented, creative, and resourceful leader with strong communication, analytical, and technical skills to effectively manage programs, projects, processes, and people. Summary A results-oriented, creative, and resourceful leader with strong communication, analytical, and technical skills to effectively manage programs, projects, processes, and people. A results-oriented, creative, and resourceful leader with strong communication, analytical, and technical skills to effectively manage programs, projects, processes, and people. A results-oriented, creative, and resourceful leader with strong communication, analytical, and technical skills to effectively manage programs, projects, processes, and people. Experience WW Business Manager Hewlett-Packard October 2007  – Present (7 years 11 months) Printing and Personal Systems WW Operations •\tResponsible for all PRIME Project Portfolio Management Web/SharePoint Design and Development \n•\tDrove Pan-HP Process Alignment, Led Business Process Engineering, Inventory Optimization Development \n•\tDelivered RoHS Process Improvement initiative, enabling $600M in annual revenue and significantly improving operating efficiency and decreasing overall program risk \n•\tRevolutionized Cost reduction Program Management - Designed and Implemented Enterprise Cost Management (ECM) Solution. Lean Sigma Black Belt process improvement implemented a simplified, standardized, centralized and automated PPS-wide cost reduction framework \n•\tConsistently delivered MIB cost savings above Targets for FY08 through FY12- a top strategic priority for HP \n•\tLed very large WW Team (30+) of partners from Manufacturing, Product Lines, Regions, etc.  \n•\tPartnered with PL30/WW Operations to aggressively drive DesignJet FFGI scope expansion and implementation acceleration worldwide \n•\tRepresented COS in benchmarking initiative and managed Warranty and EOL analysis projects. \n•\tLed multiple Global Trade projects (Restricted Materials Regulatory Requirements/Reclassification (Dangerous Goods), Signage Inks Change Management Process, Enterprise Risk Management, AES, etc.)  \n•\tServed as an ambassador to facilitate communication between Senior Management and Operations Teams Category Operations Manager Hewlett-Packard October 2006  –  October 2007  (1 year 1 month) NA Region InkJet Supplies Operations •\tLed the transition from operational planning to \"end to end\" business management for NA Ink Supplies  \n•\tManaged relationship with Sonoco planning team for ink packaging capacity and supply planning \n•\tEnabled financial predictability by ensuring availability of Ink products. Proactively characterized and communicated issues and impact to customers / business through regular updates and ad-hoc communication  \n•\tDefined objectives, metrics, and Balanced Scorecard, recruited and mentored staff \n•\tCollaborated with cross-functional and worldwide partners to balance availability with cost by aggressively managing inventory to DOS targets throughout the supply chain  \n•\tLed the deployment of Regional SAP Planning Tools (Polaris DP, Polaris FGI, and Polaris FPU) Category Operations Lead Hewlett-Packard February 2006  –  October 2006  (9 months) NA Region InkJet Supplies Operations •\tDelivered Supply Chain Transformation investigation / LEAN Pull-Manufacturing Pilot  \n•\tLed the Host planning relationship with Operations partners via forums, processes, and tools. Raised confidence in the Host and Trade Demand Aggregation processes \n•\tSuccessfully brought NPI’s to market via flawless execution & Supported Category Marketing & Field initiatives \n•\tAchieved ISO 9001 certification for NA Ink Supplies Business Operations, including process definition and documentation, identifying non-value-add work and ’leaning out’ core work flows EMEA Region Business Manager Hewlett-Packard July 2004  –  February 2006  (1 year 8 months) Personal Systems Group-Mobile Computing Products •\tSuccessfully managed new products / features introduction (NPI) and refreshes and components rolls (CPE)  \n•\tLed regional cross-functional team to execute forecasting and supply/demand matching through end of life \n•\tLed regional factories’ set up for new products or capabilities introduction (customization) \n•\tDrove product quality and TAT performances in regional factories, through metrics and dashboard tracking \n•\tLed crisis management in case of quality and manufacturing issues \n•\tResponsible for quantum leap in GBU Supply Chain relationship and Regional factories engineering \n•\tParticipated in cross-functional projects as a supply chain engineering expert AMS Region Business Manager Hewlett-Packard July 2002  –  July 2004  (2 years 1 month) Imaging and Printing Group-InkJet Hardware •\tHighly successful management of ‘Big Bang’ NPIs and overall product lifecycle planning  \n•\tLed monthly cross-functional (Marketing/Operations/Finance) Category Plan-Of-Record planning process and optimized Go-To-Market business results, improved efficiency and decision-making through tool automation & process standardization  \n•\tLed regional cross-functional strategic Windows Planning forum to drive alignment of operational execution to IPG strategy  \n•\tDefined and executed inventory management strategies and goals to meet revenue, profitability, and inventory-driven cost objectives within a channel-collaborated planning environment (decreased inventory 37% YOY while maintaining service levels on target)  \n•\tProject management of regional customizations/bundles for IPG products. Led supply chain network analysis and POR with GBU and Supply Chain Ops.  \n•\tPerformed WOS analysis & recommendations, factory and depot responsiveness, & SKU proliferation  \n•\tOwned modeling of network design changes, proposed supply chain improvements, & category cost management- Led analysis into space/capacity planning \n•\tLed regional rebalancing initiatives and represented region in supply allocation management with worldwide teams Senior Business Analyst Hewlett-Packard July 1998  –  July 2002  (4 years 1 month) LaserJet Customer Service and Support •\tDesigned/implemented/maintained scoreboard and metrics by business function  \n•\tHP Customer Support Supply Chain Balanced Scorecard (PMMS) implementation. Coordinated Support Centers and Field Inventory excess review (4 support centers and 23 countries) for IPG  \n•\tLed recruiting of Jr. Supply Chain Analyst and mentored/coached on function \n•\tProvided expertise to IPG Supply Chain initiatives: financial modeling, scenario development, and sensitivity analysis. Performed WW inventory analysis, Distribution Center/Supply Chain metrics package. Standardized tools for project cost/benefit analysis for Colony (co-location), Unbundling Freight, High-Touch Ship Direct, Automatic Inventory Replenishment (AIR), E-commerce, etc.  \n•\tLed ESC Standard-Setting, SPaR/ASPIRE Planning/Reporting cycles for the Supply Chain, Logistics, and Supply Management groups  \n•\tCompleted an Accounts Payable interfaces implementation (PROMIS / PeopleSoft / SAP) on time/budget.  \n•\tBusiness re-engineering, IT configuration, and data migration for the acquisition and distribution of support materials. IT Project Manager Intel Corporation May 1996  –  July 1998  (2 years 3 months) Corporate Capital Acquisition •\tCompleted on time/budget 2 SAP implementation projects (FI, CO, AA, PS, and IM) \n•\tImproved project controls and reporting processes, adding real-time deliverable updates, metrics package, and automated and custom reporting \n•\tCoordinated activities of two project teams comprised of 12 members each \n•\tDeveloped/implemented ‘Equipment Decision ToolPak’ for Corporate Capital Acquisition. Now a \"Best Known Method\" for Intel, used in WW equipment selections of over $2 billion per year for all manufacturing. Primarily designed for: total cost analysis in tool selections (savings up to $100 million/yr.), total cost analysis of re-use (savings of $100,000 per factory), sensitivity analysis of variables for improvement projects and negotiation emphasis, monitoring improvement over time in cost/wafer-pass, documenting the impact of performance guarantees on total cost, etc. Finance Manager Association Francaise EJCSDJ December 1991  –  July 1995  (3 years 8 months) EMEA Offices (Geneva, Switzerland) •\tManaged operations of $25 million/yr. and Trained and managed 10 regional Accountants  \n•\tConceived and implemented centralized payment system for 5 regional operations, reducing processing time by 75% and eliminating double payments.  \n•\tDeveloped an electronic cash disbursement system with local banks, reducing processing time by 85% WW Business Manager Hewlett-Packard October 2007  – Present (7 years 11 months) Printing and Personal Systems WW Operations •\tResponsible for all PRIME Project Portfolio Management Web/SharePoint Design and Development \n•\tDrove Pan-HP Process Alignment, Led Business Process Engineering, Inventory Optimization Development \n•\tDelivered RoHS Process Improvement initiative, enabling $600M in annual revenue and significantly improving operating efficiency and decreasing overall program risk \n•\tRevolutionized Cost reduction Program Management - Designed and Implemented Enterprise Cost Management (ECM) Solution. Lean Sigma Black Belt process improvement implemented a simplified, standardized, centralized and automated PPS-wide cost reduction framework \n•\tConsistently delivered MIB cost savings above Targets for FY08 through FY12- a top strategic priority for HP \n•\tLed very large WW Team (30+) of partners from Manufacturing, Product Lines, Regions, etc.  \n•\tPartnered with PL30/WW Operations to aggressively drive DesignJet FFGI scope expansion and implementation acceleration worldwide \n•\tRepresented COS in benchmarking initiative and managed Warranty and EOL analysis projects. \n•\tLed multiple Global Trade projects (Restricted Materials Regulatory Requirements/Reclassification (Dangerous Goods), Signage Inks Change Management Process, Enterprise Risk Management, AES, etc.)  \n•\tServed as an ambassador to facilitate communication between Senior Management and Operations Teams WW Business Manager Hewlett-Packard October 2007  – Present (7 years 11 months) Printing and Personal Systems WW Operations •\tResponsible for all PRIME Project Portfolio Management Web/SharePoint Design and Development \n•\tDrove Pan-HP Process Alignment, Led Business Process Engineering, Inventory Optimization Development \n•\tDelivered RoHS Process Improvement initiative, enabling $600M in annual revenue and significantly improving operating efficiency and decreasing overall program risk \n•\tRevolutionized Cost reduction Program Management - Designed and Implemented Enterprise Cost Management (ECM) Solution. Lean Sigma Black Belt process improvement implemented a simplified, standardized, centralized and automated PPS-wide cost reduction framework \n•\tConsistently delivered MIB cost savings above Targets for FY08 through FY12- a top strategic priority for HP \n•\tLed very large WW Team (30+) of partners from Manufacturing, Product Lines, Regions, etc.  \n•\tPartnered with PL30/WW Operations to aggressively drive DesignJet FFGI scope expansion and implementation acceleration worldwide \n•\tRepresented COS in benchmarking initiative and managed Warranty and EOL analysis projects. \n•\tLed multiple Global Trade projects (Restricted Materials Regulatory Requirements/Reclassification (Dangerous Goods), Signage Inks Change Management Process, Enterprise Risk Management, AES, etc.)  \n•\tServed as an ambassador to facilitate communication between Senior Management and Operations Teams Category Operations Manager Hewlett-Packard October 2006  –  October 2007  (1 year 1 month) NA Region InkJet Supplies Operations •\tLed the transition from operational planning to \"end to end\" business management for NA Ink Supplies  \n•\tManaged relationship with Sonoco planning team for ink packaging capacity and supply planning \n•\tEnabled financial predictability by ensuring availability of Ink products. Proactively characterized and communicated issues and impact to customers / business through regular updates and ad-hoc communication  \n•\tDefined objectives, metrics, and Balanced Scorecard, recruited and mentored staff \n•\tCollaborated with cross-functional and worldwide partners to balance availability with cost by aggressively managing inventory to DOS targets throughout the supply chain  \n•\tLed the deployment of Regional SAP Planning Tools (Polaris DP, Polaris FGI, and Polaris FPU) Category Operations Manager Hewlett-Packard October 2006  –  October 2007  (1 year 1 month) NA Region InkJet Supplies Operations •\tLed the transition from operational planning to \"end to end\" business management for NA Ink Supplies  \n•\tManaged relationship with Sonoco planning team for ink packaging capacity and supply planning \n•\tEnabled financial predictability by ensuring availability of Ink products. Proactively characterized and communicated issues and impact to customers / business through regular updates and ad-hoc communication  \n•\tDefined objectives, metrics, and Balanced Scorecard, recruited and mentored staff \n•\tCollaborated with cross-functional and worldwide partners to balance availability with cost by aggressively managing inventory to DOS targets throughout the supply chain  \n•\tLed the deployment of Regional SAP Planning Tools (Polaris DP, Polaris FGI, and Polaris FPU) Category Operations Lead Hewlett-Packard February 2006  –  October 2006  (9 months) NA Region InkJet Supplies Operations •\tDelivered Supply Chain Transformation investigation / LEAN Pull-Manufacturing Pilot  \n•\tLed the Host planning relationship with Operations partners via forums, processes, and tools. Raised confidence in the Host and Trade Demand Aggregation processes \n•\tSuccessfully brought NPI’s to market via flawless execution & Supported Category Marketing & Field initiatives \n•\tAchieved ISO 9001 certification for NA Ink Supplies Business Operations, including process definition and documentation, identifying non-value-add work and ’leaning out’ core work flows Category Operations Lead Hewlett-Packard February 2006  –  October 2006  (9 months) NA Region InkJet Supplies Operations •\tDelivered Supply Chain Transformation investigation / LEAN Pull-Manufacturing Pilot  \n•\tLed the Host planning relationship with Operations partners via forums, processes, and tools. Raised confidence in the Host and Trade Demand Aggregation processes \n•\tSuccessfully brought NPI’s to market via flawless execution & Supported Category Marketing & Field initiatives \n•\tAchieved ISO 9001 certification for NA Ink Supplies Business Operations, including process definition and documentation, identifying non-value-add work and ’leaning out’ core work flows EMEA Region Business Manager Hewlett-Packard July 2004  –  February 2006  (1 year 8 months) Personal Systems Group-Mobile Computing Products •\tSuccessfully managed new products / features introduction (NPI) and refreshes and components rolls (CPE)  \n•\tLed regional cross-functional team to execute forecasting and supply/demand matching through end of life \n•\tLed regional factories’ set up for new products or capabilities introduction (customization) \n•\tDrove product quality and TAT performances in regional factories, through metrics and dashboard tracking \n•\tLed crisis management in case of quality and manufacturing issues \n•\tResponsible for quantum leap in GBU Supply Chain relationship and Regional factories engineering \n•\tParticipated in cross-functional projects as a supply chain engineering expert EMEA Region Business Manager Hewlett-Packard July 2004  –  February 2006  (1 year 8 months) Personal Systems Group-Mobile Computing Products •\tSuccessfully managed new products / features introduction (NPI) and refreshes and components rolls (CPE)  \n•\tLed regional cross-functional team to execute forecasting and supply/demand matching through end of life \n•\tLed regional factories’ set up for new products or capabilities introduction (customization) \n•\tDrove product quality and TAT performances in regional factories, through metrics and dashboard tracking \n•\tLed crisis management in case of quality and manufacturing issues \n•\tResponsible for quantum leap in GBU Supply Chain relationship and Regional factories engineering \n•\tParticipated in cross-functional projects as a supply chain engineering expert AMS Region Business Manager Hewlett-Packard July 2002  –  July 2004  (2 years 1 month) Imaging and Printing Group-InkJet Hardware •\tHighly successful management of ‘Big Bang’ NPIs and overall product lifecycle planning  \n•\tLed monthly cross-functional (Marketing/Operations/Finance) Category Plan-Of-Record planning process and optimized Go-To-Market business results, improved efficiency and decision-making through tool automation & process standardization  \n•\tLed regional cross-functional strategic Windows Planning forum to drive alignment of operational execution to IPG strategy  \n•\tDefined and executed inventory management strategies and goals to meet revenue, profitability, and inventory-driven cost objectives within a channel-collaborated planning environment (decreased inventory 37% YOY while maintaining service levels on target)  \n•\tProject management of regional customizations/bundles for IPG products. Led supply chain network analysis and POR with GBU and Supply Chain Ops.  \n•\tPerformed WOS analysis & recommendations, factory and depot responsiveness, & SKU proliferation  \n•\tOwned modeling of network design changes, proposed supply chain improvements, & category cost management- Led analysis into space/capacity planning \n•\tLed regional rebalancing initiatives and represented region in supply allocation management with worldwide teams AMS Region Business Manager Hewlett-Packard July 2002  –  July 2004  (2 years 1 month) Imaging and Printing Group-InkJet Hardware •\tHighly successful management of ‘Big Bang’ NPIs and overall product lifecycle planning  \n•\tLed monthly cross-functional (Marketing/Operations/Finance) Category Plan-Of-Record planning process and optimized Go-To-Market business results, improved efficiency and decision-making through tool automation & process standardization  \n•\tLed regional cross-functional strategic Windows Planning forum to drive alignment of operational execution to IPG strategy  \n•\tDefined and executed inventory management strategies and goals to meet revenue, profitability, and inventory-driven cost objectives within a channel-collaborated planning environment (decreased inventory 37% YOY while maintaining service levels on target)  \n•\tProject management of regional customizations/bundles for IPG products. Led supply chain network analysis and POR with GBU and Supply Chain Ops.  \n•\tPerformed WOS analysis & recommendations, factory and depot responsiveness, & SKU proliferation  \n•\tOwned modeling of network design changes, proposed supply chain improvements, & category cost management- Led analysis into space/capacity planning \n•\tLed regional rebalancing initiatives and represented region in supply allocation management with worldwide teams Senior Business Analyst Hewlett-Packard July 1998  –  July 2002  (4 years 1 month) LaserJet Customer Service and Support •\tDesigned/implemented/maintained scoreboard and metrics by business function  \n•\tHP Customer Support Supply Chain Balanced Scorecard (PMMS) implementation. Coordinated Support Centers and Field Inventory excess review (4 support centers and 23 countries) for IPG  \n•\tLed recruiting of Jr. Supply Chain Analyst and mentored/coached on function \n•\tProvided expertise to IPG Supply Chain initiatives: financial modeling, scenario development, and sensitivity analysis. Performed WW inventory analysis, Distribution Center/Supply Chain metrics package. Standardized tools for project cost/benefit analysis for Colony (co-location), Unbundling Freight, High-Touch Ship Direct, Automatic Inventory Replenishment (AIR), E-commerce, etc.  \n•\tLed ESC Standard-Setting, SPaR/ASPIRE Planning/Reporting cycles for the Supply Chain, Logistics, and Supply Management groups  \n•\tCompleted an Accounts Payable interfaces implementation (PROMIS / PeopleSoft / SAP) on time/budget.  \n•\tBusiness re-engineering, IT configuration, and data migration for the acquisition and distribution of support materials. Senior Business Analyst Hewlett-Packard July 1998  –  July 2002  (4 years 1 month) LaserJet Customer Service and Support •\tDesigned/implemented/maintained scoreboard and metrics by business function  \n•\tHP Customer Support Supply Chain Balanced Scorecard (PMMS) implementation. Coordinated Support Centers and Field Inventory excess review (4 support centers and 23 countries) for IPG  \n•\tLed recruiting of Jr. Supply Chain Analyst and mentored/coached on function \n•\tProvided expertise to IPG Supply Chain initiatives: financial modeling, scenario development, and sensitivity analysis. Performed WW inventory analysis, Distribution Center/Supply Chain metrics package. Standardized tools for project cost/benefit analysis for Colony (co-location), Unbundling Freight, High-Touch Ship Direct, Automatic Inventory Replenishment (AIR), E-commerce, etc.  \n•\tLed ESC Standard-Setting, SPaR/ASPIRE Planning/Reporting cycles for the Supply Chain, Logistics, and Supply Management groups  \n•\tCompleted an Accounts Payable interfaces implementation (PROMIS / PeopleSoft / SAP) on time/budget.  \n•\tBusiness re-engineering, IT configuration, and data migration for the acquisition and distribution of support materials. IT Project Manager Intel Corporation May 1996  –  July 1998  (2 years 3 months) Corporate Capital Acquisition •\tCompleted on time/budget 2 SAP implementation projects (FI, CO, AA, PS, and IM) \n•\tImproved project controls and reporting processes, adding real-time deliverable updates, metrics package, and automated and custom reporting \n•\tCoordinated activities of two project teams comprised of 12 members each \n•\tDeveloped/implemented ‘Equipment Decision ToolPak’ for Corporate Capital Acquisition. Now a \"Best Known Method\" for Intel, used in WW equipment selections of over $2 billion per year for all manufacturing. Primarily designed for: total cost analysis in tool selections (savings up to $100 million/yr.), total cost analysis of re-use (savings of $100,000 per factory), sensitivity analysis of variables for improvement projects and negotiation emphasis, monitoring improvement over time in cost/wafer-pass, documenting the impact of performance guarantees on total cost, etc. IT Project Manager Intel Corporation May 1996  –  July 1998  (2 years 3 months) Corporate Capital Acquisition •\tCompleted on time/budget 2 SAP implementation projects (FI, CO, AA, PS, and IM) \n•\tImproved project controls and reporting processes, adding real-time deliverable updates, metrics package, and automated and custom reporting \n•\tCoordinated activities of two project teams comprised of 12 members each \n•\tDeveloped/implemented ‘Equipment Decision ToolPak’ for Corporate Capital Acquisition. Now a \"Best Known Method\" for Intel, used in WW equipment selections of over $2 billion per year for all manufacturing. Primarily designed for: total cost analysis in tool selections (savings up to $100 million/yr.), total cost analysis of re-use (savings of $100,000 per factory), sensitivity analysis of variables for improvement projects and negotiation emphasis, monitoring improvement over time in cost/wafer-pass, documenting the impact of performance guarantees on total cost, etc. Finance Manager Association Francaise EJCSDJ December 1991  –  July 1995  (3 years 8 months) EMEA Offices (Geneva, Switzerland) •\tManaged operations of $25 million/yr. and Trained and managed 10 regional Accountants  \n•\tConceived and implemented centralized payment system for 5 regional operations, reducing processing time by 75% and eliminating double payments.  \n•\tDeveloped an electronic cash disbursement system with local banks, reducing processing time by 85% Finance Manager Association Francaise EJCSDJ December 1991  –  July 1995  (3 years 8 months) EMEA Offices (Geneva, Switzerland) •\tManaged operations of $25 million/yr. and Trained and managed 10 regional Accountants  \n•\tConceived and implemented centralized payment system for 5 regional operations, reducing processing time by 75% and eliminating double payments.  \n•\tDeveloped an electronic cash disbursement system with local banks, reducing processing time by 85% Languages French Native or bilingual proficiency English Native or bilingual proficiency Spanish Limited working proficiency German Limited working proficiency Danish Limited working proficiency Swedish Elementary proficiency Norwegian Elementary proficiency Italian Elementary proficiency French Native or bilingual proficiency English Native or bilingual proficiency Spanish Limited working proficiency German Limited working proficiency Danish Limited working proficiency Swedish Elementary proficiency Norwegian Elementary proficiency Italian Elementary proficiency French Native or bilingual proficiency English Native or bilingual proficiency Spanish Limited working proficiency German Limited working proficiency Danish Limited working proficiency Swedish Elementary proficiency Norwegian Elementary proficiency Italian Elementary proficiency Native or bilingual proficiency Native or bilingual proficiency Limited working proficiency Limited working proficiency Limited working proficiency Elementary proficiency Elementary proficiency Elementary proficiency Skills HP Channel Partners Service Delivery Cross-functional Team... Outsourcing Process Improvement Program Management Vendor Management Business Process... IT Service Management ITIL Cloud Computing PMP Enterprise Software Change Management Channel Supply Chain Management SharePoint Professional Services Software Documentation Solution Architecture Go-to-market Strategy Computer Hardware Troubleshooting Business Alliances Incident Management Partner Management IT Management Project Management Operational Excellence Excel Models Lean Six Sigma SAP SQL MS Project MS Office SharePoint... Visual Studio QlikView Minitab Visio ASQ Member Quality Management DMAIC Value Stream Mapping FMEA Agile Project Management Scrum See 33+     See less Skills  HP Channel Partners Service Delivery Cross-functional Team... Outsourcing Process Improvement Program Management Vendor Management Business Process... IT Service Management ITIL Cloud Computing PMP Enterprise Software Change Management Channel Supply Chain Management SharePoint Professional Services Software Documentation Solution Architecture Go-to-market Strategy Computer Hardware Troubleshooting Business Alliances Incident Management Partner Management IT Management Project Management Operational Excellence Excel Models Lean Six Sigma SAP SQL MS Project MS Office SharePoint... Visual Studio QlikView Minitab Visio ASQ Member Quality Management DMAIC Value Stream Mapping FMEA Agile Project Management Scrum See 33+     See less HP Channel Partners Service Delivery Cross-functional Team... Outsourcing Process Improvement Program Management Vendor Management Business Process... IT Service Management ITIL Cloud Computing PMP Enterprise Software Change Management Channel Supply Chain Management SharePoint Professional Services Software Documentation Solution Architecture Go-to-market Strategy Computer Hardware Troubleshooting Business Alliances Incident Management Partner Management IT Management Project Management Operational Excellence Excel Models Lean Six Sigma SAP SQL MS Project MS Office SharePoint... Visual Studio QlikView Minitab Visio ASQ Member Quality Management DMAIC Value Stream Mapping FMEA Agile Project Management Scrum See 33+     See less HP Channel Partners Service Delivery Cross-functional Team... Outsourcing Process Improvement Program Management Vendor Management Business Process... IT Service Management ITIL Cloud Computing PMP Enterprise Software Change Management Channel Supply Chain Management SharePoint Professional Services Software Documentation Solution Architecture Go-to-market Strategy Computer Hardware Troubleshooting Business Alliances Incident Management Partner Management IT Management Project Management Operational Excellence Excel Models Lean Six Sigma SAP SQL MS Project MS Office SharePoint... Visual Studio QlikView Minitab Visio ASQ Member Quality Management DMAIC Value Stream Mapping FMEA Agile Project Management Scrum See 33+     See less Education Brigham Young University International Relations / Business Management , 3.7 / 4.0 Activities and Societies:  Trustees Full Scholarship Recipient ,  National Merit Commended Scholar ,  Phi Beta Kappa ,  Who's Who ,  and Golden Key Nominee University of Arizona, Eller College of Management Industrial Engineering / Operations Management , 3.8 / 4.0 Activities and Societies:  GTA Full Scholarship Recipient ,  Dean's List ,  Beta Gamma Sigma Honors Brigham Young University International Relations / Business Management , 3.7 / 4.0 Activities and Societies:  Trustees Full Scholarship Recipient ,  National Merit Commended Scholar ,  Phi Beta Kappa ,  Who's Who ,  and Golden Key Nominee Brigham Young University International Relations / Business Management , 3.7 / 4.0 Activities and Societies:  Trustees Full Scholarship Recipient ,  National Merit Commended Scholar ,  Phi Beta Kappa ,  Who's Who ,  and Golden Key Nominee Brigham Young University International Relations / Business Management , 3.7 / 4.0 Activities and Societies:  Trustees Full Scholarship Recipient ,  National Merit Commended Scholar ,  Phi Beta Kappa ,  Who's Who ,  and Golden Key Nominee University of Arizona, Eller College of Management Industrial Engineering / Operations Management , 3.8 / 4.0 Activities and Societies:  GTA Full Scholarship Recipient ,  Dean's List ,  Beta Gamma Sigma Honors University of Arizona, Eller College of Management Industrial Engineering / Operations Management , 3.8 / 4.0 Activities and Societies:  GTA Full Scholarship Recipient ,  Dean's List ,  Beta Gamma Sigma Honors University of Arizona, Eller College of Management Industrial Engineering / Operations Management , 3.8 / 4.0 Activities and Societies:  GTA Full Scholarship Recipient ,  Dean's List ,  Beta Gamma Sigma Honors ", "Experience IT Project Manager Intel Corporation September 2012  – Present (3 years) IT Project Manager Intel Corporation September 2012  – Present (3 years) IT Project Manager Intel Corporation September 2012  – Present (3 years) Education Bradon Forest School 1991  – 1994 Bradon Forest School 1991  – 1994 Bradon Forest School 1991  – 1994 Bradon Forest School 1991  – 1994 ", "Experience Senior IT Project Manager Intel Corporation April 2014  – Present (1 year 5 months) Phoenix, Arizona Area Project Manager driving business transformation to support the strategic execution of corporate Agile strategy and initiatives. Directing activities to deliver fast, and cost effective results to support enterprise business & process optimization across the company. Currently managing a complex portfolio of business infrastructure projects with a combined budget of over $40M.  \nMentoring project coordinators in the following areas meaningful strategic analysis, evaluation of key business problems & presentation skills to business partners and senior executives.  \n IT Project Manager PayPal August 2010  –  March 2014  (3 years 8 months) Scottsdale, AZ Sr. Program Manager & Scrum Master consultant for PayPal Marketplaces (Java development). Leading distributed cross functional teams (Dev, QA, and Contractors) worldwide. In just two weeks of ram-up took over the day-to-day management of integration & migration of Merchant Reports from Actuate to IBM Cognos (a 4M+ USD project).  \n \nDrove the BI re-platforming projects affecting over 95K merchants across PayPal and eBay. Leading & directing teams to a rhythm of iterative results to reduce significant costs in licensing renewals and support. Addressing lateral and vertical communication keeping Sr. management abreast of progress, risks/mitigation and impediments. Leading cross team collaborations between fulltime and third party vendors staff (PayPal & IBM) in different geographies.  \n IT Project Manager Microsoft April 1998  –  July 2010  (12 years 4 months) Bellevue, WA •\tAs the Product Owner of Word application development Agile/Scrum processes were used in 1 to 2 week sprints based on stakeholder (Microsoft partners) deliverables, issues, complexity, enterprise impact, interfaces, and overall project objectives. \n•\tDrove business requirements for data warehousing, data integration, and the creation of canned and on-demand reports from disparate sources resulting in reporting that became a predictable and sustainable process, reducing delays, re-work and human error by 55%, enabling the creation of reports on demand using a single standard set of KPI parameters. \n•\tResponsible for driving business strategy and information warehousing and dashboards monitoring tools using formal methodologies (Agile, Scrum, CRM, MOF, etc. as appropriate to interface with Microsoft partner base). \n•\tDrove buy-off across decision makers, stakeholders and sponsors for a standard set of business goals (KPIs).  \n•\tDrove a comprehensive online content delivery & update strategy that includes a centralized repository for content and flexible file format. Digital media and print templates to ensure versatile design for multiple delivery mechanisms and device form factors.  \n Senior IT Project Manager Intel Corporation April 2014  – Present (1 year 5 months) Phoenix, Arizona Area Project Manager driving business transformation to support the strategic execution of corporate Agile strategy and initiatives. Directing activities to deliver fast, and cost effective results to support enterprise business & process optimization across the company. Currently managing a complex portfolio of business infrastructure projects with a combined budget of over $40M.  \nMentoring project coordinators in the following areas meaningful strategic analysis, evaluation of key business problems & presentation skills to business partners and senior executives.  \n Senior IT Project Manager Intel Corporation April 2014  – Present (1 year 5 months) Phoenix, Arizona Area Project Manager driving business transformation to support the strategic execution of corporate Agile strategy and initiatives. Directing activities to deliver fast, and cost effective results to support enterprise business & process optimization across the company. Currently managing a complex portfolio of business infrastructure projects with a combined budget of over $40M.  \nMentoring project coordinators in the following areas meaningful strategic analysis, evaluation of key business problems & presentation skills to business partners and senior executives.  \n IT Project Manager PayPal August 2010  –  March 2014  (3 years 8 months) Scottsdale, AZ Sr. Program Manager & Scrum Master consultant for PayPal Marketplaces (Java development). Leading distributed cross functional teams (Dev, QA, and Contractors) worldwide. In just two weeks of ram-up took over the day-to-day management of integration & migration of Merchant Reports from Actuate to IBM Cognos (a 4M+ USD project).  \n \nDrove the BI re-platforming projects affecting over 95K merchants across PayPal and eBay. Leading & directing teams to a rhythm of iterative results to reduce significant costs in licensing renewals and support. Addressing lateral and vertical communication keeping Sr. management abreast of progress, risks/mitigation and impediments. Leading cross team collaborations between fulltime and third party vendors staff (PayPal & IBM) in different geographies.  \n IT Project Manager PayPal August 2010  –  March 2014  (3 years 8 months) Scottsdale, AZ Sr. Program Manager & Scrum Master consultant for PayPal Marketplaces (Java development). Leading distributed cross functional teams (Dev, QA, and Contractors) worldwide. In just two weeks of ram-up took over the day-to-day management of integration & migration of Merchant Reports from Actuate to IBM Cognos (a 4M+ USD project).  \n \nDrove the BI re-platforming projects affecting over 95K merchants across PayPal and eBay. Leading & directing teams to a rhythm of iterative results to reduce significant costs in licensing renewals and support. Addressing lateral and vertical communication keeping Sr. management abreast of progress, risks/mitigation and impediments. Leading cross team collaborations between fulltime and third party vendors staff (PayPal & IBM) in different geographies.  \n IT Project Manager Microsoft April 1998  –  July 2010  (12 years 4 months) Bellevue, WA •\tAs the Product Owner of Word application development Agile/Scrum processes were used in 1 to 2 week sprints based on stakeholder (Microsoft partners) deliverables, issues, complexity, enterprise impact, interfaces, and overall project objectives. \n•\tDrove business requirements for data warehousing, data integration, and the creation of canned and on-demand reports from disparate sources resulting in reporting that became a predictable and sustainable process, reducing delays, re-work and human error by 55%, enabling the creation of reports on demand using a single standard set of KPI parameters. \n•\tResponsible for driving business strategy and information warehousing and dashboards monitoring tools using formal methodologies (Agile, Scrum, CRM, MOF, etc. as appropriate to interface with Microsoft partner base). \n•\tDrove buy-off across decision makers, stakeholders and sponsors for a standard set of business goals (KPIs).  \n•\tDrove a comprehensive online content delivery & update strategy that includes a centralized repository for content and flexible file format. Digital media and print templates to ensure versatile design for multiple delivery mechanisms and device form factors.  \n IT Project Manager Microsoft April 1998  –  July 2010  (12 years 4 months) Bellevue, WA •\tAs the Product Owner of Word application development Agile/Scrum processes were used in 1 to 2 week sprints based on stakeholder (Microsoft partners) deliverables, issues, complexity, enterprise impact, interfaces, and overall project objectives. \n•\tDrove business requirements for data warehousing, data integration, and the creation of canned and on-demand reports from disparate sources resulting in reporting that became a predictable and sustainable process, reducing delays, re-work and human error by 55%, enabling the creation of reports on demand using a single standard set of KPI parameters. \n•\tResponsible for driving business strategy and information warehousing and dashboards monitoring tools using formal methodologies (Agile, Scrum, CRM, MOF, etc. as appropriate to interface with Microsoft partner base). \n•\tDrove buy-off across decision makers, stakeholders and sponsors for a standard set of business goals (KPIs).  \n•\tDrove a comprehensive online content delivery & update strategy that includes a centralized repository for content and flexible file format. Digital media and print templates to ensure versatile design for multiple delivery mechanisms and device form factors.  \n ", "Skills IT Service Management Intel Integration Agile Methodologies Cloud Computing Testing Program Management Software Development Requirements Analysis IT Management Oracle Software Engineering Product Management Cross-functional Team... System Architecture Management Software Project... ITIL Semiconductors Process Improvement Unix SQL Data Center Perl Business Process... SDLC Linux Project Management Business Intelligence Architecture See 15+     See less Skills  IT Service Management Intel Integration Agile Methodologies Cloud Computing Testing Program Management Software Development Requirements Analysis IT Management Oracle Software Engineering Product Management Cross-functional Team... System Architecture Management Software Project... ITIL Semiconductors Process Improvement Unix SQL Data Center Perl Business Process... SDLC Linux Project Management Business Intelligence Architecture See 15+     See less IT Service Management Intel Integration Agile Methodologies Cloud Computing Testing Program Management Software Development Requirements Analysis IT Management Oracle Software Engineering Product Management Cross-functional Team... System Architecture Management Software Project... ITIL Semiconductors Process Improvement Unix SQL Data Center Perl Business Process... SDLC Linux Project Management Business Intelligence Architecture See 15+     See less IT Service Management Intel Integration Agile Methodologies Cloud Computing Testing Program Management Software Development Requirements Analysis IT Management Oracle Software Engineering Product Management Cross-functional Team... System Architecture Management Software Project... ITIL Semiconductors Process Improvement Unix SQL Data Center Perl Business Process... SDLC Linux Project Management Business Intelligence Architecture See 15+     See less "]}