{"position": "Lead Design Engineer", "company": "Intel Corporation", "profiles": ["Experience California Regional Design Manager Intel Corporation September 2013  – Present (2 years) Santa Clara, CA Mechanical, Process, Instrumentation/Controls, IT, and Life Safety Systems Lead Design Engineer Intel Corporation February 2013  –  September 2013  (8 months) Santa Clara, CA Innovation Team Lead Engineer Intel Corporation February 2012  –  February 2013  (1 year 1 month) Chandler, AZ Mechanical Engineering Design Lead Intel Corporation January 2011  –  February 2012  (1 year 2 months) Chandler, AZ Tool Install Design Engineer Intel Corporation January 2010  –  January 2011  (1 year 1 month) Chandler, AZ Experimental Turbulent Fluid Dynamics Lab Graduate Research Assistant University of Arizona August 2007  –  December 2009  (2 years 5 months) • Designed and fabricated a 26 foot tall 10,000 lbs steel drop tower that utilizes linear induction motors and permanent magnet brakes.  \n• Performed tests on two stratified fluids of different densities accelerated downwards using the linear induction motors to generate the Rayleigh-Taylor fluid instability \n• Communicated with peers, professors, machinists, electricians, welders, and customer representatives throughout the design process of the project \n• Extensive use of Solidworks for computer modeling and COSMOS for Finite Element Analysis (FEA) \n• Presented to leaders in turbulent fluid dynamics at the 2009 American Physical Society's Division of Fluid Dynamics Conference \n• Research was funded by Lawrence Livermore National Laboratory and Los Alamos National Laboratory \n• Earned the 2009 Outstanding Graduate Student award for the Mechanical Engineering Department Senior Design Project Team Member Ventana Medical Systems August 2006  –  May 2007  (10 months) • Designed a manifold for distributing various fluids to the Symphony slide staining system \n• Designed a mechanism for engaging and disengaging the manifold with the Symphony system \n• Custom designed filters to decrease failures and leaks in order to decrease maintenance costs and increase profits Mechanical Engineer LUX Aviation Engineering Corporation September 2006  –  January 2007  (5 months) • Designed custom lithium battery housings for helicopters, private jets, and various other aircraft \n• Modeled designs in Solidworks and performed finite element analysis using COSMOS \n• Spoke with customers in order to determine specific needs and specifications to be implemented into the designs Summer Research Associate University of Minnesota June 2006  –  August 2006  (3 months) • Performed research on carbon nanotubes and their application as a carbon dioxide gas sensor \n• Developed a chemical coating process for adhering carbon nanotubes to smooth surfaces without affecting their ability to capture CO2 molecules \n• Systematically tested the conductivity of a cluster of carbon nanotubes exposed to various concentrations of carbon dioxide in order to determine a relationship between conductivity and carbon dioxide concentration California Regional Design Manager Intel Corporation September 2013  – Present (2 years) Santa Clara, CA California Regional Design Manager Intel Corporation September 2013  – Present (2 years) Santa Clara, CA Mechanical, Process, Instrumentation/Controls, IT, and Life Safety Systems Lead Design Engineer Intel Corporation February 2013  –  September 2013  (8 months) Santa Clara, CA Mechanical, Process, Instrumentation/Controls, IT, and Life Safety Systems Lead Design Engineer Intel Corporation February 2013  –  September 2013  (8 months) Santa Clara, CA Innovation Team Lead Engineer Intel Corporation February 2012  –  February 2013  (1 year 1 month) Chandler, AZ Innovation Team Lead Engineer Intel Corporation February 2012  –  February 2013  (1 year 1 month) Chandler, AZ Mechanical Engineering Design Lead Intel Corporation January 2011  –  February 2012  (1 year 2 months) Chandler, AZ Mechanical Engineering Design Lead Intel Corporation January 2011  –  February 2012  (1 year 2 months) Chandler, AZ Tool Install Design Engineer Intel Corporation January 2010  –  January 2011  (1 year 1 month) Chandler, AZ Tool Install Design Engineer Intel Corporation January 2010  –  January 2011  (1 year 1 month) Chandler, AZ Experimental Turbulent Fluid Dynamics Lab Graduate Research Assistant University of Arizona August 2007  –  December 2009  (2 years 5 months) • Designed and fabricated a 26 foot tall 10,000 lbs steel drop tower that utilizes linear induction motors and permanent magnet brakes.  \n• Performed tests on two stratified fluids of different densities accelerated downwards using the linear induction motors to generate the Rayleigh-Taylor fluid instability \n• Communicated with peers, professors, machinists, electricians, welders, and customer representatives throughout the design process of the project \n• Extensive use of Solidworks for computer modeling and COSMOS for Finite Element Analysis (FEA) \n• Presented to leaders in turbulent fluid dynamics at the 2009 American Physical Society's Division of Fluid Dynamics Conference \n• Research was funded by Lawrence Livermore National Laboratory and Los Alamos National Laboratory \n• Earned the 2009 Outstanding Graduate Student award for the Mechanical Engineering Department Experimental Turbulent Fluid Dynamics Lab Graduate Research Assistant University of Arizona August 2007  –  December 2009  (2 years 5 months) • Designed and fabricated a 26 foot tall 10,000 lbs steel drop tower that utilizes linear induction motors and permanent magnet brakes.  \n• Performed tests on two stratified fluids of different densities accelerated downwards using the linear induction motors to generate the Rayleigh-Taylor fluid instability \n• Communicated with peers, professors, machinists, electricians, welders, and customer representatives throughout the design process of the project \n• Extensive use of Solidworks for computer modeling and COSMOS for Finite Element Analysis (FEA) \n• Presented to leaders in turbulent fluid dynamics at the 2009 American Physical Society's Division of Fluid Dynamics Conference \n• Research was funded by Lawrence Livermore National Laboratory and Los Alamos National Laboratory \n• Earned the 2009 Outstanding Graduate Student award for the Mechanical Engineering Department Senior Design Project Team Member Ventana Medical Systems August 2006  –  May 2007  (10 months) • Designed a manifold for distributing various fluids to the Symphony slide staining system \n• Designed a mechanism for engaging and disengaging the manifold with the Symphony system \n• Custom designed filters to decrease failures and leaks in order to decrease maintenance costs and increase profits Senior Design Project Team Member Ventana Medical Systems August 2006  –  May 2007  (10 months) • Designed a manifold for distributing various fluids to the Symphony slide staining system \n• Designed a mechanism for engaging and disengaging the manifold with the Symphony system \n• Custom designed filters to decrease failures and leaks in order to decrease maintenance costs and increase profits Mechanical Engineer LUX Aviation Engineering Corporation September 2006  –  January 2007  (5 months) • Designed custom lithium battery housings for helicopters, private jets, and various other aircraft \n• Modeled designs in Solidworks and performed finite element analysis using COSMOS \n• Spoke with customers in order to determine specific needs and specifications to be implemented into the designs Mechanical Engineer LUX Aviation Engineering Corporation September 2006  –  January 2007  (5 months) • Designed custom lithium battery housings for helicopters, private jets, and various other aircraft \n• Modeled designs in Solidworks and performed finite element analysis using COSMOS \n• Spoke with customers in order to determine specific needs and specifications to be implemented into the designs Summer Research Associate University of Minnesota June 2006  –  August 2006  (3 months) • Performed research on carbon nanotubes and their application as a carbon dioxide gas sensor \n• Developed a chemical coating process for adhering carbon nanotubes to smooth surfaces without affecting their ability to capture CO2 molecules \n• Systematically tested the conductivity of a cluster of carbon nanotubes exposed to various concentrations of carbon dioxide in order to determine a relationship between conductivity and carbon dioxide concentration Summer Research Associate University of Minnesota June 2006  –  August 2006  (3 months) • Performed research on carbon nanotubes and their application as a carbon dioxide gas sensor \n• Developed a chemical coating process for adhering carbon nanotubes to smooth surfaces without affecting their ability to capture CO2 molecules \n• Systematically tested the conductivity of a cluster of carbon nanotubes exposed to various concentrations of carbon dioxide in order to determine a relationship between conductivity and carbon dioxide concentration Skills Project Management Design Engineering Manufacturing... Solidworks Finite Element Analysis Mechanical Engineering Robotics Engineering Pro Engineer Design of Experiments Matlab CAD Heat Transfer Labview GD&T Machining Simulink Engineering Management Sensors SPC Fluid Mechanics Mathematica Simulations ANSYS Fortran Fluid Dynamics Semiconductor Industry Failure Analysis See 13+     See less Skills  Project Management Design Engineering Manufacturing... Solidworks Finite Element Analysis Mechanical Engineering Robotics Engineering Pro Engineer Design of Experiments Matlab CAD Heat Transfer Labview GD&T Machining Simulink Engineering Management Sensors SPC Fluid Mechanics Mathematica Simulations ANSYS Fortran Fluid Dynamics Semiconductor Industry Failure Analysis See 13+     See less Project Management Design Engineering Manufacturing... Solidworks Finite Element Analysis Mechanical Engineering Robotics Engineering Pro Engineer Design of Experiments Matlab CAD Heat Transfer Labview GD&T Machining Simulink Engineering Management Sensors SPC Fluid Mechanics Mathematica Simulations ANSYS Fortran Fluid Dynamics Semiconductor Industry Failure Analysis See 13+     See less Project Management Design Engineering Manufacturing... Solidworks Finite Element Analysis Mechanical Engineering Robotics Engineering Pro Engineer Design of Experiments Matlab CAD Heat Transfer Labview GD&T Machining Simulink Engineering Management Sensors SPC Fluid Mechanics Mathematica Simulations ANSYS Fortran Fluid Dynamics Semiconductor Industry Failure Analysis See 13+     See less Education University of Arizona Master's,  Mechanical Engineering 2007  – 2009 Activities and Societies:  Research Assistant in the Experimental Fluids Lab University of Arizona Bachelor's,  Mechanical Engineering 2003  – 2007 Graduated Magna Cum Laude Activities and Societies:  Tau Beta Pi: Engineering Honors Society ,  Society of Automotive Engineers University of Arizona Master's,  Mechanical Engineering 2007  – 2009 Activities and Societies:  Research Assistant in the Experimental Fluids Lab University of Arizona Master's,  Mechanical Engineering 2007  – 2009 Activities and Societies:  Research Assistant in the Experimental Fluids Lab University of Arizona Master's,  Mechanical Engineering 2007  – 2009 Activities and Societies:  Research Assistant in the Experimental Fluids Lab University of Arizona Bachelor's,  Mechanical Engineering 2003  – 2007 Graduated Magna Cum Laude Activities and Societies:  Tau Beta Pi: Engineering Honors Society ,  Society of Automotive Engineers University of Arizona Bachelor's,  Mechanical Engineering 2003  – 2007 Graduated Magna Cum Laude Activities and Societies:  Tau Beta Pi: Engineering Honors Society ,  Society of Automotive Engineers University of Arizona Bachelor's,  Mechanical Engineering 2003  – 2007 Graduated Magna Cum Laude Activities and Societies:  Tau Beta Pi: Engineering Honors Society ,  Society of Automotive Engineers Honors & Awards Additional Honors & Awards • Outstanding Graduate Student: 2009 \n• Academic Distinction Award Recipient: 2006 \n• Departmental Honors Award Recipient: 2006 \n• Corresponding Secretary for Tau Beta Pi: 2006-2007 \n• Highest Academic Distinction Award Recipient: 2005 Additional Honors & Awards • Outstanding Graduate Student: 2009 \n• Academic Distinction Award Recipient: 2006 \n• Departmental Honors Award Recipient: 2006 \n• Corresponding Secretary for Tau Beta Pi: 2006-2007 \n• Highest Academic Distinction Award Recipient: 2005 Additional Honors & Awards • Outstanding Graduate Student: 2009 \n• Academic Distinction Award Recipient: 2006 \n• Departmental Honors Award Recipient: 2006 \n• Corresponding Secretary for Tau Beta Pi: 2006-2007 \n• Highest Academic Distinction Award Recipient: 2005 Additional Honors & Awards • Outstanding Graduate Student: 2009 \n• Academic Distinction Award Recipient: 2006 \n• Departmental Honors Award Recipient: 2006 \n• Corresponding Secretary for Tau Beta Pi: 2006-2007 \n• Highest Academic Distinction Award Recipient: 2005 ", "Summary Technical lead for defining circuit quality requirements, circuit quality sign off requirements, and refine technical requirements to balance quality and effort trade-off. Technical lead and manager for on-chip interconnect section for multiple Xeon products. Previous design experience include lead designer for multiple Itanium ALU projects which includes overall topology for multi-gigahertz design for ALU functional blocks and large multiport register files. Summary Technical lead for defining circuit quality requirements, circuit quality sign off requirements, and refine technical requirements to balance quality and effort trade-off. Technical lead and manager for on-chip interconnect section for multiple Xeon products. Previous design experience include lead designer for multiple Itanium ALU projects which includes overall topology for multi-gigahertz design for ALU functional blocks and large multiport register files. Technical lead for defining circuit quality requirements, circuit quality sign off requirements, and refine technical requirements to balance quality and effort trade-off. Technical lead and manager for on-chip interconnect section for multiple Xeon products. Previous design experience include lead designer for multiple Itanium ALU projects which includes overall topology for multi-gigahertz design for ALU functional blocks and large multiport register files. Technical lead for defining circuit quality requirements, circuit quality sign off requirements, and refine technical requirements to balance quality and effort trade-off. Technical lead and manager for on-chip interconnect section for multiple Xeon products. Previous design experience include lead designer for multiple Itanium ALU projects which includes overall topology for multi-gigahertz design for ALU functional blocks and large multiport register files. Experience Technical Lead and Engineering Manager Intel Corporation January 2013  – Present (2 years 8 months) Santa Clara, CA Working on next generation Xeon server processor. Technical lead for defining circuit quality requirements, circuit quality sign off requirements, and refine technical requirements to balance quality and effort trade-off \n•\tResponsible for overall circuit quality milestone definition and define circuit quality sign off requirement. Responsible for overall quality sign off process and tracking quality for completion and handling of exceptions \n•\tDrove task force to define quality metric and to define and resolve technical issues to achieve consistent quality across the project \n•\tCompile circuit quality metric and overall progress of design convergence through scripts that compile key metrics of all design blocks. This includes timing, reliability, cell usage, and power. The resulting data enables decision based on trending and measure effectiveness of methodology. \n•\tInterface with CAD tool leads to define requirements and ensure comprehensive coverage across circuit timing and reliability Engineering Manager Intel Corporation January 2010  –  December 2012  (3 years) Santa Clara, CA Worked on Xeon Server Processor code named Ivytown (Xeon E7 v2, Core i7 Extreme, Ivybridge 6-15 core) - Technical lead and manager of ring interface to PCI express and QPI and responsible for circuit quality sign off for custom circuits \n•\tLead a team of 15 circuit designers and 5 layout designers on the circuit design of the ring interface section. Responsibilities included technical design lead, design of section floorplan and circuit topology based on critical logic, planning and schedule, interface to RTL team, and driving convergence \n•\tResponsible for drafting quality milestone definition for custom circuits, define milestone quality sign off requirement and process, review sign off waivers reduce effort while maintaining quality \n•\tInterface with post silicon team on design issues to define the course of action for to root cause the design issue and define fix to ensure all related violations are fixed Engineering Manager Intel Corporation January 2006  –  December 2009  (4 years) Santa Clara, CA Xeon CPU Design Nehalem EX – Technical lead and manager of ring interface to QPI and memory controller \n• Lead a team of 10 circuit designers and layout designers of the ring interface. Responsibilities included leading the definition of the block design, section floorplan and top level design, managing the team of engineer and layout designers, planning and schedule, and interface to RTL team. \n• The ring interface section had significant new design and timing challenges. Despite the challenges, this section became the first section to complete design even with tight staffing and less experienced design team \n• Pathfinding for integer and floating-point execution unit of a x86 CPU with vector unit. Evaluated overall floorplan for optimal area and frequency. Lead Design Engineer Intel Corporation June 1993  –  December 2006  (13 years 7 months) Santa Clara Design lead for integer execution unit on multiple generations of the Itanium processors \n• Itanium CPU - Lead designer of multi-gigahertz integer execution unit – including the overall floorplan, simulation of major critical paths to define frequency for the CPU, design of major functional blocks including adder, bypass block and large multi-port integer register file. Drove most major convergence requirement including timing, noise analysis, and design convergence. \n• Definition and evaluation ALU design for multiple Itanium project to evaluate frequency and area to maximize performance Technical Lead and Engineering Manager Intel Corporation January 2013  – Present (2 years 8 months) Santa Clara, CA Working on next generation Xeon server processor. Technical lead for defining circuit quality requirements, circuit quality sign off requirements, and refine technical requirements to balance quality and effort trade-off \n•\tResponsible for overall circuit quality milestone definition and define circuit quality sign off requirement. Responsible for overall quality sign off process and tracking quality for completion and handling of exceptions \n•\tDrove task force to define quality metric and to define and resolve technical issues to achieve consistent quality across the project \n•\tCompile circuit quality metric and overall progress of design convergence through scripts that compile key metrics of all design blocks. This includes timing, reliability, cell usage, and power. The resulting data enables decision based on trending and measure effectiveness of methodology. \n•\tInterface with CAD tool leads to define requirements and ensure comprehensive coverage across circuit timing and reliability Technical Lead and Engineering Manager Intel Corporation January 2013  – Present (2 years 8 months) Santa Clara, CA Working on next generation Xeon server processor. Technical lead for defining circuit quality requirements, circuit quality sign off requirements, and refine technical requirements to balance quality and effort trade-off \n•\tResponsible for overall circuit quality milestone definition and define circuit quality sign off requirement. Responsible for overall quality sign off process and tracking quality for completion and handling of exceptions \n•\tDrove task force to define quality metric and to define and resolve technical issues to achieve consistent quality across the project \n•\tCompile circuit quality metric and overall progress of design convergence through scripts that compile key metrics of all design blocks. This includes timing, reliability, cell usage, and power. The resulting data enables decision based on trending and measure effectiveness of methodology. \n•\tInterface with CAD tool leads to define requirements and ensure comprehensive coverage across circuit timing and reliability Engineering Manager Intel Corporation January 2010  –  December 2012  (3 years) Santa Clara, CA Worked on Xeon Server Processor code named Ivytown (Xeon E7 v2, Core i7 Extreme, Ivybridge 6-15 core) - Technical lead and manager of ring interface to PCI express and QPI and responsible for circuit quality sign off for custom circuits \n•\tLead a team of 15 circuit designers and 5 layout designers on the circuit design of the ring interface section. Responsibilities included technical design lead, design of section floorplan and circuit topology based on critical logic, planning and schedule, interface to RTL team, and driving convergence \n•\tResponsible for drafting quality milestone definition for custom circuits, define milestone quality sign off requirement and process, review sign off waivers reduce effort while maintaining quality \n•\tInterface with post silicon team on design issues to define the course of action for to root cause the design issue and define fix to ensure all related violations are fixed Engineering Manager Intel Corporation January 2010  –  December 2012  (3 years) Santa Clara, CA Worked on Xeon Server Processor code named Ivytown (Xeon E7 v2, Core i7 Extreme, Ivybridge 6-15 core) - Technical lead and manager of ring interface to PCI express and QPI and responsible for circuit quality sign off for custom circuits \n•\tLead a team of 15 circuit designers and 5 layout designers on the circuit design of the ring interface section. Responsibilities included technical design lead, design of section floorplan and circuit topology based on critical logic, planning and schedule, interface to RTL team, and driving convergence \n•\tResponsible for drafting quality milestone definition for custom circuits, define milestone quality sign off requirement and process, review sign off waivers reduce effort while maintaining quality \n•\tInterface with post silicon team on design issues to define the course of action for to root cause the design issue and define fix to ensure all related violations are fixed Engineering Manager Intel Corporation January 2006  –  December 2009  (4 years) Santa Clara, CA Xeon CPU Design Nehalem EX – Technical lead and manager of ring interface to QPI and memory controller \n• Lead a team of 10 circuit designers and layout designers of the ring interface. Responsibilities included leading the definition of the block design, section floorplan and top level design, managing the team of engineer and layout designers, planning and schedule, and interface to RTL team. \n• The ring interface section had significant new design and timing challenges. Despite the challenges, this section became the first section to complete design even with tight staffing and less experienced design team \n• Pathfinding for integer and floating-point execution unit of a x86 CPU with vector unit. Evaluated overall floorplan for optimal area and frequency. Engineering Manager Intel Corporation January 2006  –  December 2009  (4 years) Santa Clara, CA Xeon CPU Design Nehalem EX – Technical lead and manager of ring interface to QPI and memory controller \n• Lead a team of 10 circuit designers and layout designers of the ring interface. Responsibilities included leading the definition of the block design, section floorplan and top level design, managing the team of engineer and layout designers, planning and schedule, and interface to RTL team. \n• The ring interface section had significant new design and timing challenges. Despite the challenges, this section became the first section to complete design even with tight staffing and less experienced design team \n• Pathfinding for integer and floating-point execution unit of a x86 CPU with vector unit. Evaluated overall floorplan for optimal area and frequency. Lead Design Engineer Intel Corporation June 1993  –  December 2006  (13 years 7 months) Santa Clara Design lead for integer execution unit on multiple generations of the Itanium processors \n• Itanium CPU - Lead designer of multi-gigahertz integer execution unit – including the overall floorplan, simulation of major critical paths to define frequency for the CPU, design of major functional blocks including adder, bypass block and large multi-port integer register file. Drove most major convergence requirement including timing, noise analysis, and design convergence. \n• Definition and evaluation ALU design for multiple Itanium project to evaluate frequency and area to maximize performance Lead Design Engineer Intel Corporation June 1993  –  December 2006  (13 years 7 months) Santa Clara Design lead for integer execution unit on multiple generations of the Itanium processors \n• Itanium CPU - Lead designer of multi-gigahertz integer execution unit – including the overall floorplan, simulation of major critical paths to define frequency for the CPU, design of major functional blocks including adder, bypass block and large multi-port integer register file. Drove most major convergence requirement including timing, noise analysis, and design convergence. \n• Definition and evaluation ALU design for multiple Itanium project to evaluate frequency and area to maximize performance Languages English Native or bilingual proficiency Chinese English Native or bilingual proficiency Chinese English Native or bilingual proficiency Chinese Native or bilingual proficiency Skills Static Timing Analysis VLSI Microprocessors Perl Timing Closure Circuit Design Skills  Static Timing Analysis VLSI Microprocessors Perl Timing Closure Circuit Design Static Timing Analysis VLSI Microprocessors Perl Timing Closure Circuit Design Static Timing Analysis VLSI Microprocessors Perl Timing Closure Circuit Design Education University of California, Irvine MS,  Electrical and Computer Engineering University of California, Berkeley Bachelor of Science (BS),  Electrical Engineering and Computer Science ,  Material Science Double major - Electrical Engineering Computer Science and Material Science and Engineering University of California, Irvine MS,  Electrical and Computer Engineering University of California, Irvine MS,  Electrical and Computer Engineering University of California, Irvine MS,  Electrical and Computer Engineering University of California, Berkeley Bachelor of Science (BS),  Electrical Engineering and Computer Science ,  Material Science Double major - Electrical Engineering Computer Science and Material Science and Engineering University of California, Berkeley Bachelor of Science (BS),  Electrical Engineering and Computer Science ,  Material Science Double major - Electrical Engineering Computer Science and Material Science and Engineering University of California, Berkeley Bachelor of Science (BS),  Electrical Engineering and Computer Science ,  Material Science Double major - Electrical Engineering Computer Science and Material Science and Engineering ", "Summary 15+ years of experience in microprocessor cache and memory subsystem design. \n \n5 generations of microprocessor tester and system debug experience. \n \nStrong knowledge of DFX tools such as OCLA, ODCS, LCP, SCAN/SCANOUT, Array DFT, etc.  \n \nAble to work closely with validation, DFX, and circuit teams from technology readiness phase to  \nproduct launch. Summary 15+ years of experience in microprocessor cache and memory subsystem design. \n \n5 generations of microprocessor tester and system debug experience. \n \nStrong knowledge of DFX tools such as OCLA, ODCS, LCP, SCAN/SCANOUT, Array DFT, etc.  \n \nAble to work closely with validation, DFX, and circuit teams from technology readiness phase to  \nproduct launch. 15+ years of experience in microprocessor cache and memory subsystem design. \n \n5 generations of microprocessor tester and system debug experience. \n \nStrong knowledge of DFX tools such as OCLA, ODCS, LCP, SCAN/SCANOUT, Array DFT, etc.  \n \nAble to work closely with validation, DFX, and circuit teams from technology readiness phase to  \nproduct launch. 15+ years of experience in microprocessor cache and memory subsystem design. \n \n5 generations of microprocessor tester and system debug experience. \n \nStrong knowledge of DFX tools such as OCLA, ODCS, LCP, SCAN/SCANOUT, Array DFT, etc.  \n \nAble to work closely with validation, DFX, and circuit teams from technology readiness phase to  \nproduct launch. Experience Lead Design Engineer Intel Corporation April 1996  – Present (19 years 5 months) Santa Clara, CA 01/2013 - Present \nLed a team in architecting and designing a mesh fabric to connect the memory controller to the rest of the system agents. \n \n05/2011 - 12/2012 \nBox lead for a team that designed the ring and caching agents for the 15-core XEON EX (Ivytown) microprocessor. \n \n12/2009 - 04/2011 \nDesigned and implemented solutions to standardize HVM testing and ATPG coverage across 600 register files and the 37.5 MB last level cache (LLC) on the Ivytown EX multi-core single die Xeon processor. Lead Design Engineer Intel Corporation April 1996  – Present (19 years 5 months) Santa Clara, CA 01/2013 - Present \nLed a team in architecting and designing a mesh fabric to connect the memory controller to the rest of the system agents. \n \n05/2011 - 12/2012 \nBox lead for a team that designed the ring and caching agents for the 15-core XEON EX (Ivytown) microprocessor. \n \n12/2009 - 04/2011 \nDesigned and implemented solutions to standardize HVM testing and ATPG coverage across 600 register files and the 37.5 MB last level cache (LLC) on the Ivytown EX multi-core single die Xeon processor. Lead Design Engineer Intel Corporation April 1996  – Present (19 years 5 months) Santa Clara, CA 01/2013 - Present \nLed a team in architecting and designing a mesh fabric to connect the memory controller to the rest of the system agents. \n \n05/2011 - 12/2012 \nBox lead for a team that designed the ring and caching agents for the 15-core XEON EX (Ivytown) microprocessor. \n \n12/2009 - 04/2011 \nDesigned and implemented solutions to standardize HVM testing and ATPG coverage across 600 register files and the 37.5 MB last level cache (LLC) on the Ivytown EX multi-core single die Xeon processor. Skills Cache Coherency RAS Cache Design Home Agent Design DFX Silicon Validation Computer System... Semiconductor Failure... Skills  Cache Coherency RAS Cache Design Home Agent Design DFX Silicon Validation Computer System... Semiconductor Failure... Cache Coherency RAS Cache Design Home Agent Design DFX Silicon Validation Computer System... Semiconductor Failure... Cache Coherency RAS Cache Design Home Agent Design DFX Silicon Validation Computer System... Semiconductor Failure... Education Cal Poly Pomona Master of Science (MS),  Electrical and Electronics Engineering 1991  – 1996 Cal Poly Pomona Master of Science (MS),  Electrical and Electronics Engineering 1991  – 1996 Cal Poly Pomona Master of Science (MS),  Electrical and Electronics Engineering 1991  – 1996 Cal Poly Pomona Master of Science (MS),  Electrical and Electronics Engineering 1991  – 1996 ", "Experience Staff Design Engr Broadcom Principal Design Engineer Broadcom March 2012  – Present (3 years 6 months) Singapore Sr. Staff Design Engineer Broadcom October 2007  – Present (7 years 11 months) Lead Design Engineer Intel Corporation April 2002  –  October 2007  (5 years 7 months) Staff Design Engr Broadcom Staff Design Engr Broadcom Principal Design Engineer Broadcom March 2012  – Present (3 years 6 months) Singapore Principal Design Engineer Broadcom March 2012  – Present (3 years 6 months) Singapore Sr. Staff Design Engineer Broadcom October 2007  – Present (7 years 11 months) Sr. Staff Design Engineer Broadcom October 2007  – Present (7 years 11 months) Lead Design Engineer Intel Corporation April 2002  –  October 2007  (5 years 7 months) Lead Design Engineer Intel Corporation April 2002  –  October 2007  (5 years 7 months) Education University of Missouri-Rolla M. S.,  Electrical Engineering 1998  – 2000 University of Mumbai B. E.,  Electronics 1993  – 1997 University of Missouri-Rolla M. S.,  Electrical Engineering 1998  – 2000 University of Missouri-Rolla M. S.,  Electrical Engineering 1998  – 2000 University of Missouri-Rolla M. S.,  Electrical Engineering 1998  – 2000 University of Mumbai B. E.,  Electronics 1993  – 1997 University of Mumbai B. E.,  Electronics 1993  – 1997 University of Mumbai B. E.,  Electronics 1993  – 1997 ", "Summary Hands-on experience with several aspects of silicon hardware development including analog design, digital design, pre-silicon digital and mixed-signal validation, full chip integration, and post-silicon lab bring-up. Projects have ranged from forward looking architecture studies to core product development with a strong track record of successful tape-outs.  \n \nCurrently part of a consumer product silicon engineering team working on power management for future Intel products.Previous technical contributions to high-speed serial I/O (PCIe, QPI) analog front-end and protocol development. Summary Hands-on experience with several aspects of silicon hardware development including analog design, digital design, pre-silicon digital and mixed-signal validation, full chip integration, and post-silicon lab bring-up. Projects have ranged from forward looking architecture studies to core product development with a strong track record of successful tape-outs.  \n \nCurrently part of a consumer product silicon engineering team working on power management for future Intel products.Previous technical contributions to high-speed serial I/O (PCIe, QPI) analog front-end and protocol development. Hands-on experience with several aspects of silicon hardware development including analog design, digital design, pre-silicon digital and mixed-signal validation, full chip integration, and post-silicon lab bring-up. Projects have ranged from forward looking architecture studies to core product development with a strong track record of successful tape-outs.  \n \nCurrently part of a consumer product silicon engineering team working on power management for future Intel products.Previous technical contributions to high-speed serial I/O (PCIe, QPI) analog front-end and protocol development. Hands-on experience with several aspects of silicon hardware development including analog design, digital design, pre-silicon digital and mixed-signal validation, full chip integration, and post-silicon lab bring-up. Projects have ranged from forward looking architecture studies to core product development with a strong track record of successful tape-outs.  \n \nCurrently part of a consumer product silicon engineering team working on power management for future Intel products.Previous technical contributions to high-speed serial I/O (PCIe, QPI) analog front-end and protocol development. Experience Mixed Signal Verification Lead/ Design Engineer Intel March 2012  – Present (3 years 6 months) Develop and review validation test plans for a mixed signal IC. Lead behavioral model methodology, development, and integration for full chip. Analog design of buck converter power train, op-amps, voltage references. Digital design (RTL, synthesis, FEV, and lintra checks) of digital interface controlling analog blocks. Own all analog circuit blocks top level netlist integration. Lab bring-up, debug, and characterization of silicon. High Speed I/O Design Engineer Intel Corporation 2009  –  February 2012  (3 years) Part of Intel’s architecture division that guides technology and specification development of high-speed I/O technologies such as Quick Path Interconnect (QPI) and Peripheral Component Interconnect Express (PCIe). Experience in mixed signal modelling and validation of high-speed analog front ends (AFE), circuit implementation of AFE's, jitter extraction from simulations, timing budget development for lead processor I/O interfaces, digital pre-silicon validation and RTL development of forward looking server processor I/O protocols. Circuit Design Engineer Intel Corporation August 2008  –  March 2009  (8 months) Designed amplifier blocks (high-gain, self-bias, rail-rail) for use in a voltage regulator. Proposed (through design) area optimizations for existing bandgap circuits. Developed mixed signal models for voltage regulator loop enabling top-down design and architecture studies. Participated in post-silicon bring up, debug, and performance analysis of ICs. Mixed Signal Verification Lead/ Design Engineer Intel March 2012  – Present (3 years 6 months) Develop and review validation test plans for a mixed signal IC. Lead behavioral model methodology, development, and integration for full chip. Analog design of buck converter power train, op-amps, voltage references. Digital design (RTL, synthesis, FEV, and lintra checks) of digital interface controlling analog blocks. Own all analog circuit blocks top level netlist integration. Lab bring-up, debug, and characterization of silicon. Mixed Signal Verification Lead/ Design Engineer Intel March 2012  – Present (3 years 6 months) Develop and review validation test plans for a mixed signal IC. Lead behavioral model methodology, development, and integration for full chip. Analog design of buck converter power train, op-amps, voltage references. Digital design (RTL, synthesis, FEV, and lintra checks) of digital interface controlling analog blocks. Own all analog circuit blocks top level netlist integration. Lab bring-up, debug, and characterization of silicon. High Speed I/O Design Engineer Intel Corporation 2009  –  February 2012  (3 years) Part of Intel’s architecture division that guides technology and specification development of high-speed I/O technologies such as Quick Path Interconnect (QPI) and Peripheral Component Interconnect Express (PCIe). Experience in mixed signal modelling and validation of high-speed analog front ends (AFE), circuit implementation of AFE's, jitter extraction from simulations, timing budget development for lead processor I/O interfaces, digital pre-silicon validation and RTL development of forward looking server processor I/O protocols. High Speed I/O Design Engineer Intel Corporation 2009  –  February 2012  (3 years) Part of Intel’s architecture division that guides technology and specification development of high-speed I/O technologies such as Quick Path Interconnect (QPI) and Peripheral Component Interconnect Express (PCIe). Experience in mixed signal modelling and validation of high-speed analog front ends (AFE), circuit implementation of AFE's, jitter extraction from simulations, timing budget development for lead processor I/O interfaces, digital pre-silicon validation and RTL development of forward looking server processor I/O protocols. Circuit Design Engineer Intel Corporation August 2008  –  March 2009  (8 months) Designed amplifier blocks (high-gain, self-bias, rail-rail) for use in a voltage regulator. Proposed (through design) area optimizations for existing bandgap circuits. Developed mixed signal models for voltage regulator loop enabling top-down design and architecture studies. Participated in post-silicon bring up, debug, and performance analysis of ICs. Circuit Design Engineer Intel Corporation August 2008  –  March 2009  (8 months) Designed amplifier blocks (high-gain, self-bias, rail-rail) for use in a voltage regulator. Proposed (through design) area optimizations for existing bandgap circuits. Developed mixed signal models for voltage regulator loop enabling top-down design and architecture studies. Participated in post-silicon bring up, debug, and performance analysis of ICs. Skills RTL design Verilog Verilog-A Verilog-AMS VLSI Analog Circuit Design Digital Circuit Design Integration Behavioral Modeling RTL verification Assertions High Speed Interfaces SystemVerilog SoC Formal Verification IC PLL Analog Low-power Design Power Management CMOS Mixed Signal PCIe Static Timing Analysis Simulations Logic Synthesis Cadence Virtuoso Silicon Signal Integrity RTL Design See 15+     See less Skills  RTL design Verilog Verilog-A Verilog-AMS VLSI Analog Circuit Design Digital Circuit Design Integration Behavioral Modeling RTL verification Assertions High Speed Interfaces SystemVerilog SoC Formal Verification IC PLL Analog Low-power Design Power Management CMOS Mixed Signal PCIe Static Timing Analysis Simulations Logic Synthesis Cadence Virtuoso Silicon Signal Integrity RTL Design See 15+     See less RTL design Verilog Verilog-A Verilog-AMS VLSI Analog Circuit Design Digital Circuit Design Integration Behavioral Modeling RTL verification Assertions High Speed Interfaces SystemVerilog SoC Formal Verification IC PLL Analog Low-power Design Power Management CMOS Mixed Signal PCIe Static Timing Analysis Simulations Logic Synthesis Cadence Virtuoso Silicon Signal Integrity RTL Design See 15+     See less RTL design Verilog Verilog-A Verilog-AMS VLSI Analog Circuit Design Digital Circuit Design Integration Behavioral Modeling RTL verification Assertions High Speed Interfaces SystemVerilog SoC Formal Verification IC PLL Analog Low-power Design Power Management CMOS Mixed Signal PCIe Static Timing Analysis Simulations Logic Synthesis Cadence Virtuoso Silicon Signal Integrity RTL Design See 15+     See less Education University of Washington M.S,  Electrical and Electronics Engineering 2005  – 2008 University of Washington M.S,  Electrical and Electronics Engineering 2005  – 2008 University of Washington M.S,  Electrical and Electronics Engineering 2005  – 2008 University of Washington M.S,  Electrical and Electronics Engineering 2005  – 2008 ", "Experience Manager/Tech Lead/Design Engineer Intel Corporation February 2009  – Present (6 years 7 months) Folsom, CA Software Engineer (3D Graphics) Garmin International October 2008  –  February 2009  (5 months) Olathe, Kansas Software Engineer (Automtovie Embedded Systems) Delphi September 2002  –  March 2004  (1 year 7 months) Manager/Tech Lead/Design Engineer Intel Corporation February 2009  – Present (6 years 7 months) Folsom, CA Manager/Tech Lead/Design Engineer Intel Corporation February 2009  – Present (6 years 7 months) Folsom, CA Software Engineer (3D Graphics) Garmin International October 2008  –  February 2009  (5 months) Olathe, Kansas Software Engineer (3D Graphics) Garmin International October 2008  –  February 2009  (5 months) Olathe, Kansas Software Engineer (Automtovie Embedded Systems) Delphi September 2002  –  March 2004  (1 year 7 months) Software Engineer (Automtovie Embedded Systems) Delphi September 2002  –  March 2004  (1 year 7 months) Education Purdue University Ph.D. 2004  – 2008 South Dakota School of Mines and Technology M.S. 2000  – 2002 Mongolian University of Science & Technology B.S. 1992  – 1997 Purdue University Ph.D. 2004  – 2008 Purdue University Ph.D. 2004  – 2008 Purdue University Ph.D. 2004  – 2008 South Dakota School of Mines and Technology M.S. 2000  – 2002 South Dakota School of Mines and Technology M.S. 2000  – 2002 South Dakota School of Mines and Technology M.S. 2000  – 2002 Mongolian University of Science & Technology B.S. 1992  – 1997 Mongolian University of Science & Technology B.S. 1992  – 1997 Mongolian University of Science & Technology B.S. 1992  – 1997 ", "Summary Strategy & business development professional with Engineering background and more than 15 years of experience in Technology & Media sectors. Motivational management style with proven track record of leading and coaching teams, strong problem solving and communication skills and delivering results in a fast paced environment. Summary Strategy & business development professional with Engineering background and more than 15 years of experience in Technology & Media sectors. Motivational management style with proven track record of leading and coaching teams, strong problem solving and communication skills and delivering results in a fast paced environment. Strategy & business development professional with Engineering background and more than 15 years of experience in Technology & Media sectors. Motivational management style with proven track record of leading and coaching teams, strong problem solving and communication skills and delivering results in a fast paced environment. Strategy & business development professional with Engineering background and more than 15 years of experience in Technology & Media sectors. Motivational management style with proven track record of leading and coaching teams, strong problem solving and communication skills and delivering results in a fast paced environment. Experience Vice President, Digital Strategy & Business Development NBC Universal 2010  – Present (5 years) Greater Los Angeles Area Engagement Manager / Case Team Leader Bain & Company 2006  –  2010  (4 years) Senior Product Marketing Manager Intel Corporation 2002  –  2006  (4 years) Senior Engineering Lead / Design Engineer Intel Corporation 1997  –  2002  (5 years) Vice President, Digital Strategy & Business Development NBC Universal 2010  – Present (5 years) Greater Los Angeles Area Vice President, Digital Strategy & Business Development NBC Universal 2010  – Present (5 years) Greater Los Angeles Area Engagement Manager / Case Team Leader Bain & Company 2006  –  2010  (4 years) Engagement Manager / Case Team Leader Bain & Company 2006  –  2010  (4 years) Senior Product Marketing Manager Intel Corporation 2002  –  2006  (4 years) Senior Product Marketing Manager Intel Corporation 2002  –  2006  (4 years) Senior Engineering Lead / Design Engineer Intel Corporation 1997  –  2002  (5 years) Senior Engineering Lead / Design Engineer Intel Corporation 1997  –  2002  (5 years) Education University of California, Berkeley, Haas School of Business MBA 2003  – 2006 University of California, Los Angeles B.S. University of Southern California M.S. University of California, Berkeley, Haas School of Business MBA 2003  – 2006 University of California, Berkeley, Haas School of Business MBA 2003  – 2006 University of California, Berkeley, Haas School of Business MBA 2003  – 2006 University of California, Los Angeles B.S. University of California, Los Angeles B.S. University of California, Los Angeles B.S. University of Southern California M.S. University of Southern California M.S. University of Southern California M.S. ", "Experience Hardware Architect Intel Corporation January 2013  – Present (2 years 8 months) Platform Engineer Intel Corporation January 2012  –  January 2013  (1 year 1 month) Lead Design Engineer Intel February 2009  –  January 2012  (3 years) India Lead Design Engineer Intel Corporation February 2008  –  February 2009  (1 year 1 month) Portland, Oregon Area Lead Design Engineer Intel Corporation May 2007  –  February 2008  (10 months) India Platform Engineer Intel Corporation September 2006  –  May 2007  (9 months) Taiwan Senior Design Engineer Intel Technology India Pvt Ltd October 2004  –  September 2006  (2 years) India Research Engineer Center for Development of Telematics (C-Do T) August 1999  –  October 2004  (5 years 3 months) India Hardware Architect Intel Corporation January 2013  – Present (2 years 8 months) Hardware Architect Intel Corporation January 2013  – Present (2 years 8 months) Platform Engineer Intel Corporation January 2012  –  January 2013  (1 year 1 month) Platform Engineer Intel Corporation January 2012  –  January 2013  (1 year 1 month) Lead Design Engineer Intel February 2009  –  January 2012  (3 years) India Lead Design Engineer Intel February 2009  –  January 2012  (3 years) India Lead Design Engineer Intel Corporation February 2008  –  February 2009  (1 year 1 month) Portland, Oregon Area Lead Design Engineer Intel Corporation February 2008  –  February 2009  (1 year 1 month) Portland, Oregon Area Lead Design Engineer Intel Corporation May 2007  –  February 2008  (10 months) India Lead Design Engineer Intel Corporation May 2007  –  February 2008  (10 months) India Platform Engineer Intel Corporation September 2006  –  May 2007  (9 months) Taiwan Platform Engineer Intel Corporation September 2006  –  May 2007  (9 months) Taiwan Senior Design Engineer Intel Technology India Pvt Ltd October 2004  –  September 2006  (2 years) India Senior Design Engineer Intel Technology India Pvt Ltd October 2004  –  September 2006  (2 years) India Research Engineer Center for Development of Telematics (C-Do T) August 1999  –  October 2004  (5 years 3 months) India Research Engineer Center for Development of Telematics (C-Do T) August 1999  –  October 2004  (5 years 3 months) India Skills SoC ASIC VLSI RTL design Verilog Simulations Signal Integrity SystemVerilog Debugging Functional Verification Processors Static Timing Analysis FPGA Hardware Architecture Embedded Systems Microprocessors See 1+     See less Skills  SoC ASIC VLSI RTL design Verilog Simulations Signal Integrity SystemVerilog Debugging Functional Verification Processors Static Timing Analysis FPGA Hardware Architecture Embedded Systems Microprocessors See 1+     See less SoC ASIC VLSI RTL design Verilog Simulations Signal Integrity SystemVerilog Debugging Functional Verification Processors Static Timing Analysis FPGA Hardware Architecture Embedded Systems Microprocessors See 1+     See less SoC ASIC VLSI RTL design Verilog Simulations Signal Integrity SystemVerilog Debugging Functional Verification Processors Static Timing Analysis FPGA Hardware Architecture Embedded Systems Microprocessors See 1+     See less Education National Institute of Technology Calicut B.TECH 1995  – 1999 National Institute of Technology Calicut B.TECH 1995  – 1999 National Institute of Technology Calicut B.TECH 1995  – 1999 National Institute of Technology Calicut B.TECH 1995  – 1999 ", "Summary Currently developing new businesses for Amazon. Check out job opportunities: http://college.amazon-jobs.com/amazon-pmt/ \n \nSocial Entrepreneur using technology to assist African industries to address critical barriers to growth, which will lead to economic development in Africa. \n \nLeaders for Global Operations Fellow \nMIT Legatum Fellow \nRoot Capital Fellow Specialties:Small and Medium Sized Enterprise Consulting &  \nMarket Research |  \nComputer design and development | \nMotherboard design and manufacturing | Lean operations | Generating business value from IT | Organizational Process Analysis Summary Currently developing new businesses for Amazon. Check out job opportunities: http://college.amazon-jobs.com/amazon-pmt/ \n \nSocial Entrepreneur using technology to assist African industries to address critical barriers to growth, which will lead to economic development in Africa. \n \nLeaders for Global Operations Fellow \nMIT Legatum Fellow \nRoot Capital Fellow Specialties:Small and Medium Sized Enterprise Consulting &  \nMarket Research |  \nComputer design and development | \nMotherboard design and manufacturing | Lean operations | Generating business value from IT | Organizational Process Analysis Currently developing new businesses for Amazon. Check out job opportunities: http://college.amazon-jobs.com/amazon-pmt/ \n \nSocial Entrepreneur using technology to assist African industries to address critical barriers to growth, which will lead to economic development in Africa. \n \nLeaders for Global Operations Fellow \nMIT Legatum Fellow \nRoot Capital Fellow Specialties:Small and Medium Sized Enterprise Consulting &  \nMarket Research |  \nComputer design and development | \nMotherboard design and manufacturing | Lean operations | Generating business value from IT | Organizational Process Analysis Currently developing new businesses for Amazon. Check out job opportunities: http://college.amazon-jobs.com/amazon-pmt/ \n \nSocial Entrepreneur using technology to assist African industries to address critical barriers to growth, which will lead to economic development in Africa. \n \nLeaders for Global Operations Fellow \nMIT Legatum Fellow \nRoot Capital Fellow Specialties:Small and Medium Sized Enterprise Consulting &  \nMarket Research |  \nComputer design and development | \nMotherboard design and manufacturing | Lean operations | Generating business value from IT | Organizational Process Analysis Experience Intrapreneur, Senior Product Manager Amazon.com July 2011  –  August 2015  (4 years 2 months) Write business plans and pilot new business ventures for Amazon \nCo-created an incubation program to harness business ideas of employees in the E-commerce platform group \nCurate business ideas from employees, Amazon IPs, and technology trends to develop opportunity for Amazon Senior Partner Stephen Claire Associates Ltd (ANDE Member) July 2010  –  January 2013  (2 years 7 months) Provide business planning assistance to businesses \nResearch market opportunities and strategies for clients \nIntroduce technology tools to improve market penetration and operational efficiency to small and growing businesses \nMentor fledgling startups on lean startup model and business model generation Founder Aqua Port 2009  –  2011  (2 years) Award-winning (MIT IDEAS winner & Legatum seed grant recipient) water transporter for rural villages Root Capital Fellow Root Capital January 2010  –  May 2010  (5 months) Researched access to finance barriers for small and growing businesses in Ghana \nProvided recommendation for Root Capital to engage financial institutions and leverage local initiatives to increase financing for Ghanaian small and medium sized enterprises Co-Founder BASEAfrica 2009  –  2010  (1 year) Built web-based social platform to scale informal connection among fledgling young entrepreneurs in Africa Graduate LGO Fellow Raytheon June 2009  –  December 2009  (7 months) •\tCreated a virtual business tool (using SQL and LabView) for managing stakeholders on various engineering projects to align project deliverables and owners thereby reducing rework and saving costs. \n•\tLed expansion of Virtual Business System to engineering to foster continuous improvement in engineering processes and integrate CMMI with Lean. Presented findings to Vice presidents and department heads that led to further project sponsorship Lead Design Engineer Intel Corporation September 2006  –  May 2008  (1 year 9 months) • Led a team of six design engineers and two technicians to complete design and validation of notebook platform project  \n• Developed concepts for shrinking motherboard and notebook system size \nprocessing on a concept laptop computer; Received recognition award for meeting the objective in a short time  \n• Designed Intel’s first full featured pre-launch concept laptop computer in collaboration with design engineers Board Member for Oregon chapter Sickle Cell Disease Association of America, Inc. January 2006  –  May 2008  (2 years 5 months) Portland, Oregon Area Design Engineer Intel June 2004  –  September 2006  (2 years 4 months) •\tCollaborate with various architecture, design, CAD and signal integrity teams across the globe on mobile product development \n•\tFacilitate new initiatives to customers validating notebook wireless, thermal, and battery life features Researcher at the Missisippi State Engineering Research Center National Science Foundation June 2002  –  August 2002  (3 months) Developed an Image Processing Tool  \nResearched applications of tool in remote sensing/geographic information system  \nPresented research project to a board of research professors Intrapreneur, Senior Product Manager Amazon.com July 2011  –  August 2015  (4 years 2 months) Write business plans and pilot new business ventures for Amazon \nCo-created an incubation program to harness business ideas of employees in the E-commerce platform group \nCurate business ideas from employees, Amazon IPs, and technology trends to develop opportunity for Amazon Intrapreneur, Senior Product Manager Amazon.com July 2011  –  August 2015  (4 years 2 months) Write business plans and pilot new business ventures for Amazon \nCo-created an incubation program to harness business ideas of employees in the E-commerce platform group \nCurate business ideas from employees, Amazon IPs, and technology trends to develop opportunity for Amazon Senior Partner Stephen Claire Associates Ltd (ANDE Member) July 2010  –  January 2013  (2 years 7 months) Provide business planning assistance to businesses \nResearch market opportunities and strategies for clients \nIntroduce technology tools to improve market penetration and operational efficiency to small and growing businesses \nMentor fledgling startups on lean startup model and business model generation Senior Partner Stephen Claire Associates Ltd (ANDE Member) July 2010  –  January 2013  (2 years 7 months) Provide business planning assistance to businesses \nResearch market opportunities and strategies for clients \nIntroduce technology tools to improve market penetration and operational efficiency to small and growing businesses \nMentor fledgling startups on lean startup model and business model generation Founder Aqua Port 2009  –  2011  (2 years) Award-winning (MIT IDEAS winner & Legatum seed grant recipient) water transporter for rural villages Founder Aqua Port 2009  –  2011  (2 years) Award-winning (MIT IDEAS winner & Legatum seed grant recipient) water transporter for rural villages Root Capital Fellow Root Capital January 2010  –  May 2010  (5 months) Researched access to finance barriers for small and growing businesses in Ghana \nProvided recommendation for Root Capital to engage financial institutions and leverage local initiatives to increase financing for Ghanaian small and medium sized enterprises Root Capital Fellow Root Capital January 2010  –  May 2010  (5 months) Researched access to finance barriers for small and growing businesses in Ghana \nProvided recommendation for Root Capital to engage financial institutions and leverage local initiatives to increase financing for Ghanaian small and medium sized enterprises Co-Founder BASEAfrica 2009  –  2010  (1 year) Built web-based social platform to scale informal connection among fledgling young entrepreneurs in Africa Co-Founder BASEAfrica 2009  –  2010  (1 year) Built web-based social platform to scale informal connection among fledgling young entrepreneurs in Africa Graduate LGO Fellow Raytheon June 2009  –  December 2009  (7 months) •\tCreated a virtual business tool (using SQL and LabView) for managing stakeholders on various engineering projects to align project deliverables and owners thereby reducing rework and saving costs. \n•\tLed expansion of Virtual Business System to engineering to foster continuous improvement in engineering processes and integrate CMMI with Lean. Presented findings to Vice presidents and department heads that led to further project sponsorship Graduate LGO Fellow Raytheon June 2009  –  December 2009  (7 months) •\tCreated a virtual business tool (using SQL and LabView) for managing stakeholders on various engineering projects to align project deliverables and owners thereby reducing rework and saving costs. \n•\tLed expansion of Virtual Business System to engineering to foster continuous improvement in engineering processes and integrate CMMI with Lean. Presented findings to Vice presidents and department heads that led to further project sponsorship Lead Design Engineer Intel Corporation September 2006  –  May 2008  (1 year 9 months) • Led a team of six design engineers and two technicians to complete design and validation of notebook platform project  \n• Developed concepts for shrinking motherboard and notebook system size \nprocessing on a concept laptop computer; Received recognition award for meeting the objective in a short time  \n• Designed Intel’s first full featured pre-launch concept laptop computer in collaboration with design engineers Lead Design Engineer Intel Corporation September 2006  –  May 2008  (1 year 9 months) • Led a team of six design engineers and two technicians to complete design and validation of notebook platform project  \n• Developed concepts for shrinking motherboard and notebook system size \nprocessing on a concept laptop computer; Received recognition award for meeting the objective in a short time  \n• Designed Intel’s first full featured pre-launch concept laptop computer in collaboration with design engineers Board Member for Oregon chapter Sickle Cell Disease Association of America, Inc. January 2006  –  May 2008  (2 years 5 months) Portland, Oregon Area Board Member for Oregon chapter Sickle Cell Disease Association of America, Inc. January 2006  –  May 2008  (2 years 5 months) Portland, Oregon Area Design Engineer Intel June 2004  –  September 2006  (2 years 4 months) •\tCollaborate with various architecture, design, CAD and signal integrity teams across the globe on mobile product development \n•\tFacilitate new initiatives to customers validating notebook wireless, thermal, and battery life features Design Engineer Intel June 2004  –  September 2006  (2 years 4 months) •\tCollaborate with various architecture, design, CAD and signal integrity teams across the globe on mobile product development \n•\tFacilitate new initiatives to customers validating notebook wireless, thermal, and battery life features Researcher at the Missisippi State Engineering Research Center National Science Foundation June 2002  –  August 2002  (3 months) Developed an Image Processing Tool  \nResearched applications of tool in remote sensing/geographic information system  \nPresented research project to a board of research professors Researcher at the Missisippi State Engineering Research Center National Science Foundation June 2002  –  August 2002  (3 months) Developed an Image Processing Tool  \nResearched applications of tool in remote sensing/geographic information system  \nPresented research project to a board of research professors Languages   Skills Entrepreneurship Product Management Integration Program Management Management Product Development Start-ups E-commerce Market Research Business Strategy Leadership Product Marketing Strategy System Design New Business Development Strategic Planning Operations Management Python See 3+     See less Skills  Entrepreneurship Product Management Integration Program Management Management Product Development Start-ups E-commerce Market Research Business Strategy Leadership Product Marketing Strategy System Design New Business Development Strategic Planning Operations Management Python See 3+     See less Entrepreneurship Product Management Integration Program Management Management Product Development Start-ups E-commerce Market Research Business Strategy Leadership Product Marketing Strategy System Design New Business Development Strategic Planning Operations Management Python See 3+     See less Entrepreneurship Product Management Integration Program Management Management Product Development Start-ups E-commerce Market Research Business Strategy Leadership Product Marketing Strategy System Design New Business Development Strategic Planning Operations Management Python See 3+     See less Education Massachusetts Institute of Technology SM or MS,  Engineering Systems 2008  – 2010 Activities and Societies:  Various LFM Committees Massachusetts Institute of Technology - Sloan School of Management MBA,  Entrepreneurship & Operations 2008  – 2010 The University of Texas at Austin electrical engineering 2002  – 2004 Massachusetts Institute of Technology SM or MS,  Engineering Systems 2008  – 2010 Activities and Societies:  Various LFM Committees Massachusetts Institute of Technology SM or MS,  Engineering Systems 2008  – 2010 Activities and Societies:  Various LFM Committees Massachusetts Institute of Technology SM or MS,  Engineering Systems 2008  – 2010 Activities and Societies:  Various LFM Committees Massachusetts Institute of Technology - Sloan School of Management MBA,  Entrepreneurship & Operations 2008  – 2010 Massachusetts Institute of Technology - Sloan School of Management MBA,  Entrepreneurship & Operations 2008  – 2010 Massachusetts Institute of Technology - Sloan School of Management MBA,  Entrepreneurship & Operations 2008  – 2010 The University of Texas at Austin electrical engineering 2002  – 2004 The University of Texas at Austin electrical engineering 2002  – 2004 The University of Texas at Austin electrical engineering 2002  – 2004 Honors & Awards Additional Honors & Awards MIT LFM fellow \nGates Millennium Scholar \nTau Beta pi engineering honor society \nPhi Kappa Phi honor society \nLeadershape Institute Graduate Additional Honors & Awards MIT LFM fellow \nGates Millennium Scholar \nTau Beta pi engineering honor society \nPhi Kappa Phi honor society \nLeadershape Institute Graduate Additional Honors & Awards MIT LFM fellow \nGates Millennium Scholar \nTau Beta pi engineering honor society \nPhi Kappa Phi honor society \nLeadershape Institute Graduate Additional Honors & Awards MIT LFM fellow \nGates Millennium Scholar \nTau Beta pi engineering honor society \nPhi Kappa Phi honor society \nLeadershape Institute Graduate ", "Experience Engineering Manager Intel Corporation September 2011  – Present (4 years) San Francisco Bay Area Senior Field Application Engineer Motorola Solutions March 2007  –  April 2011  (4 years 2 months) Greater Chicago Area Lead Design Engineer Intel Corporation February 1999  –  March 2007  (8 years 2 months) Greater Philadelphia Area Software Developer Patni Computer Systems (now iGATE) June 1997  –  February 1999  (1 year 9 months) Bangalore, India Engineering Manager Intel Corporation September 2011  – Present (4 years) San Francisco Bay Area Engineering Manager Intel Corporation September 2011  – Present (4 years) San Francisco Bay Area Senior Field Application Engineer Motorola Solutions March 2007  –  April 2011  (4 years 2 months) Greater Chicago Area Senior Field Application Engineer Motorola Solutions March 2007  –  April 2011  (4 years 2 months) Greater Chicago Area Lead Design Engineer Intel Corporation February 1999  –  March 2007  (8 years 2 months) Greater Philadelphia Area Lead Design Engineer Intel Corporation February 1999  –  March 2007  (8 years 2 months) Greater Philadelphia Area Software Developer Patni Computer Systems (now iGATE) June 1997  –  February 1999  (1 year 9 months) Bangalore, India Software Developer Patni Computer Systems (now iGATE) June 1997  –  February 1999  (1 year 9 months) Bangalore, India Education Northwestern University - Kellogg School of Management Global MBA 2010  – 2011 Ramrao Adik Institute of Technology, Navi Mumbai Bachelor's Degree,  Electronics Engineering 1993  – 1997 Northwestern University - Kellogg School of Management Global MBA 2010  – 2011 Northwestern University - Kellogg School of Management Global MBA 2010  – 2011 Northwestern University - Kellogg School of Management Global MBA 2010  – 2011 Ramrao Adik Institute of Technology, Navi Mumbai Bachelor's Degree,  Electronics Engineering 1993  – 1997 Ramrao Adik Institute of Technology, Navi Mumbai Bachelor's Degree,  Electronics Engineering 1993  – 1997 Ramrao Adik Institute of Technology, Navi Mumbai Bachelor's Degree,  Electronics Engineering 1993  – 1997 ", "Skills Security Debugging Server Architecture Perl High Performance... Firmware ASIC Embedded Systems VLSI Distributed Systems Software Engineering Electronics SoC Design of Experiments Hardware Architecture IC Intel Testing Semiconductors Computer Architecture Analog Processors Manufacturing VHDL System Architecture PCB design Verilog Validation Simulations EDA Algorithms C++ Device Drivers Software Development Unix Cross-functional Team... Engineering Management Computer Security Embedded Software C Architecture See 26+     See less Skills  Security Debugging Server Architecture Perl High Performance... Firmware ASIC Embedded Systems VLSI Distributed Systems Software Engineering Electronics SoC Design of Experiments Hardware Architecture IC Intel Testing Semiconductors Computer Architecture Analog Processors Manufacturing VHDL System Architecture PCB design Verilog Validation Simulations EDA Algorithms C++ Device Drivers Software Development Unix Cross-functional Team... Engineering Management Computer Security Embedded Software C Architecture See 26+     See less Security Debugging Server Architecture Perl High Performance... Firmware ASIC Embedded Systems VLSI Distributed Systems Software Engineering Electronics SoC Design of Experiments Hardware Architecture IC Intel Testing Semiconductors Computer Architecture Analog Processors Manufacturing VHDL System Architecture PCB design Verilog Validation Simulations EDA Algorithms C++ Device Drivers Software Development Unix Cross-functional Team... Engineering Management Computer Security Embedded Software C Architecture See 26+     See less Security Debugging Server Architecture Perl High Performance... Firmware ASIC Embedded Systems VLSI Distributed Systems Software Engineering Electronics SoC Design of Experiments Hardware Architecture IC Intel Testing Semiconductors Computer Architecture Analog Processors Manufacturing VHDL System Architecture PCB design Verilog Validation Simulations EDA Algorithms C++ Device Drivers Software Development Unix Cross-functional Team... Engineering Management Computer Security Embedded Software C Architecture See 26+     See less ", "Summary Physical Design and Design Verification Manager Summary Physical Design and Design Verification Manager Physical Design and Design Verification Manager Physical Design and Design Verification Manager Experience Sr. Manager ASIC/ Layout Design Semi-Custom BU, AMD August 2013  – Present (2 years 1 month) boston, massachusetts Manage Design Verification and Physical Design of a Customized GPU Sr. Manager Semi-Custom BU, AMD November 2010  –  August 2013  (2 years 10 months) boston, massachusetts Main Responsibilities: \n \nManage a team of highly skilled engineers in Physical Implementation of APUs, Discrete GPU chips Products; Have been mentoring 2 Managers each; Resource planning - Human resources, Machine and Storage resources \nProject Planning, Execution and Tracking,  \nImplementation of all aspects of design - From Floorplanning to Placement to Clock Tree to Optimization to Timing closure, Physical Verification and Tapeout.  \nTapeouts in 90nm, 65nm, 40nm, 32nm, 28nm, 20nm, 16nm \nWorking relationship with Foundry's to sign off on Tapeout Data and Mask Creation \nCommunication with Chip bring-up team on post Silicon support \nAccomplishments Impacting Business: \nReduced the number of Base layers in 65nm being revised which saved the company $600K \nWorked on a strategy to reduce the overall resources required on an APU spin, which benefited the company by 30 man months. Sr. Manager - ASIC Layout Design AMD 2005  –  2010  (5 years) Toronto, Canada Area Physical Design of a variety of complex GPU designs; Fusion - CPU + GPU; Low power concepts - Power gating,  \nCAD initiatives and Overall Project Management working with Global teams Manager Sasken August 2000  –  April 2005  (4 years 9 months) ASIC Implementation (ICDS: IO-ANA-PD; Main Responsibilities: \nManaged the Function of Analog and Digital Layout Design teams, Business Development Customer Interaction and Retention. \nLed a team of 30 Design Engineers in the area of Mixed Signal Design, Custom Layout Design and Complex Physical Designs \nProject Management: Planning, Tracking and Tapeout \nBusiness Development, Creating new teams and Mentoring. \nNew Customer Relationships, Writing Technical Proposals,  \nAnalog and Physical Design solutions \nCustom I/O ring development, Integration and Physical verification  \nPhysical design flow and New methodologies for Efficiency \nAccomplishment: Best Vendor of the Year awarded by Microchip Bangalore. Engineering Manager/Microchip Sasken April 2004  –  November 2004  (8 months) Main Responsibilities: \nProject planning, tracking, implementation and resource management. \nAnalog Design: IO cell library development for 0.35um technology \nPhysical Design: Integration of blocks, IO ring and Physical Verification Engineering Manager ATI Technologies March 2002  –  April 2004  (2 years 2 months) Main Responsibilities: \nProject planning, tracking and Implementation. \nManaged 5 resources - Technical and Personal \nAnalog Design: 90nm, 0.13um, 0.15um tech. \nCustom I/O ring Design, Simulation, Integration and Physical verification  \nInline/ Staggered Bond-site design according to Foundry Specifications, DFM and DFY \nInteraction with Packaging group, SOC Physical design team \nDeveloping, Validating Backend design flows and Methodologies. \nEmployee of SASKEN Lead Design Engineer Intel Corporation December 2000  –  October 2001  (11 months) Main Responsibilities in the System Validation Team (SV): \nPhysical Synthesis using Synopsys-Physical Compiler. \nAuto Place and Route, Static Timing Analysis using Synopsys-PrimeTime \nSTA flow automation using PERL and Tcl \nFPGA synthesis, mapping, pin assignment, using Synplicity and Routing using Quartus \nVerification of FPGA design using standard tests, trouble-shooting and simulation using Modelsim \nEmployee of SASKEN Technical Lead -- IC Design Philips Semiconductors May 1997  –  July 2000  (3 years 3 months) Nijmegen, The Netherlands Involved In Analog and IO design, mixed signal, ESD and Custom Layout/Mask Design. Technical Lead Philips Semiconductors August 1997  –  June 2000  (2 years 11 months) Main Responsibilities: \n- Circuit design/Simulation of standard IOs for 0.35um, 0.25um libraries \n- Analog Layout Design, Extraction, Simulation and Verification. \n- Automation using SKILL language and AWK \n- Major accomplishments: \n- Designed high quality compact layouts \n- Developed a Characterization tool in PERL for IO design Design Engineer Philips Semiconductors May 1997  –  August 1997  (4 months) Main Responsibilities: \n- GPIO, I2C and Custom IO Designs in 0.35um, 0.25um \n- Schematic and Physical Design using SiliconEnsemble-5.x,  \n- Physical Verification: LVS and DRC using Dracula and Diva Design Engineer Arcus Technology Ltd January 1996  –  May 1997  (1 year 5 months) Main Responsibilities: \n- Circuit Design of digital blocks like Barrel shifter and Registers (Tools used - CompassTM) \n- Custom Design of UART, TIMER01, TIMER02 and Datapath blocks of 80C51.  \n- Fullchip floor planning, Physical Design and Verification \n- Automation using C language \n- CAD development: A C program to generate Layout and Schematic views from verilog netlist for memory macros under CompassTM design environment ASIC Design Engineer Arcus Technology December 1995  –  May 1997  (1 year 6 months) This was my first - much aspired job as a Design Engineer. Sr. Manager ASIC/ Layout Design Semi-Custom BU, AMD August 2013  – Present (2 years 1 month) boston, massachusetts Manage Design Verification and Physical Design of a Customized GPU Sr. Manager ASIC/ Layout Design Semi-Custom BU, AMD August 2013  – Present (2 years 1 month) boston, massachusetts Manage Design Verification and Physical Design of a Customized GPU Sr. Manager Semi-Custom BU, AMD November 2010  –  August 2013  (2 years 10 months) boston, massachusetts Main Responsibilities: \n \nManage a team of highly skilled engineers in Physical Implementation of APUs, Discrete GPU chips Products; Have been mentoring 2 Managers each; Resource planning - Human resources, Machine and Storage resources \nProject Planning, Execution and Tracking,  \nImplementation of all aspects of design - From Floorplanning to Placement to Clock Tree to Optimization to Timing closure, Physical Verification and Tapeout.  \nTapeouts in 90nm, 65nm, 40nm, 32nm, 28nm, 20nm, 16nm \nWorking relationship with Foundry's to sign off on Tapeout Data and Mask Creation \nCommunication with Chip bring-up team on post Silicon support \nAccomplishments Impacting Business: \nReduced the number of Base layers in 65nm being revised which saved the company $600K \nWorked on a strategy to reduce the overall resources required on an APU spin, which benefited the company by 30 man months. Sr. Manager Semi-Custom BU, AMD November 2010  –  August 2013  (2 years 10 months) boston, massachusetts Main Responsibilities: \n \nManage a team of highly skilled engineers in Physical Implementation of APUs, Discrete GPU chips Products; Have been mentoring 2 Managers each; Resource planning - Human resources, Machine and Storage resources \nProject Planning, Execution and Tracking,  \nImplementation of all aspects of design - From Floorplanning to Placement to Clock Tree to Optimization to Timing closure, Physical Verification and Tapeout.  \nTapeouts in 90nm, 65nm, 40nm, 32nm, 28nm, 20nm, 16nm \nWorking relationship with Foundry's to sign off on Tapeout Data and Mask Creation \nCommunication with Chip bring-up team on post Silicon support \nAccomplishments Impacting Business: \nReduced the number of Base layers in 65nm being revised which saved the company $600K \nWorked on a strategy to reduce the overall resources required on an APU spin, which benefited the company by 30 man months. Sr. Manager - ASIC Layout Design AMD 2005  –  2010  (5 years) Toronto, Canada Area Physical Design of a variety of complex GPU designs; Fusion - CPU + GPU; Low power concepts - Power gating,  \nCAD initiatives and Overall Project Management working with Global teams Sr. Manager - ASIC Layout Design AMD 2005  –  2010  (5 years) Toronto, Canada Area Physical Design of a variety of complex GPU designs; Fusion - CPU + GPU; Low power concepts - Power gating,  \nCAD initiatives and Overall Project Management working with Global teams Manager Sasken August 2000  –  April 2005  (4 years 9 months) ASIC Implementation (ICDS: IO-ANA-PD; Main Responsibilities: \nManaged the Function of Analog and Digital Layout Design teams, Business Development Customer Interaction and Retention. \nLed a team of 30 Design Engineers in the area of Mixed Signal Design, Custom Layout Design and Complex Physical Designs \nProject Management: Planning, Tracking and Tapeout \nBusiness Development, Creating new teams and Mentoring. \nNew Customer Relationships, Writing Technical Proposals,  \nAnalog and Physical Design solutions \nCustom I/O ring development, Integration and Physical verification  \nPhysical design flow and New methodologies for Efficiency \nAccomplishment: Best Vendor of the Year awarded by Microchip Bangalore. Manager Sasken August 2000  –  April 2005  (4 years 9 months) ASIC Implementation (ICDS: IO-ANA-PD; Main Responsibilities: \nManaged the Function of Analog and Digital Layout Design teams, Business Development Customer Interaction and Retention. \nLed a team of 30 Design Engineers in the area of Mixed Signal Design, Custom Layout Design and Complex Physical Designs \nProject Management: Planning, Tracking and Tapeout \nBusiness Development, Creating new teams and Mentoring. \nNew Customer Relationships, Writing Technical Proposals,  \nAnalog and Physical Design solutions \nCustom I/O ring development, Integration and Physical verification  \nPhysical design flow and New methodologies for Efficiency \nAccomplishment: Best Vendor of the Year awarded by Microchip Bangalore. Engineering Manager/Microchip Sasken April 2004  –  November 2004  (8 months) Main Responsibilities: \nProject planning, tracking, implementation and resource management. \nAnalog Design: IO cell library development for 0.35um technology \nPhysical Design: Integration of blocks, IO ring and Physical Verification Engineering Manager/Microchip Sasken April 2004  –  November 2004  (8 months) Main Responsibilities: \nProject planning, tracking, implementation and resource management. \nAnalog Design: IO cell library development for 0.35um technology \nPhysical Design: Integration of blocks, IO ring and Physical Verification Engineering Manager ATI Technologies March 2002  –  April 2004  (2 years 2 months) Main Responsibilities: \nProject planning, tracking and Implementation. \nManaged 5 resources - Technical and Personal \nAnalog Design: 90nm, 0.13um, 0.15um tech. \nCustom I/O ring Design, Simulation, Integration and Physical verification  \nInline/ Staggered Bond-site design according to Foundry Specifications, DFM and DFY \nInteraction with Packaging group, SOC Physical design team \nDeveloping, Validating Backend design flows and Methodologies. \nEmployee of SASKEN Engineering Manager ATI Technologies March 2002  –  April 2004  (2 years 2 months) Main Responsibilities: \nProject planning, tracking and Implementation. \nManaged 5 resources - Technical and Personal \nAnalog Design: 90nm, 0.13um, 0.15um tech. \nCustom I/O ring Design, Simulation, Integration and Physical verification  \nInline/ Staggered Bond-site design according to Foundry Specifications, DFM and DFY \nInteraction with Packaging group, SOC Physical design team \nDeveloping, Validating Backend design flows and Methodologies. \nEmployee of SASKEN Lead Design Engineer Intel Corporation December 2000  –  October 2001  (11 months) Main Responsibilities in the System Validation Team (SV): \nPhysical Synthesis using Synopsys-Physical Compiler. \nAuto Place and Route, Static Timing Analysis using Synopsys-PrimeTime \nSTA flow automation using PERL and Tcl \nFPGA synthesis, mapping, pin assignment, using Synplicity and Routing using Quartus \nVerification of FPGA design using standard tests, trouble-shooting and simulation using Modelsim \nEmployee of SASKEN Lead Design Engineer Intel Corporation December 2000  –  October 2001  (11 months) Main Responsibilities in the System Validation Team (SV): \nPhysical Synthesis using Synopsys-Physical Compiler. \nAuto Place and Route, Static Timing Analysis using Synopsys-PrimeTime \nSTA flow automation using PERL and Tcl \nFPGA synthesis, mapping, pin assignment, using Synplicity and Routing using Quartus \nVerification of FPGA design using standard tests, trouble-shooting and simulation using Modelsim \nEmployee of SASKEN Technical Lead -- IC Design Philips Semiconductors May 1997  –  July 2000  (3 years 3 months) Nijmegen, The Netherlands Involved In Analog and IO design, mixed signal, ESD and Custom Layout/Mask Design. Technical Lead -- IC Design Philips Semiconductors May 1997  –  July 2000  (3 years 3 months) Nijmegen, The Netherlands Involved In Analog and IO design, mixed signal, ESD and Custom Layout/Mask Design. Technical Lead Philips Semiconductors August 1997  –  June 2000  (2 years 11 months) Main Responsibilities: \n- Circuit design/Simulation of standard IOs for 0.35um, 0.25um libraries \n- Analog Layout Design, Extraction, Simulation and Verification. \n- Automation using SKILL language and AWK \n- Major accomplishments: \n- Designed high quality compact layouts \n- Developed a Characterization tool in PERL for IO design Technical Lead Philips Semiconductors August 1997  –  June 2000  (2 years 11 months) Main Responsibilities: \n- Circuit design/Simulation of standard IOs for 0.35um, 0.25um libraries \n- Analog Layout Design, Extraction, Simulation and Verification. \n- Automation using SKILL language and AWK \n- Major accomplishments: \n- Designed high quality compact layouts \n- Developed a Characterization tool in PERL for IO design Design Engineer Philips Semiconductors May 1997  –  August 1997  (4 months) Main Responsibilities: \n- GPIO, I2C and Custom IO Designs in 0.35um, 0.25um \n- Schematic and Physical Design using SiliconEnsemble-5.x,  \n- Physical Verification: LVS and DRC using Dracula and Diva Design Engineer Philips Semiconductors May 1997  –  August 1997  (4 months) Main Responsibilities: \n- GPIO, I2C and Custom IO Designs in 0.35um, 0.25um \n- Schematic and Physical Design using SiliconEnsemble-5.x,  \n- Physical Verification: LVS and DRC using Dracula and Diva Design Engineer Arcus Technology Ltd January 1996  –  May 1997  (1 year 5 months) Main Responsibilities: \n- Circuit Design of digital blocks like Barrel shifter and Registers (Tools used - CompassTM) \n- Custom Design of UART, TIMER01, TIMER02 and Datapath blocks of 80C51.  \n- Fullchip floor planning, Physical Design and Verification \n- Automation using C language \n- CAD development: A C program to generate Layout and Schematic views from verilog netlist for memory macros under CompassTM design environment Design Engineer Arcus Technology Ltd January 1996  –  May 1997  (1 year 5 months) Main Responsibilities: \n- Circuit Design of digital blocks like Barrel shifter and Registers (Tools used - CompassTM) \n- Custom Design of UART, TIMER01, TIMER02 and Datapath blocks of 80C51.  \n- Fullchip floor planning, Physical Design and Verification \n- Automation using C language \n- CAD development: A C program to generate Layout and Schematic views from verilog netlist for memory macros under CompassTM design environment ASIC Design Engineer Arcus Technology December 1995  –  May 1997  (1 year 6 months) This was my first - much aspired job as a Design Engineer. ASIC Design Engineer Arcus Technology December 1995  –  May 1997  (1 year 6 months) This was my first - much aspired job as a Design Engineer. Languages Hindi Tamil Kannada Telugu Dutch Chinese (Mandarin - Learning) Hindi Tamil Kannada Telugu Dutch Chinese (Mandarin - Learning) Hindi Tamil Kannada Telugu Dutch Chinese (Mandarin - Learning) Skills ASIC GPU Physical Verification SoC Floorplanning Clock Tree Synthesis Static Timing Analysis Power Analysis Semiconductor Design Low Power Design Power Management DRC LVS Microprocessors Signal Integrity VLSI Design Methodology Timing Closure Processors Physical Design Silicon SystemVerilog TCL FPGA IC Simulations ModelSim Integrated Circuit... RTL design Perl Low-power Design Circuit Design Semiconductors Functional Verification Debugging Mixed Signal EDA Analog Place & Route Verilog Methodology Analog Circuit Design CMOS DFT ARM Primetime Logic Design Digital Signal... Formal Verification VHDL See 35+     See less Skills  ASIC GPU Physical Verification SoC Floorplanning Clock Tree Synthesis Static Timing Analysis Power Analysis Semiconductor Design Low Power Design Power Management DRC LVS Microprocessors Signal Integrity VLSI Design Methodology Timing Closure Processors Physical Design Silicon SystemVerilog TCL FPGA IC Simulations ModelSim Integrated Circuit... RTL design Perl Low-power Design Circuit Design Semiconductors Functional Verification Debugging Mixed Signal EDA Analog Place & Route Verilog Methodology Analog Circuit Design CMOS DFT ARM Primetime Logic Design Digital Signal... Formal Verification VHDL See 35+     See less ASIC GPU Physical Verification SoC Floorplanning Clock Tree Synthesis Static Timing Analysis Power Analysis Semiconductor Design Low Power Design Power Management DRC LVS Microprocessors Signal Integrity VLSI Design Methodology Timing Closure Processors Physical Design Silicon SystemVerilog TCL FPGA IC Simulations ModelSim Integrated Circuit... RTL design Perl Low-power Design Circuit Design Semiconductors Functional Verification Debugging Mixed Signal EDA Analog Place & Route Verilog Methodology Analog Circuit Design CMOS DFT ARM Primetime Logic Design Digital Signal... Formal Verification VHDL See 35+     See less ASIC GPU Physical Verification SoC Floorplanning Clock Tree Synthesis Static Timing Analysis Power Analysis Semiconductor Design Low Power Design Power Management DRC LVS Microprocessors Signal Integrity VLSI Design Methodology Timing Closure Processors Physical Design Silicon SystemVerilog TCL FPGA IC Simulations ModelSim Integrated Circuit... RTL design Perl Low-power Design Circuit Design Semiconductors Functional Verification Debugging Mixed Signal EDA Analog Place & Route Verilog Methodology Analog Circuit Design CMOS DFT ARM Primetime Logic Design Digital Signal... Formal Verification VHDL See 35+     See less Education S.J.College of Engineering, Univ. of Mysore Bachelor of Engineering (B.E; Bachelor,  Instrumentation & Technology 1991  – 1995 University of Mysore Bachelor Degree in Instrumentation Technology and Electronics,  Engineering 1991  – 1995 SGTPA S.J.College of Engineering, Univ. of Mysore Bachelor of Engineering (B.E; Bachelor,  Instrumentation & Technology 1991  – 1995 S.J.College of Engineering, Univ. of Mysore Bachelor of Engineering (B.E; Bachelor,  Instrumentation & Technology 1991  – 1995 S.J.College of Engineering, Univ. of Mysore Bachelor of Engineering (B.E; Bachelor,  Instrumentation & Technology 1991  – 1995 University of Mysore Bachelor Degree in Instrumentation Technology and Electronics,  Engineering 1991  – 1995 University of Mysore Bachelor Degree in Instrumentation Technology and Electronics,  Engineering 1991  – 1995 University of Mysore Bachelor Degree in Instrumentation Technology and Electronics,  Engineering 1991  – 1995 SGTPA SGTPA SGTPA Honors & Awards 4th Rank in University of Mysore University of Mysore, India September 1995 4th Rank in University of Mysore University of Mysore, India September 1995 4th Rank in University of Mysore University of Mysore, India September 1995 4th Rank in University of Mysore University of Mysore, India September 1995 ", "Experience Technical Lead Design Engineer Intel Corporation June 2004  – Present (11 years 3 months) Technical Lead Design Engineer Intel Corporation June 2004  – Present (11 years 3 months) Technical Lead Design Engineer Intel Corporation June 2004  – Present (11 years 3 months) Skills Microarchitecture System Level Debug SoC Computer Architecture CPU design SystemVerilog RTL design Design Methodology Functional Verification VLSI Verilog Primetime Static Timing Analysis ASIC RTL coding Timing Closure See 1+     See less Skills  Microarchitecture System Level Debug SoC Computer Architecture CPU design SystemVerilog RTL design Design Methodology Functional Verification VLSI Verilog Primetime Static Timing Analysis ASIC RTL coding Timing Closure See 1+     See less Microarchitecture System Level Debug SoC Computer Architecture CPU design SystemVerilog RTL design Design Methodology Functional Verification VLSI Verilog Primetime Static Timing Analysis ASIC RTL coding Timing Closure See 1+     See less Microarchitecture System Level Debug SoC Computer Architecture CPU design SystemVerilog RTL design Design Methodology Functional Verification VLSI Verilog Primetime Static Timing Analysis ASIC RTL coding Timing Closure See 1+     See less "]}