{"position": "Lean Six Sigma Master Black Belt", "company": "Intel Corporation", "profiles": ["Summary Industrial Engineer with Master of Business Administration and Finance (Honorary degree) that has extensive experience in Operational Excellence methodologies applied at corporate level. Certifications include Master Black Belt in Lean and Sigma at Intel, Lean Manufacturing Bronze and Business Process Management (BPM), achieving Savings for $10 million on NPV in the last 6 years. Sebastian is currently driving strategic projects/programs for the Human Recourses Intel division. Summary Industrial Engineer with Master of Business Administration and Finance (Honorary degree) that has extensive experience in Operational Excellence methodologies applied at corporate level. Certifications include Master Black Belt in Lean and Sigma at Intel, Lean Manufacturing Bronze and Business Process Management (BPM), achieving Savings for $10 million on NPV in the last 6 years. Sebastian is currently driving strategic projects/programs for the Human Recourses Intel division. Industrial Engineer with Master of Business Administration and Finance (Honorary degree) that has extensive experience in Operational Excellence methodologies applied at corporate level. Certifications include Master Black Belt in Lean and Sigma at Intel, Lean Manufacturing Bronze and Business Process Management (BPM), achieving Savings for $10 million on NPV in the last 6 years. Sebastian is currently driving strategic projects/programs for the Human Recourses Intel division. Industrial Engineer with Master of Business Administration and Finance (Honorary degree) that has extensive experience in Operational Excellence methodologies applied at corporate level. Certifications include Master Black Belt in Lean and Sigma at Intel, Lean Manufacturing Bronze and Business Process Management (BPM), achieving Savings for $10 million on NPV in the last 6 years. Sebastian is currently driving strategic projects/programs for the Human Recourses Intel division. Experience Lean Six Sigma Master Black Belt Intel Corporation January 2014  – Present (1 year 8 months) Costa Rica Operational Excellence Program Manager: – Global, Optimization \nHelped to develop Operational Excellence Programs in different company divisions:  \n• Provided consulting to Intel divisions to develop Operational Excellence Program in Share Services, Product Design and manufacturing groups  \n• Project Manager for top strategic projects for Human Resource Corporate division, managing a global Project team in 8 different cities, Including Europe, Asia and Americas. Profesor Universidad de Costa Rica May 2014  –  December 2014  (8 months) Costa Rica Professor for the Business Process Improvement course. Electric Engineering School. UCR.  \nThis class included LSS, BPM, Lean Manufacturing as well as TRIZ for graduated bachelors (Electrical Engineers). Operational Excellence Manager Intel Corporation January 2012  –  December 2013  (2 years) Global Lean Six Sigma Black Belt Program Manager: – Global HR, Lean and Six Sigma Division Program Manager – January 2010 to 2013 \nGlobal Program Manager for Lean and Six Sigma HR Program at Intel Service Division: \n•Conducted multiple strategic Black Belt projects for the division  \n•Managed Portfolio for $5 million (return of investment) in the division  \n•Coordinated 7 Black Belts working on Lean Six Sigma Projects  \n•Implemented the Operational Excellence Program in Costa Rica Share Service Center (200 people) \n•Program Certified 4 Black Belts and 100 Green Belts and in 35 different project Manager for the Costa Rica Share Service Center Transaction Center Intel Corporation January 2007  –  January 2009  (2 years 1 month) Costa Rica Managed the Costa Rica Transaction Center, which supports transactions for 7 different business partners in America and Europe, getting world class operational results; less than 1500 dpm (defects per million) and more than 90% (customer Satisfaction) for approximately 180,000 standard transactions. Improvements conducted saved $200 K ROI in the operation. Lean Six Sigma Master Black Belt Intel Corporation January 2014  – Present (1 year 8 months) Costa Rica Operational Excellence Program Manager: – Global, Optimization \nHelped to develop Operational Excellence Programs in different company divisions:  \n• Provided consulting to Intel divisions to develop Operational Excellence Program in Share Services, Product Design and manufacturing groups  \n• Project Manager for top strategic projects for Human Resource Corporate division, managing a global Project team in 8 different cities, Including Europe, Asia and Americas. Lean Six Sigma Master Black Belt Intel Corporation January 2014  – Present (1 year 8 months) Costa Rica Operational Excellence Program Manager: – Global, Optimization \nHelped to develop Operational Excellence Programs in different company divisions:  \n• Provided consulting to Intel divisions to develop Operational Excellence Program in Share Services, Product Design and manufacturing groups  \n• Project Manager for top strategic projects for Human Resource Corporate division, managing a global Project team in 8 different cities, Including Europe, Asia and Americas. Profesor Universidad de Costa Rica May 2014  –  December 2014  (8 months) Costa Rica Professor for the Business Process Improvement course. Electric Engineering School. UCR.  \nThis class included LSS, BPM, Lean Manufacturing as well as TRIZ for graduated bachelors (Electrical Engineers). Profesor Universidad de Costa Rica May 2014  –  December 2014  (8 months) Costa Rica Professor for the Business Process Improvement course. Electric Engineering School. UCR.  \nThis class included LSS, BPM, Lean Manufacturing as well as TRIZ for graduated bachelors (Electrical Engineers). Operational Excellence Manager Intel Corporation January 2012  –  December 2013  (2 years) Global Lean Six Sigma Black Belt Program Manager: – Global HR, Lean and Six Sigma Division Program Manager – January 2010 to 2013 \nGlobal Program Manager for Lean and Six Sigma HR Program at Intel Service Division: \n•Conducted multiple strategic Black Belt projects for the division  \n•Managed Portfolio for $5 million (return of investment) in the division  \n•Coordinated 7 Black Belts working on Lean Six Sigma Projects  \n•Implemented the Operational Excellence Program in Costa Rica Share Service Center (200 people) \n•Program Certified 4 Black Belts and 100 Green Belts and in 35 different project Operational Excellence Manager Intel Corporation January 2012  –  December 2013  (2 years) Global Lean Six Sigma Black Belt Program Manager: – Global HR, Lean and Six Sigma Division Program Manager – January 2010 to 2013 \nGlobal Program Manager for Lean and Six Sigma HR Program at Intel Service Division: \n•Conducted multiple strategic Black Belt projects for the division  \n•Managed Portfolio for $5 million (return of investment) in the division  \n•Coordinated 7 Black Belts working on Lean Six Sigma Projects  \n•Implemented the Operational Excellence Program in Costa Rica Share Service Center (200 people) \n•Program Certified 4 Black Belts and 100 Green Belts and in 35 different project Manager for the Costa Rica Share Service Center Transaction Center Intel Corporation January 2007  –  January 2009  (2 years 1 month) Costa Rica Managed the Costa Rica Transaction Center, which supports transactions for 7 different business partners in America and Europe, getting world class operational results; less than 1500 dpm (defects per million) and more than 90% (customer Satisfaction) for approximately 180,000 standard transactions. Improvements conducted saved $200 K ROI in the operation. Manager for the Costa Rica Share Service Center Transaction Center Intel Corporation January 2007  –  January 2009  (2 years 1 month) Costa Rica Managed the Costa Rica Transaction Center, which supports transactions for 7 different business partners in America and Europe, getting world class operational results; less than 1500 dpm (defects per million) and more than 90% (customer Satisfaction) for approximately 180,000 standard transactions. Improvements conducted saved $200 K ROI in the operation. Languages English Full professional proficiency Spanish Native or bilingual proficiency Portuguese Elementary proficiency English Full professional proficiency Spanish Native or bilingual proficiency Portuguese Elementary proficiency English Full professional proficiency Spanish Native or bilingual proficiency Portuguese Elementary proficiency Full professional proficiency Native or bilingual proficiency Elementary proficiency Skills Process Improvement Lean Manufacturing Operational Excellence Project Management Semiconductors Cross-functional Team... Manufacturing Design of Experiments Business Process... Program Management Six Sigma Strategy Semiconductor Industry Product Management Risk Management Coaching & Mentoring Teaching See 2+     See less Skills  Process Improvement Lean Manufacturing Operational Excellence Project Management Semiconductors Cross-functional Team... Manufacturing Design of Experiments Business Process... Program Management Six Sigma Strategy Semiconductor Industry Product Management Risk Management Coaching & Mentoring Teaching See 2+     See less Process Improvement Lean Manufacturing Operational Excellence Project Management Semiconductors Cross-functional Team... Manufacturing Design of Experiments Business Process... Program Management Six Sigma Strategy Semiconductor Industry Product Management Risk Management Coaching & Mentoring Teaching See 2+     See less Process Improvement Lean Manufacturing Operational Excellence Project Management Semiconductors Cross-functional Team... Manufacturing Design of Experiments Business Process... Program Management Six Sigma Strategy Semiconductor Industry Product Management Risk Management Coaching & Mentoring Teaching See 2+     See less Education Villanova University Lean Six Sigma Master Black Belt,  Lean Six Sigma and Advance Statistics , Master Black Belt 2013  – 2014 Instituto Tecnológico de Costa Rica Master of Business Administration (MBA),  Finance , General 2010  – 2012 Universidad Latinoamericana de Ciencia y Tecnología Licentiate degree,  Industrial Engineering 1997  – 2002 Villanova University Lean Six Sigma Master Black Belt,  Lean Six Sigma and Advance Statistics , Master Black Belt 2013  – 2014 Villanova University Lean Six Sigma Master Black Belt,  Lean Six Sigma and Advance Statistics , Master Black Belt 2013  – 2014 Villanova University Lean Six Sigma Master Black Belt,  Lean Six Sigma and Advance Statistics , Master Black Belt 2013  – 2014 Instituto Tecnológico de Costa Rica Master of Business Administration (MBA),  Finance , General 2010  – 2012 Instituto Tecnológico de Costa Rica Master of Business Administration (MBA),  Finance , General 2010  – 2012 Instituto Tecnológico de Costa Rica Master of Business Administration (MBA),  Finance , General 2010  – 2012 Universidad Latinoamericana de Ciencia y Tecnología Licentiate degree,  Industrial Engineering 1997  – 2002 Universidad Latinoamericana de Ciencia y Tecnología Licentiate degree,  Industrial Engineering 1997  – 2002 Universidad Latinoamericana de Ciencia y Tecnología Licentiate degree,  Industrial Engineering 1997  – 2002 Honors & Awards Global Divisional Recognition Intel 2013 Deployment of the Operational Excellence Program in Global HRES  Organizational Recognition Intel 2010 Reduction of $1.5 Million in Payroll overpayments  Global Divisional Recognition Intel 2009 2009, Global Divisional Recognition; Deployment of global document Retention System for Intel records  \n Global Divisional Recognition Intel 2009 Integration of Global data Management Operation to Costa Rica SSC \n Global Divisional Recognition Intel 2009 Integration of Processes from Israel to Costa Rica Share Service Center  \n Global Divisional Recognition Intel 2008 Brazil Legal Compliance Project. Implementation of Time and attendance system for Intel Brazil  \n Global Divisional Recognition Intel 2007 Legal entity Changes in Costa Rica Site Effort  \n Global Divisional Recognition Intel 2007 Startup of Intel Argentina Cordoba Site  \n Global Divisional Recognition Intel 2006 Regional Implementation of Employee reimbursement Solution (LAR) Global Divisional Recognition Intel 2005 Global Divisional Recognition; Global Implementation of Employee Reimbursement Solution (32 Countries)  Global Divisional Recognition Intel 2013 Deployment of the Operational Excellence Program in Global HRES  Global Divisional Recognition Intel 2013 Deployment of the Operational Excellence Program in Global HRES  Global Divisional Recognition Intel 2013 Deployment of the Operational Excellence Program in Global HRES  Organizational Recognition Intel 2010 Reduction of $1.5 Million in Payroll overpayments  Organizational Recognition Intel 2010 Reduction of $1.5 Million in Payroll overpayments  Organizational Recognition Intel 2010 Reduction of $1.5 Million in Payroll overpayments  Global Divisional Recognition Intel 2009 2009, Global Divisional Recognition; Deployment of global document Retention System for Intel records  \n Global Divisional Recognition Intel 2009 2009, Global Divisional Recognition; Deployment of global document Retention System for Intel records  \n Global Divisional Recognition Intel 2009 2009, Global Divisional Recognition; Deployment of global document Retention System for Intel records  \n Global Divisional Recognition Intel 2009 Integration of Global data Management Operation to Costa Rica SSC \n Global Divisional Recognition Intel 2009 Integration of Global data Management Operation to Costa Rica SSC \n Global Divisional Recognition Intel 2009 Integration of Global data Management Operation to Costa Rica SSC \n Global Divisional Recognition Intel 2009 Integration of Processes from Israel to Costa Rica Share Service Center  \n Global Divisional Recognition Intel 2009 Integration of Processes from Israel to Costa Rica Share Service Center  \n Global Divisional Recognition Intel 2009 Integration of Processes from Israel to Costa Rica Share Service Center  \n Global Divisional Recognition Intel 2008 Brazil Legal Compliance Project. Implementation of Time and attendance system for Intel Brazil  \n Global Divisional Recognition Intel 2008 Brazil Legal Compliance Project. Implementation of Time and attendance system for Intel Brazil  \n Global Divisional Recognition Intel 2008 Brazil Legal Compliance Project. Implementation of Time and attendance system for Intel Brazil  \n Global Divisional Recognition Intel 2007 Legal entity Changes in Costa Rica Site Effort  \n Global Divisional Recognition Intel 2007 Legal entity Changes in Costa Rica Site Effort  \n Global Divisional Recognition Intel 2007 Legal entity Changes in Costa Rica Site Effort  \n Global Divisional Recognition Intel 2007 Startup of Intel Argentina Cordoba Site  \n Global Divisional Recognition Intel 2007 Startup of Intel Argentina Cordoba Site  \n Global Divisional Recognition Intel 2007 Startup of Intel Argentina Cordoba Site  \n Global Divisional Recognition Intel 2006 Regional Implementation of Employee reimbursement Solution (LAR) Global Divisional Recognition Intel 2006 Regional Implementation of Employee reimbursement Solution (LAR) Global Divisional Recognition Intel 2006 Regional Implementation of Employee reimbursement Solution (LAR) Global Divisional Recognition Intel 2005 Global Divisional Recognition; Global Implementation of Employee Reimbursement Solution (32 Countries)  Global Divisional Recognition Intel 2005 Global Divisional Recognition; Global Implementation of Employee Reimbursement Solution (32 Countries)  Global Divisional Recognition Intel 2005 Global Divisional Recognition; Global Implementation of Employee Reimbursement Solution (32 Countries)  ", "Languages   Skills Semiconductors Six Sigma Cross-functional Team... Program Management Design of Experiments IT Service Management Process Improvement Business Analysis Lean Manufacturing Software Project... Business Process SPC Process Engineering Product Development Continuous Improvement Manufacturing PMP Product Management SDLC Supply Chain Management IT Strategy Business Process... ITIL Testing Vendor Management Quality Assurance Service Management Intel JMP Supply Management DMAIC Integration Failure Analysis FMEA Engineering Management See 20+     See less Skills  Semiconductors Six Sigma Cross-functional Team... Program Management Design of Experiments IT Service Management Process Improvement Business Analysis Lean Manufacturing Software Project... Business Process SPC Process Engineering Product Development Continuous Improvement Manufacturing PMP Product Management SDLC Supply Chain Management IT Strategy Business Process... ITIL Testing Vendor Management Quality Assurance Service Management Intel JMP Supply Management DMAIC Integration Failure Analysis FMEA Engineering Management See 20+     See less Semiconductors Six Sigma Cross-functional Team... Program Management Design of Experiments IT Service Management Process Improvement Business Analysis Lean Manufacturing Software Project... Business Process SPC Process Engineering Product Development Continuous Improvement Manufacturing PMP Product Management SDLC Supply Chain Management IT Strategy Business Process... ITIL Testing Vendor Management Quality Assurance Service Management Intel JMP Supply Management DMAIC Integration Failure Analysis FMEA Engineering Management See 20+     See less Semiconductors Six Sigma Cross-functional Team... Program Management Design of Experiments IT Service Management Process Improvement Business Analysis Lean Manufacturing Software Project... Business Process SPC Process Engineering Product Development Continuous Improvement Manufacturing PMP Product Management SDLC Supply Chain Management IT Strategy Business Process... ITIL Testing Vendor Management Quality Assurance Service Management Intel JMP Supply Management DMAIC Integration Failure Analysis FMEA Engineering Management See 20+     See less Education Arizona State University 1990  – 1996 charlie girard Arizona State University 1990  – 1996 Arizona State University 1990  – 1996 Arizona State University 1990  – 1996 charlie girard charlie girard charlie girard ", "Summary Accomplished and experienced professional with excellent abilities in management, six sigma/operational excellence, healthcare, drug development, project management, computer technology, training, and professional speaking. Summary Accomplished and experienced professional with excellent abilities in management, six sigma/operational excellence, healthcare, drug development, project management, computer technology, training, and professional speaking. Accomplished and experienced professional with excellent abilities in management, six sigma/operational excellence, healthcare, drug development, project management, computer technology, training, and professional speaking. Accomplished and experienced professional with excellent abilities in management, six sigma/operational excellence, healthcare, drug development, project management, computer technology, training, and professional speaking. Experience Lean Six Sigma Master Black Belt / Operational Excellence Manager Intel Corporation | Sales and Marketing May 2011  – Present (4 years 4 months) Chandler, AZ Lean Six Sigma Master Black Belt managing strategy, deployment, teams and consulting business leaders using broad knowledge of the Operational Excellence Methodologies (BPM, Lean Six Sigma, Agile, Innovation) within mulitiple organizations of Intel Corporation. Overall ROI savings (Intel Corporation): $62M Founder Infinitum Health, LLC July 2013  – Present (2 years 2 months) scottsdale, az Infinitum Health, LLC (www.infinitumhealth.com) was created to deliver a high quality holistic healthcare products. Our flagship products, Infinimin® (Ultravitamin) and Infiniderm® (Daily Youth Lotion), combines a base formulation with additional organic extracts proven by evidence based research for their anti-tumor, anti-viral, anti-inflammatory, anti-aging, and other immunstimulating effects. Infinitum Health's vision is to provide evidence based products to increase the overall health of the consumer. As Infinitum Health grows, we plan to have strong evidence-based research behind every product to help support its use, further its research, and expand its reach across the globe. We feel that by providing the evidence-based research to the consumer, they can be empowered and inform themselves on related health benefits. We look forward to collaborating with our consumer in providing a “healthful existence, forever, without limits.” Director of Business Improvement / Six Sigma Master Black Belt Apollo Group April 2010  –  May 2011  (1 year 2 months) Support, develop and nurture process excellence through coaching, training and mentoring of leaders and consultants at all levels on process improvement activities. Additionally, lead high impact global transactional and operational process improvement projects using appropriate Lean/Six Sigma methods to achieve project objectives that support Apollo and University of Phoenix’s Strategy. Quality Assurance and Regulatory Affairs Manager / Six Sigma Black Belt Covance Laboratories November 2008  –  March 2010  (1 year 5 months) Startup and manage the Covance Laboratories Quality Assurance group for the Chandler, AZ site. Staff and serve as the facility’s primary QA contact. Guide and manages Covance North America’s quality and continuous improvement staff to achieve maximum effectiveness in ensuring regulatory compliance, meeting customer needs, and achieving business results. Consult business units on compliance issues and issue resolution. Host client visits, FDA and associated regulatory agency visit, as well as maintaining site Standard Operating Procedures (SOPs). Founder theBazaar.com January 2008  –  April 2009  (1 year 4 months) Madison, Wisconsin Area Electronics Drop Shipping firm - base clients for drop shipping process were Best Buy, Walmart, Circuit City. Key markets: United States, Japan, Taiwan. Thailand. Aided reducing operating WIP for all firms prior to public shelving of electronics products. (Sold Assets: 4/2009) Six Sigma Black Belt Covance December 2006  –  November 2008  (2 years) Responsible to leading business process improvement projects on a global scale. Mentor Green Belt projects to completion in addition to teaching Six Sigma training courses. Consult specific business units on multiple process and/or strategy concerns for improvement. Founder Wealth Weekly February 2006  –  October 2007  (1 year 9 months) Madison, Wisconsin Area Wealth-Weekly.com - weekly newsletter for targeted audience of young entrepreneurs looking to learn financial strategies, investing, and general business startup finance. Took 150 person subscriber base from original asset list to 14327 with 55% open rate of newsletters within 18 months. \n[Purchased Assets from YoungWealthWeekly.com (2006); Sold Wealth-Weekly.com assets 10/2007. Purchasing firm: Money.com] Supervisor, Toxicology Operations Covance March 2005  –  January 2007  (1 year 11 months) Manage a group of 10 technicians that have carried out 45 preclinical drug development phase studies on all approved animal models with a net contract revenue of $34,181,163. Involved in numerous process improvement projects with a total savings of $234,435 for the year of 2005. Maintain a national intranet site for >500 employees. Maintain budget, revenue, and efficiency data involved within the department. Train new employees on study management, write standard operating procedures (SOPs), and collaborate with the study direction staff on study protocol design. Perform corporate training sessions for new employees regarding “Drug Development”, “The Role of the Manager”, and “Animals and the Miracles of Medicine.” Founder Miragetemplates.com January 2005  –  March 2006  (1 year 3 months) Madison, Wisconsin Area \"Creating optical phenomenons for web site™\"  \nOnline Website Template shop for small and mid size businesses offering full website setup, editing, and launching tools. Sold Assets 2/2006, Purchasing Company: Templatemonster.com) Research and Development Technician/Key Trainer Covance February 2003  –  February 2005  (2 years 1 month) Carry out highly complex pharmaceutical and biotechnology studies on large animal species (non-human primates, canines, swine, and feline) while maintaining strong relationships with clients and upholding federal regulations for FDA approval. Mentor and train technical aspects of study technician to younger employees. Lean Six Sigma Master Black Belt / Operational Excellence Manager Intel Corporation | Sales and Marketing May 2011  – Present (4 years 4 months) Chandler, AZ Lean Six Sigma Master Black Belt managing strategy, deployment, teams and consulting business leaders using broad knowledge of the Operational Excellence Methodologies (BPM, Lean Six Sigma, Agile, Innovation) within mulitiple organizations of Intel Corporation. Overall ROI savings (Intel Corporation): $62M Lean Six Sigma Master Black Belt / Operational Excellence Manager Intel Corporation | Sales and Marketing May 2011  – Present (4 years 4 months) Chandler, AZ Lean Six Sigma Master Black Belt managing strategy, deployment, teams and consulting business leaders using broad knowledge of the Operational Excellence Methodologies (BPM, Lean Six Sigma, Agile, Innovation) within mulitiple organizations of Intel Corporation. Overall ROI savings (Intel Corporation): $62M Founder Infinitum Health, LLC July 2013  – Present (2 years 2 months) scottsdale, az Infinitum Health, LLC (www.infinitumhealth.com) was created to deliver a high quality holistic healthcare products. Our flagship products, Infinimin® (Ultravitamin) and Infiniderm® (Daily Youth Lotion), combines a base formulation with additional organic extracts proven by evidence based research for their anti-tumor, anti-viral, anti-inflammatory, anti-aging, and other immunstimulating effects. Infinitum Health's vision is to provide evidence based products to increase the overall health of the consumer. As Infinitum Health grows, we plan to have strong evidence-based research behind every product to help support its use, further its research, and expand its reach across the globe. We feel that by providing the evidence-based research to the consumer, they can be empowered and inform themselves on related health benefits. We look forward to collaborating with our consumer in providing a “healthful existence, forever, without limits.” Founder Infinitum Health, LLC July 2013  – Present (2 years 2 months) scottsdale, az Infinitum Health, LLC (www.infinitumhealth.com) was created to deliver a high quality holistic healthcare products. Our flagship products, Infinimin® (Ultravitamin) and Infiniderm® (Daily Youth Lotion), combines a base formulation with additional organic extracts proven by evidence based research for their anti-tumor, anti-viral, anti-inflammatory, anti-aging, and other immunstimulating effects. Infinitum Health's vision is to provide evidence based products to increase the overall health of the consumer. As Infinitum Health grows, we plan to have strong evidence-based research behind every product to help support its use, further its research, and expand its reach across the globe. We feel that by providing the evidence-based research to the consumer, they can be empowered and inform themselves on related health benefits. We look forward to collaborating with our consumer in providing a “healthful existence, forever, without limits.” Director of Business Improvement / Six Sigma Master Black Belt Apollo Group April 2010  –  May 2011  (1 year 2 months) Support, develop and nurture process excellence through coaching, training and mentoring of leaders and consultants at all levels on process improvement activities. Additionally, lead high impact global transactional and operational process improvement projects using appropriate Lean/Six Sigma methods to achieve project objectives that support Apollo and University of Phoenix’s Strategy. Director of Business Improvement / Six Sigma Master Black Belt Apollo Group April 2010  –  May 2011  (1 year 2 months) Support, develop and nurture process excellence through coaching, training and mentoring of leaders and consultants at all levels on process improvement activities. Additionally, lead high impact global transactional and operational process improvement projects using appropriate Lean/Six Sigma methods to achieve project objectives that support Apollo and University of Phoenix’s Strategy. Quality Assurance and Regulatory Affairs Manager / Six Sigma Black Belt Covance Laboratories November 2008  –  March 2010  (1 year 5 months) Startup and manage the Covance Laboratories Quality Assurance group for the Chandler, AZ site. Staff and serve as the facility’s primary QA contact. Guide and manages Covance North America’s quality and continuous improvement staff to achieve maximum effectiveness in ensuring regulatory compliance, meeting customer needs, and achieving business results. Consult business units on compliance issues and issue resolution. Host client visits, FDA and associated regulatory agency visit, as well as maintaining site Standard Operating Procedures (SOPs). Quality Assurance and Regulatory Affairs Manager / Six Sigma Black Belt Covance Laboratories November 2008  –  March 2010  (1 year 5 months) Startup and manage the Covance Laboratories Quality Assurance group for the Chandler, AZ site. Staff and serve as the facility’s primary QA contact. Guide and manages Covance North America’s quality and continuous improvement staff to achieve maximum effectiveness in ensuring regulatory compliance, meeting customer needs, and achieving business results. Consult business units on compliance issues and issue resolution. Host client visits, FDA and associated regulatory agency visit, as well as maintaining site Standard Operating Procedures (SOPs). Founder theBazaar.com January 2008  –  April 2009  (1 year 4 months) Madison, Wisconsin Area Electronics Drop Shipping firm - base clients for drop shipping process were Best Buy, Walmart, Circuit City. Key markets: United States, Japan, Taiwan. Thailand. Aided reducing operating WIP for all firms prior to public shelving of electronics products. (Sold Assets: 4/2009) Founder theBazaar.com January 2008  –  April 2009  (1 year 4 months) Madison, Wisconsin Area Electronics Drop Shipping firm - base clients for drop shipping process were Best Buy, Walmart, Circuit City. Key markets: United States, Japan, Taiwan. Thailand. Aided reducing operating WIP for all firms prior to public shelving of electronics products. (Sold Assets: 4/2009) Six Sigma Black Belt Covance December 2006  –  November 2008  (2 years) Responsible to leading business process improvement projects on a global scale. Mentor Green Belt projects to completion in addition to teaching Six Sigma training courses. Consult specific business units on multiple process and/or strategy concerns for improvement. Six Sigma Black Belt Covance December 2006  –  November 2008  (2 years) Responsible to leading business process improvement projects on a global scale. Mentor Green Belt projects to completion in addition to teaching Six Sigma training courses. Consult specific business units on multiple process and/or strategy concerns for improvement. Founder Wealth Weekly February 2006  –  October 2007  (1 year 9 months) Madison, Wisconsin Area Wealth-Weekly.com - weekly newsletter for targeted audience of young entrepreneurs looking to learn financial strategies, investing, and general business startup finance. Took 150 person subscriber base from original asset list to 14327 with 55% open rate of newsletters within 18 months. \n[Purchased Assets from YoungWealthWeekly.com (2006); Sold Wealth-Weekly.com assets 10/2007. Purchasing firm: Money.com] Founder Wealth Weekly February 2006  –  October 2007  (1 year 9 months) Madison, Wisconsin Area Wealth-Weekly.com - weekly newsletter for targeted audience of young entrepreneurs looking to learn financial strategies, investing, and general business startup finance. Took 150 person subscriber base from original asset list to 14327 with 55% open rate of newsletters within 18 months. \n[Purchased Assets from YoungWealthWeekly.com (2006); Sold Wealth-Weekly.com assets 10/2007. Purchasing firm: Money.com] Supervisor, Toxicology Operations Covance March 2005  –  January 2007  (1 year 11 months) Manage a group of 10 technicians that have carried out 45 preclinical drug development phase studies on all approved animal models with a net contract revenue of $34,181,163. Involved in numerous process improvement projects with a total savings of $234,435 for the year of 2005. Maintain a national intranet site for >500 employees. Maintain budget, revenue, and efficiency data involved within the department. Train new employees on study management, write standard operating procedures (SOPs), and collaborate with the study direction staff on study protocol design. Perform corporate training sessions for new employees regarding “Drug Development”, “The Role of the Manager”, and “Animals and the Miracles of Medicine.” Supervisor, Toxicology Operations Covance March 2005  –  January 2007  (1 year 11 months) Manage a group of 10 technicians that have carried out 45 preclinical drug development phase studies on all approved animal models with a net contract revenue of $34,181,163. Involved in numerous process improvement projects with a total savings of $234,435 for the year of 2005. Maintain a national intranet site for >500 employees. Maintain budget, revenue, and efficiency data involved within the department. Train new employees on study management, write standard operating procedures (SOPs), and collaborate with the study direction staff on study protocol design. Perform corporate training sessions for new employees regarding “Drug Development”, “The Role of the Manager”, and “Animals and the Miracles of Medicine.” Founder Miragetemplates.com January 2005  –  March 2006  (1 year 3 months) Madison, Wisconsin Area \"Creating optical phenomenons for web site™\"  \nOnline Website Template shop for small and mid size businesses offering full website setup, editing, and launching tools. Sold Assets 2/2006, Purchasing Company: Templatemonster.com) Founder Miragetemplates.com January 2005  –  March 2006  (1 year 3 months) Madison, Wisconsin Area \"Creating optical phenomenons for web site™\"  \nOnline Website Template shop for small and mid size businesses offering full website setup, editing, and launching tools. Sold Assets 2/2006, Purchasing Company: Templatemonster.com) Research and Development Technician/Key Trainer Covance February 2003  –  February 2005  (2 years 1 month) Carry out highly complex pharmaceutical and biotechnology studies on large animal species (non-human primates, canines, swine, and feline) while maintaining strong relationships with clients and upholding federal regulations for FDA approval. Mentor and train technical aspects of study technician to younger employees. Research and Development Technician/Key Trainer Covance February 2003  –  February 2005  (2 years 1 month) Carry out highly complex pharmaceutical and biotechnology studies on large animal species (non-human primates, canines, swine, and feline) while maintaining strong relationships with clients and upholding federal regulations for FDA approval. Mentor and train technical aspects of study technician to younger employees. Skills Six Sigma Start-ups Root Cause Analysis Change Management Strategy Operational Excellence GLP Supply Chain Management Team Leadership Technology Transfer Coaching Organizational... Biotechnology Performance Management Process Engineering Project Planning Business Analysis Operations Management Analysis Lean Manufacturing Quality Management Problem Solving Strategic Planning Design of Experiments Product Development Small Business Leadership Development Vendor Management Training Pharmaceutical Industry Business Process... Quality Assurance Visio Competitive Analysis Medical Devices Team Building Quality System Business Strategy New Business Development Lifesciences R&D Data Analysis Entrepreneurship Product Management Cross-functional Team... Quality Control Business Development Project Portfolio... Process Improvement Management See 35+     See less Skills  Six Sigma Start-ups Root Cause Analysis Change Management Strategy Operational Excellence GLP Supply Chain Management Team Leadership Technology Transfer Coaching Organizational... Biotechnology Performance Management Process Engineering Project Planning Business Analysis Operations Management Analysis Lean Manufacturing Quality Management Problem Solving Strategic Planning Design of Experiments Product Development Small Business Leadership Development Vendor Management Training Pharmaceutical Industry Business Process... Quality Assurance Visio Competitive Analysis Medical Devices Team Building Quality System Business Strategy New Business Development Lifesciences R&D Data Analysis Entrepreneurship Product Management Cross-functional Team... Quality Control Business Development Project Portfolio... Process Improvement Management See 35+     See less Six Sigma Start-ups Root Cause Analysis Change Management Strategy Operational Excellence GLP Supply Chain Management Team Leadership Technology Transfer Coaching Organizational... Biotechnology Performance Management Process Engineering Project Planning Business Analysis Operations Management Analysis Lean Manufacturing Quality Management Problem Solving Strategic Planning Design of Experiments Product Development Small Business Leadership Development Vendor Management Training Pharmaceutical Industry Business Process... Quality Assurance Visio Competitive Analysis Medical Devices Team Building Quality System Business Strategy New Business Development Lifesciences R&D Data Analysis Entrepreneurship Product Management Cross-functional Team... Quality Control Business Development Project Portfolio... Process Improvement Management See 35+     See less Six Sigma Start-ups Root Cause Analysis Change Management Strategy Operational Excellence GLP Supply Chain Management Team Leadership Technology Transfer Coaching Organizational... Biotechnology Performance Management Process Engineering Project Planning Business Analysis Operations Management Analysis Lean Manufacturing Quality Management Problem Solving Strategic Planning Design of Experiments Product Development Small Business Leadership Development Vendor Management Training Pharmaceutical Industry Business Process... Quality Assurance Visio Competitive Analysis Medical Devices Team Building Quality System Business Strategy New Business Development Lifesciences R&D Data Analysis Entrepreneurship Product Management Cross-functional Team... Quality Control Business Development Project Portfolio... Process Improvement Management See 35+     See less Education Massachusetts Institute of Technology Executive Management Program,  Strategy and Innovation 2013  – 2013 Intel Corporation Lean Six Sigma Master Black Belt Certification 2011  – 2012 Ira A. Fulton Schools of Engineering at Arizona State University Certification,  Six Sigma Master Black Belt Certification 2011  – 2011 University of Arizona, Eller College of Management Master of Business Administration (MBA) 2009  – 2010 University of Wisconsin-Madison Master of Science (MS),  Biotechnology 2007  – 2009 Graduation Thesis: \"Insulin Growth Factor-1 for Muscular Dystrophy and Wound Healing\", University of Wisconsin-Medical School, Dept of Physiology (2009) Activities and Societies:  Co-founder: Business and Biotech Consortium\nWisconsin Biotechnology and Medical Device Association (Operations and Education Committee Board Member)\nSouthern Wisconsin Association for Lab Animal Science (President ,  2007-Present) Covance Laboratories, Inc Certification,  Six Sigma Black Belt Certification 2006  – 2008 Six Sigma Academy Certification,  Six Sigma Black Belt Certification 2006  – 2006 University of Wisconsin-Madison BS,  Biology 2000  – 2002 Activities and Societies:  Tri-Beta Biological Honor Society Founder and President (2001-2002)\nBiology Club President (2001)\nVarsity Athlete (Swimming and Diving) University of Wisconsin-Stevens Point N/A,  Biology 1998  – 2000 1999 NCAA All-American (3-meter Diving) \nUW-Stevens Point Pool Record Holder (3-meter diving, Score: 507.75) Activities and Societies:  Teaching Assistant (BIO 285: Human Physiology)\nVarsity Athlete (Swimming and Diving) Massachusetts Institute of Technology Executive Management Program,  Strategy and Innovation 2013  – 2013 Massachusetts Institute of Technology Executive Management Program,  Strategy and Innovation 2013  – 2013 Massachusetts Institute of Technology Executive Management Program,  Strategy and Innovation 2013  – 2013 Intel Corporation Lean Six Sigma Master Black Belt Certification 2011  – 2012 Intel Corporation Lean Six Sigma Master Black Belt Certification 2011  – 2012 Intel Corporation Lean Six Sigma Master Black Belt Certification 2011  – 2012 Ira A. Fulton Schools of Engineering at Arizona State University Certification,  Six Sigma Master Black Belt Certification 2011  – 2011 Ira A. Fulton Schools of Engineering at Arizona State University Certification,  Six Sigma Master Black Belt Certification 2011  – 2011 Ira A. Fulton Schools of Engineering at Arizona State University Certification,  Six Sigma Master Black Belt Certification 2011  – 2011 University of Arizona, Eller College of Management Master of Business Administration (MBA) 2009  – 2010 University of Arizona, Eller College of Management Master of Business Administration (MBA) 2009  – 2010 University of Arizona, Eller College of Management Master of Business Administration (MBA) 2009  – 2010 University of Wisconsin-Madison Master of Science (MS),  Biotechnology 2007  – 2009 Graduation Thesis: \"Insulin Growth Factor-1 for Muscular Dystrophy and Wound Healing\", University of Wisconsin-Medical School, Dept of Physiology (2009) Activities and Societies:  Co-founder: Business and Biotech Consortium\nWisconsin Biotechnology and Medical Device Association (Operations and Education Committee Board Member)\nSouthern Wisconsin Association for Lab Animal Science (President ,  2007-Present) University of Wisconsin-Madison Master of Science (MS),  Biotechnology 2007  – 2009 Graduation Thesis: \"Insulin Growth Factor-1 for Muscular Dystrophy and Wound Healing\", University of Wisconsin-Medical School, Dept of Physiology (2009) Activities and Societies:  Co-founder: Business and Biotech Consortium\nWisconsin Biotechnology and Medical Device Association (Operations and Education Committee Board Member)\nSouthern Wisconsin Association for Lab Animal Science (President ,  2007-Present) University of Wisconsin-Madison Master of Science (MS),  Biotechnology 2007  – 2009 Graduation Thesis: \"Insulin Growth Factor-1 for Muscular Dystrophy and Wound Healing\", University of Wisconsin-Medical School, Dept of Physiology (2009) Activities and Societies:  Co-founder: Business and Biotech Consortium\nWisconsin Biotechnology and Medical Device Association (Operations and Education Committee Board Member)\nSouthern Wisconsin Association for Lab Animal Science (President ,  2007-Present) Covance Laboratories, Inc Certification,  Six Sigma Black Belt Certification 2006  – 2008 Covance Laboratories, Inc Certification,  Six Sigma Black Belt Certification 2006  – 2008 Covance Laboratories, Inc Certification,  Six Sigma Black Belt Certification 2006  – 2008 Six Sigma Academy Certification,  Six Sigma Black Belt Certification 2006  – 2006 Six Sigma Academy Certification,  Six Sigma Black Belt Certification 2006  – 2006 Six Sigma Academy Certification,  Six Sigma Black Belt Certification 2006  – 2006 University of Wisconsin-Madison BS,  Biology 2000  – 2002 Activities and Societies:  Tri-Beta Biological Honor Society Founder and President (2001-2002)\nBiology Club President (2001)\nVarsity Athlete (Swimming and Diving) University of Wisconsin-Madison BS,  Biology 2000  – 2002 Activities and Societies:  Tri-Beta Biological Honor Society Founder and President (2001-2002)\nBiology Club President (2001)\nVarsity Athlete (Swimming and Diving) University of Wisconsin-Madison BS,  Biology 2000  – 2002 Activities and Societies:  Tri-Beta Biological Honor Society Founder and President (2001-2002)\nBiology Club President (2001)\nVarsity Athlete (Swimming and Diving) University of Wisconsin-Stevens Point N/A,  Biology 1998  – 2000 1999 NCAA All-American (3-meter Diving) \nUW-Stevens Point Pool Record Holder (3-meter diving, Score: 507.75) Activities and Societies:  Teaching Assistant (BIO 285: Human Physiology)\nVarsity Athlete (Swimming and Diving) University of Wisconsin-Stevens Point N/A,  Biology 1998  – 2000 1999 NCAA All-American (3-meter Diving) \nUW-Stevens Point Pool Record Holder (3-meter diving, Score: 507.75) Activities and Societies:  Teaching Assistant (BIO 285: Human Physiology)\nVarsity Athlete (Swimming and Diving) University of Wisconsin-Stevens Point N/A,  Biology 1998  – 2000 1999 NCAA All-American (3-meter Diving) \nUW-Stevens Point Pool Record Holder (3-meter diving, Score: 507.75) Activities and Societies:  Teaching Assistant (BIO 285: Human Physiology)\nVarsity Athlete (Swimming and Diving) ", "Skills Process Improvement DMAIC Intel Operational Excellence Data Analysis JMP Business Process... Business Process Change Management Cross-functional Team... FMEA Leadership Six Sigma Integration CRM Semiconductors Training Management Lean Manufacturing SPC Supply Management Procurement Project Planning Logistics Continuous Improvement Kaizen Value Stream Mapping Program Management Process Engineering Quality System Design of Experiments Root Cause Analysis Supply Chain Management Product Management 5S Software Project... See 21+     See less Skills  Process Improvement DMAIC Intel Operational Excellence Data Analysis JMP Business Process... Business Process Change Management Cross-functional Team... FMEA Leadership Six Sigma Integration CRM Semiconductors Training Management Lean Manufacturing SPC Supply Management Procurement Project Planning Logistics Continuous Improvement Kaizen Value Stream Mapping Program Management Process Engineering Quality System Design of Experiments Root Cause Analysis Supply Chain Management Product Management 5S Software Project... See 21+     See less Process Improvement DMAIC Intel Operational Excellence Data Analysis JMP Business Process... Business Process Change Management Cross-functional Team... FMEA Leadership Six Sigma Integration CRM Semiconductors Training Management Lean Manufacturing SPC Supply Management Procurement Project Planning Logistics Continuous Improvement Kaizen Value Stream Mapping Program Management Process Engineering Quality System Design of Experiments Root Cause Analysis Supply Chain Management Product Management 5S Software Project... See 21+     See less Process Improvement DMAIC Intel Operational Excellence Data Analysis JMP Business Process... Business Process Change Management Cross-functional Team... FMEA Leadership Six Sigma Integration CRM Semiconductors Training Management Lean Manufacturing SPC Supply Management Procurement Project Planning Logistics Continuous Improvement Kaizen Value Stream Mapping Program Management Process Engineering Quality System Design of Experiments Root Cause Analysis Supply Chain Management Product Management 5S Software Project... See 21+     See less "]}