{"position": "Manager", "company": "Intel Corporation", "profiles": ["Experience General Manager Cross- Enterprise Services IT Intel Corporation June 2015  – Present (3 months) Hillsboro, or Leading ~500 person team that develops and supports IT for Finance, HR and Legal systems, as well as, User Experience.  General Manager, Supply Chain Information Technology Intel Corporation November 2012  –  June 2015  (2 years 8 months) Beaverton, Oregon Disciplined in Results Orientation: Led Information Technology Supply Chain segment ~600 HC and total budgetary responsibility for ~$96M. Executed technology roadmap to enable in excess of $140M in inventory savings, $1M in transportation optimization, 2X increase user experience scores for purchase order system and much more business value. \n \nAccomplished in Strategy and Process development and execution: Awarded 2014 Intel Quality Award for excellence in performance to Intel Values as one of the best run organizations in all of Intel Corp. Developed and drove new Supply Chain strategy for Intel’s global supply chain partners. Intel is currently ranked #4 on Gartner’s Top 25 Supply Chains.  \n \nProficient in Management/Leadership skill and building excellent teams: Executive sponsor of OR Women at Intel Network Employee Resource Group. Current Organizational Health and individual Leadership Feedback Tool scores exceed corporate average across all questions. Experience in managing global teams with multi-spans/levels and cross-site organizations. Co-developed IT’s Leadership Academy curriculum and personally developing and leading the sessions- targeted at growing the next generation of IT leadership. Extensively used as formal mentor and informal coach for numerous Intel employees.  \n \nExtensive experience in Supply Chain Operational and Support positions: Led IT organization responsible for developing/delivering IT solutions for Global Sourcing and Procurement, Corporate Services, Foundry, Customer Planning and Logistics and Sales and Marketing Geo Operations.\tManaged direct logistics operations in factory, warehouses, and site services; as well as planning/materials, engineering, and training, safety and support functions. Numerous Supply/Demand and Planning positions held in support of product groups  \n Director, Supply Fulfillment Information Solutions Intel Corporation March 2010  –  November 2012  (2 years 9 months) Supply Chain Strategy Manager Intel Corporation October 2009  –  March 2010  (6 months) Supply Chain Industrial Engineering and Statistics Manager and Channel Integration Team Manager Intel Corporation April 2008  –  October 2009  (1 year 7 months) Supply Chain Industrial Engineering and Statistics Manager Intel Corporation May 2007  –  April 2008  (1 year) Supply Chain Industrial and Manufacturing Engineering Manager Intel Corporation August 2006  –  May 2007  (10 months) Worldwide Logistics Strategy Manager Intel Corporation May 2005  –  August 2006  (1 year 4 months) Northwest Packaging and Distribution Regional Operations Manager Intel Corporation December 2002  –  December 2004  (2 years 1 month) Branded Packaging and Services Mfg. Operations Manager Intel Corporation February 2002  –  December 2002  (11 months) Planning and Business Operations Manager Intel Corporation November 2000  –  February 2002  (1 year 4 months) Supply Planning Manager Intel Corporation May 1999  –  November 2000  (1 year 7 months) Supply Demand Manager Intel Corporation August 1998  –  May 1999  (10 months) Customer Program Manager Intel Corporation August 1997  –  August 1998  (1 year 1 month) Materials Program Manager Intel Corporation July 1996  –  August 1997  (1 year 2 months) General Manager Cross- Enterprise Services IT Intel Corporation June 2015  – Present (3 months) Hillsboro, or Leading ~500 person team that develops and supports IT for Finance, HR and Legal systems, as well as, User Experience.  General Manager Cross- Enterprise Services IT Intel Corporation June 2015  – Present (3 months) Hillsboro, or Leading ~500 person team that develops and supports IT for Finance, HR and Legal systems, as well as, User Experience.  General Manager, Supply Chain Information Technology Intel Corporation November 2012  –  June 2015  (2 years 8 months) Beaverton, Oregon Disciplined in Results Orientation: Led Information Technology Supply Chain segment ~600 HC and total budgetary responsibility for ~$96M. Executed technology roadmap to enable in excess of $140M in inventory savings, $1M in transportation optimization, 2X increase user experience scores for purchase order system and much more business value. \n \nAccomplished in Strategy and Process development and execution: Awarded 2014 Intel Quality Award for excellence in performance to Intel Values as one of the best run organizations in all of Intel Corp. Developed and drove new Supply Chain strategy for Intel’s global supply chain partners. Intel is currently ranked #4 on Gartner’s Top 25 Supply Chains.  \n \nProficient in Management/Leadership skill and building excellent teams: Executive sponsor of OR Women at Intel Network Employee Resource Group. Current Organizational Health and individual Leadership Feedback Tool scores exceed corporate average across all questions. Experience in managing global teams with multi-spans/levels and cross-site organizations. Co-developed IT’s Leadership Academy curriculum and personally developing and leading the sessions- targeted at growing the next generation of IT leadership. Extensively used as formal mentor and informal coach for numerous Intel employees.  \n \nExtensive experience in Supply Chain Operational and Support positions: Led IT organization responsible for developing/delivering IT solutions for Global Sourcing and Procurement, Corporate Services, Foundry, Customer Planning and Logistics and Sales and Marketing Geo Operations.\tManaged direct logistics operations in factory, warehouses, and site services; as well as planning/materials, engineering, and training, safety and support functions. Numerous Supply/Demand and Planning positions held in support of product groups  \n General Manager, Supply Chain Information Technology Intel Corporation November 2012  –  June 2015  (2 years 8 months) Beaverton, Oregon Disciplined in Results Orientation: Led Information Technology Supply Chain segment ~600 HC and total budgetary responsibility for ~$96M. Executed technology roadmap to enable in excess of $140M in inventory savings, $1M in transportation optimization, 2X increase user experience scores for purchase order system and much more business value. \n \nAccomplished in Strategy and Process development and execution: Awarded 2014 Intel Quality Award for excellence in performance to Intel Values as one of the best run organizations in all of Intel Corp. Developed and drove new Supply Chain strategy for Intel’s global supply chain partners. Intel is currently ranked #4 on Gartner’s Top 25 Supply Chains.  \n \nProficient in Management/Leadership skill and building excellent teams: Executive sponsor of OR Women at Intel Network Employee Resource Group. Current Organizational Health and individual Leadership Feedback Tool scores exceed corporate average across all questions. Experience in managing global teams with multi-spans/levels and cross-site organizations. Co-developed IT’s Leadership Academy curriculum and personally developing and leading the sessions- targeted at growing the next generation of IT leadership. Extensively used as formal mentor and informal coach for numerous Intel employees.  \n \nExtensive experience in Supply Chain Operational and Support positions: Led IT organization responsible for developing/delivering IT solutions for Global Sourcing and Procurement, Corporate Services, Foundry, Customer Planning and Logistics and Sales and Marketing Geo Operations.\tManaged direct logistics operations in factory, warehouses, and site services; as well as planning/materials, engineering, and training, safety and support functions. Numerous Supply/Demand and Planning positions held in support of product groups  \n Director, Supply Fulfillment Information Solutions Intel Corporation March 2010  –  November 2012  (2 years 9 months) Director, Supply Fulfillment Information Solutions Intel Corporation March 2010  –  November 2012  (2 years 9 months) Supply Chain Strategy Manager Intel Corporation October 2009  –  March 2010  (6 months) Supply Chain Strategy Manager Intel Corporation October 2009  –  March 2010  (6 months) Supply Chain Industrial Engineering and Statistics Manager and Channel Integration Team Manager Intel Corporation April 2008  –  October 2009  (1 year 7 months) Supply Chain Industrial Engineering and Statistics Manager and Channel Integration Team Manager Intel Corporation April 2008  –  October 2009  (1 year 7 months) Supply Chain Industrial Engineering and Statistics Manager Intel Corporation May 2007  –  April 2008  (1 year) Supply Chain Industrial Engineering and Statistics Manager Intel Corporation May 2007  –  April 2008  (1 year) Supply Chain Industrial and Manufacturing Engineering Manager Intel Corporation August 2006  –  May 2007  (10 months) Supply Chain Industrial and Manufacturing Engineering Manager Intel Corporation August 2006  –  May 2007  (10 months) Worldwide Logistics Strategy Manager Intel Corporation May 2005  –  August 2006  (1 year 4 months) Worldwide Logistics Strategy Manager Intel Corporation May 2005  –  August 2006  (1 year 4 months) Northwest Packaging and Distribution Regional Operations Manager Intel Corporation December 2002  –  December 2004  (2 years 1 month) Northwest Packaging and Distribution Regional Operations Manager Intel Corporation December 2002  –  December 2004  (2 years 1 month) Branded Packaging and Services Mfg. Operations Manager Intel Corporation February 2002  –  December 2002  (11 months) Branded Packaging and Services Mfg. Operations Manager Intel Corporation February 2002  –  December 2002  (11 months) Planning and Business Operations Manager Intel Corporation November 2000  –  February 2002  (1 year 4 months) Planning and Business Operations Manager Intel Corporation November 2000  –  February 2002  (1 year 4 months) Supply Planning Manager Intel Corporation May 1999  –  November 2000  (1 year 7 months) Supply Planning Manager Intel Corporation May 1999  –  November 2000  (1 year 7 months) Supply Demand Manager Intel Corporation August 1998  –  May 1999  (10 months) Supply Demand Manager Intel Corporation August 1998  –  May 1999  (10 months) Customer Program Manager Intel Corporation August 1997  –  August 1998  (1 year 1 month) Customer Program Manager Intel Corporation August 1997  –  August 1998  (1 year 1 month) Materials Program Manager Intel Corporation July 1996  –  August 1997  (1 year 2 months) Materials Program Manager Intel Corporation July 1996  –  August 1997  (1 year 2 months) Skills Semiconductors Cross-functional Team... Program Management Intel Manufacturing Product Management Supply Chain Management Process Improvement Software Project... Vendor Management Supply Chain... Leadership Supply Management Change Management Six Sigma Strategic Partnerships Analytics Supply Chain Industrial Engineering Integration Team Management Data Analysis Logistics Purchasing PMP Business Intelligence Business Process... Requirements Analysis SPC Organizational... See 15+     See less Skills  Semiconductors Cross-functional Team... Program Management Intel Manufacturing Product Management Supply Chain Management Process Improvement Software Project... Vendor Management Supply Chain... Leadership Supply Management Change Management Six Sigma Strategic Partnerships Analytics Supply Chain Industrial Engineering Integration Team Management Data Analysis Logistics Purchasing PMP Business Intelligence Business Process... Requirements Analysis SPC Organizational... See 15+     See less Semiconductors Cross-functional Team... Program Management Intel Manufacturing Product Management Supply Chain Management Process Improvement Software Project... Vendor Management Supply Chain... Leadership Supply Management Change Management Six Sigma Strategic Partnerships Analytics Supply Chain Industrial Engineering Integration Team Management Data Analysis Logistics Purchasing PMP Business Intelligence Business Process... Requirements Analysis SPC Organizational... See 15+     See less Semiconductors Cross-functional Team... Program Management Intel Manufacturing Product Management Supply Chain Management Process Improvement Software Project... Vendor Management Supply Chain... Leadership Supply Management Change Management Six Sigma Strategic Partnerships Analytics Supply Chain Industrial Engineering Integration Team Management Data Analysis Logistics Purchasing PMP Business Intelligence Business Process... Requirements Analysis SPC Organizational... See 15+     See less Education University of Oregon - Charles H. Lundquist College of Business Master of Business Administration (MBA),  Finance , General 1994  – 1996 University of Oregon - Charles H. Lundquist College of Business Master of Business Administration (MBA),  Finance , General 1994  – 1996 University of Oregon - Charles H. Lundquist College of Business Master of Business Administration (MBA),  Finance , General 1994  – 1996 University of Oregon - Charles H. Lundquist College of Business Master of Business Administration (MBA),  Finance , General 1994  – 1996 ", "Summary Accomplished marketing professional with over 18 years of diverse marketing and communications experience in both consumer & business segments. Strategic marketing skills include pre-launch, launch planning, brand management, messaging/positioning, and demand creation. Tactical marketing experiences include sales force promotional campaigns, publication planning, event management, and account management. Possess outstanding team leadership and project management abilities with a proved track record for meeting timelines, budget, and exceeding goals and expectations. Summary Accomplished marketing professional with over 18 years of diverse marketing and communications experience in both consumer & business segments. Strategic marketing skills include pre-launch, launch planning, brand management, messaging/positioning, and demand creation. Tactical marketing experiences include sales force promotional campaigns, publication planning, event management, and account management. Possess outstanding team leadership and project management abilities with a proved track record for meeting timelines, budget, and exceeding goals and expectations. Accomplished marketing professional with over 18 years of diverse marketing and communications experience in both consumer & business segments. Strategic marketing skills include pre-launch, launch planning, brand management, messaging/positioning, and demand creation. Tactical marketing experiences include sales force promotional campaigns, publication planning, event management, and account management. Possess outstanding team leadership and project management abilities with a proved track record for meeting timelines, budget, and exceeding goals and expectations. Accomplished marketing professional with over 18 years of diverse marketing and communications experience in both consumer & business segments. Strategic marketing skills include pre-launch, launch planning, brand management, messaging/positioning, and demand creation. Tactical marketing experiences include sales force promotional campaigns, publication planning, event management, and account management. Possess outstanding team leadership and project management abilities with a proved track record for meeting timelines, budget, and exceeding goals and expectations. Experience Customer Marketing Manager Intel Corporation October 2013  – Present (1 year 11 months) • Managed strategic desktop PC programs with Dell to influence and drive product roadmap alignment, innovation, and GTM strategies. Developed account specific strategies to align with Intel strategies, plans, and priorities. \n• Aligned GTM activities by facilitating participation in Intel marketing events and programs. \npriorities. \n• Provided path to market for first <$500 pAIO for Holiday 2014 with assortment at 500+ Microsoft stores and Best Buy across North America with updated messaging and positioning. \n• Facilitated Exec relationships via cadence of executive interactions and meetings, ensuring proper attendees/topics are addressed, and drove prep, pre-work, and content. \n Senior Marketing Manager Intel Corporation January 2010  –  October 2013  (3 years 10 months) • Responsible for developing business Ultrabook GTM plans including marketing, positioning, securing OEM design wins, and ramping product. \n• Created iPad competitive response guide and companion device positioning along with training for worldwide field sales organization. \n• Provided customer marketing support for HP, Acer, Asus and acted as the conduit for field requests to the factory and provided training to field on product updates. Developed strategic relationships with account teams to drive design wins on business solutions. Regularly developed content for senior executive business update meetings. \n• Worked on annual sales acceleration programs for field to promote PC client refresh and sell up by providing updated proof points, identify pending customer PC purchases and working with field to close deals, and track volumes. \n• Produced business related content and support for various keynotes aimed at both internal and external audiences. Marketing Manager Intel Corporation July 2006  –  December 2009  (3 years 6 months) • Cross segment marketing manager responsible for consumer and business programs. \n• Develop pre-launch and go-to-market plans for new products. \n• Worked with product marketing to develop feature benefit analysis and tracked progress of various initiatives targeted for launch. \n• Responsible for cross division activities to ensure alignment on disclosure timelines, messaging, PR/AR, branding, and launch. \n• Managed cross division and worldwide activities for Core2 Duo processor launch in July 2006. \n• Key stakeholder with corporate brand management to develop new brand and logo along with usage requirements. Co-Marketing Manager Intel Corporation November 2005  –  June 2006  (8 months) • Defined 2006 WiMAX marketing strategy and developed internal and external marketing plan to drive awareness.  \n• Developed WiMAX co-marketing plans with partners including Alcatel, Motorola, and Nortel. \n• Drove strategic customer meetings to review roadmaps and identify areas of joint opportunities for demand generation programs. \n• Created joint legally approved WiMAX carrier presentations with accounts for dissemination to sales teams to scale messages. Marketing Manager Intel Corporation April 2003  –  November 2005  (2 years 8 months) • Implemented and drove strategy to increase notebook and WLAN adoption in large businesses by addressing key barriers and highlighting Centrino feature benefits. \n• Developed Centrino messaging targeted for enterprise segment which was used in corporate marketing campaigns at launch. \n• Produced content and supported divisional VP keynotes at various external events. \n• Led worldwide IT customer meetings working with geos, field management, Intel IT, and divisional stakeholders to ensure the voice of the customer was represented in our programs. Results were shared across product and sales divisions and led to direct actions for strategic corporate planning. \n• Developed customer-ready Centrino presentation targeted for field sales to use at Fortune 500 accounts and was a top 10 downloaded document of the year. \n• Created approved joint messaging with leading ISV’s such as SAP, Oracle, Reuters, Adobe, Groove Networks, and Computer Associates highlighting their mobile optimized applications. Program Manager Intel Corporation January 2002  –  March 2003  (1 year 3 months) • Drove APAC Infrastructure Enabling Program for broader WLAN hotspot deployment with leading Telco’s such as PCCW, China Mobile, China Netcom, Korea Telecom, and Hanaro Telecom to prepare for Centrino launch. \n• Developed worldwide Service Provider/OEM co-marketing programs with corporate sales and secured $6M incremental funding to execute program. \n• Conducted 802.11b wireless industry market analysis through analyst reports and forecasts and conducted SWOT analysis of fellow travelers. Project Manager Intel Corporation January 2001  –  January 2002  (1 year 1 month) • Member of Bluetooth SIG Marketing Team and WECA (Wireless Ethernet) Marketing committee representing Intel. \n• Assisted with development, ratification and execution of annual marketing plans and budgets. \n• Chaired cross-company Bluetooth Marketing team responsible for events, contract negotiations, brand management, and speaker recruitment/placement. \n• Project lead for Bluetooth Developers Conference which drew over 2000 attendees worldwide at Moscone Center and secured keynote for Intel as well as content for keynote. Responsibilities included working with vendor on details of conference, tracks, promotional materials, and various marketing outreach activities. Operations Manager Intel Corporation July 1999  –  December 2000  (1 year 6 months) • Managed product recall operations and responsible for implementing and ensuring processes for customer calls, fulfillment, collateral, service centers, and worldwide training when needed. \n• Lead issue manager for Intel 820 chipset MTH recall program and key participant of high level problem resolution team overseeing key decisions and communications to customers and executive management. \n• Managed ongoing $500M FDIV program (Pentium® processor replacement program) \n• Implemented an 80% cost savings for the FDIV program through contract renegotiation with vendor. Marketing Specialist Intel Corporation April 1997  –  June 1999  (2 years 3 months) Customer Marketing Manager Intel Corporation October 2013  – Present (1 year 11 months) • Managed strategic desktop PC programs with Dell to influence and drive product roadmap alignment, innovation, and GTM strategies. Developed account specific strategies to align with Intel strategies, plans, and priorities. \n• Aligned GTM activities by facilitating participation in Intel marketing events and programs. \npriorities. \n• Provided path to market for first <$500 pAIO for Holiday 2014 with assortment at 500+ Microsoft stores and Best Buy across North America with updated messaging and positioning. \n• Facilitated Exec relationships via cadence of executive interactions and meetings, ensuring proper attendees/topics are addressed, and drove prep, pre-work, and content. \n Customer Marketing Manager Intel Corporation October 2013  – Present (1 year 11 months) • Managed strategic desktop PC programs with Dell to influence and drive product roadmap alignment, innovation, and GTM strategies. Developed account specific strategies to align with Intel strategies, plans, and priorities. \n• Aligned GTM activities by facilitating participation in Intel marketing events and programs. \npriorities. \n• Provided path to market for first <$500 pAIO for Holiday 2014 with assortment at 500+ Microsoft stores and Best Buy across North America with updated messaging and positioning. \n• Facilitated Exec relationships via cadence of executive interactions and meetings, ensuring proper attendees/topics are addressed, and drove prep, pre-work, and content. \n Senior Marketing Manager Intel Corporation January 2010  –  October 2013  (3 years 10 months) • Responsible for developing business Ultrabook GTM plans including marketing, positioning, securing OEM design wins, and ramping product. \n• Created iPad competitive response guide and companion device positioning along with training for worldwide field sales organization. \n• Provided customer marketing support for HP, Acer, Asus and acted as the conduit for field requests to the factory and provided training to field on product updates. Developed strategic relationships with account teams to drive design wins on business solutions. Regularly developed content for senior executive business update meetings. \n• Worked on annual sales acceleration programs for field to promote PC client refresh and sell up by providing updated proof points, identify pending customer PC purchases and working with field to close deals, and track volumes. \n• Produced business related content and support for various keynotes aimed at both internal and external audiences. Senior Marketing Manager Intel Corporation January 2010  –  October 2013  (3 years 10 months) • Responsible for developing business Ultrabook GTM plans including marketing, positioning, securing OEM design wins, and ramping product. \n• Created iPad competitive response guide and companion device positioning along with training for worldwide field sales organization. \n• Provided customer marketing support for HP, Acer, Asus and acted as the conduit for field requests to the factory and provided training to field on product updates. Developed strategic relationships with account teams to drive design wins on business solutions. Regularly developed content for senior executive business update meetings. \n• Worked on annual sales acceleration programs for field to promote PC client refresh and sell up by providing updated proof points, identify pending customer PC purchases and working with field to close deals, and track volumes. \n• Produced business related content and support for various keynotes aimed at both internal and external audiences. Marketing Manager Intel Corporation July 2006  –  December 2009  (3 years 6 months) • Cross segment marketing manager responsible for consumer and business programs. \n• Develop pre-launch and go-to-market plans for new products. \n• Worked with product marketing to develop feature benefit analysis and tracked progress of various initiatives targeted for launch. \n• Responsible for cross division activities to ensure alignment on disclosure timelines, messaging, PR/AR, branding, and launch. \n• Managed cross division and worldwide activities for Core2 Duo processor launch in July 2006. \n• Key stakeholder with corporate brand management to develop new brand and logo along with usage requirements. Marketing Manager Intel Corporation July 2006  –  December 2009  (3 years 6 months) • Cross segment marketing manager responsible for consumer and business programs. \n• Develop pre-launch and go-to-market plans for new products. \n• Worked with product marketing to develop feature benefit analysis and tracked progress of various initiatives targeted for launch. \n• Responsible for cross division activities to ensure alignment on disclosure timelines, messaging, PR/AR, branding, and launch. \n• Managed cross division and worldwide activities for Core2 Duo processor launch in July 2006. \n• Key stakeholder with corporate brand management to develop new brand and logo along with usage requirements. Co-Marketing Manager Intel Corporation November 2005  –  June 2006  (8 months) • Defined 2006 WiMAX marketing strategy and developed internal and external marketing plan to drive awareness.  \n• Developed WiMAX co-marketing plans with partners including Alcatel, Motorola, and Nortel. \n• Drove strategic customer meetings to review roadmaps and identify areas of joint opportunities for demand generation programs. \n• Created joint legally approved WiMAX carrier presentations with accounts for dissemination to sales teams to scale messages. Co-Marketing Manager Intel Corporation November 2005  –  June 2006  (8 months) • Defined 2006 WiMAX marketing strategy and developed internal and external marketing plan to drive awareness.  \n• Developed WiMAX co-marketing plans with partners including Alcatel, Motorola, and Nortel. \n• Drove strategic customer meetings to review roadmaps and identify areas of joint opportunities for demand generation programs. \n• Created joint legally approved WiMAX carrier presentations with accounts for dissemination to sales teams to scale messages. Marketing Manager Intel Corporation April 2003  –  November 2005  (2 years 8 months) • Implemented and drove strategy to increase notebook and WLAN adoption in large businesses by addressing key barriers and highlighting Centrino feature benefits. \n• Developed Centrino messaging targeted for enterprise segment which was used in corporate marketing campaigns at launch. \n• Produced content and supported divisional VP keynotes at various external events. \n• Led worldwide IT customer meetings working with geos, field management, Intel IT, and divisional stakeholders to ensure the voice of the customer was represented in our programs. Results were shared across product and sales divisions and led to direct actions for strategic corporate planning. \n• Developed customer-ready Centrino presentation targeted for field sales to use at Fortune 500 accounts and was a top 10 downloaded document of the year. \n• Created approved joint messaging with leading ISV’s such as SAP, Oracle, Reuters, Adobe, Groove Networks, and Computer Associates highlighting their mobile optimized applications. Marketing Manager Intel Corporation April 2003  –  November 2005  (2 years 8 months) • Implemented and drove strategy to increase notebook and WLAN adoption in large businesses by addressing key barriers and highlighting Centrino feature benefits. \n• Developed Centrino messaging targeted for enterprise segment which was used in corporate marketing campaigns at launch. \n• Produced content and supported divisional VP keynotes at various external events. \n• Led worldwide IT customer meetings working with geos, field management, Intel IT, and divisional stakeholders to ensure the voice of the customer was represented in our programs. Results were shared across product and sales divisions and led to direct actions for strategic corporate planning. \n• Developed customer-ready Centrino presentation targeted for field sales to use at Fortune 500 accounts and was a top 10 downloaded document of the year. \n• Created approved joint messaging with leading ISV’s such as SAP, Oracle, Reuters, Adobe, Groove Networks, and Computer Associates highlighting their mobile optimized applications. Program Manager Intel Corporation January 2002  –  March 2003  (1 year 3 months) • Drove APAC Infrastructure Enabling Program for broader WLAN hotspot deployment with leading Telco’s such as PCCW, China Mobile, China Netcom, Korea Telecom, and Hanaro Telecom to prepare for Centrino launch. \n• Developed worldwide Service Provider/OEM co-marketing programs with corporate sales and secured $6M incremental funding to execute program. \n• Conducted 802.11b wireless industry market analysis through analyst reports and forecasts and conducted SWOT analysis of fellow travelers. Program Manager Intel Corporation January 2002  –  March 2003  (1 year 3 months) • Drove APAC Infrastructure Enabling Program for broader WLAN hotspot deployment with leading Telco’s such as PCCW, China Mobile, China Netcom, Korea Telecom, and Hanaro Telecom to prepare for Centrino launch. \n• Developed worldwide Service Provider/OEM co-marketing programs with corporate sales and secured $6M incremental funding to execute program. \n• Conducted 802.11b wireless industry market analysis through analyst reports and forecasts and conducted SWOT analysis of fellow travelers. Project Manager Intel Corporation January 2001  –  January 2002  (1 year 1 month) • Member of Bluetooth SIG Marketing Team and WECA (Wireless Ethernet) Marketing committee representing Intel. \n• Assisted with development, ratification and execution of annual marketing plans and budgets. \n• Chaired cross-company Bluetooth Marketing team responsible for events, contract negotiations, brand management, and speaker recruitment/placement. \n• Project lead for Bluetooth Developers Conference which drew over 2000 attendees worldwide at Moscone Center and secured keynote for Intel as well as content for keynote. Responsibilities included working with vendor on details of conference, tracks, promotional materials, and various marketing outreach activities. Project Manager Intel Corporation January 2001  –  January 2002  (1 year 1 month) • Member of Bluetooth SIG Marketing Team and WECA (Wireless Ethernet) Marketing committee representing Intel. \n• Assisted with development, ratification and execution of annual marketing plans and budgets. \n• Chaired cross-company Bluetooth Marketing team responsible for events, contract negotiations, brand management, and speaker recruitment/placement. \n• Project lead for Bluetooth Developers Conference which drew over 2000 attendees worldwide at Moscone Center and secured keynote for Intel as well as content for keynote. Responsibilities included working with vendor on details of conference, tracks, promotional materials, and various marketing outreach activities. Operations Manager Intel Corporation July 1999  –  December 2000  (1 year 6 months) • Managed product recall operations and responsible for implementing and ensuring processes for customer calls, fulfillment, collateral, service centers, and worldwide training when needed. \n• Lead issue manager for Intel 820 chipset MTH recall program and key participant of high level problem resolution team overseeing key decisions and communications to customers and executive management. \n• Managed ongoing $500M FDIV program (Pentium® processor replacement program) \n• Implemented an 80% cost savings for the FDIV program through contract renegotiation with vendor. Operations Manager Intel Corporation July 1999  –  December 2000  (1 year 6 months) • Managed product recall operations and responsible for implementing and ensuring processes for customer calls, fulfillment, collateral, service centers, and worldwide training when needed. \n• Lead issue manager for Intel 820 chipset MTH recall program and key participant of high level problem resolution team overseeing key decisions and communications to customers and executive management. \n• Managed ongoing $500M FDIV program (Pentium® processor replacement program) \n• Implemented an 80% cost savings for the FDIV program through contract renegotiation with vendor. Marketing Specialist Intel Corporation April 1997  –  June 1999  (2 years 3 months) Marketing Specialist Intel Corporation April 1997  –  June 1999  (2 years 3 months) Languages English Chinese (Traditional) English Chinese (Traditional) English Chinese (Traditional) Skills Product Marketing Go-to-market Strategy Cross-functional Team... Strategic Partnerships Demand Generation Semiconductors Product Management Messaging Strategic Communications Brand Management Skills  Product Marketing Go-to-market Strategy Cross-functional Team... Strategic Partnerships Demand Generation Semiconductors Product Management Messaging Strategic Communications Brand Management Product Marketing Go-to-market Strategy Cross-functional Team... Strategic Partnerships Demand Generation Semiconductors Product Management Messaging Strategic Communications Brand Management Product Marketing Go-to-market Strategy Cross-functional Team... Strategic Partnerships Demand Generation Semiconductors Product Management Messaging Strategic Communications Brand Management Education California Polytechnic State University-San Luis Obispo Bachelor of Applied Science (B.A.Sc.),  business 1994  – 1997 California Polytechnic State University-San Luis Obispo Bachelor of Applied Science (B.A.Sc.),  business 1994  – 1997 California Polytechnic State University-San Luis Obispo Bachelor of Applied Science (B.A.Sc.),  business 1994  – 1997 California Polytechnic State University-San Luis Obispo Bachelor of Applied Science (B.A.Sc.),  business 1994  – 1997 ", "Summary Industrial Engineer and MBA with more than 16 years of experience driving continuous improvements and managing production teams at Intel Corporation for different factories located in Costa Rica, New Mexico and Vietnam. More than 10 years of experience as People Manager inside the MFG organization and in some occasion in charge of the automation team. Experienced as a Manufacturing Project Manager for 4 different Factory Start Up, hiring production floor personnel and implementing all factory operation software systems and process required to have a new factory and new product were in place. Knowledge on lean operations principles and have experience on leading a lean journey with different business groups. Summary Industrial Engineer and MBA with more than 16 years of experience driving continuous improvements and managing production teams at Intel Corporation for different factories located in Costa Rica, New Mexico and Vietnam. More than 10 years of experience as People Manager inside the MFG organization and in some occasion in charge of the automation team. Experienced as a Manufacturing Project Manager for 4 different Factory Start Up, hiring production floor personnel and implementing all factory operation software systems and process required to have a new factory and new product were in place. Knowledge on lean operations principles and have experience on leading a lean journey with different business groups. Industrial Engineer and MBA with more than 16 years of experience driving continuous improvements and managing production teams at Intel Corporation for different factories located in Costa Rica, New Mexico and Vietnam. More than 10 years of experience as People Manager inside the MFG organization and in some occasion in charge of the automation team. Experienced as a Manufacturing Project Manager for 4 different Factory Start Up, hiring production floor personnel and implementing all factory operation software systems and process required to have a new factory and new product were in place. Knowledge on lean operations principles and have experience on leading a lean journey with different business groups. Industrial Engineer and MBA with more than 16 years of experience driving continuous improvements and managing production teams at Intel Corporation for different factories located in Costa Rica, New Mexico and Vietnam. More than 10 years of experience as People Manager inside the MFG organization and in some occasion in charge of the automation team. Experienced as a Manufacturing Project Manager for 4 different Factory Start Up, hiring production floor personnel and implementing all factory operation software systems and process required to have a new factory and new product were in place. Knowledge on lean operations principles and have experience on leading a lean journey with different business groups. Experience Manufacturing Program Manager Intel Corporation November 2014  – Present (10 months) Hillsboro, Oregon Operations Manufacturing Program Manager to support new product development, launch and manufacturing ramp of our Si and Module wireless products Production Scheduling Manager Intel Corporation April 2012  – Present (3 years 5 months) Costa Rica Manage a group of engineers on that work on defining the production schedules for more than 50 SKU’s and develop automated systems or/and processes that improve the productivity of the factory on: WIP Management, Material Handling, and Semi finish product Inventory Controls. Costa Rica Assembly and Test Operational Shift Manager Intel Corporation July 2011  –  April 2012  (10 months) Costa Rica In charge of a manufacturing shift team performance regarding Safety, Quality and Output. Assess personnel and material levels to determine production schedules. Managed a team of 8 Supervisors that each Supervisor had 20 direct reports including operators and technicians. Vietnam Start-Up Readiness Project Manager and Manufacturing Systems Manager Intel Corporation January 2008  –  June 2011  (3 years 6 months) Vietnam Managed green field start up readiness of operation departments for a microprocessor Assembly and Test Factory. Ensure stakeholders were aligned with the operations requirements and the progress against schedule was met. In charge of the hiring process and execution for first production line of microprocessor in Vietnam and defined the organizational attributes for Operation/Manufacturing Team. Defined the mission and vision of the new factory, as well as the attributes that will define that factory as the most competitive in terms of cost from all Intel Assembly and Test factories. New Mexico Microprocessor Test Manufacturing Shift Manager Intel Corporation February 2006  –  December 2007  (1 year 11 months) Albuquerque, New Mexico Area In charge of a manufacturing on Shift team performance regarding Safety, Quality and Output. Managing 5 supervisors from different ATM sites with the objective to have 3 Test production lines that were opened temporary to full fill capacity needs. Factory was managed with 4 different countries staff members (Malaysia, Philippines, China and Costa Rica) with US local technicians. Costa Rica Microprocessor Assembly Manufacturing Shift Manager Intel Corporation January 2007  –  July 2007  (7 months) Costa Rica In charge of a manufacturing shift team performance regarding Safety, Quality and Output. Assess personnel and material levels to determine production schedules. Managed a team of 4 Supervisors that each Supervisor had 20 direct reports including operators and technicians. New Mexico Microprocessor Test Manufacturing Readiness Project Manager Intel Corporation August 2005  –  January 2006  (6 months) Albuquerque, New Mexico Area Coordinated factory operation departments for a microprocessor temporary Factory start up in Albuquerque, making sure stakeholders were aligned with the Manufacturing requirements and ensuring the progress against schedule of all deliverable were met on time. Costa Rica Microprocessor Manufacturing Shift Manager Intel Corporation May 2004  –  August 2005  (1 year 4 months) Costa Rica In charge of a manufacturing on Shift team performance regarding Safety, Quality and Output. Assess personnel and material levels to determine production schedules. Assess personnel and material levels to determine production schedules. Managed a team of 4 Supervisors that each Supervisor had 20 direct reports including operators and technicians. Costa Rica New Microprocessor Factory Readiness Project Manager Intel Corporation November 2003  –  May 2004  (7 months) Costa Rica At the same time as leading the High Volume Manufacturing Systems team coordinated and drove all operations departments related to the start up making sure all departments were aligned with the start up manufacturing requirements. Costa Rica High Volume Manufacturing Systems Lead Intel Corporation March 2002  –  May 2004  (2 years 3 months) Costa Rica Lead a group of engineers on programs/projects that will improve the productivity of the factory on: WIP Management, Material Handling, Safety and Quality Systems, in order to improve Manufacturing Productivity. Costa Rica Manufacturing Project Manager for a factory expansion Intel Corporation November 2000  –  April 2002  (1 year 6 months) Costa Rica Coordinated and drove all operations departments related to the start up of a new building, making sure all stakeholders were aligned with the Manufacturing start up requirements. Assembly and Operations (Arizona) and Costa Rica Manufacturing Systems New Product Introduction Engi Intel Corporation November 1999  –  November 2000  (1 year 1 month) Phoenix, Arizona Area Developed Manufacturing Systems in order to introduce new technologies coming with new products introduction on the manufacturing floor. People/Safety Manufacturing Systems Engineer Intel Corporation August 1998  –  November 1999  (1 year 4 months) Costa Rica Develop Manufacturing Systems to improve work safety and ensure manufacturing had enough people according to the capacity required. Skills Trainer Intel Corporation August 1997  –  August 1998  (1 year 1 month) Costa Rica Train operators on the new technology equipment and tools. Customer Service Coordinator Exactus Software Ltda June 1996  –  August 1997  (1 year 3 months) Manufacturing Program Manager Intel Corporation November 2014  – Present (10 months) Hillsboro, Oregon Operations Manufacturing Program Manager to support new product development, launch and manufacturing ramp of our Si and Module wireless products Manufacturing Program Manager Intel Corporation November 2014  – Present (10 months) Hillsboro, Oregon Operations Manufacturing Program Manager to support new product development, launch and manufacturing ramp of our Si and Module wireless products Production Scheduling Manager Intel Corporation April 2012  – Present (3 years 5 months) Costa Rica Manage a group of engineers on that work on defining the production schedules for more than 50 SKU’s and develop automated systems or/and processes that improve the productivity of the factory on: WIP Management, Material Handling, and Semi finish product Inventory Controls. Production Scheduling Manager Intel Corporation April 2012  – Present (3 years 5 months) Costa Rica Manage a group of engineers on that work on defining the production schedules for more than 50 SKU’s and develop automated systems or/and processes that improve the productivity of the factory on: WIP Management, Material Handling, and Semi finish product Inventory Controls. Costa Rica Assembly and Test Operational Shift Manager Intel Corporation July 2011  –  April 2012  (10 months) Costa Rica In charge of a manufacturing shift team performance regarding Safety, Quality and Output. Assess personnel and material levels to determine production schedules. Managed a team of 8 Supervisors that each Supervisor had 20 direct reports including operators and technicians. Costa Rica Assembly and Test Operational Shift Manager Intel Corporation July 2011  –  April 2012  (10 months) Costa Rica In charge of a manufacturing shift team performance regarding Safety, Quality and Output. Assess personnel and material levels to determine production schedules. Managed a team of 8 Supervisors that each Supervisor had 20 direct reports including operators and technicians. Vietnam Start-Up Readiness Project Manager and Manufacturing Systems Manager Intel Corporation January 2008  –  June 2011  (3 years 6 months) Vietnam Managed green field start up readiness of operation departments for a microprocessor Assembly and Test Factory. Ensure stakeholders were aligned with the operations requirements and the progress against schedule was met. In charge of the hiring process and execution for first production line of microprocessor in Vietnam and defined the organizational attributes for Operation/Manufacturing Team. Defined the mission and vision of the new factory, as well as the attributes that will define that factory as the most competitive in terms of cost from all Intel Assembly and Test factories. Vietnam Start-Up Readiness Project Manager and Manufacturing Systems Manager Intel Corporation January 2008  –  June 2011  (3 years 6 months) Vietnam Managed green field start up readiness of operation departments for a microprocessor Assembly and Test Factory. Ensure stakeholders were aligned with the operations requirements and the progress against schedule was met. In charge of the hiring process and execution for first production line of microprocessor in Vietnam and defined the organizational attributes for Operation/Manufacturing Team. Defined the mission and vision of the new factory, as well as the attributes that will define that factory as the most competitive in terms of cost from all Intel Assembly and Test factories. New Mexico Microprocessor Test Manufacturing Shift Manager Intel Corporation February 2006  –  December 2007  (1 year 11 months) Albuquerque, New Mexico Area In charge of a manufacturing on Shift team performance regarding Safety, Quality and Output. Managing 5 supervisors from different ATM sites with the objective to have 3 Test production lines that were opened temporary to full fill capacity needs. Factory was managed with 4 different countries staff members (Malaysia, Philippines, China and Costa Rica) with US local technicians. New Mexico Microprocessor Test Manufacturing Shift Manager Intel Corporation February 2006  –  December 2007  (1 year 11 months) Albuquerque, New Mexico Area In charge of a manufacturing on Shift team performance regarding Safety, Quality and Output. Managing 5 supervisors from different ATM sites with the objective to have 3 Test production lines that were opened temporary to full fill capacity needs. Factory was managed with 4 different countries staff members (Malaysia, Philippines, China and Costa Rica) with US local technicians. Costa Rica Microprocessor Assembly Manufacturing Shift Manager Intel Corporation January 2007  –  July 2007  (7 months) Costa Rica In charge of a manufacturing shift team performance regarding Safety, Quality and Output. Assess personnel and material levels to determine production schedules. Managed a team of 4 Supervisors that each Supervisor had 20 direct reports including operators and technicians. Costa Rica Microprocessor Assembly Manufacturing Shift Manager Intel Corporation January 2007  –  July 2007  (7 months) Costa Rica In charge of a manufacturing shift team performance regarding Safety, Quality and Output. Assess personnel and material levels to determine production schedules. Managed a team of 4 Supervisors that each Supervisor had 20 direct reports including operators and technicians. New Mexico Microprocessor Test Manufacturing Readiness Project Manager Intel Corporation August 2005  –  January 2006  (6 months) Albuquerque, New Mexico Area Coordinated factory operation departments for a microprocessor temporary Factory start up in Albuquerque, making sure stakeholders were aligned with the Manufacturing requirements and ensuring the progress against schedule of all deliverable were met on time. New Mexico Microprocessor Test Manufacturing Readiness Project Manager Intel Corporation August 2005  –  January 2006  (6 months) Albuquerque, New Mexico Area Coordinated factory operation departments for a microprocessor temporary Factory start up in Albuquerque, making sure stakeholders were aligned with the Manufacturing requirements and ensuring the progress against schedule of all deliverable were met on time. Costa Rica Microprocessor Manufacturing Shift Manager Intel Corporation May 2004  –  August 2005  (1 year 4 months) Costa Rica In charge of a manufacturing on Shift team performance regarding Safety, Quality and Output. Assess personnel and material levels to determine production schedules. Assess personnel and material levels to determine production schedules. Managed a team of 4 Supervisors that each Supervisor had 20 direct reports including operators and technicians. Costa Rica Microprocessor Manufacturing Shift Manager Intel Corporation May 2004  –  August 2005  (1 year 4 months) Costa Rica In charge of a manufacturing on Shift team performance regarding Safety, Quality and Output. Assess personnel and material levels to determine production schedules. Assess personnel and material levels to determine production schedules. Managed a team of 4 Supervisors that each Supervisor had 20 direct reports including operators and technicians. Costa Rica New Microprocessor Factory Readiness Project Manager Intel Corporation November 2003  –  May 2004  (7 months) Costa Rica At the same time as leading the High Volume Manufacturing Systems team coordinated and drove all operations departments related to the start up making sure all departments were aligned with the start up manufacturing requirements. Costa Rica New Microprocessor Factory Readiness Project Manager Intel Corporation November 2003  –  May 2004  (7 months) Costa Rica At the same time as leading the High Volume Manufacturing Systems team coordinated and drove all operations departments related to the start up making sure all departments were aligned with the start up manufacturing requirements. Costa Rica High Volume Manufacturing Systems Lead Intel Corporation March 2002  –  May 2004  (2 years 3 months) Costa Rica Lead a group of engineers on programs/projects that will improve the productivity of the factory on: WIP Management, Material Handling, Safety and Quality Systems, in order to improve Manufacturing Productivity. Costa Rica High Volume Manufacturing Systems Lead Intel Corporation March 2002  –  May 2004  (2 years 3 months) Costa Rica Lead a group of engineers on programs/projects that will improve the productivity of the factory on: WIP Management, Material Handling, Safety and Quality Systems, in order to improve Manufacturing Productivity. Costa Rica Manufacturing Project Manager for a factory expansion Intel Corporation November 2000  –  April 2002  (1 year 6 months) Costa Rica Coordinated and drove all operations departments related to the start up of a new building, making sure all stakeholders were aligned with the Manufacturing start up requirements. Costa Rica Manufacturing Project Manager for a factory expansion Intel Corporation November 2000  –  April 2002  (1 year 6 months) Costa Rica Coordinated and drove all operations departments related to the start up of a new building, making sure all stakeholders were aligned with the Manufacturing start up requirements. Assembly and Operations (Arizona) and Costa Rica Manufacturing Systems New Product Introduction Engi Intel Corporation November 1999  –  November 2000  (1 year 1 month) Phoenix, Arizona Area Developed Manufacturing Systems in order to introduce new technologies coming with new products introduction on the manufacturing floor. Assembly and Operations (Arizona) and Costa Rica Manufacturing Systems New Product Introduction Engi Intel Corporation November 1999  –  November 2000  (1 year 1 month) Phoenix, Arizona Area Developed Manufacturing Systems in order to introduce new technologies coming with new products introduction on the manufacturing floor. People/Safety Manufacturing Systems Engineer Intel Corporation August 1998  –  November 1999  (1 year 4 months) Costa Rica Develop Manufacturing Systems to improve work safety and ensure manufacturing had enough people according to the capacity required. People/Safety Manufacturing Systems Engineer Intel Corporation August 1998  –  November 1999  (1 year 4 months) Costa Rica Develop Manufacturing Systems to improve work safety and ensure manufacturing had enough people according to the capacity required. Skills Trainer Intel Corporation August 1997  –  August 1998  (1 year 1 month) Costa Rica Train operators on the new technology equipment and tools. Skills Trainer Intel Corporation August 1997  –  August 1998  (1 year 1 month) Costa Rica Train operators on the new technology equipment and tools. Customer Service Coordinator Exactus Software Ltda June 1996  –  August 1997  (1 year 3 months) Customer Service Coordinator Exactus Software Ltda June 1996  –  August 1997  (1 year 3 months) Languages Spanish Spanish Spanish Skills Continuous Improvement Cross-functional Team... Human Resources Inventory Control JMP Lean Manufacturing Management Manufacturing Semiconductor Industry Semiconductors Start-ups Supply Chain Management Process Improvement Product Development Process Engineering Six Sigma Lean manufacturing SPC Testing Project Management See 5+     See less Skills  Continuous Improvement Cross-functional Team... Human Resources Inventory Control JMP Lean Manufacturing Management Manufacturing Semiconductor Industry Semiconductors Start-ups Supply Chain Management Process Improvement Product Development Process Engineering Six Sigma Lean manufacturing SPC Testing Project Management See 5+     See less Continuous Improvement Cross-functional Team... Human Resources Inventory Control JMP Lean Manufacturing Management Manufacturing Semiconductor Industry Semiconductors Start-ups Supply Chain Management Process Improvement Product Development Process Engineering Six Sigma Lean manufacturing SPC Testing Project Management See 5+     See less Continuous Improvement Cross-functional Team... Human Resources Inventory Control JMP Lean Manufacturing Management Manufacturing Semiconductor Industry Semiconductors Start-ups Supply Chain Management Process Improvement Product Development Process Engineering Six Sigma Lean manufacturing SPC Testing Project Management See 5+     See less Education Universidad Alma Mater Master of Business Administration (M.B.A.),  Marketing 2014 Universidad de Costa Rica Licentiate degree,  Industrial Engineering 1991  – 1996 Universidad Alma Mater Master of Business Administration (M.B.A.),  Marketing 2014 Universidad Alma Mater Master of Business Administration (M.B.A.),  Marketing 2014 Universidad Alma Mater Master of Business Administration (M.B.A.),  Marketing 2014 Universidad de Costa Rica Licentiate degree,  Industrial Engineering 1991  – 1996 Universidad de Costa Rica Licentiate degree,  Industrial Engineering 1991  – 1996 Universidad de Costa Rica Licentiate degree,  Industrial Engineering 1991  – 1996 ", "Summary As the Women's Initiative Manager at Intel I am responsible for setting Intel's strategy for retaining and advancing women at Intel. I have a specific focus on Technical Women who continue to be only a small percentage of the overall technical workforce. My goal is to increase the number of female leaders at Intel and in technology in general. I joined Intel in 1987 in Chandler, Arizona and have spent the last 9 years in Global Diversity working to retain and advance women and minorities at Intel. Prior to that I held a variety of positions in Human Resources including Training, Staffing, Payroll, Compensation & Benefits and Business Operations.  \n \nSpecialties: Human Resources \nProject Management \nDiversity \nRetention \nProgression \nWomen  \nEducation Summary As the Women's Initiative Manager at Intel I am responsible for setting Intel's strategy for retaining and advancing women at Intel. I have a specific focus on Technical Women who continue to be only a small percentage of the overall technical workforce. My goal is to increase the number of female leaders at Intel and in technology in general. I joined Intel in 1987 in Chandler, Arizona and have spent the last 9 years in Global Diversity working to retain and advance women and minorities at Intel. Prior to that I held a variety of positions in Human Resources including Training, Staffing, Payroll, Compensation & Benefits and Business Operations.  \n \nSpecialties: Human Resources \nProject Management \nDiversity \nRetention \nProgression \nWomen  \nEducation As the Women's Initiative Manager at Intel I am responsible for setting Intel's strategy for retaining and advancing women at Intel. I have a specific focus on Technical Women who continue to be only a small percentage of the overall technical workforce. My goal is to increase the number of female leaders at Intel and in technology in general. I joined Intel in 1987 in Chandler, Arizona and have spent the last 9 years in Global Diversity working to retain and advance women and minorities at Intel. Prior to that I held a variety of positions in Human Resources including Training, Staffing, Payroll, Compensation & Benefits and Business Operations.  \n \nSpecialties: Human Resources \nProject Management \nDiversity \nRetention \nProgression \nWomen  \nEducation As the Women's Initiative Manager at Intel I am responsible for setting Intel's strategy for retaining and advancing women at Intel. I have a specific focus on Technical Women who continue to be only a small percentage of the overall technical workforce. My goal is to increase the number of female leaders at Intel and in technology in general. I joined Intel in 1987 in Chandler, Arizona and have spent the last 9 years in Global Diversity working to retain and advance women and minorities at Intel. Prior to that I held a variety of positions in Human Resources including Training, Staffing, Payroll, Compensation & Benefits and Business Operations.  \n \nSpecialties: Human Resources \nProject Management \nDiversity \nRetention \nProgression \nWomen  \nEducation Experience Women's Intiative Manager Intel Corporation July 2013  – Present (2 years 2 months) Chandler, AZ I am the Women's Initiative Manager at Intel Corporation responsible for setting Intel's strategy for the retention and advancement of women at Intel. The women's initiative drives sponsorship and development programs, provides a community and networking opportunities and participates in internal and external research efforts all with the goal of breaking down barriers and advancing women in technology. . STAY WITH IT Program Manager Intel Corporation February 2012  –  June 2013  (1 year 5 months) Chandler, Az Program Manager of STAY WITH IT™ is a virtual community that inspires first and second year engineering students and encourages them to stay in their field of study and graduate with an engineering degree. The initiative was born out of the President’s Council on Jobs and Competitiveness and is designed to address the staggering shortage of engineers in the United States. Currently, we reach out to our community through Facebook, YouTube, Twitter and a new web site. STAY WITH IT is supported by organizations like Intel Corporation, but is its own trademarked entity. \n \nResponsible for overall program strategic direction and content development, marketing and talent acquisition. Managed a team of 3 to help deliver a website, social media campaign and original written and video content including a Public Service Announcement. Transition Change Management, Business Ops Manager Intel Corporation September 2011  –  February 2012  (6 months) Chandler, Az Women's Initiative Manager Intel Corporation April 1987  –  March 2010  (23 years) As manager of the Women’s Initiative for Intel, I am responsible for driving strategies that positively impact retention and enthusiasm specifically for Intel’s mid-level female employees and strengthening Intel’s diversity commitment internally and externally. I joined Intel in 1987 in Chandler, Arizona and have held a variety of positions in Human Resources including Training, Staffing, Payroll, Compensation & Benefits and Business Operations. Diversity Programs Intel Corporation 1987  –  2010  (23 years) Program Manager Intel Corporation 1987  –  2010  (23 years) Women's Initiative Manager Intel Corporation January 2007  –  April 2009  (2 years 4 months) Women's Intiative Manager Intel Corporation July 2013  – Present (2 years 2 months) Chandler, AZ I am the Women's Initiative Manager at Intel Corporation responsible for setting Intel's strategy for the retention and advancement of women at Intel. The women's initiative drives sponsorship and development programs, provides a community and networking opportunities and participates in internal and external research efforts all with the goal of breaking down barriers and advancing women in technology. . Women's Intiative Manager Intel Corporation July 2013  – Present (2 years 2 months) Chandler, AZ I am the Women's Initiative Manager at Intel Corporation responsible for setting Intel's strategy for the retention and advancement of women at Intel. The women's initiative drives sponsorship and development programs, provides a community and networking opportunities and participates in internal and external research efforts all with the goal of breaking down barriers and advancing women in technology. . STAY WITH IT Program Manager Intel Corporation February 2012  –  June 2013  (1 year 5 months) Chandler, Az Program Manager of STAY WITH IT™ is a virtual community that inspires first and second year engineering students and encourages them to stay in their field of study and graduate with an engineering degree. The initiative was born out of the President’s Council on Jobs and Competitiveness and is designed to address the staggering shortage of engineers in the United States. Currently, we reach out to our community through Facebook, YouTube, Twitter and a new web site. STAY WITH IT is supported by organizations like Intel Corporation, but is its own trademarked entity. \n \nResponsible for overall program strategic direction and content development, marketing and talent acquisition. Managed a team of 3 to help deliver a website, social media campaign and original written and video content including a Public Service Announcement. STAY WITH IT Program Manager Intel Corporation February 2012  –  June 2013  (1 year 5 months) Chandler, Az Program Manager of STAY WITH IT™ is a virtual community that inspires first and second year engineering students and encourages them to stay in their field of study and graduate with an engineering degree. The initiative was born out of the President’s Council on Jobs and Competitiveness and is designed to address the staggering shortage of engineers in the United States. Currently, we reach out to our community through Facebook, YouTube, Twitter and a new web site. STAY WITH IT is supported by organizations like Intel Corporation, but is its own trademarked entity. \n \nResponsible for overall program strategic direction and content development, marketing and talent acquisition. Managed a team of 3 to help deliver a website, social media campaign and original written and video content including a Public Service Announcement. Transition Change Management, Business Ops Manager Intel Corporation September 2011  –  February 2012  (6 months) Chandler, Az Transition Change Management, Business Ops Manager Intel Corporation September 2011  –  February 2012  (6 months) Chandler, Az Women's Initiative Manager Intel Corporation April 1987  –  March 2010  (23 years) As manager of the Women’s Initiative for Intel, I am responsible for driving strategies that positively impact retention and enthusiasm specifically for Intel’s mid-level female employees and strengthening Intel’s diversity commitment internally and externally. I joined Intel in 1987 in Chandler, Arizona and have held a variety of positions in Human Resources including Training, Staffing, Payroll, Compensation & Benefits and Business Operations. Women's Initiative Manager Intel Corporation April 1987  –  March 2010  (23 years) As manager of the Women’s Initiative for Intel, I am responsible for driving strategies that positively impact retention and enthusiasm specifically for Intel’s mid-level female employees and strengthening Intel’s diversity commitment internally and externally. I joined Intel in 1987 in Chandler, Arizona and have held a variety of positions in Human Resources including Training, Staffing, Payroll, Compensation & Benefits and Business Operations. Diversity Programs Intel Corporation 1987  –  2010  (23 years) Diversity Programs Intel Corporation 1987  –  2010  (23 years) Program Manager Intel Corporation 1987  –  2010  (23 years) Program Manager Intel Corporation 1987  –  2010  (23 years) Women's Initiative Manager Intel Corporation January 2007  –  April 2009  (2 years 4 months) Women's Initiative Manager Intel Corporation January 2007  –  April 2009  (2 years 4 months) Skills Human Resources Customer Retention Project Management Program Management Talent Acquisition Workforce Planning Change Management Employee Benefits Organizational... Training Skills  Human Resources Customer Retention Project Management Program Management Talent Acquisition Workforce Planning Change Management Employee Benefits Organizational... Training Human Resources Customer Retention Project Management Program Management Talent Acquisition Workforce Planning Change Management Employee Benefits Organizational... Training Human Resources Customer Retention Project Management Program Management Talent Acquisition Workforce Planning Change Management Employee Benefits Organizational... Training Education University of Phoenix Human Resources Management University of Phoenix Human Resources Management University of Phoenix Human Resources Management University of Phoenix Human Resources Management ", "Experience EMEA IT Manager Intel Corporation March 2014  – Present (1 year 6 months) Swindon, United Kingdom Manager of cross functional IT organisation across EMEA. Focus on people development, cross functional leadership and collibration Global Web production manager Intel Corporation January 2012  – Present (3 years 8 months) Swindon, United Kingdom Lead a global team to provide content delivery solutions for Intel.com UK IT Manager Intel Corporation July 2011  –  March 2014  (2 years 9 months) Swindon, United Kingdom Manager of cross functional IT organisation in UK and Western Europe. Focus on people development, cross functional leadership and collibration EMEA Commissions Manager Intel Corporation December 2009  –  January 2012  (2 years 2 months) Swindon UK Manager of EMEA Commissions. Leading operations, incentivies and alignment with company goals. EMEA IT Application Support Manager Intel Corporation January 2009  –  December 2009  (1 year) Swindon, United Kingdom Managing team of support analysts to provide incident and problem management for applications within the EMEA region Business Analyst Intel Corporation December 2007  –  January 2009  (1 year 2 months) Swindon, United Kingdom Leading enterprise business solutions for sales and marketing EMEA IT Application support manager Intel Corporation July 2004  –  November 2007  (3 years 5 months) Swindon, United Kingdom Managing team of support analysts to provide incident and problem management for key business applications IT Engineering Project Manager Intel Corporation January 2002  –  July 2004  (2 years 7 months) Swindon, United Kingdom Project manager for IT engeering hosting solutions Project Manager Intel Corporation May 2000  –  January 2002  (1 year 9 months) Swindon, United Kingdom Project manager for Finance business applications Project Manager Unigate August 1996  –  May 2000  (3 years 10 months) EMEA IT Manager Intel Corporation March 2014  – Present (1 year 6 months) Swindon, United Kingdom Manager of cross functional IT organisation across EMEA. Focus on people development, cross functional leadership and collibration EMEA IT Manager Intel Corporation March 2014  – Present (1 year 6 months) Swindon, United Kingdom Manager of cross functional IT organisation across EMEA. Focus on people development, cross functional leadership and collibration Global Web production manager Intel Corporation January 2012  – Present (3 years 8 months) Swindon, United Kingdom Lead a global team to provide content delivery solutions for Intel.com Global Web production manager Intel Corporation January 2012  – Present (3 years 8 months) Swindon, United Kingdom Lead a global team to provide content delivery solutions for Intel.com UK IT Manager Intel Corporation July 2011  –  March 2014  (2 years 9 months) Swindon, United Kingdom Manager of cross functional IT organisation in UK and Western Europe. Focus on people development, cross functional leadership and collibration UK IT Manager Intel Corporation July 2011  –  March 2014  (2 years 9 months) Swindon, United Kingdom Manager of cross functional IT organisation in UK and Western Europe. Focus on people development, cross functional leadership and collibration EMEA Commissions Manager Intel Corporation December 2009  –  January 2012  (2 years 2 months) Swindon UK Manager of EMEA Commissions. Leading operations, incentivies and alignment with company goals. EMEA Commissions Manager Intel Corporation December 2009  –  January 2012  (2 years 2 months) Swindon UK Manager of EMEA Commissions. Leading operations, incentivies and alignment with company goals. EMEA IT Application Support Manager Intel Corporation January 2009  –  December 2009  (1 year) Swindon, United Kingdom Managing team of support analysts to provide incident and problem management for applications within the EMEA region EMEA IT Application Support Manager Intel Corporation January 2009  –  December 2009  (1 year) Swindon, United Kingdom Managing team of support analysts to provide incident and problem management for applications within the EMEA region Business Analyst Intel Corporation December 2007  –  January 2009  (1 year 2 months) Swindon, United Kingdom Leading enterprise business solutions for sales and marketing Business Analyst Intel Corporation December 2007  –  January 2009  (1 year 2 months) Swindon, United Kingdom Leading enterprise business solutions for sales and marketing EMEA IT Application support manager Intel Corporation July 2004  –  November 2007  (3 years 5 months) Swindon, United Kingdom Managing team of support analysts to provide incident and problem management for key business applications EMEA IT Application support manager Intel Corporation July 2004  –  November 2007  (3 years 5 months) Swindon, United Kingdom Managing team of support analysts to provide incident and problem management for key business applications IT Engineering Project Manager Intel Corporation January 2002  –  July 2004  (2 years 7 months) Swindon, United Kingdom Project manager for IT engeering hosting solutions IT Engineering Project Manager Intel Corporation January 2002  –  July 2004  (2 years 7 months) Swindon, United Kingdom Project manager for IT engeering hosting solutions Project Manager Intel Corporation May 2000  –  January 2002  (1 year 9 months) Swindon, United Kingdom Project manager for Finance business applications Project Manager Intel Corporation May 2000  –  January 2002  (1 year 9 months) Swindon, United Kingdom Project manager for Finance business applications Project Manager Unigate August 1996  –  May 2000  (3 years 10 months) Project Manager Unigate August 1996  –  May 2000  (3 years 10 months) Skills Program Management ITIL IT Service Management Virtual Teams Partner Management Disaster Recovery Agile Methodologies Team Management Enterprise Software Software Project... Team Leadership Agile Project Management Cross-functional Team... Vendor Management IT Management Software Development Business Analysis Management Product Management See 4+     See less Skills  Program Management ITIL IT Service Management Virtual Teams Partner Management Disaster Recovery Agile Methodologies Team Management Enterprise Software Software Project... Team Leadership Agile Project Management Cross-functional Team... Vendor Management IT Management Software Development Business Analysis Management Product Management See 4+     See less Program Management ITIL IT Service Management Virtual Teams Partner Management Disaster Recovery Agile Methodologies Team Management Enterprise Software Software Project... Team Leadership Agile Project Management Cross-functional Team... Vendor Management IT Management Software Development Business Analysis Management Product Management See 4+     See less Program Management ITIL IT Service Management Virtual Teams Partner Management Disaster Recovery Agile Methodologies Team Management Enterprise Software Software Project... Team Leadership Agile Project Management Cross-functional Team... Vendor Management IT Management Software Development Business Analysis Management Product Management See 4+     See less Education De Montfort University Bachelor of Science (BSc),  Computer Science , 1st Class 1992  – 1996 De Montfort University Bachelor of Science (BSc),  Computer Science , 1st Class 1992  – 1996 De Montfort University Bachelor of Science (BSc),  Computer Science , 1st Class 1992  – 1996 De Montfort University Bachelor of Science (BSc),  Computer Science , 1st Class 1992  – 1996 ", "Experience Member, Board of Directors Intel Alumni Network January 2014  – Present (1 year 8 months) Greater Chicago Area VP, Channels & Delivery NFC Data, Inc. January 2014  –  October 2014  (10 months) Greater Chicago Area VP Business Development NFC Data, Inc. July 2012  –  December 2013  (1 year 6 months) Greater Chicago Area Retired Intel Corporation May 2012  –  June 2012  (2 months) Solution Provider Manager Intel Corporation April 2009  –  April 2012  (3 years 1 month) Federal SI Business Development Manager Intel Corporation December 2006  –  March 2009  (2 years 4 months) Strategic Relationship Manager Intel Corporation December 1993  –  December 2006  (13 years 1 month) Regional Sales Manager Intel Corporation January 1993  –  December 1993  (1 year) Strategic Program Manager Intel Corporation January 1991  –  December 1992  (2 years) Application Technology Center Manager Intel Corporation June 1989  –  December 1990  (1 year 7 months) Regional Applications Manager Intel Corporation April 1984  –  May 1989  (5 years 2 months) Computer Architecture Specialist Intel Corporation January 1982  –  March 1984  (2 years 3 months) Greater Chicago Area Field Application Engineer Intel Corporation October 1979  –  December 1981  (2 years 3 months) Greater Chicago Area Senior Engineer Alnor Instruments July 1978  –  September 1979  (1 year 3 months) Member of Technical Staff GTE Automatic Electric Labs January 1974  –  June 1978  (4 years 6 months) Greater Chicago Area Member, Board of Directors Intel Alumni Network January 2014  – Present (1 year 8 months) Greater Chicago Area Member, Board of Directors Intel Alumni Network January 2014  – Present (1 year 8 months) Greater Chicago Area VP, Channels & Delivery NFC Data, Inc. January 2014  –  October 2014  (10 months) Greater Chicago Area VP, Channels & Delivery NFC Data, Inc. January 2014  –  October 2014  (10 months) Greater Chicago Area VP Business Development NFC Data, Inc. July 2012  –  December 2013  (1 year 6 months) Greater Chicago Area VP Business Development NFC Data, Inc. July 2012  –  December 2013  (1 year 6 months) Greater Chicago Area Retired Intel Corporation May 2012  –  June 2012  (2 months) Retired Intel Corporation May 2012  –  June 2012  (2 months) Solution Provider Manager Intel Corporation April 2009  –  April 2012  (3 years 1 month) Solution Provider Manager Intel Corporation April 2009  –  April 2012  (3 years 1 month) Federal SI Business Development Manager Intel Corporation December 2006  –  March 2009  (2 years 4 months) Federal SI Business Development Manager Intel Corporation December 2006  –  March 2009  (2 years 4 months) Strategic Relationship Manager Intel Corporation December 1993  –  December 2006  (13 years 1 month) Strategic Relationship Manager Intel Corporation December 1993  –  December 2006  (13 years 1 month) Regional Sales Manager Intel Corporation January 1993  –  December 1993  (1 year) Regional Sales Manager Intel Corporation January 1993  –  December 1993  (1 year) Strategic Program Manager Intel Corporation January 1991  –  December 1992  (2 years) Strategic Program Manager Intel Corporation January 1991  –  December 1992  (2 years) Application Technology Center Manager Intel Corporation June 1989  –  December 1990  (1 year 7 months) Application Technology Center Manager Intel Corporation June 1989  –  December 1990  (1 year 7 months) Regional Applications Manager Intel Corporation April 1984  –  May 1989  (5 years 2 months) Regional Applications Manager Intel Corporation April 1984  –  May 1989  (5 years 2 months) Computer Architecture Specialist Intel Corporation January 1982  –  March 1984  (2 years 3 months) Greater Chicago Area Computer Architecture Specialist Intel Corporation January 1982  –  March 1984  (2 years 3 months) Greater Chicago Area Field Application Engineer Intel Corporation October 1979  –  December 1981  (2 years 3 months) Greater Chicago Area Field Application Engineer Intel Corporation October 1979  –  December 1981  (2 years 3 months) Greater Chicago Area Senior Engineer Alnor Instruments July 1978  –  September 1979  (1 year 3 months) Senior Engineer Alnor Instruments July 1978  –  September 1979  (1 year 3 months) Member of Technical Staff GTE Automatic Electric Labs January 1974  –  June 1978  (4 years 6 months) Greater Chicago Area Member of Technical Staff GTE Automatic Electric Labs January 1974  –  June 1978  (4 years 6 months) Greater Chicago Area Skills Go-to-market Strategy Enterprise Software Business Development Strategic Partnerships Strategy Business Planning Solution Selling Semiconductors Product Marketing Leadership Product Management Start-ups Business Alliances Entrepreneurship Telecommunications Cross-functional Team... Management Cloud Computing Competitive Analysis Intel Mobile Devices Marketing Product Development Sales Channel Partners Demand Generation Channel E-commerce New Business Development See 14+     See less Skills  Go-to-market Strategy Enterprise Software Business Development Strategic Partnerships Strategy Business Planning Solution Selling Semiconductors Product Marketing Leadership Product Management Start-ups Business Alliances Entrepreneurship Telecommunications Cross-functional Team... Management Cloud Computing Competitive Analysis Intel Mobile Devices Marketing Product Development Sales Channel Partners Demand Generation Channel E-commerce New Business Development See 14+     See less Go-to-market Strategy Enterprise Software Business Development Strategic Partnerships Strategy Business Planning Solution Selling Semiconductors Product Marketing Leadership Product Management Start-ups Business Alliances Entrepreneurship Telecommunications Cross-functional Team... Management Cloud Computing Competitive Analysis Intel Mobile Devices Marketing Product Development Sales Channel Partners Demand Generation Channel E-commerce New Business Development See 14+     See less Go-to-market Strategy Enterprise Software Business Development Strategic Partnerships Strategy Business Planning Solution Selling Semiconductors Product Marketing Leadership Product Management Start-ups Business Alliances Entrepreneurship Telecommunications Cross-functional Team... Management Cloud Computing Competitive Analysis Intel Mobile Devices Marketing Product Development Sales Channel Partners Demand Generation Channel E-commerce New Business Development See 14+     See less ", "Summary Energetic Manager with excellent analytical, communication and leadership skills within cross functional and matrixed organizations \nDirected New Product introductions, Infrastructure Support, Technical Program Management, Risk Management and Information Security \nResponsible for forecasting required manpower, fiscal budgets, and risk management of technical projects \nManaged ROI investigations, detailed risk assessments and contract negotiations \nDrive Continuous Improvements though the creation, analysis and regular review of indicators \nMediate agreements across multiple business units with diverse goals and objectives \nDeveloped and implemented a comprehensive 24x7 Cyber Crisis Response process for worldwide manufacturing facilities \nProgram Manager of worldwide client security operation focused on reducing risk of Intel Intellectual Property loss \nRecognized with Intel Employee Achievement Award for outstanding quality and on time delivery of the world’s first teraflop supercomputer \nComputer Knowledge: Word, Excel, Visio, PowerPoint, Outlook and SharePoint \nLean six sigma and ITIL foundation EXIN certifications Summary Energetic Manager with excellent analytical, communication and leadership skills within cross functional and matrixed organizations \nDirected New Product introductions, Infrastructure Support, Technical Program Management, Risk Management and Information Security \nResponsible for forecasting required manpower, fiscal budgets, and risk management of technical projects \nManaged ROI investigations, detailed risk assessments and contract negotiations \nDrive Continuous Improvements though the creation, analysis and regular review of indicators \nMediate agreements across multiple business units with diverse goals and objectives \nDeveloped and implemented a comprehensive 24x7 Cyber Crisis Response process for worldwide manufacturing facilities \nProgram Manager of worldwide client security operation focused on reducing risk of Intel Intellectual Property loss \nRecognized with Intel Employee Achievement Award for outstanding quality and on time delivery of the world’s first teraflop supercomputer \nComputer Knowledge: Word, Excel, Visio, PowerPoint, Outlook and SharePoint \nLean six sigma and ITIL foundation EXIN certifications Energetic Manager with excellent analytical, communication and leadership skills within cross functional and matrixed organizations \nDirected New Product introductions, Infrastructure Support, Technical Program Management, Risk Management and Information Security \nResponsible for forecasting required manpower, fiscal budgets, and risk management of technical projects \nManaged ROI investigations, detailed risk assessments and contract negotiations \nDrive Continuous Improvements though the creation, analysis and regular review of indicators \nMediate agreements across multiple business units with diverse goals and objectives \nDeveloped and implemented a comprehensive 24x7 Cyber Crisis Response process for worldwide manufacturing facilities \nProgram Manager of worldwide client security operation focused on reducing risk of Intel Intellectual Property loss \nRecognized with Intel Employee Achievement Award for outstanding quality and on time delivery of the world’s first teraflop supercomputer \nComputer Knowledge: Word, Excel, Visio, PowerPoint, Outlook and SharePoint \nLean six sigma and ITIL foundation EXIN certifications Energetic Manager with excellent analytical, communication and leadership skills within cross functional and matrixed organizations \nDirected New Product introductions, Infrastructure Support, Technical Program Management, Risk Management and Information Security \nResponsible for forecasting required manpower, fiscal budgets, and risk management of technical projects \nManaged ROI investigations, detailed risk assessments and contract negotiations \nDrive Continuous Improvements though the creation, analysis and regular review of indicators \nMediate agreements across multiple business units with diverse goals and objectives \nDeveloped and implemented a comprehensive 24x7 Cyber Crisis Response process for worldwide manufacturing facilities \nProgram Manager of worldwide client security operation focused on reducing risk of Intel Intellectual Property loss \nRecognized with Intel Employee Achievement Award for outstanding quality and on time delivery of the world’s first teraflop supercomputer \nComputer Knowledge: Word, Excel, Visio, PowerPoint, Outlook and SharePoint \nLean six sigma and ITIL foundation EXIN certifications Experience Business Operations Manager Intel Corporation November 2012  – Present (2 years 10 months) Folsom, Ca •Developed and implemented a governance model extending across all Service offerings within Employee Computing Platforms. Governance covers fiscal, legal, regulatory, and internal prioritization of all projects and programs \n•Manage team of business professionals and engineers delivering reporting, fiscal planning, strategic and tactical roadmaps, security operations, mergers/acquisition support and Program Management oversight Security Operations Manager INTEL CORPORATION, Hudson, MA February 2009  –  November 2012  (3 years 10 months) Hudson Ma •Developed/Implemented Security Operations Plan for Intel Corporation’s Global Client Services (CS) division \n•Successfully Designed Five Point Security Operations Plan by merging industry best practices, ITIL processes, and feedback collected from key stakeholders across CS and additional Information Technology organizations  \n•Global adoption of standard operating procedures to support Intel Corporation corporate security policies as a result of Five Point Security Plan \n•Managed a global team of engineers and technicians through measurement of compliance to security procedures, audits and regular communications delivering reduced risk of Intellectual Property loss Technical Program Manager INTEL CORPORATION, Hudson, MA June 2007  –  January 2009  (1 year 8 months) Hudson Ma •Lead global teams across Manufacturing and Information Technology divisions to drive cross organizational/cross divisional agreement to security related items \n•Defined, Implemented and Directed in production, a repeatable, 24x7 Comprehensive Cyber Crisis Response process \n•Drove continuous improvements to Cyber Crisis Response process through event post mortems  \n•Managed a global team of engineers and technicians representing all IT disciplines and operational semiconductor factories to deliver cyber security risk profile reductions Automation Infrastructure Engineering Manager INTEL CORPORATION, Hudson, MA, FAB 17 August 2004  –  May 2007  (2 years 10 months) Hudson Ma •Defined/Implemented indicators to identify systemic server issues across 3 operating systems \n•Lead Team in reviews of data and subsequent get well programs  \n•Reduced FAB17 factory automation related escalations by 60% \n•Created Multi Domain Rotation for team members resulting in a 23% reduction in “On Call” compensation \n•Managed a team of system engineers delivering infrastructure supporting world class semiconductor manufacturing processes Test Integration and Process Manager INTEL CORPORATION, Beaverton, Oregon April 2002  –  August 2004  (2 years 5 months) Beaverton or •Identified and resolved worldwide factory deficiencies in metrics that measure factory health \n•Defined/Implemented cross-divisional indicators designed to increase factory efficiency and improve product quality \n•Efficiency changes resulted in more than half a million dollars in savings in the first two years of use \n•Managed a global team of engineers delivering test solutions to global PCB manufacturing sites Test Program Manager INTEL CORPORATION, Beaverton, Oregon February 2000  –  March 2002  (2 years 2 months) Beaverton or •Defined and executed evaluation and acceptance criteria for system integration and system installation of the world’s first Teraflops Computer \n•Delivered outstanding quality and on time delivery of multi-year project Test Program Manager INTEL CORPORATION, Albuquerque, New Mexico July 1998  –  February 2000  (1 year 8 months) Albuquerque, New Mexico •Performed on-site integration of the Sandia National Laboratory’s 140 Gflop supercomputer \n•Remotely managed implementation and prioritization of engineering changes Production Test Engineer INTEL CORPORATION, Beaverton, Oregon September 1992  –  June 1998  (5 years 10 months) Beaverton Or Various Roles: \nProduction Test Engineer (1996–1998) \nParallel System Engineer (1995- 1996)  \nSystems Integration Technician (1992 – 1995) Business Operations Manager Intel Corporation November 2012  – Present (2 years 10 months) Folsom, Ca •Developed and implemented a governance model extending across all Service offerings within Employee Computing Platforms. Governance covers fiscal, legal, regulatory, and internal prioritization of all projects and programs \n•Manage team of business professionals and engineers delivering reporting, fiscal planning, strategic and tactical roadmaps, security operations, mergers/acquisition support and Program Management oversight Business Operations Manager Intel Corporation November 2012  – Present (2 years 10 months) Folsom, Ca •Developed and implemented a governance model extending across all Service offerings within Employee Computing Platforms. Governance covers fiscal, legal, regulatory, and internal prioritization of all projects and programs \n•Manage team of business professionals and engineers delivering reporting, fiscal planning, strategic and tactical roadmaps, security operations, mergers/acquisition support and Program Management oversight Security Operations Manager INTEL CORPORATION, Hudson, MA February 2009  –  November 2012  (3 years 10 months) Hudson Ma •Developed/Implemented Security Operations Plan for Intel Corporation’s Global Client Services (CS) division \n•Successfully Designed Five Point Security Operations Plan by merging industry best practices, ITIL processes, and feedback collected from key stakeholders across CS and additional Information Technology organizations  \n•Global adoption of standard operating procedures to support Intel Corporation corporate security policies as a result of Five Point Security Plan \n•Managed a global team of engineers and technicians through measurement of compliance to security procedures, audits and regular communications delivering reduced risk of Intellectual Property loss Security Operations Manager INTEL CORPORATION, Hudson, MA February 2009  –  November 2012  (3 years 10 months) Hudson Ma •Developed/Implemented Security Operations Plan for Intel Corporation’s Global Client Services (CS) division \n•Successfully Designed Five Point Security Operations Plan by merging industry best practices, ITIL processes, and feedback collected from key stakeholders across CS and additional Information Technology organizations  \n•Global adoption of standard operating procedures to support Intel Corporation corporate security policies as a result of Five Point Security Plan \n•Managed a global team of engineers and technicians through measurement of compliance to security procedures, audits and regular communications delivering reduced risk of Intellectual Property loss Technical Program Manager INTEL CORPORATION, Hudson, MA June 2007  –  January 2009  (1 year 8 months) Hudson Ma •Lead global teams across Manufacturing and Information Technology divisions to drive cross organizational/cross divisional agreement to security related items \n•Defined, Implemented and Directed in production, a repeatable, 24x7 Comprehensive Cyber Crisis Response process \n•Drove continuous improvements to Cyber Crisis Response process through event post mortems  \n•Managed a global team of engineers and technicians representing all IT disciplines and operational semiconductor factories to deliver cyber security risk profile reductions Technical Program Manager INTEL CORPORATION, Hudson, MA June 2007  –  January 2009  (1 year 8 months) Hudson Ma •Lead global teams across Manufacturing and Information Technology divisions to drive cross organizational/cross divisional agreement to security related items \n•Defined, Implemented and Directed in production, a repeatable, 24x7 Comprehensive Cyber Crisis Response process \n•Drove continuous improvements to Cyber Crisis Response process through event post mortems  \n•Managed a global team of engineers and technicians representing all IT disciplines and operational semiconductor factories to deliver cyber security risk profile reductions Automation Infrastructure Engineering Manager INTEL CORPORATION, Hudson, MA, FAB 17 August 2004  –  May 2007  (2 years 10 months) Hudson Ma •Defined/Implemented indicators to identify systemic server issues across 3 operating systems \n•Lead Team in reviews of data and subsequent get well programs  \n•Reduced FAB17 factory automation related escalations by 60% \n•Created Multi Domain Rotation for team members resulting in a 23% reduction in “On Call” compensation \n•Managed a team of system engineers delivering infrastructure supporting world class semiconductor manufacturing processes Automation Infrastructure Engineering Manager INTEL CORPORATION, Hudson, MA, FAB 17 August 2004  –  May 2007  (2 years 10 months) Hudson Ma •Defined/Implemented indicators to identify systemic server issues across 3 operating systems \n•Lead Team in reviews of data and subsequent get well programs  \n•Reduced FAB17 factory automation related escalations by 60% \n•Created Multi Domain Rotation for team members resulting in a 23% reduction in “On Call” compensation \n•Managed a team of system engineers delivering infrastructure supporting world class semiconductor manufacturing processes Test Integration and Process Manager INTEL CORPORATION, Beaverton, Oregon April 2002  –  August 2004  (2 years 5 months) Beaverton or •Identified and resolved worldwide factory deficiencies in metrics that measure factory health \n•Defined/Implemented cross-divisional indicators designed to increase factory efficiency and improve product quality \n•Efficiency changes resulted in more than half a million dollars in savings in the first two years of use \n•Managed a global team of engineers delivering test solutions to global PCB manufacturing sites Test Integration and Process Manager INTEL CORPORATION, Beaverton, Oregon April 2002  –  August 2004  (2 years 5 months) Beaverton or •Identified and resolved worldwide factory deficiencies in metrics that measure factory health \n•Defined/Implemented cross-divisional indicators designed to increase factory efficiency and improve product quality \n•Efficiency changes resulted in more than half a million dollars in savings in the first two years of use \n•Managed a global team of engineers delivering test solutions to global PCB manufacturing sites Test Program Manager INTEL CORPORATION, Beaverton, Oregon February 2000  –  March 2002  (2 years 2 months) Beaverton or •Defined and executed evaluation and acceptance criteria for system integration and system installation of the world’s first Teraflops Computer \n•Delivered outstanding quality and on time delivery of multi-year project Test Program Manager INTEL CORPORATION, Beaverton, Oregon February 2000  –  March 2002  (2 years 2 months) Beaverton or •Defined and executed evaluation and acceptance criteria for system integration and system installation of the world’s first Teraflops Computer \n•Delivered outstanding quality and on time delivery of multi-year project Test Program Manager INTEL CORPORATION, Albuquerque, New Mexico July 1998  –  February 2000  (1 year 8 months) Albuquerque, New Mexico •Performed on-site integration of the Sandia National Laboratory’s 140 Gflop supercomputer \n•Remotely managed implementation and prioritization of engineering changes Test Program Manager INTEL CORPORATION, Albuquerque, New Mexico July 1998  –  February 2000  (1 year 8 months) Albuquerque, New Mexico •Performed on-site integration of the Sandia National Laboratory’s 140 Gflop supercomputer \n•Remotely managed implementation and prioritization of engineering changes Production Test Engineer INTEL CORPORATION, Beaverton, Oregon September 1992  –  June 1998  (5 years 10 months) Beaverton Or Various Roles: \nProduction Test Engineer (1996–1998) \nParallel System Engineer (1995- 1996)  \nSystems Integration Technician (1992 – 1995) Production Test Engineer INTEL CORPORATION, Beaverton, Oregon September 1992  –  June 1998  (5 years 10 months) Beaverton Or Various Roles: \nProduction Test Engineer (1996–1998) \nParallel System Engineer (1995- 1996)  \nSystems Integration Technician (1992 – 1995) Skills Cross-functional Team... SharePoint Program Management Six Sigma Management Leadership ITIL Visio Security Risk Management Testing Strategy Integration Analysis Skills  Cross-functional Team... SharePoint Program Management Six Sigma Management Leadership ITIL Visio Security Risk Management Testing Strategy Integration Analysis Cross-functional Team... SharePoint Program Management Six Sigma Management Leadership ITIL Visio Security Risk Management Testing Strategy Integration Analysis Cross-functional Team... SharePoint Program Management Six Sigma Management Leadership ITIL Visio Security Risk Management Testing Strategy Integration Analysis ", "Summary 22 years of increasing scope, management responsibilities, and delivery of global results. Demonstrated managerial, leadership, program management, influence, controls, critical thinking, and written/verbal communication skills.  Summary 22 years of increasing scope, management responsibilities, and delivery of global results. Demonstrated managerial, leadership, program management, influence, controls, critical thinking, and written/verbal communication skills.  22 years of increasing scope, management responsibilities, and delivery of global results. Demonstrated managerial, leadership, program management, influence, controls, critical thinking, and written/verbal communication skills.  22 years of increasing scope, management responsibilities, and delivery of global results. Demonstrated managerial, leadership, program management, influence, controls, critical thinking, and written/verbal communication skills.  Experience Inside Sales Territories Program Manager Intel January 2015  – Present (8 months) Portland, Oregon Area Sales Enablement & Operations Finance Manager Intel Corporation July 2013  –  January 2015  (1 year 7 months) Portland, Oregon Area Responsible for managing a team of 2 financial analysts responsible for providing Close, Forecasting, Capital and strategic support for GM & 300+ staff. Sales & Marketing Group Central Finance Manager Intel Corporation March 2011  –  June 2013  (2 years 4 months) Portland, Oregon Area Responsible for managing a team of 3 financial analysts responsible for flawlessly delivering SMG’s Global Forecast, Close and Capital processes with accountability to the SMG GM, Controller and Senior Finance management.  Global Accounting & Financial Svcs Operations Manager Intel Corporation March 2010  –  February 2011  (1 year) Portland, Oregon Area Global General Accounting Operations Manager Intel Corporation April 2006  –  March 2010  (4 years) Portland, Oregon Area Responsible for managing a team of 6 staff responsible for C&R staff, comms & training, and US General Accounting; leading Business Process Management (BPM) for global GA; and program managing global balance sheet reconciliation automation.  Close & Reporting Controls Manager Intel Corporation March 2004  –  March 2006  (2 years 1 month) Portland, Oregon Area Responsible for managing an extended staff of 9 responsible for C&R Sarbanes-Oxley §302/404, global GAFS business continuity planning, SAP system segregation of duties/ logical access, and C&R process/policy management & infrastructure. Fixed Asset Project Manager Intel Corporation March 2002  –  March 2004  (2 years 1 month) Portland, Oregon Area Fixed Asset Operations Manager Intel Corporation March 2002  –  March 2004  (2 years 1 month) Portland, Oregon Area Responsible for managing an extended staff of 12 responsible for asset capitalization, GAAP compliance in reporting, and M&A integrations and divestures in close partnership with Capital Finance. Project management of various organizational efforts.  \n \n Fixed Asset Project Manager Intel Corporation July 2001  –  March 2002  (9 months) Portland, Oregon Area Fixed Asset Capital Projects Team Manager Intel Corporation March 2000  –  June 2001  (1 year 4 months) Portland, Oregon Area Fixed Asset Manager KinderCare 1997  –  2000  (3 years) Portland, Oregon Area Senior Accountant US Bancorp Financial Inc 1992  –  1997  (5 years) Portland, Oregon Area Inside Sales Territories Program Manager Intel January 2015  – Present (8 months) Portland, Oregon Area Inside Sales Territories Program Manager Intel January 2015  – Present (8 months) Portland, Oregon Area Sales Enablement & Operations Finance Manager Intel Corporation July 2013  –  January 2015  (1 year 7 months) Portland, Oregon Area Responsible for managing a team of 2 financial analysts responsible for providing Close, Forecasting, Capital and strategic support for GM & 300+ staff. Sales Enablement & Operations Finance Manager Intel Corporation July 2013  –  January 2015  (1 year 7 months) Portland, Oregon Area Responsible for managing a team of 2 financial analysts responsible for providing Close, Forecasting, Capital and strategic support for GM & 300+ staff. Sales & Marketing Group Central Finance Manager Intel Corporation March 2011  –  June 2013  (2 years 4 months) Portland, Oregon Area Responsible for managing a team of 3 financial analysts responsible for flawlessly delivering SMG’s Global Forecast, Close and Capital processes with accountability to the SMG GM, Controller and Senior Finance management.  Sales & Marketing Group Central Finance Manager Intel Corporation March 2011  –  June 2013  (2 years 4 months) Portland, Oregon Area Responsible for managing a team of 3 financial analysts responsible for flawlessly delivering SMG’s Global Forecast, Close and Capital processes with accountability to the SMG GM, Controller and Senior Finance management.  Global Accounting & Financial Svcs Operations Manager Intel Corporation March 2010  –  February 2011  (1 year) Portland, Oregon Area Global Accounting & Financial Svcs Operations Manager Intel Corporation March 2010  –  February 2011  (1 year) Portland, Oregon Area Global General Accounting Operations Manager Intel Corporation April 2006  –  March 2010  (4 years) Portland, Oregon Area Responsible for managing a team of 6 staff responsible for C&R staff, comms & training, and US General Accounting; leading Business Process Management (BPM) for global GA; and program managing global balance sheet reconciliation automation.  Global General Accounting Operations Manager Intel Corporation April 2006  –  March 2010  (4 years) Portland, Oregon Area Responsible for managing a team of 6 staff responsible for C&R staff, comms & training, and US General Accounting; leading Business Process Management (BPM) for global GA; and program managing global balance sheet reconciliation automation.  Close & Reporting Controls Manager Intel Corporation March 2004  –  March 2006  (2 years 1 month) Portland, Oregon Area Responsible for managing an extended staff of 9 responsible for C&R Sarbanes-Oxley §302/404, global GAFS business continuity planning, SAP system segregation of duties/ logical access, and C&R process/policy management & infrastructure. Close & Reporting Controls Manager Intel Corporation March 2004  –  March 2006  (2 years 1 month) Portland, Oregon Area Responsible for managing an extended staff of 9 responsible for C&R Sarbanes-Oxley §302/404, global GAFS business continuity planning, SAP system segregation of duties/ logical access, and C&R process/policy management & infrastructure. Fixed Asset Project Manager Intel Corporation March 2002  –  March 2004  (2 years 1 month) Portland, Oregon Area Fixed Asset Project Manager Intel Corporation March 2002  –  March 2004  (2 years 1 month) Portland, Oregon Area Fixed Asset Operations Manager Intel Corporation March 2002  –  March 2004  (2 years 1 month) Portland, Oregon Area Responsible for managing an extended staff of 12 responsible for asset capitalization, GAAP compliance in reporting, and M&A integrations and divestures in close partnership with Capital Finance. Project management of various organizational efforts.  \n \n Fixed Asset Operations Manager Intel Corporation March 2002  –  March 2004  (2 years 1 month) Portland, Oregon Area Responsible for managing an extended staff of 12 responsible for asset capitalization, GAAP compliance in reporting, and M&A integrations and divestures in close partnership with Capital Finance. Project management of various organizational efforts.  \n \n Fixed Asset Project Manager Intel Corporation July 2001  –  March 2002  (9 months) Portland, Oregon Area Fixed Asset Project Manager Intel Corporation July 2001  –  March 2002  (9 months) Portland, Oregon Area Fixed Asset Capital Projects Team Manager Intel Corporation March 2000  –  June 2001  (1 year 4 months) Portland, Oregon Area Fixed Asset Capital Projects Team Manager Intel Corporation March 2000  –  June 2001  (1 year 4 months) Portland, Oregon Area Fixed Asset Manager KinderCare 1997  –  2000  (3 years) Portland, Oregon Area Fixed Asset Manager KinderCare 1997  –  2000  (3 years) Portland, Oregon Area Senior Accountant US Bancorp Financial Inc 1992  –  1997  (5 years) Portland, Oregon Area Senior Accountant US Bancorp Financial Inc 1992  –  1997  (5 years) Portland, Oregon Area Languages English French English French English French Skills People Management Leadership Program Management Business Strategy Partnership-building Communication Business Process Business Process... System Deployment Internal Controls Skills  People Management Leadership Program Management Business Strategy Partnership-building Communication Business Process Business Process... System Deployment Internal Controls People Management Leadership Program Management Business Strategy Partnership-building Communication Business Process Business Process... System Deployment Internal Controls People Management Leadership Program Management Business Strategy Partnership-building Communication Business Process Business Process... System Deployment Internal Controls Education Linfield College Post-Baccalaureate Degree in Accounting,  Accounting 1997 University of Washington Bachelor of Arts,  English Literature 1991 Linfield College Post-Baccalaureate Degree in Accounting,  Accounting 1997 Linfield College Post-Baccalaureate Degree in Accounting,  Accounting 1997 Linfield College Post-Baccalaureate Degree in Accounting,  Accounting 1997 University of Washington Bachelor of Arts,  English Literature 1991 University of Washington Bachelor of Arts,  English Literature 1991 University of Washington Bachelor of Arts,  English Literature 1991 ", "Skills Cross-functional Team... PMP Mergers & Acquisitions Information Security CISSP Security Program Management Product Management Project Management Information Technology Strategy Integration Process Improvement System Deployment Intel Security Management Encryption See 2+     See less Skills  Cross-functional Team... PMP Mergers & Acquisitions Information Security CISSP Security Program Management Product Management Project Management Information Technology Strategy Integration Process Improvement System Deployment Intel Security Management Encryption See 2+     See less Cross-functional Team... PMP Mergers & Acquisitions Information Security CISSP Security Program Management Product Management Project Management Information Technology Strategy Integration Process Improvement System Deployment Intel Security Management Encryption See 2+     See less Cross-functional Team... PMP Mergers & Acquisitions Information Security CISSP Security Program Management Product Management Project Management Information Technology Strategy Integration Process Improvement System Deployment Intel Security Management Encryption See 2+     See less ", "Summary Looking for a role to solve business issues in a dynamic, fast paced environment, for managers/organizations that want to grow their people. Specialties:Hardware manufacturing, consulting, building renovation design/construction facilitation Summary Looking for a role to solve business issues in a dynamic, fast paced environment, for managers/organizations that want to grow their people. Specialties:Hardware manufacturing, consulting, building renovation design/construction facilitation Looking for a role to solve business issues in a dynamic, fast paced environment, for managers/organizations that want to grow their people. Specialties:Hardware manufacturing, consulting, building renovation design/construction facilitation Looking for a role to solve business issues in a dynamic, fast paced environment, for managers/organizations that want to grow their people. Specialties:Hardware manufacturing, consulting, building renovation design/construction facilitation Experience Corporate Services Construction Program Manager Intel Corporation August 2013  – Present (2 years 1 month) HIllsboro, Oregon Program Manage building renovation design, customer relations, and construction. Act as liason between Architecture/General Contractor and Intel. Drove design construction of several interior renovations. Enabled the operational startup of the first general purpose/manufacturing building in the US for several years. Corporate Services Small Project General Construction and Controls Manager Intel Corporation March 2012  –  August 2013  (1 year 6 months) Penang, Malaysia Expatriate assignment to Penang Malaysia. Reestablished a culture of good financial and operational controls over the small projects general construction team. Lead the team of project managers through this cultural shift and working with the new, interim general contractor. Drove the selection of the new general contractor, establishing a new model combining scope of services to include progressive build, resulting in the lowest cost solution. Corporate Services Project Manager Intel Corporation November 2008  –  March 2012  (3 years 5 months) Hillsboro, OR Learned the new language of construction to apply my well established program management skills. Drove renovation of 500ksqft of office buildings, as well as cafes, and fitness centers. Negotiated the selection of a local banker to provide on site services, driving construction and service startup. MWG Board Operations Program Manager Intel Corporation June 2007  –  November 2008  (1 year 6 months) Hillsboro, OR •\tDrove the supply chain adaptions for wifi NPI products; facilitated proto-type builds; transferred products into high volume manufacture at ODM(s) \n•\tSilicon Sales enablement for greenfield/non-Centrino derivative business \n•\tNew ODM engagement for Centrino and non-Centrino business \n•\tProcess-orient the Board Operations Program Manager team \n MWG Product Sustaining Team Manager Intel Corporation February 2006  –  June 2007  (1 year 5 months) Kulim, Malaysia Expatriate Assignment to Malaysia.  \n•\tTransfer product sustaining responsibilities from Oregon to Malaysia, by establishing the team and setting up communication conduits to Israel engineering team;  \n•\tReorient the team’s thinking from “factory” focus into “business units” focus \n•\tDrive resolution to product ad hoc quality, availability, and product change issues \n•\tInitiated several process improvements in regulatory and PDT Operations to achieve OpEx \n•\tEstablish sustaining hardware engineering model, to include three Intel sites and ODM support of three sustaining product families \n MWG Sustaining Product and Regulatory Program Manager Intel Corporation May 2005  –  February 2006  (10 months) Hillsboro, OR •\tDrove all sustaining cost, quality and delivery aspects of the MWG products across a multi-function, multi-site organization. \n•\tLearned the “language” of wifi and related worldwide regulatory engagement. \n LAD Product Marketing Engineer Intel Corporation October 2003  –  May 2005  (1 year 8 months) Hillsboro, OR •\tForecasting and pricing of desktop, wired mobile, and 10GbE adapters. \n•\tPartnered with geography sales to establish the right product mix, pricing, and overall forecast \n•\tSupported all product quality and delivery issues, as the customer representative. \n•\tProduct launch program manager & World-wide marketing programs support \nSupported trade shows and customer visits. \n LAD Manufacturing Operations Manager Intel Corporation November 1997  –  October 2003  (6 years) Hillsboro, OR •\tPNG Product Security Initiative Leader driving features development and implementation, industry summit, indicator development, coordination with Intel security and private investigators. \n•\tManufacturing Integrator to the Xircom acquisition integration \n•\tProgram Managed the Brazil ROI & factory start-up; China subcon factory decision and startup  \n•\tEstablished supply chain for Brazil and China \n•\tManufacturing operations lead in the organizations transformation into PLC usage \n•\tManufacturing program managed the introduction of several LAD adapter products •\tIntroduced the first LAD NPI into iPR and Solectron simultaneously to achieve 300ku+ in the first month of production \n•\tProvided OEM PM Manager coverage for extended sabbatical leave; this team supported all major desktop OEM’s to Intel (e.g. Dell, Fujitsu, Compaq, HP) \n•\tProvided Operations support to customer visits, to represent the supply chain imperatives of cost, quality, and delivery \n•\tFacilitated numerous product/process quality issue resolutions, involving customer returns, rework, and supply chain balancing between factories. \n•\tSupported the product line RMA process, eliminating the use of R-sku’s through ROI analysis \n Senior Consultant Deloitte & Touche May 1995  –  November 1997  (2 years 7 months) San Francisco, CA & Portland OR •\tLed information systems audits in support of annual financial audits  \n•\tPrepared and presented control systems recommendations  \n•\tParticipated in Disaster Recovery assessment/recommendation consulting projects \n Corporate Services Construction Program Manager Intel Corporation August 2013  – Present (2 years 1 month) HIllsboro, Oregon Program Manage building renovation design, customer relations, and construction. Act as liason between Architecture/General Contractor and Intel. Drove design construction of several interior renovations. Enabled the operational startup of the first general purpose/manufacturing building in the US for several years. Corporate Services Construction Program Manager Intel Corporation August 2013  – Present (2 years 1 month) HIllsboro, Oregon Program Manage building renovation design, customer relations, and construction. Act as liason between Architecture/General Contractor and Intel. Drove design construction of several interior renovations. Enabled the operational startup of the first general purpose/manufacturing building in the US for several years. Corporate Services Small Project General Construction and Controls Manager Intel Corporation March 2012  –  August 2013  (1 year 6 months) Penang, Malaysia Expatriate assignment to Penang Malaysia. Reestablished a culture of good financial and operational controls over the small projects general construction team. Lead the team of project managers through this cultural shift and working with the new, interim general contractor. Drove the selection of the new general contractor, establishing a new model combining scope of services to include progressive build, resulting in the lowest cost solution. Corporate Services Small Project General Construction and Controls Manager Intel Corporation March 2012  –  August 2013  (1 year 6 months) Penang, Malaysia Expatriate assignment to Penang Malaysia. Reestablished a culture of good financial and operational controls over the small projects general construction team. Lead the team of project managers through this cultural shift and working with the new, interim general contractor. Drove the selection of the new general contractor, establishing a new model combining scope of services to include progressive build, resulting in the lowest cost solution. Corporate Services Project Manager Intel Corporation November 2008  –  March 2012  (3 years 5 months) Hillsboro, OR Learned the new language of construction to apply my well established program management skills. Drove renovation of 500ksqft of office buildings, as well as cafes, and fitness centers. Negotiated the selection of a local banker to provide on site services, driving construction and service startup. Corporate Services Project Manager Intel Corporation November 2008  –  March 2012  (3 years 5 months) Hillsboro, OR Learned the new language of construction to apply my well established program management skills. Drove renovation of 500ksqft of office buildings, as well as cafes, and fitness centers. Negotiated the selection of a local banker to provide on site services, driving construction and service startup. MWG Board Operations Program Manager Intel Corporation June 2007  –  November 2008  (1 year 6 months) Hillsboro, OR •\tDrove the supply chain adaptions for wifi NPI products; facilitated proto-type builds; transferred products into high volume manufacture at ODM(s) \n•\tSilicon Sales enablement for greenfield/non-Centrino derivative business \n•\tNew ODM engagement for Centrino and non-Centrino business \n•\tProcess-orient the Board Operations Program Manager team \n MWG Board Operations Program Manager Intel Corporation June 2007  –  November 2008  (1 year 6 months) Hillsboro, OR •\tDrove the supply chain adaptions for wifi NPI products; facilitated proto-type builds; transferred products into high volume manufacture at ODM(s) \n•\tSilicon Sales enablement for greenfield/non-Centrino derivative business \n•\tNew ODM engagement for Centrino and non-Centrino business \n•\tProcess-orient the Board Operations Program Manager team \n MWG Product Sustaining Team Manager Intel Corporation February 2006  –  June 2007  (1 year 5 months) Kulim, Malaysia Expatriate Assignment to Malaysia.  \n•\tTransfer product sustaining responsibilities from Oregon to Malaysia, by establishing the team and setting up communication conduits to Israel engineering team;  \n•\tReorient the team’s thinking from “factory” focus into “business units” focus \n•\tDrive resolution to product ad hoc quality, availability, and product change issues \n•\tInitiated several process improvements in regulatory and PDT Operations to achieve OpEx \n•\tEstablish sustaining hardware engineering model, to include three Intel sites and ODM support of three sustaining product families \n MWG Product Sustaining Team Manager Intel Corporation February 2006  –  June 2007  (1 year 5 months) Kulim, Malaysia Expatriate Assignment to Malaysia.  \n•\tTransfer product sustaining responsibilities from Oregon to Malaysia, by establishing the team and setting up communication conduits to Israel engineering team;  \n•\tReorient the team’s thinking from “factory” focus into “business units” focus \n•\tDrive resolution to product ad hoc quality, availability, and product change issues \n•\tInitiated several process improvements in regulatory and PDT Operations to achieve OpEx \n•\tEstablish sustaining hardware engineering model, to include three Intel sites and ODM support of three sustaining product families \n MWG Sustaining Product and Regulatory Program Manager Intel Corporation May 2005  –  February 2006  (10 months) Hillsboro, OR •\tDrove all sustaining cost, quality and delivery aspects of the MWG products across a multi-function, multi-site organization. \n•\tLearned the “language” of wifi and related worldwide regulatory engagement. \n MWG Sustaining Product and Regulatory Program Manager Intel Corporation May 2005  –  February 2006  (10 months) Hillsboro, OR •\tDrove all sustaining cost, quality and delivery aspects of the MWG products across a multi-function, multi-site organization. \n•\tLearned the “language” of wifi and related worldwide regulatory engagement. \n LAD Product Marketing Engineer Intel Corporation October 2003  –  May 2005  (1 year 8 months) Hillsboro, OR •\tForecasting and pricing of desktop, wired mobile, and 10GbE adapters. \n•\tPartnered with geography sales to establish the right product mix, pricing, and overall forecast \n•\tSupported all product quality and delivery issues, as the customer representative. \n•\tProduct launch program manager & World-wide marketing programs support \nSupported trade shows and customer visits. \n LAD Product Marketing Engineer Intel Corporation October 2003  –  May 2005  (1 year 8 months) Hillsboro, OR •\tForecasting and pricing of desktop, wired mobile, and 10GbE adapters. \n•\tPartnered with geography sales to establish the right product mix, pricing, and overall forecast \n•\tSupported all product quality and delivery issues, as the customer representative. \n•\tProduct launch program manager & World-wide marketing programs support \nSupported trade shows and customer visits. \n LAD Manufacturing Operations Manager Intel Corporation November 1997  –  October 2003  (6 years) Hillsboro, OR •\tPNG Product Security Initiative Leader driving features development and implementation, industry summit, indicator development, coordination with Intel security and private investigators. \n•\tManufacturing Integrator to the Xircom acquisition integration \n•\tProgram Managed the Brazil ROI & factory start-up; China subcon factory decision and startup  \n•\tEstablished supply chain for Brazil and China \n•\tManufacturing operations lead in the organizations transformation into PLC usage \n•\tManufacturing program managed the introduction of several LAD adapter products •\tIntroduced the first LAD NPI into iPR and Solectron simultaneously to achieve 300ku+ in the first month of production \n•\tProvided OEM PM Manager coverage for extended sabbatical leave; this team supported all major desktop OEM’s to Intel (e.g. Dell, Fujitsu, Compaq, HP) \n•\tProvided Operations support to customer visits, to represent the supply chain imperatives of cost, quality, and delivery \n•\tFacilitated numerous product/process quality issue resolutions, involving customer returns, rework, and supply chain balancing between factories. \n•\tSupported the product line RMA process, eliminating the use of R-sku’s through ROI analysis \n LAD Manufacturing Operations Manager Intel Corporation November 1997  –  October 2003  (6 years) Hillsboro, OR •\tPNG Product Security Initiative Leader driving features development and implementation, industry summit, indicator development, coordination with Intel security and private investigators. \n•\tManufacturing Integrator to the Xircom acquisition integration \n•\tProgram Managed the Brazil ROI & factory start-up; China subcon factory decision and startup  \n•\tEstablished supply chain for Brazil and China \n•\tManufacturing operations lead in the organizations transformation into PLC usage \n•\tManufacturing program managed the introduction of several LAD adapter products •\tIntroduced the first LAD NPI into iPR and Solectron simultaneously to achieve 300ku+ in the first month of production \n•\tProvided OEM PM Manager coverage for extended sabbatical leave; this team supported all major desktop OEM’s to Intel (e.g. Dell, Fujitsu, Compaq, HP) \n•\tProvided Operations support to customer visits, to represent the supply chain imperatives of cost, quality, and delivery \n•\tFacilitated numerous product/process quality issue resolutions, involving customer returns, rework, and supply chain balancing between factories. \n•\tSupported the product line RMA process, eliminating the use of R-sku’s through ROI analysis \n Senior Consultant Deloitte & Touche May 1995  –  November 1997  (2 years 7 months) San Francisco, CA & Portland OR •\tLed information systems audits in support of annual financial audits  \n•\tPrepared and presented control systems recommendations  \n•\tParticipated in Disaster Recovery assessment/recommendation consulting projects \n Senior Consultant Deloitte & Touche May 1995  –  November 1997  (2 years 7 months) San Francisco, CA & Portland OR •\tLed information systems audits in support of annual financial audits  \n•\tPrepared and presented control systems recommendations  \n•\tParticipated in Disaster Recovery assessment/recommendation consulting projects \n Skills Leadership Management Budgets Strategic Planning Manufacturing Program Management Consulting Product Marketing Business Development Customer Service Product Management Project Management Business Strategy Team Leadership Strategic Partnerships Supply Chain Management Integration Business Process... Strategy Cross-functional Team... Process Improvement Competitive Analysis Vendor Management Enterprise Software Product Development Business Analysis Six Sigma See 12+     See less Skills  Leadership Management Budgets Strategic Planning Manufacturing Program Management Consulting Product Marketing Business Development Customer Service Product Management Project Management Business Strategy Team Leadership Strategic Partnerships Supply Chain Management Integration Business Process... Strategy Cross-functional Team... Process Improvement Competitive Analysis Vendor Management Enterprise Software Product Development Business Analysis Six Sigma See 12+     See less Leadership Management Budgets Strategic Planning Manufacturing Program Management Consulting Product Marketing Business Development Customer Service Product Management Project Management Business Strategy Team Leadership Strategic Partnerships Supply Chain Management Integration Business Process... Strategy Cross-functional Team... Process Improvement Competitive Analysis Vendor Management Enterprise Software Product Development Business Analysis Six Sigma See 12+     See less Leadership Management Budgets Strategic Planning Manufacturing Program Management Consulting Product Marketing Business Development Customer Service Product Management Project Management Business Strategy Team Leadership Strategic Partnerships Supply Chain Management Integration Business Process... Strategy Cross-functional Team... Process Improvement Competitive Analysis Vendor Management Enterprise Software Product Development Business Analysis Six Sigma See 12+     See less Education Willamette University - Atkinson Graduate School of Management MBA 1993  – 1995 Willamette University BA,  Internation Studies 1989  – 1993 Activities and Societies:  Cross Country ,  Track ,  Choir Willamette University - Atkinson Graduate School of Management MBA 1993  – 1995 Willamette University - Atkinson Graduate School of Management MBA 1993  – 1995 Willamette University - Atkinson Graduate School of Management MBA 1993  – 1995 Willamette University BA,  Internation Studies 1989  – 1993 Activities and Societies:  Cross Country ,  Track ,  Choir Willamette University BA,  Internation Studies 1989  – 1993 Activities and Societies:  Cross Country ,  Track ,  Choir Willamette University BA,  Internation Studies 1989  – 1993 Activities and Societies:  Cross Country ,  Track ,  Choir ", "Skills Program Management Software Project... Software Development SDLC Vendor Management Requirements Analysis Agile Methodologies Business Intelligence Integration Business Process Management Cross-functional Team... Enterprise Architecture IT Strategy Solution Architecture Global Delivery Product Management Business Analysis Software Design IT Service Management IT Service Delivery Leading Change Strategic Planning Enterprise Software Databases Leadership Unix Oracle Project Planning Process Improvement Microsoft SQL Server Testing Team Management Architecture Star Schema Business Process... Pricing Quote to Cash Demand Forecasting Team Building Team Leadership See 26+     See less Skills  Program Management Software Project... Software Development SDLC Vendor Management Requirements Analysis Agile Methodologies Business Intelligence Integration Business Process Management Cross-functional Team... Enterprise Architecture IT Strategy Solution Architecture Global Delivery Product Management Business Analysis Software Design IT Service Management IT Service Delivery Leading Change Strategic Planning Enterprise Software Databases Leadership Unix Oracle Project Planning Process Improvement Microsoft SQL Server Testing Team Management Architecture Star Schema Business Process... Pricing Quote to Cash Demand Forecasting Team Building Team Leadership See 26+     See less Program Management Software Project... Software Development SDLC Vendor Management Requirements Analysis Agile Methodologies Business Intelligence Integration Business Process Management Cross-functional Team... Enterprise Architecture IT Strategy Solution Architecture Global Delivery Product Management Business Analysis Software Design IT Service Management IT Service Delivery Leading Change Strategic Planning Enterprise Software Databases Leadership Unix Oracle Project Planning Process Improvement Microsoft SQL Server Testing Team Management Architecture Star Schema Business Process... Pricing Quote to Cash Demand Forecasting Team Building Team Leadership See 26+     See less Program Management Software Project... Software Development SDLC Vendor Management Requirements Analysis Agile Methodologies Business Intelligence Integration Business Process Management Cross-functional Team... Enterprise Architecture IT Strategy Solution Architecture Global Delivery Product Management Business Analysis Software Design IT Service Management IT Service Delivery Leading Change Strategic Planning Enterprise Software Databases Leadership Unix Oracle Project Planning Process Improvement Microsoft SQL Server Testing Team Management Architecture Star Schema Business Process... Pricing Quote to Cash Demand Forecasting Team Building Team Leadership See 26+     See less ", "Summary Since 1995 Billie Goldman has been an innovator for Intel in press relations, sales, product marketing, brand awareness and preference and most recently in partner marketing. In each role, Billie has left an indelible mark as a creative catalyst. Billie’s most recent accomplishment is the creation of Inside Films, Hollywood's first trilogy of ground breaking, award winning social films \"The Power Inside,\" “The Beauty Inside” and “The Inside Experience,” in partnership with Toshiba. All the films have garnered over 70 awards including an Emmy for 'Outstanding New Approach\" in addition to 11 Cannes Lions, 3 of where were Grand Prix. Billie's third film has already collected 2 Webby's and an Emmy nomination with more awards expected. This year Billie was recognized for her efforts in social film by SoMe as their \"Thoroughly Modern Marketer of 2014\" and by Sage/Wall Street Journal as a \"Marketer That Matters.\" Billie is known for her contagious enthusiasm, her ability to build long-term relationships and her talent for turning often high-concept ideas into memorable consumer experiences. •• \n \nSpecialties: Omni-Channel Marketing, Co-Marketing, Partner Marketing, Transmedia Storytelling, Branded Content, Creative, Social Marketing, Online Advertising, Press Relations Summary Since 1995 Billie Goldman has been an innovator for Intel in press relations, sales, product marketing, brand awareness and preference and most recently in partner marketing. In each role, Billie has left an indelible mark as a creative catalyst. Billie’s most recent accomplishment is the creation of Inside Films, Hollywood's first trilogy of ground breaking, award winning social films \"The Power Inside,\" “The Beauty Inside” and “The Inside Experience,” in partnership with Toshiba. All the films have garnered over 70 awards including an Emmy for 'Outstanding New Approach\" in addition to 11 Cannes Lions, 3 of where were Grand Prix. Billie's third film has already collected 2 Webby's and an Emmy nomination with more awards expected. This year Billie was recognized for her efforts in social film by SoMe as their \"Thoroughly Modern Marketer of 2014\" and by Sage/Wall Street Journal as a \"Marketer That Matters.\" Billie is known for her contagious enthusiasm, her ability to build long-term relationships and her talent for turning often high-concept ideas into memorable consumer experiences. •• \n \nSpecialties: Omni-Channel Marketing, Co-Marketing, Partner Marketing, Transmedia Storytelling, Branded Content, Creative, Social Marketing, Online Advertising, Press Relations Since 1995 Billie Goldman has been an innovator for Intel in press relations, sales, product marketing, brand awareness and preference and most recently in partner marketing. In each role, Billie has left an indelible mark as a creative catalyst. Billie’s most recent accomplishment is the creation of Inside Films, Hollywood's first trilogy of ground breaking, award winning social films \"The Power Inside,\" “The Beauty Inside” and “The Inside Experience,” in partnership with Toshiba. All the films have garnered over 70 awards including an Emmy for 'Outstanding New Approach\" in addition to 11 Cannes Lions, 3 of where were Grand Prix. Billie's third film has already collected 2 Webby's and an Emmy nomination with more awards expected. This year Billie was recognized for her efforts in social film by SoMe as their \"Thoroughly Modern Marketer of 2014\" and by Sage/Wall Street Journal as a \"Marketer That Matters.\" Billie is known for her contagious enthusiasm, her ability to build long-term relationships and her talent for turning often high-concept ideas into memorable consumer experiences. •• \n \nSpecialties: Omni-Channel Marketing, Co-Marketing, Partner Marketing, Transmedia Storytelling, Branded Content, Creative, Social Marketing, Online Advertising, Press Relations Since 1995 Billie Goldman has been an innovator for Intel in press relations, sales, product marketing, brand awareness and preference and most recently in partner marketing. In each role, Billie has left an indelible mark as a creative catalyst. Billie’s most recent accomplishment is the creation of Inside Films, Hollywood's first trilogy of ground breaking, award winning social films \"The Power Inside,\" “The Beauty Inside” and “The Inside Experience,” in partnership with Toshiba. All the films have garnered over 70 awards including an Emmy for 'Outstanding New Approach\" in addition to 11 Cannes Lions, 3 of where were Grand Prix. Billie's third film has already collected 2 Webby's and an Emmy nomination with more awards expected. This year Billie was recognized for her efforts in social film by SoMe as their \"Thoroughly Modern Marketer of 2014\" and by Sage/Wall Street Journal as a \"Marketer That Matters.\" Billie is known for her contagious enthusiasm, her ability to build long-term relationships and her talent for turning often high-concept ideas into memorable consumer experiences. •• \n \nSpecialties: Omni-Channel Marketing, Co-Marketing, Partner Marketing, Transmedia Storytelling, Branded Content, Creative, Social Marketing, Online Advertising, Press Relations Experience Partner Marketing Manager Intel Corporation January 2011  – Present (4 years 8 months) Campaign Manager Intel Corporation February 2010  –  January 2011  (1 year) Customer Marketing Manager Intel April 2008  –  March 2010  (2 years) Demand Creation Manger Intel Corporation September 2006  –  April 2008  (1 year 8 months) Demand Creation Manager Intel 2006  –  2007  (1 year) Outbound Marketing Manager Intel January 2006  –  September 2006  (9 months) OEM Marketing Programs Manager Intel Corporation November 2003  –  December 2005  (2 years 2 months) Hillsboro, OR Business Development Manager Intel Corporation June 2002  –  November 2003  (1 year 6 months) Channel Marketing Program Manager Intel Corporation November 2001  –  June 2002  (8 months) Consumer Marketing Program Manager Intel Corporation February 1998  –  September 2001  (3 years 8 months) Press Relations Specialist Intel Corporation January 1997  –  January 1998  (1 year 1 month) Government Affairs Manager The Southland Corporation / 7-Eleven Stores March 1992  –  March 1995  (3 years 1 month) Partner Marketing Manager Intel Corporation January 2011  – Present (4 years 8 months) Partner Marketing Manager Intel Corporation January 2011  – Present (4 years 8 months) Campaign Manager Intel Corporation February 2010  –  January 2011  (1 year) Campaign Manager Intel Corporation February 2010  –  January 2011  (1 year) Customer Marketing Manager Intel April 2008  –  March 2010  (2 years) Customer Marketing Manager Intel April 2008  –  March 2010  (2 years) Demand Creation Manger Intel Corporation September 2006  –  April 2008  (1 year 8 months) Demand Creation Manger Intel Corporation September 2006  –  April 2008  (1 year 8 months) Demand Creation Manager Intel 2006  –  2007  (1 year) Demand Creation Manager Intel 2006  –  2007  (1 year) Outbound Marketing Manager Intel January 2006  –  September 2006  (9 months) Outbound Marketing Manager Intel January 2006  –  September 2006  (9 months) OEM Marketing Programs Manager Intel Corporation November 2003  –  December 2005  (2 years 2 months) Hillsboro, OR OEM Marketing Programs Manager Intel Corporation November 2003  –  December 2005  (2 years 2 months) Hillsboro, OR Business Development Manager Intel Corporation June 2002  –  November 2003  (1 year 6 months) Business Development Manager Intel Corporation June 2002  –  November 2003  (1 year 6 months) Channel Marketing Program Manager Intel Corporation November 2001  –  June 2002  (8 months) Channel Marketing Program Manager Intel Corporation November 2001  –  June 2002  (8 months) Consumer Marketing Program Manager Intel Corporation February 1998  –  September 2001  (3 years 8 months) Consumer Marketing Program Manager Intel Corporation February 1998  –  September 2001  (3 years 8 months) Press Relations Specialist Intel Corporation January 1997  –  January 1998  (1 year 1 month) Press Relations Specialist Intel Corporation January 1997  –  January 1998  (1 year 1 month) Government Affairs Manager The Southland Corporation / 7-Eleven Stores March 1992  –  March 1995  (3 years 1 month) Government Affairs Manager The Southland Corporation / 7-Eleven Stores March 1992  –  March 1995  (3 years 1 month) Skills Negotiation Web Technologies Go-to-market Strategy Product Management Product Marketing E-Learning Demand Generation Online Advertising Multi-channel Marketing Sales Enablement Government Marketing Strategy Email Marketing Integrated Marketing Product Launch Marketing Communications Program Management Strategy Strategic Partnerships Lead Generation Cross-functional Team... Business Development Marketing Advertising Leadership Management Market Planning Digital Marketing Social Media Marketing Sales Online Marketing Digital Strategy See 17+     See less Skills  Negotiation Web Technologies Go-to-market Strategy Product Management Product Marketing E-Learning Demand Generation Online Advertising Multi-channel Marketing Sales Enablement Government Marketing Strategy Email Marketing Integrated Marketing Product Launch Marketing Communications Program Management Strategy Strategic Partnerships Lead Generation Cross-functional Team... Business Development Marketing Advertising Leadership Management Market Planning Digital Marketing Social Media Marketing Sales Online Marketing Digital Strategy See 17+     See less Negotiation Web Technologies Go-to-market Strategy Product Management Product Marketing E-Learning Demand Generation Online Advertising Multi-channel Marketing Sales Enablement Government Marketing Strategy Email Marketing Integrated Marketing Product Launch Marketing Communications Program Management Strategy Strategic Partnerships Lead Generation Cross-functional Team... Business Development Marketing Advertising Leadership Management Market Planning Digital Marketing Social Media Marketing Sales Online Marketing Digital Strategy See 17+     See less Negotiation Web Technologies Go-to-market Strategy Product Management Product Marketing E-Learning Demand Generation Online Advertising Multi-channel Marketing Sales Enablement Government Marketing Strategy Email Marketing Integrated Marketing Product Launch Marketing Communications Program Management Strategy Strategic Partnerships Lead Generation Cross-functional Team... Business Development Marketing Advertising Leadership Management Market Planning Digital Marketing Social Media Marketing Sales Online Marketing Digital Strategy See 17+     See less Education Fielding Graduate University Fielding Graduate University University of California, San Diego Fielding Graduate University Fielding Graduate University Fielding Graduate University Fielding Graduate University Fielding Graduate University Fielding Graduate University University of California, San Diego University of California, San Diego University of California, San Diego Honors & Awards Thoroughly Modern Marketer of the Year SoMe (Social Media Awards) April 2014 The SoMe Awards (Social Media) www.someawards.com honors the best social media campaigns by marketing agencies, in-house teams and freelancers from across the United States and has recognized Billie Goldman as the 'Thoroughly Modern Marketer of the Year' specifically related to her efforts over the last three years creating social films that succeeded in bluring the lines between advertising and entertainment.  Marketers That Matter Marketers That Matter April 2014 www.marketersthatmatter.com The Sage Group has partnered with The Wall Street Journal and industry leaders to inaugurate this award to highlight the marketing strategies and tactics creating measurable results at both fast-growing start-ups and large established enterprises. \n \nMarketing is transforming at an unprecedented rate shifting the way consumers and companies engage. With transformation comes innovation. Exceptional marketers are transforming consumer engagement, utilizing big data, and impacting product definition. They are leveraging new channels, technologies, and platforms to create tangible results and best practices for the companies and customers they serve. \n \nBillie Goldman is being recognized as a finalist for the Marketer That Matters award specifically related to her efforts creating a new form of entertainment that blurs the lines between entertainment and advertising with social film. Intel Achievement Award Intel June 2013 The Intel Achievement Award is Intel's highest level of recognition and goes to teams or individuals that delivered the most critical breakthroughs in the previous year. Billie Goldman is being recognized for her efforts with social film, creating a new form of entertainment that blurs the lines between advertising and entertainment.  iMedia: Top 25 Marketing Innovators of 2014 iMedia November 2014 iMedia recognition of the top 25 cutting-edge creatives, strategists, and technology innovators with big ideas, who get results and collaborate openly to push internet marketing forward. http://www.imediaconnection.com/iMedia25/2014/marketing-leaders-and-innovators/billie-goldman-intel-corp/ Thoroughly Modern Marketer of the Year SoMe (Social Media Awards) April 2014 The SoMe Awards (Social Media) www.someawards.com honors the best social media campaigns by marketing agencies, in-house teams and freelancers from across the United States and has recognized Billie Goldman as the 'Thoroughly Modern Marketer of the Year' specifically related to her efforts over the last three years creating social films that succeeded in bluring the lines between advertising and entertainment.  Thoroughly Modern Marketer of the Year SoMe (Social Media Awards) April 2014 The SoMe Awards (Social Media) www.someawards.com honors the best social media campaigns by marketing agencies, in-house teams and freelancers from across the United States and has recognized Billie Goldman as the 'Thoroughly Modern Marketer of the Year' specifically related to her efforts over the last three years creating social films that succeeded in bluring the lines between advertising and entertainment.  Thoroughly Modern Marketer of the Year SoMe (Social Media Awards) April 2014 The SoMe Awards (Social Media) www.someawards.com honors the best social media campaigns by marketing agencies, in-house teams and freelancers from across the United States and has recognized Billie Goldman as the 'Thoroughly Modern Marketer of the Year' specifically related to her efforts over the last three years creating social films that succeeded in bluring the lines between advertising and entertainment.  Marketers That Matter Marketers That Matter April 2014 www.marketersthatmatter.com The Sage Group has partnered with The Wall Street Journal and industry leaders to inaugurate this award to highlight the marketing strategies and tactics creating measurable results at both fast-growing start-ups and large established enterprises. \n \nMarketing is transforming at an unprecedented rate shifting the way consumers and companies engage. With transformation comes innovation. Exceptional marketers are transforming consumer engagement, utilizing big data, and impacting product definition. They are leveraging new channels, technologies, and platforms to create tangible results and best practices for the companies and customers they serve. \n \nBillie Goldman is being recognized as a finalist for the Marketer That Matters award specifically related to her efforts creating a new form of entertainment that blurs the lines between entertainment and advertising with social film. Marketers That Matter Marketers That Matter April 2014 www.marketersthatmatter.com The Sage Group has partnered with The Wall Street Journal and industry leaders to inaugurate this award to highlight the marketing strategies and tactics creating measurable results at both fast-growing start-ups and large established enterprises. \n \nMarketing is transforming at an unprecedented rate shifting the way consumers and companies engage. With transformation comes innovation. Exceptional marketers are transforming consumer engagement, utilizing big data, and impacting product definition. They are leveraging new channels, technologies, and platforms to create tangible results and best practices for the companies and customers they serve. \n \nBillie Goldman is being recognized as a finalist for the Marketer That Matters award specifically related to her efforts creating a new form of entertainment that blurs the lines between entertainment and advertising with social film. Marketers That Matter Marketers That Matter April 2014 www.marketersthatmatter.com The Sage Group has partnered with The Wall Street Journal and industry leaders to inaugurate this award to highlight the marketing strategies and tactics creating measurable results at both fast-growing start-ups and large established enterprises. \n \nMarketing is transforming at an unprecedented rate shifting the way consumers and companies engage. With transformation comes innovation. Exceptional marketers are transforming consumer engagement, utilizing big data, and impacting product definition. They are leveraging new channels, technologies, and platforms to create tangible results and best practices for the companies and customers they serve. \n \nBillie Goldman is being recognized as a finalist for the Marketer That Matters award specifically related to her efforts creating a new form of entertainment that blurs the lines between entertainment and advertising with social film. Intel Achievement Award Intel June 2013 The Intel Achievement Award is Intel's highest level of recognition and goes to teams or individuals that delivered the most critical breakthroughs in the previous year. Billie Goldman is being recognized for her efforts with social film, creating a new form of entertainment that blurs the lines between advertising and entertainment.  Intel Achievement Award Intel June 2013 The Intel Achievement Award is Intel's highest level of recognition and goes to teams or individuals that delivered the most critical breakthroughs in the previous year. Billie Goldman is being recognized for her efforts with social film, creating a new form of entertainment that blurs the lines between advertising and entertainment.  Intel Achievement Award Intel June 2013 The Intel Achievement Award is Intel's highest level of recognition and goes to teams or individuals that delivered the most critical breakthroughs in the previous year. Billie Goldman is being recognized for her efforts with social film, creating a new form of entertainment that blurs the lines between advertising and entertainment.  iMedia: Top 25 Marketing Innovators of 2014 iMedia November 2014 iMedia recognition of the top 25 cutting-edge creatives, strategists, and technology innovators with big ideas, who get results and collaborate openly to push internet marketing forward. http://www.imediaconnection.com/iMedia25/2014/marketing-leaders-and-innovators/billie-goldman-intel-corp/ iMedia: Top 25 Marketing Innovators of 2014 iMedia November 2014 iMedia recognition of the top 25 cutting-edge creatives, strategists, and technology innovators with big ideas, who get results and collaborate openly to push internet marketing forward. http://www.imediaconnection.com/iMedia25/2014/marketing-leaders-and-innovators/billie-goldman-intel-corp/ iMedia: Top 25 Marketing Innovators of 2014 iMedia November 2014 iMedia recognition of the top 25 cutting-edge creatives, strategists, and technology innovators with big ideas, who get results and collaborate openly to push internet marketing forward. http://www.imediaconnection.com/iMedia25/2014/marketing-leaders-and-innovators/billie-goldman-intel-corp/ ", "Skills Software Project... Project Planning Project Execution Program Management Project Management Software Documentation Manufacturing SDLC PMP Cross-functional Team... Software Development Management Agile Methodologies Business Process CRM Process Improvement Enterprise Software Strategy Scrum Product Management Security Product Development Change Management Outsourcing Enterprise Architecture Project Portfolio... Business Intelligence Integration Training Requirements Analysis IT Strategy Intel Business Analysis Cloud Computing PMO Vendor Management Testing Business Process... See 23+     See less Skills  Software Project... Project Planning Project Execution Program Management Project Management Software Documentation Manufacturing SDLC PMP Cross-functional Team... Software Development Management Agile Methodologies Business Process CRM Process Improvement Enterprise Software Strategy Scrum Product Management Security Product Development Change Management Outsourcing Enterprise Architecture Project Portfolio... Business Intelligence Integration Training Requirements Analysis IT Strategy Intel Business Analysis Cloud Computing PMO Vendor Management Testing Business Process... See 23+     See less Software Project... Project Planning Project Execution Program Management Project Management Software Documentation Manufacturing SDLC PMP Cross-functional Team... Software Development Management Agile Methodologies Business Process CRM Process Improvement Enterprise Software Strategy Scrum Product Management Security Product Development Change Management Outsourcing Enterprise Architecture Project Portfolio... Business Intelligence Integration Training Requirements Analysis IT Strategy Intel Business Analysis Cloud Computing PMO Vendor Management Testing Business Process... See 23+     See less Software Project... Project Planning Project Execution Program Management Project Management Software Documentation Manufacturing SDLC PMP Cross-functional Team... Software Development Management Agile Methodologies Business Process CRM Process Improvement Enterprise Software Strategy Scrum Product Management Security Product Development Change Management Outsourcing Enterprise Architecture Project Portfolio... Business Intelligence Integration Training Requirements Analysis IT Strategy Intel Business Analysis Cloud Computing PMO Vendor Management Testing Business Process... See 23+     See less ", "Summary Nineteen years of experience in a variety of IT positions of increasing complexity and responsibility, spanning functional org management, product management, program management, systems engineering, integration, and operations support \n•Proven track record of running global IT businesses at a profit \n•Solid organizational management experience including finance, budgeting, planning, staffing, people development, and performance management \n•Thorough understanding of product line development and deployment principles, including costing and pricing strategy \n•Extensive experience leading large global teams through complex, transformational technology projects \n•Operational level knowledge of a broad set of IT infrastructure technologies Summary Nineteen years of experience in a variety of IT positions of increasing complexity and responsibility, spanning functional org management, product management, program management, systems engineering, integration, and operations support \n•Proven track record of running global IT businesses at a profit \n•Solid organizational management experience including finance, budgeting, planning, staffing, people development, and performance management \n•Thorough understanding of product line development and deployment principles, including costing and pricing strategy \n•Extensive experience leading large global teams through complex, transformational technology projects \n•Operational level knowledge of a broad set of IT infrastructure technologies Nineteen years of experience in a variety of IT positions of increasing complexity and responsibility, spanning functional org management, product management, program management, systems engineering, integration, and operations support \n•Proven track record of running global IT businesses at a profit \n•Solid organizational management experience including finance, budgeting, planning, staffing, people development, and performance management \n•Thorough understanding of product line development and deployment principles, including costing and pricing strategy \n•Extensive experience leading large global teams through complex, transformational technology projects \n•Operational level knowledge of a broad set of IT infrastructure technologies Nineteen years of experience in a variety of IT positions of increasing complexity and responsibility, spanning functional org management, product management, program management, systems engineering, integration, and operations support \n•Proven track record of running global IT businesses at a profit \n•Solid organizational management experience including finance, budgeting, planning, staffing, people development, and performance management \n•Thorough understanding of product line development and deployment principles, including costing and pricing strategy \n•Extensive experience leading large global teams through complex, transformational technology projects \n•Operational level knowledge of a broad set of IT infrastructure technologies Experience Data Centers & Hosting Staff Technologist Intel Corporation January 2015  – Present (8 months) Lead Security and Controls initiatives related to infrastructure, private and public cloud, and external hosting presence.  IT Operations Automation Manager Intel Corporation March 2014  –  December 2014  (10 months) Led an international team of developers and systems administrators responsible for development and support of hosting automation capabilities. IT Compute Hosting Integration Manager Intel Corporation February 2012  –  March 2014  (2 years 2 months) Led global team through the evolution of IT’s Private Cloud to a Hybrid Public/Private model \nImplemented costing methodology as a lever to drive reductions in IaaS unit costs by >25% from our 2012 baseline, with a 3yr plan to maintain cost leadership with external providers. IT Cloud Services Manager Intel Corporation November 2009  –  March 2012  (2 years 5 months) Led global team through the qualification, deployment, and support of IT’s Enterprise Private Cloud under direct CIO sponsorship \nDrove organizational adoption leading to industry leadership with 75% Virtual Share of Market and broadly adopted Cloud capabilities including On Demand provisioning. IT Hosting Product Manager Intel Corporation 2006  –  2009  (3 years) Chartered with transforming an operations centric support organization to an ITIL based professional hosting services organization \nDeveloped the organization’s Hosting Services Catalog, composed of segmented retail hosting services, component level wholesale services, services based cost models, and tiered SLAs IT Tools and Automation Operations Manager Intel Corporation 2004  –  2006  (2 years) Managed a team of technical project, engineering, and development personnel chartered with delivery and evolution of hosting support tools and technologies. IT Messaging Operations Manager Intel Corporation 2002  –  2004  (2 years) Responsible for global operations of Intel’s messaging infrastructure: Outlook/Exchange, Blackberry, Instant Messenger, and related messaging infrastructure products \nReduced cost of operations through implementation of a follow-the-sun support model staffed from emerging markets IT Flex Services - Hosting Services Manager Intel Corporation 2000  –  2002  (2 years) Directed 44-member operations organization catering to internal Intel customers worldwide. This entrepreneurial group offered a series of products from co-location services to fully managed hosting and application support services. \nDoubled annual revenues from $5m to $10m through a combination of growth and re-pricing. Reversed trends from under recovery to profit. IT Product Engineer Intel Corporation 1998  –  2000  (2 years) Responsible for the development, certification, and deployment of Microsoft Windows Server OS, Active Directory, and related infrastructure products for Corporate IT \nMember of Microsoft / Intel Windows2000 Joint Development Program team, chartered with the cooperative design of the next generation enterprise domain and Active Directory for Intel.  \nLed global team through the deployment Intel’s Corp Forest & Active Directory infrastructure. Technical Program Manager Intel Corporation 1996  –  1998  (2 years) Managed large, diverse enterprise teams through all phases of complex, mission critical IT projects. Responsible for creating project plans; managing Engineering, Deployment, and Support teams to deliverables; regular reporting of plans and status to senior IT management. IT Systems Engineer Intel Corporation 1995  –  1996  (1 year) Provide Second and Third level support for site infrastructure (Banyan, NT, Novell, Cisco) and core IT back office products including mail, remote access, and productivity software \nImplemented Chandler site's first level help desk including bid solicitation and vendor selection, operational process development, training, and indicator tracking. Reduced missed commits from 25% to less than 5% in first month of operation. Data Centers & Hosting Staff Technologist Intel Corporation January 2015  – Present (8 months) Lead Security and Controls initiatives related to infrastructure, private and public cloud, and external hosting presence.  Data Centers & Hosting Staff Technologist Intel Corporation January 2015  – Present (8 months) Lead Security and Controls initiatives related to infrastructure, private and public cloud, and external hosting presence.  IT Operations Automation Manager Intel Corporation March 2014  –  December 2014  (10 months) Led an international team of developers and systems administrators responsible for development and support of hosting automation capabilities. IT Operations Automation Manager Intel Corporation March 2014  –  December 2014  (10 months) Led an international team of developers and systems administrators responsible for development and support of hosting automation capabilities. IT Compute Hosting Integration Manager Intel Corporation February 2012  –  March 2014  (2 years 2 months) Led global team through the evolution of IT’s Private Cloud to a Hybrid Public/Private model \nImplemented costing methodology as a lever to drive reductions in IaaS unit costs by >25% from our 2012 baseline, with a 3yr plan to maintain cost leadership with external providers. IT Compute Hosting Integration Manager Intel Corporation February 2012  –  March 2014  (2 years 2 months) Led global team through the evolution of IT’s Private Cloud to a Hybrid Public/Private model \nImplemented costing methodology as a lever to drive reductions in IaaS unit costs by >25% from our 2012 baseline, with a 3yr plan to maintain cost leadership with external providers. IT Cloud Services Manager Intel Corporation November 2009  –  March 2012  (2 years 5 months) Led global team through the qualification, deployment, and support of IT’s Enterprise Private Cloud under direct CIO sponsorship \nDrove organizational adoption leading to industry leadership with 75% Virtual Share of Market and broadly adopted Cloud capabilities including On Demand provisioning. IT Cloud Services Manager Intel Corporation November 2009  –  March 2012  (2 years 5 months) Led global team through the qualification, deployment, and support of IT’s Enterprise Private Cloud under direct CIO sponsorship \nDrove organizational adoption leading to industry leadership with 75% Virtual Share of Market and broadly adopted Cloud capabilities including On Demand provisioning. IT Hosting Product Manager Intel Corporation 2006  –  2009  (3 years) Chartered with transforming an operations centric support organization to an ITIL based professional hosting services organization \nDeveloped the organization’s Hosting Services Catalog, composed of segmented retail hosting services, component level wholesale services, services based cost models, and tiered SLAs IT Hosting Product Manager Intel Corporation 2006  –  2009  (3 years) Chartered with transforming an operations centric support organization to an ITIL based professional hosting services organization \nDeveloped the organization’s Hosting Services Catalog, composed of segmented retail hosting services, component level wholesale services, services based cost models, and tiered SLAs IT Tools and Automation Operations Manager Intel Corporation 2004  –  2006  (2 years) Managed a team of technical project, engineering, and development personnel chartered with delivery and evolution of hosting support tools and technologies. IT Tools and Automation Operations Manager Intel Corporation 2004  –  2006  (2 years) Managed a team of technical project, engineering, and development personnel chartered with delivery and evolution of hosting support tools and technologies. IT Messaging Operations Manager Intel Corporation 2002  –  2004  (2 years) Responsible for global operations of Intel’s messaging infrastructure: Outlook/Exchange, Blackberry, Instant Messenger, and related messaging infrastructure products \nReduced cost of operations through implementation of a follow-the-sun support model staffed from emerging markets IT Messaging Operations Manager Intel Corporation 2002  –  2004  (2 years) Responsible for global operations of Intel’s messaging infrastructure: Outlook/Exchange, Blackberry, Instant Messenger, and related messaging infrastructure products \nReduced cost of operations through implementation of a follow-the-sun support model staffed from emerging markets IT Flex Services - Hosting Services Manager Intel Corporation 2000  –  2002  (2 years) Directed 44-member operations organization catering to internal Intel customers worldwide. This entrepreneurial group offered a series of products from co-location services to fully managed hosting and application support services. \nDoubled annual revenues from $5m to $10m through a combination of growth and re-pricing. Reversed trends from under recovery to profit. IT Flex Services - Hosting Services Manager Intel Corporation 2000  –  2002  (2 years) Directed 44-member operations organization catering to internal Intel customers worldwide. This entrepreneurial group offered a series of products from co-location services to fully managed hosting and application support services. \nDoubled annual revenues from $5m to $10m through a combination of growth and re-pricing. Reversed trends from under recovery to profit. IT Product Engineer Intel Corporation 1998  –  2000  (2 years) Responsible for the development, certification, and deployment of Microsoft Windows Server OS, Active Directory, and related infrastructure products for Corporate IT \nMember of Microsoft / Intel Windows2000 Joint Development Program team, chartered with the cooperative design of the next generation enterprise domain and Active Directory for Intel.  \nLed global team through the deployment Intel’s Corp Forest & Active Directory infrastructure. IT Product Engineer Intel Corporation 1998  –  2000  (2 years) Responsible for the development, certification, and deployment of Microsoft Windows Server OS, Active Directory, and related infrastructure products for Corporate IT \nMember of Microsoft / Intel Windows2000 Joint Development Program team, chartered with the cooperative design of the next generation enterprise domain and Active Directory for Intel.  \nLed global team through the deployment Intel’s Corp Forest & Active Directory infrastructure. Technical Program Manager Intel Corporation 1996  –  1998  (2 years) Managed large, diverse enterprise teams through all phases of complex, mission critical IT projects. Responsible for creating project plans; managing Engineering, Deployment, and Support teams to deliverables; regular reporting of plans and status to senior IT management. Technical Program Manager Intel Corporation 1996  –  1998  (2 years) Managed large, diverse enterprise teams through all phases of complex, mission critical IT projects. Responsible for creating project plans; managing Engineering, Deployment, and Support teams to deliverables; regular reporting of plans and status to senior IT management. IT Systems Engineer Intel Corporation 1995  –  1996  (1 year) Provide Second and Third level support for site infrastructure (Banyan, NT, Novell, Cisco) and core IT back office products including mail, remote access, and productivity software \nImplemented Chandler site's first level help desk including bid solicitation and vendor selection, operational process development, training, and indicator tracking. Reduced missed commits from 25% to less than 5% in first month of operation. IT Systems Engineer Intel Corporation 1995  –  1996  (1 year) Provide Second and Third level support for site infrastructure (Banyan, NT, Novell, Cisco) and core IT back office products including mail, remote access, and productivity software \nImplemented Chandler site's first level help desk including bid solicitation and vendor selection, operational process development, training, and indicator tracking. Reduced missed commits from 25% to less than 5% in first month of operation. Languages English Native or bilingual proficiency Spanish Limited working proficiency English Native or bilingual proficiency Spanish Limited working proficiency English Native or bilingual proficiency Spanish Limited working proficiency Native or bilingual proficiency Limited working proficiency Skills Troubleshooting Testing Virtualization Cloud Computing Hardware Linux Talent Pipelining Storage Delegation Unix Product Management Team Building Software Development Stakeholder Management Program Management Cross-functional Team... Information Security Cloud Computing IaaS Private Cloud Cost Reduction Financial Modeling Technical Product... Operations Management ITIL Process... IT Project & Program... Agile & Waterfall... Budget Management Financial Forecasting Windows Server Linux System... OpenStack VMware vSphere Organizational... Microsoft Exchange Active Directory Amazon Web Services... Software Defined... See 22+     See less Skills  Troubleshooting Testing Virtualization Cloud Computing Hardware Linux Talent Pipelining Storage Delegation Unix Product Management Team Building Software Development Stakeholder Management Program Management Cross-functional Team... Information Security Cloud Computing IaaS Private Cloud Cost Reduction Financial Modeling Technical Product... Operations Management ITIL Process... IT Project & Program... Agile & Waterfall... Budget Management Financial Forecasting Windows Server Linux System... OpenStack VMware vSphere Organizational... Microsoft Exchange Active Directory Amazon Web Services... Software Defined... See 22+     See less Troubleshooting Testing Virtualization Cloud Computing Hardware Linux Talent Pipelining Storage Delegation Unix Product Management Team Building Software Development Stakeholder Management Program Management Cross-functional Team... Information Security Cloud Computing IaaS Private Cloud Cost Reduction Financial Modeling Technical Product... Operations Management ITIL Process... IT Project & Program... Agile & Waterfall... Budget Management Financial Forecasting Windows Server Linux System... OpenStack VMware vSphere Organizational... Microsoft Exchange Active Directory Amazon Web Services... Software Defined... See 22+     See less Troubleshooting Testing Virtualization Cloud Computing Hardware Linux Talent Pipelining Storage Delegation Unix Product Management Team Building Software Development Stakeholder Management Program Management Cross-functional Team... Information Security Cloud Computing IaaS Private Cloud Cost Reduction Financial Modeling Technical Product... Operations Management ITIL Process... IT Project & Program... Agile & Waterfall... Budget Management Financial Forecasting Windows Server Linux System... OpenStack VMware vSphere Organizational... Microsoft Exchange Active Directory Amazon Web Services... Software Defined... See 22+     See less Education Arizona State University, W. P. Carey School of Business MBA,  High Technology Program 2000  – 2001 Arizona State University Bachelors of Science,  Computer and Information Sciences 1990  – 1994 Arizona State University, W. P. Carey School of Business MBA,  High Technology Program 2000  – 2001 Arizona State University, W. P. Carey School of Business MBA,  High Technology Program 2000  – 2001 Arizona State University, W. P. Carey School of Business MBA,  High Technology Program 2000  – 2001 Arizona State University Bachelors of Science,  Computer and Information Sciences 1990  – 1994 Arizona State University Bachelors of Science,  Computer and Information Sciences 1990  – 1994 Arizona State University Bachelors of Science,  Computer and Information Sciences 1990  – 1994 Honors & Awards Intel Achievement Award Intel Corporation January 2012 Intel's highest corporate award - granted for the deployment of Intel IT's Enterprise Private Cloud Intel IT Excellence Award Intel Information Technology Division January 2012 Intel Achievement Award Intel Corporation January 2012 Intel's highest corporate award - granted for the deployment of Intel IT's Enterprise Private Cloud Intel Achievement Award Intel Corporation January 2012 Intel's highest corporate award - granted for the deployment of Intel IT's Enterprise Private Cloud Intel Achievement Award Intel Corporation January 2012 Intel's highest corporate award - granted for the deployment of Intel IT's Enterprise Private Cloud Intel IT Excellence Award Intel Information Technology Division January 2012 Intel IT Excellence Award Intel Information Technology Division January 2012 Intel IT Excellence Award Intel Information Technology Division January 2012 ", "Summary A creative, enthusiastic, and goal orientated Senior Information Technology Manager with international experience in business and technical environments. I am well organised, with 20 years of management experience. Major strengths include green field conceptualization, adaptability, and communication. I provide leadership to set strategic direction and create the team environment to enable success. I have successfully delivered results within organisational environments working to tight budgets and timescales. I have created new business environments and implemented strategic projects with $20 million budgets which have utilised cutting edge technologies setting Intel and industry firsts. Summary A creative, enthusiastic, and goal orientated Senior Information Technology Manager with international experience in business and technical environments. I am well organised, with 20 years of management experience. Major strengths include green field conceptualization, adaptability, and communication. I provide leadership to set strategic direction and create the team environment to enable success. I have successfully delivered results within organisational environments working to tight budgets and timescales. I have created new business environments and implemented strategic projects with $20 million budgets which have utilised cutting edge technologies setting Intel and industry firsts. A creative, enthusiastic, and goal orientated Senior Information Technology Manager with international experience in business and technical environments. I am well organised, with 20 years of management experience. Major strengths include green field conceptualization, adaptability, and communication. I provide leadership to set strategic direction and create the team environment to enable success. I have successfully delivered results within organisational environments working to tight budgets and timescales. I have created new business environments and implemented strategic projects with $20 million budgets which have utilised cutting edge technologies setting Intel and industry firsts. A creative, enthusiastic, and goal orientated Senior Information Technology Manager with international experience in business and technical environments. I am well organised, with 20 years of management experience. Major strengths include green field conceptualization, adaptability, and communication. I provide leadership to set strategic direction and create the team environment to enable success. I have successfully delivered results within organisational environments working to tight budgets and timescales. I have created new business environments and implemented strategic projects with $20 million budgets which have utilised cutting edge technologies setting Intel and industry firsts. Experience Enterprise Information Security Director Intel Corporation July 2013  – Present (2 years 2 months) Americas IT Client Services Manager Intel Corporation 2010  –  July 2013  (3 years) Sacramento, California Area Global Employee Learning Center Manager Intel April 2007  –  March 2010  (3 years) Folsom California Global IT Engineering Integrated Planning & Release Manager. Intel Corporation January 2006  –  April 2007  (1 year 4 months) Swindon, United Kingdom Global Remote Connectivity Product Line Manager Intel Corporation February 2004  –  September 2006  (2 years 8 months) Swindon, United Kingdom Greater Europe Productivity and Decision Support Manager Intel Corporation 2003  –  2004  (1 year) Swindon, United Kingdom Greater Europe Information Technology Client Engineering Manager Intel Corporation 2001  –  2003  (2 years) Swindon, United Kingdom Greater Europe Finance Information Systems Application Development Manager Intel Corporation 2000  –  2001  (1 year) Swindon, United Kingdom European Field Sales Productivity Manager Intel Corporation 1998  –  2000  (2 years) Swindon, United Kingdom Information Technology Sales and Marketing European Program Manager Intel Corporation 1996  –  1998  (2 years) Swindon, United Kingdom Architecture Manager National Westminster Bank 1994  –  1996  (2 years) Bristol, United Kingdom Client Server Program Manager National Westminster Insurance Services 1989  –  1995  (6 years) Enterprise Information Security Director Intel Corporation July 2013  – Present (2 years 2 months) Enterprise Information Security Director Intel Corporation July 2013  – Present (2 years 2 months) Americas IT Client Services Manager Intel Corporation 2010  –  July 2013  (3 years) Sacramento, California Area Americas IT Client Services Manager Intel Corporation 2010  –  July 2013  (3 years) Sacramento, California Area Global Employee Learning Center Manager Intel April 2007  –  March 2010  (3 years) Folsom California Global Employee Learning Center Manager Intel April 2007  –  March 2010  (3 years) Folsom California Global IT Engineering Integrated Planning & Release Manager. Intel Corporation January 2006  –  April 2007  (1 year 4 months) Swindon, United Kingdom Global IT Engineering Integrated Planning & Release Manager. Intel Corporation January 2006  –  April 2007  (1 year 4 months) Swindon, United Kingdom Global Remote Connectivity Product Line Manager Intel Corporation February 2004  –  September 2006  (2 years 8 months) Swindon, United Kingdom Global Remote Connectivity Product Line Manager Intel Corporation February 2004  –  September 2006  (2 years 8 months) Swindon, United Kingdom Greater Europe Productivity and Decision Support Manager Intel Corporation 2003  –  2004  (1 year) Swindon, United Kingdom Greater Europe Productivity and Decision Support Manager Intel Corporation 2003  –  2004  (1 year) Swindon, United Kingdom Greater Europe Information Technology Client Engineering Manager Intel Corporation 2001  –  2003  (2 years) Swindon, United Kingdom Greater Europe Information Technology Client Engineering Manager Intel Corporation 2001  –  2003  (2 years) Swindon, United Kingdom Greater Europe Finance Information Systems Application Development Manager Intel Corporation 2000  –  2001  (1 year) Swindon, United Kingdom Greater Europe Finance Information Systems Application Development Manager Intel Corporation 2000  –  2001  (1 year) Swindon, United Kingdom European Field Sales Productivity Manager Intel Corporation 1998  –  2000  (2 years) Swindon, United Kingdom European Field Sales Productivity Manager Intel Corporation 1998  –  2000  (2 years) Swindon, United Kingdom Information Technology Sales and Marketing European Program Manager Intel Corporation 1996  –  1998  (2 years) Swindon, United Kingdom Information Technology Sales and Marketing European Program Manager Intel Corporation 1996  –  1998  (2 years) Swindon, United Kingdom Architecture Manager National Westminster Bank 1994  –  1996  (2 years) Bristol, United Kingdom Architecture Manager National Westminster Bank 1994  –  1996  (2 years) Bristol, United Kingdom Client Server Program Manager National Westminster Insurance Services 1989  –  1995  (6 years) Client Server Program Manager National Westminster Insurance Services 1989  –  1995  (6 years) Skills Management Strategic Planning New Business Development Intel Software Development Cloud Computing Program Management Cross-functional Team... Leadership Product Management Budgets Vendor Management Process Improvement Skills  Management Strategic Planning New Business Development Intel Software Development Cloud Computing Program Management Cross-functional Team... Leadership Product Management Budgets Vendor Management Process Improvement Management Strategic Planning New Business Development Intel Software Development Cloud Computing Program Management Cross-functional Team... Leadership Product Management Budgets Vendor Management Process Improvement Management Strategic Planning New Business Development Intel Software Development Cloud Computing Program Management Cross-functional Team... Leadership Product Management Budgets Vendor Management Process Improvement Education University of Gloucestershire Computer Science 1986  – 1989 Whitecross School Lydney England University of Gloucestershire Computer Science 1986  – 1989 University of Gloucestershire Computer Science 1986  – 1989 University of Gloucestershire Computer Science 1986  – 1989 Whitecross School Lydney England Whitecross School Lydney England Whitecross School Lydney England ", "Experience Diversity Manager Intel Corporation April 2015  – Present (5 months) Hillsboro, OR Cloud IP Development Manager Intel Corporation October 2014  –  April 2015  (7 months) Hillsboro, OR Engineering Operations Manager Intel Corporation October 2013  –  October 2014  (1 year 1 month) Hillsboro, OR NPI Planning Manager Intel Corporation October 2012  –  October 2013  (1 year 1 month) Hillsboro, OR Manufacturing Manager Care Innovations™, an Intel-GE Company January 2011  –  October 2012  (1 year 10 months) Beaverton, OR Solutions Program Manager & Manufacturing Engineer Intel Corporation November 2000  –  January 2011  (10 years 3 months) DHeG Program Manager Intel Corporation 2008  –  2011  (3 years) Desktop Boards Organization Manufacturing Engineer Intel Corporation July 2006  –  January 2007  (7 months) Process Engineer Intel Corporation July 2003  –  July 2006  (3 years 1 month) Hillsboro, OR F11 Product Engineer- New Product Introduction Project Manager Intel Corporation September 2001  –  January 2002  (5 months) Rio Rancho, NM Corporate Quality Network - Failure Analysis Forum Project Manager Intel Corporation April 2001  –  September 2001  (6 months) Rio Rancho, NM Lithography Functional Area Manufacturing Engineer Intel Corporation November 2000  –  March 2001  (5 months) Rio Rancho, NM Mfg Intern National Instruments 1997  –  1997  (less than a year) Diversity Manager Intel Corporation April 2015  – Present (5 months) Hillsboro, OR Diversity Manager Intel Corporation April 2015  – Present (5 months) Hillsboro, OR Cloud IP Development Manager Intel Corporation October 2014  –  April 2015  (7 months) Hillsboro, OR Cloud IP Development Manager Intel Corporation October 2014  –  April 2015  (7 months) Hillsboro, OR Engineering Operations Manager Intel Corporation October 2013  –  October 2014  (1 year 1 month) Hillsboro, OR Engineering Operations Manager Intel Corporation October 2013  –  October 2014  (1 year 1 month) Hillsboro, OR NPI Planning Manager Intel Corporation October 2012  –  October 2013  (1 year 1 month) Hillsboro, OR NPI Planning Manager Intel Corporation October 2012  –  October 2013  (1 year 1 month) Hillsboro, OR Manufacturing Manager Care Innovations™, an Intel-GE Company January 2011  –  October 2012  (1 year 10 months) Beaverton, OR Manufacturing Manager Care Innovations™, an Intel-GE Company January 2011  –  October 2012  (1 year 10 months) Beaverton, OR Solutions Program Manager & Manufacturing Engineer Intel Corporation November 2000  –  January 2011  (10 years 3 months) Solutions Program Manager & Manufacturing Engineer Intel Corporation November 2000  –  January 2011  (10 years 3 months) DHeG Program Manager Intel Corporation 2008  –  2011  (3 years) DHeG Program Manager Intel Corporation 2008  –  2011  (3 years) Desktop Boards Organization Manufacturing Engineer Intel Corporation July 2006  –  January 2007  (7 months) Desktop Boards Organization Manufacturing Engineer Intel Corporation July 2006  –  January 2007  (7 months) Process Engineer Intel Corporation July 2003  –  July 2006  (3 years 1 month) Hillsboro, OR Process Engineer Intel Corporation July 2003  –  July 2006  (3 years 1 month) Hillsboro, OR F11 Product Engineer- New Product Introduction Project Manager Intel Corporation September 2001  –  January 2002  (5 months) Rio Rancho, NM F11 Product Engineer- New Product Introduction Project Manager Intel Corporation September 2001  –  January 2002  (5 months) Rio Rancho, NM Corporate Quality Network - Failure Analysis Forum Project Manager Intel Corporation April 2001  –  September 2001  (6 months) Rio Rancho, NM Corporate Quality Network - Failure Analysis Forum Project Manager Intel Corporation April 2001  –  September 2001  (6 months) Rio Rancho, NM Lithography Functional Area Manufacturing Engineer Intel Corporation November 2000  –  March 2001  (5 months) Rio Rancho, NM Lithography Functional Area Manufacturing Engineer Intel Corporation November 2000  –  March 2001  (5 months) Rio Rancho, NM Mfg Intern National Instruments 1997  –  1997  (less than a year) Mfg Intern National Instruments 1997  –  1997  (less than a year) Skills Design of Experiments Semiconductors SPC JMP Cross-functional Team... Engineering Management Metrology Product Development Failure Analysis Six Sigma Program Management Product Engineering Design for Manufacturing Manufacturing Yield Product Management Manufacturing... Semiconductor Industry Lean Manufacturing Thin Films Embedded Systems Manufacturing Operations See 7+     See less Skills  Design of Experiments Semiconductors SPC JMP Cross-functional Team... Engineering Management Metrology Product Development Failure Analysis Six Sigma Program Management Product Engineering Design for Manufacturing Manufacturing Yield Product Management Manufacturing... Semiconductor Industry Lean Manufacturing Thin Films Embedded Systems Manufacturing Operations See 7+     See less Design of Experiments Semiconductors SPC JMP Cross-functional Team... Engineering Management Metrology Product Development Failure Analysis Six Sigma Program Management Product Engineering Design for Manufacturing Manufacturing Yield Product Management Manufacturing... Semiconductor Industry Lean Manufacturing Thin Films Embedded Systems Manufacturing Operations See 7+     See less Design of Experiments Semiconductors SPC JMP Cross-functional Team... Engineering Management Metrology Product Development Failure Analysis Six Sigma Program Management Product Engineering Design for Manufacturing Manufacturing Yield Product Management Manufacturing... Semiconductor Industry Lean Manufacturing Thin Films Embedded Systems Manufacturing Operations See 7+     See less Honors & Awards ", "Languages French French French Skills Product Marketing Program Management Competitive Analysis Product Strategy Intel Cross-functional Team... Enterprise Software Go-to-market Strategy Global Business... Technical Marketing Integration Strategic Partnerships Vendor Management Product Management PMO Databases Project Management Leadership Management Training Security Project Planning PMP Process Improvement See 9+     See less Skills  Product Marketing Program Management Competitive Analysis Product Strategy Intel Cross-functional Team... Enterprise Software Go-to-market Strategy Global Business... Technical Marketing Integration Strategic Partnerships Vendor Management Product Management PMO Databases Project Management Leadership Management Training Security Project Planning PMP Process Improvement See 9+     See less Product Marketing Program Management Competitive Analysis Product Strategy Intel Cross-functional Team... Enterprise Software Go-to-market Strategy Global Business... Technical Marketing Integration Strategic Partnerships Vendor Management Product Management PMO Databases Project Management Leadership Management Training Security Project Planning PMP Process Improvement See 9+     See less Product Marketing Program Management Competitive Analysis Product Strategy Intel Cross-functional Team... Enterprise Software Go-to-market Strategy Global Business... Technical Marketing Integration Strategic Partnerships Vendor Management Product Management PMO Databases Project Management Leadership Management Training Security Project Planning PMP Process Improvement See 9+     See less ", "Experience Asia Regional IT Client Services Operation Manager Intel Corporation January 2013  – Present (2 years 8 months) Penang, Malaysia Regional Manager in Asia, managing the operation of the IT Client Services support with a team of managers and Client Engineers across countries in Asia Asia Hub IT Service Desk Operation Manager Intel Corporation October 2005  –  January 2013  (7 years 4 months) Penang, Malaysia Regional Manager in Asia, managing the operation of the IT Service Desk for global support with a team of managers, L1 & L2 Specialists in Penang Global HR Staffing Service Center Manager Intel Corporation January 2004  –  October 2005  (1 year 10 months) Penang, Malaysia Managed a team of Staffing Consultants & Associates and build the organization capability to enable the successful start-up of a new global HR transaction center in Penang. Intel Malaysia Site Staffing Manager Intel Corporation January 2003  –  January 2004  (1 year 1 month) Penang, Malaysia Managed a team of Staffing Consultants of an internal strategic recruitment team to plan and implement strategic pipeline programs that meet the company long-term goals of talent sourcing, attracting and image building in the market place. IT Global Enterprise Applications Call Center Manager Intel Corporation December 1999  –  January 2003  (3 years 2 months) Penang, Malaysia Managed the call center operation for global IT enterprise application support in Penang Manufacturing Technical Support Manager Intel Corporation January 1997  –  December 1999  (3 years) Penang, Malaysia A member of the pioneer team to startup the Pentium II cartridge plant in Philippines and Malaysia. Managed a team of production supervisors with production operators in manufacturing the Pentium II cartridges in Kulim as a Shift Manager. In addition, also managed the Manufacturing Technical Support team in Kulim that comprised of Technical Supervisors and Line Technicians. The technical team is responsible for the daily sustenance of the equipment to ensure quality and reliable output. Manufacturing Area Manager Intel Corporation August 1996  –  January 1997  (6 months) Penang, Malaysia Managed a team of production supervisors and production operators in the Test Backend manufacturing operation. Responsible for production line loading and output for the Test Backend operation. Equipment Engineering Supervisor Intel Corporation June 1995  –  July 1996  (1 year 2 months) Penang Managed a team of maintenance crew in sustaining the Test Backend equipments. Responsible for equipment performance sustenance, maintenance contracts, equipment run rate improvements, etc Process & Equipment Engineer Intel Corporation January 1993  –  May 1995  (2 years 5 months) Penang, Malaysia Responsible for the yield /quality improvement, PLCC package test & backend process, equipment performance & improvement. Asia Regional IT Client Services Operation Manager Intel Corporation January 2013  – Present (2 years 8 months) Penang, Malaysia Regional Manager in Asia, managing the operation of the IT Client Services support with a team of managers and Client Engineers across countries in Asia Asia Regional IT Client Services Operation Manager Intel Corporation January 2013  – Present (2 years 8 months) Penang, Malaysia Regional Manager in Asia, managing the operation of the IT Client Services support with a team of managers and Client Engineers across countries in Asia Asia Hub IT Service Desk Operation Manager Intel Corporation October 2005  –  January 2013  (7 years 4 months) Penang, Malaysia Regional Manager in Asia, managing the operation of the IT Service Desk for global support with a team of managers, L1 & L2 Specialists in Penang Asia Hub IT Service Desk Operation Manager Intel Corporation October 2005  –  January 2013  (7 years 4 months) Penang, Malaysia Regional Manager in Asia, managing the operation of the IT Service Desk for global support with a team of managers, L1 & L2 Specialists in Penang Global HR Staffing Service Center Manager Intel Corporation January 2004  –  October 2005  (1 year 10 months) Penang, Malaysia Managed a team of Staffing Consultants & Associates and build the organization capability to enable the successful start-up of a new global HR transaction center in Penang. Global HR Staffing Service Center Manager Intel Corporation January 2004  –  October 2005  (1 year 10 months) Penang, Malaysia Managed a team of Staffing Consultants & Associates and build the organization capability to enable the successful start-up of a new global HR transaction center in Penang. Intel Malaysia Site Staffing Manager Intel Corporation January 2003  –  January 2004  (1 year 1 month) Penang, Malaysia Managed a team of Staffing Consultants of an internal strategic recruitment team to plan and implement strategic pipeline programs that meet the company long-term goals of talent sourcing, attracting and image building in the market place. Intel Malaysia Site Staffing Manager Intel Corporation January 2003  –  January 2004  (1 year 1 month) Penang, Malaysia Managed a team of Staffing Consultants of an internal strategic recruitment team to plan and implement strategic pipeline programs that meet the company long-term goals of talent sourcing, attracting and image building in the market place. IT Global Enterprise Applications Call Center Manager Intel Corporation December 1999  –  January 2003  (3 years 2 months) Penang, Malaysia Managed the call center operation for global IT enterprise application support in Penang IT Global Enterprise Applications Call Center Manager Intel Corporation December 1999  –  January 2003  (3 years 2 months) Penang, Malaysia Managed the call center operation for global IT enterprise application support in Penang Manufacturing Technical Support Manager Intel Corporation January 1997  –  December 1999  (3 years) Penang, Malaysia A member of the pioneer team to startup the Pentium II cartridge plant in Philippines and Malaysia. Managed a team of production supervisors with production operators in manufacturing the Pentium II cartridges in Kulim as a Shift Manager. In addition, also managed the Manufacturing Technical Support team in Kulim that comprised of Technical Supervisors and Line Technicians. The technical team is responsible for the daily sustenance of the equipment to ensure quality and reliable output. Manufacturing Technical Support Manager Intel Corporation January 1997  –  December 1999  (3 years) Penang, Malaysia A member of the pioneer team to startup the Pentium II cartridge plant in Philippines and Malaysia. Managed a team of production supervisors with production operators in manufacturing the Pentium II cartridges in Kulim as a Shift Manager. In addition, also managed the Manufacturing Technical Support team in Kulim that comprised of Technical Supervisors and Line Technicians. The technical team is responsible for the daily sustenance of the equipment to ensure quality and reliable output. Manufacturing Area Manager Intel Corporation August 1996  –  January 1997  (6 months) Penang, Malaysia Managed a team of production supervisors and production operators in the Test Backend manufacturing operation. Responsible for production line loading and output for the Test Backend operation. Manufacturing Area Manager Intel Corporation August 1996  –  January 1997  (6 months) Penang, Malaysia Managed a team of production supervisors and production operators in the Test Backend manufacturing operation. Responsible for production line loading and output for the Test Backend operation. Equipment Engineering Supervisor Intel Corporation June 1995  –  July 1996  (1 year 2 months) Penang Managed a team of maintenance crew in sustaining the Test Backend equipments. Responsible for equipment performance sustenance, maintenance contracts, equipment run rate improvements, etc Equipment Engineering Supervisor Intel Corporation June 1995  –  July 1996  (1 year 2 months) Penang Managed a team of maintenance crew in sustaining the Test Backend equipments. Responsible for equipment performance sustenance, maintenance contracts, equipment run rate improvements, etc Process & Equipment Engineer Intel Corporation January 1993  –  May 1995  (2 years 5 months) Penang, Malaysia Responsible for the yield /quality improvement, PLCC package test & backend process, equipment performance & improvement. Process & Equipment Engineer Intel Corporation January 1993  –  May 1995  (2 years 5 months) Penang, Malaysia Responsible for the yield /quality improvement, PLCC package test & backend process, equipment performance & improvement. Skills Software Project... Change Management IT Service Management Process Improvement IT Management Integration Management Cross-functional Team... Program Management Strategic Planning Vendor Management IT Operations ITIL IT Strategy Strategy Manufacturing PMP See 2+     See less Skills  Software Project... Change Management IT Service Management Process Improvement IT Management Integration Management Cross-functional Team... Program Management Strategic Planning Vendor Management IT Operations ITIL IT Strategy Strategy Manufacturing PMP See 2+     See less Software Project... Change Management IT Service Management Process Improvement IT Management Integration Management Cross-functional Team... Program Management Strategic Planning Vendor Management IT Operations ITIL IT Strategy Strategy Manufacturing PMP See 2+     See less Software Project... Change Management IT Service Management Process Improvement IT Management Integration Management Cross-functional Team... Program Management Strategic Planning Vendor Management IT Operations ITIL IT Strategy Strategy Manufacturing PMP See 2+     See less ", "Skills Program Management Business Process Integration Cross-functional Team... Testing Process Improvement Project Management Quality Assurance ERP SAP Change Management Management Project Planning Analysis Strategy Risk Management PMP See 2+     See less Skills  Program Management Business Process Integration Cross-functional Team... Testing Process Improvement Project Management Quality Assurance ERP SAP Change Management Management Project Planning Analysis Strategy Risk Management PMP See 2+     See less Program Management Business Process Integration Cross-functional Team... Testing Process Improvement Project Management Quality Assurance ERP SAP Change Management Management Project Planning Analysis Strategy Risk Management PMP See 2+     See less Program Management Business Process Integration Cross-functional Team... Testing Process Improvement Project Management Quality Assurance ERP SAP Change Management Management Project Planning Analysis Strategy Risk Management PMP See 2+     See less Honors & Awards ", "Summary • Proven extensive experience in building and managing successful IT teams \n• In-depth knowledge of Central and Latin American business practices  \n• Excellent leadership and negotiation skills managing multi-million dollar budgets \n• Strong knowledge of IT Engineering and Manufacturing business requirements \n• Demonstrated ability to hire, mentor, and manage high-output global teams \n• Advanced knowledge of Intel products and services \nStrengths include: process engineering, problem analysis and resolution, strategy development, and international project management. \nAccomplished in IT productivity and efficiency improvement, process facilitation, developing diverse teams, and delivering quality results. Summary • Proven extensive experience in building and managing successful IT teams \n• In-depth knowledge of Central and Latin American business practices  \n• Excellent leadership and negotiation skills managing multi-million dollar budgets \n• Strong knowledge of IT Engineering and Manufacturing business requirements \n• Demonstrated ability to hire, mentor, and manage high-output global teams \n• Advanced knowledge of Intel products and services \nStrengths include: process engineering, problem analysis and resolution, strategy development, and international project management. \nAccomplished in IT productivity and efficiency improvement, process facilitation, developing diverse teams, and delivering quality results. • Proven extensive experience in building and managing successful IT teams \n• In-depth knowledge of Central and Latin American business practices  \n• Excellent leadership and negotiation skills managing multi-million dollar budgets \n• Strong knowledge of IT Engineering and Manufacturing business requirements \n• Demonstrated ability to hire, mentor, and manage high-output global teams \n• Advanced knowledge of Intel products and services \nStrengths include: process engineering, problem analysis and resolution, strategy development, and international project management. \nAccomplished in IT productivity and efficiency improvement, process facilitation, developing diverse teams, and delivering quality results. • Proven extensive experience in building and managing successful IT teams \n• In-depth knowledge of Central and Latin American business practices  \n• Excellent leadership and negotiation skills managing multi-million dollar budgets \n• Strong knowledge of IT Engineering and Manufacturing business requirements \n• Demonstrated ability to hire, mentor, and manage high-output global teams \n• Advanced knowledge of Intel products and services \nStrengths include: process engineering, problem analysis and resolution, strategy development, and international project management. \nAccomplished in IT productivity and efficiency improvement, process facilitation, developing diverse teams, and delivering quality results. Experience IT Manager Intel Corporation October 2012  – Present (2 years 11 months) Folsom, CA WAN / External Network Service / Voice / Audio Service  \n \nService Level Manager – Intel, Folsom, CA 2012-Present \n \nCurrently responsible for global project managers chartered with implementing Intel's Wide Area Network projects, Inter Company Connections, WAN/Voice/Audio capacity, Voice and Audio Collaboration Services, and associated Audio infrastructure. Manage a multi-million dollar budget while driving the procurement, installation, upgrade, testing and servicing of vendor circuits, routers, switches and other network infrastructure related to WAN. Responsible for driving WAN, Voice, and Audio proactive monitoring across the service, resulting in mitigating Major Incidents (MI). Direct Continuous Improvements initiatives following Lean Six Sigma practices across the service, creating key performance indicators and metrics resulting in increased program efficiency and completion times Manager Intel Corporation January 2010  –  October 2012  (2 years 10 months) Austin, Texas Responsible for data center operations in Costa Rica and Guadalajara. \nFlawless completion of multi-million dollar data center in Costa Rica, on-time and within budget. Seamless transition of all IT services to new data center with no unscheduled customer downtime. Implemented new Design Engineering infrastructure in Costa Rica. Consistent ability to achieve positive results in a rapidly changing, fast-paced environment. Demonstrated ability to exceed expectations in day-to-day efforts to develop, build, and manage organizational partnerships between IT Ops/IT Networks/Design Engineering/ Manufacturing/Corporate Services. Asserted strong skill in negotiating and influencing partner organizations such as Date Center Services, Data Center Engineering, IT Network Ops, IT Engineering, Facilities / Corp Services, and Assembly Test and Manufacturing. Manager / Ex-Pat Intel Corporation May 2008  –  July 2010  (2 years 3 months) Costa Rica Responsible for data center operations in Costa Rica and Guadalajara. \nFlawless completion of new data center in Costa Rica, on-time and within budget. Seamless transition of all IT services from old data center to new data center with no unscheduled customer downtime. Implemented new Design Engineering infrastructure in Costa Rica. Consistent ability to achieve positive results in a rapidly changing, fast-paced environment. Demonstrated ability to exceed expectations in day-to-day efforts to develop, build, and manage organizational partnerships between IT Ops/IT Networks/Design Engineering/ Manufacturing/Corporate Services. Asserted strong skill in negotiating and influencing partner organizations such as DCS, DCE, IT Network Ops, EC, Corp Services, and ATM.  \n \nIntel IT Infrastructure Automation Support Manager Intel Corporation May 2007  –  May 2008  (1 year 1 month) Austin, Texas Managed an internationally dispersed team of 18 employees responsible for the distribution, installation, operations, and troubleshooting of core IT applications. Provided leadership and guidance for junior and senior individual contributors responsible for hardware/software projects and application deployment plans. Supervised and mentored work groups and facilitated end-to-end solutions to manage changes in server environments. Drove day-to-day business via indicators and metrics. Created and implemented streamline processes and workflows. Responsible for alignment of change and risk management. Successfully managed customer and business partner requests. Manager Intel Corporation March 2006  –  May 2007  (1 year 3 months) Austin, Texas Managed a team of four first-line managers and fifteen individual contributors. Drove team to deliver results in projects across 48 sites in the diverse region supported. Leveraged customer partnerships to better comprehend SMG customer requirements. Executed the start-up and shut-down of SMG sites. Successfully incorporated new campuses into America Region Remote sites (Sarvega & Champaign, Córdoba, AN3), while ensuring that all other commitments were consistently fulfilled. All accomplishments were achieved while operating with a reduced staff at the Costa Rica, San Diego, and Irvine Sites (resulting from SET activities). Provided direct reports with resources required to attain results. Credited with flawless integration of newly acquired entities. Successful projects include IT Engineering Manager Intel Corporation January 2000  –  January 2006  (6 years 1 month) Austin, Texas Managed a team of ten IT engineers supporting design and software developers at Austin and Guadalajara (GDC) facilities. Delivered automated and engineered solutions increasing design engineer productivity. Drove quarterly and yearly compute system forecasts and partnered with Corp Services, IT LAN and IT Server Ops. Facilitated adequate power and cooling to support data center expansion. Managed $5 million yearly capital POR for WCCG Austin business unit and consistently met plan targets. Provided proactive compute/capital forecasting processes to business unit managers to attain support for capital expense approval. Mergers & Acquisitions IT Integration Manager Intel Corporation January 1998  –  January 2000  (2 years 1 month) IT integration manager for Shiva, Corollary and DEC Austin. Accountable for project planning and resource management of all IT aspects of acquisition integration. Met project deadlines requiring intensive negotiating, facilitating, and partnering with all related service providers including IT, Corp Services, facilities planning, EC, and associated business units. Manager Intel Corporation January 1992  –  January 1998  (6 years 1 month) SCS IT manager in Folsom; Managed server team, client team, and LAN team Served as Banyan System administrator. IT Manager Intel Corporation October 2012  – Present (2 years 11 months) Folsom, CA WAN / External Network Service / Voice / Audio Service  \n \nService Level Manager – Intel, Folsom, CA 2012-Present \n \nCurrently responsible for global project managers chartered with implementing Intel's Wide Area Network projects, Inter Company Connections, WAN/Voice/Audio capacity, Voice and Audio Collaboration Services, and associated Audio infrastructure. Manage a multi-million dollar budget while driving the procurement, installation, upgrade, testing and servicing of vendor circuits, routers, switches and other network infrastructure related to WAN. Responsible for driving WAN, Voice, and Audio proactive monitoring across the service, resulting in mitigating Major Incidents (MI). Direct Continuous Improvements initiatives following Lean Six Sigma practices across the service, creating key performance indicators and metrics resulting in increased program efficiency and completion times IT Manager Intel Corporation October 2012  – Present (2 years 11 months) Folsom, CA WAN / External Network Service / Voice / Audio Service  \n \nService Level Manager – Intel, Folsom, CA 2012-Present \n \nCurrently responsible for global project managers chartered with implementing Intel's Wide Area Network projects, Inter Company Connections, WAN/Voice/Audio capacity, Voice and Audio Collaboration Services, and associated Audio infrastructure. Manage a multi-million dollar budget while driving the procurement, installation, upgrade, testing and servicing of vendor circuits, routers, switches and other network infrastructure related to WAN. Responsible for driving WAN, Voice, and Audio proactive monitoring across the service, resulting in mitigating Major Incidents (MI). Direct Continuous Improvements initiatives following Lean Six Sigma practices across the service, creating key performance indicators and metrics resulting in increased program efficiency and completion times Manager Intel Corporation January 2010  –  October 2012  (2 years 10 months) Austin, Texas Responsible for data center operations in Costa Rica and Guadalajara. \nFlawless completion of multi-million dollar data center in Costa Rica, on-time and within budget. Seamless transition of all IT services to new data center with no unscheduled customer downtime. Implemented new Design Engineering infrastructure in Costa Rica. Consistent ability to achieve positive results in a rapidly changing, fast-paced environment. Demonstrated ability to exceed expectations in day-to-day efforts to develop, build, and manage organizational partnerships between IT Ops/IT Networks/Design Engineering/ Manufacturing/Corporate Services. Asserted strong skill in negotiating and influencing partner organizations such as Date Center Services, Data Center Engineering, IT Network Ops, IT Engineering, Facilities / Corp Services, and Assembly Test and Manufacturing. Manager Intel Corporation January 2010  –  October 2012  (2 years 10 months) Austin, Texas Responsible for data center operations in Costa Rica and Guadalajara. \nFlawless completion of multi-million dollar data center in Costa Rica, on-time and within budget. Seamless transition of all IT services to new data center with no unscheduled customer downtime. Implemented new Design Engineering infrastructure in Costa Rica. Consistent ability to achieve positive results in a rapidly changing, fast-paced environment. Demonstrated ability to exceed expectations in day-to-day efforts to develop, build, and manage organizational partnerships between IT Ops/IT Networks/Design Engineering/ Manufacturing/Corporate Services. Asserted strong skill in negotiating and influencing partner organizations such as Date Center Services, Data Center Engineering, IT Network Ops, IT Engineering, Facilities / Corp Services, and Assembly Test and Manufacturing. Manager / Ex-Pat Intel Corporation May 2008  –  July 2010  (2 years 3 months) Costa Rica Responsible for data center operations in Costa Rica and Guadalajara. \nFlawless completion of new data center in Costa Rica, on-time and within budget. Seamless transition of all IT services from old data center to new data center with no unscheduled customer downtime. Implemented new Design Engineering infrastructure in Costa Rica. Consistent ability to achieve positive results in a rapidly changing, fast-paced environment. Demonstrated ability to exceed expectations in day-to-day efforts to develop, build, and manage organizational partnerships between IT Ops/IT Networks/Design Engineering/ Manufacturing/Corporate Services. Asserted strong skill in negotiating and influencing partner organizations such as DCS, DCE, IT Network Ops, EC, Corp Services, and ATM.  \n \nIntel IT Infrastructure Automation Support Manager / Ex-Pat Intel Corporation May 2008  –  July 2010  (2 years 3 months) Costa Rica Responsible for data center operations in Costa Rica and Guadalajara. \nFlawless completion of new data center in Costa Rica, on-time and within budget. Seamless transition of all IT services from old data center to new data center with no unscheduled customer downtime. Implemented new Design Engineering infrastructure in Costa Rica. Consistent ability to achieve positive results in a rapidly changing, fast-paced environment. Demonstrated ability to exceed expectations in day-to-day efforts to develop, build, and manage organizational partnerships between IT Ops/IT Networks/Design Engineering/ Manufacturing/Corporate Services. Asserted strong skill in negotiating and influencing partner organizations such as DCS, DCE, IT Network Ops, EC, Corp Services, and ATM.  \n \nIntel IT Infrastructure Automation Support Manager Intel Corporation May 2007  –  May 2008  (1 year 1 month) Austin, Texas Managed an internationally dispersed team of 18 employees responsible for the distribution, installation, operations, and troubleshooting of core IT applications. Provided leadership and guidance for junior and senior individual contributors responsible for hardware/software projects and application deployment plans. Supervised and mentored work groups and facilitated end-to-end solutions to manage changes in server environments. Drove day-to-day business via indicators and metrics. Created and implemented streamline processes and workflows. Responsible for alignment of change and risk management. Successfully managed customer and business partner requests. Manager Intel Corporation May 2007  –  May 2008  (1 year 1 month) Austin, Texas Managed an internationally dispersed team of 18 employees responsible for the distribution, installation, operations, and troubleshooting of core IT applications. Provided leadership and guidance for junior and senior individual contributors responsible for hardware/software projects and application deployment plans. Supervised and mentored work groups and facilitated end-to-end solutions to manage changes in server environments. Drove day-to-day business via indicators and metrics. Created and implemented streamline processes and workflows. Responsible for alignment of change and risk management. Successfully managed customer and business partner requests. Manager Intel Corporation March 2006  –  May 2007  (1 year 3 months) Austin, Texas Managed a team of four first-line managers and fifteen individual contributors. Drove team to deliver results in projects across 48 sites in the diverse region supported. Leveraged customer partnerships to better comprehend SMG customer requirements. Executed the start-up and shut-down of SMG sites. Successfully incorporated new campuses into America Region Remote sites (Sarvega & Champaign, Córdoba, AN3), while ensuring that all other commitments were consistently fulfilled. All accomplishments were achieved while operating with a reduced staff at the Costa Rica, San Diego, and Irvine Sites (resulting from SET activities). Provided direct reports with resources required to attain results. Credited with flawless integration of newly acquired entities. Successful projects include Manager Intel Corporation March 2006  –  May 2007  (1 year 3 months) Austin, Texas Managed a team of four first-line managers and fifteen individual contributors. Drove team to deliver results in projects across 48 sites in the diverse region supported. Leveraged customer partnerships to better comprehend SMG customer requirements. Executed the start-up and shut-down of SMG sites. Successfully incorporated new campuses into America Region Remote sites (Sarvega & Champaign, Córdoba, AN3), while ensuring that all other commitments were consistently fulfilled. All accomplishments were achieved while operating with a reduced staff at the Costa Rica, San Diego, and Irvine Sites (resulting from SET activities). Provided direct reports with resources required to attain results. Credited with flawless integration of newly acquired entities. Successful projects include IT Engineering Manager Intel Corporation January 2000  –  January 2006  (6 years 1 month) Austin, Texas Managed a team of ten IT engineers supporting design and software developers at Austin and Guadalajara (GDC) facilities. Delivered automated and engineered solutions increasing design engineer productivity. Drove quarterly and yearly compute system forecasts and partnered with Corp Services, IT LAN and IT Server Ops. Facilitated adequate power and cooling to support data center expansion. Managed $5 million yearly capital POR for WCCG Austin business unit and consistently met plan targets. Provided proactive compute/capital forecasting processes to business unit managers to attain support for capital expense approval. IT Engineering Manager Intel Corporation January 2000  –  January 2006  (6 years 1 month) Austin, Texas Managed a team of ten IT engineers supporting design and software developers at Austin and Guadalajara (GDC) facilities. Delivered automated and engineered solutions increasing design engineer productivity. Drove quarterly and yearly compute system forecasts and partnered with Corp Services, IT LAN and IT Server Ops. Facilitated adequate power and cooling to support data center expansion. Managed $5 million yearly capital POR for WCCG Austin business unit and consistently met plan targets. Provided proactive compute/capital forecasting processes to business unit managers to attain support for capital expense approval. Mergers & Acquisitions IT Integration Manager Intel Corporation January 1998  –  January 2000  (2 years 1 month) IT integration manager for Shiva, Corollary and DEC Austin. Accountable for project planning and resource management of all IT aspects of acquisition integration. Met project deadlines requiring intensive negotiating, facilitating, and partnering with all related service providers including IT, Corp Services, facilities planning, EC, and associated business units. Mergers & Acquisitions IT Integration Manager Intel Corporation January 1998  –  January 2000  (2 years 1 month) IT integration manager for Shiva, Corollary and DEC Austin. Accountable for project planning and resource management of all IT aspects of acquisition integration. Met project deadlines requiring intensive negotiating, facilitating, and partnering with all related service providers including IT, Corp Services, facilities planning, EC, and associated business units. Manager Intel Corporation January 1992  –  January 1998  (6 years 1 month) SCS IT manager in Folsom; Managed server team, client team, and LAN team Served as Banyan System administrator. Manager Intel Corporation January 1992  –  January 1998  (6 years 1 month) SCS IT manager in Folsom; Managed server team, client team, and LAN team Served as Banyan System administrator. Languages Spanish Spanish Spanish Skills ITIL Service Management... Certified Data Center... Certified Data Center... PMP Intel Infrastructure SPC Cross-functional Team... Program Management Six Sigma IT Service Management Data Center Integration ITIL International Project... Business Process Strategic Planning Troubleshooting Management Testing Project Planning See 6+     See less Skills  ITIL Service Management... Certified Data Center... Certified Data Center... PMP Intel Infrastructure SPC Cross-functional Team... Program Management Six Sigma IT Service Management Data Center Integration ITIL International Project... Business Process Strategic Planning Troubleshooting Management Testing Project Planning See 6+     See less ITIL Service Management... Certified Data Center... Certified Data Center... PMP Intel Infrastructure SPC Cross-functional Team... Program Management Six Sigma IT Service Management Data Center Integration ITIL International Project... Business Process Strategic Planning Troubleshooting Management Testing Project Planning See 6+     See less ITIL Service Management... Certified Data Center... Certified Data Center... PMP Intel Infrastructure SPC Cross-functional Team... Program Management Six Sigma IT Service Management Data Center Integration ITIL International Project... Business Process Strategic Planning Troubleshooting Management Testing Project Planning See 6+     See less Education University of San Francisco Bachelor of Science,  Management of Information Systems 1987  – 1989 California State University-Sacramento Computer Science 1984  – 1986 University of San Francisco Bachelor of Science,  Management of Information Systems 1987  – 1989 University of San Francisco Bachelor of Science,  Management of Information Systems 1987  – 1989 University of San Francisco Bachelor of Science,  Management of Information Systems 1987  – 1989 California State University-Sacramento Computer Science 1984  – 1986 California State University-Sacramento Computer Science 1984  – 1986 California State University-Sacramento Computer Science 1984  – 1986 ", "Languages English Native or bilingual proficiency Spanish Native or bilingual proficiency English Native or bilingual proficiency Spanish Native or bilingual proficiency English Native or bilingual proficiency Spanish Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Transportation Logistics Supply Chain Negotiation Supply Chain Management 3PL Supply Management Management Operations Management Warehousing Cross-functional Team... SAP ERP Six Sigma Leadership Business Analysis Continuous Improvement Lean Manufacturing Product Management Process Improvement Strategic Sourcing Manufacturing MRP Supply Chain... Materials Management Logistics Management Business Process... Procurement See 13+     See less Skills  Transportation Logistics Supply Chain Negotiation Supply Chain Management 3PL Supply Management Management Operations Management Warehousing Cross-functional Team... SAP ERP Six Sigma Leadership Business Analysis Continuous Improvement Lean Manufacturing Product Management Process Improvement Strategic Sourcing Manufacturing MRP Supply Chain... Materials Management Logistics Management Business Process... Procurement See 13+     See less Transportation Logistics Supply Chain Negotiation Supply Chain Management 3PL Supply Management Management Operations Management Warehousing Cross-functional Team... SAP ERP Six Sigma Leadership Business Analysis Continuous Improvement Lean Manufacturing Product Management Process Improvement Strategic Sourcing Manufacturing MRP Supply Chain... Materials Management Logistics Management Business Process... Procurement See 13+     See less Transportation Logistics Supply Chain Negotiation Supply Chain Management 3PL Supply Management Management Operations Management Warehousing Cross-functional Team... SAP ERP Six Sigma Leadership Business Analysis Continuous Improvement Lean Manufacturing Product Management Process Improvement Strategic Sourcing Manufacturing MRP Supply Chain... Materials Management Logistics Management Business Process... Procurement See 13+     See less ", "Skills Skills     ", "Skills Program Management Marketing CRM Digital Marketing Email Marketing Social Media Strategic Planning Recruiting Public Speaking Coaching Integrated Marketing Cross-functional Team... Workshop Facilitation Sales Management Social Networking Training Delivery Targeted Advertising Community Sites Database Marketing Program Development Leadership Website Development CMS Training Team Building Community Building Knowldge Management... Content Management... Customer Relationship... Mentoring Entrepreneurship Project Management Organizational... Strategy Team Leadership Nonprofits Web Site Development Social Media Development Presentations Strengths Assessment Brand Clarification Community Outreach Social Media Outreach Educational Outreach See 30+     See less Skills  Program Management Marketing CRM Digital Marketing Email Marketing Social Media Strategic Planning Recruiting Public Speaking Coaching Integrated Marketing Cross-functional Team... Workshop Facilitation Sales Management Social Networking Training Delivery Targeted Advertising Community Sites Database Marketing Program Development Leadership Website Development CMS Training Team Building Community Building Knowldge Management... Content Management... Customer Relationship... Mentoring Entrepreneurship Project Management Organizational... Strategy Team Leadership Nonprofits Web Site Development Social Media Development Presentations Strengths Assessment Brand Clarification Community Outreach Social Media Outreach Educational Outreach See 30+     See less Program Management Marketing CRM Digital Marketing Email Marketing Social Media Strategic Planning Recruiting Public Speaking Coaching Integrated Marketing Cross-functional Team... Workshop Facilitation Sales Management Social Networking Training Delivery Targeted Advertising Community Sites Database Marketing Program Development Leadership Website Development CMS Training Team Building Community Building Knowldge Management... Content Management... Customer Relationship... Mentoring Entrepreneurship Project Management Organizational... Strategy Team Leadership Nonprofits Web Site Development Social Media Development Presentations Strengths Assessment Brand Clarification Community Outreach Social Media Outreach Educational Outreach See 30+     See less Program Management Marketing CRM Digital Marketing Email Marketing Social Media Strategic Planning Recruiting Public Speaking Coaching Integrated Marketing Cross-functional Team... Workshop Facilitation Sales Management Social Networking Training Delivery Targeted Advertising Community Sites Database Marketing Program Development Leadership Website Development CMS Training Team Building Community Building Knowldge Management... Content Management... Customer Relationship... Mentoring Entrepreneurship Project Management Organizational... Strategy Team Leadership Nonprofits Web Site Development Social Media Development Presentations Strengths Assessment Brand Clarification Community Outreach Social Media Outreach Educational Outreach See 30+     See less ", "Summary Supply Chain manager with extensive experience in Planning and Manufacturing Systems. Successful track record in Operations and project management, with focus on processes and efficiency.  \nLed culturally diversed teams across multiple geographies, from project conception to implementation and stabilization.  \nInternational work experience in Asia.  \nEnjoys solving problems and working with people. Specialties:program management, project management, supply chain, shop floor control, manufacturing, planning, cross cultural team Summary Supply Chain manager with extensive experience in Planning and Manufacturing Systems. Successful track record in Operations and project management, with focus on processes and efficiency.  \nLed culturally diversed teams across multiple geographies, from project conception to implementation and stabilization.  \nInternational work experience in Asia.  \nEnjoys solving problems and working with people. Specialties:program management, project management, supply chain, shop floor control, manufacturing, planning, cross cultural team Supply Chain manager with extensive experience in Planning and Manufacturing Systems. Successful track record in Operations and project management, with focus on processes and efficiency.  \nLed culturally diversed teams across multiple geographies, from project conception to implementation and stabilization.  \nInternational work experience in Asia.  \nEnjoys solving problems and working with people. Specialties:program management, project management, supply chain, shop floor control, manufacturing, planning, cross cultural team Supply Chain manager with extensive experience in Planning and Manufacturing Systems. Successful track record in Operations and project management, with focus on processes and efficiency.  \nLed culturally diversed teams across multiple geographies, from project conception to implementation and stabilization.  \nInternational work experience in Asia.  \nEnjoys solving problems and working with people. Specialties:program management, project management, supply chain, shop floor control, manufacturing, planning, cross cultural team Skills Program Management Project Management Cross-functional Team... Supply Chain... Supply Chain Management Supply Chain Planning Semiconductors Product Lifecycle... Continuous Improvement Lean Manufacturing Strategy Start-ups Product Development Vendor Management Leadership Electronics Management Manufacturing Strategic Sourcing Demand Planning Change Management Project Planning Demand Forecasting PMP MRP Product Management Business Intelligence Operations Management Process Improvement Semiconductor Industry Outsourcing Integration Supply Management Business Process... Business Strategy Supply Chain Operations Business Process Forecasting See 24+     See less Skills  Program Management Project Management Cross-functional Team... Supply Chain... Supply Chain Management Supply Chain Planning Semiconductors Product Lifecycle... Continuous Improvement Lean Manufacturing Strategy Start-ups Product Development Vendor Management Leadership Electronics Management Manufacturing Strategic Sourcing Demand Planning Change Management Project Planning Demand Forecasting PMP MRP Product Management Business Intelligence Operations Management Process Improvement Semiconductor Industry Outsourcing Integration Supply Management Business Process... Business Strategy Supply Chain Operations Business Process Forecasting See 24+     See less Program Management Project Management Cross-functional Team... Supply Chain... Supply Chain Management Supply Chain Planning Semiconductors Product Lifecycle... Continuous Improvement Lean Manufacturing Strategy Start-ups Product Development Vendor Management Leadership Electronics Management Manufacturing Strategic Sourcing Demand Planning Change Management Project Planning Demand Forecasting PMP MRP Product Management Business Intelligence Operations Management Process Improvement Semiconductor Industry Outsourcing Integration Supply Management Business Process... Business Strategy Supply Chain Operations Business Process Forecasting See 24+     See less Program Management Project Management Cross-functional Team... Supply Chain... Supply Chain Management Supply Chain Planning Semiconductors Product Lifecycle... Continuous Improvement Lean Manufacturing Strategy Start-ups Product Development Vendor Management Leadership Electronics Management Manufacturing Strategic Sourcing Demand Planning Change Management Project Planning Demand Forecasting PMP MRP Product Management Business Intelligence Operations Management Process Improvement Semiconductor Industry Outsourcing Integration Supply Management Business Process... Business Strategy Supply Chain Operations Business Process Forecasting See 24+     See less ", "Skills College Recruiting Applicant Tracking... Talent Acquisition Workforce Planning Talent Management Technical Recruiting Internet Recruiting Onboarding Sourcing Temporary Placement Taleo Recruiting Employee Relations Human Resources Employer Branding Skills  College Recruiting Applicant Tracking... Talent Acquisition Workforce Planning Talent Management Technical Recruiting Internet Recruiting Onboarding Sourcing Temporary Placement Taleo Recruiting Employee Relations Human Resources Employer Branding College Recruiting Applicant Tracking... Talent Acquisition Workforce Planning Talent Management Technical Recruiting Internet Recruiting Onboarding Sourcing Temporary Placement Taleo Recruiting Employee Relations Human Resources Employer Branding College Recruiting Applicant Tracking... Talent Acquisition Workforce Planning Talent Management Technical Recruiting Internet Recruiting Onboarding Sourcing Temporary Placement Taleo Recruiting Employee Relations Human Resources Employer Branding "]}