{"position": "Manufacturing Engineer", "company": "Intel Corporation", "profiles": ["Experience Mechanical/Manufacturing Engineer Intel Corporation January 2011  – Present (4 years 8 months) Hillsboro, Oregon Mechanical, thermal, and manufacturing development and support for a variety of networking platforms. Supported products include PCIe network interface cards (NICs), network daughter/mezzanine cards, and switch module products for both OEM and generic/retail customers. Mechanical Designer Corbin Consulting Engineers, Inc. April 2010  –  January 2011  (10 months) Perform mechanical design of HVAC systems under the supervision of the Corbin Engineering team. \n \nAlso responsible for other activities in support of the engineering team (Drawing checks, calculations, equipment selection, field work, etc.).  \n \nWorked on site at Intel's Ronler Acres Fabrication Facilities. Client Services Representative Answer Connect / Voice Curve January 2010  –  April 2010  (4 months) Worked as a member of the client services team for a telecommunications company that provides answering services to clients around the world. Radiation Monitor Oregon State University Radiation Center October 2006  –  June 2009  (2 years 9 months) Performed routine daily and weekly radiation surveys of the nuclear reactor bay and surrounding areas at the Oregon State University Radiation Center. Mechanical Engineering Intern Jacobs Engineering June 2008  –  September 2008  (4 months) Assisted the mechanical engineering department while learning the basics of heating, ventilation, and air conditioning (HVAC) design and implementation. Responsible for drawing checks, HVAC design, air flow calculations, isometric drawing updates, equipment selection and sizing, project database creation, and limited AutoCAD work. Mechanical/Manufacturing Engineer Intel Corporation January 2011  – Present (4 years 8 months) Hillsboro, Oregon Mechanical, thermal, and manufacturing development and support for a variety of networking platforms. Supported products include PCIe network interface cards (NICs), network daughter/mezzanine cards, and switch module products for both OEM and generic/retail customers. Mechanical/Manufacturing Engineer Intel Corporation January 2011  – Present (4 years 8 months) Hillsboro, Oregon Mechanical, thermal, and manufacturing development and support for a variety of networking platforms. Supported products include PCIe network interface cards (NICs), network daughter/mezzanine cards, and switch module products for both OEM and generic/retail customers. Mechanical Designer Corbin Consulting Engineers, Inc. April 2010  –  January 2011  (10 months) Perform mechanical design of HVAC systems under the supervision of the Corbin Engineering team. \n \nAlso responsible for other activities in support of the engineering team (Drawing checks, calculations, equipment selection, field work, etc.).  \n \nWorked on site at Intel's Ronler Acres Fabrication Facilities. Mechanical Designer Corbin Consulting Engineers, Inc. April 2010  –  January 2011  (10 months) Perform mechanical design of HVAC systems under the supervision of the Corbin Engineering team. \n \nAlso responsible for other activities in support of the engineering team (Drawing checks, calculations, equipment selection, field work, etc.).  \n \nWorked on site at Intel's Ronler Acres Fabrication Facilities. Client Services Representative Answer Connect / Voice Curve January 2010  –  April 2010  (4 months) Worked as a member of the client services team for a telecommunications company that provides answering services to clients around the world. Client Services Representative Answer Connect / Voice Curve January 2010  –  April 2010  (4 months) Worked as a member of the client services team for a telecommunications company that provides answering services to clients around the world. Radiation Monitor Oregon State University Radiation Center October 2006  –  June 2009  (2 years 9 months) Performed routine daily and weekly radiation surveys of the nuclear reactor bay and surrounding areas at the Oregon State University Radiation Center. Radiation Monitor Oregon State University Radiation Center October 2006  –  June 2009  (2 years 9 months) Performed routine daily and weekly radiation surveys of the nuclear reactor bay and surrounding areas at the Oregon State University Radiation Center. Mechanical Engineering Intern Jacobs Engineering June 2008  –  September 2008  (4 months) Assisted the mechanical engineering department while learning the basics of heating, ventilation, and air conditioning (HVAC) design and implementation. Responsible for drawing checks, HVAC design, air flow calculations, isometric drawing updates, equipment selection and sizing, project database creation, and limited AutoCAD work. Mechanical Engineering Intern Jacobs Engineering June 2008  –  September 2008  (4 months) Assisted the mechanical engineering department while learning the basics of heating, ventilation, and air conditioning (HVAC) design and implementation. Responsible for drawing checks, HVAC design, air flow calculations, isometric drawing updates, equipment selection and sizing, project database creation, and limited AutoCAD work. Skills Engineering Skills  Engineering Engineering Engineering Education Oregon State University BS,  Mechanical Engineering 2004  – 2009 Activities and Societies:  Pi Tau Sigma (Mechanical Engineering Honor Society) Oregon State University 2004  – 2009 Jesuit High School Oregon State University BS,  Mechanical Engineering 2004  – 2009 Activities and Societies:  Pi Tau Sigma (Mechanical Engineering Honor Society) Oregon State University BS,  Mechanical Engineering 2004  – 2009 Activities and Societies:  Pi Tau Sigma (Mechanical Engineering Honor Society) Oregon State University BS,  Mechanical Engineering 2004  – 2009 Activities and Societies:  Pi Tau Sigma (Mechanical Engineering Honor Society) Oregon State University 2004  – 2009 Oregon State University 2004  – 2009 Oregon State University 2004  – 2009 Jesuit High School Jesuit High School Jesuit High School ", "Skills SPC Design of Experiments Semiconductors Lean Manufacturing Six Sigma Industrial Engineering JMP Manufacturing... Engineering Management Engineering Manufacturing Continuous Improvement Skills  SPC Design of Experiments Semiconductors Lean Manufacturing Six Sigma Industrial Engineering JMP Manufacturing... Engineering Management Engineering Manufacturing Continuous Improvement SPC Design of Experiments Semiconductors Lean Manufacturing Six Sigma Industrial Engineering JMP Manufacturing... Engineering Management Engineering Manufacturing Continuous Improvement SPC Design of Experiments Semiconductors Lean Manufacturing Six Sigma Industrial Engineering JMP Manufacturing... Engineering Management Engineering Manufacturing Continuous Improvement ", "Summary I would love to apply my industrial engineering knowledge and apply it to a real world setting to provide a fresh perspective on continuous improvement. Summary I would love to apply my industrial engineering knowledge and apply it to a real world setting to provide a fresh perspective on continuous improvement. I would love to apply my industrial engineering knowledge and apply it to a real world setting to provide a fresh perspective on continuous improvement. I would love to apply my industrial engineering knowledge and apply it to a real world setting to provide a fresh perspective on continuous improvement. Experience Manufacturing Engineer Intel Corporation February 2015  – Present (7 months) Portland, Oregon Area Graduate Student Instructor: IOE440 Operations Analysis and Management University of Michigan September 2014  –  December 2014  (4 months) Ann Arbor * Hosted Office Hours and meet up with students through individual appointments to facilitate student learning \n* Wrote and graded exams and homework \n Industrial Engineering Intern Intel Corporation May 2014  –  August 2014  (4 months) Chandler, Arizona * Automated the manual process of creating within segment unique product comparisons for management, which increased user flexibility and provided a viable method to regularly update report outs, leading to an 80% reduction of non-value added time \n* Decreased the time required to convert times studies data collected on the floor to run rate validation parameters by 92% \n* Developed a method to extract log file time stamps required for run rate validations, allowing an increased visibility of data and decreased effect of data quality issues, which reduced data collection time by 83% of the original time Production Control and Inventory Management Intern GIGASTORAGE CORP July 2013  –  August 2013  (2 months) Taiwan * Managed inventory levels in conjunction with other departments through the use of the ERP system, which ensured that filed inventory reports matched those of the purchasing department \n* Oversaw Tin Lead Plated Copper Ribbon production meetings to prioritize schedules for each customer due dates, which increased production levels of Ribbon by 33% to meet demands \n* Employed lean techniques to re-organized inventory labels and updated storage shelf information, reducing the time to search for items by 40% Research Assistant University of Michigan May 2013  –  June 2013  (2 months) Ann Arbor, MI * Analyzed models and critiqued literature on health technology to model projected sales volumes of specialized shoulder and knee orthopedic devices in order to distinguish which products to scrutinize for possible liabilities, leading to a preliminary model \n* Utilized SQL and MATLAB to extract and formulate a sales volume model from an orthopedic device database to produce a model, predicting the growth of sales of devices within a confidence interval Process Improvement Analyst- Practicum UNIVERSITY OF MICHIGAN HEALTH SYSTEM January 2013  –  April 2013  (4 months) Ann Arbor, MI * Performed observations of various department staff and analyzed Mi-Chart data to examine non-value added time and draw out a value stream map of the patient transfer process, validating assumptions given by senior leadership \n* Lead senior design project team by facilitating communication between the project group, coordinators, and clients to ensure that key deadlines were met \n* Produced recommendations to reduce unnecessary steps during the patient transfer process with projected reduction of patient transfer lead times by 8% Research Assistant Ulsan National Institute of Science and Technology Ulsan June 2012  –  July 2012  (2 months) Evaluated and formulated a put option pricing model that made use of the EWMA formula \n* Collaborated with the professor to improve knowledge on stochastic models \n* Stimulated team discussion to facilitate the research proposal process \n* Presented presentations in weekly seminars regarding papers on commodity pricing Teaching Assistant TC Merica English Institute June 2011  –  July 2011  (2 months) Supervised daily SAT classes of 25 students to expedite the teaching process \n* Managed Excel databases and weekly reports on individual student performances to enhance \ninstitute and parent communication \n* Tutored individuals on students’ time management and test taking skills for the SAT mathematics \nsubject tests on a bi-weekly basis Treasurer Dance 2XS September 2010  –  January 2011  (5 months) Managed budget costs and collected dues for the group of 24 students \n* Produced and learned choreography to perform at on-campus and off-campus events \n* Networked with other dancers from professional and college groups through performances Assistant Engineer TTS. Civil & Structure Associates June 2010  –  July 2010  (2 months) * Oversaw the precise completion of Steel Reinforced Concrete (SRC) construction project site of approximately 20 people to ensure worker safety \n* Optimized the most cost effective structures by using structural programs such as Sap 2000 and ETABS to analyze construct for the bridge structure projects \n* Facilitated communication between the Senior Engineer and his clients through the use of AutoCAD 2D to design and to modify existing files that fit current circumstances \n* Collaborated with clients to identify building repair for houses, which ensured that the clients were directed toward the correct method of requesting funds from their insurance companies Manufacturing Engineer Intel Corporation February 2015  – Present (7 months) Portland, Oregon Area Manufacturing Engineer Intel Corporation February 2015  – Present (7 months) Portland, Oregon Area Graduate Student Instructor: IOE440 Operations Analysis and Management University of Michigan September 2014  –  December 2014  (4 months) Ann Arbor * Hosted Office Hours and meet up with students through individual appointments to facilitate student learning \n* Wrote and graded exams and homework \n Graduate Student Instructor: IOE440 Operations Analysis and Management University of Michigan September 2014  –  December 2014  (4 months) Ann Arbor * Hosted Office Hours and meet up with students through individual appointments to facilitate student learning \n* Wrote and graded exams and homework \n Industrial Engineering Intern Intel Corporation May 2014  –  August 2014  (4 months) Chandler, Arizona * Automated the manual process of creating within segment unique product comparisons for management, which increased user flexibility and provided a viable method to regularly update report outs, leading to an 80% reduction of non-value added time \n* Decreased the time required to convert times studies data collected on the floor to run rate validation parameters by 92% \n* Developed a method to extract log file time stamps required for run rate validations, allowing an increased visibility of data and decreased effect of data quality issues, which reduced data collection time by 83% of the original time Industrial Engineering Intern Intel Corporation May 2014  –  August 2014  (4 months) Chandler, Arizona * Automated the manual process of creating within segment unique product comparisons for management, which increased user flexibility and provided a viable method to regularly update report outs, leading to an 80% reduction of non-value added time \n* Decreased the time required to convert times studies data collected on the floor to run rate validation parameters by 92% \n* Developed a method to extract log file time stamps required for run rate validations, allowing an increased visibility of data and decreased effect of data quality issues, which reduced data collection time by 83% of the original time Production Control and Inventory Management Intern GIGASTORAGE CORP July 2013  –  August 2013  (2 months) Taiwan * Managed inventory levels in conjunction with other departments through the use of the ERP system, which ensured that filed inventory reports matched those of the purchasing department \n* Oversaw Tin Lead Plated Copper Ribbon production meetings to prioritize schedules for each customer due dates, which increased production levels of Ribbon by 33% to meet demands \n* Employed lean techniques to re-organized inventory labels and updated storage shelf information, reducing the time to search for items by 40% Production Control and Inventory Management Intern GIGASTORAGE CORP July 2013  –  August 2013  (2 months) Taiwan * Managed inventory levels in conjunction with other departments through the use of the ERP system, which ensured that filed inventory reports matched those of the purchasing department \n* Oversaw Tin Lead Plated Copper Ribbon production meetings to prioritize schedules for each customer due dates, which increased production levels of Ribbon by 33% to meet demands \n* Employed lean techniques to re-organized inventory labels and updated storage shelf information, reducing the time to search for items by 40% Research Assistant University of Michigan May 2013  –  June 2013  (2 months) Ann Arbor, MI * Analyzed models and critiqued literature on health technology to model projected sales volumes of specialized shoulder and knee orthopedic devices in order to distinguish which products to scrutinize for possible liabilities, leading to a preliminary model \n* Utilized SQL and MATLAB to extract and formulate a sales volume model from an orthopedic device database to produce a model, predicting the growth of sales of devices within a confidence interval Research Assistant University of Michigan May 2013  –  June 2013  (2 months) Ann Arbor, MI * Analyzed models and critiqued literature on health technology to model projected sales volumes of specialized shoulder and knee orthopedic devices in order to distinguish which products to scrutinize for possible liabilities, leading to a preliminary model \n* Utilized SQL and MATLAB to extract and formulate a sales volume model from an orthopedic device database to produce a model, predicting the growth of sales of devices within a confidence interval Process Improvement Analyst- Practicum UNIVERSITY OF MICHIGAN HEALTH SYSTEM January 2013  –  April 2013  (4 months) Ann Arbor, MI * Performed observations of various department staff and analyzed Mi-Chart data to examine non-value added time and draw out a value stream map of the patient transfer process, validating assumptions given by senior leadership \n* Lead senior design project team by facilitating communication between the project group, coordinators, and clients to ensure that key deadlines were met \n* Produced recommendations to reduce unnecessary steps during the patient transfer process with projected reduction of patient transfer lead times by 8% Process Improvement Analyst- Practicum UNIVERSITY OF MICHIGAN HEALTH SYSTEM January 2013  –  April 2013  (4 months) Ann Arbor, MI * Performed observations of various department staff and analyzed Mi-Chart data to examine non-value added time and draw out a value stream map of the patient transfer process, validating assumptions given by senior leadership \n* Lead senior design project team by facilitating communication between the project group, coordinators, and clients to ensure that key deadlines were met \n* Produced recommendations to reduce unnecessary steps during the patient transfer process with projected reduction of patient transfer lead times by 8% Research Assistant Ulsan National Institute of Science and Technology Ulsan June 2012  –  July 2012  (2 months) Evaluated and formulated a put option pricing model that made use of the EWMA formula \n* Collaborated with the professor to improve knowledge on stochastic models \n* Stimulated team discussion to facilitate the research proposal process \n* Presented presentations in weekly seminars regarding papers on commodity pricing Research Assistant Ulsan National Institute of Science and Technology Ulsan June 2012  –  July 2012  (2 months) Evaluated and formulated a put option pricing model that made use of the EWMA formula \n* Collaborated with the professor to improve knowledge on stochastic models \n* Stimulated team discussion to facilitate the research proposal process \n* Presented presentations in weekly seminars regarding papers on commodity pricing Teaching Assistant TC Merica English Institute June 2011  –  July 2011  (2 months) Supervised daily SAT classes of 25 students to expedite the teaching process \n* Managed Excel databases and weekly reports on individual student performances to enhance \ninstitute and parent communication \n* Tutored individuals on students’ time management and test taking skills for the SAT mathematics \nsubject tests on a bi-weekly basis Teaching Assistant TC Merica English Institute June 2011  –  July 2011  (2 months) Supervised daily SAT classes of 25 students to expedite the teaching process \n* Managed Excel databases and weekly reports on individual student performances to enhance \ninstitute and parent communication \n* Tutored individuals on students’ time management and test taking skills for the SAT mathematics \nsubject tests on a bi-weekly basis Treasurer Dance 2XS September 2010  –  January 2011  (5 months) Managed budget costs and collected dues for the group of 24 students \n* Produced and learned choreography to perform at on-campus and off-campus events \n* Networked with other dancers from professional and college groups through performances Treasurer Dance 2XS September 2010  –  January 2011  (5 months) Managed budget costs and collected dues for the group of 24 students \n* Produced and learned choreography to perform at on-campus and off-campus events \n* Networked with other dancers from professional and college groups through performances Assistant Engineer TTS. Civil & Structure Associates June 2010  –  July 2010  (2 months) * Oversaw the precise completion of Steel Reinforced Concrete (SRC) construction project site of approximately 20 people to ensure worker safety \n* Optimized the most cost effective structures by using structural programs such as Sap 2000 and ETABS to analyze construct for the bridge structure projects \n* Facilitated communication between the Senior Engineer and his clients through the use of AutoCAD 2D to design and to modify existing files that fit current circumstances \n* Collaborated with clients to identify building repair for houses, which ensured that the clients were directed toward the correct method of requesting funds from their insurance companies Assistant Engineer TTS. Civil & Structure Associates June 2010  –  July 2010  (2 months) * Oversaw the precise completion of Steel Reinforced Concrete (SRC) construction project site of approximately 20 people to ensure worker safety \n* Optimized the most cost effective structures by using structural programs such as Sap 2000 and ETABS to analyze construct for the bridge structure projects \n* Facilitated communication between the Senior Engineer and his clients through the use of AutoCAD 2D to design and to modify existing files that fit current circumstances \n* Collaborated with clients to identify building repair for houses, which ensured that the clients were directed toward the correct method of requesting funds from their insurance companies Languages Chinese Chinese Chinese Skills Microsoft Office Microsoft Excel PowerPoint Microsoft Word English C++ Windows Matlab Research Photoshop Public Speaking Statistics Minitab Access Data Analysis Lean Manufacturing See 1+     See less Skills  Microsoft Office Microsoft Excel PowerPoint Microsoft Word English C++ Windows Matlab Research Photoshop Public Speaking Statistics Minitab Access Data Analysis Lean Manufacturing See 1+     See less Microsoft Office Microsoft Excel PowerPoint Microsoft Word English C++ Windows Matlab Research Photoshop Public Speaking Statistics Minitab Access Data Analysis Lean Manufacturing See 1+     See less Microsoft Office Microsoft Excel PowerPoint Microsoft Word English C++ Windows Matlab Research Photoshop Public Speaking Statistics Minitab Access Data Analysis Lean Manufacturing See 1+     See less Education University of Michigan Masters of Science in Industrial and Operations Engineering 2013  – 2014 Activities and Societies:  IIE ,  Alpha Pi Mu ,  Dance 2XS Michigan University of Michigan Bachelor of Science,  Engineering (Industrial and Operations Engineering) 2009  – 2013 Quality Engineering Principles and Analysis, Operations Modeling, Linear Statistical \nModels, Operations Analysis and Management, Optimization Modeling in Health Care, Facility \nPlanning, Data Processing, Corporate Finance, Ergonomics Activities and Societies:  alpha pi mu The Hong Kong University of Science and Technology Study Abroad 2011  – 2012 American School in Taichung University of Michigan Masters of Science in Industrial and Operations Engineering 2013  – 2014 Activities and Societies:  IIE ,  Alpha Pi Mu ,  Dance 2XS Michigan University of Michigan Masters of Science in Industrial and Operations Engineering 2013  – 2014 Activities and Societies:  IIE ,  Alpha Pi Mu ,  Dance 2XS Michigan University of Michigan Masters of Science in Industrial and Operations Engineering 2013  – 2014 Activities and Societies:  IIE ,  Alpha Pi Mu ,  Dance 2XS Michigan University of Michigan Bachelor of Science,  Engineering (Industrial and Operations Engineering) 2009  – 2013 Quality Engineering Principles and Analysis, Operations Modeling, Linear Statistical \nModels, Operations Analysis and Management, Optimization Modeling in Health Care, Facility \nPlanning, Data Processing, Corporate Finance, Ergonomics Activities and Societies:  alpha pi mu University of Michigan Bachelor of Science,  Engineering (Industrial and Operations Engineering) 2009  – 2013 Quality Engineering Principles and Analysis, Operations Modeling, Linear Statistical \nModels, Operations Analysis and Management, Optimization Modeling in Health Care, Facility \nPlanning, Data Processing, Corporate Finance, Ergonomics Activities and Societies:  alpha pi mu University of Michigan Bachelor of Science,  Engineering (Industrial and Operations Engineering) 2009  – 2013 Quality Engineering Principles and Analysis, Operations Modeling, Linear Statistical \nModels, Operations Analysis and Management, Optimization Modeling in Health Care, Facility \nPlanning, Data Processing, Corporate Finance, Ergonomics Activities and Societies:  alpha pi mu The Hong Kong University of Science and Technology Study Abroad 2011  – 2012 The Hong Kong University of Science and Technology Study Abroad 2011  – 2012 The Hong Kong University of Science and Technology Study Abroad 2011  – 2012 American School in Taichung American School in Taichung American School in Taichung ", "Summary Highly strategic, innovative, and focused technology leader with a verifiable record of achievements in leveraging emerging technologies to improve professional environments. 10+ years of experience in semiconductor fabrication. Summary Highly strategic, innovative, and focused technology leader with a verifiable record of achievements in leveraging emerging technologies to improve professional environments. 10+ years of experience in semiconductor fabrication. Highly strategic, innovative, and focused technology leader with a verifiable record of achievements in leveraging emerging technologies to improve professional environments. 10+ years of experience in semiconductor fabrication. Highly strategic, innovative, and focused technology leader with a verifiable record of achievements in leveraging emerging technologies to improve professional environments. 10+ years of experience in semiconductor fabrication. Experience Staff Manufacturing Engineer Intel Corporation March 2015  – Present (6 months) Responsible for manufacturing line support activities to assist operations with product fulfillment, perform non-conformance investigations, root cause investigations, proactively identify and drive the resolution of operational issues at the factory and module level, from a global perspective, by providing technical expertise (i.e. WIP management, reports and project management skills). Identify the need for, develop and sustain systems to improve efficiency and ensure sound operational decision-making to achieve Best in Class results.  \n \nDevelop and implement effective operations strategies and systems in support of factory goals, sustaining and enhancement and the development and documentation of robust business processes. Achieve and retain a high level of understanding of key factory systems in support of Safety, Quality, Velocity, Cost goals and lean organization. Responsible for improving overall system/module quality, increasing yields, and reducing process cycle times in the System/Module Qualification area. This is accomplished by the coordination of cross-functional activities with other departments, coordinates and/or implements changes and deviation activities to flow through manufacturing, applies statistical methods to estimate future manufacturing requirements and potential. Manufacturing Segment Manager Intel Corporation May 2013  –  March 2015  (1 year 11 months) With extensive fab operations experience and an in-depth theoretical knowledge of Factory Physics and Supply Chain Management who applies these skills to factory situations in a real-time, high cadence manner that leads a cross-functional team that is responsible for hitting the quality and cycle time goals for the section of the manufacturing process flow.  \n \nProficient in conducting effective meetings in order to run daily huddles and weekly meetings, effectively partner across the factory with the Process Module Leaders, Area Managers and Line Coordinators to be effective. Provides direction and implement lean manufacturing, Model Based Problem Solving or other continuous improvement solutions to resolve the range of issues that impact factory performance; this will require effective communication and informal leadership abilities. Drives improvements at Non-Value Added (NVA) steps to hit best in class measurement rates. Manages roadmaps execution to meet goals against area metrics in safety, cost, quality, availability, training, and external commits. Engineering Manager Intel Corporation January 2012  –  May 2013  (1 year 5 months) Responsible for the performance, development, and employee relations of engineers and technicians. Also partner with other managers to operate as one team to ensure consistency in results across all of their functional area. A role model for the culture and set the standard for expectations to living the culture.  \n \nImplements the module standard to ensure metrics are achieved, serves as a technical content expert, supports area goals, owns and is accountable for setting directions and people development. Responsible for the roadmap to meet goals against area/shift metrics in safety, cost, quality, availability, training, and employee relations. Senior Process Engineer Intel Corporation February 2006  –  January 2012  (6 years) Specilaized in device processing and fabrication (45nm. 32nm and 22nm technology node), MOS and transistor electrical characterization DOE, Data mining and analysis (JMP/SQL), and Model Based Problem Solving. \n \nCoordinate implementation of processes, assist with supplier development, troubleshoot manufacturing problems, and process scale up. Utilize quality planning methods such as Failure Mode and Effects Analysis (FMEA), detailed flow charts, Statistical Process Control (SPC), and Six Sigma tool to predict problem areas and implement cost-effective solutions that deliver within engineering defined time-line. \n \nSpecialty: Wet Etch, Plasma Etch, Ash Process Engineer Texas Instruments January 2001  –  February 2006  (5 years 2 months) Staff Manufacturing Engineer Intel Corporation March 2015  – Present (6 months) Responsible for manufacturing line support activities to assist operations with product fulfillment, perform non-conformance investigations, root cause investigations, proactively identify and drive the resolution of operational issues at the factory and module level, from a global perspective, by providing technical expertise (i.e. WIP management, reports and project management skills). Identify the need for, develop and sustain systems to improve efficiency and ensure sound operational decision-making to achieve Best in Class results.  \n \nDevelop and implement effective operations strategies and systems in support of factory goals, sustaining and enhancement and the development and documentation of robust business processes. Achieve and retain a high level of understanding of key factory systems in support of Safety, Quality, Velocity, Cost goals and lean organization. Responsible for improving overall system/module quality, increasing yields, and reducing process cycle times in the System/Module Qualification area. This is accomplished by the coordination of cross-functional activities with other departments, coordinates and/or implements changes and deviation activities to flow through manufacturing, applies statistical methods to estimate future manufacturing requirements and potential. Staff Manufacturing Engineer Intel Corporation March 2015  – Present (6 months) Responsible for manufacturing line support activities to assist operations with product fulfillment, perform non-conformance investigations, root cause investigations, proactively identify and drive the resolution of operational issues at the factory and module level, from a global perspective, by providing technical expertise (i.e. WIP management, reports and project management skills). Identify the need for, develop and sustain systems to improve efficiency and ensure sound operational decision-making to achieve Best in Class results.  \n \nDevelop and implement effective operations strategies and systems in support of factory goals, sustaining and enhancement and the development and documentation of robust business processes. Achieve and retain a high level of understanding of key factory systems in support of Safety, Quality, Velocity, Cost goals and lean organization. Responsible for improving overall system/module quality, increasing yields, and reducing process cycle times in the System/Module Qualification area. This is accomplished by the coordination of cross-functional activities with other departments, coordinates and/or implements changes and deviation activities to flow through manufacturing, applies statistical methods to estimate future manufacturing requirements and potential. Manufacturing Segment Manager Intel Corporation May 2013  –  March 2015  (1 year 11 months) With extensive fab operations experience and an in-depth theoretical knowledge of Factory Physics and Supply Chain Management who applies these skills to factory situations in a real-time, high cadence manner that leads a cross-functional team that is responsible for hitting the quality and cycle time goals for the section of the manufacturing process flow.  \n \nProficient in conducting effective meetings in order to run daily huddles and weekly meetings, effectively partner across the factory with the Process Module Leaders, Area Managers and Line Coordinators to be effective. Provides direction and implement lean manufacturing, Model Based Problem Solving or other continuous improvement solutions to resolve the range of issues that impact factory performance; this will require effective communication and informal leadership abilities. Drives improvements at Non-Value Added (NVA) steps to hit best in class measurement rates. Manages roadmaps execution to meet goals against area metrics in safety, cost, quality, availability, training, and external commits. Manufacturing Segment Manager Intel Corporation May 2013  –  March 2015  (1 year 11 months) With extensive fab operations experience and an in-depth theoretical knowledge of Factory Physics and Supply Chain Management who applies these skills to factory situations in a real-time, high cadence manner that leads a cross-functional team that is responsible for hitting the quality and cycle time goals for the section of the manufacturing process flow.  \n \nProficient in conducting effective meetings in order to run daily huddles and weekly meetings, effectively partner across the factory with the Process Module Leaders, Area Managers and Line Coordinators to be effective. Provides direction and implement lean manufacturing, Model Based Problem Solving or other continuous improvement solutions to resolve the range of issues that impact factory performance; this will require effective communication and informal leadership abilities. Drives improvements at Non-Value Added (NVA) steps to hit best in class measurement rates. Manages roadmaps execution to meet goals against area metrics in safety, cost, quality, availability, training, and external commits. Engineering Manager Intel Corporation January 2012  –  May 2013  (1 year 5 months) Responsible for the performance, development, and employee relations of engineers and technicians. Also partner with other managers to operate as one team to ensure consistency in results across all of their functional area. A role model for the culture and set the standard for expectations to living the culture.  \n \nImplements the module standard to ensure metrics are achieved, serves as a technical content expert, supports area goals, owns and is accountable for setting directions and people development. Responsible for the roadmap to meet goals against area/shift metrics in safety, cost, quality, availability, training, and employee relations. Engineering Manager Intel Corporation January 2012  –  May 2013  (1 year 5 months) Responsible for the performance, development, and employee relations of engineers and technicians. Also partner with other managers to operate as one team to ensure consistency in results across all of their functional area. A role model for the culture and set the standard for expectations to living the culture.  \n \nImplements the module standard to ensure metrics are achieved, serves as a technical content expert, supports area goals, owns and is accountable for setting directions and people development. Responsible for the roadmap to meet goals against area/shift metrics in safety, cost, quality, availability, training, and employee relations. Senior Process Engineer Intel Corporation February 2006  –  January 2012  (6 years) Specilaized in device processing and fabrication (45nm. 32nm and 22nm technology node), MOS and transistor electrical characterization DOE, Data mining and analysis (JMP/SQL), and Model Based Problem Solving. \n \nCoordinate implementation of processes, assist with supplier development, troubleshoot manufacturing problems, and process scale up. Utilize quality planning methods such as Failure Mode and Effects Analysis (FMEA), detailed flow charts, Statistical Process Control (SPC), and Six Sigma tool to predict problem areas and implement cost-effective solutions that deliver within engineering defined time-line. \n \nSpecialty: Wet Etch, Plasma Etch, Ash Senior Process Engineer Intel Corporation February 2006  –  January 2012  (6 years) Specilaized in device processing and fabrication (45nm. 32nm and 22nm technology node), MOS and transistor electrical characterization DOE, Data mining and analysis (JMP/SQL), and Model Based Problem Solving. \n \nCoordinate implementation of processes, assist with supplier development, troubleshoot manufacturing problems, and process scale up. Utilize quality planning methods such as Failure Mode and Effects Analysis (FMEA), detailed flow charts, Statistical Process Control (SPC), and Six Sigma tool to predict problem areas and implement cost-effective solutions that deliver within engineering defined time-line. \n \nSpecialty: Wet Etch, Plasma Etch, Ash Process Engineer Texas Instruments January 2001  –  February 2006  (5 years 2 months) Process Engineer Texas Instruments January 2001  –  February 2006  (5 years 2 months) Skills Strategic Leadership Six Sigma SPC Hands-on Technical... Operations Management Physics of Manufactuing Lean Manufacturing Project Management People Development People Skills Instructor-led Training Cost Control Quality Control FMEA Design of Experiments Data Analysis Highly motivated... Achieving Measurable... HPM Influence Others Strategic Roadmaps Time Management Cross-functional Team... See 8+     See less Skills  Strategic Leadership Six Sigma SPC Hands-on Technical... Operations Management Physics of Manufactuing Lean Manufacturing Project Management People Development People Skills Instructor-led Training Cost Control Quality Control FMEA Design of Experiments Data Analysis Highly motivated... Achieving Measurable... HPM Influence Others Strategic Roadmaps Time Management Cross-functional Team... See 8+     See less Strategic Leadership Six Sigma SPC Hands-on Technical... Operations Management Physics of Manufactuing Lean Manufacturing Project Management People Development People Skills Instructor-led Training Cost Control Quality Control FMEA Design of Experiments Data Analysis Highly motivated... Achieving Measurable... HPM Influence Others Strategic Roadmaps Time Management Cross-functional Team... See 8+     See less Strategic Leadership Six Sigma SPC Hands-on Technical... Operations Management Physics of Manufactuing Lean Manufacturing Project Management People Development People Skills Instructor-led Training Cost Control Quality Control FMEA Design of Experiments Data Analysis Highly motivated... Achieving Measurable... HPM Influence Others Strategic Roadmaps Time Management Cross-functional Team... See 8+     See less Education Texas A&M University B.S. in Chemistry,  B.S. in Chemical Engineering , Magna Cum Laude Texas A&M University B.S. in Chemistry,  B.S. in Chemical Engineering , Magna Cum Laude Texas A&M University B.S. in Chemistry,  B.S. in Chemical Engineering , Magna Cum Laude Texas A&M University B.S. in Chemistry,  B.S. in Chemical Engineering , Magna Cum Laude ", "Summary User experience is key in the success of a product, technology or service. I have used my scientific and business knowledge to garner myself in the technology and development setting, providing meaningful results for customers within my work group. I have become known as the go-to person for projects that drive efficiency and for daily strategic planning for my team. I have always loved challenges, which is why I am pursuing my Masters of Science in Engineering and Technology Management, focusing on New Product Development.  \n \nIn my time at Intel I have had the pleasure of working with many great engineers to solve complex manufacturing issues related to making microprocessors. I have been recognized with three Divisional awards for my work on process improvement within my area of specialty. Due to my attention to detail and strive for wanting to do the best for my team and internal customers I have been given the opportunity to serve as operations manager while my manager is on vacation, sabbatical, or training. Summary User experience is key in the success of a product, technology or service. I have used my scientific and business knowledge to garner myself in the technology and development setting, providing meaningful results for customers within my work group. I have become known as the go-to person for projects that drive efficiency and for daily strategic planning for my team. I have always loved challenges, which is why I am pursuing my Masters of Science in Engineering and Technology Management, focusing on New Product Development.  \n \nIn my time at Intel I have had the pleasure of working with many great engineers to solve complex manufacturing issues related to making microprocessors. I have been recognized with three Divisional awards for my work on process improvement within my area of specialty. Due to my attention to detail and strive for wanting to do the best for my team and internal customers I have been given the opportunity to serve as operations manager while my manager is on vacation, sabbatical, or training. User experience is key in the success of a product, technology or service. I have used my scientific and business knowledge to garner myself in the technology and development setting, providing meaningful results for customers within my work group. I have become known as the go-to person for projects that drive efficiency and for daily strategic planning for my team. I have always loved challenges, which is why I am pursuing my Masters of Science in Engineering and Technology Management, focusing on New Product Development.  \n \nIn my time at Intel I have had the pleasure of working with many great engineers to solve complex manufacturing issues related to making microprocessors. I have been recognized with three Divisional awards for my work on process improvement within my area of specialty. Due to my attention to detail and strive for wanting to do the best for my team and internal customers I have been given the opportunity to serve as operations manager while my manager is on vacation, sabbatical, or training. User experience is key in the success of a product, technology or service. I have used my scientific and business knowledge to garner myself in the technology and development setting, providing meaningful results for customers within my work group. I have become known as the go-to person for projects that drive efficiency and for daily strategic planning for my team. I have always loved challenges, which is why I am pursuing my Masters of Science in Engineering and Technology Management, focusing on New Product Development.  \n \nIn my time at Intel I have had the pleasure of working with many great engineers to solve complex manufacturing issues related to making microprocessors. I have been recognized with three Divisional awards for my work on process improvement within my area of specialty. Due to my attention to detail and strive for wanting to do the best for my team and internal customers I have been given the opportunity to serve as operations manager while my manager is on vacation, sabbatical, or training. Experience Manufacturing Engineer Intel Corporation October 2014  – Present (11 months) Hillsboro, Oregon Partner with factory Operations Managers, Process Engineers, and managers to develop strategies and tools to manage WIP flow through the factory. Partner closely with factory automation staff to develop robust analysis tools, report capabilities, and innovative user interfaces. Provide analysis of key factory metrics and recommending solutions to factory management. Conduct tactical modeling of WIP movement to predict factory dynamics and to verify new operational techniques. Act as a liaison between manufacturing and other factory groups such as production planning and industrial engineering. Manufacturing Technician Intel Corporation May 2011  –  October 2014  (3 years 6 months) Hillsboro, Oregon Act as back up Operations Manager during manager’s vacation and training. Project Coordinator for large upgrade of automated handling system through team management, acting as a liaison between Intel employees and contractors performing the upgrade. Perform functions associated with all wafer production including operations, equipment, process and training. Collect and evaluate operating data to conduct on-line equipment adjustment and ensure process optimization. Responsible for improvement processes, troubleshooting nonstandard events in the production line, and reviewing technological health and stability. Analytics Specialist Wells Fargo Insurance Services USA, Inc October 2009  –  February 2012  (2 years 5 months) Responsible for providing reporting to the department and clients for use in financial forecasting, cost analysis, calculating reserves, rate setting, and design of benefit plan solutions. \nProvide day-to-day technical and reporting support both internally and externally. \nManage several special risk polices. \nMaintains database information in appropriate formats and ensures database integrity Employee Benefits Account Representative Wells Fargo Insurance Services USA, Inc July 2008  –  October 2009  (1 year 4 months) Assisted in day-to-day handling of client account. \nManaged several special risk polices. \nData entry of client information in to agency management system. \nCollected experience data and create utilization reports for client renewals and forecasting. \nWorked with Employee Benefits consulting practice providing medical stop loss claims adjudication, medical/pharmacy claims reporting, and monthly data feeds to our on staff Clinical Pharmacist Teller US Bank April 2007  –  July 2008  (1 year 4 months) Provide customer service and handle customer deposits and withdraws. Determine the needs of customers to see if they are being offered the right products for their situation and make recommendations for other products as needed. Manufacturing Engineer Intel Corporation October 2014  – Present (11 months) Hillsboro, Oregon Partner with factory Operations Managers, Process Engineers, and managers to develop strategies and tools to manage WIP flow through the factory. Partner closely with factory automation staff to develop robust analysis tools, report capabilities, and innovative user interfaces. Provide analysis of key factory metrics and recommending solutions to factory management. Conduct tactical modeling of WIP movement to predict factory dynamics and to verify new operational techniques. Act as a liaison between manufacturing and other factory groups such as production planning and industrial engineering. Manufacturing Engineer Intel Corporation October 2014  – Present (11 months) Hillsboro, Oregon Partner with factory Operations Managers, Process Engineers, and managers to develop strategies and tools to manage WIP flow through the factory. Partner closely with factory automation staff to develop robust analysis tools, report capabilities, and innovative user interfaces. Provide analysis of key factory metrics and recommending solutions to factory management. Conduct tactical modeling of WIP movement to predict factory dynamics and to verify new operational techniques. Act as a liaison between manufacturing and other factory groups such as production planning and industrial engineering. Manufacturing Technician Intel Corporation May 2011  –  October 2014  (3 years 6 months) Hillsboro, Oregon Act as back up Operations Manager during manager’s vacation and training. Project Coordinator for large upgrade of automated handling system through team management, acting as a liaison between Intel employees and contractors performing the upgrade. Perform functions associated with all wafer production including operations, equipment, process and training. Collect and evaluate operating data to conduct on-line equipment adjustment and ensure process optimization. Responsible for improvement processes, troubleshooting nonstandard events in the production line, and reviewing technological health and stability. Manufacturing Technician Intel Corporation May 2011  –  October 2014  (3 years 6 months) Hillsboro, Oregon Act as back up Operations Manager during manager’s vacation and training. Project Coordinator for large upgrade of automated handling system through team management, acting as a liaison between Intel employees and contractors performing the upgrade. Perform functions associated with all wafer production including operations, equipment, process and training. Collect and evaluate operating data to conduct on-line equipment adjustment and ensure process optimization. Responsible for improvement processes, troubleshooting nonstandard events in the production line, and reviewing technological health and stability. Analytics Specialist Wells Fargo Insurance Services USA, Inc October 2009  –  February 2012  (2 years 5 months) Responsible for providing reporting to the department and clients for use in financial forecasting, cost analysis, calculating reserves, rate setting, and design of benefit plan solutions. \nProvide day-to-day technical and reporting support both internally and externally. \nManage several special risk polices. \nMaintains database information in appropriate formats and ensures database integrity Analytics Specialist Wells Fargo Insurance Services USA, Inc October 2009  –  February 2012  (2 years 5 months) Responsible for providing reporting to the department and clients for use in financial forecasting, cost analysis, calculating reserves, rate setting, and design of benefit plan solutions. \nProvide day-to-day technical and reporting support both internally and externally. \nManage several special risk polices. \nMaintains database information in appropriate formats and ensures database integrity Employee Benefits Account Representative Wells Fargo Insurance Services USA, Inc July 2008  –  October 2009  (1 year 4 months) Assisted in day-to-day handling of client account. \nManaged several special risk polices. \nData entry of client information in to agency management system. \nCollected experience data and create utilization reports for client renewals and forecasting. \nWorked with Employee Benefits consulting practice providing medical stop loss claims adjudication, medical/pharmacy claims reporting, and monthly data feeds to our on staff Clinical Pharmacist Employee Benefits Account Representative Wells Fargo Insurance Services USA, Inc July 2008  –  October 2009  (1 year 4 months) Assisted in day-to-day handling of client account. \nManaged several special risk polices. \nData entry of client information in to agency management system. \nCollected experience data and create utilization reports for client renewals and forecasting. \nWorked with Employee Benefits consulting practice providing medical stop loss claims adjudication, medical/pharmacy claims reporting, and monthly data feeds to our on staff Clinical Pharmacist Teller US Bank April 2007  –  July 2008  (1 year 4 months) Provide customer service and handle customer deposits and withdraws. Determine the needs of customers to see if they are being offered the right products for their situation and make recommendations for other products as needed. Teller US Bank April 2007  –  July 2008  (1 year 4 months) Provide customer service and handle customer deposits and withdraws. Determine the needs of customers to see if they are being offered the right products for their situation and make recommendations for other products as needed. Languages   Skills Management Analysis PowerPoint Strategic Planning Financial Analysis Access Microsoft Excel Microsoft Office Microsoft Word Finance Customer Service Manufacturing... Technology Operations Research Operations Management Project Management Project Planning Technology Roadmapping New Product Development Lean Manufacturing Cost Reporting Pricing Strategy Strategy Hierarchical Decision... Project Coordination Manufacturing Troubleshooting Technology Foresight Technology Forecasting Process Improvement Forecasting Training Data Analysis Cross-functional Team... Business Strategy See 20+     See less Skills  Management Analysis PowerPoint Strategic Planning Financial Analysis Access Microsoft Excel Microsoft Office Microsoft Word Finance Customer Service Manufacturing... Technology Operations Research Operations Management Project Management Project Planning Technology Roadmapping New Product Development Lean Manufacturing Cost Reporting Pricing Strategy Strategy Hierarchical Decision... Project Coordination Manufacturing Troubleshooting Technology Foresight Technology Forecasting Process Improvement Forecasting Training Data Analysis Cross-functional Team... Business Strategy See 20+     See less Management Analysis PowerPoint Strategic Planning Financial Analysis Access Microsoft Excel Microsoft Office Microsoft Word Finance Customer Service Manufacturing... Technology Operations Research Operations Management Project Management Project Planning Technology Roadmapping New Product Development Lean Manufacturing Cost Reporting Pricing Strategy Strategy Hierarchical Decision... Project Coordination Manufacturing Troubleshooting Technology Foresight Technology Forecasting Process Improvement Forecasting Training Data Analysis Cross-functional Team... Business Strategy See 20+     See less Management Analysis PowerPoint Strategic Planning Financial Analysis Access Microsoft Excel Microsoft Office Microsoft Word Finance Customer Service Manufacturing... Technology Operations Research Operations Management Project Management Project Planning Technology Roadmapping New Product Development Lean Manufacturing Cost Reporting Pricing Strategy Strategy Hierarchical Decision... Project Coordination Manufacturing Troubleshooting Technology Foresight Technology Forecasting Process Improvement Forecasting Training Data Analysis Cross-functional Team... Business Strategy See 20+     See less Education Portland State University Masters of Engineering and Technology Management,  New Product Development 2012  – 2014 Activities and Societies:  Omega Rho International Honor Society for Operations Research Portland State University Bachelor of Science,  Finance 2007  – 2009 Undergraduate research paper on Black-Scholes-Merton option pricing with default risk. \nPerformed a Corporate Profile of American Eagle Outfitters (AEO). \nPerformed an in depth valuation of Boston Beer Company (SAM). Activities and Societies:  Phi Gamma Nu - Recruitment Chair Portland State University Bachelor of Science,  Biology 2001  – 2006 Also received minors in Chemistry and Business Administration Americas High School 1998  – 2001 Portland State University Masters of Engineering and Technology Management,  New Product Development 2012  – 2014 Activities and Societies:  Omega Rho International Honor Society for Operations Research Portland State University Masters of Engineering and Technology Management,  New Product Development 2012  – 2014 Activities and Societies:  Omega Rho International Honor Society for Operations Research Portland State University Masters of Engineering and Technology Management,  New Product Development 2012  – 2014 Activities and Societies:  Omega Rho International Honor Society for Operations Research Portland State University Bachelor of Science,  Finance 2007  – 2009 Undergraduate research paper on Black-Scholes-Merton option pricing with default risk. \nPerformed a Corporate Profile of American Eagle Outfitters (AEO). \nPerformed an in depth valuation of Boston Beer Company (SAM). Activities and Societies:  Phi Gamma Nu - Recruitment Chair Portland State University Bachelor of Science,  Finance 2007  – 2009 Undergraduate research paper on Black-Scholes-Merton option pricing with default risk. \nPerformed a Corporate Profile of American Eagle Outfitters (AEO). \nPerformed an in depth valuation of Boston Beer Company (SAM). Activities and Societies:  Phi Gamma Nu - Recruitment Chair Portland State University Bachelor of Science,  Finance 2007  – 2009 Undergraduate research paper on Black-Scholes-Merton option pricing with default risk. \nPerformed a Corporate Profile of American Eagle Outfitters (AEO). \nPerformed an in depth valuation of Boston Beer Company (SAM). Activities and Societies:  Phi Gamma Nu - Recruitment Chair Portland State University Bachelor of Science,  Biology 2001  – 2006 Also received minors in Chemistry and Business Administration Portland State University Bachelor of Science,  Biology 2001  – 2006 Also received minors in Chemistry and Business Administration Portland State University Bachelor of Science,  Biology 2001  – 2006 Also received minors in Chemistry and Business Administration Americas High School 1998  – 2001 Americas High School 1998  – 2001 Americas High School 1998  – 2001 Honors & Awards ", "Experience Manufacturing Engineer Intel Corporation October 2014  – Present (11 months) Chandler, AZ Product Development Engineer Intel Corporation March 2013  –  September 2014  (1 year 7 months) Chandler, AZ Physical Layout Engineer Intel Corporation November 2012  –  February 2013  (4 months) Photolithography Process Engineer Intel January 2005  –  October 2012  (7 years 10 months) Manufacturing Engineer Intel Corporation October 2014  – Present (11 months) Chandler, AZ Manufacturing Engineer Intel Corporation October 2014  – Present (11 months) Chandler, AZ Product Development Engineer Intel Corporation March 2013  –  September 2014  (1 year 7 months) Chandler, AZ Product Development Engineer Intel Corporation March 2013  –  September 2014  (1 year 7 months) Chandler, AZ Physical Layout Engineer Intel Corporation November 2012  –  February 2013  (4 months) Physical Layout Engineer Intel Corporation November 2012  –  February 2013  (4 months) Photolithography Process Engineer Intel January 2005  –  October 2012  (7 years 10 months) Photolithography Process Engineer Intel January 2005  –  October 2012  (7 years 10 months) Skills Lithography Semiconductors JMP SPC Design of Experiments DOE Intel Cycle Time Reduction FMEA Skills  Lithography Semiconductors JMP SPC Design of Experiments DOE Intel Cycle Time Reduction FMEA Lithography Semiconductors JMP SPC Design of Experiments DOE Intel Cycle Time Reduction FMEA Lithography Semiconductors JMP SPC Design of Experiments DOE Intel Cycle Time Reduction FMEA Education Arizona State University masters,  Systems Engineering 2007  – 2010 Arizona State University bachelour,  Electrical Engineering 2001  – 2004 Arizona State University masters,  Systems Engineering 2007  – 2010 Arizona State University masters,  Systems Engineering 2007  – 2010 Arizona State University masters,  Systems Engineering 2007  – 2010 Arizona State University bachelour,  Electrical Engineering 2001  – 2004 Arizona State University bachelour,  Electrical Engineering 2001  – 2004 Arizona State University bachelour,  Electrical Engineering 2001  – 2004 ", "Summary Manufacturing operations and engineering professional. Demonstrated experience in complete implementation of SMT production line, MRP systems, document control systems, ISO/FDA QMS systems. Highly adaptive in utilizing a combination of experience, education and cross functional resources to manage manufacturing in a constant improvement process. Project management experience in connecting sales, engineering, manufacturing, and quality to accomplish the business objectives through unique communication skills. Summary Manufacturing operations and engineering professional. Demonstrated experience in complete implementation of SMT production line, MRP systems, document control systems, ISO/FDA QMS systems. Highly adaptive in utilizing a combination of experience, education and cross functional resources to manage manufacturing in a constant improvement process. Project management experience in connecting sales, engineering, manufacturing, and quality to accomplish the business objectives through unique communication skills. Manufacturing operations and engineering professional. Demonstrated experience in complete implementation of SMT production line, MRP systems, document control systems, ISO/FDA QMS systems. Highly adaptive in utilizing a combination of experience, education and cross functional resources to manage manufacturing in a constant improvement process. Project management experience in connecting sales, engineering, manufacturing, and quality to accomplish the business objectives through unique communication skills. Manufacturing operations and engineering professional. Demonstrated experience in complete implementation of SMT production line, MRP systems, document control systems, ISO/FDA QMS systems. Highly adaptive in utilizing a combination of experience, education and cross functional resources to manage manufacturing in a constant improvement process. Project management experience in connecting sales, engineering, manufacturing, and quality to accomplish the business objectives through unique communication skills. Experience Operations Manager / Manufacturing Engineer Intel Corporation November 2013  – Present (1 year 10 months) Hillsboro, Oregon Manufacturing Manager Frye Electronics December 1999  –  November 2013  (14 years) Tigard, Oregon Operations Manager / Manufacturing Engineer Intel Corporation November 2013  – Present (1 year 10 months) Hillsboro, Oregon Operations Manager / Manufacturing Engineer Intel Corporation November 2013  – Present (1 year 10 months) Hillsboro, Oregon Manufacturing Manager Frye Electronics December 1999  –  November 2013  (14 years) Tigard, Oregon Manufacturing Manager Frye Electronics December 1999  –  November 2013  (14 years) Tigard, Oregon Skills Medical Devices Product Development Electronics Process Improvement Microsoft Office Product Management Inventory Management Strategic Planning Program Management Contract Manufacturing Project Management Manufacturing Operations Business Analysis Supply Chain Management Data Analysis Data Mining Database Administration Crystal Reports Financial Analysis Return on Investment Change Management Quality Management FDA JIT Lean Manufacturing Operations Management CAPA CRM Integration MRP Business Planning Manufacturing ISO 13485 Design for Manufacturing Purchasing Manufacturing... Testing Software Documentation Cross-functional Team... Six Sigma Process Engineering Design Control Continuous Improvement Logistics Quality Assurance Strategic Sourcing Product Launch R&D V&V Management Engineering See 35+     See less Skills  Medical Devices Product Development Electronics Process Improvement Microsoft Office Product Management Inventory Management Strategic Planning Program Management Contract Manufacturing Project Management Manufacturing Operations Business Analysis Supply Chain Management Data Analysis Data Mining Database Administration Crystal Reports Financial Analysis Return on Investment Change Management Quality Management FDA JIT Lean Manufacturing Operations Management CAPA CRM Integration MRP Business Planning Manufacturing ISO 13485 Design for Manufacturing Purchasing Manufacturing... Testing Software Documentation Cross-functional Team... Six Sigma Process Engineering Design Control Continuous Improvement Logistics Quality Assurance Strategic Sourcing Product Launch R&D V&V Management Engineering See 35+     See less Medical Devices Product Development Electronics Process Improvement Microsoft Office Product Management Inventory Management Strategic Planning Program Management Contract Manufacturing Project Management Manufacturing Operations Business Analysis Supply Chain Management Data Analysis Data Mining Database Administration Crystal Reports Financial Analysis Return on Investment Change Management Quality Management FDA JIT Lean Manufacturing Operations Management CAPA CRM Integration MRP Business Planning Manufacturing ISO 13485 Design for Manufacturing Purchasing Manufacturing... Testing Software Documentation Cross-functional Team... Six Sigma Process Engineering Design Control Continuous Improvement Logistics Quality Assurance Strategic Sourcing Product Launch R&D V&V Management Engineering See 35+     See less Medical Devices Product Development Electronics Process Improvement Microsoft Office Product Management Inventory Management Strategic Planning Program Management Contract Manufacturing Project Management Manufacturing Operations Business Analysis Supply Chain Management Data Analysis Data Mining Database Administration Crystal Reports Financial Analysis Return on Investment Change Management Quality Management FDA JIT Lean Manufacturing Operations Management CAPA CRM Integration MRP Business Planning Manufacturing ISO 13485 Design for Manufacturing Purchasing Manufacturing... Testing Software Documentation Cross-functional Team... Six Sigma Process Engineering Design Control Continuous Improvement Logistics Quality Assurance Strategic Sourcing Product Launch R&D V&V Management Engineering See 35+     See less Education Marylhurst University Bachelor of Science,  Business Management Portland State University Electronic Engineering Marylhurst University Bachelor of Science,  Business Management Marylhurst University Bachelor of Science,  Business Management Marylhurst University Bachelor of Science,  Business Management Portland State University Electronic Engineering Portland State University Electronic Engineering Portland State University Electronic Engineering ", "Languages English Native or bilingual proficiency Hebrew Native or bilingual proficiency English Native or bilingual proficiency Hebrew Native or bilingual proficiency English Native or bilingual proficiency Hebrew Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Semiconductors Process Improvement Project Planning Semiconductor Industry Cross-functional Team... Management Product Management Competitive Analysis JMP Product Marketing Six Sigma Finance Budget Information Systems Intel Sales Management Forecasting Budgets FMEA TRIZ Maximo Manufacturing Manufacturing... Lean Manufacturing Corporate Finance Quantitative Research Research Design Team Leadership Global Strategy Strategic Leadership Strategic Data Analysis See 16+     See less Skills  Semiconductors Process Improvement Project Planning Semiconductor Industry Cross-functional Team... Management Product Management Competitive Analysis JMP Product Marketing Six Sigma Finance Budget Information Systems Intel Sales Management Forecasting Budgets FMEA TRIZ Maximo Manufacturing Manufacturing... Lean Manufacturing Corporate Finance Quantitative Research Research Design Team Leadership Global Strategy Strategic Leadership Strategic Data Analysis See 16+     See less Semiconductors Process Improvement Project Planning Semiconductor Industry Cross-functional Team... Management Product Management Competitive Analysis JMP Product Marketing Six Sigma Finance Budget Information Systems Intel Sales Management Forecasting Budgets FMEA TRIZ Maximo Manufacturing Manufacturing... Lean Manufacturing Corporate Finance Quantitative Research Research Design Team Leadership Global Strategy Strategic Leadership Strategic Data Analysis See 16+     See less Semiconductors Process Improvement Project Planning Semiconductor Industry Cross-functional Team... Management Product Management Competitive Analysis JMP Product Marketing Six Sigma Finance Budget Information Systems Intel Sales Management Forecasting Budgets FMEA TRIZ Maximo Manufacturing Manufacturing... Lean Manufacturing Corporate Finance Quantitative Research Research Design Team Leadership Global Strategy Strategic Leadership Strategic Data Analysis See 16+     See less ", "Experience Manufacturing Engineer Intel Corporation September 2011  – Present (4 years) Leixlip, Co.Kildare Project Engineer Headcount Solutions April 2009  –  August 2011  (2 years 5 months) Project Engineer Pfizer (Wyeth) August 2006  –  August 2011  (5 years 1 month) Newbridge, Co.Kildare Project Engineer PM Group August 2006  –  April 2009  (2 years 9 months) Project Engineer Takeda Ireland Limited December 2004  –  August 2006  (1 year 9 months) Bray, Co.Wicklow Production Engineering Technologist Takeda Ireland Limited January 2004  –  November 2004  (11 months) Bray, Co.Wicklow Production Technologist Takeda Ireland Limited November 2002  –  December 2003  (1 year 2 months) Bray, Co.Wicklow Manufacturing Engineer Intel Corporation September 2011  – Present (4 years) Leixlip, Co.Kildare Manufacturing Engineer Intel Corporation September 2011  – Present (4 years) Leixlip, Co.Kildare Project Engineer Headcount Solutions April 2009  –  August 2011  (2 years 5 months) Project Engineer Headcount Solutions April 2009  –  August 2011  (2 years 5 months) Project Engineer Pfizer (Wyeth) August 2006  –  August 2011  (5 years 1 month) Newbridge, Co.Kildare Project Engineer Pfizer (Wyeth) August 2006  –  August 2011  (5 years 1 month) Newbridge, Co.Kildare Project Engineer PM Group August 2006  –  April 2009  (2 years 9 months) Project Engineer PM Group August 2006  –  April 2009  (2 years 9 months) Project Engineer Takeda Ireland Limited December 2004  –  August 2006  (1 year 9 months) Bray, Co.Wicklow Project Engineer Takeda Ireland Limited December 2004  –  August 2006  (1 year 9 months) Bray, Co.Wicklow Production Engineering Technologist Takeda Ireland Limited January 2004  –  November 2004  (11 months) Bray, Co.Wicklow Production Engineering Technologist Takeda Ireland Limited January 2004  –  November 2004  (11 months) Bray, Co.Wicklow Production Technologist Takeda Ireland Limited November 2002  –  December 2003  (1 year 2 months) Bray, Co.Wicklow Production Technologist Takeda Ireland Limited November 2002  –  December 2003  (1 year 2 months) Bray, Co.Wicklow Skills Packaging GMP Manufacturing cGMP Skills  Packaging GMP Manufacturing cGMP Packaging GMP Manufacturing cGMP Packaging GMP Manufacturing cGMP Education Dublin Institute of Technology Manufacturing Engineering 1997  – 2002 Portmarnock Community School 1991  – 1997 Dublin Institute of Technology Manufacturing Engineering 1997  – 2002 Dublin Institute of Technology Manufacturing Engineering 1997  – 2002 Dublin Institute of Technology Manufacturing Engineering 1997  – 2002 Portmarnock Community School 1991  – 1997 Portmarnock Community School 1991  – 1997 Portmarnock Community School 1991  – 1997 ", "Experience Manufacturing Engineer Intel Corporation Manufacturing Engineer Intel Corporation Manufacturing Engineer Intel Corporation Skills Electronics Manufacturing PCB design Product Engineering Debugging Engineering Management Engineering Semiconductors Manufacturing... Cross-functional Team... Root Cause Analysis Semiconductor Industry MRP Hardware Failure Analysis Design for Manufacturing Design of Experiments Intel Systems Engineering Product Development Product Management Process Improvement See 7+     See less Skills  Electronics Manufacturing PCB design Product Engineering Debugging Engineering Management Engineering Semiconductors Manufacturing... Cross-functional Team... Root Cause Analysis Semiconductor Industry MRP Hardware Failure Analysis Design for Manufacturing Design of Experiments Intel Systems Engineering Product Development Product Management Process Improvement See 7+     See less Electronics Manufacturing PCB design Product Engineering Debugging Engineering Management Engineering Semiconductors Manufacturing... Cross-functional Team... Root Cause Analysis Semiconductor Industry MRP Hardware Failure Analysis Design for Manufacturing Design of Experiments Intel Systems Engineering Product Development Product Management Process Improvement See 7+     See less Electronics Manufacturing PCB design Product Engineering Debugging Engineering Management Engineering Semiconductors Manufacturing... Cross-functional Team... Root Cause Analysis Semiconductor Industry MRP Hardware Failure Analysis Design for Manufacturing Design of Experiments Intel Systems Engineering Product Development Product Management Process Improvement See 7+     See less Education Oregon State University 1989  – 1993 Oregon State University 1989  – 1993 Oregon State University 1989  – 1993 Oregon State University 1989  – 1993 ", "Experience Manufacturing Engineer Intel Corporation Manufacturing Engineer Intel Corporation Manufacturing Engineer Intel Corporation ", "Skills SPC Design of Experiments Semiconductors Engineering Management Failure Analysis Root Cause Analysis Cross-functional Team... Debugging Analog Semiconductor Industry Product Engineering ISO Manufacturing... Engineering DMAIC Six Sigma Firmware Lean Manufacturing Electrical Engineering CMOS Systems Engineering Supplier Quality Testing Continuous Improvement Product Lifecycle... R&D JMP PCB design Electronics RF Process Engineering Test Engineering Product Development ASIC Quality System IC Quality Management FMEA Design for Manufacturing Materials Manufacturing Operations Manufacturing Program Management Process Simulation Manufacturing... Automation Supply Chain Management Intel Embedded Systems Hardware Architecture See 35+     See less Skills  SPC Design of Experiments Semiconductors Engineering Management Failure Analysis Root Cause Analysis Cross-functional Team... Debugging Analog Semiconductor Industry Product Engineering ISO Manufacturing... Engineering DMAIC Six Sigma Firmware Lean Manufacturing Electrical Engineering CMOS Systems Engineering Supplier Quality Testing Continuous Improvement Product Lifecycle... R&D JMP PCB design Electronics RF Process Engineering Test Engineering Product Development ASIC Quality System IC Quality Management FMEA Design for Manufacturing Materials Manufacturing Operations Manufacturing Program Management Process Simulation Manufacturing... Automation Supply Chain Management Intel Embedded Systems Hardware Architecture See 35+     See less SPC Design of Experiments Semiconductors Engineering Management Failure Analysis Root Cause Analysis Cross-functional Team... Debugging Analog Semiconductor Industry Product Engineering ISO Manufacturing... Engineering DMAIC Six Sigma Firmware Lean Manufacturing Electrical Engineering CMOS Systems Engineering Supplier Quality Testing Continuous Improvement Product Lifecycle... R&D JMP PCB design Electronics RF Process Engineering Test Engineering Product Development ASIC Quality System IC Quality Management FMEA Design for Manufacturing Materials Manufacturing Operations Manufacturing Program Management Process Simulation Manufacturing... Automation Supply Chain Management Intel Embedded Systems Hardware Architecture See 35+     See less SPC Design of Experiments Semiconductors Engineering Management Failure Analysis Root Cause Analysis Cross-functional Team... Debugging Analog Semiconductor Industry Product Engineering ISO Manufacturing... Engineering DMAIC Six Sigma Firmware Lean Manufacturing Electrical Engineering CMOS Systems Engineering Supplier Quality Testing Continuous Improvement Product Lifecycle... R&D JMP PCB design Electronics RF Process Engineering Test Engineering Product Development ASIC Quality System IC Quality Management FMEA Design for Manufacturing Materials Manufacturing Operations Manufacturing Program Management Process Simulation Manufacturing... Automation Supply Chain Management Intel Embedded Systems Hardware Architecture See 35+     See less ", "Summary Experienced Manufacturing and Test Engineer, specializing in new products and technology development. Summary Experienced Manufacturing and Test Engineer, specializing in new products and technology development. Experienced Manufacturing and Test Engineer, specializing in new products and technology development. Experienced Manufacturing and Test Engineer, specializing in new products and technology development. Experience Systems Manufacturing Engineer Intel Corporation July 2014  – Present (1 year 2 months) Manufacturing Engineer ClearEdge Power October 2013  –  April 2014  (7 months) Hillsboro Returned to previous employer to assist with company short-term goals and transition. Currently providing lean manufacturing assistance and technical support with a start-up metal fabrication supplier. Also performing testing and process work with the company fuel processor. Manufacturing Engineer Intel Corporation April 2012  –  October 2013  (1 year 7 months) Jones Farm Worked a small group responsible for the building, testing, and reworks of Linux-based media systems. Wrote and updated scripts, setup and maintained cloud servers, Group was involved from prototype stages up to hand-off for full-scale production. Routinely assisted Hardware/Validation and Software Engineering groups with testing and firmware verification. Manufacturing & Test Engineer ClearEdge Power November 2007  –  March 2012  (4 years 5 months) Responsible for all manufacturing aspects of a new, proprietary steam reformer from its implementation. Regular duties include continual line leveling, tooling improvement, software and data tracking implementation and improvements, quantifiable in-line testing, performing failure analysis and post mortems on returned systems. Designed manufacturing layout, workstations, and fixtures, selected all tooling, and wrote all manufacturing work instructions. Developed multiple in-line testing systems for data collection and analysis. Worked very closely with R&D, setting up tests for data collection, on failure analysis, writing post mortems. Manufacturing Technician Intel Corporation 1998  –  2007  (9 years) Systems Manufacturing Engineer Intel Corporation July 2014  – Present (1 year 2 months) Systems Manufacturing Engineer Intel Corporation July 2014  – Present (1 year 2 months) Manufacturing Engineer ClearEdge Power October 2013  –  April 2014  (7 months) Hillsboro Returned to previous employer to assist with company short-term goals and transition. Currently providing lean manufacturing assistance and technical support with a start-up metal fabrication supplier. Also performing testing and process work with the company fuel processor. Manufacturing Engineer ClearEdge Power October 2013  –  April 2014  (7 months) Hillsboro Returned to previous employer to assist with company short-term goals and transition. Currently providing lean manufacturing assistance and technical support with a start-up metal fabrication supplier. Also performing testing and process work with the company fuel processor. Manufacturing Engineer Intel Corporation April 2012  –  October 2013  (1 year 7 months) Jones Farm Worked a small group responsible for the building, testing, and reworks of Linux-based media systems. Wrote and updated scripts, setup and maintained cloud servers, Group was involved from prototype stages up to hand-off for full-scale production. Routinely assisted Hardware/Validation and Software Engineering groups with testing and firmware verification. Manufacturing Engineer Intel Corporation April 2012  –  October 2013  (1 year 7 months) Jones Farm Worked a small group responsible for the building, testing, and reworks of Linux-based media systems. Wrote and updated scripts, setup and maintained cloud servers, Group was involved from prototype stages up to hand-off for full-scale production. Routinely assisted Hardware/Validation and Software Engineering groups with testing and firmware verification. Manufacturing & Test Engineer ClearEdge Power November 2007  –  March 2012  (4 years 5 months) Responsible for all manufacturing aspects of a new, proprietary steam reformer from its implementation. Regular duties include continual line leveling, tooling improvement, software and data tracking implementation and improvements, quantifiable in-line testing, performing failure analysis and post mortems on returned systems. Designed manufacturing layout, workstations, and fixtures, selected all tooling, and wrote all manufacturing work instructions. Developed multiple in-line testing systems for data collection and analysis. Worked very closely with R&D, setting up tests for data collection, on failure analysis, writing post mortems. Manufacturing & Test Engineer ClearEdge Power November 2007  –  March 2012  (4 years 5 months) Responsible for all manufacturing aspects of a new, proprietary steam reformer from its implementation. Regular duties include continual line leveling, tooling improvement, software and data tracking implementation and improvements, quantifiable in-line testing, performing failure analysis and post mortems on returned systems. Designed manufacturing layout, workstations, and fixtures, selected all tooling, and wrote all manufacturing work instructions. Developed multiple in-line testing systems for data collection and analysis. Worked very closely with R&D, setting up tests for data collection, on failure analysis, writing post mortems. Manufacturing Technician Intel Corporation 1998  –  2007  (9 years) Manufacturing Technician Intel Corporation 1998  –  2007  (9 years) Skills Manufacturing Design of Experiments Electronics Failure Analysis Simulations Engineering Management Engineering Root Cause Analysis Process Engineering Lean Manufacturing FMEA Six Sigma Manufacturing... Shell Scripting Cloud Computing Databases Troubleshooting Analytic Problem Solving Root Cause Problem... Test Automation See 5+     See less Skills  Manufacturing Design of Experiments Electronics Failure Analysis Simulations Engineering Management Engineering Root Cause Analysis Process Engineering Lean Manufacturing FMEA Six Sigma Manufacturing... Shell Scripting Cloud Computing Databases Troubleshooting Analytic Problem Solving Root Cause Problem... Test Automation See 5+     See less Manufacturing Design of Experiments Electronics Failure Analysis Simulations Engineering Management Engineering Root Cause Analysis Process Engineering Lean Manufacturing FMEA Six Sigma Manufacturing... Shell Scripting Cloud Computing Databases Troubleshooting Analytic Problem Solving Root Cause Problem... Test Automation See 5+     See less Manufacturing Design of Experiments Electronics Failure Analysis Simulations Engineering Management Engineering Root Cause Analysis Process Engineering Lean Manufacturing FMEA Six Sigma Manufacturing... Shell Scripting Cloud Computing Databases Troubleshooting Analytic Problem Solving Root Cause Problem... Test Automation See 5+     See less Education Portland State University Bachelor of Science (BS),  Physics 2001  – 2006 Umpqua Community College Associate of Science (A.S.),  Digital Systems 1996  – 1998 Portland State University Bachelor of Science (BS),  Physics 2001  – 2006 Portland State University Bachelor of Science (BS),  Physics 2001  – 2006 Portland State University Bachelor of Science (BS),  Physics 2001  – 2006 Umpqua Community College Associate of Science (A.S.),  Digital Systems 1996  – 1998 Umpqua Community College Associate of Science (A.S.),  Digital Systems 1996  – 1998 Umpqua Community College Associate of Science (A.S.),  Digital Systems 1996  – 1998 ", "Languages Spanish Spanish Spanish Skills Semiconductors Design for Manufacturing Failure Analysis Manufacturing... Engineering Cross-functional Team... Product Engineering Design of Experiments SPC Engineering Management Debugging Hardware Architecture Product Development Manufacturing Electronics FMEA Root Cause Analysis Systems Engineering Testing Semiconductor Industry PCB design Analog See 7+     See less Skills  Semiconductors Design for Manufacturing Failure Analysis Manufacturing... Engineering Cross-functional Team... Product Engineering Design of Experiments SPC Engineering Management Debugging Hardware Architecture Product Development Manufacturing Electronics FMEA Root Cause Analysis Systems Engineering Testing Semiconductor Industry PCB design Analog See 7+     See less Semiconductors Design for Manufacturing Failure Analysis Manufacturing... Engineering Cross-functional Team... Product Engineering Design of Experiments SPC Engineering Management Debugging Hardware Architecture Product Development Manufacturing Electronics FMEA Root Cause Analysis Systems Engineering Testing Semiconductor Industry PCB design Analog See 7+     See less Semiconductors Design for Manufacturing Failure Analysis Manufacturing... Engineering Cross-functional Team... Product Engineering Design of Experiments SPC Engineering Management Debugging Hardware Architecture Product Development Manufacturing Electronics FMEA Root Cause Analysis Systems Engineering Testing Semiconductor Industry PCB design Analog See 7+     See less ", "Skills Cross-functional Team... Product Development Strategy Strategic Planning Lean Manufacturing Manufacturing... Management Change Management Six Sigma Supply Chain Management Testing Program Management Manufacturing Analysis Leadership Product Marketing Project Management Semiconductors Supply Management Engineering Purchasing Design for Manufacturing Outsourcing Product Management Process Engineering Continuous Improvement Budgets Engineering Management Process Improvement SPC Data Analysis Design of Experiments Process Simulation MS Project Project Planning Electronics Integration Quality Assurance Root Cause Analysis FMEA Systems Engineering Automation See 27+     See less Skills  Cross-functional Team... Product Development Strategy Strategic Planning Lean Manufacturing Manufacturing... Management Change Management Six Sigma Supply Chain Management Testing Program Management Manufacturing Analysis Leadership Product Marketing Project Management Semiconductors Supply Management Engineering Purchasing Design for Manufacturing Outsourcing Product Management Process Engineering Continuous Improvement Budgets Engineering Management Process Improvement SPC Data Analysis Design of Experiments Process Simulation MS Project Project Planning Electronics Integration Quality Assurance Root Cause Analysis FMEA Systems Engineering Automation See 27+     See less Cross-functional Team... Product Development Strategy Strategic Planning Lean Manufacturing Manufacturing... Management Change Management Six Sigma Supply Chain Management Testing Program Management Manufacturing Analysis Leadership Product Marketing Project Management Semiconductors Supply Management Engineering Purchasing Design for Manufacturing Outsourcing Product Management Process Engineering Continuous Improvement Budgets Engineering Management Process Improvement SPC Data Analysis Design of Experiments Process Simulation MS Project Project Planning Electronics Integration Quality Assurance Root Cause Analysis FMEA Systems Engineering Automation See 27+     See less Cross-functional Team... Product Development Strategy Strategic Planning Lean Manufacturing Manufacturing... Management Change Management Six Sigma Supply Chain Management Testing Program Management Manufacturing Analysis Leadership Product Marketing Project Management Semiconductors Supply Management Engineering Purchasing Design for Manufacturing Outsourcing Product Management Process Engineering Continuous Improvement Budgets Engineering Management Process Improvement SPC Data Analysis Design of Experiments Process Simulation MS Project Project Planning Electronics Integration Quality Assurance Root Cause Analysis FMEA Systems Engineering Automation See 27+     See less ", "Experience Diversity Manager Intel Corporation April 2015  – Present (5 months) Hillsboro, OR Cloud IP Development Manager Intel Corporation October 2014  –  April 2015  (7 months) Hillsboro, OR Engineering Operations Manager Intel Corporation October 2013  –  October 2014  (1 year 1 month) Hillsboro, OR NPI Planning Manager Intel Corporation October 2012  –  October 2013  (1 year 1 month) Hillsboro, OR Manufacturing Manager Care Innovations™, an Intel-GE Company January 2011  –  October 2012  (1 year 10 months) Beaverton, OR Solutions Program Manager & Manufacturing Engineer Intel Corporation November 2000  –  January 2011  (10 years 3 months) DHeG Program Manager Intel Corporation 2008  –  2011  (3 years) Desktop Boards Organization Manufacturing Engineer Intel Corporation July 2006  –  January 2007  (7 months) Process Engineer Intel Corporation July 2003  –  July 2006  (3 years 1 month) Hillsboro, OR F11 Product Engineer- New Product Introduction Project Manager Intel Corporation September 2001  –  January 2002  (5 months) Rio Rancho, NM Corporate Quality Network - Failure Analysis Forum Project Manager Intel Corporation April 2001  –  September 2001  (6 months) Rio Rancho, NM Lithography Functional Area Manufacturing Engineer Intel Corporation November 2000  –  March 2001  (5 months) Rio Rancho, NM Mfg Intern National Instruments 1997  –  1997  (less than a year) Diversity Manager Intel Corporation April 2015  – Present (5 months) Hillsboro, OR Diversity Manager Intel Corporation April 2015  – Present (5 months) Hillsboro, OR Cloud IP Development Manager Intel Corporation October 2014  –  April 2015  (7 months) Hillsboro, OR Cloud IP Development Manager Intel Corporation October 2014  –  April 2015  (7 months) Hillsboro, OR Engineering Operations Manager Intel Corporation October 2013  –  October 2014  (1 year 1 month) Hillsboro, OR Engineering Operations Manager Intel Corporation October 2013  –  October 2014  (1 year 1 month) Hillsboro, OR NPI Planning Manager Intel Corporation October 2012  –  October 2013  (1 year 1 month) Hillsboro, OR NPI Planning Manager Intel Corporation October 2012  –  October 2013  (1 year 1 month) Hillsboro, OR Manufacturing Manager Care Innovations™, an Intel-GE Company January 2011  –  October 2012  (1 year 10 months) Beaverton, OR Manufacturing Manager Care Innovations™, an Intel-GE Company January 2011  –  October 2012  (1 year 10 months) Beaverton, OR Solutions Program Manager & Manufacturing Engineer Intel Corporation November 2000  –  January 2011  (10 years 3 months) Solutions Program Manager & Manufacturing Engineer Intel Corporation November 2000  –  January 2011  (10 years 3 months) DHeG Program Manager Intel Corporation 2008  –  2011  (3 years) DHeG Program Manager Intel Corporation 2008  –  2011  (3 years) Desktop Boards Organization Manufacturing Engineer Intel Corporation July 2006  –  January 2007  (7 months) Desktop Boards Organization Manufacturing Engineer Intel Corporation July 2006  –  January 2007  (7 months) Process Engineer Intel Corporation July 2003  –  July 2006  (3 years 1 month) Hillsboro, OR Process Engineer Intel Corporation July 2003  –  July 2006  (3 years 1 month) Hillsboro, OR F11 Product Engineer- New Product Introduction Project Manager Intel Corporation September 2001  –  January 2002  (5 months) Rio Rancho, NM F11 Product Engineer- New Product Introduction Project Manager Intel Corporation September 2001  –  January 2002  (5 months) Rio Rancho, NM Corporate Quality Network - Failure Analysis Forum Project Manager Intel Corporation April 2001  –  September 2001  (6 months) Rio Rancho, NM Corporate Quality Network - Failure Analysis Forum Project Manager Intel Corporation April 2001  –  September 2001  (6 months) Rio Rancho, NM Lithography Functional Area Manufacturing Engineer Intel Corporation November 2000  –  March 2001  (5 months) Rio Rancho, NM Lithography Functional Area Manufacturing Engineer Intel Corporation November 2000  –  March 2001  (5 months) Rio Rancho, NM Mfg Intern National Instruments 1997  –  1997  (less than a year) Mfg Intern National Instruments 1997  –  1997  (less than a year) Skills Design of Experiments Semiconductors SPC JMP Cross-functional Team... Engineering Management Metrology Product Development Failure Analysis Six Sigma Program Management Product Engineering Design for Manufacturing Manufacturing Yield Product Management Manufacturing... Semiconductor Industry Lean Manufacturing Thin Films Embedded Systems Manufacturing Operations See 7+     See less Skills  Design of Experiments Semiconductors SPC JMP Cross-functional Team... Engineering Management Metrology Product Development Failure Analysis Six Sigma Program Management Product Engineering Design for Manufacturing Manufacturing Yield Product Management Manufacturing... Semiconductor Industry Lean Manufacturing Thin Films Embedded Systems Manufacturing Operations See 7+     See less Design of Experiments Semiconductors SPC JMP Cross-functional Team... Engineering Management Metrology Product Development Failure Analysis Six Sigma Program Management Product Engineering Design for Manufacturing Manufacturing Yield Product Management Manufacturing... Semiconductor Industry Lean Manufacturing Thin Films Embedded Systems Manufacturing Operations See 7+     See less Design of Experiments Semiconductors SPC JMP Cross-functional Team... Engineering Management Metrology Product Development Failure Analysis Six Sigma Program Management Product Engineering Design for Manufacturing Manufacturing Yield Product Management Manufacturing... Semiconductor Industry Lean Manufacturing Thin Films Embedded Systems Manufacturing Operations See 7+     See less Honors & Awards ", "Experience Manufacturing Engineer Intel Corporation July 2012  – Present (3 years 2 months) Israel Configuration Manager Elbit Systems Ltd June 2010  –  July 2012  (2 years 2 months) Israel Manufacturing Engineer Intel Corporation July 2012  – Present (3 years 2 months) Israel Manufacturing Engineer Intel Corporation July 2012  – Present (3 years 2 months) Israel Configuration Manager Elbit Systems Ltd June 2010  –  July 2012  (2 years 2 months) Israel Configuration Manager Elbit Systems Ltd June 2010  –  July 2012  (2 years 2 months) Israel Languages Russian Ukrainian Hebrew English Russian Ukrainian Hebrew English Russian Ukrainian Hebrew English Education Technion - Israel Institute of Technology Bachelor's degree,  Industrial Engineering Technion - Israel Institute of Technology Bachelor's degree,  Industrial Engineering Technion - Israel Institute of Technology Bachelor's degree,  Industrial Engineering Technion - Israel Institute of Technology Bachelor's degree,  Industrial Engineering ", "Experience Manufacturing Engineer Intel Corporation Manufacturing Engineer Intel Corporation Manufacturing Engineer Intel Corporation ", "Experience Manufacturing Engineer Intel Corporation February 2014  – Present (1 year 7 months) Portland, Oregon Area Process Engineering Specialist BlackBerry April 2004  –  January 2014  (9 years 10 months) Electrical Engineer Dewan Salman Fiber December 1996  –  September 2003  (6 years 10 months) Hattar Manufacturing Engineer Intel Corporation February 2014  – Present (1 year 7 months) Portland, Oregon Area Manufacturing Engineer Intel Corporation February 2014  – Present (1 year 7 months) Portland, Oregon Area Process Engineering Specialist BlackBerry April 2004  –  January 2014  (9 years 10 months) Process Engineering Specialist BlackBerry April 2004  –  January 2014  (9 years 10 months) Electrical Engineer Dewan Salman Fiber December 1996  –  September 2003  (6 years 10 months) Hattar Electrical Engineer Dewan Salman Fiber December 1996  –  September 2003  (6 years 10 months) Hattar Skills Process Engineering SMT SPC Manufacturing Manufacturing... Design for Manufacturing Root Cause Analysis Lean Manufacturing Six Sigma Electronics... Electronics Engineering Management PCB design Kaizen FMEA Design of Experiments Project Management Processes Development Gerbtool New Product... Quality Management DMAIC Gauge R&R CAD Minitab Allegro PCB Editor Allegro Package Designer PCB Design See 13+     See less Skills  Process Engineering SMT SPC Manufacturing Manufacturing... Design for Manufacturing Root Cause Analysis Lean Manufacturing Six Sigma Electronics... Electronics Engineering Management PCB design Kaizen FMEA Design of Experiments Project Management Processes Development Gerbtool New Product... Quality Management DMAIC Gauge R&R CAD Minitab Allegro PCB Editor Allegro Package Designer PCB Design See 13+     See less Process Engineering SMT SPC Manufacturing Manufacturing... Design for Manufacturing Root Cause Analysis Lean Manufacturing Six Sigma Electronics... Electronics Engineering Management PCB design Kaizen FMEA Design of Experiments Project Management Processes Development Gerbtool New Product... Quality Management DMAIC Gauge R&R CAD Minitab Allegro PCB Editor Allegro Package Designer PCB Design See 13+     See less Process Engineering SMT SPC Manufacturing Manufacturing... Design for Manufacturing Root Cause Analysis Lean Manufacturing Six Sigma Electronics... Electronics Engineering Management PCB design Kaizen FMEA Design of Experiments Project Management Processes Development Gerbtool New Product... Quality Management DMAIC Gauge R&R CAD Minitab Allegro PCB Editor Allegro Package Designer PCB Design See 13+     See less Education The University of Western Ontario Master of Engineering (M.Eng.),  Electrical and Computer Engineering 2010  – 2013 North West Frontier Province University of Engineering and Technology Bachelor of Engineering (B.E.),  Electrical Engineering 1991  – 1996 The University of Western Ontario Master of Engineering (M.Eng.),  Electrical and Computer Engineering 2010  – 2013 The University of Western Ontario Master of Engineering (M.Eng.),  Electrical and Computer Engineering 2010  – 2013 The University of Western Ontario Master of Engineering (M.Eng.),  Electrical and Computer Engineering 2010  – 2013 North West Frontier Province University of Engineering and Technology Bachelor of Engineering (B.E.),  Electrical Engineering 1991  – 1996 North West Frontier Province University of Engineering and Technology Bachelor of Engineering (B.E.),  Electrical Engineering 1991  – 1996 North West Frontier Province University of Engineering and Technology Bachelor of Engineering (B.E.),  Electrical Engineering 1991  – 1996 "]}