{"position": "Marketing Program Manager", "company": "Intel Corporation", "profiles": ["Skills Employer Branding Social Media Marketing Marketing Communications Web Content Management Recruitment Advertising Recruiting Project Management Program Management Talent Acquisition Training Marketing Start-ups Sourcing Digital Strategy E-commerce Strategy SEM Online Advertising Marketing Strategy Management Market Research Internal Communications Strategic Communications Social Media College Recruiting Video Production Video Editing See 12+     See less Skills  Employer Branding Social Media Marketing Marketing Communications Web Content Management Recruitment Advertising Recruiting Project Management Program Management Talent Acquisition Training Marketing Start-ups Sourcing Digital Strategy E-commerce Strategy SEM Online Advertising Marketing Strategy Management Market Research Internal Communications Strategic Communications Social Media College Recruiting Video Production Video Editing See 12+     See less Employer Branding Social Media Marketing Marketing Communications Web Content Management Recruitment Advertising Recruiting Project Management Program Management Talent Acquisition Training Marketing Start-ups Sourcing Digital Strategy E-commerce Strategy SEM Online Advertising Marketing Strategy Management Market Research Internal Communications Strategic Communications Social Media College Recruiting Video Production Video Editing See 12+     See less Employer Branding Social Media Marketing Marketing Communications Web Content Management Recruitment Advertising Recruiting Project Management Program Management Talent Acquisition Training Marketing Start-ups Sourcing Digital Strategy E-commerce Strategy SEM Online Advertising Marketing Strategy Management Market Research Internal Communications Strategic Communications Social Media College Recruiting Video Production Video Editing See 12+     See less Honors & Awards Intel Division Recognition Award Intel Human Resources January 2015 For contributions in transformation of Global Talent Acquisition to reduce waste and add capacity in our organization  Additional Honors & Awards Intel Division Recognition Award, 2010, for driving fresh thinking and content to reestablish Intel's postion on the Fortune 100 Best Companies List.  \n \nIntel Division Recognition Award, 2009, for contributions to a company-wide study to assess and improve Intel's image with external candidates.  \n \nIntel Division Recognition Award, 2006, for developing and delivering a marketing plan to attract college students to Intel in the US. Intel Division Recognition Award Intel Human Resources January 2015 For contributions in transformation of Global Talent Acquisition to reduce waste and add capacity in our organization  Intel Division Recognition Award Intel Human Resources January 2015 For contributions in transformation of Global Talent Acquisition to reduce waste and add capacity in our organization  Intel Division Recognition Award Intel Human Resources January 2015 For contributions in transformation of Global Talent Acquisition to reduce waste and add capacity in our organization  Additional Honors & Awards Intel Division Recognition Award, 2010, for driving fresh thinking and content to reestablish Intel's postion on the Fortune 100 Best Companies List.  \n \nIntel Division Recognition Award, 2009, for contributions to a company-wide study to assess and improve Intel's image with external candidates.  \n \nIntel Division Recognition Award, 2006, for developing and delivering a marketing plan to attract college students to Intel in the US. Additional Honors & Awards Intel Division Recognition Award, 2010, for driving fresh thinking and content to reestablish Intel's postion on the Fortune 100 Best Companies List.  \n \nIntel Division Recognition Award, 2009, for contributions to a company-wide study to assess and improve Intel's image with external candidates.  \n \nIntel Division Recognition Award, 2006, for developing and delivering a marketing plan to attract college students to Intel in the US. Additional Honors & Awards Intel Division Recognition Award, 2010, for driving fresh thinking and content to reestablish Intel's postion on the Fortune 100 Best Companies List.  \n \nIntel Division Recognition Award, 2009, for contributions to a company-wide study to assess and improve Intel's image with external candidates.  \n \nIntel Division Recognition Award, 2006, for developing and delivering a marketing plan to attract college students to Intel in the US. ", "Languages English Full professional proficiency English Full professional proficiency English Full professional proficiency Full professional proficiency Skills Product Marketing Account Management Business Planning Business Development Marketing Communications Channel Sales Business Strategy Channel Partners Marketing Technical Product Sales Product Specialists Management Sales Operations Key Account Management Pre-sales Strategy Data Center New Business Development Wireless IP Cisco Technologies Unified Communications Selling Sales Management Negotiation Sales Solution Selling Go-to-market Strategy Networking Direct Sales SaaS Cloud Computing Project Management See 18+     See less Skills  Product Marketing Account Management Business Planning Business Development Marketing Communications Channel Sales Business Strategy Channel Partners Marketing Technical Product Sales Product Specialists Management Sales Operations Key Account Management Pre-sales Strategy Data Center New Business Development Wireless IP Cisco Technologies Unified Communications Selling Sales Management Negotiation Sales Solution Selling Go-to-market Strategy Networking Direct Sales SaaS Cloud Computing Project Management See 18+     See less Product Marketing Account Management Business Planning Business Development Marketing Communications Channel Sales Business Strategy Channel Partners Marketing Technical Product Sales Product Specialists Management Sales Operations Key Account Management Pre-sales Strategy Data Center New Business Development Wireless IP Cisco Technologies Unified Communications Selling Sales Management Negotiation Sales Solution Selling Go-to-market Strategy Networking Direct Sales SaaS Cloud Computing Project Management See 18+     See less Product Marketing Account Management Business Planning Business Development Marketing Communications Channel Sales Business Strategy Channel Partners Marketing Technical Product Sales Product Specialists Management Sales Operations Key Account Management Pre-sales Strategy Data Center New Business Development Wireless IP Cisco Technologies Unified Communications Selling Sales Management Negotiation Sales Solution Selling Go-to-market Strategy Networking Direct Sales SaaS Cloud Computing Project Management See 18+     See less ", "Summary Ambitious and accomplished executive with 17-year record of success in high-tech consumer and business-to-business product development. Offer extensive international product management and marketing experience with responsibility for product lines delivering over $400M in revenue and 170M monthly active users. Intuitive leader with acute business acumen and expertise in channel development and market penetration. Offer adept development and control of international teams and multimillion-dollar budgets while promoting disciplined, research-based, consumer-focused product development process and methodology. \n \nCore Strengths: \nProduct Management ~ Product Marketing ~ Long Term Strategic Planning ~ Research, Forecasting & Analysis ~ Market Segmentation Strategies ~ Innovation Management ~ Marketing Communications ~ Product Development & Launch ~ Complex Portfolio Management ~ Matrixed Offshore Team Management ~ Budget / Resource Control ~ Global Pricing Strategy ~ Media / Industry Relations ~ Training & Staff Development Summary Ambitious and accomplished executive with 17-year record of success in high-tech consumer and business-to-business product development. Offer extensive international product management and marketing experience with responsibility for product lines delivering over $400M in revenue and 170M monthly active users. Intuitive leader with acute business acumen and expertise in channel development and market penetration. Offer adept development and control of international teams and multimillion-dollar budgets while promoting disciplined, research-based, consumer-focused product development process and methodology. \n \nCore Strengths: \nProduct Management ~ Product Marketing ~ Long Term Strategic Planning ~ Research, Forecasting & Analysis ~ Market Segmentation Strategies ~ Innovation Management ~ Marketing Communications ~ Product Development & Launch ~ Complex Portfolio Management ~ Matrixed Offshore Team Management ~ Budget / Resource Control ~ Global Pricing Strategy ~ Media / Industry Relations ~ Training & Staff Development Ambitious and accomplished executive with 17-year record of success in high-tech consumer and business-to-business product development. Offer extensive international product management and marketing experience with responsibility for product lines delivering over $400M in revenue and 170M monthly active users. Intuitive leader with acute business acumen and expertise in channel development and market penetration. Offer adept development and control of international teams and multimillion-dollar budgets while promoting disciplined, research-based, consumer-focused product development process and methodology. \n \nCore Strengths: \nProduct Management ~ Product Marketing ~ Long Term Strategic Planning ~ Research, Forecasting & Analysis ~ Market Segmentation Strategies ~ Innovation Management ~ Marketing Communications ~ Product Development & Launch ~ Complex Portfolio Management ~ Matrixed Offshore Team Management ~ Budget / Resource Control ~ Global Pricing Strategy ~ Media / Industry Relations ~ Training & Staff Development Ambitious and accomplished executive with 17-year record of success in high-tech consumer and business-to-business product development. Offer extensive international product management and marketing experience with responsibility for product lines delivering over $400M in revenue and 170M monthly active users. Intuitive leader with acute business acumen and expertise in channel development and market penetration. Offer adept development and control of international teams and multimillion-dollar budgets while promoting disciplined, research-based, consumer-focused product development process and methodology. \n \nCore Strengths: \nProduct Management ~ Product Marketing ~ Long Term Strategic Planning ~ Research, Forecasting & Analysis ~ Market Segmentation Strategies ~ Innovation Management ~ Marketing Communications ~ Product Development & Launch ~ Complex Portfolio Management ~ Matrixed Offshore Team Management ~ Budget / Resource Control ~ Global Pricing Strategy ~ Media / Industry Relations ~ Training & Staff Development Experience Principal Product Manager Amazon Lab126 2014  – Present (1 year) San Francisco Bay Area Leading hardware and platform product management for the company's Fire tablet portfolio. \n \nDeveloping the next-generation product line from concept to business requirements documentation. Spearheading go-to-market planning for current generation of products by developing strategic positioning and acting as product spokesperson to key stakeholders. \n \nSelected Contributions: \n- Presented innovative, new product concept to the CEO within the first three months of employment. \n- Developed detailed business and product requirements for next-generation products, including a deep investigation on a new technology integration. \n- Created comprehensive go-to-market plan for internal marketing stakeholders and executive spokespeople for upcoming product launch. Director of Product Marketing BitTorrent, Inc. 2012  –  2014  (2 years) San Francisco Bay Area Built the company's first product marketing team, focusing on customer acquisition, user engagement, and go-to-market planning and execution. \n \nDesigned marketing strategies for entering new markets with new customer behaviors to diversify the company's revenue stream. Developed a forecasting methodology to evaluate the current business and identify new opportunities. \n \nSelected Contributions: \n- Launched BitTorrent Sync, a disruptive peer-to-peer file syncing product, on desktop and mobile platforms. \n- Developed and launched the company’s first marketing campaign for mobile devices, growing installations to over 12M in less than six months. \n- Developed a methodology for tracking user engagement from the moment of acquisition through to end-of-life to better understand customer lifetime value (LTV) and product virality. Director of Product Management Logitech, Inc. 2005  –  2012  (7 years) Newark, California and Vancouver, Washington Managed worldwide P&Ls of up to $418M for audio, digital home, and video business units spanning PC speaker, iPod speaker, headphone, set-top-box, and webcam product lines. \n \nBuilt revenue through skillful leadership and supportive direction of product management and marketing professionals. Maintained overhead through careful planning and control of operating expense (OpEx) budgets of up to $4M. \n \nSelected Contributions: \n- Developed five-year long-term strategic plans for each business unit, driving profitable growth through expansion of existing categories and evaluation of new markets. \n- Created two-year and three-year technology, platform, and product roadmaps, and deployed new portfolio management methodology that made process scalable, repeatable, and innovation-driven. \n- Matrix-managed international product development teams, adeptly coordinating efforts of engineering, operations, marketing communications, program management, customer support, and sales groups. Senior Product Marketing Manager Oregon Scientific, Inc. 2003  –  2005  (2 years) Tualatin, Oregon Crafted U.S. business plans generating $27M in revenue for high-tech consumer electronics categories. \n \nPrepared roadmaps for multiple product lines including digital cameras, MP3 players, digital voice recorders, home audio / video products, telephones, and two-way radios. Coordinated product development proposals, and oversaw product planning, forecasting, analysis, research, and promotion. Senior Product Manager SONICblue Incorporated, Rio Division 2001  –  2002  (1 year) Tigard, Oregon Implemented global business plans for $13M product line, strengthening market position for current and next-generation Rio MP3 player lines, including flash memory, hard disk drive, and networked audio products. \n \nMatrix-managed international teams, providing direction and oversight of all product development and marketing efforts. Led planning, analysis, development, and execution projects, working effectively between departments to align all roadmap deliverables toward successful, on-time launch and ongoing revenue generation.  Technical Product Manager and Marketing Program Manager Intel Corporation 1997  –  2001  (4 years) Hillsboro, Oregon Directed business-to-business (B2B) marketing plans for streaming media hosting service and business video conferencing product line. \n \nPlanned and implemented wide range of end-customer and channel marketing communications including websites, video presentations, printed collateral, trade shows, advertising, and press relations. Managed matrix teams within other Intel groups during product launches, coordinating personnel from sales and marketing, legal, press relations, and field sales. Principal Product Manager Amazon Lab126 2014  – Present (1 year) San Francisco Bay Area Leading hardware and platform product management for the company's Fire tablet portfolio. \n \nDeveloping the next-generation product line from concept to business requirements documentation. Spearheading go-to-market planning for current generation of products by developing strategic positioning and acting as product spokesperson to key stakeholders. \n \nSelected Contributions: \n- Presented innovative, new product concept to the CEO within the first three months of employment. \n- Developed detailed business and product requirements for next-generation products, including a deep investigation on a new technology integration. \n- Created comprehensive go-to-market plan for internal marketing stakeholders and executive spokespeople for upcoming product launch. Principal Product Manager Amazon Lab126 2014  – Present (1 year) San Francisco Bay Area Leading hardware and platform product management for the company's Fire tablet portfolio. \n \nDeveloping the next-generation product line from concept to business requirements documentation. Spearheading go-to-market planning for current generation of products by developing strategic positioning and acting as product spokesperson to key stakeholders. \n \nSelected Contributions: \n- Presented innovative, new product concept to the CEO within the first three months of employment. \n- Developed detailed business and product requirements for next-generation products, including a deep investigation on a new technology integration. \n- Created comprehensive go-to-market plan for internal marketing stakeholders and executive spokespeople for upcoming product launch. Director of Product Marketing BitTorrent, Inc. 2012  –  2014  (2 years) San Francisco Bay Area Built the company's first product marketing team, focusing on customer acquisition, user engagement, and go-to-market planning and execution. \n \nDesigned marketing strategies for entering new markets with new customer behaviors to diversify the company's revenue stream. Developed a forecasting methodology to evaluate the current business and identify new opportunities. \n \nSelected Contributions: \n- Launched BitTorrent Sync, a disruptive peer-to-peer file syncing product, on desktop and mobile platforms. \n- Developed and launched the company’s first marketing campaign for mobile devices, growing installations to over 12M in less than six months. \n- Developed a methodology for tracking user engagement from the moment of acquisition through to end-of-life to better understand customer lifetime value (LTV) and product virality. Director of Product Marketing BitTorrent, Inc. 2012  –  2014  (2 years) San Francisco Bay Area Built the company's first product marketing team, focusing on customer acquisition, user engagement, and go-to-market planning and execution. \n \nDesigned marketing strategies for entering new markets with new customer behaviors to diversify the company's revenue stream. Developed a forecasting methodology to evaluate the current business and identify new opportunities. \n \nSelected Contributions: \n- Launched BitTorrent Sync, a disruptive peer-to-peer file syncing product, on desktop and mobile platforms. \n- Developed and launched the company’s first marketing campaign for mobile devices, growing installations to over 12M in less than six months. \n- Developed a methodology for tracking user engagement from the moment of acquisition through to end-of-life to better understand customer lifetime value (LTV) and product virality. Director of Product Management Logitech, Inc. 2005  –  2012  (7 years) Newark, California and Vancouver, Washington Managed worldwide P&Ls of up to $418M for audio, digital home, and video business units spanning PC speaker, iPod speaker, headphone, set-top-box, and webcam product lines. \n \nBuilt revenue through skillful leadership and supportive direction of product management and marketing professionals. Maintained overhead through careful planning and control of operating expense (OpEx) budgets of up to $4M. \n \nSelected Contributions: \n- Developed five-year long-term strategic plans for each business unit, driving profitable growth through expansion of existing categories and evaluation of new markets. \n- Created two-year and three-year technology, platform, and product roadmaps, and deployed new portfolio management methodology that made process scalable, repeatable, and innovation-driven. \n- Matrix-managed international product development teams, adeptly coordinating efforts of engineering, operations, marketing communications, program management, customer support, and sales groups. Director of Product Management Logitech, Inc. 2005  –  2012  (7 years) Newark, California and Vancouver, Washington Managed worldwide P&Ls of up to $418M for audio, digital home, and video business units spanning PC speaker, iPod speaker, headphone, set-top-box, and webcam product lines. \n \nBuilt revenue through skillful leadership and supportive direction of product management and marketing professionals. Maintained overhead through careful planning and control of operating expense (OpEx) budgets of up to $4M. \n \nSelected Contributions: \n- Developed five-year long-term strategic plans for each business unit, driving profitable growth through expansion of existing categories and evaluation of new markets. \n- Created two-year and three-year technology, platform, and product roadmaps, and deployed new portfolio management methodology that made process scalable, repeatable, and innovation-driven. \n- Matrix-managed international product development teams, adeptly coordinating efforts of engineering, operations, marketing communications, program management, customer support, and sales groups. Senior Product Marketing Manager Oregon Scientific, Inc. 2003  –  2005  (2 years) Tualatin, Oregon Crafted U.S. business plans generating $27M in revenue for high-tech consumer electronics categories. \n \nPrepared roadmaps for multiple product lines including digital cameras, MP3 players, digital voice recorders, home audio / video products, telephones, and two-way radios. Coordinated product development proposals, and oversaw product planning, forecasting, analysis, research, and promotion. Senior Product Marketing Manager Oregon Scientific, Inc. 2003  –  2005  (2 years) Tualatin, Oregon Crafted U.S. business plans generating $27M in revenue for high-tech consumer electronics categories. \n \nPrepared roadmaps for multiple product lines including digital cameras, MP3 players, digital voice recorders, home audio / video products, telephones, and two-way radios. Coordinated product development proposals, and oversaw product planning, forecasting, analysis, research, and promotion. Senior Product Manager SONICblue Incorporated, Rio Division 2001  –  2002  (1 year) Tigard, Oregon Implemented global business plans for $13M product line, strengthening market position for current and next-generation Rio MP3 player lines, including flash memory, hard disk drive, and networked audio products. \n \nMatrix-managed international teams, providing direction and oversight of all product development and marketing efforts. Led planning, analysis, development, and execution projects, working effectively between departments to align all roadmap deliverables toward successful, on-time launch and ongoing revenue generation.  Senior Product Manager SONICblue Incorporated, Rio Division 2001  –  2002  (1 year) Tigard, Oregon Implemented global business plans for $13M product line, strengthening market position for current and next-generation Rio MP3 player lines, including flash memory, hard disk drive, and networked audio products. \n \nMatrix-managed international teams, providing direction and oversight of all product development and marketing efforts. Led planning, analysis, development, and execution projects, working effectively between departments to align all roadmap deliverables toward successful, on-time launch and ongoing revenue generation.  Technical Product Manager and Marketing Program Manager Intel Corporation 1997  –  2001  (4 years) Hillsboro, Oregon Directed business-to-business (B2B) marketing plans for streaming media hosting service and business video conferencing product line. \n \nPlanned and implemented wide range of end-customer and channel marketing communications including websites, video presentations, printed collateral, trade shows, advertising, and press relations. Managed matrix teams within other Intel groups during product launches, coordinating personnel from sales and marketing, legal, press relations, and field sales. Technical Product Manager and Marketing Program Manager Intel Corporation 1997  –  2001  (4 years) Hillsboro, Oregon Directed business-to-business (B2B) marketing plans for streaming media hosting service and business video conferencing product line. \n \nPlanned and implemented wide range of end-customer and channel marketing communications including websites, video presentations, printed collateral, trade shows, advertising, and press relations. Managed matrix teams within other Intel groups during product launches, coordinating personnel from sales and marketing, legal, press relations, and field sales. Skills Product Marketing Product Development Marketing Management Interaction Design Product Management User Interface Design Portfolio Management Innovation Management Go-to-market Strategy Roadmap Creation Consumer Electronics Mobile Devices Product Launch Cross-functional Team... Strategy Marketing Strategy B2B Marketing International Management Internet Marketing P&L Management General Management Strategic Planning Start-ups Competitive Analysis Positioning Marketing Communications Pricing Development of... Market Analysis Strategic Partnerships Leadership Partner Management Product Lifecycle... Management B2B Program Management Business Planning Mobile Applications Advertising Market Planning Multi-channel Marketing See 27+     See less Skills  Product Marketing Product Development Marketing Management Interaction Design Product Management User Interface Design Portfolio Management Innovation Management Go-to-market Strategy Roadmap Creation Consumer Electronics Mobile Devices Product Launch Cross-functional Team... Strategy Marketing Strategy B2B Marketing International Management Internet Marketing P&L Management General Management Strategic Planning Start-ups Competitive Analysis Positioning Marketing Communications Pricing Development of... Market Analysis Strategic Partnerships Leadership Partner Management Product Lifecycle... Management B2B Program Management Business Planning Mobile Applications Advertising Market Planning Multi-channel Marketing See 27+     See less Product Marketing Product Development Marketing Management Interaction Design Product Management User Interface Design Portfolio Management Innovation Management Go-to-market Strategy Roadmap Creation Consumer Electronics Mobile Devices Product Launch Cross-functional Team... Strategy Marketing Strategy B2B Marketing International Management Internet Marketing P&L Management General Management Strategic Planning Start-ups Competitive Analysis Positioning Marketing Communications Pricing Development of... Market Analysis Strategic Partnerships Leadership Partner Management Product Lifecycle... Management B2B Program Management Business Planning Mobile Applications Advertising Market Planning Multi-channel Marketing See 27+     See less Product Marketing Product Development Marketing Management Interaction Design Product Management User Interface Design Portfolio Management Innovation Management Go-to-market Strategy Roadmap Creation Consumer Electronics Mobile Devices Product Launch Cross-functional Team... Strategy Marketing Strategy B2B Marketing International Management Internet Marketing P&L Management General Management Strategic Planning Start-ups Competitive Analysis Positioning Marketing Communications Pricing Development of... Market Analysis Strategic Partnerships Leadership Partner Management Product Lifecycle... Management B2B Program Management Business Planning Mobile Applications Advertising Market Planning Multi-channel Marketing See 27+     See less Education University of Portland Masters,  Business Administration Regis University Bachelor of Science,  Business Administration University of Portland Masters,  Business Administration University of Portland Masters,  Business Administration University of Portland Masters,  Business Administration Regis University Bachelor of Science,  Business Administration Regis University Bachelor of Science,  Business Administration Regis University Bachelor of Science,  Business Administration ", "Skills Cross-functional Team... Product Marketing Demand Generation Multi-channel Marketing Go-to-market Strategy Marketing Communications Direct Marketing Product Management Skills  Cross-functional Team... Product Marketing Demand Generation Multi-channel Marketing Go-to-market Strategy Marketing Communications Direct Marketing Product Management Cross-functional Team... Product Marketing Demand Generation Multi-channel Marketing Go-to-market Strategy Marketing Communications Direct Marketing Product Management Cross-functional Team... Product Marketing Demand Generation Multi-channel Marketing Go-to-market Strategy Marketing Communications Direct Marketing Product Management ", "Summary Grow technology businesses in Asia through international expansion, localized product and marketing strategies, establishment of strategic partnerships, and organization development. Market Access Partners is based out of Shanghai and Sydney with a worldwide network of associates. www.mxspartners.net \nRecent projects/technologies: \n- Telco carrier, and Enterprise Mobile Device Management \n- Hi-performance client management system architecture \n- Anti-microbial surface treatment technology \n- Video & data transmission and compression solution \n \nPreviously worked in senior management positions at Intel Semiconductor in Asia and Europe for 15yrs, most recently lead the marketing and business development function of an integrated mobile platform development group out of Shanghai. Responsible for research, platform/product definition, ODM business development, and OEM marketing programs for Mobile products and platform initiatives. \n \nTwo prior positions at Intel were Director of the Corporate Marketing Group in each Asia Pacific and Europe/MiddleEast/Africa, managing regional organizations responsible for Intel’s Brand and Demand Creation investments across these two geographies.  \n \nLived, worked and enjoyed life in the Netherlands, Taiwan, Hong Kong, Singapore, Munich and now China. Summary Grow technology businesses in Asia through international expansion, localized product and marketing strategies, establishment of strategic partnerships, and organization development. Market Access Partners is based out of Shanghai and Sydney with a worldwide network of associates. www.mxspartners.net \nRecent projects/technologies: \n- Telco carrier, and Enterprise Mobile Device Management \n- Hi-performance client management system architecture \n- Anti-microbial surface treatment technology \n- Video & data transmission and compression solution \n \nPreviously worked in senior management positions at Intel Semiconductor in Asia and Europe for 15yrs, most recently lead the marketing and business development function of an integrated mobile platform development group out of Shanghai. Responsible for research, platform/product definition, ODM business development, and OEM marketing programs for Mobile products and platform initiatives. \n \nTwo prior positions at Intel were Director of the Corporate Marketing Group in each Asia Pacific and Europe/MiddleEast/Africa, managing regional organizations responsible for Intel’s Brand and Demand Creation investments across these two geographies.  \n \nLived, worked and enjoyed life in the Netherlands, Taiwan, Hong Kong, Singapore, Munich and now China. Grow technology businesses in Asia through international expansion, localized product and marketing strategies, establishment of strategic partnerships, and organization development. Market Access Partners is based out of Shanghai and Sydney with a worldwide network of associates. www.mxspartners.net \nRecent projects/technologies: \n- Telco carrier, and Enterprise Mobile Device Management \n- Hi-performance client management system architecture \n- Anti-microbial surface treatment technology \n- Video & data transmission and compression solution \n \nPreviously worked in senior management positions at Intel Semiconductor in Asia and Europe for 15yrs, most recently lead the marketing and business development function of an integrated mobile platform development group out of Shanghai. Responsible for research, platform/product definition, ODM business development, and OEM marketing programs for Mobile products and platform initiatives. \n \nTwo prior positions at Intel were Director of the Corporate Marketing Group in each Asia Pacific and Europe/MiddleEast/Africa, managing regional organizations responsible for Intel’s Brand and Demand Creation investments across these two geographies.  \n \nLived, worked and enjoyed life in the Netherlands, Taiwan, Hong Kong, Singapore, Munich and now China. Grow technology businesses in Asia through international expansion, localized product and marketing strategies, establishment of strategic partnerships, and organization development. Market Access Partners is based out of Shanghai and Sydney with a worldwide network of associates. www.mxspartners.net \nRecent projects/technologies: \n- Telco carrier, and Enterprise Mobile Device Management \n- Hi-performance client management system architecture \n- Anti-microbial surface treatment technology \n- Video & data transmission and compression solution \n \nPreviously worked in senior management positions at Intel Semiconductor in Asia and Europe for 15yrs, most recently lead the marketing and business development function of an integrated mobile platform development group out of Shanghai. Responsible for research, platform/product definition, ODM business development, and OEM marketing programs for Mobile products and platform initiatives. \n \nTwo prior positions at Intel were Director of the Corporate Marketing Group in each Asia Pacific and Europe/MiddleEast/Africa, managing regional organizations responsible for Intel’s Brand and Demand Creation investments across these two geographies.  \n \nLived, worked and enjoyed life in the Netherlands, Taiwan, Hong Kong, Singapore, Munich and now China. Experience Product & Business Development Manager (Worldwide scope) Intel Semiconductor, Shanghai April 2005  –  January 2007  (1 year 10 months) Director, Corporate Marketing Group, APAC/EMEA Intel Semiconductor, HongKong/Munich August 1998  –  March 2005  (6 years 8 months) '98-'01 AsiaPacific in HongKong, '01-'05 Europe/M.E./Africa in Munich APAC Regional Marketing Program Manager Intel Corporation 1991  –  1998  (7 years) Hong Kong / Singapore Regional Sales & Marketing Manager Acer Computer Ltd 1989  –  1991  (2 years) Sales & Marketing Manager, Hong Kong & Korea Acer 1989  –  1991  (2 years) Product & Business Development Manager (Worldwide scope) Intel Semiconductor, Shanghai April 2005  –  January 2007  (1 year 10 months) Product & Business Development Manager (Worldwide scope) Intel Semiconductor, Shanghai April 2005  –  January 2007  (1 year 10 months) Director, Corporate Marketing Group, APAC/EMEA Intel Semiconductor, HongKong/Munich August 1998  –  March 2005  (6 years 8 months) '98-'01 AsiaPacific in HongKong, '01-'05 Europe/M.E./Africa in Munich Director, Corporate Marketing Group, APAC/EMEA Intel Semiconductor, HongKong/Munich August 1998  –  March 2005  (6 years 8 months) '98-'01 AsiaPacific in HongKong, '01-'05 Europe/M.E./Africa in Munich APAC Regional Marketing Program Manager Intel Corporation 1991  –  1998  (7 years) Hong Kong / Singapore APAC Regional Marketing Program Manager Intel Corporation 1991  –  1998  (7 years) Hong Kong / Singapore Regional Sales & Marketing Manager Acer Computer Ltd 1989  –  1991  (2 years) Regional Sales & Marketing Manager Acer Computer Ltd 1989  –  1991  (2 years) Sales & Marketing Manager, Hong Kong & Korea Acer 1989  –  1991  (2 years) Sales & Marketing Manager, Hong Kong & Korea Acer 1989  –  1991  (2 years) Skills Marketing Strategy Mobile Strategic Partnerships New Business Development Business Strategy Cross-functional Team... Mobile Devices Enterprise Software Business Development International Sales Program Management Entrepreneurship Team Management Integrated Marketing CRM Marketing Strategy See 2+     See less Skills  Marketing Strategy Mobile Strategic Partnerships New Business Development Business Strategy Cross-functional Team... Mobile Devices Enterprise Software Business Development International Sales Program Management Entrepreneurship Team Management Integrated Marketing CRM Marketing Strategy See 2+     See less Marketing Strategy Mobile Strategic Partnerships New Business Development Business Strategy Cross-functional Team... Mobile Devices Enterprise Software Business Development International Sales Program Management Entrepreneurship Team Management Integrated Marketing CRM Marketing Strategy See 2+     See less Marketing Strategy Mobile Strategic Partnerships New Business Development Business Strategy Cross-functional Team... Mobile Devices Enterprise Software Business Development International Sales Program Management Entrepreneurship Team Management Integrated Marketing CRM Marketing Strategy See 2+     See less ", "Skills Product Marketing Product Management Intel Go-to-market Strategy Marketing Multi-channel Marketing Competitive Analysis Strategic Partnerships Semiconductors Product Launch Management Cross-functional Team... Business Alliances Demand Generation Program Management Skills  Product Marketing Product Management Intel Go-to-market Strategy Marketing Multi-channel Marketing Competitive Analysis Strategic Partnerships Semiconductors Product Launch Management Cross-functional Team... Business Alliances Demand Generation Program Management Product Marketing Product Management Intel Go-to-market Strategy Marketing Multi-channel Marketing Competitive Analysis Strategic Partnerships Semiconductors Product Launch Management Cross-functional Team... Business Alliances Demand Generation Program Management Product Marketing Product Management Intel Go-to-market Strategy Marketing Multi-channel Marketing Competitive Analysis Strategic Partnerships Semiconductors Product Launch Management Cross-functional Team... Business Alliances Demand Generation Program Management ", "Summary 20+ years of leadership in business operations and program management, product marketing and corporate finance. Currently managing NPI Business Operations team responsible for product ramps and life cycle management of Qualcomm baseband (MSM), RF and peripheral chipset products. Product and Customer Program Manager during launch of Centrino’s Wi-Fi component for Centrino Mobile Technology. Proven ability to leverage various program management, marketing, finance and operations experiences coupled with an MBA education to effectively manage technical, complex, multi-national development and post-launch programs. \n \nSpecialties: Sales Operations, Product Marketing, Customer Management, Program Management, Strategic Partnerships, Project Management, Operations and Supplier Management, Finance Summary 20+ years of leadership in business operations and program management, product marketing and corporate finance. Currently managing NPI Business Operations team responsible for product ramps and life cycle management of Qualcomm baseband (MSM), RF and peripheral chipset products. Product and Customer Program Manager during launch of Centrino’s Wi-Fi component for Centrino Mobile Technology. Proven ability to leverage various program management, marketing, finance and operations experiences coupled with an MBA education to effectively manage technical, complex, multi-national development and post-launch programs. \n \nSpecialties: Sales Operations, Product Marketing, Customer Management, Program Management, Strategic Partnerships, Project Management, Operations and Supplier Management, Finance 20+ years of leadership in business operations and program management, product marketing and corporate finance. Currently managing NPI Business Operations team responsible for product ramps and life cycle management of Qualcomm baseband (MSM), RF and peripheral chipset products. Product and Customer Program Manager during launch of Centrino’s Wi-Fi component for Centrino Mobile Technology. Proven ability to leverage various program management, marketing, finance and operations experiences coupled with an MBA education to effectively manage technical, complex, multi-national development and post-launch programs. \n \nSpecialties: Sales Operations, Product Marketing, Customer Management, Program Management, Strategic Partnerships, Project Management, Operations and Supplier Management, Finance 20+ years of leadership in business operations and program management, product marketing and corporate finance. Currently managing NPI Business Operations team responsible for product ramps and life cycle management of Qualcomm baseband (MSM), RF and peripheral chipset products. Product and Customer Program Manager during launch of Centrino’s Wi-Fi component for Centrino Mobile Technology. Proven ability to leverage various program management, marketing, finance and operations experiences coupled with an MBA education to effectively manage technical, complex, multi-national development and post-launch programs. \n \nSpecialties: Sales Operations, Product Marketing, Customer Management, Program Management, Strategic Partnerships, Project Management, Operations and Supplier Management, Finance Experience Manager, QCT Sales Operations Qualcomm 2008  – Present (7 years) Greater San Diego Area Director, Programs Powercast Corporation 2007  –  2008  (1 year) Greater San Diego Area - Program Managed Powercast’s first ever revenue product with on-time release under tight constraints while coordinating external requirements and deliveries between partners and end customer.  \n- Created product launch processes and product quality standards for future product releases.  \n- Developed and led wireless power demo development plan for CES2008 by leading multi-site effort. Successful showing at CES helped enable 2nd round of funding. Senior Marketing Manager Toshiba America Electronic Components 2006  –  2007  (1 year) Orange County, California Area Managed TAEC Power Semiconductor business in the Americas with P&L and marketing ownership by actively promoting products directly to customers and by managing a network of sales reps and distributors. \n- Directed and managed the Power Semiconductor Business Development Team in growing market segment share. \n- Monitored and managed the development of business plans, product lifecycles, Marcom, Trade shows, and positioning of Toshiba’s Power Discrete products within the industry base. \nProduct release announcements included: \nhttp://www.eetasia.com/ART_8800438807_1034362_NP_26843abf.HTM \nhttp://www.toshiba.com/taec/news/press_releases/2007/powr_07_465.jsp Senior Marketing Manager Intel Corporation - Server Platform Group 2005  –  2006  (1 year) Orange County, California Area Managed Itanium and Xeon Chipset products for 2008-2011. Managed OEM customer relationships for server product team. Responsibilities included single point of contact for all product related Xeon MP and Itanium product questions/issues and synchronized on OEM designs plans to guide time to market platform launches. \n- Calibrated with top Itanium OEM design teams and drove design changes into 2008 chipset that resulted in several new chipset design wins, thereby doubling expected market share over current Itanium chipset. \n- Partnered with platform planning and chipset architects to influence next generation Xeon Chipset design features based on customer knowledge, competitive landscape and industry trends meeting OEM expectations. Strategic Alliances Manager Gateway 2004  –  2005  (1 year) Orange County, California Area Managed strategic alliances with key suppliers (Intel, Microsoft, ATI) and partners (Google, Napster) to develop joint marketing programs, enforce MDA/MDF compliance and ensure maximum funding and rebate opportunities. \n- Owned strategic partnership with Intel including strategic funding, marketing programs, Intel Inside compliance, and alliance programs which optimize over $40M annual in funding/rebates and joint marketing. \n- Investigated, analyzed and recommended strategic partnership with search engines partners for Gateway pre-installs and incremental bounty generation opportunities which led to lucrative alliance with Google. Marketing Program Manager Intel Corporation - Wireless Network Group 2003  –  2004  (1 year) Greater San Diego Area Product Marketing Manager for Centrino Wireless Mini-PCI and PROset wireless configuration software. Executed ramp of Centrino 802.11bg wireless product line and managed enhanced PROset software update for product line. Managed Tier-1 OEM customer base in North America and APAC including Dell, HP, Gateway, Acer and Samsung for 802.11b product line. \n- Recognized for innovative restructuring of 802.11b software point release program by partnering with program management to deliver production version ahead of plan and meet top customer’s aggressive launch date. \n- Successfully planned and managed several major hardware modifications to revenue products across all Centrino OEMs utilizing proactive customer letters, quality data, samples distribution and SKU management. \n- Co-created and presented Centrino wireless product roadmap plans to customer management teams and drove feedback to internal development teams to influence product planning and drive strategic release cycles. Operations Program Manager Intel Corporation - Intel Communications Group 2000  –  2003  (3 years) Greater San Diego Area Managed local operations team in the development, validation, implementation and production of Intel NetStructure Load Balancer hardware platform. Managed contract manufacturers to ensure on time fulfillment. \n- Overcame various roadblocks and pulled in schedule to support launch of eight SKUs on time within a one-month span and over 20 SKUs for Intel and OEMs. Oversaw doubling of system volumes in one year. \n- Partnered with OEM customers to project manage customization efforts based on RFQ requirements for Load Balancer product line. Effectively managed operations team to successfully launch customized products for tier-1 customer, meeting launch schedules during dot.com ramp under aggressive deadlines. Senior Business Analyst Intel Corporation, Logistics Systems and Programs 1999  –  2000  (1 year) Phoenix, Arizona Area Managed product lifecycles of several internal shipping systems by driving customer requirements from various Intel sites and support groups. Project managed programmers, validation and training teams as well as implemented software and trained on-site at U.S, Ireland, Israel, and Puerto Rico logistics sites. \n- Project lead for Logistic Systems Support of Intel’s On-line Retail Center (ORC). Selected as key member of the outsourcing team for vendor evaluation of tier-1 electronics distributors in support of ORC ramp-up. \n- Facilitated functional design of a new tracking system, which partnered with an outside vendor. Coordinated analysis and resolution of gaps between Intel and vendor, created success metrics for implementation and co-wrote functional spec on internal system integration. Senior Financial Analyst Intel Corporation, Assembly/Test Manufacturing 1995  –  1999  (4 years) Phoenix, Arizona Area Performed ROI/NPV analyses within Intel’s international factory network, which concluded with recommendations to senior management. Analyzed over $250M of opportunities and influenced implementation of projects that were expected to save Intel over $45M through four years. Served as group consolidator for Intel's SPG group from 1995-1997. \n- Lead analyst in which radical cost reduction activity was evaluated for CPU products. Utilized multi-national cost team for standardizing financial cost methods for new manufacturing process and implemented over $100M in cost-cutting projects across four production sites. \n- Received Divisional Recognition Award for results in defining, developing and implementing a cross-functional team focused on equipment spares manufacturing, engineering and materials management. Resulted in reducing Spares Days of Inventory from 350 to 139 days and saved over $20.5M. \n- Consolidated and analyzed financial data for $2B business unit. Results were presented to Group Controller and General Manager for strategic decision-making and for updates to Intel CFO and CEO. \n- Recognition award from senior marketing manager for financial analysis of marketing web technical documentation program which saved Intel an estimated $500K. Financial Analyst/Project Coordinator AT&T / Lucent Technologies 1992  –  1995  (3 years) Greater New York City Area - Coordinated successful implementation of new telecommunications service bill verification process for large businesses between billing system analysts, project managers, and bill verification line group. \n- Budgeted, planned, and analyzed financial data and results for Chief Information Officer Organization ($200M annual budget) and presented data with spending recommendations to management. \n- Streamlined close analysis process by developing paperless process of converting raw data to analysis models. The new method reduced monthly close process time by 3 to 4 hours per person. \n- Member of AT&T Professional Development Program Manager, QCT Sales Operations Qualcomm 2008  – Present (7 years) Greater San Diego Area Manager, QCT Sales Operations Qualcomm 2008  – Present (7 years) Greater San Diego Area Director, Programs Powercast Corporation 2007  –  2008  (1 year) Greater San Diego Area - Program Managed Powercast’s first ever revenue product with on-time release under tight constraints while coordinating external requirements and deliveries between partners and end customer.  \n- Created product launch processes and product quality standards for future product releases.  \n- Developed and led wireless power demo development plan for CES2008 by leading multi-site effort. Successful showing at CES helped enable 2nd round of funding. Director, Programs Powercast Corporation 2007  –  2008  (1 year) Greater San Diego Area - Program Managed Powercast’s first ever revenue product with on-time release under tight constraints while coordinating external requirements and deliveries between partners and end customer.  \n- Created product launch processes and product quality standards for future product releases.  \n- Developed and led wireless power demo development plan for CES2008 by leading multi-site effort. Successful showing at CES helped enable 2nd round of funding. Senior Marketing Manager Toshiba America Electronic Components 2006  –  2007  (1 year) Orange County, California Area Managed TAEC Power Semiconductor business in the Americas with P&L and marketing ownership by actively promoting products directly to customers and by managing a network of sales reps and distributors. \n- Directed and managed the Power Semiconductor Business Development Team in growing market segment share. \n- Monitored and managed the development of business plans, product lifecycles, Marcom, Trade shows, and positioning of Toshiba’s Power Discrete products within the industry base. \nProduct release announcements included: \nhttp://www.eetasia.com/ART_8800438807_1034362_NP_26843abf.HTM \nhttp://www.toshiba.com/taec/news/press_releases/2007/powr_07_465.jsp Senior Marketing Manager Toshiba America Electronic Components 2006  –  2007  (1 year) Orange County, California Area Managed TAEC Power Semiconductor business in the Americas with P&L and marketing ownership by actively promoting products directly to customers and by managing a network of sales reps and distributors. \n- Directed and managed the Power Semiconductor Business Development Team in growing market segment share. \n- Monitored and managed the development of business plans, product lifecycles, Marcom, Trade shows, and positioning of Toshiba’s Power Discrete products within the industry base. \nProduct release announcements included: \nhttp://www.eetasia.com/ART_8800438807_1034362_NP_26843abf.HTM \nhttp://www.toshiba.com/taec/news/press_releases/2007/powr_07_465.jsp Senior Marketing Manager Intel Corporation - Server Platform Group 2005  –  2006  (1 year) Orange County, California Area Managed Itanium and Xeon Chipset products for 2008-2011. Managed OEM customer relationships for server product team. Responsibilities included single point of contact for all product related Xeon MP and Itanium product questions/issues and synchronized on OEM designs plans to guide time to market platform launches. \n- Calibrated with top Itanium OEM design teams and drove design changes into 2008 chipset that resulted in several new chipset design wins, thereby doubling expected market share over current Itanium chipset. \n- Partnered with platform planning and chipset architects to influence next generation Xeon Chipset design features based on customer knowledge, competitive landscape and industry trends meeting OEM expectations. Senior Marketing Manager Intel Corporation - Server Platform Group 2005  –  2006  (1 year) Orange County, California Area Managed Itanium and Xeon Chipset products for 2008-2011. Managed OEM customer relationships for server product team. Responsibilities included single point of contact for all product related Xeon MP and Itanium product questions/issues and synchronized on OEM designs plans to guide time to market platform launches. \n- Calibrated with top Itanium OEM design teams and drove design changes into 2008 chipset that resulted in several new chipset design wins, thereby doubling expected market share over current Itanium chipset. \n- Partnered with platform planning and chipset architects to influence next generation Xeon Chipset design features based on customer knowledge, competitive landscape and industry trends meeting OEM expectations. Strategic Alliances Manager Gateway 2004  –  2005  (1 year) Orange County, California Area Managed strategic alliances with key suppliers (Intel, Microsoft, ATI) and partners (Google, Napster) to develop joint marketing programs, enforce MDA/MDF compliance and ensure maximum funding and rebate opportunities. \n- Owned strategic partnership with Intel including strategic funding, marketing programs, Intel Inside compliance, and alliance programs which optimize over $40M annual in funding/rebates and joint marketing. \n- Investigated, analyzed and recommended strategic partnership with search engines partners for Gateway pre-installs and incremental bounty generation opportunities which led to lucrative alliance with Google. Strategic Alliances Manager Gateway 2004  –  2005  (1 year) Orange County, California Area Managed strategic alliances with key suppliers (Intel, Microsoft, ATI) and partners (Google, Napster) to develop joint marketing programs, enforce MDA/MDF compliance and ensure maximum funding and rebate opportunities. \n- Owned strategic partnership with Intel including strategic funding, marketing programs, Intel Inside compliance, and alliance programs which optimize over $40M annual in funding/rebates and joint marketing. \n- Investigated, analyzed and recommended strategic partnership with search engines partners for Gateway pre-installs and incremental bounty generation opportunities which led to lucrative alliance with Google. Marketing Program Manager Intel Corporation - Wireless Network Group 2003  –  2004  (1 year) Greater San Diego Area Product Marketing Manager for Centrino Wireless Mini-PCI and PROset wireless configuration software. Executed ramp of Centrino 802.11bg wireless product line and managed enhanced PROset software update for product line. Managed Tier-1 OEM customer base in North America and APAC including Dell, HP, Gateway, Acer and Samsung for 802.11b product line. \n- Recognized for innovative restructuring of 802.11b software point release program by partnering with program management to deliver production version ahead of plan and meet top customer’s aggressive launch date. \n- Successfully planned and managed several major hardware modifications to revenue products across all Centrino OEMs utilizing proactive customer letters, quality data, samples distribution and SKU management. \n- Co-created and presented Centrino wireless product roadmap plans to customer management teams and drove feedback to internal development teams to influence product planning and drive strategic release cycles. Marketing Program Manager Intel Corporation - Wireless Network Group 2003  –  2004  (1 year) Greater San Diego Area Product Marketing Manager for Centrino Wireless Mini-PCI and PROset wireless configuration software. Executed ramp of Centrino 802.11bg wireless product line and managed enhanced PROset software update for product line. Managed Tier-1 OEM customer base in North America and APAC including Dell, HP, Gateway, Acer and Samsung for 802.11b product line. \n- Recognized for innovative restructuring of 802.11b software point release program by partnering with program management to deliver production version ahead of plan and meet top customer’s aggressive launch date. \n- Successfully planned and managed several major hardware modifications to revenue products across all Centrino OEMs utilizing proactive customer letters, quality data, samples distribution and SKU management. \n- Co-created and presented Centrino wireless product roadmap plans to customer management teams and drove feedback to internal development teams to influence product planning and drive strategic release cycles. Operations Program Manager Intel Corporation - Intel Communications Group 2000  –  2003  (3 years) Greater San Diego Area Managed local operations team in the development, validation, implementation and production of Intel NetStructure Load Balancer hardware platform. Managed contract manufacturers to ensure on time fulfillment. \n- Overcame various roadblocks and pulled in schedule to support launch of eight SKUs on time within a one-month span and over 20 SKUs for Intel and OEMs. Oversaw doubling of system volumes in one year. \n- Partnered with OEM customers to project manage customization efforts based on RFQ requirements for Load Balancer product line. Effectively managed operations team to successfully launch customized products for tier-1 customer, meeting launch schedules during dot.com ramp under aggressive deadlines. Operations Program Manager Intel Corporation - Intel Communications Group 2000  –  2003  (3 years) Greater San Diego Area Managed local operations team in the development, validation, implementation and production of Intel NetStructure Load Balancer hardware platform. Managed contract manufacturers to ensure on time fulfillment. \n- Overcame various roadblocks and pulled in schedule to support launch of eight SKUs on time within a one-month span and over 20 SKUs for Intel and OEMs. Oversaw doubling of system volumes in one year. \n- Partnered with OEM customers to project manage customization efforts based on RFQ requirements for Load Balancer product line. Effectively managed operations team to successfully launch customized products for tier-1 customer, meeting launch schedules during dot.com ramp under aggressive deadlines. Senior Business Analyst Intel Corporation, Logistics Systems and Programs 1999  –  2000  (1 year) Phoenix, Arizona Area Managed product lifecycles of several internal shipping systems by driving customer requirements from various Intel sites and support groups. Project managed programmers, validation and training teams as well as implemented software and trained on-site at U.S, Ireland, Israel, and Puerto Rico logistics sites. \n- Project lead for Logistic Systems Support of Intel’s On-line Retail Center (ORC). Selected as key member of the outsourcing team for vendor evaluation of tier-1 electronics distributors in support of ORC ramp-up. \n- Facilitated functional design of a new tracking system, which partnered with an outside vendor. Coordinated analysis and resolution of gaps between Intel and vendor, created success metrics for implementation and co-wrote functional spec on internal system integration. Senior Business Analyst Intel Corporation, Logistics Systems and Programs 1999  –  2000  (1 year) Phoenix, Arizona Area Managed product lifecycles of several internal shipping systems by driving customer requirements from various Intel sites and support groups. Project managed programmers, validation and training teams as well as implemented software and trained on-site at U.S, Ireland, Israel, and Puerto Rico logistics sites. \n- Project lead for Logistic Systems Support of Intel’s On-line Retail Center (ORC). Selected as key member of the outsourcing team for vendor evaluation of tier-1 electronics distributors in support of ORC ramp-up. \n- Facilitated functional design of a new tracking system, which partnered with an outside vendor. Coordinated analysis and resolution of gaps between Intel and vendor, created success metrics for implementation and co-wrote functional spec on internal system integration. Senior Financial Analyst Intel Corporation, Assembly/Test Manufacturing 1995  –  1999  (4 years) Phoenix, Arizona Area Performed ROI/NPV analyses within Intel’s international factory network, which concluded with recommendations to senior management. Analyzed over $250M of opportunities and influenced implementation of projects that were expected to save Intel over $45M through four years. Served as group consolidator for Intel's SPG group from 1995-1997. \n- Lead analyst in which radical cost reduction activity was evaluated for CPU products. Utilized multi-national cost team for standardizing financial cost methods for new manufacturing process and implemented over $100M in cost-cutting projects across four production sites. \n- Received Divisional Recognition Award for results in defining, developing and implementing a cross-functional team focused on equipment spares manufacturing, engineering and materials management. Resulted in reducing Spares Days of Inventory from 350 to 139 days and saved over $20.5M. \n- Consolidated and analyzed financial data for $2B business unit. Results were presented to Group Controller and General Manager for strategic decision-making and for updates to Intel CFO and CEO. \n- Recognition award from senior marketing manager for financial analysis of marketing web technical documentation program which saved Intel an estimated $500K. Senior Financial Analyst Intel Corporation, Assembly/Test Manufacturing 1995  –  1999  (4 years) Phoenix, Arizona Area Performed ROI/NPV analyses within Intel’s international factory network, which concluded with recommendations to senior management. Analyzed over $250M of opportunities and influenced implementation of projects that were expected to save Intel over $45M through four years. Served as group consolidator for Intel's SPG group from 1995-1997. \n- Lead analyst in which radical cost reduction activity was evaluated for CPU products. Utilized multi-national cost team for standardizing financial cost methods for new manufacturing process and implemented over $100M in cost-cutting projects across four production sites. \n- Received Divisional Recognition Award for results in defining, developing and implementing a cross-functional team focused on equipment spares manufacturing, engineering and materials management. Resulted in reducing Spares Days of Inventory from 350 to 139 days and saved over $20.5M. \n- Consolidated and analyzed financial data for $2B business unit. Results were presented to Group Controller and General Manager for strategic decision-making and for updates to Intel CFO and CEO. \n- Recognition award from senior marketing manager for financial analysis of marketing web technical documentation program which saved Intel an estimated $500K. Financial Analyst/Project Coordinator AT&T / Lucent Technologies 1992  –  1995  (3 years) Greater New York City Area - Coordinated successful implementation of new telecommunications service bill verification process for large businesses between billing system analysts, project managers, and bill verification line group. \n- Budgeted, planned, and analyzed financial data and results for Chief Information Officer Organization ($200M annual budget) and presented data with spending recommendations to management. \n- Streamlined close analysis process by developing paperless process of converting raw data to analysis models. The new method reduced monthly close process time by 3 to 4 hours per person. \n- Member of AT&T Professional Development Program Financial Analyst/Project Coordinator AT&T / Lucent Technologies 1992  –  1995  (3 years) Greater New York City Area - Coordinated successful implementation of new telecommunications service bill verification process for large businesses between billing system analysts, project managers, and bill verification line group. \n- Budgeted, planned, and analyzed financial data and results for Chief Information Officer Organization ($200M annual budget) and presented data with spending recommendations to management. \n- Streamlined close analysis process by developing paperless process of converting raw data to analysis models. The new method reduced monthly close process time by 3 to 4 hours per person. \n- Member of AT&T Professional Development Program Skills Cross-functional Team... Strategic Partnerships Strategy Wireless Semiconductors CRM Product Marketing Program Management Telecommunications Skills  Cross-functional Team... Strategic Partnerships Strategy Wireless Semiconductors CRM Product Marketing Program Management Telecommunications Cross-functional Team... Strategic Partnerships Strategy Wireless Semiconductors CRM Product Marketing Program Management Telecommunications Cross-functional Team... Strategic Partnerships Strategy Wireless Semiconductors CRM Product Marketing Program Management Telecommunications Education Arizona State University MBA 1999 Penn State University BS,  Finance 1988  – 1992 Activities and Societies:  Delta Sigma Pi Business Fraternity AI DuPont Arizona State University MBA 1999 Arizona State University MBA 1999 Arizona State University MBA 1999 Penn State University BS,  Finance 1988  – 1992 Activities and Societies:  Delta Sigma Pi Business Fraternity Penn State University BS,  Finance 1988  – 1992 Activities and Societies:  Delta Sigma Pi Business Fraternity Penn State University BS,  Finance 1988  – 1992 Activities and Societies:  Delta Sigma Pi Business Fraternity AI DuPont AI DuPont AI DuPont Honors & Awards ", "Skills Product Marketing Strategic Partnerships Management Go-to-market Strategy Marketing Communications Channel Partners Team Leadership Competitive Analysis Skills  Product Marketing Strategic Partnerships Management Go-to-market Strategy Marketing Communications Channel Partners Team Leadership Competitive Analysis Product Marketing Strategic Partnerships Management Go-to-market Strategy Marketing Communications Channel Partners Team Leadership Competitive Analysis Product Marketing Strategic Partnerships Management Go-to-market Strategy Marketing Communications Channel Partners Team Leadership Competitive Analysis ", "Skills Program Management Marketing Intel Advertising Management Product Management Event Planning Product Marketing Sales Market Research Marketing Communications Marketing Strategy Project Management Social Media Marketing Skills  Program Management Marketing Intel Advertising Management Product Management Event Planning Product Marketing Sales Market Research Marketing Communications Marketing Strategy Project Management Social Media Marketing Program Management Marketing Intel Advertising Management Product Management Event Planning Product Marketing Sales Market Research Marketing Communications Marketing Strategy Project Management Social Media Marketing Program Management Marketing Intel Advertising Management Product Management Event Planning Product Marketing Sales Market Research Marketing Communications Marketing Strategy Project Management Social Media Marketing ", "Skills Product Marketing Go-to-market Strategy Blogging Strategic Partnerships Marketing Product Management Demand Generation Multi-channel Marketing Marketing Strategy Program Management Cross-functional Team... Competitive Analysis Lead Generation Integrated Marketing Product Launch Marketing Communications B2B Marketing Strategy See 3+     See less Skills  Product Marketing Go-to-market Strategy Blogging Strategic Partnerships Marketing Product Management Demand Generation Multi-channel Marketing Marketing Strategy Program Management Cross-functional Team... Competitive Analysis Lead Generation Integrated Marketing Product Launch Marketing Communications B2B Marketing Strategy See 3+     See less Product Marketing Go-to-market Strategy Blogging Strategic Partnerships Marketing Product Management Demand Generation Multi-channel Marketing Marketing Strategy Program Management Cross-functional Team... Competitive Analysis Lead Generation Integrated Marketing Product Launch Marketing Communications B2B Marketing Strategy See 3+     See less Product Marketing Go-to-market Strategy Blogging Strategic Partnerships Marketing Product Management Demand Generation Multi-channel Marketing Marketing Strategy Program Management Cross-functional Team... Competitive Analysis Lead Generation Integrated Marketing Product Launch Marketing Communications B2B Marketing Strategy See 3+     See less ", "Languages Chinese (Mandarin and Cantonese) Chinese (Mandarin and Cantonese) Chinese (Mandarin and Cantonese) Skills Product Marketing Strategy Virtualization Program Management Product Development Data Center Marketing Management Analytics Leadership VMware Product Planning Marketing Semiconductors Servers Go-to-market Strategy Skills  Product Marketing Strategy Virtualization Program Management Product Development Data Center Marketing Management Analytics Leadership VMware Product Planning Marketing Semiconductors Servers Go-to-market Strategy Product Marketing Strategy Virtualization Program Management Product Development Data Center Marketing Management Analytics Leadership VMware Product Planning Marketing Semiconductors Servers Go-to-market Strategy Product Marketing Strategy Virtualization Program Management Product Development Data Center Marketing Management Analytics Leadership VMware Product Planning Marketing Semiconductors Servers Go-to-market Strategy ", "Experience Marketing Program Manager Intel Corporation Marketing Program Manager Intel Corporation Marketing Program Manager Intel Corporation Education Pomona College 1983  – 1987 Pomona College 1983  – 1987 Pomona College 1983  – 1987 Pomona College 1983  – 1987 ", "Summary A seasoned leader with proven track record of crafting winning product strategies and driving industry wide impact through creation of vibrant ecosystems in support of these strategies. Summary A seasoned leader with proven track record of crafting winning product strategies and driving industry wide impact through creation of vibrant ecosystems in support of these strategies. A seasoned leader with proven track record of crafting winning product strategies and driving industry wide impact through creation of vibrant ecosystems in support of these strategies. A seasoned leader with proven track record of crafting winning product strategies and driving industry wide impact through creation of vibrant ecosystems in support of these strategies. Experience Director, Strategic Planning Intel Corporation August 2009  – Present (6 years 1 month) Santa Clara, CA Director, Strategic Planning Intel Corporation August 2009  – Present (6 years 1 month) Santa Clara, CA Director, Strategic Planning Intel Corporation August 2009  – Present (6 years 1 month) Santa Clara, CA Languages   Skills Semiconductors Product Management Product Planning Cross-functional Team... Product Marketing Product Lifecycle... Go-to-market Strategy Program Management Mobile Devices Product Development Product Launch SoC Intel Start-ups SaaS Skills  Semiconductors Product Management Product Planning Cross-functional Team... Product Marketing Product Lifecycle... Go-to-market Strategy Program Management Mobile Devices Product Development Product Launch SoC Intel Start-ups SaaS Semiconductors Product Management Product Planning Cross-functional Team... Product Marketing Product Lifecycle... Go-to-market Strategy Program Management Mobile Devices Product Development Product Launch SoC Intel Start-ups SaaS Semiconductors Product Management Product Planning Cross-functional Team... Product Marketing Product Lifecycle... Go-to-market Strategy Program Management Mobile Devices Product Development Product Launch SoC Intel Start-ups SaaS Education Santa Clara University MBA,  Strategy , Leadership, Product Management 2003  – 2004 University of Nebraska-Lincoln MS,  Electrical Engineering 1992  – 1994 Osmania University BS,  Electrical Engineering 1988  – 1992 Santa Clara University MBA,  Strategy , Leadership, Product Management 2003  – 2004 Santa Clara University MBA,  Strategy , Leadership, Product Management 2003  – 2004 Santa Clara University MBA,  Strategy , Leadership, Product Management 2003  – 2004 University of Nebraska-Lincoln MS,  Electrical Engineering 1992  – 1994 University of Nebraska-Lincoln MS,  Electrical Engineering 1992  – 1994 University of Nebraska-Lincoln MS,  Electrical Engineering 1992  – 1994 Osmania University BS,  Electrical Engineering 1988  – 1992 Osmania University BS,  Electrical Engineering 1988  – 1992 Osmania University BS,  Electrical Engineering 1988  – 1992 ", "Summary Qualification Highlights \n• Fifteen years of experience in Enterprise, B2B, Consumer and Retail marketing while working with indirect multi-channel partners (Distributors, OEMs, National Solution Partners, Etail/E-commerce, Retail and Value Added Resellers). \n• Currently managing $3.1M in annual marketing budgets for partners driving $68M in revenue. \n• Leader of new initiatives, campaigns, online events, promotions and demand generation programs utilizing social media, cooperative advertising, marketing communication, PR and project management skills. \n• Developed integrated marketing strategies by utilizing market research, SWOT analysis, predictive analytics, industry trends, market environment, competition, best practices, customer feedback and intuition. \n• A steward at managing projects utilizing cross-function organizations and cross-culture teams, relationship development, content development, pricing strategies, budgetary requirements and tracking ROI analysis. \n• Strong analytical skills, customer orientation, vendor and stakeholder management \n \nMarketing/campaign management competencies: quantitative and qualitative research support, campaign and marketing strategy development, project coordination and scheduling, budget management and purchasing, vendor management and negotiations, measuring metrics and cost analysis, account/customer supervision, sales marketing collaboration, multiple coordination of campaign executions, and creation of innovative and compelling campaigns with high ROI. \n \nNew initiatives and start ups competencies: infrastructure establishment, training sales and educating target audience, event logistic management and recruitment. \n \nBrand management competencies: brand identity development, focus groups and usability studies, media buying, content management, public relations, style guide contribution, demand creation management, direct and Indirect advertising promotions, and accrual/co-op management. Summary Qualification Highlights \n• Fifteen years of experience in Enterprise, B2B, Consumer and Retail marketing while working with indirect multi-channel partners (Distributors, OEMs, National Solution Partners, Etail/E-commerce, Retail and Value Added Resellers). \n• Currently managing $3.1M in annual marketing budgets for partners driving $68M in revenue. \n• Leader of new initiatives, campaigns, online events, promotions and demand generation programs utilizing social media, cooperative advertising, marketing communication, PR and project management skills. \n• Developed integrated marketing strategies by utilizing market research, SWOT analysis, predictive analytics, industry trends, market environment, competition, best practices, customer feedback and intuition. \n• A steward at managing projects utilizing cross-function organizations and cross-culture teams, relationship development, content development, pricing strategies, budgetary requirements and tracking ROI analysis. \n• Strong analytical skills, customer orientation, vendor and stakeholder management \n \nMarketing/campaign management competencies: quantitative and qualitative research support, campaign and marketing strategy development, project coordination and scheduling, budget management and purchasing, vendor management and negotiations, measuring metrics and cost analysis, account/customer supervision, sales marketing collaboration, multiple coordination of campaign executions, and creation of innovative and compelling campaigns with high ROI. \n \nNew initiatives and start ups competencies: infrastructure establishment, training sales and educating target audience, event logistic management and recruitment. \n \nBrand management competencies: brand identity development, focus groups and usability studies, media buying, content management, public relations, style guide contribution, demand creation management, direct and Indirect advertising promotions, and accrual/co-op management. Qualification Highlights \n• Fifteen years of experience in Enterprise, B2B, Consumer and Retail marketing while working with indirect multi-channel partners (Distributors, OEMs, National Solution Partners, Etail/E-commerce, Retail and Value Added Resellers). \n• Currently managing $3.1M in annual marketing budgets for partners driving $68M in revenue. \n• Leader of new initiatives, campaigns, online events, promotions and demand generation programs utilizing social media, cooperative advertising, marketing communication, PR and project management skills. \n• Developed integrated marketing strategies by utilizing market research, SWOT analysis, predictive analytics, industry trends, market environment, competition, best practices, customer feedback and intuition. \n• A steward at managing projects utilizing cross-function organizations and cross-culture teams, relationship development, content development, pricing strategies, budgetary requirements and tracking ROI analysis. \n• Strong analytical skills, customer orientation, vendor and stakeholder management \n \nMarketing/campaign management competencies: quantitative and qualitative research support, campaign and marketing strategy development, project coordination and scheduling, budget management and purchasing, vendor management and negotiations, measuring metrics and cost analysis, account/customer supervision, sales marketing collaboration, multiple coordination of campaign executions, and creation of innovative and compelling campaigns with high ROI. \n \nNew initiatives and start ups competencies: infrastructure establishment, training sales and educating target audience, event logistic management and recruitment. \n \nBrand management competencies: brand identity development, focus groups and usability studies, media buying, content management, public relations, style guide contribution, demand creation management, direct and Indirect advertising promotions, and accrual/co-op management. Qualification Highlights \n• Fifteen years of experience in Enterprise, B2B, Consumer and Retail marketing while working with indirect multi-channel partners (Distributors, OEMs, National Solution Partners, Etail/E-commerce, Retail and Value Added Resellers). \n• Currently managing $3.1M in annual marketing budgets for partners driving $68M in revenue. \n• Leader of new initiatives, campaigns, online events, promotions and demand generation programs utilizing social media, cooperative advertising, marketing communication, PR and project management skills. \n• Developed integrated marketing strategies by utilizing market research, SWOT analysis, predictive analytics, industry trends, market environment, competition, best practices, customer feedback and intuition. \n• A steward at managing projects utilizing cross-function organizations and cross-culture teams, relationship development, content development, pricing strategies, budgetary requirements and tracking ROI analysis. \n• Strong analytical skills, customer orientation, vendor and stakeholder management \n \nMarketing/campaign management competencies: quantitative and qualitative research support, campaign and marketing strategy development, project coordination and scheduling, budget management and purchasing, vendor management and negotiations, measuring metrics and cost analysis, account/customer supervision, sales marketing collaboration, multiple coordination of campaign executions, and creation of innovative and compelling campaigns with high ROI. \n \nNew initiatives and start ups competencies: infrastructure establishment, training sales and educating target audience, event logistic management and recruitment. \n \nBrand management competencies: brand identity development, focus groups and usability studies, media buying, content management, public relations, style guide contribution, demand creation management, direct and Indirect advertising promotions, and accrual/co-op management. Experience Channel Marketing Manager Xerox Corporation 2007  – Present (8 years) Wilsonville, Oregon • Strategic role in designing and implementing a syndicated web presence within channel partners’ ecommerce sites with year-over-year (YoY) online visit traffic trends exceeding 428%. \n• Key contributor in utilizing social media as a unique source to educate, engage and equip Account Executives with tools and recognition to motivate and challenge them to sell more product. \n• Focusing on key initiatives such as product refresh and propensity programs with +$750K incremental revenue opportunity with channel partners to gain more mindshare and market share. \n• Spearheaded a 9 part training series to drive more awareness to 5807 Partner Account Executives around how Xerox can help them win in the marketplace. Marketing Manager Intel Corporation 2003  –  2006  (3 years) Hillsboro, Oregon Intel Premier Provider Program/Intel Channel Branding Program\t \n• Managed and advocated day-to-day program strategies and investments with promotions, benefits, campaigns and brand positioning to grow top channel partners’ revenue to $441M annually. \n• Exceeded the year-end goal by 28% for a new branding program by personalizing communication and training to the customers. At the same time developed standardized auditing infrastructure that was adopted worldwide \n• Developed and implemented consistent brand positioning, value proposition, key benefits and messaging hierarchy for many new products and three major corporate program launches \n• Devised a Go-to-Market plan that illustrates mechanisms to build awareness, influence, preference and sales for a new technology by outlining OEM benefits, consumer benefits, and usage model scenarios, messaging hierarchy and demand creation elements. \n• Promoted brand awareness among 7.7 million end users through promotional “why buy” Premier Provider direct and indirect advertising. \n• Engaged in strategy planning to refocus programs around segmentation and business models to address diversification of system builders into value added resellers and distributors. \n• Ran multiple campaigns to sell up product mix or increase bundle purchases with doubling and quadrupling the return on investment. Marketing Program Manager Intel Corporation 2000  –  2003  (3 years) Hillsboro, Oregon Channel Co-op Advertising Program/Intel Inside Track 2\t \n• Launched a new cooperative advertising program within six weeks and licensed 1200 partners in North America by handling the execution of partner on-boarding, partner communications, PR, web content, training and events, ROI analysis and partner feedback. \n• Supervised the sales field engagement to drive program utilization, recruitment, and participation with 780 PC Manufacturers, $10M in accruals and $4.7M in reimbursement. \n• Saved $100K by optimizing the migration of web content and statement distribution to partners. \n• Executed short-term strategy by driving program participation and demand creation through an educational marketing campaign called “Right Here, Right Now” with support materials, ad templates, marketing plans and media placement advice. \n• Pioneered a reseller pilot program through researching, positioning, influencing stakeholders’ approvals, building a plan and delivering on indicators/metrics through customer case studies. \n• Fostered the creation of a marketing resource guide to educate 2000 North American resellers. Championed its execution to 10,000 worldwide resellers and implementation to Intel’s entire worldwide sales force at the corporate conference. Channel Promotions Manager Warn Industries 1998  –  2000  (2 years) Clackamas, Oregon •\tCreated and analyzed marketing plans for 800 retailers and sales managers on national and local coverage to improve Marketing Development Funds (MDF) usage by 13% YoY. \n•\tEstablished brand awareness by integrating new product introductions within publication’s set editorial calendars. \n•\tDeveloped a three-tiered fulfillment process for a $250K national consumer recall campaign and up-sell marketing effort through direct mail, retail Point-of-Purchase (POP), telemarketing and a print media campaign attaining 64% participation from existing customers. \n•\tManaged down channel communications, training on sales promotions, merchandise and programs to resellers, retailers, distributors, customer service, sales support, vendors and executives. Marketing Coordinator Videoland Inc. 1998  –  1998  (less than a year) Wilsonville, Oregon • Researched new store locations, community demographics, mass media opportunities and event agencies. Effectively promoted, introduced and drove patrons to 8 soft and grand openings. \n• Communicated directly with distributors, studio representatives and marketing directors to work on media buys and approvals in order to receive MDF and co-op dollars from studios for particular movie titles. Marketing Assistant Transport Logic 1997  –  1998  (1 year) Portland, Oregon Area •\tManaged and analyzed the value and return of all the advertising campaigns and media buys directly through agencies and indirectly through partners for both B2B and consumer channels. \n•\tCreated and coordinated all promotional materials for the value added resellers to increase revenue Channel Marketing Manager Xerox Corporation 2007  – Present (8 years) Wilsonville, Oregon • Strategic role in designing and implementing a syndicated web presence within channel partners’ ecommerce sites with year-over-year (YoY) online visit traffic trends exceeding 428%. \n• Key contributor in utilizing social media as a unique source to educate, engage and equip Account Executives with tools and recognition to motivate and challenge them to sell more product. \n• Focusing on key initiatives such as product refresh and propensity programs with +$750K incremental revenue opportunity with channel partners to gain more mindshare and market share. \n• Spearheaded a 9 part training series to drive more awareness to 5807 Partner Account Executives around how Xerox can help them win in the marketplace. Channel Marketing Manager Xerox Corporation 2007  – Present (8 years) Wilsonville, Oregon • Strategic role in designing and implementing a syndicated web presence within channel partners’ ecommerce sites with year-over-year (YoY) online visit traffic trends exceeding 428%. \n• Key contributor in utilizing social media as a unique source to educate, engage and equip Account Executives with tools and recognition to motivate and challenge them to sell more product. \n• Focusing on key initiatives such as product refresh and propensity programs with +$750K incremental revenue opportunity with channel partners to gain more mindshare and market share. \n• Spearheaded a 9 part training series to drive more awareness to 5807 Partner Account Executives around how Xerox can help them win in the marketplace. Marketing Manager Intel Corporation 2003  –  2006  (3 years) Hillsboro, Oregon Intel Premier Provider Program/Intel Channel Branding Program\t \n• Managed and advocated day-to-day program strategies and investments with promotions, benefits, campaigns and brand positioning to grow top channel partners’ revenue to $441M annually. \n• Exceeded the year-end goal by 28% for a new branding program by personalizing communication and training to the customers. At the same time developed standardized auditing infrastructure that was adopted worldwide \n• Developed and implemented consistent brand positioning, value proposition, key benefits and messaging hierarchy for many new products and three major corporate program launches \n• Devised a Go-to-Market plan that illustrates mechanisms to build awareness, influence, preference and sales for a new technology by outlining OEM benefits, consumer benefits, and usage model scenarios, messaging hierarchy and demand creation elements. \n• Promoted brand awareness among 7.7 million end users through promotional “why buy” Premier Provider direct and indirect advertising. \n• Engaged in strategy planning to refocus programs around segmentation and business models to address diversification of system builders into value added resellers and distributors. \n• Ran multiple campaigns to sell up product mix or increase bundle purchases with doubling and quadrupling the return on investment. Marketing Manager Intel Corporation 2003  –  2006  (3 years) Hillsboro, Oregon Intel Premier Provider Program/Intel Channel Branding Program\t \n• Managed and advocated day-to-day program strategies and investments with promotions, benefits, campaigns and brand positioning to grow top channel partners’ revenue to $441M annually. \n• Exceeded the year-end goal by 28% for a new branding program by personalizing communication and training to the customers. At the same time developed standardized auditing infrastructure that was adopted worldwide \n• Developed and implemented consistent brand positioning, value proposition, key benefits and messaging hierarchy for many new products and three major corporate program launches \n• Devised a Go-to-Market plan that illustrates mechanisms to build awareness, influence, preference and sales for a new technology by outlining OEM benefits, consumer benefits, and usage model scenarios, messaging hierarchy and demand creation elements. \n• Promoted brand awareness among 7.7 million end users through promotional “why buy” Premier Provider direct and indirect advertising. \n• Engaged in strategy planning to refocus programs around segmentation and business models to address diversification of system builders into value added resellers and distributors. \n• Ran multiple campaigns to sell up product mix or increase bundle purchases with doubling and quadrupling the return on investment. Marketing Program Manager Intel Corporation 2000  –  2003  (3 years) Hillsboro, Oregon Channel Co-op Advertising Program/Intel Inside Track 2\t \n• Launched a new cooperative advertising program within six weeks and licensed 1200 partners in North America by handling the execution of partner on-boarding, partner communications, PR, web content, training and events, ROI analysis and partner feedback. \n• Supervised the sales field engagement to drive program utilization, recruitment, and participation with 780 PC Manufacturers, $10M in accruals and $4.7M in reimbursement. \n• Saved $100K by optimizing the migration of web content and statement distribution to partners. \n• Executed short-term strategy by driving program participation and demand creation through an educational marketing campaign called “Right Here, Right Now” with support materials, ad templates, marketing plans and media placement advice. \n• Pioneered a reseller pilot program through researching, positioning, influencing stakeholders’ approvals, building a plan and delivering on indicators/metrics through customer case studies. \n• Fostered the creation of a marketing resource guide to educate 2000 North American resellers. Championed its execution to 10,000 worldwide resellers and implementation to Intel’s entire worldwide sales force at the corporate conference. Marketing Program Manager Intel Corporation 2000  –  2003  (3 years) Hillsboro, Oregon Channel Co-op Advertising Program/Intel Inside Track 2\t \n• Launched a new cooperative advertising program within six weeks and licensed 1200 partners in North America by handling the execution of partner on-boarding, partner communications, PR, web content, training and events, ROI analysis and partner feedback. \n• Supervised the sales field engagement to drive program utilization, recruitment, and participation with 780 PC Manufacturers, $10M in accruals and $4.7M in reimbursement. \n• Saved $100K by optimizing the migration of web content and statement distribution to partners. \n• Executed short-term strategy by driving program participation and demand creation through an educational marketing campaign called “Right Here, Right Now” with support materials, ad templates, marketing plans and media placement advice. \n• Pioneered a reseller pilot program through researching, positioning, influencing stakeholders’ approvals, building a plan and delivering on indicators/metrics through customer case studies. \n• Fostered the creation of a marketing resource guide to educate 2000 North American resellers. Championed its execution to 10,000 worldwide resellers and implementation to Intel’s entire worldwide sales force at the corporate conference. Channel Promotions Manager Warn Industries 1998  –  2000  (2 years) Clackamas, Oregon •\tCreated and analyzed marketing plans for 800 retailers and sales managers on national and local coverage to improve Marketing Development Funds (MDF) usage by 13% YoY. \n•\tEstablished brand awareness by integrating new product introductions within publication’s set editorial calendars. \n•\tDeveloped a three-tiered fulfillment process for a $250K national consumer recall campaign and up-sell marketing effort through direct mail, retail Point-of-Purchase (POP), telemarketing and a print media campaign attaining 64% participation from existing customers. \n•\tManaged down channel communications, training on sales promotions, merchandise and programs to resellers, retailers, distributors, customer service, sales support, vendors and executives. Channel Promotions Manager Warn Industries 1998  –  2000  (2 years) Clackamas, Oregon •\tCreated and analyzed marketing plans for 800 retailers and sales managers on national and local coverage to improve Marketing Development Funds (MDF) usage by 13% YoY. \n•\tEstablished brand awareness by integrating new product introductions within publication’s set editorial calendars. \n•\tDeveloped a three-tiered fulfillment process for a $250K national consumer recall campaign and up-sell marketing effort through direct mail, retail Point-of-Purchase (POP), telemarketing and a print media campaign attaining 64% participation from existing customers. \n•\tManaged down channel communications, training on sales promotions, merchandise and programs to resellers, retailers, distributors, customer service, sales support, vendors and executives. Marketing Coordinator Videoland Inc. 1998  –  1998  (less than a year) Wilsonville, Oregon • Researched new store locations, community demographics, mass media opportunities and event agencies. Effectively promoted, introduced and drove patrons to 8 soft and grand openings. \n• Communicated directly with distributors, studio representatives and marketing directors to work on media buys and approvals in order to receive MDF and co-op dollars from studios for particular movie titles. Marketing Coordinator Videoland Inc. 1998  –  1998  (less than a year) Wilsonville, Oregon • Researched new store locations, community demographics, mass media opportunities and event agencies. Effectively promoted, introduced and drove patrons to 8 soft and grand openings. \n• Communicated directly with distributors, studio representatives and marketing directors to work on media buys and approvals in order to receive MDF and co-op dollars from studios for particular movie titles. Marketing Assistant Transport Logic 1997  –  1998  (1 year) Portland, Oregon Area •\tManaged and analyzed the value and return of all the advertising campaigns and media buys directly through agencies and indirectly through partners for both B2B and consumer channels. \n•\tCreated and coordinated all promotional materials for the value added resellers to increase revenue Marketing Assistant Transport Logic 1997  –  1998  (1 year) Portland, Oregon Area •\tManaged and analyzed the value and return of all the advertising campaigns and media buys directly through agencies and indirectly through partners for both B2B and consumer channels. \n•\tCreated and coordinated all promotional materials for the value added resellers to increase revenue Skills Marketing Communications Strategic Planning Vendor Management Project Planning Demand Research Focus Groups Employee Benefits Multi-channel Marketing Demand Generation Product Marketing Go-to-market Strategy Channel Cross-functional Team... Product Management Digital Marketing Marketing Advertising Start-ups Leadership Brand Development Program Management Brand Management New Business Development Product Development Market Planning Sales See 12+     See less Skills  Marketing Communications Strategic Planning Vendor Management Project Planning Demand Research Focus Groups Employee Benefits Multi-channel Marketing Demand Generation Product Marketing Go-to-market Strategy Channel Cross-functional Team... Product Management Digital Marketing Marketing Advertising Start-ups Leadership Brand Development Program Management Brand Management New Business Development Product Development Market Planning Sales See 12+     See less Marketing Communications Strategic Planning Vendor Management Project Planning Demand Research Focus Groups Employee Benefits Multi-channel Marketing Demand Generation Product Marketing Go-to-market Strategy Channel Cross-functional Team... Product Management Digital Marketing Marketing Advertising Start-ups Leadership Brand Development Program Management Brand Management New Business Development Product Development Market Planning Sales See 12+     See less Marketing Communications Strategic Planning Vendor Management Project Planning Demand Research Focus Groups Employee Benefits Multi-channel Marketing Demand Generation Product Marketing Go-to-market Strategy Channel Cross-functional Team... Product Management Digital Marketing Marketing Advertising Start-ups Leadership Brand Development Program Management Brand Management New Business Development Product Development Market Planning Sales See 12+     See less Education Oregon State University Bachelor of Science 1992  – 1997 Activities and Societies:  Barometer Advertising Representation ,  Barometer Campus Manager ,  Beaver Yearbook Business Manager ,  Sigma Kappa Member and OSU Spirit Team Oregon State University Bachelor of Science 1992  – 1997 Activities and Societies:  Barometer Advertising Representation ,  Barometer Campus Manager ,  Beaver Yearbook Business Manager ,  Sigma Kappa Member and OSU Spirit Team Oregon State University Bachelor of Science 1992  – 1997 Activities and Societies:  Barometer Advertising Representation ,  Barometer Campus Manager ,  Beaver Yearbook Business Manager ,  Sigma Kappa Member and OSU Spirit Team Oregon State University Bachelor of Science 1992  – 1997 Activities and Societies:  Barometer Advertising Representation ,  Barometer Campus Manager ,  Beaver Yearbook Business Manager ,  Sigma Kappa Member and OSU Spirit Team Honors & Awards 2014 Women of the Channel CRN June 2014 CRN honors 340 Women of the Channel whose expertise and vision are deserving of recognition CPO Excellence Awards Xerox May 2014 Marci is an invaluable resource for how we differentiate our offering to our channel partners. She manages the marketing activities for National Reseller Partners, Etail and Office SuperStore partners. She was integral to the development and execution of three major activities in Q1, 2014: launching BOGO at CDW, rolling out the Discover the Value Xerox Campaign, and rolling out mono product compare charts for 12 Xerox office products through WebCollage.  Division Recognition Award Intel July 2004 Executing a highly effective Digital Home Summit and launching the Premier Provider Digital Home Initiative which delivered 20+ DHPC design wins in Q3, driving positive channel press articles, supported multi-city Digital Convergence Roadshow, and engaged 200+ broad channel accounts in Digital Home efforts. Division Recognition Award Intel April 2006 For owning and driving ISS for AMG/RCO Channels which hosted over 500 customers and drove over 9,000 customer training hours. Division Recognition Award Intel April 2005 In recognition of your outstanding contribution to the 2005 Intel Solution Summit through your commitment to our overall team success, assuming responsibility to get the job done focusing on the output, and always striving to ensure customer satisfaction. 2014 Women of the Channel CRN June 2014 CRN honors 340 Women of the Channel whose expertise and vision are deserving of recognition 2014 Women of the Channel CRN June 2014 CRN honors 340 Women of the Channel whose expertise and vision are deserving of recognition 2014 Women of the Channel CRN June 2014 CRN honors 340 Women of the Channel whose expertise and vision are deserving of recognition CPO Excellence Awards Xerox May 2014 Marci is an invaluable resource for how we differentiate our offering to our channel partners. She manages the marketing activities for National Reseller Partners, Etail and Office SuperStore partners. She was integral to the development and execution of three major activities in Q1, 2014: launching BOGO at CDW, rolling out the Discover the Value Xerox Campaign, and rolling out mono product compare charts for 12 Xerox office products through WebCollage.  CPO Excellence Awards Xerox May 2014 Marci is an invaluable resource for how we differentiate our offering to our channel partners. She manages the marketing activities for National Reseller Partners, Etail and Office SuperStore partners. She was integral to the development and execution of three major activities in Q1, 2014: launching BOGO at CDW, rolling out the Discover the Value Xerox Campaign, and rolling out mono product compare charts for 12 Xerox office products through WebCollage.  CPO Excellence Awards Xerox May 2014 Marci is an invaluable resource for how we differentiate our offering to our channel partners. She manages the marketing activities for National Reseller Partners, Etail and Office SuperStore partners. She was integral to the development and execution of three major activities in Q1, 2014: launching BOGO at CDW, rolling out the Discover the Value Xerox Campaign, and rolling out mono product compare charts for 12 Xerox office products through WebCollage.  Division Recognition Award Intel July 2004 Executing a highly effective Digital Home Summit and launching the Premier Provider Digital Home Initiative which delivered 20+ DHPC design wins in Q3, driving positive channel press articles, supported multi-city Digital Convergence Roadshow, and engaged 200+ broad channel accounts in Digital Home efforts. Division Recognition Award Intel July 2004 Executing a highly effective Digital Home Summit and launching the Premier Provider Digital Home Initiative which delivered 20+ DHPC design wins in Q3, driving positive channel press articles, supported multi-city Digital Convergence Roadshow, and engaged 200+ broad channel accounts in Digital Home efforts. Division Recognition Award Intel July 2004 Executing a highly effective Digital Home Summit and launching the Premier Provider Digital Home Initiative which delivered 20+ DHPC design wins in Q3, driving positive channel press articles, supported multi-city Digital Convergence Roadshow, and engaged 200+ broad channel accounts in Digital Home efforts. Division Recognition Award Intel April 2006 For owning and driving ISS for AMG/RCO Channels which hosted over 500 customers and drove over 9,000 customer training hours. Division Recognition Award Intel April 2006 For owning and driving ISS for AMG/RCO Channels which hosted over 500 customers and drove over 9,000 customer training hours. Division Recognition Award Intel April 2006 For owning and driving ISS for AMG/RCO Channels which hosted over 500 customers and drove over 9,000 customer training hours. Division Recognition Award Intel April 2005 In recognition of your outstanding contribution to the 2005 Intel Solution Summit through your commitment to our overall team success, assuming responsibility to get the job done focusing on the output, and always striving to ensure customer satisfaction. Division Recognition Award Intel April 2005 In recognition of your outstanding contribution to the 2005 Intel Solution Summit through your commitment to our overall team success, assuming responsibility to get the job done focusing on the output, and always striving to ensure customer satisfaction. Division Recognition Award Intel April 2005 In recognition of your outstanding contribution to the 2005 Intel Solution Summit through your commitment to our overall team success, assuming responsibility to get the job done focusing on the output, and always striving to ensure customer satisfaction. ", "Summary Sr. Manager offering extensive experiences in strategic planning, program management, process improvement, and marketing \n \nForward-looking and result-oriented team builder with strong ability to collaborate, influence, communicate, and lead \n \nExcellent skills in Excel, PowerPoint, Lean/Agile development process. Certified ScrumMaster (CSM) \n \n \nSpecialties:  \n• Program and Project Management• Agile Scrum Development • Process Improvement \n• Strategic Planning • Budget and Resource Planning • Requirement Analysis \n• Marketing Strategy • Customer Success • Cross-Functional Team Leadership Summary Sr. Manager offering extensive experiences in strategic planning, program management, process improvement, and marketing \n \nForward-looking and result-oriented team builder with strong ability to collaborate, influence, communicate, and lead \n \nExcellent skills in Excel, PowerPoint, Lean/Agile development process. Certified ScrumMaster (CSM) \n \n \nSpecialties:  \n• Program and Project Management• Agile Scrum Development • Process Improvement \n• Strategic Planning • Budget and Resource Planning • Requirement Analysis \n• Marketing Strategy • Customer Success • Cross-Functional Team Leadership Sr. Manager offering extensive experiences in strategic planning, program management, process improvement, and marketing \n \nForward-looking and result-oriented team builder with strong ability to collaborate, influence, communicate, and lead \n \nExcellent skills in Excel, PowerPoint, Lean/Agile development process. Certified ScrumMaster (CSM) \n \n \nSpecialties:  \n• Program and Project Management• Agile Scrum Development • Process Improvement \n• Strategic Planning • Budget and Resource Planning • Requirement Analysis \n• Marketing Strategy • Customer Success • Cross-Functional Team Leadership Sr. Manager offering extensive experiences in strategic planning, program management, process improvement, and marketing \n \nForward-looking and result-oriented team builder with strong ability to collaborate, influence, communicate, and lead \n \nExcellent skills in Excel, PowerPoint, Lean/Agile development process. Certified ScrumMaster (CSM) \n \n \nSpecialties:  \n• Program and Project Management• Agile Scrum Development • Process Improvement \n• Strategic Planning • Budget and Resource Planning • Requirement Analysis \n• Marketing Strategy • Customer Success • Cross-Functional Team Leadership Experience Senior Manager, Program Management ARRIS 2014  – Present (1 year) Portland, Oregon Area Strategic Planning Manager Intel Corporation 2012  –  2013  (1 year) PC Client Group Business Operations Program Manager Intel Corporation 2010  –  2012  (2 years) Data Center and Server Group Customer Marketing Program Manager Intel Corporation 2005  –  2010  (5 years) Wireless Networking Group Product Marketing Manager Intel Corporation 2001  –  2005  (4 years) Sale and Marketing Group Senior Manager, Program Management ARRIS 2014  – Present (1 year) Portland, Oregon Area Senior Manager, Program Management ARRIS 2014  – Present (1 year) Portland, Oregon Area Strategic Planning Manager Intel Corporation 2012  –  2013  (1 year) PC Client Group Strategic Planning Manager Intel Corporation 2012  –  2013  (1 year) PC Client Group Business Operations Program Manager Intel Corporation 2010  –  2012  (2 years) Data Center and Server Group Business Operations Program Manager Intel Corporation 2010  –  2012  (2 years) Data Center and Server Group Customer Marketing Program Manager Intel Corporation 2005  –  2010  (5 years) Wireless Networking Group Customer Marketing Program Manager Intel Corporation 2005  –  2010  (5 years) Wireless Networking Group Product Marketing Manager Intel Corporation 2001  –  2005  (4 years) Sale and Marketing Group Product Marketing Manager Intel Corporation 2001  –  2005  (4 years) Sale and Marketing Group Languages   Skills Skills     Education University of Washington Master of Business Administration (MBA) 2010  – 2012 Oklahoma City University Master of Science (M.S.),  Computer Science University of Washington Master of Business Administration (MBA) 2010  – 2012 University of Washington Master of Business Administration (MBA) 2010  – 2012 University of Washington Master of Business Administration (MBA) 2010  – 2012 Oklahoma City University Master of Science (M.S.),  Computer Science Oklahoma City University Master of Science (M.S.),  Computer Science Oklahoma City University Master of Science (M.S.),  Computer Science Honors & Awards ", "Summary Since 1995 Billie Goldman has been an innovator for Intel in press relations, sales, product marketing, brand awareness and preference and most recently in partner marketing. In each role, Billie has left an indelible mark as a creative catalyst. Billie’s most recent accomplishment is the creation of Inside Films, Hollywood's first trilogy of ground breaking, award winning social films \"The Power Inside,\" “The Beauty Inside” and “The Inside Experience,” in partnership with Toshiba. All the films have garnered over 70 awards including an Emmy for 'Outstanding New Approach\" in addition to 11 Cannes Lions, 3 of where were Grand Prix. Billie's third film has already collected 2 Webby's and an Emmy nomination with more awards expected. This year Billie was recognized for her efforts in social film by SoMe as their \"Thoroughly Modern Marketer of 2014\" and by Sage/Wall Street Journal as a \"Marketer That Matters.\" Billie is known for her contagious enthusiasm, her ability to build long-term relationships and her talent for turning often high-concept ideas into memorable consumer experiences. •• \n \nSpecialties: Omni-Channel Marketing, Co-Marketing, Partner Marketing, Transmedia Storytelling, Branded Content, Creative, Social Marketing, Online Advertising, Press Relations Summary Since 1995 Billie Goldman has been an innovator for Intel in press relations, sales, product marketing, brand awareness and preference and most recently in partner marketing. In each role, Billie has left an indelible mark as a creative catalyst. Billie’s most recent accomplishment is the creation of Inside Films, Hollywood's first trilogy of ground breaking, award winning social films \"The Power Inside,\" “The Beauty Inside” and “The Inside Experience,” in partnership with Toshiba. All the films have garnered over 70 awards including an Emmy for 'Outstanding New Approach\" in addition to 11 Cannes Lions, 3 of where were Grand Prix. Billie's third film has already collected 2 Webby's and an Emmy nomination with more awards expected. This year Billie was recognized for her efforts in social film by SoMe as their \"Thoroughly Modern Marketer of 2014\" and by Sage/Wall Street Journal as a \"Marketer That Matters.\" Billie is known for her contagious enthusiasm, her ability to build long-term relationships and her talent for turning often high-concept ideas into memorable consumer experiences. •• \n \nSpecialties: Omni-Channel Marketing, Co-Marketing, Partner Marketing, Transmedia Storytelling, Branded Content, Creative, Social Marketing, Online Advertising, Press Relations Since 1995 Billie Goldman has been an innovator for Intel in press relations, sales, product marketing, brand awareness and preference and most recently in partner marketing. In each role, Billie has left an indelible mark as a creative catalyst. Billie’s most recent accomplishment is the creation of Inside Films, Hollywood's first trilogy of ground breaking, award winning social films \"The Power Inside,\" “The Beauty Inside” and “The Inside Experience,” in partnership with Toshiba. All the films have garnered over 70 awards including an Emmy for 'Outstanding New Approach\" in addition to 11 Cannes Lions, 3 of where were Grand Prix. Billie's third film has already collected 2 Webby's and an Emmy nomination with more awards expected. This year Billie was recognized for her efforts in social film by SoMe as their \"Thoroughly Modern Marketer of 2014\" and by Sage/Wall Street Journal as a \"Marketer That Matters.\" Billie is known for her contagious enthusiasm, her ability to build long-term relationships and her talent for turning often high-concept ideas into memorable consumer experiences. •• \n \nSpecialties: Omni-Channel Marketing, Co-Marketing, Partner Marketing, Transmedia Storytelling, Branded Content, Creative, Social Marketing, Online Advertising, Press Relations Since 1995 Billie Goldman has been an innovator for Intel in press relations, sales, product marketing, brand awareness and preference and most recently in partner marketing. In each role, Billie has left an indelible mark as a creative catalyst. Billie’s most recent accomplishment is the creation of Inside Films, Hollywood's first trilogy of ground breaking, award winning social films \"The Power Inside,\" “The Beauty Inside” and “The Inside Experience,” in partnership with Toshiba. All the films have garnered over 70 awards including an Emmy for 'Outstanding New Approach\" in addition to 11 Cannes Lions, 3 of where were Grand Prix. Billie's third film has already collected 2 Webby's and an Emmy nomination with more awards expected. This year Billie was recognized for her efforts in social film by SoMe as their \"Thoroughly Modern Marketer of 2014\" and by Sage/Wall Street Journal as a \"Marketer That Matters.\" Billie is known for her contagious enthusiasm, her ability to build long-term relationships and her talent for turning often high-concept ideas into memorable consumer experiences. •• \n \nSpecialties: Omni-Channel Marketing, Co-Marketing, Partner Marketing, Transmedia Storytelling, Branded Content, Creative, Social Marketing, Online Advertising, Press Relations Experience Partner Marketing Manager Intel Corporation January 2011  – Present (4 years 8 months) Campaign Manager Intel Corporation February 2010  –  January 2011  (1 year) Customer Marketing Manager Intel April 2008  –  March 2010  (2 years) Demand Creation Manger Intel Corporation September 2006  –  April 2008  (1 year 8 months) Demand Creation Manager Intel 2006  –  2007  (1 year) Outbound Marketing Manager Intel January 2006  –  September 2006  (9 months) OEM Marketing Programs Manager Intel Corporation November 2003  –  December 2005  (2 years 2 months) Hillsboro, OR Business Development Manager Intel Corporation June 2002  –  November 2003  (1 year 6 months) Channel Marketing Program Manager Intel Corporation November 2001  –  June 2002  (8 months) Consumer Marketing Program Manager Intel Corporation February 1998  –  September 2001  (3 years 8 months) Press Relations Specialist Intel Corporation January 1997  –  January 1998  (1 year 1 month) Government Affairs Manager The Southland Corporation / 7-Eleven Stores March 1992  –  March 1995  (3 years 1 month) Partner Marketing Manager Intel Corporation January 2011  – Present (4 years 8 months) Partner Marketing Manager Intel Corporation January 2011  – Present (4 years 8 months) Campaign Manager Intel Corporation February 2010  –  January 2011  (1 year) Campaign Manager Intel Corporation February 2010  –  January 2011  (1 year) Customer Marketing Manager Intel April 2008  –  March 2010  (2 years) Customer Marketing Manager Intel April 2008  –  March 2010  (2 years) Demand Creation Manger Intel Corporation September 2006  –  April 2008  (1 year 8 months) Demand Creation Manger Intel Corporation September 2006  –  April 2008  (1 year 8 months) Demand Creation Manager Intel 2006  –  2007  (1 year) Demand Creation Manager Intel 2006  –  2007  (1 year) Outbound Marketing Manager Intel January 2006  –  September 2006  (9 months) Outbound Marketing Manager Intel January 2006  –  September 2006  (9 months) OEM Marketing Programs Manager Intel Corporation November 2003  –  December 2005  (2 years 2 months) Hillsboro, OR OEM Marketing Programs Manager Intel Corporation November 2003  –  December 2005  (2 years 2 months) Hillsboro, OR Business Development Manager Intel Corporation June 2002  –  November 2003  (1 year 6 months) Business Development Manager Intel Corporation June 2002  –  November 2003  (1 year 6 months) Channel Marketing Program Manager Intel Corporation November 2001  –  June 2002  (8 months) Channel Marketing Program Manager Intel Corporation November 2001  –  June 2002  (8 months) Consumer Marketing Program Manager Intel Corporation February 1998  –  September 2001  (3 years 8 months) Consumer Marketing Program Manager Intel Corporation February 1998  –  September 2001  (3 years 8 months) Press Relations Specialist Intel Corporation January 1997  –  January 1998  (1 year 1 month) Press Relations Specialist Intel Corporation January 1997  –  January 1998  (1 year 1 month) Government Affairs Manager The Southland Corporation / 7-Eleven Stores March 1992  –  March 1995  (3 years 1 month) Government Affairs Manager The Southland Corporation / 7-Eleven Stores March 1992  –  March 1995  (3 years 1 month) Skills Negotiation Web Technologies Go-to-market Strategy Product Management Product Marketing E-Learning Demand Generation Online Advertising Multi-channel Marketing Sales Enablement Government Marketing Strategy Email Marketing Integrated Marketing Product Launch Marketing Communications Program Management Strategy Strategic Partnerships Lead Generation Cross-functional Team... Business Development Marketing Advertising Leadership Management Market Planning Digital Marketing Social Media Marketing Sales Online Marketing Digital Strategy See 17+     See less Skills  Negotiation Web Technologies Go-to-market Strategy Product Management Product Marketing E-Learning Demand Generation Online Advertising Multi-channel Marketing Sales Enablement Government Marketing Strategy Email Marketing Integrated Marketing Product Launch Marketing Communications Program Management Strategy Strategic Partnerships Lead Generation Cross-functional Team... Business Development Marketing Advertising Leadership Management Market Planning Digital Marketing Social Media Marketing Sales Online Marketing Digital Strategy See 17+     See less Negotiation Web Technologies Go-to-market Strategy Product Management Product Marketing E-Learning Demand Generation Online Advertising Multi-channel Marketing Sales Enablement Government Marketing Strategy Email Marketing Integrated Marketing Product Launch Marketing Communications Program Management Strategy Strategic Partnerships Lead Generation Cross-functional Team... Business Development Marketing Advertising Leadership Management Market Planning Digital Marketing Social Media Marketing Sales Online Marketing Digital Strategy See 17+     See less Negotiation Web Technologies Go-to-market Strategy Product Management Product Marketing E-Learning Demand Generation Online Advertising Multi-channel Marketing Sales Enablement Government Marketing Strategy Email Marketing Integrated Marketing Product Launch Marketing Communications Program Management Strategy Strategic Partnerships Lead Generation Cross-functional Team... Business Development Marketing Advertising Leadership Management Market Planning Digital Marketing Social Media Marketing Sales Online Marketing Digital Strategy See 17+     See less Education Fielding Graduate University Fielding Graduate University University of California, San Diego Fielding Graduate University Fielding Graduate University Fielding Graduate University Fielding Graduate University Fielding Graduate University Fielding Graduate University University of California, San Diego University of California, San Diego University of California, San Diego Honors & Awards Thoroughly Modern Marketer of the Year SoMe (Social Media Awards) April 2014 The SoMe Awards (Social Media) www.someawards.com honors the best social media campaigns by marketing agencies, in-house teams and freelancers from across the United States and has recognized Billie Goldman as the 'Thoroughly Modern Marketer of the Year' specifically related to her efforts over the last three years creating social films that succeeded in bluring the lines between advertising and entertainment.  Marketers That Matter Marketers That Matter April 2014 www.marketersthatmatter.com The Sage Group has partnered with The Wall Street Journal and industry leaders to inaugurate this award to highlight the marketing strategies and tactics creating measurable results at both fast-growing start-ups and large established enterprises. \n \nMarketing is transforming at an unprecedented rate shifting the way consumers and companies engage. With transformation comes innovation. Exceptional marketers are transforming consumer engagement, utilizing big data, and impacting product definition. They are leveraging new channels, technologies, and platforms to create tangible results and best practices for the companies and customers they serve. \n \nBillie Goldman is being recognized as a finalist for the Marketer That Matters award specifically related to her efforts creating a new form of entertainment that blurs the lines between entertainment and advertising with social film. Intel Achievement Award Intel June 2013 The Intel Achievement Award is Intel's highest level of recognition and goes to teams or individuals that delivered the most critical breakthroughs in the previous year. Billie Goldman is being recognized for her efforts with social film, creating a new form of entertainment that blurs the lines between advertising and entertainment.  iMedia: Top 25 Marketing Innovators of 2014 iMedia November 2014 iMedia recognition of the top 25 cutting-edge creatives, strategists, and technology innovators with big ideas, who get results and collaborate openly to push internet marketing forward. http://www.imediaconnection.com/iMedia25/2014/marketing-leaders-and-innovators/billie-goldman-intel-corp/ Thoroughly Modern Marketer of the Year SoMe (Social Media Awards) April 2014 The SoMe Awards (Social Media) www.someawards.com honors the best social media campaigns by marketing agencies, in-house teams and freelancers from across the United States and has recognized Billie Goldman as the 'Thoroughly Modern Marketer of the Year' specifically related to her efforts over the last three years creating social films that succeeded in bluring the lines between advertising and entertainment.  Thoroughly Modern Marketer of the Year SoMe (Social Media Awards) April 2014 The SoMe Awards (Social Media) www.someawards.com honors the best social media campaigns by marketing agencies, in-house teams and freelancers from across the United States and has recognized Billie Goldman as the 'Thoroughly Modern Marketer of the Year' specifically related to her efforts over the last three years creating social films that succeeded in bluring the lines between advertising and entertainment.  Thoroughly Modern Marketer of the Year SoMe (Social Media Awards) April 2014 The SoMe Awards (Social Media) www.someawards.com honors the best social media campaigns by marketing agencies, in-house teams and freelancers from across the United States and has recognized Billie Goldman as the 'Thoroughly Modern Marketer of the Year' specifically related to her efforts over the last three years creating social films that succeeded in bluring the lines between advertising and entertainment.  Marketers That Matter Marketers That Matter April 2014 www.marketersthatmatter.com The Sage Group has partnered with The Wall Street Journal and industry leaders to inaugurate this award to highlight the marketing strategies and tactics creating measurable results at both fast-growing start-ups and large established enterprises. \n \nMarketing is transforming at an unprecedented rate shifting the way consumers and companies engage. With transformation comes innovation. Exceptional marketers are transforming consumer engagement, utilizing big data, and impacting product definition. They are leveraging new channels, technologies, and platforms to create tangible results and best practices for the companies and customers they serve. \n \nBillie Goldman is being recognized as a finalist for the Marketer That Matters award specifically related to her efforts creating a new form of entertainment that blurs the lines between entertainment and advertising with social film. Marketers That Matter Marketers That Matter April 2014 www.marketersthatmatter.com The Sage Group has partnered with The Wall Street Journal and industry leaders to inaugurate this award to highlight the marketing strategies and tactics creating measurable results at both fast-growing start-ups and large established enterprises. \n \nMarketing is transforming at an unprecedented rate shifting the way consumers and companies engage. With transformation comes innovation. Exceptional marketers are transforming consumer engagement, utilizing big data, and impacting product definition. They are leveraging new channels, technologies, and platforms to create tangible results and best practices for the companies and customers they serve. \n \nBillie Goldman is being recognized as a finalist for the Marketer That Matters award specifically related to her efforts creating a new form of entertainment that blurs the lines between entertainment and advertising with social film. Marketers That Matter Marketers That Matter April 2014 www.marketersthatmatter.com The Sage Group has partnered with The Wall Street Journal and industry leaders to inaugurate this award to highlight the marketing strategies and tactics creating measurable results at both fast-growing start-ups and large established enterprises. \n \nMarketing is transforming at an unprecedented rate shifting the way consumers and companies engage. With transformation comes innovation. Exceptional marketers are transforming consumer engagement, utilizing big data, and impacting product definition. They are leveraging new channels, technologies, and platforms to create tangible results and best practices for the companies and customers they serve. \n \nBillie Goldman is being recognized as a finalist for the Marketer That Matters award specifically related to her efforts creating a new form of entertainment that blurs the lines between entertainment and advertising with social film. Intel Achievement Award Intel June 2013 The Intel Achievement Award is Intel's highest level of recognition and goes to teams or individuals that delivered the most critical breakthroughs in the previous year. Billie Goldman is being recognized for her efforts with social film, creating a new form of entertainment that blurs the lines between advertising and entertainment.  Intel Achievement Award Intel June 2013 The Intel Achievement Award is Intel's highest level of recognition and goes to teams or individuals that delivered the most critical breakthroughs in the previous year. Billie Goldman is being recognized for her efforts with social film, creating a new form of entertainment that blurs the lines between advertising and entertainment.  Intel Achievement Award Intel June 2013 The Intel Achievement Award is Intel's highest level of recognition and goes to teams or individuals that delivered the most critical breakthroughs in the previous year. Billie Goldman is being recognized for her efforts with social film, creating a new form of entertainment that blurs the lines between advertising and entertainment.  iMedia: Top 25 Marketing Innovators of 2014 iMedia November 2014 iMedia recognition of the top 25 cutting-edge creatives, strategists, and technology innovators with big ideas, who get results and collaborate openly to push internet marketing forward. http://www.imediaconnection.com/iMedia25/2014/marketing-leaders-and-innovators/billie-goldman-intel-corp/ iMedia: Top 25 Marketing Innovators of 2014 iMedia November 2014 iMedia recognition of the top 25 cutting-edge creatives, strategists, and technology innovators with big ideas, who get results and collaborate openly to push internet marketing forward. http://www.imediaconnection.com/iMedia25/2014/marketing-leaders-and-innovators/billie-goldman-intel-corp/ iMedia: Top 25 Marketing Innovators of 2014 iMedia November 2014 iMedia recognition of the top 25 cutting-edge creatives, strategists, and technology innovators with big ideas, who get results and collaborate openly to push internet marketing forward. http://www.imediaconnection.com/iMedia25/2014/marketing-leaders-and-innovators/billie-goldman-intel-corp/ ", "Skills Product Management Product Launch Product Development Strategy Marketing Strategy Marketing Cross-functional Team... Channel Trade Marketing Account Management Market Planning Integrated Marketing Multi-channel Marketing Management Segmentation Sales Competitive Analysis See 2+     See less Skills  Product Management Product Launch Product Development Strategy Marketing Strategy Marketing Cross-functional Team... Channel Trade Marketing Account Management Market Planning Integrated Marketing Multi-channel Marketing Management Segmentation Sales Competitive Analysis See 2+     See less Product Management Product Launch Product Development Strategy Marketing Strategy Marketing Cross-functional Team... Channel Trade Marketing Account Management Market Planning Integrated Marketing Multi-channel Marketing Management Segmentation Sales Competitive Analysis See 2+     See less Product Management Product Launch Product Development Strategy Marketing Strategy Marketing Cross-functional Team... Channel Trade Marketing Account Management Market Planning Integrated Marketing Multi-channel Marketing Management Segmentation Sales Competitive Analysis See 2+     See less ", "Experience Marketing Program Manager Intel Corporation Marketing Program Manager Intel Corporation Marketing Program Manager Intel Corporation Skills Product Management Go-to-market Strategy Product Marketing Marketing Business Development Marketing Strategy Strategy Skills  Product Management Go-to-market Strategy Product Marketing Marketing Business Development Marketing Strategy Strategy Product Management Go-to-market Strategy Product Marketing Marketing Business Development Marketing Strategy Strategy Product Management Go-to-market Strategy Product Marketing Marketing Business Development Marketing Strategy Strategy ", "Summary Results-driven and passionate professional offering more than 20 years of success in marketing, brand development, digital and content strategy and digital production management. Decisive visionary with a dynamic background across marketing, management, editorial, business analysis, and strategic planning. Proven program manager who has directed numerous complex, cross-functional, multimillion-dollar projects on time and on budget leveraging cross-functional and geographically dispersed teams in matrixed environments. Leads by example to achieve objectives. Lengthy track record of strong leadership, strategic vision, creative, organizational, and interpersonal skills. \n \nSpecialties: Strategic Planning, User Centered Design, Social Media/Community, Digital Brand Management, Managing Editor, Team Leadership, Cross-functional Team Leadership, User Testing, Content Strategy and Curation, Summary Results-driven and passionate professional offering more than 20 years of success in marketing, brand development, digital and content strategy and digital production management. Decisive visionary with a dynamic background across marketing, management, editorial, business analysis, and strategic planning. Proven program manager who has directed numerous complex, cross-functional, multimillion-dollar projects on time and on budget leveraging cross-functional and geographically dispersed teams in matrixed environments. Leads by example to achieve objectives. Lengthy track record of strong leadership, strategic vision, creative, organizational, and interpersonal skills. \n \nSpecialties: Strategic Planning, User Centered Design, Social Media/Community, Digital Brand Management, Managing Editor, Team Leadership, Cross-functional Team Leadership, User Testing, Content Strategy and Curation, Results-driven and passionate professional offering more than 20 years of success in marketing, brand development, digital and content strategy and digital production management. Decisive visionary with a dynamic background across marketing, management, editorial, business analysis, and strategic planning. Proven program manager who has directed numerous complex, cross-functional, multimillion-dollar projects on time and on budget leveraging cross-functional and geographically dispersed teams in matrixed environments. Leads by example to achieve objectives. Lengthy track record of strong leadership, strategic vision, creative, organizational, and interpersonal skills. \n \nSpecialties: Strategic Planning, User Centered Design, Social Media/Community, Digital Brand Management, Managing Editor, Team Leadership, Cross-functional Team Leadership, User Testing, Content Strategy and Curation, Results-driven and passionate professional offering more than 20 years of success in marketing, brand development, digital and content strategy and digital production management. Decisive visionary with a dynamic background across marketing, management, editorial, business analysis, and strategic planning. Proven program manager who has directed numerous complex, cross-functional, multimillion-dollar projects on time and on budget leveraging cross-functional and geographically dispersed teams in matrixed environments. Leads by example to achieve objectives. Lengthy track record of strong leadership, strategic vision, creative, organizational, and interpersonal skills. \n \nSpecialties: Strategic Planning, User Centered Design, Social Media/Community, Digital Brand Management, Managing Editor, Team Leadership, Cross-functional Team Leadership, User Testing, Content Strategy and Curation, Experience Digital Marketing Program Manager Intel Corporation May 2013  – Present (2 years 4 months) Hillsboro, OR Managing and driving digital projects for Intel.com. Collaborate cross-functionally to assess business needs and current functionality aligning those against Intel's growth strategy in various critical markets. Defining and developing both short and long term digital experience for the US market and Intel's international online properties. Current focus includes Education market (www.intel.com/education), Maker initiative (maker.intel.com) and editorial support of Intel.com Home Page. President, Board of Directors Alliance Francaise de Portland January 2012  –  August 2013  (1 year 8 months) Portland, Oregon Area Director of Services ParisCentral July 2012  –  February 2013  (8 months) Portland, OR Paris Central is a new online company bridging the gap between the old and new ways one can fully enjoy Paris. We are combining high-tech with high-touch wrapped in a rich user-driven community that delivers full-spectrum value for the product mix at Paris Central. I designed, developed and built www.pariscentral.com from the ground up. Determined content strategy and structure, functionality, user interface, wireframes, negotiated partnership engagements between US and Paris, wrote/edited all content, built out site on Drupal. Site experiences average visitor duration of over 10 minutes per visit. Director, Marketing Programs, Corporate Marketing and Communications The Standard November 2010  –  March 2012  (1 year 5 months) Portland, Oregon Area Directed the marketing programs team for Corporate Marketing at The Standard. Managed a team of program managers serving all the marketing needs of 5 different business divisions and a budget of approx. $4 million annually. This includes all print and digital marketing materials, national trade shows, regional producer events, broker schools, numerous newsletters, campaign execution, webinars, email marketing, and all field communications and advisory committees. Streamlined marketing operations improving speed to market and transparency. Director of Production eBusiness Group, Corporate Marketing and Communications The Standard May 2008  –  November 2010  (2 years 7 months) Portland, Oregon Area Operationalized and managed all of The Standard’s public facing Internet and extranet properties. Led the redesign/rebuild of www.standard.com which included collapsing 11 siloed URLs into one unified presence and brand. Consolidated and managed rewrite of 2000 pieces of content into current state. Manage email/newsletter campaigns, wireframe development, microsite development, HTML/CSS templates, usability, user experience, UAT and production validation. Established operational and customer experience standards for all aspects of the web presentation layer. Translated business requirements into customer experience requirements and work as liaison between IT and the business. Managed a team of content writers, analysts, information architects and client-side developers. Provides customer experience architecture and user-centered design requirements on all enterprise level web based projects and customer facing applications. Established the vision and roadmap for The Standard’s Internet, intranet and extranet properties. Head of Editorial & Content ING May 1999  –  December 2006  (7 years 8 months) Directed, published, and controlled public-facing web content (www.ing.com/us) and agent/broker extranet (virtual financial center). Oversaw, published, and managed the broker's extranet content, serving over 100,000 brokers and 20,000 pages of content. Created an enterprisewide Internet publishing strategy and workflow requirements; established corporate-adopted publishing procedures for content. Served as the primary liaison with separate business units interested in bringing new projects to the web space; acted as an e-business advocate to help units achieve their online objectives while maintaining the corporate brand. Headed the online brand voice and complete brand experience, working in concert with ING's overall $15-20M annual advertising budget. Defined, finalized, and secured legal approval for enterprisewide e-mail functionality requirements in compliance with federal CAN/SPAM laws. \n \nIdentified opportunities to promote business divisions in the online space. Edited existing content, hired and managed contract writers, maintained relationship with compliance. Drove content and UI experience for special projects such as e-Delivery and special online education projects. President Schmitt Performance Consultants January 1996  –  January 1999  (3 years 1 month) Secured new clients, drove business goals, analyzed client needs, proposed SOW, built a network of satisfied customers, and ensured top quality results for clients. Collaborated with more than 30 clients nationwide, assisting them in all forms of marketing communication and training development. Provided strategic marketing consulting to build more cohesive campaigns for individual clients. Facilitated senior-level sales management training seminars, which included coaching skills, performance appraisals, and hiring practices. Vice President US Bancorp Securities January 1994  –  January 1996  (2 years 1 month) Training & Marketing: Designed, developed, and delivered sales training programs for investment and retirement plan professionals and their managers at the bank, including over 100 brokers and 7 sales managers across five western states. Devised detailed marketing campaigns. Served as advertising principal for the investment group and managed NASD and SEC audits. Senior Trainer Marketing One January 1991  –  January 1994  (3 years 1 month) Provided in depth financial services sales and management training for various client institutions, including Wells Fargo, First Fidelity, Banco Popular, Bank of the West, and First Bank Systems. Trained 3,000+ sales professionals and 500 sales managers in all 50 states and Puerto Rico. Received numerous letters of commendation from company and individual clients for exemplary performance and superior training skills. Digital Marketing Program Manager Intel Corporation May 2013  – Present (2 years 4 months) Hillsboro, OR Managing and driving digital projects for Intel.com. Collaborate cross-functionally to assess business needs and current functionality aligning those against Intel's growth strategy in various critical markets. Defining and developing both short and long term digital experience for the US market and Intel's international online properties. Current focus includes Education market (www.intel.com/education), Maker initiative (maker.intel.com) and editorial support of Intel.com Home Page. Digital Marketing Program Manager Intel Corporation May 2013  – Present (2 years 4 months) Hillsboro, OR Managing and driving digital projects for Intel.com. Collaborate cross-functionally to assess business needs and current functionality aligning those against Intel's growth strategy in various critical markets. Defining and developing both short and long term digital experience for the US market and Intel's international online properties. Current focus includes Education market (www.intel.com/education), Maker initiative (maker.intel.com) and editorial support of Intel.com Home Page. President, Board of Directors Alliance Francaise de Portland January 2012  –  August 2013  (1 year 8 months) Portland, Oregon Area President, Board of Directors Alliance Francaise de Portland January 2012  –  August 2013  (1 year 8 months) Portland, Oregon Area Director of Services ParisCentral July 2012  –  February 2013  (8 months) Portland, OR Paris Central is a new online company bridging the gap between the old and new ways one can fully enjoy Paris. We are combining high-tech with high-touch wrapped in a rich user-driven community that delivers full-spectrum value for the product mix at Paris Central. I designed, developed and built www.pariscentral.com from the ground up. Determined content strategy and structure, functionality, user interface, wireframes, negotiated partnership engagements between US and Paris, wrote/edited all content, built out site on Drupal. Site experiences average visitor duration of over 10 minutes per visit. Director of Services ParisCentral July 2012  –  February 2013  (8 months) Portland, OR Paris Central is a new online company bridging the gap between the old and new ways one can fully enjoy Paris. We are combining high-tech with high-touch wrapped in a rich user-driven community that delivers full-spectrum value for the product mix at Paris Central. I designed, developed and built www.pariscentral.com from the ground up. Determined content strategy and structure, functionality, user interface, wireframes, negotiated partnership engagements between US and Paris, wrote/edited all content, built out site on Drupal. Site experiences average visitor duration of over 10 minutes per visit. Director, Marketing Programs, Corporate Marketing and Communications The Standard November 2010  –  March 2012  (1 year 5 months) Portland, Oregon Area Directed the marketing programs team for Corporate Marketing at The Standard. Managed a team of program managers serving all the marketing needs of 5 different business divisions and a budget of approx. $4 million annually. This includes all print and digital marketing materials, national trade shows, regional producer events, broker schools, numerous newsletters, campaign execution, webinars, email marketing, and all field communications and advisory committees. Streamlined marketing operations improving speed to market and transparency. Director, Marketing Programs, Corporate Marketing and Communications The Standard November 2010  –  March 2012  (1 year 5 months) Portland, Oregon Area Directed the marketing programs team for Corporate Marketing at The Standard. Managed a team of program managers serving all the marketing needs of 5 different business divisions and a budget of approx. $4 million annually. This includes all print and digital marketing materials, national trade shows, regional producer events, broker schools, numerous newsletters, campaign execution, webinars, email marketing, and all field communications and advisory committees. Streamlined marketing operations improving speed to market and transparency. Director of Production eBusiness Group, Corporate Marketing and Communications The Standard May 2008  –  November 2010  (2 years 7 months) Portland, Oregon Area Operationalized and managed all of The Standard’s public facing Internet and extranet properties. Led the redesign/rebuild of www.standard.com which included collapsing 11 siloed URLs into one unified presence and brand. Consolidated and managed rewrite of 2000 pieces of content into current state. Manage email/newsletter campaigns, wireframe development, microsite development, HTML/CSS templates, usability, user experience, UAT and production validation. Established operational and customer experience standards for all aspects of the web presentation layer. Translated business requirements into customer experience requirements and work as liaison between IT and the business. Managed a team of content writers, analysts, information architects and client-side developers. Provides customer experience architecture and user-centered design requirements on all enterprise level web based projects and customer facing applications. Established the vision and roadmap for The Standard’s Internet, intranet and extranet properties. Director of Production eBusiness Group, Corporate Marketing and Communications The Standard May 2008  –  November 2010  (2 years 7 months) Portland, Oregon Area Operationalized and managed all of The Standard’s public facing Internet and extranet properties. Led the redesign/rebuild of www.standard.com which included collapsing 11 siloed URLs into one unified presence and brand. Consolidated and managed rewrite of 2000 pieces of content into current state. Manage email/newsletter campaigns, wireframe development, microsite development, HTML/CSS templates, usability, user experience, UAT and production validation. Established operational and customer experience standards for all aspects of the web presentation layer. Translated business requirements into customer experience requirements and work as liaison between IT and the business. Managed a team of content writers, analysts, information architects and client-side developers. Provides customer experience architecture and user-centered design requirements on all enterprise level web based projects and customer facing applications. Established the vision and roadmap for The Standard’s Internet, intranet and extranet properties. Head of Editorial & Content ING May 1999  –  December 2006  (7 years 8 months) Directed, published, and controlled public-facing web content (www.ing.com/us) and agent/broker extranet (virtual financial center). Oversaw, published, and managed the broker's extranet content, serving over 100,000 brokers and 20,000 pages of content. Created an enterprisewide Internet publishing strategy and workflow requirements; established corporate-adopted publishing procedures for content. Served as the primary liaison with separate business units interested in bringing new projects to the web space; acted as an e-business advocate to help units achieve their online objectives while maintaining the corporate brand. Headed the online brand voice and complete brand experience, working in concert with ING's overall $15-20M annual advertising budget. Defined, finalized, and secured legal approval for enterprisewide e-mail functionality requirements in compliance with federal CAN/SPAM laws. \n \nIdentified opportunities to promote business divisions in the online space. Edited existing content, hired and managed contract writers, maintained relationship with compliance. Drove content and UI experience for special projects such as e-Delivery and special online education projects. Head of Editorial & Content ING May 1999  –  December 2006  (7 years 8 months) Directed, published, and controlled public-facing web content (www.ing.com/us) and agent/broker extranet (virtual financial center). Oversaw, published, and managed the broker's extranet content, serving over 100,000 brokers and 20,000 pages of content. Created an enterprisewide Internet publishing strategy and workflow requirements; established corporate-adopted publishing procedures for content. Served as the primary liaison with separate business units interested in bringing new projects to the web space; acted as an e-business advocate to help units achieve their online objectives while maintaining the corporate brand. Headed the online brand voice and complete brand experience, working in concert with ING's overall $15-20M annual advertising budget. Defined, finalized, and secured legal approval for enterprisewide e-mail functionality requirements in compliance with federal CAN/SPAM laws. \n \nIdentified opportunities to promote business divisions in the online space. Edited existing content, hired and managed contract writers, maintained relationship with compliance. Drove content and UI experience for special projects such as e-Delivery and special online education projects. President Schmitt Performance Consultants January 1996  –  January 1999  (3 years 1 month) Secured new clients, drove business goals, analyzed client needs, proposed SOW, built a network of satisfied customers, and ensured top quality results for clients. Collaborated with more than 30 clients nationwide, assisting them in all forms of marketing communication and training development. Provided strategic marketing consulting to build more cohesive campaigns for individual clients. Facilitated senior-level sales management training seminars, which included coaching skills, performance appraisals, and hiring practices. President Schmitt Performance Consultants January 1996  –  January 1999  (3 years 1 month) Secured new clients, drove business goals, analyzed client needs, proposed SOW, built a network of satisfied customers, and ensured top quality results for clients. Collaborated with more than 30 clients nationwide, assisting them in all forms of marketing communication and training development. Provided strategic marketing consulting to build more cohesive campaigns for individual clients. Facilitated senior-level sales management training seminars, which included coaching skills, performance appraisals, and hiring practices. Vice President US Bancorp Securities January 1994  –  January 1996  (2 years 1 month) Training & Marketing: Designed, developed, and delivered sales training programs for investment and retirement plan professionals and their managers at the bank, including over 100 brokers and 7 sales managers across five western states. Devised detailed marketing campaigns. Served as advertising principal for the investment group and managed NASD and SEC audits. Vice President US Bancorp Securities January 1994  –  January 1996  (2 years 1 month) Training & Marketing: Designed, developed, and delivered sales training programs for investment and retirement plan professionals and their managers at the bank, including over 100 brokers and 7 sales managers across five western states. Devised detailed marketing campaigns. Served as advertising principal for the investment group and managed NASD and SEC audits. Senior Trainer Marketing One January 1991  –  January 1994  (3 years 1 month) Provided in depth financial services sales and management training for various client institutions, including Wells Fargo, First Fidelity, Banco Popular, Bank of the West, and First Bank Systems. Trained 3,000+ sales professionals and 500 sales managers in all 50 states and Puerto Rico. Received numerous letters of commendation from company and individual clients for exemplary performance and superior training skills. Senior Trainer Marketing One January 1991  –  January 1994  (3 years 1 month) Provided in depth financial services sales and management training for various client institutions, including Wells Fargo, First Fidelity, Banco Popular, Bank of the West, and First Bank Systems. Trained 3,000+ sales professionals and 500 sales managers in all 50 states and Puerto Rico. Received numerous letters of commendation from company and individual clients for exemplary performance and superior training skills. Languages French Professional working proficiency French Professional working proficiency French Professional working proficiency Professional working proficiency Skills Strategic Planning Brand Management Team Leadership User-centered Design Usability Testing Talent Management Curating Marketing Communications Social Media Online Advertising Corporate Communications Digital Marketing Digital Strategy Email Marketing User Experience Marketing Strategy Advertising Web Analytics Leadership Business Analysis Brand Development Content Management Marketing Management Content Strategy Management Information Architecture Online Marketing E-commerce Training Cross-functional Team... Web Content Newsletters Editing Integrated Marketing Corporate Branding Strategic Partnerships SEM Web Content Management Program Management Process Improvement Marketing Strategy Enterprise Software Consulting See 29+     See less Skills  Strategic Planning Brand Management Team Leadership User-centered Design Usability Testing Talent Management Curating Marketing Communications Social Media Online Advertising Corporate Communications Digital Marketing Digital Strategy Email Marketing User Experience Marketing Strategy Advertising Web Analytics Leadership Business Analysis Brand Development Content Management Marketing Management Content Strategy Management Information Architecture Online Marketing E-commerce Training Cross-functional Team... Web Content Newsletters Editing Integrated Marketing Corporate Branding Strategic Partnerships SEM Web Content Management Program Management Process Improvement Marketing Strategy Enterprise Software Consulting See 29+     See less Strategic Planning Brand Management Team Leadership User-centered Design Usability Testing Talent Management Curating Marketing Communications Social Media Online Advertising Corporate Communications Digital Marketing Digital Strategy Email Marketing User Experience Marketing Strategy Advertising Web Analytics Leadership Business Analysis Brand Development Content Management Marketing Management Content Strategy Management Information Architecture Online Marketing E-commerce Training Cross-functional Team... Web Content Newsletters Editing Integrated Marketing Corporate Branding Strategic Partnerships SEM Web Content Management Program Management Process Improvement Marketing Strategy Enterprise Software Consulting See 29+     See less Strategic Planning Brand Management Team Leadership User-centered Design Usability Testing Talent Management Curating Marketing Communications Social Media Online Advertising Corporate Communications Digital Marketing Digital Strategy Email Marketing User Experience Marketing Strategy Advertising Web Analytics Leadership Business Analysis Brand Development Content Management Marketing Management Content Strategy Management Information Architecture Online Marketing E-commerce Training Cross-functional Team... Web Content Newsletters Editing Integrated Marketing Corporate Branding Strategic Partnerships SEM Web Content Management Program Management Process Improvement Marketing Strategy Enterprise Software Consulting See 29+     See less Education University of Connecticut Bachelor of Arts,  Communications Sciences 1984  – 1986 NASD Series 7, 24 Registered (currently in U-5 status due to lack of affiliation with a retail broker/dealer) The University of Connecticut B.A,  Communications Sciences 1983  – 1986 Juniata College 1981  – 1982 Manheim Township HS B.A.,  Communications Sci 1979  – 1982 University of Connecticut Bachelor of Arts,  Communications Sciences 1984  – 1986 NASD Series 7, 24 Registered (currently in U-5 status due to lack of affiliation with a retail broker/dealer) University of Connecticut Bachelor of Arts,  Communications Sciences 1984  – 1986 NASD Series 7, 24 Registered (currently in U-5 status due to lack of affiliation with a retail broker/dealer) University of Connecticut Bachelor of Arts,  Communications Sciences 1984  – 1986 NASD Series 7, 24 Registered (currently in U-5 status due to lack of affiliation with a retail broker/dealer) The University of Connecticut B.A,  Communications Sciences 1983  – 1986 The University of Connecticut B.A,  Communications Sciences 1983  – 1986 The University of Connecticut B.A,  Communications Sciences 1983  – 1986 Juniata College 1981  – 1982 Juniata College 1981  – 1982 Juniata College 1981  – 1982 Manheim Township HS B.A.,  Communications Sci 1979  – 1982 Manheim Township HS B.A.,  Communications Sci 1979  – 1982 Manheim Township HS B.A.,  Communications Sci 1979  – 1982 Honors & Awards Additional Honors & Awards ING Circle of Honor (Money Mentor Project) \nThe Standard Ovation (twice) Additional Honors & Awards ING Circle of Honor (Money Mentor Project) \nThe Standard Ovation (twice) Additional Honors & Awards ING Circle of Honor (Money Mentor Project) \nThe Standard Ovation (twice) Additional Honors & Awards ING Circle of Honor (Money Mentor Project) \nThe Standard Ovation (twice) ", "Skills Demand Generation Lead Generation Enterprise Software Product Marketing SaaS Go-to-market Strategy Product Management Strategic Partnerships Analytics Business Development Sales Enablement Marketing Strategy Multi-channel Marketing Analyst Relations Solution Selling B2B Marketing B2B CRM Retail New Business Development Strategy Sales Operations Marketing Cross-functional Team... Start-ups Product Launch Leadership Market Analysis Product Development Management Direct Marketing Contract Negotiation Brand Management Market Research See 19+     See less Skills  Demand Generation Lead Generation Enterprise Software Product Marketing SaaS Go-to-market Strategy Product Management Strategic Partnerships Analytics Business Development Sales Enablement Marketing Strategy Multi-channel Marketing Analyst Relations Solution Selling B2B Marketing B2B CRM Retail New Business Development Strategy Sales Operations Marketing Cross-functional Team... Start-ups Product Launch Leadership Market Analysis Product Development Management Direct Marketing Contract Negotiation Brand Management Market Research See 19+     See less Demand Generation Lead Generation Enterprise Software Product Marketing SaaS Go-to-market Strategy Product Management Strategic Partnerships Analytics Business Development Sales Enablement Marketing Strategy Multi-channel Marketing Analyst Relations Solution Selling B2B Marketing B2B CRM Retail New Business Development Strategy Sales Operations Marketing Cross-functional Team... Start-ups Product Launch Leadership Market Analysis Product Development Management Direct Marketing Contract Negotiation Brand Management Market Research See 19+     See less Demand Generation Lead Generation Enterprise Software Product Marketing SaaS Go-to-market Strategy Product Management Strategic Partnerships Analytics Business Development Sales Enablement Marketing Strategy Multi-channel Marketing Analyst Relations Solution Selling B2B Marketing B2B CRM Retail New Business Development Strategy Sales Operations Marketing Cross-functional Team... Start-ups Product Launch Leadership Market Analysis Product Development Management Direct Marketing Contract Negotiation Brand Management Market Research See 19+     See less ", "Skills Digital Marketing Product Marketing Strategic Partnerships Business Strategy Business Development Semiconductors Corporate Communications Program Management Social Media Marketing Strategic Planning Product Management Marketing Management Product Launch Project Management Strategy Training Creative Direction Advertising Marketing Strategy Competitive Analysis See 6+     See less Skills  Digital Marketing Product Marketing Strategic Partnerships Business Strategy Business Development Semiconductors Corporate Communications Program Management Social Media Marketing Strategic Planning Product Management Marketing Management Product Launch Project Management Strategy Training Creative Direction Advertising Marketing Strategy Competitive Analysis See 6+     See less Digital Marketing Product Marketing Strategic Partnerships Business Strategy Business Development Semiconductors Corporate Communications Program Management Social Media Marketing Strategic Planning Product Management Marketing Management Product Launch Project Management Strategy Training Creative Direction Advertising Marketing Strategy Competitive Analysis See 6+     See less Digital Marketing Product Marketing Strategic Partnerships Business Strategy Business Development Semiconductors Corporate Communications Program Management Social Media Marketing Strategic Planning Product Management Marketing Management Product Launch Project Management Strategy Training Creative Direction Advertising Marketing Strategy Competitive Analysis See 6+     See less ", "Languages English English English Skills Cross-functional Team... PMP Program Management Project Management Business Process Risk Management Product Lifecycle... Semiconductors Manufacturing Process Improvement Project Planning Intel Go-to-market Strategy MS Project Product Development Business Process... CRM Microsoft Project See 3+     See less Skills  Cross-functional Team... PMP Program Management Project Management Business Process Risk Management Product Lifecycle... Semiconductors Manufacturing Process Improvement Project Planning Intel Go-to-market Strategy MS Project Product Development Business Process... CRM Microsoft Project See 3+     See less Cross-functional Team... PMP Program Management Project Management Business Process Risk Management Product Lifecycle... Semiconductors Manufacturing Process Improvement Project Planning Intel Go-to-market Strategy MS Project Product Development Business Process... CRM Microsoft Project See 3+     See less Cross-functional Team... PMP Program Management Project Management Business Process Risk Management Product Lifecycle... Semiconductors Manufacturing Process Improvement Project Planning Intel Go-to-market Strategy MS Project Product Development Business Process... CRM Microsoft Project See 3+     See less ", "Experience Retail Marketing program manager Intel Corporation December 2011  – Present (3 years 9 months) In-store marketing at electronic retailers . Training and educating Sales staff in key technologies for Intel based processors  Marketing Exe JACKYS ELECTRONICS July 2007  –  December 2011  (4 years 6 months) Branding and Marketing activities for all Jacky's outlets marketing executive JACKYS ELECTRONICS July 2007  –  November 2011  (4 years 5 months) Accumulate branding income for the company . By selling retail space at showrooms. \nBringing in new brands by selling prominent locations at the retail stores. \nworked on the entire Jacky's branding during key sales cycles like DSF/DSS/Gitex/Festival offers etc . \nDriven Marketing ideas instores during key sale cycles. \n Retail Marketing program manager Intel Corporation December 2011  – Present (3 years 9 months) In-store marketing at electronic retailers . Training and educating Sales staff in key technologies for Intel based processors  Retail Marketing program manager Intel Corporation December 2011  – Present (3 years 9 months) In-store marketing at electronic retailers . Training and educating Sales staff in key technologies for Intel based processors  Marketing Exe JACKYS ELECTRONICS July 2007  –  December 2011  (4 years 6 months) Branding and Marketing activities for all Jacky's outlets Marketing Exe JACKYS ELECTRONICS July 2007  –  December 2011  (4 years 6 months) Branding and Marketing activities for all Jacky's outlets marketing executive JACKYS ELECTRONICS July 2007  –  November 2011  (4 years 5 months) Accumulate branding income for the company . By selling retail space at showrooms. \nBringing in new brands by selling prominent locations at the retail stores. \nworked on the entire Jacky's branding during key sales cycles like DSF/DSS/Gitex/Festival offers etc . \nDriven Marketing ideas instores during key sale cycles. \n marketing executive JACKYS ELECTRONICS July 2007  –  November 2011  (4 years 5 months) Accumulate branding income for the company . By selling retail space at showrooms. \nBringing in new brands by selling prominent locations at the retail stores. \nworked on the entire Jacky's branding during key sales cycles like DSF/DSS/Gitex/Festival offers etc . \nDriven Marketing ideas instores during key sale cycles. \n Languages Hindi Telugu Hindi Telugu Hindi Telugu Skills Marketing Product Marketing Competitive Analysis Marketing Management Product Management Marketing Strategy Key Account Management Business Development Market Research Brand Management Team Management New Business Development Online Marketing Marketing Communications Sales Management CRM Online Advertising Digital Marketing Sales Product Development See 5+     See less Skills  Marketing Product Marketing Competitive Analysis Marketing Management Product Management Marketing Strategy Key Account Management Business Development Market Research Brand Management Team Management New Business Development Online Marketing Marketing Communications Sales Management CRM Online Advertising Digital Marketing Sales Product Development See 5+     See less Marketing Product Marketing Competitive Analysis Marketing Management Product Management Marketing Strategy Key Account Management Business Development Market Research Brand Management Team Management New Business Development Online Marketing Marketing Communications Sales Management CRM Online Advertising Digital Marketing Sales Product Development See 5+     See less Marketing Product Marketing Competitive Analysis Marketing Management Product Management Marketing Strategy Key Account Management Business Development Market Research Brand Management Team Management New Business Development Online Marketing Marketing Communications Sales Management CRM Online Advertising Digital Marketing Sales Product Development See 5+     See less Education LOYOLA ACADEMY  Bachelor's degree in Marketing / Advertising / Sales ,  Marketing/Marketing Management , General 2003  – 2006 St Johns india bachelors in advertising,  Marketing/ advertising 1997  – 2000 LOYOLA ACADEMY  Bachelor's degree in Marketing / Advertising / Sales ,  Marketing/Marketing Management , General 2003  – 2006 LOYOLA ACADEMY  Bachelor's degree in Marketing / Advertising / Sales ,  Marketing/Marketing Management , General 2003  – 2006 LOYOLA ACADEMY  Bachelor's degree in Marketing / Advertising / Sales ,  Marketing/Marketing Management , General 2003  – 2006 St Johns india bachelors in advertising,  Marketing/ advertising 1997  – 2000 St Johns india bachelors in advertising,  Marketing/ advertising 1997  – 2000 St Johns india bachelors in advertising,  Marketing/ advertising 1997  – 2000 "]}