{"position": "Marketing", "company": "Intel Corporation", "profiles": ["Skills Market Planning Integrated Marketing Web Analytics Competitive Analysis Media Planning Partner Marketing Primary Research Product Messaging Cloud Computing... New Business Development Rich Media Content... Content Strategy Partnership Marketing Affiliate Marketing Messaging Enterprise Software B2B Interactive Media... B2B Marketing Strategy Consumer Marketing Demand Generation Marketing Product Marketing Strategic Partnerships Marketing Strategy See 10+     See less Skills  Market Planning Integrated Marketing Web Analytics Competitive Analysis Media Planning Partner Marketing Primary Research Product Messaging Cloud Computing... New Business Development Rich Media Content... Content Strategy Partnership Marketing Affiliate Marketing Messaging Enterprise Software B2B Interactive Media... B2B Marketing Strategy Consumer Marketing Demand Generation Marketing Product Marketing Strategic Partnerships Marketing Strategy See 10+     See less Market Planning Integrated Marketing Web Analytics Competitive Analysis Media Planning Partner Marketing Primary Research Product Messaging Cloud Computing... New Business Development Rich Media Content... Content Strategy Partnership Marketing Affiliate Marketing Messaging Enterprise Software B2B Interactive Media... B2B Marketing Strategy Consumer Marketing Demand Generation Marketing Product Marketing Strategic Partnerships Marketing Strategy See 10+     See less Market Planning Integrated Marketing Web Analytics Competitive Analysis Media Planning Partner Marketing Primary Research Product Messaging Cloud Computing... New Business Development Rich Media Content... Content Strategy Partnership Marketing Affiliate Marketing Messaging Enterprise Software B2B Interactive Media... B2B Marketing Strategy Consumer Marketing Demand Generation Marketing Product Marketing Strategic Partnerships Marketing Strategy See 10+     See less ", "Languages Spanish Spanish Spanish Skills Social Media Marketing Communications Social Media Marketing Product Marketing Marketing Project Management Strategic Planning Management Program Management Marketing Strategy Digital Marketing Channel Intel Integrated Marketing Email Marketing Online Advertising Online Marketing Web Analytics Editing Branding & Identity Strategic Partnerships Lead Generation Google Analytics Multi-channel Marketing CRM Account Management Go-to-market Strategy See 12+     See less Skills  Social Media Marketing Communications Social Media Marketing Product Marketing Marketing Project Management Strategic Planning Management Program Management Marketing Strategy Digital Marketing Channel Intel Integrated Marketing Email Marketing Online Advertising Online Marketing Web Analytics Editing Branding & Identity Strategic Partnerships Lead Generation Google Analytics Multi-channel Marketing CRM Account Management Go-to-market Strategy See 12+     See less Social Media Marketing Communications Social Media Marketing Product Marketing Marketing Project Management Strategic Planning Management Program Management Marketing Strategy Digital Marketing Channel Intel Integrated Marketing Email Marketing Online Advertising Online Marketing Web Analytics Editing Branding & Identity Strategic Partnerships Lead Generation Google Analytics Multi-channel Marketing CRM Account Management Go-to-market Strategy See 12+     See less Social Media Marketing Communications Social Media Marketing Product Marketing Marketing Project Management Strategic Planning Management Program Management Marketing Strategy Digital Marketing Channel Intel Integrated Marketing Email Marketing Online Advertising Online Marketing Web Analytics Editing Branding & Identity Strategic Partnerships Lead Generation Google Analytics Multi-channel Marketing CRM Account Management Go-to-market Strategy See 12+     See less ", "Summary Well-rounded business and marketing professional with progressively increasing experience spanning program and project management, product and product line management, strategic planning, outbound marketing, partner marketing, industry marketing, geography marketing, and product launch and go-to-market activities. Familiar with and possess demonstrated success in both entrepreneurial and \"intra-preneurial\" environments. Strong business acumen leading product lines with significant revenue ($10-100M) and administering multi-milion dollar outbound, partner and industry marketing budgets. Trained spokesperson, with excellent written and verbal communication skills. Trusted and respected team leader, with consistently strong and positive employee feedback from formal leadership surveys and on a day-to-day basis. I thrive in an environment where I am able to collaborate, motivate and inspire others to achieve success while having fun and feeling a sense of empowerment as they do it. Summary Well-rounded business and marketing professional with progressively increasing experience spanning program and project management, product and product line management, strategic planning, outbound marketing, partner marketing, industry marketing, geography marketing, and product launch and go-to-market activities. Familiar with and possess demonstrated success in both entrepreneurial and \"intra-preneurial\" environments. Strong business acumen leading product lines with significant revenue ($10-100M) and administering multi-milion dollar outbound, partner and industry marketing budgets. Trained spokesperson, with excellent written and verbal communication skills. Trusted and respected team leader, with consistently strong and positive employee feedback from formal leadership surveys and on a day-to-day basis. I thrive in an environment where I am able to collaborate, motivate and inspire others to achieve success while having fun and feeling a sense of empowerment as they do it. Well-rounded business and marketing professional with progressively increasing experience spanning program and project management, product and product line management, strategic planning, outbound marketing, partner marketing, industry marketing, geography marketing, and product launch and go-to-market activities. Familiar with and possess demonstrated success in both entrepreneurial and \"intra-preneurial\" environments. Strong business acumen leading product lines with significant revenue ($10-100M) and administering multi-milion dollar outbound, partner and industry marketing budgets. Trained spokesperson, with excellent written and verbal communication skills. Trusted and respected team leader, with consistently strong and positive employee feedback from formal leadership surveys and on a day-to-day basis. I thrive in an environment where I am able to collaborate, motivate and inspire others to achieve success while having fun and feeling a sense of empowerment as they do it. Well-rounded business and marketing professional with progressively increasing experience spanning program and project management, product and product line management, strategic planning, outbound marketing, partner marketing, industry marketing, geography marketing, and product launch and go-to-market activities. Familiar with and possess demonstrated success in both entrepreneurial and \"intra-preneurial\" environments. Strong business acumen leading product lines with significant revenue ($10-100M) and administering multi-milion dollar outbound, partner and industry marketing budgets. Trained spokesperson, with excellent written and verbal communication skills. Trusted and respected team leader, with consistently strong and positive employee feedback from formal leadership surveys and on a day-to-day basis. I thrive in an environment where I am able to collaborate, motivate and inspire others to achieve success while having fun and feeling a sense of empowerment as they do it. Experience Director of Marketing, Consumer Application Showcasing Intel Corporation December 2011  – Present (3 years 9 months) Director of Marketing, Consumer App Showcasing, Ultrabook™, PC Client and Tablet, Software and Services Group. Responsible for software partner marketing, geography marketing and industry marketing activities in support of Intel Ultrabook™, PC client and Android tablets. These activities are designed to highlight key Intel platform capabilities exposed through software, including touch, sensor, Intel® Iris™ graphics, Intel® Quick Sync™ Video, WiDi, and more. Planned and executed numerous software marketing activities (such as online contests, events, bundles) with leading gaming, creativity and productivity accounts (examples include Cyberlink, Magix, Blizzard, Codemasters, StarChart, TeamViewer). Pioneered Intel's worldwide use of 'software starter packs' as a consumer purchase incentive: Consumers benefit because they receive valuable software apps free with their purchase of select devices with Intel Inside; software partners gain broad exposure and expand their installed base; and Intel and its retail, OEM and channel partners benefit through increased sales. In addition to expanding the worldwide retail footprint for these software-driven promotions (Best Buy, Amazon, B2W, WalMart Mexico, Harvey Norman, Elkjop and others), my team expanded support to address OEM software promotion opportunities with Samsung, Acer, Lenovo and Asus. Administer a multi-million doallar marketing budget. As a team leader, I consistently recieved strong Manager Feedback Tool (MFT) scores from employees throughout this time and in prior years, reflecting team confidence in my management and leadership style. Director of Marketing, Visual Computing Software Intel Corporation September 2007  –  November 2011  (4 years 3 months) Director of Marketing, Visual Computing Software, Software and Services Group. Responsible for industry and partner marketing, as well as software tools go-to-market (GTM) activities in support of Intel® processors, Intel® Graphics and Intel’s planned “Larrabee” architecture. Defined and delivered industry-facing “Visual Adrenaline” campaign, consisting of Intel® Visual Adrenaline Magazine (print and electronic); electronic direct marketing; content and collateral (articles, videos); events; online content syndication; and Intel’s first cross-platform mobile app (Intel VA app) for iOS, Android and later Win8 mobile devices. Planned and executed many software partner activities worldwide with leading publishers including Activision, Atari, Blizzard, Codemasters, Cyberlink, Sega, Ubisoft and many others. Maintained software marketing responsibility for our relationship with DreamWorks Animation. Provided GTM support for graphics software tools such as Intel® Graphics Performance Analyzers and Intel® Media SDK, which allowed app developers to directly support Intel® Quick Sync Video and other Intel® Graphics capabilities. Provided marketing and deal support to key Larrabee enabling agreements with leading game publishers. Marketing Programs Manager, Microsoft Partner Marketing Intel Corporation October 2006  –  August 2007  (11 months) Point owner for Intel’s role in Microsoft’s Vista operating system launch. Together with Microsoft, developed joint messaging framework and messages (“More Performance. More Possibilities.”) for both business and consumer launches; planned, coordinated and executed Intel’s presence in Microsoft’s launch activities, including executive appearances at the Nasdaq “Business Value” launch, and later at Microsoft’s NYC “General Availability” launch event featuring Intel’s Sean Maloney, plus executives from rival AMD and partners Dell, HP and Toshiba. Additionally played a key role in aligning Intel and Microsoft support for a “Dream PC” joint development with computer maker Gateway. This All-in-One PC project involved significant coordination among multiple groups and executives in all three companies. Staff Marketing Manager, SSG Group Marketing, Central Marketing Services Intel Corporation April 2006  –  September 2006  (6 months) Manager of outbound marketing team responsible for raising awareness of Intel’s role in the software industry among developers, influencers and decision makers. Methods included online campaigns (“There’s More” launched July 2006), publications (Intel® Software Adrenaline Magazine), industry proof points, electronic direct marketing, and primary research to assess audience awareness. Additionally responsible for development, testing, use and maintenance of key messages for SSG and its Intel® Software brand. Strategic Marketing Manager, Consumer Electronics Group Intel Corporation October 2003  –  March 2006  (2 years 6 months) Responsible for strategic, business and market analysis across a variety of consumer electronics segments, including DVD, digital television, set top box, digital still and video camera and adjacent AC and DC-powered consumer electronics segments. Drafted and delivered Intel CEG high-level business plan, including business opportunity, environmental trends, competitive and gap analysis, strategy pillars, and more. Performed detailed consumer electronics revenue growth options analysis, IP gap analysis and make vs buy analysis and recommendations for executive review and ratification. Defined and led cross-group, cross-function effort to identify ‘whole is greater than the sum of the parts’ opportunities for Intel in the emerging ‘digital home’, with emphasis on Intel-based networked consumer electronics platforms (DTV, STB, DMR) and their interaction with other PC and CE devices in the networked digital home. Analyzed if, where and how certain Intel core technologies should be extended into the digital home, and co-led a corporate strategic discussion with Intel’s executive team resulting in successful review and ratification of the same. Recognized as an in-house leader in strategy development, emerging consumer usage models, and new business and market analysis. Strategic Marketing Manager, Advanced Media Processor Operation, Broadband Products Group Intel Corporation October 2002  –  September 2003  (1 year) Researched and guided business and product direction to extend new digital media processor technology into consumer electronics products. This work fueled BPG’s consumer electronics silicon opportunity analysis throughout H103; supported Intel’s corporate-level digital home Strategic Long Range Planning (SLRP) process; and directly contributed to the Product Line Business Plan (PLBP) of Intel’s Consumer Electronics Group. In addition to understanding present and future opportunities in a variety of CE segments, I prepared the concept approval / development investment approval (CA/DIA) analysis to identify attractive consumer electronics entry points for Intel based on market trends, technology fit and overall business opportunity. In addition, I planned and led the September 2003 launch of the new Intel® MXP5800 and MXP5400 Digital Media Processors, including product key messages, keynote demo placement at Intel Developer Forum, and press and industry analyst briefings, in close cooperation with Xerox Corporation (as both a co-developer of the technology and as an important customer). The launch achieved its stated objectives of raising industry awareness (attract new customers); demonstrating Intel commitment (reinforce existing/in-process wins); and achieving positive press and analyst coverage (amplify our product and technology key messages). Strategic Marketing Manager, Advanced Imaging Team, Desktop Architecture Lab Intel Corporation May 2002  –  September 2002  (5 months) Completed and delivered market and business plan to carry a lab-based digital media processor technology development effort forward as a new Intel silicon business targeted initially at the document imaging market. Successfully secured funding and headcount to proceed, in spite of challenging corporate business climate. Business Segment Manager, Intel® Play™ PC Enhanced Technology Toys Intel Corporation May 2000  –  March 2002  (1 year 11 months) Reporting to Vice President, Connected Products Division, I rebuilt the Intel Play team and business as an Intel-only effort upon Mattel’s exit from our joint venture. Re-modeled business with 5-year business plan, high-level roadmap, revised product and brand objectives, and expanded retail channel presence. Managed a team of direct and matrix reports averaging over 35 people. Responsible for multi-million dollar P&L, including product development, marketing, personnel, spending, sales forecast and revenue. Successfully debuted Intel-only product line at American International Toy Fair in 2001, engaging key retailers and generating strong endorsement for Intel’s participation in the tech toy market. Launched the new Intel® Play™ Digital Movie Creator into a market where retailer forecasts exceeded our supply, all the while garnering glowing product reviews and awards in leading consumer publications. Executed Holiday 2001 sales and marketing programs with major presence in all leading toy, mass-merchant and consumer electronics outlets. Key contributor to Intel’s New Business Group Strategic Long Range Planning and Product Line Business Planning processes, providing company-level strategic recommendations for Intel’s future efforts in developing and diffusing consumer technologies and products that drive preference for Intel Architecture in the marketplace. Director, Intel Smart Toy Lab Intel Corporation June 1999  –  May 2000  (1 year) Co-directed unique joint venture with Mattel, Inc., to develop and launch Intel® \nPlay™ line of PC-connected technology toys. Responsibilities encompassed all Intel-specific \naspects of joint venture, as well as jointly shared business, product and marketing decisions. \nSuccessfully launched Intel® Play™ QX3™ Computer Microscope, which achieved #1 unit and \nrevenue share in its category. Directly managed Intel’s development team at remotely-located \nfacility. Contributed to Intel’s strategic effort to extend its brand to consumers in the home through \nnumerous positive press, analyst and product reviews and awards. Drove and completed formal \nexit negotiations in conjunction with Mattel’s decision to exit the PC software business and firesale \nThe Learning Company / Mattel Media division. Product Manager, Digital Imaging and Video Division Intel Corporation January 1997  –  June 1999  (2 years 6 months) Focal point for Intel® Create & ShareTM Camera Pack branded consumer retail \nproduct line. Responsibilities included all aspects of product line management, including: \nforecasting product demand; overseeing new product development; managing product transition \nand EOL; defining/executing marketing programs; developing product roadmap; driving product \nline business planning; serving as primary press spokesperson; and more. Position involved high \ndegree of cross-functional and multi-level interaction with various groups, both internal and \nexternal, including engineering, manufacturing, sales, marketing, channel, web, support, finance, \nlegal, PR, localization/international, and more. Managed a product line team consisting of \nmarketing programs managers, PMEs, and TMEs in support of product line business objectives. In addition to widespread and positive product coverage in consumer and trade press, we achieved \nand maintained market segment share leadership in the USB tethered PC camera market. Further, \ncustomer satisfaction was high as measured by numerous customer surveys. Project Manager, Systems Manufacturing Technology Development Intel Corporation November 1995  –  January 1997  (1 year 3 months) Reporting to the General Manager of Intel’s SMTD/OPPS Division with dotted-line reporting to \nGeneral Manager of Mobile Modules Operations Business Unit, I held primary responsibility for \nplanning and managing the launch of MMO’s future products into Intel factories. In this role, I \nworked with business unit and production/operations team members to identify and develop new \nmanufacturing, test, prototype, equipment and process needs. In addition, I directly managed \nMaterials Program Managers and Manufacturing Engineers to support MMO / SMTD objectives. Program Manager, Portables Business Unit Gateway 1994  –  1995  (1 year) Sioux City, Iowa Area Lead Program Manager for Gateway 2000’s Portables Team. In this leading and visible role, I held primary responsibility for planning, managing, and executing all portables product line new product \nintroductions. Accomplishments include successfully launching Gateway 2000’s “Liberty” and \n“ColorBook2” product families, while managing the phaseout of the older “Handbook” and first \ngeneration “Colorbook” products. Prior to leaving Gateway 2000, I laid the foundation for the Fall \n1995 launch of the now-successful “Solo” Pentium-based multimedia notebook computer family \nand its accessories. In addition to directly managing the portables Program Management team in \nsupport of new product introductions, I worked closely with Asian business partners, suppliers, \nPurchasing, Engineering, Manufacturing, Sales, and Customer Support to coordinate product \nintroductions and transitions, as well as to maintain smooth day-to-day operations. Principal Abbate Video, Inc. 1992  –  1994  (2 years) Greater Boston Area Owner, co-founder and primary business / operations manager of this self-financed multimedia software developer. Primary product line called VideoToolkitTM, a highly acclaimed desktop video editing and digital moviemaking package for Macintosh and IBM-compatible computers. Responsibilities encompassed all aspects of product and business development, including product definition, advertising, catalog placement, direct mail, editorial contact, licensing patented technology to developers, and more. Accomplishments included: signing software bundling agreement with RasterOps Corporation, a leading Macintosh monitor and digitizer board supplier; obtaining product placement in leading computer software catalogs, including Tiger Software (catalog circulation 1.25 million), Dr. Mac, Educational Resources, and more; maintaining strong awareness through consistent editorial contact and product reviews in leading computer, trade and consumer publications, including Macworld Magazine, Videomaker Magazine, Video Magazine, more; and negotiating, licensing or otherwise co-promoting our products and technology to present and future business partners. In 1995, Abbate Video, Inc., was acquired by Videonics, Inc., a leading supplier of video editing and effects hardware to the consumer and “prosumer” markets. The VideoToolkit product family and core technology facilitated Videonics’ entry into the computer-based desktop video editing arena. Program Manager Zenith Data Systems / Groupe Bull 1990  –  1992  (2 years) Benton Harbor, Michigan Area Held primary program management responsibility for most aspects of notebook computer development at this leading personal computer manufacturer. This highly visible position required clear understanding of overall product development process; interaction with virtually all departments, from production floor through top corporate management; responsibility for establishing, maintaining and measuring product development schedule; and frequent international travel and direct coordination of ZDS activities with those of our Asian business and product development partners. Key accomplishment: successfully managed ZDS’ most visible and most advanced notebook computer project to date, resulting in virtually on-time first customer shipment of the industry’s first notebook computer based on Intel’s I-386SL chipset, the ZDS MastersPort 386SL. Also supported or managed SupersPort, MinisPort, TurbosPort, and MastersPort portable computer product families. OEM Systems Engineer Zenith Data Systems 1989  –  1990  (1 year) Benton Harbor, Michigan Area Working closely with Program Management and National Account Managers, I was responsible for both technical and cosmetic customization of ZDS’ commercial products to meet specific requirements of large national and international OEM customers. This position required interaction with, and knowledge of many departments and functions, including regulatory compliance, design engineering, QA, purchasing, manufacturing, and more. In this capacity, I had primary responsibility for maintaining ZDS’ single largest OEM portable and notebook computer account with Honeywell Bull, involving over 10,000 portable computer supplied in turn to Metropolitan Life Insurance Company. This position also involved international travel, and direct contact with ZDS’ future \nparent company, Groupe Bull. Technical Writer Heath Company / Zenith Data Systems 1986  –  1989  (3 years) Benton Harbor, Michigan Area Researched and authored Service Manuals, Technical Manuals, and User’s Guides for portable and desktop computers and video monitors. The department editor frequently commented, “I hate editing your manuscripts, Abbate. I can never find anything wrong with them.” Teaching Assistant, University of Detroit University of Detroit Mercy 1985  –  1986  (1 year) Greater Detroit Area Conducted labs, lectured students, and graded assignments while completing undergraduate degree. Systems Engineer, Voice of America (US Government) Voice of America 1984  –  1985  (1 year) Washington D.C. Metro Area Devised, performed, and documented tests on broadcast studio and high-power transmitter facilities as a Co-Op engineer. Involved domestic and international travel. Director of Marketing, Consumer Application Showcasing Intel Corporation December 2011  – Present (3 years 9 months) Director of Marketing, Consumer App Showcasing, Ultrabook™, PC Client and Tablet, Software and Services Group. Responsible for software partner marketing, geography marketing and industry marketing activities in support of Intel Ultrabook™, PC client and Android tablets. These activities are designed to highlight key Intel platform capabilities exposed through software, including touch, sensor, Intel® Iris™ graphics, Intel® Quick Sync™ Video, WiDi, and more. Planned and executed numerous software marketing activities (such as online contests, events, bundles) with leading gaming, creativity and productivity accounts (examples include Cyberlink, Magix, Blizzard, Codemasters, StarChart, TeamViewer). Pioneered Intel's worldwide use of 'software starter packs' as a consumer purchase incentive: Consumers benefit because they receive valuable software apps free with their purchase of select devices with Intel Inside; software partners gain broad exposure and expand their installed base; and Intel and its retail, OEM and channel partners benefit through increased sales. In addition to expanding the worldwide retail footprint for these software-driven promotions (Best Buy, Amazon, B2W, WalMart Mexico, Harvey Norman, Elkjop and others), my team expanded support to address OEM software promotion opportunities with Samsung, Acer, Lenovo and Asus. Administer a multi-million doallar marketing budget. As a team leader, I consistently recieved strong Manager Feedback Tool (MFT) scores from employees throughout this time and in prior years, reflecting team confidence in my management and leadership style. Director of Marketing, Consumer Application Showcasing Intel Corporation December 2011  – Present (3 years 9 months) Director of Marketing, Consumer App Showcasing, Ultrabook™, PC Client and Tablet, Software and Services Group. Responsible for software partner marketing, geography marketing and industry marketing activities in support of Intel Ultrabook™, PC client and Android tablets. These activities are designed to highlight key Intel platform capabilities exposed through software, including touch, sensor, Intel® Iris™ graphics, Intel® Quick Sync™ Video, WiDi, and more. Planned and executed numerous software marketing activities (such as online contests, events, bundles) with leading gaming, creativity and productivity accounts (examples include Cyberlink, Magix, Blizzard, Codemasters, StarChart, TeamViewer). Pioneered Intel's worldwide use of 'software starter packs' as a consumer purchase incentive: Consumers benefit because they receive valuable software apps free with their purchase of select devices with Intel Inside; software partners gain broad exposure and expand their installed base; and Intel and its retail, OEM and channel partners benefit through increased sales. In addition to expanding the worldwide retail footprint for these software-driven promotions (Best Buy, Amazon, B2W, WalMart Mexico, Harvey Norman, Elkjop and others), my team expanded support to address OEM software promotion opportunities with Samsung, Acer, Lenovo and Asus. Administer a multi-million doallar marketing budget. As a team leader, I consistently recieved strong Manager Feedback Tool (MFT) scores from employees throughout this time and in prior years, reflecting team confidence in my management and leadership style. Director of Marketing, Visual Computing Software Intel Corporation September 2007  –  November 2011  (4 years 3 months) Director of Marketing, Visual Computing Software, Software and Services Group. Responsible for industry and partner marketing, as well as software tools go-to-market (GTM) activities in support of Intel® processors, Intel® Graphics and Intel’s planned “Larrabee” architecture. Defined and delivered industry-facing “Visual Adrenaline” campaign, consisting of Intel® Visual Adrenaline Magazine (print and electronic); electronic direct marketing; content and collateral (articles, videos); events; online content syndication; and Intel’s first cross-platform mobile app (Intel VA app) for iOS, Android and later Win8 mobile devices. Planned and executed many software partner activities worldwide with leading publishers including Activision, Atari, Blizzard, Codemasters, Cyberlink, Sega, Ubisoft and many others. Maintained software marketing responsibility for our relationship with DreamWorks Animation. Provided GTM support for graphics software tools such as Intel® Graphics Performance Analyzers and Intel® Media SDK, which allowed app developers to directly support Intel® Quick Sync Video and other Intel® Graphics capabilities. Provided marketing and deal support to key Larrabee enabling agreements with leading game publishers. Director of Marketing, Visual Computing Software Intel Corporation September 2007  –  November 2011  (4 years 3 months) Director of Marketing, Visual Computing Software, Software and Services Group. Responsible for industry and partner marketing, as well as software tools go-to-market (GTM) activities in support of Intel® processors, Intel® Graphics and Intel’s planned “Larrabee” architecture. Defined and delivered industry-facing “Visual Adrenaline” campaign, consisting of Intel® Visual Adrenaline Magazine (print and electronic); electronic direct marketing; content and collateral (articles, videos); events; online content syndication; and Intel’s first cross-platform mobile app (Intel VA app) for iOS, Android and later Win8 mobile devices. Planned and executed many software partner activities worldwide with leading publishers including Activision, Atari, Blizzard, Codemasters, Cyberlink, Sega, Ubisoft and many others. Maintained software marketing responsibility for our relationship with DreamWorks Animation. Provided GTM support for graphics software tools such as Intel® Graphics Performance Analyzers and Intel® Media SDK, which allowed app developers to directly support Intel® Quick Sync Video and other Intel® Graphics capabilities. Provided marketing and deal support to key Larrabee enabling agreements with leading game publishers. Marketing Programs Manager, Microsoft Partner Marketing Intel Corporation October 2006  –  August 2007  (11 months) Point owner for Intel’s role in Microsoft’s Vista operating system launch. Together with Microsoft, developed joint messaging framework and messages (“More Performance. More Possibilities.”) for both business and consumer launches; planned, coordinated and executed Intel’s presence in Microsoft’s launch activities, including executive appearances at the Nasdaq “Business Value” launch, and later at Microsoft’s NYC “General Availability” launch event featuring Intel’s Sean Maloney, plus executives from rival AMD and partners Dell, HP and Toshiba. Additionally played a key role in aligning Intel and Microsoft support for a “Dream PC” joint development with computer maker Gateway. This All-in-One PC project involved significant coordination among multiple groups and executives in all three companies. Marketing Programs Manager, Microsoft Partner Marketing Intel Corporation October 2006  –  August 2007  (11 months) Point owner for Intel’s role in Microsoft’s Vista operating system launch. Together with Microsoft, developed joint messaging framework and messages (“More Performance. More Possibilities.”) for both business and consumer launches; planned, coordinated and executed Intel’s presence in Microsoft’s launch activities, including executive appearances at the Nasdaq “Business Value” launch, and later at Microsoft’s NYC “General Availability” launch event featuring Intel’s Sean Maloney, plus executives from rival AMD and partners Dell, HP and Toshiba. Additionally played a key role in aligning Intel and Microsoft support for a “Dream PC” joint development with computer maker Gateway. This All-in-One PC project involved significant coordination among multiple groups and executives in all three companies. Staff Marketing Manager, SSG Group Marketing, Central Marketing Services Intel Corporation April 2006  –  September 2006  (6 months) Manager of outbound marketing team responsible for raising awareness of Intel’s role in the software industry among developers, influencers and decision makers. Methods included online campaigns (“There’s More” launched July 2006), publications (Intel® Software Adrenaline Magazine), industry proof points, electronic direct marketing, and primary research to assess audience awareness. Additionally responsible for development, testing, use and maintenance of key messages for SSG and its Intel® Software brand. Staff Marketing Manager, SSG Group Marketing, Central Marketing Services Intel Corporation April 2006  –  September 2006  (6 months) Manager of outbound marketing team responsible for raising awareness of Intel’s role in the software industry among developers, influencers and decision makers. Methods included online campaigns (“There’s More” launched July 2006), publications (Intel® Software Adrenaline Magazine), industry proof points, electronic direct marketing, and primary research to assess audience awareness. Additionally responsible for development, testing, use and maintenance of key messages for SSG and its Intel® Software brand. Strategic Marketing Manager, Consumer Electronics Group Intel Corporation October 2003  –  March 2006  (2 years 6 months) Responsible for strategic, business and market analysis across a variety of consumer electronics segments, including DVD, digital television, set top box, digital still and video camera and adjacent AC and DC-powered consumer electronics segments. Drafted and delivered Intel CEG high-level business plan, including business opportunity, environmental trends, competitive and gap analysis, strategy pillars, and more. Performed detailed consumer electronics revenue growth options analysis, IP gap analysis and make vs buy analysis and recommendations for executive review and ratification. Defined and led cross-group, cross-function effort to identify ‘whole is greater than the sum of the parts’ opportunities for Intel in the emerging ‘digital home’, with emphasis on Intel-based networked consumer electronics platforms (DTV, STB, DMR) and their interaction with other PC and CE devices in the networked digital home. Analyzed if, where and how certain Intel core technologies should be extended into the digital home, and co-led a corporate strategic discussion with Intel’s executive team resulting in successful review and ratification of the same. Recognized as an in-house leader in strategy development, emerging consumer usage models, and new business and market analysis. Strategic Marketing Manager, Consumer Electronics Group Intel Corporation October 2003  –  March 2006  (2 years 6 months) Responsible for strategic, business and market analysis across a variety of consumer electronics segments, including DVD, digital television, set top box, digital still and video camera and adjacent AC and DC-powered consumer electronics segments. Drafted and delivered Intel CEG high-level business plan, including business opportunity, environmental trends, competitive and gap analysis, strategy pillars, and more. Performed detailed consumer electronics revenue growth options analysis, IP gap analysis and make vs buy analysis and recommendations for executive review and ratification. Defined and led cross-group, cross-function effort to identify ‘whole is greater than the sum of the parts’ opportunities for Intel in the emerging ‘digital home’, with emphasis on Intel-based networked consumer electronics platforms (DTV, STB, DMR) and their interaction with other PC and CE devices in the networked digital home. Analyzed if, where and how certain Intel core technologies should be extended into the digital home, and co-led a corporate strategic discussion with Intel’s executive team resulting in successful review and ratification of the same. Recognized as an in-house leader in strategy development, emerging consumer usage models, and new business and market analysis. Strategic Marketing Manager, Advanced Media Processor Operation, Broadband Products Group Intel Corporation October 2002  –  September 2003  (1 year) Researched and guided business and product direction to extend new digital media processor technology into consumer electronics products. This work fueled BPG’s consumer electronics silicon opportunity analysis throughout H103; supported Intel’s corporate-level digital home Strategic Long Range Planning (SLRP) process; and directly contributed to the Product Line Business Plan (PLBP) of Intel’s Consumer Electronics Group. In addition to understanding present and future opportunities in a variety of CE segments, I prepared the concept approval / development investment approval (CA/DIA) analysis to identify attractive consumer electronics entry points for Intel based on market trends, technology fit and overall business opportunity. In addition, I planned and led the September 2003 launch of the new Intel® MXP5800 and MXP5400 Digital Media Processors, including product key messages, keynote demo placement at Intel Developer Forum, and press and industry analyst briefings, in close cooperation with Xerox Corporation (as both a co-developer of the technology and as an important customer). The launch achieved its stated objectives of raising industry awareness (attract new customers); demonstrating Intel commitment (reinforce existing/in-process wins); and achieving positive press and analyst coverage (amplify our product and technology key messages). Strategic Marketing Manager, Advanced Media Processor Operation, Broadband Products Group Intel Corporation October 2002  –  September 2003  (1 year) Researched and guided business and product direction to extend new digital media processor technology into consumer electronics products. This work fueled BPG’s consumer electronics silicon opportunity analysis throughout H103; supported Intel’s corporate-level digital home Strategic Long Range Planning (SLRP) process; and directly contributed to the Product Line Business Plan (PLBP) of Intel’s Consumer Electronics Group. In addition to understanding present and future opportunities in a variety of CE segments, I prepared the concept approval / development investment approval (CA/DIA) analysis to identify attractive consumer electronics entry points for Intel based on market trends, technology fit and overall business opportunity. In addition, I planned and led the September 2003 launch of the new Intel® MXP5800 and MXP5400 Digital Media Processors, including product key messages, keynote demo placement at Intel Developer Forum, and press and industry analyst briefings, in close cooperation with Xerox Corporation (as both a co-developer of the technology and as an important customer). The launch achieved its stated objectives of raising industry awareness (attract new customers); demonstrating Intel commitment (reinforce existing/in-process wins); and achieving positive press and analyst coverage (amplify our product and technology key messages). Strategic Marketing Manager, Advanced Imaging Team, Desktop Architecture Lab Intel Corporation May 2002  –  September 2002  (5 months) Completed and delivered market and business plan to carry a lab-based digital media processor technology development effort forward as a new Intel silicon business targeted initially at the document imaging market. Successfully secured funding and headcount to proceed, in spite of challenging corporate business climate. Strategic Marketing Manager, Advanced Imaging Team, Desktop Architecture Lab Intel Corporation May 2002  –  September 2002  (5 months) Completed and delivered market and business plan to carry a lab-based digital media processor technology development effort forward as a new Intel silicon business targeted initially at the document imaging market. Successfully secured funding and headcount to proceed, in spite of challenging corporate business climate. Business Segment Manager, Intel® Play™ PC Enhanced Technology Toys Intel Corporation May 2000  –  March 2002  (1 year 11 months) Reporting to Vice President, Connected Products Division, I rebuilt the Intel Play team and business as an Intel-only effort upon Mattel’s exit from our joint venture. Re-modeled business with 5-year business plan, high-level roadmap, revised product and brand objectives, and expanded retail channel presence. Managed a team of direct and matrix reports averaging over 35 people. Responsible for multi-million dollar P&L, including product development, marketing, personnel, spending, sales forecast and revenue. Successfully debuted Intel-only product line at American International Toy Fair in 2001, engaging key retailers and generating strong endorsement for Intel’s participation in the tech toy market. Launched the new Intel® Play™ Digital Movie Creator into a market where retailer forecasts exceeded our supply, all the while garnering glowing product reviews and awards in leading consumer publications. Executed Holiday 2001 sales and marketing programs with major presence in all leading toy, mass-merchant and consumer electronics outlets. Key contributor to Intel’s New Business Group Strategic Long Range Planning and Product Line Business Planning processes, providing company-level strategic recommendations for Intel’s future efforts in developing and diffusing consumer technologies and products that drive preference for Intel Architecture in the marketplace. Business Segment Manager, Intel® Play™ PC Enhanced Technology Toys Intel Corporation May 2000  –  March 2002  (1 year 11 months) Reporting to Vice President, Connected Products Division, I rebuilt the Intel Play team and business as an Intel-only effort upon Mattel’s exit from our joint venture. Re-modeled business with 5-year business plan, high-level roadmap, revised product and brand objectives, and expanded retail channel presence. Managed a team of direct and matrix reports averaging over 35 people. Responsible for multi-million dollar P&L, including product development, marketing, personnel, spending, sales forecast and revenue. Successfully debuted Intel-only product line at American International Toy Fair in 2001, engaging key retailers and generating strong endorsement for Intel’s participation in the tech toy market. Launched the new Intel® Play™ Digital Movie Creator into a market where retailer forecasts exceeded our supply, all the while garnering glowing product reviews and awards in leading consumer publications. Executed Holiday 2001 sales and marketing programs with major presence in all leading toy, mass-merchant and consumer electronics outlets. Key contributor to Intel’s New Business Group Strategic Long Range Planning and Product Line Business Planning processes, providing company-level strategic recommendations for Intel’s future efforts in developing and diffusing consumer technologies and products that drive preference for Intel Architecture in the marketplace. Director, Intel Smart Toy Lab Intel Corporation June 1999  –  May 2000  (1 year) Co-directed unique joint venture with Mattel, Inc., to develop and launch Intel® \nPlay™ line of PC-connected technology toys. Responsibilities encompassed all Intel-specific \naspects of joint venture, as well as jointly shared business, product and marketing decisions. \nSuccessfully launched Intel® Play™ QX3™ Computer Microscope, which achieved #1 unit and \nrevenue share in its category. Directly managed Intel’s development team at remotely-located \nfacility. Contributed to Intel’s strategic effort to extend its brand to consumers in the home through \nnumerous positive press, analyst and product reviews and awards. Drove and completed formal \nexit negotiations in conjunction with Mattel’s decision to exit the PC software business and firesale \nThe Learning Company / Mattel Media division. Director, Intel Smart Toy Lab Intel Corporation June 1999  –  May 2000  (1 year) Co-directed unique joint venture with Mattel, Inc., to develop and launch Intel® \nPlay™ line of PC-connected technology toys. Responsibilities encompassed all Intel-specific \naspects of joint venture, as well as jointly shared business, product and marketing decisions. \nSuccessfully launched Intel® Play™ QX3™ Computer Microscope, which achieved #1 unit and \nrevenue share in its category. Directly managed Intel’s development team at remotely-located \nfacility. Contributed to Intel’s strategic effort to extend its brand to consumers in the home through \nnumerous positive press, analyst and product reviews and awards. Drove and completed formal \nexit negotiations in conjunction with Mattel’s decision to exit the PC software business and firesale \nThe Learning Company / Mattel Media division. Product Manager, Digital Imaging and Video Division Intel Corporation January 1997  –  June 1999  (2 years 6 months) Focal point for Intel® Create & ShareTM Camera Pack branded consumer retail \nproduct line. Responsibilities included all aspects of product line management, including: \nforecasting product demand; overseeing new product development; managing product transition \nand EOL; defining/executing marketing programs; developing product roadmap; driving product \nline business planning; serving as primary press spokesperson; and more. Position involved high \ndegree of cross-functional and multi-level interaction with various groups, both internal and \nexternal, including engineering, manufacturing, sales, marketing, channel, web, support, finance, \nlegal, PR, localization/international, and more. Managed a product line team consisting of \nmarketing programs managers, PMEs, and TMEs in support of product line business objectives. In addition to widespread and positive product coverage in consumer and trade press, we achieved \nand maintained market segment share leadership in the USB tethered PC camera market. Further, \ncustomer satisfaction was high as measured by numerous customer surveys. Product Manager, Digital Imaging and Video Division Intel Corporation January 1997  –  June 1999  (2 years 6 months) Focal point for Intel® Create & ShareTM Camera Pack branded consumer retail \nproduct line. Responsibilities included all aspects of product line management, including: \nforecasting product demand; overseeing new product development; managing product transition \nand EOL; defining/executing marketing programs; developing product roadmap; driving product \nline business planning; serving as primary press spokesperson; and more. Position involved high \ndegree of cross-functional and multi-level interaction with various groups, both internal and \nexternal, including engineering, manufacturing, sales, marketing, channel, web, support, finance, \nlegal, PR, localization/international, and more. Managed a product line team consisting of \nmarketing programs managers, PMEs, and TMEs in support of product line business objectives. In addition to widespread and positive product coverage in consumer and trade press, we achieved \nand maintained market segment share leadership in the USB tethered PC camera market. Further, \ncustomer satisfaction was high as measured by numerous customer surveys. Project Manager, Systems Manufacturing Technology Development Intel Corporation November 1995  –  January 1997  (1 year 3 months) Reporting to the General Manager of Intel’s SMTD/OPPS Division with dotted-line reporting to \nGeneral Manager of Mobile Modules Operations Business Unit, I held primary responsibility for \nplanning and managing the launch of MMO’s future products into Intel factories. In this role, I \nworked with business unit and production/operations team members to identify and develop new \nmanufacturing, test, prototype, equipment and process needs. In addition, I directly managed \nMaterials Program Managers and Manufacturing Engineers to support MMO / SMTD objectives. Project Manager, Systems Manufacturing Technology Development Intel Corporation November 1995  –  January 1997  (1 year 3 months) Reporting to the General Manager of Intel’s SMTD/OPPS Division with dotted-line reporting to \nGeneral Manager of Mobile Modules Operations Business Unit, I held primary responsibility for \nplanning and managing the launch of MMO’s future products into Intel factories. In this role, I \nworked with business unit and production/operations team members to identify and develop new \nmanufacturing, test, prototype, equipment and process needs. In addition, I directly managed \nMaterials Program Managers and Manufacturing Engineers to support MMO / SMTD objectives. Program Manager, Portables Business Unit Gateway 1994  –  1995  (1 year) Sioux City, Iowa Area Lead Program Manager for Gateway 2000’s Portables Team. In this leading and visible role, I held primary responsibility for planning, managing, and executing all portables product line new product \nintroductions. Accomplishments include successfully launching Gateway 2000’s “Liberty” and \n“ColorBook2” product families, while managing the phaseout of the older “Handbook” and first \ngeneration “Colorbook” products. Prior to leaving Gateway 2000, I laid the foundation for the Fall \n1995 launch of the now-successful “Solo” Pentium-based multimedia notebook computer family \nand its accessories. In addition to directly managing the portables Program Management team in \nsupport of new product introductions, I worked closely with Asian business partners, suppliers, \nPurchasing, Engineering, Manufacturing, Sales, and Customer Support to coordinate product \nintroductions and transitions, as well as to maintain smooth day-to-day operations. Program Manager, Portables Business Unit Gateway 1994  –  1995  (1 year) Sioux City, Iowa Area Lead Program Manager for Gateway 2000’s Portables Team. In this leading and visible role, I held primary responsibility for planning, managing, and executing all portables product line new product \nintroductions. Accomplishments include successfully launching Gateway 2000’s “Liberty” and \n“ColorBook2” product families, while managing the phaseout of the older “Handbook” and first \ngeneration “Colorbook” products. Prior to leaving Gateway 2000, I laid the foundation for the Fall \n1995 launch of the now-successful “Solo” Pentium-based multimedia notebook computer family \nand its accessories. In addition to directly managing the portables Program Management team in \nsupport of new product introductions, I worked closely with Asian business partners, suppliers, \nPurchasing, Engineering, Manufacturing, Sales, and Customer Support to coordinate product \nintroductions and transitions, as well as to maintain smooth day-to-day operations. Principal Abbate Video, Inc. 1992  –  1994  (2 years) Greater Boston Area Owner, co-founder and primary business / operations manager of this self-financed multimedia software developer. Primary product line called VideoToolkitTM, a highly acclaimed desktop video editing and digital moviemaking package for Macintosh and IBM-compatible computers. Responsibilities encompassed all aspects of product and business development, including product definition, advertising, catalog placement, direct mail, editorial contact, licensing patented technology to developers, and more. Accomplishments included: signing software bundling agreement with RasterOps Corporation, a leading Macintosh monitor and digitizer board supplier; obtaining product placement in leading computer software catalogs, including Tiger Software (catalog circulation 1.25 million), Dr. Mac, Educational Resources, and more; maintaining strong awareness through consistent editorial contact and product reviews in leading computer, trade and consumer publications, including Macworld Magazine, Videomaker Magazine, Video Magazine, more; and negotiating, licensing or otherwise co-promoting our products and technology to present and future business partners. In 1995, Abbate Video, Inc., was acquired by Videonics, Inc., a leading supplier of video editing and effects hardware to the consumer and “prosumer” markets. The VideoToolkit product family and core technology facilitated Videonics’ entry into the computer-based desktop video editing arena. Principal Abbate Video, Inc. 1992  –  1994  (2 years) Greater Boston Area Owner, co-founder and primary business / operations manager of this self-financed multimedia software developer. Primary product line called VideoToolkitTM, a highly acclaimed desktop video editing and digital moviemaking package for Macintosh and IBM-compatible computers. Responsibilities encompassed all aspects of product and business development, including product definition, advertising, catalog placement, direct mail, editorial contact, licensing patented technology to developers, and more. Accomplishments included: signing software bundling agreement with RasterOps Corporation, a leading Macintosh monitor and digitizer board supplier; obtaining product placement in leading computer software catalogs, including Tiger Software (catalog circulation 1.25 million), Dr. Mac, Educational Resources, and more; maintaining strong awareness through consistent editorial contact and product reviews in leading computer, trade and consumer publications, including Macworld Magazine, Videomaker Magazine, Video Magazine, more; and negotiating, licensing or otherwise co-promoting our products and technology to present and future business partners. In 1995, Abbate Video, Inc., was acquired by Videonics, Inc., a leading supplier of video editing and effects hardware to the consumer and “prosumer” markets. The VideoToolkit product family and core technology facilitated Videonics’ entry into the computer-based desktop video editing arena. Program Manager Zenith Data Systems / Groupe Bull 1990  –  1992  (2 years) Benton Harbor, Michigan Area Held primary program management responsibility for most aspects of notebook computer development at this leading personal computer manufacturer. This highly visible position required clear understanding of overall product development process; interaction with virtually all departments, from production floor through top corporate management; responsibility for establishing, maintaining and measuring product development schedule; and frequent international travel and direct coordination of ZDS activities with those of our Asian business and product development partners. Key accomplishment: successfully managed ZDS’ most visible and most advanced notebook computer project to date, resulting in virtually on-time first customer shipment of the industry’s first notebook computer based on Intel’s I-386SL chipset, the ZDS MastersPort 386SL. Also supported or managed SupersPort, MinisPort, TurbosPort, and MastersPort portable computer product families. Program Manager Zenith Data Systems / Groupe Bull 1990  –  1992  (2 years) Benton Harbor, Michigan Area Held primary program management responsibility for most aspects of notebook computer development at this leading personal computer manufacturer. This highly visible position required clear understanding of overall product development process; interaction with virtually all departments, from production floor through top corporate management; responsibility for establishing, maintaining and measuring product development schedule; and frequent international travel and direct coordination of ZDS activities with those of our Asian business and product development partners. Key accomplishment: successfully managed ZDS’ most visible and most advanced notebook computer project to date, resulting in virtually on-time first customer shipment of the industry’s first notebook computer based on Intel’s I-386SL chipset, the ZDS MastersPort 386SL. Also supported or managed SupersPort, MinisPort, TurbosPort, and MastersPort portable computer product families. OEM Systems Engineer Zenith Data Systems 1989  –  1990  (1 year) Benton Harbor, Michigan Area Working closely with Program Management and National Account Managers, I was responsible for both technical and cosmetic customization of ZDS’ commercial products to meet specific requirements of large national and international OEM customers. This position required interaction with, and knowledge of many departments and functions, including regulatory compliance, design engineering, QA, purchasing, manufacturing, and more. In this capacity, I had primary responsibility for maintaining ZDS’ single largest OEM portable and notebook computer account with Honeywell Bull, involving over 10,000 portable computer supplied in turn to Metropolitan Life Insurance Company. This position also involved international travel, and direct contact with ZDS’ future \nparent company, Groupe Bull. OEM Systems Engineer Zenith Data Systems 1989  –  1990  (1 year) Benton Harbor, Michigan Area Working closely with Program Management and National Account Managers, I was responsible for both technical and cosmetic customization of ZDS’ commercial products to meet specific requirements of large national and international OEM customers. This position required interaction with, and knowledge of many departments and functions, including regulatory compliance, design engineering, QA, purchasing, manufacturing, and more. In this capacity, I had primary responsibility for maintaining ZDS’ single largest OEM portable and notebook computer account with Honeywell Bull, involving over 10,000 portable computer supplied in turn to Metropolitan Life Insurance Company. This position also involved international travel, and direct contact with ZDS’ future \nparent company, Groupe Bull. Technical Writer Heath Company / Zenith Data Systems 1986  –  1989  (3 years) Benton Harbor, Michigan Area Researched and authored Service Manuals, Technical Manuals, and User’s Guides for portable and desktop computers and video monitors. The department editor frequently commented, “I hate editing your manuscripts, Abbate. I can never find anything wrong with them.” Technical Writer Heath Company / Zenith Data Systems 1986  –  1989  (3 years) Benton Harbor, Michigan Area Researched and authored Service Manuals, Technical Manuals, and User’s Guides for portable and desktop computers and video monitors. The department editor frequently commented, “I hate editing your manuscripts, Abbate. I can never find anything wrong with them.” Teaching Assistant, University of Detroit University of Detroit Mercy 1985  –  1986  (1 year) Greater Detroit Area Conducted labs, lectured students, and graded assignments while completing undergraduate degree. Teaching Assistant, University of Detroit University of Detroit Mercy 1985  –  1986  (1 year) Greater Detroit Area Conducted labs, lectured students, and graded assignments while completing undergraduate degree. Systems Engineer, Voice of America (US Government) Voice of America 1984  –  1985  (1 year) Washington D.C. Metro Area Devised, performed, and documented tests on broadcast studio and high-power transmitter facilities as a Co-Op engineer. Involved domestic and international travel. Systems Engineer, Voice of America (US Government) Voice of America 1984  –  1985  (1 year) Washington D.C. Metro Area Devised, performed, and documented tests on broadcast studio and high-power transmitter facilities as a Co-Op engineer. Involved domestic and international travel. Skills Team Leadership Consumer Electronics Marketing Marketing Strategy Product Marketing Product Management Start-ups Strategy Mobile Devices Digital Media Go-to-market Strategy Competitive Analysis Intel Strategic Planning Cross-functional Team... Program Management See 1+     See less Skills  Team Leadership Consumer Electronics Marketing Marketing Strategy Product Marketing Product Management Start-ups Strategy Mobile Devices Digital Media Go-to-market Strategy Competitive Analysis Intel Strategic Planning Cross-functional Team... Program Management See 1+     See less Team Leadership Consumer Electronics Marketing Marketing Strategy Product Marketing Product Management Start-ups Strategy Mobile Devices Digital Media Go-to-market Strategy Competitive Analysis Intel Strategic Planning Cross-functional Team... Program Management See 1+     See less Team Leadership Consumer Electronics Marketing Marketing Strategy Product Marketing Product Management Start-ups Strategy Mobile Devices Digital Media Go-to-market Strategy Competitive Analysis Intel Strategic Planning Cross-functional Team... Program Management See 1+     See less Education University of Detroit Mercy Bachelor of Engineering,  Electrical Engineering 1982  – 1986 Awarded full-tuition, four year academic scholarship (Insignis Scholar). Degree requirement included one year of co-op work experience in addition to four years of traditional schooling. Activities and Societies:  Insignis Scholar;\nSigma Pi Western Michigan University Graduate Study , Electrical Engineering 1987  – 1989 Completed 21 credits toward Master of Electrical Engineering degree while employed at Zenith \nData Systems. Included coursework in Engineering Project Management. cathedral prep 1978  – 1982 blessed sacrament 1970  – 1978 University of Detroit Mercy Bachelor of Engineering,  Electrical Engineering 1982  – 1986 Awarded full-tuition, four year academic scholarship (Insignis Scholar). Degree requirement included one year of co-op work experience in addition to four years of traditional schooling. Activities and Societies:  Insignis Scholar;\nSigma Pi University of Detroit Mercy Bachelor of Engineering,  Electrical Engineering 1982  – 1986 Awarded full-tuition, four year academic scholarship (Insignis Scholar). Degree requirement included one year of co-op work experience in addition to four years of traditional schooling. Activities and Societies:  Insignis Scholar;\nSigma Pi University of Detroit Mercy Bachelor of Engineering,  Electrical Engineering 1982  – 1986 Awarded full-tuition, four year academic scholarship (Insignis Scholar). Degree requirement included one year of co-op work experience in addition to four years of traditional schooling. Activities and Societies:  Insignis Scholar;\nSigma Pi Western Michigan University Graduate Study , Electrical Engineering 1987  – 1989 Completed 21 credits toward Master of Electrical Engineering degree while employed at Zenith \nData Systems. Included coursework in Engineering Project Management. Western Michigan University Graduate Study , Electrical Engineering 1987  – 1989 Completed 21 credits toward Master of Electrical Engineering degree while employed at Zenith \nData Systems. Included coursework in Engineering Project Management. Western Michigan University Graduate Study , Electrical Engineering 1987  – 1989 Completed 21 credits toward Master of Electrical Engineering degree while employed at Zenith \nData Systems. Included coursework in Engineering Project Management. cathedral prep 1978  – 1982 cathedral prep 1978  – 1982 cathedral prep 1978  – 1982 blessed sacrament 1970  – 1978 blessed sacrament 1970  – 1978 blessed sacrament 1970  – 1978 Honors & Awards Additional Honors & Awards US Patent US7277576 \"Active color correction to compensate for near field color cast\"  \n \nNational Forensic League 1982 NFL National Debate Tournament Winner Additional Honors & Awards US Patent US7277576 \"Active color correction to compensate for near field color cast\"  \n \nNational Forensic League 1982 NFL National Debate Tournament Winner Additional Honors & Awards US Patent US7277576 \"Active color correction to compensate for near field color cast\"  \n \nNational Forensic League 1982 NFL National Debate Tournament Winner Additional Honors & Awards US Patent US7277576 \"Active color correction to compensate for near field color cast\"  \n \nNational Forensic League 1982 NFL National Debate Tournament Winner ", "Languages French French French Skills Public Relations Project Planning Analytics Positioning People Development Media Analysis Communication Training Strategic Communications Event Planning Cross-functional Team... Project Management Internal Communications Strategy Leadership Marketing Communications Strategic Partnerships Marketing Strategy Integrated Marketing Product Marketing Marketing Management Online Advertising Management Social Media Marketing Marketing Strategic Planning Social Media Program Management Messaging Demand Generation Thought Leadership Sales Enablement Business Strategy Multi-channel Marketing Analyst Relations Corporate Communications Change Management Go-to-market Strategy Advertising B2B Marketing Product Management Sales Sales Operations Lead Generation Industry Analyst... Message Development Product Launch Start-ups SaaS See 33+     See less Skills  Public Relations Project Planning Analytics Positioning People Development Media Analysis Communication Training Strategic Communications Event Planning Cross-functional Team... Project Management Internal Communications Strategy Leadership Marketing Communications Strategic Partnerships Marketing Strategy Integrated Marketing Product Marketing Marketing Management Online Advertising Management Social Media Marketing Marketing Strategic Planning Social Media Program Management Messaging Demand Generation Thought Leadership Sales Enablement Business Strategy Multi-channel Marketing Analyst Relations Corporate Communications Change Management Go-to-market Strategy Advertising B2B Marketing Product Management Sales Sales Operations Lead Generation Industry Analyst... Message Development Product Launch Start-ups SaaS See 33+     See less Public Relations Project Planning Analytics Positioning People Development Media Analysis Communication Training Strategic Communications Event Planning Cross-functional Team... Project Management Internal Communications Strategy Leadership Marketing Communications Strategic Partnerships Marketing Strategy Integrated Marketing Product Marketing Marketing Management Online Advertising Management Social Media Marketing Marketing Strategic Planning Social Media Program Management Messaging Demand Generation Thought Leadership Sales Enablement Business Strategy Multi-channel Marketing Analyst Relations Corporate Communications Change Management Go-to-market Strategy Advertising B2B Marketing Product Management Sales Sales Operations Lead Generation Industry Analyst... Message Development Product Launch Start-ups SaaS See 33+     See less Public Relations Project Planning Analytics Positioning People Development Media Analysis Communication Training Strategic Communications Event Planning Cross-functional Team... Project Management Internal Communications Strategy Leadership Marketing Communications Strategic Partnerships Marketing Strategy Integrated Marketing Product Marketing Marketing Management Online Advertising Management Social Media Marketing Marketing Strategic Planning Social Media Program Management Messaging Demand Generation Thought Leadership Sales Enablement Business Strategy Multi-channel Marketing Analyst Relations Corporate Communications Change Management Go-to-market Strategy Advertising B2B Marketing Product Management Sales Sales Operations Lead Generation Industry Analyst... Message Development Product Launch Start-ups SaaS See 33+     See less Honors & Awards ", "Experience Game Content Planning and Marketing Intel Corporation June 2011  – Present (4 years 3 months) Visual Computing Software Marketing Manager Intel Corporation July 1997  –  June 2011  (14 years) Software Industry Marketing, Games Intel March 1997  –  February 2007  (10 years) Game Content Planning and Marketing Intel Corporation June 2011  – Present (4 years 3 months) Game Content Planning and Marketing Intel Corporation June 2011  – Present (4 years 3 months) Visual Computing Software Marketing Manager Intel Corporation July 1997  –  June 2011  (14 years) Visual Computing Software Marketing Manager Intel Corporation July 1997  –  June 2011  (14 years) Software Industry Marketing, Games Intel March 1997  –  February 2007  (10 years) Software Industry Marketing, Games Intel March 1997  –  February 2007  (10 years) Languages Korean Korean Korean Skills Product Management Cross-functional Team... Product Marketing Competitive Analysis Mobile Devices Product Development Strategic Partnerships Start-ups Wireless Intel Cloud Computing Semiconductors Go-to-market Strategy Business Development Software Engineering Marketing Management Strategy Product Launch See 4+     See less Skills  Product Management Cross-functional Team... Product Marketing Competitive Analysis Mobile Devices Product Development Strategic Partnerships Start-ups Wireless Intel Cloud Computing Semiconductors Go-to-market Strategy Business Development Software Engineering Marketing Management Strategy Product Launch See 4+     See less Product Management Cross-functional Team... Product Marketing Competitive Analysis Mobile Devices Product Development Strategic Partnerships Start-ups Wireless Intel Cloud Computing Semiconductors Go-to-market Strategy Business Development Software Engineering Marketing Management Strategy Product Launch See 4+     See less Product Management Cross-functional Team... Product Marketing Competitive Analysis Mobile Devices Product Development Strategic Partnerships Start-ups Wireless Intel Cloud Computing Semiconductors Go-to-market Strategy Business Development Software Engineering Marketing Management Strategy Product Launch See 4+     See less Education California State University-Fullerton BA,  Communication Columbia University - Columbia Business School MBA,  Finance California State University-Fullerton BA,  Communication California State University-Fullerton BA,  Communication California State University-Fullerton BA,  Communication Columbia University - Columbia Business School MBA,  Finance Columbia University - Columbia Business School MBA,  Finance Columbia University - Columbia Business School MBA,  Finance ", "Languages English English English Skills Social Media Marketing Program Management Marketing Product Marketing Marketing Communications Product Management Advertising Management Project Management Mobile Devices Cloud Computing Digital Marketing Project Planning Go-to-market Strategy Strategic Partnerships HTML Intel Networking Mobile Applications People Skills Event Management Graphic Design Computer Hardware Hardware Installation Vendor Management Web Development Photoshop Adobe Creative Suite Event Planning Creative Direction Blogging Social Media Outreach Event Marketing Strategy See 18+     See less Skills  Social Media Marketing Program Management Marketing Product Marketing Marketing Communications Product Management Advertising Management Project Management Mobile Devices Cloud Computing Digital Marketing Project Planning Go-to-market Strategy Strategic Partnerships HTML Intel Networking Mobile Applications People Skills Event Management Graphic Design Computer Hardware Hardware Installation Vendor Management Web Development Photoshop Adobe Creative Suite Event Planning Creative Direction Blogging Social Media Outreach Event Marketing Strategy See 18+     See less Social Media Marketing Program Management Marketing Product Marketing Marketing Communications Product Management Advertising Management Project Management Mobile Devices Cloud Computing Digital Marketing Project Planning Go-to-market Strategy Strategic Partnerships HTML Intel Networking Mobile Applications People Skills Event Management Graphic Design Computer Hardware Hardware Installation Vendor Management Web Development Photoshop Adobe Creative Suite Event Planning Creative Direction Blogging Social Media Outreach Event Marketing Strategy See 18+     See less Social Media Marketing Program Management Marketing Product Marketing Marketing Communications Product Management Advertising Management Project Management Mobile Devices Cloud Computing Digital Marketing Project Planning Go-to-market Strategy Strategic Partnerships HTML Intel Networking Mobile Applications People Skills Event Management Graphic Design Computer Hardware Hardware Installation Vendor Management Web Development Photoshop Adobe Creative Suite Event Planning Creative Direction Blogging Social Media Outreach Event Marketing Strategy See 18+     See less ", "Summary •Played an integral role in the senior management team growing a direct marketing, direct response franchise organization from 22 locations to 55 locations and $60M in revenue in three years \n•Led a team responsible for all advertising, branding, direct response, sponsorship, public relations and event marketing in 12 markets \n•Successfully integrated and leveraged the brand as a local name in each community Specialties:Brand Campaigns, Advertising, Media Buying, negotiating, strategic planning, franchising, Fortune 100, Sales Management, product development, financial planning, Managing Advertising Agencies, non profits Summary •Played an integral role in the senior management team growing a direct marketing, direct response franchise organization from 22 locations to 55 locations and $60M in revenue in three years \n•Led a team responsible for all advertising, branding, direct response, sponsorship, public relations and event marketing in 12 markets \n•Successfully integrated and leveraged the brand as a local name in each community Specialties:Brand Campaigns, Advertising, Media Buying, negotiating, strategic planning, franchising, Fortune 100, Sales Management, product development, financial planning, Managing Advertising Agencies, non profits •Played an integral role in the senior management team growing a direct marketing, direct response franchise organization from 22 locations to 55 locations and $60M in revenue in three years \n•Led a team responsible for all advertising, branding, direct response, sponsorship, public relations and event marketing in 12 markets \n•Successfully integrated and leveraged the brand as a local name in each community Specialties:Brand Campaigns, Advertising, Media Buying, negotiating, strategic planning, franchising, Fortune 100, Sales Management, product development, financial planning, Managing Advertising Agencies, non profits •Played an integral role in the senior management team growing a direct marketing, direct response franchise organization from 22 locations to 55 locations and $60M in revenue in three years \n•Led a team responsible for all advertising, branding, direct response, sponsorship, public relations and event marketing in 12 markets \n•Successfully integrated and leveraged the brand as a local name in each community Specialties:Brand Campaigns, Advertising, Media Buying, negotiating, strategic planning, franchising, Fortune 100, Sales Management, product development, financial planning, Managing Advertising Agencies, non profits Experience Product Marketing Intel Corporation June 2010  – Present (5 years 3 months) . Director of Marketing and New Programs (AMI) Airport Marketing Income January 2008  –  December 2009  (2 years) AMI offers unique out of home marketing, advertising, audio, sampling, sponsorships and naming rights programs at some of the top airports in the United States. VP of Marketing ( Interium) OMSI April 2007  –  October 2007  (7 months) Director of Marketing NWM Inc d/b/a/ LA Weight Loss 2003  –  2006  (3 years) •Orchestrated and executed a strategy to build an in-house advertising agency, managing $18M budget and purchasing media in 12 markets nationwide \n•Led a team responsible for all advertising, branding, direct response, sponsorship, public relations and event marketing in 12 markets \n•Successfully integrated and leveraged the brand as a local name in each community Sr Marketing Manager AT&T Wireless 1996  –  2003  (7 years) •Worked with a cross-functional team to research and develop a new brand campaign for all retail stores. This included developing a new point-of-sale merchandising plan for 500+ stores \n•Researched, developed and implemented an innovative eCollateral web tool used to create and print sales flyers and point-of-sale materials on demand \n•Managed comprehensive market research projects testing of collateral, photos usage and coverage maps \n•Successfully worked cross-functionally within indirect retail to develop merchandising plans for exclusive and non-exclusive distribution locations \n•Developed an innovative in-store web based tool for both consumers and retail sales to simplify the sales process. Defined operational processes and merchandising plans \n•Worked with the point-of-sale, collateral, advertising, web and customer based marketing teams to develop tactical communication plans for national promotions and segment launches Indirect Sales Manager McCaw Cellular One 1991  –  1996  (5 years) •Negotiated contracts for local, regional and national authorized dealers; defining commissions, co-op advertising, and legal terms and conditions \n•Developed and executed co-op and merchandising guidelines and plan-o-grams at the point of sale  \n•Managed 35% of Oregon / SW Washington indirect distribution, including 21 dealerships and 51 locations, exceeding revenue goals over four years Sales and Marketing Manager SPEC Industries Inc 1984  –  1991  (7 years) •Managed direct sales, inventory and credit/collections teams \n•Developed marketing communications plans for collateral, TV and radio campaigns \n•Researched, developed, and directed implementation of new product launches Product Marketing Intel Corporation June 2010  – Present (5 years 3 months) . Product Marketing Intel Corporation June 2010  – Present (5 years 3 months) . Director of Marketing and New Programs (AMI) Airport Marketing Income January 2008  –  December 2009  (2 years) AMI offers unique out of home marketing, advertising, audio, sampling, sponsorships and naming rights programs at some of the top airports in the United States. Director of Marketing and New Programs (AMI) Airport Marketing Income January 2008  –  December 2009  (2 years) AMI offers unique out of home marketing, advertising, audio, sampling, sponsorships and naming rights programs at some of the top airports in the United States. VP of Marketing ( Interium) OMSI April 2007  –  October 2007  (7 months) VP of Marketing ( Interium) OMSI April 2007  –  October 2007  (7 months) Director of Marketing NWM Inc d/b/a/ LA Weight Loss 2003  –  2006  (3 years) •Orchestrated and executed a strategy to build an in-house advertising agency, managing $18M budget and purchasing media in 12 markets nationwide \n•Led a team responsible for all advertising, branding, direct response, sponsorship, public relations and event marketing in 12 markets \n•Successfully integrated and leveraged the brand as a local name in each community Director of Marketing NWM Inc d/b/a/ LA Weight Loss 2003  –  2006  (3 years) •Orchestrated and executed a strategy to build an in-house advertising agency, managing $18M budget and purchasing media in 12 markets nationwide \n•Led a team responsible for all advertising, branding, direct response, sponsorship, public relations and event marketing in 12 markets \n•Successfully integrated and leveraged the brand as a local name in each community Sr Marketing Manager AT&T Wireless 1996  –  2003  (7 years) •Worked with a cross-functional team to research and develop a new brand campaign for all retail stores. This included developing a new point-of-sale merchandising plan for 500+ stores \n•Researched, developed and implemented an innovative eCollateral web tool used to create and print sales flyers and point-of-sale materials on demand \n•Managed comprehensive market research projects testing of collateral, photos usage and coverage maps \n•Successfully worked cross-functionally within indirect retail to develop merchandising plans for exclusive and non-exclusive distribution locations \n•Developed an innovative in-store web based tool for both consumers and retail sales to simplify the sales process. Defined operational processes and merchandising plans \n•Worked with the point-of-sale, collateral, advertising, web and customer based marketing teams to develop tactical communication plans for national promotions and segment launches Sr Marketing Manager AT&T Wireless 1996  –  2003  (7 years) •Worked with a cross-functional team to research and develop a new brand campaign for all retail stores. This included developing a new point-of-sale merchandising plan for 500+ stores \n•Researched, developed and implemented an innovative eCollateral web tool used to create and print sales flyers and point-of-sale materials on demand \n•Managed comprehensive market research projects testing of collateral, photos usage and coverage maps \n•Successfully worked cross-functionally within indirect retail to develop merchandising plans for exclusive and non-exclusive distribution locations \n•Developed an innovative in-store web based tool for both consumers and retail sales to simplify the sales process. Defined operational processes and merchandising plans \n•Worked with the point-of-sale, collateral, advertising, web and customer based marketing teams to develop tactical communication plans for national promotions and segment launches Indirect Sales Manager McCaw Cellular One 1991  –  1996  (5 years) •Negotiated contracts for local, regional and national authorized dealers; defining commissions, co-op advertising, and legal terms and conditions \n•Developed and executed co-op and merchandising guidelines and plan-o-grams at the point of sale  \n•Managed 35% of Oregon / SW Washington indirect distribution, including 21 dealerships and 51 locations, exceeding revenue goals over four years Indirect Sales Manager McCaw Cellular One 1991  –  1996  (5 years) •Negotiated contracts for local, regional and national authorized dealers; defining commissions, co-op advertising, and legal terms and conditions \n•Developed and executed co-op and merchandising guidelines and plan-o-grams at the point of sale  \n•Managed 35% of Oregon / SW Washington indirect distribution, including 21 dealerships and 51 locations, exceeding revenue goals over four years Sales and Marketing Manager SPEC Industries Inc 1984  –  1991  (7 years) •Managed direct sales, inventory and credit/collections teams \n•Developed marketing communications plans for collateral, TV and radio campaigns \n•Researched, developed, and directed implementation of new product launches Sales and Marketing Manager SPEC Industries Inc 1984  –  1991  (7 years) •Managed direct sales, inventory and credit/collections teams \n•Developed marketing communications plans for collateral, TV and radio campaigns \n•Researched, developed, and directed implementation of new product launches Skills Advertising Product Marketing Direct Marketing Marketing Integrated Marketing Marketing Strategy Strategy Cross-functional Team... Leadership Digital Marketing Management Market Research Online Advertising Strategic Partnerships Brand Management Product Management Strategic Planning Public Relations See 3+     See less Skills  Advertising Product Marketing Direct Marketing Marketing Integrated Marketing Marketing Strategy Strategy Cross-functional Team... Leadership Digital Marketing Management Market Research Online Advertising Strategic Partnerships Brand Management Product Management Strategic Planning Public Relations See 3+     See less Advertising Product Marketing Direct Marketing Marketing Integrated Marketing Marketing Strategy Strategy Cross-functional Team... Leadership Digital Marketing Management Market Research Online Advertising Strategic Partnerships Brand Management Product Management Strategic Planning Public Relations See 3+     See less Advertising Product Marketing Direct Marketing Marketing Integrated Marketing Marketing Strategy Strategy Cross-functional Team... Leadership Digital Marketing Management Market Research Online Advertising Strategic Partnerships Brand Management Product Management Strategic Planning Public Relations See 3+     See less Education Northwestern University - Kellogg School of Management Marketing 2001  – 2002 University of London Exchange Program 1983  – 1984 Oregon State University Liberal Arts,  Sociology 1979  – 1984 Activities and Societies:  Alpha Omicron Pi ,  Beaver Year Book Northwestern University - Kellogg School of Management Marketing 2002 People, Process and Performance MBA Executive Class Northwestern University - Kellogg School of Management Marketing 2001  – 2002 Northwestern University - Kellogg School of Management Marketing 2001  – 2002 Northwestern University - Kellogg School of Management Marketing 2001  – 2002 University of London Exchange Program 1983  – 1984 University of London Exchange Program 1983  – 1984 University of London Exchange Program 1983  – 1984 Oregon State University Liberal Arts,  Sociology 1979  – 1984 Activities and Societies:  Alpha Omicron Pi ,  Beaver Year Book Oregon State University Liberal Arts,  Sociology 1979  – 1984 Activities and Societies:  Alpha Omicron Pi ,  Beaver Year Book Oregon State University Liberal Arts,  Sociology 1979  – 1984 Activities and Societies:  Alpha Omicron Pi ,  Beaver Year Book Northwestern University - Kellogg School of Management Marketing 2002 People, Process and Performance MBA Executive Class Northwestern University - Kellogg School of Management Marketing 2002 People, Process and Performance MBA Executive Class Northwestern University - Kellogg School of Management Marketing 2002 People, Process and Performance MBA Executive Class Honors & Awards Additional Honors & Awards Paul Harris Fellow Additional Honors & Awards Paul Harris Fellow Additional Honors & Awards Paul Harris Fellow Additional Honors & Awards Paul Harris Fellow ", "Skills SSD Business Planning Marketing Flash Memory NAND Semiconductors Product Marketing Go-to-market Strategy Product Management Semiconductor Industry Technical Marketing Cross-functional Team... IC Consumer Electronics Competitive Analysis SoC Strategic Partnerships Product Development Strategic Planning Start-ups Strategy Product Launch Mobile Devices Leadership See 9+     See less Skills  SSD Business Planning Marketing Flash Memory NAND Semiconductors Product Marketing Go-to-market Strategy Product Management Semiconductor Industry Technical Marketing Cross-functional Team... IC Consumer Electronics Competitive Analysis SoC Strategic Partnerships Product Development Strategic Planning Start-ups Strategy Product Launch Mobile Devices Leadership See 9+     See less SSD Business Planning Marketing Flash Memory NAND Semiconductors Product Marketing Go-to-market Strategy Product Management Semiconductor Industry Technical Marketing Cross-functional Team... IC Consumer Electronics Competitive Analysis SoC Strategic Partnerships Product Development Strategic Planning Start-ups Strategy Product Launch Mobile Devices Leadership See 9+     See less SSD Business Planning Marketing Flash Memory NAND Semiconductors Product Marketing Go-to-market Strategy Product Management Semiconductor Industry Technical Marketing Cross-functional Team... IC Consumer Electronics Competitive Analysis SoC Strategic Partnerships Product Development Strategic Planning Start-ups Strategy Product Launch Mobile Devices Leadership See 9+     See less ", "Experience Business Analyst and Marketing Intel Corporation June 2014  – Present (1 year 3 months) Dubai Database Administrator Paris-Sorbonne University Abu Dhabi February 2014  –  June 2014  (5 months) Abu Dhabi Relationship Manager Maky Mhawsh Group June 2012  –  January 2014  (1 year 8 months) Dubai, United Arab Emirates Marketing and Sales Representative Velvet Food Factory November 2011  –  May 2012  (7 months) Sarajevo, Bosnia and Herzegovina Finance and Accounting Intern Thai Scandic Steel Company Limited October 2011  –  November 2011  (2 months) Rayong, Thailand Finance and Audit Intern BJC August 2011  –  October 2011  (3 months) Thailand Business Analyst and Marketing Intel Corporation June 2014  – Present (1 year 3 months) Dubai Business Analyst and Marketing Intel Corporation June 2014  – Present (1 year 3 months) Dubai Database Administrator Paris-Sorbonne University Abu Dhabi February 2014  –  June 2014  (5 months) Abu Dhabi Database Administrator Paris-Sorbonne University Abu Dhabi February 2014  –  June 2014  (5 months) Abu Dhabi Relationship Manager Maky Mhawsh Group June 2012  –  January 2014  (1 year 8 months) Dubai, United Arab Emirates Relationship Manager Maky Mhawsh Group June 2012  –  January 2014  (1 year 8 months) Dubai, United Arab Emirates Marketing and Sales Representative Velvet Food Factory November 2011  –  May 2012  (7 months) Sarajevo, Bosnia and Herzegovina Marketing and Sales Representative Velvet Food Factory November 2011  –  May 2012  (7 months) Sarajevo, Bosnia and Herzegovina Finance and Accounting Intern Thai Scandic Steel Company Limited October 2011  –  November 2011  (2 months) Rayong, Thailand Finance and Accounting Intern Thai Scandic Steel Company Limited October 2011  –  November 2011  (2 months) Rayong, Thailand Finance and Audit Intern BJC August 2011  –  October 2011  (3 months) Thailand Finance and Audit Intern BJC August 2011  –  October 2011  (3 months) Thailand Languages English Bosnian Turkish Arabic English Bosnian Turkish Arabic English Bosnian Turkish Arabic Skills Public Relations Corporate Communications Marketing Communications Marketing Strategy Internal Communications Strategic Communications Marketing Management Media Relations Market Research Event Management Marketing Negotiation Strategic Planning Business Strategy Corporate Social... Advertising Social Media Marketing Team Leadership Teamwork Microsoft Office Management Microsoft Excel See 7+     See less Skills  Public Relations Corporate Communications Marketing Communications Marketing Strategy Internal Communications Strategic Communications Marketing Management Media Relations Market Research Event Management Marketing Negotiation Strategic Planning Business Strategy Corporate Social... Advertising Social Media Marketing Team Leadership Teamwork Microsoft Office Management Microsoft Excel See 7+     See less Public Relations Corporate Communications Marketing Communications Marketing Strategy Internal Communications Strategic Communications Marketing Management Media Relations Market Research Event Management Marketing Negotiation Strategic Planning Business Strategy Corporate Social... Advertising Social Media Marketing Team Leadership Teamwork Microsoft Office Management Microsoft Excel See 7+     See less Public Relations Corporate Communications Marketing Communications Marketing Strategy Internal Communications Strategic Communications Marketing Management Media Relations Market Research Event Management Marketing Negotiation Strategic Planning Business Strategy Corporate Social... Advertising Social Media Marketing Team Leadership Teamwork Microsoft Office Management Microsoft Excel See 7+     See less Education Université Paris-Sorbonne Master's degree,  Marketing , Management,  Communications and Media 2014  – 2015 Sarajevo School of Science and Technology Bachelor's degree,  Economics 2007  – 2012 University of Buckingham BS,  Economics Université Paris-Sorbonne Master's degree,  Marketing , Management,  Communications and Media 2014  – 2015 Université Paris-Sorbonne Master's degree,  Marketing , Management,  Communications and Media 2014  – 2015 Université Paris-Sorbonne Master's degree,  Marketing , Management,  Communications and Media 2014  – 2015 Sarajevo School of Science and Technology Bachelor's degree,  Economics 2007  – 2012 Sarajevo School of Science and Technology Bachelor's degree,  Economics 2007  – 2012 Sarajevo School of Science and Technology Bachelor's degree,  Economics 2007  – 2012 University of Buckingham BS,  Economics University of Buckingham BS,  Economics University of Buckingham BS,  Economics ", "Skills Product Marketing SaaS Analyst Relations Strategy Demand Generation Go-to-market Strategy Management Big Data Sales Enablement Cloud Computing Marketing Communications Multi-channel Marketing Marketing Marketing Automation Product Management B2B Marketing Analytics Salesforce.com Messaging CRM Executive Management Thought Leadership Solution Selling Data Integration Start-ups Enterprise Software Lead Generation See 12+     See less Skills  Product Marketing SaaS Analyst Relations Strategy Demand Generation Go-to-market Strategy Management Big Data Sales Enablement Cloud Computing Marketing Communications Multi-channel Marketing Marketing Marketing Automation Product Management B2B Marketing Analytics Salesforce.com Messaging CRM Executive Management Thought Leadership Solution Selling Data Integration Start-ups Enterprise Software Lead Generation See 12+     See less Product Marketing SaaS Analyst Relations Strategy Demand Generation Go-to-market Strategy Management Big Data Sales Enablement Cloud Computing Marketing Communications Multi-channel Marketing Marketing Marketing Automation Product Management B2B Marketing Analytics Salesforce.com Messaging CRM Executive Management Thought Leadership Solution Selling Data Integration Start-ups Enterprise Software Lead Generation See 12+     See less Product Marketing SaaS Analyst Relations Strategy Demand Generation Go-to-market Strategy Management Big Data Sales Enablement Cloud Computing Marketing Communications Multi-channel Marketing Marketing Marketing Automation Product Management B2B Marketing Analytics Salesforce.com Messaging CRM Executive Management Thought Leadership Solution Selling Data Integration Start-ups Enterprise Software Lead Generation See 12+     See less ", "Summary Best known for: \n• Strategic marketing communications & planning \n• Branding/corporate identity \n• Integrated marketing campaigns and activation  \n• Strong written, verbal and visual communications \n• Leading cross-functional and global teams  \n• Strong stakeholder relationships \n• People management \n• Agency management \n \n \nAttributes: \n• Strategic & tactical \n• Thrive on challenge & change \n• Flexible & adaptable  \n• High energy & commitment  \n• Sense of humor \n• Positive attitude \n• Eye for detail  \n• Resiliency and discipline Summary Best known for: \n• Strategic marketing communications & planning \n• Branding/corporate identity \n• Integrated marketing campaigns and activation  \n• Strong written, verbal and visual communications \n• Leading cross-functional and global teams  \n• Strong stakeholder relationships \n• People management \n• Agency management \n \n \nAttributes: \n• Strategic & tactical \n• Thrive on challenge & change \n• Flexible & adaptable  \n• High energy & commitment  \n• Sense of humor \n• Positive attitude \n• Eye for detail  \n• Resiliency and discipline Best known for: \n• Strategic marketing communications & planning \n• Branding/corporate identity \n• Integrated marketing campaigns and activation  \n• Strong written, verbal and visual communications \n• Leading cross-functional and global teams  \n• Strong stakeholder relationships \n• People management \n• Agency management \n \n \nAttributes: \n• Strategic & tactical \n• Thrive on challenge & change \n• Flexible & adaptable  \n• High energy & commitment  \n• Sense of humor \n• Positive attitude \n• Eye for detail  \n• Resiliency and discipline Best known for: \n• Strategic marketing communications & planning \n• Branding/corporate identity \n• Integrated marketing campaigns and activation  \n• Strong written, verbal and visual communications \n• Leading cross-functional and global teams  \n• Strong stakeholder relationships \n• People management \n• Agency management \n \n \nAttributes: \n• Strategic & tactical \n• Thrive on challenge & change \n• Flexible & adaptable  \n• High energy & commitment  \n• Sense of humor \n• Positive attitude \n• Eye for detail  \n• Resiliency and discipline Experience Leader, Global Talent Marketing Intel Corporation June 2014  – Present (1 year 3 months) Chandler, AZ Currently lead a global team of marketing managers and specialists in Intel's global talent acquisition organization who design and deliver innovative marketing platforms and campaigns to attract and excite current and future talent to bet their careers on Intel. Priorities include establishing and maintaining Intel's Employer Value Proposition (EVP), building a differentiated and sustainable employer brand, and delivering bold and creative marketing campaigns in marketing and sourcing channels such as social media, printed collateral, events, and our jobs at Intel career site and platform. Manager, Rewards & Recognition Intel Corporation May 2010  –  June 2014  (4 years 2 months) Chandler, AZ Led a team of 12 marketing communication managers who create employee centered marketing and communication campaigns, materials and events that build awareness and appreciation for Intel’s rich package of benefits. Benefit areas include bonuses, stock, retirement, health and wellness, career development, work/life, discounts, and our corporate recognition programs such as IAA and IQA. Strategic Programs Manager Intel Corporation October 2005  –  May 2010  (4 years 8 months) Chandler, AZ Partnered with stakeholders across Corporate Marketing, PR, and Corporate Affairs to create and deliver highly visible marketing and communication programs for Intel HR. Examples include the introduction of Health for Life, Intel’s 40th anniversary, Intel’s Appreciation/Recognition Strategy, the U.S. Blue Sky retirement program, and enough C&B program changes and announcements to turn my blood a rich Intel blue. Employer Marketing Manager Intel Corporation July 2000  –  January 2004  (3 years 7 months) Santa Clara, CA Recruited to lead a multi-department team and develop and introduce Intel’s first employer brand. In less than 12 months launched an integrated, worldwide recruitment and retention marketing campaign (“Make the most of your mind”) that positioned the company to both candidates and employees as a great place to work. Sr. Advertising Manager Intel Corporation July 1998  –  July 2000  (2 years 1 month) Hong Kong From Hong Kong, led Intel’s strategic advertising and regional communication programs for 14 Asia-Pacific countries including China, India, Korea, Taiwan, Singapore, Malaysia and Australia. Worldwide Retail Marketing Communications Manager Intel Corporation May 1996  –  July 1998  (2 years 3 months) Santa Clara, CA Recruited to lead a team of 8 professionals through the design and execution of worldwide consumer retail merchandise and promotional campaigns for the Intel Inside® brand of microprocessors including Pentium® II, III & IV. Marketing Communications Project Manager NOVELL, INC January 1992  –  January 1996  (4 years 1 month) Translated business objectives into effective, targeted marketing strategies for Novell’s Netware line of software. Ensured promotions and campaigns were produced on schedule, within budget and that accuracy and quality standards were met. Leader, Global Talent Marketing Intel Corporation June 2014  – Present (1 year 3 months) Chandler, AZ Currently lead a global team of marketing managers and specialists in Intel's global talent acquisition organization who design and deliver innovative marketing platforms and campaigns to attract and excite current and future talent to bet their careers on Intel. Priorities include establishing and maintaining Intel's Employer Value Proposition (EVP), building a differentiated and sustainable employer brand, and delivering bold and creative marketing campaigns in marketing and sourcing channels such as social media, printed collateral, events, and our jobs at Intel career site and platform. Leader, Global Talent Marketing Intel Corporation June 2014  – Present (1 year 3 months) Chandler, AZ Currently lead a global team of marketing managers and specialists in Intel's global talent acquisition organization who design and deliver innovative marketing platforms and campaigns to attract and excite current and future talent to bet their careers on Intel. Priorities include establishing and maintaining Intel's Employer Value Proposition (EVP), building a differentiated and sustainable employer brand, and delivering bold and creative marketing campaigns in marketing and sourcing channels such as social media, printed collateral, events, and our jobs at Intel career site and platform. Manager, Rewards & Recognition Intel Corporation May 2010  –  June 2014  (4 years 2 months) Chandler, AZ Led a team of 12 marketing communication managers who create employee centered marketing and communication campaigns, materials and events that build awareness and appreciation for Intel’s rich package of benefits. Benefit areas include bonuses, stock, retirement, health and wellness, career development, work/life, discounts, and our corporate recognition programs such as IAA and IQA. Manager, Rewards & Recognition Intel Corporation May 2010  –  June 2014  (4 years 2 months) Chandler, AZ Led a team of 12 marketing communication managers who create employee centered marketing and communication campaigns, materials and events that build awareness and appreciation for Intel’s rich package of benefits. Benefit areas include bonuses, stock, retirement, health and wellness, career development, work/life, discounts, and our corporate recognition programs such as IAA and IQA. Strategic Programs Manager Intel Corporation October 2005  –  May 2010  (4 years 8 months) Chandler, AZ Partnered with stakeholders across Corporate Marketing, PR, and Corporate Affairs to create and deliver highly visible marketing and communication programs for Intel HR. Examples include the introduction of Health for Life, Intel’s 40th anniversary, Intel’s Appreciation/Recognition Strategy, the U.S. Blue Sky retirement program, and enough C&B program changes and announcements to turn my blood a rich Intel blue. Strategic Programs Manager Intel Corporation October 2005  –  May 2010  (4 years 8 months) Chandler, AZ Partnered with stakeholders across Corporate Marketing, PR, and Corporate Affairs to create and deliver highly visible marketing and communication programs for Intel HR. Examples include the introduction of Health for Life, Intel’s 40th anniversary, Intel’s Appreciation/Recognition Strategy, the U.S. Blue Sky retirement program, and enough C&B program changes and announcements to turn my blood a rich Intel blue. Employer Marketing Manager Intel Corporation July 2000  –  January 2004  (3 years 7 months) Santa Clara, CA Recruited to lead a multi-department team and develop and introduce Intel’s first employer brand. In less than 12 months launched an integrated, worldwide recruitment and retention marketing campaign (“Make the most of your mind”) that positioned the company to both candidates and employees as a great place to work. Employer Marketing Manager Intel Corporation July 2000  –  January 2004  (3 years 7 months) Santa Clara, CA Recruited to lead a multi-department team and develop and introduce Intel’s first employer brand. In less than 12 months launched an integrated, worldwide recruitment and retention marketing campaign (“Make the most of your mind”) that positioned the company to both candidates and employees as a great place to work. Sr. Advertising Manager Intel Corporation July 1998  –  July 2000  (2 years 1 month) Hong Kong From Hong Kong, led Intel’s strategic advertising and regional communication programs for 14 Asia-Pacific countries including China, India, Korea, Taiwan, Singapore, Malaysia and Australia. Sr. Advertising Manager Intel Corporation July 1998  –  July 2000  (2 years 1 month) Hong Kong From Hong Kong, led Intel’s strategic advertising and regional communication programs for 14 Asia-Pacific countries including China, India, Korea, Taiwan, Singapore, Malaysia and Australia. Worldwide Retail Marketing Communications Manager Intel Corporation May 1996  –  July 1998  (2 years 3 months) Santa Clara, CA Recruited to lead a team of 8 professionals through the design and execution of worldwide consumer retail merchandise and promotional campaigns for the Intel Inside® brand of microprocessors including Pentium® II, III & IV. Worldwide Retail Marketing Communications Manager Intel Corporation May 1996  –  July 1998  (2 years 3 months) Santa Clara, CA Recruited to lead a team of 8 professionals through the design and execution of worldwide consumer retail merchandise and promotional campaigns for the Intel Inside® brand of microprocessors including Pentium® II, III & IV. Marketing Communications Project Manager NOVELL, INC January 1992  –  January 1996  (4 years 1 month) Translated business objectives into effective, targeted marketing strategies for Novell’s Netware line of software. Ensured promotions and campaigns were produced on schedule, within budget and that accuracy and quality standards were met. Marketing Communications Project Manager NOVELL, INC January 1992  –  January 1996  (4 years 1 month) Translated business objectives into effective, targeted marketing strategies for Novell’s Netware line of software. Ensured promotions and campaigns were produced on schedule, within budget and that accuracy and quality standards were met. Skills Product Marketing Cross-functional Team... Marketing Strategy Marketing Communications Strategy Program Management Competitive Analysis Integrated Marketing Internal Communications Marketing Public Relations Strategic Planning Advertising Management Recruiting Team Leadership See 1+     See less Skills  Product Marketing Cross-functional Team... Marketing Strategy Marketing Communications Strategy Program Management Competitive Analysis Integrated Marketing Internal Communications Marketing Public Relations Strategic Planning Advertising Management Recruiting Team Leadership See 1+     See less Product Marketing Cross-functional Team... Marketing Strategy Marketing Communications Strategy Program Management Competitive Analysis Integrated Marketing Internal Communications Marketing Public Relations Strategic Planning Advertising Management Recruiting Team Leadership See 1+     See less Product Marketing Cross-functional Team... Marketing Strategy Marketing Communications Strategy Program Management Competitive Analysis Integrated Marketing Internal Communications Marketing Public Relations Strategic Planning Advertising Management Recruiting Team Leadership See 1+     See less Education Middlebury Institute of International Studies at Monterey M.B.A University of California, Santa Barbara B.A,  Sociology Middlebury Institute of International Studies at Monterey M.B.A Middlebury Institute of International Studies at Monterey M.B.A Middlebury Institute of International Studies at Monterey M.B.A University of California, Santa Barbara B.A,  Sociology University of California, Santa Barbara B.A,  Sociology University of California, Santa Barbara B.A,  Sociology ", "Summary Christina has a passion for building community, facilitating and enabling the success of others.  \n \nChristina obtained her B.A. in International Business Management from Washington State University where she graduated Summa Cum Laude and highest honors. She continued her education path by working to complete her Masters in Business Administration focused in Marketing from Alma mater Washington State University. \n \nChristina began her Intel career in 2013 working in various groups and roles across the organization including engineering operations, human resources, and product marketing.  \n Summary Christina has a passion for building community, facilitating and enabling the success of others.  \n \nChristina obtained her B.A. in International Business Management from Washington State University where she graduated Summa Cum Laude and highest honors. She continued her education path by working to complete her Masters in Business Administration focused in Marketing from Alma mater Washington State University. \n \nChristina began her Intel career in 2013 working in various groups and roles across the organization including engineering operations, human resources, and product marketing.  \n Christina has a passion for building community, facilitating and enabling the success of others.  \n \nChristina obtained her B.A. in International Business Management from Washington State University where she graduated Summa Cum Laude and highest honors. She continued her education path by working to complete her Masters in Business Administration focused in Marketing from Alma mater Washington State University. \n \nChristina began her Intel career in 2013 working in various groups and roles across the organization including engineering operations, human resources, and product marketing.  \n Christina has a passion for building community, facilitating and enabling the success of others.  \n \nChristina obtained her B.A. in International Business Management from Washington State University where she graduated Summa Cum Laude and highest honors. She continued her education path by working to complete her Masters in Business Administration focused in Marketing from Alma mater Washington State University. \n \nChristina began her Intel career in 2013 working in various groups and roles across the organization including engineering operations, human resources, and product marketing.  \n Experience Client Computing Group, Outbound Desktop Marketing, Intel Corporation Intel Corporation February 2015  – Present (7 months) Portland, Oregon Area - 2015 Desktop Event Roadmap Owner: Industry events key Desktop messaging, planning & milestones, travelers, budget, customer meetings, and execution \n- Created internal Intel Desktop repository site (Inside Blue) with key resources for cross-desktop sales and marketing organization including blogs, white papers, tech collateral, case studies, partner news, event recaps, and sales guides. \n- Produced monthly Desktop Newsletter to deliver content and collateral that empowers field sales and channel organization to sell desktops \n- Developed online in-market desktop product catalogue for retail, channel, and customer sales teams around the world \n- Maintained Intel Desktop URL content with new gen/product announcements, Intel re-branding regulations, etc. \n- Provided on-site event support in Intel booth for industry events \n \n Intel Intern Program, US Region Intel Corporation January 2014  –  February 2015  (1 year 2 months) Portland, Oregon Area US Intel Intern Experience and Events Manager. \n \n- Managed 2014 US Intern Events across the country for 1800+ graduate and undergraduate interns \n- Collaborated with US College Relations Manager Team for on-site and program support \n- Managed 65+ events for Oregon Interns and new college graduate  \n- Created and managed Next(gen) Taskforce to support on-site logistics for new hire and Intern Program events in Oregon \n- Collaborated with cross-site Next(gen) chapters at 5 largest sites for Intern Program support throughout intern summer/peak season \n- Partner Next(gen) with key Employee Resource Groups to help with recruiting, integration, and retention of new Intel employees through social and professional networking, community impact and outreach, and career development events.  \n- Worked across business units to Develop new Intern Conversion Management systems IT Hiring Program Support (DOT) Intel Corporation October 2013  –  January 2014  (4 months) Portland, Oregon Area - Collaborated with staffing, recruiters, talent advisors, staffing champions, and hiring managers to meet EOY hiring targets  \n- 2013 SWE & SHPE Conferences: IT hiring manager logistics, pre-screening candidates, interviews, follow-up, output, to maximize ROI  \n- 2014 CG & Intern Hiring Library Creation Development: developed a major resource with pre-screened IT approved candidates for all Staffing Champions and Hiring Managers \n- Support IT Onboarding & Integration Program \n- Strategic Site Planning Report: a vital tool for IT redeployed employees seeking opportunities across all GEO sites VPG Strategy, Planning & Operations (SPO) Graduate Intern Intel Corporation January 2013  –  January 2014  (1 year 1 month) Portland, Oregon Area - Department Recognition Aware (DRA): Recognized for results oriented hard work and execution of \nMgr/Ldr Development Series Q2-Q4 2013 \n- Intern Program Manager: Built up Integration Program with over 30+ Intern Events over 4 US locations to foster networking opportunities and drive strategic goals for intern ROI \n- Integration Program Manager: Expanded program to align to VPG Strategy with new hire events at largest US locations to facilitate seamless navigation into Intel's culture \n- Manager/Leader Program Support: Worked with all VPG global sites to facilitate Mgr Forum Series with 55% of current VPG Mgrs/Ldrs in attendance (35 Sessions, 11 Sites, 239 Attendees) \n- 2014 VPG Leader Summit Planning Committee Support: Collaborated with VPG sites around the world to create a \"World Class Org\" Expo in addition to showcasing Mgr/Ldr Development Program \n- HM & Staffing Champion Support: Supported and tracked open requisitions, offers, future starts, and intern end dates for Hiring Managers, Staffing, Operations, and support staff in 8 distinct SW/HW business groups across VPG \n- Diversity Hiring Champion Support: Tracked Staffing’s diversity and hiring indicators, while implementing Intern candidate tracking to help improve the overall, long-term projection in the VPG hiring pipeline \n- Deliver weekly hiring and growth metrics and indicators for VPG: attrition, requisition SS tracking, intern SS tracking, and diversity reports \n- Lead VPG liaison for Ronler Acres Safety: Conduct and report quarterly safety audits of 400+ employees \n- Special Event Planning: 2013 Oregon Product Celebration Customer Service/Hospitality at Bennett's Pure Food Sugar Mountain July 2012  –  December 2012  (6 months) Client Computing Group, Outbound Desktop Marketing, Intel Corporation Intel Corporation February 2015  – Present (7 months) Portland, Oregon Area - 2015 Desktop Event Roadmap Owner: Industry events key Desktop messaging, planning & milestones, travelers, budget, customer meetings, and execution \n- Created internal Intel Desktop repository site (Inside Blue) with key resources for cross-desktop sales and marketing organization including blogs, white papers, tech collateral, case studies, partner news, event recaps, and sales guides. \n- Produced monthly Desktop Newsletter to deliver content and collateral that empowers field sales and channel organization to sell desktops \n- Developed online in-market desktop product catalogue for retail, channel, and customer sales teams around the world \n- Maintained Intel Desktop URL content with new gen/product announcements, Intel re-branding regulations, etc. \n- Provided on-site event support in Intel booth for industry events \n \n Client Computing Group, Outbound Desktop Marketing, Intel Corporation Intel Corporation February 2015  – Present (7 months) Portland, Oregon Area - 2015 Desktop Event Roadmap Owner: Industry events key Desktop messaging, planning & milestones, travelers, budget, customer meetings, and execution \n- Created internal Intel Desktop repository site (Inside Blue) with key resources for cross-desktop sales and marketing organization including blogs, white papers, tech collateral, case studies, partner news, event recaps, and sales guides. \n- Produced monthly Desktop Newsletter to deliver content and collateral that empowers field sales and channel organization to sell desktops \n- Developed online in-market desktop product catalogue for retail, channel, and customer sales teams around the world \n- Maintained Intel Desktop URL content with new gen/product announcements, Intel re-branding regulations, etc. \n- Provided on-site event support in Intel booth for industry events \n \n Intel Intern Program, US Region Intel Corporation January 2014  –  February 2015  (1 year 2 months) Portland, Oregon Area US Intel Intern Experience and Events Manager. \n \n- Managed 2014 US Intern Events across the country for 1800+ graduate and undergraduate interns \n- Collaborated with US College Relations Manager Team for on-site and program support \n- Managed 65+ events for Oregon Interns and new college graduate  \n- Created and managed Next(gen) Taskforce to support on-site logistics for new hire and Intern Program events in Oregon \n- Collaborated with cross-site Next(gen) chapters at 5 largest sites for Intern Program support throughout intern summer/peak season \n- Partner Next(gen) with key Employee Resource Groups to help with recruiting, integration, and retention of new Intel employees through social and professional networking, community impact and outreach, and career development events.  \n- Worked across business units to Develop new Intern Conversion Management systems Intel Intern Program, US Region Intel Corporation January 2014  –  February 2015  (1 year 2 months) Portland, Oregon Area US Intel Intern Experience and Events Manager. \n \n- Managed 2014 US Intern Events across the country for 1800+ graduate and undergraduate interns \n- Collaborated with US College Relations Manager Team for on-site and program support \n- Managed 65+ events for Oregon Interns and new college graduate  \n- Created and managed Next(gen) Taskforce to support on-site logistics for new hire and Intern Program events in Oregon \n- Collaborated with cross-site Next(gen) chapters at 5 largest sites for Intern Program support throughout intern summer/peak season \n- Partner Next(gen) with key Employee Resource Groups to help with recruiting, integration, and retention of new Intel employees through social and professional networking, community impact and outreach, and career development events.  \n- Worked across business units to Develop new Intern Conversion Management systems IT Hiring Program Support (DOT) Intel Corporation October 2013  –  January 2014  (4 months) Portland, Oregon Area - Collaborated with staffing, recruiters, talent advisors, staffing champions, and hiring managers to meet EOY hiring targets  \n- 2013 SWE & SHPE Conferences: IT hiring manager logistics, pre-screening candidates, interviews, follow-up, output, to maximize ROI  \n- 2014 CG & Intern Hiring Library Creation Development: developed a major resource with pre-screened IT approved candidates for all Staffing Champions and Hiring Managers \n- Support IT Onboarding & Integration Program \n- Strategic Site Planning Report: a vital tool for IT redeployed employees seeking opportunities across all GEO sites IT Hiring Program Support (DOT) Intel Corporation October 2013  –  January 2014  (4 months) Portland, Oregon Area - Collaborated with staffing, recruiters, talent advisors, staffing champions, and hiring managers to meet EOY hiring targets  \n- 2013 SWE & SHPE Conferences: IT hiring manager logistics, pre-screening candidates, interviews, follow-up, output, to maximize ROI  \n- 2014 CG & Intern Hiring Library Creation Development: developed a major resource with pre-screened IT approved candidates for all Staffing Champions and Hiring Managers \n- Support IT Onboarding & Integration Program \n- Strategic Site Planning Report: a vital tool for IT redeployed employees seeking opportunities across all GEO sites VPG Strategy, Planning & Operations (SPO) Graduate Intern Intel Corporation January 2013  –  January 2014  (1 year 1 month) Portland, Oregon Area - Department Recognition Aware (DRA): Recognized for results oriented hard work and execution of \nMgr/Ldr Development Series Q2-Q4 2013 \n- Intern Program Manager: Built up Integration Program with over 30+ Intern Events over 4 US locations to foster networking opportunities and drive strategic goals for intern ROI \n- Integration Program Manager: Expanded program to align to VPG Strategy with new hire events at largest US locations to facilitate seamless navigation into Intel's culture \n- Manager/Leader Program Support: Worked with all VPG global sites to facilitate Mgr Forum Series with 55% of current VPG Mgrs/Ldrs in attendance (35 Sessions, 11 Sites, 239 Attendees) \n- 2014 VPG Leader Summit Planning Committee Support: Collaborated with VPG sites around the world to create a \"World Class Org\" Expo in addition to showcasing Mgr/Ldr Development Program \n- HM & Staffing Champion Support: Supported and tracked open requisitions, offers, future starts, and intern end dates for Hiring Managers, Staffing, Operations, and support staff in 8 distinct SW/HW business groups across VPG \n- Diversity Hiring Champion Support: Tracked Staffing’s diversity and hiring indicators, while implementing Intern candidate tracking to help improve the overall, long-term projection in the VPG hiring pipeline \n- Deliver weekly hiring and growth metrics and indicators for VPG: attrition, requisition SS tracking, intern SS tracking, and diversity reports \n- Lead VPG liaison for Ronler Acres Safety: Conduct and report quarterly safety audits of 400+ employees \n- Special Event Planning: 2013 Oregon Product Celebration VPG Strategy, Planning & Operations (SPO) Graduate Intern Intel Corporation January 2013  –  January 2014  (1 year 1 month) Portland, Oregon Area - Department Recognition Aware (DRA): Recognized for results oriented hard work and execution of \nMgr/Ldr Development Series Q2-Q4 2013 \n- Intern Program Manager: Built up Integration Program with over 30+ Intern Events over 4 US locations to foster networking opportunities and drive strategic goals for intern ROI \n- Integration Program Manager: Expanded program to align to VPG Strategy with new hire events at largest US locations to facilitate seamless navigation into Intel's culture \n- Manager/Leader Program Support: Worked with all VPG global sites to facilitate Mgr Forum Series with 55% of current VPG Mgrs/Ldrs in attendance (35 Sessions, 11 Sites, 239 Attendees) \n- 2014 VPG Leader Summit Planning Committee Support: Collaborated with VPG sites around the world to create a \"World Class Org\" Expo in addition to showcasing Mgr/Ldr Development Program \n- HM & Staffing Champion Support: Supported and tracked open requisitions, offers, future starts, and intern end dates for Hiring Managers, Staffing, Operations, and support staff in 8 distinct SW/HW business groups across VPG \n- Diversity Hiring Champion Support: Tracked Staffing’s diversity and hiring indicators, while implementing Intern candidate tracking to help improve the overall, long-term projection in the VPG hiring pipeline \n- Deliver weekly hiring and growth metrics and indicators for VPG: attrition, requisition SS tracking, intern SS tracking, and diversity reports \n- Lead VPG liaison for Ronler Acres Safety: Conduct and report quarterly safety audits of 400+ employees \n- Special Event Planning: 2013 Oregon Product Celebration Customer Service/Hospitality at Bennett's Pure Food Sugar Mountain July 2012  –  December 2012  (6 months) Customer Service/Hospitality at Bennett's Pure Food Sugar Mountain July 2012  –  December 2012  (6 months) Languages French French French Skills Microsoft Office PowerPoint Microsoft Excel Research Customer Service Microsoft Word International Relations Public Relations Social Media Strategic Planning Outlook Event Management Non-profits Editing Cross-functional Team... Training Sales Process Scheduler Marketing Strategy Business Development Management Team Leadership Project Management Leadership Team Building Data Analysis Program Management Analysis Strategy Teamwork See 15+     See less Skills  Microsoft Office PowerPoint Microsoft Excel Research Customer Service Microsoft Word International Relations Public Relations Social Media Strategic Planning Outlook Event Management Non-profits Editing Cross-functional Team... Training Sales Process Scheduler Marketing Strategy Business Development Management Team Leadership Project Management Leadership Team Building Data Analysis Program Management Analysis Strategy Teamwork See 15+     See less Microsoft Office PowerPoint Microsoft Excel Research Customer Service Microsoft Word International Relations Public Relations Social Media Strategic Planning Outlook Event Management Non-profits Editing Cross-functional Team... Training Sales Process Scheduler Marketing Strategy Business Development Management Team Leadership Project Management Leadership Team Building Data Analysis Program Management Analysis Strategy Teamwork See 15+     See less Microsoft Office PowerPoint Microsoft Excel Research Customer Service Microsoft Word International Relations Public Relations Social Media Strategic Planning Outlook Event Management Non-profits Editing Cross-functional Team... Training Sales Process Scheduler Marketing Strategy Business Development Management Team Leadership Project Management Leadership Team Building Data Analysis Program Management Analysis Strategy Teamwork See 15+     See less Education Washington State University MBA,  International Business Administration & Finance , 3.86 2013  – 2015 Washington State University Bachelor's Degree,  International Business Management , 3.96 2009  – 2012 Activities and Societies:  Alpha Sigma Lambda National Honor Society ,  Beta Gamma Sigma (Seattle Alumni Chapter) ,  Students4SoldiersWSU Washington State University MBA,  International Business Administration & Finance , 3.86 2013  – 2015 Washington State University MBA,  International Business Administration & Finance , 3.86 2013  – 2015 Washington State University MBA,  International Business Administration & Finance , 3.86 2013  – 2015 Washington State University Bachelor's Degree,  International Business Management , 3.96 2009  – 2012 Activities and Societies:  Alpha Sigma Lambda National Honor Society ,  Beta Gamma Sigma (Seattle Alumni Chapter) ,  Students4SoldiersWSU Washington State University Bachelor's Degree,  International Business Management , 3.96 2009  – 2012 Activities and Societies:  Alpha Sigma Lambda National Honor Society ,  Beta Gamma Sigma (Seattle Alumni Chapter) ,  Students4SoldiersWSU Washington State University Bachelor's Degree,  International Business Management , 3.96 2009  – 2012 Activities and Societies:  Alpha Sigma Lambda National Honor Society ,  Beta Gamma Sigma (Seattle Alumni Chapter) ,  Students4SoldiersWSU Honors & Awards ", "Experience Product Marketing for Open Source at Intel (IoT) Intel Corporation October 2013  – Present (1 year 11 months) Responsible for marketing of open source projects targeted for the Internet of Things. \n Program Manager for Atom & Mobile Products Intel Corporation January 2007  – Present (8 years 8 months) Led ecosystem enabling programs and coordinated efforts with external and internal resources for Samsung, Acer and Nokia product launch efforts. Oversaw multimillion dollar budget of systems and development dollars to support internal and external sales teams  \nKnowledgeable in licensing and legal requirements to support the integration of 3rd party software solutions aligned to multiple platform launches  \nWorked with internal teams to find creative ways to address resource deficiencies to support strategic programs Program Manager for Intel® Viiv™ Technology Intel Corporation July 2005  –  December 2007  (2 years 6 months) Santa Clara, CA Drove alignment with worldwide technical and sales teams to deliver 50+ applications to support the Intel Viiv Technology launch \nQuickly worked to address and resolve internal and external development and relationship dependencies as they relate to changes to business direction (i.e. engineering, program, business, verification, executive level)  \nEstablished best known methods for new strategic business initiatives within Intel where software application alignment at launch is critical for product launch Technical Marketing Engineer, Desktop Client Enabling Intel Corporation October 2000  –  July 2005  (4 years 10 months) Hillsboro, OR Lead software engineering level relationship and engagements with vendors; activities included optimizing code, creating and presenting training material and roadmaps, and negotiating engineering activities. \nManaged demo creation at corporate sponsored events both internal and external (i.e. Game Developers Conference 2004, IDF); activities included coordination with vendors on timelines, marketing messaging, and logistics  \nOptimized vendor applications; activities included analysis of code and MMX/SSE/SSE2/SSE3 assembly translation Product Marketing for Open Source at Intel (IoT) Intel Corporation October 2013  – Present (1 year 11 months) Responsible for marketing of open source projects targeted for the Internet of Things. \n Product Marketing for Open Source at Intel (IoT) Intel Corporation October 2013  – Present (1 year 11 months) Responsible for marketing of open source projects targeted for the Internet of Things. \n Program Manager for Atom & Mobile Products Intel Corporation January 2007  – Present (8 years 8 months) Led ecosystem enabling programs and coordinated efforts with external and internal resources for Samsung, Acer and Nokia product launch efforts. Oversaw multimillion dollar budget of systems and development dollars to support internal and external sales teams  \nKnowledgeable in licensing and legal requirements to support the integration of 3rd party software solutions aligned to multiple platform launches  \nWorked with internal teams to find creative ways to address resource deficiencies to support strategic programs Program Manager for Atom & Mobile Products Intel Corporation January 2007  – Present (8 years 8 months) Led ecosystem enabling programs and coordinated efforts with external and internal resources for Samsung, Acer and Nokia product launch efforts. Oversaw multimillion dollar budget of systems and development dollars to support internal and external sales teams  \nKnowledgeable in licensing and legal requirements to support the integration of 3rd party software solutions aligned to multiple platform launches  \nWorked with internal teams to find creative ways to address resource deficiencies to support strategic programs Program Manager for Intel® Viiv™ Technology Intel Corporation July 2005  –  December 2007  (2 years 6 months) Santa Clara, CA Drove alignment with worldwide technical and sales teams to deliver 50+ applications to support the Intel Viiv Technology launch \nQuickly worked to address and resolve internal and external development and relationship dependencies as they relate to changes to business direction (i.e. engineering, program, business, verification, executive level)  \nEstablished best known methods for new strategic business initiatives within Intel where software application alignment at launch is critical for product launch Program Manager for Intel® Viiv™ Technology Intel Corporation July 2005  –  December 2007  (2 years 6 months) Santa Clara, CA Drove alignment with worldwide technical and sales teams to deliver 50+ applications to support the Intel Viiv Technology launch \nQuickly worked to address and resolve internal and external development and relationship dependencies as they relate to changes to business direction (i.e. engineering, program, business, verification, executive level)  \nEstablished best known methods for new strategic business initiatives within Intel where software application alignment at launch is critical for product launch Technical Marketing Engineer, Desktop Client Enabling Intel Corporation October 2000  –  July 2005  (4 years 10 months) Hillsboro, OR Lead software engineering level relationship and engagements with vendors; activities included optimizing code, creating and presenting training material and roadmaps, and negotiating engineering activities. \nManaged demo creation at corporate sponsored events both internal and external (i.e. Game Developers Conference 2004, IDF); activities included coordination with vendors on timelines, marketing messaging, and logistics  \nOptimized vendor applications; activities included analysis of code and MMX/SSE/SSE2/SSE3 assembly translation Technical Marketing Engineer, Desktop Client Enabling Intel Corporation October 2000  –  July 2005  (4 years 10 months) Hillsboro, OR Lead software engineering level relationship and engagements with vendors; activities included optimizing code, creating and presenting training material and roadmaps, and negotiating engineering activities. \nManaged demo creation at corporate sponsored events both internal and external (i.e. Game Developers Conference 2004, IDF); activities included coordination with vendors on timelines, marketing messaging, and logistics  \nOptimized vendor applications; activities included analysis of code and MMX/SSE/SSE2/SSE3 assembly translation Skills Semiconductors Program Management Business Development EDA Business Strategy Intel Project Management IC Product Management Debugging Software Engineering Marketing Strategy ASIC Manufacturing Wireless Product Marketing SoC Go-to-market Strategy Embedded Systems Integration See 5+     See less Skills  Semiconductors Program Management Business Development EDA Business Strategy Intel Project Management IC Product Management Debugging Software Engineering Marketing Strategy ASIC Manufacturing Wireless Product Marketing SoC Go-to-market Strategy Embedded Systems Integration See 5+     See less Semiconductors Program Management Business Development EDA Business Strategy Intel Project Management IC Product Management Debugging Software Engineering Marketing Strategy ASIC Manufacturing Wireless Product Marketing SoC Go-to-market Strategy Embedded Systems Integration See 5+     See less Semiconductors Program Management Business Development EDA Business Strategy Intel Project Management IC Product Management Debugging Software Engineering Marketing Strategy ASIC Manufacturing Wireless Product Marketing SoC Go-to-market Strategy Embedded Systems Integration See 5+     See less Education Santa Clara University - Leavey School of Business MBA,  Leading People and Organizations 2009  – 2013 Oregon State University BS,  Computer Science 1995  – 2000 Santa Clara University - Leavey School of Business MBA,  Leading People and Organizations 2009  – 2013 Santa Clara University - Leavey School of Business MBA,  Leading People and Organizations 2009  – 2013 Santa Clara University - Leavey School of Business MBA,  Leading People and Organizations 2009  – 2013 Oregon State University BS,  Computer Science 1995  – 2000 Oregon State University BS,  Computer Science 1995  – 2000 Oregon State University BS,  Computer Science 1995  – 2000 ", "Languages Chinese English Chinese English Chinese English Skills Semiconductors Debugging SoC ASIC IC Microprocessors Strategy Static Timing Analysis Embedded Systems Product Marketing Perl Skills  Semiconductors Debugging SoC ASIC IC Microprocessors Strategy Static Timing Analysis Embedded Systems Product Marketing Perl Semiconductors Debugging SoC ASIC IC Microprocessors Strategy Static Timing Analysis Embedded Systems Product Marketing Perl Semiconductors Debugging SoC ASIC IC Microprocessors Strategy Static Timing Analysis Embedded Systems Product Marketing Perl ", "Skills Mobile Devices Wireless Business Development Marketing Strategy Program Management Mobile Applications Marketing Communications Enterprise Software Marketing Management Go-to-market Strategy Semiconductors Team Leadership Product Management WiMAX Skills  Mobile Devices Wireless Business Development Marketing Strategy Program Management Mobile Applications Marketing Communications Enterprise Software Marketing Management Go-to-market Strategy Semiconductors Team Leadership Product Management WiMAX Mobile Devices Wireless Business Development Marketing Strategy Program Management Mobile Applications Marketing Communications Enterprise Software Marketing Management Go-to-market Strategy Semiconductors Team Leadership Product Management WiMAX Mobile Devices Wireless Business Development Marketing Strategy Program Management Mobile Applications Marketing Communications Enterprise Software Marketing Management Go-to-market Strategy Semiconductors Team Leadership Product Management WiMAX ", "Summary To combine my inherent creativity, strategic acumen, and extensive and diverse brand, product, and technology marketing experience to develop and deliver breakout branding and marketing strategies and programs that ignite the brand and drive its relevance, affinity and admiration among consumers and industry audiences alike.  Summary To combine my inherent creativity, strategic acumen, and extensive and diverse brand, product, and technology marketing experience to develop and deliver breakout branding and marketing strategies and programs that ignite the brand and drive its relevance, affinity and admiration among consumers and industry audiences alike.  To combine my inherent creativity, strategic acumen, and extensive and diverse brand, product, and technology marketing experience to develop and deliver breakout branding and marketing strategies and programs that ignite the brand and drive its relevance, affinity and admiration among consumers and industry audiences alike.  To combine my inherent creativity, strategic acumen, and extensive and diverse brand, product, and technology marketing experience to develop and deliver breakout branding and marketing strategies and programs that ignite the brand and drive its relevance, affinity and admiration among consumers and industry audiences alike.  Experience Manager, Brand Reputation Marketing Intel Corporation May 2011  – Present (4 years 4 months) Reporting into VP Brand Strategy and Reputation in Global Marketing and Communications Group: \n \n•\tDevelops and drives consumer, business and opinion leader facing brand and marketing strategy and activation for all corporate social responsibility and citizenship programs and initiatives focused on education, entrepreneurship, diversity and inclusion, research and development, sustainability, supply chain and volunteerism. Ensures alignment across multiple internal stakeholders including Executive Office and Staff, Corporate Affairs, HR, Manufacturing and Legal as well as external agency, NGO and government partners. \n \n•\tIdentified need and oversaw creation of comprehensive content and media assets for over 100 branded success stories tailored to relevant target audiences, delivering on the brand promise of making amazing experiences possible. Built to be highly customizable across print, online and video formats and available in 20 languages via an online database, these emotionally engaging narratives have successfully portrayed the brand across multiple use scenarios including traditional marketing channels as well as sales and contract negotiations, tradeshows and events, and policy and government forums. \n \n•\tAt CEO request, delivered first-of-its-kind branded cause marketing program for Conflict Minerals dubbed “In Pursuit of Conflict-free” including content/messaging, paid/social media, multi-purpose web hub, and experimental co-creation efforts with new media partners. Built trusted and cooperative relationships across a broad and comprehensive coalition of NGO, industry and other issue-related players and celebrities. Drove development and execution of product labeling strategy to facilitate field sales efforts and ease consumer identification of conflict-free products in retail and online, for which a third party non-profit extension is now in development. Garnered multiple internal recognitions. \n Consumer Brand and Messaging Strategist Intel September 2005  –  April 2011  (5 years 8 months) Reporting to VP Marketing Strategy in Corporate Marketing Group: \n \n•\tDeveloped and evangelized global strategy and governing principles for management of Intel’s master, processor, processor technology, and new category brands across the corporation. Ensured alignment across and optimization of branding and marketing strategy, creative, and business and product strategies through cooperation with multiple business units, other marketing teams, legal, PR and external agencies. \n \n•\tLed consumer and enterprise brand and marketing strategy for flagship Intel® Core™ processor line, technologies and devices including Ultrabook™. Developed both short and long-term brand and naming strategy and roadmap, consumer messaging, factory and field training and tools, press and analyst communications, and worldwide launch presentations and support collateral. Spearheaded brand simplification and tiering strategy resulting in an additional $2.3B in annual revenue and an Intel Achievement Award. \n \n•\tDeveloped and implemented overall brand marketing strategy for Intel’s first entry into the discrete high-end graphics product category. Drove research, naming, identity, fit with master and product brand portfolio and go-to-market strategies for a diverse set of offerings ranging from discrete mainstream consumer graphics and media products sold at retail to mission critical high-performance compute off-load solutions directed at enterprise and government. Technology Leadership Marketing Manager Intel Corporation August 2001  –  August 2005  (4 years 1 month) •\tDeveloped and drove multiple successful cross-divisional marketing campaign and content strategies for Intel’s Technology Leadership Marketing program aimed at increasing awareness and perception of Intel as a global technology industry leader. Targeted a worldwide audience of computing and communications industry developers and influencers, Intel Sales and Marketing channels, academia, government and consumers. \n \n•\tEffectively interfaced with a vast network of marketing and technical counterparts from all areas of Intel’s research and development efforts, as well as product and corporate marketing groups, to deliver model and innovative marketing plans including positioning, messaging, competitive analysis, collateral and online content definition/development, demo definition, event and speakership planning and execution, internal training, and PR and analyst events. \n \n•\tAssistant to the CTO responsible for long-term technology vision ideation and detailed story development. Authored and activated numerous “best of show” executive keynotes, and all derivative print and online content including press and customer presentations, brochures and white papers. Executive Producer, Intel Content Services - Entertainment Group Intel Corporation August 1998  –  July 2001  (3 years) Direct report to Sr VP Content Group and special project matrix report to CEO: \n \n•\tDeveloped strategic long-range plan, including creation of a non-profit spin-off, for content acquisition and audience aggregation, and directed all production and day-to-day operations and management of ArtMuseum.net, a content and services Web site focused on extending and enhancing blockbuster art exhibitions online. \n \n•\tManaged a complex matrix of relationships among museums, developers, clients, and internal marketing, engineering and business development groups for on-time and on-budget delivery of four feature exhibitions, a member services program, and an on-site e-commerce capability. \n \n•\tWithin first operating year, site awarded WMA Best of Show for 1999; #10 position on POV Magazine 100 Best Sites of 1999; and voted Best Art Museum in Yahoo Internet Life Magazine Top of the Net for 1999. \n Consumer Marketing Strategist Intel Corporation November 1990  –  July 1998  (7 years 9 months) Reporting to Sr VP End-user Marketing Group and founding team member that developed Intel Inside co-op marketing and branding program: \n \n•\tResponsible for developing and articulating all aspects of consumer marketing strategy and tactics for launch/post-launch campaigns of Pentium, Pentium MMX, Pentium II, and Celeron processors. Awarded Intel Achievement Award for establishing meaningful Intel presence in the music and emergent multimedia industry using Intel processor and software technologies.  \n \n•\tSuccessfully drove consensus on objectives while maintaining implementation of overarching positioning and key messages on target across multiple and diverse intra- and interdepartmental groups including advertising, retail and online marketing, manufacturing, and press and developer relations. \n \n•\tGarnered CEO and relevant executive office level approvals on first-round presentation for six consecutive $100M+ consumer campaign plans. Product Marketing Liaison Intel Corporation March 1987  –  October 1990  (3 years 8 months) Tokyo, Japan •\tResponsible for Japanese market adaptation and execution of launch and promotion strategies for multiple new products, including 2 flagship microprocessor product lines, i386 and i486. \n \n•\tOversaw development of executive speech development, press collateral, advertising copy and layout, and internal, distributor and customer sales training materials and seminars. \n \n•\tAcquired working knowledge of Japanese language, business culture, and media mindset. Product Line Manager Intel Corporation March 1984  –  February 1987  (3 years) •\tOversaw overall business management of both flagship and mature microprocessor product families. \n \n•\tResponsible for all demand and price forecasts, competitive analysis and response, marketing plans and collateral development, and strategic long-range plan. \n \n•\tInitiated and executed product development proposal and related marketing plan for companion peripheral chipset achieving $15M in sales and 30% market share during first year of production. Manager, Brand Reputation Marketing Intel Corporation May 2011  – Present (4 years 4 months) Reporting into VP Brand Strategy and Reputation in Global Marketing and Communications Group: \n \n•\tDevelops and drives consumer, business and opinion leader facing brand and marketing strategy and activation for all corporate social responsibility and citizenship programs and initiatives focused on education, entrepreneurship, diversity and inclusion, research and development, sustainability, supply chain and volunteerism. Ensures alignment across multiple internal stakeholders including Executive Office and Staff, Corporate Affairs, HR, Manufacturing and Legal as well as external agency, NGO and government partners. \n \n•\tIdentified need and oversaw creation of comprehensive content and media assets for over 100 branded success stories tailored to relevant target audiences, delivering on the brand promise of making amazing experiences possible. Built to be highly customizable across print, online and video formats and available in 20 languages via an online database, these emotionally engaging narratives have successfully portrayed the brand across multiple use scenarios including traditional marketing channels as well as sales and contract negotiations, tradeshows and events, and policy and government forums. \n \n•\tAt CEO request, delivered first-of-its-kind branded cause marketing program for Conflict Minerals dubbed “In Pursuit of Conflict-free” including content/messaging, paid/social media, multi-purpose web hub, and experimental co-creation efforts with new media partners. Built trusted and cooperative relationships across a broad and comprehensive coalition of NGO, industry and other issue-related players and celebrities. Drove development and execution of product labeling strategy to facilitate field sales efforts and ease consumer identification of conflict-free products in retail and online, for which a third party non-profit extension is now in development. Garnered multiple internal recognitions. \n Manager, Brand Reputation Marketing Intel Corporation May 2011  – Present (4 years 4 months) Reporting into VP Brand Strategy and Reputation in Global Marketing and Communications Group: \n \n•\tDevelops and drives consumer, business and opinion leader facing brand and marketing strategy and activation for all corporate social responsibility and citizenship programs and initiatives focused on education, entrepreneurship, diversity and inclusion, research and development, sustainability, supply chain and volunteerism. Ensures alignment across multiple internal stakeholders including Executive Office and Staff, Corporate Affairs, HR, Manufacturing and Legal as well as external agency, NGO and government partners. \n \n•\tIdentified need and oversaw creation of comprehensive content and media assets for over 100 branded success stories tailored to relevant target audiences, delivering on the brand promise of making amazing experiences possible. Built to be highly customizable across print, online and video formats and available in 20 languages via an online database, these emotionally engaging narratives have successfully portrayed the brand across multiple use scenarios including traditional marketing channels as well as sales and contract negotiations, tradeshows and events, and policy and government forums. \n \n•\tAt CEO request, delivered first-of-its-kind branded cause marketing program for Conflict Minerals dubbed “In Pursuit of Conflict-free” including content/messaging, paid/social media, multi-purpose web hub, and experimental co-creation efforts with new media partners. Built trusted and cooperative relationships across a broad and comprehensive coalition of NGO, industry and other issue-related players and celebrities. Drove development and execution of product labeling strategy to facilitate field sales efforts and ease consumer identification of conflict-free products in retail and online, for which a third party non-profit extension is now in development. Garnered multiple internal recognitions. \n Consumer Brand and Messaging Strategist Intel September 2005  –  April 2011  (5 years 8 months) Reporting to VP Marketing Strategy in Corporate Marketing Group: \n \n•\tDeveloped and evangelized global strategy and governing principles for management of Intel’s master, processor, processor technology, and new category brands across the corporation. Ensured alignment across and optimization of branding and marketing strategy, creative, and business and product strategies through cooperation with multiple business units, other marketing teams, legal, PR and external agencies. \n \n•\tLed consumer and enterprise brand and marketing strategy for flagship Intel® Core™ processor line, technologies and devices including Ultrabook™. Developed both short and long-term brand and naming strategy and roadmap, consumer messaging, factory and field training and tools, press and analyst communications, and worldwide launch presentations and support collateral. Spearheaded brand simplification and tiering strategy resulting in an additional $2.3B in annual revenue and an Intel Achievement Award. \n \n•\tDeveloped and implemented overall brand marketing strategy for Intel’s first entry into the discrete high-end graphics product category. Drove research, naming, identity, fit with master and product brand portfolio and go-to-market strategies for a diverse set of offerings ranging from discrete mainstream consumer graphics and media products sold at retail to mission critical high-performance compute off-load solutions directed at enterprise and government. Consumer Brand and Messaging Strategist Intel September 2005  –  April 2011  (5 years 8 months) Reporting to VP Marketing Strategy in Corporate Marketing Group: \n \n•\tDeveloped and evangelized global strategy and governing principles for management of Intel’s master, processor, processor technology, and new category brands across the corporation. Ensured alignment across and optimization of branding and marketing strategy, creative, and business and product strategies through cooperation with multiple business units, other marketing teams, legal, PR and external agencies. \n \n•\tLed consumer and enterprise brand and marketing strategy for flagship Intel® Core™ processor line, technologies and devices including Ultrabook™. Developed both short and long-term brand and naming strategy and roadmap, consumer messaging, factory and field training and tools, press and analyst communications, and worldwide launch presentations and support collateral. Spearheaded brand simplification and tiering strategy resulting in an additional $2.3B in annual revenue and an Intel Achievement Award. \n \n•\tDeveloped and implemented overall brand marketing strategy for Intel’s first entry into the discrete high-end graphics product category. Drove research, naming, identity, fit with master and product brand portfolio and go-to-market strategies for a diverse set of offerings ranging from discrete mainstream consumer graphics and media products sold at retail to mission critical high-performance compute off-load solutions directed at enterprise and government. Technology Leadership Marketing Manager Intel Corporation August 2001  –  August 2005  (4 years 1 month) •\tDeveloped and drove multiple successful cross-divisional marketing campaign and content strategies for Intel’s Technology Leadership Marketing program aimed at increasing awareness and perception of Intel as a global technology industry leader. Targeted a worldwide audience of computing and communications industry developers and influencers, Intel Sales and Marketing channels, academia, government and consumers. \n \n•\tEffectively interfaced with a vast network of marketing and technical counterparts from all areas of Intel’s research and development efforts, as well as product and corporate marketing groups, to deliver model and innovative marketing plans including positioning, messaging, competitive analysis, collateral and online content definition/development, demo definition, event and speakership planning and execution, internal training, and PR and analyst events. \n \n•\tAssistant to the CTO responsible for long-term technology vision ideation and detailed story development. Authored and activated numerous “best of show” executive keynotes, and all derivative print and online content including press and customer presentations, brochures and white papers. Technology Leadership Marketing Manager Intel Corporation August 2001  –  August 2005  (4 years 1 month) •\tDeveloped and drove multiple successful cross-divisional marketing campaign and content strategies for Intel’s Technology Leadership Marketing program aimed at increasing awareness and perception of Intel as a global technology industry leader. Targeted a worldwide audience of computing and communications industry developers and influencers, Intel Sales and Marketing channels, academia, government and consumers. \n \n•\tEffectively interfaced with a vast network of marketing and technical counterparts from all areas of Intel’s research and development efforts, as well as product and corporate marketing groups, to deliver model and innovative marketing plans including positioning, messaging, competitive analysis, collateral and online content definition/development, demo definition, event and speakership planning and execution, internal training, and PR and analyst events. \n \n•\tAssistant to the CTO responsible for long-term technology vision ideation and detailed story development. Authored and activated numerous “best of show” executive keynotes, and all derivative print and online content including press and customer presentations, brochures and white papers. Executive Producer, Intel Content Services - Entertainment Group Intel Corporation August 1998  –  July 2001  (3 years) Direct report to Sr VP Content Group and special project matrix report to CEO: \n \n•\tDeveloped strategic long-range plan, including creation of a non-profit spin-off, for content acquisition and audience aggregation, and directed all production and day-to-day operations and management of ArtMuseum.net, a content and services Web site focused on extending and enhancing blockbuster art exhibitions online. \n \n•\tManaged a complex matrix of relationships among museums, developers, clients, and internal marketing, engineering and business development groups for on-time and on-budget delivery of four feature exhibitions, a member services program, and an on-site e-commerce capability. \n \n•\tWithin first operating year, site awarded WMA Best of Show for 1999; #10 position on POV Magazine 100 Best Sites of 1999; and voted Best Art Museum in Yahoo Internet Life Magazine Top of the Net for 1999. \n Executive Producer, Intel Content Services - Entertainment Group Intel Corporation August 1998  –  July 2001  (3 years) Direct report to Sr VP Content Group and special project matrix report to CEO: \n \n•\tDeveloped strategic long-range plan, including creation of a non-profit spin-off, for content acquisition and audience aggregation, and directed all production and day-to-day operations and management of ArtMuseum.net, a content and services Web site focused on extending and enhancing blockbuster art exhibitions online. \n \n•\tManaged a complex matrix of relationships among museums, developers, clients, and internal marketing, engineering and business development groups for on-time and on-budget delivery of four feature exhibitions, a member services program, and an on-site e-commerce capability. \n \n•\tWithin first operating year, site awarded WMA Best of Show for 1999; #10 position on POV Magazine 100 Best Sites of 1999; and voted Best Art Museum in Yahoo Internet Life Magazine Top of the Net for 1999. \n Consumer Marketing Strategist Intel Corporation November 1990  –  July 1998  (7 years 9 months) Reporting to Sr VP End-user Marketing Group and founding team member that developed Intel Inside co-op marketing and branding program: \n \n•\tResponsible for developing and articulating all aspects of consumer marketing strategy and tactics for launch/post-launch campaigns of Pentium, Pentium MMX, Pentium II, and Celeron processors. Awarded Intel Achievement Award for establishing meaningful Intel presence in the music and emergent multimedia industry using Intel processor and software technologies.  \n \n•\tSuccessfully drove consensus on objectives while maintaining implementation of overarching positioning and key messages on target across multiple and diverse intra- and interdepartmental groups including advertising, retail and online marketing, manufacturing, and press and developer relations. \n \n•\tGarnered CEO and relevant executive office level approvals on first-round presentation for six consecutive $100M+ consumer campaign plans. Consumer Marketing Strategist Intel Corporation November 1990  –  July 1998  (7 years 9 months) Reporting to Sr VP End-user Marketing Group and founding team member that developed Intel Inside co-op marketing and branding program: \n \n•\tResponsible for developing and articulating all aspects of consumer marketing strategy and tactics for launch/post-launch campaigns of Pentium, Pentium MMX, Pentium II, and Celeron processors. Awarded Intel Achievement Award for establishing meaningful Intel presence in the music and emergent multimedia industry using Intel processor and software technologies.  \n \n•\tSuccessfully drove consensus on objectives while maintaining implementation of overarching positioning and key messages on target across multiple and diverse intra- and interdepartmental groups including advertising, retail and online marketing, manufacturing, and press and developer relations. \n \n•\tGarnered CEO and relevant executive office level approvals on first-round presentation for six consecutive $100M+ consumer campaign plans. Product Marketing Liaison Intel Corporation March 1987  –  October 1990  (3 years 8 months) Tokyo, Japan •\tResponsible for Japanese market adaptation and execution of launch and promotion strategies for multiple new products, including 2 flagship microprocessor product lines, i386 and i486. \n \n•\tOversaw development of executive speech development, press collateral, advertising copy and layout, and internal, distributor and customer sales training materials and seminars. \n \n•\tAcquired working knowledge of Japanese language, business culture, and media mindset. Product Marketing Liaison Intel Corporation March 1987  –  October 1990  (3 years 8 months) Tokyo, Japan •\tResponsible for Japanese market adaptation and execution of launch and promotion strategies for multiple new products, including 2 flagship microprocessor product lines, i386 and i486. \n \n•\tOversaw development of executive speech development, press collateral, advertising copy and layout, and internal, distributor and customer sales training materials and seminars. \n \n•\tAcquired working knowledge of Japanese language, business culture, and media mindset. Product Line Manager Intel Corporation March 1984  –  February 1987  (3 years) •\tOversaw overall business management of both flagship and mature microprocessor product families. \n \n•\tResponsible for all demand and price forecasts, competitive analysis and response, marketing plans and collateral development, and strategic long-range plan. \n \n•\tInitiated and executed product development proposal and related marketing plan for companion peripheral chipset achieving $15M in sales and 30% market share during first year of production. Product Line Manager Intel Corporation March 1984  –  February 1987  (3 years) •\tOversaw overall business management of both flagship and mature microprocessor product families. \n \n•\tResponsible for all demand and price forecasts, competitive analysis and response, marketing plans and collateral development, and strategic long-range plan. \n \n•\tInitiated and executed product development proposal and related marketing plan for companion peripheral chipset achieving $15M in sales and 30% market share during first year of production. Languages English Native or bilingual proficiency French Professional working proficiency Spanish Limited working proficiency Japanese Limited working proficiency English Native or bilingual proficiency French Professional working proficiency Spanish Limited working proficiency Japanese Limited working proficiency English Native or bilingual proficiency French Professional working proficiency Spanish Limited working proficiency Japanese Limited working proficiency Native or bilingual proficiency Professional working proficiency Limited working proficiency Limited working proficiency Skills Social Media Marketing Strategic Partnerships Product Marketing Positioning Go-to-market Strategy Marketing Marketing Strategy Online Marketing Leadership Competitive Analysis Multi-channel Marketing Segmentation Product Management Analytics Marketing Communications Product Development Brand Development SEM Integrated Marketing Online Advertising Messaging Demand Generation Marketing Management Cross-functional Team... Strategy Digital Strategy Digital Marketing Marketing Research Start-ups Consumer Electronics Product Launch Global Marketing See 17+     See less Skills  Social Media Marketing Strategic Partnerships Product Marketing Positioning Go-to-market Strategy Marketing Marketing Strategy Online Marketing Leadership Competitive Analysis Multi-channel Marketing Segmentation Product Management Analytics Marketing Communications Product Development Brand Development SEM Integrated Marketing Online Advertising Messaging Demand Generation Marketing Management Cross-functional Team... Strategy Digital Strategy Digital Marketing Marketing Research Start-ups Consumer Electronics Product Launch Global Marketing See 17+     See less Social Media Marketing Strategic Partnerships Product Marketing Positioning Go-to-market Strategy Marketing Marketing Strategy Online Marketing Leadership Competitive Analysis Multi-channel Marketing Segmentation Product Management Analytics Marketing Communications Product Development Brand Development SEM Integrated Marketing Online Advertising Messaging Demand Generation Marketing Management Cross-functional Team... Strategy Digital Strategy Digital Marketing Marketing Research Start-ups Consumer Electronics Product Launch Global Marketing See 17+     See less Social Media Marketing Strategic Partnerships Product Marketing Positioning Go-to-market Strategy Marketing Marketing Strategy Online Marketing Leadership Competitive Analysis Multi-channel Marketing Segmentation Product Management Analytics Marketing Communications Product Development Brand Development SEM Integrated Marketing Online Advertising Messaging Demand Generation Marketing Management Cross-functional Team... Strategy Digital Strategy Digital Marketing Marketing Research Start-ups Consumer Electronics Product Launch Global Marketing See 17+     See less Education University of California, Los Angeles BA Economics,  Economics 1979  – 1983 University of California, Los Angeles BA Economics,  Economics 1979  – 1983 University of California, Los Angeles BA Economics,  Economics 1979  – 1983 University of California, Los Angeles BA Economics,  Economics 1979  – 1983 ", "Summary Innovation is not limited to technology. I watch the market and the world closely to stay ahead of trends with the purpose of creating marketing strategies with fresh, forward-thinking approaches, always pushing boundaries to create breakthrough experiences.  \n \nI'm passionate about providing opportunities to put a “face” on technology. To engage, educate and delight our employees, partners and customers, leaving them with positive, memorable Intel experiences that spark their imagination and fuel their own innovation.  \n \nKnown as a dynamic and persuasive leader, I am respected as a key influencer who leads with strategy and puts it into action maximizing profitability and shareholder value. \n \nI’ve built and led global cross-functional virtual and direct teams, delivering high impact productivity and profitability through the creation of new market revenue streams, applying effective sales and engagement strategies. I have sold to, through and with partners exceeding all annual revenue targets and objectives consistently.  \n \nMy leadership style is defined by open and very direct communication, smart energy, and focused determination. Among my strengths are the ability to recognize and adapt to new market opportunities, set a vision, align diverse teams around common goals, and lead through change and transition. I'm often seen as a disruptive technology in human form!  \n \nI'm passionate about paying it forward, developing the next generation of marketing and sales professionals and creating a thriving work environment built on diversity and inclusion. Summary Innovation is not limited to technology. I watch the market and the world closely to stay ahead of trends with the purpose of creating marketing strategies with fresh, forward-thinking approaches, always pushing boundaries to create breakthrough experiences.  \n \nI'm passionate about providing opportunities to put a “face” on technology. To engage, educate and delight our employees, partners and customers, leaving them with positive, memorable Intel experiences that spark their imagination and fuel their own innovation.  \n \nKnown as a dynamic and persuasive leader, I am respected as a key influencer who leads with strategy and puts it into action maximizing profitability and shareholder value. \n \nI’ve built and led global cross-functional virtual and direct teams, delivering high impact productivity and profitability through the creation of new market revenue streams, applying effective sales and engagement strategies. I have sold to, through and with partners exceeding all annual revenue targets and objectives consistently.  \n \nMy leadership style is defined by open and very direct communication, smart energy, and focused determination. Among my strengths are the ability to recognize and adapt to new market opportunities, set a vision, align diverse teams around common goals, and lead through change and transition. I'm often seen as a disruptive technology in human form!  \n \nI'm passionate about paying it forward, developing the next generation of marketing and sales professionals and creating a thriving work environment built on diversity and inclusion. Innovation is not limited to technology. I watch the market and the world closely to stay ahead of trends with the purpose of creating marketing strategies with fresh, forward-thinking approaches, always pushing boundaries to create breakthrough experiences.  \n \nI'm passionate about providing opportunities to put a “face” on technology. To engage, educate and delight our employees, partners and customers, leaving them with positive, memorable Intel experiences that spark their imagination and fuel their own innovation.  \n \nKnown as a dynamic and persuasive leader, I am respected as a key influencer who leads with strategy and puts it into action maximizing profitability and shareholder value. \n \nI’ve built and led global cross-functional virtual and direct teams, delivering high impact productivity and profitability through the creation of new market revenue streams, applying effective sales and engagement strategies. I have sold to, through and with partners exceeding all annual revenue targets and objectives consistently.  \n \nMy leadership style is defined by open and very direct communication, smart energy, and focused determination. Among my strengths are the ability to recognize and adapt to new market opportunities, set a vision, align diverse teams around common goals, and lead through change and transition. I'm often seen as a disruptive technology in human form!  \n \nI'm passionate about paying it forward, developing the next generation of marketing and sales professionals and creating a thriving work environment built on diversity and inclusion. Innovation is not limited to technology. I watch the market and the world closely to stay ahead of trends with the purpose of creating marketing strategies with fresh, forward-thinking approaches, always pushing boundaries to create breakthrough experiences.  \n \nI'm passionate about providing opportunities to put a “face” on technology. To engage, educate and delight our employees, partners and customers, leaving them with positive, memorable Intel experiences that spark their imagination and fuel their own innovation.  \n \nKnown as a dynamic and persuasive leader, I am respected as a key influencer who leads with strategy and puts it into action maximizing profitability and shareholder value. \n \nI’ve built and led global cross-functional virtual and direct teams, delivering high impact productivity and profitability through the creation of new market revenue streams, applying effective sales and engagement strategies. I have sold to, through and with partners exceeding all annual revenue targets and objectives consistently.  \n \nMy leadership style is defined by open and very direct communication, smart energy, and focused determination. Among my strengths are the ability to recognize and adapt to new market opportunities, set a vision, align diverse teams around common goals, and lead through change and transition. I'm often seen as a disruptive technology in human form!  \n \nI'm passionate about paying it forward, developing the next generation of marketing and sales professionals and creating a thriving work environment built on diversity and inclusion. Experience Vice President, Software Marketing Intel Corporation May 2014  – Present (1 year 4 months) Hillsboro, OR Vice President since February 2015, served as General Manager from 2013. \n \nLead team responsible for raising the profile and visibility of Intel(r) Software among Intel's customers, business partners and employees paving the path to rapid adoption of new Intel technologies. \n \nLead engagement with software ecosystem, providing the tools and programs to encourage software innovation on Intel architecture, now and through all technology transitions. Reveal hardware features and capabilities through software and apps, driving creation of new user experiences that delight end users. \n \nManage marketing mix for Intel Software, including: marketing strategy, software narrative, thought leadership, internal and external communications, social media strategy, influencer engagement, industry events, field communications and training, operating principles and creative. \n \nScale industry readiness through developer activation, adoption and evangelism fueling market adoption and growth. \n Vice President, Software Marketing Intel Corporation May 2014  – Present (1 year 4 months) Hillsboro, OR Vice President since February 2015, served as General Manager from 2013. \n \nLead team responsible for raising the profile and visibility of Intel(r) Software among Intel's customers, business partners and employees paving the path to rapid adoption of new Intel technologies. \n \nLead engagement with software ecosystem, providing the tools and programs to encourage software innovation on Intel architecture, now and through all technology transitions. Reveal hardware features and capabilities through software and apps, driving creation of new user experiences that delight end users. \n \nManage marketing mix for Intel Software, including: marketing strategy, software narrative, thought leadership, internal and external communications, social media strategy, influencer engagement, industry events, field communications and training, operating principles and creative. \n \nScale industry readiness through developer activation, adoption and evangelism fueling market adoption and growth. \n Vice President, Software Marketing Intel Corporation May 2014  – Present (1 year 4 months) Hillsboro, OR Vice President since February 2015, served as General Manager from 2013. \n \nLead team responsible for raising the profile and visibility of Intel(r) Software among Intel's customers, business partners and employees paving the path to rapid adoption of new Intel technologies. \n \nLead engagement with software ecosystem, providing the tools and programs to encourage software innovation on Intel architecture, now and through all technology transitions. Reveal hardware features and capabilities through software and apps, driving creation of new user experiences that delight end users. \n \nManage marketing mix for Intel Software, including: marketing strategy, software narrative, thought leadership, internal and external communications, social media strategy, influencer engagement, industry events, field communications and training, operating principles and creative. \n \nScale industry readiness through developer activation, adoption and evangelism fueling market adoption and growth. \n Skills Product Marketing Strategic Partnerships Strategy Business Alliances Multi-channel Marketing Strategic Alliances Go-to-market Strategy Global Business... Marketing Strategy Sales Management Cross-functional Team... Partner Management Lead Generation Product Management Marketing Channel Partners Semiconductors Demand Generation SaaS Sales Enablement Enterprise Software Cloud Computing Start-ups Competitive Analysis Solution Selling Business Development Analytics Professional Services Salesforce.com CRM Marketing Communications Management tea Strategic Communications Creative Strategy Diversity & Inclusion Creative Writing Team Leadership Women's Leadership Equality & Diversity Communication Coaching Program Management Leadership Business Strategy See 30+     See less Skills  Product Marketing Strategic Partnerships Strategy Business Alliances Multi-channel Marketing Strategic Alliances Go-to-market Strategy Global Business... Marketing Strategy Sales Management Cross-functional Team... Partner Management Lead Generation Product Management Marketing Channel Partners Semiconductors Demand Generation SaaS Sales Enablement Enterprise Software Cloud Computing Start-ups Competitive Analysis Solution Selling Business Development Analytics Professional Services Salesforce.com CRM Marketing Communications Management tea Strategic Communications Creative Strategy Diversity & Inclusion Creative Writing Team Leadership Women's Leadership Equality & Diversity Communication Coaching Program Management Leadership Business Strategy See 30+     See less Product Marketing Strategic Partnerships Strategy Business Alliances Multi-channel Marketing Strategic Alliances Go-to-market Strategy Global Business... Marketing Strategy Sales Management Cross-functional Team... Partner Management Lead Generation Product Management Marketing Channel Partners Semiconductors Demand Generation SaaS Sales Enablement Enterprise Software Cloud Computing Start-ups Competitive Analysis Solution Selling Business Development Analytics Professional Services Salesforce.com CRM Marketing Communications Management tea Strategic Communications Creative Strategy Diversity & Inclusion Creative Writing Team Leadership Women's Leadership Equality & Diversity Communication Coaching Program Management Leadership Business Strategy See 30+     See less Product Marketing Strategic Partnerships Strategy Business Alliances Multi-channel Marketing Strategic Alliances Go-to-market Strategy Global Business... Marketing Strategy Sales Management Cross-functional Team... Partner Management Lead Generation Product Management Marketing Channel Partners Semiconductors Demand Generation SaaS Sales Enablement Enterprise Software Cloud Computing Start-ups Competitive Analysis Solution Selling Business Development Analytics Professional Services Salesforce.com CRM Marketing Communications Management tea Strategic Communications Creative Strategy Diversity & Inclusion Creative Writing Team Leadership Women's Leadership Equality & Diversity Communication Coaching Program Management Leadership Business Strategy See 30+     See less ", "Summary Friend of technology, deeply inspired by people and my inner creative is constantly high-fiving my inner rational. There’s always a party going on in my head, just waiting to embrace the next great experiment in digital marketing.  \n \nI have a 12 year history of producing analytics-driven results within limited budgets, managing all areas of social, SEO and digital marketing programs and developing integrated campaigns that touch droves for major global brands. My special niche is in utilizing SEO, SEM, social marketing and digital media to develop audiences and stimulate brand advocates. I’m a fierce digital marketing strategist.  \n \nBut wait, there’s more! What excites me most is working with inspired individuals to create and deliver really cool things. I’m on the path to discover and conquer the technology-driven marketing landscape as it evolves, who’s with me? \n \nSpecialties: Organic search engine optimization, SEO, social media optimization, SMO, social media marketing strategies, community management, content optimization, XML, HTML, Google analytics, Adobe Site Catalyst, Adobe CQ, project management, content management, project implementation, program management, digital marketing strategy, online visibility, event management, YouTube video optimization, blog optimization, link building Summary Friend of technology, deeply inspired by people and my inner creative is constantly high-fiving my inner rational. There’s always a party going on in my head, just waiting to embrace the next great experiment in digital marketing.  \n \nI have a 12 year history of producing analytics-driven results within limited budgets, managing all areas of social, SEO and digital marketing programs and developing integrated campaigns that touch droves for major global brands. My special niche is in utilizing SEO, SEM, social marketing and digital media to develop audiences and stimulate brand advocates. I’m a fierce digital marketing strategist.  \n \nBut wait, there’s more! What excites me most is working with inspired individuals to create and deliver really cool things. I’m on the path to discover and conquer the technology-driven marketing landscape as it evolves, who’s with me? \n \nSpecialties: Organic search engine optimization, SEO, social media optimization, SMO, social media marketing strategies, community management, content optimization, XML, HTML, Google analytics, Adobe Site Catalyst, Adobe CQ, project management, content management, project implementation, program management, digital marketing strategy, online visibility, event management, YouTube video optimization, blog optimization, link building Friend of technology, deeply inspired by people and my inner creative is constantly high-fiving my inner rational. There’s always a party going on in my head, just waiting to embrace the next great experiment in digital marketing.  \n \nI have a 12 year history of producing analytics-driven results within limited budgets, managing all areas of social, SEO and digital marketing programs and developing integrated campaigns that touch droves for major global brands. My special niche is in utilizing SEO, SEM, social marketing and digital media to develop audiences and stimulate brand advocates. I’m a fierce digital marketing strategist.  \n \nBut wait, there’s more! What excites me most is working with inspired individuals to create and deliver really cool things. I’m on the path to discover and conquer the technology-driven marketing landscape as it evolves, who’s with me? \n \nSpecialties: Organic search engine optimization, SEO, social media optimization, SMO, social media marketing strategies, community management, content optimization, XML, HTML, Google analytics, Adobe Site Catalyst, Adobe CQ, project management, content management, project implementation, program management, digital marketing strategy, online visibility, event management, YouTube video optimization, blog optimization, link building Friend of technology, deeply inspired by people and my inner creative is constantly high-fiving my inner rational. There’s always a party going on in my head, just waiting to embrace the next great experiment in digital marketing.  \n \nI have a 12 year history of producing analytics-driven results within limited budgets, managing all areas of social, SEO and digital marketing programs and developing integrated campaigns that touch droves for major global brands. My special niche is in utilizing SEO, SEM, social marketing and digital media to develop audiences and stimulate brand advocates. I’m a fierce digital marketing strategist.  \n \nBut wait, there’s more! What excites me most is working with inspired individuals to create and deliver really cool things. I’m on the path to discover and conquer the technology-driven marketing landscape as it evolves, who’s with me? \n \nSpecialties: Organic search engine optimization, SEO, social media optimization, SMO, social media marketing strategies, community management, content optimization, XML, HTML, Google analytics, Adobe Site Catalyst, Adobe CQ, project management, content management, project implementation, program management, digital marketing strategy, online visibility, event management, YouTube video optimization, blog optimization, link building Experience Campaign Manager, B2B Social Marketing Intel Corporation May 2015  – Present (4 months) Portland, Oregon Area Account Supervisor, Earned Media CMD October 2014  –  May 2015  (8 months) Portland, Oregon Area - Strategy: Provide leadership on B2B client projects and tasks. \n- Ideation: Develop winning creative ideas for social media marketing that cut through the clutter and are aligned with business goals. \n- Content: Create editorial content in form of blogs and social posts. \n- Planning: Create social media content plans. \n- Client relations: Interface with clients, provide strategic counsel and expertise, manage budgets, timelines and third-party vendor relationships. \n- Community management: Shepherd client communities with content and engagement strategies. \n- Multimedia: Manage digital and photo/video production. \n- Integrated project management: Work with other internal groups to complete client projects and initiatives on time and on budget. \n Audience Development Strategist; Digital Marketing Manager Intel Corporation via MINDTECK (USA) Inc. March 2013  –  October 2014  (1 year 8 months) Hillsboro, OR •\tDrive traffic by developing/displaying great content  \n•\tDiscover audiences through SEO, SEM and Social sourcing \n•\tGenerate Demand for web content, engage audience with tools for success \n•\tEnhance web presence, online visibility with organic search engine optimization (SEO) and social marketing best practice \n•\tSocial integration with Intel.com: Develop and deliver conversations that matter to IT decision maker audience Manager, Global Social Marketing Xerox October 2012  –  April 2013  (7 months) As my key strengths in strategic SEO and corporate website integration with social marketing activity evolved, I've become a Global Social Marketing Manager. I am dedicated to growing social programs that have a direct impact on organic search and overall corporate visibility in digital marketing practice. My key responsibilities include: \n \n- Manage Corporate, Global YouTube presence  \n- Oversee Google+ presence (as it emerges as a social marketing platform) \n- Manage social marketing tools deployed company wide \n- Develop platform managers' knowledge and application of SEO best practice (Facebook, Twitter, Blogs) \n- Work with Interactive Marketing team to integrate social properties on corporate website \n- Use data analysis to drive enhancements and grow social marketing platforms \n \nIt is my goal to increase engagement and visibility on the social platforms I manage, by delivering strong content and applying SEO best practice. Search And Social Marketing Manager - Xerox Interactive Xerox Corporation November 2008  –  October 2012  (4 years) Interactive Marketing; SEO and Social Media Marketing Manager \n- Social Media Center of Excellence; represent interactive marketing/Xerox.com with council of 5 cross-functional colleagues \n- Establish Xerox’s social media strategy and presence on platforms like Facebook, Twitter, Blogs, YouTube, etc. \n- Create and promote corporate social media guidelines, training and best practice materials \n- Evangelize social media participation and execution of social initiatives to C-level executives and line-of-business owners  \n- Champion and enable social media integration on corporate website (social aggregator, share and follow modules) \n- Evaluate potential social marketing tools, emerging technologies, vendors and partners \n- Promote and train social practitioners on SEO best practices for social media platforms \n- Analyze social traffic and engagement details for discovery and strategic development on corp website and social platforms Web Developer, Worldwide Product/ Software Launch Xerox Corporation April 2006  –  November 2008  (2 years 8 months) Built pages for product launches using HTML, XML, some JAVA on LAMP and BV platforms Event Manager VTM, Inc. 2005  –  2006  (1 year) Manage domestic and international corporate events for high-tech associations (developers conferences, trade shows, compliance workshops, training days, press release and board meetings) Content Specialist- Brand Design Nike 2002  –  2005  (3 years) - Coordinate digital assets and photography for footwear and special program teams including color correction, rights management and asset distribution to end users (mainly designers, production artists and retailers) \n- Participated in cross-functional meetings for launch planning, in-store and merchandising graphics kits \n- Organize vendor relationships with graphic design firms College and International Recruitment Walt Disney World 1999  –  2002  (3 years) College and International recruitment, WDW College program, College program campus representative Product Design- Intern Hewlett Packard May 2000  –  October 2000  (6 months) Product Marketing- Intern Hewlett Packard May 1998  –  October 1998  (6 months) Campaign Manager, B2B Social Marketing Intel Corporation May 2015  – Present (4 months) Portland, Oregon Area Campaign Manager, B2B Social Marketing Intel Corporation May 2015  – Present (4 months) Portland, Oregon Area Account Supervisor, Earned Media CMD October 2014  –  May 2015  (8 months) Portland, Oregon Area - Strategy: Provide leadership on B2B client projects and tasks. \n- Ideation: Develop winning creative ideas for social media marketing that cut through the clutter and are aligned with business goals. \n- Content: Create editorial content in form of blogs and social posts. \n- Planning: Create social media content plans. \n- Client relations: Interface with clients, provide strategic counsel and expertise, manage budgets, timelines and third-party vendor relationships. \n- Community management: Shepherd client communities with content and engagement strategies. \n- Multimedia: Manage digital and photo/video production. \n- Integrated project management: Work with other internal groups to complete client projects and initiatives on time and on budget. \n Account Supervisor, Earned Media CMD October 2014  –  May 2015  (8 months) Portland, Oregon Area - Strategy: Provide leadership on B2B client projects and tasks. \n- Ideation: Develop winning creative ideas for social media marketing that cut through the clutter and are aligned with business goals. \n- Content: Create editorial content in form of blogs and social posts. \n- Planning: Create social media content plans. \n- Client relations: Interface with clients, provide strategic counsel and expertise, manage budgets, timelines and third-party vendor relationships. \n- Community management: Shepherd client communities with content and engagement strategies. \n- Multimedia: Manage digital and photo/video production. \n- Integrated project management: Work with other internal groups to complete client projects and initiatives on time and on budget. \n Audience Development Strategist; Digital Marketing Manager Intel Corporation via MINDTECK (USA) Inc. March 2013  –  October 2014  (1 year 8 months) Hillsboro, OR •\tDrive traffic by developing/displaying great content  \n•\tDiscover audiences through SEO, SEM and Social sourcing \n•\tGenerate Demand for web content, engage audience with tools for success \n•\tEnhance web presence, online visibility with organic search engine optimization (SEO) and social marketing best practice \n•\tSocial integration with Intel.com: Develop and deliver conversations that matter to IT decision maker audience Audience Development Strategist; Digital Marketing Manager Intel Corporation via MINDTECK (USA) Inc. March 2013  –  October 2014  (1 year 8 months) Hillsboro, OR •\tDrive traffic by developing/displaying great content  \n•\tDiscover audiences through SEO, SEM and Social sourcing \n•\tGenerate Demand for web content, engage audience with tools for success \n•\tEnhance web presence, online visibility with organic search engine optimization (SEO) and social marketing best practice \n•\tSocial integration with Intel.com: Develop and deliver conversations that matter to IT decision maker audience Manager, Global Social Marketing Xerox October 2012  –  April 2013  (7 months) As my key strengths in strategic SEO and corporate website integration with social marketing activity evolved, I've become a Global Social Marketing Manager. I am dedicated to growing social programs that have a direct impact on organic search and overall corporate visibility in digital marketing practice. My key responsibilities include: \n \n- Manage Corporate, Global YouTube presence  \n- Oversee Google+ presence (as it emerges as a social marketing platform) \n- Manage social marketing tools deployed company wide \n- Develop platform managers' knowledge and application of SEO best practice (Facebook, Twitter, Blogs) \n- Work with Interactive Marketing team to integrate social properties on corporate website \n- Use data analysis to drive enhancements and grow social marketing platforms \n \nIt is my goal to increase engagement and visibility on the social platforms I manage, by delivering strong content and applying SEO best practice. Manager, Global Social Marketing Xerox October 2012  –  April 2013  (7 months) As my key strengths in strategic SEO and corporate website integration with social marketing activity evolved, I've become a Global Social Marketing Manager. I am dedicated to growing social programs that have a direct impact on organic search and overall corporate visibility in digital marketing practice. My key responsibilities include: \n \n- Manage Corporate, Global YouTube presence  \n- Oversee Google+ presence (as it emerges as a social marketing platform) \n- Manage social marketing tools deployed company wide \n- Develop platform managers' knowledge and application of SEO best practice (Facebook, Twitter, Blogs) \n- Work with Interactive Marketing team to integrate social properties on corporate website \n- Use data analysis to drive enhancements and grow social marketing platforms \n \nIt is my goal to increase engagement and visibility on the social platforms I manage, by delivering strong content and applying SEO best practice. Search And Social Marketing Manager - Xerox Interactive Xerox Corporation November 2008  –  October 2012  (4 years) Interactive Marketing; SEO and Social Media Marketing Manager \n- Social Media Center of Excellence; represent interactive marketing/Xerox.com with council of 5 cross-functional colleagues \n- Establish Xerox’s social media strategy and presence on platforms like Facebook, Twitter, Blogs, YouTube, etc. \n- Create and promote corporate social media guidelines, training and best practice materials \n- Evangelize social media participation and execution of social initiatives to C-level executives and line-of-business owners  \n- Champion and enable social media integration on corporate website (social aggregator, share and follow modules) \n- Evaluate potential social marketing tools, emerging technologies, vendors and partners \n- Promote and train social practitioners on SEO best practices for social media platforms \n- Analyze social traffic and engagement details for discovery and strategic development on corp website and social platforms Search And Social Marketing Manager - Xerox Interactive Xerox Corporation November 2008  –  October 2012  (4 years) Interactive Marketing; SEO and Social Media Marketing Manager \n- Social Media Center of Excellence; represent interactive marketing/Xerox.com with council of 5 cross-functional colleagues \n- Establish Xerox’s social media strategy and presence on platforms like Facebook, Twitter, Blogs, YouTube, etc. \n- Create and promote corporate social media guidelines, training and best practice materials \n- Evangelize social media participation and execution of social initiatives to C-level executives and line-of-business owners  \n- Champion and enable social media integration on corporate website (social aggregator, share and follow modules) \n- Evaluate potential social marketing tools, emerging technologies, vendors and partners \n- Promote and train social practitioners on SEO best practices for social media platforms \n- Analyze social traffic and engagement details for discovery and strategic development on corp website and social platforms Web Developer, Worldwide Product/ Software Launch Xerox Corporation April 2006  –  November 2008  (2 years 8 months) Built pages for product launches using HTML, XML, some JAVA on LAMP and BV platforms Web Developer, Worldwide Product/ Software Launch Xerox Corporation April 2006  –  November 2008  (2 years 8 months) Built pages for product launches using HTML, XML, some JAVA on LAMP and BV platforms Event Manager VTM, Inc. 2005  –  2006  (1 year) Manage domestic and international corporate events for high-tech associations (developers conferences, trade shows, compliance workshops, training days, press release and board meetings) Event Manager VTM, Inc. 2005  –  2006  (1 year) Manage domestic and international corporate events for high-tech associations (developers conferences, trade shows, compliance workshops, training days, press release and board meetings) Content Specialist- Brand Design Nike 2002  –  2005  (3 years) - Coordinate digital assets and photography for footwear and special program teams including color correction, rights management and asset distribution to end users (mainly designers, production artists and retailers) \n- Participated in cross-functional meetings for launch planning, in-store and merchandising graphics kits \n- Organize vendor relationships with graphic design firms Content Specialist- Brand Design Nike 2002  –  2005  (3 years) - Coordinate digital assets and photography for footwear and special program teams including color correction, rights management and asset distribution to end users (mainly designers, production artists and retailers) \n- Participated in cross-functional meetings for launch planning, in-store and merchandising graphics kits \n- Organize vendor relationships with graphic design firms College and International Recruitment Walt Disney World 1999  –  2002  (3 years) College and International recruitment, WDW College program, College program campus representative College and International Recruitment Walt Disney World 1999  –  2002  (3 years) College and International recruitment, WDW College program, College program campus representative Product Design- Intern Hewlett Packard May 2000  –  October 2000  (6 months) Product Design- Intern Hewlett Packard May 2000  –  October 2000  (6 months) Product Marketing- Intern Hewlett Packard May 1998  –  October 1998  (6 months) Product Marketing- Intern Hewlett Packard May 1998  –  October 1998  (6 months) Skills Blog optimization Social Media Development Social Media Marketing Google Analytics Link Building SMO Content Management HTML Event Management XML Blogging Social Media Digital Marketing Marketing Communications Online Marketing Social Networking Facebook Web Analytics Copywriting Marketing Strategy YouTube SEM Web Development Analytics Public Relations Writing Strategy Development Public Speaking Competitive Analysis Event Planning Lead Generation SEO Integrated Marketing Web Design Online Advertising Press Releases Interactive Marketing B2B Web Content Email Marketing Google Adwords PPC Marketing Direct Marketing E-commerce B2B Marketing Community Management Web Marketing Mobile Marketing Digital Strategy See 35+     See less Skills  Blog optimization Social Media Development Social Media Marketing Google Analytics Link Building SMO Content Management HTML Event Management XML Blogging Social Media Digital Marketing Marketing Communications Online Marketing Social Networking Facebook Web Analytics Copywriting Marketing Strategy YouTube SEM Web Development Analytics Public Relations Writing Strategy Development Public Speaking Competitive Analysis Event Planning Lead Generation SEO Integrated Marketing Web Design Online Advertising Press Releases Interactive Marketing B2B Web Content Email Marketing Google Adwords PPC Marketing Direct Marketing E-commerce B2B Marketing Community Management Web Marketing Mobile Marketing Digital Strategy See 35+     See less Blog optimization Social Media Development Social Media Marketing Google Analytics Link Building SMO Content Management HTML Event Management XML Blogging Social Media Digital Marketing Marketing Communications Online Marketing Social Networking Facebook Web Analytics Copywriting Marketing Strategy YouTube SEM Web Development Analytics Public Relations Writing Strategy Development Public Speaking Competitive Analysis Event Planning Lead Generation SEO Integrated Marketing Web Design Online Advertising Press Releases Interactive Marketing B2B Web Content Email Marketing Google Adwords PPC Marketing Direct Marketing E-commerce B2B Marketing Community Management Web Marketing Mobile Marketing Digital Strategy See 35+     See less Blog optimization Social Media Development Social Media Marketing Google Analytics Link Building SMO Content Management HTML Event Management XML Blogging Social Media Digital Marketing Marketing Communications Online Marketing Social Networking Facebook Web Analytics Copywriting Marketing Strategy YouTube SEM Web Development Analytics Public Relations Writing Strategy Development Public Speaking Competitive Analysis Event Planning Lead Generation SEO Integrated Marketing Web Design Online Advertising Press Releases Interactive Marketing B2B Web Content Email Marketing Google Adwords PPC Marketing Direct Marketing E-commerce B2B Marketing Community Management Web Marketing Mobile Marketing Digital Strategy See 35+     See less Education Oregon State University BS,  Marketing ,  International Business & Communications 1997  – 2002 Activities and Societies:  Kappa Kappa Gamma (sorority) ,  ASOSU student governement Universitetet i Agder (UiA) International Studies,  Economics ,  Marketing 2001  – 2001 Study abroad program Oregon State University BS,  Marketing ,  International Business & Communications 1997  – 2002 Activities and Societies:  Kappa Kappa Gamma (sorority) ,  ASOSU student governement Oregon State University BS,  Marketing ,  International Business & Communications 1997  – 2002 Activities and Societies:  Kappa Kappa Gamma (sorority) ,  ASOSU student governement Oregon State University BS,  Marketing ,  International Business & Communications 1997  – 2002 Activities and Societies:  Kappa Kappa Gamma (sorority) ,  ASOSU student governement Universitetet i Agder (UiA) International Studies,  Economics ,  Marketing 2001  – 2001 Study abroad program Universitetet i Agder (UiA) International Studies,  Economics ,  Marketing 2001  – 2001 Study abroad program Universitetet i Agder (UiA) International Studies,  Economics ,  Marketing 2001  – 2001 Study abroad program Honors & Awards Google Glass Explorer Google July 2013 In July 2013 I picked up my explorer edition Google Glass at Google HQ in Mountian View California. It was a huge honor to be selected as a Glass Explorer through the #ifihadglass campaign (February 2013). To date, being part of the Glass Explorer program has been exciting, interesting and pretty much my favorite experience to date. Google Glass Explorer Google July 2013 In July 2013 I picked up my explorer edition Google Glass at Google HQ in Mountian View California. It was a huge honor to be selected as a Glass Explorer through the #ifihadglass campaign (February 2013). To date, being part of the Glass Explorer program has been exciting, interesting and pretty much my favorite experience to date. Google Glass Explorer Google July 2013 In July 2013 I picked up my explorer edition Google Glass at Google HQ in Mountian View California. It was a huge honor to be selected as a Glass Explorer through the #ifihadglass campaign (February 2013). To date, being part of the Glass Explorer program has been exciting, interesting and pretty much my favorite experience to date. Google Glass Explorer Google July 2013 In July 2013 I picked up my explorer edition Google Glass at Google HQ in Mountian View California. It was a huge honor to be selected as a Glass Explorer through the #ifihadglass campaign (February 2013). To date, being part of the Glass Explorer program has been exciting, interesting and pretty much my favorite experience to date. ", "Summary Senior leader and manager with extensive technology, strategy, product planning, roadmap planning,product management, program management and product marketing experience across networking & communications,embedded, notebooks, netbooks, tablets, consumer electronics and data center. Have successfully handled work responsibilities in start up environment as well as large business units. \n \nSpecialties: Strategy, Product Planning, Product Management, Product Marketing, Program Management, Project Management, People Management, General Management, Customer projects, Technology & market directions, Business Planning, Business Operations, Engineering and Architecture Summary Senior leader and manager with extensive technology, strategy, product planning, roadmap planning,product management, program management and product marketing experience across networking & communications,embedded, notebooks, netbooks, tablets, consumer electronics and data center. Have successfully handled work responsibilities in start up environment as well as large business units. \n \nSpecialties: Strategy, Product Planning, Product Management, Product Marketing, Program Management, Project Management, People Management, General Management, Customer projects, Technology & market directions, Business Planning, Business Operations, Engineering and Architecture Senior leader and manager with extensive technology, strategy, product planning, roadmap planning,product management, program management and product marketing experience across networking & communications,embedded, notebooks, netbooks, tablets, consumer electronics and data center. Have successfully handled work responsibilities in start up environment as well as large business units. \n \nSpecialties: Strategy, Product Planning, Product Management, Product Marketing, Program Management, Project Management, People Management, General Management, Customer projects, Technology & market directions, Business Planning, Business Operations, Engineering and Architecture Senior leader and manager with extensive technology, strategy, product planning, roadmap planning,product management, program management and product marketing experience across networking & communications,embedded, notebooks, netbooks, tablets, consumer electronics and data center. Have successfully handled work responsibilities in start up environment as well as large business units. \n \nSpecialties: Strategy, Product Planning, Product Management, Product Marketing, Program Management, Project Management, People Management, General Management, Customer projects, Technology & market directions, Business Planning, Business Operations, Engineering and Architecture Experience Director, IOT New Segments Growth and Innovation Strategy, Planning, Execution & Marketing Intel Corporation August 2015  – Present (1 month) Santa Clara Director, Ecosystem Strategy & Biz Planning(PCs, Phones, Tablets, Data Center, Internet of Things) Intel February 2013  –  August 2015  (2 years 7 months) Santa Clara, CA Senior leader & manager of a team of strategic planners focused on developing application ecosystem strategy and delivering high quality executable application ecosystem business plan for PCs, phones, tablets,data center and Internet of Things platforms New technology/initiatives & Services Strategic Planning for IPTV, In Vehicle Infotainment Intel Corporation January 2012  –  February 2013  (1 year 2 months) Santa Clara, CA Digital Home Services Strategic Planning - TV Content Guide, Multiscreen service Intel June 2011  –  January 2012  (8 months) Netbook Tablet Platform & Strategic Marketing Intel Corporation August 2009  –  June 2011  (1 year 11 months) Staff Notebook Chipset Strategic Planning Manager Intel Corporation July 2007  –  August 2009  (2 years 2 months) Managed mobile chipset planning group; responsible for mobile chipset roadmaps and strategies Notebook Strategic Planning Manager Intel Corporation June 2005  –  July 2007  (2 years 2 months) Santa Clara, CA Responsible for Graphics & chipset product planning, roadmap and strategy Platform Solutions Architect, Segment Marketing, Service Provider Router Segment Intel Corporation March 2004  –  June 2005  (1 year 4 months) Supported Segment Marketing Manager; worked on customer accounts Senior/Staff Network Software Engineer Intel October 2001  –  March 2004  (2 years 6 months) Customer Application Engineer & Technical marketing Engineer Intel July 2000  –  October 2001  (1 year 4 months) Student, Research Assistant Rensselaer Polytechnic Institute (RPI) 1999  –  2000  (1 year) Systems Engineer Wipro/Sequent 1997  –  1999  (2 years) Director, IOT New Segments Growth and Innovation Strategy, Planning, Execution & Marketing Intel Corporation August 2015  – Present (1 month) Santa Clara Director, IOT New Segments Growth and Innovation Strategy, Planning, Execution & Marketing Intel Corporation August 2015  – Present (1 month) Santa Clara Director, Ecosystem Strategy & Biz Planning(PCs, Phones, Tablets, Data Center, Internet of Things) Intel February 2013  –  August 2015  (2 years 7 months) Santa Clara, CA Senior leader & manager of a team of strategic planners focused on developing application ecosystem strategy and delivering high quality executable application ecosystem business plan for PCs, phones, tablets,data center and Internet of Things platforms Director, Ecosystem Strategy & Biz Planning(PCs, Phones, Tablets, Data Center, Internet of Things) Intel February 2013  –  August 2015  (2 years 7 months) Santa Clara, CA Senior leader & manager of a team of strategic planners focused on developing application ecosystem strategy and delivering high quality executable application ecosystem business plan for PCs, phones, tablets,data center and Internet of Things platforms New technology/initiatives & Services Strategic Planning for IPTV, In Vehicle Infotainment Intel Corporation January 2012  –  February 2013  (1 year 2 months) Santa Clara, CA New technology/initiatives & Services Strategic Planning for IPTV, In Vehicle Infotainment Intel Corporation January 2012  –  February 2013  (1 year 2 months) Santa Clara, CA Digital Home Services Strategic Planning - TV Content Guide, Multiscreen service Intel June 2011  –  January 2012  (8 months) Digital Home Services Strategic Planning - TV Content Guide, Multiscreen service Intel June 2011  –  January 2012  (8 months) Netbook Tablet Platform & Strategic Marketing Intel Corporation August 2009  –  June 2011  (1 year 11 months) Netbook Tablet Platform & Strategic Marketing Intel Corporation August 2009  –  June 2011  (1 year 11 months) Staff Notebook Chipset Strategic Planning Manager Intel Corporation July 2007  –  August 2009  (2 years 2 months) Managed mobile chipset planning group; responsible for mobile chipset roadmaps and strategies Staff Notebook Chipset Strategic Planning Manager Intel Corporation July 2007  –  August 2009  (2 years 2 months) Managed mobile chipset planning group; responsible for mobile chipset roadmaps and strategies Notebook Strategic Planning Manager Intel Corporation June 2005  –  July 2007  (2 years 2 months) Santa Clara, CA Responsible for Graphics & chipset product planning, roadmap and strategy Notebook Strategic Planning Manager Intel Corporation June 2005  –  July 2007  (2 years 2 months) Santa Clara, CA Responsible for Graphics & chipset product planning, roadmap and strategy Platform Solutions Architect, Segment Marketing, Service Provider Router Segment Intel Corporation March 2004  –  June 2005  (1 year 4 months) Supported Segment Marketing Manager; worked on customer accounts Platform Solutions Architect, Segment Marketing, Service Provider Router Segment Intel Corporation March 2004  –  June 2005  (1 year 4 months) Supported Segment Marketing Manager; worked on customer accounts Senior/Staff Network Software Engineer Intel October 2001  –  March 2004  (2 years 6 months) Senior/Staff Network Software Engineer Intel October 2001  –  March 2004  (2 years 6 months) Customer Application Engineer & Technical marketing Engineer Intel July 2000  –  October 2001  (1 year 4 months) Customer Application Engineer & Technical marketing Engineer Intel July 2000  –  October 2001  (1 year 4 months) Student, Research Assistant Rensselaer Polytechnic Institute (RPI) 1999  –  2000  (1 year) Student, Research Assistant Rensselaer Polytechnic Institute (RPI) 1999  –  2000  (1 year) Systems Engineer Wipro/Sequent 1997  –  1999  (2 years) Systems Engineer Wipro/Sequent 1997  –  1999  (2 years) Skills Product Management Product Marketing Program Management Strategy Management Strategic Planning Software Project... Consumer Electronics Semiconductors Cloud Computing Embedded Systems Project Planning Leadership Business Strategy Competitive Analysis Product Lifecycle... Strategic Partnerships Marketing Intel Team Leadership SaaS Business Planning Software Development Project Management Start-ups Go-to-market Strategy Business Development Wireless Mobile Devices Cross-functional Team... Product Planning Technical Marketing Marketing Strategy Processors Product Development Enterprise Software Networking Integration Analysis See 24+     See less Skills  Product Management Product Marketing Program Management Strategy Management Strategic Planning Software Project... Consumer Electronics Semiconductors Cloud Computing Embedded Systems Project Planning Leadership Business Strategy Competitive Analysis Product Lifecycle... Strategic Partnerships Marketing Intel Team Leadership SaaS Business Planning Software Development Project Management Start-ups Go-to-market Strategy Business Development Wireless Mobile Devices Cross-functional Team... Product Planning Technical Marketing Marketing Strategy Processors Product Development Enterprise Software Networking Integration Analysis See 24+     See less Product Management Product Marketing Program Management Strategy Management Strategic Planning Software Project... Consumer Electronics Semiconductors Cloud Computing Embedded Systems Project Planning Leadership Business Strategy Competitive Analysis Product Lifecycle... Strategic Partnerships Marketing Intel Team Leadership SaaS Business Planning Software Development Project Management Start-ups Go-to-market Strategy Business Development Wireless Mobile Devices Cross-functional Team... Product Planning Technical Marketing Marketing Strategy Processors Product Development Enterprise Software Networking Integration Analysis See 24+     See less Product Management Product Marketing Program Management Strategy Management Strategic Planning Software Project... Consumer Electronics Semiconductors Cloud Computing Embedded Systems Project Planning Leadership Business Strategy Competitive Analysis Product Lifecycle... Strategic Partnerships Marketing Intel Team Leadership SaaS Business Planning Software Development Project Management Start-ups Go-to-market Strategy Business Development Wireless Mobile Devices Cross-functional Team... Product Planning Technical Marketing Marketing Strategy Processors Product Development Enterprise Software Networking Integration Analysis See 24+     See less Education Santa Clara University - Leavey School of Business MBA,  Finance Marketing 2004  – 2007 Activities and Societies:  Beta Gamma Sigma honored Birla Institute of Technology Bachelors,  Computer Science and Engineering Declared valedictorian \nDirected and acted in a play; acted in several plays Activities and Societies:  Dramatics Society Rensselaer Polytechnic Institute MS,  Computer Science Teaching Assistant for one semester; research assistant for two semesters St. Xavier's School, Bokaro Steel City Santa Clara University - Leavey School of Business MBA,  Finance Marketing 2004  – 2007 Activities and Societies:  Beta Gamma Sigma honored Santa Clara University - Leavey School of Business MBA,  Finance Marketing 2004  – 2007 Activities and Societies:  Beta Gamma Sigma honored Santa Clara University - Leavey School of Business MBA,  Finance Marketing 2004  – 2007 Activities and Societies:  Beta Gamma Sigma honored Birla Institute of Technology Bachelors,  Computer Science and Engineering Declared valedictorian \nDirected and acted in a play; acted in several plays Activities and Societies:  Dramatics Society Birla Institute of Technology Bachelors,  Computer Science and Engineering Declared valedictorian \nDirected and acted in a play; acted in several plays Activities and Societies:  Dramatics Society Birla Institute of Technology Bachelors,  Computer Science and Engineering Declared valedictorian \nDirected and acted in a play; acted in several plays Activities and Societies:  Dramatics Society Rensselaer Polytechnic Institute MS,  Computer Science Teaching Assistant for one semester; research assistant for two semesters Rensselaer Polytechnic Institute MS,  Computer Science Teaching Assistant for one semester; research assistant for two semesters Rensselaer Polytechnic Institute MS,  Computer Science Teaching Assistant for one semester; research assistant for two semesters St. Xavier's School, Bokaro Steel City St. Xavier's School, Bokaro Steel City St. Xavier's School, Bokaro Steel City Honors & Awards Additional Honors & Awards Several patents at Intel \nSeveral awards at Intel (divisional recognition awards, spontaneous recognition awards) \n \nDeclared valedictorian in undergrad (Birla Institute of Technology) \nAwards at Leavey school of Business: Off to a Great Start, Turning the corner, Dean's List awards (every MBA quarter) \nRecipient of Beta Gamma Sigma Award (Highest international honor for MBA students) \n \nAwards at International Poetry Contest Additional Honors & Awards Several patents at Intel \nSeveral awards at Intel (divisional recognition awards, spontaneous recognition awards) \n \nDeclared valedictorian in undergrad (Birla Institute of Technology) \nAwards at Leavey school of Business: Off to a Great Start, Turning the corner, Dean's List awards (every MBA quarter) \nRecipient of Beta Gamma Sigma Award (Highest international honor for MBA students) \n \nAwards at International Poetry Contest Additional Honors & Awards Several patents at Intel \nSeveral awards at Intel (divisional recognition awards, spontaneous recognition awards) \n \nDeclared valedictorian in undergrad (Birla Institute of Technology) \nAwards at Leavey school of Business: Off to a Great Start, Turning the corner, Dean's List awards (every MBA quarter) \nRecipient of Beta Gamma Sigma Award (Highest international honor for MBA students) \n \nAwards at International Poetry Contest Additional Honors & Awards Several patents at Intel \nSeveral awards at Intel (divisional recognition awards, spontaneous recognition awards) \n \nDeclared valedictorian in undergrad (Birla Institute of Technology) \nAwards at Leavey school of Business: Off to a Great Start, Turning the corner, Dean's List awards (every MBA quarter) \nRecipient of Beta Gamma Sigma Award (Highest international honor for MBA students) \n \nAwards at International Poetry Contest ", "Skills Business Strategy Team Leadership Marketing Program Management Skills  Business Strategy Team Leadership Marketing Program Management Business Strategy Team Leadership Marketing Program Management Business Strategy Team Leadership Marketing Program Management ", "Skills Marketing Strategy Partner Marketing Go-to-market Strategy Channel Marketing Cross-functional Team... Co-marketing Product Marketing Multi-channel Marketing Product Launch Demand Generation Product Management Strategic Partnerships Start-ups Business Development Competitive Analysis Affiliate Marketing Marketing Management Marketing Management Mobile Devices Enterprise Software Entrepreneurship Business Alliances Wireless See 9+     See less Skills  Marketing Strategy Partner Marketing Go-to-market Strategy Channel Marketing Cross-functional Team... Co-marketing Product Marketing Multi-channel Marketing Product Launch Demand Generation Product Management Strategic Partnerships Start-ups Business Development Competitive Analysis Affiliate Marketing Marketing Management Marketing Management Mobile Devices Enterprise Software Entrepreneurship Business Alliances Wireless See 9+     See less Marketing Strategy Partner Marketing Go-to-market Strategy Channel Marketing Cross-functional Team... Co-marketing Product Marketing Multi-channel Marketing Product Launch Demand Generation Product Management Strategic Partnerships Start-ups Business Development Competitive Analysis Affiliate Marketing Marketing Management Marketing Management Mobile Devices Enterprise Software Entrepreneurship Business Alliances Wireless See 9+     See less Marketing Strategy Partner Marketing Go-to-market Strategy Channel Marketing Cross-functional Team... Co-marketing Product Marketing Multi-channel Marketing Product Launch Demand Generation Product Management Strategic Partnerships Start-ups Business Development Competitive Analysis Affiliate Marketing Marketing Management Marketing Management Mobile Devices Enterprise Software Entrepreneurship Business Alliances Wireless See 9+     See less "]}