{"position": "Marketing Director", "company": "Intel Corporation", "profiles": ["Summary Market Development and Product Marketing executive with international and field sales experience with computing platforms for telecommunications equipment applications. Specialties:Strategic, product, and technical marketing experience with an engineering and technical background. Summary Market Development and Product Marketing executive with international and field sales experience with computing platforms for telecommunications equipment applications. Specialties:Strategic, product, and technical marketing experience with an engineering and technical background. Market Development and Product Marketing executive with international and field sales experience with computing platforms for telecommunications equipment applications. Specialties:Strategic, product, and technical marketing experience with an engineering and technical background. Market Development and Product Marketing executive with international and field sales experience with computing platforms for telecommunications equipment applications. Specialties:Strategic, product, and technical marketing experience with an engineering and technical background. Experience Network Infrastructure Sales and Marketing Director Intel Corporation March 2015  – Present (6 months) Greater Boston Area Responsible for ramping and scaling Network Function Virtualization (NFV) deployments in Communication Service Provider networks.  Market Development Manager Intel Corporation July 2006  –  March 2015  (8 years 9 months) Product Line Manager Intel Corporation June 2005  –  July 2006  (1 year 2 months) Director of OEM Sales ZNYX Networks February 2004  –  June 2005  (1 year 5 months) Director of Product Marketing Motorola Computer Group January 2002  –  August 2003  (1 year 8 months) Business Unit Director, EMEA Motorola Computer Group March 2000  –  December 2001  (1 year 10 months) Network Infrastructure Sales and Marketing Director Intel Corporation March 2015  – Present (6 months) Greater Boston Area Responsible for ramping and scaling Network Function Virtualization (NFV) deployments in Communication Service Provider networks.  Network Infrastructure Sales and Marketing Director Intel Corporation March 2015  – Present (6 months) Greater Boston Area Responsible for ramping and scaling Network Function Virtualization (NFV) deployments in Communication Service Provider networks.  Market Development Manager Intel Corporation July 2006  –  March 2015  (8 years 9 months) Market Development Manager Intel Corporation July 2006  –  March 2015  (8 years 9 months) Product Line Manager Intel Corporation June 2005  –  July 2006  (1 year 2 months) Product Line Manager Intel Corporation June 2005  –  July 2006  (1 year 2 months) Director of OEM Sales ZNYX Networks February 2004  –  June 2005  (1 year 5 months) Director of OEM Sales ZNYX Networks February 2004  –  June 2005  (1 year 5 months) Director of Product Marketing Motorola Computer Group January 2002  –  August 2003  (1 year 8 months) Director of Product Marketing Motorola Computer Group January 2002  –  August 2003  (1 year 8 months) Business Unit Director, EMEA Motorola Computer Group March 2000  –  December 2001  (1 year 10 months) Business Unit Director, EMEA Motorola Computer Group March 2000  –  December 2001  (1 year 10 months) Skills Product Marketing Product Management Telecom Infrastructure Sales Management Contract Negotiations Strategic Planning Technical Leadership Financial Reporting Marketing Strategy Market Research Partner Management Computer Architecture Microprocessors People Management Telecommunications Management Strategy Contract Negotiation Product Launch Business Development Embedded Systems Cloud Computing Go-to-market Strategy Market Analysis Start-ups Strategic Partnerships Business Alliances Product Development Intel Enterprise Software Program Management Sales Marketing Management Semiconductors Competitive Analysis Account Management Cross-functional Team... Processors Technical Marketing Market Development SoC Wireless Product Lifecycle... See 28+     See less Skills  Product Marketing Product Management Telecom Infrastructure Sales Management Contract Negotiations Strategic Planning Technical Leadership Financial Reporting Marketing Strategy Market Research Partner Management Computer Architecture Microprocessors People Management Telecommunications Management Strategy Contract Negotiation Product Launch Business Development Embedded Systems Cloud Computing Go-to-market Strategy Market Analysis Start-ups Strategic Partnerships Business Alliances Product Development Intel Enterprise Software Program Management Sales Marketing Management Semiconductors Competitive Analysis Account Management Cross-functional Team... Processors Technical Marketing Market Development SoC Wireless Product Lifecycle... See 28+     See less Product Marketing Product Management Telecom Infrastructure Sales Management Contract Negotiations Strategic Planning Technical Leadership Financial Reporting Marketing Strategy Market Research Partner Management Computer Architecture Microprocessors People Management Telecommunications Management Strategy Contract Negotiation Product Launch Business Development Embedded Systems Cloud Computing Go-to-market Strategy Market Analysis Start-ups Strategic Partnerships Business Alliances Product Development Intel Enterprise Software Program Management Sales Marketing Management Semiconductors Competitive Analysis Account Management Cross-functional Team... Processors Technical Marketing Market Development SoC Wireless Product Lifecycle... See 28+     See less Product Marketing Product Management Telecom Infrastructure Sales Management Contract Negotiations Strategic Planning Technical Leadership Financial Reporting Marketing Strategy Market Research Partner Management Computer Architecture Microprocessors People Management Telecommunications Management Strategy Contract Negotiation Product Launch Business Development Embedded Systems Cloud Computing Go-to-market Strategy Market Analysis Start-ups Strategic Partnerships Business Alliances Product Development Intel Enterprise Software Program Management Sales Marketing Management Semiconductors Competitive Analysis Account Management Cross-functional Team... Processors Technical Marketing Market Development SoC Wireless Product Lifecycle... See 28+     See less Education Arizona State University - W. P. Carey School of Business MBA 1992  – 1994 Georgia Institute of Technology MSEE 1979  – 1980 Columbia University in the City of New York BS 1975  – 1979 Arizona State University - W. P. Carey School of Business MBA 1992  – 1994 Arizona State University - W. P. Carey School of Business MBA 1992  – 1994 Arizona State University - W. P. Carey School of Business MBA 1992  – 1994 Georgia Institute of Technology MSEE 1979  – 1980 Georgia Institute of Technology MSEE 1979  – 1980 Georgia Institute of Technology MSEE 1979  – 1980 Columbia University in the City of New York BS 1975  – 1979 Columbia University in the City of New York BS 1975  – 1979 Columbia University in the City of New York BS 1975  – 1979 ", "Summary Mobile & Wireless with Creative & innovation Specialties:Marketing, Mobility Summary Mobile & Wireless with Creative & innovation Specialties:Marketing, Mobility Mobile & Wireless with Creative & innovation Specialties:Marketing, Mobility Mobile & Wireless with Creative & innovation Specialties:Marketing, Mobility Experience Strategy and Operation Manager Intel Corporation July 2014  – Present (1 year 2 months) Lead CTE BD and Operation Marketing Director Intel Corporation May 2013  –  August 2014  (1 year 4 months) Beijing City, China Customer Marketing of MCG China \n \nDrive Tablet & Smart Phone GTM in PRC market place. Sr. Account Manager Intel (China) July 2008  –  May 2013  (4 years 11 months) Beijing Be responsible for driving and growing the Intel’s revenues within MNC OEMs by creating demand in a way that supports Intel’s long-term strategic directions and WW Account Strategy. Sr. Business Development Manager Intel (China) November 2006  –  July 2008  (1 year 9 months) Beijing Business Development of WiMAX Marketing Manager Intel (China) May 2005  –  September 2006  (1 year 5 months) Beijing Marketing Development of Intel Smart Phone Marketing Development Manager HP January 2004  –  April 2005  (1 year 4 months) Beijing Product Management & Product Marketing Development Product Manager Rogers Communications (Canada) January 2000  –  December 2003  (4 years) Toronto, Canada Area Mobile Computing product & Data services management Account Manager, MDM, PM HP January 1996  –  December 1999  (4 years) Beijing Channel Development & Management \nProduct Management \nProduct Marketing Development Account Manager Hongkong Telecom CSL September 1992  –  December 1996  (4 years 4 months) Beijing Channel Development & Management Strategy and Operation Manager Intel Corporation July 2014  – Present (1 year 2 months) Lead CTE BD and Operation Strategy and Operation Manager Intel Corporation July 2014  – Present (1 year 2 months) Lead CTE BD and Operation Marketing Director Intel Corporation May 2013  –  August 2014  (1 year 4 months) Beijing City, China Customer Marketing of MCG China \n \nDrive Tablet & Smart Phone GTM in PRC market place. Marketing Director Intel Corporation May 2013  –  August 2014  (1 year 4 months) Beijing City, China Customer Marketing of MCG China \n \nDrive Tablet & Smart Phone GTM in PRC market place. Sr. Account Manager Intel (China) July 2008  –  May 2013  (4 years 11 months) Beijing Be responsible for driving and growing the Intel’s revenues within MNC OEMs by creating demand in a way that supports Intel’s long-term strategic directions and WW Account Strategy. Sr. Account Manager Intel (China) July 2008  –  May 2013  (4 years 11 months) Beijing Be responsible for driving and growing the Intel’s revenues within MNC OEMs by creating demand in a way that supports Intel’s long-term strategic directions and WW Account Strategy. Sr. Business Development Manager Intel (China) November 2006  –  July 2008  (1 year 9 months) Beijing Business Development of WiMAX Sr. Business Development Manager Intel (China) November 2006  –  July 2008  (1 year 9 months) Beijing Business Development of WiMAX Marketing Manager Intel (China) May 2005  –  September 2006  (1 year 5 months) Beijing Marketing Development of Intel Smart Phone Marketing Manager Intel (China) May 2005  –  September 2006  (1 year 5 months) Beijing Marketing Development of Intel Smart Phone Marketing Development Manager HP January 2004  –  April 2005  (1 year 4 months) Beijing Product Management & Product Marketing Development Marketing Development Manager HP January 2004  –  April 2005  (1 year 4 months) Beijing Product Management & Product Marketing Development Product Manager Rogers Communications (Canada) January 2000  –  December 2003  (4 years) Toronto, Canada Area Mobile Computing product & Data services management Product Manager Rogers Communications (Canada) January 2000  –  December 2003  (4 years) Toronto, Canada Area Mobile Computing product & Data services management Account Manager, MDM, PM HP January 1996  –  December 1999  (4 years) Beijing Channel Development & Management \nProduct Management \nProduct Marketing Development Account Manager, MDM, PM HP January 1996  –  December 1999  (4 years) Beijing Channel Development & Management \nProduct Management \nProduct Marketing Development Account Manager Hongkong Telecom CSL September 1992  –  December 1996  (4 years 4 months) Beijing Channel Development & Management Account Manager Hongkong Telecom CSL September 1992  –  December 1996  (4 years 4 months) Beijing Channel Development & Management Languages Mandarin Mandarin Mandarin Skills Mobile Wireless Intel Business Intelligence Product Marketing Marketing Development Key Account Management Product Strategy Marketing Strategy Negotiation Business Development Go-to-market Strategy Account Management Cross-functional Team... Management Marketing Mobile Devices Product Management Strategic Partnerships Strategy See 5+     See less Skills  Mobile Wireless Intel Business Intelligence Product Marketing Marketing Development Key Account Management Product Strategy Marketing Strategy Negotiation Business Development Go-to-market Strategy Account Management Cross-functional Team... Management Marketing Mobile Devices Product Management Strategic Partnerships Strategy See 5+     See less Mobile Wireless Intel Business Intelligence Product Marketing Marketing Development Key Account Management Product Strategy Marketing Strategy Negotiation Business Development Go-to-market Strategy Account Management Cross-functional Team... Management Marketing Mobile Devices Product Management Strategic Partnerships Strategy See 5+     See less Mobile Wireless Intel Business Intelligence Product Marketing Marketing Development Key Account Management Product Strategy Marketing Strategy Negotiation Business Development Go-to-market Strategy Account Management Cross-functional Team... Management Marketing Mobile Devices Product Management Strategic Partnerships Strategy See 5+     See less Education CEIBS Diploma,  Management 2007  – 2009 University of Toronto Diploma,  Business Intelligence 2001  – 2003 Beijing Union University Bachelor,  Computer Science 1988  – 1992 CEIBS Diploma,  Management 2007  – 2009 CEIBS Diploma,  Management 2007  – 2009 CEIBS Diploma,  Management 2007  – 2009 University of Toronto Diploma,  Business Intelligence 2001  – 2003 University of Toronto Diploma,  Business Intelligence 2001  – 2003 University of Toronto Diploma,  Business Intelligence 2001  – 2003 Beijing Union University Bachelor,  Computer Science 1988  – 1992 Beijing Union University Bachelor,  Computer Science 1988  – 1992 Beijing Union University Bachelor,  Computer Science 1988  – 1992 ", "Skills Product Marketing Product Management Go-to-market Strategy Product Lifecycle... Cross-functional Team... Product Development Product Launch Competitive Analysis Start-ups Semiconductors Product Planning Strategic Partnerships Program Management Consumer Electronics Business Development Strategic Planning Business Alliances Marketing Strategy Engineering Management Business Strategy Demand Generation Marketing Segmentation Intel Multi-channel Marketing Wireless Management P&L Management International Sales Pricing Mobile Devices Positioning Strategy Marketing Management See 19+     See less Skills  Product Marketing Product Management Go-to-market Strategy Product Lifecycle... Cross-functional Team... Product Development Product Launch Competitive Analysis Start-ups Semiconductors Product Planning Strategic Partnerships Program Management Consumer Electronics Business Development Strategic Planning Business Alliances Marketing Strategy Engineering Management Business Strategy Demand Generation Marketing Segmentation Intel Multi-channel Marketing Wireless Management P&L Management International Sales Pricing Mobile Devices Positioning Strategy Marketing Management See 19+     See less Product Marketing Product Management Go-to-market Strategy Product Lifecycle... Cross-functional Team... Product Development Product Launch Competitive Analysis Start-ups Semiconductors Product Planning Strategic Partnerships Program Management Consumer Electronics Business Development Strategic Planning Business Alliances Marketing Strategy Engineering Management Business Strategy Demand Generation Marketing Segmentation Intel Multi-channel Marketing Wireless Management P&L Management International Sales Pricing Mobile Devices Positioning Strategy Marketing Management See 19+     See less Product Marketing Product Management Go-to-market Strategy Product Lifecycle... Cross-functional Team... Product Development Product Launch Competitive Analysis Start-ups Semiconductors Product Planning Strategic Partnerships Program Management Consumer Electronics Business Development Strategic Planning Business Alliances Marketing Strategy Engineering Management Business Strategy Demand Generation Marketing Segmentation Intel Multi-channel Marketing Wireless Management P&L Management International Sales Pricing Mobile Devices Positioning Strategy Marketing Management See 19+     See less ", "Summary Proven track record with over 30 years of business growth experience in strategic marketing, technology strategy, product line management and product development.  \n \n* Spearheaded and incubated many successful products and business lines across defense, telecom, consumer and wireless industries.  \n \n* Developed and maintain strong and trusted relationships with customers, strategic partners, media/analysts and worldwide personnel at all organizational levels.  \n \n* Broad mobile industry connections, along with mobile industry standards executive management expertise. \n \n* Passion for driving business growth through innovation with strong work ethic, cross-functional leadership and unique combination of skills differentiates me. \n \nSpecialties: product marketing, technology strategy, strategic marketing, technology marketing, market research, portfolio planning, intellectual property (IP) management, product line management, business incubation, competitive analysis, strategic partnerships, industry standards executive leadership, system architecture and product design, corporate spokesperson, imaging and vision technologies, microprocessors, wireless charging, audio, voice, speech, digital signal processors (DSP). Summary Proven track record with over 30 years of business growth experience in strategic marketing, technology strategy, product line management and product development.  \n \n* Spearheaded and incubated many successful products and business lines across defense, telecom, consumer and wireless industries.  \n \n* Developed and maintain strong and trusted relationships with customers, strategic partners, media/analysts and worldwide personnel at all organizational levels.  \n \n* Broad mobile industry connections, along with mobile industry standards executive management expertise. \n \n* Passion for driving business growth through innovation with strong work ethic, cross-functional leadership and unique combination of skills differentiates me. \n \nSpecialties: product marketing, technology strategy, strategic marketing, technology marketing, market research, portfolio planning, intellectual property (IP) management, product line management, business incubation, competitive analysis, strategic partnerships, industry standards executive leadership, system architecture and product design, corporate spokesperson, imaging and vision technologies, microprocessors, wireless charging, audio, voice, speech, digital signal processors (DSP). Proven track record with over 30 years of business growth experience in strategic marketing, technology strategy, product line management and product development.  \n \n* Spearheaded and incubated many successful products and business lines across defense, telecom, consumer and wireless industries.  \n \n* Developed and maintain strong and trusted relationships with customers, strategic partners, media/analysts and worldwide personnel at all organizational levels.  \n \n* Broad mobile industry connections, along with mobile industry standards executive management expertise. \n \n* Passion for driving business growth through innovation with strong work ethic, cross-functional leadership and unique combination of skills differentiates me. \n \nSpecialties: product marketing, technology strategy, strategic marketing, technology marketing, market research, portfolio planning, intellectual property (IP) management, product line management, business incubation, competitive analysis, strategic partnerships, industry standards executive leadership, system architecture and product design, corporate spokesperson, imaging and vision technologies, microprocessors, wireless charging, audio, voice, speech, digital signal processors (DSP). Proven track record with over 30 years of business growth experience in strategic marketing, technology strategy, product line management and product development.  \n \n* Spearheaded and incubated many successful products and business lines across defense, telecom, consumer and wireless industries.  \n \n* Developed and maintain strong and trusted relationships with customers, strategic partners, media/analysts and worldwide personnel at all organizational levels.  \n \n* Broad mobile industry connections, along with mobile industry standards executive management expertise. \n \n* Passion for driving business growth through innovation with strong work ethic, cross-functional leadership and unique combination of skills differentiates me. \n \nSpecialties: product marketing, technology strategy, strategic marketing, technology marketing, market research, portfolio planning, intellectual property (IP) management, product line management, business incubation, competitive analysis, strategic partnerships, industry standards executive leadership, system architecture and product design, corporate spokesperson, imaging and vision technologies, microprocessors, wireless charging, audio, voice, speech, digital signal processors (DSP). Experience Marketing Director Intel Corporation January 2013  – Present (2 years 8 months) Dallas/Fort Worth Area Marketing Director Intel Corporation January 2013  – Present (2 years 8 months) Dallas/Fort Worth Area Marketing Director Intel Corporation January 2013  – Present (2 years 8 months) Dallas/Fort Worth Area Skills Strategic Partnerships Competitive Analysis Patents Marketing Strategy Market Research Strategic Technology... Product Management Mobile Devices Cross-functional Team... Digital Signal... SoC Embedded Systems OMAP Wireless Product Development Strategy Analog ARM Semiconductor Industry Semiconductors ASIC System Architecture Telecommunications Power Management Processors IC Embedded Software Microprocessors Consumer Electronics Product Launch Go-to-market Strategy RF PCB design Mobile Communications Integration Product Marketing See 21+     See less Skills  Strategic Partnerships Competitive Analysis Patents Marketing Strategy Market Research Strategic Technology... Product Management Mobile Devices Cross-functional Team... Digital Signal... SoC Embedded Systems OMAP Wireless Product Development Strategy Analog ARM Semiconductor Industry Semiconductors ASIC System Architecture Telecommunications Power Management Processors IC Embedded Software Microprocessors Consumer Electronics Product Launch Go-to-market Strategy RF PCB design Mobile Communications Integration Product Marketing See 21+     See less Strategic Partnerships Competitive Analysis Patents Marketing Strategy Market Research Strategic Technology... Product Management Mobile Devices Cross-functional Team... Digital Signal... SoC Embedded Systems OMAP Wireless Product Development Strategy Analog ARM Semiconductor Industry Semiconductors ASIC System Architecture Telecommunications Power Management Processors IC Embedded Software Microprocessors Consumer Electronics Product Launch Go-to-market Strategy RF PCB design Mobile Communications Integration Product Marketing See 21+     See less Strategic Partnerships Competitive Analysis Patents Marketing Strategy Market Research Strategic Technology... Product Management Mobile Devices Cross-functional Team... Digital Signal... SoC Embedded Systems OMAP Wireless Product Development Strategy Analog ARM Semiconductor Industry Semiconductors ASIC System Architecture Telecommunications Power Management Processors IC Embedded Software Microprocessors Consumer Electronics Product Launch Go-to-market Strategy RF PCB design Mobile Communications Integration Product Marketing See 21+     See less Honors & Awards ", "Experience North America Datacenter Marketing Director Intel Corporation Technical Assistant to the Data Center Group Sr. VP & GM Intel Corporation October 2014  – Present (11 months) Portland, Oregon Area Marketing Director Data Center Channels Intel Corporation January 2007  –  September 2014  (7 years 9 months) Portland, Oregon Area Product Line Manager Intel Corporation April 2004  –  December 2006  (2 years 9 months) Portland, Oregon Area Product Marketing Engineer Intel Corporation September 2002  –  March 2004  (1 year 7 months) Portland, Oregon Area Program Manager Intel Corporation September 2000  –  August 2002  (2 years) Portland, Oregon Area Commodity Specialist Intel Corporation June 1997  –  August 2000  (3 years 3 months) Chandler, Arizona North America Datacenter Marketing Director Intel Corporation North America Datacenter Marketing Director Intel Corporation Technical Assistant to the Data Center Group Sr. VP & GM Intel Corporation October 2014  – Present (11 months) Portland, Oregon Area Technical Assistant to the Data Center Group Sr. VP & GM Intel Corporation October 2014  – Present (11 months) Portland, Oregon Area Marketing Director Data Center Channels Intel Corporation January 2007  –  September 2014  (7 years 9 months) Portland, Oregon Area Marketing Director Data Center Channels Intel Corporation January 2007  –  September 2014  (7 years 9 months) Portland, Oregon Area Product Line Manager Intel Corporation April 2004  –  December 2006  (2 years 9 months) Portland, Oregon Area Product Line Manager Intel Corporation April 2004  –  December 2006  (2 years 9 months) Portland, Oregon Area Product Marketing Engineer Intel Corporation September 2002  –  March 2004  (1 year 7 months) Portland, Oregon Area Product Marketing Engineer Intel Corporation September 2002  –  March 2004  (1 year 7 months) Portland, Oregon Area Program Manager Intel Corporation September 2000  –  August 2002  (2 years) Portland, Oregon Area Program Manager Intel Corporation September 2000  –  August 2002  (2 years) Portland, Oregon Area Commodity Specialist Intel Corporation June 1997  –  August 2000  (3 years 3 months) Chandler, Arizona Commodity Specialist Intel Corporation June 1997  –  August 2000  (3 years 3 months) Chandler, Arizona Skills Go-to-market Strategy Intel Channel Product Management Product Marketing Semiconductors Strategic Partnerships Program Management Business Alliances Cloud Computing Management Skills  Go-to-market Strategy Intel Channel Product Management Product Marketing Semiconductors Strategic Partnerships Program Management Business Alliances Cloud Computing Management Go-to-market Strategy Intel Channel Product Management Product Marketing Semiconductors Strategic Partnerships Program Management Business Alliances Cloud Computing Management Go-to-market Strategy Intel Channel Product Management Product Marketing Semiconductors Strategic Partnerships Program Management Business Alliances Cloud Computing Management Education University of Alabama, Manderson Graduate School of Business MBA 1995  – 1997 University of Alabama Bachelor of Science in Mechanical Engineering 1989  – 1994 University of Alabama, Manderson Graduate School of Business MBA 1995  – 1997 University of Alabama, Manderson Graduate School of Business MBA 1995  – 1997 University of Alabama, Manderson Graduate School of Business MBA 1995  – 1997 University of Alabama Bachelor of Science in Mechanical Engineering 1989  – 1994 University of Alabama Bachelor of Science in Mechanical Engineering 1989  – 1994 University of Alabama Bachelor of Science in Mechanical Engineering 1989  – 1994 ", "Skills Leadership Product Management Competitive Analysis Mobile Devices Product Marketing Cross-functional Team... Channel Intel Technical Marketing Wireless Go-to-market Strategy SaaS Telecommunications Cloud Computing Coaching Product Development Strategic Partnerships VoIP Demand Generation Business Alliances Business Intelligence Business Development Multi-channel Marketing Channel Partners Partner Management Start-ups Enterprise Software See 12+     See less Skills  Leadership Product Management Competitive Analysis Mobile Devices Product Marketing Cross-functional Team... Channel Intel Technical Marketing Wireless Go-to-market Strategy SaaS Telecommunications Cloud Computing Coaching Product Development Strategic Partnerships VoIP Demand Generation Business Alliances Business Intelligence Business Development Multi-channel Marketing Channel Partners Partner Management Start-ups Enterprise Software See 12+     See less Leadership Product Management Competitive Analysis Mobile Devices Product Marketing Cross-functional Team... Channel Intel Technical Marketing Wireless Go-to-market Strategy SaaS Telecommunications Cloud Computing Coaching Product Development Strategic Partnerships VoIP Demand Generation Business Alliances Business Intelligence Business Development Multi-channel Marketing Channel Partners Partner Management Start-ups Enterprise Software See 12+     See less Leadership Product Management Competitive Analysis Mobile Devices Product Marketing Cross-functional Team... Channel Intel Technical Marketing Wireless Go-to-market Strategy SaaS Telecommunications Cloud Computing Coaching Product Development Strategic Partnerships VoIP Demand Generation Business Alliances Business Intelligence Business Development Multi-channel Marketing Channel Partners Partner Management Start-ups Enterprise Software See 12+     See less ", "Experience Marketing Director Intel Corporation February 2003  – Present (12 years 7 months) Sydney Area, Australia Create new product market segments and drive marketing effort to successful user adoption. Marketing Director Intel Corporation February 2003  – Present (12 years 7 months) Sydney Area, Australia Create new product market segments and drive marketing effort to successful user adoption. Marketing Director Intel Corporation February 2003  – Present (12 years 7 months) Sydney Area, Australia Create new product market segments and drive marketing effort to successful user adoption. Education University of Sydney Business,  Marketing 1986  – 1991 University of Sydney Business,  Marketing 1986  – 1991 University of Sydney Business,  Marketing 1986  – 1991 University of Sydney Business,  Marketing 1986  – 1991 ", "Summary Timothy Dowling Bio \nTim has extensive experience in building and running Internet businesses. He is an expert at online sales & marketing leveraging inside direct sales and partner channels. He has a core background in product management for both consumer and business internet services. With both big company (Intel & McAfee) and startup experience, he has grown and managed businesses in excess of $100M in revenues. Specialties:Cloud based apps, Online channel development, B2B, Low Touch Inside Sales, Multi-channel demand generation, B2B2C, Business Development, Revenue Partnerships, General Management, Team Building, Internet Marketing, Freemium business models, Product Management and Development. Summary Timothy Dowling Bio \nTim has extensive experience in building and running Internet businesses. He is an expert at online sales & marketing leveraging inside direct sales and partner channels. He has a core background in product management for both consumer and business internet services. With both big company (Intel & McAfee) and startup experience, he has grown and managed businesses in excess of $100M in revenues. Specialties:Cloud based apps, Online channel development, B2B, Low Touch Inside Sales, Multi-channel demand generation, B2B2C, Business Development, Revenue Partnerships, General Management, Team Building, Internet Marketing, Freemium business models, Product Management and Development. Timothy Dowling Bio \nTim has extensive experience in building and running Internet businesses. He is an expert at online sales & marketing leveraging inside direct sales and partner channels. He has a core background in product management for both consumer and business internet services. With both big company (Intel & McAfee) and startup experience, he has grown and managed businesses in excess of $100M in revenues. Specialties:Cloud based apps, Online channel development, B2B, Low Touch Inside Sales, Multi-channel demand generation, B2B2C, Business Development, Revenue Partnerships, General Management, Team Building, Internet Marketing, Freemium business models, Product Management and Development. Timothy Dowling Bio \nTim has extensive experience in building and running Internet businesses. He is an expert at online sales & marketing leveraging inside direct sales and partner channels. He has a core background in product management for both consumer and business internet services. With both big company (Intel & McAfee) and startup experience, he has grown and managed businesses in excess of $100M in revenues. Specialties:Cloud based apps, Online channel development, B2B, Low Touch Inside Sales, Multi-channel demand generation, B2B2C, Business Development, Revenue Partnerships, General Management, Team Building, Internet Marketing, Freemium business models, Product Management and Development. Experience Executive Chairman & CEO Risk I/O May 2013  –  October 2014  (1 year 6 months) San Francisco Risk I/O provides cloud-based \"Threat Processing\" against synced vulnerability data to find the most critical vulnerabilities to fix. Provided company leadership in product market fit and company scaling of revenue. Now well on their way to success. Great team! COO OneLogin, Inc. September 2011  –  March 2012  (7 months) San Francisco Bay Area COO for OneLogin Single Sign-on solution. Build inside sales and marketing teams and business development. Angel Investor Investor April 2009  –  August 2011  (2 years 5 months) San Francisco Angel investor/advisor for seed stage startup in Search and Security Vice President and General Manager for Web Security (Acquired by Intel) McAfee December 2006  –  December 2009  (3 years 1 month) Started new Business Unit to Secure the Web through Search. Acquired and Managed Scan Alert (HackerSafe) and SiteAdvisor launching McAfee Secure Certification, Search, and Shopping. President and CEO (Acquired by Cisco) Pure Networks August 2003  –  June 2006  (2 years 11 months) Built Pure from the Ground up to alleviate the pain of Home Networking. Sold to Cisco for $120M. My first CEO role, learned a lot, will do it again! Created over $20M in revenue, develop strategy and products for SoHo market and partner distribution. Established key partnerships with AOL, Cisco, D-Link, and Comcast gaining distribution our brand to millions of users. GM Online e-commerce services Intel Corporation January 1997  –  January 2000  (3 years 1 month) Develop and managed small merchant website services for hosted ecommerce sites \nwith strategic distribution partnership with Excite@home and British Telecom and led \nIntel Internet initiatives for Intel Inside. Dir of Products Intel Corporation July 1987  –  January 2000  (12 years 7 months) Served in Product Management, sales, and general management positions. Responsible for Above Boards (PC Memory Cards), PCMCIA Slots along with PCMCIA Wireless Cards, NICs, and Modems, Intel European Reseller Channel, Intel H.322 Voice over IP Stack and Streaming Stack (Licensed to Microsoft and Real) Intel.com Consumer and 12 related consumer internet initiatives. Director Product Management Intel Corporation January 1995  –  January 1997  (2 years 1 month) Communication Products \n· Created and led strategy and development effort for Internet VoIP and Streaming Video. \n· Lead licensing strategy of technology to Microsoft and Real Networks. \n· Led the creation of Intel's Internet phone, generating over 2,000,000 downloads. \n· Created and launched first DNS service for connecting users of VoIP calls signing 5 \npartners to run and manage the directory service. \n· Led initiative to integrate key VoIP features for dial-up users into H.323 specification. \n· Received Intel Achievement Marketing Director Intel Corporation January 1993  –  January 1995  (2 years 1 month) · Founding member to create PCMCIA business, managed team of 9 Product and \nMarketing Managers to launch US and European PCMCIA communication cards. \n· Launched first PCMCIA Faxmodem to connect thru cell phones and also allow the import \nand export of cell phone contact directory. \n· Generated $80M in sales within two years, $10M marketing budget. Director of Sales and Marketing Intel Corporation January 1990  –  January 1993  (3 years 1 month) · Establish new European team for marketing Intel end-use (not semiconductor) products \nthru two-tiered distribution. \n· Revenue growth from $10M to over $59M in two years, $5M Marketing Budget. Product Line Manager Intel Corporation January 1987  –  January 1990  (3 years 1 month) · Managed Memory add-in card business and grew revenue from $42 to $63M sprinting \npast competitor AST. \n· Formed and managed partnerships with Lotus and Microsoft. \n· Established distribution programs to win an incremental $10M in revenue. Executive Chairman & CEO Risk I/O May 2013  –  October 2014  (1 year 6 months) San Francisco Risk I/O provides cloud-based \"Threat Processing\" against synced vulnerability data to find the most critical vulnerabilities to fix. Provided company leadership in product market fit and company scaling of revenue. Now well on their way to success. Great team! Executive Chairman & CEO Risk I/O May 2013  –  October 2014  (1 year 6 months) San Francisco Risk I/O provides cloud-based \"Threat Processing\" against synced vulnerability data to find the most critical vulnerabilities to fix. Provided company leadership in product market fit and company scaling of revenue. Now well on their way to success. Great team! COO OneLogin, Inc. September 2011  –  March 2012  (7 months) San Francisco Bay Area COO for OneLogin Single Sign-on solution. Build inside sales and marketing teams and business development. COO OneLogin, Inc. September 2011  –  March 2012  (7 months) San Francisco Bay Area COO for OneLogin Single Sign-on solution. Build inside sales and marketing teams and business development. Angel Investor Investor April 2009  –  August 2011  (2 years 5 months) San Francisco Angel investor/advisor for seed stage startup in Search and Security Angel Investor Investor April 2009  –  August 2011  (2 years 5 months) San Francisco Angel investor/advisor for seed stage startup in Search and Security Vice President and General Manager for Web Security (Acquired by Intel) McAfee December 2006  –  December 2009  (3 years 1 month) Started new Business Unit to Secure the Web through Search. Acquired and Managed Scan Alert (HackerSafe) and SiteAdvisor launching McAfee Secure Certification, Search, and Shopping. Vice President and General Manager for Web Security (Acquired by Intel) McAfee December 2006  –  December 2009  (3 years 1 month) Started new Business Unit to Secure the Web through Search. Acquired and Managed Scan Alert (HackerSafe) and SiteAdvisor launching McAfee Secure Certification, Search, and Shopping. President and CEO (Acquired by Cisco) Pure Networks August 2003  –  June 2006  (2 years 11 months) Built Pure from the Ground up to alleviate the pain of Home Networking. Sold to Cisco for $120M. My first CEO role, learned a lot, will do it again! Created over $20M in revenue, develop strategy and products for SoHo market and partner distribution. Established key partnerships with AOL, Cisco, D-Link, and Comcast gaining distribution our brand to millions of users. President and CEO (Acquired by Cisco) Pure Networks August 2003  –  June 2006  (2 years 11 months) Built Pure from the Ground up to alleviate the pain of Home Networking. Sold to Cisco for $120M. My first CEO role, learned a lot, will do it again! Created over $20M in revenue, develop strategy and products for SoHo market and partner distribution. Established key partnerships with AOL, Cisco, D-Link, and Comcast gaining distribution our brand to millions of users. GM Online e-commerce services Intel Corporation January 1997  –  January 2000  (3 years 1 month) Develop and managed small merchant website services for hosted ecommerce sites \nwith strategic distribution partnership with Excite@home and British Telecom and led \nIntel Internet initiatives for Intel Inside. GM Online e-commerce services Intel Corporation January 1997  –  January 2000  (3 years 1 month) Develop and managed small merchant website services for hosted ecommerce sites \nwith strategic distribution partnership with Excite@home and British Telecom and led \nIntel Internet initiatives for Intel Inside. Dir of Products Intel Corporation July 1987  –  January 2000  (12 years 7 months) Served in Product Management, sales, and general management positions. Responsible for Above Boards (PC Memory Cards), PCMCIA Slots along with PCMCIA Wireless Cards, NICs, and Modems, Intel European Reseller Channel, Intel H.322 Voice over IP Stack and Streaming Stack (Licensed to Microsoft and Real) Intel.com Consumer and 12 related consumer internet initiatives. Dir of Products Intel Corporation July 1987  –  January 2000  (12 years 7 months) Served in Product Management, sales, and general management positions. Responsible for Above Boards (PC Memory Cards), PCMCIA Slots along with PCMCIA Wireless Cards, NICs, and Modems, Intel European Reseller Channel, Intel H.322 Voice over IP Stack and Streaming Stack (Licensed to Microsoft and Real) Intel.com Consumer and 12 related consumer internet initiatives. Director Product Management Intel Corporation January 1995  –  January 1997  (2 years 1 month) Communication Products \n· Created and led strategy and development effort for Internet VoIP and Streaming Video. \n· Lead licensing strategy of technology to Microsoft and Real Networks. \n· Led the creation of Intel's Internet phone, generating over 2,000,000 downloads. \n· Created and launched first DNS service for connecting users of VoIP calls signing 5 \npartners to run and manage the directory service. \n· Led initiative to integrate key VoIP features for dial-up users into H.323 specification. \n· Received Intel Achievement Director Product Management Intel Corporation January 1995  –  January 1997  (2 years 1 month) Communication Products \n· Created and led strategy and development effort for Internet VoIP and Streaming Video. \n· Lead licensing strategy of technology to Microsoft and Real Networks. \n· Led the creation of Intel's Internet phone, generating over 2,000,000 downloads. \n· Created and launched first DNS service for connecting users of VoIP calls signing 5 \npartners to run and manage the directory service. \n· Led initiative to integrate key VoIP features for dial-up users into H.323 specification. \n· Received Intel Achievement Marketing Director Intel Corporation January 1993  –  January 1995  (2 years 1 month) · Founding member to create PCMCIA business, managed team of 9 Product and \nMarketing Managers to launch US and European PCMCIA communication cards. \n· Launched first PCMCIA Faxmodem to connect thru cell phones and also allow the import \nand export of cell phone contact directory. \n· Generated $80M in sales within two years, $10M marketing budget. Marketing Director Intel Corporation January 1993  –  January 1995  (2 years 1 month) · Founding member to create PCMCIA business, managed team of 9 Product and \nMarketing Managers to launch US and European PCMCIA communication cards. \n· Launched first PCMCIA Faxmodem to connect thru cell phones and also allow the import \nand export of cell phone contact directory. \n· Generated $80M in sales within two years, $10M marketing budget. Director of Sales and Marketing Intel Corporation January 1990  –  January 1993  (3 years 1 month) · Establish new European team for marketing Intel end-use (not semiconductor) products \nthru two-tiered distribution. \n· Revenue growth from $10M to over $59M in two years, $5M Marketing Budget. Director of Sales and Marketing Intel Corporation January 1990  –  January 1993  (3 years 1 month) · Establish new European team for marketing Intel end-use (not semiconductor) products \nthru two-tiered distribution. \n· Revenue growth from $10M to over $59M in two years, $5M Marketing Budget. Product Line Manager Intel Corporation January 1987  –  January 1990  (3 years 1 month) · Managed Memory add-in card business and grew revenue from $42 to $63M sprinting \npast competitor AST. \n· Formed and managed partnerships with Lotus and Microsoft. \n· Established distribution programs to win an incremental $10M in revenue. Product Line Manager Intel Corporation January 1987  –  January 1990  (3 years 1 month) · Managed Memory add-in card business and grew revenue from $42 to $63M sprinting \npast competitor AST. \n· Formed and managed partnerships with Lotus and Microsoft. \n· Established distribution programs to win an incremental $10M in revenue. Skills SaaS Business Development B2B Team Building Web Marketing B2B2C Cloud Computing Marketing Management Mergers Leadership E-commerce Product Management Start-ups Product Marketing Salesforce.com Marketing Cross-functional Team... Agile Methodologies Business Strategy Lead Generation Demand Generation See 6+     See less Skills  SaaS Business Development B2B Team Building Web Marketing B2B2C Cloud Computing Marketing Management Mergers Leadership E-commerce Product Management Start-ups Product Marketing Salesforce.com Marketing Cross-functional Team... Agile Methodologies Business Strategy Lead Generation Demand Generation See 6+     See less SaaS Business Development B2B Team Building Web Marketing B2B2C Cloud Computing Marketing Management Mergers Leadership E-commerce Product Management Start-ups Product Marketing Salesforce.com Marketing Cross-functional Team... Agile Methodologies Business Strategy Lead Generation Demand Generation See 6+     See less SaaS Business Development B2B Team Building Web Marketing B2B2C Cloud Computing Marketing Management Mergers Leadership E-commerce Product Management Start-ups Product Marketing Salesforce.com Marketing Cross-functional Team... Agile Methodologies Business Strategy Lead Generation Demand Generation See 6+     See less ", "Languages Portuguese Spanish Portuguese Spanish Portuguese Spanish Skills Strategic Partnerships Cross-functional Team... Product Management Product Marketing Program Management Marketing Strategy Management Competitive Analysis Channel Business Development Business Alliances Channel Partners Cloud Computing Consulting Go-to-market Strategy Enterprise Software Demand Generation Integrated Marketing Intel Lead Generation Marketing Marketing Communications Marketing Management Messaging Mobile Devices Multi-channel Marketing Partner Management Product Development Product Launch Project Management Public Relations SaaS Sales Sales Enablement Semiconductors Software Industry Solution Selling Start-ups Strategic Planning Strategy See 25+     See less Skills  Strategic Partnerships Cross-functional Team... Product Management Product Marketing Program Management Marketing Strategy Management Competitive Analysis Channel Business Development Business Alliances Channel Partners Cloud Computing Consulting Go-to-market Strategy Enterprise Software Demand Generation Integrated Marketing Intel Lead Generation Marketing Marketing Communications Marketing Management Messaging Mobile Devices Multi-channel Marketing Partner Management Product Development Product Launch Project Management Public Relations SaaS Sales Sales Enablement Semiconductors Software Industry Solution Selling Start-ups Strategic Planning Strategy See 25+     See less Strategic Partnerships Cross-functional Team... Product Management Product Marketing Program Management Marketing Strategy Management Competitive Analysis Channel Business Development Business Alliances Channel Partners Cloud Computing Consulting Go-to-market Strategy Enterprise Software Demand Generation Integrated Marketing Intel Lead Generation Marketing Marketing Communications Marketing Management Messaging Mobile Devices Multi-channel Marketing Partner Management Product Development Product Launch Project Management Public Relations SaaS Sales Sales Enablement Semiconductors Software Industry Solution Selling Start-ups Strategic Planning Strategy See 25+     See less Strategic Partnerships Cross-functional Team... Product Management Product Marketing Program Management Marketing Strategy Management Competitive Analysis Channel Business Development Business Alliances Channel Partners Cloud Computing Consulting Go-to-market Strategy Enterprise Software Demand Generation Integrated Marketing Intel Lead Generation Marketing Marketing Communications Marketing Management Messaging Mobile Devices Multi-channel Marketing Partner Management Product Development Product Launch Project Management Public Relations SaaS Sales Sales Enablement Semiconductors Software Industry Solution Selling Start-ups Strategic Planning Strategy See 25+     See less ", "Languages Spanish Spanish Spanish Skills Business Strategy Market Analysis Marketing Strategy Latin America Cross-functional Team... Management Corporate Communications Marketing Communications Go-to-market Strategy Start-ups Product Management Strategy Product Development Team Leadership Corporate Social... Strategic Planning Sales Management Business Planning Portuguese Business Development International Business Product Marketing Competitive Analysis Strategic Partnerships Marketing Entrepreneurship Product Launch Market Research Marketing Management CRM See 15+     See less Skills  Business Strategy Market Analysis Marketing Strategy Latin America Cross-functional Team... Management Corporate Communications Marketing Communications Go-to-market Strategy Start-ups Product Management Strategy Product Development Team Leadership Corporate Social... Strategic Planning Sales Management Business Planning Portuguese Business Development International Business Product Marketing Competitive Analysis Strategic Partnerships Marketing Entrepreneurship Product Launch Market Research Marketing Management CRM See 15+     See less Business Strategy Market Analysis Marketing Strategy Latin America Cross-functional Team... Management Corporate Communications Marketing Communications Go-to-market Strategy Start-ups Product Management Strategy Product Development Team Leadership Corporate Social... Strategic Planning Sales Management Business Planning Portuguese Business Development International Business Product Marketing Competitive Analysis Strategic Partnerships Marketing Entrepreneurship Product Launch Market Research Marketing Management CRM See 15+     See less Business Strategy Market Analysis Marketing Strategy Latin America Cross-functional Team... Management Corporate Communications Marketing Communications Go-to-market Strategy Start-ups Product Management Strategy Product Development Team Leadership Corporate Social... Strategic Planning Sales Management Business Planning Portuguese Business Development International Business Product Marketing Competitive Analysis Strategic Partnerships Marketing Entrepreneurship Product Launch Market Research Marketing Management CRM See 15+     See less ", "Skills Skills     ", "Languages English Native or bilingual proficiency English Native or bilingual proficiency English Native or bilingual proficiency Native or bilingual proficiency Skills Team Leadership Team Management Business Development Marketing Management Embedded Systems Product Management Debugging Software Engineering Embedded Software Semiconductors Strategic Partnerships System Architecture Software Development Computer Architecture Skills  Team Leadership Team Management Business Development Marketing Management Embedded Systems Product Management Debugging Software Engineering Embedded Software Semiconductors Strategic Partnerships System Architecture Software Development Computer Architecture Team Leadership Team Management Business Development Marketing Management Embedded Systems Product Management Debugging Software Engineering Embedded Software Semiconductors Strategic Partnerships System Architecture Software Development Computer Architecture Team Leadership Team Management Business Development Marketing Management Embedded Systems Product Management Debugging Software Engineering Embedded Software Semiconductors Strategic Partnerships System Architecture Software Development Computer Architecture ", "Experience Geography Marketing Director Intel Corporation October 1996  – Present (18 years 11 months) Japan Geography Marketing Director Intel Corporation October 1996  – Present (18 years 11 months) Japan Geography Marketing Director Intel Corporation October 1996  – Present (18 years 11 months) Japan Education California State University-Chico BA,  Marketing California State University-Chico BA,  Marketing California State University-Chico BA,  Marketing California State University-Chico BA,  Marketing ", "Summary Experienced professional with more than 25 years working in the Technology Industry in Brasil and Latin America (+ 15 years at Intel Corporation), having leadership functions in Marketing, Sales, Technical and Business Units areas. \n \nSince August 2012 started to be an entrepreneur and to invest on independent projects (DESCOMPLICANDO CARREIRAS - Career Planning System / Startup is the latest while had worked at Olhar Digital as Marketing Director and Strategic Advisor, at SUCESU-SP - Marketing VP, at PROJECT-1 - Mentor / Colaborator), with main focus on Business Strategy, Technology, Communications / Media / Internet, Marketing and Innovation. \n \nStarted my own Strategic Advisory Company - WINTEPE, on October 2013, to offer Advisory Services on supporting Decision Makers (CxOs) to address business opportunities and threats related to technology transformation on Business, focusing on Strategic Planing, Marketing / Positioning, Innovation and Management Pratices. Worked with Olhar Digital, SW Comunicação (Sérgio Waib - Giro Business and Além do Mais), Lucia Faria PR Agency... \n \nSince November 2013 atinge as inivited Teacher at FIA , focusing mainly on Marketing Disciplines Marketing Disciplines for MBAs (Digital Marketing, Communication & Advertising, Distribution Marketing Plan and Control, Pricing, Marketing Management...), \n \nStarted Descomplicando Carreiras with my partner in 2014, to offer content and services related to Career Planning (not coaching) with an pragmatic and innovative approach at articles, speeches and workshops. \n \nWriting Marketing and Technology articles to different vehicles in Brazil. \n \nSpecialties: Strategy, Brand, Communications, Demand Generation, Marketing, Sales, Technology, Innovation, Latin America and Brasil Summary Experienced professional with more than 25 years working in the Technology Industry in Brasil and Latin America (+ 15 years at Intel Corporation), having leadership functions in Marketing, Sales, Technical and Business Units areas. \n \nSince August 2012 started to be an entrepreneur and to invest on independent projects (DESCOMPLICANDO CARREIRAS - Career Planning System / Startup is the latest while had worked at Olhar Digital as Marketing Director and Strategic Advisor, at SUCESU-SP - Marketing VP, at PROJECT-1 - Mentor / Colaborator), with main focus on Business Strategy, Technology, Communications / Media / Internet, Marketing and Innovation. \n \nStarted my own Strategic Advisory Company - WINTEPE, on October 2013, to offer Advisory Services on supporting Decision Makers (CxOs) to address business opportunities and threats related to technology transformation on Business, focusing on Strategic Planing, Marketing / Positioning, Innovation and Management Pratices. Worked with Olhar Digital, SW Comunicação (Sérgio Waib - Giro Business and Além do Mais), Lucia Faria PR Agency... \n \nSince November 2013 atinge as inivited Teacher at FIA , focusing mainly on Marketing Disciplines Marketing Disciplines for MBAs (Digital Marketing, Communication & Advertising, Distribution Marketing Plan and Control, Pricing, Marketing Management...), \n \nStarted Descomplicando Carreiras with my partner in 2014, to offer content and services related to Career Planning (not coaching) with an pragmatic and innovative approach at articles, speeches and workshops. \n \nWriting Marketing and Technology articles to different vehicles in Brazil. \n \nSpecialties: Strategy, Brand, Communications, Demand Generation, Marketing, Sales, Technology, Innovation, Latin America and Brasil Experienced professional with more than 25 years working in the Technology Industry in Brasil and Latin America (+ 15 years at Intel Corporation), having leadership functions in Marketing, Sales, Technical and Business Units areas. \n \nSince August 2012 started to be an entrepreneur and to invest on independent projects (DESCOMPLICANDO CARREIRAS - Career Planning System / Startup is the latest while had worked at Olhar Digital as Marketing Director and Strategic Advisor, at SUCESU-SP - Marketing VP, at PROJECT-1 - Mentor / Colaborator), with main focus on Business Strategy, Technology, Communications / Media / Internet, Marketing and Innovation. \n \nStarted my own Strategic Advisory Company - WINTEPE, on October 2013, to offer Advisory Services on supporting Decision Makers (CxOs) to address business opportunities and threats related to technology transformation on Business, focusing on Strategic Planing, Marketing / Positioning, Innovation and Management Pratices. Worked with Olhar Digital, SW Comunicação (Sérgio Waib - Giro Business and Além do Mais), Lucia Faria PR Agency... \n \nSince November 2013 atinge as inivited Teacher at FIA , focusing mainly on Marketing Disciplines Marketing Disciplines for MBAs (Digital Marketing, Communication & Advertising, Distribution Marketing Plan and Control, Pricing, Marketing Management...), \n \nStarted Descomplicando Carreiras with my partner in 2014, to offer content and services related to Career Planning (not coaching) with an pragmatic and innovative approach at articles, speeches and workshops. \n \nWriting Marketing and Technology articles to different vehicles in Brazil. \n \nSpecialties: Strategy, Brand, Communications, Demand Generation, Marketing, Sales, Technology, Innovation, Latin America and Brasil Experienced professional with more than 25 years working in the Technology Industry in Brasil and Latin America (+ 15 years at Intel Corporation), having leadership functions in Marketing, Sales, Technical and Business Units areas. \n \nSince August 2012 started to be an entrepreneur and to invest on independent projects (DESCOMPLICANDO CARREIRAS - Career Planning System / Startup is the latest while had worked at Olhar Digital as Marketing Director and Strategic Advisor, at SUCESU-SP - Marketing VP, at PROJECT-1 - Mentor / Colaborator), with main focus on Business Strategy, Technology, Communications / Media / Internet, Marketing and Innovation. \n \nStarted my own Strategic Advisory Company - WINTEPE, on October 2013, to offer Advisory Services on supporting Decision Makers (CxOs) to address business opportunities and threats related to technology transformation on Business, focusing on Strategic Planing, Marketing / Positioning, Innovation and Management Pratices. Worked with Olhar Digital, SW Comunicação (Sérgio Waib - Giro Business and Além do Mais), Lucia Faria PR Agency... \n \nSince November 2013 atinge as inivited Teacher at FIA , focusing mainly on Marketing Disciplines Marketing Disciplines for MBAs (Digital Marketing, Communication & Advertising, Distribution Marketing Plan and Control, Pricing, Marketing Management...), \n \nStarted Descomplicando Carreiras with my partner in 2014, to offer content and services related to Career Planning (not coaching) with an pragmatic and innovative approach at articles, speeches and workshops. \n \nWriting Marketing and Technology articles to different vehicles in Brazil. \n \nSpecialties: Strategy, Brand, Communications, Demand Generation, Marketing, Sales, Technology, Innovation, Latin America and Brasil Experience Co-founder / Partner Descomplicando Carreiras May 2014  – Present (1 year 4 months) São Paulo Area, Brazil Co-founder of a new Career Orientation System Company, providing services, training and support to produce career plans. Founder - Partner / Strategic Advisor WINTEPE - Strategic Advisory October 2013  – Present (1 year 11 months) São Paulo Area, Brazil WINTEPE is focused on Strategic Advisory, Marketing and Business Strategy Consuntancy. \n \nWe support businesses impacted by technology transformations offering Strategic Advisory services to support Strategic Planning, Marketing Positioning and Execution, Innovation and Management pratices, based on more than 25 years experience at Large, Medium and Small Companies. \n \nThat standard service model is based on regular meetings and hours allocation to develop / build, manage implement and monitor strategies, tactics and projects across the business focused on short, mid and long term major needs / demands (scope). Invited Professor (MBA - Marketing) FIA - Fundação Instituto de Administração November 2013  – Present (1 year 10 months) Brazil Invited Teacher on MBA/Post Graduation Courses for Different Marketing Disciplines at PROCED, PROFUTURO, PROVAR AND OTHER FIA GROUPS: \n. Ecommerce and Webmarketing, Digital Marketing, Emerging Markets and Technology-Digital Services Markets Analysis, Marketing Planning and Control, Strategic Marketing Management, Publicity Campaign, Branding Strategic & Marketing Advisor Olhar Digital June 2012  –  December 2014  (2 years 7 months) São Paulo Area, Brazil Supporting business strategies / model discussions. Strategic Planning - Development of Marketing Plans (new products, new channels, new accounts/customers). Strategic Partnerships and Special Projects Sales MARKETING VP Sucesu SP June 2012  –  September 2014  (2 years 4 months) São Paulo Area, Brazil . Branding & Communications, Product Portifolio, Strategic Positioning and Member of the Management Board. Latin America Marketing Director Intel Corporation August 2009  –  May 2012  (2 years 10 months) Regional CMO. Responsible for Branding and Demand Generation across the Latin America Region, managing Product, Consumer, Business, Brand & Communications, Operations, PR and Market Expansion areas. Dotted line to Worldwide CMO. Member WTC CMOs Comittee 2009  –  April 2012  (3 years) Share best pratices and challenges in Marketing plus build networking. Brazil Marketing Director Intel Corporation May 2004  –  August 2009  (5 years 4 months) Built the brand, defined strategy, recovered MSS, drove marketing customers engagements. Latin America Region Business Marketing Manager Intel Corporation January 2003  –  May 2004  (1 year 5 months) Responsible for Marketing focused on Business Segment (Enterprise covered accounts and scale to SMB). Internet, Case Studies, Events, PC Ignite Program and other initiatives accross the region. Marketing Manager Special Assignment Intel Corporation July 2002  –  December 2002  (6 months) Special assignment to cover Marketing Manager position in Mexico City and other 03 months as Northern Cone (Colombia, Venezuela, Peru, Ecuador and Central America) Latin America Region - Channel Sales Manager Intel Corporation January 2000  –  July 2002  (2 years 7 months) Responsible to manage Intel components & networking product sales to Integration Channel across Latin America Region. Defiing new sales our record levels. Manage a team up to 25 Field Sales Engineers to cover System Integrators, Distributors, Networking Integrators and Internet Service Providers. Brazil Networling Manager Intel Corporation February 1997  –  December 1999  (2 years 11 months) Started as Field Sales Engineer to develop channel accounts/programs to Networking, Management and Video Conference Systems. \nBuild the sales, technical and marketing team, taking Intel brand to be among three most recognized in Networking as well took leadership in NICs in 1999 (against 3COM). Sales and Services Manager SAGA Sistemas e Computadores 1993  –  1997  (4 years) Responsible for developing the Sales Department in Sao Paulo office, covering top corporate accounts PC and Networking projects.  \nServices Manager, including technical support, extended waranty, network managment consulting, DBA outsourcing related to IT / CIO Product Analyst / Technical Support / IT Pool Supervisor & Operator Price Waterhouse Coopers 1989  –  1993  (4 years) Started at Price Waterhouse Consuntancy IT Pool as PC operator, moved to Gouvea de Souza & MH joint venture as PC operator and became PC / IT Pool Supervisor. Did the adminstrative to technical transition, moving to Product Analyst at Result System (Microsoft distrubutor, plus onw financial system and later BAAN and BACHMAN represnetative), finally took the post sales technical support analyst function. IT / Tecommunications Intern Volkswagen February 1988  –  December 1988  (11 months) Co-founder / Partner Descomplicando Carreiras May 2014  – Present (1 year 4 months) São Paulo Area, Brazil Co-founder of a new Career Orientation System Company, providing services, training and support to produce career plans. Co-founder / Partner Descomplicando Carreiras May 2014  – Present (1 year 4 months) São Paulo Area, Brazil Co-founder of a new Career Orientation System Company, providing services, training and support to produce career plans. Founder - Partner / Strategic Advisor WINTEPE - Strategic Advisory October 2013  – Present (1 year 11 months) São Paulo Area, Brazil WINTEPE is focused on Strategic Advisory, Marketing and Business Strategy Consuntancy. \n \nWe support businesses impacted by technology transformations offering Strategic Advisory services to support Strategic Planning, Marketing Positioning and Execution, Innovation and Management pratices, based on more than 25 years experience at Large, Medium and Small Companies. \n \nThat standard service model is based on regular meetings and hours allocation to develop / build, manage implement and monitor strategies, tactics and projects across the business focused on short, mid and long term major needs / demands (scope). Founder - Partner / Strategic Advisor WINTEPE - Strategic Advisory October 2013  – Present (1 year 11 months) São Paulo Area, Brazil WINTEPE is focused on Strategic Advisory, Marketing and Business Strategy Consuntancy. \n \nWe support businesses impacted by technology transformations offering Strategic Advisory services to support Strategic Planning, Marketing Positioning and Execution, Innovation and Management pratices, based on more than 25 years experience at Large, Medium and Small Companies. \n \nThat standard service model is based on regular meetings and hours allocation to develop / build, manage implement and monitor strategies, tactics and projects across the business focused on short, mid and long term major needs / demands (scope). Invited Professor (MBA - Marketing) FIA - Fundação Instituto de Administração November 2013  – Present (1 year 10 months) Brazil Invited Teacher on MBA/Post Graduation Courses for Different Marketing Disciplines at PROCED, PROFUTURO, PROVAR AND OTHER FIA GROUPS: \n. Ecommerce and Webmarketing, Digital Marketing, Emerging Markets and Technology-Digital Services Markets Analysis, Marketing Planning and Control, Strategic Marketing Management, Publicity Campaign, Branding Invited Professor (MBA - Marketing) FIA - Fundação Instituto de Administração November 2013  – Present (1 year 10 months) Brazil Invited Teacher on MBA/Post Graduation Courses for Different Marketing Disciplines at PROCED, PROFUTURO, PROVAR AND OTHER FIA GROUPS: \n. Ecommerce and Webmarketing, Digital Marketing, Emerging Markets and Technology-Digital Services Markets Analysis, Marketing Planning and Control, Strategic Marketing Management, Publicity Campaign, Branding Strategic & Marketing Advisor Olhar Digital June 2012  –  December 2014  (2 years 7 months) São Paulo Area, Brazil Supporting business strategies / model discussions. Strategic Planning - Development of Marketing Plans (new products, new channels, new accounts/customers). Strategic Partnerships and Special Projects Sales Strategic & Marketing Advisor Olhar Digital June 2012  –  December 2014  (2 years 7 months) São Paulo Area, Brazil Supporting business strategies / model discussions. Strategic Planning - Development of Marketing Plans (new products, new channels, new accounts/customers). Strategic Partnerships and Special Projects Sales MARKETING VP Sucesu SP June 2012  –  September 2014  (2 years 4 months) São Paulo Area, Brazil . Branding & Communications, Product Portifolio, Strategic Positioning and Member of the Management Board. MARKETING VP Sucesu SP June 2012  –  September 2014  (2 years 4 months) São Paulo Area, Brazil . Branding & Communications, Product Portifolio, Strategic Positioning and Member of the Management Board. Latin America Marketing Director Intel Corporation August 2009  –  May 2012  (2 years 10 months) Regional CMO. Responsible for Branding and Demand Generation across the Latin America Region, managing Product, Consumer, Business, Brand & Communications, Operations, PR and Market Expansion areas. Dotted line to Worldwide CMO. Latin America Marketing Director Intel Corporation August 2009  –  May 2012  (2 years 10 months) Regional CMO. Responsible for Branding and Demand Generation across the Latin America Region, managing Product, Consumer, Business, Brand & Communications, Operations, PR and Market Expansion areas. Dotted line to Worldwide CMO. Member WTC CMOs Comittee 2009  –  April 2012  (3 years) Share best pratices and challenges in Marketing plus build networking. Member WTC CMOs Comittee 2009  –  April 2012  (3 years) Share best pratices and challenges in Marketing plus build networking. Brazil Marketing Director Intel Corporation May 2004  –  August 2009  (5 years 4 months) Built the brand, defined strategy, recovered MSS, drove marketing customers engagements. Brazil Marketing Director Intel Corporation May 2004  –  August 2009  (5 years 4 months) Built the brand, defined strategy, recovered MSS, drove marketing customers engagements. Latin America Region Business Marketing Manager Intel Corporation January 2003  –  May 2004  (1 year 5 months) Responsible for Marketing focused on Business Segment (Enterprise covered accounts and scale to SMB). Internet, Case Studies, Events, PC Ignite Program and other initiatives accross the region. Latin America Region Business Marketing Manager Intel Corporation January 2003  –  May 2004  (1 year 5 months) Responsible for Marketing focused on Business Segment (Enterprise covered accounts and scale to SMB). Internet, Case Studies, Events, PC Ignite Program and other initiatives accross the region. Marketing Manager Special Assignment Intel Corporation July 2002  –  December 2002  (6 months) Special assignment to cover Marketing Manager position in Mexico City and other 03 months as Northern Cone (Colombia, Venezuela, Peru, Ecuador and Central America) Marketing Manager Special Assignment Intel Corporation July 2002  –  December 2002  (6 months) Special assignment to cover Marketing Manager position in Mexico City and other 03 months as Northern Cone (Colombia, Venezuela, Peru, Ecuador and Central America) Latin America Region - Channel Sales Manager Intel Corporation January 2000  –  July 2002  (2 years 7 months) Responsible to manage Intel components & networking product sales to Integration Channel across Latin America Region. Defiing new sales our record levels. Manage a team up to 25 Field Sales Engineers to cover System Integrators, Distributors, Networking Integrators and Internet Service Providers. Latin America Region - Channel Sales Manager Intel Corporation January 2000  –  July 2002  (2 years 7 months) Responsible to manage Intel components & networking product sales to Integration Channel across Latin America Region. Defiing new sales our record levels. Manage a team up to 25 Field Sales Engineers to cover System Integrators, Distributors, Networking Integrators and Internet Service Providers. Brazil Networling Manager Intel Corporation February 1997  –  December 1999  (2 years 11 months) Started as Field Sales Engineer to develop channel accounts/programs to Networking, Management and Video Conference Systems. \nBuild the sales, technical and marketing team, taking Intel brand to be among three most recognized in Networking as well took leadership in NICs in 1999 (against 3COM). Brazil Networling Manager Intel Corporation February 1997  –  December 1999  (2 years 11 months) Started as Field Sales Engineer to develop channel accounts/programs to Networking, Management and Video Conference Systems. \nBuild the sales, technical and marketing team, taking Intel brand to be among three most recognized in Networking as well took leadership in NICs in 1999 (against 3COM). Sales and Services Manager SAGA Sistemas e Computadores 1993  –  1997  (4 years) Responsible for developing the Sales Department in Sao Paulo office, covering top corporate accounts PC and Networking projects.  \nServices Manager, including technical support, extended waranty, network managment consulting, DBA outsourcing related to IT / CIO Sales and Services Manager SAGA Sistemas e Computadores 1993  –  1997  (4 years) Responsible for developing the Sales Department in Sao Paulo office, covering top corporate accounts PC and Networking projects.  \nServices Manager, including technical support, extended waranty, network managment consulting, DBA outsourcing related to IT / CIO Product Analyst / Technical Support / IT Pool Supervisor & Operator Price Waterhouse Coopers 1989  –  1993  (4 years) Started at Price Waterhouse Consuntancy IT Pool as PC operator, moved to Gouvea de Souza & MH joint venture as PC operator and became PC / IT Pool Supervisor. Did the adminstrative to technical transition, moving to Product Analyst at Result System (Microsoft distrubutor, plus onw financial system and later BAAN and BACHMAN represnetative), finally took the post sales technical support analyst function. Product Analyst / Technical Support / IT Pool Supervisor & Operator Price Waterhouse Coopers 1989  –  1993  (4 years) Started at Price Waterhouse Consuntancy IT Pool as PC operator, moved to Gouvea de Souza & MH joint venture as PC operator and became PC / IT Pool Supervisor. Did the adminstrative to technical transition, moving to Product Analyst at Result System (Microsoft distrubutor, plus onw financial system and later BAAN and BACHMAN represnetative), finally took the post sales technical support analyst function. IT / Tecommunications Intern Volkswagen February 1988  –  December 1988  (11 months) IT / Tecommunications Intern Volkswagen February 1988  –  December 1988  (11 months) Languages Spanish and English Spanish and English Spanish and English Skills Strategy Business Strategy Marketing Strategic Planning Start-ups Channel Marketing Strategy Go-to-market Strategy Team Management Marketing Management Digital Marketing Latin America Market Analysis Management Product Marketing Integrated Marketing Demand Generation Market Research Business Planning Cross-functional Team... Business Development Market Planning Enterprise Software Team Leadership Sales Management Product Management Leadership Marketing Communications Strategic Partnerships Negotiation Competitive Analysis E-commerce Channel Partners Public Relations CRM Account Management Online Marketing Segmentation Corporate Communications Goal Oriented Project Management Brand Management Digital Strategy Online Advertising Sales Outsourcing B2B Results Oriented Positioning Entrepreneurship See 35+     See less Skills  Strategy Business Strategy Marketing Strategic Planning Start-ups Channel Marketing Strategy Go-to-market Strategy Team Management Marketing Management Digital Marketing Latin America Market Analysis Management Product Marketing Integrated Marketing Demand Generation Market Research Business Planning Cross-functional Team... Business Development Market Planning Enterprise Software Team Leadership Sales Management Product Management Leadership Marketing Communications Strategic Partnerships Negotiation Competitive Analysis E-commerce Channel Partners Public Relations CRM Account Management Online Marketing Segmentation Corporate Communications Goal Oriented Project Management Brand Management Digital Strategy Online Advertising Sales Outsourcing B2B Results Oriented Positioning Entrepreneurship See 35+     See less Strategy Business Strategy Marketing Strategic Planning Start-ups Channel Marketing Strategy Go-to-market Strategy Team Management Marketing Management Digital Marketing Latin America Market Analysis Management Product Marketing Integrated Marketing Demand Generation Market Research Business Planning Cross-functional Team... Business Development Market Planning Enterprise Software Team Leadership Sales Management Product Management Leadership Marketing Communications Strategic Partnerships Negotiation Competitive Analysis E-commerce Channel Partners Public Relations CRM Account Management Online Marketing Segmentation Corporate Communications Goal Oriented Project Management Brand Management Digital Strategy Online Advertising Sales Outsourcing B2B Results Oriented Positioning Entrepreneurship See 35+     See less Strategy Business Strategy Marketing Strategic Planning Start-ups Channel Marketing Strategy Go-to-market Strategy Team Management Marketing Management Digital Marketing Latin America Market Analysis Management Product Marketing Integrated Marketing Demand Generation Market Research Business Planning Cross-functional Team... Business Development Market Planning Enterprise Software Team Leadership Sales Management Product Management Leadership Marketing Communications Strategic Partnerships Negotiation Competitive Analysis E-commerce Channel Partners Public Relations CRM Account Management Online Marketing Segmentation Corporate Communications Goal Oriented Project Management Brand Management Digital Strategy Online Advertising Sales Outsourcing B2B Results Oriented Positioning Entrepreneurship See 35+     See less Education School of Economics, Business and Accounting at the University of São Paulo Master's Degree,  Administration / Entrepreneurship , Master - Professional 2014  – 2016 Mestrado em Ciências no Programa de Mestrado Profissional em Empreendedorismo - FEA / USP. \nInicio em Fevereiro de 2015. Prazo de 30 Meses p/ Conclusão. Escola Superior de Propaganda e Marketing Post-Graduation,  Marketing 1997  – 1999 Post Graduation in Marketing Universidade de São Caetano do Sul (USCS - ex IMES) Bachelor,  Computer Science 1989  – 1992 Computer Science Bachelor Pentagono Technical High Scholl,  Data Processing - Processamento de Dados 1986  – 1988 Data Processing Technician School of Economics, Business and Accounting at the University of São Paulo Master's Degree,  Administration / Entrepreneurship , Master - Professional 2014  – 2016 Mestrado em Ciências no Programa de Mestrado Profissional em Empreendedorismo - FEA / USP. \nInicio em Fevereiro de 2015. Prazo de 30 Meses p/ Conclusão. School of Economics, Business and Accounting at the University of São Paulo Master's Degree,  Administration / Entrepreneurship , Master - Professional 2014  – 2016 Mestrado em Ciências no Programa de Mestrado Profissional em Empreendedorismo - FEA / USP. \nInicio em Fevereiro de 2015. Prazo de 30 Meses p/ Conclusão. School of Economics, Business and Accounting at the University of São Paulo Master's Degree,  Administration / Entrepreneurship , Master - Professional 2014  – 2016 Mestrado em Ciências no Programa de Mestrado Profissional em Empreendedorismo - FEA / USP. \nInicio em Fevereiro de 2015. Prazo de 30 Meses p/ Conclusão. Escola Superior de Propaganda e Marketing Post-Graduation,  Marketing 1997  – 1999 Post Graduation in Marketing Escola Superior de Propaganda e Marketing Post-Graduation,  Marketing 1997  – 1999 Post Graduation in Marketing Escola Superior de Propaganda e Marketing Post-Graduation,  Marketing 1997  – 1999 Post Graduation in Marketing Universidade de São Caetano do Sul (USCS - ex IMES) Bachelor,  Computer Science 1989  – 1992 Computer Science Bachelor Universidade de São Caetano do Sul (USCS - ex IMES) Bachelor,  Computer Science 1989  – 1992 Computer Science Bachelor Universidade de São Caetano do Sul (USCS - ex IMES) Bachelor,  Computer Science 1989  – 1992 Computer Science Bachelor Pentagono Technical High Scholl,  Data Processing - Processamento de Dados 1986  – 1988 Data Processing Technician Pentagono Technical High Scholl,  Data Processing - Processamento de Dados 1986  – 1988 Data Processing Technician Pentagono Technical High Scholl,  Data Processing - Processamento de Dados 1986  – 1988 Data Processing Technician Honors & Awards ", "Summary Results-oriented marketing leader known for driving change, innovative solutions and creativity in a fast-paced, dynamic environment. Team-oriented with recognized ability and passion for driving collaboration across large, complex, geographically-dispersed and culturally diverse teams. History of developing break-through, integrated marketing campaigns aligned with business strategy that successfully increase brand preference, sales and market share. Global marketing experience and leadership skills spanning 30 countries and 4 continents. \n \nInnovation leader \nGlobal campaign innovation & localization \nBrand marketing & campaign strategy \nDemand generation programs & lead generation campaigns \nIntegrated marketing programs \nMarketing communications, corporate communications & PR \nPartner Marketing, Co-marketing \nProduct launch \nDigital, SEM, SEO \nEmail, direct marketing \nMarketing automation, sales automation & analytics \n \nStrengthsfinder: Strategic, Learner, Individualisation, Achiever, Intellection Summary Results-oriented marketing leader known for driving change, innovative solutions and creativity in a fast-paced, dynamic environment. Team-oriented with recognized ability and passion for driving collaboration across large, complex, geographically-dispersed and culturally diverse teams. History of developing break-through, integrated marketing campaigns aligned with business strategy that successfully increase brand preference, sales and market share. Global marketing experience and leadership skills spanning 30 countries and 4 continents. \n \nInnovation leader \nGlobal campaign innovation & localization \nBrand marketing & campaign strategy \nDemand generation programs & lead generation campaigns \nIntegrated marketing programs \nMarketing communications, corporate communications & PR \nPartner Marketing, Co-marketing \nProduct launch \nDigital, SEM, SEO \nEmail, direct marketing \nMarketing automation, sales automation & analytics \n \nStrengthsfinder: Strategic, Learner, Individualisation, Achiever, Intellection Results-oriented marketing leader known for driving change, innovative solutions and creativity in a fast-paced, dynamic environment. Team-oriented with recognized ability and passion for driving collaboration across large, complex, geographically-dispersed and culturally diverse teams. History of developing break-through, integrated marketing campaigns aligned with business strategy that successfully increase brand preference, sales and market share. Global marketing experience and leadership skills spanning 30 countries and 4 continents. \n \nInnovation leader \nGlobal campaign innovation & localization \nBrand marketing & campaign strategy \nDemand generation programs & lead generation campaigns \nIntegrated marketing programs \nMarketing communications, corporate communications & PR \nPartner Marketing, Co-marketing \nProduct launch \nDigital, SEM, SEO \nEmail, direct marketing \nMarketing automation, sales automation & analytics \n \nStrengthsfinder: Strategic, Learner, Individualisation, Achiever, Intellection Results-oriented marketing leader known for driving change, innovative solutions and creativity in a fast-paced, dynamic environment. Team-oriented with recognized ability and passion for driving collaboration across large, complex, geographically-dispersed and culturally diverse teams. History of developing break-through, integrated marketing campaigns aligned with business strategy that successfully increase brand preference, sales and market share. Global marketing experience and leadership skills spanning 30 countries and 4 continents. \n \nInnovation leader \nGlobal campaign innovation & localization \nBrand marketing & campaign strategy \nDemand generation programs & lead generation campaigns \nIntegrated marketing programs \nMarketing communications, corporate communications & PR \nPartner Marketing, Co-marketing \nProduct launch \nDigital, SEM, SEO \nEmail, direct marketing \nMarketing automation, sales automation & analytics \n \nStrengthsfinder: Strategic, Learner, Individualisation, Achiever, Intellection Experience Head of Group Marketing Verizon Enterprise September 2012  – Present (3 years) Hong Kong Stephanie manages Verizon Enterprise’s country (field) marketing across Asia-Pacific, spanning Cloud, Security, Intelligent Network and Professional Services solutions. Stephanie is a Verizon Lean Six Sigma-qualified Green Belt driving marketing transformation projects and leads the Verizon Enterprise APAC Innovation Team. President & COO Silver Sun July 2011  –  September 2012  (1 year 3 months) Hong Kong Startup services referral network Retail & Channel Marketing Director Intel Corporation January 2009  –  May 2011  (2 years 5 months) Stephanie managed Intel’s retail and channel marketing team across Asia Pacific covering small retail (resellers, dealers), growing large retail (modern, mass merchants) and emerging retail channels (online, telco). Focused on mobile and desktop platforms, she drove consumer education, sales, sales person advocacy, sku alignment, sales programs and brand, ensuring alignment with global retail, channel marketing and channel membership teams. Consumer Brand Manager Intel Corporation November 2005  –  January 2009  (3 years 3 months) Stephanie managed Intel’s Consumer Brand & Campaigns across Asia Pacific. She drove Intel’s overall brand strategy, campaigns, marketing programs and brand indicators for consumer products and desktop and mobile platforms across more than 18 countries (excl. Japan and PRC). Stephanie also drove Intel’s Youth and Gaming ecosystem segment strategies and programs across Asia Pacific. Asia Pacific PR Group Manager Intel Corporation June 2005  –  November 2005  (6 months) Stephanie managed all public relations activities throughout the Asia Pacific region (excl. Japan). With a team of 8 direct reports and more than 20 matrix reports, she drove the establishment of a corporate reputation management program for the Asia Pacific region with Public Affairs, managed CEO and other corporate executive messaging during visits to the region, and spearheaded Intel's key product and platform launches and market-driving programs across the breadth of its business groups. Regional PR Manager Asia Pacific - Technology platforms, Corporate Communications, Channel Intel Corporation September 2002  –  May 2005  (2 years 9 months) Covered full range of Intel's PR portfolio from Technology platforms (desktop, mobile, notebook, server, internet devices) to corporate communications Global PR Manager - Mobile Intel Corporation July 2004  –  December 2004  (6 months) Santa Clara, CA Formation of worldwide mobile platform PR strategy and facilitating implementation across all Geographies worldwide. Included US PR strategy, global mobility PR direction and implementation of mobile platform launch events, programs and campaigns.  \n \nSuccessfully set and drove MPG PR agenda during Intel Developer Forum Fall (press citing MPG’s news and activities “best” of all IDF) and New York consumer show Digital Life. Conceived and drove global strategy for the (at the time) next generation Centrino platform PR launch and implementation with each Intel geography. Drove new creative approaches/ideas to build brand, product positioning and pique consumer interest in Centrino product (e.g. Centrino used to monitor Mt Etna eruption story, Time Magazine “Coolest Inventions” feature incorporation of Centrino wireless surfboard, Holiday mobility release, 2005 mobility resolutions release, and broadcast stories/pitches, etc.) PR Manager - Australia & New Zealand Intel Corporation March 2000  –  August 2002  (2 years 6 months) PR Director, Technology Group The Rowland Company August 1999  –  April 2000  (9 months) Stephanie managed key accounts in the Technology practice team such as IBM (corporate, software, Global Services, small business, etc.), Optus@Home, Compuware and others. She also led new business generation for The Rowland Company Technology practice. Deputy Project Manager & International Co-ordinator, EU Gateway to Japan Campaign The Rowland Company, Japan November 1997  –  May 1999  (1 year 7 months) Stephanie managed the European Union’s Gateway to Japan campaign, an export promotion program that began in 1994, targeting 10 specific manufacturing sectors.  \n \nThrough the campaign, the European Commission provided active and sustained support of European small and medium-sized manufacturers through a comprehensive set of trade promotion activities designed to assist companies to build a presence and business activities in Japan. \n \nStephanie worked closely with industry groups, trade associations, Chambers of Commerce and other key partners in Europe and Japan to develop Gateway to Japan campaigns and drive programs to achieve the European Union's small and medium business export goals. IT Account Manager & International Client Liaison Edelman Public Relations Worldwide, Japan November 1996  –  July 1997  (9 months) Account Manager Edelman Public Relations Worldwide (Melbourne) April 1994  –  October 1996  (2 years 7 months) Senior Consultant LJA Communications November 1992  –  March 1994  (1 year 5 months) Search Keywords Se 1990  –  1990  (less than a year) Search Keywords advertising analytics automation B2B B2C blog brand building brand management branded entertainment brochures budget cross-functional team leadership collateral design consumer electronics consumer technology consumer segmentation consumer research content strategy corporate ID communications corporate website CRM customer acquisition demand generation digital marketing direct mail e-mail email marketing gaming marketing global marketing director go-to-market GTM strategy high-tech integrated marketing interactive leadership lead generation lifecycle management manuals market position marketing strategy measurement messaging microprocessor mobile technology newsletters online advertising PR presentations press releases pricing print product marketing public relations research retail channel revenue growth sales search bitcoin SEM strategy SEO strategy social media strategic partnerships technology telecommunications travel user testing video production wireless VP Head of Group Marketing Verizon Enterprise September 2012  – Present (3 years) Hong Kong Stephanie manages Verizon Enterprise’s country (field) marketing across Asia-Pacific, spanning Cloud, Security, Intelligent Network and Professional Services solutions. Stephanie is a Verizon Lean Six Sigma-qualified Green Belt driving marketing transformation projects and leads the Verizon Enterprise APAC Innovation Team. Head of Group Marketing Verizon Enterprise September 2012  – Present (3 years) Hong Kong Stephanie manages Verizon Enterprise’s country (field) marketing across Asia-Pacific, spanning Cloud, Security, Intelligent Network and Professional Services solutions. Stephanie is a Verizon Lean Six Sigma-qualified Green Belt driving marketing transformation projects and leads the Verizon Enterprise APAC Innovation Team. President & COO Silver Sun July 2011  –  September 2012  (1 year 3 months) Hong Kong Startup services referral network President & COO Silver Sun July 2011  –  September 2012  (1 year 3 months) Hong Kong Startup services referral network Retail & Channel Marketing Director Intel Corporation January 2009  –  May 2011  (2 years 5 months) Stephanie managed Intel’s retail and channel marketing team across Asia Pacific covering small retail (resellers, dealers), growing large retail (modern, mass merchants) and emerging retail channels (online, telco). Focused on mobile and desktop platforms, she drove consumer education, sales, sales person advocacy, sku alignment, sales programs and brand, ensuring alignment with global retail, channel marketing and channel membership teams. Retail & Channel Marketing Director Intel Corporation January 2009  –  May 2011  (2 years 5 months) Stephanie managed Intel’s retail and channel marketing team across Asia Pacific covering small retail (resellers, dealers), growing large retail (modern, mass merchants) and emerging retail channels (online, telco). Focused on mobile and desktop platforms, she drove consumer education, sales, sales person advocacy, sku alignment, sales programs and brand, ensuring alignment with global retail, channel marketing and channel membership teams. Consumer Brand Manager Intel Corporation November 2005  –  January 2009  (3 years 3 months) Stephanie managed Intel’s Consumer Brand & Campaigns across Asia Pacific. She drove Intel’s overall brand strategy, campaigns, marketing programs and brand indicators for consumer products and desktop and mobile platforms across more than 18 countries (excl. Japan and PRC). Stephanie also drove Intel’s Youth and Gaming ecosystem segment strategies and programs across Asia Pacific. Consumer Brand Manager Intel Corporation November 2005  –  January 2009  (3 years 3 months) Stephanie managed Intel’s Consumer Brand & Campaigns across Asia Pacific. She drove Intel’s overall brand strategy, campaigns, marketing programs and brand indicators for consumer products and desktop and mobile platforms across more than 18 countries (excl. Japan and PRC). Stephanie also drove Intel’s Youth and Gaming ecosystem segment strategies and programs across Asia Pacific. Asia Pacific PR Group Manager Intel Corporation June 2005  –  November 2005  (6 months) Stephanie managed all public relations activities throughout the Asia Pacific region (excl. Japan). With a team of 8 direct reports and more than 20 matrix reports, she drove the establishment of a corporate reputation management program for the Asia Pacific region with Public Affairs, managed CEO and other corporate executive messaging during visits to the region, and spearheaded Intel's key product and platform launches and market-driving programs across the breadth of its business groups. Asia Pacific PR Group Manager Intel Corporation June 2005  –  November 2005  (6 months) Stephanie managed all public relations activities throughout the Asia Pacific region (excl. Japan). With a team of 8 direct reports and more than 20 matrix reports, she drove the establishment of a corporate reputation management program for the Asia Pacific region with Public Affairs, managed CEO and other corporate executive messaging during visits to the region, and spearheaded Intel's key product and platform launches and market-driving programs across the breadth of its business groups. Regional PR Manager Asia Pacific - Technology platforms, Corporate Communications, Channel Intel Corporation September 2002  –  May 2005  (2 years 9 months) Covered full range of Intel's PR portfolio from Technology platforms (desktop, mobile, notebook, server, internet devices) to corporate communications Regional PR Manager Asia Pacific - Technology platforms, Corporate Communications, Channel Intel Corporation September 2002  –  May 2005  (2 years 9 months) Covered full range of Intel's PR portfolio from Technology platforms (desktop, mobile, notebook, server, internet devices) to corporate communications Global PR Manager - Mobile Intel Corporation July 2004  –  December 2004  (6 months) Santa Clara, CA Formation of worldwide mobile platform PR strategy and facilitating implementation across all Geographies worldwide. Included US PR strategy, global mobility PR direction and implementation of mobile platform launch events, programs and campaigns.  \n \nSuccessfully set and drove MPG PR agenda during Intel Developer Forum Fall (press citing MPG’s news and activities “best” of all IDF) and New York consumer show Digital Life. Conceived and drove global strategy for the (at the time) next generation Centrino platform PR launch and implementation with each Intel geography. Drove new creative approaches/ideas to build brand, product positioning and pique consumer interest in Centrino product (e.g. Centrino used to monitor Mt Etna eruption story, Time Magazine “Coolest Inventions” feature incorporation of Centrino wireless surfboard, Holiday mobility release, 2005 mobility resolutions release, and broadcast stories/pitches, etc.) Global PR Manager - Mobile Intel Corporation July 2004  –  December 2004  (6 months) Santa Clara, CA Formation of worldwide mobile platform PR strategy and facilitating implementation across all Geographies worldwide. Included US PR strategy, global mobility PR direction and implementation of mobile platform launch events, programs and campaigns.  \n \nSuccessfully set and drove MPG PR agenda during Intel Developer Forum Fall (press citing MPG’s news and activities “best” of all IDF) and New York consumer show Digital Life. Conceived and drove global strategy for the (at the time) next generation Centrino platform PR launch and implementation with each Intel geography. Drove new creative approaches/ideas to build brand, product positioning and pique consumer interest in Centrino product (e.g. Centrino used to monitor Mt Etna eruption story, Time Magazine “Coolest Inventions” feature incorporation of Centrino wireless surfboard, Holiday mobility release, 2005 mobility resolutions release, and broadcast stories/pitches, etc.) PR Manager - Australia & New Zealand Intel Corporation March 2000  –  August 2002  (2 years 6 months) PR Manager - Australia & New Zealand Intel Corporation March 2000  –  August 2002  (2 years 6 months) PR Director, Technology Group The Rowland Company August 1999  –  April 2000  (9 months) Stephanie managed key accounts in the Technology practice team such as IBM (corporate, software, Global Services, small business, etc.), Optus@Home, Compuware and others. She also led new business generation for The Rowland Company Technology practice. PR Director, Technology Group The Rowland Company August 1999  –  April 2000  (9 months) Stephanie managed key accounts in the Technology practice team such as IBM (corporate, software, Global Services, small business, etc.), Optus@Home, Compuware and others. She also led new business generation for The Rowland Company Technology practice. Deputy Project Manager & International Co-ordinator, EU Gateway to Japan Campaign The Rowland Company, Japan November 1997  –  May 1999  (1 year 7 months) Stephanie managed the European Union’s Gateway to Japan campaign, an export promotion program that began in 1994, targeting 10 specific manufacturing sectors.  \n \nThrough the campaign, the European Commission provided active and sustained support of European small and medium-sized manufacturers through a comprehensive set of trade promotion activities designed to assist companies to build a presence and business activities in Japan. \n \nStephanie worked closely with industry groups, trade associations, Chambers of Commerce and other key partners in Europe and Japan to develop Gateway to Japan campaigns and drive programs to achieve the European Union's small and medium business export goals. Deputy Project Manager & International Co-ordinator, EU Gateway to Japan Campaign The Rowland Company, Japan November 1997  –  May 1999  (1 year 7 months) Stephanie managed the European Union’s Gateway to Japan campaign, an export promotion program that began in 1994, targeting 10 specific manufacturing sectors.  \n \nThrough the campaign, the European Commission provided active and sustained support of European small and medium-sized manufacturers through a comprehensive set of trade promotion activities designed to assist companies to build a presence and business activities in Japan. \n \nStephanie worked closely with industry groups, trade associations, Chambers of Commerce and other key partners in Europe and Japan to develop Gateway to Japan campaigns and drive programs to achieve the European Union's small and medium business export goals. IT Account Manager & International Client Liaison Edelman Public Relations Worldwide, Japan November 1996  –  July 1997  (9 months) IT Account Manager & International Client Liaison Edelman Public Relations Worldwide, Japan November 1996  –  July 1997  (9 months) Account Manager Edelman Public Relations Worldwide (Melbourne) April 1994  –  October 1996  (2 years 7 months) Account Manager Edelman Public Relations Worldwide (Melbourne) April 1994  –  October 1996  (2 years 7 months) Senior Consultant LJA Communications November 1992  –  March 1994  (1 year 5 months) Senior Consultant LJA Communications November 1992  –  March 1994  (1 year 5 months) Search Keywords Se 1990  –  1990  (less than a year) Search Keywords advertising analytics automation B2B B2C blog brand building brand management branded entertainment brochures budget cross-functional team leadership collateral design consumer electronics consumer technology consumer segmentation consumer research content strategy corporate ID communications corporate website CRM customer acquisition demand generation digital marketing direct mail e-mail email marketing gaming marketing global marketing director go-to-market GTM strategy high-tech integrated marketing interactive leadership lead generation lifecycle management manuals market position marketing strategy measurement messaging microprocessor mobile technology newsletters online advertising PR presentations press releases pricing print product marketing public relations research retail channel revenue growth sales search bitcoin SEM strategy SEO strategy social media strategic partnerships technology telecommunications travel user testing video production wireless VP Search Keywords Se 1990  –  1990  (less than a year) Search Keywords advertising analytics automation B2B B2C blog brand building brand management branded entertainment brochures budget cross-functional team leadership collateral design consumer electronics consumer technology consumer segmentation consumer research content strategy corporate ID communications corporate website CRM customer acquisition demand generation digital marketing direct mail e-mail email marketing gaming marketing global marketing director go-to-market GTM strategy high-tech integrated marketing interactive leadership lead generation lifecycle management manuals market position marketing strategy measurement messaging microprocessor mobile technology newsletters online advertising PR presentations press releases pricing print product marketing public relations research retail channel revenue growth sales search bitcoin SEM strategy SEO strategy social media strategic partnerships technology telecommunications travel user testing video production wireless VP Languages Japanese Japanese Japanese Skills Integrated Marketing Strategy Digital Marketing Multi-channel Marketing Marketing Communications Management Lead Generation Brand Management Marketing Strategy Segmentation Strategic Partnerships Corporate Communications Cross-functional Team... Marketing Public Relations Marketing Management Go-to-market Strategy Product Marketing Demand Generation Media Relations Thought Leadership Online Marketing B2B Marketing Leadership Asian Business Interactive Marketing Channel Marketing Analyst Relations Strategy Development International Marketing Corporate Branding Brand Awareness Field Marketing Messaging Brand Development B2B Content Strategy CRM Brand Architecture Customer Acquisition Competitive Analysis Product Launch Digital Strategy Positioning Global Marketing Beaches See 31+     See less Skills  Integrated Marketing Strategy Digital Marketing Multi-channel Marketing Marketing Communications Management Lead Generation Brand Management Marketing Strategy Segmentation Strategic Partnerships Corporate Communications Cross-functional Team... Marketing Public Relations Marketing Management Go-to-market Strategy Product Marketing Demand Generation Media Relations Thought Leadership Online Marketing B2B Marketing Leadership Asian Business Interactive Marketing Channel Marketing Analyst Relations Strategy Development International Marketing Corporate Branding Brand Awareness Field Marketing Messaging Brand Development B2B Content Strategy CRM Brand Architecture Customer Acquisition Competitive Analysis Product Launch Digital Strategy Positioning Global Marketing Beaches See 31+     See less Integrated Marketing Strategy Digital Marketing Multi-channel Marketing Marketing Communications Management Lead Generation Brand Management Marketing Strategy Segmentation Strategic Partnerships Corporate Communications Cross-functional Team... Marketing Public Relations Marketing Management Go-to-market Strategy Product Marketing Demand Generation Media Relations Thought Leadership Online Marketing B2B Marketing Leadership Asian Business Interactive Marketing Channel Marketing Analyst Relations Strategy Development International Marketing Corporate Branding Brand Awareness Field Marketing Messaging Brand Development B2B Content Strategy CRM Brand Architecture Customer Acquisition Competitive Analysis Product Launch Digital Strategy Positioning Global Marketing Beaches See 31+     See less Integrated Marketing Strategy Digital Marketing Multi-channel Marketing Marketing Communications Management Lead Generation Brand Management Marketing Strategy Segmentation Strategic Partnerships Corporate Communications Cross-functional Team... Marketing Public Relations Marketing Management Go-to-market Strategy Product Marketing Demand Generation Media Relations Thought Leadership Online Marketing B2B Marketing Leadership Asian Business Interactive Marketing Channel Marketing Analyst Relations Strategy Development International Marketing Corporate Branding Brand Awareness Field Marketing Messaging Brand Development B2B Content Strategy CRM Brand Architecture Customer Acquisition Competitive Analysis Product Launch Digital Strategy Positioning Global Marketing Beaches See 31+     See less Education Northwestern University - Kellogg School of Management Kellogg-HKUST Executive MBA,  Business 2008  – 2009 No. 1 EMBA program in the world (2008), Wall Street Journal \nNo. 1 EMBA program in the world (2011-2014), Financial Times University of Technology, Sydney Graduate Diploma,  Marketing 2001  – 2002 Royal Melbourne Institute of Technology Bachelor of Arts,  Public Relations 1989  – 1992 Northwestern University - Kellogg School of Management Kellogg-HKUST Executive MBA,  Business 2008  – 2009 No. 1 EMBA program in the world (2008), Wall Street Journal \nNo. 1 EMBA program in the world (2011-2014), Financial Times Northwestern University - Kellogg School of Management Kellogg-HKUST Executive MBA,  Business 2008  – 2009 No. 1 EMBA program in the world (2008), Wall Street Journal \nNo. 1 EMBA program in the world (2011-2014), Financial Times Northwestern University - Kellogg School of Management Kellogg-HKUST Executive MBA,  Business 2008  – 2009 No. 1 EMBA program in the world (2008), Wall Street Journal \nNo. 1 EMBA program in the world (2011-2014), Financial Times University of Technology, Sydney Graduate Diploma,  Marketing 2001  – 2002 University of Technology, Sydney Graduate Diploma,  Marketing 2001  – 2002 University of Technology, Sydney Graduate Diploma,  Marketing 2001  – 2002 Royal Melbourne Institute of Technology Bachelor of Arts,  Public Relations 1989  – 1992 Royal Melbourne Institute of Technology Bachelor of Arts,  Public Relations 1989  – 1992 Royal Melbourne Institute of Technology Bachelor of Arts,  Public Relations 1989  – 1992 Honors & Awards ", "Experience Platform Marketing Director Intel Corporation June 2011  – Present (4 years 3 months) Business Strategy Director Intel August 2009  –  June 2011  (1 year 11 months) Platform Marketing Director Intel Corporation June 2011  – Present (4 years 3 months) Platform Marketing Director Intel Corporation June 2011  – Present (4 years 3 months) Business Strategy Director Intel August 2009  –  June 2011  (1 year 11 months) Business Strategy Director Intel August 2009  –  June 2011  (1 year 11 months) Education Massachusetts Institute of Technology - Sloan School of Management MBA,  Manufacturing Activities and Societies:  Leaders for Manufacturing United States Military Academy at West Point Bachelor's Degree,  Economics / Civil Engineering Massachusetts Institute of Technology - Sloan School of Management MBA,  Manufacturing Activities and Societies:  Leaders for Manufacturing Massachusetts Institute of Technology - Sloan School of Management MBA,  Manufacturing Activities and Societies:  Leaders for Manufacturing Massachusetts Institute of Technology - Sloan School of Management MBA,  Manufacturing Activities and Societies:  Leaders for Manufacturing United States Military Academy at West Point Bachelor's Degree,  Economics / Civil Engineering United States Military Academy at West Point Bachelor's Degree,  Economics / Civil Engineering United States Military Academy at West Point Bachelor's Degree,  Economics / Civil Engineering ", "Experience Marketing director Intel Corporation Marketing director Intel Corporation Marketing director Intel Corporation ", "Skills Marketing Communications Global Marketing Integrated Marketing B2B Marketing Demand Generation Relationship Marketing Channel Marketing Marketing Strategy Marketing Management Product Marketing Competitive Analysis Multi-channel Marketing Go-to-market Strategy Positioning Strategic Partnerships Product Management Strategy Product Launch Email Marketing Interactive Marketing Online Marketing Brand Development Digital Marketing Direct Marketing Marketing Online Advertising Analytics SEM Digital Strategy See 14+     See less Skills  Marketing Communications Global Marketing Integrated Marketing B2B Marketing Demand Generation Relationship Marketing Channel Marketing Marketing Strategy Marketing Management Product Marketing Competitive Analysis Multi-channel Marketing Go-to-market Strategy Positioning Strategic Partnerships Product Management Strategy Product Launch Email Marketing Interactive Marketing Online Marketing Brand Development Digital Marketing Direct Marketing Marketing Online Advertising Analytics SEM Digital Strategy See 14+     See less Marketing Communications Global Marketing Integrated Marketing B2B Marketing Demand Generation Relationship Marketing Channel Marketing Marketing Strategy Marketing Management Product Marketing Competitive Analysis Multi-channel Marketing Go-to-market Strategy Positioning Strategic Partnerships Product Management Strategy Product Launch Email Marketing Interactive Marketing Online Marketing Brand Development Digital Marketing Direct Marketing Marketing Online Advertising Analytics SEM Digital Strategy See 14+     See less Marketing Communications Global Marketing Integrated Marketing B2B Marketing Demand Generation Relationship Marketing Channel Marketing Marketing Strategy Marketing Management Product Marketing Competitive Analysis Multi-channel Marketing Go-to-market Strategy Positioning Strategic Partnerships Product Management Strategy Product Launch Email Marketing Interactive Marketing Online Marketing Brand Development Digital Marketing Direct Marketing Marketing Online Advertising Analytics SEM Digital Strategy See 14+     See less ", "Summary I am a Product Management and Marketing Executive, Engineer and Wharton MBA with an entrepreneurial spirit and a record of success driving new usages and technologies in both small and large companies. I have a wide breadth of product and marketing management experiences including product marketing, product management, brand marketing, channel marketing, business development and sales. I approach business as a strategy developer and an analytical problem solver with a strong results orientation. I also have a history of increasing revenue and profit and as a leader who drives his organization to greater productivity. I have a passion for, and experience in various software & hardware technology initiatives. I have championed, drove requirements, and marketed technologies including touch screens on notebooks, detachable Ultrabooks, wireless streaming media, Personal Area Networks, Smartphones, Websites, and GPS mapping software.  \n \nI have been a judge for Intel's \"Make it Wearable\" competition (makeit.intel.com/people), and a mentor for Nixie, the competition winner. As a mentor, I played an active role guiding teams to refine their product plans, business plans, positioning, messaging, and presentation. CES video below. \n \nMy greatest career accomplishment was driving the notebook market to adopt touch interfaces when Intel and industry conventional wisdom was that it had no end user value proposition and was too expensive. I first drove a research initiative with end users to demonstrate that touch on a notebook is a compelling experience. My team and I evangelized these insights throughout Intel and the PC industry, leading to broad availability of touch based OEM designs at the launch of Microsoft's Windows 8 Operating System. Profiled in PC Magazine in link below.  \n \nMy career is focused on leveraging my experience and leadership in software and hardware to deliver compelling technology solutions to market that help people be more productive and enjoy themselves. Summary I am a Product Management and Marketing Executive, Engineer and Wharton MBA with an entrepreneurial spirit and a record of success driving new usages and technologies in both small and large companies. I have a wide breadth of product and marketing management experiences including product marketing, product management, brand marketing, channel marketing, business development and sales. I approach business as a strategy developer and an analytical problem solver with a strong results orientation. I also have a history of increasing revenue and profit and as a leader who drives his organization to greater productivity. I have a passion for, and experience in various software & hardware technology initiatives. I have championed, drove requirements, and marketed technologies including touch screens on notebooks, detachable Ultrabooks, wireless streaming media, Personal Area Networks, Smartphones, Websites, and GPS mapping software.  \n \nI have been a judge for Intel's \"Make it Wearable\" competition (makeit.intel.com/people), and a mentor for Nixie, the competition winner. As a mentor, I played an active role guiding teams to refine their product plans, business plans, positioning, messaging, and presentation. CES video below. \n \nMy greatest career accomplishment was driving the notebook market to adopt touch interfaces when Intel and industry conventional wisdom was that it had no end user value proposition and was too expensive. I first drove a research initiative with end users to demonstrate that touch on a notebook is a compelling experience. My team and I evangelized these insights throughout Intel and the PC industry, leading to broad availability of touch based OEM designs at the launch of Microsoft's Windows 8 Operating System. Profiled in PC Magazine in link below.  \n \nMy career is focused on leveraging my experience and leadership in software and hardware to deliver compelling technology solutions to market that help people be more productive and enjoy themselves. I am a Product Management and Marketing Executive, Engineer and Wharton MBA with an entrepreneurial spirit and a record of success driving new usages and technologies in both small and large companies. I have a wide breadth of product and marketing management experiences including product marketing, product management, brand marketing, channel marketing, business development and sales. I approach business as a strategy developer and an analytical problem solver with a strong results orientation. I also have a history of increasing revenue and profit and as a leader who drives his organization to greater productivity. I have a passion for, and experience in various software & hardware technology initiatives. I have championed, drove requirements, and marketed technologies including touch screens on notebooks, detachable Ultrabooks, wireless streaming media, Personal Area Networks, Smartphones, Websites, and GPS mapping software.  \n \nI have been a judge for Intel's \"Make it Wearable\" competition (makeit.intel.com/people), and a mentor for Nixie, the competition winner. As a mentor, I played an active role guiding teams to refine their product plans, business plans, positioning, messaging, and presentation. CES video below. \n \nMy greatest career accomplishment was driving the notebook market to adopt touch interfaces when Intel and industry conventional wisdom was that it had no end user value proposition and was too expensive. I first drove a research initiative with end users to demonstrate that touch on a notebook is a compelling experience. My team and I evangelized these insights throughout Intel and the PC industry, leading to broad availability of touch based OEM designs at the launch of Microsoft's Windows 8 Operating System. Profiled in PC Magazine in link below.  \n \nMy career is focused on leveraging my experience and leadership in software and hardware to deliver compelling technology solutions to market that help people be more productive and enjoy themselves. I am a Product Management and Marketing Executive, Engineer and Wharton MBA with an entrepreneurial spirit and a record of success driving new usages and technologies in both small and large companies. I have a wide breadth of product and marketing management experiences including product marketing, product management, brand marketing, channel marketing, business development and sales. I approach business as a strategy developer and an analytical problem solver with a strong results orientation. I also have a history of increasing revenue and profit and as a leader who drives his organization to greater productivity. I have a passion for, and experience in various software & hardware technology initiatives. I have championed, drove requirements, and marketed technologies including touch screens on notebooks, detachable Ultrabooks, wireless streaming media, Personal Area Networks, Smartphones, Websites, and GPS mapping software.  \n \nI have been a judge for Intel's \"Make it Wearable\" competition (makeit.intel.com/people), and a mentor for Nixie, the competition winner. As a mentor, I played an active role guiding teams to refine their product plans, business plans, positioning, messaging, and presentation. CES video below. \n \nMy greatest career accomplishment was driving the notebook market to adopt touch interfaces when Intel and industry conventional wisdom was that it had no end user value proposition and was too expensive. I first drove a research initiative with end users to demonstrate that touch on a notebook is a compelling experience. My team and I evangelized these insights throughout Intel and the PC industry, leading to broad availability of touch based OEM designs at the launch of Microsoft's Windows 8 Operating System. Profiled in PC Magazine in link below.  \n \nMy career is focused on leveraging my experience and leadership in software and hardware to deliver compelling technology solutions to market that help people be more productive and enjoy themselves. Experience Director of Product Management Intel Corporation June 2012  – Present (3 years 3 months) Lead the product management team responsible for ideation, marketing requirements, product definition, and promotion of Intel’s innovative Ultrabook™ designs, as well as Intel’s Software Development Systems. Managed a team of User Experience Designers, User Experience Researchers, Systems and Software Product Marketing Engineers. Intel’s Ultrabook designs are complete ‘2 in 1’ Ultrabooks showcasing innovation in system design, interaction, software, and new usages. They are designed with the intent of OEMs being able to take some parts or the entire designs and software innovations to market. Software Development Systems are sleek Ultrabooks filled with new Intel features, beyond just the CPU. They are made available to software developers’ and Operating System vendors’ months before a CPU is commercially available to the public to help them drive new software and usages. \n \n•\tLaunched Llama Mountain, a detachable 2 in 1 notebook reference design. Extremely thin and light Intel Core CPU based design that is influencing OEM products. \n•\tLaunched Harris Beach, Intel’s Software Development System Ultrabook based on Intel’s Fourth Gen Core Architecture (Haswell). Launched with a stylish, innovative package design as well. Well received by developers, including the review below.  \n \n•\tLaunched North Cape, Intel’s first Detachable ‘2 in 1’ design. Based on Intel’s Fourth Gen Core Architecture (Haswell), this design featured a lid that detached to become a tablet. New features defined by the team included ‘Smart Frame’, the ability to take a tablet that has an edge to edge design for notebook or media watching mode, and then introduce a virtual bezel through software when needed to allow a place for thumbs when in tablet mode. Smart Frame will be available in market from a major OEM in 2014. Great press to date on this design, including the below review at CES. Director of Product Management, PC Client Solutions Division Intel April 2010  –  June 2012  (2 years 3 months) Lead the product management organization for Intel’s virtual OEM, focused on delivering PC innovation based on a user centered design approach. Organization develops complete notebooks, netbooks, tablets, and desktop personal computers whose industrial design, hardware design, and software are sold to OEMs to bring to market. Marketing team is responsible for defining future products based on unmet needs and market opportunities, testing ideas, uses, and user experience with end customers, selling those designs and negotiating with OEMs, and then driving the promotion of the innovative systems with the OEM.  \n \n•\tDrove the notebook market to adopt touch interfaces when Intel and industry conventional wisdom was that it had no end user value proposition and was too expensive. I first drove a research initiative with end users to demonstrate that touch on a notebook is a compelling experience. My team and I evangelized these insights throughout Intel and the PC industry, leading to broad availability of touch based OEM designs at the launch of Microsoft's Windows 8 Operating System. Profiled in PC Magazine, and in greater depth on Intel’s web site. \n•\tLaunched Cove Point, a convertible Ultrabook reference design \n•\tLaunched Acer Iconia, the world’s first dual touch screen notebook \n•\tEstablished new Innovation Process to increase the quality, quantity, and frequency of new product ideas based on the inputs of Industrial Designers, System Architects, and Marketers Director of Notebook Product Marketing Intel Corporation October 2004  –  March 2010  (5 years 6 months) Lead the product marketing organization for developing and launching Intel’s 2008 notebook platform ingredients (all hardware and software). Manage a staff of seven product marketing engineers to understand market needs and competitive environment, set product requirements for engineers, develop SKU strategies, set pricing, analyze/ track ROI, establish product positioning, create marketing strategies, and win designs. Led Intel into new consumer and business software products for notebooks. Director of Smart Phone & Enterprise Brand and Advertising Strategy Intel 2002  –  2004  (2 years) Brand and Advertising Strategy Manager for smart phone/PDA ingredients, and server microprocessors. Extracted the key differentiating and sustaining features and benefits from engineers, drove the development of value propositions, directed the research to test propositions, and measure brand premium, and directed advertising strategies. Launched “Intel® Mobile Media Technology”. Director of Worldwide Consumer Channel Marketing Intel 1998  –  2002  (4 years) Developed strategies, plans and budgets for Intel’s worldwide consumer channels focusing on computer retail chains, online retailers, and ‘white box’ system builders. Managed a $60 million dollar budget and a staff of eight marketing professionals. Developed and managed marketing programs, OEM relationships, messages, training and research contributing to Intel’s US retail PC market share rebound from 43% to 89%, and 20% higher Pentium® 4 processor market share than historical averages. Director of Marketing Personal Travel Technologies 1994  –  1995  (1 year) Lead sales and marketing for start-up GPS mapping software company. Developed initial marketing plan to raise venture capital. Negotiated pricing and promotion with OEMs to bundle software. Director of Product Management Intel Corporation June 2012  – Present (3 years 3 months) Lead the product management team responsible for ideation, marketing requirements, product definition, and promotion of Intel’s innovative Ultrabook™ designs, as well as Intel’s Software Development Systems. Managed a team of User Experience Designers, User Experience Researchers, Systems and Software Product Marketing Engineers. Intel’s Ultrabook designs are complete ‘2 in 1’ Ultrabooks showcasing innovation in system design, interaction, software, and new usages. They are designed with the intent of OEMs being able to take some parts or the entire designs and software innovations to market. Software Development Systems are sleek Ultrabooks filled with new Intel features, beyond just the CPU. They are made available to software developers’ and Operating System vendors’ months before a CPU is commercially available to the public to help them drive new software and usages. \n \n•\tLaunched Llama Mountain, a detachable 2 in 1 notebook reference design. Extremely thin and light Intel Core CPU based design that is influencing OEM products. \n•\tLaunched Harris Beach, Intel’s Software Development System Ultrabook based on Intel’s Fourth Gen Core Architecture (Haswell). Launched with a stylish, innovative package design as well. Well received by developers, including the review below.  \n \n•\tLaunched North Cape, Intel’s first Detachable ‘2 in 1’ design. Based on Intel’s Fourth Gen Core Architecture (Haswell), this design featured a lid that detached to become a tablet. New features defined by the team included ‘Smart Frame’, the ability to take a tablet that has an edge to edge design for notebook or media watching mode, and then introduce a virtual bezel through software when needed to allow a place for thumbs when in tablet mode. Smart Frame will be available in market from a major OEM in 2014. Great press to date on this design, including the below review at CES. Director of Product Management Intel Corporation June 2012  – Present (3 years 3 months) Lead the product management team responsible for ideation, marketing requirements, product definition, and promotion of Intel’s innovative Ultrabook™ designs, as well as Intel’s Software Development Systems. Managed a team of User Experience Designers, User Experience Researchers, Systems and Software Product Marketing Engineers. Intel’s Ultrabook designs are complete ‘2 in 1’ Ultrabooks showcasing innovation in system design, interaction, software, and new usages. They are designed with the intent of OEMs being able to take some parts or the entire designs and software innovations to market. Software Development Systems are sleek Ultrabooks filled with new Intel features, beyond just the CPU. They are made available to software developers’ and Operating System vendors’ months before a CPU is commercially available to the public to help them drive new software and usages. \n \n•\tLaunched Llama Mountain, a detachable 2 in 1 notebook reference design. Extremely thin and light Intel Core CPU based design that is influencing OEM products. \n•\tLaunched Harris Beach, Intel’s Software Development System Ultrabook based on Intel’s Fourth Gen Core Architecture (Haswell). Launched with a stylish, innovative package design as well. Well received by developers, including the review below.  \n \n•\tLaunched North Cape, Intel’s first Detachable ‘2 in 1’ design. Based on Intel’s Fourth Gen Core Architecture (Haswell), this design featured a lid that detached to become a tablet. New features defined by the team included ‘Smart Frame’, the ability to take a tablet that has an edge to edge design for notebook or media watching mode, and then introduce a virtual bezel through software when needed to allow a place for thumbs when in tablet mode. Smart Frame will be available in market from a major OEM in 2014. Great press to date on this design, including the below review at CES. Director of Product Management, PC Client Solutions Division Intel April 2010  –  June 2012  (2 years 3 months) Lead the product management organization for Intel’s virtual OEM, focused on delivering PC innovation based on a user centered design approach. Organization develops complete notebooks, netbooks, tablets, and desktop personal computers whose industrial design, hardware design, and software are sold to OEMs to bring to market. Marketing team is responsible for defining future products based on unmet needs and market opportunities, testing ideas, uses, and user experience with end customers, selling those designs and negotiating with OEMs, and then driving the promotion of the innovative systems with the OEM.  \n \n•\tDrove the notebook market to adopt touch interfaces when Intel and industry conventional wisdom was that it had no end user value proposition and was too expensive. I first drove a research initiative with end users to demonstrate that touch on a notebook is a compelling experience. My team and I evangelized these insights throughout Intel and the PC industry, leading to broad availability of touch based OEM designs at the launch of Microsoft's Windows 8 Operating System. Profiled in PC Magazine, and in greater depth on Intel’s web site. \n•\tLaunched Cove Point, a convertible Ultrabook reference design \n•\tLaunched Acer Iconia, the world’s first dual touch screen notebook \n•\tEstablished new Innovation Process to increase the quality, quantity, and frequency of new product ideas based on the inputs of Industrial Designers, System Architects, and Marketers Director of Product Management, PC Client Solutions Division Intel April 2010  –  June 2012  (2 years 3 months) Lead the product management organization for Intel’s virtual OEM, focused on delivering PC innovation based on a user centered design approach. Organization develops complete notebooks, netbooks, tablets, and desktop personal computers whose industrial design, hardware design, and software are sold to OEMs to bring to market. Marketing team is responsible for defining future products based on unmet needs and market opportunities, testing ideas, uses, and user experience with end customers, selling those designs and negotiating with OEMs, and then driving the promotion of the innovative systems with the OEM.  \n \n•\tDrove the notebook market to adopt touch interfaces when Intel and industry conventional wisdom was that it had no end user value proposition and was too expensive. I first drove a research initiative with end users to demonstrate that touch on a notebook is a compelling experience. My team and I evangelized these insights throughout Intel and the PC industry, leading to broad availability of touch based OEM designs at the launch of Microsoft's Windows 8 Operating System. Profiled in PC Magazine, and in greater depth on Intel’s web site. \n•\tLaunched Cove Point, a convertible Ultrabook reference design \n•\tLaunched Acer Iconia, the world’s first dual touch screen notebook \n•\tEstablished new Innovation Process to increase the quality, quantity, and frequency of new product ideas based on the inputs of Industrial Designers, System Architects, and Marketers Director of Notebook Product Marketing Intel Corporation October 2004  –  March 2010  (5 years 6 months) Lead the product marketing organization for developing and launching Intel’s 2008 notebook platform ingredients (all hardware and software). Manage a staff of seven product marketing engineers to understand market needs and competitive environment, set product requirements for engineers, develop SKU strategies, set pricing, analyze/ track ROI, establish product positioning, create marketing strategies, and win designs. Led Intel into new consumer and business software products for notebooks. Director of Notebook Product Marketing Intel Corporation October 2004  –  March 2010  (5 years 6 months) Lead the product marketing organization for developing and launching Intel’s 2008 notebook platform ingredients (all hardware and software). Manage a staff of seven product marketing engineers to understand market needs and competitive environment, set product requirements for engineers, develop SKU strategies, set pricing, analyze/ track ROI, establish product positioning, create marketing strategies, and win designs. Led Intel into new consumer and business software products for notebooks. Director of Smart Phone & Enterprise Brand and Advertising Strategy Intel 2002  –  2004  (2 years) Brand and Advertising Strategy Manager for smart phone/PDA ingredients, and server microprocessors. Extracted the key differentiating and sustaining features and benefits from engineers, drove the development of value propositions, directed the research to test propositions, and measure brand premium, and directed advertising strategies. Launched “Intel® Mobile Media Technology”. Director of Smart Phone & Enterprise Brand and Advertising Strategy Intel 2002  –  2004  (2 years) Brand and Advertising Strategy Manager for smart phone/PDA ingredients, and server microprocessors. Extracted the key differentiating and sustaining features and benefits from engineers, drove the development of value propositions, directed the research to test propositions, and measure brand premium, and directed advertising strategies. Launched “Intel® Mobile Media Technology”. Director of Worldwide Consumer Channel Marketing Intel 1998  –  2002  (4 years) Developed strategies, plans and budgets for Intel’s worldwide consumer channels focusing on computer retail chains, online retailers, and ‘white box’ system builders. Managed a $60 million dollar budget and a staff of eight marketing professionals. Developed and managed marketing programs, OEM relationships, messages, training and research contributing to Intel’s US retail PC market share rebound from 43% to 89%, and 20% higher Pentium® 4 processor market share than historical averages. Director of Worldwide Consumer Channel Marketing Intel 1998  –  2002  (4 years) Developed strategies, plans and budgets for Intel’s worldwide consumer channels focusing on computer retail chains, online retailers, and ‘white box’ system builders. Managed a $60 million dollar budget and a staff of eight marketing professionals. Developed and managed marketing programs, OEM relationships, messages, training and research contributing to Intel’s US retail PC market share rebound from 43% to 89%, and 20% higher Pentium® 4 processor market share than historical averages. Director of Marketing Personal Travel Technologies 1994  –  1995  (1 year) Lead sales and marketing for start-up GPS mapping software company. Developed initial marketing plan to raise venture capital. Negotiated pricing and promotion with OEMs to bundle software. Director of Marketing Personal Travel Technologies 1994  –  1995  (1 year) Lead sales and marketing for start-up GPS mapping software company. Developed initial marketing plan to raise venture capital. Negotiated pricing and promotion with OEMs to bundle software. Skills Positioning Product Development Pricing Distribution Strategies Customer Management Product Marketing Go-to-market Strategy Product Management Demand Generation Multi-channel Marketing Product Planning Strategic Partnerships Mobile Devices Enterprise Software Marketing Management Start-ups Consumer Electronics Marketing Strategy Strategy Management Competitive Analysis Entrepreneurship Marketing Product Launch Wireless Leadership Business Alliances Market Planning Product Lifecycle... B2B Marketing Cross-functional Team... Messaging Sales Enablement SaaS Selling Global Marketing Semiconductors Technical Marketing User Experience Marketing Automation Partner Management Strategic Alliances Analytics Segmentation See 29+     See less Skills  Positioning Product Development Pricing Distribution Strategies Customer Management Product Marketing Go-to-market Strategy Product Management Demand Generation Multi-channel Marketing Product Planning Strategic Partnerships Mobile Devices Enterprise Software Marketing Management Start-ups Consumer Electronics Marketing Strategy Strategy Management Competitive Analysis Entrepreneurship Marketing Product Launch Wireless Leadership Business Alliances Market Planning Product Lifecycle... B2B Marketing Cross-functional Team... Messaging Sales Enablement SaaS Selling Global Marketing Semiconductors Technical Marketing User Experience Marketing Automation Partner Management Strategic Alliances Analytics Segmentation See 29+     See less Positioning Product Development Pricing Distribution Strategies Customer Management Product Marketing Go-to-market Strategy Product Management Demand Generation Multi-channel Marketing Product Planning Strategic Partnerships Mobile Devices Enterprise Software Marketing Management Start-ups Consumer Electronics Marketing Strategy Strategy Management Competitive Analysis Entrepreneurship Marketing Product Launch Wireless Leadership Business Alliances Market Planning Product Lifecycle... B2B Marketing Cross-functional Team... Messaging Sales Enablement SaaS Selling Global Marketing Semiconductors Technical Marketing User Experience Marketing Automation Partner Management Strategic Alliances Analytics Segmentation See 29+     See less Positioning Product Development Pricing Distribution Strategies Customer Management Product Marketing Go-to-market Strategy Product Management Demand Generation Multi-channel Marketing Product Planning Strategic Partnerships Mobile Devices Enterprise Software Marketing Management Start-ups Consumer Electronics Marketing Strategy Strategy Management Competitive Analysis Entrepreneurship Marketing Product Launch Wireless Leadership Business Alliances Market Planning Product Lifecycle... B2B Marketing Cross-functional Team... Messaging Sales Enablement SaaS Selling Global Marketing Semiconductors Technical Marketing User Experience Marketing Automation Partner Management Strategic Alliances Analytics Segmentation See 29+     See less Education The Wharton School MBA,  Marketing ,  Finance Activities and Societies:  Wharton Olympics ,  Wharton Follies University of Pennsylvania BSE,  Computer Science The Wharton School MBA,  Marketing ,  Finance Activities and Societies:  Wharton Olympics ,  Wharton Follies The Wharton School MBA,  Marketing ,  Finance Activities and Societies:  Wharton Olympics ,  Wharton Follies The Wharton School MBA,  Marketing ,  Finance Activities and Societies:  Wharton Olympics ,  Wharton Follies University of Pennsylvania BSE,  Computer Science University of Pennsylvania BSE,  Computer Science University of Pennsylvania BSE,  Computer Science Honors & Awards Additional Honors & Awards Nominated for Intel Achievement Award Additional Honors & Awards Nominated for Intel Achievement Award Additional Honors & Awards Nominated for Intel Achievement Award Additional Honors & Awards Nominated for Intel Achievement Award ", "Summary Eric is a technology marketing executive with a history of applying tech innovations to emerging business trends that result in breakthrough increases in sales and margins. With the ability to take a concept from ideation to creation and through execution, Eric is able to lead teams of people across companies to generate SCALE. He’s adept at combining classic marketing vehicles with new social and influencing approaches to target key growth audiences including Gen X and millennials. \n \nhttp://erictownsendblog.com/ Summary Eric is a technology marketing executive with a history of applying tech innovations to emerging business trends that result in breakthrough increases in sales and margins. With the ability to take a concept from ideation to creation and through execution, Eric is able to lead teams of people across companies to generate SCALE. He’s adept at combining classic marketing vehicles with new social and influencing approaches to target key growth audiences including Gen X and millennials. \n \nhttp://erictownsendblog.com/ Eric is a technology marketing executive with a history of applying tech innovations to emerging business trends that result in breakthrough increases in sales and margins. With the ability to take a concept from ideation to creation and through execution, Eric is able to lead teams of people across companies to generate SCALE. He’s adept at combining classic marketing vehicles with new social and influencing approaches to target key growth audiences including Gen X and millennials. \n \nhttp://erictownsendblog.com/ Eric is a technology marketing executive with a history of applying tech innovations to emerging business trends that result in breakthrough increases in sales and margins. With the ability to take a concept from ideation to creation and through execution, Eric is able to lead teams of people across companies to generate SCALE. He’s adept at combining classic marketing vehicles with new social and influencing approaches to target key growth audiences including Gen X and millennials. \n \nhttp://erictownsendblog.com/ Experience Americas SMB & MSP Marketing Director Intel Corporation November 2006  – Present (8 years 10 months) Phoenix, Arizona Area - Achieved product sales exceeding $10 million dollars through yearly integrated sales campaigns with key channel partners of Intel-based desktops and notebooks to small and medium business customers. \n- Lead multi-million dollar national advertising campaigns with major PC OEM hardware vendors to small and medium-sized businesses of next-generation computing technology and wireless connectivity solutions. \n- Influential National Spokesperson presenting product value and benefits to OEM partners and to multiple SMB audiences through conventions, Webinars and tradeshows touching over 25,000 channel partners and 70,000 businesses throughout the year. \n- Conceptualized, developed, and launched a national technology innovation program with a cross organization team resulting in over 1000 companies working with Intel on new technology implementations which garnered national coverage in the Wall Street Journal. Volunteer Phoenix Children's Hospital May 2008  – Present (7 years 4 months) Phoenix, Arizona Area Phoenix Children’s Hospital, ranked in U.S. News & World Report’s Best Children’s Hospitals, is Arizona’s only licensed children’s hospital, providing world-class care in more than 40 pediatric specialties to children from throughout the state and region.Every week I walk throughout the hospital and talk with patients & their families. I am very lucky to volunteer with amazing staff at PCH every week. Volunteer Habitat for Humanity International July 2007  – Present (8 years 2 months) US & International I work on various US and International housing projects. I have participated on multiple international build teams in the following countries: Fiji, New Zealand, South Africa, and Trinidad. Americas Embedded Marketing Manager Intel Corporation July 2005  –  November 2006  (1 year 5 months) Phoenix, Arizona Area - Designed and executed innovative marketing strategies, which directly supported incremental silicon sales revenue of $178 million. \n- Launched go-to-market programs to Fortune 500 companies to increase consumption of rugged hand-helds via service provider channel resulting in year-over-year revenue increase of 55% of Intel hand-held silicon. \n- Partnered and led Sales and Marketing program focused around Radio Frequency Identification Device (RFID) Certified Supply Chain resulting in Intel recognized as leader in new emerging market and becoming business partners with Korean Air, CVS, Defense Logistics and Sears. Channel Programs Marketing Manager, Storage Components Division Intel Corporation March 2004  –  July 2005  (1 year 5 months) Phoenix, Arizona Area - Partnered with Arrow and Avnet on various product promotion activities resulting in Intel storage products having high visibility to over 150,000 potential customers annually. \n- Defined and communicated robust product marketing strategies and associated sales campaigns to Intel sales teams, extended sales force channel, and the broad channel for Storage Component Division. \n- Participated and lead keynote presentations at various Intel Channel Conferences, Intel Developer Forums, Embedded Systems Conference, National Instruments Week, Intel Distributor Summit and helped with definition of show messaging & objectives. Customer / Business Analysis, Intel IT Intel Corporation August 2001  –  March 2004  (2 years 8 months) Phoenix, Arizona Area - Influential Chair for SAP Enterprise Buyer Professional worldwide-customer-base that solidified multi-billion dollar business relationships between Intel and 11 Fortune 500 companies including Nike, Whirlpool, and Boeing. \n- Facilitated support for multi-site marketing budget for broad marketing activities including on-site events that touched over 75,000 people. \n- Created and managed three multi-site marketing campaigns & associated communication activities which supported 15 different Intel site deployments. Product Marketing Engineer, Home Products Group Intel Corporation April 2000  –  August 2001  (1 year 5 months) Phoenix, Arizona Area - Collaborated with multiple software and hardware engineering teams on product definition and market requirements related to the successful worldwide introduction of Intel’s Internet Dot.station.  \n- Led multi-functional teams in the development of sales & product collateral including product solution brief, technical product specification white paper, and competitive fighting guides. \n- Trained marketing, sales, and customer service team on new $20 million+ product line and defined key product messages/benefits through a national product training seminar series. Customer Consultant, Materials eBusiness Group Intel Corporation January 1999  –  April 2000  (1 year 4 months) Phoenix, Arizona Area - Developed and implemented an enterprise-wide, global e-Business software system, Ariba, to over 20 sites in North America and worked with management on the rollout of the Ariba system. \n- Spearheaded all communications and marketing plans with site teams for the promotion of eBusiness application across the domestic U.S. which impacted over 35,000 employees. \n- Influenced and guided over 20 Intel corporate suppliers to integrate and transition their current business onto a new global business-to-business solution. Supply Chain Specialist, Motorola SPS Motorola Solutions May 1997  –  December 1998  (1 year 8 months) Phoenix, Arizona Area - Teamed with 4 different business units to implement an enterprise wide electronic commerce solution that resulted in over a billion dollars of cost savings for the company. \n- Worked with various buyers and commodity managers on a multi-national silicon component contract negotiation. \n- Designed and implemented a divisional Intranet website that allowed employees to access different supplier report card information. Americas SMB & MSP Marketing Director Intel Corporation November 2006  – Present (8 years 10 months) Phoenix, Arizona Area - Achieved product sales exceeding $10 million dollars through yearly integrated sales campaigns with key channel partners of Intel-based desktops and notebooks to small and medium business customers. \n- Lead multi-million dollar national advertising campaigns with major PC OEM hardware vendors to small and medium-sized businesses of next-generation computing technology and wireless connectivity solutions. \n- Influential National Spokesperson presenting product value and benefits to OEM partners and to multiple SMB audiences through conventions, Webinars and tradeshows touching over 25,000 channel partners and 70,000 businesses throughout the year. \n- Conceptualized, developed, and launched a national technology innovation program with a cross organization team resulting in over 1000 companies working with Intel on new technology implementations which garnered national coverage in the Wall Street Journal. Americas SMB & MSP Marketing Director Intel Corporation November 2006  – Present (8 years 10 months) Phoenix, Arizona Area - Achieved product sales exceeding $10 million dollars through yearly integrated sales campaigns with key channel partners of Intel-based desktops and notebooks to small and medium business customers. \n- Lead multi-million dollar national advertising campaigns with major PC OEM hardware vendors to small and medium-sized businesses of next-generation computing technology and wireless connectivity solutions. \n- Influential National Spokesperson presenting product value and benefits to OEM partners and to multiple SMB audiences through conventions, Webinars and tradeshows touching over 25,000 channel partners and 70,000 businesses throughout the year. \n- Conceptualized, developed, and launched a national technology innovation program with a cross organization team resulting in over 1000 companies working with Intel on new technology implementations which garnered national coverage in the Wall Street Journal. Volunteer Phoenix Children's Hospital May 2008  – Present (7 years 4 months) Phoenix, Arizona Area Phoenix Children’s Hospital, ranked in U.S. News & World Report’s Best Children’s Hospitals, is Arizona’s only licensed children’s hospital, providing world-class care in more than 40 pediatric specialties to children from throughout the state and region.Every week I walk throughout the hospital and talk with patients & their families. I am very lucky to volunteer with amazing staff at PCH every week. Volunteer Phoenix Children's Hospital May 2008  – Present (7 years 4 months) Phoenix, Arizona Area Phoenix Children’s Hospital, ranked in U.S. News & World Report’s Best Children’s Hospitals, is Arizona’s only licensed children’s hospital, providing world-class care in more than 40 pediatric specialties to children from throughout the state and region.Every week I walk throughout the hospital and talk with patients & their families. I am very lucky to volunteer with amazing staff at PCH every week. Volunteer Habitat for Humanity International July 2007  – Present (8 years 2 months) US & International I work on various US and International housing projects. I have participated on multiple international build teams in the following countries: Fiji, New Zealand, South Africa, and Trinidad. Volunteer Habitat for Humanity International July 2007  – Present (8 years 2 months) US & International I work on various US and International housing projects. I have participated on multiple international build teams in the following countries: Fiji, New Zealand, South Africa, and Trinidad. Americas Embedded Marketing Manager Intel Corporation July 2005  –  November 2006  (1 year 5 months) Phoenix, Arizona Area - Designed and executed innovative marketing strategies, which directly supported incremental silicon sales revenue of $178 million. \n- Launched go-to-market programs to Fortune 500 companies to increase consumption of rugged hand-helds via service provider channel resulting in year-over-year revenue increase of 55% of Intel hand-held silicon. \n- Partnered and led Sales and Marketing program focused around Radio Frequency Identification Device (RFID) Certified Supply Chain resulting in Intel recognized as leader in new emerging market and becoming business partners with Korean Air, CVS, Defense Logistics and Sears. Americas Embedded Marketing Manager Intel Corporation July 2005  –  November 2006  (1 year 5 months) Phoenix, Arizona Area - Designed and executed innovative marketing strategies, which directly supported incremental silicon sales revenue of $178 million. \n- Launched go-to-market programs to Fortune 500 companies to increase consumption of rugged hand-helds via service provider channel resulting in year-over-year revenue increase of 55% of Intel hand-held silicon. \n- Partnered and led Sales and Marketing program focused around Radio Frequency Identification Device (RFID) Certified Supply Chain resulting in Intel recognized as leader in new emerging market and becoming business partners with Korean Air, CVS, Defense Logistics and Sears. Channel Programs Marketing Manager, Storage Components Division Intel Corporation March 2004  –  July 2005  (1 year 5 months) Phoenix, Arizona Area - Partnered with Arrow and Avnet on various product promotion activities resulting in Intel storage products having high visibility to over 150,000 potential customers annually. \n- Defined and communicated robust product marketing strategies and associated sales campaigns to Intel sales teams, extended sales force channel, and the broad channel for Storage Component Division. \n- Participated and lead keynote presentations at various Intel Channel Conferences, Intel Developer Forums, Embedded Systems Conference, National Instruments Week, Intel Distributor Summit and helped with definition of show messaging & objectives. Channel Programs Marketing Manager, Storage Components Division Intel Corporation March 2004  –  July 2005  (1 year 5 months) Phoenix, Arizona Area - Partnered with Arrow and Avnet on various product promotion activities resulting in Intel storage products having high visibility to over 150,000 potential customers annually. \n- Defined and communicated robust product marketing strategies and associated sales campaigns to Intel sales teams, extended sales force channel, and the broad channel for Storage Component Division. \n- Participated and lead keynote presentations at various Intel Channel Conferences, Intel Developer Forums, Embedded Systems Conference, National Instruments Week, Intel Distributor Summit and helped with definition of show messaging & objectives. Customer / Business Analysis, Intel IT Intel Corporation August 2001  –  March 2004  (2 years 8 months) Phoenix, Arizona Area - Influential Chair for SAP Enterprise Buyer Professional worldwide-customer-base that solidified multi-billion dollar business relationships between Intel and 11 Fortune 500 companies including Nike, Whirlpool, and Boeing. \n- Facilitated support for multi-site marketing budget for broad marketing activities including on-site events that touched over 75,000 people. \n- Created and managed three multi-site marketing campaigns & associated communication activities which supported 15 different Intel site deployments. Customer / Business Analysis, Intel IT Intel Corporation August 2001  –  March 2004  (2 years 8 months) Phoenix, Arizona Area - Influential Chair for SAP Enterprise Buyer Professional worldwide-customer-base that solidified multi-billion dollar business relationships between Intel and 11 Fortune 500 companies including Nike, Whirlpool, and Boeing. \n- Facilitated support for multi-site marketing budget for broad marketing activities including on-site events that touched over 75,000 people. \n- Created and managed three multi-site marketing campaigns & associated communication activities which supported 15 different Intel site deployments. Product Marketing Engineer, Home Products Group Intel Corporation April 2000  –  August 2001  (1 year 5 months) Phoenix, Arizona Area - Collaborated with multiple software and hardware engineering teams on product definition and market requirements related to the successful worldwide introduction of Intel’s Internet Dot.station.  \n- Led multi-functional teams in the development of sales & product collateral including product solution brief, technical product specification white paper, and competitive fighting guides. \n- Trained marketing, sales, and customer service team on new $20 million+ product line and defined key product messages/benefits through a national product training seminar series. Product Marketing Engineer, Home Products Group Intel Corporation April 2000  –  August 2001  (1 year 5 months) Phoenix, Arizona Area - Collaborated with multiple software and hardware engineering teams on product definition and market requirements related to the successful worldwide introduction of Intel’s Internet Dot.station.  \n- Led multi-functional teams in the development of sales & product collateral including product solution brief, technical product specification white paper, and competitive fighting guides. \n- Trained marketing, sales, and customer service team on new $20 million+ product line and defined key product messages/benefits through a national product training seminar series. Customer Consultant, Materials eBusiness Group Intel Corporation January 1999  –  April 2000  (1 year 4 months) Phoenix, Arizona Area - Developed and implemented an enterprise-wide, global e-Business software system, Ariba, to over 20 sites in North America and worked with management on the rollout of the Ariba system. \n- Spearheaded all communications and marketing plans with site teams for the promotion of eBusiness application across the domestic U.S. which impacted over 35,000 employees. \n- Influenced and guided over 20 Intel corporate suppliers to integrate and transition their current business onto a new global business-to-business solution. Customer Consultant, Materials eBusiness Group Intel Corporation January 1999  –  April 2000  (1 year 4 months) Phoenix, Arizona Area - Developed and implemented an enterprise-wide, global e-Business software system, Ariba, to over 20 sites in North America and worked with management on the rollout of the Ariba system. \n- Spearheaded all communications and marketing plans with site teams for the promotion of eBusiness application across the domestic U.S. which impacted over 35,000 employees. \n- Influenced and guided over 20 Intel corporate suppliers to integrate and transition their current business onto a new global business-to-business solution. Supply Chain Specialist, Motorola SPS Motorola Solutions May 1997  –  December 1998  (1 year 8 months) Phoenix, Arizona Area - Teamed with 4 different business units to implement an enterprise wide electronic commerce solution that resulted in over a billion dollars of cost savings for the company. \n- Worked with various buyers and commodity managers on a multi-national silicon component contract negotiation. \n- Designed and implemented a divisional Intranet website that allowed employees to access different supplier report card information. Supply Chain Specialist, Motorola SPS Motorola Solutions May 1997  –  December 1998  (1 year 8 months) Phoenix, Arizona Area - Teamed with 4 different business units to implement an enterprise wide electronic commerce solution that resulted in over a billion dollars of cost savings for the company. \n- Worked with various buyers and commodity managers on a multi-national silicon component contract negotiation. \n- Designed and implemented a divisional Intranet website that allowed employees to access different supplier report card information. Skills Public Speaking Marketing Strategy Product Marketing Start-ups Channel Marketing Demand Generation Vendor Management Strategic Partnerships Marketing Research Brand Development Direct Sales Sales Presentations Group Presentations SAP Ariba Idea Generation Campaign Strategy Advertising Social Media Marketing Influencer Marketing New Business Development Business Process... Call Center Development Partner Marketing Public Relations Media Spokesperson Pricing Strategy Negotiation Supply Chain Management Competitive Intelligence Multi-channel Marketing Business Development Product Management Leadership Channel Partners E-commerce Management Marketing Management Product Development B2B Marketing Competitive Analysis Sales Strategy See 29+     See less Skills  Public Speaking Marketing Strategy Product Marketing Start-ups Channel Marketing Demand Generation Vendor Management Strategic Partnerships Marketing Research Brand Development Direct Sales Sales Presentations Group Presentations SAP Ariba Idea Generation Campaign Strategy Advertising Social Media Marketing Influencer Marketing New Business Development Business Process... Call Center Development Partner Marketing Public Relations Media Spokesperson Pricing Strategy Negotiation Supply Chain Management Competitive Intelligence Multi-channel Marketing Business Development Product Management Leadership Channel Partners E-commerce Management Marketing Management Product Development B2B Marketing Competitive Analysis Sales Strategy See 29+     See less Public Speaking Marketing Strategy Product Marketing Start-ups Channel Marketing Demand Generation Vendor Management Strategic Partnerships Marketing Research Brand Development Direct Sales Sales Presentations Group Presentations SAP Ariba Idea Generation Campaign Strategy Advertising Social Media Marketing Influencer Marketing New Business Development Business Process... Call Center Development Partner Marketing Public Relations Media Spokesperson Pricing Strategy Negotiation Supply Chain Management Competitive Intelligence Multi-channel Marketing Business Development Product Management Leadership Channel Partners E-commerce Management Marketing Management Product Development B2B Marketing Competitive Analysis Sales Strategy See 29+     See less Public Speaking Marketing Strategy Product Marketing Start-ups Channel Marketing Demand Generation Vendor Management Strategic Partnerships Marketing Research Brand Development Direct Sales Sales Presentations Group Presentations SAP Ariba Idea Generation Campaign Strategy Advertising Social Media Marketing Influencer Marketing New Business Development Business Process... Call Center Development Partner Marketing Public Relations Media Spokesperson Pricing Strategy Negotiation Supply Chain Management Competitive Intelligence Multi-channel Marketing Business Development Product Management Leadership Channel Partners E-commerce Management Marketing Management Product Development B2B Marketing Competitive Analysis Sales Strategy See 29+     See less Education Arizona State University, W. P. Carey School of Business MBA,  Marketing 2003  – 2005 Arizona State University, Hugh Downs School of Human Communication Bachelor of Science (B.S.),  Interpersonal Communications with an emphasis in Negotiation 1993  – 1998 Minor in Psychology Arizona State University, W. P. Carey School of Business Bachelor of Science,  Product Marketing with an emphasis in Advertising 1993  – 1998 Minor in Sociology Activities and Societies:  Active participant in the Alpha Kappa Psi business fraternity. Arizona State University, W. P. Carey School of Business Bachelor of Science (B.S.),  Supply Chain Management with an Emphasis in Information Systems 1993  – 1998 Arizona State University, W. P. Carey School of Business MBA,  Marketing 2003  – 2005 Arizona State University, W. P. Carey School of Business MBA,  Marketing 2003  – 2005 Arizona State University, W. P. Carey School of Business MBA,  Marketing 2003  – 2005 Arizona State University, Hugh Downs School of Human Communication Bachelor of Science (B.S.),  Interpersonal Communications with an emphasis in Negotiation 1993  – 1998 Minor in Psychology Arizona State University, Hugh Downs School of Human Communication Bachelor of Science (B.S.),  Interpersonal Communications with an emphasis in Negotiation 1993  – 1998 Minor in Psychology Arizona State University, Hugh Downs School of Human Communication Bachelor of Science (B.S.),  Interpersonal Communications with an emphasis in Negotiation 1993  – 1998 Minor in Psychology Arizona State University, W. P. Carey School of Business Bachelor of Science,  Product Marketing with an emphasis in Advertising 1993  – 1998 Minor in Sociology Activities and Societies:  Active participant in the Alpha Kappa Psi business fraternity. Arizona State University, W. P. Carey School of Business Bachelor of Science,  Product Marketing with an emphasis in Advertising 1993  – 1998 Minor in Sociology Activities and Societies:  Active participant in the Alpha Kappa Psi business fraternity. Arizona State University, W. P. Carey School of Business Bachelor of Science,  Product Marketing with an emphasis in Advertising 1993  – 1998 Minor in Sociology Activities and Societies:  Active participant in the Alpha Kappa Psi business fraternity. Arizona State University, W. P. Carey School of Business Bachelor of Science (B.S.),  Supply Chain Management with an Emphasis in Information Systems 1993  – 1998 Arizona State University, W. P. Carey School of Business Bachelor of Science (B.S.),  Supply Chain Management with an Emphasis in Information Systems 1993  – 1998 Arizona State University, W. P. Carey School of Business Bachelor of Science (B.S.),  Supply Chain Management with an Emphasis in Information Systems 1993  – 1998 Honors & Awards MSPmentor 250 Penton Technology Group January 2015 Eric Townsend, North American SMB and MSP Marketing Director at Intel Corporation, was selected for the seventh annual MSPmentor 250 by Penton Technology Group. The global list identifies the world’s leading Managed Services Provider (MSP) executives, entrepreneurs, experts, coaches and community leaders. You can see the entire list at: http://mspmentor.net/mspmentor-250/2014 2013 SMB 150 Influencer Award Small Business Nation and SMB Technology Network March 2013 Eric Townsend, Business Client Marketing Manager for the Americas Group at Intel Corporation, was named to the 2013 SMB 150 Channel Influencers List. Townsend joins a group of esteemed colleagues who were chosen during a two-phase voting process. A community vote accounted for 40% of each nominee's overall rating, with an expert panel's decision contributing the remaining 60% based on thought leader activity in user groups, blog and video authorship and contributing at conferences.  MSPmentor 250 Penton Technology Group January 2015 Eric Townsend, North American SMB and MSP Marketing Director at Intel Corporation, was selected for the seventh annual MSPmentor 250 by Penton Technology Group. The global list identifies the world’s leading Managed Services Provider (MSP) executives, entrepreneurs, experts, coaches and community leaders. You can see the entire list at: http://mspmentor.net/mspmentor-250/2014 MSPmentor 250 Penton Technology Group January 2015 Eric Townsend, North American SMB and MSP Marketing Director at Intel Corporation, was selected for the seventh annual MSPmentor 250 by Penton Technology Group. The global list identifies the world’s leading Managed Services Provider (MSP) executives, entrepreneurs, experts, coaches and community leaders. You can see the entire list at: http://mspmentor.net/mspmentor-250/2014 MSPmentor 250 Penton Technology Group January 2015 Eric Townsend, North American SMB and MSP Marketing Director at Intel Corporation, was selected for the seventh annual MSPmentor 250 by Penton Technology Group. The global list identifies the world’s leading Managed Services Provider (MSP) executives, entrepreneurs, experts, coaches and community leaders. You can see the entire list at: http://mspmentor.net/mspmentor-250/2014 2013 SMB 150 Influencer Award Small Business Nation and SMB Technology Network March 2013 Eric Townsend, Business Client Marketing Manager for the Americas Group at Intel Corporation, was named to the 2013 SMB 150 Channel Influencers List. Townsend joins a group of esteemed colleagues who were chosen during a two-phase voting process. A community vote accounted for 40% of each nominee's overall rating, with an expert panel's decision contributing the remaining 60% based on thought leader activity in user groups, blog and video authorship and contributing at conferences.  2013 SMB 150 Influencer Award Small Business Nation and SMB Technology Network March 2013 Eric Townsend, Business Client Marketing Manager for the Americas Group at Intel Corporation, was named to the 2013 SMB 150 Channel Influencers List. Townsend joins a group of esteemed colleagues who were chosen during a two-phase voting process. A community vote accounted for 40% of each nominee's overall rating, with an expert panel's decision contributing the remaining 60% based on thought leader activity in user groups, blog and video authorship and contributing at conferences.  2013 SMB 150 Influencer Award Small Business Nation and SMB Technology Network March 2013 Eric Townsend, Business Client Marketing Manager for the Americas Group at Intel Corporation, was named to the 2013 SMB 150 Channel Influencers List. Townsend joins a group of esteemed colleagues who were chosen during a two-phase voting process. A community vote accounted for 40% of each nominee's overall rating, with an expert panel's decision contributing the remaining 60% based on thought leader activity in user groups, blog and video authorship and contributing at conferences.  ", "Experience Sales Director, Multinational Customer Intel Corporation April 2012  – Present (3 years 5 months) Munich Sales Director, Multinational Customer Intel Corporation April 2012  – Present (3 years 5 months) Munich Sales Director, Multinational Customer Intel Corporation April 2012  – Present (3 years 5 months) Munich Languages   Skills Semiconductors Go-to-market Strategy Product Marketing Business Alliances Demand Generation Cross-functional Team... Multi-channel Marketing Channel Partner Management Strategic Partnerships Competitive Analysis Consumer Electronics Product Management Marketing Product Lifecycle... Channel Partners See 1+     See less Skills  Semiconductors Go-to-market Strategy Product Marketing Business Alliances Demand Generation Cross-functional Team... Multi-channel Marketing Channel Partner Management Strategic Partnerships Competitive Analysis Consumer Electronics Product Management Marketing Product Lifecycle... Channel Partners See 1+     See less Semiconductors Go-to-market Strategy Product Marketing Business Alliances Demand Generation Cross-functional Team... Multi-channel Marketing Channel Partner Management Strategic Partnerships Competitive Analysis Consumer Electronics Product Management Marketing Product Lifecycle... Channel Partners See 1+     See less Semiconductors Go-to-market Strategy Product Marketing Business Alliances Demand Generation Cross-functional Team... Multi-channel Marketing Channel Partner Management Strategic Partnerships Competitive Analysis Consumer Electronics Product Management Marketing Product Lifecycle... Channel Partners See 1+     See less Education Nottingham University Bachelor of Science (BSc) 1988  – 1992 Lyttelton Manor High School, South Africa 1980  – 1984 Nottingham University Bachelor of Science (BSc) 1988  – 1992 Nottingham University Bachelor of Science (BSc) 1988  – 1992 Nottingham University Bachelor of Science (BSc) 1988  – 1992 Lyttelton Manor High School, South Africa 1980  – 1984 Lyttelton Manor High School, South Africa 1980  – 1984 Lyttelton Manor High School, South Africa 1980  – 1984 ", "Skills Semiconductors Semiconductor Industry ASIC Strategy CMOS CRM VLSI SoC Management Program Management Analog Mixed Signal Technical Marketing IC Electronics EDA Debugging Consumer Electronics Embedded Systems See 4+     See less Skills  Semiconductors Semiconductor Industry ASIC Strategy CMOS CRM VLSI SoC Management Program Management Analog Mixed Signal Technical Marketing IC Electronics EDA Debugging Consumer Electronics Embedded Systems See 4+     See less Semiconductors Semiconductor Industry ASIC Strategy CMOS CRM VLSI SoC Management Program Management Analog Mixed Signal Technical Marketing IC Electronics EDA Debugging Consumer Electronics Embedded Systems See 4+     See less Semiconductors Semiconductor Industry ASIC Strategy CMOS CRM VLSI SoC Management Program Management Analog Mixed Signal Technical Marketing IC Electronics EDA Debugging Consumer Electronics Embedded Systems See 4+     See less "]}