{"position": "Mask Design", "company": "Intel Corporation", "profiles": ["Experience Sr Mask Design Intel Corporation November 2008  – Present (6 years 10 months) Layout Design Manager Cirrus Logic August 2006  –  November 2008  (2 years 4 months) Sr Layout / Layout Manager Sr Layout Designer Xilinx 2000  –  2006  (6 years) Sr Mask Design Intel Corporation November 2008  – Present (6 years 10 months) Sr Mask Design Intel Corporation November 2008  – Present (6 years 10 months) Layout Design Manager Cirrus Logic August 2006  –  November 2008  (2 years 4 months) Sr Layout / Layout Manager Layout Design Manager Cirrus Logic August 2006  –  November 2008  (2 years 4 months) Sr Layout / Layout Manager Sr Layout Designer Xilinx 2000  –  2006  (6 years) Sr Layout Designer Xilinx 2000  –  2006  (6 years) Education Oregon State University BA,  Art 1974  – 1982 Oregon State University BA,  Art 1974  – 1982 Oregon State University BA,  Art 1974  – 1982 Oregon State University BA,  Art 1974  – 1982 ", "Experience Physical Layout/Mask Design Intel Corporation March 2007  – Present (8 years 6 months) Fire Safety Technician Jaya Sarana Enginering Sdn Bhd July 2003  –  November 2003  (5 months) Physical Layout/Mask Design Intel Corporation March 2007  – Present (8 years 6 months) Physical Layout/Mask Design Intel Corporation March 2007  – Present (8 years 6 months) Fire Safety Technician Jaya Sarana Enginering Sdn Bhd July 2003  –  November 2003  (5 months) Fire Safety Technician Jaya Sarana Enginering Sdn Bhd July 2003  –  November 2003  (5 months) Skills Manufacturing Electronics Engineering Lean Manufacturing Product Development Engineering Management Semiconductors Testing IC CMOS Verilog Simulations Management Microsoft Office Debugging Matlab Analog C See 3+     See less Skills  Manufacturing Electronics Engineering Lean Manufacturing Product Development Engineering Management Semiconductors Testing IC CMOS Verilog Simulations Management Microsoft Office Debugging Matlab Analog C See 3+     See less Manufacturing Electronics Engineering Lean Manufacturing Product Development Engineering Management Semiconductors Testing IC CMOS Verilog Simulations Management Microsoft Office Debugging Matlab Analog C See 3+     See less Manufacturing Electronics Engineering Lean Manufacturing Product Development Engineering Management Semiconductors Testing IC CMOS Verilog Simulations Management Microsoft Office Debugging Matlab Analog C See 3+     See less ", "Experience Recovery Audit Contractor, Principle Patient Account Services Optum360 Insight, Formally Dignity Health December 2013  –  February 2015  (1 year 3 months) Sr Patient Account Assistant Dignity Health September 2012  –  December 2013  (1 year 4 months) Enrollment Representative I/Record Management Health Net Federal Services (Tricare) June 2011  –  September 2012  (1 year 4 months) Referral Coordinator /Scheduler/Receptionist Sacramento Family Medical Center April 2009  –  June 2011  (2 years 3 months) Member Service Representative/Member Service Call Center Representative The Golden 1 Credit Union September 2006  –  April 2009  (2 years 8 months) Holds & Close Dept in Account Collections / Customer Service Patrick K. Willis Company, Inc.; American Recovery Services, Inc January 2006  –  August 2006  (8 months) Executive Assistant MicroAssembly Technologies, Inc/ Resonant MicroSystems, Inc April 2005  –  December 2005  (9 months) Customer Experience Officer Office Depot November 2004  –  December 2005  (1 year 2 months) Mask Design Intel Corporation July 2000  –  August 2004  (4 years 2 months) Recovery Audit Contractor, Principle Patient Account Services Optum360 Insight, Formally Dignity Health December 2013  –  February 2015  (1 year 3 months) Recovery Audit Contractor, Principle Patient Account Services Optum360 Insight, Formally Dignity Health December 2013  –  February 2015  (1 year 3 months) Sr Patient Account Assistant Dignity Health September 2012  –  December 2013  (1 year 4 months) Sr Patient Account Assistant Dignity Health September 2012  –  December 2013  (1 year 4 months) Enrollment Representative I/Record Management Health Net Federal Services (Tricare) June 2011  –  September 2012  (1 year 4 months) Enrollment Representative I/Record Management Health Net Federal Services (Tricare) June 2011  –  September 2012  (1 year 4 months) Referral Coordinator /Scheduler/Receptionist Sacramento Family Medical Center April 2009  –  June 2011  (2 years 3 months) Referral Coordinator /Scheduler/Receptionist Sacramento Family Medical Center April 2009  –  June 2011  (2 years 3 months) Member Service Representative/Member Service Call Center Representative The Golden 1 Credit Union September 2006  –  April 2009  (2 years 8 months) Member Service Representative/Member Service Call Center Representative The Golden 1 Credit Union September 2006  –  April 2009  (2 years 8 months) Holds & Close Dept in Account Collections / Customer Service Patrick K. Willis Company, Inc.; American Recovery Services, Inc January 2006  –  August 2006  (8 months) Holds & Close Dept in Account Collections / Customer Service Patrick K. Willis Company, Inc.; American Recovery Services, Inc January 2006  –  August 2006  (8 months) Executive Assistant MicroAssembly Technologies, Inc/ Resonant MicroSystems, Inc April 2005  –  December 2005  (9 months) Executive Assistant MicroAssembly Technologies, Inc/ Resonant MicroSystems, Inc April 2005  –  December 2005  (9 months) Customer Experience Officer Office Depot November 2004  –  December 2005  (1 year 2 months) Customer Experience Officer Office Depot November 2004  –  December 2005  (1 year 2 months) Mask Design Intel Corporation July 2000  –  August 2004  (4 years 2 months) Mask Design Intel Corporation July 2000  –  August 2004  (4 years 2 months) Languages Mien English Mien English Mien English Skills HIPAA Healthcare Information... Hospitals EMR EHR Healthcare Management Revenue Cycle Process Improvement Medicare Financial Reporting Medical Billing Meditech Managed Care Medical Terminology Healthcare Authorization Prior Authorization Organizational Structure Organizational... Records Management Medical Records Research Retail Marketing Collections Handle Confidential... Financial Services Cerner Employee Training Project Management Microsoft Office Commercial Insurance Employment Law Healthcare Information... Organizational Design Receptionist Duties Appointment Scheduling Accounts Payable Accounts Receivable Travel Arrangements Account Reconciliation Contract Negotiation Medicaid Managed Care Customer Service Health Information... Dependable Team Player Self-motivated... Goal-oriented... Medical Compliance Work in A Fast Paced... Organization &... See 35+     See less Skills  HIPAA Healthcare Information... Hospitals EMR EHR Healthcare Management Revenue Cycle Process Improvement Medicare Financial Reporting Medical Billing Meditech Managed Care Medical Terminology Healthcare Authorization Prior Authorization Organizational Structure Organizational... Records Management Medical Records Research Retail Marketing Collections Handle Confidential... Financial Services Cerner Employee Training Project Management Microsoft Office Commercial Insurance Employment Law Healthcare Information... Organizational Design Receptionist Duties Appointment Scheduling Accounts Payable Accounts Receivable Travel Arrangements Account Reconciliation Contract Negotiation Medicaid Managed Care Customer Service Health Information... Dependable Team Player Self-motivated... Goal-oriented... Medical Compliance Work in A Fast Paced... Organization &... See 35+     See less HIPAA Healthcare Information... Hospitals EMR EHR Healthcare Management Revenue Cycle Process Improvement Medicare Financial Reporting Medical Billing Meditech Managed Care Medical Terminology Healthcare Authorization Prior Authorization Organizational Structure Organizational... Records Management Medical Records Research Retail Marketing Collections Handle Confidential... Financial Services Cerner Employee Training Project Management Microsoft Office Commercial Insurance Employment Law Healthcare Information... Organizational Design Receptionist Duties Appointment Scheduling Accounts Payable Accounts Receivable Travel Arrangements Account Reconciliation Contract Negotiation Medicaid Managed Care Customer Service Health Information... Dependable Team Player Self-motivated... Goal-oriented... Medical Compliance Work in A Fast Paced... Organization &... See 35+     See less HIPAA Healthcare Information... Hospitals EMR EHR Healthcare Management Revenue Cycle Process Improvement Medicare Financial Reporting Medical Billing Meditech Managed Care Medical Terminology Healthcare Authorization Prior Authorization Organizational Structure Organizational... Records Management Medical Records Research Retail Marketing Collections Handle Confidential... Financial Services Cerner Employee Training Project Management Microsoft Office Commercial Insurance Employment Law Healthcare Information... Organizational Design Receptionist Duties Appointment Scheduling Accounts Payable Accounts Receivable Travel Arrangements Account Reconciliation Contract Negotiation Medicaid Managed Care Customer Service Health Information... Dependable Team Player Self-motivated... Goal-oriented... Medical Compliance Work in A Fast Paced... Organization &... See 35+     See less Education University of Phoenix Master’s Degree,  Health/Health Care Administration/Management 2012  – 2015 Health care informatics, technology and informatics as it relates to delivery within a health care facility. Concepts of health care informatics, systems life cycle, and data management. The evaluation, acquisition, implementation and day to day operation of information technology systems in support of all administration and clinical functions within the health care industry. Focus on the costly mistakes made by some health care organizations whilst implementing electronic medical records. University of Phoenix Bachelor of Science Public Administration,  Public Administration 2009  – 2011 Theory and practical application, of the areas of accounting, critical thinking and decision-making, finance, business law, management, marketing, organizational behavior, research and evaluation, and technology. Demonstrate a comprehensive understanding of the business practice. Focuses on the efficient and effective utilization of public resources to achieve the public purpose within a dynamic environment. Emphasizes the foundations of public administration, public policy formulation, program development, implementation and valuation, human resources and labor relations, and public finance. Develop powerful leadership skills enabling them to successfully manage complex public programs. California State University Sacramento Pre-Engineering: Electrical Electronic Engineering & Pre-Business:Finance /Marketing 2001  – 2007 Sacramento City College General Courses in Electronics 1998  – 2001 University of Phoenix Master’s Degree,  Health/Health Care Administration/Management 2012  – 2015 Health care informatics, technology and informatics as it relates to delivery within a health care facility. Concepts of health care informatics, systems life cycle, and data management. The evaluation, acquisition, implementation and day to day operation of information technology systems in support of all administration and clinical functions within the health care industry. Focus on the costly mistakes made by some health care organizations whilst implementing electronic medical records. University of Phoenix Master’s Degree,  Health/Health Care Administration/Management 2012  – 2015 Health care informatics, technology and informatics as it relates to delivery within a health care facility. Concepts of health care informatics, systems life cycle, and data management. The evaluation, acquisition, implementation and day to day operation of information technology systems in support of all administration and clinical functions within the health care industry. Focus on the costly mistakes made by some health care organizations whilst implementing electronic medical records. University of Phoenix Master’s Degree,  Health/Health Care Administration/Management 2012  – 2015 Health care informatics, technology and informatics as it relates to delivery within a health care facility. Concepts of health care informatics, systems life cycle, and data management. The evaluation, acquisition, implementation and day to day operation of information technology systems in support of all administration and clinical functions within the health care industry. Focus on the costly mistakes made by some health care organizations whilst implementing electronic medical records. University of Phoenix Bachelor of Science Public Administration,  Public Administration 2009  – 2011 Theory and practical application, of the areas of accounting, critical thinking and decision-making, finance, business law, management, marketing, organizational behavior, research and evaluation, and technology. Demonstrate a comprehensive understanding of the business practice. Focuses on the efficient and effective utilization of public resources to achieve the public purpose within a dynamic environment. Emphasizes the foundations of public administration, public policy formulation, program development, implementation and valuation, human resources and labor relations, and public finance. Develop powerful leadership skills enabling them to successfully manage complex public programs. University of Phoenix Bachelor of Science Public Administration,  Public Administration 2009  – 2011 Theory and practical application, of the areas of accounting, critical thinking and decision-making, finance, business law, management, marketing, organizational behavior, research and evaluation, and technology. Demonstrate a comprehensive understanding of the business practice. Focuses on the efficient and effective utilization of public resources to achieve the public purpose within a dynamic environment. Emphasizes the foundations of public administration, public policy formulation, program development, implementation and valuation, human resources and labor relations, and public finance. Develop powerful leadership skills enabling them to successfully manage complex public programs. University of Phoenix Bachelor of Science Public Administration,  Public Administration 2009  – 2011 Theory and practical application, of the areas of accounting, critical thinking and decision-making, finance, business law, management, marketing, organizational behavior, research and evaluation, and technology. Demonstrate a comprehensive understanding of the business practice. Focuses on the efficient and effective utilization of public resources to achieve the public purpose within a dynamic environment. Emphasizes the foundations of public administration, public policy formulation, program development, implementation and valuation, human resources and labor relations, and public finance. Develop powerful leadership skills enabling them to successfully manage complex public programs. California State University Sacramento Pre-Engineering: Electrical Electronic Engineering & Pre-Business:Finance /Marketing 2001  – 2007 California State University Sacramento Pre-Engineering: Electrical Electronic Engineering & Pre-Business:Finance /Marketing 2001  – 2007 California State University Sacramento Pre-Engineering: Electrical Electronic Engineering & Pre-Business:Finance /Marketing 2001  – 2007 Sacramento City College General Courses in Electronics 1998  – 2001 Sacramento City College General Courses in Electronics 1998  – 2001 Sacramento City College General Courses in Electronics 1998  – 2001 ", "Experience Mask Design Intel Corporation January 2006  – Present (9 years 8 months) Fort Collins, Colorado Area Mask Design Intel Corporation January 2006  – Present (9 years 8 months) Fort Collins, Colorado Area Mask Design Intel Corporation January 2006  – Present (9 years 8 months) Fort Collins, Colorado Area Skills Semiconductors IC EDA VLSI ASIC Debugging Skills  Semiconductors IC EDA VLSI ASIC Debugging Semiconductors IC EDA VLSI ASIC Debugging Semiconductors IC EDA VLSI ASIC Debugging ", "Experience Mask Design Intel Corporation May 1995  – Present (20 years 4 months) Santa Clara Layout engineer Trident Microsystems July 1993  –  January 1995  (1 year 7 months) Mask Design Intel Corporation May 1995  – Present (20 years 4 months) Santa Clara Mask Design Intel Corporation May 1995  – Present (20 years 4 months) Santa Clara Layout engineer Trident Microsystems July 1993  –  January 1995  (1 year 7 months) Layout engineer Trident Microsystems July 1993  –  January 1995  (1 year 7 months) Skills CMOS IC Semiconductors Mixed Signal ASIC Physical Design Analog VLSI Analog Circuit Design Debugging Perl Skills  CMOS IC Semiconductors Mixed Signal ASIC Physical Design Analog VLSI Analog Circuit Design Debugging Perl CMOS IC Semiconductors Mixed Signal ASIC Physical Design Analog VLSI Analog Circuit Design Debugging Perl CMOS IC Semiconductors Mixed Signal ASIC Physical Design Analog VLSI Analog Circuit Design Debugging Perl Education UTEP Master of Science (M.S.),  Physics 1990  – 1992 Fudan University B.S,  Semiconductor 1978  – 1982 UTEP Master of Science (M.S.),  Physics 1990  – 1992 UTEP Master of Science (M.S.),  Physics 1990  – 1992 UTEP Master of Science (M.S.),  Physics 1990  – 1992 Fudan University B.S,  Semiconductor 1978  – 1982 Fudan University B.S,  Semiconductor 1978  – 1982 Fudan University B.S,  Semiconductor 1978  – 1982 ", "Experience mask design Intel Corporation 1995  –  2014  (19 years) mask design Intel Corporation 1995  –  2014  (19 years) mask design Intel Corporation 1995  –  2014  (19 years) ", "Experience Integrated Circuit Physical Design Engineer Intel Corporation April 2015  – Present (5 months) Engineering Support RF/Analog group Qualcomm August 2012  – Present (3 years 1 month) Greater San Diego Area Designed 4 transmitter/ 2 reciever, Low/High power mode switch. Used cadence 5.10.41.500.6.143 Design environment. Verified LVS, DRC, Antenna using Calibre. Assembled one level down from top. RF Physical Design Engineer Intel Corporation December 2011  –  May 2012  (6 months) Santa Clara Mask Design Qualcomm Corporate Research and Development June 2010  –  February 2012  (1 year 9 months) New products design. Used Cadence Virtuoso Design tool. Used Mentor Graphics Calibre to verify. Mask Design Qualcomm RFIC Group June 2008  –  May 2010  (2 years) May 2010 Marimba, Standalone, Kepler and 28nm Test Chip projects. Used CSR (Cadence \nSpace Router) for non critical nets.  \n \nUsed Cadence VirtuosoVXL with TSMC 65 and TSMC 45 processes to design PLL, SVideo, USB, ComboDac, Balun, Bias, Peak Detector, Opamp and RF Mixer layout. \nAlso designed layout for Test Chip to evaluate new 28nm TSMC process. Used Calibre to verify layout. Mask Design Inphi Corp July 2007  –  March 2008  (9 months) 3.2 Ghz Memory  \nMarch 2008 Extension  \nUsed Cadence Virtuoso to design a PLL block. Layout designed includes an assortment  \nof circuitry such as comparators, current switches, phase loop filters, charge pumps,  \nVoltage controlled oscillators, programmable frequency dividers and current mirrors.  \nVerified DRC, LVS using Assura and Calibre. Extracted RC data using Assura. Mask Design Aelurous Corp October 2006  –  December 2006  (3 months) Network Chip \nDec 2006 Used Cadence Virtuoso to design CMOS mixed signal layout and integrate dividers into \nFrequency Synthesizer layout. Also did top level assembly and routed control signals.  \nVerified DRC, LVS, ERC, ANT and DFM using Calibre. Feb. 2006 Mask Design Intel February 2006  –  September 2006  (8 months) Crandle  \nSept. 2006 Project \nUsed Genesys and Virtuoso design tools. Created CMOS Analog Standard Cell Library  \nwith techniques such as Interdigitation, Common Centroid and Dummification. \nUsed PDS / Hercules for verification to 45nm process. Mask Design Sun Microsystems July 2005  –  December 2005  (6 months) Rock Project \nDec. 2005 Custom layout Design of the Store Index-Way queue (register file). Implemented 3  \ndifferent types of memory cells, the most complex having 1 write, 2 read and 2 cam ports \nUsed Cadence Virtuoso and Calibre to design and verify to TI (Texas Instruments) \n65nm process. Verified flows included LVS, DRC, ERC, ANT, DENSITY and DFM. April 2005 Mask Design Virage Logic April 2005  –  June 2005  (3 months) June 2005 Custom layout design of the Row Decoder Block for Non Volatile, Erasable RFID  \n(Radio Frequency Identification). Circuitry consisted of noise sensitive signals, with  \ndigital and analog components. Used Cadence Virtuoso and Calibre to design and \nverify to Tower and TSMC 60nm CMOS processes. Jan. 2005 Mask Design Sun Microsystems January 2005  –  April 2005  (4 months) Rock Project \nApril 2005\tContributed to the re-design of the full chip Clock grid using Cadence Virtuoso.  \nVerified same CMOS layout using ASSURA and Mentor Graphics Calibre. April 2004 Mask Design Intel Corporation April 2004  –  September 2004  (6 months) Yonah Project \nSept. 2004\tUsed Genesys Tool to create layout for Out of Order, Memory and Execution \nClusters. Mask Design Sun Microsystems February 2003  –  November 2003  (10 months) Panther Project Megacell design group. Designed megacells for 64 - Bit Microprocessor using Cadence Virtuoso. Verified megacells with Mentor Graphics Calibre. Mask Design Intel July 2001  –  February 2002  (8 months) Cache Memory group. Designed control circuitry using DLS (opus) tool. Mask Design HAL Computer Systems August 2000  –  May 2001  (10 months) Mask Designer Intel May 1997  –  August 2000  (3 years 4 months) Merced Project \nAugust 2000\tCreated 64-Bit Microprocessor chip layout for the floating point unit. Also maintained the floor plan for 33% of the Floating Point Unit. Mask Designer Intel August 1995  –  May 1997  (1 year 10 months) Mask Designer Intel April 1994  –  August 1995  (1 year 5 months) P6 Project \nAugust 1995\tDesigned and troubleshot blocks in the Out of Order Unit. \nVerified LVS, DRC and ERC using the Hercules toolset. Test Floor Systems Tech Intel June 1991  –  March 1994  (2 years 10 months) Systems Technician Schlumberger Technologies ATE (San Jose) 1980  –  1989  (9 years) Integrated Circuit Physical Design Engineer Intel Corporation April 2015  – Present (5 months) Integrated Circuit Physical Design Engineer Intel Corporation April 2015  – Present (5 months) Engineering Support RF/Analog group Qualcomm August 2012  – Present (3 years 1 month) Greater San Diego Area Designed 4 transmitter/ 2 reciever, Low/High power mode switch. Used cadence 5.10.41.500.6.143 Design environment. Verified LVS, DRC, Antenna using Calibre. Assembled one level down from top. Engineering Support RF/Analog group Qualcomm August 2012  – Present (3 years 1 month) Greater San Diego Area Designed 4 transmitter/ 2 reciever, Low/High power mode switch. Used cadence 5.10.41.500.6.143 Design environment. Verified LVS, DRC, Antenna using Calibre. Assembled one level down from top. RF Physical Design Engineer Intel Corporation December 2011  –  May 2012  (6 months) Santa Clara RF Physical Design Engineer Intel Corporation December 2011  –  May 2012  (6 months) Santa Clara Mask Design Qualcomm Corporate Research and Development June 2010  –  February 2012  (1 year 9 months) New products design. Used Cadence Virtuoso Design tool. Used Mentor Graphics Calibre to verify. Mask Design Qualcomm Corporate Research and Development June 2010  –  February 2012  (1 year 9 months) New products design. Used Cadence Virtuoso Design tool. Used Mentor Graphics Calibre to verify. Mask Design Qualcomm RFIC Group June 2008  –  May 2010  (2 years) May 2010 Marimba, Standalone, Kepler and 28nm Test Chip projects. Used CSR (Cadence \nSpace Router) for non critical nets.  \n \nUsed Cadence VirtuosoVXL with TSMC 65 and TSMC 45 processes to design PLL, SVideo, USB, ComboDac, Balun, Bias, Peak Detector, Opamp and RF Mixer layout. \nAlso designed layout for Test Chip to evaluate new 28nm TSMC process. Used Calibre to verify layout. Mask Design Qualcomm RFIC Group June 2008  –  May 2010  (2 years) May 2010 Marimba, Standalone, Kepler and 28nm Test Chip projects. Used CSR (Cadence \nSpace Router) for non critical nets.  \n \nUsed Cadence VirtuosoVXL with TSMC 65 and TSMC 45 processes to design PLL, SVideo, USB, ComboDac, Balun, Bias, Peak Detector, Opamp and RF Mixer layout. \nAlso designed layout for Test Chip to evaluate new 28nm TSMC process. Used Calibre to verify layout. Mask Design Inphi Corp July 2007  –  March 2008  (9 months) 3.2 Ghz Memory  \nMarch 2008 Extension  \nUsed Cadence Virtuoso to design a PLL block. Layout designed includes an assortment  \nof circuitry such as comparators, current switches, phase loop filters, charge pumps,  \nVoltage controlled oscillators, programmable frequency dividers and current mirrors.  \nVerified DRC, LVS using Assura and Calibre. Extracted RC data using Assura. Mask Design Inphi Corp July 2007  –  March 2008  (9 months) 3.2 Ghz Memory  \nMarch 2008 Extension  \nUsed Cadence Virtuoso to design a PLL block. Layout designed includes an assortment  \nof circuitry such as comparators, current switches, phase loop filters, charge pumps,  \nVoltage controlled oscillators, programmable frequency dividers and current mirrors.  \nVerified DRC, LVS using Assura and Calibre. Extracted RC data using Assura. Mask Design Aelurous Corp October 2006  –  December 2006  (3 months) Network Chip \nDec 2006 Used Cadence Virtuoso to design CMOS mixed signal layout and integrate dividers into \nFrequency Synthesizer layout. Also did top level assembly and routed control signals.  \nVerified DRC, LVS, ERC, ANT and DFM using Calibre. Mask Design Aelurous Corp October 2006  –  December 2006  (3 months) Network Chip \nDec 2006 Used Cadence Virtuoso to design CMOS mixed signal layout and integrate dividers into \nFrequency Synthesizer layout. Also did top level assembly and routed control signals.  \nVerified DRC, LVS, ERC, ANT and DFM using Calibre. Feb. 2006 Mask Design Intel February 2006  –  September 2006  (8 months) Crandle  \nSept. 2006 Project \nUsed Genesys and Virtuoso design tools. Created CMOS Analog Standard Cell Library  \nwith techniques such as Interdigitation, Common Centroid and Dummification. \nUsed PDS / Hercules for verification to 45nm process. Feb. 2006 Mask Design Intel February 2006  –  September 2006  (8 months) Crandle  \nSept. 2006 Project \nUsed Genesys and Virtuoso design tools. Created CMOS Analog Standard Cell Library  \nwith techniques such as Interdigitation, Common Centroid and Dummification. \nUsed PDS / Hercules for verification to 45nm process. Mask Design Sun Microsystems July 2005  –  December 2005  (6 months) Rock Project \nDec. 2005 Custom layout Design of the Store Index-Way queue (register file). Implemented 3  \ndifferent types of memory cells, the most complex having 1 write, 2 read and 2 cam ports \nUsed Cadence Virtuoso and Calibre to design and verify to TI (Texas Instruments) \n65nm process. Verified flows included LVS, DRC, ERC, ANT, DENSITY and DFM. Mask Design Sun Microsystems July 2005  –  December 2005  (6 months) Rock Project \nDec. 2005 Custom layout Design of the Store Index-Way queue (register file). Implemented 3  \ndifferent types of memory cells, the most complex having 1 write, 2 read and 2 cam ports \nUsed Cadence Virtuoso and Calibre to design and verify to TI (Texas Instruments) \n65nm process. Verified flows included LVS, DRC, ERC, ANT, DENSITY and DFM. April 2005 Mask Design Virage Logic April 2005  –  June 2005  (3 months) June 2005 Custom layout design of the Row Decoder Block for Non Volatile, Erasable RFID  \n(Radio Frequency Identification). Circuitry consisted of noise sensitive signals, with  \ndigital and analog components. Used Cadence Virtuoso and Calibre to design and \nverify to Tower and TSMC 60nm CMOS processes. April 2005 Mask Design Virage Logic April 2005  –  June 2005  (3 months) June 2005 Custom layout design of the Row Decoder Block for Non Volatile, Erasable RFID  \n(Radio Frequency Identification). Circuitry consisted of noise sensitive signals, with  \ndigital and analog components. Used Cadence Virtuoso and Calibre to design and \nverify to Tower and TSMC 60nm CMOS processes. Jan. 2005 Mask Design Sun Microsystems January 2005  –  April 2005  (4 months) Rock Project \nApril 2005\tContributed to the re-design of the full chip Clock grid using Cadence Virtuoso.  \nVerified same CMOS layout using ASSURA and Mentor Graphics Calibre. Jan. 2005 Mask Design Sun Microsystems January 2005  –  April 2005  (4 months) Rock Project \nApril 2005\tContributed to the re-design of the full chip Clock grid using Cadence Virtuoso.  \nVerified same CMOS layout using ASSURA and Mentor Graphics Calibre. April 2004 Mask Design Intel Corporation April 2004  –  September 2004  (6 months) Yonah Project \nSept. 2004\tUsed Genesys Tool to create layout for Out of Order, Memory and Execution \nClusters. April 2004 Mask Design Intel Corporation April 2004  –  September 2004  (6 months) Yonah Project \nSept. 2004\tUsed Genesys Tool to create layout for Out of Order, Memory and Execution \nClusters. Mask Design Sun Microsystems February 2003  –  November 2003  (10 months) Panther Project Megacell design group. Designed megacells for 64 - Bit Microprocessor using Cadence Virtuoso. Verified megacells with Mentor Graphics Calibre. Mask Design Sun Microsystems February 2003  –  November 2003  (10 months) Panther Project Megacell design group. Designed megacells for 64 - Bit Microprocessor using Cadence Virtuoso. Verified megacells with Mentor Graphics Calibre. Mask Design Intel July 2001  –  February 2002  (8 months) Cache Memory group. Designed control circuitry using DLS (opus) tool. Mask Design Intel July 2001  –  February 2002  (8 months) Cache Memory group. Designed control circuitry using DLS (opus) tool. Mask Design HAL Computer Systems August 2000  –  May 2001  (10 months) Mask Design HAL Computer Systems August 2000  –  May 2001  (10 months) Mask Designer Intel May 1997  –  August 2000  (3 years 4 months) Merced Project \nAugust 2000\tCreated 64-Bit Microprocessor chip layout for the floating point unit. Also maintained the floor plan for 33% of the Floating Point Unit. Mask Designer Intel May 1997  –  August 2000  (3 years 4 months) Merced Project \nAugust 2000\tCreated 64-Bit Microprocessor chip layout for the floating point unit. Also maintained the floor plan for 33% of the Floating Point Unit. Mask Designer Intel August 1995  –  May 1997  (1 year 10 months) Mask Designer Intel August 1995  –  May 1997  (1 year 10 months) Mask Designer Intel April 1994  –  August 1995  (1 year 5 months) P6 Project \nAugust 1995\tDesigned and troubleshot blocks in the Out of Order Unit. \nVerified LVS, DRC and ERC using the Hercules toolset. Mask Designer Intel April 1994  –  August 1995  (1 year 5 months) P6 Project \nAugust 1995\tDesigned and troubleshot blocks in the Out of Order Unit. \nVerified LVS, DRC and ERC using the Hercules toolset. Test Floor Systems Tech Intel June 1991  –  March 1994  (2 years 10 months) Test Floor Systems Tech Intel June 1991  –  March 1994  (2 years 10 months) Systems Technician Schlumberger Technologies ATE (San Jose) 1980  –  1989  (9 years) Systems Technician Schlumberger Technologies ATE (San Jose) 1980  –  1989  (9 years) Skills RF PLL Cadence Virtuoso DRC LVS CMOS Physical Verification Hercules Physical Design Mixed Signal Analog Microprocessors Testing Cadence Virtuoso IC See 1+     See less Skills  RF PLL Cadence Virtuoso DRC LVS CMOS Physical Verification Hercules Physical Design Mixed Signal Analog Microprocessors Testing Cadence Virtuoso IC See 1+     See less RF PLL Cadence Virtuoso DRC LVS CMOS Physical Verification Hercules Physical Design Mixed Signal Analog Microprocessors Testing Cadence Virtuoso IC See 1+     See less RF PLL Cadence Virtuoso DRC LVS CMOS Physical Verification Hercules Physical Design Mixed Signal Analog Microprocessors Testing Cadence Virtuoso IC See 1+     See less Education San Jose City College 1993 Columbus State Community College Associates Degree,  Electronics Engineering Technology San Jose City College 1993 San Jose City College 1993 San Jose City College 1993 Columbus State Community College Associates Degree,  Electronics Engineering Technology Columbus State Community College Associates Degree,  Electronics Engineering Technology Columbus State Community College Associates Degree,  Electronics Engineering Technology ", "Experience Mask design Intel Corporation June 2000  – Present (15 years 3 months) Mask design Intel Corporation June 2000  – Present (15 years 3 months) Mask design Intel Corporation June 2000  – Present (15 years 3 months) Skills IC Semiconductors ASIC CMOS Physical Design LVS DRC Floorplanning Analog Circuit Design Mixed Signal Cadence Virtuoso Layout Mask Design Fullchip Integration Physical Verification Microprocessors Low-power Design Integrated Circuit... PLL Circuit Design Cadence Virtuoso Cadence Analog Virtuoso TCL Hercules Debugging Place  Formal Verification EDA Intel BiCMOS Verilog Power Management Logic Design Static Timing Analysis Timing Closure Primetime DFT SERDES RTL design RTL coding VLSI Synopsys tools Signal Integrity Silicon SystemVerilog SPICE Functional Verification NCSim Logic Synthesis See 35+     See less Skills  IC Semiconductors ASIC CMOS Physical Design LVS DRC Floorplanning Analog Circuit Design Mixed Signal Cadence Virtuoso Layout Mask Design Fullchip Integration Physical Verification Microprocessors Low-power Design Integrated Circuit... PLL Circuit Design Cadence Virtuoso Cadence Analog Virtuoso TCL Hercules Debugging Place  Formal Verification EDA Intel BiCMOS Verilog Power Management Logic Design Static Timing Analysis Timing Closure Primetime DFT SERDES RTL design RTL coding VLSI Synopsys tools Signal Integrity Silicon SystemVerilog SPICE Functional Verification NCSim Logic Synthesis See 35+     See less IC Semiconductors ASIC CMOS Physical Design LVS DRC Floorplanning Analog Circuit Design Mixed Signal Cadence Virtuoso Layout Mask Design Fullchip Integration Physical Verification Microprocessors Low-power Design Integrated Circuit... PLL Circuit Design Cadence Virtuoso Cadence Analog Virtuoso TCL Hercules Debugging Place  Formal Verification EDA Intel BiCMOS Verilog Power Management Logic Design Static Timing Analysis Timing Closure Primetime DFT SERDES RTL design RTL coding VLSI Synopsys tools Signal Integrity Silicon SystemVerilog SPICE Functional Verification NCSim Logic Synthesis See 35+     See less IC Semiconductors ASIC CMOS Physical Design LVS DRC Floorplanning Analog Circuit Design Mixed Signal Cadence Virtuoso Layout Mask Design Fullchip Integration Physical Verification Microprocessors Low-power Design Integrated Circuit... PLL Circuit Design Cadence Virtuoso Cadence Analog Virtuoso TCL Hercules Debugging Place  Formal Verification EDA Intel BiCMOS Verilog Power Management Logic Design Static Timing Analysis Timing Closure Primetime DFT SERDES RTL design RTL coding VLSI Synopsys tools Signal Integrity Silicon SystemVerilog SPICE Functional Verification NCSim Logic Synthesis See 35+     See less Education University of Alabama at Birmingham Civil Engineering Utah State University Engineering University of Alabama at Birmingham Civil Engineering University of Alabama at Birmingham Civil Engineering University of Alabama at Birmingham Civil Engineering Utah State University Engineering Utah State University Engineering Utah State University Engineering ", "Experience Physical/Mask Design Intel Corporation June 1995  – Present (20 years 3 months) Integrated Circuit Mask Designer - Job responsibilities include the layout of schematic devices using in house tools such as Genesys and Genoa.These tools are custom versions based on versions od the old DLS tool suite. I have worked on the 14nm, 22nm, 32nm and 65nm processes.Have also used Virtuoso XL on the ATLAS tool platform from Cadence. The verification/checking tool that was used was Hercules. Hercules was used in conjunction with the ‘Avante’ Explorer and ‘Vue’ tool to help track down errors faster. The projects that I worked on during this time have all been ANALOG. Projects included editing LDOs, DFEs, DACs, opamps, current mirrors, etc. Methods used included Common Centroid, Interdigitation with signal matching and balancing. All layout completed in accordance with scheduled dates and free of any errors. I have done planning of various levels up to block/fub planning. I have received various Recognition Awards and recently, a Divisional Award for Quality, Customer Orientation Results Orientation and Discipline. Manufacturing Equipment Technician Intel Corporation May 1988  –  June 1995  (7 years 2 months) My job responsibilities included operation, general and preventive maintenance of Sentry, Trillium, Teradyne J941, MCT, S92, S94 test systems. Also included were Fusion UV erasure equipment, Electroglas 2010X wafer probers and Electroglas 2010x Off-line ink stations, SRD station, Burn-in Ovens and Probe Card repair stations. Completed equipment installs of Fusion UV erasure systems. Other responsibilities included being the Content Expert and Sort Trainer on the Electroglas 2010X wafer prober. Wrote EG2010x Training Guides to help new employees learn the system step by step. Also wrote guidelines for, and supervised/assisted in the upgrades of all Electroglas probers on the Sort6 floor in 1992. The upgrades included new OCR recognition control units, OCR cameras, optics, and new exterior covers. I had operational certifications on all test equipment in Sort. I received a VIP award for reducing production line misprocessing. Physical/Mask Design Intel Corporation June 1995  – Present (20 years 3 months) Integrated Circuit Mask Designer - Job responsibilities include the layout of schematic devices using in house tools such as Genesys and Genoa.These tools are custom versions based on versions od the old DLS tool suite. I have worked on the 14nm, 22nm, 32nm and 65nm processes.Have also used Virtuoso XL on the ATLAS tool platform from Cadence. The verification/checking tool that was used was Hercules. Hercules was used in conjunction with the ‘Avante’ Explorer and ‘Vue’ tool to help track down errors faster. The projects that I worked on during this time have all been ANALOG. Projects included editing LDOs, DFEs, DACs, opamps, current mirrors, etc. Methods used included Common Centroid, Interdigitation with signal matching and balancing. All layout completed in accordance with scheduled dates and free of any errors. I have done planning of various levels up to block/fub planning. I have received various Recognition Awards and recently, a Divisional Award for Quality, Customer Orientation Results Orientation and Discipline. Physical/Mask Design Intel Corporation June 1995  – Present (20 years 3 months) Integrated Circuit Mask Designer - Job responsibilities include the layout of schematic devices using in house tools such as Genesys and Genoa.These tools are custom versions based on versions od the old DLS tool suite. I have worked on the 14nm, 22nm, 32nm and 65nm processes.Have also used Virtuoso XL on the ATLAS tool platform from Cadence. The verification/checking tool that was used was Hercules. Hercules was used in conjunction with the ‘Avante’ Explorer and ‘Vue’ tool to help track down errors faster. The projects that I worked on during this time have all been ANALOG. Projects included editing LDOs, DFEs, DACs, opamps, current mirrors, etc. Methods used included Common Centroid, Interdigitation with signal matching and balancing. All layout completed in accordance with scheduled dates and free of any errors. I have done planning of various levels up to block/fub planning. I have received various Recognition Awards and recently, a Divisional Award for Quality, Customer Orientation Results Orientation and Discipline. Manufacturing Equipment Technician Intel Corporation May 1988  –  June 1995  (7 years 2 months) My job responsibilities included operation, general and preventive maintenance of Sentry, Trillium, Teradyne J941, MCT, S92, S94 test systems. Also included were Fusion UV erasure equipment, Electroglas 2010X wafer probers and Electroglas 2010x Off-line ink stations, SRD station, Burn-in Ovens and Probe Card repair stations. Completed equipment installs of Fusion UV erasure systems. Other responsibilities included being the Content Expert and Sort Trainer on the Electroglas 2010X wafer prober. Wrote EG2010x Training Guides to help new employees learn the system step by step. Also wrote guidelines for, and supervised/assisted in the upgrades of all Electroglas probers on the Sort6 floor in 1992. The upgrades included new OCR recognition control units, OCR cameras, optics, and new exterior covers. I had operational certifications on all test equipment in Sort. I received a VIP award for reducing production line misprocessing. Manufacturing Equipment Technician Intel Corporation May 1988  –  June 1995  (7 years 2 months) My job responsibilities included operation, general and preventive maintenance of Sentry, Trillium, Teradyne J941, MCT, S92, S94 test systems. Also included were Fusion UV erasure equipment, Electroglas 2010X wafer probers and Electroglas 2010x Off-line ink stations, SRD station, Burn-in Ovens and Probe Card repair stations. Completed equipment installs of Fusion UV erasure systems. Other responsibilities included being the Content Expert and Sort Trainer on the Electroglas 2010X wafer prober. Wrote EG2010x Training Guides to help new employees learn the system step by step. Also wrote guidelines for, and supervised/assisted in the upgrades of all Electroglas probers on the Sort6 floor in 1992. The upgrades included new OCR recognition control units, OCR cameras, optics, and new exterior covers. I had operational certifications on all test equipment in Sort. I received a VIP award for reducing production line misprocessing. Skills Physical Design Integrated Circuit... Mask Design Analog Circuit Design High Speed Design Low-power Design Mixed Signal Signal Timing Timing Closure SoC Functional Verification DRC LVS RV Design for Manufacturing Cadence Virtuoso Layout... Avante opus Atlas Equipment Maintenance Test Equipment Preventive Maintenance Maintenance Management Robotics Pneumatics ISO 9000 Clean Rooms Lean Manufacturing IC ASIC VLSI Semiconductors Analog CMOS Floorplanning See 20+     See less Skills  Physical Design Integrated Circuit... Mask Design Analog Circuit Design High Speed Design Low-power Design Mixed Signal Signal Timing Timing Closure SoC Functional Verification DRC LVS RV Design for Manufacturing Cadence Virtuoso Layout... Avante opus Atlas Equipment Maintenance Test Equipment Preventive Maintenance Maintenance Management Robotics Pneumatics ISO 9000 Clean Rooms Lean Manufacturing IC ASIC VLSI Semiconductors Analog CMOS Floorplanning See 20+     See less Physical Design Integrated Circuit... Mask Design Analog Circuit Design High Speed Design Low-power Design Mixed Signal Signal Timing Timing Closure SoC Functional Verification DRC LVS RV Design for Manufacturing Cadence Virtuoso Layout... Avante opus Atlas Equipment Maintenance Test Equipment Preventive Maintenance Maintenance Management Robotics Pneumatics ISO 9000 Clean Rooms Lean Manufacturing IC ASIC VLSI Semiconductors Analog CMOS Floorplanning See 20+     See less Physical Design Integrated Circuit... Mask Design Analog Circuit Design High Speed Design Low-power Design Mixed Signal Signal Timing Timing Closure SoC Functional Verification DRC LVS RV Design for Manufacturing Cadence Virtuoso Layout... Avante opus Atlas Equipment Maintenance Test Equipment Preventive Maintenance Maintenance Management Robotics Pneumatics ISO 9000 Clean Rooms Lean Manufacturing IC ASIC VLSI Semiconductors Analog CMOS Floorplanning See 20+     See less Education Gateway Community College Associate's degree,  Electrical and Electronics Engineering 1983  – 1986 Gateway Community College Associate's degree,  Electrical and Electronics Engineering 1983  – 1986 Gateway Community College Associate's degree,  Electrical and Electronics Engineering 1983  – 1986 Gateway Community College Associate's degree,  Electrical and Electronics Engineering 1983  – 1986 ", "Experience Mask Design Intel Corporation Mask Design Intel Corporation Mask Design Intel Corporation ", "Experience physical design engineer Oppstar Technology Sdn Bhd October 2014  – Present (11 months) Penang, Malaysia 14nm technology \nExperienced in candace, ICC tool \n \nExperienced in in Digital, Analog and Mix Signal custom layout design, floor-planning, die size estimation, cell base, HV, UHV and clean by construction methodology. Mask Design Engineer Intel Corporation May 2011  –  October 2014  (3 years 6 months) Penang, Malaysia Position : \nSilicon Mask Design Engineer in Penang Design Center \n \n-Experience in 10nm technology  \n \n-Experience in 14nm technology \n \n-Experience in 22nm technology  \n \n-Working on BDW project  \n-\tOwnership of AIPs and Fubs layout for BDW-A0.  \n-\tExperienced in in Digital, Analog and Mix Signal custom layout design, floor-planning, die size estimation, cell base, HV,UHV and clean by construction methodology. \n \n-Experience in 1271 process \n \n-Working on Soc project \n-\tOwnership of AIPs layout for CRC. \n-\tExperienced in in Digital, Analog and Mix Signal custom layout design, floor-planning, die size estimation, cell base, HV, UHV and clean by construction methodology. \n \nPioneering tool \n-\tPioneering on the GenA.  \n-\tPioneering on the DFM. \n-\tSupport on HV methodology Mask Design Intel Corporation March 2010  –  May 2011  (1 year 3 months) Penang, Malaysia Position : \nSilicon Mask Design Engineer in Penang Design Center \n \ncustom layout & std cells development \n \n-Experience in 32nm technology \n \n-Experience in -22nm technology Graduate Trainee Intel Corporation June 2008  –  December 2009  (1 year 7 months) Penang, Malaysia Position : \nGraduate Trainee as VLSI Silicon Mask Design Engineer in Penang Design Center \n \n-std cells development physical design engineer Oppstar Technology Sdn Bhd October 2014  – Present (11 months) Penang, Malaysia 14nm technology \nExperienced in candace, ICC tool \n \nExperienced in in Digital, Analog and Mix Signal custom layout design, floor-planning, die size estimation, cell base, HV, UHV and clean by construction methodology. physical design engineer Oppstar Technology Sdn Bhd October 2014  – Present (11 months) Penang, Malaysia 14nm technology \nExperienced in candace, ICC tool \n \nExperienced in in Digital, Analog and Mix Signal custom layout design, floor-planning, die size estimation, cell base, HV, UHV and clean by construction methodology. Mask Design Engineer Intel Corporation May 2011  –  October 2014  (3 years 6 months) Penang, Malaysia Position : \nSilicon Mask Design Engineer in Penang Design Center \n \n-Experience in 10nm technology  \n \n-Experience in 14nm technology \n \n-Experience in 22nm technology  \n \n-Working on BDW project  \n-\tOwnership of AIPs and Fubs layout for BDW-A0.  \n-\tExperienced in in Digital, Analog and Mix Signal custom layout design, floor-planning, die size estimation, cell base, HV,UHV and clean by construction methodology. \n \n-Experience in 1271 process \n \n-Working on Soc project \n-\tOwnership of AIPs layout for CRC. \n-\tExperienced in in Digital, Analog and Mix Signal custom layout design, floor-planning, die size estimation, cell base, HV, UHV and clean by construction methodology. \n \nPioneering tool \n-\tPioneering on the GenA.  \n-\tPioneering on the DFM. \n-\tSupport on HV methodology Mask Design Engineer Intel Corporation May 2011  –  October 2014  (3 years 6 months) Penang, Malaysia Position : \nSilicon Mask Design Engineer in Penang Design Center \n \n-Experience in 10nm technology  \n \n-Experience in 14nm technology \n \n-Experience in 22nm technology  \n \n-Working on BDW project  \n-\tOwnership of AIPs and Fubs layout for BDW-A0.  \n-\tExperienced in in Digital, Analog and Mix Signal custom layout design, floor-planning, die size estimation, cell base, HV,UHV and clean by construction methodology. \n \n-Experience in 1271 process \n \n-Working on Soc project \n-\tOwnership of AIPs layout for CRC. \n-\tExperienced in in Digital, Analog and Mix Signal custom layout design, floor-planning, die size estimation, cell base, HV, UHV and clean by construction methodology. \n \nPioneering tool \n-\tPioneering on the GenA.  \n-\tPioneering on the DFM. \n-\tSupport on HV methodology Mask Design Intel Corporation March 2010  –  May 2011  (1 year 3 months) Penang, Malaysia Position : \nSilicon Mask Design Engineer in Penang Design Center \n \ncustom layout & std cells development \n \n-Experience in 32nm technology \n \n-Experience in -22nm technology Mask Design Intel Corporation March 2010  –  May 2011  (1 year 3 months) Penang, Malaysia Position : \nSilicon Mask Design Engineer in Penang Design Center \n \ncustom layout & std cells development \n \n-Experience in 32nm technology \n \n-Experience in -22nm technology Graduate Trainee Intel Corporation June 2008  –  December 2009  (1 year 7 months) Penang, Malaysia Position : \nGraduate Trainee as VLSI Silicon Mask Design Engineer in Penang Design Center \n \n-std cells development Graduate Trainee Intel Corporation June 2008  –  December 2009  (1 year 7 months) Penang, Malaysia Position : \nGraduate Trainee as VLSI Silicon Mask Design Engineer in Penang Design Center \n \n-std cells development Skills SoC Analog VLSI Design for Manufacturing Physical Design Silicon ASIC Management CMOS IC Semiconductors Verilog Simulations VHDL Static Timing Analysis Integration DRC LVS Layout Mask Design Microsoft Excel ICC totem See 8+     See less Skills  SoC Analog VLSI Design for Manufacturing Physical Design Silicon ASIC Management CMOS IC Semiconductors Verilog Simulations VHDL Static Timing Analysis Integration DRC LVS Layout Mask Design Microsoft Excel ICC totem See 8+     See less SoC Analog VLSI Design for Manufacturing Physical Design Silicon ASIC Management CMOS IC Semiconductors Verilog Simulations VHDL Static Timing Analysis Integration DRC LVS Layout Mask Design Microsoft Excel ICC totem See 8+     See less SoC Analog VLSI Design for Manufacturing Physical Design Silicon ASIC Management CMOS IC Semiconductors Verilog Simulations VHDL Static Timing Analysis Integration DRC LVS Layout Mask Design Microsoft Excel ICC totem See 8+     See less Education Kolej KDU Bachelor of Engineering (B.E.),  Electrical and Electronics Engineering 2006  – 2008 Activities and Societies:  engineering society Kolej KDU Diploma,  Electrical , Electronics and Communications Engineering 2004  – 2006 Activities and Societies:  engineering society Kolej KDU Bachelor of Engineering (B.E.),  Electrical and Electronics Engineering 2006  – 2008 Activities and Societies:  engineering society Kolej KDU Bachelor of Engineering (B.E.),  Electrical and Electronics Engineering 2006  – 2008 Activities and Societies:  engineering society Kolej KDU Bachelor of Engineering (B.E.),  Electrical and Electronics Engineering 2006  – 2008 Activities and Societies:  engineering society Kolej KDU Diploma,  Electrical , Electronics and Communications Engineering 2004  – 2006 Activities and Societies:  engineering society Kolej KDU Diploma,  Electrical , Electronics and Communications Engineering 2004  – 2006 Activities and Societies:  engineering society Kolej KDU Diploma,  Electrical , Electronics and Communications Engineering 2004  – 2006 Activities and Societies:  engineering society ", "Summary Senior Analog Mask Design Engineer with specialties in Analog and Mixed Signal Layout.  \nNot a design Engineer \n \nGOALS \nMy current goals are to continue in the layout realm through at least the next decade and have a good time doing it. \n \nCARREER SUMMARY \n> Profession experience includes over twenty (20+) years of Integrated Circuit Mask Design Experience, over fifteen (15+) years of experience utilizing twelve (12) different CAD systems, and over eighteen (18+) years of project lead experience \n> I/O Building Experience: ESD structures , interior and exterior substrate and well-shielding, including I/O pads \n> RB-Pads , Data I/O Pads, VCC, GND, V5, V10, V20 pads, output pads, bump pads and Scribe \n> Grid area test circuits along with chip tape-out considerations through to final Tape Out \n> Analog Experience: Built many structures related to analog and mixed signal areas including but not limited to \n> Voltage regulators, power amps, opamps, Mixed Signal, phase-detectors, phase-hysteresis, one-shots, delay- line blocks, clock-blocks, fuse groups, bipolar, diode symmetry, capacitor-blocks, resistor-matching charge-pumps, LDO, DAC, RX/TX, line shielding, PLL, LV/HV supply generators, power grids, differential signaling, common centroid devices, device matching, filters, receivers, internal CLK Gens, Select 2 to 1/16to 1, comparators, capdividers, charge couplers, learning SKILL \n> Utilized Chartered 45nm , TSMC 28nm , Fujitsu 28nm , G.F. 28nm , IBM 28nm, Intel 22nm and TSMC 16nm \n> Layout Programs: Cadence VXL, Laker Custom Layout System, Diva, Hercules, Calibre, Assura, PVC \n \nSpecialties: Analog Blocks, PLL's, Mixed Signal, Flash Memories, SRAM Memories, Digital Standard Cell Libraries (High Performance and Low Power) Summary Senior Analog Mask Design Engineer with specialties in Analog and Mixed Signal Layout.  \nNot a design Engineer \n \nGOALS \nMy current goals are to continue in the layout realm through at least the next decade and have a good time doing it. \n \nCARREER SUMMARY \n> Profession experience includes over twenty (20+) years of Integrated Circuit Mask Design Experience, over fifteen (15+) years of experience utilizing twelve (12) different CAD systems, and over eighteen (18+) years of project lead experience \n> I/O Building Experience: ESD structures , interior and exterior substrate and well-shielding, including I/O pads \n> RB-Pads , Data I/O Pads, VCC, GND, V5, V10, V20 pads, output pads, bump pads and Scribe \n> Grid area test circuits along with chip tape-out considerations through to final Tape Out \n> Analog Experience: Built many structures related to analog and mixed signal areas including but not limited to \n> Voltage regulators, power amps, opamps, Mixed Signal, phase-detectors, phase-hysteresis, one-shots, delay- line blocks, clock-blocks, fuse groups, bipolar, diode symmetry, capacitor-blocks, resistor-matching charge-pumps, LDO, DAC, RX/TX, line shielding, PLL, LV/HV supply generators, power grids, differential signaling, common centroid devices, device matching, filters, receivers, internal CLK Gens, Select 2 to 1/16to 1, comparators, capdividers, charge couplers, learning SKILL \n> Utilized Chartered 45nm , TSMC 28nm , Fujitsu 28nm , G.F. 28nm , IBM 28nm, Intel 22nm and TSMC 16nm \n> Layout Programs: Cadence VXL, Laker Custom Layout System, Diva, Hercules, Calibre, Assura, PVC \n \nSpecialties: Analog Blocks, PLL's, Mixed Signal, Flash Memories, SRAM Memories, Digital Standard Cell Libraries (High Performance and Low Power) Senior Analog Mask Design Engineer with specialties in Analog and Mixed Signal Layout.  \nNot a design Engineer \n \nGOALS \nMy current goals are to continue in the layout realm through at least the next decade and have a good time doing it. \n \nCARREER SUMMARY \n> Profession experience includes over twenty (20+) years of Integrated Circuit Mask Design Experience, over fifteen (15+) years of experience utilizing twelve (12) different CAD systems, and over eighteen (18+) years of project lead experience \n> I/O Building Experience: ESD structures , interior and exterior substrate and well-shielding, including I/O pads \n> RB-Pads , Data I/O Pads, VCC, GND, V5, V10, V20 pads, output pads, bump pads and Scribe \n> Grid area test circuits along with chip tape-out considerations through to final Tape Out \n> Analog Experience: Built many structures related to analog and mixed signal areas including but not limited to \n> Voltage regulators, power amps, opamps, Mixed Signal, phase-detectors, phase-hysteresis, one-shots, delay- line blocks, clock-blocks, fuse groups, bipolar, diode symmetry, capacitor-blocks, resistor-matching charge-pumps, LDO, DAC, RX/TX, line shielding, PLL, LV/HV supply generators, power grids, differential signaling, common centroid devices, device matching, filters, receivers, internal CLK Gens, Select 2 to 1/16to 1, comparators, capdividers, charge couplers, learning SKILL \n> Utilized Chartered 45nm , TSMC 28nm , Fujitsu 28nm , G.F. 28nm , IBM 28nm, Intel 22nm and TSMC 16nm \n> Layout Programs: Cadence VXL, Laker Custom Layout System, Diva, Hercules, Calibre, Assura, PVC \n \nSpecialties: Analog Blocks, PLL's, Mixed Signal, Flash Memories, SRAM Memories, Digital Standard Cell Libraries (High Performance and Low Power) Senior Analog Mask Design Engineer with specialties in Analog and Mixed Signal Layout.  \nNot a design Engineer \n \nGOALS \nMy current goals are to continue in the layout realm through at least the next decade and have a good time doing it. \n \nCARREER SUMMARY \n> Profession experience includes over twenty (20+) years of Integrated Circuit Mask Design Experience, over fifteen (15+) years of experience utilizing twelve (12) different CAD systems, and over eighteen (18+) years of project lead experience \n> I/O Building Experience: ESD structures , interior and exterior substrate and well-shielding, including I/O pads \n> RB-Pads , Data I/O Pads, VCC, GND, V5, V10, V20 pads, output pads, bump pads and Scribe \n> Grid area test circuits along with chip tape-out considerations through to final Tape Out \n> Analog Experience: Built many structures related to analog and mixed signal areas including but not limited to \n> Voltage regulators, power amps, opamps, Mixed Signal, phase-detectors, phase-hysteresis, one-shots, delay- line blocks, clock-blocks, fuse groups, bipolar, diode symmetry, capacitor-blocks, resistor-matching charge-pumps, LDO, DAC, RX/TX, line shielding, PLL, LV/HV supply generators, power grids, differential signaling, common centroid devices, device matching, filters, receivers, internal CLK Gens, Select 2 to 1/16to 1, comparators, capdividers, charge couplers, learning SKILL \n> Utilized Chartered 45nm , TSMC 28nm , Fujitsu 28nm , G.F. 28nm , IBM 28nm, Intel 22nm and TSMC 16nm \n> Layout Programs: Cadence VXL, Laker Custom Layout System, Diva, Hercules, Calibre, Assura, PVC \n \nSpecialties: Analog Blocks, PLL's, Mixed Signal, Flash Memories, SRAM Memories, Digital Standard Cell Libraries (High Performance and Low Power) Experience Senior Consultant EncoreSemi April 2015  – Present (5 months) At Home Now, Previously in Vermont with IBM/Global Foundries on same project Have been putting together another Memory part, this one for IBM/GF with an Encoresemi Contract. \nWorking in 14nm Technology on a Cadence Platform version 12.1 with Calibre checking tools. \nEncoreSemi has been a great group to work with and very supportive throughout this project. \n \n Senior Analog Mask Designer Foveonics Imaging Technologies April 2014  –  December 2014  (9 months) Santa Clara Have just finished this job week of Dec 31, 2014 \nWe put together An Image Sensor. \nWas involved with all of the Analog portions and for  \nputting together the Pixel Core Array. Senior Analog Mask Design Designer Synapse February 2014  –  March 2014  (2 months) Santa Clara This was another small SerDes Project that needed redo and update. \nWe touched only the Metal Layers and added some small SRAM sections. \nThis was done for ST Micro/ST Ericson/MegaChip. they switched names  \nthree times whilst interviewing for the job and working for them. Senior Analog Mask Design Engineer NVIDIA March 2013  –  September 2013  (7 months) Santa Clara, Calif. Started and completed an SRAM Test Vehicle for R&D Group. Built I/O Write block and started the Read Decoder. All interface and through to Tape Out Stage. 16nm TSMC Process do with Cadence/ Calibre Senior Analog Layout Design Engineer at Tabula Tabula August 2011  –  February 2013  (1 year 7 months) Santa Clara Another SerDes Project. Section of chip completed. Built High Performance Digital Library, Complex Mixed Signal and Analog Blocks. Used Cadence 6.1.5 VXL with Hercules DRC/LVS, 22nm Process at sub 25GHz . Senior Analog Mask Design Engineer LSI Corporation August 2010  –  July 2011  (1 year) Milpitas, Calif. •\tBuilt SerDes layouts using Cadence 6.1.4.500 \n•\tUsed TSMCs 28nm VXL and Calibre DRC, LVS, ERC, ANT, ERC, GDR rules through to tape out Senior Analog Mask Design Engineer Global Foundries August 2009  –  August 2010  (1 year 1 month) Sunnyvale, Calif. Contract IC Layout designer on the Chartered 28 nm process. A lot of headaches with this process. If it flies then GF might have something. If it doesn't then it's quagmire soup. For instance they already had done two rounds of std. cells and our group updated two more rounds. the analog still has many bugs to work out from scaling to finding the most reasonable resistor sizes to use. Senior Analog Layout Designer Fujitsu Labs America November 2008  –  July 2009  (9 months) Putting together a part in 45nm technology on Cadence VXL with Calibre software checking tools Senior Analog Mask Design Engineer Qualcomm September 2007  –  October 2008  (1 year 2 months) San Diego and Santa Clara Short term Contract, building RF Analog Blocks, Level-shifter, VCO-Reg. with Cadence 6.1 and VXL, and Calibre Checking. 65nm TSMC process, 5 GHz process Sr. Layout Design Engineer Micron Technology October 1996  –  July 2007  (10 years 10 months) San Jose, Calif •\tCompleted extensive work on all flash memory products passing through Micron during the last ten (10) years  \n•\tLed the design of ten (10) products during this period, from 64Mg parts to 8Gb products \n•\tWorked with all sections of each part including: pads, analog, mixed signal interfaces, digital, some core building, mask shop submittals, reviewed layer databases, archival while frequently managing multiple requests. \n•\tUsed Cadence Opus/Virtuoso through VXL utilizing DRC and LVS comprehensively through to tape out. last process worked on 18um Senior Analog Mask Designer Monolithic Devices October 1994  –  September 1996  (2 years) San Jose Managed three HV Analog and RF Circuits. \nCells Built, VREFgen, Stablog, HVComps. Completed on Cadence OPUS tools Senior Analog/Memory Mask Designer Catalyst Semiconductor February 1990  –  February 1995  (5 years 1 month) Santa Clara Built 1M PEROM and 64K, 16K, 4K, 2K, and 1K EEPROMS with onboard Analog Blocks, and a family of 1K to 256-Bit family of NVRAMS By self with occasional Junior People under my tutelage. Daisy and Calma system usage. Sr. Analog Layout Designer Crystal Semiconductor 1988  –  1990  (2 years) Austin, Texas This was an interesting job. I was working for Intel in Oregon when Mike Callahan called me up and asked if I wanted to get involved with another start up. I was itching to get back to Texas before my now ex wife left for Michigan for good and I didn't get there soon enough. Woe is me. life turned out much better in the longrun. When I got there these guys were all over the place in Analog. Putting together a Delta-Sigma part a Two_Step Flash part, A/DConverters and I started on a T1 transceiver for AT&T. The people there were all exceptional and very bright. We had a baseball team and Mike pointed out two of the teams best athletes and said, 'Those two guys were both straight A students through their masters programs at Stanford.', Gerry and Nav. The rest of the crew had the likes of Eric Swanson and a couple of others from Bell Labs, Reading, Penn. Great trip, short lived. Hyper and full of fun. Sold to Cirrus Logic right after I left. Mask Design Intel Corporation 1984  –  1985  (1 year) Mask Design Intel Corporation 1984  –  1985  (1 year) Layout designer The IC Shop 1983  –  1984  (1 year) Senior Consultant EncoreSemi April 2015  – Present (5 months) At Home Now, Previously in Vermont with IBM/Global Foundries on same project Have been putting together another Memory part, this one for IBM/GF with an Encoresemi Contract. \nWorking in 14nm Technology on a Cadence Platform version 12.1 with Calibre checking tools. \nEncoreSemi has been a great group to work with and very supportive throughout this project. \n \n Senior Consultant EncoreSemi April 2015  – Present (5 months) At Home Now, Previously in Vermont with IBM/Global Foundries on same project Have been putting together another Memory part, this one for IBM/GF with an Encoresemi Contract. \nWorking in 14nm Technology on a Cadence Platform version 12.1 with Calibre checking tools. \nEncoreSemi has been a great group to work with and very supportive throughout this project. \n \n Senior Analog Mask Designer Foveonics Imaging Technologies April 2014  –  December 2014  (9 months) Santa Clara Have just finished this job week of Dec 31, 2014 \nWe put together An Image Sensor. \nWas involved with all of the Analog portions and for  \nputting together the Pixel Core Array. Senior Analog Mask Designer Foveonics Imaging Technologies April 2014  –  December 2014  (9 months) Santa Clara Have just finished this job week of Dec 31, 2014 \nWe put together An Image Sensor. \nWas involved with all of the Analog portions and for  \nputting together the Pixel Core Array. Senior Analog Mask Design Designer Synapse February 2014  –  March 2014  (2 months) Santa Clara This was another small SerDes Project that needed redo and update. \nWe touched only the Metal Layers and added some small SRAM sections. \nThis was done for ST Micro/ST Ericson/MegaChip. they switched names  \nthree times whilst interviewing for the job and working for them. Senior Analog Mask Design Designer Synapse February 2014  –  March 2014  (2 months) Santa Clara This was another small SerDes Project that needed redo and update. \nWe touched only the Metal Layers and added some small SRAM sections. \nThis was done for ST Micro/ST Ericson/MegaChip. they switched names  \nthree times whilst interviewing for the job and working for them. Senior Analog Mask Design Engineer NVIDIA March 2013  –  September 2013  (7 months) Santa Clara, Calif. Started and completed an SRAM Test Vehicle for R&D Group. Built I/O Write block and started the Read Decoder. All interface and through to Tape Out Stage. 16nm TSMC Process do with Cadence/ Calibre Senior Analog Mask Design Engineer NVIDIA March 2013  –  September 2013  (7 months) Santa Clara, Calif. Started and completed an SRAM Test Vehicle for R&D Group. Built I/O Write block and started the Read Decoder. All interface and through to Tape Out Stage. 16nm TSMC Process do with Cadence/ Calibre Senior Analog Layout Design Engineer at Tabula Tabula August 2011  –  February 2013  (1 year 7 months) Santa Clara Another SerDes Project. Section of chip completed. Built High Performance Digital Library, Complex Mixed Signal and Analog Blocks. Used Cadence 6.1.5 VXL with Hercules DRC/LVS, 22nm Process at sub 25GHz . Senior Analog Layout Design Engineer at Tabula Tabula August 2011  –  February 2013  (1 year 7 months) Santa Clara Another SerDes Project. Section of chip completed. Built High Performance Digital Library, Complex Mixed Signal and Analog Blocks. Used Cadence 6.1.5 VXL with Hercules DRC/LVS, 22nm Process at sub 25GHz . Senior Analog Mask Design Engineer LSI Corporation August 2010  –  July 2011  (1 year) Milpitas, Calif. •\tBuilt SerDes layouts using Cadence 6.1.4.500 \n•\tUsed TSMCs 28nm VXL and Calibre DRC, LVS, ERC, ANT, ERC, GDR rules through to tape out Senior Analog Mask Design Engineer LSI Corporation August 2010  –  July 2011  (1 year) Milpitas, Calif. •\tBuilt SerDes layouts using Cadence 6.1.4.500 \n•\tUsed TSMCs 28nm VXL and Calibre DRC, LVS, ERC, ANT, ERC, GDR rules through to tape out Senior Analog Mask Design Engineer Global Foundries August 2009  –  August 2010  (1 year 1 month) Sunnyvale, Calif. Contract IC Layout designer on the Chartered 28 nm process. A lot of headaches with this process. If it flies then GF might have something. If it doesn't then it's quagmire soup. For instance they already had done two rounds of std. cells and our group updated two more rounds. the analog still has many bugs to work out from scaling to finding the most reasonable resistor sizes to use. Senior Analog Mask Design Engineer Global Foundries August 2009  –  August 2010  (1 year 1 month) Sunnyvale, Calif. Contract IC Layout designer on the Chartered 28 nm process. A lot of headaches with this process. If it flies then GF might have something. If it doesn't then it's quagmire soup. For instance they already had done two rounds of std. cells and our group updated two more rounds. the analog still has many bugs to work out from scaling to finding the most reasonable resistor sizes to use. Senior Analog Layout Designer Fujitsu Labs America November 2008  –  July 2009  (9 months) Putting together a part in 45nm technology on Cadence VXL with Calibre software checking tools Senior Analog Layout Designer Fujitsu Labs America November 2008  –  July 2009  (9 months) Putting together a part in 45nm technology on Cadence VXL with Calibre software checking tools Senior Analog Mask Design Engineer Qualcomm September 2007  –  October 2008  (1 year 2 months) San Diego and Santa Clara Short term Contract, building RF Analog Blocks, Level-shifter, VCO-Reg. with Cadence 6.1 and VXL, and Calibre Checking. 65nm TSMC process, 5 GHz process Senior Analog Mask Design Engineer Qualcomm September 2007  –  October 2008  (1 year 2 months) San Diego and Santa Clara Short term Contract, building RF Analog Blocks, Level-shifter, VCO-Reg. with Cadence 6.1 and VXL, and Calibre Checking. 65nm TSMC process, 5 GHz process Sr. Layout Design Engineer Micron Technology October 1996  –  July 2007  (10 years 10 months) San Jose, Calif •\tCompleted extensive work on all flash memory products passing through Micron during the last ten (10) years  \n•\tLed the design of ten (10) products during this period, from 64Mg parts to 8Gb products \n•\tWorked with all sections of each part including: pads, analog, mixed signal interfaces, digital, some core building, mask shop submittals, reviewed layer databases, archival while frequently managing multiple requests. \n•\tUsed Cadence Opus/Virtuoso through VXL utilizing DRC and LVS comprehensively through to tape out. last process worked on 18um Sr. Layout Design Engineer Micron Technology October 1996  –  July 2007  (10 years 10 months) San Jose, Calif •\tCompleted extensive work on all flash memory products passing through Micron during the last ten (10) years  \n•\tLed the design of ten (10) products during this period, from 64Mg parts to 8Gb products \n•\tWorked with all sections of each part including: pads, analog, mixed signal interfaces, digital, some core building, mask shop submittals, reviewed layer databases, archival while frequently managing multiple requests. \n•\tUsed Cadence Opus/Virtuoso through VXL utilizing DRC and LVS comprehensively through to tape out. last process worked on 18um Senior Analog Mask Designer Monolithic Devices October 1994  –  September 1996  (2 years) San Jose Managed three HV Analog and RF Circuits. \nCells Built, VREFgen, Stablog, HVComps. Completed on Cadence OPUS tools Senior Analog Mask Designer Monolithic Devices October 1994  –  September 1996  (2 years) San Jose Managed three HV Analog and RF Circuits. \nCells Built, VREFgen, Stablog, HVComps. Completed on Cadence OPUS tools Senior Analog/Memory Mask Designer Catalyst Semiconductor February 1990  –  February 1995  (5 years 1 month) Santa Clara Built 1M PEROM and 64K, 16K, 4K, 2K, and 1K EEPROMS with onboard Analog Blocks, and a family of 1K to 256-Bit family of NVRAMS By self with occasional Junior People under my tutelage. Daisy and Calma system usage. Senior Analog/Memory Mask Designer Catalyst Semiconductor February 1990  –  February 1995  (5 years 1 month) Santa Clara Built 1M PEROM and 64K, 16K, 4K, 2K, and 1K EEPROMS with onboard Analog Blocks, and a family of 1K to 256-Bit family of NVRAMS By self with occasional Junior People under my tutelage. Daisy and Calma system usage. Sr. Analog Layout Designer Crystal Semiconductor 1988  –  1990  (2 years) Austin, Texas This was an interesting job. I was working for Intel in Oregon when Mike Callahan called me up and asked if I wanted to get involved with another start up. I was itching to get back to Texas before my now ex wife left for Michigan for good and I didn't get there soon enough. Woe is me. life turned out much better in the longrun. When I got there these guys were all over the place in Analog. Putting together a Delta-Sigma part a Two_Step Flash part, A/DConverters and I started on a T1 transceiver for AT&T. The people there were all exceptional and very bright. We had a baseball team and Mike pointed out two of the teams best athletes and said, 'Those two guys were both straight A students through their masters programs at Stanford.', Gerry and Nav. The rest of the crew had the likes of Eric Swanson and a couple of others from Bell Labs, Reading, Penn. Great trip, short lived. Hyper and full of fun. Sold to Cirrus Logic right after I left. Sr. Analog Layout Designer Crystal Semiconductor 1988  –  1990  (2 years) Austin, Texas This was an interesting job. I was working for Intel in Oregon when Mike Callahan called me up and asked if I wanted to get involved with another start up. I was itching to get back to Texas before my now ex wife left for Michigan for good and I didn't get there soon enough. Woe is me. life turned out much better in the longrun. When I got there these guys were all over the place in Analog. Putting together a Delta-Sigma part a Two_Step Flash part, A/DConverters and I started on a T1 transceiver for AT&T. The people there were all exceptional and very bright. We had a baseball team and Mike pointed out two of the teams best athletes and said, 'Those two guys were both straight A students through their masters programs at Stanford.', Gerry and Nav. The rest of the crew had the likes of Eric Swanson and a couple of others from Bell Labs, Reading, Penn. Great trip, short lived. Hyper and full of fun. Sold to Cirrus Logic right after I left. Mask Design Intel Corporation 1984  –  1985  (1 year) Mask Design Intel Corporation 1984  –  1985  (1 year) Mask Design Intel Corporation 1984  –  1985  (1 year) Mask Design Intel Corporation 1984  –  1985  (1 year) Layout designer The IC Shop 1983  –  1984  (1 year) Layout designer The IC Shop 1983  –  1984  (1 year) Skills Cadence Virtuoso 4.5.1 Cadence Virtuoso Mixed Signal DRC ASIC Semiconductors LVS PLL Analog IC CMOS Raising our Family House building and... Rock Climbing Coin Collecting Hercules SERDES Low-power Design SRAM Cadence RF DAC IC layout Physical Verification See 9+     See less Skills  Cadence Virtuoso 4.5.1 Cadence Virtuoso Mixed Signal DRC ASIC Semiconductors LVS PLL Analog IC CMOS Raising our Family House building and... Rock Climbing Coin Collecting Hercules SERDES Low-power Design SRAM Cadence RF DAC IC layout Physical Verification See 9+     See less Cadence Virtuoso 4.5.1 Cadence Virtuoso Mixed Signal DRC ASIC Semiconductors LVS PLL Analog IC CMOS Raising our Family House building and... Rock Climbing Coin Collecting Hercules SERDES Low-power Design SRAM Cadence RF DAC IC layout Physical Verification See 9+     See less Cadence Virtuoso 4.5.1 Cadence Virtuoso Mixed Signal DRC ASIC Semiconductors LVS PLL Analog IC CMOS Raising our Family House building and... Rock Climbing Coin Collecting Hercules SERDES Low-power Design SRAM Cadence RF DAC IC layout Physical Verification See 9+     See less Education San Jose State University N/A,  Sociology 1972  – 1973 Foothill College AA,  Social- Psychology 1968  – 1970 Activities and Societies:  Most stayed on Campus when not working or climbing Chester F. Awalt of course High School Diploma,  General Education 1964  – 1967 Benjamin Bubb San Jose State University N/A,  Sociology 1972  – 1973 San Jose State University N/A,  Sociology 1972  – 1973 San Jose State University N/A,  Sociology 1972  – 1973 Foothill College AA,  Social- Psychology 1968  – 1970 Activities and Societies:  Most stayed on Campus when not working or climbing Foothill College AA,  Social- Psychology 1968  – 1970 Activities and Societies:  Most stayed on Campus when not working or climbing Foothill College AA,  Social- Psychology 1968  – 1970 Activities and Societies:  Most stayed on Campus when not working or climbing Chester F. Awalt of course High School Diploma,  General Education 1964  – 1967 Chester F. Awalt of course High School Diploma,  General Education 1964  – 1967 Chester F. Awalt of course High School Diploma,  General Education 1964  – 1967 Benjamin Bubb Benjamin Bubb Benjamin Bubb ", "Experience Module Lead MindTree Ltd. July 2011  –  June 2013  (2 years) Bangalore Layout Design Engineer Sankalp Semiconductors Pvt Ltd July 2007  –  June 2011  (4 years) 7+ Years of experience in analog/ mixed signal/ Memory/IO custom layout in CMOS and Bicmos with different Process technology ranging from 14nm to 180nm. Executed different types of Layout Design such as LDO, Temperature Sensor, LVDS,LVCMOS, LPDDR, Oscillator and Current/Voltage Reference Generator. student SGGSIE&T, Nanded 2005  –  2007  (2 years) Module Lead MindTree Ltd. July 2011  –  June 2013  (2 years) Bangalore Module Lead MindTree Ltd. July 2011  –  June 2013  (2 years) Bangalore Layout Design Engineer Sankalp Semiconductors Pvt Ltd July 2007  –  June 2011  (4 years) 7+ Years of experience in analog/ mixed signal/ Memory/IO custom layout in CMOS and Bicmos with different Process technology ranging from 14nm to 180nm. Executed different types of Layout Design such as LDO, Temperature Sensor, LVDS,LVCMOS, LPDDR, Oscillator and Current/Voltage Reference Generator. Layout Design Engineer Sankalp Semiconductors Pvt Ltd July 2007  –  June 2011  (4 years) 7+ Years of experience in analog/ mixed signal/ Memory/IO custom layout in CMOS and Bicmos with different Process technology ranging from 14nm to 180nm. Executed different types of Layout Design such as LDO, Temperature Sensor, LVDS,LVCMOS, LPDDR, Oscillator and Current/Voltage Reference Generator. student SGGSIE&T, Nanded 2005  –  2007  (2 years) student SGGSIE&T, Nanded 2005  –  2007  (2 years) Skills Cadence Virtuoso Altera Quartus Image Processing BiCMOS CMOS Mixed Signal VLSI Analog Sensors ASIC Semiconductors VHDL Verilog Perl FPGA C++ ModelSim See 2+     See less Skills  Cadence Virtuoso Altera Quartus Image Processing BiCMOS CMOS Mixed Signal VLSI Analog Sensors ASIC Semiconductors VHDL Verilog Perl FPGA C++ ModelSim See 2+     See less Cadence Virtuoso Altera Quartus Image Processing BiCMOS CMOS Mixed Signal VLSI Analog Sensors ASIC Semiconductors VHDL Verilog Perl FPGA C++ ModelSim See 2+     See less Cadence Virtuoso Altera Quartus Image Processing BiCMOS CMOS Mixed Signal VLSI Analog Sensors ASIC Semiconductors VHDL Verilog Perl FPGA C++ ModelSim See 2+     See less Education Shri Guru Gobind Singhji Institute of Engineering and Technology, Nanded, Maharashtra. M.Tech,  electronics 2005  – 2007 Shri Guru Gobind Singhji Institute of Engineering and Technology, Nanded, Maharashtra. BE,  electronics 2000  – 2004 Activities and Societies:  Captained College Football team. vvhs Shri Guru Gobind Singhji Institute of Engineering and Technology, Nanded, Maharashtra. M.Tech,  electronics 2005  – 2007 Shri Guru Gobind Singhji Institute of Engineering and Technology, Nanded, Maharashtra. M.Tech,  electronics 2005  – 2007 Shri Guru Gobind Singhji Institute of Engineering and Technology, Nanded, Maharashtra. M.Tech,  electronics 2005  – 2007 Shri Guru Gobind Singhji Institute of Engineering and Technology, Nanded, Maharashtra. BE,  electronics 2000  – 2004 Activities and Societies:  Captained College Football team. Shri Guru Gobind Singhji Institute of Engineering and Technology, Nanded, Maharashtra. BE,  electronics 2000  – 2004 Activities and Societies:  Captained College Football team. Shri Guru Gobind Singhji Institute of Engineering and Technology, Nanded, Maharashtra. BE,  electronics 2000  – 2004 Activities and Societies:  Captained College Football team. vvhs vvhs vvhs ", "Summary I love component design. \n \nI am currently looking for a position in the industry with a focused design team. I am very interested to hear about current projects and how I could contribute - please get in touch! Summary I love component design. \n \nI am currently looking for a position in the industry with a focused design team. I am very interested to hear about current projects and how I could contribute - please get in touch! I love component design. \n \nI am currently looking for a position in the industry with a focused design team. I am very interested to hear about current projects and how I could contribute - please get in touch! I love component design. \n \nI am currently looking for a position in the industry with a focused design team. I am very interested to hear about current projects and how I could contribute - please get in touch! Experience IC Custom Layout Design, Mask Design Intel Corporation October 1996  –  March 2014  (17 years 6 months) Americas seasoned and proficient in leading edge microchip layout, floor-planning, and test. 18 year relationship with Intel, primarily in \"mask design,\" working on nearly every facet of chip design and optimization. \n \ncompetent using latest industry standard and Intel specific design and verification tools. \n \nlayout and design contributions include: Pentium/Core microprocessors, chip-sets, graphic ASIC, flash memory, research, test, and testing platforms. \n \nplease contact me through LinkedIn for updated resume Associate VWR Scientific 1996  –  1996  (less than a year) Intel Oregon Site Support and Distribution for Hawthorn Farms Assembly lines, Ronler Acres Construction Site, and Fabs 4,5,15, and associated subfabs, chemical labs, test labs, scrubber decks, shipping/receiving Petty Officer, Midshipman US Navy January 1991  –  June 1994  (3 years 6 months) US East Coast electrician student, Naval Nuclear Power School, Orlando FL \nofficer training, US Naval Academy,Class of '97, Annapolis MD IC Custom Layout Design, Mask Design Intel Corporation October 1996  –  March 2014  (17 years 6 months) Americas seasoned and proficient in leading edge microchip layout, floor-planning, and test. 18 year relationship with Intel, primarily in \"mask design,\" working on nearly every facet of chip design and optimization. \n \ncompetent using latest industry standard and Intel specific design and verification tools. \n \nlayout and design contributions include: Pentium/Core microprocessors, chip-sets, graphic ASIC, flash memory, research, test, and testing platforms. \n \nplease contact me through LinkedIn for updated resume IC Custom Layout Design, Mask Design Intel Corporation October 1996  –  March 2014  (17 years 6 months) Americas seasoned and proficient in leading edge microchip layout, floor-planning, and test. 18 year relationship with Intel, primarily in \"mask design,\" working on nearly every facet of chip design and optimization. \n \ncompetent using latest industry standard and Intel specific design and verification tools. \n \nlayout and design contributions include: Pentium/Core microprocessors, chip-sets, graphic ASIC, flash memory, research, test, and testing platforms. \n \nplease contact me through LinkedIn for updated resume Associate VWR Scientific 1996  –  1996  (less than a year) Intel Oregon Site Support and Distribution for Hawthorn Farms Assembly lines, Ronler Acres Construction Site, and Fabs 4,5,15, and associated subfabs, chemical labs, test labs, scrubber decks, shipping/receiving Associate VWR Scientific 1996  –  1996  (less than a year) Intel Oregon Site Support and Distribution for Hawthorn Farms Assembly lines, Ronler Acres Construction Site, and Fabs 4,5,15, and associated subfabs, chemical labs, test labs, scrubber decks, shipping/receiving Petty Officer, Midshipman US Navy January 1991  –  June 1994  (3 years 6 months) US East Coast electrician student, Naval Nuclear Power School, Orlando FL \nofficer training, US Naval Academy,Class of '97, Annapolis MD Petty Officer, Midshipman US Navy January 1991  –  June 1994  (3 years 6 months) US East Coast electrician student, Naval Nuclear Power School, Orlando FL \nofficer training, US Naval Academy,Class of '97, Annapolis MD Languages Spanish Spanish Spanish Skills Physical Design CMOS Navy Signal Integrity ASIC IC Computer Science Mixed Signal Military Security Clearance Strategy Organizational... Semiconductors Team Leadership Circuit Design Team Building DRC Integrated Circuit... LVS Intel See 5+     See less Skills  Physical Design CMOS Navy Signal Integrity ASIC IC Computer Science Mixed Signal Military Security Clearance Strategy Organizational... Semiconductors Team Leadership Circuit Design Team Building DRC Integrated Circuit... LVS Intel See 5+     See less Physical Design CMOS Navy Signal Integrity ASIC IC Computer Science Mixed Signal Military Security Clearance Strategy Organizational... Semiconductors Team Leadership Circuit Design Team Building DRC Integrated Circuit... LVS Intel See 5+     See less Physical Design CMOS Navy Signal Integrity ASIC IC Computer Science Mixed Signal Military Security Clearance Strategy Organizational... Semiconductors Team Leadership Circuit Design Team Building DRC Integrated Circuit... LVS Intel See 5+     See less Education Portland State University 1997  – 2000 United States Naval Academy 1993  – 1994 Naval Nuclear Power School Nuclear Power Electrician 1991  – 1992 Oregon Episcopal School 1978  – 1984 Portland State University 1997  – 2000 Portland State University 1997  – 2000 Portland State University 1997  – 2000 United States Naval Academy 1993  – 1994 United States Naval Academy 1993  – 1994 United States Naval Academy 1993  – 1994 Naval Nuclear Power School Nuclear Power Electrician 1991  – 1992 Naval Nuclear Power School Nuclear Power Electrician 1991  – 1992 Naval Nuclear Power School Nuclear Power Electrician 1991  – 1992 Oregon Episcopal School 1978  – 1984 Oregon Episcopal School 1978  – 1984 Oregon Episcopal School 1978  – 1984 ", "Experience Chief Operations Officer Spaceman USA 2015  – Present (less than a year) Boulder, CO Chief Operations Officer Spaceman USA 2015  – Present (less than a year) Boulder, CO Chief Operations Officer Spaceman USA 2015  – Present (less than a year) Boulder, CO Skills Skills     ", "Experience mom home July 2011  – Present (4 years 2 months) mask design Intel Corporation 1997  –  2011  (14 years) mom home July 2011  – Present (4 years 2 months) mom home July 2011  – Present (4 years 2 months) mask design Intel Corporation 1997  –  2011  (14 years) mask design Intel Corporation 1997  –  2011  (14 years) Skills Semiconductors Product Management Cross-functional Team... SoC Manufacturing Electronics ASIC Product Marketing C++ Product Development RTL design CMOS Program Management C Mobile Devices Physical Design IC VLSI Project Management Static Timing Analysis See 5+     See less Skills  Semiconductors Product Management Cross-functional Team... SoC Manufacturing Electronics ASIC Product Marketing C++ Product Development RTL design CMOS Program Management C Mobile Devices Physical Design IC VLSI Project Management Static Timing Analysis See 5+     See less Semiconductors Product Management Cross-functional Team... SoC Manufacturing Electronics ASIC Product Marketing C++ Product Development RTL design CMOS Program Management C Mobile Devices Physical Design IC VLSI Project Management Static Timing Analysis See 5+     See less Semiconductors Product Management Cross-functional Team... SoC Manufacturing Electronics ASIC Product Marketing C++ Product Development RTL design CMOS Program Management C Mobile Devices Physical Design IC VLSI Project Management Static Timing Analysis See 5+     See less Education Edgewood High School Edgewood High School Edgewood High School Edgewood High School ", "Summary Owner of Summa Elite Realty, 4 locations to serve you.  \nwww.summaeliterealty.com \n \nLooking to buy or sell your next home? \nMy brokers can help you find exactly what you're looking for. Summary Owner of Summa Elite Realty, 4 locations to serve you.  \nwww.summaeliterealty.com \n \nLooking to buy or sell your next home? \nMy brokers can help you find exactly what you're looking for. Owner of Summa Elite Realty, 4 locations to serve you.  \nwww.summaeliterealty.com \n \nLooking to buy or sell your next home? \nMy brokers can help you find exactly what you're looking for. Owner of Summa Elite Realty, 4 locations to serve you.  \nwww.summaeliterealty.com \n \nLooking to buy or sell your next home? \nMy brokers can help you find exactly what you're looking for. Experience Mask Design Intel Corporation January 1984  – Present (31 years 8 months) Hillsboro, OR aka \"Polygon Pusher\" (You'd have to be one to know). Mask Design Intel Corporation January 1984  – Present (31 years 8 months) Hillsboro, OR aka \"Polygon Pusher\" (You'd have to be one to know). Mask Design Intel Corporation January 1984  – Present (31 years 8 months) Hillsboro, OR aka \"Polygon Pusher\" (You'd have to be one to know). Skills IC CMOS VLSI Analog Verilog SoC Debugging Mixed Signal Integrated Circuit... Microprocessors Analog Circuit Design Skills  IC CMOS VLSI Analog Verilog SoC Debugging Mixed Signal Integrated Circuit... Microprocessors Analog Circuit Design IC CMOS VLSI Analog Verilog SoC Debugging Mixed Signal Integrated Circuit... Microprocessors Analog Circuit Design IC CMOS VLSI Analog Verilog SoC Debugging Mixed Signal Integrated Circuit... Microprocessors Analog Circuit Design ", "Experience Mask Design Intel Corporation January 2000  –  January 2015  (15 years 1 month) Mask Design Intel Corporation January 2000  –  January 2015  (15 years 1 month) Mask Design Intel Corporation January 2000  –  January 2015  (15 years 1 month) "]}