{"position": "Materials Program Manager", "company": "Intel Corporation", "profiles": ["Summary Over 20 year of experience leading project teams and building strategic relationships with business partners and customers. I am a solid team player with strong interpersonal, communication and presentation skills. I enjoy a challenge and thrive when i am able to drive best practices in a challenging, complex space. \n \nKey Skills:  \n \nProgram Management  \nSupply Chain Management \nProduct Cost \nNew Product Introduction  \nMaterials Management \nData Center  \nStakeholder Communication  \nRisk Management for complex projects  \nCoaching and Mentoring  \nPLC Expertise \nPMP Certification  \nStrategic Planning  \nReverse Logistics  \nReturn Supply Chain \nWarranty Support Summary Over 20 year of experience leading project teams and building strategic relationships with business partners and customers. I am a solid team player with strong interpersonal, communication and presentation skills. I enjoy a challenge and thrive when i am able to drive best practices in a challenging, complex space. \n \nKey Skills:  \n \nProgram Management  \nSupply Chain Management \nProduct Cost \nNew Product Introduction  \nMaterials Management \nData Center  \nStakeholder Communication  \nRisk Management for complex projects  \nCoaching and Mentoring  \nPLC Expertise \nPMP Certification  \nStrategic Planning  \nReverse Logistics  \nReturn Supply Chain \nWarranty Support Over 20 year of experience leading project teams and building strategic relationships with business partners and customers. I am a solid team player with strong interpersonal, communication and presentation skills. I enjoy a challenge and thrive when i am able to drive best practices in a challenging, complex space. \n \nKey Skills:  \n \nProgram Management  \nSupply Chain Management \nProduct Cost \nNew Product Introduction  \nMaterials Management \nData Center  \nStakeholder Communication  \nRisk Management for complex projects  \nCoaching and Mentoring  \nPLC Expertise \nPMP Certification  \nStrategic Planning  \nReverse Logistics  \nReturn Supply Chain \nWarranty Support Over 20 year of experience leading project teams and building strategic relationships with business partners and customers. I am a solid team player with strong interpersonal, communication and presentation skills. I enjoy a challenge and thrive when i am able to drive best practices in a challenging, complex space. \n \nKey Skills:  \n \nProgram Management  \nSupply Chain Management \nProduct Cost \nNew Product Introduction  \nMaterials Management \nData Center  \nStakeholder Communication  \nRisk Management for complex projects  \nCoaching and Mentoring  \nPLC Expertise \nPMP Certification  \nStrategic Planning  \nReverse Logistics  \nReturn Supply Chain \nWarranty Support Experience Global Strategic Materials Manager Intel Corporation August 2014  – Present (1 year 1 month) Dupont, WA I own the global material strategy definition and execution in support of our Server business group. I lead a global team of experienced materials managers that drive the execution of the material strategy to ensure we meet our product cost targets and develop a stable and reliable supply chain. My team collaborates with product planning, engineering and the operations team to deliver server products that delight our customers. Supply Chain Management - Materials Program Manager Intel Corporation March 2014  –  August 2014  (6 months) Dupont, WA Drive component selection for new product introduction project. Engage with suppliers and product engineers to ensure we select components that are optimized for cost, delivery while minimizing risk to the overall supply chain. \n \nCurrently i am working on a project that is looking to significantly improve our supply chain efficiency and responsiveness. Program Manager - Reverse Logistics Intel Corporation January 2006  –  March 2014  (8 years 3 months) Dupont, WA Lead the strategy development, account management and worldwide product reverse logistics (returns supply chain) projects to support of our business unit partners’ strategic objectives. Lead cross functional/Geo teams to deliver complex projects on time, budget and scope. Well versed in Project Lifecycle management. Supply Chain Management - Materials Program Manager Intel Corporation May 2000  –  January 2006  (5 years 9 months) Dupont, WA Drove and implemented the sourcing strategy for Server products. Single point of contact for design engineers and the outsource design manufacturing (ODM) partners to ensure a smooth transition from new product introduction phase to high volume production. Project Controls Group Program Manager Intel Corporation 1998  –  2000  (2 years) Dupont, WA Supported design teams with effective project management practices and methodologies to ensure the success of their programs. Partnered with the design managers to develop project activities definitions, workflows and schedules to help them execute and control the project.  \n \nCollaborated with the teams on critical path and resource optimization analysis to identify opportunities for schedule improvement. Implemented a new project schedule infrastructure, including tools and indicator reporting. Commodity Specialist - Storage Intel Corporation 1996  –  1998  (2 years) Managed the hard disk drive commodity. Created and implemented strategic plans for supplier selection, contract negotiation and cost reduction programs. Customer and Materials Program Manager Intel Corporation February 1993  –  March 1996  (3 years 2 months) Managed the material sourcing strategy for HW programs. Worked with ODM and manufacturing partners on developing master schedule of the programs I supported. Global Strategic Materials Manager Intel Corporation August 2014  – Present (1 year 1 month) Dupont, WA I own the global material strategy definition and execution in support of our Server business group. I lead a global team of experienced materials managers that drive the execution of the material strategy to ensure we meet our product cost targets and develop a stable and reliable supply chain. My team collaborates with product planning, engineering and the operations team to deliver server products that delight our customers. Global Strategic Materials Manager Intel Corporation August 2014  – Present (1 year 1 month) Dupont, WA I own the global material strategy definition and execution in support of our Server business group. I lead a global team of experienced materials managers that drive the execution of the material strategy to ensure we meet our product cost targets and develop a stable and reliable supply chain. My team collaborates with product planning, engineering and the operations team to deliver server products that delight our customers. Supply Chain Management - Materials Program Manager Intel Corporation March 2014  –  August 2014  (6 months) Dupont, WA Drive component selection for new product introduction project. Engage with suppliers and product engineers to ensure we select components that are optimized for cost, delivery while minimizing risk to the overall supply chain. \n \nCurrently i am working on a project that is looking to significantly improve our supply chain efficiency and responsiveness. Supply Chain Management - Materials Program Manager Intel Corporation March 2014  –  August 2014  (6 months) Dupont, WA Drive component selection for new product introduction project. Engage with suppliers and product engineers to ensure we select components that are optimized for cost, delivery while minimizing risk to the overall supply chain. \n \nCurrently i am working on a project that is looking to significantly improve our supply chain efficiency and responsiveness. Program Manager - Reverse Logistics Intel Corporation January 2006  –  March 2014  (8 years 3 months) Dupont, WA Lead the strategy development, account management and worldwide product reverse logistics (returns supply chain) projects to support of our business unit partners’ strategic objectives. Lead cross functional/Geo teams to deliver complex projects on time, budget and scope. Well versed in Project Lifecycle management. Program Manager - Reverse Logistics Intel Corporation January 2006  –  March 2014  (8 years 3 months) Dupont, WA Lead the strategy development, account management and worldwide product reverse logistics (returns supply chain) projects to support of our business unit partners’ strategic objectives. Lead cross functional/Geo teams to deliver complex projects on time, budget and scope. Well versed in Project Lifecycle management. Supply Chain Management - Materials Program Manager Intel Corporation May 2000  –  January 2006  (5 years 9 months) Dupont, WA Drove and implemented the sourcing strategy for Server products. Single point of contact for design engineers and the outsource design manufacturing (ODM) partners to ensure a smooth transition from new product introduction phase to high volume production. Supply Chain Management - Materials Program Manager Intel Corporation May 2000  –  January 2006  (5 years 9 months) Dupont, WA Drove and implemented the sourcing strategy for Server products. Single point of contact for design engineers and the outsource design manufacturing (ODM) partners to ensure a smooth transition from new product introduction phase to high volume production. Project Controls Group Program Manager Intel Corporation 1998  –  2000  (2 years) Dupont, WA Supported design teams with effective project management practices and methodologies to ensure the success of their programs. Partnered with the design managers to develop project activities definitions, workflows and schedules to help them execute and control the project.  \n \nCollaborated with the teams on critical path and resource optimization analysis to identify opportunities for schedule improvement. Implemented a new project schedule infrastructure, including tools and indicator reporting. Project Controls Group Program Manager Intel Corporation 1998  –  2000  (2 years) Dupont, WA Supported design teams with effective project management practices and methodologies to ensure the success of their programs. Partnered with the design managers to develop project activities definitions, workflows and schedules to help them execute and control the project.  \n \nCollaborated with the teams on critical path and resource optimization analysis to identify opportunities for schedule improvement. Implemented a new project schedule infrastructure, including tools and indicator reporting. Commodity Specialist - Storage Intel Corporation 1996  –  1998  (2 years) Managed the hard disk drive commodity. Created and implemented strategic plans for supplier selection, contract negotiation and cost reduction programs. Commodity Specialist - Storage Intel Corporation 1996  –  1998  (2 years) Managed the hard disk drive commodity. Created and implemented strategic plans for supplier selection, contract negotiation and cost reduction programs. Customer and Materials Program Manager Intel Corporation February 1993  –  March 1996  (3 years 2 months) Managed the material sourcing strategy for HW programs. Worked with ODM and manufacturing partners on developing master schedule of the programs I supported. Customer and Materials Program Manager Intel Corporation February 1993  –  March 1996  (3 years 2 months) Managed the material sourcing strategy for HW programs. Worked with ODM and manufacturing partners on developing master schedule of the programs I supported. Languages English Native or bilingual proficiency Spanish Native or bilingual proficiency English Native or bilingual proficiency Spanish Native or bilingual proficiency English Native or bilingual proficiency Spanish Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Cross-functional Team... Program Management Semiconductors Product Management PMP Process Improvement Six Sigma Software Project... Project Management Vendor Management Integration Go-to-market Strategy Business Process... Business Analysis Strategy Product Lifecycle... Manufacturing Strategic Planning Master Scheduling Bilingual-English/Spanis... Supply Chain Management Customer Oriented Driving Results Management See 9+     See less Skills  Cross-functional Team... Program Management Semiconductors Product Management PMP Process Improvement Six Sigma Software Project... Project Management Vendor Management Integration Go-to-market Strategy Business Process... Business Analysis Strategy Product Lifecycle... Manufacturing Strategic Planning Master Scheduling Bilingual-English/Spanis... Supply Chain Management Customer Oriented Driving Results Management See 9+     See less Cross-functional Team... Program Management Semiconductors Product Management PMP Process Improvement Six Sigma Software Project... Project Management Vendor Management Integration Go-to-market Strategy Business Process... Business Analysis Strategy Product Lifecycle... Manufacturing Strategic Planning Master Scheduling Bilingual-English/Spanis... Supply Chain Management Customer Oriented Driving Results Management See 9+     See less Cross-functional Team... Program Management Semiconductors Product Management PMP Process Improvement Six Sigma Software Project... Project Management Vendor Management Integration Go-to-market Strategy Business Process... Business Analysis Strategy Product Lifecycle... Manufacturing Strategic Planning Master Scheduling Bilingual-English/Spanis... Supply Chain Management Customer Oriented Driving Results Management See 9+     See less Education Indiana University - Kelley School of Business MBA,  Finance 1990  – 1992 Masters Degree with a focus on finance and accounting. University of Puerto Rico BS,  Finance 1985  – 1988 Indiana University - Kelley School of Business MBA,  Finance 1990  – 1992 Masters Degree with a focus on finance and accounting. Indiana University - Kelley School of Business MBA,  Finance 1990  – 1992 Masters Degree with a focus on finance and accounting. Indiana University - Kelley School of Business MBA,  Finance 1990  – 1992 Masters Degree with a focus on finance and accounting. University of Puerto Rico BS,  Finance 1985  – 1988 University of Puerto Rico BS,  Finance 1985  – 1988 University of Puerto Rico BS,  Finance 1985  – 1988 ", "Experience Materials Program Manager Intel Corporation August 2011  – Present (4 years 1 month) NPI Specialist Tektronix August 2010  –  August 2011  (1 year 1 month) New Products Materials Program Manager LTX-Credence 1998  –  2008  (10 years) Materials Program Manager Intel Corporation August 2011  – Present (4 years 1 month) Materials Program Manager Intel Corporation August 2011  – Present (4 years 1 month) NPI Specialist Tektronix August 2010  –  August 2011  (1 year 1 month) NPI Specialist Tektronix August 2010  –  August 2011  (1 year 1 month) New Products Materials Program Manager LTX-Credence 1998  –  2008  (10 years) New Products Materials Program Manager LTX-Credence 1998  –  2008  (10 years) Skills materials program... working with off-shore... Inventory Management Cost Reduction... Production Managment Skills  materials program... working with off-shore... Inventory Management Cost Reduction... Production Managment materials program... working with off-shore... Inventory Management Cost Reduction... Production Managment materials program... working with off-shore... Inventory Management Cost Reduction... Production Managment ", "Experience Materials Program Manager Intel Corporation August 2012  – Present (3 years 1 month) Hillsboro Oregon Materials Program Manager Intel Corporation August 2012  – Present (3 years 1 month) Hillsboro Oregon Materials Program Manager Intel Corporation August 2012  – Present (3 years 1 month) Hillsboro Oregon ", "Experience Materials Program Manager Intel Corporation Production planner Neomagic Corporation 2004  –  2005  (1 year) Materials Program Manager Intel Corporation Materials Program Manager Intel Corporation Production planner Neomagic Corporation 2004  –  2005  (1 year) Production planner Neomagic Corporation 2004  –  2005  (1 year) Education Ryerson University 1999  – 2002 Ryerson University 1999  – 2002 Ryerson University 1999  – 2002 Ryerson University 1999  – 2002 ", "Experience Materials Program Manager Intel Corporation Materials Program Manager Intel Corporation Materials Program Manager Intel Corporation ", "Summary Specialties: Semi-fluent in German and Spanish. Proficient in Microsoft Suite & SQL. Summary Specialties: Semi-fluent in German and Spanish. Proficient in Microsoft Suite & SQL. Specialties: Semi-fluent in German and Spanish. Proficient in Microsoft Suite & SQL. Specialties: Semi-fluent in German and Spanish. Proficient in Microsoft Suite & SQL. Experience Materials Program Manager Intel Corporation July 2013  – Present (2 years 2 months) Hillsboro, OR •\tSupports MCG, Mobile Communications Group, by successfully launching platforms for smartphones, feature phones, tablets, and other devices. \n•\tSupports hardware platforms designed for testing Intel devices \n•\tCollaborates with Engineering to discuss and expand Research Design Vehicles (RDVs) in Supply Chain Management \n•\tUses tools including SAP ECC Production System, SPEED, Silicon Expert, Shopping Cart, etc. to research and employ new systems, components, and product engineering on RDVs Manufacturing Technician, Lithography, Portland Technology Development Intel Corporation August 2011  –  July 2013  (2 years) Hillsboro, OR •\tWorked on the development of products 1270/ 1272/ 1274 technologies \n•\tMaintained high yield and product throughput \n•\tTrained colleagues from national and international facilities \n•\tEscalated process errors to ensure product quality \n•\tInitiated and followed through with projects, which are done in a succinct matter \n•\tImproved team interaction and dynamics through facilitation of internal and external group activities Strongin Organic Chemistry Research Lab, Department of Chemistry, under Aabha Barve Portland State University January 2011  –  April 2011  (4 months) Portland, Oregon Area •\tOrganic compound synthesis \n•\tMolecular fluorescence and spectroscopy \n•\tMachines: Cary Eclipse Fluorescence spectrophotometer, pH meters, Rotatory Evaporators R-210 (Buchi) with DryFast Self-Cleaning Dry Vacuum System Model 2026 (Welch) Simoyi Physical Chemistry Research Lab, Department of Chemistry, Under Moshood 'Kayode' Morakinyo Portland State University February 2009  –  December 2010  (1 year 11 months) Portland, Oregon Area •\tKinetics and mechanism of oxidation of thiourea derivatives in acidic media \n•\tData extrapolation and analysis for calculations, analyzing, writing reports and presentations \n•\tInstruments: Stop Flow Spectrophotometer, EPR, H1NMR, GC-MS HiTech Scientific SF-61 Stopped Flow Spectrofluorimeter Single Mixing, Perkin Elmer λ 25 UV/Vis Spectroscopy, TLC, Paper and Column Chromatography Administrative Assistant AlphaGraphics June 2006  –  December 2007  (1 year 7 months) mailing, billing, data entry, accounts receivable/ payable Administrative Assistant JurisTrust 2003  –  2004  (1 year) contacting lawyers, mailing, sales representative Materials Program Manager Intel Corporation July 2013  – Present (2 years 2 months) Hillsboro, OR •\tSupports MCG, Mobile Communications Group, by successfully launching platforms for smartphones, feature phones, tablets, and other devices. \n•\tSupports hardware platforms designed for testing Intel devices \n•\tCollaborates with Engineering to discuss and expand Research Design Vehicles (RDVs) in Supply Chain Management \n•\tUses tools including SAP ECC Production System, SPEED, Silicon Expert, Shopping Cart, etc. to research and employ new systems, components, and product engineering on RDVs Materials Program Manager Intel Corporation July 2013  – Present (2 years 2 months) Hillsboro, OR •\tSupports MCG, Mobile Communications Group, by successfully launching platforms for smartphones, feature phones, tablets, and other devices. \n•\tSupports hardware platforms designed for testing Intel devices \n•\tCollaborates with Engineering to discuss and expand Research Design Vehicles (RDVs) in Supply Chain Management \n•\tUses tools including SAP ECC Production System, SPEED, Silicon Expert, Shopping Cart, etc. to research and employ new systems, components, and product engineering on RDVs Manufacturing Technician, Lithography, Portland Technology Development Intel Corporation August 2011  –  July 2013  (2 years) Hillsboro, OR •\tWorked on the development of products 1270/ 1272/ 1274 technologies \n•\tMaintained high yield and product throughput \n•\tTrained colleagues from national and international facilities \n•\tEscalated process errors to ensure product quality \n•\tInitiated and followed through with projects, which are done in a succinct matter \n•\tImproved team interaction and dynamics through facilitation of internal and external group activities Manufacturing Technician, Lithography, Portland Technology Development Intel Corporation August 2011  –  July 2013  (2 years) Hillsboro, OR •\tWorked on the development of products 1270/ 1272/ 1274 technologies \n•\tMaintained high yield and product throughput \n•\tTrained colleagues from national and international facilities \n•\tEscalated process errors to ensure product quality \n•\tInitiated and followed through with projects, which are done in a succinct matter \n•\tImproved team interaction and dynamics through facilitation of internal and external group activities Strongin Organic Chemistry Research Lab, Department of Chemistry, under Aabha Barve Portland State University January 2011  –  April 2011  (4 months) Portland, Oregon Area •\tOrganic compound synthesis \n•\tMolecular fluorescence and spectroscopy \n•\tMachines: Cary Eclipse Fluorescence spectrophotometer, pH meters, Rotatory Evaporators R-210 (Buchi) with DryFast Self-Cleaning Dry Vacuum System Model 2026 (Welch) Strongin Organic Chemistry Research Lab, Department of Chemistry, under Aabha Barve Portland State University January 2011  –  April 2011  (4 months) Portland, Oregon Area •\tOrganic compound synthesis \n•\tMolecular fluorescence and spectroscopy \n•\tMachines: Cary Eclipse Fluorescence spectrophotometer, pH meters, Rotatory Evaporators R-210 (Buchi) with DryFast Self-Cleaning Dry Vacuum System Model 2026 (Welch) Simoyi Physical Chemistry Research Lab, Department of Chemistry, Under Moshood 'Kayode' Morakinyo Portland State University February 2009  –  December 2010  (1 year 11 months) Portland, Oregon Area •\tKinetics and mechanism of oxidation of thiourea derivatives in acidic media \n•\tData extrapolation and analysis for calculations, analyzing, writing reports and presentations \n•\tInstruments: Stop Flow Spectrophotometer, EPR, H1NMR, GC-MS HiTech Scientific SF-61 Stopped Flow Spectrofluorimeter Single Mixing, Perkin Elmer λ 25 UV/Vis Spectroscopy, TLC, Paper and Column Chromatography Simoyi Physical Chemistry Research Lab, Department of Chemistry, Under Moshood 'Kayode' Morakinyo Portland State University February 2009  –  December 2010  (1 year 11 months) Portland, Oregon Area •\tKinetics and mechanism of oxidation of thiourea derivatives in acidic media \n•\tData extrapolation and analysis for calculations, analyzing, writing reports and presentations \n•\tInstruments: Stop Flow Spectrophotometer, EPR, H1NMR, GC-MS HiTech Scientific SF-61 Stopped Flow Spectrofluorimeter Single Mixing, Perkin Elmer λ 25 UV/Vis Spectroscopy, TLC, Paper and Column Chromatography Administrative Assistant AlphaGraphics June 2006  –  December 2007  (1 year 7 months) mailing, billing, data entry, accounts receivable/ payable Administrative Assistant AlphaGraphics June 2006  –  December 2007  (1 year 7 months) mailing, billing, data entry, accounts receivable/ payable Administrative Assistant JurisTrust 2003  –  2004  (1 year) contacting lawyers, mailing, sales representative Administrative Assistant JurisTrust 2003  –  2004  (1 year) contacting lawyers, mailing, sales representative Languages English Native or bilingual proficiency German Limited working proficiency Spanish Limited working proficiency English Native or bilingual proficiency German Limited working proficiency Spanish Limited working proficiency English Native or bilingual proficiency German Limited working proficiency Spanish Limited working proficiency Native or bilingual proficiency Limited working proficiency Limited working proficiency Skills Differential Equations Calculus Physical Chemistry Organic Synthesis Complex Analysis Statistical Analysis Percent Error Data Analysis Microsoft Office SQL Kintecus Mathlab Matlab MathCAD Spartan Labview Statistics GC-MS NMR spectroscopy Nanomaterials UV/Vis See 6+     See less Skills  Differential Equations Calculus Physical Chemistry Organic Synthesis Complex Analysis Statistical Analysis Percent Error Data Analysis Microsoft Office SQL Kintecus Mathlab Matlab MathCAD Spartan Labview Statistics GC-MS NMR spectroscopy Nanomaterials UV/Vis See 6+     See less Differential Equations Calculus Physical Chemistry Organic Synthesis Complex Analysis Statistical Analysis Percent Error Data Analysis Microsoft Office SQL Kintecus Mathlab Matlab MathCAD Spartan Labview Statistics GC-MS NMR spectroscopy Nanomaterials UV/Vis See 6+     See less Differential Equations Calculus Physical Chemistry Organic Synthesis Complex Analysis Statistical Analysis Percent Error Data Analysis Microsoft Office SQL Kintecus Mathlab Matlab MathCAD Spartan Labview Statistics GC-MS NMR spectroscopy Nanomaterials UV/Vis See 6+     See less Education Portland State University BS,  Chemistry ,  Mathematics 2006  – 2010 Activities and Societies:  chemical kinetics Goethe Institut Dresden German 2006  – 2006 University of Oregon Chemistry ,  German 2005  – 2006 Activities and Societies:  Swim Team Seattle University Chemistry 2004  – 2005 Activities and Societies:  Model UN Portland State University BS,  Chemistry ,  Mathematics 2006  – 2010 Activities and Societies:  chemical kinetics Portland State University BS,  Chemistry ,  Mathematics 2006  – 2010 Activities and Societies:  chemical kinetics Portland State University BS,  Chemistry ,  Mathematics 2006  – 2010 Activities and Societies:  chemical kinetics Goethe Institut Dresden German 2006  – 2006 Goethe Institut Dresden German 2006  – 2006 Goethe Institut Dresden German 2006  – 2006 University of Oregon Chemistry ,  German 2005  – 2006 Activities and Societies:  Swim Team University of Oregon Chemistry ,  German 2005  – 2006 Activities and Societies:  Swim Team University of Oregon Chemistry ,  German 2005  – 2006 Activities and Societies:  Swim Team Seattle University Chemistry 2004  – 2005 Activities and Societies:  Model UN Seattle University Chemistry 2004  – 2005 Activities and Societies:  Model UN Seattle University Chemistry 2004  – 2005 Activities and Societies:  Model UN ", "Languages Gujarati,  Gujarati,  Gujarati,  Skills Program Management Product Development Supplier Management Account Management Supply Chain Management Operations Management Business Process... Supply Management Negotiation Management Strategic Planning Project Planning Manufacturing Leadership Cross-functional Team... Skills  Program Management Product Development Supplier Management Account Management Supply Chain Management Operations Management Business Process... Supply Management Negotiation Management Strategic Planning Project Planning Manufacturing Leadership Cross-functional Team... Program Management Product Development Supplier Management Account Management Supply Chain Management Operations Management Business Process... Supply Management Negotiation Management Strategic Planning Project Planning Manufacturing Leadership Cross-functional Team... Program Management Product Development Supplier Management Account Management Supply Chain Management Operations Management Business Process... Supply Management Negotiation Management Strategic Planning Project Planning Manufacturing Leadership Cross-functional Team... ", "Experience Category Manager CommScope 2014  – Present (1 year) Dallas/Fort Worth Area Materials Program Manager Intel Corporation May 2012  –  April 2014  (2 years) Hillsboro, OR Commodity Specialist Intel Corporation July 2005  –  June 2012  (7 years) Systems Engineer (Hardware) Northrop Grumman August 1998  –  July 2003  (5 years) Aerospace Engineer US Army AMCOM August 1996  –  August 1998  (2 years 1 month) Category Manager CommScope 2014  – Present (1 year) Dallas/Fort Worth Area Category Manager CommScope 2014  – Present (1 year) Dallas/Fort Worth Area Materials Program Manager Intel Corporation May 2012  –  April 2014  (2 years) Hillsboro, OR Materials Program Manager Intel Corporation May 2012  –  April 2014  (2 years) Hillsboro, OR Commodity Specialist Intel Corporation July 2005  –  June 2012  (7 years) Commodity Specialist Intel Corporation July 2005  –  June 2012  (7 years) Systems Engineer (Hardware) Northrop Grumman August 1998  –  July 2003  (5 years) Systems Engineer (Hardware) Northrop Grumman August 1998  –  July 2003  (5 years) Aerospace Engineer US Army AMCOM August 1996  –  August 1998  (2 years 1 month) Aerospace Engineer US Army AMCOM August 1996  –  August 1998  (2 years 1 month) Skills Supply Chain Operations Strategic Sourcing Contract Negotiation Requirements Management Systems Engineering Materials Management DFC Competitive Analysis Engineering Six Sigma Process Engineering Process Improvement Cross-functional Team... Global Sourcing Manufacturing Program Management Supply Chain Semiconductor Industry Root Cause Analysis Lean Manufacturing Design of Experiments MRP Engineering Management Product Development Electronics Procurement Continuous Improvement See 12+     See less Skills  Supply Chain Operations Strategic Sourcing Contract Negotiation Requirements Management Systems Engineering Materials Management DFC Competitive Analysis Engineering Six Sigma Process Engineering Process Improvement Cross-functional Team... Global Sourcing Manufacturing Program Management Supply Chain Semiconductor Industry Root Cause Analysis Lean Manufacturing Design of Experiments MRP Engineering Management Product Development Electronics Procurement Continuous Improvement See 12+     See less Supply Chain Operations Strategic Sourcing Contract Negotiation Requirements Management Systems Engineering Materials Management DFC Competitive Analysis Engineering Six Sigma Process Engineering Process Improvement Cross-functional Team... Global Sourcing Manufacturing Program Management Supply Chain Semiconductor Industry Root Cause Analysis Lean Manufacturing Design of Experiments MRP Engineering Management Product Development Electronics Procurement Continuous Improvement See 12+     See less Supply Chain Operations Strategic Sourcing Contract Negotiation Requirements Management Systems Engineering Materials Management DFC Competitive Analysis Engineering Six Sigma Process Engineering Process Improvement Cross-functional Team... Global Sourcing Manufacturing Program Management Supply Chain Semiconductor Industry Root Cause Analysis Lean Manufacturing Design of Experiments MRP Engineering Management Product Development Electronics Procurement Continuous Improvement See 12+     See less Education University of Maryland - Robert H. Smith School of Business MBA 2003  – 2005 Cornell University M.Eng. 1995  – 1996 University of Michigan BSE 1991  – 1995 University of Maryland - Robert H. Smith School of Business MBA 2003  – 2005 University of Maryland - Robert H. Smith School of Business MBA 2003  – 2005 University of Maryland - Robert H. Smith School of Business MBA 2003  – 2005 Cornell University M.Eng. 1995  – 1996 Cornell University M.Eng. 1995  – 1996 Cornell University M.Eng. 1995  – 1996 University of Michigan BSE 1991  – 1995 University of Michigan BSE 1991  – 1995 University of Michigan BSE 1991  – 1995 ", "Experience NPI Materials Program Manager Intel Corporation February 2013  – Present (2 years 7 months) Hillsboro, OR Materials Program Manager Oracle September 2011  –  February 2013  (1 year 6 months) Hillsboro, OR NPI Materials Prog. Manager Novellus Systems July 2007  –  September 2011  (4 years 3 months) Supplier Quality Engineer Novellus Systems April 2006  –  July 2007  (1 year 4 months) Tualatin Oregon Supply Chain/Quality Engineer Xerox January 2001  –  April 2006  (5 years 4 months) Chemistry Student Portland State University 1995  –  1997  (2 years) NPI Materials Program Manager Intel Corporation February 2013  – Present (2 years 7 months) Hillsboro, OR NPI Materials Program Manager Intel Corporation February 2013  – Present (2 years 7 months) Hillsboro, OR Materials Program Manager Oracle September 2011  –  February 2013  (1 year 6 months) Hillsboro, OR Materials Program Manager Oracle September 2011  –  February 2013  (1 year 6 months) Hillsboro, OR NPI Materials Prog. Manager Novellus Systems July 2007  –  September 2011  (4 years 3 months) NPI Materials Prog. Manager Novellus Systems July 2007  –  September 2011  (4 years 3 months) Supplier Quality Engineer Novellus Systems April 2006  –  July 2007  (1 year 4 months) Tualatin Oregon Supplier Quality Engineer Novellus Systems April 2006  –  July 2007  (1 year 4 months) Tualatin Oregon Supply Chain/Quality Engineer Xerox January 2001  –  April 2006  (5 years 4 months) Supply Chain/Quality Engineer Xerox January 2001  –  April 2006  (5 years 4 months) Chemistry Student Portland State University 1995  –  1997  (2 years) Chemistry Student Portland State University 1995  –  1997  (2 years) Skills Semiconductors Cross-functional Team... Skills  Semiconductors Cross-functional Team... Semiconductors Cross-functional Team... Semiconductors Cross-functional Team... Education Portland State University BS,  Chemistry , Physics Portland State University BS,  Chemistry , Physics Portland State University BS,  Chemistry , Physics Portland State University BS,  Chemistry , Physics ", "Experience Materials Program Manager Intel Corporation Materials Program Manager Intel Corporation Materials Program Manager Intel Corporation ", "Experience HVM Materials Program Manager Intel Corporation January 2015  – Present (8 months) Kedah, Malaysia Responsibilities: \n- Material planning and management of programs/projects to meet specific goals and objectives.  \n- Work closely in collaboration with NPI Program Mgrs, Design Engineers, Commodity Management, and Factory Manufacturing Teams to define customer demand requirements, early raw material requirements, influencing supplier and component selections, and driving planning and procurement activities for raw materials, equipment, tools, etc.  \n- Ensure bill of materials integrity, material availability, cost and quality goals are successfully achieved.  \n- Provide material risk assessments/status to all stakeholders including multiple management levels, establish contingency and gap closure plans, and monitor & track program indicators.  \n- Uses judgment in data analysis to develop and design solutions for moderately complex processes. \n IT Project Manager Plexus Corp. May 2014  –  December 2014  (8 months) Penang, Malaysia Responsibilities: \n- Manage projects in accordance with the best practice project management methodologies and company guidelines. \n- Ensures that multiple projects meet specified timelines and deliver expected results. \n- Manage and monitor project schedules, progress and costs to ensure that expected results are delivered on time and within budget. \n- Consolidate, communicate and ensure resolution of all issues. \n- Represent IT on cross-functional project teams. \n- Assess project health and direct any necessary corrective measures. \n- Evaluate and manage project change impacts. \n- Creatively apply project management processes to address unique situations. IT Functional Manager (Factory Materials Applications) Intel Technology Malaysia August 2013  –  May 2014  (10 months) Penang, Malaysia Led a global team (US, India and Malaysia) to enhance customer focus, providing account management for production support, ownership of critical success indicators, and ensuring overall service health for Intel’s mission critical applications such as “Factory Materials Inventory Management” in Sourcing Supply Chain functional area. David’s mission is to quickly the restore the health of the production support area and define a long term sustainable strategy for this functional area with his experience and leadership. Within months of analyzing on the problems, listening to the stakeholders and reform the key resources in the team, he had successfully developed various short term recovery plan and a long term organization restructuring plan that helped to regain the confidence of the stakeholder towards the IT Services provided. 2 Divisional Recognition had been awarded for his great contribution in handling new outsource vendor transition and worldwide server migration project.  \n \nThroughout this assignment, he received various recognition from the stakeholders as below: \n \n“Thank you for showing such patience and motivation to deal with all the IT KTBR issues in Factory Materials right now. You are keeping all of us motivated too, and is helping us to see the light. As customers and partners, we really do appreciate your work...” \n \n“David, you’re doing a fantastic job keeping on top of this stuff, and reporting out etc……… Thanks for doing such a great job!!!” \n \n“David, thank you for all the hard work and results orientation you’ve displayed day in and day out in the Factory Materials space. Your leadership, energy, and results focused is helping us drive the right improvements. Thank you!” System Analyst - Team Lead Intel Technology Malaysia November 2010  –  August 2013  (2 years 10 months) Intel Technology S/B Managing a group of 7 contractual workers AD based in India and leads 7 local employees (2 ADs & 4 SAs) that responsible for Development and Production Support for supplier web based applications. \nAccomplished 3 projects life cycles (.Net) with zero production defect.  \n \nChampion the ITIL Framework with GREAT results such as:  \n1.\tDramatically reduced Major Incidents by 60%, exceeding the Department goal by 30% and achieving the reduction half a year in advance.  \n2.\tAccomplish the department goal of 50% incidents reductions within a year.  \n3.\tExceeded the department reduction goal by moving from being reactive to proactive and addressing issues before they became Major Incidents through the use of data to drive improvements, reducing aging tickets by over 60%, and reducing outstanding problems in the environment by 50%. \n \nOff-work: Leader of the Malaysia Site - Great Place to Work Committee, Organizing Committee for the Leader Development Conference and Employee Development Conference. Winner of Top 10 Malaysia Volunteers in the Company for the year 2010. SAP ABAP Developer - Team Lead Intel Technology Malaysia July 2009  –  October 2010  (1 year 4 months) Intel Technology S/B Lead a team that consists of 2 local permanent employees and 1 contractual worker based in US. \n \nInvolve in coding for bug fix, batch job monitoring, managing continuous improvement project and production support operations. SAP L1 Support Intel Technology Malaysia June 2007  –  September 2009  (2 years 4 months) Intel Technology S/B Hired to be Intel Permanent Employee after the outstanding performance under Intradeco S/B.  \n \nBeing the Subject Matter Expert in the team for SAP MM Module. \n \nSuccessfully improved the Team's Resolution Rate, Customer Satisfaction and Remedy Ticket Quality from average to 80% and above. SAP Level 1 Support - Team Lead Intradeco Sdn Bhd February 2006  –  May 2007  (1 year 4 months) Intel Technology S/B Lead the team operations that consist of 7 team members to support the Intel Employees globally on SAP application technical matters.  \n \nAwarded \"Year 2006 Best Employee Achievement Award\" Technical Support Analyst Intradeco Sdn Bhd February 2005  –  October 2005  (9 months) Intel Technology S/B Provide Level 1 Technical Support to Intel Technology employees such as Windows, Ms Office, Outlook, Network Connectivity, VPN, Hardware configuration and etc. HVM Materials Program Manager Intel Corporation January 2015  – Present (8 months) Kedah, Malaysia Responsibilities: \n- Material planning and management of programs/projects to meet specific goals and objectives.  \n- Work closely in collaboration with NPI Program Mgrs, Design Engineers, Commodity Management, and Factory Manufacturing Teams to define customer demand requirements, early raw material requirements, influencing supplier and component selections, and driving planning and procurement activities for raw materials, equipment, tools, etc.  \n- Ensure bill of materials integrity, material availability, cost and quality goals are successfully achieved.  \n- Provide material risk assessments/status to all stakeholders including multiple management levels, establish contingency and gap closure plans, and monitor & track program indicators.  \n- Uses judgment in data analysis to develop and design solutions for moderately complex processes. \n HVM Materials Program Manager Intel Corporation January 2015  – Present (8 months) Kedah, Malaysia Responsibilities: \n- Material planning and management of programs/projects to meet specific goals and objectives.  \n- Work closely in collaboration with NPI Program Mgrs, Design Engineers, Commodity Management, and Factory Manufacturing Teams to define customer demand requirements, early raw material requirements, influencing supplier and component selections, and driving planning and procurement activities for raw materials, equipment, tools, etc.  \n- Ensure bill of materials integrity, material availability, cost and quality goals are successfully achieved.  \n- Provide material risk assessments/status to all stakeholders including multiple management levels, establish contingency and gap closure plans, and monitor & track program indicators.  \n- Uses judgment in data analysis to develop and design solutions for moderately complex processes. \n IT Project Manager Plexus Corp. May 2014  –  December 2014  (8 months) Penang, Malaysia Responsibilities: \n- Manage projects in accordance with the best practice project management methodologies and company guidelines. \n- Ensures that multiple projects meet specified timelines and deliver expected results. \n- Manage and monitor project schedules, progress and costs to ensure that expected results are delivered on time and within budget. \n- Consolidate, communicate and ensure resolution of all issues. \n- Represent IT on cross-functional project teams. \n- Assess project health and direct any necessary corrective measures. \n- Evaluate and manage project change impacts. \n- Creatively apply project management processes to address unique situations. IT Project Manager Plexus Corp. May 2014  –  December 2014  (8 months) Penang, Malaysia Responsibilities: \n- Manage projects in accordance with the best practice project management methodologies and company guidelines. \n- Ensures that multiple projects meet specified timelines and deliver expected results. \n- Manage and monitor project schedules, progress and costs to ensure that expected results are delivered on time and within budget. \n- Consolidate, communicate and ensure resolution of all issues. \n- Represent IT on cross-functional project teams. \n- Assess project health and direct any necessary corrective measures. \n- Evaluate and manage project change impacts. \n- Creatively apply project management processes to address unique situations. IT Functional Manager (Factory Materials Applications) Intel Technology Malaysia August 2013  –  May 2014  (10 months) Penang, Malaysia Led a global team (US, India and Malaysia) to enhance customer focus, providing account management for production support, ownership of critical success indicators, and ensuring overall service health for Intel’s mission critical applications such as “Factory Materials Inventory Management” in Sourcing Supply Chain functional area. David’s mission is to quickly the restore the health of the production support area and define a long term sustainable strategy for this functional area with his experience and leadership. Within months of analyzing on the problems, listening to the stakeholders and reform the key resources in the team, he had successfully developed various short term recovery plan and a long term organization restructuring plan that helped to regain the confidence of the stakeholder towards the IT Services provided. 2 Divisional Recognition had been awarded for his great contribution in handling new outsource vendor transition and worldwide server migration project.  \n \nThroughout this assignment, he received various recognition from the stakeholders as below: \n \n“Thank you for showing such patience and motivation to deal with all the IT KTBR issues in Factory Materials right now. You are keeping all of us motivated too, and is helping us to see the light. As customers and partners, we really do appreciate your work...” \n \n“David, you’re doing a fantastic job keeping on top of this stuff, and reporting out etc……… Thanks for doing such a great job!!!” \n \n“David, thank you for all the hard work and results orientation you’ve displayed day in and day out in the Factory Materials space. Your leadership, energy, and results focused is helping us drive the right improvements. Thank you!” IT Functional Manager (Factory Materials Applications) Intel Technology Malaysia August 2013  –  May 2014  (10 months) Penang, Malaysia Led a global team (US, India and Malaysia) to enhance customer focus, providing account management for production support, ownership of critical success indicators, and ensuring overall service health for Intel’s mission critical applications such as “Factory Materials Inventory Management” in Sourcing Supply Chain functional area. David’s mission is to quickly the restore the health of the production support area and define a long term sustainable strategy for this functional area with his experience and leadership. Within months of analyzing on the problems, listening to the stakeholders and reform the key resources in the team, he had successfully developed various short term recovery plan and a long term organization restructuring plan that helped to regain the confidence of the stakeholder towards the IT Services provided. 2 Divisional Recognition had been awarded for his great contribution in handling new outsource vendor transition and worldwide server migration project.  \n \nThroughout this assignment, he received various recognition from the stakeholders as below: \n \n“Thank you for showing such patience and motivation to deal with all the IT KTBR issues in Factory Materials right now. You are keeping all of us motivated too, and is helping us to see the light. As customers and partners, we really do appreciate your work...” \n \n“David, you’re doing a fantastic job keeping on top of this stuff, and reporting out etc……… Thanks for doing such a great job!!!” \n \n“David, thank you for all the hard work and results orientation you’ve displayed day in and day out in the Factory Materials space. Your leadership, energy, and results focused is helping us drive the right improvements. Thank you!” System Analyst - Team Lead Intel Technology Malaysia November 2010  –  August 2013  (2 years 10 months) Intel Technology S/B Managing a group of 7 contractual workers AD based in India and leads 7 local employees (2 ADs & 4 SAs) that responsible for Development and Production Support for supplier web based applications. \nAccomplished 3 projects life cycles (.Net) with zero production defect.  \n \nChampion the ITIL Framework with GREAT results such as:  \n1.\tDramatically reduced Major Incidents by 60%, exceeding the Department goal by 30% and achieving the reduction half a year in advance.  \n2.\tAccomplish the department goal of 50% incidents reductions within a year.  \n3.\tExceeded the department reduction goal by moving from being reactive to proactive and addressing issues before they became Major Incidents through the use of data to drive improvements, reducing aging tickets by over 60%, and reducing outstanding problems in the environment by 50%. \n \nOff-work: Leader of the Malaysia Site - Great Place to Work Committee, Organizing Committee for the Leader Development Conference and Employee Development Conference. Winner of Top 10 Malaysia Volunteers in the Company for the year 2010. System Analyst - Team Lead Intel Technology Malaysia November 2010  –  August 2013  (2 years 10 months) Intel Technology S/B Managing a group of 7 contractual workers AD based in India and leads 7 local employees (2 ADs & 4 SAs) that responsible for Development and Production Support for supplier web based applications. \nAccomplished 3 projects life cycles (.Net) with zero production defect.  \n \nChampion the ITIL Framework with GREAT results such as:  \n1.\tDramatically reduced Major Incidents by 60%, exceeding the Department goal by 30% and achieving the reduction half a year in advance.  \n2.\tAccomplish the department goal of 50% incidents reductions within a year.  \n3.\tExceeded the department reduction goal by moving from being reactive to proactive and addressing issues before they became Major Incidents through the use of data to drive improvements, reducing aging tickets by over 60%, and reducing outstanding problems in the environment by 50%. \n \nOff-work: Leader of the Malaysia Site - Great Place to Work Committee, Organizing Committee for the Leader Development Conference and Employee Development Conference. Winner of Top 10 Malaysia Volunteers in the Company for the year 2010. SAP ABAP Developer - Team Lead Intel Technology Malaysia July 2009  –  October 2010  (1 year 4 months) Intel Technology S/B Lead a team that consists of 2 local permanent employees and 1 contractual worker based in US. \n \nInvolve in coding for bug fix, batch job monitoring, managing continuous improvement project and production support operations. SAP ABAP Developer - Team Lead Intel Technology Malaysia July 2009  –  October 2010  (1 year 4 months) Intel Technology S/B Lead a team that consists of 2 local permanent employees and 1 contractual worker based in US. \n \nInvolve in coding for bug fix, batch job monitoring, managing continuous improvement project and production support operations. SAP L1 Support Intel Technology Malaysia June 2007  –  September 2009  (2 years 4 months) Intel Technology S/B Hired to be Intel Permanent Employee after the outstanding performance under Intradeco S/B.  \n \nBeing the Subject Matter Expert in the team for SAP MM Module. \n \nSuccessfully improved the Team's Resolution Rate, Customer Satisfaction and Remedy Ticket Quality from average to 80% and above. SAP L1 Support Intel Technology Malaysia June 2007  –  September 2009  (2 years 4 months) Intel Technology S/B Hired to be Intel Permanent Employee after the outstanding performance under Intradeco S/B.  \n \nBeing the Subject Matter Expert in the team for SAP MM Module. \n \nSuccessfully improved the Team's Resolution Rate, Customer Satisfaction and Remedy Ticket Quality from average to 80% and above. SAP Level 1 Support - Team Lead Intradeco Sdn Bhd February 2006  –  May 2007  (1 year 4 months) Intel Technology S/B Lead the team operations that consist of 7 team members to support the Intel Employees globally on SAP application technical matters.  \n \nAwarded \"Year 2006 Best Employee Achievement Award\" SAP Level 1 Support - Team Lead Intradeco Sdn Bhd February 2006  –  May 2007  (1 year 4 months) Intel Technology S/B Lead the team operations that consist of 7 team members to support the Intel Employees globally on SAP application technical matters.  \n \nAwarded \"Year 2006 Best Employee Achievement Award\" Technical Support Analyst Intradeco Sdn Bhd February 2005  –  October 2005  (9 months) Intel Technology S/B Provide Level 1 Technical Support to Intel Technology employees such as Windows, Ms Office, Outlook, Network Connectivity, VPN, Hardware configuration and etc. Technical Support Analyst Intradeco Sdn Bhd February 2005  –  October 2005  (9 months) Intel Technology S/B Provide Level 1 Technical Support to Intel Technology employees such as Windows, Ms Office, Outlook, Network Connectivity, VPN, Hardware configuration and etc. Languages English Professional working proficiency Chinese Professional working proficiency Malay Professional working proficiency English Professional working proficiency Chinese Professional working proficiency Malay Professional working proficiency English Professional working proficiency Chinese Professional working proficiency Malay Professional working proficiency Professional working proficiency Professional working proficiency Professional working proficiency Skills Team Leadership Vendor Management Customer Service Software Project... SAP SRM SAP R/3 ABAP ITIL Call Center Incident Management Service Operations Problem Management Major Incident... Process Improvement Change Management IT Service Management SAP Outsourcing Project Management Team Management Management Leadership Integration Business Process Business Analysis IT Operations Call Centers Cross-functional Team... IT Management Program Management Analysis Testing See 17+     See less Skills  Team Leadership Vendor Management Customer Service Software Project... SAP SRM SAP R/3 ABAP ITIL Call Center Incident Management Service Operations Problem Management Major Incident... Process Improvement Change Management IT Service Management SAP Outsourcing Project Management Team Management Management Leadership Integration Business Process Business Analysis IT Operations Call Centers Cross-functional Team... IT Management Program Management Analysis Testing See 17+     See less Team Leadership Vendor Management Customer Service Software Project... SAP SRM SAP R/3 ABAP ITIL Call Center Incident Management Service Operations Problem Management Major Incident... Process Improvement Change Management IT Service Management SAP Outsourcing Project Management Team Management Management Leadership Integration Business Process Business Analysis IT Operations Call Centers Cross-functional Team... IT Management Program Management Analysis Testing See 17+     See less Team Leadership Vendor Management Customer Service Software Project... SAP SRM SAP R/3 ABAP ITIL Call Center Incident Management Service Operations Problem Management Major Incident... Process Improvement Change Management IT Service Management SAP Outsourcing Project Management Team Management Management Leadership Integration Business Process Business Analysis IT Operations Call Centers Cross-functional Team... IT Management Program Management Analysis Testing See 17+     See less Education The University of Bolton Master Degree in Science,  Supply Chain Management 2008  – 2010 Campbell University Degree in Science,  Computer Science and Mathematics 2003  – 2005 Tunku Abdul Rahman College Advance Diploma,  Computer Science and Mathematics 2001  – 2005 Student Leader for the year 2002/2003 Penang, President of Photography Society and Treasurer of First Aid Society. Activities and Societies:  Student Leader of the year 2002/2003 ,  President of the Photography Society 2002/2003 ,  Asst. Treasurer of the First Aid Society 2001/2002 ,  Asst. Public Relationship office of the Student Welfare 2001/2002 Chung Ling High School High School,  Pure Science , SPM 1996  – 2000 Activities and Societies:  Member of Health Waden Officer ,  Member of Board of Monitors ,  Asst. Treasurer of Basketball Club ,  Chairperson of Chinese Calligraphy Society ,  Member of Leo Club ,  Member of Junior Jaycees and etc... The University of Bolton Master Degree in Science,  Supply Chain Management 2008  – 2010 The University of Bolton Master Degree in Science,  Supply Chain Management 2008  – 2010 The University of Bolton Master Degree in Science,  Supply Chain Management 2008  – 2010 Campbell University Degree in Science,  Computer Science and Mathematics 2003  – 2005 Campbell University Degree in Science,  Computer Science and Mathematics 2003  – 2005 Campbell University Degree in Science,  Computer Science and Mathematics 2003  – 2005 Tunku Abdul Rahman College Advance Diploma,  Computer Science and Mathematics 2001  – 2005 Student Leader for the year 2002/2003 Penang, President of Photography Society and Treasurer of First Aid Society. Activities and Societies:  Student Leader of the year 2002/2003 ,  President of the Photography Society 2002/2003 ,  Asst. Treasurer of the First Aid Society 2001/2002 ,  Asst. Public Relationship office of the Student Welfare 2001/2002 Tunku Abdul Rahman College Advance Diploma,  Computer Science and Mathematics 2001  – 2005 Student Leader for the year 2002/2003 Penang, President of Photography Society and Treasurer of First Aid Society. Activities and Societies:  Student Leader of the year 2002/2003 ,  President of the Photography Society 2002/2003 ,  Asst. Treasurer of the First Aid Society 2001/2002 ,  Asst. Public Relationship office of the Student Welfare 2001/2002 Tunku Abdul Rahman College Advance Diploma,  Computer Science and Mathematics 2001  – 2005 Student Leader for the year 2002/2003 Penang, President of Photography Society and Treasurer of First Aid Society. Activities and Societies:  Student Leader of the year 2002/2003 ,  President of the Photography Society 2002/2003 ,  Asst. Treasurer of the First Aid Society 2001/2002 ,  Asst. Public Relationship office of the Student Welfare 2001/2002 Chung Ling High School High School,  Pure Science , SPM 1996  – 2000 Activities and Societies:  Member of Health Waden Officer ,  Member of Board of Monitors ,  Asst. Treasurer of Basketball Club ,  Chairperson of Chinese Calligraphy Society ,  Member of Leo Club ,  Member of Junior Jaycees and etc... Chung Ling High School High School,  Pure Science , SPM 1996  – 2000 Activities and Societies:  Member of Health Waden Officer ,  Member of Board of Monitors ,  Asst. Treasurer of Basketball Club ,  Chairperson of Chinese Calligraphy Society ,  Member of Leo Club ,  Member of Junior Jaycees and etc... Chung Ling High School High School,  Pure Science , SPM 1996  – 2000 Activities and Societies:  Member of Health Waden Officer ,  Member of Board of Monitors ,  Asst. Treasurer of Basketball Club ,  Chairperson of Chinese Calligraphy Society ,  Member of Leo Club ,  Member of Junior Jaycees and etc... Honors & Awards Best Employee of the Year 2006 Intradeco Sdn Bhd February 2007 Excellent Employee Recognition from the Corp.  Best Employee of the Year 2006 Intradeco Sdn Bhd February 2007 Excellent Employee Recognition from the Corp.  Best Employee of the Year 2006 Intradeco Sdn Bhd February 2007 Excellent Employee Recognition from the Corp.  Best Employee of the Year 2006 Intradeco Sdn Bhd February 2007 Excellent Employee Recognition from the Corp.  ", "Summary Materials Program Manager with broad experience in supply chain management including cost savings, material availability or on-time delivery, customer satisfaction and inventory control, and contract negotiations, Proven track record in performance and accountability management, having been honored to receive several recognitions from management and customers for role modeling, risk taking, and results orientation. Self-motivated, high achieving team player with strong communication skills. Specialties:Purchasing, SAP, MRP Systems, Inventory Management, Inventory Control Methodology, contract negotiation, program management, mergers and acquisitions Summary Materials Program Manager with broad experience in supply chain management including cost savings, material availability or on-time delivery, customer satisfaction and inventory control, and contract negotiations, Proven track record in performance and accountability management, having been honored to receive several recognitions from management and customers for role modeling, risk taking, and results orientation. Self-motivated, high achieving team player with strong communication skills. Specialties:Purchasing, SAP, MRP Systems, Inventory Management, Inventory Control Methodology, contract negotiation, program management, mergers and acquisitions Materials Program Manager with broad experience in supply chain management including cost savings, material availability or on-time delivery, customer satisfaction and inventory control, and contract negotiations, Proven track record in performance and accountability management, having been honored to receive several recognitions from management and customers for role modeling, risk taking, and results orientation. Self-motivated, high achieving team player with strong communication skills. Specialties:Purchasing, SAP, MRP Systems, Inventory Management, Inventory Control Methodology, contract negotiation, program management, mergers and acquisitions Materials Program Manager with broad experience in supply chain management including cost savings, material availability or on-time delivery, customer satisfaction and inventory control, and contract negotiations, Proven track record in performance and accountability management, having been honored to receive several recognitions from management and customers for role modeling, risk taking, and results orientation. Self-motivated, high achieving team player with strong communication skills. Specialties:Purchasing, SAP, MRP Systems, Inventory Management, Inventory Control Methodology, contract negotiation, program management, mergers and acquisitions Experience Materials Program Manager Intel Corporation April 2010  –  October 2014  (4 years 7 months) DuPont, WA Responsible for providing functional leadership for the Materials Project Team and key interfaces to the project or program while ensuring materials support for system level factory builds. Serves as the primary interface for material or supply line issues and ensures a continuous line of supply for build schedules. Works directly with Design Engineers to select components optimized for quality, cost, and availability. Responsible for the metrics of success: cost savings, material availability or on-time delivery, customer satisfaction and inventory control. Buyer Intel Corporation November 2009  –  April 2010  (6 months) Responsible for planning and direction of Intel supplied purchasing functions in support of Intel Boards and Systems Manufacturing. Works closely with planners, BU customers, cross site teams, and suppliers to ensure material supply lines are well communicated and reconciled to commits. Also responsible for ensuring overall inventory goals are met. Other job activities include disposition of excess/obsolete material, ECO management, AP issues management, and materials tracking. Materials Program Manager Intel Corporation March 2008  –  March 2009  (1 year 1 month) Member of the TSA Supply Chain team for both Radisys and Kontron divestitures. \nResponsible for purchasing materials at best price and delivery cycle \nInfluenced cross functional teams to support the supply chain organization. \nActively managed inventory aging and excess/obsolete inventory. \nAPICS experience. Buyer Intel Corporation May 2007  –  March 2008  (11 months) Coordinated corporate purchasing activities with customers supporting validation and fabrication. Resolved accounts payable and receiving issues. Managed inventory control, workflow process and supply management problems. Supplier support, set-up and negotiation. Program Support Specialist Intel Corporation November 2005  –  August 2006  (10 months) Oversaw program coordination for various programs including department purchasing supporting silicon validation and test lab supply, information engineering, non-profit association management, and EPA programs. Coordination and support of various internal and external events and meetings. Independent Consultant University of Arizona August 1998  –  November 1998  (4 months) Manager, Global Trade Shows & Events RightFAX January 1997  –  August 1998  (1 year 8 months) Project Coordinator SOFTBANK Expos August 1995  –  August 1996  (1 year 1 month) Events Coordinator XSoft August 1994  –  August 1995  (1 year 1 month) Materials Program Manager Intel Corporation April 2010  –  October 2014  (4 years 7 months) DuPont, WA Responsible for providing functional leadership for the Materials Project Team and key interfaces to the project or program while ensuring materials support for system level factory builds. Serves as the primary interface for material or supply line issues and ensures a continuous line of supply for build schedules. Works directly with Design Engineers to select components optimized for quality, cost, and availability. Responsible for the metrics of success: cost savings, material availability or on-time delivery, customer satisfaction and inventory control. Materials Program Manager Intel Corporation April 2010  –  October 2014  (4 years 7 months) DuPont, WA Responsible for providing functional leadership for the Materials Project Team and key interfaces to the project or program while ensuring materials support for system level factory builds. Serves as the primary interface for material or supply line issues and ensures a continuous line of supply for build schedules. Works directly with Design Engineers to select components optimized for quality, cost, and availability. Responsible for the metrics of success: cost savings, material availability or on-time delivery, customer satisfaction and inventory control. Buyer Intel Corporation November 2009  –  April 2010  (6 months) Responsible for planning and direction of Intel supplied purchasing functions in support of Intel Boards and Systems Manufacturing. Works closely with planners, BU customers, cross site teams, and suppliers to ensure material supply lines are well communicated and reconciled to commits. Also responsible for ensuring overall inventory goals are met. Other job activities include disposition of excess/obsolete material, ECO management, AP issues management, and materials tracking. Buyer Intel Corporation November 2009  –  April 2010  (6 months) Responsible for planning and direction of Intel supplied purchasing functions in support of Intel Boards and Systems Manufacturing. Works closely with planners, BU customers, cross site teams, and suppliers to ensure material supply lines are well communicated and reconciled to commits. Also responsible for ensuring overall inventory goals are met. Other job activities include disposition of excess/obsolete material, ECO management, AP issues management, and materials tracking. Materials Program Manager Intel Corporation March 2008  –  March 2009  (1 year 1 month) Member of the TSA Supply Chain team for both Radisys and Kontron divestitures. \nResponsible for purchasing materials at best price and delivery cycle \nInfluenced cross functional teams to support the supply chain organization. \nActively managed inventory aging and excess/obsolete inventory. \nAPICS experience. Materials Program Manager Intel Corporation March 2008  –  March 2009  (1 year 1 month) Member of the TSA Supply Chain team for both Radisys and Kontron divestitures. \nResponsible for purchasing materials at best price and delivery cycle \nInfluenced cross functional teams to support the supply chain organization. \nActively managed inventory aging and excess/obsolete inventory. \nAPICS experience. Buyer Intel Corporation May 2007  –  March 2008  (11 months) Coordinated corporate purchasing activities with customers supporting validation and fabrication. Resolved accounts payable and receiving issues. Managed inventory control, workflow process and supply management problems. Supplier support, set-up and negotiation. Buyer Intel Corporation May 2007  –  March 2008  (11 months) Coordinated corporate purchasing activities with customers supporting validation and fabrication. Resolved accounts payable and receiving issues. Managed inventory control, workflow process and supply management problems. Supplier support, set-up and negotiation. Program Support Specialist Intel Corporation November 2005  –  August 2006  (10 months) Oversaw program coordination for various programs including department purchasing supporting silicon validation and test lab supply, information engineering, non-profit association management, and EPA programs. Coordination and support of various internal and external events and meetings. Program Support Specialist Intel Corporation November 2005  –  August 2006  (10 months) Oversaw program coordination for various programs including department purchasing supporting silicon validation and test lab supply, information engineering, non-profit association management, and EPA programs. Coordination and support of various internal and external events and meetings. Independent Consultant University of Arizona August 1998  –  November 1998  (4 months) Independent Consultant University of Arizona August 1998  –  November 1998  (4 months) Manager, Global Trade Shows & Events RightFAX January 1997  –  August 1998  (1 year 8 months) Manager, Global Trade Shows & Events RightFAX January 1997  –  August 1998  (1 year 8 months) Project Coordinator SOFTBANK Expos August 1995  –  August 1996  (1 year 1 month) Project Coordinator SOFTBANK Expos August 1995  –  August 1996  (1 year 1 month) Events Coordinator XSoft August 1994  –  August 1995  (1 year 1 month) Events Coordinator XSoft August 1994  –  August 1995  (1 year 1 month) Skills Purchasing Inventory Management MRP Supply Chain Management Supply Management Supply Chain Manufacturing Cross-functional Team... Contract Negotiation Management Communication Project Management Program Management Lean Manufacturing Project Planning Materials Management Strategic Planning Procurement Semiconductor Industry Process Improvement Intel Logistics Six Sigma Materials Semiconductors Continuous Improvement See 11+     See less Skills  Purchasing Inventory Management MRP Supply Chain Management Supply Management Supply Chain Manufacturing Cross-functional Team... Contract Negotiation Management Communication Project Management Program Management Lean Manufacturing Project Planning Materials Management Strategic Planning Procurement Semiconductor Industry Process Improvement Intel Logistics Six Sigma Materials Semiconductors Continuous Improvement See 11+     See less Purchasing Inventory Management MRP Supply Chain Management Supply Management Supply Chain Manufacturing Cross-functional Team... Contract Negotiation Management Communication Project Management Program Management Lean Manufacturing Project Planning Materials Management Strategic Planning Procurement Semiconductor Industry Process Improvement Intel Logistics Six Sigma Materials Semiconductors Continuous Improvement See 11+     See less Purchasing Inventory Management MRP Supply Chain Management Supply Management Supply Chain Manufacturing Cross-functional Team... Contract Negotiation Management Communication Project Management Program Management Lean Manufacturing Project Planning Materials Management Strategic Planning Procurement Semiconductor Industry Process Improvement Intel Logistics Six Sigma Materials Semiconductors Continuous Improvement See 11+     See less Education De Anza College Logistics & Supply Chain Management 2009  – 2010 Obtaining my certification in Logistics & Supply Chain Management University of Arizona Business Management 1998  – 2001 De Anza College AA,  Behavioral Science 1987  – 1989 Saint Francis High School 1981  – 1985 Resurrection De Anza College Logistics & Supply Chain Management 2009  – 2010 Obtaining my certification in Logistics & Supply Chain Management De Anza College Logistics & Supply Chain Management 2009  – 2010 Obtaining my certification in Logistics & Supply Chain Management De Anza College Logistics & Supply Chain Management 2009  – 2010 Obtaining my certification in Logistics & Supply Chain Management University of Arizona Business Management 1998  – 2001 University of Arizona Business Management 1998  – 2001 University of Arizona Business Management 1998  – 2001 De Anza College AA,  Behavioral Science 1987  – 1989 De Anza College AA,  Behavioral Science 1987  – 1989 De Anza College AA,  Behavioral Science 1987  – 1989 Saint Francis High School 1981  – 1985 Saint Francis High School 1981  – 1985 Saint Francis High School 1981  – 1985 Resurrection Resurrection Resurrection Honors & Awards Additional Honors & Awards Divisional Recognition Award, Intel Corporation - Q3 '08 Additional Honors & Awards Divisional Recognition Award, Intel Corporation - Q3 '08 Additional Honors & Awards Divisional Recognition Award, Intel Corporation - Q3 '08 Additional Honors & Awards Divisional Recognition Award, Intel Corporation - Q3 '08 ", "Experience Materials Program Manager Intel Corporation Materials Program Manager Intel Corporation Materials Program Manager Intel Corporation ", "Experience Materials Program Manager Intel Corporation May 2012  – Present (3 years 4 months) Direct Materials Buyer Intel Corporation November 2009  –  April 2012  (2 years 6 months) Commodity Specialist Intel Corporation October 2005  –  November 2009  (4 years 2 months) Materials Program Manager Intel Corporation May 2012  – Present (3 years 4 months) Materials Program Manager Intel Corporation May 2012  – Present (3 years 4 months) Direct Materials Buyer Intel Corporation November 2009  –  April 2012  (2 years 6 months) Direct Materials Buyer Intel Corporation November 2009  –  April 2012  (2 years 6 months) Commodity Specialist Intel Corporation October 2005  –  November 2009  (4 years 2 months) Commodity Specialist Intel Corporation October 2005  –  November 2009  (4 years 2 months) Skills Strategic Sourcing Supply Management MRP Supply Chain Management Supply Chain Global Sourcing Materials Management Procurement Cross-functional Team... Purchasing Supplier Evaluation Supplier Negotiation Lean Manufacturing Continuous Improvement Skills  Strategic Sourcing Supply Management MRP Supply Chain Management Supply Chain Global Sourcing Materials Management Procurement Cross-functional Team... Purchasing Supplier Evaluation Supplier Negotiation Lean Manufacturing Continuous Improvement Strategic Sourcing Supply Management MRP Supply Chain Management Supply Chain Global Sourcing Materials Management Procurement Cross-functional Team... Purchasing Supplier Evaluation Supplier Negotiation Lean Manufacturing Continuous Improvement Strategic Sourcing Supply Management MRP Supply Chain Management Supply Chain Global Sourcing Materials Management Procurement Cross-functional Team... Purchasing Supplier Evaluation Supplier Negotiation Lean Manufacturing Continuous Improvement Education Portland State University Bachelor of Business Administration (B.B.A.),  Logistics , Materials, and Supply Chain Management 2001  – 2006 Portland State University Bachelor of Business Administration (B.B.A.),  Logistics , Materials, and Supply Chain Management 2001  – 2006 Portland State University Bachelor of Business Administration (B.B.A.),  Logistics , Materials, and Supply Chain Management 2001  – 2006 Portland State University Bachelor of Business Administration (B.B.A.),  Logistics , Materials, and Supply Chain Management 2001  – 2006 ", "Languages English Spanish English Spanish English Spanish Skills Supply Chain Management Demand Planning Latin America Supply Chain Supply Chain... Production Planning SAP Logistics Cross-functional Team... Materials Management Forecasting Warehouse Management MRP SAP R/3 Warehousing Strategic Sourcing Six Sigma ERP Manufacturing Supply Management Purchasing Pricing Strategy Leadership Supplier Development Analysis Negotiation Product Development Project Management Continuous Improvement Procurement Management Supply Chain Operations Process Engineering Process Improvement Consumer Products Logistics Management Change Management Strategic Planning Team Leadership Business Strategy Planning Lean Manufacturing See 28+     See less Skills  Supply Chain Management Demand Planning Latin America Supply Chain Supply Chain... Production Planning SAP Logistics Cross-functional Team... Materials Management Forecasting Warehouse Management MRP SAP R/3 Warehousing Strategic Sourcing Six Sigma ERP Manufacturing Supply Management Purchasing Pricing Strategy Leadership Supplier Development Analysis Negotiation Product Development Project Management Continuous Improvement Procurement Management Supply Chain Operations Process Engineering Process Improvement Consumer Products Logistics Management Change Management Strategic Planning Team Leadership Business Strategy Planning Lean Manufacturing See 28+     See less Supply Chain Management Demand Planning Latin America Supply Chain Supply Chain... Production Planning SAP Logistics Cross-functional Team... Materials Management Forecasting Warehouse Management MRP SAP R/3 Warehousing Strategic Sourcing Six Sigma ERP Manufacturing Supply Management Purchasing Pricing Strategy Leadership Supplier Development Analysis Negotiation Product Development Project Management Continuous Improvement Procurement Management Supply Chain Operations Process Engineering Process Improvement Consumer Products Logistics Management Change Management Strategic Planning Team Leadership Business Strategy Planning Lean Manufacturing See 28+     See less Supply Chain Management Demand Planning Latin America Supply Chain Supply Chain... Production Planning SAP Logistics Cross-functional Team... Materials Management Forecasting Warehouse Management MRP SAP R/3 Warehousing Strategic Sourcing Six Sigma ERP Manufacturing Supply Management Purchasing Pricing Strategy Leadership Supplier Development Analysis Negotiation Product Development Project Management Continuous Improvement Procurement Management Supply Chain Operations Process Engineering Process Improvement Consumer Products Logistics Management Change Management Strategic Planning Team Leadership Business Strategy Planning Lean Manufacturing See 28+     See less ", "Skills Management Contract Negotiation Negotiation Procurement Supplier Management Outsourcing Deal Making Business Relationship... Supply Management Sourcing Cross-functional Team... Program Management Change Management Strategic Sourcing Supply Chain Management Vendor Management Business Process... Process Improvement Forecasting Contract Management See 5+     See less Skills  Management Contract Negotiation Negotiation Procurement Supplier Management Outsourcing Deal Making Business Relationship... Supply Management Sourcing Cross-functional Team... Program Management Change Management Strategic Sourcing Supply Chain Management Vendor Management Business Process... Process Improvement Forecasting Contract Management See 5+     See less Management Contract Negotiation Negotiation Procurement Supplier Management Outsourcing Deal Making Business Relationship... Supply Management Sourcing Cross-functional Team... Program Management Change Management Strategic Sourcing Supply Chain Management Vendor Management Business Process... Process Improvement Forecasting Contract Management See 5+     See less Management Contract Negotiation Negotiation Procurement Supplier Management Outsourcing Deal Making Business Relationship... Supply Management Sourcing Cross-functional Team... Program Management Change Management Strategic Sourcing Supply Chain Management Vendor Management Business Process... Process Improvement Forecasting Contract Management See 5+     See less Honors & Awards ", "Summary Managed all supply chain activities in the semiconductor industry, with specialization in mobility components (smartphones and tablets), electronics, optical components and assemblies. Substantial experience in strategic hardware operations in smartphone space. Extensive interfacing with Asian contract manufacturers and supporting a globally dispersed software engineering and manufacturing organization. Summary Managed all supply chain activities in the semiconductor industry, with specialization in mobility components (smartphones and tablets), electronics, optical components and assemblies. Substantial experience in strategic hardware operations in smartphone space. Extensive interfacing with Asian contract manufacturers and supporting a globally dispersed software engineering and manufacturing organization. Managed all supply chain activities in the semiconductor industry, with specialization in mobility components (smartphones and tablets), electronics, optical components and assemblies. Substantial experience in strategic hardware operations in smartphone space. Extensive interfacing with Asian contract manufacturers and supporting a globally dispersed software engineering and manufacturing organization. Managed all supply chain activities in the semiconductor industry, with specialization in mobility components (smartphones and tablets), electronics, optical components and assemblies. Substantial experience in strategic hardware operations in smartphone space. Extensive interfacing with Asian contract manufacturers and supporting a globally dispersed software engineering and manufacturing organization. Languages Tamil Tamil Tamil Skills Supply Chain Management Product Development Manufacturing Supply Chain Strategy Supply Management Budgets Inventory Management Cross-functional Team... Electronics Materials Management Semiconductors Program Management Strategic Sourcing Lean Manufacturing Skills  Supply Chain Management Product Development Manufacturing Supply Chain Strategy Supply Management Budgets Inventory Management Cross-functional Team... Electronics Materials Management Semiconductors Program Management Strategic Sourcing Lean Manufacturing Supply Chain Management Product Development Manufacturing Supply Chain Strategy Supply Management Budgets Inventory Management Cross-functional Team... Electronics Materials Management Semiconductors Program Management Strategic Sourcing Lean Manufacturing Supply Chain Management Product Development Manufacturing Supply Chain Strategy Supply Management Budgets Inventory Management Cross-functional Team... Electronics Materials Management Semiconductors Program Management Strategic Sourcing Lean Manufacturing ", "Experience Materials Program Manager Intel Corporation April 2012  – Present (3 years 5 months) Accountant Intel Corp June 2004  –  April 2012  (7 years 11 months) Materials Program Manager Intel Corporation April 2012  – Present (3 years 5 months) Materials Program Manager Intel Corporation April 2012  – Present (3 years 5 months) Accountant Intel Corp June 2004  –  April 2012  (7 years 11 months) Accountant Intel Corp June 2004  –  April 2012  (7 years 11 months) Education University of Phoenix Bachelor of Arts (BA),  Accounting and Finance 2001  – 2004 University of Phoenix Bachelor of Arts (BA),  Accounting and Finance 2001  – 2004 University of Phoenix Bachelor of Arts (BA),  Accounting and Finance 2001  – 2004 University of Phoenix Bachelor of Arts (BA),  Accounting and Finance 2001  – 2004 ", "Experience Materials Program Manager Intel Corporation January 2012  – Present (3 years 8 months) Shanghai City, China Business Operations + Assistant Intel Corporation November 2010  –  December 2011  (1 year 2 months) Shanghai City, China Senior Administrative Assistant Intel Corporation December 2004  –  November 2010  (6 years) Shanghai City, China Events Management Shangri-La Hotel March 2003  –  October 2004  (1 year 8 months) harbin, china Materials Program Manager Intel Corporation January 2012  – Present (3 years 8 months) Shanghai City, China Materials Program Manager Intel Corporation January 2012  – Present (3 years 8 months) Shanghai City, China Business Operations + Assistant Intel Corporation November 2010  –  December 2011  (1 year 2 months) Shanghai City, China Business Operations + Assistant Intel Corporation November 2010  –  December 2011  (1 year 2 months) Shanghai City, China Senior Administrative Assistant Intel Corporation December 2004  –  November 2010  (6 years) Shanghai City, China Senior Administrative Assistant Intel Corporation December 2004  –  November 2010  (6 years) Shanghai City, China Events Management Shangri-La Hotel March 2003  –  October 2004  (1 year 8 months) harbin, china Events Management Shangri-La Hotel March 2003  –  October 2004  (1 year 8 months) harbin, china Skills Supply Chain Management Business Operations Program Management Project Management Marketing Communications Events Management System Administration Administrative... Outlook SAP Microsoft Office Microsoft Excel Windows Skills  Supply Chain Management Business Operations Program Management Project Management Marketing Communications Events Management System Administration Administrative... Outlook SAP Microsoft Office Microsoft Excel Windows Supply Chain Management Business Operations Program Management Project Management Marketing Communications Events Management System Administration Administrative... Outlook SAP Microsoft Office Microsoft Excel Windows Supply Chain Management Business Operations Program Management Project Management Marketing Communications Events Management System Administration Administrative... Outlook SAP Microsoft Office Microsoft Excel Windows Education Renmin University of China East China Normal University Renmin University of China Renmin University of China Renmin University of China East China Normal University East China Normal University East China Normal University ", "Experience Strategic Materials Program Manager Intel Corporation January 2012  – Present (3 years 8 months) Program Manager Intel January 2005  –  January 2012  (7 years 1 month) Supply Demand Manager Intel Corporation May 1999  –  January 2005  (5 years 9 months) Strategic Materials Program Manager Intel Corporation January 2012  – Present (3 years 8 months) Strategic Materials Program Manager Intel Corporation January 2012  – Present (3 years 8 months) Program Manager Intel January 2005  –  January 2012  (7 years 1 month) Program Manager Intel January 2005  –  January 2012  (7 years 1 month) Supply Demand Manager Intel Corporation May 1999  –  January 2005  (5 years 9 months) Supply Demand Manager Intel Corporation May 1999  –  January 2005  (5 years 9 months) Education University of Phoenix Bachelor of Science, Business Management University of Phoenix Bachelor of Science, Business Management University of Phoenix Bachelor of Science, Business Management University of Phoenix Bachelor of Science, Business Management ", "Experience Materials Program Manager Intel Corporation Materials Program Manager Intel Corporation Materials Program Manager Intel Corporation ", "Summary Specialties:Supply Chain Management, Oracle Procurement Summary Specialties:Supply Chain Management, Oracle Procurement Specialties:Supply Chain Management, Oracle Procurement Specialties:Supply Chain Management, Oracle Procurement Experience Strategic Materials Program Manager Intel Corporation December 2012  – Present (2 years 9 months) Hillsboro, Oregon Sourcing and procurement of platform reference design hardware that meets the quality, availability and cost requirements for systems manufacturing development as part of the Client Research & Development division of the Client Computing Group.  Commodity Specialist Leupold & Stevens, Inc. February 2011  –  December 2012  (1 year 11 months) United States Develop and implement supply strategies to ensure an uninterrupted supply of raw materials and machined components at the lowest total cost. Manage supplier relationships. Support procurement with Oracle and other IT related issues and improvements. Buyer ClearEdge Power August 2010  –  February 2011  (7 months) Hillsboro, Oregon Procurement support for design and manufacturing engineering as well as facilities. Managed sourcing of tools and job site materials for sales and technical services. Buyer Leupold & Stevens, Inc. July 2007  –  August 2010  (3 years 2 months) Purchase and coordinate delivery of raw materials and machined components to support production. Administrative Assistant & Web Designer Portland Bolt & Manufacturing Company, Inc. September 2006  –  July 2007  (11 months) Portland, Oregon Area Supported inside sales group, developed and maintained online presence, coordinated certification of raw materials for customer orders, handled incoming calls. Strategic Materials Program Manager Intel Corporation December 2012  – Present (2 years 9 months) Hillsboro, Oregon Sourcing and procurement of platform reference design hardware that meets the quality, availability and cost requirements for systems manufacturing development as part of the Client Research & Development division of the Client Computing Group.  Strategic Materials Program Manager Intel Corporation December 2012  – Present (2 years 9 months) Hillsboro, Oregon Sourcing and procurement of platform reference design hardware that meets the quality, availability and cost requirements for systems manufacturing development as part of the Client Research & Development division of the Client Computing Group.  Commodity Specialist Leupold & Stevens, Inc. February 2011  –  December 2012  (1 year 11 months) United States Develop and implement supply strategies to ensure an uninterrupted supply of raw materials and machined components at the lowest total cost. Manage supplier relationships. Support procurement with Oracle and other IT related issues and improvements. Commodity Specialist Leupold & Stevens, Inc. February 2011  –  December 2012  (1 year 11 months) United States Develop and implement supply strategies to ensure an uninterrupted supply of raw materials and machined components at the lowest total cost. Manage supplier relationships. Support procurement with Oracle and other IT related issues and improvements. Buyer ClearEdge Power August 2010  –  February 2011  (7 months) Hillsboro, Oregon Procurement support for design and manufacturing engineering as well as facilities. Managed sourcing of tools and job site materials for sales and technical services. Buyer ClearEdge Power August 2010  –  February 2011  (7 months) Hillsboro, Oregon Procurement support for design and manufacturing engineering as well as facilities. Managed sourcing of tools and job site materials for sales and technical services. Buyer Leupold & Stevens, Inc. July 2007  –  August 2010  (3 years 2 months) Purchase and coordinate delivery of raw materials and machined components to support production. Buyer Leupold & Stevens, Inc. July 2007  –  August 2010  (3 years 2 months) Purchase and coordinate delivery of raw materials and machined components to support production. Administrative Assistant & Web Designer Portland Bolt & Manufacturing Company, Inc. September 2006  –  July 2007  (11 months) Portland, Oregon Area Supported inside sales group, developed and maintained online presence, coordinated certification of raw materials for customer orders, handled incoming calls. Administrative Assistant & Web Designer Portland Bolt & Manufacturing Company, Inc. September 2006  –  July 2007  (11 months) Portland, Oregon Area Supported inside sales group, developed and maintained online presence, coordinated certification of raw materials for customer orders, handled incoming calls. Skills Inventory Management Supplier Quality... Oracle E-Business Suite Commodity Risk... Logistics Management Import/Export Operations Strategic Sourcing Procurement Sourcing Production Planning Global Sourcing Lean Manufacturing Manufacturing Operations Management Continuous Improvement Management ERP Supply Chain Management Process Improvement Strategy Purchasing Supply Management MRP SAP 5S Supplier Development Supply Chain Logistics Supplier Evaluation Cross-functional Team... Materials Management Kaizen Supplier Negotiation Supply Chain... Forecasting See 20+     See less Skills  Inventory Management Supplier Quality... Oracle E-Business Suite Commodity Risk... Logistics Management Import/Export Operations Strategic Sourcing Procurement Sourcing Production Planning Global Sourcing Lean Manufacturing Manufacturing Operations Management Continuous Improvement Management ERP Supply Chain Management Process Improvement Strategy Purchasing Supply Management MRP SAP 5S Supplier Development Supply Chain Logistics Supplier Evaluation Cross-functional Team... Materials Management Kaizen Supplier Negotiation Supply Chain... Forecasting See 20+     See less Inventory Management Supplier Quality... Oracle E-Business Suite Commodity Risk... Logistics Management Import/Export Operations Strategic Sourcing Procurement Sourcing Production Planning Global Sourcing Lean Manufacturing Manufacturing Operations Management Continuous Improvement Management ERP Supply Chain Management Process Improvement Strategy Purchasing Supply Management MRP SAP 5S Supplier Development Supply Chain Logistics Supplier Evaluation Cross-functional Team... Materials Management Kaizen Supplier Negotiation Supply Chain... Forecasting See 20+     See less Inventory Management Supplier Quality... Oracle E-Business Suite Commodity Risk... Logistics Management Import/Export Operations Strategic Sourcing Procurement Sourcing Production Planning Global Sourcing Lean Manufacturing Manufacturing Operations Management Continuous Improvement Management ERP Supply Chain Management Process Improvement Strategy Purchasing Supply Management MRP SAP 5S Supplier Development Supply Chain Logistics Supplier Evaluation Cross-functional Team... Materials Management Kaizen Supplier Negotiation Supply Chain... Forecasting See 20+     See less Education University of Oregon - Charles H. Lundquist College of Business BS,  Business Administration 2002  – 2006 Information Systems and Operations Management, Computer Information Technology Minor Activities and Societies:  Alpha Kappa Psi University of Oregon - Charles H. Lundquist College of Business BS,  Business Administration 2002  – 2006 Information Systems and Operations Management, Computer Information Technology Minor Activities and Societies:  Alpha Kappa Psi University of Oregon - Charles H. Lundquist College of Business BS,  Business Administration 2002  – 2006 Information Systems and Operations Management, Computer Information Technology Minor Activities and Societies:  Alpha Kappa Psi University of Oregon - Charles H. Lundquist College of Business BS,  Business Administration 2002  – 2006 Information Systems and Operations Management, Computer Information Technology Minor Activities and Societies:  Alpha Kappa Psi "]}