{"position": "Materials Manager", "company": "Intel Corporation", "profiles": ["Summary Over 20 year of experience leading project teams and building strategic relationships with business partners and customers. I am a solid team player with strong interpersonal, communication and presentation skills. I enjoy a challenge and thrive when i am able to drive best practices in a challenging, complex space. \n \nKey Skills:  \n \nProgram Management  \nSupply Chain Management \nProduct Cost \nNew Product Introduction  \nMaterials Management \nData Center  \nStakeholder Communication  \nRisk Management for complex projects  \nCoaching and Mentoring  \nPLC Expertise \nPMP Certification  \nStrategic Planning  \nReverse Logistics  \nReturn Supply Chain \nWarranty Support Summary Over 20 year of experience leading project teams and building strategic relationships with business partners and customers. I am a solid team player with strong interpersonal, communication and presentation skills. I enjoy a challenge and thrive when i am able to drive best practices in a challenging, complex space. \n \nKey Skills:  \n \nProgram Management  \nSupply Chain Management \nProduct Cost \nNew Product Introduction  \nMaterials Management \nData Center  \nStakeholder Communication  \nRisk Management for complex projects  \nCoaching and Mentoring  \nPLC Expertise \nPMP Certification  \nStrategic Planning  \nReverse Logistics  \nReturn Supply Chain \nWarranty Support Over 20 year of experience leading project teams and building strategic relationships with business partners and customers. I am a solid team player with strong interpersonal, communication and presentation skills. I enjoy a challenge and thrive when i am able to drive best practices in a challenging, complex space. \n \nKey Skills:  \n \nProgram Management  \nSupply Chain Management \nProduct Cost \nNew Product Introduction  \nMaterials Management \nData Center  \nStakeholder Communication  \nRisk Management for complex projects  \nCoaching and Mentoring  \nPLC Expertise \nPMP Certification  \nStrategic Planning  \nReverse Logistics  \nReturn Supply Chain \nWarranty Support Over 20 year of experience leading project teams and building strategic relationships with business partners and customers. I am a solid team player with strong interpersonal, communication and presentation skills. I enjoy a challenge and thrive when i am able to drive best practices in a challenging, complex space. \n \nKey Skills:  \n \nProgram Management  \nSupply Chain Management \nProduct Cost \nNew Product Introduction  \nMaterials Management \nData Center  \nStakeholder Communication  \nRisk Management for complex projects  \nCoaching and Mentoring  \nPLC Expertise \nPMP Certification  \nStrategic Planning  \nReverse Logistics  \nReturn Supply Chain \nWarranty Support Experience Global Strategic Materials Manager Intel Corporation August 2014  – Present (1 year 1 month) Dupont, WA I own the global material strategy definition and execution in support of our Server business group. I lead a global team of experienced materials managers that drive the execution of the material strategy to ensure we meet our product cost targets and develop a stable and reliable supply chain. My team collaborates with product planning, engineering and the operations team to deliver server products that delight our customers. Supply Chain Management - Materials Program Manager Intel Corporation March 2014  –  August 2014  (6 months) Dupont, WA Drive component selection for new product introduction project. Engage with suppliers and product engineers to ensure we select components that are optimized for cost, delivery while minimizing risk to the overall supply chain. \n \nCurrently i am working on a project that is looking to significantly improve our supply chain efficiency and responsiveness. Program Manager - Reverse Logistics Intel Corporation January 2006  –  March 2014  (8 years 3 months) Dupont, WA Lead the strategy development, account management and worldwide product reverse logistics (returns supply chain) projects to support of our business unit partners’ strategic objectives. Lead cross functional/Geo teams to deliver complex projects on time, budget and scope. Well versed in Project Lifecycle management. Supply Chain Management - Materials Program Manager Intel Corporation May 2000  –  January 2006  (5 years 9 months) Dupont, WA Drove and implemented the sourcing strategy for Server products. Single point of contact for design engineers and the outsource design manufacturing (ODM) partners to ensure a smooth transition from new product introduction phase to high volume production. Project Controls Group Program Manager Intel Corporation 1998  –  2000  (2 years) Dupont, WA Supported design teams with effective project management practices and methodologies to ensure the success of their programs. Partnered with the design managers to develop project activities definitions, workflows and schedules to help them execute and control the project.  \n \nCollaborated with the teams on critical path and resource optimization analysis to identify opportunities for schedule improvement. Implemented a new project schedule infrastructure, including tools and indicator reporting. Commodity Specialist - Storage Intel Corporation 1996  –  1998  (2 years) Managed the hard disk drive commodity. Created and implemented strategic plans for supplier selection, contract negotiation and cost reduction programs. Customer and Materials Program Manager Intel Corporation February 1993  –  March 1996  (3 years 2 months) Managed the material sourcing strategy for HW programs. Worked with ODM and manufacturing partners on developing master schedule of the programs I supported. Global Strategic Materials Manager Intel Corporation August 2014  – Present (1 year 1 month) Dupont, WA I own the global material strategy definition and execution in support of our Server business group. I lead a global team of experienced materials managers that drive the execution of the material strategy to ensure we meet our product cost targets and develop a stable and reliable supply chain. My team collaborates with product planning, engineering and the operations team to deliver server products that delight our customers. Global Strategic Materials Manager Intel Corporation August 2014  – Present (1 year 1 month) Dupont, WA I own the global material strategy definition and execution in support of our Server business group. I lead a global team of experienced materials managers that drive the execution of the material strategy to ensure we meet our product cost targets and develop a stable and reliable supply chain. My team collaborates with product planning, engineering and the operations team to deliver server products that delight our customers. Supply Chain Management - Materials Program Manager Intel Corporation March 2014  –  August 2014  (6 months) Dupont, WA Drive component selection for new product introduction project. Engage with suppliers and product engineers to ensure we select components that are optimized for cost, delivery while minimizing risk to the overall supply chain. \n \nCurrently i am working on a project that is looking to significantly improve our supply chain efficiency and responsiveness. Supply Chain Management - Materials Program Manager Intel Corporation March 2014  –  August 2014  (6 months) Dupont, WA Drive component selection for new product introduction project. Engage with suppliers and product engineers to ensure we select components that are optimized for cost, delivery while minimizing risk to the overall supply chain. \n \nCurrently i am working on a project that is looking to significantly improve our supply chain efficiency and responsiveness. Program Manager - Reverse Logistics Intel Corporation January 2006  –  March 2014  (8 years 3 months) Dupont, WA Lead the strategy development, account management and worldwide product reverse logistics (returns supply chain) projects to support of our business unit partners’ strategic objectives. Lead cross functional/Geo teams to deliver complex projects on time, budget and scope. Well versed in Project Lifecycle management. Program Manager - Reverse Logistics Intel Corporation January 2006  –  March 2014  (8 years 3 months) Dupont, WA Lead the strategy development, account management and worldwide product reverse logistics (returns supply chain) projects to support of our business unit partners’ strategic objectives. Lead cross functional/Geo teams to deliver complex projects on time, budget and scope. Well versed in Project Lifecycle management. Supply Chain Management - Materials Program Manager Intel Corporation May 2000  –  January 2006  (5 years 9 months) Dupont, WA Drove and implemented the sourcing strategy for Server products. Single point of contact for design engineers and the outsource design manufacturing (ODM) partners to ensure a smooth transition from new product introduction phase to high volume production. Supply Chain Management - Materials Program Manager Intel Corporation May 2000  –  January 2006  (5 years 9 months) Dupont, WA Drove and implemented the sourcing strategy for Server products. Single point of contact for design engineers and the outsource design manufacturing (ODM) partners to ensure a smooth transition from new product introduction phase to high volume production. Project Controls Group Program Manager Intel Corporation 1998  –  2000  (2 years) Dupont, WA Supported design teams with effective project management practices and methodologies to ensure the success of their programs. Partnered with the design managers to develop project activities definitions, workflows and schedules to help them execute and control the project.  \n \nCollaborated with the teams on critical path and resource optimization analysis to identify opportunities for schedule improvement. Implemented a new project schedule infrastructure, including tools and indicator reporting. Project Controls Group Program Manager Intel Corporation 1998  –  2000  (2 years) Dupont, WA Supported design teams with effective project management practices and methodologies to ensure the success of their programs. Partnered with the design managers to develop project activities definitions, workflows and schedules to help them execute and control the project.  \n \nCollaborated with the teams on critical path and resource optimization analysis to identify opportunities for schedule improvement. Implemented a new project schedule infrastructure, including tools and indicator reporting. Commodity Specialist - Storage Intel Corporation 1996  –  1998  (2 years) Managed the hard disk drive commodity. Created and implemented strategic plans for supplier selection, contract negotiation and cost reduction programs. Commodity Specialist - Storage Intel Corporation 1996  –  1998  (2 years) Managed the hard disk drive commodity. Created and implemented strategic plans for supplier selection, contract negotiation and cost reduction programs. Customer and Materials Program Manager Intel Corporation February 1993  –  March 1996  (3 years 2 months) Managed the material sourcing strategy for HW programs. Worked with ODM and manufacturing partners on developing master schedule of the programs I supported. Customer and Materials Program Manager Intel Corporation February 1993  –  March 1996  (3 years 2 months) Managed the material sourcing strategy for HW programs. Worked with ODM and manufacturing partners on developing master schedule of the programs I supported. Languages English Native or bilingual proficiency Spanish Native or bilingual proficiency English Native or bilingual proficiency Spanish Native or bilingual proficiency English Native or bilingual proficiency Spanish Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Cross-functional Team... Program Management Semiconductors Product Management PMP Process Improvement Six Sigma Software Project... Project Management Vendor Management Integration Go-to-market Strategy Business Process... Business Analysis Strategy Product Lifecycle... Manufacturing Strategic Planning Master Scheduling Bilingual-English/Spanis... Supply Chain Management Customer Oriented Driving Results Management See 9+     See less Skills  Cross-functional Team... Program Management Semiconductors Product Management PMP Process Improvement Six Sigma Software Project... Project Management Vendor Management Integration Go-to-market Strategy Business Process... Business Analysis Strategy Product Lifecycle... Manufacturing Strategic Planning Master Scheduling Bilingual-English/Spanis... Supply Chain Management Customer Oriented Driving Results Management See 9+     See less Cross-functional Team... Program Management Semiconductors Product Management PMP Process Improvement Six Sigma Software Project... Project Management Vendor Management Integration Go-to-market Strategy Business Process... Business Analysis Strategy Product Lifecycle... Manufacturing Strategic Planning Master Scheduling Bilingual-English/Spanis... Supply Chain Management Customer Oriented Driving Results Management See 9+     See less Cross-functional Team... Program Management Semiconductors Product Management PMP Process Improvement Six Sigma Software Project... Project Management Vendor Management Integration Go-to-market Strategy Business Process... Business Analysis Strategy Product Lifecycle... Manufacturing Strategic Planning Master Scheduling Bilingual-English/Spanis... Supply Chain Management Customer Oriented Driving Results Management See 9+     See less Education Indiana University - Kelley School of Business MBA,  Finance 1990  – 1992 Masters Degree with a focus on finance and accounting. University of Puerto Rico BS,  Finance 1985  – 1988 Indiana University - Kelley School of Business MBA,  Finance 1990  – 1992 Masters Degree with a focus on finance and accounting. Indiana University - Kelley School of Business MBA,  Finance 1990  – 1992 Masters Degree with a focus on finance and accounting. Indiana University - Kelley School of Business MBA,  Finance 1990  – 1992 Masters Degree with a focus on finance and accounting. University of Puerto Rico BS,  Finance 1985  – 1988 University of Puerto Rico BS,  Finance 1985  – 1988 University of Puerto Rico BS,  Finance 1985  – 1988 ", "Skills Public Relations Social Media Account Management Project Management Strategic Planning Marketing Communications Marketing Integrated Marketing Team Leadership Management Media Relations Business Development Cross-functional Team... New Business Development Social Media Marketing Skills  Public Relations Social Media Account Management Project Management Strategic Planning Marketing Communications Marketing Integrated Marketing Team Leadership Management Media Relations Business Development Cross-functional Team... New Business Development Social Media Marketing Public Relations Social Media Account Management Project Management Strategic Planning Marketing Communications Marketing Integrated Marketing Team Leadership Management Media Relations Business Development Cross-functional Team... New Business Development Social Media Marketing Public Relations Social Media Account Management Project Management Strategic Planning Marketing Communications Marketing Integrated Marketing Team Leadership Management Media Relations Business Development Cross-functional Team... New Business Development Social Media Marketing ", "Summary Results-oriented, high-energy, hands-on Procurement Manager with twelve years of progressive and diverse responsibilities in the high-tech manufacturing sector. Areas of excellence include project team management, operations management, supplier management, contracts development, contract negotiations, and business analysis.  \n \nUnsurpassed track record managing multiple concurrent projects consisting of geographically dispersed and cross-functional teams in excess of 30 individuals. Repeatedly recognized for demonstrating excellence in customer service, results orientation, cultivating best practices, and leading efforts in relationship management. Oversee project budgets between $50 million and $400 million. \n \nCareer marked with exciting challenges and successes. Demonstrated skills in employee development, organizational and operational improvements, team building, and customer service. Major strengths include strong leadership abilities, excellent communication skills, superior negotiation skills, strong financial/analytical acumen, proactive drive, personal integrity, results orientation, and advanced knowledge of word-processing, internet auctions, spreadsheets and integrated software applications (SAP, Versapro, and Proprietary Access Database Programs). Outstanding management and employee relations’ qualifications. Specialties:Areas of excellence include contracts development, contract negotiations, supplier management, business analysis, operations management, and project management. Oversee project budgets between $2 million and $200 million. Summary Results-oriented, high-energy, hands-on Procurement Manager with twelve years of progressive and diverse responsibilities in the high-tech manufacturing sector. Areas of excellence include project team management, operations management, supplier management, contracts development, contract negotiations, and business analysis.  \n \nUnsurpassed track record managing multiple concurrent projects consisting of geographically dispersed and cross-functional teams in excess of 30 individuals. Repeatedly recognized for demonstrating excellence in customer service, results orientation, cultivating best practices, and leading efforts in relationship management. Oversee project budgets between $50 million and $400 million. \n \nCareer marked with exciting challenges and successes. Demonstrated skills in employee development, organizational and operational improvements, team building, and customer service. Major strengths include strong leadership abilities, excellent communication skills, superior negotiation skills, strong financial/analytical acumen, proactive drive, personal integrity, results orientation, and advanced knowledge of word-processing, internet auctions, spreadsheets and integrated software applications (SAP, Versapro, and Proprietary Access Database Programs). Outstanding management and employee relations’ qualifications. Specialties:Areas of excellence include contracts development, contract negotiations, supplier management, business analysis, operations management, and project management. Oversee project budgets between $2 million and $200 million. Results-oriented, high-energy, hands-on Procurement Manager with twelve years of progressive and diverse responsibilities in the high-tech manufacturing sector. Areas of excellence include project team management, operations management, supplier management, contracts development, contract negotiations, and business analysis.  \n \nUnsurpassed track record managing multiple concurrent projects consisting of geographically dispersed and cross-functional teams in excess of 30 individuals. Repeatedly recognized for demonstrating excellence in customer service, results orientation, cultivating best practices, and leading efforts in relationship management. Oversee project budgets between $50 million and $400 million. \n \nCareer marked with exciting challenges and successes. Demonstrated skills in employee development, organizational and operational improvements, team building, and customer service. Major strengths include strong leadership abilities, excellent communication skills, superior negotiation skills, strong financial/analytical acumen, proactive drive, personal integrity, results orientation, and advanced knowledge of word-processing, internet auctions, spreadsheets and integrated software applications (SAP, Versapro, and Proprietary Access Database Programs). Outstanding management and employee relations’ qualifications. Specialties:Areas of excellence include contracts development, contract negotiations, supplier management, business analysis, operations management, and project management. Oversee project budgets between $2 million and $200 million. Results-oriented, high-energy, hands-on Procurement Manager with twelve years of progressive and diverse responsibilities in the high-tech manufacturing sector. Areas of excellence include project team management, operations management, supplier management, contracts development, contract negotiations, and business analysis.  \n \nUnsurpassed track record managing multiple concurrent projects consisting of geographically dispersed and cross-functional teams in excess of 30 individuals. Repeatedly recognized for demonstrating excellence in customer service, results orientation, cultivating best practices, and leading efforts in relationship management. Oversee project budgets between $50 million and $400 million. \n \nCareer marked with exciting challenges and successes. Demonstrated skills in employee development, organizational and operational improvements, team building, and customer service. Major strengths include strong leadership abilities, excellent communication skills, superior negotiation skills, strong financial/analytical acumen, proactive drive, personal integrity, results orientation, and advanced knowledge of word-processing, internet auctions, spreadsheets and integrated software applications (SAP, Versapro, and Proprietary Access Database Programs). Outstanding management and employee relations’ qualifications. Specialties:Areas of excellence include contracts development, contract negotiations, supplier management, business analysis, operations management, and project management. Oversee project budgets between $2 million and $200 million. Experience Visual Retail Segment Marketing Manager Intel Corporation December 2014  – Present (9 months) Chandler, Arizona Responsible for the marketing and scaling of Digital Signage (DS), Interactive Kiosks, brand specific Automated Retail and interactive whiteboard segments. Innovating, driving and marketing the Visual Retail strategies and Intel IP solutions including HW, SW and Analytics into the Retail Sector ecosystem, end customers and brands. Procurement Manager - Construction Services Intel Corporation August 2013  – Present (2 years 1 month) Chandler, AZ Americas Outsource Operations Sourcing & Procurement Manager INVISTA January 2011  –  August 2013  (2 years 8 months) Kennesaw, GA Hired to manage the all North and South American outsource operations, sourcing, and procurement efforts in support of Performance Surfaces and Materials initiatives. Reports directly to Global Procurement Manager and managed a portfolio of 25 suppliers and $40 million in spends. \n \nAccomplishments: \n\tFacilitated all Sourcing and Procurement activities to create greatest possible strategic sourcing leverage to provide highest possible level of support for INVISTA internal and external customers. \n\tActively lead and managed the raw material and material processing of post-consumer fibers which enabled the innovative strategic product offering (TruBlend™ fiber technology) for INVSITA  \n\tDeveloped new outsource vendors in support of business needs by identifying suppliers, managing material specifications, directing the supply chain logistics, and quality system development. \n\tCoordinated negotiations with an emphasis on security of supply, quality, and competitive pricing while achieving cost reductions in order to create long term value in accordance with MBM guiding principles. \n\tAccountable and primary point of contact to outsource vendors regarding all operational matters. \n\tActively monitored supplier performance and initiated performance action plans to reduce project risk as well as strengthen the INVSITA/Supplier relationship. \n\tExceptional and high-speed integration into INVSITA culture and fiber manufacturing sector Senior Contracts Manager Intel Corporation June 2006  –  January 2011  (4 years 8 months) \tEfficiently Managed construction procurement and supplier relations for all Colorado Construction activities totaling $340 million. \n\tSuccessfully achieved $24.2 million in cost savings through direct negotiations with trade contractors. \n\tDeveloped and implemented project execution strategies and action plans that ensured the maximization of project scope, schedule, quality, budget, safety, and supplier relations. \n\tPartnered with business leaders to identify and implement organizational development initiatives in order to increase employee focus and performance against department directives. \n\tLed the consolidation of the supplier base and creation of a preferred supplier pool with local and global contracts in order to enhance supplier relations and reduce Corporate database costs. \n\tOutstanding supplier and business partner manager acting as the liaison between the Intel customer and trade contractor management. CCM Intel 2009  –  2010  (1 year) Contracts Materials Manager Intel Corporation April 2003  –  June 2006  (3 years 3 months) \tProvided technical expertise and troubleshooting support to domestic and international facilities to resolve procurement issues ensuring project execution while enhancing supplier relationships.  \n\tOptimized “Best Total Cost” for my company driving the RFP process by using both traditional methods as well as internet negotiation platforms (Freemarkets and Ariba) while engaging suppliers, maintaining both quality and specification compliant products and services. \n\tDelivered significant Company-wide cost savings and value improvement as a result of identifying and executing strategic purchasing opportunities for materials, services, and supplies. \n\tReceived the Intel Departmental Recognition Award as a result of developing the “Construction Manager As Advisor Contract” (Terms and Conditions) and project scope of work. \n\tProactively managed Intel/Supplier relationship through the development and execution of monthly supplier performance evaluations. Contract Administrator Intel Corporation July 2000  –  April 2003  (2 years 10 months) \tAnalyzed supplier qualifications to ensure that Intel bid to contractors that were financially solvent, quality driven, schedule compliant, and maintained a robust safety culture. \n\tEnsured contract compliance utilizing contract reviews, contract correspondence, and legal notices. \n\tPrepared contract documents and project releases to enable purchase order generation. \n\tMonitored the supplier invoicing process to ensure contractors were paid according to contract terms. \n\tPerformed commercial bid evaluations of supplier proposals and coordinated technical evaluations and recommendations to senior management. Visual Retail Segment Marketing Manager Intel Corporation December 2014  – Present (9 months) Chandler, Arizona Responsible for the marketing and scaling of Digital Signage (DS), Interactive Kiosks, brand specific Automated Retail and interactive whiteboard segments. Innovating, driving and marketing the Visual Retail strategies and Intel IP solutions including HW, SW and Analytics into the Retail Sector ecosystem, end customers and brands. Visual Retail Segment Marketing Manager Intel Corporation December 2014  – Present (9 months) Chandler, Arizona Responsible for the marketing and scaling of Digital Signage (DS), Interactive Kiosks, brand specific Automated Retail and interactive whiteboard segments. Innovating, driving and marketing the Visual Retail strategies and Intel IP solutions including HW, SW and Analytics into the Retail Sector ecosystem, end customers and brands. Procurement Manager - Construction Services Intel Corporation August 2013  – Present (2 years 1 month) Chandler, AZ Procurement Manager - Construction Services Intel Corporation August 2013  – Present (2 years 1 month) Chandler, AZ Americas Outsource Operations Sourcing & Procurement Manager INVISTA January 2011  –  August 2013  (2 years 8 months) Kennesaw, GA Hired to manage the all North and South American outsource operations, sourcing, and procurement efforts in support of Performance Surfaces and Materials initiatives. Reports directly to Global Procurement Manager and managed a portfolio of 25 suppliers and $40 million in spends. \n \nAccomplishments: \n\tFacilitated all Sourcing and Procurement activities to create greatest possible strategic sourcing leverage to provide highest possible level of support for INVISTA internal and external customers. \n\tActively lead and managed the raw material and material processing of post-consumer fibers which enabled the innovative strategic product offering (TruBlend™ fiber technology) for INVSITA  \n\tDeveloped new outsource vendors in support of business needs by identifying suppliers, managing material specifications, directing the supply chain logistics, and quality system development. \n\tCoordinated negotiations with an emphasis on security of supply, quality, and competitive pricing while achieving cost reductions in order to create long term value in accordance with MBM guiding principles. \n\tAccountable and primary point of contact to outsource vendors regarding all operational matters. \n\tActively monitored supplier performance and initiated performance action plans to reduce project risk as well as strengthen the INVSITA/Supplier relationship. \n\tExceptional and high-speed integration into INVSITA culture and fiber manufacturing sector Americas Outsource Operations Sourcing & Procurement Manager INVISTA January 2011  –  August 2013  (2 years 8 months) Kennesaw, GA Hired to manage the all North and South American outsource operations, sourcing, and procurement efforts in support of Performance Surfaces and Materials initiatives. Reports directly to Global Procurement Manager and managed a portfolio of 25 suppliers and $40 million in spends. \n \nAccomplishments: \n\tFacilitated all Sourcing and Procurement activities to create greatest possible strategic sourcing leverage to provide highest possible level of support for INVISTA internal and external customers. \n\tActively lead and managed the raw material and material processing of post-consumer fibers which enabled the innovative strategic product offering (TruBlend™ fiber technology) for INVSITA  \n\tDeveloped new outsource vendors in support of business needs by identifying suppliers, managing material specifications, directing the supply chain logistics, and quality system development. \n\tCoordinated negotiations with an emphasis on security of supply, quality, and competitive pricing while achieving cost reductions in order to create long term value in accordance with MBM guiding principles. \n\tAccountable and primary point of contact to outsource vendors regarding all operational matters. \n\tActively monitored supplier performance and initiated performance action plans to reduce project risk as well as strengthen the INVSITA/Supplier relationship. \n\tExceptional and high-speed integration into INVSITA culture and fiber manufacturing sector Senior Contracts Manager Intel Corporation June 2006  –  January 2011  (4 years 8 months) \tEfficiently Managed construction procurement and supplier relations for all Colorado Construction activities totaling $340 million. \n\tSuccessfully achieved $24.2 million in cost savings through direct negotiations with trade contractors. \n\tDeveloped and implemented project execution strategies and action plans that ensured the maximization of project scope, schedule, quality, budget, safety, and supplier relations. \n\tPartnered with business leaders to identify and implement organizational development initiatives in order to increase employee focus and performance against department directives. \n\tLed the consolidation of the supplier base and creation of a preferred supplier pool with local and global contracts in order to enhance supplier relations and reduce Corporate database costs. \n\tOutstanding supplier and business partner manager acting as the liaison between the Intel customer and trade contractor management. Senior Contracts Manager Intel Corporation June 2006  –  January 2011  (4 years 8 months) \tEfficiently Managed construction procurement and supplier relations for all Colorado Construction activities totaling $340 million. \n\tSuccessfully achieved $24.2 million in cost savings through direct negotiations with trade contractors. \n\tDeveloped and implemented project execution strategies and action plans that ensured the maximization of project scope, schedule, quality, budget, safety, and supplier relations. \n\tPartnered with business leaders to identify and implement organizational development initiatives in order to increase employee focus and performance against department directives. \n\tLed the consolidation of the supplier base and creation of a preferred supplier pool with local and global contracts in order to enhance supplier relations and reduce Corporate database costs. \n\tOutstanding supplier and business partner manager acting as the liaison between the Intel customer and trade contractor management. CCM Intel 2009  –  2010  (1 year) CCM Intel 2009  –  2010  (1 year) Contracts Materials Manager Intel Corporation April 2003  –  June 2006  (3 years 3 months) \tProvided technical expertise and troubleshooting support to domestic and international facilities to resolve procurement issues ensuring project execution while enhancing supplier relationships.  \n\tOptimized “Best Total Cost” for my company driving the RFP process by using both traditional methods as well as internet negotiation platforms (Freemarkets and Ariba) while engaging suppliers, maintaining both quality and specification compliant products and services. \n\tDelivered significant Company-wide cost savings and value improvement as a result of identifying and executing strategic purchasing opportunities for materials, services, and supplies. \n\tReceived the Intel Departmental Recognition Award as a result of developing the “Construction Manager As Advisor Contract” (Terms and Conditions) and project scope of work. \n\tProactively managed Intel/Supplier relationship through the development and execution of monthly supplier performance evaluations. Contracts Materials Manager Intel Corporation April 2003  –  June 2006  (3 years 3 months) \tProvided technical expertise and troubleshooting support to domestic and international facilities to resolve procurement issues ensuring project execution while enhancing supplier relationships.  \n\tOptimized “Best Total Cost” for my company driving the RFP process by using both traditional methods as well as internet negotiation platforms (Freemarkets and Ariba) while engaging suppliers, maintaining both quality and specification compliant products and services. \n\tDelivered significant Company-wide cost savings and value improvement as a result of identifying and executing strategic purchasing opportunities for materials, services, and supplies. \n\tReceived the Intel Departmental Recognition Award as a result of developing the “Construction Manager As Advisor Contract” (Terms and Conditions) and project scope of work. \n\tProactively managed Intel/Supplier relationship through the development and execution of monthly supplier performance evaluations. Contract Administrator Intel Corporation July 2000  –  April 2003  (2 years 10 months) \tAnalyzed supplier qualifications to ensure that Intel bid to contractors that were financially solvent, quality driven, schedule compliant, and maintained a robust safety culture. \n\tEnsured contract compliance utilizing contract reviews, contract correspondence, and legal notices. \n\tPrepared contract documents and project releases to enable purchase order generation. \n\tMonitored the supplier invoicing process to ensure contractors were paid according to contract terms. \n\tPerformed commercial bid evaluations of supplier proposals and coordinated technical evaluations and recommendations to senior management. Contract Administrator Intel Corporation July 2000  –  April 2003  (2 years 10 months) \tAnalyzed supplier qualifications to ensure that Intel bid to contractors that were financially solvent, quality driven, schedule compliant, and maintained a robust safety culture. \n\tEnsured contract compliance utilizing contract reviews, contract correspondence, and legal notices. \n\tPrepared contract documents and project releases to enable purchase order generation. \n\tMonitored the supplier invoicing process to ensure contractors were paid according to contract terms. \n\tPerformed commercial bid evaluations of supplier proposals and coordinated technical evaluations and recommendations to senior management. Skills Supplier Management Contract Negotiations Business Analysis Procurement Contract Management Cross-functional Team... Cost Budgeting Customer Relations Strategic Sourcing Cost Reduction Supply Chain Management Contract Negotiation Sourcing Purchasing Budgets Supply Management Customer Service Program Management Business Process... SAP Strategy Project Management Operations Management Team Building Manufacturing Outsourcing Project Planning Cost Management Six Sigma Management Global Sourcing Process Improvement Leadership Supply Chain Continuous Improvement Negotiation Supplier Negotiation Lean Manufacturing Process Engineering Supplier Development Vendor Management Materials Management Facilities Management MRP Supplier Evaluation Forecasting Change Management Product Development Pricing See 35+     See less Skills  Supplier Management Contract Negotiations Business Analysis Procurement Contract Management Cross-functional Team... Cost Budgeting Customer Relations Strategic Sourcing Cost Reduction Supply Chain Management Contract Negotiation Sourcing Purchasing Budgets Supply Management Customer Service Program Management Business Process... SAP Strategy Project Management Operations Management Team Building Manufacturing Outsourcing Project Planning Cost Management Six Sigma Management Global Sourcing Process Improvement Leadership Supply Chain Continuous Improvement Negotiation Supplier Negotiation Lean Manufacturing Process Engineering Supplier Development Vendor Management Materials Management Facilities Management MRP Supplier Evaluation Forecasting Change Management Product Development Pricing See 35+     See less Supplier Management Contract Negotiations Business Analysis Procurement Contract Management Cross-functional Team... Cost Budgeting Customer Relations Strategic Sourcing Cost Reduction Supply Chain Management Contract Negotiation Sourcing Purchasing Budgets Supply Management Customer Service Program Management Business Process... SAP Strategy Project Management Operations Management Team Building Manufacturing Outsourcing Project Planning Cost Management Six Sigma Management Global Sourcing Process Improvement Leadership Supply Chain Continuous Improvement Negotiation Supplier Negotiation Lean Manufacturing Process Engineering Supplier Development Vendor Management Materials Management Facilities Management MRP Supplier Evaluation Forecasting Change Management Product Development Pricing See 35+     See less Supplier Management Contract Negotiations Business Analysis Procurement Contract Management Cross-functional Team... Cost Budgeting Customer Relations Strategic Sourcing Cost Reduction Supply Chain Management Contract Negotiation Sourcing Purchasing Budgets Supply Management Customer Service Program Management Business Process... SAP Strategy Project Management Operations Management Team Building Manufacturing Outsourcing Project Planning Cost Management Six Sigma Management Global Sourcing Process Improvement Leadership Supply Chain Continuous Improvement Negotiation Supplier Negotiation Lean Manufacturing Process Engineering Supplier Development Vendor Management Materials Management Facilities Management MRP Supplier Evaluation Forecasting Change Management Product Development Pricing See 35+     See less Education Purdue University - Krannert School of Management Executive MBA,  Business Administration 2006  – 2008 Activities and Societies:  Graduated Magna Cum Laude\nInternational Honor Society Beta Gamma Sigma\nExecutive MBA Class President Oregon State University Bachelors,  Business Administration 1996  – 2000 Activities and Societies:  Graduated Magna Cum Laude\nInternational Honor Society Beta Gamma Sigma\nDepartment of the Army Superior Cadet Award\nWaldo-Cummings Student Award Purdue University - Krannert School of Management Executive MBA,  Business Administration 2006  – 2008 Activities and Societies:  Graduated Magna Cum Laude\nInternational Honor Society Beta Gamma Sigma\nExecutive MBA Class President Purdue University - Krannert School of Management Executive MBA,  Business Administration 2006  – 2008 Activities and Societies:  Graduated Magna Cum Laude\nInternational Honor Society Beta Gamma Sigma\nExecutive MBA Class President Purdue University - Krannert School of Management Executive MBA,  Business Administration 2006  – 2008 Activities and Societies:  Graduated Magna Cum Laude\nInternational Honor Society Beta Gamma Sigma\nExecutive MBA Class President Oregon State University Bachelors,  Business Administration 1996  – 2000 Activities and Societies:  Graduated Magna Cum Laude\nInternational Honor Society Beta Gamma Sigma\nDepartment of the Army Superior Cadet Award\nWaldo-Cummings Student Award Oregon State University Bachelors,  Business Administration 1996  – 2000 Activities and Societies:  Graduated Magna Cum Laude\nInternational Honor Society Beta Gamma Sigma\nDepartment of the Army Superior Cadet Award\nWaldo-Cummings Student Award Oregon State University Bachelors,  Business Administration 1996  – 2000 Activities and Societies:  Graduated Magna Cum Laude\nInternational Honor Society Beta Gamma Sigma\nDepartment of the Army Superior Cadet Award\nWaldo-Cummings Student Award ", "Summary VICE PRESIDENT / DIRECTOR – OPERATIONS / SUPPLY CHAIN \n \nAs a multifaceted operations and supply chain professional, I maximize output, efficiencies and cost controls to ensure profitability in difficult market conditions. I excel in turning around domestic and international multi-location organizations to best use resources. \n \nI bring seamless integration of new and improved ideas and processes to domestic and international organizations, and I have documented successes that have delivered world class results in manufacturing, semiconductor, alternate energy, industrial equipment, logistics and Fortune 100 companies. My strengths include:  \n \n•\tTransforming organizations into strategically focused high performance teams \n•\tExcelling in managing cross-cultural organizations \n•\tDelivering significant cost reductions \n•\tMaximizing global supply chains \n•\tImproving productivity to ensure profitability \n \nI earned my MBA from Thunderbird, The American Graduate School of International Management, and my BBA is from Trinity University. I am Six Sigma Green belt certified. Others describe me as a self-starter with strong attention to detail. I negotiate win-win outcomes, and have excellent team leadership abilities. Specialties:P&L / Lean Manufacturing / Asian Sourcing / Inventory Cost Control / B2B / Vendor Management Asset Control / MRP / Outsourcing / Contracts / Pricing / Kaizen / Turnarounds / Product Launch Summary VICE PRESIDENT / DIRECTOR – OPERATIONS / SUPPLY CHAIN \n \nAs a multifaceted operations and supply chain professional, I maximize output, efficiencies and cost controls to ensure profitability in difficult market conditions. I excel in turning around domestic and international multi-location organizations to best use resources. \n \nI bring seamless integration of new and improved ideas and processes to domestic and international organizations, and I have documented successes that have delivered world class results in manufacturing, semiconductor, alternate energy, industrial equipment, logistics and Fortune 100 companies. My strengths include:  \n \n•\tTransforming organizations into strategically focused high performance teams \n•\tExcelling in managing cross-cultural organizations \n•\tDelivering significant cost reductions \n•\tMaximizing global supply chains \n•\tImproving productivity to ensure profitability \n \nI earned my MBA from Thunderbird, The American Graduate School of International Management, and my BBA is from Trinity University. I am Six Sigma Green belt certified. Others describe me as a self-starter with strong attention to detail. I negotiate win-win outcomes, and have excellent team leadership abilities. Specialties:P&L / Lean Manufacturing / Asian Sourcing / Inventory Cost Control / B2B / Vendor Management Asset Control / MRP / Outsourcing / Contracts / Pricing / Kaizen / Turnarounds / Product Launch VICE PRESIDENT / DIRECTOR – OPERATIONS / SUPPLY CHAIN \n \nAs a multifaceted operations and supply chain professional, I maximize output, efficiencies and cost controls to ensure profitability in difficult market conditions. I excel in turning around domestic and international multi-location organizations to best use resources. \n \nI bring seamless integration of new and improved ideas and processes to domestic and international organizations, and I have documented successes that have delivered world class results in manufacturing, semiconductor, alternate energy, industrial equipment, logistics and Fortune 100 companies. My strengths include:  \n \n•\tTransforming organizations into strategically focused high performance teams \n•\tExcelling in managing cross-cultural organizations \n•\tDelivering significant cost reductions \n•\tMaximizing global supply chains \n•\tImproving productivity to ensure profitability \n \nI earned my MBA from Thunderbird, The American Graduate School of International Management, and my BBA is from Trinity University. I am Six Sigma Green belt certified. Others describe me as a self-starter with strong attention to detail. I negotiate win-win outcomes, and have excellent team leadership abilities. Specialties:P&L / Lean Manufacturing / Asian Sourcing / Inventory Cost Control / B2B / Vendor Management Asset Control / MRP / Outsourcing / Contracts / Pricing / Kaizen / Turnarounds / Product Launch VICE PRESIDENT / DIRECTOR – OPERATIONS / SUPPLY CHAIN \n \nAs a multifaceted operations and supply chain professional, I maximize output, efficiencies and cost controls to ensure profitability in difficult market conditions. I excel in turning around domestic and international multi-location organizations to best use resources. \n \nI bring seamless integration of new and improved ideas and processes to domestic and international organizations, and I have documented successes that have delivered world class results in manufacturing, semiconductor, alternate energy, industrial equipment, logistics and Fortune 100 companies. My strengths include:  \n \n•\tTransforming organizations into strategically focused high performance teams \n•\tExcelling in managing cross-cultural organizations \n•\tDelivering significant cost reductions \n•\tMaximizing global supply chains \n•\tImproving productivity to ensure profitability \n \nI earned my MBA from Thunderbird, The American Graduate School of International Management, and my BBA is from Trinity University. I am Six Sigma Green belt certified. Others describe me as a self-starter with strong attention to detail. I negotiate win-win outcomes, and have excellent team leadership abilities. Specialties:P&L / Lean Manufacturing / Asian Sourcing / Inventory Cost Control / B2B / Vendor Management Asset Control / MRP / Outsourcing / Contracts / Pricing / Kaizen / Turnarounds / Product Launch Experience Senior Director - Supply Chain Seventy Seven Energy July 2014  – Present (1 year 2 months) Senior Director - Supply Chain Chesapeake Oilfield Services May 2012  –  June 2014  (2 years 2 months) Oklahoma City, Oklahoma Area Chief Executive Officer GILA TRUCKING May 2011  –  May 2012  (1 year 1 month) Gila Trucking, LLC a $15M oil, gas and energy trucking company, 2011 to present. Direct P&L for logistics company including oversight of operations, procurement, fleet management, strategic planning and business development. Manage 50 employees and oversee $15M budget. General Manager NORTH AMERICAN POWER SYSTEMS October 2008  –  May 2011  (2 years 8 months) (NorAm), a $12M industrial equipment company, 2008 to 2011. Managed turnaround activities and oversaw production, warehousing, sourcing and inventory control. Directed staff of 40. Accepted additional role and managed both the North American Power System and Warren CAT positions concurrently. Director of Purchasing Warren Cat May 2008  –  May 2011  (3 years 1 month) Midland, TX • Led the corporate procurement organization responsible for over $100M in spends in indirect and direct commodities. \n• Developed and grew the corporate procurement department and achieved over $5M in savings through alternate sourcing and supplier consolidation while improving product and service quality as measured through supplier report cards. \n• Implemented corporate purchasing policies and developed a preferred supplier base to ensure spending controls, compliance, quality, and cost savings.  \n• Led the Caterpillar Dealerships of North American Purchasing Group as Chairman and negotiated multiple contracts and benchmark projects on behalf of over 40 CAT Dealerships which resulted in cost savings and improved purchasing practices. Director of Purchasing Evergreen Solar February 2005  –  April 2008  (3 years 3 months) Global Manufacturer of silicon wafers, cells, and photovoltaic panels \nDirector of Purchasing \n \nLed the corporate supply chain organization responsible for the development and implementation of global strategic sourcing strategies and supplier management of critical raw materials and capital equipment, overall corporate spending (~$400M global spends), and operational support for technology development and high volume manufacturing operations. \nDeveloped and implemented key supply chain tools, metrics, and business processes: developed and implemented a supplier report card, improved on time delivery from an average of 50% to >85% in 1 year, and oversaw the implementation of a MRP/ERP system corporate wide; developed Corporate Supply Agreements and purchase order terms and conditions; established controls to improve spending visibility and ensure Sarbanes Oxley compliance. \nEstablished strategic partnerships and negotiated multi-year, multi-site supply agreements with key suppliers (U.S., Europe, and Asia) in support of significant manufacturing operation expansions (>100% average annual growth rate) while accomplishing an average of >10% annual cost savings for key commodities. \nLed key corporate initiatives and programs: drove supply chain readiness for joint venture factories in Germany and high volume factory expansion in the U.S., developed strategic cost reduction and sourcing roadmaps in support of corporate long-range plans, implemented a corporate procurement card to improve productivity by 30% while improving spends controls. \nDeveloped the corporate supply chain organization in support of corporate strategic programs and growth in spending from $40M to $400M in 3 years. Americas Indirect Materials Manager Intel Corporation January 2003  –  February 2005  (2 years 2 months) Managed a team of 18 people in support of Assembly Technology Development (ATD) Operations in Chandler and Costa Rica Assembly Test Manufacturing.  \nLed a global, cross functional Joint Material Operations team and drove multiple global teams to achieve $46.6M of cost savings, 68% consignment inventory, and significant improvements in controls, business continuity planning, and business processes. \nCollaborated with cross functional organizations to develop a global infrastructure to ensure 100% materials and service readiness for new capital equipment start-ups. \nDeveloped a global, competitive sourcing team focused on consolidating over 200 suppliers and enabling sourcing of over $180M of material spends through a focused supply base. \nLed a 6 Sigma Green Belt project that delivered 100% warranty capture ($20M ROI) and improved asset management on capital equipment through improved data integrity. Direct Materials Purchasing Manager Intel Corporation April 2001  –  December 2002  (1 year 9 months) Managed a team of 8 people in support of ATD Operations and achieved all time high operational indicator goals (inventory, controls, and cost) in 2001. \nPartnered with Finance to reduce scrap by over 90% and to reduce excess inventory by 62%. Maintained less than 30 days of inventory with no availability issues to ATD. \nIntroduced departmental and global cost savings goals. Achieved $3M in cost savings from a goal of $2M in 2001 and achieved over $28.5M in 2002 from a goal of $16.6M. \nDeveloped a global infrastructure for direct material purchasing organizations to focus on cost savings, people development, business process, and productivity. \nManaged $30M of procurement and inventory for a complex development and engineering operation, ensuring all requirements for direct materials were supported within ATD. Director of Sales FLI LINE TOOL CORPORATION January 1995  –  January 1997  (2 years 1 month) Developed and implemented pricing and cost strategies for core products that resulted in 150% increase in revenue in 2 years.  \nCreated and negotiated contracts with strategic business partners and investors. Senior Director - Supply Chain Seventy Seven Energy July 2014  – Present (1 year 2 months) Senior Director - Supply Chain Seventy Seven Energy July 2014  – Present (1 year 2 months) Senior Director - Supply Chain Chesapeake Oilfield Services May 2012  –  June 2014  (2 years 2 months) Oklahoma City, Oklahoma Area Senior Director - Supply Chain Chesapeake Oilfield Services May 2012  –  June 2014  (2 years 2 months) Oklahoma City, Oklahoma Area Chief Executive Officer GILA TRUCKING May 2011  –  May 2012  (1 year 1 month) Gila Trucking, LLC a $15M oil, gas and energy trucking company, 2011 to present. Direct P&L for logistics company including oversight of operations, procurement, fleet management, strategic planning and business development. Manage 50 employees and oversee $15M budget. Chief Executive Officer GILA TRUCKING May 2011  –  May 2012  (1 year 1 month) Gila Trucking, LLC a $15M oil, gas and energy trucking company, 2011 to present. Direct P&L for logistics company including oversight of operations, procurement, fleet management, strategic planning and business development. Manage 50 employees and oversee $15M budget. General Manager NORTH AMERICAN POWER SYSTEMS October 2008  –  May 2011  (2 years 8 months) (NorAm), a $12M industrial equipment company, 2008 to 2011. Managed turnaround activities and oversaw production, warehousing, sourcing and inventory control. Directed staff of 40. Accepted additional role and managed both the North American Power System and Warren CAT positions concurrently. General Manager NORTH AMERICAN POWER SYSTEMS October 2008  –  May 2011  (2 years 8 months) (NorAm), a $12M industrial equipment company, 2008 to 2011. Managed turnaround activities and oversaw production, warehousing, sourcing and inventory control. Directed staff of 40. Accepted additional role and managed both the North American Power System and Warren CAT positions concurrently. Director of Purchasing Warren Cat May 2008  –  May 2011  (3 years 1 month) Midland, TX • Led the corporate procurement organization responsible for over $100M in spends in indirect and direct commodities. \n• Developed and grew the corporate procurement department and achieved over $5M in savings through alternate sourcing and supplier consolidation while improving product and service quality as measured through supplier report cards. \n• Implemented corporate purchasing policies and developed a preferred supplier base to ensure spending controls, compliance, quality, and cost savings.  \n• Led the Caterpillar Dealerships of North American Purchasing Group as Chairman and negotiated multiple contracts and benchmark projects on behalf of over 40 CAT Dealerships which resulted in cost savings and improved purchasing practices. Director of Purchasing Warren Cat May 2008  –  May 2011  (3 years 1 month) Midland, TX • Led the corporate procurement organization responsible for over $100M in spends in indirect and direct commodities. \n• Developed and grew the corporate procurement department and achieved over $5M in savings through alternate sourcing and supplier consolidation while improving product and service quality as measured through supplier report cards. \n• Implemented corporate purchasing policies and developed a preferred supplier base to ensure spending controls, compliance, quality, and cost savings.  \n• Led the Caterpillar Dealerships of North American Purchasing Group as Chairman and negotiated multiple contracts and benchmark projects on behalf of over 40 CAT Dealerships which resulted in cost savings and improved purchasing practices. Director of Purchasing Evergreen Solar February 2005  –  April 2008  (3 years 3 months) Global Manufacturer of silicon wafers, cells, and photovoltaic panels \nDirector of Purchasing \n \nLed the corporate supply chain organization responsible for the development and implementation of global strategic sourcing strategies and supplier management of critical raw materials and capital equipment, overall corporate spending (~$400M global spends), and operational support for technology development and high volume manufacturing operations. \nDeveloped and implemented key supply chain tools, metrics, and business processes: developed and implemented a supplier report card, improved on time delivery from an average of 50% to >85% in 1 year, and oversaw the implementation of a MRP/ERP system corporate wide; developed Corporate Supply Agreements and purchase order terms and conditions; established controls to improve spending visibility and ensure Sarbanes Oxley compliance. \nEstablished strategic partnerships and negotiated multi-year, multi-site supply agreements with key suppliers (U.S., Europe, and Asia) in support of significant manufacturing operation expansions (>100% average annual growth rate) while accomplishing an average of >10% annual cost savings for key commodities. \nLed key corporate initiatives and programs: drove supply chain readiness for joint venture factories in Germany and high volume factory expansion in the U.S., developed strategic cost reduction and sourcing roadmaps in support of corporate long-range plans, implemented a corporate procurement card to improve productivity by 30% while improving spends controls. \nDeveloped the corporate supply chain organization in support of corporate strategic programs and growth in spending from $40M to $400M in 3 years. Director of Purchasing Evergreen Solar February 2005  –  April 2008  (3 years 3 months) Global Manufacturer of silicon wafers, cells, and photovoltaic panels \nDirector of Purchasing \n \nLed the corporate supply chain organization responsible for the development and implementation of global strategic sourcing strategies and supplier management of critical raw materials and capital equipment, overall corporate spending (~$400M global spends), and operational support for technology development and high volume manufacturing operations. \nDeveloped and implemented key supply chain tools, metrics, and business processes: developed and implemented a supplier report card, improved on time delivery from an average of 50% to >85% in 1 year, and oversaw the implementation of a MRP/ERP system corporate wide; developed Corporate Supply Agreements and purchase order terms and conditions; established controls to improve spending visibility and ensure Sarbanes Oxley compliance. \nEstablished strategic partnerships and negotiated multi-year, multi-site supply agreements with key suppliers (U.S., Europe, and Asia) in support of significant manufacturing operation expansions (>100% average annual growth rate) while accomplishing an average of >10% annual cost savings for key commodities. \nLed key corporate initiatives and programs: drove supply chain readiness for joint venture factories in Germany and high volume factory expansion in the U.S., developed strategic cost reduction and sourcing roadmaps in support of corporate long-range plans, implemented a corporate procurement card to improve productivity by 30% while improving spends controls. \nDeveloped the corporate supply chain organization in support of corporate strategic programs and growth in spending from $40M to $400M in 3 years. Americas Indirect Materials Manager Intel Corporation January 2003  –  February 2005  (2 years 2 months) Managed a team of 18 people in support of Assembly Technology Development (ATD) Operations in Chandler and Costa Rica Assembly Test Manufacturing.  \nLed a global, cross functional Joint Material Operations team and drove multiple global teams to achieve $46.6M of cost savings, 68% consignment inventory, and significant improvements in controls, business continuity planning, and business processes. \nCollaborated with cross functional organizations to develop a global infrastructure to ensure 100% materials and service readiness for new capital equipment start-ups. \nDeveloped a global, competitive sourcing team focused on consolidating over 200 suppliers and enabling sourcing of over $180M of material spends through a focused supply base. \nLed a 6 Sigma Green Belt project that delivered 100% warranty capture ($20M ROI) and improved asset management on capital equipment through improved data integrity. Americas Indirect Materials Manager Intel Corporation January 2003  –  February 2005  (2 years 2 months) Managed a team of 18 people in support of Assembly Technology Development (ATD) Operations in Chandler and Costa Rica Assembly Test Manufacturing.  \nLed a global, cross functional Joint Material Operations team and drove multiple global teams to achieve $46.6M of cost savings, 68% consignment inventory, and significant improvements in controls, business continuity planning, and business processes. \nCollaborated with cross functional organizations to develop a global infrastructure to ensure 100% materials and service readiness for new capital equipment start-ups. \nDeveloped a global, competitive sourcing team focused on consolidating over 200 suppliers and enabling sourcing of over $180M of material spends through a focused supply base. \nLed a 6 Sigma Green Belt project that delivered 100% warranty capture ($20M ROI) and improved asset management on capital equipment through improved data integrity. Direct Materials Purchasing Manager Intel Corporation April 2001  –  December 2002  (1 year 9 months) Managed a team of 8 people in support of ATD Operations and achieved all time high operational indicator goals (inventory, controls, and cost) in 2001. \nPartnered with Finance to reduce scrap by over 90% and to reduce excess inventory by 62%. Maintained less than 30 days of inventory with no availability issues to ATD. \nIntroduced departmental and global cost savings goals. Achieved $3M in cost savings from a goal of $2M in 2001 and achieved over $28.5M in 2002 from a goal of $16.6M. \nDeveloped a global infrastructure for direct material purchasing organizations to focus on cost savings, people development, business process, and productivity. \nManaged $30M of procurement and inventory for a complex development and engineering operation, ensuring all requirements for direct materials were supported within ATD. Direct Materials Purchasing Manager Intel Corporation April 2001  –  December 2002  (1 year 9 months) Managed a team of 8 people in support of ATD Operations and achieved all time high operational indicator goals (inventory, controls, and cost) in 2001. \nPartnered with Finance to reduce scrap by over 90% and to reduce excess inventory by 62%. Maintained less than 30 days of inventory with no availability issues to ATD. \nIntroduced departmental and global cost savings goals. Achieved $3M in cost savings from a goal of $2M in 2001 and achieved over $28.5M in 2002 from a goal of $16.6M. \nDeveloped a global infrastructure for direct material purchasing organizations to focus on cost savings, people development, business process, and productivity. \nManaged $30M of procurement and inventory for a complex development and engineering operation, ensuring all requirements for direct materials were supported within ATD. Director of Sales FLI LINE TOOL CORPORATION January 1995  –  January 1997  (2 years 1 month) Developed and implemented pricing and cost strategies for core products that resulted in 150% increase in revenue in 2 years.  \nCreated and negotiated contracts with strategic business partners and investors. Director of Sales FLI LINE TOOL CORPORATION January 1995  –  January 1997  (2 years 1 month) Developed and implemented pricing and cost strategies for core products that resulted in 150% increase in revenue in 2 years.  \nCreated and negotiated contracts with strategic business partners and investors. Skills Strategic Sourcing Supply Management Supply Chain Management Lean Manufacturing Global Sourcing Six Sigma Purchasing Supply Chain Procurement Manufacturing Sourcing Contract Negotiation Process Improvement Cross-functional Team... Continuous Improvement Contract Manufacturing Negotiation Operations Management Contract Management Logistics Management Program Management Sales Strategy Team Building See 10+     See less Skills  Strategic Sourcing Supply Management Supply Chain Management Lean Manufacturing Global Sourcing Six Sigma Purchasing Supply Chain Procurement Manufacturing Sourcing Contract Negotiation Process Improvement Cross-functional Team... Continuous Improvement Contract Manufacturing Negotiation Operations Management Contract Management Logistics Management Program Management Sales Strategy Team Building See 10+     See less Strategic Sourcing Supply Management Supply Chain Management Lean Manufacturing Global Sourcing Six Sigma Purchasing Supply Chain Procurement Manufacturing Sourcing Contract Negotiation Process Improvement Cross-functional Team... Continuous Improvement Contract Manufacturing Negotiation Operations Management Contract Management Logistics Management Program Management Sales Strategy Team Building See 10+     See less Strategic Sourcing Supply Management Supply Chain Management Lean Manufacturing Global Sourcing Six Sigma Purchasing Supply Chain Procurement Manufacturing Sourcing Contract Negotiation Process Improvement Cross-functional Team... Continuous Improvement Contract Manufacturing Negotiation Operations Management Contract Management Logistics Management Program Management Sales Strategy Team Building See 10+     See less Education Thunderbird School of Global Management MBA,  International Management - Operations 1997  – 1999 Activities and Societies:  Rugby Club Trinity University Bachelor of Science,  Finance ,  International Business ,  Marketing 1990  – 1994 Activities and Societies:  Alpha Kappa Psi ,  Tennis Team Thunderbird School of Global Management MBA,  International Management - Operations 1997  – 1999 Activities and Societies:  Rugby Club Thunderbird School of Global Management MBA,  International Management - Operations 1997  – 1999 Activities and Societies:  Rugby Club Thunderbird School of Global Management MBA,  International Management - Operations 1997  – 1999 Activities and Societies:  Rugby Club Trinity University Bachelor of Science,  Finance ,  International Business ,  Marketing 1990  – 1994 Activities and Societies:  Alpha Kappa Psi ,  Tennis Team Trinity University Bachelor of Science,  Finance ,  International Business ,  Marketing 1990  – 1994 Activities and Societies:  Alpha Kappa Psi ,  Tennis Team Trinity University Bachelor of Science,  Finance ,  International Business ,  Marketing 1990  – 1994 Activities and Societies:  Alpha Kappa Psi ,  Tennis Team ", "Skills Manufacturing Strategy Leadership Strategic Planning Cross-functional Team... Semiconductors Supply Chain Lean Manufacturing Process Engineering Product Management Start-ups Business Development Process Improvement Six Sigma Management Program Management Healthcare Supply Chain Management Negotiation SPC Operations Management Team Building Factory Continuous Improvement Operational Excellence Product Development Business Process... Change Management Organizational Culture Project Management Contract Negotiation Healthcare Management Business Strategy International Business See 19+     See less Skills  Manufacturing Strategy Leadership Strategic Planning Cross-functional Team... Semiconductors Supply Chain Lean Manufacturing Process Engineering Product Management Start-ups Business Development Process Improvement Six Sigma Management Program Management Healthcare Supply Chain Management Negotiation SPC Operations Management Team Building Factory Continuous Improvement Operational Excellence Product Development Business Process... Change Management Organizational Culture Project Management Contract Negotiation Healthcare Management Business Strategy International Business See 19+     See less Manufacturing Strategy Leadership Strategic Planning Cross-functional Team... Semiconductors Supply Chain Lean Manufacturing Process Engineering Product Management Start-ups Business Development Process Improvement Six Sigma Management Program Management Healthcare Supply Chain Management Negotiation SPC Operations Management Team Building Factory Continuous Improvement Operational Excellence Product Development Business Process... Change Management Organizational Culture Project Management Contract Negotiation Healthcare Management Business Strategy International Business See 19+     See less Manufacturing Strategy Leadership Strategic Planning Cross-functional Team... Semiconductors Supply Chain Lean Manufacturing Process Engineering Product Management Start-ups Business Development Process Improvement Six Sigma Management Program Management Healthcare Supply Chain Management Negotiation SPC Operations Management Team Building Factory Continuous Improvement Operational Excellence Product Development Business Process... Change Management Organizational Culture Project Management Contract Negotiation Healthcare Management Business Strategy International Business See 19+     See less ", "Experience Manager, Substrate Supplier Management Team Intel Corporation October 2013  – Present (1 year 11 months) Shanghai City, China Flip Chip Substrate Supplier Manager Intel Corporation May 2008  –  September 2013  (5 years 5 months) Tokyo, Japan Responsible for managing a couple of Intel's largest and most strategic suppliers \nIntel Global Sourcing & Procurement Country Manager Purchasing Manager, Flip Chip Substrates Intel Corporation March 2005  –  April 2007  (2 years 2 months) Materials Manager Intel Corporation December 2003  –  May 2005  (1 year 6 months) Manage Integral Heat Spreader & Passive Components commodity teams Materials Manager Intel Corporation February 2000  –  December 2003  (3 years 11 months) Managed Voltage Regulation and Passives Components commodity teams Commodity Manager Intel Corporation February 1999  –  February 2000  (1 year 1 month) Voltage Regulation Commodity Manager Intel Corporation November 1997  –  February 1999  (1 year 4 months) Passive Components Commodity Manager Strategic Sourcing Specialist Yaskawa America, Inc. - Drives & Motion Division June 1997  –  October 1997  (5 months) Purchasing Manager Yaskawa America, Inc. - Drives & Motion Division March 1996  –  June 1997  (1 year 4 months) Purchasing Project Coordinator Yaskawa America, Inc. - Drives & Motion Division March 1995  –  March 1996  (1 year 1 month) Supervisor Import/Export Purchasing Yaskawa America, Inc. - Drives & Motion Division March 1993  –  March 1995  (2 years 1 month) Inventory Planning Analyst Yaskawa America, Inc. - Drives & Motion Division March 1992  –  March 1993  (1 year 1 month) Jr. Buyer Yaskawa America, Inc. - Drives & Motion Division April 1991  –  March 1992  (1 year) Overseas Buyer Semblex Corporation June 1990  –  March 1991  (10 months) Manager, Substrate Supplier Management Team Intel Corporation October 2013  – Present (1 year 11 months) Shanghai City, China Manager, Substrate Supplier Management Team Intel Corporation October 2013  – Present (1 year 11 months) Shanghai City, China Flip Chip Substrate Supplier Manager Intel Corporation May 2008  –  September 2013  (5 years 5 months) Tokyo, Japan Responsible for managing a couple of Intel's largest and most strategic suppliers \nIntel Global Sourcing & Procurement Country Manager Flip Chip Substrate Supplier Manager Intel Corporation May 2008  –  September 2013  (5 years 5 months) Tokyo, Japan Responsible for managing a couple of Intel's largest and most strategic suppliers \nIntel Global Sourcing & Procurement Country Manager Purchasing Manager, Flip Chip Substrates Intel Corporation March 2005  –  April 2007  (2 years 2 months) Purchasing Manager, Flip Chip Substrates Intel Corporation March 2005  –  April 2007  (2 years 2 months) Materials Manager Intel Corporation December 2003  –  May 2005  (1 year 6 months) Manage Integral Heat Spreader & Passive Components commodity teams Materials Manager Intel Corporation December 2003  –  May 2005  (1 year 6 months) Manage Integral Heat Spreader & Passive Components commodity teams Materials Manager Intel Corporation February 2000  –  December 2003  (3 years 11 months) Managed Voltage Regulation and Passives Components commodity teams Materials Manager Intel Corporation February 2000  –  December 2003  (3 years 11 months) Managed Voltage Regulation and Passives Components commodity teams Commodity Manager Intel Corporation February 1999  –  February 2000  (1 year 1 month) Voltage Regulation Commodity Manager Intel Corporation February 1999  –  February 2000  (1 year 1 month) Voltage Regulation Commodity Manager Intel Corporation November 1997  –  February 1999  (1 year 4 months) Passive Components Commodity Manager Commodity Manager Intel Corporation November 1997  –  February 1999  (1 year 4 months) Passive Components Commodity Manager Strategic Sourcing Specialist Yaskawa America, Inc. - Drives & Motion Division June 1997  –  October 1997  (5 months) Strategic Sourcing Specialist Yaskawa America, Inc. - Drives & Motion Division June 1997  –  October 1997  (5 months) Purchasing Manager Yaskawa America, Inc. - Drives & Motion Division March 1996  –  June 1997  (1 year 4 months) Purchasing Manager Yaskawa America, Inc. - Drives & Motion Division March 1996  –  June 1997  (1 year 4 months) Purchasing Project Coordinator Yaskawa America, Inc. - Drives & Motion Division March 1995  –  March 1996  (1 year 1 month) Purchasing Project Coordinator Yaskawa America, Inc. - Drives & Motion Division March 1995  –  March 1996  (1 year 1 month) Supervisor Import/Export Purchasing Yaskawa America, Inc. - Drives & Motion Division March 1993  –  March 1995  (2 years 1 month) Supervisor Import/Export Purchasing Yaskawa America, Inc. - Drives & Motion Division March 1993  –  March 1995  (2 years 1 month) Inventory Planning Analyst Yaskawa America, Inc. - Drives & Motion Division March 1992  –  March 1993  (1 year 1 month) Inventory Planning Analyst Yaskawa America, Inc. - Drives & Motion Division March 1992  –  March 1993  (1 year 1 month) Jr. Buyer Yaskawa America, Inc. - Drives & Motion Division April 1991  –  March 1992  (1 year) Jr. Buyer Yaskawa America, Inc. - Drives & Motion Division April 1991  –  March 1992  (1 year) Overseas Buyer Semblex Corporation June 1990  –  March 1991  (10 months) Overseas Buyer Semblex Corporation June 1990  –  March 1991  (10 months) Skills Strategic Sourcing Management Purchasing Skills  Strategic Sourcing Management Purchasing Strategic Sourcing Management Purchasing Strategic Sourcing Management Purchasing Education University of Florida BA,  International Business 1986  – 1990 DePaul University - Charles H. Kellstadt Graduate School of Business MBA,  Operations Management University of Florida BA,  International Business 1986  – 1990 University of Florida BA,  International Business 1986  – 1990 University of Florida BA,  International Business 1986  – 1990 DePaul University - Charles H. Kellstadt Graduate School of Business MBA,  Operations Management DePaul University - Charles H. Kellstadt Graduate School of Business MBA,  Operations Management DePaul University - Charles H. Kellstadt Graduate School of Business MBA,  Operations Management ", "Summary Senior Sourcing and Supply Chain leader with extensive experience in the high tech manufacturing and Cloud services. Developed innovative supply chain practices to drive cost reduction while ensuring continuity of supply and time to market. Proven track record of raising the level of organizational performance and strategic contribution. Significant experience in vendor negotiations, outsourced manufacturing, supply chain planning & business process development. United States Government Top Secret Security clearance. \n \nSpecialties: • Leading global supply chain organizations supporting Cloud Infrastructure \n• OEM and ODM negotiations, business award/allocation while ensuring continuity of supply \n• Excel in people leadership, including performance management, coaching, team development & change management \n• Transformation of site/region focused to globally focused & aligned organizations \n• Vendor negotiation and management with particular focus in IT, outsourced manufacturing, site services and consulting disciplines \n• Business process development Summary Senior Sourcing and Supply Chain leader with extensive experience in the high tech manufacturing and Cloud services. Developed innovative supply chain practices to drive cost reduction while ensuring continuity of supply and time to market. Proven track record of raising the level of organizational performance and strategic contribution. Significant experience in vendor negotiations, outsourced manufacturing, supply chain planning & business process development. United States Government Top Secret Security clearance. \n \nSpecialties: • Leading global supply chain organizations supporting Cloud Infrastructure \n• OEM and ODM negotiations, business award/allocation while ensuring continuity of supply \n• Excel in people leadership, including performance management, coaching, team development & change management \n• Transformation of site/region focused to globally focused & aligned organizations \n• Vendor negotiation and management with particular focus in IT, outsourced manufacturing, site services and consulting disciplines \n• Business process development Senior Sourcing and Supply Chain leader with extensive experience in the high tech manufacturing and Cloud services. Developed innovative supply chain practices to drive cost reduction while ensuring continuity of supply and time to market. Proven track record of raising the level of organizational performance and strategic contribution. Significant experience in vendor negotiations, outsourced manufacturing, supply chain planning & business process development. United States Government Top Secret Security clearance. \n \nSpecialties: • Leading global supply chain organizations supporting Cloud Infrastructure \n• OEM and ODM negotiations, business award/allocation while ensuring continuity of supply \n• Excel in people leadership, including performance management, coaching, team development & change management \n• Transformation of site/region focused to globally focused & aligned organizations \n• Vendor negotiation and management with particular focus in IT, outsourced manufacturing, site services and consulting disciplines \n• Business process development Senior Sourcing and Supply Chain leader with extensive experience in the high tech manufacturing and Cloud services. Developed innovative supply chain practices to drive cost reduction while ensuring continuity of supply and time to market. Proven track record of raising the level of organizational performance and strategic contribution. Significant experience in vendor negotiations, outsourced manufacturing, supply chain planning & business process development. United States Government Top Secret Security clearance. \n \nSpecialties: • Leading global supply chain organizations supporting Cloud Infrastructure \n• OEM and ODM negotiations, business award/allocation while ensuring continuity of supply \n• Excel in people leadership, including performance management, coaching, team development & change management \n• Transformation of site/region focused to globally focused & aligned organizations \n• Vendor negotiation and management with particular focus in IT, outsourced manufacturing, site services and consulting disciplines \n• Business process development Experience Director of Strategic Sourcing Microsoft July 2013  – Present (2 years 2 months) Redmond, WA • Lead the sourcing strategy and procurement processes for server hardware fulfillment in support of Microsoft's global Cloud infrastructure  \n• Drive continual cost reduction while reducing lead-time from forecast to server dock and mitigating material liability exposure \n• Manage a global outsourced manufacturing vendor base to keep pace with Microsoft's exponential growth in Cloud services Supply Chain Planning Manager Amazon May 2012  –  July 2013  (1 year 3 months) Greater Seattle Area • Supply chain planning to ensure server hardware capacity and continuity of supply in support of Amazon's global Cloud (AWS) infrastructure.  \n• Consolidated divisional needs to create global demand forecast.  \n• Managed global commodity level (HDD, Memory, SSD) server level planning to ensure appropriate vendor allocations for cost optimization and continuity of supply. Global Purchasing Manager Mentor Graphics Corporation March 2007  –  May 2012  (5 years 3 months) Portland, Oregon Area • Led Mentor’s corporate purchasing organization. Corporate owner of procurement policies & tools.  \n• Created a global sourcing strategy to deliver cost reduction across IT, Facilities/Site Services, Marketing, Travel and Financial Services  \n• Drove specific commodity strategies and procurement transactional efficiency in support of a global customer base \n• Successfully launched SAP procurement application  Senior Materials Manager Credence Systems Corporation November 2005  –  March 2007  (1 year 5 months) • Led materials organization to drive cost reductions and manage materials availability for production and NPI.  \n• Reported to Sr VP of Operations and directly accountable to CEO and CFO as owner of corporate initiatives to reduce material lead-time and liability exposure. \n• Managed materials and vendor relationships in support of on-site and outsourced manufacturing \n• Organization exceeded material availability, lead-time reduction and on-time delivery goals Materials Manager Intel Corporation March 2003  –  November 2005  (2 years 9 months) • Managed an organization of 17 material program managers(MPMs) and buyers in support of a motherboard factory.  \n• Responsible for material availability and reducing material lead-time to deliver Intel silicon to the marketplace. Purchasing Manager Intel Corporation December 2000  –  March 2003  (2 years 4 months) • Managed buyers responsible for managing spending for Intel's Northwest Region.  \n• Developed and oversaw business processes to enable a materials-based competitive advantage in outsourced boards and systems production. Commodity Manager Intel Corporation February 1996  –  December 2000  (4 years 11 months) • Vendor selection, negotiation and commodity management across Facilities, Construction, Site Services and MRO commodities \n• Led multiple company-wide procurement initiatives to drive cross-region collaboration and cost reduction \n• Corporate Purchasing MRO commodity manager responsible for global sourcing strategy for MRO materials and services Director of Strategic Sourcing Microsoft July 2013  – Present (2 years 2 months) Redmond, WA • Lead the sourcing strategy and procurement processes for server hardware fulfillment in support of Microsoft's global Cloud infrastructure  \n• Drive continual cost reduction while reducing lead-time from forecast to server dock and mitigating material liability exposure \n• Manage a global outsourced manufacturing vendor base to keep pace with Microsoft's exponential growth in Cloud services Director of Strategic Sourcing Microsoft July 2013  – Present (2 years 2 months) Redmond, WA • Lead the sourcing strategy and procurement processes for server hardware fulfillment in support of Microsoft's global Cloud infrastructure  \n• Drive continual cost reduction while reducing lead-time from forecast to server dock and mitigating material liability exposure \n• Manage a global outsourced manufacturing vendor base to keep pace with Microsoft's exponential growth in Cloud services Supply Chain Planning Manager Amazon May 2012  –  July 2013  (1 year 3 months) Greater Seattle Area • Supply chain planning to ensure server hardware capacity and continuity of supply in support of Amazon's global Cloud (AWS) infrastructure.  \n• Consolidated divisional needs to create global demand forecast.  \n• Managed global commodity level (HDD, Memory, SSD) server level planning to ensure appropriate vendor allocations for cost optimization and continuity of supply. Supply Chain Planning Manager Amazon May 2012  –  July 2013  (1 year 3 months) Greater Seattle Area • Supply chain planning to ensure server hardware capacity and continuity of supply in support of Amazon's global Cloud (AWS) infrastructure.  \n• Consolidated divisional needs to create global demand forecast.  \n• Managed global commodity level (HDD, Memory, SSD) server level planning to ensure appropriate vendor allocations for cost optimization and continuity of supply. Global Purchasing Manager Mentor Graphics Corporation March 2007  –  May 2012  (5 years 3 months) Portland, Oregon Area • Led Mentor’s corporate purchasing organization. Corporate owner of procurement policies & tools.  \n• Created a global sourcing strategy to deliver cost reduction across IT, Facilities/Site Services, Marketing, Travel and Financial Services  \n• Drove specific commodity strategies and procurement transactional efficiency in support of a global customer base \n• Successfully launched SAP procurement application  Global Purchasing Manager Mentor Graphics Corporation March 2007  –  May 2012  (5 years 3 months) Portland, Oregon Area • Led Mentor’s corporate purchasing organization. Corporate owner of procurement policies & tools.  \n• Created a global sourcing strategy to deliver cost reduction across IT, Facilities/Site Services, Marketing, Travel and Financial Services  \n• Drove specific commodity strategies and procurement transactional efficiency in support of a global customer base \n• Successfully launched SAP procurement application  Senior Materials Manager Credence Systems Corporation November 2005  –  March 2007  (1 year 5 months) • Led materials organization to drive cost reductions and manage materials availability for production and NPI.  \n• Reported to Sr VP of Operations and directly accountable to CEO and CFO as owner of corporate initiatives to reduce material lead-time and liability exposure. \n• Managed materials and vendor relationships in support of on-site and outsourced manufacturing \n• Organization exceeded material availability, lead-time reduction and on-time delivery goals Senior Materials Manager Credence Systems Corporation November 2005  –  March 2007  (1 year 5 months) • Led materials organization to drive cost reductions and manage materials availability for production and NPI.  \n• Reported to Sr VP of Operations and directly accountable to CEO and CFO as owner of corporate initiatives to reduce material lead-time and liability exposure. \n• Managed materials and vendor relationships in support of on-site and outsourced manufacturing \n• Organization exceeded material availability, lead-time reduction and on-time delivery goals Materials Manager Intel Corporation March 2003  –  November 2005  (2 years 9 months) • Managed an organization of 17 material program managers(MPMs) and buyers in support of a motherboard factory.  \n• Responsible for material availability and reducing material lead-time to deliver Intel silicon to the marketplace. Materials Manager Intel Corporation March 2003  –  November 2005  (2 years 9 months) • Managed an organization of 17 material program managers(MPMs) and buyers in support of a motherboard factory.  \n• Responsible for material availability and reducing material lead-time to deliver Intel silicon to the marketplace. Purchasing Manager Intel Corporation December 2000  –  March 2003  (2 years 4 months) • Managed buyers responsible for managing spending for Intel's Northwest Region.  \n• Developed and oversaw business processes to enable a materials-based competitive advantage in outsourced boards and systems production. Purchasing Manager Intel Corporation December 2000  –  March 2003  (2 years 4 months) • Managed buyers responsible for managing spending for Intel's Northwest Region.  \n• Developed and oversaw business processes to enable a materials-based competitive advantage in outsourced boards and systems production. Commodity Manager Intel Corporation February 1996  –  December 2000  (4 years 11 months) • Vendor selection, negotiation and commodity management across Facilities, Construction, Site Services and MRO commodities \n• Led multiple company-wide procurement initiatives to drive cross-region collaboration and cost reduction \n• Corporate Purchasing MRO commodity manager responsible for global sourcing strategy for MRO materials and services Commodity Manager Intel Corporation February 1996  –  December 2000  (4 years 11 months) • Vendor selection, negotiation and commodity management across Facilities, Construction, Site Services and MRO commodities \n• Led multiple company-wide procurement initiatives to drive cross-region collaboration and cost reduction \n• Corporate Purchasing MRO commodity manager responsible for global sourcing strategy for MRO materials and services Skills Negotiation Budgets Leadership MRP Purchasing Product Development Change Management Project Management Supply Management Strategic Sourcing Materials Management Supply Chain Management Supply Chain Procurement Global Sourcing Cross-functional Team... Sourcing Contract Negotiation Outsourcing Vendor Management Program Management Manufacturing International Business Business Strategy Management See 10+     See less Skills  Negotiation Budgets Leadership MRP Purchasing Product Development Change Management Project Management Supply Management Strategic Sourcing Materials Management Supply Chain Management Supply Chain Procurement Global Sourcing Cross-functional Team... Sourcing Contract Negotiation Outsourcing Vendor Management Program Management Manufacturing International Business Business Strategy Management See 10+     See less Negotiation Budgets Leadership MRP Purchasing Product Development Change Management Project Management Supply Management Strategic Sourcing Materials Management Supply Chain Management Supply Chain Procurement Global Sourcing Cross-functional Team... Sourcing Contract Negotiation Outsourcing Vendor Management Program Management Manufacturing International Business Business Strategy Management See 10+     See less Negotiation Budgets Leadership MRP Purchasing Product Development Change Management Project Management Supply Management Strategic Sourcing Materials Management Supply Chain Management Supply Chain Procurement Global Sourcing Cross-functional Team... Sourcing Contract Negotiation Outsourcing Vendor Management Program Management Manufacturing International Business Business Strategy Management See 10+     See less Education Indiana University - Kelley School of Business MBA,  Logistics , Materials, and Supply Chain Management 2002  – 2004 University of Washington BA-Business,  Finance ,  Marketing 1990  – 1995 Indiana University - Kelley School of Business MBA,  Logistics , Materials, and Supply Chain Management 2002  – 2004 Indiana University - Kelley School of Business MBA,  Logistics , Materials, and Supply Chain Management 2002  – 2004 Indiana University - Kelley School of Business MBA,  Logistics , Materials, and Supply Chain Management 2002  – 2004 University of Washington BA-Business,  Finance ,  Marketing 1990  – 1995 University of Washington BA-Business,  Finance ,  Marketing 1990  – 1995 University of Washington BA-Business,  Finance ,  Marketing 1990  – 1995 ", "Languages English Native or bilingual proficiency English Native or bilingual proficiency English Native or bilingual proficiency Native or bilingual proficiency Skills Process Improvement Supply Chain Management Cross-functional Team... Six Sigma Operations Management Manufacturing Procurement Forecasting Lean Manufacturing Project Management Purchasing Program Management Vendor Management Strategic Planning Team Leadership Inventory Management Leadership Logistics Management Sourcing Strategic Sourcing Strategy Supplier Evaluation Supply Chain Product Development MRP Continuous Improvement Supply Management Materials Management Global Sourcing ERP Negotiation Team Building Analysis Contract Negotiation See 20+     See less Skills  Process Improvement Supply Chain Management Cross-functional Team... Six Sigma Operations Management Manufacturing Procurement Forecasting Lean Manufacturing Project Management Purchasing Program Management Vendor Management Strategic Planning Team Leadership Inventory Management Leadership Logistics Management Sourcing Strategic Sourcing Strategy Supplier Evaluation Supply Chain Product Development MRP Continuous Improvement Supply Management Materials Management Global Sourcing ERP Negotiation Team Building Analysis Contract Negotiation See 20+     See less Process Improvement Supply Chain Management Cross-functional Team... Six Sigma Operations Management Manufacturing Procurement Forecasting Lean Manufacturing Project Management Purchasing Program Management Vendor Management Strategic Planning Team Leadership Inventory Management Leadership Logistics Management Sourcing Strategic Sourcing Strategy Supplier Evaluation Supply Chain Product Development MRP Continuous Improvement Supply Management Materials Management Global Sourcing ERP Negotiation Team Building Analysis Contract Negotiation See 20+     See less Process Improvement Supply Chain Management Cross-functional Team... Six Sigma Operations Management Manufacturing Procurement Forecasting Lean Manufacturing Project Management Purchasing Program Management Vendor Management Strategic Planning Team Leadership Inventory Management Leadership Logistics Management Sourcing Strategic Sourcing Strategy Supplier Evaluation Supply Chain Product Development MRP Continuous Improvement Supply Management Materials Management Global Sourcing ERP Negotiation Team Building Analysis Contract Negotiation See 20+     See less Honors & Awards ", "Skills Supply Chain Management Project Management Business Process... Supply Management Strategic Sourcing Supply Chain MRP Materials Management Cross-functional Team... Lean Manufacturing Procurement Process Improvement Inventory Management Leadership Management Program Management See 1+     See less Skills  Supply Chain Management Project Management Business Process... Supply Management Strategic Sourcing Supply Chain MRP Materials Management Cross-functional Team... Lean Manufacturing Procurement Process Improvement Inventory Management Leadership Management Program Management See 1+     See less Supply Chain Management Project Management Business Process... Supply Management Strategic Sourcing Supply Chain MRP Materials Management Cross-functional Team... Lean Manufacturing Procurement Process Improvement Inventory Management Leadership Management Program Management See 1+     See less Supply Chain Management Project Management Business Process... Supply Management Strategic Sourcing Supply Chain MRP Materials Management Cross-functional Team... Lean Manufacturing Procurement Process Improvement Inventory Management Leadership Management Program Management See 1+     See less ", "Languages English Spanish English Spanish English Spanish Skills Supply Chain Management Demand Planning Latin America Supply Chain Supply Chain... Production Planning SAP Logistics Cross-functional Team... Materials Management Forecasting Warehouse Management MRP SAP R/3 Warehousing Strategic Sourcing Six Sigma ERP Manufacturing Supply Management Purchasing Pricing Strategy Leadership Supplier Development Analysis Negotiation Product Development Project Management Continuous Improvement Procurement Management Supply Chain Operations Process Engineering Process Improvement Consumer Products Logistics Management Change Management Strategic Planning Team Leadership Business Strategy Planning Lean Manufacturing See 28+     See less Skills  Supply Chain Management Demand Planning Latin America Supply Chain Supply Chain... Production Planning SAP Logistics Cross-functional Team... Materials Management Forecasting Warehouse Management MRP SAP R/3 Warehousing Strategic Sourcing Six Sigma ERP Manufacturing Supply Management Purchasing Pricing Strategy Leadership Supplier Development Analysis Negotiation Product Development Project Management Continuous Improvement Procurement Management Supply Chain Operations Process Engineering Process Improvement Consumer Products Logistics Management Change Management Strategic Planning Team Leadership Business Strategy Planning Lean Manufacturing See 28+     See less Supply Chain Management Demand Planning Latin America Supply Chain Supply Chain... Production Planning SAP Logistics Cross-functional Team... Materials Management Forecasting Warehouse Management MRP SAP R/3 Warehousing Strategic Sourcing Six Sigma ERP Manufacturing Supply Management Purchasing Pricing Strategy Leadership Supplier Development Analysis Negotiation Product Development Project Management Continuous Improvement Procurement Management Supply Chain Operations Process Engineering Process Improvement Consumer Products Logistics Management Change Management Strategic Planning Team Leadership Business Strategy Planning Lean Manufacturing See 28+     See less Supply Chain Management Demand Planning Latin America Supply Chain Supply Chain... Production Planning SAP Logistics Cross-functional Team... Materials Management Forecasting Warehouse Management MRP SAP R/3 Warehousing Strategic Sourcing Six Sigma ERP Manufacturing Supply Management Purchasing Pricing Strategy Leadership Supplier Development Analysis Negotiation Product Development Project Management Continuous Improvement Procurement Management Supply Chain Operations Process Engineering Process Improvement Consumer Products Logistics Management Change Management Strategic Planning Team Leadership Business Strategy Planning Lean Manufacturing See 28+     See less ", "Experience Materials Manager Intel Corporation August 2014  – Present (1 year 1 month) Intel/Rio Rancho Materials Manager Intel Corporation August 2014  – Present (1 year 1 month) Intel/Rio Rancho Materials Manager Intel Corporation August 2014  – Present (1 year 1 month) Intel/Rio Rancho Languages Spanish Spanish Spanish Skills Supply Management Strategic Sourcing Global Sourcing Supply Chain Management MRP Supply Chain Supplier Development Materials Management Procurement Supplier Negotiation Purchasing Supplier Evaluation Spend Analysis Lean Manufacturing Cross-functional Team... Manufacturing Continuous Improvement Semiconductors Supply Chain... Sourcing Process Improvement See 6+     See less Skills  Supply Management Strategic Sourcing Global Sourcing Supply Chain Management MRP Supply Chain Supplier Development Materials Management Procurement Supplier Negotiation Purchasing Supplier Evaluation Spend Analysis Lean Manufacturing Cross-functional Team... Manufacturing Continuous Improvement Semiconductors Supply Chain... Sourcing Process Improvement See 6+     See less Supply Management Strategic Sourcing Global Sourcing Supply Chain Management MRP Supply Chain Supplier Development Materials Management Procurement Supplier Negotiation Purchasing Supplier Evaluation Spend Analysis Lean Manufacturing Cross-functional Team... Manufacturing Continuous Improvement Semiconductors Supply Chain... Sourcing Process Improvement See 6+     See less Supply Management Strategic Sourcing Global Sourcing Supply Chain Management MRP Supply Chain Supplier Development Materials Management Procurement Supplier Negotiation Purchasing Supplier Evaluation Spend Analysis Lean Manufacturing Cross-functional Team... Manufacturing Continuous Improvement Semiconductors Supply Chain... Sourcing Process Improvement See 6+     See less Education The University of New Mexico Master of Arts (M.A.) The University of New Mexico Master of Arts (M.A.) The University of New Mexico Master of Arts (M.A.) The University of New Mexico Master of Arts (M.A.) Honors & Awards ", "Summary 32 years of Management and Leadership experience. Includes 8 years in Manufacturing, 11 years in Materials Management which includes Raw Materials, Production and non-Production Materials, Procurement Ops, Category Management, and 9 years Enterprise Program Leadership. Named Lean Champion for Intel Procurement Ops and an Intel Supply Chain Master. \n \nSpecialties: Purchasing, Sourcing, Internal and Outsourced Manufacturing, Enterprise Program Leadership, Lean Manufacturing, Supply Chain Management and Structured Problem Solving Summary 32 years of Management and Leadership experience. Includes 8 years in Manufacturing, 11 years in Materials Management which includes Raw Materials, Production and non-Production Materials, Procurement Ops, Category Management, and 9 years Enterprise Program Leadership. Named Lean Champion for Intel Procurement Ops and an Intel Supply Chain Master. \n \nSpecialties: Purchasing, Sourcing, Internal and Outsourced Manufacturing, Enterprise Program Leadership, Lean Manufacturing, Supply Chain Management and Structured Problem Solving 32 years of Management and Leadership experience. Includes 8 years in Manufacturing, 11 years in Materials Management which includes Raw Materials, Production and non-Production Materials, Procurement Ops, Category Management, and 9 years Enterprise Program Leadership. Named Lean Champion for Intel Procurement Ops and an Intel Supply Chain Master. \n \nSpecialties: Purchasing, Sourcing, Internal and Outsourced Manufacturing, Enterprise Program Leadership, Lean Manufacturing, Supply Chain Management and Structured Problem Solving 32 years of Management and Leadership experience. Includes 8 years in Manufacturing, 11 years in Materials Management which includes Raw Materials, Production and non-Production Materials, Procurement Ops, Category Management, and 9 years Enterprise Program Leadership. Named Lean Champion for Intel Procurement Ops and an Intel Supply Chain Master. \n \nSpecialties: Purchasing, Sourcing, Internal and Outsourced Manufacturing, Enterprise Program Leadership, Lean Manufacturing, Supply Chain Management and Structured Problem Solving Experience Sr. Program Manager, Outsourcing Procurement, Lean Champion, Intel Supply Chain Master Intel Corporation January 2013  – Present (2 years 8 months) Chandler, AZ Responsible for driving significant improvement in Procurement of Outsourced Boards, Systems, semiconductors, Silicon etc.. Lean Champion, Intel Supply Chain Master and Materials Supply Chain Master Program Owner Intel Corporation June 2009  – Present (6 years 3 months) Responsible for leading the Lean Transformation of Intel's Procurement Operations. Includes coaching and mentoring Procurement Ops Director and staff on Lean principles, rules and tools. Also includes directly engaging in problem solving activities throughout the organization. Responsible for leading the Materials Supply Chain Master Program. Sr. Materials Manager, Assembly/Test Manufacturing Indirect Production Mtls Intel Corporation January 2012  –  December 2012  (1 year) Chandler, AZ Responsible for Managing Indirect Production Materials throughout the Intel Assembly/Test Manufacturing network. Materials Manager Intel Corporation 2001  –  October 2009  (8 years) Leader of various software and process improvement programs Materials wide including eProcurement transformation, eSourcing solution, Spend Management solution, Category Management efficiency program etc.. Southwest Region Materials Operations Manager Intel Corporation 2000  –  2001  (1 year) Manged organization of ~300 Materials employees. Areas of responsibility included Direct and Indirect Materials procurement, Services procurement, Inventory management (Spares and Direct), Category Management, Storerooms and Warehousing. Geography included Arizona, New Mexico, Texas and Costa Rica. World-wide Assembly Test Materials Manager Intel Corporation 1998  –  2000  (2 years) Responsible for all Materials Operations and Procurement in world-wide Assembly Test locations. Areas of responsibility included Procurement of Direct Materials, Indirect Materials and Services, Inventory management, Storerooms and Wharehousing. Geographical locations ranged from Asia (Malaysia, Phillippines, China), to Costa Rica and Ireland. Site Materials Manager Intel Corporation 1995  –  1998  (3 years) Responsible for all Materials management at a very large manufacturing site in Albuquerque NM. Categories managed include chems, gases and maintenance parts as well as non-production good and services. Site Purchasing Manager Intel Corporation September 1990  –  June 1995  (4 years 10 months) Albuquerque, New Mexico Area Managed team of Procurement professionals responsible for all Indirect and Direct Production Materials in support of multiple factories at the site. Yield Engineering Group Leader Intel Corporation February 1988  –  September 1990  (2 years 8 months) Chandler, AZ Managed group of Yield Engineers responsible for production yields in 1/3 of the Fab 6. Manufacturing Supervisor/Manager Intel Corporation March 1982  –  February 1988  (6 years) Various Manufacturing Management roles including Floor Supervisor, Shift Manager and Functional Area Manager. Sr. Program Manager, Outsourcing Procurement, Lean Champion, Intel Supply Chain Master Intel Corporation January 2013  – Present (2 years 8 months) Chandler, AZ Responsible for driving significant improvement in Procurement of Outsourced Boards, Systems, semiconductors, Silicon etc.. Sr. Program Manager, Outsourcing Procurement, Lean Champion, Intel Supply Chain Master Intel Corporation January 2013  – Present (2 years 8 months) Chandler, AZ Responsible for driving significant improvement in Procurement of Outsourced Boards, Systems, semiconductors, Silicon etc.. Lean Champion, Intel Supply Chain Master and Materials Supply Chain Master Program Owner Intel Corporation June 2009  – Present (6 years 3 months) Responsible for leading the Lean Transformation of Intel's Procurement Operations. Includes coaching and mentoring Procurement Ops Director and staff on Lean principles, rules and tools. Also includes directly engaging in problem solving activities throughout the organization. Responsible for leading the Materials Supply Chain Master Program. Lean Champion, Intel Supply Chain Master and Materials Supply Chain Master Program Owner Intel Corporation June 2009  – Present (6 years 3 months) Responsible for leading the Lean Transformation of Intel's Procurement Operations. Includes coaching and mentoring Procurement Ops Director and staff on Lean principles, rules and tools. Also includes directly engaging in problem solving activities throughout the organization. Responsible for leading the Materials Supply Chain Master Program. Sr. Materials Manager, Assembly/Test Manufacturing Indirect Production Mtls Intel Corporation January 2012  –  December 2012  (1 year) Chandler, AZ Responsible for Managing Indirect Production Materials throughout the Intel Assembly/Test Manufacturing network. Sr. Materials Manager, Assembly/Test Manufacturing Indirect Production Mtls Intel Corporation January 2012  –  December 2012  (1 year) Chandler, AZ Responsible for Managing Indirect Production Materials throughout the Intel Assembly/Test Manufacturing network. Materials Manager Intel Corporation 2001  –  October 2009  (8 years) Leader of various software and process improvement programs Materials wide including eProcurement transformation, eSourcing solution, Spend Management solution, Category Management efficiency program etc.. Materials Manager Intel Corporation 2001  –  October 2009  (8 years) Leader of various software and process improvement programs Materials wide including eProcurement transformation, eSourcing solution, Spend Management solution, Category Management efficiency program etc.. Southwest Region Materials Operations Manager Intel Corporation 2000  –  2001  (1 year) Manged organization of ~300 Materials employees. Areas of responsibility included Direct and Indirect Materials procurement, Services procurement, Inventory management (Spares and Direct), Category Management, Storerooms and Warehousing. Geography included Arizona, New Mexico, Texas and Costa Rica. Southwest Region Materials Operations Manager Intel Corporation 2000  –  2001  (1 year) Manged organization of ~300 Materials employees. Areas of responsibility included Direct and Indirect Materials procurement, Services procurement, Inventory management (Spares and Direct), Category Management, Storerooms and Warehousing. Geography included Arizona, New Mexico, Texas and Costa Rica. World-wide Assembly Test Materials Manager Intel Corporation 1998  –  2000  (2 years) Responsible for all Materials Operations and Procurement in world-wide Assembly Test locations. Areas of responsibility included Procurement of Direct Materials, Indirect Materials and Services, Inventory management, Storerooms and Wharehousing. Geographical locations ranged from Asia (Malaysia, Phillippines, China), to Costa Rica and Ireland. World-wide Assembly Test Materials Manager Intel Corporation 1998  –  2000  (2 years) Responsible for all Materials Operations and Procurement in world-wide Assembly Test locations. Areas of responsibility included Procurement of Direct Materials, Indirect Materials and Services, Inventory management, Storerooms and Wharehousing. Geographical locations ranged from Asia (Malaysia, Phillippines, China), to Costa Rica and Ireland. Site Materials Manager Intel Corporation 1995  –  1998  (3 years) Responsible for all Materials management at a very large manufacturing site in Albuquerque NM. Categories managed include chems, gases and maintenance parts as well as non-production good and services. Site Materials Manager Intel Corporation 1995  –  1998  (3 years) Responsible for all Materials management at a very large manufacturing site in Albuquerque NM. Categories managed include chems, gases and maintenance parts as well as non-production good and services. Site Purchasing Manager Intel Corporation September 1990  –  June 1995  (4 years 10 months) Albuquerque, New Mexico Area Managed team of Procurement professionals responsible for all Indirect and Direct Production Materials in support of multiple factories at the site. Site Purchasing Manager Intel Corporation September 1990  –  June 1995  (4 years 10 months) Albuquerque, New Mexico Area Managed team of Procurement professionals responsible for all Indirect and Direct Production Materials in support of multiple factories at the site. Yield Engineering Group Leader Intel Corporation February 1988  –  September 1990  (2 years 8 months) Chandler, AZ Managed group of Yield Engineers responsible for production yields in 1/3 of the Fab 6. Yield Engineering Group Leader Intel Corporation February 1988  –  September 1990  (2 years 8 months) Chandler, AZ Managed group of Yield Engineers responsible for production yields in 1/3 of the Fab 6. Manufacturing Supervisor/Manager Intel Corporation March 1982  –  February 1988  (6 years) Various Manufacturing Management roles including Floor Supervisor, Shift Manager and Functional Area Manager. Manufacturing Supervisor/Manager Intel Corporation March 1982  –  February 1988  (6 years) Various Manufacturing Management roles including Floor Supervisor, Shift Manager and Functional Area Manager. Skills Supply Chain Management Lean Manufacturing Sourcing & Procurement Enterprise Program... Business Process... Supply Chain Manufacturing Project Management Semiconductors Continuous Improvement Materials Management Six Sigma Procurement Leadership Sourcing Coaching Supply Management Forecasting Operations Management Materials SPC 5S Global Sourcing Management Process Improvement Root Cause Analysis Strategy Operational Excellence Warehousing Purchasing ERP Change Management MRP Business Process Cross-functional Team... Program Management Logistics Strategic Sourcing Supply Chain... Demand Planning Contract Negotiation Outsourcing Kaizen Inventory Management Product Management Value Stream Mapping DMAIC Engineering Management Intel SAP See 35+     See less Skills  Supply Chain Management Lean Manufacturing Sourcing & Procurement Enterprise Program... Business Process... Supply Chain Manufacturing Project Management Semiconductors Continuous Improvement Materials Management Six Sigma Procurement Leadership Sourcing Coaching Supply Management Forecasting Operations Management Materials SPC 5S Global Sourcing Management Process Improvement Root Cause Analysis Strategy Operational Excellence Warehousing Purchasing ERP Change Management MRP Business Process Cross-functional Team... Program Management Logistics Strategic Sourcing Supply Chain... Demand Planning Contract Negotiation Outsourcing Kaizen Inventory Management Product Management Value Stream Mapping DMAIC Engineering Management Intel SAP See 35+     See less Supply Chain Management Lean Manufacturing Sourcing & Procurement Enterprise Program... Business Process... Supply Chain Manufacturing Project Management Semiconductors Continuous Improvement Materials Management Six Sigma Procurement Leadership Sourcing Coaching Supply Management Forecasting Operations Management Materials SPC 5S Global Sourcing Management Process Improvement Root Cause Analysis Strategy Operational Excellence Warehousing Purchasing ERP Change Management MRP Business Process Cross-functional Team... Program Management Logistics Strategic Sourcing Supply Chain... Demand Planning Contract Negotiation Outsourcing Kaizen Inventory Management Product Management Value Stream Mapping DMAIC Engineering Management Intel SAP See 35+     See less Supply Chain Management Lean Manufacturing Sourcing & Procurement Enterprise Program... Business Process... Supply Chain Manufacturing Project Management Semiconductors Continuous Improvement Materials Management Six Sigma Procurement Leadership Sourcing Coaching Supply Management Forecasting Operations Management Materials SPC 5S Global Sourcing Management Process Improvement Root Cause Analysis Strategy Operational Excellence Warehousing Purchasing ERP Change Management MRP Business Process Cross-functional Team... Program Management Logistics Strategic Sourcing Supply Chain... Demand Planning Contract Negotiation Outsourcing Kaizen Inventory Management Product Management Value Stream Mapping DMAIC Engineering Management Intel SAP See 35+     See less Education University of Arizona Bachelor of Science,  Business - Operations 1978  – 1981 Northern Arizona University 1976  – 1978 University of Arizona Bachelor of Science,  Business - Operations 1978  – 1981 University of Arizona Bachelor of Science,  Business - Operations 1978  – 1981 University of Arizona Bachelor of Science,  Business - Operations 1978  – 1981 Northern Arizona University 1976  – 1978 Northern Arizona University 1976  – 1978 Northern Arizona University 1976  – 1978 ", "Experience Materials Manager Intel Corporation Materials Manager Intel Corporation Materials Manager Intel Corporation Skills Leadership Skills  Leadership Leadership Leadership ", "Skills Inventory Management Lean Manufacturing Process Improvement Manufacturing Warehousing Organizational... Leadership Supply Chain Management Negotiation Logistics Business Development Supply Management Forecasting Strategic Sourcing Logistics Management Business Process... Change Management Marketing Team Building Strategic Planning Supply Chain Management Program Management Procurement Contract Negotiation Operations Management Purchasing Cross-functional Team... Kaizen Team Leadership Supply Chain... Six Sigma Strategy Process Engineering Pricing Inventory Control Operational Excellence Business Strategy Materials Management Product Management Budgets Global Sourcing Continuous Improvement Contract Management Sourcing Project Planning Product Development Sales Warehouse Management Production Planning See 35+     See less Skills  Inventory Management Lean Manufacturing Process Improvement Manufacturing Warehousing Organizational... Leadership Supply Chain Management Negotiation Logistics Business Development Supply Management Forecasting Strategic Sourcing Logistics Management Business Process... Change Management Marketing Team Building Strategic Planning Supply Chain Management Program Management Procurement Contract Negotiation Operations Management Purchasing Cross-functional Team... Kaizen Team Leadership Supply Chain... Six Sigma Strategy Process Engineering Pricing Inventory Control Operational Excellence Business Strategy Materials Management Product Management Budgets Global Sourcing Continuous Improvement Contract Management Sourcing Project Planning Product Development Sales Warehouse Management Production Planning See 35+     See less Inventory Management Lean Manufacturing Process Improvement Manufacturing Warehousing Organizational... Leadership Supply Chain Management Negotiation Logistics Business Development Supply Management Forecasting Strategic Sourcing Logistics Management Business Process... Change Management Marketing Team Building Strategic Planning Supply Chain Management Program Management Procurement Contract Negotiation Operations Management Purchasing Cross-functional Team... Kaizen Team Leadership Supply Chain... Six Sigma Strategy Process Engineering Pricing Inventory Control Operational Excellence Business Strategy Materials Management Product Management Budgets Global Sourcing Continuous Improvement Contract Management Sourcing Project Planning Product Development Sales Warehouse Management Production Planning See 35+     See less Inventory Management Lean Manufacturing Process Improvement Manufacturing Warehousing Organizational... Leadership Supply Chain Management Negotiation Logistics Business Development Supply Management Forecasting Strategic Sourcing Logistics Management Business Process... Change Management Marketing Team Building Strategic Planning Supply Chain Management Program Management Procurement Contract Negotiation Operations Management Purchasing Cross-functional Team... Kaizen Team Leadership Supply Chain... Six Sigma Strategy Process Engineering Pricing Inventory Control Operational Excellence Business Strategy Materials Management Product Management Budgets Global Sourcing Continuous Improvement Contract Management Sourcing Project Planning Product Development Sales Warehouse Management Production Planning See 35+     See less ", "Summary Managed all supply chain activities in the semiconductor industry, with specialization in mobility components (smartphones and tablets), electronics, optical components and assemblies. Substantial experience in strategic hardware operations in smartphone space. Extensive interfacing with Asian contract manufacturers and supporting a globally dispersed software engineering and manufacturing organization. Summary Managed all supply chain activities in the semiconductor industry, with specialization in mobility components (smartphones and tablets), electronics, optical components and assemblies. Substantial experience in strategic hardware operations in smartphone space. Extensive interfacing with Asian contract manufacturers and supporting a globally dispersed software engineering and manufacturing organization. Managed all supply chain activities in the semiconductor industry, with specialization in mobility components (smartphones and tablets), electronics, optical components and assemblies. Substantial experience in strategic hardware operations in smartphone space. Extensive interfacing with Asian contract manufacturers and supporting a globally dispersed software engineering and manufacturing organization. Managed all supply chain activities in the semiconductor industry, with specialization in mobility components (smartphones and tablets), electronics, optical components and assemblies. Substantial experience in strategic hardware operations in smartphone space. Extensive interfacing with Asian contract manufacturers and supporting a globally dispersed software engineering and manufacturing organization. Languages Tamil Tamil Tamil Skills Supply Chain Management Product Development Manufacturing Supply Chain Strategy Supply Management Budgets Inventory Management Cross-functional Team... Electronics Materials Management Semiconductors Program Management Strategic Sourcing Lean Manufacturing Skills  Supply Chain Management Product Development Manufacturing Supply Chain Strategy Supply Management Budgets Inventory Management Cross-functional Team... Electronics Materials Management Semiconductors Program Management Strategic Sourcing Lean Manufacturing Supply Chain Management Product Development Manufacturing Supply Chain Strategy Supply Management Budgets Inventory Management Cross-functional Team... Electronics Materials Management Semiconductors Program Management Strategic Sourcing Lean Manufacturing Supply Chain Management Product Development Manufacturing Supply Chain Strategy Supply Management Budgets Inventory Management Cross-functional Team... Electronics Materials Management Semiconductors Program Management Strategic Sourcing Lean Manufacturing ", "Languages English Native or bilingual proficiency Spanish Full professional proficiency English Native or bilingual proficiency Spanish Full professional proficiency English Native or bilingual proficiency Spanish Full professional proficiency Native or bilingual proficiency Full professional proficiency Skills Personal Injury Contract Negotiation Negotiation Litigation Business Strategy Program Management Cross-functional Team... Contract Management Leadership Corporate Law Strategy Supply Chain Legal Research Manufacturing Legal Assistance Change Management Six Sigma Procurement Supply Chain Management Team Leadership Executive Management Management Accident Business Analysis Supply Chain Operations See 10+     See less Skills  Personal Injury Contract Negotiation Negotiation Litigation Business Strategy Program Management Cross-functional Team... Contract Management Leadership Corporate Law Strategy Supply Chain Legal Research Manufacturing Legal Assistance Change Management Six Sigma Procurement Supply Chain Management Team Leadership Executive Management Management Accident Business Analysis Supply Chain Operations See 10+     See less Personal Injury Contract Negotiation Negotiation Litigation Business Strategy Program Management Cross-functional Team... Contract Management Leadership Corporate Law Strategy Supply Chain Legal Research Manufacturing Legal Assistance Change Management Six Sigma Procurement Supply Chain Management Team Leadership Executive Management Management Accident Business Analysis Supply Chain Operations See 10+     See less Personal Injury Contract Negotiation Negotiation Litigation Business Strategy Program Management Cross-functional Team... Contract Management Leadership Corporate Law Strategy Supply Chain Legal Research Manufacturing Legal Assistance Change Management Six Sigma Procurement Supply Chain Management Team Leadership Executive Management Management Accident Business Analysis Supply Chain Operations See 10+     See less ", "Experience Director, Global Sourcing and Procurement Intel Corporation May 2009  – Present (6 years 4 months) Portland, Oregon Area Director, Supply Chain Process and Systems Intel Corporation 2005  –  2009  (4 years) Director, Fab Materials Operations Intel Corporation 2003  –  2005  (2 years) Portland, Oregon Area Director, Materials Operations Intel Corporation 2001  –  2003  (2 years) Portland, Oregon Area Fab Materials Manager Intel Corporation 1999  –  2001  (2 years) Portland, Oregon Area Sr Program Manager Intel Corporation 1997  –  1999  (2 years) Portland, Oregon Area Materials Manager Intel Corporation 1990  –  1996  (6 years) Albuquerque, New Mexico Area Commodity Manager Intel 1986  –  1990  (4 years) Sr Buyer Intel Corporation 1983  –  1986  (3 years) San Francisco Bay Area Buyer Synertek 1982  –  1983  (1 year) Director, Global Sourcing and Procurement Intel Corporation May 2009  – Present (6 years 4 months) Portland, Oregon Area Director, Global Sourcing and Procurement Intel Corporation May 2009  – Present (6 years 4 months) Portland, Oregon Area Director, Supply Chain Process and Systems Intel Corporation 2005  –  2009  (4 years) Director, Supply Chain Process and Systems Intel Corporation 2005  –  2009  (4 years) Director, Fab Materials Operations Intel Corporation 2003  –  2005  (2 years) Portland, Oregon Area Director, Fab Materials Operations Intel Corporation 2003  –  2005  (2 years) Portland, Oregon Area Director, Materials Operations Intel Corporation 2001  –  2003  (2 years) Portland, Oregon Area Director, Materials Operations Intel Corporation 2001  –  2003  (2 years) Portland, Oregon Area Fab Materials Manager Intel Corporation 1999  –  2001  (2 years) Portland, Oregon Area Fab Materials Manager Intel Corporation 1999  –  2001  (2 years) Portland, Oregon Area Sr Program Manager Intel Corporation 1997  –  1999  (2 years) Portland, Oregon Area Sr Program Manager Intel Corporation 1997  –  1999  (2 years) Portland, Oregon Area Materials Manager Intel Corporation 1990  –  1996  (6 years) Albuquerque, New Mexico Area Materials Manager Intel Corporation 1990  –  1996  (6 years) Albuquerque, New Mexico Area Commodity Manager Intel 1986  –  1990  (4 years) Commodity Manager Intel 1986  –  1990  (4 years) Sr Buyer Intel Corporation 1983  –  1986  (3 years) San Francisco Bay Area Sr Buyer Intel Corporation 1983  –  1986  (3 years) San Francisco Bay Area Buyer Synertek 1982  –  1983  (1 year) Buyer Synertek 1982  –  1983  (1 year) Skills Semiconductors Supply Management Supply Chain Management Six Sigma Purchasing Procurement Supplier Negotiation Process Improvement Systems Analysis Management Leadership Development Cross-functional Team... Strategic Sourcing Manufacturing Team Leadership ERP Manufacturing... Vendor Management Operational Excellence Warehousing Lean Manufacturing Sourcing SAP International Business Production Planning Engineering Management Global Sourcing Inventory Management Project Planning Forecasting Change Management Contract Negotiation Logistics Warehouse Management Supply Chain... Product Development SPC P&L Management Pricing Process Engineering Business Process... Manufacturing Operations Inventory Control Product Management Start-ups Strategy Acquisition Integration Outsourcing Value Stream Mapping Demand Planning See 35+     See less Skills  Semiconductors Supply Management Supply Chain Management Six Sigma Purchasing Procurement Supplier Negotiation Process Improvement Systems Analysis Management Leadership Development Cross-functional Team... Strategic Sourcing Manufacturing Team Leadership ERP Manufacturing... Vendor Management Operational Excellence Warehousing Lean Manufacturing Sourcing SAP International Business Production Planning Engineering Management Global Sourcing Inventory Management Project Planning Forecasting Change Management Contract Negotiation Logistics Warehouse Management Supply Chain... Product Development SPC P&L Management Pricing Process Engineering Business Process... Manufacturing Operations Inventory Control Product Management Start-ups Strategy Acquisition Integration Outsourcing Value Stream Mapping Demand Planning See 35+     See less Semiconductors Supply Management Supply Chain Management Six Sigma Purchasing Procurement Supplier Negotiation Process Improvement Systems Analysis Management Leadership Development Cross-functional Team... Strategic Sourcing Manufacturing Team Leadership ERP Manufacturing... Vendor Management Operational Excellence Warehousing Lean Manufacturing Sourcing SAP International Business Production Planning Engineering Management Global Sourcing Inventory Management Project Planning Forecasting Change Management Contract Negotiation Logistics Warehouse Management Supply Chain... Product Development SPC P&L Management Pricing Process Engineering Business Process... Manufacturing Operations Inventory Control Product Management Start-ups Strategy Acquisition Integration Outsourcing Value Stream Mapping Demand Planning See 35+     See less Semiconductors Supply Management Supply Chain Management Six Sigma Purchasing Procurement Supplier Negotiation Process Improvement Systems Analysis Management Leadership Development Cross-functional Team... Strategic Sourcing Manufacturing Team Leadership ERP Manufacturing... Vendor Management Operational Excellence Warehousing Lean Manufacturing Sourcing SAP International Business Production Planning Engineering Management Global Sourcing Inventory Management Project Planning Forecasting Change Management Contract Negotiation Logistics Warehouse Management Supply Chain... Product Development SPC P&L Management Pricing Process Engineering Business Process... Manufacturing Operations Inventory Control Product Management Start-ups Strategy Acquisition Integration Outsourcing Value Stream Mapping Demand Planning See 35+     See less Education San Jose State University BS Business,  Managment/Systems Thinking 1976  – 1982 Activities and Societies:  Society for Advancement of Management;Tau Delta Phi Scholastic Honor Society; Assistant to Dean of Business School; Computer Science Lab instructor San Jose State University, MBA Program University of Phoenix, MBA Program San Jose State University BS Business,  Managment/Systems Thinking 1976  – 1982 Activities and Societies:  Society for Advancement of Management;Tau Delta Phi Scholastic Honor Society; Assistant to Dean of Business School; Computer Science Lab instructor San Jose State University BS Business,  Managment/Systems Thinking 1976  – 1982 Activities and Societies:  Society for Advancement of Management;Tau Delta Phi Scholastic Honor Society; Assistant to Dean of Business School; Computer Science Lab instructor San Jose State University BS Business,  Managment/Systems Thinking 1976  – 1982 Activities and Societies:  Society for Advancement of Management;Tau Delta Phi Scholastic Honor Society; Assistant to Dean of Business School; Computer Science Lab instructor San Jose State University, MBA Program San Jose State University, MBA Program San Jose State University, MBA Program University of Phoenix, MBA Program University of Phoenix, MBA Program University of Phoenix, MBA Program ", "Experience Director, Material Service Operations (Retired) Legacy Health October 2003  –  January 2015  (11 years 4 months) Portland, Oregon Area Distribution Manager Enron Corporation 1999  –  2003  (4 years) VP Manufacturing nCUBE Corporation 1995  –  1999  (4 years) Purchasing, Manufacturing Manager Sequent Computer Systems Inc. 1989  –  1995  (6 years) Commodity/Materials Manager Intel Corporation 1978  –  1989  (11 years) Director, Material Service Operations (Retired) Legacy Health October 2003  –  January 2015  (11 years 4 months) Portland, Oregon Area Director, Material Service Operations (Retired) Legacy Health October 2003  –  January 2015  (11 years 4 months) Portland, Oregon Area Distribution Manager Enron Corporation 1999  –  2003  (4 years) Distribution Manager Enron Corporation 1999  –  2003  (4 years) VP Manufacturing nCUBE Corporation 1995  –  1999  (4 years) VP Manufacturing nCUBE Corporation 1995  –  1999  (4 years) Purchasing, Manufacturing Manager Sequent Computer Systems Inc. 1989  –  1995  (6 years) Purchasing, Manufacturing Manager Sequent Computer Systems Inc. 1989  –  1995  (6 years) Commodity/Materials Manager Intel Corporation 1978  –  1989  (11 years) Commodity/Materials Manager Intel Corporation 1978  –  1989  (11 years) Skills Cross-functional Team... Skills  Cross-functional Team... Cross-functional Team... Cross-functional Team... Education Regis University BA 1965  – 1969 Campion Jesuit High School HS 1961  – 1965 Regis University BA 1965  – 1969 Regis University BA 1965  – 1969 Regis University BA 1965  – 1969 Campion Jesuit High School HS 1961  – 1965 Campion Jesuit High School HS 1961  – 1965 Campion Jesuit High School HS 1961  – 1965 ", "Languages Punjabi Hindi Punjabi Hindi Punjabi Hindi Skills Product Development Storage Enterprise Software OEM Partner Management Product Marketing Product Planning Product Strategy Product Management Channel Product Life Cycle... Cross-functional Team... Software Product... Product Launch Skills  Product Development Storage Enterprise Software OEM Partner Management Product Marketing Product Planning Product Strategy Product Management Channel Product Life Cycle... Cross-functional Team... Software Product... Product Launch Product Development Storage Enterprise Software OEM Partner Management Product Marketing Product Planning Product Strategy Product Management Channel Product Life Cycle... Cross-functional Team... Software Product... Product Launch Product Development Storage Enterprise Software OEM Partner Management Product Marketing Product Planning Product Strategy Product Management Channel Product Life Cycle... Cross-functional Team... Software Product... Product Launch ", "Skills Supply Management Product Development Strategic Sourcing Supply Chain Management Purchasing Cross-functional Team... Management Continuous Improvement Supply Chain SAP Lean Manufacturing Logistics Global Sourcing Materials Management Skills  Supply Management Product Development Strategic Sourcing Supply Chain Management Purchasing Cross-functional Team... Management Continuous Improvement Supply Chain SAP Lean Manufacturing Logistics Global Sourcing Materials Management Supply Management Product Development Strategic Sourcing Supply Chain Management Purchasing Cross-functional Team... Management Continuous Improvement Supply Chain SAP Lean Manufacturing Logistics Global Sourcing Materials Management Supply Management Product Development Strategic Sourcing Supply Chain Management Purchasing Cross-functional Team... Management Continuous Improvement Supply Chain SAP Lean Manufacturing Logistics Global Sourcing Materials Management ", "Languages   Skills Skills     ", "Skills MRP Procurement Negotiation Vendor Management Lean Manufacturing Process Simulation Energy Supply Chain Management Management Photovoltaics Purchasing Cross-functional Team... Operations Management Inventory Management Team Leadership SPC Strategy Root Cause Analysis Renewable Energy Strategic Planning Contract Negotiation Continuous Improvement ERP Manufacturing Logistics 5S Project Planning Project Management Global Sourcing Contract Management Kaizen Budgets Six Sigma Semiconductors Supply Management Design of Experiments Process Improvement Engineering Management Solar Energy Program Management Strategic Sourcing Value Stream Mapping Process Engineering Quality Management Change Management Forecasting Supply Chain Business Strategy Electronics Analysis See 35+     See less Skills  MRP Procurement Negotiation Vendor Management Lean Manufacturing Process Simulation Energy Supply Chain Management Management Photovoltaics Purchasing Cross-functional Team... Operations Management Inventory Management Team Leadership SPC Strategy Root Cause Analysis Renewable Energy Strategic Planning Contract Negotiation Continuous Improvement ERP Manufacturing Logistics 5S Project Planning Project Management Global Sourcing Contract Management Kaizen Budgets Six Sigma Semiconductors Supply Management Design of Experiments Process Improvement Engineering Management Solar Energy Program Management Strategic Sourcing Value Stream Mapping Process Engineering Quality Management Change Management Forecasting Supply Chain Business Strategy Electronics Analysis See 35+     See less MRP Procurement Negotiation Vendor Management Lean Manufacturing Process Simulation Energy Supply Chain Management Management Photovoltaics Purchasing Cross-functional Team... Operations Management Inventory Management Team Leadership SPC Strategy Root Cause Analysis Renewable Energy Strategic Planning Contract Negotiation Continuous Improvement ERP Manufacturing Logistics 5S Project Planning Project Management Global Sourcing Contract Management Kaizen Budgets Six Sigma Semiconductors Supply Management Design of Experiments Process Improvement Engineering Management Solar Energy Program Management Strategic Sourcing Value Stream Mapping Process Engineering Quality Management Change Management Forecasting Supply Chain Business Strategy Electronics Analysis See 35+     See less MRP Procurement Negotiation Vendor Management Lean Manufacturing Process Simulation Energy Supply Chain Management Management Photovoltaics Purchasing Cross-functional Team... Operations Management Inventory Management Team Leadership SPC Strategy Root Cause Analysis Renewable Energy Strategic Planning Contract Negotiation Continuous Improvement ERP Manufacturing Logistics 5S Project Planning Project Management Global Sourcing Contract Management Kaizen Budgets Six Sigma Semiconductors Supply Management Design of Experiments Process Improvement Engineering Management Solar Energy Program Management Strategic Sourcing Value Stream Mapping Process Engineering Quality Management Change Management Forecasting Supply Chain Business Strategy Electronics Analysis See 35+     See less ", "Summary Accomplished professional with over 16 years’ experience in a global working environment. Highly skilled in NPI management, strategic business analysis, supplier management, cost reduction programs, high volume manufacturing, and process improvement/change management. Trained and experienced in ISO, Kaizen, Lean Six Sigma, 5S, and Green Belt and ASQ Certified. Summary Accomplished professional with over 16 years’ experience in a global working environment. Highly skilled in NPI management, strategic business analysis, supplier management, cost reduction programs, high volume manufacturing, and process improvement/change management. Trained and experienced in ISO, Kaizen, Lean Six Sigma, 5S, and Green Belt and ASQ Certified. Accomplished professional with over 16 years’ experience in a global working environment. Highly skilled in NPI management, strategic business analysis, supplier management, cost reduction programs, high volume manufacturing, and process improvement/change management. Trained and experienced in ISO, Kaizen, Lean Six Sigma, 5S, and Green Belt and ASQ Certified. Accomplished professional with over 16 years’ experience in a global working environment. Highly skilled in NPI management, strategic business analysis, supplier management, cost reduction programs, high volume manufacturing, and process improvement/change management. Trained and experienced in ISO, Kaizen, Lean Six Sigma, 5S, and Green Belt and ASQ Certified. Experience Operations Materials Manager Intel Corporation March 2013  – Present (2 years 6 months) Hillsboro, Oregon Operations Materials Manager: \nManage group of 13 Material Program Managers across three countries (US, Mexico, China) responsible for material cost, compliance, and supply chain readiness for Intel silicon enabling and Intel servers. \n•\tStandardize MPM processes across all geos to ensure consistent program management throughout the product life cycle \n•\tManage Product Cost MRC to review cost targets, project HVM cost trends for price setting, and analyze commodity cost opportunities \n•\tWork with finance to develop a procurement strategy model that predicts total operations costs \n \nStrategic Materials Program Manager: \nManage material availability and influence component selection during NPI builds to ensure competitive costs and low material risks in HVM. \n•\tNegotiate NPI soft tooling costs down from $204K to $165K for a 19% savings  \n•\tDevelop strategic supply chain and procurement models for system level components \n•\tManage HVM ODM in driving materials for NPI builds \n•\tCreated new material shortage reporting format based on waterfall data to ensure visibility of material readiness \n•\tAnalyze NPI integration quotes for cost accuracy and competitiveness Supplier Quality Engineering Manager Xerox December 2006  –  March 2013  (6 years 4 months) Wilsonville, Oregon Supplier Quality Engineering Manager: \nManage overall Supplier Quality Engineering project deliverables associated with the successful launch and cost down of solid ink printer platforms. Responsible for 4 direct engineering reports with mechanical, electromechanical, and chemical responsibilities. \n•\tDeveloped overall supply chain strategy for overseas printer manufacturing and reduced supplier mark up costs by 5% \n•\tConsolidated strategic contract manufacturers into one location to avoid $2M cost up \n•\tManaged two-year cost down project targeted to achieve $18M annual savings \n•\tDefined global working procedures between domestic and Asian purchasing groups to ensure cost targets are communicated and met \n \nSupplier Quality Engineer Lead: \nNPI program lead responsible for $13M in capital tooling budget and sourcing strategy. Managed materials for new printer programs to ensure cost, schedule, and regulatory requirements were within business case. \n•\tSuccessfully delivered three new printer platforms through all TTM phase gates by working closely with engineering, manufacturing, and legal \n•\tDeveloped overall plastics commodity strategy equaling $9.4M in annual spends \n•\tReduced the number of standard plastics used in printer platforms from 67 down to 9 resulting in annual savings of $500K \n \nSupplier Quality Engineer: \nResponsible for mechanical suppliers from NPI to ongoing production ensuring program and customer requirements are met. This included supplier selection, qualification, and continuous supplier quality involvement. \n•\tWorked with both Asian and domestic suppliers to qualify new tools to a capability standard of Cpk 1.77 and Cp 2.00 \n•\tCompleted DFM studies on 137 mechanical plastic parts \n•\tConducted DOE studies on 4 chassis tools to improve yield by 15% \n•\tEnsured qualified material was available for lab-prototype and pre-production builds \ntotype and pre-production builds Manufacturing Assistant Manager Epson Portland Inc. October 2002  –  December 2006  (4 years 3 months) Hillsboro, Oregon Manufacturing Assistant Manager: \nManaged 6 direct reports with a total organization of 165. Directed the activities of 6 technical supervisors in a high volume automated manufacturing operation producing an average of 3.2M ink cartridges per month. Maintained an annual department budget of $6M. \n \nManufacturing Engineering Supervisor: \nSupervised the daily activities of 10 Manufacturing Engineering Technicians working on 16 automated HVM assembly lines. Procurement engineer for all incoming materials. \n•\tHandled incoming discrepancies through DMR process to contain issues and determine root cause and corrective action(s) \n•\tManaged external customer claims by determining risk to customer using historical and statistical data \n•\tReduced WIP inventory and increased floor space by 600sqft for future ink cartridge technology assembly lines \n•\tProvided basic Ink Cartridge Function training for Leads, Technicians, and Supervisors for better understanding of defects and impact to customer \n \nPlastics Engineering Supervisor: \nOversaw and prioritized daily activities for 5 Plastics Manufacturing Engineering Technicians based on production requirements and customer impact. \n•\tConsolidated equipment to increase available machine floor space by 50% and created the space required to increase plastics capacity by 40% for $3.5 million in new business for EPI \n•\tImproved molding machine shut down and start up procedures to reduce waste by 5% \n•\tConducted DOE studies and implemented new process parameter mapping and improve production yield by 4% \n \nPlastics Manufacturing Engineer: \nProject Lead for all Plastics NPI; including qualification of new molds, machines, and automation. Responsible for $1.5 million of fully automated plastics take out robots and production equipment. \n•\tReduced $135K in annual labor costs by eliminating 100% visual inspection and implementing sampling inspection using statistical process control \n•\tInstalled two new molding cells and increased capacity by 16% Materials Engineer, CSMO Interconnects Intel Corporation May 2000  –  September 2002  (2 years 5 months) Hillsboro, Oregon Materials Engineer V, CSMO Interconnects: \nMaterials Engineer III, CSMO Interconnects: \n•\tSource and qualify new connectors for Intel Communications Group (blade servers, Network Interface Cards, wireless cards) while complying to Intel DFM rules \n•\tManage supplier quality excursions for containment, root cause, and corrective action throughout Product Life Cycle \n•\tAudit supplier manufacturing facilities per SSQA to access supplier maturity \n•\tIdentified and recommended second source connectors to minimize risk of parts availability \n•\tApprove supplier ECN’s through white paper process Operations Materials Manager Intel Corporation March 2013  – Present (2 years 6 months) Hillsboro, Oregon Operations Materials Manager: \nManage group of 13 Material Program Managers across three countries (US, Mexico, China) responsible for material cost, compliance, and supply chain readiness for Intel silicon enabling and Intel servers. \n•\tStandardize MPM processes across all geos to ensure consistent program management throughout the product life cycle \n•\tManage Product Cost MRC to review cost targets, project HVM cost trends for price setting, and analyze commodity cost opportunities \n•\tWork with finance to develop a procurement strategy model that predicts total operations costs \n \nStrategic Materials Program Manager: \nManage material availability and influence component selection during NPI builds to ensure competitive costs and low material risks in HVM. \n•\tNegotiate NPI soft tooling costs down from $204K to $165K for a 19% savings  \n•\tDevelop strategic supply chain and procurement models for system level components \n•\tManage HVM ODM in driving materials for NPI builds \n•\tCreated new material shortage reporting format based on waterfall data to ensure visibility of material readiness \n•\tAnalyze NPI integration quotes for cost accuracy and competitiveness Operations Materials Manager Intel Corporation March 2013  – Present (2 years 6 months) Hillsboro, Oregon Operations Materials Manager: \nManage group of 13 Material Program Managers across three countries (US, Mexico, China) responsible for material cost, compliance, and supply chain readiness for Intel silicon enabling and Intel servers. \n•\tStandardize MPM processes across all geos to ensure consistent program management throughout the product life cycle \n•\tManage Product Cost MRC to review cost targets, project HVM cost trends for price setting, and analyze commodity cost opportunities \n•\tWork with finance to develop a procurement strategy model that predicts total operations costs \n \nStrategic Materials Program Manager: \nManage material availability and influence component selection during NPI builds to ensure competitive costs and low material risks in HVM. \n•\tNegotiate NPI soft tooling costs down from $204K to $165K for a 19% savings  \n•\tDevelop strategic supply chain and procurement models for system level components \n•\tManage HVM ODM in driving materials for NPI builds \n•\tCreated new material shortage reporting format based on waterfall data to ensure visibility of material readiness \n•\tAnalyze NPI integration quotes for cost accuracy and competitiveness Supplier Quality Engineering Manager Xerox December 2006  –  March 2013  (6 years 4 months) Wilsonville, Oregon Supplier Quality Engineering Manager: \nManage overall Supplier Quality Engineering project deliverables associated with the successful launch and cost down of solid ink printer platforms. Responsible for 4 direct engineering reports with mechanical, electromechanical, and chemical responsibilities. \n•\tDeveloped overall supply chain strategy for overseas printer manufacturing and reduced supplier mark up costs by 5% \n•\tConsolidated strategic contract manufacturers into one location to avoid $2M cost up \n•\tManaged two-year cost down project targeted to achieve $18M annual savings \n•\tDefined global working procedures between domestic and Asian purchasing groups to ensure cost targets are communicated and met \n \nSupplier Quality Engineer Lead: \nNPI program lead responsible for $13M in capital tooling budget and sourcing strategy. Managed materials for new printer programs to ensure cost, schedule, and regulatory requirements were within business case. \n•\tSuccessfully delivered three new printer platforms through all TTM phase gates by working closely with engineering, manufacturing, and legal \n•\tDeveloped overall plastics commodity strategy equaling $9.4M in annual spends \n•\tReduced the number of standard plastics used in printer platforms from 67 down to 9 resulting in annual savings of $500K \n \nSupplier Quality Engineer: \nResponsible for mechanical suppliers from NPI to ongoing production ensuring program and customer requirements are met. This included supplier selection, qualification, and continuous supplier quality involvement. \n•\tWorked with both Asian and domestic suppliers to qualify new tools to a capability standard of Cpk 1.77 and Cp 2.00 \n•\tCompleted DFM studies on 137 mechanical plastic parts \n•\tConducted DOE studies on 4 chassis tools to improve yield by 15% \n•\tEnsured qualified material was available for lab-prototype and pre-production builds \ntotype and pre-production builds Supplier Quality Engineering Manager Xerox December 2006  –  March 2013  (6 years 4 months) Wilsonville, Oregon Supplier Quality Engineering Manager: \nManage overall Supplier Quality Engineering project deliverables associated with the successful launch and cost down of solid ink printer platforms. Responsible for 4 direct engineering reports with mechanical, electromechanical, and chemical responsibilities. \n•\tDeveloped overall supply chain strategy for overseas printer manufacturing and reduced supplier mark up costs by 5% \n•\tConsolidated strategic contract manufacturers into one location to avoid $2M cost up \n•\tManaged two-year cost down project targeted to achieve $18M annual savings \n•\tDefined global working procedures between domestic and Asian purchasing groups to ensure cost targets are communicated and met \n \nSupplier Quality Engineer Lead: \nNPI program lead responsible for $13M in capital tooling budget and sourcing strategy. Managed materials for new printer programs to ensure cost, schedule, and regulatory requirements were within business case. \n•\tSuccessfully delivered three new printer platforms through all TTM phase gates by working closely with engineering, manufacturing, and legal \n•\tDeveloped overall plastics commodity strategy equaling $9.4M in annual spends \n•\tReduced the number of standard plastics used in printer platforms from 67 down to 9 resulting in annual savings of $500K \n \nSupplier Quality Engineer: \nResponsible for mechanical suppliers from NPI to ongoing production ensuring program and customer requirements are met. This included supplier selection, qualification, and continuous supplier quality involvement. \n•\tWorked with both Asian and domestic suppliers to qualify new tools to a capability standard of Cpk 1.77 and Cp 2.00 \n•\tCompleted DFM studies on 137 mechanical plastic parts \n•\tConducted DOE studies on 4 chassis tools to improve yield by 15% \n•\tEnsured qualified material was available for lab-prototype and pre-production builds \ntotype and pre-production builds Manufacturing Assistant Manager Epson Portland Inc. October 2002  –  December 2006  (4 years 3 months) Hillsboro, Oregon Manufacturing Assistant Manager: \nManaged 6 direct reports with a total organization of 165. Directed the activities of 6 technical supervisors in a high volume automated manufacturing operation producing an average of 3.2M ink cartridges per month. Maintained an annual department budget of $6M. \n \nManufacturing Engineering Supervisor: \nSupervised the daily activities of 10 Manufacturing Engineering Technicians working on 16 automated HVM assembly lines. Procurement engineer for all incoming materials. \n•\tHandled incoming discrepancies through DMR process to contain issues and determine root cause and corrective action(s) \n•\tManaged external customer claims by determining risk to customer using historical and statistical data \n•\tReduced WIP inventory and increased floor space by 600sqft for future ink cartridge technology assembly lines \n•\tProvided basic Ink Cartridge Function training for Leads, Technicians, and Supervisors for better understanding of defects and impact to customer \n \nPlastics Engineering Supervisor: \nOversaw and prioritized daily activities for 5 Plastics Manufacturing Engineering Technicians based on production requirements and customer impact. \n•\tConsolidated equipment to increase available machine floor space by 50% and created the space required to increase plastics capacity by 40% for $3.5 million in new business for EPI \n•\tImproved molding machine shut down and start up procedures to reduce waste by 5% \n•\tConducted DOE studies and implemented new process parameter mapping and improve production yield by 4% \n \nPlastics Manufacturing Engineer: \nProject Lead for all Plastics NPI; including qualification of new molds, machines, and automation. Responsible for $1.5 million of fully automated plastics take out robots and production equipment. \n•\tReduced $135K in annual labor costs by eliminating 100% visual inspection and implementing sampling inspection using statistical process control \n•\tInstalled two new molding cells and increased capacity by 16% Manufacturing Assistant Manager Epson Portland Inc. October 2002  –  December 2006  (4 years 3 months) Hillsboro, Oregon Manufacturing Assistant Manager: \nManaged 6 direct reports with a total organization of 165. Directed the activities of 6 technical supervisors in a high volume automated manufacturing operation producing an average of 3.2M ink cartridges per month. Maintained an annual department budget of $6M. \n \nManufacturing Engineering Supervisor: \nSupervised the daily activities of 10 Manufacturing Engineering Technicians working on 16 automated HVM assembly lines. Procurement engineer for all incoming materials. \n•\tHandled incoming discrepancies through DMR process to contain issues and determine root cause and corrective action(s) \n•\tManaged external customer claims by determining risk to customer using historical and statistical data \n•\tReduced WIP inventory and increased floor space by 600sqft for future ink cartridge technology assembly lines \n•\tProvided basic Ink Cartridge Function training for Leads, Technicians, and Supervisors for better understanding of defects and impact to customer \n \nPlastics Engineering Supervisor: \nOversaw and prioritized daily activities for 5 Plastics Manufacturing Engineering Technicians based on production requirements and customer impact. \n•\tConsolidated equipment to increase available machine floor space by 50% and created the space required to increase plastics capacity by 40% for $3.5 million in new business for EPI \n•\tImproved molding machine shut down and start up procedures to reduce waste by 5% \n•\tConducted DOE studies and implemented new process parameter mapping and improve production yield by 4% \n \nPlastics Manufacturing Engineer: \nProject Lead for all Plastics NPI; including qualification of new molds, machines, and automation. Responsible for $1.5 million of fully automated plastics take out robots and production equipment. \n•\tReduced $135K in annual labor costs by eliminating 100% visual inspection and implementing sampling inspection using statistical process control \n•\tInstalled two new molding cells and increased capacity by 16% Materials Engineer, CSMO Interconnects Intel Corporation May 2000  –  September 2002  (2 years 5 months) Hillsboro, Oregon Materials Engineer V, CSMO Interconnects: \nMaterials Engineer III, CSMO Interconnects: \n•\tSource and qualify new connectors for Intel Communications Group (blade servers, Network Interface Cards, wireless cards) while complying to Intel DFM rules \n•\tManage supplier quality excursions for containment, root cause, and corrective action throughout Product Life Cycle \n•\tAudit supplier manufacturing facilities per SSQA to access supplier maturity \n•\tIdentified and recommended second source connectors to minimize risk of parts availability \n•\tApprove supplier ECN’s through white paper process Materials Engineer, CSMO Interconnects Intel Corporation May 2000  –  September 2002  (2 years 5 months) Hillsboro, Oregon Materials Engineer V, CSMO Interconnects: \nMaterials Engineer III, CSMO Interconnects: \n•\tSource and qualify new connectors for Intel Communications Group (blade servers, Network Interface Cards, wireless cards) while complying to Intel DFM rules \n•\tManage supplier quality excursions for containment, root cause, and corrective action throughout Product Life Cycle \n•\tAudit supplier manufacturing facilities per SSQA to access supplier maturity \n•\tIdentified and recommended second source connectors to minimize risk of parts availability \n•\tApprove supplier ECN’s through white paper process Skills ASQ Certified Manager... ASQ Certified Quality... Air Academy Design for... Manufacturing Quality Management Supplier Quality CQE Team Leadership Green Belt Kaizen Manufacturing... Strategy DMAIC Lean Manufacturing GD&T Failure Analysis Six Sigma Design for Manufacturing FMEA Management Continuous Improvement SPC Quality Control Supplier Evaluation Minitab Product Development Root Cause Analysis Supply Management Engineering Design of Experiments See 15+     See less Skills  ASQ Certified Manager... ASQ Certified Quality... Air Academy Design for... Manufacturing Quality Management Supplier Quality CQE Team Leadership Green Belt Kaizen Manufacturing... Strategy DMAIC Lean Manufacturing GD&T Failure Analysis Six Sigma Design for Manufacturing FMEA Management Continuous Improvement SPC Quality Control Supplier Evaluation Minitab Product Development Root Cause Analysis Supply Management Engineering Design of Experiments See 15+     See less ASQ Certified Manager... ASQ Certified Quality... Air Academy Design for... Manufacturing Quality Management Supplier Quality CQE Team Leadership Green Belt Kaizen Manufacturing... Strategy DMAIC Lean Manufacturing GD&T Failure Analysis Six Sigma Design for Manufacturing FMEA Management Continuous Improvement SPC Quality Control Supplier Evaluation Minitab Product Development Root Cause Analysis Supply Management Engineering Design of Experiments See 15+     See less ASQ Certified Manager... ASQ Certified Quality... Air Academy Design for... Manufacturing Quality Management Supplier Quality CQE Team Leadership Green Belt Kaizen Manufacturing... Strategy DMAIC Lean Manufacturing GD&T Failure Analysis Six Sigma Design for Manufacturing FMEA Management Continuous Improvement SPC Quality Control Supplier Evaluation Minitab Product Development Root Cause Analysis Supply Management Engineering Design of Experiments See 15+     See less Education Oregon State University BSME,  Mechanical Engineering 1991  – 1996 Activities and Societies:  Pi Tau Sigma Oregon State University BSME,  Mechanical Engineering 1991  – 1996 Activities and Societies:  Pi Tau Sigma Oregon State University BSME,  Mechanical Engineering 1991  – 1996 Activities and Societies:  Pi Tau Sigma Oregon State University BSME,  Mechanical Engineering 1991  – 1996 Activities and Societies:  Pi Tau Sigma ", "Summary Successful manager with expertise in Operations, Planning, Procurement, Manufacturing, Customer Support and Team Development Summary Successful manager with expertise in Operations, Planning, Procurement, Manufacturing, Customer Support and Team Development Successful manager with expertise in Operations, Planning, Procurement, Manufacturing, Customer Support and Team Development Successful manager with expertise in Operations, Planning, Procurement, Manufacturing, Customer Support and Team Development Experience Production and Materials Manager Intel Corporation July 2001  –  July 2015  (14 years 1 month) Folsom, California Managed Operations, Planning and Manufacturing teams in 5 Geography’s.  \nTeams roles consist of People Managers, planning, procurement, budgeting, demand collection, product deployment, platform integration, sustaining and support, board level rework and debug, inventory control and lab management IT Business Continuity / Call Center Intel Corporation 1994  –  2001  (7 years) Folsom, California Disaster Recovery Manager – owned Processes, Procedures and Testing of the mainframe in the Corporate Intel datacenter.  \nCall Center – owned consolidation of multiple application call centers into the central Folsom call center. Hardware Planner / Software Manufacturing National Semiconductor 1980  –  1990  (10 years) Santa Clara , California Provided Planning Support with internal manufacturing for System and board level type products.  \nSuccessfully transitioned all hardware manufacturing to Hong Kong \nManaged Software Manufacturing, Shipping, Receiving teams Production and Materials Manager Intel Corporation July 2001  –  July 2015  (14 years 1 month) Folsom, California Managed Operations, Planning and Manufacturing teams in 5 Geography’s.  \nTeams roles consist of People Managers, planning, procurement, budgeting, demand collection, product deployment, platform integration, sustaining and support, board level rework and debug, inventory control and lab management Production and Materials Manager Intel Corporation July 2001  –  July 2015  (14 years 1 month) Folsom, California Managed Operations, Planning and Manufacturing teams in 5 Geography’s.  \nTeams roles consist of People Managers, planning, procurement, budgeting, demand collection, product deployment, platform integration, sustaining and support, board level rework and debug, inventory control and lab management IT Business Continuity / Call Center Intel Corporation 1994  –  2001  (7 years) Folsom, California Disaster Recovery Manager – owned Processes, Procedures and Testing of the mainframe in the Corporate Intel datacenter.  \nCall Center – owned consolidation of multiple application call centers into the central Folsom call center. IT Business Continuity / Call Center Intel Corporation 1994  –  2001  (7 years) Folsom, California Disaster Recovery Manager – owned Processes, Procedures and Testing of the mainframe in the Corporate Intel datacenter.  \nCall Center – owned consolidation of multiple application call centers into the central Folsom call center. Hardware Planner / Software Manufacturing National Semiconductor 1980  –  1990  (10 years) Santa Clara , California Provided Planning Support with internal manufacturing for System and board level type products.  \nSuccessfully transitioned all hardware manufacturing to Hong Kong \nManaged Software Manufacturing, Shipping, Receiving teams Hardware Planner / Software Manufacturing National Semiconductor 1980  –  1990  (10 years) Santa Clara , California Provided Planning Support with internal manufacturing for System and board level type products.  \nSuccessfully transitioned all hardware manufacturing to Hong Kong \nManaged Software Manufacturing, Shipping, Receiving teams Skills Operations, Planning,... Semiconductors Electronics Cross-functional Team... Management Manufacturing Product Development Engineering Management SPC Data Center IC Testing SoC Program Management Product Management Skills  Operations, Planning,... Semiconductors Electronics Cross-functional Team... Management Manufacturing Product Development Engineering Management SPC Data Center IC Testing SoC Program Management Product Management Operations, Planning,... Semiconductors Electronics Cross-functional Team... Management Manufacturing Product Development Engineering Management SPC Data Center IC Testing SoC Program Management Product Management Operations, Planning,... Semiconductors Electronics Cross-functional Team... Management Manufacturing Product Development Engineering Management SPC Data Center IC Testing SoC Program Management Product Management Education The Ohio State University Landscape Architecture 1975  – 1976 Landscape Design Copley High School 1970  – 1974 The Ohio State University Landscape Architecture 1975  – 1976 Landscape Design The Ohio State University Landscape Architecture 1975  – 1976 Landscape Design The Ohio State University Landscape Architecture 1975  – 1976 Landscape Design Copley High School 1970  – 1974 Copley High School 1970  – 1974 Copley High School 1970  – 1974 "]}