{"position": "Operations Program Manager", "company": "Intel Corporation", "profiles": ["Summary Specialties:Theory of Constraints Development Process Expert, Critical Chain Program Management Expert, Lean Six Sigma, Operational Excellence, Sr. Technical Program Manager Summary Specialties:Theory of Constraints Development Process Expert, Critical Chain Program Management Expert, Lean Six Sigma, Operational Excellence, Sr. Technical Program Manager Specialties:Theory of Constraints Development Process Expert, Critical Chain Program Management Expert, Lean Six Sigma, Operational Excellence, Sr. Technical Program Manager Specialties:Theory of Constraints Development Process Expert, Critical Chain Program Management Expert, Lean Six Sigma, Operational Excellence, Sr. Technical Program Manager Experience Senior Operations Program Manager Intel Corporation August 2015  – Present (1 month) Hillsboro, OR Leading the standardization of business processes and policies across Intel Corporation for an end-to-end device management lifecycle process on all pre-release system device prototypes/samples relevant to FCC regulatory requirements. Partnering with each Product Group, leading & training key personnel to successfully implement the designed process followed by supporting through execution and process sustaining. Senior Business Operations & Operational Excellence Manager Intel Corporation November 2012  –  August 2015  (2 years 10 months) Hillsboro, OR Improving the operational systems, processes and policies through optimization of management reporting, information flow and management, business process and organizational planning. Leading the organization's long-term and annual budgeting and planning process, including development and execution of initiatives geared toward operational excellence. Monitoring and managing current processes and procedures via key performance indicators, improving in targeted areas when needed. Community Outreach Director Oregon Chapter Team RWB January 2014  –  June 2015  (1 year 6 months) Portland, Oregon Area In a Volunteer support role, coordinate with Athletic & Social Directors to ensure adequate communication & exposure of all Chapter activities. Manage Chapter's social media outlets and interface with all forms of traditional media. Establish and maintain value-added partnerships with local vendors such as restaurants, running/athletic stores and professional organizations. Work closely with Chapter Staff to produce and distribute all chapter communications, including Chapter monthly newsletter and communication of events and activities. \nhttps://www.facebook.com/TeamRwbOregon Corporate Lifecycles Senior Program Manager Intel Corporation July 2011  –  November 2012  (1 year 5 months) Hillsboro, OR Software & Services Group Operational Excellence (OpX) Senior Program Manager Intel Corporation March 2009  –  January 2011  (1 year 11 months) Providing senior leadership support to Key Corporate, SSG Executive Offices and other Senior Level Stakeholders by leading SSG Group Operational Excellence activities to improve performance and productivity, including the development and deployment of OpX projects. Applying process improvement, LEAN Six Sigma practices and quality methods. Responsible for all aspects of SSG's OpX program including: defining overall scope, strategic objectives, deliverables to achieve the goals, then driving education and adoption of the overall program. Also evolving Operational Excellence capability through focus on growth and utilization of OpX assessment and improvement methods for SSG business processes, including Business Process Management (BPM), Business Process Improvement (BPI) and assessment methods. Corporate Platform Office (CPO) Programs Execution Sr. Manager Intel Corp April 2007  –  March 2009  (2 years) Leading an organization developing innovative and repeatable program management capabilities driving measurable improvements in efficiency and delivery supporting Intel organizations, platforms, and product development. (Open) 1 recommendation Beth Jensen, PMP Project Manager, Diabetes Business Unit, Global Medical Affairs at Eli Lilly and Company Allen and I met at a critical chain project management conference, which began many years of professional collaboration and information sharing between the two of us and colleagues at our respective companies. After working out a nondisclosure... View Senior Technical Program Manager, LAN Access Division Intel Corp April 2005  –  April 2007  (2 years 1 month) (Open) 2 recommendations Julie Moore Senior Program Manager, Engineering Computing at Intel Corporation Allen is a very conscientious, intelligent, and humble individual who is a great working partner! Allen has a variety of... View Ron Davison Product Development & Project Management Consultant Working with Allen is refreshing for so many reasons. He looks for creative solutions, not the first solution and is willing... View Theory of Constraints PM, Deployment Manager, Communications Group Intel Corp January 2003  –  April 2005  (2 years 4 months) (Open) 1 recommendation Todd Lewellen Global Customer Engineering Director Allen is a fantastic resource and asset to any team. He has the unique ability to drive the right planning and strategy development up front and then turn that strategy into action and execute.\nHis strong business knowledge enables him to... View Theory of Constraints PM, Project Manager, Platform Networking Group Intel Corp January 1999  –  April 2003  (4 years 4 months) Sr. Test Development Engr Mgr Intel Corporation 1994  –  1997  (3 years) PMO Manager Dell Computer 1993  –  1994  (1 year) Customer Support Engineer TSSI Inc 1991  –  1993  (2 years) Senior Test Development Engineer Raytheon Missile Systems July 1985  –  January 1989  (3 years 7 months) Created Test Programs for circuit boards used in AMRAAM and Maverick missile system electronics. Field Applications Engineer Hughes Aircraft Company October 1984  –  July 1985  (10 months) Responsible for field maintenance support of ARBS system in Marine aircraft. Senior Operations Program Manager Intel Corporation August 2015  – Present (1 month) Hillsboro, OR Leading the standardization of business processes and policies across Intel Corporation for an end-to-end device management lifecycle process on all pre-release system device prototypes/samples relevant to FCC regulatory requirements. Partnering with each Product Group, leading & training key personnel to successfully implement the designed process followed by supporting through execution and process sustaining. Senior Operations Program Manager Intel Corporation August 2015  – Present (1 month) Hillsboro, OR Leading the standardization of business processes and policies across Intel Corporation for an end-to-end device management lifecycle process on all pre-release system device prototypes/samples relevant to FCC regulatory requirements. Partnering with each Product Group, leading & training key personnel to successfully implement the designed process followed by supporting through execution and process sustaining. Senior Business Operations & Operational Excellence Manager Intel Corporation November 2012  –  August 2015  (2 years 10 months) Hillsboro, OR Improving the operational systems, processes and policies through optimization of management reporting, information flow and management, business process and organizational planning. Leading the organization's long-term and annual budgeting and planning process, including development and execution of initiatives geared toward operational excellence. Monitoring and managing current processes and procedures via key performance indicators, improving in targeted areas when needed. Senior Business Operations & Operational Excellence Manager Intel Corporation November 2012  –  August 2015  (2 years 10 months) Hillsboro, OR Improving the operational systems, processes and policies through optimization of management reporting, information flow and management, business process and organizational planning. Leading the organization's long-term and annual budgeting and planning process, including development and execution of initiatives geared toward operational excellence. Monitoring and managing current processes and procedures via key performance indicators, improving in targeted areas when needed. Community Outreach Director Oregon Chapter Team RWB January 2014  –  June 2015  (1 year 6 months) Portland, Oregon Area In a Volunteer support role, coordinate with Athletic & Social Directors to ensure adequate communication & exposure of all Chapter activities. Manage Chapter's social media outlets and interface with all forms of traditional media. Establish and maintain value-added partnerships with local vendors such as restaurants, running/athletic stores and professional organizations. Work closely with Chapter Staff to produce and distribute all chapter communications, including Chapter monthly newsletter and communication of events and activities. \nhttps://www.facebook.com/TeamRwbOregon Community Outreach Director Oregon Chapter Team RWB January 2014  –  June 2015  (1 year 6 months) Portland, Oregon Area In a Volunteer support role, coordinate with Athletic & Social Directors to ensure adequate communication & exposure of all Chapter activities. Manage Chapter's social media outlets and interface with all forms of traditional media. Establish and maintain value-added partnerships with local vendors such as restaurants, running/athletic stores and professional organizations. Work closely with Chapter Staff to produce and distribute all chapter communications, including Chapter monthly newsletter and communication of events and activities. \nhttps://www.facebook.com/TeamRwbOregon Corporate Lifecycles Senior Program Manager Intel Corporation July 2011  –  November 2012  (1 year 5 months) Hillsboro, OR Corporate Lifecycles Senior Program Manager Intel Corporation July 2011  –  November 2012  (1 year 5 months) Hillsboro, OR Software & Services Group Operational Excellence (OpX) Senior Program Manager Intel Corporation March 2009  –  January 2011  (1 year 11 months) Providing senior leadership support to Key Corporate, SSG Executive Offices and other Senior Level Stakeholders by leading SSG Group Operational Excellence activities to improve performance and productivity, including the development and deployment of OpX projects. Applying process improvement, LEAN Six Sigma practices and quality methods. Responsible for all aspects of SSG's OpX program including: defining overall scope, strategic objectives, deliverables to achieve the goals, then driving education and adoption of the overall program. Also evolving Operational Excellence capability through focus on growth and utilization of OpX assessment and improvement methods for SSG business processes, including Business Process Management (BPM), Business Process Improvement (BPI) and assessment methods. Software & Services Group Operational Excellence (OpX) Senior Program Manager Intel Corporation March 2009  –  January 2011  (1 year 11 months) Providing senior leadership support to Key Corporate, SSG Executive Offices and other Senior Level Stakeholders by leading SSG Group Operational Excellence activities to improve performance and productivity, including the development and deployment of OpX projects. Applying process improvement, LEAN Six Sigma practices and quality methods. Responsible for all aspects of SSG's OpX program including: defining overall scope, strategic objectives, deliverables to achieve the goals, then driving education and adoption of the overall program. Also evolving Operational Excellence capability through focus on growth and utilization of OpX assessment and improvement methods for SSG business processes, including Business Process Management (BPM), Business Process Improvement (BPI) and assessment methods. Corporate Platform Office (CPO) Programs Execution Sr. Manager Intel Corp April 2007  –  March 2009  (2 years) Leading an organization developing innovative and repeatable program management capabilities driving measurable improvements in efficiency and delivery supporting Intel organizations, platforms, and product development. (Open) 1 recommendation Beth Jensen, PMP Project Manager, Diabetes Business Unit, Global Medical Affairs at Eli Lilly and Company Allen and I met at a critical chain project management conference, which began many years of professional collaboration and information sharing between the two of us and colleagues at our respective companies. After working out a nondisclosure... View Corporate Platform Office (CPO) Programs Execution Sr. Manager Intel Corp April 2007  –  March 2009  (2 years) Leading an organization developing innovative and repeatable program management capabilities driving measurable improvements in efficiency and delivery supporting Intel organizations, platforms, and product development. (Open) 1 recommendation Beth Jensen, PMP Project Manager, Diabetes Business Unit, Global Medical Affairs at Eli Lilly and Company Allen and I met at a critical chain project management conference, which began many years of professional collaboration and information sharing between the two of us and colleagues at our respective companies. After working out a nondisclosure... View Senior Technical Program Manager, LAN Access Division Intel Corp April 2005  –  April 2007  (2 years 1 month) (Open) 2 recommendations Julie Moore Senior Program Manager, Engineering Computing at Intel Corporation Allen is a very conscientious, intelligent, and humble individual who is a great working partner! Allen has a variety of... View Ron Davison Product Development & Project Management Consultant Working with Allen is refreshing for so many reasons. He looks for creative solutions, not the first solution and is willing... View Senior Technical Program Manager, LAN Access Division Intel Corp April 2005  –  April 2007  (2 years 1 month) (Open) 2 recommendations Julie Moore Senior Program Manager, Engineering Computing at Intel Corporation Allen is a very conscientious, intelligent, and humble individual who is a great working partner! Allen has a variety of... View Ron Davison Product Development & Project Management Consultant Working with Allen is refreshing for so many reasons. He looks for creative solutions, not the first solution and is willing... View Theory of Constraints PM, Deployment Manager, Communications Group Intel Corp January 2003  –  April 2005  (2 years 4 months) (Open) 1 recommendation Todd Lewellen Global Customer Engineering Director Allen is a fantastic resource and asset to any team. He has the unique ability to drive the right planning and strategy development up front and then turn that strategy into action and execute.\nHis strong business knowledge enables him to... View Theory of Constraints PM, Deployment Manager, Communications Group Intel Corp January 2003  –  April 2005  (2 years 4 months) (Open) 1 recommendation Todd Lewellen Global Customer Engineering Director Allen is a fantastic resource and asset to any team. He has the unique ability to drive the right planning and strategy development up front and then turn that strategy into action and execute.\nHis strong business knowledge enables him to... View Theory of Constraints PM, Project Manager, Platform Networking Group Intel Corp January 1999  –  April 2003  (4 years 4 months) Theory of Constraints PM, Project Manager, Platform Networking Group Intel Corp January 1999  –  April 2003  (4 years 4 months) Sr. Test Development Engr Mgr Intel Corporation 1994  –  1997  (3 years) Sr. Test Development Engr Mgr Intel Corporation 1994  –  1997  (3 years) PMO Manager Dell Computer 1993  –  1994  (1 year) PMO Manager Dell Computer 1993  –  1994  (1 year) Customer Support Engineer TSSI Inc 1991  –  1993  (2 years) Customer Support Engineer TSSI Inc 1991  –  1993  (2 years) Senior Test Development Engineer Raytheon Missile Systems July 1985  –  January 1989  (3 years 7 months) Created Test Programs for circuit boards used in AMRAAM and Maverick missile system electronics. Senior Test Development Engineer Raytheon Missile Systems July 1985  –  January 1989  (3 years 7 months) Created Test Programs for circuit boards used in AMRAAM and Maverick missile system electronics. Field Applications Engineer Hughes Aircraft Company October 1984  –  July 1985  (10 months) Responsible for field maintenance support of ARBS system in Marine aircraft. Field Applications Engineer Hughes Aircraft Company October 1984  –  July 1985  (10 months) Responsible for field maintenance support of ARBS system in Marine aircraft. Skills Top Skills 85 Program Management 45 Process Improvement 41 Business Process... 35 Six Sigma 29 Project Management 28 Cross-functional Team... 25 Leadership 19 Business Process 16 Management 15 Strategy Allen also knows about... 13 Lean Manufacturing 13 Testing 11 Operational Excellence 8 Product Development 8 Semiconductors 6 Product Management 6 Project Planning 6 Engineering Management 5 Business Strategy 5 Business Analysis 5 Theory of Constraints 4 Integration 4 Continuous Improvement 4 Team Leadership 4 Analysis 4 Software Project... 4 Design of Experiments 3 Operations Management 3 Project Portfolio... 3 SDLC 3 PMO 3 MS Project 3 Strategic Planning 3 Quality Management 3 Supply Chain 3 SPC 3 Value Stream Mapping 3 Manufacturing Operations 2 PMP 2 Process Engineering 2 Change Management 2 Manufacturing 2 Quality Assurance 2 Supply Chain Management 2 Visio 2 DMAIC 2 Electronics 1 Vendor Management 1 Process Simulation 1 Root Cause Analysis See 25+     See less Skills  Top Skills 85 Program Management 45 Process Improvement 41 Business Process... 35 Six Sigma 29 Project Management 28 Cross-functional Team... 25 Leadership 19 Business Process 16 Management 15 Strategy Allen also knows about... 13 Lean Manufacturing 13 Testing 11 Operational Excellence 8 Product Development 8 Semiconductors 6 Product Management 6 Project Planning 6 Engineering Management 5 Business Strategy 5 Business Analysis 5 Theory of Constraints 4 Integration 4 Continuous Improvement 4 Team Leadership 4 Analysis 4 Software Project... 4 Design of Experiments 3 Operations Management 3 Project Portfolio... 3 SDLC 3 PMO 3 MS Project 3 Strategic Planning 3 Quality Management 3 Supply Chain 3 SPC 3 Value Stream Mapping 3 Manufacturing Operations 2 PMP 2 Process Engineering 2 Change Management 2 Manufacturing 2 Quality Assurance 2 Supply Chain Management 2 Visio 2 DMAIC 2 Electronics 1 Vendor Management 1 Process Simulation 1 Root Cause Analysis See 25+     See less Top Skills 85 Program Management 45 Process Improvement 41 Business Process... 35 Six Sigma 29 Project Management 28 Cross-functional Team... 25 Leadership 19 Business Process 16 Management 15 Strategy Allen also knows about... 13 Lean Manufacturing 13 Testing 11 Operational Excellence 8 Product Development 8 Semiconductors 6 Product Management 6 Project Planning 6 Engineering Management 5 Business Strategy 5 Business Analysis 5 Theory of Constraints 4 Integration 4 Continuous Improvement 4 Team Leadership 4 Analysis 4 Software Project... 4 Design of Experiments 3 Operations Management 3 Project Portfolio... 3 SDLC 3 PMO 3 MS Project 3 Strategic Planning 3 Quality Management 3 Supply Chain 3 SPC 3 Value Stream Mapping 3 Manufacturing Operations 2 PMP 2 Process Engineering 2 Change Management 2 Manufacturing 2 Quality Assurance 2 Supply Chain Management 2 Visio 2 DMAIC 2 Electronics 1 Vendor Management 1 Process Simulation 1 Root Cause Analysis See 25+     See less Top Skills 85 Program Management 45 Process Improvement 41 Business Process... 35 Six Sigma 29 Project Management 28 Cross-functional Team... 25 Leadership 19 Business Process 16 Management 15 Strategy Allen also knows about... 13 Lean Manufacturing 13 Testing 11 Operational Excellence 8 Product Development 8 Semiconductors 6 Product Management 6 Project Planning 6 Engineering Management 5 Business Strategy 5 Business Analysis 5 Theory of Constraints 4 Integration 4 Continuous Improvement 4 Team Leadership 4 Analysis 4 Software Project... 4 Design of Experiments 3 Operations Management 3 Project Portfolio... 3 SDLC 3 PMO 3 MS Project 3 Strategic Planning 3 Quality Management 3 Supply Chain 3 SPC 3 Value Stream Mapping 3 Manufacturing Operations 2 PMP 2 Process Engineering 2 Change Management 2 Manufacturing 2 Quality Assurance 2 Supply Chain Management 2 Visio 2 DMAIC 2 Electronics 1 Vendor Management 1 Process Simulation 1 Root Cause Analysis See 25+     See less                     13 Lean Manufacturing 13 Testing 11 Operational Excellence 8 Product Development 8 Semiconductors 6 Product Management 6 Project Planning 6 Engineering Management 5 Business Strategy 5 Business Analysis 5 Theory of Constraints 4 Integration 4 Continuous Improvement 4 Team Leadership 4 Analysis 4 Software Project... 4 Design of Experiments 3 Operations Management 3 Project Portfolio... 3 SDLC 3 PMO 3 MS Project 3 Strategic Planning 3 Quality Management 3 Supply Chain 3 SPC 3 Value Stream Mapping 3 Manufacturing Operations 2 PMP 2 Process Engineering 2 Change Management 2 Manufacturing 2 Quality Assurance 2 Supply Chain Management 2 Visio 2 DMAIC 2 Electronics 1 Vendor Management 1 Process Simulation 1 Root Cause Analysis Education Willamette University - Atkinson Graduate School of Management Masters of Business Administration,  Business Administration and Management ,  General 2009  – 2011 Activities and Societies:  Atkinson School of Business Board of Trustees Executive MBA Program Student Representative ,  Peer Resource Advisor (Open) 1 recommendation Jeff Johanson, MBA Senior Account Manager at InfoGroup Northwest I had the good fortune of studying with Allen over the course of our two-year MBA program at Willamette University. During that time I found Allen to be among the brightest, most engaged members of our cohort. He regularly lead project teams that... View DeVry Institute of Technology BSEET,  Electrical Engineering 1982  – 1984 *THE* Ohio State University Electrical Engineering 1977  – 1982 Activities and Societies:  Ohio State University Marching Band Willamette University - Atkinson Graduate School of Management Masters of Business Administration,  Business Administration and Management ,  General 2009  – 2011 Activities and Societies:  Atkinson School of Business Board of Trustees Executive MBA Program Student Representative ,  Peer Resource Advisor (Open) 1 recommendation Jeff Johanson, MBA Senior Account Manager at InfoGroup Northwest I had the good fortune of studying with Allen over the course of our two-year MBA program at Willamette University. During that time I found Allen to be among the brightest, most engaged members of our cohort. He regularly lead project teams that... View Willamette University - Atkinson Graduate School of Management Masters of Business Administration,  Business Administration and Management ,  General 2009  – 2011 Activities and Societies:  Atkinson School of Business Board of Trustees Executive MBA Program Student Representative ,  Peer Resource Advisor (Open) 1 recommendation Jeff Johanson, MBA Senior Account Manager at InfoGroup Northwest I had the good fortune of studying with Allen over the course of our two-year MBA program at Willamette University. During that time I found Allen to be among the brightest, most engaged members of our cohort. He regularly lead project teams that... View Willamette University - Atkinson Graduate School of Management Masters of Business Administration,  Business Administration and Management ,  General 2009  – 2011 Activities and Societies:  Atkinson School of Business Board of Trustees Executive MBA Program Student Representative ,  Peer Resource Advisor (Open) 1 recommendation Jeff Johanson, MBA Senior Account Manager at InfoGroup Northwest I had the good fortune of studying with Allen over the course of our two-year MBA program at Willamette University. During that time I found Allen to be among the brightest, most engaged members of our cohort. He regularly lead project teams that... View DeVry Institute of Technology BSEET,  Electrical Engineering 1982  – 1984 DeVry Institute of Technology BSEET,  Electrical Engineering 1982  – 1984 DeVry Institute of Technology BSEET,  Electrical Engineering 1982  – 1984 *THE* Ohio State University Electrical Engineering 1977  – 1982 Activities and Societies:  Ohio State University Marching Band *THE* Ohio State University Electrical Engineering 1977  – 1982 Activities and Societies:  Ohio State University Marching Band *THE* Ohio State University Electrical Engineering 1977  – 1982 Activities and Societies:  Ohio State University Marching Band ", "Summary Successful program manager delivers flawless execution with over 15 years experience in program and project lifecycle management. Leader of cross organizational projects that increase market competiveness, measures financial benefit and reduces compliance risk. Direct in management style, a leader with integrity and honesty. \n \nSpecialties: R&D prototype product regulatory compliance with focus on FCC and intellectual property, project management of software development projects, agile methodology, process improvement, yearly/quarterly financial planning activities; capital budget tracking Summary Successful program manager delivers flawless execution with over 15 years experience in program and project lifecycle management. Leader of cross organizational projects that increase market competiveness, measures financial benefit and reduces compliance risk. Direct in management style, a leader with integrity and honesty. \n \nSpecialties: R&D prototype product regulatory compliance with focus on FCC and intellectual property, project management of software development projects, agile methodology, process improvement, yearly/quarterly financial planning activities; capital budget tracking Successful program manager delivers flawless execution with over 15 years experience in program and project lifecycle management. Leader of cross organizational projects that increase market competiveness, measures financial benefit and reduces compliance risk. Direct in management style, a leader with integrity and honesty. \n \nSpecialties: R&D prototype product regulatory compliance with focus on FCC and intellectual property, project management of software development projects, agile methodology, process improvement, yearly/quarterly financial planning activities; capital budget tracking Successful program manager delivers flawless execution with over 15 years experience in program and project lifecycle management. Leader of cross organizational projects that increase market competiveness, measures financial benefit and reduces compliance risk. Direct in management style, a leader with integrity and honesty. \n \nSpecialties: R&D prototype product regulatory compliance with focus on FCC and intellectual property, project management of software development projects, agile methodology, process improvement, yearly/quarterly financial planning activities; capital budget tracking Experience Program Manager Intel Corporation December 2013  –  July 2015  (1 year 8 months) End-2-End Prototype/Device Inventory Management Program \nR&D Prototype Order - Build - Ship - Inventory - Recycle Processes and Tool requirements \nCustomer Onboarding for management of prototype systems \nProduct Regulatory, FCC Compliance regulations and process implementation for tracking Prototype Systems \nAgile user story creation and implementation (Open) 2 honors and awards Intel Department Award Development and Deployment of Global labs ISMP processes and Tool for Asset Management. View We are Intel Recognition Thank you for your outstanding results orientation and leadership in realizing the opportunity to align the Internal Demand... View (Open) 2 recommendations Christie Henne Bradley Project Mgr/Developer at Intel Corp Polly is a very talented Program Manager. She is the kind of PM who is able to cut through bureaucracy and get things done.... View Charles Goldman Global Lab Asset ServiceNow Program Manager at Intel Corporation Polly is a highly motived, well organized team player and knows how to drive valuable process improvements. View Operations Manager Intel Corporation April 2010  –  November 2013  (3 years 8 months) Little Rock, Arkansas Area Operations Manager (04/2010 – 11/2013) \nIntel Corporation, Mobile & Communications Group \nManage PMO & Quality department's budget, Capital planning/budget, planning cycle activities, headcount, department staff meetings, and purchase reqs/spending submissions. Provide cross-organization project management support and Ethics & Compliance representation. \n \nProgram manager for prototype inventory control system and process, prototype demand mgmt tool and processes. (Open) 2 honors and awards We Are Intel Recognition Outstanding contribution to the Future of Samples Business Process Excellence Six Sigma Kaizen event. As are result of your... View We are Intel Recognition Thank you for your effort is helping to deliver to our first Finance Update in our new centralized prototype management... View (Open) 1 recommendation Sisley Tiernan Operations Manager, Intel Polly and I worked together at Intel for ~ 2 years and I found her to be insightful, incredibly knowledgeable about process and the business and able to quickly assimilate information to recommend improvements. Polly was a huge asset on our teams... View IT Business Operations Manager Intel Corporation January 2009  –  April 2010  (1 year 4 months) IT Ops Application Readiness Lead  \nLead IT Operations application readiness on engagement schedule, milestones, compliance requirements and communication strategy to enable a successful deployment of application early adopter program. \n \nIT Ops Application Portfolio Management Lead \nEnsure tools, policies and processes are in place that define and manage IT Operations Application Portfolio to justify and measure the financial benefit of each application. \n \nIT Ops Ethics and Compliance Lead  \nCollaborate with IT Ops Staff and employees to Keep Intel legal and compliant through survey, analysis and risk assessments and ensure that stakeholders see IT risks/returns IT Sustainability Project Manager Intel Corporation June 2009  –  January 2010  (8 months) Collaborate with strategy owners to drive direction and alignment with overall quarterly deliverables to meet program goals and objectives. Ensure program transformation and marketing plans align to yearly program strategies and quarterly deliverables, both internal and within the industry. Brought systematic program management processes to the IT Sustainability program through use of roles and responsibilities guidelines, MSPS, weekly checkpoints that enabled the team to stay on track and complete deliverables within 95% completion quarter on quarter. Strategic Analyst Intel January 2009  –  May 2009  (5 months) Performed an analysis on the current state health of IT’s capabilities to identify areas which may need additional focus and investment to close performance gaps. Provide coordination of stakeholders, data gathering & analysis, presentation material, and the final delivery event with IT stakeholders. Provide Retrospective (PIR) service to program team after completion of assessment to improve future analysis cycles. Received an IT DRA for results orientation and leadership in delivering the 2009 CSA results. (Open) 1 recommendation Annie Gladding Intel Education Sales Program Manager Polly is a detail-oriented and thorough program manager who is also very fun to work with. Polly inspires those around her to work hard toward challenging end-results. The result has been a series of highly successful projects and programs. Polly... View IT Operations & Services PMO Lead / Resource Manager Intel Corporation January 2007  –  January 2009  (2 years 1 month) Led IT Operations in a cross-organization program to increase IT’s competitiveness through standards and predictable project execution. Provided leadership guidance and recommendations to reduce project through-put time by 70% and established clear decision making bodies using RAPID for programs/projects. Developed training material and trained all IT Ops PM's, Resource Managers and Coaches on the IT Resource Management Tool. \n \nAdvised and coached Project Managers on PLC, CMMI, MSPS and general project management methods. Led IT OPS to achieve a 50% reduction of project TPT to deliver services and products to our customer base in 2007 and a 40% reduction in 2008. Led IT Ops through several financial planning cycles for programs, projects and resources requiring new funding for the next year. Analyzed and prepared bi-weekly PMO indicators for IT Ops Staff meeting review/discussion. Received the 2007 IT Excellence Award as part of the IT PMO Team for driving an outstanding transformation of IT project delivery having a global impact to Intel and IT. Product Manager for Process and Workflow Automation Applications Intel Corporation January 2007  –  December 2007  (1 year) Responsible for the overall product strategy; mission, objectives, roadmap and key interface to the vendor and customer for 7 different applications. Removed from environment 42% of the Workflow application line avoiding $300K and saving $519K for customers in support of IT's 2007 strategic initiative. IT Operations Program Manager Intel Corporation December 2003  –  December 2006  (3 years 1 month) Responsible for the implementation of an eSupport platform, a multi-channel self-service customer portal (Self-Help, Chat, Self-Healing, & PC Health Check).  \nLed a large virtual team of cross-geo site people across IT to develop, prioritize and approve requirements. End-to end program management included identification and quantification of new opportunities through business case and ROI proposals. Scoped plans and partnered with the technical and external vendor teams to develop, test and deploy the solutions agreed. Responsibility also included establishing overall program metrics, escalation, SLA’s and customer satisfaction. \n \nCo-authored the Innovative eSupport Case Study within “Managing IT Innovation for Business Value”, published Oct 2007. (Open) 1 recommendation Carla Milinski Office Administrative Technician at AF Network Integration Center/EVE Detailed-oriented person. Very focused on her position. Would gladly work with her anytime. View Project Manager Intel, Corporation March 1999  –  December 2003  (4 years 10 months) Ran small to med size projects using Program Life Cycle methodology, BVI, NPV, etc. Business Analyst Intel, Corporation March 1998  –  March 1999  (1 year 1 month) Folsom/OSC Site Liaison Intel, Corporation February 1997  –  March 1998  (1 year 2 months) Provided partnership and open dialog between site operations, OSC and Technical Support Center. This included escalations, routing changes, volume of tickets, issue awareness, process updates, etc. Program Manager Intel Corporation December 2013  –  July 2015  (1 year 8 months) End-2-End Prototype/Device Inventory Management Program \nR&D Prototype Order - Build - Ship - Inventory - Recycle Processes and Tool requirements \nCustomer Onboarding for management of prototype systems \nProduct Regulatory, FCC Compliance regulations and process implementation for tracking Prototype Systems \nAgile user story creation and implementation (Open) 2 honors and awards Intel Department Award Development and Deployment of Global labs ISMP processes and Tool for Asset Management. View We are Intel Recognition Thank you for your outstanding results orientation and leadership in realizing the opportunity to align the Internal Demand... View (Open) 2 recommendations Christie Henne Bradley Project Mgr/Developer at Intel Corp Polly is a very talented Program Manager. She is the kind of PM who is able to cut through bureaucracy and get things done.... View Charles Goldman Global Lab Asset ServiceNow Program Manager at Intel Corporation Polly is a highly motived, well organized team player and knows how to drive valuable process improvements. View Program Manager Intel Corporation December 2013  –  July 2015  (1 year 8 months) End-2-End Prototype/Device Inventory Management Program \nR&D Prototype Order - Build - Ship - Inventory - Recycle Processes and Tool requirements \nCustomer Onboarding for management of prototype systems \nProduct Regulatory, FCC Compliance regulations and process implementation for tracking Prototype Systems \nAgile user story creation and implementation (Open) 2 honors and awards Intel Department Award Development and Deployment of Global labs ISMP processes and Tool for Asset Management. View We are Intel Recognition Thank you for your outstanding results orientation and leadership in realizing the opportunity to align the Internal Demand... View (Open) 2 recommendations Christie Henne Bradley Project Mgr/Developer at Intel Corp Polly is a very talented Program Manager. She is the kind of PM who is able to cut through bureaucracy and get things done.... View Charles Goldman Global Lab Asset ServiceNow Program Manager at Intel Corporation Polly is a highly motived, well organized team player and knows how to drive valuable process improvements. View Operations Manager Intel Corporation April 2010  –  November 2013  (3 years 8 months) Little Rock, Arkansas Area Operations Manager (04/2010 – 11/2013) \nIntel Corporation, Mobile & Communications Group \nManage PMO & Quality department's budget, Capital planning/budget, planning cycle activities, headcount, department staff meetings, and purchase reqs/spending submissions. Provide cross-organization project management support and Ethics & Compliance representation. \n \nProgram manager for prototype inventory control system and process, prototype demand mgmt tool and processes. (Open) 2 honors and awards We Are Intel Recognition Outstanding contribution to the Future of Samples Business Process Excellence Six Sigma Kaizen event. As are result of your... View We are Intel Recognition Thank you for your effort is helping to deliver to our first Finance Update in our new centralized prototype management... View (Open) 1 recommendation Sisley Tiernan Operations Manager, Intel Polly and I worked together at Intel for ~ 2 years and I found her to be insightful, incredibly knowledgeable about process and the business and able to quickly assimilate information to recommend improvements. Polly was a huge asset on our teams... View Operations Manager Intel Corporation April 2010  –  November 2013  (3 years 8 months) Little Rock, Arkansas Area Operations Manager (04/2010 – 11/2013) \nIntel Corporation, Mobile & Communications Group \nManage PMO & Quality department's budget, Capital planning/budget, planning cycle activities, headcount, department staff meetings, and purchase reqs/spending submissions. Provide cross-organization project management support and Ethics & Compliance representation. \n \nProgram manager for prototype inventory control system and process, prototype demand mgmt tool and processes. (Open) 2 honors and awards We Are Intel Recognition Outstanding contribution to the Future of Samples Business Process Excellence Six Sigma Kaizen event. As are result of your... View We are Intel Recognition Thank you for your effort is helping to deliver to our first Finance Update in our new centralized prototype management... View (Open) 1 recommendation Sisley Tiernan Operations Manager, Intel Polly and I worked together at Intel for ~ 2 years and I found her to be insightful, incredibly knowledgeable about process and the business and able to quickly assimilate information to recommend improvements. Polly was a huge asset on our teams... View IT Business Operations Manager Intel Corporation January 2009  –  April 2010  (1 year 4 months) IT Ops Application Readiness Lead  \nLead IT Operations application readiness on engagement schedule, milestones, compliance requirements and communication strategy to enable a successful deployment of application early adopter program. \n \nIT Ops Application Portfolio Management Lead \nEnsure tools, policies and processes are in place that define and manage IT Operations Application Portfolio to justify and measure the financial benefit of each application. \n \nIT Ops Ethics and Compliance Lead  \nCollaborate with IT Ops Staff and employees to Keep Intel legal and compliant through survey, analysis and risk assessments and ensure that stakeholders see IT risks/returns IT Business Operations Manager Intel Corporation January 2009  –  April 2010  (1 year 4 months) IT Ops Application Readiness Lead  \nLead IT Operations application readiness on engagement schedule, milestones, compliance requirements and communication strategy to enable a successful deployment of application early adopter program. \n \nIT Ops Application Portfolio Management Lead \nEnsure tools, policies and processes are in place that define and manage IT Operations Application Portfolio to justify and measure the financial benefit of each application. \n \nIT Ops Ethics and Compliance Lead  \nCollaborate with IT Ops Staff and employees to Keep Intel legal and compliant through survey, analysis and risk assessments and ensure that stakeholders see IT risks/returns IT Sustainability Project Manager Intel Corporation June 2009  –  January 2010  (8 months) Collaborate with strategy owners to drive direction and alignment with overall quarterly deliverables to meet program goals and objectives. Ensure program transformation and marketing plans align to yearly program strategies and quarterly deliverables, both internal and within the industry. Brought systematic program management processes to the IT Sustainability program through use of roles and responsibilities guidelines, MSPS, weekly checkpoints that enabled the team to stay on track and complete deliverables within 95% completion quarter on quarter. IT Sustainability Project Manager Intel Corporation June 2009  –  January 2010  (8 months) Collaborate with strategy owners to drive direction and alignment with overall quarterly deliverables to meet program goals and objectives. Ensure program transformation and marketing plans align to yearly program strategies and quarterly deliverables, both internal and within the industry. Brought systematic program management processes to the IT Sustainability program through use of roles and responsibilities guidelines, MSPS, weekly checkpoints that enabled the team to stay on track and complete deliverables within 95% completion quarter on quarter. Strategic Analyst Intel January 2009  –  May 2009  (5 months) Performed an analysis on the current state health of IT’s capabilities to identify areas which may need additional focus and investment to close performance gaps. Provide coordination of stakeholders, data gathering & analysis, presentation material, and the final delivery event with IT stakeholders. Provide Retrospective (PIR) service to program team after completion of assessment to improve future analysis cycles. Received an IT DRA for results orientation and leadership in delivering the 2009 CSA results. (Open) 1 recommendation Annie Gladding Intel Education Sales Program Manager Polly is a detail-oriented and thorough program manager who is also very fun to work with. Polly inspires those around her to work hard toward challenging end-results. The result has been a series of highly successful projects and programs. Polly... View Strategic Analyst Intel January 2009  –  May 2009  (5 months) Performed an analysis on the current state health of IT’s capabilities to identify areas which may need additional focus and investment to close performance gaps. Provide coordination of stakeholders, data gathering & analysis, presentation material, and the final delivery event with IT stakeholders. Provide Retrospective (PIR) service to program team after completion of assessment to improve future analysis cycles. Received an IT DRA for results orientation and leadership in delivering the 2009 CSA results. (Open) 1 recommendation Annie Gladding Intel Education Sales Program Manager Polly is a detail-oriented and thorough program manager who is also very fun to work with. Polly inspires those around her to work hard toward challenging end-results. The result has been a series of highly successful projects and programs. Polly... View IT Operations & Services PMO Lead / Resource Manager Intel Corporation January 2007  –  January 2009  (2 years 1 month) Led IT Operations in a cross-organization program to increase IT’s competitiveness through standards and predictable project execution. Provided leadership guidance and recommendations to reduce project through-put time by 70% and established clear decision making bodies using RAPID for programs/projects. Developed training material and trained all IT Ops PM's, Resource Managers and Coaches on the IT Resource Management Tool. \n \nAdvised and coached Project Managers on PLC, CMMI, MSPS and general project management methods. Led IT OPS to achieve a 50% reduction of project TPT to deliver services and products to our customer base in 2007 and a 40% reduction in 2008. Led IT Ops through several financial planning cycles for programs, projects and resources requiring new funding for the next year. Analyzed and prepared bi-weekly PMO indicators for IT Ops Staff meeting review/discussion. Received the 2007 IT Excellence Award as part of the IT PMO Team for driving an outstanding transformation of IT project delivery having a global impact to Intel and IT. IT Operations & Services PMO Lead / Resource Manager Intel Corporation January 2007  –  January 2009  (2 years 1 month) Led IT Operations in a cross-organization program to increase IT’s competitiveness through standards and predictable project execution. Provided leadership guidance and recommendations to reduce project through-put time by 70% and established clear decision making bodies using RAPID for programs/projects. Developed training material and trained all IT Ops PM's, Resource Managers and Coaches on the IT Resource Management Tool. \n \nAdvised and coached Project Managers on PLC, CMMI, MSPS and general project management methods. Led IT OPS to achieve a 50% reduction of project TPT to deliver services and products to our customer base in 2007 and a 40% reduction in 2008. Led IT Ops through several financial planning cycles for programs, projects and resources requiring new funding for the next year. Analyzed and prepared bi-weekly PMO indicators for IT Ops Staff meeting review/discussion. Received the 2007 IT Excellence Award as part of the IT PMO Team for driving an outstanding transformation of IT project delivery having a global impact to Intel and IT. Product Manager for Process and Workflow Automation Applications Intel Corporation January 2007  –  December 2007  (1 year) Responsible for the overall product strategy; mission, objectives, roadmap and key interface to the vendor and customer for 7 different applications. Removed from environment 42% of the Workflow application line avoiding $300K and saving $519K for customers in support of IT's 2007 strategic initiative. Product Manager for Process and Workflow Automation Applications Intel Corporation January 2007  –  December 2007  (1 year) Responsible for the overall product strategy; mission, objectives, roadmap and key interface to the vendor and customer for 7 different applications. Removed from environment 42% of the Workflow application line avoiding $300K and saving $519K for customers in support of IT's 2007 strategic initiative. IT Operations Program Manager Intel Corporation December 2003  –  December 2006  (3 years 1 month) Responsible for the implementation of an eSupport platform, a multi-channel self-service customer portal (Self-Help, Chat, Self-Healing, & PC Health Check).  \nLed a large virtual team of cross-geo site people across IT to develop, prioritize and approve requirements. End-to end program management included identification and quantification of new opportunities through business case and ROI proposals. Scoped plans and partnered with the technical and external vendor teams to develop, test and deploy the solutions agreed. Responsibility also included establishing overall program metrics, escalation, SLA’s and customer satisfaction. \n \nCo-authored the Innovative eSupport Case Study within “Managing IT Innovation for Business Value”, published Oct 2007. (Open) 1 recommendation Carla Milinski Office Administrative Technician at AF Network Integration Center/EVE Detailed-oriented person. Very focused on her position. Would gladly work with her anytime. View IT Operations Program Manager Intel Corporation December 2003  –  December 2006  (3 years 1 month) Responsible for the implementation of an eSupport platform, a multi-channel self-service customer portal (Self-Help, Chat, Self-Healing, & PC Health Check).  \nLed a large virtual team of cross-geo site people across IT to develop, prioritize and approve requirements. End-to end program management included identification and quantification of new opportunities through business case and ROI proposals. Scoped plans and partnered with the technical and external vendor teams to develop, test and deploy the solutions agreed. Responsibility also included establishing overall program metrics, escalation, SLA’s and customer satisfaction. \n \nCo-authored the Innovative eSupport Case Study within “Managing IT Innovation for Business Value”, published Oct 2007. (Open) 1 recommendation Carla Milinski Office Administrative Technician at AF Network Integration Center/EVE Detailed-oriented person. Very focused on her position. Would gladly work with her anytime. View Project Manager Intel, Corporation March 1999  –  December 2003  (4 years 10 months) Ran small to med size projects using Program Life Cycle methodology, BVI, NPV, etc. Project Manager Intel, Corporation March 1999  –  December 2003  (4 years 10 months) Ran small to med size projects using Program Life Cycle methodology, BVI, NPV, etc. Business Analyst Intel, Corporation March 1998  –  March 1999  (1 year 1 month) Business Analyst Intel, Corporation March 1998  –  March 1999  (1 year 1 month) Folsom/OSC Site Liaison Intel, Corporation February 1997  –  March 1998  (1 year 2 months) Provided partnership and open dialog between site operations, OSC and Technical Support Center. This included escalations, routing changes, volume of tickets, issue awareness, process updates, etc. Folsom/OSC Site Liaison Intel, Corporation February 1997  –  March 1998  (1 year 2 months) Provided partnership and open dialog between site operations, OSC and Technical Support Center. This included escalations, routing changes, volume of tickets, issue awareness, process updates, etc. Languages English English English Skills Top Skills 43 Process Improvement 39 Program Management 24 Project Management 17 Cross-functional Team... 16 Product Management 15 Agile Methodologies 12 PMO 12 SDLC 11 Analysis 10 Project Planning Polly also knows about... 9 Leadership 8 Management 7 Integration 6 Strategy 6 Business Analysis 5 Software Development 5 Requirements Analysis 4 Testing 4 Software Project... 3 Waterfall 3 CMMI 3 Capital Budgeting 3 ITIL 3 PMP 3 Vendor Management 3 Project Portfolio... 3 Business Process... 3 IT Management 2 Business Planning 2 IT Service Management 2 Project Delivery 2 Business Process 1 Agile 1 Process Development 1 Strategic Financial... 1 Resource Management 0 Capital Equipment 0 Mobile Devices 0 Enterprise Software See 14+     See less Skills  Top Skills 43 Process Improvement 39 Program Management 24 Project Management 17 Cross-functional Team... 16 Product Management 15 Agile Methodologies 12 PMO 12 SDLC 11 Analysis 10 Project Planning Polly also knows about... 9 Leadership 8 Management 7 Integration 6 Strategy 6 Business Analysis 5 Software Development 5 Requirements Analysis 4 Testing 4 Software Project... 3 Waterfall 3 CMMI 3 Capital Budgeting 3 ITIL 3 PMP 3 Vendor Management 3 Project Portfolio... 3 Business Process... 3 IT Management 2 Business Planning 2 IT Service Management 2 Project Delivery 2 Business Process 1 Agile 1 Process Development 1 Strategic Financial... 1 Resource Management 0 Capital Equipment 0 Mobile Devices 0 Enterprise Software See 14+     See less Top Skills 43 Process Improvement 39 Program Management 24 Project Management 17 Cross-functional Team... 16 Product Management 15 Agile Methodologies 12 PMO 12 SDLC 11 Analysis 10 Project Planning Polly also knows about... 9 Leadership 8 Management 7 Integration 6 Strategy 6 Business Analysis 5 Software Development 5 Requirements Analysis 4 Testing 4 Software Project... 3 Waterfall 3 CMMI 3 Capital Budgeting 3 ITIL 3 PMP 3 Vendor Management 3 Project Portfolio... 3 Business Process... 3 IT Management 2 Business Planning 2 IT Service Management 2 Project Delivery 2 Business Process 1 Agile 1 Process Development 1 Strategic Financial... 1 Resource Management 0 Capital Equipment 0 Mobile Devices 0 Enterprise Software See 14+     See less Top Skills 43 Process Improvement 39 Program Management 24 Project Management 17 Cross-functional Team... 16 Product Management 15 Agile Methodologies 12 PMO 12 SDLC 11 Analysis 10 Project Planning Polly also knows about... 9 Leadership 8 Management 7 Integration 6 Strategy 6 Business Analysis 5 Software Development 5 Requirements Analysis 4 Testing 4 Software Project... 3 Waterfall 3 CMMI 3 Capital Budgeting 3 ITIL 3 PMP 3 Vendor Management 3 Project Portfolio... 3 Business Process... 3 IT Management 2 Business Planning 2 IT Service Management 2 Project Delivery 2 Business Process 1 Agile 1 Process Development 1 Strategic Financial... 1 Resource Management 0 Capital Equipment 0 Mobile Devices 0 Enterprise Software See 14+     See less                     9 Leadership 8 Management 7 Integration 6 Strategy 6 Business Analysis 5 Software Development 5 Requirements Analysis 4 Testing 4 Software Project... 3 Waterfall 3 CMMI 3 Capital Budgeting 3 ITIL 3 PMP 3 Vendor Management 3 Project Portfolio... 3 Business Process... 3 IT Management 2 Business Planning 2 IT Service Management 2 Project Delivery 2 Business Process 1 Agile 1 Process Development 1 Strategic Financial... 1 Resource Management 0 Capital Equipment 0 Mobile Devices 0 Enterprise Software Education Fontbonne University University of Phoenix Bachelors Fontbonne University Fontbonne University Fontbonne University University of Phoenix Bachelors University of Phoenix Bachelors University of Phoenix Bachelors Honors & Awards We Are Intel Recognition Alice Cruce February 2015 Outstanding contribution to the Future of Samples Business Process Excellence Six Sigma Kaizen event. As are result of your hard work and dedication we have created a more efficient and flexible process foundation upon which the Future of Samples solution will be built.  Intel Department Award Kerry Spurgin February 2015 Development and Deployment of Global labs ISMP processes and Tool for Asset Management. We are Intel Recognition Alice Cruce July 2014 Thank you for your outstanding results orientation and leadership in realizing the opportunity to align the Internal Demand Mgmt and Future of Samples Programs, driving cross program requirements fit gap deliverables and finally the program structure, roadmap and funding alignment. As a result of your work we now have aligned two separate sampling communities and tool sets into a single enterprise samples program.  We are Intel Recognition Tom Helbling March 2013 Thank you for your effort is helping to deliver to our first Finance Update in our new centralized prototype management process. It took a lot of teamwork and heavy lifting I am appreciate the effort! We are Intel Recognition Charles Goldman June 2015 Thank you for your strategy to align the ISMP team with the IT Security. Your network of connections along with your possibility thinking looks like it will lead to a much simpler process for all HVPIP and other missing assets to be escalated to the appropriate research team. Additional Honors & Awards IT Division Recognition Award Q2 2009 - IT Current State Assessment - Results orientation and leadership in delivering 2009 CSA \nIT Division Recognition Award Q4 2008 - Excelebrate 2008 - Making IT OPS a great place to work!  \nIT Division Recognition Award Q2 2008 - Thanks for hitting the 95% adoption goal for TeamBuilder.  \nIT Excellence Award 2007 - For driving an outstanding transformation of IT project delivery We Are Intel Recognition Alice Cruce February 2015 Outstanding contribution to the Future of Samples Business Process Excellence Six Sigma Kaizen event. As are result of your hard work and dedication we have created a more efficient and flexible process foundation upon which the Future of Samples solution will be built.  We Are Intel Recognition Alice Cruce February 2015 Outstanding contribution to the Future of Samples Business Process Excellence Six Sigma Kaizen event. As are result of your hard work and dedication we have created a more efficient and flexible process foundation upon which the Future of Samples solution will be built.  We Are Intel Recognition Alice Cruce February 2015 Outstanding contribution to the Future of Samples Business Process Excellence Six Sigma Kaizen event. As are result of your hard work and dedication we have created a more efficient and flexible process foundation upon which the Future of Samples solution will be built.  Intel Department Award Kerry Spurgin February 2015 Development and Deployment of Global labs ISMP processes and Tool for Asset Management. Intel Department Award Kerry Spurgin February 2015 Development and Deployment of Global labs ISMP processes and Tool for Asset Management. Intel Department Award Kerry Spurgin February 2015 Development and Deployment of Global labs ISMP processes and Tool for Asset Management. We are Intel Recognition Alice Cruce July 2014 Thank you for your outstanding results orientation and leadership in realizing the opportunity to align the Internal Demand Mgmt and Future of Samples Programs, driving cross program requirements fit gap deliverables and finally the program structure, roadmap and funding alignment. As a result of your work we now have aligned two separate sampling communities and tool sets into a single enterprise samples program.  We are Intel Recognition Alice Cruce July 2014 Thank you for your outstanding results orientation and leadership in realizing the opportunity to align the Internal Demand Mgmt and Future of Samples Programs, driving cross program requirements fit gap deliverables and finally the program structure, roadmap and funding alignment. As a result of your work we now have aligned two separate sampling communities and tool sets into a single enterprise samples program.  We are Intel Recognition Alice Cruce July 2014 Thank you for your outstanding results orientation and leadership in realizing the opportunity to align the Internal Demand Mgmt and Future of Samples Programs, driving cross program requirements fit gap deliverables and finally the program structure, roadmap and funding alignment. As a result of your work we now have aligned two separate sampling communities and tool sets into a single enterprise samples program.  We are Intel Recognition Tom Helbling March 2013 Thank you for your effort is helping to deliver to our first Finance Update in our new centralized prototype management process. It took a lot of teamwork and heavy lifting I am appreciate the effort! We are Intel Recognition Tom Helbling March 2013 Thank you for your effort is helping to deliver to our first Finance Update in our new centralized prototype management process. It took a lot of teamwork and heavy lifting I am appreciate the effort! We are Intel Recognition Tom Helbling March 2013 Thank you for your effort is helping to deliver to our first Finance Update in our new centralized prototype management process. It took a lot of teamwork and heavy lifting I am appreciate the effort! We are Intel Recognition Charles Goldman June 2015 Thank you for your strategy to align the ISMP team with the IT Security. Your network of connections along with your possibility thinking looks like it will lead to a much simpler process for all HVPIP and other missing assets to be escalated to the appropriate research team. We are Intel Recognition Charles Goldman June 2015 Thank you for your strategy to align the ISMP team with the IT Security. Your network of connections along with your possibility thinking looks like it will lead to a much simpler process for all HVPIP and other missing assets to be escalated to the appropriate research team. We are Intel Recognition Charles Goldman June 2015 Thank you for your strategy to align the ISMP team with the IT Security. Your network of connections along with your possibility thinking looks like it will lead to a much simpler process for all HVPIP and other missing assets to be escalated to the appropriate research team. Additional Honors & Awards IT Division Recognition Award Q2 2009 - IT Current State Assessment - Results orientation and leadership in delivering 2009 CSA \nIT Division Recognition Award Q4 2008 - Excelebrate 2008 - Making IT OPS a great place to work!  \nIT Division Recognition Award Q2 2008 - Thanks for hitting the 95% adoption goal for TeamBuilder.  \nIT Excellence Award 2007 - For driving an outstanding transformation of IT project delivery Additional Honors & Awards IT Division Recognition Award Q2 2009 - IT Current State Assessment - Results orientation and leadership in delivering 2009 CSA \nIT Division Recognition Award Q4 2008 - Excelebrate 2008 - Making IT OPS a great place to work!  \nIT Division Recognition Award Q2 2008 - Thanks for hitting the 95% adoption goal for TeamBuilder.  \nIT Excellence Award 2007 - For driving an outstanding transformation of IT project delivery Additional Honors & Awards IT Division Recognition Award Q2 2009 - IT Current State Assessment - Results orientation and leadership in delivering 2009 CSA \nIT Division Recognition Award Q4 2008 - Excelebrate 2008 - Making IT OPS a great place to work!  \nIT Division Recognition Award Q2 2008 - Thanks for hitting the 95% adoption goal for TeamBuilder.  \nIT Excellence Award 2007 - For driving an outstanding transformation of IT project delivery ", "Summary Problem solving, systems thinking, program management. Summary Problem solving, systems thinking, program management. Problem solving, systems thinking, program management. Problem solving, systems thinking, program management. Experience Owner Self Emoloyed 2013  – Present (2 years) Hillsboro, OR •\tSmall Business Consultant – Assisting small businesses with problem solving, setting up tracking and reporting for customers, revenue and expenses, optimizing the business side of the work so that the individual owner-operator can spend more time doing what they get paid for. \n•\tOwner/Farmer WoodStone Farm, Hillsboro, OR - Converting the farm from a residential rental back into a small footprint working farm that will market products to the community through local sales of eggs, fruits, vegetables and hay as well as finished goods made from our produce. \n Program Manager EMO 2003  –  2013  (10 years) Portland, Oregon Managed a home sharing program serving the Portland metro area. Responsible for all areas of program and project management including development and generation of indicators, financials, program direction, funding, personnel (both FTE and volunteer). Operations Manager Intel 2000  –  2002  (2 years) Quality Programs Manager Intel Corporation 1999  –  2001  (2 years) Operations Program Manager Intel Corporation 1994  –  1997  (3 years) Customs/Export Licensing Specialist Intel Corporation 1990  –  1994  (4 years) Document Control Administrator Intel Corporation 1988  –  1990  (2 years) Owner Self Emoloyed 2013  – Present (2 years) Hillsboro, OR •\tSmall Business Consultant – Assisting small businesses with problem solving, setting up tracking and reporting for customers, revenue and expenses, optimizing the business side of the work so that the individual owner-operator can spend more time doing what they get paid for. \n•\tOwner/Farmer WoodStone Farm, Hillsboro, OR - Converting the farm from a residential rental back into a small footprint working farm that will market products to the community through local sales of eggs, fruits, vegetables and hay as well as finished goods made from our produce. \n Owner Self Emoloyed 2013  – Present (2 years) Hillsboro, OR •\tSmall Business Consultant – Assisting small businesses with problem solving, setting up tracking and reporting for customers, revenue and expenses, optimizing the business side of the work so that the individual owner-operator can spend more time doing what they get paid for. \n•\tOwner/Farmer WoodStone Farm, Hillsboro, OR - Converting the farm from a residential rental back into a small footprint working farm that will market products to the community through local sales of eggs, fruits, vegetables and hay as well as finished goods made from our produce. \n Program Manager EMO 2003  –  2013  (10 years) Portland, Oregon Managed a home sharing program serving the Portland metro area. Responsible for all areas of program and project management including development and generation of indicators, financials, program direction, funding, personnel (both FTE and volunteer). Program Manager EMO 2003  –  2013  (10 years) Portland, Oregon Managed a home sharing program serving the Portland metro area. Responsible for all areas of program and project management including development and generation of indicators, financials, program direction, funding, personnel (both FTE and volunteer). Operations Manager Intel 2000  –  2002  (2 years) Operations Manager Intel 2000  –  2002  (2 years) Quality Programs Manager Intel Corporation 1999  –  2001  (2 years) Quality Programs Manager Intel Corporation 1999  –  2001  (2 years) Operations Program Manager Intel Corporation 1994  –  1997  (3 years) Operations Program Manager Intel Corporation 1994  –  1997  (3 years) Customs/Export Licensing Specialist Intel Corporation 1990  –  1994  (4 years) Customs/Export Licensing Specialist Intel Corporation 1990  –  1994  (4 years) Document Control Administrator Intel Corporation 1988  –  1990  (2 years) Document Control Administrator Intel Corporation 1988  –  1990  (2 years) Languages French Limited working proficiency Swedish Professional working proficiency French Limited working proficiency Swedish Professional working proficiency French Limited working proficiency Swedish Professional working proficiency Limited working proficiency Professional working proficiency Skills Top Skills 14 Program Management 8 Strategic Planning 8 Community Outreach 7 Project Management 6 Grant Writing 6 Cross-functional Team... 5 Nonprofits 4 Public Speaking 4 Program Development 3 Systems Thinking Barbara also knows about... 3 Fundraising 3 Process Improvement 3 Leadership 3 Project Planning 2 Teaching 2 Editing 2 Organizational... 1 Facilitation 1 Leadership Development 1 Training 1 Change Management 0 Problem Solving 0 facilitation 0 adult instruction 0 Management Skills  Top Skills 14 Program Management 8 Strategic Planning 8 Community Outreach 7 Project Management 6 Grant Writing 6 Cross-functional Team... 5 Nonprofits 4 Public Speaking 4 Program Development 3 Systems Thinking Barbara also knows about... 3 Fundraising 3 Process Improvement 3 Leadership 3 Project Planning 2 Teaching 2 Editing 2 Organizational... 1 Facilitation 1 Leadership Development 1 Training 1 Change Management 0 Problem Solving 0 facilitation 0 adult instruction 0 Management Top Skills 14 Program Management 8 Strategic Planning 8 Community Outreach 7 Project Management 6 Grant Writing 6 Cross-functional Team... 5 Nonprofits 4 Public Speaking 4 Program Development 3 Systems Thinking Barbara also knows about... 3 Fundraising 3 Process Improvement 3 Leadership 3 Project Planning 2 Teaching 2 Editing 2 Organizational... 1 Facilitation 1 Leadership Development 1 Training 1 Change Management 0 Problem Solving 0 facilitation 0 adult instruction 0 Management Top Skills 14 Program Management 8 Strategic Planning 8 Community Outreach 7 Project Management 6 Grant Writing 6 Cross-functional Team... 5 Nonprofits 4 Public Speaking 4 Program Development 3 Systems Thinking Barbara also knows about... 3 Fundraising 3 Process Improvement 3 Leadership 3 Project Planning 2 Teaching 2 Editing 2 Organizational... 1 Facilitation 1 Leadership Development 1 Training 1 Change Management 0 Problem Solving 0 facilitation 0 adult instruction 0 Management                     3 Fundraising 3 Process Improvement 3 Leadership 3 Project Planning 2 Teaching 2 Editing 2 Organizational... 1 Facilitation 1 Leadership Development 1 Training 1 Change Management 0 Problem Solving 0 facilitation 0 adult instruction 0 Management Education Mount Holyoke College BA Mount Holyoke College BA Mount Holyoke College BA Mount Holyoke College BA ", "Experience Assembly Operations Program Manager Intel Corporation Assembly Operations Program Manager Intel Corporation Assembly Operations Program Manager Intel Corporation Skills Skills     Education North Carolina State University 1985  – 1989 North Carolina State University 1985  – 1989 North Carolina State University 1985  – 1989 North Carolina State University 1985  – 1989 ", "Summary Over 15 years of program management, analysis and business acumen skills driving process improvement, business operations, and compliance within technology-focused companies. Self-motivated, results oriented professional with excellent problem solving skills and attention to detail. Established reputation for contract development and management, business and process modelling, data analysis, process improvement and global privacy, tax and legal requirements.  \n \nSpecialties: Process Improvement; Business Modeling; Data Analysis; Services Contract Development and Management; Privacy; Business Operations. Summary Over 15 years of program management, analysis and business acumen skills driving process improvement, business operations, and compliance within technology-focused companies. Self-motivated, results oriented professional with excellent problem solving skills and attention to detail. Established reputation for contract development and management, business and process modelling, data analysis, process improvement and global privacy, tax and legal requirements.  \n \nSpecialties: Process Improvement; Business Modeling; Data Analysis; Services Contract Development and Management; Privacy; Business Operations. Over 15 years of program management, analysis and business acumen skills driving process improvement, business operations, and compliance within technology-focused companies. Self-motivated, results oriented professional with excellent problem solving skills and attention to detail. Established reputation for contract development and management, business and process modelling, data analysis, process improvement and global privacy, tax and legal requirements.  \n \nSpecialties: Process Improvement; Business Modeling; Data Analysis; Services Contract Development and Management; Privacy; Business Operations. Over 15 years of program management, analysis and business acumen skills driving process improvement, business operations, and compliance within technology-focused companies. Self-motivated, results oriented professional with excellent problem solving skills and attention to detail. Established reputation for contract development and management, business and process modelling, data analysis, process improvement and global privacy, tax and legal requirements.  \n \nSpecialties: Process Improvement; Business Modeling; Data Analysis; Services Contract Development and Management; Privacy; Business Operations. Experience AppUp EOL Operations Lead/Product Manager Intel Corporation September 2013  – Present (2 years) Folsom, CA Responsible for all operational and compliance aspects of the EOL of the AppUp app stores. Drove the user experience design/requirements for the store client. Managed the contract termination process. \n \n•\tCreated an EOL user experience that convinced OEM’s they were not exposed to support costs or PR risk that supported the negotiation of $70M compensation requests down to zero.  \n•\tIdentified and drove the contract termination actions required to avoid $3M in bounty payments. \n•\tTargeted communications via emails and store client, FAQ, staged removal apps and consumer refund program kept end user contacts minimal with zero escalations from OEM’s. Software Store Operations/Launch Manager Intel Corporation August 2006  –  September 2013  (7 years 2 months) Folsom, CA Responsible for compliance with Intel policies and legislation such as COPPA, ADA and FTC/EU mobile privacy laws applicable to software stores and distribution. Managed geo Intel Business Exchange country launches with local teams and AppUp customer store launches with OEM’s and retailers. Operations lead responsible for process improvement, systems development and distributor on-boarding. \n \n• Developed and managed the “greenlight process” that reduced the average AppUp OEM store implementation timelines from 16 to 4 weeks and reduced engineering rework.  \n• Drove launch of PC software to AppUp and reduced distributor data errors from 13% to 1%. Developed system requirements and new business processes to support the different content import, validation, pricing and financial models and added 5K titles using existing headcount. \n• Developed user stories and process flows with product management, usability team and the operational teams to integrate these into process and system design creating a smooth approval process with Intel Legal, Privacy and Global Tax and Trade. \n• Defined and documented the financial models, key policies and contractual framework required to support the Digital Store Services. This allowed us to present the complete picture to OEM’s, anticipate their questions, agree key terms and accelerate negotiations. \n• Drove the decision and processes to follow a geo specific technical/platform path that improved flexibility and time to market for Intel Business Exchange. Led geo teams through vendor selection, launches and establishing merchandising and operations processes. \n• Created customer centric materials and led detailed discussions with OEM and retailer employees responsible for store administration, merchandising and financial processes. Distribution Operations/Program Manager Intel Corporation November 2004  –  August 2006  (1 year 10 months) Folsom, CA Program managed and implemented marketing and ecommerce programs in the distribution channel. Developed concepts and design and program managed the worldwide teams from Intel, manufacturers and distributors. Developed operational processes with local teams to ensure successful implementation.  \n \n• Received an Intel IT Excellence Award for the successful launch of Channel Marketplace, an e-commerce program to enable small integrators to transition to new PC platforms by offering complete kits of Intel and 3rd party components and boards. \n• Developed a PC platform level forecasting process that reduced distributor stock outs. Compliance Manager Intel Corporation October 2000  –  August 2004  (3 years 11 months) Folsom, CA Established and managed the Open Market Controls program. Built a network of Geo and worldwide sales, finance and security contacts to collect data, identify issues and corrective actions and established regular senior management reviews to monitor grey market severity, discuss issues, and drive actions.  \n \n• Increased Intel profits by over $13 million while increasing distributor margins \n• Quantified the size of the global CPU grey market for the first time and identified sources of aberrant flows and pricing. This gave senior management the data they needed to take action. Business Operations Manager Intel Corporation April 1999  –  October 2000  (1 year 7 months) Folsom, CA Managed demand forecast and planning process for boxed processors sold through the channel and the teams responsible for product returns and processing distributor sales data.  \n• Successfully launched new distributor sales reporting tools to provided weekly consolidated data to sales management  \n• Improved efficiency by consolidating returns and warranty repair teams Finance Analyst/Manager Intel Corporation September 1994  –  April 1999  (4 years 8 months) Swindon, United Kingdom & Hillsboro, OR Revenue forecasting and pricing analysis providing local and HQ management visibility to performance vs. sales plans. Implemented program analysis and management reviews to assess quarterly marketing programs and allocate future budgets based on the results. Achieved “Top 3 Finance Cash Savings” worldwide recognition and built a collaborative process where finance was seen as a more valuable player by the marketing team. Auditor KPMG UK & Canada August 1988  –  September 1994  (6 years 2 months) Swindon & London, UK and Toronto, Canada Planned and managed external audits and regulatory controls reviews at a wide range of manufacturing, electronics, banking and securities companies. One of only three people selected from hundreds of applicants for a professional development rotation to the Toronto office. AppUp EOL Operations Lead/Product Manager Intel Corporation September 2013  – Present (2 years) Folsom, CA Responsible for all operational and compliance aspects of the EOL of the AppUp app stores. Drove the user experience design/requirements for the store client. Managed the contract termination process. \n \n•\tCreated an EOL user experience that convinced OEM’s they were not exposed to support costs or PR risk that supported the negotiation of $70M compensation requests down to zero.  \n•\tIdentified and drove the contract termination actions required to avoid $3M in bounty payments. \n•\tTargeted communications via emails and store client, FAQ, staged removal apps and consumer refund program kept end user contacts minimal with zero escalations from OEM’s. AppUp EOL Operations Lead/Product Manager Intel Corporation September 2013  – Present (2 years) Folsom, CA Responsible for all operational and compliance aspects of the EOL of the AppUp app stores. Drove the user experience design/requirements for the store client. Managed the contract termination process. \n \n•\tCreated an EOL user experience that convinced OEM’s they were not exposed to support costs or PR risk that supported the negotiation of $70M compensation requests down to zero.  \n•\tIdentified and drove the contract termination actions required to avoid $3M in bounty payments. \n•\tTargeted communications via emails and store client, FAQ, staged removal apps and consumer refund program kept end user contacts minimal with zero escalations from OEM’s. Software Store Operations/Launch Manager Intel Corporation August 2006  –  September 2013  (7 years 2 months) Folsom, CA Responsible for compliance with Intel policies and legislation such as COPPA, ADA and FTC/EU mobile privacy laws applicable to software stores and distribution. Managed geo Intel Business Exchange country launches with local teams and AppUp customer store launches with OEM’s and retailers. Operations lead responsible for process improvement, systems development and distributor on-boarding. \n \n• Developed and managed the “greenlight process” that reduced the average AppUp OEM store implementation timelines from 16 to 4 weeks and reduced engineering rework.  \n• Drove launch of PC software to AppUp and reduced distributor data errors from 13% to 1%. Developed system requirements and new business processes to support the different content import, validation, pricing and financial models and added 5K titles using existing headcount. \n• Developed user stories and process flows with product management, usability team and the operational teams to integrate these into process and system design creating a smooth approval process with Intel Legal, Privacy and Global Tax and Trade. \n• Defined and documented the financial models, key policies and contractual framework required to support the Digital Store Services. This allowed us to present the complete picture to OEM’s, anticipate their questions, agree key terms and accelerate negotiations. \n• Drove the decision and processes to follow a geo specific technical/platform path that improved flexibility and time to market for Intel Business Exchange. Led geo teams through vendor selection, launches and establishing merchandising and operations processes. \n• Created customer centric materials and led detailed discussions with OEM and retailer employees responsible for store administration, merchandising and financial processes. Software Store Operations/Launch Manager Intel Corporation August 2006  –  September 2013  (7 years 2 months) Folsom, CA Responsible for compliance with Intel policies and legislation such as COPPA, ADA and FTC/EU mobile privacy laws applicable to software stores and distribution. Managed geo Intel Business Exchange country launches with local teams and AppUp customer store launches with OEM’s and retailers. Operations lead responsible for process improvement, systems development and distributor on-boarding. \n \n• Developed and managed the “greenlight process” that reduced the average AppUp OEM store implementation timelines from 16 to 4 weeks and reduced engineering rework.  \n• Drove launch of PC software to AppUp and reduced distributor data errors from 13% to 1%. Developed system requirements and new business processes to support the different content import, validation, pricing and financial models and added 5K titles using existing headcount. \n• Developed user stories and process flows with product management, usability team and the operational teams to integrate these into process and system design creating a smooth approval process with Intel Legal, Privacy and Global Tax and Trade. \n• Defined and documented the financial models, key policies and contractual framework required to support the Digital Store Services. This allowed us to present the complete picture to OEM’s, anticipate their questions, agree key terms and accelerate negotiations. \n• Drove the decision and processes to follow a geo specific technical/platform path that improved flexibility and time to market for Intel Business Exchange. Led geo teams through vendor selection, launches and establishing merchandising and operations processes. \n• Created customer centric materials and led detailed discussions with OEM and retailer employees responsible for store administration, merchandising and financial processes. Distribution Operations/Program Manager Intel Corporation November 2004  –  August 2006  (1 year 10 months) Folsom, CA Program managed and implemented marketing and ecommerce programs in the distribution channel. Developed concepts and design and program managed the worldwide teams from Intel, manufacturers and distributors. Developed operational processes with local teams to ensure successful implementation.  \n \n• Received an Intel IT Excellence Award for the successful launch of Channel Marketplace, an e-commerce program to enable small integrators to transition to new PC platforms by offering complete kits of Intel and 3rd party components and boards. \n• Developed a PC platform level forecasting process that reduced distributor stock outs. Distribution Operations/Program Manager Intel Corporation November 2004  –  August 2006  (1 year 10 months) Folsom, CA Program managed and implemented marketing and ecommerce programs in the distribution channel. Developed concepts and design and program managed the worldwide teams from Intel, manufacturers and distributors. Developed operational processes with local teams to ensure successful implementation.  \n \n• Received an Intel IT Excellence Award for the successful launch of Channel Marketplace, an e-commerce program to enable small integrators to transition to new PC platforms by offering complete kits of Intel and 3rd party components and boards. \n• Developed a PC platform level forecasting process that reduced distributor stock outs. Compliance Manager Intel Corporation October 2000  –  August 2004  (3 years 11 months) Folsom, CA Established and managed the Open Market Controls program. Built a network of Geo and worldwide sales, finance and security contacts to collect data, identify issues and corrective actions and established regular senior management reviews to monitor grey market severity, discuss issues, and drive actions.  \n \n• Increased Intel profits by over $13 million while increasing distributor margins \n• Quantified the size of the global CPU grey market for the first time and identified sources of aberrant flows and pricing. This gave senior management the data they needed to take action. Compliance Manager Intel Corporation October 2000  –  August 2004  (3 years 11 months) Folsom, CA Established and managed the Open Market Controls program. Built a network of Geo and worldwide sales, finance and security contacts to collect data, identify issues and corrective actions and established regular senior management reviews to monitor grey market severity, discuss issues, and drive actions.  \n \n• Increased Intel profits by over $13 million while increasing distributor margins \n• Quantified the size of the global CPU grey market for the first time and identified sources of aberrant flows and pricing. This gave senior management the data they needed to take action. Business Operations Manager Intel Corporation April 1999  –  October 2000  (1 year 7 months) Folsom, CA Managed demand forecast and planning process for boxed processors sold through the channel and the teams responsible for product returns and processing distributor sales data.  \n• Successfully launched new distributor sales reporting tools to provided weekly consolidated data to sales management  \n• Improved efficiency by consolidating returns and warranty repair teams Business Operations Manager Intel Corporation April 1999  –  October 2000  (1 year 7 months) Folsom, CA Managed demand forecast and planning process for boxed processors sold through the channel and the teams responsible for product returns and processing distributor sales data.  \n• Successfully launched new distributor sales reporting tools to provided weekly consolidated data to sales management  \n• Improved efficiency by consolidating returns and warranty repair teams Finance Analyst/Manager Intel Corporation September 1994  –  April 1999  (4 years 8 months) Swindon, United Kingdom & Hillsboro, OR Revenue forecasting and pricing analysis providing local and HQ management visibility to performance vs. sales plans. Implemented program analysis and management reviews to assess quarterly marketing programs and allocate future budgets based on the results. Achieved “Top 3 Finance Cash Savings” worldwide recognition and built a collaborative process where finance was seen as a more valuable player by the marketing team. Finance Analyst/Manager Intel Corporation September 1994  –  April 1999  (4 years 8 months) Swindon, United Kingdom & Hillsboro, OR Revenue forecasting and pricing analysis providing local and HQ management visibility to performance vs. sales plans. Implemented program analysis and management reviews to assess quarterly marketing programs and allocate future budgets based on the results. Achieved “Top 3 Finance Cash Savings” worldwide recognition and built a collaborative process where finance was seen as a more valuable player by the marketing team. Auditor KPMG UK & Canada August 1988  –  September 1994  (6 years 2 months) Swindon & London, UK and Toronto, Canada Planned and managed external audits and regulatory controls reviews at a wide range of manufacturing, electronics, banking and securities companies. One of only three people selected from hundreds of applicants for a professional development rotation to the Toronto office. Auditor KPMG UK & Canada August 1988  –  September 1994  (6 years 2 months) Swindon & London, UK and Toronto, Canada Planned and managed external audits and regulatory controls reviews at a wide range of manufacturing, electronics, banking and securities companies. One of only three people selected from hundreds of applicants for a professional development rotation to the Toronto office. Skills Top Skills 5 Product Management 4 Go-to-market Strategy 4 Program Management 3 Product Marketing 3 Multi-channel Marketing 2 Competitive Analysis 2 E-commerce 2 Strategic Partnerships 2 Marketing Management 2 Product Launch Lisa also knows about... 1 B2B Marketing 1 Demand Generation 1 Segmentation 1 Integrated Marketing Skills  Top Skills 5 Product Management 4 Go-to-market Strategy 4 Program Management 3 Product Marketing 3 Multi-channel Marketing 2 Competitive Analysis 2 E-commerce 2 Strategic Partnerships 2 Marketing Management 2 Product Launch Lisa also knows about... 1 B2B Marketing 1 Demand Generation 1 Segmentation 1 Integrated Marketing Top Skills 5 Product Management 4 Go-to-market Strategy 4 Program Management 3 Product Marketing 3 Multi-channel Marketing 2 Competitive Analysis 2 E-commerce 2 Strategic Partnerships 2 Marketing Management 2 Product Launch Lisa also knows about... 1 B2B Marketing 1 Demand Generation 1 Segmentation 1 Integrated Marketing Top Skills 5 Product Management 4 Go-to-market Strategy 4 Program Management 3 Product Marketing 3 Multi-channel Marketing 2 Competitive Analysis 2 E-commerce 2 Strategic Partnerships 2 Marketing Management 2 Product Launch Lisa also knows about... 1 B2B Marketing 1 Demand Generation 1 Segmentation 1 Integrated Marketing                     1 B2B Marketing 1 Demand Generation 1 Segmentation 1 Integrated Marketing Education Imperial College London Bachelor of Science (BSc),  Physics 1985  – 1988 Imperial College London Bachelor of Science (BSc),  Physics 1985  – 1988 Imperial College London Bachelor of Science (BSc),  Physics 1985  – 1988 Imperial College London Bachelor of Science (BSc),  Physics 1985  – 1988 ", "Summary Specialties:Account management, customer presentations, marketing, program management, operations. Summary Specialties:Account management, customer presentations, marketing, program management, operations. Specialties:Account management, customer presentations, marketing, program management, operations. Specialties:Account management, customer presentations, marketing, program management, operations. Experience Operations Program Manager Intel Corporation September 2010  – Present (5 years) Ops Program Manager support product development, launch and manufacturing ramp of new products. Lead a Board Mfg Ops to manage aggregate execution activities to deliver high quality, low cost, on schedule development that achieves product life cycle & launch milestones. Plans/manages technical programs or projects to meet specific objectives or goals. Provides leadership for the project team and key interfaces to the project or program. Identify tasks, determine dependencies, identify and assign specific resources, communicate expectations to team members, and create/track the project schedule. Work with materials and ODM teams on program requirements and negotiation strategy. Requires thorough knowledge of business practices and procedures in order to perform non repetitive, analytical work. Materials Program Manager Intel Corporation April 2008  –  August 2010  (2 years 5 months) Working in the Mobility Group (Open) 1 recommendation Dharmesh Jani Vice President, Cloud Strategy and Operations Hemal is very goal oriented in his approach to problem solving. He has always worked to achieved team objectives in most collaborative and constructive manner by coming up with innovative solutions. He knowledge and dedication makes working with him... View Operations Program Manager Intel Corporation May 2005  –  March 2008  (2 years 11 months) New Product Introduction into High Volume facilities in Asia. Responsible for all aspects of the operation; including but not limited to, materials, capacity, training, product cost, product ramp, order fulfillment. (Open) 1 recommendation Rey Garza Sales Strategist at SPS - Stationary Power Systems Hemal is very knowlagable in all aspects of manufacturing. View Sales & Marketing Adaptive Contract Manufacturing April 2002  –  April 2005  (3 years 1 month) Outside sales position chartered with increasing customer base and penetrating current customers. (Open) 1 recommendation James Beldock Chief Operating Officer at Tachyus Hemal is a class act, with excellent attention to detail and a real sense for how to manage a customer schedule. Hemal understands what matters to his customers, and he made it his business to meet our requirements at every turn. View Project Manager Saudi Cable Company/Almaz Corporation/Aeromovel USA 2001  –  2002  (1 year) Operations Program Manager Intel Corporation September 2010  – Present (5 years) Ops Program Manager support product development, launch and manufacturing ramp of new products. Lead a Board Mfg Ops to manage aggregate execution activities to deliver high quality, low cost, on schedule development that achieves product life cycle & launch milestones. Plans/manages technical programs or projects to meet specific objectives or goals. Provides leadership for the project team and key interfaces to the project or program. Identify tasks, determine dependencies, identify and assign specific resources, communicate expectations to team members, and create/track the project schedule. Work with materials and ODM teams on program requirements and negotiation strategy. Requires thorough knowledge of business practices and procedures in order to perform non repetitive, analytical work. Operations Program Manager Intel Corporation September 2010  – Present (5 years) Ops Program Manager support product development, launch and manufacturing ramp of new products. Lead a Board Mfg Ops to manage aggregate execution activities to deliver high quality, low cost, on schedule development that achieves product life cycle & launch milestones. Plans/manages technical programs or projects to meet specific objectives or goals. Provides leadership for the project team and key interfaces to the project or program. Identify tasks, determine dependencies, identify and assign specific resources, communicate expectations to team members, and create/track the project schedule. Work with materials and ODM teams on program requirements and negotiation strategy. Requires thorough knowledge of business practices and procedures in order to perform non repetitive, analytical work. Materials Program Manager Intel Corporation April 2008  –  August 2010  (2 years 5 months) Working in the Mobility Group (Open) 1 recommendation Dharmesh Jani Vice President, Cloud Strategy and Operations Hemal is very goal oriented in his approach to problem solving. He has always worked to achieved team objectives in most collaborative and constructive manner by coming up with innovative solutions. He knowledge and dedication makes working with him... View Materials Program Manager Intel Corporation April 2008  –  August 2010  (2 years 5 months) Working in the Mobility Group (Open) 1 recommendation Dharmesh Jani Vice President, Cloud Strategy and Operations Hemal is very goal oriented in his approach to problem solving. He has always worked to achieved team objectives in most collaborative and constructive manner by coming up with innovative solutions. He knowledge and dedication makes working with him... View Operations Program Manager Intel Corporation May 2005  –  March 2008  (2 years 11 months) New Product Introduction into High Volume facilities in Asia. Responsible for all aspects of the operation; including but not limited to, materials, capacity, training, product cost, product ramp, order fulfillment. (Open) 1 recommendation Rey Garza Sales Strategist at SPS - Stationary Power Systems Hemal is very knowlagable in all aspects of manufacturing. View Operations Program Manager Intel Corporation May 2005  –  March 2008  (2 years 11 months) New Product Introduction into High Volume facilities in Asia. Responsible for all aspects of the operation; including but not limited to, materials, capacity, training, product cost, product ramp, order fulfillment. (Open) 1 recommendation Rey Garza Sales Strategist at SPS - Stationary Power Systems Hemal is very knowlagable in all aspects of manufacturing. View Sales & Marketing Adaptive Contract Manufacturing April 2002  –  April 2005  (3 years 1 month) Outside sales position chartered with increasing customer base and penetrating current customers. (Open) 1 recommendation James Beldock Chief Operating Officer at Tachyus Hemal is a class act, with excellent attention to detail and a real sense for how to manage a customer schedule. Hemal understands what matters to his customers, and he made it his business to meet our requirements at every turn. View Sales & Marketing Adaptive Contract Manufacturing April 2002  –  April 2005  (3 years 1 month) Outside sales position chartered with increasing customer base and penetrating current customers. (Open) 1 recommendation James Beldock Chief Operating Officer at Tachyus Hemal is a class act, with excellent attention to detail and a real sense for how to manage a customer schedule. Hemal understands what matters to his customers, and he made it his business to meet our requirements at every turn. View Project Manager Saudi Cable Company/Almaz Corporation/Aeromovel USA 2001  –  2002  (1 year) Project Manager Saudi Cable Company/Almaz Corporation/Aeromovel USA 2001  –  2002  (1 year) Languages Gujarati,  Gujarati,  Gujarati,  Skills Top Skills 19 Manufacturing 17 Product Development 15 Program Management 11 Supply Chain Management 10 Management 6 Supply Management 5 Operations Management 5 Leadership 5 Cross-functional Team... 3 Account Management Hemal also knows about... 3 Business Process... 2 Negotiation 2 Project Planning 1 Supplier Management 1 Strategic Planning Skills  Top Skills 19 Manufacturing 17 Product Development 15 Program Management 11 Supply Chain Management 10 Management 6 Supply Management 5 Operations Management 5 Leadership 5 Cross-functional Team... 3 Account Management Hemal also knows about... 3 Business Process... 2 Negotiation 2 Project Planning 1 Supplier Management 1 Strategic Planning Top Skills 19 Manufacturing 17 Product Development 15 Program Management 11 Supply Chain Management 10 Management 6 Supply Management 5 Operations Management 5 Leadership 5 Cross-functional Team... 3 Account Management Hemal also knows about... 3 Business Process... 2 Negotiation 2 Project Planning 1 Supplier Management 1 Strategic Planning Top Skills 19 Manufacturing 17 Product Development 15 Program Management 11 Supply Chain Management 10 Management 6 Supply Management 5 Operations Management 5 Leadership 5 Cross-functional Team... 3 Account Management Hemal also knows about... 3 Business Process... 2 Negotiation 2 Project Planning 1 Supplier Management 1 Strategic Planning                     3 Business Process... 2 Negotiation 2 Project Planning 1 Supplier Management 1 Strategic Planning Education Santa Clara University BS,  Mechanical Engineering 1992  – 1997 Mission San Jose 1989  – 1992 Santa Clara University BS,  Mechanical Engineering 1992  – 1997 Santa Clara University BS,  Mechanical Engineering 1992  – 1997 Santa Clara University BS,  Mechanical Engineering 1992  – 1997 Mission San Jose 1989  – 1992 Mission San Jose 1989  – 1992 Mission San Jose 1989  – 1992 ", "Experience Operations Program Manager Intel Corporation August 2014  – Present (1 year 1 month) Technical Training Program Manager Intel Corporation July 2011  –  August 2014  (3 years 2 months) Folsom Responsible for developing & driving technical training strategy for graphics HW/SW engineers. New Hire Integration Program Manager Intel Corporation January 2011  –  July 2011  (7 months) Folsom, CA Responsible for creating and installing an integration program for ~1,000 new employees. Business Analyst Intel Corporation January 2006  –  December 2010  (5 years) Folsom Operations Program Manager Intel Corporation August 2014  – Present (1 year 1 month) Operations Program Manager Intel Corporation August 2014  – Present (1 year 1 month) Technical Training Program Manager Intel Corporation July 2011  –  August 2014  (3 years 2 months) Folsom Responsible for developing & driving technical training strategy for graphics HW/SW engineers. Technical Training Program Manager Intel Corporation July 2011  –  August 2014  (3 years 2 months) Folsom Responsible for developing & driving technical training strategy for graphics HW/SW engineers. New Hire Integration Program Manager Intel Corporation January 2011  –  July 2011  (7 months) Folsom, CA Responsible for creating and installing an integration program for ~1,000 new employees. New Hire Integration Program Manager Intel Corporation January 2011  –  July 2011  (7 months) Folsom, CA Responsible for creating and installing an integration program for ~1,000 new employees. Business Analyst Intel Corporation January 2006  –  December 2010  (5 years) Folsom Business Analyst Intel Corporation January 2006  –  December 2010  (5 years) Folsom Skills Top Skills 11 Program Management 7 Process Improvement 3 Analysis 3 Business Analysis 2 Data Analysis 1 Metrics 0 Problem Solving 0 Excel 0 Process Development 0 Technical Training Kimberly also knows about... 0 PowerPoint 0 Word 0 Customer Relations Skills  Top Skills 11 Program Management 7 Process Improvement 3 Analysis 3 Business Analysis 2 Data Analysis 1 Metrics 0 Problem Solving 0 Excel 0 Process Development 0 Technical Training Kimberly also knows about... 0 PowerPoint 0 Word 0 Customer Relations Top Skills 11 Program Management 7 Process Improvement 3 Analysis 3 Business Analysis 2 Data Analysis 1 Metrics 0 Problem Solving 0 Excel 0 Process Development 0 Technical Training Kimberly also knows about... 0 PowerPoint 0 Word 0 Customer Relations Top Skills 11 Program Management 7 Process Improvement 3 Analysis 3 Business Analysis 2 Data Analysis 1 Metrics 0 Problem Solving 0 Excel 0 Process Development 0 Technical Training Kimberly also knows about... 0 PowerPoint 0 Word 0 Customer Relations                     0 PowerPoint 0 Word 0 Customer Relations Education California State University-Sacramento Masters,  Psychology/Education 2001  – 2005 Activities and Societies:  Chi Sigma Iota Honor Society California State University-Sacramento Bachelors,  Psychology 1996  – 2001 Activities and Societies:  Chi Sigma Iota Honor Society California State University-Sacramento Masters,  Psychology/Education 2001  – 2005 Activities and Societies:  Chi Sigma Iota Honor Society California State University-Sacramento Masters,  Psychology/Education 2001  – 2005 Activities and Societies:  Chi Sigma Iota Honor Society California State University-Sacramento Masters,  Psychology/Education 2001  – 2005 Activities and Societies:  Chi Sigma Iota Honor Society California State University-Sacramento Bachelors,  Psychology 1996  – 2001 Activities and Societies:  Chi Sigma Iota Honor Society California State University-Sacramento Bachelors,  Psychology 1996  – 2001 Activities and Societies:  Chi Sigma Iota Honor Society California State University-Sacramento Bachelors,  Psychology 1996  – 2001 Activities and Societies:  Chi Sigma Iota Honor Society ", "Summary Performance driven Engineering Manager with over 20+ years of experience in SMT, Hybrids, packaging, & semiconductors. Proactive Manager skilled at directing global cross functional teams in all areas of manufacturing, SMT, package, systems, software, & product development. Managing engineering teams to support High Technology and high reliability products for Aerospace, Medical, Military, and Commercial. Products include multi-mode fiber optic devices, custom hybrids, custom QFN, flip chip devices, system boards, RF, & medical devices. Proven track record for achieving stretch goals, successfully completing projects on schedule & within budget has allowed me to build a reputation as an expert in electronic manufacturing. Passion for adapting IoT (Internet of Things) technology into products. \n \nCore competencies: Managing infrastructure & builds of high technology electronics for commercial, industrial, military, medical and aerospace. Effective leader with repeated success launching products with worldwide internal and subcontractor teams. Managing projects through influence. Risk Management & cost reduction. Build manufacturing infrastructure on aggressive schedules. Intimate knowledge of the entire silicon product from the back end of silicon manufacturing process, through placing the product on a board, and building a system around it.  \n \nSecret Clearance • Semiconductors • System on Chip (SoC) • Mixed Signal • Manufacturing • Testing • Program Management • Cross-functional Team Leadership • Statistical Process Control (SPC) • Product Engineering • Failure Analysis • Engineering Management • Project Management • Application-Specific Integrated Circuit (ASIC) • Packaging • Product Development Electronics • Debugging • Integrated Circuit (IC) • Design of Experiment (DOE) • Semiconductor Assembly • Cost Reduction • Processors • Surface-mount technology (SMT) • Materials Planning • Production Management • Quality Assurance • Workflow Optimization • SCRUM • Six Sigma Stephen F. Austin Mural Edit Summary Performance driven Engineering Manager with over 20+ years of experience in SMT, Hybrids, packaging, & semiconductors. Proactive Manager skilled at directing global cross functional teams in all areas of manufacturing, SMT, package, systems, software, & product development. Managing engineering teams to support High Technology and high reliability products for Aerospace, Medical, Military, and Commercial. Products include multi-mode fiber optic devices, custom hybrids, custom QFN, flip chip devices, system boards, RF, & medical devices. Proven track record for achieving stretch goals, successfully completing projects on schedule & within budget has allowed me to build a reputation as an expert in electronic manufacturing. Passion for adapting IoT (Internet of Things) technology into products. \n \nCore competencies: Managing infrastructure & builds of high technology electronics for commercial, industrial, military, medical and aerospace. Effective leader with repeated success launching products with worldwide internal and subcontractor teams. Managing projects through influence. Risk Management & cost reduction. Build manufacturing infrastructure on aggressive schedules. Intimate knowledge of the entire silicon product from the back end of silicon manufacturing process, through placing the product on a board, and building a system around it.  \n \nSecret Clearance • Semiconductors • System on Chip (SoC) • Mixed Signal • Manufacturing • Testing • Program Management • Cross-functional Team Leadership • Statistical Process Control (SPC) • Product Engineering • Failure Analysis • Engineering Management • Project Management • Application-Specific Integrated Circuit (ASIC) • Packaging • Product Development Electronics • Debugging • Integrated Circuit (IC) • Design of Experiment (DOE) • Semiconductor Assembly • Cost Reduction • Processors • Surface-mount technology (SMT) • Materials Planning • Production Management • Quality Assurance • Workflow Optimization • SCRUM • Six Sigma Stephen F. Austin Mural Edit Performance driven Engineering Manager with over 20+ years of experience in SMT, Hybrids, packaging, & semiconductors. Proactive Manager skilled at directing global cross functional teams in all areas of manufacturing, SMT, package, systems, software, & product development. Managing engineering teams to support High Technology and high reliability products for Aerospace, Medical, Military, and Commercial. Products include multi-mode fiber optic devices, custom hybrids, custom QFN, flip chip devices, system boards, RF, & medical devices. Proven track record for achieving stretch goals, successfully completing projects on schedule & within budget has allowed me to build a reputation as an expert in electronic manufacturing. Passion for adapting IoT (Internet of Things) technology into products. \n \nCore competencies: Managing infrastructure & builds of high technology electronics for commercial, industrial, military, medical and aerospace. Effective leader with repeated success launching products with worldwide internal and subcontractor teams. Managing projects through influence. Risk Management & cost reduction. Build manufacturing infrastructure on aggressive schedules. Intimate knowledge of the entire silicon product from the back end of silicon manufacturing process, through placing the product on a board, and building a system around it.  \n \nSecret Clearance • Semiconductors • System on Chip (SoC) • Mixed Signal • Manufacturing • Testing • Program Management • Cross-functional Team Leadership • Statistical Process Control (SPC) • Product Engineering • Failure Analysis • Engineering Management • Project Management • Application-Specific Integrated Circuit (ASIC) • Packaging • Product Development Electronics • Debugging • Integrated Circuit (IC) • Design of Experiment (DOE) • Semiconductor Assembly • Cost Reduction • Processors • Surface-mount technology (SMT) • Materials Planning • Production Management • Quality Assurance • Workflow Optimization • SCRUM • Six Sigma Performance driven Engineering Manager with over 20+ years of experience in SMT, Hybrids, packaging, & semiconductors. Proactive Manager skilled at directing global cross functional teams in all areas of manufacturing, SMT, package, systems, software, & product development. Managing engineering teams to support High Technology and high reliability products for Aerospace, Medical, Military, and Commercial. Products include multi-mode fiber optic devices, custom hybrids, custom QFN, flip chip devices, system boards, RF, & medical devices. Proven track record for achieving stretch goals, successfully completing projects on schedule & within budget has allowed me to build a reputation as an expert in electronic manufacturing. Passion for adapting IoT (Internet of Things) technology into products. \n \nCore competencies: Managing infrastructure & builds of high technology electronics for commercial, industrial, military, medical and aerospace. Effective leader with repeated success launching products with worldwide internal and subcontractor teams. Managing projects through influence. Risk Management & cost reduction. Build manufacturing infrastructure on aggressive schedules. Intimate knowledge of the entire silicon product from the back end of silicon manufacturing process, through placing the product on a board, and building a system around it.  \n \nSecret Clearance • Semiconductors • System on Chip (SoC) • Mixed Signal • Manufacturing • Testing • Program Management • Cross-functional Team Leadership • Statistical Process Control (SPC) • Product Engineering • Failure Analysis • Engineering Management • Project Management • Application-Specific Integrated Circuit (ASIC) • Packaging • Product Development Electronics • Debugging • Integrated Circuit (IC) • Design of Experiment (DOE) • Semiconductor Assembly • Cost Reduction • Processors • Surface-mount technology (SMT) • Materials Planning • Production Management • Quality Assurance • Workflow Optimization • SCRUM • Six Sigma Stephen F. Austin Mural Edit Stephen F. Austin Mural Edit Stephen F. Austin Mural Edit Stephen F. Austin Mural  Stephen F. Austin Mural  Experience Director of Engineering Teledyne Technologies Incorporated December 2014  –  June 2015  (7 months) Lewisville TN Director of Engineering; managing the engineering team in the Electronic Manufacturing Services and Micro division. High value and high reliability product for Aerospace, Medical, Military, and Commercial. Products include multi-mode fiber optic devices, custom hybrids, custom QFN, flip chip devices, system boards, high frequency RF, and medical devices. Mobile Communications Group (MCG) / Devices R&D (DRD) Operations Program Manager Intel Corporation August 2012  –  May 2014  (1 year 10 months) Austin, Texas Area I effectively lead a global, cross functional team in production planning and manufacturing of Intel tablet Form Factor Designs (FFD), utilized to provide performance characteristics of Intel Atom SoC's used by customers and assess the performance of Intel Atom based platforms.  \n \nMy superior communication skills allow me to facilitate effective communication amongst China based manufacturing contractors and team regarding, deliverables, KPIs, and milestones in the schedule. \n \nExceptional ability to identify, analyze, and communicate project risks, successfully implementing mitigation and resolution. \n \nNOTABLE ACHIEVEMENTS: \n \nOversee all aspects of surface-mount technology (SMT) and testing systems for the boards, establishing and enforcing the organizations quality standard. \n \nCompile, initiate, sort, and analyze production performance records and data, recommending and implementing continuous improvement processes. \n \nCoordinate shipping of 10,000 tablets to locations worldwide, developing and executing shipping plan and allocating resources accordingly. \n \nSuccessfully managed the Intel's Bay Trail FFD for Windows, providing effective communication and updates to all levels of the organization through meetings, presentations, and reports. IADa Manufacturing Integrator PM Intel Corporation July 1997  –  August 2012  (15 years 2 months) Hillsboro Oregon and Austin Texas I drove the development and implementation of systems integration activities for the next generation Atom SOC CPU, supporting new product introduction of MCG products.  \n \nSuccessfully developed integration strategies, defining structure and process, identifying and directing resources, establishing timelines, milestones, deliverables, and end of- integration criteria. \n \nImplemented SPC into the day-to-day execution of the integration process, where I directed cross-functional team in delivering business objectives according to timelines.  \n \nNOTABLE ACHIEVEMENTS: \n \nDelivered product sustaining support for Intel's 1st generation 32 nm Atom SoC, providing technical support and efficient solutions to problems occurring during manufacturing  \n \nServed as Manufacturing Program Manager for a number of product releases including, the Platform Components Group Server Tylersburg IOH 82023 chipset product with 6.4Gbt Quick Path Interconnect technology on 65nm process and the LAN Access Division 82571EB, the world’s 1st Mixed-Signal 90nm product, a Dual 1Gb Ethernet Controller with dual PCIE I/O and innovative compact 17x17 mm FCBGA package \n \nSupported the development of Ethernet mixed signal products as Senior Product Engineer for Network Infrastructure Org 10/100Mb (Open) 3 recommendations, including: Roni Berger Product Engineering Manager at Intel Glenn is an excellent program manager. He has a vast knowledge on manufacturing procedures, technologies and methodologies,... View Ilan Avital Director of Silicon Engineering I have worked with Glenn for 6 years on a number of products. I especially appreciate Glenn’s ability to work cross-site,... View 1 more recommendation Military Product Project Manager Lattice Semiconductor July 1988  –  July 1997  (9 years 1 month) Directed the production characterization and implementation of Lattice GAL, pLSI, and ispLSI products into MIL-STD-883D compliance, where I championed team into meeting all assigned project goals and objectives according to established development procedures. \n \nNOTABLE ACHIEVEMENTS: \n \nPlanned, directed, and managed complex projects, leading teams and managing diverse and competing requirements \n \nProvided a wide range of program management strategies, philosophies, policies, and procedures to successfully identify potential problem areas, develop and maintain project schedule, prepare and present progress and reduce costs Product Engineering Supervisor NATIONAL SEMICONDUCTOR April 1981  –  July 1988  (7 years 4 months) West Jordan UT (Memory Linear Division), South Portland ME (Digital Logic Div) Introduced product and processes, sustained product, improved yields, and reduced product costs. Supervisory responsibilities included operating & capital budget, four engineers, and seven technicians. Front End Product Engineer Texas Instruments June 1979  –  April 1981  (1 year 11 months) 4 inch 16K DRAM NMOS fab using Contact mask technology using 4um transistor size Director of Engineering Teledyne Technologies Incorporated December 2014  –  June 2015  (7 months) Lewisville TN Director of Engineering; managing the engineering team in the Electronic Manufacturing Services and Micro division. High value and high reliability product for Aerospace, Medical, Military, and Commercial. Products include multi-mode fiber optic devices, custom hybrids, custom QFN, flip chip devices, system boards, high frequency RF, and medical devices. Director of Engineering Teledyne Technologies Incorporated December 2014  –  June 2015  (7 months) Lewisville TN Director of Engineering; managing the engineering team in the Electronic Manufacturing Services and Micro division. High value and high reliability product for Aerospace, Medical, Military, and Commercial. Products include multi-mode fiber optic devices, custom hybrids, custom QFN, flip chip devices, system boards, high frequency RF, and medical devices. Mobile Communications Group (MCG) / Devices R&D (DRD) Operations Program Manager Intel Corporation August 2012  –  May 2014  (1 year 10 months) Austin, Texas Area I effectively lead a global, cross functional team in production planning and manufacturing of Intel tablet Form Factor Designs (FFD), utilized to provide performance characteristics of Intel Atom SoC's used by customers and assess the performance of Intel Atom based platforms.  \n \nMy superior communication skills allow me to facilitate effective communication amongst China based manufacturing contractors and team regarding, deliverables, KPIs, and milestones in the schedule. \n \nExceptional ability to identify, analyze, and communicate project risks, successfully implementing mitigation and resolution. \n \nNOTABLE ACHIEVEMENTS: \n \nOversee all aspects of surface-mount technology (SMT) and testing systems for the boards, establishing and enforcing the organizations quality standard. \n \nCompile, initiate, sort, and analyze production performance records and data, recommending and implementing continuous improvement processes. \n \nCoordinate shipping of 10,000 tablets to locations worldwide, developing and executing shipping plan and allocating resources accordingly. \n \nSuccessfully managed the Intel's Bay Trail FFD for Windows, providing effective communication and updates to all levels of the organization through meetings, presentations, and reports. Mobile Communications Group (MCG) / Devices R&D (DRD) Operations Program Manager Intel Corporation August 2012  –  May 2014  (1 year 10 months) Austin, Texas Area I effectively lead a global, cross functional team in production planning and manufacturing of Intel tablet Form Factor Designs (FFD), utilized to provide performance characteristics of Intel Atom SoC's used by customers and assess the performance of Intel Atom based platforms.  \n \nMy superior communication skills allow me to facilitate effective communication amongst China based manufacturing contractors and team regarding, deliverables, KPIs, and milestones in the schedule. \n \nExceptional ability to identify, analyze, and communicate project risks, successfully implementing mitigation and resolution. \n \nNOTABLE ACHIEVEMENTS: \n \nOversee all aspects of surface-mount technology (SMT) and testing systems for the boards, establishing and enforcing the organizations quality standard. \n \nCompile, initiate, sort, and analyze production performance records and data, recommending and implementing continuous improvement processes. \n \nCoordinate shipping of 10,000 tablets to locations worldwide, developing and executing shipping plan and allocating resources accordingly. \n \nSuccessfully managed the Intel's Bay Trail FFD for Windows, providing effective communication and updates to all levels of the organization through meetings, presentations, and reports. IADa Manufacturing Integrator PM Intel Corporation July 1997  –  August 2012  (15 years 2 months) Hillsboro Oregon and Austin Texas I drove the development and implementation of systems integration activities for the next generation Atom SOC CPU, supporting new product introduction of MCG products.  \n \nSuccessfully developed integration strategies, defining structure and process, identifying and directing resources, establishing timelines, milestones, deliverables, and end of- integration criteria. \n \nImplemented SPC into the day-to-day execution of the integration process, where I directed cross-functional team in delivering business objectives according to timelines.  \n \nNOTABLE ACHIEVEMENTS: \n \nDelivered product sustaining support for Intel's 1st generation 32 nm Atom SoC, providing technical support and efficient solutions to problems occurring during manufacturing  \n \nServed as Manufacturing Program Manager for a number of product releases including, the Platform Components Group Server Tylersburg IOH 82023 chipset product with 6.4Gbt Quick Path Interconnect technology on 65nm process and the LAN Access Division 82571EB, the world’s 1st Mixed-Signal 90nm product, a Dual 1Gb Ethernet Controller with dual PCIE I/O and innovative compact 17x17 mm FCBGA package \n \nSupported the development of Ethernet mixed signal products as Senior Product Engineer for Network Infrastructure Org 10/100Mb (Open) 3 recommendations, including: Roni Berger Product Engineering Manager at Intel Glenn is an excellent program manager. He has a vast knowledge on manufacturing procedures, technologies and methodologies,... View Ilan Avital Director of Silicon Engineering I have worked with Glenn for 6 years on a number of products. I especially appreciate Glenn’s ability to work cross-site,... View 1 more recommendation IADa Manufacturing Integrator PM Intel Corporation July 1997  –  August 2012  (15 years 2 months) Hillsboro Oregon and Austin Texas I drove the development and implementation of systems integration activities for the next generation Atom SOC CPU, supporting new product introduction of MCG products.  \n \nSuccessfully developed integration strategies, defining structure and process, identifying and directing resources, establishing timelines, milestones, deliverables, and end of- integration criteria. \n \nImplemented SPC into the day-to-day execution of the integration process, where I directed cross-functional team in delivering business objectives according to timelines.  \n \nNOTABLE ACHIEVEMENTS: \n \nDelivered product sustaining support for Intel's 1st generation 32 nm Atom SoC, providing technical support and efficient solutions to problems occurring during manufacturing  \n \nServed as Manufacturing Program Manager for a number of product releases including, the Platform Components Group Server Tylersburg IOH 82023 chipset product with 6.4Gbt Quick Path Interconnect technology on 65nm process and the LAN Access Division 82571EB, the world’s 1st Mixed-Signal 90nm product, a Dual 1Gb Ethernet Controller with dual PCIE I/O and innovative compact 17x17 mm FCBGA package \n \nSupported the development of Ethernet mixed signal products as Senior Product Engineer for Network Infrastructure Org 10/100Mb (Open) 3 recommendations, including: Roni Berger Product Engineering Manager at Intel Glenn is an excellent program manager. He has a vast knowledge on manufacturing procedures, technologies and methodologies,... View Ilan Avital Director of Silicon Engineering I have worked with Glenn for 6 years on a number of products. I especially appreciate Glenn’s ability to work cross-site,... View 1 more recommendation Military Product Project Manager Lattice Semiconductor July 1988  –  July 1997  (9 years 1 month) Directed the production characterization and implementation of Lattice GAL, pLSI, and ispLSI products into MIL-STD-883D compliance, where I championed team into meeting all assigned project goals and objectives according to established development procedures. \n \nNOTABLE ACHIEVEMENTS: \n \nPlanned, directed, and managed complex projects, leading teams and managing diverse and competing requirements \n \nProvided a wide range of program management strategies, philosophies, policies, and procedures to successfully identify potential problem areas, develop and maintain project schedule, prepare and present progress and reduce costs Military Product Project Manager Lattice Semiconductor July 1988  –  July 1997  (9 years 1 month) Directed the production characterization and implementation of Lattice GAL, pLSI, and ispLSI products into MIL-STD-883D compliance, where I championed team into meeting all assigned project goals and objectives according to established development procedures. \n \nNOTABLE ACHIEVEMENTS: \n \nPlanned, directed, and managed complex projects, leading teams and managing diverse and competing requirements \n \nProvided a wide range of program management strategies, philosophies, policies, and procedures to successfully identify potential problem areas, develop and maintain project schedule, prepare and present progress and reduce costs Product Engineering Supervisor NATIONAL SEMICONDUCTOR April 1981  –  July 1988  (7 years 4 months) West Jordan UT (Memory Linear Division), South Portland ME (Digital Logic Div) Introduced product and processes, sustained product, improved yields, and reduced product costs. Supervisory responsibilities included operating & capital budget, four engineers, and seven technicians. Product Engineering Supervisor NATIONAL SEMICONDUCTOR April 1981  –  July 1988  (7 years 4 months) West Jordan UT (Memory Linear Division), South Portland ME (Digital Logic Div) Introduced product and processes, sustained product, improved yields, and reduced product costs. Supervisory responsibilities included operating & capital budget, four engineers, and seven technicians. Front End Product Engineer Texas Instruments June 1979  –  April 1981  (1 year 11 months) 4 inch 16K DRAM NMOS fab using Contact mask technology using 4um transistor size Front End Product Engineer Texas Instruments June 1979  –  April 1981  (1 year 11 months) 4 inch 16K DRAM NMOS fab using Contact mask technology using 4um transistor size Skills Top Skills 48 Semiconductors 24 Engineering Management 22 IC 21 SoC 19 Cross-functional Team... 17 Mixed Signal 15 Manufacturing 13 Program Management 12 Testing 11 Intel Glenn also knows about... 10 Semiconductor Industry 10 ASIC 9 SPC 9 Debugging 6 Failure Analysis 6 Project Management 6 Electronics 5 RF 5 Product Development 4 Product Engineering 4 Silicon 3 Design of Experiments 3 Continuous Improvement 2 Six Sigma 1 Packaging 1 IC packaging 1 Engineering 0 Semiconductor... 0 Assembly 0 Cost Reduction 0 Processors 0 SMT 0 Product Management 0 Embedded Systems 0 Management 0 Analog 0 R&D 0 Integration 0 Lean Manufacturing 0 Electrical Engineering 0 Manufacturing... 0 New Business Development 0 Design Engineering 0 Engineering Director 0 Quality Assurance 0 Leadership 0 Process Improvement 0 Analysis See 23+     See less Skills  Top Skills 48 Semiconductors 24 Engineering Management 22 IC 21 SoC 19 Cross-functional Team... 17 Mixed Signal 15 Manufacturing 13 Program Management 12 Testing 11 Intel Glenn also knows about... 10 Semiconductor Industry 10 ASIC 9 SPC 9 Debugging 6 Failure Analysis 6 Project Management 6 Electronics 5 RF 5 Product Development 4 Product Engineering 4 Silicon 3 Design of Experiments 3 Continuous Improvement 2 Six Sigma 1 Packaging 1 IC packaging 1 Engineering 0 Semiconductor... 0 Assembly 0 Cost Reduction 0 Processors 0 SMT 0 Product Management 0 Embedded Systems 0 Management 0 Analog 0 R&D 0 Integration 0 Lean Manufacturing 0 Electrical Engineering 0 Manufacturing... 0 New Business Development 0 Design Engineering 0 Engineering Director 0 Quality Assurance 0 Leadership 0 Process Improvement 0 Analysis See 23+     See less Top Skills 48 Semiconductors 24 Engineering Management 22 IC 21 SoC 19 Cross-functional Team... 17 Mixed Signal 15 Manufacturing 13 Program Management 12 Testing 11 Intel Glenn also knows about... 10 Semiconductor Industry 10 ASIC 9 SPC 9 Debugging 6 Failure Analysis 6 Project Management 6 Electronics 5 RF 5 Product Development 4 Product Engineering 4 Silicon 3 Design of Experiments 3 Continuous Improvement 2 Six Sigma 1 Packaging 1 IC packaging 1 Engineering 0 Semiconductor... 0 Assembly 0 Cost Reduction 0 Processors 0 SMT 0 Product Management 0 Embedded Systems 0 Management 0 Analog 0 R&D 0 Integration 0 Lean Manufacturing 0 Electrical Engineering 0 Manufacturing... 0 New Business Development 0 Design Engineering 0 Engineering Director 0 Quality Assurance 0 Leadership 0 Process Improvement 0 Analysis See 23+     See less Top Skills 48 Semiconductors 24 Engineering Management 22 IC 21 SoC 19 Cross-functional Team... 17 Mixed Signal 15 Manufacturing 13 Program Management 12 Testing 11 Intel Glenn also knows about... 10 Semiconductor Industry 10 ASIC 9 SPC 9 Debugging 6 Failure Analysis 6 Project Management 6 Electronics 5 RF 5 Product Development 4 Product Engineering 4 Silicon 3 Design of Experiments 3 Continuous Improvement 2 Six Sigma 1 Packaging 1 IC packaging 1 Engineering 0 Semiconductor... 0 Assembly 0 Cost Reduction 0 Processors 0 SMT 0 Product Management 0 Embedded Systems 0 Management 0 Analog 0 R&D 0 Integration 0 Lean Manufacturing 0 Electrical Engineering 0 Manufacturing... 0 New Business Development 0 Design Engineering 0 Engineering Director 0 Quality Assurance 0 Leadership 0 Process Improvement 0 Analysis See 23+     See less                     10 Semiconductor Industry 10 ASIC 9 SPC 9 Debugging 6 Failure Analysis 6 Project Management 6 Electronics 5 RF 5 Product Development 4 Product Engineering 4 Silicon 3 Design of Experiments 3 Continuous Improvement 2 Six Sigma 1 Packaging 1 IC packaging 1 Engineering 0 Semiconductor... 0 Assembly 0 Cost Reduction 0 Processors 0 SMT 0 Product Management 0 Embedded Systems 0 Management 0 Analog 0 R&D 0 Integration 0 Lean Manufacturing 0 Electrical Engineering 0 Manufacturing... 0 New Business Development 0 Design Engineering 0 Engineering Director 0 Quality Assurance 0 Leadership 0 Process Improvement 0 Analysis Education Dale Carniege Certificate,  Communications 2003  – 2007 Learned interactive communications, people management, how to speak in front of peers, influence techniques. University of Massachusetts, Amherst Master of Science (MS),  Engineering/Industrial Management , B 1983  – 1984 Work toward M.S. Degree in Engineering Management University of Utah Master of Science (MS),  Engineering/Industrial Management , B 1982  – 1983 Work toward M.S. Degree in Engineering Management Worcester Polytechnic Institute BSEE,  Electrical Engineering ,  Electronic Engineering 1975  – 1979 Graduated with honors Activities and Societies:  Ham Radio Dale Carniege Certificate,  Communications 2003  – 2007 Learned interactive communications, people management, how to speak in front of peers, influence techniques. Dale Carniege Certificate,  Communications 2003  – 2007 Learned interactive communications, people management, how to speak in front of peers, influence techniques. Dale Carniege Certificate,  Communications 2003  – 2007 Learned interactive communications, people management, how to speak in front of peers, influence techniques. University of Massachusetts, Amherst Master of Science (MS),  Engineering/Industrial Management , B 1983  – 1984 Work toward M.S. Degree in Engineering Management University of Massachusetts, Amherst Master of Science (MS),  Engineering/Industrial Management , B 1983  – 1984 Work toward M.S. Degree in Engineering Management University of Massachusetts, Amherst Master of Science (MS),  Engineering/Industrial Management , B 1983  – 1984 Work toward M.S. Degree in Engineering Management University of Utah Master of Science (MS),  Engineering/Industrial Management , B 1982  – 1983 Work toward M.S. Degree in Engineering Management University of Utah Master of Science (MS),  Engineering/Industrial Management , B 1982  – 1983 Work toward M.S. Degree in Engineering Management University of Utah Master of Science (MS),  Engineering/Industrial Management , B 1982  – 1983 Work toward M.S. Degree in Engineering Management Worcester Polytechnic Institute BSEE,  Electrical Engineering ,  Electronic Engineering 1975  – 1979 Graduated with honors Activities and Societies:  Ham Radio Worcester Polytechnic Institute BSEE,  Electrical Engineering ,  Electronic Engineering 1975  – 1979 Graduated with honors Activities and Societies:  Ham Radio Worcester Polytechnic Institute BSEE,  Electrical Engineering ,  Electronic Engineering 1975  – 1979 Graduated with honors Activities and Societies:  Ham Radio Honors & Awards Additional Honors & Awards Dale Carnegie Training completed 2003, Team Leader 2004, 2005 & 2006 and Coordinator & Leader for Intel Course 2007 \n \nPAPERS PUBLISHED: \nLead Free Conference, Boston MA, December 2006: Development and Reliability of a Lead Free Small Form Factor Flip Chip Package and LAN Adapter Board (co-author Edward McSweeney) \n \nDTTC (Intel Design, Test, and Technology Conference) Presenting Paper, “Precision WLAN RF Tester Calibration Using De-embedding with Calibration Units”, August 2006 (authored with Oded Olansky) \n \nDTTC Paper, “Improving Performance of the BGA Package for your Mixed Signal Product”, August 2005 \n \nIEEE ECTC 2005, “Development of a Small Die-Small Form Factor Flip Chip Package for Application in LAN Product”, June 2005 (authored with Altaf Hassan) \n \nIEEE ECTC 2005, “Using MMAP for Mixed Signal Empirical Substrate Design optimization”, June 2005 \n \nIEEE Paper: Development of a Flip Chip Molded Matrix Array Package for LOM Application (co-authors Yee Hao Ho, Navtej Singh, Amol Ki) Additional Honors & Awards Dale Carnegie Training completed 2003, Team Leader 2004, 2005 & 2006 and Coordinator & Leader for Intel Course 2007 \n \nPAPERS PUBLISHED: \nLead Free Conference, Boston MA, December 2006: Development and Reliability of a Lead Free Small Form Factor Flip Chip Package and LAN Adapter Board (co-author Edward McSweeney) \n \nDTTC (Intel Design, Test, and Technology Conference) Presenting Paper, “Precision WLAN RF Tester Calibration Using De-embedding with Calibration Units”, August 2006 (authored with Oded Olansky) \n \nDTTC Paper, “Improving Performance of the BGA Package for your Mixed Signal Product”, August 2005 \n \nIEEE ECTC 2005, “Development of a Small Die-Small Form Factor Flip Chip Package for Application in LAN Product”, June 2005 (authored with Altaf Hassan) \n \nIEEE ECTC 2005, “Using MMAP for Mixed Signal Empirical Substrate Design optimization”, June 2005 \n \nIEEE Paper: Development of a Flip Chip Molded Matrix Array Package for LOM Application (co-authors Yee Hao Ho, Navtej Singh, Amol Ki) Additional Honors & Awards Dale Carnegie Training completed 2003, Team Leader 2004, 2005 & 2006 and Coordinator & Leader for Intel Course 2007 \n \nPAPERS PUBLISHED: \nLead Free Conference, Boston MA, December 2006: Development and Reliability of a Lead Free Small Form Factor Flip Chip Package and LAN Adapter Board (co-author Edward McSweeney) \n \nDTTC (Intel Design, Test, and Technology Conference) Presenting Paper, “Precision WLAN RF Tester Calibration Using De-embedding with Calibration Units”, August 2006 (authored with Oded Olansky) \n \nDTTC Paper, “Improving Performance of the BGA Package for your Mixed Signal Product”, August 2005 \n \nIEEE ECTC 2005, “Development of a Small Die-Small Form Factor Flip Chip Package for Application in LAN Product”, June 2005 (authored with Altaf Hassan) \n \nIEEE ECTC 2005, “Using MMAP for Mixed Signal Empirical Substrate Design optimization”, June 2005 \n \nIEEE Paper: Development of a Flip Chip Molded Matrix Array Package for LOM Application (co-authors Yee Hao Ho, Navtej Singh, Amol Ki) Additional Honors & Awards Dale Carnegie Training completed 2003, Team Leader 2004, 2005 & 2006 and Coordinator & Leader for Intel Course 2007 \n \nPAPERS PUBLISHED: \nLead Free Conference, Boston MA, December 2006: Development and Reliability of a Lead Free Small Form Factor Flip Chip Package and LAN Adapter Board (co-author Edward McSweeney) \n \nDTTC (Intel Design, Test, and Technology Conference) Presenting Paper, “Precision WLAN RF Tester Calibration Using De-embedding with Calibration Units”, August 2006 (authored with Oded Olansky) \n \nDTTC Paper, “Improving Performance of the BGA Package for your Mixed Signal Product”, August 2005 \n \nIEEE ECTC 2005, “Development of a Small Die-Small Form Factor Flip Chip Package for Application in LAN Product”, June 2005 (authored with Altaf Hassan) \n \nIEEE ECTC 2005, “Using MMAP for Mixed Signal Empirical Substrate Design optimization”, June 2005 \n \nIEEE Paper: Development of a Flip Chip Molded Matrix Array Package for LOM Application (co-authors Yee Hao Ho, Navtej Singh, Amol Ki) ", "Experience Manager Intel Corporation 2011  – Present (4 years) Folsom, CA Global Web Operations Program Manager Intel Corporation 2008  –  2011  (3 years) Folsom, CA Web Publishing Services Project Manager Intel Corporation 2004  –  2008  (4 years) Folsom Lead Web Designer Intel Capital 2003  –  2004  (1 year) Santa Clara, CA Sr. Web Designer/Developer Kanisa Inc. 2003  –  2003  (less than a year) Cupertino, CA Web Project Manager Intel Corporation 2002  –  2003  (1 year) Santa Clara, CA e-Solutions Manager 1-2-1 Solutions Inc. 2001  –  2002  (1 year) San Jose, CA Web Project Manager Intel Corporation 1999  –  2001  (2 years) Santa Clara, CA Manager Intel Corporation 2011  – Present (4 years) Folsom, CA Manager Intel Corporation 2011  – Present (4 years) Folsom, CA Global Web Operations Program Manager Intel Corporation 2008  –  2011  (3 years) Folsom, CA Global Web Operations Program Manager Intel Corporation 2008  –  2011  (3 years) Folsom, CA Web Publishing Services Project Manager Intel Corporation 2004  –  2008  (4 years) Folsom Web Publishing Services Project Manager Intel Corporation 2004  –  2008  (4 years) Folsom Lead Web Designer Intel Capital 2003  –  2004  (1 year) Santa Clara, CA Lead Web Designer Intel Capital 2003  –  2004  (1 year) Santa Clara, CA Sr. Web Designer/Developer Kanisa Inc. 2003  –  2003  (less than a year) Cupertino, CA Sr. Web Designer/Developer Kanisa Inc. 2003  –  2003  (less than a year) Cupertino, CA Web Project Manager Intel Corporation 2002  –  2003  (1 year) Santa Clara, CA Web Project Manager Intel Corporation 2002  –  2003  (1 year) Santa Clara, CA e-Solutions Manager 1-2-1 Solutions Inc. 2001  –  2002  (1 year) San Jose, CA e-Solutions Manager 1-2-1 Solutions Inc. 2001  –  2002  (1 year) San Jose, CA Web Project Manager Intel Corporation 1999  –  2001  (2 years) Santa Clara, CA Web Project Manager Intel Corporation 1999  –  2001  (2 years) Santa Clara, CA Skills Top Skills 23 Cross-functional Team... 20 Product Management 17 Program Management 9 Software Project... 8 Project Management 8 Strategy 6 Agile Methodologies 5 Product Marketing 5 User Experience 5 Vendor Management Greg also knows about... 4 Project Planning 4 Software Development 3 PMP 3 Integration 2 Mobile Devices 0 Web Operations Skills  Top Skills 23 Cross-functional Team... 20 Product Management 17 Program Management 9 Software Project... 8 Project Management 8 Strategy 6 Agile Methodologies 5 Product Marketing 5 User Experience 5 Vendor Management Greg also knows about... 4 Project Planning 4 Software Development 3 PMP 3 Integration 2 Mobile Devices 0 Web Operations Top Skills 23 Cross-functional Team... 20 Product Management 17 Program Management 9 Software Project... 8 Project Management 8 Strategy 6 Agile Methodologies 5 Product Marketing 5 User Experience 5 Vendor Management Greg also knows about... 4 Project Planning 4 Software Development 3 PMP 3 Integration 2 Mobile Devices 0 Web Operations Top Skills 23 Cross-functional Team... 20 Product Management 17 Program Management 9 Software Project... 8 Project Management 8 Strategy 6 Agile Methodologies 5 Product Marketing 5 User Experience 5 Vendor Management Greg also knows about... 4 Project Planning 4 Software Development 3 PMP 3 Integration 2 Mobile Devices 0 Web Operations                     4 Project Planning 4 Software Development 3 PMP 3 Integration 2 Mobile Devices 0 Web Operations ", "Summary 20+ years of leadership in business operations and program management, product marketing and corporate finance. Currently managing NPI Business Operations team responsible for product ramps and life cycle management of Qualcomm baseband (MSM), RF and peripheral chipset products. Product and Customer Program Manager during launch of Centrino’s Wi-Fi component for Centrino Mobile Technology. Proven ability to leverage various program management, marketing, finance and operations experiences coupled with an MBA education to effectively manage technical, complex, multi-national development and post-launch programs. \n \nSpecialties: Sales Operations, Product Marketing, Customer Management, Program Management, Strategic Partnerships, Project Management, Operations and Supplier Management, Finance Summary 20+ years of leadership in business operations and program management, product marketing and corporate finance. Currently managing NPI Business Operations team responsible for product ramps and life cycle management of Qualcomm baseband (MSM), RF and peripheral chipset products. Product and Customer Program Manager during launch of Centrino’s Wi-Fi component for Centrino Mobile Technology. Proven ability to leverage various program management, marketing, finance and operations experiences coupled with an MBA education to effectively manage technical, complex, multi-national development and post-launch programs. \n \nSpecialties: Sales Operations, Product Marketing, Customer Management, Program Management, Strategic Partnerships, Project Management, Operations and Supplier Management, Finance 20+ years of leadership in business operations and program management, product marketing and corporate finance. Currently managing NPI Business Operations team responsible for product ramps and life cycle management of Qualcomm baseband (MSM), RF and peripheral chipset products. Product and Customer Program Manager during launch of Centrino’s Wi-Fi component for Centrino Mobile Technology. Proven ability to leverage various program management, marketing, finance and operations experiences coupled with an MBA education to effectively manage technical, complex, multi-national development and post-launch programs. \n \nSpecialties: Sales Operations, Product Marketing, Customer Management, Program Management, Strategic Partnerships, Project Management, Operations and Supplier Management, Finance 20+ years of leadership in business operations and program management, product marketing and corporate finance. Currently managing NPI Business Operations team responsible for product ramps and life cycle management of Qualcomm baseband (MSM), RF and peripheral chipset products. Product and Customer Program Manager during launch of Centrino’s Wi-Fi component for Centrino Mobile Technology. Proven ability to leverage various program management, marketing, finance and operations experiences coupled with an MBA education to effectively manage technical, complex, multi-national development and post-launch programs. \n \nSpecialties: Sales Operations, Product Marketing, Customer Management, Program Management, Strategic Partnerships, Project Management, Operations and Supplier Management, Finance Experience Manager, QCT Sales Operations Qualcomm 2008  – Present (7 years) Greater San Diego Area Director, Programs Powercast Corporation 2007  –  2008  (1 year) Greater San Diego Area - Program Managed Powercast’s first ever revenue product with on-time release under tight constraints while coordinating external requirements and deliveries between partners and end customer.  \n- Created product launch processes and product quality standards for future product releases.  \n- Developed and led wireless power demo development plan for CES2008 by leading multi-site effort. Successful showing at CES helped enable 2nd round of funding. Senior Marketing Manager Toshiba America Electronic Components 2006  –  2007  (1 year) Orange County, California Area Managed TAEC Power Semiconductor business in the Americas with P&L and marketing ownership by actively promoting products directly to customers and by managing a network of sales reps and distributors. \n- Directed and managed the Power Semiconductor Business Development Team in growing market segment share. \n- Monitored and managed the development of business plans, product lifecycles, Marcom, Trade shows, and positioning of Toshiba’s Power Discrete products within the industry base. \nProduct release announcements included: \nhttp://www.eetasia.com/ART_8800438807_1034362_NP_26843abf.HTM \nhttp://www.toshiba.com/taec/news/press_releases/2007/powr_07_465.jsp (Open) 2 recommendations Poloi Lin Solar Customer Communications & Training at Southern California Edison Ajay brought a lot of new ideas and energy to the Power group. It was a pleasure to work directly with him on trade show... View Daniel Ayoub Founder & CEO at ITUS Networks Ajay is excellent manager and mentor; his wealth of experience and knowledge is quite impressive. View Toshiba Introduces Energy-Saving Motor Drivers Edit Senior Marketing Manager Intel Corporation - Server Platform Group 2005  –  2006  (1 year) Orange County, California Area Managed Itanium and Xeon Chipset products for 2008-2011. Managed OEM customer relationships for server product team. Responsibilities included single point of contact for all product related Xeon MP and Itanium product questions/issues and synchronized on OEM designs plans to guide time to market platform launches. \n- Calibrated with top Itanium OEM design teams and drove design changes into 2008 chipset that resulted in several new chipset design wins, thereby doubling expected market share over current Itanium chipset. \n- Partnered with platform planning and chipset architects to influence next generation Xeon Chipset design features based on customer knowledge, competitive landscape and industry trends meeting OEM expectations. (Open) 2 recommendations Kevon Kothari Corporate Development Executive Ajay was my primary Marketing partner with regard to product roadmap and product pricing actions. Ajay is highly competent... View Yin Yu Strategic finance analyst at Intel I worked with Ajay on pricing of Intel's Itanium chipset. He is smart and knows a great deal about technology. He built... View Strategic Alliances Manager Gateway 2004  –  2005  (1 year) Orange County, California Area Managed strategic alliances with key suppliers (Intel, Microsoft, ATI) and partners (Google, Napster) to develop joint marketing programs, enforce MDA/MDF compliance and ensure maximum funding and rebate opportunities. \n- Owned strategic partnership with Intel including strategic funding, marketing programs, Intel Inside compliance, and alliance programs which optimize over $40M annual in funding/rebates and joint marketing. \n- Investigated, analyzed and recommended strategic partnership with search engines partners for Gateway pre-installs and incremental bounty generation opportunities which led to lucrative alliance with Google. (Open) 4 recommendations, including: Robert J. Blackwell Vice President, Marketing - Customs Now, Inc. While at Gateway, I had the pleasure of working with Ajay on a stratgic promotion between Gateway, Intel and Qwest. It was... View Shlomi Ron Chief Digital Officer, Social Business, Mobile Strategy, Innovation, Social Selling, and Emerging Storytelling Platforms It was a pleasure working with Ajay. He was highly instrumental in providing training and advice for implementing MDA/MDF... View 2 more recommendations Marketing Program Manager Intel Corporation - Wireless Network Group 2003  –  2004  (1 year) Greater San Diego Area Product Marketing Manager for Centrino Wireless Mini-PCI and PROset wireless configuration software. Executed ramp of Centrino 802.11bg wireless product line and managed enhanced PROset software update for product line. Managed Tier-1 OEM customer base in North America and APAC including Dell, HP, Gateway, Acer and Samsung for 802.11b product line. \n- Recognized for innovative restructuring of 802.11b software point release program by partnering with program management to deliver production version ahead of plan and meet top customer’s aggressive launch date. \n- Successfully planned and managed several major hardware modifications to revenue products across all Centrino OEMs utilizing proactive customer letters, quality data, samples distribution and SKU management. \n- Co-created and presented Centrino wireless product roadmap plans to customer management teams and drove feedback to internal development teams to influence product planning and drive strategic release cycles. (Open) 2 recommendations John Merrill Sr Director, Global Marketing at Imation Ajay is an effective, customer-oriented program manager who has was key to the success of supporting Intel's OEM account on... View Kedar N. Kondap Member of the Board at Creekside Education Foundation Ajay was definitely a critical and key person to help drive the wireless products with Intel. Ajay's hard work and diligence... View Operations Program Manager Intel Corporation - Intel Communications Group 2000  –  2003  (3 years) Greater San Diego Area Managed local operations team in the development, validation, implementation and production of Intel NetStructure Load Balancer hardware platform. Managed contract manufacturers to ensure on time fulfillment. \n- Overcame various roadblocks and pulled in schedule to support launch of eight SKUs on time within a one-month span and over 20 SKUs for Intel and OEMs. Oversaw doubling of system volumes in one year. \n- Partnered with OEM customers to project manage customization efforts based on RFQ requirements for Load Balancer product line. Effectively managed operations team to successfully launch customized products for tier-1 customer, meeting launch schedules during dot.com ramp under aggressive deadlines. (Open) 1 recommendation Mark Zisek Director at Access Marketing - a hotel's key card and key folder center I worked with Ajay on several product development teams for Intel's line of networking products. Ajay understood my needs and was responsive to them. He managed difficult suppliers and offshore manufacturing challenges, but was able to ensure the... View Senior Business Analyst Intel Corporation, Logistics Systems and Programs 1999  –  2000  (1 year) Phoenix, Arizona Area Managed product lifecycles of several internal shipping systems by driving customer requirements from various Intel sites and support groups. Project managed programmers, validation and training teams as well as implemented software and trained on-site at U.S, Ireland, Israel, and Puerto Rico logistics sites. \n- Project lead for Logistic Systems Support of Intel’s On-line Retail Center (ORC). Selected as key member of the outsourcing team for vendor evaluation of tier-1 electronics distributors in support of ORC ramp-up. \n- Facilitated functional design of a new tracking system, which partnered with an outside vendor. Coordinated analysis and resolution of gaps between Intel and vendor, created success metrics for implementation and co-wrote functional spec on internal system integration. (Open) 2 recommendations John Merrill Sr Director, Global Marketing at Imation Ajay was incredible at detail management and driving projects to their completion. An exceptional manager who understood... View Stacey (Townsend) Larson Director, Finance at BMW Group DesignworksUSA I worked with Ajay in Intel Logistics Systems. In his position, he was a strong business analyst who managed through some... View Senior Financial Analyst Intel Corporation, Assembly/Test Manufacturing 1995  –  1999  (4 years) Phoenix, Arizona Area Performed ROI/NPV analyses within Intel’s international factory network, which concluded with recommendations to senior management. Analyzed over $250M of opportunities and influenced implementation of projects that were expected to save Intel over $45M through four years. Served as group consolidator for Intel's SPG group from 1995-1997. \n- Lead analyst in which radical cost reduction activity was evaluated for CPU products. Utilized multi-national cost team for standardizing financial cost methods for new manufacturing process and implemented over $100M in cost-cutting projects across four production sites. \n- Received Divisional Recognition Award for results in defining, developing and implementing a cross-functional team focused on equipment spares manufacturing, engineering and materials management. Resulted in reducing Spares Days of Inventory from 350 to 139 days and saved over $20.5M. \n- Consolidated and analyzed financial data for $2B business unit. Results were presented to Group Controller and General Manager for strategic decision-making and for updates to Intel CFO and CEO. \n- Recognition award from senior marketing manager for financial analysis of marketing web technical documentation program which saved Intel an estimated $500K. (Open) 2 recommendations Bob Gujavarty VP of Investor Relations at Q2 Ajay was a senior finance analyst in the group when I joined Intel in 1996. He was a big help, getting me up to speed in my... View Michael Dendinger Director Global Operations at NuVasive I worked with Ajay while he was the senior financial analyst. He led the C4 costing effort across Intel virtual factory... View Financial Analyst/Project Coordinator AT&T / Lucent Technologies 1992  –  1995  (3 years) Greater New York City Area - Coordinated successful implementation of new telecommunications service bill verification process for large businesses between billing system analysts, project managers, and bill verification line group. \n- Budgeted, planned, and analyzed financial data and results for Chief Information Officer Organization ($200M annual budget) and presented data with spending recommendations to management. \n- Streamlined close analysis process by developing paperless process of converting raw data to analysis models. The new method reduced monthly close process time by 3 to 4 hours per person. \n- Member of AT&T Professional Development Program Manager, QCT Sales Operations Qualcomm 2008  – Present (7 years) Greater San Diego Area Manager, QCT Sales Operations Qualcomm 2008  – Present (7 years) Greater San Diego Area Director, Programs Powercast Corporation 2007  –  2008  (1 year) Greater San Diego Area - Program Managed Powercast’s first ever revenue product with on-time release under tight constraints while coordinating external requirements and deliveries between partners and end customer.  \n- Created product launch processes and product quality standards for future product releases.  \n- Developed and led wireless power demo development plan for CES2008 by leading multi-site effort. Successful showing at CES helped enable 2nd round of funding. Director, Programs Powercast Corporation 2007  –  2008  (1 year) Greater San Diego Area - Program Managed Powercast’s first ever revenue product with on-time release under tight constraints while coordinating external requirements and deliveries between partners and end customer.  \n- Created product launch processes and product quality standards for future product releases.  \n- Developed and led wireless power demo development plan for CES2008 by leading multi-site effort. Successful showing at CES helped enable 2nd round of funding. Senior Marketing Manager Toshiba America Electronic Components 2006  –  2007  (1 year) Orange County, California Area Managed TAEC Power Semiconductor business in the Americas with P&L and marketing ownership by actively promoting products directly to customers and by managing a network of sales reps and distributors. \n- Directed and managed the Power Semiconductor Business Development Team in growing market segment share. \n- Monitored and managed the development of business plans, product lifecycles, Marcom, Trade shows, and positioning of Toshiba’s Power Discrete products within the industry base. \nProduct release announcements included: \nhttp://www.eetasia.com/ART_8800438807_1034362_NP_26843abf.HTM \nhttp://www.toshiba.com/taec/news/press_releases/2007/powr_07_465.jsp (Open) 2 recommendations Poloi Lin Solar Customer Communications & Training at Southern California Edison Ajay brought a lot of new ideas and energy to the Power group. It was a pleasure to work directly with him on trade show... View Daniel Ayoub Founder & CEO at ITUS Networks Ajay is excellent manager and mentor; his wealth of experience and knowledge is quite impressive. View Toshiba Introduces Energy-Saving Motor Drivers Edit Senior Marketing Manager Toshiba America Electronic Components 2006  –  2007  (1 year) Orange County, California Area Managed TAEC Power Semiconductor business in the Americas with P&L and marketing ownership by actively promoting products directly to customers and by managing a network of sales reps and distributors. \n- Directed and managed the Power Semiconductor Business Development Team in growing market segment share. \n- Monitored and managed the development of business plans, product lifecycles, Marcom, Trade shows, and positioning of Toshiba’s Power Discrete products within the industry base. \nProduct release announcements included: \nhttp://www.eetasia.com/ART_8800438807_1034362_NP_26843abf.HTM \nhttp://www.toshiba.com/taec/news/press_releases/2007/powr_07_465.jsp (Open) 2 recommendations Poloi Lin Solar Customer Communications & Training at Southern California Edison Ajay brought a lot of new ideas and energy to the Power group. It was a pleasure to work directly with him on trade show... View Daniel Ayoub Founder & CEO at ITUS Networks Ajay is excellent manager and mentor; his wealth of experience and knowledge is quite impressive. View Toshiba Introduces Energy-Saving Motor Drivers Edit Toshiba Introduces Energy-Saving Motor Drivers Edit Toshiba Introduces Energy-Saving Motor Drivers Edit Toshiba Introduces Energy-Saving Motor Drivers  Toshiba Introduces Energy-Saving Motor Drivers  Senior Marketing Manager Intel Corporation - Server Platform Group 2005  –  2006  (1 year) Orange County, California Area Managed Itanium and Xeon Chipset products for 2008-2011. Managed OEM customer relationships for server product team. Responsibilities included single point of contact for all product related Xeon MP and Itanium product questions/issues and synchronized on OEM designs plans to guide time to market platform launches. \n- Calibrated with top Itanium OEM design teams and drove design changes into 2008 chipset that resulted in several new chipset design wins, thereby doubling expected market share over current Itanium chipset. \n- Partnered with platform planning and chipset architects to influence next generation Xeon Chipset design features based on customer knowledge, competitive landscape and industry trends meeting OEM expectations. (Open) 2 recommendations Kevon Kothari Corporate Development Executive Ajay was my primary Marketing partner with regard to product roadmap and product pricing actions. Ajay is highly competent... View Yin Yu Strategic finance analyst at Intel I worked with Ajay on pricing of Intel's Itanium chipset. He is smart and knows a great deal about technology. He built... View Senior Marketing Manager Intel Corporation - Server Platform Group 2005  –  2006  (1 year) Orange County, California Area Managed Itanium and Xeon Chipset products for 2008-2011. Managed OEM customer relationships for server product team. Responsibilities included single point of contact for all product related Xeon MP and Itanium product questions/issues and synchronized on OEM designs plans to guide time to market platform launches. \n- Calibrated with top Itanium OEM design teams and drove design changes into 2008 chipset that resulted in several new chipset design wins, thereby doubling expected market share over current Itanium chipset. \n- Partnered with platform planning and chipset architects to influence next generation Xeon Chipset design features based on customer knowledge, competitive landscape and industry trends meeting OEM expectations. (Open) 2 recommendations Kevon Kothari Corporate Development Executive Ajay was my primary Marketing partner with regard to product roadmap and product pricing actions. Ajay is highly competent... View Yin Yu Strategic finance analyst at Intel I worked with Ajay on pricing of Intel's Itanium chipset. He is smart and knows a great deal about technology. He built... View Strategic Alliances Manager Gateway 2004  –  2005  (1 year) Orange County, California Area Managed strategic alliances with key suppliers (Intel, Microsoft, ATI) and partners (Google, Napster) to develop joint marketing programs, enforce MDA/MDF compliance and ensure maximum funding and rebate opportunities. \n- Owned strategic partnership with Intel including strategic funding, marketing programs, Intel Inside compliance, and alliance programs which optimize over $40M annual in funding/rebates and joint marketing. \n- Investigated, analyzed and recommended strategic partnership with search engines partners for Gateway pre-installs and incremental bounty generation opportunities which led to lucrative alliance with Google. (Open) 4 recommendations, including: Robert J. Blackwell Vice President, Marketing - Customs Now, Inc. While at Gateway, I had the pleasure of working with Ajay on a stratgic promotion between Gateway, Intel and Qwest. It was... View Shlomi Ron Chief Digital Officer, Social Business, Mobile Strategy, Innovation, Social Selling, and Emerging Storytelling Platforms It was a pleasure working with Ajay. He was highly instrumental in providing training and advice for implementing MDA/MDF... View 2 more recommendations Strategic Alliances Manager Gateway 2004  –  2005  (1 year) Orange County, California Area Managed strategic alliances with key suppliers (Intel, Microsoft, ATI) and partners (Google, Napster) to develop joint marketing programs, enforce MDA/MDF compliance and ensure maximum funding and rebate opportunities. \n- Owned strategic partnership with Intel including strategic funding, marketing programs, Intel Inside compliance, and alliance programs which optimize over $40M annual in funding/rebates and joint marketing. \n- Investigated, analyzed and recommended strategic partnership with search engines partners for Gateway pre-installs and incremental bounty generation opportunities which led to lucrative alliance with Google. (Open) 4 recommendations, including: Robert J. Blackwell Vice President, Marketing - Customs Now, Inc. While at Gateway, I had the pleasure of working with Ajay on a stratgic promotion between Gateway, Intel and Qwest. It was... View Shlomi Ron Chief Digital Officer, Social Business, Mobile Strategy, Innovation, Social Selling, and Emerging Storytelling Platforms It was a pleasure working with Ajay. He was highly instrumental in providing training and advice for implementing MDA/MDF... View 2 more recommendations Marketing Program Manager Intel Corporation - Wireless Network Group 2003  –  2004  (1 year) Greater San Diego Area Product Marketing Manager for Centrino Wireless Mini-PCI and PROset wireless configuration software. Executed ramp of Centrino 802.11bg wireless product line and managed enhanced PROset software update for product line. Managed Tier-1 OEM customer base in North America and APAC including Dell, HP, Gateway, Acer and Samsung for 802.11b product line. \n- Recognized for innovative restructuring of 802.11b software point release program by partnering with program management to deliver production version ahead of plan and meet top customer’s aggressive launch date. \n- Successfully planned and managed several major hardware modifications to revenue products across all Centrino OEMs utilizing proactive customer letters, quality data, samples distribution and SKU management. \n- Co-created and presented Centrino wireless product roadmap plans to customer management teams and drove feedback to internal development teams to influence product planning and drive strategic release cycles. (Open) 2 recommendations John Merrill Sr Director, Global Marketing at Imation Ajay is an effective, customer-oriented program manager who has was key to the success of supporting Intel's OEM account on... View Kedar N. Kondap Member of the Board at Creekside Education Foundation Ajay was definitely a critical and key person to help drive the wireless products with Intel. Ajay's hard work and diligence... View Marketing Program Manager Intel Corporation - Wireless Network Group 2003  –  2004  (1 year) Greater San Diego Area Product Marketing Manager for Centrino Wireless Mini-PCI and PROset wireless configuration software. Executed ramp of Centrino 802.11bg wireless product line and managed enhanced PROset software update for product line. Managed Tier-1 OEM customer base in North America and APAC including Dell, HP, Gateway, Acer and Samsung for 802.11b product line. \n- Recognized for innovative restructuring of 802.11b software point release program by partnering with program management to deliver production version ahead of plan and meet top customer’s aggressive launch date. \n- Successfully planned and managed several major hardware modifications to revenue products across all Centrino OEMs utilizing proactive customer letters, quality data, samples distribution and SKU management. \n- Co-created and presented Centrino wireless product roadmap plans to customer management teams and drove feedback to internal development teams to influence product planning and drive strategic release cycles. (Open) 2 recommendations John Merrill Sr Director, Global Marketing at Imation Ajay is an effective, customer-oriented program manager who has was key to the success of supporting Intel's OEM account on... View Kedar N. Kondap Member of the Board at Creekside Education Foundation Ajay was definitely a critical and key person to help drive the wireless products with Intel. Ajay's hard work and diligence... View Operations Program Manager Intel Corporation - Intel Communications Group 2000  –  2003  (3 years) Greater San Diego Area Managed local operations team in the development, validation, implementation and production of Intel NetStructure Load Balancer hardware platform. Managed contract manufacturers to ensure on time fulfillment. \n- Overcame various roadblocks and pulled in schedule to support launch of eight SKUs on time within a one-month span and over 20 SKUs for Intel and OEMs. Oversaw doubling of system volumes in one year. \n- Partnered with OEM customers to project manage customization efforts based on RFQ requirements for Load Balancer product line. Effectively managed operations team to successfully launch customized products for tier-1 customer, meeting launch schedules during dot.com ramp under aggressive deadlines. (Open) 1 recommendation Mark Zisek Director at Access Marketing - a hotel's key card and key folder center I worked with Ajay on several product development teams for Intel's line of networking products. Ajay understood my needs and was responsive to them. He managed difficult suppliers and offshore manufacturing challenges, but was able to ensure the... View Operations Program Manager Intel Corporation - Intel Communications Group 2000  –  2003  (3 years) Greater San Diego Area Managed local operations team in the development, validation, implementation and production of Intel NetStructure Load Balancer hardware platform. Managed contract manufacturers to ensure on time fulfillment. \n- Overcame various roadblocks and pulled in schedule to support launch of eight SKUs on time within a one-month span and over 20 SKUs for Intel and OEMs. Oversaw doubling of system volumes in one year. \n- Partnered with OEM customers to project manage customization efforts based on RFQ requirements for Load Balancer product line. Effectively managed operations team to successfully launch customized products for tier-1 customer, meeting launch schedules during dot.com ramp under aggressive deadlines. (Open) 1 recommendation Mark Zisek Director at Access Marketing - a hotel's key card and key folder center I worked with Ajay on several product development teams for Intel's line of networking products. Ajay understood my needs and was responsive to them. He managed difficult suppliers and offshore manufacturing challenges, but was able to ensure the... View Senior Business Analyst Intel Corporation, Logistics Systems and Programs 1999  –  2000  (1 year) Phoenix, Arizona Area Managed product lifecycles of several internal shipping systems by driving customer requirements from various Intel sites and support groups. Project managed programmers, validation and training teams as well as implemented software and trained on-site at U.S, Ireland, Israel, and Puerto Rico logistics sites. \n- Project lead for Logistic Systems Support of Intel’s On-line Retail Center (ORC). Selected as key member of the outsourcing team for vendor evaluation of tier-1 electronics distributors in support of ORC ramp-up. \n- Facilitated functional design of a new tracking system, which partnered with an outside vendor. Coordinated analysis and resolution of gaps between Intel and vendor, created success metrics for implementation and co-wrote functional spec on internal system integration. (Open) 2 recommendations John Merrill Sr Director, Global Marketing at Imation Ajay was incredible at detail management and driving projects to their completion. An exceptional manager who understood... View Stacey (Townsend) Larson Director, Finance at BMW Group DesignworksUSA I worked with Ajay in Intel Logistics Systems. In his position, he was a strong business analyst who managed through some... View Senior Business Analyst Intel Corporation, Logistics Systems and Programs 1999  –  2000  (1 year) Phoenix, Arizona Area Managed product lifecycles of several internal shipping systems by driving customer requirements from various Intel sites and support groups. Project managed programmers, validation and training teams as well as implemented software and trained on-site at U.S, Ireland, Israel, and Puerto Rico logistics sites. \n- Project lead for Logistic Systems Support of Intel’s On-line Retail Center (ORC). Selected as key member of the outsourcing team for vendor evaluation of tier-1 electronics distributors in support of ORC ramp-up. \n- Facilitated functional design of a new tracking system, which partnered with an outside vendor. Coordinated analysis and resolution of gaps between Intel and vendor, created success metrics for implementation and co-wrote functional spec on internal system integration. (Open) 2 recommendations John Merrill Sr Director, Global Marketing at Imation Ajay was incredible at detail management and driving projects to their completion. An exceptional manager who understood... View Stacey (Townsend) Larson Director, Finance at BMW Group DesignworksUSA I worked with Ajay in Intel Logistics Systems. In his position, he was a strong business analyst who managed through some... View Senior Financial Analyst Intel Corporation, Assembly/Test Manufacturing 1995  –  1999  (4 years) Phoenix, Arizona Area Performed ROI/NPV analyses within Intel’s international factory network, which concluded with recommendations to senior management. Analyzed over $250M of opportunities and influenced implementation of projects that were expected to save Intel over $45M through four years. Served as group consolidator for Intel's SPG group from 1995-1997. \n- Lead analyst in which radical cost reduction activity was evaluated for CPU products. Utilized multi-national cost team for standardizing financial cost methods for new manufacturing process and implemented over $100M in cost-cutting projects across four production sites. \n- Received Divisional Recognition Award for results in defining, developing and implementing a cross-functional team focused on equipment spares manufacturing, engineering and materials management. Resulted in reducing Spares Days of Inventory from 350 to 139 days and saved over $20.5M. \n- Consolidated and analyzed financial data for $2B business unit. Results were presented to Group Controller and General Manager for strategic decision-making and for updates to Intel CFO and CEO. \n- Recognition award from senior marketing manager for financial analysis of marketing web technical documentation program which saved Intel an estimated $500K. (Open) 2 recommendations Bob Gujavarty VP of Investor Relations at Q2 Ajay was a senior finance analyst in the group when I joined Intel in 1996. He was a big help, getting me up to speed in my... View Michael Dendinger Director Global Operations at NuVasive I worked with Ajay while he was the senior financial analyst. He led the C4 costing effort across Intel virtual factory... View Senior Financial Analyst Intel Corporation, Assembly/Test Manufacturing 1995  –  1999  (4 years) Phoenix, Arizona Area Performed ROI/NPV analyses within Intel’s international factory network, which concluded with recommendations to senior management. Analyzed over $250M of opportunities and influenced implementation of projects that were expected to save Intel over $45M through four years. Served as group consolidator for Intel's SPG group from 1995-1997. \n- Lead analyst in which radical cost reduction activity was evaluated for CPU products. Utilized multi-national cost team for standardizing financial cost methods for new manufacturing process and implemented over $100M in cost-cutting projects across four production sites. \n- Received Divisional Recognition Award for results in defining, developing and implementing a cross-functional team focused on equipment spares manufacturing, engineering and materials management. Resulted in reducing Spares Days of Inventory from 350 to 139 days and saved over $20.5M. \n- Consolidated and analyzed financial data for $2B business unit. Results were presented to Group Controller and General Manager for strategic decision-making and for updates to Intel CFO and CEO. \n- Recognition award from senior marketing manager for financial analysis of marketing web technical documentation program which saved Intel an estimated $500K. (Open) 2 recommendations Bob Gujavarty VP of Investor Relations at Q2 Ajay was a senior finance analyst in the group when I joined Intel in 1996. He was a big help, getting me up to speed in my... View Michael Dendinger Director Global Operations at NuVasive I worked with Ajay while he was the senior financial analyst. He led the C4 costing effort across Intel virtual factory... View Financial Analyst/Project Coordinator AT&T / Lucent Technologies 1992  –  1995  (3 years) Greater New York City Area - Coordinated successful implementation of new telecommunications service bill verification process for large businesses between billing system analysts, project managers, and bill verification line group. \n- Budgeted, planned, and analyzed financial data and results for Chief Information Officer Organization ($200M annual budget) and presented data with spending recommendations to management. \n- Streamlined close analysis process by developing paperless process of converting raw data to analysis models. The new method reduced monthly close process time by 3 to 4 hours per person. \n- Member of AT&T Professional Development Program Financial Analyst/Project Coordinator AT&T / Lucent Technologies 1992  –  1995  (3 years) Greater New York City Area - Coordinated successful implementation of new telecommunications service bill verification process for large businesses between billing system analysts, project managers, and bill verification line group. \n- Budgeted, planned, and analyzed financial data and results for Chief Information Officer Organization ($200M annual budget) and presented data with spending recommendations to management. \n- Streamlined close analysis process by developing paperless process of converting raw data to analysis models. The new method reduced monthly close process time by 3 to 4 hours per person. \n- Member of AT&T Professional Development Program Skills 27 Cross-functional Team... 11 Strategic Partnerships 7 Program Management 6 Strategy 6 Product Marketing 3 Wireless 3 Semiconductors 2 CRM 2 Telecommunications Skills  27 Cross-functional Team... 11 Strategic Partnerships 7 Program Management 6 Strategy 6 Product Marketing 3 Wireless 3 Semiconductors 2 CRM 2 Telecommunications 27 Cross-functional Team... 11 Strategic Partnerships 7 Program Management 6 Strategy 6 Product Marketing 3 Wireless 3 Semiconductors 2 CRM 2 Telecommunications 27 Cross-functional Team... 11 Strategic Partnerships 7 Program Management 6 Strategy 6 Product Marketing 3 Wireless 3 Semiconductors 2 CRM 2 Telecommunications                   Education Arizona State University MBA 1999 Penn State University BS,  Finance 1988  – 1992 Activities and Societies:  Delta Sigma Pi Business Fraternity AI DuPont Arizona State University MBA 1999 Arizona State University MBA 1999 Arizona State University MBA 1999 Penn State University BS,  Finance 1988  – 1992 Activities and Societies:  Delta Sigma Pi Business Fraternity Penn State University BS,  Finance 1988  – 1992 Activities and Societies:  Delta Sigma Pi Business Fraternity Penn State University BS,  Finance 1988  – 1992 Activities and Societies:  Delta Sigma Pi Business Fraternity AI DuPont AI DuPont AI DuPont Honors & Awards ", "Experience Supply Chain Manager, Electronic Materials Sun Chemical November 2010  – Present (4 years 10 months) Project Manager, Medicare IT Development (Contractor) Medco Health Solutions February 2010  –  August 2010  (7 months) Supply Chain NPI Program Manager Motorola - Home & Networks Mobility March 2008  –  June 2009  (1 year 4 months) Operations Program Manager Intel Corporation June 1999  –  February 2008  (8 years 9 months) (Open) 1 recommendation Pablo De Paulis Engineering Manager at Dialogic Mike coordinated all aspects of new and legacy product operations/ manufacturing while I managed the project aspects for the products.\nWe worked together for several years on a couple of projects; I was always very well impressed with Mike's... View Corporate Purchasing Manager Dialogic Corporation October 1993  –  June 1999  (5 years 9 months) (Open) 1 recommendation Ralph Schmitt CEO at OCZ Storage Solutions - A Toshiba Group Company As a supplier that Mike managed, we always felt that he was very straighforward and open with the appropriate information for us to successfully work together. His frank approach, professionalism and positive attitude help us to meet the needs of... View Manager, Component Procurement & Quality Unisys Corporation September 1977  –  June 1992  (14 years 10 months) Supply Chain Manager, Electronic Materials Sun Chemical November 2010  – Present (4 years 10 months) Supply Chain Manager, Electronic Materials Sun Chemical November 2010  – Present (4 years 10 months) Project Manager, Medicare IT Development (Contractor) Medco Health Solutions February 2010  –  August 2010  (7 months) Project Manager, Medicare IT Development (Contractor) Medco Health Solutions February 2010  –  August 2010  (7 months) Supply Chain NPI Program Manager Motorola - Home & Networks Mobility March 2008  –  June 2009  (1 year 4 months) Supply Chain NPI Program Manager Motorola - Home & Networks Mobility March 2008  –  June 2009  (1 year 4 months) Operations Program Manager Intel Corporation June 1999  –  February 2008  (8 years 9 months) (Open) 1 recommendation Pablo De Paulis Engineering Manager at Dialogic Mike coordinated all aspects of new and legacy product operations/ manufacturing while I managed the project aspects for the products.\nWe worked together for several years on a couple of projects; I was always very well impressed with Mike's... View Operations Program Manager Intel Corporation June 1999  –  February 2008  (8 years 9 months) (Open) 1 recommendation Pablo De Paulis Engineering Manager at Dialogic Mike coordinated all aspects of new and legacy product operations/ manufacturing while I managed the project aspects for the products.\nWe worked together for several years on a couple of projects; I was always very well impressed with Mike's... View Corporate Purchasing Manager Dialogic Corporation October 1993  –  June 1999  (5 years 9 months) (Open) 1 recommendation Ralph Schmitt CEO at OCZ Storage Solutions - A Toshiba Group Company As a supplier that Mike managed, we always felt that he was very straighforward and open with the appropriate information for us to successfully work together. His frank approach, professionalism and positive attitude help us to meet the needs of... View Corporate Purchasing Manager Dialogic Corporation October 1993  –  June 1999  (5 years 9 months) (Open) 1 recommendation Ralph Schmitt CEO at OCZ Storage Solutions - A Toshiba Group Company As a supplier that Mike managed, we always felt that he was very straighforward and open with the appropriate information for us to successfully work together. His frank approach, professionalism and positive attitude help us to meet the needs of... View Manager, Component Procurement & Quality Unisys Corporation September 1977  –  June 1992  (14 years 10 months) Manager, Component Procurement & Quality Unisys Corporation September 1977  –  June 1992  (14 years 10 months) Skills Top Skills 33 Manufacturing 32 Supply Chain 14 Procurement 13 Cross-functional Team... 13 Product Development 10 Six Sigma 9 Process Improvement 9 Continuous Improvement 9 Purchasing 6 MRP Mike also knows about... 6 Program Management 6 ISO 6 Strategic Sourcing 5 Supply Chain Management 5 Product Management 5 Electronics 5 Supply Management 5 Quality Management 4 Process Engineering 4 Lean Manufacturing 4 DMAIC 3 Root Cause Analysis 3 Materials Management 3 Kaizen 2 SPC 2 Operational Excellence See 1+     See less Skills  Top Skills 33 Manufacturing 32 Supply Chain 14 Procurement 13 Cross-functional Team... 13 Product Development 10 Six Sigma 9 Process Improvement 9 Continuous Improvement 9 Purchasing 6 MRP Mike also knows about... 6 Program Management 6 ISO 6 Strategic Sourcing 5 Supply Chain Management 5 Product Management 5 Electronics 5 Supply Management 5 Quality Management 4 Process Engineering 4 Lean Manufacturing 4 DMAIC 3 Root Cause Analysis 3 Materials Management 3 Kaizen 2 SPC 2 Operational Excellence See 1+     See less Top Skills 33 Manufacturing 32 Supply Chain 14 Procurement 13 Cross-functional Team... 13 Product Development 10 Six Sigma 9 Process Improvement 9 Continuous Improvement 9 Purchasing 6 MRP Mike also knows about... 6 Program Management 6 ISO 6 Strategic Sourcing 5 Supply Chain Management 5 Product Management 5 Electronics 5 Supply Management 5 Quality Management 4 Process Engineering 4 Lean Manufacturing 4 DMAIC 3 Root Cause Analysis 3 Materials Management 3 Kaizen 2 SPC 2 Operational Excellence See 1+     See less Top Skills 33 Manufacturing 32 Supply Chain 14 Procurement 13 Cross-functional Team... 13 Product Development 10 Six Sigma 9 Process Improvement 9 Continuous Improvement 9 Purchasing 6 MRP Mike also knows about... 6 Program Management 6 ISO 6 Strategic Sourcing 5 Supply Chain Management 5 Product Management 5 Electronics 5 Supply Management 5 Quality Management 4 Process Engineering 4 Lean Manufacturing 4 DMAIC 3 Root Cause Analysis 3 Materials Management 3 Kaizen 2 SPC 2 Operational Excellence See 1+     See less                     6 Program Management 6 ISO 6 Strategic Sourcing 5 Supply Chain Management 5 Product Management 5 Electronics 5 Supply Management 5 Quality Management 4 Process Engineering 4 Lean Manufacturing 4 DMAIC 3 Root Cause Analysis 3 Materials Management 3 Kaizen 2 SPC 2 Operational Excellence Education Kean University Kean University Kean University Kean University ", "Summary I am an experienced and versatile I.T. Manager having worked in the industry for 25 years, mostly served in an I.T. Operations, Infrastructure and Service Delivery roles. I have developed skills in managing local, regional and globally dispersed teams, project & program management, vendor and supplier management, strategic technical planning and implementations. I have specialized in Server, Backup and Storage technologies, as well as Sarbanes-Oxley compliance and implementing the ITIL framework. \n \nI have been actively involved with ITIL for 10 years, having taken the Foundation in 2004 and the ITIL Service Manager V2 certification in 2008. My last four roles have had an ITIL focus. At Intel, I implemented Incident & Problem management across a global Operations function; set up a Service Desk and Change Management function within Uniphar; as a Service Manager for a managed services contract in IBM; as Service Support Manager in LeasePlan I was responsible for Incident, Problem, Change and Request Fulfilment processes and the Global Service Desk.  \n \nWhen I left Intel in 2007, I took the opportunity to take a year out. \n \nSpecialties: People Management \nITIL process and implementation \nI.T. Operations management \nService Delivery Management \nProgram/Project Management \nStrategic Technical planning \nVendor Management \nCommunications and Cultural diversity Summary I am an experienced and versatile I.T. Manager having worked in the industry for 25 years, mostly served in an I.T. Operations, Infrastructure and Service Delivery roles. I have developed skills in managing local, regional and globally dispersed teams, project & program management, vendor and supplier management, strategic technical planning and implementations. I have specialized in Server, Backup and Storage technologies, as well as Sarbanes-Oxley compliance and implementing the ITIL framework. \n \nI have been actively involved with ITIL for 10 years, having taken the Foundation in 2004 and the ITIL Service Manager V2 certification in 2008. My last four roles have had an ITIL focus. At Intel, I implemented Incident & Problem management across a global Operations function; set up a Service Desk and Change Management function within Uniphar; as a Service Manager for a managed services contract in IBM; as Service Support Manager in LeasePlan I was responsible for Incident, Problem, Change and Request Fulfilment processes and the Global Service Desk.  \n \nWhen I left Intel in 2007, I took the opportunity to take a year out. \n \nSpecialties: People Management \nITIL process and implementation \nI.T. Operations management \nService Delivery Management \nProgram/Project Management \nStrategic Technical planning \nVendor Management \nCommunications and Cultural diversity I am an experienced and versatile I.T. Manager having worked in the industry for 25 years, mostly served in an I.T. Operations, Infrastructure and Service Delivery roles. I have developed skills in managing local, regional and globally dispersed teams, project & program management, vendor and supplier management, strategic technical planning and implementations. I have specialized in Server, Backup and Storage technologies, as well as Sarbanes-Oxley compliance and implementing the ITIL framework. \n \nI have been actively involved with ITIL for 10 years, having taken the Foundation in 2004 and the ITIL Service Manager V2 certification in 2008. My last four roles have had an ITIL focus. At Intel, I implemented Incident & Problem management across a global Operations function; set up a Service Desk and Change Management function within Uniphar; as a Service Manager for a managed services contract in IBM; as Service Support Manager in LeasePlan I was responsible for Incident, Problem, Change and Request Fulfilment processes and the Global Service Desk.  \n \nWhen I left Intel in 2007, I took the opportunity to take a year out. \n \nSpecialties: People Management \nITIL process and implementation \nI.T. Operations management \nService Delivery Management \nProgram/Project Management \nStrategic Technical planning \nVendor Management \nCommunications and Cultural diversity I am an experienced and versatile I.T. Manager having worked in the industry for 25 years, mostly served in an I.T. Operations, Infrastructure and Service Delivery roles. I have developed skills in managing local, regional and globally dispersed teams, project & program management, vendor and supplier management, strategic technical planning and implementations. I have specialized in Server, Backup and Storage technologies, as well as Sarbanes-Oxley compliance and implementing the ITIL framework. \n \nI have been actively involved with ITIL for 10 years, having taken the Foundation in 2004 and the ITIL Service Manager V2 certification in 2008. My last four roles have had an ITIL focus. At Intel, I implemented Incident & Problem management across a global Operations function; set up a Service Desk and Change Management function within Uniphar; as a Service Manager for a managed services contract in IBM; as Service Support Manager in LeasePlan I was responsible for Incident, Problem, Change and Request Fulfilment processes and the Global Service Desk.  \n \nWhen I left Intel in 2007, I took the opportunity to take a year out. \n \nSpecialties: People Management \nITIL process and implementation \nI.T. Operations management \nService Delivery Management \nProgram/Project Management \nStrategic Technical planning \nVendor Management \nCommunications and Cultural diversity Experience Problem Manager Symantec March 2015  – Present (6 months) Ballycoolin, Dublin 15 Working as part of the Service Management Office, I am responsible for managing the daily lifecycle of the Problem Management process. Working with both internal/external IT groups, ensuring PM process is implemented and followed. As this is a relatively immature process, this requires constant monitoring, coaching and escalation to ensure process adoption.  \n \nEstablished basic problem management operations, implemented PM audit and criteria, developed and delivered training package for vendors and suppliers on the PM process. \nService Now Trainer / Subject matter expert for the Dublin office (and EMEA).  \n Incident Commander Symantec March 2014  –  February 2015  (1 year) Dublin 15 Managed all high priority and Major Incidents within Symantec IT infrastructure and applications, from initial occurrence to resolution through Webex war room bridges ensuring Incident Management process is followed.  \n• Utilized service management best practices to support affected business units by managing, directing, coordinating and communicating across multiple technical and non-technical teams which include application, infrastructure, third party suppliers, and business units.  \n• Developed Incident Commander resource model to forecast IC resources required as the company “insourced” more Incident management and ownership of infrastructure.  \n Service Support Manager LeasePlan Information Services May 2013  –  January 2014  (9 months) Leopardstown, Dublin 18 Service Support Manager (Contract) \n•\tReporting to Operations Director, I managed 4 teams across Service Support, including Global Service Desk, Corporate HQ Service Desk (Almere, Holland), Messaging and Mobility Operations and Service Quality Information. Member of Extended Management Team. \n•\tGlobal process manager for Incident, Change, Problem and request fulfillment.. Service Manager (Contract) IBM Global Services November 2010  –  April 2012  (1 year 6 months) Ballycoolin, Dublin 15 •\tIBM provide ITIL compliant managed services for server, storage and backup systems to a global pharmaceutical organization (Novartis). I was responsible for two business critical applications within the account, acting as the single point of contact, both client-facing to the customer and within IBM. IT Service Delivery Manager Uniphar PLC June 2008  –  February 2010  (1 year 9 months) City West, Co. Dublin •\tInitially employed to establish a Service Desk function and implement basic ITIL processes (Incident, Problem and Change Management). \n•\tImplemented new ITIL compliant Service Desk call management tool (Manage Engine Service Desk Plus). Established SLAs and indicator reporting package.  \n•\tThe role expanded to include Service Delivery management, primarily responsible for managing all key IT vendors and suppliers (e.g. IBM, Eircom, Vodafone, Microsoft licensing), smaller 3rd party service providers (PC Supply, Network Management, VMWare and Server support, Printing services). Global Operations Manager (Backup & Recovery) Intel Corporation August 2004  –  February 2007  (2 years 7 months) •\tManaged a global team of operational engineers providing 2nd/3rd level support for Intel's global infrastructure, primarily the storage and backup of data. Responsible for successful backup and recovery of business critical systems (SAP, Manufacturing Applications), email infrastructure, general shared data, web servers (Approx 5,000 servers, 40K backup jobs/week, 300 Terabytes/week). Also provided backup capability for 50,000 laptops. Global Operations Program Manager Intel Corporation February 2002  –  August 2004  (2 years 7 months) •\tResponsible for program management within the Global Infrastructure Services group.  \n•\tPrograms included Sarbanes-Oxley (SOX) compliance (using COBIT), Asset Management implementation (European lead within global program), global upgrade of Veritas backup software.  \n \nManaged the start up of a European Regional Operations Service Center. Aggressive recruitment schedule to meet start up targets. Implemented follow the sun 2nd level support for Storage, Backup & Recovery, Messaging, Web based SQL applications and Security. GER Server Operations Integration Manager Intel Corporation October 1998  –  February 2002  (3 years 5 months) •\tReporting directly to Greater Europe Region Operations manager, responsible for programs within the European region. These included migration of server infrastructure from UK to Ireland, Year 2000 rollover preparation, integrating newly acquired Mergers & Acquisitions across Europe into Intel's standard infrastructure. EMEA Server Operations Manager Intel Corporation November 1993  –  October 1998  (5 years) •\tResponsible for Operations support of Intel's installed server base across the EMEA region. Based in Swindon, UK.  \n•\tManaged a team of 6 providing support for Banyan, Lotus Notes, cc:mail, Unix, Data Warehouse systems. Managed conversion of entire server infrastructure from Banyan to Windows NT. Achieved ISO9002 certification for the group in 1996. (Open) 1 recommendation Graham M Dean Regional Manager at SoftwareONE Currently, I work in Australia, and even here, there are people who got their best starting working under Andy. I was lucky enough to work with Andy at more than one company over a number of years. Consistent both then and now has been his passion... View Problem Manager Symantec March 2015  – Present (6 months) Ballycoolin, Dublin 15 Working as part of the Service Management Office, I am responsible for managing the daily lifecycle of the Problem Management process. Working with both internal/external IT groups, ensuring PM process is implemented and followed. As this is a relatively immature process, this requires constant monitoring, coaching and escalation to ensure process adoption.  \n \nEstablished basic problem management operations, implemented PM audit and criteria, developed and delivered training package for vendors and suppliers on the PM process. \nService Now Trainer / Subject matter expert for the Dublin office (and EMEA).  \n Problem Manager Symantec March 2015  – Present (6 months) Ballycoolin, Dublin 15 Working as part of the Service Management Office, I am responsible for managing the daily lifecycle of the Problem Management process. Working with both internal/external IT groups, ensuring PM process is implemented and followed. As this is a relatively immature process, this requires constant monitoring, coaching and escalation to ensure process adoption.  \n \nEstablished basic problem management operations, implemented PM audit and criteria, developed and delivered training package for vendors and suppliers on the PM process. \nService Now Trainer / Subject matter expert for the Dublin office (and EMEA).  \n Incident Commander Symantec March 2014  –  February 2015  (1 year) Dublin 15 Managed all high priority and Major Incidents within Symantec IT infrastructure and applications, from initial occurrence to resolution through Webex war room bridges ensuring Incident Management process is followed.  \n• Utilized service management best practices to support affected business units by managing, directing, coordinating and communicating across multiple technical and non-technical teams which include application, infrastructure, third party suppliers, and business units.  \n• Developed Incident Commander resource model to forecast IC resources required as the company “insourced” more Incident management and ownership of infrastructure.  \n Incident Commander Symantec March 2014  –  February 2015  (1 year) Dublin 15 Managed all high priority and Major Incidents within Symantec IT infrastructure and applications, from initial occurrence to resolution through Webex war room bridges ensuring Incident Management process is followed.  \n• Utilized service management best practices to support affected business units by managing, directing, coordinating and communicating across multiple technical and non-technical teams which include application, infrastructure, third party suppliers, and business units.  \n• Developed Incident Commander resource model to forecast IC resources required as the company “insourced” more Incident management and ownership of infrastructure.  \n Service Support Manager LeasePlan Information Services May 2013  –  January 2014  (9 months) Leopardstown, Dublin 18 Service Support Manager (Contract) \n•\tReporting to Operations Director, I managed 4 teams across Service Support, including Global Service Desk, Corporate HQ Service Desk (Almere, Holland), Messaging and Mobility Operations and Service Quality Information. Member of Extended Management Team. \n•\tGlobal process manager for Incident, Change, Problem and request fulfillment.. Service Support Manager LeasePlan Information Services May 2013  –  January 2014  (9 months) Leopardstown, Dublin 18 Service Support Manager (Contract) \n•\tReporting to Operations Director, I managed 4 teams across Service Support, including Global Service Desk, Corporate HQ Service Desk (Almere, Holland), Messaging and Mobility Operations and Service Quality Information. Member of Extended Management Team. \n•\tGlobal process manager for Incident, Change, Problem and request fulfillment.. Service Manager (Contract) IBM Global Services November 2010  –  April 2012  (1 year 6 months) Ballycoolin, Dublin 15 •\tIBM provide ITIL compliant managed services for server, storage and backup systems to a global pharmaceutical organization (Novartis). I was responsible for two business critical applications within the account, acting as the single point of contact, both client-facing to the customer and within IBM. Service Manager (Contract) IBM Global Services November 2010  –  April 2012  (1 year 6 months) Ballycoolin, Dublin 15 •\tIBM provide ITIL compliant managed services for server, storage and backup systems to a global pharmaceutical organization (Novartis). I was responsible for two business critical applications within the account, acting as the single point of contact, both client-facing to the customer and within IBM. IT Service Delivery Manager Uniphar PLC June 2008  –  February 2010  (1 year 9 months) City West, Co. Dublin •\tInitially employed to establish a Service Desk function and implement basic ITIL processes (Incident, Problem and Change Management). \n•\tImplemented new ITIL compliant Service Desk call management tool (Manage Engine Service Desk Plus). Established SLAs and indicator reporting package.  \n•\tThe role expanded to include Service Delivery management, primarily responsible for managing all key IT vendors and suppliers (e.g. IBM, Eircom, Vodafone, Microsoft licensing), smaller 3rd party service providers (PC Supply, Network Management, VMWare and Server support, Printing services). IT Service Delivery Manager Uniphar PLC June 2008  –  February 2010  (1 year 9 months) City West, Co. Dublin •\tInitially employed to establish a Service Desk function and implement basic ITIL processes (Incident, Problem and Change Management). \n•\tImplemented new ITIL compliant Service Desk call management tool (Manage Engine Service Desk Plus). Established SLAs and indicator reporting package.  \n•\tThe role expanded to include Service Delivery management, primarily responsible for managing all key IT vendors and suppliers (e.g. IBM, Eircom, Vodafone, Microsoft licensing), smaller 3rd party service providers (PC Supply, Network Management, VMWare and Server support, Printing services). Global Operations Manager (Backup & Recovery) Intel Corporation August 2004  –  February 2007  (2 years 7 months) •\tManaged a global team of operational engineers providing 2nd/3rd level support for Intel's global infrastructure, primarily the storage and backup of data. Responsible for successful backup and recovery of business critical systems (SAP, Manufacturing Applications), email infrastructure, general shared data, web servers (Approx 5,000 servers, 40K backup jobs/week, 300 Terabytes/week). Also provided backup capability for 50,000 laptops. Global Operations Manager (Backup & Recovery) Intel Corporation August 2004  –  February 2007  (2 years 7 months) •\tManaged a global team of operational engineers providing 2nd/3rd level support for Intel's global infrastructure, primarily the storage and backup of data. Responsible for successful backup and recovery of business critical systems (SAP, Manufacturing Applications), email infrastructure, general shared data, web servers (Approx 5,000 servers, 40K backup jobs/week, 300 Terabytes/week). Also provided backup capability for 50,000 laptops. Global Operations Program Manager Intel Corporation February 2002  –  August 2004  (2 years 7 months) •\tResponsible for program management within the Global Infrastructure Services group.  \n•\tPrograms included Sarbanes-Oxley (SOX) compliance (using COBIT), Asset Management implementation (European lead within global program), global upgrade of Veritas backup software.  \n \nManaged the start up of a European Regional Operations Service Center. Aggressive recruitment schedule to meet start up targets. Implemented follow the sun 2nd level support for Storage, Backup & Recovery, Messaging, Web based SQL applications and Security. Global Operations Program Manager Intel Corporation February 2002  –  August 2004  (2 years 7 months) •\tResponsible for program management within the Global Infrastructure Services group.  \n•\tPrograms included Sarbanes-Oxley (SOX) compliance (using COBIT), Asset Management implementation (European lead within global program), global upgrade of Veritas backup software.  \n \nManaged the start up of a European Regional Operations Service Center. Aggressive recruitment schedule to meet start up targets. Implemented follow the sun 2nd level support for Storage, Backup & Recovery, Messaging, Web based SQL applications and Security. GER Server Operations Integration Manager Intel Corporation October 1998  –  February 2002  (3 years 5 months) •\tReporting directly to Greater Europe Region Operations manager, responsible for programs within the European region. These included migration of server infrastructure from UK to Ireland, Year 2000 rollover preparation, integrating newly acquired Mergers & Acquisitions across Europe into Intel's standard infrastructure. GER Server Operations Integration Manager Intel Corporation October 1998  –  February 2002  (3 years 5 months) •\tReporting directly to Greater Europe Region Operations manager, responsible for programs within the European region. These included migration of server infrastructure from UK to Ireland, Year 2000 rollover preparation, integrating newly acquired Mergers & Acquisitions across Europe into Intel's standard infrastructure. EMEA Server Operations Manager Intel Corporation November 1993  –  October 1998  (5 years) •\tResponsible for Operations support of Intel's installed server base across the EMEA region. Based in Swindon, UK.  \n•\tManaged a team of 6 providing support for Banyan, Lotus Notes, cc:mail, Unix, Data Warehouse systems. Managed conversion of entire server infrastructure from Banyan to Windows NT. Achieved ISO9002 certification for the group in 1996. (Open) 1 recommendation Graham M Dean Regional Manager at SoftwareONE Currently, I work in Australia, and even here, there are people who got their best starting working under Andy. I was lucky enough to work with Andy at more than one company over a number of years. Consistent both then and now has been his passion... View EMEA Server Operations Manager Intel Corporation November 1993  –  October 1998  (5 years) •\tResponsible for Operations support of Intel's installed server base across the EMEA region. Based in Swindon, UK.  \n•\tManaged a team of 6 providing support for Banyan, Lotus Notes, cc:mail, Unix, Data Warehouse systems. Managed conversion of entire server infrastructure from Banyan to Windows NT. Achieved ISO9002 certification for the group in 1996. (Open) 1 recommendation Graham M Dean Regional Manager at SoftwareONE Currently, I work in Australia, and even here, there are people who got their best starting working under Andy. I was lucky enough to work with Andy at more than one company over a number of years. Consistent both then and now has been his passion... View Skills Top Skills 36 ITIL 29 IT Service Management 26 Service Delivery 16 IT Management 15 IT Strategy 15 Vendor Management 11 Servers 11 Management 10 Information Technology 8 Infrastructure Andy also knows about... 8 Program Management 7 Service Management 6 Business Process 5 Service Desk 4 Sla 4 VMware 3 People Management 2 IT Operations 2 Change Management 2 Managed Services Skills  Top Skills 36 ITIL 29 IT Service Management 26 Service Delivery 16 IT Management 15 IT Strategy 15 Vendor Management 11 Servers 11 Management 10 Information Technology 8 Infrastructure Andy also knows about... 8 Program Management 7 Service Management 6 Business Process 5 Service Desk 4 Sla 4 VMware 3 People Management 2 IT Operations 2 Change Management 2 Managed Services Top Skills 36 ITIL 29 IT Service Management 26 Service Delivery 16 IT Management 15 IT Strategy 15 Vendor Management 11 Servers 11 Management 10 Information Technology 8 Infrastructure Andy also knows about... 8 Program Management 7 Service Management 6 Business Process 5 Service Desk 4 Sla 4 VMware 3 People Management 2 IT Operations 2 Change Management 2 Managed Services Top Skills 36 ITIL 29 IT Service Management 26 Service Delivery 16 IT Management 15 IT Strategy 15 Vendor Management 11 Servers 11 Management 10 Information Technology 8 Infrastructure Andy also knows about... 8 Program Management 7 Service Management 6 Business Process 5 Service Desk 4 Sla 4 VMware 3 People Management 2 IT Operations 2 Change Management 2 Managed Services                     8 Program Management 7 Service Management 6 Business Process 5 Service Desk 4 Sla 4 VMware 3 People Management 2 IT Operations 2 Change Management 2 Managed Services Education Hreod Burna 1977  – 1981 Hreod Burna 1977  – 1981 Hreod Burna 1977  – 1981 Hreod Burna 1977  – 1981 ", "Skills Top Skills 21 Program Management 15 Cross-functional Team... 12 Product Management 10 Intel 9 Strategy 8 Product Marketing 8 Team Leadership 6 Analytics 5 Marketing 5 Project Planning Lane also knows about... 4 Social Media 4 Social Media Marketing 4 Start-ups 4 Operations Management 3 Strategic Planning 3 Project Management 3 Strategic Partnerships 3 Business Strategy 2 Software Project... 2 Agile Methodologies 2 SaaS 2 Customer Service 1 Budgets 1 Product Launch 0 WordPress 0 Reporting & Analysis 0 Scrum 0 Project Delivery 0 Metrics 0 Budget Forecasts 0 Google Analytics 0 ana 0 Event Planning 0 Project Finance 0 Jive SBS 0 New Business Development See 11+     See less Skills  Top Skills 21 Program Management 15 Cross-functional Team... 12 Product Management 10 Intel 9 Strategy 8 Product Marketing 8 Team Leadership 6 Analytics 5 Marketing 5 Project Planning Lane also knows about... 4 Social Media 4 Social Media Marketing 4 Start-ups 4 Operations Management 3 Strategic Planning 3 Project Management 3 Strategic Partnerships 3 Business Strategy 2 Software Project... 2 Agile Methodologies 2 SaaS 2 Customer Service 1 Budgets 1 Product Launch 0 WordPress 0 Reporting & Analysis 0 Scrum 0 Project Delivery 0 Metrics 0 Budget Forecasts 0 Google Analytics 0 ana 0 Event Planning 0 Project Finance 0 Jive SBS 0 New Business Development See 11+     See less Top Skills 21 Program Management 15 Cross-functional Team... 12 Product Management 10 Intel 9 Strategy 8 Product Marketing 8 Team Leadership 6 Analytics 5 Marketing 5 Project Planning Lane also knows about... 4 Social Media 4 Social Media Marketing 4 Start-ups 4 Operations Management 3 Strategic Planning 3 Project Management 3 Strategic Partnerships 3 Business Strategy 2 Software Project... 2 Agile Methodologies 2 SaaS 2 Customer Service 1 Budgets 1 Product Launch 0 WordPress 0 Reporting & Analysis 0 Scrum 0 Project Delivery 0 Metrics 0 Budget Forecasts 0 Google Analytics 0 ana 0 Event Planning 0 Project Finance 0 Jive SBS 0 New Business Development See 11+     See less Top Skills 21 Program Management 15 Cross-functional Team... 12 Product Management 10 Intel 9 Strategy 8 Product Marketing 8 Team Leadership 6 Analytics 5 Marketing 5 Project Planning Lane also knows about... 4 Social Media 4 Social Media Marketing 4 Start-ups 4 Operations Management 3 Strategic Planning 3 Project Management 3 Strategic Partnerships 3 Business Strategy 2 Software Project... 2 Agile Methodologies 2 SaaS 2 Customer Service 1 Budgets 1 Product Launch 0 WordPress 0 Reporting & Analysis 0 Scrum 0 Project Delivery 0 Metrics 0 Budget Forecasts 0 Google Analytics 0 ana 0 Event Planning 0 Project Finance 0 Jive SBS 0 New Business Development See 11+     See less                     4 Social Media 4 Social Media Marketing 4 Start-ups 4 Operations Management 3 Strategic Planning 3 Project Management 3 Strategic Partnerships 3 Business Strategy 2 Software Project... 2 Agile Methodologies 2 SaaS 2 Customer Service 1 Budgets 1 Product Launch 0 WordPress 0 Reporting & Analysis 0 Scrum 0 Project Delivery 0 Metrics 0 Budget Forecasts 0 Google Analytics 0 ana 0 Event Planning 0 Project Finance 0 Jive SBS 0 New Business Development ", "Summary Sr. Manager offering extensive experiences in strategic planning, program management, process improvement, and marketing \n \nForward-looking and result-oriented team builder with strong ability to collaborate, influence, communicate, and lead \n \nExcellent skills in Excel, PowerPoint, Lean/Agile development process. Certified ScrumMaster (CSM) \n \n \nSpecialties:  \n• Program and Project Management• Agile Scrum Development • Process Improvement \n• Strategic Planning • Budget and Resource Planning • Requirement Analysis \n• Marketing Strategy • Customer Success • Cross-Functional Team Leadership Summary Sr. Manager offering extensive experiences in strategic planning, program management, process improvement, and marketing \n \nForward-looking and result-oriented team builder with strong ability to collaborate, influence, communicate, and lead \n \nExcellent skills in Excel, PowerPoint, Lean/Agile development process. Certified ScrumMaster (CSM) \n \n \nSpecialties:  \n• Program and Project Management• Agile Scrum Development • Process Improvement \n• Strategic Planning • Budget and Resource Planning • Requirement Analysis \n• Marketing Strategy • Customer Success • Cross-Functional Team Leadership Sr. Manager offering extensive experiences in strategic planning, program management, process improvement, and marketing \n \nForward-looking and result-oriented team builder with strong ability to collaborate, influence, communicate, and lead \n \nExcellent skills in Excel, PowerPoint, Lean/Agile development process. Certified ScrumMaster (CSM) \n \n \nSpecialties:  \n• Program and Project Management• Agile Scrum Development • Process Improvement \n• Strategic Planning • Budget and Resource Planning • Requirement Analysis \n• Marketing Strategy • Customer Success • Cross-Functional Team Leadership Sr. Manager offering extensive experiences in strategic planning, program management, process improvement, and marketing \n \nForward-looking and result-oriented team builder with strong ability to collaborate, influence, communicate, and lead \n \nExcellent skills in Excel, PowerPoint, Lean/Agile development process. Certified ScrumMaster (CSM) \n \n \nSpecialties:  \n• Program and Project Management• Agile Scrum Development • Process Improvement \n• Strategic Planning • Budget and Resource Planning • Requirement Analysis \n• Marketing Strategy • Customer Success • Cross-Functional Team Leadership Experience Senior Manager, Program Management ARRIS 2014  – Present (1 year) Portland, Oregon Area Strategic Planning Manager Intel Corporation 2012  –  2013  (1 year) PC Client Group Business Operations Program Manager Intel Corporation 2010  –  2012  (2 years) Data Center and Server Group (Open) 1 recommendation Bruce Waldvogel CSIG CSE Manufacturing and Ops Manager at Intel Corporation Raye engaged in the Lean by being the lead in a Kaizen event to optimize a technical process. The results of the Kaizen and post Kaizen work she did helped to trip 10% off of the existing process and optimize if further. View Customer Marketing Program Manager Intel Corporation 2005  –  2010  (5 years) Wireless Networking Group (Open) 2 recommendations Dave Hofer, CFA Principal at Brightwood Ventures, LLC Raye has a proven track record across all aspects of customer marketing. She excels at strategy development, timely... View Ying Deng HR Organizational Consultant at Intel Corporation Raye demonstrates strategic thinking ability that uses global perspective of industry and related trends. She paints simple... View Product Marketing Manager Intel Corporation 2001  –  2005  (4 years) Sale and Marketing Group Senior Manager, Program Management ARRIS 2014  – Present (1 year) Portland, Oregon Area Senior Manager, Program Management ARRIS 2014  – Present (1 year) Portland, Oregon Area Strategic Planning Manager Intel Corporation 2012  –  2013  (1 year) PC Client Group Strategic Planning Manager Intel Corporation 2012  –  2013  (1 year) PC Client Group Business Operations Program Manager Intel Corporation 2010  –  2012  (2 years) Data Center and Server Group (Open) 1 recommendation Bruce Waldvogel CSIG CSE Manufacturing and Ops Manager at Intel Corporation Raye engaged in the Lean by being the lead in a Kaizen event to optimize a technical process. The results of the Kaizen and post Kaizen work she did helped to trip 10% off of the existing process and optimize if further. View Business Operations Program Manager Intel Corporation 2010  –  2012  (2 years) Data Center and Server Group (Open) 1 recommendation Bruce Waldvogel CSIG CSE Manufacturing and Ops Manager at Intel Corporation Raye engaged in the Lean by being the lead in a Kaizen event to optimize a technical process. The results of the Kaizen and post Kaizen work she did helped to trip 10% off of the existing process and optimize if further. View Customer Marketing Program Manager Intel Corporation 2005  –  2010  (5 years) Wireless Networking Group (Open) 2 recommendations Dave Hofer, CFA Principal at Brightwood Ventures, LLC Raye has a proven track record across all aspects of customer marketing. She excels at strategy development, timely... View Ying Deng HR Organizational Consultant at Intel Corporation Raye demonstrates strategic thinking ability that uses global perspective of industry and related trends. She paints simple... View Customer Marketing Program Manager Intel Corporation 2005  –  2010  (5 years) Wireless Networking Group (Open) 2 recommendations Dave Hofer, CFA Principal at Brightwood Ventures, LLC Raye has a proven track record across all aspects of customer marketing. She excels at strategy development, timely... View Ying Deng HR Organizational Consultant at Intel Corporation Raye demonstrates strategic thinking ability that uses global perspective of industry and related trends. She paints simple... View Product Marketing Manager Intel Corporation 2001  –  2005  (4 years) Sale and Marketing Group Product Marketing Manager Intel Corporation 2001  –  2005  (4 years) Sale and Marketing Group Languages   Skills Skills     Education University of Washington Master of Business Administration (MBA) 2010  – 2012 Oklahoma City University Master of Science (M.S.),  Computer Science University of Washington Master of Business Administration (MBA) 2010  – 2012 University of Washington Master of Business Administration (MBA) 2010  – 2012 University of Washington Master of Business Administration (MBA) 2010  – 2012 Oklahoma City University Master of Science (M.S.),  Computer Science Oklahoma City University Master of Science (M.S.),  Computer Science Oklahoma City University Master of Science (M.S.),  Computer Science Honors & Awards ", "Experience Operations Program Manager Intel Corporation Operations Program Manager Intel Corporation Operations Program Manager Intel Corporation Skills Skills     ", "Experience Engineering Program Manager Intel Corporation May 2014  – Present (1 year 4 months) Hillsboro, Oregon Software Validation Program Manager Intel Corporation May 2013  –  May 2014  (1 year 1 month) Hillsboro, Oregon Job rotation in SW led to full time position as Validation Program Manager. Responsible for 1G/10G ethernet device driver validation, test planning, resource manager, working with Validation leads to prioritize work. Responsible for preparing Cert plans to have all device drivers certified through MSFT WHQL. Coordinated with the NIC development teams to make sure SW had proper hardware to validate on and to stay abreast of changes. Represented Validation interests in platform teams during development of SoC ethernet ingredients and validation.  Engineering Program Manager Intel Corporation July 2003  –  May 2013  (9 years 11 months) Hillsboro, Oregon Job relocation to Oregon as Operations Program Manager, responsible to represent Operations in product development teams for consumer media center reference design platforms. Responsible for team of manufacturing, test, materials, quality to support local prototype builds and ensure high volume manufacturability.  \n \n2005 - 2006: Outsource Program Manager. Worked with Global Outsourcing group, responsible to work with Intel server platform groups to manage their NPI builds at California based contract manufacturers.  \n \n2006 - 2012: Engineering Program Manager in LAN Network Operation. Responsible to lead product development teams to development and productize network adapters (NICS). Responsible for team of Operations and Engineering.  \n \nTook interest in workings of Software and driver development and did a job rotation in Software group as Software Validation Program Manager.  NPI Manufacturing Engineer/Operations Program Manager Intel Corporation June 2000  –  July 2003  (3 years 2 months) Santa Clara, California Responsible to work with new product development team on cable modem products. I owned design for manufacturability, working with local prototype board assembly shops, Bill-of-Material (BOM) control and BOM scrubs. Wore many hats - in addition to ME, I worked as materials program manager and operations program manager. Was promoted to Operations Program Manager full time.  Sr. Manufacturing Engineer Autecs, Inc. (Robert Bosch Corp.) 2000  –  2003  (3 years) Led team of manufacturing engineers responsible for circuit board and unit assembly of engine control and transmission control modules for automotive customers. Led production capacity expansion project involving new equipment specifiation, procurement and bring-up. Sr. Manufacturing Engineer NCR/ATT&T GIS June 1987  –  December 1995  (8 years 7 months) SMT process engineer, soldering trainer, new equipment selection, computer system assembly/test, environmental coordinator, EHS representative. Engineering Program Manager Intel Corporation May 2014  – Present (1 year 4 months) Hillsboro, Oregon Engineering Program Manager Intel Corporation May 2014  – Present (1 year 4 months) Hillsboro, Oregon Software Validation Program Manager Intel Corporation May 2013  –  May 2014  (1 year 1 month) Hillsboro, Oregon Job rotation in SW led to full time position as Validation Program Manager. Responsible for 1G/10G ethernet device driver validation, test planning, resource manager, working with Validation leads to prioritize work. Responsible for preparing Cert plans to have all device drivers certified through MSFT WHQL. Coordinated with the NIC development teams to make sure SW had proper hardware to validate on and to stay abreast of changes. Represented Validation interests in platform teams during development of SoC ethernet ingredients and validation.  Software Validation Program Manager Intel Corporation May 2013  –  May 2014  (1 year 1 month) Hillsboro, Oregon Job rotation in SW led to full time position as Validation Program Manager. Responsible for 1G/10G ethernet device driver validation, test planning, resource manager, working with Validation leads to prioritize work. Responsible for preparing Cert plans to have all device drivers certified through MSFT WHQL. Coordinated with the NIC development teams to make sure SW had proper hardware to validate on and to stay abreast of changes. Represented Validation interests in platform teams during development of SoC ethernet ingredients and validation.  Engineering Program Manager Intel Corporation July 2003  –  May 2013  (9 years 11 months) Hillsboro, Oregon Job relocation to Oregon as Operations Program Manager, responsible to represent Operations in product development teams for consumer media center reference design platforms. Responsible for team of manufacturing, test, materials, quality to support local prototype builds and ensure high volume manufacturability.  \n \n2005 - 2006: Outsource Program Manager. Worked with Global Outsourcing group, responsible to work with Intel server platform groups to manage their NPI builds at California based contract manufacturers.  \n \n2006 - 2012: Engineering Program Manager in LAN Network Operation. Responsible to lead product development teams to development and productize network adapters (NICS). Responsible for team of Operations and Engineering.  \n \nTook interest in workings of Software and driver development and did a job rotation in Software group as Software Validation Program Manager.  Engineering Program Manager Intel Corporation July 2003  –  May 2013  (9 years 11 months) Hillsboro, Oregon Job relocation to Oregon as Operations Program Manager, responsible to represent Operations in product development teams for consumer media center reference design platforms. Responsible for team of manufacturing, test, materials, quality to support local prototype builds and ensure high volume manufacturability.  \n \n2005 - 2006: Outsource Program Manager. Worked with Global Outsourcing group, responsible to work with Intel server platform groups to manage their NPI builds at California based contract manufacturers.  \n \n2006 - 2012: Engineering Program Manager in LAN Network Operation. Responsible to lead product development teams to development and productize network adapters (NICS). Responsible for team of Operations and Engineering.  \n \nTook interest in workings of Software and driver development and did a job rotation in Software group as Software Validation Program Manager.  NPI Manufacturing Engineer/Operations Program Manager Intel Corporation June 2000  –  July 2003  (3 years 2 months) Santa Clara, California Responsible to work with new product development team on cable modem products. I owned design for manufacturability, working with local prototype board assembly shops, Bill-of-Material (BOM) control and BOM scrubs. Wore many hats - in addition to ME, I worked as materials program manager and operations program manager. Was promoted to Operations Program Manager full time.  NPI Manufacturing Engineer/Operations Program Manager Intel Corporation June 2000  –  July 2003  (3 years 2 months) Santa Clara, California Responsible to work with new product development team on cable modem products. I owned design for manufacturability, working with local prototype board assembly shops, Bill-of-Material (BOM) control and BOM scrubs. Wore many hats - in addition to ME, I worked as materials program manager and operations program manager. Was promoted to Operations Program Manager full time.  Sr. Manufacturing Engineer Autecs, Inc. (Robert Bosch Corp.) 2000  –  2003  (3 years) Led team of manufacturing engineers responsible for circuit board and unit assembly of engine control and transmission control modules for automotive customers. Led production capacity expansion project involving new equipment specifiation, procurement and bring-up. Sr. Manufacturing Engineer Autecs, Inc. (Robert Bosch Corp.) 2000  –  2003  (3 years) Led team of manufacturing engineers responsible for circuit board and unit assembly of engine control and transmission control modules for automotive customers. Led production capacity expansion project involving new equipment specifiation, procurement and bring-up. Sr. Manufacturing Engineer NCR/ATT&T GIS June 1987  –  December 1995  (8 years 7 months) SMT process engineer, soldering trainer, new equipment selection, computer system assembly/test, environmental coordinator, EHS representative. Sr. Manufacturing Engineer NCR/ATT&T GIS June 1987  –  December 1995  (8 years 7 months) SMT process engineer, soldering trainer, new equipment selection, computer system assembly/test, environmental coordinator, EHS representative. Skills Top Skills 14 Manufacturing 7 Program Management 6 Process Improvement 6 Testing 4 Product Development 4 Engineering 3 Cross-functional Team... 3 Process Simulation 2 Engineering Management 1 Semiconductors Michael also knows about... 1 Manufacturing... 1 FMEA 1 Intel 1 Systems Engineering 1 Automotive 0 Project Management 0 Outsourcing 0 Process Engineering 0 Six Sigma 0 Design of Experiments 0 Lean Manufacturing 0 SPC 0 Continuous Improvement 0 Root Cause Analysis 0 Product Management 0 Electronics See 1+     See less Skills  Top Skills 14 Manufacturing 7 Program Management 6 Process Improvement 6 Testing 4 Product Development 4 Engineering 3 Cross-functional Team... 3 Process Simulation 2 Engineering Management 1 Semiconductors Michael also knows about... 1 Manufacturing... 1 FMEA 1 Intel 1 Systems Engineering 1 Automotive 0 Project Management 0 Outsourcing 0 Process Engineering 0 Six Sigma 0 Design of Experiments 0 Lean Manufacturing 0 SPC 0 Continuous Improvement 0 Root Cause Analysis 0 Product Management 0 Electronics See 1+     See less Top Skills 14 Manufacturing 7 Program Management 6 Process Improvement 6 Testing 4 Product Development 4 Engineering 3 Cross-functional Team... 3 Process Simulation 2 Engineering Management 1 Semiconductors Michael also knows about... 1 Manufacturing... 1 FMEA 1 Intel 1 Systems Engineering 1 Automotive 0 Project Management 0 Outsourcing 0 Process Engineering 0 Six Sigma 0 Design of Experiments 0 Lean Manufacturing 0 SPC 0 Continuous Improvement 0 Root Cause Analysis 0 Product Management 0 Electronics See 1+     See less Top Skills 14 Manufacturing 7 Program Management 6 Process Improvement 6 Testing 4 Product Development 4 Engineering 3 Cross-functional Team... 3 Process Simulation 2 Engineering Management 1 Semiconductors Michael also knows about... 1 Manufacturing... 1 FMEA 1 Intel 1 Systems Engineering 1 Automotive 0 Project Management 0 Outsourcing 0 Process Engineering 0 Six Sigma 0 Design of Experiments 0 Lean Manufacturing 0 SPC 0 Continuous Improvement 0 Root Cause Analysis 0 Product Management 0 Electronics See 1+     See less                     1 Manufacturing... 1 FMEA 1 Intel 1 Systems Engineering 1 Automotive 0 Project Management 0 Outsourcing 0 Process Engineering 0 Six Sigma 0 Design of Experiments 0 Lean Manufacturing 0 SPC 0 Continuous Improvement 0 Root Cause Analysis 0 Product Management 0 Electronics Education Arizona State University, W. P. Carey School of Business MBA 2005  – 2007 Clemson University MS,  Environmental Systems Engineering 1994  – 1996 North Carolina State University BS,  Chemical Engineering 1979  – 1982 Arizona State University, W. P. Carey School of Business MBA 2005  – 2007 Arizona State University, W. P. Carey School of Business MBA 2005  – 2007 Arizona State University, W. P. Carey School of Business MBA 2005  – 2007 Clemson University MS,  Environmental Systems Engineering 1994  – 1996 Clemson University MS,  Environmental Systems Engineering 1994  – 1996 Clemson University MS,  Environmental Systems Engineering 1994  – 1996 North Carolina State University BS,  Chemical Engineering 1979  – 1982 North Carolina State University BS,  Chemical Engineering 1979  – 1982 North Carolina State University BS,  Chemical Engineering 1979  – 1982 ", "Experience Senior Manager, Business Planning/Scrum Coach Medco Health April 2009  – Present (6 years 5 months) Consultant - Project Manager Princeton Information - Consulting April 2008  –  April 2009  (1 year 1 month) Assignment at Medco Health Senior Operations Program Manager Intel Corporation April 2000  –  February 2008  (7 years 11 months) Director of Operations Curtiss Wright Flight Systems August 1986  –  December 1999  (13 years 5 months) Senior Manager, Business Planning/Scrum Coach Medco Health April 2009  – Present (6 years 5 months) Senior Manager, Business Planning/Scrum Coach Medco Health April 2009  – Present (6 years 5 months) Consultant - Project Manager Princeton Information - Consulting April 2008  –  April 2009  (1 year 1 month) Assignment at Medco Health Consultant - Project Manager Princeton Information - Consulting April 2008  –  April 2009  (1 year 1 month) Assignment at Medco Health Senior Operations Program Manager Intel Corporation April 2000  –  February 2008  (7 years 11 months) Senior Operations Program Manager Intel Corporation April 2000  –  February 2008  (7 years 11 months) Director of Operations Curtiss Wright Flight Systems August 1986  –  December 1999  (13 years 5 months) Director of Operations Curtiss Wright Flight Systems August 1986  –  December 1999  (13 years 5 months) Skills Skills     Education Arizona State University 1981  – 1985 Arizona State University 1981  – 1985 Arizona State University 1981  – 1985 Arizona State University 1981  – 1985 Honors & Awards Additional Honors & Awards Professional Scrum Master (Scrum.org - Ken Schwaber), 2011 Additional Honors & Awards Professional Scrum Master (Scrum.org - Ken Schwaber), 2011 Additional Honors & Awards Professional Scrum Master (Scrum.org - Ken Schwaber), 2011 Additional Honors & Awards Professional Scrum Master (Scrum.org - Ken Schwaber), 2011 ", "Skills Design of Experiments Semiconductors Testing Failure Analysis Debugging Process Simulation Validation Process Improvement Manufacturing Product Development Quality Assurance Engineering ISO 13485 Medical Devices Engineering Management Manufacturing... See 1+     See less Skills  Design of Experiments Semiconductors Testing Failure Analysis Debugging Process Simulation Validation Process Improvement Manufacturing Product Development Quality Assurance Engineering ISO 13485 Medical Devices Engineering Management Manufacturing... See 1+     See less Design of Experiments Semiconductors Testing Failure Analysis Debugging Process Simulation Validation Process Improvement Manufacturing Product Development Quality Assurance Engineering ISO 13485 Medical Devices Engineering Management Manufacturing... See 1+     See less Design of Experiments Semiconductors Testing Failure Analysis Debugging Process Simulation Validation Process Improvement Manufacturing Product Development Quality Assurance Engineering ISO 13485 Medical Devices Engineering Management Manufacturing... See 1+     See less ", "Summary Jessica is the Executive Director of Career Connectors, a 501(c)3 nonprofit organization dedicated to connecting professionals in career transition to hiring companies and quality resources that has helped over 20,000 professionals in career transition. She is a known speaker, trainer and career transition expert. Jessica brings a strong corporate background in organizational development techniques, career coaching, DISC behavioral assessment, training and development, pre-employment assessments, outplacement services and hiring.  \n \nJessica has had the honor of speaking at The White House in the Forum on Job Clubs in the United States, her focus being on employer engagement. She was also named as one of the Women Who Move the Valley for 2013 by the AZ Foothills Magazine, one of Phoenix's 40 Under Forty in 2011 by the Phoenix Business Journal and was also an award nominee for the 2011 and 2014 Phoenix Chamber of Commerce's Athena Awards.  \n \nJessica owns Thrive139, a company dedicated to serving churches and faith-based nonprofits. Thrive139 implements hiring processes and HR systems to ensure clients make solid decisions in hiring the right people for great positions. Its where competency+character+chemistry=culture match.  \n \nSpecialties: \nMotivational speaking, training and development  \nOrganizational development, hiring, staffing \nSocial Media (LinkedIn, Twitter) \nCommunications, cultural differences \nChurch staffing, church hiring and employee relations Summary Jessica is the Executive Director of Career Connectors, a 501(c)3 nonprofit organization dedicated to connecting professionals in career transition to hiring companies and quality resources that has helped over 20,000 professionals in career transition. She is a known speaker, trainer and career transition expert. Jessica brings a strong corporate background in organizational development techniques, career coaching, DISC behavioral assessment, training and development, pre-employment assessments, outplacement services and hiring.  \n \nJessica has had the honor of speaking at The White House in the Forum on Job Clubs in the United States, her focus being on employer engagement. She was also named as one of the Women Who Move the Valley for 2013 by the AZ Foothills Magazine, one of Phoenix's 40 Under Forty in 2011 by the Phoenix Business Journal and was also an award nominee for the 2011 and 2014 Phoenix Chamber of Commerce's Athena Awards.  \n \nJessica owns Thrive139, a company dedicated to serving churches and faith-based nonprofits. Thrive139 implements hiring processes and HR systems to ensure clients make solid decisions in hiring the right people for great positions. Its where competency+character+chemistry=culture match.  \n \nSpecialties: \nMotivational speaking, training and development  \nOrganizational development, hiring, staffing \nSocial Media (LinkedIn, Twitter) \nCommunications, cultural differences \nChurch staffing, church hiring and employee relations Jessica is the Executive Director of Career Connectors, a 501(c)3 nonprofit organization dedicated to connecting professionals in career transition to hiring companies and quality resources that has helped over 20,000 professionals in career transition. She is a known speaker, trainer and career transition expert. Jessica brings a strong corporate background in organizational development techniques, career coaching, DISC behavioral assessment, training and development, pre-employment assessments, outplacement services and hiring.  \n \nJessica has had the honor of speaking at The White House in the Forum on Job Clubs in the United States, her focus being on employer engagement. She was also named as one of the Women Who Move the Valley for 2013 by the AZ Foothills Magazine, one of Phoenix's 40 Under Forty in 2011 by the Phoenix Business Journal and was also an award nominee for the 2011 and 2014 Phoenix Chamber of Commerce's Athena Awards.  \n \nJessica owns Thrive139, a company dedicated to serving churches and faith-based nonprofits. Thrive139 implements hiring processes and HR systems to ensure clients make solid decisions in hiring the right people for great positions. Its where competency+character+chemistry=culture match.  \n \nSpecialties: \nMotivational speaking, training and development  \nOrganizational development, hiring, staffing \nSocial Media (LinkedIn, Twitter) \nCommunications, cultural differences \nChurch staffing, church hiring and employee relations Jessica is the Executive Director of Career Connectors, a 501(c)3 nonprofit organization dedicated to connecting professionals in career transition to hiring companies and quality resources that has helped over 20,000 professionals in career transition. She is a known speaker, trainer and career transition expert. Jessica brings a strong corporate background in organizational development techniques, career coaching, DISC behavioral assessment, training and development, pre-employment assessments, outplacement services and hiring.  \n \nJessica has had the honor of speaking at The White House in the Forum on Job Clubs in the United States, her focus being on employer engagement. She was also named as one of the Women Who Move the Valley for 2013 by the AZ Foothills Magazine, one of Phoenix's 40 Under Forty in 2011 by the Phoenix Business Journal and was also an award nominee for the 2011 and 2014 Phoenix Chamber of Commerce's Athena Awards.  \n \nJessica owns Thrive139, a company dedicated to serving churches and faith-based nonprofits. Thrive139 implements hiring processes and HR systems to ensure clients make solid decisions in hiring the right people for great positions. Its where competency+character+chemistry=culture match.  \n \nSpecialties: \nMotivational speaking, training and development  \nOrganizational development, hiring, staffing \nSocial Media (LinkedIn, Twitter) \nCommunications, cultural differences \nChurch staffing, church hiring and employee relations Experience Executive Director Career Connectors July 2009  – Present (6 years 2 months) Phoenix, Arizona Area We connect professionals in career transition to hiring companies and quality resources.  \n \nCareer Connectors has helped over 20,000 professionals that have been in career transition. We host 3 events every month in the Phoenix area which includes: career experts, hiring companies and a plethora of career transition resources (resume review, interview coaching, professional photos, social media coaching, etc). We also serve companies that are going through a downsize by providing onsite career fairs and preparation job search workshops. Owner / Hiring Consultant Thrive139 / Accelerated Team Dynamics, LLC May 2007  – Present (8 years 4 months) Chandler, AZ President of Thrive139, a small business committed to connecting talent to churches and faith-based nonprofits. It's where Competence + Character + Chemistry makes the right Culture Match. Life Coach Ministry Coaching International - Successful Living October 2007  –  December 2009  (2 years 3 months) Phoenix, AZ Volunteer as a Successful Living personal coach. It is a year long program focused on 7 different accounts: Faith, Family, Friends, Finances, Priorities, Service and Health. Professional Development Manager Intel Corporation July 2005  –  May 2007  (1 year 11 months) Program manager for multiple organizational development initiative in the Sales and Marketing Workforce. These initiatives included management/leadership for all levels across the organization, mentoring program and extensive travel for global training and development Corporate Trainer and Instructor Manager Intel Corporation September 2003  –  July 2005  (1 year 11 months) Executed regional instructor strategies that supported new instructor recruitment, certification and instructor development. Drove global holistic plans to sustain instructor capacity and health. Drove instructor and master instructor recruiting, developing, certifying, and coaching of volunteer instructor-base in support of the session deployment schedule. Training Operations Program Manager Intel Corporation November 1997  –  September 2003  (5 years 11 months) Direct interface and central point of contact between Intel University and ten Intel Business Groups. Developed an in-depth understanding of the business group, identified business requirements and opportunities that could be addressed. Executive Director Career Connectors July 2009  – Present (6 years 2 months) Phoenix, Arizona Area We connect professionals in career transition to hiring companies and quality resources.  \n \nCareer Connectors has helped over 20,000 professionals that have been in career transition. We host 3 events every month in the Phoenix area which includes: career experts, hiring companies and a plethora of career transition resources (resume review, interview coaching, professional photos, social media coaching, etc). We also serve companies that are going through a downsize by providing onsite career fairs and preparation job search workshops. Executive Director Career Connectors July 2009  – Present (6 years 2 months) Phoenix, Arizona Area We connect professionals in career transition to hiring companies and quality resources.  \n \nCareer Connectors has helped over 20,000 professionals that have been in career transition. We host 3 events every month in the Phoenix area which includes: career experts, hiring companies and a plethora of career transition resources (resume review, interview coaching, professional photos, social media coaching, etc). We also serve companies that are going through a downsize by providing onsite career fairs and preparation job search workshops. Owner / Hiring Consultant Thrive139 / Accelerated Team Dynamics, LLC May 2007  – Present (8 years 4 months) Chandler, AZ President of Thrive139, a small business committed to connecting talent to churches and faith-based nonprofits. It's where Competence + Character + Chemistry makes the right Culture Match. Owner / Hiring Consultant Thrive139 / Accelerated Team Dynamics, LLC May 2007  – Present (8 years 4 months) Chandler, AZ President of Thrive139, a small business committed to connecting talent to churches and faith-based nonprofits. It's where Competence + Character + Chemistry makes the right Culture Match. Life Coach Ministry Coaching International - Successful Living October 2007  –  December 2009  (2 years 3 months) Phoenix, AZ Volunteer as a Successful Living personal coach. It is a year long program focused on 7 different accounts: Faith, Family, Friends, Finances, Priorities, Service and Health. Life Coach Ministry Coaching International - Successful Living October 2007  –  December 2009  (2 years 3 months) Phoenix, AZ Volunteer as a Successful Living personal coach. It is a year long program focused on 7 different accounts: Faith, Family, Friends, Finances, Priorities, Service and Health. Professional Development Manager Intel Corporation July 2005  –  May 2007  (1 year 11 months) Program manager for multiple organizational development initiative in the Sales and Marketing Workforce. These initiatives included management/leadership for all levels across the organization, mentoring program and extensive travel for global training and development Professional Development Manager Intel Corporation July 2005  –  May 2007  (1 year 11 months) Program manager for multiple organizational development initiative in the Sales and Marketing Workforce. These initiatives included management/leadership for all levels across the organization, mentoring program and extensive travel for global training and development Corporate Trainer and Instructor Manager Intel Corporation September 2003  –  July 2005  (1 year 11 months) Executed regional instructor strategies that supported new instructor recruitment, certification and instructor development. Drove global holistic plans to sustain instructor capacity and health. Drove instructor and master instructor recruiting, developing, certifying, and coaching of volunteer instructor-base in support of the session deployment schedule. Corporate Trainer and Instructor Manager Intel Corporation September 2003  –  July 2005  (1 year 11 months) Executed regional instructor strategies that supported new instructor recruitment, certification and instructor development. Drove global holistic plans to sustain instructor capacity and health. Drove instructor and master instructor recruiting, developing, certifying, and coaching of volunteer instructor-base in support of the session deployment schedule. Training Operations Program Manager Intel Corporation November 1997  –  September 2003  (5 years 11 months) Direct interface and central point of contact between Intel University and ten Intel Business Groups. Developed an in-depth understanding of the business group, identified business requirements and opportunities that could be addressed. Training Operations Program Manager Intel Corporation November 1997  –  September 2003  (5 years 11 months) Direct interface and central point of contact between Intel University and ten Intel Business Groups. Developed an in-depth understanding of the business group, identified business requirements and opportunities that could be addressed. Skills Social Media Social Networking Cultural Differences Organizational... Interview Coaching Resume Writing Career Coaching Hiring Job Coaching Career Counseling Recruiting Church Consulting Non-profits Job Search Strategies Career Management Faith-based Leadership Development Organizational Culture Temporary Placement Cultural Diversity Employee Training Motivational Speaking Strategic Planning Training Coaching Public Speaking Business Networking Employee Relations Mentoring Management Employee Benefits Community Outreach Staff Development Leadership Interviews Program Management Team Building Nonprofits Organizational... Talent Management Executive Coaching Conflict Resolution Job Search Career Development Analysis Human Resources System Administration Training Delivery Time Management Performance Management See 35+     See less Skills  Social Media Social Networking Cultural Differences Organizational... Interview Coaching Resume Writing Career Coaching Hiring Job Coaching Career Counseling Recruiting Church Consulting Non-profits Job Search Strategies Career Management Faith-based Leadership Development Organizational Culture Temporary Placement Cultural Diversity Employee Training Motivational Speaking Strategic Planning Training Coaching Public Speaking Business Networking Employee Relations Mentoring Management Employee Benefits Community Outreach Staff Development Leadership Interviews Program Management Team Building Nonprofits Organizational... Talent Management Executive Coaching Conflict Resolution Job Search Career Development Analysis Human Resources System Administration Training Delivery Time Management Performance Management See 35+     See less Social Media Social Networking Cultural Differences Organizational... Interview Coaching Resume Writing Career Coaching Hiring Job Coaching Career Counseling Recruiting Church Consulting Non-profits Job Search Strategies Career Management Faith-based Leadership Development Organizational Culture Temporary Placement Cultural Diversity Employee Training Motivational Speaking Strategic Planning Training Coaching Public Speaking Business Networking Employee Relations Mentoring Management Employee Benefits Community Outreach Staff Development Leadership Interviews Program Management Team Building Nonprofits Organizational... Talent Management Executive Coaching Conflict Resolution Job Search Career Development Analysis Human Resources System Administration Training Delivery Time Management Performance Management See 35+     See less Social Media Social Networking Cultural Differences Organizational... Interview Coaching Resume Writing Career Coaching Hiring Job Coaching Career Counseling Recruiting Church Consulting Non-profits Job Search Strategies Career Management Faith-based Leadership Development Organizational Culture Temporary Placement Cultural Diversity Employee Training Motivational Speaking Strategic Planning Training Coaching Public Speaking Business Networking Employee Relations Mentoring Management Employee Benefits Community Outreach Staff Development Leadership Interviews Program Management Team Building Nonprofits Organizational... Talent Management Executive Coaching Conflict Resolution Job Search Career Development Analysis Human Resources System Administration Training Delivery Time Management Performance Management See 35+     See less Education Franklin University MBA,  Business Management 2000  – 2003 University of Phoenix BS,  Computer Information Systems 1998  – 2000 The Ohio State University Business Administration 1994  – 1997 Gahanna Lincoln Franklin University MBA,  Business Management 2000  – 2003 Franklin University MBA,  Business Management 2000  – 2003 Franklin University MBA,  Business Management 2000  – 2003 University of Phoenix BS,  Computer Information Systems 1998  – 2000 University of Phoenix BS,  Computer Information Systems 1998  – 2000 University of Phoenix BS,  Computer Information Systems 1998  – 2000 The Ohio State University Business Administration 1994  – 1997 The Ohio State University Business Administration 1994  – 1997 The Ohio State University Business Administration 1994  – 1997 Gahanna Lincoln Gahanna Lincoln Gahanna Lincoln Honors & Awards Women Who Move the Valley Arizona Foothills January 2013 Phoenix's 40 Under Forty Phoenix Business Journal August 2011 Athena Finalist Phoenix Chamber of Commerce September 2014 Women Who Move the Valley Arizona Foothills January 2013 Women Who Move the Valley Arizona Foothills January 2013 Women Who Move the Valley Arizona Foothills January 2013 Phoenix's 40 Under Forty Phoenix Business Journal August 2011 Phoenix's 40 Under Forty Phoenix Business Journal August 2011 Phoenix's 40 Under Forty Phoenix Business Journal August 2011 Athena Finalist Phoenix Chamber of Commerce September 2014 Athena Finalist Phoenix Chamber of Commerce September 2014 Athena Finalist Phoenix Chamber of Commerce September 2014 ", "Summary A product and business development professional with extensive experience in U.S. and international markets, developing strong business partnerships and alliances. Skilled in strategic business planning, communication, and execution across organizations. Consensus builder within the organization and proficient in incorporating business partner and customer needs and expectations. Excel at leading effective multinational and multi-site cross-functional teams.  Summary A product and business development professional with extensive experience in U.S. and international markets, developing strong business partnerships and alliances. Skilled in strategic business planning, communication, and execution across organizations. Consensus builder within the organization and proficient in incorporating business partner and customer needs and expectations. Excel at leading effective multinational and multi-site cross-functional teams.  A product and business development professional with extensive experience in U.S. and international markets, developing strong business partnerships and alliances. Skilled in strategic business planning, communication, and execution across organizations. Consensus builder within the organization and proficient in incorporating business partner and customer needs and expectations. Excel at leading effective multinational and multi-site cross-functional teams.  A product and business development professional with extensive experience in U.S. and international markets, developing strong business partnerships and alliances. Skilled in strategic business planning, communication, and execution across organizations. Consensus builder within the organization and proficient in incorporating business partner and customer needs and expectations. Excel at leading effective multinational and multi-site cross-functional teams.  Experience Vice President, Product and Business Development, Co-founder Inteliscope April 2013  – Present (2 years 5 months) Sandpoint, Idaho Founder and Owner Headwaters Bamboo Rod Co. July 2002  – Present (13 years 2 months) Sandpoint, Idaho Vice President, Global Operations and Product Management TransluSense December 2011  –  July 2013  (1 year 8 months) Portland, Oregon Area Sr. Account Manager Pactron February 2011  –  December 2011  (11 months) Director of Operations Digital Habitat March 2009  –  December 2009  (10 months) Product Manager - Assembly Services DTI November 2003  –  December 2008  (5 years 2 months) Founder and COO Trask Partners January 2008  –  September 2008  (9 months) Account Manager - Asia and Europe Intel Corporation January 2000  –  November 2003  (3 years 11 months) Product Development Program Manager Intel Corporation January 1998  –  January 2000  (2 years 1 month) Operations Program Manager Intel Corporation January 1994  –  January 1998  (4 years 1 month) Vice President, Product and Business Development, Co-founder Inteliscope April 2013  – Present (2 years 5 months) Sandpoint, Idaho Vice President, Product and Business Development, Co-founder Inteliscope April 2013  – Present (2 years 5 months) Sandpoint, Idaho Founder and Owner Headwaters Bamboo Rod Co. July 2002  – Present (13 years 2 months) Sandpoint, Idaho Founder and Owner Headwaters Bamboo Rod Co. July 2002  – Present (13 years 2 months) Sandpoint, Idaho Vice President, Global Operations and Product Management TransluSense December 2011  –  July 2013  (1 year 8 months) Portland, Oregon Area Vice President, Global Operations and Product Management TransluSense December 2011  –  July 2013  (1 year 8 months) Portland, Oregon Area Sr. Account Manager Pactron February 2011  –  December 2011  (11 months) Sr. Account Manager Pactron February 2011  –  December 2011  (11 months) Director of Operations Digital Habitat March 2009  –  December 2009  (10 months) Director of Operations Digital Habitat March 2009  –  December 2009  (10 months) Product Manager - Assembly Services DTI November 2003  –  December 2008  (5 years 2 months) Product Manager - Assembly Services DTI November 2003  –  December 2008  (5 years 2 months) Founder and COO Trask Partners January 2008  –  September 2008  (9 months) Founder and COO Trask Partners January 2008  –  September 2008  (9 months) Account Manager - Asia and Europe Intel Corporation January 2000  –  November 2003  (3 years 11 months) Account Manager - Asia and Europe Intel Corporation January 2000  –  November 2003  (3 years 11 months) Product Development Program Manager Intel Corporation January 1998  –  January 2000  (2 years 1 month) Product Development Program Manager Intel Corporation January 1998  –  January 2000  (2 years 1 month) Operations Program Manager Intel Corporation January 1994  –  January 1998  (4 years 1 month) Operations Program Manager Intel Corporation January 1994  –  January 1998  (4 years 1 month) Languages Japanese Japanese Japanese Skills Cross-functional Team... Strategic Planning Business Development Leadership Product Development Program Management Management Contract Negotiation SaaS Product Management Account Management Manufacturing Marketing Product Marketing Sales Start-ups Strategic Partnerships See 2+     See less Skills  Cross-functional Team... Strategic Planning Business Development Leadership Product Development Program Management Management Contract Negotiation SaaS Product Management Account Management Manufacturing Marketing Product Marketing Sales Start-ups Strategic Partnerships See 2+     See less Cross-functional Team... Strategic Planning Business Development Leadership Product Development Program Management Management Contract Negotiation SaaS Product Management Account Management Manufacturing Marketing Product Marketing Sales Start-ups Strategic Partnerships See 2+     See less Cross-functional Team... Strategic Planning Business Development Leadership Product Development Program Management Management Contract Negotiation SaaS Product Management Account Management Manufacturing Marketing Product Marketing Sales Start-ups Strategic Partnerships See 2+     See less Education Brigham Young University BA,  International Relations City University of Seattle MBA,  Operations Management Concordia University-Portland Certificate,  International Business Management Brigham Young University BA,  International Relations Brigham Young University BA,  International Relations Brigham Young University BA,  International Relations City University of Seattle MBA,  Operations Management City University of Seattle MBA,  Operations Management City University of Seattle MBA,  Operations Management Concordia University-Portland Certificate,  International Business Management Concordia University-Portland Certificate,  International Business Management Concordia University-Portland Certificate,  International Business Management ", "Skills Program Management Product Launch Go-to-market Strategy Product Management Demand Generation Marketing Leadership Management Project Management Marketing Strategy Team Building Competitive Analysis Product Marketing Cross-functional Team... Team Management Online Advertising Multi-channel Marketing Vendor Management Strategy Strategic Partnerships See 5+     See less Skills  Program Management Product Launch Go-to-market Strategy Product Management Demand Generation Marketing Leadership Management Project Management Marketing Strategy Team Building Competitive Analysis Product Marketing Cross-functional Team... Team Management Online Advertising Multi-channel Marketing Vendor Management Strategy Strategic Partnerships See 5+     See less Program Management Product Launch Go-to-market Strategy Product Management Demand Generation Marketing Leadership Management Project Management Marketing Strategy Team Building Competitive Analysis Product Marketing Cross-functional Team... Team Management Online Advertising Multi-channel Marketing Vendor Management Strategy Strategic Partnerships See 5+     See less Program Management Product Launch Go-to-market Strategy Product Management Demand Generation Marketing Leadership Management Project Management Marketing Strategy Team Building Competitive Analysis Product Marketing Cross-functional Team... Team Management Online Advertising Multi-channel Marketing Vendor Management Strategy Strategic Partnerships See 5+     See less ", "Skills Semiconductors SPC Cross-functional Team... Design of Experiments Failure Analysis Engineering Product Development Skills  Semiconductors SPC Cross-functional Team... Design of Experiments Failure Analysis Engineering Product Development Semiconductors SPC Cross-functional Team... Design of Experiments Failure Analysis Engineering Product Development Semiconductors SPC Cross-functional Team... Design of Experiments Failure Analysis Engineering Product Development ", "Experience Operations Program Manager Intel Corporation October 2001  –  August 2008  (6 years 11 months) Operations Program Manager Intel Corporation October 2001  –  August 2008  (6 years 11 months) Operations Program Manager Intel Corporation October 2001  –  August 2008  (6 years 11 months) Education San Jose State University MBA/MSE,  Business, Engineering 2006  – 2006 DeVry University BSEE,  Electronics 1999  – 2004 Universidad de San Carlos de Guatemala 1989  – 1991 San Jose State University MBA/MSE,  Business, Engineering 2006  – 2006 San Jose State University MBA/MSE,  Business, Engineering 2006  – 2006 San Jose State University MBA/MSE,  Business, Engineering 2006  – 2006 DeVry University BSEE,  Electronics 1999  – 2004 DeVry University BSEE,  Electronics 1999  – 2004 DeVry University BSEE,  Electronics 1999  – 2004 Universidad de San Carlos de Guatemala 1989  – 1991 Universidad de San Carlos de Guatemala 1989  – 1991 Universidad de San Carlos de Guatemala 1989  – 1991 ", "Skills Cross-functional Team... Program Management Skills  Cross-functional Team... Program Management Cross-functional Team... Program Management Cross-functional Team... Program Management "]}