{"position": "Platform Architect", "company": "Intel Corporation", "profiles": ["Skills Cache Coherency RTL Processors Microarchitecture Computer Architecture SoC Audio Processing Skills  Cache Coherency RTL Processors Microarchitecture Computer Architecture SoC Audio Processing Cache Coherency RTL Processors Microarchitecture Computer Architecture SoC Audio Processing Cache Coherency RTL Processors Microarchitecture Computer Architecture SoC Audio Processing ", "Summary Qibo has more than 10 year’s professional experience in world class OEM support, hardware design and system architect role, of which the last 6 years was at Intel. He is proficient in project management, communications with multi-geo customers, electrical design/debugging, CE product knowledge space and fast problem-solving. \n \nQibo work as platform architect on first small form factor OTT product that based on Intel powerful 22nm mobile SoC at Intel Architecture Group, Be responsible for product concept definition, SoC roadmap definition, key components selection, performance evaluation, contract manufacture assessment and power consumption evaluation. Prior to this, as senior custom enabling engineer at Digital Home Group, Qibo was primary role to support Sony in the successful deployment of industry 1st high volume Google TV devices with IA based 45nm SoC. And Qibo was working as key stakeholder at 32nm SoC Silicon Validation Partner Program between Sony and Intel, supporting Sony early engagement with Intel silicon validation team into platform design, function validation and bug fix on 32nm Intel CE SoC. He also supported Samsung, LG, Skyworth and DVN world class OEMs’ HW design, validation and mass production with Intel CE series SoC. \n \nBefore joining Intel in 2008, Qibo worked for Trident as a HW AE team lead to be responsible for APAC customer support, specially 2 years working with Samsung at Korean to support millions volume DPTV/DTV mass production on field. He also worked as hardware engineer at Gaodewei ITS and Xuji Electric more than 3 years for FPGA and MCU platform design and FW coding. Summary Qibo has more than 10 year’s professional experience in world class OEM support, hardware design and system architect role, of which the last 6 years was at Intel. He is proficient in project management, communications with multi-geo customers, electrical design/debugging, CE product knowledge space and fast problem-solving. \n \nQibo work as platform architect on first small form factor OTT product that based on Intel powerful 22nm mobile SoC at Intel Architecture Group, Be responsible for product concept definition, SoC roadmap definition, key components selection, performance evaluation, contract manufacture assessment and power consumption evaluation. Prior to this, as senior custom enabling engineer at Digital Home Group, Qibo was primary role to support Sony in the successful deployment of industry 1st high volume Google TV devices with IA based 45nm SoC. And Qibo was working as key stakeholder at 32nm SoC Silicon Validation Partner Program between Sony and Intel, supporting Sony early engagement with Intel silicon validation team into platform design, function validation and bug fix on 32nm Intel CE SoC. He also supported Samsung, LG, Skyworth and DVN world class OEMs’ HW design, validation and mass production with Intel CE series SoC. \n \nBefore joining Intel in 2008, Qibo worked for Trident as a HW AE team lead to be responsible for APAC customer support, specially 2 years working with Samsung at Korean to support millions volume DPTV/DTV mass production on field. He also worked as hardware engineer at Gaodewei ITS and Xuji Electric more than 3 years for FPGA and MCU platform design and FW coding. Qibo has more than 10 year’s professional experience in world class OEM support, hardware design and system architect role, of which the last 6 years was at Intel. He is proficient in project management, communications with multi-geo customers, electrical design/debugging, CE product knowledge space and fast problem-solving. \n \nQibo work as platform architect on first small form factor OTT product that based on Intel powerful 22nm mobile SoC at Intel Architecture Group, Be responsible for product concept definition, SoC roadmap definition, key components selection, performance evaluation, contract manufacture assessment and power consumption evaluation. Prior to this, as senior custom enabling engineer at Digital Home Group, Qibo was primary role to support Sony in the successful deployment of industry 1st high volume Google TV devices with IA based 45nm SoC. And Qibo was working as key stakeholder at 32nm SoC Silicon Validation Partner Program between Sony and Intel, supporting Sony early engagement with Intel silicon validation team into platform design, function validation and bug fix on 32nm Intel CE SoC. He also supported Samsung, LG, Skyworth and DVN world class OEMs’ HW design, validation and mass production with Intel CE series SoC. \n \nBefore joining Intel in 2008, Qibo worked for Trident as a HW AE team lead to be responsible for APAC customer support, specially 2 years working with Samsung at Korean to support millions volume DPTV/DTV mass production on field. He also worked as hardware engineer at Gaodewei ITS and Xuji Electric more than 3 years for FPGA and MCU platform design and FW coding. Qibo has more than 10 year’s professional experience in world class OEM support, hardware design and system architect role, of which the last 6 years was at Intel. He is proficient in project management, communications with multi-geo customers, electrical design/debugging, CE product knowledge space and fast problem-solving. \n \nQibo work as platform architect on first small form factor OTT product that based on Intel powerful 22nm mobile SoC at Intel Architecture Group, Be responsible for product concept definition, SoC roadmap definition, key components selection, performance evaluation, contract manufacture assessment and power consumption evaluation. Prior to this, as senior custom enabling engineer at Digital Home Group, Qibo was primary role to support Sony in the successful deployment of industry 1st high volume Google TV devices with IA based 45nm SoC. And Qibo was working as key stakeholder at 32nm SoC Silicon Validation Partner Program between Sony and Intel, supporting Sony early engagement with Intel silicon validation team into platform design, function validation and bug fix on 32nm Intel CE SoC. He also supported Samsung, LG, Skyworth and DVN world class OEMs’ HW design, validation and mass production with Intel CE series SoC. \n \nBefore joining Intel in 2008, Qibo worked for Trident as a HW AE team lead to be responsible for APAC customer support, specially 2 years working with Samsung at Korean to support millions volume DPTV/DTV mass production on field. He also worked as hardware engineer at Gaodewei ITS and Xuji Electric more than 3 years for FPGA and MCU platform design and FW coding. Experience Platform Architect Intel Corporation March 2013  – Present (2 years 6 months) Shanghai City, China Qibo work as platform architect on Intel Media first small form factor OTT product that based on Intel powerful 22nm mobile SoC, and also help CM manufacture NPI process and high volume manufacture. Senior Hardware Platform Application Engineer Intel Corporation February 2008  –  March 2013  (5 years 2 months) Shanghai Support on Intel CE series SoCs' projects. Be responsible on all Hardware related issues on projects. \nPrimary HW AE to support Sony in the successful deployment of HVM Smart TV devices with CE4100 (Industry first Google TV product with IA based SoC). Then working as key stakeholder at 32nm SoC Validation Partner Program, supporting Sony early engagement into platform design, silicon validation and bug fix on 32nm IA SoC. And also supported Samsung, LG, Skyworth, DVN and Tiplay OEMs’ HW design, validation and mass production with Intel CE series SoC as mainly HW owner. Hardware Application Engineer Team Leader Trident Microsystems July 2004  –  February 2008  (3 years 8 months) China Support Toshiba Qosmia notebook project, Xoceco HDTV_LX ATSC DTV project, Hisense HDTV_LX DVB DTV project, Samsung SVP PX/LX 1080P HDTV projects, Samsung SVP UX/WX MEMC DTV projects as HW application engineer. Especially two years field support experience on Samsung millions volume DTV mass production. \nBe response on HW platform designing and debugging, Picture Quality improvement, MEMC registers tuning on these projects. And be response for new team members’ training and coaching after taking a team lead role. Platform Architect Intel Corporation March 2013  – Present (2 years 6 months) Shanghai City, China Qibo work as platform architect on Intel Media first small form factor OTT product that based on Intel powerful 22nm mobile SoC, and also help CM manufacture NPI process and high volume manufacture. Platform Architect Intel Corporation March 2013  – Present (2 years 6 months) Shanghai City, China Qibo work as platform architect on Intel Media first small form factor OTT product that based on Intel powerful 22nm mobile SoC, and also help CM manufacture NPI process and high volume manufacture. Senior Hardware Platform Application Engineer Intel Corporation February 2008  –  March 2013  (5 years 2 months) Shanghai Support on Intel CE series SoCs' projects. Be responsible on all Hardware related issues on projects. \nPrimary HW AE to support Sony in the successful deployment of HVM Smart TV devices with CE4100 (Industry first Google TV product with IA based SoC). Then working as key stakeholder at 32nm SoC Validation Partner Program, supporting Sony early engagement into platform design, silicon validation and bug fix on 32nm IA SoC. And also supported Samsung, LG, Skyworth, DVN and Tiplay OEMs’ HW design, validation and mass production with Intel CE series SoC as mainly HW owner. Senior Hardware Platform Application Engineer Intel Corporation February 2008  –  March 2013  (5 years 2 months) Shanghai Support on Intel CE series SoCs' projects. Be responsible on all Hardware related issues on projects. \nPrimary HW AE to support Sony in the successful deployment of HVM Smart TV devices with CE4100 (Industry first Google TV product with IA based SoC). Then working as key stakeholder at 32nm SoC Validation Partner Program, supporting Sony early engagement into platform design, silicon validation and bug fix on 32nm IA SoC. And also supported Samsung, LG, Skyworth, DVN and Tiplay OEMs’ HW design, validation and mass production with Intel CE series SoC as mainly HW owner. Hardware Application Engineer Team Leader Trident Microsystems July 2004  –  February 2008  (3 years 8 months) China Support Toshiba Qosmia notebook project, Xoceco HDTV_LX ATSC DTV project, Hisense HDTV_LX DVB DTV project, Samsung SVP PX/LX 1080P HDTV projects, Samsung SVP UX/WX MEMC DTV projects as HW application engineer. Especially two years field support experience on Samsung millions volume DTV mass production. \nBe response on HW platform designing and debugging, Picture Quality improvement, MEMC registers tuning on these projects. And be response for new team members’ training and coaching after taking a team lead role. Hardware Application Engineer Team Leader Trident Microsystems July 2004  –  February 2008  (3 years 8 months) China Support Toshiba Qosmia notebook project, Xoceco HDTV_LX ATSC DTV project, Hisense HDTV_LX DVB DTV project, Samsung SVP PX/LX 1080P HDTV projects, Samsung SVP UX/WX MEMC DTV projects as HW application engineer. Especially two years field support experience on Samsung millions volume DTV mass production. \nBe response on HW platform designing and debugging, Picture Quality improvement, MEMC registers tuning on these projects. And be response for new team members’ training and coaching after taking a team lead role. Skills SoC Debugging Skills  SoC Debugging SoC Debugging SoC Debugging Education Hefei University of Technology Master,  Electronic 2000  – 2003 Hefei Uniiversity of Technology Bachelor,  Electronic 1994  – 1998 Hefei University of Technology Master,  Electronic 2000  – 2003 Hefei University of Technology Master,  Electronic 2000  – 2003 Hefei University of Technology Master,  Electronic 2000  – 2003 Hefei Uniiversity of Technology Bachelor,  Electronic 1994  – 1998 Hefei Uniiversity of Technology Bachelor,  Electronic 1994  – 1998 Hefei Uniiversity of Technology Bachelor,  Electronic 1994  – 1998 ", "Summary Mobile power and performance(PnP) engineer delivered successful Power and performance optimization on 5 generations on Intel’s Atom based smartphone and tablet platforms and with solid experience in building and leading teams through complex technical and cross-geo, cross domain, cross-organizational challenges and working with multiple customers and ODM partners to demo and deliver PnP optimize Intel platform. Summary Mobile power and performance(PnP) engineer delivered successful Power and performance optimization on 5 generations on Intel’s Atom based smartphone and tablet platforms and with solid experience in building and leading teams through complex technical and cross-geo, cross domain, cross-organizational challenges and working with multiple customers and ODM partners to demo and deliver PnP optimize Intel platform. Mobile power and performance(PnP) engineer delivered successful Power and performance optimization on 5 generations on Intel’s Atom based smartphone and tablet platforms and with solid experience in building and leading teams through complex technical and cross-geo, cross domain, cross-organizational challenges and working with multiple customers and ODM partners to demo and deliver PnP optimize Intel platform. Mobile power and performance(PnP) engineer delivered successful Power and performance optimization on 5 generations on Intel’s Atom based smartphone and tablet platforms and with solid experience in building and leading teams through complex technical and cross-geo, cross domain, cross-organizational challenges and working with multiple customers and ODM partners to demo and deliver PnP optimize Intel platform. Experience Platform Architect Intel Corporation August 2013  – Present (2 years 1 month) San Francisco Bay Area Working on Defining next generation Display Architecture for Intel Atom based SoCs. Tracking platform Execution status and issues on display interfaces MIPI, eDP on current platforms and helping execution team to debug and fix hardware, software issues. Platform Arch realtykart 2015  –  2015  (less than a year) Platform Arch realtykart 2015  –  2015  (less than a year) Power and Performance Engineer Intel Corporation February 2006  –  August 2013  (7 years 7 months) Embedded Engineer Tata Consultancy Services 2003  –  2005  (2 years) Embedded Engineer Tata Consultancy Services 2003  –  2005  (2 years) Platform Architect Intel Corporation August 2013  – Present (2 years 1 month) San Francisco Bay Area Working on Defining next generation Display Architecture for Intel Atom based SoCs. Tracking platform Execution status and issues on display interfaces MIPI, eDP on current platforms and helping execution team to debug and fix hardware, software issues. Platform Architect Intel Corporation August 2013  – Present (2 years 1 month) San Francisco Bay Area Working on Defining next generation Display Architecture for Intel Atom based SoCs. Tracking platform Execution status and issues on display interfaces MIPI, eDP on current platforms and helping execution team to debug and fix hardware, software issues. Platform Arch realtykart 2015  –  2015  (less than a year) Platform Arch realtykart 2015  –  2015  (less than a year) Platform Arch realtykart 2015  –  2015  (less than a year) Platform Arch realtykart 2015  –  2015  (less than a year) Power and Performance Engineer Intel Corporation February 2006  –  August 2013  (7 years 7 months) Power and Performance Engineer Intel Corporation February 2006  –  August 2013  (7 years 7 months) Embedded Engineer Tata Consultancy Services 2003  –  2005  (2 years) Embedded Engineer Tata Consultancy Services 2003  –  2005  (2 years) Embedded Engineer Tata Consultancy Services 2003  –  2005  (2 years) Embedded Engineer Tata Consultancy Services 2003  –  2005  (2 years) Skills Intel Processors Silicon SoC Debugging RTL design Power Management FPGA Power Optimization Performance Improvement Mobile Devices Smartphones Low Power Systems Skills  Intel Processors Silicon SoC Debugging RTL design Power Management FPGA Power Optimization Performance Improvement Mobile Devices Smartphones Low Power Systems Intel Processors Silicon SoC Debugging RTL design Power Management FPGA Power Optimization Performance Improvement Mobile Devices Smartphones Low Power Systems Intel Processors Silicon SoC Debugging RTL design Power Management FPGA Power Optimization Performance Improvement Mobile Devices Smartphones Low Power Systems Education Bit Mapper Diploma In VLSI design,  VLSI Dsign , A+ 2000  – 2000 Digital design, System RTL design. Bhilai Institute Of Technology Model high School Bit Mapper Diploma In VLSI design,  VLSI Dsign , A+ 2000  – 2000 Digital design, System RTL design. Bit Mapper Diploma In VLSI design,  VLSI Dsign , A+ 2000  – 2000 Digital design, System RTL design. Bit Mapper Diploma In VLSI design,  VLSI Dsign , A+ 2000  – 2000 Digital design, System RTL design. Bhilai Institute Of Technology Bhilai Institute Of Technology Bhilai Institute Of Technology Model high School Model high School Model high School ", "Summary A result-oriented, well regarded professional with unique problem solving skills and ability to connect dots and demonstrate unique perspective. Demonstrated areas of expertise are Platform and System Engineering, and Component Hardware development with 17+ years of experience in Intel Corp. \n \nI have excellent communication skills and am both very proactive and process-oriented. I also highly value collaboration and am regarded as a great team player. \n \nI have 10 patents (see the list below) in various aspects of platform, and system architecture and component development. Summary A result-oriented, well regarded professional with unique problem solving skills and ability to connect dots and demonstrate unique perspective. Demonstrated areas of expertise are Platform and System Engineering, and Component Hardware development with 17+ years of experience in Intel Corp. \n \nI have excellent communication skills and am both very proactive and process-oriented. I also highly value collaboration and am regarded as a great team player. \n \nI have 10 patents (see the list below) in various aspects of platform, and system architecture and component development. A result-oriented, well regarded professional with unique problem solving skills and ability to connect dots and demonstrate unique perspective. Demonstrated areas of expertise are Platform and System Engineering, and Component Hardware development with 17+ years of experience in Intel Corp. \n \nI have excellent communication skills and am both very proactive and process-oriented. I also highly value collaboration and am regarded as a great team player. \n \nI have 10 patents (see the list below) in various aspects of platform, and system architecture and component development. A result-oriented, well regarded professional with unique problem solving skills and ability to connect dots and demonstrate unique perspective. Demonstrated areas of expertise are Platform and System Engineering, and Component Hardware development with 17+ years of experience in Intel Corp. \n \nI have excellent communication skills and am both very proactive and process-oriented. I also highly value collaboration and am regarded as a great team player. \n \nI have 10 patents (see the list below) in various aspects of platform, and system architecture and component development. Experience Platform Architect Intel Corporation November 2014  – Present (10 months) Chandler Work in Internet of Things Group as a Platform Architect adopting Intel platforms for industrial, automotive and other applications. Platform Architect Intel Corporation July 2010  –  November 2014  (4 years 5 months) Phoenix, Arizona Area I work on Intel Server Platform Hardware architecture. It includes Entry Level and Atom based server platforms. Starts with understanding server market needs, and leading the definition of the platform details.  \n \nHaving design engineering background helps me bring an unique perspective on how the hardware design challenges needs to be taken into account to solve the customer platform and system issues. \n \nI also was the Platform Power Architect spanning all Intel server platforms that defines the requirements from the generational, Regulatory and competitive assessments. Component Design Engineer Intel Corporation 1997  –  June 2010  (13 years) Was involved in all aspects of component design from product definition to product release. \n \nWas involved in multiple ASICs. Started with an ASIC for a protocol called Next Gen IO which eventually evolved into Infiniband. Then I led a sub-team on Intel Network processors that include the Intel Xscale based IXP4XX series of processors. \n \nThen I was one of the Leads in the Intel server processor called Jasper Forest which was one of the first processors to eliminate North Bridges by integrating PCI Express and Crystal Beach DMA functionality into processor die. \n \nFinally, I was micro-architecting the definition of the chipset that was part of the Intel server processors before I transitioned from component development to server platform architecture. Component Design Engineer Symbios Logic 1995  –  1997  (2 years) Was involved in all aspects of component design from product definition to product release. \n \nWas involved in SCSI Target Channel Adapters ASICs. Was also one of the first team to develop first Fibre Channel based Target Channel Adapters in the industry. Design Engineer Intelligent Reasoning Systems Inc January 1993  –  April 1995  (2 years 4 months) Was involved in all aspects of component design from product definition to product release. \n \nWas involved in development of a neural network based component for pattern matching, image recognition and industrial automation. Platform Architect Intel Corporation November 2014  – Present (10 months) Chandler Work in Internet of Things Group as a Platform Architect adopting Intel platforms for industrial, automotive and other applications. Platform Architect Intel Corporation November 2014  – Present (10 months) Chandler Work in Internet of Things Group as a Platform Architect adopting Intel platforms for industrial, automotive and other applications. Platform Architect Intel Corporation July 2010  –  November 2014  (4 years 5 months) Phoenix, Arizona Area I work on Intel Server Platform Hardware architecture. It includes Entry Level and Atom based server platforms. Starts with understanding server market needs, and leading the definition of the platform details.  \n \nHaving design engineering background helps me bring an unique perspective on how the hardware design challenges needs to be taken into account to solve the customer platform and system issues. \n \nI also was the Platform Power Architect spanning all Intel server platforms that defines the requirements from the generational, Regulatory and competitive assessments. Platform Architect Intel Corporation July 2010  –  November 2014  (4 years 5 months) Phoenix, Arizona Area I work on Intel Server Platform Hardware architecture. It includes Entry Level and Atom based server platforms. Starts with understanding server market needs, and leading the definition of the platform details.  \n \nHaving design engineering background helps me bring an unique perspective on how the hardware design challenges needs to be taken into account to solve the customer platform and system issues. \n \nI also was the Platform Power Architect spanning all Intel server platforms that defines the requirements from the generational, Regulatory and competitive assessments. Component Design Engineer Intel Corporation 1997  –  June 2010  (13 years) Was involved in all aspects of component design from product definition to product release. \n \nWas involved in multiple ASICs. Started with an ASIC for a protocol called Next Gen IO which eventually evolved into Infiniband. Then I led a sub-team on Intel Network processors that include the Intel Xscale based IXP4XX series of processors. \n \nThen I was one of the Leads in the Intel server processor called Jasper Forest which was one of the first processors to eliminate North Bridges by integrating PCI Express and Crystal Beach DMA functionality into processor die. \n \nFinally, I was micro-architecting the definition of the chipset that was part of the Intel server processors before I transitioned from component development to server platform architecture. Component Design Engineer Intel Corporation 1997  –  June 2010  (13 years) Was involved in all aspects of component design from product definition to product release. \n \nWas involved in multiple ASICs. Started with an ASIC for a protocol called Next Gen IO which eventually evolved into Infiniband. Then I led a sub-team on Intel Network processors that include the Intel Xscale based IXP4XX series of processors. \n \nThen I was one of the Leads in the Intel server processor called Jasper Forest which was one of the first processors to eliminate North Bridges by integrating PCI Express and Crystal Beach DMA functionality into processor die. \n \nFinally, I was micro-architecting the definition of the chipset that was part of the Intel server processors before I transitioned from component development to server platform architecture. Component Design Engineer Symbios Logic 1995  –  1997  (2 years) Was involved in all aspects of component design from product definition to product release. \n \nWas involved in SCSI Target Channel Adapters ASICs. Was also one of the first team to develop first Fibre Channel based Target Channel Adapters in the industry. Component Design Engineer Symbios Logic 1995  –  1997  (2 years) Was involved in all aspects of component design from product definition to product release. \n \nWas involved in SCSI Target Channel Adapters ASICs. Was also one of the first team to develop first Fibre Channel based Target Channel Adapters in the industry. Design Engineer Intelligent Reasoning Systems Inc January 1993  –  April 1995  (2 years 4 months) Was involved in all aspects of component design from product definition to product release. \n \nWas involved in development of a neural network based component for pattern matching, image recognition and industrial automation. Design Engineer Intelligent Reasoning Systems Inc January 1993  –  April 1995  (2 years 4 months) Was involved in all aspects of component design from product definition to product release. \n \nWas involved in development of a neural network based component for pattern matching, image recognition and industrial automation. Skills Hardware Architecture Platform Architecture Hardware Development Component Development System Architecture System Design Technical Leadership Logic Synthesis Low Power Systems Microprocessors Servers SoC RTL design RTL coding RTL Development Static Timing Analysis ASIC Embedded Devices Microarchitecture platform power See 5+     See less Skills  Hardware Architecture Platform Architecture Hardware Development Component Development System Architecture System Design Technical Leadership Logic Synthesis Low Power Systems Microprocessors Servers SoC RTL design RTL coding RTL Development Static Timing Analysis ASIC Embedded Devices Microarchitecture platform power See 5+     See less Hardware Architecture Platform Architecture Hardware Development Component Development System Architecture System Design Technical Leadership Logic Synthesis Low Power Systems Microprocessors Servers SoC RTL design RTL coding RTL Development Static Timing Analysis ASIC Embedded Devices Microarchitecture platform power See 5+     See less Hardware Architecture Platform Architecture Hardware Development Component Development System Architecture System Design Technical Leadership Logic Synthesis Low Power Systems Microprocessors Servers SoC RTL design RTL coding RTL Development Static Timing Analysis ASIC Embedded Devices Microarchitecture platform power See 5+     See less Education Oklahoma State University Master of Science (MS),  Computer Engineering 1990  – 1993 Oklahoma State University Master of Science (MS),  Computer Engineering 1990  – 1993 Oklahoma State University Master of Science (MS),  Computer Engineering 1990  – 1993 Oklahoma State University Master of Science (MS),  Computer Engineering 1990  – 1993 ", "Languages Telugu Telugu Telugu Skills Systems Engineering Platform Architecture Technical Enablement Speech Processing Audio Engineering Digital Signal... SoC Device Drivers DFT Product Engineering VLSI Debugging ASIC Processors Test Engineering Semiconductors Verilog Testing Microprocessors Embedded Systems EDA IC Firmware Mixed Signal See 9+     See less Skills  Systems Engineering Platform Architecture Technical Enablement Speech Processing Audio Engineering Digital Signal... SoC Device Drivers DFT Product Engineering VLSI Debugging ASIC Processors Test Engineering Semiconductors Verilog Testing Microprocessors Embedded Systems EDA IC Firmware Mixed Signal See 9+     See less Systems Engineering Platform Architecture Technical Enablement Speech Processing Audio Engineering Digital Signal... SoC Device Drivers DFT Product Engineering VLSI Debugging ASIC Processors Test Engineering Semiconductors Verilog Testing Microprocessors Embedded Systems EDA IC Firmware Mixed Signal See 9+     See less Systems Engineering Platform Architecture Technical Enablement Speech Processing Audio Engineering Digital Signal... SoC Device Drivers DFT Product Engineering VLSI Debugging ASIC Processors Test Engineering Semiconductors Verilog Testing Microprocessors Embedded Systems EDA IC Firmware Mixed Signal See 9+     See less ", "Experience Platform Architect Intel Corporation October 2009  – Present (5 years 11 months) Portland, OR Micro Servers \nEmerging Cloud Technologies \nCloud Server Architecture Engineering Consultant Independent 2002  –  2009  (7 years) Knoxville, Tennessee Area Data Center efficiency, liquid cooling, blade server design Lead Server Engineer Dell 1998  –  2002  (4 years) Austin, Texas Area Leader of 4 socket Xeon designs for 4U and 7U Dell PowerEdge Servers HW Design Engr, Project Leader, System Architect, Validation Leader NCR Corporation 1985  –  2002  (17 years) Columbia, South Carolina Area Hardware design of industry leading servers. SCSI, FDDI,symmetric multi-processing. Architecture and lead validation. Platform Architect Intel Corporation October 2009  – Present (5 years 11 months) Portland, OR Micro Servers \nEmerging Cloud Technologies \nCloud Server Architecture Platform Architect Intel Corporation October 2009  – Present (5 years 11 months) Portland, OR Micro Servers \nEmerging Cloud Technologies \nCloud Server Architecture Engineering Consultant Independent 2002  –  2009  (7 years) Knoxville, Tennessee Area Data Center efficiency, liquid cooling, blade server design Engineering Consultant Independent 2002  –  2009  (7 years) Knoxville, Tennessee Area Data Center efficiency, liquid cooling, blade server design Lead Server Engineer Dell 1998  –  2002  (4 years) Austin, Texas Area Leader of 4 socket Xeon designs for 4U and 7U Dell PowerEdge Servers Lead Server Engineer Dell 1998  –  2002  (4 years) Austin, Texas Area Leader of 4 socket Xeon designs for 4U and 7U Dell PowerEdge Servers HW Design Engr, Project Leader, System Architect, Validation Leader NCR Corporation 1985  –  2002  (17 years) Columbia, South Carolina Area Hardware design of industry leading servers. SCSI, FDDI,symmetric multi-processing. Architecture and lead validation. HW Design Engr, Project Leader, System Architect, Validation Leader NCR Corporation 1985  –  2002  (17 years) Columbia, South Carolina Area Hardware design of industry leading servers. SCSI, FDDI,symmetric multi-processing. Architecture and lead validation. Skills ASIC SoC Product Management Data Center Microprocessors Engineering Semiconductors System Architecture Servers Server Architecture Hardware Architecture Intel Cloud Computing Embedded Systems Verilog Computer Architecture Processors See 2+     See less Skills  ASIC SoC Product Management Data Center Microprocessors Engineering Semiconductors System Architecture Servers Server Architecture Hardware Architecture Intel Cloud Computing Embedded Systems Verilog Computer Architecture Processors See 2+     See less ASIC SoC Product Management Data Center Microprocessors Engineering Semiconductors System Architecture Servers Server Architecture Hardware Architecture Intel Cloud Computing Embedded Systems Verilog Computer Architecture Processors See 2+     See less ASIC SoC Product Management Data Center Microprocessors Engineering Semiconductors System Architecture Servers Server Architecture Hardware Architecture Intel Cloud Computing Embedded Systems Verilog Computer Architecture Processors See 2+     See less Education University of Tennessee-Knoxville BS,  Electrical Engineering 1980  – 1985 Activities and Societies:  Tau Beta Pi ,  Eta Kappa Nu ,  UT Marching Band University of Tennessee-Knoxville BS,  Electrical Engineering 1980  – 1985 Activities and Societies:  Tau Beta Pi ,  Eta Kappa Nu ,  UT Marching Band University of Tennessee-Knoxville BS,  Electrical Engineering 1980  – 1985 Activities and Societies:  Tau Beta Pi ,  Eta Kappa Nu ,  UT Marching Band University of Tennessee-Knoxville BS,  Electrical Engineering 1980  – 1985 Activities and Societies:  Tau Beta Pi ,  Eta Kappa Nu ,  UT Marching Band ", "Experience Platform Architect Intel Corporation December 2011  – Present (3 years 9 months) Portland, Oregon Platform Architect Intel Corporation June 2005  –  December 2011  (6 years 7 months) Penang, Malaysia Technical Lead Agilent Technologies February 2005  –  June 2005  (5 months) Singapore Senior Staff Engineer Intel Corporation May 2001  –  February 2005  (3 years 10 months) Bangalore, India Technical Lead Hughes Network Systems March 1998  –  May 2001  (3 years 3 months) Gurgaon, India Automation Engineer voestalpine June 1996  –  March 1998  (1 year 10 months) Jamshedpur, India Automation Engineer Tata Steel July 1995  –  June 1996  (1 year) Jamshedpur, India Platform Architect Intel Corporation December 2011  – Present (3 years 9 months) Portland, Oregon Platform Architect Intel Corporation December 2011  – Present (3 years 9 months) Portland, Oregon Platform Architect Intel Corporation June 2005  –  December 2011  (6 years 7 months) Penang, Malaysia Platform Architect Intel Corporation June 2005  –  December 2011  (6 years 7 months) Penang, Malaysia Technical Lead Agilent Technologies February 2005  –  June 2005  (5 months) Singapore Technical Lead Agilent Technologies February 2005  –  June 2005  (5 months) Singapore Senior Staff Engineer Intel Corporation May 2001  –  February 2005  (3 years 10 months) Bangalore, India Senior Staff Engineer Intel Corporation May 2001  –  February 2005  (3 years 10 months) Bangalore, India Technical Lead Hughes Network Systems March 1998  –  May 2001  (3 years 3 months) Gurgaon, India Technical Lead Hughes Network Systems March 1998  –  May 2001  (3 years 3 months) Gurgaon, India Automation Engineer voestalpine June 1996  –  March 1998  (1 year 10 months) Jamshedpur, India Automation Engineer voestalpine June 1996  –  March 1998  (1 year 10 months) Jamshedpur, India Automation Engineer Tata Steel July 1995  –  June 1996  (1 year) Jamshedpur, India Automation Engineer Tata Steel July 1995  –  June 1996  (1 year) Jamshedpur, India Skills Debugging Requirements Analysis Embedded Systems C Software Development Semiconductors Embedded Software SDLC ASIC Shell Scripting Management Microsoft Excel Microsoft Office Microsoft Word RTOS Research Verilog SoC See 3+     See less Skills  Debugging Requirements Analysis Embedded Systems C Software Development Semiconductors Embedded Software SDLC ASIC Shell Scripting Management Microsoft Excel Microsoft Office Microsoft Word RTOS Research Verilog SoC See 3+     See less Debugging Requirements Analysis Embedded Systems C Software Development Semiconductors Embedded Software SDLC ASIC Shell Scripting Management Microsoft Excel Microsoft Office Microsoft Word RTOS Research Verilog SoC See 3+     See less Debugging Requirements Analysis Embedded Systems C Software Development Semiconductors Embedded Software SDLC ASIC Shell Scripting Management Microsoft Excel Microsoft Office Microsoft Word RTOS Research Verilog SoC See 3+     See less Education National Institute of Technology Rourkela Masters,  Computer Science 1991  – 1995 National Institute of Technology Rourkela Masters,  Computer Science 1991  – 1995 National Institute of Technology Rourkela Masters,  Computer Science 1991  – 1995 National Institute of Technology Rourkela Masters,  Computer Science 1991  – 1995 ", "Summary VLSI architect and designer, experienced in both top tear DSP core architecture as well as top tear hi rate communication hardware architecture and design. \n \nHas a top down view of system requirements, HW/SW partition, state of the art architecture, micro-architecture and implementation. Innovative and a team player driving the whole group for better achivments. \n \nSeek to participate and lead VLSI architecture and design of very challenging systems \n \nVLSI architect experienced in top tear, high frequency (1 GHz) DSP core architecture as well as in networking, hi speed accelerators and VLSI in general. Has top down view of system and SW requirements down to VLSI specification.  \nSeek to lead VLSI architecture in very challenging systems, to yield an exceptional performance and innovative edge., to yield an exceptional performance and innovative edge. \n \nSpecialties: VLSI Architecture and design including:  \n- Hi speed, top tear DSP cores architecture \n- Accelerators and network processors for variety needs (FFT, DIgital filters, etc.) \n- High speed network analysis (TCPIP and others) Summary VLSI architect and designer, experienced in both top tear DSP core architecture as well as top tear hi rate communication hardware architecture and design. \n \nHas a top down view of system requirements, HW/SW partition, state of the art architecture, micro-architecture and implementation. Innovative and a team player driving the whole group for better achivments. \n \nSeek to participate and lead VLSI architecture and design of very challenging systems \n \nVLSI architect experienced in top tear, high frequency (1 GHz) DSP core architecture as well as in networking, hi speed accelerators and VLSI in general. Has top down view of system and SW requirements down to VLSI specification.  \nSeek to lead VLSI architecture in very challenging systems, to yield an exceptional performance and innovative edge., to yield an exceptional performance and innovative edge. \n \nSpecialties: VLSI Architecture and design including:  \n- Hi speed, top tear DSP cores architecture \n- Accelerators and network processors for variety needs (FFT, DIgital filters, etc.) \n- High speed network analysis (TCPIP and others) VLSI architect and designer, experienced in both top tear DSP core architecture as well as top tear hi rate communication hardware architecture and design. \n \nHas a top down view of system requirements, HW/SW partition, state of the art architecture, micro-architecture and implementation. Innovative and a team player driving the whole group for better achivments. \n \nSeek to participate and lead VLSI architecture and design of very challenging systems \n \nVLSI architect experienced in top tear, high frequency (1 GHz) DSP core architecture as well as in networking, hi speed accelerators and VLSI in general. Has top down view of system and SW requirements down to VLSI specification.  \nSeek to lead VLSI architecture in very challenging systems, to yield an exceptional performance and innovative edge., to yield an exceptional performance and innovative edge. \n \nSpecialties: VLSI Architecture and design including:  \n- Hi speed, top tear DSP cores architecture \n- Accelerators and network processors for variety needs (FFT, DIgital filters, etc.) \n- High speed network analysis (TCPIP and others) VLSI architect and designer, experienced in both top tear DSP core architecture as well as top tear hi rate communication hardware architecture and design. \n \nHas a top down view of system requirements, HW/SW partition, state of the art architecture, micro-architecture and implementation. Innovative and a team player driving the whole group for better achivments. \n \nSeek to participate and lead VLSI architecture and design of very challenging systems \n \nVLSI architect experienced in top tear, high frequency (1 GHz) DSP core architecture as well as in networking, hi speed accelerators and VLSI in general. Has top down view of system and SW requirements down to VLSI specification.  \nSeek to lead VLSI architecture in very challenging systems, to yield an exceptional performance and innovative edge., to yield an exceptional performance and innovative edge. \n \nSpecialties: VLSI Architecture and design including:  \n- Hi speed, top tear DSP cores architecture \n- Accelerators and network processors for variety needs (FFT, DIgital filters, etc.) \n- High speed network analysis (TCPIP and others) Experience Platform Architect Intel Corporation July 2013  – Present (2 years 2 months) Haifa DSP Core Chief Architect Freescale Semiconductor October 2006  –  June 2013  (6 years 9 months) Herzelia I am Freescale's StarCore DSP core chief architect. In this role I am responsible to define the next generation DSP core's of Freescale, including marketing requirement definitions (according to customers direct feedback, tools feedback, and a forecast of industry future requirements and trends (e.g. multi-core). \nThis role is a direct continuation of my role in StarCore LLC. \nI have defined the latest StarCore DSP core – SC3900 and SC3850 (http://www.dspdesignline.com/showArticle.jhtml;jsessionid=Z01FMMJG444LUQSNDLOSKH0CJUNN2JVN?articleID=212000721&queryText=freescale) that is an evolution of the previous generation SC3400 (I was the architect of it at StarCore LLC). \nNow working among other issues on the next generation of DSP (requirements, interconnect, core vs. accelerates, supervising core definition, etc.) DSP Core Cheif Architect StarCore LLC September 2002  –  October 2006  (4 years 2 months) The Chief Architect of the powerful top tear StarCore DSP core. Under this role I was in charge of the definition of the new generations of the StarCore Family, including the SC3400 - first deep pipelined, hi freq (1 GHz) DSP core in the StarCore family Architect and design P-cube 1999  –  2002  (3 years) Worked as an architect and designer of a system, capable of layer 7 analysis at 1 Gbps (back then). I was involved in the whole system architecture and did the architecture and design of one of the large FPGAs. \nAs part of this role I have mastered the TCP/IP protocols along with various other network protocols and implementation issues. Architect Motorola 1990  –  1999  (9 years) Architect Freescale 1990  –  1999  (9 years) Platform Architect Intel Corporation July 2013  – Present (2 years 2 months) Haifa Platform Architect Intel Corporation July 2013  – Present (2 years 2 months) Haifa DSP Core Chief Architect Freescale Semiconductor October 2006  –  June 2013  (6 years 9 months) Herzelia I am Freescale's StarCore DSP core chief architect. In this role I am responsible to define the next generation DSP core's of Freescale, including marketing requirement definitions (according to customers direct feedback, tools feedback, and a forecast of industry future requirements and trends (e.g. multi-core). \nThis role is a direct continuation of my role in StarCore LLC. \nI have defined the latest StarCore DSP core – SC3900 and SC3850 (http://www.dspdesignline.com/showArticle.jhtml;jsessionid=Z01FMMJG444LUQSNDLOSKH0CJUNN2JVN?articleID=212000721&queryText=freescale) that is an evolution of the previous generation SC3400 (I was the architect of it at StarCore LLC). \nNow working among other issues on the next generation of DSP (requirements, interconnect, core vs. accelerates, supervising core definition, etc.) DSP Core Chief Architect Freescale Semiconductor October 2006  –  June 2013  (6 years 9 months) Herzelia I am Freescale's StarCore DSP core chief architect. In this role I am responsible to define the next generation DSP core's of Freescale, including marketing requirement definitions (according to customers direct feedback, tools feedback, and a forecast of industry future requirements and trends (e.g. multi-core). \nThis role is a direct continuation of my role in StarCore LLC. \nI have defined the latest StarCore DSP core – SC3900 and SC3850 (http://www.dspdesignline.com/showArticle.jhtml;jsessionid=Z01FMMJG444LUQSNDLOSKH0CJUNN2JVN?articleID=212000721&queryText=freescale) that is an evolution of the previous generation SC3400 (I was the architect of it at StarCore LLC). \nNow working among other issues on the next generation of DSP (requirements, interconnect, core vs. accelerates, supervising core definition, etc.) DSP Core Cheif Architect StarCore LLC September 2002  –  October 2006  (4 years 2 months) The Chief Architect of the powerful top tear StarCore DSP core. Under this role I was in charge of the definition of the new generations of the StarCore Family, including the SC3400 - first deep pipelined, hi freq (1 GHz) DSP core in the StarCore family DSP Core Cheif Architect StarCore LLC September 2002  –  October 2006  (4 years 2 months) The Chief Architect of the powerful top tear StarCore DSP core. Under this role I was in charge of the definition of the new generations of the StarCore Family, including the SC3400 - first deep pipelined, hi freq (1 GHz) DSP core in the StarCore family Architect and design P-cube 1999  –  2002  (3 years) Worked as an architect and designer of a system, capable of layer 7 analysis at 1 Gbps (back then). I was involved in the whole system architecture and did the architecture and design of one of the large FPGAs. \nAs part of this role I have mastered the TCP/IP protocols along with various other network protocols and implementation issues. Architect and design P-cube 1999  –  2002  (3 years) Worked as an architect and designer of a system, capable of layer 7 analysis at 1 Gbps (back then). I was involved in the whole system architecture and did the architecture and design of one of the large FPGAs. \nAs part of this role I have mastered the TCP/IP protocols along with various other network protocols and implementation issues. Architect Motorola 1990  –  1999  (9 years) Architect Motorola 1990  –  1999  (9 years) Architect Freescale 1990  –  1999  (9 years) Architect Freescale 1990  –  1999  (9 years) Languages Hebrew Native or bilingual proficiency English Professional working proficiency Hebrew Native or bilingual proficiency English Professional working proficiency Hebrew Native or bilingual proficiency English Professional working proficiency Native or bilingual proficiency Professional working proficiency Skills VLSI Architecture Network Processors IP Networking Hardware DSP FPGA ASIC Firmware Verilog SoC Microprocessors Computer Architecture Microcontrollers Assembly RTL design CPU design Digital Image Processing Network Communications VoIP Wireless Digital Signal... Logic Design Embedded Systems Processors Mixed Signal IC Hardware Architecture Integrated Circuit... Microarchitecture Communication Protocols ARM Debugging See 18+     See less Skills  VLSI Architecture Network Processors IP Networking Hardware DSP FPGA ASIC Firmware Verilog SoC Microprocessors Computer Architecture Microcontrollers Assembly RTL design CPU design Digital Image Processing Network Communications VoIP Wireless Digital Signal... Logic Design Embedded Systems Processors Mixed Signal IC Hardware Architecture Integrated Circuit... Microarchitecture Communication Protocols ARM Debugging See 18+     See less VLSI Architecture Network Processors IP Networking Hardware DSP FPGA ASIC Firmware Verilog SoC Microprocessors Computer Architecture Microcontrollers Assembly RTL design CPU design Digital Image Processing Network Communications VoIP Wireless Digital Signal... Logic Design Embedded Systems Processors Mixed Signal IC Hardware Architecture Integrated Circuit... Microarchitecture Communication Protocols ARM Debugging See 18+     See less VLSI Architecture Network Processors IP Networking Hardware DSP FPGA ASIC Firmware Verilog SoC Microprocessors Computer Architecture Microcontrollers Assembly RTL design CPU design Digital Image Processing Network Communications VoIP Wireless Digital Signal... Logic Design Embedded Systems Processors Mixed Signal IC Hardware Architecture Integrated Circuit... Microarchitecture Communication Protocols ARM Debugging See 18+     See less Education Tel Aviv University Bsc (cum laude),  Electronic Engineering 1981  – 1985 Handasaim Tel Aviv University Bsc (cum laude),  Electronic Engineering 1981  – 1985 Tel Aviv University Bsc (cum laude),  Electronic Engineering 1981  – 1985 Tel Aviv University Bsc (cum laude),  Electronic Engineering 1981  – 1985 Handasaim Handasaim Handasaim Honors & Awards Additional Honors & Awards Patent awarded — \nUS2005190694, US20000547034, GB2399199, FR2719430, US6928482, US6055556, US6032168, US6023719, US6003058 , US5968112, US5946039, US5923575, US5710944 Additional Honors & Awards Patent awarded — \nUS2005190694, US20000547034, GB2399199, FR2719430, US6928482, US6055556, US6032168, US6023719, US6003058 , US5968112, US5946039, US5923575, US5710944 Additional Honors & Awards Patent awarded — \nUS2005190694, US20000547034, GB2399199, FR2719430, US6928482, US6055556, US6032168, US6023719, US6003058 , US5968112, US5946039, US5923575, US5710944 Additional Honors & Awards Patent awarded — \nUS2005190694, US20000547034, GB2399199, FR2719430, US6928482, US6055556, US6032168, US6023719, US6003058 , US5968112, US5946039, US5923575, US5710944 ", "Summary Specialties:Satellite and Mobile Communications Systems and Theory, DSP Algorithm Development, Control Systems and Theory, RF Systems, Digital Hardware Design and Development, Significant Texas Instruments DSP and MSP430 Embedded Design (Hardware and Software), Low Power (Battery-Operated) Hardware Design, Rapid Prototyping Methodologies. Summary Specialties:Satellite and Mobile Communications Systems and Theory, DSP Algorithm Development, Control Systems and Theory, RF Systems, Digital Hardware Design and Development, Significant Texas Instruments DSP and MSP430 Embedded Design (Hardware and Software), Low Power (Battery-Operated) Hardware Design, Rapid Prototyping Methodologies. Specialties:Satellite and Mobile Communications Systems and Theory, DSP Algorithm Development, Control Systems and Theory, RF Systems, Digital Hardware Design and Development, Significant Texas Instruments DSP and MSP430 Embedded Design (Hardware and Software), Low Power (Battery-Operated) Hardware Design, Rapid Prototyping Methodologies. Specialties:Satellite and Mobile Communications Systems and Theory, DSP Algorithm Development, Control Systems and Theory, RF Systems, Digital Hardware Design and Development, Significant Texas Instruments DSP and MSP430 Embedded Design (Hardware and Software), Low Power (Battery-Operated) Hardware Design, Rapid Prototyping Methodologies. Experience Platform Architect Intel Corporation March 2015  – Present (6 months) Chandler, AZ Internet of Things Group (IOTG), Platform Enabling and Development (PED), Platform Engineering (PE), Platform Architecture, Silicon Validation, and Quick-Turn Prototype Implementations. Quark-based MCU platforms. Wireless Sensors and Systems. Principal Systems Engineer DataSoft Corporation July 2008  –  February 2015  (6 years 8 months) SDR and JTRS Radio Development. Wireless Accessories for Tactical Radios. Rapid Hardware Development. Technical Lead and Hardware Engineering Manager. VP of Engineering Space Data Corporation 2000  –  2008  (8 years) Senior Member of the Technical Staff Radyne Corporation 1995  –  1999  (4 years) Member of the Technical Staff EFData 1993  –  1995  (2 years) Member of the Technical Staff California Microwave/EF Data 1993  –  1995  (2 years) Platform Architect Intel Corporation March 2015  – Present (6 months) Chandler, AZ Internet of Things Group (IOTG), Platform Enabling and Development (PED), Platform Engineering (PE), Platform Architecture, Silicon Validation, and Quick-Turn Prototype Implementations. Quark-based MCU platforms. Wireless Sensors and Systems. Platform Architect Intel Corporation March 2015  – Present (6 months) Chandler, AZ Internet of Things Group (IOTG), Platform Enabling and Development (PED), Platform Engineering (PE), Platform Architecture, Silicon Validation, and Quick-Turn Prototype Implementations. Quark-based MCU platforms. Wireless Sensors and Systems. Principal Systems Engineer DataSoft Corporation July 2008  –  February 2015  (6 years 8 months) SDR and JTRS Radio Development. Wireless Accessories for Tactical Radios. Rapid Hardware Development. Technical Lead and Hardware Engineering Manager. Principal Systems Engineer DataSoft Corporation July 2008  –  February 2015  (6 years 8 months) SDR and JTRS Radio Development. Wireless Accessories for Tactical Radios. Rapid Hardware Development. Technical Lead and Hardware Engineering Manager. VP of Engineering Space Data Corporation 2000  –  2008  (8 years) VP of Engineering Space Data Corporation 2000  –  2008  (8 years) Senior Member of the Technical Staff Radyne Corporation 1995  –  1999  (4 years) Senior Member of the Technical Staff Radyne Corporation 1995  –  1999  (4 years) Member of the Technical Staff EFData 1993  –  1995  (2 years) Member of the Technical Staff EFData 1993  –  1995  (2 years) Member of the Technical Staff California Microwave/EF Data 1993  –  1995  (2 years) Member of the Technical Staff California Microwave/EF Data 1993  –  1995  (2 years) Skills Hardware Architecture Digital Electronics Digital Signal... Engineering Hardware Software Engineering Software Defined Radio Linux Embedded Software Electronics Systems Engineering Embedded Systems System Design RF Perl Simulink C Debugging See 3+     See less Skills  Hardware Architecture Digital Electronics Digital Signal... Engineering Hardware Software Engineering Software Defined Radio Linux Embedded Software Electronics Systems Engineering Embedded Systems System Design RF Perl Simulink C Debugging See 3+     See less Hardware Architecture Digital Electronics Digital Signal... Engineering Hardware Software Engineering Software Defined Radio Linux Embedded Software Electronics Systems Engineering Embedded Systems System Design RF Perl Simulink C Debugging See 3+     See less Hardware Architecture Digital Electronics Digital Signal... Engineering Hardware Software Engineering Software Defined Radio Linux Embedded Software Electronics Systems Engineering Embedded Systems System Design RF Perl Simulink C Debugging See 3+     See less Education Stanford University MSEE,  Digital Signal Processing and Digital Communications 1988  – 1992 Virginia Polytechnic Institute and State University BSEE,  Digital Signal Processing and Digital Communications 1983  – 1987 Magna Cum Laude, General Motors Scholar Activities and Societies:  Tau Beta Pi ,  HKN Stanford University MSEE,  Digital Signal Processing and Digital Communications 1988  – 1992 Stanford University MSEE,  Digital Signal Processing and Digital Communications 1988  – 1992 Stanford University MSEE,  Digital Signal Processing and Digital Communications 1988  – 1992 Virginia Polytechnic Institute and State University BSEE,  Digital Signal Processing and Digital Communications 1983  – 1987 Magna Cum Laude, General Motors Scholar Activities and Societies:  Tau Beta Pi ,  HKN Virginia Polytechnic Institute and State University BSEE,  Digital Signal Processing and Digital Communications 1983  – 1987 Magna Cum Laude, General Motors Scholar Activities and Societies:  Tau Beta Pi ,  HKN Virginia Polytechnic Institute and State University BSEE,  Digital Signal Processing and Digital Communications 1983  – 1987 Magna Cum Laude, General Motors Scholar Activities and Societies:  Tau Beta Pi ,  HKN ", "Languages English English English Skills Intel Computer Architecture PCIe Server Platform... Embedded Systems Analytics Hardware Mentoring Debugging Bios Device Drivers X86 Firmware Software Engineering Cloud Computing Data Center Processors Microprocessors Multithreading C Linux Kernel Embedded Software Embedded Linux Architecture RTOS Architectures Hardware Architecture System Architecture See 13+     See less Skills  Intel Computer Architecture PCIe Server Platform... Embedded Systems Analytics Hardware Mentoring Debugging Bios Device Drivers X86 Firmware Software Engineering Cloud Computing Data Center Processors Microprocessors Multithreading C Linux Kernel Embedded Software Embedded Linux Architecture RTOS Architectures Hardware Architecture System Architecture See 13+     See less Intel Computer Architecture PCIe Server Platform... Embedded Systems Analytics Hardware Mentoring Debugging Bios Device Drivers X86 Firmware Software Engineering Cloud Computing Data Center Processors Microprocessors Multithreading C Linux Kernel Embedded Software Embedded Linux Architecture RTOS Architectures Hardware Architecture System Architecture See 13+     See less Intel Computer Architecture PCIe Server Platform... Embedded Systems Analytics Hardware Mentoring Debugging Bios Device Drivers X86 Firmware Software Engineering Cloud Computing Data Center Processors Microprocessors Multithreading C Linux Kernel Embedded Software Embedded Linux Architecture RTOS Architectures Hardware Architecture System Architecture See 13+     See less ", "Summary Luis Gimenez is a Platform Computing Architect in the PC Client Group at Intel, focusing in the Business Computing Client.  \nSince join Intel Luis several technical and management positions including Visual and Parallel Computing Architect, leading the IT Innovation center and IT research in Americas, and he was Regional IT Manager for the Americas Region. He also managed several factory start-ups including Intel Costa Rica startup. In 2000 Gimenez won an Intel Achievement Award for setting a new standard for the industry on downtime and speed for SAP upgrades worldwide.  \n \nLuis also taught Managing IT in the Graduate school of Management in the University of California Davis. \n \nGimenez holds a title of Electronic Engineer from the University of Mendoza Argentina, an MBA and Masters on Economics from ESEADE Argentina and a Masters of International Management from Thunderbird Arizona. \n \nHe resides with his wife in Granite Bay California \n \nSpecialties \nTechnology Management • Innovation and Path Finding • Research & Development • Strategic Planning • Technical Program Management • Cross-Functional Team Leadership • Software Engineering • Agile Product Owner • International Business • Information Technology (IT) • Client/Vendor Relations, ISV enabling • Public Speaking • Fluent in Spanish & German Summary Luis Gimenez is a Platform Computing Architect in the PC Client Group at Intel, focusing in the Business Computing Client.  \nSince join Intel Luis several technical and management positions including Visual and Parallel Computing Architect, leading the IT Innovation center and IT research in Americas, and he was Regional IT Manager for the Americas Region. He also managed several factory start-ups including Intel Costa Rica startup. In 2000 Gimenez won an Intel Achievement Award for setting a new standard for the industry on downtime and speed for SAP upgrades worldwide.  \n \nLuis also taught Managing IT in the Graduate school of Management in the University of California Davis. \n \nGimenez holds a title of Electronic Engineer from the University of Mendoza Argentina, an MBA and Masters on Economics from ESEADE Argentina and a Masters of International Management from Thunderbird Arizona. \n \nHe resides with his wife in Granite Bay California \n \nSpecialties \nTechnology Management • Innovation and Path Finding • Research & Development • Strategic Planning • Technical Program Management • Cross-Functional Team Leadership • Software Engineering • Agile Product Owner • International Business • Information Technology (IT) • Client/Vendor Relations, ISV enabling • Public Speaking • Fluent in Spanish & German Luis Gimenez is a Platform Computing Architect in the PC Client Group at Intel, focusing in the Business Computing Client.  \nSince join Intel Luis several technical and management positions including Visual and Parallel Computing Architect, leading the IT Innovation center and IT research in Americas, and he was Regional IT Manager for the Americas Region. He also managed several factory start-ups including Intel Costa Rica startup. In 2000 Gimenez won an Intel Achievement Award for setting a new standard for the industry on downtime and speed for SAP upgrades worldwide.  \n \nLuis also taught Managing IT in the Graduate school of Management in the University of California Davis. \n \nGimenez holds a title of Electronic Engineer from the University of Mendoza Argentina, an MBA and Masters on Economics from ESEADE Argentina and a Masters of International Management from Thunderbird Arizona. \n \nHe resides with his wife in Granite Bay California \n \nSpecialties \nTechnology Management • Innovation and Path Finding • Research & Development • Strategic Planning • Technical Program Management • Cross-Functional Team Leadership • Software Engineering • Agile Product Owner • International Business • Information Technology (IT) • Client/Vendor Relations, ISV enabling • Public Speaking • Fluent in Spanish & German Luis Gimenez is a Platform Computing Architect in the PC Client Group at Intel, focusing in the Business Computing Client.  \nSince join Intel Luis several technical and management positions including Visual and Parallel Computing Architect, leading the IT Innovation center and IT research in Americas, and he was Regional IT Manager for the Americas Region. He also managed several factory start-ups including Intel Costa Rica startup. In 2000 Gimenez won an Intel Achievement Award for setting a new standard for the industry on downtime and speed for SAP upgrades worldwide.  \n \nLuis also taught Managing IT in the Graduate school of Management in the University of California Davis. \n \nGimenez holds a title of Electronic Engineer from the University of Mendoza Argentina, an MBA and Masters on Economics from ESEADE Argentina and a Masters of International Management from Thunderbird Arizona. \n \nHe resides with his wife in Granite Bay California \n \nSpecialties \nTechnology Management • Innovation and Path Finding • Research & Development • Strategic Planning • Technical Program Management • Cross-Functional Team Leadership • Software Engineering • Agile Product Owner • International Business • Information Technology (IT) • Client/Vendor Relations, ISV enabling • Public Speaking • Fluent in Spanish & German Languages spanish Native or bilingual proficiency german Full professional proficiency spanish Native or bilingual proficiency german Full professional proficiency spanish Native or bilingual proficiency german Full professional proficiency Native or bilingual proficiency Full professional proficiency Skills Strategy Semiconductors Cross-functional Team... Start-ups Program Management Product Management Strategic Partnerships R&D Competitive Analysis Innovation Management Enterprise Software Management Software Development IT Management Agile Project Management Product Lifecycle... Leadership Enterprise Architecture Intel Integrated Marketing Change Management Electronics Product Development Product Marketing Team Management Mobile Devices Software Engineering Project Management Process Improvement IC Analytics Developer Relations Business Process... Business Intelligence Management Consulting Cloud Computing Software Solution... Software Development... Engineering Management Agile Methodolgy GPU System Architecture GPGPU Agile Methodologies See 29+     See less Skills  Strategy Semiconductors Cross-functional Team... Start-ups Program Management Product Management Strategic Partnerships R&D Competitive Analysis Innovation Management Enterprise Software Management Software Development IT Management Agile Project Management Product Lifecycle... Leadership Enterprise Architecture Intel Integrated Marketing Change Management Electronics Product Development Product Marketing Team Management Mobile Devices Software Engineering Project Management Process Improvement IC Analytics Developer Relations Business Process... Business Intelligence Management Consulting Cloud Computing Software Solution... Software Development... Engineering Management Agile Methodolgy GPU System Architecture GPGPU Agile Methodologies See 29+     See less Strategy Semiconductors Cross-functional Team... Start-ups Program Management Product Management Strategic Partnerships R&D Competitive Analysis Innovation Management Enterprise Software Management Software Development IT Management Agile Project Management Product Lifecycle... Leadership Enterprise Architecture Intel Integrated Marketing Change Management Electronics Product Development Product Marketing Team Management Mobile Devices Software Engineering Project Management Process Improvement IC Analytics Developer Relations Business Process... Business Intelligence Management Consulting Cloud Computing Software Solution... Software Development... Engineering Management Agile Methodolgy GPU System Architecture GPGPU Agile Methodologies See 29+     See less Strategy Semiconductors Cross-functional Team... Start-ups Program Management Product Management Strategic Partnerships R&D Competitive Analysis Innovation Management Enterprise Software Management Software Development IT Management Agile Project Management Product Lifecycle... Leadership Enterprise Architecture Intel Integrated Marketing Change Management Electronics Product Development Product Marketing Team Management Mobile Devices Software Engineering Project Management Process Improvement IC Analytics Developer Relations Business Process... Business Intelligence Management Consulting Cloud Computing Software Solution... Software Development... Engineering Management Agile Methodolgy GPU System Architecture GPGPU Agile Methodologies See 29+     See less Education Thunderbird School of Global Management EMIM,  International Management 1993  – 1995 ESEADE Escuale Superior De Administracion de Empresas, Buenos Aires Argentina MS,  Economics and Business Administration Universidad de Mendoza Ingeniero Electronico,  Electronics Thunderbird School of Global Management EMIM,  International Management 1993  – 1995 Thunderbird School of Global Management EMIM,  International Management 1993  – 1995 Thunderbird School of Global Management EMIM,  International Management 1993  – 1995 ESEADE Escuale Superior De Administracion de Empresas, Buenos Aires Argentina MS,  Economics and Business Administration ESEADE Escuale Superior De Administracion de Empresas, Buenos Aires Argentina MS,  Economics and Business Administration ESEADE Escuale Superior De Administracion de Empresas, Buenos Aires Argentina MS,  Economics and Business Administration Universidad de Mendoza Ingeniero Electronico,  Electronics Universidad de Mendoza Ingeniero Electronico,  Electronics Universidad de Mendoza Ingeniero Electronico,  Electronics ", "Experience Platform Architect Intel Corporation August 2013  – Present (2 years 1 month) Intern Intel Corporation February 2013  –  July 2013  (6 months) Intern THALES ALENIA SPACE June 2012  –  August 2012  (3 months) Intern THALES ALENIA SPACE June 2011  –  July 2011  (2 months) Platform Architect Intel Corporation August 2013  – Present (2 years 1 month) Platform Architect Intel Corporation August 2013  – Present (2 years 1 month) Intern Intel Corporation February 2013  –  July 2013  (6 months) Intern Intel Corporation February 2013  –  July 2013  (6 months) Intern THALES ALENIA SPACE June 2012  –  August 2012  (3 months) Intern THALES ALENIA SPACE June 2012  –  August 2012  (3 months) Intern THALES ALENIA SPACE June 2011  –  July 2011  (2 months) Intern THALES ALENIA SPACE June 2011  –  July 2011  (2 months) Education Polytech Nice-Sophia 2008  – 2013 Centre International de Valbonne 2006  – 2008 Polytech Nice-Sophia 2008  – 2013 Polytech Nice-Sophia 2008  – 2013 Polytech Nice-Sophia 2008  – 2013 Centre International de Valbonne 2006  – 2008 Centre International de Valbonne 2006  – 2008 Centre International de Valbonne 2006  – 2008 ", "Summary Specialties:Application Processor SoC, IA, ARM, Linux, Android, Microsoft Windows Mobile, Multimedia Summary Specialties:Application Processor SoC, IA, ARM, Linux, Android, Microsoft Windows Mobile, Multimedia Specialties:Application Processor SoC, IA, ARM, Linux, Android, Microsoft Windows Mobile, Multimedia Specialties:Application Processor SoC, IA, ARM, Linux, Android, Microsoft Windows Mobile, Multimedia Experience Platform Architect Intel Corporation October 2013  – Present (1 year 11 months) Bengaluru Area, India System Engineer Intel Corporation August 2010  –  October 2013  (3 years 3 months) Bengaluru Area, India Sr. Design Engineer ST-Ericsson February 2009  –  August 2010  (1 year 7 months) Bengaluru Area, India Sr Design Engineer ST-NXP Wireless August 2008  –  February 2009  (7 months) Design Engineer STMicroelectronics Pvt Ltd July 2006  –  August 2008  (2 years 2 months) Bengaluru Area, India Intern STMicroelectronics January 2006  –  June 2006  (6 months) Bengaluru Area, India Platform Architect Intel Corporation October 2013  – Present (1 year 11 months) Bengaluru Area, India Platform Architect Intel Corporation October 2013  – Present (1 year 11 months) Bengaluru Area, India System Engineer Intel Corporation August 2010  –  October 2013  (3 years 3 months) Bengaluru Area, India System Engineer Intel Corporation August 2010  –  October 2013  (3 years 3 months) Bengaluru Area, India Sr. Design Engineer ST-Ericsson February 2009  –  August 2010  (1 year 7 months) Bengaluru Area, India Sr. Design Engineer ST-Ericsson February 2009  –  August 2010  (1 year 7 months) Bengaluru Area, India Sr Design Engineer ST-NXP Wireless August 2008  –  February 2009  (7 months) Sr Design Engineer ST-NXP Wireless August 2008  –  February 2009  (7 months) Design Engineer STMicroelectronics Pvt Ltd July 2006  –  August 2008  (2 years 2 months) Bengaluru Area, India Design Engineer STMicroelectronics Pvt Ltd July 2006  –  August 2008  (2 years 2 months) Bengaluru Area, India Intern STMicroelectronics January 2006  –  June 2006  (6 months) Bengaluru Area, India Intern STMicroelectronics January 2006  –  June 2006  (6 months) Bengaluru Area, India Languages English Full professional proficiency Marathi Full professional proficiency Hindi Full professional proficiency English Full professional proficiency Marathi Full professional proficiency Hindi Full professional proficiency English Full professional proficiency Marathi Full professional proficiency Hindi Full professional proficiency Full professional proficiency Full professional proficiency Full professional proficiency Skills Android ARM Linux SoC Embedded Systems Debugging Embedded Software Mobile Communications Device Drivers Windows Mobile X86 Atom Linux Kernel ASIC RTOS Embedded Linux C C++ See 3+     See less Skills  Android ARM Linux SoC Embedded Systems Debugging Embedded Software Mobile Communications Device Drivers Windows Mobile X86 Atom Linux Kernel ASIC RTOS Embedded Linux C C++ See 3+     See less Android ARM Linux SoC Embedded Systems Debugging Embedded Software Mobile Communications Device Drivers Windows Mobile X86 Atom Linux Kernel ASIC RTOS Embedded Linux C C++ See 3+     See less Android ARM Linux SoC Embedded Systems Debugging Embedded Software Mobile Communications Device Drivers Windows Mobile X86 Atom Linux Kernel ASIC RTOS Embedded Linux C C++ See 3+     See less Education Birla Institute of Technology and Science Master of Engineering,  Communication Systems , 8.54/10 2004  – 2006 Doctor Babasaheb Ambedkar Marathwada University Bachelor of Engineering,  Electronics & Telecommunication , 75% 1999  – 2003 Birla Institute of Technology and Science Master of Engineering,  Communication Systems , 8.54/10 2004  – 2006 Birla Institute of Technology and Science Master of Engineering,  Communication Systems , 8.54/10 2004  – 2006 Birla Institute of Technology and Science Master of Engineering,  Communication Systems , 8.54/10 2004  – 2006 Doctor Babasaheb Ambedkar Marathwada University Bachelor of Engineering,  Electronics & Telecommunication , 75% 1999  – 2003 Doctor Babasaheb Ambedkar Marathwada University Bachelor of Engineering,  Electronics & Telecommunication , 75% 1999  – 2003 Doctor Babasaheb Ambedkar Marathwada University Bachelor of Engineering,  Electronics & Telecommunication , 75% 1999  – 2003 ", "Summary I am excited about my work, where I direct the architecture development of innovative computing & communicating devices, and drive silicon and board design strategies to meet business opportunities. Summary I am excited about my work, where I direct the architecture development of innovative computing & communicating devices, and drive silicon and board design strategies to meet business opportunities. I am excited about my work, where I direct the architecture development of innovative computing & communicating devices, and drive silicon and board design strategies to meet business opportunities. I am excited about my work, where I direct the architecture development of innovative computing & communicating devices, and drive silicon and board design strategies to meet business opportunities. Experience Platform Architect Intel Corporation 1998  – Present (17 years) SSG Open Source Technology Center, Open Source Embedded Systems \nPC Client Group - Advanced Client FFRD Platforms \nChannel Platforms & Strategy Division - Intel Client Boards Division \nDigital Home Group - Platform Hardware Engineering \nMobile Platforms Group - Advanced Product Architecture \nNew Business Initiatives - RFID Operation \nNew Business Initiatives - Handheld Graphics Operation \nConnected Products Division Screenwriter Self employed 2005  – Present (10 years) Screenwriter, script consultant, story analyst Platform Architect Intel Capital, NBI (RFID) 2004  –  2007  (3 years) Platform Architect Intel Capital 2001  –  2007  (6 years) Platform Architect Intel Corporation 1998  – Present (17 years) SSG Open Source Technology Center, Open Source Embedded Systems \nPC Client Group - Advanced Client FFRD Platforms \nChannel Platforms & Strategy Division - Intel Client Boards Division \nDigital Home Group - Platform Hardware Engineering \nMobile Platforms Group - Advanced Product Architecture \nNew Business Initiatives - RFID Operation \nNew Business Initiatives - Handheld Graphics Operation \nConnected Products Division Platform Architect Intel Corporation 1998  – Present (17 years) SSG Open Source Technology Center, Open Source Embedded Systems \nPC Client Group - Advanced Client FFRD Platforms \nChannel Platforms & Strategy Division - Intel Client Boards Division \nDigital Home Group - Platform Hardware Engineering \nMobile Platforms Group - Advanced Product Architecture \nNew Business Initiatives - RFID Operation \nNew Business Initiatives - Handheld Graphics Operation \nConnected Products Division Screenwriter Self employed 2005  – Present (10 years) Screenwriter, script consultant, story analyst Screenwriter Self employed 2005  – Present (10 years) Screenwriter, script consultant, story analyst Platform Architect Intel Capital, NBI (RFID) 2004  –  2007  (3 years) Platform Architect Intel Capital, NBI (RFID) 2004  –  2007  (3 years) Platform Architect Intel Capital 2001  –  2007  (6 years) Platform Architect Intel Capital 2001  –  2007  (6 years) Skills SoC Processors Semiconductors ASIC PCB design Intel Debugging Skills  SoC Processors Semiconductors ASIC PCB design Intel Debugging SoC Processors Semiconductors ASIC PCB design Intel Debugging SoC Processors Semiconductors ASIC PCB design Intel Debugging Education Oregon Health and Science University Graduate Studies,  Electronic Engineering ,  Biophysics 1995  – 2014 Oregon Health and Science University MSEE,  Electronic Engineering 1990  – 1994 University of Brighton BSc (hons),  Electrical and Electronic Engineering 1982  – 1986 Harbin Institute of Technology Summer Vacation Short-Term Mandarin Language Training Program 2014  – 2014 Oregon Health and Science University Graduate Studies,  Electronic Engineering ,  Biophysics 1995  – 2014 Oregon Health and Science University Graduate Studies,  Electronic Engineering ,  Biophysics 1995  – 2014 Oregon Health and Science University Graduate Studies,  Electronic Engineering ,  Biophysics 1995  – 2014 Oregon Health and Science University MSEE,  Electronic Engineering 1990  – 1994 Oregon Health and Science University MSEE,  Electronic Engineering 1990  – 1994 Oregon Health and Science University MSEE,  Electronic Engineering 1990  – 1994 University of Brighton BSc (hons),  Electrical and Electronic Engineering 1982  – 1986 University of Brighton BSc (hons),  Electrical and Electronic Engineering 1982  – 1986 University of Brighton BSc (hons),  Electrical and Electronic Engineering 1982  – 1986 Harbin Institute of Technology Summer Vacation Short-Term Mandarin Language Training Program 2014  – 2014 Harbin Institute of Technology Summer Vacation Short-Term Mandarin Language Training Program 2014  – 2014 Harbin Institute of Technology Summer Vacation Short-Term Mandarin Language Training Program 2014  – 2014 ", "Summary I am an Android Power and Performance Platform Architect at Intel working on the tablet and phone product lines. I work with hardware and software architects across several domains these devices get used in to meet aggressive PnP targets. \n \nI also actively collaborate with academia. My recent publications have been at ISCA 2015, HPCA 2015, MICRO 2014, SIGMETRICS 2014. I also am part of the review committees of ASPLOS 2015, IPDPS 2015, HPCA 2015, ISCA 2015. Summary I am an Android Power and Performance Platform Architect at Intel working on the tablet and phone product lines. I work with hardware and software architects across several domains these devices get used in to meet aggressive PnP targets. \n \nI also actively collaborate with academia. My recent publications have been at ISCA 2015, HPCA 2015, MICRO 2014, SIGMETRICS 2014. I also am part of the review committees of ASPLOS 2015, IPDPS 2015, HPCA 2015, ISCA 2015. I am an Android Power and Performance Platform Architect at Intel working on the tablet and phone product lines. I work with hardware and software architects across several domains these devices get used in to meet aggressive PnP targets. \n \nI also actively collaborate with academia. My recent publications have been at ISCA 2015, HPCA 2015, MICRO 2014, SIGMETRICS 2014. I also am part of the review committees of ASPLOS 2015, IPDPS 2015, HPCA 2015, ISCA 2015. I am an Android Power and Performance Platform Architect at Intel working on the tablet and phone product lines. I work with hardware and software architects across several domains these devices get used in to meet aggressive PnP targets. \n \nI also actively collaborate with academia. My recent publications have been at ISCA 2015, HPCA 2015, MICRO 2014, SIGMETRICS 2014. I also am part of the review committees of ASPLOS 2015, IPDPS 2015, HPCA 2015, ISCA 2015. Experience Platform Architect Intel Corporation May 2013  – Present (2 years 4 months) I am an Android Power and Performance Platform Architect at Intel working on the tablet and phone product lines. I work with hardware and software architects across several domains these devices get used in to meet aggressive PnP targets. Software Engineer Intel Corporation September 2010  –  May 2013  (2 years 9 months) Component Modeling Intern - AMD Research (RADL) AMD February 2010  –  May 2010  (4 months) Greater Seattle Area Intern Intel Corporation April 2007  –  November 2007  (8 months) Hudson Reliability Architect Platform Architect Intel Corporation May 2013  – Present (2 years 4 months) I am an Android Power and Performance Platform Architect at Intel working on the tablet and phone product lines. I work with hardware and software architects across several domains these devices get used in to meet aggressive PnP targets. Platform Architect Intel Corporation May 2013  – Present (2 years 4 months) I am an Android Power and Performance Platform Architect at Intel working on the tablet and phone product lines. I work with hardware and software architects across several domains these devices get used in to meet aggressive PnP targets. Software Engineer Intel Corporation September 2010  –  May 2013  (2 years 9 months) Component Modeling Software Engineer Intel Corporation September 2010  –  May 2013  (2 years 9 months) Component Modeling Intern - AMD Research (RADL) AMD February 2010  –  May 2010  (4 months) Greater Seattle Area Intern - AMD Research (RADL) AMD February 2010  –  May 2010  (4 months) Greater Seattle Area Intern Intel Corporation April 2007  –  November 2007  (8 months) Hudson Reliability Architect Intern Intel Corporation April 2007  –  November 2007  (8 months) Hudson Reliability Architect Languages Tamil Tamil Tamil Skills Computer Architecture VLSI Processors C Verilog Debugging Embedded Systems Algorithms VHDL Android Power Management Smartphones Virtual Prototyping Perl C++ SoC Linux Java Device Drivers Python Simulations Semiconductors EDA ASIC Android Tablets Microprocessors See 11+     See less Skills  Computer Architecture VLSI Processors C Verilog Debugging Embedded Systems Algorithms VHDL Android Power Management Smartphones Virtual Prototyping Perl C++ SoC Linux Java Device Drivers Python Simulations Semiconductors EDA ASIC Android Tablets Microprocessors See 11+     See less Computer Architecture VLSI Processors C Verilog Debugging Embedded Systems Algorithms VHDL Android Power Management Smartphones Virtual Prototyping Perl C++ SoC Linux Java Device Drivers Python Simulations Semiconductors EDA ASIC Android Tablets Microprocessors See 11+     See less Computer Architecture VLSI Processors C Verilog Debugging Embedded Systems Algorithms VHDL Android Power Management Smartphones Virtual Prototyping Perl C++ SoC Linux Java Device Drivers Python Simulations Semiconductors EDA ASIC Android Tablets Microprocessors See 11+     See less Education Penn State University Doctor of Philosophy (PhD),  Computer Science and Engineering 2005  – 2010 PhD in Computer Architecture. I looked at Reliability issues, Impact of Process Variation, NBTI, HCE, Soft transient errors, and provided solutions to address them without losing performance. Sri Venkateshwara College Of Engineering Bachelor of Engineering (B.E.),  Computer science and engineering 2000  – 2004 Computer Science and Engineering. Penn State University Doctor of Philosophy (PhD),  Computer Science and Engineering 2005  – 2010 PhD in Computer Architecture. I looked at Reliability issues, Impact of Process Variation, NBTI, HCE, Soft transient errors, and provided solutions to address them without losing performance. Penn State University Doctor of Philosophy (PhD),  Computer Science and Engineering 2005  – 2010 PhD in Computer Architecture. I looked at Reliability issues, Impact of Process Variation, NBTI, HCE, Soft transient errors, and provided solutions to address them without losing performance. Penn State University Doctor of Philosophy (PhD),  Computer Science and Engineering 2005  – 2010 PhD in Computer Architecture. I looked at Reliability issues, Impact of Process Variation, NBTI, HCE, Soft transient errors, and provided solutions to address them without losing performance. Sri Venkateshwara College Of Engineering Bachelor of Engineering (B.E.),  Computer science and engineering 2000  – 2004 Computer Science and Engineering. Sri Venkateshwara College Of Engineering Bachelor of Engineering (B.E.),  Computer science and engineering 2000  – 2004 Computer Science and Engineering. Sri Venkateshwara College Of Engineering Bachelor of Engineering (B.E.),  Computer science and engineering 2000  – 2004 Computer Science and Engineering. Honors & Awards Department Recognition Award Intel August 2014 Award was for handling PnP activities of an Intel mobile platform Intel Software Quality Award 2014 Intel April 2014 This award was for delivering pre-silicon virtual prototyping solutions that is used extensively within Intel and helps to shift left the software development in turn helping to decrease the time to market for different products Distinguished Invention Award Intel March 2014 Award was for developing a fast and sufficiently accurate pre-silicon performance modeling methodology  Department Recognition Award Intel August 2014 Award was for handling PnP activities of an Intel mobile platform Department Recognition Award Intel August 2014 Award was for handling PnP activities of an Intel mobile platform Department Recognition Award Intel August 2014 Award was for handling PnP activities of an Intel mobile platform Intel Software Quality Award 2014 Intel April 2014 This award was for delivering pre-silicon virtual prototyping solutions that is used extensively within Intel and helps to shift left the software development in turn helping to decrease the time to market for different products Intel Software Quality Award 2014 Intel April 2014 This award was for delivering pre-silicon virtual prototyping solutions that is used extensively within Intel and helps to shift left the software development in turn helping to decrease the time to market for different products Intel Software Quality Award 2014 Intel April 2014 This award was for delivering pre-silicon virtual prototyping solutions that is used extensively within Intel and helps to shift left the software development in turn helping to decrease the time to market for different products Distinguished Invention Award Intel March 2014 Award was for developing a fast and sufficiently accurate pre-silicon performance modeling methodology  Distinguished Invention Award Intel March 2014 Award was for developing a fast and sufficiently accurate pre-silicon performance modeling methodology  Distinguished Invention Award Intel March 2014 Award was for developing a fast and sufficiently accurate pre-silicon performance modeling methodology  ", "Skills Windows and Linux... Assembly, C, C++, Ruby,... CPU and Graphics... Processors C C++ Python Linux Assembly Windows Computer Architecture Microprocessors PCIe Device Drivers Mixed Signal Embedded Systems Debugging Integrated Circuit... CMOS Low-power Design VLSI Simulations FPGA ASIC Computer System... IC VHDL Verilog See 13+     See less Skills  Windows and Linux... Assembly, C, C++, Ruby,... CPU and Graphics... Processors C C++ Python Linux Assembly Windows Computer Architecture Microprocessors PCIe Device Drivers Mixed Signal Embedded Systems Debugging Integrated Circuit... CMOS Low-power Design VLSI Simulations FPGA ASIC Computer System... IC VHDL Verilog See 13+     See less Windows and Linux... Assembly, C, C++, Ruby,... CPU and Graphics... Processors C C++ Python Linux Assembly Windows Computer Architecture Microprocessors PCIe Device Drivers Mixed Signal Embedded Systems Debugging Integrated Circuit... CMOS Low-power Design VLSI Simulations FPGA ASIC Computer System... IC VHDL Verilog See 13+     See less Windows and Linux... Assembly, C, C++, Ruby,... CPU and Graphics... Processors C C++ Python Linux Assembly Windows Computer Architecture Microprocessors PCIe Device Drivers Mixed Signal Embedded Systems Debugging Integrated Circuit... CMOS Low-power Design VLSI Simulations FPGA ASIC Computer System... IC VHDL Verilog See 13+     See less ", "Summary Gained over 10 years of experience working on Mobile Platforms for Phones & Tablets in the Intel's Mobile Communications Group(MCG). \nExperience includes Platform Architecture, Power Management, SOC Architecture and SOC design.  Summary Gained over 10 years of experience working on Mobile Platforms for Phones & Tablets in the Intel's Mobile Communications Group(MCG). \nExperience includes Platform Architecture, Power Management, SOC Architecture and SOC design.  Gained over 10 years of experience working on Mobile Platforms for Phones & Tablets in the Intel's Mobile Communications Group(MCG). \nExperience includes Platform Architecture, Power Management, SOC Architecture and SOC design.  Gained over 10 years of experience working on Mobile Platforms for Phones & Tablets in the Intel's Mobile Communications Group(MCG). \nExperience includes Platform Architecture, Power Management, SOC Architecture and SOC design.  Experience Platform Architect Intel Corporation June 2012  – Present (3 years 3 months) Phoenix, Arizona Area SOC Architect Intel Corporation February 2006  –  June 2012  (6 years 5 months) Phoenix, Arizona Area Hardware uArchitect and Design Intel Corporation January 2003  –  February 2006  (3 years 2 months) Phoenix, Arizona Area Design Engineer Intel Corporation February 2000  –  January 2003  (3 years) Phoenix, Arizona Area Platform Architect Intel Corporation June 2012  – Present (3 years 3 months) Phoenix, Arizona Area Platform Architect Intel Corporation June 2012  – Present (3 years 3 months) Phoenix, Arizona Area SOC Architect Intel Corporation February 2006  –  June 2012  (6 years 5 months) Phoenix, Arizona Area SOC Architect Intel Corporation February 2006  –  June 2012  (6 years 5 months) Phoenix, Arizona Area Hardware uArchitect and Design Intel Corporation January 2003  –  February 2006  (3 years 2 months) Phoenix, Arizona Area Hardware uArchitect and Design Intel Corporation January 2003  –  February 2006  (3 years 2 months) Phoenix, Arizona Area Design Engineer Intel Corporation February 2000  –  January 2003  (3 years) Phoenix, Arizona Area Design Engineer Intel Corporation February 2000  –  January 2003  (3 years) Phoenix, Arizona Area Skills Power Management Platform Architecture Low-power Design Mobile Platforms Power Delivery SOC Interconnect/Fabric Processors Hardware Embedded Systems SOC Architecture Verilog Android ACPI tablet platforms phone platforms PCI Architecture Windows Platforms See 2+     See less Skills  Power Management Platform Architecture Low-power Design Mobile Platforms Power Delivery SOC Interconnect/Fabric Processors Hardware Embedded Systems SOC Architecture Verilog Android ACPI tablet platforms phone platforms PCI Architecture Windows Platforms See 2+     See less Power Management Platform Architecture Low-power Design Mobile Platforms Power Delivery SOC Interconnect/Fabric Processors Hardware Embedded Systems SOC Architecture Verilog Android ACPI tablet platforms phone platforms PCI Architecture Windows Platforms See 2+     See less Power Management Platform Architecture Low-power Design Mobile Platforms Power Delivery SOC Interconnect/Fabric Processors Hardware Embedded Systems SOC Architecture Verilog Android ACPI tablet platforms phone platforms PCI Architecture Windows Platforms See 2+     See less Education Arizona State University Master's degree 1998  – 1999 Gujarat University Bachelor of Science (BS) 1994  – 1997 Arizona State University Master's degree 1998  – 1999 Arizona State University Master's degree 1998  – 1999 Arizona State University Master's degree 1998  – 1999 Gujarat University Bachelor of Science (BS) 1994  – 1997 Gujarat University Bachelor of Science (BS) 1994  – 1997 Gujarat University Bachelor of Science (BS) 1994  – 1997 ", "Summary Software Engineer with broad-based experience, including extensive experience in embedded processor and DSP. Coding experience in C and assembly for Analog Devices Processors. Worked on Signal Processing, Audio Codecs, Systems Integration, Development, Assembly Coding, Optimization, Debugging and maintenance of Embedded Software. Summary Software Engineer with broad-based experience, including extensive experience in embedded processor and DSP. Coding experience in C and assembly for Analog Devices Processors. Worked on Signal Processing, Audio Codecs, Systems Integration, Development, Assembly Coding, Optimization, Debugging and maintenance of Embedded Software. Software Engineer with broad-based experience, including extensive experience in embedded processor and DSP. Coding experience in C and assembly for Analog Devices Processors. Worked on Signal Processing, Audio Codecs, Systems Integration, Development, Assembly Coding, Optimization, Debugging and maintenance of Embedded Software. Software Engineer with broad-based experience, including extensive experience in embedded processor and DSP. Coding experience in C and assembly for Analog Devices Processors. Worked on Signal Processing, Audio Codecs, Systems Integration, Development, Assembly Coding, Optimization, Debugging and maintenance of Embedded Software. Experience Power and Performance Analyst Engineer Intel Corporation May 2012  –  June 2013  (1 year 2 months) Santa Clara Embedded Systems Engineer Sparkler Tv April 2010  –  May 2012  (2 years 2 months) Tech Lead NXP Semiconductors August 2006  –  May 2007  (10 months) Worked on development of Trimedia streaming architecture for audio codecs, optimization of audio codecs on Trimedia processor. Sr. Software Engineer Philips Semiconductors December 2004  –  August 2006  (1 year 9 months) Sr. Systems Engineer Epsilon Control and Automation May 2001  –  November 2004  (3 years 7 months) •\tDesign, Code, Test and Port \n•\tExtensive DSP programming expertise \n•\tUnderstanding the entire hardware setup and flow of data \n•\tApplication development for entire setup \n•\tManaging deliverables with support and applications Power and Performance Analyst Engineer Intel Corporation May 2012  –  June 2013  (1 year 2 months) Santa Clara Power and Performance Analyst Engineer Intel Corporation May 2012  –  June 2013  (1 year 2 months) Santa Clara Embedded Systems Engineer Sparkler Tv April 2010  –  May 2012  (2 years 2 months) Embedded Systems Engineer Sparkler Tv April 2010  –  May 2012  (2 years 2 months) Tech Lead NXP Semiconductors August 2006  –  May 2007  (10 months) Worked on development of Trimedia streaming architecture for audio codecs, optimization of audio codecs on Trimedia processor. Tech Lead NXP Semiconductors August 2006  –  May 2007  (10 months) Worked on development of Trimedia streaming architecture for audio codecs, optimization of audio codecs on Trimedia processor. Sr. Software Engineer Philips Semiconductors December 2004  –  August 2006  (1 year 9 months) Sr. Software Engineer Philips Semiconductors December 2004  –  August 2006  (1 year 9 months) Sr. Systems Engineer Epsilon Control and Automation May 2001  –  November 2004  (3 years 7 months) •\tDesign, Code, Test and Port \n•\tExtensive DSP programming expertise \n•\tUnderstanding the entire hardware setup and flow of data \n•\tApplication development for entire setup \n•\tManaging deliverables with support and applications Sr. Systems Engineer Epsilon Control and Automation May 2001  –  November 2004  (3 years 7 months) •\tDesign, Code, Test and Port \n•\tExtensive DSP programming expertise \n•\tUnderstanding the entire hardware setup and flow of data \n•\tApplication development for entire setup \n•\tManaging deliverables with support and applications Skills Embedded Systems Digital Signal... Processors C Embedded Software Debugging Software Development Signal Processing Assembly Language Digital Signal... Firmware Skills  Embedded Systems Digital Signal... Processors C Embedded Software Debugging Software Development Signal Processing Assembly Language Digital Signal... Firmware Embedded Systems Digital Signal... Processors C Embedded Software Debugging Software Development Signal Processing Assembly Language Digital Signal... Firmware Embedded Systems Digital Signal... Processors C Embedded Software Debugging Software Development Signal Processing Assembly Language Digital Signal... Firmware Education B. M. S. College of Engineering B. E,  Telecommunication 1996  – 2000 B. M. S. College of Engineering B. E,  Telecommunication 1996  – 2000 B. M. S. College of Engineering B. E,  Telecommunication 1996  – 2000 B. M. S. College of Engineering B. E,  Telecommunication 1996  – 2000 ", "Summary Over 13 years of expertise in embedded Processor Architecture, hardwired Accelerator Architecture, SoC Architecture, Frontend Design and IP Development. Expert in algorithms and architectures for Embedded Computer Vision, Image Processing and Video processing.  \n \nArchitected and designed several specialized processors and accelerators for Embedded Computer Vision, Image processing and multiple ASIP based IPs for H.264/H.265 video compression. \n \nStrong leadership skills – have built and led multiple small teams over multiple years, collaborating and influencing worldwide teams, IP and SoC roadmaps. \n \nIn depth, hands-on experience in various aspects of Processor Core architecture – exploration,analysis, definition, modelling and design of instruction set, pipeline, functional units, datapaths, compiler code generation/optimization strategies and its inter-working with processor and instruction set architecture knobs, debug architecture and related software development tools, Processor Sub-Systems and SoC infrastructure (DMAs, caches, interconnect/bus architecture, IPC for multicore/multimode architectures etc). Thorough understanding on ASIP design philosophy, methodology and practice.  \n \nExtensive experience in hardwired accelerator architecture, SoC data/control flow optimization, area and power optimized implementation. \n \nExpert in Low Area & Low Power micro-architecture/RTL design, High Level Modelling in SystemC/ESL languages, Design Verification, Synthesis, Timing Closure, Soft/Hard IP development.  Summary Over 13 years of expertise in embedded Processor Architecture, hardwired Accelerator Architecture, SoC Architecture, Frontend Design and IP Development. Expert in algorithms and architectures for Embedded Computer Vision, Image Processing and Video processing.  \n \nArchitected and designed several specialized processors and accelerators for Embedded Computer Vision, Image processing and multiple ASIP based IPs for H.264/H.265 video compression. \n \nStrong leadership skills – have built and led multiple small teams over multiple years, collaborating and influencing worldwide teams, IP and SoC roadmaps. \n \nIn depth, hands-on experience in various aspects of Processor Core architecture – exploration,analysis, definition, modelling and design of instruction set, pipeline, functional units, datapaths, compiler code generation/optimization strategies and its inter-working with processor and instruction set architecture knobs, debug architecture and related software development tools, Processor Sub-Systems and SoC infrastructure (DMAs, caches, interconnect/bus architecture, IPC for multicore/multimode architectures etc). Thorough understanding on ASIP design philosophy, methodology and practice.  \n \nExtensive experience in hardwired accelerator architecture, SoC data/control flow optimization, area and power optimized implementation. \n \nExpert in Low Area & Low Power micro-architecture/RTL design, High Level Modelling in SystemC/ESL languages, Design Verification, Synthesis, Timing Closure, Soft/Hard IP development.  Over 13 years of expertise in embedded Processor Architecture, hardwired Accelerator Architecture, SoC Architecture, Frontend Design and IP Development. Expert in algorithms and architectures for Embedded Computer Vision, Image Processing and Video processing.  \n \nArchitected and designed several specialized processors and accelerators for Embedded Computer Vision, Image processing and multiple ASIP based IPs for H.264/H.265 video compression. \n \nStrong leadership skills – have built and led multiple small teams over multiple years, collaborating and influencing worldwide teams, IP and SoC roadmaps. \n \nIn depth, hands-on experience in various aspects of Processor Core architecture – exploration,analysis, definition, modelling and design of instruction set, pipeline, functional units, datapaths, compiler code generation/optimization strategies and its inter-working with processor and instruction set architecture knobs, debug architecture and related software development tools, Processor Sub-Systems and SoC infrastructure (DMAs, caches, interconnect/bus architecture, IPC for multicore/multimode architectures etc). Thorough understanding on ASIP design philosophy, methodology and practice.  \n \nExtensive experience in hardwired accelerator architecture, SoC data/control flow optimization, area and power optimized implementation. \n \nExpert in Low Area & Low Power micro-architecture/RTL design, High Level Modelling in SystemC/ESL languages, Design Verification, Synthesis, Timing Closure, Soft/Hard IP development.  Over 13 years of expertise in embedded Processor Architecture, hardwired Accelerator Architecture, SoC Architecture, Frontend Design and IP Development. Expert in algorithms and architectures for Embedded Computer Vision, Image Processing and Video processing.  \n \nArchitected and designed several specialized processors and accelerators for Embedded Computer Vision, Image processing and multiple ASIP based IPs for H.264/H.265 video compression. \n \nStrong leadership skills – have built and led multiple small teams over multiple years, collaborating and influencing worldwide teams, IP and SoC roadmaps. \n \nIn depth, hands-on experience in various aspects of Processor Core architecture – exploration,analysis, definition, modelling and design of instruction set, pipeline, functional units, datapaths, compiler code generation/optimization strategies and its inter-working with processor and instruction set architecture knobs, debug architecture and related software development tools, Processor Sub-Systems and SoC infrastructure (DMAs, caches, interconnect/bus architecture, IPC for multicore/multimode architectures etc). Thorough understanding on ASIP design philosophy, methodology and practice.  \n \nExtensive experience in hardwired accelerator architecture, SoC data/control flow optimization, area and power optimized implementation. \n \nExpert in Low Area & Low Power micro-architecture/RTL design, High Level Modelling in SystemC/ESL languages, Design Verification, Synthesis, Timing Closure, Soft/Hard IP development.  Experience Platform Architect Intel Corporation April 2015  – Present (5 months) Bengaluru Area, India Computer Vision and Imaging hardware architecture for wearable computing. Principal Architect, Member Group Technical Staff (MGTS) Texas Instruments February 2013  –  March 2015  (2 years 2 months) Bengaluru Area, India Principal Architect responsible for definition of hardware architecture for Texas Instrument's next generation embedded computer vision processing platform (beyond TDA2x/3x) for Advanced Driver Assistance Systems (ADAS).  \n \nExploring algorithmic and architectural alternatives to improve platform performance, capabilities and power efficiency of the current state-of-art offering of EVE (a.k.a Vision AcceleratorPac) and C66x DSP in Texas Instruments'​ TDA2x ADAS SoC (www.ti.com/TDA2x). \n \nResponsibilities include: \n1. Analyzing competitive landscape in embedded automotive vision (low level image processing, computer vision algorithms) processors. Interacting with lead Tier1 and OEM customers on critical next generation platform architecture requirement. \n2. Mapping technology trends and customer requirements (algorithm and systems) onto power, area, performance optimized specialized (programmable and hardwired) hardware platform to enable a superior system solution \n3. Architect for TI's next generation embedded Vision Processor (beyond EVE), benchmarking and optimization of TI's next generation DSP (beyond C6000) for embedded computer vision \n4. High level architecture, Functional Specification, Micro-architecture and design of processor and hardwired accelerator(s) for 3D Depth & Motion perception, object detection, image pre-processing (scaling, denoising, perspective correction etc) Architect and Design Manager - Embedded Vision Processor (EVE, Vision AcceleratorPac) Texas Instruments January 2011  –  December 2012  (2 years) Bengaluru Area, India Architect and Design Manager of an embedded vision processing engine, named EVE, a.k.a Vision AcceleratorPac. This is a brand new processor architecture from Texas Instrument, introduced in TDA2x ADAS SoC in Oct 2013 (www.ti.com/TDA2x), purpose built for power, performance and safety critical ADAS market. \n \nLed a cross-functional team (RTL design, RTL/apps verification, DFT, physical design) to deliver a processor core Hard-macro subchip on time for OMAP6, TDA2x SoC integration. Achieved highly challenging area, power goals with high operating frequency target in TI's low lower 28nm process technology.  \n \nFirst pass silicon success! www.ti.com/TDA2x Architect and Design Lead, ARP32 CPU Development Texas Instruments January 2009  –  December 2011  (3 years) Bengaluru Area, India Architecture definition, modeling, benchmarking and micro-architecture/RTL design of a RISC processor (named ARP32). Developed as a single issue, shallow pipeline, area/power optimized control processor (similar to ARM9, Cotex-M3 class of processors) with extendable instruction set, ARP32 enabled multiple other programmable signal/media processing IPs in Texas Instruments. \n \nStarting from the high level customer requirements, Co-architected multiple multimedia IPs using ARP32 RISC core: \n \n1. Controller CPU for an UltraHD (4Kx2K) H.264 video encode and decode engine: Provides capability of low latency (bare metal) task scheduling, accelerated configuration & control of other hardwired engines doing various tasks (e.g. Motion compensation, Loop filtering, transforms, entropy coding decoding) in a fully programmable way. Adds specialized complex instructions to accelerate slice/frame header processing in a novel way – enables high slice rate encode/decode in video conferencing markets. \n \n2. Programmable Motion Estimation engine for an UltraHD (4Kx2K) H.264 video encode and decode engine: Provides easy programing interfaces (via intrinsic) to complex datapaths needed for high quality, high performance motion estimation. Enables flexibility, trade-off of motion estimation quality Vs frame rate and/or power. \n \n3. Vector Processor for embedded computer vision (EVE): provides unprecedented performance in low level image and computer vision processing at very low power envelop. ARP32 is the primary programmable frontend, interfacing with a vector/SIMD datapath and a dedicated, integrated DMA. Lead Engineer, Advanced Processor Development Texas Instruments October 2006  –  December 2008  (2 years 3 months) Bengaluru Area, India Involved in several aspects of an advanced multicore/multinode processor development effort. \n \nFunctional modeling (instruction set simulator) of configurable RISC processors using SystemC providing fast, configurable simulation platform for compiler prototyping and system architecture modeling. This core ASIP model was used as the key component in building multinode system architecture for various applications. \n \nPart of an architecture definition and modeling team for implementing a universal (WiMax/LTE) OFDM modem (PHY) sub-system with a programmable, multi-core/many-core architecture. Starting from a purely functional reference C model, incrementally built a timed cycle approximate system model enabling experimentation/exploration of data/control flow, processing precision (datapath width) and architectural partitioning between programmable Vs hardwired accelerated blocks. Senior Design Engineer, C55x+ DSP Development Texas Instruments August 2005  –  December 2006  (1 year 5 months) Bengaluru Area, India Architecture, functional specification and design of on chip debug and trace modules - Cycle Accurate program execution (Timing), Data and Event Trace - of c55x+ DSP processor. Highly successful design with granted US patents. Played an instrumental role in collaboration with worldwide teams in making TI's C55x+ DSP debug features worldclass in solving customer problems. \n \nBuilt and led a small team of engineers on RTL design and verification of trace, event triggering and CPU core debug management logic (ICEMaker) verification for TI's C55x+ DSP. Developed interfaces and integrated C55x+ core into ARM Coresight Debug Architecture framework in modem SoCs for Nokia, Erricson, Motorola. \n \nEvaluated high level synthesis languages and methodologies, Bluespec System Verilog (www.bluespec.com) in particular, drove initial evaluation activities/projects, methodology building and deployment for TI's wireless business unit. Design Engineer Texas Instruments January 2002  –  July 2005  (3 years 7 months) Bangalore Micro-architecture and RTL design of on-chip Trace logic for TI's C55x+ Low Power DSP, reaching 400 MHz in TI's 65nm Low power process at nominal operating voltage. First fully successful implementation of real-time trace capability in TI's C55x DSP powering a series of custom modem SoCs of Nokia, Erricson and Motorola. Trace event encoding method, hardware micro-architecture, software decode algorithm were granted US patents (2004-2005). \n \nVerification of various features of C55x debug logic (primitive program discontinuity trace, cache/dma/peripheral behavior under debug), TI's first image, video accelerator (IVA) for OMAP2420. using C, specman and assembly language based verification methodology (2002-2004). Platform Architect Intel Corporation April 2015  – Present (5 months) Bengaluru Area, India Computer Vision and Imaging hardware architecture for wearable computing. Platform Architect Intel Corporation April 2015  – Present (5 months) Bengaluru Area, India Computer Vision and Imaging hardware architecture for wearable computing. Principal Architect, Member Group Technical Staff (MGTS) Texas Instruments February 2013  –  March 2015  (2 years 2 months) Bengaluru Area, India Principal Architect responsible for definition of hardware architecture for Texas Instrument's next generation embedded computer vision processing platform (beyond TDA2x/3x) for Advanced Driver Assistance Systems (ADAS).  \n \nExploring algorithmic and architectural alternatives to improve platform performance, capabilities and power efficiency of the current state-of-art offering of EVE (a.k.a Vision AcceleratorPac) and C66x DSP in Texas Instruments'​ TDA2x ADAS SoC (www.ti.com/TDA2x). \n \nResponsibilities include: \n1. Analyzing competitive landscape in embedded automotive vision (low level image processing, computer vision algorithms) processors. Interacting with lead Tier1 and OEM customers on critical next generation platform architecture requirement. \n2. Mapping technology trends and customer requirements (algorithm and systems) onto power, area, performance optimized specialized (programmable and hardwired) hardware platform to enable a superior system solution \n3. Architect for TI's next generation embedded Vision Processor (beyond EVE), benchmarking and optimization of TI's next generation DSP (beyond C6000) for embedded computer vision \n4. High level architecture, Functional Specification, Micro-architecture and design of processor and hardwired accelerator(s) for 3D Depth & Motion perception, object detection, image pre-processing (scaling, denoising, perspective correction etc) Principal Architect, Member Group Technical Staff (MGTS) Texas Instruments February 2013  –  March 2015  (2 years 2 months) Bengaluru Area, India Principal Architect responsible for definition of hardware architecture for Texas Instrument's next generation embedded computer vision processing platform (beyond TDA2x/3x) for Advanced Driver Assistance Systems (ADAS).  \n \nExploring algorithmic and architectural alternatives to improve platform performance, capabilities and power efficiency of the current state-of-art offering of EVE (a.k.a Vision AcceleratorPac) and C66x DSP in Texas Instruments'​ TDA2x ADAS SoC (www.ti.com/TDA2x). \n \nResponsibilities include: \n1. Analyzing competitive landscape in embedded automotive vision (low level image processing, computer vision algorithms) processors. Interacting with lead Tier1 and OEM customers on critical next generation platform architecture requirement. \n2. Mapping technology trends and customer requirements (algorithm and systems) onto power, area, performance optimized specialized (programmable and hardwired) hardware platform to enable a superior system solution \n3. Architect for TI's next generation embedded Vision Processor (beyond EVE), benchmarking and optimization of TI's next generation DSP (beyond C6000) for embedded computer vision \n4. High level architecture, Functional Specification, Micro-architecture and design of processor and hardwired accelerator(s) for 3D Depth & Motion perception, object detection, image pre-processing (scaling, denoising, perspective correction etc) Architect and Design Manager - Embedded Vision Processor (EVE, Vision AcceleratorPac) Texas Instruments January 2011  –  December 2012  (2 years) Bengaluru Area, India Architect and Design Manager of an embedded vision processing engine, named EVE, a.k.a Vision AcceleratorPac. This is a brand new processor architecture from Texas Instrument, introduced in TDA2x ADAS SoC in Oct 2013 (www.ti.com/TDA2x), purpose built for power, performance and safety critical ADAS market. \n \nLed a cross-functional team (RTL design, RTL/apps verification, DFT, physical design) to deliver a processor core Hard-macro subchip on time for OMAP6, TDA2x SoC integration. Achieved highly challenging area, power goals with high operating frequency target in TI's low lower 28nm process technology.  \n \nFirst pass silicon success! www.ti.com/TDA2x Architect and Design Manager - Embedded Vision Processor (EVE, Vision AcceleratorPac) Texas Instruments January 2011  –  December 2012  (2 years) Bengaluru Area, India Architect and Design Manager of an embedded vision processing engine, named EVE, a.k.a Vision AcceleratorPac. This is a brand new processor architecture from Texas Instrument, introduced in TDA2x ADAS SoC in Oct 2013 (www.ti.com/TDA2x), purpose built for power, performance and safety critical ADAS market. \n \nLed a cross-functional team (RTL design, RTL/apps verification, DFT, physical design) to deliver a processor core Hard-macro subchip on time for OMAP6, TDA2x SoC integration. Achieved highly challenging area, power goals with high operating frequency target in TI's low lower 28nm process technology.  \n \nFirst pass silicon success! www.ti.com/TDA2x Architect and Design Lead, ARP32 CPU Development Texas Instruments January 2009  –  December 2011  (3 years) Bengaluru Area, India Architecture definition, modeling, benchmarking and micro-architecture/RTL design of a RISC processor (named ARP32). Developed as a single issue, shallow pipeline, area/power optimized control processor (similar to ARM9, Cotex-M3 class of processors) with extendable instruction set, ARP32 enabled multiple other programmable signal/media processing IPs in Texas Instruments. \n \nStarting from the high level customer requirements, Co-architected multiple multimedia IPs using ARP32 RISC core: \n \n1. Controller CPU for an UltraHD (4Kx2K) H.264 video encode and decode engine: Provides capability of low latency (bare metal) task scheduling, accelerated configuration & control of other hardwired engines doing various tasks (e.g. Motion compensation, Loop filtering, transforms, entropy coding decoding) in a fully programmable way. Adds specialized complex instructions to accelerate slice/frame header processing in a novel way – enables high slice rate encode/decode in video conferencing markets. \n \n2. Programmable Motion Estimation engine for an UltraHD (4Kx2K) H.264 video encode and decode engine: Provides easy programing interfaces (via intrinsic) to complex datapaths needed for high quality, high performance motion estimation. Enables flexibility, trade-off of motion estimation quality Vs frame rate and/or power. \n \n3. Vector Processor for embedded computer vision (EVE): provides unprecedented performance in low level image and computer vision processing at very low power envelop. ARP32 is the primary programmable frontend, interfacing with a vector/SIMD datapath and a dedicated, integrated DMA. Architect and Design Lead, ARP32 CPU Development Texas Instruments January 2009  –  December 2011  (3 years) Bengaluru Area, India Architecture definition, modeling, benchmarking and micro-architecture/RTL design of a RISC processor (named ARP32). Developed as a single issue, shallow pipeline, area/power optimized control processor (similar to ARM9, Cotex-M3 class of processors) with extendable instruction set, ARP32 enabled multiple other programmable signal/media processing IPs in Texas Instruments. \n \nStarting from the high level customer requirements, Co-architected multiple multimedia IPs using ARP32 RISC core: \n \n1. Controller CPU for an UltraHD (4Kx2K) H.264 video encode and decode engine: Provides capability of low latency (bare metal) task scheduling, accelerated configuration & control of other hardwired engines doing various tasks (e.g. Motion compensation, Loop filtering, transforms, entropy coding decoding) in a fully programmable way. Adds specialized complex instructions to accelerate slice/frame header processing in a novel way – enables high slice rate encode/decode in video conferencing markets. \n \n2. Programmable Motion Estimation engine for an UltraHD (4Kx2K) H.264 video encode and decode engine: Provides easy programing interfaces (via intrinsic) to complex datapaths needed for high quality, high performance motion estimation. Enables flexibility, trade-off of motion estimation quality Vs frame rate and/or power. \n \n3. Vector Processor for embedded computer vision (EVE): provides unprecedented performance in low level image and computer vision processing at very low power envelop. ARP32 is the primary programmable frontend, interfacing with a vector/SIMD datapath and a dedicated, integrated DMA. Lead Engineer, Advanced Processor Development Texas Instruments October 2006  –  December 2008  (2 years 3 months) Bengaluru Area, India Involved in several aspects of an advanced multicore/multinode processor development effort. \n \nFunctional modeling (instruction set simulator) of configurable RISC processors using SystemC providing fast, configurable simulation platform for compiler prototyping and system architecture modeling. This core ASIP model was used as the key component in building multinode system architecture for various applications. \n \nPart of an architecture definition and modeling team for implementing a universal (WiMax/LTE) OFDM modem (PHY) sub-system with a programmable, multi-core/many-core architecture. Starting from a purely functional reference C model, incrementally built a timed cycle approximate system model enabling experimentation/exploration of data/control flow, processing precision (datapath width) and architectural partitioning between programmable Vs hardwired accelerated blocks. Lead Engineer, Advanced Processor Development Texas Instruments October 2006  –  December 2008  (2 years 3 months) Bengaluru Area, India Involved in several aspects of an advanced multicore/multinode processor development effort. \n \nFunctional modeling (instruction set simulator) of configurable RISC processors using SystemC providing fast, configurable simulation platform for compiler prototyping and system architecture modeling. This core ASIP model was used as the key component in building multinode system architecture for various applications. \n \nPart of an architecture definition and modeling team for implementing a universal (WiMax/LTE) OFDM modem (PHY) sub-system with a programmable, multi-core/many-core architecture. Starting from a purely functional reference C model, incrementally built a timed cycle approximate system model enabling experimentation/exploration of data/control flow, processing precision (datapath width) and architectural partitioning between programmable Vs hardwired accelerated blocks. Senior Design Engineer, C55x+ DSP Development Texas Instruments August 2005  –  December 2006  (1 year 5 months) Bengaluru Area, India Architecture, functional specification and design of on chip debug and trace modules - Cycle Accurate program execution (Timing), Data and Event Trace - of c55x+ DSP processor. Highly successful design with granted US patents. Played an instrumental role in collaboration with worldwide teams in making TI's C55x+ DSP debug features worldclass in solving customer problems. \n \nBuilt and led a small team of engineers on RTL design and verification of trace, event triggering and CPU core debug management logic (ICEMaker) verification for TI's C55x+ DSP. Developed interfaces and integrated C55x+ core into ARM Coresight Debug Architecture framework in modem SoCs for Nokia, Erricson, Motorola. \n \nEvaluated high level synthesis languages and methodologies, Bluespec System Verilog (www.bluespec.com) in particular, drove initial evaluation activities/projects, methodology building and deployment for TI's wireless business unit. Senior Design Engineer, C55x+ DSP Development Texas Instruments August 2005  –  December 2006  (1 year 5 months) Bengaluru Area, India Architecture, functional specification and design of on chip debug and trace modules - Cycle Accurate program execution (Timing), Data and Event Trace - of c55x+ DSP processor. Highly successful design with granted US patents. Played an instrumental role in collaboration with worldwide teams in making TI's C55x+ DSP debug features worldclass in solving customer problems. \n \nBuilt and led a small team of engineers on RTL design and verification of trace, event triggering and CPU core debug management logic (ICEMaker) verification for TI's C55x+ DSP. Developed interfaces and integrated C55x+ core into ARM Coresight Debug Architecture framework in modem SoCs for Nokia, Erricson, Motorola. \n \nEvaluated high level synthesis languages and methodologies, Bluespec System Verilog (www.bluespec.com) in particular, drove initial evaluation activities/projects, methodology building and deployment for TI's wireless business unit. Design Engineer Texas Instruments January 2002  –  July 2005  (3 years 7 months) Bangalore Micro-architecture and RTL design of on-chip Trace logic for TI's C55x+ Low Power DSP, reaching 400 MHz in TI's 65nm Low power process at nominal operating voltage. First fully successful implementation of real-time trace capability in TI's C55x DSP powering a series of custom modem SoCs of Nokia, Erricson and Motorola. Trace event encoding method, hardware micro-architecture, software decode algorithm were granted US patents (2004-2005). \n \nVerification of various features of C55x debug logic (primitive program discontinuity trace, cache/dma/peripheral behavior under debug), TI's first image, video accelerator (IVA) for OMAP2420. using C, specman and assembly language based verification methodology (2002-2004). Design Engineer Texas Instruments January 2002  –  July 2005  (3 years 7 months) Bangalore Micro-architecture and RTL design of on-chip Trace logic for TI's C55x+ Low Power DSP, reaching 400 MHz in TI's 65nm Low power process at nominal operating voltage. First fully successful implementation of real-time trace capability in TI's C55x DSP powering a series of custom modem SoCs of Nokia, Erricson and Motorola. Trace event encoding method, hardware micro-architecture, software decode algorithm were granted US patents (2004-2005). \n \nVerification of various features of C55x debug logic (primitive program discontinuity trace, cache/dma/peripheral behavior under debug), TI's first image, video accelerator (IVA) for OMAP2420. using C, specman and assembly language based verification methodology (2002-2004). Languages   Skills Computer Vision Machine Learning Object Detection Gesture Recognition 3D Reconstruction ARM SoC Embedded Systems Digital Signal... Microprocessors Hardware Architecture Image Processing RTL design Processors Computer Architecture Low-power Design Microarchitecture Logic Synthesis Functional Verification VLSI EDA ASIC Verilog Compiler Optimization IC Simulations Static Timing Analysis Timing Closure Semiconductors Video Analytics RTL Development SystemC Technical Leadership Professional Mentoring SystemVerilog System Architecture H.264 Algorithms CPU design Debugging Video Compression DFT Signal Processing See 28+     See less Skills  Computer Vision Machine Learning Object Detection Gesture Recognition 3D Reconstruction ARM SoC Embedded Systems Digital Signal... Microprocessors Hardware Architecture Image Processing RTL design Processors Computer Architecture Low-power Design Microarchitecture Logic Synthesis Functional Verification VLSI EDA ASIC Verilog Compiler Optimization IC Simulations Static Timing Analysis Timing Closure Semiconductors Video Analytics RTL Development SystemC Technical Leadership Professional Mentoring SystemVerilog System Architecture H.264 Algorithms CPU design Debugging Video Compression DFT Signal Processing See 28+     See less Computer Vision Machine Learning Object Detection Gesture Recognition 3D Reconstruction ARM SoC Embedded Systems Digital Signal... Microprocessors Hardware Architecture Image Processing RTL design Processors Computer Architecture Low-power Design Microarchitecture Logic Synthesis Functional Verification VLSI EDA ASIC Verilog Compiler Optimization IC Simulations Static Timing Analysis Timing Closure Semiconductors Video Analytics RTL Development SystemC Technical Leadership Professional Mentoring SystemVerilog System Architecture H.264 Algorithms CPU design Debugging Video Compression DFT Signal Processing See 28+     See less Computer Vision Machine Learning Object Detection Gesture Recognition 3D Reconstruction ARM SoC Embedded Systems Digital Signal... Microprocessors Hardware Architecture Image Processing RTL design Processors Computer Architecture Low-power Design Microarchitecture Logic Synthesis Functional Verification VLSI EDA ASIC Verilog Compiler Optimization IC Simulations Static Timing Analysis Timing Closure Semiconductors Video Analytics RTL Development SystemC Technical Leadership Professional Mentoring SystemVerilog System Architecture H.264 Algorithms CPU design Debugging Video Compression DFT Signal Processing See 28+     See less Education Bengal Engineering and Science University, Shibpur Bachelor of Engineering 1997  – 2001 St. Xavier's College, Calcutta 1995  – 1997 Bengal Engineering and Science University, Shibpur Bachelor of Engineering 1997  – 2001 Bengal Engineering and Science University, Shibpur Bachelor of Engineering 1997  – 2001 Bengal Engineering and Science University, Shibpur Bachelor of Engineering 1997  – 2001 St. Xavier's College, Calcutta 1995  – 1997 St. Xavier's College, Calcutta 1995  – 1997 St. Xavier's College, Calcutta 1995  – 1997 Honors & Awards Member Group Technical Staff, MGTS Texas Instruments January 2013 Elected as 'Member Gruop Technical Staff' (MGTS), Embedded Processor Business Unit, Texas Instruments in January, 2013. Senior Member, IEEE IEEE May 2014 Member Group Technical Staff, MGTS Texas Instruments January 2013 Elected as 'Member Gruop Technical Staff' (MGTS), Embedded Processor Business Unit, Texas Instruments in January, 2013. Member Group Technical Staff, MGTS Texas Instruments January 2013 Elected as 'Member Gruop Technical Staff' (MGTS), Embedded Processor Business Unit, Texas Instruments in January, 2013. Member Group Technical Staff, MGTS Texas Instruments January 2013 Elected as 'Member Gruop Technical Staff' (MGTS), Embedded Processor Business Unit, Texas Instruments in January, 2013. Senior Member, IEEE IEEE May 2014 Senior Member, IEEE IEEE May 2014 Senior Member, IEEE IEEE May 2014 ", "Experience Systems Engineer Intel Corporation September 2008  –  January 2015  (6 years 5 months) Longmont, CO Senior Design Engineer Microchip Technology 2002  –  2004  (2 years) Senior Applications Engineer Microchip Technology 1999  –  2002  (3 years) Design Engineer Norscan Instruments 1989  –  1999  (10 years) Systems Engineer Intel Corporation September 2008  –  January 2015  (6 years 5 months) Longmont, CO Systems Engineer Intel Corporation September 2008  –  January 2015  (6 years 5 months) Longmont, CO Senior Design Engineer Microchip Technology 2002  –  2004  (2 years) Senior Design Engineer Microchip Technology 2002  –  2004  (2 years) Senior Applications Engineer Microchip Technology 1999  –  2002  (3 years) Senior Applications Engineer Microchip Technology 1999  –  2002  (3 years) Design Engineer Norscan Instruments 1989  –  1999  (10 years) Design Engineer Norscan Instruments 1989  –  1999  (10 years) Skills Embedded Systems Firmware Microcontrollers Embedded Software C Analog Hardware Troubleshooting RF Software Design Manufacturing Semiconductors Debugging SoC Verilog FPGA Electronics Architecture Product Development ASIC ARM PCB design Hardware Architecture IC Processors Microprocessors Analog Circuit Design SATA Intel System Architecture Logic Design Device Drivers Integrated Circuit... Computer Architecture See 19+     See less Skills  Embedded Systems Firmware Microcontrollers Embedded Software C Analog Hardware Troubleshooting RF Software Design Manufacturing Semiconductors Debugging SoC Verilog FPGA Electronics Architecture Product Development ASIC ARM PCB design Hardware Architecture IC Processors Microprocessors Analog Circuit Design SATA Intel System Architecture Logic Design Device Drivers Integrated Circuit... Computer Architecture See 19+     See less Embedded Systems Firmware Microcontrollers Embedded Software C Analog Hardware Troubleshooting RF Software Design Manufacturing Semiconductors Debugging SoC Verilog FPGA Electronics Architecture Product Development ASIC ARM PCB design Hardware Architecture IC Processors Microprocessors Analog Circuit Design SATA Intel System Architecture Logic Design Device Drivers Integrated Circuit... Computer Architecture See 19+     See less Embedded Systems Firmware Microcontrollers Embedded Software C Analog Hardware Troubleshooting RF Software Design Manufacturing Semiconductors Debugging SoC Verilog FPGA Electronics Architecture Product Development ASIC ARM PCB design Hardware Architecture IC Processors Microprocessors Analog Circuit Design SATA Intel System Architecture Logic Design Device Drivers Integrated Circuit... Computer Architecture See 19+     See less ", "Experience Platform Architect Intel Corporation May 2013  – Present (2 years 4 months) Bangalore, India Graduate Assistant Texas A&M University August 2008  –  May 2013  (4 years 10 months) Graduate Intern Intel Corporation August 2010  –  December 2010  (5 months) Austin, Texas Area IP integration (both pre and post silicon) from cluster level to full chip – We designed the Test Access Mechanism (TAM) for a Test Controller (TC) for cluster level validation. We also implemented an automatic test generation methodology based on directed IP tests. System Engineer Texas Instruments August 2007  –  July 2008  (1 year) Bangalore, India Application verification and validation for DM360 – Validated application of Display Subsystem of DM360 (both pre- and post-silicon). Software Engineer Samsung August 2006  –  June 2007  (11 months) Bangalore, India Board Support Package for Appolon board – Developed bootloaders and flash based file systems to boot Linux from Nand flash for Omap2420 based Appolon boards. \nCrash dump generation and analysis tool – Generated crash dump of Linux kernel, transferred it over network and analyzed on developer’s PC. The work involved implementing the pause and play feature of the Linux kernel running on an arm processor. BTech in E&ECE Indian Institute of Technology, Kharagpur August 2002  –  July 2006  (4 years) Platform Architect Intel Corporation May 2013  – Present (2 years 4 months) Bangalore, India Platform Architect Intel Corporation May 2013  – Present (2 years 4 months) Bangalore, India Graduate Assistant Texas A&M University August 2008  –  May 2013  (4 years 10 months) Graduate Assistant Texas A&M University August 2008  –  May 2013  (4 years 10 months) Graduate Intern Intel Corporation August 2010  –  December 2010  (5 months) Austin, Texas Area IP integration (both pre and post silicon) from cluster level to full chip – We designed the Test Access Mechanism (TAM) for a Test Controller (TC) for cluster level validation. We also implemented an automatic test generation methodology based on directed IP tests. Graduate Intern Intel Corporation August 2010  –  December 2010  (5 months) Austin, Texas Area IP integration (both pre and post silicon) from cluster level to full chip – We designed the Test Access Mechanism (TAM) for a Test Controller (TC) for cluster level validation. We also implemented an automatic test generation methodology based on directed IP tests. System Engineer Texas Instruments August 2007  –  July 2008  (1 year) Bangalore, India Application verification and validation for DM360 – Validated application of Display Subsystem of DM360 (both pre- and post-silicon). System Engineer Texas Instruments August 2007  –  July 2008  (1 year) Bangalore, India Application verification and validation for DM360 – Validated application of Display Subsystem of DM360 (both pre- and post-silicon). Software Engineer Samsung August 2006  –  June 2007  (11 months) Bangalore, India Board Support Package for Appolon board – Developed bootloaders and flash based file systems to boot Linux from Nand flash for Omap2420 based Appolon boards. \nCrash dump generation and analysis tool – Generated crash dump of Linux kernel, transferred it over network and analyzed on developer’s PC. The work involved implementing the pause and play feature of the Linux kernel running on an arm processor. Software Engineer Samsung August 2006  –  June 2007  (11 months) Bangalore, India Board Support Package for Appolon board – Developed bootloaders and flash based file systems to boot Linux from Nand flash for Omap2420 based Appolon boards. \nCrash dump generation and analysis tool – Generated crash dump of Linux kernel, transferred it over network and analyzed on developer’s PC. The work involved implementing the pause and play feature of the Linux kernel running on an arm processor. BTech in E&ECE Indian Institute of Technology, Kharagpur August 2002  –  July 2006  (4 years) BTech in E&ECE Indian Institute of Technology, Kharagpur August 2002  –  July 2006  (4 years) Skills C++ C Matlab Linux Verilog Testing Integration ARM Simulations VHDL Linux Kernel Embedded Systems Skills  C++ C Matlab Linux Verilog Testing Integration ARM Simulations VHDL Linux Kernel Embedded Systems C++ C Matlab Linux Verilog Testing Integration ARM Simulations VHDL Linux Kernel Embedded Systems C++ C Matlab Linux Verilog Testing Integration ARM Simulations VHDL Linux Kernel Embedded Systems Education Texas A&M University PhD,  Computer Engineering 2008  – 2013 Indian Institute of Technology, Kharagpur Bachelor of Technology (BTech),  Electrical and Electronics Engineering 2002  – 2006 Texas A&M University PhD,  Computer Engineering 2008  – 2013 Texas A&M University PhD,  Computer Engineering 2008  – 2013 Texas A&M University PhD,  Computer Engineering 2008  – 2013 Indian Institute of Technology, Kharagpur Bachelor of Technology (BTech),  Electrical and Electronics Engineering 2002  – 2006 Indian Institute of Technology, Kharagpur Bachelor of Technology (BTech),  Electrical and Electronics Engineering 2002  – 2006 Indian Institute of Technology, Kharagpur Bachelor of Technology (BTech),  Electrical and Electronics Engineering 2002  – 2006 ", "Experience Platform Architect Intel Corporation October 2014  – Present (11 months) Client Platform Architecture Hardware Engineer Intel Corporation June 2006  –  October 2014  (8 years 5 months) Hardware Design Engineer \nPlatform Power Modeling \nSystem Integration MECOP Oregon State Intern Hewlett-Packard March 2004  –  October 2004  (8 months) Platform Architect Intel Corporation October 2014  – Present (11 months) Client Platform Architecture Platform Architect Intel Corporation October 2014  – Present (11 months) Client Platform Architecture Hardware Engineer Intel Corporation June 2006  –  October 2014  (8 years 5 months) Hardware Design Engineer \nPlatform Power Modeling \nSystem Integration Hardware Engineer Intel Corporation June 2006  –  October 2014  (8 years 5 months) Hardware Design Engineer \nPlatform Power Modeling \nSystem Integration MECOP Oregon State Intern Hewlett-Packard March 2004  –  October 2004  (8 months) MECOP Oregon State Intern Hewlett-Packard March 2004  –  October 2004  (8 months) Languages English Native or bilingual proficiency Burmese Professional working proficiency English Native or bilingual proficiency Burmese Professional working proficiency English Native or bilingual proficiency Burmese Professional working proficiency Native or bilingual proficiency Professional working proficiency Skills SoC Embedded Systems Semiconductors PCB design Debugging Intel Processors Semiconductor Industry ASIC Computer Architecture Hardware Architecture Verilog Skills  SoC Embedded Systems Semiconductors PCB design Debugging Intel Processors Semiconductor Industry ASIC Computer Architecture Hardware Architecture Verilog SoC Embedded Systems Semiconductors PCB design Debugging Intel Processors Semiconductor Industry ASIC Computer Architecture Hardware Architecture Verilog SoC Embedded Systems Semiconductors PCB design Debugging Intel Processors Semiconductor Industry ASIC Computer Architecture Hardware Architecture Verilog Education Oregon State University Bachelor's Degree,  Electrical and Electronics Engineering 2001  – 2006 Activities and Societies:  Eta Kappa Nu Engineering Honor Society ,  Gates Millenium Scholar ,  Ford Foundation Scholar Oregon Health and Science University Computer Science 2014 Oregon State University Bachelor's Degree,  Electrical and Electronics Engineering 2001  – 2006 Activities and Societies:  Eta Kappa Nu Engineering Honor Society ,  Gates Millenium Scholar ,  Ford Foundation Scholar Oregon State University Bachelor's Degree,  Electrical and Electronics Engineering 2001  – 2006 Activities and Societies:  Eta Kappa Nu Engineering Honor Society ,  Gates Millenium Scholar ,  Ford Foundation Scholar Oregon State University Bachelor's Degree,  Electrical and Electronics Engineering 2001  – 2006 Activities and Societies:  Eta Kappa Nu Engineering Honor Society ,  Gates Millenium Scholar ,  Ford Foundation Scholar Oregon Health and Science University Computer Science 2014 Oregon Health and Science University Computer Science 2014 Oregon Health and Science University Computer Science 2014 Honors & Awards ", "Experience Platform Architect Intel Corporation March 2014  – Present (1 year 6 months) Dupont, WA Hardware Design Engineer Intel Corporation July 2004  –  February 2014  (9 years 8 months) Intern City of Seattle January 2004  –  May 2004  (5 months) Platform Architect Intel Corporation March 2014  – Present (1 year 6 months) Dupont, WA Platform Architect Intel Corporation March 2014  – Present (1 year 6 months) Dupont, WA Hardware Design Engineer Intel Corporation July 2004  –  February 2014  (9 years 8 months) Hardware Design Engineer Intel Corporation July 2004  –  February 2014  (9 years 8 months) Intern City of Seattle January 2004  –  May 2004  (5 months) Intern City of Seattle January 2004  –  May 2004  (5 months) Education Penn State University Master of Business Administration (MBA),  Business Administration and Management , General 2008  – 2010 University of Washington Bachelor of Science (BS),  Electrical and Electronics Engineering 2001  – 2004 Penn State University Master of Business Administration (MBA),  Business Administration and Management , General 2008  – 2010 Penn State University Master of Business Administration (MBA),  Business Administration and Management , General 2008  – 2010 Penn State University Master of Business Administration (MBA),  Business Administration and Management , General 2008  – 2010 University of Washington Bachelor of Science (BS),  Electrical and Electronics Engineering 2001  – 2004 University of Washington Bachelor of Science (BS),  Electrical and Electronics Engineering 2001  – 2004 University of Washington Bachelor of Science (BS),  Electrical and Electronics Engineering 2001  – 2004 ", "Experience Platform Architect Intel Corporation October 2012  – Present (2 years 11 months) Sr. Design Engineer Intel Corporation May 1997  –  October 2012  (15 years 6 months) Platform Architect Intel Corporation October 2012  – Present (2 years 11 months) Platform Architect Intel Corporation October 2012  – Present (2 years 11 months) Sr. Design Engineer Intel Corporation May 1997  –  October 2012  (15 years 6 months) Sr. Design Engineer Intel Corporation May 1997  –  October 2012  (15 years 6 months) Languages English Portuguese English Portuguese English Portuguese Skills Semiconductors SoC ASIC Debugging Cross-functional Team... Skills  Semiconductors SoC ASIC Debugging Cross-functional Team... Semiconductors SoC ASIC Debugging Cross-functional Team... Semiconductors SoC ASIC Debugging Cross-functional Team... Education Brigham Young University Bachelor of Science (B.S.) 1990  – 1997 Skyline High School High School 1987  – 1990 Brigham Young University Bachelor of Science (B.S.) 1990  – 1997 Brigham Young University Bachelor of Science (B.S.) 1990  – 1997 Brigham Young University Bachelor of Science (B.S.) 1990  – 1997 Skyline High School High School 1987  – 1990 Skyline High School High School 1987  – 1990 Skyline High School High School 1987  – 1990 ", "Summary Professional Experience: \n► Packet Processing \n► Classification, advanced lookup techniques, Ethernet L2/L3 switching, IP routing \n► Programmable Network Processors.  \n   Design of Hybrid architectures (Multi-Core/Pipelined), Barrel, Superscalar, VLIW \n► Traffic Management \n► Data Center architectures, storage \n► In-depth knowledge of provider network models. \n   Particularly carrier networks in Asia-Pacific (Japan, China, S.Korea)  \n► Access Networks, FTTH (EPON/10G-EPON/GPON/XG-PON) \n► SoC architecture, SoC Interconnects, NoC, ARM9, ARM11 MPCore, Cortex-Mx, Cortex-Ax  \n   Member of PMC SoCWG \n► HW/SW partitioning, design of purpose-built CPU offloading/accelerators \n► ASIC PPA modeling (area, power, performance, cost) \n► Power-reduction techniques, CPE power-save, design for low-power,  \n   leakage optimization, AVS, DVFS, Multi-Vt / Multi-Channel  \n► Soft-Error resilient designs / ECC techniques \n► High-density embedded 1T-SRAM IPs, TCAM IPs \n► FPGA prototyping of complex SoCs \n► Hardware abstraction (HAL), definition of portable hardware-agnostic APIs \n► Hands on design and micro-architecture of low-power high-speed circuits \n► High-Speed Interconnect \n \nSpecialties:  \n► Deep knowledge in ASIC design flow, from definition to production \n► Hands-on \n► Bringing novel architectures into successful ASICs Summary Professional Experience: \n► Packet Processing \n► Classification, advanced lookup techniques, Ethernet L2/L3 switching, IP routing \n► Programmable Network Processors.  \n   Design of Hybrid architectures (Multi-Core/Pipelined), Barrel, Superscalar, VLIW \n► Traffic Management \n► Data Center architectures, storage \n► In-depth knowledge of provider network models. \n   Particularly carrier networks in Asia-Pacific (Japan, China, S.Korea)  \n► Access Networks, FTTH (EPON/10G-EPON/GPON/XG-PON) \n► SoC architecture, SoC Interconnects, NoC, ARM9, ARM11 MPCore, Cortex-Mx, Cortex-Ax  \n   Member of PMC SoCWG \n► HW/SW partitioning, design of purpose-built CPU offloading/accelerators \n► ASIC PPA modeling (area, power, performance, cost) \n► Power-reduction techniques, CPE power-save, design for low-power,  \n   leakage optimization, AVS, DVFS, Multi-Vt / Multi-Channel  \n► Soft-Error resilient designs / ECC techniques \n► High-density embedded 1T-SRAM IPs, TCAM IPs \n► FPGA prototyping of complex SoCs \n► Hardware abstraction (HAL), definition of portable hardware-agnostic APIs \n► Hands on design and micro-architecture of low-power high-speed circuits \n► High-Speed Interconnect \n \nSpecialties:  \n► Deep knowledge in ASIC design flow, from definition to production \n► Hands-on \n► Bringing novel architectures into successful ASICs Professional Experience: \n► Packet Processing \n► Classification, advanced lookup techniques, Ethernet L2/L3 switching, IP routing \n► Programmable Network Processors.  \n   Design of Hybrid architectures (Multi-Core/Pipelined), Barrel, Superscalar, VLIW \n► Traffic Management \n► Data Center architectures, storage \n► In-depth knowledge of provider network models. \n   Particularly carrier networks in Asia-Pacific (Japan, China, S.Korea)  \n► Access Networks, FTTH (EPON/10G-EPON/GPON/XG-PON) \n► SoC architecture, SoC Interconnects, NoC, ARM9, ARM11 MPCore, Cortex-Mx, Cortex-Ax  \n   Member of PMC SoCWG \n► HW/SW partitioning, design of purpose-built CPU offloading/accelerators \n► ASIC PPA modeling (area, power, performance, cost) \n► Power-reduction techniques, CPE power-save, design for low-power,  \n   leakage optimization, AVS, DVFS, Multi-Vt / Multi-Channel  \n► Soft-Error resilient designs / ECC techniques \n► High-density embedded 1T-SRAM IPs, TCAM IPs \n► FPGA prototyping of complex SoCs \n► Hardware abstraction (HAL), definition of portable hardware-agnostic APIs \n► Hands on design and micro-architecture of low-power high-speed circuits \n► High-Speed Interconnect \n \nSpecialties:  \n► Deep knowledge in ASIC design flow, from definition to production \n► Hands-on \n► Bringing novel architectures into successful ASICs Professional Experience: \n► Packet Processing \n► Classification, advanced lookup techniques, Ethernet L2/L3 switching, IP routing \n► Programmable Network Processors.  \n   Design of Hybrid architectures (Multi-Core/Pipelined), Barrel, Superscalar, VLIW \n► Traffic Management \n► Data Center architectures, storage \n► In-depth knowledge of provider network models. \n   Particularly carrier networks in Asia-Pacific (Japan, China, S.Korea)  \n► Access Networks, FTTH (EPON/10G-EPON/GPON/XG-PON) \n► SoC architecture, SoC Interconnects, NoC, ARM9, ARM11 MPCore, Cortex-Mx, Cortex-Ax  \n   Member of PMC SoCWG \n► HW/SW partitioning, design of purpose-built CPU offloading/accelerators \n► ASIC PPA modeling (area, power, performance, cost) \n► Power-reduction techniques, CPE power-save, design for low-power,  \n   leakage optimization, AVS, DVFS, Multi-Vt / Multi-Channel  \n► Soft-Error resilient designs / ECC techniques \n► High-density embedded 1T-SRAM IPs, TCAM IPs \n► FPGA prototyping of complex SoCs \n► Hardware abstraction (HAL), definition of portable hardware-agnostic APIs \n► Hands on design and micro-architecture of low-power high-speed circuits \n► High-Speed Interconnect \n \nSpecialties:  \n► Deep knowledge in ASIC design flow, from definition to production \n► Hands-on \n► Bringing novel architectures into successful ASICs Experience Platform Architect Intel Corporation 2012  – Present (3 years) System Architect, Mobile and Broadband Division PMC-Sierra 2005  –  2012  (7 years) SoC Architect Omni Group 2003  –  2005  (2 years) Chip Architect (Switching BU), Product Definition Group Marvell Semiconductor 2000  –  2003  (3 years) Design & Architecture, NPD (Networking Products Division) Intel Corporation 1997  –  2000  (3 years) Teaching Assistant / M.Sc Student Technion - Israel Institute of Technology 1996  –  1999  (3 years) Platform Architect Intel Corporation 2012  – Present (3 years) Platform Architect Intel Corporation 2012  – Present (3 years) System Architect, Mobile and Broadband Division PMC-Sierra 2005  –  2012  (7 years) System Architect, Mobile and Broadband Division PMC-Sierra 2005  –  2012  (7 years) SoC Architect Omni Group 2003  –  2005  (2 years) SoC Architect Omni Group 2003  –  2005  (2 years) Chip Architect (Switching BU), Product Definition Group Marvell Semiconductor 2000  –  2003  (3 years) Chip Architect (Switching BU), Product Definition Group Marvell Semiconductor 2000  –  2003  (3 years) Design & Architecture, NPD (Networking Products Division) Intel Corporation 1997  –  2000  (3 years) Design & Architecture, NPD (Networking Products Division) Intel Corporation 1997  –  2000  (3 years) Teaching Assistant / M.Sc Student Technion - Israel Institute of Technology 1996  –  1999  (3 years) Teaching Assistant / M.Sc Student Technion - Israel Institute of Technology 1996  –  1999  (3 years) Languages   Skills System Architecture Storage Data Center Network Adapters ASIC SoC ARM NPU Ethernet Switches OpenFlow SDN IP Routers TCP/IP SERDES Network Processors Deep Packet Inspection Multi-core Traffic Management Microarchitecture FTTx GPON VLSI Communication Protocols Architecture R&D Computer Engineering IP Multicast IEEE Operating Systems Unix Networking FPGA Mixed Signal PLL Patents Intellectual Property Contract Review MBA Finance Multithreading Semiconductors TRILL Network Virtualization Hardware Virtualization See 29+     See less Skills  System Architecture Storage Data Center Network Adapters ASIC SoC ARM NPU Ethernet Switches OpenFlow SDN IP Routers TCP/IP SERDES Network Processors Deep Packet Inspection Multi-core Traffic Management Microarchitecture FTTx GPON VLSI Communication Protocols Architecture R&D Computer Engineering IP Multicast IEEE Operating Systems Unix Networking FPGA Mixed Signal PLL Patents Intellectual Property Contract Review MBA Finance Multithreading Semiconductors TRILL Network Virtualization Hardware Virtualization See 29+     See less System Architecture Storage Data Center Network Adapters ASIC SoC ARM NPU Ethernet Switches OpenFlow SDN IP Routers TCP/IP SERDES Network Processors Deep Packet Inspection Multi-core Traffic Management Microarchitecture FTTx GPON VLSI Communication Protocols Architecture R&D Computer Engineering IP Multicast IEEE Operating Systems Unix Networking FPGA Mixed Signal PLL Patents Intellectual Property Contract Review MBA Finance Multithreading Semiconductors TRILL Network Virtualization Hardware Virtualization See 29+     See less System Architecture Storage Data Center Network Adapters ASIC SoC ARM NPU Ethernet Switches OpenFlow SDN IP Routers TCP/IP SERDES Network Processors Deep Packet Inspection Multi-core Traffic Management Microarchitecture FTTx GPON VLSI Communication Protocols Architecture R&D Computer Engineering IP Multicast IEEE Operating Systems Unix Networking FPGA Mixed Signal PLL Patents Intellectual Property Contract Review MBA Finance Multithreading Semiconductors TRILL Network Virtualization Hardware Virtualization See 29+     See less Education Bar-Ilan University MA Law (Cum Laude),  Commercial Law , GPA:91 2005  – 2007 ► Intellectual Property, Patents, Contract Law, Corporate Law Technion-Machon Technologi Le' Israel MBA (Cum Laude),  Marketing ,  Finance ,  Project Management , GPA:94 2000  – 2002 Technion-Machon Technologi Le' Israel M.Sc EE,  Computer Networks , Research:96, GPA:91 1996  – 2000 ► TCP/IP networks and protocols, multicast architectures, network resiliency, network security. \n► Research Thesis: \"Applying Deterministic Procedures to Reliable Multicast Protocols\", Supervised by Prof. Raphael Rom. \n▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬ \n► \"Applying Deterministic Feedback Suppression to Reliable Multicasting Protocols\", by Ronen Hyatt (Chayat) and Raphael Rom, in Proceedings of the 10th IEEE International Conference on Computer Communications and Networks (IEEE/ICCCN’01), 2001. Technion-Machon Technologi Le' Israel B.Sc EE (Cum Laude),  Computer Engineering 1991  – 1995 The Hebrew Reali School in Haifa Ha'Reali Ha'Ivri High School \nבית הספר הריאלי העברי בחיפה Bar-Ilan University MA Law (Cum Laude),  Commercial Law , GPA:91 2005  – 2007 ► Intellectual Property, Patents, Contract Law, Corporate Law Bar-Ilan University MA Law (Cum Laude),  Commercial Law , GPA:91 2005  – 2007 ► Intellectual Property, Patents, Contract Law, Corporate Law Bar-Ilan University MA Law (Cum Laude),  Commercial Law , GPA:91 2005  – 2007 ► Intellectual Property, Patents, Contract Law, Corporate Law Technion-Machon Technologi Le' Israel MBA (Cum Laude),  Marketing ,  Finance ,  Project Management , GPA:94 2000  – 2002 Technion-Machon Technologi Le' Israel MBA (Cum Laude),  Marketing ,  Finance ,  Project Management , GPA:94 2000  – 2002 Technion-Machon Technologi Le' Israel MBA (Cum Laude),  Marketing ,  Finance ,  Project Management , GPA:94 2000  – 2002 Technion-Machon Technologi Le' Israel M.Sc EE,  Computer Networks , Research:96, GPA:91 1996  – 2000 ► TCP/IP networks and protocols, multicast architectures, network resiliency, network security. \n► Research Thesis: \"Applying Deterministic Procedures to Reliable Multicast Protocols\", Supervised by Prof. Raphael Rom. \n▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬ \n► \"Applying Deterministic Feedback Suppression to Reliable Multicasting Protocols\", by Ronen Hyatt (Chayat) and Raphael Rom, in Proceedings of the 10th IEEE International Conference on Computer Communications and Networks (IEEE/ICCCN’01), 2001. Technion-Machon Technologi Le' Israel M.Sc EE,  Computer Networks , Research:96, GPA:91 1996  – 2000 ► TCP/IP networks and protocols, multicast architectures, network resiliency, network security. \n► Research Thesis: \"Applying Deterministic Procedures to Reliable Multicast Protocols\", Supervised by Prof. Raphael Rom. \n▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬ \n► \"Applying Deterministic Feedback Suppression to Reliable Multicasting Protocols\", by Ronen Hyatt (Chayat) and Raphael Rom, in Proceedings of the 10th IEEE International Conference on Computer Communications and Networks (IEEE/ICCCN’01), 2001. Technion-Machon Technologi Le' Israel M.Sc EE,  Computer Networks , Research:96, GPA:91 1996  – 2000 ► TCP/IP networks and protocols, multicast architectures, network resiliency, network security. \n► Research Thesis: \"Applying Deterministic Procedures to Reliable Multicast Protocols\", Supervised by Prof. Raphael Rom. \n▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬ \n► \"Applying Deterministic Feedback Suppression to Reliable Multicasting Protocols\", by Ronen Hyatt (Chayat) and Raphael Rom, in Proceedings of the 10th IEEE International Conference on Computer Communications and Networks (IEEE/ICCCN’01), 2001. Technion-Machon Technologi Le' Israel B.Sc EE (Cum Laude),  Computer Engineering 1991  – 1995 Technion-Machon Technologi Le' Israel B.Sc EE (Cum Laude),  Computer Engineering 1991  – 1995 Technion-Machon Technologi Le' Israel B.Sc EE (Cum Laude),  Computer Engineering 1991  – 1995 The Hebrew Reali School in Haifa Ha'Reali Ha'Ivri High School \nבית הספר הריאלי העברי בחיפה The Hebrew Reali School in Haifa Ha'Reali Ha'Ivri High School \nבית הספר הריאלי העברי בחיפה The Hebrew Reali School in Haifa Ha'Reali Ha'Ivri High School \nבית הספר הריאלי העברי בחיפה "]}