{"position": "Portfolio Manager", "company": "Intel Corporation", "profiles": ["Experience Senior Patent Attorney and Portfolio Manager Intel Corporation March 2004  – Present (11 years 6 months) Austin, Texas Area Attorney responsible for managing Intel's worldwide semiconductor process patent portfolio. This portfolio specializes in front-end semiconductor technologies which include device fabrication, substrate fabrication, metallization, lithography, and integration. Duties further include preparing and prosecuting patent applications in technology areas such as semiconductor processing, semiconductor packaging, wireless networks, consumer graphics, and mobile platforms, as well as providing general intellectual property counseling. Member of Board of Directors Texas Accountants and Lawyers for the Arts July 2013  – Present (2 years 2 months) Austin, TX Texas Accountants and Lawyers for the Arts (TALA) is a not-for-profit organization that helps meet the legal and accounting needs of artists and arts nonprofits across the State of Texas. TALA volunteers throughout the state handle more than 350 matters per year. This amounts to more than $600,000 annually in donated services to the arts and cultural community. \n \nTALA’s pro bono legal and accounting services are offered to artists from all creative disciplines, including visual artists, musicians, actors, dancers, film makers and writers. Over 600 attorneys and accountants volunteer their time each year, assisting in legal and accounting matters that might otherwise remain unresolved and unrepresented. TALA’s services include legal and accounting assistance, nonprofit incorporation, dispute resolution services, and educational programs and publications for artists and arts nonprofits to help apply legal and accounting concepts for their benefit. Attorney Fish & Richardson P.C. August 2002  –  August 2003  (1 year 1 month) Attorney specializing in obtaining patent protection for clients, intellectual property counseling, litigation support, patent analysis, and providing written opinions regarding potential infringement. Technology areas included software, databases, media delivery, semiconductor processes, and chemistry. Attorney Skjerven Morrill LLP August 2000  –  August 2002  (2 years 1 month) Attorney specializing in patent prosecution and IP litigation in the areas of computer hardware, semiconductor processes, analog and digital circuits, medical devices, business methods, and mechanical devices. Attorney Lyon & Lyon LLP August 1998  –  August 2000  (2 years 1 month) Patent prosecution and litigation associate Senior Patent Attorney and Portfolio Manager Intel Corporation March 2004  – Present (11 years 6 months) Austin, Texas Area Attorney responsible for managing Intel's worldwide semiconductor process patent portfolio. This portfolio specializes in front-end semiconductor technologies which include device fabrication, substrate fabrication, metallization, lithography, and integration. Duties further include preparing and prosecuting patent applications in technology areas such as semiconductor processing, semiconductor packaging, wireless networks, consumer graphics, and mobile platforms, as well as providing general intellectual property counseling. Senior Patent Attorney and Portfolio Manager Intel Corporation March 2004  – Present (11 years 6 months) Austin, Texas Area Attorney responsible for managing Intel's worldwide semiconductor process patent portfolio. This portfolio specializes in front-end semiconductor technologies which include device fabrication, substrate fabrication, metallization, lithography, and integration. Duties further include preparing and prosecuting patent applications in technology areas such as semiconductor processing, semiconductor packaging, wireless networks, consumer graphics, and mobile platforms, as well as providing general intellectual property counseling. Member of Board of Directors Texas Accountants and Lawyers for the Arts July 2013  – Present (2 years 2 months) Austin, TX Texas Accountants and Lawyers for the Arts (TALA) is a not-for-profit organization that helps meet the legal and accounting needs of artists and arts nonprofits across the State of Texas. TALA volunteers throughout the state handle more than 350 matters per year. This amounts to more than $600,000 annually in donated services to the arts and cultural community. \n \nTALA’s pro bono legal and accounting services are offered to artists from all creative disciplines, including visual artists, musicians, actors, dancers, film makers and writers. Over 600 attorneys and accountants volunteer their time each year, assisting in legal and accounting matters that might otherwise remain unresolved and unrepresented. TALA’s services include legal and accounting assistance, nonprofit incorporation, dispute resolution services, and educational programs and publications for artists and arts nonprofits to help apply legal and accounting concepts for their benefit. Member of Board of Directors Texas Accountants and Lawyers for the Arts July 2013  – Present (2 years 2 months) Austin, TX Texas Accountants and Lawyers for the Arts (TALA) is a not-for-profit organization that helps meet the legal and accounting needs of artists and arts nonprofits across the State of Texas. TALA volunteers throughout the state handle more than 350 matters per year. This amounts to more than $600,000 annually in donated services to the arts and cultural community. \n \nTALA’s pro bono legal and accounting services are offered to artists from all creative disciplines, including visual artists, musicians, actors, dancers, film makers and writers. Over 600 attorneys and accountants volunteer their time each year, assisting in legal and accounting matters that might otherwise remain unresolved and unrepresented. TALA’s services include legal and accounting assistance, nonprofit incorporation, dispute resolution services, and educational programs and publications for artists and arts nonprofits to help apply legal and accounting concepts for their benefit. Attorney Fish & Richardson P.C. August 2002  –  August 2003  (1 year 1 month) Attorney specializing in obtaining patent protection for clients, intellectual property counseling, litigation support, patent analysis, and providing written opinions regarding potential infringement. Technology areas included software, databases, media delivery, semiconductor processes, and chemistry. Attorney Fish & Richardson P.C. August 2002  –  August 2003  (1 year 1 month) Attorney specializing in obtaining patent protection for clients, intellectual property counseling, litigation support, patent analysis, and providing written opinions regarding potential infringement. Technology areas included software, databases, media delivery, semiconductor processes, and chemistry. Attorney Skjerven Morrill LLP August 2000  –  August 2002  (2 years 1 month) Attorney specializing in patent prosecution and IP litigation in the areas of computer hardware, semiconductor processes, analog and digital circuits, medical devices, business methods, and mechanical devices. Attorney Skjerven Morrill LLP August 2000  –  August 2002  (2 years 1 month) Attorney specializing in patent prosecution and IP litigation in the areas of computer hardware, semiconductor processes, analog and digital circuits, medical devices, business methods, and mechanical devices. Attorney Lyon & Lyon LLP August 1998  –  August 2000  (2 years 1 month) Patent prosecution and litigation associate Attorney Lyon & Lyon LLP August 1998  –  August 2000  (2 years 1 month) Patent prosecution and litigation associate Skills Patents Patent Prosecution Intellectual Property Due Diligence Patentability Prosecution Trade Secrets Legal Research Legal Writing Semiconductors Client Counseling Wireless Intellectual Property... IP Technology Transfer Skills  Patents Patent Prosecution Intellectual Property Due Diligence Patentability Prosecution Trade Secrets Legal Research Legal Writing Semiconductors Client Counseling Wireless Intellectual Property... IP Technology Transfer Patents Patent Prosecution Intellectual Property Due Diligence Patentability Prosecution Trade Secrets Legal Research Legal Writing Semiconductors Client Counseling Wireless Intellectual Property... IP Technology Transfer Patents Patent Prosecution Intellectual Property Due Diligence Patentability Prosecution Trade Secrets Legal Research Legal Writing Semiconductors Client Counseling Wireless Intellectual Property... IP Technology Transfer Education The University of Texas School of Law J.D.,  Law 1995  – 1998 The University of Texas at Austin B.S.,  Chemical Engineering 1990  – 1995 The University of Texas School of Law J.D.,  Law 1995  – 1998 The University of Texas School of Law J.D.,  Law 1995  – 1998 The University of Texas School of Law J.D.,  Law 1995  – 1998 The University of Texas at Austin B.S.,  Chemical Engineering 1990  – 1995 The University of Texas at Austin B.S.,  Chemical Engineering 1990  – 1995 The University of Texas at Austin B.S.,  Chemical Engineering 1990  – 1995 ", "Skills PMP Program Management Software Project... Resource Management Analysis Management Leadership SDLC Cross-functional Team... Business Process Integration Requirements Analysis Business Process... Vendor Management Skills  PMP Program Management Software Project... Resource Management Analysis Management Leadership SDLC Cross-functional Team... Business Process Integration Requirements Analysis Business Process... Vendor Management PMP Program Management Software Project... Resource Management Analysis Management Leadership SDLC Cross-functional Team... Business Process Integration Requirements Analysis Business Process... Vendor Management PMP Program Management Software Project... Resource Management Analysis Management Leadership SDLC Cross-functional Team... Business Process Integration Requirements Analysis Business Process... Vendor Management ", "Summary Accomplished real estate professional with broad operational, management, finance, and corporate real estate experience. International expertise in North America, Latin America and Asia have resulted in a skill-set specialized for success as a senior real estate professional at a real estate development and/or service company with operations in North America and/or Latin America. Specialties:Acquisition & Lease Expertise\t \nCRE Portfolio Management  \nFinancial Analysis  \nBusiness Development \nKnowledge of Global RE Markets  \nNPV Analysis Expert \nFASB Real Estate Expertise  \nFinancial Scenario Modeling \nProject Management  \nIncentives Negotiations\t \nSupply-Chain Management\t \nRisk Management \nPeople Management & Communication\t \nCAPEX Forecasting  \nStrategic Planning  \nCoreNet: MCR Graduate\t \nSpeak, Read, and Write Spanish  \nContract Negotiations Summary Accomplished real estate professional with broad operational, management, finance, and corporate real estate experience. International expertise in North America, Latin America and Asia have resulted in a skill-set specialized for success as a senior real estate professional at a real estate development and/or service company with operations in North America and/or Latin America. Specialties:Acquisition & Lease Expertise\t \nCRE Portfolio Management  \nFinancial Analysis  \nBusiness Development \nKnowledge of Global RE Markets  \nNPV Analysis Expert \nFASB Real Estate Expertise  \nFinancial Scenario Modeling \nProject Management  \nIncentives Negotiations\t \nSupply-Chain Management\t \nRisk Management \nPeople Management & Communication\t \nCAPEX Forecasting  \nStrategic Planning  \nCoreNet: MCR Graduate\t \nSpeak, Read, and Write Spanish  \nContract Negotiations Accomplished real estate professional with broad operational, management, finance, and corporate real estate experience. International expertise in North America, Latin America and Asia have resulted in a skill-set specialized for success as a senior real estate professional at a real estate development and/or service company with operations in North America and/or Latin America. Specialties:Acquisition & Lease Expertise\t \nCRE Portfolio Management  \nFinancial Analysis  \nBusiness Development \nKnowledge of Global RE Markets  \nNPV Analysis Expert \nFASB Real Estate Expertise  \nFinancial Scenario Modeling \nProject Management  \nIncentives Negotiations\t \nSupply-Chain Management\t \nRisk Management \nPeople Management & Communication\t \nCAPEX Forecasting  \nStrategic Planning  \nCoreNet: MCR Graduate\t \nSpeak, Read, and Write Spanish  \nContract Negotiations Accomplished real estate professional with broad operational, management, finance, and corporate real estate experience. International expertise in North America, Latin America and Asia have resulted in a skill-set specialized for success as a senior real estate professional at a real estate development and/or service company with operations in North America and/or Latin America. Specialties:Acquisition & Lease Expertise\t \nCRE Portfolio Management  \nFinancial Analysis  \nBusiness Development \nKnowledge of Global RE Markets  \nNPV Analysis Expert \nFASB Real Estate Expertise  \nFinancial Scenario Modeling \nProject Management  \nIncentives Negotiations\t \nSupply-Chain Management\t \nRisk Management \nPeople Management & Communication\t \nCAPEX Forecasting  \nStrategic Planning  \nCoreNet: MCR Graduate\t \nSpeak, Read, and Write Spanish  \nContract Negotiations Experience VP/Director | Corporate Services & Honeywell International Real Estate Consultant Newmark Grubb Zimmer December 2011  – Present (3 years 9 months) Phoenix, Arizona Area • As contracted consultant, manage all real estate transactions for Honeywell International in CA, AZ, TX and Latin America. \n• Manage Honeywell Portfolio of real estate assets (Acquisition/Disposition/Leasing/Valuation & Appraisal of Office, Industrial, Manufacturing, & Land) Director | Corporate Real Estate Solutions Latin America Colliers International January 2010  –  November 2011  (1 year 11 months) Miami/Fort Lauderdale Area Provided real estate brokerage and consulting & advisory services to corporations and companies that have real estate requirements throughout Latin America. \n \nService Specialties include:  \n \nAcquisition/Disposition/Leasing/Valuation & Appraisal of Office, Industrial, Land, Retail & Hotel Commercial Real Estate Advisor Independent Real Estate Investments & Advisory April 2009  –  December 2009  (9 months) Provided Real Estate Investment and Consulting Advisory to U.S. & Latin American companies. Corporate Real Estate Portfolio Manager Intel Corporation April 2004  –  March 2009  (5 years) • Led the delivery of corporate real estate services for the U.S. and all of Latin America, along with the management of 8 million square feet of existing space \n• Purchased/Sold/Leased >1.7 million square feet of Office/R&D/Industrial space in the United States and Latin America  \n• Negotiated and closed in excess of $160 million in real estate transactions worldwide \n• Led and influenced real estate development negotiations which established a presence in emerging markets in Latin America; and conducted negotiations in Spanish with developers, landlords and government agencies \n• Created and implemented a web-based worldwide real estate portfolio management system, which measured and compared the flexibility of all real estate assets at a Global/Regional/Country/Site level, based upon real estate market risks & business unit risks \n• Established and developed business processes and procedures, which provided internal standardization for worldwide real estate transactions \n• Retained and directed real estate brokers, appraisers, outside legal counsel, surveyors and other service providers \n• Directed multiple teams which conducted initial market reviews and project feasibility studies to develop strategic site selection solutions for entrance and growth into countries and targeted cities in Latin America Corporate Real Estate Sr. Finance Analyst Intel Corporation May 2002  –  April 2004  (2 years) • Managed the financial performance of Intel’s ~$6 billion corporate real estate portfolio \n• Reviewed and approved over $600 million in new real estate spending \n• Recognized by Deloitte & Touche for developing a “Best-in-Class” Excel-based real estate NPV model, which independently analyzed risk levels for contractual and non-contractual cash flows and became the standard model used for all Intel real estate analyses \n• Led and managed a global team of 8 real estate financial analysts by providing personal coaching and development, while overseeing their monthly real estate financial analyses  \n• Organized and led the Corporate Real Estate Impairment/Reserve training process; which provided financial comprehension and application of FASB 144 and 146 to accurately manage the portfolio  \n• Developed Intel’s corporate real estate discount rate methodology and procedures Commodity Manager-Worldwide Materials Intel Corporation December 1999  –  April 2002  (2 years 5 months) • Directed and managed a team of 7 global Virtual-Factory buyers who maintained 99.5% factory uptime and supply line support of the Handling-Media commodity \n• Created and led a team that performed supplier selection and analysis for an innovative solution to existing operations, which resulted in $6 million of direct cost savings \n• Developed an intricate ROI project analysis for product reuse that resulted in $2 million of savings  \n• Negotiated and managed corporate contracts with international suppliers  \n• Owned and managed $40 million in annual commodity spending Buyer Intel Corporation April 1998  –  December 1999  (1 year 9 months) • Developed and successfully managed continuous improvement programs with suppliers, which improved business procedures and optimized cost  \n• Formed and led a team that successfully reduced cycle-time of repairable parts, saving $200 thousand, annually \n• Procured and managed inventory in excess of $3 million VP of Marketing CollegeDaze, Inc 1996  –  1997  (1 year) • Managed and directed field operations for Internet startup \n• Developed business strategies for entrance into new markets \n• Established and managed sales accounts \n• Formulated business plans to raise venture capital VP/Director | Corporate Services & Honeywell International Real Estate Consultant Newmark Grubb Zimmer December 2011  – Present (3 years 9 months) Phoenix, Arizona Area • As contracted consultant, manage all real estate transactions for Honeywell International in CA, AZ, TX and Latin America. \n• Manage Honeywell Portfolio of real estate assets (Acquisition/Disposition/Leasing/Valuation & Appraisal of Office, Industrial, Manufacturing, & Land) VP/Director | Corporate Services & Honeywell International Real Estate Consultant Newmark Grubb Zimmer December 2011  – Present (3 years 9 months) Phoenix, Arizona Area • As contracted consultant, manage all real estate transactions for Honeywell International in CA, AZ, TX and Latin America. \n• Manage Honeywell Portfolio of real estate assets (Acquisition/Disposition/Leasing/Valuation & Appraisal of Office, Industrial, Manufacturing, & Land) Director | Corporate Real Estate Solutions Latin America Colliers International January 2010  –  November 2011  (1 year 11 months) Miami/Fort Lauderdale Area Provided real estate brokerage and consulting & advisory services to corporations and companies that have real estate requirements throughout Latin America. \n \nService Specialties include:  \n \nAcquisition/Disposition/Leasing/Valuation & Appraisal of Office, Industrial, Land, Retail & Hotel Director | Corporate Real Estate Solutions Latin America Colliers International January 2010  –  November 2011  (1 year 11 months) Miami/Fort Lauderdale Area Provided real estate brokerage and consulting & advisory services to corporations and companies that have real estate requirements throughout Latin America. \n \nService Specialties include:  \n \nAcquisition/Disposition/Leasing/Valuation & Appraisal of Office, Industrial, Land, Retail & Hotel Commercial Real Estate Advisor Independent Real Estate Investments & Advisory April 2009  –  December 2009  (9 months) Provided Real Estate Investment and Consulting Advisory to U.S. & Latin American companies. Commercial Real Estate Advisor Independent Real Estate Investments & Advisory April 2009  –  December 2009  (9 months) Provided Real Estate Investment and Consulting Advisory to U.S. & Latin American companies. Corporate Real Estate Portfolio Manager Intel Corporation April 2004  –  March 2009  (5 years) • Led the delivery of corporate real estate services for the U.S. and all of Latin America, along with the management of 8 million square feet of existing space \n• Purchased/Sold/Leased >1.7 million square feet of Office/R&D/Industrial space in the United States and Latin America  \n• Negotiated and closed in excess of $160 million in real estate transactions worldwide \n• Led and influenced real estate development negotiations which established a presence in emerging markets in Latin America; and conducted negotiations in Spanish with developers, landlords and government agencies \n• Created and implemented a web-based worldwide real estate portfolio management system, which measured and compared the flexibility of all real estate assets at a Global/Regional/Country/Site level, based upon real estate market risks & business unit risks \n• Established and developed business processes and procedures, which provided internal standardization for worldwide real estate transactions \n• Retained and directed real estate brokers, appraisers, outside legal counsel, surveyors and other service providers \n• Directed multiple teams which conducted initial market reviews and project feasibility studies to develop strategic site selection solutions for entrance and growth into countries and targeted cities in Latin America Corporate Real Estate Portfolio Manager Intel Corporation April 2004  –  March 2009  (5 years) • Led the delivery of corporate real estate services for the U.S. and all of Latin America, along with the management of 8 million square feet of existing space \n• Purchased/Sold/Leased >1.7 million square feet of Office/R&D/Industrial space in the United States and Latin America  \n• Negotiated and closed in excess of $160 million in real estate transactions worldwide \n• Led and influenced real estate development negotiations which established a presence in emerging markets in Latin America; and conducted negotiations in Spanish with developers, landlords and government agencies \n• Created and implemented a web-based worldwide real estate portfolio management system, which measured and compared the flexibility of all real estate assets at a Global/Regional/Country/Site level, based upon real estate market risks & business unit risks \n• Established and developed business processes and procedures, which provided internal standardization for worldwide real estate transactions \n• Retained and directed real estate brokers, appraisers, outside legal counsel, surveyors and other service providers \n• Directed multiple teams which conducted initial market reviews and project feasibility studies to develop strategic site selection solutions for entrance and growth into countries and targeted cities in Latin America Corporate Real Estate Sr. Finance Analyst Intel Corporation May 2002  –  April 2004  (2 years) • Managed the financial performance of Intel’s ~$6 billion corporate real estate portfolio \n• Reviewed and approved over $600 million in new real estate spending \n• Recognized by Deloitte & Touche for developing a “Best-in-Class” Excel-based real estate NPV model, which independently analyzed risk levels for contractual and non-contractual cash flows and became the standard model used for all Intel real estate analyses \n• Led and managed a global team of 8 real estate financial analysts by providing personal coaching and development, while overseeing their monthly real estate financial analyses  \n• Organized and led the Corporate Real Estate Impairment/Reserve training process; which provided financial comprehension and application of FASB 144 and 146 to accurately manage the portfolio  \n• Developed Intel’s corporate real estate discount rate methodology and procedures Corporate Real Estate Sr. Finance Analyst Intel Corporation May 2002  –  April 2004  (2 years) • Managed the financial performance of Intel’s ~$6 billion corporate real estate portfolio \n• Reviewed and approved over $600 million in new real estate spending \n• Recognized by Deloitte & Touche for developing a “Best-in-Class” Excel-based real estate NPV model, which independently analyzed risk levels for contractual and non-contractual cash flows and became the standard model used for all Intel real estate analyses \n• Led and managed a global team of 8 real estate financial analysts by providing personal coaching and development, while overseeing their monthly real estate financial analyses  \n• Organized and led the Corporate Real Estate Impairment/Reserve training process; which provided financial comprehension and application of FASB 144 and 146 to accurately manage the portfolio  \n• Developed Intel’s corporate real estate discount rate methodology and procedures Commodity Manager-Worldwide Materials Intel Corporation December 1999  –  April 2002  (2 years 5 months) • Directed and managed a team of 7 global Virtual-Factory buyers who maintained 99.5% factory uptime and supply line support of the Handling-Media commodity \n• Created and led a team that performed supplier selection and analysis for an innovative solution to existing operations, which resulted in $6 million of direct cost savings \n• Developed an intricate ROI project analysis for product reuse that resulted in $2 million of savings  \n• Negotiated and managed corporate contracts with international suppliers  \n• Owned and managed $40 million in annual commodity spending Commodity Manager-Worldwide Materials Intel Corporation December 1999  –  April 2002  (2 years 5 months) • Directed and managed a team of 7 global Virtual-Factory buyers who maintained 99.5% factory uptime and supply line support of the Handling-Media commodity \n• Created and led a team that performed supplier selection and analysis for an innovative solution to existing operations, which resulted in $6 million of direct cost savings \n• Developed an intricate ROI project analysis for product reuse that resulted in $2 million of savings  \n• Negotiated and managed corporate contracts with international suppliers  \n• Owned and managed $40 million in annual commodity spending Buyer Intel Corporation April 1998  –  December 1999  (1 year 9 months) • Developed and successfully managed continuous improvement programs with suppliers, which improved business procedures and optimized cost  \n• Formed and led a team that successfully reduced cycle-time of repairable parts, saving $200 thousand, annually \n• Procured and managed inventory in excess of $3 million Buyer Intel Corporation April 1998  –  December 1999  (1 year 9 months) • Developed and successfully managed continuous improvement programs with suppliers, which improved business procedures and optimized cost  \n• Formed and led a team that successfully reduced cycle-time of repairable parts, saving $200 thousand, annually \n• Procured and managed inventory in excess of $3 million VP of Marketing CollegeDaze, Inc 1996  –  1997  (1 year) • Managed and directed field operations for Internet startup \n• Developed business strategies for entrance into new markets \n• Established and managed sales accounts \n• Formulated business plans to raise venture capital VP of Marketing CollegeDaze, Inc 1996  –  1997  (1 year) • Managed and directed field operations for Internet startup \n• Developed business strategies for entrance into new markets \n• Established and managed sales accounts \n• Formulated business plans to raise venture capital Languages Spanish Spanish Spanish Skills Strategy Contract Negotiation Financial Analysis Real Estate Development Real Estate Mergers & Acquisitions Mergers Business Development Negotiation Investment Properties Start-ups Leadership Skills  Strategy Contract Negotiation Financial Analysis Real Estate Development Real Estate Mergers & Acquisitions Mergers Business Development Negotiation Investment Properties Start-ups Leadership Strategy Contract Negotiation Financial Analysis Real Estate Development Real Estate Mergers & Acquisitions Mergers Business Development Negotiation Investment Properties Start-ups Leadership Strategy Contract Negotiation Financial Analysis Real Estate Development Real Estate Mergers & Acquisitions Mergers Business Development Negotiation Investment Properties Start-ups Leadership Education Arizona State University - W. P. Carey School of Business MBA,  Finance 2000  – 2002 Brigham Young University Bachelor of Science (BS),  International Finance 1994  – 1997 Arizona State University - W. P. Carey School of Business MBA,  Finance 2000  – 2002 Arizona State University - W. P. Carey School of Business MBA,  Finance 2000  – 2002 Arizona State University - W. P. Carey School of Business MBA,  Finance 2000  – 2002 Brigham Young University Bachelor of Science (BS),  International Finance 1994  – 1997 Brigham Young University Bachelor of Science (BS),  International Finance 1994  – 1997 Brigham Young University Bachelor of Science (BS),  International Finance 1994  – 1997 ", "Summary •\tPortfolio and program management professional with 20+ years of increasing responsibilities \n•\tAccustomed to decision making in complex and fast paced environments with limited information \n•\tSkilled in leading large cross-functional teams \n•\tFocused on delivering business value not just solutions \n \n \nSpecialties: Portfolio Management, Program Management, Vendor Management, Business Management, Governance, Budget Management, Stakeholder Management, Cross Team Collaboration, Communication, Facilitation and Team Building Summary •\tPortfolio and program management professional with 20+ years of increasing responsibilities \n•\tAccustomed to decision making in complex and fast paced environments with limited information \n•\tSkilled in leading large cross-functional teams \n•\tFocused on delivering business value not just solutions \n \n \nSpecialties: Portfolio Management, Program Management, Vendor Management, Business Management, Governance, Budget Management, Stakeholder Management, Cross Team Collaboration, Communication, Facilitation and Team Building •\tPortfolio and program management professional with 20+ years of increasing responsibilities \n•\tAccustomed to decision making in complex and fast paced environments with limited information \n•\tSkilled in leading large cross-functional teams \n•\tFocused on delivering business value not just solutions \n \n \nSpecialties: Portfolio Management, Program Management, Vendor Management, Business Management, Governance, Budget Management, Stakeholder Management, Cross Team Collaboration, Communication, Facilitation and Team Building •\tPortfolio and program management professional with 20+ years of increasing responsibilities \n•\tAccustomed to decision making in complex and fast paced environments with limited information \n•\tSkilled in leading large cross-functional teams \n•\tFocused on delivering business value not just solutions \n \n \nSpecialties: Portfolio Management, Program Management, Vendor Management, Business Management, Governance, Budget Management, Stakeholder Management, Cross Team Collaboration, Communication, Facilitation and Team Building Experience Business Operations Program Manager (Portfolio Manager) Intel Corporation April 2014  – Present (1 year 5 months) Plano, TX BUSINESS VALUE MANAGEMNT \nBuild processes with a focus on cross-functional governance, strategic alignment, opportunity evaluation, selection and prioritization and data-driven decision making for investments \n \nBuild processes to mature business value management practices to track quantitative and qualitative benefits realized \n \nPROJECT PORTFOLIO MANAGEMENT \nStandardize and improve the quality of data captured for selected business opportunities before they enter the portfolio for execution \n \nSupport the governance, evaluation, selection and prioritization and communications for the most visible and cross-functional projects in the portfolio \n \nOrchestrate the planning process for $120M portfolio representing IT initiatives for product groups and functional units Sr. Operations Program Manager Microsoft February 2006  –  July 2013  (7 years 6 months) Redmond, WA JUNE 2010 – JULY 2013 \nPORTFOLIO, BUSINESS AND VENDOR MANAGEMENT \n \nPortfolio Management – Guided the rhythm of the business, ensured proper governance and supported executive communications to six General Managers and Xbox Live CFO who executed the digital supply chain strategy  \n \nBusiness Management – Negotiated annual process to establish and approve IS budget. Managed financials (SOWs, POs and invoices) for portfolio of digital supply chain work for Xbox Live, Office, Windows and Microsoft Store with an annual budget of approximately $60 million.  \n \nVendor Management – Oversaw approximately two dozen vendor companies that provided IS resources (up to 125 at any given time) to augment the development, test and program management functions  \n \nJUNE 2008 – JUNE 2010 \nPROGRAM MANAGEMENT OFFICE (PMO)  \n \nEvangelized the PMO Framework in the organization through brown-bag sessions, community of practice and focus groups for process improvement efforts \n \nConsulted with business and systems managers to ensure project success by leveraging the PMO Framework. Use judgment to apply the PMO Framework in a way that is not just one-sized fits all \n \nAudited projects for compliance of measurable and achievable performance metrics; sign-off and alignment at key gates; scope, time, schedule, issue, risk and communication management \n \nFEB 2006 – JUNE 2008 \nIT PROJECT MANAGEMENT \n \nManaged schedule, issues, risks and resources for 60-day iterations to provide visibility into product quality data to solve $1.5 billion quality crisis \n \nNegotiated with a dozen systems, operations and product teams to implement a worldwide digital supply channel for Windows Vista and Office 2007 \n \nProvided end-to-end visibility for data across seven disparate systems owned by six operational groups and three external global partners \n \nOwned schedule for internal system delivery. Managed issues and risks affecting the internal system readiness. Owned communication to PMO and executive stakeholders. Sr. Consultant Geniant September 2004  –  January 2006  (1 year 5 months) Dallas, TX INFRASTRUCTURE PRACTICE DELIVERY MANAGER \n \nOperations – Enabled infrastructure practice to successfully and consistently deliver fixed bid projects, when other practices struggled to deliver fixed bid work. Implemented processes to partner with the sales team.  \n \nSales and Marketing – Fostered a cooperative spirit between sales and delivery which resulted in the generation of proposals in less time. Partnered with sales team and practice director to create customer pipeline, craft proposals and close deals.  \n \nResource Management – Staffed all projects within the infrastructure practice. Recruited new consultants. Managed sub-contractors \n \nDelivery Assurance – Implemented templates for status reporting to ensure consistent and effective client communications. Templates and practices were adopted by several client organizations. Managed schedule, budget, scope, issues and risks for as many as seven client/engagements at a time. Sr. Consultant BORN Information Services September 2000  –  September 2004  (4 years 1 month) Dallas, TX ENGAGEMENT MANAGER \n \nProgram manager responsible for delivering solutions at keys clients. Managed multi-million dollar projects with as many as 15-resources. Accountable for the budget, schedule and client satisfaction. Managed all issues and risks on the client site. Extension of the sales and marketing teams through lead generation, proposal creation and case study documentation. \n \nPOS Deployment – Oversaw effort to deploy point-of-sale system enhancements to 1600 stores. Facilitated cross-functional communication. Managed vendor relationship. Led a hybrid team of 13 resources. Resulted in decreased customer wait at the POS during the crucial holiday season.  \n \nCAPX – Collaborated with key stakeholders to define a cost effective process for reporting capital budgeting and expenditure information from four disparate systems. According to the CFO, the budget process was a non-event after the deployment of this application \n \nKey Performance Indicators (KPIs) – Persuaded the client to do this project. Facilitated sessions with executives to identify metrics. Led team to develop a KPI portal. Executive team members stated that they started out each day with the KPIs, because decisions were based upon that information. \n \nDatabase Standardization - Led program with eight projects. Managed $1.2 million budget, schedule, issues, risks and a hybrid project team to standardize the database environment to minimize outages that cost an estimated $1 million in lost revenue per month \n \nLoyalty Website - Managed resources and the relationship between all stakeholders (Frito-Lay, Wal-Mart and a creative design agency) to deliver a web-site to increase customer loyalty for Frito-Lay products offered through the Wal-Mart stores. Site had the highest loyalty rate for its target demographic group Project Manager TXU April 1992  –  August 2000  (8 years 5 months) Dallas, TX DEC 1999 – AUG 2000\tPROJECT MANAGER \nGlobal Internet/Intranet Program – Partnered with client to secure sponsorship and funding for company’s first global IT project. Directed global program with $3 million budget. Managed personnel in three regions (US, UK and Australia) to define processes and implement solutions for a global capability \n \nAPR 1998 – DEC 1999\tWEB PROGRAMMER/ANALYST \nInternet Strategy Implementation Project – Assessed the business landscape and technical environments to support the company’s Internet presence after Senate Bill 7 (deregulation of Texas electric industry)  \n \nWeb Administration – Administered web-servers and firewalls. Collaborated with data security and network group to enforce security policies. Provided consulting and application testing services to business units \n \nAPR 1996 – APR 1998\tSR. INFORMATION CENTER ANALYST \nActed as a liaison between desktop services and the business units  \nTeamed with clients to identify business requirements and recommend PC-based solutions \nCoordinated the rollout of new IT services to the desktop  \n \nAPR 1992 – APR 1996\tINFORMATION CENTER ANALYST \nResolved PC software and hardware problems \nDeveloped and taught courses for office productivity tools \nPublished monthly computer newsletter  \nCoordinated the rollout of new IT services to the desktop  \nResolved PC software and hardware problems \nDeveloped and taught courses for office productivity tools \nPublished monthly computer newsletter Business Operations Program Manager (Portfolio Manager) Intel Corporation April 2014  – Present (1 year 5 months) Plano, TX BUSINESS VALUE MANAGEMNT \nBuild processes with a focus on cross-functional governance, strategic alignment, opportunity evaluation, selection and prioritization and data-driven decision making for investments \n \nBuild processes to mature business value management practices to track quantitative and qualitative benefits realized \n \nPROJECT PORTFOLIO MANAGEMENT \nStandardize and improve the quality of data captured for selected business opportunities before they enter the portfolio for execution \n \nSupport the governance, evaluation, selection and prioritization and communications for the most visible and cross-functional projects in the portfolio \n \nOrchestrate the planning process for $120M portfolio representing IT initiatives for product groups and functional units Business Operations Program Manager (Portfolio Manager) Intel Corporation April 2014  – Present (1 year 5 months) Plano, TX BUSINESS VALUE MANAGEMNT \nBuild processes with a focus on cross-functional governance, strategic alignment, opportunity evaluation, selection and prioritization and data-driven decision making for investments \n \nBuild processes to mature business value management practices to track quantitative and qualitative benefits realized \n \nPROJECT PORTFOLIO MANAGEMENT \nStandardize and improve the quality of data captured for selected business opportunities before they enter the portfolio for execution \n \nSupport the governance, evaluation, selection and prioritization and communications for the most visible and cross-functional projects in the portfolio \n \nOrchestrate the planning process for $120M portfolio representing IT initiatives for product groups and functional units Sr. Operations Program Manager Microsoft February 2006  –  July 2013  (7 years 6 months) Redmond, WA JUNE 2010 – JULY 2013 \nPORTFOLIO, BUSINESS AND VENDOR MANAGEMENT \n \nPortfolio Management – Guided the rhythm of the business, ensured proper governance and supported executive communications to six General Managers and Xbox Live CFO who executed the digital supply chain strategy  \n \nBusiness Management – Negotiated annual process to establish and approve IS budget. Managed financials (SOWs, POs and invoices) for portfolio of digital supply chain work for Xbox Live, Office, Windows and Microsoft Store with an annual budget of approximately $60 million.  \n \nVendor Management – Oversaw approximately two dozen vendor companies that provided IS resources (up to 125 at any given time) to augment the development, test and program management functions  \n \nJUNE 2008 – JUNE 2010 \nPROGRAM MANAGEMENT OFFICE (PMO)  \n \nEvangelized the PMO Framework in the organization through brown-bag sessions, community of practice and focus groups for process improvement efforts \n \nConsulted with business and systems managers to ensure project success by leveraging the PMO Framework. Use judgment to apply the PMO Framework in a way that is not just one-sized fits all \n \nAudited projects for compliance of measurable and achievable performance metrics; sign-off and alignment at key gates; scope, time, schedule, issue, risk and communication management \n \nFEB 2006 – JUNE 2008 \nIT PROJECT MANAGEMENT \n \nManaged schedule, issues, risks and resources for 60-day iterations to provide visibility into product quality data to solve $1.5 billion quality crisis \n \nNegotiated with a dozen systems, operations and product teams to implement a worldwide digital supply channel for Windows Vista and Office 2007 \n \nProvided end-to-end visibility for data across seven disparate systems owned by six operational groups and three external global partners \n \nOwned schedule for internal system delivery. Managed issues and risks affecting the internal system readiness. Owned communication to PMO and executive stakeholders. Sr. Operations Program Manager Microsoft February 2006  –  July 2013  (7 years 6 months) Redmond, WA JUNE 2010 – JULY 2013 \nPORTFOLIO, BUSINESS AND VENDOR MANAGEMENT \n \nPortfolio Management – Guided the rhythm of the business, ensured proper governance and supported executive communications to six General Managers and Xbox Live CFO who executed the digital supply chain strategy  \n \nBusiness Management – Negotiated annual process to establish and approve IS budget. Managed financials (SOWs, POs and invoices) for portfolio of digital supply chain work for Xbox Live, Office, Windows and Microsoft Store with an annual budget of approximately $60 million.  \n \nVendor Management – Oversaw approximately two dozen vendor companies that provided IS resources (up to 125 at any given time) to augment the development, test and program management functions  \n \nJUNE 2008 – JUNE 2010 \nPROGRAM MANAGEMENT OFFICE (PMO)  \n \nEvangelized the PMO Framework in the organization through brown-bag sessions, community of practice and focus groups for process improvement efforts \n \nConsulted with business and systems managers to ensure project success by leveraging the PMO Framework. Use judgment to apply the PMO Framework in a way that is not just one-sized fits all \n \nAudited projects for compliance of measurable and achievable performance metrics; sign-off and alignment at key gates; scope, time, schedule, issue, risk and communication management \n \nFEB 2006 – JUNE 2008 \nIT PROJECT MANAGEMENT \n \nManaged schedule, issues, risks and resources for 60-day iterations to provide visibility into product quality data to solve $1.5 billion quality crisis \n \nNegotiated with a dozen systems, operations and product teams to implement a worldwide digital supply channel for Windows Vista and Office 2007 \n \nProvided end-to-end visibility for data across seven disparate systems owned by six operational groups and three external global partners \n \nOwned schedule for internal system delivery. Managed issues and risks affecting the internal system readiness. Owned communication to PMO and executive stakeholders. Sr. Consultant Geniant September 2004  –  January 2006  (1 year 5 months) Dallas, TX INFRASTRUCTURE PRACTICE DELIVERY MANAGER \n \nOperations – Enabled infrastructure practice to successfully and consistently deliver fixed bid projects, when other practices struggled to deliver fixed bid work. Implemented processes to partner with the sales team.  \n \nSales and Marketing – Fostered a cooperative spirit between sales and delivery which resulted in the generation of proposals in less time. Partnered with sales team and practice director to create customer pipeline, craft proposals and close deals.  \n \nResource Management – Staffed all projects within the infrastructure practice. Recruited new consultants. Managed sub-contractors \n \nDelivery Assurance – Implemented templates for status reporting to ensure consistent and effective client communications. Templates and practices were adopted by several client organizations. Managed schedule, budget, scope, issues and risks for as many as seven client/engagements at a time. Sr. Consultant Geniant September 2004  –  January 2006  (1 year 5 months) Dallas, TX INFRASTRUCTURE PRACTICE DELIVERY MANAGER \n \nOperations – Enabled infrastructure practice to successfully and consistently deliver fixed bid projects, when other practices struggled to deliver fixed bid work. Implemented processes to partner with the sales team.  \n \nSales and Marketing – Fostered a cooperative spirit between sales and delivery which resulted in the generation of proposals in less time. Partnered with sales team and practice director to create customer pipeline, craft proposals and close deals.  \n \nResource Management – Staffed all projects within the infrastructure practice. Recruited new consultants. Managed sub-contractors \n \nDelivery Assurance – Implemented templates for status reporting to ensure consistent and effective client communications. Templates and practices were adopted by several client organizations. Managed schedule, budget, scope, issues and risks for as many as seven client/engagements at a time. Sr. Consultant BORN Information Services September 2000  –  September 2004  (4 years 1 month) Dallas, TX ENGAGEMENT MANAGER \n \nProgram manager responsible for delivering solutions at keys clients. Managed multi-million dollar projects with as many as 15-resources. Accountable for the budget, schedule and client satisfaction. Managed all issues and risks on the client site. Extension of the sales and marketing teams through lead generation, proposal creation and case study documentation. \n \nPOS Deployment – Oversaw effort to deploy point-of-sale system enhancements to 1600 stores. Facilitated cross-functional communication. Managed vendor relationship. Led a hybrid team of 13 resources. Resulted in decreased customer wait at the POS during the crucial holiday season.  \n \nCAPX – Collaborated with key stakeholders to define a cost effective process for reporting capital budgeting and expenditure information from four disparate systems. According to the CFO, the budget process was a non-event after the deployment of this application \n \nKey Performance Indicators (KPIs) – Persuaded the client to do this project. Facilitated sessions with executives to identify metrics. Led team to develop a KPI portal. Executive team members stated that they started out each day with the KPIs, because decisions were based upon that information. \n \nDatabase Standardization - Led program with eight projects. Managed $1.2 million budget, schedule, issues, risks and a hybrid project team to standardize the database environment to minimize outages that cost an estimated $1 million in lost revenue per month \n \nLoyalty Website - Managed resources and the relationship between all stakeholders (Frito-Lay, Wal-Mart and a creative design agency) to deliver a web-site to increase customer loyalty for Frito-Lay products offered through the Wal-Mart stores. Site had the highest loyalty rate for its target demographic group Sr. Consultant BORN Information Services September 2000  –  September 2004  (4 years 1 month) Dallas, TX ENGAGEMENT MANAGER \n \nProgram manager responsible for delivering solutions at keys clients. Managed multi-million dollar projects with as many as 15-resources. Accountable for the budget, schedule and client satisfaction. Managed all issues and risks on the client site. Extension of the sales and marketing teams through lead generation, proposal creation and case study documentation. \n \nPOS Deployment – Oversaw effort to deploy point-of-sale system enhancements to 1600 stores. Facilitated cross-functional communication. Managed vendor relationship. Led a hybrid team of 13 resources. Resulted in decreased customer wait at the POS during the crucial holiday season.  \n \nCAPX – Collaborated with key stakeholders to define a cost effective process for reporting capital budgeting and expenditure information from four disparate systems. According to the CFO, the budget process was a non-event after the deployment of this application \n \nKey Performance Indicators (KPIs) – Persuaded the client to do this project. Facilitated sessions with executives to identify metrics. Led team to develop a KPI portal. Executive team members stated that they started out each day with the KPIs, because decisions were based upon that information. \n \nDatabase Standardization - Led program with eight projects. Managed $1.2 million budget, schedule, issues, risks and a hybrid project team to standardize the database environment to minimize outages that cost an estimated $1 million in lost revenue per month \n \nLoyalty Website - Managed resources and the relationship between all stakeholders (Frito-Lay, Wal-Mart and a creative design agency) to deliver a web-site to increase customer loyalty for Frito-Lay products offered through the Wal-Mart stores. Site had the highest loyalty rate for its target demographic group Project Manager TXU April 1992  –  August 2000  (8 years 5 months) Dallas, TX DEC 1999 – AUG 2000\tPROJECT MANAGER \nGlobal Internet/Intranet Program – Partnered with client to secure sponsorship and funding for company’s first global IT project. Directed global program with $3 million budget. Managed personnel in three regions (US, UK and Australia) to define processes and implement solutions for a global capability \n \nAPR 1998 – DEC 1999\tWEB PROGRAMMER/ANALYST \nInternet Strategy Implementation Project – Assessed the business landscape and technical environments to support the company’s Internet presence after Senate Bill 7 (deregulation of Texas electric industry)  \n \nWeb Administration – Administered web-servers and firewalls. Collaborated with data security and network group to enforce security policies. Provided consulting and application testing services to business units \n \nAPR 1996 – APR 1998\tSR. INFORMATION CENTER ANALYST \nActed as a liaison between desktop services and the business units  \nTeamed with clients to identify business requirements and recommend PC-based solutions \nCoordinated the rollout of new IT services to the desktop  \n \nAPR 1992 – APR 1996\tINFORMATION CENTER ANALYST \nResolved PC software and hardware problems \nDeveloped and taught courses for office productivity tools \nPublished monthly computer newsletter  \nCoordinated the rollout of new IT services to the desktop  \nResolved PC software and hardware problems \nDeveloped and taught courses for office productivity tools \nPublished monthly computer newsletter Project Manager TXU April 1992  –  August 2000  (8 years 5 months) Dallas, TX DEC 1999 – AUG 2000\tPROJECT MANAGER \nGlobal Internet/Intranet Program – Partnered with client to secure sponsorship and funding for company’s first global IT project. Directed global program with $3 million budget. Managed personnel in three regions (US, UK and Australia) to define processes and implement solutions for a global capability \n \nAPR 1998 – DEC 1999\tWEB PROGRAMMER/ANALYST \nInternet Strategy Implementation Project – Assessed the business landscape and technical environments to support the company’s Internet presence after Senate Bill 7 (deregulation of Texas electric industry)  \n \nWeb Administration – Administered web-servers and firewalls. Collaborated with data security and network group to enforce security policies. Provided consulting and application testing services to business units \n \nAPR 1996 – APR 1998\tSR. INFORMATION CENTER ANALYST \nActed as a liaison between desktop services and the business units  \nTeamed with clients to identify business requirements and recommend PC-based solutions \nCoordinated the rollout of new IT services to the desktop  \n \nAPR 1992 – APR 1996\tINFORMATION CENTER ANALYST \nResolved PC software and hardware problems \nDeveloped and taught courses for office productivity tools \nPublished monthly computer newsletter  \nCoordinated the rollout of new IT services to the desktop  \nResolved PC software and hardware problems \nDeveloped and taught courses for office productivity tools \nPublished monthly computer newsletter Languages English English English Skills Program Management Vendor Management Cross-functional Team... Project Management Process Improvement PMO Business Process... SDLC Software Development Agile Project Management Business Analysis Agile Methodologies Management Product Management Team Building Change Management Resource Management Portfolio Management Account Management Negotiation Governance Operations Management Business Management See 8+     See less Skills  Program Management Vendor Management Cross-functional Team... Project Management Process Improvement PMO Business Process... SDLC Software Development Agile Project Management Business Analysis Agile Methodologies Management Product Management Team Building Change Management Resource Management Portfolio Management Account Management Negotiation Governance Operations Management Business Management See 8+     See less Program Management Vendor Management Cross-functional Team... Project Management Process Improvement PMO Business Process... SDLC Software Development Agile Project Management Business Analysis Agile Methodologies Management Product Management Team Building Change Management Resource Management Portfolio Management Account Management Negotiation Governance Operations Management Business Management See 8+     See less Program Management Vendor Management Cross-functional Team... Project Management Process Improvement PMO Business Process... SDLC Software Development Agile Project Management Business Analysis Agile Methodologies Management Product Management Team Building Change Management Resource Management Portfolio Management Account Management Negotiation Governance Operations Management Business Management See 8+     See less Education Southern Methodist University - Cox School of Business BBA,  Management Information Science 1989  – 1993 Obtained minors in Public Relations and History Talented and Gifted Magnet High School 1985  – 1989 Southern Methodist University - Cox School of Business BBA,  Management Information Science 1989  – 1993 Obtained minors in Public Relations and History Southern Methodist University - Cox School of Business BBA,  Management Information Science 1989  – 1993 Obtained minors in Public Relations and History Southern Methodist University - Cox School of Business BBA,  Management Information Science 1989  – 1993 Obtained minors in Public Relations and History Talented and Gifted Magnet High School 1985  – 1989 Talented and Gifted Magnet High School 1985  – 1989 Talented and Gifted Magnet High School 1985  – 1989 ", "Skills Human Performance... Classroom Instruction Program Management Performance Improvement E-learning Organizational... Leadership Development Career Development Management Development Stakeholder Management Training Talent Management Leadership Change Management Data Analysis E-Learning Cross-functional Team... Classroom Instructor-led Training Performance Management Workforce Planning Strategic Planning Management Human Resources See 9+     See less Skills  Human Performance... Classroom Instruction Program Management Performance Improvement E-learning Organizational... Leadership Development Career Development Management Development Stakeholder Management Training Talent Management Leadership Change Management Data Analysis E-Learning Cross-functional Team... Classroom Instructor-led Training Performance Management Workforce Planning Strategic Planning Management Human Resources See 9+     See less Human Performance... Classroom Instruction Program Management Performance Improvement E-learning Organizational... Leadership Development Career Development Management Development Stakeholder Management Training Talent Management Leadership Change Management Data Analysis E-Learning Cross-functional Team... Classroom Instructor-led Training Performance Management Workforce Planning Strategic Planning Management Human Resources See 9+     See less Human Performance... Classroom Instruction Program Management Performance Improvement E-learning Organizational... Leadership Development Career Development Management Development Stakeholder Management Training Talent Management Leadership Change Management Data Analysis E-Learning Cross-functional Team... Classroom Instructor-led Training Performance Management Workforce Planning Strategic Planning Management Human Resources See 9+     See less ", "Skills Cross-functional Team... Program Management Software Development Agile Methodologies Software Project... Product Management IT Strategy Solution Architecture Leadership Engineering Management IT Service Management Managed Hosting Integration PMP SDLC Agile Project Management Business Intelligence Enterprise Software Requirements Analysis Vendor Management Cloud Computing System Architecture See 7+     See less Skills  Cross-functional Team... Program Management Software Development Agile Methodologies Software Project... Product Management IT Strategy Solution Architecture Leadership Engineering Management IT Service Management Managed Hosting Integration PMP SDLC Agile Project Management Business Intelligence Enterprise Software Requirements Analysis Vendor Management Cloud Computing System Architecture See 7+     See less Cross-functional Team... Program Management Software Development Agile Methodologies Software Project... Product Management IT Strategy Solution Architecture Leadership Engineering Management IT Service Management Managed Hosting Integration PMP SDLC Agile Project Management Business Intelligence Enterprise Software Requirements Analysis Vendor Management Cloud Computing System Architecture See 7+     See less Cross-functional Team... Program Management Software Development Agile Methodologies Software Project... Product Management IT Strategy Solution Architecture Leadership Engineering Management IT Service Management Managed Hosting Integration PMP SDLC Agile Project Management Business Intelligence Enterprise Software Requirements Analysis Vendor Management Cloud Computing System Architecture See 7+     See less ", "Experience Senior Attorney and Technical Assistant to the Director of Litigation, Licensing, and Patents Intel Corporation January 2015  – Present (8 months) David provides support to the Director of the Litigation, Licensing, and Patents Department at Intel. Senior Patent Attorney - Interconnect Portfolio Manager Intel Corporation November 2005  –  December 2014  (9 years 2 months) David manages the interconnect committee, as well as assists in the development and management of parallel computing and processor memory interface sections of Intel's patent portfolio. Yet, David has prosecuted strategic patents from a number of technology areas including cache, processor architecture/microarchitecture, software, interconnect, firmware, semi-conductor manufacturing, and mobile technologies. A larger portion of David's non-prosecution work is focused on development of design patent strategy and foreign prosecution techniques, such as foreign country specific claim development, utility model applications, PCT application guidelines, and application acceleration procedures. Patent Engineer Intel Corporation August 2002  –  November 2005  (3 years 4 months) Santa Clara, CA Interconnect Analysis Engineer Intel Corporation January 2001  –  August 2002  (1 year 8 months) DuPont, Washington Senior Attorney and Technical Assistant to the Director of Litigation, Licensing, and Patents Intel Corporation January 2015  – Present (8 months) David provides support to the Director of the Litigation, Licensing, and Patents Department at Intel. Senior Attorney and Technical Assistant to the Director of Litigation, Licensing, and Patents Intel Corporation January 2015  – Present (8 months) David provides support to the Director of the Litigation, Licensing, and Patents Department at Intel. Senior Patent Attorney - Interconnect Portfolio Manager Intel Corporation November 2005  –  December 2014  (9 years 2 months) David manages the interconnect committee, as well as assists in the development and management of parallel computing and processor memory interface sections of Intel's patent portfolio. Yet, David has prosecuted strategic patents from a number of technology areas including cache, processor architecture/microarchitecture, software, interconnect, firmware, semi-conductor manufacturing, and mobile technologies. A larger portion of David's non-prosecution work is focused on development of design patent strategy and foreign prosecution techniques, such as foreign country specific claim development, utility model applications, PCT application guidelines, and application acceleration procedures. Senior Patent Attorney - Interconnect Portfolio Manager Intel Corporation November 2005  –  December 2014  (9 years 2 months) David manages the interconnect committee, as well as assists in the development and management of parallel computing and processor memory interface sections of Intel's patent portfolio. Yet, David has prosecuted strategic patents from a number of technology areas including cache, processor architecture/microarchitecture, software, interconnect, firmware, semi-conductor manufacturing, and mobile technologies. A larger portion of David's non-prosecution work is focused on development of design patent strategy and foreign prosecution techniques, such as foreign country specific claim development, utility model applications, PCT application guidelines, and application acceleration procedures. Patent Engineer Intel Corporation August 2002  –  November 2005  (3 years 4 months) Santa Clara, CA Patent Engineer Intel Corporation August 2002  –  November 2005  (3 years 4 months) Santa Clara, CA Interconnect Analysis Engineer Intel Corporation January 2001  –  August 2002  (1 year 8 months) DuPont, Washington Interconnect Analysis Engineer Intel Corporation January 2001  –  August 2002  (1 year 8 months) DuPont, Washington Skills Prosecution Due Diligence Licensing Strategy Semiconductors Computer Architecture Patent Prosecution Manufacturing Intellectual Property Patents Patent Litigation Embedded Systems Firmware Litigation Analysis Wireless See 1+     See less Skills  Prosecution Due Diligence Licensing Strategy Semiconductors Computer Architecture Patent Prosecution Manufacturing Intellectual Property Patents Patent Litigation Embedded Systems Firmware Litigation Analysis Wireless See 1+     See less Prosecution Due Diligence Licensing Strategy Semiconductors Computer Architecture Patent Prosecution Manufacturing Intellectual Property Patents Patent Litigation Embedded Systems Firmware Litigation Analysis Wireless See 1+     See less Prosecution Due Diligence Licensing Strategy Semiconductors Computer Architecture Patent Prosecution Manufacturing Intellectual Property Patents Patent Litigation Embedded Systems Firmware Litigation Analysis Wireless See 1+     See less Education Santa Clara University JD,  Tax and Patent Law 2002  – 2005 Graduated Summa Cum Laude University of Washington Electrical Engineering,  Digital Design 1997  – 2000 Santa Clara University JD,  Tax and Patent Law 2002  – 2005 Graduated Summa Cum Laude Santa Clara University JD,  Tax and Patent Law 2002  – 2005 Graduated Summa Cum Laude Santa Clara University JD,  Tax and Patent Law 2002  – 2005 Graduated Summa Cum Laude University of Washington Electrical Engineering,  Digital Design 1997  – 2000 University of Washington Electrical Engineering,  Digital Design 1997  – 2000 University of Washington Electrical Engineering,  Digital Design 1997  – 2000 ", "Summary Leadership Development Manager | HR Business Partner | HR Manager \n \nDelivering excellence in Human Resources has been the foundation of my career over 20 years in fast-paced, progressive organizations. Open-minded, collaborative team member with demonstrated strengths as a trusted business partner and adviser. Impactful HR professional and a global program manager in implementing HR and business strategic objectives and initiatives.  \n \nI am a passionate catalyst for building leaders and high performing teams, and for working with leaders to ensure the right talent is in place, focused on the right things, and motivated to deliver to the organization's current and future strategies.  \n \nI believe strong leadership is key to the long-term success of any organization, and facilitate identification and development of high potential leaders through assessment, training & development, coaching and strategic planning.  \n \nI have a strong work ethic with the ability to work in the critical space in the middle: translating strategy into action and execution. I find tremendous value in collaborating with others to leverage collective ideas and wisdom for optimal outcomes. Summary Leadership Development Manager | HR Business Partner | HR Manager \n \nDelivering excellence in Human Resources has been the foundation of my career over 20 years in fast-paced, progressive organizations. Open-minded, collaborative team member with demonstrated strengths as a trusted business partner and adviser. Impactful HR professional and a global program manager in implementing HR and business strategic objectives and initiatives.  \n \nI am a passionate catalyst for building leaders and high performing teams, and for working with leaders to ensure the right talent is in place, focused on the right things, and motivated to deliver to the organization's current and future strategies.  \n \nI believe strong leadership is key to the long-term success of any organization, and facilitate identification and development of high potential leaders through assessment, training & development, coaching and strategic planning.  \n \nI have a strong work ethic with the ability to work in the critical space in the middle: translating strategy into action and execution. I find tremendous value in collaborating with others to leverage collective ideas and wisdom for optimal outcomes. Leadership Development Manager | HR Business Partner | HR Manager \n \nDelivering excellence in Human Resources has been the foundation of my career over 20 years in fast-paced, progressive organizations. Open-minded, collaborative team member with demonstrated strengths as a trusted business partner and adviser. Impactful HR professional and a global program manager in implementing HR and business strategic objectives and initiatives.  \n \nI am a passionate catalyst for building leaders and high performing teams, and for working with leaders to ensure the right talent is in place, focused on the right things, and motivated to deliver to the organization's current and future strategies.  \n \nI believe strong leadership is key to the long-term success of any organization, and facilitate identification and development of high potential leaders through assessment, training & development, coaching and strategic planning.  \n \nI have a strong work ethic with the ability to work in the critical space in the middle: translating strategy into action and execution. I find tremendous value in collaborating with others to leverage collective ideas and wisdom for optimal outcomes. Leadership Development Manager | HR Business Partner | HR Manager \n \nDelivering excellence in Human Resources has been the foundation of my career over 20 years in fast-paced, progressive organizations. Open-minded, collaborative team member with demonstrated strengths as a trusted business partner and adviser. Impactful HR professional and a global program manager in implementing HR and business strategic objectives and initiatives.  \n \nI am a passionate catalyst for building leaders and high performing teams, and for working with leaders to ensure the right talent is in place, focused on the right things, and motivated to deliver to the organization's current and future strategies.  \n \nI believe strong leadership is key to the long-term success of any organization, and facilitate identification and development of high potential leaders through assessment, training & development, coaching and strategic planning.  \n \nI have a strong work ethic with the ability to work in the critical space in the middle: translating strategy into action and execution. I find tremendous value in collaborating with others to leverage collective ideas and wisdom for optimal outcomes. Experience Seeking the right opportunity to apply my experience, skills and passion In Transition August 2015  – Present (1 month) Leadership Development Portfolio Manager Intel Corporation 2014  –  July 2015  (1 year) Hillsboro, OR * Directed leadership development programs and curriculum for senior, non-executive leadership, with audience of ~5,000 managers and leaders.  \n \n* Brought new ideas and approaches, e.g. on-demand learning and performance support that enabled leadership development and enabled managers to access and utilize development resources at point of need. Benchmarked and partnered with industry experts.  \n \n* Developed messaging, collateral, use cases, development resources and portal to introduce a leadership competency model and supporting developmental resources. HR Business Partner / Manager Intel Corporation 2013  –  2014  (1 year) Hillsboro, OR * Managed virtual team of HR professionals, e.g. employee relations, C&B, and recruiting etc. to meet HR-related needs of business with 3,500 employees and $14B in revenue. \n \n* Developed and implemented HR strategy for a key business unit (~3,500 employees), including strategic executive hires, integration of acquired companies, and organizational effectiveness. \n\t \n* Drove strategic hiring initiative for several key positions that required finding talent with emerging, scarce, and highly competitive skills using both internal and external staffing organizations. Talent Development Manager Intel Corporation 2012  –  2013  (1 year) Hillsboro, Oregon * Managed team to drive initiatives focused on multiple enterprise high priority talent segments. \n \n* Created development program for high-potential GM candidates, including robust definition of role, required skills and experiences, coaching, sponsors, mentors, development plans, assessments and group development strategies. . \n\t \n* Our team ran the coaching program office, developed and gained agreement on strategy, developed internal coaching capability, focused and marketed coaching to develop high potential leadership talent. \n \n* Established Veteran’s diversity program office and strategy. Drove visibility and innovative methods to increase self-identification for diversity-tracking. Created campaign including event with Intel's CEO. More than doubled known vets in company. Hired dedicated recruiter to ramp up hiring, joined external consortiums, and provided mentoring to returning U.S. veterans. \n HR Operations Manager Intel Corporation 2009  –  2012  (3 years) Hillsboro, OR * “Chief-of-Staff” to HR Vice President for 800-person organization delivering services to 100K+ employees. \n \n* Contributed to leadership’s strategy and execution that grew shared-service capability, reduced cost to from 38% above to 13% below market, and consistently delivered customer satisfaction above industry benchmarks. \n \n* Member in development of pilot Strategic Workforce Planning capability for Intel that translated organization’s business strategy into workforce implications and strategies to close gaps. \n \n* Led multiple complex projects, including co-leadership of large-scale HR/IT benchmarking and planning initiative that drove significant change to HR/IT strategy to maximize IT investment, shifting from 350+ applications with ~650 integration points to hub-and-spoke model. \n \n* Proactively identified emerging trends, prioritized projects, aligned leadership and resources to collaborate on most critical work. HR Business Partner Intel Corporation 2005  –  2009  (4 years) Hillsboro, OR * Provided HR support to four VP-level Finance organizations consisting of ~4-500 employees \n \n* Designed and led an initiative to develop non-US Finance leadership talent, significantly increasing the number of local leaders and reducing reliance on expats to fill key roles.  \n \n* Drove people initiatives across Finance, focusing on areas of career development, performance management, compensation, recruiting and training. \n\t \n* Initiated and led initiative to develop high-potential international talent in pipeline for Controller roles. Identified and created individualized development plans, assigned executive mentors, and created expat rotational assignments. Reduced expat positions by more than half, leading to significant cost savings and increase of employee morale. \n \n* Directed efforts to proactively mitigate turnover and improve diversity through education, hiring, promotion and retention. HR Business Partner & Talent Strategist Nortel Networks 1998  –  2005  (7 years) Dallas/Fort Worth Area * Provided HR leadership for four VP-level organizations, and liaised with corporate HR to design and deliver HR programs to the business. \n \n* Designed/delivered large-scale people strategies for ~7,000 employees (~50/50 North America and Europe) collaboratively with HR business leaders and corporate teams, including Employee Engagement, Succession Management, Performance Management, Employee/Leadership Development, High-Potential development, Diversity, Workforce Planning, Compensation, and Employee Communications. \n \n* Co-developed a competency model and 360 assessment process. \n \n* Directed creation of metrics package and process that improved talent planning and decision-making process and provided early indicators of positive or negative trends in key resource indicators. \n \n* Implemented and project managed large reduction in force (RIF) of over 50% of employee base. \n \n* Developed global skills database for professional services organization to capture capabilities and deploy talent. \n \n* Created professional services career paths, job classifications and market data to reflect work in progress. Seeking the right opportunity to apply my experience, skills and passion In Transition August 2015  – Present (1 month) Seeking the right opportunity to apply my experience, skills and passion In Transition August 2015  – Present (1 month) Leadership Development Portfolio Manager Intel Corporation 2014  –  July 2015  (1 year) Hillsboro, OR * Directed leadership development programs and curriculum for senior, non-executive leadership, with audience of ~5,000 managers and leaders.  \n \n* Brought new ideas and approaches, e.g. on-demand learning and performance support that enabled leadership development and enabled managers to access and utilize development resources at point of need. Benchmarked and partnered with industry experts.  \n \n* Developed messaging, collateral, use cases, development resources and portal to introduce a leadership competency model and supporting developmental resources. Leadership Development Portfolio Manager Intel Corporation 2014  –  July 2015  (1 year) Hillsboro, OR * Directed leadership development programs and curriculum for senior, non-executive leadership, with audience of ~5,000 managers and leaders.  \n \n* Brought new ideas and approaches, e.g. on-demand learning and performance support that enabled leadership development and enabled managers to access and utilize development resources at point of need. Benchmarked and partnered with industry experts.  \n \n* Developed messaging, collateral, use cases, development resources and portal to introduce a leadership competency model and supporting developmental resources. HR Business Partner / Manager Intel Corporation 2013  –  2014  (1 year) Hillsboro, OR * Managed virtual team of HR professionals, e.g. employee relations, C&B, and recruiting etc. to meet HR-related needs of business with 3,500 employees and $14B in revenue. \n \n* Developed and implemented HR strategy for a key business unit (~3,500 employees), including strategic executive hires, integration of acquired companies, and organizational effectiveness. \n\t \n* Drove strategic hiring initiative for several key positions that required finding talent with emerging, scarce, and highly competitive skills using both internal and external staffing organizations. HR Business Partner / Manager Intel Corporation 2013  –  2014  (1 year) Hillsboro, OR * Managed virtual team of HR professionals, e.g. employee relations, C&B, and recruiting etc. to meet HR-related needs of business with 3,500 employees and $14B in revenue. \n \n* Developed and implemented HR strategy for a key business unit (~3,500 employees), including strategic executive hires, integration of acquired companies, and organizational effectiveness. \n\t \n* Drove strategic hiring initiative for several key positions that required finding talent with emerging, scarce, and highly competitive skills using both internal and external staffing organizations. Talent Development Manager Intel Corporation 2012  –  2013  (1 year) Hillsboro, Oregon * Managed team to drive initiatives focused on multiple enterprise high priority talent segments. \n \n* Created development program for high-potential GM candidates, including robust definition of role, required skills and experiences, coaching, sponsors, mentors, development plans, assessments and group development strategies. . \n\t \n* Our team ran the coaching program office, developed and gained agreement on strategy, developed internal coaching capability, focused and marketed coaching to develop high potential leadership talent. \n \n* Established Veteran’s diversity program office and strategy. Drove visibility and innovative methods to increase self-identification for diversity-tracking. Created campaign including event with Intel's CEO. More than doubled known vets in company. Hired dedicated recruiter to ramp up hiring, joined external consortiums, and provided mentoring to returning U.S. veterans. \n Talent Development Manager Intel Corporation 2012  –  2013  (1 year) Hillsboro, Oregon * Managed team to drive initiatives focused on multiple enterprise high priority talent segments. \n \n* Created development program for high-potential GM candidates, including robust definition of role, required skills and experiences, coaching, sponsors, mentors, development plans, assessments and group development strategies. . \n\t \n* Our team ran the coaching program office, developed and gained agreement on strategy, developed internal coaching capability, focused and marketed coaching to develop high potential leadership talent. \n \n* Established Veteran’s diversity program office and strategy. Drove visibility and innovative methods to increase self-identification for diversity-tracking. Created campaign including event with Intel's CEO. More than doubled known vets in company. Hired dedicated recruiter to ramp up hiring, joined external consortiums, and provided mentoring to returning U.S. veterans. \n HR Operations Manager Intel Corporation 2009  –  2012  (3 years) Hillsboro, OR * “Chief-of-Staff” to HR Vice President for 800-person organization delivering services to 100K+ employees. \n \n* Contributed to leadership’s strategy and execution that grew shared-service capability, reduced cost to from 38% above to 13% below market, and consistently delivered customer satisfaction above industry benchmarks. \n \n* Member in development of pilot Strategic Workforce Planning capability for Intel that translated organization’s business strategy into workforce implications and strategies to close gaps. \n \n* Led multiple complex projects, including co-leadership of large-scale HR/IT benchmarking and planning initiative that drove significant change to HR/IT strategy to maximize IT investment, shifting from 350+ applications with ~650 integration points to hub-and-spoke model. \n \n* Proactively identified emerging trends, prioritized projects, aligned leadership and resources to collaborate on most critical work. HR Operations Manager Intel Corporation 2009  –  2012  (3 years) Hillsboro, OR * “Chief-of-Staff” to HR Vice President for 800-person organization delivering services to 100K+ employees. \n \n* Contributed to leadership’s strategy and execution that grew shared-service capability, reduced cost to from 38% above to 13% below market, and consistently delivered customer satisfaction above industry benchmarks. \n \n* Member in development of pilot Strategic Workforce Planning capability for Intel that translated organization’s business strategy into workforce implications and strategies to close gaps. \n \n* Led multiple complex projects, including co-leadership of large-scale HR/IT benchmarking and planning initiative that drove significant change to HR/IT strategy to maximize IT investment, shifting from 350+ applications with ~650 integration points to hub-and-spoke model. \n \n* Proactively identified emerging trends, prioritized projects, aligned leadership and resources to collaborate on most critical work. HR Business Partner Intel Corporation 2005  –  2009  (4 years) Hillsboro, OR * Provided HR support to four VP-level Finance organizations consisting of ~4-500 employees \n \n* Designed and led an initiative to develop non-US Finance leadership talent, significantly increasing the number of local leaders and reducing reliance on expats to fill key roles.  \n \n* Drove people initiatives across Finance, focusing on areas of career development, performance management, compensation, recruiting and training. \n\t \n* Initiated and led initiative to develop high-potential international talent in pipeline for Controller roles. Identified and created individualized development plans, assigned executive mentors, and created expat rotational assignments. Reduced expat positions by more than half, leading to significant cost savings and increase of employee morale. \n \n* Directed efforts to proactively mitigate turnover and improve diversity through education, hiring, promotion and retention. HR Business Partner Intel Corporation 2005  –  2009  (4 years) Hillsboro, OR * Provided HR support to four VP-level Finance organizations consisting of ~4-500 employees \n \n* Designed and led an initiative to develop non-US Finance leadership talent, significantly increasing the number of local leaders and reducing reliance on expats to fill key roles.  \n \n* Drove people initiatives across Finance, focusing on areas of career development, performance management, compensation, recruiting and training. \n\t \n* Initiated and led initiative to develop high-potential international talent in pipeline for Controller roles. Identified and created individualized development plans, assigned executive mentors, and created expat rotational assignments. Reduced expat positions by more than half, leading to significant cost savings and increase of employee morale. \n \n* Directed efforts to proactively mitigate turnover and improve diversity through education, hiring, promotion and retention. HR Business Partner & Talent Strategist Nortel Networks 1998  –  2005  (7 years) Dallas/Fort Worth Area * Provided HR leadership for four VP-level organizations, and liaised with corporate HR to design and deliver HR programs to the business. \n \n* Designed/delivered large-scale people strategies for ~7,000 employees (~50/50 North America and Europe) collaboratively with HR business leaders and corporate teams, including Employee Engagement, Succession Management, Performance Management, Employee/Leadership Development, High-Potential development, Diversity, Workforce Planning, Compensation, and Employee Communications. \n \n* Co-developed a competency model and 360 assessment process. \n \n* Directed creation of metrics package and process that improved talent planning and decision-making process and provided early indicators of positive or negative trends in key resource indicators. \n \n* Implemented and project managed large reduction in force (RIF) of over 50% of employee base. \n \n* Developed global skills database for professional services organization to capture capabilities and deploy talent. \n \n* Created professional services career paths, job classifications and market data to reflect work in progress. HR Business Partner & Talent Strategist Nortel Networks 1998  –  2005  (7 years) Dallas/Fort Worth Area * Provided HR leadership for four VP-level organizations, and liaised with corporate HR to design and deliver HR programs to the business. \n \n* Designed/delivered large-scale people strategies for ~7,000 employees (~50/50 North America and Europe) collaboratively with HR business leaders and corporate teams, including Employee Engagement, Succession Management, Performance Management, Employee/Leadership Development, High-Potential development, Diversity, Workforce Planning, Compensation, and Employee Communications. \n \n* Co-developed a competency model and 360 assessment process. \n \n* Directed creation of metrics package and process that improved talent planning and decision-making process and provided early indicators of positive or negative trends in key resource indicators. \n \n* Implemented and project managed large reduction in force (RIF) of over 50% of employee base. \n \n* Developed global skills database for professional services organization to capture capabilities and deploy talent. \n \n* Created professional services career paths, job classifications and market data to reflect work in progress. Skills Talent Management Leadership Development Human Resources Workforce Planning Organizational... Succession Planning Program Management Performance Management Employee Engagement Leadership Management Employee Relations Cross-functional Team... Project Management Skills  Talent Management Leadership Development Human Resources Workforce Planning Organizational... Succession Planning Program Management Performance Management Employee Engagement Leadership Management Employee Relations Cross-functional Team... Project Management Talent Management Leadership Development Human Resources Workforce Planning Organizational... Succession Planning Program Management Performance Management Employee Engagement Leadership Management Employee Relations Cross-functional Team... Project Management Talent Management Leadership Development Human Resources Workforce Planning Organizational... Succession Planning Program Management Performance Management Employee Engagement Leadership Management Employee Relations Cross-functional Team... Project Management Education Brigham Young University 1998 Brigham Young University Masters in Organizational Behavior Brigham Young University 1998 Brigham Young University 1998 Brigham Young University 1998 Brigham Young University Masters in Organizational Behavior Brigham Young University Masters in Organizational Behavior Brigham Young University Masters in Organizational Behavior ", "Experience High Potential Portfolio Manager Intel Corporation February 2014  – Present (1 year 7 months) Executive Development Program Manager Intel Corporation January 2010  –  February 2014  (4 years 2 months) Succession Management Program Manager Intel Corporation July 2009  –  January 2010  (7 months) Executive Coaching Program Manager Intel Corporation November 2006  –  June 2009  (2 years 8 months) OD Consultant and Leadership Coach Intel Corporation October 2003  –  November 2006  (3 years 2 months) Business Process Planning Manager Intel Corporation February 2000  –  October 2003  (3 years 9 months) Various Positions Intel Corporation March 1991  –  February 2000  (9 years) High Potential Portfolio Manager Intel Corporation February 2014  – Present (1 year 7 months) High Potential Portfolio Manager Intel Corporation February 2014  – Present (1 year 7 months) Executive Development Program Manager Intel Corporation January 2010  –  February 2014  (4 years 2 months) Executive Development Program Manager Intel Corporation January 2010  –  February 2014  (4 years 2 months) Succession Management Program Manager Intel Corporation July 2009  –  January 2010  (7 months) Succession Management Program Manager Intel Corporation July 2009  –  January 2010  (7 months) Executive Coaching Program Manager Intel Corporation November 2006  –  June 2009  (2 years 8 months) Executive Coaching Program Manager Intel Corporation November 2006  –  June 2009  (2 years 8 months) OD Consultant and Leadership Coach Intel Corporation October 2003  –  November 2006  (3 years 2 months) OD Consultant and Leadership Coach Intel Corporation October 2003  –  November 2006  (3 years 2 months) Business Process Planning Manager Intel Corporation February 2000  –  October 2003  (3 years 9 months) Business Process Planning Manager Intel Corporation February 2000  –  October 2003  (3 years 9 months) Various Positions Intel Corporation March 1991  –  February 2000  (9 years) Various Positions Intel Corporation March 1991  –  February 2000  (9 years) Languages Spanish Spanish Spanish Skills Executive Development Talent Management Executive Assessments Executive Coaching Succession Planning Leadership Development Organizational... Program Management Career Development Management Development Program Design Leadership Coaching Organizational Design Strategy Instructional Design Performance Management Workshop Facilitation Workforce Planning Training Training Delivery Cross-functional Team... Employee Engagement Employee Training Management Strategic Planning See 11+     See less Skills  Executive Development Talent Management Executive Assessments Executive Coaching Succession Planning Leadership Development Organizational... Program Management Career Development Management Development Program Design Leadership Coaching Organizational Design Strategy Instructional Design Performance Management Workshop Facilitation Workforce Planning Training Training Delivery Cross-functional Team... Employee Engagement Employee Training Management Strategic Planning See 11+     See less Executive Development Talent Management Executive Assessments Executive Coaching Succession Planning Leadership Development Organizational... Program Management Career Development Management Development Program Design Leadership Coaching Organizational Design Strategy Instructional Design Performance Management Workshop Facilitation Workforce Planning Training Training Delivery Cross-functional Team... Employee Engagement Employee Training Management Strategic Planning See 11+     See less Executive Development Talent Management Executive Assessments Executive Coaching Succession Planning Leadership Development Organizational... Program Management Career Development Management Development Program Design Leadership Coaching Organizational Design Strategy Instructional Design Performance Management Workshop Facilitation Workforce Planning Training Training Delivery Cross-functional Team... Employee Engagement Employee Training Management Strategic Planning See 11+     See less Education Arizona State University Bachelor of Arts Columbia University Teachers College Certificate New Ventures West Certification Arizona State University Bachelor of Arts Arizona State University Bachelor of Arts Arizona State University Bachelor of Arts Columbia University Teachers College Certificate Columbia University Teachers College Certificate Columbia University Teachers College Certificate New Ventures West Certification New Ventures West Certification New Ventures West Certification ", "Summary I currently lead the Source Portfolio (150+ global HC) within IT. Source is responsible for the sourcing, procurement and payment solutions Intel utilizes across indirect, capital and direct material spends. \n \nMy 15 year career in Intel has been within IT and the supply chain. Over that time I have played system analyst, project manager, implementation manager, design team manager and cross geo organizational management roles throughout the supply chain. I joined Intel upon completion of my Masters degree in Business Administration from the University of Arizona. Summary I currently lead the Source Portfolio (150+ global HC) within IT. Source is responsible for the sourcing, procurement and payment solutions Intel utilizes across indirect, capital and direct material spends. \n \nMy 15 year career in Intel has been within IT and the supply chain. Over that time I have played system analyst, project manager, implementation manager, design team manager and cross geo organizational management roles throughout the supply chain. I joined Intel upon completion of my Masters degree in Business Administration from the University of Arizona. I currently lead the Source Portfolio (150+ global HC) within IT. Source is responsible for the sourcing, procurement and payment solutions Intel utilizes across indirect, capital and direct material spends. \n \nMy 15 year career in Intel has been within IT and the supply chain. Over that time I have played system analyst, project manager, implementation manager, design team manager and cross geo organizational management roles throughout the supply chain. I joined Intel upon completion of my Masters degree in Business Administration from the University of Arizona. I currently lead the Source Portfolio (150+ global HC) within IT. Source is responsible for the sourcing, procurement and payment solutions Intel utilizes across indirect, capital and direct material spends. \n \nMy 15 year career in Intel has been within IT and the supply chain. Over that time I have played system analyst, project manager, implementation manager, design team manager and cross geo organizational management roles throughout the supply chain. I joined Intel upon completion of my Masters degree in Business Administration from the University of Arizona. Experience IT Source Portfolio Manager Intel Corporation IT Source Portfolio Manager Intel Corporation IT Source Portfolio Manager Intel Corporation Skills Supply Chain Intel Semiconductors Portfolio Management Software Development Testing Skills  Supply Chain Intel Semiconductors Portfolio Management Software Development Testing Supply Chain Intel Semiconductors Portfolio Management Software Development Testing Supply Chain Intel Semiconductors Portfolio Management Software Development Testing Education University of Arizona Master of Business Administration (M.B.A.) 1998 University of Arizona Master of Business Administration (M.B.A.) 1998 University of Arizona Master of Business Administration (M.B.A.) 1998 University of Arizona Master of Business Administration (M.B.A.) 1998 ", "Summary An analytical and forward-thinking INFORMATION TECHNOLOGY EXECUTIVE with expertise in architecture, analytics, software development, and Integration. An adept leader who develops and leads diverse teams to improve team performance, collaboration and productivity. Creates expectations and develops performance plans that align with the goals and vision of an organization, ensuring long-lasting success.  \n \no Long-Range Strategic Planning  \no IT Roadmap & Strategy \no Technology Vision \no Application Portfolio Rationalization  \no Enterprise Architecture & Solution Architecture  \no Enterprise Business Architecture  \no Enterprise Information Management  \no Data Architecture & Application Architecture \no Reference Architecture & frameworks \no Clinical & Spend Analytics  \no Master Data Management \no Business Process Re-Engineering  \no Business Capabilities & Process Management  \no Software Delivery Management \no Waterfall & Agile Methodologies  \no People and Performance Management  \no Operations Management  \no Budget Management  \no Vendor Management Summary An analytical and forward-thinking INFORMATION TECHNOLOGY EXECUTIVE with expertise in architecture, analytics, software development, and Integration. An adept leader who develops and leads diverse teams to improve team performance, collaboration and productivity. Creates expectations and develops performance plans that align with the goals and vision of an organization, ensuring long-lasting success.  \n \no Long-Range Strategic Planning  \no IT Roadmap & Strategy \no Technology Vision \no Application Portfolio Rationalization  \no Enterprise Architecture & Solution Architecture  \no Enterprise Business Architecture  \no Enterprise Information Management  \no Data Architecture & Application Architecture \no Reference Architecture & frameworks \no Clinical & Spend Analytics  \no Master Data Management \no Business Process Re-Engineering  \no Business Capabilities & Process Management  \no Software Delivery Management \no Waterfall & Agile Methodologies  \no People and Performance Management  \no Operations Management  \no Budget Management  \no Vendor Management An analytical and forward-thinking INFORMATION TECHNOLOGY EXECUTIVE with expertise in architecture, analytics, software development, and Integration. An adept leader who develops and leads diverse teams to improve team performance, collaboration and productivity. Creates expectations and develops performance plans that align with the goals and vision of an organization, ensuring long-lasting success.  \n \no Long-Range Strategic Planning  \no IT Roadmap & Strategy \no Technology Vision \no Application Portfolio Rationalization  \no Enterprise Architecture & Solution Architecture  \no Enterprise Business Architecture  \no Enterprise Information Management  \no Data Architecture & Application Architecture \no Reference Architecture & frameworks \no Clinical & Spend Analytics  \no Master Data Management \no Business Process Re-Engineering  \no Business Capabilities & Process Management  \no Software Delivery Management \no Waterfall & Agile Methodologies  \no People and Performance Management  \no Operations Management  \no Budget Management  \no Vendor Management An analytical and forward-thinking INFORMATION TECHNOLOGY EXECUTIVE with expertise in architecture, analytics, software development, and Integration. An adept leader who develops and leads diverse teams to improve team performance, collaboration and productivity. Creates expectations and develops performance plans that align with the goals and vision of an organization, ensuring long-lasting success.  \n \no Long-Range Strategic Planning  \no IT Roadmap & Strategy \no Technology Vision \no Application Portfolio Rationalization  \no Enterprise Architecture & Solution Architecture  \no Enterprise Business Architecture  \no Enterprise Information Management  \no Data Architecture & Application Architecture \no Reference Architecture & frameworks \no Clinical & Spend Analytics  \no Master Data Management \no Business Process Re-Engineering  \no Business Capabilities & Process Management  \no Software Delivery Management \no Waterfall & Agile Methodologies  \no People and Performance Management  \no Operations Management  \no Budget Management  \no Vendor Management Experience Chief Technology Officer MoneyGram International September 2014  – Present (1 year) Dallas/Fort Worth Area Director, Enterprise Architecture & IT Strategy VHA 2011  –  2014  (3 years) Irving, TX Directed and executed overall enterprise IT strategy across VHA family of companies. Held responsible for all stages of projects, from ideation to build of applications, to mitigate business, technical, and delivery risks. Established agile development practice for software development. Developed 12- to 18-month IT roadmap for Provista to achieve 20% growth year for five years. Led clinical and supply chain analytics, helping hospitals with cost reduction and performance improvement. Created business case and roadmap to migrate legacy HR system based on Lawson to cloud-based workday solution. Developed Enterprise Information Management strategy and implemented big data processing and analytics platform for sales domain, using DataStax distribution. Implemented MDM for vendor, vendor contacts, and employees. Established enterprise service bus to enable real-time replication of master data across systems. Created business and process architecture and used to communicate problems and opportunities at all levels of management. Established .Net and Java frameworks, allowing for reuse of common capabilities and focus on delivering business capabilities. Managed a team of Enterprise, Business, Solution, and Software architects. Responsible for development of all projects using new technologies. Senior Principal Consultant: Executive Solution Advisor (HIPAA 5010/ICD 10) Dean Health Plan, Inc. January 2011  –  August 2011  (8 months) Madison, Wisconsin Area Instructed on solution to HIPAA 5010 compliance needs, defining high-level scope of work, developing cost estimates and high-level schedule and implementation details. Developed AS-IS and TO-BE business, application and technology blueprints, statement of work, and kicked off enterprise service bus and business-to-business migration project, using TIBCO-based enterprise class B2B and EAI solution to support government encounter data submission. Senior Principal Consultant: Enterprise Integration Ecolab July 2010  –  December 2010  (6 months) Greater Minneapolis-St. Paul Area Advised client on possible options and solutions, defining high-level scope of work, developing cost estimates and high-level schedule and implementation details. Developed AS-IS and TO-BE business, application, and technology blueprints, statement of work, and lead the enterprise service bus and business to business migration project, using TIBCO-based enterprise class B2B and EAI solution and SAP PI. Established enterprise integration architecture, governance process and center of excellence for ESB and B2B Senior Principal Consultant: Executive Solution Advisor (Medicare Compliance Automation) WellPoint February 2010  –  July 2010  (6 months) North Haven, CT Led strategy, architecture, and development effort for senior business (Medicare) compliance automation program, proactively identifying possible compliance issues through necessary controls throughout data pipeline. Senior Principal Consultant: Enterprise Business Architecture CareFirst BlueCross BlueShield 2009  –  February 2010  (1 year) Baltimore, Maryland Collaborated with division leads, SMEs, and others to develop business capability roadmap based on CEO and divisional vision developed by Mckinsey & Company. Oversaw business capability roadmap, which identified list of capabilities needed to achieve company’s 2010 vision, helping division heads to recognize progression toward achieving 2011 goals and gaps. Senior Principal Consultant: Architecture, Analytics and Integration Yamaha Motor Corporation, USA December 2007  –  2009  (2 years) Orange County, California Area Responsible for overall architecture, development of all interfaces between SAP and downstream, migration of reports from AS/400 to SAP BI. Oversaw mainframe migration to SAP ECC, MDM, SAP BI and Java-based custom applications. Directed overall architecture and developed roadmap to get to TO-BE state. Established enterprise architecture process, set up governance process, and led application, data, and technology AS-IS and TO-BE architecture. Supervised a team of architects, QA and developers. Helped Yamaha with technology standardization and reducing IT total cost of ownership. Senior Strategy & Operations, Portfolio Manager Intel Corporation 2006  –  2008  (2 years) Portland, Oregon Area Analyzed business and delivered effective business solutions by regulating different operations in organization. Responsible for high-level solution for all applications under channel business solutions. Prepared effective business strategy through portfolio management, relationship management with business and IT, financial planning and budgeting, global resource management, IT product health and usage and driving adoption on products. Managed business by employing innovative strategies in planning and execution. Managed portfolio of 26 applications and ensured all applications worked together to deliver goals of company’s channel business. Developed new projects or upgraded existing business solutions in accordance with client requirements. Senior Enterprise Architect Intel Corporation 2003  –  2006  (3 years) Portland, Oregon Area Translated business strategy into business data, application, and technology architecture for order-to-cash, logistics, and data warehousing. Acted as single point of contact for above domain for all architectural issues. Established enterprise architecture organization based on TOGAF architecture framework and evangelized importance of technology standardization, reuse, interoperability, and integration. Helped reduce total cost of ownership of IT infrastructure. Chaired architecture and solution review board for order to cash and logistics domain with key stakeholders from business, data, application, and technology to ensure compliance to standards. Influenced business to align with IT strategy and roadmap. Technical Program Manager, B2B RosettaNet & eBusiness Group US-India Operations Intel Corporation 2001  –  2003  (2 years) Portland, Oregon Area Designed and executed company RosettaNet program, thereby reducing maintenance cost and other cutbacks for company using TIBCO’s business connect, build-out of B2B infrastructure, orchestration of B2B gateway using TIBCO’s business connect, integration of OTC transactions with trading partners, designing of EAI process using TIBCO’S EAI and PI tools, and updating transactions in SAP ERP systems using SAP Adapter. Also responsible for eBusiness group US-India operations Technical Project Manager, Enterprise Application Integration Intel Corporation 1999  –  2001  (2 years) Portland, Oregon Area Led first EAI project using TIBCO’s publish and subscribe model for real-time synchronization of master data between SAP and Non-SAP systems. Developed EAI architecture, developed TIBCO components for master data synchronization using TIBCO’s integration manager, message broker, SAP adapter, COM adapter, database adapter. Merged code base, unit testing, managing versions and releasing code to different environments. Managed build-out of B2B gateway and disaster recovery in Virginia. Sr. Software Developer Fujitsu Consulting 1997  –  1999  (2 years) Greater Pittsburgh Area Designed web application for Alcoa, using Microsoft Active Server Pages, Visual Basic, and SQL Server database to automate operations, such as creating, reviewing, approving, and passing sales support orders. Programmer & Analyst Tata Consultancy Services 1994  –  1997  (3 years) Mumbai Area, India Concluded project of GE appliances, fulfilling requirements. Designed super product plan interface, using VB, Pro*COBOL, Oracle, HP-UNIX to monitor, centralize operations of different departments, and to mix and match existing products. Electrical Engineering Trainee Hindustan Unilever Limited 1993  –  1994  (1 year) Cochin, India Chief Technology Officer MoneyGram International September 2014  – Present (1 year) Dallas/Fort Worth Area Chief Technology Officer MoneyGram International September 2014  – Present (1 year) Dallas/Fort Worth Area Director, Enterprise Architecture & IT Strategy VHA 2011  –  2014  (3 years) Irving, TX Directed and executed overall enterprise IT strategy across VHA family of companies. Held responsible for all stages of projects, from ideation to build of applications, to mitigate business, technical, and delivery risks. Established agile development practice for software development. Developed 12- to 18-month IT roadmap for Provista to achieve 20% growth year for five years. Led clinical and supply chain analytics, helping hospitals with cost reduction and performance improvement. Created business case and roadmap to migrate legacy HR system based on Lawson to cloud-based workday solution. Developed Enterprise Information Management strategy and implemented big data processing and analytics platform for sales domain, using DataStax distribution. Implemented MDM for vendor, vendor contacts, and employees. Established enterprise service bus to enable real-time replication of master data across systems. Created business and process architecture and used to communicate problems and opportunities at all levels of management. Established .Net and Java frameworks, allowing for reuse of common capabilities and focus on delivering business capabilities. Managed a team of Enterprise, Business, Solution, and Software architects. Responsible for development of all projects using new technologies. Director, Enterprise Architecture & IT Strategy VHA 2011  –  2014  (3 years) Irving, TX Directed and executed overall enterprise IT strategy across VHA family of companies. Held responsible for all stages of projects, from ideation to build of applications, to mitigate business, technical, and delivery risks. Established agile development practice for software development. Developed 12- to 18-month IT roadmap for Provista to achieve 20% growth year for five years. Led clinical and supply chain analytics, helping hospitals with cost reduction and performance improvement. Created business case and roadmap to migrate legacy HR system based on Lawson to cloud-based workday solution. Developed Enterprise Information Management strategy and implemented big data processing and analytics platform for sales domain, using DataStax distribution. Implemented MDM for vendor, vendor contacts, and employees. Established enterprise service bus to enable real-time replication of master data across systems. Created business and process architecture and used to communicate problems and opportunities at all levels of management. Established .Net and Java frameworks, allowing for reuse of common capabilities and focus on delivering business capabilities. Managed a team of Enterprise, Business, Solution, and Software architects. Responsible for development of all projects using new technologies. Senior Principal Consultant: Executive Solution Advisor (HIPAA 5010/ICD 10) Dean Health Plan, Inc. January 2011  –  August 2011  (8 months) Madison, Wisconsin Area Instructed on solution to HIPAA 5010 compliance needs, defining high-level scope of work, developing cost estimates and high-level schedule and implementation details. Developed AS-IS and TO-BE business, application and technology blueprints, statement of work, and kicked off enterprise service bus and business-to-business migration project, using TIBCO-based enterprise class B2B and EAI solution to support government encounter data submission. Senior Principal Consultant: Executive Solution Advisor (HIPAA 5010/ICD 10) Dean Health Plan, Inc. January 2011  –  August 2011  (8 months) Madison, Wisconsin Area Instructed on solution to HIPAA 5010 compliance needs, defining high-level scope of work, developing cost estimates and high-level schedule and implementation details. Developed AS-IS and TO-BE business, application and technology blueprints, statement of work, and kicked off enterprise service bus and business-to-business migration project, using TIBCO-based enterprise class B2B and EAI solution to support government encounter data submission. Senior Principal Consultant: Enterprise Integration Ecolab July 2010  –  December 2010  (6 months) Greater Minneapolis-St. Paul Area Advised client on possible options and solutions, defining high-level scope of work, developing cost estimates and high-level schedule and implementation details. Developed AS-IS and TO-BE business, application, and technology blueprints, statement of work, and lead the enterprise service bus and business to business migration project, using TIBCO-based enterprise class B2B and EAI solution and SAP PI. Established enterprise integration architecture, governance process and center of excellence for ESB and B2B Senior Principal Consultant: Enterprise Integration Ecolab July 2010  –  December 2010  (6 months) Greater Minneapolis-St. Paul Area Advised client on possible options and solutions, defining high-level scope of work, developing cost estimates and high-level schedule and implementation details. Developed AS-IS and TO-BE business, application, and technology blueprints, statement of work, and lead the enterprise service bus and business to business migration project, using TIBCO-based enterprise class B2B and EAI solution and SAP PI. Established enterprise integration architecture, governance process and center of excellence for ESB and B2B Senior Principal Consultant: Executive Solution Advisor (Medicare Compliance Automation) WellPoint February 2010  –  July 2010  (6 months) North Haven, CT Led strategy, architecture, and development effort for senior business (Medicare) compliance automation program, proactively identifying possible compliance issues through necessary controls throughout data pipeline. Senior Principal Consultant: Executive Solution Advisor (Medicare Compliance Automation) WellPoint February 2010  –  July 2010  (6 months) North Haven, CT Led strategy, architecture, and development effort for senior business (Medicare) compliance automation program, proactively identifying possible compliance issues through necessary controls throughout data pipeline. Senior Principal Consultant: Enterprise Business Architecture CareFirst BlueCross BlueShield 2009  –  February 2010  (1 year) Baltimore, Maryland Collaborated with division leads, SMEs, and others to develop business capability roadmap based on CEO and divisional vision developed by Mckinsey & Company. Oversaw business capability roadmap, which identified list of capabilities needed to achieve company’s 2010 vision, helping division heads to recognize progression toward achieving 2011 goals and gaps. Senior Principal Consultant: Enterprise Business Architecture CareFirst BlueCross BlueShield 2009  –  February 2010  (1 year) Baltimore, Maryland Collaborated with division leads, SMEs, and others to develop business capability roadmap based on CEO and divisional vision developed by Mckinsey & Company. Oversaw business capability roadmap, which identified list of capabilities needed to achieve company’s 2010 vision, helping division heads to recognize progression toward achieving 2011 goals and gaps. Senior Principal Consultant: Architecture, Analytics and Integration Yamaha Motor Corporation, USA December 2007  –  2009  (2 years) Orange County, California Area Responsible for overall architecture, development of all interfaces between SAP and downstream, migration of reports from AS/400 to SAP BI. Oversaw mainframe migration to SAP ECC, MDM, SAP BI and Java-based custom applications. Directed overall architecture and developed roadmap to get to TO-BE state. Established enterprise architecture process, set up governance process, and led application, data, and technology AS-IS and TO-BE architecture. Supervised a team of architects, QA and developers. Helped Yamaha with technology standardization and reducing IT total cost of ownership. Senior Principal Consultant: Architecture, Analytics and Integration Yamaha Motor Corporation, USA December 2007  –  2009  (2 years) Orange County, California Area Responsible for overall architecture, development of all interfaces between SAP and downstream, migration of reports from AS/400 to SAP BI. Oversaw mainframe migration to SAP ECC, MDM, SAP BI and Java-based custom applications. Directed overall architecture and developed roadmap to get to TO-BE state. Established enterprise architecture process, set up governance process, and led application, data, and technology AS-IS and TO-BE architecture. Supervised a team of architects, QA and developers. Helped Yamaha with technology standardization and reducing IT total cost of ownership. Senior Strategy & Operations, Portfolio Manager Intel Corporation 2006  –  2008  (2 years) Portland, Oregon Area Analyzed business and delivered effective business solutions by regulating different operations in organization. Responsible for high-level solution for all applications under channel business solutions. Prepared effective business strategy through portfolio management, relationship management with business and IT, financial planning and budgeting, global resource management, IT product health and usage and driving adoption on products. Managed business by employing innovative strategies in planning and execution. Managed portfolio of 26 applications and ensured all applications worked together to deliver goals of company’s channel business. Developed new projects or upgraded existing business solutions in accordance with client requirements. Senior Strategy & Operations, Portfolio Manager Intel Corporation 2006  –  2008  (2 years) Portland, Oregon Area Analyzed business and delivered effective business solutions by regulating different operations in organization. Responsible for high-level solution for all applications under channel business solutions. Prepared effective business strategy through portfolio management, relationship management with business and IT, financial planning and budgeting, global resource management, IT product health and usage and driving adoption on products. Managed business by employing innovative strategies in planning and execution. Managed portfolio of 26 applications and ensured all applications worked together to deliver goals of company’s channel business. Developed new projects or upgraded existing business solutions in accordance with client requirements. Senior Enterprise Architect Intel Corporation 2003  –  2006  (3 years) Portland, Oregon Area Translated business strategy into business data, application, and technology architecture for order-to-cash, logistics, and data warehousing. Acted as single point of contact for above domain for all architectural issues. Established enterprise architecture organization based on TOGAF architecture framework and evangelized importance of technology standardization, reuse, interoperability, and integration. Helped reduce total cost of ownership of IT infrastructure. Chaired architecture and solution review board for order to cash and logistics domain with key stakeholders from business, data, application, and technology to ensure compliance to standards. Influenced business to align with IT strategy and roadmap. Senior Enterprise Architect Intel Corporation 2003  –  2006  (3 years) Portland, Oregon Area Translated business strategy into business data, application, and technology architecture for order-to-cash, logistics, and data warehousing. Acted as single point of contact for above domain for all architectural issues. Established enterprise architecture organization based on TOGAF architecture framework and evangelized importance of technology standardization, reuse, interoperability, and integration. Helped reduce total cost of ownership of IT infrastructure. Chaired architecture and solution review board for order to cash and logistics domain with key stakeholders from business, data, application, and technology to ensure compliance to standards. Influenced business to align with IT strategy and roadmap. Technical Program Manager, B2B RosettaNet & eBusiness Group US-India Operations Intel Corporation 2001  –  2003  (2 years) Portland, Oregon Area Designed and executed company RosettaNet program, thereby reducing maintenance cost and other cutbacks for company using TIBCO’s business connect, build-out of B2B infrastructure, orchestration of B2B gateway using TIBCO’s business connect, integration of OTC transactions with trading partners, designing of EAI process using TIBCO’S EAI and PI tools, and updating transactions in SAP ERP systems using SAP Adapter. Also responsible for eBusiness group US-India operations Technical Program Manager, B2B RosettaNet & eBusiness Group US-India Operations Intel Corporation 2001  –  2003  (2 years) Portland, Oregon Area Designed and executed company RosettaNet program, thereby reducing maintenance cost and other cutbacks for company using TIBCO’s business connect, build-out of B2B infrastructure, orchestration of B2B gateway using TIBCO’s business connect, integration of OTC transactions with trading partners, designing of EAI process using TIBCO’S EAI and PI tools, and updating transactions in SAP ERP systems using SAP Adapter. Also responsible for eBusiness group US-India operations Technical Project Manager, Enterprise Application Integration Intel Corporation 1999  –  2001  (2 years) Portland, Oregon Area Led first EAI project using TIBCO’s publish and subscribe model for real-time synchronization of master data between SAP and Non-SAP systems. Developed EAI architecture, developed TIBCO components for master data synchronization using TIBCO’s integration manager, message broker, SAP adapter, COM adapter, database adapter. Merged code base, unit testing, managing versions and releasing code to different environments. Managed build-out of B2B gateway and disaster recovery in Virginia. Technical Project Manager, Enterprise Application Integration Intel Corporation 1999  –  2001  (2 years) Portland, Oregon Area Led first EAI project using TIBCO’s publish and subscribe model for real-time synchronization of master data between SAP and Non-SAP systems. Developed EAI architecture, developed TIBCO components for master data synchronization using TIBCO’s integration manager, message broker, SAP adapter, COM adapter, database adapter. Merged code base, unit testing, managing versions and releasing code to different environments. Managed build-out of B2B gateway and disaster recovery in Virginia. Sr. Software Developer Fujitsu Consulting 1997  –  1999  (2 years) Greater Pittsburgh Area Designed web application for Alcoa, using Microsoft Active Server Pages, Visual Basic, and SQL Server database to automate operations, such as creating, reviewing, approving, and passing sales support orders. Sr. Software Developer Fujitsu Consulting 1997  –  1999  (2 years) Greater Pittsburgh Area Designed web application for Alcoa, using Microsoft Active Server Pages, Visual Basic, and SQL Server database to automate operations, such as creating, reviewing, approving, and passing sales support orders. Programmer & Analyst Tata Consultancy Services 1994  –  1997  (3 years) Mumbai Area, India Concluded project of GE appliances, fulfilling requirements. Designed super product plan interface, using VB, Pro*COBOL, Oracle, HP-UNIX to monitor, centralize operations of different departments, and to mix and match existing products. Programmer & Analyst Tata Consultancy Services 1994  –  1997  (3 years) Mumbai Area, India Concluded project of GE appliances, fulfilling requirements. Designed super product plan interface, using VB, Pro*COBOL, Oracle, HP-UNIX to monitor, centralize operations of different departments, and to mix and match existing products. Electrical Engineering Trainee Hindustan Unilever Limited 1993  –  1994  (1 year) Cochin, India Electrical Engineering Trainee Hindustan Unilever Limited 1993  –  1994  (1 year) Cochin, India Skills SOA Business Architecture Agile Methodologies Big Data Cloud Computing SaaS TOGAF ESB Master Data Management Business Process... Solution Architecture Enterprise Architecture Operations Management IT Strategy SAP Integration Software Development Enterprise Software Architecture Oracle Microsoft SQL Server Architectures EAI Business Intelligence Unix Strategy Consulting See 12+     See less Skills  SOA Business Architecture Agile Methodologies Big Data Cloud Computing SaaS TOGAF ESB Master Data Management Business Process... Solution Architecture Enterprise Architecture Operations Management IT Strategy SAP Integration Software Development Enterprise Software Architecture Oracle Microsoft SQL Server Architectures EAI Business Intelligence Unix Strategy Consulting See 12+     See less SOA Business Architecture Agile Methodologies Big Data Cloud Computing SaaS TOGAF ESB Master Data Management Business Process... Solution Architecture Enterprise Architecture Operations Management IT Strategy SAP Integration Software Development Enterprise Software Architecture Oracle Microsoft SQL Server Architectures EAI Business Intelligence Unix Strategy Consulting See 12+     See less SOA Business Architecture Agile Methodologies Big Data Cloud Computing SaaS TOGAF ESB Master Data Management Business Process... Solution Architecture Enterprise Architecture Operations Management IT Strategy SAP Integration Software Development Enterprise Software Architecture Oracle Microsoft SQL Server Architectures EAI Business Intelligence Unix Strategy Consulting See 12+     See less Education Oregon Health and Science University MS,  Management & Entrepreneurship Manipal Institute of Technology BS,  Electrical & Electronics 1989  – 1993 Northwestern University - Kellogg School of Management Executive Education,  Managing Customer Relationships for Profit Harvard Business School Executive Education,  Value Measurement in Healthcare Stanford University Graduate School of Business Executive Education,  Innovative CIO: Leadership , Innovation & Change Oregon Health and Science University MS,  Management & Entrepreneurship Oregon Health and Science University MS,  Management & Entrepreneurship Oregon Health and Science University MS,  Management & Entrepreneurship Manipal Institute of Technology BS,  Electrical & Electronics 1989  – 1993 Manipal Institute of Technology BS,  Electrical & Electronics 1989  – 1993 Manipal Institute of Technology BS,  Electrical & Electronics 1989  – 1993 Northwestern University - Kellogg School of Management Executive Education,  Managing Customer Relationships for Profit Northwestern University - Kellogg School of Management Executive Education,  Managing Customer Relationships for Profit Northwestern University - Kellogg School of Management Executive Education,  Managing Customer Relationships for Profit Harvard Business School Executive Education,  Value Measurement in Healthcare Harvard Business School Executive Education,  Value Measurement in Healthcare Harvard Business School Executive Education,  Value Measurement in Healthcare Stanford University Graduate School of Business Executive Education,  Innovative CIO: Leadership , Innovation & Change Stanford University Graduate School of Business Executive Education,  Innovative CIO: Leadership , Innovation & Change Stanford University Graduate School of Business Executive Education,  Innovative CIO: Leadership , Innovation & Change ", "Experience Global Account Manager - General Electric Intel Corporation March 2015  – Present (6 months) Portland, Oregon Area Enterprise Solution Sales, Intel Sales & Marketing Group \nGE Aviation \nGE Healthcare \nGE Lighting \nGE Oil & Gas \nGE Software Director, Strategic Business Development Intel Corporation October 2013  –  February 2015  (1 year 5 months) Portland, Oregon Area IOT Solutions, Product Solutions Group, Intel Services Division Customer Program & Portfolio Manager Intel Corporation June 2013  –  November 2013  (6 months) San Francisco Bay Area GE Industrial Internet Customer Program Manager  \nNetwork Product & Services Group Portfolio Manager PC Client Group Finance Manager Intel Corporation May 2012  –  August 2013  (1 year 4 months) Santa Clara, California PC Client Group P&L Manager Strategic Analyst Intel Corporation September 2008  –  May 2012  (3 years 9 months) Hillsboro, Oregon and Arlington, Virginia 2014 Client Product Line Analyst \nClient Value Segment Anayst \n2012 Client Product Line Analyst \nClient Enthusiast Segment Analyst \nDesktop Marketing Roadmap & Segmentation Analyst \nClient Competitive Analyst Senior Financial Analyst Intel Corporation April 2007  –  August 2008  (1 year 5 months) Hillsboro, Oregon Desktop Long Range Planning Analyst Financial Analyst Intel Corporation July 2005  –  March 2007  (1 year 9 months) Hillsboro, Oregon Business Client Group Consolidations Lead  \nFP&A Analyst supporting multiple Business Client Group teams Global Account Manager - General Electric Intel Corporation March 2015  – Present (6 months) Portland, Oregon Area Enterprise Solution Sales, Intel Sales & Marketing Group \nGE Aviation \nGE Healthcare \nGE Lighting \nGE Oil & Gas \nGE Software Global Account Manager - General Electric Intel Corporation March 2015  – Present (6 months) Portland, Oregon Area Enterprise Solution Sales, Intel Sales & Marketing Group \nGE Aviation \nGE Healthcare \nGE Lighting \nGE Oil & Gas \nGE Software Director, Strategic Business Development Intel Corporation October 2013  –  February 2015  (1 year 5 months) Portland, Oregon Area IOT Solutions, Product Solutions Group, Intel Services Division Director, Strategic Business Development Intel Corporation October 2013  –  February 2015  (1 year 5 months) Portland, Oregon Area IOT Solutions, Product Solutions Group, Intel Services Division Customer Program & Portfolio Manager Intel Corporation June 2013  –  November 2013  (6 months) San Francisco Bay Area GE Industrial Internet Customer Program Manager  \nNetwork Product & Services Group Portfolio Manager Customer Program & Portfolio Manager Intel Corporation June 2013  –  November 2013  (6 months) San Francisco Bay Area GE Industrial Internet Customer Program Manager  \nNetwork Product & Services Group Portfolio Manager PC Client Group Finance Manager Intel Corporation May 2012  –  August 2013  (1 year 4 months) Santa Clara, California PC Client Group P&L Manager PC Client Group Finance Manager Intel Corporation May 2012  –  August 2013  (1 year 4 months) Santa Clara, California PC Client Group P&L Manager Strategic Analyst Intel Corporation September 2008  –  May 2012  (3 years 9 months) Hillsboro, Oregon and Arlington, Virginia 2014 Client Product Line Analyst \nClient Value Segment Anayst \n2012 Client Product Line Analyst \nClient Enthusiast Segment Analyst \nDesktop Marketing Roadmap & Segmentation Analyst \nClient Competitive Analyst Strategic Analyst Intel Corporation September 2008  –  May 2012  (3 years 9 months) Hillsboro, Oregon and Arlington, Virginia 2014 Client Product Line Analyst \nClient Value Segment Anayst \n2012 Client Product Line Analyst \nClient Enthusiast Segment Analyst \nDesktop Marketing Roadmap & Segmentation Analyst \nClient Competitive Analyst Senior Financial Analyst Intel Corporation April 2007  –  August 2008  (1 year 5 months) Hillsboro, Oregon Desktop Long Range Planning Analyst Senior Financial Analyst Intel Corporation April 2007  –  August 2008  (1 year 5 months) Hillsboro, Oregon Desktop Long Range Planning Analyst Financial Analyst Intel Corporation July 2005  –  March 2007  (1 year 9 months) Hillsboro, Oregon Business Client Group Consolidations Lead  \nFP&A Analyst supporting multiple Business Client Group teams Financial Analyst Intel Corporation July 2005  –  March 2007  (1 year 9 months) Hillsboro, Oregon Business Client Group Consolidations Lead  \nFP&A Analyst supporting multiple Business Client Group teams Skills Financial Modeling Competitive Analysis Financial Analysis Strategic Planning Strategy Business Strategy Business Analysis Process Improvement Business Process... Semiconductors Cross-functional Team... Finance Business Development P&L Management Marketing Analytics Product Management Data Analysis Corporate Finance Analysis Forecasting Portfolio Management See 7+     See less Skills  Financial Modeling Competitive Analysis Financial Analysis Strategic Planning Strategy Business Strategy Business Analysis Process Improvement Business Process... Semiconductors Cross-functional Team... Finance Business Development P&L Management Marketing Analytics Product Management Data Analysis Corporate Finance Analysis Forecasting Portfolio Management See 7+     See less Financial Modeling Competitive Analysis Financial Analysis Strategic Planning Strategy Business Strategy Business Analysis Process Improvement Business Process... Semiconductors Cross-functional Team... Finance Business Development P&L Management Marketing Analytics Product Management Data Analysis Corporate Finance Analysis Forecasting Portfolio Management See 7+     See less Financial Modeling Competitive Analysis Financial Analysis Strategic Planning Strategy Business Strategy Business Analysis Process Improvement Business Process... Semiconductors Cross-functional Team... Finance Business Development P&L Management Marketing Analytics Product Management Data Analysis Corporate Finance Analysis Forecasting Portfolio Management See 7+     See less Education University of Oregon - Charles H. Lundquist College of Business Business Administration,  Finance/Economics 2001  – 2005 Activities and Societies:  Graduated with Honors\n• Lundquist College of Business Honors Program\n• National Society of Collegiate Scholars\n• Deans List: Winter 2002 ,  Fall 2002 ,  Winter 2003\n• Lundquist Center for Entrepreneurship Scholarship ,  2004-05\n• W.H. Shields Scholarship ,  2004-05 University of Oregon - Charles H. Lundquist College of Business Business Administration,  Finance/Economics 2001  – 2005 Activities and Societies:  Graduated with Honors\n• Lundquist College of Business Honors Program\n• National Society of Collegiate Scholars\n• Deans List: Winter 2002 ,  Fall 2002 ,  Winter 2003\n• Lundquist Center for Entrepreneurship Scholarship ,  2004-05\n• W.H. Shields Scholarship ,  2004-05 University of Oregon - Charles H. Lundquist College of Business Business Administration,  Finance/Economics 2001  – 2005 Activities and Societies:  Graduated with Honors\n• Lundquist College of Business Honors Program\n• National Society of Collegiate Scholars\n• Deans List: Winter 2002 ,  Fall 2002 ,  Winter 2003\n• Lundquist Center for Entrepreneurship Scholarship ,  2004-05\n• W.H. Shields Scholarship ,  2004-05 University of Oregon - Charles H. Lundquist College of Business Business Administration,  Finance/Economics 2001  – 2005 Activities and Societies:  Graduated with Honors\n• Lundquist College of Business Honors Program\n• National Society of Collegiate Scholars\n• Deans List: Winter 2002 ,  Fall 2002 ,  Winter 2003\n• Lundquist Center for Entrepreneurship Scholarship ,  2004-05\n• W.H. Shields Scholarship ,  2004-05 Honors & Awards ", "Experience Patent Portfolio Strategist Intel Corporation September 2012  – Present (3 years) Develop patent portfolio strategies and portfolio management practices for four of Intel’s patent portfolios. Lead strategic projects and provide expertise on patent matters. Manage a group of six patent attorneys. Patent Portfolio Manager Intel Corporation June 2006  –  September 2012  (6 years 4 months) Portfolio manager for two patent portfolios. Developed and implemented processes related to SIGs/SDOs. Supported licensing, litigation, and acquisition efforts. Managed joint development agreements. Patent Attorney Intel Corporation May 2005  –  June 2006  (1 year 2 months) Prepared and prosecuted patent applications for chipset related technologies. Provided patent training and other legal advice to business units. Performed offensive and defensive patent analysis. Associate Blakely Sokoloff Taylor & Zafman 2001  –  2005  (4 years) Prepared and prosecuted patent applications for a broad range of technologies including processor architecture, memory technology, semiconductor processing, and enterprise software. Performed defensive analysis of patents during licensing negotiations. Summer Associate and Law Clerk Limbach & Limbach LLP May 2000  –  October 2000  (6 months) Responded to patent application and trademark application Office actions. Prepared legal memoranda to support litigation and licensing negotiations. Performed infringement analysis. Patent Portfolio Strategist Intel Corporation September 2012  – Present (3 years) Develop patent portfolio strategies and portfolio management practices for four of Intel’s patent portfolios. Lead strategic projects and provide expertise on patent matters. Manage a group of six patent attorneys. Patent Portfolio Strategist Intel Corporation September 2012  – Present (3 years) Develop patent portfolio strategies and portfolio management practices for four of Intel’s patent portfolios. Lead strategic projects and provide expertise on patent matters. Manage a group of six patent attorneys. Patent Portfolio Manager Intel Corporation June 2006  –  September 2012  (6 years 4 months) Portfolio manager for two patent portfolios. Developed and implemented processes related to SIGs/SDOs. Supported licensing, litigation, and acquisition efforts. Managed joint development agreements. Patent Portfolio Manager Intel Corporation June 2006  –  September 2012  (6 years 4 months) Portfolio manager for two patent portfolios. Developed and implemented processes related to SIGs/SDOs. Supported licensing, litigation, and acquisition efforts. Managed joint development agreements. Patent Attorney Intel Corporation May 2005  –  June 2006  (1 year 2 months) Prepared and prosecuted patent applications for chipset related technologies. Provided patent training and other legal advice to business units. Performed offensive and defensive patent analysis. Patent Attorney Intel Corporation May 2005  –  June 2006  (1 year 2 months) Prepared and prosecuted patent applications for chipset related technologies. Provided patent training and other legal advice to business units. Performed offensive and defensive patent analysis. Associate Blakely Sokoloff Taylor & Zafman 2001  –  2005  (4 years) Prepared and prosecuted patent applications for a broad range of technologies including processor architecture, memory technology, semiconductor processing, and enterprise software. Performed defensive analysis of patents during licensing negotiations. Associate Blakely Sokoloff Taylor & Zafman 2001  –  2005  (4 years) Prepared and prosecuted patent applications for a broad range of technologies including processor architecture, memory technology, semiconductor processing, and enterprise software. Performed defensive analysis of patents during licensing negotiations. Summer Associate and Law Clerk Limbach & Limbach LLP May 2000  –  October 2000  (6 months) Responded to patent application and trademark application Office actions. Prepared legal memoranda to support litigation and licensing negotiations. Performed infringement analysis. Summer Associate and Law Clerk Limbach & Limbach LLP May 2000  –  October 2000  (6 months) Responded to patent application and trademark application Office actions. Prepared legal memoranda to support litigation and licensing negotiations. Performed infringement analysis. Skills Patent Portfolio... Patent Analysis Patent Strategy Patent Drafting Patents Intellectual Property Prosecution Patent Prosecution Patentability Licensing Due Diligence Mergers & Acquisitions Copyright Law Intellectual Property... Legal Advice Patent Applications Invention Wireless Joint Ventures See 4+     See less Skills  Patent Portfolio... Patent Analysis Patent Strategy Patent Drafting Patents Intellectual Property Prosecution Patent Prosecution Patentability Licensing Due Diligence Mergers & Acquisitions Copyright Law Intellectual Property... Legal Advice Patent Applications Invention Wireless Joint Ventures See 4+     See less Patent Portfolio... Patent Analysis Patent Strategy Patent Drafting Patents Intellectual Property Prosecution Patent Prosecution Patentability Licensing Due Diligence Mergers & Acquisitions Copyright Law Intellectual Property... Legal Advice Patent Applications Invention Wireless Joint Ventures See 4+     See less Patent Portfolio... Patent Analysis Patent Strategy Patent Drafting Patents Intellectual Property Prosecution Patent Prosecution Patentability Licensing Due Diligence Mergers & Acquisitions Copyright Law Intellectual Property... Legal Advice Patent Applications Invention Wireless Joint Ventures See 4+     See less Education University of California, Hastings College of the Law Doctor of Law (J.D.) 1998  – 2001 San Jose State University BSEE 1994  – 1998 Activities and Societies:  Humanities Honors Program ,  Tau Beta Pi University of California, Hastings College of the Law Doctor of Law (J.D.) 1998  – 2001 University of California, Hastings College of the Law Doctor of Law (J.D.) 1998  – 2001 University of California, Hastings College of the Law Doctor of Law (J.D.) 1998  – 2001 San Jose State University BSEE 1994  – 1998 Activities and Societies:  Humanities Honors Program ,  Tau Beta Pi San Jose State University BSEE 1994  – 1998 Activities and Societies:  Humanities Honors Program ,  Tau Beta Pi San Jose State University BSEE 1994  – 1998 Activities and Societies:  Humanities Honors Program ,  Tau Beta Pi ", "Experience VP - Finance American Tower - India November 2006  – Present (8 years 10 months) VP - Corporate Finance XCEL TELECOM PVT. LTD. December 2006  –  March 2009  (2 years 4 months) Portfolio Manager Intel Corporation January 2005  –  December 2006  (2 years) Head - Corporate Finance BPL Mobile June 2000  –  December 2004  (4 years 7 months) Finance Manager Marico Industries 1997  –  2000  (3 years) Article Trainee S. I. Mogul 1994  –  1997  (3 years) VP - Finance American Tower - India November 2006  – Present (8 years 10 months) VP - Finance American Tower - India November 2006  – Present (8 years 10 months) VP - Corporate Finance XCEL TELECOM PVT. LTD. December 2006  –  March 2009  (2 years 4 months) VP - Corporate Finance XCEL TELECOM PVT. LTD. December 2006  –  March 2009  (2 years 4 months) Portfolio Manager Intel Corporation January 2005  –  December 2006  (2 years) Portfolio Manager Intel Corporation January 2005  –  December 2006  (2 years) Head - Corporate Finance BPL Mobile June 2000  –  December 2004  (4 years 7 months) Head - Corporate Finance BPL Mobile June 2000  –  December 2004  (4 years 7 months) Finance Manager Marico Industries 1997  –  2000  (3 years) Finance Manager Marico Industries 1997  –  2000  (3 years) Article Trainee S. I. Mogul 1994  –  1997  (3 years) Article Trainee S. I. Mogul 1994  –  1997  (3 years) Skills Corporate Finance Financial Analysis Mergers Business Development Management Consulting Finance Negotiation Due Diligence Strategic Planning Communication Financial Modeling Business Planning Business Strategy Mergers & Acquisitions Managerial Finance Financial Reporting Financial Accounting See 2+     See less Skills  Corporate Finance Financial Analysis Mergers Business Development Management Consulting Finance Negotiation Due Diligence Strategic Planning Communication Financial Modeling Business Planning Business Strategy Mergers & Acquisitions Managerial Finance Financial Reporting Financial Accounting See 2+     See less Corporate Finance Financial Analysis Mergers Business Development Management Consulting Finance Negotiation Due Diligence Strategic Planning Communication Financial Modeling Business Planning Business Strategy Mergers & Acquisitions Managerial Finance Financial Reporting Financial Accounting See 2+     See less Corporate Finance Financial Analysis Mergers Business Development Management Consulting Finance Negotiation Due Diligence Strategic Planning Communication Financial Modeling Business Planning Business Strategy Mergers & Acquisitions Managerial Finance Financial Reporting Financial Accounting See 2+     See less Education Institute of Company Secretaries of India Company Secretary,  Company Law 1998  – 2005 Institute of Chartered Accountants of India CA,  Finance & Accountancy 1994  – 1997 Institute of Cost and Works Accountants of India - ICWAI ICWAI,  Cost Accountancy 1992  – 1995 Institute of Company Secretaries of India Company Secretary,  Company Law 1998  – 2005 Institute of Company Secretaries of India Company Secretary,  Company Law 1998  – 2005 Institute of Company Secretaries of India Company Secretary,  Company Law 1998  – 2005 Institute of Chartered Accountants of India CA,  Finance & Accountancy 1994  – 1997 Institute of Chartered Accountants of India CA,  Finance & Accountancy 1994  – 1997 Institute of Chartered Accountants of India CA,  Finance & Accountancy 1994  – 1997 Institute of Cost and Works Accountants of India - ICWAI ICWAI,  Cost Accountancy 1992  – 1995 Institute of Cost and Works Accountants of India - ICWAI ICWAI,  Cost Accountancy 1992  – 1995 Institute of Cost and Works Accountants of India - ICWAI ICWAI,  Cost Accountancy 1992  – 1995 ", "Skills Supply Chain Management Supply Chain Intel Corporate Finance IT Management IT Strategy Change Management Business Transformation Program Management Process Improvement Project Management Leadership Project Planning Strategy Cross-functional Team... SAP Team Building ERP Strategic Planning Enterprise Architecture Business Strategy Management Stakeholder Management Business Analysis Procurement ITIL Management Consulting See 12+     See less Skills  Supply Chain Management Supply Chain Intel Corporate Finance IT Management IT Strategy Change Management Business Transformation Program Management Process Improvement Project Management Leadership Project Planning Strategy Cross-functional Team... SAP Team Building ERP Strategic Planning Enterprise Architecture Business Strategy Management Stakeholder Management Business Analysis Procurement ITIL Management Consulting See 12+     See less Supply Chain Management Supply Chain Intel Corporate Finance IT Management IT Strategy Change Management Business Transformation Program Management Process Improvement Project Management Leadership Project Planning Strategy Cross-functional Team... SAP Team Building ERP Strategic Planning Enterprise Architecture Business Strategy Management Stakeholder Management Business Analysis Procurement ITIL Management Consulting See 12+     See less Supply Chain Management Supply Chain Intel Corporate Finance IT Management IT Strategy Change Management Business Transformation Program Management Process Improvement Project Management Leadership Project Planning Strategy Cross-functional Team... SAP Team Building ERP Strategic Planning Enterprise Architecture Business Strategy Management Stakeholder Management Business Analysis Procurement ITIL Management Consulting See 12+     See less ", "Experience Global 500 - Enterprise Business Development Manager Intel Corporation June 2013  – Present (2 years 3 months) United Kingdom Portfolio Manager Intel Corporation March 2000  –  June 2013  (13 years 4 months) I am responsible for motivating the developer community to develop Apps for Intel AppUp Center. Global 500 - Enterprise Business Development Manager Intel Corporation June 2013  – Present (2 years 3 months) United Kingdom Global 500 - Enterprise Business Development Manager Intel Corporation June 2013  – Present (2 years 3 months) United Kingdom Portfolio Manager Intel Corporation March 2000  –  June 2013  (13 years 4 months) I am responsible for motivating the developer community to develop Apps for Intel AppUp Center. Portfolio Manager Intel Corporation March 2000  –  June 2013  (13 years 4 months) I am responsible for motivating the developer community to develop Apps for Intel AppUp Center. Skills Product Management Product Marketing Program Management Financial Modeling Cross-functional Team... Portfolio Management Start-ups Strategic Partnerships Competitive Analysis Account Management Business Development Business Strategy Go-to-market Strategy Strategy Skills  Product Management Product Marketing Program Management Financial Modeling Cross-functional Team... Portfolio Management Start-ups Strategic Partnerships Competitive Analysis Account Management Business Development Business Strategy Go-to-market Strategy Strategy Product Management Product Marketing Program Management Financial Modeling Cross-functional Team... Portfolio Management Start-ups Strategic Partnerships Competitive Analysis Account Management Business Development Business Strategy Go-to-market Strategy Strategy Product Management Product Marketing Program Management Financial Modeling Cross-functional Team... Portfolio Management Start-ups Strategic Partnerships Competitive Analysis Account Management Business Development Business Strategy Go-to-market Strategy Strategy ", "Summary Jason Kang is a senior patent counsel at Intel’s Litigation, Licensing and Patents Group. He manages Intel’s graphics IP portfolio and has extensive experience in patent drafting, prosecution, appeals and post-grant proceedings. He performs strategic offensive/defensive patent reviews and advises the business units on IP matters. He also manages Intel’s pro bono program in Asia and has assisted several non-profit organizations with their legal needs. \n \nJason holds a B.Eng. (Hons) (Electrical Engineering) from NUS, a M.Sc. (Integrated Circuit Design) from NTU, and a LL.B. (Hons) from NUS law school. He is an Advocate & Solicitor of the Supreme Court of Singapore and serves on the IP Practice Committee of the Law Society of Singapore which provides regular feedback in public consultations on legislative and practice changes in IP law. He is also a member of Association of Singapore Patent Attorneys and Singapore Law Academy. Summary Jason Kang is a senior patent counsel at Intel’s Litigation, Licensing and Patents Group. He manages Intel’s graphics IP portfolio and has extensive experience in patent drafting, prosecution, appeals and post-grant proceedings. He performs strategic offensive/defensive patent reviews and advises the business units on IP matters. He also manages Intel’s pro bono program in Asia and has assisted several non-profit organizations with their legal needs. \n \nJason holds a B.Eng. (Hons) (Electrical Engineering) from NUS, a M.Sc. (Integrated Circuit Design) from NTU, and a LL.B. (Hons) from NUS law school. He is an Advocate & Solicitor of the Supreme Court of Singapore and serves on the IP Practice Committee of the Law Society of Singapore which provides regular feedback in public consultations on legislative and practice changes in IP law. He is also a member of Association of Singapore Patent Attorneys and Singapore Law Academy. Jason Kang is a senior patent counsel at Intel’s Litigation, Licensing and Patents Group. He manages Intel’s graphics IP portfolio and has extensive experience in patent drafting, prosecution, appeals and post-grant proceedings. He performs strategic offensive/defensive patent reviews and advises the business units on IP matters. He also manages Intel’s pro bono program in Asia and has assisted several non-profit organizations with their legal needs. \n \nJason holds a B.Eng. (Hons) (Electrical Engineering) from NUS, a M.Sc. (Integrated Circuit Design) from NTU, and a LL.B. (Hons) from NUS law school. He is an Advocate & Solicitor of the Supreme Court of Singapore and serves on the IP Practice Committee of the Law Society of Singapore which provides regular feedback in public consultations on legislative and practice changes in IP law. He is also a member of Association of Singapore Patent Attorneys and Singapore Law Academy. Jason Kang is a senior patent counsel at Intel’s Litigation, Licensing and Patents Group. He manages Intel’s graphics IP portfolio and has extensive experience in patent drafting, prosecution, appeals and post-grant proceedings. He performs strategic offensive/defensive patent reviews and advises the business units on IP matters. He also manages Intel’s pro bono program in Asia and has assisted several non-profit organizations with their legal needs. \n \nJason holds a B.Eng. (Hons) (Electrical Engineering) from NUS, a M.Sc. (Integrated Circuit Design) from NTU, and a LL.B. (Hons) from NUS law school. He is an Advocate & Solicitor of the Supreme Court of Singapore and serves on the IP Practice Committee of the Law Society of Singapore which provides regular feedback in public consultations on legislative and practice changes in IP law. He is also a member of Association of Singapore Patent Attorneys and Singapore Law Academy. Experience Senior patent counsel - Graphics IP portfolio chair Intel Corporation January 2014  – Present (1 year 8 months) Senior patent counsel - Graphics IP portfolio chair Intel Corporation January 2014  – Present (1 year 8 months) Senior patent counsel - Graphics IP portfolio chair Intel Corporation January 2014  – Present (1 year 8 months) Languages Chinese German Chinese German Chinese German Skills Patent Portfolio... Patent Prosecution Intellectual Property Patents US Patent Trademarks Patentability Prosecution Patent Applications Trade Secrets Patent Portfolio... Software Patents Trademark Infringement Intellectual Asset... Legal Opinions Registered Patent... Licensing Technology Transfer Domain Names Due Diligence Legal Writing Perl Semiconductors Prior Art Search Mixed Signal Copyright Law Intellectual Property... Embedded Systems Integrated Circuit... Software Licensing Microprocessors See 16+     See less Skills  Patent Portfolio... Patent Prosecution Intellectual Property Patents US Patent Trademarks Patentability Prosecution Patent Applications Trade Secrets Patent Portfolio... Software Patents Trademark Infringement Intellectual Asset... Legal Opinions Registered Patent... Licensing Technology Transfer Domain Names Due Diligence Legal Writing Perl Semiconductors Prior Art Search Mixed Signal Copyright Law Intellectual Property... Embedded Systems Integrated Circuit... Software Licensing Microprocessors See 16+     See less Patent Portfolio... Patent Prosecution Intellectual Property Patents US Patent Trademarks Patentability Prosecution Patent Applications Trade Secrets Patent Portfolio... Software Patents Trademark Infringement Intellectual Asset... Legal Opinions Registered Patent... Licensing Technology Transfer Domain Names Due Diligence Legal Writing Perl Semiconductors Prior Art Search Mixed Signal Copyright Law Intellectual Property... Embedded Systems Integrated Circuit... Software Licensing Microprocessors See 16+     See less Patent Portfolio... Patent Prosecution Intellectual Property Patents US Patent Trademarks Patentability Prosecution Patent Applications Trade Secrets Patent Portfolio... Software Patents Trademark Infringement Intellectual Asset... Legal Opinions Registered Patent... Licensing Technology Transfer Domain Names Due Diligence Legal Writing Perl Semiconductors Prior Art Search Mixed Signal Copyright Law Intellectual Property... Embedded Systems Integrated Circuit... Software Licensing Microprocessors See 16+     See less Education NUS Law School LL.B. (Hons) Nanyang Technological University M.Sc,  Integrated Circuit Design •\tSpecialized in Digital, Analog and RF IC Design National University of Singapore B.Eng,  Electrical Engineering with minor in Technopreneurship •\t2nd Class Honours (Upper) \n•\tAwarded Engineering Colours for outstanding extra-curricular activities \n•\tParticipated in student exchange program at the University of Waterloo, Ontario, Canada Activities and Societies:  •\tVice-Chairperson ,  NUSSU Public Relations Unit\n•\tLogistics Officer ,  NUSSU Open House Committee\n•\tQuarter-master ,  Canoeing ,  NUS Students' Sports Club\n•\tCommunications ,  AIESEC NUS Law School LL.B. (Hons) NUS Law School LL.B. (Hons) NUS Law School LL.B. (Hons) Nanyang Technological University M.Sc,  Integrated Circuit Design •\tSpecialized in Digital, Analog and RF IC Design Nanyang Technological University M.Sc,  Integrated Circuit Design •\tSpecialized in Digital, Analog and RF IC Design Nanyang Technological University M.Sc,  Integrated Circuit Design •\tSpecialized in Digital, Analog and RF IC Design National University of Singapore B.Eng,  Electrical Engineering with minor in Technopreneurship •\t2nd Class Honours (Upper) \n•\tAwarded Engineering Colours for outstanding extra-curricular activities \n•\tParticipated in student exchange program at the University of Waterloo, Ontario, Canada Activities and Societies:  •\tVice-Chairperson ,  NUSSU Public Relations Unit\n•\tLogistics Officer ,  NUSSU Open House Committee\n•\tQuarter-master ,  Canoeing ,  NUS Students' Sports Club\n•\tCommunications ,  AIESEC National University of Singapore B.Eng,  Electrical Engineering with minor in Technopreneurship •\t2nd Class Honours (Upper) \n•\tAwarded Engineering Colours for outstanding extra-curricular activities \n•\tParticipated in student exchange program at the University of Waterloo, Ontario, Canada Activities and Societies:  •\tVice-Chairperson ,  NUSSU Public Relations Unit\n•\tLogistics Officer ,  NUSSU Open House Committee\n•\tQuarter-master ,  Canoeing ,  NUS Students' Sports Club\n•\tCommunications ,  AIESEC National University of Singapore B.Eng,  Electrical Engineering with minor in Technopreneurship •\t2nd Class Honours (Upper) \n•\tAwarded Engineering Colours for outstanding extra-curricular activities \n•\tParticipated in student exchange program at the University of Waterloo, Ontario, Canada Activities and Societies:  •\tVice-Chairperson ,  NUSSU Public Relations Unit\n•\tLogistics Officer ,  NUSSU Open House Committee\n•\tQuarter-master ,  Canoeing ,  NUS Students' Sports Club\n•\tCommunications ,  AIESEC Honors & Awards Additional Honors & Awards •\tNaval Logistics Command Best NSMen Team, 2006 \n•\tTeaching and Interdisciplinary Education Fellowship, CALTECH, 2000 \n•\tBest Sub-Club (Water), NUS Sports Club Award, 1999 \n•\tBest Councillor, NUS Geographical Society FOC, 1999 \n•\tSilver Award, Republic of Singapore Navy WIT Convention, 1997 Additional Honors & Awards •\tNaval Logistics Command Best NSMen Team, 2006 \n•\tTeaching and Interdisciplinary Education Fellowship, CALTECH, 2000 \n•\tBest Sub-Club (Water), NUS Sports Club Award, 1999 \n•\tBest Councillor, NUS Geographical Society FOC, 1999 \n•\tSilver Award, Republic of Singapore Navy WIT Convention, 1997 Additional Honors & Awards •\tNaval Logistics Command Best NSMen Team, 2006 \n•\tTeaching and Interdisciplinary Education Fellowship, CALTECH, 2000 \n•\tBest Sub-Club (Water), NUS Sports Club Award, 1999 \n•\tBest Councillor, NUS Geographical Society FOC, 1999 \n•\tSilver Award, Republic of Singapore Navy WIT Convention, 1997 Additional Honors & Awards •\tNaval Logistics Command Best NSMen Team, 2006 \n•\tTeaching and Interdisciplinary Education Fellowship, CALTECH, 2000 \n•\tBest Sub-Club (Water), NUS Sports Club Award, 1999 \n•\tBest Councillor, NUS Geographical Society FOC, 1999 \n•\tSilver Award, Republic of Singapore Navy WIT Convention, 1997 ", "Skills Valuation Corporate Finance Strategy Finance Analysis Due Diligence Portfolio Management Business Development Sarbanes-Oxley Act Financial Modeling Forecasting Cross-functional Team... Budgets Pricing Analytics Skills  Valuation Corporate Finance Strategy Finance Analysis Due Diligence Portfolio Management Business Development Sarbanes-Oxley Act Financial Modeling Forecasting Cross-functional Team... Budgets Pricing Analytics Valuation Corporate Finance Strategy Finance Analysis Due Diligence Portfolio Management Business Development Sarbanes-Oxley Act Financial Modeling Forecasting Cross-functional Team... Budgets Pricing Analytics Valuation Corporate Finance Strategy Finance Analysis Due Diligence Portfolio Management Business Development Sarbanes-Oxley Act Financial Modeling Forecasting Cross-functional Team... Budgets Pricing Analytics "]}