{"position": "Pricing Manager", "company": "Intel Corporation", "profiles": ["Experience Pricing Manager Intel Corporation April 2008  – Present (7 years 5 months) Supply Chain Management Intel Corporation 1999  –  2008  (9 years) Technician Intel Corporation 1995  –  1999  (4 years) Chandler, AZ Pricing Manager Intel Corporation April 2008  – Present (7 years 5 months) Pricing Manager Intel Corporation April 2008  – Present (7 years 5 months) Supply Chain Management Intel Corporation 1999  –  2008  (9 years) Supply Chain Management Intel Corporation 1999  –  2008  (9 years) Technician Intel Corporation 1995  –  1999  (4 years) Chandler, AZ Technician Intel Corporation 1995  –  1999  (4 years) Chandler, AZ Skills Pricing Strategy Pricing Business Strategy Competitive Analysis Product Management Supply Chain Management Cross-functional Team... Skills  Pricing Strategy Pricing Business Strategy Competitive Analysis Product Management Supply Chain Management Cross-functional Team... Pricing Strategy Pricing Business Strategy Competitive Analysis Product Management Supply Chain Management Cross-functional Team... Pricing Strategy Pricing Business Strategy Competitive Analysis Product Management Supply Chain Management Cross-functional Team... ", "Summary Operations manager with deep background in supporting sales and marketing organizations in various industries \n \nSpecialties:  \nCustomer Orientation: Built relationships, credibility and trust with customers, both internal and external \nResults Orientation: Set clear, challenging goals, provided updates and delivered results \nRisk Taking: Willing to assume additional tasks to help improve existing processes and tools \nOpen and direct communication style Summary Operations manager with deep background in supporting sales and marketing organizations in various industries \n \nSpecialties:  \nCustomer Orientation: Built relationships, credibility and trust with customers, both internal and external \nResults Orientation: Set clear, challenging goals, provided updates and delivered results \nRisk Taking: Willing to assume additional tasks to help improve existing processes and tools \nOpen and direct communication style Operations manager with deep background in supporting sales and marketing organizations in various industries \n \nSpecialties:  \nCustomer Orientation: Built relationships, credibility and trust with customers, both internal and external \nResults Orientation: Set clear, challenging goals, provided updates and delivered results \nRisk Taking: Willing to assume additional tasks to help improve existing processes and tools \nOpen and direct communication style Operations manager with deep background in supporting sales and marketing organizations in various industries \n \nSpecialties:  \nCustomer Orientation: Built relationships, credibility and trust with customers, both internal and external \nResults Orientation: Set clear, challenging goals, provided updates and delivered results \nRisk Taking: Willing to assume additional tasks to help improve existing processes and tools \nOpen and direct communication style Experience Operations Manager - Samples Intel Corporation September 2014  –  February 2015  (6 months) Folsom, CA Responsible for the support of product samples for all America Sales and Marketing (ASMO) customers. Operations Manager - Pricing Intel Corporation May 2011  –  September 2014  (3 years 5 months) Folsom, CA Responsible for all business aspects of America's Sales and Marketing (ASMO) direct (MNC & Local OEM) rebates and the people that provide business operation support for the team. Strategic Pricing Manager Intel May 2007  –  May 2011  (4 years 1 month) Folsom, CA Developed and implemented pricing solutions for one of Intel's largest customers, influenced roadmap and product decisions, and provided pricing guidance to various stakeholders. Channel Pricing Manager Intel Corporation April 2005  –  May 2007  (2 years 2 months) Folsom, CA Developed and implemented pricing for all boxed CPU products sold by Intel, influence roadmap and product decisions, provided pricing guidance to various stakeholders. Supply, Demand and Pricing Manager Intel Corporation July 2002  –  April 2005  (2 years 10 months) Folsom, CA Managed the supply allocation process for all chipsets. New Product Planner Intel Corporation July 2000  –  July 2002  (2 years 1 month) Folsom, CA Provided planning support for several product development teams developing new NOR Flash products. Managed supply of samples, ensured test builds stayed on track and set up products in various planning systems. Merchandising Manager Kenmar Sales/ AMS July 1993  –  June 2000  (7 years) Western United States Managed team of 8 direct employees and 8 contractors as home improvement store merchandisers for this independent manufacturer's representative agency. Manufacturers Representative Fox Woodlee and Associates July 1991  –  July 1993  (2 years 1 month) Northern California, Northern Nevada Represented 8 manufacturers, calling on 200 paint store and home center accounts in Northern California and Northern Nevada. Operations Manager - Samples Intel Corporation September 2014  –  February 2015  (6 months) Folsom, CA Responsible for the support of product samples for all America Sales and Marketing (ASMO) customers. Operations Manager - Samples Intel Corporation September 2014  –  February 2015  (6 months) Folsom, CA Responsible for the support of product samples for all America Sales and Marketing (ASMO) customers. Operations Manager - Pricing Intel Corporation May 2011  –  September 2014  (3 years 5 months) Folsom, CA Responsible for all business aspects of America's Sales and Marketing (ASMO) direct (MNC & Local OEM) rebates and the people that provide business operation support for the team. Operations Manager - Pricing Intel Corporation May 2011  –  September 2014  (3 years 5 months) Folsom, CA Responsible for all business aspects of America's Sales and Marketing (ASMO) direct (MNC & Local OEM) rebates and the people that provide business operation support for the team. Strategic Pricing Manager Intel May 2007  –  May 2011  (4 years 1 month) Folsom, CA Developed and implemented pricing solutions for one of Intel's largest customers, influenced roadmap and product decisions, and provided pricing guidance to various stakeholders. Strategic Pricing Manager Intel May 2007  –  May 2011  (4 years 1 month) Folsom, CA Developed and implemented pricing solutions for one of Intel's largest customers, influenced roadmap and product decisions, and provided pricing guidance to various stakeholders. Channel Pricing Manager Intel Corporation April 2005  –  May 2007  (2 years 2 months) Folsom, CA Developed and implemented pricing for all boxed CPU products sold by Intel, influence roadmap and product decisions, provided pricing guidance to various stakeholders. Channel Pricing Manager Intel Corporation April 2005  –  May 2007  (2 years 2 months) Folsom, CA Developed and implemented pricing for all boxed CPU products sold by Intel, influence roadmap and product decisions, provided pricing guidance to various stakeholders. Supply, Demand and Pricing Manager Intel Corporation July 2002  –  April 2005  (2 years 10 months) Folsom, CA Managed the supply allocation process for all chipsets. Supply, Demand and Pricing Manager Intel Corporation July 2002  –  April 2005  (2 years 10 months) Folsom, CA Managed the supply allocation process for all chipsets. New Product Planner Intel Corporation July 2000  –  July 2002  (2 years 1 month) Folsom, CA Provided planning support for several product development teams developing new NOR Flash products. Managed supply of samples, ensured test builds stayed on track and set up products in various planning systems. New Product Planner Intel Corporation July 2000  –  July 2002  (2 years 1 month) Folsom, CA Provided planning support for several product development teams developing new NOR Flash products. Managed supply of samples, ensured test builds stayed on track and set up products in various planning systems. Merchandising Manager Kenmar Sales/ AMS July 1993  –  June 2000  (7 years) Western United States Managed team of 8 direct employees and 8 contractors as home improvement store merchandisers for this independent manufacturer's representative agency. Merchandising Manager Kenmar Sales/ AMS July 1993  –  June 2000  (7 years) Western United States Managed team of 8 direct employees and 8 contractors as home improvement store merchandisers for this independent manufacturer's representative agency. Manufacturers Representative Fox Woodlee and Associates July 1991  –  July 1993  (2 years 1 month) Northern California, Northern Nevada Represented 8 manufacturers, calling on 200 paint store and home center accounts in Northern California and Northern Nevada. Manufacturers Representative Fox Woodlee and Associates July 1991  –  July 1993  (2 years 1 month) Northern California, Northern Nevada Represented 8 manufacturers, calling on 200 paint store and home center accounts in Northern California and Northern Nevada. Languages English English English Skills Internal & External Pricing Product Marketing Competitive Analysis Cross-functional Team... Product Launch Semiconductors Product Management Market Analysis Forecasting Go-to-market Strategy Program Management Intel Process Improvement Data Analysis Financial Modeling Business Strategy Supply Chain Marketing Strategy Management Team Management See 6+     See less Skills  Internal & External Pricing Product Marketing Competitive Analysis Cross-functional Team... Product Launch Semiconductors Product Management Market Analysis Forecasting Go-to-market Strategy Program Management Intel Process Improvement Data Analysis Financial Modeling Business Strategy Supply Chain Marketing Strategy Management Team Management See 6+     See less Internal & External Pricing Product Marketing Competitive Analysis Cross-functional Team... Product Launch Semiconductors Product Management Market Analysis Forecasting Go-to-market Strategy Program Management Intel Process Improvement Data Analysis Financial Modeling Business Strategy Supply Chain Marketing Strategy Management Team Management See 6+     See less Internal & External Pricing Product Marketing Competitive Analysis Cross-functional Team... Product Launch Semiconductors Product Management Market Analysis Forecasting Go-to-market Strategy Program Management Intel Process Improvement Data Analysis Financial Modeling Business Strategy Supply Chain Marketing Strategy Management Team Management See 6+     See less Education Kent State University BBA,  Marketing 1982  – 1985 Kent State University BBA,  Marketing 1982  – 1985 Kent State University BBA,  Marketing 1982  – 1985 Kent State University BBA,  Marketing 1982  – 1985 ", "Experience Worldwide Pricing Team Manager Intel Corporation October 2014  – Present (11 months) Santa Clara Worldwide Retail Pricing Manager Intel Corporation September 2013  –  September 2014  (1 year 1 month) Santa Clara, US Pricing Team Manager Intel Corporation June 2011  –  August 2013  (2 years 3 months) Hong Kong Pricing Manager Intel Corporation October 2008  –  May 2011  (2 years 8 months) Hong Kong Developed and drove retail pricing strategies for desktop and mobile platforms for Asia-Pacific region. Business Planning Manager, Asia Pacific Intel June 2006  –  September 2008  (2 years 4 months) Hong Kong Managed Desktop and Mobile CPU Product strategy, Supply alignment, Demand forecast and Pricing for South Asia. Product Management Intern Synacor 2005  –  2005  (less than a year) Program Manager Wipro Infotech Ltd December 2003  –  August 2004  (9 months) In this capacity, I managed the end to end implementation of the DMS (Dealer Management System) at TVS Motors, India which was being carried out by Wipro. The project included an ambitious target of introducing a software management system at 1000+ dealerships spread across India and a centralized NOC at TVS campus to support this project. Site-In charge Wipro Infotech Ltd June 2002  –  November 2003  (1 year 6 months) I worked in NOC at Wipro Tech, Hyderabad site and also handled several domestic accounts where Wipro supported Managed services. Customer Support Engineer Wipro Infotech Ltd October 2000  –  May 2002  (1 year 8 months) In this profile, I worked on Microsoft and Solaris system administration and Cisco networking technology. Worldwide Pricing Team Manager Intel Corporation October 2014  – Present (11 months) Santa Clara Worldwide Pricing Team Manager Intel Corporation October 2014  – Present (11 months) Santa Clara Worldwide Retail Pricing Manager Intel Corporation September 2013  –  September 2014  (1 year 1 month) Santa Clara, US Worldwide Retail Pricing Manager Intel Corporation September 2013  –  September 2014  (1 year 1 month) Santa Clara, US Pricing Team Manager Intel Corporation June 2011  –  August 2013  (2 years 3 months) Hong Kong Pricing Team Manager Intel Corporation June 2011  –  August 2013  (2 years 3 months) Hong Kong Pricing Manager Intel Corporation October 2008  –  May 2011  (2 years 8 months) Hong Kong Developed and drove retail pricing strategies for desktop and mobile platforms for Asia-Pacific region. Pricing Manager Intel Corporation October 2008  –  May 2011  (2 years 8 months) Hong Kong Developed and drove retail pricing strategies for desktop and mobile platforms for Asia-Pacific region. Business Planning Manager, Asia Pacific Intel June 2006  –  September 2008  (2 years 4 months) Hong Kong Managed Desktop and Mobile CPU Product strategy, Supply alignment, Demand forecast and Pricing for South Asia. Business Planning Manager, Asia Pacific Intel June 2006  –  September 2008  (2 years 4 months) Hong Kong Managed Desktop and Mobile CPU Product strategy, Supply alignment, Demand forecast and Pricing for South Asia. Product Management Intern Synacor 2005  –  2005  (less than a year) Product Management Intern Synacor 2005  –  2005  (less than a year) Program Manager Wipro Infotech Ltd December 2003  –  August 2004  (9 months) In this capacity, I managed the end to end implementation of the DMS (Dealer Management System) at TVS Motors, India which was being carried out by Wipro. The project included an ambitious target of introducing a software management system at 1000+ dealerships spread across India and a centralized NOC at TVS campus to support this project. Program Manager Wipro Infotech Ltd December 2003  –  August 2004  (9 months) In this capacity, I managed the end to end implementation of the DMS (Dealer Management System) at TVS Motors, India which was being carried out by Wipro. The project included an ambitious target of introducing a software management system at 1000+ dealerships spread across India and a centralized NOC at TVS campus to support this project. Site-In charge Wipro Infotech Ltd June 2002  –  November 2003  (1 year 6 months) I worked in NOC at Wipro Tech, Hyderabad site and also handled several domestic accounts where Wipro supported Managed services. Site-In charge Wipro Infotech Ltd June 2002  –  November 2003  (1 year 6 months) I worked in NOC at Wipro Tech, Hyderabad site and also handled several domestic accounts where Wipro supported Managed services. Customer Support Engineer Wipro Infotech Ltd October 2000  –  May 2002  (1 year 8 months) In this profile, I worked on Microsoft and Solaris system administration and Cisco networking technology. Customer Support Engineer Wipro Infotech Ltd October 2000  –  May 2002  (1 year 8 months) In this profile, I worked on Microsoft and Solaris system administration and Cisco networking technology. Skills Competitive Analysis Analysis Financial Analysis Pre-sales Business Planning Business Analysis Software Project... Cross-functional Team... Financial Modeling Product Management Corporate Finance Managed Services Skills  Competitive Analysis Analysis Financial Analysis Pre-sales Business Planning Business Analysis Software Project... Cross-functional Team... Financial Modeling Product Management Corporate Finance Managed Services Competitive Analysis Analysis Financial Analysis Pre-sales Business Planning Business Analysis Software Project... Cross-functional Team... Financial Modeling Product Management Corporate Finance Managed Services Competitive Analysis Analysis Financial Analysis Pre-sales Business Planning Business Analysis Software Project... Cross-functional Team... Financial Modeling Product Management Corporate Finance Managed Services Education State University of New York at Buffalo - School of Management MBA,  Marketing and Finance 2004  – 2006 University at Buffalo 2004  – 2006 Kannur University State University of New York at Buffalo - School of Management MBA,  Marketing and Finance 2004  – 2006 State University of New York at Buffalo - School of Management MBA,  Marketing and Finance 2004  – 2006 State University of New York at Buffalo - School of Management MBA,  Marketing and Finance 2004  – 2006 University at Buffalo 2004  – 2006 University at Buffalo 2004  – 2006 University at Buffalo 2004  – 2006 Kannur University Kannur University Kannur University ", "Summary An experienced technology Business Analyst focusing on micro level revenue forecasting and macro level economic analysis specializing in the emerging and rapidly changing PC compute market. Summary An experienced technology Business Analyst focusing on micro level revenue forecasting and macro level economic analysis specializing in the emerging and rapidly changing PC compute market. An experienced technology Business Analyst focusing on micro level revenue forecasting and macro level economic analysis specializing in the emerging and rapidly changing PC compute market. An experienced technology Business Analyst focusing on micro level revenue forecasting and macro level economic analysis specializing in the emerging and rapidly changing PC compute market. Experience Pricing Manager Intel Corporation August 2014  – Present (1 year 1 month) Customer Business Analyst - Lenovo Intel Corporation January 2012  – Present (3 years 8 months) Swindon Own revenue and market forecasting for the Lenovo EMEA account supporting the Sales Team to assess, advise and provide guidance on the business to improve investment decision making with main responsibilities of; \n- Revenue Forecasting \n- Market Forecasting \n- Customer Procurement Management  \n- Working through international teams Customer Business Analyst - HP Intel Corporation January 2011  –  January 2012  (1 year 1 month) Key customer contact for HP’s DT supply chain owning tactical CPU forecasts and local supply requirements. \nKey functions; \n- Tactical forecast management \n- Ensuring smooth customer procurement relationship \n- Supported supply chain excellence Coach/Sales Assistant Marks & Spencer 2004  –  2007  (3 years) Leeds - Day to day running of the food department working tills, stock filling, sorting waste and working with customers.  \n- As a Coach had the responsibility to train new staff, run the department on evenings and was given management approval on tills to help resolve any immediate customers issues on the shop floor Pricing Manager Intel Corporation August 2014  – Present (1 year 1 month) Pricing Manager Intel Corporation August 2014  – Present (1 year 1 month) Customer Business Analyst - Lenovo Intel Corporation January 2012  – Present (3 years 8 months) Swindon Own revenue and market forecasting for the Lenovo EMEA account supporting the Sales Team to assess, advise and provide guidance on the business to improve investment decision making with main responsibilities of; \n- Revenue Forecasting \n- Market Forecasting \n- Customer Procurement Management  \n- Working through international teams Customer Business Analyst - Lenovo Intel Corporation January 2012  – Present (3 years 8 months) Swindon Own revenue and market forecasting for the Lenovo EMEA account supporting the Sales Team to assess, advise and provide guidance on the business to improve investment decision making with main responsibilities of; \n- Revenue Forecasting \n- Market Forecasting \n- Customer Procurement Management  \n- Working through international teams Customer Business Analyst - HP Intel Corporation January 2011  –  January 2012  (1 year 1 month) Key customer contact for HP’s DT supply chain owning tactical CPU forecasts and local supply requirements. \nKey functions; \n- Tactical forecast management \n- Ensuring smooth customer procurement relationship \n- Supported supply chain excellence Customer Business Analyst - HP Intel Corporation January 2011  –  January 2012  (1 year 1 month) Key customer contact for HP’s DT supply chain owning tactical CPU forecasts and local supply requirements. \nKey functions; \n- Tactical forecast management \n- Ensuring smooth customer procurement relationship \n- Supported supply chain excellence Coach/Sales Assistant Marks & Spencer 2004  –  2007  (3 years) Leeds - Day to day running of the food department working tills, stock filling, sorting waste and working with customers.  \n- As a Coach had the responsibility to train new staff, run the department on evenings and was given management approval on tills to help resolve any immediate customers issues on the shop floor Coach/Sales Assistant Marks & Spencer 2004  –  2007  (3 years) Leeds - Day to day running of the food department working tills, stock filling, sorting waste and working with customers.  \n- As a Coach had the responsibility to train new staff, run the department on evenings and was given management approval on tills to help resolve any immediate customers issues on the shop floor Skills Business Analysis Data Analysis Teamwork Management Business Business Strategy Marketing Project Planning Skills  Business Analysis Data Analysis Teamwork Management Business Business Strategy Marketing Project Planning Business Analysis Data Analysis Teamwork Management Business Business Strategy Marketing Project Planning Business Analysis Data Analysis Teamwork Management Business Business Strategy Marketing Project Planning Education University of Leeds Management (Int),  Business & Economics 2006  – 2010 University of Newcastle Management,  Business & Economics 2008  – 2009 University of Leeds Management (Int),  Business & Economics 2006  – 2010 University of Leeds Management (Int),  Business & Economics 2006  – 2010 University of Leeds Management (Int),  Business & Economics 2006  – 2010 University of Newcastle Management,  Business & Economics 2008  – 2009 University of Newcastle Management,  Business & Economics 2008  – 2009 University of Newcastle Management,  Business & Economics 2008  – 2009 ", "Skills Supply Chain Management Strategic Sourcing Supply Chain Purchasing Contract Negotiation Management Forecasting Continuous Improvement Leadership Outsourcing Logistics Manufacturing Cross-functional Team... Resource Management Semiconductors Product Marketing Benchmarking Business Continuity... IP management Pricing Strategic Planning Decision Analysis Market Research Value Propositions Team Leadership See 10+     See less Skills  Supply Chain Management Strategic Sourcing Supply Chain Purchasing Contract Negotiation Management Forecasting Continuous Improvement Leadership Outsourcing Logistics Manufacturing Cross-functional Team... Resource Management Semiconductors Product Marketing Benchmarking Business Continuity... IP management Pricing Strategic Planning Decision Analysis Market Research Value Propositions Team Leadership See 10+     See less Supply Chain Management Strategic Sourcing Supply Chain Purchasing Contract Negotiation Management Forecasting Continuous Improvement Leadership Outsourcing Logistics Manufacturing Cross-functional Team... Resource Management Semiconductors Product Marketing Benchmarking Business Continuity... IP management Pricing Strategic Planning Decision Analysis Market Research Value Propositions Team Leadership See 10+     See less Supply Chain Management Strategic Sourcing Supply Chain Purchasing Contract Negotiation Management Forecasting Continuous Improvement Leadership Outsourcing Logistics Manufacturing Cross-functional Team... Resource Management Semiconductors Product Marketing Benchmarking Business Continuity... IP management Pricing Strategic Planning Decision Analysis Market Research Value Propositions Team Leadership See 10+     See less ", "Experience Pricing Manager Intel Corporation January 2013  – Present (2 years 8 months) Santa Clara • Global Head of Modem pricing within the Microprocessor Marketing and Business Planning group, with full strategic price decision authority \n• Leading the collaboration- and alignment meetings with stakeholders from the Business Unit, Finance and Sales to define strategic pricing levels and determine budgetary quotes, price indications as well as final bids for all customers across all channels \n• Responsible for developing and executing a company-wide process change to transition and integrate standalone business solutions \n Pricing Manager Intel Mobile Communications April 2011  –  December 2012  (1 year 9 months) Munich Area, Germany • Global pricing responsible for the Mobile Wireless Sales business unit \n• Operational process owner for the standard bidding tool for direct customer and distribution quotation, for transfer and sample pricing as well as coordinated and aligned global pricing across multiple departments \n• Supported strategic price decisions by offering analyses based on price-elasticity, consistency, discrepancy, improvement and performance Pricing Application Analyst Vendavo June 2010  –  March 2011  (10 months) San Francisco Bay Area • Global consultant for a project to implement and rollout a customized pricing software \n• Prepared requirements specifications to define the “To-Be Processes”, translated the business requirements into functional specifications and developed the UI prototype \n• Developed use cases for training and testing (SIT & UAT), performed SAP integration testing and provided project status and change control \n Pricing Specialist Infineon Technologies May 2007  –  May 2010  (3 years 1 month) Munich Area, Germany • Global pricing responsible for the Radio Frequenzy & Protection Devices product line \n• Implemented pricing strategies and pricing management to support the regional Sales and Marketing channel \n• Process responsible for annual contracts (Volume Purchase Agreement), including preparation, processing, price proposals and quotations, participation and leading the price negotiation with customers (deep insight into confidential data such as production costs, gross- and contribution margin calculation) \n Internship Infineon Technologies July 2005  –  February 2007  (1 year 8 months) Munich Area, Germany • Developed an application strategy for product presentations for the Automotive, Industrial & Multimarket product line \n• Initiated the target setting process, verified the agreements between Sales and Marketing and evaluated the bonus incentives \n• Prepared and visualized presentations for quarterly business results and monthly management business reports  \n Pricing Manager Intel Corporation January 2013  – Present (2 years 8 months) Santa Clara • Global Head of Modem pricing within the Microprocessor Marketing and Business Planning group, with full strategic price decision authority \n• Leading the collaboration- and alignment meetings with stakeholders from the Business Unit, Finance and Sales to define strategic pricing levels and determine budgetary quotes, price indications as well as final bids for all customers across all channels \n• Responsible for developing and executing a company-wide process change to transition and integrate standalone business solutions \n Pricing Manager Intel Corporation January 2013  – Present (2 years 8 months) Santa Clara • Global Head of Modem pricing within the Microprocessor Marketing and Business Planning group, with full strategic price decision authority \n• Leading the collaboration- and alignment meetings with stakeholders from the Business Unit, Finance and Sales to define strategic pricing levels and determine budgetary quotes, price indications as well as final bids for all customers across all channels \n• Responsible for developing and executing a company-wide process change to transition and integrate standalone business solutions \n Pricing Manager Intel Mobile Communications April 2011  –  December 2012  (1 year 9 months) Munich Area, Germany • Global pricing responsible for the Mobile Wireless Sales business unit \n• Operational process owner for the standard bidding tool for direct customer and distribution quotation, for transfer and sample pricing as well as coordinated and aligned global pricing across multiple departments \n• Supported strategic price decisions by offering analyses based on price-elasticity, consistency, discrepancy, improvement and performance Pricing Manager Intel Mobile Communications April 2011  –  December 2012  (1 year 9 months) Munich Area, Germany • Global pricing responsible for the Mobile Wireless Sales business unit \n• Operational process owner for the standard bidding tool for direct customer and distribution quotation, for transfer and sample pricing as well as coordinated and aligned global pricing across multiple departments \n• Supported strategic price decisions by offering analyses based on price-elasticity, consistency, discrepancy, improvement and performance Pricing Application Analyst Vendavo June 2010  –  March 2011  (10 months) San Francisco Bay Area • Global consultant for a project to implement and rollout a customized pricing software \n• Prepared requirements specifications to define the “To-Be Processes”, translated the business requirements into functional specifications and developed the UI prototype \n• Developed use cases for training and testing (SIT & UAT), performed SAP integration testing and provided project status and change control \n Pricing Application Analyst Vendavo June 2010  –  March 2011  (10 months) San Francisco Bay Area • Global consultant for a project to implement and rollout a customized pricing software \n• Prepared requirements specifications to define the “To-Be Processes”, translated the business requirements into functional specifications and developed the UI prototype \n• Developed use cases for training and testing (SIT & UAT), performed SAP integration testing and provided project status and change control \n Pricing Specialist Infineon Technologies May 2007  –  May 2010  (3 years 1 month) Munich Area, Germany • Global pricing responsible for the Radio Frequenzy & Protection Devices product line \n• Implemented pricing strategies and pricing management to support the regional Sales and Marketing channel \n• Process responsible for annual contracts (Volume Purchase Agreement), including preparation, processing, price proposals and quotations, participation and leading the price negotiation with customers (deep insight into confidential data such as production costs, gross- and contribution margin calculation) \n Pricing Specialist Infineon Technologies May 2007  –  May 2010  (3 years 1 month) Munich Area, Germany • Global pricing responsible for the Radio Frequenzy & Protection Devices product line \n• Implemented pricing strategies and pricing management to support the regional Sales and Marketing channel \n• Process responsible for annual contracts (Volume Purchase Agreement), including preparation, processing, price proposals and quotations, participation and leading the price negotiation with customers (deep insight into confidential data such as production costs, gross- and contribution margin calculation) \n Internship Infineon Technologies July 2005  –  February 2007  (1 year 8 months) Munich Area, Germany • Developed an application strategy for product presentations for the Automotive, Industrial & Multimarket product line \n• Initiated the target setting process, verified the agreements between Sales and Marketing and evaluated the bonus incentives \n• Prepared and visualized presentations for quarterly business results and monthly management business reports  \n Internship Infineon Technologies July 2005  –  February 2007  (1 year 8 months) Munich Area, Germany • Developed an application strategy for product presentations for the Automotive, Industrial & Multimarket product line \n• Initiated the target setting process, verified the agreements between Sales and Marketing and evaluated the bonus incentives \n• Prepared and visualized presentations for quarterly business results and monthly management business reports  \n Languages German Turkish English German Turkish English German Turkish English Skills Pricing Strategy Bid Pricing Semiconductors Strategic Negotiations MS Excel Pivot Tables SAP CRM Reporting & Analysis MicroStrategy Reporting Business Objects Commodity Pricing Bonus Programs Financial Analysis Gross Margin Distribution Management Transfer Pricing Process Improvement Project Management JIRA UAT Coordination Competitive Analysis Product Management See 6+     See less Skills  Pricing Strategy Bid Pricing Semiconductors Strategic Negotiations MS Excel Pivot Tables SAP CRM Reporting & Analysis MicroStrategy Reporting Business Objects Commodity Pricing Bonus Programs Financial Analysis Gross Margin Distribution Management Transfer Pricing Process Improvement Project Management JIRA UAT Coordination Competitive Analysis Product Management See 6+     See less Pricing Strategy Bid Pricing Semiconductors Strategic Negotiations MS Excel Pivot Tables SAP CRM Reporting & Analysis MicroStrategy Reporting Business Objects Commodity Pricing Bonus Programs Financial Analysis Gross Margin Distribution Management Transfer Pricing Process Improvement Project Management JIRA UAT Coordination Competitive Analysis Product Management See 6+     See less Pricing Strategy Bid Pricing Semiconductors Strategic Negotiations MS Excel Pivot Tables SAP CRM Reporting & Analysis MicroStrategy Reporting Business Objects Commodity Pricing Bonus Programs Financial Analysis Gross Margin Distribution Management Transfer Pricing Process Improvement Project Management JIRA UAT Coordination Competitive Analysis Product Management See 6+     See less Education University of Applied Sciences Giessen-Friedberg Master of Business Administration (MBA),  Marketing and Business Law , GPA: 3.2 2002  – 2006 University of Applied Sciences Giessen-Friedberg Master of Business Administration (MBA),  Marketing and Business Law , GPA: 3.2 2002  – 2006 University of Applied Sciences Giessen-Friedberg Master of Business Administration (MBA),  Marketing and Business Law , GPA: 3.2 2002  – 2006 University of Applied Sciences Giessen-Friedberg Master of Business Administration (MBA),  Marketing and Business Law , GPA: 3.2 2002  – 2006 ", "Experience EMEA Pricing Manager Intel Corporation EMEA Pricing Manager Intel Corporation EMEA Pricing Manager Intel Corporation Education Aston University 2005  – 2009 Aston University 2005  – 2009 Aston University 2005  – 2009 Aston University 2005  – 2009 ", "Skills Financial Modeling Skills  Financial Modeling Financial Modeling Financial Modeling ", "Languages English Native or bilingual proficiency Arabic Native or bilingual proficiency English Native or bilingual proficiency Arabic Native or bilingual proficiency English Native or bilingual proficiency Arabic Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Semiconductors Product Marketing Intel SoC Embedded Systems Product Management Processors Go-to-market Strategy Program Management Strategy Product Development ASIC IC Semiconductor Industry Management Skills  Semiconductors Product Marketing Intel SoC Embedded Systems Product Management Processors Go-to-market Strategy Program Management Strategy Product Development ASIC IC Semiconductor Industry Management Semiconductors Product Marketing Intel SoC Embedded Systems Product Management Processors Go-to-market Strategy Program Management Strategy Product Development ASIC IC Semiconductor Industry Management Semiconductors Product Marketing Intel SoC Embedded Systems Product Management Processors Go-to-market Strategy Program Management Strategy Product Development ASIC IC Semiconductor Industry Management ", "Summary Specialties: Deal management, Pricing Analyst/Management, Supercomputers, Sales, Program & Marketing Management Summary Specialties: Deal management, Pricing Analyst/Management, Supercomputers, Sales, Program & Marketing Management Specialties: Deal management, Pricing Analyst/Management, Supercomputers, Sales, Program & Marketing Management Specialties: Deal management, Pricing Analyst/Management, Supercomputers, Sales, Program & Marketing Management Experience Deal Manager Top 500 Deals Team Intel Corporation July 2014  – Present (1 year 2 months) WW Server Pricing Manager Intel Corporation October 2012  – Present (2 years 11 months) Swindon, United Kingdom Worldwide Server Roadmap Pricing Manager Intel Corporation April 2012  –  December 2012  (9 months) Hillsboro, OR Manage Intel's server product roadmap strategy & server pricing Pricing Manager Intel Corporation November 2009  –  June 2012  (2 years 8 months) Field Sales Executive Intel Corporation May 2009  –  October 2009  (6 months) Rotation to Nordic Field Team Geo Business Manager For Mobile EMEA Intel Corporation September 2008  –  May 2009  (9 months) Geo Business Analyst Intel Corporation August 2007  –  September 2008  (1 year 2 months) Customer Business Analayst Intel Corporation June 2005  –  August 2007  (2 years 3 months) 1 Year as an Intern Sales Assistant Homebase June 2000  –  September 2006  (6 years 4 months) Oxford, United Kingdom Office Assistant Leadbitter Group June 1999  –  August 1999  (3 months) Eynsham, Oxfordshire Deal Manager Top 500 Deals Team Intel Corporation July 2014  – Present (1 year 2 months) WW Deal Manager Top 500 Deals Team Intel Corporation July 2014  – Present (1 year 2 months) WW Server Pricing Manager Intel Corporation October 2012  – Present (2 years 11 months) Swindon, United Kingdom Server Pricing Manager Intel Corporation October 2012  – Present (2 years 11 months) Swindon, United Kingdom Worldwide Server Roadmap Pricing Manager Intel Corporation April 2012  –  December 2012  (9 months) Hillsboro, OR Manage Intel's server product roadmap strategy & server pricing Worldwide Server Roadmap Pricing Manager Intel Corporation April 2012  –  December 2012  (9 months) Hillsboro, OR Manage Intel's server product roadmap strategy & server pricing Pricing Manager Intel Corporation November 2009  –  June 2012  (2 years 8 months) Pricing Manager Intel Corporation November 2009  –  June 2012  (2 years 8 months) Field Sales Executive Intel Corporation May 2009  –  October 2009  (6 months) Rotation to Nordic Field Team Field Sales Executive Intel Corporation May 2009  –  October 2009  (6 months) Rotation to Nordic Field Team Geo Business Manager For Mobile EMEA Intel Corporation September 2008  –  May 2009  (9 months) Geo Business Manager For Mobile EMEA Intel Corporation September 2008  –  May 2009  (9 months) Geo Business Analyst Intel Corporation August 2007  –  September 2008  (1 year 2 months) Geo Business Analyst Intel Corporation August 2007  –  September 2008  (1 year 2 months) Customer Business Analayst Intel Corporation June 2005  –  August 2007  (2 years 3 months) 1 Year as an Intern Customer Business Analayst Intel Corporation June 2005  –  August 2007  (2 years 3 months) 1 Year as an Intern Sales Assistant Homebase June 2000  –  September 2006  (6 years 4 months) Oxford, United Kingdom Sales Assistant Homebase June 2000  –  September 2006  (6 years 4 months) Oxford, United Kingdom Office Assistant Leadbitter Group June 1999  –  August 1999  (3 months) Eynsham, Oxfordshire Office Assistant Leadbitter Group June 1999  –  August 1999  (3 months) Eynsham, Oxfordshire Skills Intel Product Marketing Negotiation Competitive Analysis Semiconductors Forecasting Account Management Customer Relations Cloud Computing Business Analysis Team Leadership Data Analysis Pricing Business Strategy Marketing Strategy Problem Solving Sales Management Contract Negotiation Market Research Business Planning Analysis Cross-functional Team... Storage Supply Chain Management Mentoring Contract Negotiations Planning Program Management Channel International Sales Go-to-market Strategy Customer Service Sales Strategic Partnerships Product Management Channel Partners See 21+     See less Skills  Intel Product Marketing Negotiation Competitive Analysis Semiconductors Forecasting Account Management Customer Relations Cloud Computing Business Analysis Team Leadership Data Analysis Pricing Business Strategy Marketing Strategy Problem Solving Sales Management Contract Negotiation Market Research Business Planning Analysis Cross-functional Team... Storage Supply Chain Management Mentoring Contract Negotiations Planning Program Management Channel International Sales Go-to-market Strategy Customer Service Sales Strategic Partnerships Product Management Channel Partners See 21+     See less Intel Product Marketing Negotiation Competitive Analysis Semiconductors Forecasting Account Management Customer Relations Cloud Computing Business Analysis Team Leadership Data Analysis Pricing Business Strategy Marketing Strategy Problem Solving Sales Management Contract Negotiation Market Research Business Planning Analysis Cross-functional Team... Storage Supply Chain Management Mentoring Contract Negotiations Planning Program Management Channel International Sales Go-to-market Strategy Customer Service Sales Strategic Partnerships Product Management Channel Partners See 21+     See less Intel Product Marketing Negotiation Competitive Analysis Semiconductors Forecasting Account Management Customer Relations Cloud Computing Business Analysis Team Leadership Data Analysis Pricing Business Strategy Marketing Strategy Problem Solving Sales Management Contract Negotiation Market Research Business Planning Analysis Cross-functional Team... Storage Supply Chain Management Mentoring Contract Negotiations Planning Program Management Channel International Sales Go-to-market Strategy Customer Service Sales Strategic Partnerships Product Management Channel Partners See 21+     See less Education University of Brighton BA (Hons),  Business Studies 2002  – 2006 Bartholomew School A-Levels & GCSE's 1994  – 2000 University of Brighton BA (Hons),  Business Studies 2002  – 2006 University of Brighton BA (Hons),  Business Studies 2002  – 2006 University of Brighton BA (Hons),  Business Studies 2002  – 2006 Bartholomew School A-Levels & GCSE's 1994  – 2000 Bartholomew School A-Levels & GCSE's 1994  – 2000 Bartholomew School A-Levels & GCSE's 1994  – 2000 ", "Experience EMEA SSD and PCSD Pricing Manager Intel Corporation July 2014  – Present (1 year 2 months) Channel Business Operations Server Lead Intel Corporation September 2011  –  July 2014  (2 years 11 months) Swindon, United Kingdom In addition to core business analyst role I have expanded my knowledge and influence into the growing server business. My knowledge of the server market and technical products has greatly increased in this role. \n \nResponsibilities in this role include coaching and leading my team towards achieving server targets and regularly updating management on the direction of the EU+ channel server business. \n \nIn addition to this I work closely with the EU field teams and server director to ensure all stakeholders are focused to the same goal and that targets are met without impact from pricing or supply. Customer Business Analyst Intel Corporation February 2010  –  July 2014  (4 years 6 months) Swindon, United Kingdom Responsible for the EMEA operational business of a top distributor of Intel products with a plus $200m yearly revenue. \n \nThis role includes tactical and strategic forecasting, expert product knowledge, market analysis and maintaining excellent stakeholder relationships. \n \nNature of the role requires close working relationships with various customer contacts and mulitple different internal groups including, but not limited to, sales, finance and marketing. Geographic Business Analyst Intel Corporation July 2008  –  August 2009  (1 year 2 months) Swindon, United Kingdom Internship with responsibility of running the tactical supply for the EMEA server board and system business. \n \nThis role included tactical forecasting, day by day problem solving and ensuring adequate supply was available for both channel and MNC customers \n \nAdditionally in this role I undertook a project to improve the logistics set up between China and Amsterdam. Working closely with collegaues in Amsterdam I was able to reduce inventory build up on low selling products and optimise warehouse space for top products EMEA SSD and PCSD Pricing Manager Intel Corporation July 2014  – Present (1 year 2 months) EMEA SSD and PCSD Pricing Manager Intel Corporation July 2014  – Present (1 year 2 months) Channel Business Operations Server Lead Intel Corporation September 2011  –  July 2014  (2 years 11 months) Swindon, United Kingdom In addition to core business analyst role I have expanded my knowledge and influence into the growing server business. My knowledge of the server market and technical products has greatly increased in this role. \n \nResponsibilities in this role include coaching and leading my team towards achieving server targets and regularly updating management on the direction of the EU+ channel server business. \n \nIn addition to this I work closely with the EU field teams and server director to ensure all stakeholders are focused to the same goal and that targets are met without impact from pricing or supply. Channel Business Operations Server Lead Intel Corporation September 2011  –  July 2014  (2 years 11 months) Swindon, United Kingdom In addition to core business analyst role I have expanded my knowledge and influence into the growing server business. My knowledge of the server market and technical products has greatly increased in this role. \n \nResponsibilities in this role include coaching and leading my team towards achieving server targets and regularly updating management on the direction of the EU+ channel server business. \n \nIn addition to this I work closely with the EU field teams and server director to ensure all stakeholders are focused to the same goal and that targets are met without impact from pricing or supply. Customer Business Analyst Intel Corporation February 2010  –  July 2014  (4 years 6 months) Swindon, United Kingdom Responsible for the EMEA operational business of a top distributor of Intel products with a plus $200m yearly revenue. \n \nThis role includes tactical and strategic forecasting, expert product knowledge, market analysis and maintaining excellent stakeholder relationships. \n \nNature of the role requires close working relationships with various customer contacts and mulitple different internal groups including, but not limited to, sales, finance and marketing. Customer Business Analyst Intel Corporation February 2010  –  July 2014  (4 years 6 months) Swindon, United Kingdom Responsible for the EMEA operational business of a top distributor of Intel products with a plus $200m yearly revenue. \n \nThis role includes tactical and strategic forecasting, expert product knowledge, market analysis and maintaining excellent stakeholder relationships. \n \nNature of the role requires close working relationships with various customer contacts and mulitple different internal groups including, but not limited to, sales, finance and marketing. Geographic Business Analyst Intel Corporation July 2008  –  August 2009  (1 year 2 months) Swindon, United Kingdom Internship with responsibility of running the tactical supply for the EMEA server board and system business. \n \nThis role included tactical forecasting, day by day problem solving and ensuring adequate supply was available for both channel and MNC customers \n \nAdditionally in this role I undertook a project to improve the logistics set up between China and Amsterdam. Working closely with collegaues in Amsterdam I was able to reduce inventory build up on low selling products and optimise warehouse space for top products Geographic Business Analyst Intel Corporation July 2008  –  August 2009  (1 year 2 months) Swindon, United Kingdom Internship with responsibility of running the tactical supply for the EMEA server board and system business. \n \nThis role included tactical forecasting, day by day problem solving and ensuring adequate supply was available for both channel and MNC customers \n \nAdditionally in this role I undertook a project to improve the logistics set up between China and Amsterdam. Working closely with collegaues in Amsterdam I was able to reduce inventory build up on low selling products and optimise warehouse space for top products Skills Strong Business Analysis SAP Customer Engagement Customer Presentations Data Analysis Sales Operations Problem Solving Leadership Competitive Analysis Business Process... Servers SSD Computer Industry Job Coaching Business Coaching Go-to-market Strategy Product Management Business Analysis Stakeholder Management Sales Semiconductors Account Management See 7+     See less Skills  Strong Business Analysis SAP Customer Engagement Customer Presentations Data Analysis Sales Operations Problem Solving Leadership Competitive Analysis Business Process... Servers SSD Computer Industry Job Coaching Business Coaching Go-to-market Strategy Product Management Business Analysis Stakeholder Management Sales Semiconductors Account Management See 7+     See less Strong Business Analysis SAP Customer Engagement Customer Presentations Data Analysis Sales Operations Problem Solving Leadership Competitive Analysis Business Process... Servers SSD Computer Industry Job Coaching Business Coaching Go-to-market Strategy Product Management Business Analysis Stakeholder Management Sales Semiconductors Account Management See 7+     See less Strong Business Analysis SAP Customer Engagement Customer Presentations Data Analysis Sales Operations Problem Solving Leadership Competitive Analysis Business Process... Servers SSD Computer Industry Job Coaching Business Coaching Go-to-market Strategy Product Management Business Analysis Stakeholder Management Sales Semiconductors Account Management See 7+     See less Education Loughborough University Bsc,  Management and Computing , 2:1 2005  – 2009 Studied for 3 years for a dual honours Management and Computing degree. \n \nDue to the course being 50/50 by the business school and the computer science department I was given the opportunity to learn traditional management and marketing strategies whilst also gaining a strong understanding into the working of computers and programming.  \n \nThis degree has given me a perfect balance of understanding to be successful in the computing industry. Loughborough University Bsc,  Management and Computing , 2:1 2005  – 2009 Studied for 3 years for a dual honours Management and Computing degree. \n \nDue to the course being 50/50 by the business school and the computer science department I was given the opportunity to learn traditional management and marketing strategies whilst also gaining a strong understanding into the working of computers and programming.  \n \nThis degree has given me a perfect balance of understanding to be successful in the computing industry. Loughborough University Bsc,  Management and Computing , 2:1 2005  – 2009 Studied for 3 years for a dual honours Management and Computing degree. \n \nDue to the course being 50/50 by the business school and the computer science department I was given the opportunity to learn traditional management and marketing strategies whilst also gaining a strong understanding into the working of computers and programming.  \n \nThis degree has given me a perfect balance of understanding to be successful in the computing industry. Loughborough University Bsc,  Management and Computing , 2:1 2005  – 2009 Studied for 3 years for a dual honours Management and Computing degree. \n \nDue to the course being 50/50 by the business school and the computer science department I was given the opportunity to learn traditional management and marketing strategies whilst also gaining a strong understanding into the working of computers and programming.  \n \nThis degree has given me a perfect balance of understanding to be successful in the computing industry. ", "Summary I am a determined person with a tenacious, yet enthusiastic approach with everything I put my attention to. I graduated in Law however I have spent the last two years of my professional career in technology covering consumer, client and embedded markets. I have built and maintained good customer relationships and have successfully balanced the demands of my customer whilst supporting the needs of my organisation. My most recent position has provided me with a more technical skill set whilst developing my ability to deal with ambiguity as well as managing the needs and requests of multiple stakeholders. \n \nOutside of work I am a passionate about technology, specifically gaming and technological innovation, and ultimately my perfect career would incorporate these interests. Summary I am a determined person with a tenacious, yet enthusiastic approach with everything I put my attention to. I graduated in Law however I have spent the last two years of my professional career in technology covering consumer, client and embedded markets. I have built and maintained good customer relationships and have successfully balanced the demands of my customer whilst supporting the needs of my organisation. My most recent position has provided me with a more technical skill set whilst developing my ability to deal with ambiguity as well as managing the needs and requests of multiple stakeholders. \n \nOutside of work I am a passionate about technology, specifically gaming and technological innovation, and ultimately my perfect career would incorporate these interests. I am a determined person with a tenacious, yet enthusiastic approach with everything I put my attention to. I graduated in Law however I have spent the last two years of my professional career in technology covering consumer, client and embedded markets. I have built and maintained good customer relationships and have successfully balanced the demands of my customer whilst supporting the needs of my organisation. My most recent position has provided me with a more technical skill set whilst developing my ability to deal with ambiguity as well as managing the needs and requests of multiple stakeholders. \n \nOutside of work I am a passionate about technology, specifically gaming and technological innovation, and ultimately my perfect career would incorporate these interests. I am a determined person with a tenacious, yet enthusiastic approach with everything I put my attention to. I graduated in Law however I have spent the last two years of my professional career in technology covering consumer, client and embedded markets. I have built and maintained good customer relationships and have successfully balanced the demands of my customer whilst supporting the needs of my organisation. My most recent position has provided me with a more technical skill set whilst developing my ability to deal with ambiguity as well as managing the needs and requests of multiple stakeholders. \n \nOutside of work I am a passionate about technology, specifically gaming and technological innovation, and ultimately my perfect career would incorporate these interests. Experience Embedded Pricing Manager Intel Corporation June 2014  – Present (1 year 3 months) Customer Business Analyst Intel Corporation January 2013  –  June 2014  (1 year 6 months) Event Steward Absolute Event Solutions 2011  –  2011  (less than a year) Recruitment Consultant Tinies Childcare February 2007  –  September 2010  (3 years 8 months) Interviewed and processed candidates.  \nBuilt and managed relationships with multiple clients. \nManaged the weekly placement schedule sourcing candidates for requested roles as well as contacting clients in order to get more placement opportunities. \nInvoicing and some accounting responsibilities.  \nBasic to intermediate use of Sage Instant Accounts.  \nExtensive use of Microsoft Office Software.  \nSourced solutions for improving company presence through the use of various marketing solutions. Embedded Pricing Manager Intel Corporation June 2014  – Present (1 year 3 months) Embedded Pricing Manager Intel Corporation June 2014  – Present (1 year 3 months) Customer Business Analyst Intel Corporation January 2013  –  June 2014  (1 year 6 months) Customer Business Analyst Intel Corporation January 2013  –  June 2014  (1 year 6 months) Event Steward Absolute Event Solutions 2011  –  2011  (less than a year) Event Steward Absolute Event Solutions 2011  –  2011  (less than a year) Recruitment Consultant Tinies Childcare February 2007  –  September 2010  (3 years 8 months) Interviewed and processed candidates.  \nBuilt and managed relationships with multiple clients. \nManaged the weekly placement schedule sourcing candidates for requested roles as well as contacting clients in order to get more placement opportunities. \nInvoicing and some accounting responsibilities.  \nBasic to intermediate use of Sage Instant Accounts.  \nExtensive use of Microsoft Office Software.  \nSourced solutions for improving company presence through the use of various marketing solutions. Recruitment Consultant Tinies Childcare February 2007  –  September 2010  (3 years 8 months) Interviewed and processed candidates.  \nBuilt and managed relationships with multiple clients. \nManaged the weekly placement schedule sourcing candidates for requested roles as well as contacting clients in order to get more placement opportunities. \nInvoicing and some accounting responsibilities.  \nBasic to intermediate use of Sage Instant Accounts.  \nExtensive use of Microsoft Office Software.  \nSourced solutions for improving company presence through the use of various marketing solutions. Skills Microsoft Office Employment Law Computer Literate Sage Internet Interviewing Account Reconciliation Marketing Time Management Skills  Microsoft Office Employment Law Computer Literate Sage Internet Interviewing Account Reconciliation Marketing Time Management Microsoft Office Employment Law Computer Literate Sage Internet Interviewing Account Reconciliation Marketing Time Management Microsoft Office Employment Law Computer Literate Sage Internet Interviewing Account Reconciliation Marketing Time Management Education University of Gloucestershire LLB,  Law , 2:1 2009  – 2012 Activities and Societies:  Law Society Hanley Castle High School 2001  – 2006 University of Gloucestershire LLB,  Law , 2:1 2009  – 2012 Activities and Societies:  Law Society University of Gloucestershire LLB,  Law , 2:1 2009  – 2012 Activities and Societies:  Law Society University of Gloucestershire LLB,  Law , 2:1 2009  – 2012 Activities and Societies:  Law Society Hanley Castle High School 2001  – 2006 Hanley Castle High School 2001  – 2006 Hanley Castle High School 2001  – 2006 Honors & Awards Additional Honors & Awards RYA Competent Crew Course, 2011 \nHND in Law, 2007 - 2009 \nGrade 5 Piano \nGrade 4 Clarinet Additional Honors & Awards RYA Competent Crew Course, 2011 \nHND in Law, 2007 - 2009 \nGrade 5 Piano \nGrade 4 Clarinet Additional Honors & Awards RYA Competent Crew Course, 2011 \nHND in Law, 2007 - 2009 \nGrade 5 Piano \nGrade 4 Clarinet Additional Honors & Awards RYA Competent Crew Course, 2011 \nHND in Law, 2007 - 2009 \nGrade 5 Piano \nGrade 4 Clarinet ", "Experience MMBP Atom Tablet Deals Pricing Manager Intel Corporation April 2014  – Present (1 year 5 months) Folsom, California • Responsible for pricing of Intel Atom CPUs being sold into worldwide channel tablets & smartphones, represents about half of Intel mobility biz \n• Drove strategic alignments with local OEMs around the globe, closed deals ranging from a few thousand tablets to >1Mu and initiated promotions to get new processors adopted by market \n• Optimized financial investments in high ROI opportunities \n \nhttp://www.vrworld.com/2015/01/16/46-million-intel-beats-goal-tablet-shipments/  \nhttp://seekingalpha.com/article/2943666-intel-successful-local-vendors-are-good-alternative-to-samsung \nhttp://www.mobileworldlive.com/micromax-intel-ink-indian-tablet-partnership \nhttp://www.pcworld.com/article/2138780/intel-taps-chinese-tech-hub-to-fuel-its-mobile-processor-business.html NSG Data Center SSD Demand Lead Intel Corporation April 2013  –  March 2014  (1 year) Folsom, California NSG Data Center SSD Pricing Manager Intel Corporation May 2011  –  April 2013  (2 years) Folsom, California NSG Pricing Analyst Intel Corporation May 2010  –  April 2011  (1 year) Folsom, California MMBP Atom Tablet Deals Pricing Manager Intel Corporation April 2014  – Present (1 year 5 months) Folsom, California • Responsible for pricing of Intel Atom CPUs being sold into worldwide channel tablets & smartphones, represents about half of Intel mobility biz \n• Drove strategic alignments with local OEMs around the globe, closed deals ranging from a few thousand tablets to >1Mu and initiated promotions to get new processors adopted by market \n• Optimized financial investments in high ROI opportunities \n \nhttp://www.vrworld.com/2015/01/16/46-million-intel-beats-goal-tablet-shipments/  \nhttp://seekingalpha.com/article/2943666-intel-successful-local-vendors-are-good-alternative-to-samsung \nhttp://www.mobileworldlive.com/micromax-intel-ink-indian-tablet-partnership \nhttp://www.pcworld.com/article/2138780/intel-taps-chinese-tech-hub-to-fuel-its-mobile-processor-business.html MMBP Atom Tablet Deals Pricing Manager Intel Corporation April 2014  – Present (1 year 5 months) Folsom, California • Responsible for pricing of Intel Atom CPUs being sold into worldwide channel tablets & smartphones, represents about half of Intel mobility biz \n• Drove strategic alignments with local OEMs around the globe, closed deals ranging from a few thousand tablets to >1Mu and initiated promotions to get new processors adopted by market \n• Optimized financial investments in high ROI opportunities \n \nhttp://www.vrworld.com/2015/01/16/46-million-intel-beats-goal-tablet-shipments/  \nhttp://seekingalpha.com/article/2943666-intel-successful-local-vendors-are-good-alternative-to-samsung \nhttp://www.mobileworldlive.com/micromax-intel-ink-indian-tablet-partnership \nhttp://www.pcworld.com/article/2138780/intel-taps-chinese-tech-hub-to-fuel-its-mobile-processor-business.html NSG Data Center SSD Demand Lead Intel Corporation April 2013  –  March 2014  (1 year) Folsom, California NSG Data Center SSD Demand Lead Intel Corporation April 2013  –  March 2014  (1 year) Folsom, California NSG Data Center SSD Pricing Manager Intel Corporation May 2011  –  April 2013  (2 years) Folsom, California NSG Data Center SSD Pricing Manager Intel Corporation May 2011  –  April 2013  (2 years) Folsom, California NSG Pricing Analyst Intel Corporation May 2010  –  April 2011  (1 year) Folsom, California NSG Pricing Analyst Intel Corporation May 2010  –  April 2011  (1 year) Folsom, California Skills Skills     ", "Skills Program Management MRP Forecasting Contract Negotiation Procurement Sourcing Supply Management Customer Service Inventory Management Cross-functional Team... SAP Supply Chain Strategy Management Purchasing Continuous Improvement Supply Chain Management Manufacturing Materials Management Marketing Global Sourcing Lean Manufacturing Strategic Sourcing Product Development Process Improvement See 10+     See less Skills  Program Management MRP Forecasting Contract Negotiation Procurement Sourcing Supply Management Customer Service Inventory Management Cross-functional Team... SAP Supply Chain Strategy Management Purchasing Continuous Improvement Supply Chain Management Manufacturing Materials Management Marketing Global Sourcing Lean Manufacturing Strategic Sourcing Product Development Process Improvement See 10+     See less Program Management MRP Forecasting Contract Negotiation Procurement Sourcing Supply Management Customer Service Inventory Management Cross-functional Team... SAP Supply Chain Strategy Management Purchasing Continuous Improvement Supply Chain Management Manufacturing Materials Management Marketing Global Sourcing Lean Manufacturing Strategic Sourcing Product Development Process Improvement See 10+     See less Program Management MRP Forecasting Contract Negotiation Procurement Sourcing Supply Management Customer Service Inventory Management Cross-functional Team... SAP Supply Chain Strategy Management Purchasing Continuous Improvement Supply Chain Management Manufacturing Materials Management Marketing Global Sourcing Lean Manufacturing Strategic Sourcing Product Development Process Improvement See 10+     See less ", "Summary Intel EMEA Pricing Manager for Automotive and other Internet of Things customers. Over 6 years experience within Business Operations functions, mainly working with products and customers in the Internet of Things segment. Summary Intel EMEA Pricing Manager for Automotive and other Internet of Things customers. Over 6 years experience within Business Operations functions, mainly working with products and customers in the Internet of Things segment. Intel EMEA Pricing Manager for Automotive and other Internet of Things customers. Over 6 years experience within Business Operations functions, mainly working with products and customers in the Internet of Things segment. Intel EMEA Pricing Manager for Automotive and other Internet of Things customers. Over 6 years experience within Business Operations functions, mainly working with products and customers in the Internet of Things segment. Experience EMEA Pricing Manager Intel Corporation July 2013  – Present (2 years 2 months) Swindon, United Kingdom EMEA Pricing Manager for Automotive and other Internet of Things customers. Responsibilities include establishing geography specific pricing strategies for different industry segments whilst interacting with HQ product division functions and negotiating annual pricing contracts with customers. EMEA Geographic Business Manager Intel November 2010  –  June 2013  (2 years 8 months) EMEA Geographic Business Manager for Embedded Intel Architecture parts. Responsibilities included demand and revenue forecasting for EMEA Embedded IA business, managing supply allocations for the geography and coaching several interns. Customer Business Analyst Intel Corporation August 2009  –  November 2010  (1 year 4 months) Customer Business Analyst for EMEA channel distributors. Responsibilities included being the main Intel point of contact for the distributor from a supply chain perspective and forecasting revenue and demand for the distributor. Final Year Student Aston University August 2008  –  October 2009  (1 year 3 months) Student on BSc Management & Strategy Customer Business Analyst Intel Corporation July 2007  –  August 2008  (1 year 2 months) Customer Business Analyst for EMEA channel distributors. Responsibilities included being the main Intel point of contact for the distributor from a supply chain perspective and forecasting revenue and demand for the distributor. EMEA Pricing Manager Intel Corporation July 2013  – Present (2 years 2 months) Swindon, United Kingdom EMEA Pricing Manager for Automotive and other Internet of Things customers. Responsibilities include establishing geography specific pricing strategies for different industry segments whilst interacting with HQ product division functions and negotiating annual pricing contracts with customers. EMEA Pricing Manager Intel Corporation July 2013  – Present (2 years 2 months) Swindon, United Kingdom EMEA Pricing Manager for Automotive and other Internet of Things customers. Responsibilities include establishing geography specific pricing strategies for different industry segments whilst interacting with HQ product division functions and negotiating annual pricing contracts with customers. EMEA Geographic Business Manager Intel November 2010  –  June 2013  (2 years 8 months) EMEA Geographic Business Manager for Embedded Intel Architecture parts. Responsibilities included demand and revenue forecasting for EMEA Embedded IA business, managing supply allocations for the geography and coaching several interns. EMEA Geographic Business Manager Intel November 2010  –  June 2013  (2 years 8 months) EMEA Geographic Business Manager for Embedded Intel Architecture parts. Responsibilities included demand and revenue forecasting for EMEA Embedded IA business, managing supply allocations for the geography and coaching several interns. Customer Business Analyst Intel Corporation August 2009  –  November 2010  (1 year 4 months) Customer Business Analyst for EMEA channel distributors. Responsibilities included being the main Intel point of contact for the distributor from a supply chain perspective and forecasting revenue and demand for the distributor. Customer Business Analyst Intel Corporation August 2009  –  November 2010  (1 year 4 months) Customer Business Analyst for EMEA channel distributors. Responsibilities included being the main Intel point of contact for the distributor from a supply chain perspective and forecasting revenue and demand for the distributor. Final Year Student Aston University August 2008  –  October 2009  (1 year 3 months) Student on BSc Management & Strategy Final Year Student Aston University August 2008  –  October 2009  (1 year 3 months) Student on BSc Management & Strategy Customer Business Analyst Intel Corporation July 2007  –  August 2008  (1 year 2 months) Customer Business Analyst for EMEA channel distributors. Responsibilities included being the main Intel point of contact for the distributor from a supply chain perspective and forecasting revenue and demand for the distributor. Customer Business Analyst Intel Corporation July 2007  –  August 2008  (1 year 2 months) Customer Business Analyst for EMEA channel distributors. Responsibilities included being the main Intel point of contact for the distributor from a supply chain perspective and forecasting revenue and demand for the distributor. Skills Intel Semiconductors Product Marketing Supply Chain Management Data Analysis Forecasting Analysis Business Analysis Teamwork Competitive Analysis Customer Oriented Microsoft Excel Revenue Forecasting Strategy Embedded Systems Semiconductor Industry Business Strategy Pricing Market Analysis Business Development Management Cross-functional Team... Account Management SAP Market Research See 10+     See less Skills  Intel Semiconductors Product Marketing Supply Chain Management Data Analysis Forecasting Analysis Business Analysis Teamwork Competitive Analysis Customer Oriented Microsoft Excel Revenue Forecasting Strategy Embedded Systems Semiconductor Industry Business Strategy Pricing Market Analysis Business Development Management Cross-functional Team... Account Management SAP Market Research See 10+     See less Intel Semiconductors Product Marketing Supply Chain Management Data Analysis Forecasting Analysis Business Analysis Teamwork Competitive Analysis Customer Oriented Microsoft Excel Revenue Forecasting Strategy Embedded Systems Semiconductor Industry Business Strategy Pricing Market Analysis Business Development Management Cross-functional Team... Account Management SAP Market Research See 10+     See less Intel Semiconductors Product Marketing Supply Chain Management Data Analysis Forecasting Analysis Business Analysis Teamwork Competitive Analysis Customer Oriented Microsoft Excel Revenue Forecasting Strategy Embedded Systems Semiconductor Industry Business Strategy Pricing Market Analysis Business Development Management Cross-functional Team... Account Management SAP Market Research See 10+     See less Education Aston University Bachelor's Degree,  Management & Strategy , 2:1 2005  – 2009 Alcester Grammar School 2003  – 2005 A Level Studies Aston University Bachelor's Degree,  Management & Strategy , 2:1 2005  – 2009 Aston University Bachelor's Degree,  Management & Strategy , 2:1 2005  – 2009 Aston University Bachelor's Degree,  Management & Strategy , 2:1 2005  – 2009 Alcester Grammar School 2003  – 2005 A Level Studies Alcester Grammar School 2003  – 2005 A Level Studies Alcester Grammar School 2003  – 2005 A Level Studies ", "Experience Manager, Revenue Management Svenska Cellulosa Aktiebolaget September 2012  –  October 2013  (1 year 2 months) Product Marketing Manager Intel Corporation December 2010  –  May 2012  (1 year 6 months) Sr. Strategic Pricing Manager Intel Corporation October 2007  –  December 2010  (3 years 3 months) Pricing Manager Intel Corporation September 2005  –  October 2007  (2 years 2 months) Design Engineer Intel Corporation July 2001  –  September 2005  (4 years 3 months) Rotational Leadership Program Intel Corporation February 2000  –  July 2001  (1 year 6 months) Manager, Revenue Management Svenska Cellulosa Aktiebolaget September 2012  –  October 2013  (1 year 2 months) Manager, Revenue Management Svenska Cellulosa Aktiebolaget September 2012  –  October 2013  (1 year 2 months) Product Marketing Manager Intel Corporation December 2010  –  May 2012  (1 year 6 months) Product Marketing Manager Intel Corporation December 2010  –  May 2012  (1 year 6 months) Sr. Strategic Pricing Manager Intel Corporation October 2007  –  December 2010  (3 years 3 months) Sr. Strategic Pricing Manager Intel Corporation October 2007  –  December 2010  (3 years 3 months) Pricing Manager Intel Corporation September 2005  –  October 2007  (2 years 2 months) Pricing Manager Intel Corporation September 2005  –  October 2007  (2 years 2 months) Design Engineer Intel Corporation July 2001  –  September 2005  (4 years 3 months) Design Engineer Intel Corporation July 2001  –  September 2005  (4 years 3 months) Rotational Leadership Program Intel Corporation February 2000  –  July 2001  (1 year 6 months) Rotational Leadership Program Intel Corporation February 2000  –  July 2001  (1 year 6 months) Skills Skills     ", "Experience Transfer Pricing Manager Intel Corporation May 2011  – Present (4 years 4 months) Develop and implement transfer pricing strategies for Intel. Establish transfer pricing models and processes for M&A and new business lines to minimize risk profile and achieve favorable results in US and foreign audits.  \n \nManage service providers for outsourced projects and internal teams for work done in-house. Work closely with tax counsel group on IP planning, restructuring and M&A integration. Also run the transfer pricing function for McAfee Inc, a stand-alone subsidiary that was acquired in 2011 for $7.7 billion. Manager - Transfer Pricing Ernst & Young October 2006  –  May 2011  (4 years 8 months) International tax consulting - assisted multinational clients in setting and documenting intercompany pricing of goods and services. Specialized in IP valuation, cost sharing transactions and services transfer pricing. Majority of clients were in the software industry, but also gained experience in semiconductor, pharma, retail, automotive, and others. Completed a short-term rotation in Milan, Italy to assist EY's Italian team during the implementation of the new Italian TP regulations. Sr. Credit Analyst Zions Bank October 2005  –  September 2006  (1 year) Real estate securitization. Secondary market lending for commercial real estate loans. Manager / Sales Rep Firstline Security and Apex Alarm 2002  –  2005  (3 years) Sold security systems door-to-door for 4 summers during college. During the last summer, I co-managed a team of 20+ summer sales reps. It was a great experience and a lot of fun. Transfer Pricing Manager Intel Corporation May 2011  – Present (4 years 4 months) Develop and implement transfer pricing strategies for Intel. Establish transfer pricing models and processes for M&A and new business lines to minimize risk profile and achieve favorable results in US and foreign audits.  \n \nManage service providers for outsourced projects and internal teams for work done in-house. Work closely with tax counsel group on IP planning, restructuring and M&A integration. Also run the transfer pricing function for McAfee Inc, a stand-alone subsidiary that was acquired in 2011 for $7.7 billion. Transfer Pricing Manager Intel Corporation May 2011  – Present (4 years 4 months) Develop and implement transfer pricing strategies for Intel. Establish transfer pricing models and processes for M&A and new business lines to minimize risk profile and achieve favorable results in US and foreign audits.  \n \nManage service providers for outsourced projects and internal teams for work done in-house. Work closely with tax counsel group on IP planning, restructuring and M&A integration. Also run the transfer pricing function for McAfee Inc, a stand-alone subsidiary that was acquired in 2011 for $7.7 billion. Manager - Transfer Pricing Ernst & Young October 2006  –  May 2011  (4 years 8 months) International tax consulting - assisted multinational clients in setting and documenting intercompany pricing of goods and services. Specialized in IP valuation, cost sharing transactions and services transfer pricing. Majority of clients were in the software industry, but also gained experience in semiconductor, pharma, retail, automotive, and others. Completed a short-term rotation in Milan, Italy to assist EY's Italian team during the implementation of the new Italian TP regulations. Manager - Transfer Pricing Ernst & Young October 2006  –  May 2011  (4 years 8 months) International tax consulting - assisted multinational clients in setting and documenting intercompany pricing of goods and services. Specialized in IP valuation, cost sharing transactions and services transfer pricing. Majority of clients were in the software industry, but also gained experience in semiconductor, pharma, retail, automotive, and others. Completed a short-term rotation in Milan, Italy to assist EY's Italian team during the implementation of the new Italian TP regulations. Sr. Credit Analyst Zions Bank October 2005  –  September 2006  (1 year) Real estate securitization. Secondary market lending for commercial real estate loans. Sr. Credit Analyst Zions Bank October 2005  –  September 2006  (1 year) Real estate securitization. Secondary market lending for commercial real estate loans. Manager / Sales Rep Firstline Security and Apex Alarm 2002  –  2005  (3 years) Sold security systems door-to-door for 4 summers during college. During the last summer, I co-managed a team of 20+ summer sales reps. It was a great experience and a lot of fun. Manager / Sales Rep Firstline Security and Apex Alarm 2002  –  2005  (3 years) Sold security systems door-to-door for 4 summers during college. During the last summer, I co-managed a team of 20+ summer sales reps. It was a great experience and a lot of fun. Languages English Native or bilingual proficiency Portuguese Professional working proficiency Spanish Limited working proficiency Italian Elementary proficiency English Native or bilingual proficiency Portuguese Professional working proficiency Spanish Limited working proficiency Italian Elementary proficiency English Native or bilingual proficiency Portuguese Professional working proficiency Spanish Limited working proficiency Italian Elementary proficiency Native or bilingual proficiency Professional working proficiency Limited working proficiency Elementary proficiency Skills Mergers Transfer Pricing Intellectual Property... Tax Business Valuation International Tax Mergers & Acquisitions Valuation Management Financial Modeling Financial Analysis Economics Corporate Finance Analysis Restructuring Corporate Tax Auditing Accounting Financial Reporting Due Diligence Finance Strategic Financial... Internal Controls Sarbanes-Oxley Act See 9+     See less Skills  Mergers Transfer Pricing Intellectual Property... Tax Business Valuation International Tax Mergers & Acquisitions Valuation Management Financial Modeling Financial Analysis Economics Corporate Finance Analysis Restructuring Corporate Tax Auditing Accounting Financial Reporting Due Diligence Finance Strategic Financial... Internal Controls Sarbanes-Oxley Act See 9+     See less Mergers Transfer Pricing Intellectual Property... Tax Business Valuation International Tax Mergers & Acquisitions Valuation Management Financial Modeling Financial Analysis Economics Corporate Finance Analysis Restructuring Corporate Tax Auditing Accounting Financial Reporting Due Diligence Finance Strategic Financial... Internal Controls Sarbanes-Oxley Act See 9+     See less Mergers Transfer Pricing Intellectual Property... Tax Business Valuation International Tax Mergers & Acquisitions Valuation Management Financial Modeling Financial Analysis Economics Corporate Finance Analysis Restructuring Corporate Tax Auditing Accounting Financial Reporting Due Diligence Finance Strategic Financial... Internal Controls Sarbanes-Oxley Act See 9+     See less Education Southern Utah University MBA,  Economics 1999  – 2005 Southern Utah University MBA,  Economics 1999  – 2005 Southern Utah University MBA,  Economics 1999  – 2005 Southern Utah University MBA,  Economics 1999  – 2005 ", "Experience Pricing Manager Intel Corporation September 2013  – Present (2 years) Hillsboro, OR Strategize pricing for current and future PCSD server products. Evaluate potential pricing for all deals and opportunities for PCSD worldwide. Work with supply chain ops to price excess inventory accordingly. Work with business development managers to set promotions for customer accounts worldwide. Demand Planning Analyst Intel Corporation June 2013  –  September 2013  (4 months) Hillsboro, OR Forecasted demand for EPSD server products. Worked with business development managers, supply chain ops team, and salesmen world wide to understand potential demand signals for EPSD products. Data Center Market Segment Manager Intel Corporation August 2011  –  May 2013  (1 year 10 months) Data Center Market Segment Manager DCSG-ESWS, DCSG-MC, DSD-ESPS August 2011  –  May 2013  (1 year 10 months) Worked in the Enterprise SW Strategies group in the Data Center Software Division \n \nMarket Research \nSummarized reports/webinars from Gartner/IDC/TBR that cover datacenter trends (e.g. Servers, BI, Cloud, etc.) \nPosted summaries on group PlanetBlue site  \n \nBlogged on latest datacenter trends in the Banking industry (Better Bank Systems) \n \nFacilitated inquiry calls with lead analysts from Gartner and IDC for the MC/ESPS/SSG segments \n \nAttended conferences held by IDC and Gartner and summarized key learnings to group \n \nCreated/shared projections of IDC/Gartner market data that aligned with requested verticals and metrics \n \nPresented findings on market data that enabled key stakeholders to evaluate certain market opportunities \n \nProject Management \nManaged proof point projects that covered priority benchmarks for 2012  \n \nCoordinated meetings with key stakeholders for status updates on current projects being pursued \n \nDesigned trackers for projects and capital used (i.e. servers, SSDs, memory) \n \nGauged feedback from key stakeholders on old tracker and designed new one accordingly \n \nPlanned and executed ESPS/MC Proof Point Review \nCoordinated with SSG, ESPS, and MC to develop proof points to target for end of year 2012 and 2013 \nHelped refine the process of the Review for the future \n \nMigrated group SharePoint site from 2007 version to 2010 \nCreated new SharePoint site for new group and allocated content appropriately \n \nMarket Research  \nManaged a custom research project to determine x86 market share with respect to software vendors with TBR \n \nManaged/distributed collateral content for RISC to IA promotion efforts across various teams \n \nManaging the SAS Analytics Big Data project, coordinating a cross organizational team from EPSD, SMG, NSG, SSG, and DSD to deliver a high Intel content solution that includes Intel Hadoop and DCM from DSD and a wide range of Intel hardware from EPSD and NSG Digital Marketing Specialist AmazingMail May 2010  –  February 2011  (10 months) Social Media Marketing - AmazingMail; Postcard Marketing - Created and managed campaigns within marketing team via Twitter/Facebook \nResult: Increased total social media fanbase by at least 30% \nWeb Analytics – Management of online marketing efforts through site traffic evaluation  \nResult: Increased site traffic by at least 30%  \nSearch Engine Optimization - Researched local/globally monthly searches, competition, and cost for various keywords \nResult: Selected keywords that increased the site traffic, generated high value leads to sales teams Pricing Manager Intel Corporation September 2013  – Present (2 years) Hillsboro, OR Strategize pricing for current and future PCSD server products. Evaluate potential pricing for all deals and opportunities for PCSD worldwide. Work with supply chain ops to price excess inventory accordingly. Work with business development managers to set promotions for customer accounts worldwide. Pricing Manager Intel Corporation September 2013  – Present (2 years) Hillsboro, OR Strategize pricing for current and future PCSD server products. Evaluate potential pricing for all deals and opportunities for PCSD worldwide. Work with supply chain ops to price excess inventory accordingly. Work with business development managers to set promotions for customer accounts worldwide. Demand Planning Analyst Intel Corporation June 2013  –  September 2013  (4 months) Hillsboro, OR Forecasted demand for EPSD server products. Worked with business development managers, supply chain ops team, and salesmen world wide to understand potential demand signals for EPSD products. Demand Planning Analyst Intel Corporation June 2013  –  September 2013  (4 months) Hillsboro, OR Forecasted demand for EPSD server products. Worked with business development managers, supply chain ops team, and salesmen world wide to understand potential demand signals for EPSD products. Data Center Market Segment Manager Intel Corporation August 2011  –  May 2013  (1 year 10 months) Data Center Market Segment Manager Intel Corporation August 2011  –  May 2013  (1 year 10 months) Data Center Market Segment Manager DCSG-ESWS, DCSG-MC, DSD-ESPS August 2011  –  May 2013  (1 year 10 months) Worked in the Enterprise SW Strategies group in the Data Center Software Division \n \nMarket Research \nSummarized reports/webinars from Gartner/IDC/TBR that cover datacenter trends (e.g. Servers, BI, Cloud, etc.) \nPosted summaries on group PlanetBlue site  \n \nBlogged on latest datacenter trends in the Banking industry (Better Bank Systems) \n \nFacilitated inquiry calls with lead analysts from Gartner and IDC for the MC/ESPS/SSG segments \n \nAttended conferences held by IDC and Gartner and summarized key learnings to group \n \nCreated/shared projections of IDC/Gartner market data that aligned with requested verticals and metrics \n \nPresented findings on market data that enabled key stakeholders to evaluate certain market opportunities \n \nProject Management \nManaged proof point projects that covered priority benchmarks for 2012  \n \nCoordinated meetings with key stakeholders for status updates on current projects being pursued \n \nDesigned trackers for projects and capital used (i.e. servers, SSDs, memory) \n \nGauged feedback from key stakeholders on old tracker and designed new one accordingly \n \nPlanned and executed ESPS/MC Proof Point Review \nCoordinated with SSG, ESPS, and MC to develop proof points to target for end of year 2012 and 2013 \nHelped refine the process of the Review for the future \n \nMigrated group SharePoint site from 2007 version to 2010 \nCreated new SharePoint site for new group and allocated content appropriately \n \nMarket Research  \nManaged a custom research project to determine x86 market share with respect to software vendors with TBR \n \nManaged/distributed collateral content for RISC to IA promotion efforts across various teams \n \nManaging the SAS Analytics Big Data project, coordinating a cross organizational team from EPSD, SMG, NSG, SSG, and DSD to deliver a high Intel content solution that includes Intel Hadoop and DCM from DSD and a wide range of Intel hardware from EPSD and NSG Data Center Market Segment Manager DCSG-ESWS, DCSG-MC, DSD-ESPS August 2011  –  May 2013  (1 year 10 months) Worked in the Enterprise SW Strategies group in the Data Center Software Division \n \nMarket Research \nSummarized reports/webinars from Gartner/IDC/TBR that cover datacenter trends (e.g. Servers, BI, Cloud, etc.) \nPosted summaries on group PlanetBlue site  \n \nBlogged on latest datacenter trends in the Banking industry (Better Bank Systems) \n \nFacilitated inquiry calls with lead analysts from Gartner and IDC for the MC/ESPS/SSG segments \n \nAttended conferences held by IDC and Gartner and summarized key learnings to group \n \nCreated/shared projections of IDC/Gartner market data that aligned with requested verticals and metrics \n \nPresented findings on market data that enabled key stakeholders to evaluate certain market opportunities \n \nProject Management \nManaged proof point projects that covered priority benchmarks for 2012  \n \nCoordinated meetings with key stakeholders for status updates on current projects being pursued \n \nDesigned trackers for projects and capital used (i.e. servers, SSDs, memory) \n \nGauged feedback from key stakeholders on old tracker and designed new one accordingly \n \nPlanned and executed ESPS/MC Proof Point Review \nCoordinated with SSG, ESPS, and MC to develop proof points to target for end of year 2012 and 2013 \nHelped refine the process of the Review for the future \n \nMigrated group SharePoint site from 2007 version to 2010 \nCreated new SharePoint site for new group and allocated content appropriately \n \nMarket Research  \nManaged a custom research project to determine x86 market share with respect to software vendors with TBR \n \nManaged/distributed collateral content for RISC to IA promotion efforts across various teams \n \nManaging the SAS Analytics Big Data project, coordinating a cross organizational team from EPSD, SMG, NSG, SSG, and DSD to deliver a high Intel content solution that includes Intel Hadoop and DCM from DSD and a wide range of Intel hardware from EPSD and NSG Digital Marketing Specialist AmazingMail May 2010  –  February 2011  (10 months) Social Media Marketing - AmazingMail; Postcard Marketing - Created and managed campaigns within marketing team via Twitter/Facebook \nResult: Increased total social media fanbase by at least 30% \nWeb Analytics – Management of online marketing efforts through site traffic evaluation  \nResult: Increased site traffic by at least 30%  \nSearch Engine Optimization - Researched local/globally monthly searches, competition, and cost for various keywords \nResult: Selected keywords that increased the site traffic, generated high value leads to sales teams Digital Marketing Specialist AmazingMail May 2010  –  February 2011  (10 months) Social Media Marketing - AmazingMail; Postcard Marketing - Created and managed campaigns within marketing team via Twitter/Facebook \nResult: Increased total social media fanbase by at least 30% \nWeb Analytics – Management of online marketing efforts through site traffic evaluation  \nResult: Increased site traffic by at least 30%  \nSearch Engine Optimization - Researched local/globally monthly searches, competition, and cost for various keywords \nResult: Selected keywords that increased the site traffic, generated high value leads to sales teams Skills SEO Digital Marketing Online Marketing Product Marketing Web Analytics Analytics Business Development Marketing Strategy Project Management Skills  SEO Digital Marketing Online Marketing Product Marketing Web Analytics Analytics Business Development Marketing Strategy Project Management SEO Digital Marketing Online Marketing Product Marketing Web Analytics Analytics Business Development Marketing Strategy Project Management SEO Digital Marketing Online Marketing Product Marketing Web Analytics Analytics Business Development Marketing Strategy Project Management Education W.P. Carey School of Business, Arizona State University BS,  Marketing 2011  – 2013 W.P. Carey School of Business, Arizona State University MBA,  Marketing 2011  – 2013 Arizona State University, W. P. Carey School of Business Master of Business Administration (MBA),  Marketing 2006  – 2008 W.P. Carey School of Business, Arizona State University BS,  Marketing 2011  – 2013 W.P. Carey School of Business, Arizona State University BS,  Marketing 2011  – 2013 W.P. Carey School of Business, Arizona State University BS,  Marketing 2011  – 2013 W.P. Carey School of Business, Arizona State University MBA,  Marketing 2011  – 2013 W.P. Carey School of Business, Arizona State University MBA,  Marketing 2011  – 2013 W.P. Carey School of Business, Arizona State University MBA,  Marketing 2011  – 2013 Arizona State University, W. P. Carey School of Business Master of Business Administration (MBA),  Marketing 2006  – 2008 Arizona State University, W. P. Carey School of Business Master of Business Administration (MBA),  Marketing 2006  – 2008 Arizona State University, W. P. Carey School of Business Master of Business Administration (MBA),  Marketing 2006  – 2008 ", "Experience Pricing Manager Intel Corporation May 2015  – Present (4 months) Santa Clara Currently manage pricing strategy and deal decisions for client CPU, chipset, and wireless business in Europe, Middle East, Africa, and Latin America regions. Product Manager Intel Corporation June 2012  –  July 2015  (3 years 2 months) Santa Clara From 2014-2015, I managed Desktop CPU product lines representing $13 billion annually. I also previously managed the supply of Server and Mobile CPU product lines. Professional Teller Bank of America December 2010  –  June 2012  (1 year 7 months) San Jose, CA - Handle wide range of consumer & merchant transactions with efficiency, accuracy & attention to detail \n- Market and promote financial products to personal and business banking customers (consistently ranked top in district in referrals) Shift Manager (Assistant General Manager) Jamba Juice June 2006  –  November 2010  (4 years 6 months) San Jose, CA - Increase store sales performance (#1 ranking in district for comparative sales)  \n- Hire, train, motivate & coach employees/managers (#1 ranking in district for cross-selling) Pricing Manager Intel Corporation May 2015  – Present (4 months) Santa Clara Currently manage pricing strategy and deal decisions for client CPU, chipset, and wireless business in Europe, Middle East, Africa, and Latin America regions. Pricing Manager Intel Corporation May 2015  – Present (4 months) Santa Clara Currently manage pricing strategy and deal decisions for client CPU, chipset, and wireless business in Europe, Middle East, Africa, and Latin America regions. Product Manager Intel Corporation June 2012  –  July 2015  (3 years 2 months) Santa Clara From 2014-2015, I managed Desktop CPU product lines representing $13 billion annually. I also previously managed the supply of Server and Mobile CPU product lines. Product Manager Intel Corporation June 2012  –  July 2015  (3 years 2 months) Santa Clara From 2014-2015, I managed Desktop CPU product lines representing $13 billion annually. I also previously managed the supply of Server and Mobile CPU product lines. Professional Teller Bank of America December 2010  –  June 2012  (1 year 7 months) San Jose, CA - Handle wide range of consumer & merchant transactions with efficiency, accuracy & attention to detail \n- Market and promote financial products to personal and business banking customers (consistently ranked top in district in referrals) Professional Teller Bank of America December 2010  –  June 2012  (1 year 7 months) San Jose, CA - Handle wide range of consumer & merchant transactions with efficiency, accuracy & attention to detail \n- Market and promote financial products to personal and business banking customers (consistently ranked top in district in referrals) Shift Manager (Assistant General Manager) Jamba Juice June 2006  –  November 2010  (4 years 6 months) San Jose, CA - Increase store sales performance (#1 ranking in district for comparative sales)  \n- Hire, train, motivate & coach employees/managers (#1 ranking in district for cross-selling) Shift Manager (Assistant General Manager) Jamba Juice June 2006  –  November 2010  (4 years 6 months) San Jose, CA - Increase store sales performance (#1 ranking in district for comparative sales)  \n- Hire, train, motivate & coach employees/managers (#1 ranking in district for cross-selling) Languages   Skills Product Management Supply Chain Management Economic Modeling Econometrics Microsoft Office Training Leadership Quantitative Research Demand Forecasting Sales Operations Regression Analysis Statistical Software Inventory Management Sales Production Planning Semiconductors Pricing See 2+     See less Skills  Product Management Supply Chain Management Economic Modeling Econometrics Microsoft Office Training Leadership Quantitative Research Demand Forecasting Sales Operations Regression Analysis Statistical Software Inventory Management Sales Production Planning Semiconductors Pricing See 2+     See less Product Management Supply Chain Management Economic Modeling Econometrics Microsoft Office Training Leadership Quantitative Research Demand Forecasting Sales Operations Regression Analysis Statistical Software Inventory Management Sales Production Planning Semiconductors Pricing See 2+     See less Product Management Supply Chain Management Economic Modeling Econometrics Microsoft Office Training Leadership Quantitative Research Demand Forecasting Sales Operations Regression Analysis Statistical Software Inventory Management Sales Production Planning Semiconductors Pricing See 2+     See less Education University of California, Berkeley Bachelor’s Degree,  Economics 2008  – 2012 Activities and Societies:  International Honor Society in Economics ,  Omicron Delta Epsilon; Executive Committee ,  Hall Association (Social Vice President and Secretary/Communications Director); Berkeley Women in Business (BWIB) ,  University/Haas Relations Committee Representative (liaison to Dean) Santa Clara University - Leavey School of Business Master of Business Administration (M.B.A.) 2014  – 2017 University of California, Berkeley Bachelor’s Degree,  Economics 2008  – 2012 Activities and Societies:  International Honor Society in Economics ,  Omicron Delta Epsilon; Executive Committee ,  Hall Association (Social Vice President and Secretary/Communications Director); Berkeley Women in Business (BWIB) ,  University/Haas Relations Committee Representative (liaison to Dean) University of California, Berkeley Bachelor’s Degree,  Economics 2008  – 2012 Activities and Societies:  International Honor Society in Economics ,  Omicron Delta Epsilon; Executive Committee ,  Hall Association (Social Vice President and Secretary/Communications Director); Berkeley Women in Business (BWIB) ,  University/Haas Relations Committee Representative (liaison to Dean) University of California, Berkeley Bachelor’s Degree,  Economics 2008  – 2012 Activities and Societies:  International Honor Society in Economics ,  Omicron Delta Epsilon; Executive Committee ,  Hall Association (Social Vice President and Secretary/Communications Director); Berkeley Women in Business (BWIB) ,  University/Haas Relations Committee Representative (liaison to Dean) Santa Clara University - Leavey School of Business Master of Business Administration (M.B.A.) 2014  – 2017 Santa Clara University - Leavey School of Business Master of Business Administration (M.B.A.) 2014  – 2017 Santa Clara University - Leavey School of Business Master of Business Administration (M.B.A.) 2014  – 2017 Honors & Awards Additional Honors & Awards - Four time Recipient, Director Recognition Award for top performance in key supply metric, Intel  \n- Eighty time Recipient, Recognition Award by managers, peers and stakeholders through Intel Recognition Program \n- Global Recognition Employee Award Recipient, Bank of America \n- Honors to Date, College of Letters and Science, UC Berkeley \n- National Residence Hall Honoree (recognizes leaders, top 1% of residence hall students), NACURH, Inc., UC Berkeley \n- B of A Education Achievement Scholarship Award, Regional 2nd place Finalist in Liberal Arts Additional Honors & Awards - Four time Recipient, Director Recognition Award for top performance in key supply metric, Intel  \n- Eighty time Recipient, Recognition Award by managers, peers and stakeholders through Intel Recognition Program \n- Global Recognition Employee Award Recipient, Bank of America \n- Honors to Date, College of Letters and Science, UC Berkeley \n- National Residence Hall Honoree (recognizes leaders, top 1% of residence hall students), NACURH, Inc., UC Berkeley \n- B of A Education Achievement Scholarship Award, Regional 2nd place Finalist in Liberal Arts Additional Honors & Awards - Four time Recipient, Director Recognition Award for top performance in key supply metric, Intel  \n- Eighty time Recipient, Recognition Award by managers, peers and stakeholders through Intel Recognition Program \n- Global Recognition Employee Award Recipient, Bank of America \n- Honors to Date, College of Letters and Science, UC Berkeley \n- National Residence Hall Honoree (recognizes leaders, top 1% of residence hall students), NACURH, Inc., UC Berkeley \n- B of A Education Achievement Scholarship Award, Regional 2nd place Finalist in Liberal Arts Additional Honors & Awards - Four time Recipient, Director Recognition Award for top performance in key supply metric, Intel  \n- Eighty time Recipient, Recognition Award by managers, peers and stakeholders through Intel Recognition Program \n- Global Recognition Employee Award Recipient, Bank of America \n- Honors to Date, College of Letters and Science, UC Berkeley \n- National Residence Hall Honoree (recognizes leaders, top 1% of residence hall students), NACURH, Inc., UC Berkeley \n- B of A Education Achievement Scholarship Award, Regional 2nd place Finalist in Liberal Arts ", "Experience Rebates Analyst Intel Corporation Pricing Manager Intel Corporation February 2005  – Present (10 years 7 months) Folsom Rebates Analyst Intel Corporation Rebates Analyst Intel Corporation Pricing Manager Intel Corporation February 2005  – Present (10 years 7 months) Folsom Pricing Manager Intel Corporation February 2005  – Present (10 years 7 months) Folsom Education Stanford University MA,  German Studies ,  English 2000  – 2004 Stanford University MA,  German Studies ,  English 2000  – 2004 Stanford University MA,  German Studies ,  English 2000  – 2004 Stanford University MA,  German Studies ,  English 2000  – 2004 ", "Experience Retail Pricing Manager Intel Corporation August 2014  – Present (1 year 1 month) Consumption / Market Analyst Intel Corporation March 2013  –  July 2014  (1 year 5 months) Customer Sales & Rebate Analyst Intel Corporation March 2010  –  March 2013  (3 years 1 month) Customer Business Analyst Intel Corporation March 2008  –  March 2010  (2 years 1 month) Deal Implementation Manager Hewlett-Packard August 2005  –  August 2006  (1 year 1 month) Retail Pricing Manager Intel Corporation August 2014  – Present (1 year 1 month) Retail Pricing Manager Intel Corporation August 2014  – Present (1 year 1 month) Consumption / Market Analyst Intel Corporation March 2013  –  July 2014  (1 year 5 months) Consumption / Market Analyst Intel Corporation March 2013  –  July 2014  (1 year 5 months) Customer Sales & Rebate Analyst Intel Corporation March 2010  –  March 2013  (3 years 1 month) Customer Sales & Rebate Analyst Intel Corporation March 2010  –  March 2013  (3 years 1 month) Customer Business Analyst Intel Corporation March 2008  –  March 2010  (2 years 1 month) Customer Business Analyst Intel Corporation March 2008  –  March 2010  (2 years 1 month) Deal Implementation Manager Hewlett-Packard August 2005  –  August 2006  (1 year 1 month) Deal Implementation Manager Hewlett-Packard August 2005  –  August 2006  (1 year 1 month) Skills Competitive Analysis Forecasting Market Analysis Product Marketing Pricing Business Strategy Intel Business Analysis Analysis Business Intelligence International Market... Sales Operations Sales Analysis Semiconductors Semiconductor Industry Go-to-market Strategy International Business Cross-cultural Teams Virtual Teams Presentations Communication Retail Marketing See 7+     See less Skills  Competitive Analysis Forecasting Market Analysis Product Marketing Pricing Business Strategy Intel Business Analysis Analysis Business Intelligence International Market... Sales Operations Sales Analysis Semiconductors Semiconductor Industry Go-to-market Strategy International Business Cross-cultural Teams Virtual Teams Presentations Communication Retail Marketing See 7+     See less Competitive Analysis Forecasting Market Analysis Product Marketing Pricing Business Strategy Intel Business Analysis Analysis Business Intelligence International Market... Sales Operations Sales Analysis Semiconductors Semiconductor Industry Go-to-market Strategy International Business Cross-cultural Teams Virtual Teams Presentations Communication Retail Marketing See 7+     See less Competitive Analysis Forecasting Market Analysis Product Marketing Pricing Business Strategy Intel Business Analysis Analysis Business Intelligence International Market... Sales Operations Sales Analysis Semiconductors Semiconductor Industry Go-to-market Strategy International Business Cross-cultural Teams Virtual Teams Presentations Communication Retail Marketing See 7+     See less Education Bournemouth University Bachelor's degree,  Business/Commerce , General , 2.1 2003  – 2007 Bournemouth University Bachelor's degree,  Business/Commerce , General , 2.1 2003  – 2007 Bournemouth University Bachelor's degree,  Business/Commerce , General , 2.1 2003  – 2007 Bournemouth University Bachelor's degree,  Business/Commerce , General , 2.1 2003  – 2007 ", "Skills Finance Financial Modeling Financial Analysis Forecasting Financial Forecasting Strategic Financial... Variance Analysis Financial Reporting Managerial Finance Cross-functional Team... Sarbanes-Oxley Act Internal Controls Cost Accounting Corporate Finance Process Improvement Skills  Finance Financial Modeling Financial Analysis Forecasting Financial Forecasting Strategic Financial... Variance Analysis Financial Reporting Managerial Finance Cross-functional Team... Sarbanes-Oxley Act Internal Controls Cost Accounting Corporate Finance Process Improvement Finance Financial Modeling Financial Analysis Forecasting Financial Forecasting Strategic Financial... Variance Analysis Financial Reporting Managerial Finance Cross-functional Team... Sarbanes-Oxley Act Internal Controls Cost Accounting Corporate Finance Process Improvement Finance Financial Modeling Financial Analysis Forecasting Financial Forecasting Strategic Financial... Variance Analysis Financial Reporting Managerial Finance Cross-functional Team... Sarbanes-Oxley Act Internal Controls Cost Accounting Corporate Finance Process Improvement ", "Summary Solid business operations/analyst with strong accounting/finance background focusing on problem identification, process improvements and development and implementation of new tools and supporting these processes. Results oriented individual who assumes responsibility for issues and develops and drives challenging goals to confront and solve problems. Focusing on customer service, stakeholder management and teambuilding to address and drive operational improvements and improve overall bottom line performance of organization.  Summary Solid business operations/analyst with strong accounting/finance background focusing on problem identification, process improvements and development and implementation of new tools and supporting these processes. Results oriented individual who assumes responsibility for issues and develops and drives challenging goals to confront and solve problems. Focusing on customer service, stakeholder management and teambuilding to address and drive operational improvements and improve overall bottom line performance of organization.  Solid business operations/analyst with strong accounting/finance background focusing on problem identification, process improvements and development and implementation of new tools and supporting these processes. Results oriented individual who assumes responsibility for issues and develops and drives challenging goals to confront and solve problems. Focusing on customer service, stakeholder management and teambuilding to address and drive operational improvements and improve overall bottom line performance of organization.  Solid business operations/analyst with strong accounting/finance background focusing on problem identification, process improvements and development and implementation of new tools and supporting these processes. Results oriented individual who assumes responsibility for issues and develops and drives challenging goals to confront and solve problems. Focusing on customer service, stakeholder management and teambuilding to address and drive operational improvements and improve overall bottom line performance of organization.  Experience Finance Analysis Consultant Health Net Federal Services August 2015  – Present (1 month) Rancho Cordova, CA Business Owner Infused Harmony December 2012  – Present (2 years 9 months) Roseville CA I believe in nature and that all our answers to wellness can be found in nature. I teach people to harness this amazing power thru Alternative Healthcare Products including doTERRA Essential Oils.  \nThru Infused Harmony, I make customized soaps, lotions, shampoos tailored to a customer's specific needs/wants all utilizing natural ingredients and CPTG essential oils.  Sr Rebate Analyst Intel Corporation April 2012  –  February 2015  (2 years 11 months) Folsom, CA Owned end-to-end rebate process for key emerging customers (Market Makers). Created, updated and maintained accurate weekly Rebate forecasts, paid rebates owed to customers and owned customer/field/division communication and monthly and quarterly close processes. Product Line Analyst and Pricing Manager Intel Corporation November 2010  –  March 2012  (1 year 5 months) Folsom, CA Responsible for managing all supply and demand activities for the desktop board division acting as key conduit between customer and factory. Pricing Manager responsibilities included influencing broad channel pricing and roadmap for Intel’s Board Division.  Pricing Manager Intel Corporation October 2008  –  October 2010  (2 years 1 month) Folsom, CA Responsible for developing and implementing pricing solutions for Latin America Broad Channel accounts including influencing roadmap and product decisions and providing pricing guidance to stakeholders ultimately benefiting Intel’s Net Income, MSS and strategic direction thru analytical based recommendations.  Product Line Analyst Intel Corporation June 2005  –  October 2008  (3 years 5 months) Folsom, CA Forecast Demand and Revenue commitments to the corporation and drives business unit to meet the commitments. Responsible for all aspects of Supply and demand including understanding the market, industry and competitive environment as well as influencing product roadmaps, pricing and positioning.  Corporate Capital Sr. Financial Analyst Intel Corporation April 2003  –  June 2005  (2 years 3 months) Santa Clara, CA Evaluated capital requests for AT (Assembly Test) and TD (Technology Development) divisions, influencing optimal spending levels and providing analysis/recommendations to management.  Capital Supervisor Intel Corporation June 2002  –  March 2003  (10 months) Responsible for coordinating IT’s Capital requests and ongoing capital budget maintenance and reporting. Developed and drove new processes to streamline, automate and reduce manual pre-close process which increased forecasting accuracy by 31% and reduced monthly close process from 4 days to 1.5days.  \n Cost Accounting Sr. Strategic Analyst Intel Corporation January 2002  –  June 2002  (6 months) Understand and accumulate requirements, evaluate alternatives and make recommendation for a long-term Cost Allocation tool for IT infrastructure costs across the corporation. Set conceptual framework for a new automated Cost/Allocation and Billing tool. Identified, drove and implemented allocation tool improvements resulting in an automated consumption gathering tool and a new calculation model that addressed data inconsistencies and enabled automated IT Customer Statements. Drove tool recommendation process by identifying the appropriate architecture that would support organizational requirements and a scalable tool and implementation process.  \n M&A Sr Strategic Financial Analyst Intel Corporation December 2000  –  December 2001  (1 year 1 month) Sr Financial Analyst for IT M&A department responsible implementing the IT infrastructure within acquisitions as they are integrated into the Intel world. Supports the M&A business unit with budgets and planning analyses and developing controls and risk assessments. Senior Accountant/ Cost Accounting Manager NEC Electronics August 1997  –  December 2000  (3 years 5 months) Roseville, CA *\tResponsible for managing all Cost Accounting functions – including development of standard cost, analysis of actual cost and resulting variance analysis, customer and product profitability analysis, and management of inter-company and affiliate operations  \n*\tAnalyze and develop new and existing Business Systems to support changing business needs – functioned as a Liaison between IT and Finance including working closely with IT department on defining specifications and development of new systems and refinement of existing systems  \n*\tPrepare and analyze annual business plan and resulting variances; prepare and analyze revised forecasts incorporating countermeasures developed to achieve business plan. Developed and analyzed financial models to support business planning, forecasting and successful business operations.  \n*\tResponsible for the preparation and analysis of monthly variances and financial statements and summaries for Managerial Operational, Executive Management, and Corporate reporting as well as various special projects, proposals, new product costs, and develop new reporting procedures to meet management challenges.  \n*\tConducted on-site accounting and excel courses customized to current cost accounting concepts and internal procedures  \n Finance Analysis Consultant Health Net Federal Services August 2015  – Present (1 month) Rancho Cordova, CA Finance Analysis Consultant Health Net Federal Services August 2015  – Present (1 month) Rancho Cordova, CA Business Owner Infused Harmony December 2012  – Present (2 years 9 months) Roseville CA I believe in nature and that all our answers to wellness can be found in nature. I teach people to harness this amazing power thru Alternative Healthcare Products including doTERRA Essential Oils.  \nThru Infused Harmony, I make customized soaps, lotions, shampoos tailored to a customer's specific needs/wants all utilizing natural ingredients and CPTG essential oils.  Business Owner Infused Harmony December 2012  – Present (2 years 9 months) Roseville CA I believe in nature and that all our answers to wellness can be found in nature. I teach people to harness this amazing power thru Alternative Healthcare Products including doTERRA Essential Oils.  \nThru Infused Harmony, I make customized soaps, lotions, shampoos tailored to a customer's specific needs/wants all utilizing natural ingredients and CPTG essential oils.  Sr Rebate Analyst Intel Corporation April 2012  –  February 2015  (2 years 11 months) Folsom, CA Owned end-to-end rebate process for key emerging customers (Market Makers). Created, updated and maintained accurate weekly Rebate forecasts, paid rebates owed to customers and owned customer/field/division communication and monthly and quarterly close processes. Sr Rebate Analyst Intel Corporation April 2012  –  February 2015  (2 years 11 months) Folsom, CA Owned end-to-end rebate process for key emerging customers (Market Makers). Created, updated and maintained accurate weekly Rebate forecasts, paid rebates owed to customers and owned customer/field/division communication and monthly and quarterly close processes. Product Line Analyst and Pricing Manager Intel Corporation November 2010  –  March 2012  (1 year 5 months) Folsom, CA Responsible for managing all supply and demand activities for the desktop board division acting as key conduit between customer and factory. Pricing Manager responsibilities included influencing broad channel pricing and roadmap for Intel’s Board Division.  Product Line Analyst and Pricing Manager Intel Corporation November 2010  –  March 2012  (1 year 5 months) Folsom, CA Responsible for managing all supply and demand activities for the desktop board division acting as key conduit between customer and factory. Pricing Manager responsibilities included influencing broad channel pricing and roadmap for Intel’s Board Division.  Pricing Manager Intel Corporation October 2008  –  October 2010  (2 years 1 month) Folsom, CA Responsible for developing and implementing pricing solutions for Latin America Broad Channel accounts including influencing roadmap and product decisions and providing pricing guidance to stakeholders ultimately benefiting Intel’s Net Income, MSS and strategic direction thru analytical based recommendations.  Pricing Manager Intel Corporation October 2008  –  October 2010  (2 years 1 month) Folsom, CA Responsible for developing and implementing pricing solutions for Latin America Broad Channel accounts including influencing roadmap and product decisions and providing pricing guidance to stakeholders ultimately benefiting Intel’s Net Income, MSS and strategic direction thru analytical based recommendations.  Product Line Analyst Intel Corporation June 2005  –  October 2008  (3 years 5 months) Folsom, CA Forecast Demand and Revenue commitments to the corporation and drives business unit to meet the commitments. Responsible for all aspects of Supply and demand including understanding the market, industry and competitive environment as well as influencing product roadmaps, pricing and positioning.  Product Line Analyst Intel Corporation June 2005  –  October 2008  (3 years 5 months) Folsom, CA Forecast Demand and Revenue commitments to the corporation and drives business unit to meet the commitments. Responsible for all aspects of Supply and demand including understanding the market, industry and competitive environment as well as influencing product roadmaps, pricing and positioning.  Corporate Capital Sr. Financial Analyst Intel Corporation April 2003  –  June 2005  (2 years 3 months) Santa Clara, CA Evaluated capital requests for AT (Assembly Test) and TD (Technology Development) divisions, influencing optimal spending levels and providing analysis/recommendations to management.  Corporate Capital Sr. Financial Analyst Intel Corporation April 2003  –  June 2005  (2 years 3 months) Santa Clara, CA Evaluated capital requests for AT (Assembly Test) and TD (Technology Development) divisions, influencing optimal spending levels and providing analysis/recommendations to management.  Capital Supervisor Intel Corporation June 2002  –  March 2003  (10 months) Responsible for coordinating IT’s Capital requests and ongoing capital budget maintenance and reporting. Developed and drove new processes to streamline, automate and reduce manual pre-close process which increased forecasting accuracy by 31% and reduced monthly close process from 4 days to 1.5days.  \n Capital Supervisor Intel Corporation June 2002  –  March 2003  (10 months) Responsible for coordinating IT’s Capital requests and ongoing capital budget maintenance and reporting. Developed and drove new processes to streamline, automate and reduce manual pre-close process which increased forecasting accuracy by 31% and reduced monthly close process from 4 days to 1.5days.  \n Cost Accounting Sr. Strategic Analyst Intel Corporation January 2002  –  June 2002  (6 months) Understand and accumulate requirements, evaluate alternatives and make recommendation for a long-term Cost Allocation tool for IT infrastructure costs across the corporation. Set conceptual framework for a new automated Cost/Allocation and Billing tool. Identified, drove and implemented allocation tool improvements resulting in an automated consumption gathering tool and a new calculation model that addressed data inconsistencies and enabled automated IT Customer Statements. Drove tool recommendation process by identifying the appropriate architecture that would support organizational requirements and a scalable tool and implementation process.  \n Cost Accounting Sr. Strategic Analyst Intel Corporation January 2002  –  June 2002  (6 months) Understand and accumulate requirements, evaluate alternatives and make recommendation for a long-term Cost Allocation tool for IT infrastructure costs across the corporation. Set conceptual framework for a new automated Cost/Allocation and Billing tool. Identified, drove and implemented allocation tool improvements resulting in an automated consumption gathering tool and a new calculation model that addressed data inconsistencies and enabled automated IT Customer Statements. Drove tool recommendation process by identifying the appropriate architecture that would support organizational requirements and a scalable tool and implementation process.  \n M&A Sr Strategic Financial Analyst Intel Corporation December 2000  –  December 2001  (1 year 1 month) Sr Financial Analyst for IT M&A department responsible implementing the IT infrastructure within acquisitions as they are integrated into the Intel world. Supports the M&A business unit with budgets and planning analyses and developing controls and risk assessments. M&A Sr Strategic Financial Analyst Intel Corporation December 2000  –  December 2001  (1 year 1 month) Sr Financial Analyst for IT M&A department responsible implementing the IT infrastructure within acquisitions as they are integrated into the Intel world. Supports the M&A business unit with budgets and planning analyses and developing controls and risk assessments. Senior Accountant/ Cost Accounting Manager NEC Electronics August 1997  –  December 2000  (3 years 5 months) Roseville, CA *\tResponsible for managing all Cost Accounting functions – including development of standard cost, analysis of actual cost and resulting variance analysis, customer and product profitability analysis, and management of inter-company and affiliate operations  \n*\tAnalyze and develop new and existing Business Systems to support changing business needs – functioned as a Liaison between IT and Finance including working closely with IT department on defining specifications and development of new systems and refinement of existing systems  \n*\tPrepare and analyze annual business plan and resulting variances; prepare and analyze revised forecasts incorporating countermeasures developed to achieve business plan. Developed and analyzed financial models to support business planning, forecasting and successful business operations.  \n*\tResponsible for the preparation and analysis of monthly variances and financial statements and summaries for Managerial Operational, Executive Management, and Corporate reporting as well as various special projects, proposals, new product costs, and develop new reporting procedures to meet management challenges.  \n*\tConducted on-site accounting and excel courses customized to current cost accounting concepts and internal procedures  \n Senior Accountant/ Cost Accounting Manager NEC Electronics August 1997  –  December 2000  (3 years 5 months) Roseville, CA *\tResponsible for managing all Cost Accounting functions – including development of standard cost, analysis of actual cost and resulting variance analysis, customer and product profitability analysis, and management of inter-company and affiliate operations  \n*\tAnalyze and develop new and existing Business Systems to support changing business needs – functioned as a Liaison between IT and Finance including working closely with IT department on defining specifications and development of new systems and refinement of existing systems  \n*\tPrepare and analyze annual business plan and resulting variances; prepare and analyze revised forecasts incorporating countermeasures developed to achieve business plan. Developed and analyzed financial models to support business planning, forecasting and successful business operations.  \n*\tResponsible for the preparation and analysis of monthly variances and financial statements and summaries for Managerial Operational, Executive Management, and Corporate reporting as well as various special projects, proposals, new product costs, and develop new reporting procedures to meet management challenges.  \n*\tConducted on-site accounting and excel courses customized to current cost accounting concepts and internal procedures  \n Languages English English English Skills Intel Go-to-market Strategy Cross-functional Team... Competitive Analysis Program Management Semiconductors Product Management Process Improvement Strategic Partnerships Product Development Budgets Skills  Intel Go-to-market Strategy Cross-functional Team... Competitive Analysis Program Management Semiconductors Product Management Process Improvement Strategic Partnerships Product Development Budgets Intel Go-to-market Strategy Cross-functional Team... Competitive Analysis Program Management Semiconductors Product Management Process Improvement Strategic Partnerships Product Development Budgets Intel Go-to-market Strategy Cross-functional Team... Competitive Analysis Program Management Semiconductors Product Management Process Improvement Strategic Partnerships Product Development Budgets Education Golden Gate University Master of Business Administration (MBA),  Finance and Financial Management Services , magna cum laude 1993  – 1996 Undergrad is also from GGU and is in Accounting. Activities and Societies:  Institute of Management Accountants (IMA) Golden Gate University Master of Business Administration (MBA),  Finance and Financial Management Services , magna cum laude 1993  – 1996 Undergrad is also from GGU and is in Accounting. Activities and Societies:  Institute of Management Accountants (IMA) Golden Gate University Master of Business Administration (MBA),  Finance and Financial Management Services , magna cum laude 1993  – 1996 Undergrad is also from GGU and is in Accounting. Activities and Societies:  Institute of Management Accountants (IMA) Golden Gate University Master of Business Administration (MBA),  Finance and Financial Management Services , magna cum laude 1993  – 1996 Undergrad is also from GGU and is in Accounting. Activities and Societies:  Institute of Management Accountants (IMA) ", "Languages Japanese Professional working proficiency Chinese Native or bilingual proficiency English Native or bilingual proficiency Japanese Professional working proficiency Chinese Native or bilingual proficiency English Native or bilingual proficiency Japanese Professional working proficiency Chinese Native or bilingual proficiency English Native or bilingual proficiency Professional working proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Transfer Pricing Cross-functional Team... Semiconductors Financial Analysis Financial Modeling International Tax Mergers Sarbanes-Oxley Act Accounting Corporate Finance SAP Mandarin Project Management Financial Reporting Tax US GAAP Forecasting Mergers & Acquisitions See 3+     See less Skills  Transfer Pricing Cross-functional Team... Semiconductors Financial Analysis Financial Modeling International Tax Mergers Sarbanes-Oxley Act Accounting Corporate Finance SAP Mandarin Project Management Financial Reporting Tax US GAAP Forecasting Mergers & Acquisitions See 3+     See less Transfer Pricing Cross-functional Team... Semiconductors Financial Analysis Financial Modeling International Tax Mergers Sarbanes-Oxley Act Accounting Corporate Finance SAP Mandarin Project Management Financial Reporting Tax US GAAP Forecasting Mergers & Acquisitions See 3+     See less Transfer Pricing Cross-functional Team... Semiconductors Financial Analysis Financial Modeling International Tax Mergers Sarbanes-Oxley Act Accounting Corporate Finance SAP Mandarin Project Management Financial Reporting Tax US GAAP Forecasting Mergers & Acquisitions See 3+     See less Honors & Awards Mutiple Finance Achievement Awards Intel Additional Honors & Awards Intel Idol (Santa Clara)-2008 Mutiple Finance Achievement Awards Intel Mutiple Finance Achievement Awards Intel Mutiple Finance Achievement Awards Intel Additional Honors & Awards Intel Idol (Santa Clara)-2008 Additional Honors & Awards Intel Idol (Santa Clara)-2008 Additional Honors & Awards Intel Idol (Santa Clara)-2008 "]}