{"position": "Process Integration Engineer", "company": "Intel Corporation", "profiles": ["Summary Experienced Development and Integration Leader who consistently implements robust engineering solutions across a wide range of the semiconductor manufacturing process: from incoming silicon through wafer fabrication to assembly & test operations. \n \nKey Decision Maker with Insights into the complexities of High Volume Manufacturing. Summary Experienced Development and Integration Leader who consistently implements robust engineering solutions across a wide range of the semiconductor manufacturing process: from incoming silicon through wafer fabrication to assembly & test operations. \n \nKey Decision Maker with Insights into the complexities of High Volume Manufacturing. Experienced Development and Integration Leader who consistently implements robust engineering solutions across a wide range of the semiconductor manufacturing process: from incoming silicon through wafer fabrication to assembly & test operations. \n \nKey Decision Maker with Insights into the complexities of High Volume Manufacturing. Experienced Development and Integration Leader who consistently implements robust engineering solutions across a wide range of the semiconductor manufacturing process: from incoming silicon through wafer fabrication to assembly & test operations. \n \nKey Decision Maker with Insights into the complexities of High Volume Manufacturing. Experience Semiconductor Package Technologist Apple October 2014  – Present (11 months) San Francisco Bay Area Senior Staff Technology Development Engineer Intel Corporation October 2011  –  October 2014  (3 years 1 month) Hudson, MA Staff Process Integration Engineer Intel Corporation 2009  –  2011  (2 years) Hudson, MA Senior Process Integration Engineer Intel Corporation October 2003  –  2009  (6 years) Senior Material Analysis Engineer Intel Corporation July 2001  –  2003  (2 years) Hudson, MA Senior Material Analysis Engineer Intel Corporation January 2001  –  July 2001  (7 months) Hillsboro, OR Senior Package Development Engineer Analog Devices 1996  –  2000  (4 years) Wilmington, MA Semiconductor Package Technologist Apple October 2014  – Present (11 months) San Francisco Bay Area Semiconductor Package Technologist Apple October 2014  – Present (11 months) San Francisco Bay Area Senior Staff Technology Development Engineer Intel Corporation October 2011  –  October 2014  (3 years 1 month) Hudson, MA Senior Staff Technology Development Engineer Intel Corporation October 2011  –  October 2014  (3 years 1 month) Hudson, MA Staff Process Integration Engineer Intel Corporation 2009  –  2011  (2 years) Hudson, MA Staff Process Integration Engineer Intel Corporation 2009  –  2011  (2 years) Hudson, MA Senior Process Integration Engineer Intel Corporation October 2003  –  2009  (6 years) Senior Process Integration Engineer Intel Corporation October 2003  –  2009  (6 years) Senior Material Analysis Engineer Intel Corporation July 2001  –  2003  (2 years) Hudson, MA Senior Material Analysis Engineer Intel Corporation July 2001  –  2003  (2 years) Hudson, MA Senior Material Analysis Engineer Intel Corporation January 2001  –  July 2001  (7 months) Hillsboro, OR Senior Material Analysis Engineer Intel Corporation January 2001  –  July 2001  (7 months) Hillsboro, OR Senior Package Development Engineer Analog Devices 1996  –  2000  (4 years) Wilmington, MA Senior Package Development Engineer Analog Devices 1996  –  2000  (4 years) Wilmington, MA Skills Design of Experiments Semiconductors Failure Analysis Cross-functional Team... Semiconductor Industry Manufacturing Silicon Process Integration Testing JMP SPC Yield CVD Thin Films IC Skills  Design of Experiments Semiconductors Failure Analysis Cross-functional Team... Semiconductor Industry Manufacturing Silicon Process Integration Testing JMP SPC Yield CVD Thin Films IC Design of Experiments Semiconductors Failure Analysis Cross-functional Team... Semiconductor Industry Manufacturing Silicon Process Integration Testing JMP SPC Yield CVD Thin Films IC Design of Experiments Semiconductors Failure Analysis Cross-functional Team... Semiconductor Industry Manufacturing Silicon Process Integration Testing JMP SPC Yield CVD Thin Films IC Education Worcester Polytechnic Institute MS,  Material Science and Engineering 1993  – 1996 Worcester Polytechnic Institute BS,  Mechanical Engineering 1990  – 1993 Worcester Polytechnic Institute MS,  Material Science and Engineering 1993  – 1996 Worcester Polytechnic Institute MS,  Material Science and Engineering 1993  – 1996 Worcester Polytechnic Institute MS,  Material Science and Engineering 1993  – 1996 Worcester Polytechnic Institute BS,  Mechanical Engineering 1990  – 1993 Worcester Polytechnic Institute BS,  Mechanical Engineering 1990  – 1993 Worcester Polytechnic Institute BS,  Mechanical Engineering 1990  – 1993 ", "Summary I specialize in terahertz spectroscopy of semiconductors (group III-V). Analysis of thermodynamics and kinetics in GaAs and GaN systems, involving electron heating and transport measurements at terahertz frequencies.  \nI also work on semiconductor lasers specifically Quantum cascade lasers. Specialties:Intensive clean room experience in fabrication of Si and III-V compound semiconductor devices: Optical and EBL, FIB milling, thin film deposition (E-beam, thermal, MBE), dry and wet etching, wire bonding, diffusion, and mask design. Highly skilled at device testing and characterization: Spectrum Analyzer, AFM, Low frequency lock-in techniques, VNA, DC/AC/RF signal testing and low temperature measurements. Extensive experience with gas lasers, QCLs, nonlinear optics, and FTIR. Summary I specialize in terahertz spectroscopy of semiconductors (group III-V). Analysis of thermodynamics and kinetics in GaAs and GaN systems, involving electron heating and transport measurements at terahertz frequencies.  \nI also work on semiconductor lasers specifically Quantum cascade lasers. Specialties:Intensive clean room experience in fabrication of Si and III-V compound semiconductor devices: Optical and EBL, FIB milling, thin film deposition (E-beam, thermal, MBE), dry and wet etching, wire bonding, diffusion, and mask design. Highly skilled at device testing and characterization: Spectrum Analyzer, AFM, Low frequency lock-in techniques, VNA, DC/AC/RF signal testing and low temperature measurements. Extensive experience with gas lasers, QCLs, nonlinear optics, and FTIR. I specialize in terahertz spectroscopy of semiconductors (group III-V). Analysis of thermodynamics and kinetics in GaAs and GaN systems, involving electron heating and transport measurements at terahertz frequencies.  \nI also work on semiconductor lasers specifically Quantum cascade lasers. Specialties:Intensive clean room experience in fabrication of Si and III-V compound semiconductor devices: Optical and EBL, FIB milling, thin film deposition (E-beam, thermal, MBE), dry and wet etching, wire bonding, diffusion, and mask design. Highly skilled at device testing and characterization: Spectrum Analyzer, AFM, Low frequency lock-in techniques, VNA, DC/AC/RF signal testing and low temperature measurements. Extensive experience with gas lasers, QCLs, nonlinear optics, and FTIR. I specialize in terahertz spectroscopy of semiconductors (group III-V). Analysis of thermodynamics and kinetics in GaAs and GaN systems, involving electron heating and transport measurements at terahertz frequencies.  \nI also work on semiconductor lasers specifically Quantum cascade lasers. Specialties:Intensive clean room experience in fabrication of Si and III-V compound semiconductor devices: Optical and EBL, FIB milling, thin film deposition (E-beam, thermal, MBE), dry and wet etching, wire bonding, diffusion, and mask design. Highly skilled at device testing and characterization: Spectrum Analyzer, AFM, Low frequency lock-in techniques, VNA, DC/AC/RF signal testing and low temperature measurements. Extensive experience with gas lasers, QCLs, nonlinear optics, and FTIR. Experience Process integration Engineer Intel Corporation Research Assistant University at Buffalo, Buffalo, N.Y. August 2007  –  September 2011  (4 years 2 months) Study of electron transport, and heating mechanisms in semiconductors using millimeter waves. Fabrication and characterization of detectors for Terahertz frequencies. \nQuantum cascade laser based semiconductor spectroscopy Teaching Assistant State University of New York at Buffalo August 2009  –  December 2010  (1 year 5 months) Electrical Engineering Department, University at Buffalo, SUNY \n \n-- EE 200/310, Electronic Devices and Circuits \nLead discussion sections, tutorials, and laboratory sessions for 450 undergraduate students. \n-- EE 202/536, Circuit Analysis, Antennas and Wireless Communications ~ 180 students \nSpearheaded group of three TAs to stimulate interest, enthusiasm, and encourage student initiative through various activities. Evaluated and graded examinations, assignments and research papers. Process integration Engineer Intel Corporation Process integration Engineer Intel Corporation Research Assistant University at Buffalo, Buffalo, N.Y. August 2007  –  September 2011  (4 years 2 months) Study of electron transport, and heating mechanisms in semiconductors using millimeter waves. Fabrication and characterization of detectors for Terahertz frequencies. \nQuantum cascade laser based semiconductor spectroscopy Research Assistant University at Buffalo, Buffalo, N.Y. August 2007  –  September 2011  (4 years 2 months) Study of electron transport, and heating mechanisms in semiconductors using millimeter waves. Fabrication and characterization of detectors for Terahertz frequencies. \nQuantum cascade laser based semiconductor spectroscopy Teaching Assistant State University of New York at Buffalo August 2009  –  December 2010  (1 year 5 months) Electrical Engineering Department, University at Buffalo, SUNY \n \n-- EE 200/310, Electronic Devices and Circuits \nLead discussion sections, tutorials, and laboratory sessions for 450 undergraduate students. \n-- EE 202/536, Circuit Analysis, Antennas and Wireless Communications ~ 180 students \nSpearheaded group of three TAs to stimulate interest, enthusiasm, and encourage student initiative through various activities. Evaluated and graded examinations, assignments and research papers. Teaching Assistant State University of New York at Buffalo August 2009  –  December 2010  (1 year 5 months) Electrical Engineering Department, University at Buffalo, SUNY \n \n-- EE 200/310, Electronic Devices and Circuits \nLead discussion sections, tutorials, and laboratory sessions for 450 undergraduate students. \n-- EE 202/536, Circuit Analysis, Antennas and Wireless Communications ~ 180 students \nSpearheaded group of three TAs to stimulate interest, enthusiasm, and encourage student initiative through various activities. Evaluated and graded examinations, assignments and research papers. Education University at Buffalo Ph.D,,  Electrical Engineering 2008  – 2011 Dissertation: Terahertz detection and mixing using quantum cascade lasers (QCLs) University at Buffalo Master of Science,,  Electrical Engineering 2006  – 2008 Research Project: Characterization of two dimensional electron gas (2DEG) micro-bolometer for mixing at millimeter and sub-millimeter wavelengths Activities and Societies:  UB terahertz journal Club Visvesvaraya Technological University BE,  Electronics and Communications 2002  – 2006 University at Buffalo Ph.D,,  Electrical Engineering 2008  – 2011 Dissertation: Terahertz detection and mixing using quantum cascade lasers (QCLs) University at Buffalo Ph.D,,  Electrical Engineering 2008  – 2011 Dissertation: Terahertz detection and mixing using quantum cascade lasers (QCLs) University at Buffalo Ph.D,,  Electrical Engineering 2008  – 2011 Dissertation: Terahertz detection and mixing using quantum cascade lasers (QCLs) University at Buffalo Master of Science,,  Electrical Engineering 2006  – 2008 Research Project: Characterization of two dimensional electron gas (2DEG) micro-bolometer for mixing at millimeter and sub-millimeter wavelengths Activities and Societies:  UB terahertz journal Club University at Buffalo Master of Science,,  Electrical Engineering 2006  – 2008 Research Project: Characterization of two dimensional electron gas (2DEG) micro-bolometer for mixing at millimeter and sub-millimeter wavelengths Activities and Societies:  UB terahertz journal Club University at Buffalo Master of Science,,  Electrical Engineering 2006  – 2008 Research Project: Characterization of two dimensional electron gas (2DEG) micro-bolometer for mixing at millimeter and sub-millimeter wavelengths Activities and Societies:  UB terahertz journal Club Visvesvaraya Technological University BE,  Electronics and Communications 2002  – 2006 Visvesvaraya Technological University BE,  Electronics and Communications 2002  – 2006 Visvesvaraya Technological University BE,  Electronics and Communications 2002  – 2006 Honors & Awards Additional Honors & Awards MDRF - Principal Investigator Grant (2010- 2011) \nMark Diamond Research Fund, Graduate Student Association, University at Buffalo, State University of New York Additional Honors & Awards MDRF - Principal Investigator Grant (2010- 2011) \nMark Diamond Research Fund, Graduate Student Association, University at Buffalo, State University of New York Additional Honors & Awards MDRF - Principal Investigator Grant (2010- 2011) \nMark Diamond Research Fund, Graduate Student Association, University at Buffalo, State University of New York Additional Honors & Awards MDRF - Principal Investigator Grant (2010- 2011) \nMark Diamond Research Fund, Graduate Student Association, University at Buffalo, State University of New York ", "Experience NVM Process Integration Engineer Intel Corporation October 2012  – Present (2 years 11 months) Boise, Idaho Area Next generation non-volatile memory (3D XPoint) cell and materials process integration Doctoral Student/Graduate Research Assistant University of Illinois at Urbana-Champaign August 2006  –  September 2012  (6 years 2 months) Urbana-Champaign, Illinois Area NVM Process Integration Engineer Intel Corporation October 2012  – Present (2 years 11 months) Boise, Idaho Area Next generation non-volatile memory (3D XPoint) cell and materials process integration NVM Process Integration Engineer Intel Corporation October 2012  – Present (2 years 11 months) Boise, Idaho Area Next generation non-volatile memory (3D XPoint) cell and materials process integration Doctoral Student/Graduate Research Assistant University of Illinois at Urbana-Champaign August 2006  –  September 2012  (6 years 2 months) Urbana-Champaign, Illinois Area Doctoral Student/Graduate Research Assistant University of Illinois at Urbana-Champaign August 2006  –  September 2012  (6 years 2 months) Urbana-Champaign, Illinois Area Skills Microfabrication Matlab Nanotechnology Photolithography Spectroscopy Microscopy Experimentation Physics Simulations CVD Sputtering Skills  Microfabrication Matlab Nanotechnology Photolithography Spectroscopy Microscopy Experimentation Physics Simulations CVD Sputtering Microfabrication Matlab Nanotechnology Photolithography Spectroscopy Microscopy Experimentation Physics Simulations CVD Sputtering Microfabrication Matlab Nanotechnology Photolithography Spectroscopy Microscopy Experimentation Physics Simulations CVD Sputtering Education University of Illinois at Urbana-Champaign Ph.D.,  Materials Science & Engineering 2006  – 2012 Georgia Institute of Technology B.S. with Highest Honor,  Materials Science & Engineering 2003  – 2006 Delhi Public School, Vasant Kunj 1989  – 2003 University of Illinois at Urbana-Champaign Ph.D.,  Materials Science & Engineering 2006  – 2012 University of Illinois at Urbana-Champaign Ph.D.,  Materials Science & Engineering 2006  – 2012 University of Illinois at Urbana-Champaign Ph.D.,  Materials Science & Engineering 2006  – 2012 Georgia Institute of Technology B.S. with Highest Honor,  Materials Science & Engineering 2003  – 2006 Georgia Institute of Technology B.S. with Highest Honor,  Materials Science & Engineering 2003  – 2006 Georgia Institute of Technology B.S. with Highest Honor,  Materials Science & Engineering 2003  – 2006 Delhi Public School, Vasant Kunj 1989  – 2003 Delhi Public School, Vasant Kunj 1989  – 2003 Delhi Public School, Vasant Kunj 1989  – 2003 ", "Experience PTD Sr. Process Integration Engineer Intel Corporation September 2013  – Present (2 years) Portland, Oregon Area Sub-10nm front-end technology pathfinding and process integration. PTD Integration Yield Engineer Intel Corporation September 2012  –  September 2013  (1 year 1 month) Portland, Oregon Area Logic fault isolation and low yield analysis of sub-22nm CPU and SoC product process technology integration and development. Graduate Research Assistant University of Florida August 2007  –  August 2012  (5 years 1 month) Gainesville, Florida Area Investigation of strain effects on electronic and optical properties of silicon, germanium and III-V nanoscale UTB and nanowires. \n \n- Stress effects on non-planar silicon FinFETs and spatially confined nanowires \n \n-Uniaxial stress effects on electron mobility in silicon inversion layers at room and low temperature \n \n-Uniaxial stress effects on quasi-ballistic transport in nanoscale planar MOSFETs \n \n-Uniaxial stress effects on AlGaN/GaN HEMT trap generation and reliability Device/Process Integration Engineer - Intern SEMATECH June 2010  –  May 2011  (1 year) Albany, New York Area Front End Processes - Emerging Technologies and Non-planar Silicon \n \n– Conducted experimental and theoretical investigation of carrier transport and strain effects on Si and SiGe FinFETs and Nanowires \n \n– Suggested FinFET test wafers with fin doping and different gate-stack splits to investigate the reasons of comparable electron transport in straight and rotated devices \n \n– Initiated the development of doped fin and nanowire FET processes on conventional and rotated (100) and (110) SOI wafers for investigation of the optimum non-planar CMOS integration scheme at and beyond 22nm \n \n– Developed and lead/co-lead projects on investigation of photoluminescence of ultra-thin-body silicon and raman characterization of external mechanical bending stress on planar, fin and nanowire structures Intern Engineer - Electrical Eymir Muhendislik Ltd. June 2006  –  September 2006  (4 months) Design of a hangar level test baseline for Chelton VHF Omnidirectional Range Direction Finder Antenna System of Cougar helicopters Intern Engineer - Electrical Aselsan June 2005  –  July 2005  (2 months) CAD Design and implementation of 50Ohm source-load matching lossless VHF amplifier for front-end of a superheterodyne transceiver PTD Sr. Process Integration Engineer Intel Corporation September 2013  – Present (2 years) Portland, Oregon Area Sub-10nm front-end technology pathfinding and process integration. PTD Sr. Process Integration Engineer Intel Corporation September 2013  – Present (2 years) Portland, Oregon Area Sub-10nm front-end technology pathfinding and process integration. PTD Integration Yield Engineer Intel Corporation September 2012  –  September 2013  (1 year 1 month) Portland, Oregon Area Logic fault isolation and low yield analysis of sub-22nm CPU and SoC product process technology integration and development. PTD Integration Yield Engineer Intel Corporation September 2012  –  September 2013  (1 year 1 month) Portland, Oregon Area Logic fault isolation and low yield analysis of sub-22nm CPU and SoC product process technology integration and development. Graduate Research Assistant University of Florida August 2007  –  August 2012  (5 years 1 month) Gainesville, Florida Area Investigation of strain effects on electronic and optical properties of silicon, germanium and III-V nanoscale UTB and nanowires. \n \n- Stress effects on non-planar silicon FinFETs and spatially confined nanowires \n \n-Uniaxial stress effects on electron mobility in silicon inversion layers at room and low temperature \n \n-Uniaxial stress effects on quasi-ballistic transport in nanoscale planar MOSFETs \n \n-Uniaxial stress effects on AlGaN/GaN HEMT trap generation and reliability Graduate Research Assistant University of Florida August 2007  –  August 2012  (5 years 1 month) Gainesville, Florida Area Investigation of strain effects on electronic and optical properties of silicon, germanium and III-V nanoscale UTB and nanowires. \n \n- Stress effects on non-planar silicon FinFETs and spatially confined nanowires \n \n-Uniaxial stress effects on electron mobility in silicon inversion layers at room and low temperature \n \n-Uniaxial stress effects on quasi-ballistic transport in nanoscale planar MOSFETs \n \n-Uniaxial stress effects on AlGaN/GaN HEMT trap generation and reliability Device/Process Integration Engineer - Intern SEMATECH June 2010  –  May 2011  (1 year) Albany, New York Area Front End Processes - Emerging Technologies and Non-planar Silicon \n \n– Conducted experimental and theoretical investigation of carrier transport and strain effects on Si and SiGe FinFETs and Nanowires \n \n– Suggested FinFET test wafers with fin doping and different gate-stack splits to investigate the reasons of comparable electron transport in straight and rotated devices \n \n– Initiated the development of doped fin and nanowire FET processes on conventional and rotated (100) and (110) SOI wafers for investigation of the optimum non-planar CMOS integration scheme at and beyond 22nm \n \n– Developed and lead/co-lead projects on investigation of photoluminescence of ultra-thin-body silicon and raman characterization of external mechanical bending stress on planar, fin and nanowire structures Device/Process Integration Engineer - Intern SEMATECH June 2010  –  May 2011  (1 year) Albany, New York Area Front End Processes - Emerging Technologies and Non-planar Silicon \n \n– Conducted experimental and theoretical investigation of carrier transport and strain effects on Si and SiGe FinFETs and Nanowires \n \n– Suggested FinFET test wafers with fin doping and different gate-stack splits to investigate the reasons of comparable electron transport in straight and rotated devices \n \n– Initiated the development of doped fin and nanowire FET processes on conventional and rotated (100) and (110) SOI wafers for investigation of the optimum non-planar CMOS integration scheme at and beyond 22nm \n \n– Developed and lead/co-lead projects on investigation of photoluminescence of ultra-thin-body silicon and raman characterization of external mechanical bending stress on planar, fin and nanowire structures Intern Engineer - Electrical Eymir Muhendislik Ltd. June 2006  –  September 2006  (4 months) Design of a hangar level test baseline for Chelton VHF Omnidirectional Range Direction Finder Antenna System of Cougar helicopters Intern Engineer - Electrical Eymir Muhendislik Ltd. June 2006  –  September 2006  (4 months) Design of a hangar level test baseline for Chelton VHF Omnidirectional Range Direction Finder Antenna System of Cougar helicopters Intern Engineer - Electrical Aselsan June 2005  –  July 2005  (2 months) CAD Design and implementation of 50Ohm source-load matching lossless VHF amplifier for front-end of a superheterodyne transceiver Intern Engineer - Electrical Aselsan June 2005  –  July 2005  (2 months) CAD Design and implementation of 50Ohm source-load matching lossless VHF amplifier for front-end of a superheterodyne transceiver Languages   Skills CMOS Semiconductors Matlab Characterization IC Device Physics FinFETs Nanowires AlGaN/GaN HEMTs Quasi-ballistic... Strained Semiconductor Ultra-thin-body Silicon Silicon Fault Isolation Low Yield Analysis Electronics Physics Photolithography Nanotechnology Simulations Process Integration SoC Device Characterization Design of Experiments See 9+     See less Skills  CMOS Semiconductors Matlab Characterization IC Device Physics FinFETs Nanowires AlGaN/GaN HEMTs Quasi-ballistic... Strained Semiconductor Ultra-thin-body Silicon Silicon Fault Isolation Low Yield Analysis Electronics Physics Photolithography Nanotechnology Simulations Process Integration SoC Device Characterization Design of Experiments See 9+     See less CMOS Semiconductors Matlab Characterization IC Device Physics FinFETs Nanowires AlGaN/GaN HEMTs Quasi-ballistic... Strained Semiconductor Ultra-thin-body Silicon Silicon Fault Isolation Low Yield Analysis Electronics Physics Photolithography Nanotechnology Simulations Process Integration SoC Device Characterization Design of Experiments See 9+     See less CMOS Semiconductors Matlab Characterization IC Device Physics FinFETs Nanowires AlGaN/GaN HEMTs Quasi-ballistic... Strained Semiconductor Ultra-thin-body Silicon Silicon Fault Isolation Low Yield Analysis Electronics Physics Photolithography Nanotechnology Simulations Process Integration SoC Device Characterization Design of Experiments See 9+     See less Education University of Florida Ph.D.,  Electrical & Computer Engineering , 3.95 2007  – 2012 Dissertation Topic: \"Strain effects in Low-dimensional Silicon MOS and AlGaN/GaN HEMT Devices\" \n \nAdvisers: Prof. Toshikazu Nishida and Prof. Scott E. Thompson University of Florida M.Sc,  Electrical & Computer Engineering , 3.95 2007  – 2009 Adviser: Prof. Scott E. Thompson Orta Doğu Teknik Üniversitesi B.Sc,  Electrical and Electronics Engineering , 3.37 2002  – 2007 University of Florida Ph.D.,  Electrical & Computer Engineering , 3.95 2007  – 2012 Dissertation Topic: \"Strain effects in Low-dimensional Silicon MOS and AlGaN/GaN HEMT Devices\" \n \nAdvisers: Prof. Toshikazu Nishida and Prof. Scott E. Thompson University of Florida Ph.D.,  Electrical & Computer Engineering , 3.95 2007  – 2012 Dissertation Topic: \"Strain effects in Low-dimensional Silicon MOS and AlGaN/GaN HEMT Devices\" \n \nAdvisers: Prof. Toshikazu Nishida and Prof. Scott E. Thompson University of Florida Ph.D.,  Electrical & Computer Engineering , 3.95 2007  – 2012 Dissertation Topic: \"Strain effects in Low-dimensional Silicon MOS and AlGaN/GaN HEMT Devices\" \n \nAdvisers: Prof. Toshikazu Nishida and Prof. Scott E. Thompson University of Florida M.Sc,  Electrical & Computer Engineering , 3.95 2007  – 2009 Adviser: Prof. Scott E. Thompson University of Florida M.Sc,  Electrical & Computer Engineering , 3.95 2007  – 2009 Adviser: Prof. Scott E. Thompson University of Florida M.Sc,  Electrical & Computer Engineering , 3.95 2007  – 2009 Adviser: Prof. Scott E. Thompson Orta Doğu Teknik Üniversitesi B.Sc,  Electrical and Electronics Engineering , 3.37 2002  – 2007 Orta Doğu Teknik Üniversitesi B.Sc,  Electrical and Electronics Engineering , 3.37 2002  – 2007 Orta Doğu Teknik Üniversitesi B.Sc,  Electrical and Electronics Engineering , 3.37 2002  – 2007 Honors & Awards ", "Experience Yield Analysis Engineer Samsung February 2015  – Present (7 months) Austin, Texas Area Yield Analysis Engineer -- monitor yield for one major HVM customer. Track process improvements, correlate with yield, determine isolated low yield events and systemic impacts on yield in the line. Make process recommendations and provide data driven decisions on tool qualifications, process changes, and marginalities in the line. Yield Analysis Engineer Samsung Austin Semiconductor February 2015  – Present (7 months) Process Engineer Sumika Electronic Materials April 2007  –  January 2015  (7 years 10 months) I am the owner of two Aixtron metal organic chemical vapor deposition (MOCVD) reactors. I am responsible for process development and qualification of III-arsenide and phosphide processes for electronic and optoelectronic devices.  \n \nSpecifically, my responsibilities include technical review and validation, resource scheduling, process validation, troubleshooting process-related defect and electronic marginalities for yield improvement. \n \nI was owner of two solar cell projects on Veeco reactors, developing novel multi-band gap materials, capable of absorbing broad spectra light. \n \nIn order to better track performance of Veeco reactors, I created a database in JMP for all site Veeco reactors by writing macros in Excel to automatically summarize run data and enable correlation of ex-situ characterization data with all reactor parameters and equipment lifetime trackers. I trained all Veeco engineering and technical staff to effectively use JMP to establish correlations, track trends, and control chart data. YA engineer Samsung 2015  –  2015  (less than a year) Process Integration Engineer Intel Corporation May 2005  –  April 2007  (2 years) Process Integration Engineer Intel Corporation 2005  –  2007  (2 years) I was a leader for a cross functional-area group of yield and process engineers. This team was responsible for the process health and improvement of all toolsets within the salicide-contact module. My individual responsibilities included ensuring tools and processes were targeted correctly, coordinating and driving process changes through all up- and down-stream impacted modules, and ensuring process impacts were correctly accounted for in yield and performance models.  \n \nOther responsibilities included process development and implementation, process and tool qualifications, troubleshooting integrated process impactors, defect reduction, process targeting, and process matching for the salicide and contact modules. Specifically, my duties included correlating tool level metrology signals to Etest/Yield data in order to model process health and predict yield, technical review and validation of all process changes. Yield Analysis Engineer Samsung February 2015  – Present (7 months) Austin, Texas Area Yield Analysis Engineer -- monitor yield for one major HVM customer. Track process improvements, correlate with yield, determine isolated low yield events and systemic impacts on yield in the line. Make process recommendations and provide data driven decisions on tool qualifications, process changes, and marginalities in the line. Yield Analysis Engineer Samsung February 2015  – Present (7 months) Austin, Texas Area Yield Analysis Engineer -- monitor yield for one major HVM customer. Track process improvements, correlate with yield, determine isolated low yield events and systemic impacts on yield in the line. Make process recommendations and provide data driven decisions on tool qualifications, process changes, and marginalities in the line. Yield Analysis Engineer Samsung Austin Semiconductor February 2015  – Present (7 months) Yield Analysis Engineer Samsung Austin Semiconductor February 2015  – Present (7 months) Process Engineer Sumika Electronic Materials April 2007  –  January 2015  (7 years 10 months) I am the owner of two Aixtron metal organic chemical vapor deposition (MOCVD) reactors. I am responsible for process development and qualification of III-arsenide and phosphide processes for electronic and optoelectronic devices.  \n \nSpecifically, my responsibilities include technical review and validation, resource scheduling, process validation, troubleshooting process-related defect and electronic marginalities for yield improvement. \n \nI was owner of two solar cell projects on Veeco reactors, developing novel multi-band gap materials, capable of absorbing broad spectra light. \n \nIn order to better track performance of Veeco reactors, I created a database in JMP for all site Veeco reactors by writing macros in Excel to automatically summarize run data and enable correlation of ex-situ characterization data with all reactor parameters and equipment lifetime trackers. I trained all Veeco engineering and technical staff to effectively use JMP to establish correlations, track trends, and control chart data. Process Engineer Sumika Electronic Materials April 2007  –  January 2015  (7 years 10 months) I am the owner of two Aixtron metal organic chemical vapor deposition (MOCVD) reactors. I am responsible for process development and qualification of III-arsenide and phosphide processes for electronic and optoelectronic devices.  \n \nSpecifically, my responsibilities include technical review and validation, resource scheduling, process validation, troubleshooting process-related defect and electronic marginalities for yield improvement. \n \nI was owner of two solar cell projects on Veeco reactors, developing novel multi-band gap materials, capable of absorbing broad spectra light. \n \nIn order to better track performance of Veeco reactors, I created a database in JMP for all site Veeco reactors by writing macros in Excel to automatically summarize run data and enable correlation of ex-situ characterization data with all reactor parameters and equipment lifetime trackers. I trained all Veeco engineering and technical staff to effectively use JMP to establish correlations, track trends, and control chart data. YA engineer Samsung 2015  –  2015  (less than a year) YA engineer Samsung 2015  –  2015  (less than a year) Process Integration Engineer Intel Corporation May 2005  –  April 2007  (2 years) Process Integration Engineer Intel Corporation May 2005  –  April 2007  (2 years) Process Integration Engineer Intel Corporation 2005  –  2007  (2 years) I was a leader for a cross functional-area group of yield and process engineers. This team was responsible for the process health and improvement of all toolsets within the salicide-contact module. My individual responsibilities included ensuring tools and processes were targeted correctly, coordinating and driving process changes through all up- and down-stream impacted modules, and ensuring process impacts were correctly accounted for in yield and performance models.  \n \nOther responsibilities included process development and implementation, process and tool qualifications, troubleshooting integrated process impactors, defect reduction, process targeting, and process matching for the salicide and contact modules. Specifically, my duties included correlating tool level metrology signals to Etest/Yield data in order to model process health and predict yield, technical review and validation of all process changes. Process Integration Engineer Intel Corporation 2005  –  2007  (2 years) I was a leader for a cross functional-area group of yield and process engineers. This team was responsible for the process health and improvement of all toolsets within the salicide-contact module. My individual responsibilities included ensuring tools and processes were targeted correctly, coordinating and driving process changes through all up- and down-stream impacted modules, and ensuring process impacts were correctly accounted for in yield and performance models.  \n \nOther responsibilities included process development and implementation, process and tool qualifications, troubleshooting integrated process impactors, defect reduction, process targeting, and process matching for the salicide and contact modules. Specifically, my duties included correlating tool level metrology signals to Etest/Yield data in order to model process health and predict yield, technical review and validation of all process changes. Languages English Native or bilingual proficiency Portuguese Limited working proficiency English Native or bilingual proficiency Portuguese Limited working proficiency English Native or bilingual proficiency Portuguese Limited working proficiency Native or bilingual proficiency Limited working proficiency Skills Design of Experiments Thin Films Characterization R&D Process Engineering Engineering Management Manufacturing Engineering Product Engineering Semiconductors Semiconductor Industry Continuous Improvement Chemical Engineering Silicon Cross-functional Team... SPC Failure Analysis Metrology See 3+     See less Skills  Design of Experiments Thin Films Characterization R&D Process Engineering Engineering Management Manufacturing Engineering Product Engineering Semiconductors Semiconductor Industry Continuous Improvement Chemical Engineering Silicon Cross-functional Team... SPC Failure Analysis Metrology See 3+     See less Design of Experiments Thin Films Characterization R&D Process Engineering Engineering Management Manufacturing Engineering Product Engineering Semiconductors Semiconductor Industry Continuous Improvement Chemical Engineering Silicon Cross-functional Team... SPC Failure Analysis Metrology See 3+     See less Design of Experiments Thin Films Characterization R&D Process Engineering Engineering Management Manufacturing Engineering Product Engineering Semiconductors Semiconductor Industry Continuous Improvement Chemical Engineering Silicon Cross-functional Team... SPC Failure Analysis Metrology See 3+     See less Education University of Florida Doctor of Philosophy (Ph.D.),  Materials Science and Engineering 1998  – 2004 University of Florida Master's degree,  Chemical Engineering 1999  – 2000 Washington and Lee University Bachelor of Science (BS),  Chemistry-Engineering 1994  – 1998 University of Florida Doctor of Philosophy (Ph.D.),  Materials Science and Engineering 1998  – 2004 University of Florida Doctor of Philosophy (Ph.D.),  Materials Science and Engineering 1998  – 2004 University of Florida Doctor of Philosophy (Ph.D.),  Materials Science and Engineering 1998  – 2004 University of Florida Master's degree,  Chemical Engineering 1999  – 2000 University of Florida Master's degree,  Chemical Engineering 1999  – 2000 University of Florida Master's degree,  Chemical Engineering 1999  – 2000 Washington and Lee University Bachelor of Science (BS),  Chemistry-Engineering 1994  – 1998 Washington and Lee University Bachelor of Science (BS),  Chemistry-Engineering 1994  – 1998 Washington and Lee University Bachelor of Science (BS),  Chemistry-Engineering 1994  – 1998 ", "Experience Process Integration Engineer Intel Corporation April 2015  – Present (5 months) Hillsboro, Oregon Process flow development for next-generation semiconductor technology. Senior Materials Analysis Engineer Intel Corporation June 2012  –  April 2015  (2 years 11 months) Hillsboro, Oregon Analytical support for next-generation semiconductor technology development. Graduate Research Associate Stanford-IBM Spintronic Science and Applications Center June 2006  –  June 2012  (6 years 1 month) Silicon Valley, Ca Conducted thesis work on the thin film growth, device fabrication, characterization, and mathematical modeling of vanadium oxide (V2O3) nanostructures toward better understanding the detailed nature of field effect switching in materials with highly correlated electrons. A member of the Stanford-IBM SpinAps collaboration. \n \nFurther contributions to the laboratory: \n- Maintained and operated a state of the art, 30-source molecular beam epitaxy tool for the deposition of novel oxide and nitride films \n- Repaired and maintained an x-ray photoelectron spectroscopy tool \n- Developed Labview control and automation software to measure conductivity and carrier densities at cryogenic temperatures \n- Designed and constructed a heavily used magneto-optic Kerr measurement tool for high throughput MRAM and Racetrack Memory materials development \n- Lithography, fabrication and testing of magnetic tunnel junctions with nitrogen-doped MgO tunnel barriers Undergraduate Research Assistant NCSU Dept. of Physics May 2002  –  May 2005  (3 years 1 month) Raleigh, NC Area of Research: Astrophysics Simulations Process Integration Engineer Intel Corporation April 2015  – Present (5 months) Hillsboro, Oregon Process flow development for next-generation semiconductor technology. Process Integration Engineer Intel Corporation April 2015  – Present (5 months) Hillsboro, Oregon Process flow development for next-generation semiconductor technology. Senior Materials Analysis Engineer Intel Corporation June 2012  –  April 2015  (2 years 11 months) Hillsboro, Oregon Analytical support for next-generation semiconductor technology development. Senior Materials Analysis Engineer Intel Corporation June 2012  –  April 2015  (2 years 11 months) Hillsboro, Oregon Analytical support for next-generation semiconductor technology development. Graduate Research Associate Stanford-IBM Spintronic Science and Applications Center June 2006  –  June 2012  (6 years 1 month) Silicon Valley, Ca Conducted thesis work on the thin film growth, device fabrication, characterization, and mathematical modeling of vanadium oxide (V2O3) nanostructures toward better understanding the detailed nature of field effect switching in materials with highly correlated electrons. A member of the Stanford-IBM SpinAps collaboration. \n \nFurther contributions to the laboratory: \n- Maintained and operated a state of the art, 30-source molecular beam epitaxy tool for the deposition of novel oxide and nitride films \n- Repaired and maintained an x-ray photoelectron spectroscopy tool \n- Developed Labview control and automation software to measure conductivity and carrier densities at cryogenic temperatures \n- Designed and constructed a heavily used magneto-optic Kerr measurement tool for high throughput MRAM and Racetrack Memory materials development \n- Lithography, fabrication and testing of magnetic tunnel junctions with nitrogen-doped MgO tunnel barriers Graduate Research Associate Stanford-IBM Spintronic Science and Applications Center June 2006  –  June 2012  (6 years 1 month) Silicon Valley, Ca Conducted thesis work on the thin film growth, device fabrication, characterization, and mathematical modeling of vanadium oxide (V2O3) nanostructures toward better understanding the detailed nature of field effect switching in materials with highly correlated electrons. A member of the Stanford-IBM SpinAps collaboration. \n \nFurther contributions to the laboratory: \n- Maintained and operated a state of the art, 30-source molecular beam epitaxy tool for the deposition of novel oxide and nitride films \n- Repaired and maintained an x-ray photoelectron spectroscopy tool \n- Developed Labview control and automation software to measure conductivity and carrier densities at cryogenic temperatures \n- Designed and constructed a heavily used magneto-optic Kerr measurement tool for high throughput MRAM and Racetrack Memory materials development \n- Lithography, fabrication and testing of magnetic tunnel junctions with nitrogen-doped MgO tunnel barriers Undergraduate Research Assistant NCSU Dept. of Physics May 2002  –  May 2005  (3 years 1 month) Raleigh, NC Area of Research: Astrophysics Simulations Undergraduate Research Assistant NCSU Dept. of Physics May 2002  –  May 2005  (3 years 1 month) Raleigh, NC Area of Research: Astrophysics Simulations Skills Thin Films Matlab Physics Nanotechnology Materials Science Characterization Semiconductors R&D Labview C++ Mathematical Modeling Mathematica Failure Analysis Python Applied Mathematics Java Simulations See 2+     See less Skills  Thin Films Matlab Physics Nanotechnology Materials Science Characterization Semiconductors R&D Labview C++ Mathematical Modeling Mathematica Failure Analysis Python Applied Mathematics Java Simulations See 2+     See less Thin Films Matlab Physics Nanotechnology Materials Science Characterization Semiconductors R&D Labview C++ Mathematical Modeling Mathematica Failure Analysis Python Applied Mathematics Java Simulations See 2+     See less Thin Films Matlab Physics Nanotechnology Materials Science Characterization Semiconductors R&D Labview C++ Mathematical Modeling Mathematica Failure Analysis Python Applied Mathematics Java Simulations See 2+     See less Education Stanford University Ph. D.,  Applied Physics 2005  – 2012 Stanford University M.S.,  Applied Physics 2005  – 2007 North Carolina State University B.S.,  Physics 2001  – 2005 North Carolina State University B.S.,  Applied Mathematics 2001  – 2005 North Carolina School of Science and Mathematics Stanford University Ph. D.,  Applied Physics 2005  – 2012 Stanford University Ph. D.,  Applied Physics 2005  – 2012 Stanford University Ph. D.,  Applied Physics 2005  – 2012 Stanford University M.S.,  Applied Physics 2005  – 2007 Stanford University M.S.,  Applied Physics 2005  – 2007 Stanford University M.S.,  Applied Physics 2005  – 2007 North Carolina State University B.S.,  Physics 2001  – 2005 North Carolina State University B.S.,  Physics 2001  – 2005 North Carolina State University B.S.,  Physics 2001  – 2005 North Carolina State University B.S.,  Applied Mathematics 2001  – 2005 North Carolina State University B.S.,  Applied Mathematics 2001  – 2005 North Carolina State University B.S.,  Applied Mathematics 2001  – 2005 North Carolina School of Science and Mathematics North Carolina School of Science and Mathematics North Carolina School of Science and Mathematics Honors & Awards Additional Honors & Awards - Stanford-IBM SpinAps Scholar (2006-2012) \n- Barry M. Goldwater Scholarship (2003-2005) \n- Roy H. Park Scholarship (2001-2005) \n- Rodney I. McCormick Research Award (2005) \n- NCSU College of Physical and Mathematical Sciences Research Award (2005) Additional Honors & Awards - Stanford-IBM SpinAps Scholar (2006-2012) \n- Barry M. Goldwater Scholarship (2003-2005) \n- Roy H. Park Scholarship (2001-2005) \n- Rodney I. McCormick Research Award (2005) \n- NCSU College of Physical and Mathematical Sciences Research Award (2005) Additional Honors & Awards - Stanford-IBM SpinAps Scholar (2006-2012) \n- Barry M. Goldwater Scholarship (2003-2005) \n- Roy H. Park Scholarship (2001-2005) \n- Rodney I. McCormick Research Award (2005) \n- NCSU College of Physical and Mathematical Sciences Research Award (2005) Additional Honors & Awards - Stanford-IBM SpinAps Scholar (2006-2012) \n- Barry M. Goldwater Scholarship (2003-2005) \n- Roy H. Park Scholarship (2001-2005) \n- Rodney I. McCormick Research Award (2005) \n- NCSU College of Physical and Mathematical Sciences Research Award (2005) ", "Experience Technology Development Process Integration Engineer Intel Corporation February 2013  – Present (2 years 7 months) Portland, Oregon Area Process Integration Engineer in Intel's Process Technology Development Group. Technology Development Device Engineer Intel Corporation March 2011  –  February 2013  (2 years) Portland, Oregon Area Device Engineer in Intel's Process Technology Development group Graduate Student Researcher UC Berkeley August 2004  –  December 2010  (6 years 5 months) Semiconductor Transisor Design Graduate Intern, Front End Processing SEMATECH January 2007  –  December 2007  (1 year) Graduate Intern, Circuits Research Intel May 2006  –  August 2006  (4 months) Technology Development Process Integration Engineer Intel Corporation February 2013  – Present (2 years 7 months) Portland, Oregon Area Process Integration Engineer in Intel's Process Technology Development Group. Technology Development Process Integration Engineer Intel Corporation February 2013  – Present (2 years 7 months) Portland, Oregon Area Process Integration Engineer in Intel's Process Technology Development Group. Technology Development Device Engineer Intel Corporation March 2011  –  February 2013  (2 years) Portland, Oregon Area Device Engineer in Intel's Process Technology Development group Technology Development Device Engineer Intel Corporation March 2011  –  February 2013  (2 years) Portland, Oregon Area Device Engineer in Intel's Process Technology Development group Graduate Student Researcher UC Berkeley August 2004  –  December 2010  (6 years 5 months) Semiconductor Transisor Design Graduate Student Researcher UC Berkeley August 2004  –  December 2010  (6 years 5 months) Semiconductor Transisor Design Graduate Intern, Front End Processing SEMATECH January 2007  –  December 2007  (1 year) Graduate Intern, Front End Processing SEMATECH January 2007  –  December 2007  (1 year) Graduate Intern, Circuits Research Intel May 2006  –  August 2006  (4 months) Graduate Intern, Circuits Research Intel May 2006  –  August 2006  (4 months) Education University of California, Berkeley PhD,  Electrical Engineering 2004  – 2010 University of Illinois at Urbana-Champaign BS,  Electrical Engineering University of California, Berkeley PhD,  Electrical Engineering 2004  – 2010 University of California, Berkeley PhD,  Electrical Engineering 2004  – 2010 University of California, Berkeley PhD,  Electrical Engineering 2004  – 2010 University of Illinois at Urbana-Champaign BS,  Electrical Engineering University of Illinois at Urbana-Champaign BS,  Electrical Engineering University of Illinois at Urbana-Champaign BS,  Electrical Engineering Honors & Awards Additional Honors & Awards SRC Inventor Recognition Award for Low Voltage ICs Using Hetero-Tunneling Transistor (March 2009) \nSRC Inventor Recognition Award for Tunneling Transistor Structure (March 2009) \nCalifornia Nanotechnology Fellowship (UC Berkeley, 2004-2005) \nBronze Tablet (top 2% of the school of engineering UIUC) \nOmron Electrical Engineering Scholarship (2003-2004) Additional Honors & Awards SRC Inventor Recognition Award for Low Voltage ICs Using Hetero-Tunneling Transistor (March 2009) \nSRC Inventor Recognition Award for Tunneling Transistor Structure (March 2009) \nCalifornia Nanotechnology Fellowship (UC Berkeley, 2004-2005) \nBronze Tablet (top 2% of the school of engineering UIUC) \nOmron Electrical Engineering Scholarship (2003-2004) Additional Honors & Awards SRC Inventor Recognition Award for Low Voltage ICs Using Hetero-Tunneling Transistor (March 2009) \nSRC Inventor Recognition Award for Tunneling Transistor Structure (March 2009) \nCalifornia Nanotechnology Fellowship (UC Berkeley, 2004-2005) \nBronze Tablet (top 2% of the school of engineering UIUC) \nOmron Electrical Engineering Scholarship (2003-2004) Additional Honors & Awards SRC Inventor Recognition Award for Low Voltage ICs Using Hetero-Tunneling Transistor (March 2009) \nSRC Inventor Recognition Award for Tunneling Transistor Structure (March 2009) \nCalifornia Nanotechnology Fellowship (UC Berkeley, 2004-2005) \nBronze Tablet (top 2% of the school of engineering UIUC) \nOmron Electrical Engineering Scholarship (2003-2004) ", "Experience AZFSM 14nm BEOL Process Integration Engineer Intel Corporation June 2014  – Present (1 year 3 months) FAB32, Chandler, AZ, USA Responsible for process transfer of 14nm SoC Technology from TD to HVM. BEOL Process Integration Engineer Intel Corporation June 2012  –  June 2014  (2 years 1 month) Kiriyat Gat, Israel 22nm SoC technology transfer from Technology Develpment to High Volume Manufacturing (HVM). Qualification and HVM Ramp. Complex problems solving accross different modules and segments. Technical Expert Backend Wet Etch Area FAB28 Intel Electronics April 2010  –  June 2012  (2 years 3 months) Process transfer and equipment qualification for 22nm process node. Specialization on single wafer clean tools Backend Wet Etch Engineer (on assignment) Intel Corporation April 2011  –  August 2011  (5 months) Hillsboro, Oregon, USA 22nm technology node process transfer from development to High Volume Manufacturing Facility - F28 F32 Backend Wet Etch Process Engineer Intel Corporation October 2010  –  April 2011  (7 months) Chandler, Arizona, USA Worked as Backend Wet Etch Process and Eqioment Engineer at 32nm technology node. Specialization in Single Wafer Clean Equipment. Worked at FAB32 - Intel Facility in Chandler, AZ Sr. Process Engineer FAB28 Intel Electronics October 2006  –  October 2010  (4 years 1 month) Transfer from Development to High Volume Manufacturing (HVM) Logic 45nm manufacturing process. Specialization in Back End Cleans process and equipment.  \nNew backend clean equipment qualification. \nComplex problems solving from Process and Equipment perspectives.  \nData analysis and database operation. Leading cost reduction and cost savings problem solving and projects. Product Manager Hewlett Packard Industrial Printing Division (former Scitex Vision) November 2004  –  October 2006  (2 years) Managing Engineering aspects in Industrial Wide Format Digital Printing Equipment. Cost reduction Projects. Transfer from R&D to Manufacturing. Mechanical design improvements Mechanical Engineer SA Industries March 2004  –  November 2004  (9 months) Worked as subcontractor for IAI Elta on number of projects. Mechanical Design. Prototype Manufacturing and Test. Documentation Preparation. Mechanical Engineer CME (Caesaria Medical Electronics) March 2002  –  March 2004  (2 years 1 month) Caesarea Industrial Area, Israel Mechanical Design, Production Management and People Management Academic Officer IDF 1997  –  2002  (5 years) Project management in IDF in different discipline AZFSM 14nm BEOL Process Integration Engineer Intel Corporation June 2014  – Present (1 year 3 months) FAB32, Chandler, AZ, USA Responsible for process transfer of 14nm SoC Technology from TD to HVM. AZFSM 14nm BEOL Process Integration Engineer Intel Corporation June 2014  – Present (1 year 3 months) FAB32, Chandler, AZ, USA Responsible for process transfer of 14nm SoC Technology from TD to HVM. BEOL Process Integration Engineer Intel Corporation June 2012  –  June 2014  (2 years 1 month) Kiriyat Gat, Israel 22nm SoC technology transfer from Technology Develpment to High Volume Manufacturing (HVM). Qualification and HVM Ramp. Complex problems solving accross different modules and segments. BEOL Process Integration Engineer Intel Corporation June 2012  –  June 2014  (2 years 1 month) Kiriyat Gat, Israel 22nm SoC technology transfer from Technology Develpment to High Volume Manufacturing (HVM). Qualification and HVM Ramp. Complex problems solving accross different modules and segments. Technical Expert Backend Wet Etch Area FAB28 Intel Electronics April 2010  –  June 2012  (2 years 3 months) Process transfer and equipment qualification for 22nm process node. Specialization on single wafer clean tools Technical Expert Backend Wet Etch Area FAB28 Intel Electronics April 2010  –  June 2012  (2 years 3 months) Process transfer and equipment qualification for 22nm process node. Specialization on single wafer clean tools Backend Wet Etch Engineer (on assignment) Intel Corporation April 2011  –  August 2011  (5 months) Hillsboro, Oregon, USA 22nm technology node process transfer from development to High Volume Manufacturing Facility - F28 Backend Wet Etch Engineer (on assignment) Intel Corporation April 2011  –  August 2011  (5 months) Hillsboro, Oregon, USA 22nm technology node process transfer from development to High Volume Manufacturing Facility - F28 F32 Backend Wet Etch Process Engineer Intel Corporation October 2010  –  April 2011  (7 months) Chandler, Arizona, USA Worked as Backend Wet Etch Process and Eqioment Engineer at 32nm technology node. Specialization in Single Wafer Clean Equipment. Worked at FAB32 - Intel Facility in Chandler, AZ F32 Backend Wet Etch Process Engineer Intel Corporation October 2010  –  April 2011  (7 months) Chandler, Arizona, USA Worked as Backend Wet Etch Process and Eqioment Engineer at 32nm technology node. Specialization in Single Wafer Clean Equipment. Worked at FAB32 - Intel Facility in Chandler, AZ Sr. Process Engineer FAB28 Intel Electronics October 2006  –  October 2010  (4 years 1 month) Transfer from Development to High Volume Manufacturing (HVM) Logic 45nm manufacturing process. Specialization in Back End Cleans process and equipment.  \nNew backend clean equipment qualification. \nComplex problems solving from Process and Equipment perspectives.  \nData analysis and database operation. Leading cost reduction and cost savings problem solving and projects. Sr. Process Engineer FAB28 Intel Electronics October 2006  –  October 2010  (4 years 1 month) Transfer from Development to High Volume Manufacturing (HVM) Logic 45nm manufacturing process. Specialization in Back End Cleans process and equipment.  \nNew backend clean equipment qualification. \nComplex problems solving from Process and Equipment perspectives.  \nData analysis and database operation. Leading cost reduction and cost savings problem solving and projects. Product Manager Hewlett Packard Industrial Printing Division (former Scitex Vision) November 2004  –  October 2006  (2 years) Managing Engineering aspects in Industrial Wide Format Digital Printing Equipment. Cost reduction Projects. Transfer from R&D to Manufacturing. Mechanical design improvements Product Manager Hewlett Packard Industrial Printing Division (former Scitex Vision) November 2004  –  October 2006  (2 years) Managing Engineering aspects in Industrial Wide Format Digital Printing Equipment. Cost reduction Projects. Transfer from R&D to Manufacturing. Mechanical design improvements Mechanical Engineer SA Industries March 2004  –  November 2004  (9 months) Worked as subcontractor for IAI Elta on number of projects. Mechanical Design. Prototype Manufacturing and Test. Documentation Preparation. Mechanical Engineer SA Industries March 2004  –  November 2004  (9 months) Worked as subcontractor for IAI Elta on number of projects. Mechanical Design. Prototype Manufacturing and Test. Documentation Preparation. Mechanical Engineer CME (Caesaria Medical Electronics) March 2002  –  March 2004  (2 years 1 month) Caesarea Industrial Area, Israel Mechanical Design, Production Management and People Management Mechanical Engineer CME (Caesaria Medical Electronics) March 2002  –  March 2004  (2 years 1 month) Caesarea Industrial Area, Israel Mechanical Design, Production Management and People Management Academic Officer IDF 1997  –  2002  (5 years) Project management in IDF in different discipline Academic Officer IDF 1997  –  2002  (5 years) Project management in IDF in different discipline Languages Russian Native or bilingual proficiency English Full professional proficiency Hebrew Native or bilingual proficiency Russian Native or bilingual proficiency English Full professional proficiency Hebrew Native or bilingual proficiency Russian Native or bilingual proficiency English Full professional proficiency Hebrew Native or bilingual proficiency Native or bilingual proficiency Full professional proficiency Native or bilingual proficiency Skills Engineering Problem Solving Semiconductors JMP Semiconductor... SPC DOE Process Transfer Design of Experiments Wet Chemical Etching Process Improvement Failure Analysis Characterization Etching Microelectronics Manufacturing Intel Data Analysis Electronics R&D Process Simulation Cross-functional Team... Silicon Semiconductor Industry Process Integration Testing Management Engineering Management Process Engineering Simulations Thin Films IC Optics Product Engineering Materials Science Product Management Product Development SoC Integration Metrology Project Management Matlab Lean Manufacturing Program Management Team Leadership See 30+     See less Skills  Engineering Problem Solving Semiconductors JMP Semiconductor... SPC DOE Process Transfer Design of Experiments Wet Chemical Etching Process Improvement Failure Analysis Characterization Etching Microelectronics Manufacturing Intel Data Analysis Electronics R&D Process Simulation Cross-functional Team... Silicon Semiconductor Industry Process Integration Testing Management Engineering Management Process Engineering Simulations Thin Films IC Optics Product Engineering Materials Science Product Management Product Development SoC Integration Metrology Project Management Matlab Lean Manufacturing Program Management Team Leadership See 30+     See less Engineering Problem Solving Semiconductors JMP Semiconductor... SPC DOE Process Transfer Design of Experiments Wet Chemical Etching Process Improvement Failure Analysis Characterization Etching Microelectronics Manufacturing Intel Data Analysis Electronics R&D Process Simulation Cross-functional Team... Silicon Semiconductor Industry Process Integration Testing Management Engineering Management Process Engineering Simulations Thin Films IC Optics Product Engineering Materials Science Product Management Product Development SoC Integration Metrology Project Management Matlab Lean Manufacturing Program Management Team Leadership See 30+     See less Engineering Problem Solving Semiconductors JMP Semiconductor... SPC DOE Process Transfer Design of Experiments Wet Chemical Etching Process Improvement Failure Analysis Characterization Etching Microelectronics Manufacturing Intel Data Analysis Electronics R&D Process Simulation Cross-functional Team... Silicon Semiconductor Industry Process Integration Testing Management Engineering Management Process Engineering Simulations Thin Films IC Optics Product Engineering Materials Science Product Management Product Development SoC Integration Metrology Project Management Matlab Lean Manufacturing Program Management Team Leadership See 30+     See less Education Ha'Universita Ha'Petuha MBA 2006  – 2010 Ha'Universita Ha'Petuha Diploma,  Computer Science 1999  – 2001 Technion - Israel Institute of Technology B.Sc.,  Mechanical Engineering 1993  – 1997 Activities and Societies:  Mechanical Design\nManufacturing Systems\nControl Systems Kiev Srednaya Shkola No. 100 General 1979  – 1987 Ha'Universita Ha'Petuha MBA 2006  – 2010 Ha'Universita Ha'Petuha MBA 2006  – 2010 Ha'Universita Ha'Petuha MBA 2006  – 2010 Ha'Universita Ha'Petuha Diploma,  Computer Science 1999  – 2001 Ha'Universita Ha'Petuha Diploma,  Computer Science 1999  – 2001 Ha'Universita Ha'Petuha Diploma,  Computer Science 1999  – 2001 Technion - Israel Institute of Technology B.Sc.,  Mechanical Engineering 1993  – 1997 Activities and Societies:  Mechanical Design\nManufacturing Systems\nControl Systems Technion - Israel Institute of Technology B.Sc.,  Mechanical Engineering 1993  – 1997 Activities and Societies:  Mechanical Design\nManufacturing Systems\nControl Systems Technion - Israel Institute of Technology B.Sc.,  Mechanical Engineering 1993  – 1997 Activities and Societies:  Mechanical Design\nManufacturing Systems\nControl Systems Kiev Srednaya Shkola No. 100 General 1979  – 1987 Kiev Srednaya Shkola No. 100 General 1979  – 1987 Kiev Srednaya Shkola No. 100 General 1979  – 1987 Honors & Awards Technion Mechanical Engineering Department Dean Excellence Award February 1996 Technion Mechanical Engineering Department Dean Excellence Award February 1996 Technion Mechanical Engineering Department Dean Excellence Award February 1996 Technion Mechanical Engineering Department Dean Excellence Award February 1996 ", "Experience 22nm Back-End Process Integration Engineer Intel Corporation January 2015  – Present (8 months) 22nm Front-End Process Integration Engineer Intel Corporation July 2014  –  January 2015  (7 months) Sort Product Engineering Team Leader Intel Corporation December 2013  –  April 2014  (5 months) Leading 2 teams: \n1.\t65nm NOR Flash Product Engineering team \n2.\tHVM (High Volume Manufacturing) product engineering team \nThis role involved many aspects & responsibilities:  \n•\tLeading teams of engineers with different expertise and skills \n•\tManaging the different tasks and products and defining the priorities  \n•\tResponsible to TP (Test Program) health and Road Map \n•\tFull ownership of the HVM phase, including: \no\tReleasing of new TP revisions \no\tIntroduction of new product steps \no\tYield improvement \no\tReliability improvement/ DPM reduction  \no\tTest Time reduction \no\tSupport Fab process improvements, task forces & excursions \n•\tWorking with international groups and peers  \n•\tOwnership of a full Sort Test Program transfer to a different site around the world Probe (Sort) Product & Test Engineering Team Leader Micron Technology April 2010  –  November 2013  (3 years 8 months) See next job description EWS (Sort) Product Engineer Numonyx April 2008  –  July 2010  (2 years 4 months) Flash NOR Product & Test engineer: \n•\tDevelopment of TP (Test Program) for several products (65nm & 45nm NOR Flash devices) \n•\tExpertise in the products different functionalities, algorithms and usage models \n•\tExpertise in TP coding in C, C++ & ALPG (Algorithmic Pattern Generator), on several testing platforms (Advantest, Verigy & In-house tester) \n•\tConversion and adaptation of product TP to different products and testing platforms  \n•\tPart of an international working group \n•\tInvolvement in most stages of the product life cycle – Design, Tape-Out, 1st Silicon, Qualification, HVM (High Volume Manufacturing) and product \"sunset\" \n•\tInvolvement in the product HVM phase, including: \no\tRelease of new TP revisions \no\tIntroduction of new product steps \no\tYield improvement \no\tReliability improvement/ DPM reduction  \no\tTest Time reduction \no\tSupport Fab process improvements, task forces & excursions Sort Product Engineer Intel 2003  –  2008  (5 years) See next job description 22nm Back-End Process Integration Engineer Intel Corporation January 2015  – Present (8 months) 22nm Back-End Process Integration Engineer Intel Corporation January 2015  – Present (8 months) 22nm Front-End Process Integration Engineer Intel Corporation July 2014  –  January 2015  (7 months) 22nm Front-End Process Integration Engineer Intel Corporation July 2014  –  January 2015  (7 months) Sort Product Engineering Team Leader Intel Corporation December 2013  –  April 2014  (5 months) Leading 2 teams: \n1.\t65nm NOR Flash Product Engineering team \n2.\tHVM (High Volume Manufacturing) product engineering team \nThis role involved many aspects & responsibilities:  \n•\tLeading teams of engineers with different expertise and skills \n•\tManaging the different tasks and products and defining the priorities  \n•\tResponsible to TP (Test Program) health and Road Map \n•\tFull ownership of the HVM phase, including: \no\tReleasing of new TP revisions \no\tIntroduction of new product steps \no\tYield improvement \no\tReliability improvement/ DPM reduction  \no\tTest Time reduction \no\tSupport Fab process improvements, task forces & excursions \n•\tWorking with international groups and peers  \n•\tOwnership of a full Sort Test Program transfer to a different site around the world Sort Product Engineering Team Leader Intel Corporation December 2013  –  April 2014  (5 months) Leading 2 teams: \n1.\t65nm NOR Flash Product Engineering team \n2.\tHVM (High Volume Manufacturing) product engineering team \nThis role involved many aspects & responsibilities:  \n•\tLeading teams of engineers with different expertise and skills \n•\tManaging the different tasks and products and defining the priorities  \n•\tResponsible to TP (Test Program) health and Road Map \n•\tFull ownership of the HVM phase, including: \no\tReleasing of new TP revisions \no\tIntroduction of new product steps \no\tYield improvement \no\tReliability improvement/ DPM reduction  \no\tTest Time reduction \no\tSupport Fab process improvements, task forces & excursions \n•\tWorking with international groups and peers  \n•\tOwnership of a full Sort Test Program transfer to a different site around the world Probe (Sort) Product & Test Engineering Team Leader Micron Technology April 2010  –  November 2013  (3 years 8 months) See next job description Probe (Sort) Product & Test Engineering Team Leader Micron Technology April 2010  –  November 2013  (3 years 8 months) See next job description EWS (Sort) Product Engineer Numonyx April 2008  –  July 2010  (2 years 4 months) Flash NOR Product & Test engineer: \n•\tDevelopment of TP (Test Program) for several products (65nm & 45nm NOR Flash devices) \n•\tExpertise in the products different functionalities, algorithms and usage models \n•\tExpertise in TP coding in C, C++ & ALPG (Algorithmic Pattern Generator), on several testing platforms (Advantest, Verigy & In-house tester) \n•\tConversion and adaptation of product TP to different products and testing platforms  \n•\tPart of an international working group \n•\tInvolvement in most stages of the product life cycle – Design, Tape-Out, 1st Silicon, Qualification, HVM (High Volume Manufacturing) and product \"sunset\" \n•\tInvolvement in the product HVM phase, including: \no\tRelease of new TP revisions \no\tIntroduction of new product steps \no\tYield improvement \no\tReliability improvement/ DPM reduction  \no\tTest Time reduction \no\tSupport Fab process improvements, task forces & excursions EWS (Sort) Product Engineer Numonyx April 2008  –  July 2010  (2 years 4 months) Flash NOR Product & Test engineer: \n•\tDevelopment of TP (Test Program) for several products (65nm & 45nm NOR Flash devices) \n•\tExpertise in the products different functionalities, algorithms and usage models \n•\tExpertise in TP coding in C, C++ & ALPG (Algorithmic Pattern Generator), on several testing platforms (Advantest, Verigy & In-house tester) \n•\tConversion and adaptation of product TP to different products and testing platforms  \n•\tPart of an international working group \n•\tInvolvement in most stages of the product life cycle – Design, Tape-Out, 1st Silicon, Qualification, HVM (High Volume Manufacturing) and product \"sunset\" \n•\tInvolvement in the product HVM phase, including: \no\tRelease of new TP revisions \no\tIntroduction of new product steps \no\tYield improvement \no\tReliability improvement/ DPM reduction  \no\tTest Time reduction \no\tSupport Fab process improvements, task forces & excursions Sort Product Engineer Intel 2003  –  2008  (5 years) See next job description Sort Product Engineer Intel 2003  –  2008  (5 years) See next job description Languages Hebrew Native or bilingual proficiency English Full professional proficiency Hebrew Native or bilingual proficiency English Full professional proficiency Hebrew Native or bilingual proficiency English Full professional proficiency Native or bilingual proficiency Full professional proficiency Skills Flash Memory Semiconductors Semiconductor Industry Product Engineering CMOS Silicon IC Yield SoC ASIC JMP Debugging Microelectronics Process Integration Failure Analysis Verilog Intel Testing Device Characterization Circuit Design See 5+     See less Skills  Flash Memory Semiconductors Semiconductor Industry Product Engineering CMOS Silicon IC Yield SoC ASIC JMP Debugging Microelectronics Process Integration Failure Analysis Verilog Intel Testing Device Characterization Circuit Design See 5+     See less Flash Memory Semiconductors Semiconductor Industry Product Engineering CMOS Silicon IC Yield SoC ASIC JMP Debugging Microelectronics Process Integration Failure Analysis Verilog Intel Testing Device Characterization Circuit Design See 5+     See less Flash Memory Semiconductors Semiconductor Industry Product Engineering CMOS Silicon IC Yield SoC ASIC JMP Debugging Microelectronics Process Integration Failure Analysis Verilog Intel Testing Device Characterization Circuit Design See 5+     See less Education Ben-Gurion University of the Negev Master of Science (MSc),  Engineering/Industrial Management 2013  – 2016 Ben-Gurion University of the Negev BSc,  Electrical & Computers Engineering 2001  – 2005 Ben-Gurion University of the Negev Master of Science (MSc),  Engineering/Industrial Management 2013  – 2016 Ben-Gurion University of the Negev Master of Science (MSc),  Engineering/Industrial Management 2013  – 2016 Ben-Gurion University of the Negev Master of Science (MSc),  Engineering/Industrial Management 2013  – 2016 Ben-Gurion University of the Negev BSc,  Electrical & Computers Engineering 2001  – 2005 Ben-Gurion University of the Negev BSc,  Electrical & Computers Engineering 2001  – 2005 Ben-Gurion University of the Negev BSc,  Electrical & Computers Engineering 2001  – 2005 ", "Experience Process Integration Engineer Intel Corporation December 2013  – Present (1 year 9 months) Portland, Oregon Area 1272, 1276 Process Technologies Graduate Student Research Assistant University of Michigan September 2009  –  August 2013  (4 years) Ann Arbor Lecturer Bangladesh University of Engineering & Technology February 2007  –  August 2009  (2 years 7 months) Dhaka Process Integration Engineer Intel Corporation December 2013  – Present (1 year 9 months) Portland, Oregon Area 1272, 1276 Process Technologies Process Integration Engineer Intel Corporation December 2013  – Present (1 year 9 months) Portland, Oregon Area 1272, 1276 Process Technologies Graduate Student Research Assistant University of Michigan September 2009  –  August 2013  (4 years) Ann Arbor Graduate Student Research Assistant University of Michigan September 2009  –  August 2013  (4 years) Ann Arbor Lecturer Bangladesh University of Engineering & Technology February 2007  –  August 2009  (2 years 7 months) Dhaka Lecturer Bangladesh University of Engineering & Technology February 2007  –  August 2009  (2 years 7 months) Dhaka Skills COMSOL Physics Simulink Matlab Simulations Characterization C Microfabrication Numerical Simulation Pspice Nanotechnology Cadence Virtuoso LaTeX LabVIEW PSpice Skills  COMSOL Physics Simulink Matlab Simulations Characterization C Microfabrication Numerical Simulation Pspice Nanotechnology Cadence Virtuoso LaTeX LabVIEW PSpice COMSOL Physics Simulink Matlab Simulations Characterization C Microfabrication Numerical Simulation Pspice Nanotechnology Cadence Virtuoso LaTeX LabVIEW PSpice COMSOL Physics Simulink Matlab Simulations Characterization C Microfabrication Numerical Simulation Pspice Nanotechnology Cadence Virtuoso LaTeX LabVIEW PSpice Education University of Michigan PhD,  Electrical Engineering 2009  – 2013 University of Michigan PhD,  Electrical Engineering 2009  – 2013 University of Michigan PhD,  Electrical Engineering 2009  – 2013 University of Michigan PhD,  Electrical Engineering 2009  – 2013 ", "Experience 14nm Process Integration manager Intel Corporation June 2014  – Present (1 year 3 months) Phoenix, Arizona Area AZ FSM 14nm Back-End process integration Engineering Manager at Intel Corporation responsible for technology transfer from technology development to HVM (high vol. manufacturing) sites, startup and ramp activities to achieve Yield, Reliability, Performance and Cost goals. Yield Analysis & FI/FA manager Intel Corporation March 2013  –  June 2014  (1 year 4 months) Intel F28 Kiryat Gat, Israel Yield Analysis, Fault isolation and Failure Analysis manager within Fab 28 yield department - Owns the overall fab end of line yield performance (last functional test) and health including End Of Line to In Line signal tracking and root cause finding of technology and fabrication process issues, tool and fab level data mining, tools performance matching, low yield fault isolation and failure analysis and fab/Virtual Factory efforts to maximize yield in a very constraint environment. 22nm SoC technology transfer manager Intel Corporation January 2012  –  August 2013  (1 year 8 months) Intel F28 Kiryat Gat, Israel 22nm intel Haswell \"tock\" product transfer to Fab28 high volume manufacturing. \nFab28 22nm SoC Tech. Transfer manager from Intel Portland Technology Development, USA  \nFab 28 22nm Process Integration manager. \n \n \n 300mm logic senior process integration engineer Intel Corporation January 2006  –  January 2012  (6 years 1 month) 45/32/22nm P1266/1268/1270: \nIntel Portland Technology Development, US \nIntel F32 Chandler, Arizona, US \nIntel F11x Rio Rancho, New-Mexico, US \nIntel F28 Kiryat Gat, Israel 200mm Logic/Flash process integration engineer Intel Corporation October 1998  –  January 2006  (7 years 4 months) Intel F18 Kiryat Gat, Israel 14nm Process Integration manager Intel Corporation June 2014  – Present (1 year 3 months) Phoenix, Arizona Area AZ FSM 14nm Back-End process integration Engineering Manager at Intel Corporation responsible for technology transfer from technology development to HVM (high vol. manufacturing) sites, startup and ramp activities to achieve Yield, Reliability, Performance and Cost goals. 14nm Process Integration manager Intel Corporation June 2014  – Present (1 year 3 months) Phoenix, Arizona Area AZ FSM 14nm Back-End process integration Engineering Manager at Intel Corporation responsible for technology transfer from technology development to HVM (high vol. manufacturing) sites, startup and ramp activities to achieve Yield, Reliability, Performance and Cost goals. Yield Analysis & FI/FA manager Intel Corporation March 2013  –  June 2014  (1 year 4 months) Intel F28 Kiryat Gat, Israel Yield Analysis, Fault isolation and Failure Analysis manager within Fab 28 yield department - Owns the overall fab end of line yield performance (last functional test) and health including End Of Line to In Line signal tracking and root cause finding of technology and fabrication process issues, tool and fab level data mining, tools performance matching, low yield fault isolation and failure analysis and fab/Virtual Factory efforts to maximize yield in a very constraint environment. Yield Analysis & FI/FA manager Intel Corporation March 2013  –  June 2014  (1 year 4 months) Intel F28 Kiryat Gat, Israel Yield Analysis, Fault isolation and Failure Analysis manager within Fab 28 yield department - Owns the overall fab end of line yield performance (last functional test) and health including End Of Line to In Line signal tracking and root cause finding of technology and fabrication process issues, tool and fab level data mining, tools performance matching, low yield fault isolation and failure analysis and fab/Virtual Factory efforts to maximize yield in a very constraint environment. 22nm SoC technology transfer manager Intel Corporation January 2012  –  August 2013  (1 year 8 months) Intel F28 Kiryat Gat, Israel 22nm intel Haswell \"tock\" product transfer to Fab28 high volume manufacturing. \nFab28 22nm SoC Tech. Transfer manager from Intel Portland Technology Development, USA  \nFab 28 22nm Process Integration manager. \n \n \n 22nm SoC technology transfer manager Intel Corporation January 2012  –  August 2013  (1 year 8 months) Intel F28 Kiryat Gat, Israel 22nm intel Haswell \"tock\" product transfer to Fab28 high volume manufacturing. \nFab28 22nm SoC Tech. Transfer manager from Intel Portland Technology Development, USA  \nFab 28 22nm Process Integration manager. \n \n \n 300mm logic senior process integration engineer Intel Corporation January 2006  –  January 2012  (6 years 1 month) 45/32/22nm P1266/1268/1270: \nIntel Portland Technology Development, US \nIntel F32 Chandler, Arizona, US \nIntel F11x Rio Rancho, New-Mexico, US \nIntel F28 Kiryat Gat, Israel 300mm logic senior process integration engineer Intel Corporation January 2006  –  January 2012  (6 years 1 month) 45/32/22nm P1266/1268/1270: \nIntel Portland Technology Development, US \nIntel F32 Chandler, Arizona, US \nIntel F11x Rio Rancho, New-Mexico, US \nIntel F28 Kiryat Gat, Israel 200mm Logic/Flash process integration engineer Intel Corporation October 1998  –  January 2006  (7 years 4 months) Intel F18 Kiryat Gat, Israel 200mm Logic/Flash process integration engineer Intel Corporation October 1998  –  January 2006  (7 years 4 months) Intel F18 Kiryat Gat, Israel Languages Hebrew English Hebrew English Hebrew English Skills Process Integration Semiconductor Industry SPC JMP Process Improvement Process Control Project Management Problem Solving Program Management Thin Films IC PVD Engineering Management CMOS Metrology Yield Failure Analysis Design of Experiments Manufacturing Technology Transfer Lithography SoC Optics R&D Electronics Characterization Etching Physics Microelectronics CVD PECVD Sputtering ASIC Analog MEMS Yield Analysis Cost Savings Strategies Processors Materials Science Device Characterization Flash Memory VLSI Semiconductor Process Fault Isolation Leadership Management EDA Product Engineering Plasma Etch Photolithography See 35+     See less Skills  Process Integration Semiconductor Industry SPC JMP Process Improvement Process Control Project Management Problem Solving Program Management Thin Films IC PVD Engineering Management CMOS Metrology Yield Failure Analysis Design of Experiments Manufacturing Technology Transfer Lithography SoC Optics R&D Electronics Characterization Etching Physics Microelectronics CVD PECVD Sputtering ASIC Analog MEMS Yield Analysis Cost Savings Strategies Processors Materials Science Device Characterization Flash Memory VLSI Semiconductor Process Fault Isolation Leadership Management EDA Product Engineering Plasma Etch Photolithography See 35+     See less Process Integration Semiconductor Industry SPC JMP Process Improvement Process Control Project Management Problem Solving Program Management Thin Films IC PVD Engineering Management CMOS Metrology Yield Failure Analysis Design of Experiments Manufacturing Technology Transfer Lithography SoC Optics R&D Electronics Characterization Etching Physics Microelectronics CVD PECVD Sputtering ASIC Analog MEMS Yield Analysis Cost Savings Strategies Processors Materials Science Device Characterization Flash Memory VLSI Semiconductor Process Fault Isolation Leadership Management EDA Product Engineering Plasma Etch Photolithography See 35+     See less Process Integration Semiconductor Industry SPC JMP Process Improvement Process Control Project Management Problem Solving Program Management Thin Films IC PVD Engineering Management CMOS Metrology Yield Failure Analysis Design of Experiments Manufacturing Technology Transfer Lithography SoC Optics R&D Electronics Characterization Etching Physics Microelectronics CVD PECVD Sputtering ASIC Analog MEMS Yield Analysis Cost Savings Strategies Processors Materials Science Device Characterization Flash Memory VLSI Semiconductor Process Fault Isolation Leadership Management EDA Product Engineering Plasma Etch Photolithography See 35+     See less Education Hamaslool Ha'akademi shel Hamichlala Leminhal Master of Business Administration (MBA),  Strategic management 2013  – 2016 The Academic College of Tel-Aviv B.Ed. Natural Science 2001  – 2003 Ort Singalovsky, Tel-Aviv Mechanical Practical Engineer 1997  – 1998 Hamaslool Ha'akademi shel Hamichlala Leminhal Master of Business Administration (MBA),  Strategic management 2013  – 2016 Hamaslool Ha'akademi shel Hamichlala Leminhal Master of Business Administration (MBA),  Strategic management 2013  – 2016 Hamaslool Ha'akademi shel Hamichlala Leminhal Master of Business Administration (MBA),  Strategic management 2013  – 2016 The Academic College of Tel-Aviv B.Ed. Natural Science 2001  – 2003 The Academic College of Tel-Aviv B.Ed. Natural Science 2001  – 2003 The Academic College of Tel-Aviv B.Ed. Natural Science 2001  – 2003 Ort Singalovsky, Tel-Aviv Mechanical Practical Engineer 1997  – 1998 Ort Singalovsky, Tel-Aviv Mechanical Practical Engineer 1997  – 1998 Ort Singalovsky, Tel-Aviv Mechanical Practical Engineer 1997  – 1998 ", "Summary Research Interests: \n \n- Characterization and modeling of transport and noise phenomena in composites and films composed of nano-scaled particles (e.g. composed of fullerene family).  \n- Fabrication and optimization of various carbon nanotube/graphene-based devices. \n- Low temperature characterization of magnetic/electric field dependent transport in disordered films/systems.  \n- Computational analysis of random phenomena in nano-scaled novel devices. \n \nSpecialties: - Fabrication and solution processing of carbon-based structures/films. \n- Utilization of cleanroom facilities for deposition, patterning, etching, etc.  \n- Characterization using SEM, TEM, AFM, XRD, Raman/FTIR spectroscopy systems, profilometers, impedance and spectral analyzers and Low-Temp setups. \n- Device Simulation using Medici, GenesisE. \n- Analog and Digital Circuit Simulation using Spice, Protel, QuartezII. \n- Analyzing and Programming using Matlab, SPSS, Maple, C++. Summary Research Interests: \n \n- Characterization and modeling of transport and noise phenomena in composites and films composed of nano-scaled particles (e.g. composed of fullerene family).  \n- Fabrication and optimization of various carbon nanotube/graphene-based devices. \n- Low temperature characterization of magnetic/electric field dependent transport in disordered films/systems.  \n- Computational analysis of random phenomena in nano-scaled novel devices. \n \nSpecialties: - Fabrication and solution processing of carbon-based structures/films. \n- Utilization of cleanroom facilities for deposition, patterning, etching, etc.  \n- Characterization using SEM, TEM, AFM, XRD, Raman/FTIR spectroscopy systems, profilometers, impedance and spectral analyzers and Low-Temp setups. \n- Device Simulation using Medici, GenesisE. \n- Analog and Digital Circuit Simulation using Spice, Protel, QuartezII. \n- Analyzing and Programming using Matlab, SPSS, Maple, C++. Research Interests: \n \n- Characterization and modeling of transport and noise phenomena in composites and films composed of nano-scaled particles (e.g. composed of fullerene family).  \n- Fabrication and optimization of various carbon nanotube/graphene-based devices. \n- Low temperature characterization of magnetic/electric field dependent transport in disordered films/systems.  \n- Computational analysis of random phenomena in nano-scaled novel devices. \n \nSpecialties: - Fabrication and solution processing of carbon-based structures/films. \n- Utilization of cleanroom facilities for deposition, patterning, etching, etc.  \n- Characterization using SEM, TEM, AFM, XRD, Raman/FTIR spectroscopy systems, profilometers, impedance and spectral analyzers and Low-Temp setups. \n- Device Simulation using Medici, GenesisE. \n- Analog and Digital Circuit Simulation using Spice, Protel, QuartezII. \n- Analyzing and Programming using Matlab, SPSS, Maple, C++. Research Interests: \n \n- Characterization and modeling of transport and noise phenomena in composites and films composed of nano-scaled particles (e.g. composed of fullerene family).  \n- Fabrication and optimization of various carbon nanotube/graphene-based devices. \n- Low temperature characterization of magnetic/electric field dependent transport in disordered films/systems.  \n- Computational analysis of random phenomena in nano-scaled novel devices. \n \nSpecialties: - Fabrication and solution processing of carbon-based structures/films. \n- Utilization of cleanroom facilities for deposition, patterning, etching, etc.  \n- Characterization using SEM, TEM, AFM, XRD, Raman/FTIR spectroscopy systems, profilometers, impedance and spectral analyzers and Low-Temp setups. \n- Device Simulation using Medici, GenesisE. \n- Analog and Digital Circuit Simulation using Spice, Protel, QuartezII. \n- Analyzing and Programming using Matlab, SPSS, Maple, C++. Experience Process Integration Engineer Intel Corporation August 2013  – Present (2 years 1 month) Boise, Idaho Area - Design and Optimization of non-volatile-memory structures. Post Doctoral Research Associate University of Illinois at Urbana-Champaign August 2010  –  August 2013  (3 years 1 month) - Designing and implementing phase-change memory multi-bit devices based on graphene interconnects for large-scale applications.  \n- Characterization and modeling of thermal transport and breakdown mechanisms in carbon nanotube networks and graphene nanoribbon interconnects. \n- Determining the role of contacts in the performance of CVD-based graphene devices. Research Assistant University of Florida August 2005  –  August 2010  (5 years 1 month) - Characterization of electrical properties of nano-scaled disordered systems such as carbon nanotube/graphene films via resistivity, 1/f noise, low temperature carrier transport and breakdown measurements. \n- Fabrication/characterization of carbon nanotube/graphene-based optoelectronic devices. \n- Studying the effect of various structural parameters on the percolation transport in networks consisted of nano-scaled 1D elements via Monte Carlo simulations. \n- Studying the interface between individual or networks of carbon nanotube/graphene and single crystalline Si/GaAs substrates. Research Assistant TCAD Laboratory, University of Tehran January 2004  –  August 2005  (1 year 8 months) - Development of a GA-based platform for optimization of SOI transistor design. \n- Derivation of analytical current and threshold voltage models for Dual Material Gate (DMG) and Stacked Gate (SG) MOSFETs and MESFETs.  \n- Optimization of source voltage and sizing for low-power/low-voltage digital circuits. Research Assistant Thin Film Laboratory, University of Tehran April 2003  –  July 2005  (2 years 4 months) - Fabrication of poly-Si TFTs built on flexible, low-temp substrates.  \n- Study of local-melted-point sweep and stress exertion crystallization techniques for Ge. \n- Fabrication of vertical tunneling transistors on Si based on CVD-deposited TiO2 barriers. Control Design Engineer Dozhpad January 2002  –  May 2003  (1 year 5 months) - Designing digital control modules based on industrial PLC’s. \n- Managing a team for the design of two fully automated product-lines. Process Integration Engineer Intel Corporation August 2013  – Present (2 years 1 month) Boise, Idaho Area - Design and Optimization of non-volatile-memory structures. Process Integration Engineer Intel Corporation August 2013  – Present (2 years 1 month) Boise, Idaho Area - Design and Optimization of non-volatile-memory structures. Post Doctoral Research Associate University of Illinois at Urbana-Champaign August 2010  –  August 2013  (3 years 1 month) - Designing and implementing phase-change memory multi-bit devices based on graphene interconnects for large-scale applications.  \n- Characterization and modeling of thermal transport and breakdown mechanisms in carbon nanotube networks and graphene nanoribbon interconnects. \n- Determining the role of contacts in the performance of CVD-based graphene devices. Post Doctoral Research Associate University of Illinois at Urbana-Champaign August 2010  –  August 2013  (3 years 1 month) - Designing and implementing phase-change memory multi-bit devices based on graphene interconnects for large-scale applications.  \n- Characterization and modeling of thermal transport and breakdown mechanisms in carbon nanotube networks and graphene nanoribbon interconnects. \n- Determining the role of contacts in the performance of CVD-based graphene devices. Research Assistant University of Florida August 2005  –  August 2010  (5 years 1 month) - Characterization of electrical properties of nano-scaled disordered systems such as carbon nanotube/graphene films via resistivity, 1/f noise, low temperature carrier transport and breakdown measurements. \n- Fabrication/characterization of carbon nanotube/graphene-based optoelectronic devices. \n- Studying the effect of various structural parameters on the percolation transport in networks consisted of nano-scaled 1D elements via Monte Carlo simulations. \n- Studying the interface between individual or networks of carbon nanotube/graphene and single crystalline Si/GaAs substrates. Research Assistant University of Florida August 2005  –  August 2010  (5 years 1 month) - Characterization of electrical properties of nano-scaled disordered systems such as carbon nanotube/graphene films via resistivity, 1/f noise, low temperature carrier transport and breakdown measurements. \n- Fabrication/characterization of carbon nanotube/graphene-based optoelectronic devices. \n- Studying the effect of various structural parameters on the percolation transport in networks consisted of nano-scaled 1D elements via Monte Carlo simulations. \n- Studying the interface between individual or networks of carbon nanotube/graphene and single crystalline Si/GaAs substrates. Research Assistant TCAD Laboratory, University of Tehran January 2004  –  August 2005  (1 year 8 months) - Development of a GA-based platform for optimization of SOI transistor design. \n- Derivation of analytical current and threshold voltage models for Dual Material Gate (DMG) and Stacked Gate (SG) MOSFETs and MESFETs.  \n- Optimization of source voltage and sizing for low-power/low-voltage digital circuits. Research Assistant TCAD Laboratory, University of Tehran January 2004  –  August 2005  (1 year 8 months) - Development of a GA-based platform for optimization of SOI transistor design. \n- Derivation of analytical current and threshold voltage models for Dual Material Gate (DMG) and Stacked Gate (SG) MOSFETs and MESFETs.  \n- Optimization of source voltage and sizing for low-power/low-voltage digital circuits. Research Assistant Thin Film Laboratory, University of Tehran April 2003  –  July 2005  (2 years 4 months) - Fabrication of poly-Si TFTs built on flexible, low-temp substrates.  \n- Study of local-melted-point sweep and stress exertion crystallization techniques for Ge. \n- Fabrication of vertical tunneling transistors on Si based on CVD-deposited TiO2 barriers. Research Assistant Thin Film Laboratory, University of Tehran April 2003  –  July 2005  (2 years 4 months) - Fabrication of poly-Si TFTs built on flexible, low-temp substrates.  \n- Study of local-melted-point sweep and stress exertion crystallization techniques for Ge. \n- Fabrication of vertical tunneling transistors on Si based on CVD-deposited TiO2 barriers. Control Design Engineer Dozhpad January 2002  –  May 2003  (1 year 5 months) - Designing digital control modules based on industrial PLC’s. \n- Managing a team for the design of two fully automated product-lines. Control Design Engineer Dozhpad January 2002  –  May 2003  (1 year 5 months) - Designing digital control modules based on industrial PLC’s. \n- Managing a team for the design of two fully automated product-lines. Languages English Full professional proficiency Persian Native or bilingual proficiency German Elementary proficiency English Full professional proficiency Persian Native or bilingual proficiency German Elementary proficiency English Full professional proficiency Persian Native or bilingual proficiency German Elementary proficiency Full professional proficiency Native or bilingual proficiency Elementary proficiency Skills Math and Programming:... Analog and Digital... Device Simulation and... Characterization I:... Characterization II:... Fabrication I: CVD and... Fabrication II:... Fabrication III:... Fabrication IV: Photo... Simulations Matlab Metal Fabrication AFM Powder X-ray Diffraction Characterization Automation Nanotechnology Signal Processing Microscopy Programming C++ Semiconductors Experimentation TEM SPICE Spectroscopy Optoelectronics Scanning Electron... Labview Etching LaTeX Microfabrication LabVIEW See 18+     See less Skills  Math and Programming:... Analog and Digital... Device Simulation and... Characterization I:... Characterization II:... Fabrication I: CVD and... Fabrication II:... Fabrication III:... Fabrication IV: Photo... Simulations Matlab Metal Fabrication AFM Powder X-ray Diffraction Characterization Automation Nanotechnology Signal Processing Microscopy Programming C++ Semiconductors Experimentation TEM SPICE Spectroscopy Optoelectronics Scanning Electron... Labview Etching LaTeX Microfabrication LabVIEW See 18+     See less Math and Programming:... Analog and Digital... Device Simulation and... Characterization I:... Characterization II:... Fabrication I: CVD and... Fabrication II:... Fabrication III:... Fabrication IV: Photo... Simulations Matlab Metal Fabrication AFM Powder X-ray Diffraction Characterization Automation Nanotechnology Signal Processing Microscopy Programming C++ Semiconductors Experimentation TEM SPICE Spectroscopy Optoelectronics Scanning Electron... Labview Etching LaTeX Microfabrication LabVIEW See 18+     See less Math and Programming:... Analog and Digital... Device Simulation and... Characterization I:... Characterization II:... Fabrication I: CVD and... Fabrication II:... Fabrication III:... Fabrication IV: Photo... Simulations Matlab Metal Fabrication AFM Powder X-ray Diffraction Characterization Automation Nanotechnology Signal Processing Microscopy Programming C++ Semiconductors Experimentation TEM SPICE Spectroscopy Optoelectronics Scanning Electron... Labview Etching LaTeX Microfabrication LabVIEW See 18+     See less Education University of Florida Ph.D.,  Semiconductor Devices/Nanotechnology 2005  – 2010 Activities and Societies:  International Student Speakers’ Bureau (ISSB): Promoting global awareness among USA students. University of Tehran Master of Science (M.Sc.),  Electrical and Electronics Engineering 2003  – 2005 University of Tehran Bachelor of Science (B.Sc.),  Electrical and Electronics Engineering 1999  – 2003 University of Florida Ph.D.,  Semiconductor Devices/Nanotechnology 2005  – 2010 Activities and Societies:  International Student Speakers’ Bureau (ISSB): Promoting global awareness among USA students. University of Florida Ph.D.,  Semiconductor Devices/Nanotechnology 2005  – 2010 Activities and Societies:  International Student Speakers’ Bureau (ISSB): Promoting global awareness among USA students. University of Florida Ph.D.,  Semiconductor Devices/Nanotechnology 2005  – 2010 Activities and Societies:  International Student Speakers’ Bureau (ISSB): Promoting global awareness among USA students. University of Tehran Master of Science (M.Sc.),  Electrical and Electronics Engineering 2003  – 2005 University of Tehran Master of Science (M.Sc.),  Electrical and Electronics Engineering 2003  – 2005 University of Tehran Master of Science (M.Sc.),  Electrical and Electronics Engineering 2003  – 2005 University of Tehran Bachelor of Science (B.Sc.),  Electrical and Electronics Engineering 1999  – 2003 University of Tehran Bachelor of Science (B.Sc.),  Electrical and Electronics Engineering 1999  – 2003 University of Tehran Bachelor of Science (B.Sc.),  Electrical and Electronics Engineering 1999  – 2003 Honors & Awards Additional Honors & Awards - Alumni Fellowship, University of Florida, 2005-2010.  \n- International Student Outstanding Achievement Award, University of Florida, Nov 19, 2009. Additional Honors & Awards - Alumni Fellowship, University of Florida, 2005-2010.  \n- International Student Outstanding Achievement Award, University of Florida, Nov 19, 2009. Additional Honors & Awards - Alumni Fellowship, University of Florida, 2005-2010.  \n- International Student Outstanding Achievement Award, University of Florida, Nov 19, 2009. Additional Honors & Awards - Alumni Fellowship, University of Florida, 2005-2010.  \n- International Student Outstanding Achievement Award, University of Florida, Nov 19, 2009. ", "Experience PTD Process Integration Engineer Intel Corporation October 2014  – Present (11 months) Portland, Oregon Area Senior Engineer, Packaging Solutions GLOBALFOUNDRIES June 2013  –  September 2014  (1 year 4 months) Dresden Area, Germany Senior Research Assistant Indian Institute of Technology, Bombay August 2009  –  February 2010  (7 months) Mumbai Guest Scientist Leibniz Institute for Solid State and Materials Research, Dresden,Germany October 2008  –  May 2009  (8 months) PTD Process Integration Engineer Intel Corporation October 2014  – Present (11 months) Portland, Oregon Area PTD Process Integration Engineer Intel Corporation October 2014  – Present (11 months) Portland, Oregon Area Senior Engineer, Packaging Solutions GLOBALFOUNDRIES June 2013  –  September 2014  (1 year 4 months) Dresden Area, Germany Senior Engineer, Packaging Solutions GLOBALFOUNDRIES June 2013  –  September 2014  (1 year 4 months) Dresden Area, Germany Senior Research Assistant Indian Institute of Technology, Bombay August 2009  –  February 2010  (7 months) Mumbai Senior Research Assistant Indian Institute of Technology, Bombay August 2009  –  February 2010  (7 months) Mumbai Guest Scientist Leibniz Institute for Solid State and Materials Research, Dresden,Germany October 2008  –  May 2009  (8 months) Guest Scientist Leibniz Institute for Solid State and Materials Research, Dresden,Germany October 2008  –  May 2009  (8 months) Skills Skills     Education Technische Universität Dresden Doctor of Philosophy (PhD),  Electronic Packaging 2010  – 2013 Worked on Copper-Carbon Nanotube Composites for TSVs in 3D Packaging. Fabricated and characterized the composite for enhancement of Thermo-Mechanical, Mechanical and Electrical Properties for Electronic Packing related applications. University of Arkansas at Fayetteville MS,  Microelectronics-Photonics 2005  – 2008 Kendriya Vidyalaya Technische Universität Dresden Doctor of Philosophy (PhD),  Electronic Packaging 2010  – 2013 Worked on Copper-Carbon Nanotube Composites for TSVs in 3D Packaging. Fabricated and characterized the composite for enhancement of Thermo-Mechanical, Mechanical and Electrical Properties for Electronic Packing related applications. Technische Universität Dresden Doctor of Philosophy (PhD),  Electronic Packaging 2010  – 2013 Worked on Copper-Carbon Nanotube Composites for TSVs in 3D Packaging. Fabricated and characterized the composite for enhancement of Thermo-Mechanical, Mechanical and Electrical Properties for Electronic Packing related applications. Technische Universität Dresden Doctor of Philosophy (PhD),  Electronic Packaging 2010  – 2013 Worked on Copper-Carbon Nanotube Composites for TSVs in 3D Packaging. Fabricated and characterized the composite for enhancement of Thermo-Mechanical, Mechanical and Electrical Properties for Electronic Packing related applications. University of Arkansas at Fayetteville MS,  Microelectronics-Photonics 2005  – 2008 University of Arkansas at Fayetteville MS,  Microelectronics-Photonics 2005  – 2008 University of Arkansas at Fayetteville MS,  Microelectronics-Photonics 2005  – 2008 Kendriya Vidyalaya Kendriya Vidyalaya Kendriya Vidyalaya ", "Summary Responsible for determining yield and reliability issues pertaining to the 65nm process technology and working with process areas to design a solution. Monitoring e-test parameters and investigating potential yield limiting issues. High expertise in semiconductor device physics, polish, litho, dry etch and thin films deposition. Specialties:data extraction, data analysis, DOE, JMP, SQL, Lean Manufacturing, Level 1 TRIZ certified, kaizen Summary Responsible for determining yield and reliability issues pertaining to the 65nm process technology and working with process areas to design a solution. Monitoring e-test parameters and investigating potential yield limiting issues. High expertise in semiconductor device physics, polish, litho, dry etch and thin films deposition. Specialties:data extraction, data analysis, DOE, JMP, SQL, Lean Manufacturing, Level 1 TRIZ certified, kaizen Responsible for determining yield and reliability issues pertaining to the 65nm process technology and working with process areas to design a solution. Monitoring e-test parameters and investigating potential yield limiting issues. High expertise in semiconductor device physics, polish, litho, dry etch and thin films deposition. Specialties:data extraction, data analysis, DOE, JMP, SQL, Lean Manufacturing, Level 1 TRIZ certified, kaizen Responsible for determining yield and reliability issues pertaining to the 65nm process technology and working with process areas to design a solution. Monitoring e-test parameters and investigating potential yield limiting issues. High expertise in semiconductor device physics, polish, litho, dry etch and thin films deposition. Specialties:data extraction, data analysis, DOE, JMP, SQL, Lean Manufacturing, Level 1 TRIZ certified, kaizen Experience Process Integration Engineer Intel Corporation September 2010  – Present (5 years) Use of statistical analysis of metrology data, wafer sort and test yield data to find causes of yield or performance degradation and search for optimal process recipes for the Salicide/Contact modules. Design of experiments to validate or discover root cause of product manufacturing issues. Requires in depth knowledge of fab process flows, semiconductor device physics, test methods, data analysis and statistics. BE Process Integration Engineer Intel Corporation August 2007  –  September 2010  (3 years 2 months) Develop, maintain, and improve various modules for 300mm 65 nm BE technology. In charge of improving yield and cost reduction projects, optimization of existing process flows for cost reduction and improved manufacturability. Monitoring in line parametric and fab trends, responding appropriately to excursions and dispositioning the affected material. Support certification activities of new processes, fab ramping activities, and ensure that all e-test/fab success criteria are met with no schedule delays due to Integration/Device planning or data analysis, Device Engineer Intel July 2000  –  July 2007  (7 years 1 month) Develop and sustain various modules for 200mm and 300mm technology. Support certification activities of new processes, fab ramping activities, and ensure that all e-test success criteria are met, investigate and fix any etest issues related to FE and BE process. Process Integration Engineer Intel Corporation September 2010  – Present (5 years) Use of statistical analysis of metrology data, wafer sort and test yield data to find causes of yield or performance degradation and search for optimal process recipes for the Salicide/Contact modules. Design of experiments to validate or discover root cause of product manufacturing issues. Requires in depth knowledge of fab process flows, semiconductor device physics, test methods, data analysis and statistics. Process Integration Engineer Intel Corporation September 2010  – Present (5 years) Use of statistical analysis of metrology data, wafer sort and test yield data to find causes of yield or performance degradation and search for optimal process recipes for the Salicide/Contact modules. Design of experiments to validate or discover root cause of product manufacturing issues. Requires in depth knowledge of fab process flows, semiconductor device physics, test methods, data analysis and statistics. BE Process Integration Engineer Intel Corporation August 2007  –  September 2010  (3 years 2 months) Develop, maintain, and improve various modules for 300mm 65 nm BE technology. In charge of improving yield and cost reduction projects, optimization of existing process flows for cost reduction and improved manufacturability. Monitoring in line parametric and fab trends, responding appropriately to excursions and dispositioning the affected material. Support certification activities of new processes, fab ramping activities, and ensure that all e-test/fab success criteria are met with no schedule delays due to Integration/Device planning or data analysis, BE Process Integration Engineer Intel Corporation August 2007  –  September 2010  (3 years 2 months) Develop, maintain, and improve various modules for 300mm 65 nm BE technology. In charge of improving yield and cost reduction projects, optimization of existing process flows for cost reduction and improved manufacturability. Monitoring in line parametric and fab trends, responding appropriately to excursions and dispositioning the affected material. Support certification activities of new processes, fab ramping activities, and ensure that all e-test/fab success criteria are met with no schedule delays due to Integration/Device planning or data analysis, Device Engineer Intel July 2000  –  July 2007  (7 years 1 month) Develop and sustain various modules for 200mm and 300mm technology. Support certification activities of new processes, fab ramping activities, and ensure that all e-test success criteria are met, investigate and fix any etest issues related to FE and BE process. Device Engineer Intel July 2000  –  July 2007  (7 years 1 month) Develop and sustain various modules for 200mm and 300mm technology. Support certification activities of new processes, fab ramping activities, and ensure that all e-test success criteria are met, investigate and fix any etest issues related to FE and BE process. Skills JMP Statistics Design of Experiments Engineering Management Semiconductor Industry Semiconductors Characterization CVD Lithography Process Integration Lean Manufacturing CMOS Intel Silicon Thin Films SPC PVD IC Reliability Yield MEMS Metrology SoC ASIC Product Engineering Failure Analysis Photolithography Device Characterization Semiconductor Process See 14+     See less Skills  JMP Statistics Design of Experiments Engineering Management Semiconductor Industry Semiconductors Characterization CVD Lithography Process Integration Lean Manufacturing CMOS Intel Silicon Thin Films SPC PVD IC Reliability Yield MEMS Metrology SoC ASIC Product Engineering Failure Analysis Photolithography Device Characterization Semiconductor Process See 14+     See less JMP Statistics Design of Experiments Engineering Management Semiconductor Industry Semiconductors Characterization CVD Lithography Process Integration Lean Manufacturing CMOS Intel Silicon Thin Films SPC PVD IC Reliability Yield MEMS Metrology SoC ASIC Product Engineering Failure Analysis Photolithography Device Characterization Semiconductor Process See 14+     See less JMP Statistics Design of Experiments Engineering Management Semiconductor Industry Semiconductors Characterization CVD Lithography Process Integration Lean Manufacturing CMOS Intel Silicon Thin Films SPC PVD IC Reliability Yield MEMS Metrology SoC ASIC Product Engineering Failure Analysis Photolithography Device Characterization Semiconductor Process See 14+     See less Education Arizona State University M.S.,  Physics And Electrical Engineering 1992  – 1998 University of Calcutta B.Sc.,  Physics 1987  – 1990 Arizona State University M.S.,  Physics And Electrical Engineering 1992  – 1998 Arizona State University M.S.,  Physics And Electrical Engineering 1992  – 1998 Arizona State University M.S.,  Physics And Electrical Engineering 1992  – 1998 University of Calcutta B.Sc.,  Physics 1987  – 1990 University of Calcutta B.Sc.,  Physics 1987  – 1990 University of Calcutta B.Sc.,  Physics 1987  – 1990 ", "Experience Process Integration Engineer Intel Corporation December 2014  – Present (9 months) Research Assistant University of Illinois at Urbana-Champaign August 2008  –  August 2014  (6 years 1 month) ● Cleanroom Fabrication: Wet and Dry Etching, Photolithography, Metal Deposition, Planarization for a 9 mask level Transistor Laser process. \n● Process optimization and establishment of high-yield Transistor Laser Process.\t \n● Integration of advanced laser processing techniques for TL (Disordering, DBRs). \n● RF electrical and optical measurements of Transistor Laser performance.\t \n● Developed evaporator optimization for submicron HBT metallization. \n● Setup of robust platform for repeatable fiber coupled measurements to -20ºC. \n● High data rate eye-diagram and BER characterization of Transistor Lasers.\t \n● High-frequency layout design for edge-emitting Transistor Lasers. \n● Maintenance and Repair of e-beam evaporator (Tool Owner).\t \n● RF and microwave modeling and design using Agilent ADS.\t \n● TA for advanced level ECE courses for 12 semesters including running the lab Choice Intern, DSBU Central Engineering Cisco May 2008  –  August 2008  (4 months) San Jose, CA Electromagnetic compliance testing on branch and service provider level switches. \nAnechoic chamber radiated emissions, immunity and ESD compliance testing. \nDeveloped standardized configuration files for rapid deployment across variety of hardware to increase testing efficiency Summer Intern, Hardware Ops. eITMS Cisco June 2007  –  August 2007  (3 months) San Jose, CA Setup shared development environment and Perl frontend for simultaneous provision of private and shared workspaces to every team member. \nPreparation of server user manuals for team. \nProposal and implementation of upgrade to EMCO development environment. Process Integration Engineer Intel Corporation December 2014  – Present (9 months) Process Integration Engineer Intel Corporation December 2014  – Present (9 months) Research Assistant University of Illinois at Urbana-Champaign August 2008  –  August 2014  (6 years 1 month) ● Cleanroom Fabrication: Wet and Dry Etching, Photolithography, Metal Deposition, Planarization for a 9 mask level Transistor Laser process. \n● Process optimization and establishment of high-yield Transistor Laser Process.\t \n● Integration of advanced laser processing techniques for TL (Disordering, DBRs). \n● RF electrical and optical measurements of Transistor Laser performance.\t \n● Developed evaporator optimization for submicron HBT metallization. \n● Setup of robust platform for repeatable fiber coupled measurements to -20ºC. \n● High data rate eye-diagram and BER characterization of Transistor Lasers.\t \n● High-frequency layout design for edge-emitting Transistor Lasers. \n● Maintenance and Repair of e-beam evaporator (Tool Owner).\t \n● RF and microwave modeling and design using Agilent ADS.\t \n● TA for advanced level ECE courses for 12 semesters including running the lab Research Assistant University of Illinois at Urbana-Champaign August 2008  –  August 2014  (6 years 1 month) ● Cleanroom Fabrication: Wet and Dry Etching, Photolithography, Metal Deposition, Planarization for a 9 mask level Transistor Laser process. \n● Process optimization and establishment of high-yield Transistor Laser Process.\t \n● Integration of advanced laser processing techniques for TL (Disordering, DBRs). \n● RF electrical and optical measurements of Transistor Laser performance.\t \n● Developed evaporator optimization for submicron HBT metallization. \n● Setup of robust platform for repeatable fiber coupled measurements to -20ºC. \n● High data rate eye-diagram and BER characterization of Transistor Lasers.\t \n● High-frequency layout design for edge-emitting Transistor Lasers. \n● Maintenance and Repair of e-beam evaporator (Tool Owner).\t \n● RF and microwave modeling and design using Agilent ADS.\t \n● TA for advanced level ECE courses for 12 semesters including running the lab Choice Intern, DSBU Central Engineering Cisco May 2008  –  August 2008  (4 months) San Jose, CA Electromagnetic compliance testing on branch and service provider level switches. \nAnechoic chamber radiated emissions, immunity and ESD compliance testing. \nDeveloped standardized configuration files for rapid deployment across variety of hardware to increase testing efficiency Choice Intern, DSBU Central Engineering Cisco May 2008  –  August 2008  (4 months) San Jose, CA Electromagnetic compliance testing on branch and service provider level switches. \nAnechoic chamber radiated emissions, immunity and ESD compliance testing. \nDeveloped standardized configuration files for rapid deployment across variety of hardware to increase testing efficiency Summer Intern, Hardware Ops. eITMS Cisco June 2007  –  August 2007  (3 months) San Jose, CA Setup shared development environment and Perl frontend for simultaneous provision of private and shared workspaces to every team member. \nPreparation of server user manuals for team. \nProposal and implementation of upgrade to EMCO development environment. Summer Intern, Hardware Ops. eITMS Cisco June 2007  –  August 2007  (3 months) San Jose, CA Setup shared development environment and Perl frontend for simultaneous provision of private and shared workspaces to every team member. \nPreparation of server user manuals for team. \nProposal and implementation of upgrade to EMCO development environment. Languages English Native or bilingual proficiency Hindi Native or bilingual proficiency Punjabi Native or bilingual proficiency English Native or bilingual proficiency Hindi Native or bilingual proficiency Punjabi Native or bilingual proficiency English Native or bilingual proficiency Hindi Native or bilingual proficiency Punjabi Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills High Speed... E-beam Evaporation PECVD Semiconductor... Diffusion High Speed Optical... Research Microsoft Office Teaching Microsoft Excel PowerPoint Data Analysis Microsoft Word Physics Matlab Agilent ADS Characterization Photolithography Semiconductors RF Testing Electrical Engineering Materials Science Thin Films Laser See 10+     See less Skills  High Speed... E-beam Evaporation PECVD Semiconductor... Diffusion High Speed Optical... Research Microsoft Office Teaching Microsoft Excel PowerPoint Data Analysis Microsoft Word Physics Matlab Agilent ADS Characterization Photolithography Semiconductors RF Testing Electrical Engineering Materials Science Thin Films Laser See 10+     See less High Speed... E-beam Evaporation PECVD Semiconductor... Diffusion High Speed Optical... Research Microsoft Office Teaching Microsoft Excel PowerPoint Data Analysis Microsoft Word Physics Matlab Agilent ADS Characterization Photolithography Semiconductors RF Testing Electrical Engineering Materials Science Thin Films Laser See 10+     See less High Speed... E-beam Evaporation PECVD Semiconductor... Diffusion High Speed Optical... Research Microsoft Office Teaching Microsoft Excel PowerPoint Data Analysis Microsoft Word Physics Matlab Agilent ADS Characterization Photolithography Semiconductors RF Testing Electrical Engineering Materials Science Thin Films Laser See 10+     See less Education University of Illinois at Urbana-Champaign Ph.D,  Electrical and Computer Engineering , 3.88/4.00 2010  – 2014 ● Cleanroom fabrication of GaAs-based Transistor Lasers and LETs.\t \n● RF electrical and optical measurements of Transistor Laser performance.\t \n● Integration of advanced laser processing techniques for TL (Disordering, DBRs). \n● Process optimization and establishment of high-yield Transistor Laser Process.\t \n● High data rate eye-diagram characterization of EETLs.\t \n● Developed evaporator optimization for submicron HBT metallization. \n● Setup of robust platform for repeatable fiber coupled measurements to -20ºC.\t \n● High-frequency layout design for edge-emitting Transistor Lasers. \n● Maintenance and Repair of e-beam evaporator (Tool Owner).\t \n● RF and microwave modeling and design using Agilent ADS.\t \n● TA for advanced level ECE courses for 12 semesters including running the lab. University of Illinois at Urbana-Champaign Master of Science (M.S.),  Electrical and Computer Engineering , 3.96/4.00 2008  – 2010 Activities and Societies:  Research Concentration: Fabrication of High Speed Transistor\nLasers ,  III-V HBT’s ,  Optoelectronics University of Illinois at Urbana-Champaign Bachelor of Science (B.S.),  Electrical and Computer Engineering , 3.93/4.00 2004  – 2008 Activities and Societies:  Highest Honors ,  Dean’s List ,  James Scholar ,  Minor in Physics University of Illinois at Urbana-Champaign Ph.D,  Electrical and Computer Engineering , 3.88/4.00 2010  – 2014 ● Cleanroom fabrication of GaAs-based Transistor Lasers and LETs.\t \n● RF electrical and optical measurements of Transistor Laser performance.\t \n● Integration of advanced laser processing techniques for TL (Disordering, DBRs). \n● Process optimization and establishment of high-yield Transistor Laser Process.\t \n● High data rate eye-diagram characterization of EETLs.\t \n● Developed evaporator optimization for submicron HBT metallization. \n● Setup of robust platform for repeatable fiber coupled measurements to -20ºC.\t \n● High-frequency layout design for edge-emitting Transistor Lasers. \n● Maintenance and Repair of e-beam evaporator (Tool Owner).\t \n● RF and microwave modeling and design using Agilent ADS.\t \n● TA for advanced level ECE courses for 12 semesters including running the lab. University of Illinois at Urbana-Champaign Ph.D,  Electrical and Computer Engineering , 3.88/4.00 2010  – 2014 ● Cleanroom fabrication of GaAs-based Transistor Lasers and LETs.\t \n● RF electrical and optical measurements of Transistor Laser performance.\t \n● Integration of advanced laser processing techniques for TL (Disordering, DBRs). \n● Process optimization and establishment of high-yield Transistor Laser Process.\t \n● High data rate eye-diagram characterization of EETLs.\t \n● Developed evaporator optimization for submicron HBT metallization. \n● Setup of robust platform for repeatable fiber coupled measurements to -20ºC.\t \n● High-frequency layout design for edge-emitting Transistor Lasers. \n● Maintenance and Repair of e-beam evaporator (Tool Owner).\t \n● RF and microwave modeling and design using Agilent ADS.\t \n● TA for advanced level ECE courses for 12 semesters including running the lab. University of Illinois at Urbana-Champaign Ph.D,  Electrical and Computer Engineering , 3.88/4.00 2010  – 2014 ● Cleanroom fabrication of GaAs-based Transistor Lasers and LETs.\t \n● RF electrical and optical measurements of Transistor Laser performance.\t \n● Integration of advanced laser processing techniques for TL (Disordering, DBRs). \n● Process optimization and establishment of high-yield Transistor Laser Process.\t \n● High data rate eye-diagram characterization of EETLs.\t \n● Developed evaporator optimization for submicron HBT metallization. \n● Setup of robust platform for repeatable fiber coupled measurements to -20ºC.\t \n● High-frequency layout design for edge-emitting Transistor Lasers. \n● Maintenance and Repair of e-beam evaporator (Tool Owner).\t \n● RF and microwave modeling and design using Agilent ADS.\t \n● TA for advanced level ECE courses for 12 semesters including running the lab. University of Illinois at Urbana-Champaign Master of Science (M.S.),  Electrical and Computer Engineering , 3.96/4.00 2008  – 2010 Activities and Societies:  Research Concentration: Fabrication of High Speed Transistor\nLasers ,  III-V HBT’s ,  Optoelectronics University of Illinois at Urbana-Champaign Master of Science (M.S.),  Electrical and Computer Engineering , 3.96/4.00 2008  – 2010 Activities and Societies:  Research Concentration: Fabrication of High Speed Transistor\nLasers ,  III-V HBT’s ,  Optoelectronics University of Illinois at Urbana-Champaign Master of Science (M.S.),  Electrical and Computer Engineering , 3.96/4.00 2008  – 2010 Activities and Societies:  Research Concentration: Fabrication of High Speed Transistor\nLasers ,  III-V HBT’s ,  Optoelectronics University of Illinois at Urbana-Champaign Bachelor of Science (B.S.),  Electrical and Computer Engineering , 3.93/4.00 2004  – 2008 Activities and Societies:  Highest Honors ,  Dean’s List ,  James Scholar ,  Minor in Physics University of Illinois at Urbana-Champaign Bachelor of Science (B.S.),  Electrical and Computer Engineering , 3.93/4.00 2004  – 2008 Activities and Societies:  Highest Honors ,  Dean’s List ,  James Scholar ,  Minor in Physics University of Illinois at Urbana-Champaign Bachelor of Science (B.S.),  Electrical and Computer Engineering , 3.93/4.00 2004  – 2008 Activities and Societies:  Highest Honors ,  Dean’s List ,  James Scholar ,  Minor in Physics Honors & Awards Gregory Stillman Semiconductor Research Award 2014 Electrical and Computer Engineering 2014 ECE Computer Engineering Fellowship (Intel Electrical and Computer Engineering 2013 John Bardeen Graduate Fellowship Electrical and Computer Engineering 2009 Professor Kung Chie Yeh Endowed Scholarship Electrical and Computer Engineering 2007 Graduated with Highest Honors. Dean’s List and as a James Scholar University Of Illinois May 2008 Gregory Stillman Semiconductor Research Award 2014 Electrical and Computer Engineering 2014 Gregory Stillman Semiconductor Research Award 2014 Electrical and Computer Engineering 2014 Gregory Stillman Semiconductor Research Award 2014 Electrical and Computer Engineering 2014 ECE Computer Engineering Fellowship (Intel Electrical and Computer Engineering 2013 ECE Computer Engineering Fellowship (Intel Electrical and Computer Engineering 2013 ECE Computer Engineering Fellowship (Intel Electrical and Computer Engineering 2013 John Bardeen Graduate Fellowship Electrical and Computer Engineering 2009 John Bardeen Graduate Fellowship Electrical and Computer Engineering 2009 John Bardeen Graduate Fellowship Electrical and Computer Engineering 2009 Professor Kung Chie Yeh Endowed Scholarship Electrical and Computer Engineering 2007 Professor Kung Chie Yeh Endowed Scholarship Electrical and Computer Engineering 2007 Professor Kung Chie Yeh Endowed Scholarship Electrical and Computer Engineering 2007 Graduated with Highest Honors. Dean’s List and as a James Scholar University Of Illinois May 2008 Graduated with Highest Honors. Dean’s List and as a James Scholar University Of Illinois May 2008 Graduated with Highest Honors. Dean’s List and as a James Scholar University Of Illinois May 2008 ", "Experience Back-End Process Integration Engineer Intel Corporation June 2014  – Present (1 year 3 months) Israel Senior Reliability Engineer Intel Corporation December 2013  –  June 2014  (7 months) Israel Senior Reliability Engineer and SSD Field Application Engineer Micron Technology October 2012  –  December 2013  (1 year 3 months) Israel Reliability Engineer Micron Technology 2010  –  October 2012  (2 years) Israel Reliability Eng Numonyx 2007  –  2010  (3 years) Back-End Process Integration Engineer Intel Corporation June 2014  – Present (1 year 3 months) Israel Back-End Process Integration Engineer Intel Corporation June 2014  – Present (1 year 3 months) Israel Senior Reliability Engineer Intel Corporation December 2013  –  June 2014  (7 months) Israel Senior Reliability Engineer Intel Corporation December 2013  –  June 2014  (7 months) Israel Senior Reliability Engineer and SSD Field Application Engineer Micron Technology October 2012  –  December 2013  (1 year 3 months) Israel Senior Reliability Engineer and SSD Field Application Engineer Micron Technology October 2012  –  December 2013  (1 year 3 months) Israel Reliability Engineer Micron Technology 2010  –  October 2012  (2 years) Israel Reliability Engineer Micron Technology 2010  –  October 2012  (2 years) Israel Reliability Eng Numonyx 2007  –  2010  (3 years) Reliability Eng Numonyx 2007  –  2010  (3 years) Skills Failure Analysis Flash Memory Semiconductors Yield Semiconductor Industry JMP Process Integration Silicon Reliability Testing Root Cause Analysis SPC Design of Experiments IC Device Characterization Product Engineering CMOS CVD Thin Films Microelectronics See 5+     See less Skills  Failure Analysis Flash Memory Semiconductors Yield Semiconductor Industry JMP Process Integration Silicon Reliability Testing Root Cause Analysis SPC Design of Experiments IC Device Characterization Product Engineering CMOS CVD Thin Films Microelectronics See 5+     See less Failure Analysis Flash Memory Semiconductors Yield Semiconductor Industry JMP Process Integration Silicon Reliability Testing Root Cause Analysis SPC Design of Experiments IC Device Characterization Product Engineering CMOS CVD Thin Films Microelectronics See 5+     See less Failure Analysis Flash Memory Semiconductors Yield Semiconductor Industry JMP Process Integration Silicon Reliability Testing Root Cause Analysis SPC Design of Experiments IC Device Characterization Product Engineering CMOS CVD Thin Films Microelectronics See 5+     See less Education Ben-Gurion University of the Negev B.Sc,  Materials Engineering and Science 2003  – 2007 Ben-Gurion University of the Negev B.Sc,  Materials Engineering and Science 2003  – 2007 Ben-Gurion University of the Negev B.Sc,  Materials Engineering and Science 2003  – 2007 Ben-Gurion University of the Negev B.Sc,  Materials Engineering and Science 2003  – 2007 ", "Experience Staff Process Integration Engineer Intel Corporation 1989  –  2009  (20 years) NOR Flash Technology Development & Logic Technology Start-up Process Integration Engineer Intel Corporation 1985  –  1988  (3 years) EPROM Technology Development Process/Device Engineer (Telecom) Intel Corporation 1983  –  1985  (2 years) Process/device engineer supporting Telecom group (individual contributor) Process Development Engineer (EPROM) Intel Corporation 1979  –  1983  (4 years) Staff Process Integration Engineer Intel Corporation 1989  –  2009  (20 years) NOR Flash Technology Development & Logic Technology Start-up Staff Process Integration Engineer Intel Corporation 1989  –  2009  (20 years) NOR Flash Technology Development & Logic Technology Start-up Process Integration Engineer Intel Corporation 1985  –  1988  (3 years) EPROM Technology Development Process Integration Engineer Intel Corporation 1985  –  1988  (3 years) EPROM Technology Development Process/Device Engineer (Telecom) Intel Corporation 1983  –  1985  (2 years) Process/device engineer supporting Telecom group (individual contributor) Process/Device Engineer (Telecom) Intel Corporation 1983  –  1985  (2 years) Process/device engineer supporting Telecom group (individual contributor) Process Development Engineer (EPROM) Intel Corporation 1979  –  1983  (4 years) Process Development Engineer (EPROM) Intel Corporation 1979  –  1983  (4 years) Skills Semiconductors Silicon Process Integration CVD Semiconductor Industry IC SPC JMP Yield Design of Experiments CMOS Thin Films Failure Analysis Lithography Engineering Management Metrology Characterization FMEA Semiconductor Process Photolithography PVD See 6+     See less Skills  Semiconductors Silicon Process Integration CVD Semiconductor Industry IC SPC JMP Yield Design of Experiments CMOS Thin Films Failure Analysis Lithography Engineering Management Metrology Characterization FMEA Semiconductor Process Photolithography PVD See 6+     See less Semiconductors Silicon Process Integration CVD Semiconductor Industry IC SPC JMP Yield Design of Experiments CMOS Thin Films Failure Analysis Lithography Engineering Management Metrology Characterization FMEA Semiconductor Process Photolithography PVD See 6+     See less Semiconductors Silicon Process Integration CVD Semiconductor Industry IC SPC JMP Yield Design of Experiments CMOS Thin Films Failure Analysis Lithography Engineering Management Metrology Characterization FMEA Semiconductor Process Photolithography PVD See 6+     See less Education University of California, Davis University of California, Davis University of California, Davis University of California, Davis ", "Summary A hardworking and dedicated engineer with a wide range of experience in semiconductor device processing, process integration, device physics, device characterization (thermal, structural, optical, and electrical), compact modeling. Initiates research and development with a focus on innovation and process/product development. Summary A hardworking and dedicated engineer with a wide range of experience in semiconductor device processing, process integration, device physics, device characterization (thermal, structural, optical, and electrical), compact modeling. Initiates research and development with a focus on innovation and process/product development. A hardworking and dedicated engineer with a wide range of experience in semiconductor device processing, process integration, device physics, device characterization (thermal, structural, optical, and electrical), compact modeling. Initiates research and development with a focus on innovation and process/product development. A hardworking and dedicated engineer with a wide range of experience in semiconductor device processing, process integration, device physics, device characterization (thermal, structural, optical, and electrical), compact modeling. Initiates research and development with a focus on innovation and process/product development. Experience Process Integration Engineer Intel Corporation May 2013  – Present (2 years 4 months) Portland, Oregon Area Electrical Design Engineer Texas Instruments October 2011  –  April 2013  (1 year 7 months) Dallas, TX •\tDeveloped context (layout dependent) model to describe layout effects on electrical properties of SiGe transistors and invented new method for monitoring transistor performance and targeting in logic layouts with high context variation using on-die-parametric modules. (Invention disclosure submitted).  \n•\tConference Presentation - V. Goyal, O. Olubuyide, S. Lin, and X. Zhang, “Design for Manufacturability: Importance and Modeling of Context-Dependent Effects in Advanced Nodes,” 2012 Texas Instruments Yield Conference, Richardson, Texas, July 2012 (http://learningportal.ti.com/events/en-us/2012tiyieldconference/agenda.aspx). \n•\tGained in-depth knowledge of semiconductor device physics, semiconductor processing, device characterization, and compact modeling. \n•\tResponsibilities included – DoE, electrical data analysis to study stress/strain effect on 14nm MOS transistor performance, compact modeling of stress/strain engineering, develop SPICE modeling methodologies. \n•\tCreated test structures and worked closely with lab engineers on device characterization (DC/AC/Transient), data handling, QA, and analysis. Graduate Student Researcher University of California, Riverside March 2008  –  September 2011  (3 years 7 months) Riverside, CA •\tAuthored/co-authored 13 scholarly articles published in premier journals (Nano Lett., Adv. Func. Mat., Appl. Phys. Lett., J. Appl. Phys., etc.) with several more under preparation. Published research has received numerous citations from researchers worldwide and media coverage. \n•\tAround four years of innovative research experience in nano-material and device processing; thermal, electrical, structural, optical and material characterization; design of experiments; novel metrologies. \n•\tDeveloped and synthesized thermal interface materials (TIMs) with graphene filler and enhanced their thermal and electrical properties (Invention disclosure submitted). \n•\tDesigned and fabricated “pseudo-superlattices” by stacking ‘graphene-like’ exfoliated thin films of Bi2Te3; experimentally demonstrated substantial enhancement in ZT figure of merit in such structures (Invention disclosure submitted). \n•\tReported the exceptional thermal and electrical properties of polycrystalline graphene and proposed it as materials for interconnects and heat spreading, and components of composite silicon-graphene substrates, in collaboration with Prof. Andre Geim, University of Manchester, UK (Noble Laureate in Physics, 2010) (Invention disclosure in preparation). \n•\tReported first investigation on ‘graphene-like’ exfoliated atomically thin Bismuth telluride films and nano ribbons (Bi2Te3) for possible thermoelectric figure of merit - ZT enhancement. [Research Highlighted in Nature] [APL Cover]. \n•\tInvestigated and reported superior thermal transport in direct low temperature integrated nanocrystalline diamond (NCD) with GaN for improved thermal management of high-power electronics, in collaboration with Dr. Anirudha V. Sumant, Argonne National Laboratory, USA. \n•\tInvestigated electrically gated graphene-on-diamond devices and reported their high breakdown current density as compared to graphene-on-oxide devices, in collaboration with Argonne National Laboratory, USA. Graduate Student Researcher Semiconductor Research Corporation March 2008  –  September 2011  (3 years 7 months) Software Engineer Infosys October 2006  –  February 2008  (1 year 5 months) Mysore, India •\tCompleted intensive four-month training on C, C++, RDBMS, Oracle, Visual Basic 6.0, UNIX, database handling in Visual basic, error handling in VB, ASP.NET, MSSQL and JAVA scripts.  \n•\tHeld responsibility for code setup, coding, module completion on time, documentation, system integration, unit testing, debugging/fixing bugs, and onsite communication. \n•\tTraveled to client site of COLT Office in Gurgaon, India to negotiate project requirements and deadlines, resulting in project sign-off for speedy understanding of project business and flawless execution.  \n•\tWorked as Software Developer in several projects, including FLOW for British Telecom, UK; CoFEE for Verizon, US; and ECMS for COLT, UK. Developed Verizon FiOS bundle billing software Process Integration Engineer Intel Corporation May 2013  – Present (2 years 4 months) Portland, Oregon Area Process Integration Engineer Intel Corporation May 2013  – Present (2 years 4 months) Portland, Oregon Area Electrical Design Engineer Texas Instruments October 2011  –  April 2013  (1 year 7 months) Dallas, TX •\tDeveloped context (layout dependent) model to describe layout effects on electrical properties of SiGe transistors and invented new method for monitoring transistor performance and targeting in logic layouts with high context variation using on-die-parametric modules. (Invention disclosure submitted).  \n•\tConference Presentation - V. Goyal, O. Olubuyide, S. Lin, and X. Zhang, “Design for Manufacturability: Importance and Modeling of Context-Dependent Effects in Advanced Nodes,” 2012 Texas Instruments Yield Conference, Richardson, Texas, July 2012 (http://learningportal.ti.com/events/en-us/2012tiyieldconference/agenda.aspx). \n•\tGained in-depth knowledge of semiconductor device physics, semiconductor processing, device characterization, and compact modeling. \n•\tResponsibilities included – DoE, electrical data analysis to study stress/strain effect on 14nm MOS transistor performance, compact modeling of stress/strain engineering, develop SPICE modeling methodologies. \n•\tCreated test structures and worked closely with lab engineers on device characterization (DC/AC/Transient), data handling, QA, and analysis. Electrical Design Engineer Texas Instruments October 2011  –  April 2013  (1 year 7 months) Dallas, TX •\tDeveloped context (layout dependent) model to describe layout effects on electrical properties of SiGe transistors and invented new method for monitoring transistor performance and targeting in logic layouts with high context variation using on-die-parametric modules. (Invention disclosure submitted).  \n•\tConference Presentation - V. Goyal, O. Olubuyide, S. Lin, and X. Zhang, “Design for Manufacturability: Importance and Modeling of Context-Dependent Effects in Advanced Nodes,” 2012 Texas Instruments Yield Conference, Richardson, Texas, July 2012 (http://learningportal.ti.com/events/en-us/2012tiyieldconference/agenda.aspx). \n•\tGained in-depth knowledge of semiconductor device physics, semiconductor processing, device characterization, and compact modeling. \n•\tResponsibilities included – DoE, electrical data analysis to study stress/strain effect on 14nm MOS transistor performance, compact modeling of stress/strain engineering, develop SPICE modeling methodologies. \n•\tCreated test structures and worked closely with lab engineers on device characterization (DC/AC/Transient), data handling, QA, and analysis. Graduate Student Researcher University of California, Riverside March 2008  –  September 2011  (3 years 7 months) Riverside, CA •\tAuthored/co-authored 13 scholarly articles published in premier journals (Nano Lett., Adv. Func. Mat., Appl. Phys. Lett., J. Appl. Phys., etc.) with several more under preparation. Published research has received numerous citations from researchers worldwide and media coverage. \n•\tAround four years of innovative research experience in nano-material and device processing; thermal, electrical, structural, optical and material characterization; design of experiments; novel metrologies. \n•\tDeveloped and synthesized thermal interface materials (TIMs) with graphene filler and enhanced their thermal and electrical properties (Invention disclosure submitted). \n•\tDesigned and fabricated “pseudo-superlattices” by stacking ‘graphene-like’ exfoliated thin films of Bi2Te3; experimentally demonstrated substantial enhancement in ZT figure of merit in such structures (Invention disclosure submitted). \n•\tReported the exceptional thermal and electrical properties of polycrystalline graphene and proposed it as materials for interconnects and heat spreading, and components of composite silicon-graphene substrates, in collaboration with Prof. Andre Geim, University of Manchester, UK (Noble Laureate in Physics, 2010) (Invention disclosure in preparation). \n•\tReported first investigation on ‘graphene-like’ exfoliated atomically thin Bismuth telluride films and nano ribbons (Bi2Te3) for possible thermoelectric figure of merit - ZT enhancement. [Research Highlighted in Nature] [APL Cover]. \n•\tInvestigated and reported superior thermal transport in direct low temperature integrated nanocrystalline diamond (NCD) with GaN for improved thermal management of high-power electronics, in collaboration with Dr. Anirudha V. Sumant, Argonne National Laboratory, USA. \n•\tInvestigated electrically gated graphene-on-diamond devices and reported their high breakdown current density as compared to graphene-on-oxide devices, in collaboration with Argonne National Laboratory, USA. Graduate Student Researcher University of California, Riverside March 2008  –  September 2011  (3 years 7 months) Riverside, CA •\tAuthored/co-authored 13 scholarly articles published in premier journals (Nano Lett., Adv. Func. Mat., Appl. Phys. Lett., J. Appl. Phys., etc.) with several more under preparation. Published research has received numerous citations from researchers worldwide and media coverage. \n•\tAround four years of innovative research experience in nano-material and device processing; thermal, electrical, structural, optical and material characterization; design of experiments; novel metrologies. \n•\tDeveloped and synthesized thermal interface materials (TIMs) with graphene filler and enhanced their thermal and electrical properties (Invention disclosure submitted). \n•\tDesigned and fabricated “pseudo-superlattices” by stacking ‘graphene-like’ exfoliated thin films of Bi2Te3; experimentally demonstrated substantial enhancement in ZT figure of merit in such structures (Invention disclosure submitted). \n•\tReported the exceptional thermal and electrical properties of polycrystalline graphene and proposed it as materials for interconnects and heat spreading, and components of composite silicon-graphene substrates, in collaboration with Prof. Andre Geim, University of Manchester, UK (Noble Laureate in Physics, 2010) (Invention disclosure in preparation). \n•\tReported first investigation on ‘graphene-like’ exfoliated atomically thin Bismuth telluride films and nano ribbons (Bi2Te3) for possible thermoelectric figure of merit - ZT enhancement. [Research Highlighted in Nature] [APL Cover]. \n•\tInvestigated and reported superior thermal transport in direct low temperature integrated nanocrystalline diamond (NCD) with GaN for improved thermal management of high-power electronics, in collaboration with Dr. Anirudha V. Sumant, Argonne National Laboratory, USA. \n•\tInvestigated electrically gated graphene-on-diamond devices and reported their high breakdown current density as compared to graphene-on-oxide devices, in collaboration with Argonne National Laboratory, USA. Graduate Student Researcher Semiconductor Research Corporation March 2008  –  September 2011  (3 years 7 months) Graduate Student Researcher Semiconductor Research Corporation March 2008  –  September 2011  (3 years 7 months) Software Engineer Infosys October 2006  –  February 2008  (1 year 5 months) Mysore, India •\tCompleted intensive four-month training on C, C++, RDBMS, Oracle, Visual Basic 6.0, UNIX, database handling in Visual basic, error handling in VB, ASP.NET, MSSQL and JAVA scripts.  \n•\tHeld responsibility for code setup, coding, module completion on time, documentation, system integration, unit testing, debugging/fixing bugs, and onsite communication. \n•\tTraveled to client site of COLT Office in Gurgaon, India to negotiate project requirements and deadlines, resulting in project sign-off for speedy understanding of project business and flawless execution.  \n•\tWorked as Software Developer in several projects, including FLOW for British Telecom, UK; CoFEE for Verizon, US; and ECMS for COLT, UK. Developed Verizon FiOS bundle billing software Software Engineer Infosys October 2006  –  February 2008  (1 year 5 months) Mysore, India •\tCompleted intensive four-month training on C, C++, RDBMS, Oracle, Visual Basic 6.0, UNIX, database handling in Visual basic, error handling in VB, ASP.NET, MSSQL and JAVA scripts.  \n•\tHeld responsibility for code setup, coding, module completion on time, documentation, system integration, unit testing, debugging/fixing bugs, and onsite communication. \n•\tTraveled to client site of COLT Office in Gurgaon, India to negotiate project requirements and deadlines, resulting in project sign-off for speedy understanding of project business and flawless execution.  \n•\tWorked as Software Developer in several projects, including FLOW for British Telecom, UK; CoFEE for Verizon, US; and ECMS for COLT, UK. Developed Verizon FiOS bundle billing software Skills C C++ Photolithography Characterization AFM Thermal... Material... Electrical... Semiconductor... SPICE BSIM4 Matlab COMSOL Perl Unix Mathematica OriginLab Rhino Oracle RDBMS VBScript MSSQL VB6 ASP.NET Java Nanofabrication Device Characterization Semiconductor Device Design of Experiments Thin Films Physics Simulations Semiconductors R&D Electronics Nanotechnology IC CMOS VLSI Scanning Electron... Engineering Circuit Design See 26+     See less Skills  C C++ Photolithography Characterization AFM Thermal... Material... Electrical... Semiconductor... SPICE BSIM4 Matlab COMSOL Perl Unix Mathematica OriginLab Rhino Oracle RDBMS VBScript MSSQL VB6 ASP.NET Java Nanofabrication Device Characterization Semiconductor Device Design of Experiments Thin Films Physics Simulations Semiconductors R&D Electronics Nanotechnology IC CMOS VLSI Scanning Electron... Engineering Circuit Design See 26+     See less C C++ Photolithography Characterization AFM Thermal... Material... Electrical... Semiconductor... SPICE BSIM4 Matlab COMSOL Perl Unix Mathematica OriginLab Rhino Oracle RDBMS VBScript MSSQL VB6 ASP.NET Java Nanofabrication Device Characterization Semiconductor Device Design of Experiments Thin Films Physics Simulations Semiconductors R&D Electronics Nanotechnology IC CMOS VLSI Scanning Electron... Engineering Circuit Design See 26+     See less C C++ Photolithography Characterization AFM Thermal... Material... Electrical... Semiconductor... SPICE BSIM4 Matlab COMSOL Perl Unix Mathematica OriginLab Rhino Oracle RDBMS VBScript MSSQL VB6 ASP.NET Java Nanofabrication Device Characterization Semiconductor Device Design of Experiments Thin Films Physics Simulations Semiconductors R&D Electronics Nanotechnology IC CMOS VLSI Scanning Electron... Engineering Circuit Design See 26+     See less Education University of California, Riverside PhD,  Electrical Engineering , 4.0/4.0 2008  – 2011 Activities and Societies:  SRC ,  IEEE ,  MRS ,  FENA ,  FCRP ,  OSA ,  SPIE University of California, Riverside M.S.,  Electrical Engineering 2008  – 2009 GPA: 3.97/4.0 Activities and Societies:  SRC ,  IEEE ,  MRS ,  FCRP ,  FENA.. Gurukula Kangri University B.S.,  Electrical Engineering , 4.0/4.0 2002  – 2006 Activities and Societies:  IEEE Asha Modern School University of California, Riverside PhD,  Electrical Engineering , 4.0/4.0 2008  – 2011 Activities and Societies:  SRC ,  IEEE ,  MRS ,  FENA ,  FCRP ,  OSA ,  SPIE University of California, Riverside PhD,  Electrical Engineering , 4.0/4.0 2008  – 2011 Activities and Societies:  SRC ,  IEEE ,  MRS ,  FENA ,  FCRP ,  OSA ,  SPIE University of California, Riverside PhD,  Electrical Engineering , 4.0/4.0 2008  – 2011 Activities and Societies:  SRC ,  IEEE ,  MRS ,  FENA ,  FCRP ,  OSA ,  SPIE University of California, Riverside M.S.,  Electrical Engineering 2008  – 2009 GPA: 3.97/4.0 Activities and Societies:  SRC ,  IEEE ,  MRS ,  FCRP ,  FENA.. University of California, Riverside M.S.,  Electrical Engineering 2008  – 2009 GPA: 3.97/4.0 Activities and Societies:  SRC ,  IEEE ,  MRS ,  FCRP ,  FENA.. University of California, Riverside M.S.,  Electrical Engineering 2008  – 2009 GPA: 3.97/4.0 Activities and Societies:  SRC ,  IEEE ,  MRS ,  FCRP ,  FENA.. Gurukula Kangri University B.S.,  Electrical Engineering , 4.0/4.0 2002  – 2006 Activities and Societies:  IEEE Gurukula Kangri University B.S.,  Electrical Engineering , 4.0/4.0 2002  – 2006 Activities and Societies:  IEEE Gurukula Kangri University B.S.,  Electrical Engineering , 4.0/4.0 2002  – 2006 Activities and Societies:  IEEE Asha Modern School Asha Modern School Asha Modern School Honors & Awards Additional Honors & Awards •Recipient of UC Riverside Dean’s Dissertation Research Grant Award (2011) \n•\tRecipient of Dean’s distinguished PhD Fellowship Award, Bourns College of Engineering, University of California-Riverside (2008-2010) \n•\tRecipient of Young Scientist Award, 38th conference on the Physics & Chemistry of Surfaces & Interfaces (PCSI-38), San Diego, CA, January 16-20, 2011. \n•\tRecipient of MRS Poster Silver Medal Award, MRS Spring Meeting, San Francisco, CA, April 2011.  \n•\tRecipient of Best Poster Award, Physics and Chemistry of Surfaces, San Diego, CA, Jan-2011. \n•\tDemonstrated exceptional performance in graduate school by completing my Masters and PhD degrees in a total time period of three and a half years. \n•\tRecipient of RANK-1 award in my undergraduate major (Electronics and Communication Engineering) with an aggregate of 80.43% marks, equivalent to 4.0/4.0 GPA. Additional Honors & Awards •Recipient of UC Riverside Dean’s Dissertation Research Grant Award (2011) \n•\tRecipient of Dean’s distinguished PhD Fellowship Award, Bourns College of Engineering, University of California-Riverside (2008-2010) \n•\tRecipient of Young Scientist Award, 38th conference on the Physics & Chemistry of Surfaces & Interfaces (PCSI-38), San Diego, CA, January 16-20, 2011. \n•\tRecipient of MRS Poster Silver Medal Award, MRS Spring Meeting, San Francisco, CA, April 2011.  \n•\tRecipient of Best Poster Award, Physics and Chemistry of Surfaces, San Diego, CA, Jan-2011. \n•\tDemonstrated exceptional performance in graduate school by completing my Masters and PhD degrees in a total time period of three and a half years. \n•\tRecipient of RANK-1 award in my undergraduate major (Electronics and Communication Engineering) with an aggregate of 80.43% marks, equivalent to 4.0/4.0 GPA. Additional Honors & Awards •Recipient of UC Riverside Dean’s Dissertation Research Grant Award (2011) \n•\tRecipient of Dean’s distinguished PhD Fellowship Award, Bourns College of Engineering, University of California-Riverside (2008-2010) \n•\tRecipient of Young Scientist Award, 38th conference on the Physics & Chemistry of Surfaces & Interfaces (PCSI-38), San Diego, CA, January 16-20, 2011. \n•\tRecipient of MRS Poster Silver Medal Award, MRS Spring Meeting, San Francisco, CA, April 2011.  \n•\tRecipient of Best Poster Award, Physics and Chemistry of Surfaces, San Diego, CA, Jan-2011. \n•\tDemonstrated exceptional performance in graduate school by completing my Masters and PhD degrees in a total time period of three and a half years. \n•\tRecipient of RANK-1 award in my undergraduate major (Electronics and Communication Engineering) with an aggregate of 80.43% marks, equivalent to 4.0/4.0 GPA. Additional Honors & Awards •Recipient of UC Riverside Dean’s Dissertation Research Grant Award (2011) \n•\tRecipient of Dean’s distinguished PhD Fellowship Award, Bourns College of Engineering, University of California-Riverside (2008-2010) \n•\tRecipient of Young Scientist Award, 38th conference on the Physics & Chemistry of Surfaces & Interfaces (PCSI-38), San Diego, CA, January 16-20, 2011. \n•\tRecipient of MRS Poster Silver Medal Award, MRS Spring Meeting, San Francisco, CA, April 2011.  \n•\tRecipient of Best Poster Award, Physics and Chemistry of Surfaces, San Diego, CA, Jan-2011. \n•\tDemonstrated exceptional performance in graduate school by completing my Masters and PhD degrees in a total time period of three and a half years. \n•\tRecipient of RANK-1 award in my undergraduate major (Electronics and Communication Engineering) with an aggregate of 80.43% marks, equivalent to 4.0/4.0 GPA. ", "Experience Process Integration Engineer Intel Corporation March 2011  – Present (4 years 6 months) Senior Process Engineer Intel Corporation June 2005  –  March 2011  (5 years 10 months) Process Integration Engineer Intel Corporation March 2011  – Present (4 years 6 months) Process Integration Engineer Intel Corporation March 2011  – Present (4 years 6 months) Senior Process Engineer Intel Corporation June 2005  –  March 2011  (5 years 10 months) Senior Process Engineer Intel Corporation June 2005  –  March 2011  (5 years 10 months) Skills JMP Semiconductors CMOS Process Integration Skills  JMP Semiconductors CMOS Process Integration JMP Semiconductors CMOS Process Integration JMP Semiconductors CMOS Process Integration Education University of Florida 1992  – 2004 University of Florida 1992  – 2004 University of Florida 1992  – 2004 University of Florida 1992  – 2004 ", "Summary Collaborative & analytical engineer responsible for successful delivery of next-generation manufacturing processes in high technology industry. Lead cross-functional teams to integrate and optimize complex process improvements to meet rapidly scaling product specifications. Ramp processes from design to high-volume, high-yield manufacturing to enable aggressive product cadence of semiconductor industry. Broad expertise in product development, experimental designs, failure analysis, design for manufacturability. Summary Collaborative & analytical engineer responsible for successful delivery of next-generation manufacturing processes in high technology industry. Lead cross-functional teams to integrate and optimize complex process improvements to meet rapidly scaling product specifications. Ramp processes from design to high-volume, high-yield manufacturing to enable aggressive product cadence of semiconductor industry. Broad expertise in product development, experimental designs, failure analysis, design for manufacturability. Collaborative & analytical engineer responsible for successful delivery of next-generation manufacturing processes in high technology industry. Lead cross-functional teams to integrate and optimize complex process improvements to meet rapidly scaling product specifications. Ramp processes from design to high-volume, high-yield manufacturing to enable aggressive product cadence of semiconductor industry. Broad expertise in product development, experimental designs, failure analysis, design for manufacturability. Collaborative & analytical engineer responsible for successful delivery of next-generation manufacturing processes in high technology industry. Lead cross-functional teams to integrate and optimize complex process improvements to meet rapidly scaling product specifications. Ramp processes from design to high-volume, high-yield manufacturing to enable aggressive product cadence of semiconductor industry. Broad expertise in product development, experimental designs, failure analysis, design for manufacturability. Experience Process Integration Engineer Intel Corporation September 2005  – Present (10 years) Integration engineer in Intel Mask Operations responsible for successful delivery of 32, 22, 14, 10nm photomask processes and development of 7nm process technology. Optimize one-generation-ahead photomask process capabilities to meet wafer lithography process and photomask data synthesis requirements. RET engineer Intel July 2003  –  August 2005  (2 years 2 months) Built photolithography models for phase-shift masks and double patterning of poly gate layer in 65 & 45nm nodes. Gained insight into photomask data synthesis, pattern complexity and capability requirements. Research Programmer National Center for Supercomputing Applications January 2002  –  June 2003  (1 year 6 months) Urbana-Champaign, Illinois Area Optimized commercial software on supercomputers, resulting in 35% decrease in computational cost. Process Integration Engineer Intel Corporation September 2005  – Present (10 years) Integration engineer in Intel Mask Operations responsible for successful delivery of 32, 22, 14, 10nm photomask processes and development of 7nm process technology. Optimize one-generation-ahead photomask process capabilities to meet wafer lithography process and photomask data synthesis requirements. Process Integration Engineer Intel Corporation September 2005  – Present (10 years) Integration engineer in Intel Mask Operations responsible for successful delivery of 32, 22, 14, 10nm photomask processes and development of 7nm process technology. Optimize one-generation-ahead photomask process capabilities to meet wafer lithography process and photomask data synthesis requirements. RET engineer Intel July 2003  –  August 2005  (2 years 2 months) Built photolithography models for phase-shift masks and double patterning of poly gate layer in 65 & 45nm nodes. Gained insight into photomask data synthesis, pattern complexity and capability requirements. RET engineer Intel July 2003  –  August 2005  (2 years 2 months) Built photolithography models for phase-shift masks and double patterning of poly gate layer in 65 & 45nm nodes. Gained insight into photomask data synthesis, pattern complexity and capability requirements. Research Programmer National Center for Supercomputing Applications January 2002  –  June 2003  (1 year 6 months) Urbana-Champaign, Illinois Area Optimized commercial software on supercomputers, resulting in 35% decrease in computational cost. Research Programmer National Center for Supercomputing Applications January 2002  –  June 2003  (1 year 6 months) Urbana-Champaign, Illinois Area Optimized commercial software on supercomputers, resulting in 35% decrease in computational cost. Languages English Chinese English Chinese English Chinese Skills Semiconductors Manufacturing Engineering Product Development Cross-functional Team... Testing Electronics Process Engineering SPC Design of Experiments Semiconductor Industry Skills  Semiconductors Manufacturing Engineering Product Development Cross-functional Team... Testing Electronics Process Engineering SPC Design of Experiments Semiconductor Industry Semiconductors Manufacturing Engineering Product Development Cross-functional Team... Testing Electronics Process Engineering SPC Design of Experiments Semiconductor Industry Semiconductors Manufacturing Engineering Product Development Cross-functional Team... Testing Electronics Process Engineering SPC Design of Experiments Semiconductor Industry Education University of Illinois at Urbana-Champaign Doctor of Philosophy (Ph.D.),  Theoretical and applied mechanics 1996  – 2001 Developed a highly-parallel numerical simulation code for turbulent aerodynamic flow. Conducted simulations and post-processing on supercomputing platforms. University of Illinois at Urbana-Champaign Master of Science (M.S.),  Theoretical and Applied Mechanics 1996  – 1999 Developed high-resolution, cost-effective spline numerical schemes for fluid flow simulations in complex geometry. The University of Hong Kong Bachelor of Engineering (B.Eng.),  Mechanical Engineering 1993  – 1996 University of Illinois at Urbana-Champaign Doctor of Philosophy (Ph.D.),  Theoretical and applied mechanics 1996  – 2001 Developed a highly-parallel numerical simulation code for turbulent aerodynamic flow. Conducted simulations and post-processing on supercomputing platforms. University of Illinois at Urbana-Champaign Doctor of Philosophy (Ph.D.),  Theoretical and applied mechanics 1996  – 2001 Developed a highly-parallel numerical simulation code for turbulent aerodynamic flow. Conducted simulations and post-processing on supercomputing platforms. University of Illinois at Urbana-Champaign Doctor of Philosophy (Ph.D.),  Theoretical and applied mechanics 1996  – 2001 Developed a highly-parallel numerical simulation code for turbulent aerodynamic flow. Conducted simulations and post-processing on supercomputing platforms. University of Illinois at Urbana-Champaign Master of Science (M.S.),  Theoretical and Applied Mechanics 1996  – 1999 Developed high-resolution, cost-effective spline numerical schemes for fluid flow simulations in complex geometry. University of Illinois at Urbana-Champaign Master of Science (M.S.),  Theoretical and Applied Mechanics 1996  – 1999 Developed high-resolution, cost-effective spline numerical schemes for fluid flow simulations in complex geometry. University of Illinois at Urbana-Champaign Master of Science (M.S.),  Theoretical and Applied Mechanics 1996  – 1999 Developed high-resolution, cost-effective spline numerical schemes for fluid flow simulations in complex geometry. The University of Hong Kong Bachelor of Engineering (B.Eng.),  Mechanical Engineering 1993  – 1996 The University of Hong Kong Bachelor of Engineering (B.Eng.),  Mechanical Engineering 1993  – 1996 The University of Hong Kong Bachelor of Engineering (B.Eng.),  Mechanical Engineering 1993  – 1996 ", "Summary Materials scientist with broad expertise in characterization of electronic materials including lithium-ion battery materials, photovoltaic materials, and materials for advanced microelectronics. Inventor of novel apparatuses which enabled in situ and in operando experiments in vacuum, high-temperature, and high-magnetic-field environments. Experienced in synchrotron X-ray methods using both hard and soft X-ray energies. Experienced in developing thin film deposition methods for photovoltaic and insulator films. Summary Materials scientist with broad expertise in characterization of electronic materials including lithium-ion battery materials, photovoltaic materials, and materials for advanced microelectronics. Inventor of novel apparatuses which enabled in situ and in operando experiments in vacuum, high-temperature, and high-magnetic-field environments. Experienced in synchrotron X-ray methods using both hard and soft X-ray energies. Experienced in developing thin film deposition methods for photovoltaic and insulator films. Materials scientist with broad expertise in characterization of electronic materials including lithium-ion battery materials, photovoltaic materials, and materials for advanced microelectronics. Inventor of novel apparatuses which enabled in situ and in operando experiments in vacuum, high-temperature, and high-magnetic-field environments. Experienced in synchrotron X-ray methods using both hard and soft X-ray energies. Experienced in developing thin film deposition methods for photovoltaic and insulator films. Materials scientist with broad expertise in characterization of electronic materials including lithium-ion battery materials, photovoltaic materials, and materials for advanced microelectronics. Inventor of novel apparatuses which enabled in situ and in operando experiments in vacuum, high-temperature, and high-magnetic-field environments. Experienced in synchrotron X-ray methods using both hard and soft X-ray energies. Experienced in developing thin film deposition methods for photovoltaic and insulator films. Experience Process Integration Engineer Intel Corporation July 2013  – Present (2 years 2 months) PhD Student Georgia Institute of Technology August 2007  –  December 2012  (5 years 5 months) invented in operando soft X-ray absorption spectroscopy (XAS) technique at the National Synchrotron Light Source (NSLS) using powder pellet lithium-ion batteries to study powder-based cathode materials. \n \nDeveloped pouch-cell lithium batteries for in operando hard X-ray XAS at NSLS using the same active materials as with soft X-ray spectroscopy in order to prove an element-specific mechanism of charge compensation for an overlithiated cathode material. \n \nOptimized heat treatment of chalcogenide glass-ceramic so lid electrolyte to improve ionic conductivity. \n \nDeveloped new in operando soft X-ray technique to measure charge compensation in thin film lithium-ion memristors based on cathode-like materials. \n \nTrained and managed team of undergraduates in lithium-ion battery construction and characterization after establishing a new battery laboratory at Georgia Tech while managing procurement, chemical inventory, and glovebox maintenance. Master's Student Iowa State University January 2006  –  May 2007  (1 year 5 months) Thin film hydrogenated amorphous silicon without the expensive plasma equipment. Intern Micron Technology 2007  –  2007  (less than a year) Programmed CVD tool to fabricate thin films of SiONx for NAND flash, worked with optical characterization team to make ellipsometric models across the compositional range. Process Integration Engineer Intel Corporation July 2013  – Present (2 years 2 months) Process Integration Engineer Intel Corporation July 2013  – Present (2 years 2 months) PhD Student Georgia Institute of Technology August 2007  –  December 2012  (5 years 5 months) invented in operando soft X-ray absorption spectroscopy (XAS) technique at the National Synchrotron Light Source (NSLS) using powder pellet lithium-ion batteries to study powder-based cathode materials. \n \nDeveloped pouch-cell lithium batteries for in operando hard X-ray XAS at NSLS using the same active materials as with soft X-ray spectroscopy in order to prove an element-specific mechanism of charge compensation for an overlithiated cathode material. \n \nOptimized heat treatment of chalcogenide glass-ceramic so lid electrolyte to improve ionic conductivity. \n \nDeveloped new in operando soft X-ray technique to measure charge compensation in thin film lithium-ion memristors based on cathode-like materials. \n \nTrained and managed team of undergraduates in lithium-ion battery construction and characterization after establishing a new battery laboratory at Georgia Tech while managing procurement, chemical inventory, and glovebox maintenance. PhD Student Georgia Institute of Technology August 2007  –  December 2012  (5 years 5 months) invented in operando soft X-ray absorption spectroscopy (XAS) technique at the National Synchrotron Light Source (NSLS) using powder pellet lithium-ion batteries to study powder-based cathode materials. \n \nDeveloped pouch-cell lithium batteries for in operando hard X-ray XAS at NSLS using the same active materials as with soft X-ray spectroscopy in order to prove an element-specific mechanism of charge compensation for an overlithiated cathode material. \n \nOptimized heat treatment of chalcogenide glass-ceramic so lid electrolyte to improve ionic conductivity. \n \nDeveloped new in operando soft X-ray technique to measure charge compensation in thin film lithium-ion memristors based on cathode-like materials. \n \nTrained and managed team of undergraduates in lithium-ion battery construction and characterization after establishing a new battery laboratory at Georgia Tech while managing procurement, chemical inventory, and glovebox maintenance. Master's Student Iowa State University January 2006  –  May 2007  (1 year 5 months) Thin film hydrogenated amorphous silicon without the expensive plasma equipment. Master's Student Iowa State University January 2006  –  May 2007  (1 year 5 months) Thin film hydrogenated amorphous silicon without the expensive plasma equipment. Intern Micron Technology 2007  –  2007  (less than a year) Programmed CVD tool to fabricate thin films of SiONx for NAND flash, worked with optical characterization team to make ellipsometric models across the compositional range. Intern Micron Technology 2007  –  2007  (less than a year) Programmed CVD tool to fabricate thin films of SiONx for NAND flash, worked with optical characterization team to make ellipsometric models across the compositional range. Languages English Native or bilingual proficiency Spanish Limited working proficiency English Native or bilingual proficiency Spanish Limited working proficiency English Native or bilingual proficiency Spanish Limited working proficiency Native or bilingual proficiency Limited working proficiency Skills Thin Film... Solid State... Electrochemical... Materials Science Synchrotron... Solidworks Thin Films Characterization Skills  Thin Film... Solid State... Electrochemical... Materials Science Synchrotron... Solidworks Thin Films Characterization Thin Film... Solid State... Electrochemical... Materials Science Synchrotron... Solidworks Thin Films Characterization Thin Film... Solid State... Electrochemical... Materials Science Synchrotron... Solidworks Thin Films Characterization Education Georgia Institute of Technology PhD,  Materials Science 2007  – 2012 Iowa State University Masters of Science,  Electrical and Electronics Engineering 2001  – 2007 DHS Georgia Institute of Technology PhD,  Materials Science 2007  – 2012 Georgia Institute of Technology PhD,  Materials Science 2007  – 2012 Georgia Institute of Technology PhD,  Materials Science 2007  – 2012 Iowa State University Masters of Science,  Electrical and Electronics Engineering 2001  – 2007 Iowa State University Masters of Science,  Electrical and Electronics Engineering 2001  – 2007 Iowa State University Masters of Science,  Electrical and Electronics Engineering 2001  – 2007 DHS DHS DHS "]}