{"position": "Production Control Manager", "company": "Intel Corporation", "profiles": ["Skills Program Management Testing Leadership Product Development Management Start-ups Manufacturing New Business Development Sales Quality Assurance Cross-functional Team... Entrepreneurship Automation Electronics Process Improvement Networking System Testing Team Building PCB design Six Sigma Engineering Management Test Automation Team Leadership See 8+     See less Skills  Program Management Testing Leadership Product Development Management Start-ups Manufacturing New Business Development Sales Quality Assurance Cross-functional Team... Entrepreneurship Automation Electronics Process Improvement Networking System Testing Team Building PCB design Six Sigma Engineering Management Test Automation Team Leadership See 8+     See less Program Management Testing Leadership Product Development Management Start-ups Manufacturing New Business Development Sales Quality Assurance Cross-functional Team... Entrepreneurship Automation Electronics Process Improvement Networking System Testing Team Building PCB design Six Sigma Engineering Management Test Automation Team Leadership See 8+     See less Program Management Testing Leadership Product Development Management Start-ups Manufacturing New Business Development Sales Quality Assurance Cross-functional Team... Entrepreneurship Automation Electronics Process Improvement Networking System Testing Team Building PCB design Six Sigma Engineering Management Test Automation Team Leadership See 8+     See less ", "Summary Learning never stops for me - we don't know what we don't know. My stand is to continue discover the unknown and in the process, make a difference in people's lives as long as I'm here. \n \nI have proven leadership and management skills in the manufacturing and service industries, work effectively across diverse cultures and am comfortable in a multinational environment. I have direct experience in setting up a major manufacturing start-up operation in China.  \n \nSpecialties: Manufacturing and Operations Management, Environmental, Health & Safety, Industrial Engineering, Project Management, Mfg. Engineering, Training Summary Learning never stops for me - we don't know what we don't know. My stand is to continue discover the unknown and in the process, make a difference in people's lives as long as I'm here. \n \nI have proven leadership and management skills in the manufacturing and service industries, work effectively across diverse cultures and am comfortable in a multinational environment. I have direct experience in setting up a major manufacturing start-up operation in China.  \n \nSpecialties: Manufacturing and Operations Management, Environmental, Health & Safety, Industrial Engineering, Project Management, Mfg. Engineering, Training Learning never stops for me - we don't know what we don't know. My stand is to continue discover the unknown and in the process, make a difference in people's lives as long as I'm here. \n \nI have proven leadership and management skills in the manufacturing and service industries, work effectively across diverse cultures and am comfortable in a multinational environment. I have direct experience in setting up a major manufacturing start-up operation in China.  \n \nSpecialties: Manufacturing and Operations Management, Environmental, Health & Safety, Industrial Engineering, Project Management, Mfg. Engineering, Training Learning never stops for me - we don't know what we don't know. My stand is to continue discover the unknown and in the process, make a difference in people's lives as long as I'm here. \n \nI have proven leadership and management skills in the manufacturing and service industries, work effectively across diverse cultures and am comfortable in a multinational environment. I have direct experience in setting up a major manufacturing start-up operation in China.  \n \nSpecialties: Manufacturing and Operations Management, Environmental, Health & Safety, Industrial Engineering, Project Management, Mfg. Engineering, Training Experience Senior Associate JMJ Associates July 2007  – Present (8 years 2 months) Philippines Lead project engagements of the company in the oil & gas, mining and electronics industries in various countries of Southeast Asia with the following responsibilities:  \n1) Provide consultancy services in creating a High Performance Organization and an Incident and Injury-Free culture that moves organizations from 'good to great',  \n2) Conduct integral safety assessments and pulse surveys to determine what is so in the organization and create opportunities for breakthrough performance \n3) Deliver workshops on Leadership Alignment and Expectations, IIF Commitment, IIF Orientation, Supervisory Skills, IIF in Action and Train-the-Trainer \n4) Coach Project Leadership Teams, Senior Managers, Middle Managers and Front-line Supervisors  \n5) Partner with our clients in bringing about organizational transformation and unleashing the potential of people and organizations to achieve extraordinary results Asia Region EHS manager Intel Corporation 2002  –  2006  (4 years) Philippines Overall coordination of EHS functions in Intel factories and offices located in China, Malaysia, Philippines, India, Japan and Taiwan with primary responsibility for consistent and exemplary performance to the standards of the company as well as those of the countries operated in Philippines Site Environmental, Health and Safety Manager Intel Corporation August 2000  –  August 2001  (1 year 1 month) Philippines Overall responsibility for EHS functions in the Intel Philippines mfg. site and support offices with primary focus on consistently performing to the standards of Intel as well as the Philippine government Flash Manufacturing Manager Intel Corporation January 1999  –  July 2000  (1 year 7 months) Philippines Overall responsibilty for operational and cost effectiveness of the Flash manufacturing operation of the site which assembles, tests and ships the highest volume of Intel products world-wide Assembly Manufacturing Manager & Assembly/Test Planning Mgr. Intel Corporation October 1995  –  August 1998  (2 years 11 months) Shanghai City, China Overall responsibility for starting up and ramping the Flash Assembly Mfg. line, setting up and organizing the product planning process and training the local senior staff in these departments in the first Intel Assembly/Test plant in China. Assemybly Mfg. Manager & Flash SOP Operations Manager Intel Corporation 1989  –  September 1995  (6 years) Philippines Overall responsibility for all assembly manufacturing activities and subsequently, the Small Outline Package (SOP) assembly and test manufacturing line in the site with the primary objective of achieving operational and cost effectiveness Industrial Engineering Manager & Mfg. Engineering Manager Intel Corporation 1985  –  1989  (4 years) Philippines Overall responsibility for industrial and manufacturing engineering functions in the Philippines site with primary focus on direct labor productivity, capacity planning, tool room operations and direct/indirect training Bubble Memory Operations Manager Intel Corporation 1985  –  1987  (2 years) Philippines Overall responsibility for the assembly and test of bubble memory products for all of Intel with primary focus on output, quality and cost Regional Production Control Manager Intel Corporation September 1984  –  July 1985  (11 months) Philippines Overall responsibility for coordinating the production control functions for assembly/test subcontractors of Intel in Asia, specifically in Korea and Hong Kong Industrial Engineering and Forms Management Division Manager Philippine Air Lines January 1982  –  August 1984  (2 years 8 months) Industrial Engineering and Forms Management, Non-aircraft capital planning and evaluation, Linear programming, Queueing Theory, Manpower Determination Watch Manufacturing and Watchband Operations Manager Timex Watch Manufacturing 1981  –  1982  (1 year) Philippines Overall responsibility for the assembly & test of electronic analog and digital watches as well as the assembly of watchbands of TIMEX in the Philippine plant, including engineering and tool room support functions Industrial Engineering Manager Timex Watch Manufacturing, Inc. July 1978  –  1981  (3 years) Philippines Overall responsibility for industrial engineering functions in the Philippine plant with primary focus on direct labor productivity, methods improvement, costbook maintenance, capital expense evaluation and mfg. systems Senior Associate JMJ Associates July 2007  – Present (8 years 2 months) Philippines Lead project engagements of the company in the oil & gas, mining and electronics industries in various countries of Southeast Asia with the following responsibilities:  \n1) Provide consultancy services in creating a High Performance Organization and an Incident and Injury-Free culture that moves organizations from 'good to great',  \n2) Conduct integral safety assessments and pulse surveys to determine what is so in the organization and create opportunities for breakthrough performance \n3) Deliver workshops on Leadership Alignment and Expectations, IIF Commitment, IIF Orientation, Supervisory Skills, IIF in Action and Train-the-Trainer \n4) Coach Project Leadership Teams, Senior Managers, Middle Managers and Front-line Supervisors  \n5) Partner with our clients in bringing about organizational transformation and unleashing the potential of people and organizations to achieve extraordinary results Senior Associate JMJ Associates July 2007  – Present (8 years 2 months) Philippines Lead project engagements of the company in the oil & gas, mining and electronics industries in various countries of Southeast Asia with the following responsibilities:  \n1) Provide consultancy services in creating a High Performance Organization and an Incident and Injury-Free culture that moves organizations from 'good to great',  \n2) Conduct integral safety assessments and pulse surveys to determine what is so in the organization and create opportunities for breakthrough performance \n3) Deliver workshops on Leadership Alignment and Expectations, IIF Commitment, IIF Orientation, Supervisory Skills, IIF in Action and Train-the-Trainer \n4) Coach Project Leadership Teams, Senior Managers, Middle Managers and Front-line Supervisors  \n5) Partner with our clients in bringing about organizational transformation and unleashing the potential of people and organizations to achieve extraordinary results Asia Region EHS manager Intel Corporation 2002  –  2006  (4 years) Philippines Overall coordination of EHS functions in Intel factories and offices located in China, Malaysia, Philippines, India, Japan and Taiwan with primary responsibility for consistent and exemplary performance to the standards of the company as well as those of the countries operated in Asia Region EHS manager Intel Corporation 2002  –  2006  (4 years) Philippines Overall coordination of EHS functions in Intel factories and offices located in China, Malaysia, Philippines, India, Japan and Taiwan with primary responsibility for consistent and exemplary performance to the standards of the company as well as those of the countries operated in Philippines Site Environmental, Health and Safety Manager Intel Corporation August 2000  –  August 2001  (1 year 1 month) Philippines Overall responsibility for EHS functions in the Intel Philippines mfg. site and support offices with primary focus on consistently performing to the standards of Intel as well as the Philippine government Philippines Site Environmental, Health and Safety Manager Intel Corporation August 2000  –  August 2001  (1 year 1 month) Philippines Overall responsibility for EHS functions in the Intel Philippines mfg. site and support offices with primary focus on consistently performing to the standards of Intel as well as the Philippine government Flash Manufacturing Manager Intel Corporation January 1999  –  July 2000  (1 year 7 months) Philippines Overall responsibilty for operational and cost effectiveness of the Flash manufacturing operation of the site which assembles, tests and ships the highest volume of Intel products world-wide Flash Manufacturing Manager Intel Corporation January 1999  –  July 2000  (1 year 7 months) Philippines Overall responsibilty for operational and cost effectiveness of the Flash manufacturing operation of the site which assembles, tests and ships the highest volume of Intel products world-wide Assembly Manufacturing Manager & Assembly/Test Planning Mgr. Intel Corporation October 1995  –  August 1998  (2 years 11 months) Shanghai City, China Overall responsibility for starting up and ramping the Flash Assembly Mfg. line, setting up and organizing the product planning process and training the local senior staff in these departments in the first Intel Assembly/Test plant in China. Assembly Manufacturing Manager & Assembly/Test Planning Mgr. Intel Corporation October 1995  –  August 1998  (2 years 11 months) Shanghai City, China Overall responsibility for starting up and ramping the Flash Assembly Mfg. line, setting up and organizing the product planning process and training the local senior staff in these departments in the first Intel Assembly/Test plant in China. Assemybly Mfg. Manager & Flash SOP Operations Manager Intel Corporation 1989  –  September 1995  (6 years) Philippines Overall responsibility for all assembly manufacturing activities and subsequently, the Small Outline Package (SOP) assembly and test manufacturing line in the site with the primary objective of achieving operational and cost effectiveness Assemybly Mfg. Manager & Flash SOP Operations Manager Intel Corporation 1989  –  September 1995  (6 years) Philippines Overall responsibility for all assembly manufacturing activities and subsequently, the Small Outline Package (SOP) assembly and test manufacturing line in the site with the primary objective of achieving operational and cost effectiveness Industrial Engineering Manager & Mfg. Engineering Manager Intel Corporation 1985  –  1989  (4 years) Philippines Overall responsibility for industrial and manufacturing engineering functions in the Philippines site with primary focus on direct labor productivity, capacity planning, tool room operations and direct/indirect training Industrial Engineering Manager & Mfg. Engineering Manager Intel Corporation 1985  –  1989  (4 years) Philippines Overall responsibility for industrial and manufacturing engineering functions in the Philippines site with primary focus on direct labor productivity, capacity planning, tool room operations and direct/indirect training Bubble Memory Operations Manager Intel Corporation 1985  –  1987  (2 years) Philippines Overall responsibility for the assembly and test of bubble memory products for all of Intel with primary focus on output, quality and cost Bubble Memory Operations Manager Intel Corporation 1985  –  1987  (2 years) Philippines Overall responsibility for the assembly and test of bubble memory products for all of Intel with primary focus on output, quality and cost Regional Production Control Manager Intel Corporation September 1984  –  July 1985  (11 months) Philippines Overall responsibility for coordinating the production control functions for assembly/test subcontractors of Intel in Asia, specifically in Korea and Hong Kong Regional Production Control Manager Intel Corporation September 1984  –  July 1985  (11 months) Philippines Overall responsibility for coordinating the production control functions for assembly/test subcontractors of Intel in Asia, specifically in Korea and Hong Kong Industrial Engineering and Forms Management Division Manager Philippine Air Lines January 1982  –  August 1984  (2 years 8 months) Industrial Engineering and Forms Management, Non-aircraft capital planning and evaluation, Linear programming, Queueing Theory, Manpower Determination Industrial Engineering and Forms Management Division Manager Philippine Air Lines January 1982  –  August 1984  (2 years 8 months) Industrial Engineering and Forms Management, Non-aircraft capital planning and evaluation, Linear programming, Queueing Theory, Manpower Determination Watch Manufacturing and Watchband Operations Manager Timex Watch Manufacturing 1981  –  1982  (1 year) Philippines Overall responsibility for the assembly & test of electronic analog and digital watches as well as the assembly of watchbands of TIMEX in the Philippine plant, including engineering and tool room support functions Watch Manufacturing and Watchband Operations Manager Timex Watch Manufacturing 1981  –  1982  (1 year) Philippines Overall responsibility for the assembly & test of electronic analog and digital watches as well as the assembly of watchbands of TIMEX in the Philippine plant, including engineering and tool room support functions Industrial Engineering Manager Timex Watch Manufacturing, Inc. July 1978  –  1981  (3 years) Philippines Overall responsibility for industrial engineering functions in the Philippine plant with primary focus on direct labor productivity, methods improvement, costbook maintenance, capital expense evaluation and mfg. systems Industrial Engineering Manager Timex Watch Manufacturing, Inc. July 1978  –  1981  (3 years) Philippines Overall responsibility for industrial engineering functions in the Philippine plant with primary focus on direct labor productivity, methods improvement, costbook maintenance, capital expense evaluation and mfg. systems Languages English Pilipino English Pilipino English Pilipino Skills Change Leadership Intercultural... Coaching Problem-solving &... Influencing Dealing with Ambiguity Industrial Engineering EHS Operations Management Manufacturing Leadership Development Program Management Management Consulting Operational Excellence Executive Coaching Team Building Organizational... Strategic Planning Performance Management Change Management Management Project Planning Training Engineering Process Improvement Business Transformation Strategy Business Process... Organizational Design See 14+     See less Skills  Change Leadership Intercultural... Coaching Problem-solving &... Influencing Dealing with Ambiguity Industrial Engineering EHS Operations Management Manufacturing Leadership Development Program Management Management Consulting Operational Excellence Executive Coaching Team Building Organizational... Strategic Planning Performance Management Change Management Management Project Planning Training Engineering Process Improvement Business Transformation Strategy Business Process... Organizational Design See 14+     See less Change Leadership Intercultural... Coaching Problem-solving &... Influencing Dealing with Ambiguity Industrial Engineering EHS Operations Management Manufacturing Leadership Development Program Management Management Consulting Operational Excellence Executive Coaching Team Building Organizational... Strategic Planning Performance Management Change Management Management Project Planning Training Engineering Process Improvement Business Transformation Strategy Business Process... Organizational Design See 14+     See less Change Leadership Intercultural... Coaching Problem-solving &... Influencing Dealing with Ambiguity Industrial Engineering EHS Operations Management Manufacturing Leadership Development Program Management Management Consulting Operational Excellence Executive Coaching Team Building Organizational... Strategic Planning Performance Management Change Management Management Project Planning Training Engineering Process Improvement Business Transformation Strategy Business Process... Organizational Design See 14+     See less Education University of the Philippines PhD units,  Business Administration 2009  – 2010 Completed 2 semesters of doctoral studies University of the Philippines Master of Business Administration (MBA),  Master of Science In Industrial Engineering (MSIE) 1982  – 1984 Activities and Societies:  UP MBA Society University of the Philippines M.S.,  Industrial Engineering 1975  – 1977 Activities and Societies:  U.P. Industry Fellowship scholar University of the Philippines B.S.,  Industrial Engineering 1969  – 1974 Activities and Societies:  Phi Kappa Phi Honor Society ,  Mencius Lodge Scholar University of the Philippines PhD units,  Business Administration 2009  – 2010 Completed 2 semesters of doctoral studies University of the Philippines PhD units,  Business Administration 2009  – 2010 Completed 2 semesters of doctoral studies University of the Philippines PhD units,  Business Administration 2009  – 2010 Completed 2 semesters of doctoral studies University of the Philippines Master of Business Administration (MBA),  Master of Science In Industrial Engineering (MSIE) 1982  – 1984 Activities and Societies:  UP MBA Society University of the Philippines Master of Business Administration (MBA),  Master of Science In Industrial Engineering (MSIE) 1982  – 1984 Activities and Societies:  UP MBA Society University of the Philippines Master of Business Administration (MBA),  Master of Science In Industrial Engineering (MSIE) 1982  – 1984 Activities and Societies:  UP MBA Society University of the Philippines M.S.,  Industrial Engineering 1975  – 1977 Activities and Societies:  U.P. Industry Fellowship scholar University of the Philippines M.S.,  Industrial Engineering 1975  – 1977 Activities and Societies:  U.P. Industry Fellowship scholar University of the Philippines M.S.,  Industrial Engineering 1975  – 1977 Activities and Societies:  U.P. Industry Fellowship scholar University of the Philippines B.S.,  Industrial Engineering 1969  – 1974 Activities and Societies:  Phi Kappa Phi Honor Society ,  Mencius Lodge Scholar University of the Philippines B.S.,  Industrial Engineering 1969  – 1974 Activities and Societies:  Phi Kappa Phi Honor Society ,  Mencius Lodge Scholar University of the Philippines B.S.,  Industrial Engineering 1969  – 1974 Activities and Societies:  Phi Kappa Phi Honor Society ,  Mencius Lodge Scholar Honors & Awards Additional Honors & Awards 1. Outstanding Employee, Human Settlements Commission, 1977 \n2. Corporate award for outstanding project management, TMX Watch Corporation, 1980  \n3. Top 12 of U.P. MBA class 1984 \n4. Outstanding I.E. award, Association of Management & Industrial Engineers of the Philippines, 1987 \n5. Intel Quality Award, 1994 and 2002 \n6. Presidential Citation, Production Management Association of the Philippines, 1996 \n7. Presidential Award, UP Alumni Engineers, 2002 \n8. Intel Technology Mfg. Group Environmental Excellence Award, 2003 \n9. Intel Corporate Services Pegasus Peer Recognition Award, 2003 \n10. Achievement Award (Service to Industry), UP Alumni Engineers, 2003 Additional Honors & Awards 1. Outstanding Employee, Human Settlements Commission, 1977 \n2. Corporate award for outstanding project management, TMX Watch Corporation, 1980  \n3. Top 12 of U.P. MBA class 1984 \n4. Outstanding I.E. award, Association of Management & Industrial Engineers of the Philippines, 1987 \n5. Intel Quality Award, 1994 and 2002 \n6. Presidential Citation, Production Management Association of the Philippines, 1996 \n7. Presidential Award, UP Alumni Engineers, 2002 \n8. Intel Technology Mfg. Group Environmental Excellence Award, 2003 \n9. Intel Corporate Services Pegasus Peer Recognition Award, 2003 \n10. Achievement Award (Service to Industry), UP Alumni Engineers, 2003 Additional Honors & Awards 1. Outstanding Employee, Human Settlements Commission, 1977 \n2. Corporate award for outstanding project management, TMX Watch Corporation, 1980  \n3. Top 12 of U.P. MBA class 1984 \n4. Outstanding I.E. award, Association of Management & Industrial Engineers of the Philippines, 1987 \n5. Intel Quality Award, 1994 and 2002 \n6. Presidential Citation, Production Management Association of the Philippines, 1996 \n7. Presidential Award, UP Alumni Engineers, 2002 \n8. Intel Technology Mfg. Group Environmental Excellence Award, 2003 \n9. Intel Corporate Services Pegasus Peer Recognition Award, 2003 \n10. Achievement Award (Service to Industry), UP Alumni Engineers, 2003 Additional Honors & Awards 1. Outstanding Employee, Human Settlements Commission, 1977 \n2. Corporate award for outstanding project management, TMX Watch Corporation, 1980  \n3. Top 12 of U.P. MBA class 1984 \n4. Outstanding I.E. award, Association of Management & Industrial Engineers of the Philippines, 1987 \n5. Intel Quality Award, 1994 and 2002 \n6. Presidential Citation, Production Management Association of the Philippines, 1996 \n7. Presidential Award, UP Alumni Engineers, 2002 \n8. Intel Technology Mfg. Group Environmental Excellence Award, 2003 \n9. Intel Corporate Services Pegasus Peer Recognition Award, 2003 \n10. Achievement Award (Service to Industry), UP Alumni Engineers, 2003 ", "Summary I am passionate about keeping up on the leading thoughts and trends across multiple disciplines: Lean methods, Organizational Behavior & Management, Strategic Thinking & Planning, Innovation Processes, User-Centered Design, Data Visualization, Analytics, and Persuasive Communications. Outside of work, I'm passionate about promoting VEX and FIRST Robotics programs for kids at all levels. I actively support the Boy Scouts of America as an Assistant Scoutmaster and Merit Badge Counselor. Summary I am passionate about keeping up on the leading thoughts and trends across multiple disciplines: Lean methods, Organizational Behavior & Management, Strategic Thinking & Planning, Innovation Processes, User-Centered Design, Data Visualization, Analytics, and Persuasive Communications. Outside of work, I'm passionate about promoting VEX and FIRST Robotics programs for kids at all levels. I actively support the Boy Scouts of America as an Assistant Scoutmaster and Merit Badge Counselor. I am passionate about keeping up on the leading thoughts and trends across multiple disciplines: Lean methods, Organizational Behavior & Management, Strategic Thinking & Planning, Innovation Processes, User-Centered Design, Data Visualization, Analytics, and Persuasive Communications. Outside of work, I'm passionate about promoting VEX and FIRST Robotics programs for kids at all levels. I actively support the Boy Scouts of America as an Assistant Scoutmaster and Merit Badge Counselor. I am passionate about keeping up on the leading thoughts and trends across multiple disciplines: Lean methods, Organizational Behavior & Management, Strategic Thinking & Planning, Innovation Processes, User-Centered Design, Data Visualization, Analytics, and Persuasive Communications. Outside of work, I'm passionate about promoting VEX and FIRST Robotics programs for kids at all levels. I actively support the Boy Scouts of America as an Assistant Scoutmaster and Merit Badge Counselor. Experience Production Control Manager Intel Corporation October 2006  – Present (8 years 11 months) Lead and manage a small group of Production Control Technicians, specializing in starts management, cross-site processing logistics, tooling (reticle) logistics, new product introduction, and shop floor control system administration. Previous positions included Strategic Capacity Planning (focusing on Factory performance forecasting and Factory capacity optimization) and Lead Product Planner for Pentium 4 and other CPU products. Product Planner Intel Corporation March 1997  –  October 2006  (9 years 8 months) Managed factory output schedules and logistics for a variety of CPU, Chipset and Flash products. Lead Planner for two generations of Pentium 4 products. Operations Supervisor Team Specialty Services, Inc. October 1994  –  February 1997  (2 years 5 months) I worked for TEAM Specialty Services, which was a subsidiary or sister company to TEAM Specialty Products at the time. We conducted testing and evaluation of the TOPAZ Space Nuclear Power system on contract with the Sandia National Laboratory, Los Alamos National Laboratory, The University of New Mexico and the Defense Nuclear Agency. Electrician's Mate United States Navy April 1988  –  January 1994  (5 years 10 months) Nuclear-trained Electrician's Mate, Petty Officer 1st Class; Served aboard the USS Boston (SSN703) from Jan 1992 to Jan 1994. Staff Instructor at the Naval Nuclear Power Training Unit, Ballston Spa, NY from Jan 1989 to Jan 1992. Production Control Manager Intel Corporation October 2006  – Present (8 years 11 months) Lead and manage a small group of Production Control Technicians, specializing in starts management, cross-site processing logistics, tooling (reticle) logistics, new product introduction, and shop floor control system administration. Previous positions included Strategic Capacity Planning (focusing on Factory performance forecasting and Factory capacity optimization) and Lead Product Planner for Pentium 4 and other CPU products. Production Control Manager Intel Corporation October 2006  – Present (8 years 11 months) Lead and manage a small group of Production Control Technicians, specializing in starts management, cross-site processing logistics, tooling (reticle) logistics, new product introduction, and shop floor control system administration. Previous positions included Strategic Capacity Planning (focusing on Factory performance forecasting and Factory capacity optimization) and Lead Product Planner for Pentium 4 and other CPU products. Product Planner Intel Corporation March 1997  –  October 2006  (9 years 8 months) Managed factory output schedules and logistics for a variety of CPU, Chipset and Flash products. Lead Planner for two generations of Pentium 4 products. Product Planner Intel Corporation March 1997  –  October 2006  (9 years 8 months) Managed factory output schedules and logistics for a variety of CPU, Chipset and Flash products. Lead Planner for two generations of Pentium 4 products. Operations Supervisor Team Specialty Services, Inc. October 1994  –  February 1997  (2 years 5 months) I worked for TEAM Specialty Services, which was a subsidiary or sister company to TEAM Specialty Products at the time. We conducted testing and evaluation of the TOPAZ Space Nuclear Power system on contract with the Sandia National Laboratory, Los Alamos National Laboratory, The University of New Mexico and the Defense Nuclear Agency. Operations Supervisor Team Specialty Services, Inc. October 1994  –  February 1997  (2 years 5 months) I worked for TEAM Specialty Services, which was a subsidiary or sister company to TEAM Specialty Products at the time. We conducted testing and evaluation of the TOPAZ Space Nuclear Power system on contract with the Sandia National Laboratory, Los Alamos National Laboratory, The University of New Mexico and the Defense Nuclear Agency. Electrician's Mate United States Navy April 1988  –  January 1994  (5 years 10 months) Nuclear-trained Electrician's Mate, Petty Officer 1st Class; Served aboard the USS Boston (SSN703) from Jan 1992 to Jan 1994. Staff Instructor at the Naval Nuclear Power Training Unit, Ballston Spa, NY from Jan 1989 to Jan 1992. Electrician's Mate United States Navy April 1988  –  January 1994  (5 years 10 months) Nuclear-trained Electrician's Mate, Petty Officer 1st Class; Served aboard the USS Boston (SSN703) from Jan 1992 to Jan 1994. Staff Instructor at the Naval Nuclear Power Training Unit, Ballston Spa, NY from Jan 1989 to Jan 1992. Skills Program Management Training Testing Engineering Management Navy Process Improvement Cross-functional Team... Management SPC Strategy Lean Manufacturing MRP Supply Management Semiconductor Industry Semiconductors Product Development Continuous Improvement Logistics Manufacturing Nuclear Six Sigma See 6+     See less Skills  Program Management Training Testing Engineering Management Navy Process Improvement Cross-functional Team... Management SPC Strategy Lean Manufacturing MRP Supply Management Semiconductor Industry Semiconductors Product Development Continuous Improvement Logistics Manufacturing Nuclear Six Sigma See 6+     See less Program Management Training Testing Engineering Management Navy Process Improvement Cross-functional Team... Management SPC Strategy Lean Manufacturing MRP Supply Management Semiconductor Industry Semiconductors Product Development Continuous Improvement Logistics Manufacturing Nuclear Six Sigma See 6+     See less Program Management Training Testing Engineering Management Navy Process Improvement Cross-functional Team... Management SPC Strategy Lean Manufacturing MRP Supply Management Semiconductor Industry Semiconductors Product Development Continuous Improvement Logistics Manufacturing Nuclear Six Sigma See 6+     See less Education University of Phoenix MBA,  Technology Management 1998  – 2001 The New School B.S.,  Human Resources Management 1989  – 1991 Naval Nuclear Power School Nuke EM,  Naval Nuclear Propulsion Systems & Theory 1989  – 1990 Activities and Societies:  NNPS Class 8901 Arizona State University Engineering 1986  – 1987 University of Phoenix MBA,  Technology Management 1998  – 2001 University of Phoenix MBA,  Technology Management 1998  – 2001 University of Phoenix MBA,  Technology Management 1998  – 2001 The New School B.S.,  Human Resources Management 1989  – 1991 The New School B.S.,  Human Resources Management 1989  – 1991 The New School B.S.,  Human Resources Management 1989  – 1991 Naval Nuclear Power School Nuke EM,  Naval Nuclear Propulsion Systems & Theory 1989  – 1990 Activities and Societies:  NNPS Class 8901 Naval Nuclear Power School Nuke EM,  Naval Nuclear Propulsion Systems & Theory 1989  – 1990 Activities and Societies:  NNPS Class 8901 Naval Nuclear Power School Nuke EM,  Naval Nuclear Propulsion Systems & Theory 1989  – 1990 Activities and Societies:  NNPS Class 8901 Arizona State University Engineering 1986  – 1987 Arizona State University Engineering 1986  – 1987 Arizona State University Engineering 1986  – 1987 ", "Summary A highly motivated professional with experiences in a 24/7 production control management and supply chain planning in a technical and matrix environment. A fast learner with the ability to adapt to rapidly changing business environments, solve issues quickly and effectively while driving continuous improvement processes and procedures. Background includes employee management, strategic objectives, production control, foundry planning, new product planning and introduction, strategic capacity planning, product planning, orders management, customer service, LEAN manufacturing with coaching ability. Summary A highly motivated professional with experiences in a 24/7 production control management and supply chain planning in a technical and matrix environment. A fast learner with the ability to adapt to rapidly changing business environments, solve issues quickly and effectively while driving continuous improvement processes and procedures. Background includes employee management, strategic objectives, production control, foundry planning, new product planning and introduction, strategic capacity planning, product planning, orders management, customer service, LEAN manufacturing with coaching ability. A highly motivated professional with experiences in a 24/7 production control management and supply chain planning in a technical and matrix environment. A fast learner with the ability to adapt to rapidly changing business environments, solve issues quickly and effectively while driving continuous improvement processes and procedures. Background includes employee management, strategic objectives, production control, foundry planning, new product planning and introduction, strategic capacity planning, product planning, orders management, customer service, LEAN manufacturing with coaching ability. A highly motivated professional with experiences in a 24/7 production control management and supply chain planning in a technical and matrix environment. A fast learner with the ability to adapt to rapidly changing business environments, solve issues quickly and effectively while driving continuous improvement processes and procedures. Background includes employee management, strategic objectives, production control, foundry planning, new product planning and introduction, strategic capacity planning, product planning, orders management, customer service, LEAN manufacturing with coaching ability. Languages   Skills Skills     ", "Experience Sr Project Manager NM Department of IT April 2012  – Present (3 years 5 months) Santa Fe, New Mexico Area Project manager responsible for all aspects of the \"Production System Implementation\" project. To include, but limited to... \n- Provide oversight of project related procurement documents and activities.  \n- Document design requirements, develop project plan and project schedule \n- Interface with all areas affected by the project including executive steering committee members, project sponsors, stakeholders, technical team, end users, distributors, and vendors \n- Maintain all project related documentation.  \n- Monitor and track project budget \n- etc Director, Performance Management Department (PMD) Presbyterian Healthcare Services June 2008  –  December 2011  (3 years 7 months) PMD Mission Statement \n \nTo support Presbyterian's overall mission by developing and improving the Health Plan's systems and processes through project management, training, and documentation. Production Control Manager Intel Corporation 1994  –  2007  (13 years) Sr Project Manager NM Department of IT April 2012  – Present (3 years 5 months) Santa Fe, New Mexico Area Project manager responsible for all aspects of the \"Production System Implementation\" project. To include, but limited to... \n- Provide oversight of project related procurement documents and activities.  \n- Document design requirements, develop project plan and project schedule \n- Interface with all areas affected by the project including executive steering committee members, project sponsors, stakeholders, technical team, end users, distributors, and vendors \n- Maintain all project related documentation.  \n- Monitor and track project budget \n- etc Sr Project Manager NM Department of IT April 2012  – Present (3 years 5 months) Santa Fe, New Mexico Area Project manager responsible for all aspects of the \"Production System Implementation\" project. To include, but limited to... \n- Provide oversight of project related procurement documents and activities.  \n- Document design requirements, develop project plan and project schedule \n- Interface with all areas affected by the project including executive steering committee members, project sponsors, stakeholders, technical team, end users, distributors, and vendors \n- Maintain all project related documentation.  \n- Monitor and track project budget \n- etc Director, Performance Management Department (PMD) Presbyterian Healthcare Services June 2008  –  December 2011  (3 years 7 months) PMD Mission Statement \n \nTo support Presbyterian's overall mission by developing and improving the Health Plan's systems and processes through project management, training, and documentation. Director, Performance Management Department (PMD) Presbyterian Healthcare Services June 2008  –  December 2011  (3 years 7 months) PMD Mission Statement \n \nTo support Presbyterian's overall mission by developing and improving the Health Plan's systems and processes through project management, training, and documentation. Production Control Manager Intel Corporation 1994  –  2007  (13 years) Production Control Manager Intel Corporation 1994  –  2007  (13 years) Skills Healthcare Process Improvement PMP Six Sigma Project Management Project Portfolio... PMO Instructional Design Operations Management Healthcare Industry Coaching Strategic Planning HIPAA Integration Budgets Performance Management Software Documentation See 2+     See less Skills  Healthcare Process Improvement PMP Six Sigma Project Management Project Portfolio... PMO Instructional Design Operations Management Healthcare Industry Coaching Strategic Planning HIPAA Integration Budgets Performance Management Software Documentation See 2+     See less Healthcare Process Improvement PMP Six Sigma Project Management Project Portfolio... PMO Instructional Design Operations Management Healthcare Industry Coaching Strategic Planning HIPAA Integration Budgets Performance Management Software Documentation See 2+     See less Healthcare Process Improvement PMP Six Sigma Project Management Project Portfolio... PMO Instructional Design Operations Management Healthcare Industry Coaching Strategic Planning HIPAA Integration Budgets Performance Management Software Documentation See 2+     See less Education Santa Fe University of Art and Design MBA,  Human Resources 2004  – 2006 The University of New Mexico BS,  Instructional Systems Design 1991  – 1994 Santa Fe University of Art and Design MBA,  Human Resources 2004  – 2006 Santa Fe University of Art and Design MBA,  Human Resources 2004  – 2006 Santa Fe University of Art and Design MBA,  Human Resources 2004  – 2006 The University of New Mexico BS,  Instructional Systems Design 1991  – 1994 The University of New Mexico BS,  Instructional Systems Design 1991  – 1994 The University of New Mexico BS,  Instructional Systems Design 1991  – 1994 ", "Summary My objective is to provide Personal, Professional, Trustworthy representation to commercial real estate Buyers, Sellers, Tenants & Landlords. Specialties:Advising investors on ROI, acquisition, disposition, and exchange of commercial real estate. Brokerage of purchase and sale of commercial properties and tenant representation. Summary My objective is to provide Personal, Professional, Trustworthy representation to commercial real estate Buyers, Sellers, Tenants & Landlords. Specialties:Advising investors on ROI, acquisition, disposition, and exchange of commercial real estate. Brokerage of purchase and sale of commercial properties and tenant representation. My objective is to provide Personal, Professional, Trustworthy representation to commercial real estate Buyers, Sellers, Tenants & Landlords. Specialties:Advising investors on ROI, acquisition, disposition, and exchange of commercial real estate. Brokerage of purchase and sale of commercial properties and tenant representation. My objective is to provide Personal, Professional, Trustworthy representation to commercial real estate Buyers, Sellers, Tenants & Landlords. Specialties:Advising investors on ROI, acquisition, disposition, and exchange of commercial real estate. Brokerage of purchase and sale of commercial properties and tenant representation. Experience Principal Broker and Owner Pacific Northwest Commercial Real Estete, Inc. March 2013  – Present (2 years 6 months) 5 Centerpointe Dr., Suite 400, Lake Oswego, OR 97034 I specialize in working with a limited number of clients at any time in order to provide focused, professional service that leads to the maximum benefit to my client. \nThis philosophy applies to clients seeking to purchase, sell or lease commercial real esate. I have expertise in office, retail, multifamily and industrial properties and enjoy working in all four areas. Broker Owner Equity One Commercial Real Estate May 2000  –  September 2012  (12 years 5 months) Advising and representing investors, buyers, sellers and tenants of commercial real estate. Business Development Manager, Production Control Manager Intel Corporation 1972  –  1989  (17 years) Initiated my career at Intel as wafer fabrication supervisor, moved to production control interfacing with operations in Hong Kong and Mexico, coodinated plant building in Penang, Barbados and Manila. Coordinated moving manufacturing out of Santa Clara to Oregon and Arizona. Last served as interface to technical business partners. Principal Broker and Owner Pacific Northwest Commercial Real Estete, Inc. March 2013  – Present (2 years 6 months) 5 Centerpointe Dr., Suite 400, Lake Oswego, OR 97034 I specialize in working with a limited number of clients at any time in order to provide focused, professional service that leads to the maximum benefit to my client. \nThis philosophy applies to clients seeking to purchase, sell or lease commercial real esate. I have expertise in office, retail, multifamily and industrial properties and enjoy working in all four areas. Principal Broker and Owner Pacific Northwest Commercial Real Estete, Inc. March 2013  – Present (2 years 6 months) 5 Centerpointe Dr., Suite 400, Lake Oswego, OR 97034 I specialize in working with a limited number of clients at any time in order to provide focused, professional service that leads to the maximum benefit to my client. \nThis philosophy applies to clients seeking to purchase, sell or lease commercial real esate. I have expertise in office, retail, multifamily and industrial properties and enjoy working in all four areas. Broker Owner Equity One Commercial Real Estate May 2000  –  September 2012  (12 years 5 months) Advising and representing investors, buyers, sellers and tenants of commercial real estate. Broker Owner Equity One Commercial Real Estate May 2000  –  September 2012  (12 years 5 months) Advising and representing investors, buyers, sellers and tenants of commercial real estate. Business Development Manager, Production Control Manager Intel Corporation 1972  –  1989  (17 years) Initiated my career at Intel as wafer fabrication supervisor, moved to production control interfacing with operations in Hong Kong and Mexico, coodinated plant building in Penang, Barbados and Manila. Coordinated moving manufacturing out of Santa Clara to Oregon and Arizona. Last served as interface to technical business partners. Business Development Manager, Production Control Manager Intel Corporation 1972  –  1989  (17 years) Initiated my career at Intel as wafer fabrication supervisor, moved to production control interfacing with operations in Hong Kong and Mexico, coodinated plant building in Penang, Barbados and Manila. Coordinated moving manufacturing out of Santa Clara to Oregon and Arizona. Last served as interface to technical business partners. Skills Negotiation Luxury Short Sales Residential Homes Property Real Estate Development Investments Commercial Real Estate Investment Properties Real Estate Selling Sellers Real Estate Economics Contract Negotiation Mergers & Acquisitions Investors Property Management Disposition Dispositions Leases See 5+     See less Skills  Negotiation Luxury Short Sales Residential Homes Property Real Estate Development Investments Commercial Real Estate Investment Properties Real Estate Selling Sellers Real Estate Economics Contract Negotiation Mergers & Acquisitions Investors Property Management Disposition Dispositions Leases See 5+     See less Negotiation Luxury Short Sales Residential Homes Property Real Estate Development Investments Commercial Real Estate Investment Properties Real Estate Selling Sellers Real Estate Economics Contract Negotiation Mergers & Acquisitions Investors Property Management Disposition Dispositions Leases See 5+     See less Negotiation Luxury Short Sales Residential Homes Property Real Estate Development Investments Commercial Real Estate Investment Properties Real Estate Selling Sellers Real Estate Economics Contract Negotiation Mergers & Acquisitions Investors Property Management Disposition Dispositions Leases See 5+     See less Education Santa Clara University - Leavey School of Business MBA,  Business Administration 1972  – 1976 University of California, Berkeley, Haas School of Business BS,  Business Administration 1964  – 1966 Earned an MBA at the University of Santa Clara in 1976. Activities and Societies:  Basketball Team 1964-1966 ,  Pi Kapa Alpha Fraternity Santa Clara University - Leavey School of Business MBA,  Business Administration 1972  – 1976 Santa Clara University - Leavey School of Business MBA,  Business Administration 1972  – 1976 Santa Clara University - Leavey School of Business MBA,  Business Administration 1972  – 1976 University of California, Berkeley, Haas School of Business BS,  Business Administration 1964  – 1966 Earned an MBA at the University of Santa Clara in 1976. Activities and Societies:  Basketball Team 1964-1966 ,  Pi Kapa Alpha Fraternity University of California, Berkeley, Haas School of Business BS,  Business Administration 1964  – 1966 Earned an MBA at the University of Santa Clara in 1976. Activities and Societies:  Basketball Team 1964-1966 ,  Pi Kapa Alpha Fraternity University of California, Berkeley, Haas School of Business BS,  Business Administration 1964  – 1966 Earned an MBA at the University of Santa Clara in 1976. Activities and Societies:  Basketball Team 1964-1966 ,  Pi Kapa Alpha Fraternity ", "Experience Production control Manager Intel Corporation Production control Manager Intel Corporation Production control Manager Intel Corporation "]}