{"position": "Production Supervisor", "company": "Intel Corporation", "profiles": ["Summary •\tHighly motivated and organized, with the ability to adapt quickly to new and increased job responsibilities \n•\tAdvanced skills in Microsoft Excel, Word, PowerPoint & Access, SAP, PeopleSoft JD Edwards and Oracle \n•\tTrained in Theory of Constraints, Negotiation Skills, High Output Management, Breakthrough Performance Systems, Statistical Process Control and Employee Relations/Labor Laws \n•\tTrained instructor in DMAIC based 7 Step Problem Solving Methodology \n•\tArticulate and professional, a team player with a positive attitude and strong work ethic \n•\tStrong analytical, technical, communication and presentation skills Summary •\tHighly motivated and organized, with the ability to adapt quickly to new and increased job responsibilities \n•\tAdvanced skills in Microsoft Excel, Word, PowerPoint & Access, SAP, PeopleSoft JD Edwards and Oracle \n•\tTrained in Theory of Constraints, Negotiation Skills, High Output Management, Breakthrough Performance Systems, Statistical Process Control and Employee Relations/Labor Laws \n•\tTrained instructor in DMAIC based 7 Step Problem Solving Methodology \n•\tArticulate and professional, a team player with a positive attitude and strong work ethic \n•\tStrong analytical, technical, communication and presentation skills •\tHighly motivated and organized, with the ability to adapt quickly to new and increased job responsibilities \n•\tAdvanced skills in Microsoft Excel, Word, PowerPoint & Access, SAP, PeopleSoft JD Edwards and Oracle \n•\tTrained in Theory of Constraints, Negotiation Skills, High Output Management, Breakthrough Performance Systems, Statistical Process Control and Employee Relations/Labor Laws \n•\tTrained instructor in DMAIC based 7 Step Problem Solving Methodology \n•\tArticulate and professional, a team player with a positive attitude and strong work ethic \n•\tStrong analytical, technical, communication and presentation skills •\tHighly motivated and organized, with the ability to adapt quickly to new and increased job responsibilities \n•\tAdvanced skills in Microsoft Excel, Word, PowerPoint & Access, SAP, PeopleSoft JD Edwards and Oracle \n•\tTrained in Theory of Constraints, Negotiation Skills, High Output Management, Breakthrough Performance Systems, Statistical Process Control and Employee Relations/Labor Laws \n•\tTrained instructor in DMAIC based 7 Step Problem Solving Methodology \n•\tArticulate and professional, a team player with a positive attitude and strong work ethic \n•\tStrong analytical, technical, communication and presentation skills Experience Senior Buyer Denbury Resources April 2013  – Present (2 years 5 months) Plano, YX Sr. Procurement Specialist Halliburton April 2008  –  April 2013  (5 years 1 month) Carrollton, TX Sr. Procurement Specialist– IT/Telecom Accor April 2006  –  April 2008  (2 years 1 month) Carrollton, TX Global Sourcing Specialist KONE May 2005  –  April 2006  (1 year) McKinney, TX Capital Purchasing Agent 3M (Cuno Filtration Division) September 2002  –  February 2005  (2 years 6 months) Meriden, CT Divisional Production Planner Intel Corporation April 2000  –  September 2002  (2 years 6 months) Hudson, MA Supplier Service Coordinator Intel Corporation February 1999  –  April 2000  (1 year 3 months) Chandler, AZ Production Supervisor Intel Corporation April 1995  –  February 1999  (3 years 11 months) Chandler, AZ Senior Buyer Denbury Resources April 2013  – Present (2 years 5 months) Plano, YX Senior Buyer Denbury Resources April 2013  – Present (2 years 5 months) Plano, YX Sr. Procurement Specialist Halliburton April 2008  –  April 2013  (5 years 1 month) Carrollton, TX Sr. Procurement Specialist Halliburton April 2008  –  April 2013  (5 years 1 month) Carrollton, TX Sr. Procurement Specialist– IT/Telecom Accor April 2006  –  April 2008  (2 years 1 month) Carrollton, TX Sr. Procurement Specialist– IT/Telecom Accor April 2006  –  April 2008  (2 years 1 month) Carrollton, TX Global Sourcing Specialist KONE May 2005  –  April 2006  (1 year) McKinney, TX Global Sourcing Specialist KONE May 2005  –  April 2006  (1 year) McKinney, TX Capital Purchasing Agent 3M (Cuno Filtration Division) September 2002  –  February 2005  (2 years 6 months) Meriden, CT Capital Purchasing Agent 3M (Cuno Filtration Division) September 2002  –  February 2005  (2 years 6 months) Meriden, CT Divisional Production Planner Intel Corporation April 2000  –  September 2002  (2 years 6 months) Hudson, MA Divisional Production Planner Intel Corporation April 2000  –  September 2002  (2 years 6 months) Hudson, MA Supplier Service Coordinator Intel Corporation February 1999  –  April 2000  (1 year 3 months) Chandler, AZ Supplier Service Coordinator Intel Corporation February 1999  –  April 2000  (1 year 3 months) Chandler, AZ Production Supervisor Intel Corporation April 1995  –  February 1999  (3 years 11 months) Chandler, AZ Production Supervisor Intel Corporation April 1995  –  February 1999  (3 years 11 months) Chandler, AZ Education Purdue University Bachelor of Science (B.S.),  Organizational Leadership and Supervision 1990  – 1994 Activities and Societies:  Phi Kappa Psi Purdue University Bachelor of Science (B.S.),  Organizational Leadership and Supervision 1990  – 1994 Activities and Societies:  Phi Kappa Psi Purdue University Bachelor of Science (B.S.),  Organizational Leadership and Supervision 1990  – 1994 Activities and Societies:  Phi Kappa Psi Purdue University Bachelor of Science (B.S.),  Organizational Leadership and Supervision 1990  – 1994 Activities and Societies:  Phi Kappa Psi ", "Summary Information Technology Leader and Manager focused on achieving business strategies and objectives. Experience at companies ranging in size from startup to $1 billion in annual revenue and across a wide variety of industries, including high technology hardware and software and healthcare. Collaborates effectively with senior leaders and staff across the organization to identify business needs and technology solutions and define and execute the tactical plans necessary to accomplish organizational goals, making efficient use of staff and financial resources. Particular strengths in: \n \n•\tStrategic Planning\t \n•\tProgram Management and Oversight \n•\tBusiness/IT Partnership\t \n•\tM&A Due Diligence and Integration Summary Information Technology Leader and Manager focused on achieving business strategies and objectives. Experience at companies ranging in size from startup to $1 billion in annual revenue and across a wide variety of industries, including high technology hardware and software and healthcare. Collaborates effectively with senior leaders and staff across the organization to identify business needs and technology solutions and define and execute the tactical plans necessary to accomplish organizational goals, making efficient use of staff and financial resources. Particular strengths in: \n \n•\tStrategic Planning\t \n•\tProgram Management and Oversight \n•\tBusiness/IT Partnership\t \n•\tM&A Due Diligence and Integration Information Technology Leader and Manager focused on achieving business strategies and objectives. Experience at companies ranging in size from startup to $1 billion in annual revenue and across a wide variety of industries, including high technology hardware and software and healthcare. Collaborates effectively with senior leaders and staff across the organization to identify business needs and technology solutions and define and execute the tactical plans necessary to accomplish organizational goals, making efficient use of staff and financial resources. Particular strengths in: \n \n•\tStrategic Planning\t \n•\tProgram Management and Oversight \n•\tBusiness/IT Partnership\t \n•\tM&A Due Diligence and Integration Information Technology Leader and Manager focused on achieving business strategies and objectives. Experience at companies ranging in size from startup to $1 billion in annual revenue and across a wide variety of industries, including high technology hardware and software and healthcare. Collaborates effectively with senior leaders and staff across the organization to identify business needs and technology solutions and define and execute the tactical plans necessary to accomplish organizational goals, making efficient use of staff and financial resources. Particular strengths in: \n \n•\tStrategic Planning\t \n•\tProgram Management and Oversight \n•\tBusiness/IT Partnership\t \n•\tM&A Due Diligence and Integration Experience VP of Information Systems & Real Estate Tripwire, Inc. 2010  –  2013  (3 years) Portland, Oregon Area As company’s first IT Executive, led 25-person geographically distributed team consisting of business systems/applications, network administration, corporate and R&D Lab systems administration, service desk, information security. Direct reports included Sr. Mgr. of Business Systems, Mgr. of Infrastructure & Operations, Sr. Security Engineer, Facilities Project Mgr. Added responsibility for Real Estate/Facilities in October 2011. Managed $9 million operating budget and $4 million companywide capital budget. \n \n•\tInitiated dialogue with stakeholders at all levels of the company to understand needs, improve two-way communication and collaboration, and provide transparency into department priorities, projects, and operations. Actions contributed to 25% improvement in stakeholder satisfaction in one year.  \n•\tWorked with subordinate managers to design and implement governance structure enabling both tactical prioritization and strategic oversight and alignment between IS and business stakeholders in primary areas: CRM, Back Office Systems, BI, R&D Lab, Infrastructure & Operations. \n•\tDeveloped approach, selected consulting partner, launched and led cross-functional team to identify and analyze core business process and system improvements needed to support company growth. Developed and executed three-year business systems roadmap while responding to changes in company ownership, executive leadership, and organizational structure. \n•\tDeveloped risk assessment approach based on valuing avoidance of consequences to improve overall security posture. Worked with Sr. Security Engineer to define security project roadmap remediating highest priority risks. Delivered monthly updates to Risk & Security Oversight Board consisting of CFO, CTO, General Counsel, VP of R&D, and myself. \n­­\t- Led System and Network Administration teams to achieve >75% compliance with Center for Internet Security (CIS) security configuration hardening standards for highest risk legacy IT infrastructure. VP of Information Systems & Finance Anesthesiologists Associated Inc. (AAI) 2005  –  2009  (4 years) Led geographically distributed information systems team consisting of business systems/applications, network and systems administration, service desk, information security. Added responsibility for three-person Finance and Accounting team in July 2008. Direct reports consisted of IT Director, Business Systems Manager, and Corporate Controller.  \n \n•\tCollaborated with CEO and CFO to successfully negotiate refund of $1 million software license fee based on lack of performance from Fortune 10 software supplier. \n•\tPartnered with VP of Operations to lead office consolidation and offshoring projects following acquisition by former competitor that improved operational efficiency and reduced operating expenses by $2 million/year (18% of revenue). Completed offshoring of 45 operations positions two months ahead of schedule. AVP of Information Systems & Technology Qmedtrix Systems 2004  –  2005  (1 year) Led 25-person software/product development, quality assurance, tech writing, and project management team. Added responsibility for five-person information technology group: server, network, desktop support in 2005. Direct reports consisted of Software Development Manager, Software QA Manager, two Project Managers, Technical Writer, IT Manager.  \n \n•\tWorked with subordinate Managers of Systems Development and Software Quality Assurance to define and deploy operational metrics illuminating development project completion within 10% of estimated hours and test effectiveness > 95%. \n•\tPartnered with VP of Product Development to select and deploy EDI infrastructure that supported 300% increase in transaction volume over 12 months and >75% of company revenue. \n•\tConvinced executive team of value of adopting Situational Leadership program for company managers and senior staff members. Partnered with VP of Organizational Development to achieve instructor certification (Center for Leadership Studies) and deliver training to managers and senior individual contributors. VP of Client Systems LiveBridge 2002  –  2004  (2 years) Led 20-person software development, QA, and database administration team. Direct reports consisted of Development Manager, QA Manager, two Sr. Database Administrators.  \n \n•\tWorked with subordinate managers to design and, after earning support from CEO, successfully migrated from traditional organizational model consisting of development and support teams to new workgroup based structure to better align development teams with key clients, improve customer service, and enhance staff morale and professional development. Migration completed over 60-day period with no impact to existing customer commitments.  \n­\tDefined and deployed department metrics illuminating 40% reduction in error rate and 98% adherence to client schedules. \n­\tExceeded department revenue goals for client billable work by 20%. VP/CIO etrieve, Inc. 2001  –  2002  (1 year) Led all aspects of internal and external information technology for wireless infrastructure/ASP company. Developed and maintained product cost models. Direct reports included Director of Operations, Sr. Systems/Network Administrator, Reporting Analyst. \n \n•\tPartnered with VP of Marketing and Directors of Worldwide Sales and Customer Service to successfully implement customer relationship management (CRM) solution for customer support, marketing, inside sales, and field sales groups. Project completed on schedule and on budget.  \n•\tCoordinated with VP of Engineering to consolidate three hosting locations into one, resulting in 60% reduction in monthly expense. Project executed with < 24 hours service outage and disruption to customers. \n•\tConsulted with CEO to define service availability target and subsequently led IT team to achieve external infrastructure availability to over 99.95% through improved process control and targeted investment. Director of Worldwide Information Systems RadiSys Corporation 1996  –  2001  (5 years) Led geographically distributed international organization responsible for application design, deployment, and support, and worldwide computer and network operations. Direct reports included two Infrastructure & Operations Managers, Business Systems Manager, SAP Program Director, SAP Implementation Project Manager, and Systems Training Manager. \n \n•\tEngaged all members of executive team to develop and maintain first 3-year department strategic plan. Established Executive IS Steering Committee to improve linkage between business goals and IT investments.  \n•\tOversaw successful deployments of HRIS (Oracle HR), PDM (Agile Software) and ERP (SAP). Completed worldwide migrations from Microsoft Exchange to Lotus Notes.  \n•\tPartnered with Directors of Purchasing and Production Planning to extend e-commerce to customers and suppliers representing >50% of purchasing ($) volume. Reduced inventory by $9 million. Solutions included combination of EDI and other forms of electronic communication. \n•\tIntegrated IT infrastructures of four geographically remote acquisitions, ranging in size from 25 to 250 employees.  \n•\tReceived President’s Award for Excellence in Leadership for leadership of companywide internal cross-functional Y2K readiness activities. Nominated by COO. Senior Information Systems Manager Integrated Measurement Systems 1995  –  1996  (1 year) Managed organization responsible for worldwide information technology infrastructure for a semiconductor test equipment manufacturer. Senior Information Systems Manager Sequent Computer Systems 1988  –  1995  (7 years) Managed groups providing business system architecture, business process improvement, and application analysis and support for Enterprise Division and Worldwide Customer Services, Manufacturing, Finance, and Engineering organizations. Project Manager Intel Corporation 1983  –  1988  (5 years) Managed implementation of mainframe-based manufacturing/materials system at both domestic and international manufacturing sites. Production Supervisor Intel Corporation 1979  –  1981  (2 years) Managed 17-person team in semiconductor test operation. VP of Information Systems & Real Estate Tripwire, Inc. 2010  –  2013  (3 years) Portland, Oregon Area As company’s first IT Executive, led 25-person geographically distributed team consisting of business systems/applications, network administration, corporate and R&D Lab systems administration, service desk, information security. Direct reports included Sr. Mgr. of Business Systems, Mgr. of Infrastructure & Operations, Sr. Security Engineer, Facilities Project Mgr. Added responsibility for Real Estate/Facilities in October 2011. Managed $9 million operating budget and $4 million companywide capital budget. \n \n•\tInitiated dialogue with stakeholders at all levels of the company to understand needs, improve two-way communication and collaboration, and provide transparency into department priorities, projects, and operations. Actions contributed to 25% improvement in stakeholder satisfaction in one year.  \n•\tWorked with subordinate managers to design and implement governance structure enabling both tactical prioritization and strategic oversight and alignment between IS and business stakeholders in primary areas: CRM, Back Office Systems, BI, R&D Lab, Infrastructure & Operations. \n•\tDeveloped approach, selected consulting partner, launched and led cross-functional team to identify and analyze core business process and system improvements needed to support company growth. Developed and executed three-year business systems roadmap while responding to changes in company ownership, executive leadership, and organizational structure. \n•\tDeveloped risk assessment approach based on valuing avoidance of consequences to improve overall security posture. Worked with Sr. Security Engineer to define security project roadmap remediating highest priority risks. Delivered monthly updates to Risk & Security Oversight Board consisting of CFO, CTO, General Counsel, VP of R&D, and myself. \n­­\t- Led System and Network Administration teams to achieve >75% compliance with Center for Internet Security (CIS) security configuration hardening standards for highest risk legacy IT infrastructure. VP of Information Systems & Real Estate Tripwire, Inc. 2010  –  2013  (3 years) Portland, Oregon Area As company’s first IT Executive, led 25-person geographically distributed team consisting of business systems/applications, network administration, corporate and R&D Lab systems administration, service desk, information security. Direct reports included Sr. Mgr. of Business Systems, Mgr. of Infrastructure & Operations, Sr. Security Engineer, Facilities Project Mgr. Added responsibility for Real Estate/Facilities in October 2011. Managed $9 million operating budget and $4 million companywide capital budget. \n \n•\tInitiated dialogue with stakeholders at all levels of the company to understand needs, improve two-way communication and collaboration, and provide transparency into department priorities, projects, and operations. Actions contributed to 25% improvement in stakeholder satisfaction in one year.  \n•\tWorked with subordinate managers to design and implement governance structure enabling both tactical prioritization and strategic oversight and alignment between IS and business stakeholders in primary areas: CRM, Back Office Systems, BI, R&D Lab, Infrastructure & Operations. \n•\tDeveloped approach, selected consulting partner, launched and led cross-functional team to identify and analyze core business process and system improvements needed to support company growth. Developed and executed three-year business systems roadmap while responding to changes in company ownership, executive leadership, and organizational structure. \n•\tDeveloped risk assessment approach based on valuing avoidance of consequences to improve overall security posture. Worked with Sr. Security Engineer to define security project roadmap remediating highest priority risks. Delivered monthly updates to Risk & Security Oversight Board consisting of CFO, CTO, General Counsel, VP of R&D, and myself. \n­­\t- Led System and Network Administration teams to achieve >75% compliance with Center for Internet Security (CIS) security configuration hardening standards for highest risk legacy IT infrastructure. VP of Information Systems & Finance Anesthesiologists Associated Inc. (AAI) 2005  –  2009  (4 years) Led geographically distributed information systems team consisting of business systems/applications, network and systems administration, service desk, information security. Added responsibility for three-person Finance and Accounting team in July 2008. Direct reports consisted of IT Director, Business Systems Manager, and Corporate Controller.  \n \n•\tCollaborated with CEO and CFO to successfully negotiate refund of $1 million software license fee based on lack of performance from Fortune 10 software supplier. \n•\tPartnered with VP of Operations to lead office consolidation and offshoring projects following acquisition by former competitor that improved operational efficiency and reduced operating expenses by $2 million/year (18% of revenue). Completed offshoring of 45 operations positions two months ahead of schedule. VP of Information Systems & Finance Anesthesiologists Associated Inc. (AAI) 2005  –  2009  (4 years) Led geographically distributed information systems team consisting of business systems/applications, network and systems administration, service desk, information security. Added responsibility for three-person Finance and Accounting team in July 2008. Direct reports consisted of IT Director, Business Systems Manager, and Corporate Controller.  \n \n•\tCollaborated with CEO and CFO to successfully negotiate refund of $1 million software license fee based on lack of performance from Fortune 10 software supplier. \n•\tPartnered with VP of Operations to lead office consolidation and offshoring projects following acquisition by former competitor that improved operational efficiency and reduced operating expenses by $2 million/year (18% of revenue). Completed offshoring of 45 operations positions two months ahead of schedule. AVP of Information Systems & Technology Qmedtrix Systems 2004  –  2005  (1 year) Led 25-person software/product development, quality assurance, tech writing, and project management team. Added responsibility for five-person information technology group: server, network, desktop support in 2005. Direct reports consisted of Software Development Manager, Software QA Manager, two Project Managers, Technical Writer, IT Manager.  \n \n•\tWorked with subordinate Managers of Systems Development and Software Quality Assurance to define and deploy operational metrics illuminating development project completion within 10% of estimated hours and test effectiveness > 95%. \n•\tPartnered with VP of Product Development to select and deploy EDI infrastructure that supported 300% increase in transaction volume over 12 months and >75% of company revenue. \n•\tConvinced executive team of value of adopting Situational Leadership program for company managers and senior staff members. Partnered with VP of Organizational Development to achieve instructor certification (Center for Leadership Studies) and deliver training to managers and senior individual contributors. AVP of Information Systems & Technology Qmedtrix Systems 2004  –  2005  (1 year) Led 25-person software/product development, quality assurance, tech writing, and project management team. Added responsibility for five-person information technology group: server, network, desktop support in 2005. Direct reports consisted of Software Development Manager, Software QA Manager, two Project Managers, Technical Writer, IT Manager.  \n \n•\tWorked with subordinate Managers of Systems Development and Software Quality Assurance to define and deploy operational metrics illuminating development project completion within 10% of estimated hours and test effectiveness > 95%. \n•\tPartnered with VP of Product Development to select and deploy EDI infrastructure that supported 300% increase in transaction volume over 12 months and >75% of company revenue. \n•\tConvinced executive team of value of adopting Situational Leadership program for company managers and senior staff members. Partnered with VP of Organizational Development to achieve instructor certification (Center for Leadership Studies) and deliver training to managers and senior individual contributors. VP of Client Systems LiveBridge 2002  –  2004  (2 years) Led 20-person software development, QA, and database administration team. Direct reports consisted of Development Manager, QA Manager, two Sr. Database Administrators.  \n \n•\tWorked with subordinate managers to design and, after earning support from CEO, successfully migrated from traditional organizational model consisting of development and support teams to new workgroup based structure to better align development teams with key clients, improve customer service, and enhance staff morale and professional development. Migration completed over 60-day period with no impact to existing customer commitments.  \n­\tDefined and deployed department metrics illuminating 40% reduction in error rate and 98% adherence to client schedules. \n­\tExceeded department revenue goals for client billable work by 20%. VP of Client Systems LiveBridge 2002  –  2004  (2 years) Led 20-person software development, QA, and database administration team. Direct reports consisted of Development Manager, QA Manager, two Sr. Database Administrators.  \n \n•\tWorked with subordinate managers to design and, after earning support from CEO, successfully migrated from traditional organizational model consisting of development and support teams to new workgroup based structure to better align development teams with key clients, improve customer service, and enhance staff morale and professional development. Migration completed over 60-day period with no impact to existing customer commitments.  \n­\tDefined and deployed department metrics illuminating 40% reduction in error rate and 98% adherence to client schedules. \n­\tExceeded department revenue goals for client billable work by 20%. VP/CIO etrieve, Inc. 2001  –  2002  (1 year) Led all aspects of internal and external information technology for wireless infrastructure/ASP company. Developed and maintained product cost models. Direct reports included Director of Operations, Sr. Systems/Network Administrator, Reporting Analyst. \n \n•\tPartnered with VP of Marketing and Directors of Worldwide Sales and Customer Service to successfully implement customer relationship management (CRM) solution for customer support, marketing, inside sales, and field sales groups. Project completed on schedule and on budget.  \n•\tCoordinated with VP of Engineering to consolidate three hosting locations into one, resulting in 60% reduction in monthly expense. Project executed with < 24 hours service outage and disruption to customers. \n•\tConsulted with CEO to define service availability target and subsequently led IT team to achieve external infrastructure availability to over 99.95% through improved process control and targeted investment. VP/CIO etrieve, Inc. 2001  –  2002  (1 year) Led all aspects of internal and external information technology for wireless infrastructure/ASP company. Developed and maintained product cost models. Direct reports included Director of Operations, Sr. Systems/Network Administrator, Reporting Analyst. \n \n•\tPartnered with VP of Marketing and Directors of Worldwide Sales and Customer Service to successfully implement customer relationship management (CRM) solution for customer support, marketing, inside sales, and field sales groups. Project completed on schedule and on budget.  \n•\tCoordinated with VP of Engineering to consolidate three hosting locations into one, resulting in 60% reduction in monthly expense. Project executed with < 24 hours service outage and disruption to customers. \n•\tConsulted with CEO to define service availability target and subsequently led IT team to achieve external infrastructure availability to over 99.95% through improved process control and targeted investment. Director of Worldwide Information Systems RadiSys Corporation 1996  –  2001  (5 years) Led geographically distributed international organization responsible for application design, deployment, and support, and worldwide computer and network operations. Direct reports included two Infrastructure & Operations Managers, Business Systems Manager, SAP Program Director, SAP Implementation Project Manager, and Systems Training Manager. \n \n•\tEngaged all members of executive team to develop and maintain first 3-year department strategic plan. Established Executive IS Steering Committee to improve linkage between business goals and IT investments.  \n•\tOversaw successful deployments of HRIS (Oracle HR), PDM (Agile Software) and ERP (SAP). Completed worldwide migrations from Microsoft Exchange to Lotus Notes.  \n•\tPartnered with Directors of Purchasing and Production Planning to extend e-commerce to customers and suppliers representing >50% of purchasing ($) volume. Reduced inventory by $9 million. Solutions included combination of EDI and other forms of electronic communication. \n•\tIntegrated IT infrastructures of four geographically remote acquisitions, ranging in size from 25 to 250 employees.  \n•\tReceived President’s Award for Excellence in Leadership for leadership of companywide internal cross-functional Y2K readiness activities. Nominated by COO. Director of Worldwide Information Systems RadiSys Corporation 1996  –  2001  (5 years) Led geographically distributed international organization responsible for application design, deployment, and support, and worldwide computer and network operations. Direct reports included two Infrastructure & Operations Managers, Business Systems Manager, SAP Program Director, SAP Implementation Project Manager, and Systems Training Manager. \n \n•\tEngaged all members of executive team to develop and maintain first 3-year department strategic plan. Established Executive IS Steering Committee to improve linkage between business goals and IT investments.  \n•\tOversaw successful deployments of HRIS (Oracle HR), PDM (Agile Software) and ERP (SAP). Completed worldwide migrations from Microsoft Exchange to Lotus Notes.  \n•\tPartnered with Directors of Purchasing and Production Planning to extend e-commerce to customers and suppliers representing >50% of purchasing ($) volume. Reduced inventory by $9 million. Solutions included combination of EDI and other forms of electronic communication. \n•\tIntegrated IT infrastructures of four geographically remote acquisitions, ranging in size from 25 to 250 employees.  \n•\tReceived President’s Award for Excellence in Leadership for leadership of companywide internal cross-functional Y2K readiness activities. Nominated by COO. Senior Information Systems Manager Integrated Measurement Systems 1995  –  1996  (1 year) Managed organization responsible for worldwide information technology infrastructure for a semiconductor test equipment manufacturer. Senior Information Systems Manager Integrated Measurement Systems 1995  –  1996  (1 year) Managed organization responsible for worldwide information technology infrastructure for a semiconductor test equipment manufacturer. Senior Information Systems Manager Sequent Computer Systems 1988  –  1995  (7 years) Managed groups providing business system architecture, business process improvement, and application analysis and support for Enterprise Division and Worldwide Customer Services, Manufacturing, Finance, and Engineering organizations. Senior Information Systems Manager Sequent Computer Systems 1988  –  1995  (7 years) Managed groups providing business system architecture, business process improvement, and application analysis and support for Enterprise Division and Worldwide Customer Services, Manufacturing, Finance, and Engineering organizations. Project Manager Intel Corporation 1983  –  1988  (5 years) Managed implementation of mainframe-based manufacturing/materials system at both domestic and international manufacturing sites. Project Manager Intel Corporation 1983  –  1988  (5 years) Managed implementation of mainframe-based manufacturing/materials system at both domestic and international manufacturing sites. Production Supervisor Intel Corporation 1979  –  1981  (2 years) Managed 17-person team in semiconductor test operation. Production Supervisor Intel Corporation 1979  –  1981  (2 years) Managed 17-person team in semiconductor test operation. Skills Strategic Planning Facilitating... Staff Development Business Process... Program Management Mergers Team Leadership Budgets Facilitators Analysis Management Change Management Vendor Management Process Improvement Start-ups Enterprise Software Leadership SDLC SaaS ERP Business Analysis Business Intelligence Cross-functional Team... Product Management Mergers & Acquisitions Integration Strategy CRM Networking IT Strategy Information Security Information Security... M&A Integration Software Development Telecommunications Team Building IT Management See 22+     See less Skills  Strategic Planning Facilitating... Staff Development Business Process... Program Management Mergers Team Leadership Budgets Facilitators Analysis Management Change Management Vendor Management Process Improvement Start-ups Enterprise Software Leadership SDLC SaaS ERP Business Analysis Business Intelligence Cross-functional Team... Product Management Mergers & Acquisitions Integration Strategy CRM Networking IT Strategy Information Security Information Security... M&A Integration Software Development Telecommunications Team Building IT Management See 22+     See less Strategic Planning Facilitating... Staff Development Business Process... Program Management Mergers Team Leadership Budgets Facilitators Analysis Management Change Management Vendor Management Process Improvement Start-ups Enterprise Software Leadership SDLC SaaS ERP Business Analysis Business Intelligence Cross-functional Team... Product Management Mergers & Acquisitions Integration Strategy CRM Networking IT Strategy Information Security Information Security... M&A Integration Software Development Telecommunications Team Building IT Management See 22+     See less Strategic Planning Facilitating... Staff Development Business Process... Program Management Mergers Team Leadership Budgets Facilitators Analysis Management Change Management Vendor Management Process Improvement Start-ups Enterprise Software Leadership SDLC SaaS ERP Business Analysis Business Intelligence Cross-functional Team... Product Management Mergers & Acquisitions Integration Strategy CRM Networking IT Strategy Information Security Information Security... M&A Integration Software Development Telecommunications Team Building IT Management See 22+     See less Education Harvard Business School MBA 1981  – 1983 Reed College BA 1975  – 1979 Harvard Business School MBA 1981  – 1983 Harvard Business School MBA 1981  – 1983 Harvard Business School MBA 1981  – 1983 Reed College BA 1975  – 1979 Reed College BA 1975  – 1979 Reed College BA 1975  – 1979 ", "Summary Seasoned technical manager with the ability to lead multi-disciplinary integrated teams, ensuring effective application of sound engineering practices for robust equipment and process maintenance and improvement. Leadership and technical skills honed with twenty-one years of experience at a world-class semiconductor manufacturer. \u2028\u2028Key attributes: \n•\tActively coaches, trains, and mentors both engineers and technicians in skill development. \n•\tHas managed engineering staffs of up to twelve and technician staffs of up to twenty-five. \n•\tUtilizes careful planning and strict attention to detail to ensure on-time completion of projects. \n•\tRoutinely participates in technology transfers, delivering successful process matching each time. \n•\tDrives safety, environmental, defect, and cost improvement projects.  \n•\tManages area capacity requirements and supervises equipment installation and qualification. \n•\tCollaborates closely with commercial partners to mange vendor performance. \n•\tApplies sound data extraction and statistical analysis techniques, such as statistical process control and design of experiments, to maintain and improve process and product quality.  \n•\tApplies lean principles and practices, particularly 5S and high precision maintenance techniques. Summary Seasoned technical manager with the ability to lead multi-disciplinary integrated teams, ensuring effective application of sound engineering practices for robust equipment and process maintenance and improvement. Leadership and technical skills honed with twenty-one years of experience at a world-class semiconductor manufacturer. \u2028\u2028Key attributes: \n•\tActively coaches, trains, and mentors both engineers and technicians in skill development. \n•\tHas managed engineering staffs of up to twelve and technician staffs of up to twenty-five. \n•\tUtilizes careful planning and strict attention to detail to ensure on-time completion of projects. \n•\tRoutinely participates in technology transfers, delivering successful process matching each time. \n•\tDrives safety, environmental, defect, and cost improvement projects.  \n•\tManages area capacity requirements and supervises equipment installation and qualification. \n•\tCollaborates closely with commercial partners to mange vendor performance. \n•\tApplies sound data extraction and statistical analysis techniques, such as statistical process control and design of experiments, to maintain and improve process and product quality.  \n•\tApplies lean principles and practices, particularly 5S and high precision maintenance techniques. Seasoned technical manager with the ability to lead multi-disciplinary integrated teams, ensuring effective application of sound engineering practices for robust equipment and process maintenance and improvement. Leadership and technical skills honed with twenty-one years of experience at a world-class semiconductor manufacturer. \u2028\u2028Key attributes: \n•\tActively coaches, trains, and mentors both engineers and technicians in skill development. \n•\tHas managed engineering staffs of up to twelve and technician staffs of up to twenty-five. \n•\tUtilizes careful planning and strict attention to detail to ensure on-time completion of projects. \n•\tRoutinely participates in technology transfers, delivering successful process matching each time. \n•\tDrives safety, environmental, defect, and cost improvement projects.  \n•\tManages area capacity requirements and supervises equipment installation and qualification. \n•\tCollaborates closely with commercial partners to mange vendor performance. \n•\tApplies sound data extraction and statistical analysis techniques, such as statistical process control and design of experiments, to maintain and improve process and product quality.  \n•\tApplies lean principles and practices, particularly 5S and high precision maintenance techniques. Seasoned technical manager with the ability to lead multi-disciplinary integrated teams, ensuring effective application of sound engineering practices for robust equipment and process maintenance and improvement. Leadership and technical skills honed with twenty-one years of experience at a world-class semiconductor manufacturer. \u2028\u2028Key attributes: \n•\tActively coaches, trains, and mentors both engineers and technicians in skill development. \n•\tHas managed engineering staffs of up to twelve and technician staffs of up to twenty-five. \n•\tUtilizes careful planning and strict attention to detail to ensure on-time completion of projects. \n•\tRoutinely participates in technology transfers, delivering successful process matching each time. \n•\tDrives safety, environmental, defect, and cost improvement projects.  \n•\tManages area capacity requirements and supervises equipment installation and qualification. \n•\tCollaborates closely with commercial partners to mange vendor performance. \n•\tApplies sound data extraction and statistical analysis techniques, such as statistical process control and design of experiments, to maintain and improve process and product quality.  \n•\tApplies lean principles and practices, particularly 5S and high precision maintenance techniques. Experience Engineering Group Leader, AFO Die Prep Intel Corporation August 2008  – Present (7 years 1 month) Portland, Oregon Area Equipment supervised has included 300mm wafer mount and coat, laser ablation, saw singulation, wafer frontside tape and detape, wafer backgrind and thinning, and die pick and place systems, plus associated metrology equipment. Helped introduce fab manufacturing discipline to assembly processes across multiple vectors: process transfer, equipment maintenance, documentation requirements, and process control. Partners closely with assembly test development to ensure process readiness for high volume manufacturing. Engineering Group Leader, AFO C4 Diffusion and High Vacuum Intel Corporation September 2004  –  August 2008  (4 years) Portland, Oregon Area Equipment supervised included 300mm PVD and CVD systems, as well as vertical diffusion furnaces. Worked with technology development organization in new process development and transfer. Regularly partnered with operations managers to ensure manufacturing shift team health, to manage module technician headcount requirements, and to ensure module training goals were met. Led the High Precision Maintenance (HPM) initiative at AFO and helped transition HPM into a full blown lean manufacturing effort. Senior Process Engineer, AFO C4 PVD Intel Corporation January 2003  –  September 2004  (1 year 9 months) Portland, Oregon Area Transferred 300mm backside metallization (BSM) process and equipment from the development factory to AFO. Led equipment installation and qualification efforts, ensured module systems readiness for high volume manufacturing, and co-managed AFO seed technicians. Maintained and improved the productive health of the BSM area, as measured by line yield, throughput, cost, capacity, and equipment availability goals. Senior Process Engineer, Fab 15 PVD Intel Corporation February 1998  –  January 2003  (5 years) Portland, Oregon Area Maintained and improved 200mm PVD module health along line yield, die yield, throughput, cost, capacity, equipment availability, staffing, and training vectors. At peak F15 wafer starts, co-managed ~32 self-sustaining technicians. Key projects and teams included the following: \n•\tManufacturing Improvement Group chair. Drove fab-wide accountability for meeting equipment availability goals, technician training requirements, and factory headcount utilization goals.  \n•\tArea Yield Team leader and Yield Core Team member. Used Process Control Systems methodologies to monitor station level, in-line, e-test, and sort SPC charts to identify emerging trends and prevent excursions in the overall HiVac area.  \n•\tModule team leader for two process transfers. Drove qualification of new sputtering tools, ensured process matching to transferring factory, improved process transfer documentation and systems, and ensured that module technicians received appropriate training. Process Engineer, Fab 9 PVD Intel Corporation February 1996  –  February 1998  (2 years 1 month) Albuquerque, New Mexico Area Senior process engineer in the 150mm PVD thin films area. Mentored three engineers and one technician. Responsible for meeting area line yield, die yield, throughput, cost, and equipment availability goals. Maintained area capacity model and ensured appropriate area response to shifts in factory wafer starts. Key projects and teams included the following:  \n•\tDefect reduction. Key member of the Fab7/Fab9 virtual factory Metal Improvement Team. Reduced particle levels by 70%, resulting in a 50% reduction in DPW impact, with minimum expenditure (<$10K/tool). Also helped characterize and qualify a next generation sputtering system, which resulted in ~ 10 DPW yield improvement. \n•\tFlash memory process transfer from Fab7 to Fab9. Co-leader of the PVD transfer team. Brought process up to production on time and with close parametric and defect matching between fabs. Production Supervisor Intel Corporation July 1993  –  February 1996  (2 years 8 months) Albuquerque, New Mexico Area Production supervisor in the wet etch area (equipment supervised included manual and automated wet benches, plasma ashers, and wafer inspection microscopes). Coordinated the work of 20+ technicians in order to meet output, quality, equipment availability, safety, training, and team development goals. Managed technical and tactical problems that involved wet etch equipment throughout the factory. Safety committee leader, ERT (chemical spill team) leader, and safety coach for shift 7. Certified Constraint Management instructor and a facilitator for Breakthrough Systems. Engineering Group Leader, AFO Die Prep Intel Corporation August 2008  – Present (7 years 1 month) Portland, Oregon Area Equipment supervised has included 300mm wafer mount and coat, laser ablation, saw singulation, wafer frontside tape and detape, wafer backgrind and thinning, and die pick and place systems, plus associated metrology equipment. Helped introduce fab manufacturing discipline to assembly processes across multiple vectors: process transfer, equipment maintenance, documentation requirements, and process control. Partners closely with assembly test development to ensure process readiness for high volume manufacturing. Engineering Group Leader, AFO Die Prep Intel Corporation August 2008  – Present (7 years 1 month) Portland, Oregon Area Equipment supervised has included 300mm wafer mount and coat, laser ablation, saw singulation, wafer frontside tape and detape, wafer backgrind and thinning, and die pick and place systems, plus associated metrology equipment. Helped introduce fab manufacturing discipline to assembly processes across multiple vectors: process transfer, equipment maintenance, documentation requirements, and process control. Partners closely with assembly test development to ensure process readiness for high volume manufacturing. Engineering Group Leader, AFO C4 Diffusion and High Vacuum Intel Corporation September 2004  –  August 2008  (4 years) Portland, Oregon Area Equipment supervised included 300mm PVD and CVD systems, as well as vertical diffusion furnaces. Worked with technology development organization in new process development and transfer. Regularly partnered with operations managers to ensure manufacturing shift team health, to manage module technician headcount requirements, and to ensure module training goals were met. Led the High Precision Maintenance (HPM) initiative at AFO and helped transition HPM into a full blown lean manufacturing effort. Engineering Group Leader, AFO C4 Diffusion and High Vacuum Intel Corporation September 2004  –  August 2008  (4 years) Portland, Oregon Area Equipment supervised included 300mm PVD and CVD systems, as well as vertical diffusion furnaces. Worked with technology development organization in new process development and transfer. Regularly partnered with operations managers to ensure manufacturing shift team health, to manage module technician headcount requirements, and to ensure module training goals were met. Led the High Precision Maintenance (HPM) initiative at AFO and helped transition HPM into a full blown lean manufacturing effort. Senior Process Engineer, AFO C4 PVD Intel Corporation January 2003  –  September 2004  (1 year 9 months) Portland, Oregon Area Transferred 300mm backside metallization (BSM) process and equipment from the development factory to AFO. Led equipment installation and qualification efforts, ensured module systems readiness for high volume manufacturing, and co-managed AFO seed technicians. Maintained and improved the productive health of the BSM area, as measured by line yield, throughput, cost, capacity, and equipment availability goals. Senior Process Engineer, AFO C4 PVD Intel Corporation January 2003  –  September 2004  (1 year 9 months) Portland, Oregon Area Transferred 300mm backside metallization (BSM) process and equipment from the development factory to AFO. Led equipment installation and qualification efforts, ensured module systems readiness for high volume manufacturing, and co-managed AFO seed technicians. Maintained and improved the productive health of the BSM area, as measured by line yield, throughput, cost, capacity, and equipment availability goals. Senior Process Engineer, Fab 15 PVD Intel Corporation February 1998  –  January 2003  (5 years) Portland, Oregon Area Maintained and improved 200mm PVD module health along line yield, die yield, throughput, cost, capacity, equipment availability, staffing, and training vectors. At peak F15 wafer starts, co-managed ~32 self-sustaining technicians. Key projects and teams included the following: \n•\tManufacturing Improvement Group chair. Drove fab-wide accountability for meeting equipment availability goals, technician training requirements, and factory headcount utilization goals.  \n•\tArea Yield Team leader and Yield Core Team member. Used Process Control Systems methodologies to monitor station level, in-line, e-test, and sort SPC charts to identify emerging trends and prevent excursions in the overall HiVac area.  \n•\tModule team leader for two process transfers. Drove qualification of new sputtering tools, ensured process matching to transferring factory, improved process transfer documentation and systems, and ensured that module technicians received appropriate training. Senior Process Engineer, Fab 15 PVD Intel Corporation February 1998  –  January 2003  (5 years) Portland, Oregon Area Maintained and improved 200mm PVD module health along line yield, die yield, throughput, cost, capacity, equipment availability, staffing, and training vectors. At peak F15 wafer starts, co-managed ~32 self-sustaining technicians. Key projects and teams included the following: \n•\tManufacturing Improvement Group chair. Drove fab-wide accountability for meeting equipment availability goals, technician training requirements, and factory headcount utilization goals.  \n•\tArea Yield Team leader and Yield Core Team member. Used Process Control Systems methodologies to monitor station level, in-line, e-test, and sort SPC charts to identify emerging trends and prevent excursions in the overall HiVac area.  \n•\tModule team leader for two process transfers. Drove qualification of new sputtering tools, ensured process matching to transferring factory, improved process transfer documentation and systems, and ensured that module technicians received appropriate training. Process Engineer, Fab 9 PVD Intel Corporation February 1996  –  February 1998  (2 years 1 month) Albuquerque, New Mexico Area Senior process engineer in the 150mm PVD thin films area. Mentored three engineers and one technician. Responsible for meeting area line yield, die yield, throughput, cost, and equipment availability goals. Maintained area capacity model and ensured appropriate area response to shifts in factory wafer starts. Key projects and teams included the following:  \n•\tDefect reduction. Key member of the Fab7/Fab9 virtual factory Metal Improvement Team. Reduced particle levels by 70%, resulting in a 50% reduction in DPW impact, with minimum expenditure (<$10K/tool). Also helped characterize and qualify a next generation sputtering system, which resulted in ~ 10 DPW yield improvement. \n•\tFlash memory process transfer from Fab7 to Fab9. Co-leader of the PVD transfer team. Brought process up to production on time and with close parametric and defect matching between fabs. Process Engineer, Fab 9 PVD Intel Corporation February 1996  –  February 1998  (2 years 1 month) Albuquerque, New Mexico Area Senior process engineer in the 150mm PVD thin films area. Mentored three engineers and one technician. Responsible for meeting area line yield, die yield, throughput, cost, and equipment availability goals. Maintained area capacity model and ensured appropriate area response to shifts in factory wafer starts. Key projects and teams included the following:  \n•\tDefect reduction. Key member of the Fab7/Fab9 virtual factory Metal Improvement Team. Reduced particle levels by 70%, resulting in a 50% reduction in DPW impact, with minimum expenditure (<$10K/tool). Also helped characterize and qualify a next generation sputtering system, which resulted in ~ 10 DPW yield improvement. \n•\tFlash memory process transfer from Fab7 to Fab9. Co-leader of the PVD transfer team. Brought process up to production on time and with close parametric and defect matching between fabs. Production Supervisor Intel Corporation July 1993  –  February 1996  (2 years 8 months) Albuquerque, New Mexico Area Production supervisor in the wet etch area (equipment supervised included manual and automated wet benches, plasma ashers, and wafer inspection microscopes). Coordinated the work of 20+ technicians in order to meet output, quality, equipment availability, safety, training, and team development goals. Managed technical and tactical problems that involved wet etch equipment throughout the factory. Safety committee leader, ERT (chemical spill team) leader, and safety coach for shift 7. Certified Constraint Management instructor and a facilitator for Breakthrough Systems. Production Supervisor Intel Corporation July 1993  –  February 1996  (2 years 8 months) Albuquerque, New Mexico Area Production supervisor in the wet etch area (equipment supervised included manual and automated wet benches, plasma ashers, and wafer inspection microscopes). Coordinated the work of 20+ technicians in order to meet output, quality, equipment availability, safety, training, and team development goals. Managed technical and tactical problems that involved wet etch equipment throughout the factory. Safety committee leader, ERT (chemical spill team) leader, and safety coach for shift 7. Certified Constraint Management instructor and a facilitator for Breakthrough Systems. Skills Semiconductor... SPC DOE Engineering Management Semiconductors FMEA Design of Experiments IC PVD Diffusion UHV Semiconductor Industry Engineering Metrology Skills  Semiconductor... SPC DOE Engineering Management Semiconductors FMEA Design of Experiments IC PVD Diffusion UHV Semiconductor Industry Engineering Metrology Semiconductor... SPC DOE Engineering Management Semiconductors FMEA Design of Experiments IC PVD Diffusion UHV Semiconductor Industry Engineering Metrology Semiconductor... SPC DOE Engineering Management Semiconductors FMEA Design of Experiments IC PVD Diffusion UHV Semiconductor Industry Engineering Metrology Education University of Wisconsin-Madison MS,  Manufacturing Systems Engineering 1992  – 1993 McGill University MBA,  Operations Management ,  Marketing 1989  – 1991 Activities and Societies:  CKUT Washington University in St. Louis BS,  Engineering and Public Policy ,  with a minor in Russian Studies 1985  – 1989 Activities and Societies:  Student Life ,  KWUR University of Wisconsin-Madison MS,  Manufacturing Systems Engineering 1992  – 1993 University of Wisconsin-Madison MS,  Manufacturing Systems Engineering 1992  – 1993 University of Wisconsin-Madison MS,  Manufacturing Systems Engineering 1992  – 1993 McGill University MBA,  Operations Management ,  Marketing 1989  – 1991 Activities and Societies:  CKUT McGill University MBA,  Operations Management ,  Marketing 1989  – 1991 Activities and Societies:  CKUT McGill University MBA,  Operations Management ,  Marketing 1989  – 1991 Activities and Societies:  CKUT Washington University in St. Louis BS,  Engineering and Public Policy ,  with a minor in Russian Studies 1985  – 1989 Activities and Societies:  Student Life ,  KWUR Washington University in St. Louis BS,  Engineering and Public Policy ,  with a minor in Russian Studies 1985  – 1989 Activities and Societies:  Student Life ,  KWUR Washington University in St. Louis BS,  Engineering and Public Policy ,  with a minor in Russian Studies 1985  – 1989 Activities and Societies:  Student Life ,  KWUR ", "Experience Project Manager Johnson & Johnson 2013  – Present (2 years) Leading improvement Projects in Engineering, Overall Equipment Effectiveness and Intrinsic Process Capability, as well as Process Engineering in Medical Devices Manufacturing Management Consultant (Lean & Operations Excellence) Team BDS December 2011  –  May 2013  (1 year 6 months) Engineering, Health & Safety Manager C&D Foods June 2007  –  December 2011  (4 years 7 months) Business Unit Manager ABB 2004  –  2007  (3 years) Operations Manager Teradyne 2000  –  2004  (4 years) Account Manager Manufacturers Servces Limited 1997  –  2000  (3 years) Production Manager Beta Electronics Ltd 1995  –  1997  (2 years) Production Supervisor Intel Corporation 1991  –  1995  (4 years) Engineering Technician Fujitsu 1984  –  1991  (7 years) Project Manager Johnson & Johnson 2013  – Present (2 years) Leading improvement Projects in Engineering, Overall Equipment Effectiveness and Intrinsic Process Capability, as well as Process Engineering in Medical Devices Manufacturing Project Manager Johnson & Johnson 2013  – Present (2 years) Leading improvement Projects in Engineering, Overall Equipment Effectiveness and Intrinsic Process Capability, as well as Process Engineering in Medical Devices Manufacturing Management Consultant (Lean & Operations Excellence) Team BDS December 2011  –  May 2013  (1 year 6 months) Management Consultant (Lean & Operations Excellence) Team BDS December 2011  –  May 2013  (1 year 6 months) Engineering, Health & Safety Manager C&D Foods June 2007  –  December 2011  (4 years 7 months) Engineering, Health & Safety Manager C&D Foods June 2007  –  December 2011  (4 years 7 months) Business Unit Manager ABB 2004  –  2007  (3 years) Business Unit Manager ABB 2004  –  2007  (3 years) Operations Manager Teradyne 2000  –  2004  (4 years) Operations Manager Teradyne 2000  –  2004  (4 years) Account Manager Manufacturers Servces Limited 1997  –  2000  (3 years) Account Manager Manufacturers Servces Limited 1997  –  2000  (3 years) Production Manager Beta Electronics Ltd 1995  –  1997  (2 years) Production Manager Beta Electronics Ltd 1995  –  1997  (2 years) Production Supervisor Intel Corporation 1991  –  1995  (4 years) Production Supervisor Intel Corporation 1991  –  1995  (4 years) Engineering Technician Fujitsu 1984  –  1991  (7 years) Engineering Technician Fujitsu 1984  –  1991  (7 years) Skills Strategic Planning Enterprise Planning... Hoshin Kanri Balanced Scorecard Change Management Organizational... Executive Leadership... Business Excellence Lean Transformation Continuous Improvement Business Process... Value Stream Mapping Kaizen Six Sigma Process Improvement Process Capability Engineering Manufacturing Process Layout Asset Management Maintenance Engineering Project Management Industrial Engineering Quality Management... Supplier Quality... Business Continuity... Training in Project... Training in Front Line... Procedure Manuals Service Level Agreements Procurement Contracts Functional... Requirement... Design Specifications Process Thinking Leadership Operational Excellence Lean Manufacturing Process Engineering Management System Quality System Business Strategy DMAIC See 28+     See less Skills  Strategic Planning Enterprise Planning... Hoshin Kanri Balanced Scorecard Change Management Organizational... Executive Leadership... Business Excellence Lean Transformation Continuous Improvement Business Process... Value Stream Mapping Kaizen Six Sigma Process Improvement Process Capability Engineering Manufacturing Process Layout Asset Management Maintenance Engineering Project Management Industrial Engineering Quality Management... Supplier Quality... Business Continuity... Training in Project... Training in Front Line... Procedure Manuals Service Level Agreements Procurement Contracts Functional... Requirement... Design Specifications Process Thinking Leadership Operational Excellence Lean Manufacturing Process Engineering Management System Quality System Business Strategy DMAIC See 28+     See less Strategic Planning Enterprise Planning... Hoshin Kanri Balanced Scorecard Change Management Organizational... Executive Leadership... Business Excellence Lean Transformation Continuous Improvement Business Process... Value Stream Mapping Kaizen Six Sigma Process Improvement Process Capability Engineering Manufacturing Process Layout Asset Management Maintenance Engineering Project Management Industrial Engineering Quality Management... Supplier Quality... Business Continuity... Training in Project... Training in Front Line... Procedure Manuals Service Level Agreements Procurement Contracts Functional... Requirement... Design Specifications Process Thinking Leadership Operational Excellence Lean Manufacturing Process Engineering Management System Quality System Business Strategy DMAIC See 28+     See less Strategic Planning Enterprise Planning... Hoshin Kanri Balanced Scorecard Change Management Organizational... Executive Leadership... Business Excellence Lean Transformation Continuous Improvement Business Process... Value Stream Mapping Kaizen Six Sigma Process Improvement Process Capability Engineering Manufacturing Process Layout Asset Management Maintenance Engineering Project Management Industrial Engineering Quality Management... Supplier Quality... Business Continuity... Training in Project... Training in Front Line... Procedure Manuals Service Level Agreements Procurement Contracts Functional... Requirement... Design Specifications Process Thinking Leadership Operational Excellence Lean Manufacturing Process Engineering Management System Quality System Business Strategy DMAIC See 28+     See less Education University of Ulster, Jordanstown Masters in,  Business (Executive Leadership) 2006  – 2008 Dublin Institute of Technology B.Eng.,  Industrial / Engineering Management 1992  – 1993 Institute of Industrial Engineers Diploma,  Industrial Engineering 1991  – 1992 Athlone Institute of Technology Mechanical Engineering 1982  – 1984 Project Management Institute (PMI) PMP Credential,  Project Management 2011 American Society for Quality (ASQ) Six Sigma Black Belt 2012  – 2013 University of Ulster, Jordanstown Masters in,  Business (Executive Leadership) 2006  – 2008 University of Ulster, Jordanstown Masters in,  Business (Executive Leadership) 2006  – 2008 University of Ulster, Jordanstown Masters in,  Business (Executive Leadership) 2006  – 2008 Dublin Institute of Technology B.Eng.,  Industrial / Engineering Management 1992  – 1993 Dublin Institute of Technology B.Eng.,  Industrial / Engineering Management 1992  – 1993 Dublin Institute of Technology B.Eng.,  Industrial / Engineering Management 1992  – 1993 Institute of Industrial Engineers Diploma,  Industrial Engineering 1991  – 1992 Institute of Industrial Engineers Diploma,  Industrial Engineering 1991  – 1992 Institute of Industrial Engineers Diploma,  Industrial Engineering 1991  – 1992 Athlone Institute of Technology Mechanical Engineering 1982  – 1984 Athlone Institute of Technology Mechanical Engineering 1982  – 1984 Athlone Institute of Technology Mechanical Engineering 1982  – 1984 Project Management Institute (PMI) PMP Credential,  Project Management 2011 Project Management Institute (PMI) PMP Credential,  Project Management 2011 Project Management Institute (PMI) PMP Credential,  Project Management 2011 American Society for Quality (ASQ) Six Sigma Black Belt 2012  – 2013 American Society for Quality (ASQ) Six Sigma Black Belt 2012  – 2013 American Society for Quality (ASQ) Six Sigma Black Belt 2012  – 2013 ", "Skills SAP R/3 SD SAP Business Process Visio Project Management Materials Management Testing Management Logistics MS Project ERP SAP ERP Business Process... Integration Business Intelligence Requirements Analysis SAP Implementation Business Analysis Compliance Management Teamwork See 6+     See less Skills  SAP R/3 SD SAP Business Process Visio Project Management Materials Management Testing Management Logistics MS Project ERP SAP ERP Business Process... Integration Business Intelligence Requirements Analysis SAP Implementation Business Analysis Compliance Management Teamwork See 6+     See less SAP R/3 SD SAP Business Process Visio Project Management Materials Management Testing Management Logistics MS Project ERP SAP ERP Business Process... Integration Business Intelligence Requirements Analysis SAP Implementation Business Analysis Compliance Management Teamwork See 6+     See less SAP R/3 SD SAP Business Process Visio Project Management Materials Management Testing Management Logistics MS Project ERP SAP ERP Business Process... Integration Business Intelligence Requirements Analysis SAP Implementation Business Analysis Compliance Management Teamwork See 6+     See less ", "Summary I am a multi-dimensional executive who leverages deep and broad experience in information technology, corporate finance and production planning and control to achieve exceptional results. My purpose is to be a leader in driving business growth, customer satisfaction, employee commitment and productivity, and in aligning cost structure with profitability objectives. \n \nI apply strong organizational leadership and creativity to drive performance excellence, create value and deliver positive and lasting outcomes. I have had great success in defining and articulating direction for new teams and I bring a personal passion and life long work ethic to overcome challenges. I take great pride in being a leader who inspires, galvanizes and builds trust with internal and external stakeholders.  \n \nMy strengths include strategic planning, problem solving, and motivating staff to pursue a compelling vision. I thrive on leading new initiatives that require novel approaches and broad cross functional knowledge and collaboration. Information technology and finance are my favorites because they require a powerful combination of business acumen, technical and analytical skills. I never stop learning and trying new things to achieve better outcomes.  \n \nOther skill areas include: IT capabilities for Human Resources, information quality and master data management, data warehousing, business intelligence and financial leadership for sustained growth. My enterprise software and solutions experience includes SAP, PeopleSoft, Taleo, Saba, Teradata, MicroStrategy, Informatica, Oracle database, Golden Gate and most recently Hadoop (HFDS). Summary I am a multi-dimensional executive who leverages deep and broad experience in information technology, corporate finance and production planning and control to achieve exceptional results. My purpose is to be a leader in driving business growth, customer satisfaction, employee commitment and productivity, and in aligning cost structure with profitability objectives. \n \nI apply strong organizational leadership and creativity to drive performance excellence, create value and deliver positive and lasting outcomes. I have had great success in defining and articulating direction for new teams and I bring a personal passion and life long work ethic to overcome challenges. I take great pride in being a leader who inspires, galvanizes and builds trust with internal and external stakeholders.  \n \nMy strengths include strategic planning, problem solving, and motivating staff to pursue a compelling vision. I thrive on leading new initiatives that require novel approaches and broad cross functional knowledge and collaboration. Information technology and finance are my favorites because they require a powerful combination of business acumen, technical and analytical skills. I never stop learning and trying new things to achieve better outcomes.  \n \nOther skill areas include: IT capabilities for Human Resources, information quality and master data management, data warehousing, business intelligence and financial leadership for sustained growth. My enterprise software and solutions experience includes SAP, PeopleSoft, Taleo, Saba, Teradata, MicroStrategy, Informatica, Oracle database, Golden Gate and most recently Hadoop (HFDS). I am a multi-dimensional executive who leverages deep and broad experience in information technology, corporate finance and production planning and control to achieve exceptional results. My purpose is to be a leader in driving business growth, customer satisfaction, employee commitment and productivity, and in aligning cost structure with profitability objectives. \n \nI apply strong organizational leadership and creativity to drive performance excellence, create value and deliver positive and lasting outcomes. I have had great success in defining and articulating direction for new teams and I bring a personal passion and life long work ethic to overcome challenges. I take great pride in being a leader who inspires, galvanizes and builds trust with internal and external stakeholders.  \n \nMy strengths include strategic planning, problem solving, and motivating staff to pursue a compelling vision. I thrive on leading new initiatives that require novel approaches and broad cross functional knowledge and collaboration. Information technology and finance are my favorites because they require a powerful combination of business acumen, technical and analytical skills. I never stop learning and trying new things to achieve better outcomes.  \n \nOther skill areas include: IT capabilities for Human Resources, information quality and master data management, data warehousing, business intelligence and financial leadership for sustained growth. My enterprise software and solutions experience includes SAP, PeopleSoft, Taleo, Saba, Teradata, MicroStrategy, Informatica, Oracle database, Golden Gate and most recently Hadoop (HFDS). I am a multi-dimensional executive who leverages deep and broad experience in information technology, corporate finance and production planning and control to achieve exceptional results. My purpose is to be a leader in driving business growth, customer satisfaction, employee commitment and productivity, and in aligning cost structure with profitability objectives. \n \nI apply strong organizational leadership and creativity to drive performance excellence, create value and deliver positive and lasting outcomes. I have had great success in defining and articulating direction for new teams and I bring a personal passion and life long work ethic to overcome challenges. I take great pride in being a leader who inspires, galvanizes and builds trust with internal and external stakeholders.  \n \nMy strengths include strategic planning, problem solving, and motivating staff to pursue a compelling vision. I thrive on leading new initiatives that require novel approaches and broad cross functional knowledge and collaboration. Information technology and finance are my favorites because they require a powerful combination of business acumen, technical and analytical skills. I never stop learning and trying new things to achieve better outcomes.  \n \nOther skill areas include: IT capabilities for Human Resources, information quality and master data management, data warehousing, business intelligence and financial leadership for sustained growth. My enterprise software and solutions experience includes SAP, PeopleSoft, Taleo, Saba, Teradata, MicroStrategy, Informatica, Oracle database, Golden Gate and most recently Hadoop (HFDS). Experience IT Director - Data Analytics & Platform Services Apollo Group March 2013  – Present (2 years 6 months) Phoenix, Arizona Area Leading a team that delivers enterprise business intelligence, data warehousing and integration solutions. Our focus is on enabling business stakeholders to use information in ways that create exceptional value for our students, faculty, employees and shareholders. We also drive enterprise technology standards for data management that enable economies of scale and lower costs without compromising the speed and agility that are essential for competitive advantage. We use a variety of Oracle technologies for ODS and data mart platforms and a Hadoop platform that ingests data from several sources, the largest of which is the University of Phoenix on-line classroom application. IT Director - HR Systems Apollo Group May 2012  –  March 2013  (11 months) Phoenix, Arizona Area Developed HR solutions for the enterprise using the PeopleSoft HRMS platform. Managed a team of developers, systems and QA analysts covering functional modules including payroll, time & labor, absence management, recruiting, core HR, workforce administration, learning, employee and manager self-service and customer relationship management--HR help desk. Worked closely with HR to develop systems strategy and implement third-party solutions that integrate with PeopleSoft. Director, Human Resources Information Solutions (Retired) Intel Corporation February 2010  –  April 2012  (2 years 3 months) Chandler, Arizona Led the organization that develops, delivers and runs human resources solutions for the company worldwide. Focus areas included upgrading our Human Capital Management System, user experience improvement for learning, talent and performance management, transformation to service management for improved quality and productivity. Director, HR IT, Portal and Content Management Services Intel Corporation February 2010  –  February 2011  (1 year 1 month) Chandler, AZ In addition to HR capabilities, this role included enterprise portal (i.e. employee home page) and content management systems to store and protect intellectual assets. Major improvements were made to the employee home page including personalization options for content presentation, creation of a widget/app store and a robust search capability that included search-as-you-type. Director, Master Data Engineering Intel Corporation November 2006  –  February 2010  (3 years 4 months) Chandler, AZ Drove a major initiative to standardize master data at Intel and deliver master data management (MDM) capabilities that enable dramatic improvement in the quality and speed of business decisions. Highlights include: Corporate data standards defined and implemented through a governance model with active business participation and C-level executive sponsorship; Successful deployment of SAP and Teradata MDM business solutions for Item/product, Location, Supplier and Commodity Code subject areas; Industry leadership demonstrated through external presentations and publications: Stanford Global Supply Chain Forum, Data Warehouse Institute conference keynote, SAP Sapphire Conference, Teradata Partners Conference, Data Strategy Journal. General Manager, Enterprise Solutions & Technology Services Intel Corporation June 2003  –  October 2006  (3 years 5 months) Chandler, AZ Leader of a 2000+ organization of IT professionals that developed enterprise architecture, integrated business applications and engineered platforms for computing, network, middleware and storage as standards-based shared services. Major accomplishments: defined and initiated a comprehensive SAP/ERP strategic re-implementation program to drive improvements in business capability, efficiency and total cost. This multi-year program was chartered with implementing the latest generation of SAP Netweaver and core business suite applications.  \n \nSavings of $40M were realized through targeted efficiency and globalization programs. Director, Information Quality Management Intel Corporation April 2001  –  October 2004  (3 years 7 months) Chandler, AZ Led the corporation to expand its creation and use of data standards in business processes and decision support applications. Numerous breakthrough business and intelligence and analytics solutions were produced using an enterprise data warehouse (Teradata/MicroStrategy) that is now among the largest in the world, delivering mission critical reporting and query capabilities throughout the company.  \n \nDeveloped the corporate standard practice for defining, measuring and improving the quality of data. Set data quality goals tied to bonus compensation for >2000 employees, driving standards and defect reduction to unprecedented levels. Group Controller, Enterprise Services Intel Corporation March 1999  –  March 2001  (2 years 1 month) Folsom, CA Operations finance for enterprise services including HR, Finance, Legal and IT. Worked directly with the Chief Enterprise Services Officer/CFO and the VP's of each function to set investment levels and strategic direction. Established the practice of IT product and service costing to increase accountability and drive performance toward best-in-class benchmarks. Group Controller, Computing Enhancement Group Intel Corporation January 1997  –  February 1999  (2 years 2 months) Chandler, AZ Financial leadership for a $4B annual revenue semiconductor business comprised of six product divisions. Implemented a first-ever capital affordability model for an Intel semiconductor business to assess economic profitability. Two major acquisitions completed including Digital Corp. semiconductor business. Controller & Director, Intel Europe Finance & Administration Intel Corporation January 1996  –  December 1996  (1 year) Swindon, United Kingdom An expatriate position responsible for all aspects of finance and administration for European operations and legal entities. Established the first Intel Russia-based facilities, restructured warehouse operations and implemented European finance career development process. Division Controller Intel Corporation January 1991  –  December 1995  (5 years) Folsom, CA Responsible for profit management and setting strategic financial direction for the Memory Components Division. Part of the senior leadership team that started Intel's Flash memory business, growing it profitably to $750M annual revenue. Negotiated the financial elements of a strategic agreement/alliance with Sharp Corporation to manufacture and jointly develop flash memory products. Production Control & Finance Manager , Planning Manager, Production Supervisor Intel Corporation June 1982  –  December 1990  (8 years 7 months) Santa Clara, CA Member of the wafer fabrication plant senior staff responsible for inventory management, product scheduling, document control, mask/reticle administration and all aspects of factory finance including expense management, process cost, capital and asset management.  \n \nEntered Intel as a Production Supervisor responsible for a team of equipment operators and technicians in a wafer fabrication plant. This position provided significant hands-on experience in manufacturing, process control and supervision. IT Director - Data Analytics & Platform Services Apollo Group March 2013  – Present (2 years 6 months) Phoenix, Arizona Area Leading a team that delivers enterprise business intelligence, data warehousing and integration solutions. Our focus is on enabling business stakeholders to use information in ways that create exceptional value for our students, faculty, employees and shareholders. We also drive enterprise technology standards for data management that enable economies of scale and lower costs without compromising the speed and agility that are essential for competitive advantage. We use a variety of Oracle technologies for ODS and data mart platforms and a Hadoop platform that ingests data from several sources, the largest of which is the University of Phoenix on-line classroom application. IT Director - Data Analytics & Platform Services Apollo Group March 2013  – Present (2 years 6 months) Phoenix, Arizona Area Leading a team that delivers enterprise business intelligence, data warehousing and integration solutions. Our focus is on enabling business stakeholders to use information in ways that create exceptional value for our students, faculty, employees and shareholders. We also drive enterprise technology standards for data management that enable economies of scale and lower costs without compromising the speed and agility that are essential for competitive advantage. We use a variety of Oracle technologies for ODS and data mart platforms and a Hadoop platform that ingests data from several sources, the largest of which is the University of Phoenix on-line classroom application. IT Director - HR Systems Apollo Group May 2012  –  March 2013  (11 months) Phoenix, Arizona Area Developed HR solutions for the enterprise using the PeopleSoft HRMS platform. Managed a team of developers, systems and QA analysts covering functional modules including payroll, time & labor, absence management, recruiting, core HR, workforce administration, learning, employee and manager self-service and customer relationship management--HR help desk. Worked closely with HR to develop systems strategy and implement third-party solutions that integrate with PeopleSoft. IT Director - HR Systems Apollo Group May 2012  –  March 2013  (11 months) Phoenix, Arizona Area Developed HR solutions for the enterprise using the PeopleSoft HRMS platform. Managed a team of developers, systems and QA analysts covering functional modules including payroll, time & labor, absence management, recruiting, core HR, workforce administration, learning, employee and manager self-service and customer relationship management--HR help desk. Worked closely with HR to develop systems strategy and implement third-party solutions that integrate with PeopleSoft. Director, Human Resources Information Solutions (Retired) Intel Corporation February 2010  –  April 2012  (2 years 3 months) Chandler, Arizona Led the organization that develops, delivers and runs human resources solutions for the company worldwide. Focus areas included upgrading our Human Capital Management System, user experience improvement for learning, talent and performance management, transformation to service management for improved quality and productivity. Director, Human Resources Information Solutions (Retired) Intel Corporation February 2010  –  April 2012  (2 years 3 months) Chandler, Arizona Led the organization that develops, delivers and runs human resources solutions for the company worldwide. Focus areas included upgrading our Human Capital Management System, user experience improvement for learning, talent and performance management, transformation to service management for improved quality and productivity. Director, HR IT, Portal and Content Management Services Intel Corporation February 2010  –  February 2011  (1 year 1 month) Chandler, AZ In addition to HR capabilities, this role included enterprise portal (i.e. employee home page) and content management systems to store and protect intellectual assets. Major improvements were made to the employee home page including personalization options for content presentation, creation of a widget/app store and a robust search capability that included search-as-you-type. Director, HR IT, Portal and Content Management Services Intel Corporation February 2010  –  February 2011  (1 year 1 month) Chandler, AZ In addition to HR capabilities, this role included enterprise portal (i.e. employee home page) and content management systems to store and protect intellectual assets. Major improvements were made to the employee home page including personalization options for content presentation, creation of a widget/app store and a robust search capability that included search-as-you-type. Director, Master Data Engineering Intel Corporation November 2006  –  February 2010  (3 years 4 months) Chandler, AZ Drove a major initiative to standardize master data at Intel and deliver master data management (MDM) capabilities that enable dramatic improvement in the quality and speed of business decisions. Highlights include: Corporate data standards defined and implemented through a governance model with active business participation and C-level executive sponsorship; Successful deployment of SAP and Teradata MDM business solutions for Item/product, Location, Supplier and Commodity Code subject areas; Industry leadership demonstrated through external presentations and publications: Stanford Global Supply Chain Forum, Data Warehouse Institute conference keynote, SAP Sapphire Conference, Teradata Partners Conference, Data Strategy Journal. Director, Master Data Engineering Intel Corporation November 2006  –  February 2010  (3 years 4 months) Chandler, AZ Drove a major initiative to standardize master data at Intel and deliver master data management (MDM) capabilities that enable dramatic improvement in the quality and speed of business decisions. Highlights include: Corporate data standards defined and implemented through a governance model with active business participation and C-level executive sponsorship; Successful deployment of SAP and Teradata MDM business solutions for Item/product, Location, Supplier and Commodity Code subject areas; Industry leadership demonstrated through external presentations and publications: Stanford Global Supply Chain Forum, Data Warehouse Institute conference keynote, SAP Sapphire Conference, Teradata Partners Conference, Data Strategy Journal. General Manager, Enterprise Solutions & Technology Services Intel Corporation June 2003  –  October 2006  (3 years 5 months) Chandler, AZ Leader of a 2000+ organization of IT professionals that developed enterprise architecture, integrated business applications and engineered platforms for computing, network, middleware and storage as standards-based shared services. Major accomplishments: defined and initiated a comprehensive SAP/ERP strategic re-implementation program to drive improvements in business capability, efficiency and total cost. This multi-year program was chartered with implementing the latest generation of SAP Netweaver and core business suite applications.  \n \nSavings of $40M were realized through targeted efficiency and globalization programs. General Manager, Enterprise Solutions & Technology Services Intel Corporation June 2003  –  October 2006  (3 years 5 months) Chandler, AZ Leader of a 2000+ organization of IT professionals that developed enterprise architecture, integrated business applications and engineered platforms for computing, network, middleware and storage as standards-based shared services. Major accomplishments: defined and initiated a comprehensive SAP/ERP strategic re-implementation program to drive improvements in business capability, efficiency and total cost. This multi-year program was chartered with implementing the latest generation of SAP Netweaver and core business suite applications.  \n \nSavings of $40M were realized through targeted efficiency and globalization programs. Director, Information Quality Management Intel Corporation April 2001  –  October 2004  (3 years 7 months) Chandler, AZ Led the corporation to expand its creation and use of data standards in business processes and decision support applications. Numerous breakthrough business and intelligence and analytics solutions were produced using an enterprise data warehouse (Teradata/MicroStrategy) that is now among the largest in the world, delivering mission critical reporting and query capabilities throughout the company.  \n \nDeveloped the corporate standard practice for defining, measuring and improving the quality of data. Set data quality goals tied to bonus compensation for >2000 employees, driving standards and defect reduction to unprecedented levels. Director, Information Quality Management Intel Corporation April 2001  –  October 2004  (3 years 7 months) Chandler, AZ Led the corporation to expand its creation and use of data standards in business processes and decision support applications. Numerous breakthrough business and intelligence and analytics solutions were produced using an enterprise data warehouse (Teradata/MicroStrategy) that is now among the largest in the world, delivering mission critical reporting and query capabilities throughout the company.  \n \nDeveloped the corporate standard practice for defining, measuring and improving the quality of data. Set data quality goals tied to bonus compensation for >2000 employees, driving standards and defect reduction to unprecedented levels. Group Controller, Enterprise Services Intel Corporation March 1999  –  March 2001  (2 years 1 month) Folsom, CA Operations finance for enterprise services including HR, Finance, Legal and IT. Worked directly with the Chief Enterprise Services Officer/CFO and the VP's of each function to set investment levels and strategic direction. Established the practice of IT product and service costing to increase accountability and drive performance toward best-in-class benchmarks. Group Controller, Enterprise Services Intel Corporation March 1999  –  March 2001  (2 years 1 month) Folsom, CA Operations finance for enterprise services including HR, Finance, Legal and IT. Worked directly with the Chief Enterprise Services Officer/CFO and the VP's of each function to set investment levels and strategic direction. Established the practice of IT product and service costing to increase accountability and drive performance toward best-in-class benchmarks. Group Controller, Computing Enhancement Group Intel Corporation January 1997  –  February 1999  (2 years 2 months) Chandler, AZ Financial leadership for a $4B annual revenue semiconductor business comprised of six product divisions. Implemented a first-ever capital affordability model for an Intel semiconductor business to assess economic profitability. Two major acquisitions completed including Digital Corp. semiconductor business. Group Controller, Computing Enhancement Group Intel Corporation January 1997  –  February 1999  (2 years 2 months) Chandler, AZ Financial leadership for a $4B annual revenue semiconductor business comprised of six product divisions. Implemented a first-ever capital affordability model for an Intel semiconductor business to assess economic profitability. Two major acquisitions completed including Digital Corp. semiconductor business. Controller & Director, Intel Europe Finance & Administration Intel Corporation January 1996  –  December 1996  (1 year) Swindon, United Kingdom An expatriate position responsible for all aspects of finance and administration for European operations and legal entities. Established the first Intel Russia-based facilities, restructured warehouse operations and implemented European finance career development process. Controller & Director, Intel Europe Finance & Administration Intel Corporation January 1996  –  December 1996  (1 year) Swindon, United Kingdom An expatriate position responsible for all aspects of finance and administration for European operations and legal entities. Established the first Intel Russia-based facilities, restructured warehouse operations and implemented European finance career development process. Division Controller Intel Corporation January 1991  –  December 1995  (5 years) Folsom, CA Responsible for profit management and setting strategic financial direction for the Memory Components Division. Part of the senior leadership team that started Intel's Flash memory business, growing it profitably to $750M annual revenue. Negotiated the financial elements of a strategic agreement/alliance with Sharp Corporation to manufacture and jointly develop flash memory products. Division Controller Intel Corporation January 1991  –  December 1995  (5 years) Folsom, CA Responsible for profit management and setting strategic financial direction for the Memory Components Division. Part of the senior leadership team that started Intel's Flash memory business, growing it profitably to $750M annual revenue. Negotiated the financial elements of a strategic agreement/alliance with Sharp Corporation to manufacture and jointly develop flash memory products. Production Control & Finance Manager , Planning Manager, Production Supervisor Intel Corporation June 1982  –  December 1990  (8 years 7 months) Santa Clara, CA Member of the wafer fabrication plant senior staff responsible for inventory management, product scheduling, document control, mask/reticle administration and all aspects of factory finance including expense management, process cost, capital and asset management.  \n \nEntered Intel as a Production Supervisor responsible for a team of equipment operators and technicians in a wafer fabrication plant. This position provided significant hands-on experience in manufacturing, process control and supervision. Production Control & Finance Manager , Planning Manager, Production Supervisor Intel Corporation June 1982  –  December 1990  (8 years 7 months) Santa Clara, CA Member of the wafer fabrication plant senior staff responsible for inventory management, product scheduling, document control, mask/reticle administration and all aspects of factory finance including expense management, process cost, capital and asset management.  \n \nEntered Intel as a Production Supervisor responsible for a team of equipment operators and technicians in a wafer fabrication plant. This position provided significant hands-on experience in manufacturing, process control and supervision. Skills Customer Data... Master Data Management Data Quality Product Strategy Finance operations Information Management Supplier Negotiations Coaching Mentoring Employee Management Product Management Finance Supplier Negotiation Enterprise Architecture Cloud Computing IT Leadership Inspiring People Stakeholder Engagement Information Technology... Semiconductors Leadership Cross-functional Team... Business Intelligence Management Program Management Analytics SDLC ERP Process Improvement Data Warehousing Team Management Integration See 17+     See less Skills  Customer Data... Master Data Management Data Quality Product Strategy Finance operations Information Management Supplier Negotiations Coaching Mentoring Employee Management Product Management Finance Supplier Negotiation Enterprise Architecture Cloud Computing IT Leadership Inspiring People Stakeholder Engagement Information Technology... Semiconductors Leadership Cross-functional Team... Business Intelligence Management Program Management Analytics SDLC ERP Process Improvement Data Warehousing Team Management Integration See 17+     See less Customer Data... Master Data Management Data Quality Product Strategy Finance operations Information Management Supplier Negotiations Coaching Mentoring Employee Management Product Management Finance Supplier Negotiation Enterprise Architecture Cloud Computing IT Leadership Inspiring People Stakeholder Engagement Information Technology... Semiconductors Leadership Cross-functional Team... Business Intelligence Management Program Management Analytics SDLC ERP Process Improvement Data Warehousing Team Management Integration See 17+     See less Customer Data... Master Data Management Data Quality Product Strategy Finance operations Information Management Supplier Negotiations Coaching Mentoring Employee Management Product Management Finance Supplier Negotiation Enterprise Architecture Cloud Computing IT Leadership Inspiring People Stakeholder Engagement Information Technology... Semiconductors Leadership Cross-functional Team... Business Intelligence Management Program Management Analytics SDLC ERP Process Improvement Data Warehousing Team Management Integration See 17+     See less Education California State University-Fresno Bachelor's degree,  Business Administration - Finance 1978  – 1982 I majored in Business Administration with a concentration in finance. I was the fortunate recipient of an athletic scholarship in track and cross country and participated in the school's Division I NCAA program all four years. In my senior year, our cross country team won the conference championship. Activities and Societies:  NCAA Division I Track & Cross Country - Scholarship recipient\nScholar Athlete Skyline High School Oakland, CA Activities and Societies:  Varsity track ,  cross country and soccer. Member of the Quill and Scroll Society (for high school journalism achievement). California State University-Fresno Bachelor's degree,  Business Administration - Finance 1978  – 1982 I majored in Business Administration with a concentration in finance. I was the fortunate recipient of an athletic scholarship in track and cross country and participated in the school's Division I NCAA program all four years. In my senior year, our cross country team won the conference championship. Activities and Societies:  NCAA Division I Track & Cross Country - Scholarship recipient\nScholar Athlete California State University-Fresno Bachelor's degree,  Business Administration - Finance 1978  – 1982 I majored in Business Administration with a concentration in finance. I was the fortunate recipient of an athletic scholarship in track and cross country and participated in the school's Division I NCAA program all four years. In my senior year, our cross country team won the conference championship. Activities and Societies:  NCAA Division I Track & Cross Country - Scholarship recipient\nScholar Athlete California State University-Fresno Bachelor's degree,  Business Administration - Finance 1978  – 1982 I majored in Business Administration with a concentration in finance. I was the fortunate recipient of an athletic scholarship in track and cross country and participated in the school's Division I NCAA program all four years. In my senior year, our cross country team won the conference championship. Activities and Societies:  NCAA Division I Track & Cross Country - Scholarship recipient\nScholar Athlete Skyline High School Oakland, CA Activities and Societies:  Varsity track ,  cross country and soccer. Member of the Quill and Scroll Society (for high school journalism achievement). Skyline High School Oakland, CA Activities and Societies:  Varsity track ,  cross country and soccer. Member of the Quill and Scroll Society (for high school journalism achievement). Skyline High School Oakland, CA Activities and Societies:  Varsity track ,  cross country and soccer. Member of the Quill and Scroll Society (for high school journalism achievement). ", "Summary Current Manufacturing Supervisor for Schaeffler Group overseeing heat treat, grind, and finishing areas. Former Site Manager at ARD Logistics Alabama, LLC - Warehousing, sequencing, and assembly of parts for shipment to Mercedes Benz US International, Vance, Alabama. 600 employees. \nPlant Manager for UNICUM, a Kiosk, Vending, and Payment machine manufacturer in Kolpino, Russia. (US Citizen) \nFormer Director of Manufacturing and Former Director of Continuous Improvement for Techno-Solis. Former Toyota Group/Hino Operations Manager. Production Manager and Supervisor for several fortune 500 companies as well as smaller manufacturing firms. \n \nSpecialties: Lean manufacturing practitioner, Six Sigma Certified. Team building and culture change. \nIndustries: Automotive, Assembly, Semiconductor, Plastics, and Medical Device (class I & III)  \nProcesses: Class \"A\" metal stamping, CNC machining, milling & lathes, Plastic Injection Molding, Plastic Extrusion, Metal Casting, Assembly, Powder Coating, Welding. \n \nBBL - Bachelor Business Administration (Leadership), Cum Laude, Baker College of Owosso, Michigan. Summary Current Manufacturing Supervisor for Schaeffler Group overseeing heat treat, grind, and finishing areas. Former Site Manager at ARD Logistics Alabama, LLC - Warehousing, sequencing, and assembly of parts for shipment to Mercedes Benz US International, Vance, Alabama. 600 employees. \nPlant Manager for UNICUM, a Kiosk, Vending, and Payment machine manufacturer in Kolpino, Russia. (US Citizen) \nFormer Director of Manufacturing and Former Director of Continuous Improvement for Techno-Solis. Former Toyota Group/Hino Operations Manager. Production Manager and Supervisor for several fortune 500 companies as well as smaller manufacturing firms. \n \nSpecialties: Lean manufacturing practitioner, Six Sigma Certified. Team building and culture change. \nIndustries: Automotive, Assembly, Semiconductor, Plastics, and Medical Device (class I & III)  \nProcesses: Class \"A\" metal stamping, CNC machining, milling & lathes, Plastic Injection Molding, Plastic Extrusion, Metal Casting, Assembly, Powder Coating, Welding. \n \nBBL - Bachelor Business Administration (Leadership), Cum Laude, Baker College of Owosso, Michigan. Current Manufacturing Supervisor for Schaeffler Group overseeing heat treat, grind, and finishing areas. Former Site Manager at ARD Logistics Alabama, LLC - Warehousing, sequencing, and assembly of parts for shipment to Mercedes Benz US International, Vance, Alabama. 600 employees. \nPlant Manager for UNICUM, a Kiosk, Vending, and Payment machine manufacturer in Kolpino, Russia. (US Citizen) \nFormer Director of Manufacturing and Former Director of Continuous Improvement for Techno-Solis. Former Toyota Group/Hino Operations Manager. Production Manager and Supervisor for several fortune 500 companies as well as smaller manufacturing firms. \n \nSpecialties: Lean manufacturing practitioner, Six Sigma Certified. Team building and culture change. \nIndustries: Automotive, Assembly, Semiconductor, Plastics, and Medical Device (class I & III)  \nProcesses: Class \"A\" metal stamping, CNC machining, milling & lathes, Plastic Injection Molding, Plastic Extrusion, Metal Casting, Assembly, Powder Coating, Welding. \n \nBBL - Bachelor Business Administration (Leadership), Cum Laude, Baker College of Owosso, Michigan. Current Manufacturing Supervisor for Schaeffler Group overseeing heat treat, grind, and finishing areas. Former Site Manager at ARD Logistics Alabama, LLC - Warehousing, sequencing, and assembly of parts for shipment to Mercedes Benz US International, Vance, Alabama. 600 employees. \nPlant Manager for UNICUM, a Kiosk, Vending, and Payment machine manufacturer in Kolpino, Russia. (US Citizen) \nFormer Director of Manufacturing and Former Director of Continuous Improvement for Techno-Solis. Former Toyota Group/Hino Operations Manager. Production Manager and Supervisor for several fortune 500 companies as well as smaller manufacturing firms. \n \nSpecialties: Lean manufacturing practitioner, Six Sigma Certified. Team building and culture change. \nIndustries: Automotive, Assembly, Semiconductor, Plastics, and Medical Device (class I & III)  \nProcesses: Class \"A\" metal stamping, CNC machining, milling & lathes, Plastic Injection Molding, Plastic Extrusion, Metal Casting, Assembly, Powder Coating, Welding. \n \nBBL - Bachelor Business Administration (Leadership), Cum Laude, Baker College of Owosso, Michigan. Experience Manufacturing Supervisor Schaeffler August 2015  – Present (1 month) Fort Mill, South Carolina Site Manager ARD Logistics Alabama, LLC October 2014  –  August 2015  (11 months) Vance, Alabama 45,000 SQ FT facility employing 600+ employees, 3 shifts.  \nSupervise and control all planning, coordination and direction of production activities, ensuring maximum operating efficiency and product quality. Ensure all jobs are performed safely, efficiently and accurately to maintain and improve the performance of the entire plant in alignment with Safety, Quality and Cost and Delivery (SQCD). Develop Operations Managers to maintain and improve plant performance to increase profit margins. Plant Manager UNICUM July 2014  –  October 2014  (4 months) Russian Federation Overseeing manufacturing operations for maximization of gross profits. Plant Director over a 400,000 Square foot facility in Kolpino, Russia with 300+ employees working 3 shifts. Manufacturing vending machines, payment machines, coffee vending machines, kiosks. Responsible for new plant start up and implementation of one piece flow and LEAN manufacturing - a new practice within this manufacturing company. The factory activities include metal working (CNC punch presses, laser cutting, press brakes), welding and stud welding, grinding, powder coating, assembly, and wire harness fabrication. Overseeing all areas of plant operations including manufacturing, warehouse, QC, and procurement. Leaving due to political tensions, sanctions, and falling Rubble. Director of Manufacturing Techno-Solis, Inc. March 2011  –  July 2014  (3 years 5 months) Saint Petersburg, Florida Promoted to Director of Manufacturing from Director of Continuous Improvement. Responsible for overall, KPI implementation, OEE improvement for Gross Profit maximization. Responsible for overseeing a privately held, 3 shift manufacturing corporation with 8 digit international sales volume. Responsible for implementing standards and the use of LEAN Tools/Techniques to eliminate waste and promote efficiencies. Complete oversight of Safety and Preventative Maintenance programs. Collaborates with the President and CEO to define/implement Continuous Improvement strategies. Assures synchronization of Continuous Improvement efforts throughout the organization by coordinating planning and facilitating knowledge sharing. Assures coordination of the Improvement Plans with Cost Deployment priorities. Assesses the effectiveness of the Continuous Improvement processes, determines systemic improvement needs, and assures execution of the corresponding action plans. Assesses and assures the presence of Problem Solving and Continuous Improvement capabilities throughout the organization. Deploying and maintaining appropriate visual controls and maintaining appropriate Kanbans. Manage productivity improvements through cost deployment and kaizen programs. Sr. Production Supervisor Boston Scientific May 2008  –  March 2011  (2 years 11 months) Doral, FL Medical device manufacturer/fabrication (cardiac stent guide wires) Shared responsibility for plant-wide 3rd shift operations. Ensuring FDA compliance of manufacturing and fabrication activities (cGMP – 21 CFR). Address and correct non-conformances, Responsible for tracking & maintaining metrics (throughput, efficiency, yield and quality) Ensuring quality standards are met. Experience implementing and maintaining 5S to ensure safe, clean and organized work areas. Responsible for training, discipline, evaluation of hourly employees. Worked per diem as a contractor; Factory relocated to Costa Rica. Sr. Manufacturing Supervisor Texas Instruments March 2006  –  May 2008  (2 years 3 months) Stafford, Texas Oversaw approximately 1/3 of the manufacturing plant during my shift. Responsible for the development and implementation of activities in production areas in Metal Epi, Metal Dep, ILO (thin films), and Implant. Responsible to meet production goals, quality, and cost objectives. Prioritized production schedules based on product introduction, equipment efficiency, and materials supply. Selected and developed personnel to ensure the efficient operation of the production schedule. Developed schedules and manpower requirements for assigned areas. Created cross training plan. Directed subordinates to achieve assignments using established guidelines, procedures, and policies. Interacted daily with subordinates and cross-functional peer groups. Provided immediate supervision to employees, assigning tasks and checking work at frequent intervals. Member of the plant wide 5S Implementation and Development team. Earned a Six Sigma Green Belt Certification. Assistant Production Manager Hino Motors Manufacturing USA, Inc. (Toyota's Heavy Truck Division) July 2004  –  March 2006  (1 year 9 months) Marion, Arkansas Part of new plant start-up team. Responsible for new stamping plant start up. The plant was to include a large CNC machining plant with a smaller, stand alone stamping plant next door. The production manager was focused on that plant, while I had sole responsibility for the 44,000 square foot stamping plant manufacturing 300,000 parts per year. The Japanese Management team was very concerned about the success of the stamping facility in particular. The plant was built outside Memphis, TN to supply materials to the Toyota truck plants in Texas and Indiana. After learning TPS in Japan, I was sent to Thailand to observe production at a similar stamping facility and to benchmark those TPS tools I had learned in Japan for all other operations in the US. Transfer die press and progressive blanking press (blanking, coining, forming draw dies). Benchmarking Japanese Toyota plant in Bangkok, Thailand. Implemented all 5S tools and methods, along with all kanban and lean manufacturing techniques. Hired all stamping engineers, supervisors, team leaders. Implementation of visual management tools such as production boards. Production Supervisor Intel Corporation January 2000  –  January 2004  (4 years 1 month) Chandler, Arizona Semiconductor manufacturing. Thin films supervisor and supervisor over defect metrology department. Monitored SPC charts for fab (factory) quality interventions. (Accepted buyout due to industry downturn) Production Supervisor General Motors February 1995  –  December 2000  (5 years 11 months) Flint, Michigan Supervisor of 40 UAW represented employees in stamping, and assembly operations.  \nResponsible for several presses including class A body panel stamping presses from 30,000 Ton to 300 ton capacities. Contract position Manufacturing Supervisor Schaeffler August 2015  – Present (1 month) Fort Mill, South Carolina Manufacturing Supervisor Schaeffler August 2015  – Present (1 month) Fort Mill, South Carolina Site Manager ARD Logistics Alabama, LLC October 2014  –  August 2015  (11 months) Vance, Alabama 45,000 SQ FT facility employing 600+ employees, 3 shifts.  \nSupervise and control all planning, coordination and direction of production activities, ensuring maximum operating efficiency and product quality. Ensure all jobs are performed safely, efficiently and accurately to maintain and improve the performance of the entire plant in alignment with Safety, Quality and Cost and Delivery (SQCD). Develop Operations Managers to maintain and improve plant performance to increase profit margins. Site Manager ARD Logistics Alabama, LLC October 2014  –  August 2015  (11 months) Vance, Alabama 45,000 SQ FT facility employing 600+ employees, 3 shifts.  \nSupervise and control all planning, coordination and direction of production activities, ensuring maximum operating efficiency and product quality. Ensure all jobs are performed safely, efficiently and accurately to maintain and improve the performance of the entire plant in alignment with Safety, Quality and Cost and Delivery (SQCD). Develop Operations Managers to maintain and improve plant performance to increase profit margins. Plant Manager UNICUM July 2014  –  October 2014  (4 months) Russian Federation Overseeing manufacturing operations for maximization of gross profits. Plant Director over a 400,000 Square foot facility in Kolpino, Russia with 300+ employees working 3 shifts. Manufacturing vending machines, payment machines, coffee vending machines, kiosks. Responsible for new plant start up and implementation of one piece flow and LEAN manufacturing - a new practice within this manufacturing company. The factory activities include metal working (CNC punch presses, laser cutting, press brakes), welding and stud welding, grinding, powder coating, assembly, and wire harness fabrication. Overseeing all areas of plant operations including manufacturing, warehouse, QC, and procurement. Leaving due to political tensions, sanctions, and falling Rubble. Plant Manager UNICUM July 2014  –  October 2014  (4 months) Russian Federation Overseeing manufacturing operations for maximization of gross profits. Plant Director over a 400,000 Square foot facility in Kolpino, Russia with 300+ employees working 3 shifts. Manufacturing vending machines, payment machines, coffee vending machines, kiosks. Responsible for new plant start up and implementation of one piece flow and LEAN manufacturing - a new practice within this manufacturing company. The factory activities include metal working (CNC punch presses, laser cutting, press brakes), welding and stud welding, grinding, powder coating, assembly, and wire harness fabrication. Overseeing all areas of plant operations including manufacturing, warehouse, QC, and procurement. Leaving due to political tensions, sanctions, and falling Rubble. Director of Manufacturing Techno-Solis, Inc. March 2011  –  July 2014  (3 years 5 months) Saint Petersburg, Florida Promoted to Director of Manufacturing from Director of Continuous Improvement. Responsible for overall, KPI implementation, OEE improvement for Gross Profit maximization. Responsible for overseeing a privately held, 3 shift manufacturing corporation with 8 digit international sales volume. Responsible for implementing standards and the use of LEAN Tools/Techniques to eliminate waste and promote efficiencies. Complete oversight of Safety and Preventative Maintenance programs. Collaborates with the President and CEO to define/implement Continuous Improvement strategies. Assures synchronization of Continuous Improvement efforts throughout the organization by coordinating planning and facilitating knowledge sharing. Assures coordination of the Improvement Plans with Cost Deployment priorities. Assesses the effectiveness of the Continuous Improvement processes, determines systemic improvement needs, and assures execution of the corresponding action plans. Assesses and assures the presence of Problem Solving and Continuous Improvement capabilities throughout the organization. Deploying and maintaining appropriate visual controls and maintaining appropriate Kanbans. Manage productivity improvements through cost deployment and kaizen programs. Director of Manufacturing Techno-Solis, Inc. March 2011  –  July 2014  (3 years 5 months) Saint Petersburg, Florida Promoted to Director of Manufacturing from Director of Continuous Improvement. Responsible for overall, KPI implementation, OEE improvement for Gross Profit maximization. Responsible for overseeing a privately held, 3 shift manufacturing corporation with 8 digit international sales volume. Responsible for implementing standards and the use of LEAN Tools/Techniques to eliminate waste and promote efficiencies. Complete oversight of Safety and Preventative Maintenance programs. Collaborates with the President and CEO to define/implement Continuous Improvement strategies. Assures synchronization of Continuous Improvement efforts throughout the organization by coordinating planning and facilitating knowledge sharing. Assures coordination of the Improvement Plans with Cost Deployment priorities. Assesses the effectiveness of the Continuous Improvement processes, determines systemic improvement needs, and assures execution of the corresponding action plans. Assesses and assures the presence of Problem Solving and Continuous Improvement capabilities throughout the organization. Deploying and maintaining appropriate visual controls and maintaining appropriate Kanbans. Manage productivity improvements through cost deployment and kaizen programs. Sr. Production Supervisor Boston Scientific May 2008  –  March 2011  (2 years 11 months) Doral, FL Medical device manufacturer/fabrication (cardiac stent guide wires) Shared responsibility for plant-wide 3rd shift operations. Ensuring FDA compliance of manufacturing and fabrication activities (cGMP – 21 CFR). Address and correct non-conformances, Responsible for tracking & maintaining metrics (throughput, efficiency, yield and quality) Ensuring quality standards are met. Experience implementing and maintaining 5S to ensure safe, clean and organized work areas. Responsible for training, discipline, evaluation of hourly employees. Worked per diem as a contractor; Factory relocated to Costa Rica. Sr. Production Supervisor Boston Scientific May 2008  –  March 2011  (2 years 11 months) Doral, FL Medical device manufacturer/fabrication (cardiac stent guide wires) Shared responsibility for plant-wide 3rd shift operations. Ensuring FDA compliance of manufacturing and fabrication activities (cGMP – 21 CFR). Address and correct non-conformances, Responsible for tracking & maintaining metrics (throughput, efficiency, yield and quality) Ensuring quality standards are met. Experience implementing and maintaining 5S to ensure safe, clean and organized work areas. Responsible for training, discipline, evaluation of hourly employees. Worked per diem as a contractor; Factory relocated to Costa Rica. Sr. Manufacturing Supervisor Texas Instruments March 2006  –  May 2008  (2 years 3 months) Stafford, Texas Oversaw approximately 1/3 of the manufacturing plant during my shift. Responsible for the development and implementation of activities in production areas in Metal Epi, Metal Dep, ILO (thin films), and Implant. Responsible to meet production goals, quality, and cost objectives. Prioritized production schedules based on product introduction, equipment efficiency, and materials supply. Selected and developed personnel to ensure the efficient operation of the production schedule. Developed schedules and manpower requirements for assigned areas. Created cross training plan. Directed subordinates to achieve assignments using established guidelines, procedures, and policies. Interacted daily with subordinates and cross-functional peer groups. Provided immediate supervision to employees, assigning tasks and checking work at frequent intervals. Member of the plant wide 5S Implementation and Development team. Earned a Six Sigma Green Belt Certification. Sr. Manufacturing Supervisor Texas Instruments March 2006  –  May 2008  (2 years 3 months) Stafford, Texas Oversaw approximately 1/3 of the manufacturing plant during my shift. Responsible for the development and implementation of activities in production areas in Metal Epi, Metal Dep, ILO (thin films), and Implant. Responsible to meet production goals, quality, and cost objectives. Prioritized production schedules based on product introduction, equipment efficiency, and materials supply. Selected and developed personnel to ensure the efficient operation of the production schedule. Developed schedules and manpower requirements for assigned areas. Created cross training plan. Directed subordinates to achieve assignments using established guidelines, procedures, and policies. Interacted daily with subordinates and cross-functional peer groups. Provided immediate supervision to employees, assigning tasks and checking work at frequent intervals. Member of the plant wide 5S Implementation and Development team. Earned a Six Sigma Green Belt Certification. Assistant Production Manager Hino Motors Manufacturing USA, Inc. (Toyota's Heavy Truck Division) July 2004  –  March 2006  (1 year 9 months) Marion, Arkansas Part of new plant start-up team. Responsible for new stamping plant start up. The plant was to include a large CNC machining plant with a smaller, stand alone stamping plant next door. The production manager was focused on that plant, while I had sole responsibility for the 44,000 square foot stamping plant manufacturing 300,000 parts per year. The Japanese Management team was very concerned about the success of the stamping facility in particular. The plant was built outside Memphis, TN to supply materials to the Toyota truck plants in Texas and Indiana. After learning TPS in Japan, I was sent to Thailand to observe production at a similar stamping facility and to benchmark those TPS tools I had learned in Japan for all other operations in the US. Transfer die press and progressive blanking press (blanking, coining, forming draw dies). Benchmarking Japanese Toyota plant in Bangkok, Thailand. Implemented all 5S tools and methods, along with all kanban and lean manufacturing techniques. Hired all stamping engineers, supervisors, team leaders. Implementation of visual management tools such as production boards. Assistant Production Manager Hino Motors Manufacturing USA, Inc. (Toyota's Heavy Truck Division) July 2004  –  March 2006  (1 year 9 months) Marion, Arkansas Part of new plant start-up team. Responsible for new stamping plant start up. The plant was to include a large CNC machining plant with a smaller, stand alone stamping plant next door. The production manager was focused on that plant, while I had sole responsibility for the 44,000 square foot stamping plant manufacturing 300,000 parts per year. The Japanese Management team was very concerned about the success of the stamping facility in particular. The plant was built outside Memphis, TN to supply materials to the Toyota truck plants in Texas and Indiana. After learning TPS in Japan, I was sent to Thailand to observe production at a similar stamping facility and to benchmark those TPS tools I had learned in Japan for all other operations in the US. Transfer die press and progressive blanking press (blanking, coining, forming draw dies). Benchmarking Japanese Toyota plant in Bangkok, Thailand. Implemented all 5S tools and methods, along with all kanban and lean manufacturing techniques. Hired all stamping engineers, supervisors, team leaders. Implementation of visual management tools such as production boards. Production Supervisor Intel Corporation January 2000  –  January 2004  (4 years 1 month) Chandler, Arizona Semiconductor manufacturing. Thin films supervisor and supervisor over defect metrology department. Monitored SPC charts for fab (factory) quality interventions. (Accepted buyout due to industry downturn) Production Supervisor Intel Corporation January 2000  –  January 2004  (4 years 1 month) Chandler, Arizona Semiconductor manufacturing. Thin films supervisor and supervisor over defect metrology department. Monitored SPC charts for fab (factory) quality interventions. (Accepted buyout due to industry downturn) Production Supervisor General Motors February 1995  –  December 2000  (5 years 11 months) Flint, Michigan Supervisor of 40 UAW represented employees in stamping, and assembly operations.  \nResponsible for several presses including class A body panel stamping presses from 30,000 Ton to 300 ton capacities. Contract position Production Supervisor General Motors February 1995  –  December 2000  (5 years 11 months) Flint, Michigan Supervisor of 40 UAW represented employees in stamping, and assembly operations.  \nResponsible for several presses including class A body panel stamping presses from 30,000 Ton to 300 ton capacities. Contract position Languages Spanish Limited working proficiency Japanese Elementary proficiency Spanish Limited working proficiency Japanese Elementary proficiency Spanish Limited working proficiency Japanese Elementary proficiency Limited working proficiency Elementary proficiency Skills Toyota Production System Lean Manufacturing Continuous Improvement Operations Management Production Operations FDA Automotive Semiconductor Industry Stamping Presses CNC manufacturing Assembly Lines cGMP manufacturing 5S Manufacturing Six Sigma Process Improvement SPC Cross-functional Team... Value Stream Mapping Change Management DMAIC Quality Control Manufacturing... Manufacturing Operations TPM Operational Excellence Root Cause Analysis Program Management Process Engineering JIT Manufacturing... TQM Continuous improvement See 18+     See less Skills  Toyota Production System Lean Manufacturing Continuous Improvement Operations Management Production Operations FDA Automotive Semiconductor Industry Stamping Presses CNC manufacturing Assembly Lines cGMP manufacturing 5S Manufacturing Six Sigma Process Improvement SPC Cross-functional Team... Value Stream Mapping Change Management DMAIC Quality Control Manufacturing... Manufacturing Operations TPM Operational Excellence Root Cause Analysis Program Management Process Engineering JIT Manufacturing... TQM Continuous improvement See 18+     See less Toyota Production System Lean Manufacturing Continuous Improvement Operations Management Production Operations FDA Automotive Semiconductor Industry Stamping Presses CNC manufacturing Assembly Lines cGMP manufacturing 5S Manufacturing Six Sigma Process Improvement SPC Cross-functional Team... Value Stream Mapping Change Management DMAIC Quality Control Manufacturing... Manufacturing Operations TPM Operational Excellence Root Cause Analysis Program Management Process Engineering JIT Manufacturing... TQM Continuous improvement See 18+     See less Toyota Production System Lean Manufacturing Continuous Improvement Operations Management Production Operations FDA Automotive Semiconductor Industry Stamping Presses CNC manufacturing Assembly Lines cGMP manufacturing 5S Manufacturing Six Sigma Process Improvement SPC Cross-functional Team... Value Stream Mapping Change Management DMAIC Quality Control Manufacturing... Manufacturing Operations TPM Operational Excellence Root Cause Analysis Program Management Process Engineering JIT Manufacturing... TQM Continuous improvement See 18+     See less Education Baker College of Owosso BBL (BBA with Leadership Concentration),  Management 1996  – 1998 Graduated Cum Laude Activities and Societies:  Cum Laude Davenport University AS,  Business Management 1992  – 1994 Owosso High School High School Diploma,  College prepatory 1977  – 1981 Owosso High School Ranks in Top 7% \nof High Schools Nationwide \nOn April 22, “U.S. News and World Report,” one the nation’s most reputable sources for news, shared their findings of the Best High Schools project which identifies the country’s top-performing public high schools. Owosso High School was ranked 41st in Michigan and scored 1,440 out of 21,035 schools in the nation, earning the organization’s “Silver” ranking. Baker College of Owosso BBL (BBA with Leadership Concentration),  Management 1996  – 1998 Graduated Cum Laude Activities and Societies:  Cum Laude Baker College of Owosso BBL (BBA with Leadership Concentration),  Management 1996  – 1998 Graduated Cum Laude Activities and Societies:  Cum Laude Baker College of Owosso BBL (BBA with Leadership Concentration),  Management 1996  – 1998 Graduated Cum Laude Activities and Societies:  Cum Laude Davenport University AS,  Business Management 1992  – 1994 Davenport University AS,  Business Management 1992  – 1994 Davenport University AS,  Business Management 1992  – 1994 Owosso High School High School Diploma,  College prepatory 1977  – 1981 Owosso High School Ranks in Top 7% \nof High Schools Nationwide \nOn April 22, “U.S. News and World Report,” one the nation’s most reputable sources for news, shared their findings of the Best High Schools project which identifies the country’s top-performing public high schools. Owosso High School was ranked 41st in Michigan and scored 1,440 out of 21,035 schools in the nation, earning the organization’s “Silver” ranking. Owosso High School High School Diploma,  College prepatory 1977  – 1981 Owosso High School Ranks in Top 7% \nof High Schools Nationwide \nOn April 22, “U.S. News and World Report,” one the nation’s most reputable sources for news, shared their findings of the Best High Schools project which identifies the country’s top-performing public high schools. Owosso High School was ranked 41st in Michigan and scored 1,440 out of 21,035 schools in the nation, earning the organization’s “Silver” ranking. Owosso High School High School Diploma,  College prepatory 1977  – 1981 Owosso High School Ranks in Top 7% \nof High Schools Nationwide \nOn April 22, “U.S. News and World Report,” one the nation’s most reputable sources for news, shared their findings of the Best High Schools project which identifies the country’s top-performing public high schools. Owosso High School was ranked 41st in Michigan and scored 1,440 out of 21,035 schools in the nation, earning the organization’s “Silver” ranking. Honors & Awards Additional Honors & Awards Bachelors degree - Cum Laude Additional Honors & Awards Bachelors degree - Cum Laude Additional Honors & Awards Bachelors degree - Cum Laude Additional Honors & Awards Bachelors degree - Cum Laude ", "Summary Targeting for Business Operation or Strategic Supply Chain positions. \n \nBilingual Supply Chain Manager, driver of business improvements. Implemented models for incoming raw materials, Supplier Performance, factory build plans, shop floor control systems, forecasting, and inventory management. Have program managed business start-ups, tools and processes, developed reports and/or indicators to sustain or transform the business. \n \nGreat Experience on PnL and Sales & Operations Planning. Trained, managed, or lead resources in Supply Chain, Manufacturing Processes, Program management, and SAP implementations.  \n \nReach me at Titope@Yahoo.com / 503-319-6543 Summary Targeting for Business Operation or Strategic Supply Chain positions. \n \nBilingual Supply Chain Manager, driver of business improvements. Implemented models for incoming raw materials, Supplier Performance, factory build plans, shop floor control systems, forecasting, and inventory management. Have program managed business start-ups, tools and processes, developed reports and/or indicators to sustain or transform the business. \n \nGreat Experience on PnL and Sales & Operations Planning. Trained, managed, or lead resources in Supply Chain, Manufacturing Processes, Program management, and SAP implementations.  \n \nReach me at Titope@Yahoo.com / 503-319-6543 Targeting for Business Operation or Strategic Supply Chain positions. \n \nBilingual Supply Chain Manager, driver of business improvements. Implemented models for incoming raw materials, Supplier Performance, factory build plans, shop floor control systems, forecasting, and inventory management. Have program managed business start-ups, tools and processes, developed reports and/or indicators to sustain or transform the business. \n \nGreat Experience on PnL and Sales & Operations Planning. Trained, managed, or lead resources in Supply Chain, Manufacturing Processes, Program management, and SAP implementations.  \n \nReach me at Titope@Yahoo.com / 503-319-6543 Targeting for Business Operation or Strategic Supply Chain positions. \n \nBilingual Supply Chain Manager, driver of business improvements. Implemented models for incoming raw materials, Supplier Performance, factory build plans, shop floor control systems, forecasting, and inventory management. Have program managed business start-ups, tools and processes, developed reports and/or indicators to sustain or transform the business. \n \nGreat Experience on PnL and Sales & Operations Planning. Trained, managed, or lead resources in Supply Chain, Manufacturing Processes, Program management, and SAP implementations.  \n \nReach me at Titope@Yahoo.com / 503-319-6543 Experience Operations Supply Planning Manager Nike February 2013  –  August 2015  (2 years 7 months) Beaverton OR Supply/Demand Operations - Factory Program Manager Intel Corporation December 2011  –  February 2013  (1 year 3 months) Hillsboro, Oregon Supply Chain Program Manager - Sales and Operations Planning Intel Corporation June 2006  –  December 2011  (5 years 7 months) Hillsboro, Oregon Supply & Demand Manager Intel Corporation June 2003  –  June 2006  (3 years 1 month) Hillsboro, Oregon Supply Chain Program/Project Manager Intel Corporation March 2001  –  June 2003  (2 years 4 months) Hillsboro, Oregon Supply Chain Business Analyst Intel Corporation December 1999  –  March 2001  (1 year 4 months) Hillsboro, Oregon Production Supervisor Intel Corporation June 1997  –  December 1999  (2 years 7 months) Hillsboro, Oregon Sr. Production Control Planner Intel Corporation August 1994  –  June 1996  (1 year 11 months) Las Piedras, Puerto Rico Warehouse and Inventory Control Intel Corporation July 1993  –  August 1994  (1 year 2 months) Las Piedras, Puerto Rico Production Planner Abbott February 1992  –  August 1993  (1 year 7 months) Barceloneta, Puerto Rico Inventory Planner Indulac Puerto Rico October 1991  –  February 1992  (5 months) Hato Rey, Puerto Rico Operations Supply Planning Manager Nike February 2013  –  August 2015  (2 years 7 months) Beaverton OR Operations Supply Planning Manager Nike February 2013  –  August 2015  (2 years 7 months) Beaverton OR Supply/Demand Operations - Factory Program Manager Intel Corporation December 2011  –  February 2013  (1 year 3 months) Hillsboro, Oregon Supply/Demand Operations - Factory Program Manager Intel Corporation December 2011  –  February 2013  (1 year 3 months) Hillsboro, Oregon Supply Chain Program Manager - Sales and Operations Planning Intel Corporation June 2006  –  December 2011  (5 years 7 months) Hillsboro, Oregon Supply Chain Program Manager - Sales and Operations Planning Intel Corporation June 2006  –  December 2011  (5 years 7 months) Hillsboro, Oregon Supply & Demand Manager Intel Corporation June 2003  –  June 2006  (3 years 1 month) Hillsboro, Oregon Supply & Demand Manager Intel Corporation June 2003  –  June 2006  (3 years 1 month) Hillsboro, Oregon Supply Chain Program/Project Manager Intel Corporation March 2001  –  June 2003  (2 years 4 months) Hillsboro, Oregon Supply Chain Program/Project Manager Intel Corporation March 2001  –  June 2003  (2 years 4 months) Hillsboro, Oregon Supply Chain Business Analyst Intel Corporation December 1999  –  March 2001  (1 year 4 months) Hillsboro, Oregon Supply Chain Business Analyst Intel Corporation December 1999  –  March 2001  (1 year 4 months) Hillsboro, Oregon Production Supervisor Intel Corporation June 1997  –  December 1999  (2 years 7 months) Hillsboro, Oregon Production Supervisor Intel Corporation June 1997  –  December 1999  (2 years 7 months) Hillsboro, Oregon Sr. Production Control Planner Intel Corporation August 1994  –  June 1996  (1 year 11 months) Las Piedras, Puerto Rico Sr. Production Control Planner Intel Corporation August 1994  –  June 1996  (1 year 11 months) Las Piedras, Puerto Rico Warehouse and Inventory Control Intel Corporation July 1993  –  August 1994  (1 year 2 months) Las Piedras, Puerto Rico Warehouse and Inventory Control Intel Corporation July 1993  –  August 1994  (1 year 2 months) Las Piedras, Puerto Rico Production Planner Abbott February 1992  –  August 1993  (1 year 7 months) Barceloneta, Puerto Rico Production Planner Abbott February 1992  –  August 1993  (1 year 7 months) Barceloneta, Puerto Rico Inventory Planner Indulac Puerto Rico October 1991  –  February 1992  (5 months) Hato Rey, Puerto Rico Inventory Planner Indulac Puerto Rico October 1991  –  February 1992  (5 months) Hato Rey, Puerto Rico Languages Spanish Native or bilingual proficiency English Full professional proficiency Spanish Native or bilingual proficiency English Full professional proficiency Spanish Native or bilingual proficiency English Full professional proficiency Native or bilingual proficiency Full professional proficiency Skills Forecasting Pricing Supply Management Supply Chain Management Cross-functional Team... Supply Chain Strategic Sourcing Production Planning Lean Manufacturing Six Sigma Manufacturing Program Management SPC Process Improvement Supply Chain... Data Analysis Procurement Inventory Management Product Management Process Engineering Continuous Improvement Business Process Project Management MRP Management Project Planning Materials Management Demand Planning Team Leadership Inventory Control SAP Global Sourcing Logistics Manufacturing Operations Operations Management See 20+     See less Skills  Forecasting Pricing Supply Management Supply Chain Management Cross-functional Team... Supply Chain Strategic Sourcing Production Planning Lean Manufacturing Six Sigma Manufacturing Program Management SPC Process Improvement Supply Chain... Data Analysis Procurement Inventory Management Product Management Process Engineering Continuous Improvement Business Process Project Management MRP Management Project Planning Materials Management Demand Planning Team Leadership Inventory Control SAP Global Sourcing Logistics Manufacturing Operations Operations Management See 20+     See less Forecasting Pricing Supply Management Supply Chain Management Cross-functional Team... Supply Chain Strategic Sourcing Production Planning Lean Manufacturing Six Sigma Manufacturing Program Management SPC Process Improvement Supply Chain... Data Analysis Procurement Inventory Management Product Management Process Engineering Continuous Improvement Business Process Project Management MRP Management Project Planning Materials Management Demand Planning Team Leadership Inventory Control SAP Global Sourcing Logistics Manufacturing Operations Operations Management See 20+     See less Forecasting Pricing Supply Management Supply Chain Management Cross-functional Team... Supply Chain Strategic Sourcing Production Planning Lean Manufacturing Six Sigma Manufacturing Program Management SPC Process Improvement Supply Chain... Data Analysis Procurement Inventory Management Product Management Process Engineering Continuous Improvement Business Process Project Management MRP Management Project Planning Materials Management Demand Planning Team Leadership Inventory Control SAP Global Sourcing Logistics Manufacturing Operations Operations Management See 20+     See less Education Universidad del Turabo MBA,  Materials Management and Control 1996  – 1998 University of Puerto Rico BS,  Materials Management (Supply Chain) 1986  – 1992 - Formed, established and lead two student associations. Coordinated professional conferences, dinner conferences, association logo and activities to keep students involved and help them extend their network. \n \n- Student Athlete during college years doing wrestling and Olympic weight lifting Activities and Societies:  - President of APICS Student Association\n- President of Materials Management Student Association\n- Student Athlete University of Puerto Rico AS,  Industrial Engineering 1986  – 1988 Activities and Societies:  - President of the Materials Management Student Association\n- Chaired the APICS Student Association Universidad del Turabo MBA,  Materials Management and Control 1996  – 1998 Universidad del Turabo MBA,  Materials Management and Control 1996  – 1998 Universidad del Turabo MBA,  Materials Management and Control 1996  – 1998 University of Puerto Rico BS,  Materials Management (Supply Chain) 1986  – 1992 - Formed, established and lead two student associations. Coordinated professional conferences, dinner conferences, association logo and activities to keep students involved and help them extend their network. \n \n- Student Athlete during college years doing wrestling and Olympic weight lifting Activities and Societies:  - President of APICS Student Association\n- President of Materials Management Student Association\n- Student Athlete University of Puerto Rico BS,  Materials Management (Supply Chain) 1986  – 1992 - Formed, established and lead two student associations. Coordinated professional conferences, dinner conferences, association logo and activities to keep students involved and help them extend their network. \n \n- Student Athlete during college years doing wrestling and Olympic weight lifting Activities and Societies:  - President of APICS Student Association\n- President of Materials Management Student Association\n- Student Athlete University of Puerto Rico BS,  Materials Management (Supply Chain) 1986  – 1992 - Formed, established and lead two student associations. Coordinated professional conferences, dinner conferences, association logo and activities to keep students involved and help them extend their network. \n \n- Student Athlete during college years doing wrestling and Olympic weight lifting Activities and Societies:  - President of APICS Student Association\n- President of Materials Management Student Association\n- Student Athlete University of Puerto Rico AS,  Industrial Engineering 1986  – 1988 Activities and Societies:  - President of the Materials Management Student Association\n- Chaired the APICS Student Association University of Puerto Rico AS,  Industrial Engineering 1986  – 1988 Activities and Societies:  - President of the Materials Management Student Association\n- Chaired the APICS Student Association University of Puerto Rico AS,  Industrial Engineering 1986  – 1988 Activities and Societies:  - President of the Materials Management Student Association\n- Chaired the APICS Student Association Honors & Awards ", "Languages English Native or bilingual proficiency German Limited working proficiency English Native or bilingual proficiency German Limited working proficiency English Native or bilingual proficiency German Limited working proficiency Native or bilingual proficiency Limited working proficiency Skills Procurement Supply Chain Management Six Sigma Supply Chain Electronics Logistics Integration Program Management Project Planning Troubleshooting Logistics Management Business Analysis Warehouse Management Material Handling... Industrial Engineering Logistics Design Distribution Logistics Supply Chain Engineering Project Management Distribution Center... Material Handling... See 6+     See less Skills  Procurement Supply Chain Management Six Sigma Supply Chain Electronics Logistics Integration Program Management Project Planning Troubleshooting Logistics Management Business Analysis Warehouse Management Material Handling... Industrial Engineering Logistics Design Distribution Logistics Supply Chain Engineering Project Management Distribution Center... Material Handling... See 6+     See less Procurement Supply Chain Management Six Sigma Supply Chain Electronics Logistics Integration Program Management Project Planning Troubleshooting Logistics Management Business Analysis Warehouse Management Material Handling... Industrial Engineering Logistics Design Distribution Logistics Supply Chain Engineering Project Management Distribution Center... Material Handling... See 6+     See less Procurement Supply Chain Management Six Sigma Supply Chain Electronics Logistics Integration Program Management Project Planning Troubleshooting Logistics Management Business Analysis Warehouse Management Material Handling... Industrial Engineering Logistics Design Distribution Logistics Supply Chain Engineering Project Management Distribution Center... Material Handling... See 6+     See less ", "Skills Facility Layout SPC Capacity Analysis Manufacturing... Industrial Engineering Program Management Manufacturing Process Improvement 5S Leadership Lean Manufacturing Integration Six Sigma Cross-functional Team... Project Planning Root Cause Analysis See 1+     See less Skills  Facility Layout SPC Capacity Analysis Manufacturing... Industrial Engineering Program Management Manufacturing Process Improvement 5S Leadership Lean Manufacturing Integration Six Sigma Cross-functional Team... Project Planning Root Cause Analysis See 1+     See less Facility Layout SPC Capacity Analysis Manufacturing... Industrial Engineering Program Management Manufacturing Process Improvement 5S Leadership Lean Manufacturing Integration Six Sigma Cross-functional Team... Project Planning Root Cause Analysis See 1+     See less Facility Layout SPC Capacity Analysis Manufacturing... Industrial Engineering Program Management Manufacturing Process Improvement 5S Leadership Lean Manufacturing Integration Six Sigma Cross-functional Team... Project Planning Root Cause Analysis See 1+     See less ", "Summary 20 years of increasing responsibilities in complex and challenging manufacturing environments, along with over 25 years of leadership experience in organizations of various sizes and objectives. Led organizations and cross-functional teams to improve safety, quality, productivity, efficiency, and employee relations. Provided leadership in FDA and ISO 13485:2003 registered medical device organizations. \n \nSpecialties: \n- Safety Program Leadership - Organizational Leadership  \n- Constraint Management - Recruiting, Staffing and Training \n- High Volume and Specialty Manufacturing - Technology Start-Up/Ramp \n- Building High Performing Teams - Lean Manufacturing \n- National and International Technology Transfer and Consolidation Leadership \n- Facility Closure Coordination and Leadership Summary 20 years of increasing responsibilities in complex and challenging manufacturing environments, along with over 25 years of leadership experience in organizations of various sizes and objectives. Led organizations and cross-functional teams to improve safety, quality, productivity, efficiency, and employee relations. Provided leadership in FDA and ISO 13485:2003 registered medical device organizations. \n \nSpecialties: \n- Safety Program Leadership - Organizational Leadership  \n- Constraint Management - Recruiting, Staffing and Training \n- High Volume and Specialty Manufacturing - Technology Start-Up/Ramp \n- Building High Performing Teams - Lean Manufacturing \n- National and International Technology Transfer and Consolidation Leadership \n- Facility Closure Coordination and Leadership 20 years of increasing responsibilities in complex and challenging manufacturing environments, along with over 25 years of leadership experience in organizations of various sizes and objectives. Led organizations and cross-functional teams to improve safety, quality, productivity, efficiency, and employee relations. Provided leadership in FDA and ISO 13485:2003 registered medical device organizations. \n \nSpecialties: \n- Safety Program Leadership - Organizational Leadership  \n- Constraint Management - Recruiting, Staffing and Training \n- High Volume and Specialty Manufacturing - Technology Start-Up/Ramp \n- Building High Performing Teams - Lean Manufacturing \n- National and International Technology Transfer and Consolidation Leadership \n- Facility Closure Coordination and Leadership 20 years of increasing responsibilities in complex and challenging manufacturing environments, along with over 25 years of leadership experience in organizations of various sizes and objectives. Led organizations and cross-functional teams to improve safety, quality, productivity, efficiency, and employee relations. Provided leadership in FDA and ISO 13485:2003 registered medical device organizations. \n \nSpecialties: \n- Safety Program Leadership - Organizational Leadership  \n- Constraint Management - Recruiting, Staffing and Training \n- High Volume and Specialty Manufacturing - Technology Start-Up/Ramp \n- Building High Performing Teams - Lean Manufacturing \n- National and International Technology Transfer and Consolidation Leadership \n- Facility Closure Coordination and Leadership Experience Director, Ultrasound Manufacturing Analogic August 2014  – Present (1 year 1 month) Peabody, MA Responsible for the manufacturing of Ultrasound systems for two Analogic product lines, BK Medical and Ultrasonix. FDA and ISO 13485:2003 registered. Director, Ultrasound Operations/Operations Manager Sound Technology Inc. (STI - Ultrasound) November 2010  –  August 2014  (3 years 10 months) Denver, Colorado Ultrasound Probe Manufacturing for both OEM and Direct Ultrasound businesses. Provided leadership to the Denver site Safety, Manufacturing, HR, Planning, Purchasing, Shipping/Receiving, Maintenance, and Facilities functions. Partnered with R&D and Sustaining Engineering to develop new probes and improve the yield on current products. FDA and ISO 13485.2003 registered. \n \nResponsible for the consolidation of Denver operations to the main STI facility in State College, Pennsylvania and the closure of the Denver site. \n \nResponsible for the transfer and consolidation of operations for the recently acquired Ultrasonix Corporation in Vancouver, B.C., Canada to Shanghai, China and Peabody, Massachusetts. This includes the in-sourcing of all electrical probes to State College, Pennsylvania. Plant/Operations Leader W.L. Gore & Associates February 2009  –  November 2010  (1 year 10 months) Manufacturing and Safety Leader W.L. Gore & Associates July 2007  –  February 2009  (1 year 8 months) Lean Manufacturing Program Manager Intel Corporation May 2006  –  June 2007  (1 year 2 months) 300mm C4 Area Manufacturing Manager Intel Corporation January 2006  –  May 2006  (5 months) Shift Manager Intel Corporation January 2000  –  January 2006  (6 years 1 month) Integration Core Team Member Intel Corporation May 1998  –  December 1999  (1 year 8 months) Member of the Fab 17 Integration Core Team that helped transition the organization after Intel Corporation's aquisition of Digitial Equipment Corporation's semiconductor factory. Photolithography Production Supervisor Intel Corporation April 1997  –  April 1998  (1 year 1 month) Manufacturing Technician Intel Corporation September 1995  –  April 1997  (1 year 8 months) Communication/Electronic Maintainer Section Leader US Army February 1990  –  October 1995  (5 years 9 months) Communication/Electronic Equipment Maintainer US Army January 1985  –  December 1987  (3 years) Director, Ultrasound Manufacturing Analogic August 2014  – Present (1 year 1 month) Peabody, MA Responsible for the manufacturing of Ultrasound systems for two Analogic product lines, BK Medical and Ultrasonix. FDA and ISO 13485:2003 registered. Director, Ultrasound Manufacturing Analogic August 2014  – Present (1 year 1 month) Peabody, MA Responsible for the manufacturing of Ultrasound systems for two Analogic product lines, BK Medical and Ultrasonix. FDA and ISO 13485:2003 registered. Director, Ultrasound Operations/Operations Manager Sound Technology Inc. (STI - Ultrasound) November 2010  –  August 2014  (3 years 10 months) Denver, Colorado Ultrasound Probe Manufacturing for both OEM and Direct Ultrasound businesses. Provided leadership to the Denver site Safety, Manufacturing, HR, Planning, Purchasing, Shipping/Receiving, Maintenance, and Facilities functions. Partnered with R&D and Sustaining Engineering to develop new probes and improve the yield on current products. FDA and ISO 13485.2003 registered. \n \nResponsible for the consolidation of Denver operations to the main STI facility in State College, Pennsylvania and the closure of the Denver site. \n \nResponsible for the transfer and consolidation of operations for the recently acquired Ultrasonix Corporation in Vancouver, B.C., Canada to Shanghai, China and Peabody, Massachusetts. This includes the in-sourcing of all electrical probes to State College, Pennsylvania. Director, Ultrasound Operations/Operations Manager Sound Technology Inc. (STI - Ultrasound) November 2010  –  August 2014  (3 years 10 months) Denver, Colorado Ultrasound Probe Manufacturing for both OEM and Direct Ultrasound businesses. Provided leadership to the Denver site Safety, Manufacturing, HR, Planning, Purchasing, Shipping/Receiving, Maintenance, and Facilities functions. Partnered with R&D and Sustaining Engineering to develop new probes and improve the yield on current products. FDA and ISO 13485.2003 registered. \n \nResponsible for the consolidation of Denver operations to the main STI facility in State College, Pennsylvania and the closure of the Denver site. \n \nResponsible for the transfer and consolidation of operations for the recently acquired Ultrasonix Corporation in Vancouver, B.C., Canada to Shanghai, China and Peabody, Massachusetts. This includes the in-sourcing of all electrical probes to State College, Pennsylvania. Plant/Operations Leader W.L. Gore & Associates February 2009  –  November 2010  (1 year 10 months) Plant/Operations Leader W.L. Gore & Associates February 2009  –  November 2010  (1 year 10 months) Manufacturing and Safety Leader W.L. Gore & Associates July 2007  –  February 2009  (1 year 8 months) Manufacturing and Safety Leader W.L. Gore & Associates July 2007  –  February 2009  (1 year 8 months) Lean Manufacturing Program Manager Intel Corporation May 2006  –  June 2007  (1 year 2 months) Lean Manufacturing Program Manager Intel Corporation May 2006  –  June 2007  (1 year 2 months) 300mm C4 Area Manufacturing Manager Intel Corporation January 2006  –  May 2006  (5 months) 300mm C4 Area Manufacturing Manager Intel Corporation January 2006  –  May 2006  (5 months) Shift Manager Intel Corporation January 2000  –  January 2006  (6 years 1 month) Shift Manager Intel Corporation January 2000  –  January 2006  (6 years 1 month) Integration Core Team Member Intel Corporation May 1998  –  December 1999  (1 year 8 months) Member of the Fab 17 Integration Core Team that helped transition the organization after Intel Corporation's aquisition of Digitial Equipment Corporation's semiconductor factory. Integration Core Team Member Intel Corporation May 1998  –  December 1999  (1 year 8 months) Member of the Fab 17 Integration Core Team that helped transition the organization after Intel Corporation's aquisition of Digitial Equipment Corporation's semiconductor factory. Photolithography Production Supervisor Intel Corporation April 1997  –  April 1998  (1 year 1 month) Photolithography Production Supervisor Intel Corporation April 1997  –  April 1998  (1 year 1 month) Manufacturing Technician Intel Corporation September 1995  –  April 1997  (1 year 8 months) Manufacturing Technician Intel Corporation September 1995  –  April 1997  (1 year 8 months) Communication/Electronic Maintainer Section Leader US Army February 1990  –  October 1995  (5 years 9 months) Communication/Electronic Maintainer Section Leader US Army February 1990  –  October 1995  (5 years 9 months) Communication/Electronic Equipment Maintainer US Army January 1985  –  December 1987  (3 years) Communication/Electronic Equipment Maintainer US Army January 1985  –  December 1987  (3 years) Skills Cross-functional Team... Manufacturing Lean Manufacturing Design of Experiments Leadership Employee Relations Six Sigma Training Root Cause Analysis Integration Management Leadership Development Manufacturing Operations Engineering Management Process Engineering Continuous Improvement SPC Semiconductors Recruiting Failure Analysis Operations Management Engineering Project Management Semiconductor Industry Program Management Process Improvement Quality System Manufacturing... 5S Kaizen Value Stream Mapping See 16+     See less Skills  Cross-functional Team... Manufacturing Lean Manufacturing Design of Experiments Leadership Employee Relations Six Sigma Training Root Cause Analysis Integration Management Leadership Development Manufacturing Operations Engineering Management Process Engineering Continuous Improvement SPC Semiconductors Recruiting Failure Analysis Operations Management Engineering Project Management Semiconductor Industry Program Management Process Improvement Quality System Manufacturing... 5S Kaizen Value Stream Mapping See 16+     See less Cross-functional Team... Manufacturing Lean Manufacturing Design of Experiments Leadership Employee Relations Six Sigma Training Root Cause Analysis Integration Management Leadership Development Manufacturing Operations Engineering Management Process Engineering Continuous Improvement SPC Semiconductors Recruiting Failure Analysis Operations Management Engineering Project Management Semiconductor Industry Program Management Process Improvement Quality System Manufacturing... 5S Kaizen Value Stream Mapping See 16+     See less Cross-functional Team... Manufacturing Lean Manufacturing Design of Experiments Leadership Employee Relations Six Sigma Training Root Cause Analysis Integration Management Leadership Development Manufacturing Operations Engineering Management Process Engineering Continuous Improvement SPC Semiconductors Recruiting Failure Analysis Operations Management Engineering Project Management Semiconductor Industry Program Management Process Improvement Quality System Manufacturing... 5S Kaizen Value Stream Mapping See 16+     See less Education Gulf Coast Community College A.A,  General Studies 1988  – 1989 Gulf Coast Community College A.A,  General Studies 1988  – 1989 Gulf Coast Community College A.A,  General Studies 1988  – 1989 Gulf Coast Community College A.A,  General Studies 1988  – 1989 ", "Summary Professional on Industrial Maintenance with a Mastery on Project Management with 16 years of experience in Technology Company with best in class environment. \nCustomer service oriented with a strong sense of business services & people skills qualifications coupled with experience on manufacturing and construction process. Able to lead with complex systems and identify opportunities for improvements and resolution of critical issues. Summary Professional on Industrial Maintenance with a Mastery on Project Management with 16 years of experience in Technology Company with best in class environment. \nCustomer service oriented with a strong sense of business services & people skills qualifications coupled with experience on manufacturing and construction process. Able to lead with complex systems and identify opportunities for improvements and resolution of critical issues. Professional on Industrial Maintenance with a Mastery on Project Management with 16 years of experience in Technology Company with best in class environment. \nCustomer service oriented with a strong sense of business services & people skills qualifications coupled with experience on manufacturing and construction process. Able to lead with complex systems and identify opportunities for improvements and resolution of critical issues. Professional on Industrial Maintenance with a Mastery on Project Management with 16 years of experience in Technology Company with best in class environment. \nCustomer service oriented with a strong sense of business services & people skills qualifications coupled with experience on manufacturing and construction process. Able to lead with complex systems and identify opportunities for improvements and resolution of critical issues. Experience Senior Project Manager Intel Corporation June 2013  –  May 2014  (1 year) Costa Rica •Managed the project TW3 (The Way We Work) concept that was evolving a new concept at Intel in how to collaborate more efficiency in the office environment. Project with 150.000man/hrs. in 5000 m². Program Manager in Operations. Intel Corporation June 2008  –  June 2013  (5 years 1 month) Costa Rica •Managed Employee Service Programs as Cafeterias, Transportation, and Banking management contractor, Maintenance in whole Buildings and continuous improvement in operations. \n•Planning, design, construction and commissioning on Maintenance projects in all disciplines. \n•Senior on Contract management with external suppliers and outsourcing models. \n•Lead multifunctional teams through our virtual factory to maintain operational excellence indicators. \n•Working on green initiatives and energy conservation in all operating services and projects. Regional Project Manager Intel Corporation June 2003  –  June 2008  (5 years 1 month) Argentina and Costa Rica •ARGENTINA Software Development Center: Managing programming, design, construction and commissioning of the operations. Develop the maintenance plan to start up the center for 550 new jobs in Córdoba, Argentina. 250000man/hrs IIF- project with 2500 m²). \n•Projects implemented in Costa Rica under Engineering Maintenance: \nExperience on Fiber Optic Installation, System Oil Free Air (OFA ); Installation of vacuum pumps systems, Potable water tanks system, Fire protection systems, Life safety systems; pumps , and installation of water Osmosis system. Test area Group Lead Intel Corporation February 2001  –  October 2003  (2 years 9 months) Costa Rica •Manages the technical staff during four shifts (5 Engineers and 110 technicians.) \n•Experienced on TPM program implementation through the whole module. \n•Ensure the MTBF, MTTR, availability, Cold Bagging process and Shutdowns coordination for all equipment in TEST area.  \n•Manages and create a task force group on all critical spares parts and inventory. Great Savings were reported during the works Technical and Production Supervisor Intel Corporation October 1998  –  January 2001  (2 years 4 months) Costa Rica •Manages and coordination for technical people on production floor. ( 35 technicians ) \n•Maintenance programmer and spare system Administrator.  \n•Manages cost reduction program in spares parts under and without warranty.  \n•Tool shop/Precision Tool shop implementation and administrator.  \n•Manufacturing rep in ISO 9000. Internal auditor ISO 9001-2000 \n•Emergency Response Team Leader in the shift. Facilities Maintenance Supervisor Portico January 1997  –  September 1998  (1 year 9 months) Costa Rica •Maintenance tasks coordination in all production tools and facilities with 15 people under supervision. \n•Manages all Programs for Predictive and Preventive maintenance.  \n•Manages spares inventory for critical equipment’s in production and tools kits development. Senior Project Manager Intel Corporation June 2013  –  May 2014  (1 year) Costa Rica •Managed the project TW3 (The Way We Work) concept that was evolving a new concept at Intel in how to collaborate more efficiency in the office environment. Project with 150.000man/hrs. in 5000 m². Senior Project Manager Intel Corporation June 2013  –  May 2014  (1 year) Costa Rica •Managed the project TW3 (The Way We Work) concept that was evolving a new concept at Intel in how to collaborate more efficiency in the office environment. Project with 150.000man/hrs. in 5000 m². Program Manager in Operations. Intel Corporation June 2008  –  June 2013  (5 years 1 month) Costa Rica •Managed Employee Service Programs as Cafeterias, Transportation, and Banking management contractor, Maintenance in whole Buildings and continuous improvement in operations. \n•Planning, design, construction and commissioning on Maintenance projects in all disciplines. \n•Senior on Contract management with external suppliers and outsourcing models. \n•Lead multifunctional teams through our virtual factory to maintain operational excellence indicators. \n•Working on green initiatives and energy conservation in all operating services and projects. Program Manager in Operations. Intel Corporation June 2008  –  June 2013  (5 years 1 month) Costa Rica •Managed Employee Service Programs as Cafeterias, Transportation, and Banking management contractor, Maintenance in whole Buildings and continuous improvement in operations. \n•Planning, design, construction and commissioning on Maintenance projects in all disciplines. \n•Senior on Contract management with external suppliers and outsourcing models. \n•Lead multifunctional teams through our virtual factory to maintain operational excellence indicators. \n•Working on green initiatives and energy conservation in all operating services and projects. Regional Project Manager Intel Corporation June 2003  –  June 2008  (5 years 1 month) Argentina and Costa Rica •ARGENTINA Software Development Center: Managing programming, design, construction and commissioning of the operations. Develop the maintenance plan to start up the center for 550 new jobs in Córdoba, Argentina. 250000man/hrs IIF- project with 2500 m²). \n•Projects implemented in Costa Rica under Engineering Maintenance: \nExperience on Fiber Optic Installation, System Oil Free Air (OFA ); Installation of vacuum pumps systems, Potable water tanks system, Fire protection systems, Life safety systems; pumps , and installation of water Osmosis system. Regional Project Manager Intel Corporation June 2003  –  June 2008  (5 years 1 month) Argentina and Costa Rica •ARGENTINA Software Development Center: Managing programming, design, construction and commissioning of the operations. Develop the maintenance plan to start up the center for 550 new jobs in Córdoba, Argentina. 250000man/hrs IIF- project with 2500 m²). \n•Projects implemented in Costa Rica under Engineering Maintenance: \nExperience on Fiber Optic Installation, System Oil Free Air (OFA ); Installation of vacuum pumps systems, Potable water tanks system, Fire protection systems, Life safety systems; pumps , and installation of water Osmosis system. Test area Group Lead Intel Corporation February 2001  –  October 2003  (2 years 9 months) Costa Rica •Manages the technical staff during four shifts (5 Engineers and 110 technicians.) \n•Experienced on TPM program implementation through the whole module. \n•Ensure the MTBF, MTTR, availability, Cold Bagging process and Shutdowns coordination for all equipment in TEST area.  \n•Manages and create a task force group on all critical spares parts and inventory. Great Savings were reported during the works Test area Group Lead Intel Corporation February 2001  –  October 2003  (2 years 9 months) Costa Rica •Manages the technical staff during four shifts (5 Engineers and 110 technicians.) \n•Experienced on TPM program implementation through the whole module. \n•Ensure the MTBF, MTTR, availability, Cold Bagging process and Shutdowns coordination for all equipment in TEST area.  \n•Manages and create a task force group on all critical spares parts and inventory. Great Savings were reported during the works Technical and Production Supervisor Intel Corporation October 1998  –  January 2001  (2 years 4 months) Costa Rica •Manages and coordination for technical people on production floor. ( 35 technicians ) \n•Maintenance programmer and spare system Administrator.  \n•Manages cost reduction program in spares parts under and without warranty.  \n•Tool shop/Precision Tool shop implementation and administrator.  \n•Manufacturing rep in ISO 9000. Internal auditor ISO 9001-2000 \n•Emergency Response Team Leader in the shift. Technical and Production Supervisor Intel Corporation October 1998  –  January 2001  (2 years 4 months) Costa Rica •Manages and coordination for technical people on production floor. ( 35 technicians ) \n•Maintenance programmer and spare system Administrator.  \n•Manages cost reduction program in spares parts under and without warranty.  \n•Tool shop/Precision Tool shop implementation and administrator.  \n•Manufacturing rep in ISO 9000. Internal auditor ISO 9001-2000 \n•Emergency Response Team Leader in the shift. Facilities Maintenance Supervisor Portico January 1997  –  September 1998  (1 year 9 months) Costa Rica •Maintenance tasks coordination in all production tools and facilities with 15 people under supervision. \n•Manages all Programs for Predictive and Preventive maintenance.  \n•Manages spares inventory for critical equipment’s in production and tools kits development. Facilities Maintenance Supervisor Portico January 1997  –  September 1998  (1 year 9 months) Costa Rica •Maintenance tasks coordination in all production tools and facilities with 15 people under supervision. \n•Manages all Programs for Predictive and Preventive maintenance.  \n•Manages spares inventory for critical equipment’s in production and tools kits development. Languages Spanish Native or bilingual proficiency English Full professional proficiency Spanish Native or bilingual proficiency English Full professional proficiency Spanish Native or bilingual proficiency English Full professional proficiency Native or bilingual proficiency Full professional proficiency Skills Program Management Project Management Process Improvement PMP Cross-functional Team... Team Leadership Process Engineering Project Portfolio... Six Sigma Change Management Business Process... Software Project... Manufacturing Management Continuous Improvement Engineering ITIL IT Management Lean Manufacturing IT Service Management Project Planning Leadership Plant Maintenance Building Management Predictive Maintenance See 10+     See less Skills  Program Management Project Management Process Improvement PMP Cross-functional Team... Team Leadership Process Engineering Project Portfolio... Six Sigma Change Management Business Process... Software Project... Manufacturing Management Continuous Improvement Engineering ITIL IT Management Lean Manufacturing IT Service Management Project Planning Leadership Plant Maintenance Building Management Predictive Maintenance See 10+     See less Program Management Project Management Process Improvement PMP Cross-functional Team... Team Leadership Process Engineering Project Portfolio... Six Sigma Change Management Business Process... Software Project... Manufacturing Management Continuous Improvement Engineering ITIL IT Management Lean Manufacturing IT Service Management Project Planning Leadership Plant Maintenance Building Management Predictive Maintenance See 10+     See less Program Management Project Management Process Improvement PMP Cross-functional Team... Team Leadership Process Engineering Project Portfolio... Six Sigma Change Management Business Process... Software Project... Manufacturing Management Continuous Improvement Engineering ITIL IT Management Lean Manufacturing IT Service Management Project Planning Leadership Plant Maintenance Building Management Predictive Maintenance See 10+     See less Education Education 1997  – 2014 Project Manager Development Program. Arizona State University. (8 months). 2012  \nMPA; Master in Project Management. U. Interamericana. 2011  \nAdvance English Programs at ESL. U. Interamericana/Idioma Int; 2006  \nProject Management Program. (144hrs) Instituto Tecnológico de Costa Rica; 2005  \nManaging Projects to Success. Center of Project Management KAPUR; 2004  \nOSHA 510 Safety&Health for Construction US department and Labor, 2004  \nLic. Industrial Maintenance Engineer. Instituto Tecnológico de Costa Rica ; 2003 \nBach. Industrial Maintenance Engineer. Instituto Tecnológico de Costa Rica ; 1997 Education 1997  – 2014 Project Manager Development Program. Arizona State University. (8 months). 2012  \nMPA; Master in Project Management. U. Interamericana. 2011  \nAdvance English Programs at ESL. U. Interamericana/Idioma Int; 2006  \nProject Management Program. (144hrs) Instituto Tecnológico de Costa Rica; 2005  \nManaging Projects to Success. Center of Project Management KAPUR; 2004  \nOSHA 510 Safety&Health for Construction US department and Labor, 2004  \nLic. Industrial Maintenance Engineer. Instituto Tecnológico de Costa Rica ; 2003 \nBach. Industrial Maintenance Engineer. Instituto Tecnológico de Costa Rica ; 1997 Education 1997  – 2014 Project Manager Development Program. Arizona State University. (8 months). 2012  \nMPA; Master in Project Management. U. Interamericana. 2011  \nAdvance English Programs at ESL. U. Interamericana/Idioma Int; 2006  \nProject Management Program. (144hrs) Instituto Tecnológico de Costa Rica; 2005  \nManaging Projects to Success. Center of Project Management KAPUR; 2004  \nOSHA 510 Safety&Health for Construction US department and Labor, 2004  \nLic. Industrial Maintenance Engineer. Instituto Tecnológico de Costa Rica ; 2003 \nBach. Industrial Maintenance Engineer. Instituto Tecnológico de Costa Rica ; 1997 Education 1997  – 2014 Project Manager Development Program. Arizona State University. (8 months). 2012  \nMPA; Master in Project Management. U. Interamericana. 2011  \nAdvance English Programs at ESL. U. Interamericana/Idioma Int; 2006  \nProject Management Program. (144hrs) Instituto Tecnológico de Costa Rica; 2005  \nManaging Projects to Success. Center of Project Management KAPUR; 2004  \nOSHA 510 Safety&Health for Construction US department and Labor, 2004  \nLic. Industrial Maintenance Engineer. Instituto Tecnológico de Costa Rica ; 2003 \nBach. Industrial Maintenance Engineer. Instituto Tecnológico de Costa Rica ; 1997 Honors & Awards Corporate Services Excellence Award 2012 Corporate Services Director June 2012 For the improvements on Cafeteria Services Satisfaction Survey thru ATM. SSG Group Operations Division Recognition Award Software & Solutions Group November 2004 For flawless execution in the design, construction and opening of Argentina Software Development Center´s new Garden Center location in Cordoba, Argentina. Corporate Services Excellence Award 2012 Corporate Services Director June 2012 For the improvements on Cafeteria Services Satisfaction Survey thru ATM. Corporate Services Excellence Award 2012 Corporate Services Director June 2012 For the improvements on Cafeteria Services Satisfaction Survey thru ATM. Corporate Services Excellence Award 2012 Corporate Services Director June 2012 For the improvements on Cafeteria Services Satisfaction Survey thru ATM. SSG Group Operations Division Recognition Award Software & Solutions Group November 2004 For flawless execution in the design, construction and opening of Argentina Software Development Center´s new Garden Center location in Cordoba, Argentina. SSG Group Operations Division Recognition Award Software & Solutions Group November 2004 For flawless execution in the design, construction and opening of Argentina Software Development Center´s new Garden Center location in Cordoba, Argentina. SSG Group Operations Division Recognition Award Software & Solutions Group November 2004 For flawless execution in the design, construction and opening of Argentina Software Development Center´s new Garden Center location in Cordoba, Argentina. ", "Summary Ken Miller, author of \"We don't make Widgets\" compares government processes as a set of pipes that are kinkedup, contorted and a twisted mess. If that is the case, I am a plumber who can help eliminate blockages, straighten the pipes and increase the flow. I primarily use my knowledge of Lean and Six Sigma to facilitate workgroups to find solutions to their process problems, sometimes creating an entire new process. I use technology in it's simplest forms as tools and look at the space \"between the work\" to find ways to decrease throughput time and find gains in capacity. \n \nI've worked in both private industry and government. In 2009 transferred my knowledge of Lean to Government, as I have worked with the State of Oregon in the Water Rights Division, the Department of Administrative Services to assist in the creation of the Office of Transformation (assuming the role of Black Belt in leading Lean Six Sigma projects). I have also worked with the Department of Revenue, Dept. of Consumer and Business Services and the Oregon State Hospital. I have recently joined the Department of Fish and Wildlife as their Lean Coordinator in the Directors Office where I work on administrative processes and assist other state agencies through an Inter-Governmental Agreement. \n \nI belong to the Mt. Hood Ski Patrol utilizing customer service and rescue skills on a weekly basis. Awarded Associate Patroller of the Year and Coach of the Year for 2009 and Associate Supervisor of the year for 2013. For the past 18 years I have donated time to the Boy Scouts of America as a volunteer leader and received the Silver Beaver Award in 2009. This is the highest National award presented to volunteers in the Council. Also named Scouter of the Year for 2009 in the Columbia Gorge District. \n \nSpecialties: Lean Processes , Creation of High Performance teams, Six Sigma Certified. Expertise in Planning, Supply Chain Operations, Budget Development, New Product Introductions and Change Management. Summary Ken Miller, author of \"We don't make Widgets\" compares government processes as a set of pipes that are kinkedup, contorted and a twisted mess. If that is the case, I am a plumber who can help eliminate blockages, straighten the pipes and increase the flow. I primarily use my knowledge of Lean and Six Sigma to facilitate workgroups to find solutions to their process problems, sometimes creating an entire new process. I use technology in it's simplest forms as tools and look at the space \"between the work\" to find ways to decrease throughput time and find gains in capacity. \n \nI've worked in both private industry and government. In 2009 transferred my knowledge of Lean to Government, as I have worked with the State of Oregon in the Water Rights Division, the Department of Administrative Services to assist in the creation of the Office of Transformation (assuming the role of Black Belt in leading Lean Six Sigma projects). I have also worked with the Department of Revenue, Dept. of Consumer and Business Services and the Oregon State Hospital. I have recently joined the Department of Fish and Wildlife as their Lean Coordinator in the Directors Office where I work on administrative processes and assist other state agencies through an Inter-Governmental Agreement. \n \nI belong to the Mt. Hood Ski Patrol utilizing customer service and rescue skills on a weekly basis. Awarded Associate Patroller of the Year and Coach of the Year for 2009 and Associate Supervisor of the year for 2013. For the past 18 years I have donated time to the Boy Scouts of America as a volunteer leader and received the Silver Beaver Award in 2009. This is the highest National award presented to volunteers in the Council. Also named Scouter of the Year for 2009 in the Columbia Gorge District. \n \nSpecialties: Lean Processes , Creation of High Performance teams, Six Sigma Certified. Expertise in Planning, Supply Chain Operations, Budget Development, New Product Introductions and Change Management. Ken Miller, author of \"We don't make Widgets\" compares government processes as a set of pipes that are kinkedup, contorted and a twisted mess. If that is the case, I am a plumber who can help eliminate blockages, straighten the pipes and increase the flow. I primarily use my knowledge of Lean and Six Sigma to facilitate workgroups to find solutions to their process problems, sometimes creating an entire new process. I use technology in it's simplest forms as tools and look at the space \"between the work\" to find ways to decrease throughput time and find gains in capacity. \n \nI've worked in both private industry and government. In 2009 transferred my knowledge of Lean to Government, as I have worked with the State of Oregon in the Water Rights Division, the Department of Administrative Services to assist in the creation of the Office of Transformation (assuming the role of Black Belt in leading Lean Six Sigma projects). I have also worked with the Department of Revenue, Dept. of Consumer and Business Services and the Oregon State Hospital. I have recently joined the Department of Fish and Wildlife as their Lean Coordinator in the Directors Office where I work on administrative processes and assist other state agencies through an Inter-Governmental Agreement. \n \nI belong to the Mt. Hood Ski Patrol utilizing customer service and rescue skills on a weekly basis. Awarded Associate Patroller of the Year and Coach of the Year for 2009 and Associate Supervisor of the year for 2013. For the past 18 years I have donated time to the Boy Scouts of America as a volunteer leader and received the Silver Beaver Award in 2009. This is the highest National award presented to volunteers in the Council. Also named Scouter of the Year for 2009 in the Columbia Gorge District. \n \nSpecialties: Lean Processes , Creation of High Performance teams, Six Sigma Certified. Expertise in Planning, Supply Chain Operations, Budget Development, New Product Introductions and Change Management. Ken Miller, author of \"We don't make Widgets\" compares government processes as a set of pipes that are kinkedup, contorted and a twisted mess. If that is the case, I am a plumber who can help eliminate blockages, straighten the pipes and increase the flow. I primarily use my knowledge of Lean and Six Sigma to facilitate workgroups to find solutions to their process problems, sometimes creating an entire new process. I use technology in it's simplest forms as tools and look at the space \"between the work\" to find ways to decrease throughput time and find gains in capacity. \n \nI've worked in both private industry and government. In 2009 transferred my knowledge of Lean to Government, as I have worked with the State of Oregon in the Water Rights Division, the Department of Administrative Services to assist in the creation of the Office of Transformation (assuming the role of Black Belt in leading Lean Six Sigma projects). I have also worked with the Department of Revenue, Dept. of Consumer and Business Services and the Oregon State Hospital. I have recently joined the Department of Fish and Wildlife as their Lean Coordinator in the Directors Office where I work on administrative processes and assist other state agencies through an Inter-Governmental Agreement. \n \nI belong to the Mt. Hood Ski Patrol utilizing customer service and rescue skills on a weekly basis. Awarded Associate Patroller of the Year and Coach of the Year for 2009 and Associate Supervisor of the year for 2013. For the past 18 years I have donated time to the Boy Scouts of America as a volunteer leader and received the Silver Beaver Award in 2009. This is the highest National award presented to volunteers in the Council. Also named Scouter of the Year for 2009 in the Columbia Gorge District. \n \nSpecialties: Lean Processes , Creation of High Performance teams, Six Sigma Certified. Expertise in Planning, Supply Chain Operations, Budget Development, New Product Introductions and Change Management. Experience Lean Coordinator Oregon Department of Fish and Wildlife March 2012  – Present (3 years 6 months) Salem Oregon Responsible for planning and executing Lean Kaizan events, staff training, and special projects for the Deputy Director of Administration. I also work for the Department of Agriculture and Department of Forestry through an Inter-Agency Agreement to lead them through process improvement activities that affect local governments and the public at large. Associate Supervisor, OEC Instructor Mt. Hood Ski Patrol-National Ski Patrol May 2007  – Present (8 years 4 months) Portland Oregon I am a member of the Mt. Hood Ski Patrol which is the oldest ski patrol in the nation. I currently serve as an Associate Supervisor and an instructor for the Outdoor Emergency Care Technician certification, which is almost identical to an EMT-B.I supervise the first aid room during the season and work at Timberline Lodge and Ski Bowl every other weekend during the ski season. This is a volunteer position. In 2013 I was named the Associate Supervisor of the Year. Boy Scouts of America Volunteer Boy Scouts of America 1996  – Present (19 years) Vancouver Washington I am the Committee Chair for Troop 270 and Crew 270. I was a member of the Columbia Gorge District Committee for over 10 years. Most recently as the Chair of Goodturn for America. \nI have served on the National Jamboree Staff in 1973, 2005 and 2013. Process Improvement Facilitator/Lean Leader Oregon State Hospital, State of Oregon September 2011  –  February 2012  (6 months) Salem, Oregon Member of the Performance Improvement Office in the Quality Improvement Department at the Oregon State Hospital. Facilitator for Process Improvement Teams, Rapid Process Improvements and Trainer in Lean Methodology. Sr. Transformation Analyst/LSS Black Belt, Operations and Policy Analyst 4 State of Oregon - Department of Administrative Services February 2010  –  August 2011  (1 year 7 months) Sr. Analyst and Lean Leader for the Office of Transformation which is introducing Lean Six Sigma Methodology to improve Customer Service and reduce costs associated with various state agencies. Current responsibilities include development of Master Services Agreements with consulting firms, development of training materials, and leading teams in Kaizan activities to eliminate waste in the Value Stream for various processes. Operations and Systems Analyst 2 State of Oregon November 2009  –  January 2010  (3 months) Consultant with the Water Resources Department to develop Process Improvements in the areas of Water Rights including Transfers, Certifications and Application to Initial Review.  \nResponsibilities included:  \n-Meeting with teams to create Value Stream Maps for current processes. \n-Identifying opportunities for Quality Improvement activities. \n-Review of current processes to develop Standard Work. \n-Instruction of Six Sigma (DMAIC) techniques. \n-Reducing the length of applications with better quality of information that reduces the lead time to review. Lean Leader/Team Advisor GE Security June 2003  –  March 2009  (5 years 10 months) Lean Department Leader- Responsible for selection and planning of over 100 Lean Action Workouts in three years to reduce waste in all manufacturing areas. In 2007 and 2008 reduced WIP by $1.2M and annualized savings of $900k in labor. \nAchieved recognition for \"Lean Pacesetter of the Year\" for all of GE Security for 2007. \nInvolved in 10 major events in Tualatin facility with Shingijutsu LTD. Worked with Sensei Nakao and 6 other Senior Consultants. Assisted in training Lean Leaders from other GE sites in 2008. \n \nSMT and Assembly/Warehouse/Shipping/Receiving Team Advisor (Manager) \nManaged SMT area for 4 years which was composed of 8 high speed lines of Phillips and Juki equipment. Also rotated through other responsibilities, sometimes simultaneously, as Manager of Receiving/Warehouse,Shipping, Electro-Mechanical Assembly and Test. Successfully completed the startup of several new production lines. Led assembly teams to \"Team of the Year\" in 2004 and 2005 based on meeting measurable goals in efficiency, quality, on time delivery and safety. \n \nIPC 610D Certified Inspector Trainer. \n \nGE closed the Tualatin Facility in 2009 Manufacturing Supervisor MEC Northwest August 2002  –  May 2003  (10 months) Manufacturing Supervisor for small contract manufacturer. Responsible for all manufacturing. Improved efficiency by over 30% and reduced defects by 50% within three months. \nLeft company when they had downturn in business. Sr. Manufacturing Supervisor Solectron/NEC America September 1997  –  March 2002  (4 years 7 months) NEC was a manufacturer of high end telecommunications equipment for ATT, Sprint, MCI and others, located in Hillsboro Oregon. \nResponsible for all SMT operations on a 24/7 operation. 10 high speed Fuji lines with 100 production operators and an engineering staff of 5 technicians and 3 engineers. \nNEC Continuous Improvement Team of the Year for 1999. \nReduced cost per placement for SMT by 50%, reduced DPM to<100, reduced changeover time by 50%. \nSolectron closed the company in Hillsboro. Operations Manager Scientific Air Systems September 1996  –  June 1997  (10 months) Operations manager for small company that built air showers and pass-throughs for the cleanroom industry. \nIncreased Revenue Margin from 33% to 39% by reducing materials costs. \nIncreased On-Time delivery from 70% to 99% by implementing work cells to identify and solve quality problems. \nCompany went out of business with downturn in industry. Swing Shift Manager In Focus Systems June 1996  –  September 1996  (4 months) Swing Shift Manager for company building projection systems. The company was the fastest growing Hi-Tech company in Oregon.  \nI managed 45 warehouse and assembly personnel, 36 of which were temporaries that were hired on my first day. We quickly built a high performance team and met all quality and productivity requirements, including building over $1M in product in one shift. During July of 1996 the company stock crashed due to rumors of new competition in the market place, and the swing shift was eliminated in Sept.. Sr. Production Supervisor Sharp Microelectronics Technologies June 1991  –  June 1996  (5 years 1 month) Member of the 5 person startup team for the first Sharp Liquid Crystal Display manufacturing facility in the USA located in Camas Washington. Trained in Japan for 6 weeks to learn manufacturing requirements. \nRecruited, selected and trained over 100 hourly employees. Trained new production operators in communication skills, technical skills and team building. \nProduced displays for IBM and Apple, delivered to each daily. \nIn 1994 opened the first Thin-Film-transistor (TFT) manufacturing line for Sharp. Trained all employees and purchased all non-Sharp supplied equipment. \nLeft Sharp as sales declined for position at In Focus.. Manufacturing Manager Scantronic USA March 1985  –  May 1991  (6 years 3 months) Scantronic originated as Datura International, a small electronics company in Stockton California. During the 6 years I was there we grew tremendously as we were purchased and merged with other companies. It was a great opportunity to gain profitability and add employment in a disadvantaged area. During this time I: \n \n• Managed 100 production operators and 5 supervisors, growing from $4M/year to $20M/yr production over 5 year period. \n• Improved 1st pass yields from 70% to 95% utilizing a closed loop system. \n•Served as temporary Product Manager to introduce new products to manufacturing \n• Chaired the San Joaquin Mayors Committee for Employment of Disabled Persons which conducted training opportunities for local employers to promote the hiring of disabled persons in private industry. \n• Received Governor’s Award for Employment of the Disabled in 1990 as Large Employer of the Year for California. \n• Established a partnership with the California Human Development Corporation to train newly arrived refugees from Southeast Asia in electronics at no cost to Scantronic. Provided material and technical support. \n \nWe earned many awards during this time for our involvement in the community for helping to provide training and jobs to several disadvantaged ethnic groups and the disabled. It was a Win-Win situation that I am very proud of. \n \nI left to join Sharp Microelectronics, closer to my family in Portland. Production Supervisor Intel Corporation March 1984  –  February 1985  (1 year) Production Supervisor for the Systems Group at Hawthorn Farms in Hillsboro Oregon. \nSupervised assembly department producing high end circuit boards, improving line yields from 80% to 98% with a reduction in through-put time by 80% with the introduction of progressive assembly techniques. \nResponsible for personnel management of 40 assembly operators including hiring, performance management, metric recording and disciplinary actions. \n \nLeft when company laid off 900 people. Lean Coordinator Oregon Department of Fish and Wildlife March 2012  – Present (3 years 6 months) Salem Oregon Responsible for planning and executing Lean Kaizan events, staff training, and special projects for the Deputy Director of Administration. I also work for the Department of Agriculture and Department of Forestry through an Inter-Agency Agreement to lead them through process improvement activities that affect local governments and the public at large. Lean Coordinator Oregon Department of Fish and Wildlife March 2012  – Present (3 years 6 months) Salem Oregon Responsible for planning and executing Lean Kaizan events, staff training, and special projects for the Deputy Director of Administration. I also work for the Department of Agriculture and Department of Forestry through an Inter-Agency Agreement to lead them through process improvement activities that affect local governments and the public at large. Associate Supervisor, OEC Instructor Mt. Hood Ski Patrol-National Ski Patrol May 2007  – Present (8 years 4 months) Portland Oregon I am a member of the Mt. Hood Ski Patrol which is the oldest ski patrol in the nation. I currently serve as an Associate Supervisor and an instructor for the Outdoor Emergency Care Technician certification, which is almost identical to an EMT-B.I supervise the first aid room during the season and work at Timberline Lodge and Ski Bowl every other weekend during the ski season. This is a volunteer position. In 2013 I was named the Associate Supervisor of the Year. Associate Supervisor, OEC Instructor Mt. Hood Ski Patrol-National Ski Patrol May 2007  – Present (8 years 4 months) Portland Oregon I am a member of the Mt. Hood Ski Patrol which is the oldest ski patrol in the nation. I currently serve as an Associate Supervisor and an instructor for the Outdoor Emergency Care Technician certification, which is almost identical to an EMT-B.I supervise the first aid room during the season and work at Timberline Lodge and Ski Bowl every other weekend during the ski season. This is a volunteer position. In 2013 I was named the Associate Supervisor of the Year. Boy Scouts of America Volunteer Boy Scouts of America 1996  – Present (19 years) Vancouver Washington I am the Committee Chair for Troop 270 and Crew 270. I was a member of the Columbia Gorge District Committee for over 10 years. Most recently as the Chair of Goodturn for America. \nI have served on the National Jamboree Staff in 1973, 2005 and 2013. Boy Scouts of America Volunteer Boy Scouts of America 1996  – Present (19 years) Vancouver Washington I am the Committee Chair for Troop 270 and Crew 270. I was a member of the Columbia Gorge District Committee for over 10 years. Most recently as the Chair of Goodturn for America. \nI have served on the National Jamboree Staff in 1973, 2005 and 2013. Process Improvement Facilitator/Lean Leader Oregon State Hospital, State of Oregon September 2011  –  February 2012  (6 months) Salem, Oregon Member of the Performance Improvement Office in the Quality Improvement Department at the Oregon State Hospital. Facilitator for Process Improvement Teams, Rapid Process Improvements and Trainer in Lean Methodology. Process Improvement Facilitator/Lean Leader Oregon State Hospital, State of Oregon September 2011  –  February 2012  (6 months) Salem, Oregon Member of the Performance Improvement Office in the Quality Improvement Department at the Oregon State Hospital. Facilitator for Process Improvement Teams, Rapid Process Improvements and Trainer in Lean Methodology. Sr. Transformation Analyst/LSS Black Belt, Operations and Policy Analyst 4 State of Oregon - Department of Administrative Services February 2010  –  August 2011  (1 year 7 months) Sr. Analyst and Lean Leader for the Office of Transformation which is introducing Lean Six Sigma Methodology to improve Customer Service and reduce costs associated with various state agencies. Current responsibilities include development of Master Services Agreements with consulting firms, development of training materials, and leading teams in Kaizan activities to eliminate waste in the Value Stream for various processes. Sr. Transformation Analyst/LSS Black Belt, Operations and Policy Analyst 4 State of Oregon - Department of Administrative Services February 2010  –  August 2011  (1 year 7 months) Sr. Analyst and Lean Leader for the Office of Transformation which is introducing Lean Six Sigma Methodology to improve Customer Service and reduce costs associated with various state agencies. Current responsibilities include development of Master Services Agreements with consulting firms, development of training materials, and leading teams in Kaizan activities to eliminate waste in the Value Stream for various processes. Operations and Systems Analyst 2 State of Oregon November 2009  –  January 2010  (3 months) Consultant with the Water Resources Department to develop Process Improvements in the areas of Water Rights including Transfers, Certifications and Application to Initial Review.  \nResponsibilities included:  \n-Meeting with teams to create Value Stream Maps for current processes. \n-Identifying opportunities for Quality Improvement activities. \n-Review of current processes to develop Standard Work. \n-Instruction of Six Sigma (DMAIC) techniques. \n-Reducing the length of applications with better quality of information that reduces the lead time to review. Operations and Systems Analyst 2 State of Oregon November 2009  –  January 2010  (3 months) Consultant with the Water Resources Department to develop Process Improvements in the areas of Water Rights including Transfers, Certifications and Application to Initial Review.  \nResponsibilities included:  \n-Meeting with teams to create Value Stream Maps for current processes. \n-Identifying opportunities for Quality Improvement activities. \n-Review of current processes to develop Standard Work. \n-Instruction of Six Sigma (DMAIC) techniques. \n-Reducing the length of applications with better quality of information that reduces the lead time to review. Lean Leader/Team Advisor GE Security June 2003  –  March 2009  (5 years 10 months) Lean Department Leader- Responsible for selection and planning of over 100 Lean Action Workouts in three years to reduce waste in all manufacturing areas. In 2007 and 2008 reduced WIP by $1.2M and annualized savings of $900k in labor. \nAchieved recognition for \"Lean Pacesetter of the Year\" for all of GE Security for 2007. \nInvolved in 10 major events in Tualatin facility with Shingijutsu LTD. Worked with Sensei Nakao and 6 other Senior Consultants. Assisted in training Lean Leaders from other GE sites in 2008. \n \nSMT and Assembly/Warehouse/Shipping/Receiving Team Advisor (Manager) \nManaged SMT area for 4 years which was composed of 8 high speed lines of Phillips and Juki equipment. Also rotated through other responsibilities, sometimes simultaneously, as Manager of Receiving/Warehouse,Shipping, Electro-Mechanical Assembly and Test. Successfully completed the startup of several new production lines. Led assembly teams to \"Team of the Year\" in 2004 and 2005 based on meeting measurable goals in efficiency, quality, on time delivery and safety. \n \nIPC 610D Certified Inspector Trainer. \n \nGE closed the Tualatin Facility in 2009 Lean Leader/Team Advisor GE Security June 2003  –  March 2009  (5 years 10 months) Lean Department Leader- Responsible for selection and planning of over 100 Lean Action Workouts in three years to reduce waste in all manufacturing areas. In 2007 and 2008 reduced WIP by $1.2M and annualized savings of $900k in labor. \nAchieved recognition for \"Lean Pacesetter of the Year\" for all of GE Security for 2007. \nInvolved in 10 major events in Tualatin facility with Shingijutsu LTD. Worked with Sensei Nakao and 6 other Senior Consultants. Assisted in training Lean Leaders from other GE sites in 2008. \n \nSMT and Assembly/Warehouse/Shipping/Receiving Team Advisor (Manager) \nManaged SMT area for 4 years which was composed of 8 high speed lines of Phillips and Juki equipment. Also rotated through other responsibilities, sometimes simultaneously, as Manager of Receiving/Warehouse,Shipping, Electro-Mechanical Assembly and Test. Successfully completed the startup of several new production lines. Led assembly teams to \"Team of the Year\" in 2004 and 2005 based on meeting measurable goals in efficiency, quality, on time delivery and safety. \n \nIPC 610D Certified Inspector Trainer. \n \nGE closed the Tualatin Facility in 2009 Manufacturing Supervisor MEC Northwest August 2002  –  May 2003  (10 months) Manufacturing Supervisor for small contract manufacturer. Responsible for all manufacturing. Improved efficiency by over 30% and reduced defects by 50% within three months. \nLeft company when they had downturn in business. Manufacturing Supervisor MEC Northwest August 2002  –  May 2003  (10 months) Manufacturing Supervisor for small contract manufacturer. Responsible for all manufacturing. Improved efficiency by over 30% and reduced defects by 50% within three months. \nLeft company when they had downturn in business. Sr. Manufacturing Supervisor Solectron/NEC America September 1997  –  March 2002  (4 years 7 months) NEC was a manufacturer of high end telecommunications equipment for ATT, Sprint, MCI and others, located in Hillsboro Oregon. \nResponsible for all SMT operations on a 24/7 operation. 10 high speed Fuji lines with 100 production operators and an engineering staff of 5 technicians and 3 engineers. \nNEC Continuous Improvement Team of the Year for 1999. \nReduced cost per placement for SMT by 50%, reduced DPM to<100, reduced changeover time by 50%. \nSolectron closed the company in Hillsboro. Sr. Manufacturing Supervisor Solectron/NEC America September 1997  –  March 2002  (4 years 7 months) NEC was a manufacturer of high end telecommunications equipment for ATT, Sprint, MCI and others, located in Hillsboro Oregon. \nResponsible for all SMT operations on a 24/7 operation. 10 high speed Fuji lines with 100 production operators and an engineering staff of 5 technicians and 3 engineers. \nNEC Continuous Improvement Team of the Year for 1999. \nReduced cost per placement for SMT by 50%, reduced DPM to<100, reduced changeover time by 50%. \nSolectron closed the company in Hillsboro. Operations Manager Scientific Air Systems September 1996  –  June 1997  (10 months) Operations manager for small company that built air showers and pass-throughs for the cleanroom industry. \nIncreased Revenue Margin from 33% to 39% by reducing materials costs. \nIncreased On-Time delivery from 70% to 99% by implementing work cells to identify and solve quality problems. \nCompany went out of business with downturn in industry. Operations Manager Scientific Air Systems September 1996  –  June 1997  (10 months) Operations manager for small company that built air showers and pass-throughs for the cleanroom industry. \nIncreased Revenue Margin from 33% to 39% by reducing materials costs. \nIncreased On-Time delivery from 70% to 99% by implementing work cells to identify and solve quality problems. \nCompany went out of business with downturn in industry. Swing Shift Manager In Focus Systems June 1996  –  September 1996  (4 months) Swing Shift Manager for company building projection systems. The company was the fastest growing Hi-Tech company in Oregon.  \nI managed 45 warehouse and assembly personnel, 36 of which were temporaries that were hired on my first day. We quickly built a high performance team and met all quality and productivity requirements, including building over $1M in product in one shift. During July of 1996 the company stock crashed due to rumors of new competition in the market place, and the swing shift was eliminated in Sept.. Swing Shift Manager In Focus Systems June 1996  –  September 1996  (4 months) Swing Shift Manager for company building projection systems. The company was the fastest growing Hi-Tech company in Oregon.  \nI managed 45 warehouse and assembly personnel, 36 of which were temporaries that were hired on my first day. We quickly built a high performance team and met all quality and productivity requirements, including building over $1M in product in one shift. During July of 1996 the company stock crashed due to rumors of new competition in the market place, and the swing shift was eliminated in Sept.. Sr. Production Supervisor Sharp Microelectronics Technologies June 1991  –  June 1996  (5 years 1 month) Member of the 5 person startup team for the first Sharp Liquid Crystal Display manufacturing facility in the USA located in Camas Washington. Trained in Japan for 6 weeks to learn manufacturing requirements. \nRecruited, selected and trained over 100 hourly employees. Trained new production operators in communication skills, technical skills and team building. \nProduced displays for IBM and Apple, delivered to each daily. \nIn 1994 opened the first Thin-Film-transistor (TFT) manufacturing line for Sharp. Trained all employees and purchased all non-Sharp supplied equipment. \nLeft Sharp as sales declined for position at In Focus.. Sr. Production Supervisor Sharp Microelectronics Technologies June 1991  –  June 1996  (5 years 1 month) Member of the 5 person startup team for the first Sharp Liquid Crystal Display manufacturing facility in the USA located in Camas Washington. Trained in Japan for 6 weeks to learn manufacturing requirements. \nRecruited, selected and trained over 100 hourly employees. Trained new production operators in communication skills, technical skills and team building. \nProduced displays for IBM and Apple, delivered to each daily. \nIn 1994 opened the first Thin-Film-transistor (TFT) manufacturing line for Sharp. Trained all employees and purchased all non-Sharp supplied equipment. \nLeft Sharp as sales declined for position at In Focus.. Manufacturing Manager Scantronic USA March 1985  –  May 1991  (6 years 3 months) Scantronic originated as Datura International, a small electronics company in Stockton California. During the 6 years I was there we grew tremendously as we were purchased and merged with other companies. It was a great opportunity to gain profitability and add employment in a disadvantaged area. During this time I: \n \n• Managed 100 production operators and 5 supervisors, growing from $4M/year to $20M/yr production over 5 year period. \n• Improved 1st pass yields from 70% to 95% utilizing a closed loop system. \n•Served as temporary Product Manager to introduce new products to manufacturing \n• Chaired the San Joaquin Mayors Committee for Employment of Disabled Persons which conducted training opportunities for local employers to promote the hiring of disabled persons in private industry. \n• Received Governor’s Award for Employment of the Disabled in 1990 as Large Employer of the Year for California. \n• Established a partnership with the California Human Development Corporation to train newly arrived refugees from Southeast Asia in electronics at no cost to Scantronic. Provided material and technical support. \n \nWe earned many awards during this time for our involvement in the community for helping to provide training and jobs to several disadvantaged ethnic groups and the disabled. It was a Win-Win situation that I am very proud of. \n \nI left to join Sharp Microelectronics, closer to my family in Portland. Manufacturing Manager Scantronic USA March 1985  –  May 1991  (6 years 3 months) Scantronic originated as Datura International, a small electronics company in Stockton California. During the 6 years I was there we grew tremendously as we were purchased and merged with other companies. It was a great opportunity to gain profitability and add employment in a disadvantaged area. During this time I: \n \n• Managed 100 production operators and 5 supervisors, growing from $4M/year to $20M/yr production over 5 year period. \n• Improved 1st pass yields from 70% to 95% utilizing a closed loop system. \n•Served as temporary Product Manager to introduce new products to manufacturing \n• Chaired the San Joaquin Mayors Committee for Employment of Disabled Persons which conducted training opportunities for local employers to promote the hiring of disabled persons in private industry. \n• Received Governor’s Award for Employment of the Disabled in 1990 as Large Employer of the Year for California. \n• Established a partnership with the California Human Development Corporation to train newly arrived refugees from Southeast Asia in electronics at no cost to Scantronic. Provided material and technical support. \n \nWe earned many awards during this time for our involvement in the community for helping to provide training and jobs to several disadvantaged ethnic groups and the disabled. It was a Win-Win situation that I am very proud of. \n \nI left to join Sharp Microelectronics, closer to my family in Portland. Production Supervisor Intel Corporation March 1984  –  February 1985  (1 year) Production Supervisor for the Systems Group at Hawthorn Farms in Hillsboro Oregon. \nSupervised assembly department producing high end circuit boards, improving line yields from 80% to 98% with a reduction in through-put time by 80% with the introduction of progressive assembly techniques. \nResponsible for personnel management of 40 assembly operators including hiring, performance management, metric recording and disciplinary actions. \n \nLeft when company laid off 900 people. Production Supervisor Intel Corporation March 1984  –  February 1985  (1 year) Production Supervisor for the Systems Group at Hawthorn Farms in Hillsboro Oregon. \nSupervised assembly department producing high end circuit boards, improving line yields from 80% to 98% with a reduction in through-put time by 80% with the introduction of progressive assembly techniques. \nResponsible for personnel management of 40 assembly operators including hiring, performance management, metric recording and disciplinary actions. \n \nLeft when company laid off 900 people. Languages German German German Skills Process Mapping Kaizen Facilitation Leadership Mentoring Budget Development Supply Chain Operations Six Sigma Process Improvement Kaizen Business Process Mapping Project Planning Value Stream Mapping Continuous Improvement Team Building Organizational... Workshop Facilitation Team Leadership Change Management Manufacturing Leadership Quality Management Training Management Business Process... Analysis Coaching Leadership Development Budgets Product Development Human Resources Performance Management See 15+     See less Skills  Process Mapping Kaizen Facilitation Leadership Mentoring Budget Development Supply Chain Operations Six Sigma Process Improvement Kaizen Business Process Mapping Project Planning Value Stream Mapping Continuous Improvement Team Building Organizational... Workshop Facilitation Team Leadership Change Management Manufacturing Leadership Quality Management Training Management Business Process... Analysis Coaching Leadership Development Budgets Product Development Human Resources Performance Management See 15+     See less Process Mapping Kaizen Facilitation Leadership Mentoring Budget Development Supply Chain Operations Six Sigma Process Improvement Kaizen Business Process Mapping Project Planning Value Stream Mapping Continuous Improvement Team Building Organizational... Workshop Facilitation Team Leadership Change Management Manufacturing Leadership Quality Management Training Management Business Process... Analysis Coaching Leadership Development Budgets Product Development Human Resources Performance Management See 15+     See less Process Mapping Kaizen Facilitation Leadership Mentoring Budget Development Supply Chain Operations Six Sigma Process Improvement Kaizen Business Process Mapping Project Planning Value Stream Mapping Continuous Improvement Team Building Organizational... Workshop Facilitation Team Leadership Change Management Manufacturing Leadership Quality Management Training Management Business Process... Analysis Coaching Leadership Development Budgets Product Development Human Resources Performance Management See 15+     See less Education Portland State University Professional Certificates,  Human Resources Management , Materials Management,  Implementing the Lean System 1992  – 2011 Professional Certificates earned through the Professional Development Center. University of California, Davis Professional Certificate,  Labor-Management Relations 1987  – 1989 The Labor-Mangement Relations Program at UCD is based upon the same program at UCLA. It is a nationally recognized program. University of Portland MBA/BA,  Business and Communications 1974  – 1982 Central Catholic High School 1970  – 1974 Portland State University Professional Certificates,  Human Resources Management , Materials Management,  Implementing the Lean System 1992  – 2011 Professional Certificates earned through the Professional Development Center. Portland State University Professional Certificates,  Human Resources Management , Materials Management,  Implementing the Lean System 1992  – 2011 Professional Certificates earned through the Professional Development Center. Portland State University Professional Certificates,  Human Resources Management , Materials Management,  Implementing the Lean System 1992  – 2011 Professional Certificates earned through the Professional Development Center. University of California, Davis Professional Certificate,  Labor-Management Relations 1987  – 1989 The Labor-Mangement Relations Program at UCD is based upon the same program at UCLA. It is a nationally recognized program. University of California, Davis Professional Certificate,  Labor-Management Relations 1987  – 1989 The Labor-Mangement Relations Program at UCD is based upon the same program at UCLA. It is a nationally recognized program. University of California, Davis Professional Certificate,  Labor-Management Relations 1987  – 1989 The Labor-Mangement Relations Program at UCD is based upon the same program at UCLA. It is a nationally recognized program. University of Portland MBA/BA,  Business and Communications 1974  – 1982 University of Portland MBA/BA,  Business and Communications 1974  – 1982 University of Portland MBA/BA,  Business and Communications 1974  – 1982 Central Catholic High School 1970  – 1974 Central Catholic High School 1970  – 1974 Central Catholic High School 1970  – 1974 Honors & Awards Additional Honors & Awards Eagle Scout \nDistrict Award of Merit BSA 2007 \nSilver Beaver Award BSA 2009 \nScouter of the Year 2009, Columbia Gorge District, BSA \nMt. Hood Ski Patrol Coach of the Year 2009 \nMHSP Associate Patroller of the Year 2009 \n#1 Patroller for days served 2009 \nMHSP Associate Supervisor of the Year 2013 Additional Honors & Awards Eagle Scout \nDistrict Award of Merit BSA 2007 \nSilver Beaver Award BSA 2009 \nScouter of the Year 2009, Columbia Gorge District, BSA \nMt. Hood Ski Patrol Coach of the Year 2009 \nMHSP Associate Patroller of the Year 2009 \n#1 Patroller for days served 2009 \nMHSP Associate Supervisor of the Year 2013 Additional Honors & Awards Eagle Scout \nDistrict Award of Merit BSA 2007 \nSilver Beaver Award BSA 2009 \nScouter of the Year 2009, Columbia Gorge District, BSA \nMt. Hood Ski Patrol Coach of the Year 2009 \nMHSP Associate Patroller of the Year 2009 \n#1 Patroller for days served 2009 \nMHSP Associate Supervisor of the Year 2013 Additional Honors & Awards Eagle Scout \nDistrict Award of Merit BSA 2007 \nSilver Beaver Award BSA 2009 \nScouter of the Year 2009, Columbia Gorge District, BSA \nMt. Hood Ski Patrol Coach of the Year 2009 \nMHSP Associate Patroller of the Year 2009 \n#1 Patroller for days served 2009 \nMHSP Associate Supervisor of the Year 2013 ", "Experience Production Supervisor Intel Corporation Production Supervisor Intel Corporation Production Supervisor Intel Corporation Education New Mexico State University 1990  – 1997 New Mexico State University 1990  – 1997 New Mexico State University 1990  – 1997 New Mexico State University 1990  – 1997 ", "Experience Student Nurse Carrington College September 2012  – Present (3 years) Albuquerque, New Mexico Area Student Nurse Carrington College September 2012  – Present (3 years) Albuquerque, New Mexico Area Student Nurse Carrington College September 2012  – Present (3 years) Albuquerque, New Mexico Area Skills Kaizen Manufacturing Continuous Improvement Semiconductors Lean Manufacturing Photovoltaics Operations Management Process Improvement Supply Chain Cross-functional Team... Manufacturing... Team Building Product Development Project Planning 5S Forecasting ISO Management Production Planning Solar PV Thin Films Project Management R&D Renewable Energy SAP Design of Experiments Strategic Planning Procurement FMEA Manufacturing Operations Purchasing Quality Management Value Stream Mapping Quality System Electronics Materials Management Logistics Performance Management Quality Assurance Root Cause Analysis Training Failure Analysis Solar Energy Budgets Materials Automation Metrology Program Management MRP Testing See 35+     See less Skills  Kaizen Manufacturing Continuous Improvement Semiconductors Lean Manufacturing Photovoltaics Operations Management Process Improvement Supply Chain Cross-functional Team... Manufacturing... Team Building Product Development Project Planning 5S Forecasting ISO Management Production Planning Solar PV Thin Films Project Management R&D Renewable Energy SAP Design of Experiments Strategic Planning Procurement FMEA Manufacturing Operations Purchasing Quality Management Value Stream Mapping Quality System Electronics Materials Management Logistics Performance Management Quality Assurance Root Cause Analysis Training Failure Analysis Solar Energy Budgets Materials Automation Metrology Program Management MRP Testing See 35+     See less Kaizen Manufacturing Continuous Improvement Semiconductors Lean Manufacturing Photovoltaics Operations Management Process Improvement Supply Chain Cross-functional Team... Manufacturing... Team Building Product Development Project Planning 5S Forecasting ISO Management Production Planning Solar PV Thin Films Project Management R&D Renewable Energy SAP Design of Experiments Strategic Planning Procurement FMEA Manufacturing Operations Purchasing Quality Management Value Stream Mapping Quality System Electronics Materials Management Logistics Performance Management Quality Assurance Root Cause Analysis Training Failure Analysis Solar Energy Budgets Materials Automation Metrology Program Management MRP Testing See 35+     See less Kaizen Manufacturing Continuous Improvement Semiconductors Lean Manufacturing Photovoltaics Operations Management Process Improvement Supply Chain Cross-functional Team... Manufacturing... Team Building Product Development Project Planning 5S Forecasting ISO Management Production Planning Solar PV Thin Films Project Management R&D Renewable Energy SAP Design of Experiments Strategic Planning Procurement FMEA Manufacturing Operations Purchasing Quality Management Value Stream Mapping Quality System Electronics Materials Management Logistics Performance Management Quality Assurance Root Cause Analysis Training Failure Analysis Solar Energy Budgets Materials Automation Metrology Program Management MRP Testing See 35+     See less ", "Skills Cross-functional Team... ISO 13485 SPC Root Cause Analysis Value Stream Mapping Manufacturing Operations DMAIC GMP Six Sigma Black Belt Iso 9000 ISO 14001 5S Leadership Kanban Quality Control Team Building Team Leadership Quality Assurance See 4+     See less Skills  Cross-functional Team... ISO 13485 SPC Root Cause Analysis Value Stream Mapping Manufacturing Operations DMAIC GMP Six Sigma Black Belt Iso 9000 ISO 14001 5S Leadership Kanban Quality Control Team Building Team Leadership Quality Assurance See 4+     See less Cross-functional Team... ISO 13485 SPC Root Cause Analysis Value Stream Mapping Manufacturing Operations DMAIC GMP Six Sigma Black Belt Iso 9000 ISO 14001 5S Leadership Kanban Quality Control Team Building Team Leadership Quality Assurance See 4+     See less Cross-functional Team... ISO 13485 SPC Root Cause Analysis Value Stream Mapping Manufacturing Operations DMAIC GMP Six Sigma Black Belt Iso 9000 ISO 14001 5S Leadership Kanban Quality Control Team Building Team Leadership Quality Assurance See 4+     See less ", "Skills Capital Markets Investment Banking Hedge Funds Equities Fixed Income Derivatives Bloomberg Venture Capital Alternative Investments Asset Management Trading Valuation Private Equity Emerging Markets Bonds FX Options Investments Portfolio Management Investment Management Management Corporate Finance Equity Research Financial Markets Marketing Strategy Strategic Planning Financial Modeling Risk Management See 13+     See less Skills  Capital Markets Investment Banking Hedge Funds Equities Fixed Income Derivatives Bloomberg Venture Capital Alternative Investments Asset Management Trading Valuation Private Equity Emerging Markets Bonds FX Options Investments Portfolio Management Investment Management Management Corporate Finance Equity Research Financial Markets Marketing Strategy Strategic Planning Financial Modeling Risk Management See 13+     See less Capital Markets Investment Banking Hedge Funds Equities Fixed Income Derivatives Bloomberg Venture Capital Alternative Investments Asset Management Trading Valuation Private Equity Emerging Markets Bonds FX Options Investments Portfolio Management Investment Management Management Corporate Finance Equity Research Financial Markets Marketing Strategy Strategic Planning Financial Modeling Risk Management See 13+     See less Capital Markets Investment Banking Hedge Funds Equities Fixed Income Derivatives Bloomberg Venture Capital Alternative Investments Asset Management Trading Valuation Private Equity Emerging Markets Bonds FX Options Investments Portfolio Management Investment Management Management Corporate Finance Equity Research Financial Markets Marketing Strategy Strategic Planning Financial Modeling Risk Management See 13+     See less ", "Summary The 5.5-year working experience (at Flextronics, Alcatel-Lucent Shanghai Bell & Intel) has brought me with the professional abilities of both people management and project management, which makes me built up the habits of efficient working, result orientation, pro-active problem solving as well as good communication in order to be involved into the position and the culture of no matter joint venture or foreign invested companies. Specialties:Lean Manufacturing & Six Sigma Green Belt \nBusiness Excellence Experience \nProduction Operation Background Summary The 5.5-year working experience (at Flextronics, Alcatel-Lucent Shanghai Bell & Intel) has brought me with the professional abilities of both people management and project management, which makes me built up the habits of efficient working, result orientation, pro-active problem solving as well as good communication in order to be involved into the position and the culture of no matter joint venture or foreign invested companies. Specialties:Lean Manufacturing & Six Sigma Green Belt \nBusiness Excellence Experience \nProduction Operation Background The 5.5-year working experience (at Flextronics, Alcatel-Lucent Shanghai Bell & Intel) has brought me with the professional abilities of both people management and project management, which makes me built up the habits of efficient working, result orientation, pro-active problem solving as well as good communication in order to be involved into the position and the culture of no matter joint venture or foreign invested companies. Specialties:Lean Manufacturing & Six Sigma Green Belt \nBusiness Excellence Experience \nProduction Operation Background The 5.5-year working experience (at Flextronics, Alcatel-Lucent Shanghai Bell & Intel) has brought me with the professional abilities of both people management and project management, which makes me built up the habits of efficient working, result orientation, pro-active problem solving as well as good communication in order to be involved into the position and the culture of no matter joint venture or foreign invested companies. Specialties:Lean Manufacturing & Six Sigma Green Belt \nBusiness Excellence Experience \nProduction Operation Background Experience Business Process Manager & Operational Excellence Roche June 2014  – Present (1 year 3 months) 中国 上海市区 Business Excellence Facilitator Supervisor SKF March 2013  –  June 2014  (1 year 4 months) Manufacturing Excellence Engineer/Business Excellence Facilitator SKF March 2011  –  March 2014  (3 years 1 month) Shanghai China Lean, Six Sigma, Business Excellence Senior Lean Engineer Flextronics April 2010  –  March 2011  (1 year) 1) LEAN Small Group Activity(SGA) Facilitator： \n72 Operations Kaizen; 7 Supply Chain Kaizen; 10 Office Kaizen with: Hard saving 46.6K$; Soft saving 217K$; NWC saving 1840K$ \n2) Internal/External Kaizen Workshop Facilitator： \n34 Operations Kaizen; 13 Supply Chain Kaizen; 13 Office Kaizen with: Hard saving 209K$; Soft saving 445.5K$; NWC saving 3474.5K$ \n3) Best Practice Release 1-12 Yokoten: Hard saving 1099K$; Soft saving 437.4K$; NWC saving 5205.4K$ \n4) Flextronics Shanghai Malu Lean Training: \nNew Employee Lean Basic Training：Monthly Lean Basic1 & Basic training for all new employees（Lean 5 Principle, 7 Waste, Toyota Manufacturing, Flex Lean Enterprise, Value Stream Mapping, 6S, Visual Management & Supermarket, etc. ）  \n \nFlex Lean Green Belt Training & Certification：  \nDeploy Lean Green Belt Training （Lean Basic 1 & 2, Kaizen Rules& Kaizen Guide, Kanban Pull System, Cell Design, JIT, JIDOKA, Inventory Control, Heijunka, Changeover, etc; Certification of the projects of Kaizen Small Group Activity, Kaizen Workshop） for 21 managers, directors as well as GM from Operations, Supply Chain, Material Planning, Warehouse, Logistics, Finance, HR, Security, Admin as well as Facility departments.  \n \nQuarterly Lean Aero plane Game Training & SGA Competition：  \nOrganize the routine Lean Aero plane Game Training for all levels of the company to introduce the benefits of one piece flow VS batch production; Organize the SGA competition covering whole factory to promote the Lean culture (1 Malu SGA competition & 1 Asia Pacific regional Lean competition)  \n \nTraining & Certification:  \nFlex Lean Level 1/2/3 Training; Flex Lean Green Belt Certification \nFlex 6 Sigma Awareness Training \nFlex ISO9001; ISO14001 & Advanced EHS Training Programming Engineer Alcatel-Lucent Shanghai Bell Co., Ltd Business Central Support \"Future Factory April 2008  –  March 2010  (2 years) In charge of the \"Future Factory\" Initiatives of Alcatel-Lucent Shanghai Bell in terms of:  \nWorkshop Layout & Logistic Flow optimization, factory EHS management, Green/Clean Production as well as Lean&6*Production to achieve the company's strategy of cost reduction, energy saving, emission reduction as well as human quality improvement  \nKey Projects Briefing & Results:  \nLEAN&6*Production/Workshop Layout & Logistic Optimization Projects Management: \nProject Leader of 2008 ASB Operations Platform Office Area Integration & Workshop Layout Optimization Project (saving 1000 sqm production space)  \nProject Leader of 2008 ASB Building#2 Workshop Logistic Optimization Project (improve Building#2 logistic flexibility rate by 100% increase) \nProject Leader of 2009 Building#1 Sub-packing & Raw Material Area Integration Project (saving 120 sqm for production space)  \nEHS/Green/Clean Production Projects Management: \nProject Leader of 2008 Factory Industrial Gas Emission Reduction Project (70% chemical emission reduction rate)  \nProject Leader of 2009 Factory Chemical Station \"Silk-Screen Printing\" Area Optimization (100% separation for chemical station)  \nProject Leader of 2009 Factory Waste Water Treatment Optimization Project (15% waste let reduction & 52 sqm saving for production space) Future Factory Programming Engineer alcatel lucent shanghai bell 2008  –  2009  (1 year) Future Factory Programming Engineer alcatel lucent shanghai bell 2008  –  2009  (1 year) Factory Material Flow & Layout Optimization Production Supervisor Intel Corporation 2005  –  2008  (3 years) Production Supervisor of Final Packaging Area Production Supervisor Intel Corporation 2005  –  2008  (3 years) Business Process Manager & Operational Excellence Roche June 2014  – Present (1 year 3 months) 中国 上海市区 Business Process Manager & Operational Excellence Roche June 2014  – Present (1 year 3 months) 中国 上海市区 Business Excellence Facilitator Supervisor SKF March 2013  –  June 2014  (1 year 4 months) Business Excellence Facilitator Supervisor SKF March 2013  –  June 2014  (1 year 4 months) Manufacturing Excellence Engineer/Business Excellence Facilitator SKF March 2011  –  March 2014  (3 years 1 month) Shanghai China Lean, Six Sigma, Business Excellence Manufacturing Excellence Engineer/Business Excellence Facilitator SKF March 2011  –  March 2014  (3 years 1 month) Shanghai China Lean, Six Sigma, Business Excellence Senior Lean Engineer Flextronics April 2010  –  March 2011  (1 year) 1) LEAN Small Group Activity(SGA) Facilitator： \n72 Operations Kaizen; 7 Supply Chain Kaizen; 10 Office Kaizen with: Hard saving 46.6K$; Soft saving 217K$; NWC saving 1840K$ \n2) Internal/External Kaizen Workshop Facilitator： \n34 Operations Kaizen; 13 Supply Chain Kaizen; 13 Office Kaizen with: Hard saving 209K$; Soft saving 445.5K$; NWC saving 3474.5K$ \n3) Best Practice Release 1-12 Yokoten: Hard saving 1099K$; Soft saving 437.4K$; NWC saving 5205.4K$ \n4) Flextronics Shanghai Malu Lean Training: \nNew Employee Lean Basic Training：Monthly Lean Basic1 & Basic training for all new employees（Lean 5 Principle, 7 Waste, Toyota Manufacturing, Flex Lean Enterprise, Value Stream Mapping, 6S, Visual Management & Supermarket, etc. ）  \n \nFlex Lean Green Belt Training & Certification：  \nDeploy Lean Green Belt Training （Lean Basic 1 & 2, Kaizen Rules& Kaizen Guide, Kanban Pull System, Cell Design, JIT, JIDOKA, Inventory Control, Heijunka, Changeover, etc; Certification of the projects of Kaizen Small Group Activity, Kaizen Workshop） for 21 managers, directors as well as GM from Operations, Supply Chain, Material Planning, Warehouse, Logistics, Finance, HR, Security, Admin as well as Facility departments.  \n \nQuarterly Lean Aero plane Game Training & SGA Competition：  \nOrganize the routine Lean Aero plane Game Training for all levels of the company to introduce the benefits of one piece flow VS batch production; Organize the SGA competition covering whole factory to promote the Lean culture (1 Malu SGA competition & 1 Asia Pacific regional Lean competition)  \n \nTraining & Certification:  \nFlex Lean Level 1/2/3 Training; Flex Lean Green Belt Certification \nFlex 6 Sigma Awareness Training \nFlex ISO9001; ISO14001 & Advanced EHS Training Senior Lean Engineer Flextronics April 2010  –  March 2011  (1 year) 1) LEAN Small Group Activity(SGA) Facilitator： \n72 Operations Kaizen; 7 Supply Chain Kaizen; 10 Office Kaizen with: Hard saving 46.6K$; Soft saving 217K$; NWC saving 1840K$ \n2) Internal/External Kaizen Workshop Facilitator： \n34 Operations Kaizen; 13 Supply Chain Kaizen; 13 Office Kaizen with: Hard saving 209K$; Soft saving 445.5K$; NWC saving 3474.5K$ \n3) Best Practice Release 1-12 Yokoten: Hard saving 1099K$; Soft saving 437.4K$; NWC saving 5205.4K$ \n4) Flextronics Shanghai Malu Lean Training: \nNew Employee Lean Basic Training：Monthly Lean Basic1 & Basic training for all new employees（Lean 5 Principle, 7 Waste, Toyota Manufacturing, Flex Lean Enterprise, Value Stream Mapping, 6S, Visual Management & Supermarket, etc. ）  \n \nFlex Lean Green Belt Training & Certification：  \nDeploy Lean Green Belt Training （Lean Basic 1 & 2, Kaizen Rules& Kaizen Guide, Kanban Pull System, Cell Design, JIT, JIDOKA, Inventory Control, Heijunka, Changeover, etc; Certification of the projects of Kaizen Small Group Activity, Kaizen Workshop） for 21 managers, directors as well as GM from Operations, Supply Chain, Material Planning, Warehouse, Logistics, Finance, HR, Security, Admin as well as Facility departments.  \n \nQuarterly Lean Aero plane Game Training & SGA Competition：  \nOrganize the routine Lean Aero plane Game Training for all levels of the company to introduce the benefits of one piece flow VS batch production; Organize the SGA competition covering whole factory to promote the Lean culture (1 Malu SGA competition & 1 Asia Pacific regional Lean competition)  \n \nTraining & Certification:  \nFlex Lean Level 1/2/3 Training; Flex Lean Green Belt Certification \nFlex 6 Sigma Awareness Training \nFlex ISO9001; ISO14001 & Advanced EHS Training Programming Engineer Alcatel-Lucent Shanghai Bell Co., Ltd Business Central Support \"Future Factory April 2008  –  March 2010  (2 years) In charge of the \"Future Factory\" Initiatives of Alcatel-Lucent Shanghai Bell in terms of:  \nWorkshop Layout & Logistic Flow optimization, factory EHS management, Green/Clean Production as well as Lean&6*Production to achieve the company's strategy of cost reduction, energy saving, emission reduction as well as human quality improvement  \nKey Projects Briefing & Results:  \nLEAN&6*Production/Workshop Layout & Logistic Optimization Projects Management: \nProject Leader of 2008 ASB Operations Platform Office Area Integration & Workshop Layout Optimization Project (saving 1000 sqm production space)  \nProject Leader of 2008 ASB Building#2 Workshop Logistic Optimization Project (improve Building#2 logistic flexibility rate by 100% increase) \nProject Leader of 2009 Building#1 Sub-packing & Raw Material Area Integration Project (saving 120 sqm for production space)  \nEHS/Green/Clean Production Projects Management: \nProject Leader of 2008 Factory Industrial Gas Emission Reduction Project (70% chemical emission reduction rate)  \nProject Leader of 2009 Factory Chemical Station \"Silk-Screen Printing\" Area Optimization (100% separation for chemical station)  \nProject Leader of 2009 Factory Waste Water Treatment Optimization Project (15% waste let reduction & 52 sqm saving for production space) Programming Engineer Alcatel-Lucent Shanghai Bell Co., Ltd Business Central Support \"Future Factory April 2008  –  March 2010  (2 years) In charge of the \"Future Factory\" Initiatives of Alcatel-Lucent Shanghai Bell in terms of:  \nWorkshop Layout & Logistic Flow optimization, factory EHS management, Green/Clean Production as well as Lean&6*Production to achieve the company's strategy of cost reduction, energy saving, emission reduction as well as human quality improvement  \nKey Projects Briefing & Results:  \nLEAN&6*Production/Workshop Layout & Logistic Optimization Projects Management: \nProject Leader of 2008 ASB Operations Platform Office Area Integration & Workshop Layout Optimization Project (saving 1000 sqm production space)  \nProject Leader of 2008 ASB Building#2 Workshop Logistic Optimization Project (improve Building#2 logistic flexibility rate by 100% increase) \nProject Leader of 2009 Building#1 Sub-packing & Raw Material Area Integration Project (saving 120 sqm for production space)  \nEHS/Green/Clean Production Projects Management: \nProject Leader of 2008 Factory Industrial Gas Emission Reduction Project (70% chemical emission reduction rate)  \nProject Leader of 2009 Factory Chemical Station \"Silk-Screen Printing\" Area Optimization (100% separation for chemical station)  \nProject Leader of 2009 Factory Waste Water Treatment Optimization Project (15% waste let reduction & 52 sqm saving for production space) Future Factory Programming Engineer alcatel lucent shanghai bell 2008  –  2009  (1 year) Future Factory Programming Engineer alcatel lucent shanghai bell 2008  –  2009  (1 year) Future Factory Programming Engineer alcatel lucent shanghai bell 2008  –  2009  (1 year) Factory Material Flow & Layout Optimization Future Factory Programming Engineer alcatel lucent shanghai bell 2008  –  2009  (1 year) Factory Material Flow & Layout Optimization Production Supervisor Intel Corporation 2005  –  2008  (3 years) Production Supervisor of Final Packaging Area Production Supervisor Intel Corporation 2005  –  2008  (3 years) Production Supervisor of Final Packaging Area Production Supervisor Intel Corporation 2005  –  2008  (3 years) Production Supervisor Intel Corporation 2005  –  2008  (3 years) Languages English English English Skills Six Sigma Lean Manufacturing Value Stream Mapping Supply Chain Kaizen Automotive JIT Iso 9000 5S ISO 14001 Kanban Logistics MRP Manufacturing Project Management DMAIC Continuous Improvement Operational Excellence See 3+     See less Skills  Six Sigma Lean Manufacturing Value Stream Mapping Supply Chain Kaizen Automotive JIT Iso 9000 5S ISO 14001 Kanban Logistics MRP Manufacturing Project Management DMAIC Continuous Improvement Operational Excellence See 3+     See less Six Sigma Lean Manufacturing Value Stream Mapping Supply Chain Kaizen Automotive JIT Iso 9000 5S ISO 14001 Kanban Logistics MRP Manufacturing Project Management DMAIC Continuous Improvement Operational Excellence See 3+     See less Six Sigma Lean Manufacturing Value Stream Mapping Supply Chain Kaizen Automotive JIT Iso 9000 5S ISO 14001 Kanban Logistics MRP Manufacturing Project Management DMAIC Continuous Improvement Operational Excellence See 3+     See less Education Shanghai Institute of Technology Bachelor,  Mechanical Engineering 2001  – 2005 Activities and Societies:  F1 volunteer Shanghai Institute of Technology Bachelor,  Mechanical & Engineering 2001  – 2005 Activities and Societies:  F1 Volunteer ,  Tennis Master Cup Volunteer Shanghai Institute of Technology Bachelor,  Mechanical Engineering 2001  – 2005 Activities and Societies:  F1 volunteer Shanghai Institute of Technology Bachelor,  Mechanical Engineering 2001  – 2005 Activities and Societies:  F1 volunteer Shanghai Institute of Technology Bachelor,  Mechanical Engineering 2001  – 2005 Activities and Societies:  F1 volunteer Shanghai Institute of Technology Bachelor,  Mechanical & Engineering 2001  – 2005 Activities and Societies:  F1 Volunteer ,  Tennis Master Cup Volunteer Shanghai Institute of Technology Bachelor,  Mechanical & Engineering 2001  – 2005 Activities and Societies:  F1 Volunteer ,  Tennis Master Cup Volunteer Shanghai Institute of Technology Bachelor,  Mechanical & Engineering 2001  – 2005 Activities and Societies:  F1 Volunteer ,  Tennis Master Cup Volunteer ", "Experience V.P. of Worldwide Manufacturing Atmel Corporation September 1995  – Present (20 years) Production Manager Hitachi Semiconductor June 1992  –  September 1995  (3 years 4 months) V.P. of Operations Silicon Valley Group - Thermal Division July 1989  –  June 1992  (3 years) Manufacturing Engineering Section Manager National Semiconductor Corp. July 1984  –  July 1989  (5 years 1 month) Production Supervisor Intel Corporation June 1982  –  July 1984  (2 years 2 months) V.P. of Worldwide Manufacturing Atmel Corporation September 1995  – Present (20 years) V.P. of Worldwide Manufacturing Atmel Corporation September 1995  – Present (20 years) Production Manager Hitachi Semiconductor June 1992  –  September 1995  (3 years 4 months) Production Manager Hitachi Semiconductor June 1992  –  September 1995  (3 years 4 months) V.P. of Operations Silicon Valley Group - Thermal Division July 1989  –  June 1992  (3 years) V.P. of Operations Silicon Valley Group - Thermal Division July 1989  –  June 1992  (3 years) Manufacturing Engineering Section Manager National Semiconductor Corp. July 1984  –  July 1989  (5 years 1 month) Manufacturing Engineering Section Manager National Semiconductor Corp. July 1984  –  July 1989  (5 years 1 month) Production Supervisor Intel Corporation June 1982  –  July 1984  (2 years 2 months) Production Supervisor Intel Corporation June 1982  –  July 1984  (2 years 2 months) Skills Semiconductors IC Semiconductor Industry Analog ASIC Mixed Signal SoC Silicon Microelectronics EDA Electronics CMOS Yield Product Engineering Failure Analysis Metrology Engineering Management Manufacturing SPC Debugging Test Engineering Microprocessors Microcontrollers RF Thin Films Design of Experiments PVD MEMS Test Equipment JMP See 15+     See less Skills  Semiconductors IC Semiconductor Industry Analog ASIC Mixed Signal SoC Silicon Microelectronics EDA Electronics CMOS Yield Product Engineering Failure Analysis Metrology Engineering Management Manufacturing SPC Debugging Test Engineering Microprocessors Microcontrollers RF Thin Films Design of Experiments PVD MEMS Test Equipment JMP See 15+     See less Semiconductors IC Semiconductor Industry Analog ASIC Mixed Signal SoC Silicon Microelectronics EDA Electronics CMOS Yield Product Engineering Failure Analysis Metrology Engineering Management Manufacturing SPC Debugging Test Engineering Microprocessors Microcontrollers RF Thin Films Design of Experiments PVD MEMS Test Equipment JMP See 15+     See less Semiconductors IC Semiconductor Industry Analog ASIC Mixed Signal SoC Silicon Microelectronics EDA Electronics CMOS Yield Product Engineering Failure Analysis Metrology Engineering Management Manufacturing SPC Debugging Test Engineering Microprocessors Microcontrollers RF Thin Films Design of Experiments PVD MEMS Test Equipment JMP See 15+     See less Education Eastern Illinois University 1979  – 1982 Eastern Illinois University 1979  – 1982 Eastern Illinois University 1979  – 1982 Eastern Illinois University 1979  – 1982 ", "Summary RESULT-ORIENTED PROCESS/PROJECT ENGINEER \nI enjoy leveraging my extensive, cross-functional, hands-on problem solving experience to positively impact profitability. \n \nI have demonstrated success in project, schedule and cost management with strong technical background across several engineering disciplines. I am also proud of my proven history of exceptional people skills, creating and working in team environments with customers, management, peers and vendors. I am a quick learner, adapting rapidly to changing situations and priorities. Summary RESULT-ORIENTED PROCESS/PROJECT ENGINEER \nI enjoy leveraging my extensive, cross-functional, hands-on problem solving experience to positively impact profitability. \n \nI have demonstrated success in project, schedule and cost management with strong technical background across several engineering disciplines. I am also proud of my proven history of exceptional people skills, creating and working in team environments with customers, management, peers and vendors. I am a quick learner, adapting rapidly to changing situations and priorities. RESULT-ORIENTED PROCESS/PROJECT ENGINEER \nI enjoy leveraging my extensive, cross-functional, hands-on problem solving experience to positively impact profitability. \n \nI have demonstrated success in project, schedule and cost management with strong technical background across several engineering disciplines. I am also proud of my proven history of exceptional people skills, creating and working in team environments with customers, management, peers and vendors. I am a quick learner, adapting rapidly to changing situations and priorities. RESULT-ORIENTED PROCESS/PROJECT ENGINEER \nI enjoy leveraging my extensive, cross-functional, hands-on problem solving experience to positively impact profitability. \n \nI have demonstrated success in project, schedule and cost management with strong technical background across several engineering disciplines. I am also proud of my proven history of exceptional people skills, creating and working in team environments with customers, management, peers and vendors. I am a quick learner, adapting rapidly to changing situations and priorities. Experience Sr Systems Integration Engineer BAE Systems February 2015  – Present (7 months) Hill AFB, Utah Engineering Services support for the Air Force in sustaining the Liquid Propulsion stage of the Minuteman III missile system. Configuration Engineer TSI AVIATION SEATS September 2014  –  February 2015  (6 months) Ogden, Utah Responsible for Configuration Management, Design and Production support in starting up a new Airline Seat Manufacturing facility. Process/Project Engineer Aerojet Rocketdyne 2002  –  March 2014  (12 years) Clearfield, Utah My Roles At Aerojet Rocketdyne \nPerformed process development and technical support for production issues, providing assembly and test procedures, design changes, and Support Equipment designs to improve processes. Supported inventory / material management using Oracle ERP systems. \n•Ensured quality products delivered on time by interfacing with customer and government representatives effectively as point of contact. \n•Reduced cleanroom manufacturing process time 20% as key technical lead in greenbelt project. \n•Generated new business by providing proposal support and development. \n•Ensured robust products and efficient processes through design reviews and technical data updates. \n•Supported Quality Engineering with component inspections, Root Cause Analysis, corrective actions and data collection/analysis to reduce Quality escapes and ensure product compliance. \n•Performed Safety and FME Analyses on production processes and facility equipment, ensuring safe and efficient production flows. \n•Functioned as lead engineer for design, manufacture, and qualification of over 15 pieces of automated Test and Support Equipment, enabling on-time completion of contract. Project Engineer/Manager Goodrich 2000  –  2002  (2 years) Phoenix, Arizona Area As an engineer at Goodrich I performed Project management duties as the technical liaison for $5 million in Aerospace and Satellite Pyrotechnic components. \n-Provided technical support for production issues, providing proper assembly and test procedures, failure analysis and design changes as needed for product improvement.  \n-Key technical lead in effort that incorporated single piece flow manufacturing saving 20% in process time and 10% processing costs. \n-Effectively interfaced with customers as point of contact assuring quality products delivered on time.  \n-Provided frequent project status, schedule and costing reports to senior management. \n-Provided program plans and technical inputs for new business quotes. Production Supervisor Intel Corporation 1995  –  2000  (5 years) As a Production Supervisor at Intel Corporation: \n-Supervised 15-25 highly skilled Operations and Equipment technicians in a semiconductor Fabrication plant and packaging Development line.  \n-Effectively managed all phases of staffing, ramp, high-volume manufacturing and overseas deployment of 22 new product technologies.  \n-Key player in implementing an Equipment Owner program, driving training, and establishing and maintaining Success Indicators for the group.  \n-Led Task force teams to quick resolution of numerous process and equipment issues, working closely with Technical support to deliver on time products to customers. Sr Systems Integration Engineer BAE Systems February 2015  – Present (7 months) Hill AFB, Utah Engineering Services support for the Air Force in sustaining the Liquid Propulsion stage of the Minuteman III missile system. Sr Systems Integration Engineer BAE Systems February 2015  – Present (7 months) Hill AFB, Utah Engineering Services support for the Air Force in sustaining the Liquid Propulsion stage of the Minuteman III missile system. Configuration Engineer TSI AVIATION SEATS September 2014  –  February 2015  (6 months) Ogden, Utah Responsible for Configuration Management, Design and Production support in starting up a new Airline Seat Manufacturing facility. Configuration Engineer TSI AVIATION SEATS September 2014  –  February 2015  (6 months) Ogden, Utah Responsible for Configuration Management, Design and Production support in starting up a new Airline Seat Manufacturing facility. Process/Project Engineer Aerojet Rocketdyne 2002  –  March 2014  (12 years) Clearfield, Utah My Roles At Aerojet Rocketdyne \nPerformed process development and technical support for production issues, providing assembly and test procedures, design changes, and Support Equipment designs to improve processes. Supported inventory / material management using Oracle ERP systems. \n•Ensured quality products delivered on time by interfacing with customer and government representatives effectively as point of contact. \n•Reduced cleanroom manufacturing process time 20% as key technical lead in greenbelt project. \n•Generated new business by providing proposal support and development. \n•Ensured robust products and efficient processes through design reviews and technical data updates. \n•Supported Quality Engineering with component inspections, Root Cause Analysis, corrective actions and data collection/analysis to reduce Quality escapes and ensure product compliance. \n•Performed Safety and FME Analyses on production processes and facility equipment, ensuring safe and efficient production flows. \n•Functioned as lead engineer for design, manufacture, and qualification of over 15 pieces of automated Test and Support Equipment, enabling on-time completion of contract. Process/Project Engineer Aerojet Rocketdyne 2002  –  March 2014  (12 years) Clearfield, Utah My Roles At Aerojet Rocketdyne \nPerformed process development and technical support for production issues, providing assembly and test procedures, design changes, and Support Equipment designs to improve processes. Supported inventory / material management using Oracle ERP systems. \n•Ensured quality products delivered on time by interfacing with customer and government representatives effectively as point of contact. \n•Reduced cleanroom manufacturing process time 20% as key technical lead in greenbelt project. \n•Generated new business by providing proposal support and development. \n•Ensured robust products and efficient processes through design reviews and technical data updates. \n•Supported Quality Engineering with component inspections, Root Cause Analysis, corrective actions and data collection/analysis to reduce Quality escapes and ensure product compliance. \n•Performed Safety and FME Analyses on production processes and facility equipment, ensuring safe and efficient production flows. \n•Functioned as lead engineer for design, manufacture, and qualification of over 15 pieces of automated Test and Support Equipment, enabling on-time completion of contract. Project Engineer/Manager Goodrich 2000  –  2002  (2 years) Phoenix, Arizona Area As an engineer at Goodrich I performed Project management duties as the technical liaison for $5 million in Aerospace and Satellite Pyrotechnic components. \n-Provided technical support for production issues, providing proper assembly and test procedures, failure analysis and design changes as needed for product improvement.  \n-Key technical lead in effort that incorporated single piece flow manufacturing saving 20% in process time and 10% processing costs. \n-Effectively interfaced with customers as point of contact assuring quality products delivered on time.  \n-Provided frequent project status, schedule and costing reports to senior management. \n-Provided program plans and technical inputs for new business quotes. Project Engineer/Manager Goodrich 2000  –  2002  (2 years) Phoenix, Arizona Area As an engineer at Goodrich I performed Project management duties as the technical liaison for $5 million in Aerospace and Satellite Pyrotechnic components. \n-Provided technical support for production issues, providing proper assembly and test procedures, failure analysis and design changes as needed for product improvement.  \n-Key technical lead in effort that incorporated single piece flow manufacturing saving 20% in process time and 10% processing costs. \n-Effectively interfaced with customers as point of contact assuring quality products delivered on time.  \n-Provided frequent project status, schedule and costing reports to senior management. \n-Provided program plans and technical inputs for new business quotes. Production Supervisor Intel Corporation 1995  –  2000  (5 years) As a Production Supervisor at Intel Corporation: \n-Supervised 15-25 highly skilled Operations and Equipment technicians in a semiconductor Fabrication plant and packaging Development line.  \n-Effectively managed all phases of staffing, ramp, high-volume manufacturing and overseas deployment of 22 new product technologies.  \n-Key player in implementing an Equipment Owner program, driving training, and establishing and maintaining Success Indicators for the group.  \n-Led Task force teams to quick resolution of numerous process and equipment issues, working closely with Technical support to deliver on time products to customers. Production Supervisor Intel Corporation 1995  –  2000  (5 years) As a Production Supervisor at Intel Corporation: \n-Supervised 15-25 highly skilled Operations and Equipment technicians in a semiconductor Fabrication plant and packaging Development line.  \n-Effectively managed all phases of staffing, ramp, high-volume manufacturing and overseas deployment of 22 new product technologies.  \n-Key player in implementing an Equipment Owner program, driving training, and establishing and maintaining Success Indicators for the group.  \n-Led Task force teams to quick resolution of numerous process and equipment issues, working closely with Technical support to deliver on time products to customers. Languages Mandarin Chinese Limited working proficiency Mandarin Chinese Limited working proficiency Mandarin Chinese Limited working proficiency Limited working proficiency Skills Engineering Management Manufacturing... Project Engineering Root Cause Analysis Lean Manufacturing Systems Engineering Manufacturing Operations FMEA Product Development Minitab GD&T Inventor Engineering Electrical Engineering Design for Manufacturing Automation Six Sigma DMAIC Continuous Improvement Process Simulation Value Stream Mapping SPC Aerospace Testing Quality Management Kaizen Manufacturing MS Project Quality Assurance Earned Value Management Finite Element Analysis Machine Tools Design Engineering ISO 5S Electronics Materials Design of Experiments Mechanical Engineering Pro Engineer Quality System Simulations Product Design R&D Process Engineering Solidworks Spacecraft Propulsion Space Systems See 34+     See less Skills  Engineering Management Manufacturing... Project Engineering Root Cause Analysis Lean Manufacturing Systems Engineering Manufacturing Operations FMEA Product Development Minitab GD&T Inventor Engineering Electrical Engineering Design for Manufacturing Automation Six Sigma DMAIC Continuous Improvement Process Simulation Value Stream Mapping SPC Aerospace Testing Quality Management Kaizen Manufacturing MS Project Quality Assurance Earned Value Management Finite Element Analysis Machine Tools Design Engineering ISO 5S Electronics Materials Design of Experiments Mechanical Engineering Pro Engineer Quality System Simulations Product Design R&D Process Engineering Solidworks Spacecraft Propulsion Space Systems See 34+     See less Engineering Management Manufacturing... Project Engineering Root Cause Analysis Lean Manufacturing Systems Engineering Manufacturing Operations FMEA Product Development Minitab GD&T Inventor Engineering Electrical Engineering Design for Manufacturing Automation Six Sigma DMAIC Continuous Improvement Process Simulation Value Stream Mapping SPC Aerospace Testing Quality Management Kaizen Manufacturing MS Project Quality Assurance Earned Value Management Finite Element Analysis Machine Tools Design Engineering ISO 5S Electronics Materials Design of Experiments Mechanical Engineering Pro Engineer Quality System Simulations Product Design R&D Process Engineering Solidworks Spacecraft Propulsion Space Systems See 34+     See less Engineering Management Manufacturing... Project Engineering Root Cause Analysis Lean Manufacturing Systems Engineering Manufacturing Operations FMEA Product Development Minitab GD&T Inventor Engineering Electrical Engineering Design for Manufacturing Automation Six Sigma DMAIC Continuous Improvement Process Simulation Value Stream Mapping SPC Aerospace Testing Quality Management Kaizen Manufacturing MS Project Quality Assurance Earned Value Management Finite Element Analysis Machine Tools Design Engineering ISO 5S Electronics Materials Design of Experiments Mechanical Engineering Pro Engineer Quality System Simulations Product Design R&D Process Engineering Solidworks Spacecraft Propulsion Space Systems See 34+     See less Education Brigham Young University Masters,  Engineering Management 1993  – 1994 Brigham Young University Bachelor of Science,  Mechanical Engineering 1980  – 1987 Activities and Societies:  Varsity Soccer ,  other Intramural sports ,  ASME ,  APICS ,  Barbershop Chorus Brigham Young University Masters,  Engineering Management 1993  – 1994 Brigham Young University Masters,  Engineering Management 1993  – 1994 Brigham Young University Masters,  Engineering Management 1993  – 1994 Brigham Young University Bachelor of Science,  Mechanical Engineering 1980  – 1987 Activities and Societies:  Varsity Soccer ,  other Intramural sports ,  ASME ,  APICS ,  Barbershop Chorus Brigham Young University Bachelor of Science,  Mechanical Engineering 1980  – 1987 Activities and Societies:  Varsity Soccer ,  other Intramural sports ,  ASME ,  APICS ,  Barbershop Chorus Brigham Young University Bachelor of Science,  Mechanical Engineering 1980  – 1987 Activities and Societies:  Varsity Soccer ,  other Intramural sports ,  ASME ,  APICS ,  Barbershop Chorus ", "Summary A highly positive self-motivated individual with a proven ability to build winning teams, exceed targets and deliver results while maintaining strong customer satisfaction. Enjoy being part of, as well as managing, motivating and training a successful and productive team, thriving in highly pressurised and challenging working environments. Possess excellent interpersonal, communication and negotiation skills and able to work well on own initiative. Summary A highly positive self-motivated individual with a proven ability to build winning teams, exceed targets and deliver results while maintaining strong customer satisfaction. Enjoy being part of, as well as managing, motivating and training a successful and productive team, thriving in highly pressurised and challenging working environments. Possess excellent interpersonal, communication and negotiation skills and able to work well on own initiative. A highly positive self-motivated individual with a proven ability to build winning teams, exceed targets and deliver results while maintaining strong customer satisfaction. Enjoy being part of, as well as managing, motivating and training a successful and productive team, thriving in highly pressurised and challenging working environments. Possess excellent interpersonal, communication and negotiation skills and able to work well on own initiative. A highly positive self-motivated individual with a proven ability to build winning teams, exceed targets and deliver results while maintaining strong customer satisfaction. Enjoy being part of, as well as managing, motivating and training a successful and productive team, thriving in highly pressurised and challenging working environments. Possess excellent interpersonal, communication and negotiation skills and able to work well on own initiative. Experience Customer Service Manager Minelab Metal Detectors January 2010  –  March 2014  (4 years 3 months) Little Island, Cork Managed Service Centres (both in house and off-site) to resolve queries and ensure repairs are promptly completed and returned to client. \nSupport and develop the Customer Service and Warehouse teams while achieving the assigned goals and objectives for the Europe, Middle East and Africa (EMEA) region. Electronics Engineer Minelab Metal Detectors December 2003  –  December 2009  (6 years 1 month) To support manufacturing both internal and at subcontractors, providing training on test procedure requirements for new and existing products. To liaise with the Product Development team in Australia and local subcontractors to ensure successful implementation of New Product Introductions achieving quality targets under strict timelines. Test Engineering Supervisor Flextronics July 1997  –  December 2003  (6 years 6 months) Blackpool, Cork Managing Debug and Test Engineering Technicians to ensure that all production targets were met, all shifts were supported, and all issues were highlighted in a timely manner.  \nEnsuring all maintenance was carried out on time and down time was kept to a minimum and attended daily production meetings to provide and receive feedback. Test Engineer Intel Corporation September 1995  –  July 1997  (1 year 11 months) Leixlip Responsible for introduction of new products, training Technicians and operators and measuring quality yields at all test steps. Production Supervisor Intel Corporation April 1994  –  September 1995  (1 year 6 months) Leixlip Promoted to production supervisor during a time when product number increased from 300 to 1,800 operators. At first supervising three test areas, then one full production cell, including 2 SMT lines, 1 wave solder and 1 test area. \nInvolved in all stages of recruiting, selecting, training and developing production operators. Test Techniican Intel Corporation December 1992  –  April 1994  (1 year 5 months) Leixlip Supporting production while on shift support, responsible for maintaining all on line test equipment, training of operators and Debug Technicians and assisting in any way that would help production. Technician Apple Computers June 1988  –  December 1992  (4 years 7 months) Hollyhill, Cork Hired as a debug Technician to support production lines on a range of products working closely with the production supervisors to ensure quality issues were highlighted to the source as quickly as possible. \nOn promotion to the role of Test Technician I was responsible for maintaining all on line test equipment, training of operators and Debug Technicians and assisting in any way that would help production. Customer Service Manager Minelab Metal Detectors January 2010  –  March 2014  (4 years 3 months) Little Island, Cork Managed Service Centres (both in house and off-site) to resolve queries and ensure repairs are promptly completed and returned to client. \nSupport and develop the Customer Service and Warehouse teams while achieving the assigned goals and objectives for the Europe, Middle East and Africa (EMEA) region. Customer Service Manager Minelab Metal Detectors January 2010  –  March 2014  (4 years 3 months) Little Island, Cork Managed Service Centres (both in house and off-site) to resolve queries and ensure repairs are promptly completed and returned to client. \nSupport and develop the Customer Service and Warehouse teams while achieving the assigned goals and objectives for the Europe, Middle East and Africa (EMEA) region. Electronics Engineer Minelab Metal Detectors December 2003  –  December 2009  (6 years 1 month) To support manufacturing both internal and at subcontractors, providing training on test procedure requirements for new and existing products. To liaise with the Product Development team in Australia and local subcontractors to ensure successful implementation of New Product Introductions achieving quality targets under strict timelines. Electronics Engineer Minelab Metal Detectors December 2003  –  December 2009  (6 years 1 month) To support manufacturing both internal and at subcontractors, providing training on test procedure requirements for new and existing products. To liaise with the Product Development team in Australia and local subcontractors to ensure successful implementation of New Product Introductions achieving quality targets under strict timelines. Test Engineering Supervisor Flextronics July 1997  –  December 2003  (6 years 6 months) Blackpool, Cork Managing Debug and Test Engineering Technicians to ensure that all production targets were met, all shifts were supported, and all issues were highlighted in a timely manner.  \nEnsuring all maintenance was carried out on time and down time was kept to a minimum and attended daily production meetings to provide and receive feedback. Test Engineering Supervisor Flextronics July 1997  –  December 2003  (6 years 6 months) Blackpool, Cork Managing Debug and Test Engineering Technicians to ensure that all production targets were met, all shifts were supported, and all issues were highlighted in a timely manner.  \nEnsuring all maintenance was carried out on time and down time was kept to a minimum and attended daily production meetings to provide and receive feedback. Test Engineer Intel Corporation September 1995  –  July 1997  (1 year 11 months) Leixlip Responsible for introduction of new products, training Technicians and operators and measuring quality yields at all test steps. Test Engineer Intel Corporation September 1995  –  July 1997  (1 year 11 months) Leixlip Responsible for introduction of new products, training Technicians and operators and measuring quality yields at all test steps. Production Supervisor Intel Corporation April 1994  –  September 1995  (1 year 6 months) Leixlip Promoted to production supervisor during a time when product number increased from 300 to 1,800 operators. At first supervising three test areas, then one full production cell, including 2 SMT lines, 1 wave solder and 1 test area. \nInvolved in all stages of recruiting, selecting, training and developing production operators. Production Supervisor Intel Corporation April 1994  –  September 1995  (1 year 6 months) Leixlip Promoted to production supervisor during a time when product number increased from 300 to 1,800 operators. At first supervising three test areas, then one full production cell, including 2 SMT lines, 1 wave solder and 1 test area. \nInvolved in all stages of recruiting, selecting, training and developing production operators. Test Techniican Intel Corporation December 1992  –  April 1994  (1 year 5 months) Leixlip Supporting production while on shift support, responsible for maintaining all on line test equipment, training of operators and Debug Technicians and assisting in any way that would help production. Test Techniican Intel Corporation December 1992  –  April 1994  (1 year 5 months) Leixlip Supporting production while on shift support, responsible for maintaining all on line test equipment, training of operators and Debug Technicians and assisting in any way that would help production. Technician Apple Computers June 1988  –  December 1992  (4 years 7 months) Hollyhill, Cork Hired as a debug Technician to support production lines on a range of products working closely with the production supervisors to ensure quality issues were highlighted to the source as quickly as possible. \nOn promotion to the role of Test Technician I was responsible for maintaining all on line test equipment, training of operators and Debug Technicians and assisting in any way that would help production. Technician Apple Computers June 1988  –  December 1992  (4 years 7 months) Hollyhill, Cork Hired as a debug Technician to support production lines on a range of products working closely with the production supervisors to ensure quality issues were highlighted to the source as quickly as possible. \nOn promotion to the role of Test Technician I was responsible for maintaining all on line test equipment, training of operators and Debug Technicians and assisting in any way that would help production. Education Cork Institute of Technology Honours Degree in Business,  Business , Due for completion December 2014 2013  – 2014 Cork Institute of Technology Ordinary Degree in Business Management,  Business Management , Distinction 2010  – 2012 Cork Institute of Technology Ordinary Degree in Electronic Engineering,  Electronics , Merit 1985  – 1988 Cork Institute of Technology Honours Degree in Business,  Business , Due for completion December 2014 2013  – 2014 Cork Institute of Technology Honours Degree in Business,  Business , Due for completion December 2014 2013  – 2014 Cork Institute of Technology Honours Degree in Business,  Business , Due for completion December 2014 2013  – 2014 Cork Institute of Technology Ordinary Degree in Business Management,  Business Management , Distinction 2010  – 2012 Cork Institute of Technology Ordinary Degree in Business Management,  Business Management , Distinction 2010  – 2012 Cork Institute of Technology Ordinary Degree in Business Management,  Business Management , Distinction 2010  – 2012 Cork Institute of Technology Ordinary Degree in Electronic Engineering,  Electronics , Merit 1985  – 1988 Cork Institute of Technology Ordinary Degree in Electronic Engineering,  Electronics , Merit 1985  – 1988 Cork Institute of Technology Ordinary Degree in Electronic Engineering,  Electronics , Merit 1985  – 1988 ", "Experience ISC Supervisor Honeywell September 2008  – Present (7 years) Production Supervisor Intel Corporation 1997  –  2007  (10 years) ISC Supervisor Honeywell September 2008  – Present (7 years) ISC Supervisor Honeywell September 2008  – Present (7 years) Production Supervisor Intel Corporation 1997  –  2007  (10 years) Production Supervisor Intel Corporation 1997  –  2007  (10 years) Education New Mexico State University 1990  – 1997 New Mexico State University 1990  – 1997 New Mexico State University 1990  – 1997 New Mexico State University 1990  – 1997 ", "Summary Very well versed in Production Management, Materials Procurement and Warehouse Management. \n \nI would like to use my skills and experience to Support, Improve and grow a production company. With my employee management experience and training, I will be able to motivate, challenge and reward the performing work force. Summary Very well versed in Production Management, Materials Procurement and Warehouse Management. \n \nI would like to use my skills and experience to Support, Improve and grow a production company. With my employee management experience and training, I will be able to motivate, challenge and reward the performing work force. Very well versed in Production Management, Materials Procurement and Warehouse Management. \n \nI would like to use my skills and experience to Support, Improve and grow a production company. With my employee management experience and training, I will be able to motivate, challenge and reward the performing work force. Very well versed in Production Management, Materials Procurement and Warehouse Management. \n \nI would like to use my skills and experience to Support, Improve and grow a production company. With my employee management experience and training, I will be able to motivate, challenge and reward the performing work force. Experience Materials Program Manager Intel Corporation July 2001  – Present (14 years 2 months) DuPont •\tManage the development and execution of project material plans for launch of Test Interface Units (TIU). \n•\tServe as the primary interface for all material and Bill of Materials (BOM) related issues.  \n•\tManage all strategic materials (long lead, IP sensitive, joint development, high value) for multiple key programs. \n•\tReport out to product development team and management on status of strategic material on a weekly basis. \n•\tWork with suppliers to negotiate price, lead time, PO placement, first engineering sample shipments, engineering change requests and finally production shipments of new material. \n•\tEnsure customer demand is loaded to meet requested dock dates and works within production capacity. \n•\tSupport product design efforts by working with Design Engineers and Commodity Managers to select material / components optimized for quality, cost, and availability.  \n•\tResponsible for the compiling and analysis of data against internal metrics of success: cost savings, material availability or on-time delivery, excess on hand, excess on order, and customer satisfaction. \n•\tManage vendor relationships with strategic suppliers within the commodities of machined and sheet metal parts, cables and wire assemblies, as well as add in boards. \n•\tCoordinate onsite supplier business review meetings with key suppliers along with monthly meetings to ensure seamless day-to-day operation. \n•\tCommunicate Quality issues back to suppliers and coordinate return/repair/replacement of defective material. \n•\tManaged “Second Source” efforts to identify multiple suppliers of like material to ensure supplier cost competitiveness and support material supply line business continuity. \n•\tPartner with suppliers and created tools to analyze lead times and balance them against cost to provide the customer with short lead time options. Warehouse Manager Intel Corporation June 1998  –  July 2001  (3 years 2 months) DuPont, WA •\tManage the daily warehouse operations of the raw goods warehouse in support of the Systems Manufacturing production floor. \n•\tTrack & deliver on warehouse performance indicators; Gross Unit Variance, Net Dollar Variance, Customer Service SLAs, and continuous improvement \n•\tMonitor and control spending to meet quarterly budget and headcount requirements. \n•\tStaff and manage up to 2 warehouse supervisors across a two shift operation. \n•\tEmpower staff through performance management, coaching, and employee development \n•\tManaged warehouse operations to a low GUV avg. of 0.246%, and low NDV avg. of -0.014%. \n•\tLead the warehouse team through the implementation of SAP. This included resource management in order to train each employee for over 60 hours each, supporting the concept testing efforts and redesigning all warehouse processes. Production Manager Intel Corporation January 1997  –  June 1998  (1 year 6 months) •\tManage the daily operations of the Systems Manufacturing production floor in an ISO environment \n•\tTrack & deliver on factory performance indicators; Shipments, Quality, Safety, Utilization, and continuous improvement \n•\tMonitor and control spending to meet quarterly budget. \n•\tStaff and manage 6 production supervisors, with a total of 200 Manufacturing Technicians, in the manufacturing of server and desktop systems \n•\tEmpower staff through performance management, coaching, and employee development Production Supervisor Intel Corporation January 1994  –  January 1997  (3 years 1 month) DuPont, WA •\tSupervise a team of 32+ non exempt employees to produce competitive results in Safety, Quality Productivity and Customer Service \n•\tStaff, Train, Performance Manage, and Develop employees as required \n•\tUse coaching and facilitation to empower teams to set and meet goals independently Production Supervisor Epson June 1984  –  January 1994  (9 years 8 months) Hillsboro, OR •\tSupervise the day to day activities of a 42 member team across two shifts in a machine and progressive build environment. \n•\tResponsible for 3.5 million dollars worth of capital equipment and for maintaining repair costs within budget \n•\tCreate and supervise training to fit factory needs and employee development for: Assemblers, Machine Operators, and Maintenance Technicians. \n•\tCoordinate and drove weekly meetings to convey quality results and improvement programs to Management and Engineering Materials Program Manager Intel Corporation July 2001  – Present (14 years 2 months) DuPont •\tManage the development and execution of project material plans for launch of Test Interface Units (TIU). \n•\tServe as the primary interface for all material and Bill of Materials (BOM) related issues.  \n•\tManage all strategic materials (long lead, IP sensitive, joint development, high value) for multiple key programs. \n•\tReport out to product development team and management on status of strategic material on a weekly basis. \n•\tWork with suppliers to negotiate price, lead time, PO placement, first engineering sample shipments, engineering change requests and finally production shipments of new material. \n•\tEnsure customer demand is loaded to meet requested dock dates and works within production capacity. \n•\tSupport product design efforts by working with Design Engineers and Commodity Managers to select material / components optimized for quality, cost, and availability.  \n•\tResponsible for the compiling and analysis of data against internal metrics of success: cost savings, material availability or on-time delivery, excess on hand, excess on order, and customer satisfaction. \n•\tManage vendor relationships with strategic suppliers within the commodities of machined and sheet metal parts, cables and wire assemblies, as well as add in boards. \n•\tCoordinate onsite supplier business review meetings with key suppliers along with monthly meetings to ensure seamless day-to-day operation. \n•\tCommunicate Quality issues back to suppliers and coordinate return/repair/replacement of defective material. \n•\tManaged “Second Source” efforts to identify multiple suppliers of like material to ensure supplier cost competitiveness and support material supply line business continuity. \n•\tPartner with suppliers and created tools to analyze lead times and balance them against cost to provide the customer with short lead time options. Materials Program Manager Intel Corporation July 2001  – Present (14 years 2 months) DuPont •\tManage the development and execution of project material plans for launch of Test Interface Units (TIU). \n•\tServe as the primary interface for all material and Bill of Materials (BOM) related issues.  \n•\tManage all strategic materials (long lead, IP sensitive, joint development, high value) for multiple key programs. \n•\tReport out to product development team and management on status of strategic material on a weekly basis. \n•\tWork with suppliers to negotiate price, lead time, PO placement, first engineering sample shipments, engineering change requests and finally production shipments of new material. \n•\tEnsure customer demand is loaded to meet requested dock dates and works within production capacity. \n•\tSupport product design efforts by working with Design Engineers and Commodity Managers to select material / components optimized for quality, cost, and availability.  \n•\tResponsible for the compiling and analysis of data against internal metrics of success: cost savings, material availability or on-time delivery, excess on hand, excess on order, and customer satisfaction. \n•\tManage vendor relationships with strategic suppliers within the commodities of machined and sheet metal parts, cables and wire assemblies, as well as add in boards. \n•\tCoordinate onsite supplier business review meetings with key suppliers along with monthly meetings to ensure seamless day-to-day operation. \n•\tCommunicate Quality issues back to suppliers and coordinate return/repair/replacement of defective material. \n•\tManaged “Second Source” efforts to identify multiple suppliers of like material to ensure supplier cost competitiveness and support material supply line business continuity. \n•\tPartner with suppliers and created tools to analyze lead times and balance them against cost to provide the customer with short lead time options. Warehouse Manager Intel Corporation June 1998  –  July 2001  (3 years 2 months) DuPont, WA •\tManage the daily warehouse operations of the raw goods warehouse in support of the Systems Manufacturing production floor. \n•\tTrack & deliver on warehouse performance indicators; Gross Unit Variance, Net Dollar Variance, Customer Service SLAs, and continuous improvement \n•\tMonitor and control spending to meet quarterly budget and headcount requirements. \n•\tStaff and manage up to 2 warehouse supervisors across a two shift operation. \n•\tEmpower staff through performance management, coaching, and employee development \n•\tManaged warehouse operations to a low GUV avg. of 0.246%, and low NDV avg. of -0.014%. \n•\tLead the warehouse team through the implementation of SAP. This included resource management in order to train each employee for over 60 hours each, supporting the concept testing efforts and redesigning all warehouse processes. Warehouse Manager Intel Corporation June 1998  –  July 2001  (3 years 2 months) DuPont, WA •\tManage the daily warehouse operations of the raw goods warehouse in support of the Systems Manufacturing production floor. \n•\tTrack & deliver on warehouse performance indicators; Gross Unit Variance, Net Dollar Variance, Customer Service SLAs, and continuous improvement \n•\tMonitor and control spending to meet quarterly budget and headcount requirements. \n•\tStaff and manage up to 2 warehouse supervisors across a two shift operation. \n•\tEmpower staff through performance management, coaching, and employee development \n•\tManaged warehouse operations to a low GUV avg. of 0.246%, and low NDV avg. of -0.014%. \n•\tLead the warehouse team through the implementation of SAP. This included resource management in order to train each employee for over 60 hours each, supporting the concept testing efforts and redesigning all warehouse processes. Production Manager Intel Corporation January 1997  –  June 1998  (1 year 6 months) •\tManage the daily operations of the Systems Manufacturing production floor in an ISO environment \n•\tTrack & deliver on factory performance indicators; Shipments, Quality, Safety, Utilization, and continuous improvement \n•\tMonitor and control spending to meet quarterly budget. \n•\tStaff and manage 6 production supervisors, with a total of 200 Manufacturing Technicians, in the manufacturing of server and desktop systems \n•\tEmpower staff through performance management, coaching, and employee development Production Manager Intel Corporation January 1997  –  June 1998  (1 year 6 months) •\tManage the daily operations of the Systems Manufacturing production floor in an ISO environment \n•\tTrack & deliver on factory performance indicators; Shipments, Quality, Safety, Utilization, and continuous improvement \n•\tMonitor and control spending to meet quarterly budget. \n•\tStaff and manage 6 production supervisors, with a total of 200 Manufacturing Technicians, in the manufacturing of server and desktop systems \n•\tEmpower staff through performance management, coaching, and employee development Production Supervisor Intel Corporation January 1994  –  January 1997  (3 years 1 month) DuPont, WA •\tSupervise a team of 32+ non exempt employees to produce competitive results in Safety, Quality Productivity and Customer Service \n•\tStaff, Train, Performance Manage, and Develop employees as required \n•\tUse coaching and facilitation to empower teams to set and meet goals independently Production Supervisor Intel Corporation January 1994  –  January 1997  (3 years 1 month) DuPont, WA •\tSupervise a team of 32+ non exempt employees to produce competitive results in Safety, Quality Productivity and Customer Service \n•\tStaff, Train, Performance Manage, and Develop employees as required \n•\tUse coaching and facilitation to empower teams to set and meet goals independently Production Supervisor Epson June 1984  –  January 1994  (9 years 8 months) Hillsboro, OR •\tSupervise the day to day activities of a 42 member team across two shifts in a machine and progressive build environment. \n•\tResponsible for 3.5 million dollars worth of capital equipment and for maintaining repair costs within budget \n•\tCreate and supervise training to fit factory needs and employee development for: Assemblers, Machine Operators, and Maintenance Technicians. \n•\tCoordinate and drove weekly meetings to convey quality results and improvement programs to Management and Engineering Production Supervisor Epson June 1984  –  January 1994  (9 years 8 months) Hillsboro, OR •\tSupervise the day to day activities of a 42 member team across two shifts in a machine and progressive build environment. \n•\tResponsible for 3.5 million dollars worth of capital equipment and for maintaining repair costs within budget \n•\tCreate and supervise training to fit factory needs and employee development for: Assemblers, Machine Operators, and Maintenance Technicians. \n•\tCoordinate and drove weekly meetings to convey quality results and improvement programs to Management and Engineering Languages English Native or bilingual proficiency English Native or bilingual proficiency English Native or bilingual proficiency Native or bilingual proficiency Skills Supply Chain Management Program Management Lean Manufacturing Intel Cross-functional Team... Semiconductor Industry Supply Management production Microsoft Excel Microsoft Word Microsoft Office Quality Control Supplier Sourcing program Materials Management MRP Employee Training Process Improvement Team Leadership Computer Proficiency Interviewing Skills Performance Management Performance Metrics Written & Verbal... Operations Management Strategic Sourcing See 11+     See less Skills  Supply Chain Management Program Management Lean Manufacturing Intel Cross-functional Team... Semiconductor Industry Supply Management production Microsoft Excel Microsoft Word Microsoft Office Quality Control Supplier Sourcing program Materials Management MRP Employee Training Process Improvement Team Leadership Computer Proficiency Interviewing Skills Performance Management Performance Metrics Written & Verbal... Operations Management Strategic Sourcing See 11+     See less Supply Chain Management Program Management Lean Manufacturing Intel Cross-functional Team... Semiconductor Industry Supply Management production Microsoft Excel Microsoft Word Microsoft Office Quality Control Supplier Sourcing program Materials Management MRP Employee Training Process Improvement Team Leadership Computer Proficiency Interviewing Skills Performance Management Performance Metrics Written & Verbal... Operations Management Strategic Sourcing See 11+     See less Supply Chain Management Program Management Lean Manufacturing Intel Cross-functional Team... Semiconductor Industry Supply Management production Microsoft Excel Microsoft Word Microsoft Office Quality Control Supplier Sourcing program Materials Management MRP Employee Training Process Improvement Team Leadership Computer Proficiency Interviewing Skills Performance Management Performance Metrics Written & Verbal... Operations Management Strategic Sourcing See 11+     See less Education Portland Community College New Trends in Management 1992  – 1993 Oregon Institute of Technology Electrical and Electronics Engineering 1984  – 1986 Portland Community College New Trends in Management 1992  – 1993 Portland Community College New Trends in Management 1992  – 1993 Portland Community College New Trends in Management 1992  – 1993 Oregon Institute of Technology Electrical and Electronics Engineering 1984  – 1986 Oregon Institute of Technology Electrical and Electronics Engineering 1984  – 1986 Oregon Institute of Technology Electrical and Electronics Engineering 1984  – 1986 "]}