{"position": "PTD Engineer", "company": "Intel Corporation", "profiles": ["Experience PTD Engineer Intel Corporation December 2014  – Present (9 months) Researcher KTH Royal Institute of Technology July 2014  –  November 2014  (5 months) Ph.D. student KTH | Kungliga Tekniska högskolan December 2009  –  June 2014  (4 years 7 months) PTD Engineer Intel Corporation December 2014  – Present (9 months) PTD Engineer Intel Corporation December 2014  – Present (9 months) Researcher KTH Royal Institute of Technology July 2014  –  November 2014  (5 months) Researcher KTH Royal Institute of Technology July 2014  –  November 2014  (5 months) Ph.D. student KTH | Kungliga Tekniska högskolan December 2009  –  June 2014  (4 years 7 months) Ph.D. student KTH | Kungliga Tekniska högskolan December 2009  –  June 2014  (4 years 7 months) Languages Italian Native or bilingual proficiency English Professional working proficiency Italian Native or bilingual proficiency English Professional working proficiency Italian Native or bilingual proficiency English Professional working proficiency Native or bilingual proficiency Professional working proficiency Skills 11 Semiconductors 9 Characterization 3 Silicon Carbide 3 device fabrication Skills  11 Semiconductors 9 Characterization 3 Silicon Carbide 3 device fabrication 11 Semiconductors 9 Characterization 3 Silicon Carbide 3 device fabrication 11 Semiconductors 9 Characterization 3 Silicon Carbide 3 device fabrication         Education KTH Royal Institute of Technology Doctor of Philosophy (Ph.D.),  Micro and nanoelectronics 2010  – 2014 Develpment of a SiC bipolar IC technology for high-temperature applications (up to 600°C). Università degli Studi di Napoli 'Federico II' master of science,  electronic engineering 2007  – 2009 Università degli Studi di Napoli Federico II Bachelor's degree,  Electronic engineering 2003  – 2007 KTH Royal Institute of Technology Doctor of Philosophy (Ph.D.),  Micro and nanoelectronics 2010  – 2014 Develpment of a SiC bipolar IC technology for high-temperature applications (up to 600°C). KTH Royal Institute of Technology Doctor of Philosophy (Ph.D.),  Micro and nanoelectronics 2010  – 2014 Develpment of a SiC bipolar IC technology for high-temperature applications (up to 600°C). KTH Royal Institute of Technology Doctor of Philosophy (Ph.D.),  Micro and nanoelectronics 2010  – 2014 Develpment of a SiC bipolar IC technology for high-temperature applications (up to 600°C). Università degli Studi di Napoli 'Federico II' master of science,  electronic engineering 2007  – 2009 Università degli Studi di Napoli 'Federico II' master of science,  electronic engineering 2007  – 2009 Università degli Studi di Napoli 'Federico II' master of science,  electronic engineering 2007  – 2009 Università degli Studi di Napoli Federico II Bachelor's degree,  Electronic engineering 2003  – 2007 Università degli Studi di Napoli Federico II Bachelor's degree,  Electronic engineering 2003  – 2007 Università degli Studi di Napoli Federico II Bachelor's degree,  Electronic engineering 2003  – 2007 ", "Experience PTD Engineer Intel Corporation November 2013  – Present (1 year 10 months) Hillsboro, OR Ph.D. Candidate University of Minnesota August 2008  –  October 2013  (5 years 3 months) PTD Engineer Intel Corporation November 2013  – Present (1 year 10 months) Hillsboro, OR PTD Engineer Intel Corporation November 2013  – Present (1 year 10 months) Hillsboro, OR Ph.D. Candidate University of Minnesota August 2008  –  October 2013  (5 years 3 months) Ph.D. Candidate University of Minnesota August 2008  –  October 2013  (5 years 3 months) Skills Skills     Education University of Minnesota-Twin Cities Doctor of Philosophy (Ph.D.),  Analytical Chemistry 2008  – 2013 Concordia College University of Minnesota-Twin Cities Doctor of Philosophy (Ph.D.),  Analytical Chemistry 2008  – 2013 University of Minnesota-Twin Cities Doctor of Philosophy (Ph.D.),  Analytical Chemistry 2008  – 2013 University of Minnesota-Twin Cities Doctor of Philosophy (Ph.D.),  Analytical Chemistry 2008  – 2013 Concordia College Concordia College Concordia College ", "Summary My areas of interest and expertise include engineering biomaterials for stem cell based therapies, isolation of receptor-specific oligonucleotide aptamers (SELEX), design of microspheres for controlled release of bioactive factors, siRNA based approach for gene silencing and development of expression systems for production of recombinant proteins. Specialties:HPLC, GPC, Confocal Microscopy, E-Beam evaporation, SELEX, Stem cell based therapy, Controlled release of therapeutic molecules of interest, Polyvalent inhibitors, FACS, siRNA based approach for gene silencing, PCR, qRT-PCR, Microbial and mammalian cell culture techniques, Gel Electrophoresis, ELISA, NMR, Bacterial and yeast fermentation, Comet assay and Rheology Summary My areas of interest and expertise include engineering biomaterials for stem cell based therapies, isolation of receptor-specific oligonucleotide aptamers (SELEX), design of microspheres for controlled release of bioactive factors, siRNA based approach for gene silencing and development of expression systems for production of recombinant proteins. Specialties:HPLC, GPC, Confocal Microscopy, E-Beam evaporation, SELEX, Stem cell based therapy, Controlled release of therapeutic molecules of interest, Polyvalent inhibitors, FACS, siRNA based approach for gene silencing, PCR, qRT-PCR, Microbial and mammalian cell culture techniques, Gel Electrophoresis, ELISA, NMR, Bacterial and yeast fermentation, Comet assay and Rheology My areas of interest and expertise include engineering biomaterials for stem cell based therapies, isolation of receptor-specific oligonucleotide aptamers (SELEX), design of microspheres for controlled release of bioactive factors, siRNA based approach for gene silencing and development of expression systems for production of recombinant proteins. Specialties:HPLC, GPC, Confocal Microscopy, E-Beam evaporation, SELEX, Stem cell based therapy, Controlled release of therapeutic molecules of interest, Polyvalent inhibitors, FACS, siRNA based approach for gene silencing, PCR, qRT-PCR, Microbial and mammalian cell culture techniques, Gel Electrophoresis, ELISA, NMR, Bacterial and yeast fermentation, Comet assay and Rheology My areas of interest and expertise include engineering biomaterials for stem cell based therapies, isolation of receptor-specific oligonucleotide aptamers (SELEX), design of microspheres for controlled release of bioactive factors, siRNA based approach for gene silencing and development of expression systems for production of recombinant proteins. Specialties:HPLC, GPC, Confocal Microscopy, E-Beam evaporation, SELEX, Stem cell based therapy, Controlled release of therapeutic molecules of interest, Polyvalent inhibitors, FACS, siRNA based approach for gene silencing, PCR, qRT-PCR, Microbial and mammalian cell culture techniques, Gel Electrophoresis, ELISA, NMR, Bacterial and yeast fermentation, Comet assay and Rheology Experience PTD Engineer Intel Corporation June 2011  – Present (4 years 3 months) Hillsboro, OR Ph.D. Candidate Rensselaer Polytechnic Institute August 2006  –  May 2011  (4 years 10 months) My doctoral research involves the design of novel three-dimensional matrices for encapsulation of stem cells and their influence on stem cell fate, delivery of exogenous factors to spinal cord injury site, design of polyvalent HIV inhibitors that target host receptors and siRNA based approach to prevent influenza infection. Summer intern Bristol-Myers Squibb, Syracuse, NY June 2010  –  August 2010  (3 months) Worked with Cell Culture and Fermentation Process Development team on recombinant protein production in E. coli. Teaching Assistant Rensselaer Polytechnic Institute January 2007  –  May 2007  (5 months) I supervised a batch of 20 undergraduate students in biochemistry laboratory. My duties included conducting laboratory assignments, leading discussion sessions and formulating quizzes. Research Associate Wockhardt R&D July 2004  –  July 2006  (2 years 1 month) During my stay at Wockhardt I worked with the Biotech R&D group on developing expression systems for production of different therapeutic proteins. My responsibilities included standardizing media at flask level experiments, optimizing media & substrate feeding strategies and evaluating different induction strategies for upto 20L fed-batch and semi-continuous fermentation, scaling up the fermentation processes from 20L to 1500L scale and standardizing protein folding process for various therapeutic proteins. I also had an opportunity working in a FDA approved production facility during the technology transfer from R&D to production. PTD Engineer Intel Corporation June 2011  – Present (4 years 3 months) Hillsboro, OR PTD Engineer Intel Corporation June 2011  – Present (4 years 3 months) Hillsboro, OR Ph.D. Candidate Rensselaer Polytechnic Institute August 2006  –  May 2011  (4 years 10 months) My doctoral research involves the design of novel three-dimensional matrices for encapsulation of stem cells and their influence on stem cell fate, delivery of exogenous factors to spinal cord injury site, design of polyvalent HIV inhibitors that target host receptors and siRNA based approach to prevent influenza infection. Ph.D. Candidate Rensselaer Polytechnic Institute August 2006  –  May 2011  (4 years 10 months) My doctoral research involves the design of novel three-dimensional matrices for encapsulation of stem cells and their influence on stem cell fate, delivery of exogenous factors to spinal cord injury site, design of polyvalent HIV inhibitors that target host receptors and siRNA based approach to prevent influenza infection. Summer intern Bristol-Myers Squibb, Syracuse, NY June 2010  –  August 2010  (3 months) Worked with Cell Culture and Fermentation Process Development team on recombinant protein production in E. coli. Summer intern Bristol-Myers Squibb, Syracuse, NY June 2010  –  August 2010  (3 months) Worked with Cell Culture and Fermentation Process Development team on recombinant protein production in E. coli. Teaching Assistant Rensselaer Polytechnic Institute January 2007  –  May 2007  (5 months) I supervised a batch of 20 undergraduate students in biochemistry laboratory. My duties included conducting laboratory assignments, leading discussion sessions and formulating quizzes. Teaching Assistant Rensselaer Polytechnic Institute January 2007  –  May 2007  (5 months) I supervised a batch of 20 undergraduate students in biochemistry laboratory. My duties included conducting laboratory assignments, leading discussion sessions and formulating quizzes. Research Associate Wockhardt R&D July 2004  –  July 2006  (2 years 1 month) During my stay at Wockhardt I worked with the Biotech R&D group on developing expression systems for production of different therapeutic proteins. My responsibilities included standardizing media at flask level experiments, optimizing media & substrate feeding strategies and evaluating different induction strategies for upto 20L fed-batch and semi-continuous fermentation, scaling up the fermentation processes from 20L to 1500L scale and standardizing protein folding process for various therapeutic proteins. I also had an opportunity working in a FDA approved production facility during the technology transfer from R&D to production. Research Associate Wockhardt R&D July 2004  –  July 2006  (2 years 1 month) During my stay at Wockhardt I worked with the Biotech R&D group on developing expression systems for production of different therapeutic proteins. My responsibilities included standardizing media at flask level experiments, optimizing media & substrate feeding strategies and evaluating different induction strategies for upto 20L fed-batch and semi-continuous fermentation, scaling up the fermentation processes from 20L to 1500L scale and standardizing protein folding process for various therapeutic proteins. I also had an opportunity working in a FDA approved production facility during the technology transfer from R&D to production. Languages Hindi English Bengali Hindi English Bengali Hindi English Bengali Skills Top Skills 22 Cell Culture 15 Protein Chemistry 10 Biochemistry 10 HPLC 10 Biotechnology 7 ELISA 5 PCR 5 Confocal Microscopy 3 Drug Discovery 3 Molecular Biology Akhilesh also knows about... 2 Mammalian Cell Culture 2 Technology Transfer 2 Fermentation 2 UV/Vis 2 FDA 2 Laboratory 1 Gel Electrophoresis 1 recombinant DNA... 1 Stem Cells 1 FACS 1 Biomaterials 1 Protein Purification 1 Bioinformatics 0 Microbiology 0 qPCR 0 In Vivo See 1+     See less Skills  Top Skills 22 Cell Culture 15 Protein Chemistry 10 Biochemistry 10 HPLC 10 Biotechnology 7 ELISA 5 PCR 5 Confocal Microscopy 3 Drug Discovery 3 Molecular Biology Akhilesh also knows about... 2 Mammalian Cell Culture 2 Technology Transfer 2 Fermentation 2 UV/Vis 2 FDA 2 Laboratory 1 Gel Electrophoresis 1 recombinant DNA... 1 Stem Cells 1 FACS 1 Biomaterials 1 Protein Purification 1 Bioinformatics 0 Microbiology 0 qPCR 0 In Vivo See 1+     See less Top Skills 22 Cell Culture 15 Protein Chemistry 10 Biochemistry 10 HPLC 10 Biotechnology 7 ELISA 5 PCR 5 Confocal Microscopy 3 Drug Discovery 3 Molecular Biology Akhilesh also knows about... 2 Mammalian Cell Culture 2 Technology Transfer 2 Fermentation 2 UV/Vis 2 FDA 2 Laboratory 1 Gel Electrophoresis 1 recombinant DNA... 1 Stem Cells 1 FACS 1 Biomaterials 1 Protein Purification 1 Bioinformatics 0 Microbiology 0 qPCR 0 In Vivo See 1+     See less Top Skills 22 Cell Culture 15 Protein Chemistry 10 Biochemistry 10 HPLC 10 Biotechnology 7 ELISA 5 PCR 5 Confocal Microscopy 3 Drug Discovery 3 Molecular Biology Akhilesh also knows about... 2 Mammalian Cell Culture 2 Technology Transfer 2 Fermentation 2 UV/Vis 2 FDA 2 Laboratory 1 Gel Electrophoresis 1 recombinant DNA... 1 Stem Cells 1 FACS 1 Biomaterials 1 Protein Purification 1 Bioinformatics 0 Microbiology 0 qPCR 0 In Vivo See 1+     See less                     2 Mammalian Cell Culture 2 Technology Transfer 2 Fermentation 2 UV/Vis 2 FDA 2 Laboratory 1 Gel Electrophoresis 1 recombinant DNA... 1 Stem Cells 1 FACS 1 Biomaterials 1 Protein Purification 1 Bioinformatics 0 Microbiology 0 qPCR 0 In Vivo Education Rensselaer Polytechnic Institute PhD,  Chemical Engineering 2006  – 2011 My doctoral thesis revolves around stem-cell related research and drug discovery. First part of my research involves the design of novel 3-D matrices for encapsulation of stem cells and studying their influence on stem cell fate and delivery of exogenous factors to spinal cord injury site. The second part of my research deals with designing polyvalent inhibitors of HIV and siRNA-based approach to prevent influenza virus infection and transmission. Birla Institute of Technology and Science MS,  Biotechnology 2002  – 2004 While pursuing MS degree, I also had an opportunity to do graduate internship at Industrial Toxiology Research Center, India, a Council of Scientific and Industrial Research(CSIR) Laboratory. There I worked as a graduate research assistant on in vivo genotoxicity assessment of cypermethrin in mice using Comet assay.The study described the genotoxic effects of cypermethrin, a synthetic pyrethroid; a broad spectrum, non-cumulative insecticide; and, a fast-acting neurotoxin on multiple organs of mice using comet assay and micronucleus assay.The study had for the first time provided a comparative measurement of genotoxicity of cypermethrin on multiple organs of mice using comet assay. Birla Institute of Technology and Science M.E., B.E.,  Biotechnology ,  Chemical Engineering 1998  – 2004 M.E. Biotechnology Birla Institute of Technology and Science B.E.,  Chemical Engineering 1998  – 2002 B.E. (Hons.) Chemical Engineering Activities and Societies:  Served as an executive member of co-ordination committee for the Chemical Engineering Exhibition in APOGEE 1999-2001 ,  anannual tech-fest at BITS-Pilani ,  Member of the BITS soccer team that participated in BITS Open Sports Meet. Rensselaer Polytechnic Institute PhD,  Chemical Engineering 2006  – 2011 My doctoral thesis revolves around stem-cell related research and drug discovery. First part of my research involves the design of novel 3-D matrices for encapsulation of stem cells and studying their influence on stem cell fate and delivery of exogenous factors to spinal cord injury site. The second part of my research deals with designing polyvalent inhibitors of HIV and siRNA-based approach to prevent influenza virus infection and transmission. Rensselaer Polytechnic Institute PhD,  Chemical Engineering 2006  – 2011 My doctoral thesis revolves around stem-cell related research and drug discovery. First part of my research involves the design of novel 3-D matrices for encapsulation of stem cells and studying their influence on stem cell fate and delivery of exogenous factors to spinal cord injury site. The second part of my research deals with designing polyvalent inhibitors of HIV and siRNA-based approach to prevent influenza virus infection and transmission. Rensselaer Polytechnic Institute PhD,  Chemical Engineering 2006  – 2011 My doctoral thesis revolves around stem-cell related research and drug discovery. First part of my research involves the design of novel 3-D matrices for encapsulation of stem cells and studying their influence on stem cell fate and delivery of exogenous factors to spinal cord injury site. The second part of my research deals with designing polyvalent inhibitors of HIV and siRNA-based approach to prevent influenza virus infection and transmission. Birla Institute of Technology and Science MS,  Biotechnology 2002  – 2004 While pursuing MS degree, I also had an opportunity to do graduate internship at Industrial Toxiology Research Center, India, a Council of Scientific and Industrial Research(CSIR) Laboratory. There I worked as a graduate research assistant on in vivo genotoxicity assessment of cypermethrin in mice using Comet assay.The study described the genotoxic effects of cypermethrin, a synthetic pyrethroid; a broad spectrum, non-cumulative insecticide; and, a fast-acting neurotoxin on multiple organs of mice using comet assay and micronucleus assay.The study had for the first time provided a comparative measurement of genotoxicity of cypermethrin on multiple organs of mice using comet assay. Birla Institute of Technology and Science MS,  Biotechnology 2002  – 2004 While pursuing MS degree, I also had an opportunity to do graduate internship at Industrial Toxiology Research Center, India, a Council of Scientific and Industrial Research(CSIR) Laboratory. There I worked as a graduate research assistant on in vivo genotoxicity assessment of cypermethrin in mice using Comet assay.The study described the genotoxic effects of cypermethrin, a synthetic pyrethroid; a broad spectrum, non-cumulative insecticide; and, a fast-acting neurotoxin on multiple organs of mice using comet assay and micronucleus assay.The study had for the first time provided a comparative measurement of genotoxicity of cypermethrin on multiple organs of mice using comet assay. Birla Institute of Technology and Science MS,  Biotechnology 2002  – 2004 While pursuing MS degree, I also had an opportunity to do graduate internship at Industrial Toxiology Research Center, India, a Council of Scientific and Industrial Research(CSIR) Laboratory. There I worked as a graduate research assistant on in vivo genotoxicity assessment of cypermethrin in mice using Comet assay.The study described the genotoxic effects of cypermethrin, a synthetic pyrethroid; a broad spectrum, non-cumulative insecticide; and, a fast-acting neurotoxin on multiple organs of mice using comet assay and micronucleus assay.The study had for the first time provided a comparative measurement of genotoxicity of cypermethrin on multiple organs of mice using comet assay. Birla Institute of Technology and Science M.E., B.E.,  Biotechnology ,  Chemical Engineering 1998  – 2004 M.E. Biotechnology Birla Institute of Technology and Science M.E., B.E.,  Biotechnology ,  Chemical Engineering 1998  – 2004 M.E. Biotechnology Birla Institute of Technology and Science M.E., B.E.,  Biotechnology ,  Chemical Engineering 1998  – 2004 M.E. Biotechnology Birla Institute of Technology and Science B.E.,  Chemical Engineering 1998  – 2002 B.E. (Hons.) Chemical Engineering Activities and Societies:  Served as an executive member of co-ordination committee for the Chemical Engineering Exhibition in APOGEE 1999-2001 ,  anannual tech-fest at BITS-Pilani ,  Member of the BITS soccer team that participated in BITS Open Sports Meet. Birla Institute of Technology and Science B.E.,  Chemical Engineering 1998  – 2002 B.E. (Hons.) Chemical Engineering Activities and Societies:  Served as an executive member of co-ordination committee for the Chemical Engineering Exhibition in APOGEE 1999-2001 ,  anannual tech-fest at BITS-Pilani ,  Member of the BITS soccer team that participated in BITS Open Sports Meet. Birla Institute of Technology and Science B.E.,  Chemical Engineering 1998  – 2002 B.E. (Hons.) Chemical Engineering Activities and Societies:  Served as an executive member of co-ordination committee for the Chemical Engineering Exhibition in APOGEE 1999-2001 ,  anannual tech-fest at BITS-Pilani ,  Member of the BITS soccer team that participated in BITS Open Sports Meet. Honors & Awards Additional Honors & Awards Philip A. Groll Mentor Award, Rensselaer Polytechnic Institute, 2010 \nFounders Award of Excellence, Rensselaer Polytechnic Institute, 2009 \nHoward P. Isermann Fellowship, Rensselaer Polytechnic Institute, Fall 2006 \nBITS Merit Fellowship, 1998, 1999, 2000, 2001 \nState Scholarship for meritorious performance in 10th and 12th standards, 1996 and 1998 Additional Honors & Awards Philip A. Groll Mentor Award, Rensselaer Polytechnic Institute, 2010 \nFounders Award of Excellence, Rensselaer Polytechnic Institute, 2009 \nHoward P. Isermann Fellowship, Rensselaer Polytechnic Institute, Fall 2006 \nBITS Merit Fellowship, 1998, 1999, 2000, 2001 \nState Scholarship for meritorious performance in 10th and 12th standards, 1996 and 1998 Additional Honors & Awards Philip A. Groll Mentor Award, Rensselaer Polytechnic Institute, 2010 \nFounders Award of Excellence, Rensselaer Polytechnic Institute, 2009 \nHoward P. Isermann Fellowship, Rensselaer Polytechnic Institute, Fall 2006 \nBITS Merit Fellowship, 1998, 1999, 2000, 2001 \nState Scholarship for meritorious performance in 10th and 12th standards, 1996 and 1998 Additional Honors & Awards Philip A. Groll Mentor Award, Rensselaer Polytechnic Institute, 2010 \nFounders Award of Excellence, Rensselaer Polytechnic Institute, 2009 \nHoward P. Isermann Fellowship, Rensselaer Polytechnic Institute, Fall 2006 \nBITS Merit Fellowship, 1998, 1999, 2000, 2001 \nState Scholarship for meritorious performance in 10th and 12th standards, 1996 and 1998 ", "Experience PTD Engineer Intel Corporation July 2013  – Present (2 years 2 months) Hillsboro, OR Top-Secret.............Only Need-To-Know basis (Open) 1 honor or award Divisional Award Divisional Award for Outstanding Contribution towards development of eDRAM development View PhD Candidate Georgia Institute of Technology August 2009  –  May 2013  (3 years 10 months) Atlanta, GA Advanced fabrication and patterning of multifunctional ceramic and metallic materials at nano, micro and macro length scales with tailored sacrificial photomodifiable soft material systems acting as composite carriers, and spatial resolution enhancing agents. (Open) 4 honors and awards Honorable mention: Gallery of 2013 TMS Micrograph Project entries SEM micrograph was selected as a honorable mention in the TMS micrograph project entries View Best Student Paper Presentation Award (2nd position) View Best Poster Presentation Award View F11FF NSF Travel Scholarship Award Travel scholarship award recipient for the MRS conference in Boston, Massachusetts View R&D Intern 3M May 2012  –  August 2012  (4 months) Saint Paul, Minnesota Synthesis and bio-analysis of fluorescing organic molecules for the rapid detection of E-Coli and Coliform micro-organisms. The as-synthesized carbohydrate-modified fluorescing organic molecules display increased fluorescence intensity with optimal absorption coefficients at the emission maxima of conventional UV light sources. Teaching Research Assistantship Bowling Green State University August 2008  –  July 2009  (1 year) Internship Moscow State Oil Refinery February 2008  –  March 2008  (2 months) PTD Engineer Intel Corporation July 2013  – Present (2 years 2 months) Hillsboro, OR Top-Secret.............Only Need-To-Know basis (Open) 1 honor or award Divisional Award Divisional Award for Outstanding Contribution towards development of eDRAM development View PTD Engineer Intel Corporation July 2013  – Present (2 years 2 months) Hillsboro, OR Top-Secret.............Only Need-To-Know basis (Open) 1 honor or award Divisional Award Divisional Award for Outstanding Contribution towards development of eDRAM development View PhD Candidate Georgia Institute of Technology August 2009  –  May 2013  (3 years 10 months) Atlanta, GA Advanced fabrication and patterning of multifunctional ceramic and metallic materials at nano, micro and macro length scales with tailored sacrificial photomodifiable soft material systems acting as composite carriers, and spatial resolution enhancing agents. (Open) 4 honors and awards Honorable mention: Gallery of 2013 TMS Micrograph Project entries SEM micrograph was selected as a honorable mention in the TMS micrograph project entries View Best Student Paper Presentation Award (2nd position) View Best Poster Presentation Award View F11FF NSF Travel Scholarship Award Travel scholarship award recipient for the MRS conference in Boston, Massachusetts View PhD Candidate Georgia Institute of Technology August 2009  –  May 2013  (3 years 10 months) Atlanta, GA Advanced fabrication and patterning of multifunctional ceramic and metallic materials at nano, micro and macro length scales with tailored sacrificial photomodifiable soft material systems acting as composite carriers, and spatial resolution enhancing agents. (Open) 4 honors and awards Honorable mention: Gallery of 2013 TMS Micrograph Project entries SEM micrograph was selected as a honorable mention in the TMS micrograph project entries View Best Student Paper Presentation Award (2nd position) View Best Poster Presentation Award View F11FF NSF Travel Scholarship Award Travel scholarship award recipient for the MRS conference in Boston, Massachusetts View R&D Intern 3M May 2012  –  August 2012  (4 months) Saint Paul, Minnesota Synthesis and bio-analysis of fluorescing organic molecules for the rapid detection of E-Coli and Coliform micro-organisms. The as-synthesized carbohydrate-modified fluorescing organic molecules display increased fluorescence intensity with optimal absorption coefficients at the emission maxima of conventional UV light sources. R&D Intern 3M May 2012  –  August 2012  (4 months) Saint Paul, Minnesota Synthesis and bio-analysis of fluorescing organic molecules for the rapid detection of E-Coli and Coliform micro-organisms. The as-synthesized carbohydrate-modified fluorescing organic molecules display increased fluorescence intensity with optimal absorption coefficients at the emission maxima of conventional UV light sources. Teaching Research Assistantship Bowling Green State University August 2008  –  July 2009  (1 year) Teaching Research Assistantship Bowling Green State University August 2008  –  July 2009  (1 year) Internship Moscow State Oil Refinery February 2008  –  March 2008  (2 months) Internship Moscow State Oil Refinery February 2008  –  March 2008  (2 months) Languages English Native or bilingual proficiency Russian Full professional proficiency English Native or bilingual proficiency Russian Full professional proficiency English Native or bilingual proficiency Russian Full professional proficiency Native or bilingual proficiency Full professional proficiency Skills Top Skills 27 Scanning Electron... 23 Materials Science 18 Characterization 17 AFM 12 Nanotechnology 10 Matlab 8 Polymers 7 Nanomaterials 7 Powder X-ray Diffraction 7 Spectroscopy Raphael Taiwo also knows about... 5 Thin Films 5 Design of Experiments 4 Chemistry 3 Materials 3 Photolithography 3 Biomaterials 3 UV/Vis 2 XRD 2 XPS 1 UV-Vis 1 TGA, DSC 1 HTML 1 Mathematica 1 Labview 1 SolidWorks 0 TGA 0 Solidworks 0 SEM 0 Fluorescence Microscopy 0 LaTeX See 5+     See less Skills  Top Skills 27 Scanning Electron... 23 Materials Science 18 Characterization 17 AFM 12 Nanotechnology 10 Matlab 8 Polymers 7 Nanomaterials 7 Powder X-ray Diffraction 7 Spectroscopy Raphael Taiwo also knows about... 5 Thin Films 5 Design of Experiments 4 Chemistry 3 Materials 3 Photolithography 3 Biomaterials 3 UV/Vis 2 XRD 2 XPS 1 UV-Vis 1 TGA, DSC 1 HTML 1 Mathematica 1 Labview 1 SolidWorks 0 TGA 0 Solidworks 0 SEM 0 Fluorescence Microscopy 0 LaTeX See 5+     See less Top Skills 27 Scanning Electron... 23 Materials Science 18 Characterization 17 AFM 12 Nanotechnology 10 Matlab 8 Polymers 7 Nanomaterials 7 Powder X-ray Diffraction 7 Spectroscopy Raphael Taiwo also knows about... 5 Thin Films 5 Design of Experiments 4 Chemistry 3 Materials 3 Photolithography 3 Biomaterials 3 UV/Vis 2 XRD 2 XPS 1 UV-Vis 1 TGA, DSC 1 HTML 1 Mathematica 1 Labview 1 SolidWorks 0 TGA 0 Solidworks 0 SEM 0 Fluorescence Microscopy 0 LaTeX See 5+     See less Top Skills 27 Scanning Electron... 23 Materials Science 18 Characterization 17 AFM 12 Nanotechnology 10 Matlab 8 Polymers 7 Nanomaterials 7 Powder X-ray Diffraction 7 Spectroscopy Raphael Taiwo also knows about... 5 Thin Films 5 Design of Experiments 4 Chemistry 3 Materials 3 Photolithography 3 Biomaterials 3 UV/Vis 2 XRD 2 XPS 1 UV-Vis 1 TGA, DSC 1 HTML 1 Mathematica 1 Labview 1 SolidWorks 0 TGA 0 Solidworks 0 SEM 0 Fluorescence Microscopy 0 LaTeX See 5+     See less                     5 Thin Films 5 Design of Experiments 4 Chemistry 3 Materials 3 Photolithography 3 Biomaterials 3 UV/Vis 2 XRD 2 XPS 1 UV-Vis 1 TGA, DSC 1 HTML 1 Mathematica 1 Labview 1 SolidWorks 0 TGA 0 Solidworks 0 SEM 0 Fluorescence Microscopy 0 LaTeX Education Georgia Institute of Technology Doctor of Philosophy (PhD),  Materials Science & Engineering (minors: Chemistry and Materials) 2009  – 2012 Activities and Societies:  GSAG (Graduate Student Advisory Group)- Materials Science and Engineering Mendeleyev University of Chemical Technology of Russia Bachelors of Science Degree,  Chemical Engineering and Biotechnology 2005  – 2008 (Open) 2 honors and awards First Class Honors degree View Bilateral Educational Agreement Scholarship Award View NIIT Sun Java Architect,  Java Programming 2007  – 2007 Web page design using HTML (Hyper text markup language), DHTML, JavaScript, JAVA, JDBC, EJB (Enterprise Java Beans) etc Bowling Green State University LSMC Meiran (Open) 1 honor or award Best Science Student Award View Georgia Institute of Technology Doctor of Philosophy (PhD),  Materials Science & Engineering (minors: Chemistry and Materials) 2009  – 2012 Activities and Societies:  GSAG (Graduate Student Advisory Group)- Materials Science and Engineering Georgia Institute of Technology Doctor of Philosophy (PhD),  Materials Science & Engineering (minors: Chemistry and Materials) 2009  – 2012 Activities and Societies:  GSAG (Graduate Student Advisory Group)- Materials Science and Engineering Georgia Institute of Technology Doctor of Philosophy (PhD),  Materials Science & Engineering (minors: Chemistry and Materials) 2009  – 2012 Activities and Societies:  GSAG (Graduate Student Advisory Group)- Materials Science and Engineering Mendeleyev University of Chemical Technology of Russia Bachelors of Science Degree,  Chemical Engineering and Biotechnology 2005  – 2008 (Open) 2 honors and awards First Class Honors degree View Bilateral Educational Agreement Scholarship Award View Mendeleyev University of Chemical Technology of Russia Bachelors of Science Degree,  Chemical Engineering and Biotechnology 2005  – 2008 (Open) 2 honors and awards First Class Honors degree View Bilateral Educational Agreement Scholarship Award View Mendeleyev University of Chemical Technology of Russia Bachelors of Science Degree,  Chemical Engineering and Biotechnology 2005  – 2008 (Open) 2 honors and awards First Class Honors degree View Bilateral Educational Agreement Scholarship Award View NIIT Sun Java Architect,  Java Programming 2007  – 2007 Web page design using HTML (Hyper text markup language), DHTML, JavaScript, JAVA, JDBC, EJB (Enterprise Java Beans) etc NIIT Sun Java Architect,  Java Programming 2007  – 2007 Web page design using HTML (Hyper text markup language), DHTML, JavaScript, JAVA, JDBC, EJB (Enterprise Java Beans) etc NIIT Sun Java Architect,  Java Programming 2007  – 2007 Web page design using HTML (Hyper text markup language), DHTML, JavaScript, JAVA, JDBC, EJB (Enterprise Java Beans) etc Bowling Green State University Bowling Green State University Bowling Green State University LSMC Meiran (Open) 1 honor or award Best Science Student Award View LSMC Meiran (Open) 1 honor or award Best Science Student Award View LSMC Meiran (Open) 1 honor or award Best Science Student Award View Honors & Awards Honorable mention: Gallery of 2013 TMS Micrograph Project entries TMS August 2013 SEM micrograph was selected as a honorable mention in the TMS micrograph project entries Best Student Paper Presentation Award (2nd position) TMS April 2012 Best Poster Presentation Award Georgia Tech Graduate Technical Symposium (GT^2) March 2012 F11FF NSF Travel Scholarship Award MRS December 2011 Travel scholarship award recipient for the MRS conference in Boston, Massachusetts First Class Honors degree Mendeleyeev University of Chemical Engineering July 2008 Best Science Student Award LSMC Meiran 2001 Bilateral Educational Agreement Scholarship Award Russian/Nigerian Governments 2002 Divisional Award Intel Corporation October 2014 Divisional Award for Outstanding Contribution towards development of eDRAM development Honorable mention: Gallery of 2013 TMS Micrograph Project entries TMS August 2013 SEM micrograph was selected as a honorable mention in the TMS micrograph project entries Honorable mention: Gallery of 2013 TMS Micrograph Project entries TMS August 2013 SEM micrograph was selected as a honorable mention in the TMS micrograph project entries Honorable mention: Gallery of 2013 TMS Micrograph Project entries TMS August 2013 SEM micrograph was selected as a honorable mention in the TMS micrograph project entries Best Student Paper Presentation Award (2nd position) TMS April 2012 Best Student Paper Presentation Award (2nd position) TMS April 2012 Best Student Paper Presentation Award (2nd position) TMS April 2012 Best Poster Presentation Award Georgia Tech Graduate Technical Symposium (GT^2) March 2012 Best Poster Presentation Award Georgia Tech Graduate Technical Symposium (GT^2) March 2012 Best Poster Presentation Award Georgia Tech Graduate Technical Symposium (GT^2) March 2012 F11FF NSF Travel Scholarship Award MRS December 2011 Travel scholarship award recipient for the MRS conference in Boston, Massachusetts F11FF NSF Travel Scholarship Award MRS December 2011 Travel scholarship award recipient for the MRS conference in Boston, Massachusetts F11FF NSF Travel Scholarship Award MRS December 2011 Travel scholarship award recipient for the MRS conference in Boston, Massachusetts First Class Honors degree Mendeleyeev University of Chemical Engineering July 2008 First Class Honors degree Mendeleyeev University of Chemical Engineering July 2008 First Class Honors degree Mendeleyeev University of Chemical Engineering July 2008 Best Science Student Award LSMC Meiran 2001 Best Science Student Award LSMC Meiran 2001 Best Science Student Award LSMC Meiran 2001 Bilateral Educational Agreement Scholarship Award Russian/Nigerian Governments 2002 Bilateral Educational Agreement Scholarship Award Russian/Nigerian Governments 2002 Bilateral Educational Agreement Scholarship Award Russian/Nigerian Governments 2002 Divisional Award Intel Corporation October 2014 Divisional Award for Outstanding Contribution towards development of eDRAM development Divisional Award Intel Corporation October 2014 Divisional Award for Outstanding Contribution towards development of eDRAM development Divisional Award Intel Corporation October 2014 Divisional Award for Outstanding Contribution towards development of eDRAM development ", "Summary The Purdue ChE Solar Group 39th IEEE Performance at the 39th Photovoltaic Specialists Conference Edit CZTSSe solar cell shows realistic potential for commercialization Edit Researchers improve efficiency of low-cost solar cells Edit Purdue engineer gets top innovation honor Edit Summary The Purdue ChE Solar Group 39th IEEE Performance at the 39th Photovoltaic Specialists Conference Edit CZTSSe solar cell shows realistic potential for commercialization Edit Researchers improve efficiency of low-cost solar cells Edit Purdue engineer gets top innovation honor Edit   The Purdue ChE Solar Group 39th IEEE Performance at the 39th Photovoltaic Specialists Conference Edit CZTSSe solar cell shows realistic potential for commercialization Edit Researchers improve efficiency of low-cost solar cells Edit Purdue engineer gets top innovation honor Edit The Purdue ChE Solar Group 39th IEEE Performance at the 39th Photovoltaic Specialists Conference Edit CZTSSe solar cell shows realistic potential for commercialization Edit The Purdue ChE Solar Group 39th IEEE Performance at the 39th Photovoltaic Specialists Conference Edit The Purdue ChE Solar Group 39th IEEE Performance at the 39th Photovoltaic Specialists Conference  The Purdue ChE Solar Group 39th IEEE Performance at the 39th Photovoltaic Specialists Conference  CZTSSe solar cell shows realistic potential for commercialization Edit CZTSSe solar cell shows realistic potential for commercialization  CZTSSe solar cell shows realistic potential for commercialization  Researchers improve efficiency of low-cost solar cells Edit Purdue engineer gets top innovation honor Edit Researchers improve efficiency of low-cost solar cells Edit Researchers improve efficiency of low-cost solar cells  Researchers improve efficiency of low-cost solar cells  Purdue engineer gets top innovation honor Edit Purdue engineer gets top innovation honor  Purdue engineer gets top innovation honor  Experience Portland Technology Development Engineer Intel Corporation August 2014  – Present (1 year 1 month) Postdoctoral Fellow Purdue University March 2014  –  August 2014  (6 months) Graduate Research Assistant Purdue University August 2009  –  February 2014  (4 years 7 months) Low-cost photovoltaics from nanomaterials utilizing liquid deposition techniques \nFirst lab safety administrator April 2011-July 2012 \nDeveloped safety instruction, methods for communicating safety concerns, and lab safety manual \nSenior lab member since May 2011 \nResponsible for training, mentoring, and overseeing other grad students, postdoctoral researchers, and undergraduate students \nAssisted in writing research grant proposals (Open) 2 honors and awards Shreve Travel Award Scholarship grant to present research at national AIChE conference View Travel Grant Travel grant to present research at national MRS conference View Undergraduate Research Assistant Brigham Young University December 2005  –  August 2009  (3 years 9 months) Reducing cost, improving performance, and increasing energy density of lithium ion batteries \nResearched conductive polymers (polypyrrole), lithium-ion cathodes, ionic conductivity/diffusivity in lithium-ion cathodes and separators, solid state conductivity in lithium-ion cells, and microbattery fabrication \nCombined experimental techniques with computer modeling to predict and show improvement capabilities Chemical Engineer Intern Excellence to Market May 2008  –  September 2008  (5 months) Engineering consultant assisting in the development of carbon black and continuous \"green\" coke from coal processing. Regional Sales Representative SuperTrees January 2006  –  2007  (1 year) Greater Salt Lake City Area Portland Technology Development Engineer Intel Corporation August 2014  – Present (1 year 1 month) Portland Technology Development Engineer Intel Corporation August 2014  – Present (1 year 1 month) Postdoctoral Fellow Purdue University March 2014  –  August 2014  (6 months) Postdoctoral Fellow Purdue University March 2014  –  August 2014  (6 months) Graduate Research Assistant Purdue University August 2009  –  February 2014  (4 years 7 months) Low-cost photovoltaics from nanomaterials utilizing liquid deposition techniques \nFirst lab safety administrator April 2011-July 2012 \nDeveloped safety instruction, methods for communicating safety concerns, and lab safety manual \nSenior lab member since May 2011 \nResponsible for training, mentoring, and overseeing other grad students, postdoctoral researchers, and undergraduate students \nAssisted in writing research grant proposals (Open) 2 honors and awards Shreve Travel Award Scholarship grant to present research at national AIChE conference View Travel Grant Travel grant to present research at national MRS conference View Graduate Research Assistant Purdue University August 2009  –  February 2014  (4 years 7 months) Low-cost photovoltaics from nanomaterials utilizing liquid deposition techniques \nFirst lab safety administrator April 2011-July 2012 \nDeveloped safety instruction, methods for communicating safety concerns, and lab safety manual \nSenior lab member since May 2011 \nResponsible for training, mentoring, and overseeing other grad students, postdoctoral researchers, and undergraduate students \nAssisted in writing research grant proposals (Open) 2 honors and awards Shreve Travel Award Scholarship grant to present research at national AIChE conference View Travel Grant Travel grant to present research at national MRS conference View Undergraduate Research Assistant Brigham Young University December 2005  –  August 2009  (3 years 9 months) Reducing cost, improving performance, and increasing energy density of lithium ion batteries \nResearched conductive polymers (polypyrrole), lithium-ion cathodes, ionic conductivity/diffusivity in lithium-ion cathodes and separators, solid state conductivity in lithium-ion cells, and microbattery fabrication \nCombined experimental techniques with computer modeling to predict and show improvement capabilities Undergraduate Research Assistant Brigham Young University December 2005  –  August 2009  (3 years 9 months) Reducing cost, improving performance, and increasing energy density of lithium ion batteries \nResearched conductive polymers (polypyrrole), lithium-ion cathodes, ionic conductivity/diffusivity in lithium-ion cathodes and separators, solid state conductivity in lithium-ion cells, and microbattery fabrication \nCombined experimental techniques with computer modeling to predict and show improvement capabilities Chemical Engineer Intern Excellence to Market May 2008  –  September 2008  (5 months) Engineering consultant assisting in the development of carbon black and continuous \"green\" coke from coal processing. Chemical Engineer Intern Excellence to Market May 2008  –  September 2008  (5 months) Engineering consultant assisting in the development of carbon black and continuous \"green\" coke from coal processing. Regional Sales Representative SuperTrees January 2006  –  2007  (1 year) Greater Salt Lake City Area Regional Sales Representative SuperTrees January 2006  –  2007  (1 year) Greater Salt Lake City Area Languages English Native or bilingual proficiency English Native or bilingual proficiency English Native or bilingual proficiency Native or bilingual proficiency Skills Top Skills 17 Chemical Engineering 13 Nanomaterials 12 Scanning Electron... 9 Powder X-ray Diffraction 9 Characterization 7 Nanotechnology 5 Materials Science 5 Matlab 4 Electrochemistry 3 Experimentation Bryce also knows about... 2 Chemistry 2 Spectroscopy 1 Thermodynamics 1 Mathematica 1 Nanoparticles 1 Engineering 0 Solid State... 0 Fortran 0 UV/Vis 0 COMSOL 0 POVRay 0 LaTeX 0 Thin Films 0 FTIR 0 Design of Experiments 0 Photolithography 0 Research 0 Microsoft Office 0 Data Analysis 0 Simulations 0 R&D 0 LabVIEW 0 Process Engineering 0 Process Simulation 0 Mathematical Modeling 0 Microsoft Excel See 11+     See less Skills  Top Skills 17 Chemical Engineering 13 Nanomaterials 12 Scanning Electron... 9 Powder X-ray Diffraction 9 Characterization 7 Nanotechnology 5 Materials Science 5 Matlab 4 Electrochemistry 3 Experimentation Bryce also knows about... 2 Chemistry 2 Spectroscopy 1 Thermodynamics 1 Mathematica 1 Nanoparticles 1 Engineering 0 Solid State... 0 Fortran 0 UV/Vis 0 COMSOL 0 POVRay 0 LaTeX 0 Thin Films 0 FTIR 0 Design of Experiments 0 Photolithography 0 Research 0 Microsoft Office 0 Data Analysis 0 Simulations 0 R&D 0 LabVIEW 0 Process Engineering 0 Process Simulation 0 Mathematical Modeling 0 Microsoft Excel See 11+     See less Top Skills 17 Chemical Engineering 13 Nanomaterials 12 Scanning Electron... 9 Powder X-ray Diffraction 9 Characterization 7 Nanotechnology 5 Materials Science 5 Matlab 4 Electrochemistry 3 Experimentation Bryce also knows about... 2 Chemistry 2 Spectroscopy 1 Thermodynamics 1 Mathematica 1 Nanoparticles 1 Engineering 0 Solid State... 0 Fortran 0 UV/Vis 0 COMSOL 0 POVRay 0 LaTeX 0 Thin Films 0 FTIR 0 Design of Experiments 0 Photolithography 0 Research 0 Microsoft Office 0 Data Analysis 0 Simulations 0 R&D 0 LabVIEW 0 Process Engineering 0 Process Simulation 0 Mathematical Modeling 0 Microsoft Excel See 11+     See less Top Skills 17 Chemical Engineering 13 Nanomaterials 12 Scanning Electron... 9 Powder X-ray Diffraction 9 Characterization 7 Nanotechnology 5 Materials Science 5 Matlab 4 Electrochemistry 3 Experimentation Bryce also knows about... 2 Chemistry 2 Spectroscopy 1 Thermodynamics 1 Mathematica 1 Nanoparticles 1 Engineering 0 Solid State... 0 Fortran 0 UV/Vis 0 COMSOL 0 POVRay 0 LaTeX 0 Thin Films 0 FTIR 0 Design of Experiments 0 Photolithography 0 Research 0 Microsoft Office 0 Data Analysis 0 Simulations 0 R&D 0 LabVIEW 0 Process Engineering 0 Process Simulation 0 Mathematical Modeling 0 Microsoft Excel See 11+     See less                     2 Chemistry 2 Spectroscopy 1 Thermodynamics 1 Mathematica 1 Nanoparticles 1 Engineering 0 Solid State... 0 Fortran 0 UV/Vis 0 COMSOL 0 POVRay 0 LaTeX 0 Thin Films 0 FTIR 0 Design of Experiments 0 Photolithography 0 Research 0 Microsoft Office 0 Data Analysis 0 Simulations 0 R&D 0 LabVIEW 0 Process Engineering 0 Process Simulation 0 Mathematical Modeling 0 Microsoft Excel Education Purdue University PhD,  Chemical Engineering 2009  – 2014 Advisor: Rakesh Agrawal (Open) 4 honors and awards SEIGERT Fellow IGERT is the National Science Foundation's flagship interdisciplinary training program, educating U.S. Ph.D. scientists and... View Frederick N Andrews Fellowship The Andrews Fellowships are for the recruitment of outstanding Ph.D.-track students to graduate programs at Purdue... View Faculty Fellowship Four year fellowship for outstanding undergraduate performance, and promise for continued excellence in graduate program.  View Horace W and Helen K Asire Scholarship View Purdue University MS ChE,  Chemical Engineering 2009  – 2014 Purdue University - Krannert School of Management Applied Management Principles 2012  – 2012 Brigham Young University BS,  Chemical Engineering , Cum Laude 2005  – 2009 Activities and Societies:  AIChE ,  Golden Key Honour Society ,  The Electrochemical Society ,  Phi Kappa Phi Purdue University PhD,  Chemical Engineering 2009  – 2014 Advisor: Rakesh Agrawal (Open) 4 honors and awards SEIGERT Fellow IGERT is the National Science Foundation's flagship interdisciplinary training program, educating U.S. Ph.D. scientists and... View Frederick N Andrews Fellowship The Andrews Fellowships are for the recruitment of outstanding Ph.D.-track students to graduate programs at Purdue... View Faculty Fellowship Four year fellowship for outstanding undergraduate performance, and promise for continued excellence in graduate program.  View Horace W and Helen K Asire Scholarship View Purdue University PhD,  Chemical Engineering 2009  – 2014 Advisor: Rakesh Agrawal (Open) 4 honors and awards SEIGERT Fellow IGERT is the National Science Foundation's flagship interdisciplinary training program, educating U.S. Ph.D. scientists and... View Frederick N Andrews Fellowship The Andrews Fellowships are for the recruitment of outstanding Ph.D.-track students to graduate programs at Purdue... View Faculty Fellowship Four year fellowship for outstanding undergraduate performance, and promise for continued excellence in graduate program.  View Horace W and Helen K Asire Scholarship View Purdue University PhD,  Chemical Engineering 2009  – 2014 Advisor: Rakesh Agrawal (Open) 4 honors and awards SEIGERT Fellow IGERT is the National Science Foundation's flagship interdisciplinary training program, educating U.S. Ph.D. scientists and... View Frederick N Andrews Fellowship The Andrews Fellowships are for the recruitment of outstanding Ph.D.-track students to graduate programs at Purdue... View Faculty Fellowship Four year fellowship for outstanding undergraduate performance, and promise for continued excellence in graduate program.  View Horace W and Helen K Asire Scholarship View Purdue University MS ChE,  Chemical Engineering 2009  – 2014 Purdue University MS ChE,  Chemical Engineering 2009  – 2014 Purdue University MS ChE,  Chemical Engineering 2009  – 2014 Purdue University - Krannert School of Management Applied Management Principles 2012  – 2012 Purdue University - Krannert School of Management Applied Management Principles 2012  – 2012 Purdue University - Krannert School of Management Applied Management Principles 2012  – 2012 Brigham Young University BS,  Chemical Engineering , Cum Laude 2005  – 2009 Activities and Societies:  AIChE ,  Golden Key Honour Society ,  The Electrochemical Society ,  Phi Kappa Phi Brigham Young University BS,  Chemical Engineering , Cum Laude 2005  – 2009 Activities and Societies:  AIChE ,  Golden Key Honour Society ,  The Electrochemical Society ,  Phi Kappa Phi Brigham Young University BS,  Chemical Engineering , Cum Laude 2005  – 2009 Activities and Societies:  AIChE ,  Golden Key Honour Society ,  The Electrochemical Society ,  Phi Kappa Phi Honors & Awards SEIGERT Fellow NSF\tSolar Economy Integrative Graduate Education and Research Traineeship (SEIGERT) August 2010 IGERT is the National Science Foundation's flagship interdisciplinary training program, educating U.S. Ph.D. scientists and engineers by building on the foundations of their disciplinary knowledge with interdisciplinary training. \nAs a fellow in the Solar Economy IGERT Program I received two years of funding and interdisciplinary training related to the big picture of energy derived from the sun and the potential interactions and applications... more Frederick N Andrews Fellowship Purdue University April 2009 The Andrews Fellowships are for the recruitment of outstanding Ph.D.-track students to graduate programs at Purdue University. Each fellowship provides a four-year award package to the fellow, which includes two years of stipend support from the Graduate School and two additional years of funding support from the graduate program. The Andrews Fellowship also provides tuition coverage and a medical insurance supplement. Faculty Fellowship Purdue University School of Chemical Engineering February 2009 Four year fellowship for outstanding undergraduate performance, and promise for continued excellence in graduate program.  Horace W and Helen K Asire Scholarship Purdue University College of Engineering September 2009 Shreve Travel Award Purdue University School of Chemical Engineering October 2011 Scholarship grant to present research at national AIChE conference Travel Grant Eastman Chemical Company March 2012 Travel grant to present research at national MRS conference SEIGERT Fellow NSF\tSolar Economy Integrative Graduate Education and Research Traineeship (SEIGERT) August 2010 IGERT is the National Science Foundation's flagship interdisciplinary training program, educating U.S. Ph.D. scientists and engineers by building on the foundations of their disciplinary knowledge with interdisciplinary training. \nAs a fellow in the Solar Economy IGERT Program I received two years of funding and interdisciplinary training related to the big picture of energy derived from the sun and the potential interactions and applications... more SEIGERT Fellow NSF\tSolar Economy Integrative Graduate Education and Research Traineeship (SEIGERT) August 2010 IGERT is the National Science Foundation's flagship interdisciplinary training program, educating U.S. Ph.D. scientists and engineers by building on the foundations of their disciplinary knowledge with interdisciplinary training. \nAs a fellow in the Solar Economy IGERT Program I received two years of funding and interdisciplinary training related to the big picture of energy derived from the sun and the potential interactions and applications... more SEIGERT Fellow NSF\tSolar Economy Integrative Graduate Education and Research Traineeship (SEIGERT) August 2010 IGERT is the National Science Foundation's flagship interdisciplinary training program, educating U.S. Ph.D. scientists and engineers by building on the foundations of their disciplinary knowledge with interdisciplinary training. \nAs a fellow in the Solar Economy IGERT Program I received two years of funding and interdisciplinary training related to the big picture of energy derived from the sun and the potential interactions and applications... more Frederick N Andrews Fellowship Purdue University April 2009 The Andrews Fellowships are for the recruitment of outstanding Ph.D.-track students to graduate programs at Purdue University. Each fellowship provides a four-year award package to the fellow, which includes two years of stipend support from the Graduate School and two additional years of funding support from the graduate program. The Andrews Fellowship also provides tuition coverage and a medical insurance supplement. Frederick N Andrews Fellowship Purdue University April 2009 The Andrews Fellowships are for the recruitment of outstanding Ph.D.-track students to graduate programs at Purdue University. Each fellowship provides a four-year award package to the fellow, which includes two years of stipend support from the Graduate School and two additional years of funding support from the graduate program. The Andrews Fellowship also provides tuition coverage and a medical insurance supplement. Frederick N Andrews Fellowship Purdue University April 2009 The Andrews Fellowships are for the recruitment of outstanding Ph.D.-track students to graduate programs at Purdue University. Each fellowship provides a four-year award package to the fellow, which includes two years of stipend support from the Graduate School and two additional years of funding support from the graduate program. The Andrews Fellowship also provides tuition coverage and a medical insurance supplement. Faculty Fellowship Purdue University School of Chemical Engineering February 2009 Four year fellowship for outstanding undergraduate performance, and promise for continued excellence in graduate program.  Faculty Fellowship Purdue University School of Chemical Engineering February 2009 Four year fellowship for outstanding undergraduate performance, and promise for continued excellence in graduate program.  Faculty Fellowship Purdue University School of Chemical Engineering February 2009 Four year fellowship for outstanding undergraduate performance, and promise for continued excellence in graduate program.  Horace W and Helen K Asire Scholarship Purdue University College of Engineering September 2009 Horace W and Helen K Asire Scholarship Purdue University College of Engineering September 2009 Horace W and Helen K Asire Scholarship Purdue University College of Engineering September 2009 Shreve Travel Award Purdue University School of Chemical Engineering October 2011 Scholarship grant to present research at national AIChE conference Shreve Travel Award Purdue University School of Chemical Engineering October 2011 Scholarship grant to present research at national AIChE conference Shreve Travel Award Purdue University School of Chemical Engineering October 2011 Scholarship grant to present research at national AIChE conference Travel Grant Eastman Chemical Company March 2012 Travel grant to present research at national MRS conference Travel Grant Eastman Chemical Company March 2012 Travel grant to present research at national MRS conference Travel Grant Eastman Chemical Company March 2012 Travel grant to present research at national MRS conference ", "Summary Gazi Islam completed PhD in Biomedical Informatics from Arizona State University in 2013 where he worked on an NSF funded project which involved applying computer vision and machine learning algorithm to evaluate performance of surgical residents from laparoscopic surgery videos. Gazi graduated with a bachelor’s degree in Electrical Engineering from Islamic University of Technology, Bangladesh. After graduation, he served as a lecturer and taught core electrical engineering courses at the same institute for two years. Subsequently he attended Arizona State University where he received a Master’s degree in Electrical Engineering. He also worked as a Software Engineer Intern at Intel Corporation where he developed next generation perceptual computing technologies. Gazi has published more than 15 scientific articles in recognized journals and conferences including a book chapter. His expertise is in Computer Vision, HCI, Machine Learning, Image/Video Processing, Clinical and Imaging Informatics, Digital Logic, VLSI and Telecommunications. Currently Gazi is working as a development engineer at Intel Corporation in Hillsboro, Oregon. Summary Gazi Islam completed PhD in Biomedical Informatics from Arizona State University in 2013 where he worked on an NSF funded project which involved applying computer vision and machine learning algorithm to evaluate performance of surgical residents from laparoscopic surgery videos. Gazi graduated with a bachelor’s degree in Electrical Engineering from Islamic University of Technology, Bangladesh. After graduation, he served as a lecturer and taught core electrical engineering courses at the same institute for two years. Subsequently he attended Arizona State University where he received a Master’s degree in Electrical Engineering. He also worked as a Software Engineer Intern at Intel Corporation where he developed next generation perceptual computing technologies. Gazi has published more than 15 scientific articles in recognized journals and conferences including a book chapter. His expertise is in Computer Vision, HCI, Machine Learning, Image/Video Processing, Clinical and Imaging Informatics, Digital Logic, VLSI and Telecommunications. Currently Gazi is working as a development engineer at Intel Corporation in Hillsboro, Oregon. Gazi Islam completed PhD in Biomedical Informatics from Arizona State University in 2013 where he worked on an NSF funded project which involved applying computer vision and machine learning algorithm to evaluate performance of surgical residents from laparoscopic surgery videos. Gazi graduated with a bachelor’s degree in Electrical Engineering from Islamic University of Technology, Bangladesh. After graduation, he served as a lecturer and taught core electrical engineering courses at the same institute for two years. Subsequently he attended Arizona State University where he received a Master’s degree in Electrical Engineering. He also worked as a Software Engineer Intern at Intel Corporation where he developed next generation perceptual computing technologies. Gazi has published more than 15 scientific articles in recognized journals and conferences including a book chapter. His expertise is in Computer Vision, HCI, Machine Learning, Image/Video Processing, Clinical and Imaging Informatics, Digital Logic, VLSI and Telecommunications. Currently Gazi is working as a development engineer at Intel Corporation in Hillsboro, Oregon. Gazi Islam completed PhD in Biomedical Informatics from Arizona State University in 2013 where he worked on an NSF funded project which involved applying computer vision and machine learning algorithm to evaluate performance of surgical residents from laparoscopic surgery videos. Gazi graduated with a bachelor’s degree in Electrical Engineering from Islamic University of Technology, Bangladesh. After graduation, he served as a lecturer and taught core electrical engineering courses at the same institute for two years. Subsequently he attended Arizona State University where he received a Master’s degree in Electrical Engineering. He also worked as a Software Engineer Intern at Intel Corporation where he developed next generation perceptual computing technologies. Gazi has published more than 15 scientific articles in recognized journals and conferences including a book chapter. His expertise is in Computer Vision, HCI, Machine Learning, Image/Video Processing, Clinical and Imaging Informatics, Digital Logic, VLSI and Telecommunications. Currently Gazi is working as a development engineer at Intel Corporation in Hillsboro, Oregon. Experience PTD Engineer Intel Corporation January 2014  – Present (1 year 8 months) Hillsboro, OR Research Assistant Arizona State University August 2008  –  August 2013  (5 years 1 month) Tempe, AZ • Research: \n- Developed a system using computer vision algorithms (OpenCV) and machine learning techniques to measure the level of expertise of surgeons. \n- Designed user interface for providing realtime feedback on surgical performance \n- Developed a cloud-based tool for automatic scoring of surgical videos. \n- Tested and validated software and hardware of the surgical simulator. \n- Developed games for rehab patients using Microsoft Kinect and OpenCV. \n- Developed an Indoor Location Finding and Fall Detection System in clinical environment using Sensor Integration with RFID Network and Accelerometer Data. \n• Presentation: Responsible for producing professional demo and poster and presenting to demonstrate lab’s latest innovations. (Open) 5 projects Real-time surgical skill assessment Developing a system using Computer Vision algorithm & Machine Learning techniques to access surgical performance implemented... View Web-tool for surgical video assessment Developing a web application using PHP and jQuery where surgeons can upload surgical videos and get evaluation scores... View Yoga game using 3D camera Developed games for yoga and back pain relief using Microsoft Xbox's Kinect and OpenCV library and tested at Banner Good... View Biomechanical models for touch gestures Evaluated the impact of multi-touch devices on the human musculoskeletal system by measuring muscle forces and kinematic... View Android App Developed an application for Android-based system for Advanced Cardiac Live Support (ACLS) training to evaluate team... View Software Engineer Intern Intel Corporation January 2012  –  August 2012  (8 months) Chandler, AZ • Perceptual Computing: Developed next generation perceptual computing products by integrating gesture detection, face detection and voice recognition. \n• High-level Programing: Validated and fixed high-level programming issues in the SDK release. \n• Demo Presentation: Responsible for producing professional demo of the latest perceptual computing products. (Open) 1 project Perceptual Computing Developed a next generation perceptual computing application at Intel Corporation. View PTD Engineer Intel Corporation January 2014  – Present (1 year 8 months) Hillsboro, OR PTD Engineer Intel Corporation January 2014  – Present (1 year 8 months) Hillsboro, OR Research Assistant Arizona State University August 2008  –  August 2013  (5 years 1 month) Tempe, AZ • Research: \n- Developed a system using computer vision algorithms (OpenCV) and machine learning techniques to measure the level of expertise of surgeons. \n- Designed user interface for providing realtime feedback on surgical performance \n- Developed a cloud-based tool for automatic scoring of surgical videos. \n- Tested and validated software and hardware of the surgical simulator. \n- Developed games for rehab patients using Microsoft Kinect and OpenCV. \n- Developed an Indoor Location Finding and Fall Detection System in clinical environment using Sensor Integration with RFID Network and Accelerometer Data. \n• Presentation: Responsible for producing professional demo and poster and presenting to demonstrate lab’s latest innovations. (Open) 5 projects Real-time surgical skill assessment Developing a system using Computer Vision algorithm & Machine Learning techniques to access surgical performance implemented... View Web-tool for surgical video assessment Developing a web application using PHP and jQuery where surgeons can upload surgical videos and get evaluation scores... View Yoga game using 3D camera Developed games for yoga and back pain relief using Microsoft Xbox's Kinect and OpenCV library and tested at Banner Good... View Biomechanical models for touch gestures Evaluated the impact of multi-touch devices on the human musculoskeletal system by measuring muscle forces and kinematic... View Android App Developed an application for Android-based system for Advanced Cardiac Live Support (ACLS) training to evaluate team... View Research Assistant Arizona State University August 2008  –  August 2013  (5 years 1 month) Tempe, AZ • Research: \n- Developed a system using computer vision algorithms (OpenCV) and machine learning techniques to measure the level of expertise of surgeons. \n- Designed user interface for providing realtime feedback on surgical performance \n- Developed a cloud-based tool for automatic scoring of surgical videos. \n- Tested and validated software and hardware of the surgical simulator. \n- Developed games for rehab patients using Microsoft Kinect and OpenCV. \n- Developed an Indoor Location Finding and Fall Detection System in clinical environment using Sensor Integration with RFID Network and Accelerometer Data. \n• Presentation: Responsible for producing professional demo and poster and presenting to demonstrate lab’s latest innovations. (Open) 5 projects Real-time surgical skill assessment Developing a system using Computer Vision algorithm & Machine Learning techniques to access surgical performance implemented... View Web-tool for surgical video assessment Developing a web application using PHP and jQuery where surgeons can upload surgical videos and get evaluation scores... View Yoga game using 3D camera Developed games for yoga and back pain relief using Microsoft Xbox's Kinect and OpenCV library and tested at Banner Good... View Biomechanical models for touch gestures Evaluated the impact of multi-touch devices on the human musculoskeletal system by measuring muscle forces and kinematic... View Android App Developed an application for Android-based system for Advanced Cardiac Live Support (ACLS) training to evaluate team... View Software Engineer Intern Intel Corporation January 2012  –  August 2012  (8 months) Chandler, AZ • Perceptual Computing: Developed next generation perceptual computing products by integrating gesture detection, face detection and voice recognition. \n• High-level Programing: Validated and fixed high-level programming issues in the SDK release. \n• Demo Presentation: Responsible for producing professional demo of the latest perceptual computing products. (Open) 1 project Perceptual Computing Developed a next generation perceptual computing application at Intel Corporation. View Software Engineer Intern Intel Corporation January 2012  –  August 2012  (8 months) Chandler, AZ • Perceptual Computing: Developed next generation perceptual computing products by integrating gesture detection, face detection and voice recognition. \n• High-level Programing: Validated and fixed high-level programming issues in the SDK release. \n• Demo Presentation: Responsible for producing professional demo of the latest perceptual computing products. (Open) 1 project Perceptual Computing Developed a next generation perceptual computing application at Intel Corporation. View Languages   Skills Top Skills 3 Matlab 3 Programming 2 Simulations 1 Computer Vision 1 Human Computer... 1 Gesture Recognition 1 Image Processing 1 Video Processing 1 VLSI 1 Signal Processing Gazi also knows about... 1 Verilog 0 Clinical Research 0 Biomedical Applications 0 Biomedical Device Design 0 Data Mining 0 Machine Learning 0 C++ 0 C 0 VHDL 0 Statistics 0 Data Analysis 0 Logic Design 0 SAS programming 0 PHP 0 jQuery Skills  Top Skills 3 Matlab 3 Programming 2 Simulations 1 Computer Vision 1 Human Computer... 1 Gesture Recognition 1 Image Processing 1 Video Processing 1 VLSI 1 Signal Processing Gazi also knows about... 1 Verilog 0 Clinical Research 0 Biomedical Applications 0 Biomedical Device Design 0 Data Mining 0 Machine Learning 0 C++ 0 C 0 VHDL 0 Statistics 0 Data Analysis 0 Logic Design 0 SAS programming 0 PHP 0 jQuery Top Skills 3 Matlab 3 Programming 2 Simulations 1 Computer Vision 1 Human Computer... 1 Gesture Recognition 1 Image Processing 1 Video Processing 1 VLSI 1 Signal Processing Gazi also knows about... 1 Verilog 0 Clinical Research 0 Biomedical Applications 0 Biomedical Device Design 0 Data Mining 0 Machine Learning 0 C++ 0 C 0 VHDL 0 Statistics 0 Data Analysis 0 Logic Design 0 SAS programming 0 PHP 0 jQuery Top Skills 3 Matlab 3 Programming 2 Simulations 1 Computer Vision 1 Human Computer... 1 Gesture Recognition 1 Image Processing 1 Video Processing 1 VLSI 1 Signal Processing Gazi also knows about... 1 Verilog 0 Clinical Research 0 Biomedical Applications 0 Biomedical Device Design 0 Data Mining 0 Machine Learning 0 C++ 0 C 0 VHDL 0 Statistics 0 Data Analysis 0 Logic Design 0 SAS programming 0 PHP 0 jQuery                     1 Verilog 0 Clinical Research 0 Biomedical Applications 0 Biomedical Device Design 0 Data Mining 0 Machine Learning 0 C++ 0 C 0 VHDL 0 Statistics 0 Data Analysis 0 Logic Design 0 SAS programming 0 PHP 0 jQuery Education Arizona State University Doctor of Philosophy (PhD),  Computer Science , 3.8 2009  – 2013 (Open) 8 courses Human Computer Interaction Software Engineering Principle and Concepts Data-mining in Biomedical Informatics Applied Biostatistics in Informatics Clinical Decision Support Public Health Informatics Advanced Algorithms in Image Analysis Introduction to Clinical Environments See more Arizona State University Master of Science (MS),  Electrical and Electronics Engineering , 3.7/4 2007  – 2009 (Open) 4 projects Indoor location finding and fall detection system Developed an integrated system using RFID transmitter and accelerometer to find patient’s location in clinical environment... View Video-based Motion Detection System Applied frame-to-frame differentiating technique to find object silhouette and motion history image to find movement in the... View Design of an SRAM Memory Bank Designed and laid out an 8Kbyte (64 Kb) SRAM that supports word-wide (32b) reads and writes through latches/flip-flops and... View Real Time Audio & Video Processing using Xilinx FPGA Technology Programmed Atlys™ Spartan-6 FPGA kit in both C and Assembly Language to develop Loopback, Echo and Filter operations on... View (Open) 7 courses Digital Video Processing Digital Image Processing VLSI Design Real-time Digital Signal Processing Analog Integrated Circuits Verilog/VHDL Digital Communications See more Islamic University of Technology Bachelor's degree,  Electrical and Electronics Engineering , 3.9/4 2002  – 2005 (Open) 4 courses Computer Architecture Digital Electronics Electromagnetic Fields and Waves Introduction to C++ See more Arizona State University Doctor of Philosophy (PhD),  Computer Science , 3.8 2009  – 2013 (Open) 8 courses Human Computer Interaction Software Engineering Principle and Concepts Data-mining in Biomedical Informatics Applied Biostatistics in Informatics Clinical Decision Support Public Health Informatics Advanced Algorithms in Image Analysis Introduction to Clinical Environments See more Arizona State University Doctor of Philosophy (PhD),  Computer Science , 3.8 2009  – 2013 (Open) 8 courses Human Computer Interaction Software Engineering Principle and Concepts Data-mining in Biomedical Informatics Applied Biostatistics in Informatics Clinical Decision Support Public Health Informatics Advanced Algorithms in Image Analysis Introduction to Clinical Environments See more Arizona State University Doctor of Philosophy (PhD),  Computer Science , 3.8 2009  – 2013 (Open) 8 courses Human Computer Interaction Software Engineering Principle and Concepts Data-mining in Biomedical Informatics Applied Biostatistics in Informatics Clinical Decision Support Public Health Informatics Advanced Algorithms in Image Analysis Introduction to Clinical Environments See more Arizona State University Master of Science (MS),  Electrical and Electronics Engineering , 3.7/4 2007  – 2009 (Open) 4 projects Indoor location finding and fall detection system Developed an integrated system using RFID transmitter and accelerometer to find patient’s location in clinical environment... View Video-based Motion Detection System Applied frame-to-frame differentiating technique to find object silhouette and motion history image to find movement in the... View Design of an SRAM Memory Bank Designed and laid out an 8Kbyte (64 Kb) SRAM that supports word-wide (32b) reads and writes through latches/flip-flops and... View Real Time Audio & Video Processing using Xilinx FPGA Technology Programmed Atlys™ Spartan-6 FPGA kit in both C and Assembly Language to develop Loopback, Echo and Filter operations on... View (Open) 7 courses Digital Video Processing Digital Image Processing VLSI Design Real-time Digital Signal Processing Analog Integrated Circuits Verilog/VHDL Digital Communications See more Arizona State University Master of Science (MS),  Electrical and Electronics Engineering , 3.7/4 2007  – 2009 (Open) 4 projects Indoor location finding and fall detection system Developed an integrated system using RFID transmitter and accelerometer to find patient’s location in clinical environment... View Video-based Motion Detection System Applied frame-to-frame differentiating technique to find object silhouette and motion history image to find movement in the... View Design of an SRAM Memory Bank Designed and laid out an 8Kbyte (64 Kb) SRAM that supports word-wide (32b) reads and writes through latches/flip-flops and... View Real Time Audio & Video Processing using Xilinx FPGA Technology Programmed Atlys™ Spartan-6 FPGA kit in both C and Assembly Language to develop Loopback, Echo and Filter operations on... View (Open) 7 courses Digital Video Processing Digital Image Processing VLSI Design Real-time Digital Signal Processing Analog Integrated Circuits Verilog/VHDL Digital Communications See more Arizona State University Master of Science (MS),  Electrical and Electronics Engineering , 3.7/4 2007  – 2009 (Open) 4 projects Indoor location finding and fall detection system Developed an integrated system using RFID transmitter and accelerometer to find patient’s location in clinical environment... View Video-based Motion Detection System Applied frame-to-frame differentiating technique to find object silhouette and motion history image to find movement in the... View Design of an SRAM Memory Bank Designed and laid out an 8Kbyte (64 Kb) SRAM that supports word-wide (32b) reads and writes through latches/flip-flops and... View Real Time Audio & Video Processing using Xilinx FPGA Technology Programmed Atlys™ Spartan-6 FPGA kit in both C and Assembly Language to develop Loopback, Echo and Filter operations on... View (Open) 7 courses Digital Video Processing Digital Image Processing VLSI Design Real-time Digital Signal Processing Analog Integrated Circuits Verilog/VHDL Digital Communications See more Islamic University of Technology Bachelor's degree,  Electrical and Electronics Engineering , 3.9/4 2002  – 2005 (Open) 4 courses Computer Architecture Digital Electronics Electromagnetic Fields and Waves Introduction to C++ See more Islamic University of Technology Bachelor's degree,  Electrical and Electronics Engineering , 3.9/4 2002  – 2005 (Open) 4 courses Computer Architecture Digital Electronics Electromagnetic Fields and Waves Introduction to C++ See more Islamic University of Technology Bachelor's degree,  Electrical and Electronics Engineering , 3.9/4 2002  – 2005 (Open) 4 courses Computer Architecture Digital Electronics Electromagnetic Fields and Waves Introduction to C++ See more Honors & Awards ", "Experience PTD Engineer Intel Corporation April 2009  – Present (6 years 5 months) Corporate and Analytical Research Engineer (Intern) Arkema May 2006  –  December 2006  (8 months) Research Engineer Colorquimica S.A. May 1999  –  July 2001  (2 years 3 months) PTD Engineer Intel Corporation April 2009  – Present (6 years 5 months) PTD Engineer Intel Corporation April 2009  – Present (6 years 5 months) Corporate and Analytical Research Engineer (Intern) Arkema May 2006  –  December 2006  (8 months) Corporate and Analytical Research Engineer (Intern) Arkema May 2006  –  December 2006  (8 months) Research Engineer Colorquimica S.A. May 1999  –  July 2001  (2 years 3 months) Research Engineer Colorquimica S.A. May 1999  –  July 2001  (2 years 3 months) Languages Spanish Native or bilingual proficiency English Native or bilingual proficiency Spanish Native or bilingual proficiency English Native or bilingual proficiency Spanish Native or bilingual proficiency English Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills 3 Design of Experiments 1 Chemical Engineering 1 Characterization 1 Process Engineering 0 AFM 0 Simulation Skills  3 Design of Experiments 1 Chemical Engineering 1 Characterization 1 Process Engineering 0 AFM 0 Simulation 3 Design of Experiments 1 Chemical Engineering 1 Characterization 1 Process Engineering 0 AFM 0 Simulation 3 Design of Experiments 1 Chemical Engineering 1 Characterization 1 Process Engineering 0 AFM 0 Simulation             Education Georgia Institute of Technology PhD,  Chemical Engineering 2004  – 2009 Georgia Institute of Technology MSc,  Chemical Engineering and Bioengineering 2001  – 2004 Universidad Pontificia Bolivariana BS,  Chemical Engineering 1994  – 1998 Georgia Institute of Technology PhD,  Chemical Engineering 2004  – 2009 Georgia Institute of Technology PhD,  Chemical Engineering 2004  – 2009 Georgia Institute of Technology PhD,  Chemical Engineering 2004  – 2009 Georgia Institute of Technology MSc,  Chemical Engineering and Bioengineering 2001  – 2004 Georgia Institute of Technology MSc,  Chemical Engineering and Bioengineering 2001  – 2004 Georgia Institute of Technology MSc,  Chemical Engineering and Bioengineering 2001  – 2004 Universidad Pontificia Bolivariana BS,  Chemical Engineering 1994  – 1998 Universidad Pontificia Bolivariana BS,  Chemical Engineering 1994  – 1998 Universidad Pontificia Bolivariana BS,  Chemical Engineering 1994  – 1998 ", "Experience Senior Module Engineer Intel Corporation February 2013  – Present (2 years 7 months) Hillsboro, Oregon Postdoctoral Research Associate University of Illinois at Urbana-Champaign November 2012  –  January 2013  (3 months) Visiting Lecturer University of Illinois at Urbana-Champaign August 2012  –  January 2013  (6 months) Urbana-Champaign, Illinois Area ECE 329: Lines and Waves I Graduate Research Assistant University of Illinois at Urbana-Champaign May 2006  –  August 2012  (6 years 4 months) Research Scientist Innovative Employee Solutions November 2010  –  September 2011  (11 months) Specific purpose contract with SAIC Undergraduate Assistant University of Illinois at Urbana-Champaign May 2004  –  May 2006  (2 years 1 month) Production Assistant and Technical Consultant National Engravers, Inc. May 1999  –  September 2003  (4 years 5 months) Senior Module Engineer Intel Corporation February 2013  – Present (2 years 7 months) Hillsboro, Oregon Senior Module Engineer Intel Corporation February 2013  – Present (2 years 7 months) Hillsboro, Oregon Postdoctoral Research Associate University of Illinois at Urbana-Champaign November 2012  –  January 2013  (3 months) Postdoctoral Research Associate University of Illinois at Urbana-Champaign November 2012  –  January 2013  (3 months) Visiting Lecturer University of Illinois at Urbana-Champaign August 2012  –  January 2013  (6 months) Urbana-Champaign, Illinois Area ECE 329: Lines and Waves I Visiting Lecturer University of Illinois at Urbana-Champaign August 2012  –  January 2013  (6 months) Urbana-Champaign, Illinois Area ECE 329: Lines and Waves I Graduate Research Assistant University of Illinois at Urbana-Champaign May 2006  –  August 2012  (6 years 4 months) Graduate Research Assistant University of Illinois at Urbana-Champaign May 2006  –  August 2012  (6 years 4 months) Research Scientist Innovative Employee Solutions November 2010  –  September 2011  (11 months) Specific purpose contract with SAIC Research Scientist Innovative Employee Solutions November 2010  –  September 2011  (11 months) Specific purpose contract with SAIC Undergraduate Assistant University of Illinois at Urbana-Champaign May 2004  –  May 2006  (2 years 1 month) Undergraduate Assistant University of Illinois at Urbana-Champaign May 2004  –  May 2006  (2 years 1 month) Production Assistant and Technical Consultant National Engravers, Inc. May 1999  –  September 2003  (4 years 5 months) Production Assistant and Technical Consultant National Engravers, Inc. May 1999  –  September 2003  (4 years 5 months) Skills Skills     Education University of Illinois at Urbana-Champaign Ph.D.,  Materials Science and Engineering , 3.91 2006  – 2012 • 2006-2007 Donald W. Hamer Fellow Activities and Societies:  Engineers Without Borders University of Illinois at Urbana-Champaign Bachelor of Science,  Materials Science and Engineering ,  Electronic materials , 3.74 2002  – 2006 • Departmental scholarships each year of undergraduate study \n• Dean’s list, four semesters University of Illinois at Urbana-Champaign Ph.D.,  Materials Science and Engineering , 3.91 2006  – 2012 • 2006-2007 Donald W. Hamer Fellow Activities and Societies:  Engineers Without Borders University of Illinois at Urbana-Champaign Ph.D.,  Materials Science and Engineering , 3.91 2006  – 2012 • 2006-2007 Donald W. Hamer Fellow Activities and Societies:  Engineers Without Borders University of Illinois at Urbana-Champaign Ph.D.,  Materials Science and Engineering , 3.91 2006  – 2012 • 2006-2007 Donald W. Hamer Fellow Activities and Societies:  Engineers Without Borders University of Illinois at Urbana-Champaign Bachelor of Science,  Materials Science and Engineering ,  Electronic materials , 3.74 2002  – 2006 • Departmental scholarships each year of undergraduate study \n• Dean’s list, four semesters University of Illinois at Urbana-Champaign Bachelor of Science,  Materials Science and Engineering ,  Electronic materials , 3.74 2002  – 2006 • Departmental scholarships each year of undergraduate study \n• Dean’s list, four semesters University of Illinois at Urbana-Champaign Bachelor of Science,  Materials Science and Engineering ,  Electronic materials , 3.74 2002  – 2006 • Departmental scholarships each year of undergraduate study \n• Dean’s list, four semesters ", "Experience PTD Engineer Intel Corporation August 2013  – Present (2 years 1 month) Post-Doctoral Researcher The Ohio State University January 2013  –  July 2013  (7 months) Columbus, Ohio Area Graduate Research Associate The Ohio State University September 2006  –  December 2012  (6 years 4 months) Materials Science and Engineering Manager Tata Steel August 2001  –  December 2003  (2 years 5 months) PTD Engineer Intel Corporation August 2013  – Present (2 years 1 month) PTD Engineer Intel Corporation August 2013  – Present (2 years 1 month) Post-Doctoral Researcher The Ohio State University January 2013  –  July 2013  (7 months) Columbus, Ohio Area Post-Doctoral Researcher The Ohio State University January 2013  –  July 2013  (7 months) Columbus, Ohio Area Graduate Research Associate The Ohio State University September 2006  –  December 2012  (6 years 4 months) Materials Science and Engineering Graduate Research Associate The Ohio State University September 2006  –  December 2012  (6 years 4 months) Materials Science and Engineering Manager Tata Steel August 2001  –  December 2003  (2 years 5 months) Manager Tata Steel August 2001  –  December 2003  (2 years 5 months) Languages Hindi Hindi Hindi Skills Top Skills 12 Scanning Electron... 11 Characterization 8 Powder X-ray Diffraction 7 Materials Science 6 Electron Microscopy 5 TEM 4 Conventional TEM 4 SEM-Electron... 4 FIB and conventional... 3 Metallography Vikas also knows about... 3 Mechanical Testing 3 AFM 2 Advanced TEM... 2 Nanomaterials 2 Optical Microscopy 2 Nanotechnology 2 FIB 2 Failure Analysis 1 Physical Metallugry 1 Research 0 3-Dimensional... 0 Genetic Algorithm and... 0 Friction Stir Welding... 0 Matlab 0 Simulations 0 Spectroscopy 0 Materials See 2+     See less Skills  Top Skills 12 Scanning Electron... 11 Characterization 8 Powder X-ray Diffraction 7 Materials Science 6 Electron Microscopy 5 TEM 4 Conventional TEM 4 SEM-Electron... 4 FIB and conventional... 3 Metallography Vikas also knows about... 3 Mechanical Testing 3 AFM 2 Advanced TEM... 2 Nanomaterials 2 Optical Microscopy 2 Nanotechnology 2 FIB 2 Failure Analysis 1 Physical Metallugry 1 Research 0 3-Dimensional... 0 Genetic Algorithm and... 0 Friction Stir Welding... 0 Matlab 0 Simulations 0 Spectroscopy 0 Materials See 2+     See less Top Skills 12 Scanning Electron... 11 Characterization 8 Powder X-ray Diffraction 7 Materials Science 6 Electron Microscopy 5 TEM 4 Conventional TEM 4 SEM-Electron... 4 FIB and conventional... 3 Metallography Vikas also knows about... 3 Mechanical Testing 3 AFM 2 Advanced TEM... 2 Nanomaterials 2 Optical Microscopy 2 Nanotechnology 2 FIB 2 Failure Analysis 1 Physical Metallugry 1 Research 0 3-Dimensional... 0 Genetic Algorithm and... 0 Friction Stir Welding... 0 Matlab 0 Simulations 0 Spectroscopy 0 Materials See 2+     See less Top Skills 12 Scanning Electron... 11 Characterization 8 Powder X-ray Diffraction 7 Materials Science 6 Electron Microscopy 5 TEM 4 Conventional TEM 4 SEM-Electron... 4 FIB and conventional... 3 Metallography Vikas also knows about... 3 Mechanical Testing 3 AFM 2 Advanced TEM... 2 Nanomaterials 2 Optical Microscopy 2 Nanotechnology 2 FIB 2 Failure Analysis 1 Physical Metallugry 1 Research 0 3-Dimensional... 0 Genetic Algorithm and... 0 Friction Stir Welding... 0 Matlab 0 Simulations 0 Spectroscopy 0 Materials See 2+     See less                     3 Mechanical Testing 3 AFM 2 Advanced TEM... 2 Nanomaterials 2 Optical Microscopy 2 Nanotechnology 2 FIB 2 Failure Analysis 1 Physical Metallugry 1 Research 0 3-Dimensional... 0 Genetic Algorithm and... 0 Friction Stir Welding... 0 Matlab 0 Simulations 0 Spectroscopy 0 Materials Education The Ohio State University PhD,  Materials Science and Engineering 2006  – 2012 University of Missouri-Rolla MS,  Materials Science and Engineering 2004  – 2006 (Open) 1 recommendation Lucie Johannes Sommer Metallurgical Engineer, Ph.D., P.E. Vikas was not only a hard working graduate student, but also a great graduate student colleague to spend time with. I enjoyed working with him, and know he has a great future ahead of him because of his knowledge and enthusiasm. We worked together... View Indian Institute of Technology, Kanpur Bachelor of Technology (B.Tech.),  Materials Science and Metallurgical Engineering 1997  – 2001 The Ohio State University PhD,  Materials Science and Engineering 2006  – 2012 The Ohio State University PhD,  Materials Science and Engineering 2006  – 2012 The Ohio State University PhD,  Materials Science and Engineering 2006  – 2012 University of Missouri-Rolla MS,  Materials Science and Engineering 2004  – 2006 (Open) 1 recommendation Lucie Johannes Sommer Metallurgical Engineer, Ph.D., P.E. Vikas was not only a hard working graduate student, but also a great graduate student colleague to spend time with. I enjoyed working with him, and know he has a great future ahead of him because of his knowledge and enthusiasm. We worked together... View University of Missouri-Rolla MS,  Materials Science and Engineering 2004  – 2006 (Open) 1 recommendation Lucie Johannes Sommer Metallurgical Engineer, Ph.D., P.E. Vikas was not only a hard working graduate student, but also a great graduate student colleague to spend time with. I enjoyed working with him, and know he has a great future ahead of him because of his knowledge and enthusiasm. We worked together... View University of Missouri-Rolla MS,  Materials Science and Engineering 2004  – 2006 (Open) 1 recommendation Lucie Johannes Sommer Metallurgical Engineer, Ph.D., P.E. Vikas was not only a hard working graduate student, but also a great graduate student colleague to spend time with. I enjoyed working with him, and know he has a great future ahead of him because of his knowledge and enthusiasm. We worked together... View Indian Institute of Technology, Kanpur Bachelor of Technology (B.Tech.),  Materials Science and Metallurgical Engineering 1997  – 2001 Indian Institute of Technology, Kanpur Bachelor of Technology (B.Tech.),  Materials Science and Metallurgical Engineering 1997  – 2001 Indian Institute of Technology, Kanpur Bachelor of Technology (B.Tech.),  Materials Science and Metallurgical Engineering 1997  – 2001 ", "Summary Expertise in Laser materials processing, Amorphous and Magnetic materials. \nHands on experience in using advanced characterization tools including XRD, SEM, DSC, FIB, TEM and Atom Probe. \nExcellent problem solving skills. \nExcellent written and verbal skills. Summary Expertise in Laser materials processing, Amorphous and Magnetic materials. \nHands on experience in using advanced characterization tools including XRD, SEM, DSC, FIB, TEM and Atom Probe. \nExcellent problem solving skills. \nExcellent written and verbal skills. Expertise in Laser materials processing, Amorphous and Magnetic materials. \nHands on experience in using advanced characterization tools including XRD, SEM, DSC, FIB, TEM and Atom Probe. \nExcellent problem solving skills. \nExcellent written and verbal skills. Expertise in Laser materials processing, Amorphous and Magnetic materials. \nHands on experience in using advanced characterization tools including XRD, SEM, DSC, FIB, TEM and Atom Probe. \nExcellent problem solving skills. \nExcellent written and verbal skills. Experience PTD Engineer Intel Corporation July 2014  – Present (1 year 2 months) hillsboro, oregon Graduate Research Associate Department of Materials Science and Engineering, University of North Texas August 2010  –  May 2014  (3 years 10 months) My area of interest is understanding laser material interactions with an emphasis on crystallization of amorphous precursors and synthesis of amorphous coatings. \n \nThe study on crystallization behavior of amorphous materials involved understanding the underlying physics behind laser material interaction and its effects on phase transformation from amorphous to crystalline state. A microstructure-property-processing correlation is established in order to synthesize novel magnetic materials. The effects of laser material interaction are assessed by extensive characterization using analytical tools including DSC,XRD,SEM, TEM and Atom Probe Tomography. On the basis of microstructure-processing co-relationship, the laser processing parameters are optimized to enhance the magnetic property of the crystallized material. \n \nSynthesizing Fe-based bulk amorphous coatings on structural steels for extreme environments involves synthesizing bulk amorphous coatings by choosing appropriate laser parameters to obtain a sound coating with desired microstructure. Laser processing experiments are designed and performed keeping in view of various aspects like dilution ratio from the substrate, thermal histories and cooling rates, atmospheric effects like oxidation, contamination and also re-heating effects. Efficient ways of heat transfer are also designed depending on the requirement.The synthesized coatings are tested for corrosion and wear resistance. The tested samples are further analyzed using analytical tools like XRD,SEM, TEM and Atom Probe Tomography in order to understand the mechanisms operating during corrosion and wear.  \n \nI also work on COMSOL modelling to evaluate the thermal histories experience during processing and validate the results using experimental observations (Open) 1 organization Materials Advantage UNT Chapter View (Open) 4 honors and awards Invited Member of Phi Kappa Phi View 4th position in Inter-university North Texas Student Symposium View Tolhouse Graduate School Travel Grant View Tolhouse Graduate School Travel Grant View (Open) 10 courses Advanced Physical Metalurgy Thermodynamics of Materials Bonding Structure and Crystallography Mechanical Behavior of Materials Electronic, Optical and Magnetic Properties of Materials Phase Transformations in Materials Compound Semiconductors Applied Fracture Mechanics SEM and FIB Transmission Electron Microscopy See more (Open) 1 recommendation Junyeon Hwang Senior Researcher at Korea Institute of Science and Technology Shravan is very sincere and self motivated not only for his work but also his life. He always did his best and finally got the answer. He've seeked for the fundalmental theory and proved it in his work. The honest and the selfless are other good... View ASF Fellowship Pacific Northwest National Laboratory June 2012  –  August 2012  (3 months) Richland/Kennewick/Pasco, Washington Area As an alternate sponsor fellow, I was trained on micro-XRD, FIB and Atom Probe Tomography for phase and microstructural analysis of laser processed amorphous ribbons as well as MBE deposited thin films. (Open) 1 honor or award Alternate Sponsor Fellowship View Materials science student National Institute of Technology, Raipur August 2006  –  July 2010  (4 years) Summer Intern Defence Mettalurgical Research Laboratory June 2009  –  September 2009  (4 months) Hyderabad, India Synthesized Cu-Co melt-spun ribbons for soft magnetic applications and performed various annealing treatments. As a part of internship, the ribbons were characterized using analytical techniques like XRD, SEM and DSC. Intern Vizag Steel Plant December 2008  –  January 2009  (2 months) Vishakhapatnam Area, India Studied the causes for laddle clogging during continuous casting of steel. The processing path was meticulously observed from the point of receiving the heat from blast furnace till the continuous casting process and identified the root cause for clogging. Remedial measures were further suggested. Summer Intern Department of Physics, Indian Institute of Technology Kharagpur June 2008  –  August 2008  (3 months) Indian Institute of Technology Kharagpur Assisted in synthesis and characterization of Strontium doped Lanthanum Manganates for Magneto-resistive applications. Characterized sol-gel synthesized pallets using XRD, SEM, low temperature MR, GMI (Giant Magneto Impedance). Intern Naval Materials Research Laboratory December 2007  –  February 2008  (3 months) Mumbai Area, India Studied the effects of TiB2 and TiC inocculants on grain refinement of Aluminum Alloys PTD Engineer Intel Corporation July 2014  – Present (1 year 2 months) hillsboro, oregon PTD Engineer Intel Corporation July 2014  – Present (1 year 2 months) hillsboro, oregon Graduate Research Associate Department of Materials Science and Engineering, University of North Texas August 2010  –  May 2014  (3 years 10 months) My area of interest is understanding laser material interactions with an emphasis on crystallization of amorphous precursors and synthesis of amorphous coatings. \n \nThe study on crystallization behavior of amorphous materials involved understanding the underlying physics behind laser material interaction and its effects on phase transformation from amorphous to crystalline state. A microstructure-property-processing correlation is established in order to synthesize novel magnetic materials. The effects of laser material interaction are assessed by extensive characterization using analytical tools including DSC,XRD,SEM, TEM and Atom Probe Tomography. On the basis of microstructure-processing co-relationship, the laser processing parameters are optimized to enhance the magnetic property of the crystallized material. \n \nSynthesizing Fe-based bulk amorphous coatings on structural steels for extreme environments involves synthesizing bulk amorphous coatings by choosing appropriate laser parameters to obtain a sound coating with desired microstructure. Laser processing experiments are designed and performed keeping in view of various aspects like dilution ratio from the substrate, thermal histories and cooling rates, atmospheric effects like oxidation, contamination and also re-heating effects. Efficient ways of heat transfer are also designed depending on the requirement.The synthesized coatings are tested for corrosion and wear resistance. The tested samples are further analyzed using analytical tools like XRD,SEM, TEM and Atom Probe Tomography in order to understand the mechanisms operating during corrosion and wear.  \n \nI also work on COMSOL modelling to evaluate the thermal histories experience during processing and validate the results using experimental observations (Open) 1 organization Materials Advantage UNT Chapter View (Open) 4 honors and awards Invited Member of Phi Kappa Phi View 4th position in Inter-university North Texas Student Symposium View Tolhouse Graduate School Travel Grant View Tolhouse Graduate School Travel Grant View (Open) 10 courses Advanced Physical Metalurgy Thermodynamics of Materials Bonding Structure and Crystallography Mechanical Behavior of Materials Electronic, Optical and Magnetic Properties of Materials Phase Transformations in Materials Compound Semiconductors Applied Fracture Mechanics SEM and FIB Transmission Electron Microscopy See more (Open) 1 recommendation Junyeon Hwang Senior Researcher at Korea Institute of Science and Technology Shravan is very sincere and self motivated not only for his work but also his life. He always did his best and finally got the answer. He've seeked for the fundalmental theory and proved it in his work. The honest and the selfless are other good... View Graduate Research Associate Department of Materials Science and Engineering, University of North Texas August 2010  –  May 2014  (3 years 10 months) My area of interest is understanding laser material interactions with an emphasis on crystallization of amorphous precursors and synthesis of amorphous coatings. \n \nThe study on crystallization behavior of amorphous materials involved understanding the underlying physics behind laser material interaction and its effects on phase transformation from amorphous to crystalline state. A microstructure-property-processing correlation is established in order to synthesize novel magnetic materials. The effects of laser material interaction are assessed by extensive characterization using analytical tools including DSC,XRD,SEM, TEM and Atom Probe Tomography. On the basis of microstructure-processing co-relationship, the laser processing parameters are optimized to enhance the magnetic property of the crystallized material. \n \nSynthesizing Fe-based bulk amorphous coatings on structural steels for extreme environments involves synthesizing bulk amorphous coatings by choosing appropriate laser parameters to obtain a sound coating with desired microstructure. Laser processing experiments are designed and performed keeping in view of various aspects like dilution ratio from the substrate, thermal histories and cooling rates, atmospheric effects like oxidation, contamination and also re-heating effects. Efficient ways of heat transfer are also designed depending on the requirement.The synthesized coatings are tested for corrosion and wear resistance. The tested samples are further analyzed using analytical tools like XRD,SEM, TEM and Atom Probe Tomography in order to understand the mechanisms operating during corrosion and wear.  \n \nI also work on COMSOL modelling to evaluate the thermal histories experience during processing and validate the results using experimental observations (Open) 1 organization Materials Advantage UNT Chapter View (Open) 4 honors and awards Invited Member of Phi Kappa Phi View 4th position in Inter-university North Texas Student Symposium View Tolhouse Graduate School Travel Grant View Tolhouse Graduate School Travel Grant View (Open) 10 courses Advanced Physical Metalurgy Thermodynamics of Materials Bonding Structure and Crystallography Mechanical Behavior of Materials Electronic, Optical and Magnetic Properties of Materials Phase Transformations in Materials Compound Semiconductors Applied Fracture Mechanics SEM and FIB Transmission Electron Microscopy See more (Open) 1 recommendation Junyeon Hwang Senior Researcher at Korea Institute of Science and Technology Shravan is very sincere and self motivated not only for his work but also his life. He always did his best and finally got the answer. He've seeked for the fundalmental theory and proved it in his work. The honest and the selfless are other good... View ASF Fellowship Pacific Northwest National Laboratory June 2012  –  August 2012  (3 months) Richland/Kennewick/Pasco, Washington Area As an alternate sponsor fellow, I was trained on micro-XRD, FIB and Atom Probe Tomography for phase and microstructural analysis of laser processed amorphous ribbons as well as MBE deposited thin films. (Open) 1 honor or award Alternate Sponsor Fellowship View ASF Fellowship Pacific Northwest National Laboratory June 2012  –  August 2012  (3 months) Richland/Kennewick/Pasco, Washington Area As an alternate sponsor fellow, I was trained on micro-XRD, FIB and Atom Probe Tomography for phase and microstructural analysis of laser processed amorphous ribbons as well as MBE deposited thin films. (Open) 1 honor or award Alternate Sponsor Fellowship View Materials science student National Institute of Technology, Raipur August 2006  –  July 2010  (4 years) Materials science student National Institute of Technology, Raipur August 2006  –  July 2010  (4 years) Summer Intern Defence Mettalurgical Research Laboratory June 2009  –  September 2009  (4 months) Hyderabad, India Synthesized Cu-Co melt-spun ribbons for soft magnetic applications and performed various annealing treatments. As a part of internship, the ribbons were characterized using analytical techniques like XRD, SEM and DSC. Summer Intern Defence Mettalurgical Research Laboratory June 2009  –  September 2009  (4 months) Hyderabad, India Synthesized Cu-Co melt-spun ribbons for soft magnetic applications and performed various annealing treatments. As a part of internship, the ribbons were characterized using analytical techniques like XRD, SEM and DSC. Intern Vizag Steel Plant December 2008  –  January 2009  (2 months) Vishakhapatnam Area, India Studied the causes for laddle clogging during continuous casting of steel. The processing path was meticulously observed from the point of receiving the heat from blast furnace till the continuous casting process and identified the root cause for clogging. Remedial measures were further suggested. Intern Vizag Steel Plant December 2008  –  January 2009  (2 months) Vishakhapatnam Area, India Studied the causes for laddle clogging during continuous casting of steel. The processing path was meticulously observed from the point of receiving the heat from blast furnace till the continuous casting process and identified the root cause for clogging. Remedial measures were further suggested. Summer Intern Department of Physics, Indian Institute of Technology Kharagpur June 2008  –  August 2008  (3 months) Indian Institute of Technology Kharagpur Assisted in synthesis and characterization of Strontium doped Lanthanum Manganates for Magneto-resistive applications. Characterized sol-gel synthesized pallets using XRD, SEM, low temperature MR, GMI (Giant Magneto Impedance). Summer Intern Department of Physics, Indian Institute of Technology Kharagpur June 2008  –  August 2008  (3 months) Indian Institute of Technology Kharagpur Assisted in synthesis and characterization of Strontium doped Lanthanum Manganates for Magneto-resistive applications. Characterized sol-gel synthesized pallets using XRD, SEM, low temperature MR, GMI (Giant Magneto Impedance). Intern Naval Materials Research Laboratory December 2007  –  February 2008  (3 months) Mumbai Area, India Studied the effects of TiB2 and TiC inocculants on grain refinement of Aluminum Alloys Intern Naval Materials Research Laboratory December 2007  –  February 2008  (3 months) Mumbai Area, India Studied the effects of TiB2 and TiC inocculants on grain refinement of Aluminum Alloys Languages Telugu Native or bilingual proficiency English Full professional proficiency Hindi Native or bilingual proficiency Tamil Elementary proficiency Telugu Native or bilingual proficiency English Full professional proficiency Hindi Native or bilingual proficiency Tamil Elementary proficiency Telugu Native or bilingual proficiency English Full professional proficiency Hindi Native or bilingual proficiency Tamil Elementary proficiency Native or bilingual proficiency Full professional proficiency Native or bilingual proficiency Elementary proficiency Skills Top Skills 29 Materials Science 24 Powder X-ray Diffraction 19 Characterization 16 TEM 11 Scanning Electron... 9 Thin Films 7 FIB 6 Metallurgy 6 C 5 Materials Shravana also knows about... 4 Coatings 3 Corrosion 3 Differential Scanning... 3 Nanotechnology 2 Metallic glasses 2 Laser processing 2 Electron Microscopy 2 Mechanical Testing 2 Experimentation 1 Metallography 1 Steel 1 Science 1 TGA 1 LEAP (Local electrode... 1 Micro-XRD 1 Phase transformation 1 Amorphous materials 1 Wear 1 COMSOL 1 Optical Microscopy 1 Heat Transfer 1 OriginLab 1 Magnetics 1 Nanocomposites 1 SEM 1 EDX 1 XPS 1 Nanomaterials 1 Laser 1 Physics See 15+     See less Skills  Top Skills 29 Materials Science 24 Powder X-ray Diffraction 19 Characterization 16 TEM 11 Scanning Electron... 9 Thin Films 7 FIB 6 Metallurgy 6 C 5 Materials Shravana also knows about... 4 Coatings 3 Corrosion 3 Differential Scanning... 3 Nanotechnology 2 Metallic glasses 2 Laser processing 2 Electron Microscopy 2 Mechanical Testing 2 Experimentation 1 Metallography 1 Steel 1 Science 1 TGA 1 LEAP (Local electrode... 1 Micro-XRD 1 Phase transformation 1 Amorphous materials 1 Wear 1 COMSOL 1 Optical Microscopy 1 Heat Transfer 1 OriginLab 1 Magnetics 1 Nanocomposites 1 SEM 1 EDX 1 XPS 1 Nanomaterials 1 Laser 1 Physics See 15+     See less Top Skills 29 Materials Science 24 Powder X-ray Diffraction 19 Characterization 16 TEM 11 Scanning Electron... 9 Thin Films 7 FIB 6 Metallurgy 6 C 5 Materials Shravana also knows about... 4 Coatings 3 Corrosion 3 Differential Scanning... 3 Nanotechnology 2 Metallic glasses 2 Laser processing 2 Electron Microscopy 2 Mechanical Testing 2 Experimentation 1 Metallography 1 Steel 1 Science 1 TGA 1 LEAP (Local electrode... 1 Micro-XRD 1 Phase transformation 1 Amorphous materials 1 Wear 1 COMSOL 1 Optical Microscopy 1 Heat Transfer 1 OriginLab 1 Magnetics 1 Nanocomposites 1 SEM 1 EDX 1 XPS 1 Nanomaterials 1 Laser 1 Physics See 15+     See less Top Skills 29 Materials Science 24 Powder X-ray Diffraction 19 Characterization 16 TEM 11 Scanning Electron... 9 Thin Films 7 FIB 6 Metallurgy 6 C 5 Materials Shravana also knows about... 4 Coatings 3 Corrosion 3 Differential Scanning... 3 Nanotechnology 2 Metallic glasses 2 Laser processing 2 Electron Microscopy 2 Mechanical Testing 2 Experimentation 1 Metallography 1 Steel 1 Science 1 TGA 1 LEAP (Local electrode... 1 Micro-XRD 1 Phase transformation 1 Amorphous materials 1 Wear 1 COMSOL 1 Optical Microscopy 1 Heat Transfer 1 OriginLab 1 Magnetics 1 Nanocomposites 1 SEM 1 EDX 1 XPS 1 Nanomaterials 1 Laser 1 Physics See 15+     See less                     4 Coatings 3 Corrosion 3 Differential Scanning... 3 Nanotechnology 2 Metallic glasses 2 Laser processing 2 Electron Microscopy 2 Mechanical Testing 2 Experimentation 1 Metallography 1 Steel 1 Science 1 TGA 1 LEAP (Local electrode... 1 Micro-XRD 1 Phase transformation 1 Amorphous materials 1 Wear 1 COMSOL 1 Optical Microscopy 1 Heat Transfer 1 OriginLab 1 Magnetics 1 Nanocomposites 1 SEM 1 EDX 1 XPS 1 Nanomaterials 1 Laser 1 Physics Education University of North Texas Doctor of Philosophy (Ph.D.),  Materials Engineering , A 2010  – 2014 Activities and Societies:  Phi Kappa Phi ,  Materials Advantage ,  Indian Student Association. National Institute of Technology Raipur Bachelor of Technology (B.Tech.),  Materials Engineering 2006  – 2010 (Open) 1 honor or award Elected President of Metallurgical Society (METSO) NIT Raipur View University of North Texas Doctor of Philosophy (Ph.D.),  Materials Engineering , A 2010  – 2014 Activities and Societies:  Phi Kappa Phi ,  Materials Advantage ,  Indian Student Association. University of North Texas Doctor of Philosophy (Ph.D.),  Materials Engineering , A 2010  – 2014 Activities and Societies:  Phi Kappa Phi ,  Materials Advantage ,  Indian Student Association. University of North Texas Doctor of Philosophy (Ph.D.),  Materials Engineering , A 2010  – 2014 Activities and Societies:  Phi Kappa Phi ,  Materials Advantage ,  Indian Student Association. National Institute of Technology Raipur Bachelor of Technology (B.Tech.),  Materials Engineering 2006  – 2010 (Open) 1 honor or award Elected President of Metallurgical Society (METSO) NIT Raipur View National Institute of Technology Raipur Bachelor of Technology (B.Tech.),  Materials Engineering 2006  – 2010 (Open) 1 honor or award Elected President of Metallurgical Society (METSO) NIT Raipur View National Institute of Technology Raipur Bachelor of Technology (B.Tech.),  Materials Engineering 2006  – 2010 (Open) 1 honor or award Elected President of Metallurgical Society (METSO) NIT Raipur View Honors & Awards Alternate Sponsor Fellowship Pacific Northwest National Laboratoy June 2012 Invited Member of Phi Kappa Phi Phi Kappa Phi August 2011 4th position in Inter-university North Texas Student Symposium Material Advantage December 2012 Elected President of Metallurgical Society (METSO) NIT Raipur Dept of Materials Science NIT Raipur August 2008 Tolhouse Graduate School Travel Grant University of North Texas October 2011 Tolhouse Graduate School Travel Grant University of North Texas October 2012 Alternate Sponsor Fellowship Pacific Northwest National Laboratoy June 2012 Alternate Sponsor Fellowship Pacific Northwest National Laboratoy June 2012 Alternate Sponsor Fellowship Pacific Northwest National Laboratoy June 2012 Invited Member of Phi Kappa Phi Phi Kappa Phi August 2011 Invited Member of Phi Kappa Phi Phi Kappa Phi August 2011 Invited Member of Phi Kappa Phi Phi Kappa Phi August 2011 4th position in Inter-university North Texas Student Symposium Material Advantage December 2012 4th position in Inter-university North Texas Student Symposium Material Advantage December 2012 4th position in Inter-university North Texas Student Symposium Material Advantage December 2012 Elected President of Metallurgical Society (METSO) NIT Raipur Dept of Materials Science NIT Raipur August 2008 Elected President of Metallurgical Society (METSO) NIT Raipur Dept of Materials Science NIT Raipur August 2008 Elected President of Metallurgical Society (METSO) NIT Raipur Dept of Materials Science NIT Raipur August 2008 Tolhouse Graduate School Travel Grant University of North Texas October 2011 Tolhouse Graduate School Travel Grant University of North Texas October 2011 Tolhouse Graduate School Travel Grant University of North Texas October 2011 Tolhouse Graduate School Travel Grant University of North Texas October 2012 Tolhouse Graduate School Travel Grant University of North Texas October 2012 Tolhouse Graduate School Travel Grant University of North Texas October 2012 ", "Experience Graduate Student The University of Alabama System August 2005  – Present (10 years 1 month) I am currently a PhD candidate at the University of Alabama (MINT center) and planning to graduate in spring 2010. My Research mainly involves with magnetic thin film deposition using PVD techniques. My expertise in fabrication processes includes sputter deposition, photolithography, e-beam lithography, ion milling, reactive ion etching, and e-beam evaporation.My research experiences have developed my strong interest and expertise in structural, electrical and magnetic characterization of materials using advanced techniques and instrumentation, for instance, , x-ray diffraction, electron microscopy, transport characterization and magnetometry. I am trained (but not experienced yet) on TEM, FIB and LEAP tools. Graduate Student The University of Alabama System August 2005  – Present (10 years 1 month) I am currently a PhD candidate at the University of Alabama (MINT center) and planning to graduate in spring 2010. My Research mainly involves with magnetic thin film deposition using PVD techniques. My expertise in fabrication processes includes sputter deposition, photolithography, e-beam lithography, ion milling, reactive ion etching, and e-beam evaporation.My research experiences have developed my strong interest and expertise in structural, electrical and magnetic characterization of materials using advanced techniques and instrumentation, for instance, , x-ray diffraction, electron microscopy, transport characterization and magnetometry. I am trained (but not experienced yet) on TEM, FIB and LEAP tools. Graduate Student The University of Alabama System August 2005  – Present (10 years 1 month) I am currently a PhD candidate at the University of Alabama (MINT center) and planning to graduate in spring 2010. My Research mainly involves with magnetic thin film deposition using PVD techniques. My expertise in fabrication processes includes sputter deposition, photolithography, e-beam lithography, ion milling, reactive ion etching, and e-beam evaporation.My research experiences have developed my strong interest and expertise in structural, electrical and magnetic characterization of materials using advanced techniques and instrumentation, for instance, , x-ray diffraction, electron microscopy, transport characterization and magnetometry. I am trained (but not experienced yet) on TEM, FIB and LEAP tools. Skills Skills     Education University of Alabama 2005  – 2010 University of Alabama PhD,  Material Science 2005  – 2010 University of Alabama 2005  – 2010 University of Alabama 2005  – 2010 University of Alabama 2005  – 2010 University of Alabama PhD,  Material Science 2005  – 2010 University of Alabama PhD,  Material Science 2005  – 2010 University of Alabama PhD,  Material Science 2005  – 2010 ", "Summary Career as a process development engineer Summary Career as a process development engineer Career as a process development engineer Career as a process development engineer Experience Process Development Engineer Intel Corporation June 2014  – Present (1 year 3 months) Hillsboro, OR Graduate Research Assistant The Research Foundation of SUNY August 2008  –  May 2014  (5 years 10 months) Developed thin film deposition processes for FEOL and BEOL applications \n \nDeveloped nanostructured catalyst support material manufacturing techniques for use in PEM fuel cells \n \nOperated/maintained 200-300 mm ALD, PEALD, CVD, and PECVD thin film processing equipment \n \nCharacterized thin film materials using SEM, XPS, AES, RBS, FTIR, Hg Probe, TEM, 4-point probe, etc. \n \nAided in the training of other personnel in the use of material processing and characterization equipment Graduate Intern - PECVD Business Unit Novellus June 2011  –  August 2011  (3 months) Tualatin, OR Data Analyst Center for Atmospheric and Space Sciences January 2007  –  May 2008  (1 year 5 months) Analized upper atmospheric gravity waves/air glow data Process Development Engineer Intel Corporation June 2014  – Present (1 year 3 months) Hillsboro, OR Process Development Engineer Intel Corporation June 2014  – Present (1 year 3 months) Hillsboro, OR Graduate Research Assistant The Research Foundation of SUNY August 2008  –  May 2014  (5 years 10 months) Developed thin film deposition processes for FEOL and BEOL applications \n \nDeveloped nanostructured catalyst support material manufacturing techniques for use in PEM fuel cells \n \nOperated/maintained 200-300 mm ALD, PEALD, CVD, and PECVD thin film processing equipment \n \nCharacterized thin film materials using SEM, XPS, AES, RBS, FTIR, Hg Probe, TEM, 4-point probe, etc. \n \nAided in the training of other personnel in the use of material processing and characterization equipment Graduate Research Assistant The Research Foundation of SUNY August 2008  –  May 2014  (5 years 10 months) Developed thin film deposition processes for FEOL and BEOL applications \n \nDeveloped nanostructured catalyst support material manufacturing techniques for use in PEM fuel cells \n \nOperated/maintained 200-300 mm ALD, PEALD, CVD, and PECVD thin film processing equipment \n \nCharacterized thin film materials using SEM, XPS, AES, RBS, FTIR, Hg Probe, TEM, 4-point probe, etc. \n \nAided in the training of other personnel in the use of material processing and characterization equipment Graduate Intern - PECVD Business Unit Novellus June 2011  –  August 2011  (3 months) Tualatin, OR Graduate Intern - PECVD Business Unit Novellus June 2011  –  August 2011  (3 months) Tualatin, OR Data Analyst Center for Atmospheric and Space Sciences January 2007  –  May 2008  (1 year 5 months) Analized upper atmospheric gravity waves/air glow data Data Analyst Center for Atmospheric and Space Sciences January 2007  –  May 2008  (1 year 5 months) Analized upper atmospheric gravity waves/air glow data Skills Top Skills 8 XPS 5 TEM 4 PECVD 4 Thin Films 3 CVD 2 FTIR 2 Characterization 2 Atomic Layer Deposition 1 Scanning Electron... 1 Four-point Probe Richard also knows about... 1 AES 1 RBS 1 Ellipsometry 1 Materials 1 Nanofabrication 1 TiO2 Skills  Top Skills 8 XPS 5 TEM 4 PECVD 4 Thin Films 3 CVD 2 FTIR 2 Characterization 2 Atomic Layer Deposition 1 Scanning Electron... 1 Four-point Probe Richard also knows about... 1 AES 1 RBS 1 Ellipsometry 1 Materials 1 Nanofabrication 1 TiO2 Top Skills 8 XPS 5 TEM 4 PECVD 4 Thin Films 3 CVD 2 FTIR 2 Characterization 2 Atomic Layer Deposition 1 Scanning Electron... 1 Four-point Probe Richard also knows about... 1 AES 1 RBS 1 Ellipsometry 1 Materials 1 Nanofabrication 1 TiO2 Top Skills 8 XPS 5 TEM 4 PECVD 4 Thin Films 3 CVD 2 FTIR 2 Characterization 2 Atomic Layer Deposition 1 Scanning Electron... 1 Four-point Probe Richard also knows about... 1 AES 1 RBS 1 Ellipsometry 1 Materials 1 Nanofabrication 1 TiO2                     1 AES 1 RBS 1 Ellipsometry 1 Materials 1 Nanofabrication 1 TiO2 Education SUNY Polytechnic Institute Ph.D,  Nanoscale Science 2008  – 2014 (Open) 10 courses Quantum mechanics (Liboff) Particle solid interactions Kinetics Surfaces and interfaces Analytic techniques TEM Electrochemical methods IC manufacturing Phase Equilibria Nanoscale Mechanics of Materials See more Utah State University Bachelor of Science Degree,  Physics 2006  – 2008 (Open) 5 courses Quantum Mechanics Advanced Electromagnetism Optics Thermodynamics Advanced Mechanics See more Utah Valley University Associate of Science Degree,  Mathematics 2004  – 2005 SUNY Polytechnic Institute Ph.D,  Nanoscale Science 2008  – 2014 (Open) 10 courses Quantum mechanics (Liboff) Particle solid interactions Kinetics Surfaces and interfaces Analytic techniques TEM Electrochemical methods IC manufacturing Phase Equilibria Nanoscale Mechanics of Materials See more SUNY Polytechnic Institute Ph.D,  Nanoscale Science 2008  – 2014 (Open) 10 courses Quantum mechanics (Liboff) Particle solid interactions Kinetics Surfaces and interfaces Analytic techniques TEM Electrochemical methods IC manufacturing Phase Equilibria Nanoscale Mechanics of Materials See more SUNY Polytechnic Institute Ph.D,  Nanoscale Science 2008  – 2014 (Open) 10 courses Quantum mechanics (Liboff) Particle solid interactions Kinetics Surfaces and interfaces Analytic techniques TEM Electrochemical methods IC manufacturing Phase Equilibria Nanoscale Mechanics of Materials See more Utah State University Bachelor of Science Degree,  Physics 2006  – 2008 (Open) 5 courses Quantum Mechanics Advanced Electromagnetism Optics Thermodynamics Advanced Mechanics See more Utah State University Bachelor of Science Degree,  Physics 2006  – 2008 (Open) 5 courses Quantum Mechanics Advanced Electromagnetism Optics Thermodynamics Advanced Mechanics See more Utah State University Bachelor of Science Degree,  Physics 2006  – 2008 (Open) 5 courses Quantum Mechanics Advanced Electromagnetism Optics Thermodynamics Advanced Mechanics See more Utah Valley University Associate of Science Degree,  Mathematics 2004  – 2005 Utah Valley University Associate of Science Degree,  Mathematics 2004  – 2005 Utah Valley University Associate of Science Degree,  Mathematics 2004  – 2005 ", "Summary PhD in Electrical and Computer Engineering Summary PhD in Electrical and Computer Engineering PhD in Electrical and Computer Engineering PhD in Electrical and Computer Engineering Experience PTD Engineer Intel Corporation September 2014  – Present (1 year) Portland, Oregon Area Graduate Research Assistant University of Florida May 2009  –  May 2014  (5 years 1 month) My area of research is RF integrated circuits and systems. Worked on low-power wireless interconnections for multicore processors. (Open) 1 recommendation Said Rami PTD Engineer at Intel Krishna is joy to work with because of his constant positive attitude and enthusiasm. This is supplemented with a diversified and solid background in digital and analog circuits. By volunteering for research at University of Florida, he demonstrated... View Internship Bharat Heavy Plates and Vessels Limited June 2006  –  July 2006  (2 months) Posted in Works Engineering (Electrical and Electronics) Department . PTD Engineer Intel Corporation September 2014  – Present (1 year) Portland, Oregon Area PTD Engineer Intel Corporation September 2014  – Present (1 year) Portland, Oregon Area Graduate Research Assistant University of Florida May 2009  –  May 2014  (5 years 1 month) My area of research is RF integrated circuits and systems. Worked on low-power wireless interconnections for multicore processors. (Open) 1 recommendation Said Rami PTD Engineer at Intel Krishna is joy to work with because of his constant positive attitude and enthusiasm. This is supplemented with a diversified and solid background in digital and analog circuits. By volunteering for research at University of Florida, he demonstrated... View Graduate Research Assistant University of Florida May 2009  –  May 2014  (5 years 1 month) My area of research is RF integrated circuits and systems. Worked on low-power wireless interconnections for multicore processors. (Open) 1 recommendation Said Rami PTD Engineer at Intel Krishna is joy to work with because of his constant positive attitude and enthusiasm. This is supplemented with a diversified and solid background in digital and analog circuits. By volunteering for research at University of Florida, he demonstrated... View Internship Bharat Heavy Plates and Vessels Limited June 2006  –  July 2006  (2 months) Posted in Works Engineering (Electrical and Electronics) Department . Internship Bharat Heavy Plates and Vessels Limited June 2006  –  July 2006  (2 months) Posted in Works Engineering (Electrical and Electronics) Department . Languages English Native or bilingual proficiency Telugu Native or bilingual proficiency Hindi Limited working proficiency Tamil Elementary proficiency English Native or bilingual proficiency Telugu Native or bilingual proficiency Hindi Limited working proficiency Tamil Elementary proficiency English Native or bilingual proficiency Telugu Native or bilingual proficiency Hindi Limited working proficiency Tamil Elementary proficiency Native or bilingual proficiency Native or bilingual proficiency Limited working proficiency Elementary proficiency Skills Top Skills 11 RF 11 Cadence Virtuoso 1 Agilent ADS 0 HFSS 9 Analog Circuit Design 3 Mixed-Signal IC Design 17 Simulations 13 IC 9 Computer Architecture 6 VLSI Krishna also knows about... 9 Matlab 5 Circuit Design 3 Cadence 1 Antennas 4 Algorithms 1 C++ 1 C Skills  Top Skills 11 RF 11 Cadence Virtuoso 1 Agilent ADS 0 HFSS 9 Analog Circuit Design 3 Mixed-Signal IC Design 17 Simulations 13 IC 9 Computer Architecture 6 VLSI Krishna also knows about... 9 Matlab 5 Circuit Design 3 Cadence 1 Antennas 4 Algorithms 1 C++ 1 C Top Skills 11 RF 11 Cadence Virtuoso 1 Agilent ADS 0 HFSS 9 Analog Circuit Design 3 Mixed-Signal IC Design 17 Simulations 13 IC 9 Computer Architecture 6 VLSI Krishna also knows about... 9 Matlab 5 Circuit Design 3 Cadence 1 Antennas 4 Algorithms 1 C++ 1 C Top Skills 11 RF 11 Cadence Virtuoso 1 Agilent ADS 0 HFSS 9 Analog Circuit Design 3 Mixed-Signal IC Design 17 Simulations 13 IC 9 Computer Architecture 6 VLSI Krishna also knows about... 9 Matlab 5 Circuit Design 3 Cadence 1 Antennas 4 Algorithms 1 C++ 1 C                     9 Matlab 5 Circuit Design 3 Cadence 1 Antennas 4 Algorithms 1 C++ 1 C Education University of Florida Doctor of Philosophy (Ph.D.),  Electrical and Computer Engineering 2010  – 2014 Dissertation Title : Multicore Microwave Wireless Communication System \n \nAreas of Research : 3DIC interconnect, Polarization differential antenna, Low power transmitters and receivers. Activities and Societies:  PhD Qualifier Chair ECEGSO ,  IEEE MTTS ,  Reviewer for IEEE ISCAS Conference 2011 ,  2012 ,  2013 (Open) 1 organization ECEGSO Organized review sessions for the PhD Qualifier preparatory groups for graduate students of ECE at University of Florida as an executive member of ECE Graduate Student Organization. View University of Florida M.S.,  Electrical and Computer Engineering 2008  – 2010 I have held the position of PhD qualifier chair in ECE Graduate Student Organization at University of Florida Activities and Societies:  IEEE ,  ECE Graduate Student Association (Open) 1 recommendation Manohar Balaram Associate at J. P. Morgan Krishna and I were project team mates in the Computer Architecture graduate level course at the University of Florida. We designed an Instruction Set Simulator that can run finite set of assembly level instructions. With Krishna's sound knowledge of... View Sathyabama University B.E,  Electrical and Electronics Engineering 2004  – 2008 (Open) 1 recommendation Girish Mahadevan Head-Content Management | Chief Information Architect Krishna has always been a very high profile guy. In academia, he was by far one of the very intelligent student of our college. He gets in things which matters most and does not get carried away by the floating opinions. He can act as a good stress... View University of Florida Doctor of Philosophy (Ph.D.),  Electrical and Computer Engineering 2010  – 2014 Dissertation Title : Multicore Microwave Wireless Communication System \n \nAreas of Research : 3DIC interconnect, Polarization differential antenna, Low power transmitters and receivers. Activities and Societies:  PhD Qualifier Chair ECEGSO ,  IEEE MTTS ,  Reviewer for IEEE ISCAS Conference 2011 ,  2012 ,  2013 (Open) 1 organization ECEGSO Organized review sessions for the PhD Qualifier preparatory groups for graduate students of ECE at University of Florida as an executive member of ECE Graduate Student Organization. View University of Florida Doctor of Philosophy (Ph.D.),  Electrical and Computer Engineering 2010  – 2014 Dissertation Title : Multicore Microwave Wireless Communication System \n \nAreas of Research : 3DIC interconnect, Polarization differential antenna, Low power transmitters and receivers. Activities and Societies:  PhD Qualifier Chair ECEGSO ,  IEEE MTTS ,  Reviewer for IEEE ISCAS Conference 2011 ,  2012 ,  2013 (Open) 1 organization ECEGSO Organized review sessions for the PhD Qualifier preparatory groups for graduate students of ECE at University of Florida as an executive member of ECE Graduate Student Organization. View University of Florida Doctor of Philosophy (Ph.D.),  Electrical and Computer Engineering 2010  – 2014 Dissertation Title : Multicore Microwave Wireless Communication System \n \nAreas of Research : 3DIC interconnect, Polarization differential antenna, Low power transmitters and receivers. Activities and Societies:  PhD Qualifier Chair ECEGSO ,  IEEE MTTS ,  Reviewer for IEEE ISCAS Conference 2011 ,  2012 ,  2013 (Open) 1 organization ECEGSO Organized review sessions for the PhD Qualifier preparatory groups for graduate students of ECE at University of Florida as an executive member of ECE Graduate Student Organization. View University of Florida M.S.,  Electrical and Computer Engineering 2008  – 2010 I have held the position of PhD qualifier chair in ECE Graduate Student Organization at University of Florida Activities and Societies:  IEEE ,  ECE Graduate Student Association (Open) 1 recommendation Manohar Balaram Associate at J. P. Morgan Krishna and I were project team mates in the Computer Architecture graduate level course at the University of Florida. We designed an Instruction Set Simulator that can run finite set of assembly level instructions. With Krishna's sound knowledge of... View University of Florida M.S.,  Electrical and Computer Engineering 2008  – 2010 I have held the position of PhD qualifier chair in ECE Graduate Student Organization at University of Florida Activities and Societies:  IEEE ,  ECE Graduate Student Association (Open) 1 recommendation Manohar Balaram Associate at J. P. Morgan Krishna and I were project team mates in the Computer Architecture graduate level course at the University of Florida. We designed an Instruction Set Simulator that can run finite set of assembly level instructions. With Krishna's sound knowledge of... View University of Florida M.S.,  Electrical and Computer Engineering 2008  – 2010 I have held the position of PhD qualifier chair in ECE Graduate Student Organization at University of Florida Activities and Societies:  IEEE ,  ECE Graduate Student Association (Open) 1 recommendation Manohar Balaram Associate at J. P. Morgan Krishna and I were project team mates in the Computer Architecture graduate level course at the University of Florida. We designed an Instruction Set Simulator that can run finite set of assembly level instructions. With Krishna's sound knowledge of... View Sathyabama University B.E,  Electrical and Electronics Engineering 2004  – 2008 (Open) 1 recommendation Girish Mahadevan Head-Content Management | Chief Information Architect Krishna has always been a very high profile guy. In academia, he was by far one of the very intelligent student of our college. He gets in things which matters most and does not get carried away by the floating opinions. He can act as a good stress... View Sathyabama University B.E,  Electrical and Electronics Engineering 2004  – 2008 (Open) 1 recommendation Girish Mahadevan Head-Content Management | Chief Information Architect Krishna has always been a very high profile guy. In academia, he was by far one of the very intelligent student of our college. He gets in things which matters most and does not get carried away by the floating opinions. He can act as a good stress... View Sathyabama University B.E,  Electrical and Electronics Engineering 2004  – 2008 (Open) 1 recommendation Girish Mahadevan Head-Content Management | Chief Information Architect Krishna has always been a very high profile guy. In academia, he was by far one of the very intelligent student of our college. He gets in things which matters most and does not get carried away by the floating opinions. He can act as a good stress... View ", "Summary •\tOver 9 years of experience in development of R&D based products and processes from conceptualization to commercialization. \n•\tManaged business development teams and logistics in multiple countries including US, Brazil, and India. \n•\tConsulting experience in product innovation using soft-nanotechnology principles with premier firms Schlumberger, Neutrogena, and Re-medium Technologies. \n•\tExceptional research credentials - 9 patents, 13 articles in peer-reviewed journals with 100+ citations and 12 conference presentations. Research featured in renowned scientific publications - “Nature”. \n \n \nIndustries -- Advanced Materials, Nanotechnology, Semiconductor Chip Manufacturing, Agrochemicals, Biotechnology, Alternative Energy. \n \nTechnical Expertise -- Soft nanotechnology, Smart Nanomaterials, Nano-encapsulation, Controlled Release, Formulation, Rheology, Polymers, Coatings, UV Curable, Design of Experiments, Statistical Analysis, Process Control, Algorithm Development. \n \nComputer Skills -- MATLAB, JMP, SQL Pathfinder, Simulink, Crystal Ball, C, Klarity Defect. \n \nInstrumentation -- Rheometry, Microscopy, SEM, TEM, Neutron Scattering, Light Scattering, UV-Vis Spectroscopy, HPLC, GPC, Zetasizer. Summary •\tOver 9 years of experience in development of R&D based products and processes from conceptualization to commercialization. \n•\tManaged business development teams and logistics in multiple countries including US, Brazil, and India. \n•\tConsulting experience in product innovation using soft-nanotechnology principles with premier firms Schlumberger, Neutrogena, and Re-medium Technologies. \n•\tExceptional research credentials - 9 patents, 13 articles in peer-reviewed journals with 100+ citations and 12 conference presentations. Research featured in renowned scientific publications - “Nature”. \n \n \nIndustries -- Advanced Materials, Nanotechnology, Semiconductor Chip Manufacturing, Agrochemicals, Biotechnology, Alternative Energy. \n \nTechnical Expertise -- Soft nanotechnology, Smart Nanomaterials, Nano-encapsulation, Controlled Release, Formulation, Rheology, Polymers, Coatings, UV Curable, Design of Experiments, Statistical Analysis, Process Control, Algorithm Development. \n \nComputer Skills -- MATLAB, JMP, SQL Pathfinder, Simulink, Crystal Ball, C, Klarity Defect. \n \nInstrumentation -- Rheometry, Microscopy, SEM, TEM, Neutron Scattering, Light Scattering, UV-Vis Spectroscopy, HPLC, GPC, Zetasizer. •\tOver 9 years of experience in development of R&D based products and processes from conceptualization to commercialization. \n•\tManaged business development teams and logistics in multiple countries including US, Brazil, and India. \n•\tConsulting experience in product innovation using soft-nanotechnology principles with premier firms Schlumberger, Neutrogena, and Re-medium Technologies. \n•\tExceptional research credentials - 9 patents, 13 articles in peer-reviewed journals with 100+ citations and 12 conference presentations. Research featured in renowned scientific publications - “Nature”. \n \n \nIndustries -- Advanced Materials, Nanotechnology, Semiconductor Chip Manufacturing, Agrochemicals, Biotechnology, Alternative Energy. \n \nTechnical Expertise -- Soft nanotechnology, Smart Nanomaterials, Nano-encapsulation, Controlled Release, Formulation, Rheology, Polymers, Coatings, UV Curable, Design of Experiments, Statistical Analysis, Process Control, Algorithm Development. \n \nComputer Skills -- MATLAB, JMP, SQL Pathfinder, Simulink, Crystal Ball, C, Klarity Defect. \n \nInstrumentation -- Rheometry, Microscopy, SEM, TEM, Neutron Scattering, Light Scattering, UV-Vis Spectroscopy, HPLC, GPC, Zetasizer. •\tOver 9 years of experience in development of R&D based products and processes from conceptualization to commercialization. \n•\tManaged business development teams and logistics in multiple countries including US, Brazil, and India. \n•\tConsulting experience in product innovation using soft-nanotechnology principles with premier firms Schlumberger, Neutrogena, and Re-medium Technologies. \n•\tExceptional research credentials - 9 patents, 13 articles in peer-reviewed journals with 100+ citations and 12 conference presentations. Research featured in renowned scientific publications - “Nature”. \n \n \nIndustries -- Advanced Materials, Nanotechnology, Semiconductor Chip Manufacturing, Agrochemicals, Biotechnology, Alternative Energy. \n \nTechnical Expertise -- Soft nanotechnology, Smart Nanomaterials, Nano-encapsulation, Controlled Release, Formulation, Rheology, Polymers, Coatings, UV Curable, Design of Experiments, Statistical Analysis, Process Control, Algorithm Development. \n \nComputer Skills -- MATLAB, JMP, SQL Pathfinder, Simulink, Crystal Ball, C, Klarity Defect. \n \nInstrumentation -- Rheometry, Microscopy, SEM, TEM, Neutron Scattering, Light Scattering, UV-Vis Spectroscopy, HPLC, GPC, Zetasizer. Experience Senior PTD Engineer Intel Corporation April 2011  – Present (4 years 5 months) Product Development Scientist Syngenta Crop Protection August 2009  –  March 2011  (1 year 8 months) Technical Responsibilities:  \n• Developed smart coatings for seeds to bind actives to seed surface, to prevent seed dehydration, and capable of trigger release in soil. \n• Multi-functional agrochemical treatments, new process designs, prototype testing, and novel method development. \n \n \nBusiness Responsibilities \n• Instrumental role in development of new seeb care coatings - from concept to commercialization. \n• Evaluated vendors, raw-materials, and equipment for sourcing and procurement in multiple countries. \n• Coordinated with global and diverse teams for knowledge transfer, strategic & tactical planning, and regulatory issues.  \n• Worked with lawyers for securing intellectual property rights for novel seed care coatings (3 patents). (Open) 1 recommendation Scott Loethen Scientist at PolyAd Services, Inc. I had the pleasure of working with Rakesh for about a year and a half, at Syngenta Crop Protection. We had adjacent offices and worked in labs down the hall from each other. He was always a great guy to talk to, very friendly and absolutely... View Research Assistant Univ. of Maryland May 2005  –  June 2009  (4 years 2 months) Inventions and Discoveries \n•\tDiscovered novel nano-structured materials whose flow properties can be tuned by light \n•\tDeveloped simple gels/films with reversible color changes on irradiation with lights \n•\tInvented new complex fluids that show an increase in viscosity on application of heat \n•\tNano-positioning of Q-dots on semiconductor chip for developing quantum devices (Open) 3 recommendations, including: Srinivasa Raghavan Professor and Patrick & Marguerite Sung Chair at University of Maryland Rakesh is an exceptional scientist! He takes a disciplined, strategic and thoughtful approach to a wide range of scientific... View Matthew Dowling CEO at Remedium Technologies Rakesh is an extremely bright scientist, an excellent writer/communicator and a diligent worker. My collaborations with him... View 1 more recommendation Consultant DaimlerChrysler R&D Centre, India March 2004  –  July 2004  (5 months) Led team in designing novel algorithms to predict rechargeable battery’s state of charge for applications in Hybrid Electric Vehicles. Developed using MATLAB and Simulink/TargetLink. \n \nInventor on patent: \"Estimation of State of Charge of a NiMH Battery using Preisach Inverse model of the Battery Hysteresis\". Research Associate National Chemical Laboratory, India October 2002  –  February 2004  (1 year 5 months) Designed hybrid pattern recognition algorithms using information theory principles to solve the process control and bioinformatics problems. Authored 4 peer-reviewed journal articles. \n \n1) Data Mining \n2) Statistical Analysis \n3) Predictive Algorithm Development \n4) Neural Networks and Support Vector Machines \n5) Evolutionary Optimization Algorithms \n6) Dimension Reduction and Feature Selection Techniques \n7) Principle Component Analysis Senior PTD Engineer Intel Corporation April 2011  – Present (4 years 5 months) Senior PTD Engineer Intel Corporation April 2011  – Present (4 years 5 months) Product Development Scientist Syngenta Crop Protection August 2009  –  March 2011  (1 year 8 months) Technical Responsibilities:  \n• Developed smart coatings for seeds to bind actives to seed surface, to prevent seed dehydration, and capable of trigger release in soil. \n• Multi-functional agrochemical treatments, new process designs, prototype testing, and novel method development. \n \n \nBusiness Responsibilities \n• Instrumental role in development of new seeb care coatings - from concept to commercialization. \n• Evaluated vendors, raw-materials, and equipment for sourcing and procurement in multiple countries. \n• Coordinated with global and diverse teams for knowledge transfer, strategic & tactical planning, and regulatory issues.  \n• Worked with lawyers for securing intellectual property rights for novel seed care coatings (3 patents). (Open) 1 recommendation Scott Loethen Scientist at PolyAd Services, Inc. I had the pleasure of working with Rakesh for about a year and a half, at Syngenta Crop Protection. We had adjacent offices and worked in labs down the hall from each other. He was always a great guy to talk to, very friendly and absolutely... View Product Development Scientist Syngenta Crop Protection August 2009  –  March 2011  (1 year 8 months) Technical Responsibilities:  \n• Developed smart coatings for seeds to bind actives to seed surface, to prevent seed dehydration, and capable of trigger release in soil. \n• Multi-functional agrochemical treatments, new process designs, prototype testing, and novel method development. \n \n \nBusiness Responsibilities \n• Instrumental role in development of new seeb care coatings - from concept to commercialization. \n• Evaluated vendors, raw-materials, and equipment for sourcing and procurement in multiple countries. \n• Coordinated with global and diverse teams for knowledge transfer, strategic & tactical planning, and regulatory issues.  \n• Worked with lawyers for securing intellectual property rights for novel seed care coatings (3 patents). (Open) 1 recommendation Scott Loethen Scientist at PolyAd Services, Inc. I had the pleasure of working with Rakesh for about a year and a half, at Syngenta Crop Protection. We had adjacent offices and worked in labs down the hall from each other. He was always a great guy to talk to, very friendly and absolutely... View Research Assistant Univ. of Maryland May 2005  –  June 2009  (4 years 2 months) Inventions and Discoveries \n•\tDiscovered novel nano-structured materials whose flow properties can be tuned by light \n•\tDeveloped simple gels/films with reversible color changes on irradiation with lights \n•\tInvented new complex fluids that show an increase in viscosity on application of heat \n•\tNano-positioning of Q-dots on semiconductor chip for developing quantum devices (Open) 3 recommendations, including: Srinivasa Raghavan Professor and Patrick & Marguerite Sung Chair at University of Maryland Rakesh is an exceptional scientist! He takes a disciplined, strategic and thoughtful approach to a wide range of scientific... View Matthew Dowling CEO at Remedium Technologies Rakesh is an extremely bright scientist, an excellent writer/communicator and a diligent worker. My collaborations with him... View 1 more recommendation Research Assistant Univ. of Maryland May 2005  –  June 2009  (4 years 2 months) Inventions and Discoveries \n•\tDiscovered novel nano-structured materials whose flow properties can be tuned by light \n•\tDeveloped simple gels/films with reversible color changes on irradiation with lights \n•\tInvented new complex fluids that show an increase in viscosity on application of heat \n•\tNano-positioning of Q-dots on semiconductor chip for developing quantum devices (Open) 3 recommendations, including: Srinivasa Raghavan Professor and Patrick & Marguerite Sung Chair at University of Maryland Rakesh is an exceptional scientist! He takes a disciplined, strategic and thoughtful approach to a wide range of scientific... View Matthew Dowling CEO at Remedium Technologies Rakesh is an extremely bright scientist, an excellent writer/communicator and a diligent worker. My collaborations with him... View 1 more recommendation Consultant DaimlerChrysler R&D Centre, India March 2004  –  July 2004  (5 months) Led team in designing novel algorithms to predict rechargeable battery’s state of charge for applications in Hybrid Electric Vehicles. Developed using MATLAB and Simulink/TargetLink. \n \nInventor on patent: \"Estimation of State of Charge of a NiMH Battery using Preisach Inverse model of the Battery Hysteresis\". Consultant DaimlerChrysler R&D Centre, India March 2004  –  July 2004  (5 months) Led team in designing novel algorithms to predict rechargeable battery’s state of charge for applications in Hybrid Electric Vehicles. Developed using MATLAB and Simulink/TargetLink. \n \nInventor on patent: \"Estimation of State of Charge of a NiMH Battery using Preisach Inverse model of the Battery Hysteresis\". Research Associate National Chemical Laboratory, India October 2002  –  February 2004  (1 year 5 months) Designed hybrid pattern recognition algorithms using information theory principles to solve the process control and bioinformatics problems. Authored 4 peer-reviewed journal articles. \n \n1) Data Mining \n2) Statistical Analysis \n3) Predictive Algorithm Development \n4) Neural Networks and Support Vector Machines \n5) Evolutionary Optimization Algorithms \n6) Dimension Reduction and Feature Selection Techniques \n7) Principle Component Analysis Research Associate National Chemical Laboratory, India October 2002  –  February 2004  (1 year 5 months) Designed hybrid pattern recognition algorithms using information theory principles to solve the process control and bioinformatics problems. Authored 4 peer-reviewed journal articles. \n \n1) Data Mining \n2) Statistical Analysis \n3) Predictive Algorithm Development \n4) Neural Networks and Support Vector Machines \n5) Evolutionary Optimization Algorithms \n6) Dimension Reduction and Feature Selection Techniques \n7) Principle Component Analysis Skills Top Skills 17 R&D 11 Nanotechnology 8 Design of Experiments 4 Polymers 3 Matlab 3 Characterization 1 Nanomaterials 1 Chemical Engineering 1 Spectroscopy 0 Coatings Skills  Top Skills 17 R&D 11 Nanotechnology 8 Design of Experiments 4 Polymers 3 Matlab 3 Characterization 1 Nanomaterials 1 Chemical Engineering 1 Spectroscopy 0 Coatings Top Skills 17 R&D 11 Nanotechnology 8 Design of Experiments 4 Polymers 3 Matlab 3 Characterization 1 Nanomaterials 1 Chemical Engineering 1 Spectroscopy 0 Coatings Top Skills 17 R&D 11 Nanotechnology 8 Design of Experiments 4 Polymers 3 Matlab 3 Characterization 1 Nanomaterials 1 Chemical Engineering 1 Spectroscopy 0 Coatings                     Education University of Maryland College Park PhD,  Chemical Engineering 2004  – 2009 Co-inventor on 5 patent applications, authored 9 peer-reviewed journal articles and 10+ conference presentations. \n \nDissertation: Smart Fluids: Self-Assembled Systems with Flow Properties Tunable by Light. Indian Institute of Technology, Kharagpur B. Tech,  Chemical Engineering 1998  – 2002 University of Maryland College Park PhD,  Chemical Engineering 2004  – 2009 Co-inventor on 5 patent applications, authored 9 peer-reviewed journal articles and 10+ conference presentations. \n \nDissertation: Smart Fluids: Self-Assembled Systems with Flow Properties Tunable by Light. University of Maryland College Park PhD,  Chemical Engineering 2004  – 2009 Co-inventor on 5 patent applications, authored 9 peer-reviewed journal articles and 10+ conference presentations. \n \nDissertation: Smart Fluids: Self-Assembled Systems with Flow Properties Tunable by Light. University of Maryland College Park PhD,  Chemical Engineering 2004  – 2009 Co-inventor on 5 patent applications, authored 9 peer-reviewed journal articles and 10+ conference presentations. \n \nDissertation: Smart Fluids: Self-Assembled Systems with Flow Properties Tunable by Light. Indian Institute of Technology, Kharagpur B. Tech,  Chemical Engineering 1998  – 2002 Indian Institute of Technology, Kharagpur B. Tech,  Chemical Engineering 1998  – 2002 Indian Institute of Technology, Kharagpur B. Tech,  Chemical Engineering 1998  – 2002 Honors & Awards Additional Honors & Awards 1) Ann G. Wylie Dissertation Fellowship, 2008. \n2) University of Maryland Award of Excellence for PhD research, 2008. \n3) Graduate Fellowship at the University of Maryland, 2004 - 2005. \n4) PhD research featured in scientific news media including Nature Materials, Science Daily, Materials Today, Chemical Processing. \n5) Received research funding from Defense Advanced Research Projects Agency (DARPA), USA. Additional Honors & Awards 1) Ann G. Wylie Dissertation Fellowship, 2008. \n2) University of Maryland Award of Excellence for PhD research, 2008. \n3) Graduate Fellowship at the University of Maryland, 2004 - 2005. \n4) PhD research featured in scientific news media including Nature Materials, Science Daily, Materials Today, Chemical Processing. \n5) Received research funding from Defense Advanced Research Projects Agency (DARPA), USA. Additional Honors & Awards 1) Ann G. Wylie Dissertation Fellowship, 2008. \n2) University of Maryland Award of Excellence for PhD research, 2008. \n3) Graduate Fellowship at the University of Maryland, 2004 - 2005. \n4) PhD research featured in scientific news media including Nature Materials, Science Daily, Materials Today, Chemical Processing. \n5) Received research funding from Defense Advanced Research Projects Agency (DARPA), USA. Additional Honors & Awards 1) Ann G. Wylie Dissertation Fellowship, 2008. \n2) University of Maryland Award of Excellence for PhD research, 2008. \n3) Graduate Fellowship at the University of Maryland, 2004 - 2005. \n4) PhD research featured in scientific news media including Nature Materials, Science Daily, Materials Today, Chemical Processing. \n5) Received research funding from Defense Advanced Research Projects Agency (DARPA), USA. ", "Experience PTD Engineer Intel Corporation July 2014  – Present (1 year 2 months) Ronler Acres Graduate student University of California- Santa Barbara July 2009  –  March 2014  (4 years 9 months) Design and synthesis of organic semiconducting polymers and small molecules for implementation into electronic devices, including light emitting diodes, field effect transistors and photovoltaics. Visiting Researcher University of Cambridge October 2010  –  November 2010  (2 months) Undergraduate Researcher Indiana University Department of Chemistry September 2006  –  May 2009  (2 years 9 months) Design and construction of novel ion-mobility spectrometry/mass-spectrometry instrumentation for increased resolution in ion-mobility separations. PTD Engineer Intel Corporation July 2014  – Present (1 year 2 months) Ronler Acres PTD Engineer Intel Corporation July 2014  – Present (1 year 2 months) Ronler Acres Graduate student University of California- Santa Barbara July 2009  –  March 2014  (4 years 9 months) Design and synthesis of organic semiconducting polymers and small molecules for implementation into electronic devices, including light emitting diodes, field effect transistors and photovoltaics. Graduate student University of California- Santa Barbara July 2009  –  March 2014  (4 years 9 months) Design and synthesis of organic semiconducting polymers and small molecules for implementation into electronic devices, including light emitting diodes, field effect transistors and photovoltaics. Visiting Researcher University of Cambridge October 2010  –  November 2010  (2 months) Visiting Researcher University of Cambridge October 2010  –  November 2010  (2 months) Undergraduate Researcher Indiana University Department of Chemistry September 2006  –  May 2009  (2 years 9 months) Design and construction of novel ion-mobility spectrometry/mass-spectrometry instrumentation for increased resolution in ion-mobility separations. Undergraduate Researcher Indiana University Department of Chemistry September 2006  –  May 2009  (2 years 9 months) Design and construction of novel ion-mobility spectrometry/mass-spectrometry instrumentation for increased resolution in ion-mobility separations. Skills Top Skills 7 Spectroscopy 7 Organic Chemistry 6 Materials Science 5 Chemistry 5 Characterization 5 Nanotechnology 4 NMR 4 Research 3 AFM 2 Organic Synthesis Zachary also knows about... 1 UV/Vis 1 Science 1 Physics 1 PowerPoint 1 Thin Films 1 Nanomaterials 0 Mass Spectrometry 0 Data Analysis 0 Polymer Chemistry 0 Polymer Characterization 0 Technical Writing 0 Technical Presentations Skills  Top Skills 7 Spectroscopy 7 Organic Chemistry 6 Materials Science 5 Chemistry 5 Characterization 5 Nanotechnology 4 NMR 4 Research 3 AFM 2 Organic Synthesis Zachary also knows about... 1 UV/Vis 1 Science 1 Physics 1 PowerPoint 1 Thin Films 1 Nanomaterials 0 Mass Spectrometry 0 Data Analysis 0 Polymer Chemistry 0 Polymer Characterization 0 Technical Writing 0 Technical Presentations Top Skills 7 Spectroscopy 7 Organic Chemistry 6 Materials Science 5 Chemistry 5 Characterization 5 Nanotechnology 4 NMR 4 Research 3 AFM 2 Organic Synthesis Zachary also knows about... 1 UV/Vis 1 Science 1 Physics 1 PowerPoint 1 Thin Films 1 Nanomaterials 0 Mass Spectrometry 0 Data Analysis 0 Polymer Chemistry 0 Polymer Characterization 0 Technical Writing 0 Technical Presentations Top Skills 7 Spectroscopy 7 Organic Chemistry 6 Materials Science 5 Chemistry 5 Characterization 5 Nanotechnology 4 NMR 4 Research 3 AFM 2 Organic Synthesis Zachary also knows about... 1 UV/Vis 1 Science 1 Physics 1 PowerPoint 1 Thin Films 1 Nanomaterials 0 Mass Spectrometry 0 Data Analysis 0 Polymer Chemistry 0 Polymer Characterization 0 Technical Writing 0 Technical Presentations                     1 UV/Vis 1 Science 1 Physics 1 PowerPoint 1 Thin Films 1 Nanomaterials 0 Mass Spectrometry 0 Data Analysis 0 Polymer Chemistry 0 Polymer Characterization 0 Technical Writing 0 Technical Presentations Education University of California, Santa Barbara Ph. D.,  Chemistry 2009  – 2014 (Open) 8 courses Synthesis and Electronic Structures of Conjugated Polymers Structure and Reactivity in Organic Chemistry Synthetic Chemistry of Macromolecules Organic Spectroscopic Analysis Organic Semiconductors for Energy Conversion Organic Electronic Devices Special Topics in Macromolecular Materials New Product Development See more Indiana University Bloomington Bachelor of Science (BSc),  Chemistry 2005  – 2009 University of California, Santa Barbara Ph. D.,  Chemistry 2009  – 2014 (Open) 8 courses Synthesis and Electronic Structures of Conjugated Polymers Structure and Reactivity in Organic Chemistry Synthetic Chemistry of Macromolecules Organic Spectroscopic Analysis Organic Semiconductors for Energy Conversion Organic Electronic Devices Special Topics in Macromolecular Materials New Product Development See more University of California, Santa Barbara Ph. D.,  Chemistry 2009  – 2014 (Open) 8 courses Synthesis and Electronic Structures of Conjugated Polymers Structure and Reactivity in Organic Chemistry Synthetic Chemistry of Macromolecules Organic Spectroscopic Analysis Organic Semiconductors for Energy Conversion Organic Electronic Devices Special Topics in Macromolecular Materials New Product Development See more University of California, Santa Barbara Ph. D.,  Chemistry 2009  – 2014 (Open) 8 courses Synthesis and Electronic Structures of Conjugated Polymers Structure and Reactivity in Organic Chemistry Synthetic Chemistry of Macromolecules Organic Spectroscopic Analysis Organic Semiconductors for Energy Conversion Organic Electronic Devices Special Topics in Macromolecular Materials New Product Development See more Indiana University Bloomington Bachelor of Science (BSc),  Chemistry 2005  – 2009 Indiana University Bloomington Bachelor of Science (BSc),  Chemistry 2005  – 2009 Indiana University Bloomington Bachelor of Science (BSc),  Chemistry 2005  – 2009 ", "Summary 1. Commitment: Strong commitment in collaboration breeds breakthrough velocity enabling for fully integrated MotherBoard/Pan delivery & STHI start-up project. This earns recognition from ATM Achievement Award and Divisional Recognition Award. \n2. Quality: Demonstrate highest standards of excellence in work quality such as delivered detail and qualitative DFM review feedbacks which help to achieve quality board layout in all the Haswell tester boards. \n3. Problem Solving: Lead task force to carry out few DOE and strain gauge measurement to collect the data and do the risk assessment on minor crack on NCTF balls issue. The data collection is used to make the final decision on the disposition. The team has managed to reduce the defect rate from 90% to 14.3%. \n4.Result orientation: Always practice result orientated on his job, he focus on output gain from his work. Willing to spend more time to check on DFM for each motherboard tapeout and provide the detailed DFM feedback to design team to ensure the design is meets the DFM requirement, this is important to make sure the product build can be executed flawlessly. Summary 1. Commitment: Strong commitment in collaboration breeds breakthrough velocity enabling for fully integrated MotherBoard/Pan delivery & STHI start-up project. This earns recognition from ATM Achievement Award and Divisional Recognition Award. \n2. Quality: Demonstrate highest standards of excellence in work quality such as delivered detail and qualitative DFM review feedbacks which help to achieve quality board layout in all the Haswell tester boards. \n3. Problem Solving: Lead task force to carry out few DOE and strain gauge measurement to collect the data and do the risk assessment on minor crack on NCTF balls issue. The data collection is used to make the final decision on the disposition. The team has managed to reduce the defect rate from 90% to 14.3%. \n4.Result orientation: Always practice result orientated on his job, he focus on output gain from his work. Willing to spend more time to check on DFM for each motherboard tapeout and provide the detailed DFM feedback to design team to ensure the design is meets the DFM requirement, this is important to make sure the product build can be executed flawlessly. 1. Commitment: Strong commitment in collaboration breeds breakthrough velocity enabling for fully integrated MotherBoard/Pan delivery & STHI start-up project. This earns recognition from ATM Achievement Award and Divisional Recognition Award. \n2. Quality: Demonstrate highest standards of excellence in work quality such as delivered detail and qualitative DFM review feedbacks which help to achieve quality board layout in all the Haswell tester boards. \n3. Problem Solving: Lead task force to carry out few DOE and strain gauge measurement to collect the data and do the risk assessment on minor crack on NCTF balls issue. The data collection is used to make the final decision on the disposition. The team has managed to reduce the defect rate from 90% to 14.3%. \n4.Result orientation: Always practice result orientated on his job, he focus on output gain from his work. Willing to spend more time to check on DFM for each motherboard tapeout and provide the detailed DFM feedback to design team to ensure the design is meets the DFM requirement, this is important to make sure the product build can be executed flawlessly. 1. Commitment: Strong commitment in collaboration breeds breakthrough velocity enabling for fully integrated MotherBoard/Pan delivery & STHI start-up project. This earns recognition from ATM Achievement Award and Divisional Recognition Award. \n2. Quality: Demonstrate highest standards of excellence in work quality such as delivered detail and qualitative DFM review feedbacks which help to achieve quality board layout in all the Haswell tester boards. \n3. Problem Solving: Lead task force to carry out few DOE and strain gauge measurement to collect the data and do the risk assessment on minor crack on NCTF balls issue. The data collection is used to make the final decision on the disposition. The team has managed to reduce the defect rate from 90% to 14.3%. \n4.Result orientation: Always practice result orientated on his job, he focus on output gain from his work. Willing to spend more time to check on DFM for each motherboard tapeout and provide the detailed DFM feedback to design team to ensure the design is meets the DFM requirement, this is important to make sure the product build can be executed flawlessly. Experience PTD engineer Intel Corporation August 2011  – Present (4 years 1 month) Malaysia Working with Intel Business Unit design team to provide design feedback at various design tapeout milestone, and to seek best solution and mitigation to project issues/design violation to ensure a successful product launch. Key contributor in product development team and working closely with factory process engineering and manufacturing team to ensure a robust process and manufacturing solution through comprehensive product FMEA and Risk assessment. Freelance Photographer N/A 2012  –  2013  (1 year) Taking photo as free time hobby PTD engineer Intel Corporation August 2011  – Present (4 years 1 month) Malaysia Working with Intel Business Unit design team to provide design feedback at various design tapeout milestone, and to seek best solution and mitigation to project issues/design violation to ensure a successful product launch. Key contributor in product development team and working closely with factory process engineering and manufacturing team to ensure a robust process and manufacturing solution through comprehensive product FMEA and Risk assessment. PTD engineer Intel Corporation August 2011  – Present (4 years 1 month) Malaysia Working with Intel Business Unit design team to provide design feedback at various design tapeout milestone, and to seek best solution and mitigation to project issues/design violation to ensure a successful product launch. Key contributor in product development team and working closely with factory process engineering and manufacturing team to ensure a robust process and manufacturing solution through comprehensive product FMEA and Risk assessment. Freelance Photographer N/A 2012  –  2013  (1 year) Taking photo as free time hobby Freelance Photographer N/A 2012  –  2013  (1 year) Taking photo as free time hobby Skills Top Skills 5 Manufacturing 5 Design for Manufacturing 4 Design of Experiments 3 Solidworks 3 AutoCAD 2 Engineering 2 FMEA 2 Microsoft Office 1 Matlab 1 Labview Khang Teik also knows about... 1 CAD 0 Engineering Management 0 Semiconductors 0 SPC 0 Simulations 0 Failure Analysis 0 Lean Manufacturing 0 Pro Engineer 0 Microsoft Excel 0 Electronics 0 Six Sigma 0 PTC Creo 0 R 0 Manufacturing... Skills  Top Skills 5 Manufacturing 5 Design for Manufacturing 4 Design of Experiments 3 Solidworks 3 AutoCAD 2 Engineering 2 FMEA 2 Microsoft Office 1 Matlab 1 Labview Khang Teik also knows about... 1 CAD 0 Engineering Management 0 Semiconductors 0 SPC 0 Simulations 0 Failure Analysis 0 Lean Manufacturing 0 Pro Engineer 0 Microsoft Excel 0 Electronics 0 Six Sigma 0 PTC Creo 0 R 0 Manufacturing... Top Skills 5 Manufacturing 5 Design for Manufacturing 4 Design of Experiments 3 Solidworks 3 AutoCAD 2 Engineering 2 FMEA 2 Microsoft Office 1 Matlab 1 Labview Khang Teik also knows about... 1 CAD 0 Engineering Management 0 Semiconductors 0 SPC 0 Simulations 0 Failure Analysis 0 Lean Manufacturing 0 Pro Engineer 0 Microsoft Excel 0 Electronics 0 Six Sigma 0 PTC Creo 0 R 0 Manufacturing... Top Skills 5 Manufacturing 5 Design for Manufacturing 4 Design of Experiments 3 Solidworks 3 AutoCAD 2 Engineering 2 FMEA 2 Microsoft Office 1 Matlab 1 Labview Khang Teik also knows about... 1 CAD 0 Engineering Management 0 Semiconductors 0 SPC 0 Simulations 0 Failure Analysis 0 Lean Manufacturing 0 Pro Engineer 0 Microsoft Excel 0 Electronics 0 Six Sigma 0 PTC Creo 0 R 0 Manufacturing...                     1 CAD 0 Engineering Management 0 Semiconductors 0 SPC 0 Simulations 0 Failure Analysis 0 Lean Manufacturing 0 Pro Engineer 0 Microsoft Excel 0 Electronics 0 Six Sigma 0 PTC Creo 0 R 0 Manufacturing... Education UNIVERSITY MALAYA Bachelor Degree,  Mechanical Engineering 2007  – 2011 Study Mechanical engineering, Doing project of \"Renewable Energy technology: PEM fuel cell membrane study\" Activities and Societies:  Reserve Officer Training Unit ,  ASHRAE Chung Ling Butterworth High school graduate,  Physical Sciences 2001  – 2005 Activities and Societies:  Karate Club black belt holder ,  Chinese Calligraphy club vise president UNIVERSITY MALAYA Bachelor Degree,  Mechanical Engineering 2007  – 2011 Study Mechanical engineering, Doing project of \"Renewable Energy technology: PEM fuel cell membrane study\" Activities and Societies:  Reserve Officer Training Unit ,  ASHRAE UNIVERSITY MALAYA Bachelor Degree,  Mechanical Engineering 2007  – 2011 Study Mechanical engineering, Doing project of \"Renewable Energy technology: PEM fuel cell membrane study\" Activities and Societies:  Reserve Officer Training Unit ,  ASHRAE UNIVERSITY MALAYA Bachelor Degree,  Mechanical Engineering 2007  – 2011 Study Mechanical engineering, Doing project of \"Renewable Energy technology: PEM fuel cell membrane study\" Activities and Societies:  Reserve Officer Training Unit ,  ASHRAE Chung Ling Butterworth High school graduate,  Physical Sciences 2001  – 2005 Activities and Societies:  Karate Club black belt holder ,  Chinese Calligraphy club vise president Chung Ling Butterworth High school graduate,  Physical Sciences 2001  – 2005 Activities and Societies:  Karate Club black belt holder ,  Chinese Calligraphy club vise president Chung Ling Butterworth High school graduate,  Physical Sciences 2001  – 2005 Activities and Societies:  Karate Club black belt holder ,  Chinese Calligraphy club vise president "]}