{"position": "PTD Senior Process Engineer", "company": "Intel Corporation", "profiles": ["", "Summary Highly technical with a background in chemistry, various spectroscopies, and manufacturing process development. Summary Highly technical with a background in chemistry, various spectroscopies, and manufacturing process development. Highly technical with a background in chemistry, various spectroscopies, and manufacturing process development. Highly technical with a background in chemistry, various spectroscopies, and manufacturing process development. Experience PTD Senior Process Engineer Intel Corporation September 2012  –  May 2015  (2 years 9 months) Hillsboro, OR - Developed vital, robust and challenging etch processes for future technologies in collaboration with vendor engineers; worked with tool vendors to successfully deliver a new process in less than two weeks. \n- Sustained a plasma-etch fleet in a 24/7 manufacturing environment for two technology generations in Intel’s Portland Technology Development. \n- Managed infrastructure and documentation as a subject matter expert in sustaining and development practices. \n- Utilized JMP software for analysis and SQL-like database queries; presented development progress data and proposals to focus teams and taskforces. PTD Senior Process Engineer Intel Corporation September 2012  –  May 2015  (2 years 9 months) Hillsboro, OR - Developed vital, robust and challenging etch processes for future technologies in collaboration with vendor engineers; worked with tool vendors to successfully deliver a new process in less than two weeks. \n- Sustained a plasma-etch fleet in a 24/7 manufacturing environment for two technology generations in Intel’s Portland Technology Development. \n- Managed infrastructure and documentation as a subject matter expert in sustaining and development practices. \n- Utilized JMP software for analysis and SQL-like database queries; presented development progress data and proposals to focus teams and taskforces. PTD Senior Process Engineer Intel Corporation September 2012  –  May 2015  (2 years 9 months) Hillsboro, OR - Developed vital, robust and challenging etch processes for future technologies in collaboration with vendor engineers; worked with tool vendors to successfully deliver a new process in less than two weeks. \n- Sustained a plasma-etch fleet in a 24/7 manufacturing environment for two technology generations in Intel’s Portland Technology Development. \n- Managed infrastructure and documentation as a subject matter expert in sustaining and development practices. \n- Utilized JMP software for analysis and SQL-like database queries; presented development progress data and proposals to focus teams and taskforces. Skills Product Development Cross-functional Team... Semiconductors Manufacturing Spectroscopy Scanning Electron... Plasma Etch Surface Chemistry Nonlinear Optics Planned Preventative... JMP SPC Skills  Product Development Cross-functional Team... Semiconductors Manufacturing Spectroscopy Scanning Electron... Plasma Etch Surface Chemistry Nonlinear Optics Planned Preventative... JMP SPC Product Development Cross-functional Team... Semiconductors Manufacturing Spectroscopy Scanning Electron... Plasma Etch Surface Chemistry Nonlinear Optics Planned Preventative... JMP SPC Product Development Cross-functional Team... Semiconductors Manufacturing Spectroscopy Scanning Electron... Plasma Etch Surface Chemistry Nonlinear Optics Planned Preventative... JMP SPC Education Northwestern University Doctor of Philosophy (PhD),  Physical Chemistry 2007  – 2012 Linfield College Bachelor of Science (B.S.),  Chemistry 2003  – 2007 Northwestern University Doctor of Philosophy (PhD),  Physical Chemistry 2007  – 2012 Northwestern University Doctor of Philosophy (PhD),  Physical Chemistry 2007  – 2012 Northwestern University Doctor of Philosophy (PhD),  Physical Chemistry 2007  – 2012 Linfield College Bachelor of Science (B.S.),  Chemistry 2003  – 2007 Linfield College Bachelor of Science (B.S.),  Chemistry 2003  – 2007 Linfield College Bachelor of Science (B.S.),  Chemistry 2003  – 2007 ", "Experience Senior Scientist Johns Hopkins University Applied Physics Laboratory August 2012  – Present (3 years 1 month) Laurel, MD Senior Scientist Johns Hopkins University Applied Physics Laboratory August 2012  – Present (3 years 1 month) Laurel, MD Senior Scientist Johns Hopkins University Applied Physics Laboratory August 2012  – Present (3 years 1 month) Laurel, MD Skills Physics Nanotechnology Characterization Thin Films Materials Science Spectroscopy AFM Scientific Computing Experimentation Nanofabrication Skills  Physics Nanotechnology Characterization Thin Films Materials Science Spectroscopy AFM Scientific Computing Experimentation Nanofabrication Physics Nanotechnology Characterization Thin Films Materials Science Spectroscopy AFM Scientific Computing Experimentation Nanofabrication Physics Nanotechnology Characterization Thin Films Materials Science Spectroscopy AFM Scientific Computing Experimentation Nanofabrication Education University of Illinois at Urbana-Champaign Doctor of Philosophy (Ph.D.),  Physics 2003  – 2010 North Carolina State University B.S.,  Physics 1998  – 2002 University of Illinois at Urbana-Champaign Doctor of Philosophy (Ph.D.),  Physics 2003  – 2010 University of Illinois at Urbana-Champaign Doctor of Philosophy (Ph.D.),  Physics 2003  – 2010 University of Illinois at Urbana-Champaign Doctor of Philosophy (Ph.D.),  Physics 2003  – 2010 North Carolina State University B.S.,  Physics 1998  – 2002 North Carolina State University B.S.,  Physics 1998  – 2002 North Carolina State University B.S.,  Physics 1998  – 2002 ", "Experience PTD Senior Process Engineer Intel Corporation July 2012  – Present (3 years 2 months) Portland, Oregon Area Senior Process Engineer, working in the Thin Films - FE Metals group in the Portland Technology Development division of Intel. Responsible for materials, process, and manufacturing development activities within that group. Graduate Research Assistant University of Michigan September 2007  –  April 2012  (4 years 8 months) Carried out research in compound III-V semiconductor growth, strained layer heterostructure growth, ion beam and implantation response of the III-V compound semiconductors, ion beam creation of semiconductor nanostructors, and semiconductor thin film characterization. Graduate Student Research Assistant Purdue University August 2005  –  August 2007  (2 years 1 month) West Lafayette, IN Carried out research on lead free solder development, nanoparticle properties and melting, and nanoparticle characterization. Also conducted some additional work with board-level IC packaging materials. Materials Intern GE Aviation May 2005  –  August 2005  (4 months) materials characterization and failure analysis during summer months of 2005, 2004, and 2003 PTD Senior Process Engineer Intel Corporation July 2012  – Present (3 years 2 months) Portland, Oregon Area Senior Process Engineer, working in the Thin Films - FE Metals group in the Portland Technology Development division of Intel. Responsible for materials, process, and manufacturing development activities within that group. PTD Senior Process Engineer Intel Corporation July 2012  – Present (3 years 2 months) Portland, Oregon Area Senior Process Engineer, working in the Thin Films - FE Metals group in the Portland Technology Development division of Intel. Responsible for materials, process, and manufacturing development activities within that group. Graduate Research Assistant University of Michigan September 2007  –  April 2012  (4 years 8 months) Carried out research in compound III-V semiconductor growth, strained layer heterostructure growth, ion beam and implantation response of the III-V compound semiconductors, ion beam creation of semiconductor nanostructors, and semiconductor thin film characterization. Graduate Research Assistant University of Michigan September 2007  –  April 2012  (4 years 8 months) Carried out research in compound III-V semiconductor growth, strained layer heterostructure growth, ion beam and implantation response of the III-V compound semiconductors, ion beam creation of semiconductor nanostructors, and semiconductor thin film characterization. Graduate Student Research Assistant Purdue University August 2005  –  August 2007  (2 years 1 month) West Lafayette, IN Carried out research on lead free solder development, nanoparticle properties and melting, and nanoparticle characterization. Also conducted some additional work with board-level IC packaging materials. Graduate Student Research Assistant Purdue University August 2005  –  August 2007  (2 years 1 month) West Lafayette, IN Carried out research on lead free solder development, nanoparticle properties and melting, and nanoparticle characterization. Also conducted some additional work with board-level IC packaging materials. Materials Intern GE Aviation May 2005  –  August 2005  (4 months) materials characterization and failure analysis during summer months of 2005, 2004, and 2003 Materials Intern GE Aviation May 2005  –  August 2005  (4 months) materials characterization and failure analysis during summer months of 2005, 2004, and 2003 Skills Thin Films Semiconductors Scanning Electron... Materials Science Vacuum Chambers Process Engineering Microscopy Characterization Vacuum Deposition Semiconductor Process Electron Microscopy Compound Semiconductors TEM X-ray Diffraction... Statistical Process... Molecular Beam Epitaxy Chemical Vapor... Physical Vapor... Research Atomic Layer Deposition Design of Experiments See 6+     See less Skills  Thin Films Semiconductors Scanning Electron... Materials Science Vacuum Chambers Process Engineering Microscopy Characterization Vacuum Deposition Semiconductor Process Electron Microscopy Compound Semiconductors TEM X-ray Diffraction... Statistical Process... Molecular Beam Epitaxy Chemical Vapor... Physical Vapor... Research Atomic Layer Deposition Design of Experiments See 6+     See less Thin Films Semiconductors Scanning Electron... Materials Science Vacuum Chambers Process Engineering Microscopy Characterization Vacuum Deposition Semiconductor Process Electron Microscopy Compound Semiconductors TEM X-ray Diffraction... Statistical Process... Molecular Beam Epitaxy Chemical Vapor... Physical Vapor... Research Atomic Layer Deposition Design of Experiments See 6+     See less Thin Films Semiconductors Scanning Electron... Materials Science Vacuum Chambers Process Engineering Microscopy Characterization Vacuum Deposition Semiconductor Process Electron Microscopy Compound Semiconductors TEM X-ray Diffraction... Statistical Process... Molecular Beam Epitaxy Chemical Vapor... Physical Vapor... Research Atomic Layer Deposition Design of Experiments See 6+     See less Education University of Michigan Doctor of Philosophy (PhD),  Materials Science and Engineering 2007  – 2012 Materials Science and Engineering with a focus on III-V semiconductor thin film growth and materials characterization Purdue University Master of Science (M.S.),  Materials Engineering 2005  – 2007 Purdue University Bachelor of Science (B.S.),  Materials Engineering 2001  – 2005 Activities and Societies:  Purdue Engineering Student Council University of Michigan Doctor of Philosophy (PhD),  Materials Science and Engineering 2007  – 2012 Materials Science and Engineering with a focus on III-V semiconductor thin film growth and materials characterization University of Michigan Doctor of Philosophy (PhD),  Materials Science and Engineering 2007  – 2012 Materials Science and Engineering with a focus on III-V semiconductor thin film growth and materials characterization University of Michigan Doctor of Philosophy (PhD),  Materials Science and Engineering 2007  – 2012 Materials Science and Engineering with a focus on III-V semiconductor thin film growth and materials characterization Purdue University Master of Science (M.S.),  Materials Engineering 2005  – 2007 Purdue University Master of Science (M.S.),  Materials Engineering 2005  – 2007 Purdue University Master of Science (M.S.),  Materials Engineering 2005  – 2007 Purdue University Bachelor of Science (B.S.),  Materials Engineering 2001  – 2005 Activities and Societies:  Purdue Engineering Student Council Purdue University Bachelor of Science (B.S.),  Materials Engineering 2001  – 2005 Activities and Societies:  Purdue Engineering Student Council Purdue University Bachelor of Science (B.S.),  Materials Engineering 2001  – 2005 Activities and Societies:  Purdue Engineering Student Council ", "Summary Designing, building, and implementing optical systems in order to address looming questions in cellular (and more specifically viral) biology. Specialties:Optical system design, programming, and cell culture work Summary Designing, building, and implementing optical systems in order to address looming questions in cellular (and more specifically viral) biology. Specialties:Optical system design, programming, and cell culture work Designing, building, and implementing optical systems in order to address looming questions in cellular (and more specifically viral) biology. Specialties:Optical system design, programming, and cell culture work Designing, building, and implementing optical systems in order to address looming questions in cellular (and more specifically viral) biology. Specialties:Optical system design, programming, and cell culture work Experience PTD Senior Process Engineer Intel Corporation October 2011  – Present (3 years 11 months) Hillsboro, Oregon Wet chemical etch of silicon wafers. \nPlasma dry etch of silicon wafers. Postdoctoral Scholar NSF Center for Biophotonics June 2011  –  September 2011  (4 months) Sacramento, California Area Operating a structured illumination, deconvolution, spinning disk confocal, and laser tweezers microscope to study HIV-1 cell-cell transmission and liver sinusoidal endothelial cell fenestrations. \n \nCollaborations include siRNA knockdown of neurodegenerative diseases, echoviral 1 uptake, and traumatic brain injury. PhD Candidate in Biophysics UC Davis September 2005  –  June 2011  (5 years 10 months) Laboratory of Dr. Thomas R. Huser, Department of Internal Medicine and Senior Research Scientist at the NSF Center for Biophotonics Science and technology  \n \nOperated both a structured illumination microscope (two different versions) and deconvolution microscope to study HIV-1 cell-cell transmission and liver sinusoidal endothelial cell fenestrations. \n \nTwo- 3 months research internships in Finland for research on live-cell echovirus 1 uptake in osteosarcoma cells under the NSF Doctoral Dissertation Enhancement Program travel award. \n \nAssembled a multiwavelength spinning disk confocal microscope using fast timing electronics, an acousto-optical tunable filter and NIR laser tweezers (fixed beam and spatial light modulator driven) to study live dynamics of HIV-1 cell-cell transmission. \n \nOrganized the laser safety equipment and paperwork as well as regular maintenance and calendar management of three different microscopes. \n \nDeveloped a duel mode coherent anti-Stokes Raman scattering microscope with time-correlated single photon counting capabilities. \n \nTrained six interns and two graduate students in optics, object-oriented programming & macros, cell culture, and image analysis. \n \nBuilt several optics labs/setups from scratch. \n \nSuccessful biological collaborations including (1) calcium wave imaging in embryonic stem cell derived cardiac myocytes with Dr. Ronald Li, (2) autophagocytosis in prostate cancer cells with Hsing-Jien Kung, (3) chemical and mechanical traumatic brain injury in mouse models with Dr. Gene Gurkoff, and (4) siRNA knockdown of neurodegenerative diseases with Dr. Jan Nolta. Undergraduate Internship UC Davis June 2003  –  August 2005  (2 years 3 months) Laboratory of Dr. Stephen Cramer, Department of Applied Science and Engineering and Lawrence Berkeley National Labs \n \nDetermining enzyme mechanics though laboratory and synchrotron based spectroscopes complimented with DFT simulations and vibration mode analysis; techniques included IR, FTIR, Resonance Raman, XAS, RIXS, NRVS, and XMCD at the ALS (Lawrence Berkeley National Laboratory), APS (Argonne East National Laboratory), and SPring-8 (Japan). \n \nDesigned and implemented the research group’s webpage using PHP, Apache, and MySQL. \n \nAssisted in the rebuild of the laboratory infrastructure under Dr. Matthew Smith. Internship Photonics Industries International, Inc September 2004  –  December 2004  (4 months) Built and performed quality control of diode pumped Nd glass harmonic (0.20-40 W fundamental) and tunable Ti:sapphire lasers. Summer Internship UC Davis June 2002  –  September 2002  (4 months) Laboratory of Dr. Case Van Dam, Mechanical and Aeronautical Engineering Department at UC Davis.  \n \nBasic analysis of trends in wind turbine designs. PTD Senior Process Engineer Intel Corporation October 2011  – Present (3 years 11 months) Hillsboro, Oregon Wet chemical etch of silicon wafers. \nPlasma dry etch of silicon wafers. PTD Senior Process Engineer Intel Corporation October 2011  – Present (3 years 11 months) Hillsboro, Oregon Wet chemical etch of silicon wafers. \nPlasma dry etch of silicon wafers. Postdoctoral Scholar NSF Center for Biophotonics June 2011  –  September 2011  (4 months) Sacramento, California Area Operating a structured illumination, deconvolution, spinning disk confocal, and laser tweezers microscope to study HIV-1 cell-cell transmission and liver sinusoidal endothelial cell fenestrations. \n \nCollaborations include siRNA knockdown of neurodegenerative diseases, echoviral 1 uptake, and traumatic brain injury. Postdoctoral Scholar NSF Center for Biophotonics June 2011  –  September 2011  (4 months) Sacramento, California Area Operating a structured illumination, deconvolution, spinning disk confocal, and laser tweezers microscope to study HIV-1 cell-cell transmission and liver sinusoidal endothelial cell fenestrations. \n \nCollaborations include siRNA knockdown of neurodegenerative diseases, echoviral 1 uptake, and traumatic brain injury. PhD Candidate in Biophysics UC Davis September 2005  –  June 2011  (5 years 10 months) Laboratory of Dr. Thomas R. Huser, Department of Internal Medicine and Senior Research Scientist at the NSF Center for Biophotonics Science and technology  \n \nOperated both a structured illumination microscope (two different versions) and deconvolution microscope to study HIV-1 cell-cell transmission and liver sinusoidal endothelial cell fenestrations. \n \nTwo- 3 months research internships in Finland for research on live-cell echovirus 1 uptake in osteosarcoma cells under the NSF Doctoral Dissertation Enhancement Program travel award. \n \nAssembled a multiwavelength spinning disk confocal microscope using fast timing electronics, an acousto-optical tunable filter and NIR laser tweezers (fixed beam and spatial light modulator driven) to study live dynamics of HIV-1 cell-cell transmission. \n \nOrganized the laser safety equipment and paperwork as well as regular maintenance and calendar management of three different microscopes. \n \nDeveloped a duel mode coherent anti-Stokes Raman scattering microscope with time-correlated single photon counting capabilities. \n \nTrained six interns and two graduate students in optics, object-oriented programming & macros, cell culture, and image analysis. \n \nBuilt several optics labs/setups from scratch. \n \nSuccessful biological collaborations including (1) calcium wave imaging in embryonic stem cell derived cardiac myocytes with Dr. Ronald Li, (2) autophagocytosis in prostate cancer cells with Hsing-Jien Kung, (3) chemical and mechanical traumatic brain injury in mouse models with Dr. Gene Gurkoff, and (4) siRNA knockdown of neurodegenerative diseases with Dr. Jan Nolta. PhD Candidate in Biophysics UC Davis September 2005  –  June 2011  (5 years 10 months) Laboratory of Dr. Thomas R. Huser, Department of Internal Medicine and Senior Research Scientist at the NSF Center for Biophotonics Science and technology  \n \nOperated both a structured illumination microscope (two different versions) and deconvolution microscope to study HIV-1 cell-cell transmission and liver sinusoidal endothelial cell fenestrations. \n \nTwo- 3 months research internships in Finland for research on live-cell echovirus 1 uptake in osteosarcoma cells under the NSF Doctoral Dissertation Enhancement Program travel award. \n \nAssembled a multiwavelength spinning disk confocal microscope using fast timing electronics, an acousto-optical tunable filter and NIR laser tweezers (fixed beam and spatial light modulator driven) to study live dynamics of HIV-1 cell-cell transmission. \n \nOrganized the laser safety equipment and paperwork as well as regular maintenance and calendar management of three different microscopes. \n \nDeveloped a duel mode coherent anti-Stokes Raman scattering microscope with time-correlated single photon counting capabilities. \n \nTrained six interns and two graduate students in optics, object-oriented programming & macros, cell culture, and image analysis. \n \nBuilt several optics labs/setups from scratch. \n \nSuccessful biological collaborations including (1) calcium wave imaging in embryonic stem cell derived cardiac myocytes with Dr. Ronald Li, (2) autophagocytosis in prostate cancer cells with Hsing-Jien Kung, (3) chemical and mechanical traumatic brain injury in mouse models with Dr. Gene Gurkoff, and (4) siRNA knockdown of neurodegenerative diseases with Dr. Jan Nolta. Undergraduate Internship UC Davis June 2003  –  August 2005  (2 years 3 months) Laboratory of Dr. Stephen Cramer, Department of Applied Science and Engineering and Lawrence Berkeley National Labs \n \nDetermining enzyme mechanics though laboratory and synchrotron based spectroscopes complimented with DFT simulations and vibration mode analysis; techniques included IR, FTIR, Resonance Raman, XAS, RIXS, NRVS, and XMCD at the ALS (Lawrence Berkeley National Laboratory), APS (Argonne East National Laboratory), and SPring-8 (Japan). \n \nDesigned and implemented the research group’s webpage using PHP, Apache, and MySQL. \n \nAssisted in the rebuild of the laboratory infrastructure under Dr. Matthew Smith. Undergraduate Internship UC Davis June 2003  –  August 2005  (2 years 3 months) Laboratory of Dr. Stephen Cramer, Department of Applied Science and Engineering and Lawrence Berkeley National Labs \n \nDetermining enzyme mechanics though laboratory and synchrotron based spectroscopes complimented with DFT simulations and vibration mode analysis; techniques included IR, FTIR, Resonance Raman, XAS, RIXS, NRVS, and XMCD at the ALS (Lawrence Berkeley National Laboratory), APS (Argonne East National Laboratory), and SPring-8 (Japan). \n \nDesigned and implemented the research group’s webpage using PHP, Apache, and MySQL. \n \nAssisted in the rebuild of the laboratory infrastructure under Dr. Matthew Smith. Internship Photonics Industries International, Inc September 2004  –  December 2004  (4 months) Built and performed quality control of diode pumped Nd glass harmonic (0.20-40 W fundamental) and tunable Ti:sapphire lasers. Internship Photonics Industries International, Inc September 2004  –  December 2004  (4 months) Built and performed quality control of diode pumped Nd glass harmonic (0.20-40 W fundamental) and tunable Ti:sapphire lasers. Summer Internship UC Davis June 2002  –  September 2002  (4 months) Laboratory of Dr. Case Van Dam, Mechanical and Aeronautical Engineering Department at UC Davis.  \n \nBasic analysis of trends in wind turbine designs. Summer Internship UC Davis June 2002  –  September 2002  (4 months) Laboratory of Dr. Case Van Dam, Mechanical and Aeronautical Engineering Department at UC Davis.  \n \nBasic analysis of trends in wind turbine designs. Skills Optics Programming Fluorescence Microscopy Confocal Microscopy Cell Culture Optical Microscopy Biochemistry Image Analysis Laser Digital Imaging Biophysics Cell Microscopy Spectroscopy Skills  Optics Programming Fluorescence Microscopy Confocal Microscopy Cell Culture Optical Microscopy Biochemistry Image Analysis Laser Digital Imaging Biophysics Cell Microscopy Spectroscopy Optics Programming Fluorescence Microscopy Confocal Microscopy Cell Culture Optical Microscopy Biochemistry Image Analysis Laser Digital Imaging Biophysics Cell Microscopy Spectroscopy Optics Programming Fluorescence Microscopy Confocal Microscopy Cell Culture Optical Microscopy Biochemistry Image Analysis Laser Digital Imaging Biophysics Cell Microscopy Spectroscopy Education University of California, Davis Ph.D. in Biophysics with a Designated Emphasis in Biophotonics,  Biophysics ,  Biophotonics , HIV virology,  Optics 2005  – 2011 Dissertation title of 'Exploring the limits of optical microscopy: live cell and super-resolution fluorescence microscopy of HIV-1 transfer between T lymphocytes across the virological synapse' Activities and Societies:  SPIE ,  OSA ,  AAAS ,  Society of Physics Students ,  Center for Biophotonics Graduate Student Representative University of California, Davis B.S. in Optical Science & Engineering,  Optics , Optoelectronics, Programming 2000  – 2005 Activities and Societies:  UC Davis Optics Club ,  SPIE ,  OSA ,  Undergraduate Internship University of California, Davis Ph.D. in Biophysics with a Designated Emphasis in Biophotonics,  Biophysics ,  Biophotonics , HIV virology,  Optics 2005  – 2011 Dissertation title of 'Exploring the limits of optical microscopy: live cell and super-resolution fluorescence microscopy of HIV-1 transfer between T lymphocytes across the virological synapse' Activities and Societies:  SPIE ,  OSA ,  AAAS ,  Society of Physics Students ,  Center for Biophotonics Graduate Student Representative University of California, Davis Ph.D. in Biophysics with a Designated Emphasis in Biophotonics,  Biophysics ,  Biophotonics , HIV virology,  Optics 2005  – 2011 Dissertation title of 'Exploring the limits of optical microscopy: live cell and super-resolution fluorescence microscopy of HIV-1 transfer between T lymphocytes across the virological synapse' Activities and Societies:  SPIE ,  OSA ,  AAAS ,  Society of Physics Students ,  Center for Biophotonics Graduate Student Representative University of California, Davis Ph.D. in Biophysics with a Designated Emphasis in Biophotonics,  Biophysics ,  Biophotonics , HIV virology,  Optics 2005  – 2011 Dissertation title of 'Exploring the limits of optical microscopy: live cell and super-resolution fluorescence microscopy of HIV-1 transfer between T lymphocytes across the virological synapse' Activities and Societies:  SPIE ,  OSA ,  AAAS ,  Society of Physics Students ,  Center for Biophotonics Graduate Student Representative University of California, Davis B.S. in Optical Science & Engineering,  Optics , Optoelectronics, Programming 2000  – 2005 Activities and Societies:  UC Davis Optics Club ,  SPIE ,  OSA ,  Undergraduate Internship University of California, Davis B.S. in Optical Science & Engineering,  Optics , Optoelectronics, Programming 2000  – 2005 Activities and Societies:  UC Davis Optics Club ,  SPIE ,  OSA ,  Undergraduate Internship University of California, Davis B.S. in Optical Science & Engineering,  Optics , Optoelectronics, Programming 2000  – 2005 Activities and Societies:  UC Davis Optics Club ,  SPIE ,  OSA ,  Undergraduate Internship Honors & Awards Additional Honors & Awards Outstanding Graduate Student Presentation Award for Contributions to the 2007 CBST Annual Retreat, 2007 CBST Annual Retreat, Squaw Creek, CA (2007). \n \n2007 Graduate Student Award of ‘Above and Beyond’ for Outstanding Contributions to the Education Efforts of CBST, 2007 CSBT Annual Retreat, Squaw Creek, CA (2007). \n \nOutstanding Oral Presentation in Imaging, 11th UC Systemwide 2010 Bioengineering Symposium, Davis, CA (2010). Additional Honors & Awards Outstanding Graduate Student Presentation Award for Contributions to the 2007 CBST Annual Retreat, 2007 CBST Annual Retreat, Squaw Creek, CA (2007). \n \n2007 Graduate Student Award of ‘Above and Beyond’ for Outstanding Contributions to the Education Efforts of CBST, 2007 CSBT Annual Retreat, Squaw Creek, CA (2007). \n \nOutstanding Oral Presentation in Imaging, 11th UC Systemwide 2010 Bioengineering Symposium, Davis, CA (2010). Additional Honors & Awards Outstanding Graduate Student Presentation Award for Contributions to the 2007 CBST Annual Retreat, 2007 CBST Annual Retreat, Squaw Creek, CA (2007). \n \n2007 Graduate Student Award of ‘Above and Beyond’ for Outstanding Contributions to the Education Efforts of CBST, 2007 CSBT Annual Retreat, Squaw Creek, CA (2007). \n \nOutstanding Oral Presentation in Imaging, 11th UC Systemwide 2010 Bioengineering Symposium, Davis, CA (2010). Additional Honors & Awards Outstanding Graduate Student Presentation Award for Contributions to the 2007 CBST Annual Retreat, 2007 CBST Annual Retreat, Squaw Creek, CA (2007). \n \n2007 Graduate Student Award of ‘Above and Beyond’ for Outstanding Contributions to the Education Efforts of CBST, 2007 CSBT Annual Retreat, Squaw Creek, CA (2007). \n \nOutstanding Oral Presentation in Imaging, 11th UC Systemwide 2010 Bioengineering Symposium, Davis, CA (2010). "]}