{"position": "RET Engineer", "company": "Intel Corporation", "profiles": ["Experience RET Engineer Intel Corporation September 2012  – Present (3 years) hillsboro, or, usa Perform optical proximity correction (OPC) and resolution enhancement techniques (RET) on lithographic mask designs to ensure the desired shapes are transferred to the wafer. Specifically, I develop and tune the code that is used to perform the correction. Research Assistant Penn State University August 2007  –  August 2012  (5 years 1 month) University Park, PA Used chemical theory and computational techniques to explore the optical properties of molecules on the surface of metallic systems. Developed mathematical models of these physical phenomena. Implemented mathematical models into user-friendly high-performance software using various computer languages (Fortran, python, etc.) and high-performance techniques (OpenMP, MPI, multipole methods). Created a computational chemistry library in python to aid in chemistry research. Designed a graphical application to teach high school students the optical properties of nanoparticles. Proposed and tested a new theoretical model to understand the non-resonant chemical mechanism of surface enhanced Raman scattering (SERS). Participated in an experimental collaboration to understand the role of charge transfer in the SERS spectrum of the dye methane blue on graphene. Supervising Teaching Assistant Penn State University September 2008  –  April 2009  (8 months) University Park, PA Supervised 8+ teaching assistants at a time during a general chemistry laboratory period. Took care of administrative and disciplinary actions. Conducted weekly meetings. NSF-REU University of Maine May 2005  –  August 2005  (4 months) Orono, ME Monitored the UV-induced cross-linking of liposomes using a combination of IR and Raman spectroscopy. Designed a flow cell to perform IR spectroscopy of aqueous systems in real time. Sales Associate Sherwin Williams 2000  –  2005  (5 years) Lewiston, ME Stock shelves, match colors. RET Engineer Intel Corporation September 2012  – Present (3 years) hillsboro, or, usa Perform optical proximity correction (OPC) and resolution enhancement techniques (RET) on lithographic mask designs to ensure the desired shapes are transferred to the wafer. Specifically, I develop and tune the code that is used to perform the correction. RET Engineer Intel Corporation September 2012  – Present (3 years) hillsboro, or, usa Perform optical proximity correction (OPC) and resolution enhancement techniques (RET) on lithographic mask designs to ensure the desired shapes are transferred to the wafer. Specifically, I develop and tune the code that is used to perform the correction. Research Assistant Penn State University August 2007  –  August 2012  (5 years 1 month) University Park, PA Used chemical theory and computational techniques to explore the optical properties of molecules on the surface of metallic systems. Developed mathematical models of these physical phenomena. Implemented mathematical models into user-friendly high-performance software using various computer languages (Fortran, python, etc.) and high-performance techniques (OpenMP, MPI, multipole methods). Created a computational chemistry library in python to aid in chemistry research. Designed a graphical application to teach high school students the optical properties of nanoparticles. Proposed and tested a new theoretical model to understand the non-resonant chemical mechanism of surface enhanced Raman scattering (SERS). Participated in an experimental collaboration to understand the role of charge transfer in the SERS spectrum of the dye methane blue on graphene. Research Assistant Penn State University August 2007  –  August 2012  (5 years 1 month) University Park, PA Used chemical theory and computational techniques to explore the optical properties of molecules on the surface of metallic systems. Developed mathematical models of these physical phenomena. Implemented mathematical models into user-friendly high-performance software using various computer languages (Fortran, python, etc.) and high-performance techniques (OpenMP, MPI, multipole methods). Created a computational chemistry library in python to aid in chemistry research. Designed a graphical application to teach high school students the optical properties of nanoparticles. Proposed and tested a new theoretical model to understand the non-resonant chemical mechanism of surface enhanced Raman scattering (SERS). Participated in an experimental collaboration to understand the role of charge transfer in the SERS spectrum of the dye methane blue on graphene. Supervising Teaching Assistant Penn State University September 2008  –  April 2009  (8 months) University Park, PA Supervised 8+ teaching assistants at a time during a general chemistry laboratory period. Took care of administrative and disciplinary actions. Conducted weekly meetings. Supervising Teaching Assistant Penn State University September 2008  –  April 2009  (8 months) University Park, PA Supervised 8+ teaching assistants at a time during a general chemistry laboratory period. Took care of administrative and disciplinary actions. Conducted weekly meetings. NSF-REU University of Maine May 2005  –  August 2005  (4 months) Orono, ME Monitored the UV-induced cross-linking of liposomes using a combination of IR and Raman spectroscopy. Designed a flow cell to perform IR spectroscopy of aqueous systems in real time. NSF-REU University of Maine May 2005  –  August 2005  (4 months) Orono, ME Monitored the UV-induced cross-linking of liposomes using a combination of IR and Raman spectroscopy. Designed a flow cell to perform IR spectroscopy of aqueous systems in real time. Sales Associate Sherwin Williams 2000  –  2005  (5 years) Lewiston, ME Stock shelves, match colors. Sales Associate Sherwin Williams 2000  –  2005  (5 years) Lewiston, ME Stock shelves, match colors. Skills Chemistry Python Mathematical Modeling Lithography Spectroscopy C++ Nanoparticles Fortran Research Raman Computational Chemistry Nanotechnology IR spectroscopy Nanomaterials Physics Programming High Performance... Physical Chemistry LaTeX Simulations Scientific Computing MPI Science See 8+     See less Skills  Chemistry Python Mathematical Modeling Lithography Spectroscopy C++ Nanoparticles Fortran Research Raman Computational Chemistry Nanotechnology IR spectroscopy Nanomaterials Physics Programming High Performance... Physical Chemistry LaTeX Simulations Scientific Computing MPI Science See 8+     See less Chemistry Python Mathematical Modeling Lithography Spectroscopy C++ Nanoparticles Fortran Research Raman Computational Chemistry Nanotechnology IR spectroscopy Nanomaterials Physics Programming High Performance... Physical Chemistry LaTeX Simulations Scientific Computing MPI Science See 8+     See less Chemistry Python Mathematical Modeling Lithography Spectroscopy C++ Nanoparticles Fortran Research Raman Computational Chemistry Nanotechnology IR spectroscopy Nanomaterials Physics Programming High Performance... Physical Chemistry LaTeX Simulations Scientific Computing MPI Science See 8+     See less Education Penn State University PhD,  Chemistry 2007  – 2012 University of Maine BS,  Chemistry , 3.88 2002  – 2007 Penn State University PhD,  Chemistry 2007  – 2012 Penn State University PhD,  Chemistry 2007  – 2012 Penn State University PhD,  Chemistry 2007  – 2012 University of Maine BS,  Chemistry , 3.88 2002  – 2007 University of Maine BS,  Chemistry , 3.88 2002  – 2007 University of Maine BS,  Chemistry , 3.88 2002  – 2007 ", "Experience RET Engineer Intel Corporation July 2012  – Present (3 years 2 months) Hillsboro, OR Physics PhD candidate Oregon State University September 2005  –  June 2012  (6 years 10 months) Applied Optics and Optoelectronic properties of Organic Semiconductors RET Engineer Intel Corporation July 2012  – Present (3 years 2 months) Hillsboro, OR RET Engineer Intel Corporation July 2012  – Present (3 years 2 months) Hillsboro, OR Physics PhD candidate Oregon State University September 2005  –  June 2012  (6 years 10 months) Applied Optics and Optoelectronic properties of Organic Semiconductors Physics PhD candidate Oregon State University September 2005  –  June 2012  (6 years 10 months) Applied Optics and Optoelectronic properties of Organic Semiconductors Skills Higher Education Research Teaching Matlab Public Speaking Student Development Statistics Data Analysis Science Community Outreach Skills  Higher Education Research Teaching Matlab Public Speaking Student Development Statistics Data Analysis Science Community Outreach Higher Education Research Teaching Matlab Public Speaking Student Development Statistics Data Analysis Science Community Outreach Higher Education Research Teaching Matlab Public Speaking Student Development Statistics Data Analysis Science Community Outreach ", "Experience Process Engineer Intel Corporation July 2014  – Present (1 year 2 months) Micro-contamination Engineer Intel November 2010  –  July 2014  (3 years 9 months) RET Engineer Intel Corporation December 2006  –  November 2010  (4 years) Development of reticle test layout and modeling of the lithograph process. Process Engineer Intel Corporation July 2014  – Present (1 year 2 months) Process Engineer Intel Corporation July 2014  – Present (1 year 2 months) Micro-contamination Engineer Intel November 2010  –  July 2014  (3 years 9 months) Micro-contamination Engineer Intel November 2010  –  July 2014  (3 years 9 months) RET Engineer Intel Corporation December 2006  –  November 2010  (4 years) Development of reticle test layout and modeling of the lithograph process. RET Engineer Intel Corporation December 2006  –  November 2010  (4 years) Development of reticle test layout and modeling of the lithograph process. Skills Engineering Design of Experiments Semiconductors Characterization Cross-functional Team... Materials Science Nanotechnology R SPC Simulations Skills  Engineering Design of Experiments Semiconductors Characterization Cross-functional Team... Materials Science Nanotechnology R SPC Simulations Engineering Design of Experiments Semiconductors Characterization Cross-functional Team... Materials Science Nanotechnology R SPC Simulations Engineering Design of Experiments Semiconductors Characterization Cross-functional Team... Materials Science Nanotechnology R SPC Simulations Education University of Michigan Ph.D,  Chemical engineering 2001  – 2006 The University of New Mexico B.S.,  Chemical engineering 1996  – 2001 University of Michigan Ph.D,  Chemical engineering 2001  – 2006 University of Michigan Ph.D,  Chemical engineering 2001  – 2006 University of Michigan Ph.D,  Chemical engineering 2001  – 2006 The University of New Mexico B.S.,  Chemical engineering 1996  – 2001 The University of New Mexico B.S.,  Chemical engineering 1996  – 2001 The University of New Mexico B.S.,  Chemical engineering 1996  – 2001 ", "Experience RET Design Engineer Intel Corporation August 2014  – Present (1 year 1 month) RET Design Engineer Intel Corporation August 2014  – Present (1 year 1 month) RET Design Engineer Intel Corporation August 2014  – Present (1 year 1 month) Languages   Skills Skills     Education UC Berkeley Doctor of Philosophy (Ph.D.),  Condensed Matter and Materials Physics 2008  – 2014 National Taiwan University Bachelor of Science (B.S.),  Physics 2002  – 2006 UC Berkeley Doctor of Philosophy (Ph.D.),  Condensed Matter and Materials Physics 2008  – 2014 UC Berkeley Doctor of Philosophy (Ph.D.),  Condensed Matter and Materials Physics 2008  – 2014 UC Berkeley Doctor of Philosophy (Ph.D.),  Condensed Matter and Materials Physics 2008  – 2014 National Taiwan University Bachelor of Science (B.S.),  Physics 2002  – 2006 National Taiwan University Bachelor of Science (B.S.),  Physics 2002  – 2006 National Taiwan University Bachelor of Science (B.S.),  Physics 2002  – 2006 Honors & Awards ", "Experience Senior Principal RET Engineer Intel Corporation March 1998  – Present (17 years 6 months) Hillsboro, Oregon Senior Principal RET Engineer Intel Corporation March 1998  – Present (17 years 6 months) Hillsboro, Oregon Senior Principal RET Engineer Intel Corporation March 1998  – Present (17 years 6 months) Hillsboro, Oregon Education University of Illinois at Urbana-Champaign Doctor of Philosophy (Ph.D.),  Physical Chemistry Experimental and theoretical study of coherent control of chemical reactions University of Illinois at Urbana-Champaign Doctor of Philosophy (Ph.D.),  Physical Chemistry Experimental and theoretical study of coherent control of chemical reactions University of Illinois at Urbana-Champaign Doctor of Philosophy (Ph.D.),  Physical Chemistry Experimental and theoretical study of coherent control of chemical reactions University of Illinois at Urbana-Champaign Doctor of Philosophy (Ph.D.),  Physical Chemistry Experimental and theoretical study of coherent control of chemical reactions ", "Summary Performed doctoral research focusing on studying small organic radicals and other reactive intermediates in the gas phase to understand their electronic structure and thermochemical properties. Have a strong background in chemical physics and molecular spectroscopy. Have experience working with complex instrumentation, trouble-shooting, custom machining and designing/building electronics, project management, and team leadership. \n \nCurrently working at Intel as an RET Engineer. Specialties:vacuum technologies, electronics, machining, lasers, optics, electron detection, ion optics, data analysis, problem solving Summary Performed doctoral research focusing on studying small organic radicals and other reactive intermediates in the gas phase to understand their electronic structure and thermochemical properties. Have a strong background in chemical physics and molecular spectroscopy. Have experience working with complex instrumentation, trouble-shooting, custom machining and designing/building electronics, project management, and team leadership. \n \nCurrently working at Intel as an RET Engineer. Specialties:vacuum technologies, electronics, machining, lasers, optics, electron detection, ion optics, data analysis, problem solving Performed doctoral research focusing on studying small organic radicals and other reactive intermediates in the gas phase to understand their electronic structure and thermochemical properties. Have a strong background in chemical physics and molecular spectroscopy. Have experience working with complex instrumentation, trouble-shooting, custom machining and designing/building electronics, project management, and team leadership. \n \nCurrently working at Intel as an RET Engineer. Specialties:vacuum technologies, electronics, machining, lasers, optics, electron detection, ion optics, data analysis, problem solving Performed doctoral research focusing on studying small organic radicals and other reactive intermediates in the gas phase to understand their electronic structure and thermochemical properties. Have a strong background in chemical physics and molecular spectroscopy. Have experience working with complex instrumentation, trouble-shooting, custom machining and designing/building electronics, project management, and team leadership. \n \nCurrently working at Intel as an RET Engineer. Specialties:vacuum technologies, electronics, machining, lasers, optics, electron detection, ion optics, data analysis, problem solving Experience RET Engineer Intel Corporation February 2012  – Present (3 years 7 months) RET Engineer Intel January 2012  – Present (3 years 8 months) Hillsboro Oregon Research and Development for next generation chips. Working in the Resolution Enhancement Technology (RET) group in Portland. JILA Graduate Research Assistant University of Colorado January 2006  –  December 2011  (6 years) Performed self-directed research, requiring thorough understanding of laser technology, optics, high vacuums systems, electronics, custom machining, gas-phase chemistry, instrument design, and computer interfacing with instrumentation. \nIndependently authored technical papers, which include six publications appearing in peer reviewed journals (a complete list available on request).  \nWorked extensively with Igor, SigmaPlot, Mathematica, Endnote, PowerPoint, Excel, Word. LabView, Gaussian. Soccer Manager/Coach Coed Adult Soccer Team, Boulder Parks & Recreation January 2006  –  December 2011  (6 years) Graduate Student Representative JILA January 2008  –  June 2011  (3 years 6 months) Responsible for representing opinions, interests and concerns of 80 JILA graduate students in front of JILA Department Fellows, which included influencing faculty members to overhaul department's safety procedures through direct interactions. Math and Science Tutor University of Colorado Athletics Department August 2007  –  May 2008  (10 months) Tutored student athletes in Math and Chemistry Graduate Research Assistant University of Colorado June 2005  –  June 2006  (1 year 1 month) Designed and built Raman Spectroscopy lab experiment for undergraduate Physical Chemistry lab class. \nAuthored lab manual and instructions for lab experiment with experiment fully integrated into curriculum after completion. Graduate Teaching Assistant University of Colorado August 2005  –  May 2006  (10 months) Facilitated advanced physical chemistry lab of 20 students, including organizing science labs, providing brief lectures, and answering questions. \nIndependently directed Chemistry course review sessions for 40 undergraduate students requiring help with problem sets and lecture material; graded/evaluated student performance.  \nSeminar Series Coordinator, 2008 - Present \nCoordinated logistics for approximately 15 campus-wide seminars over three year period. Responsibilities include writing grant proposals, creating budgets, recruiting and organizing travel for invited speakers. This resulted in attracting nationally recognized scientists from industry, academia, and national labs to speak with campus-wide attendance of graduate students. Undergraduate Research Assistant University of Oregon & UC Davis June 2004  –  July 2005  (1 year 2 months) Worked as a NSF REU research student at the University of Oregon for 10 weeks studying liquid/liquid interfaces using vibrational sum-frequency spectroscopy. Required use of visible and tunable IR laser beams. \nStudied charge transfer in Ruthenium complexes using ultrafast X-ray absorption spectroscopy at UC Davis under Ting Guo. Rental Center Manager and Employee Outdoor Adventures, UC Davis August 2003  –  May 2005  (1 year 10 months) RET Engineer Intel Corporation February 2012  – Present (3 years 7 months) RET Engineer Intel Corporation February 2012  – Present (3 years 7 months) RET Engineer Intel January 2012  – Present (3 years 8 months) Hillsboro Oregon Research and Development for next generation chips. Working in the Resolution Enhancement Technology (RET) group in Portland. RET Engineer Intel January 2012  – Present (3 years 8 months) Hillsboro Oregon Research and Development for next generation chips. Working in the Resolution Enhancement Technology (RET) group in Portland. JILA Graduate Research Assistant University of Colorado January 2006  –  December 2011  (6 years) Performed self-directed research, requiring thorough understanding of laser technology, optics, high vacuums systems, electronics, custom machining, gas-phase chemistry, instrument design, and computer interfacing with instrumentation. \nIndependently authored technical papers, which include six publications appearing in peer reviewed journals (a complete list available on request).  \nWorked extensively with Igor, SigmaPlot, Mathematica, Endnote, PowerPoint, Excel, Word. LabView, Gaussian. JILA Graduate Research Assistant University of Colorado January 2006  –  December 2011  (6 years) Performed self-directed research, requiring thorough understanding of laser technology, optics, high vacuums systems, electronics, custom machining, gas-phase chemistry, instrument design, and computer interfacing with instrumentation. \nIndependently authored technical papers, which include six publications appearing in peer reviewed journals (a complete list available on request).  \nWorked extensively with Igor, SigmaPlot, Mathematica, Endnote, PowerPoint, Excel, Word. LabView, Gaussian. Soccer Manager/Coach Coed Adult Soccer Team, Boulder Parks & Recreation January 2006  –  December 2011  (6 years) Soccer Manager/Coach Coed Adult Soccer Team, Boulder Parks & Recreation January 2006  –  December 2011  (6 years) Graduate Student Representative JILA January 2008  –  June 2011  (3 years 6 months) Responsible for representing opinions, interests and concerns of 80 JILA graduate students in front of JILA Department Fellows, which included influencing faculty members to overhaul department's safety procedures through direct interactions. Graduate Student Representative JILA January 2008  –  June 2011  (3 years 6 months) Responsible for representing opinions, interests and concerns of 80 JILA graduate students in front of JILA Department Fellows, which included influencing faculty members to overhaul department's safety procedures through direct interactions. Math and Science Tutor University of Colorado Athletics Department August 2007  –  May 2008  (10 months) Tutored student athletes in Math and Chemistry Math and Science Tutor University of Colorado Athletics Department August 2007  –  May 2008  (10 months) Tutored student athletes in Math and Chemistry Graduate Research Assistant University of Colorado June 2005  –  June 2006  (1 year 1 month) Designed and built Raman Spectroscopy lab experiment for undergraduate Physical Chemistry lab class. \nAuthored lab manual and instructions for lab experiment with experiment fully integrated into curriculum after completion. Graduate Research Assistant University of Colorado June 2005  –  June 2006  (1 year 1 month) Designed and built Raman Spectroscopy lab experiment for undergraduate Physical Chemistry lab class. \nAuthored lab manual and instructions for lab experiment with experiment fully integrated into curriculum after completion. Graduate Teaching Assistant University of Colorado August 2005  –  May 2006  (10 months) Facilitated advanced physical chemistry lab of 20 students, including organizing science labs, providing brief lectures, and answering questions. \nIndependently directed Chemistry course review sessions for 40 undergraduate students requiring help with problem sets and lecture material; graded/evaluated student performance.  \nSeminar Series Coordinator, 2008 - Present \nCoordinated logistics for approximately 15 campus-wide seminars over three year period. Responsibilities include writing grant proposals, creating budgets, recruiting and organizing travel for invited speakers. This resulted in attracting nationally recognized scientists from industry, academia, and national labs to speak with campus-wide attendance of graduate students. Graduate Teaching Assistant University of Colorado August 2005  –  May 2006  (10 months) Facilitated advanced physical chemistry lab of 20 students, including organizing science labs, providing brief lectures, and answering questions. \nIndependently directed Chemistry course review sessions for 40 undergraduate students requiring help with problem sets and lecture material; graded/evaluated student performance.  \nSeminar Series Coordinator, 2008 - Present \nCoordinated logistics for approximately 15 campus-wide seminars over three year period. Responsibilities include writing grant proposals, creating budgets, recruiting and organizing travel for invited speakers. This resulted in attracting nationally recognized scientists from industry, academia, and national labs to speak with campus-wide attendance of graduate students. Undergraduate Research Assistant University of Oregon & UC Davis June 2004  –  July 2005  (1 year 2 months) Worked as a NSF REU research student at the University of Oregon for 10 weeks studying liquid/liquid interfaces using vibrational sum-frequency spectroscopy. Required use of visible and tunable IR laser beams. \nStudied charge transfer in Ruthenium complexes using ultrafast X-ray absorption spectroscopy at UC Davis under Ting Guo. Undergraduate Research Assistant University of Oregon & UC Davis June 2004  –  July 2005  (1 year 2 months) Worked as a NSF REU research student at the University of Oregon for 10 weeks studying liquid/liquid interfaces using vibrational sum-frequency spectroscopy. Required use of visible and tunable IR laser beams. \nStudied charge transfer in Ruthenium complexes using ultrafast X-ray absorption spectroscopy at UC Davis under Ting Guo. Rental Center Manager and Employee Outdoor Adventures, UC Davis August 2003  –  May 2005  (1 year 10 months) Rental Center Manager and Employee Outdoor Adventures, UC Davis August 2003  –  May 2005  (1 year 10 months) Skills Data Analysis Electronics Optics Machining Laser Vacuum Chemistry Spectroscopy Labview Experimentation Physical Chemistry Science Skills  Data Analysis Electronics Optics Machining Laser Vacuum Chemistry Spectroscopy Labview Experimentation Physical Chemistry Science Data Analysis Electronics Optics Machining Laser Vacuum Chemistry Spectroscopy Labview Experimentation Physical Chemistry Science Data Analysis Electronics Optics Machining Laser Vacuum Chemistry Spectroscopy Labview Experimentation Physical Chemistry Science Education University of Colorado Boulder Ph.D,  Physical Chemistry 2005  – 2011 Thesis Topic: \"Negative Ion Photoelectron Spectroscopy of Organic Molecules\" University of California, Davis BS,  Chemistry 2003  – 2005 Paradise High School 1996  – 2000 University of Colorado Boulder Ph.D,  Physical Chemistry 2005  – 2011 Thesis Topic: \"Negative Ion Photoelectron Spectroscopy of Organic Molecules\" University of Colorado Boulder Ph.D,  Physical Chemistry 2005  – 2011 Thesis Topic: \"Negative Ion Photoelectron Spectroscopy of Organic Molecules\" University of Colorado Boulder Ph.D,  Physical Chemistry 2005  – 2011 Thesis Topic: \"Negative Ion Photoelectron Spectroscopy of Organic Molecules\" University of California, Davis BS,  Chemistry 2003  – 2005 University of California, Davis BS,  Chemistry 2003  – 2005 University of California, Davis BS,  Chemistry 2003  – 2005 Paradise High School 1996  – 2000 Paradise High School 1996  – 2000 Paradise High School 1996  – 2000 ", "Experience Professor Heald College January 2011  –  June 2012  (1 year 6 months) Portland, or I teach Physics and Physical Science Lab. Professor ITT Technical Institute December 2010  –  June 2012  (1 year 7 months) Portland, OR I teach Math, Electronics and Physics. RET Engineer Intel Corporation February 2007  –  June 2009  (2 years 5 months) Hillsboro, OR Research Assistant Providence St Vincent Medical Center 2004  –  2007  (3 years) Research Assistant II Oregon Medical Laser Center, Providence St. Vincent Hospital 2005  –  2006  (1 year) Professor Heald College January 2011  –  June 2012  (1 year 6 months) Portland, or I teach Physics and Physical Science Lab. Professor Heald College January 2011  –  June 2012  (1 year 6 months) Portland, or I teach Physics and Physical Science Lab. Professor ITT Technical Institute December 2010  –  June 2012  (1 year 7 months) Portland, OR I teach Math, Electronics and Physics. Professor ITT Technical Institute December 2010  –  June 2012  (1 year 7 months) Portland, OR I teach Math, Electronics and Physics. RET Engineer Intel Corporation February 2007  –  June 2009  (2 years 5 months) Hillsboro, OR RET Engineer Intel Corporation February 2007  –  June 2009  (2 years 5 months) Hillsboro, OR Research Assistant Providence St Vincent Medical Center 2004  –  2007  (3 years) Research Assistant Providence St Vincent Medical Center 2004  –  2007  (3 years) Research Assistant II Oregon Medical Laser Center, Providence St. Vincent Hospital 2005  –  2006  (1 year) Research Assistant II Oregon Medical Laser Center, Providence St. Vincent Hospital 2005  –  2006  (1 year) Skills Statistics Science Electronics Matlab Teaching Physics Biomedical Engineering Higher Education Laboratory Research Skills  Statistics Science Electronics Matlab Teaching Physics Biomedical Engineering Higher Education Laboratory Research Statistics Science Electronics Matlab Teaching Physics Biomedical Engineering Higher Education Laboratory Research Statistics Science Electronics Matlab Teaching Physics Biomedical Engineering Higher Education Laboratory Research Education Oregon Health and Science University PhD,  Biomedical Engineering 2002  – 2007 Oregon Health and Science University School of Medicine Oregon Health and Science University PhD,  Biomedical Engineering 2002  – 2007 Oregon Health and Science University PhD,  Biomedical Engineering 2002  – 2007 Oregon Health and Science University PhD,  Biomedical Engineering 2002  – 2007 Oregon Health and Science University School of Medicine Oregon Health and Science University School of Medicine Oregon Health and Science University School of Medicine ", "Experience RET Engineer Intel Corporation June 2013  – Present (2 years 3 months) Hillsboro, OR Graduate Research Assistant CREOL, College of Optics and Photonics, University of Central Florida August 2004  –  June 2013  (8 years 11 months) Orlando, FL Graduate research in the fields of polarization, light scattering, and optical remote sensing. Work performed in the Photonic Diagnostics of Random Media group under the advisement of Dr. Aristide Dogariu. RET Engineer Intel Corporation June 2013  – Present (2 years 3 months) Hillsboro, OR RET Engineer Intel Corporation June 2013  – Present (2 years 3 months) Hillsboro, OR Graduate Research Assistant CREOL, College of Optics and Photonics, University of Central Florida August 2004  –  June 2013  (8 years 11 months) Orlando, FL Graduate research in the fields of polarization, light scattering, and optical remote sensing. Work performed in the Photonic Diagnostics of Random Media group under the advisement of Dr. Aristide Dogariu. Graduate Research Assistant CREOL, College of Optics and Photonics, University of Central Florida August 2004  –  June 2013  (8 years 11 months) Orlando, FL Graduate research in the fields of polarization, light scattering, and optical remote sensing. Work performed in the Photonic Diagnostics of Random Media group under the advisement of Dr. Aristide Dogariu. Skills Laboratory Optics Matlab Labview LaTeX Laser Physics Optics Adaptive Optics Fourier Optics Photonics Physics Skills  Laboratory Optics Matlab Labview LaTeX Laser Physics Optics Adaptive Optics Fourier Optics Photonics Physics Laboratory Optics Matlab Labview LaTeX Laser Physics Optics Adaptive Optics Fourier Optics Photonics Physics Laboratory Optics Matlab Labview LaTeX Laser Physics Optics Adaptive Optics Fourier Optics Photonics Physics Education CREOL, University of Central Florida Doctor of Philosophy (PhD),  Optics/Optical Sciences 2007  – 2012 CREOL, University of Central Florida Master's degree,  Optics/Optical Sciences 2004  – 2007 University of Arizona Bachelor's degree,  Optics/Optical Sciences 2000  – 2004 CREOL, University of Central Florida Doctor of Philosophy (PhD),  Optics/Optical Sciences 2007  – 2012 CREOL, University of Central Florida Doctor of Philosophy (PhD),  Optics/Optical Sciences 2007  – 2012 CREOL, University of Central Florida Doctor of Philosophy (PhD),  Optics/Optical Sciences 2007  – 2012 CREOL, University of Central Florida Master's degree,  Optics/Optical Sciences 2004  – 2007 CREOL, University of Central Florida Master's degree,  Optics/Optical Sciences 2004  – 2007 CREOL, University of Central Florida Master's degree,  Optics/Optical Sciences 2004  – 2007 University of Arizona Bachelor's degree,  Optics/Optical Sciences 2000  – 2004 University of Arizona Bachelor's degree,  Optics/Optical Sciences 2000  – 2004 University of Arizona Bachelor's degree,  Optics/Optical Sciences 2000  – 2004 ", "Summary Interested in the field of photolithography and semiconductor manufacturing Summary Interested in the field of photolithography and semiconductor manufacturing Interested in the field of photolithography and semiconductor manufacturing Interested in the field of photolithography and semiconductor manufacturing Skills Photolithography Semiconductors Lithography MEMS Thin Films JMP CVD Microelectronics PECVD Optics PVD Silicon Characterization Design of Experiments Simulations Scanning Electron... Labview CMOS Matlab Sputtering Metal Fabrication Analog IC Semiconductor Process Nanotechnology See 10+     See less Skills  Photolithography Semiconductors Lithography MEMS Thin Films JMP CVD Microelectronics PECVD Optics PVD Silicon Characterization Design of Experiments Simulations Scanning Electron... Labview CMOS Matlab Sputtering Metal Fabrication Analog IC Semiconductor Process Nanotechnology See 10+     See less Photolithography Semiconductors Lithography MEMS Thin Films JMP CVD Microelectronics PECVD Optics PVD Silicon Characterization Design of Experiments Simulations Scanning Electron... Labview CMOS Matlab Sputtering Metal Fabrication Analog IC Semiconductor Process Nanotechnology See 10+     See less Photolithography Semiconductors Lithography MEMS Thin Films JMP CVD Microelectronics PECVD Optics PVD Silicon Characterization Design of Experiments Simulations Scanning Electron... Labview CMOS Matlab Sputtering Metal Fabrication Analog IC Semiconductor Process Nanotechnology See 10+     See less Honors & Awards ", "Experience Postdoc UC Berkeley RET engineer Intel Corporation April 2014  – Present (1 year 5 months) Hillsboro Postdoc UC Berkeley Postdoc UC Berkeley RET engineer Intel Corporation April 2014  – Present (1 year 5 months) Hillsboro RET engineer Intel Corporation April 2014  – Present (1 year 5 months) Hillsboro ", "Experience RET Engineer Intel Corporation July 2013  – Present (2 years 2 months) Hillsboro, OR RET Engineer Intel Corporation July 2013  – Present (2 years 2 months) Hillsboro, OR RET Engineer Intel Corporation July 2013  – Present (2 years 2 months) Hillsboro, OR Skills LaTeX Physics Nanotechnology Mathematica Experimentation Skills  LaTeX Physics Nanotechnology Mathematica Experimentation LaTeX Physics Nanotechnology Mathematica Experimentation LaTeX Physics Nanotechnology Mathematica Experimentation Education University of Illinois at Urbana-Champaign Doctor of Philosophy (Ph.D.) 2008  – 2013 University of Illinois at Urbana-Champaign Master of Science 2006  – 2007 Seoul National University Bachelor of Science 1999  – 2006 Gyeongsin High School University of Illinois at Urbana-Champaign Doctor of Philosophy (Ph.D.) 2008  – 2013 University of Illinois at Urbana-Champaign Doctor of Philosophy (Ph.D.) 2008  – 2013 University of Illinois at Urbana-Champaign Doctor of Philosophy (Ph.D.) 2008  – 2013 University of Illinois at Urbana-Champaign Master of Science 2006  – 2007 University of Illinois at Urbana-Champaign Master of Science 2006  – 2007 University of Illinois at Urbana-Champaign Master of Science 2006  – 2007 Seoul National University Bachelor of Science 1999  – 2006 Seoul National University Bachelor of Science 1999  – 2006 Seoul National University Bachelor of Science 1999  – 2006 Gyeongsin High School Gyeongsin High School Gyeongsin High School ", "Summary My dissertation involved utilizing the lens pupil domain to compensate for thick mask effects. Summary My dissertation involved utilizing the lens pupil domain to compensate for thick mask effects. My dissertation involved utilizing the lens pupil domain to compensate for thick mask effects. My dissertation involved utilizing the lens pupil domain to compensate for thick mask effects. Experience RET Engineer Intel Corporation April 2013  – Present (2 years 5 months) Hillsboro, OR PhD Microsystems Engineering Student Rochester Institute of Technology 2008  –  2013  (5 years) Graduate Technical Intern Intel Corporation June 2009  –  August 2009  (3 months) Contributed to the Source Mask Optimization (SMO) effort. Developed a methodology to determine source's initial conditions to be used in SMO based on spectral content of 2D design layout. Mentor Graphics assignee IMEC June 2007  –  August 2008  (1 year 3 months) Mentor Graphics assignee to Interuniversity Microelectronics Center: Optimized the Inverse Lithography Technology (ILT) routine for full-chip extension and validated the benefit of ILT using simulation, wafer data, and AIMS data. Validated the Mentor Graphics method of double patterning split with simulation, and participated in the design of a test mask for DP modeling and split validation. Undergraduate Technical Intern Intel Corporation June 2006  –  August 2006  (3 months) Developed design rules for a future generation of technology in the Resolution Enhancement Techniques group. Learned how to parametrically generate patterns, simulate with a lithography model, and determine feasibility by analysis. Undergraduate Technical Intern Intel Corporation June 2005  –  August 2005  (3 months) Characterized a photoresist to obtain the relationship between focus and bright band width for back-end lithography. Performed focus/exposure and swing curve analysis to reduce bias between nested and isolated features in order to qualify a tool on via layers. Undergraduate Technical Intern Intel Corporation June 2004  –  August 2004  (3 months) Developed a multilayer resist process using a bottom anti-reflective coating for a future generation in the lithography team. Learned optimization techniques such as focus exposure arrays and swing curves. Undergraduate Technical Intern Intel Corporation June 2003  –  August 2003  (3 months) Optimized a carbon doped oxide dielectric recipe for a chemical vapor deposition tool. Learned functionality of metrology tools to characterize the film's surface. Undergraduate Technical Intern Intel Corporation June 2002  –  August 2002  (3 months) Processed production wafers and performed preventative maintenance as a self sustaining technician in I-line photolithography. RET Engineer Intel Corporation April 2013  – Present (2 years 5 months) Hillsboro, OR RET Engineer Intel Corporation April 2013  – Present (2 years 5 months) Hillsboro, OR PhD Microsystems Engineering Student Rochester Institute of Technology 2008  –  2013  (5 years) PhD Microsystems Engineering Student Rochester Institute of Technology 2008  –  2013  (5 years) Graduate Technical Intern Intel Corporation June 2009  –  August 2009  (3 months) Contributed to the Source Mask Optimization (SMO) effort. Developed a methodology to determine source's initial conditions to be used in SMO based on spectral content of 2D design layout. Graduate Technical Intern Intel Corporation June 2009  –  August 2009  (3 months) Contributed to the Source Mask Optimization (SMO) effort. Developed a methodology to determine source's initial conditions to be used in SMO based on spectral content of 2D design layout. Mentor Graphics assignee IMEC June 2007  –  August 2008  (1 year 3 months) Mentor Graphics assignee to Interuniversity Microelectronics Center: Optimized the Inverse Lithography Technology (ILT) routine for full-chip extension and validated the benefit of ILT using simulation, wafer data, and AIMS data. Validated the Mentor Graphics method of double patterning split with simulation, and participated in the design of a test mask for DP modeling and split validation. Mentor Graphics assignee IMEC June 2007  –  August 2008  (1 year 3 months) Mentor Graphics assignee to Interuniversity Microelectronics Center: Optimized the Inverse Lithography Technology (ILT) routine for full-chip extension and validated the benefit of ILT using simulation, wafer data, and AIMS data. Validated the Mentor Graphics method of double patterning split with simulation, and participated in the design of a test mask for DP modeling and split validation. Undergraduate Technical Intern Intel Corporation June 2006  –  August 2006  (3 months) Developed design rules for a future generation of technology in the Resolution Enhancement Techniques group. Learned how to parametrically generate patterns, simulate with a lithography model, and determine feasibility by analysis. Undergraduate Technical Intern Intel Corporation June 2006  –  August 2006  (3 months) Developed design rules for a future generation of technology in the Resolution Enhancement Techniques group. Learned how to parametrically generate patterns, simulate with a lithography model, and determine feasibility by analysis. Undergraduate Technical Intern Intel Corporation June 2005  –  August 2005  (3 months) Characterized a photoresist to obtain the relationship between focus and bright band width for back-end lithography. Performed focus/exposure and swing curve analysis to reduce bias between nested and isolated features in order to qualify a tool on via layers. Undergraduate Technical Intern Intel Corporation June 2005  –  August 2005  (3 months) Characterized a photoresist to obtain the relationship between focus and bright band width for back-end lithography. Performed focus/exposure and swing curve analysis to reduce bias between nested and isolated features in order to qualify a tool on via layers. Undergraduate Technical Intern Intel Corporation June 2004  –  August 2004  (3 months) Developed a multilayer resist process using a bottom anti-reflective coating for a future generation in the lithography team. Learned optimization techniques such as focus exposure arrays and swing curves. Undergraduate Technical Intern Intel Corporation June 2004  –  August 2004  (3 months) Developed a multilayer resist process using a bottom anti-reflective coating for a future generation in the lithography team. Learned optimization techniques such as focus exposure arrays and swing curves. Undergraduate Technical Intern Intel Corporation June 2003  –  August 2003  (3 months) Optimized a carbon doped oxide dielectric recipe for a chemical vapor deposition tool. Learned functionality of metrology tools to characterize the film's surface. Undergraduate Technical Intern Intel Corporation June 2003  –  August 2003  (3 months) Optimized a carbon doped oxide dielectric recipe for a chemical vapor deposition tool. Learned functionality of metrology tools to characterize the film's surface. Undergraduate Technical Intern Intel Corporation June 2002  –  August 2002  (3 months) Processed production wafers and performed preventative maintenance as a self sustaining technician in I-line photolithography. Undergraduate Technical Intern Intel Corporation June 2002  –  August 2002  (3 months) Processed production wafers and performed preventative maintenance as a self sustaining technician in I-line photolithography. Skills Product Development Optics Photolithography Semiconductors Lithography Skills  Product Development Optics Photolithography Semiconductors Lithography Product Development Optics Photolithography Semiconductors Lithography Product Development Optics Photolithography Semiconductors Lithography Education Rochester Institute of Technology PhD,  Microsystems 2007  – 2012 G.P.A.: 3.94/4.00 Activities and Societies:  GRC Master’s Scholarship Program ,  NSF Graduate Research Fellowship Program ,  Rochester Optical Society of America Oregon State University B.S,  Electrical Engineering 2003  – 2007 G.P.A.: 3.95/4.00 \nSumma Cum Laude \nMinor in Physics Activities and Societies:  Intel Honors Internship Program ,  President OSU HKN Electrical Engineering Society ,  President OSU OSA ,  Undergraduate Research Innovation Scholarship and Creativity Grant ,  Tektronix-Burgess Award “Outstanding Senior of the Year” Rochester Institute of Technology PhD,  Microsystems 2007  – 2012 G.P.A.: 3.94/4.00 Activities and Societies:  GRC Master’s Scholarship Program ,  NSF Graduate Research Fellowship Program ,  Rochester Optical Society of America Rochester Institute of Technology PhD,  Microsystems 2007  – 2012 G.P.A.: 3.94/4.00 Activities and Societies:  GRC Master’s Scholarship Program ,  NSF Graduate Research Fellowship Program ,  Rochester Optical Society of America Rochester Institute of Technology PhD,  Microsystems 2007  – 2012 G.P.A.: 3.94/4.00 Activities and Societies:  GRC Master’s Scholarship Program ,  NSF Graduate Research Fellowship Program ,  Rochester Optical Society of America Oregon State University B.S,  Electrical Engineering 2003  – 2007 G.P.A.: 3.95/4.00 \nSumma Cum Laude \nMinor in Physics Activities and Societies:  Intel Honors Internship Program ,  President OSU HKN Electrical Engineering Society ,  President OSU OSA ,  Undergraduate Research Innovation Scholarship and Creativity Grant ,  Tektronix-Burgess Award “Outstanding Senior of the Year” Oregon State University B.S,  Electrical Engineering 2003  – 2007 G.P.A.: 3.95/4.00 \nSumma Cum Laude \nMinor in Physics Activities and Societies:  Intel Honors Internship Program ,  President OSU HKN Electrical Engineering Society ,  President OSU OSA ,  Undergraduate Research Innovation Scholarship and Creativity Grant ,  Tektronix-Burgess Award “Outstanding Senior of the Year” Oregon State University B.S,  Electrical Engineering 2003  – 2007 G.P.A.: 3.95/4.00 \nSumma Cum Laude \nMinor in Physics Activities and Societies:  Intel Honors Internship Program ,  President OSU HKN Electrical Engineering Society ,  President OSU OSA ,  Undergraduate Research Innovation Scholarship and Creativity Grant ,  Tektronix-Burgess Award “Outstanding Senior of the Year” Honors & Awards Additional Honors & Awards Publications \n-“Extending SMO into the lens pupil domain,” Proc. SPIE 7973, 79731B (2011). \n-“Inverse Lithography for 45nm node Contact Holes at 1.35NA,” MEMS MOEMS, Vol. 8, No. 4 (2009). \n-“Application of pixel-based mask optimization technique for high transmission attenuated PSM,” Proc. SPIE 7275, 72750X (2009). \n-“AIMS-45 image validation of contact hole patterns after inverse lithography at NA 1.35,” Proc. SPIE 7122, 71221E (2008). \n-“Hyper-NA Imaging of 45nm node random CH layouts using inverse lithography,” Proc. SPIE 6924, 6924OL (2008). \n-“Fitness and runtime correlation of compact model complexity,” Proc. SPIE 6924, 692445 (2008). Additional Honors & Awards Publications \n-“Extending SMO into the lens pupil domain,” Proc. SPIE 7973, 79731B (2011). \n-“Inverse Lithography for 45nm node Contact Holes at 1.35NA,” MEMS MOEMS, Vol. 8, No. 4 (2009). \n-“Application of pixel-based mask optimization technique for high transmission attenuated PSM,” Proc. SPIE 7275, 72750X (2009). \n-“AIMS-45 image validation of contact hole patterns after inverse lithography at NA 1.35,” Proc. SPIE 7122, 71221E (2008). \n-“Hyper-NA Imaging of 45nm node random CH layouts using inverse lithography,” Proc. SPIE 6924, 6924OL (2008). \n-“Fitness and runtime correlation of compact model complexity,” Proc. SPIE 6924, 692445 (2008). Additional Honors & Awards Publications \n-“Extending SMO into the lens pupil domain,” Proc. SPIE 7973, 79731B (2011). \n-“Inverse Lithography for 45nm node Contact Holes at 1.35NA,” MEMS MOEMS, Vol. 8, No. 4 (2009). \n-“Application of pixel-based mask optimization technique for high transmission attenuated PSM,” Proc. SPIE 7275, 72750X (2009). \n-“AIMS-45 image validation of contact hole patterns after inverse lithography at NA 1.35,” Proc. SPIE 7122, 71221E (2008). \n-“Hyper-NA Imaging of 45nm node random CH layouts using inverse lithography,” Proc. SPIE 6924, 6924OL (2008). \n-“Fitness and runtime correlation of compact model complexity,” Proc. SPIE 6924, 692445 (2008). Additional Honors & Awards Publications \n-“Extending SMO into the lens pupil domain,” Proc. SPIE 7973, 79731B (2011). \n-“Inverse Lithography for 45nm node Contact Holes at 1.35NA,” MEMS MOEMS, Vol. 8, No. 4 (2009). \n-“Application of pixel-based mask optimization technique for high transmission attenuated PSM,” Proc. SPIE 7275, 72750X (2009). \n-“AIMS-45 image validation of contact hole patterns after inverse lithography at NA 1.35,” Proc. SPIE 7122, 71221E (2008). \n-“Hyper-NA Imaging of 45nm node random CH layouts using inverse lithography,” Proc. SPIE 6924, 6924OL (2008). \n-“Fitness and runtime correlation of compact model complexity,” Proc. SPIE 6924, 692445 (2008). ", "Experience RET Engineer Intel Corporation November 2012  – Present (2 years 10 months) Portland, Oregon Area Graduate Research Assistant University of Colorado at Boulder May 2008  –  October 2012  (4 years 6 months) Liquid Crystal Materials Research Center Developed an integrated optical system enabling simultaneous three-dimensional manipulation and visualization of molecular order. \n \nApplied this system for breakthrough research involving optical control and non-invasive imaging of molecular patterns and topological defects in systems comprising liquid crystals, colloids, nanoparticles and biomaterials. Graduate Research Assistant University of Colorado at Boulder May 2006  –  May 2008  (2 years 1 month) Department of Electrical Engineering Worked in collaboration with a local start-up firm (Phiar Corp.) on design, fabrication and characterization of quantum tunneling based metal-insulator devices for THz applications in sensors, antennas & transistors. RET Engineer Intel Corporation November 2012  – Present (2 years 10 months) Portland, Oregon Area RET Engineer Intel Corporation November 2012  – Present (2 years 10 months) Portland, Oregon Area Graduate Research Assistant University of Colorado at Boulder May 2008  –  October 2012  (4 years 6 months) Liquid Crystal Materials Research Center Developed an integrated optical system enabling simultaneous three-dimensional manipulation and visualization of molecular order. \n \nApplied this system for breakthrough research involving optical control and non-invasive imaging of molecular patterns and topological defects in systems comprising liquid crystals, colloids, nanoparticles and biomaterials. Graduate Research Assistant University of Colorado at Boulder May 2008  –  October 2012  (4 years 6 months) Liquid Crystal Materials Research Center Developed an integrated optical system enabling simultaneous three-dimensional manipulation and visualization of molecular order. \n \nApplied this system for breakthrough research involving optical control and non-invasive imaging of molecular patterns and topological defects in systems comprising liquid crystals, colloids, nanoparticles and biomaterials. Graduate Research Assistant University of Colorado at Boulder May 2006  –  May 2008  (2 years 1 month) Department of Electrical Engineering Worked in collaboration with a local start-up firm (Phiar Corp.) on design, fabrication and characterization of quantum tunneling based metal-insulator devices for THz applications in sensors, antennas & transistors. Graduate Research Assistant University of Colorado at Boulder May 2006  –  May 2008  (2 years 1 month) Department of Electrical Engineering Worked in collaboration with a local start-up firm (Phiar Corp.) on design, fabrication and characterization of quantum tunneling based metal-insulator devices for THz applications in sensors, antennas & transistors. Skills Advanced photonic... Semiconductor process... Novel... Molecular and... Nanoscale imaging... Materials/device... Nanomaterials Characterization Thin Films Biomaterials Signal Processing Sensors Simulations Semiconductor Process... Nanoparticles Matlab Labview AFM Physics Semiconductors Photonics Optoelectronics Optics Nanotechnology COMSOL Mathematica Image Processing See 12+     See less Skills  Advanced photonic... Semiconductor process... Novel... Molecular and... Nanoscale imaging... Materials/device... Nanomaterials Characterization Thin Films Biomaterials Signal Processing Sensors Simulations Semiconductor Process... Nanoparticles Matlab Labview AFM Physics Semiconductors Photonics Optoelectronics Optics Nanotechnology COMSOL Mathematica Image Processing See 12+     See less Advanced photonic... Semiconductor process... Novel... Molecular and... Nanoscale imaging... Materials/device... Nanomaterials Characterization Thin Films Biomaterials Signal Processing Sensors Simulations Semiconductor Process... Nanoparticles Matlab Labview AFM Physics Semiconductors Photonics Optoelectronics Optics Nanotechnology COMSOL Mathematica Image Processing See 12+     See less Advanced photonic... Semiconductor process... Novel... Molecular and... Nanoscale imaging... Materials/device... Nanomaterials Characterization Thin Films Biomaterials Signal Processing Sensors Simulations Semiconductor Process... Nanoparticles Matlab Labview AFM Physics Semiconductors Photonics Optoelectronics Optics Nanotechnology COMSOL Mathematica Image Processing See 12+     See less Education University of Colorado at Boulder Doctor of Philosophy (PhD),  Electrical Engineering 2008  – 2012 University of Colorado at Boulder Master of Science (MS),  Electrical Engineering 2005  – 2007 VJTI, University of Bombay, India Bachelor of Engineering (B.E.),  Electronics Engineering 2001  – 2005 University of Colorado at Boulder Doctor of Philosophy (PhD),  Electrical Engineering 2008  – 2012 University of Colorado at Boulder Doctor of Philosophy (PhD),  Electrical Engineering 2008  – 2012 University of Colorado at Boulder Doctor of Philosophy (PhD),  Electrical Engineering 2008  – 2012 University of Colorado at Boulder Master of Science (MS),  Electrical Engineering 2005  – 2007 University of Colorado at Boulder Master of Science (MS),  Electrical Engineering 2005  – 2007 University of Colorado at Boulder Master of Science (MS),  Electrical Engineering 2005  – 2007 VJTI, University of Bombay, India Bachelor of Engineering (B.E.),  Electronics Engineering 2001  – 2005 VJTI, University of Bombay, India Bachelor of Engineering (B.E.),  Electronics Engineering 2001  – 2005 VJTI, University of Bombay, India Bachelor of Engineering (B.E.),  Electronics Engineering 2001  – 2005 Honors & Awards SPIE scholarship in optical science and engineering SPIE Highly competitive scholarship given to distinguished grad students. For the years 2009 and 2011. ICAM travel fellowship Institute of Complex Adaptive Matter (ICAM) Given to outstanding students to attend conferences and summer schools. For the years 2009, 2010, 2011. J R D Tata Scholarship For excellence in engineering studies. For the year 2002. SPIE scholarship in optical science and engineering SPIE Highly competitive scholarship given to distinguished grad students. For the years 2009 and 2011. SPIE scholarship in optical science and engineering SPIE Highly competitive scholarship given to distinguished grad students. For the years 2009 and 2011. SPIE scholarship in optical science and engineering SPIE Highly competitive scholarship given to distinguished grad students. For the years 2009 and 2011. ICAM travel fellowship Institute of Complex Adaptive Matter (ICAM) Given to outstanding students to attend conferences and summer schools. For the years 2009, 2010, 2011. ICAM travel fellowship Institute of Complex Adaptive Matter (ICAM) Given to outstanding students to attend conferences and summer schools. For the years 2009, 2010, 2011. ICAM travel fellowship Institute of Complex Adaptive Matter (ICAM) Given to outstanding students to attend conferences and summer schools. For the years 2009, 2010, 2011. J R D Tata Scholarship For excellence in engineering studies. For the year 2002. J R D Tata Scholarship For excellence in engineering studies. For the year 2002. J R D Tata Scholarship For excellence in engineering studies. For the year 2002. ", "Experience RET Engineer Intel Corporation April 2013  – Present (2 years 5 months) Hillsboro, Oregon Postdoctoral Researcher UCLA July 2012  –  March 2013  (9 months) Greater Los Angeles Area PhD Student UCLA September 2007  –  June 2012  (4 years 10 months) Greater Los Angeles Area Senion Engineer AU Optronics May 2004  –  September 2007  (3 years 5 months) Hsin-chu, Taiwan RET Engineer Intel Corporation April 2013  – Present (2 years 5 months) Hillsboro, Oregon RET Engineer Intel Corporation April 2013  – Present (2 years 5 months) Hillsboro, Oregon Postdoctoral Researcher UCLA July 2012  –  March 2013  (9 months) Greater Los Angeles Area Postdoctoral Researcher UCLA July 2012  –  March 2013  (9 months) Greater Los Angeles Area PhD Student UCLA September 2007  –  June 2012  (4 years 10 months) Greater Los Angeles Area PhD Student UCLA September 2007  –  June 2012  (4 years 10 months) Greater Los Angeles Area Senion Engineer AU Optronics May 2004  –  September 2007  (3 years 5 months) Hsin-chu, Taiwan Senion Engineer AU Optronics May 2004  –  September 2007  (3 years 5 months) Hsin-chu, Taiwan Skills Photonics Optics Characterization Matlab Physics Fiber Optics Semiconductors Algorithms Spectroscopy Scanning Electron... Lithography Labview Device Physics R&D Image Processing Microscopy C++ Electrical Engineering Holography Phase Contrast... Fluorescence Microscopy 3D Prototyping Atomic Force Microscopy Diffraction Optics AFM SEM Statistical Optics 3D Imaging Liquid Crystal Optics Semiconductor Optics Color Science Solid State Physics Circuit Design Visual Basic Optical Microscopy Experimentation See 21+     See less Skills  Photonics Optics Characterization Matlab Physics Fiber Optics Semiconductors Algorithms Spectroscopy Scanning Electron... Lithography Labview Device Physics R&D Image Processing Microscopy C++ Electrical Engineering Holography Phase Contrast... Fluorescence Microscopy 3D Prototyping Atomic Force Microscopy Diffraction Optics AFM SEM Statistical Optics 3D Imaging Liquid Crystal Optics Semiconductor Optics Color Science Solid State Physics Circuit Design Visual Basic Optical Microscopy Experimentation See 21+     See less Photonics Optics Characterization Matlab Physics Fiber Optics Semiconductors Algorithms Spectroscopy Scanning Electron... Lithography Labview Device Physics R&D Image Processing Microscopy C++ Electrical Engineering Holography Phase Contrast... Fluorescence Microscopy 3D Prototyping Atomic Force Microscopy Diffraction Optics AFM SEM Statistical Optics 3D Imaging Liquid Crystal Optics Semiconductor Optics Color Science Solid State Physics Circuit Design Visual Basic Optical Microscopy Experimentation See 21+     See less Photonics Optics Characterization Matlab Physics Fiber Optics Semiconductors Algorithms Spectroscopy Scanning Electron... Lithography Labview Device Physics R&D Image Processing Microscopy C++ Electrical Engineering Holography Phase Contrast... Fluorescence Microscopy 3D Prototyping Atomic Force Microscopy Diffraction Optics AFM SEM Statistical Optics 3D Imaging Liquid Crystal Optics Semiconductor Optics Color Science Solid State Physics Circuit Design Visual Basic Optical Microscopy Experimentation See 21+     See less Education University of California, Los Angeles PhD,  Electrical Engineering 2007  – 2011 National Taiwan University BS,MS,  Electrical Engineering , Optoelectronics 1996  – 2002 University of California, Los Angeles PhD,  Electrical Engineering 2007  – 2011 University of California, Los Angeles PhD,  Electrical Engineering 2007  – 2011 University of California, Los Angeles PhD,  Electrical Engineering 2007  – 2011 National Taiwan University BS,MS,  Electrical Engineering , Optoelectronics 1996  – 2002 National Taiwan University BS,MS,  Electrical Engineering , Optoelectronics 1996  – 2002 National Taiwan University BS,MS,  Electrical Engineering , Optoelectronics 1996  – 2002 ", "Summary I have been developing software for processing and interpreting large data sets and for visualizing data analysis results in C, Python and Interactive Data Language program languages. Summary I have been developing software for processing and interpreting large data sets and for visualizing data analysis results in C, Python and Interactive Data Language program languages. I have been developing software for processing and interpreting large data sets and for visualizing data analysis results in C, Python and Interactive Data Language program languages. I have been developing software for processing and interpreting large data sets and for visualizing data analysis results in C, Python and Interactive Data Language program languages. Experience RET Engineer Intel Corporation September 2014  – Present (1 year) Developing layout synthesis and the Optical Proximity Correction algorithms for Intel's mask layers Graduate Student Researcher/Graduate Student Instructor UC Berkeley August 2007  –  December 2013  (6 years 5 months) Did research on theoretical cosmology particularly about Large scale structure of the Universe. \nTaught general astronomy, astrophysics I/II, stellar physics, cosmology. \n RET Engineer Intel Corporation September 2014  – Present (1 year) Developing layout synthesis and the Optical Proximity Correction algorithms for Intel's mask layers RET Engineer Intel Corporation September 2014  – Present (1 year) Developing layout synthesis and the Optical Proximity Correction algorithms for Intel's mask layers Graduate Student Researcher/Graduate Student Instructor UC Berkeley August 2007  –  December 2013  (6 years 5 months) Did research on theoretical cosmology particularly about Large scale structure of the Universe. \nTaught general astronomy, astrophysics I/II, stellar physics, cosmology. \n Graduate Student Researcher/Graduate Student Instructor UC Berkeley August 2007  –  December 2013  (6 years 5 months) Did research on theoretical cosmology particularly about Large scale structure of the Universe. \nTaught general astronomy, astrophysics I/II, stellar physics, cosmology. \n Languages Korean Native or bilingual proficiency English Professional working proficiency Korean Native or bilingual proficiency English Professional working proficiency Korean Native or bilingual proficiency English Professional working proficiency Native or bilingual proficiency Professional working proficiency Skills Programming Physics Science Astrophysics Scientific Computing Numerical Analysis Data Analysis Computational Physics Statistics C Python Fortran LaTeX HTML Monte Carlo Simulation Algorithms Astronomy IDL Mathematical Modeling See 4+     See less Skills  Programming Physics Science Astrophysics Scientific Computing Numerical Analysis Data Analysis Computational Physics Statistics C Python Fortran LaTeX HTML Monte Carlo Simulation Algorithms Astronomy IDL Mathematical Modeling See 4+     See less Programming Physics Science Astrophysics Scientific Computing Numerical Analysis Data Analysis Computational Physics Statistics C Python Fortran LaTeX HTML Monte Carlo Simulation Algorithms Astronomy IDL Mathematical Modeling See 4+     See less Programming Physics Science Astrophysics Scientific Computing Numerical Analysis Data Analysis Computational Physics Statistics C Python Fortran LaTeX HTML Monte Carlo Simulation Algorithms Astronomy IDL Mathematical Modeling See 4+     See less Education University of California, Berkeley Doctor of Philosophy (Ph.D.) 2007  – 2013 Seoul National University Master's degree 2005  – 2007 Seoul National University Bachelor 2001  – 2005 University of California, Berkeley Doctor of Philosophy (Ph.D.) 2007  – 2013 University of California, Berkeley Doctor of Philosophy (Ph.D.) 2007  – 2013 University of California, Berkeley Doctor of Philosophy (Ph.D.) 2007  – 2013 Seoul National University Master's degree 2005  – 2007 Seoul National University Master's degree 2005  – 2007 Seoul National University Master's degree 2005  – 2007 Seoul National University Bachelor 2001  – 2005 Seoul National University Bachelor 2001  – 2005 Seoul National University Bachelor 2001  – 2005 Honors & Awards ", "Experience N+1 Technology Tapeout Program Manager Intel Corporation September 2014  – Present (1 year) Hillsboro, OR Responsible for the group's timely delivery of cutting-edge OPC/RET/tapeout collateral and developing critical capabilities to meet the accuracy and automation needs of the latest technology node. RET Engineering Manager Intel Corporation 2011  – Present (4 years) Portland Technology and Development •\tCo-leading a team of RET (resolution enhancement techniques) engineers responsible for delivering cutting edge lithographic process models and supporting lithographic process development for next generation microprocessors. RET Engineer Intel Corporation 2006  –  2011  (5 years) Portland Technology and Development •\tPerpetuated Moore's law through the development of lithographic process models used for optical proximity correction algorithms for four generations of microprocessors \n•\tManaged short- and long-term technical projects involving 30+ people from several organizations within Intel to develop and improve mask-making capabilities for resolution enhancement. \n•\tLed several projects to improve RET capabilities and model quality Senior Process Engineer Intel Corporation September 2005  –  December 2005  (4 months) Santa Clara, CA •\tWrote and implemented several scripts and tools to facilitate monitoring performance of tools and remote tool set-up \n \n•\tCo-led a team of 4 engineers and 3 technicians responsible for developing new methods to measure film stacks of ultra-thin materials. Also responsible for maintaining and upgrading 22 metrology tools. Graduate Student Researcher UC Berkeley 2000  –  2005  (5 years) Berkeley, CA PhD Advisor: Prof. Graham R. Fleming \n \nDissertation title: \"A theoretical and femtosecond spectroscopic investigation of energy transfer in photosynthetic complexes\" \n \n•\tFemtosecond non-linear laser spectroscopy including: transient absorption, one- and two-color photon echo spectroscopy, and transient grating \n•\tApplication of above techniques to the study of energy transfer processes in photosynthetic complexes \n•\tPicosecond time-correlated single-photon counting (TCSPC) to obtain fluorescence, energy transfer, and electron transfer timescales \n•\tTwo-photon spectroscopy \n•\tKnowledge of femtosecond Titanium:Sapphire oscillators, regenerative amplifiers, non-collinear and collinear optical parametric amplifiers (NOPA and OPA) \n•\tSemi-empirical and ab initio time-dependent density-functional theory calculations \n•\tEnergy transfer dynamics studied using Förster and modified Redfield theories. Student Researcher Rice University 1998  –  2000  (2 years) Houston, TX •\tTemperature-dependent atomic force microscopy (AFM) studies of phase transitions in paraffin  \n•\tViscoelastic properties of organic thin films and their effect on the phase response of the AFM \n•\tMathematical modeling of the AFM using MATLAB \n•\tOther techniques: scanning electron microscopy (SEM), cyclic voltammetry (CV) N+1 Technology Tapeout Program Manager Intel Corporation September 2014  – Present (1 year) Hillsboro, OR Responsible for the group's timely delivery of cutting-edge OPC/RET/tapeout collateral and developing critical capabilities to meet the accuracy and automation needs of the latest technology node. N+1 Technology Tapeout Program Manager Intel Corporation September 2014  – Present (1 year) Hillsboro, OR Responsible for the group's timely delivery of cutting-edge OPC/RET/tapeout collateral and developing critical capabilities to meet the accuracy and automation needs of the latest technology node. RET Engineering Manager Intel Corporation 2011  – Present (4 years) Portland Technology and Development •\tCo-leading a team of RET (resolution enhancement techniques) engineers responsible for delivering cutting edge lithographic process models and supporting lithographic process development for next generation microprocessors. RET Engineering Manager Intel Corporation 2011  – Present (4 years) Portland Technology and Development •\tCo-leading a team of RET (resolution enhancement techniques) engineers responsible for delivering cutting edge lithographic process models and supporting lithographic process development for next generation microprocessors. RET Engineer Intel Corporation 2006  –  2011  (5 years) Portland Technology and Development •\tPerpetuated Moore's law through the development of lithographic process models used for optical proximity correction algorithms for four generations of microprocessors \n•\tManaged short- and long-term technical projects involving 30+ people from several organizations within Intel to develop and improve mask-making capabilities for resolution enhancement. \n•\tLed several projects to improve RET capabilities and model quality RET Engineer Intel Corporation 2006  –  2011  (5 years) Portland Technology and Development •\tPerpetuated Moore's law through the development of lithographic process models used for optical proximity correction algorithms for four generations of microprocessors \n•\tManaged short- and long-term technical projects involving 30+ people from several organizations within Intel to develop and improve mask-making capabilities for resolution enhancement. \n•\tLed several projects to improve RET capabilities and model quality Senior Process Engineer Intel Corporation September 2005  –  December 2005  (4 months) Santa Clara, CA •\tWrote and implemented several scripts and tools to facilitate monitoring performance of tools and remote tool set-up \n \n•\tCo-led a team of 4 engineers and 3 technicians responsible for developing new methods to measure film stacks of ultra-thin materials. Also responsible for maintaining and upgrading 22 metrology tools. Senior Process Engineer Intel Corporation September 2005  –  December 2005  (4 months) Santa Clara, CA •\tWrote and implemented several scripts and tools to facilitate monitoring performance of tools and remote tool set-up \n \n•\tCo-led a team of 4 engineers and 3 technicians responsible for developing new methods to measure film stacks of ultra-thin materials. Also responsible for maintaining and upgrading 22 metrology tools. Graduate Student Researcher UC Berkeley 2000  –  2005  (5 years) Berkeley, CA PhD Advisor: Prof. Graham R. Fleming \n \nDissertation title: \"A theoretical and femtosecond spectroscopic investigation of energy transfer in photosynthetic complexes\" \n \n•\tFemtosecond non-linear laser spectroscopy including: transient absorption, one- and two-color photon echo spectroscopy, and transient grating \n•\tApplication of above techniques to the study of energy transfer processes in photosynthetic complexes \n•\tPicosecond time-correlated single-photon counting (TCSPC) to obtain fluorescence, energy transfer, and electron transfer timescales \n•\tTwo-photon spectroscopy \n•\tKnowledge of femtosecond Titanium:Sapphire oscillators, regenerative amplifiers, non-collinear and collinear optical parametric amplifiers (NOPA and OPA) \n•\tSemi-empirical and ab initio time-dependent density-functional theory calculations \n•\tEnergy transfer dynamics studied using Förster and modified Redfield theories. Graduate Student Researcher UC Berkeley 2000  –  2005  (5 years) Berkeley, CA PhD Advisor: Prof. Graham R. Fleming \n \nDissertation title: \"A theoretical and femtosecond spectroscopic investigation of energy transfer in photosynthetic complexes\" \n \n•\tFemtosecond non-linear laser spectroscopy including: transient absorption, one- and two-color photon echo spectroscopy, and transient grating \n•\tApplication of above techniques to the study of energy transfer processes in photosynthetic complexes \n•\tPicosecond time-correlated single-photon counting (TCSPC) to obtain fluorescence, energy transfer, and electron transfer timescales \n•\tTwo-photon spectroscopy \n•\tKnowledge of femtosecond Titanium:Sapphire oscillators, regenerative amplifiers, non-collinear and collinear optical parametric amplifiers (NOPA and OPA) \n•\tSemi-empirical and ab initio time-dependent density-functional theory calculations \n•\tEnergy transfer dynamics studied using Förster and modified Redfield theories. Student Researcher Rice University 1998  –  2000  (2 years) Houston, TX •\tTemperature-dependent atomic force microscopy (AFM) studies of phase transitions in paraffin  \n•\tViscoelastic properties of organic thin films and their effect on the phase response of the AFM \n•\tMathematical modeling of the AFM using MATLAB \n•\tOther techniques: scanning electron microscopy (SEM), cyclic voltammetry (CV) Student Researcher Rice University 1998  –  2000  (2 years) Houston, TX •\tTemperature-dependent atomic force microscopy (AFM) studies of phase transitions in paraffin  \n•\tViscoelastic properties of organic thin films and their effect on the phase response of the AFM \n•\tMathematical modeling of the AFM using MATLAB \n•\tOther techniques: scanning electron microscopy (SEM), cyclic voltammetry (CV) Languages   Skills Design of Experiments Simulations Matlab Semiconductors Chemistry Optics Algorithms Thin Films Materials Science Spectroscopy R&D Management Lithography Cross-functional Team... Linux optical proximity... resolution enhancement... Photolithography Scanning Electron... Mathematical Modeling See 5+     See less Skills  Design of Experiments Simulations Matlab Semiconductors Chemistry Optics Algorithms Thin Films Materials Science Spectroscopy R&D Management Lithography Cross-functional Team... Linux optical proximity... resolution enhancement... Photolithography Scanning Electron... Mathematical Modeling See 5+     See less Design of Experiments Simulations Matlab Semiconductors Chemistry Optics Algorithms Thin Films Materials Science Spectroscopy R&D Management Lithography Cross-functional Team... Linux optical proximity... resolution enhancement... Photolithography Scanning Electron... Mathematical Modeling See 5+     See less Design of Experiments Simulations Matlab Semiconductors Chemistry Optics Algorithms Thin Films Materials Science Spectroscopy R&D Management Lithography Cross-functional Team... Linux optical proximity... resolution enhancement... Photolithography Scanning Electron... Mathematical Modeling See 5+     See less Education University of California, Berkeley PhD,  Chemistry 2000  – 2005 Rice University B.A cum laude,  Chemistry ,  German 1996  – 2000 King George V School, Hong Kong 1988  – 1996 Advanced Level Biology, Chemistry and Mathematics, Grade A.  \nAdvanced Supplementary Level Further Mathematics, Grade A. University of California, Berkeley PhD,  Chemistry 2000  – 2005 University of California, Berkeley PhD,  Chemistry 2000  – 2005 University of California, Berkeley PhD,  Chemistry 2000  – 2005 Rice University B.A cum laude,  Chemistry ,  German 1996  – 2000 Rice University B.A cum laude,  Chemistry ,  German 1996  – 2000 Rice University B.A cum laude,  Chemistry ,  German 1996  – 2000 King George V School, Hong Kong 1988  – 1996 Advanced Level Biology, Chemistry and Mathematics, Grade A.  \nAdvanced Supplementary Level Further Mathematics, Grade A. King George V School, Hong Kong 1988  – 1996 Advanced Level Biology, Chemistry and Mathematics, Grade A.  \nAdvanced Supplementary Level Further Mathematics, Grade A. King George V School, Hong Kong 1988  – 1996 Advanced Level Biology, Chemistry and Mathematics, Grade A.  \nAdvanced Supplementary Level Further Mathematics, Grade A. Honors & Awards Intel Achievement Award Intel Corporation 2010 Logic Technology Development Divisional Award Intel Corporation 2010 Logic Technology Development Divisional Award Intel Corporation 2010 Logic Technology Development PTD RET Award Intel Corporation 2010 Logic Technology Development Intel Mask Operations Award Intel Corporation 2009 Logic Technology Development PTD RET Award Intel Corporation 2009 Logic Technology Development Intel Mask Operations Award Intel Corporation 2008 Margaret Jorgensen Memorial Prize University of California, Berkeley 2005 Outstanding Graduate Instructor Award University of California, Berkeley 2002 Zevi and Bertha Salsburg Memorial Award in Chemistry Rice University 2000 Rice University President's Honor Roll Rice University 2000 Beckman Foundation Research Fellowship Beckman Institute 1999 Rice University President's Honor Roll Rice University 1997 Intel Achievement Award Intel Corporation 2010 Intel Achievement Award Intel Corporation 2010 Intel Achievement Award Intel Corporation 2010 Logic Technology Development Divisional Award Intel Corporation 2010 Logic Technology Development Divisional Award Intel Corporation 2010 Logic Technology Development Divisional Award Intel Corporation 2010 Logic Technology Development Divisional Award Intel Corporation 2010 Logic Technology Development Divisional Award Intel Corporation 2010 Logic Technology Development Divisional Award Intel Corporation 2010 Logic Technology Development PTD RET Award Intel Corporation 2010 Logic Technology Development PTD RET Award Intel Corporation 2010 Logic Technology Development PTD RET Award Intel Corporation 2010 Logic Technology Development Intel Mask Operations Award Intel Corporation 2009 Logic Technology Development Intel Mask Operations Award Intel Corporation 2009 Logic Technology Development Intel Mask Operations Award Intel Corporation 2009 Logic Technology Development PTD RET Award Intel Corporation 2009 Logic Technology Development PTD RET Award Intel Corporation 2009 Logic Technology Development PTD RET Award Intel Corporation 2009 Logic Technology Development Intel Mask Operations Award Intel Corporation 2008 Logic Technology Development Intel Mask Operations Award Intel Corporation 2008 Logic Technology Development Intel Mask Operations Award Intel Corporation 2008 Margaret Jorgensen Memorial Prize University of California, Berkeley 2005 Margaret Jorgensen Memorial Prize University of California, Berkeley 2005 Margaret Jorgensen Memorial Prize University of California, Berkeley 2005 Outstanding Graduate Instructor Award University of California, Berkeley 2002 Outstanding Graduate Instructor Award University of California, Berkeley 2002 Outstanding Graduate Instructor Award University of California, Berkeley 2002 Zevi and Bertha Salsburg Memorial Award in Chemistry Rice University 2000 Zevi and Bertha Salsburg Memorial Award in Chemistry Rice University 2000 Zevi and Bertha Salsburg Memorial Award in Chemistry Rice University 2000 Rice University President's Honor Roll Rice University 2000 Rice University President's Honor Roll Rice University 2000 Rice University President's Honor Roll Rice University 2000 Beckman Foundation Research Fellowship Beckman Institute 1999 Beckman Foundation Research Fellowship Beckman Institute 1999 Beckman Foundation Research Fellowship Beckman Institute 1999 Rice University President's Honor Roll Rice University 1997 Rice University President's Honor Roll Rice University 1997 Rice University President's Honor Roll Rice University 1997 ", "Summary I am working in lithography for semiconductor fabrication. Specialties:Research and Development, Experimentation, System characterization and analysis, Modeling. Summary I am working in lithography for semiconductor fabrication. Specialties:Research and Development, Experimentation, System characterization and analysis, Modeling. I am working in lithography for semiconductor fabrication. Specialties:Research and Development, Experimentation, System characterization and analysis, Modeling. I am working in lithography for semiconductor fabrication. Specialties:Research and Development, Experimentation, System characterization and analysis, Modeling. Experience Design Engineer Intel Corporation July 2011  – Present (4 years 2 months) Hillsboro, OR RET design engineer Intel Corporation 2011  –  2013  (2 years) PhD University of Michigan January 2006  –  April 2011  (5 years 4 months) I received my PhD with specialization in Optics. \nThe focus of my research was in the area of nonlinear fiber optics. Specifically, I have worked on a supercontinuum fiber laser with high average power output.  \nIn addition, I have also worked on semiconductor device fabrication for certain communication applications. RET engineer Intel Corporation 2011  –  2011  (less than a year) Research Investigator Coherix, Inc June 2009  –  October 2009  (5 months) * Worked in a team of 13 graduate students developing solutions for efficient metrology in automotive manufacturing \n* Coordinated amongst several smaller teams to deliver quantifiable value to current manufacturing processes \n* Developed a non-contact method for defect detection in power train parts for 100% in-line inspection \n* Project tasks included conceptualization, market study, theoretical modeling and prototype demonstration. Design Engineer Intel Corporation July 2011  – Present (4 years 2 months) Hillsboro, OR Design Engineer Intel Corporation July 2011  – Present (4 years 2 months) Hillsboro, OR RET design engineer Intel Corporation 2011  –  2013  (2 years) RET design engineer Intel Corporation 2011  –  2013  (2 years) PhD University of Michigan January 2006  –  April 2011  (5 years 4 months) I received my PhD with specialization in Optics. \nThe focus of my research was in the area of nonlinear fiber optics. Specifically, I have worked on a supercontinuum fiber laser with high average power output.  \nIn addition, I have also worked on semiconductor device fabrication for certain communication applications. PhD University of Michigan January 2006  –  April 2011  (5 years 4 months) I received my PhD with specialization in Optics. \nThe focus of my research was in the area of nonlinear fiber optics. Specifically, I have worked on a supercontinuum fiber laser with high average power output.  \nIn addition, I have also worked on semiconductor device fabrication for certain communication applications. RET engineer Intel Corporation 2011  –  2011  (less than a year) RET engineer Intel Corporation 2011  –  2011  (less than a year) Research Investigator Coherix, Inc June 2009  –  October 2009  (5 months) * Worked in a team of 13 graduate students developing solutions for efficient metrology in automotive manufacturing \n* Coordinated amongst several smaller teams to deliver quantifiable value to current manufacturing processes \n* Developed a non-contact method for defect detection in power train parts for 100% in-line inspection \n* Project tasks included conceptualization, market study, theoretical modeling and prototype demonstration. Research Investigator Coherix, Inc June 2009  –  October 2009  (5 months) * Worked in a team of 13 graduate students developing solutions for efficient metrology in automotive manufacturing \n* Coordinated amongst several smaller teams to deliver quantifiable value to current manufacturing processes \n* Developed a non-contact method for defect detection in power train parts for 100% in-line inspection \n* Project tasks included conceptualization, market study, theoretical modeling and prototype demonstration. Skills Experimentation Image Processing Modeling Optics Characterization Labview Simulations Metrology Algorithms Matlab Fiber Optics Laser Skills  Experimentation Image Processing Modeling Optics Characterization Labview Simulations Metrology Algorithms Matlab Fiber Optics Laser Experimentation Image Processing Modeling Optics Characterization Labview Simulations Metrology Algorithms Matlab Fiber Optics Laser Experimentation Image Processing Modeling Optics Characterization Labview Simulations Metrology Algorithms Matlab Fiber Optics Laser Education University of Michigan PhD,  Electrical Engineering 2006  – 2011 Expected Graduation: April 2011 Activities and Societies:  Optical Sciences Laboratory ,  EECS Department\nOptical Society of Amercia ,  Student Member University of Michigan Master of Science,  Electrical Engineering; Systems (Communications) 2004  – 2005 University of Mumbai BE,  Engineering , Electronics and Telecommunications 2000  – 2004 Activities and Societies:  - Secretary of the Students' Council\n- Treasurer of the school Debating Society\n- Core Committee member of student events organization committee\n- Member of IEEE Swami Vivekanand Junior College Swami Vivekanand Junior College University of Michigan PhD,  Electrical Engineering 2006  – 2011 Expected Graduation: April 2011 Activities and Societies:  Optical Sciences Laboratory ,  EECS Department\nOptical Society of Amercia ,  Student Member University of Michigan PhD,  Electrical Engineering 2006  – 2011 Expected Graduation: April 2011 Activities and Societies:  Optical Sciences Laboratory ,  EECS Department\nOptical Society of Amercia ,  Student Member University of Michigan PhD,  Electrical Engineering 2006  – 2011 Expected Graduation: April 2011 Activities and Societies:  Optical Sciences Laboratory ,  EECS Department\nOptical Society of Amercia ,  Student Member University of Michigan Master of Science,  Electrical Engineering; Systems (Communications) 2004  – 2005 University of Michigan Master of Science,  Electrical Engineering; Systems (Communications) 2004  – 2005 University of Michigan Master of Science,  Electrical Engineering; Systems (Communications) 2004  – 2005 University of Mumbai BE,  Engineering , Electronics and Telecommunications 2000  – 2004 Activities and Societies:  - Secretary of the Students' Council\n- Treasurer of the school Debating Society\n- Core Committee member of student events organization committee\n- Member of IEEE University of Mumbai BE,  Engineering , Electronics and Telecommunications 2000  – 2004 Activities and Societies:  - Secretary of the Students' Council\n- Treasurer of the school Debating Society\n- Core Committee member of student events organization committee\n- Member of IEEE University of Mumbai BE,  Engineering , Electronics and Telecommunications 2000  – 2004 Activities and Societies:  - Secretary of the Students' Council\n- Treasurer of the school Debating Society\n- Core Committee member of student events organization committee\n- Member of IEEE Swami Vivekanand Junior College Swami Vivekanand Junior College Swami Vivekanand Junior College Swami Vivekanand Junior College Swami Vivekanand Junior College Swami Vivekanand Junior College Honors & Awards Additional Honors & Awards - National Talent Search Scholar, Govt. of India, 1998 \n- Best Speaker, Debate finals, VES Institute of Technology, 2001 \n- R.N. Tata Scholarship for academic excellence, 2001-03 Additional Honors & Awards - National Talent Search Scholar, Govt. of India, 1998 \n- Best Speaker, Debate finals, VES Institute of Technology, 2001 \n- R.N. Tata Scholarship for academic excellence, 2001-03 Additional Honors & Awards - National Talent Search Scholar, Govt. of India, 1998 \n- Best Speaker, Debate finals, VES Institute of Technology, 2001 \n- R.N. Tata Scholarship for academic excellence, 2001-03 Additional Honors & Awards - National Talent Search Scholar, Govt. of India, 1998 \n- Best Speaker, Debate finals, VES Institute of Technology, 2001 \n- R.N. Tata Scholarship for academic excellence, 2001-03 ", "Experience RET Engineer Intel Corporation January 2003  – Present (12 years 8 months) Process Engineer Intel Corporation July 2002  –  January 2003  (7 months) Process Engineer Dominion Semiconductor March 2001  –  July 2002  (1 year 5 months) RET Engineer Intel Corporation January 2003  – Present (12 years 8 months) RET Engineer Intel Corporation January 2003  – Present (12 years 8 months) Process Engineer Intel Corporation July 2002  –  January 2003  (7 months) Process Engineer Intel Corporation July 2002  –  January 2003  (7 months) Process Engineer Dominion Semiconductor March 2001  –  July 2002  (1 year 5 months) Process Engineer Dominion Semiconductor March 2001  –  July 2002  (1 year 5 months) Skills JMP Semiconductors Process Simulation Process Engineering Cross-functional Team... R&D IC Skills  JMP Semiconductors Process Simulation Process Engineering Cross-functional Team... R&D IC JMP Semiconductors Process Simulation Process Engineering Cross-functional Team... R&D IC JMP Semiconductors Process Simulation Process Engineering Cross-functional Team... R&D IC Education University of Colorado at Boulder Bachelor of Science (BS),  Chemical Engineering 1996  – 2000 University of Colorado at Boulder Bachelor of Science (BS),  Chemical Engineering 1996  – 2000 University of Colorado at Boulder Bachelor of Science (BS),  Chemical Engineering 1996  – 2000 University of Colorado at Boulder Bachelor of Science (BS),  Chemical Engineering 1996  – 2000 ", "Experience RET Engineer Intel Corporation April 2014  – Present (1 year 5 months) Graduate Research Assistant University of Illinois at Urbana-Champaign August 2008  –  March 2014  (5 years 8 months) RET Engineer Intel Corporation April 2014  – Present (1 year 5 months) RET Engineer Intel Corporation April 2014  – Present (1 year 5 months) Graduate Research Assistant University of Illinois at Urbana-Champaign August 2008  –  March 2014  (5 years 8 months) Graduate Research Assistant University of Illinois at Urbana-Champaign August 2008  –  March 2014  (5 years 8 months) "]}