{"position": "Safety Engineer", "company": "Intel Corporation", "profiles": ["Experience safety engineer Intel Corporation safety engineer Intel Corporation safety engineer Intel Corporation Skills Construction Safety Safety Management... Manufacturing Project Planning Electronics Engineering Skills  Construction Safety Safety Management... Manufacturing Project Planning Electronics Engineering Construction Safety Safety Management... Manufacturing Project Planning Electronics Engineering Construction Safety Safety Management... Manufacturing Project Planning Electronics Engineering ", "Experience Environmental Health and Safety Engineer Intel Corporation 2015  – Present (less than a year) Hillsboro, Oregon EHS Co-op PaperWorks Industries, Inc. April 2014  –  March 2015  (1 year) Greater Philadelphia Area -Assist whenever needed in a variety of Corporate EHS tasks. \n \n-Manage and update permit and compliance data, monthly hours worked, audit results, and other EHS data through the Enablon software. \n \n-Assist with creating audit questionnaires, conducting audits, and creating reports with audit findings. \n \n-Create company-wide EHS Talking Points and a newsletter. \n \n-Conduct Job Hazard Analyses. \n \n-Assisted in writing a new EHS Policy Manual. \n \n-Created and edited forms and a manual addressing EHS and financial considerations whenever equipment is transferred, removed, sold, or purchased in a company facility. Front End Cashier Wegmans Food Markets April 2006  –  April 2014  (8 years 1 month) Chili, NY -Provide excellent customer service, and assist other departments as needed. Environmental Management, and Facilities and Processing Engineering Intern Green Mountain Coffee Roasters June 2013  –  August 2013  (3 months) Waterbury, VT -Created a Permit and Training Calendar \n \n-Interviewed Facility Managers to develop and edit Standard Operating Procedures \n \n-Created a guide for handling hazardous waste to satisfy RCRA and DOT regulations \n \n-Completed 8 hour DOT hazardous waste course \n \n-Assisted with compliance, and beyond compliance at the multi-site facilities \n \n-Attended several \"Lunch and Learn\" events with topics such as: Social Media, Women in the Workplace, Corporate Social Responsibility, Coffee Cupping, and Research and Development to learn from employees and other interns. \n \n-Attended \"Beverage University\" and a Barista training to learn about the process of growing and harvesting coffee beans, roasting, the different flavors and origins, and how to brew coffee and espresso. Secretary WITR November 2011  –  May 2013  (1 year 7 months) Rochester Institute of Technology -Record minutes during executive board and station meetings. NTID Notetaker Rochester Institute of Technology November 2011  –  February 2013  (1 year 4 months) -Record clear, organized notes during class for hearing impaired students. Student Assistant NYS Department of Agriculture & Markets May 2012  –  August 2012  (4 months) Albany, NY -Educated on the NYS Agricultural Environmental Management and Non-point Source Abatement and Control Grant Program. \n \n-Analyzed the distribution of state funding through the AEM program, and how it relates to water quality, then presented a report to the NYS Soil and Water Conservation Committee. \n \n-Attended “Conservation Bootcamp”, to learn first-hand about the implication of best management practices on farmland, how to survey land for the construction of an irrigation system, and was educated by several professionals in related fields from around the state. Senior Counselor at Camp Weona YMCA Buffalo Niagara June 2008  –  August 2010  (2 years 3 months) Gainesville, NY -Responsible for children’s safety, and well-being. \n \n-Perform daily as a leader at camp, and as a lifeguard. Swim Instructor Churchville-Chili Continuing Education September 2003  –  June 2009  (5 years 10 months) Churchville-Chili High School -Taught swim lessons.  \n \n-Supervised children aged 6 months to 14 years. Environmental Health and Safety Engineer Intel Corporation 2015  – Present (less than a year) Hillsboro, Oregon Environmental Health and Safety Engineer Intel Corporation 2015  – Present (less than a year) Hillsboro, Oregon EHS Co-op PaperWorks Industries, Inc. April 2014  –  March 2015  (1 year) Greater Philadelphia Area -Assist whenever needed in a variety of Corporate EHS tasks. \n \n-Manage and update permit and compliance data, monthly hours worked, audit results, and other EHS data through the Enablon software. \n \n-Assist with creating audit questionnaires, conducting audits, and creating reports with audit findings. \n \n-Create company-wide EHS Talking Points and a newsletter. \n \n-Conduct Job Hazard Analyses. \n \n-Assisted in writing a new EHS Policy Manual. \n \n-Created and edited forms and a manual addressing EHS and financial considerations whenever equipment is transferred, removed, sold, or purchased in a company facility. EHS Co-op PaperWorks Industries, Inc. April 2014  –  March 2015  (1 year) Greater Philadelphia Area -Assist whenever needed in a variety of Corporate EHS tasks. \n \n-Manage and update permit and compliance data, monthly hours worked, audit results, and other EHS data through the Enablon software. \n \n-Assist with creating audit questionnaires, conducting audits, and creating reports with audit findings. \n \n-Create company-wide EHS Talking Points and a newsletter. \n \n-Conduct Job Hazard Analyses. \n \n-Assisted in writing a new EHS Policy Manual. \n \n-Created and edited forms and a manual addressing EHS and financial considerations whenever equipment is transferred, removed, sold, or purchased in a company facility. Front End Cashier Wegmans Food Markets April 2006  –  April 2014  (8 years 1 month) Chili, NY -Provide excellent customer service, and assist other departments as needed. Front End Cashier Wegmans Food Markets April 2006  –  April 2014  (8 years 1 month) Chili, NY -Provide excellent customer service, and assist other departments as needed. Environmental Management, and Facilities and Processing Engineering Intern Green Mountain Coffee Roasters June 2013  –  August 2013  (3 months) Waterbury, VT -Created a Permit and Training Calendar \n \n-Interviewed Facility Managers to develop and edit Standard Operating Procedures \n \n-Created a guide for handling hazardous waste to satisfy RCRA and DOT regulations \n \n-Completed 8 hour DOT hazardous waste course \n \n-Assisted with compliance, and beyond compliance at the multi-site facilities \n \n-Attended several \"Lunch and Learn\" events with topics such as: Social Media, Women in the Workplace, Corporate Social Responsibility, Coffee Cupping, and Research and Development to learn from employees and other interns. \n \n-Attended \"Beverage University\" and a Barista training to learn about the process of growing and harvesting coffee beans, roasting, the different flavors and origins, and how to brew coffee and espresso. Environmental Management, and Facilities and Processing Engineering Intern Green Mountain Coffee Roasters June 2013  –  August 2013  (3 months) Waterbury, VT -Created a Permit and Training Calendar \n \n-Interviewed Facility Managers to develop and edit Standard Operating Procedures \n \n-Created a guide for handling hazardous waste to satisfy RCRA and DOT regulations \n \n-Completed 8 hour DOT hazardous waste course \n \n-Assisted with compliance, and beyond compliance at the multi-site facilities \n \n-Attended several \"Lunch and Learn\" events with topics such as: Social Media, Women in the Workplace, Corporate Social Responsibility, Coffee Cupping, and Research and Development to learn from employees and other interns. \n \n-Attended \"Beverage University\" and a Barista training to learn about the process of growing and harvesting coffee beans, roasting, the different flavors and origins, and how to brew coffee and espresso. Secretary WITR November 2011  –  May 2013  (1 year 7 months) Rochester Institute of Technology -Record minutes during executive board and station meetings. Secretary WITR November 2011  –  May 2013  (1 year 7 months) Rochester Institute of Technology -Record minutes during executive board and station meetings. NTID Notetaker Rochester Institute of Technology November 2011  –  February 2013  (1 year 4 months) -Record clear, organized notes during class for hearing impaired students. NTID Notetaker Rochester Institute of Technology November 2011  –  February 2013  (1 year 4 months) -Record clear, organized notes during class for hearing impaired students. Student Assistant NYS Department of Agriculture & Markets May 2012  –  August 2012  (4 months) Albany, NY -Educated on the NYS Agricultural Environmental Management and Non-point Source Abatement and Control Grant Program. \n \n-Analyzed the distribution of state funding through the AEM program, and how it relates to water quality, then presented a report to the NYS Soil and Water Conservation Committee. \n \n-Attended “Conservation Bootcamp”, to learn first-hand about the implication of best management practices on farmland, how to survey land for the construction of an irrigation system, and was educated by several professionals in related fields from around the state. Student Assistant NYS Department of Agriculture & Markets May 2012  –  August 2012  (4 months) Albany, NY -Educated on the NYS Agricultural Environmental Management and Non-point Source Abatement and Control Grant Program. \n \n-Analyzed the distribution of state funding through the AEM program, and how it relates to water quality, then presented a report to the NYS Soil and Water Conservation Committee. \n \n-Attended “Conservation Bootcamp”, to learn first-hand about the implication of best management practices on farmland, how to survey land for the construction of an irrigation system, and was educated by several professionals in related fields from around the state. Senior Counselor at Camp Weona YMCA Buffalo Niagara June 2008  –  August 2010  (2 years 3 months) Gainesville, NY -Responsible for children’s safety, and well-being. \n \n-Perform daily as a leader at camp, and as a lifeguard. Senior Counselor at Camp Weona YMCA Buffalo Niagara June 2008  –  August 2010  (2 years 3 months) Gainesville, NY -Responsible for children’s safety, and well-being. \n \n-Perform daily as a leader at camp, and as a lifeguard. Swim Instructor Churchville-Chili Continuing Education September 2003  –  June 2009  (5 years 10 months) Churchville-Chili High School -Taught swim lessons.  \n \n-Supervised children aged 6 months to 14 years. Swim Instructor Churchville-Chili Continuing Education September 2003  –  June 2009  (5 years 10 months) Churchville-Chili High School -Taught swim lessons.  \n \n-Supervised children aged 6 months to 14 years. Skills Environmental... Hazardous Waste... Leadership Customer Service Teaching Environmental Science Water Quality HAZWOPER ArcGIS Microsoft Office Sustainability Energy Management Geology Environmental Compliance Environmental Permitting Agriculture Pollution Prevention Environmental Impact... Life Cycle Assessment Concentrated Animal... Industrial Hygiene Construction Safety Job Safety Risk Assessment Standardization Data Analysis Experience Working with... RCRA Climate Change EHS Audits Environmental... Environmental Monitoring Safety Auditing Environmental Auditing Industrial Wastewater Safety Management... Workplace Safety See 22+     See less Skills  Environmental... Hazardous Waste... Leadership Customer Service Teaching Environmental Science Water Quality HAZWOPER ArcGIS Microsoft Office Sustainability Energy Management Geology Environmental Compliance Environmental Permitting Agriculture Pollution Prevention Environmental Impact... Life Cycle Assessment Concentrated Animal... Industrial Hygiene Construction Safety Job Safety Risk Assessment Standardization Data Analysis Experience Working with... RCRA Climate Change EHS Audits Environmental... Environmental Monitoring Safety Auditing Environmental Auditing Industrial Wastewater Safety Management... Workplace Safety See 22+     See less Environmental... Hazardous Waste... Leadership Customer Service Teaching Environmental Science Water Quality HAZWOPER ArcGIS Microsoft Office Sustainability Energy Management Geology Environmental Compliance Environmental Permitting Agriculture Pollution Prevention Environmental Impact... Life Cycle Assessment Concentrated Animal... Industrial Hygiene Construction Safety Job Safety Risk Assessment Standardization Data Analysis Experience Working with... RCRA Climate Change EHS Audits Environmental... Environmental Monitoring Safety Auditing Environmental Auditing Industrial Wastewater Safety Management... Workplace Safety See 22+     See less Environmental... Hazardous Waste... Leadership Customer Service Teaching Environmental Science Water Quality HAZWOPER ArcGIS Microsoft Office Sustainability Energy Management Geology Environmental Compliance Environmental Permitting Agriculture Pollution Prevention Environmental Impact... Life Cycle Assessment Concentrated Animal... Industrial Hygiene Construction Safety Job Safety Risk Assessment Standardization Data Analysis Experience Working with... RCRA Climate Change EHS Audits Environmental... Environmental Monitoring Safety Auditing Environmental Auditing Industrial Wastewater Safety Management... Workplace Safety See 22+     See less Education Rochester Institute of Technology BS/MS,  Environmental Sustainability ,  Health and Safety Management with a minor in Environmental Studies 2011  – 2014 -Involved at the student run radio station as a DJ . \n \n-Have received scholarships from Americorps, and Wegmans Food Markets. \n \n-Made Dean's List during several quarters/semesters. Activities and Societies:  The National Society of Leadership ,  WITR Radio Churchville-Chili Senior High School Advanced Regents Diploma with Honors 2007  – 2009 President of Model UN, Captain of the Varsity Swim Team, in a double accelerated program 4th grade and beyond, graduated with an Advanced Regents Diploma with Honors. Activities and Societies:  National Honor Society Rochester Institute of Technology BS/MS,  Environmental Sustainability ,  Health and Safety Management with a minor in Environmental Studies 2011  – 2014 -Involved at the student run radio station as a DJ . \n \n-Have received scholarships from Americorps, and Wegmans Food Markets. \n \n-Made Dean's List during several quarters/semesters. Activities and Societies:  The National Society of Leadership ,  WITR Radio Rochester Institute of Technology BS/MS,  Environmental Sustainability ,  Health and Safety Management with a minor in Environmental Studies 2011  – 2014 -Involved at the student run radio station as a DJ . \n \n-Have received scholarships from Americorps, and Wegmans Food Markets. \n \n-Made Dean's List during several quarters/semesters. Activities and Societies:  The National Society of Leadership ,  WITR Radio Rochester Institute of Technology BS/MS,  Environmental Sustainability ,  Health and Safety Management with a minor in Environmental Studies 2011  – 2014 -Involved at the student run radio station as a DJ . \n \n-Have received scholarships from Americorps, and Wegmans Food Markets. \n \n-Made Dean's List during several quarters/semesters. Activities and Societies:  The National Society of Leadership ,  WITR Radio Churchville-Chili Senior High School Advanced Regents Diploma with Honors 2007  – 2009 President of Model UN, Captain of the Varsity Swim Team, in a double accelerated program 4th grade and beyond, graduated with an Advanced Regents Diploma with Honors. Activities and Societies:  National Honor Society Churchville-Chili Senior High School Advanced Regents Diploma with Honors 2007  – 2009 President of Model UN, Captain of the Varsity Swim Team, in a double accelerated program 4th grade and beyond, graduated with an Advanced Regents Diploma with Honors. Activities and Societies:  National Honor Society Churchville-Chili Senior High School Advanced Regents Diploma with Honors 2007  – 2009 President of Model UN, Captain of the Varsity Swim Team, in a double accelerated program 4th grade and beyond, graduated with an Advanced Regents Diploma with Honors. Activities and Societies:  National Honor Society ", "Experience Environmental Heath and Safety Engineer Intel Corporation May 2012  – Present (3 years 4 months) Hillsboro, Oregon Environmental Heath Safety Coordinator, Supporting all aspects of Safety work to influence strategic direction, safety culture, and influence management to gain strong support in EHS. responsible for incident communication including reporting and tracking safety indicators; Supports sustaining operations through coordination of EHS resources performing incidents investigations , injury analysis, and provides technical support to resolve issues implements and carries out EHS changes driven through regulatory or corporate EHS initiatives program Develop and implement appropriate EHS programs aimed toward reducing injuries/illnesses of customer personnel. In Store Operation including customer service Home Depot February 2005  –  May 2012  (7 years 4 months) Prescott,AZ Sales Representative was able to generate leads, conduct sales presentations in the home and accurately measure and price product. \nConduct home improvement advices,  \nParticipate in sales meetings, training sessions, and territory and branch meetings. \nCompleting relevant paperwork accurately and in a timely manner and continually updating my product and market knowledge.  \nFollowing through on responsibilities, to customers and recovering from any errors made. \nComplete projects and assignments accurately, catching errors before completion, despite a large workload, competing demands and a fast paced environment. \nEffectively communicate with Customers. \nPriorities, plan and coordinate work activity and obtain and manager resources so that objectives are accomplished on time. Library Student Assistant Embry-Riddle Aeronautical University March 2004  –  March 2006  (2 years 1 month) Assisting with daily interlibrary loan functions. \nProviding bibliographic instruction to patrons \nAnswering read- reference questions \nResearching and responding to more complex reference questions \nAssisting with simple machine malfunctions, such as printers and copiers \nProcessing mail, shelving references materials, and conducting inventories. English - French Interpreter Independant Contractor January 2002  –  January 2005  (3 years 1 month) Phoenix, Arizona Area - Provide Linguistics Expertise to Project managers and clients \n- Prioritize multiple projects in fast paced environment  \n- Responsible for the output of English into French translation projects, religious materials ect... Environmental Heath and Safety Engineer Intel Corporation May 2012  – Present (3 years 4 months) Hillsboro, Oregon Environmental Heath Safety Coordinator, Supporting all aspects of Safety work to influence strategic direction, safety culture, and influence management to gain strong support in EHS. responsible for incident communication including reporting and tracking safety indicators; Supports sustaining operations through coordination of EHS resources performing incidents investigations , injury analysis, and provides technical support to resolve issues implements and carries out EHS changes driven through regulatory or corporate EHS initiatives program Develop and implement appropriate EHS programs aimed toward reducing injuries/illnesses of customer personnel. Environmental Heath and Safety Engineer Intel Corporation May 2012  – Present (3 years 4 months) Hillsboro, Oregon Environmental Heath Safety Coordinator, Supporting all aspects of Safety work to influence strategic direction, safety culture, and influence management to gain strong support in EHS. responsible for incident communication including reporting and tracking safety indicators; Supports sustaining operations through coordination of EHS resources performing incidents investigations , injury analysis, and provides technical support to resolve issues implements and carries out EHS changes driven through regulatory or corporate EHS initiatives program Develop and implement appropriate EHS programs aimed toward reducing injuries/illnesses of customer personnel. In Store Operation including customer service Home Depot February 2005  –  May 2012  (7 years 4 months) Prescott,AZ Sales Representative was able to generate leads, conduct sales presentations in the home and accurately measure and price product. \nConduct home improvement advices,  \nParticipate in sales meetings, training sessions, and territory and branch meetings. \nCompleting relevant paperwork accurately and in a timely manner and continually updating my product and market knowledge.  \nFollowing through on responsibilities, to customers and recovering from any errors made. \nComplete projects and assignments accurately, catching errors before completion, despite a large workload, competing demands and a fast paced environment. \nEffectively communicate with Customers. \nPriorities, plan and coordinate work activity and obtain and manager resources so that objectives are accomplished on time. In Store Operation including customer service Home Depot February 2005  –  May 2012  (7 years 4 months) Prescott,AZ Sales Representative was able to generate leads, conduct sales presentations in the home and accurately measure and price product. \nConduct home improvement advices,  \nParticipate in sales meetings, training sessions, and territory and branch meetings. \nCompleting relevant paperwork accurately and in a timely manner and continually updating my product and market knowledge.  \nFollowing through on responsibilities, to customers and recovering from any errors made. \nComplete projects and assignments accurately, catching errors before completion, despite a large workload, competing demands and a fast paced environment. \nEffectively communicate with Customers. \nPriorities, plan and coordinate work activity and obtain and manager resources so that objectives are accomplished on time. Library Student Assistant Embry-Riddle Aeronautical University March 2004  –  March 2006  (2 years 1 month) Assisting with daily interlibrary loan functions. \nProviding bibliographic instruction to patrons \nAnswering read- reference questions \nResearching and responding to more complex reference questions \nAssisting with simple machine malfunctions, such as printers and copiers \nProcessing mail, shelving references materials, and conducting inventories. Library Student Assistant Embry-Riddle Aeronautical University March 2004  –  March 2006  (2 years 1 month) Assisting with daily interlibrary loan functions. \nProviding bibliographic instruction to patrons \nAnswering read- reference questions \nResearching and responding to more complex reference questions \nAssisting with simple machine malfunctions, such as printers and copiers \nProcessing mail, shelving references materials, and conducting inventories. English - French Interpreter Independant Contractor January 2002  –  January 2005  (3 years 1 month) Phoenix, Arizona Area - Provide Linguistics Expertise to Project managers and clients \n- Prioritize multiple projects in fast paced environment  \n- Responsible for the output of English into French translation projects, religious materials ect... English - French Interpreter Independant Contractor January 2002  –  January 2005  (3 years 1 month) Phoenix, Arizona Area - Provide Linguistics Expertise to Project managers and clients \n- Prioritize multiple projects in fast paced environment  \n- Responsible for the output of English into French translation projects, religious materials ect... Languages English Native or bilingual proficiency French Native or bilingual proficiency English Native or bilingual proficiency French Native or bilingual proficiency English Native or bilingual proficiency French Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Customer Service PowerPoint Microsoft Office Microsoft Excel Microsoft Word Research Inventory Management Project Management Negotiation Access Teamwork Outlook Leadership Airport Management Human Factors Environmental Health... Industrial Hygiene Ergonomics Aviation Airline Management Risk Management See 6+     See less Skills  Customer Service PowerPoint Microsoft Office Microsoft Excel Microsoft Word Research Inventory Management Project Management Negotiation Access Teamwork Outlook Leadership Airport Management Human Factors Environmental Health... Industrial Hygiene Ergonomics Aviation Airline Management Risk Management See 6+     See less Customer Service PowerPoint Microsoft Office Microsoft Excel Microsoft Word Research Inventory Management Project Management Negotiation Access Teamwork Outlook Leadership Airport Management Human Factors Environmental Health... Industrial Hygiene Ergonomics Aviation Airline Management Risk Management See 6+     See less Customer Service PowerPoint Microsoft Office Microsoft Excel Microsoft Word Research Inventory Management Project Management Negotiation Access Teamwork Outlook Leadership Airport Management Human Factors Environmental Health... Industrial Hygiene Ergonomics Aviation Airline Management Risk Management See 6+     See less Education Embry Riddle Aeronautical University (ERAU) Master of Science,  Safety Science 2010  – 2012 Embry-Riddle Aeronautical University Bachelor of Science (B.S.) Business Administration,  Airport Management 2005  – 2009 Activities and Societies:  American Association of Airport Executives(AAAE) ,  events and fundraising coordinator Prescott Chapter kitomesa Embry Riddle Aeronautical University (ERAU) Master of Science,  Safety Science 2010  – 2012 Embry Riddle Aeronautical University (ERAU) Master of Science,  Safety Science 2010  – 2012 Embry Riddle Aeronautical University (ERAU) Master of Science,  Safety Science 2010  – 2012 Embry-Riddle Aeronautical University Bachelor of Science (B.S.) Business Administration,  Airport Management 2005  – 2009 Activities and Societies:  American Association of Airport Executives(AAAE) ,  events and fundraising coordinator Prescott Chapter Embry-Riddle Aeronautical University Bachelor of Science (B.S.) Business Administration,  Airport Management 2005  – 2009 Activities and Societies:  American Association of Airport Executives(AAAE) ,  events and fundraising coordinator Prescott Chapter Embry-Riddle Aeronautical University Bachelor of Science (B.S.) Business Administration,  Airport Management 2005  – 2009 Activities and Societies:  American Association of Airport Executives(AAAE) ,  events and fundraising coordinator Prescott Chapter kitomesa kitomesa kitomesa ", "Experience Industrial Hygienist and SafetyEngineer Intel Corporation July 2012  – Present (3 years 2 months) Hillsboro, OR Graduate Intern King County Public Health: Environmental Health April 2011  –  June 2012  (1 year 3 months) EHS Graduate Intern Intel Corporation June 2011  –  September 2011  (4 months) Portland, Oregon Area Research Assistant Lynntech, Inc June 2008  –  August 2010  (2 years 3 months) Laboratory Assistant- Drug Testing Lab Texas Veterinary Medical Diagnostic Lab May 2007  –  May 2008  (1 year 1 month) Laboratory Assistant- Borlaug Center for Southern Crop Improvement Texas A&M University April 2005  –  May 2007  (2 years 2 months) Industrial Hygienist and SafetyEngineer Intel Corporation July 2012  – Present (3 years 2 months) Hillsboro, OR Industrial Hygienist and SafetyEngineer Intel Corporation July 2012  – Present (3 years 2 months) Hillsboro, OR Graduate Intern King County Public Health: Environmental Health April 2011  –  June 2012  (1 year 3 months) Graduate Intern King County Public Health: Environmental Health April 2011  –  June 2012  (1 year 3 months) EHS Graduate Intern Intel Corporation June 2011  –  September 2011  (4 months) Portland, Oregon Area EHS Graduate Intern Intel Corporation June 2011  –  September 2011  (4 months) Portland, Oregon Area Research Assistant Lynntech, Inc June 2008  –  August 2010  (2 years 3 months) Research Assistant Lynntech, Inc June 2008  –  August 2010  (2 years 3 months) Laboratory Assistant- Drug Testing Lab Texas Veterinary Medical Diagnostic Lab May 2007  –  May 2008  (1 year 1 month) Laboratory Assistant- Drug Testing Lab Texas Veterinary Medical Diagnostic Lab May 2007  –  May 2008  (1 year 1 month) Laboratory Assistant- Borlaug Center for Southern Crop Improvement Texas A&M University April 2005  –  May 2007  (2 years 2 months) Laboratory Assistant- Borlaug Center for Southern Crop Improvement Texas A&M University April 2005  –  May 2007  (2 years 2 months) Education University of Washington M.S.,  Industrial Hygiene 2010  – 2012 Texas A&M University B.S.,  Chemistry 2004  – 2008 University of Washington M.S.,  Industrial Hygiene 2010  – 2012 University of Washington M.S.,  Industrial Hygiene 2010  – 2012 University of Washington M.S.,  Industrial Hygiene 2010  – 2012 Texas A&M University B.S.,  Chemistry 2004  – 2008 Texas A&M University B.S.,  Chemistry 2004  – 2008 Texas A&M University B.S.,  Chemistry 2004  – 2008 ", "Experience Technology Development Ergonomist and Safety Engineer Intel Corporation September 2012  – Present (3 years) Ergonomist Intel Corporation July 2011  –  September 2012  (1 year 3 months) Research Assistant University of Michigan - Center for Ergonomics September 2007  –  June 2011  (3 years 10 months) Human Factors and Product Safety Consultant Intern Applied Safety and Ergonomics, Inc. May 2010  –  August 2010  (4 months) Technology Development Ergonomist and Safety Engineer Intel Corporation September 2012  – Present (3 years) Technology Development Ergonomist and Safety Engineer Intel Corporation September 2012  – Present (3 years) Ergonomist Intel Corporation July 2011  –  September 2012  (1 year 3 months) Ergonomist Intel Corporation July 2011  –  September 2012  (1 year 3 months) Research Assistant University of Michigan - Center for Ergonomics September 2007  –  June 2011  (3 years 10 months) Research Assistant University of Michigan - Center for Ergonomics September 2007  –  June 2011  (3 years 10 months) Human Factors and Product Safety Consultant Intern Applied Safety and Ergonomics, Inc. May 2010  –  August 2010  (4 months) Human Factors and Product Safety Consultant Intern Applied Safety and Ergonomics, Inc. May 2010  –  August 2010  (4 months) Languages Japanese Japanese Japanese Skills Engineering Programming Ergonomics Research Biomechanics Mathematics Matlab Human Factors Simulations Minitab Labview Statistics Human Factors... Industrial Engineering Data Analysis C++ Human Computer... Analysis Root Cause Analysis Teaching PowerPoint Microsoft Excel Solidworks Microsoft Office Mathematical Modeling See 10+     See less Skills  Engineering Programming Ergonomics Research Biomechanics Mathematics Matlab Human Factors Simulations Minitab Labview Statistics Human Factors... Industrial Engineering Data Analysis C++ Human Computer... Analysis Root Cause Analysis Teaching PowerPoint Microsoft Excel Solidworks Microsoft Office Mathematical Modeling See 10+     See less Engineering Programming Ergonomics Research Biomechanics Mathematics Matlab Human Factors Simulations Minitab Labview Statistics Human Factors... Industrial Engineering Data Analysis C++ Human Computer... Analysis Root Cause Analysis Teaching PowerPoint Microsoft Excel Solidworks Microsoft Office Mathematical Modeling See 10+     See less Engineering Programming Ergonomics Research Biomechanics Mathematics Matlab Human Factors Simulations Minitab Labview Statistics Human Factors... Industrial Engineering Data Analysis C++ Human Computer... Analysis Root Cause Analysis Teaching PowerPoint Microsoft Excel Solidworks Microsoft Office Mathematical Modeling See 10+     See less Education University of Michigan Master of Science in Engineering (MSE),  Industrual and Operations Engineering 2010  – 2011 NIOSH Fellowship University of Michigan Bachelor of Science in Engineering (BSE),  Industrial and Operations Engineering , Japanese Language 2006  – 2010 International student in Tokyo, Japan during the summer of 2008. Advanced proficiency of Japanese language while also tutored University students in math, writing and programming. Activities and Societies:  President of the Society of Global Engineers ,  Leadership Chair for the Epeians Engineering Leadership and Honor Society ,  Co-chair for annual College of Engineering Leaders and Honors Awards Banquet University of Michigan Master of Science in Engineering (MSE),  Industrual and Operations Engineering 2010  – 2011 NIOSH Fellowship University of Michigan Master of Science in Engineering (MSE),  Industrual and Operations Engineering 2010  – 2011 NIOSH Fellowship University of Michigan Master of Science in Engineering (MSE),  Industrual and Operations Engineering 2010  – 2011 NIOSH Fellowship University of Michigan Bachelor of Science in Engineering (BSE),  Industrial and Operations Engineering , Japanese Language 2006  – 2010 International student in Tokyo, Japan during the summer of 2008. Advanced proficiency of Japanese language while also tutored University students in math, writing and programming. Activities and Societies:  President of the Society of Global Engineers ,  Leadership Chair for the Epeians Engineering Leadership and Honor Society ,  Co-chair for annual College of Engineering Leaders and Honors Awards Banquet University of Michigan Bachelor of Science in Engineering (BSE),  Industrial and Operations Engineering , Japanese Language 2006  – 2010 International student in Tokyo, Japan during the summer of 2008. Advanced proficiency of Japanese language while also tutored University students in math, writing and programming. Activities and Societies:  President of the Society of Global Engineers ,  Leadership Chair for the Epeians Engineering Leadership and Honor Society ,  Co-chair for annual College of Engineering Leaders and Honors Awards Banquet University of Michigan Bachelor of Science in Engineering (BSE),  Industrial and Operations Engineering , Japanese Language 2006  – 2010 International student in Tokyo, Japan during the summer of 2008. Advanced proficiency of Japanese language while also tutored University students in math, writing and programming. Activities and Societies:  President of the Society of Global Engineers ,  Leadership Chair for the Epeians Engineering Leadership and Honor Society ,  Co-chair for annual College of Engineering Leaders and Honors Awards Banquet Honors & Awards ", "Experience Industrial Hygiene & Process Safety Engineer Intel Corporation November 2002  –  February 2013  (10 years 4 months) Ireland Safety Data Specialist & R&D Biochemist Olympus Diagnostica July 1999  –  September 2001  (2 years 3 months) R&D Biochemist Olympus Diagnostica April 1998  –  September 1998  (6 months) Industrial Hygiene & Process Safety Engineer Intel Corporation November 2002  –  February 2013  (10 years 4 months) Ireland Industrial Hygiene & Process Safety Engineer Intel Corporation November 2002  –  February 2013  (10 years 4 months) Ireland Safety Data Specialist & R&D Biochemist Olympus Diagnostica July 1999  –  September 2001  (2 years 3 months) Safety Data Specialist & R&D Biochemist Olympus Diagnostica July 1999  –  September 2001  (2 years 3 months) R&D Biochemist Olympus Diagnostica April 1998  –  September 1998  (6 months) R&D Biochemist Olympus Diagnostica April 1998  –  September 1998  (6 months) Skills Industrial Hygiene Process Safety EHS Risk Assessment Ergonomics Safety Management... Accident Investigation Hazard Identification Environmental Compliance Occupational Health Environmental... Hazardous Waste... R&D ISO 14001 Root Cause Analysis Industrial Safety Safety Engineering OSHAS 18001 Construction Safety ISO Inspection Environmental Awareness Hazard Recognition Behavior Based Safety Hazard Analysis Process Engineering See 11+     See less Skills  Industrial Hygiene Process Safety EHS Risk Assessment Ergonomics Safety Management... Accident Investigation Hazard Identification Environmental Compliance Occupational Health Environmental... Hazardous Waste... R&D ISO 14001 Root Cause Analysis Industrial Safety Safety Engineering OSHAS 18001 Construction Safety ISO Inspection Environmental Awareness Hazard Recognition Behavior Based Safety Hazard Analysis Process Engineering See 11+     See less Industrial Hygiene Process Safety EHS Risk Assessment Ergonomics Safety Management... Accident Investigation Hazard Identification Environmental Compliance Occupational Health Environmental... Hazardous Waste... R&D ISO 14001 Root Cause Analysis Industrial Safety Safety Engineering OSHAS 18001 Construction Safety ISO Inspection Environmental Awareness Hazard Recognition Behavior Based Safety Hazard Analysis Process Engineering See 11+     See less Industrial Hygiene Process Safety EHS Risk Assessment Ergonomics Safety Management... Accident Investigation Hazard Identification Environmental Compliance Occupational Health Environmental... Hazardous Waste... R&D ISO 14001 Root Cause Analysis Industrial Safety Safety Engineering OSHAS 18001 Construction Safety ISO Inspection Environmental Awareness Hazard Recognition Behavior Based Safety Hazard Analysis Process Engineering See 11+     See less Education The University of Sheffield Master of Engineering (MEng),  Process Safety and Loss Prevention 2009  – 2012 Distinction University College Dublin Professional Certificate,  Radiation Safety 2010  – 2010 Trinity College, Dublin Post Graduate Diploma,  Environmental Engineering 2004  – 2005 Distinction National University of Ireland, Galway Master of Science (MSc),  Occupational Health and Ergonomics 2001  – 2002 Dublin City University Bachelor of Science (BSc),  Biotechnology 1995  – 1999 The University of Sheffield Master of Engineering (MEng),  Process Safety and Loss Prevention 2009  – 2012 Distinction The University of Sheffield Master of Engineering (MEng),  Process Safety and Loss Prevention 2009  – 2012 Distinction The University of Sheffield Master of Engineering (MEng),  Process Safety and Loss Prevention 2009  – 2012 Distinction University College Dublin Professional Certificate,  Radiation Safety 2010  – 2010 University College Dublin Professional Certificate,  Radiation Safety 2010  – 2010 University College Dublin Professional Certificate,  Radiation Safety 2010  – 2010 Trinity College, Dublin Post Graduate Diploma,  Environmental Engineering 2004  – 2005 Distinction Trinity College, Dublin Post Graduate Diploma,  Environmental Engineering 2004  – 2005 Distinction Trinity College, Dublin Post Graduate Diploma,  Environmental Engineering 2004  – 2005 Distinction National University of Ireland, Galway Master of Science (MSc),  Occupational Health and Ergonomics 2001  – 2002 National University of Ireland, Galway Master of Science (MSc),  Occupational Health and Ergonomics 2001  – 2002 National University of Ireland, Galway Master of Science (MSc),  Occupational Health and Ergonomics 2001  – 2002 Dublin City University Bachelor of Science (BSc),  Biotechnology 1995  – 1999 Dublin City University Bachelor of Science (BSc),  Biotechnology 1995  – 1999 Dublin City University Bachelor of Science (BSc),  Biotechnology 1995  – 1999 ", "Summary Specialties:Risk Management Summary Specialties:Risk Management Specialties:Risk Management Specialties:Risk Management Experience Industrial Hygienist/Safety Engineer Intel Corporation October 2014  – Present (11 months) Hillsboro, Oregon Industrial Hygienist and EHS Coordinator Gulfstream Aerospace June 2012  –  September 2014  (2 years 4 months) Savannah, Georgia Area Industrial Hygiene Intern Gulfstream Aerospace May 2011  –  June 2012  (1 year 2 months) Savannah, Ga Industrial Hygienist/Safety Engineer Intel Corporation October 2014  – Present (11 months) Hillsboro, Oregon Industrial Hygienist/Safety Engineer Intel Corporation October 2014  – Present (11 months) Hillsboro, Oregon Industrial Hygienist and EHS Coordinator Gulfstream Aerospace June 2012  –  September 2014  (2 years 4 months) Savannah, Georgia Area Industrial Hygienist and EHS Coordinator Gulfstream Aerospace June 2012  –  September 2014  (2 years 4 months) Savannah, Georgia Area Industrial Hygiene Intern Gulfstream Aerospace May 2011  –  June 2012  (1 year 2 months) Savannah, Ga Industrial Hygiene Intern Gulfstream Aerospace May 2011  –  June 2012  (1 year 2 months) Savannah, Ga Skills Air Quality Toxicology Emergency Management Risk Assessment Statistics Risk Management Ergonomics Hazardous Waste... EHS Industrial Hygiene Lean Manufacturing Industrial Safety Occupational Health HAZWOPER Continuous Improvement Hazardous Materials Hazard Analysis EPA Environmental Awareness Environmental Compliance Research See 6+     See less Skills  Air Quality Toxicology Emergency Management Risk Assessment Statistics Risk Management Ergonomics Hazardous Waste... EHS Industrial Hygiene Lean Manufacturing Industrial Safety Occupational Health HAZWOPER Continuous Improvement Hazardous Materials Hazard Analysis EPA Environmental Awareness Environmental Compliance Research See 6+     See less Air Quality Toxicology Emergency Management Risk Assessment Statistics Risk Management Ergonomics Hazardous Waste... EHS Industrial Hygiene Lean Manufacturing Industrial Safety Occupational Health HAZWOPER Continuous Improvement Hazardous Materials Hazard Analysis EPA Environmental Awareness Environmental Compliance Research See 6+     See less Air Quality Toxicology Emergency Management Risk Assessment Statistics Risk Management Ergonomics Hazardous Waste... EHS Industrial Hygiene Lean Manufacturing Industrial Safety Occupational Health HAZWOPER Continuous Improvement Hazardous Materials Hazard Analysis EPA Environmental Awareness Environmental Compliance Research See 6+     See less Education Tulane University MSPH,  Environmental Health Sciences and Industrial Hygiene 2010  – 2012 Wake Forest University BS,  Health Science ,  Sociology 2006  – 2009 Activities and Societies:  WFU Resident Advisor ,  Campus Kitchen Intern and Volunteer Tulane University MSPH,  Environmental Health Sciences and Industrial Hygiene 2010  – 2012 Tulane University MSPH,  Environmental Health Sciences and Industrial Hygiene 2010  – 2012 Tulane University MSPH,  Environmental Health Sciences and Industrial Hygiene 2010  – 2012 Wake Forest University BS,  Health Science ,  Sociology 2006  – 2009 Activities and Societies:  WFU Resident Advisor ,  Campus Kitchen Intern and Volunteer Wake Forest University BS,  Health Science ,  Sociology 2006  – 2009 Activities and Societies:  WFU Resident Advisor ,  Campus Kitchen Intern and Volunteer Wake Forest University BS,  Health Science ,  Sociology 2006  – 2009 Activities and Societies:  WFU Resident Advisor ,  Campus Kitchen Intern and Volunteer ", "Experience chemical engineer Intel Corporation chemical engineer Intel Corporation chemical engineer Intel Corporation Skills Process Engineering Semiconductors Skills  Process Engineering Semiconductors Process Engineering Semiconductors Process Engineering Semiconductors ", "Experience Sr. Safety Engineer Intel Corporation June 1997  – Present (18 years 3 months) Providing a wide variety of EHS support in office, computer & chemical labs and cleanroom environments. Some of the programs covered include Injury/Illness Prevention Programs, lockout/tagout, radiation safety for state registered machines, hazard communication/Prop.65, general chemical safety, compliance assessments for recent acquisitions, pre-use equipment sign-offs, powered industrial truck training, emergency response and business continuity to name a few. Safety Coordinator Pilkington (formerly Libbey Owens Ford) 1994  –  1997  (3 years) Provided Safety & Health services for a 400+ glass mfg and automotive fabrication plant Sr. Safety Engineer Intel Corporation June 1997  – Present (18 years 3 months) Providing a wide variety of EHS support in office, computer & chemical labs and cleanroom environments. Some of the programs covered include Injury/Illness Prevention Programs, lockout/tagout, radiation safety for state registered machines, hazard communication/Prop.65, general chemical safety, compliance assessments for recent acquisitions, pre-use equipment sign-offs, powered industrial truck training, emergency response and business continuity to name a few. Sr. Safety Engineer Intel Corporation June 1997  – Present (18 years 3 months) Providing a wide variety of EHS support in office, computer & chemical labs and cleanroom environments. Some of the programs covered include Injury/Illness Prevention Programs, lockout/tagout, radiation safety for state registered machines, hazard communication/Prop.65, general chemical safety, compliance assessments for recent acquisitions, pre-use equipment sign-offs, powered industrial truck training, emergency response and business continuity to name a few. Safety Coordinator Pilkington (formerly Libbey Owens Ford) 1994  –  1997  (3 years) Provided Safety & Health services for a 400+ glass mfg and automotive fabrication plant Safety Coordinator Pilkington (formerly Libbey Owens Ford) 1994  –  1997  (3 years) Provided Safety & Health services for a 400+ glass mfg and automotive fabrication plant Skills Manufacturing Ergonomics Semiconductors EHS Root Cause Analysis Engineering Management Intel Industrial Hygiene Leadership Technical Training Electronics Risk Assessment Lean Manufacturing Operational Risk... Process Safety Safety Management... Industrial Safety Process Simulation Diffusion Operational Safety Microsoft Access... CA Radiation Machine... Cal/OSHA General... Design of Experiments Silicon Continuous Improvement Failure Analysis Metrology Process Integration Semiconductor Industry Reliability PVD Hazardous Waste... Process Engineering R&D ISO SPC JMP Occupational Health CVD Engineering See 26+     See less Skills  Manufacturing Ergonomics Semiconductors EHS Root Cause Analysis Engineering Management Intel Industrial Hygiene Leadership Technical Training Electronics Risk Assessment Lean Manufacturing Operational Risk... Process Safety Safety Management... Industrial Safety Process Simulation Diffusion Operational Safety Microsoft Access... CA Radiation Machine... Cal/OSHA General... Design of Experiments Silicon Continuous Improvement Failure Analysis Metrology Process Integration Semiconductor Industry Reliability PVD Hazardous Waste... Process Engineering R&D ISO SPC JMP Occupational Health CVD Engineering See 26+     See less Manufacturing Ergonomics Semiconductors EHS Root Cause Analysis Engineering Management Intel Industrial Hygiene Leadership Technical Training Electronics Risk Assessment Lean Manufacturing Operational Risk... Process Safety Safety Management... Industrial Safety Process Simulation Diffusion Operational Safety Microsoft Access... CA Radiation Machine... Cal/OSHA General... Design of Experiments Silicon Continuous Improvement Failure Analysis Metrology Process Integration Semiconductor Industry Reliability PVD Hazardous Waste... Process Engineering R&D ISO SPC JMP Occupational Health CVD Engineering See 26+     See less Manufacturing Ergonomics Semiconductors EHS Root Cause Analysis Engineering Management Intel Industrial Hygiene Leadership Technical Training Electronics Risk Assessment Lean Manufacturing Operational Risk... Process Safety Safety Management... Industrial Safety Process Simulation Diffusion Operational Safety Microsoft Access... CA Radiation Machine... Cal/OSHA General... Design of Experiments Silicon Continuous Improvement Failure Analysis Metrology Process Integration Semiconductor Industry Reliability PVD Hazardous Waste... Process Engineering R&D ISO SPC JMP Occupational Health CVD Engineering See 26+     See less Education University of Southern California University of Southern California University of Southern California University of Southern California ", "Experience Construction Environment Health Safety Engineer Intel Corporation October 2014  – Present (11 months) Penang, Malaysia JHA Revise with GC/Vendor \nSIPP Approval  \nEnforce in Safety & Health \nSite Inspection & SMBWA \nConduct Safety & OAC Meeting \nConduct NCO & NEO class for new staff & Contractors \nSite Survey and conduct Risk Assesment before to advise Project Management \n safety supervisor 3 Ocean Engneering April 2012  – Present (3 years 5 months) safety officer Shafiza Bumi Consultan (Kobelco) December 2013  –  April 2014  (5 months) Nagasari Prai, Industrial Penang a. To ensure all document relate in safety control \nb. Visual Inspect for any Heavy/Light machinery entry to project site \nc. Take care in traffic control during long/heavy structure access \nd. Conduct and observe any heavy lifting activity \ne. To conduct safety meeting/SMBWA/implementation and inspection  \n safety officer Cargill June 2013  –  November 2013  (6 months) port klang, malaysia a. To inspect daily construction machinery like crane,sky lift, power tools, welding kits, and etc \nb. To conduct daily tools box meeting with latest update topic \nc. Conduct safety meeting/SMBWA/site inspection,implementation on OSHA Regulation, filing, major housekeeping to make work area clear from hazard \nd. Conduct Safety Training, Safety Awareness Program, Inspect Personnel Protection Equipment Construction Environment Health Safety Engineer Intel Corporation October 2014  – Present (11 months) Penang, Malaysia JHA Revise with GC/Vendor \nSIPP Approval  \nEnforce in Safety & Health \nSite Inspection & SMBWA \nConduct Safety & OAC Meeting \nConduct NCO & NEO class for new staff & Contractors \nSite Survey and conduct Risk Assesment before to advise Project Management \n Construction Environment Health Safety Engineer Intel Corporation October 2014  – Present (11 months) Penang, Malaysia JHA Revise with GC/Vendor \nSIPP Approval  \nEnforce in Safety & Health \nSite Inspection & SMBWA \nConduct Safety & OAC Meeting \nConduct NCO & NEO class for new staff & Contractors \nSite Survey and conduct Risk Assesment before to advise Project Management \n safety supervisor 3 Ocean Engneering April 2012  – Present (3 years 5 months) safety supervisor 3 Ocean Engneering April 2012  – Present (3 years 5 months) safety officer Shafiza Bumi Consultan (Kobelco) December 2013  –  April 2014  (5 months) Nagasari Prai, Industrial Penang a. To ensure all document relate in safety control \nb. Visual Inspect for any Heavy/Light machinery entry to project site \nc. Take care in traffic control during long/heavy structure access \nd. Conduct and observe any heavy lifting activity \ne. To conduct safety meeting/SMBWA/implementation and inspection  \n safety officer Shafiza Bumi Consultan (Kobelco) December 2013  –  April 2014  (5 months) Nagasari Prai, Industrial Penang a. To ensure all document relate in safety control \nb. Visual Inspect for any Heavy/Light machinery entry to project site \nc. Take care in traffic control during long/heavy structure access \nd. Conduct and observe any heavy lifting activity \ne. To conduct safety meeting/SMBWA/implementation and inspection  \n safety officer Cargill June 2013  –  November 2013  (6 months) port klang, malaysia a. To inspect daily construction machinery like crane,sky lift, power tools, welding kits, and etc \nb. To conduct daily tools box meeting with latest update topic \nc. Conduct safety meeting/SMBWA/site inspection,implementation on OSHA Regulation, filing, major housekeeping to make work area clear from hazard \nd. Conduct Safety Training, Safety Awareness Program, Inspect Personnel Protection Equipment safety officer Cargill June 2013  –  November 2013  (6 months) port klang, malaysia a. To inspect daily construction machinery like crane,sky lift, power tools, welding kits, and etc \nb. To conduct daily tools box meeting with latest update topic \nc. Conduct safety meeting/SMBWA/site inspection,implementation on OSHA Regulation, filing, major housekeeping to make work area clear from hazard \nd. Conduct Safety Training, Safety Awareness Program, Inspect Personnel Protection Equipment ", "Summary My name is Kent Clouse a safety professional looking to expand my horizons in the field of Environmental Health and Safety. I look forward to be considered as part of a challenging and rewarding safety team.  \n \nOver the breadth of internships and my career, I’ve been able to work to meet safety goals, empower employee safety and maintain company compliance. I have had the opportunity during my years as a safety professional to lead various teams, build creative problem solving skills and generate excitement in those around me about safety. As you will note in the accomplishments under the experience section, my expertise covers various aspects of safety management that may be beneficial to your company. Please do not hesitate to contact me with any questions or opportunities you may have. Summary My name is Kent Clouse a safety professional looking to expand my horizons in the field of Environmental Health and Safety. I look forward to be considered as part of a challenging and rewarding safety team.  \n \nOver the breadth of internships and my career, I’ve been able to work to meet safety goals, empower employee safety and maintain company compliance. I have had the opportunity during my years as a safety professional to lead various teams, build creative problem solving skills and generate excitement in those around me about safety. As you will note in the accomplishments under the experience section, my expertise covers various aspects of safety management that may be beneficial to your company. Please do not hesitate to contact me with any questions or opportunities you may have. My name is Kent Clouse a safety professional looking to expand my horizons in the field of Environmental Health and Safety. I look forward to be considered as part of a challenging and rewarding safety team.  \n \nOver the breadth of internships and my career, I’ve been able to work to meet safety goals, empower employee safety and maintain company compliance. I have had the opportunity during my years as a safety professional to lead various teams, build creative problem solving skills and generate excitement in those around me about safety. As you will note in the accomplishments under the experience section, my expertise covers various aspects of safety management that may be beneficial to your company. Please do not hesitate to contact me with any questions or opportunities you may have. My name is Kent Clouse a safety professional looking to expand my horizons in the field of Environmental Health and Safety. I look forward to be considered as part of a challenging and rewarding safety team.  \n \nOver the breadth of internships and my career, I’ve been able to work to meet safety goals, empower employee safety and maintain company compliance. I have had the opportunity during my years as a safety professional to lead various teams, build creative problem solving skills and generate excitement in those around me about safety. As you will note in the accomplishments under the experience section, my expertise covers various aspects of safety management that may be beneficial to your company. Please do not hesitate to contact me with any questions or opportunities you may have. Experience Safety Engineer Intel Corporation March 2010  – Present (5 years 6 months) Operating extensive auditing for construction, facility contractors, lab safety and office safety. Support various safety programs from electrical to chemical and ensure compliance through self assessments of these programs.  \nAssist management of the business group to come up with controls or evaluate hazards to determine what is best to supply a safe work environment. Engineering activities including designing or solving safety problems analyzing incidents and evaluating root cause and future prevention.  \nPresenting in safety leaders team, lab managers council being an active role to talk about safety expectations, compliance, lessons learned, proactive communication through self assessments and cross site auditing. Communicating to lab managers and Intel management safe work practices and Intel safety compliance to keep all employees safe. Safety Intern John Deere May 2009  –  August 2009  (4 months) Safety and health program evaluation by enhancing various subjects of safety and implementing them site wide. Programs included confined space, overhead crane, hoist, sling and hook program, powered industrial truck program, lock out tag out procedure program and machine guarding.  \nImplemented the training site wide. Fork truck drivers got an updated refresher course along with new pre-shift inspection sheets that were more organized and less tedious.  \nHazard Evaluation by assisting with safety audits, incident investigations and made EHS map and comprehensive list of permit required confined spaces to help identify the amount and location of each. Assisted with SERA (Safety and Ergonomic Risk Assessment) which is a program geared towards identifying ergonomic risks of operators. Safety Intern John Deere May 2008  –  August 2008  (4 months) Safety Training and Education on various safety subjects including Lock out tag out affected employee training, overhead crane and hoist inspection training, near miss safety system training, JSA and JHA training for each job functions. Created and Implement a behavioral based safety program and training site wide.  \nProgram enhancement included PPE written program, JSA written program and identification for each job function. Created a behavioral based safety program and written program document. Implemented an office ergonomic check sheet to determine if our office employees were at ergonomic risk to assist with putting controls in place to mitigate these hazards. \nInvestigation and statistical reporting through continual audits and assisting with safety investigations. Oversaw the corrective action review board which was a field based team of plant management to review corrective safety actions. Safety Engineer Intel Corporation March 2010  – Present (5 years 6 months) Operating extensive auditing for construction, facility contractors, lab safety and office safety. Support various safety programs from electrical to chemical and ensure compliance through self assessments of these programs.  \nAssist management of the business group to come up with controls or evaluate hazards to determine what is best to supply a safe work environment. Engineering activities including designing or solving safety problems analyzing incidents and evaluating root cause and future prevention.  \nPresenting in safety leaders team, lab managers council being an active role to talk about safety expectations, compliance, lessons learned, proactive communication through self assessments and cross site auditing. Communicating to lab managers and Intel management safe work practices and Intel safety compliance to keep all employees safe. Safety Engineer Intel Corporation March 2010  – Present (5 years 6 months) Operating extensive auditing for construction, facility contractors, lab safety and office safety. Support various safety programs from electrical to chemical and ensure compliance through self assessments of these programs.  \nAssist management of the business group to come up with controls or evaluate hazards to determine what is best to supply a safe work environment. Engineering activities including designing or solving safety problems analyzing incidents and evaluating root cause and future prevention.  \nPresenting in safety leaders team, lab managers council being an active role to talk about safety expectations, compliance, lessons learned, proactive communication through self assessments and cross site auditing. Communicating to lab managers and Intel management safe work practices and Intel safety compliance to keep all employees safe. Safety Intern John Deere May 2009  –  August 2009  (4 months) Safety and health program evaluation by enhancing various subjects of safety and implementing them site wide. Programs included confined space, overhead crane, hoist, sling and hook program, powered industrial truck program, lock out tag out procedure program and machine guarding.  \nImplemented the training site wide. Fork truck drivers got an updated refresher course along with new pre-shift inspection sheets that were more organized and less tedious.  \nHazard Evaluation by assisting with safety audits, incident investigations and made EHS map and comprehensive list of permit required confined spaces to help identify the amount and location of each. Assisted with SERA (Safety and Ergonomic Risk Assessment) which is a program geared towards identifying ergonomic risks of operators. Safety Intern John Deere May 2009  –  August 2009  (4 months) Safety and health program evaluation by enhancing various subjects of safety and implementing them site wide. Programs included confined space, overhead crane, hoist, sling and hook program, powered industrial truck program, lock out tag out procedure program and machine guarding.  \nImplemented the training site wide. Fork truck drivers got an updated refresher course along with new pre-shift inspection sheets that were more organized and less tedious.  \nHazard Evaluation by assisting with safety audits, incident investigations and made EHS map and comprehensive list of permit required confined spaces to help identify the amount and location of each. Assisted with SERA (Safety and Ergonomic Risk Assessment) which is a program geared towards identifying ergonomic risks of operators. Safety Intern John Deere May 2008  –  August 2008  (4 months) Safety Training and Education on various safety subjects including Lock out tag out affected employee training, overhead crane and hoist inspection training, near miss safety system training, JSA and JHA training for each job functions. Created and Implement a behavioral based safety program and training site wide.  \nProgram enhancement included PPE written program, JSA written program and identification for each job function. Created a behavioral based safety program and written program document. Implemented an office ergonomic check sheet to determine if our office employees were at ergonomic risk to assist with putting controls in place to mitigate these hazards. \nInvestigation and statistical reporting through continual audits and assisting with safety investigations. Oversaw the corrective action review board which was a field based team of plant management to review corrective safety actions. Safety Intern John Deere May 2008  –  August 2008  (4 months) Safety Training and Education on various safety subjects including Lock out tag out affected employee training, overhead crane and hoist inspection training, near miss safety system training, JSA and JHA training for each job functions. Created and Implement a behavioral based safety program and training site wide.  \nProgram enhancement included PPE written program, JSA written program and identification for each job function. Created a behavioral based safety program and written program document. Implemented an office ergonomic check sheet to determine if our office employees were at ergonomic risk to assist with putting controls in place to mitigate these hazards. \nInvestigation and statistical reporting through continual audits and assisting with safety investigations. Oversaw the corrective action review board which was a field based team of plant management to review corrective safety actions. Skills California OSHA Federal OSHA Safety Training Safety Programs Engineering Manufacturing Laboratory Safety Root Cause Analysis Electrical Safety LOTO Skills  California OSHA Federal OSHA Safety Training Safety Programs Engineering Manufacturing Laboratory Safety Root Cause Analysis Electrical Safety LOTO California OSHA Federal OSHA Safety Training Safety Programs Engineering Manufacturing Laboratory Safety Root Cause Analysis Electrical Safety LOTO California OSHA Federal OSHA Safety Training Safety Programs Engineering Manufacturing Laboratory Safety Root Cause Analysis Electrical Safety LOTO Education Murray State University Master of Science (M.S.),  Occupational Safety and Health 2007  – 2009 Murray State University Bachelor of Science (B.S.),  Agricultural Systems and Technology 2004  – 2007 Murray State University Master of Science (M.S.),  Occupational Safety and Health 2007  – 2009 Murray State University Master of Science (M.S.),  Occupational Safety and Health 2007  – 2009 Murray State University Master of Science (M.S.),  Occupational Safety and Health 2007  – 2009 Murray State University Bachelor of Science (B.S.),  Agricultural Systems and Technology 2004  – 2007 Murray State University Bachelor of Science (B.S.),  Agricultural Systems and Technology 2004  – 2007 Murray State University Bachelor of Science (B.S.),  Agricultural Systems and Technology 2004  – 2007 ", "Experience Safety Engineer Intel Corporation Safety Engineer Intel Corporation Safety Engineer Intel Corporation ", "Experience Production Engineer Intel Corporation October 1996  – Present (18 years 11 months) Safety Engineer Intel Corporation October 1996  –  March 2002  (5 years 6 months) Intel NM Production Engineer Intel Corporation October 1996  – Present (18 years 11 months) Production Engineer Intel Corporation October 1996  – Present (18 years 11 months) Safety Engineer Intel Corporation October 1996  –  March 2002  (5 years 6 months) Intel NM Safety Engineer Intel Corporation October 1996  –  March 2002  (5 years 6 months) Intel NM Education University of Minnesota-Duluth Masters,  Masters of Industrial Safety 1990  – 1996 University of Minnesota-Duluth Masters,  Masters of Industrial Safety 1990  – 1996 University of Minnesota-Duluth Masters,  Masters of Industrial Safety 1990  – 1996 University of Minnesota-Duluth Masters,  Masters of Industrial Safety 1990  – 1996 ", "Experience Safety Engineer Intel Corporation Safety Engineer Intel Corporation Safety Engineer Intel Corporation Education University of Hawaii at Manoa Soil Science 1980  – 1982 Southern Illinois University, Carbondale BS & MS,  Soil Science University of Hawaii at Manoa Soil Science 1980  – 1982 University of Hawaii at Manoa Soil Science 1980  – 1982 University of Hawaii at Manoa Soil Science 1980  – 1982 Southern Illinois University, Carbondale BS & MS,  Soil Science Southern Illinois University, Carbondale BS & MS,  Soil Science Southern Illinois University, Carbondale BS & MS,  Soil Science "]}