{"position": "Sales Manager", "company": "Intel Corporation", "profiles": ["Skills Business Development Account Management Strategic Alliances Channel Sales Telephony Mobile Devices Strategy Channel Enterprise Software Strategic Partnerships Wireless IP Major Account... Contract Negotiation Cloud Applications Messaging Mobile Roaming Go-to-market Strategy New Business Development Leadership Cloud Computing Telecommunications Business Alliances Professional Services Mobile Technology Product Management Sales Start-ups VoIP Product Marketing Management SaaS Solutions Marketing Managed Services WiFi Mobile Communications Mobile Applications Pre-sales LTE VAS Wireless Networking Cellular Communications Channel Partners CDMA Direct Sales Solution Selling Integration Location Based Services SIP GSM See 35+     See less Skills  Business Development Account Management Strategic Alliances Channel Sales Telephony Mobile Devices Strategy Channel Enterprise Software Strategic Partnerships Wireless IP Major Account... Contract Negotiation Cloud Applications Messaging Mobile Roaming Go-to-market Strategy New Business Development Leadership Cloud Computing Telecommunications Business Alliances Professional Services Mobile Technology Product Management Sales Start-ups VoIP Product Marketing Management SaaS Solutions Marketing Managed Services WiFi Mobile Communications Mobile Applications Pre-sales LTE VAS Wireless Networking Cellular Communications Channel Partners CDMA Direct Sales Solution Selling Integration Location Based Services SIP GSM See 35+     See less Business Development Account Management Strategic Alliances Channel Sales Telephony Mobile Devices Strategy Channel Enterprise Software Strategic Partnerships Wireless IP Major Account... Contract Negotiation Cloud Applications Messaging Mobile Roaming Go-to-market Strategy New Business Development Leadership Cloud Computing Telecommunications Business Alliances Professional Services Mobile Technology Product Management Sales Start-ups VoIP Product Marketing Management SaaS Solutions Marketing Managed Services WiFi Mobile Communications Mobile Applications Pre-sales LTE VAS Wireless Networking Cellular Communications Channel Partners CDMA Direct Sales Solution Selling Integration Location Based Services SIP GSM See 35+     See less Business Development Account Management Strategic Alliances Channel Sales Telephony Mobile Devices Strategy Channel Enterprise Software Strategic Partnerships Wireless IP Major Account... Contract Negotiation Cloud Applications Messaging Mobile Roaming Go-to-market Strategy New Business Development Leadership Cloud Computing Telecommunications Business Alliances Professional Services Mobile Technology Product Management Sales Start-ups VoIP Product Marketing Management SaaS Solutions Marketing Managed Services WiFi Mobile Communications Mobile Applications Pre-sales LTE VAS Wireless Networking Cellular Communications Channel Partners CDMA Direct Sales Solution Selling Integration Location Based Services SIP GSM See 35+     See less ", "Languages English Thai English Thai English Thai Skills Semiconductors Product Marketing Systems Management Networking Sales Management Sales Operations Marketing Strategy Channel Strategy Business Strategy Program Management Go-to-market Strategy Channel Partners Project Management Telecommunications Product Management Strategic Partnerships Cross-functional Team... Management Competitive Analysis See 4+     See less Skills  Semiconductors Product Marketing Systems Management Networking Sales Management Sales Operations Marketing Strategy Channel Strategy Business Strategy Program Management Go-to-market Strategy Channel Partners Project Management Telecommunications Product Management Strategic Partnerships Cross-functional Team... Management Competitive Analysis See 4+     See less Semiconductors Product Marketing Systems Management Networking Sales Management Sales Operations Marketing Strategy Channel Strategy Business Strategy Program Management Go-to-market Strategy Channel Partners Project Management Telecommunications Product Management Strategic Partnerships Cross-functional Team... Management Competitive Analysis See 4+     See less Semiconductors Product Marketing Systems Management Networking Sales Management Sales Operations Marketing Strategy Channel Strategy Business Strategy Program Management Go-to-market Strategy Channel Partners Project Management Telecommunications Product Management Strategic Partnerships Cross-functional Team... Management Competitive Analysis See 4+     See less ", "Summary •\tA proven track record of working in Consumer IT channel with broad experience in Consumer Retail Channel Sales & Marketing. \n \n•\tExtensive knowledge in ME Consumer Market in General and specifically in Saudi.  \n \n•\tHigh-Energy, Self -Driven individual with unquestioned integrity and Commitment to success with an Entrepreneurial approach to business challenges & success at growing business quickly and profitably. \n \n•\tCustomer focused Professional with Extensive experience in key client development and retention. Skilled in Building and Growing solid customer relationships. \n \n•\tGrew Middle East overall regional IT Retail Market share by +40% in 3 years, whilst achieving all profit targets by increasing premium product mix by +20%. \n \n•\tA focus on Consumer IT Retail partnerships and a detailed expertise of the retail channel in both Middle East, and Saudi in particular has resulted in securing a number of strategic alliances with key local and local retailers. Such agreements are rare and afford a key competitive advantage. Summary •\tA proven track record of working in Consumer IT channel with broad experience in Consumer Retail Channel Sales & Marketing. \n \n•\tExtensive knowledge in ME Consumer Market in General and specifically in Saudi.  \n \n•\tHigh-Energy, Self -Driven individual with unquestioned integrity and Commitment to success with an Entrepreneurial approach to business challenges & success at growing business quickly and profitably. \n \n•\tCustomer focused Professional with Extensive experience in key client development and retention. Skilled in Building and Growing solid customer relationships. \n \n•\tGrew Middle East overall regional IT Retail Market share by +40% in 3 years, whilst achieving all profit targets by increasing premium product mix by +20%. \n \n•\tA focus on Consumer IT Retail partnerships and a detailed expertise of the retail channel in both Middle East, and Saudi in particular has resulted in securing a number of strategic alliances with key local and local retailers. Such agreements are rare and afford a key competitive advantage. •\tA proven track record of working in Consumer IT channel with broad experience in Consumer Retail Channel Sales & Marketing. \n \n•\tExtensive knowledge in ME Consumer Market in General and specifically in Saudi.  \n \n•\tHigh-Energy, Self -Driven individual with unquestioned integrity and Commitment to success with an Entrepreneurial approach to business challenges & success at growing business quickly and profitably. \n \n•\tCustomer focused Professional with Extensive experience in key client development and retention. Skilled in Building and Growing solid customer relationships. \n \n•\tGrew Middle East overall regional IT Retail Market share by +40% in 3 years, whilst achieving all profit targets by increasing premium product mix by +20%. \n \n•\tA focus on Consumer IT Retail partnerships and a detailed expertise of the retail channel in both Middle East, and Saudi in particular has resulted in securing a number of strategic alliances with key local and local retailers. Such agreements are rare and afford a key competitive advantage. •\tA proven track record of working in Consumer IT channel with broad experience in Consumer Retail Channel Sales & Marketing. \n \n•\tExtensive knowledge in ME Consumer Market in General and specifically in Saudi.  \n \n•\tHigh-Energy, Self -Driven individual with unquestioned integrity and Commitment to success with an Entrepreneurial approach to business challenges & success at growing business quickly and profitably. \n \n•\tCustomer focused Professional with Extensive experience in key client development and retention. Skilled in Building and Growing solid customer relationships. \n \n•\tGrew Middle East overall regional IT Retail Market share by +40% in 3 years, whilst achieving all profit targets by increasing premium product mix by +20%. \n \n•\tA focus on Consumer IT Retail partnerships and a detailed expertise of the retail channel in both Middle East, and Saudi in particular has resulted in securing a number of strategic alliances with key local and local retailers. Such agreements are rare and afford a key competitive advantage. Experience Consumer Sales Manager Intel Corporation July 2013  – Present (2 years 2 months) Saudi Arabia 1.\tStrategic Alignment & Growing Intel Brand Relevance by running successful Integrated Demand Generation Campaign in the country with effective utilization of sales tools and programs focusing on latest products resulted in high ROI such as (ex: achieving 128% of new product transition country Target. \n \n2.\tDrive Business Programs & New initiatives which resulted in strong ROI to the Consumer Market such as opening new channels to our partners and increase brand relevance (Intel Tablet based growth). Retail Sales Manager Intel Corporation January 2009  –  June 2013  (4 years 6 months) Saudi Arabia •\tSustained healthy growth (+30% YoY) for 3 years in a raw with Top Saudi Retailers. \n \n•\tDeveloped Country Consumer strategic long range plans (5 years), include needs assessments, SWOT analysis, vision, mission, goals, objectives and strategies. \n \n•\tRamping the New Product transition in Retail by running effective in-store & out-store activities which resulted to Achieve 35% of new product mix, having a Healthy line-up (60% on New product) and increased Sales out by 30%. \n \n•\tManaged to run different joint activity campaigns with key partners (Multi National Vendors and Retailers which helped in strengthening the relationship with the retailers and OEM’s and have very strong effect in Sales out. Middel East Retail Marketing Manager Intel Corporation January 2006  –  December 2008  (3 years) GCC Established a Healthy Retail Market by identifying the right players and strengthening the relationship across all levels with key Retailers which contributed 85% of the total Retail Business in GCC. Channel Manager Intel Corporation November 2001  –  December 2005  (4 years 2 months) Saudi Arabia-Westren Territory Build a strong Channel Infrastructure in the Western Region of Saudi Arabia by Identifying and Recruiting the right players and strengthening the relationship across all levels of Computer channel customers which contributed 80% of the total Channel Business in Saudi by 2004 Senior Account Manager Getronics UK October 2000  –  October 2001  (1 year 1 month) Saudi Arabia Maintaining and Developing corporate accounts which take advantage of Getronics varied services, which include LAN/WAN integration, Hardware Sales (Desktops, Peripherals, Servers, Hub/Switches, and Routers), and Services (Consulting, Training, and Troubleshooting). IT System Support Manager GlaxoSmithKline September 1998  –  September 2000  (2 years 1 month) Saudi Arabia-Jeddah Owning “Glaxo Paperless Environment” project that covered planning, deploying and training. I have managed to successfully deploy MS Exchange/Outlook in Glaxo multi sites for more than 180 users followed by a customized extensive training to GlaxoWellcome Saudi employees.  \n \nInitiating a “Glaxo Saudi Training Center” where training covered IT and Business subjects for Glaxo different business units. Consumer Sales Manager Intel Corporation July 2013  – Present (2 years 2 months) Saudi Arabia 1.\tStrategic Alignment & Growing Intel Brand Relevance by running successful Integrated Demand Generation Campaign in the country with effective utilization of sales tools and programs focusing on latest products resulted in high ROI such as (ex: achieving 128% of new product transition country Target. \n \n2.\tDrive Business Programs & New initiatives which resulted in strong ROI to the Consumer Market such as opening new channels to our partners and increase brand relevance (Intel Tablet based growth). Consumer Sales Manager Intel Corporation July 2013  – Present (2 years 2 months) Saudi Arabia 1.\tStrategic Alignment & Growing Intel Brand Relevance by running successful Integrated Demand Generation Campaign in the country with effective utilization of sales tools and programs focusing on latest products resulted in high ROI such as (ex: achieving 128% of new product transition country Target. \n \n2.\tDrive Business Programs & New initiatives which resulted in strong ROI to the Consumer Market such as opening new channels to our partners and increase brand relevance (Intel Tablet based growth). Retail Sales Manager Intel Corporation January 2009  –  June 2013  (4 years 6 months) Saudi Arabia •\tSustained healthy growth (+30% YoY) for 3 years in a raw with Top Saudi Retailers. \n \n•\tDeveloped Country Consumer strategic long range plans (5 years), include needs assessments, SWOT analysis, vision, mission, goals, objectives and strategies. \n \n•\tRamping the New Product transition in Retail by running effective in-store & out-store activities which resulted to Achieve 35% of new product mix, having a Healthy line-up (60% on New product) and increased Sales out by 30%. \n \n•\tManaged to run different joint activity campaigns with key partners (Multi National Vendors and Retailers which helped in strengthening the relationship with the retailers and OEM’s and have very strong effect in Sales out. Retail Sales Manager Intel Corporation January 2009  –  June 2013  (4 years 6 months) Saudi Arabia •\tSustained healthy growth (+30% YoY) for 3 years in a raw with Top Saudi Retailers. \n \n•\tDeveloped Country Consumer strategic long range plans (5 years), include needs assessments, SWOT analysis, vision, mission, goals, objectives and strategies. \n \n•\tRamping the New Product transition in Retail by running effective in-store & out-store activities which resulted to Achieve 35% of new product mix, having a Healthy line-up (60% on New product) and increased Sales out by 30%. \n \n•\tManaged to run different joint activity campaigns with key partners (Multi National Vendors and Retailers which helped in strengthening the relationship with the retailers and OEM’s and have very strong effect in Sales out. Middel East Retail Marketing Manager Intel Corporation January 2006  –  December 2008  (3 years) GCC Established a Healthy Retail Market by identifying the right players and strengthening the relationship across all levels with key Retailers which contributed 85% of the total Retail Business in GCC. Middel East Retail Marketing Manager Intel Corporation January 2006  –  December 2008  (3 years) GCC Established a Healthy Retail Market by identifying the right players and strengthening the relationship across all levels with key Retailers which contributed 85% of the total Retail Business in GCC. Channel Manager Intel Corporation November 2001  –  December 2005  (4 years 2 months) Saudi Arabia-Westren Territory Build a strong Channel Infrastructure in the Western Region of Saudi Arabia by Identifying and Recruiting the right players and strengthening the relationship across all levels of Computer channel customers which contributed 80% of the total Channel Business in Saudi by 2004 Channel Manager Intel Corporation November 2001  –  December 2005  (4 years 2 months) Saudi Arabia-Westren Territory Build a strong Channel Infrastructure in the Western Region of Saudi Arabia by Identifying and Recruiting the right players and strengthening the relationship across all levels of Computer channel customers which contributed 80% of the total Channel Business in Saudi by 2004 Senior Account Manager Getronics UK October 2000  –  October 2001  (1 year 1 month) Saudi Arabia Maintaining and Developing corporate accounts which take advantage of Getronics varied services, which include LAN/WAN integration, Hardware Sales (Desktops, Peripherals, Servers, Hub/Switches, and Routers), and Services (Consulting, Training, and Troubleshooting). Senior Account Manager Getronics UK October 2000  –  October 2001  (1 year 1 month) Saudi Arabia Maintaining and Developing corporate accounts which take advantage of Getronics varied services, which include LAN/WAN integration, Hardware Sales (Desktops, Peripherals, Servers, Hub/Switches, and Routers), and Services (Consulting, Training, and Troubleshooting). IT System Support Manager GlaxoSmithKline September 1998  –  September 2000  (2 years 1 month) Saudi Arabia-Jeddah Owning “Glaxo Paperless Environment” project that covered planning, deploying and training. I have managed to successfully deploy MS Exchange/Outlook in Glaxo multi sites for more than 180 users followed by a customized extensive training to GlaxoWellcome Saudi employees.  \n \nInitiating a “Glaxo Saudi Training Center” where training covered IT and Business subjects for Glaxo different business units. IT System Support Manager GlaxoSmithKline September 1998  –  September 2000  (2 years 1 month) Saudi Arabia-Jeddah Owning “Glaxo Paperless Environment” project that covered planning, deploying and training. I have managed to successfully deploy MS Exchange/Outlook in Glaxo multi sites for more than 180 users followed by a customized extensive training to GlaxoWellcome Saudi employees.  \n \nInitiating a “Glaxo Saudi Training Center” where training covered IT and Business subjects for Glaxo different business units. Languages English English English Skills Product Marketing CRM Sales Management Channel Partners Strategy Product Management Long-term Customer... Strategic Partnerships Mobile Devices Team Management Business Development Key Account Management Team Leadership Management Pre-sales Go-to-market Strategy Business Strategy Solution Selling Sales Operations Competitive Analysis Customer Retention Cross-functional Team... Consumer Sales and... Channel Management Broad understanding of... Ability to drive things... Knowledge about key... See 12+     See less Skills  Product Marketing CRM Sales Management Channel Partners Strategy Product Management Long-term Customer... Strategic Partnerships Mobile Devices Team Management Business Development Key Account Management Team Leadership Management Pre-sales Go-to-market Strategy Business Strategy Solution Selling Sales Operations Competitive Analysis Customer Retention Cross-functional Team... Consumer Sales and... Channel Management Broad understanding of... Ability to drive things... Knowledge about key... See 12+     See less Product Marketing CRM Sales Management Channel Partners Strategy Product Management Long-term Customer... Strategic Partnerships Mobile Devices Team Management Business Development Key Account Management Team Leadership Management Pre-sales Go-to-market Strategy Business Strategy Solution Selling Sales Operations Competitive Analysis Customer Retention Cross-functional Team... Consumer Sales and... Channel Management Broad understanding of... Ability to drive things... Knowledge about key... See 12+     See less Product Marketing CRM Sales Management Channel Partners Strategy Product Management Long-term Customer... Strategic Partnerships Mobile Devices Team Management Business Development Key Account Management Team Leadership Management Pre-sales Go-to-market Strategy Business Strategy Solution Selling Sales Operations Competitive Analysis Customer Retention Cross-functional Team... Consumer Sales and... Channel Management Broad understanding of... Ability to drive things... Knowledge about key... See 12+     See less Education King Saud University Bachelor of Computer Engineering,  Computer Engineer 1991  – 1995 King Saud University Bachelor of Computer Engineering,  Computer Engineer 1991  – 1995 King Saud University Bachelor of Computer Engineering,  Computer Engineer 1991  – 1995 King Saud University Bachelor of Computer Engineering,  Computer Engineer 1991  – 1995 ", "Skills Cloud Computing Data Center Analytics Cross-functional Team... Intel Leadership Go-to-market Strategy Enterprise Software Management Program Management Product Management Project Management Enterprise Architecture Storage Software Development Semiconductors Technical Marketing Team Building Virtualization Web Services See 5+     See less Skills  Cloud Computing Data Center Analytics Cross-functional Team... Intel Leadership Go-to-market Strategy Enterprise Software Management Program Management Product Management Project Management Enterprise Architecture Storage Software Development Semiconductors Technical Marketing Team Building Virtualization Web Services See 5+     See less Cloud Computing Data Center Analytics Cross-functional Team... Intel Leadership Go-to-market Strategy Enterprise Software Management Program Management Product Management Project Management Enterprise Architecture Storage Software Development Semiconductors Technical Marketing Team Building Virtualization Web Services See 5+     See less Cloud Computing Data Center Analytics Cross-functional Team... Intel Leadership Go-to-market Strategy Enterprise Software Management Program Management Product Management Project Management Enterprise Architecture Storage Software Development Semiconductors Technical Marketing Team Building Virtualization Web Services See 5+     See less ", "Languages Telugu Telugu Telugu Skills Semiconductors ASIC Verilog VLSI Embedded Systems EDA Microprocessors IC Debugging SystemVerilog RTL design Cross-functional Team... Logic Design Skills  Semiconductors ASIC Verilog VLSI Embedded Systems EDA Microprocessors IC Debugging SystemVerilog RTL design Cross-functional Team... Logic Design Semiconductors ASIC Verilog VLSI Embedded Systems EDA Microprocessors IC Debugging SystemVerilog RTL design Cross-functional Team... Logic Design Semiconductors ASIC Verilog VLSI Embedded Systems EDA Microprocessors IC Debugging SystemVerilog RTL design Cross-functional Team... Logic Design ", "Skills Product Management Product Marketing Competitive Analysis Key Account Management Marketing Management Channel Channel Partners Business Strategy Sales Management New Business Development Marketing Strategy Consumer Electronics Cloud Computing Marketing Solution Selling Business Development Pricing Market Analysis Account Management Team Management Forecasting Multi-channel Marketing B2B Sales Process Management Market Research Market Planning Sales Segmentation Business Intelligence Pricing Strategy B2B Marketing Cross-functional Team... Go-to-market Strategy International Sales Mobile Devices Partner Management Product Launch Sales Operations Start-ups Strategic Partnerships Strategy Telecommunications See 28+     See less Skills  Product Management Product Marketing Competitive Analysis Key Account Management Marketing Management Channel Channel Partners Business Strategy Sales Management New Business Development Marketing Strategy Consumer Electronics Cloud Computing Marketing Solution Selling Business Development Pricing Market Analysis Account Management Team Management Forecasting Multi-channel Marketing B2B Sales Process Management Market Research Market Planning Sales Segmentation Business Intelligence Pricing Strategy B2B Marketing Cross-functional Team... Go-to-market Strategy International Sales Mobile Devices Partner Management Product Launch Sales Operations Start-ups Strategic Partnerships Strategy Telecommunications See 28+     See less Product Management Product Marketing Competitive Analysis Key Account Management Marketing Management Channel Channel Partners Business Strategy Sales Management New Business Development Marketing Strategy Consumer Electronics Cloud Computing Marketing Solution Selling Business Development Pricing Market Analysis Account Management Team Management Forecasting Multi-channel Marketing B2B Sales Process Management Market Research Market Planning Sales Segmentation Business Intelligence Pricing Strategy B2B Marketing Cross-functional Team... Go-to-market Strategy International Sales Mobile Devices Partner Management Product Launch Sales Operations Start-ups Strategic Partnerships Strategy Telecommunications See 28+     See less Product Management Product Marketing Competitive Analysis Key Account Management Marketing Management Channel Channel Partners Business Strategy Sales Management New Business Development Marketing Strategy Consumer Electronics Cloud Computing Marketing Solution Selling Business Development Pricing Market Analysis Account Management Team Management Forecasting Multi-channel Marketing B2B Sales Process Management Market Research Market Planning Sales Segmentation Business Intelligence Pricing Strategy B2B Marketing Cross-functional Team... Go-to-market Strategy International Sales Mobile Devices Partner Management Product Launch Sales Operations Start-ups Strategic Partnerships Strategy Telecommunications See 28+     See less ", "Summary Jimmy Ping is an accomplished senior executive with more than 15 years of success in sales, marketing, and business and partner development for information technology products in the Greater China Region.  \n \nMy background includes developing retail, distribution, government and vertical VAR channels in both urban and rural China, extensive OEM and distribution management experience with the leading IT distributors and computer OEMs such as Digital China, Synnex, Haier, and Tsinghua TongFang.  \n \nFluent in both Mandarin and English, he has years of experience working with international companies.  \n \nHe received his Executive MBA in 2007 from CKGSB, the best Executive MBA program in China, and his BS in computer science in 1994 from Shenyang Aero Industrial University. \n \nSpecialties: China business development, sales management, channel sales and marketing, government liaison, Mandarin and English fluency Summary Jimmy Ping is an accomplished senior executive with more than 15 years of success in sales, marketing, and business and partner development for information technology products in the Greater China Region.  \n \nMy background includes developing retail, distribution, government and vertical VAR channels in both urban and rural China, extensive OEM and distribution management experience with the leading IT distributors and computer OEMs such as Digital China, Synnex, Haier, and Tsinghua TongFang.  \n \nFluent in both Mandarin and English, he has years of experience working with international companies.  \n \nHe received his Executive MBA in 2007 from CKGSB, the best Executive MBA program in China, and his BS in computer science in 1994 from Shenyang Aero Industrial University. \n \nSpecialties: China business development, sales management, channel sales and marketing, government liaison, Mandarin and English fluency Jimmy Ping is an accomplished senior executive with more than 15 years of success in sales, marketing, and business and partner development for information technology products in the Greater China Region.  \n \nMy background includes developing retail, distribution, government and vertical VAR channels in both urban and rural China, extensive OEM and distribution management experience with the leading IT distributors and computer OEMs such as Digital China, Synnex, Haier, and Tsinghua TongFang.  \n \nFluent in both Mandarin and English, he has years of experience working with international companies.  \n \nHe received his Executive MBA in 2007 from CKGSB, the best Executive MBA program in China, and his BS in computer science in 1994 from Shenyang Aero Industrial University. \n \nSpecialties: China business development, sales management, channel sales and marketing, government liaison, Mandarin and English fluency Jimmy Ping is an accomplished senior executive with more than 15 years of success in sales, marketing, and business and partner development for information technology products in the Greater China Region.  \n \nMy background includes developing retail, distribution, government and vertical VAR channels in both urban and rural China, extensive OEM and distribution management experience with the leading IT distributors and computer OEMs such as Digital China, Synnex, Haier, and Tsinghua TongFang.  \n \nFluent in both Mandarin and English, he has years of experience working with international companies.  \n \nHe received his Executive MBA in 2007 from CKGSB, the best Executive MBA program in China, and his BS in computer science in 1994 from Shenyang Aero Industrial University. \n \nSpecialties: China business development, sales management, channel sales and marketing, government liaison, Mandarin and English fluency Experience VP of Business Development NetBridge Global, Inc. July 2011  – Present (4 years 2 months) Beijing, China Responsible for business and partner development including \n \n* Identification and evaluation of potential partners, including channel, distribution, OEM, retail, franchisees, contract manufacturing, software developers and more.  \n \n* Hosting visits to China for NBG clients to meet national/provincial buyers, decision-makers, and government officials  \n \n* Introduction of clients to potential partners, agents, or representative, including negotiation strategies and support. Country Manager NComputing October 2009  – Present (5 years 11 months) Beijing, China Reported to VP of China Sales and Marketing. Started up NComputing business in China including developing the business strategy and go-to-market plan with HQ. Grew to US$500M and break within six months.  \n \nEngaged local government, education, entererprise and SMB customers to evangelize and deploy NComputing solution recruiting 50+ SMB and vertically focused VAR channels.  \n.  \nBuilt strong central and local government relationships, including an MOU with Central MOE to deploy NComputing in K-12 school PC labs in 22 providences and 100+ cities. Also hosted a Jiangying city mayor meeting with CEO in Jiangyin and the US.  \n \nDeveloped marketing messages and materials to educate the market on virtual desktop solutions, creating \"Desktop As A Service\" and \"Desktop Cloud\" marketing campaign. Sales Director Intel Corporation June 2008  –  June 2009  (1 year 1 month) Beijing, China Lead the whole north china sales team, manage total 10 intel full time employees and 30+ vendor funding contractors in 7 remote offices \n \nDeveloped and executed Intel product GTM and promotion programs in 1000+ top reseller / retailer channels in 50 Tier 2 to Tier 4 cities.  \n \nRun market share win back program in Tier 4 cities base on GFK report, Hit 20% increase target Northern China Sales Manager Intel Corporation February 2006  –  June 2008  (2 years 5 months) Beijing, China Led the North China sales team, managing 10 full-time employees and 30+ vendor funding contractors in 7 remote offices. \n \nDeveloped and executed Intel product GTM and promotion programs in 1000+ top reseller / retailer channels in 50 Tier 2 to Tier 4 cities.  \n \nRan market share win back program in Tier 4 cities base on GFK report to hit 20% increase target. Channel OEM Sales Manager Intel Corporation January 2003  –  January 2006  (3 years 1 month) Beijing, China Managed Intel authorized distributors to achieve 100M$ / per Q channel sales revenue target across Desktop, Notebook and Server. \n \nDeveloped and incubated key accounts to increase direct business with Intel, including Haier/Dawning/Powerleader/Thunis/Hedy etc. Network Product Sales Manager Intel Corporation January 1999  –  January 2003  (4 years 1 month) Beijing, China Job scope \nWin the best education project in Chang chun MOE with intel netwok product \nRecruit neusoft as intel server/networking SI , hit 2M$ target \nDeveloped and managed Intel SI and VAR channels in NC region Network Product Sales Manager Digital China January 1997  –  January 1999  (2 years 1 month) Beijing, China Setup Digital china network sales team , achieve US$10M sales in 1999.  \n \nDeveloped and recruited Cisco, Intel, AT&T, D-link SI and VAR channels in Northeast region. VP of Business Development NetBridge Global, Inc. July 2011  – Present (4 years 2 months) Beijing, China Responsible for business and partner development including \n \n* Identification and evaluation of potential partners, including channel, distribution, OEM, retail, franchisees, contract manufacturing, software developers and more.  \n \n* Hosting visits to China for NBG clients to meet national/provincial buyers, decision-makers, and government officials  \n \n* Introduction of clients to potential partners, agents, or representative, including negotiation strategies and support. VP of Business Development NetBridge Global, Inc. July 2011  – Present (4 years 2 months) Beijing, China Responsible for business and partner development including \n \n* Identification and evaluation of potential partners, including channel, distribution, OEM, retail, franchisees, contract manufacturing, software developers and more.  \n \n* Hosting visits to China for NBG clients to meet national/provincial buyers, decision-makers, and government officials  \n \n* Introduction of clients to potential partners, agents, or representative, including negotiation strategies and support. Country Manager NComputing October 2009  – Present (5 years 11 months) Beijing, China Reported to VP of China Sales and Marketing. Started up NComputing business in China including developing the business strategy and go-to-market plan with HQ. Grew to US$500M and break within six months.  \n \nEngaged local government, education, entererprise and SMB customers to evangelize and deploy NComputing solution recruiting 50+ SMB and vertically focused VAR channels.  \n.  \nBuilt strong central and local government relationships, including an MOU with Central MOE to deploy NComputing in K-12 school PC labs in 22 providences and 100+ cities. Also hosted a Jiangying city mayor meeting with CEO in Jiangyin and the US.  \n \nDeveloped marketing messages and materials to educate the market on virtual desktop solutions, creating \"Desktop As A Service\" and \"Desktop Cloud\" marketing campaign. Country Manager NComputing October 2009  – Present (5 years 11 months) Beijing, China Reported to VP of China Sales and Marketing. Started up NComputing business in China including developing the business strategy and go-to-market plan with HQ. Grew to US$500M and break within six months.  \n \nEngaged local government, education, entererprise and SMB customers to evangelize and deploy NComputing solution recruiting 50+ SMB and vertically focused VAR channels.  \n.  \nBuilt strong central and local government relationships, including an MOU with Central MOE to deploy NComputing in K-12 school PC labs in 22 providences and 100+ cities. Also hosted a Jiangying city mayor meeting with CEO in Jiangyin and the US.  \n \nDeveloped marketing messages and materials to educate the market on virtual desktop solutions, creating \"Desktop As A Service\" and \"Desktop Cloud\" marketing campaign. Sales Director Intel Corporation June 2008  –  June 2009  (1 year 1 month) Beijing, China Lead the whole north china sales team, manage total 10 intel full time employees and 30+ vendor funding contractors in 7 remote offices \n \nDeveloped and executed Intel product GTM and promotion programs in 1000+ top reseller / retailer channels in 50 Tier 2 to Tier 4 cities.  \n \nRun market share win back program in Tier 4 cities base on GFK report, Hit 20% increase target Sales Director Intel Corporation June 2008  –  June 2009  (1 year 1 month) Beijing, China Lead the whole north china sales team, manage total 10 intel full time employees and 30+ vendor funding contractors in 7 remote offices \n \nDeveloped and executed Intel product GTM and promotion programs in 1000+ top reseller / retailer channels in 50 Tier 2 to Tier 4 cities.  \n \nRun market share win back program in Tier 4 cities base on GFK report, Hit 20% increase target Northern China Sales Manager Intel Corporation February 2006  –  June 2008  (2 years 5 months) Beijing, China Led the North China sales team, managing 10 full-time employees and 30+ vendor funding contractors in 7 remote offices. \n \nDeveloped and executed Intel product GTM and promotion programs in 1000+ top reseller / retailer channels in 50 Tier 2 to Tier 4 cities.  \n \nRan market share win back program in Tier 4 cities base on GFK report to hit 20% increase target. Northern China Sales Manager Intel Corporation February 2006  –  June 2008  (2 years 5 months) Beijing, China Led the North China sales team, managing 10 full-time employees and 30+ vendor funding contractors in 7 remote offices. \n \nDeveloped and executed Intel product GTM and promotion programs in 1000+ top reseller / retailer channels in 50 Tier 2 to Tier 4 cities.  \n \nRan market share win back program in Tier 4 cities base on GFK report to hit 20% increase target. Channel OEM Sales Manager Intel Corporation January 2003  –  January 2006  (3 years 1 month) Beijing, China Managed Intel authorized distributors to achieve 100M$ / per Q channel sales revenue target across Desktop, Notebook and Server. \n \nDeveloped and incubated key accounts to increase direct business with Intel, including Haier/Dawning/Powerleader/Thunis/Hedy etc. Channel OEM Sales Manager Intel Corporation January 2003  –  January 2006  (3 years 1 month) Beijing, China Managed Intel authorized distributors to achieve 100M$ / per Q channel sales revenue target across Desktop, Notebook and Server. \n \nDeveloped and incubated key accounts to increase direct business with Intel, including Haier/Dawning/Powerleader/Thunis/Hedy etc. Network Product Sales Manager Intel Corporation January 1999  –  January 2003  (4 years 1 month) Beijing, China Job scope \nWin the best education project in Chang chun MOE with intel netwok product \nRecruit neusoft as intel server/networking SI , hit 2M$ target \nDeveloped and managed Intel SI and VAR channels in NC region Network Product Sales Manager Intel Corporation January 1999  –  January 2003  (4 years 1 month) Beijing, China Job scope \nWin the best education project in Chang chun MOE with intel netwok product \nRecruit neusoft as intel server/networking SI , hit 2M$ target \nDeveloped and managed Intel SI and VAR channels in NC region Network Product Sales Manager Digital China January 1997  –  January 1999  (2 years 1 month) Beijing, China Setup Digital china network sales team , achieve US$10M sales in 1999.  \n \nDeveloped and recruited Cisco, Intel, AT&T, D-link SI and VAR channels in Northeast region. Network Product Sales Manager Digital China January 1997  –  January 1999  (2 years 1 month) Beijing, China Setup Digital china network sales team , achieve US$10M sales in 1999.  \n \nDeveloped and recruited Cisco, Intel, AT&T, D-link SI and VAR channels in Northeast region. Skills Sales Management Channel Management China Business... Skills  Sales Management Channel Management China Business... Sales Management Channel Management China Business... Sales Management Channel Management China Business... Education Cheung Kong Graduate School of Business Executive MBA,  Technology 2005  – 2007 Shennyang Aero Industrial University BS Computer Science,  Computer Science 1990  – 1994 Cheung Kong Graduate School of Business Executive MBA,  Technology 2005  – 2007 Cheung Kong Graduate School of Business Executive MBA,  Technology 2005  – 2007 Cheung Kong Graduate School of Business Executive MBA,  Technology 2005  – 2007 Shennyang Aero Industrial University BS Computer Science,  Computer Science 1990  – 1994 Shennyang Aero Industrial University BS Computer Science,  Computer Science 1990  – 1994 Shennyang Aero Industrial University BS Computer Science,  Computer Science 1990  – 1994 ", "Skills Storage Embedded Systems Intel Consumer Electronics Channel Semiconductors Contract Negotiation Vendor OEM Account Management New Business Development Sales Management Team Leadership Key Account Management Negotiation Customer Relations B2B IPTV Cross-functional Team... Business Alliances Business Development Partner Management Pricing SoC Mobile Devices Customer Service Management Go-to-market Strategy Supply Chain Semiconductor Industry SaaS Channel Partners Cloud Computing International Sales Strategic Partnerships Oracle Enterprise... Digital TV Strategy Solution Selling See 24+     See less Skills  Storage Embedded Systems Intel Consumer Electronics Channel Semiconductors Contract Negotiation Vendor OEM Account Management New Business Development Sales Management Team Leadership Key Account Management Negotiation Customer Relations B2B IPTV Cross-functional Team... Business Alliances Business Development Partner Management Pricing SoC Mobile Devices Customer Service Management Go-to-market Strategy Supply Chain Semiconductor Industry SaaS Channel Partners Cloud Computing International Sales Strategic Partnerships Oracle Enterprise... Digital TV Strategy Solution Selling See 24+     See less Storage Embedded Systems Intel Consumer Electronics Channel Semiconductors Contract Negotiation Vendor OEM Account Management New Business Development Sales Management Team Leadership Key Account Management Negotiation Customer Relations B2B IPTV Cross-functional Team... Business Alliances Business Development Partner Management Pricing SoC Mobile Devices Customer Service Management Go-to-market Strategy Supply Chain Semiconductor Industry SaaS Channel Partners Cloud Computing International Sales Strategic Partnerships Oracle Enterprise... Digital TV Strategy Solution Selling See 24+     See less Storage Embedded Systems Intel Consumer Electronics Channel Semiconductors Contract Negotiation Vendor OEM Account Management New Business Development Sales Management Team Leadership Key Account Management Negotiation Customer Relations B2B IPTV Cross-functional Team... Business Alliances Business Development Partner Management Pricing SoC Mobile Devices Customer Service Management Go-to-market Strategy Supply Chain Semiconductor Industry SaaS Channel Partners Cloud Computing International Sales Strategic Partnerships Oracle Enterprise... Digital TV Strategy Solution Selling See 24+     See less ", "Experience Managing Director Bright Affect May 2014  – Present (1 year 4 months) Bright Affect was formed because we believe many things can be done better. We see opportunities every day to improve the way people communicate, learn and do business.  \n \nOur approach is to use the latest technology to enhance the business experience of our customers.  \n \nRight now we're bringing the Bright Affect to learning solutions and have developed a Learning application built on Salesforce.com that delivers high quality, engaging learning content. You can see a demonstration of this capability in the link below. \n \nWe'd be delighted to discuss with you what your Bright Affect could be, so please do get in touch. Director FlipWire Ltd August 2008  – Present (7 years 1 month) We deliver performance improvement through the development of new strategy/routes to market, the improvement of existing strategies and the effective use of technology to make positive change. \n \nSpecialists in accessing new markets for clients for either new or existing products and services. \n \nWe work with clients to define and implement strategies for early stage market development, or enhancement of mature go-to-market plans, then implement an orderly transition to the clients ‘business as usual’ processes. \n \nAble to support the development and execution of Sales and Marketing strategy to deliver growth, and expertise in the successful implementation of sales force effectiveness tools. \n \nClients range from large established corporations to start-up organisations. \n \nFlipWire's intuitive web platform also enables SMB's, SME's and independent professionals to develop a robust and effective online presence that increases business opportunities, accelerates brand recognition and converts visitors into repeat customers. Managing Director GN ( Great Nordic) July 2007  –  August 2008  (1 year 2 months) Full P&L responsibilty for UK/Ireland. Responsible for development of business in the contact centre, office and mobile markets. Sales Director UK/Ireland GN Netcom September 2006  –  June 2007  (10 months) Sales Director UK/Ireland responsible for all sales through distribution, reseller channel and Corporate/Enterprise accounts. Global Channel Manager Vodafone Group Services Limited September 2004  –  September 2006  (2 years 1 month) Responsible for the design and implementation of a Global Partner programme to motivate the IT channel for Vodafone, selling into SMB/SME markets. Implemented the programme in 9 countries resulting in the recruitment of >4000 resellers providing a new channel to market for Vodafone's mobile data solutions. Northern Europe Channel Sales Manager Intel Corporation January 2003  –  September 2004  (1 year 9 months) Responsible for all aspects of indirect sales of Intel's communication semiconductor solutions. UK/Ireland Sales Director Intel January 2001  –  January 2003  (2 years 1 month) Responsible for all sales direct and indirect to enterprise and SMB/SME markets via UK/Ireland PC OEM's. Managed key customer relationships, distribution management and channel development. Managing a team of 23 people to consistently exceed sales targets. EMEA Marketing Manager Intel December 1999  –  January 2001  (1 year 2 months) Responsible for management and development of Intel's direct marketing programmes to T3/T4 PC OEM's across EMEA. Channel Sales Manager Intel Corporation October 1996  –  December 1999  (3 years 3 months) Responsible for managing the distribution network in the UK, and all sales of desktop, Server, notebook and networking solutions through distribution to Tier 3/4 PC OEM's into the SMB/SME and education markets. Field Sales Engineer Intel Corporation April 1995  –  October 1996  (1 year 7 months) Field Sales Engineer selling desktop, server and networking solutions into UK Tier 1 PC OEM's. Project Manager MoD July 1992  –  April 1995  (2 years 10 months) Responsible for managing the relationships with support contractors to deliver operational support to the UK Navy fleet. Project manager for all work on development and maintenance of towed array SONAR equipment for surface ships. Technician Apprentice MoD September 1985  –  September 1989  (4 years 1 month) Electronics techician apprentice, gaining four years of practical electronics design and maintenance experience as well as studying for HND in electronics (passed with distinction) Managing Director Bright Affect May 2014  – Present (1 year 4 months) Bright Affect was formed because we believe many things can be done better. We see opportunities every day to improve the way people communicate, learn and do business.  \n \nOur approach is to use the latest technology to enhance the business experience of our customers.  \n \nRight now we're bringing the Bright Affect to learning solutions and have developed a Learning application built on Salesforce.com that delivers high quality, engaging learning content. You can see a demonstration of this capability in the link below. \n \nWe'd be delighted to discuss with you what your Bright Affect could be, so please do get in touch. Managing Director Bright Affect May 2014  – Present (1 year 4 months) Bright Affect was formed because we believe many things can be done better. We see opportunities every day to improve the way people communicate, learn and do business.  \n \nOur approach is to use the latest technology to enhance the business experience of our customers.  \n \nRight now we're bringing the Bright Affect to learning solutions and have developed a Learning application built on Salesforce.com that delivers high quality, engaging learning content. You can see a demonstration of this capability in the link below. \n \nWe'd be delighted to discuss with you what your Bright Affect could be, so please do get in touch. Director FlipWire Ltd August 2008  – Present (7 years 1 month) We deliver performance improvement through the development of new strategy/routes to market, the improvement of existing strategies and the effective use of technology to make positive change. \n \nSpecialists in accessing new markets for clients for either new or existing products and services. \n \nWe work with clients to define and implement strategies for early stage market development, or enhancement of mature go-to-market plans, then implement an orderly transition to the clients ‘business as usual’ processes. \n \nAble to support the development and execution of Sales and Marketing strategy to deliver growth, and expertise in the successful implementation of sales force effectiveness tools. \n \nClients range from large established corporations to start-up organisations. \n \nFlipWire's intuitive web platform also enables SMB's, SME's and independent professionals to develop a robust and effective online presence that increases business opportunities, accelerates brand recognition and converts visitors into repeat customers. Director FlipWire Ltd August 2008  – Present (7 years 1 month) We deliver performance improvement through the development of new strategy/routes to market, the improvement of existing strategies and the effective use of technology to make positive change. \n \nSpecialists in accessing new markets for clients for either new or existing products and services. \n \nWe work with clients to define and implement strategies for early stage market development, or enhancement of mature go-to-market plans, then implement an orderly transition to the clients ‘business as usual’ processes. \n \nAble to support the development and execution of Sales and Marketing strategy to deliver growth, and expertise in the successful implementation of sales force effectiveness tools. \n \nClients range from large established corporations to start-up organisations. \n \nFlipWire's intuitive web platform also enables SMB's, SME's and independent professionals to develop a robust and effective online presence that increases business opportunities, accelerates brand recognition and converts visitors into repeat customers. Managing Director GN ( Great Nordic) July 2007  –  August 2008  (1 year 2 months) Full P&L responsibilty for UK/Ireland. Responsible for development of business in the contact centre, office and mobile markets. Managing Director GN ( Great Nordic) July 2007  –  August 2008  (1 year 2 months) Full P&L responsibilty for UK/Ireland. Responsible for development of business in the contact centre, office and mobile markets. Sales Director UK/Ireland GN Netcom September 2006  –  June 2007  (10 months) Sales Director UK/Ireland responsible for all sales through distribution, reseller channel and Corporate/Enterprise accounts. Sales Director UK/Ireland GN Netcom September 2006  –  June 2007  (10 months) Sales Director UK/Ireland responsible for all sales through distribution, reseller channel and Corporate/Enterprise accounts. Global Channel Manager Vodafone Group Services Limited September 2004  –  September 2006  (2 years 1 month) Responsible for the design and implementation of a Global Partner programme to motivate the IT channel for Vodafone, selling into SMB/SME markets. Implemented the programme in 9 countries resulting in the recruitment of >4000 resellers providing a new channel to market for Vodafone's mobile data solutions. Global Channel Manager Vodafone Group Services Limited September 2004  –  September 2006  (2 years 1 month) Responsible for the design and implementation of a Global Partner programme to motivate the IT channel for Vodafone, selling into SMB/SME markets. Implemented the programme in 9 countries resulting in the recruitment of >4000 resellers providing a new channel to market for Vodafone's mobile data solutions. Northern Europe Channel Sales Manager Intel Corporation January 2003  –  September 2004  (1 year 9 months) Responsible for all aspects of indirect sales of Intel's communication semiconductor solutions. Northern Europe Channel Sales Manager Intel Corporation January 2003  –  September 2004  (1 year 9 months) Responsible for all aspects of indirect sales of Intel's communication semiconductor solutions. UK/Ireland Sales Director Intel January 2001  –  January 2003  (2 years 1 month) Responsible for all sales direct and indirect to enterprise and SMB/SME markets via UK/Ireland PC OEM's. Managed key customer relationships, distribution management and channel development. Managing a team of 23 people to consistently exceed sales targets. UK/Ireland Sales Director Intel January 2001  –  January 2003  (2 years 1 month) Responsible for all sales direct and indirect to enterprise and SMB/SME markets via UK/Ireland PC OEM's. Managed key customer relationships, distribution management and channel development. Managing a team of 23 people to consistently exceed sales targets. EMEA Marketing Manager Intel December 1999  –  January 2001  (1 year 2 months) Responsible for management and development of Intel's direct marketing programmes to T3/T4 PC OEM's across EMEA. EMEA Marketing Manager Intel December 1999  –  January 2001  (1 year 2 months) Responsible for management and development of Intel's direct marketing programmes to T3/T4 PC OEM's across EMEA. Channel Sales Manager Intel Corporation October 1996  –  December 1999  (3 years 3 months) Responsible for managing the distribution network in the UK, and all sales of desktop, Server, notebook and networking solutions through distribution to Tier 3/4 PC OEM's into the SMB/SME and education markets. Channel Sales Manager Intel Corporation October 1996  –  December 1999  (3 years 3 months) Responsible for managing the distribution network in the UK, and all sales of desktop, Server, notebook and networking solutions through distribution to Tier 3/4 PC OEM's into the SMB/SME and education markets. Field Sales Engineer Intel Corporation April 1995  –  October 1996  (1 year 7 months) Field Sales Engineer selling desktop, server and networking solutions into UK Tier 1 PC OEM's. Field Sales Engineer Intel Corporation April 1995  –  October 1996  (1 year 7 months) Field Sales Engineer selling desktop, server and networking solutions into UK Tier 1 PC OEM's. Project Manager MoD July 1992  –  April 1995  (2 years 10 months) Responsible for managing the relationships with support contractors to deliver operational support to the UK Navy fleet. Project manager for all work on development and maintenance of towed array SONAR equipment for surface ships. Project Manager MoD July 1992  –  April 1995  (2 years 10 months) Responsible for managing the relationships with support contractors to deliver operational support to the UK Navy fleet. Project manager for all work on development and maintenance of towed array SONAR equipment for surface ships. Technician Apprentice MoD September 1985  –  September 1989  (4 years 1 month) Electronics techician apprentice, gaining four years of practical electronics design and maintenance experience as well as studying for HND in electronics (passed with distinction) Technician Apprentice MoD September 1985  –  September 1989  (4 years 1 month) Electronics techician apprentice, gaining four years of practical electronics design and maintenance experience as well as studying for HND in electronics (passed with distinction) Skills Channel Product Marketing Go-to-market Strategy Product Management Change Management Negotiation Strategic Partnerships Start-ups Enterprise Software Mobile Devices New Business Development Management Product Launch Team Management Project Management Business Strategy Key Account Management CRM Solution Selling Sales Selling Channel Partners Strategic Planning Marketing Direct Marketing Business Development Telecommunications International Sales See 13+     See less Skills  Channel Product Marketing Go-to-market Strategy Product Management Change Management Negotiation Strategic Partnerships Start-ups Enterprise Software Mobile Devices New Business Development Management Product Launch Team Management Project Management Business Strategy Key Account Management CRM Solution Selling Sales Selling Channel Partners Strategic Planning Marketing Direct Marketing Business Development Telecommunications International Sales See 13+     See less Channel Product Marketing Go-to-market Strategy Product Management Change Management Negotiation Strategic Partnerships Start-ups Enterprise Software Mobile Devices New Business Development Management Product Launch Team Management Project Management Business Strategy Key Account Management CRM Solution Selling Sales Selling Channel Partners Strategic Planning Marketing Direct Marketing Business Development Telecommunications International Sales See 13+     See less Channel Product Marketing Go-to-market Strategy Product Management Change Management Negotiation Strategic Partnerships Start-ups Enterprise Software Mobile Devices New Business Development Management Product Launch Team Management Project Management Business Strategy Key Account Management CRM Solution Selling Sales Selling Channel Partners Strategic Planning Marketing Direct Marketing Business Development Telecommunications International Sales See 13+     See less Education University of Birmingham BEng September 1989  – May 1992 Haygrove School 1981  – 1984 University of Birmingham BEng September 1989  – May 1992 University of Birmingham BEng September 1989  – May 1992 University of Birmingham BEng September 1989  – May 1992 Haygrove School 1981  – 1984 Haygrove School 1981  – 1984 Haygrove School 1981  – 1984 ", "Skills Demand Generation Pre-sales Channel Go-to-market Strategy Technology Business Development Business Alliances Product Marketing Partner Management Account Management Cloud Computing Enterprise Software Solution Selling Professional Services Product Management Sales Enablement Strategic Partnerships Storage Channel Partners SaaS Data Center See 6+     See less Skills  Demand Generation Pre-sales Channel Go-to-market Strategy Technology Business Development Business Alliances Product Marketing Partner Management Account Management Cloud Computing Enterprise Software Solution Selling Professional Services Product Management Sales Enablement Strategic Partnerships Storage Channel Partners SaaS Data Center See 6+     See less Demand Generation Pre-sales Channel Go-to-market Strategy Technology Business Development Business Alliances Product Marketing Partner Management Account Management Cloud Computing Enterprise Software Solution Selling Professional Services Product Management Sales Enablement Strategic Partnerships Storage Channel Partners SaaS Data Center See 6+     See less Demand Generation Pre-sales Channel Go-to-market Strategy Technology Business Development Business Alliances Product Marketing Partner Management Account Management Cloud Computing Enterprise Software Solution Selling Professional Services Product Management Sales Enablement Strategic Partnerships Storage Channel Partners SaaS Data Center See 6+     See less ", "Skills Product Marketing Product Management Intel Go-to-market Strategy Marketing Multi-channel Marketing Competitive Analysis Strategic Partnerships Semiconductors Product Launch Management Cross-functional Team... Business Alliances Demand Generation Program Management Skills  Product Marketing Product Management Intel Go-to-market Strategy Marketing Multi-channel Marketing Competitive Analysis Strategic Partnerships Semiconductors Product Launch Management Cross-functional Team... Business Alliances Demand Generation Program Management Product Marketing Product Management Intel Go-to-market Strategy Marketing Multi-channel Marketing Competitive Analysis Strategic Partnerships Semiconductors Product Launch Management Cross-functional Team... Business Alliances Demand Generation Program Management Product Marketing Product Management Intel Go-to-market Strategy Marketing Multi-channel Marketing Competitive Analysis Strategic Partnerships Semiconductors Product Launch Management Cross-functional Team... Business Alliances Demand Generation Program Management ", "Skills Semiconductors Product Marketing Intel Product Management IC Cross-functional Team... Consumer Electronics Go-to-market Strategy Competitive Analysis Channel Product Development SoC Program Management Start-ups ASIC Semiconductor Industry Embedded Systems Strategic Partnerships Mobile Devices New Business Development See 5+     See less Skills  Semiconductors Product Marketing Intel Product Management IC Cross-functional Team... Consumer Electronics Go-to-market Strategy Competitive Analysis Channel Product Development SoC Program Management Start-ups ASIC Semiconductor Industry Embedded Systems Strategic Partnerships Mobile Devices New Business Development See 5+     See less Semiconductors Product Marketing Intel Product Management IC Cross-functional Team... Consumer Electronics Go-to-market Strategy Competitive Analysis Channel Product Development SoC Program Management Start-ups ASIC Semiconductor Industry Embedded Systems Strategic Partnerships Mobile Devices New Business Development See 5+     See less Semiconductors Product Marketing Intel Product Management IC Cross-functional Team... Consumer Electronics Go-to-market Strategy Competitive Analysis Channel Product Development SoC Program Management Start-ups ASIC Semiconductor Industry Embedded Systems Strategic Partnerships Mobile Devices New Business Development See 5+     See less ", "Experience Regional Sales Manager Intel Corporation June 2015  – Present (3 months) EMEA Enterprise Business in emerging markets & IOT \nMNC - Multinational Corporations EMEA Regional Sales Manager Intel Corporation July 2013  –  June 2015  (2 years) Munich MNC - Multinational Corporations - EMEA Sales Centers \n \nEstablish, drive and coordinate cross business strategy for inside sales initiatives in EMEA. Technical Account Manager - automotive Intel Corporation May 2005  –  June 2013  (8 years 2 months) Global Account: Volkswagen \nAudi, Daimler, Bosch, Lufthansa System, Lufthansa Senior IT Architect Intel May 2005  –  June 2013  (8 years 2 months) Nestle, UBS, CERN Technical Account Manager Hewlett-Packard 2003  –  2005  (2 years) Major Accounts: E.ON, Deutsche Bank, Commerzbank, Citigroup Technical Account Manager Compaq 1997  –  2003  (6 years) Major Accounts - E.ON, Deutsche Bank HW SW Specialist Digital Equipment Corporation 1994  –  1996  (2 years) Regional Sales Manager Intel Corporation June 2015  – Present (3 months) EMEA Enterprise Business in emerging markets & IOT \nMNC - Multinational Corporations EMEA Regional Sales Manager Intel Corporation June 2015  – Present (3 months) EMEA Enterprise Business in emerging markets & IOT \nMNC - Multinational Corporations EMEA Regional Sales Manager Intel Corporation July 2013  –  June 2015  (2 years) Munich MNC - Multinational Corporations - EMEA Sales Centers \n \nEstablish, drive and coordinate cross business strategy for inside sales initiatives in EMEA. Regional Sales Manager Intel Corporation July 2013  –  June 2015  (2 years) Munich MNC - Multinational Corporations - EMEA Sales Centers \n \nEstablish, drive and coordinate cross business strategy for inside sales initiatives in EMEA. Technical Account Manager - automotive Intel Corporation May 2005  –  June 2013  (8 years 2 months) Global Account: Volkswagen \nAudi, Daimler, Bosch, Lufthansa System, Lufthansa Technical Account Manager - automotive Intel Corporation May 2005  –  June 2013  (8 years 2 months) Global Account: Volkswagen \nAudi, Daimler, Bosch, Lufthansa System, Lufthansa Senior IT Architect Intel May 2005  –  June 2013  (8 years 2 months) Nestle, UBS, CERN Senior IT Architect Intel May 2005  –  June 2013  (8 years 2 months) Nestle, UBS, CERN Technical Account Manager Hewlett-Packard 2003  –  2005  (2 years) Major Accounts: E.ON, Deutsche Bank, Commerzbank, Citigroup Technical Account Manager Hewlett-Packard 2003  –  2005  (2 years) Major Accounts: E.ON, Deutsche Bank, Commerzbank, Citigroup Technical Account Manager Compaq 1997  –  2003  (6 years) Major Accounts - E.ON, Deutsche Bank Technical Account Manager Compaq 1997  –  2003  (6 years) Major Accounts - E.ON, Deutsche Bank HW SW Specialist Digital Equipment Corporation 1994  –  1996  (2 years) HW SW Specialist Digital Equipment Corporation 1994  –  1996  (2 years) Languages English Native or bilingual proficiency German Native or bilingual proficiency French Professional working proficiency Chinese Limited working proficiency English Native or bilingual proficiency German Native or bilingual proficiency French Professional working proficiency Chinese Limited working proficiency English Native or bilingual proficiency German Native or bilingual proficiency French Professional working proficiency Chinese Limited working proficiency Native or bilingual proficiency Native or bilingual proficiency Professional working proficiency Limited working proficiency Skills Intel Computer Architecture Cloud Computing Semiconductors Product Management Go-to-market Strategy System Architecture Processors High Performance... SoC Embedded Software ASIC Server Architecture Software Engineering Embedded Systems Hardware Product Marketing Wireless Datacenter... Storage Business Alliances Automotive CAD Data Center Virtualization Servers Pre-sales Cloud See 13+     See less Skills  Intel Computer Architecture Cloud Computing Semiconductors Product Management Go-to-market Strategy System Architecture Processors High Performance... SoC Embedded Software ASIC Server Architecture Software Engineering Embedded Systems Hardware Product Marketing Wireless Datacenter... Storage Business Alliances Automotive CAD Data Center Virtualization Servers Pre-sales Cloud See 13+     See less Intel Computer Architecture Cloud Computing Semiconductors Product Management Go-to-market Strategy System Architecture Processors High Performance... SoC Embedded Software ASIC Server Architecture Software Engineering Embedded Systems Hardware Product Marketing Wireless Datacenter... Storage Business Alliances Automotive CAD Data Center Virtualization Servers Pre-sales Cloud See 13+     See less Intel Computer Architecture Cloud Computing Semiconductors Product Management Go-to-market Strategy System Architecture Processors High Performance... SoC Embedded Software ASIC Server Architecture Software Engineering Embedded Systems Hardware Product Marketing Wireless Datacenter... Storage Business Alliances Automotive CAD Data Center Virtualization Servers Pre-sales Cloud See 13+     See less Education Universität Passau Economics + Computer Science 1990  – 1994 Germany Berliner Handel- und Frankfurter Bank Bankkaufmann,  Merchant Banker 1988  – 1990 Germany Activities and Societies:  Apprenticeship Merchant Banker (Banklehre) King's College School 1983  – 1988 United Kingdom Activities and Societies:  Senior School\nNational Rowing Universität Passau Economics + Computer Science 1990  – 1994 Germany Universität Passau Economics + Computer Science 1990  – 1994 Germany Universität Passau Economics + Computer Science 1990  – 1994 Germany Berliner Handel- und Frankfurter Bank Bankkaufmann,  Merchant Banker 1988  – 1990 Germany Activities and Societies:  Apprenticeship Merchant Banker (Banklehre) Berliner Handel- und Frankfurter Bank Bankkaufmann,  Merchant Banker 1988  – 1990 Germany Activities and Societies:  Apprenticeship Merchant Banker (Banklehre) Berliner Handel- und Frankfurter Bank Bankkaufmann,  Merchant Banker 1988  – 1990 Germany Activities and Societies:  Apprenticeship Merchant Banker (Banklehre) King's College School 1983  – 1988 United Kingdom Activities and Societies:  Senior School\nNational Rowing King's College School 1983  – 1988 United Kingdom Activities and Societies:  Senior School\nNational Rowing King's College School 1983  – 1988 United Kingdom Activities and Societies:  Senior School\nNational Rowing ", "Languages English French Spanish English French Spanish English French Spanish Skills Channel Salesforce.com Sales Process Direct Sales Business Management Channel Management Sales Management Cloud Computing New Business Development ITIL Solution Selling Team Leadership Negotiation Account Management Team Management People Management Team Building Customer Relations Business Planning Key Account Management International Sales Business Strategy Software Sales Strategic Planning Storage IT Service Management Competitive Analysis Consultative Selling IT Management SaaS Forecasting IT Strategy Alliances International Business Channel Partners Business Alliances Selling Management CRM Sales Software Industry Sales Operations HP Data Center Pre-sales Business Development Leadership Customer Service Strategy Go-to-market Strategy See 35+     See less Skills  Channel Salesforce.com Sales Process Direct Sales Business Management Channel Management Sales Management Cloud Computing New Business Development ITIL Solution Selling Team Leadership Negotiation Account Management Team Management People Management Team Building Customer Relations Business Planning Key Account Management International Sales Business Strategy Software Sales Strategic Planning Storage IT Service Management Competitive Analysis Consultative Selling IT Management SaaS Forecasting IT Strategy Alliances International Business Channel Partners Business Alliances Selling Management CRM Sales Software Industry Sales Operations HP Data Center Pre-sales Business Development Leadership Customer Service Strategy Go-to-market Strategy See 35+     See less Channel Salesforce.com Sales Process Direct Sales Business Management Channel Management Sales Management Cloud Computing New Business Development ITIL Solution Selling Team Leadership Negotiation Account Management Team Management People Management Team Building Customer Relations Business Planning Key Account Management International Sales Business Strategy Software Sales Strategic Planning Storage IT Service Management Competitive Analysis Consultative Selling IT Management SaaS Forecasting IT Strategy Alliances International Business Channel Partners Business Alliances Selling Management CRM Sales Software Industry Sales Operations HP Data Center Pre-sales Business Development Leadership Customer Service Strategy Go-to-market Strategy See 35+     See less Channel Salesforce.com Sales Process Direct Sales Business Management Channel Management Sales Management Cloud Computing New Business Development ITIL Solution Selling Team Leadership Negotiation Account Management Team Management People Management Team Building Customer Relations Business Planning Key Account Management International Sales Business Strategy Software Sales Strategic Planning Storage IT Service Management Competitive Analysis Consultative Selling IT Management SaaS Forecasting IT Strategy Alliances International Business Channel Partners Business Alliances Selling Management CRM Sales Software Industry Sales Operations HP Data Center Pre-sales Business Development Leadership Customer Service Strategy Go-to-market Strategy See 35+     See less ", "Summary Global business leader with over 30 years of successful experience in technology and sales management. Recognized for accomplishments and impact in managing cross-functional and diverse teams to achieve maximum results.  \nCurrently focused on enabling transformation and innovation in financial services leading Intel imperatives associated with this industry in cloud, big data/analytics, IoT, security, and client platforms. \nExperienced in establishing a vision and aligning resources both internally and externally to overcome obstacles, achieve results, and deliver business value. Deep understanding of channel and direct go to market sales cycles for both OEM and end user customers.  \nPassionate about technology and collaborating with partners to develop solutions that enable innovation and transform our world. \n \nFollow me on Twitter @blalockm Summary Global business leader with over 30 years of successful experience in technology and sales management. Recognized for accomplishments and impact in managing cross-functional and diverse teams to achieve maximum results.  \nCurrently focused on enabling transformation and innovation in financial services leading Intel imperatives associated with this industry in cloud, big data/analytics, IoT, security, and client platforms. \nExperienced in establishing a vision and aligning resources both internally and externally to overcome obstacles, achieve results, and deliver business value. Deep understanding of channel and direct go to market sales cycles for both OEM and end user customers.  \nPassionate about technology and collaborating with partners to develop solutions that enable innovation and transform our world. \n \nFollow me on Twitter @blalockm Global business leader with over 30 years of successful experience in technology and sales management. Recognized for accomplishments and impact in managing cross-functional and diverse teams to achieve maximum results.  \nCurrently focused on enabling transformation and innovation in financial services leading Intel imperatives associated with this industry in cloud, big data/analytics, IoT, security, and client platforms. \nExperienced in establishing a vision and aligning resources both internally and externally to overcome obstacles, achieve results, and deliver business value. Deep understanding of channel and direct go to market sales cycles for both OEM and end user customers.  \nPassionate about technology and collaborating with partners to develop solutions that enable innovation and transform our world. \n \nFollow me on Twitter @blalockm Global business leader with over 30 years of successful experience in technology and sales management. Recognized for accomplishments and impact in managing cross-functional and diverse teams to achieve maximum results.  \nCurrently focused on enabling transformation and innovation in financial services leading Intel imperatives associated with this industry in cloud, big data/analytics, IoT, security, and client platforms. \nExperienced in establishing a vision and aligning resources both internally and externally to overcome obstacles, achieve results, and deliver business value. Deep understanding of channel and direct go to market sales cycles for both OEM and end user customers.  \nPassionate about technology and collaborating with partners to develop solutions that enable innovation and transform our world. \n \nFollow me on Twitter @blalockm Experience Director - Financial Services Industry Intel Corporation December 2012  – Present (2 years 9 months) Greater Boston Area Director of the Financial Services Industry vertical team within Intel's Influencer Sales Group. Leading a worldwide headquarters team of sales leaders, subject matter experts, and solution architects supporting end user engagements in capital markets, banking, and insurance. This global team is responsible for FSI thought leadership, representing customer needs and industry challenges, and delivering innovative solutions that solve business problems through Intel's ecosystem and scale partners. Leading initiatives and developing Intel based solutions around FSI transformational areas including: The Digital Bank, The Digital Insurer, Ubiquitous Data Mgmt. and Analytics, and Data Center Transformation.  Northeast District Sales Manager Intel Corporation April 2008  –  November 2012  (4 years 8 months) Greater Boston Area Led sales activity in the Northeastern US and Eastern Canada for communications, storage, and embedded accounts with a team of 12 direct reports and four rep firms. Regional Applications Manager Intel Corporation August 2006  –  April 2008  (1 year 9 months) Greater Boston Area Led technical team on embedded and communications accounts in North America. Regional Sales Manager Intel Corporation October 2000  –  August 2006  (5 years 11 months) Greater Boston Area Led extended team across six districts in Eastern US and Canada to drive new business in key communications and embedded accounts. South Central District Sales Manager Intel Corporation May 1998  –  October 2000  (2 years 6 months) Dallas/Fort Worth Area Managed team of 11 direct reports and 3 rep firms supporting Texas and the Rocky Mountain territory focused on key communications and embedded accounts. Area Sales Manager Digital Semiconductor 1996  –  1998  (2 years) Area Sales Manager Samsung Semiconductor 1990  –  1996  (6 years) Field Applications Engineer Microchip Technology 1988  –  1990  (2 years) Electrical Design Engineer Texas Instruments 1982  –  1988  (6 years) Director - Financial Services Industry Intel Corporation December 2012  – Present (2 years 9 months) Greater Boston Area Director of the Financial Services Industry vertical team within Intel's Influencer Sales Group. Leading a worldwide headquarters team of sales leaders, subject matter experts, and solution architects supporting end user engagements in capital markets, banking, and insurance. This global team is responsible for FSI thought leadership, representing customer needs and industry challenges, and delivering innovative solutions that solve business problems through Intel's ecosystem and scale partners. Leading initiatives and developing Intel based solutions around FSI transformational areas including: The Digital Bank, The Digital Insurer, Ubiquitous Data Mgmt. and Analytics, and Data Center Transformation.  Director - Financial Services Industry Intel Corporation December 2012  – Present (2 years 9 months) Greater Boston Area Director of the Financial Services Industry vertical team within Intel's Influencer Sales Group. Leading a worldwide headquarters team of sales leaders, subject matter experts, and solution architects supporting end user engagements in capital markets, banking, and insurance. This global team is responsible for FSI thought leadership, representing customer needs and industry challenges, and delivering innovative solutions that solve business problems through Intel's ecosystem and scale partners. Leading initiatives and developing Intel based solutions around FSI transformational areas including: The Digital Bank, The Digital Insurer, Ubiquitous Data Mgmt. and Analytics, and Data Center Transformation.  Northeast District Sales Manager Intel Corporation April 2008  –  November 2012  (4 years 8 months) Greater Boston Area Led sales activity in the Northeastern US and Eastern Canada for communications, storage, and embedded accounts with a team of 12 direct reports and four rep firms. Northeast District Sales Manager Intel Corporation April 2008  –  November 2012  (4 years 8 months) Greater Boston Area Led sales activity in the Northeastern US and Eastern Canada for communications, storage, and embedded accounts with a team of 12 direct reports and four rep firms. Regional Applications Manager Intel Corporation August 2006  –  April 2008  (1 year 9 months) Greater Boston Area Led technical team on embedded and communications accounts in North America. Regional Applications Manager Intel Corporation August 2006  –  April 2008  (1 year 9 months) Greater Boston Area Led technical team on embedded and communications accounts in North America. Regional Sales Manager Intel Corporation October 2000  –  August 2006  (5 years 11 months) Greater Boston Area Led extended team across six districts in Eastern US and Canada to drive new business in key communications and embedded accounts. Regional Sales Manager Intel Corporation October 2000  –  August 2006  (5 years 11 months) Greater Boston Area Led extended team across six districts in Eastern US and Canada to drive new business in key communications and embedded accounts. South Central District Sales Manager Intel Corporation May 1998  –  October 2000  (2 years 6 months) Dallas/Fort Worth Area Managed team of 11 direct reports and 3 rep firms supporting Texas and the Rocky Mountain territory focused on key communications and embedded accounts. South Central District Sales Manager Intel Corporation May 1998  –  October 2000  (2 years 6 months) Dallas/Fort Worth Area Managed team of 11 direct reports and 3 rep firms supporting Texas and the Rocky Mountain territory focused on key communications and embedded accounts. Area Sales Manager Digital Semiconductor 1996  –  1998  (2 years) Area Sales Manager Digital Semiconductor 1996  –  1998  (2 years) Area Sales Manager Samsung Semiconductor 1990  –  1996  (6 years) Area Sales Manager Samsung Semiconductor 1990  –  1996  (6 years) Field Applications Engineer Microchip Technology 1988  –  1990  (2 years) Field Applications Engineer Microchip Technology 1988  –  1990  (2 years) Electrical Design Engineer Texas Instruments 1982  –  1988  (6 years) Electrical Design Engineer Texas Instruments 1982  –  1988  (6 years) Skills Semiconductors Semiconductor Industry IC ASIC Product Marketing New Business Development Sales Operations Sales Go-to-market Strategy Intel SoC Embedded Systems Product Management Wireless Strategy Consumer Electronics Processors See 2+     See less Skills  Semiconductors Semiconductor Industry IC ASIC Product Marketing New Business Development Sales Operations Sales Go-to-market Strategy Intel SoC Embedded Systems Product Management Wireless Strategy Consumer Electronics Processors See 2+     See less Semiconductors Semiconductor Industry IC ASIC Product Marketing New Business Development Sales Operations Sales Go-to-market Strategy Intel SoC Embedded Systems Product Management Wireless Strategy Consumer Electronics Processors See 2+     See less Semiconductors Semiconductor Industry IC ASIC Product Marketing New Business Development Sales Operations Sales Go-to-market Strategy Intel SoC Embedded Systems Product Management Wireless Strategy Consumer Electronics Processors See 2+     See less Education North Carolina State University BS,  Electrical Engineering 1978  – 1982 Activities and Societies:  Tau Beta Pi ,  Eta Kappa Nu North Carolina State University BS,  Electrical Engineering 1978  – 1982 Activities and Societies:  Tau Beta Pi ,  Eta Kappa Nu North Carolina State University BS,  Electrical Engineering 1978  – 1982 Activities and Societies:  Tau Beta Pi ,  Eta Kappa Nu North Carolina State University BS,  Electrical Engineering 1978  – 1982 Activities and Societies:  Tau Beta Pi ,  Eta Kappa Nu ", "Skills Channel Embedded Systems Sales Management OEM Channel Partners Oracle Enterprise... Intel Strategy Multi-channel Marketing Hardware Direct Sales Product Marketing Solution Selling Semiconductors Go-to-market Strategy Cloud Computing Strategic Partnerships Start-ups Ethernet Product Management Sales Operations Telecommunications Management Business Alliances Product Development Wireless Competitive Analysis Cross-functional Team... Leadership Sales IC SaaS Manufacturing Product Launch Semiconductor Industry Product Lifecycle... ASIC See 22+     See less Skills  Channel Embedded Systems Sales Management OEM Channel Partners Oracle Enterprise... Intel Strategy Multi-channel Marketing Hardware Direct Sales Product Marketing Solution Selling Semiconductors Go-to-market Strategy Cloud Computing Strategic Partnerships Start-ups Ethernet Product Management Sales Operations Telecommunications Management Business Alliances Product Development Wireless Competitive Analysis Cross-functional Team... Leadership Sales IC SaaS Manufacturing Product Launch Semiconductor Industry Product Lifecycle... ASIC See 22+     See less Channel Embedded Systems Sales Management OEM Channel Partners Oracle Enterprise... Intel Strategy Multi-channel Marketing Hardware Direct Sales Product Marketing Solution Selling Semiconductors Go-to-market Strategy Cloud Computing Strategic Partnerships Start-ups Ethernet Product Management Sales Operations Telecommunications Management Business Alliances Product Development Wireless Competitive Analysis Cross-functional Team... Leadership Sales IC SaaS Manufacturing Product Launch Semiconductor Industry Product Lifecycle... ASIC See 22+     See less Channel Embedded Systems Sales Management OEM Channel Partners Oracle Enterprise... Intel Strategy Multi-channel Marketing Hardware Direct Sales Product Marketing Solution Selling Semiconductors Go-to-market Strategy Cloud Computing Strategic Partnerships Start-ups Ethernet Product Management Sales Operations Telecommunications Management Business Alliances Product Development Wireless Competitive Analysis Cross-functional Team... Leadership Sales IC SaaS Manufacturing Product Launch Semiconductor Industry Product Lifecycle... ASIC See 22+     See less ", "Skills Sales Marketing R&D Program Management Project Management Account Management Consulting Software Development Customer Experience CRM Product Marketing International Relations Business Strategy International... PMP Mobile Devices Cross-functional Team... Project Planning Product Management Change Management Mobile Communications Management Telecommunications Product Launch Go-to-market Strategy Product Development Scrum Mobile Technology Wireless Integration Mobile Applications Strategy Product Lifecycle... Testing Six Sigma Strategic Partnerships Virtual Teams Partner Management GSM See 24+     See less Skills  Sales Marketing R&D Program Management Project Management Account Management Consulting Software Development Customer Experience CRM Product Marketing International Relations Business Strategy International... PMP Mobile Devices Cross-functional Team... Project Planning Product Management Change Management Mobile Communications Management Telecommunications Product Launch Go-to-market Strategy Product Development Scrum Mobile Technology Wireless Integration Mobile Applications Strategy Product Lifecycle... Testing Six Sigma Strategic Partnerships Virtual Teams Partner Management GSM See 24+     See less Sales Marketing R&D Program Management Project Management Account Management Consulting Software Development Customer Experience CRM Product Marketing International Relations Business Strategy International... PMP Mobile Devices Cross-functional Team... Project Planning Product Management Change Management Mobile Communications Management Telecommunications Product Launch Go-to-market Strategy Product Development Scrum Mobile Technology Wireless Integration Mobile Applications Strategy Product Lifecycle... Testing Six Sigma Strategic Partnerships Virtual Teams Partner Management GSM See 24+     See less Sales Marketing R&D Program Management Project Management Account Management Consulting Software Development Customer Experience CRM Product Marketing International Relations Business Strategy International... PMP Mobile Devices Cross-functional Team... Project Planning Product Management Change Management Mobile Communications Management Telecommunications Product Launch Go-to-market Strategy Product Development Scrum Mobile Technology Wireless Integration Mobile Applications Strategy Product Lifecycle... Testing Six Sigma Strategic Partnerships Virtual Teams Partner Management GSM See 24+     See less ", "Summary Accomplished Sales and Marketing professional with over 10 years of broad experience in International high technology firms. Recognized for successful account, project and team management with a proven track record of exceeding targets. Extensive background in team leadership, product management, project / budget management and direct customer sales and marketing. Summary Accomplished Sales and Marketing professional with over 10 years of broad experience in International high technology firms. Recognized for successful account, project and team management with a proven track record of exceeding targets. Extensive background in team leadership, product management, project / budget management and direct customer sales and marketing. Accomplished Sales and Marketing professional with over 10 years of broad experience in International high technology firms. Recognized for successful account, project and team management with a proven track record of exceeding targets. Extensive background in team leadership, product management, project / budget management and direct customer sales and marketing. Accomplished Sales and Marketing professional with over 10 years of broad experience in International high technology firms. Recognized for successful account, project and team management with a proven track record of exceeding targets. Extensive background in team leadership, product management, project / budget management and direct customer sales and marketing. Experience Marketing Manager EMEA Lighting Technologies GmbH October 2014  –  April 2015  (7 months) Munich Area, Germany Team Leader International Sales Gehrlicher Solar AG 2010  –  2012  (2 years) Munich Area, Germany EMEA CPU Sales Manager Intel Corporation 2003  –  2007  (4 years) Munich Area, Germany Japan CPU Sales Manager Intel Corporation 2000  –  2003  (3 years) San Francisco Bay Area Divisional Business Manager Notebook PC's Intel Corporation 1998  –  2000  (2 years) San Francisco Bay Area Manufacturing Operations Manager Intel Corporation 1993  –  1998  (5 years) San Francisco Bay Area Marketing Manager EMEA Lighting Technologies GmbH October 2014  –  April 2015  (7 months) Munich Area, Germany Marketing Manager EMEA Lighting Technologies GmbH October 2014  –  April 2015  (7 months) Munich Area, Germany Team Leader International Sales Gehrlicher Solar AG 2010  –  2012  (2 years) Munich Area, Germany Team Leader International Sales Gehrlicher Solar AG 2010  –  2012  (2 years) Munich Area, Germany EMEA CPU Sales Manager Intel Corporation 2003  –  2007  (4 years) Munich Area, Germany EMEA CPU Sales Manager Intel Corporation 2003  –  2007  (4 years) Munich Area, Germany Japan CPU Sales Manager Intel Corporation 2000  –  2003  (3 years) San Francisco Bay Area Japan CPU Sales Manager Intel Corporation 2000  –  2003  (3 years) San Francisco Bay Area Divisional Business Manager Notebook PC's Intel Corporation 1998  –  2000  (2 years) San Francisco Bay Area Divisional Business Manager Notebook PC's Intel Corporation 1998  –  2000  (2 years) San Francisco Bay Area Manufacturing Operations Manager Intel Corporation 1993  –  1998  (5 years) San Francisco Bay Area Manufacturing Operations Manager Intel Corporation 1993  –  1998  (5 years) San Francisco Bay Area Languages English Native or bilingual proficiency German English Native or bilingual proficiency German English Native or bilingual proficiency German Native or bilingual proficiency Skills Photovoltaics Business Strategy International Sales Marketing Strategy Renewable Energy Energy Solar Energy Product Management Negotiation Business Development Strategy Start-ups Product Marketing Business Planning Management Project Management New Business Development See 2+     See less Skills  Photovoltaics Business Strategy International Sales Marketing Strategy Renewable Energy Energy Solar Energy Product Management Negotiation Business Development Strategy Start-ups Product Marketing Business Planning Management Project Management New Business Development See 2+     See less Photovoltaics Business Strategy International Sales Marketing Strategy Renewable Energy Energy Solar Energy Product Management Negotiation Business Development Strategy Start-ups Product Marketing Business Planning Management Project Management New Business Development See 2+     See less Photovoltaics Business Strategy International Sales Marketing Strategy Renewable Energy Energy Solar Energy Product Management Negotiation Business Development Strategy Start-ups Product Marketing Business Planning Management Project Management New Business Development See 2+     See less Honors & Awards ", "Summary Outstanding track record of developing and executing strategy and actionable plans that drive sustainable, scalable, profitable business growth. \n \nSKILLS & CAPABILITIES INCLUDE: \n \n➢\tDeveloping and deploying strategic, integrated sales plans that drive profitable revenue and market share growth, as well as new business development through new/adjacent market opportunities. \n➢\tBuilding organizational capability in market segments and product categories through the development of product/service offerings, sales resources, processes, and tools, and account penetration/retention strategies. \n➢\tCreating market presence by developing robust marketing strategies and cultivating strategic industry relationships and channel partnerships. \n➢\tStrengthening relationships with key clients and gathering voice of the customer data to drive program enhancements, identify new growth opportunities, and continuously deliver on win-win relationships. \n➢\tFormulating and executing channel management vision, strategy, and programs for entire product portfolios. \n \nAREAS OF EXPERTISE INCLUDE: \n- Channel Strategy, Development, Partnerships & Sales\t \n- Regional, International & Global Business Development\t \n- Intellectual Property (IP) Creation & Licensing\t \n- New Product Development, Release & Management  \n- Sales Operations & Administration\t \n- Positioning, Messaging & Marketing Strategies\t \n- Revenue Forecasting & Planning/P&L Management\t \n- Strategic Account & Client Relationship Management Summary Outstanding track record of developing and executing strategy and actionable plans that drive sustainable, scalable, profitable business growth. \n \nSKILLS & CAPABILITIES INCLUDE: \n \n➢\tDeveloping and deploying strategic, integrated sales plans that drive profitable revenue and market share growth, as well as new business development through new/adjacent market opportunities. \n➢\tBuilding organizational capability in market segments and product categories through the development of product/service offerings, sales resources, processes, and tools, and account penetration/retention strategies. \n➢\tCreating market presence by developing robust marketing strategies and cultivating strategic industry relationships and channel partnerships. \n➢\tStrengthening relationships with key clients and gathering voice of the customer data to drive program enhancements, identify new growth opportunities, and continuously deliver on win-win relationships. \n➢\tFormulating and executing channel management vision, strategy, and programs for entire product portfolios. \n \nAREAS OF EXPERTISE INCLUDE: \n- Channel Strategy, Development, Partnerships & Sales\t \n- Regional, International & Global Business Development\t \n- Intellectual Property (IP) Creation & Licensing\t \n- New Product Development, Release & Management  \n- Sales Operations & Administration\t \n- Positioning, Messaging & Marketing Strategies\t \n- Revenue Forecasting & Planning/P&L Management\t \n- Strategic Account & Client Relationship Management Outstanding track record of developing and executing strategy and actionable plans that drive sustainable, scalable, profitable business growth. \n \nSKILLS & CAPABILITIES INCLUDE: \n \n➢\tDeveloping and deploying strategic, integrated sales plans that drive profitable revenue and market share growth, as well as new business development through new/adjacent market opportunities. \n➢\tBuilding organizational capability in market segments and product categories through the development of product/service offerings, sales resources, processes, and tools, and account penetration/retention strategies. \n➢\tCreating market presence by developing robust marketing strategies and cultivating strategic industry relationships and channel partnerships. \n➢\tStrengthening relationships with key clients and gathering voice of the customer data to drive program enhancements, identify new growth opportunities, and continuously deliver on win-win relationships. \n➢\tFormulating and executing channel management vision, strategy, and programs for entire product portfolios. \n \nAREAS OF EXPERTISE INCLUDE: \n- Channel Strategy, Development, Partnerships & Sales\t \n- Regional, International & Global Business Development\t \n- Intellectual Property (IP) Creation & Licensing\t \n- New Product Development, Release & Management  \n- Sales Operations & Administration\t \n- Positioning, Messaging & Marketing Strategies\t \n- Revenue Forecasting & Planning/P&L Management\t \n- Strategic Account & Client Relationship Management Outstanding track record of developing and executing strategy and actionable plans that drive sustainable, scalable, profitable business growth. \n \nSKILLS & CAPABILITIES INCLUDE: \n \n➢\tDeveloping and deploying strategic, integrated sales plans that drive profitable revenue and market share growth, as well as new business development through new/adjacent market opportunities. \n➢\tBuilding organizational capability in market segments and product categories through the development of product/service offerings, sales resources, processes, and tools, and account penetration/retention strategies. \n➢\tCreating market presence by developing robust marketing strategies and cultivating strategic industry relationships and channel partnerships. \n➢\tStrengthening relationships with key clients and gathering voice of the customer data to drive program enhancements, identify new growth opportunities, and continuously deliver on win-win relationships. \n➢\tFormulating and executing channel management vision, strategy, and programs for entire product portfolios. \n \nAREAS OF EXPERTISE INCLUDE: \n- Channel Strategy, Development, Partnerships & Sales\t \n- Regional, International & Global Business Development\t \n- Intellectual Property (IP) Creation & Licensing\t \n- New Product Development, Release & Management  \n- Sales Operations & Administration\t \n- Positioning, Messaging & Marketing Strategies\t \n- Revenue Forecasting & Planning/P&L Management\t \n- Strategic Account & Client Relationship Management Experience CEO & SVP of Business Development Pixelgarde, Inc. July 2009  – Present (6 years 2 months) Greater San Diego Area Formed personal privacy business to enable consumers to safely organize and share digital content online. Created business strategy, designed technology, and built strategic partnerships. Lead product development and management. \n \n-\tEstablished and grew start-up company from initial concept to product release and revenue generation. \n-\tBuilt IP portfolio of digital content sharing applications for PC, Mac, iPhone, and Android in less than three years; awarded two U.S. patents, with third patent pending. Vice President of Sales PRIMA Cinema, Inc. January 2013  –  March 2015  (2 years 3 months) greater san diego area Recruited to jumpstart sales efforts and built company’s first authorized dealer channel. Created channel strategy, formed channel partners, and managed authorized dealer channel and member relationships. \n \n-\tAchieved 240% sales growth by building channel partnerships with 150+ AV equipment integrators, home control companies, and strategic partners, as well as driving marketing outreach and industry event participation. \n-\tCatapulted qualified leads from zero to more than 20 daily at 30% conversion rate with 50% closure rate by spearheading outbound marketing campaigns. \n-\tOptimized pipeline management and accuracy of revenue forecasting by creating CRM sales process covering qualification, management, reporting, and documentation. Director of Sales and Business Development DivX, Inc. (acquired by Sonic) February 2005  –  July 2009  (4 years 6 months) Greater San Diego Area Recruited to introduce certified licensed technology into U.S. market. Promoted rapidly from Sales Manager to lead business development first in the Americas and then also in Europe. Built and led multinational team of 20+ direct reports. Held full P&L responsibility for sales and business development group. \n \n-\tOvercame major misperception in market and clarified product value to retail category buyers by defining channel value proposition and guiding marketing team to best position company, brand, and product. \n-\tAccelerated licensing revenue by building strategic partnerships with semiconductor, consumer electronics, and channel accounts worldwide. \n-\tGrew market share to 70% in Brazil, representing $1.5M in annual revenue. \n-\tNegotiated company’s first global TV OEM agreement as Europe sales lead. \n-\tPlayed integral role in aligning and focusing team on strategic accounts during/after 2006 IPO and in dynamic market rapidly changing from DVD to BluRay and streaming products. Restructured team into functional, geographic groups assigned to individual diverging categories, allowing country/regional market data sharing. Sales Manager, Retail Products Musicmatch, Inc. (acquired by Yahoo!) February 2003  –  February 2005  (2 years 1 month) San Diego, CA Recruited out of StoneStreet One, Inc. in February 2003 to maximize group P&L, optimize operations, and stabilize/grow revenue for group with more than 20 suppliers, distributors, retailers, and employees.  \n \n-\tPropelled business growth with 140% increase in revenue, adding $1.2M, and improved profitability 50% by initiating global expansion, terminating contract with Pearson Education building in-house manufacturing capability, and selecting/managing performance of new contract manufacturer for retail boxed products.  \n-\tEliminated $350K returns reserve allocation by developing new revenue recognition process that transitioned organization from sell-in to sell-through revenue recognition. \n-\tBoosted profits 30% by negotiating direct distribution agreements with Tier 1 retailers and distributors. Sales and Business Development Manager Intel Corporation November 1996  –  October 2001  (5 years) San Diego, CA, Hillboro, OR, Atlanta, GA Promoted rapidly from three prior leadership roles: Sales Channel Manager, Western U.S. and Canada; Regional Territory Manager, Southeast; and Account Manager, Intel Online Services. \n \n-\tCaptured company’s first design wins with OEM and channel accounts for Intel Bluetooth wireless technology. \n-\tGrew IT services and support revenue to $20M. \n-\tEstablished and grew enterprise systems management VAR channel to generate $5.8M in annual revenue for LANDesk Software (128% increase in sales). \n-\tRanked as top sales producer with 230% of sales target, representing $6.9M in revenue, for network hardware in territory covering Western United States and Canada. Sales Account Manager Intel Corporation September 1999  –  June 2000  (10 months) Hillsboro, Or -\tGrew IT services and support revenue to $20M. Regional Sales Manager Intel Corporation May 1997  –  August 1998  (1 year 4 months) Greater Atlanta Area -\tEstablished and grew enterprise systems management VAR channel to generate $5.8M in annual revenue for LANDesk Software (128% increase in sales). Channel Sales Manager Intel Corporation November 1995  –  May 1997  (1 year 7 months) Hillsboro, OR -\tRanked as top sales producer with 230% of sales target, representing $6.9M in revenue, for network hardware in territory covering Western United States and Canada. CEO & SVP of Business Development Pixelgarde, Inc. July 2009  – Present (6 years 2 months) Greater San Diego Area Formed personal privacy business to enable consumers to safely organize and share digital content online. Created business strategy, designed technology, and built strategic partnerships. Lead product development and management. \n \n-\tEstablished and grew start-up company from initial concept to product release and revenue generation. \n-\tBuilt IP portfolio of digital content sharing applications for PC, Mac, iPhone, and Android in less than three years; awarded two U.S. patents, with third patent pending. CEO & SVP of Business Development Pixelgarde, Inc. July 2009  – Present (6 years 2 months) Greater San Diego Area Formed personal privacy business to enable consumers to safely organize and share digital content online. Created business strategy, designed technology, and built strategic partnerships. Lead product development and management. \n \n-\tEstablished and grew start-up company from initial concept to product release and revenue generation. \n-\tBuilt IP portfolio of digital content sharing applications for PC, Mac, iPhone, and Android in less than three years; awarded two U.S. patents, with third patent pending. Vice President of Sales PRIMA Cinema, Inc. January 2013  –  March 2015  (2 years 3 months) greater san diego area Recruited to jumpstart sales efforts and built company’s first authorized dealer channel. Created channel strategy, formed channel partners, and managed authorized dealer channel and member relationships. \n \n-\tAchieved 240% sales growth by building channel partnerships with 150+ AV equipment integrators, home control companies, and strategic partners, as well as driving marketing outreach and industry event participation. \n-\tCatapulted qualified leads from zero to more than 20 daily at 30% conversion rate with 50% closure rate by spearheading outbound marketing campaigns. \n-\tOptimized pipeline management and accuracy of revenue forecasting by creating CRM sales process covering qualification, management, reporting, and documentation. Vice President of Sales PRIMA Cinema, Inc. January 2013  –  March 2015  (2 years 3 months) greater san diego area Recruited to jumpstart sales efforts and built company’s first authorized dealer channel. Created channel strategy, formed channel partners, and managed authorized dealer channel and member relationships. \n \n-\tAchieved 240% sales growth by building channel partnerships with 150+ AV equipment integrators, home control companies, and strategic partners, as well as driving marketing outreach and industry event participation. \n-\tCatapulted qualified leads from zero to more than 20 daily at 30% conversion rate with 50% closure rate by spearheading outbound marketing campaigns. \n-\tOptimized pipeline management and accuracy of revenue forecasting by creating CRM sales process covering qualification, management, reporting, and documentation. Director of Sales and Business Development DivX, Inc. (acquired by Sonic) February 2005  –  July 2009  (4 years 6 months) Greater San Diego Area Recruited to introduce certified licensed technology into U.S. market. Promoted rapidly from Sales Manager to lead business development first in the Americas and then also in Europe. Built and led multinational team of 20+ direct reports. Held full P&L responsibility for sales and business development group. \n \n-\tOvercame major misperception in market and clarified product value to retail category buyers by defining channel value proposition and guiding marketing team to best position company, brand, and product. \n-\tAccelerated licensing revenue by building strategic partnerships with semiconductor, consumer electronics, and channel accounts worldwide. \n-\tGrew market share to 70% in Brazil, representing $1.5M in annual revenue. \n-\tNegotiated company’s first global TV OEM agreement as Europe sales lead. \n-\tPlayed integral role in aligning and focusing team on strategic accounts during/after 2006 IPO and in dynamic market rapidly changing from DVD to BluRay and streaming products. Restructured team into functional, geographic groups assigned to individual diverging categories, allowing country/regional market data sharing. Director of Sales and Business Development DivX, Inc. (acquired by Sonic) February 2005  –  July 2009  (4 years 6 months) Greater San Diego Area Recruited to introduce certified licensed technology into U.S. market. Promoted rapidly from Sales Manager to lead business development first in the Americas and then also in Europe. Built and led multinational team of 20+ direct reports. Held full P&L responsibility for sales and business development group. \n \n-\tOvercame major misperception in market and clarified product value to retail category buyers by defining channel value proposition and guiding marketing team to best position company, brand, and product. \n-\tAccelerated licensing revenue by building strategic partnerships with semiconductor, consumer electronics, and channel accounts worldwide. \n-\tGrew market share to 70% in Brazil, representing $1.5M in annual revenue. \n-\tNegotiated company’s first global TV OEM agreement as Europe sales lead. \n-\tPlayed integral role in aligning and focusing team on strategic accounts during/after 2006 IPO and in dynamic market rapidly changing from DVD to BluRay and streaming products. Restructured team into functional, geographic groups assigned to individual diverging categories, allowing country/regional market data sharing. Sales Manager, Retail Products Musicmatch, Inc. (acquired by Yahoo!) February 2003  –  February 2005  (2 years 1 month) San Diego, CA Recruited out of StoneStreet One, Inc. in February 2003 to maximize group P&L, optimize operations, and stabilize/grow revenue for group with more than 20 suppliers, distributors, retailers, and employees.  \n \n-\tPropelled business growth with 140% increase in revenue, adding $1.2M, and improved profitability 50% by initiating global expansion, terminating contract with Pearson Education building in-house manufacturing capability, and selecting/managing performance of new contract manufacturer for retail boxed products.  \n-\tEliminated $350K returns reserve allocation by developing new revenue recognition process that transitioned organization from sell-in to sell-through revenue recognition. \n-\tBoosted profits 30% by negotiating direct distribution agreements with Tier 1 retailers and distributors. Sales Manager, Retail Products Musicmatch, Inc. (acquired by Yahoo!) February 2003  –  February 2005  (2 years 1 month) San Diego, CA Recruited out of StoneStreet One, Inc. in February 2003 to maximize group P&L, optimize operations, and stabilize/grow revenue for group with more than 20 suppliers, distributors, retailers, and employees.  \n \n-\tPropelled business growth with 140% increase in revenue, adding $1.2M, and improved profitability 50% by initiating global expansion, terminating contract with Pearson Education building in-house manufacturing capability, and selecting/managing performance of new contract manufacturer for retail boxed products.  \n-\tEliminated $350K returns reserve allocation by developing new revenue recognition process that transitioned organization from sell-in to sell-through revenue recognition. \n-\tBoosted profits 30% by negotiating direct distribution agreements with Tier 1 retailers and distributors. Sales and Business Development Manager Intel Corporation November 1996  –  October 2001  (5 years) San Diego, CA, Hillboro, OR, Atlanta, GA Promoted rapidly from three prior leadership roles: Sales Channel Manager, Western U.S. and Canada; Regional Territory Manager, Southeast; and Account Manager, Intel Online Services. \n \n-\tCaptured company’s first design wins with OEM and channel accounts for Intel Bluetooth wireless technology. \n-\tGrew IT services and support revenue to $20M. \n-\tEstablished and grew enterprise systems management VAR channel to generate $5.8M in annual revenue for LANDesk Software (128% increase in sales). \n-\tRanked as top sales producer with 230% of sales target, representing $6.9M in revenue, for network hardware in territory covering Western United States and Canada. Sales and Business Development Manager Intel Corporation November 1996  –  October 2001  (5 years) San Diego, CA, Hillboro, OR, Atlanta, GA Promoted rapidly from three prior leadership roles: Sales Channel Manager, Western U.S. and Canada; Regional Territory Manager, Southeast; and Account Manager, Intel Online Services. \n \n-\tCaptured company’s first design wins with OEM and channel accounts for Intel Bluetooth wireless technology. \n-\tGrew IT services and support revenue to $20M. \n-\tEstablished and grew enterprise systems management VAR channel to generate $5.8M in annual revenue for LANDesk Software (128% increase in sales). \n-\tRanked as top sales producer with 230% of sales target, representing $6.9M in revenue, for network hardware in territory covering Western United States and Canada. Sales Account Manager Intel Corporation September 1999  –  June 2000  (10 months) Hillsboro, Or -\tGrew IT services and support revenue to $20M. Sales Account Manager Intel Corporation September 1999  –  June 2000  (10 months) Hillsboro, Or -\tGrew IT services and support revenue to $20M. Regional Sales Manager Intel Corporation May 1997  –  August 1998  (1 year 4 months) Greater Atlanta Area -\tEstablished and grew enterprise systems management VAR channel to generate $5.8M in annual revenue for LANDesk Software (128% increase in sales). Regional Sales Manager Intel Corporation May 1997  –  August 1998  (1 year 4 months) Greater Atlanta Area -\tEstablished and grew enterprise systems management VAR channel to generate $5.8M in annual revenue for LANDesk Software (128% increase in sales). Channel Sales Manager Intel Corporation November 1995  –  May 1997  (1 year 7 months) Hillsboro, OR -\tRanked as top sales producer with 230% of sales target, representing $6.9M in revenue, for network hardware in territory covering Western United States and Canada. Channel Sales Manager Intel Corporation November 1995  –  May 1997  (1 year 7 months) Hillsboro, OR -\tRanked as top sales producer with 230% of sales target, representing $6.9M in revenue, for network hardware in territory covering Western United States and Canada. Languages   Skills Entrepreneurial... Executive Management International Business Graphic Design Vector Illustration Published Author Online Publishing Online Sales New Business Development Channel Management Channel Marketing OEM Patent Strategy Patent Drafting HTML + CSS Product Development Product Management Marketing Strategy Mobile Applications Application Development Cloud Computing iPhone development android Mac OS X .NET GPS Photography Social Media Digital Video Digital Imaging Metadata Management Metadata Standards Metadata Account Management Management Consulting Book Design Internet Entrepreneur Entrepreneurial Skills Analytics Application Architecture Software Licensing Intellectual Property Oracle Enterprise... Sales Entrepreneurship Software Development Channel Partners Multi-channel Marketing Android SaaS See 35+     See less Skills  Entrepreneurial... Executive Management International Business Graphic Design Vector Illustration Published Author Online Publishing Online Sales New Business Development Channel Management Channel Marketing OEM Patent Strategy Patent Drafting HTML + CSS Product Development Product Management Marketing Strategy Mobile Applications Application Development Cloud Computing iPhone development android Mac OS X .NET GPS Photography Social Media Digital Video Digital Imaging Metadata Management Metadata Standards Metadata Account Management Management Consulting Book Design Internet Entrepreneur Entrepreneurial Skills Analytics Application Architecture Software Licensing Intellectual Property Oracle Enterprise... Sales Entrepreneurship Software Development Channel Partners Multi-channel Marketing Android SaaS See 35+     See less Entrepreneurial... Executive Management International Business Graphic Design Vector Illustration Published Author Online Publishing Online Sales New Business Development Channel Management Channel Marketing OEM Patent Strategy Patent Drafting HTML + CSS Product Development Product Management Marketing Strategy Mobile Applications Application Development Cloud Computing iPhone development android Mac OS X .NET GPS Photography Social Media Digital Video Digital Imaging Metadata Management Metadata Standards Metadata Account Management Management Consulting Book Design Internet Entrepreneur Entrepreneurial Skills Analytics Application Architecture Software Licensing Intellectual Property Oracle Enterprise... Sales Entrepreneurship Software Development Channel Partners Multi-channel Marketing Android SaaS See 35+     See less Entrepreneurial... Executive Management International Business Graphic Design Vector Illustration Published Author Online Publishing Online Sales New Business Development Channel Management Channel Marketing OEM Patent Strategy Patent Drafting HTML + CSS Product Development Product Management Marketing Strategy Mobile Applications Application Development Cloud Computing iPhone development android Mac OS X .NET GPS Photography Social Media Digital Video Digital Imaging Metadata Management Metadata Standards Metadata Account Management Management Consulting Book Design Internet Entrepreneur Entrepreneurial Skills Analytics Application Architecture Software Licensing Intellectual Property Oracle Enterprise... Sales Entrepreneurship Software Development Channel Partners Multi-channel Marketing Android SaaS See 35+     See less Education Oregon State University Business Administration Oregon State University Business Administration Oregon State University Business Administration Oregon State University Business Administration Honors & Awards ", "Skills Go-to-market Strategy Strategic Partnerships Cloud Computing Data Center Wireless Demand Generation Channel Partners Business Development Lead Generation Product Development Direct Sales Marketing Channel Enterprise Software Analytics Product Management Strategy Sales Management Account Management New Business Development See 6+     See less Skills  Go-to-market Strategy Strategic Partnerships Cloud Computing Data Center Wireless Demand Generation Channel Partners Business Development Lead Generation Product Development Direct Sales Marketing Channel Enterprise Software Analytics Product Management Strategy Sales Management Account Management New Business Development See 6+     See less Go-to-market Strategy Strategic Partnerships Cloud Computing Data Center Wireless Demand Generation Channel Partners Business Development Lead Generation Product Development Direct Sales Marketing Channel Enterprise Software Analytics Product Management Strategy Sales Management Account Management New Business Development See 6+     See less Go-to-market Strategy Strategic Partnerships Cloud Computing Data Center Wireless Demand Generation Channel Partners Business Development Lead Generation Product Development Direct Sales Marketing Channel Enterprise Software Analytics Product Management Strategy Sales Management Account Management New Business Development See 6+     See less ", "Summary Business and results oriented sales & marketing professional  \n \n20+ years international B2B Sales & Marketing experience in High Tech industry \n(Intel Corporation, ValorConseil SAS (Microsoft Cloud partner) and EFI (Electronics for Imaging)) \n \n(Business development  \nB2B Sales & negociation at different organization levels  \nSales channel management  \nMarketing plans design, implementation & follow up  \nHigh tech (PC, server, wireless, networking, software, print) products \nCloud Computing) \n \nFrench, English & Spanish professional fluency Summary Business and results oriented sales & marketing professional  \n \n20+ years international B2B Sales & Marketing experience in High Tech industry \n(Intel Corporation, ValorConseil SAS (Microsoft Cloud partner) and EFI (Electronics for Imaging)) \n \n(Business development  \nB2B Sales & negociation at different organization levels  \nSales channel management  \nMarketing plans design, implementation & follow up  \nHigh tech (PC, server, wireless, networking, software, print) products \nCloud Computing) \n \nFrench, English & Spanish professional fluency Business and results oriented sales & marketing professional  \n \n20+ years international B2B Sales & Marketing experience in High Tech industry \n(Intel Corporation, ValorConseil SAS (Microsoft Cloud partner) and EFI (Electronics for Imaging)) \n \n(Business development  \nB2B Sales & negociation at different organization levels  \nSales channel management  \nMarketing plans design, implementation & follow up  \nHigh tech (PC, server, wireless, networking, software, print) products \nCloud Computing) \n \nFrench, English & Spanish professional fluency Business and results oriented sales & marketing professional  \n \n20+ years international B2B Sales & Marketing experience in High Tech industry \n(Intel Corporation, ValorConseil SAS (Microsoft Cloud partner) and EFI (Electronics for Imaging)) \n \n(Business development  \nB2B Sales & negociation at different organization levels  \nSales channel management  \nMarketing plans design, implementation & follow up  \nHigh tech (PC, server, wireless, networking, software, print) products \nCloud Computing) \n \nFrench, English & Spanish professional fluency Experience Management & Marketing trainer and coach IIM (Internet & Multimedia Institute) September 2013  – Present (2 years) Paris Area, France Development and delivery of several courses to Master students (Digital Communications Management), including  \n- Startup : Strategy & Business Plan, Business Launch \n- Market & Consumer studies \n- Competitive strategies \n- Product and Services offering \n- Project Management \n- Negotiation \n- Presenting for action \n- Human Resource optimization \n- Team management \n- Big Data Marketing Management, Marketing & Sales Consultant Independent January 2013  – Present (2 years 8 months) Paris Area, France Sales Development Manager EFI January 2012  –  December 2012  (1 year) Paris Area, France Business Development Cloud Computing and Mobility ValorConseil SAS September 2010  –  April 2012  (1 year 8 months) Paris Area, France Channel Marketing Manager Intel Corporation 2002  –  2004  (2 years) France Network products sales manager Intel Corporation 2001  –  2002  (1 year) France Distribution Business Manager Intel Corporation 1998  –  2000  (2 years) France Branded Products Sales Manager Intel Corporation January 1997  –  December 1998  (2 years) France Spain & Portugal Management & Marketing trainer and coach IIM (Internet & Multimedia Institute) September 2013  – Present (2 years) Paris Area, France Development and delivery of several courses to Master students (Digital Communications Management), including  \n- Startup : Strategy & Business Plan, Business Launch \n- Market & Consumer studies \n- Competitive strategies \n- Product and Services offering \n- Project Management \n- Negotiation \n- Presenting for action \n- Human Resource optimization \n- Team management \n- Big Data Marketing Management & Marketing trainer and coach IIM (Internet & Multimedia Institute) September 2013  – Present (2 years) Paris Area, France Development and delivery of several courses to Master students (Digital Communications Management), including  \n- Startup : Strategy & Business Plan, Business Launch \n- Market & Consumer studies \n- Competitive strategies \n- Product and Services offering \n- Project Management \n- Negotiation \n- Presenting for action \n- Human Resource optimization \n- Team management \n- Big Data Marketing Management, Marketing & Sales Consultant Independent January 2013  – Present (2 years 8 months) Paris Area, France Management, Marketing & Sales Consultant Independent January 2013  – Present (2 years 8 months) Paris Area, France Sales Development Manager EFI January 2012  –  December 2012  (1 year) Paris Area, France Sales Development Manager EFI January 2012  –  December 2012  (1 year) Paris Area, France Business Development Cloud Computing and Mobility ValorConseil SAS September 2010  –  April 2012  (1 year 8 months) Paris Area, France Business Development Cloud Computing and Mobility ValorConseil SAS September 2010  –  April 2012  (1 year 8 months) Paris Area, France Channel Marketing Manager Intel Corporation 2002  –  2004  (2 years) France Channel Marketing Manager Intel Corporation 2002  –  2004  (2 years) France Network products sales manager Intel Corporation 2001  –  2002  (1 year) France Network products sales manager Intel Corporation 2001  –  2002  (1 year) France Distribution Business Manager Intel Corporation 1998  –  2000  (2 years) France Distribution Business Manager Intel Corporation 1998  –  2000  (2 years) France Branded Products Sales Manager Intel Corporation January 1997  –  December 1998  (2 years) France Spain & Portugal Branded Products Sales Manager Intel Corporation January 1997  –  December 1998  (2 years) France Spain & Portugal Languages English Full professional proficiency French Native or bilingual proficiency Spanish Native or bilingual proficiency English Full professional proficiency French Native or bilingual proficiency Spanish Native or bilingual proficiency English Full professional proficiency French Native or bilingual proficiency Spanish Native or bilingual proficiency Full professional proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Business Development Cloud Computing Channel Partners Go-to-market Strategy Solution Selling Sales Management Channel New Business Development Managed Services Account Management Multi-channel Marketing International Sales Management Business Alliances SaaS Wireless Team Management Field Marketing Negotiation Wide Format Printing Salesforce.com Enterprise Software Program Management Product Marketing Strategy Direct Sales Professional Services Start-ups Product Management Strategic Partnerships Networking Cross-functional Team... Lead Generation Demand Generation Channel Management Public Speaking Languages Marketing Management Small Business Sales Presentations Microsoft Technologies Intel Mobile Devices Pre-sales Software Industry Sales Sales Operations Key Account Management Management Consulting B2B See 35+     See less Skills  Business Development Cloud Computing Channel Partners Go-to-market Strategy Solution Selling Sales Management Channel New Business Development Managed Services Account Management Multi-channel Marketing International Sales Management Business Alliances SaaS Wireless Team Management Field Marketing Negotiation Wide Format Printing Salesforce.com Enterprise Software Program Management Product Marketing Strategy Direct Sales Professional Services Start-ups Product Management Strategic Partnerships Networking Cross-functional Team... Lead Generation Demand Generation Channel Management Public Speaking Languages Marketing Management Small Business Sales Presentations Microsoft Technologies Intel Mobile Devices Pre-sales Software Industry Sales Sales Operations Key Account Management Management Consulting B2B See 35+     See less Business Development Cloud Computing Channel Partners Go-to-market Strategy Solution Selling Sales Management Channel New Business Development Managed Services Account Management Multi-channel Marketing International Sales Management Business Alliances SaaS Wireless Team Management Field Marketing Negotiation Wide Format Printing Salesforce.com Enterprise Software Program Management Product Marketing Strategy Direct Sales Professional Services Start-ups Product Management Strategic Partnerships Networking Cross-functional Team... Lead Generation Demand Generation Channel Management Public Speaking Languages Marketing Management Small Business Sales Presentations Microsoft Technologies Intel Mobile Devices Pre-sales Software Industry Sales Sales Operations Key Account Management Management Consulting B2B See 35+     See less Business Development Cloud Computing Channel Partners Go-to-market Strategy Solution Selling Sales Management Channel New Business Development Managed Services Account Management Multi-channel Marketing International Sales Management Business Alliances SaaS Wireless Team Management Field Marketing Negotiation Wide Format Printing Salesforce.com Enterprise Software Program Management Product Marketing Strategy Direct Sales Professional Services Start-ups Product Management Strategic Partnerships Networking Cross-functional Team... Lead Generation Demand Generation Channel Management Public Speaking Languages Marketing Management Small Business Sales Presentations Microsoft Technologies Intel Mobile Devices Pre-sales Software Industry Sales Sales Operations Key Account Management Management Consulting B2B See 35+     See less "]}