{"position": "Sales Operations Manager", "company": "Intel Corporation", "profiles": ["Experience Retired Intel Corporation Sales Operations Manager Intel Corporation January 2010  –  January 2014  (4 years 1 month) Aannapolis, Maryland ASMO Administrative Manager Intel Corporation September 1980  –  January 2010  (29 years 5 months) Retired Intel Corporation Retired Intel Corporation Sales Operations Manager Intel Corporation January 2010  –  January 2014  (4 years 1 month) Aannapolis, Maryland Sales Operations Manager Intel Corporation January 2010  –  January 2014  (4 years 1 month) Aannapolis, Maryland ASMO Administrative Manager Intel Corporation September 1980  –  January 2010  (29 years 5 months) ASMO Administrative Manager Intel Corporation September 1980  –  January 2010  (29 years 5 months) Skills Program Management Semiconductors Verilog Cross-functional Team... JMP Product Management Go-to-market Strategy Product Marketing Mobile Devices Strategic Partnerships Business Alliances Enterprise Software Intel Channel Partners Competitive Analysis Skills  Program Management Semiconductors Verilog Cross-functional Team... JMP Product Management Go-to-market Strategy Product Marketing Mobile Devices Strategic Partnerships Business Alliances Enterprise Software Intel Channel Partners Competitive Analysis Program Management Semiconductors Verilog Cross-functional Team... JMP Product Management Go-to-market Strategy Product Marketing Mobile Devices Strategic Partnerships Business Alliances Enterprise Software Intel Channel Partners Competitive Analysis Program Management Semiconductors Verilog Cross-functional Team... JMP Product Management Go-to-market Strategy Product Marketing Mobile Devices Strategic Partnerships Business Alliances Enterprise Software Intel Channel Partners Competitive Analysis ", "Summary I like making things work better and do so with an unusual, dual career blend in corporate and family services settings. In the corporate world, I am a customer-focused Project Manager and leverage my attention to detail, adaptability, solid communication skills, and ability to liaise effectively between business and IS staff. As a PM, I build systems and tools to collect and analyze complicated data; use the results to develop appropriate metrics to enable effective decision making; and lead related process improvement projects. In the family services world, I am passionate about helping parents learn effective ways to raise children who thrive. I accomplish this by teaching a proven, research-based parenting approach and providing a counseling practice aimed at removing each client’s obstacles to success. \n \nProject Manager strengths: \n• Agile project management (RUP) \n• Stakeholder interviewing/requirements gathering \n• Use case scenario and test script development \n• Metrics tracking and reporting systems \n• Business Process Management (BPM)/Business Process Reengineering (BPR) \n• Workflow mapping \n• Operational analytics \n• Data aggregation/consolidation \n \nMarriage and Family Therapy strengths: \n• Relationship building and strengthening \n• Individual, couple, and family therapy \n• Emotional intelligence \n• Mindfulness \n• Re-regulation strategies \n• Parenting education and coaching \n• Integration of brain development principles, connection, and empathy to improve treatment outcomes \n \nShared strengths: \n• Conflict resolution \n• Training and workshop facilitation Summary I like making things work better and do so with an unusual, dual career blend in corporate and family services settings. In the corporate world, I am a customer-focused Project Manager and leverage my attention to detail, adaptability, solid communication skills, and ability to liaise effectively between business and IS staff. As a PM, I build systems and tools to collect and analyze complicated data; use the results to develop appropriate metrics to enable effective decision making; and lead related process improvement projects. In the family services world, I am passionate about helping parents learn effective ways to raise children who thrive. I accomplish this by teaching a proven, research-based parenting approach and providing a counseling practice aimed at removing each client’s obstacles to success. \n \nProject Manager strengths: \n• Agile project management (RUP) \n• Stakeholder interviewing/requirements gathering \n• Use case scenario and test script development \n• Metrics tracking and reporting systems \n• Business Process Management (BPM)/Business Process Reengineering (BPR) \n• Workflow mapping \n• Operational analytics \n• Data aggregation/consolidation \n \nMarriage and Family Therapy strengths: \n• Relationship building and strengthening \n• Individual, couple, and family therapy \n• Emotional intelligence \n• Mindfulness \n• Re-regulation strategies \n• Parenting education and coaching \n• Integration of brain development principles, connection, and empathy to improve treatment outcomes \n \nShared strengths: \n• Conflict resolution \n• Training and workshop facilitation I like making things work better and do so with an unusual, dual career blend in corporate and family services settings. In the corporate world, I am a customer-focused Project Manager and leverage my attention to detail, adaptability, solid communication skills, and ability to liaise effectively between business and IS staff. As a PM, I build systems and tools to collect and analyze complicated data; use the results to develop appropriate metrics to enable effective decision making; and lead related process improvement projects. In the family services world, I am passionate about helping parents learn effective ways to raise children who thrive. I accomplish this by teaching a proven, research-based parenting approach and providing a counseling practice aimed at removing each client’s obstacles to success. \n \nProject Manager strengths: \n• Agile project management (RUP) \n• Stakeholder interviewing/requirements gathering \n• Use case scenario and test script development \n• Metrics tracking and reporting systems \n• Business Process Management (BPM)/Business Process Reengineering (BPR) \n• Workflow mapping \n• Operational analytics \n• Data aggregation/consolidation \n \nMarriage and Family Therapy strengths: \n• Relationship building and strengthening \n• Individual, couple, and family therapy \n• Emotional intelligence \n• Mindfulness \n• Re-regulation strategies \n• Parenting education and coaching \n• Integration of brain development principles, connection, and empathy to improve treatment outcomes \n \nShared strengths: \n• Conflict resolution \n• Training and workshop facilitation I like making things work better and do so with an unusual, dual career blend in corporate and family services settings. In the corporate world, I am a customer-focused Project Manager and leverage my attention to detail, adaptability, solid communication skills, and ability to liaise effectively between business and IS staff. As a PM, I build systems and tools to collect and analyze complicated data; use the results to develop appropriate metrics to enable effective decision making; and lead related process improvement projects. In the family services world, I am passionate about helping parents learn effective ways to raise children who thrive. I accomplish this by teaching a proven, research-based parenting approach and providing a counseling practice aimed at removing each client’s obstacles to success. \n \nProject Manager strengths: \n• Agile project management (RUP) \n• Stakeholder interviewing/requirements gathering \n• Use case scenario and test script development \n• Metrics tracking and reporting systems \n• Business Process Management (BPM)/Business Process Reengineering (BPR) \n• Workflow mapping \n• Operational analytics \n• Data aggregation/consolidation \n \nMarriage and Family Therapy strengths: \n• Relationship building and strengthening \n• Individual, couple, and family therapy \n• Emotional intelligence \n• Mindfulness \n• Re-regulation strategies \n• Parenting education and coaching \n• Integration of brain development principles, connection, and empathy to improve treatment outcomes \n \nShared strengths: \n• Conflict resolution \n• Training and workshop facilitation Languages Spanish Spanish Spanish Skills Cross-functional Team... Project Management Business Analysis Requirements Gathering Business Process Process Improvement Software Documentation Biotechnology Strategy Business Process... Management Clinical Trials Business Strategy Integration CRM Consulting Analytics Analysis Leadership Pharmaceutical Industry See 5+     See less Skills  Cross-functional Team... Project Management Business Analysis Requirements Gathering Business Process Process Improvement Software Documentation Biotechnology Strategy Business Process... Management Clinical Trials Business Strategy Integration CRM Consulting Analytics Analysis Leadership Pharmaceutical Industry See 5+     See less Cross-functional Team... Project Management Business Analysis Requirements Gathering Business Process Process Improvement Software Documentation Biotechnology Strategy Business Process... Management Clinical Trials Business Strategy Integration CRM Consulting Analytics Analysis Leadership Pharmaceutical Industry See 5+     See less Cross-functional Team... Project Management Business Analysis Requirements Gathering Business Process Process Improvement Software Documentation Biotechnology Strategy Business Process... Management Clinical Trials Business Strategy Integration CRM Consulting Analytics Analysis Leadership Pharmaceutical Industry See 5+     See less Honors & Awards ", "Experience Sales Operations Manager Intel Corporation May 2000  – Present (15 years 4 months) Sales Operations Manager Intel Corporation May 2000  – Present (15 years 4 months) Sales Operations Manager Intel Corporation May 2000  – Present (15 years 4 months) Skills Cross-functional Team... Leadership Management Process Improvement Program Management Skills  Cross-functional Team... Leadership Management Process Improvement Program Management Cross-functional Team... Leadership Management Process Improvement Program Management Cross-functional Team... Leadership Management Process Improvement Program Management Education Arizona State University Master of Business Administration (MBA),  Supply chain Wayne State University Bachelor of Science (BS),  Finance , General Arizona State University Master of Business Administration (MBA),  Supply chain Arizona State University Master of Business Administration (MBA),  Supply chain Arizona State University Master of Business Administration (MBA),  Supply chain Wayne State University Bachelor of Science (BS),  Finance , General Wayne State University Bachelor of Science (BS),  Finance , General Wayne State University Bachelor of Science (BS),  Finance , General ", "Experience Sales Operations Manager Intel Corporation July 2014  – Present (1 year 2 months) Program Manager Intel Corporation December 2004  –  June 2014  (9 years 7 months) Sales Operations Manager Intel Corporation July 2014  – Present (1 year 2 months) Sales Operations Manager Intel Corporation July 2014  – Present (1 year 2 months) Program Manager Intel Corporation December 2004  –  June 2014  (9 years 7 months) Program Manager Intel Corporation December 2004  –  June 2014  (9 years 7 months) Skills Intel Semiconductors Semiconductor Industry Processors SoC ASIC Cross-functional Team... Embedded Systems Program Management IC Go-to-market Strategy Product Management Debugging Microprocessors Product Marketing Computer Architecture Technical Marketing Wireless Product Lifecycle... Device Drivers Competitive Analysis See 6+     See less Skills  Intel Semiconductors Semiconductor Industry Processors SoC ASIC Cross-functional Team... Embedded Systems Program Management IC Go-to-market Strategy Product Management Debugging Microprocessors Product Marketing Computer Architecture Technical Marketing Wireless Product Lifecycle... Device Drivers Competitive Analysis See 6+     See less Intel Semiconductors Semiconductor Industry Processors SoC ASIC Cross-functional Team... Embedded Systems Program Management IC Go-to-market Strategy Product Management Debugging Microprocessors Product Marketing Computer Architecture Technical Marketing Wireless Product Lifecycle... Device Drivers Competitive Analysis See 6+     See less Intel Semiconductors Semiconductor Industry Processors SoC ASIC Cross-functional Team... Embedded Systems Program Management IC Go-to-market Strategy Product Management Debugging Microprocessors Product Marketing Computer Architecture Technical Marketing Wireless Product Lifecycle... Device Drivers Competitive Analysis See 6+     See less Education California State University-Dominguez Hills Bachelor of Science (B.S.),  Business Administration and Management , General 1988  – 1991 California State University-Dominguez Hills Bachelor of Science (B.S.),  Business Administration and Management , General 1988  – 1991 California State University-Dominguez Hills Bachelor of Science (B.S.),  Business Administration and Management , General 1988  – 1991 California State University-Dominguez Hills Bachelor of Science (B.S.),  Business Administration and Management , General 1988  – 1991 ", "Summary Experienced people and project manager with over 30 years of IT experience in internal software development, h/w, OS and email product support. 9 years Business operational experience supporting internal app deployments with a particular interest in the supply chain. Currently managing the deployment of Salesforce.com and internal Social media (JIVE). \n \nSpecialties: People development, management and Teambuilding. Certified DiSC trainer. Program/project planning and app deployment. Project life cycle, Rapid Development. \nSupply chain improvements. CRM deployment and management. Summary Experienced people and project manager with over 30 years of IT experience in internal software development, h/w, OS and email product support. 9 years Business operational experience supporting internal app deployments with a particular interest in the supply chain. Currently managing the deployment of Salesforce.com and internal Social media (JIVE). \n \nSpecialties: People development, management and Teambuilding. Certified DiSC trainer. Program/project planning and app deployment. Project life cycle, Rapid Development. \nSupply chain improvements. CRM deployment and management. Experienced people and project manager with over 30 years of IT experience in internal software development, h/w, OS and email product support. 9 years Business operational experience supporting internal app deployments with a particular interest in the supply chain. Currently managing the deployment of Salesforce.com and internal Social media (JIVE). \n \nSpecialties: People development, management and Teambuilding. Certified DiSC trainer. Program/project planning and app deployment. Project life cycle, Rapid Development. \nSupply chain improvements. CRM deployment and management. Experienced people and project manager with over 30 years of IT experience in internal software development, h/w, OS and email product support. 9 years Business operational experience supporting internal app deployments with a particular interest in the supply chain. Currently managing the deployment of Salesforce.com and internal Social media (JIVE). \n \nSpecialties: People development, management and Teambuilding. Certified DiSC trainer. Program/project planning and app deployment. Project life cycle, Rapid Development. \nSupply chain improvements. CRM deployment and management. Experience EMEA Sales Operations Cloud CRM manager Intel Corporation (UK) Ltd September 2011  – Present (4 years) Swindon Responsible for the deployment and support of Salesforce.com, JIVE (Social media) and other Sales tools.Managing a team of Business analysts, project managers and data operations analysts. Operation efficiency, support and training manager Intel Corporation (UK) Ltd January 2010  –  September 2011  (1 year 9 months) Responsible for tools support and controls, Outsourcing, Hiring, Organisation efficiency and training for the EMEA SMG Operations team. EMEA Operations CPR & SAP team manager Intel February 2008  –  June 2010  (2 years 5 months) Responsible for evolving the EMEA Operations organisation in line with the SAP replatform and Customer Planning re-engineering programs and I am also responsible for managing the Business analysts working on these projects in EMEA. CBO CEE and LOEM manager Intel October 2006  –  February 2008  (1 year 5 months) Managing a team of Customer businss analysts who are responsible for order and issue management for Intel's Large European OEMs and Distributors in Central and Eastern Europe. Programs manager Intel July 2005  –  October 2006  (1 year 4 months) Responsible for managing a team of project leaders responsible for deploying new tools, hiring and training, outsourcing and new cusotmer supply chain initiatives within the EMEA operations department. Customer fulfillment solutions Rapid Development manager Intel September 2003  –  July 2005  (1 year 11 months) Managed a team of project managers and Business analysts responsible for the development of Worldwide supply chain solutions using rapid development techniques (Extreme programming), working with the IT programming team and other internal IT groups. EMEA Sales Operations Cloud CRM manager Intel Corporation (UK) Ltd September 2011  – Present (4 years) Swindon Responsible for the deployment and support of Salesforce.com, JIVE (Social media) and other Sales tools.Managing a team of Business analysts, project managers and data operations analysts. EMEA Sales Operations Cloud CRM manager Intel Corporation (UK) Ltd September 2011  – Present (4 years) Swindon Responsible for the deployment and support of Salesforce.com, JIVE (Social media) and other Sales tools.Managing a team of Business analysts, project managers and data operations analysts. Operation efficiency, support and training manager Intel Corporation (UK) Ltd January 2010  –  September 2011  (1 year 9 months) Responsible for tools support and controls, Outsourcing, Hiring, Organisation efficiency and training for the EMEA SMG Operations team. Operation efficiency, support and training manager Intel Corporation (UK) Ltd January 2010  –  September 2011  (1 year 9 months) Responsible for tools support and controls, Outsourcing, Hiring, Organisation efficiency and training for the EMEA SMG Operations team. EMEA Operations CPR & SAP team manager Intel February 2008  –  June 2010  (2 years 5 months) Responsible for evolving the EMEA Operations organisation in line with the SAP replatform and Customer Planning re-engineering programs and I am also responsible for managing the Business analysts working on these projects in EMEA. EMEA Operations CPR & SAP team manager Intel February 2008  –  June 2010  (2 years 5 months) Responsible for evolving the EMEA Operations organisation in line with the SAP replatform and Customer Planning re-engineering programs and I am also responsible for managing the Business analysts working on these projects in EMEA. CBO CEE and LOEM manager Intel October 2006  –  February 2008  (1 year 5 months) Managing a team of Customer businss analysts who are responsible for order and issue management for Intel's Large European OEMs and Distributors in Central and Eastern Europe. CBO CEE and LOEM manager Intel October 2006  –  February 2008  (1 year 5 months) Managing a team of Customer businss analysts who are responsible for order and issue management for Intel's Large European OEMs and Distributors in Central and Eastern Europe. Programs manager Intel July 2005  –  October 2006  (1 year 4 months) Responsible for managing a team of project leaders responsible for deploying new tools, hiring and training, outsourcing and new cusotmer supply chain initiatives within the EMEA operations department. Programs manager Intel July 2005  –  October 2006  (1 year 4 months) Responsible for managing a team of project leaders responsible for deploying new tools, hiring and training, outsourcing and new cusotmer supply chain initiatives within the EMEA operations department. Customer fulfillment solutions Rapid Development manager Intel September 2003  –  July 2005  (1 year 11 months) Managed a team of project managers and Business analysts responsible for the development of Worldwide supply chain solutions using rapid development techniques (Extreme programming), working with the IT programming team and other internal IT groups. Customer fulfillment solutions Rapid Development manager Intel September 2003  –  July 2005  (1 year 11 months) Managed a team of project managers and Business analysts responsible for the development of Worldwide supply chain solutions using rapid development techniques (Extreme programming), working with the IT programming team and other internal IT groups. Skills Outsourcing Program Management Business Analysis Business Strategy Competitive Analysis Team Management Project Management Management Project Planning Supply Chain Management Training Leadership Team Building Go-to-market Strategy Cross-functional Team... Product Management See 1+     See less Skills  Outsourcing Program Management Business Analysis Business Strategy Competitive Analysis Team Management Project Management Management Project Planning Supply Chain Management Training Leadership Team Building Go-to-market Strategy Cross-functional Team... Product Management See 1+     See less Outsourcing Program Management Business Analysis Business Strategy Competitive Analysis Team Management Project Management Management Project Planning Supply Chain Management Training Leadership Team Building Go-to-market Strategy Cross-functional Team... Product Management See 1+     See less Outsourcing Program Management Business Analysis Business Strategy Competitive Analysis Team Management Project Management Management Project Planning Supply Chain Management Training Leadership Team Building Go-to-market Strategy Cross-functional Team... Product Management See 1+     See less Education Cranfield University Diploma,  Forensic computing 2006  – 2006 This was a short diploma course that is usually included as part of an MBA qualification. Staffordshire University BSc,  Computer Science 1980  – 1983 Netherthorpe Grammar school 1972  – 1980 Cranfield University Diploma,  Forensic computing 2006  – 2006 This was a short diploma course that is usually included as part of an MBA qualification. Cranfield University Diploma,  Forensic computing 2006  – 2006 This was a short diploma course that is usually included as part of an MBA qualification. Cranfield University Diploma,  Forensic computing 2006  – 2006 This was a short diploma course that is usually included as part of an MBA qualification. Staffordshire University BSc,  Computer Science 1980  – 1983 Staffordshire University BSc,  Computer Science 1980  – 1983 Staffordshire University BSc,  Computer Science 1980  – 1983 Netherthorpe Grammar school 1972  – 1980 Netherthorpe Grammar school 1972  – 1980 Netherthorpe Grammar school 1972  – 1980 ", "Experience Sales Operations Manager Intel Corporation April 2015  – Present (5 months) Sales Operations Manager Intel Corporation April 2015  – Present (5 months) Sales Operations Manager Intel Corporation April 2015  – Present (5 months) Skills Microsoft Office Skills  Microsoft Office Microsoft Office Microsoft Office Education California State University-Sacramento Bachelor of Science (BS),  Finance 1992  – 1998 California State University-Sacramento Bachelor of Science (BS),  Finance 1992  – 1998 California State University-Sacramento Bachelor of Science (BS),  Finance 1992  – 1998 California State University-Sacramento Bachelor of Science (BS),  Finance 1992  – 1998 ", "Experience Sales Operations Manager Intel Corporation January 2010  – Present (5 years 8 months) Folsom, CA Manage a team of analysts (local and international) that oversee global operations for a large multi-national customer Geographic Business Manager Intel Corporation June 2005  –  January 2010  (4 years 8 months) Folsom, CA Managed a team of analysts that oversee total factory forecast requirements for various product lines across all customers. Customer Programs Analyst Intel Corporation December 2002  –  June 2005  (2 years 7 months) Folsom, CA Negotiated, analyzed, and implemented supply chain solutions for Intel customers. Program management. Customer Business Analyst Intel Corporation January 2000  –  December 2002  (3 years) Folsom, CA Forecast, analyze, and support customer requirements. Supported various account teams - direct and distribution channel. Sales Operations Manager Intel Corporation January 2010  – Present (5 years 8 months) Folsom, CA Manage a team of analysts (local and international) that oversee global operations for a large multi-national customer Sales Operations Manager Intel Corporation January 2010  – Present (5 years 8 months) Folsom, CA Manage a team of analysts (local and international) that oversee global operations for a large multi-national customer Geographic Business Manager Intel Corporation June 2005  –  January 2010  (4 years 8 months) Folsom, CA Managed a team of analysts that oversee total factory forecast requirements for various product lines across all customers. Geographic Business Manager Intel Corporation June 2005  –  January 2010  (4 years 8 months) Folsom, CA Managed a team of analysts that oversee total factory forecast requirements for various product lines across all customers. Customer Programs Analyst Intel Corporation December 2002  –  June 2005  (2 years 7 months) Folsom, CA Negotiated, analyzed, and implemented supply chain solutions for Intel customers. Program management. Customer Programs Analyst Intel Corporation December 2002  –  June 2005  (2 years 7 months) Folsom, CA Negotiated, analyzed, and implemented supply chain solutions for Intel customers. Program management. Customer Business Analyst Intel Corporation January 2000  –  December 2002  (3 years) Folsom, CA Forecast, analyze, and support customer requirements. Supported various account teams - direct and distribution channel. Customer Business Analyst Intel Corporation January 2000  –  December 2002  (3 years) Folsom, CA Forecast, analyze, and support customer requirements. Supported various account teams - direct and distribution channel. Skills Leadership Cross-functional Team... Management Program Management Analysis Supply Chain Management Intel Go-to-market Strategy Process Improvement Business Analysis Skills  Leadership Cross-functional Team... Management Program Management Analysis Supply Chain Management Intel Go-to-market Strategy Process Improvement Business Analysis Leadership Cross-functional Team... Management Program Management Analysis Supply Chain Management Intel Go-to-market Strategy Process Improvement Business Analysis Leadership Cross-functional Team... Management Program Management Analysis Supply Chain Management Intel Go-to-market Strategy Process Improvement Business Analysis Education California State University-Sacramento Bachelor's Degree,  Business Administration and Management ,  Marketing 1995  – 1999 Activities and Societies:  Kappa Sigma California State University-Sacramento Bachelor's Degree,  Business Administration and Management ,  Marketing 1995  – 1999 Activities and Societies:  Kappa Sigma California State University-Sacramento Bachelor's Degree,  Business Administration and Management ,  Marketing 1995  – 1999 Activities and Societies:  Kappa Sigma California State University-Sacramento Bachelor's Degree,  Business Administration and Management ,  Marketing 1995  – 1999 Activities and Societies:  Kappa Sigma ", "Experience Reginal Channel Sales & Operations Manager Intel Corporation July 2011  – Present (4 years 2 months) Taiwan APAC Design-win Management (Intel & Distributors)  \n-\tIn charge of defining, executing, monitoring and reporting out APAC embedded Design-win target / performance. \n-\tDrive APAC Design-win tracking tool upgrade requirements as part of WW opportunities tracking tool. \nAPAC Embedded Channel Management \n-\tIn charge of defining, executing, monitoring and reporting out APAC embedded distributor incentive program. Product Line Manager Gemtek Technologies Co. Ltd August 2009  –  January 2012  (2 years 6 months) Software Lead Intrinsyc Software October 2007  –  July 2009  (1 year 10 months) Achievements: \n-Coordinate in Freescale development board testing execution. \n-Development in Samsung 2448 BSP test plan implementation. \n-Coordinate in Seagate product testing execution. \n-Development in Quanta e-paper test plan implementation and coordinate in testing execution. \n-Coordinate in SiRF product testing execution. Software Engineer Mango-research Corporation June 2006  –  October 2007  (1 year 5 months) Achievements: \n-RDS/TMC module prototype. \n-BSP Migration from WinCE 5.0 to WinCE 6.0. \n-GPS testing tool development. Mobile IC FAE Rohm Electronics August 2005  –  May 2006  (10 months) Achievements: \n-Modules integration (firmware) success with: \nCMOS Venders: OmniVision, Micron. \nLCD Venders: GiantPlus, MicroTips, novatek. Senior Testing Engineer / SWPM / System Engineer Lead Inventec January 2003  –  August 2005  (2 years 8 months) Achievements: \n-Laptop Diagnostic System development (Salvation Diagnostic) applied to all models for HP, BenQ, Toshiba, Acer. \n-Image download System development (ITCnD_TS) applied to all models for HP and Toshiba. Reginal Channel Sales & Operations Manager Intel Corporation July 2011  – Present (4 years 2 months) Taiwan APAC Design-win Management (Intel & Distributors)  \n-\tIn charge of defining, executing, monitoring and reporting out APAC embedded Design-win target / performance. \n-\tDrive APAC Design-win tracking tool upgrade requirements as part of WW opportunities tracking tool. \nAPAC Embedded Channel Management \n-\tIn charge of defining, executing, monitoring and reporting out APAC embedded distributor incentive program. Reginal Channel Sales & Operations Manager Intel Corporation July 2011  – Present (4 years 2 months) Taiwan APAC Design-win Management (Intel & Distributors)  \n-\tIn charge of defining, executing, monitoring and reporting out APAC embedded Design-win target / performance. \n-\tDrive APAC Design-win tracking tool upgrade requirements as part of WW opportunities tracking tool. \nAPAC Embedded Channel Management \n-\tIn charge of defining, executing, monitoring and reporting out APAC embedded distributor incentive program. Product Line Manager Gemtek Technologies Co. Ltd August 2009  –  January 2012  (2 years 6 months) Product Line Manager Gemtek Technologies Co. Ltd August 2009  –  January 2012  (2 years 6 months) Software Lead Intrinsyc Software October 2007  –  July 2009  (1 year 10 months) Achievements: \n-Coordinate in Freescale development board testing execution. \n-Development in Samsung 2448 BSP test plan implementation. \n-Coordinate in Seagate product testing execution. \n-Development in Quanta e-paper test plan implementation and coordinate in testing execution. \n-Coordinate in SiRF product testing execution. Software Lead Intrinsyc Software October 2007  –  July 2009  (1 year 10 months) Achievements: \n-Coordinate in Freescale development board testing execution. \n-Development in Samsung 2448 BSP test plan implementation. \n-Coordinate in Seagate product testing execution. \n-Development in Quanta e-paper test plan implementation and coordinate in testing execution. \n-Coordinate in SiRF product testing execution. Software Engineer Mango-research Corporation June 2006  –  October 2007  (1 year 5 months) Achievements: \n-RDS/TMC module prototype. \n-BSP Migration from WinCE 5.0 to WinCE 6.0. \n-GPS testing tool development. Software Engineer Mango-research Corporation June 2006  –  October 2007  (1 year 5 months) Achievements: \n-RDS/TMC module prototype. \n-BSP Migration from WinCE 5.0 to WinCE 6.0. \n-GPS testing tool development. Mobile IC FAE Rohm Electronics August 2005  –  May 2006  (10 months) Achievements: \n-Modules integration (firmware) success with: \nCMOS Venders: OmniVision, Micron. \nLCD Venders: GiantPlus, MicroTips, novatek. Mobile IC FAE Rohm Electronics August 2005  –  May 2006  (10 months) Achievements: \n-Modules integration (firmware) success with: \nCMOS Venders: OmniVision, Micron. \nLCD Venders: GiantPlus, MicroTips, novatek. Senior Testing Engineer / SWPM / System Engineer Lead Inventec January 2003  –  August 2005  (2 years 8 months) Achievements: \n-Laptop Diagnostic System development (Salvation Diagnostic) applied to all models for HP, BenQ, Toshiba, Acer. \n-Image download System development (ITCnD_TS) applied to all models for HP and Toshiba. Senior Testing Engineer / SWPM / System Engineer Lead Inventec January 2003  –  August 2005  (2 years 8 months) Achievements: \n-Laptop Diagnostic System development (Salvation Diagnostic) applied to all models for HP, BenQ, Toshiba, Acer. \n-Image download System development (ITCnD_TS) applied to all models for HP and Toshiba. Skills Embedded Systems Mobile Devices Integration Product Management Product Marketing Cross-functional Team... Product Development Embedded Software Firmware Testing Management Channel Partners Business Strategy Team Management Team Leadership Project Management Strategy Market Analysis Competitive Analysis Vendor Management New Business Development International Business Market Research International Sales Strategic Planning Marketing Management Sales Management See 12+     See less Skills  Embedded Systems Mobile Devices Integration Product Management Product Marketing Cross-functional Team... Product Development Embedded Software Firmware Testing Management Channel Partners Business Strategy Team Management Team Leadership Project Management Strategy Market Analysis Competitive Analysis Vendor Management New Business Development International Business Market Research International Sales Strategic Planning Marketing Management Sales Management See 12+     See less Embedded Systems Mobile Devices Integration Product Management Product Marketing Cross-functional Team... Product Development Embedded Software Firmware Testing Management Channel Partners Business Strategy Team Management Team Leadership Project Management Strategy Market Analysis Competitive Analysis Vendor Management New Business Development International Business Market Research International Sales Strategic Planning Marketing Management Sales Management See 12+     See less Embedded Systems Mobile Devices Integration Product Management Product Marketing Cross-functional Team... Product Development Embedded Software Firmware Testing Management Channel Partners Business Strategy Team Management Team Leadership Project Management Strategy Market Analysis Competitive Analysis Vendor Management New Business Development International Business Market Research International Sales Strategic Planning Marketing Management Sales Management See 12+     See less Education National Chengchi University MBA,  Marketing 2007  – 2011 MBA - Marketing Simon Fraser University BS,  Computer Science 1997  – 2002 National Chengchi University MBA,  Marketing 2007  – 2011 MBA - Marketing National Chengchi University MBA,  Marketing 2007  – 2011 MBA - Marketing National Chengchi University MBA,  Marketing 2007  – 2011 MBA - Marketing Simon Fraser University BS,  Computer Science 1997  – 2002 Simon Fraser University BS,  Computer Science 1997  – 2002 Simon Fraser University BS,  Computer Science 1997  – 2002 Honors & Awards Additional Honors & Awards Project Management Professional (PMP) Additional Honors & Awards Project Management Professional (PMP) Additional Honors & Awards Project Management Professional (PMP) Additional Honors & Awards Project Management Professional (PMP) ", "Experience Sales Operations Self-employed February 1999  – Present (16 years 7 months) Director Cisco 1999  – Present (16 years) Sr Sales Ops Manager VMware March 2011  –  March 2014  (3 years 1 month) Sales Operations Manager Intel Corporation May 1995  –  January 1999  (3 years 9 months) Sales Operations Self-employed February 1999  – Present (16 years 7 months) Sales Operations Self-employed February 1999  – Present (16 years 7 months) Director Cisco 1999  – Present (16 years) Director Cisco 1999  – Present (16 years) Sr Sales Ops Manager VMware March 2011  –  March 2014  (3 years 1 month) Sr Sales Ops Manager VMware March 2011  –  March 2014  (3 years 1 month) Sales Operations Manager Intel Corporation May 1995  –  January 1999  (3 years 9 months) Sales Operations Manager Intel Corporation May 1995  –  January 1999  (3 years 9 months) Education San Francisco State University Bachelor of Arts (B.A.),  Economics 1990  – 1994 Activities and Societies:  Alpha Phi Omega San Francisco State University Bachelor of Arts (B.A.),  Economics 1990  – 1994 Activities and Societies:  Alpha Phi Omega San Francisco State University Bachelor of Arts (B.A.),  Economics 1990  – 1994 Activities and Societies:  Alpha Phi Omega San Francisco State University Bachelor of Arts (B.A.),  Economics 1990  – 1994 Activities and Societies:  Alpha Phi Omega ", "Experience Sales Operations Manager Intel Corporation November 2013  – Present (1 year 10 months) São Paulo Area, Brazil Business Intelligence Program Manager Intel Corporation April 2010  –  November 2013  (3 years 8 months) São Paulo Area, Brazil As the Business Intelligence Program Manager, my role is to drive the BI program and projects in alignment with the corporate strategy, manage the development team (25 developers and consultants) from a funding and resourcing perspective, organize the project environment with project development tools and documentation.  e-Business Project Manager Intel Corporation October 2004  –  April 2010  (5 years 7 months) São Paulo Area, Brazil As the Latin America e-business project manager, Im responsible from bridging the business group requirements to the development team and deliver market and sales intelligence reports, support sales forecasting, business planning and sales teams efficiency. CRM Pre-Sales Oracle February 2003  –  September 2004  (1 year 8 months) São Paulo Area, Brazil Internship at the CRM and ERP sales consulting area (pre-sales). Product (ERP / CRM) specialist. Activities developed on business systems research, development and presentation of solutions and products to fit the customer’s business requirements, search and management of sales opportunities and commercial events; \n Sales Operations Manager Intel Corporation November 2013  – Present (1 year 10 months) São Paulo Area, Brazil Sales Operations Manager Intel Corporation November 2013  – Present (1 year 10 months) São Paulo Area, Brazil Business Intelligence Program Manager Intel Corporation April 2010  –  November 2013  (3 years 8 months) São Paulo Area, Brazil As the Business Intelligence Program Manager, my role is to drive the BI program and projects in alignment with the corporate strategy, manage the development team (25 developers and consultants) from a funding and resourcing perspective, organize the project environment with project development tools and documentation.  Business Intelligence Program Manager Intel Corporation April 2010  –  November 2013  (3 years 8 months) São Paulo Area, Brazil As the Business Intelligence Program Manager, my role is to drive the BI program and projects in alignment with the corporate strategy, manage the development team (25 developers and consultants) from a funding and resourcing perspective, organize the project environment with project development tools and documentation.  e-Business Project Manager Intel Corporation October 2004  –  April 2010  (5 years 7 months) São Paulo Area, Brazil As the Latin America e-business project manager, Im responsible from bridging the business group requirements to the development team and deliver market and sales intelligence reports, support sales forecasting, business planning and sales teams efficiency. e-Business Project Manager Intel Corporation October 2004  –  April 2010  (5 years 7 months) São Paulo Area, Brazil As the Latin America e-business project manager, Im responsible from bridging the business group requirements to the development team and deliver market and sales intelligence reports, support sales forecasting, business planning and sales teams efficiency. CRM Pre-Sales Oracle February 2003  –  September 2004  (1 year 8 months) São Paulo Area, Brazil Internship at the CRM and ERP sales consulting area (pre-sales). Product (ERP / CRM) specialist. Activities developed on business systems research, development and presentation of solutions and products to fit the customer’s business requirements, search and management of sales opportunities and commercial events; \n CRM Pre-Sales Oracle February 2003  –  September 2004  (1 year 8 months) São Paulo Area, Brazil Internship at the CRM and ERP sales consulting area (pre-sales). Product (ERP / CRM) specialist. Activities developed on business systems research, development and presentation of solutions and products to fit the customer’s business requirements, search and management of sales opportunities and commercial events; \n Languages English Full professional proficiency Spanish Limited working proficiency Portuguese Native or bilingual proficiency English Full professional proficiency Spanish Limited working proficiency Portuguese Native or bilingual proficiency English Full professional proficiency Spanish Limited working proficiency Portuguese Native or bilingual proficiency Full professional proficiency Limited working proficiency Native or bilingual proficiency Skills Fluent English Software Project... Business Intelligence CRM Team Leadership Team Management English Project Management Product Management Business Analysis Business Strategy Competitive Analysis Cross-functional Team... Go-to-market Strategy Management Pre-sales Program Management Sales Operations Software Documentation See 4+     See less Skills  Fluent English Software Project... Business Intelligence CRM Team Leadership Team Management English Project Management Product Management Business Analysis Business Strategy Competitive Analysis Cross-functional Team... Go-to-market Strategy Management Pre-sales Program Management Sales Operations Software Documentation See 4+     See less Fluent English Software Project... Business Intelligence CRM Team Leadership Team Management English Project Management Product Management Business Analysis Business Strategy Competitive Analysis Cross-functional Team... Go-to-market Strategy Management Pre-sales Program Management Sales Operations Software Documentation See 4+     See less Fluent English Software Project... Business Intelligence CRM Team Leadership Team Management English Project Management Product Management Business Analysis Business Strategy Competitive Analysis Cross-functional Team... Go-to-market Strategy Management Pre-sales Program Management Sales Operations Software Documentation See 4+     See less Education Fundação Getulio Vargas Master of Business Administration (MBA),  Marketing 2015  – 2017 Fundação Vanzolini - USP Project Management 2010  – 2010 Universidade Presbiteriana Mackenzie Bachelor of Information Technology,  Strategic Planning 2001  – 2006 Fundação Getulio Vargas Master of Business Administration (MBA),  Marketing 2015  – 2017 Fundação Getulio Vargas Master of Business Administration (MBA),  Marketing 2015  – 2017 Fundação Getulio Vargas Master of Business Administration (MBA),  Marketing 2015  – 2017 Fundação Vanzolini - USP Project Management 2010  – 2010 Fundação Vanzolini - USP Project Management 2010  – 2010 Fundação Vanzolini - USP Project Management 2010  – 2010 Universidade Presbiteriana Mackenzie Bachelor of Information Technology,  Strategic Planning 2001  – 2006 Universidade Presbiteriana Mackenzie Bachelor of Information Technology,  Strategic Planning 2001  – 2006 Universidade Presbiteriana Mackenzie Bachelor of Information Technology,  Strategic Planning 2001  – 2006 ", "Experience Sales Operations Manager Intel Corporation June 2014  – Present (1 year 3 months) Senior Inventory Analyst Intel Corporation August 2012  –  June 2014  (1 year 11 months) Supply Demand Manager Apple June 2009  –  August 2012  (3 years 3 months) Customer Planning Manager Numonyx March 2008  –  June 2009  (1 year 4 months) Supply Chain Manager Intel October 2005  –  March 2008  (2 years 6 months) Product Marketing Engineer Intel April 2003  –  October 2005  (2 years 7 months) Planning Analyst Intel October 2000  –  April 2003  (2 years 7 months) Sales Operations Manager Intel Corporation June 2014  – Present (1 year 3 months) Sales Operations Manager Intel Corporation June 2014  – Present (1 year 3 months) Senior Inventory Analyst Intel Corporation August 2012  –  June 2014  (1 year 11 months) Senior Inventory Analyst Intel Corporation August 2012  –  June 2014  (1 year 11 months) Supply Demand Manager Apple June 2009  –  August 2012  (3 years 3 months) Supply Demand Manager Apple June 2009  –  August 2012  (3 years 3 months) Customer Planning Manager Numonyx March 2008  –  June 2009  (1 year 4 months) Customer Planning Manager Numonyx March 2008  –  June 2009  (1 year 4 months) Supply Chain Manager Intel October 2005  –  March 2008  (2 years 6 months) Supply Chain Manager Intel October 2005  –  March 2008  (2 years 6 months) Product Marketing Engineer Intel April 2003  –  October 2005  (2 years 7 months) Product Marketing Engineer Intel April 2003  –  October 2005  (2 years 7 months) Planning Analyst Intel October 2000  –  April 2003  (2 years 7 months) Planning Analyst Intel October 2000  –  April 2003  (2 years 7 months) Skills Semiconductors IC Wireless Product Marketing Supply Chain Management Supply Chain Demand Planning Consumer Electronics Cross-functional Team... Demand Forecasting Go-to-market Strategy Product Lifecycle... Product Management Project Planning Supply Management Skills  Semiconductors IC Wireless Product Marketing Supply Chain Management Supply Chain Demand Planning Consumer Electronics Cross-functional Team... Demand Forecasting Go-to-market Strategy Product Lifecycle... Product Management Project Planning Supply Management Semiconductors IC Wireless Product Marketing Supply Chain Management Supply Chain Demand Planning Consumer Electronics Cross-functional Team... Demand Forecasting Go-to-market Strategy Product Lifecycle... Product Management Project Planning Supply Management Semiconductors IC Wireless Product Marketing Supply Chain Management Supply Chain Demand Planning Consumer Electronics Cross-functional Team... Demand Forecasting Go-to-market Strategy Product Lifecycle... Product Management Project Planning Supply Management Education California Polytechnic State University-San Luis Obispo 1995  – 2000 California Polytechnic State University-San Luis Obispo 1995  – 2000 California Polytechnic State University-San Luis Obispo 1995  – 2000 California Polytechnic State University-San Luis Obispo 1995  – 2000 ", "Experience Sales Operations Manager Intel Corporation March 2015  – Present (6 months) Folsom Customer Sales Analyst (DWET) Intel Corporation April 2012  – Present (3 years 5 months) Rebate Analyst Intel Corporation February 2010  –  April 2012  (2 years 3 months) Customer Business Analyst Intel Corporation October 2008  –  January 2010  (1 year 4 months) Sales Operations Manager Intel Corporation March 2015  – Present (6 months) Folsom Sales Operations Manager Intel Corporation March 2015  – Present (6 months) Folsom Customer Sales Analyst (DWET) Intel Corporation April 2012  – Present (3 years 5 months) Customer Sales Analyst (DWET) Intel Corporation April 2012  – Present (3 years 5 months) Rebate Analyst Intel Corporation February 2010  –  April 2012  (2 years 3 months) Rebate Analyst Intel Corporation February 2010  –  April 2012  (2 years 3 months) Customer Business Analyst Intel Corporation October 2008  –  January 2010  (1 year 4 months) Customer Business Analyst Intel Corporation October 2008  –  January 2010  (1 year 4 months) Skills Intel Cross-functional Team... Data Analysis Processors Competitive Analysis High Performance... Semiconductor Industry Process Improvement Market Analysis Microprocessors SAP Forecasting Business Analysis Business Intelligence Team Leadership Skills  Intel Cross-functional Team... Data Analysis Processors Competitive Analysis High Performance... Semiconductor Industry Process Improvement Market Analysis Microprocessors SAP Forecasting Business Analysis Business Intelligence Team Leadership Intel Cross-functional Team... Data Analysis Processors Competitive Analysis High Performance... Semiconductor Industry Process Improvement Market Analysis Microprocessors SAP Forecasting Business Analysis Business Intelligence Team Leadership Intel Cross-functional Team... Data Analysis Processors Competitive Analysis High Performance... Semiconductor Industry Process Improvement Market Analysis Microprocessors SAP Forecasting Business Analysis Business Intelligence Team Leadership Education University of Phoenix Master,  Business Administration 2006  – 2008 California State University-Sacramento BS,  Business Administration 1999  – 2006 University of Phoenix Master,  Business Administration 2006  – 2008 University of Phoenix Master,  Business Administration 2006  – 2008 University of Phoenix Master,  Business Administration 2006  – 2008 California State University-Sacramento BS,  Business Administration 1999  – 2006 California State University-Sacramento BS,  Business Administration 1999  – 2006 California State University-Sacramento BS,  Business Administration 1999  – 2006 ", "Skills Program Management Marketing CRM Digital Marketing Email Marketing Social Media Strategic Planning Recruiting Public Speaking Coaching Integrated Marketing Cross-functional Team... Workshop Facilitation Sales Management Social Networking Training Delivery Targeted Advertising Community Sites Database Marketing Program Development Leadership Website Development CMS Training Team Building Community Building Knowldge Management... Content Management... Customer Relationship... Mentoring Entrepreneurship Project Management Organizational... Strategy Team Leadership Nonprofits Web Site Development Social Media Development Presentations Strengths Assessment Brand Clarification Community Outreach Social Media Outreach Educational Outreach See 30+     See less Skills  Program Management Marketing CRM Digital Marketing Email Marketing Social Media Strategic Planning Recruiting Public Speaking Coaching Integrated Marketing Cross-functional Team... Workshop Facilitation Sales Management Social Networking Training Delivery Targeted Advertising Community Sites Database Marketing Program Development Leadership Website Development CMS Training Team Building Community Building Knowldge Management... Content Management... Customer Relationship... Mentoring Entrepreneurship Project Management Organizational... Strategy Team Leadership Nonprofits Web Site Development Social Media Development Presentations Strengths Assessment Brand Clarification Community Outreach Social Media Outreach Educational Outreach See 30+     See less Program Management Marketing CRM Digital Marketing Email Marketing Social Media Strategic Planning Recruiting Public Speaking Coaching Integrated Marketing Cross-functional Team... Workshop Facilitation Sales Management Social Networking Training Delivery Targeted Advertising Community Sites Database Marketing Program Development Leadership Website Development CMS Training Team Building Community Building Knowldge Management... Content Management... Customer Relationship... Mentoring Entrepreneurship Project Management Organizational... Strategy Team Leadership Nonprofits Web Site Development Social Media Development Presentations Strengths Assessment Brand Clarification Community Outreach Social Media Outreach Educational Outreach See 30+     See less Program Management Marketing CRM Digital Marketing Email Marketing Social Media Strategic Planning Recruiting Public Speaking Coaching Integrated Marketing Cross-functional Team... Workshop Facilitation Sales Management Social Networking Training Delivery Targeted Advertising Community Sites Database Marketing Program Development Leadership Website Development CMS Training Team Building Community Building Knowldge Management... Content Management... Customer Relationship... Mentoring Entrepreneurship Project Management Organizational... Strategy Team Leadership Nonprofits Web Site Development Social Media Development Presentations Strengths Assessment Brand Clarification Community Outreach Social Media Outreach Educational Outreach See 30+     See less ", "Experience Sales Business Development Manager Intel Corporation January 2015  – Present (8 months) Phoenix, Arizona Area Sales Business Development Manager Intel Corporation January 2015  – Present (8 months) Phoenix, Arizona Area Sales Business Development Manager Intel Corporation January 2015  – Present (8 months) Phoenix, Arizona Area Skills Business Strategy Go-to-market Strategy Product Launch Product Development Multi-channel Marketing Business Alliances Sales Semiconductors Product Lifecycle... Competitive Analysis Management Marketing Cross-functional Team... Product Marketing IC Business Intelligence Project Management Product Management Positioning Strategy Embedded Systems New Business Development Program Management Leadership Process Improvement Wireless Strategic Partnerships Marketing Strategy Strategic Planning Business Development Demand Generation Start-ups Sales Operations See 18+     See less Skills  Business Strategy Go-to-market Strategy Product Launch Product Development Multi-channel Marketing Business Alliances Sales Semiconductors Product Lifecycle... Competitive Analysis Management Marketing Cross-functional Team... Product Marketing IC Business Intelligence Project Management Product Management Positioning Strategy Embedded Systems New Business Development Program Management Leadership Process Improvement Wireless Strategic Partnerships Marketing Strategy Strategic Planning Business Development Demand Generation Start-ups Sales Operations See 18+     See less Business Strategy Go-to-market Strategy Product Launch Product Development Multi-channel Marketing Business Alliances Sales Semiconductors Product Lifecycle... Competitive Analysis Management Marketing Cross-functional Team... Product Marketing IC Business Intelligence Project Management Product Management Positioning Strategy Embedded Systems New Business Development Program Management Leadership Process Improvement Wireless Strategic Partnerships Marketing Strategy Strategic Planning Business Development Demand Generation Start-ups Sales Operations See 18+     See less Business Strategy Go-to-market Strategy Product Launch Product Development Multi-channel Marketing Business Alliances Sales Semiconductors Product Lifecycle... Competitive Analysis Management Marketing Cross-functional Team... Product Marketing IC Business Intelligence Project Management Product Management Positioning Strategy Embedded Systems New Business Development Program Management Leadership Process Improvement Wireless Strategic Partnerships Marketing Strategy Strategic Planning Business Development Demand Generation Start-ups Sales Operations See 18+     See less Education University of Michigan BSE 1991  – 1995 Arizona State University, W. P. Carey School of Business MBA 2001  – 2002 Massachusetts Institute of Technology Certificate 2014  – 2014 University of Michigan BSE 1991  – 1995 University of Michigan BSE 1991  – 1995 University of Michigan BSE 1991  – 1995 Arizona State University, W. P. Carey School of Business MBA 2001  – 2002 Arizona State University, W. P. Carey School of Business MBA 2001  – 2002 Arizona State University, W. P. Carey School of Business MBA 2001  – 2002 Massachusetts Institute of Technology Certificate 2014  – 2014 Massachusetts Institute of Technology Certificate 2014  – 2014 Massachusetts Institute of Technology Certificate 2014  – 2014 ", "Summary EMEA Sales Operation Manager \n \nWe are setting up, evolving and aligning a range of capabilities that set out to improve the productivity of our sales teams and the experience our customers gain in their interactions with us.This includes CRM, multimedia communications, insight level reporting and customer experience improvements all coming together to create a differentiated connection for our sales teams and customers. Summary EMEA Sales Operation Manager \n \nWe are setting up, evolving and aligning a range of capabilities that set out to improve the productivity of our sales teams and the experience our customers gain in their interactions with us.This includes CRM, multimedia communications, insight level reporting and customer experience improvements all coming together to create a differentiated connection for our sales teams and customers. EMEA Sales Operation Manager \n \nWe are setting up, evolving and aligning a range of capabilities that set out to improve the productivity of our sales teams and the experience our customers gain in their interactions with us.This includes CRM, multimedia communications, insight level reporting and customer experience improvements all coming together to create a differentiated connection for our sales teams and customers. EMEA Sales Operation Manager \n \nWe are setting up, evolving and aligning a range of capabilities that set out to improve the productivity of our sales teams and the experience our customers gain in their interactions with us.This includes CRM, multimedia communications, insight level reporting and customer experience improvements all coming together to create a differentiated connection for our sales teams and customers. Experience Researching the impact of customer experience on business development Customer Experience Focus May 2015  – Present (4 months) Swindon Co-authoring a book focusing on operation of Customer Experience in the digital age. Online Sales Operations Manager Intel Corporation January 2012  – Present (3 years 8 months) Set up the infrastructure and capabilities at our new online sales centre in Gdansk Online Sales Operations Manager Intel January 2011  – Present (4 years 8 months) Gdansk, Pomeranian District, Poland Operations Manager for online sales with Intel in EMEA, responsible for building up the capabilities in Online sales to move beyond telephone communications. IT Intel Corporation November 1981  – Present (33 years 10 months) EMEA IT manager EMEA Sales Operation Manager Intel Corporation March 2014  –  April 2015  (1 year 2 months) UK Managing a cross functional team covering a range of operational activities that drive productivity improvements, business visibility, scale and agility. Sales Ops Manager Intel Corp 2014  –  2015  (1 year) Researching the impact of customer experience on business development Customer Experience Focus May 2015  – Present (4 months) Swindon Co-authoring a book focusing on operation of Customer Experience in the digital age. Researching the impact of customer experience on business development Customer Experience Focus May 2015  – Present (4 months) Swindon Co-authoring a book focusing on operation of Customer Experience in the digital age. Online Sales Operations Manager Intel Corporation January 2012  – Present (3 years 8 months) Set up the infrastructure and capabilities at our new online sales centre in Gdansk Online Sales Operations Manager Intel Corporation January 2012  – Present (3 years 8 months) Set up the infrastructure and capabilities at our new online sales centre in Gdansk Online Sales Operations Manager Intel January 2011  – Present (4 years 8 months) Gdansk, Pomeranian District, Poland Operations Manager for online sales with Intel in EMEA, responsible for building up the capabilities in Online sales to move beyond telephone communications. Online Sales Operations Manager Intel January 2011  – Present (4 years 8 months) Gdansk, Pomeranian District, Poland Operations Manager for online sales with Intel in EMEA, responsible for building up the capabilities in Online sales to move beyond telephone communications. IT Intel Corporation November 1981  – Present (33 years 10 months) EMEA IT manager IT Intel Corporation November 1981  – Present (33 years 10 months) EMEA IT manager EMEA Sales Operation Manager Intel Corporation March 2014  –  April 2015  (1 year 2 months) UK Managing a cross functional team covering a range of operational activities that drive productivity improvements, business visibility, scale and agility. EMEA Sales Operation Manager Intel Corporation March 2014  –  April 2015  (1 year 2 months) UK Managing a cross functional team covering a range of operational activities that drive productivity improvements, business visibility, scale and agility. Sales Ops Manager Intel Corp 2014  –  2015  (1 year) Sales Ops Manager Intel Corp 2014  –  2015  (1 year) Skills Distributed Team... Technical Support Operations Management Vendor Management Telecommunications Management CRM Troubleshooting Sales Security Team Management Strategy Competitive Analysis Business Development Leadership Data Center Operating Systems Cross-functional Team... See 3+     See less Skills  Distributed Team... Technical Support Operations Management Vendor Management Telecommunications Management CRM Troubleshooting Sales Security Team Management Strategy Competitive Analysis Business Development Leadership Data Center Operating Systems Cross-functional Team... See 3+     See less Distributed Team... Technical Support Operations Management Vendor Management Telecommunications Management CRM Troubleshooting Sales Security Team Management Strategy Competitive Analysis Business Development Leadership Data Center Operating Systems Cross-functional Team... See 3+     See less Distributed Team... Technical Support Operations Management Vendor Management Telecommunications Management CRM Troubleshooting Sales Security Team Management Strategy Competitive Analysis Business Development Leadership Data Center Operating Systems Cross-functional Team... See 3+     See less Education The Open University MBA,  Strategy, Knowledge 1998  – 2006 MBA The Open University Master of Business Administration (MBA),  Knowledge Management , Change Management, People Development. , Pass 1998  – 2006 The Open University MBA,  Strategy, Knowledge 1998  – 2006 MBA The Open University MBA,  Strategy, Knowledge 1998  – 2006 MBA The Open University MBA,  Strategy, Knowledge 1998  – 2006 MBA The Open University Master of Business Administration (MBA),  Knowledge Management , Change Management, People Development. , Pass 1998  – 2006 The Open University Master of Business Administration (MBA),  Knowledge Management , Change Management, People Development. , Pass 1998  – 2006 The Open University Master of Business Administration (MBA),  Knowledge Management , Change Management, People Development. , Pass 1998  – 2006 "]}