{"position": "Sales Director", "company": "Intel Corporation", "profiles": ["Languages English Professional working proficiency Spanish Native or bilingual proficiency Portuguese Professional working proficiency English Professional working proficiency Spanish Native or bilingual proficiency Portuguese Professional working proficiency English Professional working proficiency Spanish Native or bilingual proficiency Portuguese Professional working proficiency Professional working proficiency Native or bilingual proficiency Professional working proficiency Skills Sales Product Marketing Product Management Semiconductors Latin America Go-to-market Strategy Cross-functional Team... Competitive Analysis Strategic Partnerships Semiconductor Industry Channel Partners Product Development Intel Telecommunications Enterprise Software Channel International Sales Strategy Management Product Launch Business Alliances Business Development Wireless Consumer Electronics Marketing Strategy Business Strategy Cloud Computing Multi-channel Marketing Marketing Solution Selling Sales Management Team Leadership Start-ups New Business Development Demand Generation See 20+     See less Skills  Sales Product Marketing Product Management Semiconductors Latin America Go-to-market Strategy Cross-functional Team... Competitive Analysis Strategic Partnerships Semiconductor Industry Channel Partners Product Development Intel Telecommunications Enterprise Software Channel International Sales Strategy Management Product Launch Business Alliances Business Development Wireless Consumer Electronics Marketing Strategy Business Strategy Cloud Computing Multi-channel Marketing Marketing Solution Selling Sales Management Team Leadership Start-ups New Business Development Demand Generation See 20+     See less Sales Product Marketing Product Management Semiconductors Latin America Go-to-market Strategy Cross-functional Team... Competitive Analysis Strategic Partnerships Semiconductor Industry Channel Partners Product Development Intel Telecommunications Enterprise Software Channel International Sales Strategy Management Product Launch Business Alliances Business Development Wireless Consumer Electronics Marketing Strategy Business Strategy Cloud Computing Multi-channel Marketing Marketing Solution Selling Sales Management Team Leadership Start-ups New Business Development Demand Generation See 20+     See less Sales Product Marketing Product Management Semiconductors Latin America Go-to-market Strategy Cross-functional Team... Competitive Analysis Strategic Partnerships Semiconductor Industry Channel Partners Product Development Intel Telecommunications Enterprise Software Channel International Sales Strategy Management Product Launch Business Alliances Business Development Wireless Consumer Electronics Marketing Strategy Business Strategy Cloud Computing Multi-channel Marketing Marketing Solution Selling Sales Management Team Leadership Start-ups New Business Development Demand Generation See 20+     See less ", "Experience Europe and Central Eastern Europe Solid State Drive Sales Director Intel Corporation January 2012  – Present (3 years 8 months) EUR REGIONAL SALES MANAGER INTEL CORPORATION April 1994  –  January 2012  (17 years 10 months) Europe and Central Eastern Europe Solid State Drive Sales Director Intel Corporation January 2012  – Present (3 years 8 months) Europe and Central Eastern Europe Solid State Drive Sales Director Intel Corporation January 2012  – Present (3 years 8 months) EUR REGIONAL SALES MANAGER INTEL CORPORATION April 1994  –  January 2012  (17 years 10 months) EUR REGIONAL SALES MANAGER INTEL CORPORATION April 1994  –  January 2012  (17 years 10 months) Languages Slovenian Russian Spanish German Croatian Serbian Slovenian Russian Spanish German Croatian Serbian Slovenian Russian Spanish German Croatian Serbian Skills Semiconductors OEM Product Marketing Channel Marketing Go-to-market Strategy Strategic Partnerships Multi-channel Marketing Sales Management Channel Oracle Enterprise... Consumer Electronics Business Alliances Cross-functional Team... Product Management B2B Business Development Channel Partners Channel Sales Cloud Computing Competitive Analysis Demand Generation Enterprise Software Intel International Sales Key Account Management Marketing Management Mobile Devices P Partner Management Product Development Product Launch Product Lifecycle... Sales Enablement Solution Selling Start-ups Storage Strategy Wireless See 23+     See less Skills  Semiconductors OEM Product Marketing Channel Marketing Go-to-market Strategy Strategic Partnerships Multi-channel Marketing Sales Management Channel Oracle Enterprise... Consumer Electronics Business Alliances Cross-functional Team... Product Management B2B Business Development Channel Partners Channel Sales Cloud Computing Competitive Analysis Demand Generation Enterprise Software Intel International Sales Key Account Management Marketing Management Mobile Devices P Partner Management Product Development Product Launch Product Lifecycle... Sales Enablement Solution Selling Start-ups Storage Strategy Wireless See 23+     See less Semiconductors OEM Product Marketing Channel Marketing Go-to-market Strategy Strategic Partnerships Multi-channel Marketing Sales Management Channel Oracle Enterprise... Consumer Electronics Business Alliances Cross-functional Team... Product Management B2B Business Development Channel Partners Channel Sales Cloud Computing Competitive Analysis Demand Generation Enterprise Software Intel International Sales Key Account Management Marketing Management Mobile Devices P Partner Management Product Development Product Launch Product Lifecycle... Sales Enablement Solution Selling Start-ups Storage Strategy Wireless See 23+     See less Semiconductors OEM Product Marketing Channel Marketing Go-to-market Strategy Strategic Partnerships Multi-channel Marketing Sales Management Channel Oracle Enterprise... Consumer Electronics Business Alliances Cross-functional Team... Product Management B2B Business Development Channel Partners Channel Sales Cloud Computing Competitive Analysis Demand Generation Enterprise Software Intel International Sales Key Account Management Marketing Management Mobile Devices P Partner Management Product Development Product Launch Product Lifecycle... Sales Enablement Solution Selling Start-ups Storage Strategy Wireless See 23+     See less Education Oxford Brookes University Oxford Brookes University Oxford Brookes University Oxford Brookes University ", "Summary Mark is responsible for Seagate's $1.7bn global branded business. The business designs, manufacturers and sells storage solutions for consumers and small businesses in every part of the world. The product range incorporates desktop and laptop external storage products, mobile and wifi devices, ruggedised external storage products, home NAS solutions, business NAS solutions and rack mount storage solutions. Seagate are the world's second largest supplier of these solutions globally, using both the Seagate and Lacie brands in all major channels to market. \n \nBefore this Mark ran Seagate's business in EMEA responsible for the direct management of sales and marketing across Europe, Middle East and Africa. Customers spanned from direct PC and consumer electronics manufacturers, to channel partners. Mark also has responsibility for Seagate's global distribution channel helping lead and shape the strategy and delivery of the business across the three geographic regions worldwide. He also was a key member of the global team supporting the integration of the acquisitions of Xyratex and LSI. \n \nPreviously Mark worked at Vodafone for three years as the Director of Global Data Channels in Group Business Marketing. He was responsible for defining and enabling channels to the business market for Vodafone's products and services. Particular attention was given to accelerating the growth of mobile data solutions through indirect channels during this period, as well as supporting the integration of 3G services into notebook computers. \n \nMark has 14 years experience in the computer industry, much of it working in direct and indirect sales roles. Prior to Vodafone he spent 10 years at Intel where he set up and ran the European Channel Marketing organisation responsible for delivering programmes to thousands of resellers, distributors and integrators. He also ran the UK Sales and Marketing organisation focussed on delivering results in the corporate, retail, SME and Government sectors. Summary Mark is responsible for Seagate's $1.7bn global branded business. The business designs, manufacturers and sells storage solutions for consumers and small businesses in every part of the world. The product range incorporates desktop and laptop external storage products, mobile and wifi devices, ruggedised external storage products, home NAS solutions, business NAS solutions and rack mount storage solutions. Seagate are the world's second largest supplier of these solutions globally, using both the Seagate and Lacie brands in all major channels to market. \n \nBefore this Mark ran Seagate's business in EMEA responsible for the direct management of sales and marketing across Europe, Middle East and Africa. Customers spanned from direct PC and consumer electronics manufacturers, to channel partners. Mark also has responsibility for Seagate's global distribution channel helping lead and shape the strategy and delivery of the business across the three geographic regions worldwide. He also was a key member of the global team supporting the integration of the acquisitions of Xyratex and LSI. \n \nPreviously Mark worked at Vodafone for three years as the Director of Global Data Channels in Group Business Marketing. He was responsible for defining and enabling channels to the business market for Vodafone's products and services. Particular attention was given to accelerating the growth of mobile data solutions through indirect channels during this period, as well as supporting the integration of 3G services into notebook computers. \n \nMark has 14 years experience in the computer industry, much of it working in direct and indirect sales roles. Prior to Vodafone he spent 10 years at Intel where he set up and ran the European Channel Marketing organisation responsible for delivering programmes to thousands of resellers, distributors and integrators. He also ran the UK Sales and Marketing organisation focussed on delivering results in the corporate, retail, SME and Government sectors. Mark is responsible for Seagate's $1.7bn global branded business. The business designs, manufacturers and sells storage solutions for consumers and small businesses in every part of the world. The product range incorporates desktop and laptop external storage products, mobile and wifi devices, ruggedised external storage products, home NAS solutions, business NAS solutions and rack mount storage solutions. Seagate are the world's second largest supplier of these solutions globally, using both the Seagate and Lacie brands in all major channels to market. \n \nBefore this Mark ran Seagate's business in EMEA responsible for the direct management of sales and marketing across Europe, Middle East and Africa. Customers spanned from direct PC and consumer electronics manufacturers, to channel partners. Mark also has responsibility for Seagate's global distribution channel helping lead and shape the strategy and delivery of the business across the three geographic regions worldwide. He also was a key member of the global team supporting the integration of the acquisitions of Xyratex and LSI. \n \nPreviously Mark worked at Vodafone for three years as the Director of Global Data Channels in Group Business Marketing. He was responsible for defining and enabling channels to the business market for Vodafone's products and services. Particular attention was given to accelerating the growth of mobile data solutions through indirect channels during this period, as well as supporting the integration of 3G services into notebook computers. \n \nMark has 14 years experience in the computer industry, much of it working in direct and indirect sales roles. Prior to Vodafone he spent 10 years at Intel where he set up and ran the European Channel Marketing organisation responsible for delivering programmes to thousands of resellers, distributors and integrators. He also ran the UK Sales and Marketing organisation focussed on delivering results in the corporate, retail, SME and Government sectors. Mark is responsible for Seagate's $1.7bn global branded business. The business designs, manufacturers and sells storage solutions for consumers and small businesses in every part of the world. The product range incorporates desktop and laptop external storage products, mobile and wifi devices, ruggedised external storage products, home NAS solutions, business NAS solutions and rack mount storage solutions. Seagate are the world's second largest supplier of these solutions globally, using both the Seagate and Lacie brands in all major channels to market. \n \nBefore this Mark ran Seagate's business in EMEA responsible for the direct management of sales and marketing across Europe, Middle East and Africa. Customers spanned from direct PC and consumer electronics manufacturers, to channel partners. Mark also has responsibility for Seagate's global distribution channel helping lead and shape the strategy and delivery of the business across the three geographic regions worldwide. He also was a key member of the global team supporting the integration of the acquisitions of Xyratex and LSI. \n \nPreviously Mark worked at Vodafone for three years as the Director of Global Data Channels in Group Business Marketing. He was responsible for defining and enabling channels to the business market for Vodafone's products and services. Particular attention was given to accelerating the growth of mobile data solutions through indirect channels during this period, as well as supporting the integration of 3G services into notebook computers. \n \nMark has 14 years experience in the computer industry, much of it working in direct and indirect sales roles. Prior to Vodafone he spent 10 years at Intel where he set up and ran the European Channel Marketing organisation responsible for delivering programmes to thousands of resellers, distributors and integrators. He also ran the UK Sales and Marketing organisation focussed on delivering results in the corporate, retail, SME and Government sectors. Experience Senior Vice President, Branded Products Group Seagate Technology September 2014  – Present (1 year) UK and USA Responsible for Seagate's $1.5bn global branded business. The business designs, manufacturers and sells storage solutions for consumers and small businesses in every part of the world. Vice President, EMEA Seagate Technology September 2007  –  August 2014  (7 years) UK Responsible for Seagate's sales and marketing activites in Europe, Russia, Middle East and Africa. Also responsible for Seagate's Global Distribution channel business. Global Director of Indirect Data Channels Vodafone Plc June 2004  –  July 2007  (3 years 2 months) EMEA Sales Director Intel Corporation September 1994  –  May 2004  (9 years 9 months) Corporate Account Manager Central Point Software 1992  –  1994  (2 years) Corporate Account Manager Corporate Software 1990  –  1992  (2 years) Marketing Manager Syngenta Crop Protection September 1986  –  March 1990  (3 years 7 months) Senior Vice President, Branded Products Group Seagate Technology September 2014  – Present (1 year) UK and USA Responsible for Seagate's $1.5bn global branded business. The business designs, manufacturers and sells storage solutions for consumers and small businesses in every part of the world. Senior Vice President, Branded Products Group Seagate Technology September 2014  – Present (1 year) UK and USA Responsible for Seagate's $1.5bn global branded business. The business designs, manufacturers and sells storage solutions for consumers and small businesses in every part of the world. Vice President, EMEA Seagate Technology September 2007  –  August 2014  (7 years) UK Responsible for Seagate's sales and marketing activites in Europe, Russia, Middle East and Africa. Also responsible for Seagate's Global Distribution channel business. Vice President, EMEA Seagate Technology September 2007  –  August 2014  (7 years) UK Responsible for Seagate's sales and marketing activites in Europe, Russia, Middle East and Africa. Also responsible for Seagate's Global Distribution channel business. Global Director of Indirect Data Channels Vodafone Plc June 2004  –  July 2007  (3 years 2 months) Global Director of Indirect Data Channels Vodafone Plc June 2004  –  July 2007  (3 years 2 months) EMEA Sales Director Intel Corporation September 1994  –  May 2004  (9 years 9 months) EMEA Sales Director Intel Corporation September 1994  –  May 2004  (9 years 9 months) Corporate Account Manager Central Point Software 1992  –  1994  (2 years) Corporate Account Manager Central Point Software 1992  –  1994  (2 years) Corporate Account Manager Corporate Software 1990  –  1992  (2 years) Corporate Account Manager Corporate Software 1990  –  1992  (2 years) Marketing Manager Syngenta Crop Protection September 1986  –  March 1990  (3 years 7 months) Marketing Manager Syngenta Crop Protection September 1986  –  March 1990  (3 years 7 months) Skills Channel Management Channel Marketing Channel EMEA OEM Sales Management Resellers Multi-channel Marketing Channel Partners Strategic Partnerships Strategy Storage Product Marketing Integration Oracle Enterprise... B2B Business Alliances Business Development Consumer Electronics Go-to-market Strategy Management Product Management Selling Social Media Marketing Software Industry Solution Selling Start-ups See 12+     See less Skills  Channel Management Channel Marketing Channel EMEA OEM Sales Management Resellers Multi-channel Marketing Channel Partners Strategic Partnerships Strategy Storage Product Marketing Integration Oracle Enterprise... B2B Business Alliances Business Development Consumer Electronics Go-to-market Strategy Management Product Management Selling Social Media Marketing Software Industry Solution Selling Start-ups See 12+     See less Channel Management Channel Marketing Channel EMEA OEM Sales Management Resellers Multi-channel Marketing Channel Partners Strategic Partnerships Strategy Storage Product Marketing Integration Oracle Enterprise... B2B Business Alliances Business Development Consumer Electronics Go-to-market Strategy Management Product Management Selling Social Media Marketing Software Industry Solution Selling Start-ups See 12+     See less Channel Management Channel Marketing Channel EMEA OEM Sales Management Resellers Multi-channel Marketing Channel Partners Strategic Partnerships Strategy Storage Product Marketing Integration Oracle Enterprise... B2B Business Alliances Business Development Consumer Electronics Go-to-market Strategy Management Product Management Selling Social Media Marketing Software Industry Solution Selling Start-ups See 12+     See less Education The University of Salford BSc 1983  – 1986 The University of Salford BSc 1983  – 1986 The University of Salford BSc 1983  – 1986 The University of Salford BSc 1983  – 1986 ", "Languages Thai Thai Thai Skills Security Product Management Program Management Cloud Computing Information Security Network Security Enterprise Architecture Software Project... Professional Services IT Strategy ITIL Networking Risk Management System Architecture Information Security... Solution Architecture IT Management Firewalls Microsoft SQL Server Software Development Architecture Management Agile Methodologies IT Operations Enterprise Software Unix Databases Outsourcing Requirements Analysis See 14+     See less Skills  Security Product Management Program Management Cloud Computing Information Security Network Security Enterprise Architecture Software Project... Professional Services IT Strategy ITIL Networking Risk Management System Architecture Information Security... Solution Architecture IT Management Firewalls Microsoft SQL Server Software Development Architecture Management Agile Methodologies IT Operations Enterprise Software Unix Databases Outsourcing Requirements Analysis See 14+     See less Security Product Management Program Management Cloud Computing Information Security Network Security Enterprise Architecture Software Project... Professional Services IT Strategy ITIL Networking Risk Management System Architecture Information Security... Solution Architecture IT Management Firewalls Microsoft SQL Server Software Development Architecture Management Agile Methodologies IT Operations Enterprise Software Unix Databases Outsourcing Requirements Analysis See 14+     See less Security Product Management Program Management Cloud Computing Information Security Network Security Enterprise Architecture Software Project... Professional Services IT Strategy ITIL Networking Risk Management System Architecture Information Security... Solution Architecture IT Management Firewalls Microsoft SQL Server Software Development Architecture Management Agile Methodologies IT Operations Enterprise Software Unix Databases Outsourcing Requirements Analysis See 14+     See less Honors & Awards ", "Languages Hindi Bengali English Native or bilingual proficiency Hindi Bengali English Native or bilingual proficiency Hindi Bengali English Native or bilingual proficiency Native or bilingual proficiency Skills Business Development Strategic Partnerships Cloud Computing Management Business Alliances Account Management SOA Channel Partners Enterprise Software New Business Development Strategy Solution Selling Leadership Business Process... Partner Management Program Management SaaS Security Sales Enablement Sales Management Pre-sales Software Sales Executive Management International Sales Outsourcing Consulting Integration Channel Management Software Industry Professional Services Business Intelligence Go-to-market Strategy Product Management Managed Services Lead Generation Cloud Security Sales Change Management Demand Generation Start-ups Sales Process Business Management Big Data CRM People Management Business Analysis APIs IT Strategy See 33+     See less Skills  Business Development Strategic Partnerships Cloud Computing Management Business Alliances Account Management SOA Channel Partners Enterprise Software New Business Development Strategy Solution Selling Leadership Business Process... Partner Management Program Management SaaS Security Sales Enablement Sales Management Pre-sales Software Sales Executive Management International Sales Outsourcing Consulting Integration Channel Management Software Industry Professional Services Business Intelligence Go-to-market Strategy Product Management Managed Services Lead Generation Cloud Security Sales Change Management Demand Generation Start-ups Sales Process Business Management Big Data CRM People Management Business Analysis APIs IT Strategy See 33+     See less Business Development Strategic Partnerships Cloud Computing Management Business Alliances Account Management SOA Channel Partners Enterprise Software New Business Development Strategy Solution Selling Leadership Business Process... Partner Management Program Management SaaS Security Sales Enablement Sales Management Pre-sales Software Sales Executive Management International Sales Outsourcing Consulting Integration Channel Management Software Industry Professional Services Business Intelligence Go-to-market Strategy Product Management Managed Services Lead Generation Cloud Security Sales Change Management Demand Generation Start-ups Sales Process Business Management Big Data CRM People Management Business Analysis APIs IT Strategy See 33+     See less Business Development Strategic Partnerships Cloud Computing Management Business Alliances Account Management SOA Channel Partners Enterprise Software New Business Development Strategy Solution Selling Leadership Business Process... Partner Management Program Management SaaS Security Sales Enablement Sales Management Pre-sales Software Sales Executive Management International Sales Outsourcing Consulting Integration Channel Management Software Industry Professional Services Business Intelligence Go-to-market Strategy Product Management Managed Services Lead Generation Cloud Security Sales Change Management Demand Generation Start-ups Sales Process Business Management Big Data CRM People Management Business Analysis APIs IT Strategy See 33+     See less Honors & Awards ", "Skills Cross-functional Team... Go-to-market Strategy Product Management Product Marketing Semiconductors Competitive Analysis Consumer Electronics Product Launch Multi-channel Marketing Demand Generation Business Alliances Channel Partners Strategic Partnerships Partner Management Product Lifecycle... Sales Management See 2+     See less Skills  Cross-functional Team... Go-to-market Strategy Product Management Product Marketing Semiconductors Competitive Analysis Consumer Electronics Product Launch Multi-channel Marketing Demand Generation Business Alliances Channel Partners Strategic Partnerships Partner Management Product Lifecycle... Sales Management See 2+     See less Cross-functional Team... Go-to-market Strategy Product Management Product Marketing Semiconductors Competitive Analysis Consumer Electronics Product Launch Multi-channel Marketing Demand Generation Business Alliances Channel Partners Strategic Partnerships Partner Management Product Lifecycle... Sales Management See 2+     See less Cross-functional Team... Go-to-market Strategy Product Management Product Marketing Semiconductors Competitive Analysis Consumer Electronics Product Launch Multi-channel Marketing Demand Generation Business Alliances Channel Partners Strategic Partnerships Partner Management Product Lifecycle... Sales Management See 2+     See less ", "Skills Product Management Enterprise Software Business Intelligence Go-to-market Strategy Cloud Computing SaaS Product Marketing Program Management Analytics Product Lifecycle... Cross-functional Team... Big Data Leadership Strategy Strategic Partnerships Semiconductors Software Development Mobile Devices Start-ups Business Alliances Business Development Competitive Analysis Partner Management Professional Services See 9+     See less Skills  Product Management Enterprise Software Business Intelligence Go-to-market Strategy Cloud Computing SaaS Product Marketing Program Management Analytics Product Lifecycle... Cross-functional Team... Big Data Leadership Strategy Strategic Partnerships Semiconductors Software Development Mobile Devices Start-ups Business Alliances Business Development Competitive Analysis Partner Management Professional Services See 9+     See less Product Management Enterprise Software Business Intelligence Go-to-market Strategy Cloud Computing SaaS Product Marketing Program Management Analytics Product Lifecycle... Cross-functional Team... Big Data Leadership Strategy Strategic Partnerships Semiconductors Software Development Mobile Devices Start-ups Business Alliances Business Development Competitive Analysis Partner Management Professional Services See 9+     See less Product Management Enterprise Software Business Intelligence Go-to-market Strategy Cloud Computing SaaS Product Marketing Program Management Analytics Product Lifecycle... Cross-functional Team... Big Data Leadership Strategy Strategic Partnerships Semiconductors Software Development Mobile Devices Start-ups Business Alliances Business Development Competitive Analysis Partner Management Professional Services See 9+     See less ", "Languages Italian Elementary proficiency French Elementary proficiency English Native or bilingual proficiency Arabic Elementary proficiency Italian Elementary proficiency French Elementary proficiency English Native or bilingual proficiency Arabic Elementary proficiency Italian Elementary proficiency French Elementary proficiency English Native or bilingual proficiency Arabic Elementary proficiency Elementary proficiency Elementary proficiency Native or bilingual proficiency Elementary proficiency Skills Enterprise Software Channel Partners Solution Selling Sales Leadership Channel Go-to-market Strategy Strategic Partnerships Team Management Partner Management Management SaaS Key Account Management B2B Account Management Sales Management Business Alliances Sales Process Direct Sales Professional Services Product Marketing IT Business Strategy Distribution Strategies CRM Business Analytics Strategy Business Development P&L Management Cloud Computing See 14+     See less Skills  Enterprise Software Channel Partners Solution Selling Sales Leadership Channel Go-to-market Strategy Strategic Partnerships Team Management Partner Management Management SaaS Key Account Management B2B Account Management Sales Management Business Alliances Sales Process Direct Sales Professional Services Product Marketing IT Business Strategy Distribution Strategies CRM Business Analytics Strategy Business Development P&L Management Cloud Computing See 14+     See less Enterprise Software Channel Partners Solution Selling Sales Leadership Channel Go-to-market Strategy Strategic Partnerships Team Management Partner Management Management SaaS Key Account Management B2B Account Management Sales Management Business Alliances Sales Process Direct Sales Professional Services Product Marketing IT Business Strategy Distribution Strategies CRM Business Analytics Strategy Business Development P&L Management Cloud Computing See 14+     See less Enterprise Software Channel Partners Solution Selling Sales Leadership Channel Go-to-market Strategy Strategic Partnerships Team Management Partner Management Management SaaS Key Account Management B2B Account Management Sales Management Business Alliances Sales Process Direct Sales Professional Services Product Marketing IT Business Strategy Distribution Strategies CRM Business Analytics Strategy Business Development P&L Management Cloud Computing See 14+     See less ", "Summary Inspiring global leader that leads with passion to deliver innovative solutions to our customers. Extensive experience in consultative solution selling, managing professional services line of business, and customer services. Experience ranges from venture funded start-ups to very large multinational corporations. \n \nIn her current position, Dawn is the Global Government Industry Sales Director for Intel's Enterprise Solution Sales driving and defining innovative, comprehensive worldwide market and sales programs that include a focus on Smart Cities and Cloud. Summary Inspiring global leader that leads with passion to deliver innovative solutions to our customers. Extensive experience in consultative solution selling, managing professional services line of business, and customer services. Experience ranges from venture funded start-ups to very large multinational corporations. \n \nIn her current position, Dawn is the Global Government Industry Sales Director for Intel's Enterprise Solution Sales driving and defining innovative, comprehensive worldwide market and sales programs that include a focus on Smart Cities and Cloud. Inspiring global leader that leads with passion to deliver innovative solutions to our customers. Extensive experience in consultative solution selling, managing professional services line of business, and customer services. Experience ranges from venture funded start-ups to very large multinational corporations. \n \nIn her current position, Dawn is the Global Government Industry Sales Director for Intel's Enterprise Solution Sales driving and defining innovative, comprehensive worldwide market and sales programs that include a focus on Smart Cities and Cloud. Inspiring global leader that leads with passion to deliver innovative solutions to our customers. Extensive experience in consultative solution selling, managing professional services line of business, and customer services. Experience ranges from venture funded start-ups to very large multinational corporations. \n \nIn her current position, Dawn is the Global Government Industry Sales Director for Intel's Enterprise Solution Sales driving and defining innovative, comprehensive worldwide market and sales programs that include a focus on Smart Cities and Cloud. Experience Global Sales Director Intel Corporation January 2012  – Present (3 years 8 months) Global Sales Director for Enterprise Solution Sales division partnering with the world's largest enterprises and Governments to create business value through effective adoption of Information Technology with a focus on Smart City Innovations. Formed global Government Advisory Council (Board of Advisors) for top Government Officials as a forum to provide Intel insights on Government Technology Solution needs. Global Marketing Director Intel Corporation June 2008  – Present (7 years 3 months) Leadership of globally dispersed team partnering with sales, driving innovation program solution offerings to influence decision makers at top global accounts. Drove scale of the program from $350M to $1.08B a year achieving stretch goals YOY. Drove innovation of the program offerings with new strategies offerings through partnering with key stakeholders. Development and refinement of Access to Experts for top sales engagements and development of the right expertise. Leadership in defining and evangelizing the future direction for scale and impact. Director, Americas Professional Services Intel March 2002  –  June 2008  (6 years 4 months) Boutique consulting division to accelerate the rapid adoption/scale of technology to the market for early adoption working with key partners. Leadership and influencer for management team, Intel Partners and IT Customer Solutions. Developed and drove operational excellence through Financial, Headcount, Business Metrics, P&L and Legal for the Americas. Execution from strategic vision to program planning and implementation for future plans. Mentored and coached field Regional Managers and Program Managers. Drove all Americas sales forecasts and Quarter Business Reviews for vertical communication to VP and Corporation. Drove and developed yearly capital, expense plans and metrics. Legal escalation point for all approvals on terms, business models, for the Americas. Vice President of Global Customer Services DecisionPoint Software 2000  –  2002  (2 years) Portland, Oregon Leader of global dispersed team of service professionals in various areas of consulting and implementations worldwide. Built the services line of business for consulting and technical support. Full P&L responsibility, developing revenue targets, cycle time and productivity. Participated in Board Meetings. Drove the business to the first profitability in the history of the company in Q1 2001. Exceeded profitability and measures by 100%. Sr. Consulting Program Manager IBM 1999  –  2000  (1 year) Directed multi-million dollar consulting projects providing leadership in strategic planning and development of total solutions for end customers. Managed teams from IBM and customers for an integration implementation and innovative solutions beating the competition on performance. Sr. Consulting Program Manager Sequent Computer Systems 1995  –  1999  (4 years) Leadership for solving and managing the largest most complex and demanding system solutions Fortune 500. Defined and architect customer/enterprise programs, direction and strategies for total solutions for large organizations solving complex business problems through technology. Influential in corporate direction and strategies for consulting services. Drove definition and development of first e-commerce click stream data warehouse for 5 business verticals. Sr. Consultant Digital Equipment Corporation 1986  –  1994  (8 years) San Francisco Sr. Program Manager for multi-million dollar, multi-system implementations with complex business and management considerations. Developed and managed implementation plans and team members.Managed of issues and issue resolution to include risk assessment plans versus actual. Consistently met all customer program implementations on budget and time for custom implementations. Global Sales Director Intel Corporation January 2012  – Present (3 years 8 months) Global Sales Director for Enterprise Solution Sales division partnering with the world's largest enterprises and Governments to create business value through effective adoption of Information Technology with a focus on Smart City Innovations. Formed global Government Advisory Council (Board of Advisors) for top Government Officials as a forum to provide Intel insights on Government Technology Solution needs. Global Sales Director Intel Corporation January 2012  – Present (3 years 8 months) Global Sales Director for Enterprise Solution Sales division partnering with the world's largest enterprises and Governments to create business value through effective adoption of Information Technology with a focus on Smart City Innovations. Formed global Government Advisory Council (Board of Advisors) for top Government Officials as a forum to provide Intel insights on Government Technology Solution needs. Global Marketing Director Intel Corporation June 2008  – Present (7 years 3 months) Leadership of globally dispersed team partnering with sales, driving innovation program solution offerings to influence decision makers at top global accounts. Drove scale of the program from $350M to $1.08B a year achieving stretch goals YOY. Drove innovation of the program offerings with new strategies offerings through partnering with key stakeholders. Development and refinement of Access to Experts for top sales engagements and development of the right expertise. Leadership in defining and evangelizing the future direction for scale and impact. Global Marketing Director Intel Corporation June 2008  – Present (7 years 3 months) Leadership of globally dispersed team partnering with sales, driving innovation program solution offerings to influence decision makers at top global accounts. Drove scale of the program from $350M to $1.08B a year achieving stretch goals YOY. Drove innovation of the program offerings with new strategies offerings through partnering with key stakeholders. Development and refinement of Access to Experts for top sales engagements and development of the right expertise. Leadership in defining and evangelizing the future direction for scale and impact. Director, Americas Professional Services Intel March 2002  –  June 2008  (6 years 4 months) Boutique consulting division to accelerate the rapid adoption/scale of technology to the market for early adoption working with key partners. Leadership and influencer for management team, Intel Partners and IT Customer Solutions. Developed and drove operational excellence through Financial, Headcount, Business Metrics, P&L and Legal for the Americas. Execution from strategic vision to program planning and implementation for future plans. Mentored and coached field Regional Managers and Program Managers. Drove all Americas sales forecasts and Quarter Business Reviews for vertical communication to VP and Corporation. Drove and developed yearly capital, expense plans and metrics. Legal escalation point for all approvals on terms, business models, for the Americas. Director, Americas Professional Services Intel March 2002  –  June 2008  (6 years 4 months) Boutique consulting division to accelerate the rapid adoption/scale of technology to the market for early adoption working with key partners. Leadership and influencer for management team, Intel Partners and IT Customer Solutions. Developed and drove operational excellence through Financial, Headcount, Business Metrics, P&L and Legal for the Americas. Execution from strategic vision to program planning and implementation for future plans. Mentored and coached field Regional Managers and Program Managers. Drove all Americas sales forecasts and Quarter Business Reviews for vertical communication to VP and Corporation. Drove and developed yearly capital, expense plans and metrics. Legal escalation point for all approvals on terms, business models, for the Americas. Vice President of Global Customer Services DecisionPoint Software 2000  –  2002  (2 years) Portland, Oregon Leader of global dispersed team of service professionals in various areas of consulting and implementations worldwide. Built the services line of business for consulting and technical support. Full P&L responsibility, developing revenue targets, cycle time and productivity. Participated in Board Meetings. Drove the business to the first profitability in the history of the company in Q1 2001. Exceeded profitability and measures by 100%. Vice President of Global Customer Services DecisionPoint Software 2000  –  2002  (2 years) Portland, Oregon Leader of global dispersed team of service professionals in various areas of consulting and implementations worldwide. Built the services line of business for consulting and technical support. Full P&L responsibility, developing revenue targets, cycle time and productivity. Participated in Board Meetings. Drove the business to the first profitability in the history of the company in Q1 2001. Exceeded profitability and measures by 100%. Sr. Consulting Program Manager IBM 1999  –  2000  (1 year) Directed multi-million dollar consulting projects providing leadership in strategic planning and development of total solutions for end customers. Managed teams from IBM and customers for an integration implementation and innovative solutions beating the competition on performance. Sr. Consulting Program Manager IBM 1999  –  2000  (1 year) Directed multi-million dollar consulting projects providing leadership in strategic planning and development of total solutions for end customers. Managed teams from IBM and customers for an integration implementation and innovative solutions beating the competition on performance. Sr. Consulting Program Manager Sequent Computer Systems 1995  –  1999  (4 years) Leadership for solving and managing the largest most complex and demanding system solutions Fortune 500. Defined and architect customer/enterprise programs, direction and strategies for total solutions for large organizations solving complex business problems through technology. Influential in corporate direction and strategies for consulting services. Drove definition and development of first e-commerce click stream data warehouse for 5 business verticals. Sr. Consulting Program Manager Sequent Computer Systems 1995  –  1999  (4 years) Leadership for solving and managing the largest most complex and demanding system solutions Fortune 500. Defined and architect customer/enterprise programs, direction and strategies for total solutions for large organizations solving complex business problems through technology. Influential in corporate direction and strategies for consulting services. Drove definition and development of first e-commerce click stream data warehouse for 5 business verticals. Sr. Consultant Digital Equipment Corporation 1986  –  1994  (8 years) San Francisco Sr. Program Manager for multi-million dollar, multi-system implementations with complex business and management considerations. Developed and managed implementation plans and team members.Managed of issues and issue resolution to include risk assessment plans versus actual. Consistently met all customer program implementations on budget and time for custom implementations. Sr. Consultant Digital Equipment Corporation 1986  –  1994  (8 years) San Francisco Sr. Program Manager for multi-million dollar, multi-system implementations with complex business and management considerations. Developed and managed implementation plans and team members.Managed of issues and issue resolution to include risk assessment plans versus actual. Consistently met all customer program implementations on budget and time for custom implementations. Skills Go-to-market Strategy Product Management Enterprise Software Cloud Computing Business Alliances Strategic Planning Strategic Partnerships Product Marketing Leadership Management Strategy Competitive Analysis Cross-functional Team... Start-ups SaaS Solution Selling Business Development Demand Generation Program Management Channel Partners See 5+     See less Skills  Go-to-market Strategy Product Management Enterprise Software Cloud Computing Business Alliances Strategic Planning Strategic Partnerships Product Marketing Leadership Management Strategy Competitive Analysis Cross-functional Team... Start-ups SaaS Solution Selling Business Development Demand Generation Program Management Channel Partners See 5+     See less Go-to-market Strategy Product Management Enterprise Software Cloud Computing Business Alliances Strategic Planning Strategic Partnerships Product Marketing Leadership Management Strategy Competitive Analysis Cross-functional Team... Start-ups SaaS Solution Selling Business Development Demand Generation Program Management Channel Partners See 5+     See less Go-to-market Strategy Product Management Enterprise Software Cloud Computing Business Alliances Strategic Planning Strategic Partnerships Product Marketing Leadership Management Strategy Competitive Analysis Cross-functional Team... Start-ups SaaS Solution Selling Business Development Demand Generation Program Management Channel Partners See 5+     See less ", "Summary Strong background in Sales and Marketing of Telecommunications and IT industries \nExcellent Project Management and People Management skills. \n \n \n \nGoals; \nManage a District or Country organization in IT or Telecommunication company  \n \nSpecialties: Management, Coaching, Information Technology, Telecommunications, Marketing and Sales Summary Strong background in Sales and Marketing of Telecommunications and IT industries \nExcellent Project Management and People Management skills. \n \n \n \nGoals; \nManage a District or Country organization in IT or Telecommunication company  \n \nSpecialties: Management, Coaching, Information Technology, Telecommunications, Marketing and Sales Strong background in Sales and Marketing of Telecommunications and IT industries \nExcellent Project Management and People Management skills. \n \n \n \nGoals; \nManage a District or Country organization in IT or Telecommunication company  \n \nSpecialties: Management, Coaching, Information Technology, Telecommunications, Marketing and Sales Strong background in Sales and Marketing of Telecommunications and IT industries \nExcellent Project Management and People Management skills. \n \n \n \nGoals; \nManage a District or Country organization in IT or Telecommunication company  \n \nSpecialties: Management, Coaching, Information Technology, Telecommunications, Marketing and Sales Experience Latin America Channel Sales Director Intel Corporation October 2013  – Present (1 year 11 months) Miami/Fort Lauderdale Area Responsible for Latin American Channels Sales from Distribution, Resellers to Large Format Retail for components and consumption of Intel products. Also responsible for Local integration and Enabling with China and Taiwan ecosystems Latin America Reseller Channel Director Intel Corporation August 2011  –  September 2013  (2 years 2 months) Miami/Fort Lauderdale Area Responsible for Distribution and Local Integration for Latin America Latin America Consumer Director Intel Corporation October 2008  –  September 2011  (3 years) Mexico Responsible for Consumer GTM strategy and execution, for Intel client brands. Responsible for Social Media marketing initiatives and Account management of Multinational OEMs and Retailers Mexico District Marketing Manager Intel Corporation January 2008  –  October 2008  (10 months) Mexico Branding, Demand Generation, Press Relations for Mexico \nAccount management director for Retail and Multinational manufacturers Southern Cone District Marketing Manager Intel Corporation January 2006  –  December 2007  (2 years) Buenos Aires, Argentina Branding, Demand Generation, Press Relations for Argentina, Chile, Bolivia, Paraguay and Uruguay \nAccount management director for Retail and Multinational manufacturers Marketing Director Telecom Personal Paraguay January 2005  –  December 2005  (1 year) Paraguay Branding, Advertising, Product Marketing and Devices Product Marketing Manager Telecom Argentina July 1992  –  December 2004  (12 years 6 months) Buenos Aires, Argentina Responsible for Voice and Data communications product development Technology Teacher Universidad de San Andrés 1997  –  2004  (7 years) Responsible for Technology cathedra for Master in Telecommunications Management Latin America Channel Sales Director Intel Corporation October 2013  – Present (1 year 11 months) Miami/Fort Lauderdale Area Responsible for Latin American Channels Sales from Distribution, Resellers to Large Format Retail for components and consumption of Intel products. Also responsible for Local integration and Enabling with China and Taiwan ecosystems Latin America Channel Sales Director Intel Corporation October 2013  – Present (1 year 11 months) Miami/Fort Lauderdale Area Responsible for Latin American Channels Sales from Distribution, Resellers to Large Format Retail for components and consumption of Intel products. Also responsible for Local integration and Enabling with China and Taiwan ecosystems Latin America Reseller Channel Director Intel Corporation August 2011  –  September 2013  (2 years 2 months) Miami/Fort Lauderdale Area Responsible for Distribution and Local Integration for Latin America Latin America Reseller Channel Director Intel Corporation August 2011  –  September 2013  (2 years 2 months) Miami/Fort Lauderdale Area Responsible for Distribution and Local Integration for Latin America Latin America Consumer Director Intel Corporation October 2008  –  September 2011  (3 years) Mexico Responsible for Consumer GTM strategy and execution, for Intel client brands. Responsible for Social Media marketing initiatives and Account management of Multinational OEMs and Retailers Latin America Consumer Director Intel Corporation October 2008  –  September 2011  (3 years) Mexico Responsible for Consumer GTM strategy and execution, for Intel client brands. Responsible for Social Media marketing initiatives and Account management of Multinational OEMs and Retailers Mexico District Marketing Manager Intel Corporation January 2008  –  October 2008  (10 months) Mexico Branding, Demand Generation, Press Relations for Mexico \nAccount management director for Retail and Multinational manufacturers Mexico District Marketing Manager Intel Corporation January 2008  –  October 2008  (10 months) Mexico Branding, Demand Generation, Press Relations for Mexico \nAccount management director for Retail and Multinational manufacturers Southern Cone District Marketing Manager Intel Corporation January 2006  –  December 2007  (2 years) Buenos Aires, Argentina Branding, Demand Generation, Press Relations for Argentina, Chile, Bolivia, Paraguay and Uruguay \nAccount management director for Retail and Multinational manufacturers Southern Cone District Marketing Manager Intel Corporation January 2006  –  December 2007  (2 years) Buenos Aires, Argentina Branding, Demand Generation, Press Relations for Argentina, Chile, Bolivia, Paraguay and Uruguay \nAccount management director for Retail and Multinational manufacturers Marketing Director Telecom Personal Paraguay January 2005  –  December 2005  (1 year) Paraguay Branding, Advertising, Product Marketing and Devices Marketing Director Telecom Personal Paraguay January 2005  –  December 2005  (1 year) Paraguay Branding, Advertising, Product Marketing and Devices Product Marketing Manager Telecom Argentina July 1992  –  December 2004  (12 years 6 months) Buenos Aires, Argentina Responsible for Voice and Data communications product development Product Marketing Manager Telecom Argentina July 1992  –  December 2004  (12 years 6 months) Buenos Aires, Argentina Responsible for Voice and Data communications product development Technology Teacher Universidad de San Andrés 1997  –  2004  (7 years) Responsible for Technology cathedra for Master in Telecommunications Management Technology Teacher Universidad de San Andrés 1997  –  2004  (7 years) Responsible for Technology cathedra for Master in Telecommunications Management Languages English Native or bilingual proficiency Spanish Native or bilingual proficiency Italian Limited working proficiency English Native or bilingual proficiency Spanish Native or bilingual proficiency Italian Limited working proficiency English Native or bilingual proficiency Spanish Native or bilingual proficiency Italian Limited working proficiency Native or bilingual proficiency Native or bilingual proficiency Limited working proficiency Skills Product Management Marketing Strategy Product Marketing Telecommunications Team Leadership Sales Management Go-to-market Strategy Mobile Devices Leadership Strategic Partnerships Pre-sales Management Competitive Analysis Project Management Account Management Marketing Start-ups Business Strategy Latin America VoIP Wireless Strategy Retail Channel Partners Cross-functional Team... Solution Selling Cloud Computing International Sales Sales Demand Generation Business Development Direct Sales Business Intelligence Social Media Marketing Key Account Management New Business Development Sales Operations See 22+     See less Skills  Product Management Marketing Strategy Product Marketing Telecommunications Team Leadership Sales Management Go-to-market Strategy Mobile Devices Leadership Strategic Partnerships Pre-sales Management Competitive Analysis Project Management Account Management Marketing Start-ups Business Strategy Latin America VoIP Wireless Strategy Retail Channel Partners Cross-functional Team... Solution Selling Cloud Computing International Sales Sales Demand Generation Business Development Direct Sales Business Intelligence Social Media Marketing Key Account Management New Business Development Sales Operations See 22+     See less Product Management Marketing Strategy Product Marketing Telecommunications Team Leadership Sales Management Go-to-market Strategy Mobile Devices Leadership Strategic Partnerships Pre-sales Management Competitive Analysis Project Management Account Management Marketing Start-ups Business Strategy Latin America VoIP Wireless Strategy Retail Channel Partners Cross-functional Team... Solution Selling Cloud Computing International Sales Sales Demand Generation Business Development Direct Sales Business Intelligence Social Media Marketing Key Account Management New Business Development Sales Operations See 22+     See less Product Management Marketing Strategy Product Marketing Telecommunications Team Leadership Sales Management Go-to-market Strategy Mobile Devices Leadership Strategic Partnerships Pre-sales Management Competitive Analysis Project Management Account Management Marketing Start-ups Business Strategy Latin America VoIP Wireless Strategy Retail Channel Partners Cross-functional Team... Solution Selling Cloud Computing International Sales Sales Demand Generation Business Development Direct Sales Business Intelligence Social Media Marketing Key Account Management New Business Development Sales Operations See 22+     See less Education Instituto Tecnológico de Buenos Aires Master's degree,  Telecommunications Management 1995  – 1995 Universidad de 'San Andrés' Master's degree,  Telecommunication Management 1995  – 1995 University of Buenos Aires Digital Switching Specialist,  Telecommunications Engineering , Postgrade 1991  – 1992 Universidad de Buenos Aires Engineer's degree,  Electrical , Electronics and Communications Engineering 1985  – 1991 Instituto Tecnológico de Buenos Aires Master's degree,  Telecommunications Management 1995  – 1995 Instituto Tecnológico de Buenos Aires Master's degree,  Telecommunications Management 1995  – 1995 Instituto Tecnológico de Buenos Aires Master's degree,  Telecommunications Management 1995  – 1995 Universidad de 'San Andrés' Master's degree,  Telecommunication Management 1995  – 1995 Universidad de 'San Andrés' Master's degree,  Telecommunication Management 1995  – 1995 Universidad de 'San Andrés' Master's degree,  Telecommunication Management 1995  – 1995 University of Buenos Aires Digital Switching Specialist,  Telecommunications Engineering , Postgrade 1991  – 1992 University of Buenos Aires Digital Switching Specialist,  Telecommunications Engineering , Postgrade 1991  – 1992 University of Buenos Aires Digital Switching Specialist,  Telecommunications Engineering , Postgrade 1991  – 1992 Universidad de Buenos Aires Engineer's degree,  Electrical , Electronics and Communications Engineering 1985  – 1991 Universidad de Buenos Aires Engineer's degree,  Electrical , Electronics and Communications Engineering 1985  – 1991 Universidad de Buenos Aires Engineer's degree,  Electrical , Electronics and Communications Engineering 1985  – 1991 ", "Skills Product Management Strategic Partnerships Semiconductors Cloud Computing Strategy Program Management Business Development Go-to-market Strategy Management Product Marketing Business Strategy Cross-functional Team... Telecommunications Wireless Enterprise Software Mobile Devices Start-ups See 2+     See less Skills  Product Management Strategic Partnerships Semiconductors Cloud Computing Strategy Program Management Business Development Go-to-market Strategy Management Product Marketing Business Strategy Cross-functional Team... Telecommunications Wireless Enterprise Software Mobile Devices Start-ups See 2+     See less Product Management Strategic Partnerships Semiconductors Cloud Computing Strategy Program Management Business Development Go-to-market Strategy Management Product Marketing Business Strategy Cross-functional Team... Telecommunications Wireless Enterprise Software Mobile Devices Start-ups See 2+     See less Product Management Strategic Partnerships Semiconductors Cloud Computing Strategy Program Management Business Development Go-to-market Strategy Management Product Marketing Business Strategy Cross-functional Team... Telecommunications Wireless Enterprise Software Mobile Devices Start-ups See 2+     See less ", "Experience Global Inside Sales Director Intel Corporation January 2013  – Present (2 years 8 months) Global Sales Operations Director Intel Corporation January 2012  –  January 2013  (1 year 1 month) Global Sales Director Intel Corporation January 2010  –  January 2012  (2 years 1 month) Chandler, AZ Global Business Operations Director Intel Corporation January 2008  –  January 2010  (2 years 1 month) Global Pricing Manager Intel Corporation January 2004  –  January 2008  (4 years 1 month) Finance Intel Corporation December 1999  –  January 2004  (4 years 2 months) Chandler, AZ Business Analyst Freescale Semiconductor January 1997  –  December 1999  (3 years) Tempe, AZ Customer Service Safeway 1991  –  1997  (6 years) Customer Service Safeway 1991  –  1997  (6 years) Global Inside Sales Director Intel Corporation January 2013  – Present (2 years 8 months) Global Inside Sales Director Intel Corporation January 2013  – Present (2 years 8 months) Global Sales Operations Director Intel Corporation January 2012  –  January 2013  (1 year 1 month) Global Sales Operations Director Intel Corporation January 2012  –  January 2013  (1 year 1 month) Global Sales Director Intel Corporation January 2010  –  January 2012  (2 years 1 month) Chandler, AZ Global Sales Director Intel Corporation January 2010  –  January 2012  (2 years 1 month) Chandler, AZ Global Business Operations Director Intel Corporation January 2008  –  January 2010  (2 years 1 month) Global Business Operations Director Intel Corporation January 2008  –  January 2010  (2 years 1 month) Global Pricing Manager Intel Corporation January 2004  –  January 2008  (4 years 1 month) Global Pricing Manager Intel Corporation January 2004  –  January 2008  (4 years 1 month) Finance Intel Corporation December 1999  –  January 2004  (4 years 2 months) Chandler, AZ Finance Intel Corporation December 1999  –  January 2004  (4 years 2 months) Chandler, AZ Business Analyst Freescale Semiconductor January 1997  –  December 1999  (3 years) Tempe, AZ Business Analyst Freescale Semiconductor January 1997  –  December 1999  (3 years) Tempe, AZ Customer Service Safeway 1991  –  1997  (6 years) Customer Service Safeway 1991  –  1997  (6 years) Customer Service Safeway 1991  –  1997  (6 years) Customer Service Safeway 1991  –  1997  (6 years) Languages French French French Skills Semiconductors Product Marketing Cross-functional Team... Product Management Intel Go-to-market Strategy Competitive Analysis Semiconductor Industry Wireless Forecasting Product Launch Program Management Skills  Semiconductors Product Marketing Cross-functional Team... Product Management Intel Go-to-market Strategy Competitive Analysis Semiconductor Industry Wireless Forecasting Product Launch Program Management Semiconductors Product Marketing Cross-functional Team... Product Management Intel Go-to-market Strategy Competitive Analysis Semiconductor Industry Wireless Forecasting Product Launch Program Management Semiconductors Product Marketing Cross-functional Team... Product Management Intel Go-to-market Strategy Competitive Analysis Semiconductor Industry Wireless Forecasting Product Launch Program Management Education Arizona State University Bachelor of Science (BS),  Business Administration and Management , General Arizona State University - W. P. Carey School of Business Master of Business Administration (MBA) Arizona State University Bachelor of Science (BS),  Business Administration and Management , General Arizona State University Bachelor of Science (BS),  Business Administration and Management , General Arizona State University Bachelor of Science (BS),  Business Administration and Management , General Arizona State University - W. P. Carey School of Business Master of Business Administration (MBA) Arizona State University - W. P. Carey School of Business Master of Business Administration (MBA) Arizona State University - W. P. Carey School of Business Master of Business Administration (MBA) ", "Skills Enterprise Software Pre-sales Business Development Management Intel Leadership Sales Product Marketing Product Management Semiconductors Go-to-market Strategy Strategic Partnerships Strategy Mobile Devices Sales Management Channel Partners Cross-functional Team... Account Management Business Alliances Channel See 5+     See less Skills  Enterprise Software Pre-sales Business Development Management Intel Leadership Sales Product Marketing Product Management Semiconductors Go-to-market Strategy Strategic Partnerships Strategy Mobile Devices Sales Management Channel Partners Cross-functional Team... Account Management Business Alliances Channel See 5+     See less Enterprise Software Pre-sales Business Development Management Intel Leadership Sales Product Marketing Product Management Semiconductors Go-to-market Strategy Strategic Partnerships Strategy Mobile Devices Sales Management Channel Partners Cross-functional Team... Account Management Business Alliances Channel See 5+     See less Enterprise Software Pre-sales Business Development Management Intel Leadership Sales Product Marketing Product Management Semiconductors Go-to-market Strategy Strategic Partnerships Strategy Mobile Devices Sales Management Channel Partners Cross-functional Team... Account Management Business Alliances Channel See 5+     See less ", "Summary Colin is the EMEA SMG Chief of Staff and reports to EMEA GM. In this role Colin contributes to and facilitates EMEA business success by smooth management of the GM Office. This includes providing decision-making support and driving implementation of key strategies. He works across all product and sales groups and liaises closely with Chief of Staffs and Execs in HQ and in other Geographies, as well as with external partners. He develops content for key speaking opportunities across EMEA, designed to drive EMEA business opportunities and to raise the profile of Intel in the market. Responsibilities include the planning and execution of high profile Corporate VP’s visits to EMEA. In addition, Colin is expected to co-ordinate GM activities, develop the content for GEO updates, pro-actively driving the EMEA Communications strategy with Employee Communications, plan and coordinate Staff meetings and other senior management meetings / engagements and lead / participate in task forces. \n \nPrior to this he was UK/I Enterprise Sales Director & Ireland Country Manager, responsible for managing Intel’s strategic relationships and market development in UK & Ireland. His focus was managing a team to create demand for Intel platforms via Solutions, new usage models, and ecosystem scaling. The mandate is to bring the benefits of technology to customers by working with industry, governments and development agencies. One of these technologies is Mobile phone technology, which is a particular focus area for Intel.  \n \nColin has over 25 years’ experience in EMEA, UK & Irish Computer industry and joined Intel in 2000. Prior to this he held a number of positions in the computer industry focusing on business development for enterprise solutions in a number of vertical sectors, most of this time was spent in Digital Equipment Corporation. \n \nSpecialties: Strategic Business Development, Government Relations, Marketing, Media Spokeperson, CSR, Education, Business Networking, Business Storytelling Summary Colin is the EMEA SMG Chief of Staff and reports to EMEA GM. In this role Colin contributes to and facilitates EMEA business success by smooth management of the GM Office. This includes providing decision-making support and driving implementation of key strategies. He works across all product and sales groups and liaises closely with Chief of Staffs and Execs in HQ and in other Geographies, as well as with external partners. He develops content for key speaking opportunities across EMEA, designed to drive EMEA business opportunities and to raise the profile of Intel in the market. Responsibilities include the planning and execution of high profile Corporate VP’s visits to EMEA. In addition, Colin is expected to co-ordinate GM activities, develop the content for GEO updates, pro-actively driving the EMEA Communications strategy with Employee Communications, plan and coordinate Staff meetings and other senior management meetings / engagements and lead / participate in task forces. \n \nPrior to this he was UK/I Enterprise Sales Director & Ireland Country Manager, responsible for managing Intel’s strategic relationships and market development in UK & Ireland. His focus was managing a team to create demand for Intel platforms via Solutions, new usage models, and ecosystem scaling. The mandate is to bring the benefits of technology to customers by working with industry, governments and development agencies. One of these technologies is Mobile phone technology, which is a particular focus area for Intel.  \n \nColin has over 25 years’ experience in EMEA, UK & Irish Computer industry and joined Intel in 2000. Prior to this he held a number of positions in the computer industry focusing on business development for enterprise solutions in a number of vertical sectors, most of this time was spent in Digital Equipment Corporation. \n \nSpecialties: Strategic Business Development, Government Relations, Marketing, Media Spokeperson, CSR, Education, Business Networking, Business Storytelling Colin is the EMEA SMG Chief of Staff and reports to EMEA GM. In this role Colin contributes to and facilitates EMEA business success by smooth management of the GM Office. This includes providing decision-making support and driving implementation of key strategies. He works across all product and sales groups and liaises closely with Chief of Staffs and Execs in HQ and in other Geographies, as well as with external partners. He develops content for key speaking opportunities across EMEA, designed to drive EMEA business opportunities and to raise the profile of Intel in the market. Responsibilities include the planning and execution of high profile Corporate VP’s visits to EMEA. In addition, Colin is expected to co-ordinate GM activities, develop the content for GEO updates, pro-actively driving the EMEA Communications strategy with Employee Communications, plan and coordinate Staff meetings and other senior management meetings / engagements and lead / participate in task forces. \n \nPrior to this he was UK/I Enterprise Sales Director & Ireland Country Manager, responsible for managing Intel’s strategic relationships and market development in UK & Ireland. His focus was managing a team to create demand for Intel platforms via Solutions, new usage models, and ecosystem scaling. The mandate is to bring the benefits of technology to customers by working with industry, governments and development agencies. One of these technologies is Mobile phone technology, which is a particular focus area for Intel.  \n \nColin has over 25 years’ experience in EMEA, UK & Irish Computer industry and joined Intel in 2000. Prior to this he held a number of positions in the computer industry focusing on business development for enterprise solutions in a number of vertical sectors, most of this time was spent in Digital Equipment Corporation. \n \nSpecialties: Strategic Business Development, Government Relations, Marketing, Media Spokeperson, CSR, Education, Business Networking, Business Storytelling Colin is the EMEA SMG Chief of Staff and reports to EMEA GM. In this role Colin contributes to and facilitates EMEA business success by smooth management of the GM Office. This includes providing decision-making support and driving implementation of key strategies. He works across all product and sales groups and liaises closely with Chief of Staffs and Execs in HQ and in other Geographies, as well as with external partners. He develops content for key speaking opportunities across EMEA, designed to drive EMEA business opportunities and to raise the profile of Intel in the market. Responsibilities include the planning and execution of high profile Corporate VP’s visits to EMEA. In addition, Colin is expected to co-ordinate GM activities, develop the content for GEO updates, pro-actively driving the EMEA Communications strategy with Employee Communications, plan and coordinate Staff meetings and other senior management meetings / engagements and lead / participate in task forces. \n \nPrior to this he was UK/I Enterprise Sales Director & Ireland Country Manager, responsible for managing Intel’s strategic relationships and market development in UK & Ireland. His focus was managing a team to create demand for Intel platforms via Solutions, new usage models, and ecosystem scaling. The mandate is to bring the benefits of technology to customers by working with industry, governments and development agencies. One of these technologies is Mobile phone technology, which is a particular focus area for Intel.  \n \nColin has over 25 years’ experience in EMEA, UK & Irish Computer industry and joined Intel in 2000. Prior to this he held a number of positions in the computer industry focusing on business development for enterprise solutions in a number of vertical sectors, most of this time was spent in Digital Equipment Corporation. \n \nSpecialties: Strategic Business Development, Government Relations, Marketing, Media Spokeperson, CSR, Education, Business Networking, Business Storytelling Experience Intel EMEA Sales & Marketing - Chief of Staff Intel Corporation April 2013  – Present (2 years 5 months) EMEA Colin is the EMEA SMG Chief of Staff and reports to EMEA GM. In this role Colin contributes to and facilitates EMEA business success by smooth management of the GM Office. This includes providing decision-making support and driving implementation of key strategies. He works across all product and sales groups and liaises closely with Chief of Staffs and Execs in HQ and in other Geographies, as well as with external partners. He develops content for key speaking opportunities across EMEA, designed to drive EMEA business opportunities and to raise the profile of Intel in the market. Responsibilities include the planning and execution of high profile Corporate VP’s visits to EMEA. In addition, Colin is expected to co-ordinate GM activities, develop the content for GEO updates, pro-actively driving the EMEA Communications strategy with Employee Communications, plan and coordinate Staff meetings and other senior management meetings / engagements and lead / participate in task forces. Colin is also a Business Storyteller. Country Manager - Sales & Marketing Intel Ireland December 2000  – Present (14 years 9 months) Responsible for all aspects of Intel's Sales & Marketing in Ireland Intel EMEA Sales & Marketing - Chief of Staff Intel Corporation April 2013  – Present (2 years 5 months) EMEA Colin is the EMEA SMG Chief of Staff and reports to EMEA GM. In this role Colin contributes to and facilitates EMEA business success by smooth management of the GM Office. This includes providing decision-making support and driving implementation of key strategies. He works across all product and sales groups and liaises closely with Chief of Staffs and Execs in HQ and in other Geographies, as well as with external partners. He develops content for key speaking opportunities across EMEA, designed to drive EMEA business opportunities and to raise the profile of Intel in the market. Responsibilities include the planning and execution of high profile Corporate VP’s visits to EMEA. In addition, Colin is expected to co-ordinate GM activities, develop the content for GEO updates, pro-actively driving the EMEA Communications strategy with Employee Communications, plan and coordinate Staff meetings and other senior management meetings / engagements and lead / participate in task forces. Colin is also a Business Storyteller. Intel EMEA Sales & Marketing - Chief of Staff Intel Corporation April 2013  – Present (2 years 5 months) EMEA Colin is the EMEA SMG Chief of Staff and reports to EMEA GM. In this role Colin contributes to and facilitates EMEA business success by smooth management of the GM Office. This includes providing decision-making support and driving implementation of key strategies. He works across all product and sales groups and liaises closely with Chief of Staffs and Execs in HQ and in other Geographies, as well as with external partners. He develops content for key speaking opportunities across EMEA, designed to drive EMEA business opportunities and to raise the profile of Intel in the market. Responsibilities include the planning and execution of high profile Corporate VP’s visits to EMEA. In addition, Colin is expected to co-ordinate GM activities, develop the content for GEO updates, pro-actively driving the EMEA Communications strategy with Employee Communications, plan and coordinate Staff meetings and other senior management meetings / engagements and lead / participate in task forces. Colin is also a Business Storyteller. Country Manager - Sales & Marketing Intel Ireland December 2000  – Present (14 years 9 months) Responsible for all aspects of Intel's Sales & Marketing in Ireland Country Manager - Sales & Marketing Intel Ireland December 2000  – Present (14 years 9 months) Responsible for all aspects of Intel's Sales & Marketing in Ireland Skills Business Storytelling Business Development Enterprise Software Strategic Partnerships New Business Development Account Management Management Solution Selling Sales Operations Go-to-market Strategy Business Strategy Channel Partners Program Management Partner Management Sales Management Telecommunications Leadership Start-ups Outsourcing Pre-sales International Sales Cloud Computing Team Leadership Team Building Mentoring Marketing Competitive Analysis Business Networking Negotiation Marketing Management SaaS Sales Sales Process Marketing Strategy Key Account Management Demand Generation Sales Enablement Strategy Intel Cross-functional Team... Mobile Devices Direct Sales Professional Services CRM Spokesperson Government Relations People Management Channel Management Leadership Development Corporate Events See 35+     See less Skills  Business Storytelling Business Development Enterprise Software Strategic Partnerships New Business Development Account Management Management Solution Selling Sales Operations Go-to-market Strategy Business Strategy Channel Partners Program Management Partner Management Sales Management Telecommunications Leadership Start-ups Outsourcing Pre-sales International Sales Cloud Computing Team Leadership Team Building Mentoring Marketing Competitive Analysis Business Networking Negotiation Marketing Management SaaS Sales Sales Process Marketing Strategy Key Account Management Demand Generation Sales Enablement Strategy Intel Cross-functional Team... Mobile Devices Direct Sales Professional Services CRM Spokesperson Government Relations People Management Channel Management Leadership Development Corporate Events See 35+     See less Business Storytelling Business Development Enterprise Software Strategic Partnerships New Business Development Account Management Management Solution Selling Sales Operations Go-to-market Strategy Business Strategy Channel Partners Program Management Partner Management Sales Management Telecommunications Leadership Start-ups Outsourcing Pre-sales International Sales Cloud Computing Team Leadership Team Building Mentoring Marketing Competitive Analysis Business Networking Negotiation Marketing Management SaaS Sales Sales Process Marketing Strategy Key Account Management Demand Generation Sales Enablement Strategy Intel Cross-functional Team... Mobile Devices Direct Sales Professional Services CRM Spokesperson Government Relations People Management Channel Management Leadership Development Corporate Events See 35+     See less Business Storytelling Business Development Enterprise Software Strategic Partnerships New Business Development Account Management Management Solution Selling Sales Operations Go-to-market Strategy Business Strategy Channel Partners Program Management Partner Management Sales Management Telecommunications Leadership Start-ups Outsourcing Pre-sales International Sales Cloud Computing Team Leadership Team Building Mentoring Marketing Competitive Analysis Business Networking Negotiation Marketing Management SaaS Sales Sales Process Marketing Strategy Key Account Management Demand Generation Sales Enablement Strategy Intel Cross-functional Team... Mobile Devices Direct Sales Professional Services CRM Spokesperson Government Relations People Management Channel Management Leadership Development Corporate Events See 35+     See less ", "Experience Sales Director Intel Corporation May 2011  – Present (4 years 4 months) Director Infineon Technologies March 2003  –  May 2011  (8 years 3 months) Sales manager Infineon Technologies Asia Pacific Pte Ltd September 2001  –  March 2003  (1 year 7 months) Singapore Sales Director Intel Corporation May 2011  – Present (4 years 4 months) Sales Director Intel Corporation May 2011  – Present (4 years 4 months) Director Infineon Technologies March 2003  –  May 2011  (8 years 3 months) Director Infineon Technologies March 2003  –  May 2011  (8 years 3 months) Sales manager Infineon Technologies Asia Pacific Pte Ltd September 2001  –  March 2003  (1 year 7 months) Singapore Sales manager Infineon Technologies Asia Pacific Pte Ltd September 2001  –  March 2003  (1 year 7 months) Singapore Skills Semiconductors Semiconductor Industry Product Marketing Product Management Go-to-market Strategy IC Wireless ASIC Cross-functional Team... SoC Strategic Partnerships Cloud Computing Business Alliances Channel Partners Product Development Mobile Devices Solution Selling Competitive Analysis Enterprise Software Business Development See 5+     See less Skills  Semiconductors Semiconductor Industry Product Marketing Product Management Go-to-market Strategy IC Wireless ASIC Cross-functional Team... SoC Strategic Partnerships Cloud Computing Business Alliances Channel Partners Product Development Mobile Devices Solution Selling Competitive Analysis Enterprise Software Business Development See 5+     See less Semiconductors Semiconductor Industry Product Marketing Product Management Go-to-market Strategy IC Wireless ASIC Cross-functional Team... SoC Strategic Partnerships Cloud Computing Business Alliances Channel Partners Product Development Mobile Devices Solution Selling Competitive Analysis Enterprise Software Business Development See 5+     See less Semiconductors Semiconductor Industry Product Marketing Product Management Go-to-market Strategy IC Wireless ASIC Cross-functional Team... SoC Strategic Partnerships Cloud Computing Business Alliances Channel Partners Product Development Mobile Devices Solution Selling Competitive Analysis Enterprise Software Business Development See 5+     See less Education Shanghai University Bachelor's Degree,  Electrical and Electronics Engineering 1984  – 1988 Shanghai University Bachelor's Degree,  Electrical and Electronics Engineering 1984  – 1988 Shanghai University Bachelor's Degree,  Electrical and Electronics Engineering 1984  – 1988 Shanghai University Bachelor's Degree,  Electrical and Electronics Engineering 1984  – 1988 ", "Summary Business start-up specialist with experience working with Fortune 500 and privately funded US & European companies to develop new customer and partner opportunities with leading Asian technology companies. \n \nProven ability to recruit and lead top sales & technical teams who deliver results that exceed the plan. \n \nExperienced managing large Asia-based multinational customers, with $300M+ direct billings and developing new customers by partnering with Asia system integrators and local Internet companies.  \n \nInterested in opportunities to start-up new businesses in Asia. Summary Business start-up specialist with experience working with Fortune 500 and privately funded US & European companies to develop new customer and partner opportunities with leading Asian technology companies. \n \nProven ability to recruit and lead top sales & technical teams who deliver results that exceed the plan. \n \nExperienced managing large Asia-based multinational customers, with $300M+ direct billings and developing new customers by partnering with Asia system integrators and local Internet companies.  \n \nInterested in opportunities to start-up new businesses in Asia. Business start-up specialist with experience working with Fortune 500 and privately funded US & European companies to develop new customer and partner opportunities with leading Asian technology companies. \n \nProven ability to recruit and lead top sales & technical teams who deliver results that exceed the plan. \n \nExperienced managing large Asia-based multinational customers, with $300M+ direct billings and developing new customers by partnering with Asia system integrators and local Internet companies.  \n \nInterested in opportunities to start-up new businesses in Asia. Business start-up specialist with experience working with Fortune 500 and privately funded US & European companies to develop new customer and partner opportunities with leading Asian technology companies. \n \nProven ability to recruit and lead top sales & technical teams who deliver results that exceed the plan. \n \nExperienced managing large Asia-based multinational customers, with $300M+ direct billings and developing new customers by partnering with Asia system integrators and local Internet companies.  \n \nInterested in opportunities to start-up new businesses in Asia. Experience Sales Director Intel Corporation 2012  – Present (3 years) Taipei, Taiwan Responsible for Taiwan-based global accounts totaling $350M+ in revenue. \nProducts include semiconductor and software solutions for IOT, data center, telecom, consumer electronics & wireless devices. Vice President, Asia Pacific Metrico Wireless 2008  –  2012  (4 years) Taipei, Taiwan Set up Metrico’s Asia headquarters, recruited sales/technical teams and channel partners that grew the Asia business from one customer into a profitable million dollar business. \n \nResponsible for setting strategy, managing P&L and developing sales and marketing relationships with Asia’s leading wireless carriers, branded/ODM smartphone, notebook, tablet, and wireless chip companies. \n \nSold and deployed a cloud based smartphone testing service in Korea, Taiwan and China.  \nCustomers included China Mobile, SK Telecom, Chunghwa Telecom, HTC, ASUS, Acer, LGE, Pantech, Huawei, ZTE, Mediatek, Motorola Beijing, Qualcomm Beijing, and others. \n \nMetrico was acquired by Spirent Communications in 2012. Asia Business Advisor APAC Ventures 2004  –  2012  (8 years) Taipei, Taiwan Consulted with the management of privately funded companies to develop their Asia business plan, hire local staff and develop new customers opportunities. \n \nOver the past 10 years, I have worked with the following: LANDesk Software, Crystal Voice Communications (acquired by Global IP Solutions), Global IP Solutions (acquired by Google), Diginext, Jasper, PicoMobile (acquired by Marvell), Tuxera Software, LogLogic (acquired by TIBCO) & Polaris Wireless. Director of Asia Sales & Marketing Azaire Networks 2002  –  2008  (6 years) Taiwan Developed Azaire’s product and sales plan for Asia by engaging with leading Asia wireless operators to develop business models to justify deployment of 3GPP defined I-WLAN solution which specified use of WiFi networks to offload data & voice traffic from more expensive 3G networks.  \n \nPartnered with leading MNC and local system integrators to engage with Asia operators and closed multi-million dollar 3G offload deal with Chunghwa Telecom. Solution was based on 3GPP I-WLAN and was first such deployment in Asia based on EAP SIM authentication.  \n \nAzaire Networks (also previously named Mobility Networks) was acquired by Intellinet Technologies in 2008 Sales Manager Intel Corporation 1999  –  2001  (2 years) San Jose, CA Responsible for US based computer OEMs, retail and distributors selling Intel's full line of products. \n \nExceed revenue target $68M revenue target by ~30% and design wins by ~40%. \n \nCompleted MBA while working fulltime, left Intel to pursue 1 year of travel and volunteer work in Brazil Asia Pacific, Product Manager Intel Corporation 1997  –  1999  (2 years) Hong Kong Member of APAC business management team responsible for $500M+ desktop product business \n \nJob responsibilities included localizing product roadmaps, participating in strategic planning, determining APAC CPU demand forecast, and pricing. Asia Pacific, Technical Marketing Engineer Intel Corporation 1995  –  1997  (2 years) Taipei, Taiwan Co-founder of Intel’s Asia Pacific PC Lab in Taiwan with charter to drive and validate Intel silicon design wins at APAC OEMs. \n \nSupported hiring and managing of technical team that provided testing services to Asian computer OEMs to assist them in validating their designs of Intel products and to test new PC industry initiatives. \n \nDeveloped and delivered technical marketing training seminars as part of development of new Asia Pacific sales channel. Technical Marketing Engineer Intel Corporation 1994  –  1995  (1 year) Folsom, CA Worked on Pentium(™) CPU OverDrive processor group as a member of product development team.  \n \nContributed to technical product specification and customer enablement. Sales Director Intel Corporation 2012  – Present (3 years) Taipei, Taiwan Responsible for Taiwan-based global accounts totaling $350M+ in revenue. \nProducts include semiconductor and software solutions for IOT, data center, telecom, consumer electronics & wireless devices. Sales Director Intel Corporation 2012  – Present (3 years) Taipei, Taiwan Responsible for Taiwan-based global accounts totaling $350M+ in revenue. \nProducts include semiconductor and software solutions for IOT, data center, telecom, consumer electronics & wireless devices. Vice President, Asia Pacific Metrico Wireless 2008  –  2012  (4 years) Taipei, Taiwan Set up Metrico’s Asia headquarters, recruited sales/technical teams and channel partners that grew the Asia business from one customer into a profitable million dollar business. \n \nResponsible for setting strategy, managing P&L and developing sales and marketing relationships with Asia’s leading wireless carriers, branded/ODM smartphone, notebook, tablet, and wireless chip companies. \n \nSold and deployed a cloud based smartphone testing service in Korea, Taiwan and China.  \nCustomers included China Mobile, SK Telecom, Chunghwa Telecom, HTC, ASUS, Acer, LGE, Pantech, Huawei, ZTE, Mediatek, Motorola Beijing, Qualcomm Beijing, and others. \n \nMetrico was acquired by Spirent Communications in 2012. Vice President, Asia Pacific Metrico Wireless 2008  –  2012  (4 years) Taipei, Taiwan Set up Metrico’s Asia headquarters, recruited sales/technical teams and channel partners that grew the Asia business from one customer into a profitable million dollar business. \n \nResponsible for setting strategy, managing P&L and developing sales and marketing relationships with Asia’s leading wireless carriers, branded/ODM smartphone, notebook, tablet, and wireless chip companies. \n \nSold and deployed a cloud based smartphone testing service in Korea, Taiwan and China.  \nCustomers included China Mobile, SK Telecom, Chunghwa Telecom, HTC, ASUS, Acer, LGE, Pantech, Huawei, ZTE, Mediatek, Motorola Beijing, Qualcomm Beijing, and others. \n \nMetrico was acquired by Spirent Communications in 2012. Asia Business Advisor APAC Ventures 2004  –  2012  (8 years) Taipei, Taiwan Consulted with the management of privately funded companies to develop their Asia business plan, hire local staff and develop new customers opportunities. \n \nOver the past 10 years, I have worked with the following: LANDesk Software, Crystal Voice Communications (acquired by Global IP Solutions), Global IP Solutions (acquired by Google), Diginext, Jasper, PicoMobile (acquired by Marvell), Tuxera Software, LogLogic (acquired by TIBCO) & Polaris Wireless. Asia Business Advisor APAC Ventures 2004  –  2012  (8 years) Taipei, Taiwan Consulted with the management of privately funded companies to develop their Asia business plan, hire local staff and develop new customers opportunities. \n \nOver the past 10 years, I have worked with the following: LANDesk Software, Crystal Voice Communications (acquired by Global IP Solutions), Global IP Solutions (acquired by Google), Diginext, Jasper, PicoMobile (acquired by Marvell), Tuxera Software, LogLogic (acquired by TIBCO) & Polaris Wireless. Director of Asia Sales & Marketing Azaire Networks 2002  –  2008  (6 years) Taiwan Developed Azaire’s product and sales plan for Asia by engaging with leading Asia wireless operators to develop business models to justify deployment of 3GPP defined I-WLAN solution which specified use of WiFi networks to offload data & voice traffic from more expensive 3G networks.  \n \nPartnered with leading MNC and local system integrators to engage with Asia operators and closed multi-million dollar 3G offload deal with Chunghwa Telecom. Solution was based on 3GPP I-WLAN and was first such deployment in Asia based on EAP SIM authentication.  \n \nAzaire Networks (also previously named Mobility Networks) was acquired by Intellinet Technologies in 2008 Director of Asia Sales & Marketing Azaire Networks 2002  –  2008  (6 years) Taiwan Developed Azaire’s product and sales plan for Asia by engaging with leading Asia wireless operators to develop business models to justify deployment of 3GPP defined I-WLAN solution which specified use of WiFi networks to offload data & voice traffic from more expensive 3G networks.  \n \nPartnered with leading MNC and local system integrators to engage with Asia operators and closed multi-million dollar 3G offload deal with Chunghwa Telecom. Solution was based on 3GPP I-WLAN and was first such deployment in Asia based on EAP SIM authentication.  \n \nAzaire Networks (also previously named Mobility Networks) was acquired by Intellinet Technologies in 2008 Sales Manager Intel Corporation 1999  –  2001  (2 years) San Jose, CA Responsible for US based computer OEMs, retail and distributors selling Intel's full line of products. \n \nExceed revenue target $68M revenue target by ~30% and design wins by ~40%. \n \nCompleted MBA while working fulltime, left Intel to pursue 1 year of travel and volunteer work in Brazil Sales Manager Intel Corporation 1999  –  2001  (2 years) San Jose, CA Responsible for US based computer OEMs, retail and distributors selling Intel's full line of products. \n \nExceed revenue target $68M revenue target by ~30% and design wins by ~40%. \n \nCompleted MBA while working fulltime, left Intel to pursue 1 year of travel and volunteer work in Brazil Asia Pacific, Product Manager Intel Corporation 1997  –  1999  (2 years) Hong Kong Member of APAC business management team responsible for $500M+ desktop product business \n \nJob responsibilities included localizing product roadmaps, participating in strategic planning, determining APAC CPU demand forecast, and pricing. Asia Pacific, Product Manager Intel Corporation 1997  –  1999  (2 years) Hong Kong Member of APAC business management team responsible for $500M+ desktop product business \n \nJob responsibilities included localizing product roadmaps, participating in strategic planning, determining APAC CPU demand forecast, and pricing. Asia Pacific, Technical Marketing Engineer Intel Corporation 1995  –  1997  (2 years) Taipei, Taiwan Co-founder of Intel’s Asia Pacific PC Lab in Taiwan with charter to drive and validate Intel silicon design wins at APAC OEMs. \n \nSupported hiring and managing of technical team that provided testing services to Asian computer OEMs to assist them in validating their designs of Intel products and to test new PC industry initiatives. \n \nDeveloped and delivered technical marketing training seminars as part of development of new Asia Pacific sales channel. Asia Pacific, Technical Marketing Engineer Intel Corporation 1995  –  1997  (2 years) Taipei, Taiwan Co-founder of Intel’s Asia Pacific PC Lab in Taiwan with charter to drive and validate Intel silicon design wins at APAC OEMs. \n \nSupported hiring and managing of technical team that provided testing services to Asian computer OEMs to assist them in validating their designs of Intel products and to test new PC industry initiatives. \n \nDeveloped and delivered technical marketing training seminars as part of development of new Asia Pacific sales channel. Technical Marketing Engineer Intel Corporation 1994  –  1995  (1 year) Folsom, CA Worked on Pentium(™) CPU OverDrive processor group as a member of product development team.  \n \nContributed to technical product specification and customer enablement. Technical Marketing Engineer Intel Corporation 1994  –  1995  (1 year) Folsom, CA Worked on Pentium(™) CPU OverDrive processor group as a member of product development team.  \n \nContributed to technical product specification and customer enablement. Languages English Native or bilingual proficiency Chinese Professional working proficiency English Native or bilingual proficiency Chinese Professional working proficiency English Native or bilingual proficiency Chinese Professional working proficiency Native or bilingual proficiency Professional working proficiency Skills Wireless Business Planning Product Management Start-ups Asia Pacific Semiconductors Smartphones Sales Management Business Strategy Venture Capital Chinese Licensing Mobile Devices Strategy Telecommunications Business Development International Sales Mobile Communications See 3+     See less Skills  Wireless Business Planning Product Management Start-ups Asia Pacific Semiconductors Smartphones Sales Management Business Strategy Venture Capital Chinese Licensing Mobile Devices Strategy Telecommunications Business Development International Sales Mobile Communications See 3+     See less Wireless Business Planning Product Management Start-ups Asia Pacific Semiconductors Smartphones Sales Management Business Strategy Venture Capital Chinese Licensing Mobile Devices Strategy Telecommunications Business Development International Sales Mobile Communications See 3+     See less Wireless Business Planning Product Management Start-ups Asia Pacific Semiconductors Smartphones Sales Management Business Strategy Venture Capital Chinese Licensing Mobile Devices Strategy Telecommunications Business Development International Sales Mobile Communications See 3+     See less ", "Summary Dynamic and highly skilled professional with 20+ years of BD, Sales, and Marketing management experience. \n \nSpecialties:  \nTrack record of building businesses and growing revenues.  \nStrong management, communications, and people skills \n20 years of International experience. \nDeep rolodex across many industries. \nSuccessful Business Development and Project Management experience. \nExperience with hardware, software, systems, and IP sales. \nBroad market experience: Electronics, Defense/Aerospace, Wireless/Mobile, Networking, Storage, Computing, Medical, Gaming, Energy, and Automotive. \nSuccessful start-up experience \nM&A experience Summary Dynamic and highly skilled professional with 20+ years of BD, Sales, and Marketing management experience. \n \nSpecialties:  \nTrack record of building businesses and growing revenues.  \nStrong management, communications, and people skills \n20 years of International experience. \nDeep rolodex across many industries. \nSuccessful Business Development and Project Management experience. \nExperience with hardware, software, systems, and IP sales. \nBroad market experience: Electronics, Defense/Aerospace, Wireless/Mobile, Networking, Storage, Computing, Medical, Gaming, Energy, and Automotive. \nSuccessful start-up experience \nM&A experience Dynamic and highly skilled professional with 20+ years of BD, Sales, and Marketing management experience. \n \nSpecialties:  \nTrack record of building businesses and growing revenues.  \nStrong management, communications, and people skills \n20 years of International experience. \nDeep rolodex across many industries. \nSuccessful Business Development and Project Management experience. \nExperience with hardware, software, systems, and IP sales. \nBroad market experience: Electronics, Defense/Aerospace, Wireless/Mobile, Networking, Storage, Computing, Medical, Gaming, Energy, and Automotive. \nSuccessful start-up experience \nM&A experience Dynamic and highly skilled professional with 20+ years of BD, Sales, and Marketing management experience. \n \nSpecialties:  \nTrack record of building businesses and growing revenues.  \nStrong management, communications, and people skills \n20 years of International experience. \nDeep rolodex across many industries. \nSuccessful Business Development and Project Management experience. \nExperience with hardware, software, systems, and IP sales. \nBroad market experience: Electronics, Defense/Aerospace, Wireless/Mobile, Networking, Storage, Computing, Medical, Gaming, Energy, and Automotive. \nSuccessful start-up experience \nM&A experience Experience Director of International Business Development Boeing 2009  –  April 2015  (6 years) Huntington Beach, Ca Lead Business Development efforts for several C4ISR product lines within Boeing's Defense, Space, and Security Division (RF Communications Systems, Search & Rescue Radios, Asset Tracking/GPS, Secure 4G Cellular Phones, Networks, Cyber SW and HW solutions, Payloads, Antennas, Sensors, Navigation, Targeting Systems). Interface with the following DoD Services: State Department, Army, NAVAIR, NAVSEA, Air Force, Marines, SOCOM, DOE, NSA, NRO, DTSA, CIA, FBI, HS. Responsible for International Sales to our coalition partners. Hold a Secret Clearance. \n \nAchievements:  \n- Worked with DISA and DOE on transition of GCN business \n- CSEL, the Search and Rescue System for the DoD (which I manage) was awarded \"Program of the Year\" by the U.S. Air Force. \n- Booked over $400M dollars worth of contracts (CSEL, Software, Service, Networks, and GEDMS) \n- Booked multi-million dollar asset tracking order with DoD \n- Booked $50M Software and Service contract with DoD \n- Booked $10M C2 order with the Air Force \n- Booked international business with Japan, Korea, and Australia (Networks) \n- Developed and implemented successful business Plans for Shipboard Networking and RF HH Radio product lines \n- Developed product strategy and roadmap for S&R UAV Payload business \n- Created business plan/strategy and product roadmap for entering the Comms-Wearables Market \n- Rolled out Microsoft CRM System \n- Worked with State Department and various COCOMs to establish export policy to allied nations \n- Helped shape and develop Next Gen Search and Rescue Technology for the DoD and Allies \n- Launched Crypto business Vice President of Sales Parrot 2005  –  2009  (4 years) Responsible for overseeing business development and sales efforts in the Americas  \n \nAchievements: \n- Pioneered marketing efforts for Mobile TV in the Americas  \n- Developed Business Plan  \n- Set up sales processes and hired sales team  \n- Developed relationships and new business with key accounts including Apple, Audiovox, Dell, Garmin, Hauppauge, HP, Lenovo, Microsoft, Motorola, Palm, Sony Ericsson, and Sony. ($30M+ in revenues) \n- Worked with partner companies including: Qualcomm/Media FLO, Echostar, Direct TV, SES Americom, ICO, Sirius/XM, Irdeto, Nagra Vision, and NDS  \n- Drove DVB-H trials at Sprint and AT&T \n- Set up tradeshow activities CES, IBC, NAB, CTIA, TV2Mobile, etc... \n- Interacted with Investment Bankers and Industry Analysts/Press \n- Worked with the NHL, NFL, MLB, USTA, PGA, and Indy Racing on In Stadium TV concept with partner WISEDV  \n- Closed deals with the PGA and USTA (Amex) \n- Part of a successful start-up (DiBcom) that was acquired by Parrot Vice President of WW Sales Motorola 2003  –  2005  (2 years) Responsible for worldwide sales, customer service, and strategic marketing for Motorola's Energy Systems Group. Product line consisted of portable energy solutions (batteries) and wireless accessories for the mobile/cellular and portable electronics markets.  \n \nAchievements: \n- Restructured the WW Sales Team and the Customer Service Team \n- Developed and successfully implemented a Business Plan to penetrate the Mobile/Cellular Markets \n- Tripled sales with Apple, Dell, and HP  \n- Lead a WW team that doubled sales from $350M to $700M \n- Restructured Motorola's Retail Strategy with Radio Shack, Circuit City, Fry's, Best Buy, etc.  \n \nNote: Motorola divested from the battery business during the corporate restructuring VP of Sales Vitesse Semiconductor 2001  –  2003  (2 years) Responsible for managing the North American Sales Team \n \nAchievements:  \n- Developed business plan and strategy for the Americas \n- Hired sales team \n- Set up Rep and Distribution Channels \n- Implemented CRM Tool \n- Generated $30M in new sales with Tier 1 OEM's (Cisco, Netgear, Linksys, Nortel, etc.)  \n- Part of a successful start-up (Cicada) that was acquired by (Vitesse) WW Director of Strategic Sales Conexant Systems Inc 1998  –  2001  (3 years) Responsible for directing strategic WW sales efforts. (Key Markets - Wireless, PC OEM, IT/Networking)  \n \nAchievements: \n- Developed Business plan to penetrate PC OEM Market \n- Worked with CIO to develop and roll out eBusiness System for managing Sales Operations and client relationships \n- Set up OEM Sales and Marketing teams in Japan, Korea, and Taiwan \n- Launched first SW Modem business with Fujitsu, Sony, HP, and NEC \n- Increased sales from $50M to $250M Area Sales Director Intel Corporation 1995  –  1998  (3 years) Responsible for Southern U.S. Territory for Digital Semiconductor/Intel. Accounts included, Adaptec, Compaq, AST, DLink, Emulex, Linksys, Sony, HP, Qualcomm, WD. \n \nAchievements: \n- Opened up sales offices and hired distributors \n- Established key relationships and set up contracts with VARs \n- Closed over $200M in sales in three years \n- Developed Alpha Processor based server and workstation roadmaps and developed a successful Business Plan that generated over $50M  \n- Closed multi- million dollar Ethernet contracts with Linksys and DLink \n- Awarded Top Gun Sales Leader by CEO two years in a row \n \nNote: DEC sold semiconductor unit to Intel Area Sales Manager Samsung Electronics 1991  –  1995  (4 years) Responsible for Southern US territory \n \nAchievements: \n- Created Business Plan for Memory and ASIC Business \n- Initiated new Analog IC business in Southern US  \n- Developed new business with Compaq, AST, WD, Gateway, Linksys, DLink, Boeing, Northrop, Xerox)  \n- Increased sales from $150M to $1B District Sales Manager Toshiba 1988  –  1991  (3 years) Responsible for account development in San Diego County \n \nAchievements:  \n- Opened up and staffed first offices for Toshiba in San Diego and Mexico \n- Closed major business deals with HP, Unisys, NCR, Sony, and Qualcomm \n- Opened up business in Mexico and S America (hired reps) \n- Promoted to District Manager Sales Engineer Texas Instruments May 1985  –  1988  (3 years) Acted as Sales Engineer for the Greater Los Angeles and San Bernardino Territory \n \nAchievements: \n- Opened up San Gabriel Sales Office \n- Managed reps and distributors \n- Booked multi- million dollar electronics deals with Boeing, JPL NASA, Hughes, Loral, TRW, Lockheed, MD, and Kodak \n- Awarded - Top Sales person for TI in 1987 Director of International Business Development Boeing 2009  –  April 2015  (6 years) Huntington Beach, Ca Lead Business Development efforts for several C4ISR product lines within Boeing's Defense, Space, and Security Division (RF Communications Systems, Search & Rescue Radios, Asset Tracking/GPS, Secure 4G Cellular Phones, Networks, Cyber SW and HW solutions, Payloads, Antennas, Sensors, Navigation, Targeting Systems). Interface with the following DoD Services: State Department, Army, NAVAIR, NAVSEA, Air Force, Marines, SOCOM, DOE, NSA, NRO, DTSA, CIA, FBI, HS. Responsible for International Sales to our coalition partners. Hold a Secret Clearance. \n \nAchievements:  \n- Worked with DISA and DOE on transition of GCN business \n- CSEL, the Search and Rescue System for the DoD (which I manage) was awarded \"Program of the Year\" by the U.S. Air Force. \n- Booked over $400M dollars worth of contracts (CSEL, Software, Service, Networks, and GEDMS) \n- Booked multi-million dollar asset tracking order with DoD \n- Booked $50M Software and Service contract with DoD \n- Booked $10M C2 order with the Air Force \n- Booked international business with Japan, Korea, and Australia (Networks) \n- Developed and implemented successful business Plans for Shipboard Networking and RF HH Radio product lines \n- Developed product strategy and roadmap for S&R UAV Payload business \n- Created business plan/strategy and product roadmap for entering the Comms-Wearables Market \n- Rolled out Microsoft CRM System \n- Worked with State Department and various COCOMs to establish export policy to allied nations \n- Helped shape and develop Next Gen Search and Rescue Technology for the DoD and Allies \n- Launched Crypto business Director of International Business Development Boeing 2009  –  April 2015  (6 years) Huntington Beach, Ca Lead Business Development efforts for several C4ISR product lines within Boeing's Defense, Space, and Security Division (RF Communications Systems, Search & Rescue Radios, Asset Tracking/GPS, Secure 4G Cellular Phones, Networks, Cyber SW and HW solutions, Payloads, Antennas, Sensors, Navigation, Targeting Systems). Interface with the following DoD Services: State Department, Army, NAVAIR, NAVSEA, Air Force, Marines, SOCOM, DOE, NSA, NRO, DTSA, CIA, FBI, HS. Responsible for International Sales to our coalition partners. Hold a Secret Clearance. \n \nAchievements:  \n- Worked with DISA and DOE on transition of GCN business \n- CSEL, the Search and Rescue System for the DoD (which I manage) was awarded \"Program of the Year\" by the U.S. Air Force. \n- Booked over $400M dollars worth of contracts (CSEL, Software, Service, Networks, and GEDMS) \n- Booked multi-million dollar asset tracking order with DoD \n- Booked $50M Software and Service contract with DoD \n- Booked $10M C2 order with the Air Force \n- Booked international business with Japan, Korea, and Australia (Networks) \n- Developed and implemented successful business Plans for Shipboard Networking and RF HH Radio product lines \n- Developed product strategy and roadmap for S&R UAV Payload business \n- Created business plan/strategy and product roadmap for entering the Comms-Wearables Market \n- Rolled out Microsoft CRM System \n- Worked with State Department and various COCOMs to establish export policy to allied nations \n- Helped shape and develop Next Gen Search and Rescue Technology for the DoD and Allies \n- Launched Crypto business Vice President of Sales Parrot 2005  –  2009  (4 years) Responsible for overseeing business development and sales efforts in the Americas  \n \nAchievements: \n- Pioneered marketing efforts for Mobile TV in the Americas  \n- Developed Business Plan  \n- Set up sales processes and hired sales team  \n- Developed relationships and new business with key accounts including Apple, Audiovox, Dell, Garmin, Hauppauge, HP, Lenovo, Microsoft, Motorola, Palm, Sony Ericsson, and Sony. ($30M+ in revenues) \n- Worked with partner companies including: Qualcomm/Media FLO, Echostar, Direct TV, SES Americom, ICO, Sirius/XM, Irdeto, Nagra Vision, and NDS  \n- Drove DVB-H trials at Sprint and AT&T \n- Set up tradeshow activities CES, IBC, NAB, CTIA, TV2Mobile, etc... \n- Interacted with Investment Bankers and Industry Analysts/Press \n- Worked with the NHL, NFL, MLB, USTA, PGA, and Indy Racing on In Stadium TV concept with partner WISEDV  \n- Closed deals with the PGA and USTA (Amex) \n- Part of a successful start-up (DiBcom) that was acquired by Parrot Vice President of Sales Parrot 2005  –  2009  (4 years) Responsible for overseeing business development and sales efforts in the Americas  \n \nAchievements: \n- Pioneered marketing efforts for Mobile TV in the Americas  \n- Developed Business Plan  \n- Set up sales processes and hired sales team  \n- Developed relationships and new business with key accounts including Apple, Audiovox, Dell, Garmin, Hauppauge, HP, Lenovo, Microsoft, Motorola, Palm, Sony Ericsson, and Sony. ($30M+ in revenues) \n- Worked with partner companies including: Qualcomm/Media FLO, Echostar, Direct TV, SES Americom, ICO, Sirius/XM, Irdeto, Nagra Vision, and NDS  \n- Drove DVB-H trials at Sprint and AT&T \n- Set up tradeshow activities CES, IBC, NAB, CTIA, TV2Mobile, etc... \n- Interacted with Investment Bankers and Industry Analysts/Press \n- Worked with the NHL, NFL, MLB, USTA, PGA, and Indy Racing on In Stadium TV concept with partner WISEDV  \n- Closed deals with the PGA and USTA (Amex) \n- Part of a successful start-up (DiBcom) that was acquired by Parrot Vice President of WW Sales Motorola 2003  –  2005  (2 years) Responsible for worldwide sales, customer service, and strategic marketing for Motorola's Energy Systems Group. Product line consisted of portable energy solutions (batteries) and wireless accessories for the mobile/cellular and portable electronics markets.  \n \nAchievements: \n- Restructured the WW Sales Team and the Customer Service Team \n- Developed and successfully implemented a Business Plan to penetrate the Mobile/Cellular Markets \n- Tripled sales with Apple, Dell, and HP  \n- Lead a WW team that doubled sales from $350M to $700M \n- Restructured Motorola's Retail Strategy with Radio Shack, Circuit City, Fry's, Best Buy, etc.  \n \nNote: Motorola divested from the battery business during the corporate restructuring Vice President of WW Sales Motorola 2003  –  2005  (2 years) Responsible for worldwide sales, customer service, and strategic marketing for Motorola's Energy Systems Group. Product line consisted of portable energy solutions (batteries) and wireless accessories for the mobile/cellular and portable electronics markets.  \n \nAchievements: \n- Restructured the WW Sales Team and the Customer Service Team \n- Developed and successfully implemented a Business Plan to penetrate the Mobile/Cellular Markets \n- Tripled sales with Apple, Dell, and HP  \n- Lead a WW team that doubled sales from $350M to $700M \n- Restructured Motorola's Retail Strategy with Radio Shack, Circuit City, Fry's, Best Buy, etc.  \n \nNote: Motorola divested from the battery business during the corporate restructuring VP of Sales Vitesse Semiconductor 2001  –  2003  (2 years) Responsible for managing the North American Sales Team \n \nAchievements:  \n- Developed business plan and strategy for the Americas \n- Hired sales team \n- Set up Rep and Distribution Channels \n- Implemented CRM Tool \n- Generated $30M in new sales with Tier 1 OEM's (Cisco, Netgear, Linksys, Nortel, etc.)  \n- Part of a successful start-up (Cicada) that was acquired by (Vitesse) VP of Sales Vitesse Semiconductor 2001  –  2003  (2 years) Responsible for managing the North American Sales Team \n \nAchievements:  \n- Developed business plan and strategy for the Americas \n- Hired sales team \n- Set up Rep and Distribution Channels \n- Implemented CRM Tool \n- Generated $30M in new sales with Tier 1 OEM's (Cisco, Netgear, Linksys, Nortel, etc.)  \n- Part of a successful start-up (Cicada) that was acquired by (Vitesse) WW Director of Strategic Sales Conexant Systems Inc 1998  –  2001  (3 years) Responsible for directing strategic WW sales efforts. (Key Markets - Wireless, PC OEM, IT/Networking)  \n \nAchievements: \n- Developed Business plan to penetrate PC OEM Market \n- Worked with CIO to develop and roll out eBusiness System for managing Sales Operations and client relationships \n- Set up OEM Sales and Marketing teams in Japan, Korea, and Taiwan \n- Launched first SW Modem business with Fujitsu, Sony, HP, and NEC \n- Increased sales from $50M to $250M WW Director of Strategic Sales Conexant Systems Inc 1998  –  2001  (3 years) Responsible for directing strategic WW sales efforts. (Key Markets - Wireless, PC OEM, IT/Networking)  \n \nAchievements: \n- Developed Business plan to penetrate PC OEM Market \n- Worked with CIO to develop and roll out eBusiness System for managing Sales Operations and client relationships \n- Set up OEM Sales and Marketing teams in Japan, Korea, and Taiwan \n- Launched first SW Modem business with Fujitsu, Sony, HP, and NEC \n- Increased sales from $50M to $250M Area Sales Director Intel Corporation 1995  –  1998  (3 years) Responsible for Southern U.S. Territory for Digital Semiconductor/Intel. Accounts included, Adaptec, Compaq, AST, DLink, Emulex, Linksys, Sony, HP, Qualcomm, WD. \n \nAchievements: \n- Opened up sales offices and hired distributors \n- Established key relationships and set up contracts with VARs \n- Closed over $200M in sales in three years \n- Developed Alpha Processor based server and workstation roadmaps and developed a successful Business Plan that generated over $50M  \n- Closed multi- million dollar Ethernet contracts with Linksys and DLink \n- Awarded Top Gun Sales Leader by CEO two years in a row \n \nNote: DEC sold semiconductor unit to Intel Area Sales Director Intel Corporation 1995  –  1998  (3 years) Responsible for Southern U.S. Territory for Digital Semiconductor/Intel. Accounts included, Adaptec, Compaq, AST, DLink, Emulex, Linksys, Sony, HP, Qualcomm, WD. \n \nAchievements: \n- Opened up sales offices and hired distributors \n- Established key relationships and set up contracts with VARs \n- Closed over $200M in sales in three years \n- Developed Alpha Processor based server and workstation roadmaps and developed a successful Business Plan that generated over $50M  \n- Closed multi- million dollar Ethernet contracts with Linksys and DLink \n- Awarded Top Gun Sales Leader by CEO two years in a row \n \nNote: DEC sold semiconductor unit to Intel Area Sales Manager Samsung Electronics 1991  –  1995  (4 years) Responsible for Southern US territory \n \nAchievements: \n- Created Business Plan for Memory and ASIC Business \n- Initiated new Analog IC business in Southern US  \n- Developed new business with Compaq, AST, WD, Gateway, Linksys, DLink, Boeing, Northrop, Xerox)  \n- Increased sales from $150M to $1B Area Sales Manager Samsung Electronics 1991  –  1995  (4 years) Responsible for Southern US territory \n \nAchievements: \n- Created Business Plan for Memory and ASIC Business \n- Initiated new Analog IC business in Southern US  \n- Developed new business with Compaq, AST, WD, Gateway, Linksys, DLink, Boeing, Northrop, Xerox)  \n- Increased sales from $150M to $1B District Sales Manager Toshiba 1988  –  1991  (3 years) Responsible for account development in San Diego County \n \nAchievements:  \n- Opened up and staffed first offices for Toshiba in San Diego and Mexico \n- Closed major business deals with HP, Unisys, NCR, Sony, and Qualcomm \n- Opened up business in Mexico and S America (hired reps) \n- Promoted to District Manager District Sales Manager Toshiba 1988  –  1991  (3 years) Responsible for account development in San Diego County \n \nAchievements:  \n- Opened up and staffed first offices for Toshiba in San Diego and Mexico \n- Closed major business deals with HP, Unisys, NCR, Sony, and Qualcomm \n- Opened up business in Mexico and S America (hired reps) \n- Promoted to District Manager Sales Engineer Texas Instruments May 1985  –  1988  (3 years) Acted as Sales Engineer for the Greater Los Angeles and San Bernardino Territory \n \nAchievements: \n- Opened up San Gabriel Sales Office \n- Managed reps and distributors \n- Booked multi- million dollar electronics deals with Boeing, JPL NASA, Hughes, Loral, TRW, Lockheed, MD, and Kodak \n- Awarded - Top Sales person for TI in 1987 Sales Engineer Texas Instruments May 1985  –  1988  (3 years) Acted as Sales Engineer for the Greater Los Angeles and San Bernardino Territory \n \nAchievements: \n- Opened up San Gabriel Sales Office \n- Managed reps and distributors \n- Booked multi- million dollar electronics deals with Boeing, JPL NASA, Hughes, Loral, TRW, Lockheed, MD, and Kodak \n- Awarded - Top Sales person for TI in 1987 Languages French French French Skills Semiconductors Hardware Storage Management Networking Software Automotive Government People Skills Computing Energy Product Marketing Electronics Product Management Wireless Start-ups Product Development Strategic Partnerships New Business Development Cross-functional Team... Go-to-market Strategy Telecommunications Mobile Devices Business Development Competitive Analysis Business Strategy Global Business... Sales Management Product Launch Product Lifecycle... Consumer Electronics International Sales Program Management Strategic Alliances Embedded Systems Project Management Pricing Strategy Business Alliances Executive Management Channel Key Account Management Strategy Enterprise Software Sales Operations Sales Process Leadership Business Planning Sales Marketing Strategy Marketing See 35+     See less Skills  Semiconductors Hardware Storage Management Networking Software Automotive Government People Skills Computing Energy Product Marketing Electronics Product Management Wireless Start-ups Product Development Strategic Partnerships New Business Development Cross-functional Team... Go-to-market Strategy Telecommunications Mobile Devices Business Development Competitive Analysis Business Strategy Global Business... Sales Management Product Launch Product Lifecycle... Consumer Electronics International Sales Program Management Strategic Alliances Embedded Systems Project Management Pricing Strategy Business Alliances Executive Management Channel Key Account Management Strategy Enterprise Software Sales Operations Sales Process Leadership Business Planning Sales Marketing Strategy Marketing See 35+     See less Semiconductors Hardware Storage Management Networking Software Automotive Government People Skills Computing Energy Product Marketing Electronics Product Management Wireless Start-ups Product Development Strategic Partnerships New Business Development Cross-functional Team... Go-to-market Strategy Telecommunications Mobile Devices Business Development Competitive Analysis Business Strategy Global Business... Sales Management Product Launch Product Lifecycle... Consumer Electronics International Sales Program Management Strategic Alliances Embedded Systems Project Management Pricing Strategy Business Alliances Executive Management Channel Key Account Management Strategy Enterprise Software Sales Operations Sales Process Leadership Business Planning Sales Marketing Strategy Marketing See 35+     See less Semiconductors Hardware Storage Management Networking Software Automotive Government People Skills Computing Energy Product Marketing Electronics Product Management Wireless Start-ups Product Development Strategic Partnerships New Business Development Cross-functional Team... Go-to-market Strategy Telecommunications Mobile Devices Business Development Competitive Analysis Business Strategy Global Business... Sales Management Product Launch Product Lifecycle... Consumer Electronics International Sales Program Management Strategic Alliances Embedded Systems Project Management Pricing Strategy Business Alliances Executive Management Channel Key Account Management Strategy Enterprise Software Sales Operations Sales Process Leadership Business Planning Sales Marketing Strategy Marketing See 35+     See less Education Pepperdine University MBA,  Management and Finance January 1992  – May 1995 Milwaukee School of Engineering BSME/ minor EE,  Mechanical and Electrical Engineering 1981  – 1985 Activities and Societies:  College Baseball ,  Basketball ,  Hockey ,  VP of Honor Fraternity Milwaukee School of Engineering AAS,  Energy Systems & Automotive Engineering 1981  – 1983 Palatine High Palatine High Pepperdine University MBA,  Management and Finance January 1992  – May 1995 Pepperdine University MBA,  Management and Finance January 1992  – May 1995 Pepperdine University MBA,  Management and Finance January 1992  – May 1995 Milwaukee School of Engineering BSME/ minor EE,  Mechanical and Electrical Engineering 1981  – 1985 Activities and Societies:  College Baseball ,  Basketball ,  Hockey ,  VP of Honor Fraternity Milwaukee School of Engineering BSME/ minor EE,  Mechanical and Electrical Engineering 1981  – 1985 Activities and Societies:  College Baseball ,  Basketball ,  Hockey ,  VP of Honor Fraternity Milwaukee School of Engineering BSME/ minor EE,  Mechanical and Electrical Engineering 1981  – 1985 Activities and Societies:  College Baseball ,  Basketball ,  Hockey ,  VP of Honor Fraternity Milwaukee School of Engineering AAS,  Energy Systems & Automotive Engineering 1981  – 1983 Milwaukee School of Engineering AAS,  Energy Systems & Automotive Engineering 1981  – 1983 Milwaukee School of Engineering AAS,  Energy Systems & Automotive Engineering 1981  – 1983 Palatine High Palatine High Palatine High Palatine High Palatine High Palatine High ", "Summary Larry Jaeger is an entrepreneurial, senior executive level marketing and solution sales professional with a strong background leading sales growth, marketing strategy and global brand management. \n \nEXECUTIVE COACHING - LEADERSHIP TRAINING - SALES SKILLS TRAINING AND CLINICS \nDIGITAL MARKETING AND SPONSORSHIP MARKETING EXPERTISE \n \nK12 CORPORATE FUNDING INITIATIVES: Connecting K12 district level funding needs with education appropriate corporate branding opportunities. Enabling school districts to use corporate funds for education specific initiatives in exchange for corporate branding, such as naming rights for athletic facilities. \n \nEffectively interprets market trend analysis, project management, product launches, partnership development, new business initiatives, and strategic business planning for maximum impact. This includes quota achievement and year over year growth, marketing programs, product positioning and launch management, insights and marketing research, advertising, media, sales and distribution channels all designed to reach consumer and business customers worldwide.  \n \nProven ability to deliver results in challenging and complex business situations, facilitate cross-functional collaboration, and manage teams. Impeccable networking, leadership, communication, and business analysis skills. \n \nAREAS OF EXPERTISE:  \n*Executive Coaching.  \n*Sales Training and Sales Leadership Training.  \n*Executive Leadership Coaching and Management Development.  \n*Digital Marketing \n \nSPECIALTIES:  \nTechnology solution sales management. Building High Performance Sales Teams. Strategic Selling.  \nChannel building. Executive level relationships. Vertical Marketing and Sales experience (including education, healthcare, smb, and financial). Brand building. High profile speaking engagements. Summary Larry Jaeger is an entrepreneurial, senior executive level marketing and solution sales professional with a strong background leading sales growth, marketing strategy and global brand management. \n \nEXECUTIVE COACHING - LEADERSHIP TRAINING - SALES SKILLS TRAINING AND CLINICS \nDIGITAL MARKETING AND SPONSORSHIP MARKETING EXPERTISE \n \nK12 CORPORATE FUNDING INITIATIVES: Connecting K12 district level funding needs with education appropriate corporate branding opportunities. Enabling school districts to use corporate funds for education specific initiatives in exchange for corporate branding, such as naming rights for athletic facilities. \n \nEffectively interprets market trend analysis, project management, product launches, partnership development, new business initiatives, and strategic business planning for maximum impact. This includes quota achievement and year over year growth, marketing programs, product positioning and launch management, insights and marketing research, advertising, media, sales and distribution channels all designed to reach consumer and business customers worldwide.  \n \nProven ability to deliver results in challenging and complex business situations, facilitate cross-functional collaboration, and manage teams. Impeccable networking, leadership, communication, and business analysis skills. \n \nAREAS OF EXPERTISE:  \n*Executive Coaching.  \n*Sales Training and Sales Leadership Training.  \n*Executive Leadership Coaching and Management Development.  \n*Digital Marketing \n \nSPECIALTIES:  \nTechnology solution sales management. Building High Performance Sales Teams. Strategic Selling.  \nChannel building. Executive level relationships. Vertical Marketing and Sales experience (including education, healthcare, smb, and financial). Brand building. High profile speaking engagements. Larry Jaeger is an entrepreneurial, senior executive level marketing and solution sales professional with a strong background leading sales growth, marketing strategy and global brand management. \n \nEXECUTIVE COACHING - LEADERSHIP TRAINING - SALES SKILLS TRAINING AND CLINICS \nDIGITAL MARKETING AND SPONSORSHIP MARKETING EXPERTISE \n \nK12 CORPORATE FUNDING INITIATIVES: Connecting K12 district level funding needs with education appropriate corporate branding opportunities. Enabling school districts to use corporate funds for education specific initiatives in exchange for corporate branding, such as naming rights for athletic facilities. \n \nEffectively interprets market trend analysis, project management, product launches, partnership development, new business initiatives, and strategic business planning for maximum impact. This includes quota achievement and year over year growth, marketing programs, product positioning and launch management, insights and marketing research, advertising, media, sales and distribution channels all designed to reach consumer and business customers worldwide.  \n \nProven ability to deliver results in challenging and complex business situations, facilitate cross-functional collaboration, and manage teams. Impeccable networking, leadership, communication, and business analysis skills. \n \nAREAS OF EXPERTISE:  \n*Executive Coaching.  \n*Sales Training and Sales Leadership Training.  \n*Executive Leadership Coaching and Management Development.  \n*Digital Marketing \n \nSPECIALTIES:  \nTechnology solution sales management. Building High Performance Sales Teams. Strategic Selling.  \nChannel building. Executive level relationships. Vertical Marketing and Sales experience (including education, healthcare, smb, and financial). Brand building. High profile speaking engagements. Larry Jaeger is an entrepreneurial, senior executive level marketing and solution sales professional with a strong background leading sales growth, marketing strategy and global brand management. \n \nEXECUTIVE COACHING - LEADERSHIP TRAINING - SALES SKILLS TRAINING AND CLINICS \nDIGITAL MARKETING AND SPONSORSHIP MARKETING EXPERTISE \n \nK12 CORPORATE FUNDING INITIATIVES: Connecting K12 district level funding needs with education appropriate corporate branding opportunities. Enabling school districts to use corporate funds for education specific initiatives in exchange for corporate branding, such as naming rights for athletic facilities. \n \nEffectively interprets market trend analysis, project management, product launches, partnership development, new business initiatives, and strategic business planning for maximum impact. This includes quota achievement and year over year growth, marketing programs, product positioning and launch management, insights and marketing research, advertising, media, sales and distribution channels all designed to reach consumer and business customers worldwide.  \n \nProven ability to deliver results in challenging and complex business situations, facilitate cross-functional collaboration, and manage teams. Impeccable networking, leadership, communication, and business analysis skills. \n \nAREAS OF EXPERTISE:  \n*Executive Coaching.  \n*Sales Training and Sales Leadership Training.  \n*Executive Leadership Coaching and Management Development.  \n*Digital Marketing \n \nSPECIALTIES:  \nTechnology solution sales management. Building High Performance Sales Teams. Strategic Selling.  \nChannel building. Executive level relationships. Vertical Marketing and Sales experience (including education, healthcare, smb, and financial). Brand building. High profile speaking engagements. Experience Director Channel Sales Salesforce 2014  – Present (1 year) Salesforce.com Marketing Cloud brings together a powerful digital marketing technology platform that empowers customer journeys across every touch point – email, mobile, social, web and beyond.  \n \nResponsible for managing the OEM embedded accounts channel partners and a remote team of Business Account Executives. Direct management of a team that works directly with these channel partners and end user customer accounts who use the Salesforce.com Marketing Cloud platform as the engine that drives and embedded or white label solution. Empowering some of the largest Fortune 500 name brand marketers to use a combination of predictive intelligence, email marketing, mobile SMS, MMS, and push notifications, social media publishing, advertising, and mobile app development to better connect with consumers across all digital marketing channels.  \n \nSuccessfully manages Partner to Partner Enablement by defining a joint business plan with regional and national solution partners. Targeted account planning for specific industry verticals by partner account reviews and strategy sessions. Manages a virtual team of industry, marketing, sales and technical resources to move partner opportunities accurately through the forecast and pipeline process. Responsible for direct relationships with major accounts and partners.  \n Director of Channel Sales Autodesk 2013  –  2014  (1 year) San Francisco Bay Area Manages mobile app distribution partners that include Apple iTunes, Amazon, Samsung, Google Play, Sony, and Microsoft. Responsible for all channel distribution for Autodesk consumer mobility apps and software solutions such as Sketchbook Pro, Pixlr, 123D, Homestyler and SocialCam.  \n \nAnalyze metrics to measure and optimize channel performance, and marketing development fund (MDF) budget.  \n \nStrategic team responsibility for Autodesk co-branded Maker Bot 3D printer premium bundled solution. Regional Sales Manager Apple, Inc. 2003  –  2012  (9 years) Cupertino, California Changing the paradigm of teaching and learning by creating digital learning environments. My role is to motivate and lead a virtual team of sales professionals who sell Apple digital learning solutions to schools and colleges throughout the midwest. Director of Global Accounts Dell Computer 2001  –  2003  (2 years) Austin, Texas Area Responsible for growing server and storage business at some of Dell's largest global accounts such as BP (British Petroleum) and Progressive Insurance. Specialized in the Healthcare and Financial verticals. Worked to integrate large back end software solutions such as Oracle, SAP, and People Soft. Area Sales Director Intel Corporation 1995  –  2001  (6 years) Santa Clara, California Successfully built new channels of distribution from the ground up in virgin markets where a new value proposition was developed. Managed a virtual team of Account Executives and Strategic Channel Representatives covering half of the United States and Canada. Responsible for million dollar plus marketing development funds. Strategic Relationship Manager Intel Corporation 1995  –  2001  (6 years) Santa Clara, California As part of Intel's E-Commerce team, I was chartered with working together with E-Business Solution providers to convert legacy mainframe infrastructure to Intel server based solutions providing Web 2.0 services from Oracle, People Soft, HP, IBM and others. Responsible for recruiting and managing ESBP's (E Business Solution Providers) and providing air cover for creation demand. Strategic Business Development Manager McAfee 1994  –  1995  (1 year) Santa Clara, California Worked with CIO's and other \"C\" level executives at Fortune 500 companies as a solution sales person providing distributed software solutions for analyzing traffic efficiencies and identifying trouble on large scale local area and wide area networks. Director Channel Sales Salesforce 2014  – Present (1 year) Salesforce.com Marketing Cloud brings together a powerful digital marketing technology platform that empowers customer journeys across every touch point – email, mobile, social, web and beyond.  \n \nResponsible for managing the OEM embedded accounts channel partners and a remote team of Business Account Executives. Direct management of a team that works directly with these channel partners and end user customer accounts who use the Salesforce.com Marketing Cloud platform as the engine that drives and embedded or white label solution. Empowering some of the largest Fortune 500 name brand marketers to use a combination of predictive intelligence, email marketing, mobile SMS, MMS, and push notifications, social media publishing, advertising, and mobile app development to better connect with consumers across all digital marketing channels.  \n \nSuccessfully manages Partner to Partner Enablement by defining a joint business plan with regional and national solution partners. Targeted account planning for specific industry verticals by partner account reviews and strategy sessions. Manages a virtual team of industry, marketing, sales and technical resources to move partner opportunities accurately through the forecast and pipeline process. Responsible for direct relationships with major accounts and partners.  \n Director Channel Sales Salesforce 2014  – Present (1 year) Salesforce.com Marketing Cloud brings together a powerful digital marketing technology platform that empowers customer journeys across every touch point – email, mobile, social, web and beyond.  \n \nResponsible for managing the OEM embedded accounts channel partners and a remote team of Business Account Executives. Direct management of a team that works directly with these channel partners and end user customer accounts who use the Salesforce.com Marketing Cloud platform as the engine that drives and embedded or white label solution. Empowering some of the largest Fortune 500 name brand marketers to use a combination of predictive intelligence, email marketing, mobile SMS, MMS, and push notifications, social media publishing, advertising, and mobile app development to better connect with consumers across all digital marketing channels.  \n \nSuccessfully manages Partner to Partner Enablement by defining a joint business plan with regional and national solution partners. Targeted account planning for specific industry verticals by partner account reviews and strategy sessions. Manages a virtual team of industry, marketing, sales and technical resources to move partner opportunities accurately through the forecast and pipeline process. Responsible for direct relationships with major accounts and partners.  \n Director of Channel Sales Autodesk 2013  –  2014  (1 year) San Francisco Bay Area Manages mobile app distribution partners that include Apple iTunes, Amazon, Samsung, Google Play, Sony, and Microsoft. Responsible for all channel distribution for Autodesk consumer mobility apps and software solutions such as Sketchbook Pro, Pixlr, 123D, Homestyler and SocialCam.  \n \nAnalyze metrics to measure and optimize channel performance, and marketing development fund (MDF) budget.  \n \nStrategic team responsibility for Autodesk co-branded Maker Bot 3D printer premium bundled solution. Director of Channel Sales Autodesk 2013  –  2014  (1 year) San Francisco Bay Area Manages mobile app distribution partners that include Apple iTunes, Amazon, Samsung, Google Play, Sony, and Microsoft. Responsible for all channel distribution for Autodesk consumer mobility apps and software solutions such as Sketchbook Pro, Pixlr, 123D, Homestyler and SocialCam.  \n \nAnalyze metrics to measure and optimize channel performance, and marketing development fund (MDF) budget.  \n \nStrategic team responsibility for Autodesk co-branded Maker Bot 3D printer premium bundled solution. Regional Sales Manager Apple, Inc. 2003  –  2012  (9 years) Cupertino, California Changing the paradigm of teaching and learning by creating digital learning environments. My role is to motivate and lead a virtual team of sales professionals who sell Apple digital learning solutions to schools and colleges throughout the midwest. Regional Sales Manager Apple, Inc. 2003  –  2012  (9 years) Cupertino, California Changing the paradigm of teaching and learning by creating digital learning environments. My role is to motivate and lead a virtual team of sales professionals who sell Apple digital learning solutions to schools and colleges throughout the midwest. Director of Global Accounts Dell Computer 2001  –  2003  (2 years) Austin, Texas Area Responsible for growing server and storage business at some of Dell's largest global accounts such as BP (British Petroleum) and Progressive Insurance. Specialized in the Healthcare and Financial verticals. Worked to integrate large back end software solutions such as Oracle, SAP, and People Soft. Director of Global Accounts Dell Computer 2001  –  2003  (2 years) Austin, Texas Area Responsible for growing server and storage business at some of Dell's largest global accounts such as BP (British Petroleum) and Progressive Insurance. Specialized in the Healthcare and Financial verticals. Worked to integrate large back end software solutions such as Oracle, SAP, and People Soft. Area Sales Director Intel Corporation 1995  –  2001  (6 years) Santa Clara, California Successfully built new channels of distribution from the ground up in virgin markets where a new value proposition was developed. Managed a virtual team of Account Executives and Strategic Channel Representatives covering half of the United States and Canada. Responsible for million dollar plus marketing development funds. Area Sales Director Intel Corporation 1995  –  2001  (6 years) Santa Clara, California Successfully built new channels of distribution from the ground up in virgin markets where a new value proposition was developed. Managed a virtual team of Account Executives and Strategic Channel Representatives covering half of the United States and Canada. Responsible for million dollar plus marketing development funds. Strategic Relationship Manager Intel Corporation 1995  –  2001  (6 years) Santa Clara, California As part of Intel's E-Commerce team, I was chartered with working together with E-Business Solution providers to convert legacy mainframe infrastructure to Intel server based solutions providing Web 2.0 services from Oracle, People Soft, HP, IBM and others. Responsible for recruiting and managing ESBP's (E Business Solution Providers) and providing air cover for creation demand. Strategic Relationship Manager Intel Corporation 1995  –  2001  (6 years) Santa Clara, California As part of Intel's E-Commerce team, I was chartered with working together with E-Business Solution providers to convert legacy mainframe infrastructure to Intel server based solutions providing Web 2.0 services from Oracle, People Soft, HP, IBM and others. Responsible for recruiting and managing ESBP's (E Business Solution Providers) and providing air cover for creation demand. Strategic Business Development Manager McAfee 1994  –  1995  (1 year) Santa Clara, California Worked with CIO's and other \"C\" level executives at Fortune 500 companies as a solution sales person providing distributed software solutions for analyzing traffic efficiencies and identifying trouble on large scale local area and wide area networks. Strategic Business Development Manager McAfee 1994  –  1995  (1 year) Santa Clara, California Worked with CIO's and other \"C\" level executives at Fortune 500 companies as a solution sales person providing distributed software solutions for analyzing traffic efficiencies and identifying trouble on large scale local area and wide area networks. Languages English Native or bilingual proficiency Spanish Professional working proficiency English Native or bilingual proficiency Spanish Professional working proficiency English Native or bilingual proficiency Spanish Professional working proficiency Native or bilingual proficiency Professional working proficiency Skills Alternative K12... Cross-functional Team... Strategic Planning Business Analysis Solution Selling SaaS Cloud Computing Education vertical... Education K-12 Education Funding Corporate Funding... Impact Solution Sales... Account Management Leadership Strategy Project Management New Business Development Sales Management Sales Process Sales Operations CRM Coaching E-commerce Professional Services Management Entrepreneurship Marketing Networking Product Development Team Management Integration Marketing Management Salesforce.com Direct Sales Interactive Advertising Strategic Partnerships Sponsorship Program... Product Marketing Go-to-market Strategy Enterprise Software Product Management Storage Lead Generation Product Launch Business Alliances Recruiting Partner Management Demand Generation Sales Enablement See 35+     See less Skills  Alternative K12... Cross-functional Team... Strategic Planning Business Analysis Solution Selling SaaS Cloud Computing Education vertical... Education K-12 Education Funding Corporate Funding... Impact Solution Sales... Account Management Leadership Strategy Project Management New Business Development Sales Management Sales Process Sales Operations CRM Coaching E-commerce Professional Services Management Entrepreneurship Marketing Networking Product Development Team Management Integration Marketing Management Salesforce.com Direct Sales Interactive Advertising Strategic Partnerships Sponsorship Program... Product Marketing Go-to-market Strategy Enterprise Software Product Management Storage Lead Generation Product Launch Business Alliances Recruiting Partner Management Demand Generation Sales Enablement See 35+     See less Alternative K12... Cross-functional Team... Strategic Planning Business Analysis Solution Selling SaaS Cloud Computing Education vertical... Education K-12 Education Funding Corporate Funding... Impact Solution Sales... Account Management Leadership Strategy Project Management New Business Development Sales Management Sales Process Sales Operations CRM Coaching E-commerce Professional Services Management Entrepreneurship Marketing Networking Product Development Team Management Integration Marketing Management Salesforce.com Direct Sales Interactive Advertising Strategic Partnerships Sponsorship Program... Product Marketing Go-to-market Strategy Enterprise Software Product Management Storage Lead Generation Product Launch Business Alliances Recruiting Partner Management Demand Generation Sales Enablement See 35+     See less Alternative K12... Cross-functional Team... Strategic Planning Business Analysis Solution Selling SaaS Cloud Computing Education vertical... Education K-12 Education Funding Corporate Funding... Impact Solution Sales... Account Management Leadership Strategy Project Management New Business Development Sales Management Sales Process Sales Operations CRM Coaching E-commerce Professional Services Management Entrepreneurship Marketing Networking Product Development Team Management Integration Marketing Management Salesforce.com Direct Sales Interactive Advertising Strategic Partnerships Sponsorship Program... Product Marketing Go-to-market Strategy Enterprise Software Product Management Storage Lead Generation Product Launch Business Alliances Recruiting Partner Management Demand Generation Sales Enablement See 35+     See less Education John Carroll University Bachelor of Arts (BA),  Radio , Television,  and Digital Communication + Marketing 1990  – 1994 Activities and Societies:  Station Manager / Program Manager at WJCU 88.7 FM radio station University of South Florida Master of Business Administration (MBA),  Sports Marketing John Carroll University Bachelor of Arts (BA),  Radio , Television,  and Digital Communication + Marketing 1990  – 1994 Activities and Societies:  Station Manager / Program Manager at WJCU 88.7 FM radio station John Carroll University Bachelor of Arts (BA),  Radio , Television,  and Digital Communication + Marketing 1990  – 1994 Activities and Societies:  Station Manager / Program Manager at WJCU 88.7 FM radio station John Carroll University Bachelor of Arts (BA),  Radio , Television,  and Digital Communication + Marketing 1990  – 1994 Activities and Societies:  Station Manager / Program Manager at WJCU 88.7 FM radio station University of South Florida Master of Business Administration (MBA),  Sports Marketing University of South Florida Master of Business Administration (MBA),  Sports Marketing University of South Florida Master of Business Administration (MBA),  Sports Marketing Honors & Awards Regional Sales Manager of the Year Apple, Inc January 2011 REGIONAL SALES MANAGER OF THE YEAR in 2011  \nApple Computer - North America Education Division American Marketing Association American Marketing Association Active member of multiple chapters of the American Marketing Association.  Regional Sales Manager of the Year Apple, Inc January 2008 REGIONAL SALES MANAGER OF THE YEAR in 2008  \nApple Computer - North America Education Division American Advertising Federation American Advertising Federation The American Advertising Federation (AAF) is the nations oldest national  \nadvertising trade association representing 40,000 advertising professionals.  Sales and Marketing Executives of Cleveland January 2014 Regional Sales Manager of the Year Apple, Inc January 2011 REGIONAL SALES MANAGER OF THE YEAR in 2011  \nApple Computer - North America Education Division Regional Sales Manager of the Year Apple, Inc January 2011 REGIONAL SALES MANAGER OF THE YEAR in 2011  \nApple Computer - North America Education Division Regional Sales Manager of the Year Apple, Inc January 2011 REGIONAL SALES MANAGER OF THE YEAR in 2011  \nApple Computer - North America Education Division American Marketing Association American Marketing Association Active member of multiple chapters of the American Marketing Association.  American Marketing Association American Marketing Association Active member of multiple chapters of the American Marketing Association.  American Marketing Association American Marketing Association Active member of multiple chapters of the American Marketing Association.  Regional Sales Manager of the Year Apple, Inc January 2008 REGIONAL SALES MANAGER OF THE YEAR in 2008  \nApple Computer - North America Education Division Regional Sales Manager of the Year Apple, Inc January 2008 REGIONAL SALES MANAGER OF THE YEAR in 2008  \nApple Computer - North America Education Division Regional Sales Manager of the Year Apple, Inc January 2008 REGIONAL SALES MANAGER OF THE YEAR in 2008  \nApple Computer - North America Education Division American Advertising Federation American Advertising Federation The American Advertising Federation (AAF) is the nations oldest national  \nadvertising trade association representing 40,000 advertising professionals.  American Advertising Federation American Advertising Federation The American Advertising Federation (AAF) is the nations oldest national  \nadvertising trade association representing 40,000 advertising professionals.  American Advertising Federation American Advertising Federation The American Advertising Federation (AAF) is the nations oldest national  \nadvertising trade association representing 40,000 advertising professionals.  Sales and Marketing Executives of Cleveland January 2014 Sales and Marketing Executives of Cleveland January 2014 Sales and Marketing Executives of Cleveland January 2014 ", "Experience Area Sales Director Intel May 2006  – Present (9 years 4 months) Technical Account Manager Intel January 2001  –  May 2006  (5 years 5 months) Regional Technical Sales Manager Wyle Electronics July 1998  –  January 2001  (2 years 7 months) Director of Technical Sales & Marketing Bell Microproducts, Inc. November 1995  –  July 1998  (2 years 9 months) Technical Sales Manager Future Electronics November 1992  –  November 1995  (3 years 1 month) Area Sales Director Intel May 2006  – Present (9 years 4 months) Area Sales Director Intel May 2006  – Present (9 years 4 months) Technical Account Manager Intel January 2001  –  May 2006  (5 years 5 months) Technical Account Manager Intel January 2001  –  May 2006  (5 years 5 months) Regional Technical Sales Manager Wyle Electronics July 1998  –  January 2001  (2 years 7 months) Regional Technical Sales Manager Wyle Electronics July 1998  –  January 2001  (2 years 7 months) Director of Technical Sales & Marketing Bell Microproducts, Inc. November 1995  –  July 1998  (2 years 9 months) Director of Technical Sales & Marketing Bell Microproducts, Inc. November 1995  –  July 1998  (2 years 9 months) Technical Sales Manager Future Electronics November 1992  –  November 1995  (3 years 1 month) Technical Sales Manager Future Electronics November 1992  –  November 1995  (3 years 1 month) Skills Semiconductor Industry Semiconductors ASIC Mixed Signal SoC Embedded Systems IC Analog Intel Electronics Product Development Wireless Cross-functional Team... EDA Start-ups Consumer Electronics Embedded Software Engineering Management Device Drivers FPGA Go-to-market Strategy PCB design Processors Product Management Product Marketing RF Ethernet Microcontrollers WiFi Strategic Leadership Thought Leadership See 16+     See less Skills  Semiconductor Industry Semiconductors ASIC Mixed Signal SoC Embedded Systems IC Analog Intel Electronics Product Development Wireless Cross-functional Team... EDA Start-ups Consumer Electronics Embedded Software Engineering Management Device Drivers FPGA Go-to-market Strategy PCB design Processors Product Management Product Marketing RF Ethernet Microcontrollers WiFi Strategic Leadership Thought Leadership See 16+     See less Semiconductor Industry Semiconductors ASIC Mixed Signal SoC Embedded Systems IC Analog Intel Electronics Product Development Wireless Cross-functional Team... EDA Start-ups Consumer Electronics Embedded Software Engineering Management Device Drivers FPGA Go-to-market Strategy PCB design Processors Product Management Product Marketing RF Ethernet Microcontrollers WiFi Strategic Leadership Thought Leadership See 16+     See less Semiconductor Industry Semiconductors ASIC Mixed Signal SoC Embedded Systems IC Analog Intel Electronics Product Development Wireless Cross-functional Team... EDA Start-ups Consumer Electronics Embedded Software Engineering Management Device Drivers FPGA Go-to-market Strategy PCB design Processors Product Management Product Marketing RF Ethernet Microcontrollers WiFi Strategic Leadership Thought Leadership See 16+     See less Education Princeton University BSEE 1983  – 1987 Lester B. Pearson College IB 1981  – 1983 Princeton University BSEE 1983  – 1987 Princeton University BSEE 1983  – 1987 Princeton University BSEE 1983  – 1987 Lester B. Pearson College IB 1981  – 1983 Lester B. Pearson College IB 1981  – 1983 Lester B. Pearson College IB 1981  – 1983 ", "Summary Cross-disciplined builder of global sales and marketing organizations who consistently exceeds financial and performance goals. Deep knowledge and experience selling technology in B2B environments across multiple channels. Possess strong commitment to team dynamics to achieve objectives. Able to communicate vision, build rapport, and create consensus at all levels through passion and common sense application of business acumen. Proven, operationally focused executive with strong track record of delivering results especially under challenged circumstances.  \n \nAn experienced component, systems, and solutions sales and marketing executive with proven skills in operational improvement and systems of execution. Proven performance in new business strategy and development, profitability, sales & marketing execution, global accounts, OEM and strategic alliance partnerships, operations, product management, contract negotiation, professional services, as well as corporate planning. Specialties:Forecast and Operations Planning, Decision Systems, Management Systems, Customer Support Systems, IT Systems as applied to customer facing roles, Change Management, General Management, Corporate Strategy, Business Development, Thought Leadership, Sales and Marketing including CRM Systems, Customer Negotiation Summary Cross-disciplined builder of global sales and marketing organizations who consistently exceeds financial and performance goals. Deep knowledge and experience selling technology in B2B environments across multiple channels. Possess strong commitment to team dynamics to achieve objectives. Able to communicate vision, build rapport, and create consensus at all levels through passion and common sense application of business acumen. Proven, operationally focused executive with strong track record of delivering results especially under challenged circumstances.  \n \nAn experienced component, systems, and solutions sales and marketing executive with proven skills in operational improvement and systems of execution. Proven performance in new business strategy and development, profitability, sales & marketing execution, global accounts, OEM and strategic alliance partnerships, operations, product management, contract negotiation, professional services, as well as corporate planning. Specialties:Forecast and Operations Planning, Decision Systems, Management Systems, Customer Support Systems, IT Systems as applied to customer facing roles, Change Management, General Management, Corporate Strategy, Business Development, Thought Leadership, Sales and Marketing including CRM Systems, Customer Negotiation Cross-disciplined builder of global sales and marketing organizations who consistently exceeds financial and performance goals. Deep knowledge and experience selling technology in B2B environments across multiple channels. Possess strong commitment to team dynamics to achieve objectives. Able to communicate vision, build rapport, and create consensus at all levels through passion and common sense application of business acumen. Proven, operationally focused executive with strong track record of delivering results especially under challenged circumstances.  \n \nAn experienced component, systems, and solutions sales and marketing executive with proven skills in operational improvement and systems of execution. Proven performance in new business strategy and development, profitability, sales & marketing execution, global accounts, OEM and strategic alliance partnerships, operations, product management, contract negotiation, professional services, as well as corporate planning. Specialties:Forecast and Operations Planning, Decision Systems, Management Systems, Customer Support Systems, IT Systems as applied to customer facing roles, Change Management, General Management, Corporate Strategy, Business Development, Thought Leadership, Sales and Marketing including CRM Systems, Customer Negotiation Cross-disciplined builder of global sales and marketing organizations who consistently exceeds financial and performance goals. Deep knowledge and experience selling technology in B2B environments across multiple channels. Possess strong commitment to team dynamics to achieve objectives. Able to communicate vision, build rapport, and create consensus at all levels through passion and common sense application of business acumen. Proven, operationally focused executive with strong track record of delivering results especially under challenged circumstances.  \n \nAn experienced component, systems, and solutions sales and marketing executive with proven skills in operational improvement and systems of execution. Proven performance in new business strategy and development, profitability, sales & marketing execution, global accounts, OEM and strategic alliance partnerships, operations, product management, contract negotiation, professional services, as well as corporate planning. Specialties:Forecast and Operations Planning, Decision Systems, Management Systems, Customer Support Systems, IT Systems as applied to customer facing roles, Change Management, General Management, Corporate Strategy, Business Development, Thought Leadership, Sales and Marketing including CRM Systems, Customer Negotiation Experience Group Sales Director, WW Internet of Things & Machine-to-Machine (IoT/M2M) Business Development Intel Corporation July 2011  – Present (4 years 2 months) Schaumburg, IL Sr. Director, WW Strategy and Business Development Anadigics 2010  –  July 2011  (1 year) VP Field Sales, WW Embedded Sales AMD 2004  –  2010  (6 years) Sr. VP, Director WW Sales Sipex Corporation 2003  –  2004  (1 year) VP, Director America's Sales and Marketing Fairchild Semiconductor 2002  –  2003  (1 year) VP Sales Motorola Semiconductor 1981  –  2002  (21 years) Group Sales Director, WW Internet of Things & Machine-to-Machine (IoT/M2M) Business Development Intel Corporation July 2011  – Present (4 years 2 months) Schaumburg, IL Group Sales Director, WW Internet of Things & Machine-to-Machine (IoT/M2M) Business Development Intel Corporation July 2011  – Present (4 years 2 months) Schaumburg, IL Sr. Director, WW Strategy and Business Development Anadigics 2010  –  July 2011  (1 year) Sr. Director, WW Strategy and Business Development Anadigics 2010  –  July 2011  (1 year) VP Field Sales, WW Embedded Sales AMD 2004  –  2010  (6 years) VP Field Sales, WW Embedded Sales AMD 2004  –  2010  (6 years) Sr. VP, Director WW Sales Sipex Corporation 2003  –  2004  (1 year) Sr. VP, Director WW Sales Sipex Corporation 2003  –  2004  (1 year) VP, Director America's Sales and Marketing Fairchild Semiconductor 2002  –  2003  (1 year) VP, Director America's Sales and Marketing Fairchild Semiconductor 2002  –  2003  (1 year) VP Sales Motorola Semiconductor 1981  –  2002  (21 years) VP Sales Motorola Semiconductor 1981  –  2002  (21 years) Languages German German German Skills Business Development Business Strategy Negotiation Change Management Thought Leadership Customer Support Decision Support Semiconductors Management System Product Management Product Marketing Go-to-market Strategy Cross-functional Team... Start-ups Product Development Wireless Strategic Partnerships Competitive Analysis New Business Development Consumer Electronics B2B Cloud Computing Contract Negotiation Enterprise Software IC Internet of Things M2M Management Marketing Product Launch Program Management Sales Sales Management Sales Operations Selling Semiconductor Industry Strategic Planning Strategy See 23+     See less Skills  Business Development Business Strategy Negotiation Change Management Thought Leadership Customer Support Decision Support Semiconductors Management System Product Management Product Marketing Go-to-market Strategy Cross-functional Team... Start-ups Product Development Wireless Strategic Partnerships Competitive Analysis New Business Development Consumer Electronics B2B Cloud Computing Contract Negotiation Enterprise Software IC Internet of Things M2M Management Marketing Product Launch Program Management Sales Sales Management Sales Operations Selling Semiconductor Industry Strategic Planning Strategy See 23+     See less Business Development Business Strategy Negotiation Change Management Thought Leadership Customer Support Decision Support Semiconductors Management System Product Management Product Marketing Go-to-market Strategy Cross-functional Team... Start-ups Product Development Wireless Strategic Partnerships Competitive Analysis New Business Development Consumer Electronics B2B Cloud Computing Contract Negotiation Enterprise Software IC Internet of Things M2M Management Marketing Product Launch Program Management Sales Sales Management Sales Operations Selling Semiconductor Industry Strategic Planning Strategy See 23+     See less Business Development Business Strategy Negotiation Change Management Thought Leadership Customer Support Decision Support Semiconductors Management System Product Management Product Marketing Go-to-market Strategy Cross-functional Team... Start-ups Product Development Wireless Strategic Partnerships Competitive Analysis New Business Development Consumer Electronics B2B Cloud Computing Contract Negotiation Enterprise Software IC Internet of Things M2M Management Marketing Product Launch Program Management Sales Sales Management Sales Operations Selling Semiconductor Industry Strategic Planning Strategy See 23+     See less Education University of Illinois at Urbana-Champaign BS Engineering 1976  – 1981 Loyola Academy, Wilmette, IL High School 1972  – 1976 University of Illinois at Urbana-Champaign BS Engineering 1976  – 1981 University of Illinois at Urbana-Champaign BS Engineering 1976  – 1981 University of Illinois at Urbana-Champaign BS Engineering 1976  – 1981 Loyola Academy, Wilmette, IL High School 1972  – 1976 Loyola Academy, Wilmette, IL High School 1972  – 1976 Loyola Academy, Wilmette, IL High School 1972  – 1976 ", "Summary - International MBA with 7 years of senior management managing country and regional P&L \n- More than 26 years of working experience in Aviation, IT and Telecommunications industry of which 17 years in Telecom. \n- Possesses unique skill sets in managing channels, Global ISV/SI, OEM partners, sales & marketing and project management. \n- Key strength is entrepreneurial skills that develops new opportunities, manages effectively and delivers results.  \n- Excellent interpersonal skills spanning across different cultures and ethnicities. \n- Adept at both large companies and start-ups \n- Multilingual : fluent in English and Mandarin in both written and oral. Well verse in multiple Chinese dialects: Cantonese, Hokkien and Teochew. \n \nSpecialties  \n• Profitable P&L experience \n• Sales and Marketing \n• Channel and Partner go-to-market competencies \n• Entrepreneur skills \n• Large deals negotiation \n• Consulting  \n• Project management \n• Complex solution selling Summary - International MBA with 7 years of senior management managing country and regional P&L \n- More than 26 years of working experience in Aviation, IT and Telecommunications industry of which 17 years in Telecom. \n- Possesses unique skill sets in managing channels, Global ISV/SI, OEM partners, sales & marketing and project management. \n- Key strength is entrepreneurial skills that develops new opportunities, manages effectively and delivers results.  \n- Excellent interpersonal skills spanning across different cultures and ethnicities. \n- Adept at both large companies and start-ups \n- Multilingual : fluent in English and Mandarin in both written and oral. Well verse in multiple Chinese dialects: Cantonese, Hokkien and Teochew. \n \nSpecialties  \n• Profitable P&L experience \n• Sales and Marketing \n• Channel and Partner go-to-market competencies \n• Entrepreneur skills \n• Large deals negotiation \n• Consulting  \n• Project management \n• Complex solution selling - International MBA with 7 years of senior management managing country and regional P&L \n- More than 26 years of working experience in Aviation, IT and Telecommunications industry of which 17 years in Telecom. \n- Possesses unique skill sets in managing channels, Global ISV/SI, OEM partners, sales & marketing and project management. \n- Key strength is entrepreneurial skills that develops new opportunities, manages effectively and delivers results.  \n- Excellent interpersonal skills spanning across different cultures and ethnicities. \n- Adept at both large companies and start-ups \n- Multilingual : fluent in English and Mandarin in both written and oral. Well verse in multiple Chinese dialects: Cantonese, Hokkien and Teochew. \n \nSpecialties  \n• Profitable P&L experience \n• Sales and Marketing \n• Channel and Partner go-to-market competencies \n• Entrepreneur skills \n• Large deals negotiation \n• Consulting  \n• Project management \n• Complex solution selling - International MBA with 7 years of senior management managing country and regional P&L \n- More than 26 years of working experience in Aviation, IT and Telecommunications industry of which 17 years in Telecom. \n- Possesses unique skill sets in managing channels, Global ISV/SI, OEM partners, sales & marketing and project management. \n- Key strength is entrepreneurial skills that develops new opportunities, manages effectively and delivers results.  \n- Excellent interpersonal skills spanning across different cultures and ethnicities. \n- Adept at both large companies and start-ups \n- Multilingual : fluent in English and Mandarin in both written and oral. Well verse in multiple Chinese dialects: Cantonese, Hokkien and Teochew. \n \nSpecialties  \n• Profitable P&L experience \n• Sales and Marketing \n• Channel and Partner go-to-market competencies \n• Entrepreneur skills \n• Large deals negotiation \n• Consulting  \n• Project management \n• Complex solution selling Experience Regional Sales Director Intel Corporation August 2013  – Present (2 years 1 month) Singapore API Management, Security Tokenisation and Cloud services Assistant Vice President Software (APAC) Green Packet Berhad November 2010  – Present (4 years 10 months) Singapore Director of Sales (Asia Pacifc) Smith Micro Software May 2008  –  November 2010  (2 years 7 months) Singapore Business Development Director Asia Pacfic region Hewlett-Packard September 2006  –  October 2007  (1 year 2 months) Singapore Regional Director Asia Pacific Glenayre Electronics Pte Ltd April 2005  –  August 2006  (1 year 5 months) Singapore Business Development & Alliance Director LogicaCMG January 2001  –  February 2005  (4 years 2 months) Singapore Country Manager HPCP Hewlett-Packard 1996  –  2000  (4 years) Regional Sales Director Intel Corporation August 2013  – Present (2 years 1 month) Singapore API Management, Security Tokenisation and Cloud services Regional Sales Director Intel Corporation August 2013  – Present (2 years 1 month) Singapore API Management, Security Tokenisation and Cloud services Assistant Vice President Software (APAC) Green Packet Berhad November 2010  – Present (4 years 10 months) Singapore Assistant Vice President Software (APAC) Green Packet Berhad November 2010  – Present (4 years 10 months) Singapore Director of Sales (Asia Pacifc) Smith Micro Software May 2008  –  November 2010  (2 years 7 months) Singapore Director of Sales (Asia Pacifc) Smith Micro Software May 2008  –  November 2010  (2 years 7 months) Singapore Business Development Director Asia Pacfic region Hewlett-Packard September 2006  –  October 2007  (1 year 2 months) Singapore Business Development Director Asia Pacfic region Hewlett-Packard September 2006  –  October 2007  (1 year 2 months) Singapore Regional Director Asia Pacific Glenayre Electronics Pte Ltd April 2005  –  August 2006  (1 year 5 months) Singapore Regional Director Asia Pacific Glenayre Electronics Pte Ltd April 2005  –  August 2006  (1 year 5 months) Singapore Business Development & Alliance Director LogicaCMG January 2001  –  February 2005  (4 years 2 months) Singapore Business Development & Alliance Director LogicaCMG January 2001  –  February 2005  (4 years 2 months) Singapore Country Manager HPCP Hewlett-Packard 1996  –  2000  (4 years) Country Manager HPCP Hewlett-Packard 1996  –  2000  (4 years) Languages   Skills Telecommunications Pre-sales Business Development Product Management Mobile Devices Solution Selling Start-ups Go-to-market Strategy Cloud Computing SaaS Skills  Telecommunications Pre-sales Business Development Product Management Mobile Devices Solution Selling Start-ups Go-to-market Strategy Cloud Computing SaaS Telecommunications Pre-sales Business Development Product Management Mobile Devices Solution Selling Start-ups Go-to-market Strategy Cloud Computing SaaS Telecommunications Pre-sales Business Development Product Management Mobile Devices Solution Selling Start-ups Go-to-market Strategy Cloud Computing SaaS Education University of Leicester Master of Business Administration (MBA),  Economics 1994  – 1998 University of Leicester Master of Business Administration (MBA),  Economics 1994  – 1998 University of Leicester Master of Business Administration (MBA),  Economics 1994  – 1998 University of Leicester Master of Business Administration (MBA),  Economics 1994  – 1998 ", "Languages English Professional working proficiency Spanish Limited working proficiency Portuguese Native or bilingual proficiency English Professional working proficiency Spanish Limited working proficiency Portuguese Native or bilingual proficiency English Professional working proficiency Spanish Limited working proficiency Portuguese Native or bilingual proficiency Professional working proficiency Limited working proficiency Native or bilingual proficiency Skills Channel Marketing Business Management New Business Development People Management Negotiation Sales Management Management Multi-channel Marketing Product Marketing Business Alliances Business Strategy Strategy Business Planning Account Management Team Management Digital Marketing Telecommunications International Business Business Development Marketing Strategy Marketing Communications Strategic Planning Cloud Computing Product Management Strategic Partnerships Leadership Marketing B2B Go-to-market Strategy Channel Channel Partners Competitive Analysis Cross-functional Team... See 18+     See less Skills  Channel Marketing Business Management New Business Development People Management Negotiation Sales Management Management Multi-channel Marketing Product Marketing Business Alliances Business Strategy Strategy Business Planning Account Management Team Management Digital Marketing Telecommunications International Business Business Development Marketing Strategy Marketing Communications Strategic Planning Cloud Computing Product Management Strategic Partnerships Leadership Marketing B2B Go-to-market Strategy Channel Channel Partners Competitive Analysis Cross-functional Team... See 18+     See less Channel Marketing Business Management New Business Development People Management Negotiation Sales Management Management Multi-channel Marketing Product Marketing Business Alliances Business Strategy Strategy Business Planning Account Management Team Management Digital Marketing Telecommunications International Business Business Development Marketing Strategy Marketing Communications Strategic Planning Cloud Computing Product Management Strategic Partnerships Leadership Marketing B2B Go-to-market Strategy Channel Channel Partners Competitive Analysis Cross-functional Team... See 18+     See less Channel Marketing Business Management New Business Development People Management Negotiation Sales Management Management Multi-channel Marketing Product Marketing Business Alliances Business Strategy Strategy Business Planning Account Management Team Management Digital Marketing Telecommunications International Business Business Development Marketing Strategy Marketing Communications Strategic Planning Cloud Computing Product Management Strategic Partnerships Leadership Marketing B2B Go-to-market Strategy Channel Channel Partners Competitive Analysis Cross-functional Team... See 18+     See less ", "Summary I am a passionate and driven sales manager with over 18 years of experience selling software to enterprises and telecom operators.  \nI particularly enjoy winning large and complex deals in an international setting. \nI have a proven successful sales track record in delivering and exceeding quotas. \n \nSpecialties: Management of strategic customer accounts, business development, large/complex deal sales in competitive environments, channel qualification and management. Summary I am a passionate and driven sales manager with over 18 years of experience selling software to enterprises and telecom operators.  \nI particularly enjoy winning large and complex deals in an international setting. \nI have a proven successful sales track record in delivering and exceeding quotas. \n \nSpecialties: Management of strategic customer accounts, business development, large/complex deal sales in competitive environments, channel qualification and management. I am a passionate and driven sales manager with over 18 years of experience selling software to enterprises and telecom operators.  \nI particularly enjoy winning large and complex deals in an international setting. \nI have a proven successful sales track record in delivering and exceeding quotas. \n \nSpecialties: Management of strategic customer accounts, business development, large/complex deal sales in competitive environments, channel qualification and management. I am a passionate and driven sales manager with over 18 years of experience selling software to enterprises and telecom operators.  \nI particularly enjoy winning large and complex deals in an international setting. \nI have a proven successful sales track record in delivering and exceeding quotas. \n \nSpecialties: Management of strategic customer accounts, business development, large/complex deal sales in competitive environments, channel qualification and management. Experience Regional Sales Director Intel Corporation July 2014  – Present (1 year 2 months) Paris Area, France Director of Sales - Central and South of Europe - Intel Mashery API management business unit.  \n \nMy responsibilities are to build our business with telcos and large & medium enterprises in Central & South of Europe. Regional Sales Director Intel Corporation April 2013  –  June 2014  (1 year 3 months) Paris France Director of Sales - Orange Global account, France and Benelux - Software and Services Group. \n \nIntel Software business is big. If we were an independent company, we would have been in the world’s top 10 software companies as measured by engineering staff size. \nI am responsible for selling Intel's Internet of Things solutions, security gateways, cloud services, mCommerce and API exposure and monetization platforms to Orange Group & affiliates and the mobile operators in France and Benelux. Regional Sales Director Aepona 2008  –  April 2013  (5 years) www.aepona.com Director of Sales - Orange Global account, KPN, Belgacom, Central Europe. \nSales of software, services, support & maintenance.  \nI drove sales up by 300% over the course of 3 years. \nPenetrated strategic accounts and closed large licensing deals.  \n \nAepona software platforms enable operators to expose and monetize their core assets through a powerful API gateway and a feature-rich payment platform. We also have world-class VAS and IN platforms built around a highly scalable Java development platform, network gateway and a service brokering engine.  \nIn April 2013, Intel acquired Aepona. http://www.aepona.com/intel-and-aepona/ Head of Carrier Sales - France and Benelux Nokia 2007  –  2007  (less than a year) France Directed sales of the Nokia Intellisync product suite and solutions to mobile operators in France and Benelux. \n \nWhen I joined, Intellisync had just been acquired by Nokia - the main product was a mobile suite software (wireless email, systems/device management, file sync and application sync). Regional Sales Manager Openwave 2000  –  2006  (6 years) Directed sales for Vodafone opcos across Southern Europe including France, Italy, Spain. \nI started as a sales engineer across the territory and then moved to the regional sales manager position in 2003.  \n12mil USD+ in revenues, above quota. \nExceeded sales targets 3 years in a row  \n \nOpenwave product portfolio at the time included WAP gateways, MMSC, messaging systems. Business Development Manager C.I.S 1997  –  2000  (3 years) Business development for financial solutions (Electronic Banking, credit card management systems), Global solutions (e-CRM and Content Management and Personalization) and Security solutions. \nI also worked on smart metering solutions for electricity companies. The ancestors of today's M2M solutions. Sales Manager NetGate 1995  –  1997  (2 years) In charge of the sales of Netgate Internet Services and X400 messaging solutions. \nBack then, it wasn't easy to convince companies to invest in building a web presence, and deploying messaging platforms, but it was great fun! Sales KBCOM 1993  –  1995  (2 years) My first job (half time - while completing my degree) - sales of AT&T central switching systems. Regional Sales Director Intel Corporation July 2014  – Present (1 year 2 months) Paris Area, France Director of Sales - Central and South of Europe - Intel Mashery API management business unit.  \n \nMy responsibilities are to build our business with telcos and large & medium enterprises in Central & South of Europe. Regional Sales Director Intel Corporation July 2014  – Present (1 year 2 months) Paris Area, France Director of Sales - Central and South of Europe - Intel Mashery API management business unit.  \n \nMy responsibilities are to build our business with telcos and large & medium enterprises in Central & South of Europe. Regional Sales Director Intel Corporation April 2013  –  June 2014  (1 year 3 months) Paris France Director of Sales - Orange Global account, France and Benelux - Software and Services Group. \n \nIntel Software business is big. If we were an independent company, we would have been in the world’s top 10 software companies as measured by engineering staff size. \nI am responsible for selling Intel's Internet of Things solutions, security gateways, cloud services, mCommerce and API exposure and monetization platforms to Orange Group & affiliates and the mobile operators in France and Benelux. Regional Sales Director Intel Corporation April 2013  –  June 2014  (1 year 3 months) Paris France Director of Sales - Orange Global account, France and Benelux - Software and Services Group. \n \nIntel Software business is big. If we were an independent company, we would have been in the world’s top 10 software companies as measured by engineering staff size. \nI am responsible for selling Intel's Internet of Things solutions, security gateways, cloud services, mCommerce and API exposure and monetization platforms to Orange Group & affiliates and the mobile operators in France and Benelux. Regional Sales Director Aepona 2008  –  April 2013  (5 years) www.aepona.com Director of Sales - Orange Global account, KPN, Belgacom, Central Europe. \nSales of software, services, support & maintenance.  \nI drove sales up by 300% over the course of 3 years. \nPenetrated strategic accounts and closed large licensing deals.  \n \nAepona software platforms enable operators to expose and monetize their core assets through a powerful API gateway and a feature-rich payment platform. We also have world-class VAS and IN platforms built around a highly scalable Java development platform, network gateway and a service brokering engine.  \nIn April 2013, Intel acquired Aepona. http://www.aepona.com/intel-and-aepona/ Regional Sales Director Aepona 2008  –  April 2013  (5 years) www.aepona.com Director of Sales - Orange Global account, KPN, Belgacom, Central Europe. \nSales of software, services, support & maintenance.  \nI drove sales up by 300% over the course of 3 years. \nPenetrated strategic accounts and closed large licensing deals.  \n \nAepona software platforms enable operators to expose and monetize their core assets through a powerful API gateway and a feature-rich payment platform. We also have world-class VAS and IN platforms built around a highly scalable Java development platform, network gateway and a service brokering engine.  \nIn April 2013, Intel acquired Aepona. http://www.aepona.com/intel-and-aepona/ Head of Carrier Sales - France and Benelux Nokia 2007  –  2007  (less than a year) France Directed sales of the Nokia Intellisync product suite and solutions to mobile operators in France and Benelux. \n \nWhen I joined, Intellisync had just been acquired by Nokia - the main product was a mobile suite software (wireless email, systems/device management, file sync and application sync). Head of Carrier Sales - France and Benelux Nokia 2007  –  2007  (less than a year) France Directed sales of the Nokia Intellisync product suite and solutions to mobile operators in France and Benelux. \n \nWhen I joined, Intellisync had just been acquired by Nokia - the main product was a mobile suite software (wireless email, systems/device management, file sync and application sync). Regional Sales Manager Openwave 2000  –  2006  (6 years) Directed sales for Vodafone opcos across Southern Europe including France, Italy, Spain. \nI started as a sales engineer across the territory and then moved to the regional sales manager position in 2003.  \n12mil USD+ in revenues, above quota. \nExceeded sales targets 3 years in a row  \n \nOpenwave product portfolio at the time included WAP gateways, MMSC, messaging systems. Regional Sales Manager Openwave 2000  –  2006  (6 years) Directed sales for Vodafone opcos across Southern Europe including France, Italy, Spain. \nI started as a sales engineer across the territory and then moved to the regional sales manager position in 2003.  \n12mil USD+ in revenues, above quota. \nExceeded sales targets 3 years in a row  \n \nOpenwave product portfolio at the time included WAP gateways, MMSC, messaging systems. Business Development Manager C.I.S 1997  –  2000  (3 years) Business development for financial solutions (Electronic Banking, credit card management systems), Global solutions (e-CRM and Content Management and Personalization) and Security solutions. \nI also worked on smart metering solutions for electricity companies. The ancestors of today's M2M solutions. Business Development Manager C.I.S 1997  –  2000  (3 years) Business development for financial solutions (Electronic Banking, credit card management systems), Global solutions (e-CRM and Content Management and Personalization) and Security solutions. \nI also worked on smart metering solutions for electricity companies. The ancestors of today's M2M solutions. Sales Manager NetGate 1995  –  1997  (2 years) In charge of the sales of Netgate Internet Services and X400 messaging solutions. \nBack then, it wasn't easy to convince companies to invest in building a web presence, and deploying messaging platforms, but it was great fun! Sales Manager NetGate 1995  –  1997  (2 years) In charge of the sales of Netgate Internet Services and X400 messaging solutions. \nBack then, it wasn't easy to convince companies to invest in building a web presence, and deploying messaging platforms, but it was great fun! Sales KBCOM 1993  –  1995  (2 years) My first job (half time - while completing my degree) - sales of AT&T central switching systems. Sales KBCOM 1993  –  1995  (2 years) My first job (half time - while completing my degree) - sales of AT&T central switching systems. Languages French Native or bilingual proficiency English Full professional proficiency Arabic Native or bilingual proficiency Italian Limited working proficiency French Native or bilingual proficiency English Full professional proficiency Arabic Native or bilingual proficiency Italian Limited working proficiency French Native or bilingual proficiency English Full professional proficiency Arabic Native or bilingual proficiency Italian Limited working proficiency Native or bilingual proficiency Full professional proficiency Native or bilingual proficiency Limited working proficiency Skills Telecommunications Business Development Strategy Mobile Devices Team Management Management Sales Start-ups Business Alliances Wireless SaaS Business Strategy Strategic Partnerships Team Leadership Go-to-market Strategy Managed Services Mobile Technology Solution Selling Negotiation Cloud Computing Change Management Product Marketing Security Organizational Culture Selling Pre-sales Channel Partners Partner Management Mobile Communications CRM Enterprise Software Professional Services International Sales Mobile Applications Account Management Cloud computing See 21+     See less Skills  Telecommunications Business Development Strategy Mobile Devices Team Management Management Sales Start-ups Business Alliances Wireless SaaS Business Strategy Strategic Partnerships Team Leadership Go-to-market Strategy Managed Services Mobile Technology Solution Selling Negotiation Cloud Computing Change Management Product Marketing Security Organizational Culture Selling Pre-sales Channel Partners Partner Management Mobile Communications CRM Enterprise Software Professional Services International Sales Mobile Applications Account Management Cloud computing See 21+     See less Telecommunications Business Development Strategy Mobile Devices Team Management Management Sales Start-ups Business Alliances Wireless SaaS Business Strategy Strategic Partnerships Team Leadership Go-to-market Strategy Managed Services Mobile Technology Solution Selling Negotiation Cloud Computing Change Management Product Marketing Security Organizational Culture Selling Pre-sales Channel Partners Partner Management Mobile Communications CRM Enterprise Software Professional Services International Sales Mobile Applications Account Management Cloud computing See 21+     See less Telecommunications Business Development Strategy Mobile Devices Team Management Management Sales Start-ups Business Alliances Wireless SaaS Business Strategy Strategic Partnerships Team Leadership Go-to-market Strategy Managed Services Mobile Technology Solution Selling Negotiation Cloud Computing Change Management Product Marketing Security Organizational Culture Selling Pre-sales Channel Partners Partner Management Mobile Communications CRM Enterprise Software Professional Services International Sales Mobile Applications Account Management Cloud computing See 21+     See less "]}