{"position": "Sales and Marketing Manager", "company": "Intel Corporation", "profiles": ["Experience Channel Sales & Marketing Manager Intel Corporation May 2015  – Present (4 months) Northern European Territory Consumer Sales & Marketing Intel Corporation March 2014  –  April 2015  (1 year 2 months) Netherlands Sales & Marketing intern for the consumer sales & marketing team in the Netherlands.  Sales Media Markt July 2013  –  March 2014  (9 months) Utrecht Area, Netherlands Consulting consumers on computer hardware and accessories. Graduation Intern Intel Corporation March 2012  –  April 2013  (1 year 2 months) Graduated at Intel on “Ultrabook, subcategory creation” with the Benelux Consumer Marketing & Sales team. Student juror SAN Accent December 2011  –  June 2012  (7 months) Amsterdam Area, Netherlands SAN Accent jury 2012, Category: Corporate. Intern Account Manager Gummo February 2011  –  July 2011  (6 months) Amsterdam, Netherlands Assisting the account management team on several projects for clients like Maag Lever Darm Stichting, Staatsbosbeheer, Jongerius Bakkerij, John Altman and Gummo. Channel Sales & Marketing Manager Intel Corporation May 2015  – Present (4 months) Northern European Territory Channel Sales & Marketing Manager Intel Corporation May 2015  – Present (4 months) Northern European Territory Consumer Sales & Marketing Intel Corporation March 2014  –  April 2015  (1 year 2 months) Netherlands Sales & Marketing intern for the consumer sales & marketing team in the Netherlands.  Consumer Sales & Marketing Intel Corporation March 2014  –  April 2015  (1 year 2 months) Netherlands Sales & Marketing intern for the consumer sales & marketing team in the Netherlands.  Sales Media Markt July 2013  –  March 2014  (9 months) Utrecht Area, Netherlands Consulting consumers on computer hardware and accessories. Sales Media Markt July 2013  –  March 2014  (9 months) Utrecht Area, Netherlands Consulting consumers on computer hardware and accessories. Graduation Intern Intel Corporation March 2012  –  April 2013  (1 year 2 months) Graduated at Intel on “Ultrabook, subcategory creation” with the Benelux Consumer Marketing & Sales team. Graduation Intern Intel Corporation March 2012  –  April 2013  (1 year 2 months) Graduated at Intel on “Ultrabook, subcategory creation” with the Benelux Consumer Marketing & Sales team. Student juror SAN Accent December 2011  –  June 2012  (7 months) Amsterdam Area, Netherlands SAN Accent jury 2012, Category: Corporate. Student juror SAN Accent December 2011  –  June 2012  (7 months) Amsterdam Area, Netherlands SAN Accent jury 2012, Category: Corporate. Intern Account Manager Gummo February 2011  –  July 2011  (6 months) Amsterdam, Netherlands Assisting the account management team on several projects for clients like Maag Lever Darm Stichting, Staatsbosbeheer, Jongerius Bakkerij, John Altman and Gummo. Intern Account Manager Gummo February 2011  –  July 2011  (6 months) Amsterdam, Netherlands Assisting the account management team on several projects for clients like Maag Lever Darm Stichting, Staatsbosbeheer, Jongerius Bakkerij, John Altman and Gummo. Languages   Skills Advertising Marketing Communications Social Media Marketing Strategy Dutch Brand Management English Marketing Social Media Marketing New Media Online Marketing Online Advertising Public Relations Photoshop Research SPSS Sales Consumer Behaviour Project Management Retail Marketing Retail Sales Consumer Electronics Consumer Marketing Consumer Insight Marketing Management See 10+     See less Skills  Advertising Marketing Communications Social Media Marketing Strategy Dutch Brand Management English Marketing Social Media Marketing New Media Online Marketing Online Advertising Public Relations Photoshop Research SPSS Sales Consumer Behaviour Project Management Retail Marketing Retail Sales Consumer Electronics Consumer Marketing Consumer Insight Marketing Management See 10+     See less Advertising Marketing Communications Social Media Marketing Strategy Dutch Brand Management English Marketing Social Media Marketing New Media Online Marketing Online Advertising Public Relations Photoshop Research SPSS Sales Consumer Behaviour Project Management Retail Marketing Retail Sales Consumer Electronics Consumer Marketing Consumer Insight Marketing Management See 10+     See less Advertising Marketing Communications Social Media Marketing Strategy Dutch Brand Management English Marketing Social Media Marketing New Media Online Marketing Online Advertising Public Relations Photoshop Research SPSS Sales Consumer Behaviour Project Management Retail Marketing Retail Sales Consumer Electronics Consumer Marketing Consumer Insight Marketing Management See 10+     See less Education Leiden University Master's Degree,  Economic & Consumer Psychology 2014  – 2015 Leiden University Pre-masters,  Psychology 2013  – 2014 Pre-master Psychology in preparation of the Master Economic and Consumer Psychology. Amsterdam University of Applied Sciences Honours Student 2011  – 2012 Realization of 'Run the Rail': a game that playfully explains the complexity of the Dutch rail network. During MCI Honours on behalf of Delft University of Technology. Amsterdam University of Applied Sciences Minor,  Brand management 2011  – 2012 Amsterdam University of Applied Sciences Bachelor's Degree,  Advertising ,  Marketing & Commucations 2008  – 2012 Graduated at the Sales & Marketing team of Intel Benelux on 'Ultrabook; Subcategory creation'. Montessori Lyceum Herman Jordan High School,  Economy & Society 1999  – 2006 Activities and Societies:  CKV3 - Music Leiden University Master's Degree,  Economic & Consumer Psychology 2014  – 2015 Leiden University Master's Degree,  Economic & Consumer Psychology 2014  – 2015 Leiden University Master's Degree,  Economic & Consumer Psychology 2014  – 2015 Leiden University Pre-masters,  Psychology 2013  – 2014 Pre-master Psychology in preparation of the Master Economic and Consumer Psychology. Leiden University Pre-masters,  Psychology 2013  – 2014 Pre-master Psychology in preparation of the Master Economic and Consumer Psychology. Leiden University Pre-masters,  Psychology 2013  – 2014 Pre-master Psychology in preparation of the Master Economic and Consumer Psychology. Amsterdam University of Applied Sciences Honours Student 2011  – 2012 Realization of 'Run the Rail': a game that playfully explains the complexity of the Dutch rail network. During MCI Honours on behalf of Delft University of Technology. Amsterdam University of Applied Sciences Honours Student 2011  – 2012 Realization of 'Run the Rail': a game that playfully explains the complexity of the Dutch rail network. During MCI Honours on behalf of Delft University of Technology. Amsterdam University of Applied Sciences Honours Student 2011  – 2012 Realization of 'Run the Rail': a game that playfully explains the complexity of the Dutch rail network. During MCI Honours on behalf of Delft University of Technology. Amsterdam University of Applied Sciences Minor,  Brand management 2011  – 2012 Amsterdam University of Applied Sciences Minor,  Brand management 2011  – 2012 Amsterdam University of Applied Sciences Minor,  Brand management 2011  – 2012 Amsterdam University of Applied Sciences Bachelor's Degree,  Advertising ,  Marketing & Commucations 2008  – 2012 Graduated at the Sales & Marketing team of Intel Benelux on 'Ultrabook; Subcategory creation'. Amsterdam University of Applied Sciences Bachelor's Degree,  Advertising ,  Marketing & Commucations 2008  – 2012 Graduated at the Sales & Marketing team of Intel Benelux on 'Ultrabook; Subcategory creation'. Amsterdam University of Applied Sciences Bachelor's Degree,  Advertising ,  Marketing & Commucations 2008  – 2012 Graduated at the Sales & Marketing team of Intel Benelux on 'Ultrabook; Subcategory creation'. Montessori Lyceum Herman Jordan High School,  Economy & Society 1999  – 2006 Activities and Societies:  CKV3 - Music Montessori Lyceum Herman Jordan High School,  Economy & Society 1999  – 2006 Activities and Societies:  CKV3 - Music Montessori Lyceum Herman Jordan High School,  Economy & Society 1999  – 2006 Activities and Societies:  CKV3 - Music Honors & Awards Intel EMEA Recognition Award Christian Morales, Corporate Vice President and General Manager EMEA February 2015 For successfully establishing and promoting the world’s first RealSense deployment in all 46 MediaMarkt stores in the Netherlands. Intel NEUR Recognition Award Anders Huge, Head of Consumer Sales & Marketing Northern Europe November 2014 For successfully establishing 2in1 categorisation in 58 BCC stores jointly with Microsoft. The success has been shared as a BKM across EMEA.  Intel Spontaneous Level I, Values Advocate Award Nadezhda Yovcheva, EMEA POS & Retail Media Manager September 2014 Recognition for Netherland’s Best iREP Country Activation in Q2 2014. For outstanding initiative and positive can-do attitude.  Intel Spontaneous Level I, Values Advocate Award Patrick Bliemer, Managing Director Intel Northern Europe December 2012 For excellent work driving increased Ultrabook awareness and sales out through The Voice of Holland marketing campaign with Dixons.  Intel Spontaneous Level II, Excellence Award Edgar Smith, Consumer Retail Marketing Manager Netherlands September 2012 For excellent result and customer orientation in the execution of the Ultrabook zone roll-out with Media Markt Netherlands. Through open communication and pro-active troubleshooting with the agency and Media Markt.  Intel EMEA Recognition Award Christian Morales, Corporate Vice President and General Manager EMEA February 2015 For successfully establishing and promoting the world’s first RealSense deployment in all 46 MediaMarkt stores in the Netherlands. Intel EMEA Recognition Award Christian Morales, Corporate Vice President and General Manager EMEA February 2015 For successfully establishing and promoting the world’s first RealSense deployment in all 46 MediaMarkt stores in the Netherlands. Intel EMEA Recognition Award Christian Morales, Corporate Vice President and General Manager EMEA February 2015 For successfully establishing and promoting the world’s first RealSense deployment in all 46 MediaMarkt stores in the Netherlands. Intel NEUR Recognition Award Anders Huge, Head of Consumer Sales & Marketing Northern Europe November 2014 For successfully establishing 2in1 categorisation in 58 BCC stores jointly with Microsoft. The success has been shared as a BKM across EMEA.  Intel NEUR Recognition Award Anders Huge, Head of Consumer Sales & Marketing Northern Europe November 2014 For successfully establishing 2in1 categorisation in 58 BCC stores jointly with Microsoft. The success has been shared as a BKM across EMEA.  Intel NEUR Recognition Award Anders Huge, Head of Consumer Sales & Marketing Northern Europe November 2014 For successfully establishing 2in1 categorisation in 58 BCC stores jointly with Microsoft. The success has been shared as a BKM across EMEA.  Intel Spontaneous Level I, Values Advocate Award Nadezhda Yovcheva, EMEA POS & Retail Media Manager September 2014 Recognition for Netherland’s Best iREP Country Activation in Q2 2014. For outstanding initiative and positive can-do attitude.  Intel Spontaneous Level I, Values Advocate Award Nadezhda Yovcheva, EMEA POS & Retail Media Manager September 2014 Recognition for Netherland’s Best iREP Country Activation in Q2 2014. For outstanding initiative and positive can-do attitude.  Intel Spontaneous Level I, Values Advocate Award Nadezhda Yovcheva, EMEA POS & Retail Media Manager September 2014 Recognition for Netherland’s Best iREP Country Activation in Q2 2014. For outstanding initiative and positive can-do attitude.  Intel Spontaneous Level I, Values Advocate Award Patrick Bliemer, Managing Director Intel Northern Europe December 2012 For excellent work driving increased Ultrabook awareness and sales out through The Voice of Holland marketing campaign with Dixons.  Intel Spontaneous Level I, Values Advocate Award Patrick Bliemer, Managing Director Intel Northern Europe December 2012 For excellent work driving increased Ultrabook awareness and sales out through The Voice of Holland marketing campaign with Dixons.  Intel Spontaneous Level I, Values Advocate Award Patrick Bliemer, Managing Director Intel Northern Europe December 2012 For excellent work driving increased Ultrabook awareness and sales out through The Voice of Holland marketing campaign with Dixons.  Intel Spontaneous Level II, Excellence Award Edgar Smith, Consumer Retail Marketing Manager Netherlands September 2012 For excellent result and customer orientation in the execution of the Ultrabook zone roll-out with Media Markt Netherlands. Through open communication and pro-active troubleshooting with the agency and Media Markt.  Intel Spontaneous Level II, Excellence Award Edgar Smith, Consumer Retail Marketing Manager Netherlands September 2012 For excellent result and customer orientation in the execution of the Ultrabook zone roll-out with Media Markt Netherlands. Through open communication and pro-active troubleshooting with the agency and Media Markt.  Intel Spontaneous Level II, Excellence Award Edgar Smith, Consumer Retail Marketing Manager Netherlands September 2012 For excellent result and customer orientation in the execution of the Ultrabook zone roll-out with Media Markt Netherlands. Through open communication and pro-active troubleshooting with the agency and Media Markt.  ", "Skills Go-to-market Strategy Product Management Channel Multi-channel Marketing Channel Partners Business Alliances Product Marketing Retail Account Management Semiconductors Consumer Electronics International Sales Skills  Go-to-market Strategy Product Management Channel Multi-channel Marketing Channel Partners Business Alliances Product Marketing Retail Account Management Semiconductors Consumer Electronics International Sales Go-to-market Strategy Product Management Channel Multi-channel Marketing Channel Partners Business Alliances Product Marketing Retail Account Management Semiconductors Consumer Electronics International Sales Go-to-market Strategy Product Management Channel Multi-channel Marketing Channel Partners Business Alliances Product Marketing Retail Account Management Semiconductors Consumer Electronics International Sales ", "Summary Sales and Marketing Manager: specialist with an international network and broad experience in IT industry. Special focus on Retail, CE, OEM, Multinational PC vendors, Online and Distribution channels. \n \nProven track-record on building and managing new business and teams, with focus on performance enablement and results. \n \nAs a person: \nProactive, takes ownership and can make quick (data driven) business decisions. \nCan translate long term strategic goals into short term tactical team deliverables. \nEnergetic, problem solver, structured and able to quickly adopt to (organizational) changes. Summary Sales and Marketing Manager: specialist with an international network and broad experience in IT industry. Special focus on Retail, CE, OEM, Multinational PC vendors, Online and Distribution channels. \n \nProven track-record on building and managing new business and teams, with focus on performance enablement and results. \n \nAs a person: \nProactive, takes ownership and can make quick (data driven) business decisions. \nCan translate long term strategic goals into short term tactical team deliverables. \nEnergetic, problem solver, structured and able to quickly adopt to (organizational) changes. Sales and Marketing Manager: specialist with an international network and broad experience in IT industry. Special focus on Retail, CE, OEM, Multinational PC vendors, Online and Distribution channels. \n \nProven track-record on building and managing new business and teams, with focus on performance enablement and results. \n \nAs a person: \nProactive, takes ownership and can make quick (data driven) business decisions. \nCan translate long term strategic goals into short term tactical team deliverables. \nEnergetic, problem solver, structured and able to quickly adopt to (organizational) changes. Sales and Marketing Manager: specialist with an international network and broad experience in IT industry. Special focus on Retail, CE, OEM, Multinational PC vendors, Online and Distribution channels. \n \nProven track-record on building and managing new business and teams, with focus on performance enablement and results. \n \nAs a person: \nProactive, takes ownership and can make quick (data driven) business decisions. \nCan translate long term strategic goals into short term tactical team deliverables. \nEnergetic, problem solver, structured and able to quickly adopt to (organizational) changes. Experience Retail Marketing Manager & Market Development Manager Intel Corporation November 2009  – Present (5 years 10 months) Netherlands -Development of retail eco system, with focus on several multinational PC vendors and key retail & online partners in the Northern European Region.  \n \n-Managing the team of retail sales representatives in the Netherlands. With the task to increase the advocacy for selling Intel based PC’s and other Intel products and services in retail. \n \n-Development of the retail sales and marketing strategy for Notebooks, Tablets and Desktops in the region. Aim is to accelerate new product introduction, drive sales and create awareness in the B2B and B2C market. \n \n-Actively involved in joint (retail) activation programs with key industry partners to introduce new product categories and usage model based solutions. Distribution Business Manager Intel Corporation December 2007  –  November 2009  (2 years) BeNeLux Responsible for the development and implementation of the BeNeLux distribution strategy. \n \nDriving all distribution programs, sales and marketing initiatives, target setting, budget planning and performance management within the distributor network. Channel Field Sales Engineer Intel Corporation July 2005  –  December 2007  (2 years 6 months) BeNeLux Focused on establishing new business relationships on executive level with customers and fellow travelers. \n \nManaging sales of all Intel boxed products: CPU, Motherboard, Server products, Mobile, LAN and SSD. \n \nManaging the top channel customers in the region. \n \nDevelopment & execution of sales and marketing plans Commercial Manager TCT Group October 2002  –  July 2005  (2 years 10 months) Belgium Building and managing the sales teams in 4 different European countries, responsibe for revenue and margin streams. \n \nManaging the executive relationships with suppliers and customers. \n \nProcurement and product management of various products. Purchase Manager BAS Group July 2000  –  October 2002  (2 years 4 months) Netherlands Purchase and Product manager for key-component product lines. Purchase Manager Rein Elektronik / Avnet July 1998  –  July 2000  (2 years 1 month) Netherlands Purchase and Product manager for key component product lines. Shop coordinator / Sales / Technical department / Customer Service Paradigit Computers October 1994  –  June 1998  (3 years 9 months) Netherlands Retail Marketing Manager & Market Development Manager Intel Corporation November 2009  – Present (5 years 10 months) Netherlands -Development of retail eco system, with focus on several multinational PC vendors and key retail & online partners in the Northern European Region.  \n \n-Managing the team of retail sales representatives in the Netherlands. With the task to increase the advocacy for selling Intel based PC’s and other Intel products and services in retail. \n \n-Development of the retail sales and marketing strategy for Notebooks, Tablets and Desktops in the region. Aim is to accelerate new product introduction, drive sales and create awareness in the B2B and B2C market. \n \n-Actively involved in joint (retail) activation programs with key industry partners to introduce new product categories and usage model based solutions. Retail Marketing Manager & Market Development Manager Intel Corporation November 2009  – Present (5 years 10 months) Netherlands -Development of retail eco system, with focus on several multinational PC vendors and key retail & online partners in the Northern European Region.  \n \n-Managing the team of retail sales representatives in the Netherlands. With the task to increase the advocacy for selling Intel based PC’s and other Intel products and services in retail. \n \n-Development of the retail sales and marketing strategy for Notebooks, Tablets and Desktops in the region. Aim is to accelerate new product introduction, drive sales and create awareness in the B2B and B2C market. \n \n-Actively involved in joint (retail) activation programs with key industry partners to introduce new product categories and usage model based solutions. Distribution Business Manager Intel Corporation December 2007  –  November 2009  (2 years) BeNeLux Responsible for the development and implementation of the BeNeLux distribution strategy. \n \nDriving all distribution programs, sales and marketing initiatives, target setting, budget planning and performance management within the distributor network. Distribution Business Manager Intel Corporation December 2007  –  November 2009  (2 years) BeNeLux Responsible for the development and implementation of the BeNeLux distribution strategy. \n \nDriving all distribution programs, sales and marketing initiatives, target setting, budget planning and performance management within the distributor network. Channel Field Sales Engineer Intel Corporation July 2005  –  December 2007  (2 years 6 months) BeNeLux Focused on establishing new business relationships on executive level with customers and fellow travelers. \n \nManaging sales of all Intel boxed products: CPU, Motherboard, Server products, Mobile, LAN and SSD. \n \nManaging the top channel customers in the region. \n \nDevelopment & execution of sales and marketing plans Channel Field Sales Engineer Intel Corporation July 2005  –  December 2007  (2 years 6 months) BeNeLux Focused on establishing new business relationships on executive level with customers and fellow travelers. \n \nManaging sales of all Intel boxed products: CPU, Motherboard, Server products, Mobile, LAN and SSD. \n \nManaging the top channel customers in the region. \n \nDevelopment & execution of sales and marketing plans Commercial Manager TCT Group October 2002  –  July 2005  (2 years 10 months) Belgium Building and managing the sales teams in 4 different European countries, responsibe for revenue and margin streams. \n \nManaging the executive relationships with suppliers and customers. \n \nProcurement and product management of various products. Commercial Manager TCT Group October 2002  –  July 2005  (2 years 10 months) Belgium Building and managing the sales teams in 4 different European countries, responsibe for revenue and margin streams. \n \nManaging the executive relationships with suppliers and customers. \n \nProcurement and product management of various products. Purchase Manager BAS Group July 2000  –  October 2002  (2 years 4 months) Netherlands Purchase and Product manager for key-component product lines. Purchase Manager BAS Group July 2000  –  October 2002  (2 years 4 months) Netherlands Purchase and Product manager for key-component product lines. Purchase Manager Rein Elektronik / Avnet July 1998  –  July 2000  (2 years 1 month) Netherlands Purchase and Product manager for key component product lines. Purchase Manager Rein Elektronik / Avnet July 1998  –  July 2000  (2 years 1 month) Netherlands Purchase and Product manager for key component product lines. Shop coordinator / Sales / Technical department / Customer Service Paradigit Computers October 1994  –  June 1998  (3 years 9 months) Netherlands Shop coordinator / Sales / Technical department / Customer Service Paradigit Computers October 1994  –  June 1998  (3 years 9 months) Netherlands Skills Sales Management Online Marketing International Sales Strategic Planning Strategic Thinking Marketing Management Product Marketing Coaching Retail OEM Key Account Management Presentations Management Marketing Sales Mobile Devices Multi-channel Marketing B2B Product Management See 4+     See less Skills  Sales Management Online Marketing International Sales Strategic Planning Strategic Thinking Marketing Management Product Marketing Coaching Retail OEM Key Account Management Presentations Management Marketing Sales Mobile Devices Multi-channel Marketing B2B Product Management See 4+     See less Sales Management Online Marketing International Sales Strategic Planning Strategic Thinking Marketing Management Product Marketing Coaching Retail OEM Key Account Management Presentations Management Marketing Sales Mobile Devices Multi-channel Marketing B2B Product Management See 4+     See less Sales Management Online Marketing International Sales Strategic Planning Strategic Thinking Marketing Management Product Marketing Coaching Retail OEM Key Account Management Presentations Management Marketing Sales Mobile Devices Multi-channel Marketing B2B Product Management See 4+     See less Education Dutch Association of Purchasing Management NEVI-1,  NEVI-1 2005  – 2007 Fontys Hogeschool Eindhoven HBO,  Marketing Management 2000  – 2002 Technisch Lyceum EHV Electrical Engineering / Technical Computer Sience 1989  – 1993 Dutch Association of Purchasing Management NEVI-1,  NEVI-1 2005  – 2007 Dutch Association of Purchasing Management NEVI-1,  NEVI-1 2005  – 2007 Dutch Association of Purchasing Management NEVI-1,  NEVI-1 2005  – 2007 Fontys Hogeschool Eindhoven HBO,  Marketing Management 2000  – 2002 Fontys Hogeschool Eindhoven HBO,  Marketing Management 2000  – 2002 Fontys Hogeschool Eindhoven HBO,  Marketing Management 2000  – 2002 Technisch Lyceum EHV Electrical Engineering / Technical Computer Sience 1989  – 1993 Technisch Lyceum EHV Electrical Engineering / Technical Computer Sience 1989  – 1993 Technisch Lyceum EHV Electrical Engineering / Technical Computer Sience 1989  – 1993 "]}