{"position": "Security Researcher", "company": "Intel Corporation", "profiles": ["Summary Hacking (white hat) on Open Source Software @ Intel. Still passionate about web technologies and IoT spaces but currently focused on all things security.  \n \nSpecialties: Open Source Software, Security, C, C++, C#, HTML, CSS, Ruby on Rails, JavaScript, MVC frameworks (Backbone.js, AngularJS, Ember.js), Game frameworks (Impact, Phaser), web service APIs, jQuery, Python, Perl, Qt, QML, Java, JSP, Networking, Firmware, Middleware, and Front-End Software Engineering, Android, Chrome OS, Mac OS X/Unix, Linux distros, Windows, etc. Summary Hacking (white hat) on Open Source Software @ Intel. Still passionate about web technologies and IoT spaces but currently focused on all things security.  \n \nSpecialties: Open Source Software, Security, C, C++, C#, HTML, CSS, Ruby on Rails, JavaScript, MVC frameworks (Backbone.js, AngularJS, Ember.js), Game frameworks (Impact, Phaser), web service APIs, jQuery, Python, Perl, Qt, QML, Java, JSP, Networking, Firmware, Middleware, and Front-End Software Engineering, Android, Chrome OS, Mac OS X/Unix, Linux distros, Windows, etc. Hacking (white hat) on Open Source Software @ Intel. Still passionate about web technologies and IoT spaces but currently focused on all things security.  \n \nSpecialties: Open Source Software, Security, C, C++, C#, HTML, CSS, Ruby on Rails, JavaScript, MVC frameworks (Backbone.js, AngularJS, Ember.js), Game frameworks (Impact, Phaser), web service APIs, jQuery, Python, Perl, Qt, QML, Java, JSP, Networking, Firmware, Middleware, and Front-End Software Engineering, Android, Chrome OS, Mac OS X/Unix, Linux distros, Windows, etc. Hacking (white hat) on Open Source Software @ Intel. Still passionate about web technologies and IoT spaces but currently focused on all things security.  \n \nSpecialties: Open Source Software, Security, C, C++, C#, HTML, CSS, Ruby on Rails, JavaScript, MVC frameworks (Backbone.js, AngularJS, Ember.js), Game frameworks (Impact, Phaser), web service APIs, jQuery, Python, Perl, Qt, QML, Java, JSP, Networking, Firmware, Middleware, and Front-End Software Engineering, Android, Chrome OS, Mac OS X/Unix, Linux distros, Windows, etc. Experience Security Researcher Intel Corporation August 2014  – Present (1 year 1 month) Hillsboro, OR Discovering, patching, and hacking my way through open source stacks, architecting solutions, and advising partners on how to reduce vulnerabilities. Senior Web Developer Intel Corporation February 2013  – Present (2 years 7 months) Hillsboro, OR Supported a number one kids entertainment brand television cable network, a privately owned multinational computer technology company, and a multinational educational service content provider in developing mobile cross-platform applications using the Intel XDK. Improved the editorial content process by managing blogs, articles, videos, samples and events across multiple web domains. Led cross-org efforts providing technical support for Intel products (Intel XDK, App Porter, Mashery APIs) by implementing the HTML5 website content and layout. Advised SEO for all content, website architecture, and advertising. Led the programming tutorials for several hackathons like Iridescent’s Technovation Challenge to engage middle school to high school girls in STEM fields. Senior Software Engineer (Middleware and Apps) Intel Corporation August 2012  –  February 2013  (7 months) Hillsboro, OR Led a team of senior engineers and contractors across geos to collaborate on the implementation of a product vertical UI from the ground up. Developed key features, managed key milestones and schedules, and ramped up on new technologies. Drove the requirements for a completely new design from creative deliverables to prototype. Software Engineer (Web App/Middleware/Open Source Developer) Intel Corporation August 2011  –  August 2012  (1 year 1 month) Portland, Oregon Area Open Source development on Tizen Netbook/Handset/Tablet/IVI OS, Tizen WebAPIs, and Geo-Location middleware. Specifically developing multiple production level web applications including games, news, weather, and productivity applications. Worked with Firebreath plugins for web printing APIs, and Geo-Location software to plug-in multiple provider plugins into one location arbiter for the Tizen OS stack. Delivered a Drupal based POC web app store for a custom WRT, server, client, and dev interfaces. Software Engineer (Open Source Developer) Intel Corporation May 2010  –  August 2011  (1 year 4 months) Portland, Oregon Area Open Source development on MeeGo Handset/Tablet Applications with some cross-integration with IVI. Developing and maintaining applications and libraries including some common widgets packaged as a MeeGo reference stack. Specifically handling meta-contact data, with plugins into social networking, im, dialer, and sms applications. Software Engineer (Web Developer) Hewlett-Packard December 2009  –  June 2010  (7 months) Connectivity Group (Vancouver, WA). Working on new web applications for the TouchSmart Web printers, included writing new applications for partner APIs using HP JavaScript libraries as well as maintaining existing applications. Working heavily with design to fine tune apps and launch them in a startup like environment to work across multiple printer platforms and product lines. Software Engineer (UI Developer) Hewlett-Packard August 2009  –  December 2009  (5 months) Inkjet Consumer Solutions Group (San Diego, CA) \nWrote build scripts to integrate custom HP-skin widgets into the Android SDK. Wrote widgets to showcase resource replacement packages allowing HP to swap skins for individual products and programs, included R&D to proof-of-concept and documentation Software Engineer (UI Developer) Hewlett-Packard February 2008  –  August 2009  (1 year 7 months) Inkjet Consumer Solutions Group (San Diego, CA) \nWrote web applications to test objects exposed to JavaScript running on top of WebKit using Qt libraries. Designed/implemented a flickable list with momentum while adopting Agile iterative development methodologies Software Engineer (Firmware Engineer) Hewlett-Packard August 2007  –  February 2008  (7 months) Imaging & Printing Group (San Diego, CA) \nIntegrated photo/creative libraries for PhotoSmart products. Designed and implemented tools for image manipulation and brightness enhancement algorithm testing. Researched ink estimation solutions. Extended supported formats by implementing and testing a PNG decoder to successfully manipulate pictures sent to the printer via Bluetooth-Enabled Nokia cell phones. Software Engineer Hewlett-Packard June 2004  –  August 2006  (2 years 3 months) Integrated JPEG decoder libraries to print photos of different file formats sent via bluetooth from cell phones to a bluetooth enabled printer. Involved learning about decoders, embedded memory management, design, implementation, and testing using Nokia cellphones. Also presented the project and live demo at Project Fair. Technical Support Engineer (IT/Software Eng.) Raytheon May 2003  –  September 2003  (5 months) Hired as a technical support for Raytheon working with the Remote Vision Systems, Remote Sensing and Electronic Warfare facilities in Goleta. Job title included Systems Administration and support of engineering software, building machines, and handling their deployment, as well as software engineering and design for their RVS database group. IT Technician Time Warner Cable 1998  –  1998  (less than a year) Hired as IT technician to handle company email account management, cable line-up programming, billing tasks, and software/hardware upgrades. Security Researcher Intel Corporation August 2014  – Present (1 year 1 month) Hillsboro, OR Discovering, patching, and hacking my way through open source stacks, architecting solutions, and advising partners on how to reduce vulnerabilities. Security Researcher Intel Corporation August 2014  – Present (1 year 1 month) Hillsboro, OR Discovering, patching, and hacking my way through open source stacks, architecting solutions, and advising partners on how to reduce vulnerabilities. Senior Web Developer Intel Corporation February 2013  – Present (2 years 7 months) Hillsboro, OR Supported a number one kids entertainment brand television cable network, a privately owned multinational computer technology company, and a multinational educational service content provider in developing mobile cross-platform applications using the Intel XDK. Improved the editorial content process by managing blogs, articles, videos, samples and events across multiple web domains. Led cross-org efforts providing technical support for Intel products (Intel XDK, App Porter, Mashery APIs) by implementing the HTML5 website content and layout. Advised SEO for all content, website architecture, and advertising. Led the programming tutorials for several hackathons like Iridescent’s Technovation Challenge to engage middle school to high school girls in STEM fields. Senior Web Developer Intel Corporation February 2013  – Present (2 years 7 months) Hillsboro, OR Supported a number one kids entertainment brand television cable network, a privately owned multinational computer technology company, and a multinational educational service content provider in developing mobile cross-platform applications using the Intel XDK. Improved the editorial content process by managing blogs, articles, videos, samples and events across multiple web domains. Led cross-org efforts providing technical support for Intel products (Intel XDK, App Porter, Mashery APIs) by implementing the HTML5 website content and layout. Advised SEO for all content, website architecture, and advertising. Led the programming tutorials for several hackathons like Iridescent’s Technovation Challenge to engage middle school to high school girls in STEM fields. Senior Software Engineer (Middleware and Apps) Intel Corporation August 2012  –  February 2013  (7 months) Hillsboro, OR Led a team of senior engineers and contractors across geos to collaborate on the implementation of a product vertical UI from the ground up. Developed key features, managed key milestones and schedules, and ramped up on new technologies. Drove the requirements for a completely new design from creative deliverables to prototype. Senior Software Engineer (Middleware and Apps) Intel Corporation August 2012  –  February 2013  (7 months) Hillsboro, OR Led a team of senior engineers and contractors across geos to collaborate on the implementation of a product vertical UI from the ground up. Developed key features, managed key milestones and schedules, and ramped up on new technologies. Drove the requirements for a completely new design from creative deliverables to prototype. Software Engineer (Web App/Middleware/Open Source Developer) Intel Corporation August 2011  –  August 2012  (1 year 1 month) Portland, Oregon Area Open Source development on Tizen Netbook/Handset/Tablet/IVI OS, Tizen WebAPIs, and Geo-Location middleware. Specifically developing multiple production level web applications including games, news, weather, and productivity applications. Worked with Firebreath plugins for web printing APIs, and Geo-Location software to plug-in multiple provider plugins into one location arbiter for the Tizen OS stack. Delivered a Drupal based POC web app store for a custom WRT, server, client, and dev interfaces. Software Engineer (Web App/Middleware/Open Source Developer) Intel Corporation August 2011  –  August 2012  (1 year 1 month) Portland, Oregon Area Open Source development on Tizen Netbook/Handset/Tablet/IVI OS, Tizen WebAPIs, and Geo-Location middleware. Specifically developing multiple production level web applications including games, news, weather, and productivity applications. Worked with Firebreath plugins for web printing APIs, and Geo-Location software to plug-in multiple provider plugins into one location arbiter for the Tizen OS stack. Delivered a Drupal based POC web app store for a custom WRT, server, client, and dev interfaces. Software Engineer (Open Source Developer) Intel Corporation May 2010  –  August 2011  (1 year 4 months) Portland, Oregon Area Open Source development on MeeGo Handset/Tablet Applications with some cross-integration with IVI. Developing and maintaining applications and libraries including some common widgets packaged as a MeeGo reference stack. Specifically handling meta-contact data, with plugins into social networking, im, dialer, and sms applications. Software Engineer (Open Source Developer) Intel Corporation May 2010  –  August 2011  (1 year 4 months) Portland, Oregon Area Open Source development on MeeGo Handset/Tablet Applications with some cross-integration with IVI. Developing and maintaining applications and libraries including some common widgets packaged as a MeeGo reference stack. Specifically handling meta-contact data, with plugins into social networking, im, dialer, and sms applications. Software Engineer (Web Developer) Hewlett-Packard December 2009  –  June 2010  (7 months) Connectivity Group (Vancouver, WA). Working on new web applications for the TouchSmart Web printers, included writing new applications for partner APIs using HP JavaScript libraries as well as maintaining existing applications. Working heavily with design to fine tune apps and launch them in a startup like environment to work across multiple printer platforms and product lines. Software Engineer (Web Developer) Hewlett-Packard December 2009  –  June 2010  (7 months) Connectivity Group (Vancouver, WA). Working on new web applications for the TouchSmart Web printers, included writing new applications for partner APIs using HP JavaScript libraries as well as maintaining existing applications. Working heavily with design to fine tune apps and launch them in a startup like environment to work across multiple printer platforms and product lines. Software Engineer (UI Developer) Hewlett-Packard August 2009  –  December 2009  (5 months) Inkjet Consumer Solutions Group (San Diego, CA) \nWrote build scripts to integrate custom HP-skin widgets into the Android SDK. Wrote widgets to showcase resource replacement packages allowing HP to swap skins for individual products and programs, included R&D to proof-of-concept and documentation Software Engineer (UI Developer) Hewlett-Packard August 2009  –  December 2009  (5 months) Inkjet Consumer Solutions Group (San Diego, CA) \nWrote build scripts to integrate custom HP-skin widgets into the Android SDK. Wrote widgets to showcase resource replacement packages allowing HP to swap skins for individual products and programs, included R&D to proof-of-concept and documentation Software Engineer (UI Developer) Hewlett-Packard February 2008  –  August 2009  (1 year 7 months) Inkjet Consumer Solutions Group (San Diego, CA) \nWrote web applications to test objects exposed to JavaScript running on top of WebKit using Qt libraries. Designed/implemented a flickable list with momentum while adopting Agile iterative development methodologies Software Engineer (UI Developer) Hewlett-Packard February 2008  –  August 2009  (1 year 7 months) Inkjet Consumer Solutions Group (San Diego, CA) \nWrote web applications to test objects exposed to JavaScript running on top of WebKit using Qt libraries. Designed/implemented a flickable list with momentum while adopting Agile iterative development methodologies Software Engineer (Firmware Engineer) Hewlett-Packard August 2007  –  February 2008  (7 months) Imaging & Printing Group (San Diego, CA) \nIntegrated photo/creative libraries for PhotoSmart products. Designed and implemented tools for image manipulation and brightness enhancement algorithm testing. Researched ink estimation solutions. Extended supported formats by implementing and testing a PNG decoder to successfully manipulate pictures sent to the printer via Bluetooth-Enabled Nokia cell phones. Software Engineer (Firmware Engineer) Hewlett-Packard August 2007  –  February 2008  (7 months) Imaging & Printing Group (San Diego, CA) \nIntegrated photo/creative libraries for PhotoSmart products. Designed and implemented tools for image manipulation and brightness enhancement algorithm testing. Researched ink estimation solutions. Extended supported formats by implementing and testing a PNG decoder to successfully manipulate pictures sent to the printer via Bluetooth-Enabled Nokia cell phones. Software Engineer Hewlett-Packard June 2004  –  August 2006  (2 years 3 months) Integrated JPEG decoder libraries to print photos of different file formats sent via bluetooth from cell phones to a bluetooth enabled printer. Involved learning about decoders, embedded memory management, design, implementation, and testing using Nokia cellphones. Also presented the project and live demo at Project Fair. Software Engineer Hewlett-Packard June 2004  –  August 2006  (2 years 3 months) Integrated JPEG decoder libraries to print photos of different file formats sent via bluetooth from cell phones to a bluetooth enabled printer. Involved learning about decoders, embedded memory management, design, implementation, and testing using Nokia cellphones. Also presented the project and live demo at Project Fair. Technical Support Engineer (IT/Software Eng.) Raytheon May 2003  –  September 2003  (5 months) Hired as a technical support for Raytheon working with the Remote Vision Systems, Remote Sensing and Electronic Warfare facilities in Goleta. Job title included Systems Administration and support of engineering software, building machines, and handling their deployment, as well as software engineering and design for their RVS database group. Technical Support Engineer (IT/Software Eng.) Raytheon May 2003  –  September 2003  (5 months) Hired as a technical support for Raytheon working with the Remote Vision Systems, Remote Sensing and Electronic Warfare facilities in Goleta. Job title included Systems Administration and support of engineering software, building machines, and handling their deployment, as well as software engineering and design for their RVS database group. IT Technician Time Warner Cable 1998  –  1998  (less than a year) Hired as IT technician to handle company email account management, cable line-up programming, billing tasks, and software/hardware upgrades. IT Technician Time Warner Cable 1998  –  1998  (less than a year) Hired as IT technician to handle company email account management, cable line-up programming, billing tasks, and software/hardware upgrades. Languages Spanish English Spanish English Spanish English Skills Linux C C++ Agile Methodologies Software Development Perl Mobile Applications Mobile Games Middleware jQuery Git JIRA Web Development Web Content Management Java Software Engineering Software Design Algorithms JavaScript HTML Embedded Systems CSS C# See 8+     See less Skills  Linux C C++ Agile Methodologies Software Development Perl Mobile Applications Mobile Games Middleware jQuery Git JIRA Web Development Web Content Management Java Software Engineering Software Design Algorithms JavaScript HTML Embedded Systems CSS C# See 8+     See less Linux C C++ Agile Methodologies Software Development Perl Mobile Applications Mobile Games Middleware jQuery Git JIRA Web Development Web Content Management Java Software Engineering Software Design Algorithms JavaScript HTML Embedded Systems CSS C# See 8+     See less Linux C C++ Agile Methodologies Software Development Perl Mobile Applications Mobile Games Middleware jQuery Git JIRA Web Development Web Content Management Java Software Engineering Software Design Algorithms JavaScript HTML Embedded Systems CSS C# See 8+     See less Education University of California, Santa Barbara Bachelor of Science,  Computer Science ,  Emphasis in Artificial Intelligence 2002  – 2006 College of Engineering Deans List  \nBoeing Scholar Activities and Societies:  Society of Women Engineers\nUCSB Los Inginieros\nNSBE/MESA University of California, Santa Barbara Bachelor of Science,  Computer Science ,  Emphasis in Artificial Intelligence 2002  – 2006 College of Engineering Deans List  \nBoeing Scholar Activities and Societies:  Society of Women Engineers\nUCSB Los Inginieros\nNSBE/MESA University of California, Santa Barbara Bachelor of Science,  Computer Science ,  Emphasis in Artificial Intelligence 2002  – 2006 College of Engineering Deans List  \nBoeing Scholar Activities and Societies:  Society of Women Engineers\nUCSB Los Inginieros\nNSBE/MESA University of California, Santa Barbara Bachelor of Science,  Computer Science ,  Emphasis in Artificial Intelligence 2002  – 2006 College of Engineering Deans List  \nBoeing Scholar Activities and Societies:  Society of Women Engineers\nUCSB Los Inginieros\nNSBE/MESA Honors & Awards SSD Division Recognition Intel Software & Services Group August 2011 Tablet Computex Product Demo - MeeGo on Moorestown DRD Collaboration Recognition Software & Services Group December 2013 DRD/DPD Collaboration to Achieve HTML 5 Goal WPA ROAR Immersion Week Pilot (Department Award) Intel Talent Organization September 2014 For delivering our very 1st highly regarded ROAR program pilot in 2014! (with more to come in '15) This program is a wonderful example of thinking differently and creating an impactful program that helps Intel integrate our new senior women and their critical skills in a unique and special way. The business acumen & networks these women gain, will last throughout their careers. Additional Honors & Awards Sparta Alive/Web App Launch Award  \nHP Awards for Creative & Photo Frames SSD Division Recognition Intel Software & Services Group August 2011 Tablet Computex Product Demo - MeeGo on Moorestown SSD Division Recognition Intel Software & Services Group August 2011 Tablet Computex Product Demo - MeeGo on Moorestown SSD Division Recognition Intel Software & Services Group August 2011 Tablet Computex Product Demo - MeeGo on Moorestown DRD Collaboration Recognition Software & Services Group December 2013 DRD/DPD Collaboration to Achieve HTML 5 Goal DRD Collaboration Recognition Software & Services Group December 2013 DRD/DPD Collaboration to Achieve HTML 5 Goal DRD Collaboration Recognition Software & Services Group December 2013 DRD/DPD Collaboration to Achieve HTML 5 Goal WPA ROAR Immersion Week Pilot (Department Award) Intel Talent Organization September 2014 For delivering our very 1st highly regarded ROAR program pilot in 2014! (with more to come in '15) This program is a wonderful example of thinking differently and creating an impactful program that helps Intel integrate our new senior women and their critical skills in a unique and special way. The business acumen & networks these women gain, will last throughout their careers. WPA ROAR Immersion Week Pilot (Department Award) Intel Talent Organization September 2014 For delivering our very 1st highly regarded ROAR program pilot in 2014! (with more to come in '15) This program is a wonderful example of thinking differently and creating an impactful program that helps Intel integrate our new senior women and their critical skills in a unique and special way. The business acumen & networks these women gain, will last throughout their careers. WPA ROAR Immersion Week Pilot (Department Award) Intel Talent Organization September 2014 For delivering our very 1st highly regarded ROAR program pilot in 2014! (with more to come in '15) This program is a wonderful example of thinking differently and creating an impactful program that helps Intel integrate our new senior women and their critical skills in a unique and special way. The business acumen & networks these women gain, will last throughout their careers. Additional Honors & Awards Sparta Alive/Web App Launch Award  \nHP Awards for Creative & Photo Frames Additional Honors & Awards Sparta Alive/Web App Launch Award  \nHP Awards for Creative & Photo Frames Additional Honors & Awards Sparta Alive/Web App Launch Award  \nHP Awards for Creative & Photo Frames ", "Summary Software Developer \nResearcher in Cryptography and Security \nDigital Hardware Designer at the Register-Transfer Level and Above Summary Software Developer \nResearcher in Cryptography and Security \nDigital Hardware Designer at the Register-Transfer Level and Above Software Developer \nResearcher in Cryptography and Security \nDigital Hardware Designer at the Register-Transfer Level and Above Software Developer \nResearcher in Cryptography and Security \nDigital Hardware Designer at the Register-Transfer Level and Above Experience Security Researcher Intel Corporation April 2015  – Present (5 months) Design Engineer Evertz April 2013  –  March 2015  (2 years) Senior Software Engineer, Specialized in Cryptography and Security ViXS Systems Inc. September 2010  –  February 2013  (2 years 6 months) Research Assistant University of Waterloo September 2006  –  February 2011  (4 years 6 months) Field Engineer Noortec July 2003  –  August 2004  (1 year 2 months) Pre-press Digital Systems Security Researcher Intel Corporation April 2015  – Present (5 months) Security Researcher Intel Corporation April 2015  – Present (5 months) Design Engineer Evertz April 2013  –  March 2015  (2 years) Design Engineer Evertz April 2013  –  March 2015  (2 years) Senior Software Engineer, Specialized in Cryptography and Security ViXS Systems Inc. September 2010  –  February 2013  (2 years 6 months) Senior Software Engineer, Specialized in Cryptography and Security ViXS Systems Inc. September 2010  –  February 2013  (2 years 6 months) Research Assistant University of Waterloo September 2006  –  February 2011  (4 years 6 months) Research Assistant University of Waterloo September 2006  –  February 2011  (4 years 6 months) Field Engineer Noortec July 2003  –  August 2004  (1 year 2 months) Pre-press Digital Systems Field Engineer Noortec July 2003  –  August 2004  (1 year 2 months) Pre-press Digital Systems Skills Embedded Systems C Debugging C++ Algorithms Software Engineering Linux Programming Embedded Software VHDL Security Device Drivers Software Development FPGA ASIC Skills  Embedded Systems C Debugging C++ Algorithms Software Engineering Linux Programming Embedded Software VHDL Security Device Drivers Software Development FPGA ASIC Embedded Systems C Debugging C++ Algorithms Software Engineering Linux Programming Embedded Software VHDL Security Device Drivers Software Development FPGA ASIC Embedded Systems C Debugging C++ Algorithms Software Engineering Linux Programming Embedded Software VHDL Security Device Drivers Software Development FPGA ASIC Education University of Waterloo Ph.D.,  Electrical and Computer Engineering KTH University (Royal Institute of Technology) MSc,  Electrical and Computer Engineering Shahid Beheshti University BSc,  Electrical and Computer Engineering University of Waterloo Ph.D.,  Electrical and Computer Engineering University of Waterloo Ph.D.,  Electrical and Computer Engineering University of Waterloo Ph.D.,  Electrical and Computer Engineering KTH University (Royal Institute of Technology) MSc,  Electrical and Computer Engineering KTH University (Royal Institute of Technology) MSc,  Electrical and Computer Engineering KTH University (Royal Institute of Technology) MSc,  Electrical and Computer Engineering Shahid Beheshti University BSc,  Electrical and Computer Engineering Shahid Beheshti University BSc,  Electrical and Computer Engineering Shahid Beheshti University BSc,  Electrical and Computer Engineering ", "Skills Testing Software Development Test Automation Integration Software Quality... Perl Debugging Programming C C++ Automation Security Quality Assurance Operating Systems Leadership Agile Methodologies Business Process Python C# Open Source Software Git Linux Linux Kernel Matlab R PHP JavaScript Java HTML See 14+     See less Skills  Testing Software Development Test Automation Integration Software Quality... Perl Debugging Programming C C++ Automation Security Quality Assurance Operating Systems Leadership Agile Methodologies Business Process Python C# Open Source Software Git Linux Linux Kernel Matlab R PHP JavaScript Java HTML See 14+     See less Testing Software Development Test Automation Integration Software Quality... Perl Debugging Programming C C++ Automation Security Quality Assurance Operating Systems Leadership Agile Methodologies Business Process Python C# Open Source Software Git Linux Linux Kernel Matlab R PHP JavaScript Java HTML See 14+     See less Testing Software Development Test Automation Integration Software Quality... Perl Debugging Programming C C++ Automation Security Quality Assurance Operating Systems Leadership Agile Methodologies Business Process Python C# Open Source Software Git Linux Linux Kernel Matlab R PHP JavaScript Java HTML See 14+     See less ", "Summary Software engineer and developer, interested in systems programming, internet technologies, information security and cryptography. Summary Software engineer and developer, interested in systems programming, internet technologies, information security and cryptography. Software engineer and developer, interested in systems programming, internet technologies, information security and cryptography. Software engineer and developer, interested in systems programming, internet technologies, information security and cryptography. Experience Security Researcher Intel Corporation August 2014  – Present (1 year 1 month) Zapopan, Jalisco Stagiaire at Laboratory of Operational Cryptology and Virology ESIEA Recherche April 2013  –  December 2013  (9 months) Laval Area, France Software Engineer (Storage RAS). IBM México Software Laboratory November 2009  –  October 2012  (3 years) RAS Software Design and Development for IBM Storage Systems \nIBM TS7700 Virtualization Engine Software Engineer (Firmware) IBM México Software Laboratory May 2009  –  November 2009  (7 months) Firmware Development \nFailure Analysis  \nIBM System Storage TS3500 Tape Library Software Engineer (Hardware Enablement) IBM México Software Laboratory January 2007  –  May 2009  (2 years 5 months) Software Engineer (Hardware Enablement for IBM System X) \n \nVMware Infrastructure 3 Development \n \n- Linux Device drivers \n- GNU Tools (Linux Development) \n- Hardware Enablement (IBM System X for VMware) \n- Open Source Development \n \nTraining activities (teaching courses to new hires) \n \nVMware Certified Professional on VI Infrastructure 3 Software Engineer (Systems Programming) IBM México Software Laboratory August 2000  –  January 2007  (6 years 6 months) Systems Software for z/OS (Language Environment): \n- Mainframes \n- Development (C/C++, COBOL, Assembler) \nHigh Level Design \nLow Level Design \nCoding \nUnit Testing \nDefect Handling \nCode Packaging and Integration \n \n- Function Test  \nDesign of Test Approach Documents \nDesign of Test Plans \nDesign of Test Variations \nCodification of Test Cases \nUse of automated Testing Tools \nTest Exit meetings \n \n- Maintenance (L3) \n \n \nProject Management Activities (CMM Level 5) \n- Requirements Analysis \n- Recruiting \n- Documentation. \n- Project tracking \n \nTraining activities (teaching courses to new hires) Software Applications Developer Self Employed September 1998  –  August 2000  (2 years) Developing and Maintaining Applications Software for Windows Plattform, Software Consulting Network Engineer and Tech Support Universidad Autónoma de San Luis Potosí September 1997  –  September 1998  (1 year 1 month) Network Administration, Dial-up services Administration, User support, Instructor, Software and Hardware configuration. Technical Support. Software Development Instituto Tecnológico y de Estudios Superiores de Monterrey January 1996  –  September 1997  (1 year 9 months) Technical Support. Customer support, Academic Databases Administration, Applications Development Security Researcher Intel Corporation August 2014  – Present (1 year 1 month) Zapopan, Jalisco Security Researcher Intel Corporation August 2014  – Present (1 year 1 month) Zapopan, Jalisco Stagiaire at Laboratory of Operational Cryptology and Virology ESIEA Recherche April 2013  –  December 2013  (9 months) Laval Area, France Stagiaire at Laboratory of Operational Cryptology and Virology ESIEA Recherche April 2013  –  December 2013  (9 months) Laval Area, France Software Engineer (Storage RAS). IBM México Software Laboratory November 2009  –  October 2012  (3 years) RAS Software Design and Development for IBM Storage Systems \nIBM TS7700 Virtualization Engine Software Engineer (Storage RAS). IBM México Software Laboratory November 2009  –  October 2012  (3 years) RAS Software Design and Development for IBM Storage Systems \nIBM TS7700 Virtualization Engine Software Engineer (Firmware) IBM México Software Laboratory May 2009  –  November 2009  (7 months) Firmware Development \nFailure Analysis  \nIBM System Storage TS3500 Tape Library Software Engineer (Firmware) IBM México Software Laboratory May 2009  –  November 2009  (7 months) Firmware Development \nFailure Analysis  \nIBM System Storage TS3500 Tape Library Software Engineer (Hardware Enablement) IBM México Software Laboratory January 2007  –  May 2009  (2 years 5 months) Software Engineer (Hardware Enablement for IBM System X) \n \nVMware Infrastructure 3 Development \n \n- Linux Device drivers \n- GNU Tools (Linux Development) \n- Hardware Enablement (IBM System X for VMware) \n- Open Source Development \n \nTraining activities (teaching courses to new hires) \n \nVMware Certified Professional on VI Infrastructure 3 Software Engineer (Hardware Enablement) IBM México Software Laboratory January 2007  –  May 2009  (2 years 5 months) Software Engineer (Hardware Enablement for IBM System X) \n \nVMware Infrastructure 3 Development \n \n- Linux Device drivers \n- GNU Tools (Linux Development) \n- Hardware Enablement (IBM System X for VMware) \n- Open Source Development \n \nTraining activities (teaching courses to new hires) \n \nVMware Certified Professional on VI Infrastructure 3 Software Engineer (Systems Programming) IBM México Software Laboratory August 2000  –  January 2007  (6 years 6 months) Systems Software for z/OS (Language Environment): \n- Mainframes \n- Development (C/C++, COBOL, Assembler) \nHigh Level Design \nLow Level Design \nCoding \nUnit Testing \nDefect Handling \nCode Packaging and Integration \n \n- Function Test  \nDesign of Test Approach Documents \nDesign of Test Plans \nDesign of Test Variations \nCodification of Test Cases \nUse of automated Testing Tools \nTest Exit meetings \n \n- Maintenance (L3) \n \n \nProject Management Activities (CMM Level 5) \n- Requirements Analysis \n- Recruiting \n- Documentation. \n- Project tracking \n \nTraining activities (teaching courses to new hires) Software Engineer (Systems Programming) IBM México Software Laboratory August 2000  –  January 2007  (6 years 6 months) Systems Software for z/OS (Language Environment): \n- Mainframes \n- Development (C/C++, COBOL, Assembler) \nHigh Level Design \nLow Level Design \nCoding \nUnit Testing \nDefect Handling \nCode Packaging and Integration \n \n- Function Test  \nDesign of Test Approach Documents \nDesign of Test Plans \nDesign of Test Variations \nCodification of Test Cases \nUse of automated Testing Tools \nTest Exit meetings \n \n- Maintenance (L3) \n \n \nProject Management Activities (CMM Level 5) \n- Requirements Analysis \n- Recruiting \n- Documentation. \n- Project tracking \n \nTraining activities (teaching courses to new hires) Software Applications Developer Self Employed September 1998  –  August 2000  (2 years) Developing and Maintaining Applications Software for Windows Plattform, Software Consulting Software Applications Developer Self Employed September 1998  –  August 2000  (2 years) Developing and Maintaining Applications Software for Windows Plattform, Software Consulting Network Engineer and Tech Support Universidad Autónoma de San Luis Potosí September 1997  –  September 1998  (1 year 1 month) Network Administration, Dial-up services Administration, User support, Instructor, Software and Hardware configuration. Network Engineer and Tech Support Universidad Autónoma de San Luis Potosí September 1997  –  September 1998  (1 year 1 month) Network Administration, Dial-up services Administration, User support, Instructor, Software and Hardware configuration. Technical Support. Software Development Instituto Tecnológico y de Estudios Superiores de Monterrey January 1996  –  September 1997  (1 year 9 months) Technical Support. Customer support, Academic Databases Administration, Applications Development Technical Support. Software Development Instituto Tecnológico y de Estudios Superiores de Monterrey January 1996  –  September 1997  (1 year 9 months) Technical Support. Customer support, Academic Databases Administration, Applications Development Languages English Full professional proficiency French Limited working proficiency English Full professional proficiency French Limited working proficiency English Full professional proficiency French Limited working proficiency Full professional proficiency Limited working proficiency Skills Linux Software Development Unix Virtualization Software Engineering C++ Java Shell Scripting VMware Device Drivers ANSI C JavaScript AIX Unix Shell Scripting Scripting Information Security Software Security Cryptography Computer Security See 4+     See less Skills  Linux Software Development Unix Virtualization Software Engineering C++ Java Shell Scripting VMware Device Drivers ANSI C JavaScript AIX Unix Shell Scripting Scripting Information Security Software Security Cryptography Computer Security See 4+     See less Linux Software Development Unix Virtualization Software Engineering C++ Java Shell Scripting VMware Device Drivers ANSI C JavaScript AIX Unix Shell Scripting Scripting Information Security Software Security Cryptography Computer Security See 4+     See less Linux Software Development Unix Virtualization Software Engineering C++ Java Shell Scripting VMware Device Drivers ANSI C JavaScript AIX Unix Shell Scripting Scripting Information Security Software Security Cryptography Computer Security See 4+     See less Education École Supérieure d'Informatique, Électronique, Automatique Specialized Master 2012  – 2013 ITESO Diploma 2009  – 2009 Tecnológico de Monterrey Bachelors 1989  – 1995 École Supérieure d'Informatique, Électronique, Automatique Specialized Master 2012  – 2013 École Supérieure d'Informatique, Électronique, Automatique Specialized Master 2012  – 2013 École Supérieure d'Informatique, Électronique, Automatique Specialized Master 2012  – 2013 ITESO Diploma 2009  – 2009 ITESO Diploma 2009  – 2009 ITESO Diploma 2009  – 2009 Tecnológico de Monterrey Bachelors 1989  – 1995 Tecnológico de Monterrey Bachelors 1989  – 1995 Tecnológico de Monterrey Bachelors 1989  – 1995 ", "Summary I am a security validation researcher at Intel and interested in cross-disciplinary and cutting-edge research in hardware security and bio-implantable systems. Summary I am a security validation researcher at Intel and interested in cross-disciplinary and cutting-edge research in hardware security and bio-implantable systems. I am a security validation researcher at Intel and interested in cross-disciplinary and cutting-edge research in hardware security and bio-implantable systems. I am a security validation researcher at Intel and interested in cross-disciplinary and cutting-edge research in hardware security and bio-implantable systems. Experience Security Researcher Intel Corporation July 2012  – Present (3 years 2 months) Hillsboro, Oregon Graduate Research Assistant Case Western Reserve University June 2007  –  May 2012  (5 years) Cleveland, Ohio My primary research focus is developing novel algorithm and circuit/architecture for neural signal processing in bio-implantable systems. Apart from this, I have worked on various topics ranging from bio-inspired multi-core architectures, hardware security for IP protection and hardware Trojan detection, robust computing (methods for increasing reliability of operation of circuits under process and temporal variations), energy management for systems with multiple energy sources, circuit design for post-CMOS devices like nanotubes and nano-electro-mechanical-systems (NEMS). I am a member of the NANOSCAPE lab in the Electrical Engineering and Computer Science department at Case Western Reserve University. My advisor is Prof. Swarup Bhunia. Intern, Engineering Broadcom Corporation May 2010  –  August 2010  (4 months) Memory Development Group, Tempe, AZ \n \nDesigning and characterizing custom register file at 40nm technology nodes. \nCharacterizing and debugging test structures for memory chip at 40nm and 28 nm technology nodes. Graduate Teaching Assistant CWRU (for \"VLSI/CAD\" and \"VLSI Systems August 2008  –  December 2008  (5 months) grade lab assignments, lab assistant, office hours Graduate Teaching Assistant Case Western Reserve University September 2006  –  May 2007  (9 months) Teaching Assistant in charge of grading homework, lab assignments and exams; leading recitations; maintaining course website; uploading grades and solutions; office hours; proctoring exams \nCourse: EECS 281 - Logic Design and Computer Organization Security Researcher Intel Corporation July 2012  – Present (3 years 2 months) Hillsboro, Oregon Security Researcher Intel Corporation July 2012  – Present (3 years 2 months) Hillsboro, Oregon Graduate Research Assistant Case Western Reserve University June 2007  –  May 2012  (5 years) Cleveland, Ohio My primary research focus is developing novel algorithm and circuit/architecture for neural signal processing in bio-implantable systems. Apart from this, I have worked on various topics ranging from bio-inspired multi-core architectures, hardware security for IP protection and hardware Trojan detection, robust computing (methods for increasing reliability of operation of circuits under process and temporal variations), energy management for systems with multiple energy sources, circuit design for post-CMOS devices like nanotubes and nano-electro-mechanical-systems (NEMS). I am a member of the NANOSCAPE lab in the Electrical Engineering and Computer Science department at Case Western Reserve University. My advisor is Prof. Swarup Bhunia. Graduate Research Assistant Case Western Reserve University June 2007  –  May 2012  (5 years) Cleveland, Ohio My primary research focus is developing novel algorithm and circuit/architecture for neural signal processing in bio-implantable systems. Apart from this, I have worked on various topics ranging from bio-inspired multi-core architectures, hardware security for IP protection and hardware Trojan detection, robust computing (methods for increasing reliability of operation of circuits under process and temporal variations), energy management for systems with multiple energy sources, circuit design for post-CMOS devices like nanotubes and nano-electro-mechanical-systems (NEMS). I am a member of the NANOSCAPE lab in the Electrical Engineering and Computer Science department at Case Western Reserve University. My advisor is Prof. Swarup Bhunia. Intern, Engineering Broadcom Corporation May 2010  –  August 2010  (4 months) Memory Development Group, Tempe, AZ \n \nDesigning and characterizing custom register file at 40nm technology nodes. \nCharacterizing and debugging test structures for memory chip at 40nm and 28 nm technology nodes. Intern, Engineering Broadcom Corporation May 2010  –  August 2010  (4 months) Memory Development Group, Tempe, AZ \n \nDesigning and characterizing custom register file at 40nm technology nodes. \nCharacterizing and debugging test structures for memory chip at 40nm and 28 nm technology nodes. Graduate Teaching Assistant CWRU (for \"VLSI/CAD\" and \"VLSI Systems August 2008  –  December 2008  (5 months) grade lab assignments, lab assistant, office hours Graduate Teaching Assistant CWRU (for \"VLSI/CAD\" and \"VLSI Systems August 2008  –  December 2008  (5 months) grade lab assignments, lab assistant, office hours Graduate Teaching Assistant Case Western Reserve University September 2006  –  May 2007  (9 months) Teaching Assistant in charge of grading homework, lab assignments and exams; leading recitations; maintaining course website; uploading grades and solutions; office hours; proctoring exams \nCourse: EECS 281 - Logic Design and Computer Organization Graduate Teaching Assistant Case Western Reserve University September 2006  –  May 2007  (9 months) Teaching Assistant in charge of grading homework, lab assignments and exams; leading recitations; maintaining course website; uploading grades and solutions; office hours; proctoring exams \nCourse: EECS 281 - Logic Design and Computer Organization Languages English Hindi Bengali Tamil Malayalam English Hindi Bengali Tamil Malayalam English Hindi Bengali Tamil Malayalam Skills Signal Processing Circuit Design Electrical Engineering Matlab C Verilog Biomedical Engineering Research C++ Debugging R Programming Machine Learning Testing VLSI LaTeX Statistics Image Processing ASIC Algorithms Labview Digital Circuit Design VHDL Computer Architecture Simulations Perl ModelSim FPGA See 13+     See less Skills  Signal Processing Circuit Design Electrical Engineering Matlab C Verilog Biomedical Engineering Research C++ Debugging R Programming Machine Learning Testing VLSI LaTeX Statistics Image Processing ASIC Algorithms Labview Digital Circuit Design VHDL Computer Architecture Simulations Perl ModelSim FPGA See 13+     See less Signal Processing Circuit Design Electrical Engineering Matlab C Verilog Biomedical Engineering Research C++ Debugging R Programming Machine Learning Testing VLSI LaTeX Statistics Image Processing ASIC Algorithms Labview Digital Circuit Design VHDL Computer Architecture Simulations Perl ModelSim FPGA See 13+     See less Signal Processing Circuit Design Electrical Engineering Matlab C Verilog Biomedical Engineering Research C++ Debugging R Programming Machine Learning Testing VLSI LaTeX Statistics Image Processing ASIC Algorithms Labview Digital Circuit Design VHDL Computer Architecture Simulations Perl ModelSim FPGA See 13+     See less Education Case Western Reserve University PhD,  Computer Engineering 2006  – 2012 Jadavpur University B E,  Electronics and Telecommunications 2002  – 2006 South Point High School 1995  – 2002 South Point School 1988  – 1995 Case Western Reserve University PhD,  Computer Engineering 2006  – 2012 Case Western Reserve University PhD,  Computer Engineering 2006  – 2012 Case Western Reserve University PhD,  Computer Engineering 2006  – 2012 Jadavpur University B E,  Electronics and Telecommunications 2002  – 2006 Jadavpur University B E,  Electronics and Telecommunications 2002  – 2006 Jadavpur University B E,  Electronics and Telecommunications 2002  – 2006 South Point High School 1995  – 2002 South Point High School 1995  – 2002 South Point High School 1995  – 2002 South Point School 1988  – 1995 South Point School 1988  – 1995 South Point School 1988  – 1995 Honors & Awards Additional Honors & Awards Graduate Dean's Instructional Excellence Award 2007, \nRuth Barber Moon Award 2008, \nAAAS/Science Program for Excellence in Science award 2008, \n3rd prize in Computer Security Awareness Week (CSAW) - Embedded Systems Challenge (ESC) 2010,  \nbest paper nomination in 3rd International Symposium on Hardware-Oriented Security and Trust (HOST) 2010, \nFinalist in the Student Paper Competition (SPC) at the 31st Annual International Conference of the IEEE Engineering in Medicine and Biology Society (EMBS) 2009 Additional Honors & Awards Graduate Dean's Instructional Excellence Award 2007, \nRuth Barber Moon Award 2008, \nAAAS/Science Program for Excellence in Science award 2008, \n3rd prize in Computer Security Awareness Week (CSAW) - Embedded Systems Challenge (ESC) 2010,  \nbest paper nomination in 3rd International Symposium on Hardware-Oriented Security and Trust (HOST) 2010, \nFinalist in the Student Paper Competition (SPC) at the 31st Annual International Conference of the IEEE Engineering in Medicine and Biology Society (EMBS) 2009 Additional Honors & Awards Graduate Dean's Instructional Excellence Award 2007, \nRuth Barber Moon Award 2008, \nAAAS/Science Program for Excellence in Science award 2008, \n3rd prize in Computer Security Awareness Week (CSAW) - Embedded Systems Challenge (ESC) 2010,  \nbest paper nomination in 3rd International Symposium on Hardware-Oriented Security and Trust (HOST) 2010, \nFinalist in the Student Paper Competition (SPC) at the 31st Annual International Conference of the IEEE Engineering in Medicine and Biology Society (EMBS) 2009 Additional Honors & Awards Graduate Dean's Instructional Excellence Award 2007, \nRuth Barber Moon Award 2008, \nAAAS/Science Program for Excellence in Science award 2008, \n3rd prize in Computer Security Awareness Week (CSAW) - Embedded Systems Challenge (ESC) 2010,  \nbest paper nomination in 3rd International Symposium on Hardware-Oriented Security and Trust (HOST) 2010, \nFinalist in the Student Paper Competition (SPC) at the 31st Annual International Conference of the IEEE Engineering in Medicine and Biology Society (EMBS) 2009 ", "Summary Broad experience uniquely combining skills sets in:  \n \n* Software System Security; \n* Computer Software Development; \n* System Design;  \n* Scientific Research Strategies;  \n* Project Management; \n* Technology Transfer; \n* Intellectual Property development and management;  \n* Product Commercialization;  \n* FDA/ISO Regulatory Compliance; and \n* Medical Device Development  \n \nwith access to a Broad Network of National Level External Scientific Research Community organizations and National Industry Associations.  \n \nThese areas are complimented with over 20 years experience in project management with responsibilities for personnel management, fiscal management, product lifecycle development, formal process implementation, testing & quality assurance, marketing, international business development/management, meeting facilitation, mentoring, training delivery, collaboration development, programming, and the ability to bridge between the technology and business worlds. \n \nDemonstrated ability to provide effective and secure solutions to software process, software design and development challenges for large and complex product development teams. Excellent oral and written communication skills. Ability to formulate and communicate design approaches in a succinct and effective manner to all levels of the development team and stakeholders including cross-geo teams. A Certified Ethical Hacker, a Certified Project Management Professional, and a Certified Information Systems Security Professional with fluency in English & Spanish. An advocate for strengthening Diversity in the workplace and past Cross-Site Chair for the Intel Latino Network. Specialties:Software Security, Technology Transfer, Economic Development, Embedded Software Development, General Software Development, Project Management, Certified Project Management Professional, Certified Ethical Hacker, Certified Information Systems Security Professional. \n \nStrengthsfinder 2.0 strengths are: Achiever, Learner, Ideation, Activator, and Strategic. Strengthsfinder 1.0 strengths are: Ideation, Activator, Learner, Command and Communication. Summary Broad experience uniquely combining skills sets in:  \n \n* Software System Security; \n* Computer Software Development; \n* System Design;  \n* Scientific Research Strategies;  \n* Project Management; \n* Technology Transfer; \n* Intellectual Property development and management;  \n* Product Commercialization;  \n* FDA/ISO Regulatory Compliance; and \n* Medical Device Development  \n \nwith access to a Broad Network of National Level External Scientific Research Community organizations and National Industry Associations.  \n \nThese areas are complimented with over 20 years experience in project management with responsibilities for personnel management, fiscal management, product lifecycle development, formal process implementation, testing & quality assurance, marketing, international business development/management, meeting facilitation, mentoring, training delivery, collaboration development, programming, and the ability to bridge between the technology and business worlds. \n \nDemonstrated ability to provide effective and secure solutions to software process, software design and development challenges for large and complex product development teams. Excellent oral and written communication skills. Ability to formulate and communicate design approaches in a succinct and effective manner to all levels of the development team and stakeholders including cross-geo teams. A Certified Ethical Hacker, a Certified Project Management Professional, and a Certified Information Systems Security Professional with fluency in English & Spanish. An advocate for strengthening Diversity in the workplace and past Cross-Site Chair for the Intel Latino Network. Specialties:Software Security, Technology Transfer, Economic Development, Embedded Software Development, General Software Development, Project Management, Certified Project Management Professional, Certified Ethical Hacker, Certified Information Systems Security Professional. \n \nStrengthsfinder 2.0 strengths are: Achiever, Learner, Ideation, Activator, and Strategic. Strengthsfinder 1.0 strengths are: Ideation, Activator, Learner, Command and Communication. Broad experience uniquely combining skills sets in:  \n \n* Software System Security; \n* Computer Software Development; \n* System Design;  \n* Scientific Research Strategies;  \n* Project Management; \n* Technology Transfer; \n* Intellectual Property development and management;  \n* Product Commercialization;  \n* FDA/ISO Regulatory Compliance; and \n* Medical Device Development  \n \nwith access to a Broad Network of National Level External Scientific Research Community organizations and National Industry Associations.  \n \nThese areas are complimented with over 20 years experience in project management with responsibilities for personnel management, fiscal management, product lifecycle development, formal process implementation, testing & quality assurance, marketing, international business development/management, meeting facilitation, mentoring, training delivery, collaboration development, programming, and the ability to bridge between the technology and business worlds. \n \nDemonstrated ability to provide effective and secure solutions to software process, software design and development challenges for large and complex product development teams. Excellent oral and written communication skills. Ability to formulate and communicate design approaches in a succinct and effective manner to all levels of the development team and stakeholders including cross-geo teams. A Certified Ethical Hacker, a Certified Project Management Professional, and a Certified Information Systems Security Professional with fluency in English & Spanish. An advocate for strengthening Diversity in the workplace and past Cross-Site Chair for the Intel Latino Network. Specialties:Software Security, Technology Transfer, Economic Development, Embedded Software Development, General Software Development, Project Management, Certified Project Management Professional, Certified Ethical Hacker, Certified Information Systems Security Professional. \n \nStrengthsfinder 2.0 strengths are: Achiever, Learner, Ideation, Activator, and Strategic. Strengthsfinder 1.0 strengths are: Ideation, Activator, Learner, Command and Communication. Broad experience uniquely combining skills sets in:  \n \n* Software System Security; \n* Computer Software Development; \n* System Design;  \n* Scientific Research Strategies;  \n* Project Management; \n* Technology Transfer; \n* Intellectual Property development and management;  \n* Product Commercialization;  \n* FDA/ISO Regulatory Compliance; and \n* Medical Device Development  \n \nwith access to a Broad Network of National Level External Scientific Research Community organizations and National Industry Associations.  \n \nThese areas are complimented with over 20 years experience in project management with responsibilities for personnel management, fiscal management, product lifecycle development, formal process implementation, testing & quality assurance, marketing, international business development/management, meeting facilitation, mentoring, training delivery, collaboration development, programming, and the ability to bridge between the technology and business worlds. \n \nDemonstrated ability to provide effective and secure solutions to software process, software design and development challenges for large and complex product development teams. Excellent oral and written communication skills. Ability to formulate and communicate design approaches in a succinct and effective manner to all levels of the development team and stakeholders including cross-geo teams. A Certified Ethical Hacker, a Certified Project Management Professional, and a Certified Information Systems Security Professional with fluency in English & Spanish. An advocate for strengthening Diversity in the workplace and past Cross-Site Chair for the Intel Latino Network. Specialties:Software Security, Technology Transfer, Economic Development, Embedded Software Development, General Software Development, Project Management, Certified Project Management Professional, Certified Ethical Hacker, Certified Information Systems Security Professional. \n \nStrengthsfinder 2.0 strengths are: Achiever, Learner, Ideation, Activator, and Strategic. Strengthsfinder 1.0 strengths are: Ideation, Activator, Learner, Command and Communication. Experience Senior Security Researcher Intel Corporation May 2000  – Present (15 years 4 months) Senior Security Researcher Intel Corporation May 2000  – Present (15 years 4 months) Senior Security Researcher Intel Corporation May 2000  – Present (15 years 4 months) Languages Spanish Spanish Spanish Skills Security Software Development Program Management Embedded Systems Linux Unix CISSP Project Management Information Security Leadership Computer Security CEH Technology Transfer Penetration Testing Idea Generation Learner Ideation Design for Security Internet of Things Software Engineering Strategy Management Enterprise Software Testing See 9+     See less Skills  Security Software Development Program Management Embedded Systems Linux Unix CISSP Project Management Information Security Leadership Computer Security CEH Technology Transfer Penetration Testing Idea Generation Learner Ideation Design for Security Internet of Things Software Engineering Strategy Management Enterprise Software Testing See 9+     See less Security Software Development Program Management Embedded Systems Linux Unix CISSP Project Management Information Security Leadership Computer Security CEH Technology Transfer Penetration Testing Idea Generation Learner Ideation Design for Security Internet of Things Software Engineering Strategy Management Enterprise Software Testing See 9+     See less Security Software Development Program Management Embedded Systems Linux Unix CISSP Project Management Information Security Leadership Computer Security CEH Technology Transfer Penetration Testing Idea Generation Learner Ideation Design for Security Internet of Things Software Engineering Strategy Management Enterprise Software Testing See 9+     See less Honors & Awards Additional Honors & Awards * Level III Spontaneous Award – Security Leadership/Support SLD/PbD Assessment – 2014 \n* Level I Spontaneous Award – Support of Leadership Conference – 2014 \n* Level I Spontaneous Award – Collaboration with Security Community – 2014 \n* Level I Spontaneous Award – Support for the CQN Likelihood tool – 2014 \n* Level I Spontaneous Award – Support of Career Zone event – 2014 \n* Level I Spontaneous Award – Notification of issue to PSIRT – 2014 \n* Level I Spontaneous Award – Advocate for individual/team security goals – 2013 \n* Level I Spontaneous Award – Support to Global Diversity at HR Development Days – 2013 \n* Level II Spontaneous Award – Security Direction, coaching & evaluation Wolfsville – 2013 \n* Spontaneous Recognition Award – Contributions to the security of a product - 2012 \n* Spontaneous Recognition Award – Preparation and Support for NM Innovation Center visit – 2012 \n* Spontaneous Recognition Award - Gold Release of Product – 2012 Additional Honors & Awards * Level III Spontaneous Award – Security Leadership/Support SLD/PbD Assessment – 2014 \n* Level I Spontaneous Award – Support of Leadership Conference – 2014 \n* Level I Spontaneous Award – Collaboration with Security Community – 2014 \n* Level I Spontaneous Award – Support for the CQN Likelihood tool – 2014 \n* Level I Spontaneous Award – Support of Career Zone event – 2014 \n* Level I Spontaneous Award – Notification of issue to PSIRT – 2014 \n* Level I Spontaneous Award – Advocate for individual/team security goals – 2013 \n* Level I Spontaneous Award – Support to Global Diversity at HR Development Days – 2013 \n* Level II Spontaneous Award – Security Direction, coaching & evaluation Wolfsville – 2013 \n* Spontaneous Recognition Award – Contributions to the security of a product - 2012 \n* Spontaneous Recognition Award – Preparation and Support for NM Innovation Center visit – 2012 \n* Spontaneous Recognition Award - Gold Release of Product – 2012 Additional Honors & Awards * Level III Spontaneous Award – Security Leadership/Support SLD/PbD Assessment – 2014 \n* Level I Spontaneous Award – Support of Leadership Conference – 2014 \n* Level I Spontaneous Award – Collaboration with Security Community – 2014 \n* Level I Spontaneous Award – Support for the CQN Likelihood tool – 2014 \n* Level I Spontaneous Award – Support of Career Zone event – 2014 \n* Level I Spontaneous Award – Notification of issue to PSIRT – 2014 \n* Level I Spontaneous Award – Advocate for individual/team security goals – 2013 \n* Level I Spontaneous Award – Support to Global Diversity at HR Development Days – 2013 \n* Level II Spontaneous Award – Security Direction, coaching & evaluation Wolfsville – 2013 \n* Spontaneous Recognition Award – Contributions to the security of a product - 2012 \n* Spontaneous Recognition Award – Preparation and Support for NM Innovation Center visit – 2012 \n* Spontaneous Recognition Award - Gold Release of Product – 2012 Additional Honors & Awards * Level III Spontaneous Award – Security Leadership/Support SLD/PbD Assessment – 2014 \n* Level I Spontaneous Award – Support of Leadership Conference – 2014 \n* Level I Spontaneous Award – Collaboration with Security Community – 2014 \n* Level I Spontaneous Award – Support for the CQN Likelihood tool – 2014 \n* Level I Spontaneous Award – Support of Career Zone event – 2014 \n* Level I Spontaneous Award – Notification of issue to PSIRT – 2014 \n* Level I Spontaneous Award – Advocate for individual/team security goals – 2013 \n* Level I Spontaneous Award – Support to Global Diversity at HR Development Days – 2013 \n* Level II Spontaneous Award – Security Direction, coaching & evaluation Wolfsville – 2013 \n* Spontaneous Recognition Award – Contributions to the security of a product - 2012 \n* Spontaneous Recognition Award – Preparation and Support for NM Innovation Center visit – 2012 \n* Spontaneous Recognition Award - Gold Release of Product – 2012 ", "Summary I am Security Researcher. \nSpecialties: Reverse Engineering (RE), Tools for automatic binary analysis, Exploit development, Malware analysis, Hardware/Firmware security, Cryptography, Penetration testing, Web-security and Network security. \n \nSpeaker at international security conferences such as Blackhat, DEFCON, CanSecWest, Toorcon, Hackito Ergo Sum, Hack In The Box, Positive Hack Days, Bsides PDX and in committee of ZeroNights.  \n \nI founded first DEFCON Group in Ukraine: DC02139. On this basis, was created CTF team: dcua. \nWebsites: http://defcon.org.ua/ Summary I am Security Researcher. \nSpecialties: Reverse Engineering (RE), Tools for automatic binary analysis, Exploit development, Malware analysis, Hardware/Firmware security, Cryptography, Penetration testing, Web-security and Network security. \n \nSpeaker at international security conferences such as Blackhat, DEFCON, CanSecWest, Toorcon, Hackito Ergo Sum, Hack In The Box, Positive Hack Days, Bsides PDX and in committee of ZeroNights.  \n \nI founded first DEFCON Group in Ukraine: DC02139. On this basis, was created CTF team: dcua. \nWebsites: http://defcon.org.ua/ I am Security Researcher. \nSpecialties: Reverse Engineering (RE), Tools for automatic binary analysis, Exploit development, Malware analysis, Hardware/Firmware security, Cryptography, Penetration testing, Web-security and Network security. \n \nSpeaker at international security conferences such as Blackhat, DEFCON, CanSecWest, Toorcon, Hackito Ergo Sum, Hack In The Box, Positive Hack Days, Bsides PDX and in committee of ZeroNights.  \n \nI founded first DEFCON Group in Ukraine: DC02139. On this basis, was created CTF team: dcua. \nWebsites: http://defcon.org.ua/ I am Security Researcher. \nSpecialties: Reverse Engineering (RE), Tools for automatic binary analysis, Exploit development, Malware analysis, Hardware/Firmware security, Cryptography, Penetration testing, Web-security and Network security. \n \nSpeaker at international security conferences such as Blackhat, DEFCON, CanSecWest, Toorcon, Hackito Ergo Sum, Hack In The Box, Positive Hack Days, Bsides PDX and in committee of ZeroNights.  \n \nI founded first DEFCON Group in Ukraine: DC02139. On this basis, was created CTF team: dcua. \nWebsites: http://defcon.org.ua/ Experience Senior Security Researcher Intel Corporation May 2014  – Present (1 year 4 months) Hillsboro, Oregon Member of Advanced Threat Research team in the office of Secure Platform and Solutions CTO, Intel Security Group, Intel Corporation. Senior Security Researcher Intel Corporation February 2013  –  May 2014  (1 year 4 months) Hillsboro, Oregon Member of Atom CPU Security Analysis Team within Security Center of Excellence (SeCoE) of Intel Architecture Group.  \nI performed security validation and vulnerability analysis of future Atom CPU families and also I did security validation of various other Intel products as short term projects. Visiting Scholar UC Berkeley August 2011  –  December 2012  (1 year 5 months) California, USA Security Researcher at BitBlaze Group.  \nI worked on a series of projects related to symbolic execution, binary-level information-flow analysis and other security applications. \nKey roles: Researched and developed computer security technologies. Analyzed software vulnerabilities and developed exploits. Programmed tools for reverse engineering.  \nLanguages and tools used: Qemu, Xed, Valgrind, STP/SMT/Z3, S2E, Bap. \nWebsite: http://bitblaze.cs.berkeley.edu/ Security Researcher and Reverse Engineer Center of Innovative Security Solutions (CISS) July 2010  –  August 2011  (1 year 2 months) Moscow, Russia Center of Innovative Security Solutions \nKey roles: Searched of unkown \"0days\" vulnerabilities in kernel space (MS Windows kernel, Drivers) and user space (Safari, Chrome, IE browsers and MS Office) software. Analyzed \"1days\" vulnerabilities and wrote exploits. \nLanguages and tools used: IDA Pro, wingdb, VS2010, python. Software Developer CyberVision, Inc. January 2010  –  July 2010  (7 months) NJ, USA Key roles: Developed client-server application: Roundbox. \nIt is a server based performance-sensitive solution for video broadcasting. \nLanguages and tools used: C, C++, POSIX API, STL, Boost, ACE, Java, XML. \nWebsite: http://www.cybervisiontech.com , http://www.roundbox.com Software Engineer STRC Ukrainian television and radio broadcasting (UTR) - TV channel June 2007  –  December 2009  (2 years 7 months) Kiev, Ukraine Key roles: Developed client-server databases for information processing. \nLanguages and tools used: Microsoft Access, MySQL. \nWebsite: http://utr.tv/eng/ Network Operations Specialist Telme (Italy) April 2008  –  January 2009  (10 months) Kiev, Ukraine Key roles: Maintained FreeBSD/Linux: Virtualization, Nginx and VoIP servers. \nDeveloped Shell, Perl, and PHP scripts. Maintained network devices. \nWebsite: http://www.telme.sg Senior Security Researcher Intel Corporation May 2014  – Present (1 year 4 months) Hillsboro, Oregon Member of Advanced Threat Research team in the office of Secure Platform and Solutions CTO, Intel Security Group, Intel Corporation. Senior Security Researcher Intel Corporation May 2014  – Present (1 year 4 months) Hillsboro, Oregon Member of Advanced Threat Research team in the office of Secure Platform and Solutions CTO, Intel Security Group, Intel Corporation. Senior Security Researcher Intel Corporation February 2013  –  May 2014  (1 year 4 months) Hillsboro, Oregon Member of Atom CPU Security Analysis Team within Security Center of Excellence (SeCoE) of Intel Architecture Group.  \nI performed security validation and vulnerability analysis of future Atom CPU families and also I did security validation of various other Intel products as short term projects. Senior Security Researcher Intel Corporation February 2013  –  May 2014  (1 year 4 months) Hillsboro, Oregon Member of Atom CPU Security Analysis Team within Security Center of Excellence (SeCoE) of Intel Architecture Group.  \nI performed security validation and vulnerability analysis of future Atom CPU families and also I did security validation of various other Intel products as short term projects. Visiting Scholar UC Berkeley August 2011  –  December 2012  (1 year 5 months) California, USA Security Researcher at BitBlaze Group.  \nI worked on a series of projects related to symbolic execution, binary-level information-flow analysis and other security applications. \nKey roles: Researched and developed computer security technologies. Analyzed software vulnerabilities and developed exploits. Programmed tools for reverse engineering.  \nLanguages and tools used: Qemu, Xed, Valgrind, STP/SMT/Z3, S2E, Bap. \nWebsite: http://bitblaze.cs.berkeley.edu/ Visiting Scholar UC Berkeley August 2011  –  December 2012  (1 year 5 months) California, USA Security Researcher at BitBlaze Group.  \nI worked on a series of projects related to symbolic execution, binary-level information-flow analysis and other security applications. \nKey roles: Researched and developed computer security technologies. Analyzed software vulnerabilities and developed exploits. Programmed tools for reverse engineering.  \nLanguages and tools used: Qemu, Xed, Valgrind, STP/SMT/Z3, S2E, Bap. \nWebsite: http://bitblaze.cs.berkeley.edu/ Security Researcher and Reverse Engineer Center of Innovative Security Solutions (CISS) July 2010  –  August 2011  (1 year 2 months) Moscow, Russia Center of Innovative Security Solutions \nKey roles: Searched of unkown \"0days\" vulnerabilities in kernel space (MS Windows kernel, Drivers) and user space (Safari, Chrome, IE browsers and MS Office) software. Analyzed \"1days\" vulnerabilities and wrote exploits. \nLanguages and tools used: IDA Pro, wingdb, VS2010, python. Security Researcher and Reverse Engineer Center of Innovative Security Solutions (CISS) July 2010  –  August 2011  (1 year 2 months) Moscow, Russia Center of Innovative Security Solutions \nKey roles: Searched of unkown \"0days\" vulnerabilities in kernel space (MS Windows kernel, Drivers) and user space (Safari, Chrome, IE browsers and MS Office) software. Analyzed \"1days\" vulnerabilities and wrote exploits. \nLanguages and tools used: IDA Pro, wingdb, VS2010, python. Software Developer CyberVision, Inc. January 2010  –  July 2010  (7 months) NJ, USA Key roles: Developed client-server application: Roundbox. \nIt is a server based performance-sensitive solution for video broadcasting. \nLanguages and tools used: C, C++, POSIX API, STL, Boost, ACE, Java, XML. \nWebsite: http://www.cybervisiontech.com , http://www.roundbox.com Software Developer CyberVision, Inc. January 2010  –  July 2010  (7 months) NJ, USA Key roles: Developed client-server application: Roundbox. \nIt is a server based performance-sensitive solution for video broadcasting. \nLanguages and tools used: C, C++, POSIX API, STL, Boost, ACE, Java, XML. \nWebsite: http://www.cybervisiontech.com , http://www.roundbox.com Software Engineer STRC Ukrainian television and radio broadcasting (UTR) - TV channel June 2007  –  December 2009  (2 years 7 months) Kiev, Ukraine Key roles: Developed client-server databases for information processing. \nLanguages and tools used: Microsoft Access, MySQL. \nWebsite: http://utr.tv/eng/ Software Engineer STRC Ukrainian television and radio broadcasting (UTR) - TV channel June 2007  –  December 2009  (2 years 7 months) Kiev, Ukraine Key roles: Developed client-server databases for information processing. \nLanguages and tools used: Microsoft Access, MySQL. \nWebsite: http://utr.tv/eng/ Network Operations Specialist Telme (Italy) April 2008  –  January 2009  (10 months) Kiev, Ukraine Key roles: Maintained FreeBSD/Linux: Virtualization, Nginx and VoIP servers. \nDeveloped Shell, Perl, and PHP scripts. Maintained network devices. \nWebsite: http://www.telme.sg Network Operations Specialist Telme (Italy) April 2008  –  January 2009  (10 months) Kiev, Ukraine Key roles: Maintained FreeBSD/Linux: Virtualization, Nginx and VoIP servers. \nDeveloped Shell, Perl, and PHP scripts. Maintained network devices. \nWebsite: http://www.telme.sg Languages English Ukrainian Russian English Ukrainian Russian English Ukrainian Russian Skills x86 Assembly Computer Security Computer Science C C++ Python Reverse Engineering Security Research Skills  x86 Assembly Computer Security Computer Science C C++ Python Reverse Engineering Security Research x86 Assembly Computer Security Computer Science C C++ Python Reverse Engineering Security Research x86 Assembly Computer Security Computer Science C C++ Python Reverse Engineering Security Research Education National Technical University of Ukraine 'Kyiv Polytechnic Institute' Doctor of Philosophy (PhD) Candidate,  Information Technology (05.13.06). 2010  – 2014 Tools for automatic binary analysis. National Technical University of Ukraine 'Kyiv Polytechnic Institute' Master of Science (MS),  Computer Science , 3,73/4. 2008  – 2010 Information security in computer systems and networks. “Research on vulnerabilities in software, and the design of mechanisms for the protection of data in the operating system using neural networks.” National Technical University of Ukraine 'Kyiv Polytechnic Institute' Doctor of Philosophy (PhD) Candidate,  Information Technology (05.13.06). 2010  – 2014 Tools for automatic binary analysis. National Technical University of Ukraine 'Kyiv Polytechnic Institute' Doctor of Philosophy (PhD) Candidate,  Information Technology (05.13.06). 2010  – 2014 Tools for automatic binary analysis. National Technical University of Ukraine 'Kyiv Polytechnic Institute' Doctor of Philosophy (PhD) Candidate,  Information Technology (05.13.06). 2010  – 2014 Tools for automatic binary analysis. National Technical University of Ukraine 'Kyiv Polytechnic Institute' Master of Science (MS),  Computer Science , 3,73/4. 2008  – 2010 Information security in computer systems and networks. “Research on vulnerabilities in software, and the design of mechanisms for the protection of data in the operating system using neural networks.” National Technical University of Ukraine 'Kyiv Polytechnic Institute' Master of Science (MS),  Computer Science , 3,73/4. 2008  – 2010 Information security in computer systems and networks. “Research on vulnerabilities in software, and the design of mechanisms for the protection of data in the operating system using neural networks.” National Technical University of Ukraine 'Kyiv Polytechnic Institute' Master of Science (MS),  Computer Science , 3,73/4. 2008  – 2010 Information security in computer systems and networks. “Research on vulnerabilities in software, and the design of mechanisms for the protection of data in the operating system using neural networks.” Honors & Awards Winner of the competition Hack2Own at Positive Hack Days 2011 Positive Hack Days 2011 May 2011 Positive Hack Days 2011. Winner of the competition Hack2Own, coworker and I demonstrated 0day vulnerability (CVE-2011-0222) in the latest version of Safari for Windows and took the first prize. Moscow, Russia.  \nWebsite: \nhttp://blog.phdays.com/2012/05/rules-of-hack2own-competition-at-phdays.html , http://packetstormsecurity.org/files/author/9046/ Winner of the competition Hack2Own at Positive Hack Days 2011 Positive Hack Days 2011 May 2011 Positive Hack Days 2011. Winner of the competition Hack2Own, coworker and I demonstrated 0day vulnerability (CVE-2011-0222) in the latest version of Safari for Windows and took the first prize. Moscow, Russia.  \nWebsite: \nhttp://blog.phdays.com/2012/05/rules-of-hack2own-competition-at-phdays.html , http://packetstormsecurity.org/files/author/9046/ Winner of the competition Hack2Own at Positive Hack Days 2011 Positive Hack Days 2011 May 2011 Positive Hack Days 2011. Winner of the competition Hack2Own, coworker and I demonstrated 0day vulnerability (CVE-2011-0222) in the latest version of Safari for Windows and took the first prize. Moscow, Russia.  \nWebsite: \nhttp://blog.phdays.com/2012/05/rules-of-hack2own-competition-at-phdays.html , http://packetstormsecurity.org/files/author/9046/ Winner of the competition Hack2Own at Positive Hack Days 2011 Positive Hack Days 2011 May 2011 Positive Hack Days 2011. Winner of the competition Hack2Own, coworker and I demonstrated 0day vulnerability (CVE-2011-0222) in the latest version of Safari for Windows and took the first prize. Moscow, Russia.  \nWebsite: \nhttp://blog.phdays.com/2012/05/rules-of-hack2own-competition-at-phdays.html , http://packetstormsecurity.org/files/author/9046/ ", "Summary Belief is God - I am passionate about life .. spirituality, technology and human relationships Summary Belief is God - I am passionate about life .. spirituality, technology and human relationships Belief is God - I am passionate about life .. spirituality, technology and human relationships Belief is God - I am passionate about life .. spirituality, technology and human relationships Experience Security Researcher Intel Corporation June 2014  – Present (1 year 3 months) Hillsboro, Oregon, USA Senior Security Researcher Intel Corporation June 2014  – Present (1 year 3 months) Security Validation lead and Manager Intel Technology India Private Limited November 2011  –  May 2014  (2 years 7 months) Bangalore, india Security Evaluation Engineer Intel Microelectronics (M) Sdn Bhd November 2009  –  October 2011  (2 years) Penang, Malaysia Senior Systems Engineer and researcher Intel Technology India Private Limited November 2000  –  October 2009  (9 years) Bangalore, india Senior Software Engineer VXTel Technology India Private Limited November 2000  –  February 2001  (4 months) Bangalore, India Senior System Engineer Tata Elxsi India Private Limited July 2000  –  October 2000  (4 months) Bangalore, India Research Assistant Indian Institute of science October 1998  –  June 2000  (1 year 9 months) Bangalore, india Security Researcher Intel Corporation June 2014  – Present (1 year 3 months) Hillsboro, Oregon, USA Security Researcher Intel Corporation June 2014  – Present (1 year 3 months) Hillsboro, Oregon, USA Senior Security Researcher Intel Corporation June 2014  – Present (1 year 3 months) Senior Security Researcher Intel Corporation June 2014  – Present (1 year 3 months) Security Validation lead and Manager Intel Technology India Private Limited November 2011  –  May 2014  (2 years 7 months) Bangalore, india Security Validation lead and Manager Intel Technology India Private Limited November 2011  –  May 2014  (2 years 7 months) Bangalore, india Security Evaluation Engineer Intel Microelectronics (M) Sdn Bhd November 2009  –  October 2011  (2 years) Penang, Malaysia Security Evaluation Engineer Intel Microelectronics (M) Sdn Bhd November 2009  –  October 2011  (2 years) Penang, Malaysia Senior Systems Engineer and researcher Intel Technology India Private Limited November 2000  –  October 2009  (9 years) Bangalore, india Senior Systems Engineer and researcher Intel Technology India Private Limited November 2000  –  October 2009  (9 years) Bangalore, india Senior Software Engineer VXTel Technology India Private Limited November 2000  –  February 2001  (4 months) Bangalore, India Senior Software Engineer VXTel Technology India Private Limited November 2000  –  February 2001  (4 months) Bangalore, India Senior System Engineer Tata Elxsi India Private Limited July 2000  –  October 2000  (4 months) Bangalore, India Senior System Engineer Tata Elxsi India Private Limited July 2000  –  October 2000  (4 months) Bangalore, India Research Assistant Indian Institute of science October 1998  –  June 2000  (1 year 9 months) Bangalore, india Research Assistant Indian Institute of science October 1998  –  June 2000  (1 year 9 months) Bangalore, india Languages Kannada Professional working proficiency English Full professional proficiency Telugu Limited working proficiency Hindi Elementary proficiency Sanskrit Limited working proficiency Tamil Elementary proficiency Kannada Professional working proficiency English Full professional proficiency Telugu Limited working proficiency Hindi Elementary proficiency Sanskrit Limited working proficiency Tamil Elementary proficiency Kannada Professional working proficiency English Full professional proficiency Telugu Limited working proficiency Hindi Elementary proficiency Sanskrit Limited working proficiency Tamil Elementary proficiency Professional working proficiency Full professional proficiency Limited working proficiency Elementary proficiency Limited working proficiency Elementary proficiency Skills SoC Debugging Embedded Systems Security ASIC Computer Architecture Semiconductors Embedded software and... Security research and... Device Drivers ARM Networking and... low power wireless... healthcare research Embedded Software Software Development RTOS C Verilog Processors Digital Signal... Testing Perl VLSI Algorithms C++ VHDL See 12+     See less Skills  SoC Debugging Embedded Systems Security ASIC Computer Architecture Semiconductors Embedded software and... Security research and... Device Drivers ARM Networking and... low power wireless... healthcare research Embedded Software Software Development RTOS C Verilog Processors Digital Signal... Testing Perl VLSI Algorithms C++ VHDL See 12+     See less SoC Debugging Embedded Systems Security ASIC Computer Architecture Semiconductors Embedded software and... Security research and... Device Drivers ARM Networking and... low power wireless... healthcare research Embedded Software Software Development RTOS C Verilog Processors Digital Signal... Testing Perl VLSI Algorithms C++ VHDL See 12+     See less SoC Debugging Embedded Systems Security ASIC Computer Architecture Semiconductors Embedded software and... Security research and... Device Drivers ARM Networking and... low power wireless... healthcare research Embedded Software Software Development RTOS C Verilog Processors Digital Signal... Testing Perl VLSI Algorithms C++ VHDL See 12+     See less Education MS In Digital Design and Embedded Systems Bachelor of Engineering (BE) 2007  – 2008 BITS Computer education, Bangalore IISc Research Assistant Kalpataru Science College, TIPTUR Kalpataru Science College, TIPTUR Kalpataru Science College, TIPTUR UVCE Bachelor of Engineering (B.E.) MS In Digital Design and Embedded Systems Bachelor of Engineering (BE) 2007  – 2008 MS In Digital Design and Embedded Systems Bachelor of Engineering (BE) 2007  – 2008 MS In Digital Design and Embedded Systems Bachelor of Engineering (BE) 2007  – 2008 BITS Computer education, Bangalore BITS Computer education, Bangalore BITS Computer education, Bangalore IISc Research Assistant IISc Research Assistant IISc Research Assistant Kalpataru Science College, TIPTUR Kalpataru Science College, TIPTUR Kalpataru Science College, TIPTUR Kalpataru Science College, TIPTUR Kalpataru Science College, TIPTUR Kalpataru Science College, TIPTUR Kalpataru Science College, TIPTUR Kalpataru Science College, TIPTUR Kalpataru Science College, TIPTUR UVCE Bachelor of Engineering (B.E.) UVCE Bachelor of Engineering (B.E.) UVCE Bachelor of Engineering (B.E.) ", "Summary Rodrigo Rubira Branco (BSDaemon) works as Principal Security Researcher at Intel Corporation in the Security Center of Excellence Client CPU Team and is the Founder of the Dissect || PE Malware Analysis Project. Held positions as Director of Vulnerability & Malware Research at Qualys and as Chief Security Research at Check Point where he founded the Vulnerability Discovery Team (VDT) and released dozens of vulnerabilities in many important software. In 2011 he was honored as one of the top contributors to Adobe Vulnerabilities in the past 12 months. Previous to that, he worked as Senior Vulnerability Researcher in COSEINC, as Principal Security Researcher at Scanit and as Staff Software Engineer in the IBM Advanced Linux Response Team (ALRT) also working in the IBM Toolchain (Debugging) Team for PowerPC Architecture. He is a member of the RISE Security Group and is the organizer of Hackers to Hackers Conference (H2HC), the oldest and biggest security research conference in Latin America. He is an active contributor to open-source projects (like ebizzy, linux kernel, others). Accepted speaker in lots of security and open-source related events as H2HC, Black Hat, Hack in The Box, XCon, VNSecurity, OLS, Defcon, Hackito, Ekoparty, Troopers and others. \n \nSpecialties: Security & Vulnerability Researching, Operating System Internals, Software Exploitation, Malware Analysis Summary Rodrigo Rubira Branco (BSDaemon) works as Principal Security Researcher at Intel Corporation in the Security Center of Excellence Client CPU Team and is the Founder of the Dissect || PE Malware Analysis Project. Held positions as Director of Vulnerability & Malware Research at Qualys and as Chief Security Research at Check Point where he founded the Vulnerability Discovery Team (VDT) and released dozens of vulnerabilities in many important software. In 2011 he was honored as one of the top contributors to Adobe Vulnerabilities in the past 12 months. Previous to that, he worked as Senior Vulnerability Researcher in COSEINC, as Principal Security Researcher at Scanit and as Staff Software Engineer in the IBM Advanced Linux Response Team (ALRT) also working in the IBM Toolchain (Debugging) Team for PowerPC Architecture. He is a member of the RISE Security Group and is the organizer of Hackers to Hackers Conference (H2HC), the oldest and biggest security research conference in Latin America. He is an active contributor to open-source projects (like ebizzy, linux kernel, others). Accepted speaker in lots of security and open-source related events as H2HC, Black Hat, Hack in The Box, XCon, VNSecurity, OLS, Defcon, Hackito, Ekoparty, Troopers and others. \n \nSpecialties: Security & Vulnerability Researching, Operating System Internals, Software Exploitation, Malware Analysis Rodrigo Rubira Branco (BSDaemon) works as Principal Security Researcher at Intel Corporation in the Security Center of Excellence Client CPU Team and is the Founder of the Dissect || PE Malware Analysis Project. Held positions as Director of Vulnerability & Malware Research at Qualys and as Chief Security Research at Check Point where he founded the Vulnerability Discovery Team (VDT) and released dozens of vulnerabilities in many important software. In 2011 he was honored as one of the top contributors to Adobe Vulnerabilities in the past 12 months. Previous to that, he worked as Senior Vulnerability Researcher in COSEINC, as Principal Security Researcher at Scanit and as Staff Software Engineer in the IBM Advanced Linux Response Team (ALRT) also working in the IBM Toolchain (Debugging) Team for PowerPC Architecture. He is a member of the RISE Security Group and is the organizer of Hackers to Hackers Conference (H2HC), the oldest and biggest security research conference in Latin America. He is an active contributor to open-source projects (like ebizzy, linux kernel, others). Accepted speaker in lots of security and open-source related events as H2HC, Black Hat, Hack in The Box, XCon, VNSecurity, OLS, Defcon, Hackito, Ekoparty, Troopers and others. \n \nSpecialties: Security & Vulnerability Researching, Operating System Internals, Software Exploitation, Malware Analysis Rodrigo Rubira Branco (BSDaemon) works as Principal Security Researcher at Intel Corporation in the Security Center of Excellence Client CPU Team and is the Founder of the Dissect || PE Malware Analysis Project. Held positions as Director of Vulnerability & Malware Research at Qualys and as Chief Security Research at Check Point where he founded the Vulnerability Discovery Team (VDT) and released dozens of vulnerabilities in many important software. In 2011 he was honored as one of the top contributors to Adobe Vulnerabilities in the past 12 months. Previous to that, he worked as Senior Vulnerability Researcher in COSEINC, as Principal Security Researcher at Scanit and as Staff Software Engineer in the IBM Advanced Linux Response Team (ALRT) also working in the IBM Toolchain (Debugging) Team for PowerPC Architecture. He is a member of the RISE Security Group and is the organizer of Hackers to Hackers Conference (H2HC), the oldest and biggest security research conference in Latin America. He is an active contributor to open-source projects (like ebizzy, linux kernel, others). Accepted speaker in lots of security and open-source related events as H2HC, Black Hat, Hack in The Box, XCon, VNSecurity, OLS, Defcon, Hackito, Ekoparty, Troopers and others. \n \nSpecialties: Security & Vulnerability Researching, Operating System Internals, Software Exploitation, Malware Analysis Experience Principal Security Researcher Intel Corporation October 2013  – Present (1 year 11 months) Hillsboro, Oregon Member of the Security Center of Excellent (SeCoE) in the Client CPU Team and lead of Hack-a-thons across the organization. Founder | Researcher Dissect.pe July 2010  – Present (5 years 2 months) Dissect.pe is a malware research project, now in beta stage. \n \nThe idea of the project is to provide a free interface for malware analysis, similar to other existing projects, but with advances that will be announced when we start freely dissecting samples. \n \nFor now, the system has malware classification and is open for partnership with industry vendors and other projects for feed exchange. \n \nThe link for the project is: http://feeds.dissect.pe/ Organizer Hackers to Hackers Conference H2HC - Hackers to Hackers Conference January 2004  – Present (11 years 8 months) We are organizing since 2004 a security conference called Hackers to Hackers Conference (H2HC).  \n \nThis conference is increasing every year and is used as a powerful way of communication between high skilled security researchers in Brazil. \n \nMany new techniques, tools and vulnerabilities have been presented during the conference years.  \n \nAlso acting as a speaker, I presented about the follow topics: \n- Polymorphic attacks (where I presented the SCMorphism software that \"automagically\" generates polymorphic shellcodes)  \n- Kernel Rootkits x Application Layer Firewalls (with real sample using ISA Server 2004) \n- Syscall Proxying || Pivoting (where I showed a framework to be PRELOADED permiting you run any program in your own machine but in fact it was translated to the analysed machine) Senior Security Researcher RISE Security January 2004  – Present (11 years 8 months) Organization founded in 2004 by three brazilian security researchers specialized in vulnerability research, exploit development, source code auditing, reverse engineering, intrusion detection and computer forensics. The main objective is to evolve, ethically sharing the results with the security community. Research Assistant University of Illinois at Urbana-Champaign July 2013  –  December 2013  (6 months) Urbana-Champaign, Illinois Area While doing my PhD, I received a tuition and support from the university to perform research in the field of computer security and to give classes on reverse engineering in different curriculums. R&D Director Cipher January 2013  –  July 2013  (7 months) - Responsible for the Cipher Technology, Cipher Intelligence and Cipher Labs Teams \n- Coordinate the R&D and Innovation teams \n- Manage the Ethical Hacking Team that provides Penetration Test, Code Review and other high-level technology offers to customers Director of Vulnerability & Malware Research Qualys July 2011  –  December 2012  (1 year 6 months) Lead the Security Research Initiatives in Qualys related to automated malware analysis and vulnerability finding, exploitation and understanding. Chief Security Research Check Point Software Technologies April 2008  –  July 2011  (3 years 4 months) Israel Responsible for the Vulnerability Discovery Team (VDT) Senior Vulnerability Researcher COSEINC November 2008  –  July 2010  (1 year 9 months) COSEINC is a Singapore based and privately funded company dedicated to providing highly specialized information security services to our clients. Founded in 2004, we are a young and dynamic company whose constitution are computer security experts, from diverse backgrounds and geographies, with distinguished credentials and experience. \n \nIt is our aim to provide our clients with the most professional and competent expertise and services at the most reasonable rates so that they can achieve the highest returns on their information technology investment. \n \nOrganizationally, COSEINC is structured into 2 teams. They are the Advanced Malware Laboratory (AML) and the Vulnerability Research Laboratory (VRL).  \n \nAs for the VRL, this team is focus on discovering inherent vulnerabilities in software either due to bad development or weak implementation. Basically software is created by humans, and to err is human. The VRL team is sub-divided into 2 sub-teams, namely the Windows sub-team and the Linux sub-team. Both sub-teams have published several findings. Top Review and Author hakin9 2007  –  February 2010  (3 years) Hakin9 is an important magazine in the IT Security Industry, with leading articles. \n \nFor Hakin9 I contributed with two articles (about Kernel Exploitation and Anti-Forensics and about IDS/IPS Evasion). Also, I'm a top reviewer of articles approved for publication, giving feedbacks to the authors as well. SANS Instructor Brazil SANS Institute November 2006  –  December 2009  (3 years 2 months) The first to bring the SANS trainings to Brazil during a Hackers to Hackers Conference (H2HC) I'm authorized to give the Cutting Edge Hacking Techniques, the Mastering Packet Analysis and the Exploitation classes. Staff Software Engineer IBM May 2006  –  May 2008  (2 years 1 month) Worked as a software Engineer at IBM, member of the Advanced Linux Response Team (ALRT), part of the IBM Linux Technology Center (IBM/LTC) Brazil also worked in the IBM Toolchain (Debugging) Team for Power Architecture. Principal Security Researcher Scanit Middle East 2008  –  2008  (less than a year) Lead the vulnerability research initiatives in the company. Professor of Operating Systems FGP - Faculdade G&P January 2006  –  July 2006  (7 months) University Professor for the Operating Systems class, focusing on the design of operating systems trying to bring together the academic focus with real-life experience. Senior Security and OpenSource Analyst MD Systems Networking January 2005  –  May 2006  (1 year 5 months) Act as a leader in solution provide using opensource and with focus on security. The company is small-sized, but one of the main sellers of Citrix in the latin America, with many big customers. Senior Security Analyst Porto Seguro 2005  –  2006  (1 year) Developed solutions to automate security needs, participated in new projects definitions, taking care of the security design. Security Architect Firewalls Security Corporation 2000  –  2005  (5 years) Firewalls was founded to provide state-of-art security solutions to different customers needs. The idea was to act as an outsourced company for big vendors, achieving the best-in-class solution design without the need of all burocracy of a big company. \n \nIn the company I acted as the design and code of the custom-made solutions for many different customers. As the owner/founder I also had the opportunity to deal with many aspects of the business and grown in experience in understand the challenges behind a company. External Consultant SCUA January 2002  –  November 2004  (2 years 11 months) - Helped in the new infra-structure of the SCUA Suite which provides Windows Desktop Security  \n- Developed a Linux PoC of the SCUA Suite for a big RFP in the Brazilian Government \n- Participated in Security Consultancy engagements in SCUA customers External Consultant Cyclades January 2002  –  January 2004  (2 years 1 month) Acted as an external consultant in Cyclades Brazil, giving trainings to partners and to support employees about the company equipaments and network in general. \n \nAlso, helped the development team in questions regarding Linux. Sr. Security and OpenSource Researcher Stationet July 1998  –  January 2000  (1 year 7 months) Acted in many different aspects of a new company starting to offer Linux and Security services.  \n \nTeacher in the trainings, consultant to many different companies and developer of internal tools to automation of the services. Principal Security Researcher Intel Corporation October 2013  – Present (1 year 11 months) Hillsboro, Oregon Member of the Security Center of Excellent (SeCoE) in the Client CPU Team and lead of Hack-a-thons across the organization. Principal Security Researcher Intel Corporation October 2013  – Present (1 year 11 months) Hillsboro, Oregon Member of the Security Center of Excellent (SeCoE) in the Client CPU Team and lead of Hack-a-thons across the organization. Founder | Researcher Dissect.pe July 2010  – Present (5 years 2 months) Dissect.pe is a malware research project, now in beta stage. \n \nThe idea of the project is to provide a free interface for malware analysis, similar to other existing projects, but with advances that will be announced when we start freely dissecting samples. \n \nFor now, the system has malware classification and is open for partnership with industry vendors and other projects for feed exchange. \n \nThe link for the project is: http://feeds.dissect.pe/ Founder | Researcher Dissect.pe July 2010  – Present (5 years 2 months) Dissect.pe is a malware research project, now in beta stage. \n \nThe idea of the project is to provide a free interface for malware analysis, similar to other existing projects, but with advances that will be announced when we start freely dissecting samples. \n \nFor now, the system has malware classification and is open for partnership with industry vendors and other projects for feed exchange. \n \nThe link for the project is: http://feeds.dissect.pe/ Organizer Hackers to Hackers Conference H2HC - Hackers to Hackers Conference January 2004  – Present (11 years 8 months) We are organizing since 2004 a security conference called Hackers to Hackers Conference (H2HC).  \n \nThis conference is increasing every year and is used as a powerful way of communication between high skilled security researchers in Brazil. \n \nMany new techniques, tools and vulnerabilities have been presented during the conference years.  \n \nAlso acting as a speaker, I presented about the follow topics: \n- Polymorphic attacks (where I presented the SCMorphism software that \"automagically\" generates polymorphic shellcodes)  \n- Kernel Rootkits x Application Layer Firewalls (with real sample using ISA Server 2004) \n- Syscall Proxying || Pivoting (where I showed a framework to be PRELOADED permiting you run any program in your own machine but in fact it was translated to the analysed machine) Organizer Hackers to Hackers Conference H2HC - Hackers to Hackers Conference January 2004  – Present (11 years 8 months) We are organizing since 2004 a security conference called Hackers to Hackers Conference (H2HC).  \n \nThis conference is increasing every year and is used as a powerful way of communication between high skilled security researchers in Brazil. \n \nMany new techniques, tools and vulnerabilities have been presented during the conference years.  \n \nAlso acting as a speaker, I presented about the follow topics: \n- Polymorphic attacks (where I presented the SCMorphism software that \"automagically\" generates polymorphic shellcodes)  \n- Kernel Rootkits x Application Layer Firewalls (with real sample using ISA Server 2004) \n- Syscall Proxying || Pivoting (where I showed a framework to be PRELOADED permiting you run any program in your own machine but in fact it was translated to the analysed machine) Senior Security Researcher RISE Security January 2004  – Present (11 years 8 months) Organization founded in 2004 by three brazilian security researchers specialized in vulnerability research, exploit development, source code auditing, reverse engineering, intrusion detection and computer forensics. The main objective is to evolve, ethically sharing the results with the security community. Senior Security Researcher RISE Security January 2004  – Present (11 years 8 months) Organization founded in 2004 by three brazilian security researchers specialized in vulnerability research, exploit development, source code auditing, reverse engineering, intrusion detection and computer forensics. The main objective is to evolve, ethically sharing the results with the security community. Research Assistant University of Illinois at Urbana-Champaign July 2013  –  December 2013  (6 months) Urbana-Champaign, Illinois Area While doing my PhD, I received a tuition and support from the university to perform research in the field of computer security and to give classes on reverse engineering in different curriculums. Research Assistant University of Illinois at Urbana-Champaign July 2013  –  December 2013  (6 months) Urbana-Champaign, Illinois Area While doing my PhD, I received a tuition and support from the university to perform research in the field of computer security and to give classes on reverse engineering in different curriculums. R&D Director Cipher January 2013  –  July 2013  (7 months) - Responsible for the Cipher Technology, Cipher Intelligence and Cipher Labs Teams \n- Coordinate the R&D and Innovation teams \n- Manage the Ethical Hacking Team that provides Penetration Test, Code Review and other high-level technology offers to customers R&D Director Cipher January 2013  –  July 2013  (7 months) - Responsible for the Cipher Technology, Cipher Intelligence and Cipher Labs Teams \n- Coordinate the R&D and Innovation teams \n- Manage the Ethical Hacking Team that provides Penetration Test, Code Review and other high-level technology offers to customers Director of Vulnerability & Malware Research Qualys July 2011  –  December 2012  (1 year 6 months) Lead the Security Research Initiatives in Qualys related to automated malware analysis and vulnerability finding, exploitation and understanding. Director of Vulnerability & Malware Research Qualys July 2011  –  December 2012  (1 year 6 months) Lead the Security Research Initiatives in Qualys related to automated malware analysis and vulnerability finding, exploitation and understanding. Chief Security Research Check Point Software Technologies April 2008  –  July 2011  (3 years 4 months) Israel Responsible for the Vulnerability Discovery Team (VDT) Chief Security Research Check Point Software Technologies April 2008  –  July 2011  (3 years 4 months) Israel Responsible for the Vulnerability Discovery Team (VDT) Senior Vulnerability Researcher COSEINC November 2008  –  July 2010  (1 year 9 months) COSEINC is a Singapore based and privately funded company dedicated to providing highly specialized information security services to our clients. Founded in 2004, we are a young and dynamic company whose constitution are computer security experts, from diverse backgrounds and geographies, with distinguished credentials and experience. \n \nIt is our aim to provide our clients with the most professional and competent expertise and services at the most reasonable rates so that they can achieve the highest returns on their information technology investment. \n \nOrganizationally, COSEINC is structured into 2 teams. They are the Advanced Malware Laboratory (AML) and the Vulnerability Research Laboratory (VRL).  \n \nAs for the VRL, this team is focus on discovering inherent vulnerabilities in software either due to bad development or weak implementation. Basically software is created by humans, and to err is human. The VRL team is sub-divided into 2 sub-teams, namely the Windows sub-team and the Linux sub-team. Both sub-teams have published several findings. Senior Vulnerability Researcher COSEINC November 2008  –  July 2010  (1 year 9 months) COSEINC is a Singapore based and privately funded company dedicated to providing highly specialized information security services to our clients. Founded in 2004, we are a young and dynamic company whose constitution are computer security experts, from diverse backgrounds and geographies, with distinguished credentials and experience. \n \nIt is our aim to provide our clients with the most professional and competent expertise and services at the most reasonable rates so that they can achieve the highest returns on their information technology investment. \n \nOrganizationally, COSEINC is structured into 2 teams. They are the Advanced Malware Laboratory (AML) and the Vulnerability Research Laboratory (VRL).  \n \nAs for the VRL, this team is focus on discovering inherent vulnerabilities in software either due to bad development or weak implementation. Basically software is created by humans, and to err is human. The VRL team is sub-divided into 2 sub-teams, namely the Windows sub-team and the Linux sub-team. Both sub-teams have published several findings. Top Review and Author hakin9 2007  –  February 2010  (3 years) Hakin9 is an important magazine in the IT Security Industry, with leading articles. \n \nFor Hakin9 I contributed with two articles (about Kernel Exploitation and Anti-Forensics and about IDS/IPS Evasion). Also, I'm a top reviewer of articles approved for publication, giving feedbacks to the authors as well. Top Review and Author hakin9 2007  –  February 2010  (3 years) Hakin9 is an important magazine in the IT Security Industry, with leading articles. \n \nFor Hakin9 I contributed with two articles (about Kernel Exploitation and Anti-Forensics and about IDS/IPS Evasion). Also, I'm a top reviewer of articles approved for publication, giving feedbacks to the authors as well. SANS Instructor Brazil SANS Institute November 2006  –  December 2009  (3 years 2 months) The first to bring the SANS trainings to Brazil during a Hackers to Hackers Conference (H2HC) I'm authorized to give the Cutting Edge Hacking Techniques, the Mastering Packet Analysis and the Exploitation classes. SANS Instructor Brazil SANS Institute November 2006  –  December 2009  (3 years 2 months) The first to bring the SANS trainings to Brazil during a Hackers to Hackers Conference (H2HC) I'm authorized to give the Cutting Edge Hacking Techniques, the Mastering Packet Analysis and the Exploitation classes. Staff Software Engineer IBM May 2006  –  May 2008  (2 years 1 month) Worked as a software Engineer at IBM, member of the Advanced Linux Response Team (ALRT), part of the IBM Linux Technology Center (IBM/LTC) Brazil also worked in the IBM Toolchain (Debugging) Team for Power Architecture. Staff Software Engineer IBM May 2006  –  May 2008  (2 years 1 month) Worked as a software Engineer at IBM, member of the Advanced Linux Response Team (ALRT), part of the IBM Linux Technology Center (IBM/LTC) Brazil also worked in the IBM Toolchain (Debugging) Team for Power Architecture. Principal Security Researcher Scanit Middle East 2008  –  2008  (less than a year) Lead the vulnerability research initiatives in the company. Principal Security Researcher Scanit Middle East 2008  –  2008  (less than a year) Lead the vulnerability research initiatives in the company. Professor of Operating Systems FGP - Faculdade G&P January 2006  –  July 2006  (7 months) University Professor for the Operating Systems class, focusing on the design of operating systems trying to bring together the academic focus with real-life experience. Professor of Operating Systems FGP - Faculdade G&P January 2006  –  July 2006  (7 months) University Professor for the Operating Systems class, focusing on the design of operating systems trying to bring together the academic focus with real-life experience. Senior Security and OpenSource Analyst MD Systems Networking January 2005  –  May 2006  (1 year 5 months) Act as a leader in solution provide using opensource and with focus on security. The company is small-sized, but one of the main sellers of Citrix in the latin America, with many big customers. Senior Security and OpenSource Analyst MD Systems Networking January 2005  –  May 2006  (1 year 5 months) Act as a leader in solution provide using opensource and with focus on security. The company is small-sized, but one of the main sellers of Citrix in the latin America, with many big customers. Senior Security Analyst Porto Seguro 2005  –  2006  (1 year) Developed solutions to automate security needs, participated in new projects definitions, taking care of the security design. Senior Security Analyst Porto Seguro 2005  –  2006  (1 year) Developed solutions to automate security needs, participated in new projects definitions, taking care of the security design. Security Architect Firewalls Security Corporation 2000  –  2005  (5 years) Firewalls was founded to provide state-of-art security solutions to different customers needs. The idea was to act as an outsourced company for big vendors, achieving the best-in-class solution design without the need of all burocracy of a big company. \n \nIn the company I acted as the design and code of the custom-made solutions for many different customers. As the owner/founder I also had the opportunity to deal with many aspects of the business and grown in experience in understand the challenges behind a company. Security Architect Firewalls Security Corporation 2000  –  2005  (5 years) Firewalls was founded to provide state-of-art security solutions to different customers needs. The idea was to act as an outsourced company for big vendors, achieving the best-in-class solution design without the need of all burocracy of a big company. \n \nIn the company I acted as the design and code of the custom-made solutions for many different customers. As the owner/founder I also had the opportunity to deal with many aspects of the business and grown in experience in understand the challenges behind a company. External Consultant SCUA January 2002  –  November 2004  (2 years 11 months) - Helped in the new infra-structure of the SCUA Suite which provides Windows Desktop Security  \n- Developed a Linux PoC of the SCUA Suite for a big RFP in the Brazilian Government \n- Participated in Security Consultancy engagements in SCUA customers External Consultant SCUA January 2002  –  November 2004  (2 years 11 months) - Helped in the new infra-structure of the SCUA Suite which provides Windows Desktop Security  \n- Developed a Linux PoC of the SCUA Suite for a big RFP in the Brazilian Government \n- Participated in Security Consultancy engagements in SCUA customers External Consultant Cyclades January 2002  –  January 2004  (2 years 1 month) Acted as an external consultant in Cyclades Brazil, giving trainings to partners and to support employees about the company equipaments and network in general. \n \nAlso, helped the development team in questions regarding Linux. External Consultant Cyclades January 2002  –  January 2004  (2 years 1 month) Acted as an external consultant in Cyclades Brazil, giving trainings to partners and to support employees about the company equipaments and network in general. \n \nAlso, helped the development team in questions regarding Linux. Sr. Security and OpenSource Researcher Stationet July 1998  –  January 2000  (1 year 7 months) Acted in many different aspects of a new company starting to offer Linux and Security services.  \n \nTeacher in the trainings, consultant to many different companies and developer of internal tools to automation of the services. Sr. Security and OpenSource Researcher Stationet July 1998  –  January 2000  (1 year 7 months) Acted in many different aspects of a new company starting to offer Linux and Security services.  \n \nTeacher in the trainings, consultant to many different companies and developer of internal tools to automation of the services. Languages English Professional working proficiency Portuguese Native or bilingual proficiency Spanish Limited working proficiency Italian Elementary proficiency English Professional working proficiency Portuguese Native or bilingual proficiency Spanish Limited working proficiency Italian Elementary proficiency English Professional working proficiency Portuguese Native or bilingual proficiency Spanish Limited working proficiency Italian Elementary proficiency Professional working proficiency Native or bilingual proficiency Limited working proficiency Elementary proficiency Skills Software Exploitation Vulnerability Research Malware Research Malware Analysis Operating System... Security Computer Security Linux Software Operating Systems Information Security... Network Security Information Security Firewalls Penetration Testing Intrusion Detection Exploitation Public Speaking Security Research Computer Forensics Reverse Engineering Security Audits Training Delivery Apache Unix Checkpoint Servers Vulnerability Assessment Open Source IDS Networking Security Architecture... PCI DSS Application Security Software Engineering Cryptography CEH Web Application Security Vulnerability Management Security Policy Internet Security IPS CISSP TCP/IP Security Awareness ISO 27001 Encryption Cloud Security Vulnerability Data Security See 35+     See less Skills  Software Exploitation Vulnerability Research Malware Research Malware Analysis Operating System... Security Computer Security Linux Software Operating Systems Information Security... Network Security Information Security Firewalls Penetration Testing Intrusion Detection Exploitation Public Speaking Security Research Computer Forensics Reverse Engineering Security Audits Training Delivery Apache Unix Checkpoint Servers Vulnerability Assessment Open Source IDS Networking Security Architecture... PCI DSS Application Security Software Engineering Cryptography CEH Web Application Security Vulnerability Management Security Policy Internet Security IPS CISSP TCP/IP Security Awareness ISO 27001 Encryption Cloud Security Vulnerability Data Security See 35+     See less Software Exploitation Vulnerability Research Malware Research Malware Analysis Operating System... Security Computer Security Linux Software Operating Systems Information Security... Network Security Information Security Firewalls Penetration Testing Intrusion Detection Exploitation Public Speaking Security Research Computer Forensics Reverse Engineering Security Audits Training Delivery Apache Unix Checkpoint Servers Vulnerability Assessment Open Source IDS Networking Security Architecture... PCI DSS Application Security Software Engineering Cryptography CEH Web Application Security Vulnerability Management Security Policy Internet Security IPS CISSP TCP/IP Security Awareness ISO 27001 Encryption Cloud Security Vulnerability Data Security See 35+     See less Software Exploitation Vulnerability Research Malware Research Malware Analysis Operating System... Security Computer Security Linux Software Operating Systems Information Security... Network Security Information Security Firewalls Penetration Testing Intrusion Detection Exploitation Public Speaking Security Research Computer Forensics Reverse Engineering Security Audits Training Delivery Apache Unix Checkpoint Servers Vulnerability Assessment Open Source IDS Networking Security Architecture... PCI DSS Application Security Software Engineering Cryptography CEH Web Application Security Vulnerability Management Security Policy Internet Security IPS CISSP TCP/IP Security Awareness ISO 27001 Encryption Cloud Security Vulnerability Data Security See 35+     See less Education Instituto Tecnologico da Aeronautica - ITA Master,  Computer Engineering 2006  – 2008 Activities and Societies:  - Give many classes about computer security ,  software exploitation and linux kernel internals\n- Participating in two important projects for the .br gov:\n* Auditing an important .gov system\n* Developing an embedded linux system ,  with different levels of protections ,  including hardware tamper-proof and others to be the brazilian root CA in the PKI system Instituto Tecnologico da Aeronautica - ITA Specialization,  Computer Security 2006  – 2007 FGP BS,  Computer Security 2001  – 2005 Universidade Estadual Paulista Júlio de Mesquita Filho Technical,  IT 1998  – 2000 Colégio São José High School 1991  – 1998 Oregon State University Instituto Tecnologico da Aeronautica - ITA Master,  Computer Engineering 2006  – 2008 Activities and Societies:  - Give many classes about computer security ,  software exploitation and linux kernel internals\n- Participating in two important projects for the .br gov:\n* Auditing an important .gov system\n* Developing an embedded linux system ,  with different levels of protections ,  including hardware tamper-proof and others to be the brazilian root CA in the PKI system Instituto Tecnologico da Aeronautica - ITA Master,  Computer Engineering 2006  – 2008 Activities and Societies:  - Give many classes about computer security ,  software exploitation and linux kernel internals\n- Participating in two important projects for the .br gov:\n* Auditing an important .gov system\n* Developing an embedded linux system ,  with different levels of protections ,  including hardware tamper-proof and others to be the brazilian root CA in the PKI system Instituto Tecnologico da Aeronautica - ITA Master,  Computer Engineering 2006  – 2008 Activities and Societies:  - Give many classes about computer security ,  software exploitation and linux kernel internals\n- Participating in two important projects for the .br gov:\n* Auditing an important .gov system\n* Developing an embedded linux system ,  with different levels of protections ,  including hardware tamper-proof and others to be the brazilian root CA in the PKI system Instituto Tecnologico da Aeronautica - ITA Specialization,  Computer Security 2006  – 2007 Instituto Tecnologico da Aeronautica - ITA Specialization,  Computer Security 2006  – 2007 Instituto Tecnologico da Aeronautica - ITA Specialization,  Computer Security 2006  – 2007 FGP BS,  Computer Security 2001  – 2005 FGP BS,  Computer Security 2001  – 2005 FGP BS,  Computer Security 2001  – 2005 Universidade Estadual Paulista Júlio de Mesquita Filho Technical,  IT 1998  – 2000 Universidade Estadual Paulista Júlio de Mesquita Filho Technical,  IT 1998  – 2000 Universidade Estadual Paulista Júlio de Mesquita Filho Technical,  IT 1998  – 2000 Colégio São José High School 1991  – 1998 Colégio São José High School 1991  – 1998 Colégio São José High School 1991  – 1998 Oregon State University Oregon State University Oregon State University Honors & Awards Additional Honors & Awards - Best student in the University - 2001  \n- Security Professional Honors (SecMasters 2006) - one of the three best contributors to market expansion in Brazil - started the SANS Trainings in Brazil Additional Honors & Awards - Best student in the University - 2001  \n- Security Professional Honors (SecMasters 2006) - one of the three best contributors to market expansion in Brazil - started the SANS Trainings in Brazil Additional Honors & Awards - Best student in the University - 2001  \n- Security Professional Honors (SecMasters 2006) - one of the three best contributors to market expansion in Brazil - started the SANS Trainings in Brazil Additional Honors & Awards - Best student in the University - 2001  \n- Security Professional Honors (SecMasters 2006) - one of the three best contributors to market expansion in Brazil - started the SANS Trainings in Brazil ", "Experience Security Researcher Intel Corporation August 2004  – Present (11 years 1 month) Portland, Oregon Area Security Researcher Intel Corporation August 2004  – Present (11 years 1 month) Portland, Oregon Area Security Researcher Intel Corporation August 2004  – Present (11 years 1 month) Portland, Oregon Area ", "Summary •\t8+ years of demonstrable history of advocating and delivering security assurance. \n•\tPassion to research, drive, and develop new security analysis methodologies and tools for successful security evaluations. \n•\tSubject matter expertise in security, cryptography,and privacy. \n•\tDeveloped and taught trainings in design for security, secure coding practices, hardware security, fuzzing, and penetration testing.  \n•\tPublished technical papers in various conferences both inside and outside of Intel on security evaluation, vulnerabilities, methodologies, and processes. Summary •\t8+ years of demonstrable history of advocating and delivering security assurance. \n•\tPassion to research, drive, and develop new security analysis methodologies and tools for successful security evaluations. \n•\tSubject matter expertise in security, cryptography,and privacy. \n•\tDeveloped and taught trainings in design for security, secure coding practices, hardware security, fuzzing, and penetration testing.  \n•\tPublished technical papers in various conferences both inside and outside of Intel on security evaluation, vulnerabilities, methodologies, and processes. •\t8+ years of demonstrable history of advocating and delivering security assurance. \n•\tPassion to research, drive, and develop new security analysis methodologies and tools for successful security evaluations. \n•\tSubject matter expertise in security, cryptography,and privacy. \n•\tDeveloped and taught trainings in design for security, secure coding practices, hardware security, fuzzing, and penetration testing.  \n•\tPublished technical papers in various conferences both inside and outside of Intel on security evaluation, vulnerabilities, methodologies, and processes. •\t8+ years of demonstrable history of advocating and delivering security assurance. \n•\tPassion to research, drive, and develop new security analysis methodologies and tools for successful security evaluations. \n•\tSubject matter expertise in security, cryptography,and privacy. \n•\tDeveloped and taught trainings in design for security, secure coding practices, hardware security, fuzzing, and penetration testing.  \n•\tPublished technical papers in various conferences both inside and outside of Intel on security evaluation, vulnerabilities, methodologies, and processes. Experience Principal Security Researcher Intel Corporation April 2015  – Present (5 months) Hillsboro, OR Lead Security Researcher Intel Corporation June 2013  –  March 2015  (1 year 10 months) HIllsboro, OR Lead security evaluation of Intel IPs (the basic building blocks) that go in Client, Server, and mobile products \nLead a team of 8 engineers in planning, prioritization and scoping of security evaluations \nProvide strategic decisions on the cutting the edge security evaluations methodologies Senior Security Researcher Intel Corporation June 2011  –  May 2013  (2 years) Hillsboro, OR Lead Security evaluation of Intel CPUs and Chipset \nLead a team of 4 engineers to drive and deliver security assurance for Intel Technologies \nDevelop trainings, best known methods, tools in security evaluation and methodologies Software Engineer Intel Corporation February 2006  –  May 2011  (5 years 4 months) HIllsboro, OR •\tLead security evaluations at Intel as regards to hardware, firmware and software \n•\tDeveloped processes, tools and methodologies on security assurance \n•\tHands on experience in threat modeling, risk assessment, vulnerability analysis, secure code reviews, fuzzing, and penetration testing. Research Assistant North Dakota State University September 2002  –  December 2005  (3 years 4 months) Fargo, North Dakota Area Research cryptographic hardware, crypt analysis of authentication protocols, design 8051 based systems for sensors, board and circuit design for sensors. Principal Security Researcher Intel Corporation April 2015  – Present (5 months) Hillsboro, OR Principal Security Researcher Intel Corporation April 2015  – Present (5 months) Hillsboro, OR Lead Security Researcher Intel Corporation June 2013  –  March 2015  (1 year 10 months) HIllsboro, OR Lead security evaluation of Intel IPs (the basic building blocks) that go in Client, Server, and mobile products \nLead a team of 8 engineers in planning, prioritization and scoping of security evaluations \nProvide strategic decisions on the cutting the edge security evaluations methodologies Lead Security Researcher Intel Corporation June 2013  –  March 2015  (1 year 10 months) HIllsboro, OR Lead security evaluation of Intel IPs (the basic building blocks) that go in Client, Server, and mobile products \nLead a team of 8 engineers in planning, prioritization and scoping of security evaluations \nProvide strategic decisions on the cutting the edge security evaluations methodologies Senior Security Researcher Intel Corporation June 2011  –  May 2013  (2 years) Hillsboro, OR Lead Security evaluation of Intel CPUs and Chipset \nLead a team of 4 engineers to drive and deliver security assurance for Intel Technologies \nDevelop trainings, best known methods, tools in security evaluation and methodologies Senior Security Researcher Intel Corporation June 2011  –  May 2013  (2 years) Hillsboro, OR Lead Security evaluation of Intel CPUs and Chipset \nLead a team of 4 engineers to drive and deliver security assurance for Intel Technologies \nDevelop trainings, best known methods, tools in security evaluation and methodologies Software Engineer Intel Corporation February 2006  –  May 2011  (5 years 4 months) HIllsboro, OR •\tLead security evaluations at Intel as regards to hardware, firmware and software \n•\tDeveloped processes, tools and methodologies on security assurance \n•\tHands on experience in threat modeling, risk assessment, vulnerability analysis, secure code reviews, fuzzing, and penetration testing. Software Engineer Intel Corporation February 2006  –  May 2011  (5 years 4 months) HIllsboro, OR •\tLead security evaluations at Intel as regards to hardware, firmware and software \n•\tDeveloped processes, tools and methodologies on security assurance \n•\tHands on experience in threat modeling, risk assessment, vulnerability analysis, secure code reviews, fuzzing, and penetration testing. Research Assistant North Dakota State University September 2002  –  December 2005  (3 years 4 months) Fargo, North Dakota Area Research cryptographic hardware, crypt analysis of authentication protocols, design 8051 based systems for sensors, board and circuit design for sensors. Research Assistant North Dakota State University September 2002  –  December 2005  (3 years 4 months) Fargo, North Dakota Area Research cryptographic hardware, crypt analysis of authentication protocols, design 8051 based systems for sensors, board and circuit design for sensors. Languages English Full professional proficiency Telugu Native or bilingual proficiency HIndi Native or bilingual proficiency English Full professional proficiency Telugu Native or bilingual proficiency HIndi Native or bilingual proficiency English Full professional proficiency Telugu Native or bilingual proficiency HIndi Native or bilingual proficiency Full professional proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Hardware Network Security Computer Security Embedded Systems C C++ Electronics Automation Testing Microcontrollers Troubleshooting Electrical Engineering Programming Matlab Computer Architecture Penetration Testing TCP/IP Security Cryptography Verilog Firmware Linux Perl Debugging Computer Science VHDL Software Development Unix Windows FPGA Operating Systems Information Security Python Software Engineering Program Management Assembly Language See 21+     See less Skills  Hardware Network Security Computer Security Embedded Systems C C++ Electronics Automation Testing Microcontrollers Troubleshooting Electrical Engineering Programming Matlab Computer Architecture Penetration Testing TCP/IP Security Cryptography Verilog Firmware Linux Perl Debugging Computer Science VHDL Software Development Unix Windows FPGA Operating Systems Information Security Python Software Engineering Program Management Assembly Language See 21+     See less Hardware Network Security Computer Security Embedded Systems C C++ Electronics Automation Testing Microcontrollers Troubleshooting Electrical Engineering Programming Matlab Computer Architecture Penetration Testing TCP/IP Security Cryptography Verilog Firmware Linux Perl Debugging Computer Science VHDL Software Development Unix Windows FPGA Operating Systems Information Security Python Software Engineering Program Management Assembly Language See 21+     See less Hardware Network Security Computer Security Embedded Systems C C++ Electronics Automation Testing Microcontrollers Troubleshooting Electrical Engineering Programming Matlab Computer Architecture Penetration Testing TCP/IP Security Cryptography Verilog Firmware Linux Perl Debugging Computer Science VHDL Software Development Unix Windows FPGA Operating Systems Information Security Python Software Engineering Program Management Assembly Language See 21+     See less Education North Dakota State University Phd,  Electrical and Computer Engineering , 3.8 out of 4.0 GPA 2002  – 2006 Obtained my Phd in Electrical and Computer Engineering from North Dakota State University. South Dakota School of Mines and Technology MS,  Electrical and Computer Engineering , 3.96 out of 4.0 GPA 2001  – 2002 Obtained my Masters in Electrical and Computer Engineering from South Dakota School of Mines and Technology. The Institution of Engineers (India) (IEI) Bachelor's Degree,  Electrical Engineering , 70% 1995  – 2000 Obtained my Bachelor's Degree in Electrical Engineering Government Polytechnic College Diploma in Electrical and Electronics Enginering,  Electrical and Electronics Enginering , 84% 1990  – 1994 Obtained my Diploma in Electrical and Electronics Engineering. Kotak Salesian School High School,  High School Equivalence Certificate Program 1985  – 1990 My secondary and high school is from Kotak Salesian School. North Dakota State University Phd,  Electrical and Computer Engineering , 3.8 out of 4.0 GPA 2002  – 2006 Obtained my Phd in Electrical and Computer Engineering from North Dakota State University. North Dakota State University Phd,  Electrical and Computer Engineering , 3.8 out of 4.0 GPA 2002  – 2006 Obtained my Phd in Electrical and Computer Engineering from North Dakota State University. North Dakota State University Phd,  Electrical and Computer Engineering , 3.8 out of 4.0 GPA 2002  – 2006 Obtained my Phd in Electrical and Computer Engineering from North Dakota State University. South Dakota School of Mines and Technology MS,  Electrical and Computer Engineering , 3.96 out of 4.0 GPA 2001  – 2002 Obtained my Masters in Electrical and Computer Engineering from South Dakota School of Mines and Technology. South Dakota School of Mines and Technology MS,  Electrical and Computer Engineering , 3.96 out of 4.0 GPA 2001  – 2002 Obtained my Masters in Electrical and Computer Engineering from South Dakota School of Mines and Technology. South Dakota School of Mines and Technology MS,  Electrical and Computer Engineering , 3.96 out of 4.0 GPA 2001  – 2002 Obtained my Masters in Electrical and Computer Engineering from South Dakota School of Mines and Technology. The Institution of Engineers (India) (IEI) Bachelor's Degree,  Electrical Engineering , 70% 1995  – 2000 Obtained my Bachelor's Degree in Electrical Engineering The Institution of Engineers (India) (IEI) Bachelor's Degree,  Electrical Engineering , 70% 1995  – 2000 Obtained my Bachelor's Degree in Electrical Engineering The Institution of Engineers (India) (IEI) Bachelor's Degree,  Electrical Engineering , 70% 1995  – 2000 Obtained my Bachelor's Degree in Electrical Engineering Government Polytechnic College Diploma in Electrical and Electronics Enginering,  Electrical and Electronics Enginering , 84% 1990  – 1994 Obtained my Diploma in Electrical and Electronics Engineering. Government Polytechnic College Diploma in Electrical and Electronics Enginering,  Electrical and Electronics Enginering , 84% 1990  – 1994 Obtained my Diploma in Electrical and Electronics Engineering. Government Polytechnic College Diploma in Electrical and Electronics Enginering,  Electrical and Electronics Enginering , 84% 1990  – 1994 Obtained my Diploma in Electrical and Electronics Engineering. Kotak Salesian School High School,  High School Equivalence Certificate Program 1985  – 1990 My secondary and high school is from Kotak Salesian School. Kotak Salesian School High School,  High School Equivalence Certificate Program 1985  – 1990 My secondary and high school is from Kotak Salesian School. Kotak Salesian School High School,  High School Equivalence Certificate Program 1985  – 1990 My secondary and high school is from Kotak Salesian School. ", "Experience Senior Security Researcher Intel Corporation June 2014  – Present (1 year 3 months) Hillsboro, OR, USA Conference Session Co-Chair IEEE Aerospace Conference 2010  – Present (5 years) Big Sky, MT, USA Researcher SpaceSystemsSecurity.org May 2014  – Present (1 year 4 months) Senior Security Researcher Intel Corporation June 2014  – Present (1 year 3 months) Hillsboro, OR, USA Senior Security Researcher Intel Corporation June 2014  – Present (1 year 3 months) Hillsboro, OR, USA Conference Session Co-Chair IEEE Aerospace Conference 2010  – Present (5 years) Big Sky, MT, USA Conference Session Co-Chair IEEE Aerospace Conference 2010  – Present (5 years) Big Sky, MT, USA Researcher SpaceSystemsSecurity.org May 2014  – Present (1 year 4 months) Researcher SpaceSystemsSecurity.org May 2014  – Present (1 year 4 months) Languages   Skills Embedded Systems Computer Science Programming LaTeX Cryptography C C++ VHDL Linux Embedded Software Distributed Systems Matlab Software Development FPGA Network Security Java Computer Security Project Management Testing Computer Engineering Applied Research Space Systems Automotive Systems Hardware Development Microprocessors Operating Systems Device Drivers Hardware Description... Human Machine Interface Verilog Assembly Language Maple Computer Architecture See 18+     See less Skills  Embedded Systems Computer Science Programming LaTeX Cryptography C C++ VHDL Linux Embedded Software Distributed Systems Matlab Software Development FPGA Network Security Java Computer Security Project Management Testing Computer Engineering Applied Research Space Systems Automotive Systems Hardware Development Microprocessors Operating Systems Device Drivers Hardware Description... Human Machine Interface Verilog Assembly Language Maple Computer Architecture See 18+     See less Embedded Systems Computer Science Programming LaTeX Cryptography C C++ VHDL Linux Embedded Software Distributed Systems Matlab Software Development FPGA Network Security Java Computer Security Project Management Testing Computer Engineering Applied Research Space Systems Automotive Systems Hardware Development Microprocessors Operating Systems Device Drivers Hardware Description... Human Machine Interface Verilog Assembly Language Maple Computer Architecture See 18+     See less Embedded Systems Computer Science Programming LaTeX Cryptography C C++ VHDL Linux Embedded Software Distributed Systems Matlab Software Development FPGA Network Security Java Computer Security Project Management Testing Computer Engineering Applied Research Space Systems Automotive Systems Hardware Development Microprocessors Operating Systems Device Drivers Hardware Description... Human Machine Interface Verilog Assembly Language Maple Computer Architecture See 18+     See less Education University of Waterloo and European Space Agency Postdoc,  Space Systems Security 2011  – 2014 University of Waterloo PhD,  Computer Engineering 2006  – 2010 University of Campinas MSc,  Computer Science 2004  – 2006 Universität Duisburg-Essen, Standort Essen Deutschlandkundlicher Winterkurs 2003  – 2003 University of Campinas BSc,  Computer Engineering 1999  – 2003 University of Waterloo and European Space Agency Postdoc,  Space Systems Security 2011  – 2014 University of Waterloo and European Space Agency Postdoc,  Space Systems Security 2011  – 2014 University of Waterloo and European Space Agency Postdoc,  Space Systems Security 2011  – 2014 University of Waterloo PhD,  Computer Engineering 2006  – 2010 University of Waterloo PhD,  Computer Engineering 2006  – 2010 University of Waterloo PhD,  Computer Engineering 2006  – 2010 University of Campinas MSc,  Computer Science 2004  – 2006 University of Campinas MSc,  Computer Science 2004  – 2006 University of Campinas MSc,  Computer Science 2004  – 2006 Universität Duisburg-Essen, Standort Essen Deutschlandkundlicher Winterkurs 2003  – 2003 Universität Duisburg-Essen, Standort Essen Deutschlandkundlicher Winterkurs 2003  – 2003 Universität Duisburg-Essen, Standort Essen Deutschlandkundlicher Winterkurs 2003  – 2003 University of Campinas BSc,  Computer Engineering 1999  – 2003 University of Campinas BSc,  Computer Engineering 1999  – 2003 University of Campinas BSc,  Computer Engineering 1999  – 2003 Honors & Awards ", "Skills Information Security Security Information Security... Software Design Skills  Information Security Security Information Security... Software Design Information Security Security Information Security... Software Design Information Security Security Information Security... Software Design ", "Summary Alexander Matrosov has more than ten years of experience in malware analysis, reverse engineering and advanced exploitation techniques. Currently holds a Senior Security Researcher position in the Advanced Threat Research team at Intel. Over the previous four years he focused on advanced malware research at ESET. He is co-author of numerous research papers, including 'Stuxnet Under the Microscope', 'The Evolution of TDL: Conquering x64' and 'Mind the Gapz: The most complex bootkit ever analyzed?'. He is frequently invited to speak at security conferences such as REcon, Ekoparty, Zeronights, AVAR, CARO and Virus Bulletin. Nowadays he specializes in the comprehensive analysis of complex threats, modern vectors of exploitation and hardware security research. Summary Alexander Matrosov has more than ten years of experience in malware analysis, reverse engineering and advanced exploitation techniques. Currently holds a Senior Security Researcher position in the Advanced Threat Research team at Intel. Over the previous four years he focused on advanced malware research at ESET. He is co-author of numerous research papers, including 'Stuxnet Under the Microscope', 'The Evolution of TDL: Conquering x64' and 'Mind the Gapz: The most complex bootkit ever analyzed?'. He is frequently invited to speak at security conferences such as REcon, Ekoparty, Zeronights, AVAR, CARO and Virus Bulletin. Nowadays he specializes in the comprehensive analysis of complex threats, modern vectors of exploitation and hardware security research. Alexander Matrosov has more than ten years of experience in malware analysis, reverse engineering and advanced exploitation techniques. Currently holds a Senior Security Researcher position in the Advanced Threat Research team at Intel. Over the previous four years he focused on advanced malware research at ESET. He is co-author of numerous research papers, including 'Stuxnet Under the Microscope', 'The Evolution of TDL: Conquering x64' and 'Mind the Gapz: The most complex bootkit ever analyzed?'. He is frequently invited to speak at security conferences such as REcon, Ekoparty, Zeronights, AVAR, CARO and Virus Bulletin. Nowadays he specializes in the comprehensive analysis of complex threats, modern vectors of exploitation and hardware security research. Alexander Matrosov has more than ten years of experience in malware analysis, reverse engineering and advanced exploitation techniques. Currently holds a Senior Security Researcher position in the Advanced Threat Research team at Intel. Over the previous four years he focused on advanced malware research at ESET. He is co-author of numerous research papers, including 'Stuxnet Under the Microscope', 'The Evolution of TDL: Conquering x64' and 'Mind the Gapz: The most complex bootkit ever analyzed?'. He is frequently invited to speak at security conferences such as REcon, Ekoparty, Zeronights, AVAR, CARO and Virus Bulletin. Nowadays he specializes in the comprehensive analysis of complex threats, modern vectors of exploitation and hardware security research. Experience Senior Security REsearcher Intel Corporation December 2013  – Present (1 year 9 months) Portland, Oregon Area Member of Advanced Threat Research team (http://www.intelsecurity.com/advanced-threat-research/index.html) in the office of Secure Platform and Solutions CTO, Intel Security Group Program committee member ZeroNights Security Conference June 2011  – Present (4 years 3 months) Moscow, Russian Federation http://2013.zeronights.org/comitee Writer at Hacker magazine Gameland November 2010  – Present (4 years 10 months) * Contributer Founder 100% Virus Free Podcast February 2010  – Present (5 years 7 months) Moscow, Russian Federation The first Russian podcast about security research from researchers to researchers. Security Intelligence Team Lead ESET December 2011  –  December 2013  (2 years 1 month) Moscow, Russian Federation Senior Malware Researcher ESET November 2010  –  December 2013  (3 years 2 months) Senior Lecturer National Research Nuclear University MEPhI September 2007  –  December 2012  (5 years 4 months) Moscow, Russian Federation author of course about software protection and reverse engineering Senior virus researcher ESET Russia October 2009  –  January 2011  (1 year 4 months) Senior malware researcher Doctor Web, Ltd. May 2009  –  October 2009  (6 months) - Malware Analysis \n- Threat Intelligence Senior security researcher (search systems department) Yandex September 2008  –  April 2009  (8 months) Investigation of IT-incidents and computer crimes. Penetration testing web-services. Reverse engineering malware. Researching new malware technology (eg. packer, obfuscation, platform, etc). Head of Research (.NET/JVM department) AKTIV October 2005  –  August 2008  (2 years 11 months) Moscow, Russian Federation Senior Security REsearcher Intel Corporation December 2013  – Present (1 year 9 months) Portland, Oregon Area Member of Advanced Threat Research team (http://www.intelsecurity.com/advanced-threat-research/index.html) in the office of Secure Platform and Solutions CTO, Intel Security Group Senior Security REsearcher Intel Corporation December 2013  – Present (1 year 9 months) Portland, Oregon Area Member of Advanced Threat Research team (http://www.intelsecurity.com/advanced-threat-research/index.html) in the office of Secure Platform and Solutions CTO, Intel Security Group Program committee member ZeroNights Security Conference June 2011  – Present (4 years 3 months) Moscow, Russian Federation http://2013.zeronights.org/comitee Program committee member ZeroNights Security Conference June 2011  – Present (4 years 3 months) Moscow, Russian Federation http://2013.zeronights.org/comitee Writer at Hacker magazine Gameland November 2010  – Present (4 years 10 months) * Contributer Writer at Hacker magazine Gameland November 2010  – Present (4 years 10 months) * Contributer Founder 100% Virus Free Podcast February 2010  – Present (5 years 7 months) Moscow, Russian Federation The first Russian podcast about security research from researchers to researchers. Founder 100% Virus Free Podcast February 2010  – Present (5 years 7 months) Moscow, Russian Federation The first Russian podcast about security research from researchers to researchers. Security Intelligence Team Lead ESET December 2011  –  December 2013  (2 years 1 month) Moscow, Russian Federation Security Intelligence Team Lead ESET December 2011  –  December 2013  (2 years 1 month) Moscow, Russian Federation Senior Malware Researcher ESET November 2010  –  December 2013  (3 years 2 months) Senior Malware Researcher ESET November 2010  –  December 2013  (3 years 2 months) Senior Lecturer National Research Nuclear University MEPhI September 2007  –  December 2012  (5 years 4 months) Moscow, Russian Federation author of course about software protection and reverse engineering Senior Lecturer National Research Nuclear University MEPhI September 2007  –  December 2012  (5 years 4 months) Moscow, Russian Federation author of course about software protection and reverse engineering Senior virus researcher ESET Russia October 2009  –  January 2011  (1 year 4 months) Senior virus researcher ESET Russia October 2009  –  January 2011  (1 year 4 months) Senior malware researcher Doctor Web, Ltd. May 2009  –  October 2009  (6 months) - Malware Analysis \n- Threat Intelligence Senior malware researcher Doctor Web, Ltd. May 2009  –  October 2009  (6 months) - Malware Analysis \n- Threat Intelligence Senior security researcher (search systems department) Yandex September 2008  –  April 2009  (8 months) Investigation of IT-incidents and computer crimes. Penetration testing web-services. Reverse engineering malware. Researching new malware technology (eg. packer, obfuscation, platform, etc). Senior security researcher (search systems department) Yandex September 2008  –  April 2009  (8 months) Investigation of IT-incidents and computer crimes. Penetration testing web-services. Reverse engineering malware. Researching new malware technology (eg. packer, obfuscation, platform, etc). Head of Research (.NET/JVM department) AKTIV October 2005  –  August 2008  (2 years 11 months) Moscow, Russian Federation Head of Research (.NET/JVM department) AKTIV October 2005  –  August 2008  (2 years 11 months) Moscow, Russian Federation Skills Reverse Engineering Malware Analysis Reversing Automation Rootkits/Bootkits... Vulnerability Assessment Cryptography Security Research Threat Intelligence Automation Skills  Reverse Engineering Malware Analysis Reversing Automation Rootkits/Bootkits... Vulnerability Assessment Cryptography Security Research Threat Intelligence Automation Reverse Engineering Malware Analysis Reversing Automation Rootkits/Bootkits... Vulnerability Assessment Cryptography Security Research Threat Intelligence Automation Reverse Engineering Malware Analysis Reversing Automation Rootkits/Bootkits... Vulnerability Assessment Cryptography Security Research Threat Intelligence Automation Education National Nuclear Research University \"MEPHI\" PhD (not finished yet),  Information Security 2007  – 2010 National Nuclear Research University \"MEPHI\" Master's degree,  Information Security 2001  – 2007 Diploma project: Real-time system for detecting malicious activity in the network traffic Moscow College of Management and New Technologies Bachelor's degree,  Electronics 1997  – 2001 Diploma project: The system for control sensors in the aircraft. National Nuclear Research University \"MEPHI\" PhD (not finished yet),  Information Security 2007  – 2010 National Nuclear Research University \"MEPHI\" PhD (not finished yet),  Information Security 2007  – 2010 National Nuclear Research University \"MEPHI\" PhD (not finished yet),  Information Security 2007  – 2010 National Nuclear Research University \"MEPHI\" Master's degree,  Information Security 2001  – 2007 Diploma project: Real-time system for detecting malicious activity in the network traffic National Nuclear Research University \"MEPHI\" Master's degree,  Information Security 2001  – 2007 Diploma project: Real-time system for detecting malicious activity in the network traffic National Nuclear Research University \"MEPHI\" Master's degree,  Information Security 2001  – 2007 Diploma project: Real-time system for detecting malicious activity in the network traffic Moscow College of Management and New Technologies Bachelor's degree,  Electronics 1997  – 2001 Diploma project: The system for control sensors in the aircraft. Moscow College of Management and New Technologies Bachelor's degree,  Electronics 1997  – 2001 Diploma project: The system for control sensors in the aircraft. Moscow College of Management and New Technologies Bachelor's degree,  Electronics 1997  – 2001 Diploma project: The system for control sensors in the aircraft. Honors & Awards Best Speaker Award AVAR 2012 November 2012 Best Speaker Award AVAR 2012 November 2012 Best Speaker Award AVAR 2012 November 2012 Best Speaker Award AVAR 2012 November 2012 ", "Summary Security researcher with vast programming experience. \n \nSpecialties: Reverse engineering, Security research, Protocol analysis, Fuzzing, Vulnerability assessment, Automatic obfuscation and de-obfuscation, Various hacking and protection techniques, etc \nC++, C, Assembly (x86, arm, MIPS) Python, IDAPython, IDA, Different debuggers, etc \nSolaris and Linux programming (both user and kernel space) \nOS internals (*nix, QNX, Windows and VXWorks) \nOOP, OOD, OOA, Design patterns, UML Summary Security researcher with vast programming experience. \n \nSpecialties: Reverse engineering, Security research, Protocol analysis, Fuzzing, Vulnerability assessment, Automatic obfuscation and de-obfuscation, Various hacking and protection techniques, etc \nC++, C, Assembly (x86, arm, MIPS) Python, IDAPython, IDA, Different debuggers, etc \nSolaris and Linux programming (both user and kernel space) \nOS internals (*nix, QNX, Windows and VXWorks) \nOOP, OOD, OOA, Design patterns, UML Security researcher with vast programming experience. \n \nSpecialties: Reverse engineering, Security research, Protocol analysis, Fuzzing, Vulnerability assessment, Automatic obfuscation and de-obfuscation, Various hacking and protection techniques, etc \nC++, C, Assembly (x86, arm, MIPS) Python, IDAPython, IDA, Different debuggers, etc \nSolaris and Linux programming (both user and kernel space) \nOS internals (*nix, QNX, Windows and VXWorks) \nOOP, OOD, OOA, Design patterns, UML Security researcher with vast programming experience. \n \nSpecialties: Reverse engineering, Security research, Protocol analysis, Fuzzing, Vulnerability assessment, Automatic obfuscation and de-obfuscation, Various hacking and protection techniques, etc \nC++, C, Assembly (x86, arm, MIPS) Python, IDAPython, IDA, Different debuggers, etc \nSolaris and Linux programming (both user and kernel space) \nOS internals (*nix, QNX, Windows and VXWorks) \nOOP, OOD, OOA, Design patterns, UML Experience Security Researcher Intel Corporation June 2015  – Present (3 months) Haifa, Israel Software security analyst Cisco September 2008  –  June 2015  (6 years 10 months) Security evaluation and reverse engineering of various software products running on iOS, Linux, QNX, VxWorks and Windows \nBuilding proof of concept demonstrations and other prototyping \nDesign and development of tools for automatic obfuscation, de-obfuscation, and binary code-analysis \nDesign and development of various research support tools Software engineer Imperva June 2006  –  September 2008  (2 years 4 months) Solaris and Linux system call interception rootkit like kernel module \nSolaris and Linux inter-process communication sniffing driver for database audit purposes \nCross-platform network and IPC traffic sniffing tool porting and maintenance on Solaris, AIX and HP-UX platforms \nOS level research and process filtering engine IDE Project leader EZchip October 1999  –  June 2006  (6 years 9 months) Design and development of IDE for NP family network processor. Software developer Elsop systems June 1995  –  September 1996  (1 year 4 months) Security Researcher Intel Corporation June 2015  – Present (3 months) Haifa, Israel Security Researcher Intel Corporation June 2015  – Present (3 months) Haifa, Israel Software security analyst Cisco September 2008  –  June 2015  (6 years 10 months) Security evaluation and reverse engineering of various software products running on iOS, Linux, QNX, VxWorks and Windows \nBuilding proof of concept demonstrations and other prototyping \nDesign and development of tools for automatic obfuscation, de-obfuscation, and binary code-analysis \nDesign and development of various research support tools Software security analyst Cisco September 2008  –  June 2015  (6 years 10 months) Security evaluation and reverse engineering of various software products running on iOS, Linux, QNX, VxWorks and Windows \nBuilding proof of concept demonstrations and other prototyping \nDesign and development of tools for automatic obfuscation, de-obfuscation, and binary code-analysis \nDesign and development of various research support tools Software engineer Imperva June 2006  –  September 2008  (2 years 4 months) Solaris and Linux system call interception rootkit like kernel module \nSolaris and Linux inter-process communication sniffing driver for database audit purposes \nCross-platform network and IPC traffic sniffing tool porting and maintenance on Solaris, AIX and HP-UX platforms \nOS level research and process filtering engine Software engineer Imperva June 2006  –  September 2008  (2 years 4 months) Solaris and Linux system call interception rootkit like kernel module \nSolaris and Linux inter-process communication sniffing driver for database audit purposes \nCross-platform network and IPC traffic sniffing tool porting and maintenance on Solaris, AIX and HP-UX platforms \nOS level research and process filtering engine IDE Project leader EZchip October 1999  –  June 2006  (6 years 9 months) Design and development of IDE for NP family network processor. IDE Project leader EZchip October 1999  –  June 2006  (6 years 9 months) Design and development of IDE for NP family network processor. Software developer Elsop systems June 1995  –  September 1996  (1 year 4 months) Software developer Elsop systems June 1995  –  September 1996  (1 year 4 months) Languages Russian Native or bilingual proficiency English Professional working proficiency Hebrew Professional working proficiency Russian Native or bilingual proficiency English Professional working proficiency Hebrew Professional working proficiency Russian Native or bilingual proficiency English Professional working proficiency Hebrew Professional working proficiency Native or bilingual proficiency Professional working proficiency Professional working proficiency Skills Reverse Engineering Security Research Fuzzing Protocol Analysis C C++ IDA Python Kernel Programming Debuggers IDE Linux Unix x86 Assembly MIPS ARM Object Oriented Design OOP Design Patterns UML Multithreading Debugging Computer Security Device Drivers System Architecture Algorithms Software Engineering Solaris Win32 API VxWorks Programming Operating Systems Embedded Systems Security Linux Kernel TCP/IP Distributed Systems Software Design Embedded Software Bash Software Development See 26+     See less Skills  Reverse Engineering Security Research Fuzzing Protocol Analysis C C++ IDA Python Kernel Programming Debuggers IDE Linux Unix x86 Assembly MIPS ARM Object Oriented Design OOP Design Patterns UML Multithreading Debugging Computer Security Device Drivers System Architecture Algorithms Software Engineering Solaris Win32 API VxWorks Programming Operating Systems Embedded Systems Security Linux Kernel TCP/IP Distributed Systems Software Design Embedded Software Bash Software Development See 26+     See less Reverse Engineering Security Research Fuzzing Protocol Analysis C C++ IDA Python Kernel Programming Debuggers IDE Linux Unix x86 Assembly MIPS ARM Object Oriented Design OOP Design Patterns UML Multithreading Debugging Computer Security Device Drivers System Architecture Algorithms Software Engineering Solaris Win32 API VxWorks Programming Operating Systems Embedded Systems Security Linux Kernel TCP/IP Distributed Systems Software Design Embedded Software Bash Software Development See 26+     See less Reverse Engineering Security Research Fuzzing Protocol Analysis C C++ IDA Python Kernel Programming Debuggers IDE Linux Unix x86 Assembly MIPS ARM Object Oriented Design OOP Design Patterns UML Multithreading Debugging Computer Security Device Drivers System Architecture Algorithms Software Engineering Solaris Win32 API VxWorks Programming Operating Systems Embedded Systems Security Linux Kernel TCP/IP Distributed Systems Software Design Embedded Software Bash Software Development See 26+     See less Education Magnitogorsk State Technical University named after G.I. Nosov (MSTU)  Unfinished,  Computer science 1992  – 1994 (University formerly known as Magnitogorsk institute of Mining and metallurgy) Magnitogorsk State Technical University named after G.I. Nosov (MSTU)  Unfinished,  Computer science 1992  – 1994 (University formerly known as Magnitogorsk institute of Mining and metallurgy) Magnitogorsk State Technical University named after G.I. Nosov (MSTU)  Unfinished,  Computer science 1992  – 1994 (University formerly known as Magnitogorsk institute of Mining and metallurgy) Magnitogorsk State Technical University named after G.I. Nosov (MSTU)  Unfinished,  Computer science 1992  – 1994 (University formerly known as Magnitogorsk institute of Mining and metallurgy) Honors & Awards ", "Experience Security Researcher Intel Corporation August 2015  – Present (1 month) Zapopan Area, Mexico Ethical Hacking and Penetration Testing training ITUniversity MX February 2015  – Present (7 months) Querétaro Area, Mexico Instructor en Diplomado en Ethical Hacking and Penetration Testing. Security Analyst Tata Consultancy Services August 2014  – Present (1 year 1 month) Querétaro Area, Mexico Administración de Symantec Endpoint Protection. Análisis de incidentes de seguridad en QRadar. Security Analyst Produban | Santander February 2014  –  July 2014  (6 months) Querétaro Area, Mexico Creación de reglas para IDS McAfee, monitoreo de consolas Imperva, análisis de malware mediante FireEye, escaneo de vulnerabilidades usando Foundstone e IBM AppScan. Creación de manuales y procedimientos. Análisis de incidentes de seguridad. Web Developer Planet Media January 2014  –  May 2014  (5 months) Querétaro Area, Mexico Desarrollo web usando Javascript, jQuery, soluciones de billing con Recurly. PHP nativo y framework Symfony. Administración de servidores SuSE Linux Enterprise. Administración de servidor Apache. Security Researcher Intel Corporation August 2015  – Present (1 month) Zapopan Area, Mexico Security Researcher Intel Corporation August 2015  – Present (1 month) Zapopan Area, Mexico Ethical Hacking and Penetration Testing training ITUniversity MX February 2015  – Present (7 months) Querétaro Area, Mexico Instructor en Diplomado en Ethical Hacking and Penetration Testing. Ethical Hacking and Penetration Testing training ITUniversity MX February 2015  – Present (7 months) Querétaro Area, Mexico Instructor en Diplomado en Ethical Hacking and Penetration Testing. Security Analyst Tata Consultancy Services August 2014  – Present (1 year 1 month) Querétaro Area, Mexico Administración de Symantec Endpoint Protection. Análisis de incidentes de seguridad en QRadar. Security Analyst Tata Consultancy Services August 2014  – Present (1 year 1 month) Querétaro Area, Mexico Administración de Symantec Endpoint Protection. Análisis de incidentes de seguridad en QRadar. Security Analyst Produban | Santander February 2014  –  July 2014  (6 months) Querétaro Area, Mexico Creación de reglas para IDS McAfee, monitoreo de consolas Imperva, análisis de malware mediante FireEye, escaneo de vulnerabilidades usando Foundstone e IBM AppScan. Creación de manuales y procedimientos. Análisis de incidentes de seguridad. Security Analyst Produban | Santander February 2014  –  July 2014  (6 months) Querétaro Area, Mexico Creación de reglas para IDS McAfee, monitoreo de consolas Imperva, análisis de malware mediante FireEye, escaneo de vulnerabilidades usando Foundstone e IBM AppScan. Creación de manuales y procedimientos. Análisis de incidentes de seguridad. Web Developer Planet Media January 2014  –  May 2014  (5 months) Querétaro Area, Mexico Desarrollo web usando Javascript, jQuery, soluciones de billing con Recurly. PHP nativo y framework Symfony. Administración de servidores SuSE Linux Enterprise. Administración de servidor Apache. Web Developer Planet Media January 2014  –  May 2014  (5 months) Querétaro Area, Mexico Desarrollo web usando Javascript, jQuery, soluciones de billing con Recurly. PHP nativo y framework Symfony. Administración de servidores SuSE Linux Enterprise. Administración de servidor Apache. Languages English Full professional proficiency Spanish Native or bilingual proficiency German Elementary proficiency English Full professional proficiency Spanish Native or bilingual proficiency German Elementary proficiency English Full professional proficiency Spanish Native or bilingual proficiency German Elementary proficiency Full professional proficiency Native or bilingual proficiency Elementary proficiency Skills Web Development Programming Penetration Testing Network Security Information Security... Risk Management Physical Security Mechanical Engineering Computer Security Business Continuity Information Security Vulnerability Assessment Malware Analysis Skills  Web Development Programming Penetration Testing Network Security Information Security... Risk Management Physical Security Mechanical Engineering Computer Security Business Continuity Information Security Vulnerability Assessment Malware Analysis Web Development Programming Penetration Testing Network Security Information Security... Risk Management Physical Security Mechanical Engineering Computer Security Business Continuity Information Security Vulnerability Assessment Malware Analysis Web Development Programming Penetration Testing Network Security Information Security... Risk Management Physical Security Mechanical Engineering Computer Security Business Continuity Information Security Vulnerability Assessment Malware Analysis Education Instituto Politécnico Nacional Maestría en Ingeniería en Seguridad y Tecnologías de la Información,  Computer and Information Systems Security/Information Assurance , Master 2012  – 2014 Detección de ataques distribuidos de denegación de servicio (DDoS) mediante análisis estadístico (control charts). Instituto Politécnico Nacional Master's degree,  Computer and Information Systems Security/Information Assurance 2012  – 2014 Investigación sobre técnicas de detección de ataques DDoS usando métodos estadísticos. ITESCO ITESCO Instituto Politécnico Nacional Maestría en Ingeniería en Seguridad y Tecnologías de la Información,  Computer and Information Systems Security/Information Assurance , Master 2012  – 2014 Detección de ataques distribuidos de denegación de servicio (DDoS) mediante análisis estadístico (control charts). Instituto Politécnico Nacional Maestría en Ingeniería en Seguridad y Tecnologías de la Información,  Computer and Information Systems Security/Information Assurance , Master 2012  – 2014 Detección de ataques distribuidos de denegación de servicio (DDoS) mediante análisis estadístico (control charts). Instituto Politécnico Nacional Maestría en Ingeniería en Seguridad y Tecnologías de la Información,  Computer and Information Systems Security/Information Assurance , Master 2012  – 2014 Detección de ataques distribuidos de denegación de servicio (DDoS) mediante análisis estadístico (control charts). Instituto Politécnico Nacional Master's degree,  Computer and Information Systems Security/Information Assurance 2012  – 2014 Investigación sobre técnicas de detección de ataques DDoS usando métodos estadísticos. Instituto Politécnico Nacional Master's degree,  Computer and Information Systems Security/Information Assurance 2012  – 2014 Investigación sobre técnicas de detección de ataques DDoS usando métodos estadísticos. Instituto Politécnico Nacional Master's degree,  Computer and Information Systems Security/Information Assurance 2012  – 2014 Investigación sobre técnicas de detección de ataques DDoS usando métodos estadísticos. ITESCO ITESCO ITESCO ITESCO ITESCO ITESCO ", "Skills Verilog VHDL C Perl TCL Unix Shell Scripting Matlab Assembly Language... FPGA ASIC Embedded Systems CMOS VLSI Digital Hardware Design Computer Security Hardware Security Embedded Systems... See 1+     See less Skills  Verilog VHDL C Perl TCL Unix Shell Scripting Matlab Assembly Language... FPGA ASIC Embedded Systems CMOS VLSI Digital Hardware Design Computer Security Hardware Security Embedded Systems... See 1+     See less Verilog VHDL C Perl TCL Unix Shell Scripting Matlab Assembly Language... FPGA ASIC Embedded Systems CMOS VLSI Digital Hardware Design Computer Security Hardware Security Embedded Systems... See 1+     See less Verilog VHDL C Perl TCL Unix Shell Scripting Matlab Assembly Language... FPGA ASIC Embedded Systems CMOS VLSI Digital Hardware Design Computer Security Hardware Security Embedded Systems... See 1+     See less ", "Summary • Ph.D., Computer Science. Dissertation on Security and Applied Cryptography \n• 12+ year industry experience. Ability to view, abstract and present security concepts through a business lens.  \n• Served as security researcher, validator, consultant, responder and lead for global accounts. \n• Research experience: Published several peer-reviewed articles on applied crypto in international journals, book chapters and conferences. Projects funded by the NSF, DHS, US Treasury. \n• Entrepreneurship: Received DHS phase-0 SBIR grant in 2007 \n• Work on applied crypto as archived on DBLP: http://www.informatik.uni-trier.de/~ley/pers/hd/c/Chakrabarti_0002:Saikat \n• Exposure to business plan development in small-business sector \n \n \nSpecialties: Hardware Security, Applied Cryptography, Information and Cyber Security Summary • Ph.D., Computer Science. Dissertation on Security and Applied Cryptography \n• 12+ year industry experience. Ability to view, abstract and present security concepts through a business lens.  \n• Served as security researcher, validator, consultant, responder and lead for global accounts. \n• Research experience: Published several peer-reviewed articles on applied crypto in international journals, book chapters and conferences. Projects funded by the NSF, DHS, US Treasury. \n• Entrepreneurship: Received DHS phase-0 SBIR grant in 2007 \n• Work on applied crypto as archived on DBLP: http://www.informatik.uni-trier.de/~ley/pers/hd/c/Chakrabarti_0002:Saikat \n• Exposure to business plan development in small-business sector \n \n \nSpecialties: Hardware Security, Applied Cryptography, Information and Cyber Security • Ph.D., Computer Science. Dissertation on Security and Applied Cryptography \n• 12+ year industry experience. Ability to view, abstract and present security concepts through a business lens.  \n• Served as security researcher, validator, consultant, responder and lead for global accounts. \n• Research experience: Published several peer-reviewed articles on applied crypto in international journals, book chapters and conferences. Projects funded by the NSF, DHS, US Treasury. \n• Entrepreneurship: Received DHS phase-0 SBIR grant in 2007 \n• Work on applied crypto as archived on DBLP: http://www.informatik.uni-trier.de/~ley/pers/hd/c/Chakrabarti_0002:Saikat \n• Exposure to business plan development in small-business sector \n \n \nSpecialties: Hardware Security, Applied Cryptography, Information and Cyber Security • Ph.D., Computer Science. Dissertation on Security and Applied Cryptography \n• 12+ year industry experience. Ability to view, abstract and present security concepts through a business lens.  \n• Served as security researcher, validator, consultant, responder and lead for global accounts. \n• Research experience: Published several peer-reviewed articles on applied crypto in international journals, book chapters and conferences. Projects funded by the NSF, DHS, US Treasury. \n• Entrepreneurship: Received DHS phase-0 SBIR grant in 2007 \n• Work on applied crypto as archived on DBLP: http://www.informatik.uni-trier.de/~ley/pers/hd/c/Chakrabarti_0002:Saikat \n• Exposure to business plan development in small-business sector \n \n \nSpecialties: Hardware Security, Applied Cryptography, Information and Cyber Security Experience Senior Security Researcher Intel Corporation April 2011  – Present (4 years 5 months) Portland, Oregon Area Business Org: Security Center of Excellence \nRoles: Researcher, consultant, lead (connectivity solutions), contributor to security response. Senior Information Security Architect Siemens ITS June 2008  –  April 2011  (2 years 11 months) Portland, Oregon Area • Security consultant and architect at Siemens IT Solutions and Services  \n• Primary external client: Nike Graduate Research Assistant University of Kentucky August 2005  –  May 2008  (2 years 10 months) • Focus: Applied Cryptography, Computer Security \n• Check DBLP for publications \n• Supervised three master’s projects \n• Supervised five master’s-level independent studies Co Founder Novothea 2007  –  2008  (1 year) Lexington, Kentucky Area • Co-founded tech start-up based on security and computer vision principles. \n• Second place in e-club competition.  \n• Granted DHS phase-0 SBIR grant. Graduate Teaching Assistant University of Kentucky January 2003  –  May 2005  (2 years 5 months) TA: \n1.\tDiscrete Mathematics: Taught recitations, guest lectures for four semesters (75% lectures, 25% recitation) \n2.\tIntroduction to Computers: Laboratory and grading responsibility for one semester. Systems Engineer Tata Consultancy Services August 1999  –  July 2002  (3 years) • Coder, developer -- various J2EE based solutions \n• Primary client -- General Electric (GE Corporate, Medical, etc.) Intern Siemens May 1998  –  July 1998  (3 months) Senior Security Researcher Intel Corporation April 2011  – Present (4 years 5 months) Portland, Oregon Area Business Org: Security Center of Excellence \nRoles: Researcher, consultant, lead (connectivity solutions), contributor to security response. Senior Security Researcher Intel Corporation April 2011  – Present (4 years 5 months) Portland, Oregon Area Business Org: Security Center of Excellence \nRoles: Researcher, consultant, lead (connectivity solutions), contributor to security response. Senior Information Security Architect Siemens ITS June 2008  –  April 2011  (2 years 11 months) Portland, Oregon Area • Security consultant and architect at Siemens IT Solutions and Services  \n• Primary external client: Nike Senior Information Security Architect Siemens ITS June 2008  –  April 2011  (2 years 11 months) Portland, Oregon Area • Security consultant and architect at Siemens IT Solutions and Services  \n• Primary external client: Nike Graduate Research Assistant University of Kentucky August 2005  –  May 2008  (2 years 10 months) • Focus: Applied Cryptography, Computer Security \n• Check DBLP for publications \n• Supervised three master’s projects \n• Supervised five master’s-level independent studies Graduate Research Assistant University of Kentucky August 2005  –  May 2008  (2 years 10 months) • Focus: Applied Cryptography, Computer Security \n• Check DBLP for publications \n• Supervised three master’s projects \n• Supervised five master’s-level independent studies Co Founder Novothea 2007  –  2008  (1 year) Lexington, Kentucky Area • Co-founded tech start-up based on security and computer vision principles. \n• Second place in e-club competition.  \n• Granted DHS phase-0 SBIR grant. Co Founder Novothea 2007  –  2008  (1 year) Lexington, Kentucky Area • Co-founded tech start-up based on security and computer vision principles. \n• Second place in e-club competition.  \n• Granted DHS phase-0 SBIR grant. Graduate Teaching Assistant University of Kentucky January 2003  –  May 2005  (2 years 5 months) TA: \n1.\tDiscrete Mathematics: Taught recitations, guest lectures for four semesters (75% lectures, 25% recitation) \n2.\tIntroduction to Computers: Laboratory and grading responsibility for one semester. Graduate Teaching Assistant University of Kentucky January 2003  –  May 2005  (2 years 5 months) TA: \n1.\tDiscrete Mathematics: Taught recitations, guest lectures for four semesters (75% lectures, 25% recitation) \n2.\tIntroduction to Computers: Laboratory and grading responsibility for one semester. Systems Engineer Tata Consultancy Services August 1999  –  July 2002  (3 years) • Coder, developer -- various J2EE based solutions \n• Primary client -- General Electric (GE Corporate, Medical, etc.) Systems Engineer Tata Consultancy Services August 1999  –  July 2002  (3 years) • Coder, developer -- various J2EE based solutions \n• Primary client -- General Electric (GE Corporate, Medical, etc.) Intern Siemens May 1998  –  July 1998  (3 months) Intern Siemens May 1998  –  July 1998  (3 months) Languages English Native or bilingual proficiency Spanish Elementary proficiency Bengali Native or bilingual proficiency Hindi Native or bilingual proficiency English Native or bilingual proficiency Spanish Elementary proficiency Bengali Native or bilingual proficiency Hindi Native or bilingual proficiency English Native or bilingual proficiency Spanish Elementary proficiency Bengali Native or bilingual proficiency Hindi Native or bilingual proficiency Native or bilingual proficiency Elementary proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Security Network Security Cryptography Computer Security Information Security Information Security... Penetration Testing Vulnerability Assessment Application Security Security Architecture... PCI DSS Computer Forensics C Computer Science Skills  Security Network Security Cryptography Computer Security Information Security Information Security... Penetration Testing Vulnerability Assessment Application Security Security Architecture... PCI DSS Computer Forensics C Computer Science Security Network Security Cryptography Computer Security Information Security Information Security... Penetration Testing Vulnerability Assessment Application Security Security Architecture... PCI DSS Computer Forensics C Computer Science Security Network Security Cryptography Computer Security Information Security Information Security... Penetration Testing Vulnerability Assessment Application Security Security Architecture... PCI DSS Computer Forensics C Computer Science Education University of Kentucky Doctor of Philosophy (Ph.D.),  Computer Science 2002  – 2008 • Dissertation: \"Efficient and Scalable Network Security Protocols based on LFSR Sequences'' Bengal Engineering and Science University, Shibpur BE,  Electrical Engineering 1995  – 1999 University of Kentucky Doctor of Philosophy (Ph.D.),  Computer Science 2002  – 2008 • Dissertation: \"Efficient and Scalable Network Security Protocols based on LFSR Sequences'' University of Kentucky Doctor of Philosophy (Ph.D.),  Computer Science 2002  – 2008 • Dissertation: \"Efficient and Scalable Network Security Protocols based on LFSR Sequences'' University of Kentucky Doctor of Philosophy (Ph.D.),  Computer Science 2002  – 2008 • Dissertation: \"Efficient and Scalable Network Security Protocols based on LFSR Sequences'' Bengal Engineering and Science University, Shibpur BE,  Electrical Engineering 1995  – 1999 Bengal Engineering and Science University, Shibpur BE,  Electrical Engineering 1995  – 1999 Bengal Engineering and Science University, Shibpur BE,  Electrical Engineering 1995  – 1999 Honors & Awards ", "Summary My goal is to contribute and professionally grow in the field of Hardware Security, Digital Design for Test (DfT), Embedded Security, EDA, FPGA and Microcontroller based Embedded Systems. Summary My goal is to contribute and professionally grow in the field of Hardware Security, Digital Design for Test (DfT), Embedded Security, EDA, FPGA and Microcontroller based Embedded Systems. My goal is to contribute and professionally grow in the field of Hardware Security, Digital Design for Test (DfT), Embedded Security, EDA, FPGA and Microcontroller based Embedded Systems. My goal is to contribute and professionally grow in the field of Hardware Security, Digital Design for Test (DfT), Embedded Security, EDA, FPGA and Microcontroller based Embedded Systems. Experience Security Researcher Intel Corporation December 2013  – Present (1 year 9 months) Jones Farm, Hillsboro, Oregon, USA Research Associate KU Leuven July 2013  –  December 2013  (6 months) ESAT/COSIC, KU Leuven Embedded Security, Secure Design for Testability for Cryptographic circuits, public-key cryptographic hardware implementation using hardware/software co-design and co-simulation techniques, lightweight hardware cryptography, side-channel attacks and countermeasures on secure digital circuits Research Assistant Katholieke Universiteit Leuven July 2009  –  June 2013  (4 years) COSIC Group Research Assistant K.U.Leuven: ESAT/COSIC July 2009  –  June 2013  (4 years) ESAT/COSIC, KU Leuven, Leuven, Belgium Research involved designing secure Design for Testability (DfT) infrastructure for cryptographic circuits & other secure hardware implementations. \n \nWorked in the Towards One European Test Solution (TOETS) project in the domain of secure testing during 2010-2012 and European COST action on Trustworthy Manufacturing and Utilization of Secure Devices project during 2012-2013. \n \nAlso involved in a project on Controller Area Network (CAN) & CAN+ security. \n \nPublished paper entitled \"A Scan Attack on Elliptic Curve Cryptosystems in presence of Industrial Design-for-Testability Structures,\" J. Da Rolt, A. Das, G. Di Natale, M. Flottes, B. Rouzeyre, and I. Verbauwhede, IEEE, 6 pages, In IEEE International Symposium on Defect and Fault Tolerance in VLSI and Nanotechnology Systems, Austin, Texas, U.S.A., Oct. 3-5, 2012. \n \nPresented paper entitled \"A New Scan Attack on RSA in Presence of Industrial Countermeasures,\" J. Da Rolt, A. Das, G. Di Natale, M. Flottes, B. Rouzeyre, and I. Verbauwhede, In Third International Workshop on Constructive Side-Channel Analysis and Design (COSADE 2012), Darmstadt, Germany, May 3-4, 2012, Lecture Notes in Computer Science LNCS Springer, Springer-Verlag, 16 pages, 2012. \n \nPresented paper entitled \"PUF-based Secure Test Wrapper Design for Cryptographic SoC Testing\", Amitabh Das, Ünal Kocaba¸, Ahmad-Reza Sadeghi, and Ingrid Verbauwhede, at IEEE Design Automation Test in Europe (DATE) 2012, Dresden, Germany, March 12-16, 2012. \n \nOral conference paper presentation entitled \"Challenge-Response based Secure Test Wrapper for testing Cryptographic Circuits\" at the 16th IEEE European Test Symposium (ETS) 2011 held at Norwegian University of Science & Technology (NTNU), Trondheim, Norway, May 23-26, 2011 \n \nPrevious versions presented at the Workshop on Information & Information Security (WiSSec) 2010 held at Radboud University, Nijmegen, the Nederlands, November 2010, and at the BCrypt PhD Day 2010 held at University of Ghent, Ghent, Belgium. Electronics & Instrumentation Engineer Bharat Heavy Electricals Limited March 2006  –  June 2007  (1 year 4 months) PCB Designing & Manufacturing, SCADA systems, PLCs, Distributed Control Systems, Solar Cell and Panel manufacturing, Power Diode manufacturing, defence Electronics, Industrial Instrumentation, Power Plant Maintenance and Modernization Assistant Systems Engineer Tata Consultancy Services November 2003  –  March 2006  (2 years 5 months) Unix Shell Scripting, Oracle PL/SQL, Oracle Applications 11i, J2EE, Cognos Data Warehousing Security Researcher Intel Corporation December 2013  – Present (1 year 9 months) Jones Farm, Hillsboro, Oregon, USA Security Researcher Intel Corporation December 2013  – Present (1 year 9 months) Jones Farm, Hillsboro, Oregon, USA Research Associate KU Leuven July 2013  –  December 2013  (6 months) ESAT/COSIC, KU Leuven Embedded Security, Secure Design for Testability for Cryptographic circuits, public-key cryptographic hardware implementation using hardware/software co-design and co-simulation techniques, lightweight hardware cryptography, side-channel attacks and countermeasures on secure digital circuits Research Associate KU Leuven July 2013  –  December 2013  (6 months) ESAT/COSIC, KU Leuven Embedded Security, Secure Design for Testability for Cryptographic circuits, public-key cryptographic hardware implementation using hardware/software co-design and co-simulation techniques, lightweight hardware cryptography, side-channel attacks and countermeasures on secure digital circuits Research Assistant Katholieke Universiteit Leuven July 2009  –  June 2013  (4 years) COSIC Group Research Assistant Katholieke Universiteit Leuven July 2009  –  June 2013  (4 years) COSIC Group Research Assistant K.U.Leuven: ESAT/COSIC July 2009  –  June 2013  (4 years) ESAT/COSIC, KU Leuven, Leuven, Belgium Research involved designing secure Design for Testability (DfT) infrastructure for cryptographic circuits & other secure hardware implementations. \n \nWorked in the Towards One European Test Solution (TOETS) project in the domain of secure testing during 2010-2012 and European COST action on Trustworthy Manufacturing and Utilization of Secure Devices project during 2012-2013. \n \nAlso involved in a project on Controller Area Network (CAN) & CAN+ security. \n \nPublished paper entitled \"A Scan Attack on Elliptic Curve Cryptosystems in presence of Industrial Design-for-Testability Structures,\" J. Da Rolt, A. Das, G. Di Natale, M. Flottes, B. Rouzeyre, and I. Verbauwhede, IEEE, 6 pages, In IEEE International Symposium on Defect and Fault Tolerance in VLSI and Nanotechnology Systems, Austin, Texas, U.S.A., Oct. 3-5, 2012. \n \nPresented paper entitled \"A New Scan Attack on RSA in Presence of Industrial Countermeasures,\" J. Da Rolt, A. Das, G. Di Natale, M. Flottes, B. Rouzeyre, and I. Verbauwhede, In Third International Workshop on Constructive Side-Channel Analysis and Design (COSADE 2012), Darmstadt, Germany, May 3-4, 2012, Lecture Notes in Computer Science LNCS Springer, Springer-Verlag, 16 pages, 2012. \n \nPresented paper entitled \"PUF-based Secure Test Wrapper Design for Cryptographic SoC Testing\", Amitabh Das, Ünal Kocaba¸, Ahmad-Reza Sadeghi, and Ingrid Verbauwhede, at IEEE Design Automation Test in Europe (DATE) 2012, Dresden, Germany, March 12-16, 2012. \n \nOral conference paper presentation entitled \"Challenge-Response based Secure Test Wrapper for testing Cryptographic Circuits\" at the 16th IEEE European Test Symposium (ETS) 2011 held at Norwegian University of Science & Technology (NTNU), Trondheim, Norway, May 23-26, 2011 \n \nPrevious versions presented at the Workshop on Information & Information Security (WiSSec) 2010 held at Radboud University, Nijmegen, the Nederlands, November 2010, and at the BCrypt PhD Day 2010 held at University of Ghent, Ghent, Belgium. Research Assistant K.U.Leuven: ESAT/COSIC July 2009  –  June 2013  (4 years) ESAT/COSIC, KU Leuven, Leuven, Belgium Research involved designing secure Design for Testability (DfT) infrastructure for cryptographic circuits & other secure hardware implementations. \n \nWorked in the Towards One European Test Solution (TOETS) project in the domain of secure testing during 2010-2012 and European COST action on Trustworthy Manufacturing and Utilization of Secure Devices project during 2012-2013. \n \nAlso involved in a project on Controller Area Network (CAN) & CAN+ security. \n \nPublished paper entitled \"A Scan Attack on Elliptic Curve Cryptosystems in presence of Industrial Design-for-Testability Structures,\" J. Da Rolt, A. Das, G. Di Natale, M. Flottes, B. Rouzeyre, and I. Verbauwhede, IEEE, 6 pages, In IEEE International Symposium on Defect and Fault Tolerance in VLSI and Nanotechnology Systems, Austin, Texas, U.S.A., Oct. 3-5, 2012. \n \nPresented paper entitled \"A New Scan Attack on RSA in Presence of Industrial Countermeasures,\" J. Da Rolt, A. Das, G. Di Natale, M. Flottes, B. Rouzeyre, and I. Verbauwhede, In Third International Workshop on Constructive Side-Channel Analysis and Design (COSADE 2012), Darmstadt, Germany, May 3-4, 2012, Lecture Notes in Computer Science LNCS Springer, Springer-Verlag, 16 pages, 2012. \n \nPresented paper entitled \"PUF-based Secure Test Wrapper Design for Cryptographic SoC Testing\", Amitabh Das, Ünal Kocaba¸, Ahmad-Reza Sadeghi, and Ingrid Verbauwhede, at IEEE Design Automation Test in Europe (DATE) 2012, Dresden, Germany, March 12-16, 2012. \n \nOral conference paper presentation entitled \"Challenge-Response based Secure Test Wrapper for testing Cryptographic Circuits\" at the 16th IEEE European Test Symposium (ETS) 2011 held at Norwegian University of Science & Technology (NTNU), Trondheim, Norway, May 23-26, 2011 \n \nPrevious versions presented at the Workshop on Information & Information Security (WiSSec) 2010 held at Radboud University, Nijmegen, the Nederlands, November 2010, and at the BCrypt PhD Day 2010 held at University of Ghent, Ghent, Belgium. Electronics & Instrumentation Engineer Bharat Heavy Electricals Limited March 2006  –  June 2007  (1 year 4 months) PCB Designing & Manufacturing, SCADA systems, PLCs, Distributed Control Systems, Solar Cell and Panel manufacturing, Power Diode manufacturing, defence Electronics, Industrial Instrumentation, Power Plant Maintenance and Modernization Electronics & Instrumentation Engineer Bharat Heavy Electricals Limited March 2006  –  June 2007  (1 year 4 months) PCB Designing & Manufacturing, SCADA systems, PLCs, Distributed Control Systems, Solar Cell and Panel manufacturing, Power Diode manufacturing, defence Electronics, Industrial Instrumentation, Power Plant Maintenance and Modernization Assistant Systems Engineer Tata Consultancy Services November 2003  –  March 2006  (2 years 5 months) Unix Shell Scripting, Oracle PL/SQL, Oracle Applications 11i, J2EE, Cognos Data Warehousing Assistant Systems Engineer Tata Consultancy Services November 2003  –  March 2006  (2 years 5 months) Unix Shell Scripting, Oracle PL/SQL, Oracle Applications 11i, J2EE, Cognos Data Warehousing Languages English Full professional proficiency Hindi Professional working proficiency Bengali Limited working proficiency Dutch Elementary proficiency English Full professional proficiency Hindi Professional working proficiency Bengali Limited working proficiency Dutch Elementary proficiency English Full professional proficiency Hindi Professional working proficiency Bengali Limited working proficiency Dutch Elementary proficiency Full professional proficiency Professional working proficiency Limited working proficiency Elementary proficiency Skills VHDL Embedded Systems FPGA VLSI Electronics EDA Integrated Circuit... Matlab LaTeX Algorithms Signal Processing C++ Simulations Programming Testing Verilog C ASIC Digital Signal... Digital Electronics Instrumentation Robotics Labview Simulink Simulation Research Pspice Electrical Engineering Assembly Xilinx Circuit Design Linux Java Automation SQL Cryptography Engineering Software Engineering Software Development Sensors R&D Digital Design Microcontrollers Embedded Software Mechatronics Windows Unix Hardware Security SoC security Secure testing See 35+     See less Skills  VHDL Embedded Systems FPGA VLSI Electronics EDA Integrated Circuit... Matlab LaTeX Algorithms Signal Processing C++ Simulations Programming Testing Verilog C ASIC Digital Signal... Digital Electronics Instrumentation Robotics Labview Simulink Simulation Research Pspice Electrical Engineering Assembly Xilinx Circuit Design Linux Java Automation SQL Cryptography Engineering Software Engineering Software Development Sensors R&D Digital Design Microcontrollers Embedded Software Mechatronics Windows Unix Hardware Security SoC security Secure testing See 35+     See less VHDL Embedded Systems FPGA VLSI Electronics EDA Integrated Circuit... Matlab LaTeX Algorithms Signal Processing C++ Simulations Programming Testing Verilog C ASIC Digital Signal... Digital Electronics Instrumentation Robotics Labview Simulink Simulation Research Pspice Electrical Engineering Assembly Xilinx Circuit Design Linux Java Automation SQL Cryptography Engineering Software Engineering Software Development Sensors R&D Digital Design Microcontrollers Embedded Software Mechatronics Windows Unix Hardware Security SoC security Secure testing See 35+     See less VHDL Embedded Systems FPGA VLSI Electronics EDA Integrated Circuit... Matlab LaTeX Algorithms Signal Processing C++ Simulations Programming Testing Verilog C ASIC Digital Signal... Digital Electronics Instrumentation Robotics Labview Simulink Simulation Research Pspice Electrical Engineering Assembly Xilinx Circuit Design Linux Java Automation SQL Cryptography Engineering Software Engineering Software Development Sensors R&D Digital Design Microcontrollers Embedded Software Mechatronics Windows Unix Hardware Security SoC security Secure testing See 35+     See less Education KU Leuven (formerly Katholieke Universiteit Leuven), Belgium Doctor in Engineering (PhD),  Electrical Engineering 2009  – 2013 Cryptographic circuits are vulnerable to various side-channel attacks that target their hardware implementations to extract secret information stored inside them. One such side-channel is the scan chain based Design-for-Test (DfT) infrastructure employed for thorough and faster testing of VLSI circuits. The PhD thesis first investigates the scan attack vulnerability of symmetric-key and public-key hardware implementations, and then presents suitable countermeasures to address the aforementioned trade-off between testability, security and test cost. The thesis presents scan attacks on hardware implementations of the symmetric-key block cipher AES and the public-key ciphers RSA and ECC in presence of advanced DfT structures. In addition, state-of-the-art power analysis side-channel and fault attack countermeasures are analyzed to evaluate whether they are suitable in warding off scan attacks. Another major contribution of the thesis is secure Cryptographic SoC Testing. Jadavpur University MTech,  Instrumentation & Electronics Engineering 2007  – 2009 Electronic Design and Digital Electronics Lab Faculty for BE 2nd year and BTech final year Instrumentation & Electronics Engineering students of Jadavpur University, Kolkata, India, teaching VHDL and FPGA based systems during 2008-2009 \n \nConducted Workshop on VHDL, FPGA and Microcontroller Based Embedded systems at Jadavpur University, Kolkata, India \n \nIEEE Conference Paper entitled \"Fast Prototyping of a Digital PID Controller on a FPGA Based Soft Core Micrcontroller for precision control of Armature Controlled DC Servo Motor\" published in IEEE Xplore after being presented successfully at the Industrial Electronics Conference (IECON) 2009 at Porto, Portugal between November 2-5, 2009. Activities and Societies:  Thesis Project on FPGA based Reconfigurable platforms:\nPrototyping of a Digital PID Controller on FPGA Based Soft-Core Microcontroller for precision control of Armature Controlled DC Servo Motor Indian Institute of Technology, Bombay Certificate Course,  Extensive Training in Embedded Systems & Robotic Applications 2008  – 2008 Jadavpur University Certificate Course,  VLSI Design & Microelectronics Technology 2008  – 2008 Kalyani Government Engineering College, University of Kalyani, West Bengal Bachelor of Technology (B.Tech),  Electronics & Communication Engineering 1999  – 2003 KU Leuven (formerly Katholieke Universiteit Leuven), Belgium Doctor in Engineering (PhD),  Electrical Engineering 2009  – 2013 Cryptographic circuits are vulnerable to various side-channel attacks that target their hardware implementations to extract secret information stored inside them. One such side-channel is the scan chain based Design-for-Test (DfT) infrastructure employed for thorough and faster testing of VLSI circuits. The PhD thesis first investigates the scan attack vulnerability of symmetric-key and public-key hardware implementations, and then presents suitable countermeasures to address the aforementioned trade-off between testability, security and test cost. The thesis presents scan attacks on hardware implementations of the symmetric-key block cipher AES and the public-key ciphers RSA and ECC in presence of advanced DfT structures. In addition, state-of-the-art power analysis side-channel and fault attack countermeasures are analyzed to evaluate whether they are suitable in warding off scan attacks. Another major contribution of the thesis is secure Cryptographic SoC Testing. KU Leuven (formerly Katholieke Universiteit Leuven), Belgium Doctor in Engineering (PhD),  Electrical Engineering 2009  – 2013 Cryptographic circuits are vulnerable to various side-channel attacks that target their hardware implementations to extract secret information stored inside them. One such side-channel is the scan chain based Design-for-Test (DfT) infrastructure employed for thorough and faster testing of VLSI circuits. The PhD thesis first investigates the scan attack vulnerability of symmetric-key and public-key hardware implementations, and then presents suitable countermeasures to address the aforementioned trade-off between testability, security and test cost. The thesis presents scan attacks on hardware implementations of the symmetric-key block cipher AES and the public-key ciphers RSA and ECC in presence of advanced DfT structures. In addition, state-of-the-art power analysis side-channel and fault attack countermeasures are analyzed to evaluate whether they are suitable in warding off scan attacks. Another major contribution of the thesis is secure Cryptographic SoC Testing. KU Leuven (formerly Katholieke Universiteit Leuven), Belgium Doctor in Engineering (PhD),  Electrical Engineering 2009  – 2013 Cryptographic circuits are vulnerable to various side-channel attacks that target their hardware implementations to extract secret information stored inside them. One such side-channel is the scan chain based Design-for-Test (DfT) infrastructure employed for thorough and faster testing of VLSI circuits. The PhD thesis first investigates the scan attack vulnerability of symmetric-key and public-key hardware implementations, and then presents suitable countermeasures to address the aforementioned trade-off between testability, security and test cost. The thesis presents scan attacks on hardware implementations of the symmetric-key block cipher AES and the public-key ciphers RSA and ECC in presence of advanced DfT structures. In addition, state-of-the-art power analysis side-channel and fault attack countermeasures are analyzed to evaluate whether they are suitable in warding off scan attacks. Another major contribution of the thesis is secure Cryptographic SoC Testing. Jadavpur University MTech,  Instrumentation & Electronics Engineering 2007  – 2009 Electronic Design and Digital Electronics Lab Faculty for BE 2nd year and BTech final year Instrumentation & Electronics Engineering students of Jadavpur University, Kolkata, India, teaching VHDL and FPGA based systems during 2008-2009 \n \nConducted Workshop on VHDL, FPGA and Microcontroller Based Embedded systems at Jadavpur University, Kolkata, India \n \nIEEE Conference Paper entitled \"Fast Prototyping of a Digital PID Controller on a FPGA Based Soft Core Micrcontroller for precision control of Armature Controlled DC Servo Motor\" published in IEEE Xplore after being presented successfully at the Industrial Electronics Conference (IECON) 2009 at Porto, Portugal between November 2-5, 2009. Activities and Societies:  Thesis Project on FPGA based Reconfigurable platforms:\nPrototyping of a Digital PID Controller on FPGA Based Soft-Core Microcontroller for precision control of Armature Controlled DC Servo Motor Jadavpur University MTech,  Instrumentation & Electronics Engineering 2007  – 2009 Electronic Design and Digital Electronics Lab Faculty for BE 2nd year and BTech final year Instrumentation & Electronics Engineering students of Jadavpur University, Kolkata, India, teaching VHDL and FPGA based systems during 2008-2009 \n \nConducted Workshop on VHDL, FPGA and Microcontroller Based Embedded systems at Jadavpur University, Kolkata, India \n \nIEEE Conference Paper entitled \"Fast Prototyping of a Digital PID Controller on a FPGA Based Soft Core Micrcontroller for precision control of Armature Controlled DC Servo Motor\" published in IEEE Xplore after being presented successfully at the Industrial Electronics Conference (IECON) 2009 at Porto, Portugal between November 2-5, 2009. Activities and Societies:  Thesis Project on FPGA based Reconfigurable platforms:\nPrototyping of a Digital PID Controller on FPGA Based Soft-Core Microcontroller for precision control of Armature Controlled DC Servo Motor Jadavpur University MTech,  Instrumentation & Electronics Engineering 2007  – 2009 Electronic Design and Digital Electronics Lab Faculty for BE 2nd year and BTech final year Instrumentation & Electronics Engineering students of Jadavpur University, Kolkata, India, teaching VHDL and FPGA based systems during 2008-2009 \n \nConducted Workshop on VHDL, FPGA and Microcontroller Based Embedded systems at Jadavpur University, Kolkata, India \n \nIEEE Conference Paper entitled \"Fast Prototyping of a Digital PID Controller on a FPGA Based Soft Core Micrcontroller for precision control of Armature Controlled DC Servo Motor\" published in IEEE Xplore after being presented successfully at the Industrial Electronics Conference (IECON) 2009 at Porto, Portugal between November 2-5, 2009. Activities and Societies:  Thesis Project on FPGA based Reconfigurable platforms:\nPrototyping of a Digital PID Controller on FPGA Based Soft-Core Microcontroller for precision control of Armature Controlled DC Servo Motor Indian Institute of Technology, Bombay Certificate Course,  Extensive Training in Embedded Systems & Robotic Applications 2008  – 2008 Indian Institute of Technology, Bombay Certificate Course,  Extensive Training in Embedded Systems & Robotic Applications 2008  – 2008 Indian Institute of Technology, Bombay Certificate Course,  Extensive Training in Embedded Systems & Robotic Applications 2008  – 2008 Jadavpur University Certificate Course,  VLSI Design & Microelectronics Technology 2008  – 2008 Jadavpur University Certificate Course,  VLSI Design & Microelectronics Technology 2008  – 2008 Jadavpur University Certificate Course,  VLSI Design & Microelectronics Technology 2008  – 2008 Kalyani Government Engineering College, University of Kalyani, West Bengal Bachelor of Technology (B.Tech),  Electronics & Communication Engineering 1999  – 2003 Kalyani Government Engineering College, University of Kalyani, West Bengal Bachelor of Technology (B.Tech),  Electronics & Communication Engineering 1999  – 2003 Kalyani Government Engineering College, University of Kalyani, West Bengal Bachelor of Technology (B.Tech),  Electronics & Communication Engineering 1999  – 2003 Honors & Awards EMECW15 Fellowship European Union February 2009 Recipient of the highly competitive European Union fellowship for PhD research - Erasmus Mundus External Cooperation Window (EMECW15) - Lot 15 for India University Gold Medal Jadavpur University, Kolkata, India December 2009 University Gold Medal for First standing in Masters of Technology in Instrumentation & Electronics Engineering of Jadavpur University, Kolkata, India, for the year 2009. JETTA Best Paper Award 2013 IEEE Test Technology Technical Council (TTTC), Springer, and IEEE Computer Society (CS). October 2014 Journal of Electronic Testing: Theory and Applications (JETTA) Best Paper Award for 2013 for journal paper entitled “Secure JTAG Implementation using Schnorr Protocol”, conferred at the International Test Conference (ITC) 2014, Seattle, Washington. Awarded by IEEE Test Technology Technical Council (TTTC) President, Dr. Yervant Zorian of Synopsys and jointly sponsored by Springer, IEEE TTTC and IEEE Computer Society (CS). Additional Honors & Awards Certificate(s) of Merit from De Nobili School, CMRI, Dhanbad, India, for top standing in Indian School Certificate Examinations (ISCE) 1999 and Indian Certificate of Secondary Education (ICSE) 1997. EMECW15 Fellowship European Union February 2009 Recipient of the highly competitive European Union fellowship for PhD research - Erasmus Mundus External Cooperation Window (EMECW15) - Lot 15 for India EMECW15 Fellowship European Union February 2009 Recipient of the highly competitive European Union fellowship for PhD research - Erasmus Mundus External Cooperation Window (EMECW15) - Lot 15 for India EMECW15 Fellowship European Union February 2009 Recipient of the highly competitive European Union fellowship for PhD research - Erasmus Mundus External Cooperation Window (EMECW15) - Lot 15 for India University Gold Medal Jadavpur University, Kolkata, India December 2009 University Gold Medal for First standing in Masters of Technology in Instrumentation & Electronics Engineering of Jadavpur University, Kolkata, India, for the year 2009. University Gold Medal Jadavpur University, Kolkata, India December 2009 University Gold Medal for First standing in Masters of Technology in Instrumentation & Electronics Engineering of Jadavpur University, Kolkata, India, for the year 2009. University Gold Medal Jadavpur University, Kolkata, India December 2009 University Gold Medal for First standing in Masters of Technology in Instrumentation & Electronics Engineering of Jadavpur University, Kolkata, India, for the year 2009. JETTA Best Paper Award 2013 IEEE Test Technology Technical Council (TTTC), Springer, and IEEE Computer Society (CS). October 2014 Journal of Electronic Testing: Theory and Applications (JETTA) Best Paper Award for 2013 for journal paper entitled “Secure JTAG Implementation using Schnorr Protocol”, conferred at the International Test Conference (ITC) 2014, Seattle, Washington. Awarded by IEEE Test Technology Technical Council (TTTC) President, Dr. Yervant Zorian of Synopsys and jointly sponsored by Springer, IEEE TTTC and IEEE Computer Society (CS). JETTA Best Paper Award 2013 IEEE Test Technology Technical Council (TTTC), Springer, and IEEE Computer Society (CS). October 2014 Journal of Electronic Testing: Theory and Applications (JETTA) Best Paper Award for 2013 for journal paper entitled “Secure JTAG Implementation using Schnorr Protocol”, conferred at the International Test Conference (ITC) 2014, Seattle, Washington. Awarded by IEEE Test Technology Technical Council (TTTC) President, Dr. Yervant Zorian of Synopsys and jointly sponsored by Springer, IEEE TTTC and IEEE Computer Society (CS). JETTA Best Paper Award 2013 IEEE Test Technology Technical Council (TTTC), Springer, and IEEE Computer Society (CS). October 2014 Journal of Electronic Testing: Theory and Applications (JETTA) Best Paper Award for 2013 for journal paper entitled “Secure JTAG Implementation using Schnorr Protocol”, conferred at the International Test Conference (ITC) 2014, Seattle, Washington. Awarded by IEEE Test Technology Technical Council (TTTC) President, Dr. Yervant Zorian of Synopsys and jointly sponsored by Springer, IEEE TTTC and IEEE Computer Society (CS). Additional Honors & Awards Certificate(s) of Merit from De Nobili School, CMRI, Dhanbad, India, for top standing in Indian School Certificate Examinations (ISCE) 1999 and Indian Certificate of Secondary Education (ICSE) 1997. Additional Honors & Awards Certificate(s) of Merit from De Nobili School, CMRI, Dhanbad, India, for top standing in Indian School Certificate Examinations (ISCE) 1999 and Indian Certificate of Secondary Education (ICSE) 1997. Additional Honors & Awards Certificate(s) of Merit from De Nobili School, CMRI, Dhanbad, India, for top standing in Indian School Certificate Examinations (ISCE) 1999 and Indian Certificate of Secondary Education (ICSE) 1997. ", "Experience Security Researcher Intel Corporation November 2013  – Present (1 year 10 months) Portland, Oregon Area RTL Design Engineer Intel Corporation July 2012  –  November 2013  (1 year 5 months) Phoenix, Arizona Area Ad Hoc Networking Systems Engineer General Dynamics C4 Systems January 2012  –  July 2012  (7 months) Scottsdale, AZ ASIC Verification/Design Engineer General Dynamics C4 Systems April 2004  –  December 2011  (7 years 9 months) VLSI Design Engineer Motorola SPS May 1998  –  April 2004  (6 years) Security Researcher Intel Corporation November 2013  – Present (1 year 10 months) Portland, Oregon Area Security Researcher Intel Corporation November 2013  – Present (1 year 10 months) Portland, Oregon Area RTL Design Engineer Intel Corporation July 2012  –  November 2013  (1 year 5 months) Phoenix, Arizona Area RTL Design Engineer Intel Corporation July 2012  –  November 2013  (1 year 5 months) Phoenix, Arizona Area Ad Hoc Networking Systems Engineer General Dynamics C4 Systems January 2012  –  July 2012  (7 months) Scottsdale, AZ Ad Hoc Networking Systems Engineer General Dynamics C4 Systems January 2012  –  July 2012  (7 months) Scottsdale, AZ ASIC Verification/Design Engineer General Dynamics C4 Systems April 2004  –  December 2011  (7 years 9 months) ASIC Verification/Design Engineer General Dynamics C4 Systems April 2004  –  December 2011  (7 years 9 months) VLSI Design Engineer Motorola SPS May 1998  –  April 2004  (6 years) VLSI Design Engineer Motorola SPS May 1998  –  April 2004  (6 years) Education Arizona State University Ph.D.,  Computer Science 2006  – 2013 University of Waterloo MASc,  Electrical and Computer Engineering 2001  – 2003 Arizona State University B.S.E.,  Electrical Engineering 1996  – 2000 Arizona State University Ph.D.,  Computer Science 2006  – 2013 Arizona State University Ph.D.,  Computer Science 2006  – 2013 Arizona State University Ph.D.,  Computer Science 2006  – 2013 University of Waterloo MASc,  Electrical and Computer Engineering 2001  – 2003 University of Waterloo MASc,  Electrical and Computer Engineering 2001  – 2003 University of Waterloo MASc,  Electrical and Computer Engineering 2001  – 2003 Arizona State University B.S.E.,  Electrical Engineering 1996  – 2000 Arizona State University B.S.E.,  Electrical Engineering 1996  – 2000 Arizona State University B.S.E.,  Electrical Engineering 1996  – 2000 ", "Experience Security Researcher Intel Corporation May 2011  – Present (4 years 4 months) Hillsboro, OR Graduate Research Assistant Portland State University September 2010  –  March 2011  (7 months) Portland, Oregon Area Software Engineer Channelmatter January 2010  –  September 2010  (9 months) Portland, Oregon Area Software Engineer MyStrands July 2008  –  August 2009  (1 year 2 months) Corvallis, Oregon Area Intern MyStrands March 2008  –  July 2008  (5 months) Corvallis, Oregon Area REU for TaskTracer Project Oregon State University, School of EECS October 2006  –  March 2008  (1 year 6 months) Corvallis, Oregon Area Security Researcher Intel Corporation May 2011  – Present (4 years 4 months) Hillsboro, OR Security Researcher Intel Corporation May 2011  – Present (4 years 4 months) Hillsboro, OR Graduate Research Assistant Portland State University September 2010  –  March 2011  (7 months) Portland, Oregon Area Graduate Research Assistant Portland State University September 2010  –  March 2011  (7 months) Portland, Oregon Area Software Engineer Channelmatter January 2010  –  September 2010  (9 months) Portland, Oregon Area Software Engineer Channelmatter January 2010  –  September 2010  (9 months) Portland, Oregon Area Software Engineer MyStrands July 2008  –  August 2009  (1 year 2 months) Corvallis, Oregon Area Software Engineer MyStrands July 2008  –  August 2009  (1 year 2 months) Corvallis, Oregon Area Intern MyStrands March 2008  –  July 2008  (5 months) Corvallis, Oregon Area Intern MyStrands March 2008  –  July 2008  (5 months) Corvallis, Oregon Area REU for TaskTracer Project Oregon State University, School of EECS October 2006  –  March 2008  (1 year 6 months) Corvallis, Oregon Area REU for TaskTracer Project Oregon State University, School of EECS October 2006  –  March 2008  (1 year 6 months) Corvallis, Oregon Area Skills Software Engineering Skills  Software Engineering Software Engineering Software Engineering Education Portland State University Master of Science (M.S.),  Computer Science 2009  – 2011 Oregon State University Bachelor of Science (B.S.),  Computer Science 2005  – 2008 Portland State University Master of Science (M.S.),  Computer Science 2009  – 2011 Portland State University Master of Science (M.S.),  Computer Science 2009  – 2011 Portland State University Master of Science (M.S.),  Computer Science 2009  – 2011 Oregon State University Bachelor of Science (B.S.),  Computer Science 2005  – 2008 Oregon State University Bachelor of Science (B.S.),  Computer Science 2005  – 2008 Oregon State University Bachelor of Science (B.S.),  Computer Science 2005  – 2008 ", "Experience Security Researcher Intel Corporation August 2013  – Present (2 years 1 month) Sr. Research Scientist Wave Systems Corporation June 2011  –  August 2013  (2 years 3 months) Senior Researcher Fujitsu Laboratories of America December 2001  –  May 2011  (9 years 6 months) Senior System Architect Signafor, Inc October 2000  –  November 2001  (1 year 2 months) Senior Software Engineer Inrange Technologies July 1999  –  October 2000  (1 year 4 months) Senior Network Engineer Mitre Corporation January 1999  –  July 1999  (7 months) Software Engineer Computer Sciences Corporation June 1992  –  January 1999  (6 years 8 months) Programmer/Analyst Arist Corporation December 1991  –  April 1992  (5 months) Security Researcher Intel Corporation August 2013  – Present (2 years 1 month) Security Researcher Intel Corporation August 2013  – Present (2 years 1 month) Sr. Research Scientist Wave Systems Corporation June 2011  –  August 2013  (2 years 3 months) Sr. Research Scientist Wave Systems Corporation June 2011  –  August 2013  (2 years 3 months) Senior Researcher Fujitsu Laboratories of America December 2001  –  May 2011  (9 years 6 months) Senior Researcher Fujitsu Laboratories of America December 2001  –  May 2011  (9 years 6 months) Senior System Architect Signafor, Inc October 2000  –  November 2001  (1 year 2 months) Senior System Architect Signafor, Inc October 2000  –  November 2001  (1 year 2 months) Senior Software Engineer Inrange Technologies July 1999  –  October 2000  (1 year 4 months) Senior Software Engineer Inrange Technologies July 1999  –  October 2000  (1 year 4 months) Senior Network Engineer Mitre Corporation January 1999  –  July 1999  (7 months) Senior Network Engineer Mitre Corporation January 1999  –  July 1999  (7 months) Software Engineer Computer Sciences Corporation June 1992  –  January 1999  (6 years 8 months) Software Engineer Computer Sciences Corporation June 1992  –  January 1999  (6 years 8 months) Programmer/Analyst Arist Corporation December 1991  –  April 1992  (5 months) Programmer/Analyst Arist Corporation December 1991  –  April 1992  (5 months) Education University of Maryland College Park BS University of Maryland College Park MS University of Maryland College Park PhD University of Maryland College Park BS University of Maryland College Park BS University of Maryland College Park BS University of Maryland College Park MS University of Maryland College Park MS University of Maryland College Park MS University of Maryland College Park PhD University of Maryland College Park PhD University of Maryland College Park PhD ", "Experience Security Researcher Intel Corporation April 2015  – Present (5 months) Product Development Engineer Intel Corporation July 2013  –  April 2015  (1 year 10 months) Engineering Intern Intel Corporation June 2012  –  September 2012  (4 months) Aloha, OR Staff Technician Southwest Research Institute May 1998  –  June 2009  (11 years 2 months) San Antonio, TX Security Researcher Intel Corporation April 2015  – Present (5 months) Security Researcher Intel Corporation April 2015  – Present (5 months) Product Development Engineer Intel Corporation July 2013  –  April 2015  (1 year 10 months) Product Development Engineer Intel Corporation July 2013  –  April 2015  (1 year 10 months) Engineering Intern Intel Corporation June 2012  –  September 2012  (4 months) Aloha, OR Engineering Intern Intel Corporation June 2012  –  September 2012  (4 months) Aloha, OR Staff Technician Southwest Research Institute May 1998  –  June 2009  (11 years 2 months) San Antonio, TX Staff Technician Southwest Research Institute May 1998  –  June 2009  (11 years 2 months) San Antonio, TX Skills Matlab Microsoft Office C Microsoft Excel AutoCAD Electronics VHDL Windows Programming HTML C++ C# LTSpice PHP Perl Linux LibreOffice JavaScript Circuit Design Analog Circuit Design Digital Circuit Design MySQL SQL Circuit Analysis Protel PCB layout design Schematic Capture RF design Altium Designer Electrical Engineering PCB design Soldering See 17+     See less Skills  Matlab Microsoft Office C Microsoft Excel AutoCAD Electronics VHDL Windows Programming HTML C++ C# LTSpice PHP Perl Linux LibreOffice JavaScript Circuit Design Analog Circuit Design Digital Circuit Design MySQL SQL Circuit Analysis Protel PCB layout design Schematic Capture RF design Altium Designer Electrical Engineering PCB design Soldering See 17+     See less Matlab Microsoft Office C Microsoft Excel AutoCAD Electronics VHDL Windows Programming HTML C++ C# LTSpice PHP Perl Linux LibreOffice JavaScript Circuit Design Analog Circuit Design Digital Circuit Design MySQL SQL Circuit Analysis Protel PCB layout design Schematic Capture RF design Altium Designer Electrical Engineering PCB design Soldering See 17+     See less Matlab Microsoft Office C Microsoft Excel AutoCAD Electronics VHDL Windows Programming HTML C++ C# LTSpice PHP Perl Linux LibreOffice JavaScript Circuit Design Analog Circuit Design Digital Circuit Design MySQL SQL Circuit Analysis Protel PCB layout design Schematic Capture RF design Altium Designer Electrical Engineering PCB design Soldering See 17+     See less Education Portland State University Bachelor of Science (B.S.),  Electrical and Electronics Engineering 2009  – 2013 Portland State University Bachelor of Science (B.S.),  Electrical and Electronics Engineering 2009  – 2013 Portland State University Bachelor of Science (B.S.),  Electrical and Electronics Engineering 2009  – 2013 Portland State University Bachelor of Science (B.S.),  Electrical and Electronics Engineering 2009  – 2013 ", "Summary Interested in all aspects of information security, especially in vulnerability research and penetration testing. \n \nSpecialties:  \n(*) Reverse engineering, \n(*) Code review, \n(*) Web applications security, \n(*) Incidents response, \n(*) Digital forensics, \n(*) IT Security Summary Interested in all aspects of information security, especially in vulnerability research and penetration testing. \n \nSpecialties:  \n(*) Reverse engineering, \n(*) Code review, \n(*) Web applications security, \n(*) Incidents response, \n(*) Digital forensics, \n(*) IT Security Interested in all aspects of information security, especially in vulnerability research and penetration testing. \n \nSpecialties:  \n(*) Reverse engineering, \n(*) Code review, \n(*) Web applications security, \n(*) Incidents response, \n(*) Digital forensics, \n(*) IT Security Interested in all aspects of information security, especially in vulnerability research and penetration testing. \n \nSpecialties:  \n(*) Reverse engineering, \n(*) Code review, \n(*) Web applications security, \n(*) Incidents response, \n(*) Digital forensics, \n(*) IT Security Experience Security Researcher Intel Corporation February 2014  – Present (1 year 7 months) Computer and Network Security Specialist Defense Industry May 2009  –  February 2014  (4 years 10 months) (*) Security researching \n(*) Web app pen testing \n(*) SIEM-SOC planning and designing \n(*) Incidents response Security Research and Development (R&D) team leader Israeli Air Force January 2006  –  December 2008  (3 years) (*) IAF CERT member \n(*) Security tools development \n(*) Designing and setting up digital forensics lab  \n(*) Security trainer Security Researcher Intel Corporation February 2014  – Present (1 year 7 months) Security Researcher Intel Corporation February 2014  – Present (1 year 7 months) Computer and Network Security Specialist Defense Industry May 2009  –  February 2014  (4 years 10 months) (*) Security researching \n(*) Web app pen testing \n(*) SIEM-SOC planning and designing \n(*) Incidents response Computer and Network Security Specialist Defense Industry May 2009  –  February 2014  (4 years 10 months) (*) Security researching \n(*) Web app pen testing \n(*) SIEM-SOC planning and designing \n(*) Incidents response Security Research and Development (R&D) team leader Israeli Air Force January 2006  –  December 2008  (3 years) (*) IAF CERT member \n(*) Security tools development \n(*) Designing and setting up digital forensics lab  \n(*) Security trainer Security Research and Development (R&D) team leader Israeli Air Force January 2006  –  December 2008  (3 years) (*) IAF CERT member \n(*) Security tools development \n(*) Designing and setting up digital forensics lab  \n(*) Security trainer Languages English Full professional proficiency Hebrew Native or bilingual proficiency English Full professional proficiency Hebrew Native or bilingual proficiency English Full professional proficiency Hebrew Native or bilingual proficiency Full professional proficiency Native or bilingual proficiency Skills Penetration Testing Network Security Information Security Security Reverse Engineering Security Research Digital Forensics Web Applications Information Security... Computer Security Vulnerability Assessment Application Security TCP/IP Firewalls System Architecture IPS Web Application Security See 2+     See less Skills  Penetration Testing Network Security Information Security Security Reverse Engineering Security Research Digital Forensics Web Applications Information Security... Computer Security Vulnerability Assessment Application Security TCP/IP Firewalls System Architecture IPS Web Application Security See 2+     See less Penetration Testing Network Security Information Security Security Reverse Engineering Security Research Digital Forensics Web Applications Information Security... Computer Security Vulnerability Assessment Application Security TCP/IP Firewalls System Architecture IPS Web Application Security See 2+     See less Penetration Testing Network Security Information Security Security Reverse Engineering Security Research Digital Forensics Web Applications Information Security... Computer Security Vulnerability Assessment Application Security TCP/IP Firewalls System Architecture IPS Web Application Security See 2+     See less Education Technion-Machon Technologi Le' Israel BSC,  Computer Science 2008  – 2011 Excellence award. Technion-Machon Technologi Le' Israel BSC,  Computer Science 2008  – 2011 Excellence award. Technion-Machon Technologi Le' Israel BSC,  Computer Science 2008  – 2011 Excellence award. Technion-Machon Technologi Le' Israel BSC,  Computer Science 2008  – 2011 Excellence award. "]}